{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3436",
  "eid" : "c69d3280-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778412968,
  "textBody" : "The Symphony No. 9 in D minor, Op. 125, is the final complete symphony by the German composer Ludwig van Beethoven, composed between 1822 and 1824. It was first performed in Vienna on 7 May 1824. The symphony is one of the best-known works in common practice music. It is widely viewed by critics as one of Beethoven's greatest works, the pinnacle of musical Classicism, and one of the greatest compositions in the western musical canon. In the 2010s, it stands as one of the most performed symphonies in the world.[http://www.lansingstatejournal.com/story/entertainment/music/2016/11/02/lansing-symphony-orchestra-perform-joyful-beethovens-th/93156368/ \"Lansing Symphony Orchestra to perform joyful Beethoven’s 5th\"] by Ken Glickman, Lansing State Journal, 2 November 2016[https://www.gfsymphony.org/beethoven-s-ninth-ode-to-joy \"Beethoven's Ninth: 'Ode to Joy'\"], Great Falls Symphony, 2017/18 announcement\n\nThe symphony was the first example of a major composer using voices in a symphonyBonds, Mark Evan, \"Symphony: II. The 19th century\", The New Grove Dictionary of Music and Musicians, Second Edition (London: Macmillan, 2001), 29 vols. , 24:837. (thus making it a choral symphony). The words are sung during the final movement by four vocal soloists and a chorus. They were taken from the \"Ode to Joy\", a poem written by Friedrich Schiller in 1785 and revised in 1803, with text additions made by the composer.\n\nIn 2001, Beethoven's original, hand-written manuscript of the score, held by the Berlin State Library, was added to the United Nations Memory of the World Programme Heritage list, becoming the first musical score so honoured.[http://www.unesco.org/new/en/communication-and-information/memory-of-the-world/register/full-list-of-registered-heritage/registered-heritage-page-5/ludwig-van-beethoven-symphony-no-9-d-minor-op-125/ Memory of the World (2001) – Ludwig van Beethoven: Symphony No 9, D minor, Op. 125]\n\nHistory\n\nComposition\n\nThe Philharmonic Society of London originally commissioned the symphony in 1817.Solomon, Maynard. Beethoven. New York: Schirmer Books, 1997, p. 251. The main composition work was done between autumn 1822 and the completion of the autograph in February 1824.Breitkopf Urtext, Beethoven: [http://www.breitkopf.com/feature/download/3738/3667 Symphonie Nr. 9 d-moll] , op. 125, pbl.: Hauschild, Peter, p. VIII The symphony emerged from other pieces by Beethoven that, while completed works in their own right, are also in some sense \"sketches\" (rough outlines) for the future symphony. The Choral Fantasy Opus. 80 (1808), basically a piano concerto movement, brings in a choir and vocal soloists near the end for the climax. The vocal forces sing a theme first played instrumentally, and this theme is reminiscent of the corresponding theme in the Ninth Symphony (for a detailed comparison, see Choral Fantasy).\n\nGoing further back, an earlier version of the Choral Fantasy theme is found in the song \"Gegenliebe\" (Returned Love) for piano and high voice, which dates from before 1795.Hopkins (1981, 249) According to Robert W. Gutman, Mozart's K. 222 Offertory in D minor, \"Misericordias Domini\", written in 1775, contains a melody that foreshadows \"Ode to Joy\".Robert W. Gutman, Mozart: A Cultural Biography, 1999, p. 344\n\nPremiere\n\nAlthough his major works had primarily been premiered in Vienna, Beethoven was keen to have his latest composition performed in Berlin as soon as possible after finishing it, as he thought that musical taste in Vienna had become dominated by Italian composers such as Rossini.Sachs, Harvey (2010), The Ninth: Beethoven and the World in 1824, Faber When his friends and financiers heard this, they urged him to premiere the symphony in Vienna in the form of a petition signed by a number of prominent Viennese music patrons and performers.\n\nBeethoven was flattered by the adoration of Vienna, so the Ninth Symphony was premiered on 7 May 1824 in the Theater am Kärntnertor in Vienna along with the overture The Consecration of the House () and three parts of the Missa solemnis (the Kyrie, Credo, and Agnus Dei). This was the composer's first onstage appearance in 12 years; the hall was packed with an eager audience and a number of musicians.Levy, David Benjamin. Beethoven: The Ninth Symphony. Yale University Press 2003.\n\nThe premiere of Symphony No. 9 involved the largest orchestra ever assembled by Beethoven and required the combined efforts of the Kärntnertor house orchestra, the Vienna Music Society (Gesellschaft der Musikfreunde), and a select group of capable amateurs. While no complete list of premiere performers exists, many of Vienna's most elite performers are known to have participated.Kelly, Thomas Forrest (2000). First Nights: Five Musical Premiers (Chapter 3). Yale University Press, 2001.\n\nThe soprano and alto parts were sung by two famous young singers: Henriette Sontag and Caroline Unger. German soprano Henriette Sontag was 18 years old when Beethoven personally recruited her to perform in the premiere of the Ninth.Elson, Louis, Chief Editor. University Musical Encyclopedia of Vocal Music. University Society, New York, 1912Life of Henriette Sontag, Countess de Rossi. (Various Authors) Stringer & Townsend, publishers. New York, 1852. Also personally recruited by Beethoven, 20-year-old contralto Caroline Unger, a native of Vienna, had gained critical praise in 1821 appearing in Rossini's Tancredi. After performing in Beethoven's 1824 premiere, Unger then found fame in Italy and Paris. Italian composers Donizetti and Bellini were known to have written roles specifically for her voice.Kennedy, Michael and Bourne, Joyce (1996). The Concise Oxford Dictionary of Music. Oxford University Press, 2007. Anton Haizinger and Joseph Seipelt sang the tenor and bass parts, respectively.\n\nAlthough the performance was officially directed by Michael Umlauf, the theatre's Kapellmeister, Beethoven shared the stage with him. However, two years earlier, Umlauf had watched as the composer's attempt to conduct a dress rehearsal of his opera Fidelio ended in disaster. So this time, he instructed the singers and musicians to ignore the almost totally deaf Beethoven. At the beginning of every part, Beethoven, who sat by the stage, gave the tempos. He was turning the pages of his score and beating time for an orchestra he could not hear.\n\nThere are a number of anecdotes about the premiere of the Ninth. Based on the testimony of the participants, there are suggestions that it was underrehearsed (there were only two full rehearsals) and rather scrappy in execution. On the other hand, the premiere was a great success. In any case, Beethoven was not to blame, as violinist Joseph Böhm recalled:\n\nWhen the audience applauded—testimonies differ over whether at the end of the scherzo or symphony—Beethoven was several measures off and still conducting. Because of that, the contralto Caroline Unger walked over and turned Beethoven around to accept the audience's cheers and applause. According to the critic for the Theater-Zeitung, \"[t]he public received the musical hero with the utmost respect and sympathy, listened to his wonderful, gigantic creations with the most absorbed attention and broke out in jubilant applause, often during sections, and repeatedly at the end of them.\" The audience acclaimed him through standing ovations five times; there were handkerchiefs in the air, hats, raised hands, so that Beethoven, who could not hear the applause, could at least see the ovations.\n\nEditions\n\nThe first German edition was printed by B. Schott's Söhne (Mainz) in 1826. The Breitkopf & Härtel edition dating from 1864 has been used widely by orchestras. In 1997, Bärenreiter published an edition by Jonathan Del Mar. According to Del Mar, this edition corrects nearly 3,000 mistakes in the Breitkopf edition, some of which were \"remarkable\". David Levy, however, criticized this edition, saying that it could create \"quite possibly false\" traditions. Breitkopf also published a new edition by Peter Hauschild in 2005.\n\nInstrumentation\n\nThe symphony is scored for the following orchestra. These are by far the largest forces needed for any Beethoven symphony; at the premiere, Beethoven augmented them further by assigning two players to each wind part.Thayer, Alexander Wheelock. Thayer's Life of Beethoven. Revised and edited by Elliott Forbes. (Princeton, New Jersey: Princeton University Press, 1973), p. 905.\n\nWoodwinds\nPiccolo (fourth movement only)\n2 Flutes\n2 Oboes\n2 Clarinets in A, B and C\n2 Bassoons\nContrabassoon (fourth movement only)\n\nBrass\n2 Horns (1 and 2) in D and B\n2 Horns (3 and 4) in B (bass), B and E\n2 Trumpets in D and B\n3 Trombones (alto, tenor, and bass; second and fourth movements only)\n\nPercussion\nTimpani\nBass drum (fourth movement only)\nTriangle (fourth movement only)\nCymbals (fourth movement only)\n\nVoices (fourth movement only)\nSoprano solo\nAlto solo\nTenor solo\nBass solo\nSATB choir (tenor briefly divides)\n\nStrings\nViolins I, II\nViolas\nCellos\nDouble basses\n\nForm\n\nThe symphony is in four movements. The structure of each movement is as follows:\n\nBeethoven changes the usual pattern of Classical symphonies in placing the scherzo movement before the slow movement. In symphonies, slow movements are usually placed before scherzo.Jackson 1999, 26; Stein 1979, 106 This was the first time he did this in a symphony, although he had done so in some previous works, including the String Quartet Op. 18 no. 5, the \"Archduke\" piano trio Op. 97, the Hammerklavier piano sonata Op. 106. Haydn, too, had used this arrangement in a number of his own works such as the String Quartet No. 30 in E major.\n\nI. Allegro ma non troppo, un poco maestoso \n\nThe first movement is in sonata form without an exposition repeat. It begins with open fifths (A and E) played pianissimo by tremolo strings, steadily building up until the first main theme in D minor at m. 17.\n\n    \\relative c {\n        \\set Staff.midiInstrument = #\"violin\"\n        \\set Score.tempoHideNote ##t \\tempo 4 \n 88\n        \\key d \\minor\n        \\time 2/4\n        \\set Score.currentBarNumber = #17\n\n        \\partial 32 d32\\ff^\\markup \"First theme\"\n        a4~ a8.. f32\n        d8.. a32 f8. a32( f)\n        d4~ d16 f'-. e-. d-.\n        a'8-. g-. e-. a-.\n        d,8.\\sf\n    }\n\nThe opening, with its perfect fifth quietly emerging, resembles the sound of an orchestra tuning up.\n\nAt the outset of the recapitulation (which repeats the main melodic themes) in m. 301, the theme returns, this time played fortissimo and in D major, rather than D minor. The movement ends with a massive coda that takes up nearly a quarter of the movement, as in Beethoven's Third and Fifth Symphonies.\n\nA typical performance lasts about 15 minutes.\n\nII. Molto vivace \n\nThe second movement is a scherzo and trio. Like the first movement, the scherzo is in D minor, with the introduction bearing a passing resemblance to the opening theme of the first movement, a pattern also found in the Hammerklavier piano sonata, written a few years earlier. At times during the piece, Beethoven specifies one downbeat every three measures—perhaps because of the fast tempo—with the direction ritmo di tre battute (rhythm of three beats) and one beat every four measures with the direction ritmo di quattro battute (rhythm of four beats). Beethoven had been criticized before for failing to adhere to standard Classical form for his compositions. He used this movement to answer his critics. Normally, a scherzo is in triple time. Beethoven wrote this piece in triple time but punctuated it in a way that, when coupled with the tempo, makes it sound as if it is in quadruple time.\n\nWhile adhering to the standard compound ternary design (three-part structure) of a dance movement (scherzo-trio-scherzo or minuet-trio-minuet), the scherzo section has an elaborate internal structure; it is a complete sonata form. Within this sonata form, the first group of the exposition (the statement of the main melodic themes) starts out with a fugue in D minor on the subject below.\n\n    \\relative c {\n        \\set Staff.midiInstrument = #\"violin\"\n        \\set Score.tempoHideNote ##t \\tempo 2. \n 116\n        \\key d \\minor\n        \\time 3/4\n        \\set Score.currentBarNumber = #9\n        \\bar \"\"\n\n        a4.\\pp^\\markup \"First theme\" a,8 a4\n        d4-. e-. f-.\n        e-. f-. g-.\n        f-. e-. d-.\n        c b a\n        gis a b\n        a gis a\n    }\n\nFor the second subject, it modulates to the unusual key of C major. The exposition then repeats before a short development section, where Beethoven explores other ideas. The recapitulation (repeating of the melodic themes heard in the opening of the movement) further develops the exposition's themes, also containing timpani solos. A new development section leads to the repeat of the recapitulation, and the scherzo concludes with a brief codetta.\n\nThe contrasting trio section is in D major and in duple time. The trio is the first time the trombones play. Following the trio, the second occurrence of the scherzo, unlike the first, plays through without any repetition, after which there is a brief reprise of the trio, and the movement ends with an abrupt coda.\n\nThe duration of the movement is about 12 minutes, but this may vary depending on whether two frequently omitted repeats are played.\n\nIII. Adagio molto e cantabile \n\nThe third movement is a lyrical, slow movement in B major, which is a minor sixth away from the symphony's main key of D minor. It is in a double variation form, with each pair of variations progressively elaborating the rhythm and melodic ideas. The first variation, like the theme, is in  time, the second in . The variations are separated by passages in , the first in D major, the second in G major, the third in E major, the fourth in F major, and the fifth in B major. The final variation is twice interrupted by episodes in which loud fanfares from the full orchestra are answered by octaves by the first violins. A prominent French horn solo is assigned to the fourth player.\n\nA typical performance lasts about 16 minutes.\n\nIV. Finale\n\nThe famous choral finale is Beethoven's musical representation of universal brotherhood based on the 'Ode to Joy' theme.\n\n\\new Score {\n  \\new Staff {\n    \\relative c {\n      \\set Staff.instrumentName = #\"Vc.\"\n      \\set Staff.midiInstrument = #\"cello\"\n      \\set Score.currentBarNumber = #92\n      \\time 4/4\n      \\key d \\major\n      \\clef bass\n      \\tempo 2 = 60\n      \\omit Score.MetronomeMark\n      \\bar \"\"\n        fis2\\p^\\markup {  \\halign #-0.5 \\bold \"Allegro assai\"}( g4 a) | a4( g fis e) | d2( e4 fis) | fis4.( e8) e2 |\n        fis2( g4 a) | a4( g fis e) | d2( e4 fis) | e4.( d8) d2 | \\break\n        e( fis4 d) | e( fis8 g fis4 d) | e( fis8 g fis4 e) | d( e a,) fis'~ | \n        fis fis( g a) | a( g fis e) | d2( e4 fis) | e4.( d8) d2\n    }\n  }\n}\n\nThe movement starts with an introduction in which musical material from each of the preceding three movements – though none are literal quotations of previous music – are successively presented and then dismissed by instrumental recitatives played by the low strings. Following this, the 'Ode to Joy' theme is finally introduced by the cellos and double basses. After three instrumental variations on this theme, the human voice is presented for the first time in the symphony by the baritone soloist, who sings words written by Beethoven himself: O Freunde, nicht diese Töne!' Sondern laßt uns angenehmere anstimmen, und freudenvollere. (\"Oh friends, not these sounds! Let us instead strike up more pleasing and more joyful ones!\").\n\n\\relative c' { \n   \\set Staff.midiInstrument = #\"voice oohs\"\n   \\set Score.currentBarNumber = #216\n   \\bar \"\"\n   \\clef bass\n   \\key d \\minor\n   \\time 3/4\n   \\set Score.tempoHideNote ##t \\tempo 4 \n 104 \n   r4^\\markup { \\bold { \\italic { Recitativo } } } r a\n   \\grace { a8^( } e'2.)(~\n   e4 d8 cis d e)~\n   e4 g,4 r8 g\n   bes2( a8) e\n   f4 f r\n   }\n   \\addlyrics { O Freun- de, nicht die- se Tö- ne! }\n\nAt about 24 minutes in length, the last movement is the longest of the four movements. Indeed, it is longer than some entire symphony's of the Classical era. Its form has been disputed by musicologists, as Nicholas Cook explains:\n\nCook gives the following table describing the form of the movement:\n\nIn line with Cook's remarks, Charles Rosen characterizes the final movement as a symphony within a symphony, played without interruption.Rosen, Charles. The Classical Style: Haydn, Mozart, Beethoven. p. 440. New York: Norton, 1997. This \"inner symphony\" follows the same overall pattern as the Ninth Symphony as a whole:\n\n*First \"movement\": Theme and variations with slow introduction. The main theme, first in the cellos and basses, is later recapitulated by voices.\n*Second \"movement\": Scherzo in a  military style. It begins at Alla marcia (m. 331) and concludes with a  variation of the main theme with chorus.\n*Third \"movement\": Slow meditation with a new theme on the text \"Seid umschlungen, Millionen!\" It begins at Andante maestoso (m. 595).\n*Fourth \"movement\": Fugato finale on the themes of the first and third \"movements\". It begins at Allegro energico (m. 763).\n\nThe movement has a thematic unity in which every part is based on either the main theme, the \"Seid umschlungen\" theme, or some combination of the two.\nText of the fourth movement\n\nThe text is largely taken from Schiller's \"Ode to Joy\", with a few additional introductory words written specifically by Beethoven (shown in italics). The text, without repeats, is shown below, with a translation into English.The translation is taken from the BBC Proms 2013 programme, for a concert held at the Royal Albert Hall ([http://www.bbc.co.uk/proms/whats-on/2013/august-11/14710 Prom 38, 11 August 2013]). This concert was broadcast live on BBC Radio 3 and later on BBC4 television on 6 September 2013, where the same translation was used as subtitles. The score includes many repeats. For the full libretto, including all repetitions, see German Wikisource.\"An die Freude\" (Beethoven), German Wikisource\n\nTowards the end of the movement, the choir sings the last four lines of the main theme, concluding with \"Alle Menschen\" before the soloists sing for one last time the song of joy at a slower tempo. The chorus repeats parts of \"Seid umschlungen, Millionen!\", then quietly sings, \"Tochter aus Elysium\", and finally, \"Freude, schöner Götterfunken, Götterfunken!\".\n\nReception\n\nMusic critics almost universally consider the Ninth Symphony one of Beethoven's greatest works, and among the greatest musical works ever written. The finale, however, has had its detractors: \"[e]arly critics rejected [the finale] as cryptic and eccentric, the product of a deaf and ageing composer.\" Giuseppe Verdi complained about the vocal writing; in a letter to Clarina Maffei dated 20 April 1878, he wrote that the symphony was \"marvelous in its first three movements, very badly set in the last. No one will ever surpass the sublimity of the first movement, but it will be an easy task to write as badly for voices as is done in the last movement.\"\n\nPerformance challenges\n\nMetronome markings\n\nConductors in the \"historically informed performance\" movement, notably Roger Norrington, have used Beethoven's suggested tempos, to mixed reviews. Benjamin Zander has made a case for following Beethoven's metronome markings, both in writing and in performances with the Boston Philharmonic Orchestra and Philharmonia Orchestra of London.[https://www.nytimes.com/1983/10/11/arts/concert-beethoven-9th.html \"Concert: Beethoven 9th, Benjamin Zander and the Boston Philharmonic at Carnegie Hall\"] by Bernhard Holland, The New York Times, 11 October 1983[https://www.amazon.com/Beethoven-Symphony-No-Dominique-Labelle/dp/B00000IGQ6 Recording of the Beethoven 9th] with Benjamin Zander, Dominique Labelle, D'Anna Fortunato, Brad Cresswell, David Arnold, the Boston Philharmonic Orchestra, and Chorus Pro Musica While one account holds that Beethoven's metronome still exists and was tested and found accurate,[https://books.google.com/books?id\n5-9Cdy-Y-M8C&pg=PA34 Gunther Schuller, The Compleat Conductor] a recent study finds that his metronome was likely damaged and out of calibration.Sture Forsén, Harry B. Gray, L. K. Olof Lindgren, and Shirley B. Gray. October 2013. [http://www.ams.org/notices/201309/rnoti-p1146.pdf \"Was Something Wrong with Beethoven’s Metronome?\"], Notices of the American Mathematical Society 60(9):1146–53.\n\nRe-orchestrations and alterations\n\nA number of conductors have made alterations in the instrumentation of the symphony. Notably, Richard Wagner doubled many woodwind passages, a modification greatly extended by Gustav Mahler,Raymond Holden, \"The iconic symphony: performing Beethoven's Ninth Wagner's Way\" The Musical Times, Winter 2011 who revised the orchestration of the Ninth to make it sound like what he believed Beethoven would have wanted if given a modern orchestra.Bauer-Lechner, Natalie: Erinnerungen an Gustav Mahler, p. 131. E.P. Tal & Co. Verlag, 1923 Wagner's Dresden performance of 1864 was the first to place the chorus and the solo singers behind the orchestra as has since become standard; previous conductors placed them between the orchestra and the audience.\n\nHorn and trumpet alterations\n\nBeethoven's writing for horns and trumpets throughout the symphony (mostly the 2nd horn and 2nd trumpet) is sometimes altered by performers to avoid large leaps (those of a 12th or more), as these are very difficult to perform on brass instruments and may be consistently and flawlessly executed only by highly proficient musicians.Rimsky-Korsakov, [http://216.129.110.22/files/imglnks/usimg/4/41/IMSLP21030-PMLP48692-Rimsky_Osnovy_Ch1.PDF \"Principles of Orchestration\"]  – \"Though far less flexible than the wood-wind, brass instruments heighten the effect of other orchestral groups ... In spite of valves, the horn has little mobility.\" (pp. 23–24)\n\n2nd bassoon doubling basses in the finale\n\nBeethoven's indication that the 2nd bassoon should double the basses in measures 115–164 of the finale was not included in the Breitkopf parts, though it was included in the full score.Del Mar, Jonathan (1981) Orchestral Variations: Confusion and Error in the Orchestral Repertoire London: Eulenburg Books, p. 43\n\nNotable performances and recordings\n\nThe British premiere was presented on 21 March 1825 by its commissioners, the Philharmonic Society of London, at its Argyll Rooms conducted by Sir George Smart and with the choral part sung in Italian. The American premiere was presented on 20 May 1846 by the newly formed New York Philharmonic at Castle Garden (in an attempt to raise funds for a new concert hall), conducted by the English-born George Loder with the choral part translated into English for the first time.\n\nRichard Wagner conducted the symphony many times in his career. His last performance took place in 1872 at a concert to mark the foundation stone for the Bayreuth Festspielhaus. Wagner later published an essay entitled \"The rendering of Beethoven's Ninth Symphony\" in which he described the changes he made to the orchestration (see above) for the 1872 performance.\n\nThe London Philharmonic Choir debuted on 15 May 1947 performing the Ninth Symphony with the London Philharmonic Orchestra under the baton of Victor de Sabata at the Royal Albert Hall. In 1951, Wilhelm Furtwängler and the Bayreuth Festival Orchestra reopened the Bayreuth Festival with a performance of the symphony, after the Allies temporarily suspended the Festival following the Second World War.\n\nAmerican conductor Leonard Bernstein made his first of three recordings of the Beethoven Ninth in 1964 with the New York Philharmonic, for Columbia Masterworks, with soloists Martina Arroyo (soprano), Regina Sarfaty (mezzo), Nicholas di Virgilio (tenor), Norman Scott (bass), and the Juilliard Chorus. It was later reissued on CD. \n\nBernstein made his second recording of the piece with the Vienna Philharmonic for Deutsche Grammophon, in 1979. This featured Gwyneth Jones (soprano), Hanna Schwarz (mezzo), René Kollo (tenor), and Kurt Moll (bass), with the chorus of the Vienna State Opera.http://www.leonardbernstein.com/disc_other.php?disc_other_php&disc_other.php\n&page=8\n\nBernstein conducted a version of the Ninth at the Schauspielhaus in East Berlin, with  (Freedom) replacing  (Joy), to celebrate the fall of the Berlin Wall during Christmas 1989.Makell (2002), p. 98 This concert was performed by an orchestra and chorus made up of many nationalities: from both Germanies, the Bavarian Radio Symphony Orchestra and Chorus, the Chorus of the Berlin Radio Symphony Orchestra, and members of the Sächsische Staatskapelle Dresden, the Philharmonischer Kinderchor Dresden; from the Soviet Union, members of the orchestra of the Kirov Theatre; from the United Kingdom, members of the London Symphony Orchestra; from the USA, members of the New York Philharmonic; and from France, members of the Orchestre de Paris. Soloists were June Anderson, soprano, Sarah Walker, mezzo-soprano, Klaus König, tenor, and Jan-Hendrik Rootering, bass. It was the last time that Bernstein conducted the symphony; he died ten months later.\n\nSir Georg Solti recorded the symphony with the Chicago Symphony Orchestra and Chicago Symphony Chorus on two occasions: first in 1972 with soloists Pilar Lorengar, Yvonne Minton, Stuart Burrows, and Martti Talvela; and again in 1986 with soloists Jessye Norman, Reinhild Runkel, Robert Schunk, and Hans Sotin. On both occasions, the chorus was prepared by Margaret Hillis. The second recording won the 1987 Grammy Award for Best Orchestral Performance.\n\n \nThere have been various attempts to record the Ninth to come closer to what Beethoven's contemporaries would have heard, i.e., with period instruments: \n* Roger Norrington conducting the London Classical Players recorded it with period instruments for a 1987 release by EMI Records (rereleased in 1997 under the Virgin Classics label).\n* Benjamin Zander made a 1992 recording of the Ninth with the Boston Philharmonic Orchestra and noted soprano Dominique Labelle (who first performed the work with Robert Shaw), following Beethoven's own metronome markings.\n* Philippe Herreweghe recorded the Ninth with his period-instrument Orchestre des Champs-Élysées and his Collegium Vocale chorus for Harmonia Mundi in 1999.\n* Sir John Eliot Gardiner recorded his period-instrument version of the Ninth Symphony,Makell (2002), p. 99 conducting his Monteverdi Choir and Orchestre Révolutionnaire et Romantique in 1992. It was first released by Deutsche Grammophon in 1994 on their early music Archiv Produktion label as part of his complete cycle of the Beethoven symphonies. His soloists included Ľuba Orgonášová, Anne Sofie von Otter, Anthony Rolfe Johnson and Gilles Cachemaille.\n* An additional period-instrument recording by Christopher Hogwood and the Academy of Ancient Music was released in 1997 under the label Éditions de l'Oiseau-Lyre.\n\nAt 79 minutes, one of the longest Ninths recorded is Karl Böhm's, conducting the Vienna Philharmonic in 1981 with Jessye Norman and Plácido Domingo among the soloists.[https://www.amazon.com/Beethoven-Symphony-No-Ludwig-van/dp/B000001GN4/ref=sr_1_1 Beethoven: Symphony No. 9], Karl Böhm conducting the Vienna Philharmonic; Jessye Norman, Plácido Domingo, Brigitte Fassbaender, Walter Berry  (1981)\nInfluence\n\nMany later composers of the Romantic period and beyond were influenced by the Ninth Symphony.\n\nAn important theme in the finale of Johannes Brahms' Symphony No. 1 in C minor is related to the \"Ode to Joy\" theme from the last movement of Beethoven's Ninth Symphony. When this was pointed out to Brahms, he is reputed to have retorted \"Any fool can see that!\" Brahms's first symphony was, at times, both praised and derided as \"Beethoven's Tenth\".[http://www.kennedy-center.org/calendar/?fuseactioncomposition&composition_id\n2650 Symphony No. 1 in C minor, Op. 68]. The Kennedy Center, 2006\n\nThe Ninth Symphony influenced the forms that Anton Bruckner used for the movements of his symphonies. His Symphony No. 3 is in the same D-minor key as Beethoven's 9th and makes substantial use of thematic ideas from it. The colossal slow movement of Bruckner's Symphony No. 7, \"as usual\", takes the same A–B–A–B–A form as the 3rd movement of Beethoven's symphony and also uses some figuration from it.\n\nIn the opening notes of the third movement of his Symphony No. 9 (From the New World), Antonín Dvořák pays homage to the scherzo of this symphony with his falling fourths and timpani strokes.Steinberg, Michael. The Symphony: a listeners guide. p. 153. Oxford University Press, 1995.\n\nLikewise, Béla Bartók borrows the opening motif of the scherzo from Beethoven's Ninth symphony to introduce the second movement scherzo in his own, Four Orchestral Pieces, Op. 12 (Sz 51).\n\nOne legend is that the compact disc was deliberately designed to have a 74-minute playing so that it could accommodate Beethoven's Ninth Symphony. Kees Immink, Philips' chief engineer, who developed the CD, recalls that a commercial tug-of-war between the development partners, Sony and Philips, led to a settlement in a neutral 12-cm diameter format. The 1951 performance of the Ninth Symphony conducted by Furtwängler was brought forward as the perfect excuse for the change, and was put forth in a Philips news release celebrating the 25th anniversary of the Compact Disc as the reason for the 74-minute length.[http://www.newscenter.philips.com/main/standard/about/news/press/20070816_25th_anniversary_cd.wpd \"Philips celebrates 25th anniversary of the Compact Disc\"]\n\nIn the film The Pervert's Guide to Ideology, the psychoanalytical Communist philosopher Slavoj Žižek comments on the use of the Ode by Nazism, Bolshevism, the Chinese Cultural Revolution, the East-West German Olympic team, Southern Rhodesia, Abimael Guzmán (leader of the Shining Path), and the Council of Europe and the European Union.\n\nUse as anthem\n\nDuring the division of Germany in the Cold War, the \"Ode to Joy\" segment of the symphony was played in lieu of an anthem at the Olympic Games for the United Team of Germany between 1956 and 1968. In 1972, the musical backing (without the words) was adopted as the Anthem of Europe by the Council of Europe and subsequently by the European Communities (now the European Union) in 1985.[http://europa.eu/abc/symbols/anthem/index_en.htm Europa – The EU at a glance – The European Anthem] The \"Ode to Joy\" was used as the national anthem of Rhodesia between 1974 and 1979, as \"Rise, O Voices of Rhodesia\".[https://news.google.com/newspapers?idcHBmAAAAIBAJ&sjid\nXosNAAAAIBAJ&pg=6475,5011881&dq \"Rhodesia picks Ode to Joy\"], The Vancouver Sun, 30 August 1974\n\nUse as a hymn melody\n\nIn 1907, the Presbyterian pastor Henry van Dyke wrote the hymn \"Joyful, Joyful, we adore thee\" while staying at Williams College. The hymn is commonly sung in English-language churches to the \"Ode to Joy\" melody from this symphony.Rev. Corey F. O'Brien, \"[http://www.northprospectchurch.org/Sermons/s081109.pdf November 9, 2008 sermon]\" at North Prospect Union United Church of Christ in Medford.\n\nYear-end tradition\n\nThe German workers' movement began the tradition of performing the Ninth Symphony on New Year's Eve in 1918. Performances started at 11pm so that the symphony's finale would be played at the beginning of the new year. This tradition continued during the Nazi period and was also observed by East Germany after the war.[http://www.hr-online.de/servlet/de.hr.cms.servlet.File/11-006.pdf?enc=d3M9aHJteXNxbCZibG9iSWQ9MTE5NDAzNDkmaWQ9NDA3NDE2MTkmZm9yY2VEb3dubG9hZD0x \"Beethovens 9. Sinfonie – Musik für alle Zwecke – Die Neunte und Europa: \"Die Marseillaise der Menschheit\"], by Niels Kaiser, hr2, 26 January 2011 \n\nThe Ninth Symphony is traditionally performed throughout Japan at the end of the year. In December 2009, for example, there were 55 performances of the symphony by various major orchestras and choirs in Japan.Brasor, Philip, \"[http://search.japantimes.co.jp/cgi-bin/fm20101224r1.html Japan makes Beethoven's Ninth No. 1 for the holidays]\", The Japan Times, 24 December 2010, p. 20, retrieved on 24 December 2010; Uranaka, Taiga, \"[http://search.japantimes.co.jp/cgi-bin/nn19991201a5.html Beethoven concert to fete students' wartime sendoff]\", The Japan Times, 1 December 1999, retrieved on 24 December 2010. \n\nIt was introduced to Japan during World War I by German prisoners held at the Bandō prisoner-of-war camp. Japanese orchestras, notably the NHK Symphony Orchestra, began performing the symphony in 1925 and during World War II, the Imperial government promoted performances of the symphony, including on New Year's Eve. In an effort to capitalize on its popularity, orchestras and choruses undergoing economic hard times during Japan's reconstruction, performed the piece at year's end. In the 1960s, these year-end performances of the symphony became more widespread, and included the participation of local choirs and orchestras, firmly establishing a tradition that continues today.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Symphony No. 9 (Beethoven)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3436" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Symphony No. 9 in D minor, Op. 125, is the final complete symphony by the German composer Ludwig van Beethoven, composed between 1822 and 1824. It was first performed in Vienna on 7 May 1824. The symphony is one of the best-known works in common practice music. It is widely viewed by critics as one of Beethoven's greatest works, the pinnacle of musical Classicism, and one of the greatest compositions in the western musical canon. In the 2010s, it stands as one of the most performed symphonies in the world.[http://www.lansingstatejournal.com/story/entertainment/music/2016/11/02/lansing-symphony-orchestra-perform-joyful-beethovens-th/93156368/ \"Lansing Symphony Orchestra to perform joyful Beethoven’s 5th\"] by Ken Glickman, Lansing State Journal, 2 November 2016[https://www.gfsymphony.org/beethoven-s-ninth-ode-to-joy \"Beethoven's Ninth: 'Ode to Joy'\"], Great Falls Symphony, 2017/18 announcement\n\nThe symphony was the first example of a major composer using voices in a symphonyBonds, Mark Evan, \"Symphony: II. The 19th century\", The New Grove Dictionary of Music and Musicians, Second Edition (London: Macmillan, 2001), 29 vols. , 24:837. (thus making it a choral symphony). The words are sung during the final movement by four vocal soloists and a chorus. They were taken from the \"Ode to Joy\", a poem written by Friedrich Schiller in 1785 and revised in 1803, with text additions made by the composer.\n\nIn 2001, Beethoven's original, hand-written manuscript of the score, held by the Berlin State Library, was added to the United Nations Memory of the World Programme Heritage list, becoming the first musical score so honoured.[http://www.unesco.org/new/en/communication-and-information/memory-of-the-world/register/full-list-of-registered-heritage/registered-heritage-page-5/ludwig-van-beethoven-symphony-no-9-d-minor-op-125/ Memory of the World (2001) – Ludwig van Beethoven: Symphony No 9, D minor, Op. 125]\n\nHistory\n\nComposition\n\nThe Philharmonic Society of London originally commissioned the symphony in 1817.Solomon, Maynard. Beethoven. New York: Schirmer Books, 1997, p. 251. The main composition work was done between autumn 1822 and the completion of the autograph in February 1824.Breitkopf Urtext, Beethoven: [http://www.breitkopf.com/feature/download/3738/3667 Symphonie Nr. 9 d-moll] , op. 125, pbl.: Hauschild, Peter, p. VIII The symphony emerged from other pieces by Beethoven that, while completed works in their own right, are also in some sense \"sketches\" (rough outlines) for the future symphony. The Choral Fantasy Opus. 80 (1808), basically a piano concerto movement, brings in a choir and vocal soloists near the end for the climax. The vocal forces sing a theme first played instrumentally, and this theme is reminiscent of the corresponding theme in the Ninth Symphony (for a detailed comparison, see Choral Fantasy).\n\nGoing further back, an earlier version of the Choral Fantasy theme is found in the song \"Gegenliebe\" (Returned Love) for piano and high voice, which dates from before 1795.Hopkins (1981, 249) According to Robert W. Gutman, Mozart's K. 222 Offertory in D minor, \"Misericordias Domini\", written in 1775, contains a melody that foreshadows \"Ode to Joy\".Robert W. Gutman, Mozart: A Cultural Biography, 1999, p. 344\n\nPremiere\n\nAlthough his major works had primarily been premiered in Vienna, Beethoven was keen to have his latest composition performed in Berlin as soon as possible after finishing it, as he thought that musical taste in Vienna had become dominated by Italian composers such as Rossini.Sachs, Harvey (2010), The Ninth: Beethoven and the World in 1824, Faber When his friends and financiers heard this, they urged him to premiere the symphony in Vienna in the form of a petition signed by a number of prominent Viennese music patrons and performers.\n\nBeethoven was flattered by the adoration of Vienna, so the Ninth Symphony was premiered on 7 May 1824 in the Theater am Kärntnertor in Vienna along with the overture The Consecration of the House () and three parts of the Missa solemnis (the Kyrie, Credo, and Agnus Dei). This was the composer's first onstage appearance in 12 years; the hall was packed with an eager audience and a number of musicians.Levy, David Benjamin. Beethoven: The Ninth Symphony. Yale University Press 2003.\n\nThe premiere of Symphony No. 9 involved the largest orchestra ever assembled by Beethoven and required the combined efforts of the Kärntnertor house orchestra, the Vienna Music Society (Gesellschaft der Musikfreunde), and a select group of capable amateurs. While no complete list of premiere performers exists, many of Vienna's most elite performers are known to have participated.Kelly, Thomas Forrest (2000). First Nights: Five Musical Premiers (Chapter 3). Yale University Press, 2001.\n\nThe soprano and alto parts were sung by two famous young singers: Henriette Sontag and Caroline Unger. German soprano Henriette Sontag was 18 years old when Beethoven personally recruited her to perform in the premiere of the Ninth.Elson, Louis, Chief Editor. University Musical Encyclopedia of Vocal Music. University Society, New York, 1912Life of Henriette Sontag, Countess de Rossi. (Various Authors) Stringer & Townsend, publishers. New York, 1852. Also personally recruited by Beethoven, 20-year-old contralto Caroline Unger, a native of Vienna, had gained critical praise in 1821 appearing in Rossini's Tancredi. After performing in Beethoven's 1824 premiere, Unger then found fame in Italy and Paris. Italian composers Donizetti and Bellini were known to have written roles specifically for her voice.Kennedy, Michael and Bourne, Joyce (1996). The Concise Oxford Dictionary of Music. Oxford University Press, 2007. Anton Haizinger and Joseph Seipelt sang the tenor and bass parts, respectively.\n\nAlthough the performance was officially directed by Michael Umlauf, the theatre's Kapellmeister, Beethoven shared the stage with him. However, two years earlier, Umlauf had watched as the composer's attempt to conduct a dress rehearsal of his opera Fidelio ended in disaster. So this time, he instructed the singers and musicians to ignore the almost totally deaf Beethoven. At the beginning of every part, Beethoven, who sat by the stage, gave the tempos. He was turning the pages of his score and beating time for an orchestra he could not hear.\n\nThere are a number of anecdotes about the premiere of the Ninth. Based on the testimony of the participants, there are suggestions that it was underrehearsed (there were only two full rehearsals) and rather scrappy in execution. On the other hand, the premiere was a great success. In any case, Beethoven was not to blame, as violinist Joseph Böhm recalled:\n\nWhen the audience applauded—testimonies differ over whether at the end of the scherzo or symphony—Beethoven was several measures off and still conducting. Because of that, the contralto Caroline Unger walked over and turned Beethoven around to accept the audience's cheers and applause. According to the critic for the Theater-Zeitung, \"[t]he public received the musical hero with the utmost respect and sympathy, listened to his wonderful, gigantic creations with the most absorbed attention and broke out in jubilant applause, often during sections, and repeatedly at the end of them.\" The audience acclaimed him through standing ovations five times; there were handkerchiefs in the air, hats, raised hands, so that Beethoven, who could not hear the applause, could at least see the ovations.\n\nEditions\n\nThe first German edition was printed by B. Schott's Söhne (Mainz) in 1826. The Breitkopf & Härtel edition dating from 1864 has been used widely by orchestras. In 1997, Bärenreiter published an edition by Jonathan Del Mar. According to Del Mar, this edition corrects nearly 3,000 mistakes in the Breitkopf edition, some of which were \"remarkable\". David Levy, however, criticized this edition, saying that it could create \"quite possibly false\" traditions. Breitkopf also published a new edition by Peter Hauschild in 2005.\n\nInstrumentation\n\nThe symphony is scored for the following orchestra. These are by far the largest forces needed for any Beethoven symphony; at the premiere, Beethoven augmented them further by assigning two players to each wind part.Thayer, Alexander Wheelock. Thayer's Life of Beethoven. Revised and edited by Elliott Forbes. (Princeton, New Jersey: Princeton University Press, 1973), p. 905.\n\nWoodwinds\nPiccolo (fourth movement only)\n2 Flutes\n2 Oboes\n2 Clarinets in A, B and C\n2 Bassoons\nContrabassoon (fourth movement only)\n\nBrass\n2 Horns (1 and 2) in D and B\n2 Horns (3 and 4) in B (bass), B and E\n2 Trumpets in D and B\n3 Trombones (alto, tenor, and bass; second and fourth movements only)\n\nPercussion\nTimpani\nBass drum (fourth movement only)\nTriangle (fourth movement only)\nCymbals (fourth movement only)\n\nVoices (fourth movement only)\nSoprano solo\nAlto solo\nTenor solo\nBass solo\nSATB choir (tenor briefly divides)\n\nStrings\nViolins I, II\nViolas\nCellos\nDouble basses\n\nForm\n\nThe symphony is in four movements. The structure of each movement is as follows:\n\nBeethoven changes the usual pattern of Classical symphonies in placing the scherzo movement before the slow movement. In symphonies, slow movements are usually placed before scherzo.Jackson 1999, 26; Stein 1979, 106 This was the first time he did this in a symphony, although he had done so in some previous works, including the String Quartet Op. 18 no. 5, the \"Archduke\" piano trio Op. 97, the Hammerklavier piano sonata Op. 106. Haydn, too, had used this arrangement in a number of his own works such as the String Quartet No. 30 in E major.\n\nI. Allegro ma non troppo, un poco maestoso \n\nThe first movement is in sonata form without an exposition repeat. It begins with open fifths (A and E) played pianissimo by tremolo strings, steadily building up until the first main theme in D minor at m. 17.\n\n    \\relative c {\n        \\set Staff.midiInstrument = #\"violin\"\n        \\set Score.tempoHideNote ##t \\tempo 4 \n 88\n        \\key d \\minor\n        \\time 2/4\n        \\set Score.currentBarNumber = #17\n\n        \\partial 32 d32\\ff^\\markup \"First theme\"\n        a4~ a8.. f32\n        d8.. a32 f8. a32( f)\n        d4~ d16 f'-. e-. d-.\n        a'8-. g-. e-. a-.\n        d,8.\\sf\n    }\n\nThe opening, with its perfect fifth quietly emerging, resembles the sound of an orchestra tuning up.\n\nAt the outset of the recapitulation (which repeats the main melodic themes) in m. 301, the theme returns, this time played fortissimo and in D major, rather than D minor. The movement ends with a massive coda that takes up nearly a quarter of the movement, as in Beethoven's Third and Fifth Symphonies.\n\nA typical performance lasts about 15 minutes.\n\nII. Molto vivace \n\nThe second movement is a scherzo and trio. Like the first movement, the scherzo is in D minor, with the introduction bearing a passing resemblance to the opening theme of the first movement, a pattern also found in the Hammerklavier piano sonata, written a few years earlier. At times during the piece, Beethoven specifies one downbeat every three measures—perhaps because of the fast tempo—with the direction ritmo di tre battute (rhythm of three beats) and one beat every four measures with the direction ritmo di quattro battute (rhythm of four beats). Beethoven had been criticized before for failing to adhere to standard Classical form for his compositions. He used this movement to answer his critics. Normally, a scherzo is in triple time. Beethoven wrote this piece in triple time but punctuated it in a way that, when coupled with the tempo, makes it sound as if it is in quadruple time.\n\nWhile adhering to the standard compound ternary design (three-part structure) of a dance movement (scherzo-trio-scherzo or minuet-trio-minuet), the scherzo section has an elaborate internal structure; it is a complete sonata form. Within this sonata form, the first group of the exposition (the statement of the main melodic themes) starts out with a fugue in D minor on the subject below.\n\n    \\relative c {\n        \\set Staff.midiInstrument = #\"violin\"\n        \\set Score.tempoHideNote ##t \\tempo 2. \n 116\n        \\key d \\minor\n        \\time 3/4\n        \\set Score.currentBarNumber = #9\n        \\bar \"\"\n\n        a4.\\pp^\\markup \"First theme\" a,8 a4\n        d4-. e-. f-.\n        e-. f-. g-.\n        f-. e-. d-.\n        c b a\n        gis a b\n        a gis a\n    }\n\nFor the second subject, it modulates to the unusual key of C major. The exposition then repeats before a short development section, where Beethoven explores other ideas. The recapitulation (repeating of the melodic themes heard in the opening of the movement) further develops the exposition's themes, also containing timpani solos. A new development section leads to the repeat of the recapitulation, and the scherzo concludes with a brief codetta.\n\nThe contrasting trio section is in D major and in duple time. The trio is the first time the trombones play. Following the trio, the second occurrence of the scherzo, unlike the first, plays through without any repetition, after which there is a brief reprise of the trio, and the movement ends with an abrupt coda.\n\nThe duration of the movement is about 12 minutes, but this may vary depending on whether two frequently omitted repeats are played.\n\nIII. Adagio molto e cantabile \n\nThe third movement is a lyrical, slow movement in B major, which is a minor sixth away from the symphony's main key of D minor. It is in a double variation form, with each pair of variations progressively elaborating the rhythm and melodic ideas. The first variation, like the theme, is in  time, the second in . The variations are separated by passages in , the first in D major, the second in G major, the third in E major, the fourth in F major, and the fifth in B major. The final variation is twice interrupted by episodes in which loud fanfares from the full orchestra are answered by octaves by the first violins. A prominent French horn solo is assigned to the fourth player.\n\nA typical performance lasts about 16 minutes.\n\nIV. Finale\n\nThe famous choral finale is Beethoven's musical representation of universal brotherhood based on the 'Ode to Joy' theme.\n\n\\new Score {\n  \\new Staff {\n    \\relative c {\n      \\set Staff.instrumentName = #\"Vc.\"\n      \\set Staff.midiInstrument = #\"cello\"\n      \\set Score.currentBarNumber = #92\n      \\time 4/4\n      \\key d \\major\n      \\clef bass\n      \\tempo 2 = 60\n      \\omit Score.MetronomeMark\n      \\bar \"\"\n        fis2\\p^\\markup {  \\halign #-0.5 \\bold \"Allegro assai\"}( g4 a) | a4( g fis e) | d2( e4 fis) | fis4.( e8) e2 |\n        fis2( g4 a) | a4( g fis e) | d2( e4 fis) | e4.( d8) d2 | \\break\n        e( fis4 d) | e( fis8 g fis4 d) | e( fis8 g fis4 e) | d( e a,) fis'~ | \n        fis fis( g a) | a( g fis e) | d2( e4 fis) | e4.( d8) d2\n    }\n  }\n}\n\nThe movement starts with an introduction in which musical material from each of the preceding three movements – though none are literal quotations of previous music – are successively presented and then dismissed by instrumental recitatives played by the low strings. Following this, the 'Ode to Joy' theme is finally introduced by the cellos and double basses. After three instrumental variations on this theme, the human voice is presented for the first time in the symphony by the baritone soloist, who sings words written by Beethoven himself: O Freunde, nicht diese Töne!' Sondern laßt uns angenehmere anstimmen, und freudenvollere. (\"Oh friends, not these sounds! Let us instead strike up more pleasing and more joyful ones!\").\n\n\\relative c' { \n   \\set Staff.midiInstrument = #\"voice oohs\"\n   \\set Score.currentBarNumber = #216\n   \\bar \"\"\n   \\clef bass\n   \\key d \\minor\n   \\time 3/4\n   \\set Score.tempoHideNote ##t \\tempo 4 \n 104 \n   r4^\\markup { \\bold { \\italic { Recitativo } } } r a\n   \\grace { a8^( } e'2.)(~\n   e4 d8 cis d e)~\n   e4 g,4 r8 g\n   bes2( a8) e\n   f4 f r\n   }\n   \\addlyrics { O Freun- de, nicht die- se Tö- ne! }\n\nAt about 24 minutes in length, the last movement is the longest of the four movements. Indeed, it is longer than some entire symphony's of the Classical era. Its form has been disputed by musicologists, as Nicholas Cook explains:\n\nCook gives the following table describing the form of the movement:\n\nIn line with Cook's remarks, Charles Rosen characterizes the final movement as a symphony within a symphony, played without interruption.Rosen, Charles. The Classical Style: Haydn, Mozart, Beethoven. p. 440. New York: Norton, 1997. This \"inner symphony\" follows the same overall pattern as the Ninth Symphony as a whole:\n\n*First \"movement\": Theme and variations with slow introduction. The main theme, first in the cellos and basses, is later recapitulated by voices.\n*Second \"movement\": Scherzo in a  military style. It begins at Alla marcia (m. 331) and concludes with a  variation of the main theme with chorus.\n*Third \"movement\": Slow meditation with a new theme on the text \"Seid umschlungen, Millionen!\" It begins at Andante maestoso (m. 595).\n*Fourth \"movement\": Fugato finale on the themes of the first and third \"movements\". It begins at Allegro energico (m. 763).\n\nThe movement has a thematic unity in which every part is based on either the main theme, the \"Seid umschlungen\" theme, or some combination of the two.\nText of the fourth movement\n\nThe text is largely taken from Schiller's \"Ode to Joy\", with a few additional introductory words written specifically by Beethoven (shown in italics). The text, without repeats, is shown below, with a translation into English.The translation is taken from the BBC Proms 2013 programme, for a concert held at the Royal Albert Hall ([http://www.bbc.co.uk/proms/whats-on/2013/august-11/14710 Prom 38, 11 August 2013]). This concert was broadcast live on BBC Radio 3 and later on BBC4 television on 6 September 2013, where the same translation was used as subtitles. The score includes many repeats. For the full libretto, including all repetitions, see German Wikisource.\"An die Freude\" (Beethoven), German Wikisource\n\nTowards the end of the movement, the choir sings the last four lines of the main theme, concluding with \"Alle Menschen\" before the soloists sing for one last time the song of joy at a slower tempo. The chorus repeats parts of \"Seid umschlungen, Millionen!\", then quietly sings, \"Tochter aus Elysium\", and finally, \"Freude, schöner Götterfunken, Götterfunken!\".\n\nReception\n\nMusic critics almost universally consider the Ninth Symphony one of Beethoven's greatest works, and among the greatest musical works ever written. The finale, however, has had its detractors: \"[e]arly critics rejected [the finale] as cryptic and eccentric, the product of a deaf and ageing composer.\" Giuseppe Verdi complained about the vocal writing; in a letter to Clarina Maffei dated 20 April 1878, he wrote that the symphony was \"marvelous in its first three movements, very badly set in the last. No one will ever surpass the sublimity of the first movement, but it will be an easy task to write as badly for voices as is done in the last movement.\"\n\nPerformance challenges\n\nMetronome markings\n\nConductors in the \"historically informed performance\" movement, notably Roger Norrington, have used Beethoven's suggested tempos, to mixed reviews. Benjamin Zander has made a case for following Beethoven's metronome markings, both in writing and in performances with the Boston Philharmonic Orchestra and Philharmonia Orchestra of London.[https://www.nytimes.com/1983/10/11/arts/concert-beethoven-9th.html \"Concert: Beethoven 9th, Benjamin Zander and the Boston Philharmonic at Carnegie Hall\"] by Bernhard Holland, The New York Times, 11 October 1983[https://www.amazon.com/Beethoven-Symphony-No-Dominique-Labelle/dp/B00000IGQ6 Recording of the Beethoven 9th] with Benjamin Zander, Dominique Labelle, D'Anna Fortunato, Brad Cresswell, David Arnold, the Boston Philharmonic Orchestra, and Chorus Pro Musica While one account holds that Beethoven's metronome still exists and was tested and found accurate,[https://books.google.com/books?id\n5-9Cdy-Y-M8C&pg=PA34 Gunther Schuller, The Compleat Conductor] a recent study finds that his metronome was likely damaged and out of calibration.Sture Forsén, Harry B. Gray, L. K. Olof Lindgren, and Shirley B. Gray. October 2013. [http://www.ams.org/notices/201309/rnoti-p1146.pdf \"Was Something Wrong with Beethoven’s Metronome?\"], Notices of the American Mathematical Society 60(9):1146–53.\n\nRe-orchestrations and alterations\n\nA number of conductors have made alterations in the instrumentation of the symphony. Notably, Richard Wagner doubled many woodwind passages, a modification greatly extended by Gustav Mahler,Raymond Holden, \"The iconic symphony: performing Beethoven's Ninth Wagner's Way\" The Musical Times, Winter 2011 who revised the orchestration of the Ninth to make it sound like what he believed Beethoven would have wanted if given a modern orchestra.Bauer-Lechner, Natalie: Erinnerungen an Gustav Mahler, p. 131. E.P. Tal & Co. Verlag, 1923 Wagner's Dresden performance of 1864 was the first to place the chorus and the solo singers behind the orchestra as has since become standard; previous conductors placed them between the orchestra and the audience.\n\nHorn and trumpet alterations\n\nBeethoven's writing for horns and trumpets throughout the symphony (mostly the 2nd horn and 2nd trumpet) is sometimes altered by performers to avoid large leaps (those of a 12th or more), as these are very difficult to perform on brass instruments and may be consistently and flawlessly executed only by highly proficient musicians.Rimsky-Korsakov, [http://216.129.110.22/files/imglnks/usimg/4/41/IMSLP21030-PMLP48692-Rimsky_Osnovy_Ch1.PDF \"Principles of Orchestration\"]  – \"Though far less flexible than the wood-wind, brass instruments heighten the effect of other orchestral groups ... In spite of valves, the horn has little mobility.\" (pp. 23–24)\n\n2nd bassoon doubling basses in the finale\n\nBeethoven's indication that the 2nd bassoon should double the basses in measures 115–164 of the finale was not included in the Breitkopf parts, though it was included in the full score.Del Mar, Jonathan (1981) Orchestral Variations: Confusion and Error in the Orchestral Repertoire London: Eulenburg Books, p. 43\n\nNotable performances and recordings\n\nThe British premiere was presented on 21 March 1825 by its commissioners, the Philharmonic Society of London, at its Argyll Rooms conducted by Sir George Smart and with the choral part sung in Italian. The American premiere was presented on 20 May 1846 by the newly formed New York Philharmonic at Castle Garden (in an attempt to raise funds for a new concert hall), conducted by the English-born George Loder with the choral part translated into English for the first time.\n\nRichard Wagner conducted the symphony many times in his career. His last performance took place in 1872 at a concert to mark the foundation stone for the Bayreuth Festspielhaus. Wagner later published an essay entitled \"The rendering of Beethoven's Ninth Symphony\" in which he described the changes he made to the orchestration (see above) for the 1872 performance.\n\nThe London Philharmonic Choir debuted on 15 May 1947 performing the Ninth Symphony with the London Philharmonic Orchestra under the baton of Victor de Sabata at the Royal Albert Hall. In 1951, Wilhelm Furtwängler and the Bayreuth Festival Orchestra reopened the Bayreuth Festival with a performance of the symphony, after the Allies temporarily suspended the Festival following the Second World War.\n\nAmerican conductor Leonard Bernstein made his first of three recordings of the Beethoven Ninth in 1964 with the New York Philharmonic, for Columbia Masterworks, with soloists Martina Arroyo (soprano), Regina Sarfaty (mezzo), Nicholas di Virgilio (tenor), Norman Scott (bass), and the Juilliard Chorus. It was later reissued on CD. \n\nBernstein made his second recording of the piece with the Vienna Philharmonic for Deutsche Grammophon, in 1979. This featured Gwyneth Jones (soprano), Hanna Schwarz (mezzo), René Kollo (tenor), and Kurt Moll (bass), with the chorus of the Vienna State Opera.http://www.leonardbernstein.com/disc_other.php?disc_other_php&disc_other.php\n&page=8\n\nBernstein conducted a version of the Ninth at the Schauspielhaus in East Berlin, with  (Freedom) replacing  (Joy), to celebrate the fall of the Berlin Wall during Christmas 1989.Makell (2002), p. 98 This concert was performed by an orchestra and chorus made up of many nationalities: from both Germanies, the Bavarian Radio Symphony Orchestra and Chorus, the Chorus of the Berlin Radio Symphony Orchestra, and members of the Sächsische Staatskapelle Dresden, the Philharmonischer Kinderchor Dresden; from the Soviet Union, members of the orchestra of the Kirov Theatre; from the United Kingdom, members of the London Symphony Orchestra; from the USA, members of the New York Philharmonic; and from France, members of the Orchestre de Paris. Soloists were June Anderson, soprano, Sarah Walker, mezzo-soprano, Klaus König, tenor, and Jan-Hendrik Rootering, bass. It was the last time that Bernstein conducted the symphony; he died ten months later.\n\nSir Georg Solti recorded the symphony with the Chicago Symphony Orchestra and Chicago Symphony Chorus on two occasions: first in 1972 with soloists Pilar Lorengar, Yvonne Minton, Stuart Burrows, and Martti Talvela; and again in 1986 with soloists Jessye Norman, Reinhild Runkel, Robert Schunk, and Hans Sotin. On both occasions, the chorus was prepared by Margaret Hillis. The second recording won the 1987 Grammy Award for Best Orchestral Performance.\n\n \nThere have been various attempts to record the Ninth to come closer to what Beethoven's contemporaries would have heard, i.e., with period instruments: \n* Roger Norrington conducting the London Classical Players recorded it with period instruments for a 1987 release by EMI Records (rereleased in 1997 under the Virgin Classics label).\n* Benjamin Zander made a 1992 recording of the Ninth with the Boston Philharmonic Orchestra and noted soprano Dominique Labelle (who first performed the work with Robert Shaw), following Beethoven's own metronome markings.\n* Philippe Herreweghe recorded the Ninth with his period-instrument Orchestre des Champs-Élysées and his Collegium Vocale chorus for Harmonia Mundi in 1999.\n* Sir John Eliot Gardiner recorded his period-instrument version of the Ninth Symphony,Makell (2002), p. 99 conducting his Monteverdi Choir and Orchestre Révolutionnaire et Romantique in 1992. It was first released by Deutsche Grammophon in 1994 on their early music Archiv Produktion label as part of his complete cycle of the Beethoven symphonies. His soloists included Ľuba Orgonášová, Anne Sofie von Otter, Anthony Rolfe Johnson and Gilles Cachemaille.\n* An additional period-instrument recording by Christopher Hogwood and the Academy of Ancient Music was released in 1997 under the label Éditions de l'Oiseau-Lyre.\n\nAt 79 minutes, one of the longest Ninths recorded is Karl Böhm's, conducting the Vienna Philharmonic in 1981 with Jessye Norman and Plácido Domingo among the soloists.[https://www.amazon.com/Beethoven-Symphony-No-Ludwig-van/dp/B000001GN4/ref=sr_1_1 Beethoven: Symphony No. 9], Karl Böhm conducting the Vienna Philharmonic; Jessye Norman, Plácido Domingo, Brigitte Fassbaender, Walter Berry  (1981)\nInfluence\n\nMany later composers of the Romantic period and beyond were influenced by the Ninth Symphony.\n\nAn important theme in the finale of Johannes Brahms' Symphony No. 1 in C minor is related to the \"Ode to Joy\" theme from the last movement of Beethoven's Ninth Symphony. When this was pointed out to Brahms, he is reputed to have retorted \"Any fool can see that!\" Brahms's first symphony was, at times, both praised and derided as \"Beethoven's Tenth\".[http://www.kennedy-center.org/calendar/?fuseactioncomposition&composition_id\n2650 Symphony No. 1 in C minor, Op. 68]. The Kennedy Center, 2006\n\nThe Ninth Symphony influenced the forms that Anton Bruckner used for the movements of his symphonies. His Symphony No. 3 is in the same D-minor key as Beethoven's 9th and makes substantial use of thematic ideas from it. The colossal slow movement of Bruckner's Symphony No. 7, \"as usual\", takes the same A–B–A–B–A form as the 3rd movement of Beethoven's symphony and also uses some figuration from it.\n\nIn the opening notes of the third movement of his Symphony No. 9 (From the New World), Antonín Dvořák pays homage to the scherzo of this symphony with his falling fourths and timpani strokes.Steinberg, Michael. The Symphony: a listeners guide. p. 153. Oxford University Press, 1995.\n\nLikewise, Béla Bartók borrows the opening motif of the scherzo from Beethoven's Ninth symphony to introduce the second movement scherzo in his own, Four Orchestral Pieces, Op. 12 (Sz 51).\n\nOne legend is that the compact disc was deliberately designed to have a 74-minute playing so that it could accommodate Beethoven's Ninth Symphony. Kees Immink, Philips' chief engineer, who developed the CD, recalls that a commercial tug-of-war between the development partners, Sony and Philips, led to a settlement in a neutral 12-cm diameter format. The 1951 performance of the Ninth Symphony conducted by Furtwängler was brought forward as the perfect excuse for the change, and was put forth in a Philips news release celebrating the 25th anniversary of the Compact Disc as the reason for the 74-minute length.[http://www.newscenter.philips.com/main/standard/about/news/press/20070816_25th_anniversary_cd.wpd \"Philips celebrates 25th anniversary of the Compact Disc\"]\n\nIn the film The Pervert's Guide to Ideology, the psychoanalytical Communist philosopher Slavoj Žižek comments on the use of the Ode by Nazism, Bolshevism, the Chinese Cultural Revolution, the East-West German Olympic team, Southern Rhodesia, Abimael Guzmán (leader of the Shining Path), and the Council of Europe and the European Union.\n\nUse as anthem\n\nDuring the division of Germany in the Cold War, the \"Ode to Joy\" segment of the symphony was played in lieu of an anthem at the Olympic Games for the United Team of Germany between 1956 and 1968. In 1972, the musical backing (without the words) was adopted as the Anthem of Europe by the Council of Europe and subsequently by the European Communities (now the European Union) in 1985.[http://europa.eu/abc/symbols/anthem/index_en.htm Europa – The EU at a glance – The European Anthem] The \"Ode to Joy\" was used as the national anthem of Rhodesia between 1974 and 1979, as \"Rise, O Voices of Rhodesia\".[https://news.google.com/newspapers?idcHBmAAAAIBAJ&sjid\nXosNAAAAIBAJ&pg=6475,5011881&dq \"Rhodesia picks Ode to Joy\"], The Vancouver Sun, 30 August 1974\n\nUse as a hymn melody\n\nIn 1907, the Presbyterian pastor Henry van Dyke wrote the hymn \"Joyful, Joyful, we adore thee\" while staying at Williams College. The hymn is commonly sung in English-language churches to the \"Ode to Joy\" melody from this symphony.Rev. Corey F. O'Brien, \"[http://www.northprospectchurch.org/Sermons/s081109.pdf November 9, 2008 sermon]\" at North Prospect Union United Church of Christ in Medford.\n\nYear-end tradition\n\nThe German workers' movement began the tradition of performing the Ninth Symphony on New Year's Eve in 1918. Performances started at 11pm so that the symphony's finale would be played at the beginning of the new year. This tradition continued during the Nazi period and was also observed by East Germany after the war.[http://www.hr-online.de/servlet/de.hr.cms.servlet.File/11-006.pdf?enc=d3M9aHJteXNxbCZibG9iSWQ9MTE5NDAzNDkmaWQ9NDA3NDE2MTkmZm9yY2VEb3dubG9hZD0x \"Beethovens 9. Sinfonie – Musik für alle Zwecke – Die Neunte und Europa: \"Die Marseillaise der Menschheit\"], by Niels Kaiser, hr2, 26 January 2011 \n\nThe Ninth Symphony is traditionally performed throughout Japan at the end of the year. In December 2009, for example, there were 55 performances of the symphony by various major orchestras and choirs in Japan.Brasor, Philip, \"[http://search.japantimes.co.jp/cgi-bin/fm20101224r1.html Japan makes Beethoven's Ninth No. 1 for the holidays]\", The Japan Times, 24 December 2010, p. 20, retrieved on 24 December 2010; Uranaka, Taiga, \"[http://search.japantimes.co.jp/cgi-bin/nn19991201a5.html Beethoven concert to fete students' wartime sendoff]\", The Japan Times, 1 December 1999, retrieved on 24 December 2010. \n\nIt was introduced to Japan during World War I by German prisoners held at the Bandō prisoner-of-war camp. Japanese orchestras, notably the NHK Symphony Orchestra, began performing the symphony in 1925 and during World War II, the Imperial government promoted performances of the symphony, including on New Year's Eve. In an effort to capitalize on its popularity, orchestras and choruses undergoing economic hard times during Japan's reconstruction, performed the piece at year's end. In the 1960s, these year-end performances of the symphony became more widespread, and included the participation of local choirs and orchestras, firmly establishing a tradition that continues today. Symphony No. 9 (Beethoven). http://en.wikipedia.org/?curid=3436."
  }
}
