{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17955",
  "eid" : "2fbcf890-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778589337,
  "textBody" : "Leipzig (;) is the most populous city in the federal state of Saxony, Germany. With a population of 582,277 inhabitants (1.1 million residents in the larger urban zone) it is Germany's tenth most populous city.http://www.statistik-bremen.de/aktuelle_statistiken/01a.htm Leipzig is located about 160 km southwest of Berlin at the confluence of the White Elster, Pleisse, and Parthe rivers at the southern end of the North German Plain.\n\nLeipzig has been a trade city since at least the time of the Holy Roman Empire. The city sits at the intersection of the Via Regia and Via Imperii, two important medieval trade routes. Leipzig was once one of the major European centres of learning and culture in fields such as music and publishing.[http://www.idehist.uu.se/distans/ilmh/Ren/bokt-frankfurt.htm]  Leipzig became a major urban centre within the German Democratic Republic (East Germany) after the Second World War, but its cultural and economic importance declined.\n\nLeipzig later played a significant role in instigating the fall of communism in Central and Eastern Europe, through events which took place in and around St. Nicholas Church. Since the reunification of Germany, Leipzig has undergone significant change with the restoration of some historical buildings, the demolition of others, and the development of a modern transport infrastructure. Leipzig today is an economic centre, the most livable city in Germany, according to the GfK marketing research institution and has the second-best future prospects of all cities in Germany, according to HWWI and Berenberg Bank.http://www.lvz.de/Leipzig/Lokales/Staedteranking-Leipzig-landet-auf-Platz-zwei Leipzig Zoological Garden is one of the most modern zoos in Europe and ranks first in Germany and second in Europe according to Anthony Sheridan. Since the opening of the Leipzig City Tunnel in 2013, Leipzig forms the centrepiece of the S-Bahn Mitteldeutschland public transit system. Leipzig is currently listed as Gamma World City and Germany's \"Boomtown\".\n\nOper Leipzig has become one of the most prominent opera houses in Germany, and traces its establishment to the year 1693, making it the third oldest opera venue in Europe after La Fenice (Venice, Italy) and the Hamburg State Opera (Hamburg, Germany). Leipzig is also home to the University of Music and Theatre \"Felix Mendelssohn Bartholdy\". It was during a stay in this city that Friedrich Schiller wrote his \"Ode to Joy\". Leipzig Gewandhaus Orchestra established in 1743 is one of the oldest symphony orchestra in the world.\n\nHistory \n\nName \n\nLeipzig is derived from the Slavic word ', which means \"settlement where the linden trees (British English: lime trees; U.S. English: basswood trees) stand\".Hanswilhelm Haefs. Das 2. Handbuch des nutzlosen Wissens.   An older spelling of the name in English is . The Latin name  was also used. The name is cognate with  () in Russia and  in Latvia.\n\nIn 1937 the Nazi government officially renamed the city ' (Imperial Trade Fair City Leipzig).\n\nSince 1989 Leipzig has been informally dubbed \"Hero City\" (), in recognition of the role that the Monday demonstrations there played in the fall of the East German regime – the formulation alludes to the honorary title awarded in the former Soviet Union to certain cities that played a key role in the victory of the Allies during the Second World War. The common usage of this nickname for Leipzig up until the present is reflected, for example, in the name of a popular blog for local arts and culture, Heldenstadt.de.\n\nMore recently, the city is sometimes nicknamed \"Boomtown of eastern Germany\", \"Hypezig\" or \"The better Berlin\" for being celebrated by the media as a hip urban centre for the vital lifestyle and creative scene with many startups.\n\nOrigins \n\nLeipzig was first documented in 1015 in the chronicles of Bishop Thietmar of Merseburg as ' ( VII, 25) and endowed with city and market privileges in 1165 by Otto the Rich. Leipzig Trade Fair, started in the Middle Ages, became an event of international importance and is the oldest remaining trade fair in the world.\n\nThere are records of commercial fishing operations on the river  in Leipzig dating back to 1305, when the Margrave Dietrich the Younger granted the fishing rights to the church and convent of St Thomas.\n\nThere were a number of monasteries in and around the city, including a Franciscan monastery after which the  (Barefoot Alley) is named and a monastery of Irish monks (, destroyed in 1544) near the present day  (the old ').\n\nThe foundation of the University of Leipzig in 1409 initiated the city's development into a centre of German law and the publishing industry, and towards being the location of the ' (Imperial Court of Justice) and the German National Library (founded in 1912).\n\nDuring the Thirty Years' War, two battles took place in , about 8 km outside Leipzig city walls. The first Battle of Breitenfeld took place in 1631 and the second in 1642. Both battles resulted in victories for the Swedish-led side.\n\nOn 24 December 1701, an oil-fueled street lighting system was introduced. The city employed light guards who had to follow a specific schedule to ensure the punctual lighting of the 700 lanterns.\n\n19th century \n\nThe Leipzig region was the arena of the 1813 Battle of Leipzig between Napoleonic France and an allied coalition of Prussia, Russia, Austria and Sweden. It was the largest battle in Europe prior to the First World War and the coalition victory ended Napoleon's presence in Germany and would ultimately lead to his first exile on Elba. In 1913 the Monument to the Battle of the Nations celebrating the centenary of this event was completed.\n\nA terminus of the first German long distance railway to Dresden (the capital of Saxony) in 1839, Leipzig became a hub of Central European railway traffic, with Leipzig Hauptbahnhof the largest terminal station by area in Europe. The railway station has two grand entrance halls, the eastern one for the Royal Saxon State Railways and the western one for the Prussian state railways.\n\nLeipzig became a centre of the German and Saxon liberal movements. The first German labor party, the General German Workers' Association (Allgemeiner Deutscher Arbeiterverein, ADAV) was founded in Leipzig on 23 May 1863 by Ferdinand Lassalle; about 600 workers from across Germany travelled to the foundation on the new railway line. Leipzig expanded rapidly to more than 700.000 inhabitants. Huge Gründerzeit areas were built, which mostly survived both war and post-war demolition.\n\n20th century \n\nWith the opening of a fifth production hall in 1907, the Leipziger Baumwollspinnerei became the largest cotton mill company on the continent, housing over 240,000 spindles. Daily production surpassed 5 million kilograms of yarn.\n\nThe city's mayor from 1930 to 1937, Carl Friedrich Goerdeler was a noted opponent of the Nazi regime in Germany. He resigned in 1937 when, in his absence, his Nazi deputy ordered the destruction of the city's statue of Felix Mendelssohn. On Kristallnacht in 1938, one of the city's most architecturally significant buildings, the 1855 Moorish Revival Leipzig synagogue was deliberately destroyed.\n\nSeveral thousand forced labourers were stationed in Leipzig during Second World War.\n\nThe city was also heavily damaged by Allied bombing during the Second World War. Unlike its neighbouring city of Dresden this was largely conventional bombing, with high explosives rather than incendiaries. The resultant pattern of loss was a patchwork, rather than wholesale loss of its centre, but was nevertheless extensive.\n\nThe Allied ground advance into Germany reached Leipzig in late April 1945. The U.S. 2nd Infantry Division and U.S. 69th Infantry Division fought into the city on 18 April and completed its capture after fierce urban action, in which fighting was often house-to-house and block-to-block, on 19 April 1945.Stanton, Shelby, World War II Order of Battle: An Encyclopedic Reference to U.S. Army Ground Forces from Battalion through Division, 1939–1946 (Revised Edition, 2006), Stackpole Books, p. 78, 139. In April 1945 the Deputy Mayor of Leipzig, Ernest Lisso, his wife, daughter and a Volkssturm Major Walter Dönicke committed suicide in Leipzig City Hall.\n\nThe United States turned the city over to the Red Army as it pulled back from the line of contact with Soviet forces in July 1945 to the predesignated occupation zone boundaries. Leipzig became one of the major cities of the German Democratic Republic (East Germany).\n\nIn the mid-20th century, the city's trade fair assumed renewed importance as a point of contact with the Comecon Eastern Europe economic bloc, of which East Germany was a member. At this time, trade fairs were held at a site in the south of the city, near the Monument to the Battle of the Nations. In October 1989, after prayers for peace at St. Nicholas Church, established in 1983 as part of the peace movement, the Monday demonstrations started as the most prominent mass protest against the East German government.David Brebis (ed.), Michelin guide to Germany, Greenville (2006), p. 324. + video. Since the reunification of Germany, Leipzig has undergone significant change with the restoration of some historical buildings, the demolition of others, and the development of a modern transport infrastructure.\n\n21st century \n\nNowadays, Leipzig is an economic center in Germany. Since the 2010s, Leipzig is being celebrated by the media as a hip urban center with a very high quality of living. It is often called \"The new Berlin\".http://www.berliner-zeitung.de/berlin/leipzig-vs--berlin--natuerlich-ist-leipzig-das-bessere-berlin--6599924 Leipzig is also Germany's fastest growing city. Leipzig was the German candidate for the 2012 Summer Olympics, but was unsuccessful. After ten years of construction, the Leipzig City Tunnel opened on 14 December 2013. Leipzig forms the centerpiece of the S-Bahn Mitteldeutschland public transit system, which operates in the four German states of Saxony, Saxony-Anhalt, Thuringia and Brandenburg.\n\nGeography \n\nLocation \n\nLeipzig lies at the confluence of the rivers White Elster, Pleisse and Parthe, in the Leipzig Bay, on the most southerly part of the North German Plain, which is the part of the North European Plain in Germany. The site is characterized by swampy areas such as the Leipzig Riverside Forest, though there are also some limestone areas to the north of the city. The landscape is mostly flat though there is also some evidence of moraine and drumlins.\n\nAlthough there are some forest parks within the city limits, the area surrounding Leipzig is relatively unforested. During the 20th century, there were several open-cast mines in the region, many of which are being converted to use as lakes. Also see: Neuseenland\n\nLeipzig is also situated at the intersection of the ancient roads known as the Via Regia (King's highway), which traversed Germanic lands in an east-west direction, and Via Imperii (Imperial Highway), a north-south road.\n\nLeipzig was a walled city in the Middle Ages and the current \"ring\" road around the historic center of the city corresponds to the old city walls.\n\nSubdivision \n\nLeipzig has been divided administratively since 1992 into ten districts, which in turn contain a total of 63 subdistricts. Some of these correspond to outlying villages which were annexed by Leipzig.\n\nNeighbouring communities \n\nClimate \n\nLeipzig has an oceanic climate (Cfb in the Köppen climate classification). Winters are variably mild to cold, with an average of around 1 °C. Summers are generally warm, averaging at 19 °C with daytime temperatures of 24 °C. Precipitation is around twice as small in winter than summer, however, winters aren't dry. The amount of sunshine differs quite between winter and summer, with around 51 hours of sunshine in December (1.7 hours a day) on average and 229 hours of sunshine in July (7.4 hours a day).\n\nDemographics \n\nLeipzig has a population of about 570,000. In 1930 the population reached its historical peak of over 700,000. It decreased steadily from 1950 until 1989 to about 530,000. In the 1990s the population decreased rather rapidly to 437,000 in 1998. This reduction was mostly due to outward migration and suburbanization. After almost doubling the city area by incorporation of surrounding towns in 1999, the number stabilized and started to rise again with an increase of 1,000 in 2000.:de:Einwohnerentwicklung von Leipzig#Von 1945 bis 1989 , Leipzig is the fastest-growing city in Germany with over 500,000 inhabitants.\nThe growth of the past 10–15 years has mostly been due to inward migration. In recent years inward migration accelerated, reaching an increase of 12,917 in 2014.http://www.statistik.sachsen.de/download/010_GB-Bev/02_03_23_tab.pdf\n\nIn the years following German reunification many people of working age took the opportunity to move to the states of the former West Germany to seek work. This was a contributory factor to falling birth rates. Births dropped from 7,000 in 1988 to less than 3,000 in 1994. However, the number of children born in Leipzig has risen since the late 1990s. In 2011 it reached 5,490 newborns resulting in a RNI of -17.7 (-393.7 in 1995).http://www.statistik.sachsen.de/download/010_GB-Bev/02_03_20_tab.pdf\n\nThe unemployment rate decreased from 18.2% in 2003 to 9.8% in 2014 and 7.6% in June 2017.\n\nThe percentage of the population with an immigrant background is quite low compared with other German cities. , only 5.6% of the population were foreigners, compared to the German overall average of 7.7%.https://www.destatis.de/DE/PresseService/Presse/Pressekonferenzen/2013/Zensus2011/bevoelkerung_zensus2011.pdf?__blob=publicationFile\n\nThe number of people with an immigrant background (immigrants and their children) grew from 49323 in 2012 to 77559 in 2016 making it 13.3% of the city's population( Leipzig population 579530 in 2016).\n\nThe top twelve minorities (first- and second-generation) in Leipzig by country of origin in 2016 are:\n\nCulture, sights and cityscape \n\nArchitecture \n\nThe historic central area of Leipzig features a Renaissance-style ensemble of buildings from the 16th century, including the old city hall in the market place. There are also several baroque period trading houses and former residences of rich merchants. As Leipzig grew considerably during the economic boom of the late 19th century, the town has many buildings in the historicist style representative of the Gründerzeit era. Approximately 35% of Leipzig's flats are in buildings of this type. The new city hall, completed in 1905, displays the same style.\n\nSome 64,000 apartments in Leipzig were built in Plattenbau buildings during the Communist rule in East Germany.:de:Liste der Plattenbausiedlungen in Sachsen#Leipzig and although some of these have been demolished and the numbers living in this type of accommodation have declined in recent years, at least 10% of Leipzig's population (50,000 people) are still living in Plattenbau accommodation.:de:Plattenbauten in Leipzig Grünau, for example, has approximately 40,000 people living in this sort of accommodation.\n\nThe building of the St. Paul's Church was destroyed by the communists in 1968 to make room for a new main building of the university. After some debate, the city decided to establish a new, mainly secular building at the same location, called Paulinum, which was completed in 2012. Its architecture alludes to the look of the former church and it includes a room for religious use.\n\nMany commercial buildings were built in the 1990s as a result of tax breaks after German reunification.\n\nTallest buildings and structures \n\nThe tallest structure in Leipzig is the chimney of the Stahl- und Hartgusswerk Bösdorf GmbH with 205 m. With 142 m, the City-Hochhaus Leipzig is the tallest high rise-building in Leipzig. From 1972 to 1973 it was Germany's tallest building.\n\nMuseums and arts \n\nThe city's contemporary arts highlight was the Neo Rauch retrospective opening in April 2010 at the Leipzig Museum of Fine Arts. This is a show devoted to the father of the New Leipzig SchoolNeue Leipziger Schule (German Wikipedia entry) of artists. According to The New York Times, this scene \"has been the toast of the contemporary art world\" in the past decade. Furthermore, there are eleven galleries in the so-called Spinnerei.\n\nThe building complex of the Grassi Museum contains three more of Leipzig's major collections: the Ethnography Museum, Applied Arts Museum and Musical Instrument Museum (the last of which is run by the University of Leipzig). The university also runs the Museum of Antiquities.\n\nFounded in March 2015, the G2 Kunsthalle houses the Hildebrand Collection. The private collection focuses on the so-called New Leipzig School. Leipzig´s first private museum dedicated to contemporary art in Leipzig after the turn of the millennium is located in the city centre close to the famous St. Thomas Church in the third floor of the former GDR processing centre.\n\nExamples for other museums in Leipzig:\n* The German Museum of Books and Writing is the world's oldest museum of its kind, founded in 1884.\n* The Egyptian Museum of the University of Leipzig comprises a collection of about 7,000 artefacts from several millennia.\n* The Schillerhouse is the house where Schiller lived in summer 1785.\n* The Zeitgeschichtliches Forum Leipzig (Forum of Contemporary History) shows the history of the German division and the everyday life in the communist dictatorship of East Germany.\n* Naturkundemuseum Leipzig is the natural history museum of the city.\n* The Leipzig Panometer is a visual panorama displayed inside a former gasometer, accompanied by a thematic exhibition.\n* The \"Museum in der Runden Ecke\" is the best known museum in the city. It deals with the operation of the Stasi State Security of former East Germany.\n* Johann Sebastian Bach lived from 1723 until his death in Leipzig. The Bach Archive is an institution for the documentation and research of the life and work.\n\nFile:DNB2012.JPG|German Museum of Books and Writing\nFile:Ägyptisches Museum Leipzig 099.jpg|Exhibits of the Egyptian Museum\nFile:Leipzig-Grassi-Museen.jpg|Grassi Museum\nFile:LE-Connewitz Gasometer I Arena-02.jpg|Inside Gasometer, next to the Panometer\nFile:Runde Ecke Leipzig.jpg|Museum in der Runden Ecke\nFile:Museum der bildenden Künste.JPG|Museum of Fine Arts\nFile:Baumwollspinnerei.jpg|Baumwollspinnerei\n\nMain sights \n\n* Leipzig Zoological Garden is one of the most modern zoos in Europe with approximately 850 different species. It houses the world's largest zoological facilities for primates (Pongoland). Gondwanaland is the world's largest indoor rainforest hall.\n* Monument to the Battle of the Nations (Völkerschlachtdenkmal) (Battle of the Nations Monument): one of the largest monuments in Europe, built to commemorate the victorious battle against Napoleonic troops.\n* Bundesverwaltungsgericht: Germany's federal administrative court was the site of the Reichsgericht, the highest state court between 1888 and 1945.\n* New City Hall: the city's administrative building was built upon the remains of the Pleissenburg, a castle that was the site of the 1519 debate between Johann Eck and Martin Luther. It is also Germany's tallest town hall.\n* Old City Hall on Marktplatz: the old city hall was built in 1556 and houses a museum of the city's history.\n* City-Hochhaus Leipzig: built in 1972, the city's tallest building is one of the top 25 tallest buildings in Germany.Tallest building in Germany\n* The Augusteum and Paulinum form the new main campus of the University of Leipzig.\n* international trade fair centre in the north of the city is home to the world's largest levitated glass hall.[http://exhibition.av-solutions.info/leipzig Leipzig] \n* Leipzig Hauptbahnhof is the world's largest railway station by floor area and a shopping destination.\n* Auerbach's Cellar: a young Goethe ate and drank in this basement-level restaurant while studying in Leipzig; it is the venue of a scene from his play Faust.\n* The Old Leipzig bourse at Naschmarkt with a monument of Johann Wolfgang von Goethe.\n* South Cemetery (Südfriedhof) is, with an area of 82 hectares, the largest cemetery in Leipzig.\n* The German National Library has two locations, one of them in Leipzig.\n* Leipzig Bayerischer Bahnhof is Germany's oldest preserved railway station.\n* Gohliser Schlösschen\n* Leipzig Synagogue was destroyed in 1938. Now a memorial stands on the same spot. Where the pews once were, 140 bronze chairs take their place.\n\nFile:Leipzig - Zoo - Gondwanaland in 14 ies.jpg|Inside Gondwanaland at Leipzig Zoological Garden\nFile:VölkerschlachtdenkmalLeipzig1.jpg|Monument to the Battle of the Nations\nFile:Bundesverwaltungsgericht 2, Leipzig.jpg|Federal Administrative Court of Germany\nFile:Neues Rathaus Leipzig jpg8.jpg|New city hall\nFile:Leipzig 03.jpg|Old city hall at market square\nFile:Rainbowflash 2013 Leipzig (4).jpg|City-Hochhaus\nFile:Uni Leipzig Paulinum Universitätskirche St. Pauli 216-cvh.jpg|New Augusteum of the University of Leipzig\nFile:Messe Pano DRI.jpg|Leipzig Trade Fair\nFile:Bahnhof Leipzig von Panorama Tower 2013.jpg|Leipzig main station\nFile:Schilder an Auerbachs Keller 2013.jpg|Auerbachs Keller in the Mädlerpassage\nFile:Goethe Statue Naschmarkt Leipzig.jpg|Old Leipzig bourse\nFile:Suedfriedhof Leipzig.jpg|Südfriedhof\nFile:BibLeipzigaussen.JPG|German National Library\nFile:City-Tunnel Leipzig - Station Bayerischer Bahnhof 01 (Zugang 1).JPG|Leipzig Bayerischer Bahnhof\nFile:Leipzig Gohliser Schloesschen.jpg|Gohliser Schlösschen\nFile:Synagogue Memorial (Leipzig) (3).jpg|Leipzig Synagogue Memorial\n\nChurches \n\n* St. Thomas's Church (Thomaskirche): Most famous as the place where Johann Sebastian Bach worked as a cantor and home to the renowned boys choir Thomanerchor. A monument to Felix Mendelssohn stands in front of this church. Destroyed by the Nazis in 1936, the statue was re-erected on 18 October 2008.\n* St. Nicholas's Church (Nikolaikirche), for which Bach was also responsible. The weekly Montagsgebet (Monday prayer) held here became the starting point of peaceful Monday demonstrations against the DDR regime in the 1980s.\n* St. Peter's has the highest tower of any church in Leipzig, at 87 m.\n* The new Propsteikirche, opened in 2015.\n* The Continental Reformed Church of Leipzig (Evangelisch-reformierte Kirche) is one of the most prominent buildings on the Leipzig Innercity ring.\n* The Russian Church of Leipzig is the Russian-Orthodox church of Leipzig.\n* St. Michael's Church is one of the landmarks of Gohlis district\n\nFile:Nikolaikirche Leipzig 2009.jpg|St. Nicholas Church.\nFile:Leipzig Thomaskirche.jpg|St. Thomas Church.\nFile:Peterskirche Leipzig easyHDR.jpg|St. Peter.\nFile:Neue Propsteikirche St. Trinitatis Leipzig.jpg|Propsteikirche in May 2015, New Town Hall in the background\nFile:Evangel.-Reform. Kirche (3668182160).jpg|Continental Reformed church of Leipzig.\nFile:Leipzig Russische Gedaechtniskirche.jpg|Russian Church of Leipzig.\nFile:Michaelis-SWL.jpg|St. Michael's Church with the headquarters of Stadtwerke Leipzig to the right.\n\nParks and lakes \n\nLeipzig is well known for its large parks. The Leipziger Auwald (riparian forest) lies mostly within the city limits. Neuseenland is an area south of Leipzig where old open-cast mines are being converted into a huge lake district. It is planned to be finished in 2060.\n* Leipzig Botanical Garden is the oldest of its kind in Germany. It contains a total of some 7,000 species, of which nearly 3,000 species comprise ten special collections.\n* Johannapark and Clara-Zetkin-Park are the most prominent parks in the Leipzig city centre.\n* Leipziger Auwald covers a total area of approx. 2,500 hectares. The Rosental is a park in the north of the forest and borders Leipzig Zoo.\n* Wildpark in Connewitz, showing 25 species.\n\nFile:SDC11449 - Epipedobates anthonyi.JPG|Inside Leipzig Botanical Garden\nFile:Johannapark Leipzig.JPG|Johannapark\nFile:Leipziger Auenwald April 2014 005.JPG|Leipziger Auwald\nFile:Sonnenaufgang Rosental Leipzig.jpg|Rosental in the morning\nFile:Leipzig Friedenspark.jpg|Friedenspark\nFile:Markkleeberger See Strand.jpg|Markkleeberger See\nFile:Cospudener See (1) 2005-09-09.JPG|Cospudener See\n\nMusic \n\nJohann Sebastian Bach worked in Leipzig from 1723 to 1750, conducting the Thomanerchor (St. Thomas Church Choir), at the St. Thomas Church, the St. Nicholas Church and the Paulinerkirche, the university church of Leipzig (destroyed in 1968). The composer Richard Wagner was born in Leipzig in 1813, in the Brühl. Robert Schumann was also active in Leipzig music, having been invited by Felix Mendelssohn when the latter established Germany's first musical conservatoire in the city in 1843. Gustav Mahler was second conductor (working under Artur Nikisch) at the Leipzig Opera from June 1886 until May 1888, and achieved his first great recognition while there by completing and publishing Carl Maria von Weber's opera Die Drei Pintos, and Mahler also completed his own 1st Symphony while living there.\n\nThis conservatory is today the University of Music and Theatre Leipzig A broad range of subjects are taught, including artistic and teacher training in all orchestral instruments, voice, interpretation, coaching, piano chamber music, orchestral conducting, choir conducting and musical composition in various musical styles. The drama departments teach acting and scriptwriting.\n\nThe Bach-Archiv Leipzig, an institution for the documentation and research of the life and work of Bach (and also of the Bach family), was founded in Leipzig in 1950 by Werner Neumann. The Bach-Archiv organizes the prestigious International Johann Sebastian Bach Competition, initiated in 1950 as part of a music festival marking the bicentennial of Bach's death. The competition is now held every two years in three changing categories. The Bach-Archiv also organizes performances, especially the international festival Bachfest Leipzig (de) and runs the Bach-Museum.\n\nThe city's musical tradition is also reflected in the worldwide fame of the Leipzig Gewandhaus Orchestra under the baton of chief conductor Riccardo Chailly and the Thomanerchor.\n\nThe MDR Leipzig Radio Symphony Orchestra is Leipzig's second large symphony orchestra. Its current chief conductor is Kristjan Järvi. Both the Gewandhausorchester and the MDR Leipzig Radio Symphony Orchestra reside in the Gewandhaus concert hall.\n\nFor over 60 years Leipzig has been offering a \"school concert programme for children in Germany, with over 140 concerts every year in venues such as the Gewandhaus and over 40,000 children attending.\n\nAs for contemporary music, Leipzig is known for its independent music scene and subcultural events. Leipzig has for 20 years been home to the world's largest Gothic festival, the annual Wave-Gotik-Treffen (WGT), where thousands of fans of gothic and dark styled music from across Europe gather in the early summer. The first Wave Gotik Treffen was held at the Eiskeller club, today known as Conne Island, in the Connewitz district. Mayhem's notorious album Live in Leipzig was also recorded at the Eiskeller club. Leipzig Pop Up is an annual music trade fair for the independent music scene as well as a music festival taking place on Pentecost weekend. Its most famous indie-labels are Moon Harbour Recordings (House) and Kann Records (House/Techno/Psychedelic). Several venues offer live music on a daily basis, including the Moritzbastei which was once part of the city's fortifications, and is one of the oldest student clubs in Europe with concerts in various styles. For over 15 years \"Tonelli's\" has been offering free weekly concerts every day of the week, though door charges may apply Saturdays.\n\nThe cover photo for Beirut's 2005 album Gulag Orkestar was, according to the sleeve notes, stolen from a Leipzig library by Zach Condon.\n\nThe city of Leipzig is also the birthplace of Till Lindemann, best known as the lead vocalist of Rammstein, a band formed in 1994.\n\nFile:Opernhaus Leipzig Abend Nacht.jpg|Leipzig Opera\nFile:AUGUSTUSPLATZ-014.jpg|View over Augustusplatz with the Gewandhaus.\nFile:Leipzig - Universitätsstraße - Moritzbastei 05 ies.jpg|Moritzbastei is the largest student club in Germany and is famous for its atmosphere and large number of cultural and music events.\nFile:Johann Sebastian Bach Denkmal Leipzig.jpg|Monument of Johann Sebastian Bach\nFile:Wahren3.jpg|Haus Auensee, a concert hall\n\nAnnual events \n\n* Auto Mobil International (AMI) motor show\n* AMITEC, trade fair for vehicle maintenance, care, servicing and repairs in Germany and Central Europe\n* A cappella: vocal music festival, organized by the Ensemble amarcord\n* Bach-Fest: Johann Sebastian Bach-festival\n* Christmas market (since 1767)\n* Dok Leipzig: international festival for documentary and animated film\n* Jazztage, contemporary jazz festival\n* Ladyfest Leipzig (August) Emancipatoric, feminist punk and electro festival\n* Leipzig Book Fair: the second largest German book fair after Frankfurt\n* , festival celebrating the demonstrations leading up to the collapse of the East German regime\n* OPER unplugged with Music Dance Theatre by Heike Hennig & Co\n* Stadtfest: city festival\n* Wave-Gotik-Treffen at Pentecost: world's largest goth or \"dark culture\" festival\n* Leipzig Pop Up\n\nFile:Leipzig Messe Kongresszentrum Glashalle.jpg|Leipzig Trade Fair\nFile:Leipziger Buchmesse 2015.jpg|Leipzig Book Fair 2015\nFile:2016 WGT 002 Belantis.jpg|Wave-Gotik-Treffen 2016, Belantis park in the background\nFile:Leipziger Weihnachtsmarkt Eingang.jpg|Leipzig Christmas market entrance\nFile:Dokwoche.jpg|DOK Leipzig\n\nSports \n\nMore than 300 sport clubs in the city represent 78 different disciplines. Over 400 athletic facilities are available to citizens and club members.\n\nFootball \n\nThe German Football Association (DFB) was founded in Leipzig in 1900. The city was the venue for the 2006 FIFA World Cup draw, and hosted four first-round matches and one match in the round of 16 in the central stadium.\n\nVfB Leipzig, now 1. FC Lokomotive Leipzig, won the first national Association football championship in 1903. The club was reformed as 1. FC Lokomotive Leipzig in 1966 and has had a glorious past in international competition as well, having been champions of the 1965–66 Intertoto Cup, semi-finalists in the 1973–74 UEFA Cup, and runners-up in the 1986–87 European Cup Winners' Cup.\n\nIn May 2009 Red Bull entered the local market after being denied the right to buy into FC Sachsen Leipzig in 2006. The newly founded RB Leipzig declared the intention to come up through the ranks of German football to bring Bundesliga football back to the region. RB Leipzig was finally promoted to the top level of the Bundesliga after finishing the 2015–16 2. Bundesliga season as runners-up.\n\nList of Leipzig men and women's football clubs playing at state level and above:\n\nNote 1: The RB Leipzig women's football team was formed in 2016 and began play in the 2016-17 season.\nNote 2: The club began play in the 2008-09 season.\n\nIce hockey \n\nSince the beginning of the 20th century Ice hockey gained popularity and several local clubs established departments dedicated to that sport.\n\nHandball \n\nSC DHfK Leipzig is the men's handball club in Leipzig and were six times (1959, 1960, 1961, 1962, 1965 and 1966) the champion of East Germany handball league and was winner of EHF Champions League in 1966. They finally promoted to Handball-Bundesliga as champions of 2. Bundesliga in 2014–15 season. They play in the Arena Leipzig witch have a capacity of 6,327 spectators in HBL games but can take up to 7,532 spectators for handball in maximum capacity.\n\nHandball-Club Leipzig is one of the most successful women's handball clubs in Germany, winning 20 domestic championships since 1956 and 3 Champions League titles. The team was however relegated to the third tier league in 2017 due to failing to achieve the economic standard demanded by the league licence.\n\nOther sports \n\nFrom 1950 to 1990 Leipzig was host of the Deutsche Hochschule für Körperkultur (DHfK, German College of Physical Culture), the national sports college of the GDR.\n\nLeipzig also hosted the Fencing World Cup in 2005 and hosts a number of international competitions in a variety of sports each year.\n\nLeipzig made a bid to host the 2012 Summer Olympic Games. The bid did not make the shortlist after the International Olympic Committee pared the bids down to 5.\n\nMarkkleeberger See is a new lake next to Markkleeberg, a suburb on the south side of Leipzig. A former open-pit coal mine, it was flooded in 1999 with groundwater and developed in 2006 as a tourist area. On its southeastern shore is Germany's only pump-powered artificial whitewater slalom course, Markkleeberg Canoe Park (Kanupark Markkleeberg), a venue which rivals the Eiskanal in Augsburg for training and international canoe/kayak competition.\n\nLeipzig Rugby Club competes in the German Rugby Bundesliga but finished at the bottom of their group in 2013.\n\nFood and drink \n\n* An all-season local dish is Leipziger Allerlei, a stew consisting of seasonal vegetables and crayfish.\n* Leipziger Lerche is a shortcrust pastry dish filled with crushed almonds, nuts and strawberry jam; the name (\"Leipzig lark\") comes from a lark pâté which was a Leipzig speciality until the banning of songbird hunting in Saxony in 1876.\n* Gose is a locally brewed top-fermenting sour beer that originated in the Goslar region and in the 18th century became popular in Leipzig.\n\nFile:Leipziger Lerchen.jpg|Leipziger Lerchen\nFile:Goseflasche Pressglas.jpg|Historical Gose bottle (ca. 1900)\n\nEducation \n\nUniversity \n\nLeipzig University, founded 1409, is one of Europe's oldest universities. The philosopher and mathematician Gottfried Wilhelm Leibniz was born in Leipzig in 1646, and attended the university from 1661 to 1666. Nobel Prize laureate Werner Heisenberg worked here as a physics professor (from 1927 to 1942), as did Nobel Prize laureates Gustav Ludwig Hertz (physics), Wilhelm Ostwald (chemistry) and Theodor Mommsen (Nobel Prize in literature). Other former staff of faculty include mineralogist Georg Agricola, writer Gotthold Ephraim Lessing, philosopher Ernst Bloch, eccentric founder of psychophysics Gustav Theodor Fechner, and psychologist Wilhelm Wundt. Among the university's many noteworthy students were writers Johann Wolfgang Goethe and Erich Kästner, and philosopher Friedrich Nietzsche, political activist Karl Liebknecht, and composer Richard Wagner. Germany's chancellor since 2006, Angela Merkel, studied physics at Leipzig University. The university has about 30,000 students.\n\nA part of Leipzig University is the German Institute for Literature which was founded in 1955 under the name \"Johannes R. Becher-Institut\". Many noted writers have graduated from this school, including Heinz Czechowski, Kurt Drawert, Adolf Endler, Ralph Giordano, Kerstin Hensel, Sarah and Rainer Kirsch, Angela Krauß, Erich Loest, Fred Wander. After its closure in 1990 the institute was refounded in 1995 with new teachers.\n\nVisual arts and theatre \n\nThe Academy of Visual Arts (Hochschule für Grafik und Buchkunst) was established in 1764. Its 530 students () are enrolled in courses in painting and graphics, book design/graphic design, photography and media art. The school also houses an Institute for Theory.\n\nThe University of Music and Theatre offers a broad range of subjects ranging from training in orchestral instruments, voice, interpretation, coaching, piano chamber music, orchestral conducting, choir conducting and musical composition to acting and scriptwriting.\n\nUniversity of Applied Science \n\nThe Leipzig University of Applied Sciences (HTWK) has approximately 6,200 students () and is () the second biggest institution of higher education in Leipzig. It was founded in 1992, merging several older schools. As a university of applied sciences (German: Fachhochschule) its status is slightly below that of a university, with more emphasis on the practical part of the education. The HTWK offers many engineering courses, as well as courses in computer science, mathematics, business administration, librarianship, museum studies and social work. It is mainly located in the south of the city.\n\nLeipzig Graduate School \n\nThe private Leipzig Graduate School of Management, (in German Handelshochschule Leipzig (HHL)), is the oldest business school in Germany. According to The Economist, HHL is one of the best schools in the world, rankend at number six overall.\n\nOthers \n\nAmong the research institutes located in Leipzig, three belong to the Max Planck Society. These are the Max Planck Institute for Mathematics in the Sciences, Max Planck Institute for Human Cognitive and Brain Sciences, and Max Planck Institute for Evolutionary Anthropology. Two more are Fraunhofer Society institutes. Others are the Helmholtz Centre for Environmental Research, part of the Helmholtz Association of German Research Centres, and the Leibniz-Institute for Tropospheric Research.\n\nLeipzig is home to one of the world's oldest schools Thomasschule zu Leipzig (St. Thomas' School, Leipzig), which gained fame for its long association with the Bach family of musicians and composers.\n\nThe Lutheran Theological Seminary is a seminary of the Evangelical Lutheran Free Church in Leipzig. The seminary trains students to become pastors for the Evangelical Lutheran Free Church or for member church bodies of the Confessional Evangelical Lutheran Conference.\n\nEconomy \n\nThe city is a location for automobile manufacturing by BMW and Porsche in large plants north of the city. In 2011 and 2012 DHL transferred the bulk of its European air operations from Brussels Airport to Leipzig/Halle Airport. Kirow Ardelt AG, the world market leader in breakdown cranes, is based in Leipzig. The city also houses the European Energy Exchange, the leading energy exchange in Central Europe.\n\nSome of the largest employers in the area (outside of manufacturing) include software companies such as Spreadshirt,  and the various schools and universities in and around the Leipzig/Halle region. The University of Leipzig attracts millions of euros of investment yearly and is in the middle of a massive construction and refurbishment to celebrate its 600th anniversary.\n\nLeipzig also benefits from world leading medical research (Leipzig Heart Centre) and a growing biotechnology industry.\n\nMany bars, restaurants and stores found in the downtown area are patronized by German and foreign tourists. Leipzig Hauptbahnhof itself is the location of a shopping mall. Leipzig is one of Germany's most visited cities with over 2.7 million overnight stays in 2013.\n\nIn 2010, Leipzig was included in the top 10 cities to visit by The New York Times, and ranked 39th globally out of 289 cities for innovation in the 4th Innovation Cities Index published by Australian agency 2thinknow. In 2015, Leipzig have among the 30 largest German cities the third best prospects for the future. In recent years Leipzig has often been nicknamed the \"Boomtown of eastern Germany\" or \"Hypezig\".  it had the highest rate of population growth of any German city.\n\nCompanies with operations in or around Leipzig include:\n* Amazon\n* Blüthner: piano-manufacturing\n* BMW\n* DHL\n* Porsche\n* Siemens\n* Future Electronics\n\nFile:Porsche Diamond.jpg|Porsche Diamond, the customer center building of Porsche Leipzig\nFile:BMW Leipzig MEDIA Download Luftaufnahme 3 max.jpg|BMW production facility in Leipzig\nFile:Amazon.de Versandhaus Leipzig.jpg|Amazon in Leipzig\nFile:EAT LEJ Hangar.jpg|Leipzig is the hub of DHL\nFile:Löhrs Carré Leipzig.JPG|Headquarters of the Sparkasse Leipzig bank\nFile:Markkleeberger See Bootsanlegestelle.jpg|Tourism in and around Leipzig plays a significant role, the photo shows the Markkleeberger See\nFile:Höfe am Brühl 20120928-3.jpg|Leipzig is a well known shopping destination (picture shows the Höfe am Brühl)\n\nMedia \n\n* MDR, one of Germany's public broadcasters, has its headquarters and main television studios in the city. It provides programmes to various TV and radio networks and has its own symphony orchestra, choir and a ballet.\n* Leipziger Volkszeitung (LVZ) is the city's only daily newspaper. Founded in 1894, it has published under several different forms of government. The monthly magazine Kreuzer specializes in culture, festivities and the arts in Leipzig. Leipzig was also home to the world's first daily newspaper in modern times. The \"Einkommende Zeitungen\" were first published in 1650.:de:Einkommende Zeitungen\n* Leipzig has one daily or semi-daily English-language publication, \"The Leipzig Glocal.\" It is an online-based magazine and blog that caters to an international as well as local audience.\"ABOUT US.\" The Leipzig Glocal. http://leipglo.com/about/ (Retrieved 8 February 2017) Besides publishing pages on jobs, doctors and movies available in English and other languages, the site's team of authors writes articles about lifestyle, arts & culture, politics, entertainment, Leipzig events, etc.\"Leipzig: ein Paradies für kreative Blogs.\" Mephisto 97.6. https://mephisto976.de/news/leipzig-ein-paradies-fuer-kreative-blogs-55338 (Retrieved 8 February 2017).\n* Once known for its large number of publishing houses, Leipzig had been called Buch-Stadt (book city)., the most notable of them being branches of Brockhaus and Insel Verlag. Few are left after the years of economic decline during the German Democratic Republic, during which time Frankfurt developed as a much more important publishing center. Reclam, founded in 1828, was one of the large publishing houses to move away. Leipzig still has a book fair, but Frankfurt's is far bigger.\n* The German Library (Deutsche Bücherei) in Leipzig is part of Germany's National Library. Its task is to collect a copy of every book published in German.German National Library\n\nQuality of life \n\nIn December 2013, according to a study by Marktforschungsinstituts GfK, Leipzig was ranked as the most livable city in Germany and is one of the three European cities with the highest quality of living (after Groningen and Kraków). In 2015/2016, Leipzig is the second-best city for students in Germany (after Munich).\n\nIn a 2017 study, the Leipzig inner city ranks first of all large cities in Germany due to its urban aesthetics, gastronomy and shopping opportunities.\n\nIt has also the second-best future prospects of all cities in Germany, only surpassed by Munich.\n\nTransport \n\nRoad \n\nFounded at the crossing of Via Regia and Via Imperii, Leipzig has been a major interchange of inter-European traffic and commerce since medieval times. After the Reunification of Germany, immense efforts to restore and expand the traffic network have been undertaken and left the city area with an excellent infrastructure.\n\nSince 1936, Leipzig has been connected to the A 9 and A 14 autobahns via the Schkeuditzer Kreuz (Schkeuditz Cross) interchange and several exits. The A 38 completed the autobahn beltway around Leipzig in 2006.\n\nLike most German cities, Leipzig has a traffic layout designed to be bicycle-friendly. There is an extensive cycle network. In most of the one-way central streets, cyclists are explicitly allowed to cycle both ways. A few cycle paths have been built or declared since 1990.\n\nRail \n\nLeipzig Hauptbahnhof, opened in 1915, is at a junction of important north-to-south and west-to-east railway lines. The ICE train between Berlin and Munich stops in Leipzig and it takes approximately one hour from Berlin Hauptbahnhof and five hours from München Hauptbahnhof.\n\nAir \n\nLeipzig/Halle Airport is the main airport in the vicinity of the city. Leipzig/Halle Airport offers a number of seasonal vacation charter flights as well as regular scheduled services. The former military airport near Altenburg, Thuringia called Leipzig-Altenburg Airport about a half-hour drive from Leipzig was served by Ryanair until 2010.\n\nWater \n\nIn the first half of the 20th century, the construction of the Elster-Saale canal, White Elster and Saale was started in Leipzig in order to connect to the network of waterways. The outbreak of the Second World War stopped most of the work, though some may have continued through the use of forced labor. The Lindenauer port was almost completed but not yet connected to the Elster-Saale and Karl-Heine canal respectively. The Leipzig rivers (White Elster, New Luppe, Pleisse, and Parthe) in the city have largely artificial river beds and are supplemented by some channels. These waterways are suitable only for small leisure boat traffic.\n\nThrough the renovation and reconstruction of existing mill races and watercourses in the south of the city and flooded disused open cast mines, the city's navigable water network is being expanded. The city commissioned planning for a link between Karl Heine Canal and the disused Lindenauer port in 2008. Still more work was still scheduled to complete the Elster-Saale canal. Such a move would allow small boats to reach the Elbe from Leipzig. The intended completion date has been postponed because of an unacceptable cost-benefit ratio.\n\nPublic transport \n\nLeipzig has an extensive local public transport network. The city's tram and bus network is operated by the Leipziger Verkehrsbetriebe. Leipzig's tram network, at a length of , is the second biggest in Germany.\nLeipzig City Tunnel forms the centerpiece of an extensive S-Bahn network serving 1.2 million people in the Leipzig/Halle metropolitan area. The tunnel links the main station in the north with the Bayrische Bahnhof in the south.\n\nFile:Bahnhof Leipzig von Panorama Tower 2013.jpg|Leipzig Hauptbahnhof is the main hub of tram and rail network and the world's largest railway station by floor area\nFile:Leipzig NGT12-LEI Waldplatz defekt.jpg|Tram of Leipziger Verkehrsbetriebe\nFile:Leipzig Georg-Schumann-Strasse.jpg|Tramsystem at the Georg-Schumann-Straße\nFile:S-Bahnhof Leipzig Markt.jpg|Leipzig City Tunnel, part of Leipzig's new S-Bahn network\nFile:S-Bahn Mitteldeutschland. Talent 2,008,Station Leipzig Wilhelm-Leuschner-Platz.jpg|A new train of the S-Bahn Mitteldeutschland at Leipzig Wilhelm-Leuschner-Platz railway station, August 2016\nFile:S-Bahn Mitteldeutschland. Talent 2,027, Innenansicht Sitze.jpg|Inside the S-Bahn train\n\nQuotations \n\nMein Leipzig lob' ich mir! Es ist ein klein Paris und bildet seine Leute. (I praise my Leipzig! It is a small Paris and educates its people.) – Frosch, a university student in Goethe's Faust, Part One\n\nIch komme nach Leipzig, an den Ort, wo man die ganze Welt im Kleinen sehen kann. (I'm coming to Leipzig, to the place where one can see the whole world in miniature.) – Gotthold Ephraim Lessing\n\nExtra Lipsiam vivere est miserrime vivere. (To live outside Leipzig is to live miserably.) – Benedikt Carpzov the Younger\n\nDas angenehme Pleis-Athen, Behält den Ruhm vor allen, Auch allen zu gefallen, Denn es ist wunderschön. (The pleasurable Pleiss-Athens, earns its fame above all, appealing to every one, too, for it is mightily beauteous.) – Johann Sigismund Scholze\n\nInternational relations \n\nLeipzig is twinned with:\n\n*  Addis Ababa, Ethiopia, since 2004\n*  Birmingham, UK, since 1992\n*  Bologna, Italy, since 1962, renewed in 1997\n*  Brno, Czech Republic, since 1973, renewed in 1999\n*  Frankfurt am Main, Germany, since 1990\n*  Hanover, Germany, since 1987\n*  Herzliya, Israel, since 2010\n*  Houston, United States, since 1993\n*  Kiev, Ukraine, since 1961, renewed in 1992\n*  Kraków, Poland, since 1973, renewed in 1995\n*  Lyon, France, since 1981\n*  Nanjing, China, since 1988\n*  Thessaloniki, Greece, since 1984\n*  Travnik, Bosnia and Herzegovina, since 2003\n\nNotable residents \n\n17th century \n\n* Gottfried Wilhelm Leibniz; (1646–1716), philosopher and scientist, mathematician, diplomat\n* Johann Friedrich Mayer; (1650–1712), Lutheran theologian\n* Augustus Quirinus Rivinus, origin.  Bachmann ; (1652–1723), physician and botanist\n* Johann Sebastian Bach; (1685–1750), composer\n\n18th century \n\n* Johann Christian Bach; (1735–1782), youngest son of Johann Sebastian Bach, composer\n* Christian Gottfried Körner; (1756–1831), jurist and writer\n* Friedrich Arnold Brockhaus; (1772–1823), publisher, originator of the Brockhaus encyclopedia\n* Carl Gustav Carus; (1789–1869), doctor, painter and natural philosopher\n\n19th century \n\n1801–1850 \n\n* Christian Hermann Weisse; (1801–1866), Protestant theologian and philosopher\n* Felix Mendelssohn; (1809–1847), composer, pianist, organist and conductor\n* Robert Schumann; (1810–1856), composer and music critic\n* Richard Wagner; (1813–1883), composer, theatre director and conductor (among others opera  The Flying Dutchman )\n* Louise Otto-Peters; (1819–1895), suffragette, author, founder of the General German Women's Association\n\n* Clara Schumann; (1819–1896), pianist and composer\n* Carl Reinecke; (1824–1910), composer, conductor, and pianist\n* August Bebel; (1840–1913), socialist politician, co-founder of Germany's Social Democratic Party\n* Karl Wittgenstein; (1847–1913), entrepreneur\n\n1851–1900 \n\n* Hans Meyer; (1858–1929), geographer, Africanist and mountaineer, first European to reach the summit of Mount Kilimanjaro\n* Wilhelm Souchon; (1864–1946), Vice Admiral of the Imperial Navy, commander of the Ottoman and Bulgarian Navy\n* Karl Liebknecht; (1871–1919), socialist politician (co-founder of the Communist Party of Germany)\n\n* Carl Friedrich Goerdeler; (1884–1945), mayor, one of the leaders of conservative resistance against Hitler\n* Max Beckmann; (1884–1950), Expressionist painter, professor at art academies and schools\n* Wilhelm Backhaus; (1884–1969), pianist\n* Paul Frölich; (1884–1953), politician (KPD co-founder), executor and biographer of Rosa Luxemburg\n* Walter Ulbricht; (1893–1973), Communist politician (SED), GDR Chairman of the Council of State from 1960 to 1973\n* Ruth Fischer; (1895–1961), communist politician and journalist, co-founder of the CPA\n* Hanns Eisler; (1898–1962), composer (inter alia of the national anthem of the GDR.)\n* Bruno Apitz; (1900–1979), writer (Naked among wolves)\n\n20th century \n\n1901–1950 \n\n* Karl Eberhard Schöngarth; (1903–1946), SS officer and war criminal, executed in Hamelin, commander of the state police (Security Office) and the Security Service (SD)\n* Hans Mayer; (1907–2001), literary scholar\n* Annemarie Renger; (1919–2008), politician (SPD), President of the Bundestag from 1972 to 1976\n* Elfriede Rinkel; (born 1922), former warden of a concentration camp during the Nazi dictatorship\n\n* Martin Broszat, (1926–1989), historian, head of Institut für Zeitgeschichte in Munich\n* Kurt Masur, (1927–2015), conductor of the Gewandhaus orchestra\n* Herbert Blomstedt, (born 1927), conductor of the Gewandhaus orchestra\n* Werner Tübke, (1929–2004), painter\n* Rita Wilden, (born 1947), athlete (sprinter)\n* Ruth Pfau, (1929–2017), nun, physician, writer( \"Pakistan's Mother Teresa\")\n\nsince 1951 \n\n* Riccardo Chailly, (born 1953), conductor of the Gewandhaus orchestra\n* René Müller, (born 1959), footballer for Lokomotive Leipzig and the East German national team\n* Neo Rauch, (born 1960), painter\n* Simone Thomalla, (born 1965), actress\n* Kristin Otto, (born 1966), swimmer, 6-time Olympic gold medalist, sports journalist and TV presenter (ZDF)\n* Matthias Weischer (born 1973), painter\n*  Till Lindemann  (born 1963) , vocalist",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Leipzig" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17955" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Leipzig (;) is the most populous city in the federal state of Saxony, Germany. With a population of 582,277 inhabitants (1.1 million residents in the larger urban zone) it is Germany's tenth most populous city.http://www.statistik-bremen.de/aktuelle_statistiken/01a.htm Leipzig is located about 160 km southwest of Berlin at the confluence of the White Elster, Pleisse, and Parthe rivers at the southern end of the North German Plain.\n\nLeipzig has been a trade city since at least the time of the Holy Roman Empire. The city sits at the intersection of the Via Regia and Via Imperii, two important medieval trade routes. Leipzig was once one of the major European centres of learning and culture in fields such as music and publishing.[http://www.idehist.uu.se/distans/ilmh/Ren/bokt-frankfurt.htm]  Leipzig became a major urban centre within the German Democratic Republic (East Germany) after the Second World War, but its cultural and economic importance declined.\n\nLeipzig later played a significant role in instigating the fall of communism in Central and Eastern Europe, through events which took place in and around St. Nicholas Church. Since the reunification of Germany, Leipzig has undergone significant change with the restoration of some historical buildings, the demolition of others, and the development of a modern transport infrastructure. Leipzig today is an economic centre, the most livable city in Germany, according to the GfK marketing research institution and has the second-best future prospects of all cities in Germany, according to HWWI and Berenberg Bank.http://www.lvz.de/Leipzig/Lokales/Staedteranking-Leipzig-landet-auf-Platz-zwei Leipzig Zoological Garden is one of the most modern zoos in Europe and ranks first in Germany and second in Europe according to Anthony Sheridan. Since the opening of the Leipzig City Tunnel in 2013, Leipzig forms the centrepiece of the S-Bahn Mitteldeutschland public transit system. Leipzig is currently listed as Gamma World City and Germany's \"Boomtown\".\n\nOper Leipzig has become one of the most prominent opera houses in Germany, and traces its establishment to the year 1693, making it the third oldest opera venue in Europe after La Fenice (Venice, Italy) and the Hamburg State Opera (Hamburg, Germany). Leipzig is also home to the University of Music and Theatre \"Felix Mendelssohn Bartholdy\". It was during a stay in this city that Friedrich Schiller wrote his \"Ode to Joy\". Leipzig Gewandhaus Orchestra established in 1743 is one of the oldest symphony orchestra in the world.\n\nHistory \n\nName \n\nLeipzig is derived from the Slavic word ', which means \"settlement where the linden trees (British English: lime trees; U.S. English: basswood trees) stand\".Hanswilhelm Haefs. Das 2. Handbuch des nutzlosen Wissens.   An older spelling of the name in English is . The Latin name  was also used. The name is cognate with  () in Russia and  in Latvia.\n\nIn 1937 the Nazi government officially renamed the city ' (Imperial Trade Fair City Leipzig).\n\nSince 1989 Leipzig has been informally dubbed \"Hero City\" (), in recognition of the role that the Monday demonstrations there played in the fall of the East German regime – the formulation alludes to the honorary title awarded in the former Soviet Union to certain cities that played a key role in the victory of the Allies during the Second World War. The common usage of this nickname for Leipzig up until the present is reflected, for example, in the name of a popular blog for local arts and culture, Heldenstadt.de.\n\nMore recently, the city is sometimes nicknamed \"Boomtown of eastern Germany\", \"Hypezig\" or \"The better Berlin\" for being celebrated by the media as a hip urban centre for the vital lifestyle and creative scene with many startups.\n\nOrigins \n\nLeipzig was first documented in 1015 in the chronicles of Bishop Thietmar of Merseburg as ' ( VII, 25) and endowed with city and market privileges in 1165 by Otto the Rich. Leipzig Trade Fair, started in the Middle Ages, became an event of international importance and is the oldest remaining trade fair in the world.\n\nThere are records of commercial fishing operations on the river  in Leipzig dating back to 1305, when the Margrave Dietrich the Younger granted the fishing rights to the church and convent of St Thomas.\n\nThere were a number of monasteries in and around the city, including a Franciscan monastery after which the  (Barefoot Alley) is named and a monastery of Irish monks (, destroyed in 1544) near the present day  (the old ').\n\nThe foundation of the University of Leipzig in 1409 initiated the city's development into a centre of German law and the publishing industry, and towards being the location of the ' (Imperial Court of Justice) and the German National Library (founded in 1912).\n\nDuring the Thirty Years' War, two battles took place in , about 8 km outside Leipzig city walls. The first Battle of Breitenfeld took place in 1631 and the second in 1642. Both battles resulted in victories for the Swedish-led side.\n\nOn 24 December 1701, an oil-fueled street lighting system was introduced. The city employed light guards who had to follow a specific schedule to ensure the punctual lighting of the 700 lanterns.\n\n19th century \n\nThe Leipzig region was the arena of the 1813 Battle of Leipzig between Napoleonic France and an allied coalition of Prussia, Russia, Austria and Sweden. It was the largest battle in Europe prior to the First World War and the coalition victory ended Napoleon's presence in Germany and would ultimately lead to his first exile on Elba. In 1913 the Monument to the Battle of the Nations celebrating the centenary of this event was completed.\n\nA terminus of the first German long distance railway to Dresden (the capital of Saxony) in 1839, Leipzig became a hub of Central European railway traffic, with Leipzig Hauptbahnhof the largest terminal station by area in Europe. The railway station has two grand entrance halls, the eastern one for the Royal Saxon State Railways and the western one for the Prussian state railways.\n\nLeipzig became a centre of the German and Saxon liberal movements. The first German labor party, the General German Workers' Association (Allgemeiner Deutscher Arbeiterverein, ADAV) was founded in Leipzig on 23 May 1863 by Ferdinand Lassalle; about 600 workers from across Germany travelled to the foundation on the new railway line. Leipzig expanded rapidly to more than 700.000 inhabitants. Huge Gründerzeit areas were built, which mostly survived both war and post-war demolition.\n\n20th century \n\nWith the opening of a fifth production hall in 1907, the Leipziger Baumwollspinnerei became the largest cotton mill company on the continent, housing over 240,000 spindles. Daily production surpassed 5 million kilograms of yarn.\n\nThe city's mayor from 1930 to 1937, Carl Friedrich Goerdeler was a noted opponent of the Nazi regime in Germany. He resigned in 1937 when, in his absence, his Nazi deputy ordered the destruction of the city's statue of Felix Mendelssohn. On Kristallnacht in 1938, one of the city's most architecturally significant buildings, the 1855 Moorish Revival Leipzig synagogue was deliberately destroyed.\n\nSeveral thousand forced labourers were stationed in Leipzig during Second World War.\n\nThe city was also heavily damaged by Allied bombing during the Second World War. Unlike its neighbouring city of Dresden this was largely conventional bombing, with high explosives rather than incendiaries. The resultant pattern of loss was a patchwork, rather than wholesale loss of its centre, but was nevertheless extensive.\n\nThe Allied ground advance into Germany reached Leipzig in late April 1945. The U.S. 2nd Infantry Division and U.S. 69th Infantry Division fought into the city on 18 April and completed its capture after fierce urban action, in which fighting was often house-to-house and block-to-block, on 19 April 1945.Stanton, Shelby, World War II Order of Battle: An Encyclopedic Reference to U.S. Army Ground Forces from Battalion through Division, 1939–1946 (Revised Edition, 2006), Stackpole Books, p. 78, 139. In April 1945 the Deputy Mayor of Leipzig, Ernest Lisso, his wife, daughter and a Volkssturm Major Walter Dönicke committed suicide in Leipzig City Hall.\n\nThe United States turned the city over to the Red Army as it pulled back from the line of contact with Soviet forces in July 1945 to the predesignated occupation zone boundaries. Leipzig became one of the major cities of the German Democratic Republic (East Germany).\n\nIn the mid-20th century, the city's trade fair assumed renewed importance as a point of contact with the Comecon Eastern Europe economic bloc, of which East Germany was a member. At this time, trade fairs were held at a site in the south of the city, near the Monument to the Battle of the Nations. In October 1989, after prayers for peace at St. Nicholas Church, established in 1983 as part of the peace movement, the Monday demonstrations started as the most prominent mass protest against the East German government.David Brebis (ed.), Michelin guide to Germany, Greenville (2006), p. 324. + video. Since the reunification of Germany, Leipzig has undergone significant change with the restoration of some historical buildings, the demolition of others, and the development of a modern transport infrastructure.\n\n21st century \n\nNowadays, Leipzig is an economic center in Germany. Since the 2010s, Leipzig is being celebrated by the media as a hip urban center with a very high quality of living. It is often called \"The new Berlin\".http://www.berliner-zeitung.de/berlin/leipzig-vs--berlin--natuerlich-ist-leipzig-das-bessere-berlin--6599924 Leipzig is also Germany's fastest growing city. Leipzig was the German candidate for the 2012 Summer Olympics, but was unsuccessful. After ten years of construction, the Leipzig City Tunnel opened on 14 December 2013. Leipzig forms the centerpiece of the S-Bahn Mitteldeutschland public transit system, which operates in the four German states of Saxony, Saxony-Anhalt, Thuringia and Brandenburg.\n\nGeography \n\nLocation \n\nLeipzig lies at the confluence of the rivers White Elster, Pleisse and Parthe, in the Leipzig Bay, on the most southerly part of the North German Plain, which is the part of the North European Plain in Germany. The site is characterized by swampy areas such as the Leipzig Riverside Forest, though there are also some limestone areas to the north of the city. The landscape is mostly flat though there is also some evidence of moraine and drumlins.\n\nAlthough there are some forest parks within the city limits, the area surrounding Leipzig is relatively unforested. During the 20th century, there were several open-cast mines in the region, many of which are being converted to use as lakes. Also see: Neuseenland\n\nLeipzig is also situated at the intersection of the ancient roads known as the Via Regia (King's highway), which traversed Germanic lands in an east-west direction, and Via Imperii (Imperial Highway), a north-south road.\n\nLeipzig was a walled city in the Middle Ages and the current \"ring\" road around the historic center of the city corresponds to the old city walls.\n\nSubdivision \n\nLeipzig has been divided administratively since 1992 into ten districts, which in turn contain a total of 63 subdistricts. Some of these correspond to outlying villages which were annexed by Leipzig.\n\nNeighbouring communities \n\nClimate \n\nLeipzig has an oceanic climate (Cfb in the Köppen climate classification). Winters are variably mild to cold, with an average of around 1 °C. Summers are generally warm, averaging at 19 °C with daytime temperatures of 24 °C. Precipitation is around twice as small in winter than summer, however, winters aren't dry. The amount of sunshine differs quite between winter and summer, with around 51 hours of sunshine in December (1.7 hours a day) on average and 229 hours of sunshine in July (7.4 hours a day).\n\nDemographics \n\nLeipzig has a population of about 570,000. In 1930 the population reached its historical peak of over 700,000. It decreased steadily from 1950 until 1989 to about 530,000. In the 1990s the population decreased rather rapidly to 437,000 in 1998. This reduction was mostly due to outward migration and suburbanization. After almost doubling the city area by incorporation of surrounding towns in 1999, the number stabilized and started to rise again with an increase of 1,000 in 2000.:de:Einwohnerentwicklung von Leipzig#Von 1945 bis 1989 , Leipzig is the fastest-growing city in Germany with over 500,000 inhabitants.\nThe growth of the past 10–15 years has mostly been due to inward migration. In recent years inward migration accelerated, reaching an increase of 12,917 in 2014.http://www.statistik.sachsen.de/download/010_GB-Bev/02_03_23_tab.pdf\n\nIn the years following German reunification many people of working age took the opportunity to move to the states of the former West Germany to seek work. This was a contributory factor to falling birth rates. Births dropped from 7,000 in 1988 to less than 3,000 in 1994. However, the number of children born in Leipzig has risen since the late 1990s. In 2011 it reached 5,490 newborns resulting in a RNI of -17.7 (-393.7 in 1995).http://www.statistik.sachsen.de/download/010_GB-Bev/02_03_20_tab.pdf\n\nThe unemployment rate decreased from 18.2% in 2003 to 9.8% in 2014 and 7.6% in June 2017.\n\nThe percentage of the population with an immigrant background is quite low compared with other German cities. , only 5.6% of the population were foreigners, compared to the German overall average of 7.7%.https://www.destatis.de/DE/PresseService/Presse/Pressekonferenzen/2013/Zensus2011/bevoelkerung_zensus2011.pdf?__blob=publicationFile\n\nThe number of people with an immigrant background (immigrants and their children) grew from 49323 in 2012 to 77559 in 2016 making it 13.3% of the city's population( Leipzig population 579530 in 2016).\n\nThe top twelve minorities (first- and second-generation) in Leipzig by country of origin in 2016 are:\n\nCulture, sights and cityscape \n\nArchitecture \n\nThe historic central area of Leipzig features a Renaissance-style ensemble of buildings from the 16th century, including the old city hall in the market place. There are also several baroque period trading houses and former residences of rich merchants. As Leipzig grew considerably during the economic boom of the late 19th century, the town has many buildings in the historicist style representative of the Gründerzeit era. Approximately 35% of Leipzig's flats are in buildings of this type. The new city hall, completed in 1905, displays the same style.\n\nSome 64,000 apartments in Leipzig were built in Plattenbau buildings during the Communist rule in East Germany.:de:Liste der Plattenbausiedlungen in Sachsen#Leipzig and although some of these have been demolished and the numbers living in this type of accommodation have declined in recent years, at least 10% of Leipzig's population (50,000 people) are still living in Plattenbau accommodation.:de:Plattenbauten in Leipzig Grünau, for example, has approximately 40,000 people living in this sort of accommodation.\n\nThe building of the St. Paul's Church was destroyed by the communists in 1968 to make room for a new main building of the university. After some debate, the city decided to establish a new, mainly secular building at the same location, called Paulinum, which was completed in 2012. Its architecture alludes to the look of the former church and it includes a room for religious use.\n\nMany commercial buildings were built in the 1990s as a result of tax breaks after German reunification.\n\nTallest buildings and structures \n\nThe tallest structure in Leipzig is the chimney of the Stahl- und Hartgusswerk Bösdorf GmbH with 205 m. With 142 m, the City-Hochhaus Leipzig is the tallest high rise-building in Leipzig. From 1972 to 1973 it was Germany's tallest building.\n\nMuseums and arts \n\nThe city's contemporary arts highlight was the Neo Rauch retrospective opening in April 2010 at the Leipzig Museum of Fine Arts. This is a show devoted to the father of the New Leipzig SchoolNeue Leipziger Schule (German Wikipedia entry) of artists. According to The New York Times, this scene \"has been the toast of the contemporary art world\" in the past decade. Furthermore, there are eleven galleries in the so-called Spinnerei.\n\nThe building complex of the Grassi Museum contains three more of Leipzig's major collections: the Ethnography Museum, Applied Arts Museum and Musical Instrument Museum (the last of which is run by the University of Leipzig). The university also runs the Museum of Antiquities.\n\nFounded in March 2015, the G2 Kunsthalle houses the Hildebrand Collection. The private collection focuses on the so-called New Leipzig School. Leipzig´s first private museum dedicated to contemporary art in Leipzig after the turn of the millennium is located in the city centre close to the famous St. Thomas Church in the third floor of the former GDR processing centre.\n\nExamples for other museums in Leipzig:\n* The German Museum of Books and Writing is the world's oldest museum of its kind, founded in 1884.\n* The Egyptian Museum of the University of Leipzig comprises a collection of about 7,000 artefacts from several millennia.\n* The Schillerhouse is the house where Schiller lived in summer 1785.\n* The Zeitgeschichtliches Forum Leipzig (Forum of Contemporary History) shows the history of the German division and the everyday life in the communist dictatorship of East Germany.\n* Naturkundemuseum Leipzig is the natural history museum of the city.\n* The Leipzig Panometer is a visual panorama displayed inside a former gasometer, accompanied by a thematic exhibition.\n* The \"Museum in der Runden Ecke\" is the best known museum in the city. It deals with the operation of the Stasi State Security of former East Germany.\n* Johann Sebastian Bach lived from 1723 until his death in Leipzig. The Bach Archive is an institution for the documentation and research of the life and work.\n\nFile:DNB2012.JPG|German Museum of Books and Writing\nFile:Ägyptisches Museum Leipzig 099.jpg|Exhibits of the Egyptian Museum\nFile:Leipzig-Grassi-Museen.jpg|Grassi Museum\nFile:LE-Connewitz Gasometer I Arena-02.jpg|Inside Gasometer, next to the Panometer\nFile:Runde Ecke Leipzig.jpg|Museum in der Runden Ecke\nFile:Museum der bildenden Künste.JPG|Museum of Fine Arts\nFile:Baumwollspinnerei.jpg|Baumwollspinnerei\n\nMain sights \n\n* Leipzig Zoological Garden is one of the most modern zoos in Europe with approximately 850 different species. It houses the world's largest zoological facilities for primates (Pongoland). Gondwanaland is the world's largest indoor rainforest hall.\n* Monument to the Battle of the Nations (Völkerschlachtdenkmal) (Battle of the Nations Monument): one of the largest monuments in Europe, built to commemorate the victorious battle against Napoleonic troops.\n* Bundesverwaltungsgericht: Germany's federal administrative court was the site of the Reichsgericht, the highest state court between 1888 and 1945.\n* New City Hall: the city's administrative building was built upon the remains of the Pleissenburg, a castle that was the site of the 1519 debate between Johann Eck and Martin Luther. It is also Germany's tallest town hall.\n* Old City Hall on Marktplatz: the old city hall was built in 1556 and houses a museum of the city's history.\n* City-Hochhaus Leipzig: built in 1972, the city's tallest building is one of the top 25 tallest buildings in Germany.Tallest building in Germany\n* The Augusteum and Paulinum form the new main campus of the University of Leipzig.\n* international trade fair centre in the north of the city is home to the world's largest levitated glass hall.[http://exhibition.av-solutions.info/leipzig Leipzig] \n* Leipzig Hauptbahnhof is the world's largest railway station by floor area and a shopping destination.\n* Auerbach's Cellar: a young Goethe ate and drank in this basement-level restaurant while studying in Leipzig; it is the venue of a scene from his play Faust.\n* The Old Leipzig bourse at Naschmarkt with a monument of Johann Wolfgang von Goethe.\n* South Cemetery (Südfriedhof) is, with an area of 82 hectares, the largest cemetery in Leipzig.\n* The German National Library has two locations, one of them in Leipzig.\n* Leipzig Bayerischer Bahnhof is Germany's oldest preserved railway station.\n* Gohliser Schlösschen\n* Leipzig Synagogue was destroyed in 1938. Now a memorial stands on the same spot. Where the pews once were, 140 bronze chairs take their place.\n\nFile:Leipzig - Zoo - Gondwanaland in 14 ies.jpg|Inside Gondwanaland at Leipzig Zoological Garden\nFile:VölkerschlachtdenkmalLeipzig1.jpg|Monument to the Battle of the Nations\nFile:Bundesverwaltungsgericht 2, Leipzig.jpg|Federal Administrative Court of Germany\nFile:Neues Rathaus Leipzig jpg8.jpg|New city hall\nFile:Leipzig 03.jpg|Old city hall at market square\nFile:Rainbowflash 2013 Leipzig (4).jpg|City-Hochhaus\nFile:Uni Leipzig Paulinum Universitätskirche St. Pauli 216-cvh.jpg|New Augusteum of the University of Leipzig\nFile:Messe Pano DRI.jpg|Leipzig Trade Fair\nFile:Bahnhof Leipzig von Panorama Tower 2013.jpg|Leipzig main station\nFile:Schilder an Auerbachs Keller 2013.jpg|Auerbachs Keller in the Mädlerpassage\nFile:Goethe Statue Naschmarkt Leipzig.jpg|Old Leipzig bourse\nFile:Suedfriedhof Leipzig.jpg|Südfriedhof\nFile:BibLeipzigaussen.JPG|German National Library\nFile:City-Tunnel Leipzig - Station Bayerischer Bahnhof 01 (Zugang 1).JPG|Leipzig Bayerischer Bahnhof\nFile:Leipzig Gohliser Schloesschen.jpg|Gohliser Schlösschen\nFile:Synagogue Memorial (Leipzig) (3).jpg|Leipzig Synagogue Memorial\n\nChurches \n\n* St. Thomas's Church (Thomaskirche): Most famous as the place where Johann Sebastian Bach worked as a cantor and home to the renowned boys choir Thomanerchor. A monument to Felix Mendelssohn stands in front of this church. Destroyed by the Nazis in 1936, the statue was re-erected on 18 October 2008.\n* St. Nicholas's Church (Nikolaikirche), for which Bach was also responsible. The weekly Montagsgebet (Monday prayer) held here became the starting point of peaceful Monday demonstrations against the DDR regime in the 1980s.\n* St. Peter's has the highest tower of any church in Leipzig, at 87 m.\n* The new Propsteikirche, opened in 2015.\n* The Continental Reformed Church of Leipzig (Evangelisch-reformierte Kirche) is one of the most prominent buildings on the Leipzig Innercity ring.\n* The Russian Church of Leipzig is the Russian-Orthodox church of Leipzig.\n* St. Michael's Church is one of the landmarks of Gohlis district\n\nFile:Nikolaikirche Leipzig 2009.jpg|St. Nicholas Church.\nFile:Leipzig Thomaskirche.jpg|St. Thomas Church.\nFile:Peterskirche Leipzig easyHDR.jpg|St. Peter.\nFile:Neue Propsteikirche St. Trinitatis Leipzig.jpg|Propsteikirche in May 2015, New Town Hall in the background\nFile:Evangel.-Reform. Kirche (3668182160).jpg|Continental Reformed church of Leipzig.\nFile:Leipzig Russische Gedaechtniskirche.jpg|Russian Church of Leipzig.\nFile:Michaelis-SWL.jpg|St. Michael's Church with the headquarters of Stadtwerke Leipzig to the right.\n\nParks and lakes \n\nLeipzig is well known for its large parks. The Leipziger Auwald (riparian forest) lies mostly within the city limits. Neuseenland is an area south of Leipzig where old open-cast mines are being converted into a huge lake district. It is planned to be finished in 2060.\n* Leipzig Botanical Garden is the oldest of its kind in Germany. It contains a total of some 7,000 species, of which nearly 3,000 species comprise ten special collections.\n* Johannapark and Clara-Zetkin-Park are the most prominent parks in the Leipzig city centre.\n* Leipziger Auwald covers a total area of approx. 2,500 hectares. The Rosental is a park in the north of the forest and borders Leipzig Zoo.\n* Wildpark in Connewitz, showing 25 species.\n\nFile:SDC11449 - Epipedobates anthonyi.JPG|Inside Leipzig Botanical Garden\nFile:Johannapark Leipzig.JPG|Johannapark\nFile:Leipziger Auenwald April 2014 005.JPG|Leipziger Auwald\nFile:Sonnenaufgang Rosental Leipzig.jpg|Rosental in the morning\nFile:Leipzig Friedenspark.jpg|Friedenspark\nFile:Markkleeberger See Strand.jpg|Markkleeberger See\nFile:Cospudener See (1) 2005-09-09.JPG|Cospudener See\n\nMusic \n\nJohann Sebastian Bach worked in Leipzig from 1723 to 1750, conducting the Thomanerchor (St. Thomas Church Choir), at the St. Thomas Church, the St. Nicholas Church and the Paulinerkirche, the university church of Leipzig (destroyed in 1968). The composer Richard Wagner was born in Leipzig in 1813, in the Brühl. Robert Schumann was also active in Leipzig music, having been invited by Felix Mendelssohn when the latter established Germany's first musical conservatoire in the city in 1843. Gustav Mahler was second conductor (working under Artur Nikisch) at the Leipzig Opera from June 1886 until May 1888, and achieved his first great recognition while there by completing and publishing Carl Maria von Weber's opera Die Drei Pintos, and Mahler also completed his own 1st Symphony while living there.\n\nThis conservatory is today the University of Music and Theatre Leipzig A broad range of subjects are taught, including artistic and teacher training in all orchestral instruments, voice, interpretation, coaching, piano chamber music, orchestral conducting, choir conducting and musical composition in various musical styles. The drama departments teach acting and scriptwriting.\n\nThe Bach-Archiv Leipzig, an institution for the documentation and research of the life and work of Bach (and also of the Bach family), was founded in Leipzig in 1950 by Werner Neumann. The Bach-Archiv organizes the prestigious International Johann Sebastian Bach Competition, initiated in 1950 as part of a music festival marking the bicentennial of Bach's death. The competition is now held every two years in three changing categories. The Bach-Archiv also organizes performances, especially the international festival Bachfest Leipzig (de) and runs the Bach-Museum.\n\nThe city's musical tradition is also reflected in the worldwide fame of the Leipzig Gewandhaus Orchestra under the baton of chief conductor Riccardo Chailly and the Thomanerchor.\n\nThe MDR Leipzig Radio Symphony Orchestra is Leipzig's second large symphony orchestra. Its current chief conductor is Kristjan Järvi. Both the Gewandhausorchester and the MDR Leipzig Radio Symphony Orchestra reside in the Gewandhaus concert hall.\n\nFor over 60 years Leipzig has been offering a \"school concert programme for children in Germany, with over 140 concerts every year in venues such as the Gewandhaus and over 40,000 children attending.\n\nAs for contemporary music, Leipzig is known for its independent music scene and subcultural events. Leipzig has for 20 years been home to the world's largest Gothic festival, the annual Wave-Gotik-Treffen (WGT), where thousands of fans of gothic and dark styled music from across Europe gather in the early summer. The first Wave Gotik Treffen was held at the Eiskeller club, today known as Conne Island, in the Connewitz district. Mayhem's notorious album Live in Leipzig was also recorded at the Eiskeller club. Leipzig Pop Up is an annual music trade fair for the independent music scene as well as a music festival taking place on Pentecost weekend. Its most famous indie-labels are Moon Harbour Recordings (House) and Kann Records (House/Techno/Psychedelic). Several venues offer live music on a daily basis, including the Moritzbastei which was once part of the city's fortifications, and is one of the oldest student clubs in Europe with concerts in various styles. For over 15 years \"Tonelli's\" has been offering free weekly concerts every day of the week, though door charges may apply Saturdays.\n\nThe cover photo for Beirut's 2005 album Gulag Orkestar was, according to the sleeve notes, stolen from a Leipzig library by Zach Condon.\n\nThe city of Leipzig is also the birthplace of Till Lindemann, best known as the lead vocalist of Rammstein, a band formed in 1994.\n\nFile:Opernhaus Leipzig Abend Nacht.jpg|Leipzig Opera\nFile:AUGUSTUSPLATZ-014.jpg|View over Augustusplatz with the Gewandhaus.\nFile:Leipzig - Universitätsstraße - Moritzbastei 05 ies.jpg|Moritzbastei is the largest student club in Germany and is famous for its atmosphere and large number of cultural and music events.\nFile:Johann Sebastian Bach Denkmal Leipzig.jpg|Monument of Johann Sebastian Bach\nFile:Wahren3.jpg|Haus Auensee, a concert hall\n\nAnnual events \n\n* Auto Mobil International (AMI) motor show\n* AMITEC, trade fair for vehicle maintenance, care, servicing and repairs in Germany and Central Europe\n* A cappella: vocal music festival, organized by the Ensemble amarcord\n* Bach-Fest: Johann Sebastian Bach-festival\n* Christmas market (since 1767)\n* Dok Leipzig: international festival for documentary and animated film\n* Jazztage, contemporary jazz festival\n* Ladyfest Leipzig (August) Emancipatoric, feminist punk and electro festival\n* Leipzig Book Fair: the second largest German book fair after Frankfurt\n* , festival celebrating the demonstrations leading up to the collapse of the East German regime\n* OPER unplugged with Music Dance Theatre by Heike Hennig & Co\n* Stadtfest: city festival\n* Wave-Gotik-Treffen at Pentecost: world's largest goth or \"dark culture\" festival\n* Leipzig Pop Up\n\nFile:Leipzig Messe Kongresszentrum Glashalle.jpg|Leipzig Trade Fair\nFile:Leipziger Buchmesse 2015.jpg|Leipzig Book Fair 2015\nFile:2016 WGT 002 Belantis.jpg|Wave-Gotik-Treffen 2016, Belantis park in the background\nFile:Leipziger Weihnachtsmarkt Eingang.jpg|Leipzig Christmas market entrance\nFile:Dokwoche.jpg|DOK Leipzig\n\nSports \n\nMore than 300 sport clubs in the city represent 78 different disciplines. Over 400 athletic facilities are available to citizens and club members.\n\nFootball \n\nThe German Football Association (DFB) was founded in Leipzig in 1900. The city was the venue for the 2006 FIFA World Cup draw, and hosted four first-round matches and one match in the round of 16 in the central stadium.\n\nVfB Leipzig, now 1. FC Lokomotive Leipzig, won the first national Association football championship in 1903. The club was reformed as 1. FC Lokomotive Leipzig in 1966 and has had a glorious past in international competition as well, having been champions of the 1965–66 Intertoto Cup, semi-finalists in the 1973–74 UEFA Cup, and runners-up in the 1986–87 European Cup Winners' Cup.\n\nIn May 2009 Red Bull entered the local market after being denied the right to buy into FC Sachsen Leipzig in 2006. The newly founded RB Leipzig declared the intention to come up through the ranks of German football to bring Bundesliga football back to the region. RB Leipzig was finally promoted to the top level of the Bundesliga after finishing the 2015–16 2. Bundesliga season as runners-up.\n\nList of Leipzig men and women's football clubs playing at state level and above:\n\nNote 1: The RB Leipzig women's football team was formed in 2016 and began play in the 2016-17 season.\nNote 2: The club began play in the 2008-09 season.\n\nIce hockey \n\nSince the beginning of the 20th century Ice hockey gained popularity and several local clubs established departments dedicated to that sport.\n\nHandball \n\nSC DHfK Leipzig is the men's handball club in Leipzig and were six times (1959, 1960, 1961, 1962, 1965 and 1966) the champion of East Germany handball league and was winner of EHF Champions League in 1966. They finally promoted to Handball-Bundesliga as champions of 2. Bundesliga in 2014–15 season. They play in the Arena Leipzig witch have a capacity of 6,327 spectators in HBL games but can take up to 7,532 spectators for handball in maximum capacity.\n\nHandball-Club Leipzig is one of the most successful women's handball clubs in Germany, winning 20 domestic championships since 1956 and 3 Champions League titles. The team was however relegated to the third tier league in 2017 due to failing to achieve the economic standard demanded by the league licence.\n\nOther sports \n\nFrom 1950 to 1990 Leipzig was host of the Deutsche Hochschule für Körperkultur (DHfK, German College of Physical Culture), the national sports college of the GDR.\n\nLeipzig also hosted the Fencing World Cup in 2005 and hosts a number of international competitions in a variety of sports each year.\n\nLeipzig made a bid to host the 2012 Summer Olympic Games. The bid did not make the shortlist after the International Olympic Committee pared the bids down to 5.\n\nMarkkleeberger See is a new lake next to Markkleeberg, a suburb on the south side of Leipzig. A former open-pit coal mine, it was flooded in 1999 with groundwater and developed in 2006 as a tourist area. On its southeastern shore is Germany's only pump-powered artificial whitewater slalom course, Markkleeberg Canoe Park (Kanupark Markkleeberg), a venue which rivals the Eiskanal in Augsburg for training and international canoe/kayak competition.\n\nLeipzig Rugby Club competes in the German Rugby Bundesliga but finished at the bottom of their group in 2013.\n\nFood and drink \n\n* An all-season local dish is Leipziger Allerlei, a stew consisting of seasonal vegetables and crayfish.\n* Leipziger Lerche is a shortcrust pastry dish filled with crushed almonds, nuts and strawberry jam; the name (\"Leipzig lark\") comes from a lark pâté which was a Leipzig speciality until the banning of songbird hunting in Saxony in 1876.\n* Gose is a locally brewed top-fermenting sour beer that originated in the Goslar region and in the 18th century became popular in Leipzig.\n\nFile:Leipziger Lerchen.jpg|Leipziger Lerchen\nFile:Goseflasche Pressglas.jpg|Historical Gose bottle (ca. 1900)\n\nEducation \n\nUniversity \n\nLeipzig University, founded 1409, is one of Europe's oldest universities. The philosopher and mathematician Gottfried Wilhelm Leibniz was born in Leipzig in 1646, and attended the university from 1661 to 1666. Nobel Prize laureate Werner Heisenberg worked here as a physics professor (from 1927 to 1942), as did Nobel Prize laureates Gustav Ludwig Hertz (physics), Wilhelm Ostwald (chemistry) and Theodor Mommsen (Nobel Prize in literature). Other former staff of faculty include mineralogist Georg Agricola, writer Gotthold Ephraim Lessing, philosopher Ernst Bloch, eccentric founder of psychophysics Gustav Theodor Fechner, and psychologist Wilhelm Wundt. Among the university's many noteworthy students were writers Johann Wolfgang Goethe and Erich Kästner, and philosopher Friedrich Nietzsche, political activist Karl Liebknecht, and composer Richard Wagner. Germany's chancellor since 2006, Angela Merkel, studied physics at Leipzig University. The university has about 30,000 students.\n\nA part of Leipzig University is the German Institute for Literature which was founded in 1955 under the name \"Johannes R. Becher-Institut\". Many noted writers have graduated from this school, including Heinz Czechowski, Kurt Drawert, Adolf Endler, Ralph Giordano, Kerstin Hensel, Sarah and Rainer Kirsch, Angela Krauß, Erich Loest, Fred Wander. After its closure in 1990 the institute was refounded in 1995 with new teachers.\n\nVisual arts and theatre \n\nThe Academy of Visual Arts (Hochschule für Grafik und Buchkunst) was established in 1764. Its 530 students () are enrolled in courses in painting and graphics, book design/graphic design, photography and media art. The school also houses an Institute for Theory.\n\nThe University of Music and Theatre offers a broad range of subjects ranging from training in orchestral instruments, voice, interpretation, coaching, piano chamber music, orchestral conducting, choir conducting and musical composition to acting and scriptwriting.\n\nUniversity of Applied Science \n\nThe Leipzig University of Applied Sciences (HTWK) has approximately 6,200 students () and is () the second biggest institution of higher education in Leipzig. It was founded in 1992, merging several older schools. As a university of applied sciences (German: Fachhochschule) its status is slightly below that of a university, with more emphasis on the practical part of the education. The HTWK offers many engineering courses, as well as courses in computer science, mathematics, business administration, librarianship, museum studies and social work. It is mainly located in the south of the city.\n\nLeipzig Graduate School \n\nThe private Leipzig Graduate School of Management, (in German Handelshochschule Leipzig (HHL)), is the oldest business school in Germany. According to The Economist, HHL is one of the best schools in the world, rankend at number six overall.\n\nOthers \n\nAmong the research institutes located in Leipzig, three belong to the Max Planck Society. These are the Max Planck Institute for Mathematics in the Sciences, Max Planck Institute for Human Cognitive and Brain Sciences, and Max Planck Institute for Evolutionary Anthropology. Two more are Fraunhofer Society institutes. Others are the Helmholtz Centre for Environmental Research, part of the Helmholtz Association of German Research Centres, and the Leibniz-Institute for Tropospheric Research.\n\nLeipzig is home to one of the world's oldest schools Thomasschule zu Leipzig (St. Thomas' School, Leipzig), which gained fame for its long association with the Bach family of musicians and composers.\n\nThe Lutheran Theological Seminary is a seminary of the Evangelical Lutheran Free Church in Leipzig. The seminary trains students to become pastors for the Evangelical Lutheran Free Church or for member church bodies of the Confessional Evangelical Lutheran Conference.\n\nEconomy \n\nThe city is a location for automobile manufacturing by BMW and Porsche in large plants north of the city. In 2011 and 2012 DHL transferred the bulk of its European air operations from Brussels Airport to Leipzig/Halle Airport. Kirow Ardelt AG, the world market leader in breakdown cranes, is based in Leipzig. The city also houses the European Energy Exchange, the leading energy exchange in Central Europe.\n\nSome of the largest employers in the area (outside of manufacturing) include software companies such as Spreadshirt,  and the various schools and universities in and around the Leipzig/Halle region. The University of Leipzig attracts millions of euros of investment yearly and is in the middle of a massive construction and refurbishment to celebrate its 600th anniversary.\n\nLeipzig also benefits from world leading medical research (Leipzig Heart Centre) and a growing biotechnology industry.\n\nMany bars, restaurants and stores found in the downtown area are patronized by German and foreign tourists. Leipzig Hauptbahnhof itself is the location of a shopping mall. Leipzig is one of Germany's most visited cities with over 2.7 million overnight stays in 2013.\n\nIn 2010, Leipzig was included in the top 10 cities to visit by The New York Times, and ranked 39th globally out of 289 cities for innovation in the 4th Innovation Cities Index published by Australian agency 2thinknow. In 2015, Leipzig have among the 30 largest German cities the third best prospects for the future. In recent years Leipzig has often been nicknamed the \"Boomtown of eastern Germany\" or \"Hypezig\".  it had the highest rate of population growth of any German city.\n\nCompanies with operations in or around Leipzig include:\n* Amazon\n* Blüthner: piano-manufacturing\n* BMW\n* DHL\n* Porsche\n* Siemens\n* Future Electronics\n\nFile:Porsche Diamond.jpg|Porsche Diamond, the customer center building of Porsche Leipzig\nFile:BMW Leipzig MEDIA Download Luftaufnahme 3 max.jpg|BMW production facility in Leipzig\nFile:Amazon.de Versandhaus Leipzig.jpg|Amazon in Leipzig\nFile:EAT LEJ Hangar.jpg|Leipzig is the hub of DHL\nFile:Löhrs Carré Leipzig.JPG|Headquarters of the Sparkasse Leipzig bank\nFile:Markkleeberger See Bootsanlegestelle.jpg|Tourism in and around Leipzig plays a significant role, the photo shows the Markkleeberger See\nFile:Höfe am Brühl 20120928-3.jpg|Leipzig is a well known shopping destination (picture shows the Höfe am Brühl)\n\nMedia \n\n* MDR, one of Germany's public broadcasters, has its headquarters and main television studios in the city. It provides programmes to various TV and radio networks and has its own symphony orchestra, choir and a ballet.\n* Leipziger Volkszeitung (LVZ) is the city's only daily newspaper. Founded in 1894, it has published under several different forms of government. The monthly magazine Kreuzer specializes in culture, festivities and the arts in Leipzig. Leipzig was also home to the world's first daily newspaper in modern times. The \"Einkommende Zeitungen\" were first published in 1650.:de:Einkommende Zeitungen\n* Leipzig has one daily or semi-daily English-language publication, \"The Leipzig Glocal.\" It is an online-based magazine and blog that caters to an international as well as local audience.\"ABOUT US.\" The Leipzig Glocal. http://leipglo.com/about/ (Retrieved 8 February 2017) Besides publishing pages on jobs, doctors and movies available in English and other languages, the site's team of authors writes articles about lifestyle, arts & culture, politics, entertainment, Leipzig events, etc.\"Leipzig: ein Paradies für kreative Blogs.\" Mephisto 97.6. https://mephisto976.de/news/leipzig-ein-paradies-fuer-kreative-blogs-55338 (Retrieved 8 February 2017).\n* Once known for its large number of publishing houses, Leipzig had been called Buch-Stadt (book city)., the most notable of them being branches of Brockhaus and Insel Verlag. Few are left after the years of economic decline during the German Democratic Republic, during which time Frankfurt developed as a much more important publishing center. Reclam, founded in 1828, was one of the large publishing houses to move away. Leipzig still has a book fair, but Frankfurt's is far bigger.\n* The German Library (Deutsche Bücherei) in Leipzig is part of Germany's National Library. Its task is to collect a copy of every book published in German.German National Library\n\nQuality of life \n\nIn December 2013, according to a study by Marktforschungsinstituts GfK, Leipzig was ranked as the most livable city in Germany and is one of the three European cities with the highest quality of living (after Groningen and Kraków). In 2015/2016, Leipzig is the second-best city for students in Germany (after Munich).\n\nIn a 2017 study, the Leipzig inner city ranks first of all large cities in Germany due to its urban aesthetics, gastronomy and shopping opportunities.\n\nIt has also the second-best future prospects of all cities in Germany, only surpassed by Munich.\n\nTransport \n\nRoad \n\nFounded at the crossing of Via Regia and Via Imperii, Leipzig has been a major interchange of inter-European traffic and commerce since medieval times. After the Reunification of Germany, immense efforts to restore and expand the traffic network have been undertaken and left the city area with an excellent infrastructure.\n\nSince 1936, Leipzig has been connected to the A 9 and A 14 autobahns via the Schkeuditzer Kreuz (Schkeuditz Cross) interchange and several exits. The A 38 completed the autobahn beltway around Leipzig in 2006.\n\nLike most German cities, Leipzig has a traffic layout designed to be bicycle-friendly. There is an extensive cycle network. In most of the one-way central streets, cyclists are explicitly allowed to cycle both ways. A few cycle paths have been built or declared since 1990.\n\nRail \n\nLeipzig Hauptbahnhof, opened in 1915, is at a junction of important north-to-south and west-to-east railway lines. The ICE train between Berlin and Munich stops in Leipzig and it takes approximately one hour from Berlin Hauptbahnhof and five hours from München Hauptbahnhof.\n\nAir \n\nLeipzig/Halle Airport is the main airport in the vicinity of the city. Leipzig/Halle Airport offers a number of seasonal vacation charter flights as well as regular scheduled services. The former military airport near Altenburg, Thuringia called Leipzig-Altenburg Airport about a half-hour drive from Leipzig was served by Ryanair until 2010.\n\nWater \n\nIn the first half of the 20th century, the construction of the Elster-Saale canal, White Elster and Saale was started in Leipzig in order to connect to the network of waterways. The outbreak of the Second World War stopped most of the work, though some may have continued through the use of forced labor. The Lindenauer port was almost completed but not yet connected to the Elster-Saale and Karl-Heine canal respectively. The Leipzig rivers (White Elster, New Luppe, Pleisse, and Parthe) in the city have largely artificial river beds and are supplemented by some channels. These waterways are suitable only for small leisure boat traffic.\n\nThrough the renovation and reconstruction of existing mill races and watercourses in the south of the city and flooded disused open cast mines, the city's navigable water network is being expanded. The city commissioned planning for a link between Karl Heine Canal and the disused Lindenauer port in 2008. Still more work was still scheduled to complete the Elster-Saale canal. Such a move would allow small boats to reach the Elbe from Leipzig. The intended completion date has been postponed because of an unacceptable cost-benefit ratio.\n\nPublic transport \n\nLeipzig has an extensive local public transport network. The city's tram and bus network is operated by the Leipziger Verkehrsbetriebe. Leipzig's tram network, at a length of , is the second biggest in Germany.\nLeipzig City Tunnel forms the centerpiece of an extensive S-Bahn network serving 1.2 million people in the Leipzig/Halle metropolitan area. The tunnel links the main station in the north with the Bayrische Bahnhof in the south.\n\nFile:Bahnhof Leipzig von Panorama Tower 2013.jpg|Leipzig Hauptbahnhof is the main hub of tram and rail network and the world's largest railway station by floor area\nFile:Leipzig NGT12-LEI Waldplatz defekt.jpg|Tram of Leipziger Verkehrsbetriebe\nFile:Leipzig Georg-Schumann-Strasse.jpg|Tramsystem at the Georg-Schumann-Straße\nFile:S-Bahnhof Leipzig Markt.jpg|Leipzig City Tunnel, part of Leipzig's new S-Bahn network\nFile:S-Bahn Mitteldeutschland. Talent 2,008,Station Leipzig Wilhelm-Leuschner-Platz.jpg|A new train of the S-Bahn Mitteldeutschland at Leipzig Wilhelm-Leuschner-Platz railway station, August 2016\nFile:S-Bahn Mitteldeutschland. Talent 2,027, Innenansicht Sitze.jpg|Inside the S-Bahn train\n\nQuotations \n\nMein Leipzig lob' ich mir! Es ist ein klein Paris und bildet seine Leute. (I praise my Leipzig! It is a small Paris and educates its people.) – Frosch, a university student in Goethe's Faust, Part One\n\nIch komme nach Leipzig, an den Ort, wo man die ganze Welt im Kleinen sehen kann. (I'm coming to Leipzig, to the place where one can see the whole world in miniature.) – Gotthold Ephraim Lessing\n\nExtra Lipsiam vivere est miserrime vivere. (To live outside Leipzig is to live miserably.) – Benedikt Carpzov the Younger\n\nDas angenehme Pleis-Athen, Behält den Ruhm vor allen, Auch allen zu gefallen, Denn es ist wunderschön. (The pleasurable Pleiss-Athens, earns its fame above all, appealing to every one, too, for it is mightily beauteous.) – Johann Sigismund Scholze\n\nInternational relations \n\nLeipzig is twinned with:\n\n*  Addis Ababa, Ethiopia, since 2004\n*  Birmingham, UK, since 1992\n*  Bologna, Italy, since 1962, renewed in 1997\n*  Brno, Czech Republic, since 1973, renewed in 1999\n*  Frankfurt am Main, Germany, since 1990\n*  Hanover, Germany, since 1987\n*  Herzliya, Israel, since 2010\n*  Houston, United States, since 1993\n*  Kiev, Ukraine, since 1961, renewed in 1992\n*  Kraków, Poland, since 1973, renewed in 1995\n*  Lyon, France, since 1981\n*  Nanjing, China, since 1988\n*  Thessaloniki, Greece, since 1984\n*  Travnik, Bosnia and Herzegovina, since 2003\n\nNotable residents \n\n17th century \n\n* Gottfried Wilhelm Leibniz; (1646–1716), philosopher and scientist, mathematician, diplomat\n* Johann Friedrich Mayer; (1650–1712), Lutheran theologian\n* Augustus Quirinus Rivinus, origin.  Bachmann ; (1652–1723), physician and botanist\n* Johann Sebastian Bach; (1685–1750), composer\n\n18th century \n\n* Johann Christian Bach; (1735–1782), youngest son of Johann Sebastian Bach, composer\n* Christian Gottfried Körner; (1756–1831), jurist and writer\n* Friedrich Arnold Brockhaus; (1772–1823), publisher, originator of the Brockhaus encyclopedia\n* Carl Gustav Carus; (1789–1869), doctor, painter and natural philosopher\n\n19th century \n\n1801–1850 \n\n* Christian Hermann Weisse; (1801–1866), Protestant theologian and philosopher\n* Felix Mendelssohn; (1809–1847), composer, pianist, organist and conductor\n* Robert Schumann; (1810–1856), composer and music critic\n* Richard Wagner; (1813–1883), composer, theatre director and conductor (among others opera  The Flying Dutchman )\n* Louise Otto-Peters; (1819–1895), suffragette, author, founder of the General German Women's Association\n\n* Clara Schumann; (1819–1896), pianist and composer\n* Carl Reinecke; (1824–1910), composer, conductor, and pianist\n* August Bebel; (1840–1913), socialist politician, co-founder of Germany's Social Democratic Party\n* Karl Wittgenstein; (1847–1913), entrepreneur\n\n1851–1900 \n\n* Hans Meyer; (1858–1929), geographer, Africanist and mountaineer, first European to reach the summit of Mount Kilimanjaro\n* Wilhelm Souchon; (1864–1946), Vice Admiral of the Imperial Navy, commander of the Ottoman and Bulgarian Navy\n* Karl Liebknecht; (1871–1919), socialist politician (co-founder of the Communist Party of Germany)\n\n* Carl Friedrich Goerdeler; (1884–1945), mayor, one of the leaders of conservative resistance against Hitler\n* Max Beckmann; (1884–1950), Expressionist painter, professor at art academies and schools\n* Wilhelm Backhaus; (1884–1969), pianist\n* Paul Frölich; (1884–1953), politician (KPD co-founder), executor and biographer of Rosa Luxemburg\n* Walter Ulbricht; (1893–1973), Communist politician (SED), GDR Chairman of the Council of State from 1960 to 1973\n* Ruth Fischer; (1895–1961), communist politician and journalist, co-founder of the CPA\n* Hanns Eisler; (1898–1962), composer (inter alia of the national anthem of the GDR.)\n* Bruno Apitz; (1900–1979), writer (Naked among wolves)\n\n20th century \n\n1901–1950 \n\n* Karl Eberhard Schöngarth; (1903–1946), SS officer and war criminal, executed in Hamelin, commander of the state police (Security Office) and the Security Service (SD)\n* Hans Mayer; (1907–2001), literary scholar\n* Annemarie Renger; (1919–2008), politician (SPD), President of the Bundestag from 1972 to 1976\n* Elfriede Rinkel; (born 1922), former warden of a concentration camp during the Nazi dictatorship\n\n* Martin Broszat, (1926–1989), historian, head of Institut für Zeitgeschichte in Munich\n* Kurt Masur, (1927–2015), conductor of the Gewandhaus orchestra\n* Herbert Blomstedt, (born 1927), conductor of the Gewandhaus orchestra\n* Werner Tübke, (1929–2004), painter\n* Rita Wilden, (born 1947), athlete (sprinter)\n* Ruth Pfau, (1929–2017), nun, physician, writer( \"Pakistan's Mother Teresa\")\n\nsince 1951 \n\n* Riccardo Chailly, (born 1953), conductor of the Gewandhaus orchestra\n* René Müller, (born 1959), footballer for Lokomotive Leipzig and the East German national team\n* Neo Rauch, (born 1960), painter\n* Simone Thomalla, (born 1965), actress\n* Kristin Otto, (born 1966), swimmer, 6-time Olympic gold medalist, sports journalist and TV presenter (ZDF)\n* Matthias Weischer (born 1973), painter\n*  Till Lindemann  (born 1963) , vocalist. Leipzig. http://en.wikipedia.org/?curid=17955."
  }
}
