{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2988",
  "eid" : "c3971e70-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778407895,
  "textBody" : "The Admiralty, originally known as the Office of the Admiralty and Marine Affairs, was the government department responsible for the command of the Royal Navy first in the Kingdom of England, second in the Kingdom of Great Britain, and from 1801 to 1964, the United Kingdom and former British Empire.  Originally exercised by a single person, the Lord High Admiral (1385–1628), the Admiralty was, from the early 18th century onwards, almost invariably put \"in commission\" and exercised by the Lords Commissioners of the Admiralty, who sat on the Board of Admiralty.\n\nIn 1964, the functions of the Admiralty were transferred to a new Admiralty Board, which is a committee of the tri-service Defence Council of the United Kingdom and part of the Navy Department of the Ministry of Defence. The new Admiralty Board meets only twice a year, and the day-to-day running of the Royal Navy is controlled by a Navy Board (not to be confused with the historic Navy Board described later in this article). It is common for the various authorities now in charge of the Royal Navy to be referred to as simply The Admiralty.\n\nThe title of Lord High Admiral of the United Kingdom was vested in the monarch from 1964 to 2011. The title was awarded to Philip, Duke of Edinburgh by Queen Elizabeth II on his 90th birthday. There also continues to be a Vice-Admiral of the United Kingdom and a Rear-Admiral of the United Kingdom, both of which are honorary offices.\n\nFunction and organization\n\nHistory\n\nThe office of Admiral of England (or Lord Admiral and later Lord High Admiral) was created around 1400 although there had already been Admirals of the Northern and Western Seas. In 1546, King Henry VIII established the Council of the Marine, later to become the Navy Board, to oversee administrative affairs of the naval service. Operational control of the Royal Navy remained the responsibility of the Lord High Admiral, who was one of the nine Great Officers of State.\n\nIn 1628, Charles I put the office of Lord High Admiral into commission and control of the Royal Navy passed to a committee in the form of the Board of Admiralty. The office of Lord High Admiral passed a number of times in and out of commission until 1709 after which the office was almost permanently in commission (the last Lord High Admiral being the future King William IV in the early 19th century).\n\nIn 1831, the first Navy Board was abolished as a separate entity, and its duties and responsibilities were given over to the Admiralty.\n\nIn 1964, the Admiralty along with the War Office and the Air Ministry as separate departments of state were abolished, and re-emerged under  one single new Ministry of Defence. Within the expanded Ministry of Defence are the new Admiralty Board which has a separate (second) Navy Board responsible for the day-to-day running of the Royal Navy., the Army Board and the Air Force Board, each headed by the Secretary of State for Defence.\n\nBoard of Admiralty\n\nWhen the office of Lord High Admiral was in commission, as it was for most of the 18th, 19th and 20th centuries, until it reverted to the Crown, it was exercised by a Board of Admiralty, officially known as the Commissioners for Exercising the Office of Lord High Admiral of the United Kingdom of Great Britain and Northern Ireland, &c. (alternatively of England, Great Britain or the United Kingdom of Great Britain and Ireland depending on the period).\n\nThe Board of Admiralty consisted of a number of Lords Commissioners of the Admiralty. The Lords Commissioners were always a mixture of admirals, known as Naval Lords or Sea Lords and Civil Lords, normally politicians. The quorum of the Board was two commissioners and a secretary.\n\nThe president of the Board was known as the First Lord of the Admiralty, who was a member of the Cabinet. After 1806, the First Lord of the Admiralty was always a civilian while the professional head of the navy came to be (and is still today) known as the First Sea Lord.\n\nOrganization\n\nThe first real concerted effort to professionally organize the Admiralty was started by Henry VIII, this management approach would continue in force in the Royal navy until to 1832. In this organization a dual system operated the Lord High Admiral (from 1546) then Commissioners of the Admiralty (from 1628) exercised the function of general control (military administration) of the Navy and they were usually responsible for the conduct of any war, while the actual supply lines, support and services were managed by four principal officers, namely, the Treasurer, Comptroller, Surveyor and Clerk of the Acts, responsible individually for finance, supervision of accounts, Shipbuilding and maintenance of ships, and record of business. These principle officers came to be known as the Navy Board responsible for (civil administration) of the navy, from 1546 to 1832.\n\nThis structure of administering the navy lasted for 285 years, however, the supply system was often inefficient and corrupt its deficiencies were due as much to its limitations of the times they operated in. The various functions within the Admiralty were not coordinated effectively and lacked inter-dependency with each other, with the result that in 1832 Sir James Graham abolished the Navy Board and merged its functions within the Board of Admiralty's that at the time also had distinct advantages, however it failed to retain the principle of distinctions between the Admiralty and supply and a lot of bureaucracy followed with the merger.\n\nIn 1860 saw big growth in the development of technical crafts, the expansion of more admiralty branches that really began with age of steam that would have an enormous influence on the navy and naval thought.\n\nBetween 1860 and 1908 there was no real study of strategy and of staff work conducted within the naval service; it was practically ignored. All the Navy's talent flowed to the great technical universities. This school of thought for the next 50 years was exclusively technically based. The first serious attempt to introduce a sole management body to administer the naval service manifested itself in the creation of the Admiralty Navy War Council in 1909. It was believed by officials within the Admiralty at this time that the running of war was quite a simple matter for any flag officer who required no formal training. However, this mentality would be severely questioned with the advent of the Agadir crisis, when the Admiralty's war plans were heavily criticized. Following this, a new advisory body called the Admiralty War Staff was then instituted in 1912, headed by the Chief of the War Staff who was responsible for administering three new sub-divisions responsible for operations, intelligence and mobilisation. The new War Staff had hardly found its feet and it continually struggled with the opposition to its existence by senior officers they were categorically opposed to a staff. The deficiencies of the system within this department of state could be seen in the conduct of the Dardanelles campaign. There were no mechanisms in place to answer the big strategic questions. In 1914 a Trade Division was created.\n\nIn 1916, Sir John Jellicoe came to the Admiralty, he re-organized the war staff as following: Chief of War Staff, Operations, Intelligence, Signal Section, Mobilisation, Trade.\n\nIt was not until 1917 that the admiralty department was again properly reorganized and began to function as a professional military staff. In May that 1917, the term \"Admiralty War Staff\" was renamed and that department and its functional role were superseded by a new \"Admiralty Naval Staff\" in addition the newly created office of Chief of the Naval Staff was merged in the office of the First Sea Lord. Also appointed  was a new post that of Deputy Chief of the Naval Staff and an Assistant Chief of the Naval Staff who were all given seats on the Board of Admiralty. For the first time gave the naval staff direct representation on the board with the presence of three senior naval senior members on the board it ensured the necessary authority to carry through any operation of war. The Deputy Chief of Naval Staff would direct all operations and movements of the fleet, while the Assistant Chief of Naval Staff would be responsible for mercantile movements and anti-submarine operations.\n\nThe office of Controller would be re-established to deal with all questions relating to supply on September 6, 1917 a Deputy First Sea Lord, was added to the Board who would administer operations abroad and deal with questions of foreign policy. In October 1917 the development of the staff was carried one step further by the creation of two sub-committees of the Board – the Operations Committee and the Maintenance Committee. The First Lord was chairman of both committees, and the Operations Committee consisted of the First Sea Lord and Chief of Naval Staff., the Deputy First Sea Lord,  Assistant Chief of Naval Staff, and Fifth Sea Lord. The Maintenance Committee  consisted of the Deputy First Sea Lord. (representing the operations committee), Second Sea Lord. (personnel), Third Sea Lord. (material), Fourth Sea Lord. (transport and stores), Civil Lord, Controller and Financial Secretary.\n\nFull operational control of the Royal Navy was finally handed over to the Chief of Naval Staff by an order in Council, effective October 1917, under which he became responsible for the issuing of orders affecting all war operations directly to the fleet. It also empowered the C.N.S to issue orders in their own name as opposed to them previously being issued by the Permanent Secretary to the Admiralty in the name of the Board. This structure would remain in place until the department was abolished in 1964; post 1964 the operational control and this system still remains in place with the Royal Navy today. For the organisational structure of the admiralty department and how it developed through the centuries see the following articles below.\n\nSenior command\n\nNote: civilian is denoted (+) military is denoted (++)\n\nMinister of State for the Department of Admiralty,  President of the Board of Admiralty and Senior Government Adviser for Naval Affairs \n*Office of the First Lord of the Admiralty (+)  --------------Office of the Naval Secretary (++)\n**Board of Admiralty (+ and ++)\n***Navy Board, (+) independent from 1546 it became subordinate to, yet autonomous of the Board of Admiralty from 1628 to 1832.\nMilitary Head of the Navy Council/Naval War Staff/Naval Staff and Chief Naval Adviser on the Board of Admiralty to the First Lord\n*Office of the First Sea Lord and Chief of Naval Staff  (++) \n**Admiralty Navy War Council, (1909–1912),  (++)\n**Admiralty War Staff, (1912–1917), (++)\n**Admiralty Naval Staff, (1917–1964), (++)\nBoard of Admiralty, Navy Council and Naval Staff military members responsible for all Admiralty staff divisions and departments\n*Office of the Second Sea Lord (++)\n*Office of the Third Sea Lord (++)\n*Office of the Fourth Sea Lord (++)\n*Office of Fifth Sea Lord (++)\n**Office of Deputy Chief of the Naval Staff (++)\n***Office of Assistant Chief of the Naval Staff (++)\n***Office of the Vice Chief of the Naval Staff\n****Mobilisation and Intelligence Departments (++)\n****Naval Staff Divisions (++)\n****War Staff Divisions (++)\n***Office of the Deputy First Sea Lord (++)\nBoard of Admiralty members responsible other civil functions of the Department of Admiralty\n*Office of the Civil Lord of the Admiralty (+) \n**Office of the Additional Civil Lord of the Admiralty (+) \n*Office of the Permanent Secretary to the Admiralty (+)\n*Office of the Parliamentary and Financial Secretary to the Admiralty (+)\n\nAdmiralty Buildings\n\nThe Admiralty complex lies between Whitehall, Horse Guards Parade and The Mall and includes five inter-connected buildings. Since the Admiralty no longer exists as a department, these buildings are now used by separate government departments:\n\nThe Admiralty\n\nThe oldest building was long known simply as The Admiralty; it is now known officially as the Ripley Building, a three-storey U-shaped brick building designed by Thomas Ripley and completed in 1726. Alexander Pope implied the architecture is rather dull, lacking either the vigour of the baroque style, fading from fashion at the time, or the austere grandeur of the Palladian style just coming into vogue. It is mainly notable for being perhaps the first purpose-built office building in Great Britain. It contained the Admiralty board room, which is still used by the Admiralty, other state rooms,  offices and apartments for the Lords of the Admiralty. Robert Adam designed the screen, which was added to the entrance front in 1788. The Ripley Building is currently occupied by the Department for International Development.\n\nFile:Admiralty office Whitehall 1760 D Cunego.jpg|Old Admiralty (Ripley Building) in 1760 before addition of the Adam screen\nFile:Admiralty_building_Whitehall_1790.jpg|Old Admiralty (Ripley Building) c. 1790 after addition of the Adam screen\nFile:Admiraliteit london 1830.jpg|Old Admiralty (Ripley Building) c. 1830\n\nAdmiralty House\n\nAdmiralty House is a moderately proportioned mansion to the south of the Ripley Building, built in the late 18th century as the residence of the First Lord of the Admiralty. It served that purpose until 1964. Winston Churchill was one of its occupants. It lacks its own entrance from Whitehall and is entered through the Ripley Building. It is a three-storey building in yellow brick with neoclassical interiors. Its rear facade faces directly onto Horse Guards Parade. The architect was Samuel Pepys Cockerell. There are now three ministerial flats in the building, which were unoccupied in 2012.[http://www.parliament.uk/briefing-papers/SN03367/ministerial-residences Ministerial Residences]\n\nAdmiralty Extension\n\nThis is the largest of the Admiralty Buildings. It was begun in the late 19th century and redesigned while the construction was in progress to accommodate the extra offices needed by the naval arms race with the German Empire. It is a red brick building with white stone, detailing in the Queen Anne style with French influences. It has been used by the Foreign and Commonwealth Office from the 1960s to 2016. The Department for Education planned to move into the building in September 2017 following the Foreign and Commonwealth Office's decision to leave the building and consolidate its London staff into one building on King Charles Street.\n\nAdmiralty Arch\n\nAdmiralty Arch is linked to the Old Admiralty Building by a bridge and is part of the ceremonial route from Trafalgar Square to Buckingham Palace.\n\nThe Admiralty Citadel\n\nThis is a squat, windowless World War II fortress north west of Horse Guards Parade, now covered in ivy. See Military citadels under London for further details.\n\n\"Admiralty\" as a metonym for \"sea power\"\n\nIn some cases, the term admiralty is used in a wider sense, as meaning sea power or rule over the seas, rather than in strict reference to the institution exercising such power. For example, the well-known lines from Kipling's Song of the Dead:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Admiralty" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2988" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Admiralty, originally known as the Office of the Admiralty and Marine Affairs, was the government department responsible for the command of the Royal Navy first in the Kingdom of England, second in the Kingdom of Great Britain, and from 1801 to 1964, the United Kingdom and former British Empire.  Originally exercised by a single person, the Lord High Admiral (1385–1628), the Admiralty was, from the early 18th century onwards, almost invariably put \"in commission\" and exercised by the Lords Commissioners of the Admiralty, who sat on the Board of Admiralty.\n\nIn 1964, the functions of the Admiralty were transferred to a new Admiralty Board, which is a committee of the tri-service Defence Council of the United Kingdom and part of the Navy Department of the Ministry of Defence. The new Admiralty Board meets only twice a year, and the day-to-day running of the Royal Navy is controlled by a Navy Board (not to be confused with the historic Navy Board described later in this article). It is common for the various authorities now in charge of the Royal Navy to be referred to as simply The Admiralty.\n\nThe title of Lord High Admiral of the United Kingdom was vested in the monarch from 1964 to 2011. The title was awarded to Philip, Duke of Edinburgh by Queen Elizabeth II on his 90th birthday. There also continues to be a Vice-Admiral of the United Kingdom and a Rear-Admiral of the United Kingdom, both of which are honorary offices.\n\nFunction and organization\n\nHistory\n\nThe office of Admiral of England (or Lord Admiral and later Lord High Admiral) was created around 1400 although there had already been Admirals of the Northern and Western Seas. In 1546, King Henry VIII established the Council of the Marine, later to become the Navy Board, to oversee administrative affairs of the naval service. Operational control of the Royal Navy remained the responsibility of the Lord High Admiral, who was one of the nine Great Officers of State.\n\nIn 1628, Charles I put the office of Lord High Admiral into commission and control of the Royal Navy passed to a committee in the form of the Board of Admiralty. The office of Lord High Admiral passed a number of times in and out of commission until 1709 after which the office was almost permanently in commission (the last Lord High Admiral being the future King William IV in the early 19th century).\n\nIn 1831, the first Navy Board was abolished as a separate entity, and its duties and responsibilities were given over to the Admiralty.\n\nIn 1964, the Admiralty along with the War Office and the Air Ministry as separate departments of state were abolished, and re-emerged under  one single new Ministry of Defence. Within the expanded Ministry of Defence are the new Admiralty Board which has a separate (second) Navy Board responsible for the day-to-day running of the Royal Navy., the Army Board and the Air Force Board, each headed by the Secretary of State for Defence.\n\nBoard of Admiralty\n\nWhen the office of Lord High Admiral was in commission, as it was for most of the 18th, 19th and 20th centuries, until it reverted to the Crown, it was exercised by a Board of Admiralty, officially known as the Commissioners for Exercising the Office of Lord High Admiral of the United Kingdom of Great Britain and Northern Ireland, &c. (alternatively of England, Great Britain or the United Kingdom of Great Britain and Ireland depending on the period).\n\nThe Board of Admiralty consisted of a number of Lords Commissioners of the Admiralty. The Lords Commissioners were always a mixture of admirals, known as Naval Lords or Sea Lords and Civil Lords, normally politicians. The quorum of the Board was two commissioners and a secretary.\n\nThe president of the Board was known as the First Lord of the Admiralty, who was a member of the Cabinet. After 1806, the First Lord of the Admiralty was always a civilian while the professional head of the navy came to be (and is still today) known as the First Sea Lord.\n\nOrganization\n\nThe first real concerted effort to professionally organize the Admiralty was started by Henry VIII, this management approach would continue in force in the Royal navy until to 1832. In this organization a dual system operated the Lord High Admiral (from 1546) then Commissioners of the Admiralty (from 1628) exercised the function of general control (military administration) of the Navy and they were usually responsible for the conduct of any war, while the actual supply lines, support and services were managed by four principal officers, namely, the Treasurer, Comptroller, Surveyor and Clerk of the Acts, responsible individually for finance, supervision of accounts, Shipbuilding and maintenance of ships, and record of business. These principle officers came to be known as the Navy Board responsible for (civil administration) of the navy, from 1546 to 1832.\n\nThis structure of administering the navy lasted for 285 years, however, the supply system was often inefficient and corrupt its deficiencies were due as much to its limitations of the times they operated in. The various functions within the Admiralty were not coordinated effectively and lacked inter-dependency with each other, with the result that in 1832 Sir James Graham abolished the Navy Board and merged its functions within the Board of Admiralty's that at the time also had distinct advantages, however it failed to retain the principle of distinctions between the Admiralty and supply and a lot of bureaucracy followed with the merger.\n\nIn 1860 saw big growth in the development of technical crafts, the expansion of more admiralty branches that really began with age of steam that would have an enormous influence on the navy and naval thought.\n\nBetween 1860 and 1908 there was no real study of strategy and of staff work conducted within the naval service; it was practically ignored. All the Navy's talent flowed to the great technical universities. This school of thought for the next 50 years was exclusively technically based. The first serious attempt to introduce a sole management body to administer the naval service manifested itself in the creation of the Admiralty Navy War Council in 1909. It was believed by officials within the Admiralty at this time that the running of war was quite a simple matter for any flag officer who required no formal training. However, this mentality would be severely questioned with the advent of the Agadir crisis, when the Admiralty's war plans were heavily criticized. Following this, a new advisory body called the Admiralty War Staff was then instituted in 1912, headed by the Chief of the War Staff who was responsible for administering three new sub-divisions responsible for operations, intelligence and mobilisation. The new War Staff had hardly found its feet and it continually struggled with the opposition to its existence by senior officers they were categorically opposed to a staff. The deficiencies of the system within this department of state could be seen in the conduct of the Dardanelles campaign. There were no mechanisms in place to answer the big strategic questions. In 1914 a Trade Division was created.\n\nIn 1916, Sir John Jellicoe came to the Admiralty, he re-organized the war staff as following: Chief of War Staff, Operations, Intelligence, Signal Section, Mobilisation, Trade.\n\nIt was not until 1917 that the admiralty department was again properly reorganized and began to function as a professional military staff. In May that 1917, the term \"Admiralty War Staff\" was renamed and that department and its functional role were superseded by a new \"Admiralty Naval Staff\" in addition the newly created office of Chief of the Naval Staff was merged in the office of the First Sea Lord. Also appointed  was a new post that of Deputy Chief of the Naval Staff and an Assistant Chief of the Naval Staff who were all given seats on the Board of Admiralty. For the first time gave the naval staff direct representation on the board with the presence of three senior naval senior members on the board it ensured the necessary authority to carry through any operation of war. The Deputy Chief of Naval Staff would direct all operations and movements of the fleet, while the Assistant Chief of Naval Staff would be responsible for mercantile movements and anti-submarine operations.\n\nThe office of Controller would be re-established to deal with all questions relating to supply on September 6, 1917 a Deputy First Sea Lord, was added to the Board who would administer operations abroad and deal with questions of foreign policy. In October 1917 the development of the staff was carried one step further by the creation of two sub-committees of the Board – the Operations Committee and the Maintenance Committee. The First Lord was chairman of both committees, and the Operations Committee consisted of the First Sea Lord and Chief of Naval Staff., the Deputy First Sea Lord,  Assistant Chief of Naval Staff, and Fifth Sea Lord. The Maintenance Committee  consisted of the Deputy First Sea Lord. (representing the operations committee), Second Sea Lord. (personnel), Third Sea Lord. (material), Fourth Sea Lord. (transport and stores), Civil Lord, Controller and Financial Secretary.\n\nFull operational control of the Royal Navy was finally handed over to the Chief of Naval Staff by an order in Council, effective October 1917, under which he became responsible for the issuing of orders affecting all war operations directly to the fleet. It also empowered the C.N.S to issue orders in their own name as opposed to them previously being issued by the Permanent Secretary to the Admiralty in the name of the Board. This structure would remain in place until the department was abolished in 1964; post 1964 the operational control and this system still remains in place with the Royal Navy today. For the organisational structure of the admiralty department and how it developed through the centuries see the following articles below.\n\nSenior command\n\nNote: civilian is denoted (+) military is denoted (++)\n\nMinister of State for the Department of Admiralty,  President of the Board of Admiralty and Senior Government Adviser for Naval Affairs \n*Office of the First Lord of the Admiralty (+)  --------------Office of the Naval Secretary (++)\n**Board of Admiralty (+ and ++)\n***Navy Board, (+) independent from 1546 it became subordinate to, yet autonomous of the Board of Admiralty from 1628 to 1832.\nMilitary Head of the Navy Council/Naval War Staff/Naval Staff and Chief Naval Adviser on the Board of Admiralty to the First Lord\n*Office of the First Sea Lord and Chief of Naval Staff  (++) \n**Admiralty Navy War Council, (1909–1912),  (++)\n**Admiralty War Staff, (1912–1917), (++)\n**Admiralty Naval Staff, (1917–1964), (++)\nBoard of Admiralty, Navy Council and Naval Staff military members responsible for all Admiralty staff divisions and departments\n*Office of the Second Sea Lord (++)\n*Office of the Third Sea Lord (++)\n*Office of the Fourth Sea Lord (++)\n*Office of Fifth Sea Lord (++)\n**Office of Deputy Chief of the Naval Staff (++)\n***Office of Assistant Chief of the Naval Staff (++)\n***Office of the Vice Chief of the Naval Staff\n****Mobilisation and Intelligence Departments (++)\n****Naval Staff Divisions (++)\n****War Staff Divisions (++)\n***Office of the Deputy First Sea Lord (++)\nBoard of Admiralty members responsible other civil functions of the Department of Admiralty\n*Office of the Civil Lord of the Admiralty (+) \n**Office of the Additional Civil Lord of the Admiralty (+) \n*Office of the Permanent Secretary to the Admiralty (+)\n*Office of the Parliamentary and Financial Secretary to the Admiralty (+)\n\nAdmiralty Buildings\n\nThe Admiralty complex lies between Whitehall, Horse Guards Parade and The Mall and includes five inter-connected buildings. Since the Admiralty no longer exists as a department, these buildings are now used by separate government departments:\n\nThe Admiralty\n\nThe oldest building was long known simply as The Admiralty; it is now known officially as the Ripley Building, a three-storey U-shaped brick building designed by Thomas Ripley and completed in 1726. Alexander Pope implied the architecture is rather dull, lacking either the vigour of the baroque style, fading from fashion at the time, or the austere grandeur of the Palladian style just coming into vogue. It is mainly notable for being perhaps the first purpose-built office building in Great Britain. It contained the Admiralty board room, which is still used by the Admiralty, other state rooms,  offices and apartments for the Lords of the Admiralty. Robert Adam designed the screen, which was added to the entrance front in 1788. The Ripley Building is currently occupied by the Department for International Development.\n\nFile:Admiralty office Whitehall 1760 D Cunego.jpg|Old Admiralty (Ripley Building) in 1760 before addition of the Adam screen\nFile:Admiralty_building_Whitehall_1790.jpg|Old Admiralty (Ripley Building) c. 1790 after addition of the Adam screen\nFile:Admiraliteit london 1830.jpg|Old Admiralty (Ripley Building) c. 1830\n\nAdmiralty House\n\nAdmiralty House is a moderately proportioned mansion to the south of the Ripley Building, built in the late 18th century as the residence of the First Lord of the Admiralty. It served that purpose until 1964. Winston Churchill was one of its occupants. It lacks its own entrance from Whitehall and is entered through the Ripley Building. It is a three-storey building in yellow brick with neoclassical interiors. Its rear facade faces directly onto Horse Guards Parade. The architect was Samuel Pepys Cockerell. There are now three ministerial flats in the building, which were unoccupied in 2012.[http://www.parliament.uk/briefing-papers/SN03367/ministerial-residences Ministerial Residences]\n\nAdmiralty Extension\n\nThis is the largest of the Admiralty Buildings. It was begun in the late 19th century and redesigned while the construction was in progress to accommodate the extra offices needed by the naval arms race with the German Empire. It is a red brick building with white stone, detailing in the Queen Anne style with French influences. It has been used by the Foreign and Commonwealth Office from the 1960s to 2016. The Department for Education planned to move into the building in September 2017 following the Foreign and Commonwealth Office's decision to leave the building and consolidate its London staff into one building on King Charles Street.\n\nAdmiralty Arch\n\nAdmiralty Arch is linked to the Old Admiralty Building by a bridge and is part of the ceremonial route from Trafalgar Square to Buckingham Palace.\n\nThe Admiralty Citadel\n\nThis is a squat, windowless World War II fortress north west of Horse Guards Parade, now covered in ivy. See Military citadels under London for further details.\n\n\"Admiralty\" as a metonym for \"sea power\"\n\nIn some cases, the term admiralty is used in a wider sense, as meaning sea power or rule over the seas, rather than in strict reference to the institution exercising such power. For example, the well-known lines from Kipling's Song of the Dead:. Admiralty. http://en.wikipedia.org/?curid=2988."
  }
}
