{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13208",
  "eid" : "070a6c20-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778521058,
  "textBody" : "Hera (;  Hērā, equivalently  Hērē, in Ionic and Homeric Greek)  is the goddess of women, marriage, family and childbirth in Ancient Greek religion and myth, one of the Twelve Olympians. She is the daughter of the Titans Cronus and Rhea.\n\nHera is married to her brother Zeus, ruling over Mount Olympus as queen of the gods. A matronly figure, Hera served as both the patroness and protectress of married women, presiding over weddings and blessing marital unions. One of Hera's defining characteristics is her jealous and vengeful nature against Zeus' numerous lovers and illegitimate offspring, as well as the mortals who cross her. \nHera is commonly seen with the animals she considers sacred including the cow, lion and the peacock. Portrayed as majestic and solemn, often enthroned, and crowned with the polos (a high cylindrical crown worn by several of the Great Goddesses), Hera may hold a pomegranate in her hand, emblem of fertile blood and death and a substitute for the narcotic capsule of the opium poppy.Ruck, Carl A.P., and Danny Staples, The World of Classical Myth, 1994. Scholar of Greek mythology Walter Burkert writes in Greek Religion, \"Nevertheless, there are memories of an earlier aniconic representation, as a pillar in Argos and as a plank in Samos.\"Walter Burkert, Greek Religion, (Harvard University Press) 1985, p. 131\n\nHer Roman counterpart is Juno.Larousse Desk Reference Encyclopedia, The Book People, Haydock, 1995, p. 215.\n\nEtymology\n\nThe name of Hera may have several of mutually exclusive etymologies; one possibility is to connect it with Greek ὥρα hōra, season, and to interpret it as ripe for marriage and according to Plato ἐρατή eratē, \"beloved\"[http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.04.0057%3Aentry%3De)rato%2Fs ἐρατός] at LSJ as Zeus is said to have married her for love.Plato, Cratylus, [http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.01.0172%3Atext%3DCrat.%3Asection%3D404c 404c] According to Plutarch, Hera was an allegorical name and an anagram of aēr (ἀήρ, \"air\").On Isis and Osiris, 32 So begins the section on Hera in Walter Burkert's Greek Religion.Burkert, p. 131. In a note, he records other scholars' arguments \"for the meaning Mistress as a feminine to Heros, Master.\" John Chadwick, a decipherer of Linear B, remarks \"her name may be connected with hērōs, ἥρως, 'hero', but that is no help, since it too is etymologically obscure.\"Chadwick, The Mycenaean World (Cambridge University Press) 1976:87. A. J. van Windekens,Windekens, in Glotta 36 (1958), pp. 309-11. offers \"young cow, heifer\", which is consonant with Hera's common epithet βοῶπις (boōpis, \"cow-eyed\"). R. S. P. Beekes has suggested a Pre-Greek origin.R. S. P. Beekes, Etymological Dictionary of Greek, Brill, 2009, p. 524. Her name is attested in Mycenaean Greek written in the Linear B syllabic script as , e-ra, appearing on tablets found in Pylos and Thebes. \n\nCult\n\nHera may have been the first deity to whom the Greeks dedicated an enclosed roofed temple sanctuary, at Samos about 800 BCE. It was replaced later by the Heraion, one of the largest of all Greek temples (Greek altars were in front of the temples, under the open sky). There were many temples built on this site so evidence is somewhat confusing and archaeological dates are uncertain.\n\nThe temple created by the Rhoecus sculptors and architects was destroyed between 570–560 BCE. This was replaced by the Polycratean  temple 540–530 BCE. In one of these temples we see a forest of 155 columns. There is also no evidence of tiles on this temple suggesting either the temple was never finished or that the temple was open to the sky.\n\nEarlier sanctuaries, whose dedication to Hera is less certain, were of the Mycenaean type called \"house sanctuaries\".Martin Persson Nilsson, The Minoan-Mycenaean Religion and Its Survival in Greek Religion (Lund) 1950 pt. I.ii \"House Sanctuaries\", pp 77-116; H. W. Catling, \"A Late Bronze Age House- or Sanctuary-Model from the Menelaion, Sparta,\" BSA 84 (1989) 171-175.  Samos excavations have revealed votive offerings, many of them late 8th and 7th centuries BCE, which show that Hera at Samos was not merely a local Greek goddess of the Aegean: the museum there contains figures of gods and suppliants and other votive offerings from Armenia, Babylon, Iran, Assyria, Egypt, testimony to the reputation which this sanctuary of Hera enjoyed and to the large influx of pilgrims. Compared to this mighty goddess, who also possessed the earliest temple at Olympia and two of the great fifth and sixth century temples of Paestum, the termagant of Homer and the myths is an \"almost...comic figure\" according to Burkert.Burkert, p. 132, including quote; Burkert: Orientalizing Revolution.\n\nThough greatest and earliest free-standing temple to Hera was the Heraion of Samos, in the Greek mainland Hera was especially worshipped as \"Argive Hera\" (Hera Argeia) at her sanctuary that stood between the former Mycenaean city-states of Argos and Mycenae,Her name appears, with Zeus and Hermes, in a Linear B inscription (Tn 316) at Mycenean Pylos (John Chadwick, The Mycenaean World [Cambridge University Press] 1976:89). where the festivals in her honor called Heraia  were celebrated.  \"The three cities I love best,\" the ox-eyed Queen of Heaven declares (Iliad, book iv) \"are Argos, Sparta and Mycenae of the broad streets.\"  There were also temples to Hera in Olympia, Corinth, Tiryns, Perachora  and the sacred island of Delos. In Magna Graecia, two Doric temples to Hera were constructed at Paestum, about 550 BCE and about 450 BCE. One of them, long called the Temple of Poseidon  was identified in the 1950s as a second temple there of Hera.P.C. Sestieri, Paestum, the City, the Prehistoric Acropolis in Contrada Gaudo, and the Heraion at the Mouth of the Sele (Rome 1960), p. 11 etc. \"It is odd that there was no temple dedicated to Poseidon in a city named for him  (Paestum was originally called Poseidonia). Perhaps there was one at Sele, the settlement that preceded Paestum,\" Sarantis Symeonoglou suggested (Symeonoglou, \"The Doric Temples of Paestum\" Journal of Aesthetic Education, 19.1, Special Issue: Paestum and Classical Culture: Past and Present [Spring 1985:49-66] p. 50.\n\nIn Euboea the festival of the Great Daedala, sacred to Hera, was celebrated on a sixty-year cycle.\n\nHera's importance in the early archaic period is attested by the large building projects undertaken in her honor. The temples of Hera in the two main centers of her cult, the Heraion of Samos and the Heraion of Argos in the Argolid, were the very earliest monumental Greek temples constructed, in the 8th century BCE.\n\nImportance\n\nAccording to Walter Burkert, both Hera and Demeter have many characteristic attributes of Pre-Greek Great Goddesses.\"The goddesses of Greek polytheism, so different and complementary\"; Greek mythology scholar Walter Burkert has observed, in Homo Necans (1972) 1983:79f, \"are nonetheless, consistently similar at an earlier stage, with one or the other simply becoming dominant in a sanctuary or city. Each is the Great Goddess presiding over a male society; each is depicted in her attire as Mistress of the Beasts, and Mistress of the Sacrifice, even Hera and Demeter.\"\n\nAccording to the Homeric Hymn III to Delian Apollo, Hera detained Eileithyia to already prevent Leto from going into labor with Artemis and Apollo, since the father was Zeus. The other goddesses present at the birthing on Delos sent Iris to bring her. As she stepped upon the island, the divine birth began. In the myth of the birth of Heracles, it is Hera herself who sits at the door, delaying the birth of Heracles until her protégé, Eurystheus, had been born first.Homer, Iliad [http://www.perseus.tufts.edu/hopper/text?doc\nHom.+Il.+19.95 19.95ff.]\n\nThe Homeric Hymn to Pythian Apollo  makes the monster Typhaon the offspring of archaic Hera in her Minoan form, produced out of herself, like a monstrous version of Hephaestus, and whelped in a cave in Cilicia.Iliad, ii. 781-783) She gave the creature to Python to raise.\n\nIn the Temple of Hera at Olympia, Hera's seated cult figure was older than the warrior figure of Zeus that accompanied it. Homer expressed her relationship with Zeus delicately in the Iliad, in which she declares to Zeus, \"I am Cronus' eldest daughter, and am honourable not on this ground only, but also because I am your wife, and you are king of the gods.\"[http://www.gutenberg.org/etext/2199 The Iliad by Homer - Project Gutenberg]  Though Zeus is often called Zeus Heraios 'Zeus, (consort) of Hera', Homer's treatment of Hera is less than respectful, and in late anecdotal versions of the myths (see below) she appeared to spend most of her time plotting revenge on the nymphs seduced by her consort, for Hera upheld all the old right rules of Hellene society and sorority.\n\nMatriarchy\n\nThere has been considerable scholarship, reaching back to Johann Jakob Bachofen in the mid-nineteenth century,Bachofen, Mutterrecht 1861, as  Mother Right: An Investigation of the Religious and Juridical Character of Matriarchy in the Ancient World. Bachofen was seminal in the writings of Jane Ellen Harrison and other students of Greek myth. about the possibility that Hera, whose early importance in Greek religion is firmly established, was originally the goddess of a matriarchal people, presumably inhabiting Greece before the Hellenes. In this view, her activity as goddess of marriage established the patriarchal bond of her own subordination: her resistance to the conquests of Zeus is rendered as Hera's \"jealousy\", the main theme of literary anecdotes that undercut her ancient cult.Slater 1968.\n\nHowever, it remains a controversial claim that primitive matriarchy existed in Greece or elsewhere.Steven Goldberg, The Inevitability of Patriarchy, (William Morrow & Company, 1973); Joan Bamberger,'The Myth of Matriarchy: Why Men Rule in Primitive Society', in M Rosaldo and L Lamphere, Women, Culture, and Society, (Stanford, California: Stanford University Press, 1974), pp. 263-280; Donald E. Brown, [http://www.temple.edu/tempress/titles/864_reg_print.html Human Universals] (Philadelphia: Temple University Press), 1991; Steven Goldberg, Why Men Rule, (Chicago, Illinois: Open Court Publishing Company, 1993); Cynthia Eller, The Myth of Matriarchal Prehistory: Why an Invented Past Won't Give Women a Future, [https://www.amazon.com/dp/080706792X (Boston: Beacon Press, 2001)]; Jonathan Marks, 'Essay 8: Primate Behavior', in The Un-Textbook of Biological Anthropology, (Unpublished, 2007), p. 11; Encyclopædia Britannica describes this view as \"consensus\", listing matriarchy as a hypothetical social system. 'Matriarchy' Encyclopædia Britannica, 2007.\n\nOrigin and birth \n\nHera is the daughter of the youngest Titan Cronus and his wife, and sister, Rhea. Cronus was fated to be overthrown by one of his children; to prevent this, he swallowed all of his newborn children whole until Rhea tricked him into swallowing a stone instead of her youngest child, Zeus.  Zeus grew up in secret and when he grew up he tricked his father into regurgitating his siblings, including Hera.  Zeus then led the revolt against the Titans, banished them, and divided the dominion over the world with his brothers Poseidon and Hades.\n\nYouth\n\nHera was most known as the matron goddess, Hera Teleia; but she presided over weddings as well.  In myth and cult, fragmentary references and archaic practices remain of the sacred marriage of Hera and Zeus,Farnell, I 191, and at Plataea, there was a sculpture of Hera seated as a bride by Callimachus, as well as the matronly standing Hera.Pausanias, [http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookup=Paus.+9.2.1 9.2.7- 9.3.3] ; Pausanias explains this by telling the myth of the Daedala.\n\nHera was also worshipped as a virgin: there was a tradition in Stymphalia in Arcadia that there had been a triple shrine to Hera the Girl (Παις [Pais]), the Adult Woman (Τελεια [Teleia]), and the Separated (Χήρη [Chḗrē] 'Widowed' or 'Divorced').Farnell, I 194, citing Pausanias [http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookupPaus.+8.22.1 8.22.2] ' Pindar refers to the \"praises of Hera Parthenia [the Maidenly]\" Olympian ode [http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookup\nPind.+O.+6.1 6.88]   In the region around Argos, the temple of Hera in Hermione near Argos was to Hera the Virgin.S. Casson: \"Hera of Kanathos and the Ludovisi Throne\" The Journal of Hellenic Studies 40.2 (1920), pp. 137-142, citing Stephanus of Byzantium sub Ernaion. At the spring of Kanathos, close to Nauplia, Hera renewed her virginity annually, in rites that were not to be spoken of (arrheton).Pausanias, [http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookup=Paus.+2.38.1 2.38.2-3]. The Female figure, showing her \"Moon\" over the lake is also appropriate, as Hebe, Hera, and Hecate; new moon, full moon, and old moon in that order and otherwise personified as the Virgin of spring, The Mother of Summer, and the destroying Crone of Autumn.Robert Graves (1955), The Greek Myths.Barbara G. Walker (1983), The Women's Encyclopedia of Myths and Secrets, p.392 \n\nEmblems\n\nIn Hellenistic imagery, Hera's chariot was pulled by peacocks, birds not known to Greeks before the conquests of Alexander. Alexander's tutor, Aristotle, refers to it as \"the Persian bird.\" The peacock motif was revived in the Renaissance iconography that unified Hera and Juno, and which European painters focused on.Seznec, Jean, The Survival of the Pagan Gods : Mythological Tradition in Renaissance Humanism and Art, 1953 A bird that had been associated with Hera on an archaic level, where most of the Aegean goddesses were associated with \"their\" bird, was the cuckoo, which appears in mythic fragments concerning the first wooing of a virginal Hera by Zeus.\n\nHer archaic association was primarily with cattle, as a Cow Goddess, who was especially venerated in \"cattle-rich\" Euboea.  On Cyprus, very early archaeological sites contain bull skulls that have been adapted for use as masks (see Bull (mythology)).  Her familiar Homeric epithet Boôpis, is always translated \"cow-eyed\". In this respect, Hera bears some resemblance to the Ancient Egyptian deity Hathor, a maternal goddess associated with cattle.\n\nEpithets\n\nHera bore several epithets in the mythological tradition, including:\n* Ἀλέξανδρος (Alexandros) 'Protector of Men' (Alexandros) (among the Sicyonians)\n* Αἰγοφάγος (Aigophágos) 'Goat-Eater' (among the LacedaemoniansPausanias, iii. 15. § 7)\n* Ἀκραῖα (Akráia) '(She) of the Heights'James Joseph Clauss, Sarah Iles Johnston. [https://books.google.com/books?id480Wd8G6LPYC&pg\nPA46 Medea: Essays on Medea in myth, literature, philosophy, and art], 1997. p.46\n*  (Ammonia)\n* Ἀργεία (Argéia) '(She) of Argos'\n* Βασίλεια (Basíleia) 'Queen'\n* Βουναία (Bounáia) '(She) of the Mound' (in CorinthHenry George Liddell, Robert Scott. [http://www.perseus.tufts.edu/hopper/text?docPerseus:text:1999.04.0057:entry%3Dbounai/a A Greek-English Lexicon]Heinrich Schliemann. [https://books.google.com/books?id\nyj4TAAAAYAAJ&pg=PA284 Ilios: The city and country of the Trojans], 1881.)\n* Βοῶπις (Boṓpis) 'Cow-Eyed'Homeric Hymns or 'Cow-Faced'\n* Λευκώλενος (Leukṓlenos) 'White-Armed'\n* Παῖς (Pais) 'Child' (in her role as virgin)\n* Παρθένος (Parthénos) 'Virgin'\n* Τελεία (Teléia) (as goddess of marriage)\n* Χήρη (Chḗrē) 'Widowed'\n\nMarriage to Zeus \n\nHera is known for her jealousy; even Zeus, who is known to fear nothing, feared her tantrums. Zeus fell in love with Hera but she refused his first marriage proposal. Zeus then preyed on her empathy for animals and other beings, created a thunderstorm and transformed himself into a little cuckoo.  As a cuckoo, Zeus pretended to be in distress outside her window.  Hera, feeling pity towards the bird brought it inside and held it to her breast to warm it. Zeus then transformed back into himself and took advantage of her. Hera, ashamed of being exploited, agreed to marriage with Zeus. All of nature burst into bloom for their wedding and many gifts were exchanged.\n\nZeus loved Hera, but he also loved Greece and often snuck down to Earth in disguise to marry and bear children with the mortals. He wanted many children to inherit his greatness and become great heroes and rulers of Greece. Hera's jealousy towards all of Zeus' lovers and children caused her to continuously torment them and Zeus was powerless to stop his wife. Hera was always aware of Zeus' trickery and kept very close watch over him and his excursions to Earth.\n\nHera \"presided over the right arrangements of the marriage and is the archetype of the union in the marriage bed.\"\n\nChildren\n\nImportant stories involving Hera \n\nHeracles \n\nHera is the stepmother and enemy of Heracles. The name Heracles means \"Glory of Hera\". There are three alternative stories about the birth of Heracles and Hera's role in preventing it. In Homer's Iliad, when Alcmene was about to give birth to Heracles, Zeus announced to all the gods that on that day a child by Zeus himself, would be born and rule all those around him. Hera, after requesting Zeus to swear an oath to that effect, descended from Olympus to Argos and made the wife of Sthenelus (son of Perseus) give birth to Eurystheus after only seven months, while at the same time preventing Alcmene from delivering Heracles. This resulted in the fulfilment of Zeus's oath in that it was Eurystheus rather than Heracles. In an alternative version mentioned in Ovid's Metamorphoses, when Alcmene was pregnant with Zeus' child, Hera tried to prevent the birth from occurring by having Eileithyia (the Greek equivalent of Lucina) tie Alcmene's legs in knots. Her attempt was foiled when Galanthis frightened Eileithyia while she was tying Alcmene's legs and Heracles was born. Hera thus punishes Galanthis by turning her into a weasel.Ovid, Metamorphoses  [http://www.perseus.tufts.edu/hopper/text?doc\nOv.+Met.+9.273 9.273ff.] In Pausanias' recounting, Hera sent witches (as they were called by the Thebans) to hinder Alcmene's delivery of Heracles. The witches were successful in preventing the birth until Historis, daughter of Tiresias, thought of a trick to deceive the witches. Like Galanthis, Historis announced that Alcmene had delivered her child; having been deceived, the witches went away, allowing Alcmene to give birth.Pausanias, Description of Greece [http://www.perseus.tufts.edu/hopper/text?doc\nPaus.+9.11.3 9.11.3]\n\nHera's wrath against Zeus' son continues and while Heracles is still an infant, Hera sends two serpents to kill him as he lay in his cot. Heracles throttles the snakes with his bare hands and was found by his nurse playing with their limp bodies as if they were a child's toy.\n\nOne account of the origin of the Milky Way is that Zeus had tricked Hera into nursing the infant Heracles: discovering who he was, she pulled him from her breast, and a spurt of her milk formed the smear across the sky that can be seen to this day. Unlike any Greeks, the Etruscans instead pictured a full-grown bearded Heracles at Hera's breast: this may refer to his adoption by her when he became an Immortal. He had previously wounded her severely in the breast.\n\nWhen Heracles reached adulthood, Hera drove him mad, which led him to murder his family and this later led to him undertaking his famous labours. Hera assigned Heracles to labour for King Eurystheus at Mycenae. She attempted to make almost each of Heracles' twelve labours more difficult. When he fought the Lernaean Hydra, she sent a crab to bite at his feet in the hopes of distracting him. Later Hera stirred up the Amazons against him when he was on one of his quests. When Heracles took the cattle of Geryon, he shot Hera in the right breast with a triple-barbed arrow: the wound was incurable and left her in constant pain, as Dione tells Aphrodite in the Iliad, Book V. Afterwards, Hera sent a gadfly to bite the cattle, irritate them and scatter them. Hera then sent a flood which raised the water level of a river so much that Heracles could not ford the river with the cattle. He piled stones into the river to make the water shallower. When he finally reached the court of Eurystheus, the cattle were sacrificed to Hera.\n\nEurystheus also wanted to sacrifice the Cretan Bull to Hera. She refused the sacrifice because it reflected glory on Heracles. The bull was released and wandered to Marathon, becoming known as the Marathonian Bull.\n\nSome myths state that in the end, Heracles befriended Hera by saving her from Porphyrion, a giant who tried to rape her during the Gigantomachy, and that she even gave her daughter Hebe as his bride. Whatever myth-making served to account for an archaic representation of Heracles as \"Hera's man\" it was thought suitable for the builders of the Heraion at Paestum to depict the exploits of Heracles in bas-reliefs.Kerenyi, p 131\n\nLeto and the Twins: Apollo and Artemis \n\nWhen Hera discovered that Leto was pregnant and that Zeus was the father, she convinced the nature spirits to prevent Leto from giving birth on terra-firma, the mainland, any island at sea, or any place under the sun.Gaius Julius Hyginus, Fabulae 140). Poseidon gave pity to Leto and guided her to the floating island of Delos, which was neither mainland nor a real island where Leto was able to give birth to her children.Hammond. Oxford Classical Dictionary. 597-598. Afterwards, Zeus secured Delos to the bottom of the ocean. The island later became sacred to Apollo. Alternatively, Hera kidnapped Eileithyia, the goddess of childbirth, to prevent Leto from going into labor. The other gods bribed Hera with a beautiful necklace nobody could resist and she finally gave in.\n\nEither way, Artemis was born first and then assisted with the birth of Apollo.Pseudo-Apollodorus, Bibliotheke 1.4.1; Antoninus Liberalis, Metamorphoses, 35, giving as his sources Menecrates of Xanthos (4th century BCE) and Nicander of Colophon; Ovid, Metamorphoses vi.317-81 provides another late literary source. Some versions say Artemis helped her mother give birth to Apollo for nine days. Another variation states that Artemis was born one day before Apollo, on the island of Ortygia and that she helped Leto cross the sea to Delos the next day to give birth to Apollo.\n\nLater Tityos attempted to rape Leto at the behest of Hera. He was slain by Artemis and Apollo.\n\nIo and Argus\n\nHera saw a lone thundercloud and raced down in an attempt to catch Zeus with a mistress.  Zeus saw her coming and transformed his new bride Io into a little snow-white cow. However, Hera was not fooled and demanded that Zeus give her the heifer as a present. Zeus could not refuse his queen without drawing suspicion so he had to give her the beautiful heifer.\n\nOnce Io was given to Hera, she tied her to a tree and sent her servant Argus to keep Io separated from Zeus.  Argus was a loyal servant to Hera and he has immense strength and one hundred eyes all over his body. It was not possible to go past Argus since he never closed more than half his eyes at any time. Zeus was afraid of Hera's wrath could not personally intervene, so to save Io, he commanded Hermes to kill Argus, which he does by lulling all one hundred eyes into eternal sleep. In Ovid's interpolation, when Hera learned of Argus' death, she took his eyes and placed them in the plumage of the peacock, her favorite animal, accounting for the eye pattern in its tail and making it the vainest of all animals.Ovid, Metamorphoses I.624ff and II.531. The peacock (Greek taos), not native to Greece or Western Asia, was unknown to Hellenes until the time of Alexander the Great. Hera, furious about Io being free and the death of Argus, sent a gadfly (Greek oistros, compare oestrus) to sting Io as she wandered the earth.  Eventually Io made it to Egypt, the Egyptians worshiped the snow-white heifer and named her the Egyptian goddess Isis.  Hera permitted Zeus to change Io back into her human form, under the condition that he never look at her again.  Io, the goddess-queen of Egypt, then bore Zeus' son as the next King.\n\nJudgment of Paris \n\nA prophecy stated that a son of the sea-nymph Thetis, with whom Zeus fell in love after gazing upon her in the oceans off the Greek coast, would become greater than his father.Scholiast on Homer’s Iliad; Hyginus, Fabulae 54; Ovid, Metamorphoses 11.217. Possibly for this reasons,Apollodorus, [http://www.perseus.tufts.edu/hopper/text?docApollod.+1.1.1&redirect\ntrue Library] 3.168. Thetis was betrothed to an elderly human king, Peleus son of Aeacus, either upon Zeus' orders,Pindar, Nemean 5 ep2; Pindar, Isthmian 8 str3–str5. or because she wished to please Hera, who had raised her.Hesiod, Catalogue of Women fr. 57; Cypria fr. 4. All the gods and goddesses as well as various mortals were invited to the marriage of Peleus and Thetis (the eventual parents of Achilles) and brought many gifts.Photius, Myrobiblion 190. Only Eris, goddess of discord, was not invited and was stopped at the door by Hermes, on Zeus' order. She was annoyed at this, so she threw from the door a gift of her own:Hyginus, Fabulae 92. a golden apple inscribed with the word καλλίστῃ (kallistēi, \"To the fairest\").Apollodorus Epitome E.3.2 Aphrodite, Hera, and Athena all claimed to be the fairest, and thus the rightful owner of the apple.\n\nThe goddesses quarreled bitterly over it, and none of the other gods would venture an opinion favoring one, for fear of earning the enmity of the other two. They chose to place the matter before Zeus, who, not wanting to favor one of the goddesses, put the choice into the hands of Paris, a Trojan prince. After bathing in the spring of Mount Ida where Troy was situated, they appeared before Paris to have him choose. The goddesses undressed before him, either at his request or for the sake of winning. Still, Paris could not decide, as all three were ideally beautiful, so they resorted to bribes. Hera offered Paris political power and control of all of Asia, while Athena offered wisdom, fame, and glory in battle, and Aphrodite offered the most beautiful mortal woman in the world as a wife, and he accordingly chose her. This woman was Helen, who was, unfortunately for Paris, already married to King Menelaus of Sparta. The other two goddesses were enraged by this and through Helen's abduction by Paris they brought about the Trojan War.\n\nThe Iliad \n\nHera plays a substantial role in The Iliad, appearing in a number of books throughout the epic poem. In accordance with ancient Greek mythology, Hera's hatred towards the Trojans, which was started by Paris' decision that Aphrodite was the most beautiful goddess, is seen as through her support of the Greeks during the war. Throughout the epic Hera makes many attempts to thwart the Trojan army. In books 1 and 2, Hera declares that the Trojans must be destroyed. Hera persuades Athena to aid the Achaeans in battle and she agrees to assist with interfering on their behalf.\n\nIn book 5, Hera and Athena plot to harm Ares, who had been seen by Diomedes in assisting the Trojans. Diomedes called for his soldiers to fall back slowly. Hera, Ares' mother, saw Ares' interference and asked Zeus, Ares' father, for permission to drive Ares away from the battlefield. Hera encouraged Diomedes to attack Ares and he threw his spear at the god. Athena drove the spear into Ares' body, and he bellowed in pain and fled to Mt. Olympus, forcing the Trojans to fall back.\n\nIn book 8, Hera tries to persuade Poseidon to disobey Zeus and help the Achaean army. He refuses, saying he doesn’t want to go against Zeus. Determined to intervene in the war, Hera and Athena head to the battlefield. However, seeing the two flee, Zeus sent Iris to intercept them and make them return to Mt. Olympus or face grave consequences. After prolonged fighting, Hera sees Poseidon aiding the Greeks and giving them motivation to keep fighting.\n\nIn book 14 Hera devises a plan to deceive Zeus. Zeus set a decree that the gods were not allowed to interfere in the mortal war. Hera is on the side of the Achaeans, so she plans a Deception of Zeus where she seduces him, with help from Aphrodite, and tricks him into a deep sleep, with the help of Hypnos, so that the Gods could interfere without the fear of Zeus.Homer. Iliad, Book 14, Lines 153-353.\n\nIn book 21, Hera continues her interference with the battle as she tells Hephaestus to prevent the river from harming Achilles.  Hephaestus sets the battlefield ablaze, causing the river to plead with Hera, promising her he will not help the Trojans if Hephaestus stops his attack. Hephaestus stops his assault and Hera returns to the battlefield where the gods begin to fight amongst themselves.\n\nSmaller stories involving Hera \n\nEcho\n* According to the urbane retelling of myth in Ovid's Metamorphoses,Metamorphoses, iii.341-401. for a long time, a nymph named Echo had the job of distracting Hera from Zeus' affairs by leading her away and flattering her.  When Hera discovered the deception, she cursed Echo to only repeat the words of others (hence our modern word \"echo\").\nSemele and Dionysus\n* When Hera learned that Semele, daughter of Cadmus King of Thebes, was pregnant by Zeus, she disguised herself as Semele's nurse and persuaded the princess to insist that Zeus show himself to her in his true form. When he was compelled to do so, having sworn by Styx Hamilton, Edith (1969).  \"Mythology\".  his thunder and lightning destroyed Semele. Zeus took Semele's unborn child, Dionysus and completed its gestation sewn into his own thigh.\n* In another version, Dionysus was originally the son of Zeus by either Demeter or Persephone. Hera sent her Titans to rip the baby apart, from which he was called Zagreus (\"Torn in Pieces\"). Zeus rescued the heart; or, the heart was saved, variously, by Athena, Rhea, or Demeter.Seyffert Dictionary Zeus used the heart to recreate Dionysus and implant him in the womb of Semele—hence Dionysus became known as \"the twice-born\". Certain versions imply that Zeus gave Semele the heart to eat to impregnate her. Hera tricked Semele into asking Zeus to reveal his true form, which killed her. Dionysus later managed to rescue his mother from the underworld and have her live on Mount Olympus.\n* See also Dionysus' birth for other variations.\nLamia\n* Lamia was a queen of Libya, whom Zeus loved. Hera turned her into a monster and murdered their children. Or, alternatively, she killed Lamia's children and the grief turned her into a monster. Lamia was cursed with the inability to close her eyes so that she would always obsess over the image of her dead children. Zeus gave her the gift to be able to take her eyes out to rest, and then put them back in. Lamia was envious of other mothers and ate their children.\nGerana\n* Gerana was a queen of the Pygmies who boasted she was more beautiful than Hera. The wrathful goddess turned her into a crane and proclaimed that her bird descendants should wage eternal war on the Pygmy folk.Ovid, Metamorphoses 6.89 - 91\n\nCydippe\n* Cydippe, a priestess of Hera, was on her way to a festival in the goddess' honor.  The oxen which were to pull her cart were overdue and her sons, Biton and Cleobis, pulled the cart the entire way (45 stadia, 8 kilometers).  Cydippe was impressed with their devotion to her and Hera so asked Hera to give her children the best gift a god could give a person.  Hera ordained that the brothers would die in their sleep.\n* This honor bestowed upon the children was later used by Solon, as a proof while trying to convince Croesus  that it is impossible to judge a person's happiness until they have died a fruitful death after a joyous life.Herodotus' History, Book I\nTiresias\n* Tiresias was a priest of Zeus, and as a young man he encountered two snakes mating and hit them with a stick. He was then transformed into a woman. As a woman, Tiresias became a priestess of Hera, married and had children, including Manto. After seven years as a woman, Tiresias again found mating snakes; depending on the myth, either she made sure to leave the snakes alone this time, or, according to Hyginus, trampled on them and became a man once more.Hygini, Fabulae, LXXV\n* As a result of his experiences, Zeus and Hera asked him to settle the question of which sex, male or female, experienced more pleasure during intercourse. Zeus claimed it was women; Hera claimed it was men. When Tiresias sided with Zeus, Hera struck him blind.\n* Since Zeus could not undo what she had done, he gave him the gift of prophecy. An alternative and less commonly told story has it that Tiresias was blinded by Athena after he stumbled onto her bathing naked. His mother, Chariclo, begged her to undo her curse, but Athena could not; she gave him prophecy instead.\nChelone\n* At the marriage of Zeus and Hera, a nymph named Chelone was disrespectful or refused to attend. Zeus thus, turned her into a tortoise.\nThe Golden Fleece\n* Hera hated Pelias because he had killed Sidero, his step-grandmother, in one of the goddess's temples.  She later convinced Jason and Medea to kill Pelias. The Golden Fleece was the item that Jason needed to get his mother freed.\nThe Metamorphoses\n* In Thrace, Hera and Zeus turned King Haemus and Queen Rhodope into mountains,Ovid, Metamorphoses  6.87 the Balkan (Haemus Mons) and Rhodope Mountains respectively, for their hubris in comparing themselves to the gods.\nIxion\n* When Zeus had pity on Ixion and brought him to Olympus and introduced him to the gods, instead of being grateful, Ixion grew lustful for Hera. Zeus found out about his intentions and made a cloud in the shape of Hera, who was later named Nephele, and tricked Ixion into coupling with it and from their union came Centaurus. So Ixion was expelled from Olympus and Zeus ordered Hermes to bind Ixion to a winged fiery wheel that was always spinning. Therefore, Ixion was bound to a burning solar wheel for all eternity, at first spinning across the heavens, but in later myth transferred to Tartarus.Kerenyi 1951, p.160\n\nGenealogy\n\nArt and events\n\n* Barberini Hera - a Roman sculpture of Hera/Juno\n* Hera Borghese - sculpture related to Hera\n* Hera Farnese - sculpture of Hera's head\n* Heraea Games - games dedicated to Hera—the first sanctioned (and recorded) women's athletic competition to be held in the stadium at Olympia.\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hera" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13208" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hera (;  Hērā, equivalently  Hērē, in Ionic and Homeric Greek)  is the goddess of women, marriage, family and childbirth in Ancient Greek religion and myth, one of the Twelve Olympians. She is the daughter of the Titans Cronus and Rhea.\n\nHera is married to her brother Zeus, ruling over Mount Olympus as queen of the gods. A matronly figure, Hera served as both the patroness and protectress of married women, presiding over weddings and blessing marital unions. One of Hera's defining characteristics is her jealous and vengeful nature against Zeus' numerous lovers and illegitimate offspring, as well as the mortals who cross her. \nHera is commonly seen with the animals she considers sacred including the cow, lion and the peacock. Portrayed as majestic and solemn, often enthroned, and crowned with the polos (a high cylindrical crown worn by several of the Great Goddesses), Hera may hold a pomegranate in her hand, emblem of fertile blood and death and a substitute for the narcotic capsule of the opium poppy.Ruck, Carl A.P., and Danny Staples, The World of Classical Myth, 1994. Scholar of Greek mythology Walter Burkert writes in Greek Religion, \"Nevertheless, there are memories of an earlier aniconic representation, as a pillar in Argos and as a plank in Samos.\"Walter Burkert, Greek Religion, (Harvard University Press) 1985, p. 131\n\nHer Roman counterpart is Juno.Larousse Desk Reference Encyclopedia, The Book People, Haydock, 1995, p. 215.\n\nEtymology\n\nThe name of Hera may have several of mutually exclusive etymologies; one possibility is to connect it with Greek ὥρα hōra, season, and to interpret it as ripe for marriage and according to Plato ἐρατή eratē, \"beloved\"[http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.04.0057%3Aentry%3De)rato%2Fs ἐρατός] at LSJ as Zeus is said to have married her for love.Plato, Cratylus, [http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.01.0172%3Atext%3DCrat.%3Asection%3D404c 404c] According to Plutarch, Hera was an allegorical name and an anagram of aēr (ἀήρ, \"air\").On Isis and Osiris, 32 So begins the section on Hera in Walter Burkert's Greek Religion.Burkert, p. 131. In a note, he records other scholars' arguments \"for the meaning Mistress as a feminine to Heros, Master.\" John Chadwick, a decipherer of Linear B, remarks \"her name may be connected with hērōs, ἥρως, 'hero', but that is no help, since it too is etymologically obscure.\"Chadwick, The Mycenaean World (Cambridge University Press) 1976:87. A. J. van Windekens,Windekens, in Glotta 36 (1958), pp. 309-11. offers \"young cow, heifer\", which is consonant with Hera's common epithet βοῶπις (boōpis, \"cow-eyed\"). R. S. P. Beekes has suggested a Pre-Greek origin.R. S. P. Beekes, Etymological Dictionary of Greek, Brill, 2009, p. 524. Her name is attested in Mycenaean Greek written in the Linear B syllabic script as , e-ra, appearing on tablets found in Pylos and Thebes. \n\nCult\n\nHera may have been the first deity to whom the Greeks dedicated an enclosed roofed temple sanctuary, at Samos about 800 BCE. It was replaced later by the Heraion, one of the largest of all Greek temples (Greek altars were in front of the temples, under the open sky). There were many temples built on this site so evidence is somewhat confusing and archaeological dates are uncertain.\n\nThe temple created by the Rhoecus sculptors and architects was destroyed between 570–560 BCE. This was replaced by the Polycratean  temple 540–530 BCE. In one of these temples we see a forest of 155 columns. There is also no evidence of tiles on this temple suggesting either the temple was never finished or that the temple was open to the sky.\n\nEarlier sanctuaries, whose dedication to Hera is less certain, were of the Mycenaean type called \"house sanctuaries\".Martin Persson Nilsson, The Minoan-Mycenaean Religion and Its Survival in Greek Religion (Lund) 1950 pt. I.ii \"House Sanctuaries\", pp 77-116; H. W. Catling, \"A Late Bronze Age House- or Sanctuary-Model from the Menelaion, Sparta,\" BSA 84 (1989) 171-175.  Samos excavations have revealed votive offerings, many of them late 8th and 7th centuries BCE, which show that Hera at Samos was not merely a local Greek goddess of the Aegean: the museum there contains figures of gods and suppliants and other votive offerings from Armenia, Babylon, Iran, Assyria, Egypt, testimony to the reputation which this sanctuary of Hera enjoyed and to the large influx of pilgrims. Compared to this mighty goddess, who also possessed the earliest temple at Olympia and two of the great fifth and sixth century temples of Paestum, the termagant of Homer and the myths is an \"almost...comic figure\" according to Burkert.Burkert, p. 132, including quote; Burkert: Orientalizing Revolution.\n\nThough greatest and earliest free-standing temple to Hera was the Heraion of Samos, in the Greek mainland Hera was especially worshipped as \"Argive Hera\" (Hera Argeia) at her sanctuary that stood between the former Mycenaean city-states of Argos and Mycenae,Her name appears, with Zeus and Hermes, in a Linear B inscription (Tn 316) at Mycenean Pylos (John Chadwick, The Mycenaean World [Cambridge University Press] 1976:89). where the festivals in her honor called Heraia  were celebrated.  \"The three cities I love best,\" the ox-eyed Queen of Heaven declares (Iliad, book iv) \"are Argos, Sparta and Mycenae of the broad streets.\"  There were also temples to Hera in Olympia, Corinth, Tiryns, Perachora  and the sacred island of Delos. In Magna Graecia, two Doric temples to Hera were constructed at Paestum, about 550 BCE and about 450 BCE. One of them, long called the Temple of Poseidon  was identified in the 1950s as a second temple there of Hera.P.C. Sestieri, Paestum, the City, the Prehistoric Acropolis in Contrada Gaudo, and the Heraion at the Mouth of the Sele (Rome 1960), p. 11 etc. \"It is odd that there was no temple dedicated to Poseidon in a city named for him  (Paestum was originally called Poseidonia). Perhaps there was one at Sele, the settlement that preceded Paestum,\" Sarantis Symeonoglou suggested (Symeonoglou, \"The Doric Temples of Paestum\" Journal of Aesthetic Education, 19.1, Special Issue: Paestum and Classical Culture: Past and Present [Spring 1985:49-66] p. 50.\n\nIn Euboea the festival of the Great Daedala, sacred to Hera, was celebrated on a sixty-year cycle.\n\nHera's importance in the early archaic period is attested by the large building projects undertaken in her honor. The temples of Hera in the two main centers of her cult, the Heraion of Samos and the Heraion of Argos in the Argolid, were the very earliest monumental Greek temples constructed, in the 8th century BCE.\n\nImportance\n\nAccording to Walter Burkert, both Hera and Demeter have many characteristic attributes of Pre-Greek Great Goddesses.\"The goddesses of Greek polytheism, so different and complementary\"; Greek mythology scholar Walter Burkert has observed, in Homo Necans (1972) 1983:79f, \"are nonetheless, consistently similar at an earlier stage, with one or the other simply becoming dominant in a sanctuary or city. Each is the Great Goddess presiding over a male society; each is depicted in her attire as Mistress of the Beasts, and Mistress of the Sacrifice, even Hera and Demeter.\"\n\nAccording to the Homeric Hymn III to Delian Apollo, Hera detained Eileithyia to already prevent Leto from going into labor with Artemis and Apollo, since the father was Zeus. The other goddesses present at the birthing on Delos sent Iris to bring her. As she stepped upon the island, the divine birth began. In the myth of the birth of Heracles, it is Hera herself who sits at the door, delaying the birth of Heracles until her protégé, Eurystheus, had been born first.Homer, Iliad [http://www.perseus.tufts.edu/hopper/text?doc\nHom.+Il.+19.95 19.95ff.]\n\nThe Homeric Hymn to Pythian Apollo  makes the monster Typhaon the offspring of archaic Hera in her Minoan form, produced out of herself, like a monstrous version of Hephaestus, and whelped in a cave in Cilicia.Iliad, ii. 781-783) She gave the creature to Python to raise.\n\nIn the Temple of Hera at Olympia, Hera's seated cult figure was older than the warrior figure of Zeus that accompanied it. Homer expressed her relationship with Zeus delicately in the Iliad, in which she declares to Zeus, \"I am Cronus' eldest daughter, and am honourable not on this ground only, but also because I am your wife, and you are king of the gods.\"[http://www.gutenberg.org/etext/2199 The Iliad by Homer - Project Gutenberg]  Though Zeus is often called Zeus Heraios 'Zeus, (consort) of Hera', Homer's treatment of Hera is less than respectful, and in late anecdotal versions of the myths (see below) she appeared to spend most of her time plotting revenge on the nymphs seduced by her consort, for Hera upheld all the old right rules of Hellene society and sorority.\n\nMatriarchy\n\nThere has been considerable scholarship, reaching back to Johann Jakob Bachofen in the mid-nineteenth century,Bachofen, Mutterrecht 1861, as  Mother Right: An Investigation of the Religious and Juridical Character of Matriarchy in the Ancient World. Bachofen was seminal in the writings of Jane Ellen Harrison and other students of Greek myth. about the possibility that Hera, whose early importance in Greek religion is firmly established, was originally the goddess of a matriarchal people, presumably inhabiting Greece before the Hellenes. In this view, her activity as goddess of marriage established the patriarchal bond of her own subordination: her resistance to the conquests of Zeus is rendered as Hera's \"jealousy\", the main theme of literary anecdotes that undercut her ancient cult.Slater 1968.\n\nHowever, it remains a controversial claim that primitive matriarchy existed in Greece or elsewhere.Steven Goldberg, The Inevitability of Patriarchy, (William Morrow & Company, 1973); Joan Bamberger,'The Myth of Matriarchy: Why Men Rule in Primitive Society', in M Rosaldo and L Lamphere, Women, Culture, and Society, (Stanford, California: Stanford University Press, 1974), pp. 263-280; Donald E. Brown, [http://www.temple.edu/tempress/titles/864_reg_print.html Human Universals] (Philadelphia: Temple University Press), 1991; Steven Goldberg, Why Men Rule, (Chicago, Illinois: Open Court Publishing Company, 1993); Cynthia Eller, The Myth of Matriarchal Prehistory: Why an Invented Past Won't Give Women a Future, [https://www.amazon.com/dp/080706792X (Boston: Beacon Press, 2001)]; Jonathan Marks, 'Essay 8: Primate Behavior', in The Un-Textbook of Biological Anthropology, (Unpublished, 2007), p. 11; Encyclopædia Britannica describes this view as \"consensus\", listing matriarchy as a hypothetical social system. 'Matriarchy' Encyclopædia Britannica, 2007.\n\nOrigin and birth \n\nHera is the daughter of the youngest Titan Cronus and his wife, and sister, Rhea. Cronus was fated to be overthrown by one of his children; to prevent this, he swallowed all of his newborn children whole until Rhea tricked him into swallowing a stone instead of her youngest child, Zeus.  Zeus grew up in secret and when he grew up he tricked his father into regurgitating his siblings, including Hera.  Zeus then led the revolt against the Titans, banished them, and divided the dominion over the world with his brothers Poseidon and Hades.\n\nYouth\n\nHera was most known as the matron goddess, Hera Teleia; but she presided over weddings as well.  In myth and cult, fragmentary references and archaic practices remain of the sacred marriage of Hera and Zeus,Farnell, I 191, and at Plataea, there was a sculpture of Hera seated as a bride by Callimachus, as well as the matronly standing Hera.Pausanias, [http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookup=Paus.+9.2.1 9.2.7- 9.3.3] ; Pausanias explains this by telling the myth of the Daedala.\n\nHera was also worshipped as a virgin: there was a tradition in Stymphalia in Arcadia that there had been a triple shrine to Hera the Girl (Παις [Pais]), the Adult Woman (Τελεια [Teleia]), and the Separated (Χήρη [Chḗrē] 'Widowed' or 'Divorced').Farnell, I 194, citing Pausanias [http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookupPaus.+8.22.1 8.22.2] ' Pindar refers to the \"praises of Hera Parthenia [the Maidenly]\" Olympian ode [http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookup\nPind.+O.+6.1 6.88]   In the region around Argos, the temple of Hera in Hermione near Argos was to Hera the Virgin.S. Casson: \"Hera of Kanathos and the Ludovisi Throne\" The Journal of Hellenic Studies 40.2 (1920), pp. 137-142, citing Stephanus of Byzantium sub Ernaion. At the spring of Kanathos, close to Nauplia, Hera renewed her virginity annually, in rites that were not to be spoken of (arrheton).Pausanias, [http://perseus.mpiwg-berlin.mpg.de/cgi-bin/ptext?lookup=Paus.+2.38.1 2.38.2-3]. The Female figure, showing her \"Moon\" over the lake is also appropriate, as Hebe, Hera, and Hecate; new moon, full moon, and old moon in that order and otherwise personified as the Virgin of spring, The Mother of Summer, and the destroying Crone of Autumn.Robert Graves (1955), The Greek Myths.Barbara G. Walker (1983), The Women's Encyclopedia of Myths and Secrets, p.392 \n\nEmblems\n\nIn Hellenistic imagery, Hera's chariot was pulled by peacocks, birds not known to Greeks before the conquests of Alexander. Alexander's tutor, Aristotle, refers to it as \"the Persian bird.\" The peacock motif was revived in the Renaissance iconography that unified Hera and Juno, and which European painters focused on.Seznec, Jean, The Survival of the Pagan Gods : Mythological Tradition in Renaissance Humanism and Art, 1953 A bird that had been associated with Hera on an archaic level, where most of the Aegean goddesses were associated with \"their\" bird, was the cuckoo, which appears in mythic fragments concerning the first wooing of a virginal Hera by Zeus.\n\nHer archaic association was primarily with cattle, as a Cow Goddess, who was especially venerated in \"cattle-rich\" Euboea.  On Cyprus, very early archaeological sites contain bull skulls that have been adapted for use as masks (see Bull (mythology)).  Her familiar Homeric epithet Boôpis, is always translated \"cow-eyed\". In this respect, Hera bears some resemblance to the Ancient Egyptian deity Hathor, a maternal goddess associated with cattle.\n\nEpithets\n\nHera bore several epithets in the mythological tradition, including:\n* Ἀλέξανδρος (Alexandros) 'Protector of Men' (Alexandros) (among the Sicyonians)\n* Αἰγοφάγος (Aigophágos) 'Goat-Eater' (among the LacedaemoniansPausanias, iii. 15. § 7)\n* Ἀκραῖα (Akráia) '(She) of the Heights'James Joseph Clauss, Sarah Iles Johnston. [https://books.google.com/books?id480Wd8G6LPYC&pg\nPA46 Medea: Essays on Medea in myth, literature, philosophy, and art], 1997. p.46\n*  (Ammonia)\n* Ἀργεία (Argéia) '(She) of Argos'\n* Βασίλεια (Basíleia) 'Queen'\n* Βουναία (Bounáia) '(She) of the Mound' (in CorinthHenry George Liddell, Robert Scott. [http://www.perseus.tufts.edu/hopper/text?docPerseus:text:1999.04.0057:entry%3Dbounai/a A Greek-English Lexicon]Heinrich Schliemann. [https://books.google.com/books?id\nyj4TAAAAYAAJ&pg=PA284 Ilios: The city and country of the Trojans], 1881.)\n* Βοῶπις (Boṓpis) 'Cow-Eyed'Homeric Hymns or 'Cow-Faced'\n* Λευκώλενος (Leukṓlenos) 'White-Armed'\n* Παῖς (Pais) 'Child' (in her role as virgin)\n* Παρθένος (Parthénos) 'Virgin'\n* Τελεία (Teléia) (as goddess of marriage)\n* Χήρη (Chḗrē) 'Widowed'\n\nMarriage to Zeus \n\nHera is known for her jealousy; even Zeus, who is known to fear nothing, feared her tantrums. Zeus fell in love with Hera but she refused his first marriage proposal. Zeus then preyed on her empathy for animals and other beings, created a thunderstorm and transformed himself into a little cuckoo.  As a cuckoo, Zeus pretended to be in distress outside her window.  Hera, feeling pity towards the bird brought it inside and held it to her breast to warm it. Zeus then transformed back into himself and took advantage of her. Hera, ashamed of being exploited, agreed to marriage with Zeus. All of nature burst into bloom for their wedding and many gifts were exchanged.\n\nZeus loved Hera, but he also loved Greece and often snuck down to Earth in disguise to marry and bear children with the mortals. He wanted many children to inherit his greatness and become great heroes and rulers of Greece. Hera's jealousy towards all of Zeus' lovers and children caused her to continuously torment them and Zeus was powerless to stop his wife. Hera was always aware of Zeus' trickery and kept very close watch over him and his excursions to Earth.\n\nHera \"presided over the right arrangements of the marriage and is the archetype of the union in the marriage bed.\"\n\nChildren\n\nImportant stories involving Hera \n\nHeracles \n\nHera is the stepmother and enemy of Heracles. The name Heracles means \"Glory of Hera\". There are three alternative stories about the birth of Heracles and Hera's role in preventing it. In Homer's Iliad, when Alcmene was about to give birth to Heracles, Zeus announced to all the gods that on that day a child by Zeus himself, would be born and rule all those around him. Hera, after requesting Zeus to swear an oath to that effect, descended from Olympus to Argos and made the wife of Sthenelus (son of Perseus) give birth to Eurystheus after only seven months, while at the same time preventing Alcmene from delivering Heracles. This resulted in the fulfilment of Zeus's oath in that it was Eurystheus rather than Heracles. In an alternative version mentioned in Ovid's Metamorphoses, when Alcmene was pregnant with Zeus' child, Hera tried to prevent the birth from occurring by having Eileithyia (the Greek equivalent of Lucina) tie Alcmene's legs in knots. Her attempt was foiled when Galanthis frightened Eileithyia while she was tying Alcmene's legs and Heracles was born. Hera thus punishes Galanthis by turning her into a weasel.Ovid, Metamorphoses  [http://www.perseus.tufts.edu/hopper/text?doc\nOv.+Met.+9.273 9.273ff.] In Pausanias' recounting, Hera sent witches (as they were called by the Thebans) to hinder Alcmene's delivery of Heracles. The witches were successful in preventing the birth until Historis, daughter of Tiresias, thought of a trick to deceive the witches. Like Galanthis, Historis announced that Alcmene had delivered her child; having been deceived, the witches went away, allowing Alcmene to give birth.Pausanias, Description of Greece [http://www.perseus.tufts.edu/hopper/text?doc\nPaus.+9.11.3 9.11.3]\n\nHera's wrath against Zeus' son continues and while Heracles is still an infant, Hera sends two serpents to kill him as he lay in his cot. Heracles throttles the snakes with his bare hands and was found by his nurse playing with their limp bodies as if they were a child's toy.\n\nOne account of the origin of the Milky Way is that Zeus had tricked Hera into nursing the infant Heracles: discovering who he was, she pulled him from her breast, and a spurt of her milk formed the smear across the sky that can be seen to this day. Unlike any Greeks, the Etruscans instead pictured a full-grown bearded Heracles at Hera's breast: this may refer to his adoption by her when he became an Immortal. He had previously wounded her severely in the breast.\n\nWhen Heracles reached adulthood, Hera drove him mad, which led him to murder his family and this later led to him undertaking his famous labours. Hera assigned Heracles to labour for King Eurystheus at Mycenae. She attempted to make almost each of Heracles' twelve labours more difficult. When he fought the Lernaean Hydra, she sent a crab to bite at his feet in the hopes of distracting him. Later Hera stirred up the Amazons against him when he was on one of his quests. When Heracles took the cattle of Geryon, he shot Hera in the right breast with a triple-barbed arrow: the wound was incurable and left her in constant pain, as Dione tells Aphrodite in the Iliad, Book V. Afterwards, Hera sent a gadfly to bite the cattle, irritate them and scatter them. Hera then sent a flood which raised the water level of a river so much that Heracles could not ford the river with the cattle. He piled stones into the river to make the water shallower. When he finally reached the court of Eurystheus, the cattle were sacrificed to Hera.\n\nEurystheus also wanted to sacrifice the Cretan Bull to Hera. She refused the sacrifice because it reflected glory on Heracles. The bull was released and wandered to Marathon, becoming known as the Marathonian Bull.\n\nSome myths state that in the end, Heracles befriended Hera by saving her from Porphyrion, a giant who tried to rape her during the Gigantomachy, and that she even gave her daughter Hebe as his bride. Whatever myth-making served to account for an archaic representation of Heracles as \"Hera's man\" it was thought suitable for the builders of the Heraion at Paestum to depict the exploits of Heracles in bas-reliefs.Kerenyi, p 131\n\nLeto and the Twins: Apollo and Artemis \n\nWhen Hera discovered that Leto was pregnant and that Zeus was the father, she convinced the nature spirits to prevent Leto from giving birth on terra-firma, the mainland, any island at sea, or any place under the sun.Gaius Julius Hyginus, Fabulae 140). Poseidon gave pity to Leto and guided her to the floating island of Delos, which was neither mainland nor a real island where Leto was able to give birth to her children.Hammond. Oxford Classical Dictionary. 597-598. Afterwards, Zeus secured Delos to the bottom of the ocean. The island later became sacred to Apollo. Alternatively, Hera kidnapped Eileithyia, the goddess of childbirth, to prevent Leto from going into labor. The other gods bribed Hera with a beautiful necklace nobody could resist and she finally gave in.\n\nEither way, Artemis was born first and then assisted with the birth of Apollo.Pseudo-Apollodorus, Bibliotheke 1.4.1; Antoninus Liberalis, Metamorphoses, 35, giving as his sources Menecrates of Xanthos (4th century BCE) and Nicander of Colophon; Ovid, Metamorphoses vi.317-81 provides another late literary source. Some versions say Artemis helped her mother give birth to Apollo for nine days. Another variation states that Artemis was born one day before Apollo, on the island of Ortygia and that she helped Leto cross the sea to Delos the next day to give birth to Apollo.\n\nLater Tityos attempted to rape Leto at the behest of Hera. He was slain by Artemis and Apollo.\n\nIo and Argus\n\nHera saw a lone thundercloud and raced down in an attempt to catch Zeus with a mistress.  Zeus saw her coming and transformed his new bride Io into a little snow-white cow. However, Hera was not fooled and demanded that Zeus give her the heifer as a present. Zeus could not refuse his queen without drawing suspicion so he had to give her the beautiful heifer.\n\nOnce Io was given to Hera, she tied her to a tree and sent her servant Argus to keep Io separated from Zeus.  Argus was a loyal servant to Hera and he has immense strength and one hundred eyes all over his body. It was not possible to go past Argus since he never closed more than half his eyes at any time. Zeus was afraid of Hera's wrath could not personally intervene, so to save Io, he commanded Hermes to kill Argus, which he does by lulling all one hundred eyes into eternal sleep. In Ovid's interpolation, when Hera learned of Argus' death, she took his eyes and placed them in the plumage of the peacock, her favorite animal, accounting for the eye pattern in its tail and making it the vainest of all animals.Ovid, Metamorphoses I.624ff and II.531. The peacock (Greek taos), not native to Greece or Western Asia, was unknown to Hellenes until the time of Alexander the Great. Hera, furious about Io being free and the death of Argus, sent a gadfly (Greek oistros, compare oestrus) to sting Io as she wandered the earth.  Eventually Io made it to Egypt, the Egyptians worshiped the snow-white heifer and named her the Egyptian goddess Isis.  Hera permitted Zeus to change Io back into her human form, under the condition that he never look at her again.  Io, the goddess-queen of Egypt, then bore Zeus' son as the next King.\n\nJudgment of Paris \n\nA prophecy stated that a son of the sea-nymph Thetis, with whom Zeus fell in love after gazing upon her in the oceans off the Greek coast, would become greater than his father.Scholiast on Homer’s Iliad; Hyginus, Fabulae 54; Ovid, Metamorphoses 11.217. Possibly for this reasons,Apollodorus, [http://www.perseus.tufts.edu/hopper/text?docApollod.+1.1.1&redirect\ntrue Library] 3.168. Thetis was betrothed to an elderly human king, Peleus son of Aeacus, either upon Zeus' orders,Pindar, Nemean 5 ep2; Pindar, Isthmian 8 str3–str5. or because she wished to please Hera, who had raised her.Hesiod, Catalogue of Women fr. 57; Cypria fr. 4. All the gods and goddesses as well as various mortals were invited to the marriage of Peleus and Thetis (the eventual parents of Achilles) and brought many gifts.Photius, Myrobiblion 190. Only Eris, goddess of discord, was not invited and was stopped at the door by Hermes, on Zeus' order. She was annoyed at this, so she threw from the door a gift of her own:Hyginus, Fabulae 92. a golden apple inscribed with the word καλλίστῃ (kallistēi, \"To the fairest\").Apollodorus Epitome E.3.2 Aphrodite, Hera, and Athena all claimed to be the fairest, and thus the rightful owner of the apple.\n\nThe goddesses quarreled bitterly over it, and none of the other gods would venture an opinion favoring one, for fear of earning the enmity of the other two. They chose to place the matter before Zeus, who, not wanting to favor one of the goddesses, put the choice into the hands of Paris, a Trojan prince. After bathing in the spring of Mount Ida where Troy was situated, they appeared before Paris to have him choose. The goddesses undressed before him, either at his request or for the sake of winning. Still, Paris could not decide, as all three were ideally beautiful, so they resorted to bribes. Hera offered Paris political power and control of all of Asia, while Athena offered wisdom, fame, and glory in battle, and Aphrodite offered the most beautiful mortal woman in the world as a wife, and he accordingly chose her. This woman was Helen, who was, unfortunately for Paris, already married to King Menelaus of Sparta. The other two goddesses were enraged by this and through Helen's abduction by Paris they brought about the Trojan War.\n\nThe Iliad \n\nHera plays a substantial role in The Iliad, appearing in a number of books throughout the epic poem. In accordance with ancient Greek mythology, Hera's hatred towards the Trojans, which was started by Paris' decision that Aphrodite was the most beautiful goddess, is seen as through her support of the Greeks during the war. Throughout the epic Hera makes many attempts to thwart the Trojan army. In books 1 and 2, Hera declares that the Trojans must be destroyed. Hera persuades Athena to aid the Achaeans in battle and she agrees to assist with interfering on their behalf.\n\nIn book 5, Hera and Athena plot to harm Ares, who had been seen by Diomedes in assisting the Trojans. Diomedes called for his soldiers to fall back slowly. Hera, Ares' mother, saw Ares' interference and asked Zeus, Ares' father, for permission to drive Ares away from the battlefield. Hera encouraged Diomedes to attack Ares and he threw his spear at the god. Athena drove the spear into Ares' body, and he bellowed in pain and fled to Mt. Olympus, forcing the Trojans to fall back.\n\nIn book 8, Hera tries to persuade Poseidon to disobey Zeus and help the Achaean army. He refuses, saying he doesn’t want to go against Zeus. Determined to intervene in the war, Hera and Athena head to the battlefield. However, seeing the two flee, Zeus sent Iris to intercept them and make them return to Mt. Olympus or face grave consequences. After prolonged fighting, Hera sees Poseidon aiding the Greeks and giving them motivation to keep fighting.\n\nIn book 14 Hera devises a plan to deceive Zeus. Zeus set a decree that the gods were not allowed to interfere in the mortal war. Hera is on the side of the Achaeans, so she plans a Deception of Zeus where she seduces him, with help from Aphrodite, and tricks him into a deep sleep, with the help of Hypnos, so that the Gods could interfere without the fear of Zeus.Homer. Iliad, Book 14, Lines 153-353.\n\nIn book 21, Hera continues her interference with the battle as she tells Hephaestus to prevent the river from harming Achilles.  Hephaestus sets the battlefield ablaze, causing the river to plead with Hera, promising her he will not help the Trojans if Hephaestus stops his attack. Hephaestus stops his assault and Hera returns to the battlefield where the gods begin to fight amongst themselves.\n\nSmaller stories involving Hera \n\nEcho\n* According to the urbane retelling of myth in Ovid's Metamorphoses,Metamorphoses, iii.341-401. for a long time, a nymph named Echo had the job of distracting Hera from Zeus' affairs by leading her away and flattering her.  When Hera discovered the deception, she cursed Echo to only repeat the words of others (hence our modern word \"echo\").\nSemele and Dionysus\n* When Hera learned that Semele, daughter of Cadmus King of Thebes, was pregnant by Zeus, she disguised herself as Semele's nurse and persuaded the princess to insist that Zeus show himself to her in his true form. When he was compelled to do so, having sworn by Styx Hamilton, Edith (1969).  \"Mythology\".  his thunder and lightning destroyed Semele. Zeus took Semele's unborn child, Dionysus and completed its gestation sewn into his own thigh.\n* In another version, Dionysus was originally the son of Zeus by either Demeter or Persephone. Hera sent her Titans to rip the baby apart, from which he was called Zagreus (\"Torn in Pieces\"). Zeus rescued the heart; or, the heart was saved, variously, by Athena, Rhea, or Demeter.Seyffert Dictionary Zeus used the heart to recreate Dionysus and implant him in the womb of Semele—hence Dionysus became known as \"the twice-born\". Certain versions imply that Zeus gave Semele the heart to eat to impregnate her. Hera tricked Semele into asking Zeus to reveal his true form, which killed her. Dionysus later managed to rescue his mother from the underworld and have her live on Mount Olympus.\n* See also Dionysus' birth for other variations.\nLamia\n* Lamia was a queen of Libya, whom Zeus loved. Hera turned her into a monster and murdered their children. Or, alternatively, she killed Lamia's children and the grief turned her into a monster. Lamia was cursed with the inability to close her eyes so that she would always obsess over the image of her dead children. Zeus gave her the gift to be able to take her eyes out to rest, and then put them back in. Lamia was envious of other mothers and ate their children.\nGerana\n* Gerana was a queen of the Pygmies who boasted she was more beautiful than Hera. The wrathful goddess turned her into a crane and proclaimed that her bird descendants should wage eternal war on the Pygmy folk.Ovid, Metamorphoses 6.89 - 91\n\nCydippe\n* Cydippe, a priestess of Hera, was on her way to a festival in the goddess' honor.  The oxen which were to pull her cart were overdue and her sons, Biton and Cleobis, pulled the cart the entire way (45 stadia, 8 kilometers).  Cydippe was impressed with their devotion to her and Hera so asked Hera to give her children the best gift a god could give a person.  Hera ordained that the brothers would die in their sleep.\n* This honor bestowed upon the children was later used by Solon, as a proof while trying to convince Croesus  that it is impossible to judge a person's happiness until they have died a fruitful death after a joyous life.Herodotus' History, Book I\nTiresias\n* Tiresias was a priest of Zeus, and as a young man he encountered two snakes mating and hit them with a stick. He was then transformed into a woman. As a woman, Tiresias became a priestess of Hera, married and had children, including Manto. After seven years as a woman, Tiresias again found mating snakes; depending on the myth, either she made sure to leave the snakes alone this time, or, according to Hyginus, trampled on them and became a man once more.Hygini, Fabulae, LXXV\n* As a result of his experiences, Zeus and Hera asked him to settle the question of which sex, male or female, experienced more pleasure during intercourse. Zeus claimed it was women; Hera claimed it was men. When Tiresias sided with Zeus, Hera struck him blind.\n* Since Zeus could not undo what she had done, he gave him the gift of prophecy. An alternative and less commonly told story has it that Tiresias was blinded by Athena after he stumbled onto her bathing naked. His mother, Chariclo, begged her to undo her curse, but Athena could not; she gave him prophecy instead.\nChelone\n* At the marriage of Zeus and Hera, a nymph named Chelone was disrespectful or refused to attend. Zeus thus, turned her into a tortoise.\nThe Golden Fleece\n* Hera hated Pelias because he had killed Sidero, his step-grandmother, in one of the goddess's temples.  She later convinced Jason and Medea to kill Pelias. The Golden Fleece was the item that Jason needed to get his mother freed.\nThe Metamorphoses\n* In Thrace, Hera and Zeus turned King Haemus and Queen Rhodope into mountains,Ovid, Metamorphoses  6.87 the Balkan (Haemus Mons) and Rhodope Mountains respectively, for their hubris in comparing themselves to the gods.\nIxion\n* When Zeus had pity on Ixion and brought him to Olympus and introduced him to the gods, instead of being grateful, Ixion grew lustful for Hera. Zeus found out about his intentions and made a cloud in the shape of Hera, who was later named Nephele, and tricked Ixion into coupling with it and from their union came Centaurus. So Ixion was expelled from Olympus and Zeus ordered Hermes to bind Ixion to a winged fiery wheel that was always spinning. Therefore, Ixion was bound to a burning solar wheel for all eternity, at first spinning across the heavens, but in later myth transferred to Tartarus.Kerenyi 1951, p.160\n\nGenealogy\n\nArt and events\n\n* Barberini Hera - a Roman sculpture of Hera/Juno\n* Hera Borghese - sculpture related to Hera\n* Hera Farnese - sculpture of Hera's head\n* Heraea Games - games dedicated to Hera—the first sanctioned (and recorded) women's athletic competition to be held in the stadium at Olympia.\n\nNotes. Hera. http://en.wikipedia.org/?curid=13208."
  }
}
