{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8078",
  "eid" : "e54985d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778464429,
  "textBody" : "Dynamite is an explosive made of nitroglycerin, sorbents (such as powdered shells or clay) and stabilizers. It was invented by the Swedish chemist and engineer Alfred Nobel in Geesthacht, and patented in 1867. It rapidly gained wide-scale use as a safer alternative to black powder. \n\nToday dynamite is mainly used in the mining, quarrying, construction, and demolition industries. Dynamite is still the product of choice for trenching applications, and as a cost-effective alternative to cast boosters. Dynamite is occasionally used as an initiator or booster for AN and ANFO explosive charges.\n\nHistory\n\nDynamite was invented by Swede Alfred Nobel in the 1860s and was the first safely manageable explosive stronger than black powder, which had been invented in China in the 9th century. Black powder is now popularly known as gunpowder, because while it is effective as a propellant, it is less suitable for shattering rock or fortifications. \n\nAlfred Nobel's father, Immanuel Nobel, was an industrialist, engineer, and inventor. He built bridges and buildings in Stockholm and founded Sweden's first rubber factory. His construction work inspired him to research new methods of blasting rock that were more effective than black powder. After some bad business deals in Sweden, in 1838 Immanuel moved his family to Saint Petersburg, where Alfred and his brothers were educated privately under Swedish and Russian tutors. At age 17, Alfred was sent abroad for two years; in the United States he met Swedish engineer John Ericsson and in France studied under famed chemist Théophile-Jules Pelouze, who had first synthesized nitroglycerin in 1847 with his Italian pupil Ascanio Sobrero. It was in France that Nobel first encountered nitroglycerin, which Pelouze cautioned against using as a commercial explosive because of its high volatility. \n\nIn 1857, Nobel filed the first of several hundred patents, mostly concerning air pressure, gas and fluid gauges, but remained fascinated with nitroglycerin's potential as an explosive. Nobel, along with his father and brother Emil, experimented with various combinations of nitroglycerin and black powder. Nobel came up with a solution of how to safely detonate nitroglycerin by inventing the detonator, or blasting cap, that allowed a controlled explosion set off from a distance using a fuse. In the summer of 1863, Nobel performed his first successful detonation of pure nitroglycerin, using a blasting cap made of a copper percussion cap and mercury fulminate. In 1864, Alfred Nobel filed patents for both the blasting cap and his method of synthesizing nitroglycerin, which is composed of sulfuric acid, nitric acid and glycerin. On 3 September 1864, while experimenting with nitroglycerin, Emil and several others were killed in an explosion at the factory at Immanuel Nobel's estate at Heleneborg. After this, Alfred founded the company Nitroglycerin Aktiebolaget AB in Vinterviken to continue work in a more isolated area and the following year moved to Germany, where he founded another company, Dynamit Nobel. \n\nDespite the invention of the blasting cap, the volatility of nitroglycerin rendered it useless as a commercial explosive. To solve this problem, Nobel sought to combine it with another substance that would make it safe for transport and handling but yet would not reduce its effectiveness as an explosive. He tried combinations of cement, coal, and sawdust, but was unsuccessful. Finally, he tried diatomaceous earth, fossilized algae, that he brought from the Elbe River near his factory in Hamburg, which successfully stabilized the nitroglycerin into a portable explosive. \n\nNobel obtained patents for his inventions in England on 7 May 1867 and in Sweden on 19 October 1867.Schück & Sohlman (1929), p. 101. After its introduction, dynamite rapidly gained wide-scale use as a safe alternative to black powder and nitroglycerin. Nobel tightly controlled the patents, and unlicensed duplicating companies were quickly shut down. However, a few American businessmen got around the patent by using a slightly different formula.US Patent 234489 issued to Morse 16 November 1880\n\nNobel originally sold dynamite as \"Nobel's Blasting Powder\" but decided to change the name to dynamite, from the Ancient Greek word dýnamis (), meaning \"power\".\"dynamite.\" The American Heritage® Dictionary of the English Language, Fourth Edition. 2003. Houghton Mifflin Company 19 March 2013 http://www.thefreedictionary.com/dynamite\"dynamite.\" Collins English Dictionary – Complete and Unabridged. 1991, 1994, 1998, 2000, 2003. HarperCollins Publishers 19 March 2013 http://www.thefreedictionary.com/dynamite\n\nManufacture\n\nComposition\n\nNitroglycerin by itself is a very strong explosive, but is extremely shock-sensitive (that is, physical shock can cause it to explode), and degrades over time to even more unstable forms, which makes it highly dangerous to transport or use. Dynamite combines nitroglycerin with absorbents and stabilizers, rendering it safe to use while retaining its powerful explosive properties.\n\nNobel's original composition of dynamite consisted of three parts \"explosive oil\" (as nitroglycerin was called), one part diatomaceous earth as the absorbent, and a small admixture of sodium carbonate antacid as the stabilizer. Ethylene glycol dinitrate was later added to the nitroglycerin to lower its freezing point and keep it from freezing into a slush at low temperatures, which made it unstable, or from sweating out when it thawed. Diatomaceous earth is not usually used today as an absorbent medium and it has been replaced by cheaper media such as sawdust, wood pulp, flour, or starch. Other stabilizers, such as calcium carbonate or zinc oxide, can be used in the place of sodium carbonate. Sodium nitrate is added to the medium as an oxidizer to improve the dynamite's brisance.\n\nForm\n\nDynamite is usually sold in the form of cardboard cylinders about 8 in long and about  in diameter, with a weight of about . A stick of dynamite thus produced contains roughly 1 MJ (megajoule) of energy. Other sizes also exist, rated by either portion (Quarter-Stick or Half-Stick) or by weight.\n\nDynamite is usually rated by \"weight strength\" (the amount of nitroglycerin it contains), usually from 20% to 60%. For example, 40% dynamite is composed of 40% nitroglycerin and 60% \"dope\" (the absorbent storage medium mixed with the stabilizer and any additives).\n\nStorage considerations\n\nThe maximum shelf life of nitroglycerin-based dynamite is recommended as one year from the date of manufacture under good storage conditions.\n\nOver time, regardless of the sorbent used, sticks of dynamite will \"weep\" or \"sweat\" nitroglycerin, which can then pool in the bottom of the box or storage area. For that reason, explosive manuals recommend the repeated turning over of boxes of dynamite in storage. Crystals will form on the outside of the sticks causing them to be even more shock, friction, and temperature sensitive. This creates a very dangerous situation. While the risk of an explosion without the use of a blasting cap is minimal for fresh dynamite, old dynamite is dangerous. Modern packaging helps eliminate this by placing the dynamite into sealed plastic bags, and using wax coated cardboard.\n\nDynamite is moderately sensitive to shock. Shock resistance tests are usually carried out with a drop-hammer: about 100 mg of explosive is placed on an anvil, upon which a weight of between 0.5 and 10 kg is dropped from different heights until detonation is achieved.Carlos López Jimeno, Emilio López Jimeno, Francisco Javier Ayala-Carcedo, Drilling and Blasting of Rocks, translated by Yvonne Visser de Ramiro from Manual de perforación y voladura de rocas (1987), Geomining Technological Institute of Spain (Instituto Tecnológico Geominero de Espan~a), Taylor & Francis, London and New York, 1995,  With a hammer of 2 kg, mercury fulminate detonates with a drop distance of 1 to 2 cm, nitroglycerin with 4 to 5 cm, dynamite with 15 to 30 cm, and ammoniacal explosives with 40 to 50 cm.\n\nMajor manufacturers\n\nSouth Africa\n\nFor several decades beginning in the 1940s, the largest producer of dynamite in the world was the Union of South Africa. There the De Beers company established a factory in 1902 at Somerset West. The explosives factory was later operated by AECI (African Explosives and Chemical Industries). The demand for the product came mainly from the country's vast gold mines, centered on the Witwatersrand. The factory at Somerset West was in operation in 1903 and by 1907 it was already producing 340,000 cases, 50 lb each, annually. A rival factory at Modderfontein was producing another 200,000 cases per year.[http://www.caia.co.za/index.php?pg=18 AECI: South Africa - History of the Chemical Industry]\n\nThere were two large explosions at the Somerset West plant during the 1960s. Some workers died, but the loss of life was limited by the modular design of the factory and its earth works, and the planting of trees that directed the blasts upward. There were several other explosions at the Modderfontein factory. After 1985, pressure from trade unions forced AECI to phase out the production of dynamite. The factory then went on to produce ammonium nitrate emulsion-based explosives that are safer to manufacture and handle.\n\nUnited States\n\nDynamite was manufactured by the E. I. du Pont de Nemours Company until the mid-1970s. Other American dynamite makers of that time period included the Hercules Corporation, Atlas, Trojan US Powder, Austin, and several other smaller firms.\n\nCurrently only Dyno Nobel manufactures dynamite in the US. The only facility producing it is located in Carthage, Missouri, but the material is purchased from Dyno Nobel by other manufacturers, who put their label on the dynamite and boxes.\n\nNon-dynamite explosives\n\nOther explosives are often referred to or confused with dynamite:\n\nTNT\n\nThough both TNT and dynamite are high explosives, there is little similarity between them. Dynamite is a stabilized form of nitroglycerin while TNT is the chemical compound trinitrotoluene.  The energy density (measured in units of joules per kilogram, symbol J/kg) of dynamite is about one third higher than that of TNT: 5.0 MJ/kg for dynamite vs 3.6 MJ/kg for TNT.J. Köhler, R. Meyer, A. Homburg: Explosivstoffe. Zehnte, vollständig überarbeitete Auflage. Wiley-VCH Verlag GmbH & Co. KGaA, Weinheim 2008, .\n\n\"Extra\" dynamite\n\nIn the United States, in 1885, the chemist Russell S. Penniman invented \"ammonium dynamite\", a form of explosive that used ammonium nitrate as a substitute for the more costly nitroglycerin. Ammonium nitrate has only 85% of the chemical energy of nitroglycerin.\n\nIt is rated by either \"weight strength\" (the amount of ammonium nitrate in the medium) or \"cartridge strength\" (the potential explosive strength generated by an amount of explosive of a certain density and grain size used in comparison to the explosive strength generated by an equivalent density and grain size of a standard explosive). For example, high-explosive 65% Extra Dynamite has a weight strength of 65% ammonium nitrate and 35% \"dope\" (the absorbent medium mixed with the stabilizers and additives). Its \"cartridge strength\" would be its weight in pounds times its strength in relation to an equal amount of ANFO (the civilian baseline standard) or TNT (the military baseline standard). For example, 65% ammonium dynamite with a 20% cartridge strength would mean the stick was equal to an equivalent weight strength of 20% ANFO.\n\n\"Military dynamite\"\n\n\"Military dynamite\" is a dynamite substitute, formulated without nitroglycerin. It contains 75% RDX, 15% TNT, 5% SAE 10 motor oil, and 5% cornstarch, but is much safer to store and handle for long periods than Nobel's dynamite.  Military dynamite substitutes much more stable chemicals for nitroglycerin.\n\nRegulation\n\nVarious countries around the world have enacted explosives laws and require licenses to manufacture, distribute, store, use, and possess explosives or ingredients.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dynamite" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8078" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dynamite is an explosive made of nitroglycerin, sorbents (such as powdered shells or clay) and stabilizers. It was invented by the Swedish chemist and engineer Alfred Nobel in Geesthacht, and patented in 1867. It rapidly gained wide-scale use as a safer alternative to black powder. \n\nToday dynamite is mainly used in the mining, quarrying, construction, and demolition industries. Dynamite is still the product of choice for trenching applications, and as a cost-effective alternative to cast boosters. Dynamite is occasionally used as an initiator or booster for AN and ANFO explosive charges.\n\nHistory\n\nDynamite was invented by Swede Alfred Nobel in the 1860s and was the first safely manageable explosive stronger than black powder, which had been invented in China in the 9th century. Black powder is now popularly known as gunpowder, because while it is effective as a propellant, it is less suitable for shattering rock or fortifications. \n\nAlfred Nobel's father, Immanuel Nobel, was an industrialist, engineer, and inventor. He built bridges and buildings in Stockholm and founded Sweden's first rubber factory. His construction work inspired him to research new methods of blasting rock that were more effective than black powder. After some bad business deals in Sweden, in 1838 Immanuel moved his family to Saint Petersburg, where Alfred and his brothers were educated privately under Swedish and Russian tutors. At age 17, Alfred was sent abroad for two years; in the United States he met Swedish engineer John Ericsson and in France studied under famed chemist Théophile-Jules Pelouze, who had first synthesized nitroglycerin in 1847 with his Italian pupil Ascanio Sobrero. It was in France that Nobel first encountered nitroglycerin, which Pelouze cautioned against using as a commercial explosive because of its high volatility. \n\nIn 1857, Nobel filed the first of several hundred patents, mostly concerning air pressure, gas and fluid gauges, but remained fascinated with nitroglycerin's potential as an explosive. Nobel, along with his father and brother Emil, experimented with various combinations of nitroglycerin and black powder. Nobel came up with a solution of how to safely detonate nitroglycerin by inventing the detonator, or blasting cap, that allowed a controlled explosion set off from a distance using a fuse. In the summer of 1863, Nobel performed his first successful detonation of pure nitroglycerin, using a blasting cap made of a copper percussion cap and mercury fulminate. In 1864, Alfred Nobel filed patents for both the blasting cap and his method of synthesizing nitroglycerin, which is composed of sulfuric acid, nitric acid and glycerin. On 3 September 1864, while experimenting with nitroglycerin, Emil and several others were killed in an explosion at the factory at Immanuel Nobel's estate at Heleneborg. After this, Alfred founded the company Nitroglycerin Aktiebolaget AB in Vinterviken to continue work in a more isolated area and the following year moved to Germany, where he founded another company, Dynamit Nobel. \n\nDespite the invention of the blasting cap, the volatility of nitroglycerin rendered it useless as a commercial explosive. To solve this problem, Nobel sought to combine it with another substance that would make it safe for transport and handling but yet would not reduce its effectiveness as an explosive. He tried combinations of cement, coal, and sawdust, but was unsuccessful. Finally, he tried diatomaceous earth, fossilized algae, that he brought from the Elbe River near his factory in Hamburg, which successfully stabilized the nitroglycerin into a portable explosive. \n\nNobel obtained patents for his inventions in England on 7 May 1867 and in Sweden on 19 October 1867.Schück & Sohlman (1929), p. 101. After its introduction, dynamite rapidly gained wide-scale use as a safe alternative to black powder and nitroglycerin. Nobel tightly controlled the patents, and unlicensed duplicating companies were quickly shut down. However, a few American businessmen got around the patent by using a slightly different formula.US Patent 234489 issued to Morse 16 November 1880\n\nNobel originally sold dynamite as \"Nobel's Blasting Powder\" but decided to change the name to dynamite, from the Ancient Greek word dýnamis (), meaning \"power\".\"dynamite.\" The American Heritage® Dictionary of the English Language, Fourth Edition. 2003. Houghton Mifflin Company 19 March 2013 http://www.thefreedictionary.com/dynamite\"dynamite.\" Collins English Dictionary – Complete and Unabridged. 1991, 1994, 1998, 2000, 2003. HarperCollins Publishers 19 March 2013 http://www.thefreedictionary.com/dynamite\n\nManufacture\n\nComposition\n\nNitroglycerin by itself is a very strong explosive, but is extremely shock-sensitive (that is, physical shock can cause it to explode), and degrades over time to even more unstable forms, which makes it highly dangerous to transport or use. Dynamite combines nitroglycerin with absorbents and stabilizers, rendering it safe to use while retaining its powerful explosive properties.\n\nNobel's original composition of dynamite consisted of three parts \"explosive oil\" (as nitroglycerin was called), one part diatomaceous earth as the absorbent, and a small admixture of sodium carbonate antacid as the stabilizer. Ethylene glycol dinitrate was later added to the nitroglycerin to lower its freezing point and keep it from freezing into a slush at low temperatures, which made it unstable, or from sweating out when it thawed. Diatomaceous earth is not usually used today as an absorbent medium and it has been replaced by cheaper media such as sawdust, wood pulp, flour, or starch. Other stabilizers, such as calcium carbonate or zinc oxide, can be used in the place of sodium carbonate. Sodium nitrate is added to the medium as an oxidizer to improve the dynamite's brisance.\n\nForm\n\nDynamite is usually sold in the form of cardboard cylinders about 8 in long and about  in diameter, with a weight of about . A stick of dynamite thus produced contains roughly 1 MJ (megajoule) of energy. Other sizes also exist, rated by either portion (Quarter-Stick or Half-Stick) or by weight.\n\nDynamite is usually rated by \"weight strength\" (the amount of nitroglycerin it contains), usually from 20% to 60%. For example, 40% dynamite is composed of 40% nitroglycerin and 60% \"dope\" (the absorbent storage medium mixed with the stabilizer and any additives).\n\nStorage considerations\n\nThe maximum shelf life of nitroglycerin-based dynamite is recommended as one year from the date of manufacture under good storage conditions.\n\nOver time, regardless of the sorbent used, sticks of dynamite will \"weep\" or \"sweat\" nitroglycerin, which can then pool in the bottom of the box or storage area. For that reason, explosive manuals recommend the repeated turning over of boxes of dynamite in storage. Crystals will form on the outside of the sticks causing them to be even more shock, friction, and temperature sensitive. This creates a very dangerous situation. While the risk of an explosion without the use of a blasting cap is minimal for fresh dynamite, old dynamite is dangerous. Modern packaging helps eliminate this by placing the dynamite into sealed plastic bags, and using wax coated cardboard.\n\nDynamite is moderately sensitive to shock. Shock resistance tests are usually carried out with a drop-hammer: about 100 mg of explosive is placed on an anvil, upon which a weight of between 0.5 and 10 kg is dropped from different heights until detonation is achieved.Carlos López Jimeno, Emilio López Jimeno, Francisco Javier Ayala-Carcedo, Drilling and Blasting of Rocks, translated by Yvonne Visser de Ramiro from Manual de perforación y voladura de rocas (1987), Geomining Technological Institute of Spain (Instituto Tecnológico Geominero de Espan~a), Taylor & Francis, London and New York, 1995,  With a hammer of 2 kg, mercury fulminate detonates with a drop distance of 1 to 2 cm, nitroglycerin with 4 to 5 cm, dynamite with 15 to 30 cm, and ammoniacal explosives with 40 to 50 cm.\n\nMajor manufacturers\n\nSouth Africa\n\nFor several decades beginning in the 1940s, the largest producer of dynamite in the world was the Union of South Africa. There the De Beers company established a factory in 1902 at Somerset West. The explosives factory was later operated by AECI (African Explosives and Chemical Industries). The demand for the product came mainly from the country's vast gold mines, centered on the Witwatersrand. The factory at Somerset West was in operation in 1903 and by 1907 it was already producing 340,000 cases, 50 lb each, annually. A rival factory at Modderfontein was producing another 200,000 cases per year.[http://www.caia.co.za/index.php?pg=18 AECI: South Africa - History of the Chemical Industry]\n\nThere were two large explosions at the Somerset West plant during the 1960s. Some workers died, but the loss of life was limited by the modular design of the factory and its earth works, and the planting of trees that directed the blasts upward. There were several other explosions at the Modderfontein factory. After 1985, pressure from trade unions forced AECI to phase out the production of dynamite. The factory then went on to produce ammonium nitrate emulsion-based explosives that are safer to manufacture and handle.\n\nUnited States\n\nDynamite was manufactured by the E. I. du Pont de Nemours Company until the mid-1970s. Other American dynamite makers of that time period included the Hercules Corporation, Atlas, Trojan US Powder, Austin, and several other smaller firms.\n\nCurrently only Dyno Nobel manufactures dynamite in the US. The only facility producing it is located in Carthage, Missouri, but the material is purchased from Dyno Nobel by other manufacturers, who put their label on the dynamite and boxes.\n\nNon-dynamite explosives\n\nOther explosives are often referred to or confused with dynamite:\n\nTNT\n\nThough both TNT and dynamite are high explosives, there is little similarity between them. Dynamite is a stabilized form of nitroglycerin while TNT is the chemical compound trinitrotoluene.  The energy density (measured in units of joules per kilogram, symbol J/kg) of dynamite is about one third higher than that of TNT: 5.0 MJ/kg for dynamite vs 3.6 MJ/kg for TNT.J. Köhler, R. Meyer, A. Homburg: Explosivstoffe. Zehnte, vollständig überarbeitete Auflage. Wiley-VCH Verlag GmbH & Co. KGaA, Weinheim 2008, .\n\n\"Extra\" dynamite\n\nIn the United States, in 1885, the chemist Russell S. Penniman invented \"ammonium dynamite\", a form of explosive that used ammonium nitrate as a substitute for the more costly nitroglycerin. Ammonium nitrate has only 85% of the chemical energy of nitroglycerin.\n\nIt is rated by either \"weight strength\" (the amount of ammonium nitrate in the medium) or \"cartridge strength\" (the potential explosive strength generated by an amount of explosive of a certain density and grain size used in comparison to the explosive strength generated by an equivalent density and grain size of a standard explosive). For example, high-explosive 65% Extra Dynamite has a weight strength of 65% ammonium nitrate and 35% \"dope\" (the absorbent medium mixed with the stabilizers and additives). Its \"cartridge strength\" would be its weight in pounds times its strength in relation to an equal amount of ANFO (the civilian baseline standard) or TNT (the military baseline standard). For example, 65% ammonium dynamite with a 20% cartridge strength would mean the stick was equal to an equivalent weight strength of 20% ANFO.\n\n\"Military dynamite\"\n\n\"Military dynamite\" is a dynamite substitute, formulated without nitroglycerin. It contains 75% RDX, 15% TNT, 5% SAE 10 motor oil, and 5% cornstarch, but is much safer to store and handle for long periods than Nobel's dynamite.  Military dynamite substitutes much more stable chemicals for nitroglycerin.\n\nRegulation\n\nVarious countries around the world have enacted explosives laws and require licenses to manufacture, distribute, store, use, and possess explosives or ingredients. Dynamite. http://en.wikipedia.org/?curid=8078."
  }
}
