{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13666",
  "eid" : "0c27c770-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778529639,
  "textBody" : "In Norse mythology, Hel is a being who presides over a realm of the same name, where she receives a portion of the dead. Hel is attested in the Poetic Edda, compiled in the 13th century from earlier traditional sources, and the Prose Edda, written in the 13th century by Snorri Sturluson. In addition, she is mentioned in poems recorded in Heimskringla and Egils saga that date from the 9th and 10th centuries, respectively. An episode in the Latin work Gesta Danorum, written in the 12th century by Saxo Grammaticus, is generally considered to refer to Hel, and Hel may appear on various Migration Period bracteates.\n\nIn the Poetic Edda, Prose Edda, and Heimskringla, Hel is referred to as a daughter of Loki, and to \"go to Hel\" is to die. In the Prose Edda book Gylfaginning, Hel is described as having been appointed by the god Odin as ruler of a realm of the same name, located in Niflheim. In the same source, her appearance is described as half blue and half Caucasoid-flesh-coloured, and further as having a gloomy, downcast appearance. The Prose Edda details that Hel rules over vast mansions with many servants in her underworld realm and plays a key role in the attempted resurrection of the god Baldr.\n\nScholarly theories have been proposed about Hel's potential connections to figures appearing in the 11th century Old English Gospel of Nicodemus and Old Norse Bartholomeus saga postola, that she may have been considered a goddess with potential Indo-European parallels in Bhavani, Kali, and Mahakali or that Hel may have become a being only as a late personification of the location of the same name.\n\nEtymology\n\nThe Old Norse feminine proper noun Hel is identical to the name of the location over which she rules, Old Norse Hel. The word has cognates in all branches of the Germanic languages, including Old English hell (and thus Modern English hell), Old Frisian helle, Old Saxon hellia, Old High German hella, and Gothic halja. All forms ultimately derive from the reconstructed Proto-Germanic feminine noun *xaljō or *haljō ('concealed place, the underworld'). In turn, the Proto-Germanic form derives from the o-grade form of the Proto-Indo-European root *kel-, *kol-: 'to cover, conceal, save'.For discussion and analysis, see Orel (2003:156) and Watkins (2000:38).\n\nThe term is etymologically related to Modern English hall and therefore also Valhalla, an afterlife 'hall of the slain' in Norse Mythology. Hall and its numerous Germanic cognates derive from Proto-Germanic *hallō 'covered place, hall', from Proto-Indo-European *kol-.This is highlighted in Watkins (2000:38).\n\nRelated early Germanic terms and concepts include Proto-Germanic *xalja-rūnō(n), a feminine compound noun, and *xalja-wītjan, a neutral compound noun. This form is reconstructed from the Latinized Gothic plural noun *haliurunnae (attested by Jordanes; according to philologist Vladimir Orel, meaning 'witches'), Old English helle-rúne ('sorceress, necromancer', according to Orel), and Old High German helli-rūna 'magic'. The compound is composed of two elements: *xaljō (*haljō) and *rūnō, the Proto-Germanic precursor to Modern English rune.See discussion at Orel (2003:155-156 & 310). The second element in the Gothic haliurunnae may however instead be an agent noun from the verb rinnan (\"to run, go\"), which would make its literal meaning \"one who travels to the netherworld\".Scardigli, Piergiuseppe, Die Goten: Sprache und Kultur (1973) pp. 70-71.Lehmann, Winfred, A Gothic Etymological Dictionary (1986))\n\nProto-Germanic *xalja-wītjan (or *halja-wītjan) is reconstructed from Old Norse hel-víti 'hell', Old English helle-wíte 'hell-torment, hell', Old Saxon helli-wīti 'hell', and the Middle High German feminine noun helle-wīze. The compound is a compound of *xaljō (discussed above) and *wītjan (reconstructed from forms such as Old English witt 'right mind, wits', Old Saxon gewit 'understanding', and Gothic un-witi 'foolishness, understanding').Orel (2003:156 & 464).\n\nAttestations\n\nPoetic Edda\n\nThe Poetic Edda, compiled in the 13th century from earlier traditional sources, features various poems that mention Hel. In the Poetic Edda poem Völuspá, Hel's realm is referred to as the \"Halls of Hel.\"Larrington (1999:9). In stanza 31 of Grímnismál, Hel is listed as living beneath one of three roots growing from the world tree Yggdrasil.Larrington (1999:56). In Fáfnismál, the hero Sigurd stands before the mortally wounded body of the dragon Fáfnir, and states that Fáfnir lies in pieces, where \"Hel can take\" him.Larrington (1999:61). In Atlamál, the phrases \"Hel has half of us\" and \"sent off to Hel\" are used in reference to death, though it could be a reference to the location and not the being, if not both.Larrington (1999:225 and 232). In stanza 4 of Baldrs draumar, Odin rides towards the \"high hall of Hel.\"Larrington (1999:243).\n\nHel may also be alluded to in Hamðismál. Death is periphrased as \"joy of the troll-woman\" (or \"ogress\") and ostensibly it is Hel being referred to as the troll-woman or the ogre (flagð), although it may otherwise be some unspecified dís.Larrington (1999:240 and notes).Dronke (1969:164). The Poetic Edda also mentions that travelers to Hel must pass by her guardian hound Garmr.\n\nProse Edda\n\nHel is referred to in the Prose Edda, written in the 13th century by Snorri Sturluson. In chapter 34 of the book Gylfaginning, Hel is listed by High as one of the three children of Loki and Angrboða: the wolf Fenrir, the serpent Jörmungandr, and Hel. High continues that, once the gods found that these three children are being brought up in the land of Jötunheimr, and when the gods \"traced prophecies that from these siblings great mischief and disaster would arise for them\" then the gods expected a lot of trouble from the three children, partially due to the nature of the mother of the children, yet worse so due to the nature of their father.Faulkes (1995:26–27).\n\nHigh says that Odin sent the gods to gather the children and bring them to him. Upon their arrival, Odin threw Jörmungandr into \"that deep sea that lies round all lands,\" Odin threw Hel into Niflheim, and bestowed upon her authority over nine worlds, in that she must \"administer board and lodging to those sent to her, and that is those who die of sickness or old age.\" High details that in this realm Hel has \"great Mansions\" with extremely high walls and immense gates, a hall called Éljúðnir, a dish called \"Hunger,\" a knife called \"Famine,\" the servant Ganglati (Old Norse \"lazy walker\"Orchard (1997:79).), the serving-maid Ganglöt (also \"lazy walker\"), the entrance threshold \"Stumbling-block,\" the bed \"Sick-bed,\" and the curtains \"Gleaming-bale.\" High describes Hel as \"half black and half flesh-coloured,\" adding that this makes her easily recognizable, and furthermore that Hel is \"rather downcast and fierce-looking.\"Faulkes (1995:27).\n\nIn chapter 49, High describes the events surrounding the death of the god Baldr. The goddess Frigg asks who among the Æsir will earn \"all her love and favour\" by riding to Hel, the location, to try to find Baldr, and offer Hel herself a ransom. The god Hermóðr volunteers and sets off upon the eight-legged horse Sleipnir to Hel. Hermóðr arrives in Hel's hall, finds his brother Baldr there, and stays the night. The next morning, Hermóðr begs Hel to allow Baldr to ride home with him, and tells her about the great weeping the Æsir have done upon Baldr's death.Faulkes (1995:49–50). Hel says the love people have for Baldr that Hermóðr has claimed must be tested, stating:\nIf all things in the world, alive or dead, weep for him, then he will be allowed to return to the Æsir. If anyone speaks against him or refuses to cry, then he will remain with Hel.Byock (2005:68).\n\nLater in the chapter, after the female jötunn Þökk refuses to weep for the dead Baldr, she responds in verse, ending with \"let Hel hold what she has.\"Byock (2005:69). In chapter 51, High describes the events of Ragnarök, and details that when Loki arrives at the field Vígríðr \"all of Hel's people\" will arrive with him.Faulkes (1995:54).\n\nIn chapter 5 of the Prose Edda book Skáldskaparmál, Hel is mentioned in a kenning for Baldr (\"Hel's companion\").Faulkes (1995:74). In chapter 16, \"Hel's [...] relative or father\" is given as a kenning for Loki.Faulkes (1995:76). In chapter 50, Hel is referenced (\"to join the company of the quite monstrous wolf's sister\") in the skaldic poem Ragnarsdrápa.Faulkes (1995:123).\n\nHeimskringla\n\nIn the Heimskringla book Ynglinga saga, written in the 13th century by Snorri Sturluson, Hel is referred to, though never by name. In chapter 17, the king Dyggvi dies of sickness. A poem from the 9th century Ynglingatal that forms the basis of Ynglinga saga is then quoted that describes Hel's taking of Dyggvi:\n\nI doubt not\nbut Dyggvi's corpse\nHel does hold\nto whore with him;\nfor Ulf's sib\na scion of kings\nby right should\ncaress in death:\nto love lured\nLoki's sister\nYngvi's heir\no'er all Sweden.Hollander (2007:20).\n\nIn chapter 45, a section from Ynglingatal is given which refers to Hel as \"howes'-warder\" (meaning \"guardian of the graves\") and as taking King Halfdan Hvitbeinn from life.Hollander (2007:46). In chapter 46, King Eystein Halfdansson dies by being knocked overboard by a sail yard. A section from Ynglingatal follows, describing that Eystein \"fared to\" Hel (referred to as \"Býleistr's-brother's-daughter\").Hollander (2007:47). In chapter 47, the deceased Eystein's son King Halfdan dies of an illness, and the excerpt provided in the chapter describes his fate thereafter, a portion of which references Hel:\n\nLoki's child\nfrom life summoned\nto her thing\nthe third liege-lord,\nwhen Halfdan\nof Holtar farm\nleft the life\nallotted to him.Hollander (2007:20–21).\n\nIn a stanza from Ynglingatal recorded in chapter 72 of the Heimskringla book Saga of Harald Sigurdsson, \"given to Hel\" is again used as a phrase to referring to death.Hollander (2007:638).\n\nEgils saga\n\nThe Icelanders' saga Egils saga contains the poem Sonatorrek. The saga attributes the poem to 10th century skald Egill Skallagrímsson, and writes that it was composed by Egill after the death of his son Gunnar. The final stanza of the poem contains a mention of Hel, though not by name:\n\nNow my course is tough:\nDeath, close sister\nof Odin's enemy\nstands on the ness:\nwith resolution\nand without remorse\nI will gladly\nawait my own.Scudder (2001:159).\n\nGesta Danorum\n\nIn the account of Baldr's death in Saxo Grammaticus' early 13th century work Gesta Danorum, the dying Baldr has a dream visitation from Proserpina (here translated as \"the goddess of death\"):\n\nThe following night the goddess of death appeared to him in a dream standing at his side, and declared that in three days time she would clasp him in her arms. It was no idle vision, for after three days the acute pain of his injury brought his end.Fisher (1999:I 75).\n\nScholars have assumed that Saxo used Proserpina as a goddess equivalent to the Norse Hel.Davidson (1999:II 356); Grimm (2004:314).\n\nArchaeological record\n\nIt has been suggested that several imitation medallions and bracteates of the Migration Period (ca. first centuries AD) feature depictions of Hel. In particular the bracteates IK 14 and IK 124 depict a rider traveling down a slope and coming upon a female being holding a scepter or a staff. The downward slope may indicate that the rider is traveling towards the realm of the dead and the woman with the scepter may be a female ruler of that realm, corresponding to Hel.Pesch (2002:67).\n\nSome B-class bracteates showing three godly figures have been interpreted as depicting Baldr's death, the best known of these is the Fakse bracteate. Two of the figures are understood to be Baldr and Odin while both Loki and Hel have been proposed as candidates for the third figure. If it is Hel she is presumably greeting the dying Baldr as he comes to her realm.Simek (2007:44); Pesch (2002:70); Bonnetain (2006:327).\n\nTheories\n\nSeo Hell\n\nThe Old English Gospel of Nicodemus, preserved in two manuscripts from the 11th century, contains a female figure referred to as Seo hell who engages in flyting with Satan and tells him to leave her dwelling (Old English ut of mynre onwununge). Regarding Seo Hell in the Old English Gospel of Nicodemus, Michael Bell states that \"her vivid personification in a dramatically excellent scene suggests that her gender is more than grammatical, and invites comparison with the Old Norse underworld goddess Hel and the Frau Holle of German folklore, to say nothing of underworld goddesses in other cultures\" yet adds that \"the possibility that these genders are merely grammatical is strengthened by the fact that an Old Norse version of Nicodemus, possibly translated under English influence, personifies Hell in the neutral (Old Norse þat helviti).\"Bell (1983:263).\n\nBartholomeus saga postola\n\nThe Old Norse Bartholomeus saga postola, an account of the life of Saint Bartholomew dating from the 13th century, mentions a \"Queen Hel.\" In the story, a devil is hiding within a pagan idol, and bound by Bartholomew's spiritual powers to acknowledge himself and confess,   (Old Norse heriaði a Hel drottning vara). \"Queen Hel\" is not mentioned elsewhere in the saga.Bell (1983:263–264).\n\nMichael Bell says that while Hel \"might at first appear to be identical with the well-known pagan goddess of the Norse underworld\" as described in chapter 34 of Gylfaginning, \"in the combined light of the Old English and Old Norse versions of Nicodemus she casts quite a different a shadow,\" and that in  Bartholomeus saga postola \"she is clearly the queen of the Christian, not pagan, underworld.\"Bell (1983:265).\n\nOrigins and development\n\nJacob Grimm theorized that Hel (whom he refers to here as Halja, the theorized Proto-Germanic form of the term) is essentially an \"image of a greedy, unrestoring, female deity\" and that \"the higher we are allowed to penetrate into our antiquities, the less hellish and more godlike may Halja appear. Of this we have a particularly strong guarantee in her affinity to the Indian Bhavani, who travels about and bathes like Nerthus and Holda, but is likewise called Kali or Mahakali, the great black goddess. In the underworld she is supposed to sit in judgment on souls. This office, the similar name and the black hue [...] make her exceedingly like Halja. And Halja is one of the oldest and commonest conceptions of our heathenism.\"Grimm (1882:315).\n\nGrimm theorizes that the Helhest, a three legged-horse that roams the countryside \"as a harbinger of plague and pestilence\" in Danish folklore, was originally the steed of the goddess Hel, and that on this steed Hel roamed the land \"picking up the dead that were her due.\" In addition, Grimm says that a wagon was once ascribed to Hel, with which Hel made journeys.Grimm (1882:314). Grimm says that Hel is an example of a \"half-goddess;\" \"one who cannot be shown to be either wife or daughter of a god, and who stands in a dependent relation to higher divinities\" and that \"half-goddesses\" stand higher than \"half-gods\" in Germanic mythology.Grimm (1882:397).\n\nHilda Ellis Davidson (1948) states that Hel \"as a goddess\" in surviving sources seems to belong to a genre of literary personification, that the word hel is generally \"used simply to signify death or the grave,\" and that the word often appears as the equivalent to the English 'death,' which Davidson states \"naturally lends itself to personification by poets.\" Davidson explains that \"whether this personification has originally been based on a belief in a goddess of death called Hel is another question,\" but that she does not believe that the surviving sources give any reason to believe so. Davidson adds that, on the other hand, various other examples of \"certain supernatural women\" connected with death are to be found in sources for Norse mythology, that they \"seem to have been closely connected with the world of death, and were pictured as welcoming dead warriors,\" and that the depiction of Hel \"as a goddess\" in Gylfaginning \"might well owe something to these.\"Ellis (1968:84).\n\nIn a later work (1998), Davidson states that the description of Hel found in chapter 33 of Gylfaginning \"hardly suggests a goddess.\" Davidson adds that \"yet this is not the impression given in the account of Hermod's ride to Hel later in Gylfaginning (49)\" and points out that here Hel \"[speaks] with authority as ruler of the underworld\" and that from her realm \"gifts are sent back to Frigg and Fulla by Balder's wife Nanna as from a friendly kingdom.\" Davidson posits that Snorri may have \"earlier turned the goddess of death into an allegorical figure, just as he made Hel, the underworld of shades, a place 'where wicked men go,' like the Christian Hell (Gylfaginning 3).\" Davidson continues that:\n\n\"On the other hand, a goddess of death who represents the horrors of slaughter and decay is something well known elsewhere; the figure of Kali in India is an outstanding example. Like Snorri's Hel, she is terrifying to in appearance, black or dark in colour, usually naked, adorned with severed heads or arms or the corpses of children, her lips smeared with blood. She haunts the battlefield or cremation ground and squats on corpses. Yet for all this she is 'the recipient of ardent devotion from countless devotees who approach her as their mother' [...].Davidson (1998:178) quoting 'the recipient ...' from Kinsley (1989:116).\n\nDavidson further compares to early attestations of the Irish goddesses Badb (Davidson points to the description of Badb from The Destruction of Da Choca's Hostel where Badb is wearing a dusky mantle, has a large mouth, is dark in color, and has gray hair falling over her shoulders, or, alternatively, \"as a red figure on the edge of the ford, washing the chariot of a king doomed to die\") and The Morrígan. Davidson concludes that, in these examples, \"here we have the fierce destructive side of death, with a strong emphasis on its physical horrors, so perhaps we should not assume that the gruesome figure of Hel is wholly Snorri's literary invention.\"Davidson (1998:179).\n\nJohn Lindow states that most details about Hel, as a figure, are not found outside of Snorri's writing in Gylfaginning, and says that when older skaldic poetry \"says that people are 'in' rather than 'with' Hel, we are clearly dealing with a place rather than a person, and this is assumed to be the older conception,\" that the noun and place Hel likely originally simply meant \"grave,\" and that \"the personification came later.\"Lindow (1997:172). He also draws a parallel between the personified Hel's banishment to the underworld and the binding of Fenrir as part of a recurring theme of the bound monster, where an enemy of the gods is bound but destined to break free at Ragnarok.Lindow (2001:82-83).  Rudolf Simek theorizes that the figure of Hel is \"probably a very late personification of the underworld Hel,\" and says that \"the first scriptures using the goddess Hel are found at the end of the 10th and in the 11th centuries.\" Simek states that the allegorical description of Hel's house in Gylfaginning \"clearly stands in the Christian tradition,\" and that \"on the whole nothing speaks in favour of there being a belief in Hel in pre-Christian times.\"Simek (2007:138). However, Simek also cites Hel as possibly appearing as one of three figures appearing together on Migration Period B-bracteates.Simek (2007:44).\n\nModern influence\n\nIn January 2017, the Icelandic Naming Committee ruled that parents could not name their child Hel \"on the grounds that the name would cause the child significant distress and trouble as it grows up\".Staff A (2017). \"Naming committee stops parents from naming daughter after goddess of the underworld\". Iceland Magazine, January 10, 2017. Online: [http://icelandmag.visir.is/article/naming-committee-stops-parents-naming-daughter-after-goddess-underworld]. Cf. Staff B (2017). \"Not allowed to name after Nordic goddess Hel\". Iceland Monitor, January 9, 2017. Online: [http://icelandmonitor.mbl.is/news/politics_and_society/2017/01/09/not_allowed_to_name_after_nordic_goddess_hel/].",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hel (being)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13666" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In Norse mythology, Hel is a being who presides over a realm of the same name, where she receives a portion of the dead. Hel is attested in the Poetic Edda, compiled in the 13th century from earlier traditional sources, and the Prose Edda, written in the 13th century by Snorri Sturluson. In addition, she is mentioned in poems recorded in Heimskringla and Egils saga that date from the 9th and 10th centuries, respectively. An episode in the Latin work Gesta Danorum, written in the 12th century by Saxo Grammaticus, is generally considered to refer to Hel, and Hel may appear on various Migration Period bracteates.\n\nIn the Poetic Edda, Prose Edda, and Heimskringla, Hel is referred to as a daughter of Loki, and to \"go to Hel\" is to die. In the Prose Edda book Gylfaginning, Hel is described as having been appointed by the god Odin as ruler of a realm of the same name, located in Niflheim. In the same source, her appearance is described as half blue and half Caucasoid-flesh-coloured, and further as having a gloomy, downcast appearance. The Prose Edda details that Hel rules over vast mansions with many servants in her underworld realm and plays a key role in the attempted resurrection of the god Baldr.\n\nScholarly theories have been proposed about Hel's potential connections to figures appearing in the 11th century Old English Gospel of Nicodemus and Old Norse Bartholomeus saga postola, that she may have been considered a goddess with potential Indo-European parallels in Bhavani, Kali, and Mahakali or that Hel may have become a being only as a late personification of the location of the same name.\n\nEtymology\n\nThe Old Norse feminine proper noun Hel is identical to the name of the location over which she rules, Old Norse Hel. The word has cognates in all branches of the Germanic languages, including Old English hell (and thus Modern English hell), Old Frisian helle, Old Saxon hellia, Old High German hella, and Gothic halja. All forms ultimately derive from the reconstructed Proto-Germanic feminine noun *xaljō or *haljō ('concealed place, the underworld'). In turn, the Proto-Germanic form derives from the o-grade form of the Proto-Indo-European root *kel-, *kol-: 'to cover, conceal, save'.For discussion and analysis, see Orel (2003:156) and Watkins (2000:38).\n\nThe term is etymologically related to Modern English hall and therefore also Valhalla, an afterlife 'hall of the slain' in Norse Mythology. Hall and its numerous Germanic cognates derive from Proto-Germanic *hallō 'covered place, hall', from Proto-Indo-European *kol-.This is highlighted in Watkins (2000:38).\n\nRelated early Germanic terms and concepts include Proto-Germanic *xalja-rūnō(n), a feminine compound noun, and *xalja-wītjan, a neutral compound noun. This form is reconstructed from the Latinized Gothic plural noun *haliurunnae (attested by Jordanes; according to philologist Vladimir Orel, meaning 'witches'), Old English helle-rúne ('sorceress, necromancer', according to Orel), and Old High German helli-rūna 'magic'. The compound is composed of two elements: *xaljō (*haljō) and *rūnō, the Proto-Germanic precursor to Modern English rune.See discussion at Orel (2003:155-156 & 310). The second element in the Gothic haliurunnae may however instead be an agent noun from the verb rinnan (\"to run, go\"), which would make its literal meaning \"one who travels to the netherworld\".Scardigli, Piergiuseppe, Die Goten: Sprache und Kultur (1973) pp. 70-71.Lehmann, Winfred, A Gothic Etymological Dictionary (1986))\n\nProto-Germanic *xalja-wītjan (or *halja-wītjan) is reconstructed from Old Norse hel-víti 'hell', Old English helle-wíte 'hell-torment, hell', Old Saxon helli-wīti 'hell', and the Middle High German feminine noun helle-wīze. The compound is a compound of *xaljō (discussed above) and *wītjan (reconstructed from forms such as Old English witt 'right mind, wits', Old Saxon gewit 'understanding', and Gothic un-witi 'foolishness, understanding').Orel (2003:156 & 464).\n\nAttestations\n\nPoetic Edda\n\nThe Poetic Edda, compiled in the 13th century from earlier traditional sources, features various poems that mention Hel. In the Poetic Edda poem Völuspá, Hel's realm is referred to as the \"Halls of Hel.\"Larrington (1999:9). In stanza 31 of Grímnismál, Hel is listed as living beneath one of three roots growing from the world tree Yggdrasil.Larrington (1999:56). In Fáfnismál, the hero Sigurd stands before the mortally wounded body of the dragon Fáfnir, and states that Fáfnir lies in pieces, where \"Hel can take\" him.Larrington (1999:61). In Atlamál, the phrases \"Hel has half of us\" and \"sent off to Hel\" are used in reference to death, though it could be a reference to the location and not the being, if not both.Larrington (1999:225 and 232). In stanza 4 of Baldrs draumar, Odin rides towards the \"high hall of Hel.\"Larrington (1999:243).\n\nHel may also be alluded to in Hamðismál. Death is periphrased as \"joy of the troll-woman\" (or \"ogress\") and ostensibly it is Hel being referred to as the troll-woman or the ogre (flagð), although it may otherwise be some unspecified dís.Larrington (1999:240 and notes).Dronke (1969:164). The Poetic Edda also mentions that travelers to Hel must pass by her guardian hound Garmr.\n\nProse Edda\n\nHel is referred to in the Prose Edda, written in the 13th century by Snorri Sturluson. In chapter 34 of the book Gylfaginning, Hel is listed by High as one of the three children of Loki and Angrboða: the wolf Fenrir, the serpent Jörmungandr, and Hel. High continues that, once the gods found that these three children are being brought up in the land of Jötunheimr, and when the gods \"traced prophecies that from these siblings great mischief and disaster would arise for them\" then the gods expected a lot of trouble from the three children, partially due to the nature of the mother of the children, yet worse so due to the nature of their father.Faulkes (1995:26–27).\n\nHigh says that Odin sent the gods to gather the children and bring them to him. Upon their arrival, Odin threw Jörmungandr into \"that deep sea that lies round all lands,\" Odin threw Hel into Niflheim, and bestowed upon her authority over nine worlds, in that she must \"administer board and lodging to those sent to her, and that is those who die of sickness or old age.\" High details that in this realm Hel has \"great Mansions\" with extremely high walls and immense gates, a hall called Éljúðnir, a dish called \"Hunger,\" a knife called \"Famine,\" the servant Ganglati (Old Norse \"lazy walker\"Orchard (1997:79).), the serving-maid Ganglöt (also \"lazy walker\"), the entrance threshold \"Stumbling-block,\" the bed \"Sick-bed,\" and the curtains \"Gleaming-bale.\" High describes Hel as \"half black and half flesh-coloured,\" adding that this makes her easily recognizable, and furthermore that Hel is \"rather downcast and fierce-looking.\"Faulkes (1995:27).\n\nIn chapter 49, High describes the events surrounding the death of the god Baldr. The goddess Frigg asks who among the Æsir will earn \"all her love and favour\" by riding to Hel, the location, to try to find Baldr, and offer Hel herself a ransom. The god Hermóðr volunteers and sets off upon the eight-legged horse Sleipnir to Hel. Hermóðr arrives in Hel's hall, finds his brother Baldr there, and stays the night. The next morning, Hermóðr begs Hel to allow Baldr to ride home with him, and tells her about the great weeping the Æsir have done upon Baldr's death.Faulkes (1995:49–50). Hel says the love people have for Baldr that Hermóðr has claimed must be tested, stating:\nIf all things in the world, alive or dead, weep for him, then he will be allowed to return to the Æsir. If anyone speaks against him or refuses to cry, then he will remain with Hel.Byock (2005:68).\n\nLater in the chapter, after the female jötunn Þökk refuses to weep for the dead Baldr, she responds in verse, ending with \"let Hel hold what she has.\"Byock (2005:69). In chapter 51, High describes the events of Ragnarök, and details that when Loki arrives at the field Vígríðr \"all of Hel's people\" will arrive with him.Faulkes (1995:54).\n\nIn chapter 5 of the Prose Edda book Skáldskaparmál, Hel is mentioned in a kenning for Baldr (\"Hel's companion\").Faulkes (1995:74). In chapter 16, \"Hel's [...] relative or father\" is given as a kenning for Loki.Faulkes (1995:76). In chapter 50, Hel is referenced (\"to join the company of the quite monstrous wolf's sister\") in the skaldic poem Ragnarsdrápa.Faulkes (1995:123).\n\nHeimskringla\n\nIn the Heimskringla book Ynglinga saga, written in the 13th century by Snorri Sturluson, Hel is referred to, though never by name. In chapter 17, the king Dyggvi dies of sickness. A poem from the 9th century Ynglingatal that forms the basis of Ynglinga saga is then quoted that describes Hel's taking of Dyggvi:\n\nI doubt not\nbut Dyggvi's corpse\nHel does hold\nto whore with him;\nfor Ulf's sib\na scion of kings\nby right should\ncaress in death:\nto love lured\nLoki's sister\nYngvi's heir\no'er all Sweden.Hollander (2007:20).\n\nIn chapter 45, a section from Ynglingatal is given which refers to Hel as \"howes'-warder\" (meaning \"guardian of the graves\") and as taking King Halfdan Hvitbeinn from life.Hollander (2007:46). In chapter 46, King Eystein Halfdansson dies by being knocked overboard by a sail yard. A section from Ynglingatal follows, describing that Eystein \"fared to\" Hel (referred to as \"Býleistr's-brother's-daughter\").Hollander (2007:47). In chapter 47, the deceased Eystein's son King Halfdan dies of an illness, and the excerpt provided in the chapter describes his fate thereafter, a portion of which references Hel:\n\nLoki's child\nfrom life summoned\nto her thing\nthe third liege-lord,\nwhen Halfdan\nof Holtar farm\nleft the life\nallotted to him.Hollander (2007:20–21).\n\nIn a stanza from Ynglingatal recorded in chapter 72 of the Heimskringla book Saga of Harald Sigurdsson, \"given to Hel\" is again used as a phrase to referring to death.Hollander (2007:638).\n\nEgils saga\n\nThe Icelanders' saga Egils saga contains the poem Sonatorrek. The saga attributes the poem to 10th century skald Egill Skallagrímsson, and writes that it was composed by Egill after the death of his son Gunnar. The final stanza of the poem contains a mention of Hel, though not by name:\n\nNow my course is tough:\nDeath, close sister\nof Odin's enemy\nstands on the ness:\nwith resolution\nand without remorse\nI will gladly\nawait my own.Scudder (2001:159).\n\nGesta Danorum\n\nIn the account of Baldr's death in Saxo Grammaticus' early 13th century work Gesta Danorum, the dying Baldr has a dream visitation from Proserpina (here translated as \"the goddess of death\"):\n\nThe following night the goddess of death appeared to him in a dream standing at his side, and declared that in three days time she would clasp him in her arms. It was no idle vision, for after three days the acute pain of his injury brought his end.Fisher (1999:I 75).\n\nScholars have assumed that Saxo used Proserpina as a goddess equivalent to the Norse Hel.Davidson (1999:II 356); Grimm (2004:314).\n\nArchaeological record\n\nIt has been suggested that several imitation medallions and bracteates of the Migration Period (ca. first centuries AD) feature depictions of Hel. In particular the bracteates IK 14 and IK 124 depict a rider traveling down a slope and coming upon a female being holding a scepter or a staff. The downward slope may indicate that the rider is traveling towards the realm of the dead and the woman with the scepter may be a female ruler of that realm, corresponding to Hel.Pesch (2002:67).\n\nSome B-class bracteates showing three godly figures have been interpreted as depicting Baldr's death, the best known of these is the Fakse bracteate. Two of the figures are understood to be Baldr and Odin while both Loki and Hel have been proposed as candidates for the third figure. If it is Hel she is presumably greeting the dying Baldr as he comes to her realm.Simek (2007:44); Pesch (2002:70); Bonnetain (2006:327).\n\nTheories\n\nSeo Hell\n\nThe Old English Gospel of Nicodemus, preserved in two manuscripts from the 11th century, contains a female figure referred to as Seo hell who engages in flyting with Satan and tells him to leave her dwelling (Old English ut of mynre onwununge). Regarding Seo Hell in the Old English Gospel of Nicodemus, Michael Bell states that \"her vivid personification in a dramatically excellent scene suggests that her gender is more than grammatical, and invites comparison with the Old Norse underworld goddess Hel and the Frau Holle of German folklore, to say nothing of underworld goddesses in other cultures\" yet adds that \"the possibility that these genders are merely grammatical is strengthened by the fact that an Old Norse version of Nicodemus, possibly translated under English influence, personifies Hell in the neutral (Old Norse þat helviti).\"Bell (1983:263).\n\nBartholomeus saga postola\n\nThe Old Norse Bartholomeus saga postola, an account of the life of Saint Bartholomew dating from the 13th century, mentions a \"Queen Hel.\" In the story, a devil is hiding within a pagan idol, and bound by Bartholomew's spiritual powers to acknowledge himself and confess,   (Old Norse heriaði a Hel drottning vara). \"Queen Hel\" is not mentioned elsewhere in the saga.Bell (1983:263–264).\n\nMichael Bell says that while Hel \"might at first appear to be identical with the well-known pagan goddess of the Norse underworld\" as described in chapter 34 of Gylfaginning, \"in the combined light of the Old English and Old Norse versions of Nicodemus she casts quite a different a shadow,\" and that in  Bartholomeus saga postola \"she is clearly the queen of the Christian, not pagan, underworld.\"Bell (1983:265).\n\nOrigins and development\n\nJacob Grimm theorized that Hel (whom he refers to here as Halja, the theorized Proto-Germanic form of the term) is essentially an \"image of a greedy, unrestoring, female deity\" and that \"the higher we are allowed to penetrate into our antiquities, the less hellish and more godlike may Halja appear. Of this we have a particularly strong guarantee in her affinity to the Indian Bhavani, who travels about and bathes like Nerthus and Holda, but is likewise called Kali or Mahakali, the great black goddess. In the underworld she is supposed to sit in judgment on souls. This office, the similar name and the black hue [...] make her exceedingly like Halja. And Halja is one of the oldest and commonest conceptions of our heathenism.\"Grimm (1882:315).\n\nGrimm theorizes that the Helhest, a three legged-horse that roams the countryside \"as a harbinger of plague and pestilence\" in Danish folklore, was originally the steed of the goddess Hel, and that on this steed Hel roamed the land \"picking up the dead that were her due.\" In addition, Grimm says that a wagon was once ascribed to Hel, with which Hel made journeys.Grimm (1882:314). Grimm says that Hel is an example of a \"half-goddess;\" \"one who cannot be shown to be either wife or daughter of a god, and who stands in a dependent relation to higher divinities\" and that \"half-goddesses\" stand higher than \"half-gods\" in Germanic mythology.Grimm (1882:397).\n\nHilda Ellis Davidson (1948) states that Hel \"as a goddess\" in surviving sources seems to belong to a genre of literary personification, that the word hel is generally \"used simply to signify death or the grave,\" and that the word often appears as the equivalent to the English 'death,' which Davidson states \"naturally lends itself to personification by poets.\" Davidson explains that \"whether this personification has originally been based on a belief in a goddess of death called Hel is another question,\" but that she does not believe that the surviving sources give any reason to believe so. Davidson adds that, on the other hand, various other examples of \"certain supernatural women\" connected with death are to be found in sources for Norse mythology, that they \"seem to have been closely connected with the world of death, and were pictured as welcoming dead warriors,\" and that the depiction of Hel \"as a goddess\" in Gylfaginning \"might well owe something to these.\"Ellis (1968:84).\n\nIn a later work (1998), Davidson states that the description of Hel found in chapter 33 of Gylfaginning \"hardly suggests a goddess.\" Davidson adds that \"yet this is not the impression given in the account of Hermod's ride to Hel later in Gylfaginning (49)\" and points out that here Hel \"[speaks] with authority as ruler of the underworld\" and that from her realm \"gifts are sent back to Frigg and Fulla by Balder's wife Nanna as from a friendly kingdom.\" Davidson posits that Snorri may have \"earlier turned the goddess of death into an allegorical figure, just as he made Hel, the underworld of shades, a place 'where wicked men go,' like the Christian Hell (Gylfaginning 3).\" Davidson continues that:\n\n\"On the other hand, a goddess of death who represents the horrors of slaughter and decay is something well known elsewhere; the figure of Kali in India is an outstanding example. Like Snorri's Hel, she is terrifying to in appearance, black or dark in colour, usually naked, adorned with severed heads or arms or the corpses of children, her lips smeared with blood. She haunts the battlefield or cremation ground and squats on corpses. Yet for all this she is 'the recipient of ardent devotion from countless devotees who approach her as their mother' [...].Davidson (1998:178) quoting 'the recipient ...' from Kinsley (1989:116).\n\nDavidson further compares to early attestations of the Irish goddesses Badb (Davidson points to the description of Badb from The Destruction of Da Choca's Hostel where Badb is wearing a dusky mantle, has a large mouth, is dark in color, and has gray hair falling over her shoulders, or, alternatively, \"as a red figure on the edge of the ford, washing the chariot of a king doomed to die\") and The Morrígan. Davidson concludes that, in these examples, \"here we have the fierce destructive side of death, with a strong emphasis on its physical horrors, so perhaps we should not assume that the gruesome figure of Hel is wholly Snorri's literary invention.\"Davidson (1998:179).\n\nJohn Lindow states that most details about Hel, as a figure, are not found outside of Snorri's writing in Gylfaginning, and says that when older skaldic poetry \"says that people are 'in' rather than 'with' Hel, we are clearly dealing with a place rather than a person, and this is assumed to be the older conception,\" that the noun and place Hel likely originally simply meant \"grave,\" and that \"the personification came later.\"Lindow (1997:172). He also draws a parallel between the personified Hel's banishment to the underworld and the binding of Fenrir as part of a recurring theme of the bound monster, where an enemy of the gods is bound but destined to break free at Ragnarok.Lindow (2001:82-83).  Rudolf Simek theorizes that the figure of Hel is \"probably a very late personification of the underworld Hel,\" and says that \"the first scriptures using the goddess Hel are found at the end of the 10th and in the 11th centuries.\" Simek states that the allegorical description of Hel's house in Gylfaginning \"clearly stands in the Christian tradition,\" and that \"on the whole nothing speaks in favour of there being a belief in Hel in pre-Christian times.\"Simek (2007:138). However, Simek also cites Hel as possibly appearing as one of three figures appearing together on Migration Period B-bracteates.Simek (2007:44).\n\nModern influence\n\nIn January 2017, the Icelandic Naming Committee ruled that parents could not name their child Hel \"on the grounds that the name would cause the child significant distress and trouble as it grows up\".Staff A (2017). \"Naming committee stops parents from naming daughter after goddess of the underworld\". Iceland Magazine, January 10, 2017. Online: [http://icelandmag.visir.is/article/naming-committee-stops-parents-naming-daughter-after-goddess-underworld]. Cf. Staff B (2017). \"Not allowed to name after Nordic goddess Hel\". Iceland Monitor, January 9, 2017. Online: [http://icelandmonitor.mbl.is/news/politics_and_society/2017/01/09/not_allowed_to_name_after_nordic_goddess_hel/]. Hel (being). http://en.wikipedia.org/?curid=13666."
  }
}
