{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19349",
  "eid" : "3a0f7cf0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778606655,
  "textBody" : "Events\n\n*1194 – King Richard I of England gives Portsmouth its first Royal Charter.\n*1230 – William de Braose is hanged by Prince Llywelyn the Great.\n*1335 – Otto the Merry, Duke of Austria, becomes Duke of Carinthia.\n*1536 – Anne Boleyn, Queen of England, is arrested and imprisoned on charges of adultery, incest, treason and witchcraft.\n*1559 – John Knox returns from exile to Scotland to become the leader of the nascent Scottish Reformation.\n*1568 – Mary, Queen of Scots, escapes from Loch Leven Castle.\n*1611 – The King James Version of the Bible is published for the first time in London, England, by printer Robert Barker.\n*1670 – King Charles II of England grants a permanent charter to the Hudson's Bay Company to open up the fur trade in North America.\n*1672 – John Maitland becomes Duke of Lauderdale and Earl of March.\n*1808 – Outbreak of the Peninsular War: The people of Madrid rise up in rebellion against French occupation. Francisco de Goya later memorializes this event in his painting The Second of May 1808.\n*1812 – The Siege of Cuautla during the Mexican War of Independence ends with both sides claiming victory after Mexican rebels under José María Morelos y Pavón abandon the city after 72 days under siege by royalist Spanish troops under Félix María Calleja.\n*1816 – Marriage of Léopold of Saxe-Coburg and Princess Charlotte of Wales.\n*1829 – After anchoring nearby, Captain Charles Fremantle of , declares the Swan River Colony in Australia.\n*1863 – American Civil War: Stonewall Jackson is wounded by friendly fire while returning to camp after reconnoitering during the Battle of Chancellorsville. He succumbs to pneumonia eight days later.\n*1866 – Peruvian defenders fight off the Spanish fleet at the Battle of Callao.\n*1876 – The April Uprising breaks out in Bulgaria.\n*1879 – The Spanish Socialist Workers' Party is founded in Madrid by Pablo Iglesias.\n*1885 – Cree and Assiniboine warriors win the Battle of Cut Knife, their largest victory over Canadian forces during the North-West Rebellion.\n*  1885   – The Congo Free State is established by King Léopold II of Belgium.\n*1889 – Menelik II, Emperor of Ethiopia, signs the Treaty of Wuchale, giving Italy control over Eritrea.\n*1906 – Closing ceremony of the Intercalated Games in Athens, Greece.\n*1918 – General Motors acquires the Chevrolet Motor Company of Delaware.\n*1920 – The first game of the Negro National League baseball is played in Indianapolis.\n*1933 – Gleichschaltung: Adolf Hitler bans trade unions.\n*1941 – Following the coup d'état against Iraq Crown Prince 'Abd al-Ilah earlier that year, the United Kingdom launches the Anglo-Iraqi War to restore him to power.\n*1945 – World War II: Fall of Berlin: The Soviet Union announces the capture of Berlin and Soviet soldiers hoist their red flag over the Reichstag building.\n*  1945   – World War II: Italian Campaign: General Heinrich von Vietinghoff signs the official instrument of surrender of all Wehrmacht forces in Italy.\n*  1945   – World War II: The US 82nd Airborne Division liberates Wöbbelin concentration camp finding 1000 dead prisoners, most of whom starved to death.\n*  1945   – World War II: A death march from Dachau to the Austrian border[http://www.gz-tm-dachau.de/img/uebersicht_big.jpg Todesmärsche Dachau memorial website's map page of KZ-Dachau death march] is halted by the segregated, all-Nisei 522nd Field Artillery Battalion of the U.S. Army in southern Bavaria, saving several hundred prisoners.[http://www.goforbroke.org/learn/history/combat_history/world_war_2/european_theater/central_europe_campaign.php CENTRAL EUROPE CAMPAIGN (March 22 - May 11, 1945) - The 522nd Field Artillery Battalion and the Dachau Subcamps, March 9 – May 11, 1945] \n*1952 – The world's first ever jet airliner, the De Havilland Comet 1 makes its maiden flight, from London to Johannesburg.\n*1955 – Tennessee Williams wins the Pulitzer Prize for Drama for Cat on a Hot Tin Roof.\n*1963 – Berthold Seliger launches a rocket with three stages and a maximum flight altitude of more than 100 kilometres near Cuxhaven. It is the only sounding rocket developed in Germany.\n*1964 – Vietnam War: An explosion sinks the American aircraft carrier  while it is docked at Saigon. A North Vietnamese frogman had placed a bomb on the ship. She is raised and returned to service less than seven months later.\n*  1964   – First ascent of Shishapangma the fourteenth highest mountain in the world and the lowest of the Eight-thousanders.\n*1969 – The British ocean liner Queen Elizabeth 2 departs on her maiden voyage to New York City.\n*1972 – In the early morning hours a fire breaks out at the Sunshine Mine located between Kellogg and Wallace, Idaho, killing 91 workers.\n*1982 – Falklands War: The British nuclear submarine  sinks the Argentine cruiser ARA General Belgrano.\n*1986 – Chernobyl disaster: The City of Chernobyl is evacuated six days after the disaster.\n*1989 – Hungary begins dismantling its border fence with Austria, which allows a number of East Germans to defect.\n*1994 – A bus crashes in Gdańsk, Poland killing 32 people.\n*1995 – During the Croatian War of Independence, the Army of the Republic of Serb Krajina fires cluster bombs at Zagreb, killing seven and wounding over 175 civilians.\n*1998 – The European Central Bank is founded in Brussels in order to define and execute the European Union's monetary policy.\n*1999 – Panamanian general election, 1999: Mireya Moscoso becomes the first woman to be elected President of Panama.\n*2000 – President Bill Clinton announces that accurate GPS access would no longer be restricted to the United States military.\n*2004 – The Yelwa massacre concludes. It began on 4 February 2004 when armed Muslims killed 78 Christians at Yelwa. In response, about 630 Muslims were killed by Christians on May 2nd.\n*2008 – Cyclone Nargis makes landfall in Burma killing over 138,000 people and leaving millions of people homeless.\n*  2008   – Chaitén Volcano begins erupting in Chile, forcing the evacuation of more than 4,500 people.\n*2011 – Osama bin Laden, the suspected mastermind behind the September 11 attacks and the FBI's most wanted man, is killed by the United States special forces in Abbottabad, Pakistan.\n*  2011   – An E. coli outbreak strikes Europe, mostly in Germany, leaving more than 30 people dead and many others sick from the bacteria outbreak.\n*  2011   – The 41st Canadian federal election is held, in which the governing Conservative Party, led by incumbent Prime Minister Stephen Harper, increases their number of seats from a minority to a majority.\n*2012 – A pastel version of The Scream, by Norwegian painter Edvard Munch, sells for $120 million in a New York City auction, setting a new world record for a work of art at auction.\n*2014 – Two mudslides in Badakhshan, Afghanistan, leave up to 2,500 people missing.\n\nBirths\n\n*1360 – Yongle Emperor of China (d. 1424)\n*1402 – Eleanor of Aragon, Queen of Portugal (d. 1445)\n*1451 – René II, Duke of Lorraine (d. 1508)\n*1458 – Eleanor of Viseu (d. 1525)\n*1476 – Charles I, Duke of Münsterberg-Oels, Count of Kladsko, Governor of Bohemia and Silesia (d. 1536)\n*1533 – Philip II, Duke of Brunswick-Grubenhagen (d. 1596)\n*1551 – William Camden, English historian and topographer (d. 1623)\n*1567 – Sebald de Weert, Dutch captain, vice-admiral of the Dutch East India Company (d. 1603)\n*1579 – Tokugawa Hidetada, Japanese shogun (d. 1632)\n*1601 – Athanasius Kircher, German priest and scholar (d. 1680)\n*1660 – Alessandro Scarlatti, Italian composer (d. 1725)\n*1695 – Giovanni Niccolò Servandoni, Italian-French painter and architect (d. 1766)\n*1702 – Friedrich Christoph Oetinger, German theologian and theosopher (d. 1782)\n*1707 – Jean-Baptiste Barrière, French cellist and composer (d. 1747)\n*1729 – Catherine the Great of Russia (d. 1796)\n*1737 – William Petty, 2nd Earl of Shelburne, Irish-English politician, Prime Minister of the United Kingdom (d. 1805)\n*1740 – Elias Boudinot, American lawyer and politician, 10th President of the Continental Congress (d. 1821)\n*1750 – John André, English soldier and spy (d. 1780)\n*1752 – Ludwig August Lebrun, German oboe player and composer (d. 1790)\n*1754 – Vicente Martín y Soler, Spanish composer (d. 1806)\n*1772 – Novalis, German author and poet (d. 1801)\n*1773 – Henrik Steffens, Norwegian philosopher and poet (d. 1845)\n*1797 – Abraham Pineo Gesner, Canadian physician and geologist (d. 1864)\n*1802 – Heinrich Gustav Magnus, German chemist and physicist (d. 1870)\n*1806 – Catherine Labouré, French nun and saint (d. 1876)\n*1810 – Hans Christian Lumbye, Danish composer and conductor (d. 1874)\n*1815 – William Buell Richards, Canadian lawyer and judge, 1st Chief Justice of Canada (d. 1889)\n*1828 – Désiré Charnay, French archaeologist and photographer (d. 1915)\n*1830 – Otto Staudinger, German entomologist and author (d. 1900)\n*1843 – Elijah McCoy, Canadian-American engineer (d. 1929)\n*1859 – Jerome K. Jerome, English author and playwright (d. 1927)\n*1860 – John Scott Haldane, Scottish physiologist, physician, and academic (d. 1936)\n*  1860   – Theodor Herzl, Austro-Hungarian zionist philosopher, journalist and author (d. 1904)\n*1865 – Clyde Fitch, American playwright (d. 1909)\n*1867 – Giuseppe Morello, Italian-American mobster (d. 1930)\n*1873 – Jurgis Baltrušaitis, Lithuanian poet, critic, and translator (d. 1944)\n*1879 – James F. Byrnes, American stenographer and politician, 49th United States Secretary of State (d. 1972)\n*1880 – Bill Horr, American football player, discus thrower, and coach (d. 1955)\n*1881 – Alexander Kerensky, Russian lawyer and politician, 10th Prime Minister of Russia (d. 1970)\n*1882 – Isabel González, Puerto Rican activist who helped pave the way for Puerto Ricans' American citizenship (d. 1971)\n*1885 – Hedda Hopper, American actress and gossip columnist (d. 1966)\n*1886 – Gottfried Benn, German author and poet (d. 1956)\n*1887 – Vernon Castle, English-American dancer (d. 1918)\n*  1887   – Eddie Collins, American baseball player and manager (d. 1951)\n*1889 – Ki Hajar Dewantara, Indonesian philosopher, academic, and politician (d. 1959)\n*1890 – E. E. Smith, American engineer and author (d. 1965)\n*1892 – Manfred von Richthofen, German captain and pilot (d. 1918)\n*1894 – Joseph Henry Woodger, English biologist, philosopher, and academic (d. 1981)\n*1895 – Lorenz Hart, American playwright and lyricist (d. 1943)\n*1897 – John Frederick Coots, American songwriter (d. 1985)\n*1898 – Henry Hall, English bandleader, composer, and actor (d. 1989)\n*1901 – Bob Wyatt, English cricketer (d. 1995)\n*1902 – Brian Aherne, English actor (d. 1986)\n*1903 – Benjamin Spock, American rower, pediatrician, and author (d. 1998)\n*1904 – Bill Brandt, German-English photographer and journalist (d. 1983)\n*1906 – Philippe Halsman, Latvian-American photographer (d. 1979)\n*1907 – Pinky Lee, American comedian and television host (d. 1993)\n*1910 – Alexander Bonnyman, Jr., American lieutenant, Medal of Honor recipient (d. 1943)\n*1912 – Axel Springer, German journalist and publisher, founded Axel Springer AG (d. 1985)\n*1913 – Pietro Frua, Italian coachbuilders and car designers (d. 1983)\n*  1913   – Nigel Patrick, English actor and director (d. 1981)\n*  1913   – Aydın Sayılı, Turkish historian and academic (d. 1993)\n*1915 – Doris Fisher, American singer-songwriter (d. 2003)\n*  1915   – Peggy Mount, English actress (d. 2001)\n*1917 – Albert Castelyns, Belgian water polo player and bobsledder\n*  1917   – Văn Tiến Dũng, Vietnamese general and politician, 6th Minister of Defence for Vietnam (d. 2002)\n*1920 – Jean-Marie Auberson, Swiss violinist and conductor (d. 2004)\n*  1920   – Otto Buchsbaum, Austrian-Brazilian journalist and activist (d. 2000)\n*  1920   – Vasantrao Deshpande, Indian singer and sitar player (d. 1983)\n*  1920   – Guinn Smith, American pole vaulter, soldier, and pilot (d. 2004)\n*1921 – Satyajit Ray, Indian director, producer, and screenwriter (d. 1992)\n*1922 – Roscoe Lee Browne, American actor and director (d. 2007)\n*  1922   – A. M. Rosenthal, Canadian-born American journalist and author (d. 2006)\n*1923 – Patrick Hillery, Irish physician and politician, 6th President of Ireland (d. 2008)\n*1924 – Jamal Abro, Pakistani lawyer and author (d. 2004)\n*  1924   – Theodore Bikel, Austrian-American singer-songwriter, guitarist, and actor (d. 2015)\n*  1924   – Hugh Cortazzi, English soldier, historian, and diplomat, British Ambassador to Japan\n*1925 – John Neville, English-Canadian actor (d. 2011)\n*1926 – Gérard D. Levesque, Canadian lawyer and politician, 5th Deputy Premier of Quebec (d. 1993)\n*1927 – Ray Barrett, Australian actor and singer (d. 2009)\n*1927 – Amos Kenan, Israeli columnist, painter, sculptor, playwright and novelist (d. 2009)\n*1928 – Hans Trass, Estonian ecologist and botanist (d. 2017)\n*1929 – Édouard Balladur, Turkish-French economist and politician, 162nd Prime Minister of France\n*  1929   – James Dillion, American discus thrower (d. 2010)\n*  1929   – Link Wray, American singer-songwriter and guitarist (d. 2005)\n*1930 – Yoram Kaniuk, Israeli painter and critic (d. 2013)\n*  1930   – Marco Pannella, Italian journalist and politician (d. 2016)\n*1931 – Phil Bruns, American actor and stuntman (d. 2012)\n*  1931   – Martha Grimes, American author and poet\n*1932 – Maury Allen, American journalist, actor, and author (d. 2010)\n*1933 – Bunk Gardner, American musician\n*  1933   – Harry Woolf, Baron Woolf, English lawyer and judge, Lord Chief Justice of England and Wales\n*1935 – Luis Suárez Miramontes, Spanish footballer and manager\n*1935 – Faisal II of Iraq, the last King of Iraq (d.1958)\n*1936 – Norma Aleandro, Argentinian actress, director, and screenwriter\n*  1936   – Engelbert Humperdinck, English singer and pianist\n*  1936   – Michael Rabin, American violinist (d. 1972)\n*1937 – Klaus Enders, German motorcycle sidecar racer\n*  1937   – Lorenzo Music, American actor, producer, and screenwriter (d. 2001)\n*1938 – Moshoeshoe II of Lesotho (d. 1996)\n*1939 – Sumio Iijima, Japanese physicist and engineer\n*1941 – Tony Adamowicz, American race car driver\n*  1941   – Bruce Cameron, Scottish bishop\n*  1941   – Clay Carroll, American baseball player\n*1942 – Jacques Rogge, Belgian businessman\n*1944 – Robert G. W. Anderson, English chemist, historian, and curator\n*1945 – Randy Cain, American soul singer (d. 2009)\n*  1945   – Judge Dread, English singer-songwriter (d. 1998)\n*  1945   – Bianca Jagger, Nicaraguan-American model, actress, and activist\n*  1945   – Goldy McJohn, Canadian keyboard player \n*1946 – Peter L. Benson, American psychologist and academic (d. 2011)\n*  1946   – Lesley Gore, American singer-songwriter (d. 2015)\n*  1946   – David Suchet, English actor \n*1947 – James Dyson, English businessman, founded the Dyson Company\n*  1947   – Lynda Myles, English screenwriter and producer\n*1948 – Larry Gatlin, American singer-songwriter, guitarist, and actor\n*1949 – Alan Titchmarsh, English gardener and author\n*1950 – Simon Gaskell, English chemist and academic\n*  1950   – Duncan Gay, Australian businessman and politician\n*  1950   – Lou Gramm, American singer-songwriter\n*  1950   – Richard Ground, English lawyer and judge (d. 2014)\n*1951 – John Glascock, English singer and bass player (d. 1979)\n*1952 – Chris Anderson, Australian rugby league player and coach\n*  1952   – Christine Baranski, American actress and singer\n*  1952   – Isla St Clair, Scottish singer and actress\n*1953 – Valery Gergiev, Russian conductor and director\n*1954 – Elliot Goldenthal, American composer and conductor\n*  1954   – Dawn Primarolo, English politician\n*  1954   – Stephen Venables, English mountaineer and author\n*1955 – Donatella Versace, Italian fashion designer\n*1956 – Régis Labeaume, Canadian businessman and politician, 41st Mayor of Quebec City\n*1958 – Yasushi Akimoto, Japanese songwriter and producer\n*  1958   – Stanislav Levý, Czech footballer and manager\n*  1958   – David O'Leary, English-Irish footballer and manager\n*1959 – Alan Best, Canadian animator, director, and producer\n*  1959   – Tony Wakeford, English singer-songwriter and guitarist \n*1960 – Stephen Daldry, English director and producer\n*1961 – Steve James, English snooker player\n*  1961   – Sophie Thibault, Canadian journalist\n*  1961   – Phil Vickery, English chef and author\n*1962 – Elizabeth Berridge, American actress\n*  1962   – Michael Grandage, English director and producer\n*  1962   – Jimmy White, English snooker player\n*1965 – Félix José, Dominican-American baseball player\n*1966 – Uwe Freiler, German footballer\n*  1966   – Margus Kolga, Estonian diplomat\n*  1966   – Belinda Stronach, Canadian businesswoman, philanthropist, and politician\n*1967 – Bengt Åkerblom, Swedish ice hockey player (d. 1995)\n*  1967   – Mika Brzezinski, American journalist and author\n*  1967   – David Rocastle, English footballer (d. 2001)\n*1968 – Jeff Agoos, Swiss-American soccer player, manager, and sportscaster\n*  1968   – Julia Hartley-Brewer, English broadcaster and columnist\n*  1968   – Ziana Zain, Malaysian singer-songwriter and actress\n*1969 – Brian Lara, Trinidadian cricketer\n*1970 – Marco Walker, Swiss footballer and coach\n*1971 – Musashimaru Kōyō, Samoan-American sumo wrestler, the 67th Yokozuna\n*  1971   – Fatima Yusuf, Nigerian sprinter\n*1972 – Paul Adcock, English footballer\n*  1972   – Ahti Heinla, Estonian programmer and businessman, co-developed Skype\n*  1972   – Dwayne Johnson, American-Canadian wrestler, actor, and producer\n*1973 – Florian Henckel von Donnersmarck, German director and screenwriter\n*1974 – Horacio Carbonari, Argentinian footballer and manager\n*  1974   – Andy Johnson, English-Welsh footballer\n*  1974   – Janek Meet, Estonian footballer\n*1975 – David Beckham, English footballer, coach, and model\n*1976 – Jeff Gutt, American singer-songwriter \n*1977 – Brian Cardinal, American basketball player\n*  1977   – Jan Fitschen, German runner\n*  1977   – Luke Hudson, American baseball player\n*  1977   – Fredrik Malm, Swedish journalist and politician\n*  1977   – Jenna von Oÿ, American actress and singer\n*  1977   – Kalle Palander, Finnish skier\n*1978 – Melvin Ely, American basketball player\n*  1978   – Mike Weaver, Canadian ice hockey player\n*1979 – Jason Chimera, Canadian ice hockey player\n*  1979   – Ioannis Kanotidis, Greek footballer\n*1980 – Tim Borowski, German footballer\n*  1980   – Pierre-Luc Gagnon, Canadian skateboarder\n*  1980   – Ellie Kemper, American actress, comedian and writer\n*  1980   – Zat Knight, English footballer\n*  1980   – Artūras Masiulis, Lithuanian basketball player\n*  1980   – Troy Murphy, American basketball player\n*  1980   – Lassaâd Ouertani, Tunisian footballer (d. 2013)\n*  1980   – Brad Richards, Canadian ice hockey player\n*1981 – Robert Buckley, American actor\n*  1981   – Chris Kirkland, English footballer\n*  1981   – Tiago Mendes, Portuguese footballer\n*  1981   – Matt Murray, English footballer\n*  1981   – Rina Satō, Japanese voice actress and singer\n*1982 – Timothy Benjamin, Welsh sprinter\n*  1982   – Johan Botha, South African cricketer\n*1983 – Alessandro Diamanti, Italian footballer\n*  1983   – Maynor Figueroa, Honduran footballer \n*  1983   – Tina Maze, Slovenian skier\n*  1983   – Daniel Sordo, Spanish race car driver\n*  1983   – Ove Vanebo, Norwegian politician\n*1984 – Saulius Mikoliūnas, Lithuanian footballer\n*  1984   – Thabo Sefolosha, Swiss basketball player\n*1985 – Lily Allen, English singer-songwriter and actress\n*  1985   – Kyle Busch, American race car driver\n*  1985   – Ashley Harkleroad, American tennis player\n*  1985   – Sarah Hughes, American figure skater\n*  1985   – David Nugent, English footballer\n*1987 – Nana Kitade, Japanese singer-songwriter and actress \n*  1987   – Pat McAfee, American football player\n*  1987   – Kris Russell, Canadian ice hockey player\n*1988 – Neftalí Feliz, Dominican baseball player\n*  1988   – Stephen Henderson, Irish footballer\n*1989 – Jeanette Pohlen, American basketball player\n*1990 – Paul George, American basketball player\n*1991 – Jeong Jinwoon, South Korean actor and singer (2AM)\n*1992 – Sunmi, South Korean singer (Wonder Girls)\n*  1992   – María Teresa Torró Flor, Spanish tennis player\n*1993 – Owain Doull, Welsh track cyclist\n*  1993   – Isyana Sarasvati, Indonesian singer\n*  1993   – Huang Zitao, Chinese singer & rapper, former member of boy band EXO\n*1997 – BamBam, Thai singer and rapper (Got7)\n*2015 – Princess Charlotte of Cambridge, British royal, and fourth in line to the British throne\n\nDeaths\n\n* 373 – Athanasius of Alexandria, Egyptian bishop and saint (b. 298)\n* 649 – Marutha of Tikrit, Persian theologian  of the Syriac Orthodox Church (b. 565)\n* 821 – Liu Zong, general of the Tang Dynasty\n* 907 – Boris I of Bulgaria\n*1219 – Leo I, King of Armenia (b. 1150)\n*1230 – William de Braose, English son of Reginald de Braose (b. 1197)\n*1293 – Meir of Rothenburg, German rabbi (b. c.1215)\n*1300 – Blanche of Artois (b. 1248)\n*1450 – William de la Pole, 1st Duke of Suffolk, English admiral (b. 1396)\n*1519 – Leonardo da Vinci, Italian painter, sculptor, and architect (b. 1452)\n*1564 – Rodolfo Pio da Carpi, Italian cardinal (b. 1500)\n*1627 – Lodovico Grossi da Viadana, Italian composer and educator (b. 1560)\n*1667 – George Wither, English poet and author (b. 1588)\n*1683 – Stjepan Gradić, Croatian philosopher and mathematician (b. 1613)\n*1711 – Laurence Hyde, 1st Earl of Rochester, English politician, First Lord of the Treasury (b. 1641)\n*1799 – Juan Vicente de Güemes, 2nd Count of Revillagigedo (b. 1740)\n*1802 – Herman Willem Daendels, Dutch general and politician, Governor-General of the Dutch Gold Coast (b. 1762)\n*1810 – Henry Jerome de Salis, English priest (b. 1740)\n*1819 – Mary Moser, English painter and academic (b. 1744)\n*1857 – Alfred de Musset, French dramatist, poet, and novelist  (b. 1810)\n*1864 – Giacomo Meyerbeer, German composer and educator (b. 1791)\n*1880 – Eberhard Anheuser, German-American businessman, co-founded Anheuser-Busch (b. 1805)\n*  1880   – Tom Wills, Australian cricketer, co-created Australian rules football (b. 1835)\n*1885 – Terézia Zakoucs, Hungarian-Slovene author (b. 1817)\n*1915 – Clara Immerwahr, German chemist (b. 1870)\n*1918 – Jüri Vilms, Estonian lawyer and politician (b. 1889)\n*1925 – Antun Branko Šimić, Croatian and Bosnian-Herzegovinian poet (b. 1898)\n*1927 – Ernest Starling, English physiologist and academic (b. 1866)\n*1929 – Charalambos Tseroulis, Greek general and politician, Greek Minister for Military Affairs (b. 1879)\n*1941 – Penelope Delta, Greek author (b. 1874)\n*1945 – Martin Bormann, German politician (b. 1900)\n*  1945   – Joe Corbett, American baseball player and journalist (b. 1875)\n*1947 – Dorothea Binz, German SS officer (b. 1920)\n*1953 – Wallace Bryant, American archer (b. 1863)\n*1957 – Joseph McCarthy, American captain, lawyer, judge, and politician (b. 1908)\n*1963 – Ronald Barnes, 3rd Baron Gorell, English cricketer, peer, politician, poet, author and newspaper editor (b. 1884)\n*1964 – Nancy Astor, Viscountess Astor, American-English politician (b. 1879)\n*1969 – Franz von Papen, German general and politician, Chancellor of Germany (b. 1879)\n*1972 – J. Edgar Hoover, American 1st director of the Federal Bureau of Investigation (b. 1895)\n*1974 – James O. Richardson, American admiral (b. 1878)\n*1979 – Giulio Natta, Italian chemist and engineer, Nobel Prize laureate (b. 1903)\n*1980 – Clarrie Grimmett, New Zealand-Australian cricketer (b. 1891)\n*  1980   – George Pal, Hungarian-American animator and producer (b. 1908)\n*1983 – Norm Van Brocklin, American football player and coach (b. 1926)\n*1984 – Jack Barry, American game show host and producer, co-founded Barry & Enright Productions (b. 1918)\n*  1984   – Bob Clampett, American animator, director, and producer (b. 1913)\n*1985 – Attilio Bettega, Italian race car driver (b. 1951)\n*  1985   – Larry Clinton, American trumpet player and bandleader (b. 1909)\n*1986 – Sergio Cresto, American race car driver (b. 1956)\n*  1986   – Henri Toivonen, Finnish race car driver (b. 1956)\n*1989 – Veniamin Kaverin, Russian author (b. 1902)\n*  1989   – Giuseppe Siri, Italian cardinal (b. 1906)\n*1990 – David Rappaport, English-American actor (b. 1951)\n*1991 – Ronald McKie, Australian journalist and author (b. 1909)\n*1992 – Wilbur Mills, American lawyer and politician (b. 1909)\n*1993 – André Moynet, French race car driver, pilot, and politician (b. 1921)\n*1994 – Dorothy Marie Donnelly, American poet and author (b. 1903)\n*1995 – John Bunting, Australian public servant and diplomat, Australian High Commissioner to the United Kingdom (b. 1918)\n*  1995   – Michael Hordern, English actor (b. 1911)\n*1997 – John Eccles, Australian neurophysiologist and academic, Nobel Prize laureate (b. 1903)\n*  1997   – Paulo Freire, Brazilian philosopher and academic (b. 1921)\n*1998 – hide, Japanese singer-songwriter, guitarist, and producer (b. 1964)\n*  1998   – Justin Fashanu, English footballer (b. 1961)\n*  1998   – Gene Raymond, American actor (b. 1908)\n*1999 – Douglas Harkness, Canadian colonel and politician (b. 1903)\n*  1999   – Oliver Reed, English actor (b. 1938)\n*2002 – W. T. Tutte, English-Canadian mathematician and academic (b. 1917)\n*2005 – Wee Kim Wee, Singaporean journalist and politician, 4th President of Singapore (b. 1915)\n*2006 – Louis Rukeyser, American journalist and author (b. 1933)\n*2007 – Brad McGann, New Zealand director and screenwriter (b. 1964)\n*2008 – Beverlee McKinsey, American actress (b. 1940)\n*  2008   – Izold Pustõlnik, Ukrainian-Estonian astronomer and academic (b. 1938)\n*2009 – Marilyn French, American author and academic (b. 1929)\n*  2009   – Kiyoshiro Imawano, Japanese singer-songwriter, producer, and actor (b. 1951)\n*  2009   – Jack Kemp, American football player and politician, 9th United States Secretary of Housing and Urban Development (b. 1935)\n*2010 – Lynn Redgrave, English-American actress and singer (b. 1943)\n\n*2011 – Osama bin Laden, Saudi Arabian terrorist, founder of Al-Qaeda (b. 1957)\n*2012 – Fernando Lopes, Portuguese director and screenwriter (b. 1935)\n*  2012   – Tufan Miñnullin, Russian playwright and politician (b. 1936)\n*  2012   – Endang Rahayu Sedyaningsih, Indonesian physician and politician, Indonesian Minister of Health (b. 1955)\n*  2012   – Akira Tonomura, Japanese physicist, author, and academic (b. 1942)\n*2013 – Ernie Field, English boxer (b. 1943)\n*  2013   – Jeff Hanneman, American guitarist and songwriter (b. 1964)\n*  2013   – Joseph P. McFadden, American bishop (b. 1947)\n*  2013   – Dvora Omer, Israeli author and educator (b. 1932)\n*  2013   – Ivan Turina, Croatian footballer (b. 1980)\n*  2013   – Charles Banks Wilson, American painter and illustrator (b. 1918)\n*2014 – Tomás Balduino, Brazilian bishop (b. 1922)\n*  2014   – Žarko Petan, Slovenian director, playwright, and screenwriter (b. 1929)\n*  2014   – Efrem Zimbalist, Jr., American actor (b. 1918)\n*2015 – Stuart Archer, English colonel and architect (b. 1915)\n*  2015   – Michael Blake, American author and screenwriter (b. 1945)\n*  2015   – Guy Carawan, American singer and musicologist (b. 1927)\n*  2015   – Maya Plisetskaya, Russian-Lithuanian ballerina, choreographer, actress, and director (b. 1925)\n*  2015   – Ruth Rendell, English author (b. 1930)\n*2016 – Afeni Shakur, American music businesswoman, activist, and Black Panther (b. 1947)\n\nHolidays and observances\n\n* Christian feast day:\n** Athanasius of Alexandria (Western Christianity)\n** Boris I of Bulgaria (Bulgarian Orthodox Church)\n** Germanus of Normandy\n** Waldebert (Roman Catholic Church)\n** May 2 (Eastern Orthodox liturgics)\n* The last day of the Festival of Ridván (Bahá'í Faith) (Note that this date is non-Gregorian and may change according to the March equinox)\n* Anniversary of the Dos de Mayo Uprising (Community of Madrid, Spain)\n* Birth Anniversary of Third Druk Gyalpo (Bhutan)\n* Flag Day (Poland)\n* Indonesia National Education Day\n* Teachers' Day (Iran)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 2" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19349" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*1194 – King Richard I of England gives Portsmouth its first Royal Charter.\n*1230 – William de Braose is hanged by Prince Llywelyn the Great.\n*1335 – Otto the Merry, Duke of Austria, becomes Duke of Carinthia.\n*1536 – Anne Boleyn, Queen of England, is arrested and imprisoned on charges of adultery, incest, treason and witchcraft.\n*1559 – John Knox returns from exile to Scotland to become the leader of the nascent Scottish Reformation.\n*1568 – Mary, Queen of Scots, escapes from Loch Leven Castle.\n*1611 – The King James Version of the Bible is published for the first time in London, England, by printer Robert Barker.\n*1670 – King Charles II of England grants a permanent charter to the Hudson's Bay Company to open up the fur trade in North America.\n*1672 – John Maitland becomes Duke of Lauderdale and Earl of March.\n*1808 – Outbreak of the Peninsular War: The people of Madrid rise up in rebellion against French occupation. Francisco de Goya later memorializes this event in his painting The Second of May 1808.\n*1812 – The Siege of Cuautla during the Mexican War of Independence ends with both sides claiming victory after Mexican rebels under José María Morelos y Pavón abandon the city after 72 days under siege by royalist Spanish troops under Félix María Calleja.\n*1816 – Marriage of Léopold of Saxe-Coburg and Princess Charlotte of Wales.\n*1829 – After anchoring nearby, Captain Charles Fremantle of , declares the Swan River Colony in Australia.\n*1863 – American Civil War: Stonewall Jackson is wounded by friendly fire while returning to camp after reconnoitering during the Battle of Chancellorsville. He succumbs to pneumonia eight days later.\n*1866 – Peruvian defenders fight off the Spanish fleet at the Battle of Callao.\n*1876 – The April Uprising breaks out in Bulgaria.\n*1879 – The Spanish Socialist Workers' Party is founded in Madrid by Pablo Iglesias.\n*1885 – Cree and Assiniboine warriors win the Battle of Cut Knife, their largest victory over Canadian forces during the North-West Rebellion.\n*  1885   – The Congo Free State is established by King Léopold II of Belgium.\n*1889 – Menelik II, Emperor of Ethiopia, signs the Treaty of Wuchale, giving Italy control over Eritrea.\n*1906 – Closing ceremony of the Intercalated Games in Athens, Greece.\n*1918 – General Motors acquires the Chevrolet Motor Company of Delaware.\n*1920 – The first game of the Negro National League baseball is played in Indianapolis.\n*1933 – Gleichschaltung: Adolf Hitler bans trade unions.\n*1941 – Following the coup d'état against Iraq Crown Prince 'Abd al-Ilah earlier that year, the United Kingdom launches the Anglo-Iraqi War to restore him to power.\n*1945 – World War II: Fall of Berlin: The Soviet Union announces the capture of Berlin and Soviet soldiers hoist their red flag over the Reichstag building.\n*  1945   – World War II: Italian Campaign: General Heinrich von Vietinghoff signs the official instrument of surrender of all Wehrmacht forces in Italy.\n*  1945   – World War II: The US 82nd Airborne Division liberates Wöbbelin concentration camp finding 1000 dead prisoners, most of whom starved to death.\n*  1945   – World War II: A death march from Dachau to the Austrian border[http://www.gz-tm-dachau.de/img/uebersicht_big.jpg Todesmärsche Dachau memorial website's map page of KZ-Dachau death march] is halted by the segregated, all-Nisei 522nd Field Artillery Battalion of the U.S. Army in southern Bavaria, saving several hundred prisoners.[http://www.goforbroke.org/learn/history/combat_history/world_war_2/european_theater/central_europe_campaign.php CENTRAL EUROPE CAMPAIGN (March 22 - May 11, 1945) - The 522nd Field Artillery Battalion and the Dachau Subcamps, March 9 – May 11, 1945] \n*1952 – The world's first ever jet airliner, the De Havilland Comet 1 makes its maiden flight, from London to Johannesburg.\n*1955 – Tennessee Williams wins the Pulitzer Prize for Drama for Cat on a Hot Tin Roof.\n*1963 – Berthold Seliger launches a rocket with three stages and a maximum flight altitude of more than 100 kilometres near Cuxhaven. It is the only sounding rocket developed in Germany.\n*1964 – Vietnam War: An explosion sinks the American aircraft carrier  while it is docked at Saigon. A North Vietnamese frogman had placed a bomb on the ship. She is raised and returned to service less than seven months later.\n*  1964   – First ascent of Shishapangma the fourteenth highest mountain in the world and the lowest of the Eight-thousanders.\n*1969 – The British ocean liner Queen Elizabeth 2 departs on her maiden voyage to New York City.\n*1972 – In the early morning hours a fire breaks out at the Sunshine Mine located between Kellogg and Wallace, Idaho, killing 91 workers.\n*1982 – Falklands War: The British nuclear submarine  sinks the Argentine cruiser ARA General Belgrano.\n*1986 – Chernobyl disaster: The City of Chernobyl is evacuated six days after the disaster.\n*1989 – Hungary begins dismantling its border fence with Austria, which allows a number of East Germans to defect.\n*1994 – A bus crashes in Gdańsk, Poland killing 32 people.\n*1995 – During the Croatian War of Independence, the Army of the Republic of Serb Krajina fires cluster bombs at Zagreb, killing seven and wounding over 175 civilians.\n*1998 – The European Central Bank is founded in Brussels in order to define and execute the European Union's monetary policy.\n*1999 – Panamanian general election, 1999: Mireya Moscoso becomes the first woman to be elected President of Panama.\n*2000 – President Bill Clinton announces that accurate GPS access would no longer be restricted to the United States military.\n*2004 – The Yelwa massacre concludes. It began on 4 February 2004 when armed Muslims killed 78 Christians at Yelwa. In response, about 630 Muslims were killed by Christians on May 2nd.\n*2008 – Cyclone Nargis makes landfall in Burma killing over 138,000 people and leaving millions of people homeless.\n*  2008   – Chaitén Volcano begins erupting in Chile, forcing the evacuation of more than 4,500 people.\n*2011 – Osama bin Laden, the suspected mastermind behind the September 11 attacks and the FBI's most wanted man, is killed by the United States special forces in Abbottabad, Pakistan.\n*  2011   – An E. coli outbreak strikes Europe, mostly in Germany, leaving more than 30 people dead and many others sick from the bacteria outbreak.\n*  2011   – The 41st Canadian federal election is held, in which the governing Conservative Party, led by incumbent Prime Minister Stephen Harper, increases their number of seats from a minority to a majority.\n*2012 – A pastel version of The Scream, by Norwegian painter Edvard Munch, sells for $120 million in a New York City auction, setting a new world record for a work of art at auction.\n*2014 – Two mudslides in Badakhshan, Afghanistan, leave up to 2,500 people missing.\n\nBirths\n\n*1360 – Yongle Emperor of China (d. 1424)\n*1402 – Eleanor of Aragon, Queen of Portugal (d. 1445)\n*1451 – René II, Duke of Lorraine (d. 1508)\n*1458 – Eleanor of Viseu (d. 1525)\n*1476 – Charles I, Duke of Münsterberg-Oels, Count of Kladsko, Governor of Bohemia and Silesia (d. 1536)\n*1533 – Philip II, Duke of Brunswick-Grubenhagen (d. 1596)\n*1551 – William Camden, English historian and topographer (d. 1623)\n*1567 – Sebald de Weert, Dutch captain, vice-admiral of the Dutch East India Company (d. 1603)\n*1579 – Tokugawa Hidetada, Japanese shogun (d. 1632)\n*1601 – Athanasius Kircher, German priest and scholar (d. 1680)\n*1660 – Alessandro Scarlatti, Italian composer (d. 1725)\n*1695 – Giovanni Niccolò Servandoni, Italian-French painter and architect (d. 1766)\n*1702 – Friedrich Christoph Oetinger, German theologian and theosopher (d. 1782)\n*1707 – Jean-Baptiste Barrière, French cellist and composer (d. 1747)\n*1729 – Catherine the Great of Russia (d. 1796)\n*1737 – William Petty, 2nd Earl of Shelburne, Irish-English politician, Prime Minister of the United Kingdom (d. 1805)\n*1740 – Elias Boudinot, American lawyer and politician, 10th President of the Continental Congress (d. 1821)\n*1750 – John André, English soldier and spy (d. 1780)\n*1752 – Ludwig August Lebrun, German oboe player and composer (d. 1790)\n*1754 – Vicente Martín y Soler, Spanish composer (d. 1806)\n*1772 – Novalis, German author and poet (d. 1801)\n*1773 – Henrik Steffens, Norwegian philosopher and poet (d. 1845)\n*1797 – Abraham Pineo Gesner, Canadian physician and geologist (d. 1864)\n*1802 – Heinrich Gustav Magnus, German chemist and physicist (d. 1870)\n*1806 – Catherine Labouré, French nun and saint (d. 1876)\n*1810 – Hans Christian Lumbye, Danish composer and conductor (d. 1874)\n*1815 – William Buell Richards, Canadian lawyer and judge, 1st Chief Justice of Canada (d. 1889)\n*1828 – Désiré Charnay, French archaeologist and photographer (d. 1915)\n*1830 – Otto Staudinger, German entomologist and author (d. 1900)\n*1843 – Elijah McCoy, Canadian-American engineer (d. 1929)\n*1859 – Jerome K. Jerome, English author and playwright (d. 1927)\n*1860 – John Scott Haldane, Scottish physiologist, physician, and academic (d. 1936)\n*  1860   – Theodor Herzl, Austro-Hungarian zionist philosopher, journalist and author (d. 1904)\n*1865 – Clyde Fitch, American playwright (d. 1909)\n*1867 – Giuseppe Morello, Italian-American mobster (d. 1930)\n*1873 – Jurgis Baltrušaitis, Lithuanian poet, critic, and translator (d. 1944)\n*1879 – James F. Byrnes, American stenographer and politician, 49th United States Secretary of State (d. 1972)\n*1880 – Bill Horr, American football player, discus thrower, and coach (d. 1955)\n*1881 – Alexander Kerensky, Russian lawyer and politician, 10th Prime Minister of Russia (d. 1970)\n*1882 – Isabel González, Puerto Rican activist who helped pave the way for Puerto Ricans' American citizenship (d. 1971)\n*1885 – Hedda Hopper, American actress and gossip columnist (d. 1966)\n*1886 – Gottfried Benn, German author and poet (d. 1956)\n*1887 – Vernon Castle, English-American dancer (d. 1918)\n*  1887   – Eddie Collins, American baseball player and manager (d. 1951)\n*1889 – Ki Hajar Dewantara, Indonesian philosopher, academic, and politician (d. 1959)\n*1890 – E. E. Smith, American engineer and author (d. 1965)\n*1892 – Manfred von Richthofen, German captain and pilot (d. 1918)\n*1894 – Joseph Henry Woodger, English biologist, philosopher, and academic (d. 1981)\n*1895 – Lorenz Hart, American playwright and lyricist (d. 1943)\n*1897 – John Frederick Coots, American songwriter (d. 1985)\n*1898 – Henry Hall, English bandleader, composer, and actor (d. 1989)\n*1901 – Bob Wyatt, English cricketer (d. 1995)\n*1902 – Brian Aherne, English actor (d. 1986)\n*1903 – Benjamin Spock, American rower, pediatrician, and author (d. 1998)\n*1904 – Bill Brandt, German-English photographer and journalist (d. 1983)\n*1906 – Philippe Halsman, Latvian-American photographer (d. 1979)\n*1907 – Pinky Lee, American comedian and television host (d. 1993)\n*1910 – Alexander Bonnyman, Jr., American lieutenant, Medal of Honor recipient (d. 1943)\n*1912 – Axel Springer, German journalist and publisher, founded Axel Springer AG (d. 1985)\n*1913 – Pietro Frua, Italian coachbuilders and car designers (d. 1983)\n*  1913   – Nigel Patrick, English actor and director (d. 1981)\n*  1913   – Aydın Sayılı, Turkish historian and academic (d. 1993)\n*1915 – Doris Fisher, American singer-songwriter (d. 2003)\n*  1915   – Peggy Mount, English actress (d. 2001)\n*1917 – Albert Castelyns, Belgian water polo player and bobsledder\n*  1917   – Văn Tiến Dũng, Vietnamese general and politician, 6th Minister of Defence for Vietnam (d. 2002)\n*1920 – Jean-Marie Auberson, Swiss violinist and conductor (d. 2004)\n*  1920   – Otto Buchsbaum, Austrian-Brazilian journalist and activist (d. 2000)\n*  1920   – Vasantrao Deshpande, Indian singer and sitar player (d. 1983)\n*  1920   – Guinn Smith, American pole vaulter, soldier, and pilot (d. 2004)\n*1921 – Satyajit Ray, Indian director, producer, and screenwriter (d. 1992)\n*1922 – Roscoe Lee Browne, American actor and director (d. 2007)\n*  1922   – A. M. Rosenthal, Canadian-born American journalist and author (d. 2006)\n*1923 – Patrick Hillery, Irish physician and politician, 6th President of Ireland (d. 2008)\n*1924 – Jamal Abro, Pakistani lawyer and author (d. 2004)\n*  1924   – Theodore Bikel, Austrian-American singer-songwriter, guitarist, and actor (d. 2015)\n*  1924   – Hugh Cortazzi, English soldier, historian, and diplomat, British Ambassador to Japan\n*1925 – John Neville, English-Canadian actor (d. 2011)\n*1926 – Gérard D. Levesque, Canadian lawyer and politician, 5th Deputy Premier of Quebec (d. 1993)\n*1927 – Ray Barrett, Australian actor and singer (d. 2009)\n*1927 – Amos Kenan, Israeli columnist, painter, sculptor, playwright and novelist (d. 2009)\n*1928 – Hans Trass, Estonian ecologist and botanist (d. 2017)\n*1929 – Édouard Balladur, Turkish-French economist and politician, 162nd Prime Minister of France\n*  1929   – James Dillion, American discus thrower (d. 2010)\n*  1929   – Link Wray, American singer-songwriter and guitarist (d. 2005)\n*1930 – Yoram Kaniuk, Israeli painter and critic (d. 2013)\n*  1930   – Marco Pannella, Italian journalist and politician (d. 2016)\n*1931 – Phil Bruns, American actor and stuntman (d. 2012)\n*  1931   – Martha Grimes, American author and poet\n*1932 – Maury Allen, American journalist, actor, and author (d. 2010)\n*1933 – Bunk Gardner, American musician\n*  1933   – Harry Woolf, Baron Woolf, English lawyer and judge, Lord Chief Justice of England and Wales\n*1935 – Luis Suárez Miramontes, Spanish footballer and manager\n*1935 – Faisal II of Iraq, the last King of Iraq (d.1958)\n*1936 – Norma Aleandro, Argentinian actress, director, and screenwriter\n*  1936   – Engelbert Humperdinck, English singer and pianist\n*  1936   – Michael Rabin, American violinist (d. 1972)\n*1937 – Klaus Enders, German motorcycle sidecar racer\n*  1937   – Lorenzo Music, American actor, producer, and screenwriter (d. 2001)\n*1938 – Moshoeshoe II of Lesotho (d. 1996)\n*1939 – Sumio Iijima, Japanese physicist and engineer\n*1941 – Tony Adamowicz, American race car driver\n*  1941   – Bruce Cameron, Scottish bishop\n*  1941   – Clay Carroll, American baseball player\n*1942 – Jacques Rogge, Belgian businessman\n*1944 – Robert G. W. Anderson, English chemist, historian, and curator\n*1945 – Randy Cain, American soul singer (d. 2009)\n*  1945   – Judge Dread, English singer-songwriter (d. 1998)\n*  1945   – Bianca Jagger, Nicaraguan-American model, actress, and activist\n*  1945   – Goldy McJohn, Canadian keyboard player \n*1946 – Peter L. Benson, American psychologist and academic (d. 2011)\n*  1946   – Lesley Gore, American singer-songwriter (d. 2015)\n*  1946   – David Suchet, English actor \n*1947 – James Dyson, English businessman, founded the Dyson Company\n*  1947   – Lynda Myles, English screenwriter and producer\n*1948 – Larry Gatlin, American singer-songwriter, guitarist, and actor\n*1949 – Alan Titchmarsh, English gardener and author\n*1950 – Simon Gaskell, English chemist and academic\n*  1950   – Duncan Gay, Australian businessman and politician\n*  1950   – Lou Gramm, American singer-songwriter\n*  1950   – Richard Ground, English lawyer and judge (d. 2014)\n*1951 – John Glascock, English singer and bass player (d. 1979)\n*1952 – Chris Anderson, Australian rugby league player and coach\n*  1952   – Christine Baranski, American actress and singer\n*  1952   – Isla St Clair, Scottish singer and actress\n*1953 – Valery Gergiev, Russian conductor and director\n*1954 – Elliot Goldenthal, American composer and conductor\n*  1954   – Dawn Primarolo, English politician\n*  1954   – Stephen Venables, English mountaineer and author\n*1955 – Donatella Versace, Italian fashion designer\n*1956 – Régis Labeaume, Canadian businessman and politician, 41st Mayor of Quebec City\n*1958 – Yasushi Akimoto, Japanese songwriter and producer\n*  1958   – Stanislav Levý, Czech footballer and manager\n*  1958   – David O'Leary, English-Irish footballer and manager\n*1959 – Alan Best, Canadian animator, director, and producer\n*  1959   – Tony Wakeford, English singer-songwriter and guitarist \n*1960 – Stephen Daldry, English director and producer\n*1961 – Steve James, English snooker player\n*  1961   – Sophie Thibault, Canadian journalist\n*  1961   – Phil Vickery, English chef and author\n*1962 – Elizabeth Berridge, American actress\n*  1962   – Michael Grandage, English director and producer\n*  1962   – Jimmy White, English snooker player\n*1965 – Félix José, Dominican-American baseball player\n*1966 – Uwe Freiler, German footballer\n*  1966   – Margus Kolga, Estonian diplomat\n*  1966   – Belinda Stronach, Canadian businesswoman, philanthropist, and politician\n*1967 – Bengt Åkerblom, Swedish ice hockey player (d. 1995)\n*  1967   – Mika Brzezinski, American journalist and author\n*  1967   – David Rocastle, English footballer (d. 2001)\n*1968 – Jeff Agoos, Swiss-American soccer player, manager, and sportscaster\n*  1968   – Julia Hartley-Brewer, English broadcaster and columnist\n*  1968   – Ziana Zain, Malaysian singer-songwriter and actress\n*1969 – Brian Lara, Trinidadian cricketer\n*1970 – Marco Walker, Swiss footballer and coach\n*1971 – Musashimaru Kōyō, Samoan-American sumo wrestler, the 67th Yokozuna\n*  1971   – Fatima Yusuf, Nigerian sprinter\n*1972 – Paul Adcock, English footballer\n*  1972   – Ahti Heinla, Estonian programmer and businessman, co-developed Skype\n*  1972   – Dwayne Johnson, American-Canadian wrestler, actor, and producer\n*1973 – Florian Henckel von Donnersmarck, German director and screenwriter\n*1974 – Horacio Carbonari, Argentinian footballer and manager\n*  1974   – Andy Johnson, English-Welsh footballer\n*  1974   – Janek Meet, Estonian footballer\n*1975 – David Beckham, English footballer, coach, and model\n*1976 – Jeff Gutt, American singer-songwriter \n*1977 – Brian Cardinal, American basketball player\n*  1977   – Jan Fitschen, German runner\n*  1977   – Luke Hudson, American baseball player\n*  1977   – Fredrik Malm, Swedish journalist and politician\n*  1977   – Jenna von Oÿ, American actress and singer\n*  1977   – Kalle Palander, Finnish skier\n*1978 – Melvin Ely, American basketball player\n*  1978   – Mike Weaver, Canadian ice hockey player\n*1979 – Jason Chimera, Canadian ice hockey player\n*  1979   – Ioannis Kanotidis, Greek footballer\n*1980 – Tim Borowski, German footballer\n*  1980   – Pierre-Luc Gagnon, Canadian skateboarder\n*  1980   – Ellie Kemper, American actress, comedian and writer\n*  1980   – Zat Knight, English footballer\n*  1980   – Artūras Masiulis, Lithuanian basketball player\n*  1980   – Troy Murphy, American basketball player\n*  1980   – Lassaâd Ouertani, Tunisian footballer (d. 2013)\n*  1980   – Brad Richards, Canadian ice hockey player\n*1981 – Robert Buckley, American actor\n*  1981   – Chris Kirkland, English footballer\n*  1981   – Tiago Mendes, Portuguese footballer\n*  1981   – Matt Murray, English footballer\n*  1981   – Rina Satō, Japanese voice actress and singer\n*1982 – Timothy Benjamin, Welsh sprinter\n*  1982   – Johan Botha, South African cricketer\n*1983 – Alessandro Diamanti, Italian footballer\n*  1983   – Maynor Figueroa, Honduran footballer \n*  1983   – Tina Maze, Slovenian skier\n*  1983   – Daniel Sordo, Spanish race car driver\n*  1983   – Ove Vanebo, Norwegian politician\n*1984 – Saulius Mikoliūnas, Lithuanian footballer\n*  1984   – Thabo Sefolosha, Swiss basketball player\n*1985 – Lily Allen, English singer-songwriter and actress\n*  1985   – Kyle Busch, American race car driver\n*  1985   – Ashley Harkleroad, American tennis player\n*  1985   – Sarah Hughes, American figure skater\n*  1985   – David Nugent, English footballer\n*1987 – Nana Kitade, Japanese singer-songwriter and actress \n*  1987   – Pat McAfee, American football player\n*  1987   – Kris Russell, Canadian ice hockey player\n*1988 – Neftalí Feliz, Dominican baseball player\n*  1988   – Stephen Henderson, Irish footballer\n*1989 – Jeanette Pohlen, American basketball player\n*1990 – Paul George, American basketball player\n*1991 – Jeong Jinwoon, South Korean actor and singer (2AM)\n*1992 – Sunmi, South Korean singer (Wonder Girls)\n*  1992   – María Teresa Torró Flor, Spanish tennis player\n*1993 – Owain Doull, Welsh track cyclist\n*  1993   – Isyana Sarasvati, Indonesian singer\n*  1993   – Huang Zitao, Chinese singer & rapper, former member of boy band EXO\n*1997 – BamBam, Thai singer and rapper (Got7)\n*2015 – Princess Charlotte of Cambridge, British royal, and fourth in line to the British throne\n\nDeaths\n\n* 373 – Athanasius of Alexandria, Egyptian bishop and saint (b. 298)\n* 649 – Marutha of Tikrit, Persian theologian  of the Syriac Orthodox Church (b. 565)\n* 821 – Liu Zong, general of the Tang Dynasty\n* 907 – Boris I of Bulgaria\n*1219 – Leo I, King of Armenia (b. 1150)\n*1230 – William de Braose, English son of Reginald de Braose (b. 1197)\n*1293 – Meir of Rothenburg, German rabbi (b. c.1215)\n*1300 – Blanche of Artois (b. 1248)\n*1450 – William de la Pole, 1st Duke of Suffolk, English admiral (b. 1396)\n*1519 – Leonardo da Vinci, Italian painter, sculptor, and architect (b. 1452)\n*1564 – Rodolfo Pio da Carpi, Italian cardinal (b. 1500)\n*1627 – Lodovico Grossi da Viadana, Italian composer and educator (b. 1560)\n*1667 – George Wither, English poet and author (b. 1588)\n*1683 – Stjepan Gradić, Croatian philosopher and mathematician (b. 1613)\n*1711 – Laurence Hyde, 1st Earl of Rochester, English politician, First Lord of the Treasury (b. 1641)\n*1799 – Juan Vicente de Güemes, 2nd Count of Revillagigedo (b. 1740)\n*1802 – Herman Willem Daendels, Dutch general and politician, Governor-General of the Dutch Gold Coast (b. 1762)\n*1810 – Henry Jerome de Salis, English priest (b. 1740)\n*1819 – Mary Moser, English painter and academic (b. 1744)\n*1857 – Alfred de Musset, French dramatist, poet, and novelist  (b. 1810)\n*1864 – Giacomo Meyerbeer, German composer and educator (b. 1791)\n*1880 – Eberhard Anheuser, German-American businessman, co-founded Anheuser-Busch (b. 1805)\n*  1880   – Tom Wills, Australian cricketer, co-created Australian rules football (b. 1835)\n*1885 – Terézia Zakoucs, Hungarian-Slovene author (b. 1817)\n*1915 – Clara Immerwahr, German chemist (b. 1870)\n*1918 – Jüri Vilms, Estonian lawyer and politician (b. 1889)\n*1925 – Antun Branko Šimić, Croatian and Bosnian-Herzegovinian poet (b. 1898)\n*1927 – Ernest Starling, English physiologist and academic (b. 1866)\n*1929 – Charalambos Tseroulis, Greek general and politician, Greek Minister for Military Affairs (b. 1879)\n*1941 – Penelope Delta, Greek author (b. 1874)\n*1945 – Martin Bormann, German politician (b. 1900)\n*  1945   – Joe Corbett, American baseball player and journalist (b. 1875)\n*1947 – Dorothea Binz, German SS officer (b. 1920)\n*1953 – Wallace Bryant, American archer (b. 1863)\n*1957 – Joseph McCarthy, American captain, lawyer, judge, and politician (b. 1908)\n*1963 – Ronald Barnes, 3rd Baron Gorell, English cricketer, peer, politician, poet, author and newspaper editor (b. 1884)\n*1964 – Nancy Astor, Viscountess Astor, American-English politician (b. 1879)\n*1969 – Franz von Papen, German general and politician, Chancellor of Germany (b. 1879)\n*1972 – J. Edgar Hoover, American 1st director of the Federal Bureau of Investigation (b. 1895)\n*1974 – James O. Richardson, American admiral (b. 1878)\n*1979 – Giulio Natta, Italian chemist and engineer, Nobel Prize laureate (b. 1903)\n*1980 – Clarrie Grimmett, New Zealand-Australian cricketer (b. 1891)\n*  1980   – George Pal, Hungarian-American animator and producer (b. 1908)\n*1983 – Norm Van Brocklin, American football player and coach (b. 1926)\n*1984 – Jack Barry, American game show host and producer, co-founded Barry & Enright Productions (b. 1918)\n*  1984   – Bob Clampett, American animator, director, and producer (b. 1913)\n*1985 – Attilio Bettega, Italian race car driver (b. 1951)\n*  1985   – Larry Clinton, American trumpet player and bandleader (b. 1909)\n*1986 – Sergio Cresto, American race car driver (b. 1956)\n*  1986   – Henri Toivonen, Finnish race car driver (b. 1956)\n*1989 – Veniamin Kaverin, Russian author (b. 1902)\n*  1989   – Giuseppe Siri, Italian cardinal (b. 1906)\n*1990 – David Rappaport, English-American actor (b. 1951)\n*1991 – Ronald McKie, Australian journalist and author (b. 1909)\n*1992 – Wilbur Mills, American lawyer and politician (b. 1909)\n*1993 – André Moynet, French race car driver, pilot, and politician (b. 1921)\n*1994 – Dorothy Marie Donnelly, American poet and author (b. 1903)\n*1995 – John Bunting, Australian public servant and diplomat, Australian High Commissioner to the United Kingdom (b. 1918)\n*  1995   – Michael Hordern, English actor (b. 1911)\n*1997 – John Eccles, Australian neurophysiologist and academic, Nobel Prize laureate (b. 1903)\n*  1997   – Paulo Freire, Brazilian philosopher and academic (b. 1921)\n*1998 – hide, Japanese singer-songwriter, guitarist, and producer (b. 1964)\n*  1998   – Justin Fashanu, English footballer (b. 1961)\n*  1998   – Gene Raymond, American actor (b. 1908)\n*1999 – Douglas Harkness, Canadian colonel and politician (b. 1903)\n*  1999   – Oliver Reed, English actor (b. 1938)\n*2002 – W. T. Tutte, English-Canadian mathematician and academic (b. 1917)\n*2005 – Wee Kim Wee, Singaporean journalist and politician, 4th President of Singapore (b. 1915)\n*2006 – Louis Rukeyser, American journalist and author (b. 1933)\n*2007 – Brad McGann, New Zealand director and screenwriter (b. 1964)\n*2008 – Beverlee McKinsey, American actress (b. 1940)\n*  2008   – Izold Pustõlnik, Ukrainian-Estonian astronomer and academic (b. 1938)\n*2009 – Marilyn French, American author and academic (b. 1929)\n*  2009   – Kiyoshiro Imawano, Japanese singer-songwriter, producer, and actor (b. 1951)\n*  2009   – Jack Kemp, American football player and politician, 9th United States Secretary of Housing and Urban Development (b. 1935)\n*2010 – Lynn Redgrave, English-American actress and singer (b. 1943)\n\n*2011 – Osama bin Laden, Saudi Arabian terrorist, founder of Al-Qaeda (b. 1957)\n*2012 – Fernando Lopes, Portuguese director and screenwriter (b. 1935)\n*  2012   – Tufan Miñnullin, Russian playwright and politician (b. 1936)\n*  2012   – Endang Rahayu Sedyaningsih, Indonesian physician and politician, Indonesian Minister of Health (b. 1955)\n*  2012   – Akira Tonomura, Japanese physicist, author, and academic (b. 1942)\n*2013 – Ernie Field, English boxer (b. 1943)\n*  2013   – Jeff Hanneman, American guitarist and songwriter (b. 1964)\n*  2013   – Joseph P. McFadden, American bishop (b. 1947)\n*  2013   – Dvora Omer, Israeli author and educator (b. 1932)\n*  2013   – Ivan Turina, Croatian footballer (b. 1980)\n*  2013   – Charles Banks Wilson, American painter and illustrator (b. 1918)\n*2014 – Tomás Balduino, Brazilian bishop (b. 1922)\n*  2014   – Žarko Petan, Slovenian director, playwright, and screenwriter (b. 1929)\n*  2014   – Efrem Zimbalist, Jr., American actor (b. 1918)\n*2015 – Stuart Archer, English colonel and architect (b. 1915)\n*  2015   – Michael Blake, American author and screenwriter (b. 1945)\n*  2015   – Guy Carawan, American singer and musicologist (b. 1927)\n*  2015   – Maya Plisetskaya, Russian-Lithuanian ballerina, choreographer, actress, and director (b. 1925)\n*  2015   – Ruth Rendell, English author (b. 1930)\n*2016 – Afeni Shakur, American music businesswoman, activist, and Black Panther (b. 1947)\n\nHolidays and observances\n\n* Christian feast day:\n** Athanasius of Alexandria (Western Christianity)\n** Boris I of Bulgaria (Bulgarian Orthodox Church)\n** Germanus of Normandy\n** Waldebert (Roman Catholic Church)\n** May 2 (Eastern Orthodox liturgics)\n* The last day of the Festival of Ridván (Bahá'í Faith) (Note that this date is non-Gregorian and may change according to the March equinox)\n* Anniversary of the Dos de Mayo Uprising (Community of Madrid, Spain)\n* Birth Anniversary of Third Druk Gyalpo (Bhutan)\n* Flag Day (Poland)\n* Indonesia National Education Day\n* Teachers' Day (Iran). May 2. http://en.wikipedia.org/?curid=19349."
  }
}
