{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6966",
  "eid" : "df03d720-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778453906,
  "textBody" : "The traditional Chinese calendar is a lunisolar calendar which reckons years, months and days according to astronomical phenomena. , the Chinese calendar is defined by GB/T 33661-2017 Calculation and promulgation of the Chinese calendar, which the Standardization Administration of China issued on May 12, 2017.\n\nThe Chinese calendar governs traditional activities in China and in overseas-Chinese communities. It depicts and lists the dates of traditional Chinese holidays, and guides Chinese people in selecting the most auspicious days for weddings, funerals, moving, or beginning a business.\n\nIn the Chinese calendar the days begin and end at midnight. The months begin on the day with the dark (new) moon. The years begin with the dark moon near the midpoint between winter solstice and spring equinox. The solar terms are the important components of the Chinese calendar. In a month there are one to three solar terms.\n\nThe currently used traditional Chinese calendar represents the end result of centuries of evolution. Ancient scientists added many astronomical and seasonal factors, and people can reckon the timing of natural phenomena such as the moon phase and tides based on the Chinese calendar. The Chinese calendar has over 100 variants, whose characteristics reflect the calendar's evolutionary path. As with Chinese characters, different variants are used in different parts of the Chinese cultural sphere.\n\nKorea, Vietnam, and the Ryukyu Islands adopted the Chinese calendar completely - it evolved into Korean, Ryukyuan, and Vietnamese calendars, with the main difference being the use of different meridians, which leads to some astronomical events falling on different dates in different countries. Thus the same event may occasionally be assigned a different date in each of those calendars. The traditional Japanese calendar also derived from the Chinese calendar, based on a Japanese meridian, however its official use in Japan was abolished in the early 20th century and its usage has mostly disappeared since then. Calendars in Mongolia and Tibet have absorbed elements from the Chinese calendar and elements from other systems, but they are not direct descendants of the Chinese calendar.\n\nThe official calendar in China is the Gregorian calendar, but the traditional Chinese calendar still plays an important role there. The Chinese calendar is known officially as the Rural Calendar (),\nbut is often referred to by other names, such as the Former Calendar (), the Traditional Calendar (), or the Lunar Calendar (). The Chinese calendar preserves traditional  East Asian culture, and is the root to many other East Asian calendars.\n\nAlthough the solar term governs the month sequences of the traditional Chinese calendar, it is not an agricultural calendar.\n\nIn ancient China the calendars marked the name/stem – branch of the year, month names, month length flags (大/小=Long/Short), the stems of 1/11/21 (1/11/21 of each month are same in stem, use a character), the branches of 1/11/21, and the date/stem-branch/time of the solar terms in the month.\n\nStructure \n\nGeneral \n\nThe calendar has a year, month and date frame. The key elements are the day, synodic month and solar year. The Chinese calendar is a lunisolar calendar, similar to the Hindu and Hebrew calendars.\n\nElements:\n* day, the time based on the earth's rotation. In the Chinese calendar, a day starts from midnight.\n* month, the time is based on the obliquity of the moon path. In the Chinese calendar, a month starts from the dark moon. A month is about 29 17/32 days.\n* date, the day number in a month. Days are numbered in sequence from 1 to 29 or 30.\n* year, the time based on the earth's revolution. In the Chinese calendar, a year starts from the vernal commence (or the winter solstice). A year is about 365 31/128 days.\n* zodiac, 1/12 year, 30° ecliptic. A zodiac is about 30 7/16 days. The zodiac in the Chinese calendar is 45° away from the zodiac in the Babylon system.\n*solar term, 1/24 year, 15° ecliptic, a unique concept of monthing method in the Chinese calendar. A solar term is about 15 7/32 days. \n* calendric month, the month numbering in a year. The months are numbered according to the zodiac number; some months may be repeated. \n* calendric year, the year for the calendric purpose (in culture or religion). In the Chinese calendar, the calendric year starts from the nearest day of the dark moon to the vernal commences. A calendric year is 353/354/355 or 383/384/385 days.\n\n7 Luminaries, Big Dipper, 3 Enclosures, 28 Mansions \n\nThe movements of the Sun, the Moon, Mercury, Venus, Mars, Jupiter, and Saturn are the key references for calendar calculations. These are known as the seven luminaries. \n* The distance between Mercury and the sun is within 30°, which is the sun's height at chenshi, so Mercury is called the \"chen star\" ().\n* Venus appears at dawn and dusk, so the Venus is called the \"bright star\" () or \"long star\" (). \n* Mars looks like fire and occurs irregularly, so Mars is called the \"fire star\" (). Mars is in charge of punishment in Chinese culture. When Mars is close to Antares (), it is a sign of bad luck and can forebode the death of the emperor or the ousting of the chancellor. \n* The period of Jupiter's revolution is about 11.86 years, so Jupiter is called the \"age star\" (), since 30° of Jupiter's revolution is about a year on Earth.  \n* The period of Saturn's revolution is about 28 years, so Saturn is called the \"guard star\" (). This means that Saturn guards one of the 28 mansions every year.   \n\nThe Big Dipper is regarded as the compass in the sky, and the handle's direction decides the season and solar month.\n\nThe stars are divided into Three Enclosures and 28 Mansions according to their locations in the sky relative to Ursa Minor at the centre. Each mansion is named with a character that describes the shape of the principal asterism it contains.\n* Central (Three Enclosures): Purple Forbidden (), Supreme Palace (), Heavenly Market ()\n* Eastern mansions: 角, 亢, 氐, 房, 心, 尾, 箕; Southern mansions: 井, 鬼, 柳, 星, 张, 翼, 轸; Western mansions: 奎, 娄, 胃, 昴, 毕, 参, 觜; Northern mansions: 斗, 牛, 女, 虚, 危, 室, 壁\nThe moon moves about one mansion per day; the 28 mansions are thus used to count days too. In the Tang Dynasty, Yuan Tiangang () matched the 28 mansions, seven luminaries and yearly animal signs, yielding combinations such as “horn-wood-flood dragon” ().\n\nCodes \n\nSeveral coding systems are used for some special circumstances in order to avoid ambiguity, such as continuous day or year count. \n* The heavenly stems is a decimal system.\n* The earthly branches is a duodecimal system. The earthly branches are used to mark the shí and climate terms usually.\n* There's a different pattern for earthly branches, which is called as 12 characters of jian, chu and others (). The 12 characters sequence from the first day with the same branch as the month (first Yinri of Zheng, first Maori of Ery, ...). The 12 characters must be used to count the days of the solar month.        \n* The stem-branches is a sexagesimal system. The heavenly stems and earthly branches match together and form stem-branches. The stem-branches are used to mark the continuous day and year.\n* The stem-branches order may calculate with the stems order and branches order. sb=6s-5b (if less than 10, add 50)\n* The unit digit of the stem-branches order  is the stems order; the unit digit minus twice the tens digit is the branches order (if less than 2, add 10) \n* The five phases are used to match the stems, branches, and stem-branches. And the Yin-yang are used to match the  stems, branches, and stem-branches too, odd-yang, even-yin.\n\nTime system\n\nIn Modern China, people use the Western hour-minute-second system to divide time. In Ancient China, people used the shi-ke system to divide the time during the day and the geng-dian system to divide the time during the night.. For example:\n:The Chinese standard time is , or  ().\nIn the Chinese calendar, the day begins at midnight and ends at the next midnight, but people tend to regard the days as beginning at dawn.\n*24 hours system\nIn Han Dynasty, a day is divided into 24 hours, and the 15 active o'clocks (6:00-20:00) are named as: dawn (晨明), daybreak (朏明), morning (旦明), earlier breakfast (蚤食), later breakfast (宴食), ante noon (隅中), noon (正中), short shadow (少还), drum time (铺时), long shadow (大还), higher setting (高舂), lower setting(下舂), sunset (县东), dusk (黄昏), rest time (定昏)\n*shi-ke system\nA day is divided into 100 centidays by kes (the scales), or into 12 dual-hours by 12 shis, which are named with 12 earthly branches.\n:In the earlier stage, the time expression is sss initial, sss 1 ke,..., sss 8 ke, such as wush 3 ke (the third ke after wush)\n:After Tang dynasty, the time expression is a.sss initial, a.sss 1 ke,..., a.sss 4 ke, p.sss initial, p.sss 1 ke,..., p.sss 4 ke, such as a.wush 3 ke (the third ke of wush), p.yinsh 4 ke (the fourth ke after yinsh)\n:For the calendar convenience, A day is divided into 6000 fens. 1 centiday 60 fens, 1 fen \n 14.4 seconds. \n*geng-dian system\nA day is divided into 10 decidays by gengs (The midnight is sang, and each deciday is divided by 5 dians (points).\n:The time expression is ggg, ggg 1 point,..., ggg 5 point, such as sang 2 point (the second point after sang).\nAmong a year, the night length is inconstant. At 35°N, it is about 60% at the winter solstice, and about 40% at the summer solstice. So, the night gengs starts from a time between dawn and yig, and end at a time between wug and morn\n*16-parts system\nAt pre-Qin and Qin-Han, a day was divided into 16 parts from the cock time (3:00; 4:15 / sig 1 point 50 fen). The 16-parts system is established for calendar convenience, for:\nA season is about 91 days and 5 parts, and a solar month is about 30 days and 7 parts.\nA couple of months is about 59 days and a part.\n\nWeek\n\nThe Chinese appear to have adopted the seven-day week from the Hellenistic system by the 4th century, although by which route is not entirely clear. It was again transmitted to China in the 8th century by Manichaeans, via the country of Kang (a Central Asian polity near Samarkand).The Chinese encyclopaedia  Cihai (辞海) under the entry for \"seven luminaries calendar\" (七曜历/七曜曆, qī yào lì) has:\n\"method of recording days according to the seven luminaries [七曜 qī yào]. China normally observes the following order: Sun, Mon, Mars, Mercury, Jupiter, Venus, and Saturn. Seven days make one week, which is repeated in a cycle. Originated in ancient Babylon (or ancient Egypt according to one theory). Used by the Romans at the time of the 1st century AD, later transmitted to other countries. This method existed in China in the 4th century. It was also transmitted to China by Manichaeans in the 8th century from the country of Kang (康) in Central Asia.\" (translation after [http://www.cjvlang.com/Dow/dowjpn.html Bathrobe's Days of the Week in Chinese, Japanese & Vietnamese, plus Mongolian and Buryat] (cjvlang.com) It is the most predominantly used system in modern China.\n\nOther than the seven-day week system, in ancient China, the days were grouped into 10-day weeks with the stems, 12-day weeks with the branches, or 9/10-day weeks () with the date in the month.\n\nThe ten-day week was used in antiquity (reportedly as early as in the Bronze Age Xia dynasty).\n In modern time, it is still used in counting special days including Three Fu Days ().http://www.hko.gov.hk/education/edu01met/exobs/folklore/ele_hs_c.htm\n\nThe law during the Han dynasty (206 BC – AD 220) required officials of the empire to rest every five days, called mu (沐), while it was changed into 10 days in the Tang dynasty (AD 618 – 907), called huan (澣/浣) or xún (旬).\n\nMonths were almost three weeks long (alternating 29 and 30 days to keep in line with the lunation). As a practice, the months are divided into 3 xún. The first 10 days is the early xún (), the middle 10 days is the mid xún (), and the last 9 or 10 days is the late xún ().\n\nMarkets in Japan followed the Chinese jun (旬) system; see Japanese calendar. In Korea, it was called \"Sun\" (순,旬).\n\nIn winter, there is also a 9-day cycle counting start from the winter solstice, which would last for 9 cycles until 81 days later when it is deemed as the end of winter.http://www.epochtimes.com/b5/14/12/26/n4327438.htm\n\nMonth\n\nMonth is the time between the dark moon. In the early days, the month length was estimated, and balanced. In general, 12-months-cycles and 13-months-cycles alternated for compliance with the synodic month. \nThe 12-months-cycle is 30,29,30,29,30,29,30,29,30,29,30,29\nThe 13-months-cycle is 30,29,30,29,30,29,30,29,30,29,30,29,30\nIn different ages, the calendar use different major cycle, which contains several 12-months-cycles and 13-months-cycle. The synodic month of Taichu calendar is 2943/81 days.\n\nIn 7th century, the Wùyín Yuán Calendar of Tang dynasty in 7th century, the month length was determined by the real synodic month for the first time, instead of the cycling method, which mean month lengths is determined by observation and prediction starting from Tang dynasty, except a few brief period of time.\n\nA month with 30 days is called a long month (), and a month with 29 days is called a short month ().\nThe days of the month are numbered beginning with 1, and in Chinese the day's number is always written with two characters,\nsuch as Chūyī () for 1, Shíwǔ () for 15, and Niànsān () for 23.\nAs a convention, the days of the month are numbered with the 60 stem-branches in the history books. For example: Tiansheng 1st year, Eryue, Dingsiri, Set the portrait of the Great Chris and Pope in the Hongqing Palace of the southern capital. - Volume ix: Biographic Sketches of Pope Ren, History of Song Dynasty.\n\nBecause astronomical observation is used to determine month length, date of the Chinese calendar corresponds to the moon phase.\nThe first day of each month is the dark moon.\nIn the 7th or 8th day of each month, the first quarter moon is visible in the afternoon and early evening.\nIn the 15th or 16th day of each month, the full moon is visible all night.\nIn the 22nd or 23rd day of each month, the last quarter moon is visible late at night and in the morning.\n\nAs the beginning of every month is determined by the time when the new moon occur, thus other countries who have adopted the calendar and use time standard that are different from China to calculate their own version of the calendar could result in deviation. For instance, the first new moon in the year 1968 in Gregorian calendar happened in UTC Jan 29 16:29, which would translate to Jan 29 23:29 in UTC+7 timezone (which is what North Vietnam used to calculate their Vietnamese calendar) while it would be Jan 30 00:15 based on the longitude of Beijing (as used by South Vietnam at the time), causing the two countries celebrate Tết holiday in different date that year and result in asynchronized attacks in Tet Offensive.[http://www.math.nus.edu.sg/aslaksen/calendar/cal.pdf Mathematics of the Chinese calendar], pp. 29–30.\n\nSolar year and solar term\n\nThe solar year () is the time between the winter solstices. The solar year is divided into 24 solar terms.\n\nIn ancient China, the solar year and solar terms were estimated and balanced, and the solar term is just the 1/24 of the solar year, about 157/32 days.\n\nStarting from the 17th century, when the Shixian Calendar of Qing dynasty was adopted, the solar year was determined by the real tropical year instead. The solar terms correspond to intervals of 15° along the ecliptic.\n\nDifferent version of traditional Chinese calendar might have different average year length. For instance, one solar year of Taichu calendar, which were implemented in 1st century BC, is 365385/1539 (365.25016) days, while one solar year of Shoushi calendar, which were implemented in 13th century, is 36597/400 (365.24250) days, which is the same as the Gregorian calendar. The difference of 0.00766 days amounts to a one day shift in 130.5 years.\n\nCouples of solar terms are climate terms (solar months). The first of each couples is \"pre-climate\" (), and the second of the each couple is \"mid-climate\" ().\n\n#FTC 小寒 First Term of Cold Season\n#STC 大寒 Second Term of Cold Season\n#VC 立春  Vernal commence\n#LTC 雨水  Last Term of Cold Season (惊蛰)\n#FT R惊蛰  First Term of Rainy Season (雨水)\n#VE 春分 Vernal Equinox\n#STR 清明 Second Term of Rainy Season (谷雨)\n#LTR 谷雨 Last Term of Rainy Season (清明)\n#SC 立夏 Summer commence\n#FTG 小满 First Term of Growing Season\n#STG 芒种 Second Term of Growing Season\n#SS 夏至 Summer Solstice\n#FTH 小暑 First Term of Hot Season\n#STH 大暑 Second Term of Hot Season\n#AC 立秋 Autumn Commence\n#LTH 处暑 Last Term of Hot Season\n#FTD 白露 First Term of Dew Season\n#AE 秋分 Autumn Equinox\n#STD 寒露 Second Term of Dew Season\n#LTD 霜降 Last Term of Dew Season\n#WC 立冬 Winter Commence\n#FTS 小雪 First Term of Snowy Season\n#STS 大雪 Second Term of Snowy Season\n#WS 冬至 Winter Solstice\n\nIn general, there are 11 or 12 complete months and 2 incomplete months, which contains the winter solstice, in a solar year. The 11 mid-climates except the winter solstice are in the 11 or 12 complete months. The first month without a mid-climate is the leap month.\n\nThe complete months except the intercalary month, queues up from 0 to 10, and the incomplete months follows this queue, to be 11. The intercalary follows the queue number before by rule.\n\nCivil year\n\nThe civil year starts from the first spring month (1), and ends at the last winter month (0/0i). The first and last month is called as Zhēngyuè (, capital month) and Làyuè (, sacrificial month), and the other month is called according to the queue number (except that the 0th month is Shi'eryue, if the Layue is a leap month).\n\nThere are 12 or 13 months in each year. The years with 12 months, or 353~355 days, are common years. The years with 13 months, or 383~385 days, are long years.\n\nYears were numbered after the reign title in Ancient China, but the reign title was no longer used after the founding of PRC in 1949. People use the stem-branches to demarcate the years. For example, the year from February 8, 2016 to January 27, 2017 is a Bǐngshēnnían,  long.\n\nTo Encode the date in the Chinese calendar, the flag of the intercalary month should be considered. For example, Run Liuyue 6, Dingyounian: 408-6i-06 (Timestamp: 40806106)\n\nIn Tang Dynasty, the earthly branches are used to mark the months for about 150 days (Dec, 761~May, 762). At that time, the year starts from the month with Winter Solstice, and the month from Zhengyue to Layue are named as: Yinyue, Maoyue, Chenyue, Siyue, Wuyue, Weiyue, Shenyue Youyue, Xuyue, Haiyue, Ziyue, and Chouyue.\n\nEstimate the Chinese date\n\n#A month in the Chinese calendar is 29 or 30 days long, and a month in the Gregorian calendar is 30 or 31 days long (except for February). So, we may estimate the Chinese date if we know the bias between Layue 1st and January 1. In general, from Eryue/March, the Chinese date move 1 day backward, after a month; the Chinese date move a day forward after Zhengyue/February. Of course, if the bias is over 29 days, we should consider if there's an intercalary month before.\n#The date of the solar term in the Gregorian calendar is more or less fixed. In general, the date of the solar term in the Chinese calendar swing (±15 days) around the fixed date. The node of the climate term is around the 1st of the corresponding month, and the mid of the climate is round the 15th of the corresponding month.\n#A solar year is about 365 1/4 days, and 12 month is about 354 3/8 days. So the Chinese date move for about 11 days backward or 19 days forward. \n#In general, if the Chinese New Year locate at January, there's an intercalary month in this year.\n#The Chinese date is more or less fixed after 19 years (or 11 years occasionally) later. But, the dates near the intercalary month always are naughty. The dates in the winter of the nominal year of Merton cycle are naughty too, such as 2014+19n.\n\nGraphical representation \n\nA typical graphical representation of the Chinese calendar is the vernal cattle diagram (), which help people calculate the date. In the vernal cattle diagram: \n# The color of the cattle head marks the stem (five phases) of the year,\n# If the cattle mouth is closed, it is a yin year; if the cattle mouth open, it is a yang year, \n# The color of the cattle body marks the branch of the year.\n# The color of the cattle tail marks the stem (five phases) of the vernal commence.\n# If the cattle tail is on the left, vernal commence is a yang day; if the cattle tail is on the right, vernal commence is a yin day,\n# The color of the cattle knee and shin marks the branch of the vernal commence.\n# if the cowherd stand ahead the cattle, the vernal commence is 5+ days ahead the spring festival; if the cowherd stand behind the cattle, the vernal commence is 5+ days behind the spring festival; otherwise the bias between spring festival and vernal commence is within 5 days.\n\nAge recognition in China \n\nIn China, age for official use is based on the Gregorian calendar. For traditional use, age is based on the Chinese calendar. For the first year from the birthday, the child is considered one year old. After each New Year's Eve, add one year. \"Ring out the old age and ring in the new one ()\" is the literary express of New Year Ceremony. For example, if one's birthday is Làyuè 29th 2013, he is 2 years old at Zhēngyuè 1st 2014. On the other hand, people say months old instead of years old, if someone is too young. It is that the age sequence is \"1 month old, 2 months old, ... 10 months old, 2 years old, 3 years old...\".\n\nAfter the actual age () was introduced into China, the Chinese traditional age was referred to as the nominal age (). Divided the year into two halves by the birthday in the Chinese calendar, the nominal age is 2 older than the actual age in the first half, and the nominal age is 1 older than the actual age in the second half ().\n\nBirthday issue \n\nJust as it is awkward to define the birthday of someone born on the 29th of February in the Gregorian calendar, special rules are used for birthdays or other anniversaries during the intercalary month or on the 30th day.\n# If someone was born in an intercalary month (except intercalary Shi'eryue), his birthday is in the common month (the month before the intercalary month).\n# If someone was born in Shi'eryue, and Layue is the intercalary Shi'eryue, his birthday is in Layue (the last month of a year).\n# If someone was born at 30th day of a month, his birthday is the last day of the month, i.e. the 30th day if that exists, or the 29th day if it does not.\n\nYear number system \n\n; Era system\n\nIn the Ancient China, years were numbered from 1, beginning from the next year after a new emperor ascended the throne or the current emperor announced a new era name. The first reign title was Jiànyuán (, from 140 BCE), and the last reign title was Xuāntǒng (, from 1908 CE). The era system was abolished in 1912 CE, after which the Current Era or Republican era was used. The epoch of the Current Era is just the same as the era name of Emperor Ping of Han, Yuánshí ().\n\n; Stem-branches system\n\nThe 60 stem-branches were used to mark the date continually from Shang Dynasty. Before Han Dynasty, people knew the orbital period of Jupiter is about 4332 days, which is about 12*361 days. So, the orbital period of Jupiter was divided into 12 periods, which was used to number the year. The Jupiter was called as the star of age (), and the 1/12 Jupiter orbital period was called as the age ().\n\n361 days is just 6 cycles of 60-stem-branches, so the stem-branches of the first day move forward one after each sui. The first day of  each sui was called as the sui capital ().\n\nAnd the stem-branches of the taisui was used to mark the year. Obviously, there're two taisui in some year for the sui is shorter than solar rear. About after each 86 year, a taisui was leaped. The leaped of the sui was called as beyond the star ().\n\nAt the eastern Han Dynasty, the chaochen are abolished, and the 60 stem-branches are used to mark year continually without leap.\n\nThe Stem-branches year number system provided a solution for the defect of era system (unequal length of the reign titles)\n\n; Continuous year numbering\n\nOccasionally, nomenclature similar to that of the Christian era has been used, such as《辽宁大学学报：哲社版》，2004/06，43～50页\nAnno Huángdì (), referring to the beginning of the reign of the Yellow Emperor, 2698+AD=AH\nAnno Yáo (), referring to the beginning of the reign of Emperor Yao, 2156+AD=AY\nAnno Gònghé (), referring to the beginning of the Gonghe Regency, 841+AD=AG\nAnno Confucius (), referring to the birth year of Confucius, 551+AD=AC\nAnno Unity (), referring to the beginning of the reign of Qin Shi Huang, 221+AD=AU\nNo reference date is universally accepted.\n\nOn January 2, 1912, Sun Yat-sen declared a change to the official calendar and era. In his declaration, January 1, 1912 is called Shíyīyuè 13th, 4609 AH which assumes an epoch (1st year) of 2698 BCE. This declaration was adopted by many overseas Chinese communities outside Southeast Asia such as San Francisco's Chinatown.Aslaksen, p.38.\n\nIn the 17th century, the Jesuits tried to determine what year should be considered the epoch of the Han calendar. In his Sinicae historiae decas prima (first published in Munich in 1658), Martino Martini (1614–1661) dated the ascension of the Yellow Emperor to 2697 BC, but started the Chinese calendar with the reign of Fuxi, which he claimed started in 2952 BCE. Philippe Couplet's (1623–1693) Chronological table of Chinese monarchs (Tabula chronologica monarchiae sinicae; 1686) also gave the same date for the Yellow Emperor. The Jesuits' dates provoked great interest in Europe, where they were used for comparisons with Biblical chronology.\n\nModern Chinese chronology has generally accepted Martini's dates, except that it usually places the reign of the Yellow Emperor in 2698 BC and omits the Yellow Emperor's predecessors Fuxi and Shennong, who are considered \"too legendary to include\".\n\nStarting in 1903, radical publications started using the projected date of birth of the Yellow Emperor as the first year of the Han calendar. Different newspapers and magazines proposed different dates. Jiangsu, for example, counted 1905 as year 4396 (use an epoch of 2491 BCE), whereas the newspaper Ming Pao () reckoned 1905 as 4603 (use an epoch of 2698 BCE). Liu Shipei (; 1884–1919) created the Yellow Emperor Calendar, now often used to calculate the date, to show the unbroken continuity of the Han race and Han culture from earliest times. Liu's calendar started with the birth of the Yellow Emperor, which he determined to be 2711 BC. There is no evidence that this calendar was used before the 20th century. Liu calculated that the 1900 international expedition sent by the Eight-Nation Alliance to suppress the Boxer Rebellion entered Beijing in the 4611th year of the Yellow Emperor.\n\n; Calendric epoch\n\nThere is an epoch for each version of the Chinese calendar, which is called Lìyuán (). The epoch is the optimal origin of the calendar, and it is a Jiǎzǐrì, the first day of a lunar month, and the dark moon and solstice are just at the midnight (). And tracing back to a perfect day, such as that day with the magical star sign, there's a supreme epoch (). The continuous year based on the supreme epoch is shàngyuán jīnián (). More and more factors were added into the supreme epoch, and the shàngyuán jīnián became a huge number. So, the supreme epoch and shàngyuán jīnián were neglected from the Shòushí calendar.\n\n; Yuán-Huì-Yùn-Shì system\n\nShao Yong ( 1011–1077), a philosopher, cosmologist, poet, and historian who greatly influenced the development of Neo-Confucianism in China, introduced a time system in his The Ultimate which Manages the World ()\n\nIn his time system, 1 yuán (), which contains 12'9600 years, is a lifecycle of the world.  Each yuán is divided into 12 huì ().  Each huì is divided into 30 yùn (), and each yùn is divided into 12 shì ().  So, each shì is equivalent to 30 years.  The yuán-huì-yùn-shì corresponds with nián-yuè-rì-shí.  So the yuán-huì-yùn-shì is called the major tend or the numbers of the heaven, and the nián-yuè-rì-shí is called the minor tend or the numbers of the earth.\n\nThe minor tend of the birth is adapted by people for predicting destiny or fate. The numbers of nián-yuè-rì-shí are encoded with stem-branches and show a form of Bāzì. The nián-yuè-rì-shí are called the Four Pillars of Destiny. For example, the Bāzì of the Qianlong Emperor is Xīnmǎo, Dīngyǒu, Gēngwǔ, Bǐngzǐ (). Shào Huángjíjīngshì recorded the history of the timing system from the first year of the 180th yùn or 2149th shì (HYSN 0630-0101, 2577 BC) and marked the year with the reign title from the Jiǎchénnián of the 2156th shì (HYSN 0630-0811, 2357 BC, Tángyáo 1, ). According to this timing system, 2014-1-31 is HYSN/YR 0712-1001/0101.\n\nThe table below shows the kinds of year number system along with correspondences to the Western (Gregorian) calendar. Alternatively, see this larger table of the full 60-year cycle.\n\n1 As of the beginning of the Chinese year. AR=Anno the Republic of China\n2 Timestamp according to Huángjíjīngshì, as a format of Huìyùn-Shìnián.\n3 Huángdì era, using an epoch (year 1) of 2697 BC. Subtract 60 if using an epoch of 2637 BC. Add 1 if using an epoch of 2698 BC.\n\nPhenology\n\nThe plum rains season is the rainy season during the late spring and early summer. The plum rains season starts on the first Bǐngrì after the Corn on Ear, and ends on the first Wèirì after the Moderate Heat.\nThe Sanfu days are the three sections from the first Gēng-day after the summer solstice. The first section is 10 days long, and named the fore fu (). The second section is 10 or 20 days long, and named the mid fu (). The last section is 10 days long from the first Gēng-day after autumn commences, and named the last fu ().\nThe Shujiu cold days are the nine sections from the winter solstice. Each section is 9 days long. The shǔjǐu are the coldest days, and named with an ordinal number, such as Sìjǐu ().\n\nFestivals\n\nIn the Sinosphere, the traditional festivals are calculated using the date or solar terms, and are considered auspicious.\n\nHistory\n\nEarlier Chinese calendars\n\nBefore the Zhou dynasty,  the Chinese calendars used a solar calendar.\n\nAccording to Ancient Chinese literature, the first version was the five-phases calendar (), which came from the tying knots culture. In the five-phases calendar, a year was divided into five phases which were expressed by five  ropes. Each rope was folded into halves, and the day in the corner was the capital day (). They're three sections in each halves, and the Chinese Character of phase is the pictograph of the rope of the tying knots. The ten half-ropes were arranged into a row, and a man shape was engraved by the ropes. The part of man shape derived into 10 heaven stems. The days in each sections were recorded with 12 earthly branches. So, in the five-phases calendar, a year is fives phases or ten months, and a phase is six sections or 73 days. The remainder of each phases are marked in the Hetu, which is found in Song Dynasty.\n\nThe second version is the four-seasons calendar (). In the four-seasons calendar, the days were counting by ten, and three ten-days weeks were built into a month. There were 12 months in a year, and a week were intercalated in the hot month. In the age of four-seasons calendar, the 10 heaven stems and 12 earthly branches were used to mark days synchronously.\n\nThe third version is the balanced calendar () a year was defined into 365.25 days, and the month was defined into 29.5 days. And after each 16 months, a half-month was intercalated. There half-months were merged into months later, and the archetype of the Chinese calendar was  brought out in the Spring and Autumn ages.\n\nOracle bone records indicate that the calendar of Shang Dynasty were a balanced calendar, and the 12, 13, even 14 months were packed into a year roughly. Generally, the month after the winter solstice was named as the capital month ().http://www.newsmth.net/bbsanc.php?path%2Fgroups%2Fsci.faq%2FAstronomy%2Fbw%2Fall2%2Fbk37k%2FM.1275291864.z0&ap\n353\n\nAncient Chinese calendars\n\nPre-Qin dynasty calendars\n\nIn Zhou dynasty, the authority issued the official calendar, which is a primitive lunisolar calendar. The year beginning of Zhou's calendar () is the day with dark moon before the winter solstice, and the epoch is the Winter Solstice of a Dīngyǒu year.\n\nSome remote vassal states issued their own calendars upon the rule of Zhou's calendar, such as:\nThe epoch of the Lu's calendar () is the winter solstice of a Gēngzǐ year. \nDuring the Spring and Autumn period and Warring States period, Some vassal states got out of control of Zhou, and issues their own official calendar, such as:\nJin issued the Xia's calendar (), with a year beginning of the day with the nearest darkmoon to the Vernal Commences. The epoch of Xia's calendar is the Vernal Commences of a Bǐngyíng year.\nQin issued the Zhuanxu's calendar (), with a year beginning of the day with the nearest darkmoon to the Winter Commences. The epoch of Zhuanxu's calendar is the Winter Commences of a Yǐmǎo year.\nSong resumed the Yin's calendar (), with a year beginning of the day with the darkmoon after the Winter Solstice. The epoch of Yin's calendar is the  Winter Solstice of a Jiǎyíng year.\nThese six calendars are called as the six ancient calendars (), and are the quarter remainder calendars (). The months of these calendars begin on the day with the darkmoon, and there are 12 or 13 month within a year. The intercalary month is placed at the end of the year, and called as 13th month.\n\nThe modern version of the Zhuanxu's calendar is the Chinese Qiang calendar and Chinese Dai calendar, which are the calendar of mountain peoples.\n\nCalendar of the Qin and early Han dynasties\n\nAfter Qin Shi Huang unified China under the Qin dynasty in 221 BCE, Qin's calendar () was promulgated. The Qin's calendar follows the rules of Zhuanxu's calendar, but the month order follows the Xia calendar. The months in the year are from the 10th month to the 9th month, and the intercalary month is called as the second Jiuyue (). In the early Han dynasty, the Qin calendar continued to be used.\n\nTaichu calendar and the calendars from the Han to Ming dynasties.\n\nEmperor Wu of the Han dynasty introduced reforms halfway through his administration. His Taichu or Grand Inception Calendar ( introduced 24 solar terms which determined the month names. The solar year was defined as 365 385/1539 days, and divided into 24 solar terms. Each couples of solar terms are associated into 12 climate terms. The lunar month was defined as 29 43/81 days and named according to the closest climate term. The mid-climate in the month decides the month name, and a month without mid-climate is an intercalary month.\n\nThe Taichu calendar established the frame of the Chinese calendar, Ever since then, there have been over 100 official calendars in Chinese which are consecutive and follow the structure of Tàichū calendar both. There're several innovation in calendar calculation in the history of over 2100 years, such as:\nIn the Dàmíng Calendar released in Tiānjiān 9 (, 510) of the Liang dynasty, Zhu Chongzhi introduced the equation of equinoxes.\nActual syzygy method was adopted to decide the month from the Wùyín Yuán Calendar, which was released in Wǔdé 2 (, 619) of the Tang dynasty.\nThe real measured data was used in calendar calculation from Shòushí Calendar, which was released in Zhìyuán 18 (, 1281) of the Yuan dynasty. And the tropical year is fixed at 365.2425 days, the same as the Gregorian calendar established in 1582.,Asiapac Editorial. (2004). Origins of Chinese Science and Technology. Translated by Yang Liping and Y.N. Han. Singapore: Asiapac Books Pte. Ltd. , p.132. and derived spherical trigonometry.Needham, Joseph. (1959). Science and Civilization in China: Volume 3, Mathematics and the Sciences of the Heavens and the Earth. Cambridge University Press., reprinted Taipei: Caves Books, Ltd. (1986), pp. 109–110.Ho, Peng Yoke. (2000). Li, Qi, and Shu: An Introduction to Science and Civilization in China. Mineola: Dover Publications. . p. 105.Restivo, Sal. (1992). Mathematics in Society and History: Sociological Inquiries. Dordrecht: Kluwer Academic Publishers. . p. 32.\n\nModern Chinese calendars \n\nThe Chinese calendar lost the status of the official statutory calendar in China in the beginning of the 20th century,孙中山：“临时大总统改历改元通电”，载《孙中山全集》（第2卷），中华书局1982年版，页5。 however it has been continually being used for various purposes.\n\nBecause the Republic of China adopted the UTC+8 timezone instead of using Beijing Mean Solar Time in 1928 CE, Chinese calendars produced in Mainland China have switched to use UTC+8 in the following year. However, the switch in time standard used in Chinese calendars has not been universally adopted in areas like Taiwan and Hong Kong, and some calendars were still follow the last calendar of Qing dynasty that was published in 1908. In 1978, this practice caused confusion on what date the 1978 Mid-autumn festival occur, and caused those areas to switch to the UTC+8-based Chinese calendar thereafter.[http://www.math.nus.edu.sg/aslaksen/calendar/cal.pdf Mathematics of the Chinese calendar], pp. 28.\n\nShíxiàn calendar \n\nIn the late Ming dynasty, Xu Guangqi and his colleagues worked out the new calendar based on western astronomical arithmetic. But the new calendar was not released before the end of the Ming dynasty. In the early Qing dynasty, Johann Adam Schall von Bell submitted the calendar to the Shunzhi Emperor. The Qing government released the calendar under the name the Shíxiàn calendar, which means seasonal charter.\nIn the Shíxiàn calendar, the solar terms each correspond to 15° along the ecliptic. It meant the Chinese calendar can be used as astronomical calendar. However, the length of the climate term near the perihelion is shorter than 30 days and there may be two mid-climate terms. The rule of the mid-climate terms decides the months, which is used for thousands years, lose its validity. The Shíxiàn calendar changed the rule to \"decides the month in sequence, except the intercalary month.\"\n\nCurrent Chinese calendar\n\nThe version of the traditional Chinese calendar currently being used follows the rules of the Shíxiàn calendar, except that: \n# The baseline is Chinese Standard Time rather than Beijing local time.\n# Actual astronomical data is used rather than only theoretical mathematical calculations.\n\nProposals to optimize the Chinese calendar\n\nTo optimize the Chinese calendar, astronomers have released many proposed changes. A typical proposal was released by Gao Pingzi (; 1888-1970), a Chinese astronomer who was one of the founders of Purple Mountain Observatory. In his proposal, the month numbers are calculated before the dark moons and the solar terms were rounded to the day. Under his proposal, the month numbers are the same for the Chinese calendar upon different time zones.\n\nAs the intercalary month is determined by the first month without mid-climate and the exact time when each mid-climate happen would vary according to time zone, countries that have adopted the calendar but calculate with their own time could vary from the one used in China because of this. For instance, the 2012 FTG happened in UTC May 20 15:15, which would translate to May 20 23:15 in UTC+8, making FTG the mid-climate for the fourth month of that traditional Chinese year [April 21 ~ May 20 in Gregorian calendar], but in Korea it happened in May 21 00:15 in UTC+9, and as new moon take place in May 21 in that month, therefore the month before that would only consist of the SC solar term, lacking mid-climate. As a result, the month starting at April 21 would be an intercalary month in Korean calendar, but not in Chinese Calendar, and the intercalary month in Chinese calendar would start in the month after, in the fifth month starting from May 21, which would only consist of the solar term STG, while the month in Korean Calendar would have both FTG and STG solar term in it.\n\nOther practices \n\nAmong the ethnic groups inhabiting the mountains and plateaus of southwestern China, and those living in the grasslands of northern China, their civil calendars show a diversity of practice based upon their characteristic phenology and culture, but they are based on the algorithm of the Chinese calendar of different periods, especially those of the Tang dynasty and pre-Qin dynasty period.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Chinese calendar" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6966" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The traditional Chinese calendar is a lunisolar calendar which reckons years, months and days according to astronomical phenomena. , the Chinese calendar is defined by GB/T 33661-2017 Calculation and promulgation of the Chinese calendar, which the Standardization Administration of China issued on May 12, 2017.\n\nThe Chinese calendar governs traditional activities in China and in overseas-Chinese communities. It depicts and lists the dates of traditional Chinese holidays, and guides Chinese people in selecting the most auspicious days for weddings, funerals, moving, or beginning a business.\n\nIn the Chinese calendar the days begin and end at midnight. The months begin on the day with the dark (new) moon. The years begin with the dark moon near the midpoint between winter solstice and spring equinox. The solar terms are the important components of the Chinese calendar. In a month there are one to three solar terms.\n\nThe currently used traditional Chinese calendar represents the end result of centuries of evolution. Ancient scientists added many astronomical and seasonal factors, and people can reckon the timing of natural phenomena such as the moon phase and tides based on the Chinese calendar. The Chinese calendar has over 100 variants, whose characteristics reflect the calendar's evolutionary path. As with Chinese characters, different variants are used in different parts of the Chinese cultural sphere.\n\nKorea, Vietnam, and the Ryukyu Islands adopted the Chinese calendar completely - it evolved into Korean, Ryukyuan, and Vietnamese calendars, with the main difference being the use of different meridians, which leads to some astronomical events falling on different dates in different countries. Thus the same event may occasionally be assigned a different date in each of those calendars. The traditional Japanese calendar also derived from the Chinese calendar, based on a Japanese meridian, however its official use in Japan was abolished in the early 20th century and its usage has mostly disappeared since then. Calendars in Mongolia and Tibet have absorbed elements from the Chinese calendar and elements from other systems, but they are not direct descendants of the Chinese calendar.\n\nThe official calendar in China is the Gregorian calendar, but the traditional Chinese calendar still plays an important role there. The Chinese calendar is known officially as the Rural Calendar (),\nbut is often referred to by other names, such as the Former Calendar (), the Traditional Calendar (), or the Lunar Calendar (). The Chinese calendar preserves traditional  East Asian culture, and is the root to many other East Asian calendars.\n\nAlthough the solar term governs the month sequences of the traditional Chinese calendar, it is not an agricultural calendar.\n\nIn ancient China the calendars marked the name/stem – branch of the year, month names, month length flags (大/小=Long/Short), the stems of 1/11/21 (1/11/21 of each month are same in stem, use a character), the branches of 1/11/21, and the date/stem-branch/time of the solar terms in the month.\n\nStructure \n\nGeneral \n\nThe calendar has a year, month and date frame. The key elements are the day, synodic month and solar year. The Chinese calendar is a lunisolar calendar, similar to the Hindu and Hebrew calendars.\n\nElements:\n* day, the time based on the earth's rotation. In the Chinese calendar, a day starts from midnight.\n* month, the time is based on the obliquity of the moon path. In the Chinese calendar, a month starts from the dark moon. A month is about 29 17/32 days.\n* date, the day number in a month. Days are numbered in sequence from 1 to 29 or 30.\n* year, the time based on the earth's revolution. In the Chinese calendar, a year starts from the vernal commence (or the winter solstice). A year is about 365 31/128 days.\n* zodiac, 1/12 year, 30° ecliptic. A zodiac is about 30 7/16 days. The zodiac in the Chinese calendar is 45° away from the zodiac in the Babylon system.\n*solar term, 1/24 year, 15° ecliptic, a unique concept of monthing method in the Chinese calendar. A solar term is about 15 7/32 days. \n* calendric month, the month numbering in a year. The months are numbered according to the zodiac number; some months may be repeated. \n* calendric year, the year for the calendric purpose (in culture or religion). In the Chinese calendar, the calendric year starts from the nearest day of the dark moon to the vernal commences. A calendric year is 353/354/355 or 383/384/385 days.\n\n7 Luminaries, Big Dipper, 3 Enclosures, 28 Mansions \n\nThe movements of the Sun, the Moon, Mercury, Venus, Mars, Jupiter, and Saturn are the key references for calendar calculations. These are known as the seven luminaries. \n* The distance between Mercury and the sun is within 30°, which is the sun's height at chenshi, so Mercury is called the \"chen star\" ().\n* Venus appears at dawn and dusk, so the Venus is called the \"bright star\" () or \"long star\" (). \n* Mars looks like fire and occurs irregularly, so Mars is called the \"fire star\" (). Mars is in charge of punishment in Chinese culture. When Mars is close to Antares (), it is a sign of bad luck and can forebode the death of the emperor or the ousting of the chancellor. \n* The period of Jupiter's revolution is about 11.86 years, so Jupiter is called the \"age star\" (), since 30° of Jupiter's revolution is about a year on Earth.  \n* The period of Saturn's revolution is about 28 years, so Saturn is called the \"guard star\" (). This means that Saturn guards one of the 28 mansions every year.   \n\nThe Big Dipper is regarded as the compass in the sky, and the handle's direction decides the season and solar month.\n\nThe stars are divided into Three Enclosures and 28 Mansions according to their locations in the sky relative to Ursa Minor at the centre. Each mansion is named with a character that describes the shape of the principal asterism it contains.\n* Central (Three Enclosures): Purple Forbidden (), Supreme Palace (), Heavenly Market ()\n* Eastern mansions: 角, 亢, 氐, 房, 心, 尾, 箕; Southern mansions: 井, 鬼, 柳, 星, 张, 翼, 轸; Western mansions: 奎, 娄, 胃, 昴, 毕, 参, 觜; Northern mansions: 斗, 牛, 女, 虚, 危, 室, 壁\nThe moon moves about one mansion per day; the 28 mansions are thus used to count days too. In the Tang Dynasty, Yuan Tiangang () matched the 28 mansions, seven luminaries and yearly animal signs, yielding combinations such as “horn-wood-flood dragon” ().\n\nCodes \n\nSeveral coding systems are used for some special circumstances in order to avoid ambiguity, such as continuous day or year count. \n* The heavenly stems is a decimal system.\n* The earthly branches is a duodecimal system. The earthly branches are used to mark the shí and climate terms usually.\n* There's a different pattern for earthly branches, which is called as 12 characters of jian, chu and others (). The 12 characters sequence from the first day with the same branch as the month (first Yinri of Zheng, first Maori of Ery, ...). The 12 characters must be used to count the days of the solar month.        \n* The stem-branches is a sexagesimal system. The heavenly stems and earthly branches match together and form stem-branches. The stem-branches are used to mark the continuous day and year.\n* The stem-branches order may calculate with the stems order and branches order. sb=6s-5b (if less than 10, add 50)\n* The unit digit of the stem-branches order  is the stems order; the unit digit minus twice the tens digit is the branches order (if less than 2, add 10) \n* The five phases are used to match the stems, branches, and stem-branches. And the Yin-yang are used to match the  stems, branches, and stem-branches too, odd-yang, even-yin.\n\nTime system\n\nIn Modern China, people use the Western hour-minute-second system to divide time. In Ancient China, people used the shi-ke system to divide the time during the day and the geng-dian system to divide the time during the night.. For example:\n:The Chinese standard time is , or  ().\nIn the Chinese calendar, the day begins at midnight and ends at the next midnight, but people tend to regard the days as beginning at dawn.\n*24 hours system\nIn Han Dynasty, a day is divided into 24 hours, and the 15 active o'clocks (6:00-20:00) are named as: dawn (晨明), daybreak (朏明), morning (旦明), earlier breakfast (蚤食), later breakfast (宴食), ante noon (隅中), noon (正中), short shadow (少还), drum time (铺时), long shadow (大还), higher setting (高舂), lower setting(下舂), sunset (县东), dusk (黄昏), rest time (定昏)\n*shi-ke system\nA day is divided into 100 centidays by kes (the scales), or into 12 dual-hours by 12 shis, which are named with 12 earthly branches.\n:In the earlier stage, the time expression is sss initial, sss 1 ke,..., sss 8 ke, such as wush 3 ke (the third ke after wush)\n:After Tang dynasty, the time expression is a.sss initial, a.sss 1 ke,..., a.sss 4 ke, p.sss initial, p.sss 1 ke,..., p.sss 4 ke, such as a.wush 3 ke (the third ke of wush), p.yinsh 4 ke (the fourth ke after yinsh)\n:For the calendar convenience, A day is divided into 6000 fens. 1 centiday 60 fens, 1 fen \n 14.4 seconds. \n*geng-dian system\nA day is divided into 10 decidays by gengs (The midnight is sang, and each deciday is divided by 5 dians (points).\n:The time expression is ggg, ggg 1 point,..., ggg 5 point, such as sang 2 point (the second point after sang).\nAmong a year, the night length is inconstant. At 35°N, it is about 60% at the winter solstice, and about 40% at the summer solstice. So, the night gengs starts from a time between dawn and yig, and end at a time between wug and morn\n*16-parts system\nAt pre-Qin and Qin-Han, a day was divided into 16 parts from the cock time (3:00; 4:15 / sig 1 point 50 fen). The 16-parts system is established for calendar convenience, for:\nA season is about 91 days and 5 parts, and a solar month is about 30 days and 7 parts.\nA couple of months is about 59 days and a part.\n\nWeek\n\nThe Chinese appear to have adopted the seven-day week from the Hellenistic system by the 4th century, although by which route is not entirely clear. It was again transmitted to China in the 8th century by Manichaeans, via the country of Kang (a Central Asian polity near Samarkand).The Chinese encyclopaedia  Cihai (辞海) under the entry for \"seven luminaries calendar\" (七曜历/七曜曆, qī yào lì) has:\n\"method of recording days according to the seven luminaries [七曜 qī yào]. China normally observes the following order: Sun, Mon, Mars, Mercury, Jupiter, Venus, and Saturn. Seven days make one week, which is repeated in a cycle. Originated in ancient Babylon (or ancient Egypt according to one theory). Used by the Romans at the time of the 1st century AD, later transmitted to other countries. This method existed in China in the 4th century. It was also transmitted to China by Manichaeans in the 8th century from the country of Kang (康) in Central Asia.\" (translation after [http://www.cjvlang.com/Dow/dowjpn.html Bathrobe's Days of the Week in Chinese, Japanese & Vietnamese, plus Mongolian and Buryat] (cjvlang.com) It is the most predominantly used system in modern China.\n\nOther than the seven-day week system, in ancient China, the days were grouped into 10-day weeks with the stems, 12-day weeks with the branches, or 9/10-day weeks () with the date in the month.\n\nThe ten-day week was used in antiquity (reportedly as early as in the Bronze Age Xia dynasty).\n In modern time, it is still used in counting special days including Three Fu Days ().http://www.hko.gov.hk/education/edu01met/exobs/folklore/ele_hs_c.htm\n\nThe law during the Han dynasty (206 BC – AD 220) required officials of the empire to rest every five days, called mu (沐), while it was changed into 10 days in the Tang dynasty (AD 618 – 907), called huan (澣/浣) or xún (旬).\n\nMonths were almost three weeks long (alternating 29 and 30 days to keep in line with the lunation). As a practice, the months are divided into 3 xún. The first 10 days is the early xún (), the middle 10 days is the mid xún (), and the last 9 or 10 days is the late xún ().\n\nMarkets in Japan followed the Chinese jun (旬) system; see Japanese calendar. In Korea, it was called \"Sun\" (순,旬).\n\nIn winter, there is also a 9-day cycle counting start from the winter solstice, which would last for 9 cycles until 81 days later when it is deemed as the end of winter.http://www.epochtimes.com/b5/14/12/26/n4327438.htm\n\nMonth\n\nMonth is the time between the dark moon. In the early days, the month length was estimated, and balanced. In general, 12-months-cycles and 13-months-cycles alternated for compliance with the synodic month. \nThe 12-months-cycle is 30,29,30,29,30,29,30,29,30,29,30,29\nThe 13-months-cycle is 30,29,30,29,30,29,30,29,30,29,30,29,30\nIn different ages, the calendar use different major cycle, which contains several 12-months-cycles and 13-months-cycle. The synodic month of Taichu calendar is 2943/81 days.\n\nIn 7th century, the Wùyín Yuán Calendar of Tang dynasty in 7th century, the month length was determined by the real synodic month for the first time, instead of the cycling method, which mean month lengths is determined by observation and prediction starting from Tang dynasty, except a few brief period of time.\n\nA month with 30 days is called a long month (), and a month with 29 days is called a short month ().\nThe days of the month are numbered beginning with 1, and in Chinese the day's number is always written with two characters,\nsuch as Chūyī () for 1, Shíwǔ () for 15, and Niànsān () for 23.\nAs a convention, the days of the month are numbered with the 60 stem-branches in the history books. For example: Tiansheng 1st year, Eryue, Dingsiri, Set the portrait of the Great Chris and Pope in the Hongqing Palace of the southern capital. - Volume ix: Biographic Sketches of Pope Ren, History of Song Dynasty.\n\nBecause astronomical observation is used to determine month length, date of the Chinese calendar corresponds to the moon phase.\nThe first day of each month is the dark moon.\nIn the 7th or 8th day of each month, the first quarter moon is visible in the afternoon and early evening.\nIn the 15th or 16th day of each month, the full moon is visible all night.\nIn the 22nd or 23rd day of each month, the last quarter moon is visible late at night and in the morning.\n\nAs the beginning of every month is determined by the time when the new moon occur, thus other countries who have adopted the calendar and use time standard that are different from China to calculate their own version of the calendar could result in deviation. For instance, the first new moon in the year 1968 in Gregorian calendar happened in UTC Jan 29 16:29, which would translate to Jan 29 23:29 in UTC+7 timezone (which is what North Vietnam used to calculate their Vietnamese calendar) while it would be Jan 30 00:15 based on the longitude of Beijing (as used by South Vietnam at the time), causing the two countries celebrate Tết holiday in different date that year and result in asynchronized attacks in Tet Offensive.[http://www.math.nus.edu.sg/aslaksen/calendar/cal.pdf Mathematics of the Chinese calendar], pp. 29–30.\n\nSolar year and solar term\n\nThe solar year () is the time between the winter solstices. The solar year is divided into 24 solar terms.\n\nIn ancient China, the solar year and solar terms were estimated and balanced, and the solar term is just the 1/24 of the solar year, about 157/32 days.\n\nStarting from the 17th century, when the Shixian Calendar of Qing dynasty was adopted, the solar year was determined by the real tropical year instead. The solar terms correspond to intervals of 15° along the ecliptic.\n\nDifferent version of traditional Chinese calendar might have different average year length. For instance, one solar year of Taichu calendar, which were implemented in 1st century BC, is 365385/1539 (365.25016) days, while one solar year of Shoushi calendar, which were implemented in 13th century, is 36597/400 (365.24250) days, which is the same as the Gregorian calendar. The difference of 0.00766 days amounts to a one day shift in 130.5 years.\n\nCouples of solar terms are climate terms (solar months). The first of each couples is \"pre-climate\" (), and the second of the each couple is \"mid-climate\" ().\n\n#FTC 小寒 First Term of Cold Season\n#STC 大寒 Second Term of Cold Season\n#VC 立春  Vernal commence\n#LTC 雨水  Last Term of Cold Season (惊蛰)\n#FT R惊蛰  First Term of Rainy Season (雨水)\n#VE 春分 Vernal Equinox\n#STR 清明 Second Term of Rainy Season (谷雨)\n#LTR 谷雨 Last Term of Rainy Season (清明)\n#SC 立夏 Summer commence\n#FTG 小满 First Term of Growing Season\n#STG 芒种 Second Term of Growing Season\n#SS 夏至 Summer Solstice\n#FTH 小暑 First Term of Hot Season\n#STH 大暑 Second Term of Hot Season\n#AC 立秋 Autumn Commence\n#LTH 处暑 Last Term of Hot Season\n#FTD 白露 First Term of Dew Season\n#AE 秋分 Autumn Equinox\n#STD 寒露 Second Term of Dew Season\n#LTD 霜降 Last Term of Dew Season\n#WC 立冬 Winter Commence\n#FTS 小雪 First Term of Snowy Season\n#STS 大雪 Second Term of Snowy Season\n#WS 冬至 Winter Solstice\n\nIn general, there are 11 or 12 complete months and 2 incomplete months, which contains the winter solstice, in a solar year. The 11 mid-climates except the winter solstice are in the 11 or 12 complete months. The first month without a mid-climate is the leap month.\n\nThe complete months except the intercalary month, queues up from 0 to 10, and the incomplete months follows this queue, to be 11. The intercalary follows the queue number before by rule.\n\nCivil year\n\nThe civil year starts from the first spring month (1), and ends at the last winter month (0/0i). The first and last month is called as Zhēngyuè (, capital month) and Làyuè (, sacrificial month), and the other month is called according to the queue number (except that the 0th month is Shi'eryue, if the Layue is a leap month).\n\nThere are 12 or 13 months in each year. The years with 12 months, or 353~355 days, are common years. The years with 13 months, or 383~385 days, are long years.\n\nYears were numbered after the reign title in Ancient China, but the reign title was no longer used after the founding of PRC in 1949. People use the stem-branches to demarcate the years. For example, the year from February 8, 2016 to January 27, 2017 is a Bǐngshēnnían,  long.\n\nTo Encode the date in the Chinese calendar, the flag of the intercalary month should be considered. For example, Run Liuyue 6, Dingyounian: 408-6i-06 (Timestamp: 40806106)\n\nIn Tang Dynasty, the earthly branches are used to mark the months for about 150 days (Dec, 761~May, 762). At that time, the year starts from the month with Winter Solstice, and the month from Zhengyue to Layue are named as: Yinyue, Maoyue, Chenyue, Siyue, Wuyue, Weiyue, Shenyue Youyue, Xuyue, Haiyue, Ziyue, and Chouyue.\n\nEstimate the Chinese date\n\n#A month in the Chinese calendar is 29 or 30 days long, and a month in the Gregorian calendar is 30 or 31 days long (except for February). So, we may estimate the Chinese date if we know the bias between Layue 1st and January 1. In general, from Eryue/March, the Chinese date move 1 day backward, after a month; the Chinese date move a day forward after Zhengyue/February. Of course, if the bias is over 29 days, we should consider if there's an intercalary month before.\n#The date of the solar term in the Gregorian calendar is more or less fixed. In general, the date of the solar term in the Chinese calendar swing (±15 days) around the fixed date. The node of the climate term is around the 1st of the corresponding month, and the mid of the climate is round the 15th of the corresponding month.\n#A solar year is about 365 1/4 days, and 12 month is about 354 3/8 days. So the Chinese date move for about 11 days backward or 19 days forward. \n#In general, if the Chinese New Year locate at January, there's an intercalary month in this year.\n#The Chinese date is more or less fixed after 19 years (or 11 years occasionally) later. But, the dates near the intercalary month always are naughty. The dates in the winter of the nominal year of Merton cycle are naughty too, such as 2014+19n.\n\nGraphical representation \n\nA typical graphical representation of the Chinese calendar is the vernal cattle diagram (), which help people calculate the date. In the vernal cattle diagram: \n# The color of the cattle head marks the stem (five phases) of the year,\n# If the cattle mouth is closed, it is a yin year; if the cattle mouth open, it is a yang year, \n# The color of the cattle body marks the branch of the year.\n# The color of the cattle tail marks the stem (five phases) of the vernal commence.\n# If the cattle tail is on the left, vernal commence is a yang day; if the cattle tail is on the right, vernal commence is a yin day,\n# The color of the cattle knee and shin marks the branch of the vernal commence.\n# if the cowherd stand ahead the cattle, the vernal commence is 5+ days ahead the spring festival; if the cowherd stand behind the cattle, the vernal commence is 5+ days behind the spring festival; otherwise the bias between spring festival and vernal commence is within 5 days.\n\nAge recognition in China \n\nIn China, age for official use is based on the Gregorian calendar. For traditional use, age is based on the Chinese calendar. For the first year from the birthday, the child is considered one year old. After each New Year's Eve, add one year. \"Ring out the old age and ring in the new one ()\" is the literary express of New Year Ceremony. For example, if one's birthday is Làyuè 29th 2013, he is 2 years old at Zhēngyuè 1st 2014. On the other hand, people say months old instead of years old, if someone is too young. It is that the age sequence is \"1 month old, 2 months old, ... 10 months old, 2 years old, 3 years old...\".\n\nAfter the actual age () was introduced into China, the Chinese traditional age was referred to as the nominal age (). Divided the year into two halves by the birthday in the Chinese calendar, the nominal age is 2 older than the actual age in the first half, and the nominal age is 1 older than the actual age in the second half ().\n\nBirthday issue \n\nJust as it is awkward to define the birthday of someone born on the 29th of February in the Gregorian calendar, special rules are used for birthdays or other anniversaries during the intercalary month or on the 30th day.\n# If someone was born in an intercalary month (except intercalary Shi'eryue), his birthday is in the common month (the month before the intercalary month).\n# If someone was born in Shi'eryue, and Layue is the intercalary Shi'eryue, his birthday is in Layue (the last month of a year).\n# If someone was born at 30th day of a month, his birthday is the last day of the month, i.e. the 30th day if that exists, or the 29th day if it does not.\n\nYear number system \n\n; Era system\n\nIn the Ancient China, years were numbered from 1, beginning from the next year after a new emperor ascended the throne or the current emperor announced a new era name. The first reign title was Jiànyuán (, from 140 BCE), and the last reign title was Xuāntǒng (, from 1908 CE). The era system was abolished in 1912 CE, after which the Current Era or Republican era was used. The epoch of the Current Era is just the same as the era name of Emperor Ping of Han, Yuánshí ().\n\n; Stem-branches system\n\nThe 60 stem-branches were used to mark the date continually from Shang Dynasty. Before Han Dynasty, people knew the orbital period of Jupiter is about 4332 days, which is about 12*361 days. So, the orbital period of Jupiter was divided into 12 periods, which was used to number the year. The Jupiter was called as the star of age (), and the 1/12 Jupiter orbital period was called as the age ().\n\n361 days is just 6 cycles of 60-stem-branches, so the stem-branches of the first day move forward one after each sui. The first day of  each sui was called as the sui capital ().\n\nAnd the stem-branches of the taisui was used to mark the year. Obviously, there're two taisui in some year for the sui is shorter than solar rear. About after each 86 year, a taisui was leaped. The leaped of the sui was called as beyond the star ().\n\nAt the eastern Han Dynasty, the chaochen are abolished, and the 60 stem-branches are used to mark year continually without leap.\n\nThe Stem-branches year number system provided a solution for the defect of era system (unequal length of the reign titles)\n\n; Continuous year numbering\n\nOccasionally, nomenclature similar to that of the Christian era has been used, such as《辽宁大学学报：哲社版》，2004/06，43～50页\nAnno Huángdì (), referring to the beginning of the reign of the Yellow Emperor, 2698+AD=AH\nAnno Yáo (), referring to the beginning of the reign of Emperor Yao, 2156+AD=AY\nAnno Gònghé (), referring to the beginning of the Gonghe Regency, 841+AD=AG\nAnno Confucius (), referring to the birth year of Confucius, 551+AD=AC\nAnno Unity (), referring to the beginning of the reign of Qin Shi Huang, 221+AD=AU\nNo reference date is universally accepted.\n\nOn January 2, 1912, Sun Yat-sen declared a change to the official calendar and era. In his declaration, January 1, 1912 is called Shíyīyuè 13th, 4609 AH which assumes an epoch (1st year) of 2698 BCE. This declaration was adopted by many overseas Chinese communities outside Southeast Asia such as San Francisco's Chinatown.Aslaksen, p.38.\n\nIn the 17th century, the Jesuits tried to determine what year should be considered the epoch of the Han calendar. In his Sinicae historiae decas prima (first published in Munich in 1658), Martino Martini (1614–1661) dated the ascension of the Yellow Emperor to 2697 BC, but started the Chinese calendar with the reign of Fuxi, which he claimed started in 2952 BCE. Philippe Couplet's (1623–1693) Chronological table of Chinese monarchs (Tabula chronologica monarchiae sinicae; 1686) also gave the same date for the Yellow Emperor. The Jesuits' dates provoked great interest in Europe, where they were used for comparisons with Biblical chronology.\n\nModern Chinese chronology has generally accepted Martini's dates, except that it usually places the reign of the Yellow Emperor in 2698 BC and omits the Yellow Emperor's predecessors Fuxi and Shennong, who are considered \"too legendary to include\".\n\nStarting in 1903, radical publications started using the projected date of birth of the Yellow Emperor as the first year of the Han calendar. Different newspapers and magazines proposed different dates. Jiangsu, for example, counted 1905 as year 4396 (use an epoch of 2491 BCE), whereas the newspaper Ming Pao () reckoned 1905 as 4603 (use an epoch of 2698 BCE). Liu Shipei (; 1884–1919) created the Yellow Emperor Calendar, now often used to calculate the date, to show the unbroken continuity of the Han race and Han culture from earliest times. Liu's calendar started with the birth of the Yellow Emperor, which he determined to be 2711 BC. There is no evidence that this calendar was used before the 20th century. Liu calculated that the 1900 international expedition sent by the Eight-Nation Alliance to suppress the Boxer Rebellion entered Beijing in the 4611th year of the Yellow Emperor.\n\n; Calendric epoch\n\nThere is an epoch for each version of the Chinese calendar, which is called Lìyuán (). The epoch is the optimal origin of the calendar, and it is a Jiǎzǐrì, the first day of a lunar month, and the dark moon and solstice are just at the midnight (). And tracing back to a perfect day, such as that day with the magical star sign, there's a supreme epoch (). The continuous year based on the supreme epoch is shàngyuán jīnián (). More and more factors were added into the supreme epoch, and the shàngyuán jīnián became a huge number. So, the supreme epoch and shàngyuán jīnián were neglected from the Shòushí calendar.\n\n; Yuán-Huì-Yùn-Shì system\n\nShao Yong ( 1011–1077), a philosopher, cosmologist, poet, and historian who greatly influenced the development of Neo-Confucianism in China, introduced a time system in his The Ultimate which Manages the World ()\n\nIn his time system, 1 yuán (), which contains 12'9600 years, is a lifecycle of the world.  Each yuán is divided into 12 huì ().  Each huì is divided into 30 yùn (), and each yùn is divided into 12 shì ().  So, each shì is equivalent to 30 years.  The yuán-huì-yùn-shì corresponds with nián-yuè-rì-shí.  So the yuán-huì-yùn-shì is called the major tend or the numbers of the heaven, and the nián-yuè-rì-shí is called the minor tend or the numbers of the earth.\n\nThe minor tend of the birth is adapted by people for predicting destiny or fate. The numbers of nián-yuè-rì-shí are encoded with stem-branches and show a form of Bāzì. The nián-yuè-rì-shí are called the Four Pillars of Destiny. For example, the Bāzì of the Qianlong Emperor is Xīnmǎo, Dīngyǒu, Gēngwǔ, Bǐngzǐ (). Shào Huángjíjīngshì recorded the history of the timing system from the first year of the 180th yùn or 2149th shì (HYSN 0630-0101, 2577 BC) and marked the year with the reign title from the Jiǎchénnián of the 2156th shì (HYSN 0630-0811, 2357 BC, Tángyáo 1, ). According to this timing system, 2014-1-31 is HYSN/YR 0712-1001/0101.\n\nThe table below shows the kinds of year number system along with correspondences to the Western (Gregorian) calendar. Alternatively, see this larger table of the full 60-year cycle.\n\n1 As of the beginning of the Chinese year. AR=Anno the Republic of China\n2 Timestamp according to Huángjíjīngshì, as a format of Huìyùn-Shìnián.\n3 Huángdì era, using an epoch (year 1) of 2697 BC. Subtract 60 if using an epoch of 2637 BC. Add 1 if using an epoch of 2698 BC.\n\nPhenology\n\nThe plum rains season is the rainy season during the late spring and early summer. The plum rains season starts on the first Bǐngrì after the Corn on Ear, and ends on the first Wèirì after the Moderate Heat.\nThe Sanfu days are the three sections from the first Gēng-day after the summer solstice. The first section is 10 days long, and named the fore fu (). The second section is 10 or 20 days long, and named the mid fu (). The last section is 10 days long from the first Gēng-day after autumn commences, and named the last fu ().\nThe Shujiu cold days are the nine sections from the winter solstice. Each section is 9 days long. The shǔjǐu are the coldest days, and named with an ordinal number, such as Sìjǐu ().\n\nFestivals\n\nIn the Sinosphere, the traditional festivals are calculated using the date or solar terms, and are considered auspicious.\n\nHistory\n\nEarlier Chinese calendars\n\nBefore the Zhou dynasty,  the Chinese calendars used a solar calendar.\n\nAccording to Ancient Chinese literature, the first version was the five-phases calendar (), which came from the tying knots culture. In the five-phases calendar, a year was divided into five phases which were expressed by five  ropes. Each rope was folded into halves, and the day in the corner was the capital day (). They're three sections in each halves, and the Chinese Character of phase is the pictograph of the rope of the tying knots. The ten half-ropes were arranged into a row, and a man shape was engraved by the ropes. The part of man shape derived into 10 heaven stems. The days in each sections were recorded with 12 earthly branches. So, in the five-phases calendar, a year is fives phases or ten months, and a phase is six sections or 73 days. The remainder of each phases are marked in the Hetu, which is found in Song Dynasty.\n\nThe second version is the four-seasons calendar (). In the four-seasons calendar, the days were counting by ten, and three ten-days weeks were built into a month. There were 12 months in a year, and a week were intercalated in the hot month. In the age of four-seasons calendar, the 10 heaven stems and 12 earthly branches were used to mark days synchronously.\n\nThe third version is the balanced calendar () a year was defined into 365.25 days, and the month was defined into 29.5 days. And after each 16 months, a half-month was intercalated. There half-months were merged into months later, and the archetype of the Chinese calendar was  brought out in the Spring and Autumn ages.\n\nOracle bone records indicate that the calendar of Shang Dynasty were a balanced calendar, and the 12, 13, even 14 months were packed into a year roughly. Generally, the month after the winter solstice was named as the capital month ().http://www.newsmth.net/bbsanc.php?path%2Fgroups%2Fsci.faq%2FAstronomy%2Fbw%2Fall2%2Fbk37k%2FM.1275291864.z0&ap\n353\n\nAncient Chinese calendars\n\nPre-Qin dynasty calendars\n\nIn Zhou dynasty, the authority issued the official calendar, which is a primitive lunisolar calendar. The year beginning of Zhou's calendar () is the day with dark moon before the winter solstice, and the epoch is the Winter Solstice of a Dīngyǒu year.\n\nSome remote vassal states issued their own calendars upon the rule of Zhou's calendar, such as:\nThe epoch of the Lu's calendar () is the winter solstice of a Gēngzǐ year. \nDuring the Spring and Autumn period and Warring States period, Some vassal states got out of control of Zhou, and issues their own official calendar, such as:\nJin issued the Xia's calendar (), with a year beginning of the day with the nearest darkmoon to the Vernal Commences. The epoch of Xia's calendar is the Vernal Commences of a Bǐngyíng year.\nQin issued the Zhuanxu's calendar (), with a year beginning of the day with the nearest darkmoon to the Winter Commences. The epoch of Zhuanxu's calendar is the Winter Commences of a Yǐmǎo year.\nSong resumed the Yin's calendar (), with a year beginning of the day with the darkmoon after the Winter Solstice. The epoch of Yin's calendar is the  Winter Solstice of a Jiǎyíng year.\nThese six calendars are called as the six ancient calendars (), and are the quarter remainder calendars (). The months of these calendars begin on the day with the darkmoon, and there are 12 or 13 month within a year. The intercalary month is placed at the end of the year, and called as 13th month.\n\nThe modern version of the Zhuanxu's calendar is the Chinese Qiang calendar and Chinese Dai calendar, which are the calendar of mountain peoples.\n\nCalendar of the Qin and early Han dynasties\n\nAfter Qin Shi Huang unified China under the Qin dynasty in 221 BCE, Qin's calendar () was promulgated. The Qin's calendar follows the rules of Zhuanxu's calendar, but the month order follows the Xia calendar. The months in the year are from the 10th month to the 9th month, and the intercalary month is called as the second Jiuyue (). In the early Han dynasty, the Qin calendar continued to be used.\n\nTaichu calendar and the calendars from the Han to Ming dynasties.\n\nEmperor Wu of the Han dynasty introduced reforms halfway through his administration. His Taichu or Grand Inception Calendar ( introduced 24 solar terms which determined the month names. The solar year was defined as 365 385/1539 days, and divided into 24 solar terms. Each couples of solar terms are associated into 12 climate terms. The lunar month was defined as 29 43/81 days and named according to the closest climate term. The mid-climate in the month decides the month name, and a month without mid-climate is an intercalary month.\n\nThe Taichu calendar established the frame of the Chinese calendar, Ever since then, there have been over 100 official calendars in Chinese which are consecutive and follow the structure of Tàichū calendar both. There're several innovation in calendar calculation in the history of over 2100 years, such as:\nIn the Dàmíng Calendar released in Tiānjiān 9 (, 510) of the Liang dynasty, Zhu Chongzhi introduced the equation of equinoxes.\nActual syzygy method was adopted to decide the month from the Wùyín Yuán Calendar, which was released in Wǔdé 2 (, 619) of the Tang dynasty.\nThe real measured data was used in calendar calculation from Shòushí Calendar, which was released in Zhìyuán 18 (, 1281) of the Yuan dynasty. And the tropical year is fixed at 365.2425 days, the same as the Gregorian calendar established in 1582.,Asiapac Editorial. (2004). Origins of Chinese Science and Technology. Translated by Yang Liping and Y.N. Han. Singapore: Asiapac Books Pte. Ltd. , p.132. and derived spherical trigonometry.Needham, Joseph. (1959). Science and Civilization in China: Volume 3, Mathematics and the Sciences of the Heavens and the Earth. Cambridge University Press., reprinted Taipei: Caves Books, Ltd. (1986), pp. 109–110.Ho, Peng Yoke. (2000). Li, Qi, and Shu: An Introduction to Science and Civilization in China. Mineola: Dover Publications. . p. 105.Restivo, Sal. (1992). Mathematics in Society and History: Sociological Inquiries. Dordrecht: Kluwer Academic Publishers. . p. 32.\n\nModern Chinese calendars \n\nThe Chinese calendar lost the status of the official statutory calendar in China in the beginning of the 20th century,孙中山：“临时大总统改历改元通电”，载《孙中山全集》（第2卷），中华书局1982年版，页5。 however it has been continually being used for various purposes.\n\nBecause the Republic of China adopted the UTC+8 timezone instead of using Beijing Mean Solar Time in 1928 CE, Chinese calendars produced in Mainland China have switched to use UTC+8 in the following year. However, the switch in time standard used in Chinese calendars has not been universally adopted in areas like Taiwan and Hong Kong, and some calendars were still follow the last calendar of Qing dynasty that was published in 1908. In 1978, this practice caused confusion on what date the 1978 Mid-autumn festival occur, and caused those areas to switch to the UTC+8-based Chinese calendar thereafter.[http://www.math.nus.edu.sg/aslaksen/calendar/cal.pdf Mathematics of the Chinese calendar], pp. 28.\n\nShíxiàn calendar \n\nIn the late Ming dynasty, Xu Guangqi and his colleagues worked out the new calendar based on western astronomical arithmetic. But the new calendar was not released before the end of the Ming dynasty. In the early Qing dynasty, Johann Adam Schall von Bell submitted the calendar to the Shunzhi Emperor. The Qing government released the calendar under the name the Shíxiàn calendar, which means seasonal charter.\nIn the Shíxiàn calendar, the solar terms each correspond to 15° along the ecliptic. It meant the Chinese calendar can be used as astronomical calendar. However, the length of the climate term near the perihelion is shorter than 30 days and there may be two mid-climate terms. The rule of the mid-climate terms decides the months, which is used for thousands years, lose its validity. The Shíxiàn calendar changed the rule to \"decides the month in sequence, except the intercalary month.\"\n\nCurrent Chinese calendar\n\nThe version of the traditional Chinese calendar currently being used follows the rules of the Shíxiàn calendar, except that: \n# The baseline is Chinese Standard Time rather than Beijing local time.\n# Actual astronomical data is used rather than only theoretical mathematical calculations.\n\nProposals to optimize the Chinese calendar\n\nTo optimize the Chinese calendar, astronomers have released many proposed changes. A typical proposal was released by Gao Pingzi (; 1888-1970), a Chinese astronomer who was one of the founders of Purple Mountain Observatory. In his proposal, the month numbers are calculated before the dark moons and the solar terms were rounded to the day. Under his proposal, the month numbers are the same for the Chinese calendar upon different time zones.\n\nAs the intercalary month is determined by the first month without mid-climate and the exact time when each mid-climate happen would vary according to time zone, countries that have adopted the calendar but calculate with their own time could vary from the one used in China because of this. For instance, the 2012 FTG happened in UTC May 20 15:15, which would translate to May 20 23:15 in UTC+8, making FTG the mid-climate for the fourth month of that traditional Chinese year [April 21 ~ May 20 in Gregorian calendar], but in Korea it happened in May 21 00:15 in UTC+9, and as new moon take place in May 21 in that month, therefore the month before that would only consist of the SC solar term, lacking mid-climate. As a result, the month starting at April 21 would be an intercalary month in Korean calendar, but not in Chinese Calendar, and the intercalary month in Chinese calendar would start in the month after, in the fifth month starting from May 21, which would only consist of the solar term STG, while the month in Korean Calendar would have both FTG and STG solar term in it.\n\nOther practices \n\nAmong the ethnic groups inhabiting the mountains and plateaus of southwestern China, and those living in the grasslands of northern China, their civil calendars show a diversity of practice based upon their characteristic phenology and culture, but they are based on the algorithm of the Chinese calendar of different periods, especially those of the Tang dynasty and pre-Qin dynasty period. Chinese calendar. http://en.wikipedia.org/?curid=6966."
  }
}
