{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5829",
  "eid" : "d81a4750-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778442309,
  "textBody" : "Craig Joseph Charles (born 11 July 1964) is a British actor, comedian, author, poet, television presenter and DJ. He is best known for playing Dave Lister in the science fiction sitcom Red Dwarf and Lloyd Mullaney in the soap opera Coronation Street, as a funk and soul DJ on BBC Radio 6 Music and BBC Radio 2, and as the presenter of the gladiator-style game show Robot Wars from 1998 to 2004.\n\nCharles first appeared on television as a performance poet, which led to minor presenting roles. After finding fame in Red Dwarf, he regularly featured on national television with celebrity appearances on many popular shows while he continued to host a wide variety of programmes.\n\nCharles is also known for narrating the comedy endurance show Takeshi's Castle. From 2017, he has hosted The Gadget Show for Channel 5. His acting credits include playing inmate Eugene Buffy in the ITV drama The Governor, and leading roles in the British films Fated and Clubbing to Death. He has toured the UK extensively as a stand-up comedian.\n\nCharles has hosted The Craig Charles Funk and Soul Show on BBC radio since 2002, and performs DJ sets at numerous clubs and festivals, nationally and internationally. In September 2015, he left Coronation Street after ten years, to film new episodes of Red Dwarf.\n\nEarly life \n\nCharles was born in Liverpool to a Guyanese fatherLiverpool Echo, 22 November 2005, [http://www.thefreelibrary.com/Actor+Craig's+tribute+to+much-loved+father.-a0138994015 \"Actor Craig's tribute to much-loved father\"] and Irish mother.[http://www.bbc.co.uk/comedy/people/craig_charles_person_page.shtml \"Craig Charles person page\"] bbc.co.uk He grew up on the Cantril Farm housing estateThe Independent, 30 June 2012, Holly Williams [https://www.independent.co.uk/news/people/profiles/my-secret-life-craig-charles-47-dj-and-actor-7893368.html \"My Secret Life: Craig Charles, 47, DJ and actor\"], London with his older brother, Dean (who died in 2014), and younger brother, Emile. He attended West Derby Comprehensive School followed by Childwall Hall College of Further Education, studying A-levels in History, Government and Politics, English Literature and General Studies.The Independent, 11 February 1999, [https://www.independent.co.uk/news/people/profiles/education-passedfailed-craig-charles-1070071.html \"Education: Passed/Failed Craig Charles\"], London Charles won a national competition, run by The Guardian newspaper, for a poem he wrote when he was 12 years old.Interview with Charles by Chris Jarvis, Fully Booked, BBC TV, 1998  On leaving school Charles spent time working in a studio at Central Hall, Renshaw Street, Liverpool. Despite his origins, his eloquence in conversation and in his poetry (which he shared with colleagues) was something new at the time. With his gradual flowering as a poet emerged a certain boldness and self-confidence. \n\nEarly career \n\nCharles began his career as a contemporary and urban performance poet on the British cabaret circuit. His performances were considered original, with Charles described as having a natural ironic wit which appealed to talent scouts. In 1981, Charles climbed on stage at a Teardrop Explodes concert and recited a humorous, but derogatory, poem about the band's singer, Julian Cope. He was invited to open subsequent gigs for the group and went on to perform as a support act in pubs and clubs for the following three years,Q magazine, April 1987, David Housham \"Craig Charles: Compulsive Listening\", pp. 25–26 and at events such as the Larks in the Park music festival at Sefton Park (1982). He performed poetry at Liverpool's Everyman Theatre (1983) with such poets as Roger McGough and Adrian Henri.\n\nCharles was involved in the Liverpool music scene, writing and singing lyrics for a number of local rock bands.Craig Charles, Introduction to No Other Blue, Penguin Books Ltd, London, 1997 In 1980, he played keyboards, bass and provided voice in the rock band Watt 4.Daily Post, 16 September 2003, Chris Brown [http://webspace.webring.com/people/wj/junostar/CCicnetwork.html \"A club that rocked when punk was in its prime\"], Liverpool He performed his political rap lyrics as a 'Wordsmith'. In 1983, Charles was invited to record a session on the John Peel BBC Radio show, performing his poems backed by a band. This was his first professional engagement.The Craig Charles Funk and Soul Show, BBC Radio 6 Music, 12 May 2012 He recorded a further Peel Session in 1984.AL Peters, \"Craig Charles The Wordsmith, The John Peel Radio Show, 1984\", [http://www.groovinrecords.co.uk/ Groovin' Records]\n\nCharles realised he was using poetry as a vehicle for his sense of humour and progressed into stand-up comedy. He was part of the Red Wedge comedy tour in 1986, which aimed to raise awareness of the social problems of the time, in support of the Labour Party. He also performed his first one-man show in 1986,[http://special.lib.gla.ac.uk/sta/search/detaile.cfm?EID19588 Raising the Roof for the Gateway Exchange], 29 August 1986, Edinburgh Festival Fringe which premiered in Edinburgh, and then toured internationally.The Glasgow Herald, 13 August 1987, Andrew Young [https://news.google.com/newspapers?nid\n2507&dat19870813&id\nyDpAAAAAIBAJ&sjidWFkMAAAAIBAJ&pg\n2116,2850085 The Fringe: Craig Charles] Charles was a guest on programmes including Janice Long's Radio 1 show, and was a regular panellist on Ned Sherrin's chat show Loose Ends (1987–88) on BBC Radio 4.\n\nTelevision career \n\nPerformance poetry \n\nCharles first appeared on television as the resident poet on the arts programme Riverside on BBC2 and on the day-time BBC1 chat show Pebble Mill at One.Birmingham Mail, 2 July 2011, [http://www.birminghammail.net/news/top-stories/2011/07/02/craig-charles-returns-to-birmingham-for-the-mostly-jazz-festival-97319-28979805/ \"Craig Charles returns to Birmingham for the Mostly Jazz festival\"] Charles was the resident poet on the Channel 4 programme Black on Black (1985)\"Craig Charles poet/broadcaster\", Black on Black, 1985, [http://www.search.digitalhandsworth.org.uk/engine/resource/exhibition/standard/child.asp?txtKeywords&lstContext\n&lstResourceType&lstExhibitionType\n3&chkPurchaseVisible&txtDateFrom\n&txtDateTo&x1\n&y1&x2\n&y2&scale\n&theme&album\n&viewpage%2Fengine%2Fresource%2Fexhibition%2Fstandard%2Fchild.asp&originator\n%2Fengine%2Fcustom%2Fgallery.asp&page&records\n&direction&pointer\n&text0&resource\n598&exhibition445&offset\n16 Digital Handsworth] and its entertainment-based successor Club Mix (1986), and he appeared, weekly, as a John Cooper Clarke-style 'punk poet' on the BBC Two pop music programme Oxford Road Show (ORS). Charles performed his political poems as stand-up comedy on the late-night show Saturday Live (1985–87) and on the prime-time BBC One chat show Wogan (1986–87), where he performed a topical poem in a weekly feature. He also appeared as a guest on shows including Open Air (1988). Charles included significant acting in his performance style, enabling him to put the emotion across.Charles interviewed on the Steve Jones Show, LBC Radio (London), 16 March 1989\nIn September 2015, Charles performed his \"epic\" poem Scary Fairy and the Tales of the Dark Wood live with the BBC Philharmonic orchestra, in a concert to be broadcast on BBC Radio 2's Friday Night is Music Night at Halloween.\n\nRed Dwarf \n\nCharles acquired cult status in 1988 in his first television acting role as the Liverpudlian slob Dave Lister in science fiction comedy series Red Dwarf. Charles has appeared in all twelve series. Charles' younger brother, Emile Charles, guest-starred in the Series III episode \"Timeslides\", and the songs \"Bad News\" and \"Cash\" in this episode were written by Charles and performed by his band.Andrew Ellard, Red Dwarf series III DVD boxset Collector's Booklet, Grant Naylor Productions, 2003, pp. 8 The role has involved Charles playing a variety of alternative characters, including a gangster, a cowboy and angelic and evil versions of Lister,TV Zone, November 1993, Carrie Cantor \"Red Dwarf Interview: Lager Lout Lister\", pp. 8–11 and in him carrying out a wide range of stunts, and acting involving special effects. All series, except VII and IX, were recorded in front of a studio audience. Along with Danny John-Jules, Charles is one of only two cast members to appear in every episode of Red Dwarf to date.\n\nCharles reads the audiobook editions of both the Red Dwarf novel Last Human and his book The Log: A Dwarfer's Guide to Everything, and he regularly attends sci-fi, comedy and memorabilia conventions in connection with the Red Dwarf franchise. During Back to Earth, Lister visits the set of Coronation Street, where he meets the actor Craig Charles.Blokely, 7 November 2012, James York & Richard Luck [http://blokely.com/entertainment/craig-charles-interview-red-dwarf-x \" Craig Charles: Funk & Soul x Sci-fi\"]\n\nRobot Wars \n\nCharles presented Robot Wars on BBC2 (1998–2003) and Channel 5 (2003–04), from series 2 until series 7, which included two Extreme series and numerous 'specials'. Charles was the main host and presided over the arena in which teams of amateur engineers battled their home-made radio-controlled robots against each other, and against the house robots. Charles introduced the show, enthusiastically announced the results of the battles and spoke to the contestants after the main events. He ended each episode with a short Robot Wars-themed poem. Charles' son, Jack, appeared on the show on several occasions, and was a contestant on \"Team Nemesis\" during series 4. Charles also hosted the Robot Wars Live UK tour, in 2001 and shows performed at the Wembley Arena. On 13 January 2016, The BBC announced that the show would be rebooted with 6 episodes in the year. On 14 January 2016, Charles posted a tweet on his Twitter page saying that he would love to present the new series, however he received no reply from the BBC. On 3 February 2016, Dara Ó Briain was announced as Charles' replacement as the presenter. The BBC also stated that they had denied Charles' request to reprise his role by stating that they don't comment on individual casting enquiries.\n\nTakeshi's Castle \n\nCharles provided the English voice-over commentary for the Challenge and Ftn (2002–04) rebroadcast of the popular game show Takeshi's Castle originally by Tokyo Broadcasting System in Japan. In each episode, between 100 and 142 contestants attempted to pass a series of wacky and near-impossible physical challenges to reach the Show Down at the castle against a Japanese actor Takeshi Kitano for a chance to win large cash prizes. Charles co-wrote the programme and commentated throughout all 122 episodes of the four series, and also some special and \"best of\" episodes. He provided comedy insights into the contestants' abilities, which were designed to appeal to adult audiences, as well as younger viewers - and also coined the term \"Keshi Heads\" to describe fans of the show.\n\nCharles' commentary was so well received that the reboot featuring Dick and Dom on the voice-overs did not fare as well because he wasn't there, according to complaints that Challenge received via social media. To this day, the Challenge rebroadcasts of Takeshi's Castle regularly place in the weekly top 10 for ratings with an average of 130,000 viewers per episode.\n\nCoronation Street \n\nIn 2005, Charles joined the main cast of Coronation Street, playing philandering taxicab driver, Lloyd Mullaney. Charles introduced aspects of the character himself, making Lloyd a Northern Soul DJ and record collector, and funk music enthusiast. Charles has chosen funk and soul songs playing as backing tracks during scenes, and posters for The Craig Charles Funk & Soul Club and Red Dwarf have appeared in the background.\n\nCharles portrayed Lloyd as tough, but kind hearted and romantic, and the character was popular with viewers. Charles added a comedy element to the role, but was also involved in traumatic and emotional scenes with intricate storylines. In 2010, his character was involved in the show's dramatic 50th anniversary tram crash storyline, which was broadcast live. Charles presented documentaries for the show, including 50 Years of Corrie Stunts (2010), which is included on the Tram Crash DVD. In November 2011, Charles took time off from Coronation Street to film a new series of Red Dwarf, returning in April 2012.[http://futureradio.co.uk/audio/by/title/kate_roma_interviews_craig_charles \"Kate Roma Interviews Craig Charles\"] , Future Radio, Norwich, 27 April 2012 In February 2014 an online mini-series, Steve & Lloyd's Streetcar Stories, ran alongside the television show's storyline.\n\nIn May 2015, Craig announced he would be leaving Coronation Street for Red Dwarf.  Lloyd left in a red Cadillac during the live episode on 23 September, although his final pre-recorded farewell scenes with Steve were shown during the following episode.\n\nOther acting roles \n\nCharles has acted in episodes of popular dramas such as The Bill (1995), EastEnders (2002) and Holby City (2003) and in the comedy The 10 Percenters (1996). Charles played the emotionally disturbed and violent prisoner, Eugene Buffy, in the highly successful Lynda La Plante drama series The Governor (1996); the title role in the Channel 4 pirate sitcom Captain Butler (1997); the warden of a women's prison in the Canadian sci-fi fantasy Lexx (2001); Detective Chief Inspector Mercer in seven episodes of the BBC soap opera Doctors (2003); and soccer agent, Joel Brooks, in the Sky TV football soap Dream Team (2004).\n\nOther presenting roles \n\nCharles has presented children's television programmes, including What's That Noise? (1989) and Parallel 9 (1992) on BBC1 and Go Getters (1994) on ITV. He was the travelling reporter for the highly acclaimed, but controversial, BBC 'mockumentary' Ghostwatch, which tricked viewers into believing it was a live investigation into ghost sightings in a suburban home on Halloween night (1992). Charles presented the virtual reality game show Cyberzone (1993) on BBC2; the late-night entertainment show Funky Bunker (1997) on ITV; the reality show Jailbreak (2000) on Channel 5; the discussion show Amazing Space: The Pub Guide to the Universe (2001) on National Geographic; and the late-night current affairs chat show Weapons of Mass Distraction (2004) on ITV.\n\nOther appearances \n\nCharles has appeared on celebrity editions of University Challenge (1998), Can't Cook, Won't Cook (1998), The Weakest Link (2004), The Chase (2012) and Pointless (2013), and comedy panel shows such as Have I Got News for You (1995), Just a Minute (1995) and They Think It's All Over (1996) and Keith Lemon's Through the Keyhole (2014). He was a team captain on the sci-fi quiz series Space Cadets (1997) on Channel 4, which guest starred William Shatner. Charles has opened the National Lottery draw (1997) and his home has featured on Through the Keyhole. Charles was a contestant in the Celebrity Poker Club tournament (2004) on Challenge, where he reached the semi-finals, and in the Channel 4 reality game show, The Games (2005), which documented the contestants' intensive training regime and each live Olympic Games-style sporting event.\n\nFrom 16 November 2014, Charles took part in the fourteenth series of I'm a Celebrity...Get Me Out of Here!. However, on 20 November, Charles left the series soon after learning of his brother Dean's death from a heart attack.\n\nRadio \n\nAs well as his early appearances on shows such as Radio 4's Loose Ends (1987–88), and Kaleidoscope, in the early 1990s, Charles could be heard on the London Radio Station Kiss 100 (Kiss FM) as the Breakfast show presenter. In 1995, Charles played the Porter in Steven Berkoff's adaptation of Shakespeare's Macbeth, on Radio 4.\n\nSince 2002, Charles has been a DJ on BBC Radio 6 Music presenting The Craig Charles Funk and Soul Show, on air on Saturday evenings 6pm to 9pm, where he plays a diverse range of funk and soul music, from classic tracks to the latest releases, and provides publicity for less familiar bands. Charles explains the context for the music and carries out interviews with guest musicians. He was with the station at its launch, and while it was being tested during the previous year, under the name Network Y. Charles has also hosted the station's Breakfast Show (2004), and sits in for other presenters including Andrew Collins, Phil Wilding and Phill Jupitus and Radcliffe & Maconie.\n\nFrom January until November 2014, Charles also broadcast the Funk and Soul Show live on BBC Radio 2, immediately after his 6 Music show. He regularly sits in for Janice Long, Steve Wright and Jo Whiley, and has presented numerous programmes on the station, including The Craig Charles Soul All-Nighter (2011), which he hosted continuously for 12 hours, and the Beatleland (2012) documentary on The Beatles. Charles has also chosen music as a guest of other broadcasters such as Ken Bruce on Radio 2 and Liz Kershaw on 6 Music.  Charles covered for Graham Norton on Radio 2's Saturday mid-morning show during Norton's 10-week 2015 summer break.\nFrom 16 April 2016, Charles presents the House Party on Saturday nights on BBC Radio 2, with the show airing between 10pm and midnight.\n\nMusic \n\nCharles has been involved in the music industry through much of his career. His bands have included Watt 4 (1980), in which he played keyboards and sang, Craig Charles and the Beat Burglars (1989), The Sons of Gordon Gekko (1989), where he wrote lyrics and also composed tunes and The Eye (2000–02), with whom he recorded the rock album \"Giving You The Eye, Live at the Edinburgh Festival\". Charles plays guitar and piano.\n\nIn 1987, Charles provided the poem track used for the opening credits of the BBC series The Marksman (in which he also acted), which is included on the album \"The Marksman: Music from the BBC TV series\". Charles wrote lyrics for Suzanne Rhatigan's album To Hell With Love (1992). In 1993, Charles was signed to the Acid Jazz record label.Interview with Charles by Terry Christian, The Word, Channel 4, 1994\n\nIn 2009, Charles formed the Fantasy Funk Band from the leading British musicians in the genre, and has presented the band at festivals, including Glastonbury and the BBC's Proms in the Park. As a continuation of his 6 Music show, Charles regularly takes the Craig Charles Funk & Soul Club to varied venues across the UK and abroad, and to the major UK music festivals. He performs live DJ sets, occasionally comperes and curates events, including his own Craig Charles Fantasy Weekender, and has broadcast the radio show live from festival locations.\n\nIn 2012, Charles released the compilation album The Craig Charles Funk & Soul Club, on CD and as a digital download, as part of a three-album dealMetro, 28 November 2012, Andrew Williams [http://www.metro.co.uk/tv/919157-craig-charles-i-only-thought-red-dwarf-would-last-two-series \"Craig Charles\"], London with Freestyle Records.Freestyle Records, 26 November 2012 [http://www.freestylerecords.co.uk/index.php/the-craig-charles-funk-soul-club/ \"ALBUM: The Craig Charles Funk & Soul Club\"] The second volume was released in the same format in 2013, and the third in 2014. He followed these with a Craig Charles Funk and Soul Classics album of 3 CDs in 2015.\n\nStand-up comedy and theatre \n\nCharles returned to stand-up comedy between 1995The Independent, 20 September 1995, [http://www.highbeam.com/doc/1P2-4740730.html \"Comedy: Craig Charles Speaks, Duke of York's Theatre, London\"], London and 2001, regularly touring his one-man adult-rated shows nationally and releasing the videos Craig Charles: Live on Earth! (1995), Live Official Bootleg (1996) and Sickbag (2000). International performances included the Great Norwegian Comedy Festival and the Melbourne International Comedy Festival.\n\nCharles appeared in the John Godber comedy play Teechers, in which he swapped in and out of various roles, at the Arts Theatre, London, and at the Edinburgh Festival (1989), and he played Idle Jack in the pantomime Dick Whittington, at the Hull New Theatre (1997). In 2000, he performed the show Craig Charles and His Band at the Edinburgh Festival.\n\nCharles has a regular slot at Butlins Minehead House Of Fun Weekend every November for 3 nights, of DJ'ing, Comedy and singing.http://www.bigweekends.com/the-weekends/specialist-music-weekends/madness-house-of-fun-weekender.aspx#ito=FW_Madness\n\nFilm roles \n\nCharles played Eddie in the 1987 political drama Business as Usual. In 2006, Charles starred in two British feature films: the fantasy film Fated and the gangster film Clubbing to Death. Charles voiced Zipper the Cat in the animation Prince Cinders (1993) and Asterix in Asterix Conquers America (1994). Roles in short films include playing Keith Dennis in the comedy The Colour of Funny (1999) and Mark in the drama Ten Minutes (2004).\n\nWriting \n\nIn 1993, Charles worked with Russell Bell on the Craig Charles Almanac of Total Knowledge, writing about his 'streetwise' sense of humour on a range of topics, from the world's most embarrassing stories to how to explain the mysteries of the universe. In 1997, Charles and Bell wrote Charles' Red Dwarf character's book The Log, in which Lister decides to leave a log detailing mankind's greatest achievements. In 1998, Charles published No Other Blue, a collection of his poetry, with illustrations by Philippa Drakeford, on diverse personal subjects including prison, his mother's final illness, love and politics at home and abroad. More recently he has written a series of nursery rhymes titled \"Scary Fairy and the Tales of the Dark Wood\".\n\nIn 2000, Charles wrote his first autobiography about his experiences growing up in Liverpool, titled No Irish, No Niggers. In 2007, he announced he would release his autobiography, planned for March 2008, published by Hodder Headline and titled On the Rocks, which would cover the recent incidents in his life and be based on much of his journal, which Charles said he kept while in rehab.\n\nCharles has been involved in journalism and has had a column in Time Out magazine. In 1994, he launched a single issue of Comedy magazine with articles dedicated to the comedy circuit. In 2005 and 2006, Charles was a monthly columnist for the Liverpool Echo newspaper. His television writing credits include The Easter Stories (1994), Funky Bunker (1997) and Takeshi's Castle (2002).\n\nPersonal life \n\nRelationships \n\nIn 1984, Charles married English actress Cathy Tyson. Their son, Jack, was born in 1988. The couple divorced in 1989.\n\nIn 1999, Charles married his second wife, Jackie, with whom he has two daughters, Anna-Jo (born 1997) and Nellie (born 2003).\n\nLegal issues and acquittal \n\nIn July 1994, Charles and a friend were arrested and remanded in custody for three months on a rape charge. In March 1995, both men were acquitted in their trial. After being cleared, Charles spoke of the need to restore anonymity for those accused of rape. He stated that \"the fact that my name and address along with my picture can appear on the front of the papers before the so-called 'victim' has even signed a statement proves that anonymity for rape defendants is a must and that the law must be changed.\" While in prison, Charles was attacked by a man wielding a knife.\n\nDrug use \n\nIn June 2006, newspaper allegations of crack cocaine use resulted in Charles being suspended from both Coronation Street and BBC Radio 6 Music. In August, Charles was arrested and released on bail pending further enquiries, and in September he accepted a caution for possession of a Class A drug. Charles returned to hosting his 6 Music show from November 2006 and filming Coronation Street from January 2007.\n\nCredits \n\n, 2007\n\nFilmography\n\nRadio \n\nBibliography \n\nPublished\n\n* 1993, Craig Charles Almanac of Total Knowledge, (with Russell Bell), Penguin Books\n* 1997, The Log: A Dwarfer's Guide to Everything, (with Russell Bell), Penguin Books\n* 1998, No Other Blue, (illustrations by Philippa Drakeford), Penguin Books\n\nUnpublished\n\n* 2000, No Irish, No Niggers, Penguin Books \n* 2008, On the Rocks, Hodder Headline",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Craig Charles" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5829" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Craig Joseph Charles (born 11 July 1964) is a British actor, comedian, author, poet, television presenter and DJ. He is best known for playing Dave Lister in the science fiction sitcom Red Dwarf and Lloyd Mullaney in the soap opera Coronation Street, as a funk and soul DJ on BBC Radio 6 Music and BBC Radio 2, and as the presenter of the gladiator-style game show Robot Wars from 1998 to 2004.\n\nCharles first appeared on television as a performance poet, which led to minor presenting roles. After finding fame in Red Dwarf, he regularly featured on national television with celebrity appearances on many popular shows while he continued to host a wide variety of programmes.\n\nCharles is also known for narrating the comedy endurance show Takeshi's Castle. From 2017, he has hosted The Gadget Show for Channel 5. His acting credits include playing inmate Eugene Buffy in the ITV drama The Governor, and leading roles in the British films Fated and Clubbing to Death. He has toured the UK extensively as a stand-up comedian.\n\nCharles has hosted The Craig Charles Funk and Soul Show on BBC radio since 2002, and performs DJ sets at numerous clubs and festivals, nationally and internationally. In September 2015, he left Coronation Street after ten years, to film new episodes of Red Dwarf.\n\nEarly life \n\nCharles was born in Liverpool to a Guyanese fatherLiverpool Echo, 22 November 2005, [http://www.thefreelibrary.com/Actor+Craig's+tribute+to+much-loved+father.-a0138994015 \"Actor Craig's tribute to much-loved father\"] and Irish mother.[http://www.bbc.co.uk/comedy/people/craig_charles_person_page.shtml \"Craig Charles person page\"] bbc.co.uk He grew up on the Cantril Farm housing estateThe Independent, 30 June 2012, Holly Williams [https://www.independent.co.uk/news/people/profiles/my-secret-life-craig-charles-47-dj-and-actor-7893368.html \"My Secret Life: Craig Charles, 47, DJ and actor\"], London with his older brother, Dean (who died in 2014), and younger brother, Emile. He attended West Derby Comprehensive School followed by Childwall Hall College of Further Education, studying A-levels in History, Government and Politics, English Literature and General Studies.The Independent, 11 February 1999, [https://www.independent.co.uk/news/people/profiles/education-passedfailed-craig-charles-1070071.html \"Education: Passed/Failed Craig Charles\"], London Charles won a national competition, run by The Guardian newspaper, for a poem he wrote when he was 12 years old.Interview with Charles by Chris Jarvis, Fully Booked, BBC TV, 1998  On leaving school Charles spent time working in a studio at Central Hall, Renshaw Street, Liverpool. Despite his origins, his eloquence in conversation and in his poetry (which he shared with colleagues) was something new at the time. With his gradual flowering as a poet emerged a certain boldness and self-confidence. \n\nEarly career \n\nCharles began his career as a contemporary and urban performance poet on the British cabaret circuit. His performances were considered original, with Charles described as having a natural ironic wit which appealed to talent scouts. In 1981, Charles climbed on stage at a Teardrop Explodes concert and recited a humorous, but derogatory, poem about the band's singer, Julian Cope. He was invited to open subsequent gigs for the group and went on to perform as a support act in pubs and clubs for the following three years,Q magazine, April 1987, David Housham \"Craig Charles: Compulsive Listening\", pp. 25–26 and at events such as the Larks in the Park music festival at Sefton Park (1982). He performed poetry at Liverpool's Everyman Theatre (1983) with such poets as Roger McGough and Adrian Henri.\n\nCharles was involved in the Liverpool music scene, writing and singing lyrics for a number of local rock bands.Craig Charles, Introduction to No Other Blue, Penguin Books Ltd, London, 1997 In 1980, he played keyboards, bass and provided voice in the rock band Watt 4.Daily Post, 16 September 2003, Chris Brown [http://webspace.webring.com/people/wj/junostar/CCicnetwork.html \"A club that rocked when punk was in its prime\"], Liverpool He performed his political rap lyrics as a 'Wordsmith'. In 1983, Charles was invited to record a session on the John Peel BBC Radio show, performing his poems backed by a band. This was his first professional engagement.The Craig Charles Funk and Soul Show, BBC Radio 6 Music, 12 May 2012 He recorded a further Peel Session in 1984.AL Peters, \"Craig Charles The Wordsmith, The John Peel Radio Show, 1984\", [http://www.groovinrecords.co.uk/ Groovin' Records]\n\nCharles realised he was using poetry as a vehicle for his sense of humour and progressed into stand-up comedy. He was part of the Red Wedge comedy tour in 1986, which aimed to raise awareness of the social problems of the time, in support of the Labour Party. He also performed his first one-man show in 1986,[http://special.lib.gla.ac.uk/sta/search/detaile.cfm?EID19588 Raising the Roof for the Gateway Exchange], 29 August 1986, Edinburgh Festival Fringe which premiered in Edinburgh, and then toured internationally.The Glasgow Herald, 13 August 1987, Andrew Young [https://news.google.com/newspapers?nid\n2507&dat19870813&id\nyDpAAAAAIBAJ&sjidWFkMAAAAIBAJ&pg\n2116,2850085 The Fringe: Craig Charles] Charles was a guest on programmes including Janice Long's Radio 1 show, and was a regular panellist on Ned Sherrin's chat show Loose Ends (1987–88) on BBC Radio 4.\n\nTelevision career \n\nPerformance poetry \n\nCharles first appeared on television as the resident poet on the arts programme Riverside on BBC2 and on the day-time BBC1 chat show Pebble Mill at One.Birmingham Mail, 2 July 2011, [http://www.birminghammail.net/news/top-stories/2011/07/02/craig-charles-returns-to-birmingham-for-the-mostly-jazz-festival-97319-28979805/ \"Craig Charles returns to Birmingham for the Mostly Jazz festival\"] Charles was the resident poet on the Channel 4 programme Black on Black (1985)\"Craig Charles poet/broadcaster\", Black on Black, 1985, [http://www.search.digitalhandsworth.org.uk/engine/resource/exhibition/standard/child.asp?txtKeywords&lstContext\n&lstResourceType&lstExhibitionType\n3&chkPurchaseVisible&txtDateFrom\n&txtDateTo&x1\n&y1&x2\n&y2&scale\n&theme&album\n&viewpage%2Fengine%2Fresource%2Fexhibition%2Fstandard%2Fchild.asp&originator\n%2Fengine%2Fcustom%2Fgallery.asp&page&records\n&direction&pointer\n&text0&resource\n598&exhibition445&offset\n16 Digital Handsworth] and its entertainment-based successor Club Mix (1986), and he appeared, weekly, as a John Cooper Clarke-style 'punk poet' on the BBC Two pop music programme Oxford Road Show (ORS). Charles performed his political poems as stand-up comedy on the late-night show Saturday Live (1985–87) and on the prime-time BBC One chat show Wogan (1986–87), where he performed a topical poem in a weekly feature. He also appeared as a guest on shows including Open Air (1988). Charles included significant acting in his performance style, enabling him to put the emotion across.Charles interviewed on the Steve Jones Show, LBC Radio (London), 16 March 1989\nIn September 2015, Charles performed his \"epic\" poem Scary Fairy and the Tales of the Dark Wood live with the BBC Philharmonic orchestra, in a concert to be broadcast on BBC Radio 2's Friday Night is Music Night at Halloween.\n\nRed Dwarf \n\nCharles acquired cult status in 1988 in his first television acting role as the Liverpudlian slob Dave Lister in science fiction comedy series Red Dwarf. Charles has appeared in all twelve series. Charles' younger brother, Emile Charles, guest-starred in the Series III episode \"Timeslides\", and the songs \"Bad News\" and \"Cash\" in this episode were written by Charles and performed by his band.Andrew Ellard, Red Dwarf series III DVD boxset Collector's Booklet, Grant Naylor Productions, 2003, pp. 8 The role has involved Charles playing a variety of alternative characters, including a gangster, a cowboy and angelic and evil versions of Lister,TV Zone, November 1993, Carrie Cantor \"Red Dwarf Interview: Lager Lout Lister\", pp. 8–11 and in him carrying out a wide range of stunts, and acting involving special effects. All series, except VII and IX, were recorded in front of a studio audience. Along with Danny John-Jules, Charles is one of only two cast members to appear in every episode of Red Dwarf to date.\n\nCharles reads the audiobook editions of both the Red Dwarf novel Last Human and his book The Log: A Dwarfer's Guide to Everything, and he regularly attends sci-fi, comedy and memorabilia conventions in connection with the Red Dwarf franchise. During Back to Earth, Lister visits the set of Coronation Street, where he meets the actor Craig Charles.Blokely, 7 November 2012, James York & Richard Luck [http://blokely.com/entertainment/craig-charles-interview-red-dwarf-x \" Craig Charles: Funk & Soul x Sci-fi\"]\n\nRobot Wars \n\nCharles presented Robot Wars on BBC2 (1998–2003) and Channel 5 (2003–04), from series 2 until series 7, which included two Extreme series and numerous 'specials'. Charles was the main host and presided over the arena in which teams of amateur engineers battled their home-made radio-controlled robots against each other, and against the house robots. Charles introduced the show, enthusiastically announced the results of the battles and spoke to the contestants after the main events. He ended each episode with a short Robot Wars-themed poem. Charles' son, Jack, appeared on the show on several occasions, and was a contestant on \"Team Nemesis\" during series 4. Charles also hosted the Robot Wars Live UK tour, in 2001 and shows performed at the Wembley Arena. On 13 January 2016, The BBC announced that the show would be rebooted with 6 episodes in the year. On 14 January 2016, Charles posted a tweet on his Twitter page saying that he would love to present the new series, however he received no reply from the BBC. On 3 February 2016, Dara Ó Briain was announced as Charles' replacement as the presenter. The BBC also stated that they had denied Charles' request to reprise his role by stating that they don't comment on individual casting enquiries.\n\nTakeshi's Castle \n\nCharles provided the English voice-over commentary for the Challenge and Ftn (2002–04) rebroadcast of the popular game show Takeshi's Castle originally by Tokyo Broadcasting System in Japan. In each episode, between 100 and 142 contestants attempted to pass a series of wacky and near-impossible physical challenges to reach the Show Down at the castle against a Japanese actor Takeshi Kitano for a chance to win large cash prizes. Charles co-wrote the programme and commentated throughout all 122 episodes of the four series, and also some special and \"best of\" episodes. He provided comedy insights into the contestants' abilities, which were designed to appeal to adult audiences, as well as younger viewers - and also coined the term \"Keshi Heads\" to describe fans of the show.\n\nCharles' commentary was so well received that the reboot featuring Dick and Dom on the voice-overs did not fare as well because he wasn't there, according to complaints that Challenge received via social media. To this day, the Challenge rebroadcasts of Takeshi's Castle regularly place in the weekly top 10 for ratings with an average of 130,000 viewers per episode.\n\nCoronation Street \n\nIn 2005, Charles joined the main cast of Coronation Street, playing philandering taxicab driver, Lloyd Mullaney. Charles introduced aspects of the character himself, making Lloyd a Northern Soul DJ and record collector, and funk music enthusiast. Charles has chosen funk and soul songs playing as backing tracks during scenes, and posters for The Craig Charles Funk & Soul Club and Red Dwarf have appeared in the background.\n\nCharles portrayed Lloyd as tough, but kind hearted and romantic, and the character was popular with viewers. Charles added a comedy element to the role, but was also involved in traumatic and emotional scenes with intricate storylines. In 2010, his character was involved in the show's dramatic 50th anniversary tram crash storyline, which was broadcast live. Charles presented documentaries for the show, including 50 Years of Corrie Stunts (2010), which is included on the Tram Crash DVD. In November 2011, Charles took time off from Coronation Street to film a new series of Red Dwarf, returning in April 2012.[http://futureradio.co.uk/audio/by/title/kate_roma_interviews_craig_charles \"Kate Roma Interviews Craig Charles\"] , Future Radio, Norwich, 27 April 2012 In February 2014 an online mini-series, Steve & Lloyd's Streetcar Stories, ran alongside the television show's storyline.\n\nIn May 2015, Craig announced he would be leaving Coronation Street for Red Dwarf.  Lloyd left in a red Cadillac during the live episode on 23 September, although his final pre-recorded farewell scenes with Steve were shown during the following episode.\n\nOther acting roles \n\nCharles has acted in episodes of popular dramas such as The Bill (1995), EastEnders (2002) and Holby City (2003) and in the comedy The 10 Percenters (1996). Charles played the emotionally disturbed and violent prisoner, Eugene Buffy, in the highly successful Lynda La Plante drama series The Governor (1996); the title role in the Channel 4 pirate sitcom Captain Butler (1997); the warden of a women's prison in the Canadian sci-fi fantasy Lexx (2001); Detective Chief Inspector Mercer in seven episodes of the BBC soap opera Doctors (2003); and soccer agent, Joel Brooks, in the Sky TV football soap Dream Team (2004).\n\nOther presenting roles \n\nCharles has presented children's television programmes, including What's That Noise? (1989) and Parallel 9 (1992) on BBC1 and Go Getters (1994) on ITV. He was the travelling reporter for the highly acclaimed, but controversial, BBC 'mockumentary' Ghostwatch, which tricked viewers into believing it was a live investigation into ghost sightings in a suburban home on Halloween night (1992). Charles presented the virtual reality game show Cyberzone (1993) on BBC2; the late-night entertainment show Funky Bunker (1997) on ITV; the reality show Jailbreak (2000) on Channel 5; the discussion show Amazing Space: The Pub Guide to the Universe (2001) on National Geographic; and the late-night current affairs chat show Weapons of Mass Distraction (2004) on ITV.\n\nOther appearances \n\nCharles has appeared on celebrity editions of University Challenge (1998), Can't Cook, Won't Cook (1998), The Weakest Link (2004), The Chase (2012) and Pointless (2013), and comedy panel shows such as Have I Got News for You (1995), Just a Minute (1995) and They Think It's All Over (1996) and Keith Lemon's Through the Keyhole (2014). He was a team captain on the sci-fi quiz series Space Cadets (1997) on Channel 4, which guest starred William Shatner. Charles has opened the National Lottery draw (1997) and his home has featured on Through the Keyhole. Charles was a contestant in the Celebrity Poker Club tournament (2004) on Challenge, where he reached the semi-finals, and in the Channel 4 reality game show, The Games (2005), which documented the contestants' intensive training regime and each live Olympic Games-style sporting event.\n\nFrom 16 November 2014, Charles took part in the fourteenth series of I'm a Celebrity...Get Me Out of Here!. However, on 20 November, Charles left the series soon after learning of his brother Dean's death from a heart attack.\n\nRadio \n\nAs well as his early appearances on shows such as Radio 4's Loose Ends (1987–88), and Kaleidoscope, in the early 1990s, Charles could be heard on the London Radio Station Kiss 100 (Kiss FM) as the Breakfast show presenter. In 1995, Charles played the Porter in Steven Berkoff's adaptation of Shakespeare's Macbeth, on Radio 4.\n\nSince 2002, Charles has been a DJ on BBC Radio 6 Music presenting The Craig Charles Funk and Soul Show, on air on Saturday evenings 6pm to 9pm, where he plays a diverse range of funk and soul music, from classic tracks to the latest releases, and provides publicity for less familiar bands. Charles explains the context for the music and carries out interviews with guest musicians. He was with the station at its launch, and while it was being tested during the previous year, under the name Network Y. Charles has also hosted the station's Breakfast Show (2004), and sits in for other presenters including Andrew Collins, Phil Wilding and Phill Jupitus and Radcliffe & Maconie.\n\nFrom January until November 2014, Charles also broadcast the Funk and Soul Show live on BBC Radio 2, immediately after his 6 Music show. He regularly sits in for Janice Long, Steve Wright and Jo Whiley, and has presented numerous programmes on the station, including The Craig Charles Soul All-Nighter (2011), which he hosted continuously for 12 hours, and the Beatleland (2012) documentary on The Beatles. Charles has also chosen music as a guest of other broadcasters such as Ken Bruce on Radio 2 and Liz Kershaw on 6 Music.  Charles covered for Graham Norton on Radio 2's Saturday mid-morning show during Norton's 10-week 2015 summer break.\nFrom 16 April 2016, Charles presents the House Party on Saturday nights on BBC Radio 2, with the show airing between 10pm and midnight.\n\nMusic \n\nCharles has been involved in the music industry through much of his career. His bands have included Watt 4 (1980), in which he played keyboards and sang, Craig Charles and the Beat Burglars (1989), The Sons of Gordon Gekko (1989), where he wrote lyrics and also composed tunes and The Eye (2000–02), with whom he recorded the rock album \"Giving You The Eye, Live at the Edinburgh Festival\". Charles plays guitar and piano.\n\nIn 1987, Charles provided the poem track used for the opening credits of the BBC series The Marksman (in which he also acted), which is included on the album \"The Marksman: Music from the BBC TV series\". Charles wrote lyrics for Suzanne Rhatigan's album To Hell With Love (1992). In 1993, Charles was signed to the Acid Jazz record label.Interview with Charles by Terry Christian, The Word, Channel 4, 1994\n\nIn 2009, Charles formed the Fantasy Funk Band from the leading British musicians in the genre, and has presented the band at festivals, including Glastonbury and the BBC's Proms in the Park. As a continuation of his 6 Music show, Charles regularly takes the Craig Charles Funk & Soul Club to varied venues across the UK and abroad, and to the major UK music festivals. He performs live DJ sets, occasionally comperes and curates events, including his own Craig Charles Fantasy Weekender, and has broadcast the radio show live from festival locations.\n\nIn 2012, Charles released the compilation album The Craig Charles Funk & Soul Club, on CD and as a digital download, as part of a three-album dealMetro, 28 November 2012, Andrew Williams [http://www.metro.co.uk/tv/919157-craig-charles-i-only-thought-red-dwarf-would-last-two-series \"Craig Charles\"], London with Freestyle Records.Freestyle Records, 26 November 2012 [http://www.freestylerecords.co.uk/index.php/the-craig-charles-funk-soul-club/ \"ALBUM: The Craig Charles Funk & Soul Club\"] The second volume was released in the same format in 2013, and the third in 2014. He followed these with a Craig Charles Funk and Soul Classics album of 3 CDs in 2015.\n\nStand-up comedy and theatre \n\nCharles returned to stand-up comedy between 1995The Independent, 20 September 1995, [http://www.highbeam.com/doc/1P2-4740730.html \"Comedy: Craig Charles Speaks, Duke of York's Theatre, London\"], London and 2001, regularly touring his one-man adult-rated shows nationally and releasing the videos Craig Charles: Live on Earth! (1995), Live Official Bootleg (1996) and Sickbag (2000). International performances included the Great Norwegian Comedy Festival and the Melbourne International Comedy Festival.\n\nCharles appeared in the John Godber comedy play Teechers, in which he swapped in and out of various roles, at the Arts Theatre, London, and at the Edinburgh Festival (1989), and he played Idle Jack in the pantomime Dick Whittington, at the Hull New Theatre (1997). In 2000, he performed the show Craig Charles and His Band at the Edinburgh Festival.\n\nCharles has a regular slot at Butlins Minehead House Of Fun Weekend every November for 3 nights, of DJ'ing, Comedy and singing.http://www.bigweekends.com/the-weekends/specialist-music-weekends/madness-house-of-fun-weekender.aspx#ito=FW_Madness\n\nFilm roles \n\nCharles played Eddie in the 1987 political drama Business as Usual. In 2006, Charles starred in two British feature films: the fantasy film Fated and the gangster film Clubbing to Death. Charles voiced Zipper the Cat in the animation Prince Cinders (1993) and Asterix in Asterix Conquers America (1994). Roles in short films include playing Keith Dennis in the comedy The Colour of Funny (1999) and Mark in the drama Ten Minutes (2004).\n\nWriting \n\nIn 1993, Charles worked with Russell Bell on the Craig Charles Almanac of Total Knowledge, writing about his 'streetwise' sense of humour on a range of topics, from the world's most embarrassing stories to how to explain the mysteries of the universe. In 1997, Charles and Bell wrote Charles' Red Dwarf character's book The Log, in which Lister decides to leave a log detailing mankind's greatest achievements. In 1998, Charles published No Other Blue, a collection of his poetry, with illustrations by Philippa Drakeford, on diverse personal subjects including prison, his mother's final illness, love and politics at home and abroad. More recently he has written a series of nursery rhymes titled \"Scary Fairy and the Tales of the Dark Wood\".\n\nIn 2000, Charles wrote his first autobiography about his experiences growing up in Liverpool, titled No Irish, No Niggers. In 2007, he announced he would release his autobiography, planned for March 2008, published by Hodder Headline and titled On the Rocks, which would cover the recent incidents in his life and be based on much of his journal, which Charles said he kept while in rehab.\n\nCharles has been involved in journalism and has had a column in Time Out magazine. In 1994, he launched a single issue of Comedy magazine with articles dedicated to the comedy circuit. In 2005 and 2006, Charles was a monthly columnist for the Liverpool Echo newspaper. His television writing credits include The Easter Stories (1994), Funky Bunker (1997) and Takeshi's Castle (2002).\n\nPersonal life \n\nRelationships \n\nIn 1984, Charles married English actress Cathy Tyson. Their son, Jack, was born in 1988. The couple divorced in 1989.\n\nIn 1999, Charles married his second wife, Jackie, with whom he has two daughters, Anna-Jo (born 1997) and Nellie (born 2003).\n\nLegal issues and acquittal \n\nIn July 1994, Charles and a friend were arrested and remanded in custody for three months on a rape charge. In March 1995, both men were acquitted in their trial. After being cleared, Charles spoke of the need to restore anonymity for those accused of rape. He stated that \"the fact that my name and address along with my picture can appear on the front of the papers before the so-called 'victim' has even signed a statement proves that anonymity for rape defendants is a must and that the law must be changed.\" While in prison, Charles was attacked by a man wielding a knife.\n\nDrug use \n\nIn June 2006, newspaper allegations of crack cocaine use resulted in Charles being suspended from both Coronation Street and BBC Radio 6 Music. In August, Charles was arrested and released on bail pending further enquiries, and in September he accepted a caution for possession of a Class A drug. Charles returned to hosting his 6 Music show from November 2006 and filming Coronation Street from January 2007.\n\nCredits \n\n, 2007\n\nFilmography\n\nRadio \n\nBibliography \n\nPublished\n\n* 1993, Craig Charles Almanac of Total Knowledge, (with Russell Bell), Penguin Books\n* 1997, The Log: A Dwarfer's Guide to Everything, (with Russell Bell), Penguin Books\n* 1998, No Other Blue, (illustrations by Philippa Drakeford), Penguin Books\n\nUnpublished\n\n* 2000, No Irish, No Niggers, Penguin Books \n* 2008, On the Rocks, Hodder Headline. Craig Charles. http://en.wikipedia.org/?curid=5829."
  }
}
