{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9732",
  "eid" : "f1b944e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778485294,
  "textBody" : "Eli Whitney (December 8, 1765 – January 8, 1825) was an American inventor best known for inventing the cotton gin.  This was one of the key inventions of the Industrial Revolution and shaped the economy of the Antebellum South.  Whitney's invention made upland short cotton into a profitable crop, which strengthened the economic foundation of slavery in the United States. Despite the social and economic impact of his invention, Whitney lost many profits in legal battles over patent infringement for the cotton gin. Thereafter, he turned his attention into securing contracts with the government in the manufacture of muskets for the newly formed United States Army. He continued making arms and inventing until his death in 1825.\n\nEarly life and education\n\nWhitney was born in Westborough, Massachusetts, on December 8, 1765, the eldest child of Eli Whitney Sr., a prosperous farmer, and his wife Elizabeth Fay, also of Westborough.\n\nAlthough the younger Eli, born in 1765, could technically be called a \"Junior\", history has never known him as such. He was famous during his lifetime and afterward by the name \"Eli Whitney\". His son, born in 1820, also named Eli, was well known during his lifetime and afterward by the name \"Eli Whitney, Jr.\"\n\nWhitney's mother, Elizabeth Fay, died in 1777, when he was 11. At age 14 he operated a profitable nail manufacturing operation in his father's workshop during the Revolutionary War.[http://web.mit.edu/invent/iow/whitney.html MIT Inventor of the Week archive profile]. From a website funded and administered by Lemelson-MIT Program. Accessed March 18, 2008.\n\nBecause his stepmother opposed his wish to attend college, Whitney worked as a farm laborer and school teacher to save money. He prepared for Yale at Leicester Academy (now Becker College) and under the tutelage of Rev. Elizur Goodrich of Durham, Connecticut, he entered the class of 1789 and graduated Phi Beta Kappa in 1792.[http://www.pbk.org/infoview/PBK_InfoView.aspx?t\n&id=59 Who Belongs To Phi Beta Kappa], Phi Beta Kappa website, accessed October 4, 2009 Whitney expected to study law but, finding himself short of funds, accepted an offer to go to South Carolina as a private tutor.\n\nInstead of reaching his destination, he was convinced to visit Georgia. In the closing years of the 18th century, Georgia was a magnet for New Englanders seeking their fortunes (its Revolutionary-era governor had been Lyman Hall, a migrant from Connecticut). When he initially sailed for South Carolina, among his shipmates were the widow and family of the Revolutionary hero Gen. Nathanael Greene of Rhode Island. Mrs. Greene invited Whitney to visit her Georgia plantation, Mulberry Grove. Her plantation manager and husband-to-be was Phineas Miller, another Connecticut migrant and Yale graduate (class of 1785), who would become Whitney's business partner.\n\nWhitney is most famous for two innovations which later divided the United States in the mid-19th century: the cotton gin (1793) and his advocacy of interchangeable parts. In the South, the cotton gin revolutionized the way cotton was harvested and reinvigorated slavery. In the North the adoption of interchangeable parts revolutionized the manufacturing industry, and contributed greatly to the U.S. victory in the Civil War.[http://www.georgiaencyclopedia.org/nge/Article.jsp?id=h-3497 New Georgia Encyclopedia: Eli Whitney in Georgia]. Accessed March 19, 2008.\n\nCareer\n\nCotton gin\n\nThe cotton gin is a mechanical device that removes the seeds from cotton, a process that had previously been extremely labor-intensive. The word gin is short for engine. The cotton gin was a wooden drum stuck with hooks that pulled the cotton fibers through a mesh. The cotton seeds would not fit through the mesh and fell outside. Whitney occasionally told a story wherein he was pondering an improved method of seeding the cotton when he was inspired by observing a cat attempting to pull a chicken through a fence, and could only pull through some of the feathers.\n\nA single cotton gin could generate up to 55 lb of cleaned cotton daily. This contributed to the economic development of the Southern states of the United States, a prime cotton growing area; some historians believe that this invention allowed for the African slavery system in the Southern United States to become more sustainable at a critical point in its development.\n\nWhitney received a patent (later numbered as X72) for his cotton gin on March 14, 1794, but it was not validated until 1807. Whitney and his partner, Miller, did not intend to sell the gins. Rather, like the proprietors of grist and sawmills, they expected to charge farmers for cleaning their cotton – two-fifths of the value, paid in cotton. Resentment at this scheme, the mechanical simplicity of the device and the primitive state of patent law, made infringement inevitable. Whitney and Miller could not build enough gins to meet demand, so gins from other makers found ready sale. Ultimately, patent infringement lawsuits consumed the profits and their cotton gin company went out of business in 1797. One oft-overlooked point is that there were drawbacks to Whitney's first design. There is significant evidence that the design flaws were solved by a plantation owner, Catharine Littlefield Greene, wife of the American Revolutionary War general Nathanael Greene; Whitney gave her no public credit or recognition.[http://peoplenamedeliwhitney.blogspot.com/2009/10/eli-whitney-really-famous-one.html Eli Whitney Project]  A website for The Eli Whitney Project\n\nWhile the cotton gin did not earn Whitney the fortune he had hoped for, it did give him fame.\n\nIt has been argued by some historians that Whitney's cotton gin was an important if unintended cause of the American Civil War. After Whitney's invention, the plantation slavery industry was rejuvenated, eventually culminating in the Civil War.\n\nAnd the cotton gin transformed Southern agriculture and the national economy.[http://www.eliwhitney.org/ The Eli Whitney Museum and Workshop]  A website for The Eli Whitney Museum in Hamden, CT. Southern cotton found ready markets in Europe and in the burgeoning textile mills of New England. Cotton exports from the U.S. boomed after the cotton gin's appearance – from less than 500000 lb in 1793 to 93 e6lb by 1810. Cotton was a staple that could be stored for long periods and shipped long distances, unlike most agricultural products. It became the U.S.'s chief export, representing over half the value of U.S. exports from 1820 to 1860.\n\nParadoxically, the cotton gin, a labor-saving device, helped preserve slavery in the U.S. Before the 1790s, slave labor was primarily employed in growing rice, tobacco, and indigo, none of which were especially profitable any more. Neither was cotton, due to the difficulty of seed removal. But with the gin, growing cotton with slave labor became highly profitable – the chief source of wealth in the American South, and the basis of frontier settlement from Georgia to Texas. \"King Cotton\" became a dominant economic force, and slavery was sustained as a key institution of Southern society.\n\nInterchangeable parts\n\nEli Whitney has often been incorrectly credited with inventing the idea of interchangeable parts, which he championed for years as a maker of muskets; however, the idea predated Whitney, and Whitney's role in it was one of promotion and popularizing, not invention. Successful implementation of the idea eluded Whitney until near the end of his life, occurring first in others' armories.\n\nAttempts at interchangeability of parts can be traced back as far as the Punic Wars through both archaeological remains of boats now in Museo Archeologico Baglio Anselmi and contemporary written accounts. In modern times the idea developed over decades among many people. An early leader was Jean-Baptiste Vaquette de Gribeauval, an 18th-century French artillerist who created a fair amount of standardization of artillery pieces, although not true interchangeability of parts. He inspired others, including Honoré Blanc and Louis de Tousard, to work further on the idea, and on shoulder weapons as well as artillery. In the 19th century these efforts produced the \"armory system,\" or American system of manufacturing. Certain other New Englanders, including Captain John H. Hall and Simeon North, arrived at successful interchangeability before Whitney's armory did. The Whitney armory finally succeeded not long after his death in 1825.\n\nThe motives behind Whitney's acceptance of a contract to manufacture muskets in 1798 were mostly monetary. By the late 1790s, Whitney was on the verge of bankruptcy and the cotton gin litigation had left him deeply in debt. His New Haven cotton gin factory had burned to the ground, and litigation sapped his remaining resources. The French Revolution had ignited new conflicts between Great Britain, France, and the United States. The new American government, realizing the need to prepare for war, began to rearm. The War Department issued contracts for the manufacture of 10,000 muskets. Whitney, who had never made a gun in his life, obtained a contract in January 1798 to deliver 10,000 to 15,000 muskets in 1800. He had not mentioned interchangeable parts at that time.  Ten months later, the Treasury Secretary, Oliver Wolcott, Jr., sent him a \"foreign pamphlet on arms manufacturing techniques,\" possibly one of Honoré Blanc's reports, after which Whitney first began to talk about interchangeability.\n\nIn May 1798, Congress voted for legislation that would use eight hundred thousand dollars in order to pay for small arms and cannons in case war with France erupted. They offered a 5,000 dollar incentive with an additional 5,000 dollars once that money was exhausted for the person that was able to accurately produce arms for the government. Because the cotton gin had not brought Whitney the rewards he believed he would get, he accepted the contract. Although the contract was for one year, Whitney did not deliver the arms until eight years later in 1809 using multiple excuses for the delay of such. Recently, historians have found that during 1801–1806, Whitney took the money and headed into South Carolina in order to profit from the cotton gin.\n\nAlthough Whitney's demonstration of 1801 appeared to show the ingenuity of interchangeable parts, Merritt Roe Smith concludes that Whitney's demonstration was \"staged\" and \"duped government authorities\" into believing that he had created interchangeable parts. The charade was only useful in order to gain more time and resources for the project but not to create interchangeable parts.\n\nWhen the government complained that Whitney's price per musket compared unfavorably with those produced in government armories, Whitney was able to calculate an actual price per musket by including fixed costs such as insurance and machinery, which the government had not included. He thus made early contributions to both the concept of cost accounting, and the concept of the efficiency of private industry.\n\nMilling machine\n\nMachine tool historian Joseph W. Roe credited Whitney with inventing the first milling machine circa 1818. Subsequent work by other historians (Woodbury; Smith; Muir; Battison [cited by Baida]) suggests that Whitney was among a group of contemporaries all developing milling machines at about the same time (1814 to 1818), and that the others were more important to the innovation than Whitney was. (The machine that excited Roe may not have been built until 1825, after Whitney's death.) Therefore, no one person can properly be described as the inventor of the milling machine.\n\nLater life and legacy\n\nDespite his humble origins, Whitney was keenly aware of the value of social and political connections. In building his arms business, he took full advantage of the access that his status as a Yale alumnus gave him to other well-placed graduates, such as Oliver Wolcott, Jr., Secretary of the Treasury (class of 1778), and James Hillhouse, a New Haven developer and political leader.\n\nHis 1817 marriage to Henrietta Edwards, granddaughter of the famed evangelist Jonathan Edwards, daughter of Pierpont Edwards, head of the Democratic Party in Connecticut, and first cousin of Yale's president, Timothy Dwight, the state's leading Federalist, further tied him to Connecticut's ruling elite. In a business dependent on government contracts, such connections were essential to success.\n\nWhitney died of prostate cancer on January 8, 1825, in New Haven, Connecticut, just a month after his 59th birthday. He left a widow and his four children behind. During the course of his illness, he invented and constructed several devices to mechanically ease his pain. These devices, drawings of which are in his collected papers, were effective but were never manufactured for use of others due to his heirs' reluctance to trade in \"indelicate\" items.\n\nThe Eli Whitney Students Program,  Yale University's admissions program for non-traditional students, is named after Whitney who matriculated into Yale when he was 23.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Eli Whitney" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9732" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Eli Whitney (December 8, 1765 – January 8, 1825) was an American inventor best known for inventing the cotton gin.  This was one of the key inventions of the Industrial Revolution and shaped the economy of the Antebellum South.  Whitney's invention made upland short cotton into a profitable crop, which strengthened the economic foundation of slavery in the United States. Despite the social and economic impact of his invention, Whitney lost many profits in legal battles over patent infringement for the cotton gin. Thereafter, he turned his attention into securing contracts with the government in the manufacture of muskets for the newly formed United States Army. He continued making arms and inventing until his death in 1825.\n\nEarly life and education\n\nWhitney was born in Westborough, Massachusetts, on December 8, 1765, the eldest child of Eli Whitney Sr., a prosperous farmer, and his wife Elizabeth Fay, also of Westborough.\n\nAlthough the younger Eli, born in 1765, could technically be called a \"Junior\", history has never known him as such. He was famous during his lifetime and afterward by the name \"Eli Whitney\". His son, born in 1820, also named Eli, was well known during his lifetime and afterward by the name \"Eli Whitney, Jr.\"\n\nWhitney's mother, Elizabeth Fay, died in 1777, when he was 11. At age 14 he operated a profitable nail manufacturing operation in his father's workshop during the Revolutionary War.[http://web.mit.edu/invent/iow/whitney.html MIT Inventor of the Week archive profile]. From a website funded and administered by Lemelson-MIT Program. Accessed March 18, 2008.\n\nBecause his stepmother opposed his wish to attend college, Whitney worked as a farm laborer and school teacher to save money. He prepared for Yale at Leicester Academy (now Becker College) and under the tutelage of Rev. Elizur Goodrich of Durham, Connecticut, he entered the class of 1789 and graduated Phi Beta Kappa in 1792.[http://www.pbk.org/infoview/PBK_InfoView.aspx?t\n&id=59 Who Belongs To Phi Beta Kappa], Phi Beta Kappa website, accessed October 4, 2009 Whitney expected to study law but, finding himself short of funds, accepted an offer to go to South Carolina as a private tutor.\n\nInstead of reaching his destination, he was convinced to visit Georgia. In the closing years of the 18th century, Georgia was a magnet for New Englanders seeking their fortunes (its Revolutionary-era governor had been Lyman Hall, a migrant from Connecticut). When he initially sailed for South Carolina, among his shipmates were the widow and family of the Revolutionary hero Gen. Nathanael Greene of Rhode Island. Mrs. Greene invited Whitney to visit her Georgia plantation, Mulberry Grove. Her plantation manager and husband-to-be was Phineas Miller, another Connecticut migrant and Yale graduate (class of 1785), who would become Whitney's business partner.\n\nWhitney is most famous for two innovations which later divided the United States in the mid-19th century: the cotton gin (1793) and his advocacy of interchangeable parts. In the South, the cotton gin revolutionized the way cotton was harvested and reinvigorated slavery. In the North the adoption of interchangeable parts revolutionized the manufacturing industry, and contributed greatly to the U.S. victory in the Civil War.[http://www.georgiaencyclopedia.org/nge/Article.jsp?id=h-3497 New Georgia Encyclopedia: Eli Whitney in Georgia]. Accessed March 19, 2008.\n\nCareer\n\nCotton gin\n\nThe cotton gin is a mechanical device that removes the seeds from cotton, a process that had previously been extremely labor-intensive. The word gin is short for engine. The cotton gin was a wooden drum stuck with hooks that pulled the cotton fibers through a mesh. The cotton seeds would not fit through the mesh and fell outside. Whitney occasionally told a story wherein he was pondering an improved method of seeding the cotton when he was inspired by observing a cat attempting to pull a chicken through a fence, and could only pull through some of the feathers.\n\nA single cotton gin could generate up to 55 lb of cleaned cotton daily. This contributed to the economic development of the Southern states of the United States, a prime cotton growing area; some historians believe that this invention allowed for the African slavery system in the Southern United States to become more sustainable at a critical point in its development.\n\nWhitney received a patent (later numbered as X72) for his cotton gin on March 14, 1794, but it was not validated until 1807. Whitney and his partner, Miller, did not intend to sell the gins. Rather, like the proprietors of grist and sawmills, they expected to charge farmers for cleaning their cotton – two-fifths of the value, paid in cotton. Resentment at this scheme, the mechanical simplicity of the device and the primitive state of patent law, made infringement inevitable. Whitney and Miller could not build enough gins to meet demand, so gins from other makers found ready sale. Ultimately, patent infringement lawsuits consumed the profits and their cotton gin company went out of business in 1797. One oft-overlooked point is that there were drawbacks to Whitney's first design. There is significant evidence that the design flaws were solved by a plantation owner, Catharine Littlefield Greene, wife of the American Revolutionary War general Nathanael Greene; Whitney gave her no public credit or recognition.[http://peoplenamedeliwhitney.blogspot.com/2009/10/eli-whitney-really-famous-one.html Eli Whitney Project]  A website for The Eli Whitney Project\n\nWhile the cotton gin did not earn Whitney the fortune he had hoped for, it did give him fame.\n\nIt has been argued by some historians that Whitney's cotton gin was an important if unintended cause of the American Civil War. After Whitney's invention, the plantation slavery industry was rejuvenated, eventually culminating in the Civil War.\n\nAnd the cotton gin transformed Southern agriculture and the national economy.[http://www.eliwhitney.org/ The Eli Whitney Museum and Workshop]  A website for The Eli Whitney Museum in Hamden, CT. Southern cotton found ready markets in Europe and in the burgeoning textile mills of New England. Cotton exports from the U.S. boomed after the cotton gin's appearance – from less than 500000 lb in 1793 to 93 e6lb by 1810. Cotton was a staple that could be stored for long periods and shipped long distances, unlike most agricultural products. It became the U.S.'s chief export, representing over half the value of U.S. exports from 1820 to 1860.\n\nParadoxically, the cotton gin, a labor-saving device, helped preserve slavery in the U.S. Before the 1790s, slave labor was primarily employed in growing rice, tobacco, and indigo, none of which were especially profitable any more. Neither was cotton, due to the difficulty of seed removal. But with the gin, growing cotton with slave labor became highly profitable – the chief source of wealth in the American South, and the basis of frontier settlement from Georgia to Texas. \"King Cotton\" became a dominant economic force, and slavery was sustained as a key institution of Southern society.\n\nInterchangeable parts\n\nEli Whitney has often been incorrectly credited with inventing the idea of interchangeable parts, which he championed for years as a maker of muskets; however, the idea predated Whitney, and Whitney's role in it was one of promotion and popularizing, not invention. Successful implementation of the idea eluded Whitney until near the end of his life, occurring first in others' armories.\n\nAttempts at interchangeability of parts can be traced back as far as the Punic Wars through both archaeological remains of boats now in Museo Archeologico Baglio Anselmi and contemporary written accounts. In modern times the idea developed over decades among many people. An early leader was Jean-Baptiste Vaquette de Gribeauval, an 18th-century French artillerist who created a fair amount of standardization of artillery pieces, although not true interchangeability of parts. He inspired others, including Honoré Blanc and Louis de Tousard, to work further on the idea, and on shoulder weapons as well as artillery. In the 19th century these efforts produced the \"armory system,\" or American system of manufacturing. Certain other New Englanders, including Captain John H. Hall and Simeon North, arrived at successful interchangeability before Whitney's armory did. The Whitney armory finally succeeded not long after his death in 1825.\n\nThe motives behind Whitney's acceptance of a contract to manufacture muskets in 1798 were mostly monetary. By the late 1790s, Whitney was on the verge of bankruptcy and the cotton gin litigation had left him deeply in debt. His New Haven cotton gin factory had burned to the ground, and litigation sapped his remaining resources. The French Revolution had ignited new conflicts between Great Britain, France, and the United States. The new American government, realizing the need to prepare for war, began to rearm. The War Department issued contracts for the manufacture of 10,000 muskets. Whitney, who had never made a gun in his life, obtained a contract in January 1798 to deliver 10,000 to 15,000 muskets in 1800. He had not mentioned interchangeable parts at that time.  Ten months later, the Treasury Secretary, Oliver Wolcott, Jr., sent him a \"foreign pamphlet on arms manufacturing techniques,\" possibly one of Honoré Blanc's reports, after which Whitney first began to talk about interchangeability.\n\nIn May 1798, Congress voted for legislation that would use eight hundred thousand dollars in order to pay for small arms and cannons in case war with France erupted. They offered a 5,000 dollar incentive with an additional 5,000 dollars once that money was exhausted for the person that was able to accurately produce arms for the government. Because the cotton gin had not brought Whitney the rewards he believed he would get, he accepted the contract. Although the contract was for one year, Whitney did not deliver the arms until eight years later in 1809 using multiple excuses for the delay of such. Recently, historians have found that during 1801–1806, Whitney took the money and headed into South Carolina in order to profit from the cotton gin.\n\nAlthough Whitney's demonstration of 1801 appeared to show the ingenuity of interchangeable parts, Merritt Roe Smith concludes that Whitney's demonstration was \"staged\" and \"duped government authorities\" into believing that he had created interchangeable parts. The charade was only useful in order to gain more time and resources for the project but not to create interchangeable parts.\n\nWhen the government complained that Whitney's price per musket compared unfavorably with those produced in government armories, Whitney was able to calculate an actual price per musket by including fixed costs such as insurance and machinery, which the government had not included. He thus made early contributions to both the concept of cost accounting, and the concept of the efficiency of private industry.\n\nMilling machine\n\nMachine tool historian Joseph W. Roe credited Whitney with inventing the first milling machine circa 1818. Subsequent work by other historians (Woodbury; Smith; Muir; Battison [cited by Baida]) suggests that Whitney was among a group of contemporaries all developing milling machines at about the same time (1814 to 1818), and that the others were more important to the innovation than Whitney was. (The machine that excited Roe may not have been built until 1825, after Whitney's death.) Therefore, no one person can properly be described as the inventor of the milling machine.\n\nLater life and legacy\n\nDespite his humble origins, Whitney was keenly aware of the value of social and political connections. In building his arms business, he took full advantage of the access that his status as a Yale alumnus gave him to other well-placed graduates, such as Oliver Wolcott, Jr., Secretary of the Treasury (class of 1778), and James Hillhouse, a New Haven developer and political leader.\n\nHis 1817 marriage to Henrietta Edwards, granddaughter of the famed evangelist Jonathan Edwards, daughter of Pierpont Edwards, head of the Democratic Party in Connecticut, and first cousin of Yale's president, Timothy Dwight, the state's leading Federalist, further tied him to Connecticut's ruling elite. In a business dependent on government contracts, such connections were essential to success.\n\nWhitney died of prostate cancer on January 8, 1825, in New Haven, Connecticut, just a month after his 59th birthday. He left a widow and his four children behind. During the course of his illness, he invented and constructed several devices to mechanically ease his pain. These devices, drawings of which are in his collected papers, were effective but were never manufactured for use of others due to his heirs' reluctance to trade in \"indelicate\" items.\n\nThe Eli Whitney Students Program,  Yale University's admissions program for non-traditional students, is named after Whitney who matriculated into Yale when he was 23. Eli Whitney. http://en.wikipedia.org/?curid=9732."
  }
}
