{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19737",
  "eid" : "3d908d60-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778612534,
  "textBody" : "Maxwell's equations are a set of partial differential equations that, together with the Lorentz force law, form the foundation of classical electromagnetism, classical optics, and electric circuits. They underpin all electric, optical and radio technologies, including power generation, electric motors, wireless communication, cameras, televisions, computers etc. Maxwell's equations describe how electric and magnetic fields are generated by charges, currents, and changes of each other. One important consequence of the equations is that they demonstrate how fluctuating electric and magnetic fields propagate at the speed of light. Known as electromagnetic radiation, these waves may occur at various wavelengths to produce a spectrum from radio waves to γ-rays. The equations are named after the physicist and mathematician James Clerk Maxwell, who between 1861 and 1862 published an early form of the equations, and first proposed that light is an electromagnetic phenomenon.\n\nThe equations have two major variants. The microscopic Maxwell equations have universal applicability, but are unwieldy for common calculations.  They relate the electric and magnetic fields to total charge and total current, including the complicated charges and currents in materials at the atomic scale. The \"macroscopic\" Maxwell equations define two new auxiliary fields that describe the large-scale behaviour of matter without having to consider atomic scale details. However, their use requires experimentally determining parameters for a phenomenological description of the electromagnetic response of materials.\n\nThe term \"Maxwell's equations\" is often used for equivalent alternative formulations. Versions of Maxwell's equations based on the electric and magnetic potentials are preferred for explicitly solving the equations as a boundary value problem, analytical mechanics, or for use in quantum mechanics. The spacetime formulations (i.e., on spacetime rather than space and time separately),  are commonly used in high energy and gravitational physics because they make the compatibility of the equations with special and general relativity manifest.Maxwell's equations in any form are compatible with relativity. These spacetime formulations, though, make that compatibility more readily apparent by revealing that the electric and magnetic fields blend into a single tensor, and that their distinction depends on the movement of the observer and the corresponding observer dependent notion of time. In fact, Einstein developed special and general relativity to accommodate the absolute speed of light that drops out of the Maxwell equations with the principle that only relative movement has physical consequences.\n\nSince the mid-20th century, it has been understood that Maxwell's equations are not exact, but a classical field theory approximation of some aspects of the fundamental theory of quantum electrodynamics, although some quantum features, such as quantum entanglement, are completely absent and in no way approximated. (For example, quantum cryptography has no approximate version in Maxwell theory.) In many situations, though, deviations from Maxwell's equations are immeasurably small. Exceptions include nonclassical light, photon–photon scattering, quantum optics, and many other phenomena related to photons or virtual photons.\n\nFormulation in terms of electric and magnetic fields (microscopic or in vacuum version)\n\nIn the electric and magnetic field formulation there are four equations. The two inhomogeneous equations describe how the fields vary in space due to sources. Gauss's law describes how electric fields emanate from electric charges. Gauss's law for magnetism describes magnetic fields as closed field lines not due to magnetic monopoles. The two homogeneous equations describe how the fields \"circulate\" around their respective sources. Ampère's law with Maxwell's addition describes how the magnetic field \"circulates\" around electric currents and time varying electric fields, while Faraday's law describes how the electric field \"circulates\" around time varying magnetic fields.\n\nA separate law of nature, the Lorentz force law, describes how the electric and magnetic field act on charged particles and currents. A version of this law was included in the original equations by Maxwell but, by convention, is no longer included.\n\nThe precise formulation of Maxwell's equations depends on the precise definition of the quantities involved. Conventions differ with the unit systems, because various definitions and dimensions are changed by absorbing dimensionful factors like the speed of light . This makes constants come out differently. The most common form is based on conventions used when quantities measured using SI units, but other commonly used  conventions are used with other units including Gaussian units based on the cgs system, Lorentz–Heaviside units (used mainly in particle physics), and Planck units (used in theoretical physics).\n\nThe vector calculus formulation below has become standard. It is mathematically much more convenient than Maxwell's original 20 equations and is due to Oliver Heaviside.Bruce J. Hunt (1991) The Maxwellians, chapter 5 and appendix, Cornell University Press The differential and integral equations formulations are mathematically equivalent and are both useful. The integral formulation relates fields within a region of space to fields on the boundary and can often be used to simplify and directly calculate fields from symmetric distributions of charges and currents. On the other hand, the differential equations are purely local and are a more natural starting point for calculating the fields in more complicated (less symmetric) situations, for example using finite element analysis. For formulations using tensor calculus or differential forms, see alternative formulations. For relativistically invariant formulations, see relativistic formulations.\n\nFormulation in SI units convention\n\nFormulation in Gaussian units convention\n\nGaussian units are a popular system of units that are part of the centimetre–gram–second system of units (cgs). When using Gaussian units it is conventional to use a slightly different definition of electric field . This implies that the modified electric and magnetic field have the same units (in the SI convention this is not the case making dimensional analysis of the equations different: e.g.  for an electromagnetic wave in vacuum |\\mathbf{E}|_{\\mathrm{SI}} |c|_{\\mathrm{SI}} |\\mathbf{B}|_{\\mathrm{SI}}). The Gaussian system uses a unit of charge defined in such a way that the permittivity of the vacuum , hence . These units are sometimes preferred over SI units in the context of special relativity, in which the components of the electromagnetic tensor, the Lorentz covariant object describing the electromagnetic field, have the same unit without constant factors.\nUsing these different conventions, the Maxwell equations become:\n\nKey to the notation\n\nSymbols in bold represent vector quantities, and symbols in italics represent scalar quantities, unless otherwise indicated.\n\nThe equations introduce the electric field, , a vector field, and the magnetic field, , a pseudovector field, each generally having a time and location dependence.\nThe sources are\n*the total electric charge density (total charge per unit volume), , and\n*the total electric current density (total current per unit area), .\n\nThe universal constants appearing in the equations are\n*the permittivity of free space, , and\n*the permeability of free space, .\n\nDifferential equations\n\nIn the differential equations, \n*the nabla symbol, , denotes the three-dimensional gradient operator,\n*the  symbol denotes the divergence operator,\n*the  symbol denotes the curl operator.\n\nIntegral equations\n\nIn the integral equations, \n* is any fixed volume with closed boundary surface , and\n* is any fixed surface with closed boundary curve ,\nHere a fixed volume or surface means that it does not change over time.  \nThe equations are correct, complete and a little easier to interpret with time-independent surfaces. For example, since the surface is time-independent, we can bring the  differentiation under the integral sign in Faraday's law:\n: \\frac{d}{dt} \\iint_{\\Sigma} \\mathbf{B} \\cdot \\mathrm{d}\\mathbf{S} = \\iint_{\\Sigma}  \\frac{\\partial \\mathbf{B}}{\\partial t} \\cdot \\mathrm{d}\\mathbf{S}\\,,\nMaxwell's equations can be formulated with possibly time-dependent surfaces and volumes by substituting the left hand side with the right hand side in the integral equation version of the Maxwell equations.\n* is a surface integral over the boundary surface , with the loop indicating the surface is closed\n*\\iiint_\\Omega is a volume integral over the volume ,\n*\\oint_{\\partial \\Sigma} is a line integral around the boundary curve , with the loop indicating the curve is closed.\n*\\iint_\\Sigma is a surface integral over the surface ,\n* The total electric charge  enclosed in  is the volume integral over  of the charge density  (see the \"macroscopic formulation\" section below):\n:Q = \\iiint_\\Omega \\rho \\ \\mathrm{d}V,\nwhere  is the volume element.\n* The net electric current  is the surface integral of the electric current density  passing through a fixed surface, :\n:I = \\iint_{\\Sigma} \\mathbf{J} \\cdot \\mathrm{d} \\mathbf{S},\nwhere  denotes the  vector element of surface area , normal to surface . (Vector area is sometimes denoted by  rather than , but this conflicts with the notation for magnetic potential).\n\nRelationship between differential and integral formulations\n\nThe equivalence of the differential and integral formulations are a consequence of  the Gauss divergence theorem and the Kelvin–Stokes theorem.\n\nFlux and divergence\n\nThe \"sources of the fields\" (i.e. their divergence) can be determined from the surface integrals of the fields through the closed surface . I.e.  the electric flux is \n:\nwhere the last equality uses the  Gauss divergence theorem. Using the integral version of Gauss's equation we can rewrite this to \n: \\iiint_{\\Omega} \\left(\\nabla \\cdot \\mathbf{E} - \\frac{\\rho}{\\epsilon_0}\\right) \\, \\mathrm{d}V = 0\nSince  can be chosen arbitrarily, e.g. as  an arbitrary small ball with arbitrary center, this implies that the integrand must be zero, which is the differential equations formulation of Gauss equation up to a trivial rearrangement.\nGauss's law for magnetism in differential equations form follows likewise from the integral form by rewriting the  magnetic flux \n:.\n\nCirculation and curl\n\nThe \"circulation of the fields\" (i.e. their curls) can be determined from the line integrals of the fields around the closed curve . E.g. for the magnetic field\n:\\oint_{\\partial \\Sigma} \\mathbf{B} \\cdot \\mathrm{d}\\boldsymbol{\\ell} = \\iint_\\Sigma (\\nabla \\times \\mathbf{B})\\cdot \\mathrm{d}\\mathbf{S},\nwhere we used the Kelvin–Stokes theorem. Using the modified Ampere law in integral form and the writing the time derivative of the flux as the surface integral of the partial time derivative of  we conclude that\n: \\iint_\\Sigma  \\left(\\nabla \\times \\mathbf{B} - \\mu_0 \\left(\\mathbf{J} + \\epsilon_0 \\frac{\\partial \\mathbf{E}}{\\partial t}\\right)\\right)\\cdot \\mathrm{d}\\mathbf{S} = 0.\nSince  can be chosen arbitrarily, e.g. as an arbitrary small, arbitrary oriented, and arbitrary centered disk, we conclude that the integrand must be zero. This is Ampere's modified law in differential equations form up to a trivial rearrangement.\nLikewise, the Faraday law in differential equations form follows from rewriting the integral form using the Kelvin–Stokes theorem.\n\nThe line integrals and curls are analogous to quantities in classical fluid dynamics: the circulation of a fluid is the line integral of the fluid's flow velocity field around a closed loop, and the vorticity of the fluid is the curl of the velocity field.\n\nConceptual descriptions\n\nGauss's law\n\nGauss's law describes the relationship between a static electric field and the electric charges that cause it: The static electric field points away from positive charges and towards negative charges. In the field line description, electric field lines begin only at positive electric charges and end only at negative electric charges.  'Counting' the number of field lines passing through a closed surface, therefore, yields the total charge (including bound charge due to polarization of material) enclosed by that surface divided by dielectricity of free space (the vacuum permittivity). More technically, it relates the electric flux through any hypothetical closed \"Gaussian surface\" to the enclosed electric charge.\n\nGauss's law for magnetism\n\nGauss's law for magnetism states that there are no \"magnetic charges\" (also called magnetic monopoles), analogous to electric charges. Instead, the magnetic field due to materials is generated by a configuration called a dipole. Magnetic dipoles are best represented as loops of current but resemble positive and negative 'magnetic charges', inseparably bound together, having no net 'magnetic charge'. In terms of field lines, this equation states that magnetic field lines neither begin nor end but make loops or extend to infinity and back. In other words, any magnetic field line that enters a given volume must somewhere exit that volume. Equivalent technical statements are that the sum total magnetic flux through any Gaussian surface is zero, or that the magnetic field is a solenoidal vector field.\n\nFaraday's law\n\nThe Maxwell–Faraday version of Faraday's law of induction describes how a time varying magnetic field creates (\"induces\") an electric field. This dynamically induced electric field has closed field lines similar to a magnetic field, unless superposed by a static (charge induced) electric field. This aspect of electromagnetic induction is the operating principle behind many electric generators: for example, a rotating bar magnet creates a changing magnetic field, which in turn generates an electric field in a nearby wire.\n\nAmpère's law with Maxwell's addition\n\nAmpère's law with Maxwell's addition states that magnetic fields can be generated in two ways: by electric current (this was the original \"Ampère's law\") and by changing electric fields (this was \"Maxwell's addition\").\n\nMaxwell's addition to Ampère's law is particularly important: it makes the set of equations mathematically consistent for non static fields, without changing the laws of Ampere and Gauss for static fields.Classical Electrodynamics, by J.D. Jackson, section 6.3 However, as a consequence, it predicts that a changing magnetic field induces an electric field and vice versa.[https://books.google.com/books?id\n1DZz341Pp50C&pg=PA809 Principles of physics: a calculus-based text], by R.A. Serway, J.W. Jewett, page 809. Therefore, these equations allow self-sustaining \"electromagnetic waves\" to travel through empty space (see electromagnetic wave equation).\n\nThe speed calculated for electromagnetic waves, which could be predicted from experiments on charges and currents,The quantity we would now call , with units of velocity, was directly measured before Maxwell's equations, in an 1855 experiment by Wilhelm Eduard Weber and Rudolf Kohlrausch. They charged a leyden jar (a kind of capacitor), and measured the electrostatic force associated with the potential; then, they discharged it while measuring the magnetic force from the current in the discharge wire. Their result was , remarkably close to the speed of light. See [https://books.google.com/books?id\nuwgNAtqSHuQC&pg=PA115 The story of electrical and magnetic measurements: from 500 B.C. to the 1940s, by Joseph F. Keithley, p115] exactly matches the speed of light; indeed, light is one form of electromagnetic radiation (as are X-rays, radio waves, and others). Maxwell understood the connection between electromagnetic waves and light in 1861, thereby unifying the theories of electromagnetism and optics.\n\nCharge conservation\n\nThe invariance of charge can be derived as a corollary of Maxwell's equations. The left hand side of the modified Ampere's Law has zero divergence by the div–curl identity. Combining the right hand side, Gauss's law, and interchange of derivatives gives:\n\n:0 \\nabla\\cdot \\nabla\\times \\mathbf{B} \n \\mu_0\\left(\\nabla\\cdot \\mathbf{J} + \\varepsilon_0\\frac{\\partial}{\\partial t}\\nabla\\cdot \\mathbf{E}\\right) = \\mu_0\\left(\\nabla\\cdot \\mathbf{J} +\\frac{\\partial \\rho}{\\partial t}\\right)\ni.e.\n\n:\\frac{\\partial \\rho}{\\partial t} + \\nabla \\cdot \\mathbf{J} = 0.\nBy the Gauss Divergence Theorem, this means the rate of change of charge in a fixed volume equals the net current flowing through the boundary:\n:\nIn particular, in an isolated system the total charge is conserved.\n\nVacuum equations, electromagnetic waves and speed of light\n\nIn a region with no charges () and no currents (), such as in a vacuum, Maxwell's equations reduce to:\n\n\\begin{align}\n  \\nabla \\cdot \\mathbf{E} &0 \\quad & \\nabla \\times \\mathbf{E} &\n              -\\frac{\\partial\\mathbf B}{\\partial t}, \\\\\n  \\nabla \\cdot \\mathbf{B} &0 \\quad & \\nabla \\times \\mathbf{B} &\n \\frac{1}{c^2} \\frac{\\partial\\mathbf E}{\\partial t}.\n\\end{align}\n\nTaking the curl  of the curl equations, and using the curl of the curl identity  we obtain the wave equations\n\n\\begin{align}\n  \\frac{1}{c^2}\\frac{\\partial^2 \\mathbf{E}}{\\partial t^2} - \\nabla^2 \\mathbf{E} = 0 \\\\\n  \\frac{1}{c^2}\\frac{\\partial^2 \\mathbf{B}}{\\partial t^2} - \\nabla^2 \\mathbf{B} = 0\n\\end{align}\n\nwhich identify\n\nc \\frac{1}\\sqrt{\\mu_0 \\varepsilon_0} \n 2.99792458 \\times 10^8 \\, \\text{m/s}\n\nwith the speed of light in free space. In materials with relative permittivity, , and relative permeability, , the phase velocity of light becomes\n\nv_\\text{p} = \\frac{1}\\sqrt{\\mu_0\\mu_\\text{r} \\varepsilon_0\\varepsilon_\\text{r}} \n\nwhich is usuallyThere are cases (anomalous dispersion) where the phase velocity can exceed , but the \"signal velocity\" will still be  less than .\n\nIn addition,  and  are perpendicular to each other and to the direction of wave propagation, and are in phase with each other. A sinusoidal plane wave is one special solution of these equations. Maxwell's equations explain how these waves can physically propagate through space. The changing magnetic field creates a changing electric field through Faraday's law. In turn, that electric field creates a changing magnetic field through Maxwell's addition to Ampère's law. This perpetual cycle allows these waves, now known as electromagnetic radiation, to move through space at velocity .\n\nMacroscopic formulation\n\nThe above equations are the \"microscopic\" version of Maxwell's equations, expressing the electric and the magnetic fields in terms of the (possibly atomic-level) charges and currents present. This is sometimes called the \"general\" form, but the macroscopic version below is equally general, the difference being one of bookkeeping.\n\nThe microscopic version is sometimes called \"Maxwell's equations in a vacuum\": this refers to the fact that the material medium is not built into the structure of the equations, but appears only in the charge and current terms. The microscopic version was introduced by Lorentz, who tried to use it to derive the macroscopic properties of bulk matter from its microscopic constituents.\n\n\"Maxwell's macroscopic equations\", also known as Maxwell's equations in matter, are more similar to those that Maxwell introduced himself.\n\nUnlike the \"microscopic\" equations, the \"macroscopic\" equations separate out the bound charge  and bound current  to obtain equations that depend only on the free charges  and currents . This factorization can be made by splitting the total electric charge and current as follows:\n\n\\begin{align}\n  Q &Q_\\text{f} + Q_\\text{b} \n \\iiint_\\Omega \\left(\\rho_\\text{f} + \\rho_\\text{b} \\right) \\, \\mathrm{d}V = \\iiint_\\Omega \\rho \\,\\mathrm{d}V \\\\\n  I &I_\\text{f} + I_\\text{b} \n \\iint_\\Sigma \\left(\\mathbf{J}_\\text{f} + \\mathbf{J}_\\text{b} \\right) \\cdot \\mathrm{d}\\mathbf{S} = \\iint_\\Sigma \\mathbf{J} \\cdot \\mathrm{d}\\mathbf{S}\n\\end{align}\n\nCorrespondingly, the total current density  splits into free  and bound  components, and similarly the total charge density  splits into free  and bound  parts.\n\nThe cost of this factorization is that additional fields, the displacement field  and the magnetizing field , are defined and need to be determined. Phenomenological constituent equations relate the additional fields to the electric field  and the magnetic -field, often through a simple linear relation.\n\nFor a detailed description of the differences between the microscopic (total charge and current including material contributes or in air/vacuum)In some books—e.g., in U. Krey and A. Owen's Basic Theoretical Physics (Springer 2007)—the term effective charge is used instead of total charge, while free charge is simply called charge.\nand macroscopic (free charge and current; practical to use on materials) variants of Maxwell's equations, see below.\n\nBound charge and current\n\nWhen an electric field is applied to a dielectric material its molecules respond by forming microscopic electric dipoles – their atomic nuclei move a tiny distance in the direction of the field, while their electrons move a tiny distance in the opposite direction. This produces a macroscopic bound charge in the material even though all of the charges involved are bound to individual molecules. For example, if every molecule responds the same, similar to that shown in the figure, these tiny movements of charge combine to produce a layer of positive bound charge on one side of the material and a layer of negative charge on the other side. The bound charge is most conveniently described in terms of the polarization  of the material, its dipole moment per unit volume. If  is uniform, a macroscopic separation of charge is produced only at the surfaces where  enters and leaves the material. For non-uniform , a charge is also produced in the bulk.See  for a good description of how  relates to the bound charge.\n\nSomewhat similarly, in all materials the constituent atoms exhibit magnetic moments that are intrinsically linked to the angular momentum of the components of the atoms, most notably their electrons. The connection to angular momentum suggests the picture of an assembly of microscopic current loops. Outside the material, an assembly of such microscopic current loops is not different from a macroscopic current circulating around the material's surface, despite the fact that no individual charge is traveling a large distance. These bound currents can be described using the magnetization .See  for a good description of how  relates to the bound current.\n\nThe very complicated and granular bound charges and bound currents, therefore, can be represented on the macroscopic scale in terms of  and  which average these charges and currents on a sufficiently large scale so as not to see the granularity of individual atoms, but also sufficiently small that they vary with location in the material. As such, Maxwell's macroscopic equations ignore many details on a fine scale that can be unimportant to understanding matters on a gross scale by calculating fields that are averaged over some suitable volume.\n\nAuxiliary fields, polarization and magnetization\n\nThe definitions (not constitutive relations) of the auxiliary fields are:\n\\begin{align}\n  \\mathbf{D}(\\mathbf{r}, t) &= \\varepsilon_0 \\mathbf{E}(\\mathbf{r}, t) + \\mathbf{P}(\\mathbf{r}, t) \\\\\n  \\mathbf{H}(\\mathbf{r}, t) &= \\frac{1}{\\mu_0} \\mathbf{B}(\\mathbf{r}, t) - \\mathbf{M}(\\mathbf{r}, t)\n\\end{align}\n\nwhere  is the polarization field and  is the magnetization field which are defined in terms of microscopic bound charges and bound currents respectively. The macroscopic bound charge density  and bound current density  in terms of polarization  and magnetization  are then defined as\n\n:\\begin{align}\n        \\rho_\\text{b} &= -\\nabla\\cdot\\mathbf{P} \\\\\n  \\mathbf{J}_\\text{b} &= \\nabla\\times\\mathbf{M} + \\frac{\\partial\\mathbf{P}}{\\partial t}\n\\end{align}\n\nIf we define the total, bound, and free charge and current density by\n\n:\\begin{align}\n        \\rho &= \\rho_\\text{b} + \\rho_\\text{f}, \\\\\n  \\mathbf{J} &= \\mathbf{J}_\\text{b} + \\mathbf{J}_\\text{f},\n\\end{align}\n\nand use the defining relations above to eliminate , and , the \"macroscopic\" Maxwell's equations reproduce the \"microscopic\" equations.\n\nConstitutive relations\n\nIn order to apply 'Maxwell's macroscopic equations', it is necessary to specify the relations between displacement field  and the electric field , as well as the magnetizing field  and the magnetic field . Equivalently, we have to specify the dependence of the polarisation  (hence the bound charge) and the magnetisation  (hence the bound current) on the applied electric and magnetic field. The equations specifying this response are called constitutive relations. For real-world materials, the constitutive relations are rarely simple, except approximately, and usually determined by experiment. See the main article on constitutive relations for a fuller description.\n\nFor materials without polarisation and magnetisation, the constitutive relations are (by definition)\n\\mathbf{D} \\varepsilon_0\\mathbf{E}, \\quad \\mathbf{H} \n \\frac{1}{\\mu_0}\\mathbf{B}\nwhere  is the permittivity of free space and  the permeability of free space. Since there is no bound charge, the total and the free charge and current are equal.\n\nAn alternative viewpoint on the microscopic equations is that they are the macroscopic equations together with the  statement that vacuum behaves like a perfect linear \"material\" without additional polarisation and magnetisation.\nMore generally, for linear materials the constitutive relations are\n\\mathbf{D} \\varepsilon\\mathbf{E}\\,,\\quad \\mathbf{H} \n \\frac{1}{\\mu}\\mathbf{B} \nwhere  is the permittivity and  the permeability of the material. For the displacement field  the linear approximation is usually excellent because for all but the most extreme electric fields or temperatures obtainable in the laboratory (high power pulsed lasers) the interatomic electric fields of materials of the order of 1011 V/m are much higher than the external field. For the magnetizing field \\mathbf{H}, however, the linear approximation can break down in common materials like iron leading to phenomena like hysteresis. Even the linear case can have various complications, however.\n*For homogeneous materials,  and  are constant throughout the material, while for inhomogeneous materials they depend on location within the material (and perhaps time).\n*For isotropic materials,  and  are scalars, while for anisotropic materials (e.g. due to crystal structure) they are tensors.\n*Materials are generally dispersive, so  and  depend on the frequency of any incident EM waves.\n\nEven more generally, in the case of non-linear materials (see for example nonlinear optics),  and  are not necessarily proportional to , similarly  or  is not necessarily proportional to  . In general  and  depend on both  and , on location and time, and possibly other physical quantities.\n\nIn applications one also has to describe how the free currents and charge density behave in terms of  and  possibly coupled to other physical quantities like pressure, and the mass, number density, and velocity of charge-carrying particles. E.g., the original equations given by Maxwell (see History of Maxwell's equations) included Ohms law in the form\n\n\\mathbf{J}_\\text{f} = \\sigma \\mathbf{E}\\,.\n\nAlternative formulations\n\nFollowing is a summary of some of the numerous other ways to write the microscopic Maxwell's equations, showing they can be formulated using different mathematical formalisms.  In addition, we formulate the equations using \"potentials\". Originally they were introduced as a convenient way to solve the homogeneous equations,  but it was originally thought that all the observable physics was contained in the electric and magnetic fields  (or relativistically, the Faraday tensor). The potentials play a central role in quantum mechanics, however, and act quantum mechanically with observable consequences even when the electric and magnetic fields vanish (Aharonov–Bohm effect). See the main articles for the details of each formulation. SI units are used throughout.\n\nwhere\n*In the vector formulation on Euclidean space + time,  is the electrical potential, and  is the vector potential.\n\nRelativistic formulations \n\nThe Maxwell equations can also be formulated on a spacetime-like Minkowski space where space and time are treated on equal footing. The direct spacetime formulations make manifest that the Maxwell equations are relativistically invariant. Because of this symmetry electric and magnetic field are treated on equal footing and are recognised as components of the Faraday tensor. This reduces the four Maxwell equations to two, which  simplifies the equations, although we can no longer use the familiar vector formulation.  In fact the Maxwell equations  in the space + time formulation are not Galileo invariant and have  Lorenz invariance a hidden symmetry. This was a major source of inspiration for the development of relativity theory. To repeat: the space + time formulation is not a non-relativistic approximation and it describes the same physics by simply renaming variables.  For this reason the relativistic invariant equations are usually called the Maxwell equations as well.\n\n*In the tensor calculus formulation, the electromagnetic tensor  is an antisymmetric covariant rank 2 tensor; the four-potential, , is a covariant vector; the current, , is a vector; the square brackets, , denote antisymmetrization of indices;  is the derivative with respect to the coordinate, . In Minkowski space coordinates are chosen with respect to an inertial frame; , so that the metric tensor used to raise and lower indices is . The d'Alembert operator on Minkowski space is  as in the vector formulation. In general spacetimes, the coordinate system  is arbitrary, the covariant derivative , the Ricci tensor,  and raising and lowering of indices are defined by the Lorentzian metric,  and the d'Alembert operator is defined as . The topological restriction is that the second real cohomology group of the space vanishes (see the differential form formulation for an explanation). Note that this is violated for Minkowski space with a line removed, which can model a (flat) spacetime with a point-like monopole on the complement of the line.  \n*In the differential form formulation on arbitrary space times,  is the electromagnetic tensor considered as a 2-form,  is the potential 1-form,  is the current 3-form,  is the exterior derivative, and {\\star} is the Hodge star on forms defined (up to its an orientation, i.e. its sign) by the Lorentzian metric of spacetime. Note that in the special case of -forms such as F, the Hodge star {\\star} depends on the metric tensor only for its local scale. This means that, as formulated, the differential form field equations are conformally invariant, but the Lorenz gauge condition breaks conformal invariance. The operator \\Box = (-{\\star} \\mathrm{d} {\\star} \\mathrm{d} - \\mathrm{d} {\\star} \\mathrm{d} {\\star})  is the d'Alembert–Laplace–Beltrami operator on 1-forms on an arbitrary Lorentzian spacetime. The topological condition is again that the  second real cohomology group is trivial. By the isomorphism with the second de Rham cohomology this condition means that every closed 2-form is exact.\n\nOther formalisms include the geometric algebra formulation and a matrix representation of Maxwell's equations. Historically, a quaternionic formulation was used.\n\nSolutions\n\nMaxwell's equations are partial differential equations that relate the electric and magnetic fields to each other and to the electric charges and currents. Often, the charges and currents are themselves dependent on the electric and magnetic fields via the Lorentz force equation and the constitutive relations. These all form a set of coupled partial differential equations, which are often very difficult to solve. In fact, the solutions of these equations encompass all the diverse phenomena in the entire field of classical electromagnetism. A thorough discussion is far beyond the scope of the article, but some general notes follow.\n\nLike any differential equation, boundary conditions\n\n and initial conditions\n are necessary for a unique solution. For example, even with no charges and no currents anywhere in spacetime, many solutions to Maxwell's equations are possible, not just the obvious solution . Another solution is , , while yet other solutions have electromagnetic waves filling spacetime. In some cases, Maxwell's equations are solved through infinite space, and boundary conditions are given as asymptotic limits at infinity.\n In other cases, Maxwell's equations are solved in just a finite region of space, with appropriate boundary conditions on that region: For example, the boundary could be an artificial absorbing boundary representing the rest of the universe,\nS. G. Johnson, [http://math.mit.edu/~stevenj/18.369/pml.pdf Notes on Perfectly Matched Layers], online MIT course notes (Aug. 2007). or periodic boundary conditions, or (as with a waveguide or cavity resonator) the boundary conditions may describe the walls that isolate a small region from the outside world.\n\nJefimenko's equations (or the closely related Liénard–Wiechert potentials) are the explicit solution to Maxwell's equations for the electric and magnetic fields created by any given distribution of charges and currents. It assumes specific initial conditions to obtain the so-called \"retarded solution\", where the only fields present are the ones created by the charges. Jefimenko's equations are not so helpful in situations when the charges and currents are themselves affected by the fields they create.\n\nNumerical methods for differential equations can be used to approximately solve Maxwell's equations when an exact solution is impossible. These methods usually require a computer, and include the finite element method and finite-difference time-domain method.\n\n For more details, see Computational electromagnetics.\n\nOverdetermination of Maxwell's equations\n\nMaxwell's equations seem overdetermined, in that they involve six unknowns (the three components of  and ) but eight equations (one for each of the two Gauss's laws, three vector components each for Faraday's and Ampere's laws). (The currents and charges are not unknowns, being freely specifiable subject to charge conservation.) This is related to a certain limited kind of redundancy in Maxwell's equations: It can be proven that any system satisfying Faraday's law and Ampere's law automatically also satisfies the two Gauss's laws, as long as the system's initial condition does. This explanation was first introduced by Julius Adams Stratton in 1941. Although it is possible to simply ignore the two Gauss's laws in a numerical algorithm (apart from the initial conditions), the imperfect precision of the calculations can lead to ever-increasing violations of those laws. By introducing dummy variables characterizing these violations, the four equations become not overdetermined after all. The resulting formulation can lead to more accurate algorithms that take all four laws into account.\n\nBoth identities \\nabla\\cdot \\nabla\\times \\mathbf{B} \\equiv 0, \\nabla\\cdot \\nabla\\times \\mathbf{E} \\equiv 0, which reduce eight equations to six independent ones, are the true reason of overdetermination. \n\nLimitations of the Maxwell equations as a theory of electromagnetism\n\nWhile Maxwell's equations (along with the rest of classical electromagnetism) are extraordinarily successful at explaining and predicting a variety of phenomena, they are not exact, but approximations. In some special situations, they can be noticeably inaccurate. Examples include extremely strong fields (see Euler–Heisenberg Lagrangian) and extremely short distances (see vacuum polarization). Moreover, various phenomena occur in the world even though Maxwell's equations predict them to be impossible, such as \"nonclassical light\" and quantum entanglement of electromagnetic fields (see quantum optics). Finally, any phenomenon involving individual photons, such as the photoelectric effect, Planck's law, the Duane–Hunt law, single-photon light detectors, etc., would be difficult or impossible to explain if Maxwell's equations were exactly true, as Maxwell's equations do not involve photons. For the most accurate predictions in all situations, Maxwell's equations have been superseded by quantum electrodynamics.\n\nVariations\n\nPopular variations on the Maxwell equations as a classical theory of electromagnetic fields are relatively scarce because the standard equations have stood the test of time remarkably well.\n\nMagnetic monopoles\n\nMaxwell's equations posit that there is electric charge, but no magnetic charge (also called magnetic monopoles), in the universe. Indeed, magnetic charge has never been observed (despite extensive searches)See magnetic monopole for a discussion of monopole searches. Recently, scientists have discovered that some types of condensed matter, including spin ice and topological insulators, which display emergent behavior resembling magnetic monopoles. (See [http://www.sciencemag.org/cgi/content/abstract/1178868 sciencemag.org] and [http://www.nature.com/nature/journal/v461/n7266/full/nature08500.html nature.com].) Although these were described in the popular press as the long-awaited discovery of magnetic monopoles, they are only superficially related. A \"true\" magnetic monopole is something where , whereas in these condensed-matter systems,  while only . and may not exist. If they did exist, both Gauss's law for magnetism and Faraday's law would need to be modified, and the resulting four equations would be fully symmetric under the interchange of electric and magnetic fields.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Maxwell's equations" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19737" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Maxwell's equations are a set of partial differential equations that, together with the Lorentz force law, form the foundation of classical electromagnetism, classical optics, and electric circuits. They underpin all electric, optical and radio technologies, including power generation, electric motors, wireless communication, cameras, televisions, computers etc. Maxwell's equations describe how electric and magnetic fields are generated by charges, currents, and changes of each other. One important consequence of the equations is that they demonstrate how fluctuating electric and magnetic fields propagate at the speed of light. Known as electromagnetic radiation, these waves may occur at various wavelengths to produce a spectrum from radio waves to γ-rays. The equations are named after the physicist and mathematician James Clerk Maxwell, who between 1861 and 1862 published an early form of the equations, and first proposed that light is an electromagnetic phenomenon.\n\nThe equations have two major variants. The microscopic Maxwell equations have universal applicability, but are unwieldy for common calculations.  They relate the electric and magnetic fields to total charge and total current, including the complicated charges and currents in materials at the atomic scale. The \"macroscopic\" Maxwell equations define two new auxiliary fields that describe the large-scale behaviour of matter without having to consider atomic scale details. However, their use requires experimentally determining parameters for a phenomenological description of the electromagnetic response of materials.\n\nThe term \"Maxwell's equations\" is often used for equivalent alternative formulations. Versions of Maxwell's equations based on the electric and magnetic potentials are preferred for explicitly solving the equations as a boundary value problem, analytical mechanics, or for use in quantum mechanics. The spacetime formulations (i.e., on spacetime rather than space and time separately),  are commonly used in high energy and gravitational physics because they make the compatibility of the equations with special and general relativity manifest.Maxwell's equations in any form are compatible with relativity. These spacetime formulations, though, make that compatibility more readily apparent by revealing that the electric and magnetic fields blend into a single tensor, and that their distinction depends on the movement of the observer and the corresponding observer dependent notion of time. In fact, Einstein developed special and general relativity to accommodate the absolute speed of light that drops out of the Maxwell equations with the principle that only relative movement has physical consequences.\n\nSince the mid-20th century, it has been understood that Maxwell's equations are not exact, but a classical field theory approximation of some aspects of the fundamental theory of quantum electrodynamics, although some quantum features, such as quantum entanglement, are completely absent and in no way approximated. (For example, quantum cryptography has no approximate version in Maxwell theory.) In many situations, though, deviations from Maxwell's equations are immeasurably small. Exceptions include nonclassical light, photon–photon scattering, quantum optics, and many other phenomena related to photons or virtual photons.\n\nFormulation in terms of electric and magnetic fields (microscopic or in vacuum version)\n\nIn the electric and magnetic field formulation there are four equations. The two inhomogeneous equations describe how the fields vary in space due to sources. Gauss's law describes how electric fields emanate from electric charges. Gauss's law for magnetism describes magnetic fields as closed field lines not due to magnetic monopoles. The two homogeneous equations describe how the fields \"circulate\" around their respective sources. Ampère's law with Maxwell's addition describes how the magnetic field \"circulates\" around electric currents and time varying electric fields, while Faraday's law describes how the electric field \"circulates\" around time varying magnetic fields.\n\nA separate law of nature, the Lorentz force law, describes how the electric and magnetic field act on charged particles and currents. A version of this law was included in the original equations by Maxwell but, by convention, is no longer included.\n\nThe precise formulation of Maxwell's equations depends on the precise definition of the quantities involved. Conventions differ with the unit systems, because various definitions and dimensions are changed by absorbing dimensionful factors like the speed of light . This makes constants come out differently. The most common form is based on conventions used when quantities measured using SI units, but other commonly used  conventions are used with other units including Gaussian units based on the cgs system, Lorentz–Heaviside units (used mainly in particle physics), and Planck units (used in theoretical physics).\n\nThe vector calculus formulation below has become standard. It is mathematically much more convenient than Maxwell's original 20 equations and is due to Oliver Heaviside.Bruce J. Hunt (1991) The Maxwellians, chapter 5 and appendix, Cornell University Press The differential and integral equations formulations are mathematically equivalent and are both useful. The integral formulation relates fields within a region of space to fields on the boundary and can often be used to simplify and directly calculate fields from symmetric distributions of charges and currents. On the other hand, the differential equations are purely local and are a more natural starting point for calculating the fields in more complicated (less symmetric) situations, for example using finite element analysis. For formulations using tensor calculus or differential forms, see alternative formulations. For relativistically invariant formulations, see relativistic formulations.\n\nFormulation in SI units convention\n\nFormulation in Gaussian units convention\n\nGaussian units are a popular system of units that are part of the centimetre–gram–second system of units (cgs). When using Gaussian units it is conventional to use a slightly different definition of electric field . This implies that the modified electric and magnetic field have the same units (in the SI convention this is not the case making dimensional analysis of the equations different: e.g.  for an electromagnetic wave in vacuum |\\mathbf{E}|_{\\mathrm{SI}} |c|_{\\mathrm{SI}} |\\mathbf{B}|_{\\mathrm{SI}}). The Gaussian system uses a unit of charge defined in such a way that the permittivity of the vacuum , hence . These units are sometimes preferred over SI units in the context of special relativity, in which the components of the electromagnetic tensor, the Lorentz covariant object describing the electromagnetic field, have the same unit without constant factors.\nUsing these different conventions, the Maxwell equations become:\n\nKey to the notation\n\nSymbols in bold represent vector quantities, and symbols in italics represent scalar quantities, unless otherwise indicated.\n\nThe equations introduce the electric field, , a vector field, and the magnetic field, , a pseudovector field, each generally having a time and location dependence.\nThe sources are\n*the total electric charge density (total charge per unit volume), , and\n*the total electric current density (total current per unit area), .\n\nThe universal constants appearing in the equations are\n*the permittivity of free space, , and\n*the permeability of free space, .\n\nDifferential equations\n\nIn the differential equations, \n*the nabla symbol, , denotes the three-dimensional gradient operator,\n*the  symbol denotes the divergence operator,\n*the  symbol denotes the curl operator.\n\nIntegral equations\n\nIn the integral equations, \n* is any fixed volume with closed boundary surface , and\n* is any fixed surface with closed boundary curve ,\nHere a fixed volume or surface means that it does not change over time.  \nThe equations are correct, complete and a little easier to interpret with time-independent surfaces. For example, since the surface is time-independent, we can bring the  differentiation under the integral sign in Faraday's law:\n: \\frac{d}{dt} \\iint_{\\Sigma} \\mathbf{B} \\cdot \\mathrm{d}\\mathbf{S} = \\iint_{\\Sigma}  \\frac{\\partial \\mathbf{B}}{\\partial t} \\cdot \\mathrm{d}\\mathbf{S}\\,,\nMaxwell's equations can be formulated with possibly time-dependent surfaces and volumes by substituting the left hand side with the right hand side in the integral equation version of the Maxwell equations.\n* is a surface integral over the boundary surface , with the loop indicating the surface is closed\n*\\iiint_\\Omega is a volume integral over the volume ,\n*\\oint_{\\partial \\Sigma} is a line integral around the boundary curve , with the loop indicating the curve is closed.\n*\\iint_\\Sigma is a surface integral over the surface ,\n* The total electric charge  enclosed in  is the volume integral over  of the charge density  (see the \"macroscopic formulation\" section below):\n:Q = \\iiint_\\Omega \\rho \\ \\mathrm{d}V,\nwhere  is the volume element.\n* The net electric current  is the surface integral of the electric current density  passing through a fixed surface, :\n:I = \\iint_{\\Sigma} \\mathbf{J} \\cdot \\mathrm{d} \\mathbf{S},\nwhere  denotes the  vector element of surface area , normal to surface . (Vector area is sometimes denoted by  rather than , but this conflicts with the notation for magnetic potential).\n\nRelationship between differential and integral formulations\n\nThe equivalence of the differential and integral formulations are a consequence of  the Gauss divergence theorem and the Kelvin–Stokes theorem.\n\nFlux and divergence\n\nThe \"sources of the fields\" (i.e. their divergence) can be determined from the surface integrals of the fields through the closed surface . I.e.  the electric flux is \n:\nwhere the last equality uses the  Gauss divergence theorem. Using the integral version of Gauss's equation we can rewrite this to \n: \\iiint_{\\Omega} \\left(\\nabla \\cdot \\mathbf{E} - \\frac{\\rho}{\\epsilon_0}\\right) \\, \\mathrm{d}V = 0\nSince  can be chosen arbitrarily, e.g. as  an arbitrary small ball with arbitrary center, this implies that the integrand must be zero, which is the differential equations formulation of Gauss equation up to a trivial rearrangement.\nGauss's law for magnetism in differential equations form follows likewise from the integral form by rewriting the  magnetic flux \n:.\n\nCirculation and curl\n\nThe \"circulation of the fields\" (i.e. their curls) can be determined from the line integrals of the fields around the closed curve . E.g. for the magnetic field\n:\\oint_{\\partial \\Sigma} \\mathbf{B} \\cdot \\mathrm{d}\\boldsymbol{\\ell} = \\iint_\\Sigma (\\nabla \\times \\mathbf{B})\\cdot \\mathrm{d}\\mathbf{S},\nwhere we used the Kelvin–Stokes theorem. Using the modified Ampere law in integral form and the writing the time derivative of the flux as the surface integral of the partial time derivative of  we conclude that\n: \\iint_\\Sigma  \\left(\\nabla \\times \\mathbf{B} - \\mu_0 \\left(\\mathbf{J} + \\epsilon_0 \\frac{\\partial \\mathbf{E}}{\\partial t}\\right)\\right)\\cdot \\mathrm{d}\\mathbf{S} = 0.\nSince  can be chosen arbitrarily, e.g. as an arbitrary small, arbitrary oriented, and arbitrary centered disk, we conclude that the integrand must be zero. This is Ampere's modified law in differential equations form up to a trivial rearrangement.\nLikewise, the Faraday law in differential equations form follows from rewriting the integral form using the Kelvin–Stokes theorem.\n\nThe line integrals and curls are analogous to quantities in classical fluid dynamics: the circulation of a fluid is the line integral of the fluid's flow velocity field around a closed loop, and the vorticity of the fluid is the curl of the velocity field.\n\nConceptual descriptions\n\nGauss's law\n\nGauss's law describes the relationship between a static electric field and the electric charges that cause it: The static electric field points away from positive charges and towards negative charges. In the field line description, electric field lines begin only at positive electric charges and end only at negative electric charges.  'Counting' the number of field lines passing through a closed surface, therefore, yields the total charge (including bound charge due to polarization of material) enclosed by that surface divided by dielectricity of free space (the vacuum permittivity). More technically, it relates the electric flux through any hypothetical closed \"Gaussian surface\" to the enclosed electric charge.\n\nGauss's law for magnetism\n\nGauss's law for magnetism states that there are no \"magnetic charges\" (also called magnetic monopoles), analogous to electric charges. Instead, the magnetic field due to materials is generated by a configuration called a dipole. Magnetic dipoles are best represented as loops of current but resemble positive and negative 'magnetic charges', inseparably bound together, having no net 'magnetic charge'. In terms of field lines, this equation states that magnetic field lines neither begin nor end but make loops or extend to infinity and back. In other words, any magnetic field line that enters a given volume must somewhere exit that volume. Equivalent technical statements are that the sum total magnetic flux through any Gaussian surface is zero, or that the magnetic field is a solenoidal vector field.\n\nFaraday's law\n\nThe Maxwell–Faraday version of Faraday's law of induction describes how a time varying magnetic field creates (\"induces\") an electric field. This dynamically induced electric field has closed field lines similar to a magnetic field, unless superposed by a static (charge induced) electric field. This aspect of electromagnetic induction is the operating principle behind many electric generators: for example, a rotating bar magnet creates a changing magnetic field, which in turn generates an electric field in a nearby wire.\n\nAmpère's law with Maxwell's addition\n\nAmpère's law with Maxwell's addition states that magnetic fields can be generated in two ways: by electric current (this was the original \"Ampère's law\") and by changing electric fields (this was \"Maxwell's addition\").\n\nMaxwell's addition to Ampère's law is particularly important: it makes the set of equations mathematically consistent for non static fields, without changing the laws of Ampere and Gauss for static fields.Classical Electrodynamics, by J.D. Jackson, section 6.3 However, as a consequence, it predicts that a changing magnetic field induces an electric field and vice versa.[https://books.google.com/books?id\n1DZz341Pp50C&pg=PA809 Principles of physics: a calculus-based text], by R.A. Serway, J.W. Jewett, page 809. Therefore, these equations allow self-sustaining \"electromagnetic waves\" to travel through empty space (see electromagnetic wave equation).\n\nThe speed calculated for electromagnetic waves, which could be predicted from experiments on charges and currents,The quantity we would now call , with units of velocity, was directly measured before Maxwell's equations, in an 1855 experiment by Wilhelm Eduard Weber and Rudolf Kohlrausch. They charged a leyden jar (a kind of capacitor), and measured the electrostatic force associated with the potential; then, they discharged it while measuring the magnetic force from the current in the discharge wire. Their result was , remarkably close to the speed of light. See [https://books.google.com/books?id\nuwgNAtqSHuQC&pg=PA115 The story of electrical and magnetic measurements: from 500 B.C. to the 1940s, by Joseph F. Keithley, p115] exactly matches the speed of light; indeed, light is one form of electromagnetic radiation (as are X-rays, radio waves, and others). Maxwell understood the connection between electromagnetic waves and light in 1861, thereby unifying the theories of electromagnetism and optics.\n\nCharge conservation\n\nThe invariance of charge can be derived as a corollary of Maxwell's equations. The left hand side of the modified Ampere's Law has zero divergence by the div–curl identity. Combining the right hand side, Gauss's law, and interchange of derivatives gives:\n\n:0 \\nabla\\cdot \\nabla\\times \\mathbf{B} \n \\mu_0\\left(\\nabla\\cdot \\mathbf{J} + \\varepsilon_0\\frac{\\partial}{\\partial t}\\nabla\\cdot \\mathbf{E}\\right) = \\mu_0\\left(\\nabla\\cdot \\mathbf{J} +\\frac{\\partial \\rho}{\\partial t}\\right)\ni.e.\n\n:\\frac{\\partial \\rho}{\\partial t} + \\nabla \\cdot \\mathbf{J} = 0.\nBy the Gauss Divergence Theorem, this means the rate of change of charge in a fixed volume equals the net current flowing through the boundary:\n:\nIn particular, in an isolated system the total charge is conserved.\n\nVacuum equations, electromagnetic waves and speed of light\n\nIn a region with no charges () and no currents (), such as in a vacuum, Maxwell's equations reduce to:\n\n\\begin{align}\n  \\nabla \\cdot \\mathbf{E} &0 \\quad & \\nabla \\times \\mathbf{E} &\n              -\\frac{\\partial\\mathbf B}{\\partial t}, \\\\\n  \\nabla \\cdot \\mathbf{B} &0 \\quad & \\nabla \\times \\mathbf{B} &\n \\frac{1}{c^2} \\frac{\\partial\\mathbf E}{\\partial t}.\n\\end{align}\n\nTaking the curl  of the curl equations, and using the curl of the curl identity  we obtain the wave equations\n\n\\begin{align}\n  \\frac{1}{c^2}\\frac{\\partial^2 \\mathbf{E}}{\\partial t^2} - \\nabla^2 \\mathbf{E} = 0 \\\\\n  \\frac{1}{c^2}\\frac{\\partial^2 \\mathbf{B}}{\\partial t^2} - \\nabla^2 \\mathbf{B} = 0\n\\end{align}\n\nwhich identify\n\nc \\frac{1}\\sqrt{\\mu_0 \\varepsilon_0} \n 2.99792458 \\times 10^8 \\, \\text{m/s}\n\nwith the speed of light in free space. In materials with relative permittivity, , and relative permeability, , the phase velocity of light becomes\n\nv_\\text{p} = \\frac{1}\\sqrt{\\mu_0\\mu_\\text{r} \\varepsilon_0\\varepsilon_\\text{r}} \n\nwhich is usuallyThere are cases (anomalous dispersion) where the phase velocity can exceed , but the \"signal velocity\" will still be  less than .\n\nIn addition,  and  are perpendicular to each other and to the direction of wave propagation, and are in phase with each other. A sinusoidal plane wave is one special solution of these equations. Maxwell's equations explain how these waves can physically propagate through space. The changing magnetic field creates a changing electric field through Faraday's law. In turn, that electric field creates a changing magnetic field through Maxwell's addition to Ampère's law. This perpetual cycle allows these waves, now known as electromagnetic radiation, to move through space at velocity .\n\nMacroscopic formulation\n\nThe above equations are the \"microscopic\" version of Maxwell's equations, expressing the electric and the magnetic fields in terms of the (possibly atomic-level) charges and currents present. This is sometimes called the \"general\" form, but the macroscopic version below is equally general, the difference being one of bookkeeping.\n\nThe microscopic version is sometimes called \"Maxwell's equations in a vacuum\": this refers to the fact that the material medium is not built into the structure of the equations, but appears only in the charge and current terms. The microscopic version was introduced by Lorentz, who tried to use it to derive the macroscopic properties of bulk matter from its microscopic constituents.\n\n\"Maxwell's macroscopic equations\", also known as Maxwell's equations in matter, are more similar to those that Maxwell introduced himself.\n\nUnlike the \"microscopic\" equations, the \"macroscopic\" equations separate out the bound charge  and bound current  to obtain equations that depend only on the free charges  and currents . This factorization can be made by splitting the total electric charge and current as follows:\n\n\\begin{align}\n  Q &Q_\\text{f} + Q_\\text{b} \n \\iiint_\\Omega \\left(\\rho_\\text{f} + \\rho_\\text{b} \\right) \\, \\mathrm{d}V = \\iiint_\\Omega \\rho \\,\\mathrm{d}V \\\\\n  I &I_\\text{f} + I_\\text{b} \n \\iint_\\Sigma \\left(\\mathbf{J}_\\text{f} + \\mathbf{J}_\\text{b} \\right) \\cdot \\mathrm{d}\\mathbf{S} = \\iint_\\Sigma \\mathbf{J} \\cdot \\mathrm{d}\\mathbf{S}\n\\end{align}\n\nCorrespondingly, the total current density  splits into free  and bound  components, and similarly the total charge density  splits into free  and bound  parts.\n\nThe cost of this factorization is that additional fields, the displacement field  and the magnetizing field , are defined and need to be determined. Phenomenological constituent equations relate the additional fields to the electric field  and the magnetic -field, often through a simple linear relation.\n\nFor a detailed description of the differences between the microscopic (total charge and current including material contributes or in air/vacuum)In some books—e.g., in U. Krey and A. Owen's Basic Theoretical Physics (Springer 2007)—the term effective charge is used instead of total charge, while free charge is simply called charge.\nand macroscopic (free charge and current; practical to use on materials) variants of Maxwell's equations, see below.\n\nBound charge and current\n\nWhen an electric field is applied to a dielectric material its molecules respond by forming microscopic electric dipoles – their atomic nuclei move a tiny distance in the direction of the field, while their electrons move a tiny distance in the opposite direction. This produces a macroscopic bound charge in the material even though all of the charges involved are bound to individual molecules. For example, if every molecule responds the same, similar to that shown in the figure, these tiny movements of charge combine to produce a layer of positive bound charge on one side of the material and a layer of negative charge on the other side. The bound charge is most conveniently described in terms of the polarization  of the material, its dipole moment per unit volume. If  is uniform, a macroscopic separation of charge is produced only at the surfaces where  enters and leaves the material. For non-uniform , a charge is also produced in the bulk.See  for a good description of how  relates to the bound charge.\n\nSomewhat similarly, in all materials the constituent atoms exhibit magnetic moments that are intrinsically linked to the angular momentum of the components of the atoms, most notably their electrons. The connection to angular momentum suggests the picture of an assembly of microscopic current loops. Outside the material, an assembly of such microscopic current loops is not different from a macroscopic current circulating around the material's surface, despite the fact that no individual charge is traveling a large distance. These bound currents can be described using the magnetization .See  for a good description of how  relates to the bound current.\n\nThe very complicated and granular bound charges and bound currents, therefore, can be represented on the macroscopic scale in terms of  and  which average these charges and currents on a sufficiently large scale so as not to see the granularity of individual atoms, but also sufficiently small that they vary with location in the material. As such, Maxwell's macroscopic equations ignore many details on a fine scale that can be unimportant to understanding matters on a gross scale by calculating fields that are averaged over some suitable volume.\n\nAuxiliary fields, polarization and magnetization\n\nThe definitions (not constitutive relations) of the auxiliary fields are:\n\\begin{align}\n  \\mathbf{D}(\\mathbf{r}, t) &= \\varepsilon_0 \\mathbf{E}(\\mathbf{r}, t) + \\mathbf{P}(\\mathbf{r}, t) \\\\\n  \\mathbf{H}(\\mathbf{r}, t) &= \\frac{1}{\\mu_0} \\mathbf{B}(\\mathbf{r}, t) - \\mathbf{M}(\\mathbf{r}, t)\n\\end{align}\n\nwhere  is the polarization field and  is the magnetization field which are defined in terms of microscopic bound charges and bound currents respectively. The macroscopic bound charge density  and bound current density  in terms of polarization  and magnetization  are then defined as\n\n:\\begin{align}\n        \\rho_\\text{b} &= -\\nabla\\cdot\\mathbf{P} \\\\\n  \\mathbf{J}_\\text{b} &= \\nabla\\times\\mathbf{M} + \\frac{\\partial\\mathbf{P}}{\\partial t}\n\\end{align}\n\nIf we define the total, bound, and free charge and current density by\n\n:\\begin{align}\n        \\rho &= \\rho_\\text{b} + \\rho_\\text{f}, \\\\\n  \\mathbf{J} &= \\mathbf{J}_\\text{b} + \\mathbf{J}_\\text{f},\n\\end{align}\n\nand use the defining relations above to eliminate , and , the \"macroscopic\" Maxwell's equations reproduce the \"microscopic\" equations.\n\nConstitutive relations\n\nIn order to apply 'Maxwell's macroscopic equations', it is necessary to specify the relations between displacement field  and the electric field , as well as the magnetizing field  and the magnetic field . Equivalently, we have to specify the dependence of the polarisation  (hence the bound charge) and the magnetisation  (hence the bound current) on the applied electric and magnetic field. The equations specifying this response are called constitutive relations. For real-world materials, the constitutive relations are rarely simple, except approximately, and usually determined by experiment. See the main article on constitutive relations for a fuller description.\n\nFor materials without polarisation and magnetisation, the constitutive relations are (by definition)\n\\mathbf{D} \\varepsilon_0\\mathbf{E}, \\quad \\mathbf{H} \n \\frac{1}{\\mu_0}\\mathbf{B}\nwhere  is the permittivity of free space and  the permeability of free space. Since there is no bound charge, the total and the free charge and current are equal.\n\nAn alternative viewpoint on the microscopic equations is that they are the macroscopic equations together with the  statement that vacuum behaves like a perfect linear \"material\" without additional polarisation and magnetisation.\nMore generally, for linear materials the constitutive relations are\n\\mathbf{D} \\varepsilon\\mathbf{E}\\,,\\quad \\mathbf{H} \n \\frac{1}{\\mu}\\mathbf{B} \nwhere  is the permittivity and  the permeability of the material. For the displacement field  the linear approximation is usually excellent because for all but the most extreme electric fields or temperatures obtainable in the laboratory (high power pulsed lasers) the interatomic electric fields of materials of the order of 1011 V/m are much higher than the external field. For the magnetizing field \\mathbf{H}, however, the linear approximation can break down in common materials like iron leading to phenomena like hysteresis. Even the linear case can have various complications, however.\n*For homogeneous materials,  and  are constant throughout the material, while for inhomogeneous materials they depend on location within the material (and perhaps time).\n*For isotropic materials,  and  are scalars, while for anisotropic materials (e.g. due to crystal structure) they are tensors.\n*Materials are generally dispersive, so  and  depend on the frequency of any incident EM waves.\n\nEven more generally, in the case of non-linear materials (see for example nonlinear optics),  and  are not necessarily proportional to , similarly  or  is not necessarily proportional to  . In general  and  depend on both  and , on location and time, and possibly other physical quantities.\n\nIn applications one also has to describe how the free currents and charge density behave in terms of  and  possibly coupled to other physical quantities like pressure, and the mass, number density, and velocity of charge-carrying particles. E.g., the original equations given by Maxwell (see History of Maxwell's equations) included Ohms law in the form\n\n\\mathbf{J}_\\text{f} = \\sigma \\mathbf{E}\\,.\n\nAlternative formulations\n\nFollowing is a summary of some of the numerous other ways to write the microscopic Maxwell's equations, showing they can be formulated using different mathematical formalisms.  In addition, we formulate the equations using \"potentials\". Originally they were introduced as a convenient way to solve the homogeneous equations,  but it was originally thought that all the observable physics was contained in the electric and magnetic fields  (or relativistically, the Faraday tensor). The potentials play a central role in quantum mechanics, however, and act quantum mechanically with observable consequences even when the electric and magnetic fields vanish (Aharonov–Bohm effect). See the main articles for the details of each formulation. SI units are used throughout.\n\nwhere\n*In the vector formulation on Euclidean space + time,  is the electrical potential, and  is the vector potential.\n\nRelativistic formulations \n\nThe Maxwell equations can also be formulated on a spacetime-like Minkowski space where space and time are treated on equal footing. The direct spacetime formulations make manifest that the Maxwell equations are relativistically invariant. Because of this symmetry electric and magnetic field are treated on equal footing and are recognised as components of the Faraday tensor. This reduces the four Maxwell equations to two, which  simplifies the equations, although we can no longer use the familiar vector formulation.  In fact the Maxwell equations  in the space + time formulation are not Galileo invariant and have  Lorenz invariance a hidden symmetry. This was a major source of inspiration for the development of relativity theory. To repeat: the space + time formulation is not a non-relativistic approximation and it describes the same physics by simply renaming variables.  For this reason the relativistic invariant equations are usually called the Maxwell equations as well.\n\n*In the tensor calculus formulation, the electromagnetic tensor  is an antisymmetric covariant rank 2 tensor; the four-potential, , is a covariant vector; the current, , is a vector; the square brackets, , denote antisymmetrization of indices;  is the derivative with respect to the coordinate, . In Minkowski space coordinates are chosen with respect to an inertial frame; , so that the metric tensor used to raise and lower indices is . The d'Alembert operator on Minkowski space is  as in the vector formulation. In general spacetimes, the coordinate system  is arbitrary, the covariant derivative , the Ricci tensor,  and raising and lowering of indices are defined by the Lorentzian metric,  and the d'Alembert operator is defined as . The topological restriction is that the second real cohomology group of the space vanishes (see the differential form formulation for an explanation). Note that this is violated for Minkowski space with a line removed, which can model a (flat) spacetime with a point-like monopole on the complement of the line.  \n*In the differential form formulation on arbitrary space times,  is the electromagnetic tensor considered as a 2-form,  is the potential 1-form,  is the current 3-form,  is the exterior derivative, and {\\star} is the Hodge star on forms defined (up to its an orientation, i.e. its sign) by the Lorentzian metric of spacetime. Note that in the special case of -forms such as F, the Hodge star {\\star} depends on the metric tensor only for its local scale. This means that, as formulated, the differential form field equations are conformally invariant, but the Lorenz gauge condition breaks conformal invariance. The operator \\Box = (-{\\star} \\mathrm{d} {\\star} \\mathrm{d} - \\mathrm{d} {\\star} \\mathrm{d} {\\star})  is the d'Alembert–Laplace–Beltrami operator on 1-forms on an arbitrary Lorentzian spacetime. The topological condition is again that the  second real cohomology group is trivial. By the isomorphism with the second de Rham cohomology this condition means that every closed 2-form is exact.\n\nOther formalisms include the geometric algebra formulation and a matrix representation of Maxwell's equations. Historically, a quaternionic formulation was used.\n\nSolutions\n\nMaxwell's equations are partial differential equations that relate the electric and magnetic fields to each other and to the electric charges and currents. Often, the charges and currents are themselves dependent on the electric and magnetic fields via the Lorentz force equation and the constitutive relations. These all form a set of coupled partial differential equations, which are often very difficult to solve. In fact, the solutions of these equations encompass all the diverse phenomena in the entire field of classical electromagnetism. A thorough discussion is far beyond the scope of the article, but some general notes follow.\n\nLike any differential equation, boundary conditions\n\n and initial conditions\n are necessary for a unique solution. For example, even with no charges and no currents anywhere in spacetime, many solutions to Maxwell's equations are possible, not just the obvious solution . Another solution is , , while yet other solutions have electromagnetic waves filling spacetime. In some cases, Maxwell's equations are solved through infinite space, and boundary conditions are given as asymptotic limits at infinity.\n In other cases, Maxwell's equations are solved in just a finite region of space, with appropriate boundary conditions on that region: For example, the boundary could be an artificial absorbing boundary representing the rest of the universe,\nS. G. Johnson, [http://math.mit.edu/~stevenj/18.369/pml.pdf Notes on Perfectly Matched Layers], online MIT course notes (Aug. 2007). or periodic boundary conditions, or (as with a waveguide or cavity resonator) the boundary conditions may describe the walls that isolate a small region from the outside world.\n\nJefimenko's equations (or the closely related Liénard–Wiechert potentials) are the explicit solution to Maxwell's equations for the electric and magnetic fields created by any given distribution of charges and currents. It assumes specific initial conditions to obtain the so-called \"retarded solution\", where the only fields present are the ones created by the charges. Jefimenko's equations are not so helpful in situations when the charges and currents are themselves affected by the fields they create.\n\nNumerical methods for differential equations can be used to approximately solve Maxwell's equations when an exact solution is impossible. These methods usually require a computer, and include the finite element method and finite-difference time-domain method.\n\n For more details, see Computational electromagnetics.\n\nOverdetermination of Maxwell's equations\n\nMaxwell's equations seem overdetermined, in that they involve six unknowns (the three components of  and ) but eight equations (one for each of the two Gauss's laws, three vector components each for Faraday's and Ampere's laws). (The currents and charges are not unknowns, being freely specifiable subject to charge conservation.) This is related to a certain limited kind of redundancy in Maxwell's equations: It can be proven that any system satisfying Faraday's law and Ampere's law automatically also satisfies the two Gauss's laws, as long as the system's initial condition does. This explanation was first introduced by Julius Adams Stratton in 1941. Although it is possible to simply ignore the two Gauss's laws in a numerical algorithm (apart from the initial conditions), the imperfect precision of the calculations can lead to ever-increasing violations of those laws. By introducing dummy variables characterizing these violations, the four equations become not overdetermined after all. The resulting formulation can lead to more accurate algorithms that take all four laws into account.\n\nBoth identities \\nabla\\cdot \\nabla\\times \\mathbf{B} \\equiv 0, \\nabla\\cdot \\nabla\\times \\mathbf{E} \\equiv 0, which reduce eight equations to six independent ones, are the true reason of overdetermination. \n\nLimitations of the Maxwell equations as a theory of electromagnetism\n\nWhile Maxwell's equations (along with the rest of classical electromagnetism) are extraordinarily successful at explaining and predicting a variety of phenomena, they are not exact, but approximations. In some special situations, they can be noticeably inaccurate. Examples include extremely strong fields (see Euler–Heisenberg Lagrangian) and extremely short distances (see vacuum polarization). Moreover, various phenomena occur in the world even though Maxwell's equations predict them to be impossible, such as \"nonclassical light\" and quantum entanglement of electromagnetic fields (see quantum optics). Finally, any phenomenon involving individual photons, such as the photoelectric effect, Planck's law, the Duane–Hunt law, single-photon light detectors, etc., would be difficult or impossible to explain if Maxwell's equations were exactly true, as Maxwell's equations do not involve photons. For the most accurate predictions in all situations, Maxwell's equations have been superseded by quantum electrodynamics.\n\nVariations\n\nPopular variations on the Maxwell equations as a classical theory of electromagnetic fields are relatively scarce because the standard equations have stood the test of time remarkably well.\n\nMagnetic monopoles\n\nMaxwell's equations posit that there is electric charge, but no magnetic charge (also called magnetic monopoles), in the universe. Indeed, magnetic charge has never been observed (despite extensive searches)See magnetic monopole for a discussion of monopole searches. Recently, scientists have discovered that some types of condensed matter, including spin ice and topological insulators, which display emergent behavior resembling magnetic monopoles. (See [http://www.sciencemag.org/cgi/content/abstract/1178868 sciencemag.org] and [http://www.nature.com/nature/journal/v461/n7266/full/nature08500.html nature.com].) Although these were described in the popular press as the long-awaited discovery of magnetic monopoles, they are only superficially related. A \"true\" magnetic monopole is something where , whereas in these condensed-matter systems,  while only . and may not exist. If they did exist, both Gauss's law for magnetism and Faraday's law would need to be modified, and the resulting four equations would be fully symmetric under the interchange of electric and magnetic fields. Maxwell's equations. http://en.wikipedia.org/?curid=19737."
  }
}
