{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14090",
  "eid" : "1187f820-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778538658,
  "textBody" : "The United States Navy, United States Coast Guard, and United States National Oceanic and Atmospheric Administration (NOAA) use a hull classification symbol (sometimes called hull code or hull number) to identify their ships by type and by individual ship within a type.  The system is analogous to the pennant number system that the Royal Navy and other European and Commonwealth navies use.\n\nHistory \n\nUnited States Navy \n\nThe U.S. Navy began to assign unique Naval Registry Identification Numbers to its ships in the 1890s. The system was a simple one in which each ship received a number which was appended to its ship type, fully spelled out, and added parenthetically after the ship's name when deemed necessary to avoid confusion between ships. Under this system, for example, the battleship Indiana was USS Indiana (Battleship No. 1), the cruiser Olympia was USS Olympia (Cruiser No. 6), and so on. Beginning in 1907, some ships also were referred to alternatively by single-letter or three-letter codes—for example, USS Indiana (Battleship No. 1) could be referred to as USS Indiana (B-1) and USS Olympia (Cruiser No. 6) could also be referred to as USS Olympia (C-6), while USS Pennsylvania (Armored Cruiser No. 4) could be referred to as USS Pennsylvania (ACR-4). However, rather than replacing it, these codes coexisted and were used interchangeably with the older system until the modern system was instituted on 17 July 1920.\n\nDuring World War I, the U.S. Navy acquired large numbers of privately owned and commercial ships and craft for use as patrol vessels, mine warfare vessels,  and various types of naval auxiliary ships, some of them with identical names. To keep track of them all, the Navy assigned unique identifying numbers to them. Those deemed appropriate for patrol work received section patrol numbers (SP), while those intended for other purposes received \"identification numbers\", generally abbreviated \"Id. No.\" or \"ID;\" some ships and craft changed from an SP to an ID number or vice versa during their careers, without their unique numbers themselves changing, and some ships and craft assigned numbers in anticipation of naval service never were acquired by the Navy. The SP/ID numbering sequence was unified and continuous, with no SP number repeated in the ID series or vice versa so that there could not be, for example, both an \"SP-435\" and an \"Id. No 435\". The SP and ID numbers were used parenthetically after each boat's or ship's name to identify it; although this system pre-dated the modern hull classification system and its numbers were not referred to at the time as \"hull codes\" or \"hull numbers,\" it was used in a similar manner to today's system and can be considered its precursor.Naval History and heritage Command Online Library of Selected Images (at http://www.history.navy.mil/photos/shusn-no/spid-no.htm).\n\nUnited States Revenue Cutter Service and United States Coast Guard \n\nThe United States Revenue Cutter Service, which merged with the United States Lifesaving Service in January 1915 to form the modern United States Coast Guard, began following the Navy's lead in the 1890s, with its cutters having parenthetical numbers called Naval Registry Identification Numbers following their names, such as (Cutter No. 1), etc.  This persisted until the Navy's modern hull classification system's introduction in 1920, which included Coast Guard ships and craft.\n\nUnited States Coast and Geodetic Survey \n\nLike the U.S. Navy, the United States Coast and Geodetic Survey – a uniformed seagoing service of the United States Government and a predecessor of the National Oceanic and Atmospheric Administration (NOAA) – adopted a hull number system for its fleet in the 20th century. Its largest vessels, \"Category I\" oceanographic survey ships, were classified as \"ocean survey ships\" and given the designation \"OSS\". Intermediate-sized \"Category II\" oceanographic survey ships received the designation \"MSS\" for \"medium survey ship,\" and smaller \"Category III\" oceanographic survey ships were given the classification \"CSS\" for \"coastal survey ship.\" A fourth designation, \"ASV\" for \"auxiliary survey vessel,\" included even smaller vessels. In each case, a particular ship received a unique designation based on its classification and a unique hull number separated by a space rather than a hyphen; for example, the third Coast and Geodetic Survey ship named Pioneer was an ocean survey ship officially known as USC&GS Pioneer (OSS 31).[https://books.google.com/books?iduYSPAAAAMAAJ&pg\nPA3612&lpgPA3612&dq\nOcean+Survey+Ship+(OSS)+MSS+CSS&sourcebl&ots\nq0Iq2sEN7a&sigHN4i6XsnjYb3s8LOLXrPMbSaIUg&hl\nen&saX&ei\n3nBpU8XXFdHboASC64DoAg&ved0CCgQ6AEwAA#v\nonepage&qOcean%20Survey%20Ship%20(OSS)%20MSS%20CSS&f\nfalse United States Department of State, United States Treaties and Other International Obligations, Volume 23, Part Four, Washington, D.C.:U.S. Government Printing Office, 1972, p. 3612.][http://docs.lib.noaa.gov/rescue/cgs/011_pdf/CSC-0205.pdf United States Department of Commerce, Annual Report of the Director of the Coast and Geodetic Survey for the Fiscal Year Ending June 30, 1964, U.S. Government Printing Office, Washington, D.C.: 1964, pp. 3, 4, 5.] The Coast and Geodetic Surveys system persisted after the creation of NOAA in 1970, when NOAA took control of the Surveys fleet, but NOAA later changed to its modern hull classification system.\n\nThe modern hull classification system \n\nUnited States Navy \n\nThe U.S. Navy instituted its modern hull classification system on 17 July 1920, doing away with section patrol numbers, \"identification numbers\", and the other numbering systems described above.  In the new system, all hull classification symbols are at least two letters; for basic types the symbol is the first letter of the type name, doubled, except for aircraft carriers.\n\nThe combination of symbol and hull number identifies a modern Navy ship uniquely. A heavily modified or re-purposed ship may receive a new symbol, and either retain the hull number or receive a new one. For example, the heavy gun cruiser  was converted to a gun/missile cruiser, changing the hull number to CAG-1. Also, the system of symbols has changed a number of times both since it was introduced in 1907 and since the modern system was instituted in 1920, so ships' symbols sometimes change without anything being done to the physical ship.Derdall and DiGiulian, (section: Nomenclature history)\n\nHull numbers are assigned by classification. Duplication between, but not within, classifications is permitted. Hence, CV-1 was the aircraft carrier  and BB-1 was the battleship .\n\nShip types and classifications have come and gone over the years, and many of the symbols listed below are not presently in use. The Naval Vessel Register maintains an online database of U.S. Navy ships showing which symbols are presently in use.\n\nAfter World War II until 1975, the U.S. Navy defined a \"frigate\" as a type of surface warship larger than a destroyer and smaller than a cruiser.  In other navies, such a ship generally was referred to as a \"flotilla leader\", or \"destroyer leader\".  Hence the U.S. Navy's use of \"DL\" for \"frigate\" prior to 1975, while \"frigates\" in other navies were smaller than destroyers and more like what the U.S. Navy termed a \"destroyer escort\", \"ocean escort\", or \"DE\".  The United States Navy 1975 ship reclassification of cruisers, frigates, and ocean escorts brought U.S. Navy classifications into line with other nations' classifications, at least cosmetically in terms of terminology, and eliminated the perceived \"cruiser gap\" with the Soviet Navy by redesignating the former \"frigates\" as \"cruisers\".\n\nMilitary Sealift Command \n\nIf a U.S. Navy ship's hull classification symbol begins with \"T-\", it is part of the Military Sealift Command, has a primarily civilian crew, and is a United States Naval Ship (USNS) in non-commissioned service – as opposed to a commissioned United States Ship (USS) with an all-military crew.\n\nUnited States Coast Guard \n\nIf a ship's hull classification symbol begins with \"W\", it is a ship of the United States Coast Guard.  Until 1965, the Coast Guard used U.S. Navy hull classification codes, prepending a \"W\" to their beginning.  In 1965, it retired some of the less mission-appropriate Navy-based classifications and developed new ones of its own, most notably WHEC for \"high endurance cutter\" and WMEC for \"medium endurance cutter\".\n\nNational Oceanic and Atmospheric Administration \n\nThe National Oceanic and Atmospheric Administration (NOAA), a component of the United States Department of Commerce, includes the National Oceanic and Atmospheric Administration Commissioned Officer Corps (or \"NOAA Corps\"), one of the seven uniformed services of the United States, and operates a fleet of seagoing research and survey ships. The NOAA fleet also uses a hull classification symbol system, which it also calls \"hull numbers,\" for its ships.\n\nAfter NOAA took over the former Coast and Geodetic Survey fleet in 1970 along with research vessels of other government agencies, it adopted a new system of ship classification. In its system, the NOAA fleet is divided into two broad categories, research ships and survey ships.  The research ships, which include oceanographic and fisheries research vessels, are given hull numbers beginning with \"R\", while the survey ships, generally hydrographic survey vessels, receive hull numbers beginning with \"S\". The letter is followed by a three-digit number; the first digit indicates the NOAA \"class\" (i.e., size) of the vessel, which NOAA assigns based on the ship's gross tonnage and horsepower, while the next two digits combine with the first digit to create a unique three-digit identifying number for the ship.\n\nGenerally, each NOAA hull number is written with a space between the letter and the three-digit number, as in, for example,  or .Wertheim, The Naval Institute Guide to Combat Fleets of the World, 15th Edition: Their Ships, Aircraft, and Systems, p. 1005.\n\nUnlike the Navy, once an older NOAA ship leaves service, a newer one can be given the same hull number; for example, \"S 222\" was assigned to , then assigned to NOAAS Thomas Jefferson (S 222), which entered NOAA service after Mount Mitchell was stricken.\n\nUnited States Navy hull classification codes \n\nThe U.S. Navy's system of alpha-numeric ship designators, and its associated hull numbers, have been for several decades a unique method of categorizing ships of all types: combatants, auxiliaries and district craft. Though considerably changed in detail and expanded over the years, this system remains essentially the same as when formally implemented in 1920. It is a very useful tool for organizing and keeping track of naval vessels, and also provides the basis for the identification numbers painted on the bows (and frequently the sterns) of most U.S. Navy ships.\n\nThe ship designator and hull number system's roots extend back to the late 1880s, when ship type serial numbers were assigned to most of the new-construction warships of the emerging \"Steel Navy\". During the course of the next thirty years, these same numbers were combined with filing codes used by the Navy's clerks to create an informal version of the system that was put in place in 1920. Limited usage of ship numbers goes back even earlier, most notably to the \"Jeffersonian Gunboats\" of the early 1800s and the \"Tinclad\" river gunboats of the Civil War Mississippi Squadron.\n\nIt is important to understand that hull number letter prefixes are not acronyms, and should not be carelessly treated as abbreviations of ship type classifications. Thus, \"DD\" does not stand for anything more than \"Destroyer\". \"SS\" simply means \"Submarine\". And \"FF\" is the post-1975 type code for \"Frigate.\"\n\nThe hull classification codes for ships in active duty in the United States Navy are governed under Secretary of the Navy Instruction 5030.8B [http://www.nvr.navy.mil/5030.8B.pdf (SECNAVINST 5030.8B).]\n\nWarships \n\nWarships are designed to participate in combat operations.\n\nThe origin of the 2 letter code derives from the need to distinguish various cruiser subtypes.Derdall and DiGiulian, (section: Cruisers)\n\nAircraft carrier type \n\nAircraft carriers are ships designed primarily for the purpose of conducting combat operations by aircraft which engage in attacks against airborne, surface, sub-surface and shore targets.  Contrary to popular belief, the \"CV\" hull classification symbol does not stand for \"carrier vessel\". \"CV\" derives from the cruiser designation, with the v for French voler, \"to fly\". Aircraft carriers are designated in two sequences: the first sequence runs from CV-1 USS Langley to the very latest ships, and the second sequence, \"CVE\" for escort carriers, ran from CVE-1 Long Island to CVE-127 Okinawa before being discontinued.\n\n* AV: Seaplane Tender (retired)\n* AVG: Auxiliary Aircraft Ferry (Escort carrier) (1941–2)\n* AVD: Seaplane Tender Destroyer (retired)\n* AVP: Seaplane Tender, Small (retired)\n* AVT (i) Auxiliary Aircraft Transport (retired)\n* AVT (ii) Auxiliary Training Carrier (retired)\n* ACV: Auxiliary Aircraft Carrier (Escort carrier) (1942)\n* CV: Fleet aircraft carrier (1921–1975), multi-purpose aircraft carrier (1975–present)\n* CVA: Aircraft Carrier, Attack (category merged into CV, 30 June 1975)\n* CV(N): Aircraft Carrier, Night (Deck equipped with lighting and pilots trained and for nighttime fights) (1944) (retired)\n* CVAN: Aircraft Carrier, Attack, Nuclear-powered (category merged into CVN, 30 June 1975)\n* CVB: Aircraft Carrier, Large (Original USS Midway class, category merged into CVA, 1952)\n* CVE: Escort aircraft carrier (retired) (1943–retirement of type)\n* CVHA: Aircraft Carrier, Helicopter Assault (retired in favor of several LH-series amphibious assault ship hull codes)\n* CVHE: Aircraft Carrier, Helicopter, Escort (retired)\n* CVL: Light aircraft carrier or Aircraft Carrier, Small (retired) [https://www.history.navy.mil/content/dam/nhhc/research/histories/naval-aviation/Naval%20Aviation%20News/1940/pdf/1aug43.pdf Bureau of Aeronautics, Navy Department.\"New Carrier Designations\". BuAER News (title later changed to Naval Aviation News). Washington, D.C. No. 198 (1 Aug 1943) page 9.][http://babel.hathitrust.org/cgi/pt?idmdp.39015031962056;view\n1up;seq=3 United States. Office of Naval History. Glossary of U. S. Naval Abbreviations. 3d ed. Washington: U. S. Govt. Print. Off., 1947. page 20.]United States. Office of Naval Records and History. Glossary of US Naval Abbreviations. 5th ed. Washington: U. S. Govt. Print. Off., 1949. [http://www.history.navy.mil/research/library/online-reading-room/title-list-alphabetically/u/us-navy-abbreviations-of-ww2.html Naval History and Heritage Command]. accessed 6 May 2017.\n* CVN: Aircraft Carrier, Nuclear-powered\n* CVS: Antisubmarine Aircraft Carrier (retired)\n* CVT: Aircraft Carrier, Training (changed to AVT (Auxiliary))\n* CVU: Aircraft Carrier, Utility (retired)\n* CVG: Aircraft Carrier, Guided Missile (retired)\n* CVV:http://oai.dtic.mil/oai/oai?verbgetRecord&metadataPrefix\nhtml&identifier=AD0757047 Aircraft Carrier, Vari-Purpose, Medium (retired unused)\n\nSurface combatant type \n\nSurface combatants are ships which are designed primarily to engage enemy forces on the high seas.  The primary surface combatants are battleships, cruisers and destroyers.  Battleships are very heavily armed and armored; cruisers moderately so; destroyers and smaller warships, less so.  Before 1920, ships were called \" no. X\", with the type fully pronounced.  The types were commonly abbreviated in ship lists to \"B-X\", \"C-X\", \"D-X\" et cetera—for example, before 1920,  would have been called \"USS Minnesota, Battleship number 22\" orally and \"USS Minnesota, B-22\" in writing.  After 1920, the ship's name would have been both written and pronounced \"USS Minnesota (BB-22)\". In generally decreasing size, the types are:\n\n* ACR: Armored Cruiser (pre-1920)\n* AFSB: Afloat Forward Staging Base (also AFSB(I) for \"interim\", changed to ESB for Expeditionary Mobile Dock)\n* B: Battleship (pre-1920)\n* BB: Battleship\n* BBG: Battleship, Guided Missile or Arsenal Ship (theoretical only, never assigned)See .\n* BM: Monitor (1920–retirement)\n* C: Cruiser (pre-1920 Protected Cruisers and Peace Cruisers)\n* CA: (first series) Cruiser, Armored (retired, comprised all surviving pre-1920 Armored and Protected Cruisers)\n* CA: (second series) Heavy Cruiser, category later renamed Gun Cruiser (retired)\n* CAG: Cruiser, Guided Missile (retired)\n* CB:  Large cruiser (retired)\n* CBC: Large Command Cruiser (retired, never used operationally)See .\n* CC: Battlecruiser (retired, never used operationally)See .\n* CC: (second usage) Command Ship (retired)See .\n* CLC: Command Cruiser\n* CG: Cruiser, Guided Missile\n* CGN: Cruiser, Guided Missile, Nuclear-powered\n* CL: Light Cruiser Cruiser Light (retired)\n* CLAA: Cruiser, Light, Anti-aircraft (retired)\n* CLG: Cruiser, Light, Guided Missile (retired)\n* CLGN: Cruiser, Light, Guided Missile, Nuclear-powered (retired)\n* CLK: Cruiser, Hunter-Killer (abolished 1951)see .\n* CM: Cruiser-minelayer (retired)\n* CS: Scout Cruiser (retired)\n* CSGN: Strike Cruiser Cruiser, Strike, Guided Missile, Nuclear-powered\n* D: Destroyer (pre-1920)\n* DD: Destroyer\n* DDC: Corvette (briefly proposed in the mid-1950s)\n* DDE: Escort Destroyer, a Destroyer (DD) converted for antisubmarine warfare - category abolished 1962. (not to be confused with Destroyer Escort DE)\n* DDG: Destroyer, Guided Missile\n* DDK: Hunter-Killer Destroyer (category merged into DDE, 4 March 1950)\n* DDR: Destroyer, Radar Picket (retired)\n\n* DM: Destroyer, Minelayer (retired)\n* DMS: Destroyer, Minesweeper (retired)\n\n* PG: Patrol Gunboat (retired)\n* PCH: Patrol Craft. Hydrofoil (retired)\n* PHM: Patrol, Hydrofoil, Missile (retired)\n* K: Corvette (retired)\n\n* M: Monitor (1880s–1920)\n* TB: Torpedo boat\n\nSubmarine type \n\nSubmarines are all self-propelled submersible types (usually started with SS) regardless of whether employed as combatant, auxiliary, or research and development vehicles which have at least a residual combat capability. While some classes, including all diesel-electric submarines, are retired from USN service, non-U.S. navies continue to employ SS, SSA, SSAN, SSB, SSC, SSG, SSM, and SST types.Russia still employs several SSA and SSAN class submarines like the Delta Stretch as well as one SST, China has older SSB and SSG types such as the Golf and Mod Romeo classes, and North Korea has built many SSCs and SSMs. See 2007–2008 Janes Fighting Ships. With the advent of new Air Independent Propulsion/Power (AIP) systems, both SSI and SSP are used to distinguish the types within the USN, but SSP has been declared the preferred term. SSK, retired by the USN, continues to be used colloquially and interchangeably with SS for diesel-electric attack/patrol submarines within the USN, and more formally by the Royal Navy and British firms such as Jane's Information Group.\n\n* SC: Cruiser Submarine (retired)\n* SF: Fleet Submarine (retired)\n* SM: Submarine Minelayer (retired)\n* SS: Submarine, Attack Submarine[http://www.nvr.navy.mil/CLASS.HTM U.S. Navy Ship And Service Craft Classifications] \n* SSA: Submarine Auxiliary, Auxiliary/Cargo Submarine\n* SSAN: Submarine Auxiliary Nuclear, Auxiliary/Cargo Submarine, Nuclear-powered\n* SSB: Submarine Ballistic, Ballistic Missile Submarine\n* SSBN: Submarine Ballistic Nuclear, Ballistic Missile Submarine, Nuclear-powered\n* SSC: Coastal Submarine, over 150 tons\n* SSG: Guided Missile Submarine\n* SSGN: Guided Missile Submarine, Nuclear-powered\n* SSI: Attack Submarine (Diesel Air-Independent Propulsion)\n* SSK: Hunter-Killer/ASW Submarine (retired)[http://www.nvr.navy.mil/oldclass.htm Inactive Classification Symbols] \n* SSM: Midget Submarine, under 150 tons\n* SSN: Attack Submarine, Nuclear-powered\n* SSNR: Special Attack Submarine This odd entry is not recognised by the U.S. Naval Vessel Register, and appears only in MIL-STD-2525A: Common Warfighting Symbology (15 December 1996) and later editions (MIL-STD-2525B: Common Warfighting Symbology (30 January 1999) and MIL-STD-2525C: Common Warfighting Symbology (17 November 2008)). It seems to refer to some kind of nuclear-powered submarine used by Special Operations Forces.\n* SSO: Submarine Oiler (retired)\n* SSP: Attack Submarine (Diesel Air-Independent Power) (alternate use), formerly Submarine Transport\n* SSQ: Auxiliary Submarine, Communications (retired)\n* SSQN: Auxiliary Submarine, Communications, Nuclear-powered (retired)[http://www.dia.mil/publicaffairs/Foia/abbrev_acron.pdf 28034_cov.fh] \n* SSR: Radar Picket Submarine (retired)\n* SSRN: Radar Picket Submarine, Nuclear-powered (retired)\n* SST: Training Submarine\n\n* IXSS: Unclassified Miscellaneous Submarine\n* MTS:  Moored Training Ship (Naval Nuclear Power School Training Platform; Reconditioned SSBN's)\n\nPatrol combatant type \n\nPatrol combatants are ships whose mission may extend beyond coastal duties and whose characteristics include adequate endurance and sea keeping, providing a capability for operations exceeding 48 hours on the high seas without support. This notably included Brown Water Navy/Riverine Forces during the Vietnam War. Few of these ships are in service today.\n\n* PBR: Patrol Boat, River, Brown Water Navy (Pibber or PBR-Vietnam)\n* PC: Coastal Patrol, originally Sub Chaser\n* PCF: Patrol Craft, Fast; Swift Boat, Brown Water Navy (Vietnam)\n* PE: Eagle Boat of World War I\n* PF: World War II Frigate, based on British .\n** PFG: Original designation of \n* PG: Gunboat, later Patrol combatant\n* PGH: Patrol Combatant, Hydrofoil\n* PHM: Patrol, Hydrofoil Missile\n* PR: Patrol, River, such as the \n* PT: Motor Torpedo Boat (World War II)\n* PTF: Patrol Torpedo Fast, Brown Water Navy (Vietnam)\n* PTG: Patrol Torpedo Gunboat\n* Monitor: Heavily gunned riverine boat, Brown Water Navy (Vietnam)\n* ASPB: Assault Support Patrol Boat, \"Alpha Boat\", Brown Water Navy; also used as riverine minesweeper (Vietnam)\n* PACV: Patrol, Air Cushion Craft, Brown Water Navy (Vietnam)\n* SP: Section Patrol, used indiscriminately for patrol vessels, mine warfare vessels, and some other types (World War I; retired 1920)\n\nAmphibious warfare type \n\nAmphibious warfare vessels include all ships having organic capability for amphibious warfare and which have characteristics enabling long duration operations on the high seas.  There are two classifications of craft: amphibious warfare ships which are built to cross oceans, and landing craft, which are designed to take troops from ship to shore in an invasion.\n\nShips\n* AKA: Attack Cargo Ship (To LKA, 1969)\n* APA: Attack Transport (To LPA, 1969)\n* APD: High speed transport  (Converted Destroyer or Destroyer Escort) (To LPR, 1969)\n* AGC: Amphibious Force Flagship (To LCC, 1969)\n* LCC: Amphibious Command Ship\n* LHA: General-Purpose Amphibious Assault Ship also known as Landing Helicopter Assault\n* LHD: Multi-Purpose Amphibious Assault Ship also known as Landing Helicopter Dock\n* LKA: Amphibious Cargo Ship (out of commission)\n* LPA: Amphibious Transport\n* LPD: Amphibious transport dock\n* LPH: Landing Platform Helicopter\n* LPR: High speed transport\n* LSD: Landing Ship, Dock\n* LSH: Landing Ship, Heavy\n* LSIL: Landing Ship, Infantry (Large) (formerly LCIL)\n* LSL: Landing Ship, Logistics\n* LSM: Landing Ship, Medium\n* LSM(R): Landing Ship, Medium (Rocket)\n* LSSL: Landing Ship, Support (Large) (formerly LCSL)\n* LST: Landing Ship, Tank\n* LST(H): Landing Ship, Tank (Hospital)\n* LSV: Landing Ship, Vehicle\n\nLanding Craft\n* LCA: Landing Craft, Assault\n* LCAC: Landing Craft Air Cushion\n* LCFF: (Flotilla Flagship)\n* LCH: Landing Craft, Heavy\n* LCI: Landing Craft, Infantry, World War II era classification further modified by\n**(G) – Gunboat\n**(L)- Large\n**(M)- Mortar\n**(R) – Rocket\n* LCL: Landing Craft, Logistics (UK)\n* LCM: Landing Craft, Mechanized\n* LCP: Landing Craft, Personnel\n* LCP(L): Landing Craft, Personnel, Large\n* LCP(R): Landing Craft, Personnel, Ramped\n* LCPA: Landing Craft, Personnel, Air-Cushioned\n* LCS(L): Landing Craft, Support (Large) changed to LSSL in 1949\n* LCT: Landing Craft, Tank (World War II era)\n* LCU: Landing Craft, Utility\n* LCVP: Landing Craft, Vehicle and Personnel\n* LSH: Landing Ship Heavy (Royal Australian Navy)\n\nExpeditionary Support\n\nOperated by Military Sealift Command, have ship prefix \"USNS\", hull code begins with \"T-\".\n* ESD: Expeditionary Transfer Dock\n* ESB: Expeditionary Mobile Base (a variant of ESD, formerly AFSB)\n* EPF: Expeditionary Fast Transport\n* MLP: Mobile Landing Platform (changed to ESD) \n* JHSV: Joint High Speed Vessel (changed to EPF)\n* HST: High Speed Transport (similar to JHSV, not to be confused with WWII-era High speed transport (APD))\n* HSV: High Speed Vessel\n\nCombat Logistics Type \n\nShips which have the capability to provide underway replenishment to fleet units.\n\n* AC: Collier (retired)\n* AE: Ammunition Ship\n* AF: Stores Ship (retired)\n* AFS: Combat Stores Ship\n* AKE: Advanced Dry Cargo Ship\n* AKS: General Stores Ship\n* AO: Fleet Oiler\n* AOE: Fast Combat Support Ship\n* AOR: Replenishment Oiler\n* AW: Distilling Ship (retired)\n\nMine warfare type \n\nMine warfare ships are those ships whose primary function is mine warfare on the high seas.\n\n* ADG: Degaussing Ship\n* AM: Minesweeper\n* AMb: Harbor Minesweeper\n* AMc: Coastal Minesweeper\n* AMCU: Underwater Mine Locater\n* AMS: Motor Minesweeper\n* CM: Cruiser (i.e., Large) Minelayer\n* CMc: Coastal Minelayer\n* DM: High Speed Minelayer (Converted Destroyer)\n* DMS: High Speed Minesweeper (Converted Destroyer)\n* MCM: Mine Countermeasures Ship\n* MCS: Mine Countermeasures Support Ship\n* MH(C)(I)(O)(S): Minehunter, (Coastal) (Inshore) (Ocean) (Hunter and Sweeper, General)\n* MLC: Coastal Minelayer\n* MSC: Minesweeper, Coastal\n* MSO: Minesweeper, Ocean\n* PCS: Submarine Chasers (wooden) fitted for minesweeping\n* YDG: District Degaussing Vessel\n\nCoastal defense type \n\nCoastal defense ships are those whose primary function is coastal patrol and interdiction.\n\n* FS: Corvette\n* PB: Patrol boat\n* PBR:  Patrol Boat, River\n* PC: Patrol, Coastal\n* PCE: Patrol Craft, Escort\n* PCF: Patrol Craft, Fast, (Swift Boat)\n* PF: Frigate, in a role similar to World War II Commonwealth corvette\n* PG: Patrol Gunboat\n* PGM: Motor Gunboat (To PG, 1967)\n* PR: Patrol, River\n* SP: Section Patrol\n\nMobile logistics type \n\nMobile logistics ships have the capability to provide direct material support to other deployed units operating far from home ports.\n\n* AD: Destroyer Tender\n* AGP: Patrol Craft Tender\n* AR: repair ship\n* AS: Submarine tender\n* AV: Seaplane Tender\n\nAuxiliary type \n\nAn auxiliary ship is designed to operate in any number of roles supporting combatant ships and other naval operations.\n* AN: Net Laying Ship\n* ARL: Auxiliary Repair Light—light craft or landing craft repair ship (World War II-era, out of commission)\n* ATF: Fleet Ocean Tug\n* AGHS: Patrol Combatant Support Ship—Ocean or Inshore\n\nAirships \n\nAlthough technically an aircraft, pre-World War II rigid airships (e.g., zeppelins) were treated like commissioned surface warships and submarines, flew the U.S. ensign from their stern and carried a United States Ship (USS) designation.  Non-rigid airships (e.g., blimps) continued to fly the U.S. ensign from their stern, but were always considered to be primarily aircraft.\n* ZMC: Airship Metal Clad\n* ZNN-G: G-Class Blimp\n* ZNN-J: J-Class Blimp\n* ZNN-L: L-Class Blimp\n* ZNP-K: K-Class Blimp\n* ZNP-M: M-Class Blimp\n* ZNP-N: N-Class Blimp\n* ZPG-3W: surveillance patrol blimp\n* ZR: Rigid Airship\n* ZRS: Rigid Airship Scout\n\nSupport ships \n\nSupport ships are not designed to participate in combat, and are generally not armed.  For ships with civilian crews (owned by and/or operated for Military Sealift Command and the Maritime Administration), the prefix T- is placed at the front of the hull classification.\n\nSupport type \n\nSupport ships are designed to operate in the open ocean in a variety of sea states to provide general support to either combatant forces or shore based establishments. They include smaller auxiliaries which, by the nature of their duties, leave inshore waters.\n\n* AC: Collier (retired)\n* ACS: Auxiliary Crane Ship\n* AG: Miscellaneous Auxiliary\n* AGDE: Testing Ocean Escort\n* AGDS: Deep Submergence Support Ship\n* AGER (i): Miscellaneous Auxiliary, Electronic Reconnaissance\n* AGER (ii): Environmental Research Ship\n* AGF: Miscellaneous Command Ship\n* AGFF: Testing Frigate\n* AGL: Auxiliary vessel, lighthouse tender\n* AGM: Missile Range Instrumentation Ship\n* AGOR: Oceanographic Research Ship\n* AGOS: Ocean Surveillance Ship\n* AGP: Motor Torpedo Boat Tender\n* AGS: Surveying Ship\n* AGSE: Submarine and Special Warfare Support \n* AGSS: Auxiliary Research Submarine\n* AGTR: Technical research ship\n* AH: Hospital ship\n* AK: Cargo Ship\n* AKR: Vehicle Cargo Ship\n* AKS: Store Issue Ship\n* AO: Oiler\n* AOE: Fast Combat Support Ship\n* AOR: Replenishment oiler (retired)\n* AOG: Gasoline Tanker\n* AOT: Transport Oiler\n* AP: Transport\n* ARC: Cable Repair Ship (see also Cable layer)\n* ARG: Internal Combustion Engine repair ship \n* APB: Self-propelled Barracks Ship\n* APL: Barracks Craft\n* ARB: Battle Damage Repair Ship\n* ARL: Small Repair Ship\n* ARS: Salvage Ship\n* AS: Submarine tender\n* ASR: Submarine Rescue Ship\n* AT: Ocean-Going Tug\n* ATA: Auxiliary Ocean Tug\n* ATF: Fleet Ocean Tug\n* ATLS Drone Launch Ship\n* ATS: Salvage and Rescue Ship\n* AVB(i): Aviation Logistics Support Ship\n* AVB(ii):Advance Aviation Base Ship\n* AVS: Aviation Stores Issue Ship\n* AVT(i): Auxiliary Aircraft Transport\n* AVT(ii): Auxiliary Aircraft Landing Training Ship\n* EPCER: Experimental - Patrol Craft Escort - Rescue\n* ID or Id. No.: Civilian ship taken into service for auxiliary duties, used indiscriminately for large ocean-going ships of all kinds and coastal and yard craft (World War I; retired 1920)\n* PCER: Patrol Craft Escort - Rescue \n\n* SBX: Sea-based X-band Radar - a mobile active electronically scanned array early-warning radar station.\n\nService type craft \n\nService craft are navy-subordinated craft (including non-self-propelled) designed to provide general support to either combatant forces or shore-based establishments.  The suffix \"N\" refers to non-self-propelled variants.\n\n* AB: Crane Ship\n* AFDB: Large Auxiliary Floating Dry Dock\n* AFD/AFDL: Small Auxiliary Floating Dry Dock\n* AFDM: Medium Auxiliary Floating Dry Dock\n* APB: Self-Propelled Barracks Ship\n* APL: Barracks Craft\n* ARD: Auxiliary Repair Dry Dock\n* ARDM: Medium Auxiliary Repair Dry Dock  \n* ATA: Auxiliary Ocean Tug\n* DSRV: Deep Submergence Rescue Vehicle\n* DSV: Deep Submergence Vehicle\n* JUB/JB : Jack Up Barge\n* NR: Submersible Research Vehicle\n* YC: Open Lighter\n* YCF: Car Float\n* YCV: Aircraft Transportation Lighter\n* YD: Floating Crane\n* YDT: Diving Tender\n* YF: Covered Lighter\n* YFB: Ferry Boat or Launch\n* YFD: Yard Floating Dry Dock\n* YFN: Covered Lighter (non-self propelled)\n* YFNB: Large Covered Lighter (non-self propelled)\n* YFND: Dry Dock Companion Craft (non-self propelled)\n* YFNX: Lighter (Special purpose) (non-self propelled)\n* YFP: Floating Power Barge\n* YFR: Refrigerated Cover Lighter\n* YFRN: Refrigerated Covered Lighter (non-self propelled)\n* YFRT: Range Tender\n* YFU: Harbor Utility Craft\n* YG: Garbage Lighter\n* YGN: Garbage Lighter (non-self propelled)\n* YH: Ambulance boat/small medical support vessel\n* YLC: Salvage Lift Craft\n* YM: Dredge\n* YMN: Dredge (non-self propelled)\n* YNG: Gate Craft\n* YNT: Net Tender\n* YO: Fuel Oil Barge\n* YOG: Gasoline Barge\n* YOGN: Gasoline Barge (non-self propelled)\n* YON: Fuel Oil Barge (non-self propelled)\n* YOS: Oil Storage Barge\n* YP:  Patrol Craft, Training\n* YPD: Floating Pile Driver\n* YR: Floating Workshop\n* YRB: Repair and Berthing Barge\n* YRBM: Repair, Berthing and Messing Barge\n* YRDH: Floating Dry Dock Workshop (Hull)\n* YRDM: Floating Dry Dock Workshop (Machine)\n* YRR: Radiological Repair Barge\n* YRST: Salvage Craft Tender\n* YSD: Seaplane Wrecking Derrick\n* YSR: Sludge Removal Barge\n* YT: Harbor Tug (craft later assigned YTB, YTL, or YTM classifications)\n* YTB: Large Harbor Tug\n* YTL: Small Harbor Tug\n* YTM: Medium Harbor Tug\n* YTT: Torpedo Trials Craft\n* YW: Water Barge\n* YWN: Water Barge (non-self propelled)\n* ID or Id. No.: Civilian ship taken into service for auxiliary duties, used indiscriminately for large ocean-going ships of all kinds and coastal and yard craft  (World War I; retired 1920)\n* IX: Unclassified Miscellaneous Unit\n* X: Submersible Craft\n* \"none\": To honor her unique historical status, USS Constitution, formerly IX 21, was reclassified to \"none\", effective 1 September 1975.\n\nUnited States Coast Guard craft \n\nPrior to 1965, U.S. Coast Guard ships used the same designation as naval ships, but preceded by a \"W\" to indicate Coast Guard subordination.\n\n* CG: all Coast Guard Ships in the 1920s (retired)\n* WAGB: Coast Guard \n* WAGL: Auxiliary vessel, lighthouse tender (retired 1960's)\n* WAVP: seagoing Coast Guard seaplane tenders (retired 1960s)\n* WDE: seagoing Coast Guard destroyer escorts (retired 1960s)\n* WHEC: Coast Guard High Endurance Cutters\n* WIX: Coast Guard Barque Eagle\n* WLB: Coast Guard buoy tenders\n* WLBB: Coast Guard seagoing buoy tenders/ice breaker\n* WLM: Coast Guard coastal buoy tenders\n* WLI: Coast Guard inland buoy tenders\n* WLIC: Coast Guard inland construction tenders\n* WLR: Coast Guard river buoy tenders\n* WMEC: Coast Guard Medium Endurance Cutters\n* WMSL: Coast Guard Maritime Security Cutter, Large (referred to as National Security Cutters)\n* WPC: Coast Guard patrol craft—later reclassed under WHEC\n* WPB: Coast Guard Patrol Boats\n* WPG: seagoing Coast Guard gunboats (retired 1960s)\n* WTGB: Coast Guard Tug Boat (140' icebreakers)\n* WYTL: Small harbor Tug\n\nTemporary designations\n\nUnited States Navy Designations (Temporary) are a form of U.S. Navy ship designation, intended for temporary identification use. Such designations usually occur during periods of sudden mobilization, such as that which occurred prior to, and during, World War II or the Korean War, when it was determined that a sudden temporary need arose for a ship for which there was no official Navy designation.\n\nDuring World War II, for example, a number of commercial vessels were requisitioned, or acquired, by the U.S. Navy to meet the sudden requirements of war. A yacht acquired by the U.S. Navy during the start of World War II might seem desirable to the Navy whose use for the vessel might not be fully developed or explored at the time of acquisition.\n\nOn the other hand, a U.S. Navy vessel, such as the yacht in the example above, already in commission or service, might be desired, or found useful, for another need or purpose for which there is no official designation.\n\n* IX: Unclassified Miscellaneous Auxiliary Ship, for example yacht Chanco acquired by the U.S. Navy on 1 October 1940. It was classified as a minesweeper , but instead, mainly used as a patrol craft along the New England coast. When another assignment came, and it could not be determined how to classify the vessel, it was redesignated IX-175 on 10 July 1944.\n* IXSS: Unclassified Miscellaneous Submarines, such as the , the  and the .\n* YAG: Miscellaneous Auxiliary Service Craft, such as the ,  and  which, curiously, was earlier known as .\n\nNumerous other U.S. Navy vessels were launched with a temporary, or nominal, designation, such as YMS or PC, since it could not be determined, at time of construction, what they should be used for. Many of these were vessels in the 150 to 200 feet length class with powerful engines, whose function could be that of a minesweeper, patrol craft, submarine chaser, seaplane tender, tugboat, or other. Once their destiny, or capability, was found or determined, such vessels were reclassified with their actual designation.\n\nNational Oceanic and Atmospheric Administration hull codes \n\n* R: Research ships, including oceanographic and fisheries research ships\n* S: Survey ships, including hydrographic survey ships\n\nThe letter is paired with a three-digit number. The first digit of the number is determined by the ships \"power tonnage,\" defined as the sum of its shaft horsepower and gross international tonnage, as follows:\n\n* If the power tonnage is 5,501 through 9,000, the first digit is \"1\".\n* If the power tonnage 3,501 through 5,500, the first digit is \"2.\"\n* If the power tonnage is 2,001 through 3,500, the first digit is \"3.\"\n* If the power tonnage is 1,001 through 2,000, the first digit is \"4.\"\n* If the power tonnage is 501 through 1,000, the first digit is \"5.\"\n* If the power tonnage is 500 or less and the ship is at least 65 feet (19.8 meters) long, the first digit is \"6.\"[http://www.corporateservices.noaa.gov/ames/administrative_orders/chapter_217/217-108.html noaa.gov NOAA Office of the Administratuve Officer \"NAO 217-108: Classification of NOAA Vessels\" issued 1 October 2013]\n\nThe second and third digits are assigned to create a unique three-digit hull number.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hull classification symbol" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14090" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The United States Navy, United States Coast Guard, and United States National Oceanic and Atmospheric Administration (NOAA) use a hull classification symbol (sometimes called hull code or hull number) to identify their ships by type and by individual ship within a type.  The system is analogous to the pennant number system that the Royal Navy and other European and Commonwealth navies use.\n\nHistory \n\nUnited States Navy \n\nThe U.S. Navy began to assign unique Naval Registry Identification Numbers to its ships in the 1890s. The system was a simple one in which each ship received a number which was appended to its ship type, fully spelled out, and added parenthetically after the ship's name when deemed necessary to avoid confusion between ships. Under this system, for example, the battleship Indiana was USS Indiana (Battleship No. 1), the cruiser Olympia was USS Olympia (Cruiser No. 6), and so on. Beginning in 1907, some ships also were referred to alternatively by single-letter or three-letter codes—for example, USS Indiana (Battleship No. 1) could be referred to as USS Indiana (B-1) and USS Olympia (Cruiser No. 6) could also be referred to as USS Olympia (C-6), while USS Pennsylvania (Armored Cruiser No. 4) could be referred to as USS Pennsylvania (ACR-4). However, rather than replacing it, these codes coexisted and were used interchangeably with the older system until the modern system was instituted on 17 July 1920.\n\nDuring World War I, the U.S. Navy acquired large numbers of privately owned and commercial ships and craft for use as patrol vessels, mine warfare vessels,  and various types of naval auxiliary ships, some of them with identical names. To keep track of them all, the Navy assigned unique identifying numbers to them. Those deemed appropriate for patrol work received section patrol numbers (SP), while those intended for other purposes received \"identification numbers\", generally abbreviated \"Id. No.\" or \"ID;\" some ships and craft changed from an SP to an ID number or vice versa during their careers, without their unique numbers themselves changing, and some ships and craft assigned numbers in anticipation of naval service never were acquired by the Navy. The SP/ID numbering sequence was unified and continuous, with no SP number repeated in the ID series or vice versa so that there could not be, for example, both an \"SP-435\" and an \"Id. No 435\". The SP and ID numbers were used parenthetically after each boat's or ship's name to identify it; although this system pre-dated the modern hull classification system and its numbers were not referred to at the time as \"hull codes\" or \"hull numbers,\" it was used in a similar manner to today's system and can be considered its precursor.Naval History and heritage Command Online Library of Selected Images (at http://www.history.navy.mil/photos/shusn-no/spid-no.htm).\n\nUnited States Revenue Cutter Service and United States Coast Guard \n\nThe United States Revenue Cutter Service, which merged with the United States Lifesaving Service in January 1915 to form the modern United States Coast Guard, began following the Navy's lead in the 1890s, with its cutters having parenthetical numbers called Naval Registry Identification Numbers following their names, such as (Cutter No. 1), etc.  This persisted until the Navy's modern hull classification system's introduction in 1920, which included Coast Guard ships and craft.\n\nUnited States Coast and Geodetic Survey \n\nLike the U.S. Navy, the United States Coast and Geodetic Survey – a uniformed seagoing service of the United States Government and a predecessor of the National Oceanic and Atmospheric Administration (NOAA) – adopted a hull number system for its fleet in the 20th century. Its largest vessels, \"Category I\" oceanographic survey ships, were classified as \"ocean survey ships\" and given the designation \"OSS\". Intermediate-sized \"Category II\" oceanographic survey ships received the designation \"MSS\" for \"medium survey ship,\" and smaller \"Category III\" oceanographic survey ships were given the classification \"CSS\" for \"coastal survey ship.\" A fourth designation, \"ASV\" for \"auxiliary survey vessel,\" included even smaller vessels. In each case, a particular ship received a unique designation based on its classification and a unique hull number separated by a space rather than a hyphen; for example, the third Coast and Geodetic Survey ship named Pioneer was an ocean survey ship officially known as USC&GS Pioneer (OSS 31).[https://books.google.com/books?iduYSPAAAAMAAJ&pg\nPA3612&lpgPA3612&dq\nOcean+Survey+Ship+(OSS)+MSS+CSS&sourcebl&ots\nq0Iq2sEN7a&sigHN4i6XsnjYb3s8LOLXrPMbSaIUg&hl\nen&saX&ei\n3nBpU8XXFdHboASC64DoAg&ved0CCgQ6AEwAA#v\nonepage&qOcean%20Survey%20Ship%20(OSS)%20MSS%20CSS&f\nfalse United States Department of State, United States Treaties and Other International Obligations, Volume 23, Part Four, Washington, D.C.:U.S. Government Printing Office, 1972, p. 3612.][http://docs.lib.noaa.gov/rescue/cgs/011_pdf/CSC-0205.pdf United States Department of Commerce, Annual Report of the Director of the Coast and Geodetic Survey for the Fiscal Year Ending June 30, 1964, U.S. Government Printing Office, Washington, D.C.: 1964, pp. 3, 4, 5.] The Coast and Geodetic Surveys system persisted after the creation of NOAA in 1970, when NOAA took control of the Surveys fleet, but NOAA later changed to its modern hull classification system.\n\nThe modern hull classification system \n\nUnited States Navy \n\nThe U.S. Navy instituted its modern hull classification system on 17 July 1920, doing away with section patrol numbers, \"identification numbers\", and the other numbering systems described above.  In the new system, all hull classification symbols are at least two letters; for basic types the symbol is the first letter of the type name, doubled, except for aircraft carriers.\n\nThe combination of symbol and hull number identifies a modern Navy ship uniquely. A heavily modified or re-purposed ship may receive a new symbol, and either retain the hull number or receive a new one. For example, the heavy gun cruiser  was converted to a gun/missile cruiser, changing the hull number to CAG-1. Also, the system of symbols has changed a number of times both since it was introduced in 1907 and since the modern system was instituted in 1920, so ships' symbols sometimes change without anything being done to the physical ship.Derdall and DiGiulian, (section: Nomenclature history)\n\nHull numbers are assigned by classification. Duplication between, but not within, classifications is permitted. Hence, CV-1 was the aircraft carrier  and BB-1 was the battleship .\n\nShip types and classifications have come and gone over the years, and many of the symbols listed below are not presently in use. The Naval Vessel Register maintains an online database of U.S. Navy ships showing which symbols are presently in use.\n\nAfter World War II until 1975, the U.S. Navy defined a \"frigate\" as a type of surface warship larger than a destroyer and smaller than a cruiser.  In other navies, such a ship generally was referred to as a \"flotilla leader\", or \"destroyer leader\".  Hence the U.S. Navy's use of \"DL\" for \"frigate\" prior to 1975, while \"frigates\" in other navies were smaller than destroyers and more like what the U.S. Navy termed a \"destroyer escort\", \"ocean escort\", or \"DE\".  The United States Navy 1975 ship reclassification of cruisers, frigates, and ocean escorts brought U.S. Navy classifications into line with other nations' classifications, at least cosmetically in terms of terminology, and eliminated the perceived \"cruiser gap\" with the Soviet Navy by redesignating the former \"frigates\" as \"cruisers\".\n\nMilitary Sealift Command \n\nIf a U.S. Navy ship's hull classification symbol begins with \"T-\", it is part of the Military Sealift Command, has a primarily civilian crew, and is a United States Naval Ship (USNS) in non-commissioned service – as opposed to a commissioned United States Ship (USS) with an all-military crew.\n\nUnited States Coast Guard \n\nIf a ship's hull classification symbol begins with \"W\", it is a ship of the United States Coast Guard.  Until 1965, the Coast Guard used U.S. Navy hull classification codes, prepending a \"W\" to their beginning.  In 1965, it retired some of the less mission-appropriate Navy-based classifications and developed new ones of its own, most notably WHEC for \"high endurance cutter\" and WMEC for \"medium endurance cutter\".\n\nNational Oceanic and Atmospheric Administration \n\nThe National Oceanic and Atmospheric Administration (NOAA), a component of the United States Department of Commerce, includes the National Oceanic and Atmospheric Administration Commissioned Officer Corps (or \"NOAA Corps\"), one of the seven uniformed services of the United States, and operates a fleet of seagoing research and survey ships. The NOAA fleet also uses a hull classification symbol system, which it also calls \"hull numbers,\" for its ships.\n\nAfter NOAA took over the former Coast and Geodetic Survey fleet in 1970 along with research vessels of other government agencies, it adopted a new system of ship classification. In its system, the NOAA fleet is divided into two broad categories, research ships and survey ships.  The research ships, which include oceanographic and fisheries research vessels, are given hull numbers beginning with \"R\", while the survey ships, generally hydrographic survey vessels, receive hull numbers beginning with \"S\". The letter is followed by a three-digit number; the first digit indicates the NOAA \"class\" (i.e., size) of the vessel, which NOAA assigns based on the ship's gross tonnage and horsepower, while the next two digits combine with the first digit to create a unique three-digit identifying number for the ship.\n\nGenerally, each NOAA hull number is written with a space between the letter and the three-digit number, as in, for example,  or .Wertheim, The Naval Institute Guide to Combat Fleets of the World, 15th Edition: Their Ships, Aircraft, and Systems, p. 1005.\n\nUnlike the Navy, once an older NOAA ship leaves service, a newer one can be given the same hull number; for example, \"S 222\" was assigned to , then assigned to NOAAS Thomas Jefferson (S 222), which entered NOAA service after Mount Mitchell was stricken.\n\nUnited States Navy hull classification codes \n\nThe U.S. Navy's system of alpha-numeric ship designators, and its associated hull numbers, have been for several decades a unique method of categorizing ships of all types: combatants, auxiliaries and district craft. Though considerably changed in detail and expanded over the years, this system remains essentially the same as when formally implemented in 1920. It is a very useful tool for organizing and keeping track of naval vessels, and also provides the basis for the identification numbers painted on the bows (and frequently the sterns) of most U.S. Navy ships.\n\nThe ship designator and hull number system's roots extend back to the late 1880s, when ship type serial numbers were assigned to most of the new-construction warships of the emerging \"Steel Navy\". During the course of the next thirty years, these same numbers were combined with filing codes used by the Navy's clerks to create an informal version of the system that was put in place in 1920. Limited usage of ship numbers goes back even earlier, most notably to the \"Jeffersonian Gunboats\" of the early 1800s and the \"Tinclad\" river gunboats of the Civil War Mississippi Squadron.\n\nIt is important to understand that hull number letter prefixes are not acronyms, and should not be carelessly treated as abbreviations of ship type classifications. Thus, \"DD\" does not stand for anything more than \"Destroyer\". \"SS\" simply means \"Submarine\". And \"FF\" is the post-1975 type code for \"Frigate.\"\n\nThe hull classification codes for ships in active duty in the United States Navy are governed under Secretary of the Navy Instruction 5030.8B [http://www.nvr.navy.mil/5030.8B.pdf (SECNAVINST 5030.8B).]\n\nWarships \n\nWarships are designed to participate in combat operations.\n\nThe origin of the 2 letter code derives from the need to distinguish various cruiser subtypes.Derdall and DiGiulian, (section: Cruisers)\n\nAircraft carrier type \n\nAircraft carriers are ships designed primarily for the purpose of conducting combat operations by aircraft which engage in attacks against airborne, surface, sub-surface and shore targets.  Contrary to popular belief, the \"CV\" hull classification symbol does not stand for \"carrier vessel\". \"CV\" derives from the cruiser designation, with the v for French voler, \"to fly\". Aircraft carriers are designated in two sequences: the first sequence runs from CV-1 USS Langley to the very latest ships, and the second sequence, \"CVE\" for escort carriers, ran from CVE-1 Long Island to CVE-127 Okinawa before being discontinued.\n\n* AV: Seaplane Tender (retired)\n* AVG: Auxiliary Aircraft Ferry (Escort carrier) (1941–2)\n* AVD: Seaplane Tender Destroyer (retired)\n* AVP: Seaplane Tender, Small (retired)\n* AVT (i) Auxiliary Aircraft Transport (retired)\n* AVT (ii) Auxiliary Training Carrier (retired)\n* ACV: Auxiliary Aircraft Carrier (Escort carrier) (1942)\n* CV: Fleet aircraft carrier (1921–1975), multi-purpose aircraft carrier (1975–present)\n* CVA: Aircraft Carrier, Attack (category merged into CV, 30 June 1975)\n* CV(N): Aircraft Carrier, Night (Deck equipped with lighting and pilots trained and for nighttime fights) (1944) (retired)\n* CVAN: Aircraft Carrier, Attack, Nuclear-powered (category merged into CVN, 30 June 1975)\n* CVB: Aircraft Carrier, Large (Original USS Midway class, category merged into CVA, 1952)\n* CVE: Escort aircraft carrier (retired) (1943–retirement of type)\n* CVHA: Aircraft Carrier, Helicopter Assault (retired in favor of several LH-series amphibious assault ship hull codes)\n* CVHE: Aircraft Carrier, Helicopter, Escort (retired)\n* CVL: Light aircraft carrier or Aircraft Carrier, Small (retired) [https://www.history.navy.mil/content/dam/nhhc/research/histories/naval-aviation/Naval%20Aviation%20News/1940/pdf/1aug43.pdf Bureau of Aeronautics, Navy Department.\"New Carrier Designations\". BuAER News (title later changed to Naval Aviation News). Washington, D.C. No. 198 (1 Aug 1943) page 9.][http://babel.hathitrust.org/cgi/pt?idmdp.39015031962056;view\n1up;seq=3 United States. Office of Naval History. Glossary of U. S. Naval Abbreviations. 3d ed. Washington: U. S. Govt. Print. Off., 1947. page 20.]United States. Office of Naval Records and History. Glossary of US Naval Abbreviations. 5th ed. Washington: U. S. Govt. Print. Off., 1949. [http://www.history.navy.mil/research/library/online-reading-room/title-list-alphabetically/u/us-navy-abbreviations-of-ww2.html Naval History and Heritage Command]. accessed 6 May 2017.\n* CVN: Aircraft Carrier, Nuclear-powered\n* CVS: Antisubmarine Aircraft Carrier (retired)\n* CVT: Aircraft Carrier, Training (changed to AVT (Auxiliary))\n* CVU: Aircraft Carrier, Utility (retired)\n* CVG: Aircraft Carrier, Guided Missile (retired)\n* CVV:http://oai.dtic.mil/oai/oai?verbgetRecord&metadataPrefix\nhtml&identifier=AD0757047 Aircraft Carrier, Vari-Purpose, Medium (retired unused)\n\nSurface combatant type \n\nSurface combatants are ships which are designed primarily to engage enemy forces on the high seas.  The primary surface combatants are battleships, cruisers and destroyers.  Battleships are very heavily armed and armored; cruisers moderately so; destroyers and smaller warships, less so.  Before 1920, ships were called \" no. X\", with the type fully pronounced.  The types were commonly abbreviated in ship lists to \"B-X\", \"C-X\", \"D-X\" et cetera—for example, before 1920,  would have been called \"USS Minnesota, Battleship number 22\" orally and \"USS Minnesota, B-22\" in writing.  After 1920, the ship's name would have been both written and pronounced \"USS Minnesota (BB-22)\". In generally decreasing size, the types are:\n\n* ACR: Armored Cruiser (pre-1920)\n* AFSB: Afloat Forward Staging Base (also AFSB(I) for \"interim\", changed to ESB for Expeditionary Mobile Dock)\n* B: Battleship (pre-1920)\n* BB: Battleship\n* BBG: Battleship, Guided Missile or Arsenal Ship (theoretical only, never assigned)See .\n* BM: Monitor (1920–retirement)\n* C: Cruiser (pre-1920 Protected Cruisers and Peace Cruisers)\n* CA: (first series) Cruiser, Armored (retired, comprised all surviving pre-1920 Armored and Protected Cruisers)\n* CA: (second series) Heavy Cruiser, category later renamed Gun Cruiser (retired)\n* CAG: Cruiser, Guided Missile (retired)\n* CB:  Large cruiser (retired)\n* CBC: Large Command Cruiser (retired, never used operationally)See .\n* CC: Battlecruiser (retired, never used operationally)See .\n* CC: (second usage) Command Ship (retired)See .\n* CLC: Command Cruiser\n* CG: Cruiser, Guided Missile\n* CGN: Cruiser, Guided Missile, Nuclear-powered\n* CL: Light Cruiser Cruiser Light (retired)\n* CLAA: Cruiser, Light, Anti-aircraft (retired)\n* CLG: Cruiser, Light, Guided Missile (retired)\n* CLGN: Cruiser, Light, Guided Missile, Nuclear-powered (retired)\n* CLK: Cruiser, Hunter-Killer (abolished 1951)see .\n* CM: Cruiser-minelayer (retired)\n* CS: Scout Cruiser (retired)\n* CSGN: Strike Cruiser Cruiser, Strike, Guided Missile, Nuclear-powered\n* D: Destroyer (pre-1920)\n* DD: Destroyer\n* DDC: Corvette (briefly proposed in the mid-1950s)\n* DDE: Escort Destroyer, a Destroyer (DD) converted for antisubmarine warfare - category abolished 1962. (not to be confused with Destroyer Escort DE)\n* DDG: Destroyer, Guided Missile\n* DDK: Hunter-Killer Destroyer (category merged into DDE, 4 March 1950)\n* DDR: Destroyer, Radar Picket (retired)\n\n* DM: Destroyer, Minelayer (retired)\n* DMS: Destroyer, Minesweeper (retired)\n\n* PG: Patrol Gunboat (retired)\n* PCH: Patrol Craft. Hydrofoil (retired)\n* PHM: Patrol, Hydrofoil, Missile (retired)\n* K: Corvette (retired)\n\n* M: Monitor (1880s–1920)\n* TB: Torpedo boat\n\nSubmarine type \n\nSubmarines are all self-propelled submersible types (usually started with SS) regardless of whether employed as combatant, auxiliary, or research and development vehicles which have at least a residual combat capability. While some classes, including all diesel-electric submarines, are retired from USN service, non-U.S. navies continue to employ SS, SSA, SSAN, SSB, SSC, SSG, SSM, and SST types.Russia still employs several SSA and SSAN class submarines like the Delta Stretch as well as one SST, China has older SSB and SSG types such as the Golf and Mod Romeo classes, and North Korea has built many SSCs and SSMs. See 2007–2008 Janes Fighting Ships. With the advent of new Air Independent Propulsion/Power (AIP) systems, both SSI and SSP are used to distinguish the types within the USN, but SSP has been declared the preferred term. SSK, retired by the USN, continues to be used colloquially and interchangeably with SS for diesel-electric attack/patrol submarines within the USN, and more formally by the Royal Navy and British firms such as Jane's Information Group.\n\n* SC: Cruiser Submarine (retired)\n* SF: Fleet Submarine (retired)\n* SM: Submarine Minelayer (retired)\n* SS: Submarine, Attack Submarine[http://www.nvr.navy.mil/CLASS.HTM U.S. Navy Ship And Service Craft Classifications] \n* SSA: Submarine Auxiliary, Auxiliary/Cargo Submarine\n* SSAN: Submarine Auxiliary Nuclear, Auxiliary/Cargo Submarine, Nuclear-powered\n* SSB: Submarine Ballistic, Ballistic Missile Submarine\n* SSBN: Submarine Ballistic Nuclear, Ballistic Missile Submarine, Nuclear-powered\n* SSC: Coastal Submarine, over 150 tons\n* SSG: Guided Missile Submarine\n* SSGN: Guided Missile Submarine, Nuclear-powered\n* SSI: Attack Submarine (Diesel Air-Independent Propulsion)\n* SSK: Hunter-Killer/ASW Submarine (retired)[http://www.nvr.navy.mil/oldclass.htm Inactive Classification Symbols] \n* SSM: Midget Submarine, under 150 tons\n* SSN: Attack Submarine, Nuclear-powered\n* SSNR: Special Attack Submarine This odd entry is not recognised by the U.S. Naval Vessel Register, and appears only in MIL-STD-2525A: Common Warfighting Symbology (15 December 1996) and later editions (MIL-STD-2525B: Common Warfighting Symbology (30 January 1999) and MIL-STD-2525C: Common Warfighting Symbology (17 November 2008)). It seems to refer to some kind of nuclear-powered submarine used by Special Operations Forces.\n* SSO: Submarine Oiler (retired)\n* SSP: Attack Submarine (Diesel Air-Independent Power) (alternate use), formerly Submarine Transport\n* SSQ: Auxiliary Submarine, Communications (retired)\n* SSQN: Auxiliary Submarine, Communications, Nuclear-powered (retired)[http://www.dia.mil/publicaffairs/Foia/abbrev_acron.pdf 28034_cov.fh] \n* SSR: Radar Picket Submarine (retired)\n* SSRN: Radar Picket Submarine, Nuclear-powered (retired)\n* SST: Training Submarine\n\n* IXSS: Unclassified Miscellaneous Submarine\n* MTS:  Moored Training Ship (Naval Nuclear Power School Training Platform; Reconditioned SSBN's)\n\nPatrol combatant type \n\nPatrol combatants are ships whose mission may extend beyond coastal duties and whose characteristics include adequate endurance and sea keeping, providing a capability for operations exceeding 48 hours on the high seas without support. This notably included Brown Water Navy/Riverine Forces during the Vietnam War. Few of these ships are in service today.\n\n* PBR: Patrol Boat, River, Brown Water Navy (Pibber or PBR-Vietnam)\n* PC: Coastal Patrol, originally Sub Chaser\n* PCF: Patrol Craft, Fast; Swift Boat, Brown Water Navy (Vietnam)\n* PE: Eagle Boat of World War I\n* PF: World War II Frigate, based on British .\n** PFG: Original designation of \n* PG: Gunboat, later Patrol combatant\n* PGH: Patrol Combatant, Hydrofoil\n* PHM: Patrol, Hydrofoil Missile\n* PR: Patrol, River, such as the \n* PT: Motor Torpedo Boat (World War II)\n* PTF: Patrol Torpedo Fast, Brown Water Navy (Vietnam)\n* PTG: Patrol Torpedo Gunboat\n* Monitor: Heavily gunned riverine boat, Brown Water Navy (Vietnam)\n* ASPB: Assault Support Patrol Boat, \"Alpha Boat\", Brown Water Navy; also used as riverine minesweeper (Vietnam)\n* PACV: Patrol, Air Cushion Craft, Brown Water Navy (Vietnam)\n* SP: Section Patrol, used indiscriminately for patrol vessels, mine warfare vessels, and some other types (World War I; retired 1920)\n\nAmphibious warfare type \n\nAmphibious warfare vessels include all ships having organic capability for amphibious warfare and which have characteristics enabling long duration operations on the high seas.  There are two classifications of craft: amphibious warfare ships which are built to cross oceans, and landing craft, which are designed to take troops from ship to shore in an invasion.\n\nShips\n* AKA: Attack Cargo Ship (To LKA, 1969)\n* APA: Attack Transport (To LPA, 1969)\n* APD: High speed transport  (Converted Destroyer or Destroyer Escort) (To LPR, 1969)\n* AGC: Amphibious Force Flagship (To LCC, 1969)\n* LCC: Amphibious Command Ship\n* LHA: General-Purpose Amphibious Assault Ship also known as Landing Helicopter Assault\n* LHD: Multi-Purpose Amphibious Assault Ship also known as Landing Helicopter Dock\n* LKA: Amphibious Cargo Ship (out of commission)\n* LPA: Amphibious Transport\n* LPD: Amphibious transport dock\n* LPH: Landing Platform Helicopter\n* LPR: High speed transport\n* LSD: Landing Ship, Dock\n* LSH: Landing Ship, Heavy\n* LSIL: Landing Ship, Infantry (Large) (formerly LCIL)\n* LSL: Landing Ship, Logistics\n* LSM: Landing Ship, Medium\n* LSM(R): Landing Ship, Medium (Rocket)\n* LSSL: Landing Ship, Support (Large) (formerly LCSL)\n* LST: Landing Ship, Tank\n* LST(H): Landing Ship, Tank (Hospital)\n* LSV: Landing Ship, Vehicle\n\nLanding Craft\n* LCA: Landing Craft, Assault\n* LCAC: Landing Craft Air Cushion\n* LCFF: (Flotilla Flagship)\n* LCH: Landing Craft, Heavy\n* LCI: Landing Craft, Infantry, World War II era classification further modified by\n**(G) – Gunboat\n**(L)- Large\n**(M)- Mortar\n**(R) – Rocket\n* LCL: Landing Craft, Logistics (UK)\n* LCM: Landing Craft, Mechanized\n* LCP: Landing Craft, Personnel\n* LCP(L): Landing Craft, Personnel, Large\n* LCP(R): Landing Craft, Personnel, Ramped\n* LCPA: Landing Craft, Personnel, Air-Cushioned\n* LCS(L): Landing Craft, Support (Large) changed to LSSL in 1949\n* LCT: Landing Craft, Tank (World War II era)\n* LCU: Landing Craft, Utility\n* LCVP: Landing Craft, Vehicle and Personnel\n* LSH: Landing Ship Heavy (Royal Australian Navy)\n\nExpeditionary Support\n\nOperated by Military Sealift Command, have ship prefix \"USNS\", hull code begins with \"T-\".\n* ESD: Expeditionary Transfer Dock\n* ESB: Expeditionary Mobile Base (a variant of ESD, formerly AFSB)\n* EPF: Expeditionary Fast Transport\n* MLP: Mobile Landing Platform (changed to ESD) \n* JHSV: Joint High Speed Vessel (changed to EPF)\n* HST: High Speed Transport (similar to JHSV, not to be confused with WWII-era High speed transport (APD))\n* HSV: High Speed Vessel\n\nCombat Logistics Type \n\nShips which have the capability to provide underway replenishment to fleet units.\n\n* AC: Collier (retired)\n* AE: Ammunition Ship\n* AF: Stores Ship (retired)\n* AFS: Combat Stores Ship\n* AKE: Advanced Dry Cargo Ship\n* AKS: General Stores Ship\n* AO: Fleet Oiler\n* AOE: Fast Combat Support Ship\n* AOR: Replenishment Oiler\n* AW: Distilling Ship (retired)\n\nMine warfare type \n\nMine warfare ships are those ships whose primary function is mine warfare on the high seas.\n\n* ADG: Degaussing Ship\n* AM: Minesweeper\n* AMb: Harbor Minesweeper\n* AMc: Coastal Minesweeper\n* AMCU: Underwater Mine Locater\n* AMS: Motor Minesweeper\n* CM: Cruiser (i.e., Large) Minelayer\n* CMc: Coastal Minelayer\n* DM: High Speed Minelayer (Converted Destroyer)\n* DMS: High Speed Minesweeper (Converted Destroyer)\n* MCM: Mine Countermeasures Ship\n* MCS: Mine Countermeasures Support Ship\n* MH(C)(I)(O)(S): Minehunter, (Coastal) (Inshore) (Ocean) (Hunter and Sweeper, General)\n* MLC: Coastal Minelayer\n* MSC: Minesweeper, Coastal\n* MSO: Minesweeper, Ocean\n* PCS: Submarine Chasers (wooden) fitted for minesweeping\n* YDG: District Degaussing Vessel\n\nCoastal defense type \n\nCoastal defense ships are those whose primary function is coastal patrol and interdiction.\n\n* FS: Corvette\n* PB: Patrol boat\n* PBR:  Patrol Boat, River\n* PC: Patrol, Coastal\n* PCE: Patrol Craft, Escort\n* PCF: Patrol Craft, Fast, (Swift Boat)\n* PF: Frigate, in a role similar to World War II Commonwealth corvette\n* PG: Patrol Gunboat\n* PGM: Motor Gunboat (To PG, 1967)\n* PR: Patrol, River\n* SP: Section Patrol\n\nMobile logistics type \n\nMobile logistics ships have the capability to provide direct material support to other deployed units operating far from home ports.\n\n* AD: Destroyer Tender\n* AGP: Patrol Craft Tender\n* AR: repair ship\n* AS: Submarine tender\n* AV: Seaplane Tender\n\nAuxiliary type \n\nAn auxiliary ship is designed to operate in any number of roles supporting combatant ships and other naval operations.\n* AN: Net Laying Ship\n* ARL: Auxiliary Repair Light—light craft or landing craft repair ship (World War II-era, out of commission)\n* ATF: Fleet Ocean Tug\n* AGHS: Patrol Combatant Support Ship—Ocean or Inshore\n\nAirships \n\nAlthough technically an aircraft, pre-World War II rigid airships (e.g., zeppelins) were treated like commissioned surface warships and submarines, flew the U.S. ensign from their stern and carried a United States Ship (USS) designation.  Non-rigid airships (e.g., blimps) continued to fly the U.S. ensign from their stern, but were always considered to be primarily aircraft.\n* ZMC: Airship Metal Clad\n* ZNN-G: G-Class Blimp\n* ZNN-J: J-Class Blimp\n* ZNN-L: L-Class Blimp\n* ZNP-K: K-Class Blimp\n* ZNP-M: M-Class Blimp\n* ZNP-N: N-Class Blimp\n* ZPG-3W: surveillance patrol blimp\n* ZR: Rigid Airship\n* ZRS: Rigid Airship Scout\n\nSupport ships \n\nSupport ships are not designed to participate in combat, and are generally not armed.  For ships with civilian crews (owned by and/or operated for Military Sealift Command and the Maritime Administration), the prefix T- is placed at the front of the hull classification.\n\nSupport type \n\nSupport ships are designed to operate in the open ocean in a variety of sea states to provide general support to either combatant forces or shore based establishments. They include smaller auxiliaries which, by the nature of their duties, leave inshore waters.\n\n* AC: Collier (retired)\n* ACS: Auxiliary Crane Ship\n* AG: Miscellaneous Auxiliary\n* AGDE: Testing Ocean Escort\n* AGDS: Deep Submergence Support Ship\n* AGER (i): Miscellaneous Auxiliary, Electronic Reconnaissance\n* AGER (ii): Environmental Research Ship\n* AGF: Miscellaneous Command Ship\n* AGFF: Testing Frigate\n* AGL: Auxiliary vessel, lighthouse tender\n* AGM: Missile Range Instrumentation Ship\n* AGOR: Oceanographic Research Ship\n* AGOS: Ocean Surveillance Ship\n* AGP: Motor Torpedo Boat Tender\n* AGS: Surveying Ship\n* AGSE: Submarine and Special Warfare Support \n* AGSS: Auxiliary Research Submarine\n* AGTR: Technical research ship\n* AH: Hospital ship\n* AK: Cargo Ship\n* AKR: Vehicle Cargo Ship\n* AKS: Store Issue Ship\n* AO: Oiler\n* AOE: Fast Combat Support Ship\n* AOR: Replenishment oiler (retired)\n* AOG: Gasoline Tanker\n* AOT: Transport Oiler\n* AP: Transport\n* ARC: Cable Repair Ship (see also Cable layer)\n* ARG: Internal Combustion Engine repair ship \n* APB: Self-propelled Barracks Ship\n* APL: Barracks Craft\n* ARB: Battle Damage Repair Ship\n* ARL: Small Repair Ship\n* ARS: Salvage Ship\n* AS: Submarine tender\n* ASR: Submarine Rescue Ship\n* AT: Ocean-Going Tug\n* ATA: Auxiliary Ocean Tug\n* ATF: Fleet Ocean Tug\n* ATLS Drone Launch Ship\n* ATS: Salvage and Rescue Ship\n* AVB(i): Aviation Logistics Support Ship\n* AVB(ii):Advance Aviation Base Ship\n* AVS: Aviation Stores Issue Ship\n* AVT(i): Auxiliary Aircraft Transport\n* AVT(ii): Auxiliary Aircraft Landing Training Ship\n* EPCER: Experimental - Patrol Craft Escort - Rescue\n* ID or Id. No.: Civilian ship taken into service for auxiliary duties, used indiscriminately for large ocean-going ships of all kinds and coastal and yard craft (World War I; retired 1920)\n* PCER: Patrol Craft Escort - Rescue \n\n* SBX: Sea-based X-band Radar - a mobile active electronically scanned array early-warning radar station.\n\nService type craft \n\nService craft are navy-subordinated craft (including non-self-propelled) designed to provide general support to either combatant forces or shore-based establishments.  The suffix \"N\" refers to non-self-propelled variants.\n\n* AB: Crane Ship\n* AFDB: Large Auxiliary Floating Dry Dock\n* AFD/AFDL: Small Auxiliary Floating Dry Dock\n* AFDM: Medium Auxiliary Floating Dry Dock\n* APB: Self-Propelled Barracks Ship\n* APL: Barracks Craft\n* ARD: Auxiliary Repair Dry Dock\n* ARDM: Medium Auxiliary Repair Dry Dock  \n* ATA: Auxiliary Ocean Tug\n* DSRV: Deep Submergence Rescue Vehicle\n* DSV: Deep Submergence Vehicle\n* JUB/JB : Jack Up Barge\n* NR: Submersible Research Vehicle\n* YC: Open Lighter\n* YCF: Car Float\n* YCV: Aircraft Transportation Lighter\n* YD: Floating Crane\n* YDT: Diving Tender\n* YF: Covered Lighter\n* YFB: Ferry Boat or Launch\n* YFD: Yard Floating Dry Dock\n* YFN: Covered Lighter (non-self propelled)\n* YFNB: Large Covered Lighter (non-self propelled)\n* YFND: Dry Dock Companion Craft (non-self propelled)\n* YFNX: Lighter (Special purpose) (non-self propelled)\n* YFP: Floating Power Barge\n* YFR: Refrigerated Cover Lighter\n* YFRN: Refrigerated Covered Lighter (non-self propelled)\n* YFRT: Range Tender\n* YFU: Harbor Utility Craft\n* YG: Garbage Lighter\n* YGN: Garbage Lighter (non-self propelled)\n* YH: Ambulance boat/small medical support vessel\n* YLC: Salvage Lift Craft\n* YM: Dredge\n* YMN: Dredge (non-self propelled)\n* YNG: Gate Craft\n* YNT: Net Tender\n* YO: Fuel Oil Barge\n* YOG: Gasoline Barge\n* YOGN: Gasoline Barge (non-self propelled)\n* YON: Fuel Oil Barge (non-self propelled)\n* YOS: Oil Storage Barge\n* YP:  Patrol Craft, Training\n* YPD: Floating Pile Driver\n* YR: Floating Workshop\n* YRB: Repair and Berthing Barge\n* YRBM: Repair, Berthing and Messing Barge\n* YRDH: Floating Dry Dock Workshop (Hull)\n* YRDM: Floating Dry Dock Workshop (Machine)\n* YRR: Radiological Repair Barge\n* YRST: Salvage Craft Tender\n* YSD: Seaplane Wrecking Derrick\n* YSR: Sludge Removal Barge\n* YT: Harbor Tug (craft later assigned YTB, YTL, or YTM classifications)\n* YTB: Large Harbor Tug\n* YTL: Small Harbor Tug\n* YTM: Medium Harbor Tug\n* YTT: Torpedo Trials Craft\n* YW: Water Barge\n* YWN: Water Barge (non-self propelled)\n* ID or Id. No.: Civilian ship taken into service for auxiliary duties, used indiscriminately for large ocean-going ships of all kinds and coastal and yard craft  (World War I; retired 1920)\n* IX: Unclassified Miscellaneous Unit\n* X: Submersible Craft\n* \"none\": To honor her unique historical status, USS Constitution, formerly IX 21, was reclassified to \"none\", effective 1 September 1975.\n\nUnited States Coast Guard craft \n\nPrior to 1965, U.S. Coast Guard ships used the same designation as naval ships, but preceded by a \"W\" to indicate Coast Guard subordination.\n\n* CG: all Coast Guard Ships in the 1920s (retired)\n* WAGB: Coast Guard \n* WAGL: Auxiliary vessel, lighthouse tender (retired 1960's)\n* WAVP: seagoing Coast Guard seaplane tenders (retired 1960s)\n* WDE: seagoing Coast Guard destroyer escorts (retired 1960s)\n* WHEC: Coast Guard High Endurance Cutters\n* WIX: Coast Guard Barque Eagle\n* WLB: Coast Guard buoy tenders\n* WLBB: Coast Guard seagoing buoy tenders/ice breaker\n* WLM: Coast Guard coastal buoy tenders\n* WLI: Coast Guard inland buoy tenders\n* WLIC: Coast Guard inland construction tenders\n* WLR: Coast Guard river buoy tenders\n* WMEC: Coast Guard Medium Endurance Cutters\n* WMSL: Coast Guard Maritime Security Cutter, Large (referred to as National Security Cutters)\n* WPC: Coast Guard patrol craft—later reclassed under WHEC\n* WPB: Coast Guard Patrol Boats\n* WPG: seagoing Coast Guard gunboats (retired 1960s)\n* WTGB: Coast Guard Tug Boat (140' icebreakers)\n* WYTL: Small harbor Tug\n\nTemporary designations\n\nUnited States Navy Designations (Temporary) are a form of U.S. Navy ship designation, intended for temporary identification use. Such designations usually occur during periods of sudden mobilization, such as that which occurred prior to, and during, World War II or the Korean War, when it was determined that a sudden temporary need arose for a ship for which there was no official Navy designation.\n\nDuring World War II, for example, a number of commercial vessels were requisitioned, or acquired, by the U.S. Navy to meet the sudden requirements of war. A yacht acquired by the U.S. Navy during the start of World War II might seem desirable to the Navy whose use for the vessel might not be fully developed or explored at the time of acquisition.\n\nOn the other hand, a U.S. Navy vessel, such as the yacht in the example above, already in commission or service, might be desired, or found useful, for another need or purpose for which there is no official designation.\n\n* IX: Unclassified Miscellaneous Auxiliary Ship, for example yacht Chanco acquired by the U.S. Navy on 1 October 1940. It was classified as a minesweeper , but instead, mainly used as a patrol craft along the New England coast. When another assignment came, and it could not be determined how to classify the vessel, it was redesignated IX-175 on 10 July 1944.\n* IXSS: Unclassified Miscellaneous Submarines, such as the , the  and the .\n* YAG: Miscellaneous Auxiliary Service Craft, such as the ,  and  which, curiously, was earlier known as .\n\nNumerous other U.S. Navy vessels were launched with a temporary, or nominal, designation, such as YMS or PC, since it could not be determined, at time of construction, what they should be used for. Many of these were vessels in the 150 to 200 feet length class with powerful engines, whose function could be that of a minesweeper, patrol craft, submarine chaser, seaplane tender, tugboat, or other. Once their destiny, or capability, was found or determined, such vessels were reclassified with their actual designation.\n\nNational Oceanic and Atmospheric Administration hull codes \n\n* R: Research ships, including oceanographic and fisheries research ships\n* S: Survey ships, including hydrographic survey ships\n\nThe letter is paired with a three-digit number. The first digit of the number is determined by the ships \"power tonnage,\" defined as the sum of its shaft horsepower and gross international tonnage, as follows:\n\n* If the power tonnage is 5,501 through 9,000, the first digit is \"1\".\n* If the power tonnage 3,501 through 5,500, the first digit is \"2.\"\n* If the power tonnage is 2,001 through 3,500, the first digit is \"3.\"\n* If the power tonnage is 1,001 through 2,000, the first digit is \"4.\"\n* If the power tonnage is 501 through 1,000, the first digit is \"5.\"\n* If the power tonnage is 500 or less and the ship is at least 65 feet (19.8 meters) long, the first digit is \"6.\"[http://www.corporateservices.noaa.gov/ames/administrative_orders/chapter_217/217-108.html noaa.gov NOAA Office of the Administratuve Officer \"NAO 217-108: Classification of NOAA Vessels\" issued 1 October 2013]\n\nThe second and third digits are assigned to create a unique three-digit hull number. Hull classification symbol. http://en.wikipedia.org/?curid=14090."
  }
}
