{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12343",
  "eid" : "01e96750-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778512453,
  "textBody" : "Guadeloupe (;; Antillean Creole: Gwadloup) is an insular region of France located in the Leeward Islands, part of the Lesser Antilles in the Caribbean. Administratively, it is an overseas region consisting of a single overseas department. With a land area of  and an estimated population of 400,132 as of January 2015, it is the largest and most populous European Union territory in North America.\n\nGuadeloupe's two main islands are Basse-Terre to the west and Grande-Terre to the east, which are separated by a narrow strait that is crossed with bridges. They are often referred to as a single island. The department also includes the Dependencies of Guadeloupe, which include the smaller islands of Marie-Galante and La Désirade, and the Îles des Saintes.\n\nGuadeloupe, like the other overseas departments, is an integral part of France. As a constituent territory of the European Union and the Eurozone,   the euro, Guadeloupe is pictured on all Euro banknotes – on the reverse, at the bottom, to the right of the Greek ΕΥΡΩ (EURO), next to the denomination. is its official currency and any European Union citizen is free to settle and work there indefinitely.  As an overseas department, however, it is not part of the Schengen Area. The prefecture (regional capital) of Guadeloupe is the city of Basse-Terre, which lies on the island of the same name. The official language is French and  Antillean Creole is spoken virtually by the entire population except recent arrivals from metropolitan France.\n\nOrigin of the name \n\nChristopher Columbus named the island Santa María de Guadalupe in 1493 after the Virgin Mary, venerated in the Spanish town of Guadalupe, in Extremadura. Upon becoming a French colony, the Spanish name was retained though altered to French orthography and phonology.\n\nHistory \n\nThe island was called \"Karukera\" (or \"The Island of Beautiful Waters\") by the Arawak people, who settled on there in 300 AD/CE. During the 8th century, the Caribs inhabited the island.\n\nDuring his second trip to the Americas, in November 1493, Christopher Columbus landed on Guadeloupe, while seeking fresh water. He called it Santa María de Guadalupe de Extremadura, after the image of the Virgin Mary venerated at the Spanish monastery of Villuercas, in Guadalupe, Extremadura. The expedition set ashore just south of Capesterre, but left no settlers behind.\n\nColumbus is credited with discovering the pineapple on the island of Guadeloupe in 1493, although the fruit had long been grown in South America. He called it piña de Indias, which can be correctly translated as \"pine cone of the Indies.\"[http://lema.rae.es/drae/?valpi%C3%B1a Entry for \"piña\"] in the Dictionary of the Real Academia Española de la Lengua, definition #1.[http://www.wordreference.com/es/en/translation.asp?spen\npi%C3%B1a Entry for \"piña\"] in the bilingual Collins & WordReference Dictionaries[http://dictionary.reverso.net/spanish-english/pi%C3%B1a Entry for \"piña\"] on the bilingual Collins Reverso Dictionary, definition #1.\n\nDuring the 17th century, the Caribs fought against the Spanish settlers and repelled them.\n\nAfter successful settlement on the island of St. Christophe (St. Kitts), the French Company of the American Islands delegated Charles Lienard (Liénard de L'Olive) and Jean Duplessis Ossonville, Lord of Ossonville to colonize one or any of the region's islands, Guadeloupe, Martinique, or Dominica.\n\nDue to Martinique's inhospitable nature, the duo resolved to settle in Guadeloupe in 1635, took possession of the island, and wiped out many of the Carib Amerindians. It was annexed to the kingdom of France in 1674.\n\nOver the next century, the British seized the island several times. The economy benefited from the lucrative sugar trade, which commenced during the closing decades of the 17th century. Guadeloupe produced more sugar than all the British islands combined, worth about £6 million a year. The British captured Guadeloupe in 1759. The British government decided that Canada was strategically more important and kept Canada while returning Guadeloupe to France in the Treaty of Paris (1763) that ended the Seven Years War.\n\nIn 1790, following the outbreak of the French Revolution, the monarchists of Guadeloupe refused to obey the new laws of equal rights for the free people of color and attempted to declare independence. The ensuing conflict with the republicans, who were faithful to revolutionary France, caused a fire to break out in Pointe-à-Pitre that devastated a third of the town. The monarchists ultimately overcame the republicans and declared independence in 1791. The monarchists then refused to receive the new governor that Paris had appointed in 1792. In 1793, a slave rebellion broke out, which made the upper classes turn to the British and ask them to occupy the island.\n\nIn an effort to take advantage of the chaos ensuing from the French Revolution, Britain seized Guadeloupe in 1794, holding control from 21 April until December 1794, when republican governor Victor Hugues obliged the British general to surrender.pg 241 Hugues was able to use his expeditionary force of 1,500 men and an enthusiastic slave population to repel the British invasion of Guadeloupe after a seven-month struggle, which ended in December 1794. Hugues succeeded in freeing the slaves, who then turned on the slave owners who controlled the sugar plantations.\n\nIn 1802, Napoleon Bonaparte issued the Law of 20 May 1802. It restored slavery to all colonies the British had captured during the French Revolutionary Wars—but did not apply to certain French overseas possessions, such as Guadeloupe, Guyane, and Saint-Domingue. Napoleon sent an expeditionary force to recapture the island from the rebellious slaves. Louis Delgrès and a group of revolutionary soldiers killed themselves on the slopes of the Matouba volcano when it became obvious that the invading troops would take control of the island. The occupation force killed approximately 10,000 Guadeloupeans.\n\nOn 4 February 1810 the British once again seized the island and continued to occupy it until 1816. By the Anglo-Swedish alliance of 3 March 1813, Britain ceded it to Sweden for a brief period of 15 months. During this time, the British administration remained in place and British governors continued to govern the island.World Statesmen.org: [http://www.worldstatesmen.org/Guadeloupe.html Guadeloupe]\n\nIn the Treaty of Paris of 1814, Sweden ceded Guadeloupe once more to France. An ensuing settlement between Sweden and the British gave rise to the Guadeloupe Fund. The Treaty of Vienna in 1815 definitively acknowledged French control of Guadeloupe.\n\nAn earthquake in 1843 caused the La Soufrière volcano to erupt and killed over 5000 people.\n\nSlavery was finally abolished on the island (and in all French possessions) on 28 May 1848 at the initiative of Victor Schoelcher.\n\nGuadeloupe lost 12,000 of its 150,000 residents in the cholera epidemic of 1865–66.\n\nThe colonial history of Guadeloupe has been addressed in research publications.e.g. Faloppe, Josette. Esclaves et Citoyens. Les Noirs à la Guadeloupe dans les processus de résistance et d'intégration, 1802-1910 \". Basse-Terre, Guadeloupe, Société d'Histoire de la Guadeloupe (S.H.G.), 1992.\n\n20th century \n\nIn 1925, after the trial of Henry Sidambarom (Justice of the Peace and defender of the cause of Indian workers), Raymond Poincaré decided to grant French nationality and the right to vote to Indian citizens.* [http://www.guadeloupe.pref.gouv.fr/content/download/1064/6597/file/Henry_SIDAMBAROM_07_10_2011.pdf 7 octobre 2011 - Commemorating the 59th anniversary of the death of Henri Sidambarom (In French and PDF)] \n\nIn 1946, the colony of Guadeloupe became an overseas department of France. Then in 1974, it became an administrative center. Its deputies sit in the French National Assembly in Paris.\n\nIn 1967, rallies became riots, and repression backed by the prefect Pierre Bolotte caused dozens of deaths.\n\n21st century \n\nIn 2007 the island communes of Saint-Martin and Saint-Barthélemy were officially detached from Guadeloupe and became two separate French overseas collectivities with their own local administration.The French law was passed in February 2007, but did not take effect until the local assemblies voted in agreement on 15 July 2007. See J. P. Thiellay, Droit des outre-mers, Paris:Dalloz, 2007. Their combined population was 35,930 and their combined land area was  as of the 1999 census. \n\nIn January 2009, an umbrella group of approximately fifty labour union and other associations (known in the local Antillean Creole as the Liyannaj Kont Pwofitasyon (LKP), led by Élie Domota) called for a €200 ($260 USD) monthly pay increase for the island's low income workers. The protesters have proposed that authorities \"lower business taxes as a top up to company finances\" to pay for the €200 pay raises. Employers and business leaders in Guadeloupe have said that they cannot afford the salary increase. The strike lasted 44 days, ending with an accord reached on 5 March 2009. Tourism suffered greatly during this time and affected the 2010 tourist season as well.\n\nThe 2009 French Caribbean general strikes exposed deep ethnic, racial, and class tensions and disparities within Guadeloupe.\"[https://www.google.com/hostednews/afp/article/ALeqM5gk4fdgdkSoLI7uwcWr8DPvufQdAg?hl=en Race, class fuel social conflict on French Caribbean islands]\". Agence France-Presse (AFP). February 17, 2009\n\nGeography \n\nLocated as the southernmost of the Leeward Islands in the eastern Caribbean Sea, Guadeloupe comprises two main islands: Basse-Terre Island and Grande-Terre, which are separated by a narrow sea channel called Salt River. The adjacent French islands of La Désirade, Les Saintes, and Marie-Galante are under jurisdiction of Guadeloupe.\n\nWestern Basse-Terre has a rough volcanic relief while eastern Grande-Terre features rolling hills and flat plains. La Grande Soufrière is the highest mountain peak in the Lesser Antilles, with an elevation of .\n\nFurther to the north, Saint-Barthélemy and the northern French part of Saint Martin were previously under the jurisdiction of Guadeloupe but on 7 December 2003, both of these areas voted to become overseas territorial collectivities separate from Guadeloupe, a decision that took effect on 22 February 2007.\n\nVolcanoes \n\nThere is an active volcano in Guadeloupe called \"La Soufrière,\" located in the South of Basse-Terre. La Soufrière is actually a part of a volcanic complex that is composed of the Carmichael volcanoes, the Nez Cassé, the Echelle, the Cistern and the Madeleine. It is one of the nine active volcanoes of the Lesser Antilles. Its last eruption was in 1976. This eruption led to the evacuation of the southern part of Basse-Terre. 73,600 people were displaced over a course of three and a half months following the eruption.\n\nHurricanes \n\nThe island was devastated by several hurricanes in modern times:\n* On 12 September 1928, the Okeechobee hurricane caused extensive damage and killed thousands of people.\n* On 22 August 1964, Guadeloupe was ravaged by Hurricane Cleo, which killed 14 people.\n* On 27 September 1966, Category 3 Hurricane Inez caused extensive damage, mostly in Grande-Terre and north Basse-Terre Island, killing 33 people. Charles De Gaulle visited the islands after the hurricanes and declared them a disaster area.\n* On 17 September 1989, Category 4 Hurricane Hugo caused extensive damage, destroyed 10,000 homes leaving more than 35,000 homeless. It destroyed 100 percent of the banana crop, and 60 percent of the sugar cane crop.*Benito-Espinal, F. Pagney and E. Benito-Espinal – L'Ouragan Hugo: génèse, incidences géographiques et écologiques sur la guadeloupe [Hurricane Hugo: Origin, Geographic and Ecological Consequences on Guadeloupe]. \n* From late August to mid September 1995, the island was in the path of three successive cyclones: Tropical Storm Iris on 28 August caused minor damages; Hurricane Luis on 5 September caused moderate damage on the north coast of Grande-Terre; and Hurricane Marilyn on 15 September caused moderate damage in Basse-Terre.\n* On 21 September 1998, Hurricane Georges pounded the islands, causing moderate damage and destroying 90% of the banana crop.\n* On 5 September 2017, Hurricane Irma caused relatively minor damage while producing significant destruction on other islands, such as Saint Martin.https://www.local10.com/weather/hurricane-irma/hurricane-irma-knocks-out-electricity-damages-rooftops-in-Caribbean In fact, the island is a base for relief efforts on St. Martin (Collectivity of Saint Martin) and St. Barts (Saint Barthélemy); France's President Emmanuel Macron arrived at Pointe-a-Pitre airport on 12 September to begin his tour of those devastated islands and the distribution of relief supplies.\n* On 19 September 2017, Hurricane Maria battered Guadeloupe overnight as a category 4 or category 5 hurricane, causing flooding and intense winds, with the eye passing near Basse-Terre. Shortly after the hurricane hit, authorities reported at least one death and two reported missing after the sinking of their boat, serious flooding, and widespread damage to buildings in certain areas, with roofs blown off buildings and lack of power in 80,000 homes.\n\nClimate \n\nGuadeloupe has a tropical climate tempered by maritime influences and the Trade Winds. We distinguish two seasons in Guadeloupe and nearby islands:\n*a dry season called \"Lent\" that goes from January to June;\n*a wet season called \"winter\", which lasts from July to December.\n\nDemographics \n\nGuadeloupe recorded a population of 402,119 in the 2013 census.\n\nThe population of Guadeloupe is mainly of African or mixed descent of Europeans, Indians (Tamil, Telugu, and other South Indians), Lebanese, Syrians, Chinese, and Carib Amerindians (remnants of the original pre-European population). The archipelago of Îles des Saintes is mostly populated by the descendants of colonists from Brittany and Normandy. It is largely Roman Catholic, speaking French and a Creole (Antillean Creole).\"[http://articles.orlandosentinel.com/2010-11-22/travel/orl-travel-guadeloupe-spotlight_1_basse-terre-guadeloupe-la-desirade Cruise Port Spotlight: Basse-Terre, Pointe-a-Pitre and Iles Des Saintes, Guadeloupe]\". Orlando Sentinel. November 22, 2010\n\nThe population of Guadeloupe has been stable recently, with a net increase of only 335 people between the 2008 and 2013 censuses.\n\nIn 2012 the average population density in Guadeloupe was 247.7 inhabitants for every square kilometre, which is very high in comparison to the whole France's 116.5 inhabitants for every square kilometre. One third of the land is devoted to agriculture and all mountains are uninhabitable. This lack of space and shelter makes the population density even higher.\n\nBecause Guadeloupe is a wealthy country in comparison to the surrounding Caribbean islands, immigration is popular. People immigrate to Guadeloupe because of its stronger political stability and greater agricultural job opportunities. However, just because foreigners immigrate to Guadeloupe for its opportunities does not mean the country is economically stable; rather, it is stable in comparison to the surrounding regions/islands.\n\nReligion\n\nOver 80% of the population are Roman Catholic. Guadeloupe is in the diocese of Basse-Terre (et Pointe-à-Pitre).\n\nEvangelical Protestants concentrated in newly arriving denominations from the United States are also present in Guadeloupe.\n\nMajor urban areas \n\nHealth \n\nIn 2011, life expectancy at birth was recorded at 77.0 years for males and 83.5 for females.\n\nMedical centers in Guadeloupe include:\n\nA University Hospital Center (CHU) in Pointe-à-Pitre\n\nA Regional Hospital Center (CHR) in Basse-Terre\n\nFour hospitals located in Capesterre-Belle-Eau, Pointe-Noire, Bouillante and Saint-Claude\n\nThe Institut Pasteur de la Guadeloupe, which is located in Pointe-à-Pitre and is responsible for researching environmental hygiene, vaccinations, and the spread of tuberculosis and mycobacteria\n\nAdministration\n\nGuadeloupe sends four deputies to the French National Assembly and three senators to the French Senate.\n\nGuadeloupe is divided into two arrondissements (Basse-Terre and Pointe-à-Pitre), 21 cantons and 32 communes.\n\nFormerly called the Regional Council of Guadeloupe, following the local elections of March 2015 the administering Assembly now bears the name of the Departmental Council of Guadeloupe.\n\nEconomy \n\nIn 2006, the GDP per capita of Guadeloupe at market exchange rates, not at PPP, was €17,338 (US$21,780).\n\nThe economy of Guadeloupe depends on tourism, agriculture, light industry and services. It is dependent upon mainland France for large subsidies and imports. Unemployment is especially high among the youth.\n\nTourism \n\nTourism is a key industry, with 83.3% of tourists visiting from metropolitan France, 10.8% coming from the rest of Europe, 3.4% coming from the United States, 1.5% coming from Canada, 0.4% coming from South America, and 0.6% coming from the rest of the world. An increasingly large number of cruise ships visit the islands.\n\nAgriculture \n\nThe traditional sugar cane crop is slowly being replaced by other crops, such as bananas (which now supply about 50% of export earnings), eggplant, guinnep, noni, sapotilla, paroka, pikinga, giraumon squash, yam, gourd, plantain, christophine, monbin, prunecafé, cocoa, jackfruit, pomegranate, and many varieties of flowers. Other vegetables and root crops are cultivated for local consumption, although Guadeloupe is dependent upon imported food, mainly from rest of France.\n\nLight industry \n\nLight industry features sugar and rum, solar energy, and many industrial products. Most manufactured goods and fuel are imported.\n\nCulture \n\nLanguage\n\nAs it is a region of France, Guadeloupe's official language is French, which is spoken by nearly all of the population.\nIn addition, most of the population can also speak Guadeloupean Creole (GC),Cérol, Marie-José. Une introduction au créole guadeloupéen (An introduction to Guadeloupean Creole). Paris: Jasor. 1991. a variety of Antillean Creole French. Throughout the island's colonial history, GC was the language of local community, of resistance to European domination, of ethno-racial identity. Consequently, when from the early 1970s to the mid 1980s, Guadeloupe saw the rise and fall of an at-times violent movement for (greater) political independence from France,Schnepel, Ellen. In Search of a National Identity: Creole and Politics in Guadaloupe. University of Wisconsin Press (July 7, 2004)Bebel-Gisler, D. (1976). La langue créole, force jugulée: Etude sociolinguistique desrapports de force entre le créole et le français aux Antilles (The creole language, represssed power: Sociolinguistic study of the power relations between Creole andFrench in the Antilles). Paris: Harmattan. GC was claimed as key to local cultural pride and unity. In the 1990s, in the wake of the independence movement's demise, GC retained its de-stigmatized status as a symbol of local culture, albeit without de jure support from the state and without de facto being practiced with equal competence in all strata and age groups of society.Meyjes, Gregory Paul P, On the status of Creole in Guadeloupe: a study of present-day language attitudes. Unpub. PhD. Dissertation. University of North Carolina at Chapel Hill. 1995.Durizot-Jno-Baptiste, Paulette. La question du créole à l'école en Guadeloupe : quelle dynamique? Paris, France : L'Harmattan, 1996. The third millennium, however, brought greater acceptance of GC on the part of France, such that it was introduced as an elective in public schools. Today, the question as to whether French and GC are stable in Guadeloupe, i.e. whether both languages are practised widely and competently throughout society, remains a subject of active research.Manahan, Kathe. Diglossia Reconsidered: Language Choice and Code-Switching in Guadeloupean Voluntary Organizations, Kathe Manahan Texas Linguistic Forum. 47: 251-261, Austin, TX. 2004\n\nHigh culture \n\nGuadeloupe's culture is probably best known for the islanders' literary achievements, particularly the poetry of Saint-John Perse, the pseudonym used by Alexis Léger. Perse won the 1960 Nobel Prize in Literature \"for the soaring flight and the evocative images of his poetry, which, in a visionary fashion, reflects the conditions of our time.\"\n\nGuadeloupe has always had a rich literary output, continued today by many living writers, poets, novelists, essayists and journalists, among them Mesdames Maryse Condé and Simone Schwarz-Bart, .\n\nFrench writer Gisèle Pineau, who currently lives in Marie-Galante, has Guadeloupean parentage.\n\nMusic \n\nMusic and dance are also very popular, and the widely accepted interaction of African, French and IndianSahai, Sharad (1998). [http://www.hinduismtoday.com/archives/1998/2/1998-2-12.shtml Guadeloupe Lights Up: French-lettered Indians in a remote corner of the Caribbean reclaim their Hindu identity] . Hinduism Today, Digital Edition, February 1998. cultures has given birth to some original new forms specific to the archipelago. Since the 1970s, Guadeloupean music increasingly claimed the local language, Guadeloupean Creole as the preferred language of popular music. Islanders enjoy many local dance styles including zouk, zouk-love, kompa, as well as the modern international dances such as hip hop, etc.\n\nOne of his most famous artists was Henri Debs (1932-2013) a musician and producer of French, origin of Lebanese parents, who made many Caribbean rhythms like Zouk (Soca in Spanish) and Belé heard throughout the Antilles, North, Central, Suramerica and France.\n\nTraditional Guadeloupean music includes la biguine, kadans, cadence-lypso, zouk, and gwo ka such as Anzala and Ti Celeste. Popular music artists and bands such as Experience 7, Francky Vincent, Kassav' (which included Patrick St-Eloi), and Gilles Floro embody the traditional music style of the island and the new generation of music, while some other musical artists, like Tom Frager (who grew up in Guadeloupe), perform colorful reggae music that defines the Guadeloupe island as paradise-like. Many international festivals take place in Guadeloupe, like the Creole Blues Festival, hosted in Marie-Galante. All the Euro-French forms of art are also ubiquitous. The melting pot is emphasized by other communities (from Brazil, Dominican Republic, Haiti, India, Lebanon, Syria), who live on the island and share their cultures.\n\nAnother element of Guadeloupean culture is its dress. A few women (particularly of the older generation) wear a unique style of traditional dress, with many layers of colourful fabric, now only worn on special occasions. On festive occasions they also wore a madras (originally a \"kerchief\" from South India) head scarf tied in many different symbolic ways, each with a different name. The headdress could be tied in the \"bat\" style, or the \"firefighter\" style, as well as the \"Guadeloupean woman\". Jewelry, mainly gold, is also important in the Guadeloupean lady's dress, a product of European, African and Indian inspiration.\n\nFrench born dancers, choreographers, comedians Laurent and Larry Bourgeois (known as Les Twins) are also of Guadelupean descent. Noted for their fresh take on hip-hop dance, this twin duo made an impression on the dance world while touring with Cirque du Soleil on the Michael Jackson: The Immortal World Tour, and with Beyoncé on The Mrs. Carter Show World Tour, as well as the On the Run Tour.\n\nCrime \n\nGuadeloupe is the most violent overseas French department.[http://www.francetvinfo.fr/faits-divers/meurtres/guadeloupe-la-spirale-de-la-violence_1848359.html Guadeloupe : la spirale de la violence], francetvinfo.fr, 29 September 2016 The high level of unemployment combined with the legacy of slavery caused violence and crime to rise especially in 2009 and 2010, the years following a great worldwide recession.[https://www.theguardian.com/world/2011/dec/27/young-crime-unemployment-guadeloupe-france Borredon, Laurent. (2011)], Crime and unemployment dog Guadeloupe, theguardian, 27 December 2011 Since the population is so small, the murder rate is slightly more than that of Paris, but with a murder rate of 8.2 per 100,000, Guadeloupe is one of the safest islands in the Caribbean.[http://www.radiotimes.com/news/2013-01-08/death-in-paradise-ben-miller-on-investigating-the-deadliest-place-on-the-planet Graff, Vincent. (2013)], Death in Paradise: Ben Miller on investigating the deadliest place on the planet, Radio Times, 8 January 2013 Most of this violence is caused by the drug trade or domestic disputes, and the residents of Guadeloupe describe the island as a place with not a lot of everyday crime.\n\nSport \n\nFootball (soccer) is popular in Guadeloupe, and several notable footballers are of Guadeloupean origin:\n* Thierry Henry, former Arsenal legend and star of the French national team, often visits, as his father Antoine was originally from the island.\n* Anthony Martial, Manchester United star is of Guadeloupean descent.\n* William Gallas (Guadeloupean parentage).\n* Lilian Thuram, defender for France and most notably FC Barcelona, was born in Guadeloupe.\n* Alexandre Lacazette, striker for Arsenal and France, has Guadeloupean parentage.\n* Thomas Lemar, midfielder for Monaco and France, was born in Baie-Mahault.\n* The former Manchester United, Everton and France striker Louis Saha.\n* Newcastle United F.C. striker Yoan Gouffran.\n* Kettering Town goalkeeper Willy Gueret.\n* Pascal Chimbonda, footballer. Chimbonda was born in Guadeloupe.\n* Inter Milan star Jonathan Biabiany.\n* Stéphane Auvray currently plays for New York Red Bulls in Major League Soccer.\n* Ronald Zubar and his younger brother Stéphane, who are both footballers, were born in Guadeloupe.\n* Miguel Comminges, who currently plays as a defender for English side Stevenage F.C..\n* Dimitri Foulquier, who plays as a defender at Granada CF.\n* Bernard Lambourde, ex Chelsea defender.\n* Teddy Riner, Riner became the youngest world champion in the history of judo when he won the world title in 2007 aged 18 years and five months.\n* Jocelyn Angloma, defender, who played for Paris Saint-Germain, Olympique de Marseille, and Inter Milan, among other clubs, and for the French national team and the Guadeloupean national football team, was born in Les Abymes.\nThe national football team experienced success in 2007, advancing all the way to the 2007 CONCACAF Gold Cup semi-finals, where they were defeated 1–0 by CONCACAF powerhouse Mexico.\n\nBasketball is also popular. Best known players are the NBA players Mickaël Piétrus, Johan Petro, Rodrigue Beaubois, and Mickael Gelabale (now playing in Russia), who were born on the island. Utah Jazz star centre Rudy Gobert is also of half guadeloupean descent. Also known is trainer and former player Paul Chonchon, after whom a basketball stadion in Pointe-à-Pitre is named.(french) [http://www.guadeloupe.franceantilles.fr/actualite/economie-consommation/un-bel-hommage-a-ete-rendu-a-paul-chonchon-204538.php/ Un bel hommage a été rendu à Paul Chonchon (Paul Chonchon honored)] at guadeloupe.franceantilles.fr Retrieved 4 July 2013\n\nMany fine track and field athletes, such as Marie-José Pérec, Patricia Girard-Léno, Christine Arron, and Wilhem Belocian, are also Guadeloupe natives. Triple Olympic champion Marie-José Pérec, fourth-fastest 100 m runner Christine Arron, and fencing champion Laura Flessel were all born and raised in Guadeloupe.\n\nEven though Guadeloupe is part of France, it has its own sports teams. Rugby union is a small but rapidly growing sport in Guadeloupe. France international and RC Toulon centre Mathieu Bastareaud (cousin of footballer William Gallas) was born in Guadeloupe.\n\nThe island is also internationally best known for hosting the Karujet Race – Jet Ski World Championship since 1998. This nine-stage, four-day event attracts competitors from around the world (mostly Caribbeans, Americans, and Europeans). The Karujet, generally made up of seven races around the island, has an established reputation as one of the most difficult championships in which to compete.\n\nThe Route du Rhum is one of the most prominent nautical French sporting events, occurring every four years.\n\nBodybuilder Serge Nubret was born in Anse-Bertrand, Grande-Terre, representing the French state in various bodybuilding competitions throughout the 1960s and 1970s including the IFBB's Mr. Olympia contest, taking 3rd place every year from 1972 to 1974, and 2nd place in 1975. Bodybuilder Marie-Laure Mahabir also hails from Guadeloupe.\n\nGuadeloupe also has some less conventional sporting groups and associations, which include The Skywalkers Parkour Team and Rollers forward, both based in Sainte Anne. The country has also a passion for cycling. It hosted the French Cycling Championships in 2009 and continues to host the Tour de Guadeloupe every year. Guadeloupe also continues to host the Orange Open Guadeloupe tennis tournament (since 2011) and the Tour of Guadeloupe sailing, which was founded in 1981.\n\nTransport\n\nOn 9 September 2013 the county government voted in favour of a constructing a tramway in Pointe-à-Pitre. The first phase will link northern Abymes to downtown Pointe-à-Pitre by 2019. The second phase, scheduled for completion in 2023, will extend the line to serve the university.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Guadeloupe" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12343" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Guadeloupe (;; Antillean Creole: Gwadloup) is an insular region of France located in the Leeward Islands, part of the Lesser Antilles in the Caribbean. Administratively, it is an overseas region consisting of a single overseas department. With a land area of  and an estimated population of 400,132 as of January 2015, it is the largest and most populous European Union territory in North America.\n\nGuadeloupe's two main islands are Basse-Terre to the west and Grande-Terre to the east, which are separated by a narrow strait that is crossed with bridges. They are often referred to as a single island. The department also includes the Dependencies of Guadeloupe, which include the smaller islands of Marie-Galante and La Désirade, and the Îles des Saintes.\n\nGuadeloupe, like the other overseas departments, is an integral part of France. As a constituent territory of the European Union and the Eurozone,   the euro, Guadeloupe is pictured on all Euro banknotes – on the reverse, at the bottom, to the right of the Greek ΕΥΡΩ (EURO), next to the denomination. is its official currency and any European Union citizen is free to settle and work there indefinitely.  As an overseas department, however, it is not part of the Schengen Area. The prefecture (regional capital) of Guadeloupe is the city of Basse-Terre, which lies on the island of the same name. The official language is French and  Antillean Creole is spoken virtually by the entire population except recent arrivals from metropolitan France.\n\nOrigin of the name \n\nChristopher Columbus named the island Santa María de Guadalupe in 1493 after the Virgin Mary, venerated in the Spanish town of Guadalupe, in Extremadura. Upon becoming a French colony, the Spanish name was retained though altered to French orthography and phonology.\n\nHistory \n\nThe island was called \"Karukera\" (or \"The Island of Beautiful Waters\") by the Arawak people, who settled on there in 300 AD/CE. During the 8th century, the Caribs inhabited the island.\n\nDuring his second trip to the Americas, in November 1493, Christopher Columbus landed on Guadeloupe, while seeking fresh water. He called it Santa María de Guadalupe de Extremadura, after the image of the Virgin Mary venerated at the Spanish monastery of Villuercas, in Guadalupe, Extremadura. The expedition set ashore just south of Capesterre, but left no settlers behind.\n\nColumbus is credited with discovering the pineapple on the island of Guadeloupe in 1493, although the fruit had long been grown in South America. He called it piña de Indias, which can be correctly translated as \"pine cone of the Indies.\"[http://lema.rae.es/drae/?valpi%C3%B1a Entry for \"piña\"] in the Dictionary of the Real Academia Española de la Lengua, definition #1.[http://www.wordreference.com/es/en/translation.asp?spen\npi%C3%B1a Entry for \"piña\"] in the bilingual Collins & WordReference Dictionaries[http://dictionary.reverso.net/spanish-english/pi%C3%B1a Entry for \"piña\"] on the bilingual Collins Reverso Dictionary, definition #1.\n\nDuring the 17th century, the Caribs fought against the Spanish settlers and repelled them.\n\nAfter successful settlement on the island of St. Christophe (St. Kitts), the French Company of the American Islands delegated Charles Lienard (Liénard de L'Olive) and Jean Duplessis Ossonville, Lord of Ossonville to colonize one or any of the region's islands, Guadeloupe, Martinique, or Dominica.\n\nDue to Martinique's inhospitable nature, the duo resolved to settle in Guadeloupe in 1635, took possession of the island, and wiped out many of the Carib Amerindians. It was annexed to the kingdom of France in 1674.\n\nOver the next century, the British seized the island several times. The economy benefited from the lucrative sugar trade, which commenced during the closing decades of the 17th century. Guadeloupe produced more sugar than all the British islands combined, worth about £6 million a year. The British captured Guadeloupe in 1759. The British government decided that Canada was strategically more important and kept Canada while returning Guadeloupe to France in the Treaty of Paris (1763) that ended the Seven Years War.\n\nIn 1790, following the outbreak of the French Revolution, the monarchists of Guadeloupe refused to obey the new laws of equal rights for the free people of color and attempted to declare independence. The ensuing conflict with the republicans, who were faithful to revolutionary France, caused a fire to break out in Pointe-à-Pitre that devastated a third of the town. The monarchists ultimately overcame the republicans and declared independence in 1791. The monarchists then refused to receive the new governor that Paris had appointed in 1792. In 1793, a slave rebellion broke out, which made the upper classes turn to the British and ask them to occupy the island.\n\nIn an effort to take advantage of the chaos ensuing from the French Revolution, Britain seized Guadeloupe in 1794, holding control from 21 April until December 1794, when republican governor Victor Hugues obliged the British general to surrender.pg 241 Hugues was able to use his expeditionary force of 1,500 men and an enthusiastic slave population to repel the British invasion of Guadeloupe after a seven-month struggle, which ended in December 1794. Hugues succeeded in freeing the slaves, who then turned on the slave owners who controlled the sugar plantations.\n\nIn 1802, Napoleon Bonaparte issued the Law of 20 May 1802. It restored slavery to all colonies the British had captured during the French Revolutionary Wars—but did not apply to certain French overseas possessions, such as Guadeloupe, Guyane, and Saint-Domingue. Napoleon sent an expeditionary force to recapture the island from the rebellious slaves. Louis Delgrès and a group of revolutionary soldiers killed themselves on the slopes of the Matouba volcano when it became obvious that the invading troops would take control of the island. The occupation force killed approximately 10,000 Guadeloupeans.\n\nOn 4 February 1810 the British once again seized the island and continued to occupy it until 1816. By the Anglo-Swedish alliance of 3 March 1813, Britain ceded it to Sweden for a brief period of 15 months. During this time, the British administration remained in place and British governors continued to govern the island.World Statesmen.org: [http://www.worldstatesmen.org/Guadeloupe.html Guadeloupe]\n\nIn the Treaty of Paris of 1814, Sweden ceded Guadeloupe once more to France. An ensuing settlement between Sweden and the British gave rise to the Guadeloupe Fund. The Treaty of Vienna in 1815 definitively acknowledged French control of Guadeloupe.\n\nAn earthquake in 1843 caused the La Soufrière volcano to erupt and killed over 5000 people.\n\nSlavery was finally abolished on the island (and in all French possessions) on 28 May 1848 at the initiative of Victor Schoelcher.\n\nGuadeloupe lost 12,000 of its 150,000 residents in the cholera epidemic of 1865–66.\n\nThe colonial history of Guadeloupe has been addressed in research publications.e.g. Faloppe, Josette. Esclaves et Citoyens. Les Noirs à la Guadeloupe dans les processus de résistance et d'intégration, 1802-1910 \". Basse-Terre, Guadeloupe, Société d'Histoire de la Guadeloupe (S.H.G.), 1992.\n\n20th century \n\nIn 1925, after the trial of Henry Sidambarom (Justice of the Peace and defender of the cause of Indian workers), Raymond Poincaré decided to grant French nationality and the right to vote to Indian citizens.* [http://www.guadeloupe.pref.gouv.fr/content/download/1064/6597/file/Henry_SIDAMBAROM_07_10_2011.pdf 7 octobre 2011 - Commemorating the 59th anniversary of the death of Henri Sidambarom (In French and PDF)] \n\nIn 1946, the colony of Guadeloupe became an overseas department of France. Then in 1974, it became an administrative center. Its deputies sit in the French National Assembly in Paris.\n\nIn 1967, rallies became riots, and repression backed by the prefect Pierre Bolotte caused dozens of deaths.\n\n21st century \n\nIn 2007 the island communes of Saint-Martin and Saint-Barthélemy were officially detached from Guadeloupe and became two separate French overseas collectivities with their own local administration.The French law was passed in February 2007, but did not take effect until the local assemblies voted in agreement on 15 July 2007. See J. P. Thiellay, Droit des outre-mers, Paris:Dalloz, 2007. Their combined population was 35,930 and their combined land area was  as of the 1999 census. \n\nIn January 2009, an umbrella group of approximately fifty labour union and other associations (known in the local Antillean Creole as the Liyannaj Kont Pwofitasyon (LKP), led by Élie Domota) called for a €200 ($260 USD) monthly pay increase for the island's low income workers. The protesters have proposed that authorities \"lower business taxes as a top up to company finances\" to pay for the €200 pay raises. Employers and business leaders in Guadeloupe have said that they cannot afford the salary increase. The strike lasted 44 days, ending with an accord reached on 5 March 2009. Tourism suffered greatly during this time and affected the 2010 tourist season as well.\n\nThe 2009 French Caribbean general strikes exposed deep ethnic, racial, and class tensions and disparities within Guadeloupe.\"[https://www.google.com/hostednews/afp/article/ALeqM5gk4fdgdkSoLI7uwcWr8DPvufQdAg?hl=en Race, class fuel social conflict on French Caribbean islands]\". Agence France-Presse (AFP). February 17, 2009\n\nGeography \n\nLocated as the southernmost of the Leeward Islands in the eastern Caribbean Sea, Guadeloupe comprises two main islands: Basse-Terre Island and Grande-Terre, which are separated by a narrow sea channel called Salt River. The adjacent French islands of La Désirade, Les Saintes, and Marie-Galante are under jurisdiction of Guadeloupe.\n\nWestern Basse-Terre has a rough volcanic relief while eastern Grande-Terre features rolling hills and flat plains. La Grande Soufrière is the highest mountain peak in the Lesser Antilles, with an elevation of .\n\nFurther to the north, Saint-Barthélemy and the northern French part of Saint Martin were previously under the jurisdiction of Guadeloupe but on 7 December 2003, both of these areas voted to become overseas territorial collectivities separate from Guadeloupe, a decision that took effect on 22 February 2007.\n\nVolcanoes \n\nThere is an active volcano in Guadeloupe called \"La Soufrière,\" located in the South of Basse-Terre. La Soufrière is actually a part of a volcanic complex that is composed of the Carmichael volcanoes, the Nez Cassé, the Echelle, the Cistern and the Madeleine. It is one of the nine active volcanoes of the Lesser Antilles. Its last eruption was in 1976. This eruption led to the evacuation of the southern part of Basse-Terre. 73,600 people were displaced over a course of three and a half months following the eruption.\n\nHurricanes \n\nThe island was devastated by several hurricanes in modern times:\n* On 12 September 1928, the Okeechobee hurricane caused extensive damage and killed thousands of people.\n* On 22 August 1964, Guadeloupe was ravaged by Hurricane Cleo, which killed 14 people.\n* On 27 September 1966, Category 3 Hurricane Inez caused extensive damage, mostly in Grande-Terre and north Basse-Terre Island, killing 33 people. Charles De Gaulle visited the islands after the hurricanes and declared them a disaster area.\n* On 17 September 1989, Category 4 Hurricane Hugo caused extensive damage, destroyed 10,000 homes leaving more than 35,000 homeless. It destroyed 100 percent of the banana crop, and 60 percent of the sugar cane crop.*Benito-Espinal, F. Pagney and E. Benito-Espinal – L'Ouragan Hugo: génèse, incidences géographiques et écologiques sur la guadeloupe [Hurricane Hugo: Origin, Geographic and Ecological Consequences on Guadeloupe]. \n* From late August to mid September 1995, the island was in the path of three successive cyclones: Tropical Storm Iris on 28 August caused minor damages; Hurricane Luis on 5 September caused moderate damage on the north coast of Grande-Terre; and Hurricane Marilyn on 15 September caused moderate damage in Basse-Terre.\n* On 21 September 1998, Hurricane Georges pounded the islands, causing moderate damage and destroying 90% of the banana crop.\n* On 5 September 2017, Hurricane Irma caused relatively minor damage while producing significant destruction on other islands, such as Saint Martin.https://www.local10.com/weather/hurricane-irma/hurricane-irma-knocks-out-electricity-damages-rooftops-in-Caribbean In fact, the island is a base for relief efforts on St. Martin (Collectivity of Saint Martin) and St. Barts (Saint Barthélemy); France's President Emmanuel Macron arrived at Pointe-a-Pitre airport on 12 September to begin his tour of those devastated islands and the distribution of relief supplies.\n* On 19 September 2017, Hurricane Maria battered Guadeloupe overnight as a category 4 or category 5 hurricane, causing flooding and intense winds, with the eye passing near Basse-Terre. Shortly after the hurricane hit, authorities reported at least one death and two reported missing after the sinking of their boat, serious flooding, and widespread damage to buildings in certain areas, with roofs blown off buildings and lack of power in 80,000 homes.\n\nClimate \n\nGuadeloupe has a tropical climate tempered by maritime influences and the Trade Winds. We distinguish two seasons in Guadeloupe and nearby islands:\n*a dry season called \"Lent\" that goes from January to June;\n*a wet season called \"winter\", which lasts from July to December.\n\nDemographics \n\nGuadeloupe recorded a population of 402,119 in the 2013 census.\n\nThe population of Guadeloupe is mainly of African or mixed descent of Europeans, Indians (Tamil, Telugu, and other South Indians), Lebanese, Syrians, Chinese, and Carib Amerindians (remnants of the original pre-European population). The archipelago of Îles des Saintes is mostly populated by the descendants of colonists from Brittany and Normandy. It is largely Roman Catholic, speaking French and a Creole (Antillean Creole).\"[http://articles.orlandosentinel.com/2010-11-22/travel/orl-travel-guadeloupe-spotlight_1_basse-terre-guadeloupe-la-desirade Cruise Port Spotlight: Basse-Terre, Pointe-a-Pitre and Iles Des Saintes, Guadeloupe]\". Orlando Sentinel. November 22, 2010\n\nThe population of Guadeloupe has been stable recently, with a net increase of only 335 people between the 2008 and 2013 censuses.\n\nIn 2012 the average population density in Guadeloupe was 247.7 inhabitants for every square kilometre, which is very high in comparison to the whole France's 116.5 inhabitants for every square kilometre. One third of the land is devoted to agriculture and all mountains are uninhabitable. This lack of space and shelter makes the population density even higher.\n\nBecause Guadeloupe is a wealthy country in comparison to the surrounding Caribbean islands, immigration is popular. People immigrate to Guadeloupe because of its stronger political stability and greater agricultural job opportunities. However, just because foreigners immigrate to Guadeloupe for its opportunities does not mean the country is economically stable; rather, it is stable in comparison to the surrounding regions/islands.\n\nReligion\n\nOver 80% of the population are Roman Catholic. Guadeloupe is in the diocese of Basse-Terre (et Pointe-à-Pitre).\n\nEvangelical Protestants concentrated in newly arriving denominations from the United States are also present in Guadeloupe.\n\nMajor urban areas \n\nHealth \n\nIn 2011, life expectancy at birth was recorded at 77.0 years for males and 83.5 for females.\n\nMedical centers in Guadeloupe include:\n\nA University Hospital Center (CHU) in Pointe-à-Pitre\n\nA Regional Hospital Center (CHR) in Basse-Terre\n\nFour hospitals located in Capesterre-Belle-Eau, Pointe-Noire, Bouillante and Saint-Claude\n\nThe Institut Pasteur de la Guadeloupe, which is located in Pointe-à-Pitre and is responsible for researching environmental hygiene, vaccinations, and the spread of tuberculosis and mycobacteria\n\nAdministration\n\nGuadeloupe sends four deputies to the French National Assembly and three senators to the French Senate.\n\nGuadeloupe is divided into two arrondissements (Basse-Terre and Pointe-à-Pitre), 21 cantons and 32 communes.\n\nFormerly called the Regional Council of Guadeloupe, following the local elections of March 2015 the administering Assembly now bears the name of the Departmental Council of Guadeloupe.\n\nEconomy \n\nIn 2006, the GDP per capita of Guadeloupe at market exchange rates, not at PPP, was €17,338 (US$21,780).\n\nThe economy of Guadeloupe depends on tourism, agriculture, light industry and services. It is dependent upon mainland France for large subsidies and imports. Unemployment is especially high among the youth.\n\nTourism \n\nTourism is a key industry, with 83.3% of tourists visiting from metropolitan France, 10.8% coming from the rest of Europe, 3.4% coming from the United States, 1.5% coming from Canada, 0.4% coming from South America, and 0.6% coming from the rest of the world. An increasingly large number of cruise ships visit the islands.\n\nAgriculture \n\nThe traditional sugar cane crop is slowly being replaced by other crops, such as bananas (which now supply about 50% of export earnings), eggplant, guinnep, noni, sapotilla, paroka, pikinga, giraumon squash, yam, gourd, plantain, christophine, monbin, prunecafé, cocoa, jackfruit, pomegranate, and many varieties of flowers. Other vegetables and root crops are cultivated for local consumption, although Guadeloupe is dependent upon imported food, mainly from rest of France.\n\nLight industry \n\nLight industry features sugar and rum, solar energy, and many industrial products. Most manufactured goods and fuel are imported.\n\nCulture \n\nLanguage\n\nAs it is a region of France, Guadeloupe's official language is French, which is spoken by nearly all of the population.\nIn addition, most of the population can also speak Guadeloupean Creole (GC),Cérol, Marie-José. Une introduction au créole guadeloupéen (An introduction to Guadeloupean Creole). Paris: Jasor. 1991. a variety of Antillean Creole French. Throughout the island's colonial history, GC was the language of local community, of resistance to European domination, of ethno-racial identity. Consequently, when from the early 1970s to the mid 1980s, Guadeloupe saw the rise and fall of an at-times violent movement for (greater) political independence from France,Schnepel, Ellen. In Search of a National Identity: Creole and Politics in Guadaloupe. University of Wisconsin Press (July 7, 2004)Bebel-Gisler, D. (1976). La langue créole, force jugulée: Etude sociolinguistique desrapports de force entre le créole et le français aux Antilles (The creole language, represssed power: Sociolinguistic study of the power relations between Creole andFrench in the Antilles). Paris: Harmattan. GC was claimed as key to local cultural pride and unity. In the 1990s, in the wake of the independence movement's demise, GC retained its de-stigmatized status as a symbol of local culture, albeit without de jure support from the state and without de facto being practiced with equal competence in all strata and age groups of society.Meyjes, Gregory Paul P, On the status of Creole in Guadeloupe: a study of present-day language attitudes. Unpub. PhD. Dissertation. University of North Carolina at Chapel Hill. 1995.Durizot-Jno-Baptiste, Paulette. La question du créole à l'école en Guadeloupe : quelle dynamique? Paris, France : L'Harmattan, 1996. The third millennium, however, brought greater acceptance of GC on the part of France, such that it was introduced as an elective in public schools. Today, the question as to whether French and GC are stable in Guadeloupe, i.e. whether both languages are practised widely and competently throughout society, remains a subject of active research.Manahan, Kathe. Diglossia Reconsidered: Language Choice and Code-Switching in Guadeloupean Voluntary Organizations, Kathe Manahan Texas Linguistic Forum. 47: 251-261, Austin, TX. 2004\n\nHigh culture \n\nGuadeloupe's culture is probably best known for the islanders' literary achievements, particularly the poetry of Saint-John Perse, the pseudonym used by Alexis Léger. Perse won the 1960 Nobel Prize in Literature \"for the soaring flight and the evocative images of his poetry, which, in a visionary fashion, reflects the conditions of our time.\"\n\nGuadeloupe has always had a rich literary output, continued today by many living writers, poets, novelists, essayists and journalists, among them Mesdames Maryse Condé and Simone Schwarz-Bart, .\n\nFrench writer Gisèle Pineau, who currently lives in Marie-Galante, has Guadeloupean parentage.\n\nMusic \n\nMusic and dance are also very popular, and the widely accepted interaction of African, French and IndianSahai, Sharad (1998). [http://www.hinduismtoday.com/archives/1998/2/1998-2-12.shtml Guadeloupe Lights Up: French-lettered Indians in a remote corner of the Caribbean reclaim their Hindu identity] . Hinduism Today, Digital Edition, February 1998. cultures has given birth to some original new forms specific to the archipelago. Since the 1970s, Guadeloupean music increasingly claimed the local language, Guadeloupean Creole as the preferred language of popular music. Islanders enjoy many local dance styles including zouk, zouk-love, kompa, as well as the modern international dances such as hip hop, etc.\n\nOne of his most famous artists was Henri Debs (1932-2013) a musician and producer of French, origin of Lebanese parents, who made many Caribbean rhythms like Zouk (Soca in Spanish) and Belé heard throughout the Antilles, North, Central, Suramerica and France.\n\nTraditional Guadeloupean music includes la biguine, kadans, cadence-lypso, zouk, and gwo ka such as Anzala and Ti Celeste. Popular music artists and bands such as Experience 7, Francky Vincent, Kassav' (which included Patrick St-Eloi), and Gilles Floro embody the traditional music style of the island and the new generation of music, while some other musical artists, like Tom Frager (who grew up in Guadeloupe), perform colorful reggae music that defines the Guadeloupe island as paradise-like. Many international festivals take place in Guadeloupe, like the Creole Blues Festival, hosted in Marie-Galante. All the Euro-French forms of art are also ubiquitous. The melting pot is emphasized by other communities (from Brazil, Dominican Republic, Haiti, India, Lebanon, Syria), who live on the island and share their cultures.\n\nAnother element of Guadeloupean culture is its dress. A few women (particularly of the older generation) wear a unique style of traditional dress, with many layers of colourful fabric, now only worn on special occasions. On festive occasions they also wore a madras (originally a \"kerchief\" from South India) head scarf tied in many different symbolic ways, each with a different name. The headdress could be tied in the \"bat\" style, or the \"firefighter\" style, as well as the \"Guadeloupean woman\". Jewelry, mainly gold, is also important in the Guadeloupean lady's dress, a product of European, African and Indian inspiration.\n\nFrench born dancers, choreographers, comedians Laurent and Larry Bourgeois (known as Les Twins) are also of Guadelupean descent. Noted for their fresh take on hip-hop dance, this twin duo made an impression on the dance world while touring with Cirque du Soleil on the Michael Jackson: The Immortal World Tour, and with Beyoncé on The Mrs. Carter Show World Tour, as well as the On the Run Tour.\n\nCrime \n\nGuadeloupe is the most violent overseas French department.[http://www.francetvinfo.fr/faits-divers/meurtres/guadeloupe-la-spirale-de-la-violence_1848359.html Guadeloupe : la spirale de la violence], francetvinfo.fr, 29 September 2016 The high level of unemployment combined with the legacy of slavery caused violence and crime to rise especially in 2009 and 2010, the years following a great worldwide recession.[https://www.theguardian.com/world/2011/dec/27/young-crime-unemployment-guadeloupe-france Borredon, Laurent. (2011)], Crime and unemployment dog Guadeloupe, theguardian, 27 December 2011 Since the population is so small, the murder rate is slightly more than that of Paris, but with a murder rate of 8.2 per 100,000, Guadeloupe is one of the safest islands in the Caribbean.[http://www.radiotimes.com/news/2013-01-08/death-in-paradise-ben-miller-on-investigating-the-deadliest-place-on-the-planet Graff, Vincent. (2013)], Death in Paradise: Ben Miller on investigating the deadliest place on the planet, Radio Times, 8 January 2013 Most of this violence is caused by the drug trade or domestic disputes, and the residents of Guadeloupe describe the island as a place with not a lot of everyday crime.\n\nSport \n\nFootball (soccer) is popular in Guadeloupe, and several notable footballers are of Guadeloupean origin:\n* Thierry Henry, former Arsenal legend and star of the French national team, often visits, as his father Antoine was originally from the island.\n* Anthony Martial, Manchester United star is of Guadeloupean descent.\n* William Gallas (Guadeloupean parentage).\n* Lilian Thuram, defender for France and most notably FC Barcelona, was born in Guadeloupe.\n* Alexandre Lacazette, striker for Arsenal and France, has Guadeloupean parentage.\n* Thomas Lemar, midfielder for Monaco and France, was born in Baie-Mahault.\n* The former Manchester United, Everton and France striker Louis Saha.\n* Newcastle United F.C. striker Yoan Gouffran.\n* Kettering Town goalkeeper Willy Gueret.\n* Pascal Chimbonda, footballer. Chimbonda was born in Guadeloupe.\n* Inter Milan star Jonathan Biabiany.\n* Stéphane Auvray currently plays for New York Red Bulls in Major League Soccer.\n* Ronald Zubar and his younger brother Stéphane, who are both footballers, were born in Guadeloupe.\n* Miguel Comminges, who currently plays as a defender for English side Stevenage F.C..\n* Dimitri Foulquier, who plays as a defender at Granada CF.\n* Bernard Lambourde, ex Chelsea defender.\n* Teddy Riner, Riner became the youngest world champion in the history of judo when he won the world title in 2007 aged 18 years and five months.\n* Jocelyn Angloma, defender, who played for Paris Saint-Germain, Olympique de Marseille, and Inter Milan, among other clubs, and for the French national team and the Guadeloupean national football team, was born in Les Abymes.\nThe national football team experienced success in 2007, advancing all the way to the 2007 CONCACAF Gold Cup semi-finals, where they were defeated 1–0 by CONCACAF powerhouse Mexico.\n\nBasketball is also popular. Best known players are the NBA players Mickaël Piétrus, Johan Petro, Rodrigue Beaubois, and Mickael Gelabale (now playing in Russia), who were born on the island. Utah Jazz star centre Rudy Gobert is also of half guadeloupean descent. Also known is trainer and former player Paul Chonchon, after whom a basketball stadion in Pointe-à-Pitre is named.(french) [http://www.guadeloupe.franceantilles.fr/actualite/economie-consommation/un-bel-hommage-a-ete-rendu-a-paul-chonchon-204538.php/ Un bel hommage a été rendu à Paul Chonchon (Paul Chonchon honored)] at guadeloupe.franceantilles.fr Retrieved 4 July 2013\n\nMany fine track and field athletes, such as Marie-José Pérec, Patricia Girard-Léno, Christine Arron, and Wilhem Belocian, are also Guadeloupe natives. Triple Olympic champion Marie-José Pérec, fourth-fastest 100 m runner Christine Arron, and fencing champion Laura Flessel were all born and raised in Guadeloupe.\n\nEven though Guadeloupe is part of France, it has its own sports teams. Rugby union is a small but rapidly growing sport in Guadeloupe. France international and RC Toulon centre Mathieu Bastareaud (cousin of footballer William Gallas) was born in Guadeloupe.\n\nThe island is also internationally best known for hosting the Karujet Race – Jet Ski World Championship since 1998. This nine-stage, four-day event attracts competitors from around the world (mostly Caribbeans, Americans, and Europeans). The Karujet, generally made up of seven races around the island, has an established reputation as one of the most difficult championships in which to compete.\n\nThe Route du Rhum is one of the most prominent nautical French sporting events, occurring every four years.\n\nBodybuilder Serge Nubret was born in Anse-Bertrand, Grande-Terre, representing the French state in various bodybuilding competitions throughout the 1960s and 1970s including the IFBB's Mr. Olympia contest, taking 3rd place every year from 1972 to 1974, and 2nd place in 1975. Bodybuilder Marie-Laure Mahabir also hails from Guadeloupe.\n\nGuadeloupe also has some less conventional sporting groups and associations, which include The Skywalkers Parkour Team and Rollers forward, both based in Sainte Anne. The country has also a passion for cycling. It hosted the French Cycling Championships in 2009 and continues to host the Tour de Guadeloupe every year. Guadeloupe also continues to host the Orange Open Guadeloupe tennis tournament (since 2011) and the Tour of Guadeloupe sailing, which was founded in 1981.\n\nTransport\n\nOn 9 September 2013 the county government voted in favour of a constructing a tramway in Pointe-à-Pitre. The first phase will link northern Abymes to downtown Pointe-à-Pitre by 2019. The second phase, scheduled for completion in 2023, will extend the line to serve the university. Guadeloupe. http://en.wikipedia.org/?curid=12343."
  }
}
