{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12720",
  "eid" : "046319e0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778516606,
  "textBody" : "Guerrilla warfare is a form of irregular warfare in which a small group of combatants, such as paramilitary personnel, armed civilians, or irregulars, use military tactics including ambushes, sabotage, raids, petty warfare, hit-and-run tactics, and mobility to fight a larger and less-mobile traditional militarySimandan, D., 2017. Competition, contingency, and destabilization in urban assemblages and actor-networks. Urban Geography, pp.1-12. https://doi.org/10.1080/02723638.2017.1382307 . Guerrilla groups are a type of violent non-state actor.\n\nEtymology\n\nThe term, the diminutive form of \"war\" in Spanish, is usually translated as \"little war\", and the word, guerrilla, has been used to refer to the concept as early as the 18th century. In correct Spanish usage, a person who is a member of a guerrilla unit is a guerrillero if male, or a guerrillera if female. This term became popular during the early-19th century Peninsular War, when the Spanish people rose against the Napoleonic troops and fought against a highly superior army using the guerrilla strategy.\n\nThe term \"guerrilla\" was used in English as early as 1809 to refer to the fighters (e.g., \"The town was taken by the guerrillas\"), and also (as in Spanish) to denote a group or band of such fighters. However, in most languages guerrilla still denotes the specific style of warfare. The use of the diminutive evokes the differences in number, scale, and scope between the guerrilla army and the formal, professional army of the state.\n\nStrategy, tactics and methods\n\nStrategy \n\nGuerilla warfare is a type of asymmetric warfare: competition between opponents of unequal strength. It is also a type of irregular warfare: that is, it aims not simply to defeat an enemy, but to win popular support and political influence, to the enemy's cost.The Irregular Warrior, 4 October 2015 [http://irregularwarrior.com/2015/10 [1]] Accordingly, guerilla strategy aims to magnify the impact of a small, mobile force on a larger, more-cumbersome one. If successful, guerrillas weaken their enemy by attrition, eventually forcing them to withdraw.\n\nTactics \n\nTactically, guerrillas usually avoid confrontation with large units of enemy troops, but seek and attack small groups of enemy personnel and resources to gradually deplete the opposing force while minimizing their own losses. The guerrilla prizes mobility, secrecy, and surprise, organizing in small units and taking advantage of terrain that is difficult for larger units to use. For example, Mao Zedong summarized basic guerrilla tactics at the beginning of the Chinese \"Second Revolutionary Civil War\" as:\"The enemy advances, we retreat; the enemy camps, we harass; the enemy tires, we attack; the enemy retreats, we pursue.\"Mao Tse-tung, \"A Single Spark Can Start a Prairie Fire\", Selected Works, Eng. ed., FLP, Peking, 1965, Vol. I. At least one author credits the ancient Chinese work The Art of War with inspiring Mao's tactics. In the 20th century, other communist leaders, including North Vietnamese Ho Chi Minh, often used and developed guerrilla warfare tactics, which provided a model for their use elsewhere, leading to the Cuban \"foco\" theory and the anti-Soviet Mujahadeen in Afghanistan.McNeilly, Mark. Sun Tzu and the Art of Modern Warfare, 2003, p. 204. \"American arming and support of the anti-Soviet Mujahadeen in Afghanistan is another example.\"\n\nUnconventional methods \n\nIn addition to traditional military methods, guerrilla groups may rely also on destroying infrastructure, using improvised explosive devices, for example. They typically also rely on logistical and political support from the local population, are often embedded within it (thereby using the population as a human shield), and many guerrilla groups are adept at public persuasion through propaganda. Many guerilla movements today also rely heavily on children as combatants, scouts, porters, spies, informants, and in other roles, which has drawn international condemnation (although many states also recruit children into their armed forces).\n\nGrowth during the 20th century \n\nIrregular warfare, based on elements later characteristic of modern guerrilla warfare, has existed throughout the battles of many ancient civilizations. The growth of guerilla warfare in the 20th century was inspired in part by theoretical works on guerrilla warfare, starting with the Manual de Guerra de Guerrillas by Matías Ramón Mella written in the 19th century and, more recently, Mao Zedong's On Guerrilla Warfare, Che Guevara's [http://www3.uakron.edu/worldciv/pascher/che.html Guerrilla Warfare], and Lenin's [http://www.marxists.org/archive/lenin/works/1906/gw/index.htm text of the same name], all written after the successful revolutions carried by them in China, Cuba and Russia respectively. Those texts characterized the tactic of guerrilla warfare as, according to Che Guevara's text, being\"used by the side which is supported by a majority but which possesses a much smaller number of arms for use in defense against oppression\".\n\nHistory\n\nThe Chinese general and strategist Sun Tzu, in his The Art of War (6th century BC) or 600 BC to 501 BC, was the earliest to propose the use of guerrilla warfare.Leonard, Thomas M., Encyclopedia of the developing world, 1989, p. 728. \"One of the earliest proponents of guerrilla war tactics is the Chinese master of warfare, Sun Tzu.\" This directly inspired the development of modern guerrilla warfare.Snyder, Craig. Contemporary security and strategy, 1999, p. 46. \"Many of Sun Tzu's strategic ideas were adopted by the practitioners of guerrilla warfare.\" Guerrilla tactics were presumably employed by prehistoric tribal warriors against enemy tribes. Lawrence H. Keeley, War Before Civilization, p.75, Oxford University Press, 1997\"Primitive (and guerrilla) warfare consists of war stripped to its essentials: the murder of enemies; the theft or destruction of their sustenance, wealth, and essential resources; and the inducement in them of insecurity and terror. It conducts the basic business of war without recourse to ponderous formations or equipment, complicated maneuvers, strict chains of command, calculated strategies, time tables, or other civilized embellishments.\" Evidence of conventional warfare, on the other hand, did not emerge until 3100 BC in Egypt and Mesopotamia. Since the Enlightenment, ideologies such as nationalism, liberalism, socialism, and religious fundamentalism have played an important role in shaping insurgencies and guerrilla warfare.\n\nOne of the most remarkable guerrilla warfare warriors was Viriatus, a Lusitanian who led the resistance against the Roman Empire by obtaining several victories between 147 BC and 139 BC in the region of Zamora, Spain. Because of the innovative tactics he used during his command, he made himself the name of Terror Romanorum (Terror of the Romans).\n\nCounter-guerrilla warfare\n\nA counter-insurgency or counterinsurgencySee American and British English spelling differences#Compounds and hyphens (COIN) operation involves actions taken by the recognized government of a nation to contain or quell an insurgency taken up against it.An insurgency is a rebellion against a constituted authority (for example an authority recognized as such by the United Nations) when those taking part in the rebellion are not recognized as belligerents (Oxford English Dictionary second edition 1989 \"insurgent B. n. One who rises in revolt against constituted authority; a rebel who is not recognized as a belligerent.\") In the main, the insurgents seek to destroy or erase the political authority of the defending authorities in a population they seek to control, and the counter-insurgent forces seek to protect that authority and reduce or eliminate the supplanting authority of the insurgents.\nCounter-insurgency operations are common during war, occupation and armed rebellions. Counter-insurgency may be armed suppression of a rebellion, coupled with tactics such as divide and rule designed to fracture the links between the insurgency and the population in which the insurgents move. Because it may be difficult or impossible to distinguish between an insurgent, a supporter of an insurgency who is a non-combatant, and entirely uninvolved members of the population, counter-insurgency operations have often rested on a confused, relativistic, or otherwise situational distinction between insurgents and non-combatants.\n\nScholarship\n\nTheorists of counter-insurgency warfare have written extensively on the subject since the 1950s and 1960s but as early as the 1720s the third Marques of Santa Cruz de Marcenado (1684–1732) wrote that insurgencies were often the result of state failure and that the goal of those fighting the insurgents should be to seek the people's \"heart and love\".Excerpts from Santa Cruz's writings, translated into English, in Beatrice Heuser: The Strategy Makers: Thoughts on War and Society from Machiavelli to Clausewitz (Santa Monica, CA: Greenwood/Praeger, 2010), , pp. 124-146. The two most influential of scholars of counter-insurgency have been Westerners whose job it had been to fight insurgents (often colonized people). Robert Thompson fought during the Malayan Emergency and David Galula fought during the Algerian War. Together these officers advocated multi-pronged strategies to win over the civilian population to the side of the counter-insurgent.\n\nClassic guidelines\n\nThe widely distributed and influential work of Sir Robert Thompson, counter-insurgency expert of the Malayan Emergency, offers several such guidelines. Thompson's underlying assumption was that the counter-insurgent was committed to improving the rule of law and bettering local governance.Thompson, Robert (1966). Defeating Communist Insurgency: The Lessons of Malaya and Vietnam, Chatto & Windus,  Some governments, however, give such considerations short shrift. These governments are not interested in state-building and in extreme cases they have carried out counter-insurgency operations by using mass murder, genocide, terror, torture and execution. Historian Timothy Snyder has written, \"In the guise of anti-partisan actions, the Germans killed perhaps three quarters of a million people, about 350,000 in Belarus alone, and lower but comparable numbers in Poland and Yugoslavia. The Germans killed more than a hundred thousand Poles when suppressing the Warsaw Uprising of 1944.\"Snyder, Timothy. \"[http://www.nybooks.com/articles/archives/2009/jul/16/holocaust-the-ignored-reality/ Holocaust: The Ignored Reality]\"\n\nIn the Vietnam War, the Americans \"defoliated countless trees in areas where the communist North Vietnamese troops hid supply lines and conducted guerrilla warfare\", (see Operation Ranch Hand). In the Soviet war in Afghanistan, the Soviets countered the U.S.–backed Mujahideen with a 'Scorched Earth' policy, driving over one third of the Afghan population into exile (over 5 million people), and carrying out widespread destruction of villages, granaries, crops, herds and irrigation systems, including the deadly and widespread mining of fields and pastures.Kakar, Hassan. [http://publishing.cdlib.org/ucpressebooks/view?docId\nft7b69p12h&chunk.idch013&toc.depth\n1&toc.idch013&brand\neschol The Story of Genocide in Afghanistan]Malhuret, Claude. [http://www.paulbogdanor.com/left/afghan/report.pdf Report from Afghanistan]\n\nVariants\n\nSome writers on counter-insurgency warfare emphasize the more turbulent nature of today's guerrilla warfare environment, where the clear political goals, parties and structures of such places as Vietnam, Malaysia, and El Salvador are not as prevalent. These writers point to numerous guerrilla conflicts that center around religious, ethnic or even criminal enterprise themes, and that do not lend themselves to the classic \"national liberation\" template.\n\nThe wide availability of the Internet has also caused changes in the tempo and mode of guerrilla operations in such areas as coordination of strikes, leveraging of financing, recruitment, and media manipulation. While the classic guidelines still apply, today's anti-guerrilla forces need to accept a more disruptive, disorderly and ambiguous mode of operation. According to David Kilcullen:\n\nFoco theory\n\nIn the 1960s, the Marxist revolutionary Che Guevara developed the foco () theory of revolution in his book Guerrilla Warfare, based on his experiences during the 1959 Cuban Revolution. This theory was later formalized as \"focalism\" by Régis Debray. Its central principle is that vanguardism by cadres of small, fast-moving paramilitary groups can provide a focus for popular discontent against a sitting regime, and thereby lead a general insurrection. Although the original approach was to mobilize and launch attacks from rural areas, many foco ideas were adapted into urban guerrilla warfare movements.\n\nRelationship to terrorism \n\nThere is no commonly accepted definition of \"terrorism\", and the term is frequently used as a political tactic by belligerents to denounce opponents whose status as terrorists is disputed.\n\nAn attempt at a global definition appears in the working draft of Comprehensive Convention Against International Terrorism, which defines terrorism as a type of act, rather than as a type of group. Specifically, \"terrorism\" in the draft refers to the threatened or actual intentional injury to others, and serious damage to property resulting in major economic loss, \"when the purpose of the conduct, by its nature or context, is to intimidate a population, or to compel a Government or an international organization to do or to abstain from doing any act\".\n\nSince the definition encompasses the actions of some guerrilla movements (and of some state actors) and not others, disagreements remain and the treaty has yet to be agreed. For example, the Organisation of Islamic Cooperation has called for acts of terrorism to be distinguished from \"the legitimate struggle of peoples under foreign occupation and colonial or alien domination in the exercise of their right to self-determination in accordance with the principles of international law\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Guerrilla warfare" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12720" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Guerrilla warfare is a form of irregular warfare in which a small group of combatants, such as paramilitary personnel, armed civilians, or irregulars, use military tactics including ambushes, sabotage, raids, petty warfare, hit-and-run tactics, and mobility to fight a larger and less-mobile traditional militarySimandan, D., 2017. Competition, contingency, and destabilization in urban assemblages and actor-networks. Urban Geography, pp.1-12. https://doi.org/10.1080/02723638.2017.1382307 . Guerrilla groups are a type of violent non-state actor.\n\nEtymology\n\nThe term, the diminutive form of \"war\" in Spanish, is usually translated as \"little war\", and the word, guerrilla, has been used to refer to the concept as early as the 18th century. In correct Spanish usage, a person who is a member of a guerrilla unit is a guerrillero if male, or a guerrillera if female. This term became popular during the early-19th century Peninsular War, when the Spanish people rose against the Napoleonic troops and fought against a highly superior army using the guerrilla strategy.\n\nThe term \"guerrilla\" was used in English as early as 1809 to refer to the fighters (e.g., \"The town was taken by the guerrillas\"), and also (as in Spanish) to denote a group or band of such fighters. However, in most languages guerrilla still denotes the specific style of warfare. The use of the diminutive evokes the differences in number, scale, and scope between the guerrilla army and the formal, professional army of the state.\n\nStrategy, tactics and methods\n\nStrategy \n\nGuerilla warfare is a type of asymmetric warfare: competition between opponents of unequal strength. It is also a type of irregular warfare: that is, it aims not simply to defeat an enemy, but to win popular support and political influence, to the enemy's cost.The Irregular Warrior, 4 October 2015 [http://irregularwarrior.com/2015/10 [1]] Accordingly, guerilla strategy aims to magnify the impact of a small, mobile force on a larger, more-cumbersome one. If successful, guerrillas weaken their enemy by attrition, eventually forcing them to withdraw.\n\nTactics \n\nTactically, guerrillas usually avoid confrontation with large units of enemy troops, but seek and attack small groups of enemy personnel and resources to gradually deplete the opposing force while minimizing their own losses. The guerrilla prizes mobility, secrecy, and surprise, organizing in small units and taking advantage of terrain that is difficult for larger units to use. For example, Mao Zedong summarized basic guerrilla tactics at the beginning of the Chinese \"Second Revolutionary Civil War\" as:\"The enemy advances, we retreat; the enemy camps, we harass; the enemy tires, we attack; the enemy retreats, we pursue.\"Mao Tse-tung, \"A Single Spark Can Start a Prairie Fire\", Selected Works, Eng. ed., FLP, Peking, 1965, Vol. I. At least one author credits the ancient Chinese work The Art of War with inspiring Mao's tactics. In the 20th century, other communist leaders, including North Vietnamese Ho Chi Minh, often used and developed guerrilla warfare tactics, which provided a model for their use elsewhere, leading to the Cuban \"foco\" theory and the anti-Soviet Mujahadeen in Afghanistan.McNeilly, Mark. Sun Tzu and the Art of Modern Warfare, 2003, p. 204. \"American arming and support of the anti-Soviet Mujahadeen in Afghanistan is another example.\"\n\nUnconventional methods \n\nIn addition to traditional military methods, guerrilla groups may rely also on destroying infrastructure, using improvised explosive devices, for example. They typically also rely on logistical and political support from the local population, are often embedded within it (thereby using the population as a human shield), and many guerrilla groups are adept at public persuasion through propaganda. Many guerilla movements today also rely heavily on children as combatants, scouts, porters, spies, informants, and in other roles, which has drawn international condemnation (although many states also recruit children into their armed forces).\n\nGrowth during the 20th century \n\nIrregular warfare, based on elements later characteristic of modern guerrilla warfare, has existed throughout the battles of many ancient civilizations. The growth of guerilla warfare in the 20th century was inspired in part by theoretical works on guerrilla warfare, starting with the Manual de Guerra de Guerrillas by Matías Ramón Mella written in the 19th century and, more recently, Mao Zedong's On Guerrilla Warfare, Che Guevara's [http://www3.uakron.edu/worldciv/pascher/che.html Guerrilla Warfare], and Lenin's [http://www.marxists.org/archive/lenin/works/1906/gw/index.htm text of the same name], all written after the successful revolutions carried by them in China, Cuba and Russia respectively. Those texts characterized the tactic of guerrilla warfare as, according to Che Guevara's text, being\"used by the side which is supported by a majority but which possesses a much smaller number of arms for use in defense against oppression\".\n\nHistory\n\nThe Chinese general and strategist Sun Tzu, in his The Art of War (6th century BC) or 600 BC to 501 BC, was the earliest to propose the use of guerrilla warfare.Leonard, Thomas M., Encyclopedia of the developing world, 1989, p. 728. \"One of the earliest proponents of guerrilla war tactics is the Chinese master of warfare, Sun Tzu.\" This directly inspired the development of modern guerrilla warfare.Snyder, Craig. Contemporary security and strategy, 1999, p. 46. \"Many of Sun Tzu's strategic ideas were adopted by the practitioners of guerrilla warfare.\" Guerrilla tactics were presumably employed by prehistoric tribal warriors against enemy tribes. Lawrence H. Keeley, War Before Civilization, p.75, Oxford University Press, 1997\"Primitive (and guerrilla) warfare consists of war stripped to its essentials: the murder of enemies; the theft or destruction of their sustenance, wealth, and essential resources; and the inducement in them of insecurity and terror. It conducts the basic business of war without recourse to ponderous formations or equipment, complicated maneuvers, strict chains of command, calculated strategies, time tables, or other civilized embellishments.\" Evidence of conventional warfare, on the other hand, did not emerge until 3100 BC in Egypt and Mesopotamia. Since the Enlightenment, ideologies such as nationalism, liberalism, socialism, and religious fundamentalism have played an important role in shaping insurgencies and guerrilla warfare.\n\nOne of the most remarkable guerrilla warfare warriors was Viriatus, a Lusitanian who led the resistance against the Roman Empire by obtaining several victories between 147 BC and 139 BC in the region of Zamora, Spain. Because of the innovative tactics he used during his command, he made himself the name of Terror Romanorum (Terror of the Romans).\n\nCounter-guerrilla warfare\n\nA counter-insurgency or counterinsurgencySee American and British English spelling differences#Compounds and hyphens (COIN) operation involves actions taken by the recognized government of a nation to contain or quell an insurgency taken up against it.An insurgency is a rebellion against a constituted authority (for example an authority recognized as such by the United Nations) when those taking part in the rebellion are not recognized as belligerents (Oxford English Dictionary second edition 1989 \"insurgent B. n. One who rises in revolt against constituted authority; a rebel who is not recognized as a belligerent.\") In the main, the insurgents seek to destroy or erase the political authority of the defending authorities in a population they seek to control, and the counter-insurgent forces seek to protect that authority and reduce or eliminate the supplanting authority of the insurgents.\nCounter-insurgency operations are common during war, occupation and armed rebellions. Counter-insurgency may be armed suppression of a rebellion, coupled with tactics such as divide and rule designed to fracture the links between the insurgency and the population in which the insurgents move. Because it may be difficult or impossible to distinguish between an insurgent, a supporter of an insurgency who is a non-combatant, and entirely uninvolved members of the population, counter-insurgency operations have often rested on a confused, relativistic, or otherwise situational distinction between insurgents and non-combatants.\n\nScholarship\n\nTheorists of counter-insurgency warfare have written extensively on the subject since the 1950s and 1960s but as early as the 1720s the third Marques of Santa Cruz de Marcenado (1684–1732) wrote that insurgencies were often the result of state failure and that the goal of those fighting the insurgents should be to seek the people's \"heart and love\".Excerpts from Santa Cruz's writings, translated into English, in Beatrice Heuser: The Strategy Makers: Thoughts on War and Society from Machiavelli to Clausewitz (Santa Monica, CA: Greenwood/Praeger, 2010), , pp. 124-146. The two most influential of scholars of counter-insurgency have been Westerners whose job it had been to fight insurgents (often colonized people). Robert Thompson fought during the Malayan Emergency and David Galula fought during the Algerian War. Together these officers advocated multi-pronged strategies to win over the civilian population to the side of the counter-insurgent.\n\nClassic guidelines\n\nThe widely distributed and influential work of Sir Robert Thompson, counter-insurgency expert of the Malayan Emergency, offers several such guidelines. Thompson's underlying assumption was that the counter-insurgent was committed to improving the rule of law and bettering local governance.Thompson, Robert (1966). Defeating Communist Insurgency: The Lessons of Malaya and Vietnam, Chatto & Windus,  Some governments, however, give such considerations short shrift. These governments are not interested in state-building and in extreme cases they have carried out counter-insurgency operations by using mass murder, genocide, terror, torture and execution. Historian Timothy Snyder has written, \"In the guise of anti-partisan actions, the Germans killed perhaps three quarters of a million people, about 350,000 in Belarus alone, and lower but comparable numbers in Poland and Yugoslavia. The Germans killed more than a hundred thousand Poles when suppressing the Warsaw Uprising of 1944.\"Snyder, Timothy. \"[http://www.nybooks.com/articles/archives/2009/jul/16/holocaust-the-ignored-reality/ Holocaust: The Ignored Reality]\"\n\nIn the Vietnam War, the Americans \"defoliated countless trees in areas where the communist North Vietnamese troops hid supply lines and conducted guerrilla warfare\", (see Operation Ranch Hand). In the Soviet war in Afghanistan, the Soviets countered the U.S.–backed Mujahideen with a 'Scorched Earth' policy, driving over one third of the Afghan population into exile (over 5 million people), and carrying out widespread destruction of villages, granaries, crops, herds and irrigation systems, including the deadly and widespread mining of fields and pastures.Kakar, Hassan. [http://publishing.cdlib.org/ucpressebooks/view?docId\nft7b69p12h&chunk.idch013&toc.depth\n1&toc.idch013&brand\neschol The Story of Genocide in Afghanistan]Malhuret, Claude. [http://www.paulbogdanor.com/left/afghan/report.pdf Report from Afghanistan]\n\nVariants\n\nSome writers on counter-insurgency warfare emphasize the more turbulent nature of today's guerrilla warfare environment, where the clear political goals, parties and structures of such places as Vietnam, Malaysia, and El Salvador are not as prevalent. These writers point to numerous guerrilla conflicts that center around religious, ethnic or even criminal enterprise themes, and that do not lend themselves to the classic \"national liberation\" template.\n\nThe wide availability of the Internet has also caused changes in the tempo and mode of guerrilla operations in such areas as coordination of strikes, leveraging of financing, recruitment, and media manipulation. While the classic guidelines still apply, today's anti-guerrilla forces need to accept a more disruptive, disorderly and ambiguous mode of operation. According to David Kilcullen:\n\nFoco theory\n\nIn the 1960s, the Marxist revolutionary Che Guevara developed the foco () theory of revolution in his book Guerrilla Warfare, based on his experiences during the 1959 Cuban Revolution. This theory was later formalized as \"focalism\" by Régis Debray. Its central principle is that vanguardism by cadres of small, fast-moving paramilitary groups can provide a focus for popular discontent against a sitting regime, and thereby lead a general insurrection. Although the original approach was to mobilize and launch attacks from rural areas, many foco ideas were adapted into urban guerrilla warfare movements.\n\nRelationship to terrorism \n\nThere is no commonly accepted definition of \"terrorism\", and the term is frequently used as a political tactic by belligerents to denounce opponents whose status as terrorists is disputed.\n\nAn attempt at a global definition appears in the working draft of Comprehensive Convention Against International Terrorism, which defines terrorism as a type of act, rather than as a type of group. Specifically, \"terrorism\" in the draft refers to the threatened or actual intentional injury to others, and serious damage to property resulting in major economic loss, \"when the purpose of the conduct, by its nature or context, is to intimidate a population, or to compel a Government or an international organization to do or to abstain from doing any act\".\n\nSince the definition encompasses the actions of some guerrilla movements (and of some state actors) and not others, disagreements remain and the treaty has yet to be agreed. For example, the Organisation of Islamic Cooperation has called for acts of terrorism to be distinguished from \"the legitimate struggle of peoples under foreign occupation and colonial or alien domination in the exercise of their right to self-determination in accordance with the principles of international law\". Guerrilla warfare. http://en.wikipedia.org/?curid=12720."
  }
}
