{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19457",
  "eid" : "3b0575b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778608267,
  "textBody" : "Myanmar, officially the Republic of the Union of Myanmar and formerly known as Burma, is a sovereign state in Southeast Asia. Myanmar is bordered by India and Bangladesh to its west, Thailand and Laos to its east and People's Republic of China to its north and northeast. To its south, about one third of Myanmar's total perimeter of  forms an uninterrupted coastline of  along the Bay of Bengal and the Andaman Sea. The country's 2014 census counted the population to be 51 million people. As of 2017, the population is about 54 million.http://www.worldometers.info/world-population/myanmar-population/ Myanmar is  in size. Its capital city is Naypyidaw, and its largest city and former capital is Yangon (Rangoon). Myanmar has been a member of the Association of Southeast Asian Nations (ASEAN) since 1997.\n\nEarly civilisations in Myanmar included the Tibeto-Burman-speaking Pyu city-states in Upper Burma and the Mon kingdoms in Lower Burma. In the 9th century, the Bamar people entered the upper Irrawaddy valley and, following the establishment of the Pagan Kingdom in the 1050s, the Burmese language, culture and Theravada Buddhism slowly became dominant in the country. The Pagan Kingdom fell due to the Mongol invasions and several warring states emerged. In the 16th century, reunified by the Taungoo Dynasty, the country was for a brief period the largest empire in the history of Mainland Southeast Asia.Lieberman, p. 152 The early 19th century Konbaung Dynasty ruled over an area that included modern Myanmar and briefly controlled Manipur and Assam as well. The British took over the administration of Myanmar after three Anglo-Burmese Wars in the 19th century and the country became a British colony. Myanmar was granted independence in 1948, as a democratic nation. Following a coup d'état in 1962, it became a military dictatorship.\n\nFor most of its independent years, the country has been engrossed in rampant ethnic strife and its myriad ethnic groups have been involved in one of the world's longest-running ongoing civil wars. During this time, the United Nations and several other organisations have reported consistent and systematic human rights violations in the country. In 2011, the military junta was officially dissolved following a 2010 general election, and a nominally civilian government was installed. This, along with the release of Aung San Suu Kyi and political prisoners, has improved the country's human rights record and foreign relations, and has led to the easing of trade and other economic sanctions. There is, however, continuing criticism of the government's treatment of ethnic minorities, its response to the ethnic insurgency, and religious clashes. In the landmark 2015 election, Aung San Suu Kyi's party won a majority in both houses. However, the Burmese military remains a powerful force in politics.\n\nMyanmar is a country rich in jade and gems, oil, natural gas and other mineral resources. In 2013, its GDP (nominal) stood at US$56.7 billion and its GDP (PPP) at US$221.5 billion. The income gap in Myanmar is among the widest in the world, as a large proportion of the economy is controlled by supporters of the former military government. , Myanmar ranks 145 out of 188 countries in human development, according to the Human Development Index.\n\nEtymology \n\nIn 1989, the military government officially changed the English translations of many names dating back to Burma's colonial period or earlier, including that of the country itself: \"Burma\" became \"Myanmar\". The renaming remains a contested issue. Many political and ethnic opposition groups and countries continue to use \"Burma\" because they do not recognise the legitimacy of the ruling military government or its authority to rename the country.\n\nIn April 2016, soon after taking office, Aung San Suu Kyi clarified that foreigners are free to use either name, \"because there is nothing in the constitution of our country that says that you must use any term in particular\".South China Morning post, [http://www.scmp.com/news/asia/southeast-asia/article/1937886/whats-name-not-much-according-aung-san-suu-kyi-who-tells What's in a name? Not much, according to Aung San Suu Kyi, who tells diplomats they can use Myanmar or Burma], Saturday, 23 April 2016\n\nThe country's official full name is the \"Republic of the Union of Myanmar\" (, ',). Countries that do not officially recognise that name use the long form \"Union of Burma\" instead.\n\nIn English, the country is popularly known as either \"Burma\" or \"Myanmar\". Both these names are derived from the name of the majority Burmese Bamar ethnic group. Myanmar is considered to be the literary form of the name of the group, while Burma is derived from \"Bamar\", the colloquial form of the group's name. Depending on the register used, the pronunciation would be ' or '. The name Burma has been in use in English since the 18th century.\n\nBurma continues to be used in English by the governments of many countries, such as Canada and the United Kingdom. Official United States policy retains Burma as the country's name, although the State Department's website lists the country as \"Burma (Myanmar)\" and Barack Obama has referred to the country by both names. The Czech Republic officially uses Myanmar, although its Ministry of Foreign Affairs mentions both Myanmar and Burma on its website. The United Nations uses Myanmar, as do the Association of Southeast Asian Nations, Australia, Russia, Germany, China, India, Bangladesh, Norway, Japan and Switzerland.\n\nMost English-speaking international news media refer to the country by the name Myanmar, including the BBC, CNN, Al Jazeera, Reuters, RT (Russia Today) and the Australian Broadcasting Corporation (ABC)/Radio Australia.\n\nMyanmar is known with a name deriving from Burma as opposed to Myanmar in Spanish, Italian, Romanian, and Greek – Birmania being the local version of Burma in the Spanish language, for example. Myanmar used to be known as \"Birmânia\" in Portuguese, and as \"Birmanie\" in French. As in the past, French-language media today consistently use Birmanie.,http://tempsreel.nouvelobs.com/tag/birmanie\n\nHistory \n\nPrehistory \n\nArchaeological evidence shows that Homo erectus lived in the region now known as Myanmar as early as 750,000 years ago, with no more erectus finds after 75,000 years ago. The first evidence of Homo sapiens is dated to about 25,000 BP with discoveries of stone tools in central Myanmar. Evidence of neolithic age domestication of plants and animals and the use of polished stone tools dating to sometime between 10,000 and 6,000 BC has been discovered in the form of cave paintings in Padah-Lin Caves.\n\nThe Bronze Age arrived circa 1500 BC when people in the region were turning copper into bronze, growing rice and domesticating poultry and pigs; they were among the first people in the world to do so.Myint-U, p. 37 Human remains and artefacts from this era were discovered in Monywa District in the Sagaing Division. The Iron Age began around 500 BC with the emergence of iron-working settlements in an area south of present-day Mandalay.Myint-U, p. 45 Evidence also shows the presence of rice-growing settlements of large villages and small towns that traded with their surroundings as far as China between 500 BC and 200 AD. Iron Age Burmese cultures also had influences from outside sources such as India and Thailand, as seen in their funerary practices concerning child burials. This indicates some form of communication between groups in Myanmar and other places, possibly through trade.Coupey, A. S. (2008). Infant and child burials in the Samon valley, Myanmar. In Archaeology in Southeast Asia, from Homo Erectus to the living traditions: choice of papers from the 11th International Conference of the European Association of Southeast Asian Archaeologists, 25–29 September 2006, Bougon, France\n\nEarly city-states \n\nAround the second century BC the first-known city-states emerged in central Myanmar. The city-states were founded as part of the southward migration by the Tibeto-Burman-speaking Pyu people, the earliest inhabitants of Myanmar of whom records are extant, from present-day Yunnan. The Pyu culture was heavily influenced by trade with India, importing Buddhism as well as other cultural, architectural and political concepts, which would have an enduring influence on later Burmese culture and political organisation.Myint-U, pp. 51–52\n\nBy the 9th century, several city-states had sprouted across the land: the Pyu in the central dry zone, Mon along the southern coastline and Arakanese along the western littoral. The balance was upset when the Pyu came under repeated attacks from Nanzhao between the 750s and the 830s. In the mid-to-late 9th century the Bamar people founded a small settlement at Bagan. It was one of several competing city-states until the late 10th century when it grew in authority and grandeur.Lieberman, pp. 90–91\n\nImperial Burma \n\nPagan gradually grew to absorb its surrounding states until the 1050s–1060s when Anawrahta founded the Pagan Kingdom, the first ever unification of the Irrawaddy valley and its periphery. In the 12th and 13th centuries, the Pagan Empire and the Khmer Empire were two main powers in mainland Southeast Asia.Lieberman, p. 24 The Burmese language and culture gradually became dominant in the upper Irrawaddy valley, eclipsing the Pyu, Mon and Pali norms by the late 12th century.\n\nTheravada Buddhism slowly began to spread to the village level, although Tantric, Mahayana, Hinduism, and folk religion remained heavily entrenched. Pagan's rulers and wealthy built over 10,000 Buddhist temples in the Pagan capital zone alone. Repeated Mongol invasions (1277–1301) toppled the four-century-old kingdom in 1287.\n\nPagan's collapse was followed by 250 years of political fragmentation that lasted well into the 16th century. Like the Burmans four centuries earlier, Shan migrants who arrived with the Mongol invasions stayed behind. Several competing Shan States came to dominate the entire northwestern to eastern arc surrounding the Irrawaddy valley. The valley too was beset with petty states until the late 14th century when two sizeable powers, Ava Kingdom and Hanthawaddy Kingdom, emerged. In the west, a politically fragmented Arakan was under competing influences of its stronger neighbours until the Kingdom of Mrauk U unified the Arakan coastline for the first time in 1437.\n\nEarly on, Ava fought wars of unification (1385–1424) but could never quite reassemble the lost empire. Having held off Ava, Hanthawaddy entered its golden age, and Arakan went on to become a power in its own right for the next 350 years. In contrast, constant warfare left Ava greatly weakened, and it slowly disintegrated from 1481 onward. In 1527, the Confederation of Shan States conquered Ava itself, and ruled Upper Myanmar until 1555.\n\nLike the Pagan Empire, Ava, Hanthawaddy and the Shan states were all multi-ethnic polities. Despite the wars, cultural synchronisation continued. This period is considered a golden age for Burmese culture. Burmese literature \"grew more confident, popular, and stylistically diverse\", and the second generation of Burmese law codes as well as the earliest pan-Burma chronicles emerged.Lieberman, p. 134 Hanthawaddy monarchs introduced religious reforms that later spread to the rest of the country.Myint-U, pp. 64–65 Many splendid temples of Mrauk U were built during this period.\n\nTaungoo and colonialism \n\nPolitical unification returned in the mid-16th century, due to the efforts of Taungoo, a former vassal state of Ava. Taungoo's young, ambitious king Tabinshwehti defeated the more powerful Hanthawaddy in the Toungoo–Hanthawaddy War (1534–41). His successor Bayinnaung went on to conquer a vast swath of mainland Southeast Asia including the Shan states, Lan Na, Manipur, Mong Mao, the Ayutthaya Kingdom, Lan Xang and southern Arakan. However, the largest empire in the history of Southeast Asia unravelled soon after Bayinnaung's death in 1581, completely collapsing by 1599. Ayutthaya seized Tenasserim and Lan Na, and Portuguese mercenaries established Portuguese rule at Thanlyin (Syriam).\n\nThe dynasty regrouped and defeated the Portuguese in 1613 and Siam in 1614. It restored a smaller, more manageable kingdom, encompassing Lower Myanmar, Upper Myanmar, Shan states, Lan Na and upper Tenasserim. The Restored Toungoo kings created a legal and political framework whose basic features would continue well into the 19th century. The crown completely replaced the hereditary chieftainships with appointed governorships in the entire Irrawaddy valley, and greatly reduced the hereditary rights of Shan chiefs. Its trade and secular administrative reforms built a prosperous economy for more than 80 years. From the 1720s onward, the kingdom was beset with repeated Meithei raids into Upper Myanmar and a nagging rebellion in Lan Na. In 1740, the Mon of Lower Myanmar founded the Restored Hanthawaddy Kingdom. Hanthawaddy forces sacked Ava in 1752, ending the 266-year-old Toungoo Dynasty.\n\nAfter the fall of Ava, the Konbaung–Hanthawaddy War involved one resistance group under Alaungpaya defeating the Restored Hanthawaddy, and by 1759, he had reunited all of Myanmar and Manipur, and driven out the French and the British, who had provided arms to Hanthawaddy. By 1770, Alaungpaya's heirs had subdued much of Laos (1765) and fought and won the Burmese–Siamese War (1765–67) against Ayutthaya and the Sino-Burmese War (1765–69) against Qing China (1765–1769).Lieberman, pp. 184–187\n\nWith Burma preoccupied by the Chinese threat, Ayutthaya recovered its territories by 1770, and went on to capture Lan Na by 1776. Burma and Siam went to war until 1855, but all resulted in a stalemate, exchanging Tenasserim (to Burma) and Lan Na (to Ayutthaya). Faced with a powerful China and a resurgent Ayutthaya in the east, King Bodawpaya turned west, acquiring Arakan (1785), Manipur (1814) and Assam (1817). It was the second-largest empire in Burmese history but also one with a long ill-defined border with British India.Myint-U, p. 109\n\nThe breadth of this empire was short lived. Burma lost Arakan, Manipur, Assam and Tenasserim to the British in the First Anglo-Burmese War (1824–1826). In 1852, the British easily seized Lower Burma in the Second Anglo-Burmese War. King Mindon Min tried to modernise the kingdom, and in 1875 narrowly avoided annexation by ceding the Karenni States. The British, alarmed by the consolidation of French Indochina, annexed the remainder of the country in the Third Anglo-Burmese War in 1885.\n\nKonbaung kings extended Restored Toungoo's administrative reforms, and achieved unprecedented levels of internal control and external expansion. For the first time in history, the Burmese language and culture came to predominate the entire Irrawaddy valley. The evolution and growth of Burmese literature and theatre continued, aided by an extremely high adult male literacy rate for the era (half of all males and 5% of females).Lieberman, pp. 202–206 Nonetheless, the extent and pace of reforms were uneven and ultimately proved insufficient to stem the advance of British colonialism.\n\nBritish Burma (1824–1948) \n\nBurma in British India\n\nThe eighteenth century saw Burmese rulers, whose country had not previously been of particular interest to European traders, seek to maintain their traditional influence in the western areas of Assam, Manipur and Arakan. Pressing them, however, was the British East India Company, which was expanding its interests eastwards over the same territory. Over the next sixty years, diplomacy, raids, treaties and compromises continued until, after three Anglo-Burmese Wars (1824–1885), Britain proclaimed control over most of Burma. British rule brought social, economic, cultural and administrative changes.\n\nWith the fall of Mandalay, all of Burma came under British rule, being annexed on 1 January 1886. Throughout the colonial era, many Indians arrived as soldiers, civil servants, construction workers and traders and, along with the Anglo-Burmese community, dominated commercial and civil life in Burma. Rangoon became the capital of British Burma and an important port between Calcutta and Singapore.\n\nBurmese resentment was strong and was vented in violent riots that paralysed Yangon (Rangoon) on occasion all the way until the 1930s. Some of the discontent was caused by a disrespect for Burmese culture and traditions such as the British refusal to remove shoes when they entered pagodas. Buddhist monks became the vanguards of the independence movement. U Wisara, an activist monk, died in prison after a 166-day hunger strike to protest against a rule that forbade him to wear his Buddhist robes while imprisoned.\n\nSeparation of British Burma from British India\n\nOn 1 April 1937, Burma became a separately administered colony of Great Britain and Ba Maw the first Prime Minister and Premier of Burma. Ba Maw was an outspoken advocate for Burmese self-rule and he opposed the participation of Great Britain, and by extension Burma, in World War II. He resigned from the Legislative Assembly and was arrested for sedition. In 1940, before Japan formally entered the Second World War, Aung San formed the Burma Independence Army in Japan.\n\nA major battleground, Burma was devastated during World War II. By March 1942, within months after they entered the war, Japanese troops had advanced on Rangoon and the British administration had collapsed. A Burmese Executive Administration headed by Ba Maw was established by the Japanese in August 1942. Wingate's British Chindits were formed into long-range penetration groups trained to operate deep behind Japanese lines. A similar American unit, Merrill's Marauders, followed the Chindits into the Burmese jungle in 1943. Beginning in late 1944, allied troops launched a series of offensives that led to the end of Japanese rule in July 1945. The battles were intense with much of Burma laid waste by the fighting. Overall, the Japanese lost some 150,000 men in Burma. Only 1,700 prisoners were taken.\n\nAlthough many Burmese fought initially for the Japanese as part of the Burma Independence Army, many Burmese, mostly from the ethnic minorities, served in the British Burma Army. The Burma National Army and the Arakan National Army fought with the Japanese from 1942 to 1944 but switched allegiance to the Allied side in 1945. Under Japanese occupation, 170,000 to 250,000 civilians died.Michael Clodfelter. Warfare and Armed Conflicts: A Statistical Reference to Casualty and Other Figures, 1500–2000. 2nd Ed. 2002 . p. 556Werner Gruhl, Imperial Japan's World War Two, 1931–1945 Transaction 2007  (Werner Gruhl is former chief of NASA's Cost and Economic Analysis Branch with a lifetime interest in the study of the First and Second World Wars.)\n\nFollowing World War II, Aung San negotiated the Panglong Agreement with ethnic leaders that guaranteed the independence of Myanmar as a unified state. Aung Zan Wai, Pe Khin, Bo Hmu Aung, Sir Maung Gyi, Dr. Sein Mya Maung, Myoma U Than Kywe were among the negotiators of the historical Panglong Conference negotiated with Bamar leader General Aung San and other ethnic leaders in 1947. In 1947, Aung San became Deputy Chairman of the Executive Council of Myanmar, a transitional government. But in July 1947, political rivals assassinated Aung San and several cabinet members.\n\nIndependence (1948–1962) \n\nOn 4 January 1948, the nation became an independent republic, named the Union of Burma, with Sao Shwe Thaik as its first President and U Nu as its first Prime Minister. Unlike most other former British colonies and overseas territories, Burma did not become a member of the Commonwealth. A bicameral parliament was formed, consisting of a Chamber of Deputies and a Chamber of Nationalities, and multi-party elections were held in 1951–1952, 1956 and 1960.\n\nThe geographical area Burma encompasses today can be traced to the Panglong Agreement, which combined Burma Proper, which consisted of Lower Burma and Upper Burma, and the Frontier Areas, which had been administered separately by the British.\n\nIn 1961, U Thant, then the Union of Burma's Permanent Representative to the United Nations and former Secretary to the Prime Minister, was elected Secretary-General of the United Nations, a position he held for ten years. Among the Burmese to work at the UN when he was Secretary-General was a young Aung San Suu Kyi (daughter of Aung San), who went on to become winner of the 1991 Nobel Peace Prize.\n\nWhen the non-Burman ethnic groups pushed for autonomy or federalism, alongside having a weak civilian government at the centre, the military leadership staged a coup d’état in 1962. Though incorporated in the 1947 Constitution, successive military governments construed the use of the term ‘federalism’ as being anti-national, anti-unity and pro-disintegration.\n\nMilitary rule (1962–2011) \n\nOn 2 March 1962, the military led by General Ne Win took control of Burma through a coup d'état, and the government has been under direct or indirect control by the military since then. Between 1962 and 1974, Myanmar was ruled by a revolutionary council headed by the general. Almost all aspects of society (business, media, production) were nationalised or brought under government control under the Burmese Way to Socialism,Myint-U which combined Soviet-style nationalisation and central planning.\n\nA new constitution of the Socialist Republic of the Union of Burma was adopted in 1974. Until 1988, the country was ruled as a one-party system, with the General and other military officers resigning and ruling through the Burma Socialist Programme Party (BSPP). During this period, Myanmar became one of the world's most impoverished countries.\n\nThere were sporadic protests against military rule during the Ne Win years and these were almost always violently suppressed. On 7 July 1962, the government broke up demonstrations at Rangoon University, killing 15 students. In 1974, the military violently suppressed anti-government protests at the funeral of U Thant. Student protests in 1975, 1976, and 1977 were quickly suppressed by overwhelming force.\n\nIn 1988, unrest over economic mismanagement and political oppression by the government led to widespread pro-democracy demonstrations throughout the country known as the 8888 Uprising. Security forces killed thousands of demonstrators, and General Saw Maung staged a coup d'état and formed the State Law and Order Restoration Council (SLORC). In 1989, SLORC declared martial law after widespread protests. The military government finalised plans for People's Assembly elections on 31 May 1989. SLORC changed the country's official English name from the \"Socialist Republic of the Union of Burma\" to the \"Union of Myanmar\" in 1989.\n\nIn May 1990, the government held free elections for the first time in almost 30 years and the National League for Democracy (NLD), the party of Aung San Suu Kyi, won 392 out of a total 492 seats (i.e., 80% of the seats). However, the military junta refused to cede power and continued to rule the nation as SLORC until 1997, and then as the State Peace and Development Council (SPDC) until its dissolution in March 2011.\n\nOn 23 June 1997, Myanmar was admitted into the Association of Southeast Asian Nations (ASEAN). On 27 March 2006, the military junta, which had moved the national capital from Yangon to a site near Pyinmana in November 2005, officially named the new capital Naypyidaw, meaning \"city of the kings\".\n\nIn August 2007, an increase in the price of diesel and petrol led to the Saffron Revolution led by Buddhist monks that were dealt with harshly by the government. The government cracked down on them on 26 September 2007. The crackdown was harsh, with reports of barricades at the Shwedagon Pagoda and monks killed. There were also rumours of disagreement within the Burmese armed forces, but none was confirmed. The military crackdown against unarmed protesters was widely condemned as part of the international reactions to the Saffron Revolution and led to an increase in economic sanctions against the Burmese Government.\n\nIn May 2008, Cyclone Nargis caused extensive damage in the densely populated, rice-farming delta of the Irrawaddy Division. It was the worst natural disaster in Burmese history with reports of an estimated 200,000 people dead or missing, damage totalled to 10 billion US dollars, and as many as 1 million left homeless. In the critical days following this disaster, Myanmar's isolationist government was accused of hindering United Nations recovery efforts. Humanitarian aid was requested but concerns about foreign military or intelligence presence in the country delayed the entry of United States military planes delivering medicine, food, and other supplies.\n\nIn early August 2009, a conflict known as the Kokang incident broke out in Shan State in northern Myanmar. For several weeks, junta troops fought against ethnic minorities including the Han Chinese, Wa, and Kachin. During 8–12 August, the first days of the conflict, as many as 10,000 Burmese civilians fled to Yunnan province in neighbouring China.\n\nCivil wars \n\nCivil wars have been a constant feature of Myanmar's socio-political landscape since the attainment of independence in 1948. These wars are predominantly struggles for ethnic and sub-national autonomy, with the areas surrounding the ethnically Bamar central districts of the country serving as the primary geographical setting of conflict. Foreign journalists and visitors require a special travel permit to visit the areas in which Myanmar's civil wars continue.\n\nIn October 2012, the ongoing conflicts in Myanmar included the Kachin conflict, between the Pro-Christian Kachin Independence Army and the government; a civil war between the Rohingya Muslims, and the government and non-government groups in Rakhine State; and a conflict between the Shan, Lahu, and Karen minority groups, and the government in the eastern half of the country. In addition, al-Qaeda signalled an intention to become involved in Myanmar. In a video released on 3 September 2014, mainly addressed to India, the militant group's leader Ayman al-Zawahiri said al-Qaeda had not forgotten the Muslims of Myanmar and that the group was doing \"what they can to rescue you\". In response, the military raised its level of alertness, while the Burmese Muslim Association issued a statement saying Muslims would not tolerate any threat to their motherland.\n\nArmed conflict between ethnic Chinese rebels and the Myanmar Armed Forces have resulted in the Kokang offensive in February 2015. The conflict had forced 40,000 to 50,000 civilians to flee their homes and seek shelter on the Chinese side of the border. During the incident, the government of China was accused of giving military assistance to the ethnic Chinese rebels. Burmese officials have been historically \"manipulated\" and pressured by the Chinese government throughout Burmese modern history to create closer and binding ties with China, creating a Chinese satellite state in Southeast Asia.\"[http://www.rfa.org/english/news/myanmar/kokang-02132015185129.html Myanmar Kokang Rebels Deny Receiving Chinese Weapons]\". Radio Free Asia.  However, uncertainties exist as clashes between Burmese troops and local insurgent groups continue.\n\nDemocratic reforms \n\nThe goal of the Burmese constitutional referendum of 2008, held on 10 May 2008, is the creation of a \"discipline-flourishing democracy\". As part of the referendum process, the name of the country was changed from the \"Union of Myanmar\" to the \"Republic of the Union of Myanmar\", and general elections were held under the new constitution in 2010. Observer accounts of the 2010 election describe the event as mostly peaceful; however, allegations of polling station irregularities were raised, and the United Nations (UN) and a number of Western countries condemned the elections as fraudulent.\n\nThe military-backed Union Solidarity and Development Party declared victory in the 2010 elections, stating that it had been favoured by 80 percent of the votes; however, the claim was disputed by numerous pro-democracy opposition groups who asserted that the military regime had engaged in rampant fraud. One report documented 77 percent as the official turnout rate of the election. The military junta was dissolved on 30 March 2011.\n\nOpinions differ whether the transition to liberal democracy is underway. According to some reports, the military's presence continues as the label \"disciplined democracy\" suggests. This label asserts that the Burmese military is allowing certain civil liberties while clandestinely institutionalising itself further into Burmese politics. Such an assertion assumes that reforms only occurred when the military was able to safeguard its own interests through the transition—here, \"transition\" does not refer to a transition to a liberal democracy, but transition to a quasi-military rule.\n\nSince the 2010 election, the government has embarked on a series of reforms to direct the country towards liberal democracy, a mixed economy, and reconciliation, although doubts persist about the motives that underpin such reforms. The series of reforms includes the release of pro-democracy leader Aung San Suu Kyi from house arrest, the establishment of the National Human Rights Commission, the granting of general amnesties for more than 200 political prisoners, new labour laws that permit labour unions and strikes, a relaxation of press censorship, and the regulation of currency practices.\n\nThe impact of the post-election reforms has been observed in numerous areas, including ASEAN's approval of Myanmar's bid for the position of ASEAN chair in 2014; the visit by United States Secretary of State Hillary Clinton in December 2011 for the encouragement of further progress, which was the first visit by a Secretary of State in more than fifty years, during which Clinton met with the Burmese president and former military commander Thein Sein, as well as opposition leader Aung San Suu Kyi; and the participation of Aung San Suu Kyi's National League for Democracy (NLD) party in the 2012 by-elections, facilitated by the government's abolition of the laws that previously barred the NLD. As of July 2013, about 100 political prisoners remain imprisoned, while conflict between the Burmese Army and local insurgent groups continues.\n\nIn 1 April 2012 by-elections, the NLD won 43 of the 45 available seats; previously an illegal organisation, the NLD had not won a single seat under new constitution. The 2012 by-elections were also the first time that international representatives were allowed to monitor the voting process in Myanmar.\n\n2015 general elections \n\nGeneral elections were held on 8 November 2015. These were the first openly contested elections held in Myanmar since 1990. The results gave the National League for Democracy an absolute majority of seats in both chambers of the national parliament, enough to ensure that its candidate would become president, while NLD leader Aung San Suu Kyi is constitutionally barred from the presidency.\n\nThe new parliament convened on 1 February 2016 and, on 15 March 2016, Htin Kyaw was elected as the first non-military president since the military coup of 1962. On 6 April 2016, Aung San Suu Kyi assumed the newly created role of State Counsellor, a role akin to a Prime Minister.\n\nGeography \n\nMyanmar has a total area of 678500 km2. It lies between latitudes 9° and 29°N, and longitudes 92° and 102°E. As of February 2011, Myanmar consisted of 14 states and regions, 67 districts, 330 townships, 64 sub-townships, 377 towns, 2,914 Wards, 14,220 village tracts and 68,290 villages.\n\nMyanmar is bordered in the northwest by the Chittagong Division of Bangladesh and the Mizoram, Manipur, Nagaland and Arunachal Pradesh states of India. Its north and northeast border is with the Tibet Autonomous Region and Yunnan province for a Sino-Myanmar border total of 2185 km. It is bounded by Laos and Thailand to the southeast. Myanmar has 1930 km of contiguous coastline along the Bay of Bengal and Andaman Sea to the southwest and the south, which forms one quarter of its total perimeter.\n\nIn the north, the Hengduan Mountains form the border with China. Hkakabo Razi, located in Kachin State, at an elevation of 5881 m, is the highest point in Myanmar. Many mountain ranges, such as the Rakhine Yoma, the Bago Yoma, the Shan Hills and the Tenasserim Hills exist within Myanmar, all of which run north-to-south from the Himalayas.\n\nThe mountain chains divide Myanmar's three river systems, which are the Irrawaddy, Salween (Thanlwin), and the Sittaung rivers. The Irrawaddy River, Myanmar's longest river, nearly 2170 km long, flows into the Gulf of Martaban. Fertile plains exist in the valleys between the mountain chains. The majority of Myanmar's population lives in the Irrawaddy valley, which is situated between the Rakhine Yoma and the Shan Plateau.\n\nAdministrative divisions \n\nMyanmar is divided into seven states () and seven regions (), formerly called divisions. Regions are predominantly Bamar (that is, mainly inhabited by the dominant ethnic group). States, in essence, are regions that are home to particular ethnic minorities. The administrative divisions are further subdivided into districts, which are further subdivided into townships, wards, and villages.\n\nBelow are the number of districts, townships, cities/towns, wards, village groups and villages in each divisions and states of Myanmar as of 31 December 2001:List of Districts, Townships, Cities/Towns, Wards, Village Groups and Villages in Union of Myanmar published by Ministry of Home Affairs, Government of Union of Myanmar on 31 December 2001\n\nClimate \n\nMuch of the country lies between the Tropic of Cancer and the Equator. It lies in the monsoon region of Asia, with its coastal regions receiving over 5000 mm of rain annually. Annual rainfall in the delta region is approximately 2500 mm, while average annual rainfall in the Dry Zone in central Myanmar is less than 1000 mm. The Northern regions of Myanmar are the coolest, with average temperatures of 21 C. Coastal and delta regions have an average maximum temperature of 32 C.\n\nEnvironment \n\nMyanmar continues to perform badly in the global Environmental Performance Index (EPI) with an overall ranking of 153 out of 180 countries in 2016; among the worst in the South Asian region, only ahead of Bangladesh and Afghanistan. The EPI was established in 2001 by the World Economic Forum as a global gauge to measure how well individual countries perform in implementing the United Nations' Sustainable Development Goals. The environmental areas where Myanmar performs worst (ie. highest ranking) are air quality (174), health impacts of environmental issues (143) and biodiversity and habitat (142). Myanmar performs best (ie. lowest ranking) in environmental impacts of fisheries (21), but with declining fish stocks. Despite several issues, Myanmar also ranks 64 and scores very good (ie. a high percentage of 93.73%) in environmental effects of the agricultural industry because of an excellent management of the nitrogen cycle.EPI (2016): [http://epi.yale.edu/country/myanmar Myanmar]\n\nWildlife \n\nMyanmar's slow economic growth has contributed to the preservation of much of its environment and ecosystems. Forests, including dense tropical growth and valuable teak in lower Myanmar, cover over 49% of the country, including areas of acacia, bamboo, ironwood and Magnolia champaca. Coconut and betel palm and rubber have been introduced. In the highlands of the north, oak, pine and various rhododendrons cover much of the land.\n\nHeavy logging since the new 1995 forestry law went into effect has seriously reduced forest acreage and wildlife habitat. The lands along the coast support all varieties of tropical fruits and once had large areas of mangroves although much of the protective mangroves have disappeared. In much of central Myanmar (the Dry Zone), vegetation is sparse and stunted.\n\nTypical jungle animals, particularly tigers, occur sparsely in Myanmar. In upper Myanmar, there are rhinoceros, wild water buffalo, clouded leopard, wild boars, deer, antelope, and elephants, which are also tamed or bred in captivity for use as work animals, particularly in the lumber industry. Smaller mammals are also numerous, ranging from gibbons and monkeys to flying foxes. The abundance of birds is notable with over 800 species, including parrots, myna, peafowl, red junglefowl, weaverbirds, crows, herons, and barn owl. Among reptile species there are crocodiles, geckos, cobras, Burmese pythons, and turtles. Hundreds of species of freshwater fish are wide-ranging, plentiful and are very important food sources. For a list of protected areas, see List of protected areas of Myanmar.\n\nGovernment and politics \n\nThe constitution of Myanmar, its third since independence, was drafted by its military rulers and published in September 2008. The country is governed as a parliamentary system with a bicameral legislature (with an executive President accountable to the legislature), with 25% of the legislators appointed by the military and the rest elected in general elections.\n\nThe legislature, called the Pyidaungsu Hluttaw, is bicameral and made up of two houses: the 224-seat upper house Amyotha Hluttaw (House of Nationalities) and the 440-seat lower house Pyithu Hluttaw (House of Representatives). The upper house consists of 224 members, of whom 168 are directly elected and 56 are appointed by the Burmese Armed Forces. The lower house consists of 440 members, of whom 330 are directly elected and 110 are appointed by the armed forces.\n\nPolitical culture \n\nThe major political parties are the National League for Democracy and Union Solidarity and Development Party.\n\nMyanmar's army-drafted constitution was approved in a referendum in May 2008. The results, 92.4% of the 22 million voters with an official turnout of 99%, are considered suspect by many international observers and by the National League of Democracy with reports of widespread fraud, ballot stuffing, and voter intimidation.\n\nThe elections of 2010 resulted in a victory for the military-backed Union Solidarity and Development Party. Various foreign observers questioned the fairness of the elections. One criticism of the election was that only government sanctioned political parties were allowed to contest in it and the popular National League for Democracy was declared illegal. However, immediately following the elections, the government ended the house arrest of the democracy advocate and leader of the National League for Democracy, Aung San Suu Kyi, and her ability to move freely around the country is considered an important test of the military's movement toward more openness. After unexpected reforms in 2011, NLD senior leaders have decided to register as a political party and to field candidates in future by-elections.\n\nMyanmar's recent political history is underlined by its struggle to establish democratic structures amidst conflicting fractions. This political transition from a closely held military rule to a free democratic system is widely believed to be determining the future of Myanmar. The resounding victory of Aung San Suu Kyi's National League for Democracy in 2015 general elections has raised hope for a successful culmination of this transition.\n\nMyanmar rates as a corrupt nation on the Corruption Perceptions Index with a rank of 136th out of 176 countries worldwide, with 1st being least corrupt, .\n\nForeign relations \n\nThough the country's foreign relations, particularly with Western nations, have been strained, relations have thawed since the reforms following the 2010 elections. After years of diplomatic isolation and economic and military sanctions, the United States relaxed curbs on foreign aid to Myanmar in November 2011 and announced the resumption of diplomatic relations on 13 January 2012 The European Union has placed sanctions on Myanmar, including an arms embargo, cessation of trade preferences, and suspension of all aid with the exception of humanitarian aid.\n\nSanctions imposed by the United States and European countries against the former military government, coupled with boycotts and other direct pressure on corporations by supporters of the democracy movement, have resulted in the withdrawal from the country of most US and many European companies.\nOn 13 April 2012 British Prime Minister David Cameron called for the economic sanctions on Myanmar to be suspended in the wake of the pro-democracy party gaining 43 seats out of a possible 45 in the 2012 by-elections with the party leader, Aung San Suu Kyi becoming a member of the Burmese parliament.\n\nDespite Western isolation, Asian corporations have generally remained willing to continue investing in the country and to initiate new investments, particularly in natural resource extraction. The country has close relations with neighbouring India and China with several Indian and Chinese companies operating in the country. Under India's Look East policy, fields of co-operation between India and Myanmar include remote sensing, oil and gas exploration, information technology, hydro power and construction of ports and buildings.\n\nIn 2008, India suspended military aid to Myanmar over the issue of human rights abuses by the ruling junta, although it has preserved extensive commercial ties, which provide the regime with much-needed revenue. The thaw in relations began on 28 November 2011, when Belarusian Prime Minister Mikhail Myasnikovich and his wife Ludmila arrived in the capital, Naypyidaw, the same day as the country received a visit by US Secretary of State Hillary Clinton, who also met with pro-democracy opposition leader Aung San Suu Kyi. International relations progress indicators continued in September 2012 when Aung San Suu Kyi visited the United States followed by Myanmar's reformist president visit to the United Nations.\n\nIn May 2013, Thein Sein became the first Myanmar president to visit the White House in 47 years; the last Burmese leader to visit the White House was Ne Win in September 1966. President Barack Obama praised the former general for political and economic reforms, and the cessation of tensions between Myanmar and the United States. Political activists objected to the visit due to concerns over human rights abuses in Myanmar but Obama assured Thein Sein that Myanmar will receive US support. The two leaders discussed to release more political prisoners, the institutionalisation of political reform and rule of law, and ending ethnic conflict in Myanmar—the two governments agreed to sign a bilateral trade and investment framework agreement on 21 May 2013.\n\nIn June 2013, Myanmar held its first ever summit, the World Economic Forum on East Asia 2013. A regional spinoff of the annual World Economic Forum in Davos, Switzerland, the summit was held on 5–7 June and attended by 1,200 participants, including 10 heads of state, 12 ministers and 40 senior directors from around the world.\n\nMilitary \n\nMyanmar has received extensive military aid from China in the past.\nMyanmar has been a member of ASEAN since 1997. Though it gave up its turn to hold the ASEAN chair and host the ASEAN Summit in 2006, it chaired the forum and hosted the summit in 2014. In November 2008, Myanmar's political situation with neighbouring Bangladesh became tense as they began searching for natural gas in a disputed block of the Bay of Bengal. Controversy surrounding the Rohingya population also remains an issue between Bangladesh and Myanmar.\n\nMyanmar's armed forces are known as the Tatmadaw, which numbers 488,000. The Tatmadaw comprises the Army, the Navy, and the Air Force. The country ranked twelfth in the world for its number of active troops in service. The military is very influential in Myanmar, with all top cabinet and ministry posts usually held by military officials. Official figures for military spending are not available. Estimates vary widely because of uncertain exchange rates, but Myanmar's military forces' expenses are high. Myanmar imports most of its weapons from Russia, Ukraine, China and India.\n\nMyanmar is building a research nuclear reactor near Pyin Oo Lwin with help from Russia. It is one of the signatories of the nuclear non-proliferation pact since 1992 and a member of the International Atomic Energy Agency (IAEA) since 1957. The military junta had informed the IAEA in September 2000 of its intention to construct the reactor. The research reactor outbuilding frame was built by ELE steel industries limited of Yangon/Rangoon and water from Anisakhan/BE water fall will be used for the reactor cavity cooling system.\n\nIn 2010 as part of the Wikileaks leaked cables, Myanmar was suspected of using North Korean construction teams to build a fortified Surface-to-Air Missile facility.\n\nUntil 2005, the United Nations General Assembly annually adopted a detailed resolution about the situation in Myanmar by consensus. But in 2006 a divided United Nations General Assembly voted through a resolution that strongly called upon the government of Myanmar to end its systematic violations of human rights. In January 2007, Russia and China vetoed a draft resolution before the United Nations Security Council calling on the government of Myanmar to respect human rights and begin a democratic transition. South Africa also voted against the resolution.\n\nHuman rights and internal conflicts \n\nThere is consensus that the former military regime in Myanmar (1962–2010) was one of the world's most repressive and abusive regimes. In November 2012, Samantha Power, Barack Obama's Special Assistant to the President on Human Rights, wrote on the White House blog in advance of the president's visit that \"Serious human rights abuses against civilians in several regions continue, including against women and children.\" Members of the United Nations and major international human rights organisations have issued repeated and consistent reports of widespread and systematic human rights violations in Myanmar. The United Nations General Assembly has repeatedly called on the Burmese Military Junta to respect human rights and in November 2009 the General Assembly adopted a resolution \"strongly condemning the ongoing systematic violations of human rights and fundamental freedoms\" and calling on the Burmese Military Regime \"to take urgent measures to put an end to violations of international human rights and humanitarian law.\"\n\nInternational human rights organisations including Human Rights Watch, Amnesty International and the American Association for the Advancement of Science have repeatedly documented and condemned widespread human rights violations in Myanmar. The Freedom in the World 2011 report by Freedom House notes, \"The military junta has ... suppressed nearly all basic rights; and committed human rights abuses with impunity.\" In July 2013, the Assistance Association for Political Prisoners indicated that there were approximately 100 political prisoners being held in Burmese prisons.\n\nEvidence gathered by a British researcher was published in 2005 regarding the extermination or 'Burmisation' of certain ethnic minorities, such as the Karen, Karenni and Shan.\n\nChild soldiers \n\nChild soldiers had played a major part in the Burmese Army until around 2012. The Independent reported in June 2012 that \"Children are being sold as conscripts into the Burmese military for as little as $40 and a bag of rice or a can of petrol.\" The UN's Special Representative of the Secretary-General for Children and Armed Conflict, Radhika Coomaraswamy, who stepped down from her position a week later, met representatives of the Government of Myanmar on 5 July 2012 and stated that she hoped the government's signing of an action plan would \"signal a transformation.\" In September 2012, the Myanmar Armed Forces released 42 child soldiers and the International Labour Organization met with representatives of the government as well as the Kachin Independence Army to secure the release of more child soldiers. According to Samantha Power, a US delegation raised the issue of child soldiers with the government in October 2012. However, she did not comment on the government's progress towards reform in this area.\n\nA Bangkok Post article on 23 December 2012 reported that the Myanmar Armed Forces continued to use child soldiers including during the army's large offensive against the KIA in December 2012.\n\nChild/forced/slave labour, systematic sexual violence and human trafficking \n\nForced labour, human trafficking, and child labour are common. The military is also notorious for rampant use of sexual violence, a practice continuing . In 2007 the international movement to defend women's human rights issues in Myanmar was said to be gaining speed.\n\nGenocide allegations and crimes against Rohingya people \n\nThe Rohingya people have consistently faced human rights abuses by the Burmese regime that has refused to acknowledge them as Burmese citizens (despite some of them having lived in Burma for over three generations)—the Rohingya have been denied Burmese citizenship since the enactment of a 1982 citizenship law. The law created three categories of citizenship: citizenship, associate citizenship, and naturalised citizenship. Citizenship is given to those who belong to one of the national races such as Kachin, Kayah (Karenni), Karen, Chin, Burman, Mon, Rakhine, Shan, Kaman, or Zerbadee. Associate citizenship is given to those who cannot prove their ancestors settled in Myanmar before 1823, but can prove they have one grandparent, or pre-1823 ancestor, who was a citizen of another country, as well as people who applied for citizenship in 1948 and qualified then by those laws. Naturalised citizenship is only given to those who have at least one parent with one of these types of Burmese citizenship or can provide \"conclusive evidence\" that their parents entered and resided in Burma prior to independence in 1948. The Burmese regime has attempted to forcibly expel Rohingya and bring in non-Rohingyas to replace them—this policy has resulted in the expulsion of approximately half of the 800,000 Rohingya from Burma, while the Rohingya people have been described as \"among the world's least wanted\" and \"one of the world's most persecuted minorities.\" But the origin of 'most persecuted minority' statement is unclear.\n\nRohingya are also not allowed to travel without official permission, are banned from owning land and are required to sign a commitment to have no more than two children. As of July 2012, the Myanmar Government does not include the Rohingya minority group—classified as stateless Bengali Muslims from Bangladesh since 1982—on the government's list of more than 130 ethnic races and, therefore, the government states that they have no claim to Myanmar citizenship.\n\nIn 2007 the German professor Bassam Tibi suggested that the Rohingya conflict may be driven by an Islamist political agenda to impose religious laws, while non-religious causes have also been raised, such as a lingering resentment over the violence that occurred during the Japanese occupation of Burma in World War II—during this time period the British allied themselves with the Rohingya and fought against the puppet government of Burma (composed mostly of Bamar Japanese) that helped to establish the Tatmadaw military organisation that remains in power as of March 2013.\n\nSince the democratic transition began in 2011, there has been continuous violence as 280 people have been killed and 140,000 forced to flee from their homes in the Rakhine state. A UN envoy reported in March 2013 that unrest had re-emerged between Myanmar's Buddhist and Muslim communities, with violence spreading to towns that are located closer to Yangon.\n\nRohingya left by boat \n\nThe Rohingya have been leaving the Rakhine State by boat in search for jobs in Malaysia these recent years. Often, the boats are very small and dangerous on the open seas. An estimated 100,000 Rohingya have fled Myanmar in the last two years in fear of persecution and violence. They have been fleeing to Thailand, Malaysia, or even Australia for refuge. Over 200 have died in recent years and over 7,000 have been held in detention centres even after surviving the boat trip.\n\n2012 Rakhine State riots \n\nA widely publicised Burmese conflict was the 2012 Rakhine State riots, a series of conflicts that primarily involved the ethnic Rakhine Buddhist people and the Rohingya Muslim people in the northern Rakhine State—an estimated 90,000 people were displaced as a result of the riots.\n\nThe immediate cause of the riots is unclear, with many commentators citing the killing of ten Burmese Muslims by ethnic Rakhine after the rape and murder of a Rakhine woman as the main cause. Whole villages have been \"decimated\". Over 300 houses and a number of public buildings have been razed. According to Tun Khin, the president of the Burmese Rohingya Organisation UK (BROUK), as of 28 June 2012, 650 Rohingyas have been killed, 1,200 are missing, and more than 80,000 have been displaced. According to the Myanmar authorities, the violence, between ethnic Rakhine Buddhists and Rohingya Muslims, left 78 people dead, 87 injured, and thousands of homes destroyed. It displaced more than 52,000 people.\n\nThe government has responded by imposing curfews and by deploying troops in the regions. On 10 June 2012, a state of emergency was declared in Rakhine, allowing the military to participate in administration of the region. The Burmese army and police have been accused of targeting Rohingya Muslims through mass arrests and arbitrary violence. A number of monks' organisations that played a vital role in Myanmar's struggle for democracy have taken measures to block any humanitarian assistance to the Rohingya community.\n\nFreedom of speech \n\nRestrictions on media censorship were significantly eased in August 2012 following demonstrations by hundreds of protesters who wore shirts demanding that the government \"Stop Killing the Press.\" The most significant change has come in the form that media organisations will no longer have to submit their content to a censorship board before publication. However, as explained by one editorial in the exiled press The Irrawaddy, this new \"freedom\" has caused some Burmese journalists to simply see the new law as an attempt to create an environment of self-censorship as journalists \"are required to follow 16 guidelines towards protecting the three national causes — non-disintegration of the Union, non-disintegration of national solidarity, perpetuation of sovereignty — and \"journalistic ethics\" to ensure their stories are accurate and do not jeopardise national security.\" In July 2014 five journalists were sentenced to 10 years in jail after publishing a report saying the country was planning to build a new chemical weapons plant. Journalists described the jailings as a blow to the recently-won news media freedoms that had followed five decades of censorship and persecution. Two Reuters journalists were charged and imprisoned on December 12, 2017, for violating state secrets law when they were covering the mass exodus of the Rohingya Muslim minority.Eltagouri,  Marwa. (13 December 2017). \"Two journalists covering Rohingya crisis in Burma arrested for possessing ‘secret papers’.[https://www.washingtonpost.com/news/worldviews/wp/2017/12/13/two-journalists-covering-rohingya-crisis-in-burma-arrested-for-possessing-secret-papers/?tid=sm_tw Washington Post website]  Retrieved 13 December 2017.\n\nPraise for the 2011 government reforms \n\nAccording to the Crisis Group, since Myanmar transitioned to a new government in August 2011, the country's human rights record has been improving. Previously giving Myanmar its lowest rating of 7, the 2012 Freedom in the World report also notes improvement, giving Myanmar a 6 for improvements in civil liberties and political rights, the release of political prisoners, and a loosening of restrictions. In 2013, Myanmar improved yet again, receiving a score of five in civil liberties and a six in political freedoms.\n\nThe government has assembled a National Human Rights Commission that consists of 15 members from various backgrounds. Several activists in exile, including Thee Lay Thee Anyeint members, have returned to Myanmar after President Thein Sein's invitation to expatriates to return home to work for national development. In an address to the United Nations Security Council on 22 September 2011, Myanmar's Foreign Minister Wunna Maung Lwin confirmed the government's intention to release prisoners in the near future.\n\nThe government has also relaxed reporting laws, but these remain highly restrictive. In September 2011, several banned websites, including YouTube, Democratic Voice of Burma and Voice of America, were unblocked. A 2011 report by the Hauser Center for Nonprofit Organizations found that, while contact with the Myanmar government was constrained by donor restrictions, international humanitarian non-governmental organisations (NGOs) see opportunities for effective advocacy with government officials, especially at the local level. At the same time, international NGOs are mindful of the ethical quandary of how to work with the government without bolstering or appeasing it.[https://web.archive.org/web/20120114003421/http://www.hks.harvard.edu/hauser/engage/humanitarianorganizations/research/assets/Myanmar%20Report%20Final%20Version%209-8-11.pdf Working Through Ambiguity: International NGOs in Myanmar]. Soubhik Ronnie Saha The Hauser Center for Nonprofit Organizations Harvard University September 2011\n\n2013 onwards \n\nFollowing Thein Sein's first ever visit to the UK and a meeting with Prime Minister David Cameron, the Myanmar president declared that all of his nation's political prisoners will be released by the end of 2013, in addition to a statement of support for the well-being of the Rohingya Muslim community. In a speech at Chatham House, he revealed that \"We [Myanmar government] are reviewing all cases. I guarantee to you that by the end of this year, there will be no prisoners of conscience in Myanmar.\", in addition to expressing a desire to strengthen links between the UK and Myanmar's military forces. Homosexual acts are illegal in Myanmar. In 2016, Myanmar leader Aung San Suu Kyi was accused of failing to protect Myanmar's Muslim minority.\"[https://www.independent.co.uk/news/world/asia/rohingya-muslims-burma-myanmar-aung-san-suu-kyi-legitimising-genocide-a7439151.html Burma's Aung San Suu Kyi accused of 'legitimising genocide of Rohingya Muslims']\". The Independent. 25 November 2016. Since August 2017 Doctors Without Borders have treated 113 Rohingya refugee females for sexual assault with all but one describing military assailants.AP News. (12 December 2017). \"Army's rape of Rohingya women sweeping, methodical: AP\". [http://www.aljazeera.com/news/2017/12/rape-rohingya-women-sweeping-methodical-ap-171211063236832.html Al Jazeera website] Retrieved 12 December 2017.\n\nNuclear weapons programme \n\nThere has been speculation that Myanmar is interested in developing nuclear weapons, and that North Korea was planning to export nuclear technology to Myanmar.[http://www.smh.com.au/world/Myanmarx2019s-nuclear-secrets-20090731-e4fv.html Myanmar's nuclear secrets], The Sydney Morning Herald. 1 August 2009.   These reports are based on evidence gathered from anti-government Burmese. Myanmar is a signatory to a special ASEAN treaty that bans all types of nuclear weapons in signatory states in Southeast Asia.[https://www.theguardian.com/world/2005/apr/21/Myanmar.simonjeffery Revealed:]\n\nEconomy \n\nMyanmar is one of the poorest nations in Southeast Asia, suffering from decades of stagnation, mismanagement and isolation. The lack of an educated workforce skilled in modern technology hinders Myanmar's economy, although recent reforms and developments carried out by the new government, in collaboration with foreign countries and organisations aim to make this a thing of the past.\n\nMyanmar lacks adequate infrastructure. Goods travel primarily across the Thai border (where most illegal drugs are exported) and along the Irrawaddy River. Railways are old and rudimentary, with few repairs since their construction in the late 19th century. Highways are normally unpaved, except in the major cities.\n\nIn 2010–2011, Bangladesh exported products worth $9.65 million to Myanmar against its import of $179 million.  The annual import of medicine and medical equipment to Myanmar during the 2000s was 160 million USD.\n\nIn recent years, both China and India have attempted to strengthen ties with the government for economic benefit. Many nations, including the United States and Canada, and the European Union, have imposed investment and trade sanctions on Myanmar. The United States and European Union eased most of their sanctions in 2012. Foreign investment comes primarily from China, Singapore, the Philippines, South Korea, India, and Thailand.\n\nEconomic history \n\nUnder British administration, Myanmar was the second-wealthiest country in South-East Asia. It had been the world's largest exporter of rice. Myanmar also had a wealth of natural and labour resources. British Burma began exporting crude oil in 1853, making it one of the earliest petroleum producers in the world. It produced 75% of the world's teak and had a highly literate population. The wealth was however, mainly concentrated in the hands of Europeans. In the 1930s, agricultural production fell dramatically as international rice prices declined, and did not recover for several decades. Plans to broaden the new prosperity and extend the reach of modern civilization were halted by the outbreak of the Second World War.\n\nDuring the Japanese invasion of the area in World War II, the British followed a scorched earth policy. They destroyed the major government buildings, oil wells and mines for tungsten, tin, lead and silver to keep them from the Japanese. Myanmar was bombed extensively by both sides. After independence, the country was in ruins with its major infrastructure completely destroyed. The British then granted independence to the colony, and handed over their plans to rebuild to the new government. After a parliamentary government was formed in 1948, Prime Minister U Nu embarked upon a policy of nationalisation and the state was declared the owner of all land. The government also tried to implement a poorly considered Eight-Year plan. By the 1950s, rice exports had fallen by two thirds and mineral exports by over 96% (as compared to the pre-World War II period). Plans were partly financed by printing money, which led to inflation.\n\nThe 1962 coup d'état was followed by an economic scheme called the Burmese Way to Socialism, a plan to nationalise all industries, with the exception of agriculture. The catastrophic programme turned Myanmar into one of the world's most impoverished countries. Myanmar's admittance to least developed country status by the UN in 1987 highlighted its economic bankruptcy.\n\nIn Myanmar, political and economic ideological struggles have affected living standards. Decades of civil war and unrest have contributed to Myanmar's current levels of poverty and lack of economic progress. Improving basic human, social and economic infrastructure required to advance individual living standards have not received focused government efforts.\n\nAgriculture \n\nThe major agricultural product is rice, which covers about 60% of the country's total cultivated land area. Rice accounts for 97% of total food grain production by weight. Through collaboration with the International Rice Research Institute 52 modern rice varieties were released in the country between 1966 and 1997, helping increase national rice production to 14 million tons in 1987 and to 19 million tons in 1996. By 1988, modern varieties were planted on half of the country's ricelands, including 98 percent of the irrigated areas. , Facts About Cooperation, International Rice Research Institute. Retrieved 25 September 2007. In 2008 rice production was estimated at 50 million tons.\n\nDrug production \n\nMyanmar is also the world's second largest producer of opium, accounting for 25% of entire world production and is a major source of illegal drugs, including amphetamines.\nOpium bans implemented since 2002 after international pressure have left ex-poppy farmers without sustainable sources of income in the Kokang and Wa regions. They depend on casual labour for income.[http://www.tni.org/briefing/golden-triangle-rubber-belt Drug Policy Briefing nr.29] of the Transnational Institute.\n\nNatural resources \n\nMyanmar produces precious stones such as rubies, sapphires, pearls, and jade. Rubies are the biggest earner; 90% of the world's rubies come from the country, whose red stones are prized for their purity and hue. Thailand buys the majority of the country's gems. Myanmar's \"Valley of Rubies\", the mountainous Mogok area, 200 km north of Mandalay, is noted for its rare pigeon's blood rubies and blue sapphires.\n\nMany US and European jewellery companies, including Bulgari, Tiffany and Cartier, refuse to import these stones based on reports of deplorable working conditions in the mines. Human Rights Watch has encouraged a complete ban on the purchase of Burmese gems based on these reports and because nearly all profits go to the ruling junta, as the majority of mining activity in the country is government-run. The government of Myanmar controls the gem trade by direct ownership or by joint ventures with private owners of mines.\n\nOther industries include agricultural goods, textiles, wood products, construction materials, gems, metals, oil and natural gas.\n\nMyanmar Engineering Society has identified at least 39 locations capable of geothermal power production and some of these hydrothermal reservoirs lie quite close to Yangon which is a significant underutilized resource for electrical production.\n\nTourism \n\nSince 1992, the government has encouraged tourism in the country; however, fewer than 270,000 tourists entered the country in 2006 according to the Myanmar Tourism Promotion Board. Myanmar's Minister of Hotels and Tourism Saw Lwin has stated that the government receives a significant percentage of the income of private sector tourism services.\n\nThe most popular available tourist destinations in Myanmar include big cities such as Yangon and Mandalay; religious sites in Mon State, Pindaya, Bago and Hpa-An; nature trails in Inle Lake, Kengtung, Putao, Pyin Oo Lwin; ancient cities such as Bagan and Mrauk-U; as well as beaches in Nabule, Ngapali, Ngwe-Saung, Mergui. Nevertheless, much of the country is off-limits to tourists, and interactions between foreigners and the people of Myanmar, particularly in the border regions, are subject to police scrutiny. They are not to discuss politics with foreigners, under penalty of imprisonment and, in 2001, the Myanmar Tourism Promotion Board issued an order for local officials to protect tourists and limit \"unnecessary contact\" between foreigners and ordinary Burmese people.\n\nThe most common way for travellers to enter the country seems to be by air. According to the website Lonely Planet, getting into Myanmar is problematic: \"No bus or train service connects Myanmar with another country, nor can you travel by car or motorcycle across the border – you must walk across.\", and states that, \"It is not possible for foreigners to go to/from Myanmar by sea or river.\" There are a small number of border crossings that allow the passage of private vehicles, such as the border between Ruili (China) to Mu-se, the border between Htee Kee (Myanmar) and Phu Nam Ron (Thailand)—the most direct border between Dawei and Kanchanaburi, and the border between Myawaddy (Myanmar) and Mae Sot (Thailand). At least one tourist company has successfully run commercial overland routes through these borders since 2013.[http://www.dragoman.com/holidays/details/south-east-asia-between-kunming-and-bangkok-via-burma Dragoman]  \"From Mae Sai (Thailand) you can cross to Tachileik, but can only go as far as Kengtung. Those in Thailand on a visa run can cross to Kawthaung but cannot venture farther into Myanmar.\"\n\nFlights are available from most countries, though direct flights are limited to mainly Thai and other ASEAN airlines. According to Eleven magazine, \"In the past, there were only 15 international airlines and increasing numbers of airlines have began launching direct flights from Japan, Qatar, Taiwan, South Korea, Germany and Singapore.\" Expansions were expected in September 2013, but yet again are mainly Thai and other Asian-based airlines according to Eleven Media Group's Eleven, \"Thailand-based Nok Air and Business Airlines and Singapore-based Tiger Airline\".\n\nEconomic sanctions \n\nThe Government of Myanmar was under economic sanctions by the US Treasury Department (31 CFR Part 537, 16 August 2005) and by Executive orders 13047 (1997), 13310 (2003), 13448 (2007), 13464 (2008), and the most recent, 13619 (2012). There exists debate as to the extent to which the American-led sanctions have had more adverse effects on the civilian population than on the military rulers.\n\nFrom May 2012 to February 2013, the United States began to lift its economic sanctions on Myanmar \"in response to the historic reforms that have been taking place in that country.\" Sanctions remain in place for blocked banks  and for any business entities that are more than 50% owned by persons on \"OFAC's Specially Designated Nationals and Blocked Persons list (SDN list)\".\n\nDuring her first official visit to Washington, D.C. in September 2016, Myanmar's State Counsellor Aung San Suu Kyi met with US President Barack Obama, who announced that long-standing trade sanctions against Myanmar are to be lifted, adding, \"It is the right thing to do to ensure the people of Burma see rewards from a new way of doing business, and a new government.\"[http://www.bbc.com/news/world-africa-37365835], BBC News Services, retrieved 30 September 2016\n\nGovernment stakeholders in business \n\nThe military has the majority stakeholder position in all of the major industrial corporations of the country (from oil production and consumer goods to transportation and tourism).\n\nEconomic liberalisation, post–2011 \n\nIn March 2012, a draft foreign investment law emerged, the first in more than 2 decades. Foreigners will no longer need a local partner to start a business in the country, and will be able to legally lease but not own property. The draft law also stipulates that Burmese citizens must constitute at least 25% of the firm's skilled workforce, and with subsequent training, up to 50–75%.\n\nIn 2012, the Asian Development Bank formally began re-engaging with the country, to finance infrastructure and development projects in the country. The United States, Japan, and the European Union countries have also begun to reduce or eliminate economic sanctions to allow foreign direct investment which will provide the Burmese government with additional tax revenue.\n\nIn December 2014, Myanmar signed an agreement to set up its first stock exchange. The Yangon Stock Exchange Joint Venture Co. Ltd will be set up with Myanma Economic Bank sharing 51%, Japan's Daiwa Institute of Research Ltd 30.25% and Japan Exchange Group 18.75%. The Yangon Stock Exchange (YSX) officially opened for business on Friday, 25 March 2016. First Myanmar Investment Co., Ltd. (FMI) became the first stock to be traded after receiving approval for an opening price of 26,000 kyats ($22).\n\nUnits of measurement \n\nAccording to The World Factbook, Myanmar is one of three countries along with Liberia and the United States that has not adopted the International System of Units (SI) metric system as their official system of weights and measures. The common units of measure are unique to Myanmar, but the government web pages generally use both imperial units and metric units.\n\nIn June 2011, the Burmese government's Ministry of Commerce began discussing proposals to reform the measurement system and adopt the International System of Units used by most of its trading partners.  In October 2013 it was reported that Dr. Pwint San, Deputy Minister for Commerce, had announced that the country was preparing to adopt the International System of Units.\n\nSociety \n\nDemographics \n\nThe provisional results of the 2014 Myanmar Census show that the total population is 51,419,420. This figure includes an estimated 1,206,353 persons in parts of northern Rakhine State, Kachin State and Kayin State who were not counted. People who were out of the country at the time of the census are not included in these figures. There are over 600,000 registered migrant workers from Myanmar in Thailand, and millions more work illegally. Burmese migrant workers account for 80% of Thailand's migrant workers. Population density is 76 /km2, among the lowest in Southeast Asia.\n\nMyanmar's fertility rate  is 2.23, which is slightly above replacement level and is low compared to Southeast Asian countries of similar economic standing, such Cambodia (3.18) and Laos (4.41). There has been a significant decline in fertility, from a rate of 4.7 children per woman in 1983, down to 2.4 in 2001, despite the absence of any national population policy. The fertility rate is much lower in urban areas.\n\nThe relatively rapid decline in fertility is attributed to several factors, including extreme delays in marriage (almost unparalleled among developing countries in the region), the prevalence of illegal abortions, and the high proportion of single, unmarried women of reproductive age, with 25.9% of women aged 30–34 and 33.1% of men and women aged 25–34 single.[https://www.un.org/esa/population/publications/worldmarriage/worldmarriagepatterns2000.pdf WorldMarriage Patterns 2000]. United Nations\n\nThese patterns stem from economic dynamics. The economic hardship, which results in the delay of marriage and family-building; the average age of marriage in Myanmar is 27.5 for men, 26.4 for women.\n\nLargest cities \n\nEthnic groups \n\nMyanmar is ethnically diverse. The government recognises 135 distinct ethnic groups. There are at least 108 different ethnolinguistic groups in Myanmar, consisting mainly of distinct Tibeto-Burman peoples, but with sizeable populations of Tai–Kadai, Hmong–Mien, and Austroasiatic (Mon–Khmer) peoples.\n\nThe Bamar form an estimated 68% of the population. 10% of the population are Shan. The Kayin make up 7% of the population. The Rakhine people constitute 4% of the population. Overseas Chinese form approximately 3% of the population. Myanmar's ethnic minority groups prefer the term \"ethnic nationality\" over \"ethnic minority\" as the term \"minority\" furthers their sense of insecurity in the face of what is often described as \"Burmanisation\"—the proliferation and domination of the dominant Bamar culture over minority cultures.\n\nMon, who form 2% of the population, are ethno-linguistically related to the Khmer. Overseas Indians are 2%. The remainder are Kachin, Chin, Rohingya, Anglo-Indians, Gurkha, Nepali and other ethnic minorities. Included in this group are the Anglo-Burmese. Once forming a large and influential community, the Anglo-Burmese left the country in steady streams from 1958 onwards, principally to Australia and the UK. It is estimated that 52,000 Anglo-Burmese remain in Myanmar. , 110,000 Burmese refugees were living in refugee camps in Thailand.\n\nRefugee camps exist along Indian, Bangladeshi and Thai borders while several thousand are in Malaysia. Conservative estimates state that there are over 295,800 minority refugees from Myanmar, with the majority being Rohingya, Karen, and Karenni are principally located along the Thai-Myanmar border. There are nine permanent refugee camps along the Thai-Myanmar border, most of which were established in the mid-1980s. The refugee camps are under the care of the [http://www.tbbc.org/ Thai-Burma Border Consortium (TBBC)]. Since 2006, over 55,000 Burmese refugees have been resettled in the United States.\"[https://web.archive.org/web/20120914041135/http://www.acf.hhs.gov/programs/orr/data/ Office Of Refugee Resettlement: Data]\". U.S. Department of Health and Human Services.\n\nThe persecution of Burmese Indians, Burmese Chinese and other ethnic groups after the military coup headed by General Ne Win in 1962 led to the expulsion or emigration of 300,000 people. They migrated to escape racial discrimination and the wholesale nationalisation of private enterprise that took place in 1964. The Anglo-Burmese at this time either fled the country or changed their names and blended in with the broader Burmese society.\n\nMany Rohingya Muslims have fled Myanmar. Many refugees headed to neighbouring Bangladesh, including 200,000 in 1978 as a result of the King Dragon operation in Arakan. 250,000 more left in 1991.\n\nLanguages \n\nMyanmar is home to four major language families: Sino-Tibetan, Tai–Kadai, Austro-Asiatic, and Indo-European. Sino-Tibetan languages are most widely spoken. They include Burmese, Karen, Kachin, Chin, and Chinese (mainly Hokkien). The primary Tai–Kadai language is Shan. Mon, Palaung, and Wa are the major Austroasiatic languages spoken in Myanmar. The two major Indo-European languages are Pali, the liturgical language of Theravada Buddhism, and English. More than a hundred languages are spoken in total. Since many of them are known only within small tribes around the country, they may have been lost (many if not all) after a few generations.\n\nBurmese, the mother tongue of the Bamar and official language of Myanmar, is related to Tibetan and Chinese. It is written in a script consisting of circular and semi-circular letters, which were adapted from the Mon script, which in turn was developed from a southern Indian script in the 5th century. The earliest known inscriptions in the Burmese script date from the 11th century. It is also used to write Pali, the sacred language of Theravada Buddhism, as well as several ethnic minority languages, including Shan, several Karen dialects, and Kayah (Karenni), with the addition of specialised characters and diacritics for each language.\n\nThe Burmese language incorporates widespread usage of honorifics and is age-oriented. Burmese society has traditionally stressed the importance of education. In villages, secular schooling often takes place in monasteries. Secondary and tertiary education take place at government schools.\n\nReligion \n\nMany religions are practised in Myanmar. Religious edifices and orders have been in existence for many years. Festivals can be held on a grand scale. The Christian and Muslim populations do, however, face religious persecution and it is hard, if not impossible, for non-Buddhists to join the army or get government jobs, the main route to success in the country.\"Ethnic and Religious Diversity: Myanmar's Unfolding Nemesis\", Matthews, Bruce, Institute of South East Asian Studies, Visiting Researcher Series, Volume 2001, No. 3. 2001. Such persecution and targeting of civilians is particularly notable in Eastern Myanmar, where over 3000 villages have been destroyed in the past ten years. More than 200,000 Muslims have fled to Bangladesh over the last 20 years to escape persecution.\n\nA large majority of the population practices Buddhism; estimates range from 80%[http://www.globalreligiousfutures.org/countries/burma-myanmar/religious_demography#/?affiliations_religion_id\n0&affiliations_year2010 Pew Research Center's Religion & Public Life Project: Burma]. Pew Research Center. 2010. to 89%. According to 2014 Myanmar Census, 87.9% of the population identifies as Buddhists. Theravāda Buddhism is the most widespread. Other religions are practised largely without obstruction, with the notable exception of some religious minorities such as the Rohingya people, who have continued to have their citizenship status denied and treated as illegal immigrants instead, and Christians in Chin State.\n\nAccording to 2014 census, 6.2% of the population identifies as Christian; 4.3% as Muslim; 0.8% as followers of tribal religions; 0.5% as Hindus; 0.2% as followers of other religions; and 0.1% follow no religion. According to the 2010 estimates of the Pew Research Center, 7% of the population is Christian; 4% is Muslim; 1% follows traditional animistic beliefs; and 2% follow other religions, including Mahayana Buddhism, Hinduism, and East Asian religions. Jehovah's Witnesses have been present since 1914 and have about 80 congregations around the country and a branch office in Yangon publishing in 16 languages.\nA tiny Jewish community in Rangoon had a synagogue but no resident rabbi to conduct services.\n\nAlthough Hinduism is practised by 0.5% of the population, it was a major religion in Myanmar's past. Several strains of Hinduism existed alongside both Theravada Buddhism and Mahayana Buddhism in the Mon and Pyu period in the first millennium, and down to the Pagan period (9th to 13th centuries) when \"Saivite and Vaishana elements enjoyed greater elite influence than they would later do.\"Lieberman, pp. 115–116 Burmese folk religion is practiced by many Bamars alongside Buddhism.\n\nHealth \n\nThe general state of health care in Myanmar is poor. The government spends anywhere from 0.5% to 3% of the country's GDP on health care, consistently ranking among the lowest in the world. Although health care is nominally free, in reality, patients have to pay for medicine and treatment, even in public clinics and hospitals. Public hospitals lack many of the basic facilities and equipment.\n\nThe 2010 maternal mortality rate per 100,000 births for Myanmar is 240. This is compared with 219.3 in 2008 and 662 in 1990. The under 5 mortality rate, per 1,000 births is 73 and the neonatal mortality as a percentage of under 5's mortality is 47.\n\nMyanmar's government spends the least percentage of its GDP on health care of any country in the world, and international donor organisations give less to Myanmar, per capita, than any other country except India.[https://web.archive.org/web/20090225081933/http://www.msf.org/source/countries/asia/myanmar/2008/PreventableFate/PreventableFatereport.pdf A preventable fate: The failure of ART scale-up in Myanmar]. Médecins Sans Frontières. November 2008 According to the report named \"Preventable Fate\", published by Doctors without Borders, 25,000 Burmese AIDS patients died in 2007, deaths that could largely have been prevented by antiretroviral therapy drugs and proper treatment.\n\nHIV/AIDS, recognised as a disease of concern by the Burmese Ministry of Health, is most prevalent among sex workers and intravenous drug users. In 2005, the estimated adult HIV prevalence rate in Myanmar was 1.3% (200,000–570,000 people), according to UNAIDS, and early indicators of any progress against the HIV epidemic are inconsistent. However, the National AIDS Programme Myanmar found that 32% of sex workers and 43% of intravenous drug users in Myanmar have HIV.\n\nEducation \n\nAccording to the UNESCO Institute of Statistics, Myanmar's official literacy rate as of 2000 was 90%. Historically, Myanmar has had high literacy rates. To qualify for least developed country status by the UN to receive debt relief, Myanmar lowered its official literacy rate from 79% to 19% in 1987. \n\nThe educational system of Myanmar is operated by the government agency, the Ministry of Education. The education system is based on the United Kingdom's system due to nearly a century of British and Christian presences in Myanmar. Nearly all schools are government-operated, but there has been a recent increase in privately funded English language schools. Schooling is compulsory until the end of elementary school, approximately about 9 years old, while the compulsory schooling age is 15 or 16 at international level.\n\nThere are 101 universities, 12 institutes, 9 degree colleges and 24 colleges in Myanmar, a total of 146 higher education institutions.Chronicle of National Development Comparison Between Period Preceding 1988 and after (up to 31 December 2006). There are 10 Technical Training Schools, 23 nursing training schools, 1 sport academy and 20 midwifery schools. There are 2047 Basic Education High Schools, 2605 Basic Education Middle Schools, 29944 Basic Education Primary Schools and 5952 Post Primary Schools. 1692 multimedia classrooms exist within this system.\n\nThere are four international schools acknowledged by WASC and College Board—The International School Yangon (ISY), Myanmar International School (MIS), Yangon International School (YIS) and International School of Myanmar (ISM) in Yangon.\n\nCrime \n\nIn 2012, Myanmar had a murder rate of 15.2 per 100,000 population. There were a total of 8,044 murders in Myanmar in 2012. Factors influencing Myanmar's high murder rate include communal violence and armed conflict. Myanmar is one of the world's most corrupt nations. The 2012 Transparency International Corruption Perceptions Index ranked the country at number 171, out of 176 countries in total.\n\nMyanmar is the world's second largest producer of opium after Afghanistan, producing some 25% of the world's opium, and forms part of the Golden Triangle. The opium industry was a monopoly during colonial times and has since been illegally operated by corrupt officials in the Burmese military and rebel fighters, primarily as the basis for heroin manufacture.\n\nMyanmar is the largest producer of methamphetamines in the world, with the majority of Ya ba found in Thailand produced in Myanmar, particularly in the Golden Triangle and Northeastern Shan State, which borders Thailand, Laos and China. Burmese-produced ya ba is typically trafficked to Thailand via Laos, before being transported through the northeastern Thai region of Isan.\n\nCulture \n\nA diverse range of indigenous cultures exist in Myanmar, the majority culture is primarily Buddhist and Bamar. Bamar culture has been influenced by the cultures of neighbouring countries. This is manifested in its language, cuisine, music, dance and theatre. The arts, particularly literature, have historically been influenced by the local form of Theravada Buddhism. Considered the national epic of Myanmar, the Yama Zatdaw, an adaptation of India's Ramayana, has been influenced greatly by Thai, Mon, and Indian versions of the play. Buddhism is practised along with nat worship, which involves elaborate rituals to propitiate one from a pantheon of 37 nats.\n\nIn a traditional village, the monastery is the centre of cultural life. Monks are venerated and supported by the lay people. A novitiation ceremony called shinbyu is the most important coming of age events for a boy, during which he enters the monastery for a short time. All male children in Buddhist families are encouraged to be a novice (beginner for Buddhism) before the age of twenty and to be a monk after the age of twenty. Girls have ear-piercing ceremonies () at the same time. Burmese culture is most evident in villages where local festivals are held throughout the year, the most important being the pagoda festival. Many villages have a guardian nat, and superstition and taboos are commonplace.\n\nBritish colonial rule introduced Western elements of culture to Myanmar. Myanmar's education system is modelled after that of the United Kingdom. Colonial architectural influences are most evident in major cities such as Yangon. Many ethnic minorities, particularly the Karen in the southeast and the Kachin and Chin who populate the north and northeast, practice Christianity. According to The World Factbook, the Burman population is 68% and the ethnic groups constitute 32%. However, the exiled leaders and organisations claims that ethnic population is 40%, which is implicitly contrasted with CIA report (official US report).\n\nCuisine \n\nBurmese cuisine is characterised by extensive use of fish products such as fish sauce, ngapi (fermented seafood) and dried prawn.\n\nMohinga is the traditional breakfast dish and is Myanmar's national dish. Seafood is a common ingredient in coastal cities such as Sittwe, Kyaukpyu, Mawlamyaing (formerly Moulmein), Mergui (Myeik) and Dawei, while meat and poultry are more commonly used in landlocked cities like Mandalay. Freshwater fish and shrimp have been incorporated into inland cooking as a primary source of protein and are used in a variety of ways, fresh, salted whole or filleted, salted and dried, made into a salty paste, or fermented sour and pressed.\n\nBurmese cuisine also includes a variety of salads (a thoke), centred on one major ingredient, ranging from starches like rice, wheat and rice noodles, glass noodles and vermicelli, to potato, ginger, tomato, kaffir lime, long bean, lahpet (pickled tea leaves), and ngapi (fish paste).\n\nSport \n\nThe Lethwei, Bando, Banshay, and Pongyi thaing martial arts and chinlone are traditional sports in Myanmar. Football is played all over the country, even in villages.\n\nThe 2013 Southeast Asian Games took place in Naypyidaw, Yangon, Mandalay and Ngwesaung Beach in December representing the third occasion that the event has been staged in Myanmar. Myanmar previously hosted the Games in 1961 and 1969.\n\nArt \n\nBurmese contemporary art has developed rather on its own terms and quite rapidly. While most young artists born after 1980s have greater chances of art practice outside the country.\n\nOne of the first to study western art was Ba Nyan. Together with Ngwe Gaing and a handful of other artists were the pioneers of western painting style. Later on most young children learned the concepts from them. Some well known contemporary artists are Lun Gywe, Aung Kyaw Htet, MPP Yei Myint, Myint Swe, Min Wai Aung, Aung Myint, Khin Maung Yin, Po Po and Zaw Zaw Aung.\n\nBurmese traditional art concepts is more popular and respected by Burmese people and people from abroad.\n\nMedia and communications \n\nDue to Myanmar's political climate, there are not many media companies in relation to the country's population, although a certain number exists. Some are privately owned. All programming must meet with the approval of the censorship board.\n\nThe Burmese government announced on 20 August 2012 that it will stop censoring media before publication. Following the announcement, newspapers and other outlets no longer required approved by state censors; however, journalists in the country can still face consequences for what they write and say.\n\nIn April 2013, international media reports were published to relay the enactment of the media liberalisation reforms that we announced in August 2012. For the first time in numerous decades, the publication of privately owned newspapers commenced in the country.\n\nInternet \n\nInternet use is estimated to be relatively low compared to other countries. Myanmar's internet used to be subject to censorship, and authorities viewed e-mails and posts on Internet blogs until 2012 when the government removed media censorship. During the strict censorship days, activity at internet cafes was regulated, and one blogger named Zarganar was sentenced to a few years in prison for publishing a video of destruction caused by Cyclone Nargis in 2008; Zarganar was released in October 2011.\n\nIn regards to communications infrastructure, Myanmar is the last ranked Asian country in the World Economic Forum's Network Readiness Index (NRI) – an indicator for determining the development level of a country's information and communication technologies. With 148 countries reported on, Myanmar ranked number 146 overall in the 2014 NRI ranking. No data is currently available for previous years.\n\nFilm \n\nMyanmar's first film was a documentary of the funeral of Tun Shein—a leading politician of the 1910s, who campaigned for Burmese independence in London. The first Burmese silent film Myitta Ne Thuya (Love and Liquor) in 1920 which proved a major success, despite its poor quality due to a fixed camera position and inadequate film accessories. During the 1920s and 1930s, many Burmese-owned film companies made and produced several films. The first Burmese sound film was produced in 1932 in Bombay, India with the title Ngwe Pay Lo Ma Ya (Money Can't Buy It). After World War II, Burmese cinema continued to address political themes. Many of the films produced in the early Cold War era had a strong propaganda element to them.\n\nIn the era that followed the political events of 1988, the film industry has been increasingly controlled by the government. Film stars who had been involved in the political activities were banned from appearing in films. The government issues strict rules on censorship and largely determines who produces films, as well as who gets academy awards.\n\nOver the years, the movie industry has also shifted to producing many lower budget direct-to-video films.\n\nMost of the movies produced nowadays are comedies.Kyi Soe Tun quoted in the Bangkok Post, 11 August 2006 In 2008, only 12 films worthy of being considered for an Academy Award were made, although at least 800 VCDs were produced.[https://web.archive.org/web/20120328075748/http://irrawaddy.org/article.php?art_id=14937 Through the Director's Lens]. Irrawaddy. 16 January 2009\n\nMyanmar is the primary subject of a 2007 graphic novel titled Chroniques Birmanes by Québécois author and animator, Guy Delisle. The graphic novel was translated into English under the title Burma Chronicles in 2008. In 2009, a documentary about Burmese videojournalists called Burma VJ was released. This film was nominated for Best Documentary Feature at the 2010 Academy Awards. The Lady had its world premiere on 12 September 2011 at the 36th Toronto International Film Festival.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Myanmar" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19457" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Myanmar, officially the Republic of the Union of Myanmar and formerly known as Burma, is a sovereign state in Southeast Asia. Myanmar is bordered by India and Bangladesh to its west, Thailand and Laos to its east and People's Republic of China to its north and northeast. To its south, about one third of Myanmar's total perimeter of  forms an uninterrupted coastline of  along the Bay of Bengal and the Andaman Sea. The country's 2014 census counted the population to be 51 million people. As of 2017, the population is about 54 million.http://www.worldometers.info/world-population/myanmar-population/ Myanmar is  in size. Its capital city is Naypyidaw, and its largest city and former capital is Yangon (Rangoon). Myanmar has been a member of the Association of Southeast Asian Nations (ASEAN) since 1997.\n\nEarly civilisations in Myanmar included the Tibeto-Burman-speaking Pyu city-states in Upper Burma and the Mon kingdoms in Lower Burma. In the 9th century, the Bamar people entered the upper Irrawaddy valley and, following the establishment of the Pagan Kingdom in the 1050s, the Burmese language, culture and Theravada Buddhism slowly became dominant in the country. The Pagan Kingdom fell due to the Mongol invasions and several warring states emerged. In the 16th century, reunified by the Taungoo Dynasty, the country was for a brief period the largest empire in the history of Mainland Southeast Asia.Lieberman, p. 152 The early 19th century Konbaung Dynasty ruled over an area that included modern Myanmar and briefly controlled Manipur and Assam as well. The British took over the administration of Myanmar after three Anglo-Burmese Wars in the 19th century and the country became a British colony. Myanmar was granted independence in 1948, as a democratic nation. Following a coup d'état in 1962, it became a military dictatorship.\n\nFor most of its independent years, the country has been engrossed in rampant ethnic strife and its myriad ethnic groups have been involved in one of the world's longest-running ongoing civil wars. During this time, the United Nations and several other organisations have reported consistent and systematic human rights violations in the country. In 2011, the military junta was officially dissolved following a 2010 general election, and a nominally civilian government was installed. This, along with the release of Aung San Suu Kyi and political prisoners, has improved the country's human rights record and foreign relations, and has led to the easing of trade and other economic sanctions. There is, however, continuing criticism of the government's treatment of ethnic minorities, its response to the ethnic insurgency, and religious clashes. In the landmark 2015 election, Aung San Suu Kyi's party won a majority in both houses. However, the Burmese military remains a powerful force in politics.\n\nMyanmar is a country rich in jade and gems, oil, natural gas and other mineral resources. In 2013, its GDP (nominal) stood at US$56.7 billion and its GDP (PPP) at US$221.5 billion. The income gap in Myanmar is among the widest in the world, as a large proportion of the economy is controlled by supporters of the former military government. , Myanmar ranks 145 out of 188 countries in human development, according to the Human Development Index.\n\nEtymology \n\nIn 1989, the military government officially changed the English translations of many names dating back to Burma's colonial period or earlier, including that of the country itself: \"Burma\" became \"Myanmar\". The renaming remains a contested issue. Many political and ethnic opposition groups and countries continue to use \"Burma\" because they do not recognise the legitimacy of the ruling military government or its authority to rename the country.\n\nIn April 2016, soon after taking office, Aung San Suu Kyi clarified that foreigners are free to use either name, \"because there is nothing in the constitution of our country that says that you must use any term in particular\".South China Morning post, [http://www.scmp.com/news/asia/southeast-asia/article/1937886/whats-name-not-much-according-aung-san-suu-kyi-who-tells What's in a name? Not much, according to Aung San Suu Kyi, who tells diplomats they can use Myanmar or Burma], Saturday, 23 April 2016\n\nThe country's official full name is the \"Republic of the Union of Myanmar\" (, ',). Countries that do not officially recognise that name use the long form \"Union of Burma\" instead.\n\nIn English, the country is popularly known as either \"Burma\" or \"Myanmar\". Both these names are derived from the name of the majority Burmese Bamar ethnic group. Myanmar is considered to be the literary form of the name of the group, while Burma is derived from \"Bamar\", the colloquial form of the group's name. Depending on the register used, the pronunciation would be ' or '. The name Burma has been in use in English since the 18th century.\n\nBurma continues to be used in English by the governments of many countries, such as Canada and the United Kingdom. Official United States policy retains Burma as the country's name, although the State Department's website lists the country as \"Burma (Myanmar)\" and Barack Obama has referred to the country by both names. The Czech Republic officially uses Myanmar, although its Ministry of Foreign Affairs mentions both Myanmar and Burma on its website. The United Nations uses Myanmar, as do the Association of Southeast Asian Nations, Australia, Russia, Germany, China, India, Bangladesh, Norway, Japan and Switzerland.\n\nMost English-speaking international news media refer to the country by the name Myanmar, including the BBC, CNN, Al Jazeera, Reuters, RT (Russia Today) and the Australian Broadcasting Corporation (ABC)/Radio Australia.\n\nMyanmar is known with a name deriving from Burma as opposed to Myanmar in Spanish, Italian, Romanian, and Greek – Birmania being the local version of Burma in the Spanish language, for example. Myanmar used to be known as \"Birmânia\" in Portuguese, and as \"Birmanie\" in French. As in the past, French-language media today consistently use Birmanie.,http://tempsreel.nouvelobs.com/tag/birmanie\n\nHistory \n\nPrehistory \n\nArchaeological evidence shows that Homo erectus lived in the region now known as Myanmar as early as 750,000 years ago, with no more erectus finds after 75,000 years ago. The first evidence of Homo sapiens is dated to about 25,000 BP with discoveries of stone tools in central Myanmar. Evidence of neolithic age domestication of plants and animals and the use of polished stone tools dating to sometime between 10,000 and 6,000 BC has been discovered in the form of cave paintings in Padah-Lin Caves.\n\nThe Bronze Age arrived circa 1500 BC when people in the region were turning copper into bronze, growing rice and domesticating poultry and pigs; they were among the first people in the world to do so.Myint-U, p. 37 Human remains and artefacts from this era were discovered in Monywa District in the Sagaing Division. The Iron Age began around 500 BC with the emergence of iron-working settlements in an area south of present-day Mandalay.Myint-U, p. 45 Evidence also shows the presence of rice-growing settlements of large villages and small towns that traded with their surroundings as far as China between 500 BC and 200 AD. Iron Age Burmese cultures also had influences from outside sources such as India and Thailand, as seen in their funerary practices concerning child burials. This indicates some form of communication between groups in Myanmar and other places, possibly through trade.Coupey, A. S. (2008). Infant and child burials in the Samon valley, Myanmar. In Archaeology in Southeast Asia, from Homo Erectus to the living traditions: choice of papers from the 11th International Conference of the European Association of Southeast Asian Archaeologists, 25–29 September 2006, Bougon, France\n\nEarly city-states \n\nAround the second century BC the first-known city-states emerged in central Myanmar. The city-states were founded as part of the southward migration by the Tibeto-Burman-speaking Pyu people, the earliest inhabitants of Myanmar of whom records are extant, from present-day Yunnan. The Pyu culture was heavily influenced by trade with India, importing Buddhism as well as other cultural, architectural and political concepts, which would have an enduring influence on later Burmese culture and political organisation.Myint-U, pp. 51–52\n\nBy the 9th century, several city-states had sprouted across the land: the Pyu in the central dry zone, Mon along the southern coastline and Arakanese along the western littoral. The balance was upset when the Pyu came under repeated attacks from Nanzhao between the 750s and the 830s. In the mid-to-late 9th century the Bamar people founded a small settlement at Bagan. It was one of several competing city-states until the late 10th century when it grew in authority and grandeur.Lieberman, pp. 90–91\n\nImperial Burma \n\nPagan gradually grew to absorb its surrounding states until the 1050s–1060s when Anawrahta founded the Pagan Kingdom, the first ever unification of the Irrawaddy valley and its periphery. In the 12th and 13th centuries, the Pagan Empire and the Khmer Empire were two main powers in mainland Southeast Asia.Lieberman, p. 24 The Burmese language and culture gradually became dominant in the upper Irrawaddy valley, eclipsing the Pyu, Mon and Pali norms by the late 12th century.\n\nTheravada Buddhism slowly began to spread to the village level, although Tantric, Mahayana, Hinduism, and folk religion remained heavily entrenched. Pagan's rulers and wealthy built over 10,000 Buddhist temples in the Pagan capital zone alone. Repeated Mongol invasions (1277–1301) toppled the four-century-old kingdom in 1287.\n\nPagan's collapse was followed by 250 years of political fragmentation that lasted well into the 16th century. Like the Burmans four centuries earlier, Shan migrants who arrived with the Mongol invasions stayed behind. Several competing Shan States came to dominate the entire northwestern to eastern arc surrounding the Irrawaddy valley. The valley too was beset with petty states until the late 14th century when two sizeable powers, Ava Kingdom and Hanthawaddy Kingdom, emerged. In the west, a politically fragmented Arakan was under competing influences of its stronger neighbours until the Kingdom of Mrauk U unified the Arakan coastline for the first time in 1437.\n\nEarly on, Ava fought wars of unification (1385–1424) but could never quite reassemble the lost empire. Having held off Ava, Hanthawaddy entered its golden age, and Arakan went on to become a power in its own right for the next 350 years. In contrast, constant warfare left Ava greatly weakened, and it slowly disintegrated from 1481 onward. In 1527, the Confederation of Shan States conquered Ava itself, and ruled Upper Myanmar until 1555.\n\nLike the Pagan Empire, Ava, Hanthawaddy and the Shan states were all multi-ethnic polities. Despite the wars, cultural synchronisation continued. This period is considered a golden age for Burmese culture. Burmese literature \"grew more confident, popular, and stylistically diverse\", and the second generation of Burmese law codes as well as the earliest pan-Burma chronicles emerged.Lieberman, p. 134 Hanthawaddy monarchs introduced religious reforms that later spread to the rest of the country.Myint-U, pp. 64–65 Many splendid temples of Mrauk U were built during this period.\n\nTaungoo and colonialism \n\nPolitical unification returned in the mid-16th century, due to the efforts of Taungoo, a former vassal state of Ava. Taungoo's young, ambitious king Tabinshwehti defeated the more powerful Hanthawaddy in the Toungoo–Hanthawaddy War (1534–41). His successor Bayinnaung went on to conquer a vast swath of mainland Southeast Asia including the Shan states, Lan Na, Manipur, Mong Mao, the Ayutthaya Kingdom, Lan Xang and southern Arakan. However, the largest empire in the history of Southeast Asia unravelled soon after Bayinnaung's death in 1581, completely collapsing by 1599. Ayutthaya seized Tenasserim and Lan Na, and Portuguese mercenaries established Portuguese rule at Thanlyin (Syriam).\n\nThe dynasty regrouped and defeated the Portuguese in 1613 and Siam in 1614. It restored a smaller, more manageable kingdom, encompassing Lower Myanmar, Upper Myanmar, Shan states, Lan Na and upper Tenasserim. The Restored Toungoo kings created a legal and political framework whose basic features would continue well into the 19th century. The crown completely replaced the hereditary chieftainships with appointed governorships in the entire Irrawaddy valley, and greatly reduced the hereditary rights of Shan chiefs. Its trade and secular administrative reforms built a prosperous economy for more than 80 years. From the 1720s onward, the kingdom was beset with repeated Meithei raids into Upper Myanmar and a nagging rebellion in Lan Na. In 1740, the Mon of Lower Myanmar founded the Restored Hanthawaddy Kingdom. Hanthawaddy forces sacked Ava in 1752, ending the 266-year-old Toungoo Dynasty.\n\nAfter the fall of Ava, the Konbaung–Hanthawaddy War involved one resistance group under Alaungpaya defeating the Restored Hanthawaddy, and by 1759, he had reunited all of Myanmar and Manipur, and driven out the French and the British, who had provided arms to Hanthawaddy. By 1770, Alaungpaya's heirs had subdued much of Laos (1765) and fought and won the Burmese–Siamese War (1765–67) against Ayutthaya and the Sino-Burmese War (1765–69) against Qing China (1765–1769).Lieberman, pp. 184–187\n\nWith Burma preoccupied by the Chinese threat, Ayutthaya recovered its territories by 1770, and went on to capture Lan Na by 1776. Burma and Siam went to war until 1855, but all resulted in a stalemate, exchanging Tenasserim (to Burma) and Lan Na (to Ayutthaya). Faced with a powerful China and a resurgent Ayutthaya in the east, King Bodawpaya turned west, acquiring Arakan (1785), Manipur (1814) and Assam (1817). It was the second-largest empire in Burmese history but also one with a long ill-defined border with British India.Myint-U, p. 109\n\nThe breadth of this empire was short lived. Burma lost Arakan, Manipur, Assam and Tenasserim to the British in the First Anglo-Burmese War (1824–1826). In 1852, the British easily seized Lower Burma in the Second Anglo-Burmese War. King Mindon Min tried to modernise the kingdom, and in 1875 narrowly avoided annexation by ceding the Karenni States. The British, alarmed by the consolidation of French Indochina, annexed the remainder of the country in the Third Anglo-Burmese War in 1885.\n\nKonbaung kings extended Restored Toungoo's administrative reforms, and achieved unprecedented levels of internal control and external expansion. For the first time in history, the Burmese language and culture came to predominate the entire Irrawaddy valley. The evolution and growth of Burmese literature and theatre continued, aided by an extremely high adult male literacy rate for the era (half of all males and 5% of females).Lieberman, pp. 202–206 Nonetheless, the extent and pace of reforms were uneven and ultimately proved insufficient to stem the advance of British colonialism.\n\nBritish Burma (1824–1948) \n\nBurma in British India\n\nThe eighteenth century saw Burmese rulers, whose country had not previously been of particular interest to European traders, seek to maintain their traditional influence in the western areas of Assam, Manipur and Arakan. Pressing them, however, was the British East India Company, which was expanding its interests eastwards over the same territory. Over the next sixty years, diplomacy, raids, treaties and compromises continued until, after three Anglo-Burmese Wars (1824–1885), Britain proclaimed control over most of Burma. British rule brought social, economic, cultural and administrative changes.\n\nWith the fall of Mandalay, all of Burma came under British rule, being annexed on 1 January 1886. Throughout the colonial era, many Indians arrived as soldiers, civil servants, construction workers and traders and, along with the Anglo-Burmese community, dominated commercial and civil life in Burma. Rangoon became the capital of British Burma and an important port between Calcutta and Singapore.\n\nBurmese resentment was strong and was vented in violent riots that paralysed Yangon (Rangoon) on occasion all the way until the 1930s. Some of the discontent was caused by a disrespect for Burmese culture and traditions such as the British refusal to remove shoes when they entered pagodas. Buddhist monks became the vanguards of the independence movement. U Wisara, an activist monk, died in prison after a 166-day hunger strike to protest against a rule that forbade him to wear his Buddhist robes while imprisoned.\n\nSeparation of British Burma from British India\n\nOn 1 April 1937, Burma became a separately administered colony of Great Britain and Ba Maw the first Prime Minister and Premier of Burma. Ba Maw was an outspoken advocate for Burmese self-rule and he opposed the participation of Great Britain, and by extension Burma, in World War II. He resigned from the Legislative Assembly and was arrested for sedition. In 1940, before Japan formally entered the Second World War, Aung San formed the Burma Independence Army in Japan.\n\nA major battleground, Burma was devastated during World War II. By March 1942, within months after they entered the war, Japanese troops had advanced on Rangoon and the British administration had collapsed. A Burmese Executive Administration headed by Ba Maw was established by the Japanese in August 1942. Wingate's British Chindits were formed into long-range penetration groups trained to operate deep behind Japanese lines. A similar American unit, Merrill's Marauders, followed the Chindits into the Burmese jungle in 1943. Beginning in late 1944, allied troops launched a series of offensives that led to the end of Japanese rule in July 1945. The battles were intense with much of Burma laid waste by the fighting. Overall, the Japanese lost some 150,000 men in Burma. Only 1,700 prisoners were taken.\n\nAlthough many Burmese fought initially for the Japanese as part of the Burma Independence Army, many Burmese, mostly from the ethnic minorities, served in the British Burma Army. The Burma National Army and the Arakan National Army fought with the Japanese from 1942 to 1944 but switched allegiance to the Allied side in 1945. Under Japanese occupation, 170,000 to 250,000 civilians died.Michael Clodfelter. Warfare and Armed Conflicts: A Statistical Reference to Casualty and Other Figures, 1500–2000. 2nd Ed. 2002 . p. 556Werner Gruhl, Imperial Japan's World War Two, 1931–1945 Transaction 2007  (Werner Gruhl is former chief of NASA's Cost and Economic Analysis Branch with a lifetime interest in the study of the First and Second World Wars.)\n\nFollowing World War II, Aung San negotiated the Panglong Agreement with ethnic leaders that guaranteed the independence of Myanmar as a unified state. Aung Zan Wai, Pe Khin, Bo Hmu Aung, Sir Maung Gyi, Dr. Sein Mya Maung, Myoma U Than Kywe were among the negotiators of the historical Panglong Conference negotiated with Bamar leader General Aung San and other ethnic leaders in 1947. In 1947, Aung San became Deputy Chairman of the Executive Council of Myanmar, a transitional government. But in July 1947, political rivals assassinated Aung San and several cabinet members.\n\nIndependence (1948–1962) \n\nOn 4 January 1948, the nation became an independent republic, named the Union of Burma, with Sao Shwe Thaik as its first President and U Nu as its first Prime Minister. Unlike most other former British colonies and overseas territories, Burma did not become a member of the Commonwealth. A bicameral parliament was formed, consisting of a Chamber of Deputies and a Chamber of Nationalities, and multi-party elections were held in 1951–1952, 1956 and 1960.\n\nThe geographical area Burma encompasses today can be traced to the Panglong Agreement, which combined Burma Proper, which consisted of Lower Burma and Upper Burma, and the Frontier Areas, which had been administered separately by the British.\n\nIn 1961, U Thant, then the Union of Burma's Permanent Representative to the United Nations and former Secretary to the Prime Minister, was elected Secretary-General of the United Nations, a position he held for ten years. Among the Burmese to work at the UN when he was Secretary-General was a young Aung San Suu Kyi (daughter of Aung San), who went on to become winner of the 1991 Nobel Peace Prize.\n\nWhen the non-Burman ethnic groups pushed for autonomy or federalism, alongside having a weak civilian government at the centre, the military leadership staged a coup d’état in 1962. Though incorporated in the 1947 Constitution, successive military governments construed the use of the term ‘federalism’ as being anti-national, anti-unity and pro-disintegration.\n\nMilitary rule (1962–2011) \n\nOn 2 March 1962, the military led by General Ne Win took control of Burma through a coup d'état, and the government has been under direct or indirect control by the military since then. Between 1962 and 1974, Myanmar was ruled by a revolutionary council headed by the general. Almost all aspects of society (business, media, production) were nationalised or brought under government control under the Burmese Way to Socialism,Myint-U which combined Soviet-style nationalisation and central planning.\n\nA new constitution of the Socialist Republic of the Union of Burma was adopted in 1974. Until 1988, the country was ruled as a one-party system, with the General and other military officers resigning and ruling through the Burma Socialist Programme Party (BSPP). During this period, Myanmar became one of the world's most impoverished countries.\n\nThere were sporadic protests against military rule during the Ne Win years and these were almost always violently suppressed. On 7 July 1962, the government broke up demonstrations at Rangoon University, killing 15 students. In 1974, the military violently suppressed anti-government protests at the funeral of U Thant. Student protests in 1975, 1976, and 1977 were quickly suppressed by overwhelming force.\n\nIn 1988, unrest over economic mismanagement and political oppression by the government led to widespread pro-democracy demonstrations throughout the country known as the 8888 Uprising. Security forces killed thousands of demonstrators, and General Saw Maung staged a coup d'état and formed the State Law and Order Restoration Council (SLORC). In 1989, SLORC declared martial law after widespread protests. The military government finalised plans for People's Assembly elections on 31 May 1989. SLORC changed the country's official English name from the \"Socialist Republic of the Union of Burma\" to the \"Union of Myanmar\" in 1989.\n\nIn May 1990, the government held free elections for the first time in almost 30 years and the National League for Democracy (NLD), the party of Aung San Suu Kyi, won 392 out of a total 492 seats (i.e., 80% of the seats). However, the military junta refused to cede power and continued to rule the nation as SLORC until 1997, and then as the State Peace and Development Council (SPDC) until its dissolution in March 2011.\n\nOn 23 June 1997, Myanmar was admitted into the Association of Southeast Asian Nations (ASEAN). On 27 March 2006, the military junta, which had moved the national capital from Yangon to a site near Pyinmana in November 2005, officially named the new capital Naypyidaw, meaning \"city of the kings\".\n\nIn August 2007, an increase in the price of diesel and petrol led to the Saffron Revolution led by Buddhist monks that were dealt with harshly by the government. The government cracked down on them on 26 September 2007. The crackdown was harsh, with reports of barricades at the Shwedagon Pagoda and monks killed. There were also rumours of disagreement within the Burmese armed forces, but none was confirmed. The military crackdown against unarmed protesters was widely condemned as part of the international reactions to the Saffron Revolution and led to an increase in economic sanctions against the Burmese Government.\n\nIn May 2008, Cyclone Nargis caused extensive damage in the densely populated, rice-farming delta of the Irrawaddy Division. It was the worst natural disaster in Burmese history with reports of an estimated 200,000 people dead or missing, damage totalled to 10 billion US dollars, and as many as 1 million left homeless. In the critical days following this disaster, Myanmar's isolationist government was accused of hindering United Nations recovery efforts. Humanitarian aid was requested but concerns about foreign military or intelligence presence in the country delayed the entry of United States military planes delivering medicine, food, and other supplies.\n\nIn early August 2009, a conflict known as the Kokang incident broke out in Shan State in northern Myanmar. For several weeks, junta troops fought against ethnic minorities including the Han Chinese, Wa, and Kachin. During 8–12 August, the first days of the conflict, as many as 10,000 Burmese civilians fled to Yunnan province in neighbouring China.\n\nCivil wars \n\nCivil wars have been a constant feature of Myanmar's socio-political landscape since the attainment of independence in 1948. These wars are predominantly struggles for ethnic and sub-national autonomy, with the areas surrounding the ethnically Bamar central districts of the country serving as the primary geographical setting of conflict. Foreign journalists and visitors require a special travel permit to visit the areas in which Myanmar's civil wars continue.\n\nIn October 2012, the ongoing conflicts in Myanmar included the Kachin conflict, between the Pro-Christian Kachin Independence Army and the government; a civil war between the Rohingya Muslims, and the government and non-government groups in Rakhine State; and a conflict between the Shan, Lahu, and Karen minority groups, and the government in the eastern half of the country. In addition, al-Qaeda signalled an intention to become involved in Myanmar. In a video released on 3 September 2014, mainly addressed to India, the militant group's leader Ayman al-Zawahiri said al-Qaeda had not forgotten the Muslims of Myanmar and that the group was doing \"what they can to rescue you\". In response, the military raised its level of alertness, while the Burmese Muslim Association issued a statement saying Muslims would not tolerate any threat to their motherland.\n\nArmed conflict between ethnic Chinese rebels and the Myanmar Armed Forces have resulted in the Kokang offensive in February 2015. The conflict had forced 40,000 to 50,000 civilians to flee their homes and seek shelter on the Chinese side of the border. During the incident, the government of China was accused of giving military assistance to the ethnic Chinese rebels. Burmese officials have been historically \"manipulated\" and pressured by the Chinese government throughout Burmese modern history to create closer and binding ties with China, creating a Chinese satellite state in Southeast Asia.\"[http://www.rfa.org/english/news/myanmar/kokang-02132015185129.html Myanmar Kokang Rebels Deny Receiving Chinese Weapons]\". Radio Free Asia.  However, uncertainties exist as clashes between Burmese troops and local insurgent groups continue.\n\nDemocratic reforms \n\nThe goal of the Burmese constitutional referendum of 2008, held on 10 May 2008, is the creation of a \"discipline-flourishing democracy\". As part of the referendum process, the name of the country was changed from the \"Union of Myanmar\" to the \"Republic of the Union of Myanmar\", and general elections were held under the new constitution in 2010. Observer accounts of the 2010 election describe the event as mostly peaceful; however, allegations of polling station irregularities were raised, and the United Nations (UN) and a number of Western countries condemned the elections as fraudulent.\n\nThe military-backed Union Solidarity and Development Party declared victory in the 2010 elections, stating that it had been favoured by 80 percent of the votes; however, the claim was disputed by numerous pro-democracy opposition groups who asserted that the military regime had engaged in rampant fraud. One report documented 77 percent as the official turnout rate of the election. The military junta was dissolved on 30 March 2011.\n\nOpinions differ whether the transition to liberal democracy is underway. According to some reports, the military's presence continues as the label \"disciplined democracy\" suggests. This label asserts that the Burmese military is allowing certain civil liberties while clandestinely institutionalising itself further into Burmese politics. Such an assertion assumes that reforms only occurred when the military was able to safeguard its own interests through the transition—here, \"transition\" does not refer to a transition to a liberal democracy, but transition to a quasi-military rule.\n\nSince the 2010 election, the government has embarked on a series of reforms to direct the country towards liberal democracy, a mixed economy, and reconciliation, although doubts persist about the motives that underpin such reforms. The series of reforms includes the release of pro-democracy leader Aung San Suu Kyi from house arrest, the establishment of the National Human Rights Commission, the granting of general amnesties for more than 200 political prisoners, new labour laws that permit labour unions and strikes, a relaxation of press censorship, and the regulation of currency practices.\n\nThe impact of the post-election reforms has been observed in numerous areas, including ASEAN's approval of Myanmar's bid for the position of ASEAN chair in 2014; the visit by United States Secretary of State Hillary Clinton in December 2011 for the encouragement of further progress, which was the first visit by a Secretary of State in more than fifty years, during which Clinton met with the Burmese president and former military commander Thein Sein, as well as opposition leader Aung San Suu Kyi; and the participation of Aung San Suu Kyi's National League for Democracy (NLD) party in the 2012 by-elections, facilitated by the government's abolition of the laws that previously barred the NLD. As of July 2013, about 100 political prisoners remain imprisoned, while conflict between the Burmese Army and local insurgent groups continues.\n\nIn 1 April 2012 by-elections, the NLD won 43 of the 45 available seats; previously an illegal organisation, the NLD had not won a single seat under new constitution. The 2012 by-elections were also the first time that international representatives were allowed to monitor the voting process in Myanmar.\n\n2015 general elections \n\nGeneral elections were held on 8 November 2015. These were the first openly contested elections held in Myanmar since 1990. The results gave the National League for Democracy an absolute majority of seats in both chambers of the national parliament, enough to ensure that its candidate would become president, while NLD leader Aung San Suu Kyi is constitutionally barred from the presidency.\n\nThe new parliament convened on 1 February 2016 and, on 15 March 2016, Htin Kyaw was elected as the first non-military president since the military coup of 1962. On 6 April 2016, Aung San Suu Kyi assumed the newly created role of State Counsellor, a role akin to a Prime Minister.\n\nGeography \n\nMyanmar has a total area of 678500 km2. It lies between latitudes 9° and 29°N, and longitudes 92° and 102°E. As of February 2011, Myanmar consisted of 14 states and regions, 67 districts, 330 townships, 64 sub-townships, 377 towns, 2,914 Wards, 14,220 village tracts and 68,290 villages.\n\nMyanmar is bordered in the northwest by the Chittagong Division of Bangladesh and the Mizoram, Manipur, Nagaland and Arunachal Pradesh states of India. Its north and northeast border is with the Tibet Autonomous Region and Yunnan province for a Sino-Myanmar border total of 2185 km. It is bounded by Laos and Thailand to the southeast. Myanmar has 1930 km of contiguous coastline along the Bay of Bengal and Andaman Sea to the southwest and the south, which forms one quarter of its total perimeter.\n\nIn the north, the Hengduan Mountains form the border with China. Hkakabo Razi, located in Kachin State, at an elevation of 5881 m, is the highest point in Myanmar. Many mountain ranges, such as the Rakhine Yoma, the Bago Yoma, the Shan Hills and the Tenasserim Hills exist within Myanmar, all of which run north-to-south from the Himalayas.\n\nThe mountain chains divide Myanmar's three river systems, which are the Irrawaddy, Salween (Thanlwin), and the Sittaung rivers. The Irrawaddy River, Myanmar's longest river, nearly 2170 km long, flows into the Gulf of Martaban. Fertile plains exist in the valleys between the mountain chains. The majority of Myanmar's population lives in the Irrawaddy valley, which is situated between the Rakhine Yoma and the Shan Plateau.\n\nAdministrative divisions \n\nMyanmar is divided into seven states () and seven regions (), formerly called divisions. Regions are predominantly Bamar (that is, mainly inhabited by the dominant ethnic group). States, in essence, are regions that are home to particular ethnic minorities. The administrative divisions are further subdivided into districts, which are further subdivided into townships, wards, and villages.\n\nBelow are the number of districts, townships, cities/towns, wards, village groups and villages in each divisions and states of Myanmar as of 31 December 2001:List of Districts, Townships, Cities/Towns, Wards, Village Groups and Villages in Union of Myanmar published by Ministry of Home Affairs, Government of Union of Myanmar on 31 December 2001\n\nClimate \n\nMuch of the country lies between the Tropic of Cancer and the Equator. It lies in the monsoon region of Asia, with its coastal regions receiving over 5000 mm of rain annually. Annual rainfall in the delta region is approximately 2500 mm, while average annual rainfall in the Dry Zone in central Myanmar is less than 1000 mm. The Northern regions of Myanmar are the coolest, with average temperatures of 21 C. Coastal and delta regions have an average maximum temperature of 32 C.\n\nEnvironment \n\nMyanmar continues to perform badly in the global Environmental Performance Index (EPI) with an overall ranking of 153 out of 180 countries in 2016; among the worst in the South Asian region, only ahead of Bangladesh and Afghanistan. The EPI was established in 2001 by the World Economic Forum as a global gauge to measure how well individual countries perform in implementing the United Nations' Sustainable Development Goals. The environmental areas where Myanmar performs worst (ie. highest ranking) are air quality (174), health impacts of environmental issues (143) and biodiversity and habitat (142). Myanmar performs best (ie. lowest ranking) in environmental impacts of fisheries (21), but with declining fish stocks. Despite several issues, Myanmar also ranks 64 and scores very good (ie. a high percentage of 93.73%) in environmental effects of the agricultural industry because of an excellent management of the nitrogen cycle.EPI (2016): [http://epi.yale.edu/country/myanmar Myanmar]\n\nWildlife \n\nMyanmar's slow economic growth has contributed to the preservation of much of its environment and ecosystems. Forests, including dense tropical growth and valuable teak in lower Myanmar, cover over 49% of the country, including areas of acacia, bamboo, ironwood and Magnolia champaca. Coconut and betel palm and rubber have been introduced. In the highlands of the north, oak, pine and various rhododendrons cover much of the land.\n\nHeavy logging since the new 1995 forestry law went into effect has seriously reduced forest acreage and wildlife habitat. The lands along the coast support all varieties of tropical fruits and once had large areas of mangroves although much of the protective mangroves have disappeared. In much of central Myanmar (the Dry Zone), vegetation is sparse and stunted.\n\nTypical jungle animals, particularly tigers, occur sparsely in Myanmar. In upper Myanmar, there are rhinoceros, wild water buffalo, clouded leopard, wild boars, deer, antelope, and elephants, which are also tamed or bred in captivity for use as work animals, particularly in the lumber industry. Smaller mammals are also numerous, ranging from gibbons and monkeys to flying foxes. The abundance of birds is notable with over 800 species, including parrots, myna, peafowl, red junglefowl, weaverbirds, crows, herons, and barn owl. Among reptile species there are crocodiles, geckos, cobras, Burmese pythons, and turtles. Hundreds of species of freshwater fish are wide-ranging, plentiful and are very important food sources. For a list of protected areas, see List of protected areas of Myanmar.\n\nGovernment and politics \n\nThe constitution of Myanmar, its third since independence, was drafted by its military rulers and published in September 2008. The country is governed as a parliamentary system with a bicameral legislature (with an executive President accountable to the legislature), with 25% of the legislators appointed by the military and the rest elected in general elections.\n\nThe legislature, called the Pyidaungsu Hluttaw, is bicameral and made up of two houses: the 224-seat upper house Amyotha Hluttaw (House of Nationalities) and the 440-seat lower house Pyithu Hluttaw (House of Representatives). The upper house consists of 224 members, of whom 168 are directly elected and 56 are appointed by the Burmese Armed Forces. The lower house consists of 440 members, of whom 330 are directly elected and 110 are appointed by the armed forces.\n\nPolitical culture \n\nThe major political parties are the National League for Democracy and Union Solidarity and Development Party.\n\nMyanmar's army-drafted constitution was approved in a referendum in May 2008. The results, 92.4% of the 22 million voters with an official turnout of 99%, are considered suspect by many international observers and by the National League of Democracy with reports of widespread fraud, ballot stuffing, and voter intimidation.\n\nThe elections of 2010 resulted in a victory for the military-backed Union Solidarity and Development Party. Various foreign observers questioned the fairness of the elections. One criticism of the election was that only government sanctioned political parties were allowed to contest in it and the popular National League for Democracy was declared illegal. However, immediately following the elections, the government ended the house arrest of the democracy advocate and leader of the National League for Democracy, Aung San Suu Kyi, and her ability to move freely around the country is considered an important test of the military's movement toward more openness. After unexpected reforms in 2011, NLD senior leaders have decided to register as a political party and to field candidates in future by-elections.\n\nMyanmar's recent political history is underlined by its struggle to establish democratic structures amidst conflicting fractions. This political transition from a closely held military rule to a free democratic system is widely believed to be determining the future of Myanmar. The resounding victory of Aung San Suu Kyi's National League for Democracy in 2015 general elections has raised hope for a successful culmination of this transition.\n\nMyanmar rates as a corrupt nation on the Corruption Perceptions Index with a rank of 136th out of 176 countries worldwide, with 1st being least corrupt, .\n\nForeign relations \n\nThough the country's foreign relations, particularly with Western nations, have been strained, relations have thawed since the reforms following the 2010 elections. After years of diplomatic isolation and economic and military sanctions, the United States relaxed curbs on foreign aid to Myanmar in November 2011 and announced the resumption of diplomatic relations on 13 January 2012 The European Union has placed sanctions on Myanmar, including an arms embargo, cessation of trade preferences, and suspension of all aid with the exception of humanitarian aid.\n\nSanctions imposed by the United States and European countries against the former military government, coupled with boycotts and other direct pressure on corporations by supporters of the democracy movement, have resulted in the withdrawal from the country of most US and many European companies.\nOn 13 April 2012 British Prime Minister David Cameron called for the economic sanctions on Myanmar to be suspended in the wake of the pro-democracy party gaining 43 seats out of a possible 45 in the 2012 by-elections with the party leader, Aung San Suu Kyi becoming a member of the Burmese parliament.\n\nDespite Western isolation, Asian corporations have generally remained willing to continue investing in the country and to initiate new investments, particularly in natural resource extraction. The country has close relations with neighbouring India and China with several Indian and Chinese companies operating in the country. Under India's Look East policy, fields of co-operation between India and Myanmar include remote sensing, oil and gas exploration, information technology, hydro power and construction of ports and buildings.\n\nIn 2008, India suspended military aid to Myanmar over the issue of human rights abuses by the ruling junta, although it has preserved extensive commercial ties, which provide the regime with much-needed revenue. The thaw in relations began on 28 November 2011, when Belarusian Prime Minister Mikhail Myasnikovich and his wife Ludmila arrived in the capital, Naypyidaw, the same day as the country received a visit by US Secretary of State Hillary Clinton, who also met with pro-democracy opposition leader Aung San Suu Kyi. International relations progress indicators continued in September 2012 when Aung San Suu Kyi visited the United States followed by Myanmar's reformist president visit to the United Nations.\n\nIn May 2013, Thein Sein became the first Myanmar president to visit the White House in 47 years; the last Burmese leader to visit the White House was Ne Win in September 1966. President Barack Obama praised the former general for political and economic reforms, and the cessation of tensions between Myanmar and the United States. Political activists objected to the visit due to concerns over human rights abuses in Myanmar but Obama assured Thein Sein that Myanmar will receive US support. The two leaders discussed to release more political prisoners, the institutionalisation of political reform and rule of law, and ending ethnic conflict in Myanmar—the two governments agreed to sign a bilateral trade and investment framework agreement on 21 May 2013.\n\nIn June 2013, Myanmar held its first ever summit, the World Economic Forum on East Asia 2013. A regional spinoff of the annual World Economic Forum in Davos, Switzerland, the summit was held on 5–7 June and attended by 1,200 participants, including 10 heads of state, 12 ministers and 40 senior directors from around the world.\n\nMilitary \n\nMyanmar has received extensive military aid from China in the past.\nMyanmar has been a member of ASEAN since 1997. Though it gave up its turn to hold the ASEAN chair and host the ASEAN Summit in 2006, it chaired the forum and hosted the summit in 2014. In November 2008, Myanmar's political situation with neighbouring Bangladesh became tense as they began searching for natural gas in a disputed block of the Bay of Bengal. Controversy surrounding the Rohingya population also remains an issue between Bangladesh and Myanmar.\n\nMyanmar's armed forces are known as the Tatmadaw, which numbers 488,000. The Tatmadaw comprises the Army, the Navy, and the Air Force. The country ranked twelfth in the world for its number of active troops in service. The military is very influential in Myanmar, with all top cabinet and ministry posts usually held by military officials. Official figures for military spending are not available. Estimates vary widely because of uncertain exchange rates, but Myanmar's military forces' expenses are high. Myanmar imports most of its weapons from Russia, Ukraine, China and India.\n\nMyanmar is building a research nuclear reactor near Pyin Oo Lwin with help from Russia. It is one of the signatories of the nuclear non-proliferation pact since 1992 and a member of the International Atomic Energy Agency (IAEA) since 1957. The military junta had informed the IAEA in September 2000 of its intention to construct the reactor. The research reactor outbuilding frame was built by ELE steel industries limited of Yangon/Rangoon and water from Anisakhan/BE water fall will be used for the reactor cavity cooling system.\n\nIn 2010 as part of the Wikileaks leaked cables, Myanmar was suspected of using North Korean construction teams to build a fortified Surface-to-Air Missile facility.\n\nUntil 2005, the United Nations General Assembly annually adopted a detailed resolution about the situation in Myanmar by consensus. But in 2006 a divided United Nations General Assembly voted through a resolution that strongly called upon the government of Myanmar to end its systematic violations of human rights. In January 2007, Russia and China vetoed a draft resolution before the United Nations Security Council calling on the government of Myanmar to respect human rights and begin a democratic transition. South Africa also voted against the resolution.\n\nHuman rights and internal conflicts \n\nThere is consensus that the former military regime in Myanmar (1962–2010) was one of the world's most repressive and abusive regimes. In November 2012, Samantha Power, Barack Obama's Special Assistant to the President on Human Rights, wrote on the White House blog in advance of the president's visit that \"Serious human rights abuses against civilians in several regions continue, including against women and children.\" Members of the United Nations and major international human rights organisations have issued repeated and consistent reports of widespread and systematic human rights violations in Myanmar. The United Nations General Assembly has repeatedly called on the Burmese Military Junta to respect human rights and in November 2009 the General Assembly adopted a resolution \"strongly condemning the ongoing systematic violations of human rights and fundamental freedoms\" and calling on the Burmese Military Regime \"to take urgent measures to put an end to violations of international human rights and humanitarian law.\"\n\nInternational human rights organisations including Human Rights Watch, Amnesty International and the American Association for the Advancement of Science have repeatedly documented and condemned widespread human rights violations in Myanmar. The Freedom in the World 2011 report by Freedom House notes, \"The military junta has ... suppressed nearly all basic rights; and committed human rights abuses with impunity.\" In July 2013, the Assistance Association for Political Prisoners indicated that there were approximately 100 political prisoners being held in Burmese prisons.\n\nEvidence gathered by a British researcher was published in 2005 regarding the extermination or 'Burmisation' of certain ethnic minorities, such as the Karen, Karenni and Shan.\n\nChild soldiers \n\nChild soldiers had played a major part in the Burmese Army until around 2012. The Independent reported in June 2012 that \"Children are being sold as conscripts into the Burmese military for as little as $40 and a bag of rice or a can of petrol.\" The UN's Special Representative of the Secretary-General for Children and Armed Conflict, Radhika Coomaraswamy, who stepped down from her position a week later, met representatives of the Government of Myanmar on 5 July 2012 and stated that she hoped the government's signing of an action plan would \"signal a transformation.\" In September 2012, the Myanmar Armed Forces released 42 child soldiers and the International Labour Organization met with representatives of the government as well as the Kachin Independence Army to secure the release of more child soldiers. According to Samantha Power, a US delegation raised the issue of child soldiers with the government in October 2012. However, she did not comment on the government's progress towards reform in this area.\n\nA Bangkok Post article on 23 December 2012 reported that the Myanmar Armed Forces continued to use child soldiers including during the army's large offensive against the KIA in December 2012.\n\nChild/forced/slave labour, systematic sexual violence and human trafficking \n\nForced labour, human trafficking, and child labour are common. The military is also notorious for rampant use of sexual violence, a practice continuing . In 2007 the international movement to defend women's human rights issues in Myanmar was said to be gaining speed.\n\nGenocide allegations and crimes against Rohingya people \n\nThe Rohingya people have consistently faced human rights abuses by the Burmese regime that has refused to acknowledge them as Burmese citizens (despite some of them having lived in Burma for over three generations)—the Rohingya have been denied Burmese citizenship since the enactment of a 1982 citizenship law. The law created three categories of citizenship: citizenship, associate citizenship, and naturalised citizenship. Citizenship is given to those who belong to one of the national races such as Kachin, Kayah (Karenni), Karen, Chin, Burman, Mon, Rakhine, Shan, Kaman, or Zerbadee. Associate citizenship is given to those who cannot prove their ancestors settled in Myanmar before 1823, but can prove they have one grandparent, or pre-1823 ancestor, who was a citizen of another country, as well as people who applied for citizenship in 1948 and qualified then by those laws. Naturalised citizenship is only given to those who have at least one parent with one of these types of Burmese citizenship or can provide \"conclusive evidence\" that their parents entered and resided in Burma prior to independence in 1948. The Burmese regime has attempted to forcibly expel Rohingya and bring in non-Rohingyas to replace them—this policy has resulted in the expulsion of approximately half of the 800,000 Rohingya from Burma, while the Rohingya people have been described as \"among the world's least wanted\" and \"one of the world's most persecuted minorities.\" But the origin of 'most persecuted minority' statement is unclear.\n\nRohingya are also not allowed to travel without official permission, are banned from owning land and are required to sign a commitment to have no more than two children. As of July 2012, the Myanmar Government does not include the Rohingya minority group—classified as stateless Bengali Muslims from Bangladesh since 1982—on the government's list of more than 130 ethnic races and, therefore, the government states that they have no claim to Myanmar citizenship.\n\nIn 2007 the German professor Bassam Tibi suggested that the Rohingya conflict may be driven by an Islamist political agenda to impose religious laws, while non-religious causes have also been raised, such as a lingering resentment over the violence that occurred during the Japanese occupation of Burma in World War II—during this time period the British allied themselves with the Rohingya and fought against the puppet government of Burma (composed mostly of Bamar Japanese) that helped to establish the Tatmadaw military organisation that remains in power as of March 2013.\n\nSince the democratic transition began in 2011, there has been continuous violence as 280 people have been killed and 140,000 forced to flee from their homes in the Rakhine state. A UN envoy reported in March 2013 that unrest had re-emerged between Myanmar's Buddhist and Muslim communities, with violence spreading to towns that are located closer to Yangon.\n\nRohingya left by boat \n\nThe Rohingya have been leaving the Rakhine State by boat in search for jobs in Malaysia these recent years. Often, the boats are very small and dangerous on the open seas. An estimated 100,000 Rohingya have fled Myanmar in the last two years in fear of persecution and violence. They have been fleeing to Thailand, Malaysia, or even Australia for refuge. Over 200 have died in recent years and over 7,000 have been held in detention centres even after surviving the boat trip.\n\n2012 Rakhine State riots \n\nA widely publicised Burmese conflict was the 2012 Rakhine State riots, a series of conflicts that primarily involved the ethnic Rakhine Buddhist people and the Rohingya Muslim people in the northern Rakhine State—an estimated 90,000 people were displaced as a result of the riots.\n\nThe immediate cause of the riots is unclear, with many commentators citing the killing of ten Burmese Muslims by ethnic Rakhine after the rape and murder of a Rakhine woman as the main cause. Whole villages have been \"decimated\". Over 300 houses and a number of public buildings have been razed. According to Tun Khin, the president of the Burmese Rohingya Organisation UK (BROUK), as of 28 June 2012, 650 Rohingyas have been killed, 1,200 are missing, and more than 80,000 have been displaced. According to the Myanmar authorities, the violence, between ethnic Rakhine Buddhists and Rohingya Muslims, left 78 people dead, 87 injured, and thousands of homes destroyed. It displaced more than 52,000 people.\n\nThe government has responded by imposing curfews and by deploying troops in the regions. On 10 June 2012, a state of emergency was declared in Rakhine, allowing the military to participate in administration of the region. The Burmese army and police have been accused of targeting Rohingya Muslims through mass arrests and arbitrary violence. A number of monks' organisations that played a vital role in Myanmar's struggle for democracy have taken measures to block any humanitarian assistance to the Rohingya community.\n\nFreedom of speech \n\nRestrictions on media censorship were significantly eased in August 2012 following demonstrations by hundreds of protesters who wore shirts demanding that the government \"Stop Killing the Press.\" The most significant change has come in the form that media organisations will no longer have to submit their content to a censorship board before publication. However, as explained by one editorial in the exiled press The Irrawaddy, this new \"freedom\" has caused some Burmese journalists to simply see the new law as an attempt to create an environment of self-censorship as journalists \"are required to follow 16 guidelines towards protecting the three national causes — non-disintegration of the Union, non-disintegration of national solidarity, perpetuation of sovereignty — and \"journalistic ethics\" to ensure their stories are accurate and do not jeopardise national security.\" In July 2014 five journalists were sentenced to 10 years in jail after publishing a report saying the country was planning to build a new chemical weapons plant. Journalists described the jailings as a blow to the recently-won news media freedoms that had followed five decades of censorship and persecution. Two Reuters journalists were charged and imprisoned on December 12, 2017, for violating state secrets law when they were covering the mass exodus of the Rohingya Muslim minority.Eltagouri,  Marwa. (13 December 2017). \"Two journalists covering Rohingya crisis in Burma arrested for possessing ‘secret papers’.[https://www.washingtonpost.com/news/worldviews/wp/2017/12/13/two-journalists-covering-rohingya-crisis-in-burma-arrested-for-possessing-secret-papers/?tid=sm_tw Washington Post website]  Retrieved 13 December 2017.\n\nPraise for the 2011 government reforms \n\nAccording to the Crisis Group, since Myanmar transitioned to a new government in August 2011, the country's human rights record has been improving. Previously giving Myanmar its lowest rating of 7, the 2012 Freedom in the World report also notes improvement, giving Myanmar a 6 for improvements in civil liberties and political rights, the release of political prisoners, and a loosening of restrictions. In 2013, Myanmar improved yet again, receiving a score of five in civil liberties and a six in political freedoms.\n\nThe government has assembled a National Human Rights Commission that consists of 15 members from various backgrounds. Several activists in exile, including Thee Lay Thee Anyeint members, have returned to Myanmar after President Thein Sein's invitation to expatriates to return home to work for national development. In an address to the United Nations Security Council on 22 September 2011, Myanmar's Foreign Minister Wunna Maung Lwin confirmed the government's intention to release prisoners in the near future.\n\nThe government has also relaxed reporting laws, but these remain highly restrictive. In September 2011, several banned websites, including YouTube, Democratic Voice of Burma and Voice of America, were unblocked. A 2011 report by the Hauser Center for Nonprofit Organizations found that, while contact with the Myanmar government was constrained by donor restrictions, international humanitarian non-governmental organisations (NGOs) see opportunities for effective advocacy with government officials, especially at the local level. At the same time, international NGOs are mindful of the ethical quandary of how to work with the government without bolstering or appeasing it.[https://web.archive.org/web/20120114003421/http://www.hks.harvard.edu/hauser/engage/humanitarianorganizations/research/assets/Myanmar%20Report%20Final%20Version%209-8-11.pdf Working Through Ambiguity: International NGOs in Myanmar]. Soubhik Ronnie Saha The Hauser Center for Nonprofit Organizations Harvard University September 2011\n\n2013 onwards \n\nFollowing Thein Sein's first ever visit to the UK and a meeting with Prime Minister David Cameron, the Myanmar president declared that all of his nation's political prisoners will be released by the end of 2013, in addition to a statement of support for the well-being of the Rohingya Muslim community. In a speech at Chatham House, he revealed that \"We [Myanmar government] are reviewing all cases. I guarantee to you that by the end of this year, there will be no prisoners of conscience in Myanmar.\", in addition to expressing a desire to strengthen links between the UK and Myanmar's military forces. Homosexual acts are illegal in Myanmar. In 2016, Myanmar leader Aung San Suu Kyi was accused of failing to protect Myanmar's Muslim minority.\"[https://www.independent.co.uk/news/world/asia/rohingya-muslims-burma-myanmar-aung-san-suu-kyi-legitimising-genocide-a7439151.html Burma's Aung San Suu Kyi accused of 'legitimising genocide of Rohingya Muslims']\". The Independent. 25 November 2016. Since August 2017 Doctors Without Borders have treated 113 Rohingya refugee females for sexual assault with all but one describing military assailants.AP News. (12 December 2017). \"Army's rape of Rohingya women sweeping, methodical: AP\". [http://www.aljazeera.com/news/2017/12/rape-rohingya-women-sweeping-methodical-ap-171211063236832.html Al Jazeera website] Retrieved 12 December 2017.\n\nNuclear weapons programme \n\nThere has been speculation that Myanmar is interested in developing nuclear weapons, and that North Korea was planning to export nuclear technology to Myanmar.[http://www.smh.com.au/world/Myanmarx2019s-nuclear-secrets-20090731-e4fv.html Myanmar's nuclear secrets], The Sydney Morning Herald. 1 August 2009.   These reports are based on evidence gathered from anti-government Burmese. Myanmar is a signatory to a special ASEAN treaty that bans all types of nuclear weapons in signatory states in Southeast Asia.[https://www.theguardian.com/world/2005/apr/21/Myanmar.simonjeffery Revealed:]\n\nEconomy \n\nMyanmar is one of the poorest nations in Southeast Asia, suffering from decades of stagnation, mismanagement and isolation. The lack of an educated workforce skilled in modern technology hinders Myanmar's economy, although recent reforms and developments carried out by the new government, in collaboration with foreign countries and organisations aim to make this a thing of the past.\n\nMyanmar lacks adequate infrastructure. Goods travel primarily across the Thai border (where most illegal drugs are exported) and along the Irrawaddy River. Railways are old and rudimentary, with few repairs since their construction in the late 19th century. Highways are normally unpaved, except in the major cities.\n\nIn 2010–2011, Bangladesh exported products worth $9.65 million to Myanmar against its import of $179 million.  The annual import of medicine and medical equipment to Myanmar during the 2000s was 160 million USD.\n\nIn recent years, both China and India have attempted to strengthen ties with the government for economic benefit. Many nations, including the United States and Canada, and the European Union, have imposed investment and trade sanctions on Myanmar. The United States and European Union eased most of their sanctions in 2012. Foreign investment comes primarily from China, Singapore, the Philippines, South Korea, India, and Thailand.\n\nEconomic history \n\nUnder British administration, Myanmar was the second-wealthiest country in South-East Asia. It had been the world's largest exporter of rice. Myanmar also had a wealth of natural and labour resources. British Burma began exporting crude oil in 1853, making it one of the earliest petroleum producers in the world. It produced 75% of the world's teak and had a highly literate population. The wealth was however, mainly concentrated in the hands of Europeans. In the 1930s, agricultural production fell dramatically as international rice prices declined, and did not recover for several decades. Plans to broaden the new prosperity and extend the reach of modern civilization were halted by the outbreak of the Second World War.\n\nDuring the Japanese invasion of the area in World War II, the British followed a scorched earth policy. They destroyed the major government buildings, oil wells and mines for tungsten, tin, lead and silver to keep them from the Japanese. Myanmar was bombed extensively by both sides. After independence, the country was in ruins with its major infrastructure completely destroyed. The British then granted independence to the colony, and handed over their plans to rebuild to the new government. After a parliamentary government was formed in 1948, Prime Minister U Nu embarked upon a policy of nationalisation and the state was declared the owner of all land. The government also tried to implement a poorly considered Eight-Year plan. By the 1950s, rice exports had fallen by two thirds and mineral exports by over 96% (as compared to the pre-World War II period). Plans were partly financed by printing money, which led to inflation.\n\nThe 1962 coup d'état was followed by an economic scheme called the Burmese Way to Socialism, a plan to nationalise all industries, with the exception of agriculture. The catastrophic programme turned Myanmar into one of the world's most impoverished countries. Myanmar's admittance to least developed country status by the UN in 1987 highlighted its economic bankruptcy.\n\nIn Myanmar, political and economic ideological struggles have affected living standards. Decades of civil war and unrest have contributed to Myanmar's current levels of poverty and lack of economic progress. Improving basic human, social and economic infrastructure required to advance individual living standards have not received focused government efforts.\n\nAgriculture \n\nThe major agricultural product is rice, which covers about 60% of the country's total cultivated land area. Rice accounts for 97% of total food grain production by weight. Through collaboration with the International Rice Research Institute 52 modern rice varieties were released in the country between 1966 and 1997, helping increase national rice production to 14 million tons in 1987 and to 19 million tons in 1996. By 1988, modern varieties were planted on half of the country's ricelands, including 98 percent of the irrigated areas. , Facts About Cooperation, International Rice Research Institute. Retrieved 25 September 2007. In 2008 rice production was estimated at 50 million tons.\n\nDrug production \n\nMyanmar is also the world's second largest producer of opium, accounting for 25% of entire world production and is a major source of illegal drugs, including amphetamines.\nOpium bans implemented since 2002 after international pressure have left ex-poppy farmers without sustainable sources of income in the Kokang and Wa regions. They depend on casual labour for income.[http://www.tni.org/briefing/golden-triangle-rubber-belt Drug Policy Briefing nr.29] of the Transnational Institute.\n\nNatural resources \n\nMyanmar produces precious stones such as rubies, sapphires, pearls, and jade. Rubies are the biggest earner; 90% of the world's rubies come from the country, whose red stones are prized for their purity and hue. Thailand buys the majority of the country's gems. Myanmar's \"Valley of Rubies\", the mountainous Mogok area, 200 km north of Mandalay, is noted for its rare pigeon's blood rubies and blue sapphires.\n\nMany US and European jewellery companies, including Bulgari, Tiffany and Cartier, refuse to import these stones based on reports of deplorable working conditions in the mines. Human Rights Watch has encouraged a complete ban on the purchase of Burmese gems based on these reports and because nearly all profits go to the ruling junta, as the majority of mining activity in the country is government-run. The government of Myanmar controls the gem trade by direct ownership or by joint ventures with private owners of mines.\n\nOther industries include agricultural goods, textiles, wood products, construction materials, gems, metals, oil and natural gas.\n\nMyanmar Engineering Society has identified at least 39 locations capable of geothermal power production and some of these hydrothermal reservoirs lie quite close to Yangon which is a significant underutilized resource for electrical production.\n\nTourism \n\nSince 1992, the government has encouraged tourism in the country; however, fewer than 270,000 tourists entered the country in 2006 according to the Myanmar Tourism Promotion Board. Myanmar's Minister of Hotels and Tourism Saw Lwin has stated that the government receives a significant percentage of the income of private sector tourism services.\n\nThe most popular available tourist destinations in Myanmar include big cities such as Yangon and Mandalay; religious sites in Mon State, Pindaya, Bago and Hpa-An; nature trails in Inle Lake, Kengtung, Putao, Pyin Oo Lwin; ancient cities such as Bagan and Mrauk-U; as well as beaches in Nabule, Ngapali, Ngwe-Saung, Mergui. Nevertheless, much of the country is off-limits to tourists, and interactions between foreigners and the people of Myanmar, particularly in the border regions, are subject to police scrutiny. They are not to discuss politics with foreigners, under penalty of imprisonment and, in 2001, the Myanmar Tourism Promotion Board issued an order for local officials to protect tourists and limit \"unnecessary contact\" between foreigners and ordinary Burmese people.\n\nThe most common way for travellers to enter the country seems to be by air. According to the website Lonely Planet, getting into Myanmar is problematic: \"No bus or train service connects Myanmar with another country, nor can you travel by car or motorcycle across the border – you must walk across.\", and states that, \"It is not possible for foreigners to go to/from Myanmar by sea or river.\" There are a small number of border crossings that allow the passage of private vehicles, such as the border between Ruili (China) to Mu-se, the border between Htee Kee (Myanmar) and Phu Nam Ron (Thailand)—the most direct border between Dawei and Kanchanaburi, and the border between Myawaddy (Myanmar) and Mae Sot (Thailand). At least one tourist company has successfully run commercial overland routes through these borders since 2013.[http://www.dragoman.com/holidays/details/south-east-asia-between-kunming-and-bangkok-via-burma Dragoman]  \"From Mae Sai (Thailand) you can cross to Tachileik, but can only go as far as Kengtung. Those in Thailand on a visa run can cross to Kawthaung but cannot venture farther into Myanmar.\"\n\nFlights are available from most countries, though direct flights are limited to mainly Thai and other ASEAN airlines. According to Eleven magazine, \"In the past, there were only 15 international airlines and increasing numbers of airlines have began launching direct flights from Japan, Qatar, Taiwan, South Korea, Germany and Singapore.\" Expansions were expected in September 2013, but yet again are mainly Thai and other Asian-based airlines according to Eleven Media Group's Eleven, \"Thailand-based Nok Air and Business Airlines and Singapore-based Tiger Airline\".\n\nEconomic sanctions \n\nThe Government of Myanmar was under economic sanctions by the US Treasury Department (31 CFR Part 537, 16 August 2005) and by Executive orders 13047 (1997), 13310 (2003), 13448 (2007), 13464 (2008), and the most recent, 13619 (2012). There exists debate as to the extent to which the American-led sanctions have had more adverse effects on the civilian population than on the military rulers.\n\nFrom May 2012 to February 2013, the United States began to lift its economic sanctions on Myanmar \"in response to the historic reforms that have been taking place in that country.\" Sanctions remain in place for blocked banks  and for any business entities that are more than 50% owned by persons on \"OFAC's Specially Designated Nationals and Blocked Persons list (SDN list)\".\n\nDuring her first official visit to Washington, D.C. in September 2016, Myanmar's State Counsellor Aung San Suu Kyi met with US President Barack Obama, who announced that long-standing trade sanctions against Myanmar are to be lifted, adding, \"It is the right thing to do to ensure the people of Burma see rewards from a new way of doing business, and a new government.\"[http://www.bbc.com/news/world-africa-37365835], BBC News Services, retrieved 30 September 2016\n\nGovernment stakeholders in business \n\nThe military has the majority stakeholder position in all of the major industrial corporations of the country (from oil production and consumer goods to transportation and tourism).\n\nEconomic liberalisation, post–2011 \n\nIn March 2012, a draft foreign investment law emerged, the first in more than 2 decades. Foreigners will no longer need a local partner to start a business in the country, and will be able to legally lease but not own property. The draft law also stipulates that Burmese citizens must constitute at least 25% of the firm's skilled workforce, and with subsequent training, up to 50–75%.\n\nIn 2012, the Asian Development Bank formally began re-engaging with the country, to finance infrastructure and development projects in the country. The United States, Japan, and the European Union countries have also begun to reduce or eliminate economic sanctions to allow foreign direct investment which will provide the Burmese government with additional tax revenue.\n\nIn December 2014, Myanmar signed an agreement to set up its first stock exchange. The Yangon Stock Exchange Joint Venture Co. Ltd will be set up with Myanma Economic Bank sharing 51%, Japan's Daiwa Institute of Research Ltd 30.25% and Japan Exchange Group 18.75%. The Yangon Stock Exchange (YSX) officially opened for business on Friday, 25 March 2016. First Myanmar Investment Co., Ltd. (FMI) became the first stock to be traded after receiving approval for an opening price of 26,000 kyats ($22).\n\nUnits of measurement \n\nAccording to The World Factbook, Myanmar is one of three countries along with Liberia and the United States that has not adopted the International System of Units (SI) metric system as their official system of weights and measures. The common units of measure are unique to Myanmar, but the government web pages generally use both imperial units and metric units.\n\nIn June 2011, the Burmese government's Ministry of Commerce began discussing proposals to reform the measurement system and adopt the International System of Units used by most of its trading partners.  In October 2013 it was reported that Dr. Pwint San, Deputy Minister for Commerce, had announced that the country was preparing to adopt the International System of Units.\n\nSociety \n\nDemographics \n\nThe provisional results of the 2014 Myanmar Census show that the total population is 51,419,420. This figure includes an estimated 1,206,353 persons in parts of northern Rakhine State, Kachin State and Kayin State who were not counted. People who were out of the country at the time of the census are not included in these figures. There are over 600,000 registered migrant workers from Myanmar in Thailand, and millions more work illegally. Burmese migrant workers account for 80% of Thailand's migrant workers. Population density is 76 /km2, among the lowest in Southeast Asia.\n\nMyanmar's fertility rate  is 2.23, which is slightly above replacement level and is low compared to Southeast Asian countries of similar economic standing, such Cambodia (3.18) and Laos (4.41). There has been a significant decline in fertility, from a rate of 4.7 children per woman in 1983, down to 2.4 in 2001, despite the absence of any national population policy. The fertility rate is much lower in urban areas.\n\nThe relatively rapid decline in fertility is attributed to several factors, including extreme delays in marriage (almost unparalleled among developing countries in the region), the prevalence of illegal abortions, and the high proportion of single, unmarried women of reproductive age, with 25.9% of women aged 30–34 and 33.1% of men and women aged 25–34 single.[https://www.un.org/esa/population/publications/worldmarriage/worldmarriagepatterns2000.pdf WorldMarriage Patterns 2000]. United Nations\n\nThese patterns stem from economic dynamics. The economic hardship, which results in the delay of marriage and family-building; the average age of marriage in Myanmar is 27.5 for men, 26.4 for women.\n\nLargest cities \n\nEthnic groups \n\nMyanmar is ethnically diverse. The government recognises 135 distinct ethnic groups. There are at least 108 different ethnolinguistic groups in Myanmar, consisting mainly of distinct Tibeto-Burman peoples, but with sizeable populations of Tai–Kadai, Hmong–Mien, and Austroasiatic (Mon–Khmer) peoples.\n\nThe Bamar form an estimated 68% of the population. 10% of the population are Shan. The Kayin make up 7% of the population. The Rakhine people constitute 4% of the population. Overseas Chinese form approximately 3% of the population. Myanmar's ethnic minority groups prefer the term \"ethnic nationality\" over \"ethnic minority\" as the term \"minority\" furthers their sense of insecurity in the face of what is often described as \"Burmanisation\"—the proliferation and domination of the dominant Bamar culture over minority cultures.\n\nMon, who form 2% of the population, are ethno-linguistically related to the Khmer. Overseas Indians are 2%. The remainder are Kachin, Chin, Rohingya, Anglo-Indians, Gurkha, Nepali and other ethnic minorities. Included in this group are the Anglo-Burmese. Once forming a large and influential community, the Anglo-Burmese left the country in steady streams from 1958 onwards, principally to Australia and the UK. It is estimated that 52,000 Anglo-Burmese remain in Myanmar. , 110,000 Burmese refugees were living in refugee camps in Thailand.\n\nRefugee camps exist along Indian, Bangladeshi and Thai borders while several thousand are in Malaysia. Conservative estimates state that there are over 295,800 minority refugees from Myanmar, with the majority being Rohingya, Karen, and Karenni are principally located along the Thai-Myanmar border. There are nine permanent refugee camps along the Thai-Myanmar border, most of which were established in the mid-1980s. The refugee camps are under the care of the [http://www.tbbc.org/ Thai-Burma Border Consortium (TBBC)]. Since 2006, over 55,000 Burmese refugees have been resettled in the United States.\"[https://web.archive.org/web/20120914041135/http://www.acf.hhs.gov/programs/orr/data/ Office Of Refugee Resettlement: Data]\". U.S. Department of Health and Human Services.\n\nThe persecution of Burmese Indians, Burmese Chinese and other ethnic groups after the military coup headed by General Ne Win in 1962 led to the expulsion or emigration of 300,000 people. They migrated to escape racial discrimination and the wholesale nationalisation of private enterprise that took place in 1964. The Anglo-Burmese at this time either fled the country or changed their names and blended in with the broader Burmese society.\n\nMany Rohingya Muslims have fled Myanmar. Many refugees headed to neighbouring Bangladesh, including 200,000 in 1978 as a result of the King Dragon operation in Arakan. 250,000 more left in 1991.\n\nLanguages \n\nMyanmar is home to four major language families: Sino-Tibetan, Tai–Kadai, Austro-Asiatic, and Indo-European. Sino-Tibetan languages are most widely spoken. They include Burmese, Karen, Kachin, Chin, and Chinese (mainly Hokkien). The primary Tai–Kadai language is Shan. Mon, Palaung, and Wa are the major Austroasiatic languages spoken in Myanmar. The two major Indo-European languages are Pali, the liturgical language of Theravada Buddhism, and English. More than a hundred languages are spoken in total. Since many of them are known only within small tribes around the country, they may have been lost (many if not all) after a few generations.\n\nBurmese, the mother tongue of the Bamar and official language of Myanmar, is related to Tibetan and Chinese. It is written in a script consisting of circular and semi-circular letters, which were adapted from the Mon script, which in turn was developed from a southern Indian script in the 5th century. The earliest known inscriptions in the Burmese script date from the 11th century. It is also used to write Pali, the sacred language of Theravada Buddhism, as well as several ethnic minority languages, including Shan, several Karen dialects, and Kayah (Karenni), with the addition of specialised characters and diacritics for each language.\n\nThe Burmese language incorporates widespread usage of honorifics and is age-oriented. Burmese society has traditionally stressed the importance of education. In villages, secular schooling often takes place in monasteries. Secondary and tertiary education take place at government schools.\n\nReligion \n\nMany religions are practised in Myanmar. Religious edifices and orders have been in existence for many years. Festivals can be held on a grand scale. The Christian and Muslim populations do, however, face religious persecution and it is hard, if not impossible, for non-Buddhists to join the army or get government jobs, the main route to success in the country.\"Ethnic and Religious Diversity: Myanmar's Unfolding Nemesis\", Matthews, Bruce, Institute of South East Asian Studies, Visiting Researcher Series, Volume 2001, No. 3. 2001. Such persecution and targeting of civilians is particularly notable in Eastern Myanmar, where over 3000 villages have been destroyed in the past ten years. More than 200,000 Muslims have fled to Bangladesh over the last 20 years to escape persecution.\n\nA large majority of the population practices Buddhism; estimates range from 80%[http://www.globalreligiousfutures.org/countries/burma-myanmar/religious_demography#/?affiliations_religion_id\n0&affiliations_year2010 Pew Research Center's Religion & Public Life Project: Burma]. Pew Research Center. 2010. to 89%. According to 2014 Myanmar Census, 87.9% of the population identifies as Buddhists. Theravāda Buddhism is the most widespread. Other religions are practised largely without obstruction, with the notable exception of some religious minorities such as the Rohingya people, who have continued to have their citizenship status denied and treated as illegal immigrants instead, and Christians in Chin State.\n\nAccording to 2014 census, 6.2% of the population identifies as Christian; 4.3% as Muslim; 0.8% as followers of tribal religions; 0.5% as Hindus; 0.2% as followers of other religions; and 0.1% follow no religion. According to the 2010 estimates of the Pew Research Center, 7% of the population is Christian; 4% is Muslim; 1% follows traditional animistic beliefs; and 2% follow other religions, including Mahayana Buddhism, Hinduism, and East Asian religions. Jehovah's Witnesses have been present since 1914 and have about 80 congregations around the country and a branch office in Yangon publishing in 16 languages.\nA tiny Jewish community in Rangoon had a synagogue but no resident rabbi to conduct services.\n\nAlthough Hinduism is practised by 0.5% of the population, it was a major religion in Myanmar's past. Several strains of Hinduism existed alongside both Theravada Buddhism and Mahayana Buddhism in the Mon and Pyu period in the first millennium, and down to the Pagan period (9th to 13th centuries) when \"Saivite and Vaishana elements enjoyed greater elite influence than they would later do.\"Lieberman, pp. 115–116 Burmese folk religion is practiced by many Bamars alongside Buddhism.\n\nHealth \n\nThe general state of health care in Myanmar is poor. The government spends anywhere from 0.5% to 3% of the country's GDP on health care, consistently ranking among the lowest in the world. Although health care is nominally free, in reality, patients have to pay for medicine and treatment, even in public clinics and hospitals. Public hospitals lack many of the basic facilities and equipment.\n\nThe 2010 maternal mortality rate per 100,000 births for Myanmar is 240. This is compared with 219.3 in 2008 and 662 in 1990. The under 5 mortality rate, per 1,000 births is 73 and the neonatal mortality as a percentage of under 5's mortality is 47.\n\nMyanmar's government spends the least percentage of its GDP on health care of any country in the world, and international donor organisations give less to Myanmar, per capita, than any other country except India.[https://web.archive.org/web/20090225081933/http://www.msf.org/source/countries/asia/myanmar/2008/PreventableFate/PreventableFatereport.pdf A preventable fate: The failure of ART scale-up in Myanmar]. Médecins Sans Frontières. November 2008 According to the report named \"Preventable Fate\", published by Doctors without Borders, 25,000 Burmese AIDS patients died in 2007, deaths that could largely have been prevented by antiretroviral therapy drugs and proper treatment.\n\nHIV/AIDS, recognised as a disease of concern by the Burmese Ministry of Health, is most prevalent among sex workers and intravenous drug users. In 2005, the estimated adult HIV prevalence rate in Myanmar was 1.3% (200,000–570,000 people), according to UNAIDS, and early indicators of any progress against the HIV epidemic are inconsistent. However, the National AIDS Programme Myanmar found that 32% of sex workers and 43% of intravenous drug users in Myanmar have HIV.\n\nEducation \n\nAccording to the UNESCO Institute of Statistics, Myanmar's official literacy rate as of 2000 was 90%. Historically, Myanmar has had high literacy rates. To qualify for least developed country status by the UN to receive debt relief, Myanmar lowered its official literacy rate from 79% to 19% in 1987. \n\nThe educational system of Myanmar is operated by the government agency, the Ministry of Education. The education system is based on the United Kingdom's system due to nearly a century of British and Christian presences in Myanmar. Nearly all schools are government-operated, but there has been a recent increase in privately funded English language schools. Schooling is compulsory until the end of elementary school, approximately about 9 years old, while the compulsory schooling age is 15 or 16 at international level.\n\nThere are 101 universities, 12 institutes, 9 degree colleges and 24 colleges in Myanmar, a total of 146 higher education institutions.Chronicle of National Development Comparison Between Period Preceding 1988 and after (up to 31 December 2006). There are 10 Technical Training Schools, 23 nursing training schools, 1 sport academy and 20 midwifery schools. There are 2047 Basic Education High Schools, 2605 Basic Education Middle Schools, 29944 Basic Education Primary Schools and 5952 Post Primary Schools. 1692 multimedia classrooms exist within this system.\n\nThere are four international schools acknowledged by WASC and College Board—The International School Yangon (ISY), Myanmar International School (MIS), Yangon International School (YIS) and International School of Myanmar (ISM) in Yangon.\n\nCrime \n\nIn 2012, Myanmar had a murder rate of 15.2 per 100,000 population. There were a total of 8,044 murders in Myanmar in 2012. Factors influencing Myanmar's high murder rate include communal violence and armed conflict. Myanmar is one of the world's most corrupt nations. The 2012 Transparency International Corruption Perceptions Index ranked the country at number 171, out of 176 countries in total.\n\nMyanmar is the world's second largest producer of opium after Afghanistan, producing some 25% of the world's opium, and forms part of the Golden Triangle. The opium industry was a monopoly during colonial times and has since been illegally operated by corrupt officials in the Burmese military and rebel fighters, primarily as the basis for heroin manufacture.\n\nMyanmar is the largest producer of methamphetamines in the world, with the majority of Ya ba found in Thailand produced in Myanmar, particularly in the Golden Triangle and Northeastern Shan State, which borders Thailand, Laos and China. Burmese-produced ya ba is typically trafficked to Thailand via Laos, before being transported through the northeastern Thai region of Isan.\n\nCulture \n\nA diverse range of indigenous cultures exist in Myanmar, the majority culture is primarily Buddhist and Bamar. Bamar culture has been influenced by the cultures of neighbouring countries. This is manifested in its language, cuisine, music, dance and theatre. The arts, particularly literature, have historically been influenced by the local form of Theravada Buddhism. Considered the national epic of Myanmar, the Yama Zatdaw, an adaptation of India's Ramayana, has been influenced greatly by Thai, Mon, and Indian versions of the play. Buddhism is practised along with nat worship, which involves elaborate rituals to propitiate one from a pantheon of 37 nats.\n\nIn a traditional village, the monastery is the centre of cultural life. Monks are venerated and supported by the lay people. A novitiation ceremony called shinbyu is the most important coming of age events for a boy, during which he enters the monastery for a short time. All male children in Buddhist families are encouraged to be a novice (beginner for Buddhism) before the age of twenty and to be a monk after the age of twenty. Girls have ear-piercing ceremonies () at the same time. Burmese culture is most evident in villages where local festivals are held throughout the year, the most important being the pagoda festival. Many villages have a guardian nat, and superstition and taboos are commonplace.\n\nBritish colonial rule introduced Western elements of culture to Myanmar. Myanmar's education system is modelled after that of the United Kingdom. Colonial architectural influences are most evident in major cities such as Yangon. Many ethnic minorities, particularly the Karen in the southeast and the Kachin and Chin who populate the north and northeast, practice Christianity. According to The World Factbook, the Burman population is 68% and the ethnic groups constitute 32%. However, the exiled leaders and organisations claims that ethnic population is 40%, which is implicitly contrasted with CIA report (official US report).\n\nCuisine \n\nBurmese cuisine is characterised by extensive use of fish products such as fish sauce, ngapi (fermented seafood) and dried prawn.\n\nMohinga is the traditional breakfast dish and is Myanmar's national dish. Seafood is a common ingredient in coastal cities such as Sittwe, Kyaukpyu, Mawlamyaing (formerly Moulmein), Mergui (Myeik) and Dawei, while meat and poultry are more commonly used in landlocked cities like Mandalay. Freshwater fish and shrimp have been incorporated into inland cooking as a primary source of protein and are used in a variety of ways, fresh, salted whole or filleted, salted and dried, made into a salty paste, or fermented sour and pressed.\n\nBurmese cuisine also includes a variety of salads (a thoke), centred on one major ingredient, ranging from starches like rice, wheat and rice noodles, glass noodles and vermicelli, to potato, ginger, tomato, kaffir lime, long bean, lahpet (pickled tea leaves), and ngapi (fish paste).\n\nSport \n\nThe Lethwei, Bando, Banshay, and Pongyi thaing martial arts and chinlone are traditional sports in Myanmar. Football is played all over the country, even in villages.\n\nThe 2013 Southeast Asian Games took place in Naypyidaw, Yangon, Mandalay and Ngwesaung Beach in December representing the third occasion that the event has been staged in Myanmar. Myanmar previously hosted the Games in 1961 and 1969.\n\nArt \n\nBurmese contemporary art has developed rather on its own terms and quite rapidly. While most young artists born after 1980s have greater chances of art practice outside the country.\n\nOne of the first to study western art was Ba Nyan. Together with Ngwe Gaing and a handful of other artists were the pioneers of western painting style. Later on most young children learned the concepts from them. Some well known contemporary artists are Lun Gywe, Aung Kyaw Htet, MPP Yei Myint, Myint Swe, Min Wai Aung, Aung Myint, Khin Maung Yin, Po Po and Zaw Zaw Aung.\n\nBurmese traditional art concepts is more popular and respected by Burmese people and people from abroad.\n\nMedia and communications \n\nDue to Myanmar's political climate, there are not many media companies in relation to the country's population, although a certain number exists. Some are privately owned. All programming must meet with the approval of the censorship board.\n\nThe Burmese government announced on 20 August 2012 that it will stop censoring media before publication. Following the announcement, newspapers and other outlets no longer required approved by state censors; however, journalists in the country can still face consequences for what they write and say.\n\nIn April 2013, international media reports were published to relay the enactment of the media liberalisation reforms that we announced in August 2012. For the first time in numerous decades, the publication of privately owned newspapers commenced in the country.\n\nInternet \n\nInternet use is estimated to be relatively low compared to other countries. Myanmar's internet used to be subject to censorship, and authorities viewed e-mails and posts on Internet blogs until 2012 when the government removed media censorship. During the strict censorship days, activity at internet cafes was regulated, and one blogger named Zarganar was sentenced to a few years in prison for publishing a video of destruction caused by Cyclone Nargis in 2008; Zarganar was released in October 2011.\n\nIn regards to communications infrastructure, Myanmar is the last ranked Asian country in the World Economic Forum's Network Readiness Index (NRI) – an indicator for determining the development level of a country's information and communication technologies. With 148 countries reported on, Myanmar ranked number 146 overall in the 2014 NRI ranking. No data is currently available for previous years.\n\nFilm \n\nMyanmar's first film was a documentary of the funeral of Tun Shein—a leading politician of the 1910s, who campaigned for Burmese independence in London. The first Burmese silent film Myitta Ne Thuya (Love and Liquor) in 1920 which proved a major success, despite its poor quality due to a fixed camera position and inadequate film accessories. During the 1920s and 1930s, many Burmese-owned film companies made and produced several films. The first Burmese sound film was produced in 1932 in Bombay, India with the title Ngwe Pay Lo Ma Ya (Money Can't Buy It). After World War II, Burmese cinema continued to address political themes. Many of the films produced in the early Cold War era had a strong propaganda element to them.\n\nIn the era that followed the political events of 1988, the film industry has been increasingly controlled by the government. Film stars who had been involved in the political activities were banned from appearing in films. The government issues strict rules on censorship and largely determines who produces films, as well as who gets academy awards.\n\nOver the years, the movie industry has also shifted to producing many lower budget direct-to-video films.\n\nMost of the movies produced nowadays are comedies.Kyi Soe Tun quoted in the Bangkok Post, 11 August 2006 In 2008, only 12 films worthy of being considered for an Academy Award were made, although at least 800 VCDs were produced.[https://web.archive.org/web/20120328075748/http://irrawaddy.org/article.php?art_id=14937 Through the Director's Lens]. Irrawaddy. 16 January 2009\n\nMyanmar is the primary subject of a 2007 graphic novel titled Chroniques Birmanes by Québécois author and animator, Guy Delisle. The graphic novel was translated into English under the title Burma Chronicles in 2008. In 2009, a documentary about Burmese videojournalists called Burma VJ was released. This film was nominated for Best Documentary Feature at the 2010 Academy Awards. The Lady had its world premiere on 12 September 2011 at the 36th Toronto International Film Festival. Myanmar. http://en.wikipedia.org/?curid=19457."
  }
}
