{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16433",
  "eid" : "260d6af0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778573087,
  "textBody" : "Jalāl ad-Dīn Muhammad Rūmī (), also known as Jalāl ad-Dīn Muhammad Balkhī (), Mevlânâ/Mawlānā (, \"our master\"), Mevlevî/Mawlawī (, \"my master\"), and more popularly simply as Rumi (30 September 1207 – 17 December 1273), was a 13th-century PersianRitter, H.; Bausani, A. \"ḎJ̲alāl al-Dīn Rūmī b. Bahāʾ al-Dīn Sulṭān al-ʿulamāʾ Walad b. Ḥusayn b. Aḥmad Ḵh̲aṭībī.\" Encyclopaedia of Islam. Edited by: P. Bearman, Th. Bianquis, C.E. Bosworth, E. van Donzel and W.P. Heinrichs. Brill, 2007. Brill Online. Excerpt: \"known by the sobriquet Mewlānā, persian poet and founder of the Mewlewiyya order of dervishes\"Franklin D. Lewis, \"Rumi: Past and Present, East and West: The life, Teaching and poetry of Jalal Al-Din Rumi\", Oneworld Publication Limited, 2008 p. 9: \"How is that a Persian boy born almost eight hundred years ago in Khorasan, the northeastern province of greater Iran, in a region that we identify today as in Asia, but was considered in those days as part of the greater Persian cultural sphere, wound up in central Anatolia on the receding edge of the Byzantine cultural sphere\" Sunni Muslim poet, jurist, Islamic scholar, theologian, and Sufi mystic.Annemarie Schimmel, \"The Mystery of Numbers\", Oxford University Press, Apr 7, 1994. p. 51: \"These examples are taken from the Persian mystic Rumi's work, not from Chinese, but they express the yang-yin relationship with perfect lucidity.\" Rumi's influence transcends national borders and ethnic divisions: Iranians, Tajiks, Turks, Greeks, Pashtuns, other Central Asian Muslims, and the Muslims of South Asia have greatly appreciated his spiritual legacy for the past seven centuries.Seyyed Hossein Nasr, \"Islamic Art and Spirituality\", Suny Press, 1987. p. 115: \"Jalal al-Din was born in a major center of Persian culture, Balkh, from Persian speaking parents, and is the product of that Islamic Persian culture which in the 7th/13th century dominated the 'whole of the eastern lands of Islam and to which present day Persians as well as Turks, Afghans, Central Asian Muslims and the Muslims of the Indo-Pakistani subcontinent are heir. It is precisely in this world that the sun of his spiritual legacy has shone most brillianty during the past seven centuries. The father of Jalal al-Din, Muhammad ibn Husayn Khatibi, known as Baha al-Din Walad and entitled Sultan al-'ulama', was an outstanding Sufi in Balkh connected to the spiritual lineage of Najm al-Din Kubra.\" His poems have been widely translated into many of the world's languages and transposed into various formats. Rumi has been described as the \"most popular poet\" and the \"best selling poet\" in the United States.\n\nRumi's works are written mostly in Persian, but occasionally he also used Turkish, Arabic, and Greek,Δέδες, Δ. 1993. Ποιήματα του Μαυλανά Ρουμή. Τα Ιστορικά 10.18–19: 3–22.Meyer, G. 1895. Die griechischen Verse in Rabâbnâma. Byzantinische Zeitschrift 4: 401–411. in his verse. His Masnavi (Mathnawi), composed in Konya, is considered one of the greatest poems of the Persian language.Louis Gardet, \"Religion and Culture\" in The Cambridge History of Islam—Part VIII: Islamic Society and Civilization, edited by P. M. Holt, Ann K. S. Lambton, Bernard Lewis, Cambridge University Press (1977), p. 586: \"It is sufficient to mention 'Aziz al-Din Nasafi, Farid al-Din 'Attar and Sa'adi, and above all Jalal al-Din Rumi, whose Mathnawi remains one of the purest literary glories of Persia\"C.E. Bosworth, \"Turkmen Expansion towards the west\" in UNESCO History of Humanity, Volume IV, titled \"From the Seventh to the Sixteenth Century\", UNESCO Publishing / Routledge, p. 391: \"While the Arabic language retained its primacy in such spheres as law, theology and science, the culture of the Seljuk court and secular literature within the sultanate became largely Persianized; this is seen in the early adoption of Persian epic names by the Seljuk rulers (Qubād, Kay Khusraw and so on) and in the use of Persian as a literary language (Turkmen must have been essentially a vehicle for everyday speech at this time). The process of Persianization accelerated in the 13th century with the presence in Konya of two of the most distinguished refugees fleeing before the Mongols, Bahā' al-Dīn Walad and his son Mawlānā Jalāl al-Dīn Rūmī, whose Mathnawī, composed in Konya, constitutes one of the crowning glories of classical Persian literature.\" His works are widely read today in their original language across Greater Iran and the Persian-speaking world. Translations of his works are very popular, most notably in Turkey, Azerbaijan, the United States, and South Asia. His poetry has influenced not only Persian literature, but also Turkish, Ottoman Turkish, Azerbaijani, as well as the literature of some other Turkic, Iranian, and Indo-Aryan languages including Chagatai, Urdu and Pashto. A deep grasp of his original poetry requires excellent command of modern Persian, and an equally good command of Islamic prophetic traditions, and the Qur'an. With such command, one may succeed in peeling back the multitude layers of meaning.\n\nName \n\nHe is most commonly called  in English. His full name is Jalāl ad-Dīn Muḥammad Balkhī () or Jalāl ad-Dīn Muḥammad Rūmī (). Jalal ad-Din is an Arabic name meaning \"Glory of the Faith\". Balkhī and Rūmī are his nisbas, meaning \"from Balkh\" and \"from Rûm\" (Roman Anatolia), respectively. According to the authoritative Rumi biographer Franklin Lewis of the University of Chicago, \"[t]he Anatolian peninsula which had belonged to the Byzantine, or eastern Roman empire, had only relatively recently been conquered by Muslims and even when it came to be controlled by Turkish Muslim rulers, it was still known to Arabs, Persians and Turks as the geographical area of Rum. As such, there are a number of historical personages born in or associated with Anatolia known as Rumi, a word borrowed from Arabic literally meaning 'Roman,' in which context Roman refers to subjects of the Byzantine Empire or simply to people living in or things associated with Anatolia.\"\n\nHe is widely known by the sobriquet Mawlānā/MolānāH. Ritter, 1991, DJALĀL al-DĪN RŪMĪ, The Encyclopaedia of Islam (Volume II: C–G), 393. () in Iran and popularly known as  in Turkey. Mawlānā () is a term of Arabic origin, meaning \"our master\".\n\nThe term  Mawlawī/Mowlavi (Persian) and  (Turkish), also of Arabic origin, meaning \"my master\", is also frequently used for him.Jalāl al-Dīn Rūmī (Maulana), Ibrahim Gamard, \"Rumi and Islam: Selections from His Stories, Poems, and Discourses, Annotated & Explained\", SkyLight Paths Publishing, February 1, 2004.\n\nLife \n\nRumi was born to native Persian-speaking parents,Annemarie Schimmel, The Triumphal Sun: A Study of the Works of Jalaloddin Rumi, SUNY Press, 1993, p. 193: \"Rumi's mother tongue was Persian, but he had learned during his stay in Konya, enough Turkish and Greek to use it, now and then, in his verse.\"Franklin Lewis: \"On the question of Rumi's multilingualism (pages 315–17), we may still say that he spoke and wrote in Persian as a native language, wrote and conversed in Arabic as a learned \"foreign\" language and could at least get by at the market in Turkish and Greek (although some wildly extravagant claims have been made about his command of Attic Greek, or his native tongue being Turkish) (Lewis 2008:xxi). (Franklin Lewis, \"Rumi: Past and Present, East and West: The Life, Teachings and Poetry of Jalal al-Din Rumi,\" One World Publication Limited, 2008).\nFranklin also points out that: \"Living among Turks, Rumi also picked up some colloquial Turkish.\"(Franklin Lewis, \"Rumi: Past and Present, East and West: The Life, Teachings and Poetry of Jalal al-Din Rumi,\" One World Publication Limited, 2008, p. 315). He also mentions Rumi composed thirteen lines in Greek (Franklin Lewis, Rumi: Past and Present, East and West: The Life, Teachings and Poetry of Jalal al-Din Rumi, One World Publication Limited, 2008, p. 316). On Rumi's son, Sultan Walad, Franklin mentions: \"Sultan Walad elsewhere admits that he has little knowledge of Turkish\" (Sultan Walad): Franklin Lewis, Rumi, \"Past and Present, East and West: The Life, Teachings and Poetry of Jalal al-Din Rumi, One World Publication Limited, 2008, p. 239) and\n\"Sultan Valad did not feel confident about his command of Turkish\" (Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2000, p. 240)\nSeyyed Hossein Nasr, Islamic Art and Spirituality, SUNY Press, 1987. p. 115: \"Jalal al-Din was born in a major center of Persian culture, Balkh, from Persian speaking parents, and is the product of that Islamic Persian culture which in the 7th/13th century dominated the 'whole of the eastern lands of Islam and to which present day Persians as well as Turks, Afghans, Central Asian Muslims and the Muslims of the Indo-Pakistani and the Muslims of the Indo-Pakistani subcontinent are heir. It is precisely in this world that the sun of his spiritual legacy has shone most brilliantly during the past seven centuries. The father of Jalal al-Din, Muhammad ibn Husayn Khatibi, known as Baha al-Din Walad and entitled Sultan al-'ulama', was an outstanding Sufi in Balkh connected to the spiritual lineage of Najm al-Din Kubra.\" originally from the Balkh, in present-day Afghanistan. He was born either in Wakhsh,Annemarie Schimmel, \"I Am Wind, You Are Fire,\" p. 11. She refers to a 1989 article by Fritz Meier: Lewis has devoted two pages of his book to the topic of Wakhsh, which he states has been identified with the medieval town of Lêwkand (or Lâvakand) or Sangtude, which is about 65 kilometers southeast of Dushanbe, the capital of present-day Tajikistan. He says it is on the east bank of the Vakhshâb river, a major tributary that joins the Amu Daryâ river (also called Jayhun, and named the Oxus by the Greeks). He further states: \"Bahâ al-Din may have been born in Balkh, but at least between June 1204 and 1210 (Shavvâl 600 and 607), during which time Rumi was born, Bahâ al-Din resided in a house in Vakhsh (Bah 2:143 [Bahâ' uddîn Walad's] book, \"Ma`ârif.\"). Vakhsh, rather than Balkh was the permanent base of Bahâ al-Din and his family until Rumi was around five years old (mei 16–35) [\n from a book in German by the scholar Fritz Meier—note inserted here]. At that time, in about the year 1212 (A.H. 608–609), the Valads moved to Samarqand (Fih 333; Mei 29–30, 36) [reference to Rumi's \"Discourses\" and to Fritz Meier's book—note inserted here], leaving behind Baâ al-Din's mother, who must have been at least seventy-five years old.\" a village on the Vakhsh River in present-day Tajikistan, or in the city of Balkh, in present-day Afghanistan.\n\nGreater Balkh was at that time a major centre of Persian cultureFranklin D. Lewis, Rumi: Past and Present, East and West: The life, Teaching and poetry of Jalal Al-Din Rumi, Oneworld Publication Limited, 2008 p. 9: \"How is that a Persian boy born almost eight hundred years ago in Khorasan, the northeastern province of greater Iran, in a region that we identify today as Central Asia, but was considered in those days as part of the greater Persian cultural sphere, wound up in central Anatolia on the receding edge of the Byzantine cultural sphere\" and Sufism had developed there for several centuries. The most important influences upon Rumi, besides his father, were the Persian poets Attar and Sanai.Maqsood Jafrī, The gleam of wisdom, Sigma Press, 2003. p. 238: \"Rumi has influenced a large number of writers while on the other hand he himself was under the great influence of Sanai and Attar. Rumi expresses his appreciation: \"Attar was the spirit, Sanai his eyes twain, And in time thereafter, Came we in their train\"A. J. Arberry, Sufism: An Account of the Mystics of Islam, Courier Dover Publications, Nov 9, 2001. p. 141 and mentions in another poem: \"Attar has traversed the seven cities of Love, We are still at the turn of one street\".Seyyed Hossein Nasr, The Garden of Truth: The Vision and Promise of Sufism, Islam's Mystical Tradition HarperCollins, Sep 2, 2008. page 130: \"Attar has traversed the seven cities of Love, We are still at the turn of one street!\" His father was also connected to the spiritual lineage of Najm al-Din Kubra.\n\nRumi lived most of his life under the PersianateGrousset, Rene, The Empire of the Steppes: A History of Central Asia, (Rutgers University Press, 2002), 157; \"...the Seljuk court at Konya adopted Persian as its official language\".Aḥmad of Niǧde's \"al-Walad al-Shafīq\" and the Seljuk Past, A. C. S. Peacock, Anatolian Studies, Vol. 54, (2004), 97; With the growth of Seljuk power in Rum, a more highly developed Muslim cultural life, based on the Persianate culture of the Great Seljuk court, was able to take root in AnatoliaCarter Vaughn Findley, The Turks in World History, Oxford University Press, Nov 11, 2004. p. 72: Meanwhile, amid the migratory swarm that Turkified Anatolia, the dispersion of learned men from the Persian-speaking east paradoxically made the Seljuks court at Konya a new center for Persian court culture, as exemplified by the great mystical poet Jelaleddin Rumi (1207–73). Seljuk Sultanate of Rum, where he produced his worksBarks, Coleman, Rumi: The Book of Love: Poems of Ecstasy and Longing, HarperCollins, 2005, p. xxv,  and died in 1273AD. He was buried in Konya, and his shrine became a place of pilgrimage.Note: Rumi's shrine is now known as the \"Mevlâna Museum\" in Turkey. Upon his death, his followers and his son Sultan Walad founded the Mevlevi Order, also known as the Order of the Whirling Dervishes, famous for the Sufi dance known as the Sama ceremony. He was laid to rest beside his father, and over his remains a shrine was erected. A hagiographical account of him is described in Shams ud-Din Ahmad Aflāki's Manāqib ul-Ārifīn (written between 1318 and 1353). This biography needs to be treated with care as it contains both legends and facts about Rumi.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2000. For example, Professor Franklin Lewis of the University of Chicago, author of the most complete biography on Rumi, has separate sections for the hagiographical biography of Rumi and the actual biography about him.\n\nRumi's father was Bahā ud-Dīn Walad, a theologian, jurist and a mystic from Balkh, who was also known by the followers of Rumi as Sultan al-Ulama or \"Sultan of the Scholars\". The popular hagiographical assertions that have claimed the family's descent from the Caliph Abu Bakr does not hold on closer examination and is rejected by modern scholars.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). pp. 90–92: \"Baha al-Din’s disciples also traced his family lineage to the first caliph, Abu Bakr (Sep 9; Af 7; JNO 457; Dow 213). This probably stems from willful confusion over his paternal great grandmother, who was the daughter of Abu Bakr of Sarakhs, a noted jurist (d. 1090). The most complete genealogy offered for family stretches back only six or seven generations and cannot reach to Abu Bakr, the companion and first caliph of the Prophet, who died two years after the Prophet, in C.E. 634 (FB 5–6 n.3).\"H. Algar, [http://www.iranicaonline.org/articles/baha-al-din-mohammad-walad-b “BAHĀʾ-AL-DĪN MOḤAMMAD WALAD“], Encyclopedia Iranica. There is no reference to such descent in the works of Bahāʾ-e Walad and Mawlānā Jalāl-al-Dīn or in the inscriptions on their sarcophagi. The attribution may have arisen from confusion between the caliph and another Abū Bakr, Šams-al-Aʾemma Abū Bakr Saraḵsī (d. 483/1090), the well-known Hanafite jurist, whose daughter, Ferdows Ḵātūn, was the mother of Aḥmad Ḵaṭīb, Bahāʾ-e Walad’s grandfather (see Forūzānfar, Resāla, p. 6). Tradition also links Bahāʾ-e Walad’s lineage to the Ḵᵛārazmšāh dynasty. His mother is said to have been the daughter of ʿAlāʾ-al-Dīn Moḥammad Ḵārazmšāh (d. 596/1200), but this appears to be excluded for chronological reasons (Forūzānfar, Resāla, p. 7)(Ritter, H.; Bausani, A. \"ḎJalāl al- Dīn Rūmī b. Bahāʾ al-Dīn Sulṭān al-ʿulamāʾ Walad b. Ḥusayn b. Aḥmad Ḵhaṭībī .\" Encyclopaedia of Islam. Edited by: P. Bearman, Th. Bianquis, C.E. Bosworth, E. van Donzel and W.P. Heinrichs. Brill, 2009. Brill Online. Excerpt: \"known by the sobriquet Mawlānā (Mevlâna), Persian poet and founder of the Mawlawiyya order of dervishes\"): \"The assertions that his family tree goes back to Abū Bakr, and that his mother was a daughter of the Ḵhwārizmshāh ʿAlāʾ al-Dīn Muḥammad (Aflākī, i, 8–9) do not hold on closer examination (B. Furūzānfarr, Mawlānā Ḏjalāl Dīn, Tehrān 1315, 7; ʿAlīnaḳī Sharīʿatmadārī, Naḳd-i matn-i mathnawī, in Yaghmā, xii (1338), 164; Aḥmad Aflākī, Ariflerin menkibeleri, trans. Tahsin Yazıcı, Ankara 1953, i, Önsöz, 44).\") The claim of maternal descent from the Khwarazmshah for Rumi or his father is also seen as a non-historical hagiographical tradition designed to connect the family with royalty, but this claim is rejected for chronological and historical reasons. The most complete genealogy offered for the family stretches back to six or seven generations to famous Hanafi jurists.\n\nWe do not learn the name of Baha al-Din's mother in the sources, only that he referred to her as \"Māmi\" (colloquial Persian for Māma),Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 44:“Baha al-Din’s father, Hosayn, had been a religious scholar with a bent for asceticism, occupied like his own father before him, Ahmad, with the family profession of preacher (khatib). Of the four canonical schools of Sunni Islam, the family adhered to the relatively liberal Hanafi fiqh. Hosayn-e Khatibi enjoyed such renown in his youth—so says Aflaki with characteristic exaggeration—that Razi al-Din Nayshapuri and other famous scholars came to study with him (Af 9; for the legend about Baha al-Din, see below, “The Mythical Baha al-Din”). Another report indicates that Baha al-Din’s grandfather, Ahmad al-Khatibi, was born to Ferdows Khatun, a daughter of the reputed Hanafite jurist and author Shams al-A’emma Abu Bakr of Sarakhs, who died circa 1088 (Af 75; FB 6 n.4; Mei 74 n. 17). This is far from implausible and, if true, would tend to suggest that Ahmad al-Khatabi had studied under Shams al-A’emma. Prior to that the family could supposedly trace its roots back to Isfahan. We do not learn the name of Baha al-Din’s mother in the sources, only that he referred to her as “Mama” (Mami), and that she lived to the 1200s.” (p. 44) and that she was a simple woman who lived to the 1200s. The mother of Rumi was Mu'mina Khātūn. The profession of the family for several generations was that of Islamic preachers of the liberal Hanafi rite, and this family tradition was continued by Rumi (see his Fihi Ma Fih and Seven Sermons) and Sultan Walad (see Ma'rif Waladi for examples of his everyday sermons and lectures).\n\nWhen the Mongols invaded Central Asia sometime between 1215 and 1220, Baha ud-Din Walad, with his whole family and a group of disciples, set out westwards. According to hagiographical account which is not agreed upon by all Rumi scholars, Rumi encountered one of the most famous mystic Persian poets, Attar, in the Iranian city of Nishapur, located in the province of Khorāsān. Attar immediately recognized Rumi's spiritual eminence. He saw the father walking ahead of the son and said, \"Here comes a sea followed by an ocean.\" He gave the boy his Asrārnāma, a book about the entanglement of the soul in the material world. This meeting had a deep impact on the eighteen-year-old Rumi and later on became the inspiration for his works.\n\nFrom Nishapur, Walad and his entourage set out for Baghdad, meeting many of the scholars and Sufis of the city.Ahmed, Nazeer, Islam in Global History: From the Death of Prophet Muhammed to the First World War, p.58, Xlibris Corporation (2000),  From Baghdad they went to Hejaz and performed the pilgrimage at Mecca. The migrating caravan then passed through Damascus, Malatya, Erzincan, Sivas, Kayseri and Nigde. They finally settled in Karaman for seven years; Rumi's mother and brother both died there. In 1225, Rumi married Gowhar Khatun in Karaman. They had two sons: Sultan Walad and Ala-eddin Chalabi. When his wife died, Rumi married again and had a son, Amir Alim Chalabi, and a daughter, Malakeh Khatun.\n\nOn 1 May 1228, most likely as a result of the insistent invitation of 'Alā' ud-Dīn Key-Qobād, ruler of Anatolia, Baha' ud-Din came and finally settled in Konya in Anatolia within the westernmost territories of the Seljuk Sultanate of Rûm.\n\nBaha' ud-Din became the head of a madrassa (religious school) and when he died, Rumi, aged twenty-five, inherited his position as the Islamic molvi. One of Baha' ud-Din's students, Sayyed Burhan ud-Din Muhaqqiq Termazi, continued to train Rumi in the Shariah as well as the Tariqa, especially that of Rumi's father. For nine years, Rumi practised Sufism as a disciple of Burhan ud-Din until the latter died in 1240 or 1241. Rumi's public life then began: he became an Islamic Jurist, issuing fatwas and giving sermons in the mosques of Konya. He also served as a Molvi (Islamic teacher) and taught his adherents in the madrassa.\n\nDuring this period, Rumi also travelled to Damascus and is said to have spent four years there.\n\nIt was his meeting with the dervish Shams-e Tabrizi on 15 November 1244 that completely changed his life. From an accomplished teacher and jurist, Rumi was transformed into an ascetic.\n\nShams had travelled throughout the Middle East searching and praying for someone who could \"endure my company\". A voice said to him, \"What will you give in return?\" Shams replied, \"My head!\" The voice then said, \"The one you seek is Jalal ud-Din of Konya.\" On the night of 5 December 1248, as Rumi and Shams were talking, Shams was called to the back door. He went out, never to be seen again. It is rumoured that Shams was murdered with the connivance of Rumi's son, 'Ala' ud-Din; if so, Shams indeed gave his head for the privilege of mystical friendship.\n\nRumi's love for, and his bereavement at the death of, Shams found their expression in an outpouring of lyric poems, Divan-e Shams-e Tabrizi. He himself went out searching for Shams and journeyed again to Damascus. There, he realised:\n\nMewlana had been spontaneously composing ghazals (Persian poems), and these had been collected in the Divan-i Kabir or Diwan Shams Tabrizi. Rumi found another companion in Salaḥ ud-Din-e Zarkub, a goldsmith. After Salah ud-Din's death, Rumi's scribe and favourite student, Hussam-e Chalabi, assumed the role of Rumi's companion. One day, the two of them were wandering through the Meram vineyards outside Konya when Hussam described to Rumi an idea he had had: \"If you were to write a book like the Ilāhīnāma of Sanai or the Mantiq ut-Tayr of 'Attar, it would become the companion of many troubadours. They would fill their hearts from your work and compose music to accompany it.\" Rumi smiled and took out a piece of paper on which were written the opening eighteen lines of his Masnavi, beginning with:\n\nHussam implored Rumi to write more. Rumi spent the next twelve years of his life in Anatolia dictating the six volumes of this masterwork, the Masnavi, to Hussam.\n\nIn December 1273, Rumi fell ill; he predicted his own death and composed the well-known ghazal, which begins with the verse:\n\nRumi died on 17 December 1273 in Konya; his body was interred beside that of his father, and a splendid shrine, the Yeşil Türbe (Green Tomb, قبه الخضراء; today the Mevlâna Museum), was erected over his place of burial. His epitaph reads:\n\nGeorgian Queen Gürcü Hatun was a close friend of Rumi. She was the one who sponsored the construction of his tomb in Konya.H. Crane \"Notes on Saldjūq Architectural Patronage in Thirteenth Century Anatolia,\" Journal of the Economic and Social History of the Orient, v. 36, n. 1 (1993), p. 18. The 13th century Mevlâna Mausoleum, with its mosque, dance hall, dervish living quarters, school and tombs of some leaders of the Mevlevi Order, continues to this day to draw pilgrims from all parts of the Muslim and non-Muslim world. Jalal al-Din who is also known as Rumi, was a philosopher and mystic of Islam.\n\nTeachings \n\nThe general theme of Rumi's thought, like that of other mystic and Sufi poets of Persian literature, is that of tawhid — union with the Beloved, from whom he sees himself as being cut off and aloof. His longing and desire to attain it is evident in the following poem from his book the Masnavi:\n\nThe Masnavi weaves fables, scenes from everyday life, Qur'anic revelations and exegesis, and metaphysics into a vast and intricate tapestry. In the East, it is said of him that he was \"not a prophet — but surely, he has brought a scripture.\"\n\nRumi believed passionately in the use of music, poetry and dance as a path for reaching God. For Rumi, music helped devotees to focus their whole being on the divine and to do this so intensely that the soul was both destroyed and resurrected. It was from these ideas that the practice of whirling Dervishes developed into a ritual form. His teachings became the base for the order of the Mevlevi, which his son Sultan Walad organised. Rumi encouraged Sama, listening to music and turning or doing the sacred dance. In the Mevlevi tradition, samāʿ represents a mystical journey of spiritual ascent through mind and love to the Perfect One. In this journey, the seeker symbolically turns towards the truth, grows through love, abandons the ego, finds the truth and arrives at the Perfect. The seeker then returns from this spiritual journey, with greater maturity, to love and to be of service to the whole of creation without discrimination with regard to beliefs, races, classes and nations.\n\nIn other verses in the Masnavi, Rumi describes in detail the universal message of love:\n\nRumi's favourite musical instrument was the ney (reed flute).\n\nMajor works \n\nRumi's poetry is often divided into various categories: the quatrains (rubayāt) and odes (ghazal) of the Divan, the six books of the Masnavi. The prose works are divided into The Discourses, The Letters, and the Seven Sermons.\n\nPoetic works \n\n* Rumi's major work is the Maṭnawīye Ma'nawī (Spiritual Couplets; ), a six-volume poem regarded by some Sufis\nAbdul Rahman Jami notes:\n\n(Khawaja Abdul Hamid Irfani, \"The Sayings of Rumi and Iqbal\", Bazm-e-Rumi, 1976.)\n as the Persian-language Qur'an. It is considered by many to be one of the greatest works of mystical poetry.J.T.P. de Bruijn, \"Comparative Notes on Sanai and 'Attar\", The Heritage of Sufism, L. Lewisohn, ed., p. 361: \"It is common place to mention Hakim Sana'i (d. 525/1131) and Farid al-Din 'Attar (1221) together as early highlights in a tradition of Persian mystical poetry which reached its culmination in the work of Mawlana Jalal al-Din Rumi and those who belonged to the early Mawlawi circle. There is abundant evidence available to prove that the founders of the Mawlawwiya in the thirteenth and fourteenth centuries regarded these two poets as their most important predecessors\" It contains approximately 27,000 lines of Persian poetry.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 306: \"The manuscripts versions differ greatly in the size of the text and orthography. Nicholson’s text has 25,577 lines though the average medieval and early modern manuscripts contained around 27,000 lines, meaning the scribes added two thousand lines or about eight percent more to the poem composed by Rumi. Some manuscripts give as many as 32,000!\"\n\n* Rumi's other major work is the Dīwān-e Kabīr (Great Work) or Dīwān-e Shams-e Tabrīzī (The Works of Shams of Tabriz; ), named in honour of Rumi's master Shams. Besides approximately 35000 Persian couplets and 2000 Persian quatrains,Franklin D. Lewis, Rumi: Past and Present, East and West: The Life, Teaching, and Poetry of Jalâl al-Din Rumi, rev. ed. (2008). p. 314: “The Foruzanfar’s edition of the Divan-e Shams compromises 3229 ghazals and qasidas making a total of almost 35000 lines, not including several hundred lines of stanzaic poems and nearly two thousand quatrains attributed to him” the Divan contains 90 Ghazals and 19 quatrains in Arabic,[http://www.dar-al-masnavi.org/about.html Dar al-Masnavi Website, accessed December 2009]: According to the Dar al-Masnavi website: “In Forûzânfar's edition of Rumi's Divan, there are 90 ghazals (Vol. 1, 29;Vol. 2, 1; Vol. 3, 6; Vol. 4, 8; Vol. 5, 19, Vol. 6, 0; Vol. 7, 27) and 19 quatrains entirely in Arabic. In addition, there are ghazals which are all Arabic except for the final line; many have one or two lines in Arabic within the body of the poem; some have as many as 9–13 consecutive lines in Arabic, with Persian verses preceding and following; some have alternating lines in Persian, then Arabic; some have the first half of the verse in Persian, the second half in Arabic.” a couple of dozen or so couplets in Turkish (mainly macaronic poems of mixed Persian and Turkish)Mecdut MensurOghlu: “The Divan of Jalal al-Din Rumi contains 35 couplets in Turkish and Turkish-Persian which have recently been published me” (Celal al-Din Rumi’s turkische Verse: UJb. XXIV (1952), pp. 106–115)Franklin D. Lewis, Rumi: Past and Present, East and West: The Life, Teaching, and Poetry of Jalâl al-Din Rumi, rev. ed. (2008): \"“a couple of dozen at most of the 35,000 lines of the Divan-I Shams are in Turkish, and almost all of these lines occur in poems that are predominantly in Persian”\" and 14 couplets in Greek (all of them in three macaronic poems of Greek-Persian).Dedes, D. 1993. Ποίηματα του Μαυλανά Ρουμή [Poems by Rumi]. Ta Istorika 10.18–19: 3–22.http://www.opoudjis.net/Play/rumiwalad.htmlFranklin D. Lewis, Rumi: Past and Present, East and West: The Life, Teaching, and Poetry of Jalâl al-Din Rumi, rev. ed. (2008): \"Three poems have bits of demotic Greek; these have been identified and translated into French, along with some Greek verses of Sultan Valad. Golpinarli (GM 416–417) indicates according to Vladimir Mir Mirughli, the Greek used in some of Rumi’s macaronic poems reflects the demotic Greek of the inhabitants of Anatolia. Golpinarli then argues that Rumi knew classical Persian and Arabic with precision, but typically composes poems in a more popular or colloquial Persian and Arabic.\".\n\nProse works \n\n* Fihi Ma Fihi (In It What's in It, Persian: فیه ما فیه) provides a record of seventy-one talks and lectures given by Rumi on various occasions to his disciples. It was compiled from the notes of his various disciples, so Rumi did not author the work directly.Franklin Lewis, Rumi: Past and Present, East and West — The Life, Teachings, and Poetry of Jalal al-Din Rumi, Oneworld Publications, 2000, Chapter 7. An English translation from the Persian was first published by A.J. Arberry as Discourses of Rumi (New York: Samuel Weiser, 1972), and a translation of the second book by Wheeler Thackston, Sign of the Unseen (Putney, VT: Threshold Books, 1994). The style of the Fihi ma fihi is colloquial and meant for middle-class men and women, and lack the sophisticated wordplay.“As Safa points out (Saf 2:1206) the Discourse reflect the stylistics of oral speech and lack the sophisticated word plays, Arabic vocabulary and sound patterning that we would except from a consciously literary text of this period. Once again, the style of Rumi as lecturer or orator in these discourses does not reflect an audience of great intellectual pretensions, but rather middle-class men and women, along with number of statesmen and rulers”” (Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 292)\n* Majāles-e Sab'a (Seven Sessions, Persian: ) contains seven Persian sermons (as the name implies) or lectures given in seven different assemblies. The sermons themselves give a commentary on the deeper meaning of Qur'an and Hadith. The sermons also include quotations from poems of Sana'i, 'Attar, and other poets, including Rumi himself. As Aflakī relates, after Shams-e Tabrīzī, Rumi gave sermons at the request of notables, especially Salāh al-Dīn Zarkūb. The style of Persian is rather simple, but quotation of Arabic and knowledge of history and the Hadith show Rumi's knowledge in the Islamic sciences. His style is typical of the genre of lectures given by Sufis and spiritual teachers.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 293\n* Makatib (The Letters, Persian: مکاتیب) is the book containing Rumi's letters in Persian to his disciples, family members, and men of state and of influence. The letters testify that Rumi kept very busy helping family members and administering a community of disciples that had grown up around them. Unlike the Persian style of the previous two mentioned works (which are lectures and sermons), the letters are consciously sophisticated and epistolary in style, which is in conformity with the expectations of correspondence directed to nobles, statesmen and kings.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 295:“In contrast with the prose of his Discourses and sermons, the style of the letters is consciously sophisticated and epistolary, in conformity with the expectations of correspondence directed to nobles, statesmen and kings\"\n\nReligious outlook \n\nRumi belongs to the class of Islamic philosophers which include Ibn Arabi and Mulla Sadra. These transcendental philosophers are often studied together in traditional schools of irfan, philosophy and theosophy throughout the Muslim world.Nasr, Seyyed Hossein (2000) Transcendent Theosophy of Mulla Sadra \n\nRumi embeds his theosophy (transcendental philosophy) like a string through the beads of his poems and stories.  His main point and emphasis is the unity of being.\n\nIt is undeniable that Rumi was a Muslim scholar and took Islam seriously. Nonetheless, the depth of his spiritual vision extended beyond narrow understanding sectarian concerns. One rubaiyat reads:\n\nAccording to the Quran, Prophet Muhammad is a mercy sent by God to the Aalameen (to all creation), including humanity overall. In regards to this, Rumi states:\n\n\"The Light of Muhammad does not abandon a Zoroastrian or Jew in the world. May the shade of his good fortune shine upon everyone! He brings all of those who are led astray into the Way out of the desert.\"\n\nRumi, however, asserts the supremacy of Islam by stating:\n\n\"The Light of Muhammad has become a thousand branches (of knowledge), a thousand, so that both this world and the next have been seized from end to end. If Muhammad rips the veil open from a single such branch, thousands of monks and priests will tear the string of false belief from around their waists.\"\n\nMany of Rumi's poems suggest the importance of outward religious observance and the primacy of the Qur'an.\n\nRumi states:\n\nI am the servant of the Qur'an as long as I have life.\nI am the dust on the path of Muhammad, the Chosen one.\nIf anyone quotes anything except this from my sayings,\nI am quit of him and outraged by these words.\n\nRumi also states:\n\nOn the first page of the Masnavi, Rumi states:\n \"Hadha kitâbu 'l- mathnawîy wa huwa uSûlu uSûli uSûli 'd-dîn wa kashshâfu 'l-qur'ân.\"\n\"This is the book of the Masnavi, and it is the roots of the roots of the roots of the (Islamic) Religion and it is the Explainer of the Qur'ân.\"\n\nSeyyed Hossein Nasr states:\nOne of the greatest living authorities on Rûmî in Persia today, Hâdî Hâ'irî, has shown in an unpublished work that some 6,000 verses of the Dîwân and the Mathnawî are practically direct translations of Qur'ânic verses into Persian poetry.Seyyed Hossein Nasr, \"Rumi and the Sufi Tradition,\" in Chelkowski (ed.), The Scholar and the Saint, p. 183\n\nRumi states in his Dīwān:\nThe Sufi is hanging on to Muhammad, like Abu Bakr.Quoted in Ibrahim Gamard, Rumi and Islam: Selections from His Stories, Poems, and Discourses — Annotated and Explained, p. 171.\n\nHis Masnavi contains anecdotes and stories derived largely from the Quran and the hadith, as well as everyday tales.\n\nLegacy \n\nRumi's poetry forms the basis of much classical Iranian and Afghan music. Contemporary classical interpretations of his poetry are made by Muhammad Reza Shajarian, Shahram Nazeri, Davood Azad (the three from Iran) and Ustad Mohammad Hashem Cheshti (Afghanistan). To many modern Westerners, his teachings are one of the best introductions to the philosophy and practice of Sufism. In the West Shahram Shiva has been teaching, performing and sharing the translations of the poetry of Rumi for nearly twenty years and has been instrumental in spreading Rumi's legacy in the English-speaking parts of the world. Pakistan's National Poet, Muhammad Iqbal, was also inspired by Rumi's works and considered him to be his spiritual leader, addressing him as \"Pir Rumi\" in his poems (the honorific Pir literally means \"old man\", but in the Sufi/mystic context it means founder, master, or guide).\n\nShahram Shiva asserts that \"Rumi is able to verbalise the highly personal and often confusing world of personal growth and development in a very clear and direct fashion. He does not offend anyone, and he includes everyone.... Today Rumi's poems can be heard in churches, synagogues, Zen monasteries, as well as in the downtown New York art/performance/music scene.\"\n\nAccording to Professor Majid M. Naini, \"Rumi's life and transformation provide true testimony and proof that people of all religions and backgrounds can live together in peace and harmony. Rumi’s visions, words, and life teach us how to reach inner peace and happiness so we can finally stop the continual stream of hostility and hatred and achieve true global peace and harmony.”\n\nRumi's work has been translated into many of the world's languages, including Russian, German, Urdu, Turkish, Arabic, Bengali, French, Italian, and Spanish, and is being presented in a growing number of formats, including concerts, workshops, readings, dance performances, and other artistic creations. The English interpretations of Rumi's poetry by Coleman Barks have sold more than half a million copies worldwide, and Rumi is one of the most widely read poets in the United States.Curiel, Jonathan, San Francisco Chronicle Staff Writer, Islamic verses: The influence of Muslim literature in the United States has grown stronger since the Sept. 11 attacks (February 6, 2005), [http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2005/02/06/INGH7B3FM31.DTL Available online] (Retrieved Aug 2006) Shahram Shiva book \"Rending the Veil: Literal and Poetic Translations of Rumi\" (1995, HOHM Press) is the recipient of the Benjamin Franklin Award.\n\nRecordings of Rumi poems have made it to the USA's Billboard's Top 20 list. A selection of American author Deepak Chopra's editing of the translations by Fereydoun Kia of Rumi's love poems has been performed by Hollywood personalities such as Madonna, Goldie Hawn, Philip Glass and Demi Moore.\n\nThere is a famous landmark in Northern India, known as Rumi Gate, situated in Lucknow (the capital of Uttar Pradesh) named for Rumi.\n\nRumi and his mausoleum were depicted on the reverse of the 5000 Turkish lira banknotes of 1981–1994.Banknote Museum: 7. Emission Group—Five Thousand Turkish Lira—[http://www.tcmb.gov.tr/yeni/banknote/E7/274.htm I. Series] , [http://www.tcmb.gov.tr/yeni/banknote/E7/276.htm II. Series]  & [http://www.tcmb.gov.tr/yeni/banknote/E7/278.htm III. Series]. Retrieved on 20 April 2009.  \n\nIranian world \n\nThese cultural, historical and linguistic ties between Rumi and Iran have made Rumi an iconic Iranian poet, and some of the most important Rumi scholars including Foruzanfar, Naini, Sabzewari, etc., have come from modern Iran.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2000. Rumi's poetry is displayed on the walls of many cities across Iran, sung in Persian music, and read in school books.See for example 4th grade Iranian school book where the story of the Parrot and Merchant from the Mathnawi is taught to students\n\nMewlewī Sufi Order \n\nThe Mewlewī Sufi order was founded in 1273 by Rumi's followers after his death. His first successor in the rectorship of the order was \"Husam Chalabi\" himself, after whose death in 1284 Rumi's younger and only surviving son, Sultan Walad (died 1312), popularly known as author of the mystical Maṭnawī Rabābnāma, or the Book of the Rabab was installed as grand master of the order.[http://www.islamicsupremecouncil.org/bin/site/wrappers/spirituality-mevlevi.html ISCA—The Islamic Supreme Council of America]  The leadership of the order has been kept within Rumi's family in Konya uninterruptedly since then.\nThe Mewlewī Sufis, also known as Whirling Dervishes, believe in performing their dhikr in the form of Sama. During the time of Rumi (as attested in the Manāqib ul-Ārefīn of Aflākī), his followers gathered for musical and \"turning\" practices.\n\nAccording to tradition, Rumi was himself a notable musician who played the robāb, although his favourite instrument was the ney or reed flute. The music accompanying the samāʿ consists of settings of poems from the Maṭnawī and Dīwān-e Kabīr, or of Sultan Walad's poems. The Mawlawīyah was a well-established Sufi order in the Ottoman Empire, and many of the members of the order served in various official positions of the Caliphate. The centre for the Mevlevi was in Konya. There is also a Mewlewī monastery (, dargāh) in Istanbul near the Galata Tower in which the samāʿ is performed and accessible to the public. The Mewlewī order issues an invitation to people of all backgrounds:\n\nDuring Ottoman times, the Mevlevi produced a number of notable poets and musicians, including Sheikh Ghalib, Ismail Rusuhi Dede of Ankara, Esrar Dede, Halet Efendi, and Gavsi Dede, who are all buried at the Galata Mewlewī Khāna (Turkish: Mevlevi-Hane) in Istanbul.[http://www.istanbulportal.com/istanbulportal/Divan.aspx Web Page Under Construction]  Music, especially that of the ney, plays an important part in the Mevlevi.\n\nWith the foundation of the modern, secular Republic of Turkey, Mustafa Kemal Atatürk removed religion from the sphere of public policy and restricted it exclusively to that of personal morals, behaviour and faith. On 13 December 1925, a law was passed closing all the tekkes (dervish lodges) and zāwiyas (chief dervish lodges), and the centres of veneration to which visits (ziyārat) were made. Istanbul alone had more than 250 tekkes as well as small centres for gatherings of various fraternities; this law dissolved the Sufi Orders, prohibited the use of mystical names, titles and costumes pertaining to their titles, impounded the Orders' assets, and banned their ceremonies and meetings. The law also provided penalties for those who tried to re-establish the Orders. Two years later, in 1927, the Mausoleum of Mevlâna in Konya was allowed to reopen as a Museum.Mango, Andrew, Atatürk: The Biography of the Founder of Modern Turkey, (2002), .\n\nIn the 1950s, the Turkish government began allowing the Whirling Dervishes to perform once a year in Konya. The Mewlānā festival is held over two weeks in December; its culmination is on 17 December, the Urs of Mewlānā (anniversary of Rumi's death), called Šabe Arūs (شب عروس) (Persian meaning \"nuptial night\"), the night of Rumi's union with God.[http://www.kloosterman.be/rumi.php Kloosterman Genealogy, Jalal al-Din Muhammad Rumi]  In 1974, the Whirling Dervishes were permitted to travel to the West for the first time. In 2005, UNESCO proclaimed \"The Mevlevi Sama Ceremony\" of Turkey as one of the Masterpieces of the Oral and Intangible Heritage of Humanity.[http://www.unesco.org/culture/intangible-heritage/39eur_uk.htm The Mevlevi Sema Ceremony] UNESCO.\n\nReligious denomination \n\nAs Edward G. Browne noted, the three most prominent mystical Persian poets Rumi, Sanai and Attar were all Sunni Muslims and their poetry abounds with praise for the first two caliphs Abu Bakr and Umar ibn al-Khattāb.Edward G. Browne, A Literary History of Persia from the Earliest Times Until Firdawsh, 543 pp., Adamant Media Corporation, 2002, ,  (see p.437) According to Annemarie Schimmel, the tendency among Shia authors to anachronistically include leading mystical poets such as Rumi and Attar among their own ranks, became stronger after the introduction of Twelver Shia as the state religion in the Safavid Empire in 1501.Annemarie Schimmel, Deciphering the Signs of God, 302 pp., SUNY Press, 1994, ,  (see p.210)\n\nEight hundredth anniversary celebrations \n\nIn Afghanistan, Rumi is known as Mawlānā, in Turkey as Mevlâna, and in Iran as Molavī.\n\nAt the proposal of the Permanent Delegations of Afghanistan, Iran, and Turkey, and as approved by its Executive Board and General Conference in conformity with its mission of “constructing in the minds of men the defences of peace”, UNESCO was associated with the celebration, in 2007, of the eight hundredth anniversary of Rumi's birth. The commemoration at UNESCO itself took place on 6 September 2007; UNESCO issued a medal in Rumi's name in the hope that it would prove an encouragement to those who are engaged in research on and dissemination of Rumi's ideas and ideals, which would, in turn, enhance the diffusion of the ideals of UNESCO.\n\nThe Afghan Ministry of Culture and Youth established a national committee, which organised an international seminar to celebrate the birth and life of the great ethical philosopher and world-renowned poet. This grand gathering of the intellectuals, diplomats, and followers of Mewlana was held in Kabul and in Balkh, the Mewlana's place of birth.\n\nOn 30 September 2007, Iranian school bells were rung throughout the country in honour of Mewlana.[http://www.hamshahrionline.ir/News/?id36533 همشهری آنلاین]  Also in that year, Iran held a Rumi Week from 26 October to 2 November. An international ceremony and conference were held in Tehran; the event was opened by the Iranian president and the chairman of the Iranian parliament. Scholars from twenty-nine countries attended the events, and 450 articles were presented at the conference.[http://www2.irna.ir/en/news/view/line-16/0710285006110934.htm Int'l congress on Molana opens in Tehran]  Iranian musician Shahram Nazeri was awarded the Légion d'honneur and Iran's House of Music Award in 2007 for his renowned works on Rumi masterpieces.[http://www.iran-daily.com/1385/2676/html/art.htm#s178308 Iran Daily — Arts & Culture — 10/03/06]   2007 was declared as the \"International Rumi Year\" by UNESCO.[http://www.chnpress.com/news/?section\n2&id=6694 CHN | News]\n\nAlso on 30 September 2007, Turkey celebrated Rumi’s eight-hundredth birthday with a giant Whirling Dervish ritual performance of the samāʿ, which was televised using forty-eight cameras and broadcast live in eight countries. Ertugrul Gunay, of the Ministry of Culture and Tourism, stated, \"Three hundred dervishes are scheduled to take part in this ritual, making it the largest performance of sema in history.\"[http://www.tehrantimes.com/index_View.asp?code=154044 tehrantimes.com, 300 dervishes whirl for Rumi in Turkey]\n\nMawlana Rumi Review \n\nThe Mawlana Rumi Review () is published annually by The Centre for Persian and Iranian Studies at the University of Exeter in collaboration with The Rumi Institute, Nicosia, Cyprus, and Archetype Books, Cambridge. The first volume was published in 2010, and it has come out annually since then. According to the principal editor of the journal, Leonard Lewisohn: \"Although a number of major Islamic poets easily rival the likes of Dante, Shakespeare and Milton in importance and output, they still enjoy only a marginal literary fame in the West because the works of Arabic and Persian thinkers, writers and poets are considered as negligible, frivolous, tawdry sideshows beside the grand narrative of the Western Canon. It is the aim of the Mawlana Rumi Review to redress this carelessly inattentive approach to world literature, which is something far more serious than a minor faux pas committed by the Western literary imagination.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Rumi" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16433" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jalāl ad-Dīn Muhammad Rūmī (), also known as Jalāl ad-Dīn Muhammad Balkhī (), Mevlânâ/Mawlānā (, \"our master\"), Mevlevî/Mawlawī (, \"my master\"), and more popularly simply as Rumi (30 September 1207 – 17 December 1273), was a 13th-century PersianRitter, H.; Bausani, A. \"ḎJ̲alāl al-Dīn Rūmī b. Bahāʾ al-Dīn Sulṭān al-ʿulamāʾ Walad b. Ḥusayn b. Aḥmad Ḵh̲aṭībī.\" Encyclopaedia of Islam. Edited by: P. Bearman, Th. Bianquis, C.E. Bosworth, E. van Donzel and W.P. Heinrichs. Brill, 2007. Brill Online. Excerpt: \"known by the sobriquet Mewlānā, persian poet and founder of the Mewlewiyya order of dervishes\"Franklin D. Lewis, \"Rumi: Past and Present, East and West: The life, Teaching and poetry of Jalal Al-Din Rumi\", Oneworld Publication Limited, 2008 p. 9: \"How is that a Persian boy born almost eight hundred years ago in Khorasan, the northeastern province of greater Iran, in a region that we identify today as in Asia, but was considered in those days as part of the greater Persian cultural sphere, wound up in central Anatolia on the receding edge of the Byzantine cultural sphere\" Sunni Muslim poet, jurist, Islamic scholar, theologian, and Sufi mystic.Annemarie Schimmel, \"The Mystery of Numbers\", Oxford University Press, Apr 7, 1994. p. 51: \"These examples are taken from the Persian mystic Rumi's work, not from Chinese, but they express the yang-yin relationship with perfect lucidity.\" Rumi's influence transcends national borders and ethnic divisions: Iranians, Tajiks, Turks, Greeks, Pashtuns, other Central Asian Muslims, and the Muslims of South Asia have greatly appreciated his spiritual legacy for the past seven centuries.Seyyed Hossein Nasr, \"Islamic Art and Spirituality\", Suny Press, 1987. p. 115: \"Jalal al-Din was born in a major center of Persian culture, Balkh, from Persian speaking parents, and is the product of that Islamic Persian culture which in the 7th/13th century dominated the 'whole of the eastern lands of Islam and to which present day Persians as well as Turks, Afghans, Central Asian Muslims and the Muslims of the Indo-Pakistani subcontinent are heir. It is precisely in this world that the sun of his spiritual legacy has shone most brillianty during the past seven centuries. The father of Jalal al-Din, Muhammad ibn Husayn Khatibi, known as Baha al-Din Walad and entitled Sultan al-'ulama', was an outstanding Sufi in Balkh connected to the spiritual lineage of Najm al-Din Kubra.\" His poems have been widely translated into many of the world's languages and transposed into various formats. Rumi has been described as the \"most popular poet\" and the \"best selling poet\" in the United States.\n\nRumi's works are written mostly in Persian, but occasionally he also used Turkish, Arabic, and Greek,Δέδες, Δ. 1993. Ποιήματα του Μαυλανά Ρουμή. Τα Ιστορικά 10.18–19: 3–22.Meyer, G. 1895. Die griechischen Verse in Rabâbnâma. Byzantinische Zeitschrift 4: 401–411. in his verse. His Masnavi (Mathnawi), composed in Konya, is considered one of the greatest poems of the Persian language.Louis Gardet, \"Religion and Culture\" in The Cambridge History of Islam—Part VIII: Islamic Society and Civilization, edited by P. M. Holt, Ann K. S. Lambton, Bernard Lewis, Cambridge University Press (1977), p. 586: \"It is sufficient to mention 'Aziz al-Din Nasafi, Farid al-Din 'Attar and Sa'adi, and above all Jalal al-Din Rumi, whose Mathnawi remains one of the purest literary glories of Persia\"C.E. Bosworth, \"Turkmen Expansion towards the west\" in UNESCO History of Humanity, Volume IV, titled \"From the Seventh to the Sixteenth Century\", UNESCO Publishing / Routledge, p. 391: \"While the Arabic language retained its primacy in such spheres as law, theology and science, the culture of the Seljuk court and secular literature within the sultanate became largely Persianized; this is seen in the early adoption of Persian epic names by the Seljuk rulers (Qubād, Kay Khusraw and so on) and in the use of Persian as a literary language (Turkmen must have been essentially a vehicle for everyday speech at this time). The process of Persianization accelerated in the 13th century with the presence in Konya of two of the most distinguished refugees fleeing before the Mongols, Bahā' al-Dīn Walad and his son Mawlānā Jalāl al-Dīn Rūmī, whose Mathnawī, composed in Konya, constitutes one of the crowning glories of classical Persian literature.\" His works are widely read today in their original language across Greater Iran and the Persian-speaking world. Translations of his works are very popular, most notably in Turkey, Azerbaijan, the United States, and South Asia. His poetry has influenced not only Persian literature, but also Turkish, Ottoman Turkish, Azerbaijani, as well as the literature of some other Turkic, Iranian, and Indo-Aryan languages including Chagatai, Urdu and Pashto. A deep grasp of his original poetry requires excellent command of modern Persian, and an equally good command of Islamic prophetic traditions, and the Qur'an. With such command, one may succeed in peeling back the multitude layers of meaning.\n\nName \n\nHe is most commonly called  in English. His full name is Jalāl ad-Dīn Muḥammad Balkhī () or Jalāl ad-Dīn Muḥammad Rūmī (). Jalal ad-Din is an Arabic name meaning \"Glory of the Faith\". Balkhī and Rūmī are his nisbas, meaning \"from Balkh\" and \"from Rûm\" (Roman Anatolia), respectively. According to the authoritative Rumi biographer Franklin Lewis of the University of Chicago, \"[t]he Anatolian peninsula which had belonged to the Byzantine, or eastern Roman empire, had only relatively recently been conquered by Muslims and even when it came to be controlled by Turkish Muslim rulers, it was still known to Arabs, Persians and Turks as the geographical area of Rum. As such, there are a number of historical personages born in or associated with Anatolia known as Rumi, a word borrowed from Arabic literally meaning 'Roman,' in which context Roman refers to subjects of the Byzantine Empire or simply to people living in or things associated with Anatolia.\"\n\nHe is widely known by the sobriquet Mawlānā/MolānāH. Ritter, 1991, DJALĀL al-DĪN RŪMĪ, The Encyclopaedia of Islam (Volume II: C–G), 393. () in Iran and popularly known as  in Turkey. Mawlānā () is a term of Arabic origin, meaning \"our master\".\n\nThe term  Mawlawī/Mowlavi (Persian) and  (Turkish), also of Arabic origin, meaning \"my master\", is also frequently used for him.Jalāl al-Dīn Rūmī (Maulana), Ibrahim Gamard, \"Rumi and Islam: Selections from His Stories, Poems, and Discourses, Annotated & Explained\", SkyLight Paths Publishing, February 1, 2004.\n\nLife \n\nRumi was born to native Persian-speaking parents,Annemarie Schimmel, The Triumphal Sun: A Study of the Works of Jalaloddin Rumi, SUNY Press, 1993, p. 193: \"Rumi's mother tongue was Persian, but he had learned during his stay in Konya, enough Turkish and Greek to use it, now and then, in his verse.\"Franklin Lewis: \"On the question of Rumi's multilingualism (pages 315–17), we may still say that he spoke and wrote in Persian as a native language, wrote and conversed in Arabic as a learned \"foreign\" language and could at least get by at the market in Turkish and Greek (although some wildly extravagant claims have been made about his command of Attic Greek, or his native tongue being Turkish) (Lewis 2008:xxi). (Franklin Lewis, \"Rumi: Past and Present, East and West: The Life, Teachings and Poetry of Jalal al-Din Rumi,\" One World Publication Limited, 2008).\nFranklin also points out that: \"Living among Turks, Rumi also picked up some colloquial Turkish.\"(Franklin Lewis, \"Rumi: Past and Present, East and West: The Life, Teachings and Poetry of Jalal al-Din Rumi,\" One World Publication Limited, 2008, p. 315). He also mentions Rumi composed thirteen lines in Greek (Franklin Lewis, Rumi: Past and Present, East and West: The Life, Teachings and Poetry of Jalal al-Din Rumi, One World Publication Limited, 2008, p. 316). On Rumi's son, Sultan Walad, Franklin mentions: \"Sultan Walad elsewhere admits that he has little knowledge of Turkish\" (Sultan Walad): Franklin Lewis, Rumi, \"Past and Present, East and West: The Life, Teachings and Poetry of Jalal al-Din Rumi, One World Publication Limited, 2008, p. 239) and\n\"Sultan Valad did not feel confident about his command of Turkish\" (Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2000, p. 240)\nSeyyed Hossein Nasr, Islamic Art and Spirituality, SUNY Press, 1987. p. 115: \"Jalal al-Din was born in a major center of Persian culture, Balkh, from Persian speaking parents, and is the product of that Islamic Persian culture which in the 7th/13th century dominated the 'whole of the eastern lands of Islam and to which present day Persians as well as Turks, Afghans, Central Asian Muslims and the Muslims of the Indo-Pakistani and the Muslims of the Indo-Pakistani subcontinent are heir. It is precisely in this world that the sun of his spiritual legacy has shone most brilliantly during the past seven centuries. The father of Jalal al-Din, Muhammad ibn Husayn Khatibi, known as Baha al-Din Walad and entitled Sultan al-'ulama', was an outstanding Sufi in Balkh connected to the spiritual lineage of Najm al-Din Kubra.\" originally from the Balkh, in present-day Afghanistan. He was born either in Wakhsh,Annemarie Schimmel, \"I Am Wind, You Are Fire,\" p. 11. She refers to a 1989 article by Fritz Meier: Lewis has devoted two pages of his book to the topic of Wakhsh, which he states has been identified with the medieval town of Lêwkand (or Lâvakand) or Sangtude, which is about 65 kilometers southeast of Dushanbe, the capital of present-day Tajikistan. He says it is on the east bank of the Vakhshâb river, a major tributary that joins the Amu Daryâ river (also called Jayhun, and named the Oxus by the Greeks). He further states: \"Bahâ al-Din may have been born in Balkh, but at least between June 1204 and 1210 (Shavvâl 600 and 607), during which time Rumi was born, Bahâ al-Din resided in a house in Vakhsh (Bah 2:143 [Bahâ' uddîn Walad's] book, \"Ma`ârif.\"). Vakhsh, rather than Balkh was the permanent base of Bahâ al-Din and his family until Rumi was around five years old (mei 16–35) [\n from a book in German by the scholar Fritz Meier—note inserted here]. At that time, in about the year 1212 (A.H. 608–609), the Valads moved to Samarqand (Fih 333; Mei 29–30, 36) [reference to Rumi's \"Discourses\" and to Fritz Meier's book—note inserted here], leaving behind Baâ al-Din's mother, who must have been at least seventy-five years old.\" a village on the Vakhsh River in present-day Tajikistan, or in the city of Balkh, in present-day Afghanistan.\n\nGreater Balkh was at that time a major centre of Persian cultureFranklin D. Lewis, Rumi: Past and Present, East and West: The life, Teaching and poetry of Jalal Al-Din Rumi, Oneworld Publication Limited, 2008 p. 9: \"How is that a Persian boy born almost eight hundred years ago in Khorasan, the northeastern province of greater Iran, in a region that we identify today as Central Asia, but was considered in those days as part of the greater Persian cultural sphere, wound up in central Anatolia on the receding edge of the Byzantine cultural sphere\" and Sufism had developed there for several centuries. The most important influences upon Rumi, besides his father, were the Persian poets Attar and Sanai.Maqsood Jafrī, The gleam of wisdom, Sigma Press, 2003. p. 238: \"Rumi has influenced a large number of writers while on the other hand he himself was under the great influence of Sanai and Attar. Rumi expresses his appreciation: \"Attar was the spirit, Sanai his eyes twain, And in time thereafter, Came we in their train\"A. J. Arberry, Sufism: An Account of the Mystics of Islam, Courier Dover Publications, Nov 9, 2001. p. 141 and mentions in another poem: \"Attar has traversed the seven cities of Love, We are still at the turn of one street\".Seyyed Hossein Nasr, The Garden of Truth: The Vision and Promise of Sufism, Islam's Mystical Tradition HarperCollins, Sep 2, 2008. page 130: \"Attar has traversed the seven cities of Love, We are still at the turn of one street!\" His father was also connected to the spiritual lineage of Najm al-Din Kubra.\n\nRumi lived most of his life under the PersianateGrousset, Rene, The Empire of the Steppes: A History of Central Asia, (Rutgers University Press, 2002), 157; \"...the Seljuk court at Konya adopted Persian as its official language\".Aḥmad of Niǧde's \"al-Walad al-Shafīq\" and the Seljuk Past, A. C. S. Peacock, Anatolian Studies, Vol. 54, (2004), 97; With the growth of Seljuk power in Rum, a more highly developed Muslim cultural life, based on the Persianate culture of the Great Seljuk court, was able to take root in AnatoliaCarter Vaughn Findley, The Turks in World History, Oxford University Press, Nov 11, 2004. p. 72: Meanwhile, amid the migratory swarm that Turkified Anatolia, the dispersion of learned men from the Persian-speaking east paradoxically made the Seljuks court at Konya a new center for Persian court culture, as exemplified by the great mystical poet Jelaleddin Rumi (1207–73). Seljuk Sultanate of Rum, where he produced his worksBarks, Coleman, Rumi: The Book of Love: Poems of Ecstasy and Longing, HarperCollins, 2005, p. xxv,  and died in 1273AD. He was buried in Konya, and his shrine became a place of pilgrimage.Note: Rumi's shrine is now known as the \"Mevlâna Museum\" in Turkey. Upon his death, his followers and his son Sultan Walad founded the Mevlevi Order, also known as the Order of the Whirling Dervishes, famous for the Sufi dance known as the Sama ceremony. He was laid to rest beside his father, and over his remains a shrine was erected. A hagiographical account of him is described in Shams ud-Din Ahmad Aflāki's Manāqib ul-Ārifīn (written between 1318 and 1353). This biography needs to be treated with care as it contains both legends and facts about Rumi.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2000. For example, Professor Franklin Lewis of the University of Chicago, author of the most complete biography on Rumi, has separate sections for the hagiographical biography of Rumi and the actual biography about him.\n\nRumi's father was Bahā ud-Dīn Walad, a theologian, jurist and a mystic from Balkh, who was also known by the followers of Rumi as Sultan al-Ulama or \"Sultan of the Scholars\". The popular hagiographical assertions that have claimed the family's descent from the Caliph Abu Bakr does not hold on closer examination and is rejected by modern scholars.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). pp. 90–92: \"Baha al-Din’s disciples also traced his family lineage to the first caliph, Abu Bakr (Sep 9; Af 7; JNO 457; Dow 213). This probably stems from willful confusion over his paternal great grandmother, who was the daughter of Abu Bakr of Sarakhs, a noted jurist (d. 1090). The most complete genealogy offered for family stretches back only six or seven generations and cannot reach to Abu Bakr, the companion and first caliph of the Prophet, who died two years after the Prophet, in C.E. 634 (FB 5–6 n.3).\"H. Algar, [http://www.iranicaonline.org/articles/baha-al-din-mohammad-walad-b “BAHĀʾ-AL-DĪN MOḤAMMAD WALAD“], Encyclopedia Iranica. There is no reference to such descent in the works of Bahāʾ-e Walad and Mawlānā Jalāl-al-Dīn or in the inscriptions on their sarcophagi. The attribution may have arisen from confusion between the caliph and another Abū Bakr, Šams-al-Aʾemma Abū Bakr Saraḵsī (d. 483/1090), the well-known Hanafite jurist, whose daughter, Ferdows Ḵātūn, was the mother of Aḥmad Ḵaṭīb, Bahāʾ-e Walad’s grandfather (see Forūzānfar, Resāla, p. 6). Tradition also links Bahāʾ-e Walad’s lineage to the Ḵᵛārazmšāh dynasty. His mother is said to have been the daughter of ʿAlāʾ-al-Dīn Moḥammad Ḵārazmšāh (d. 596/1200), but this appears to be excluded for chronological reasons (Forūzānfar, Resāla, p. 7)(Ritter, H.; Bausani, A. \"ḎJalāl al- Dīn Rūmī b. Bahāʾ al-Dīn Sulṭān al-ʿulamāʾ Walad b. Ḥusayn b. Aḥmad Ḵhaṭībī .\" Encyclopaedia of Islam. Edited by: P. Bearman, Th. Bianquis, C.E. Bosworth, E. van Donzel and W.P. Heinrichs. Brill, 2009. Brill Online. Excerpt: \"known by the sobriquet Mawlānā (Mevlâna), Persian poet and founder of the Mawlawiyya order of dervishes\"): \"The assertions that his family tree goes back to Abū Bakr, and that his mother was a daughter of the Ḵhwārizmshāh ʿAlāʾ al-Dīn Muḥammad (Aflākī, i, 8–9) do not hold on closer examination (B. Furūzānfarr, Mawlānā Ḏjalāl Dīn, Tehrān 1315, 7; ʿAlīnaḳī Sharīʿatmadārī, Naḳd-i matn-i mathnawī, in Yaghmā, xii (1338), 164; Aḥmad Aflākī, Ariflerin menkibeleri, trans. Tahsin Yazıcı, Ankara 1953, i, Önsöz, 44).\") The claim of maternal descent from the Khwarazmshah for Rumi or his father is also seen as a non-historical hagiographical tradition designed to connect the family with royalty, but this claim is rejected for chronological and historical reasons. The most complete genealogy offered for the family stretches back to six or seven generations to famous Hanafi jurists.\n\nWe do not learn the name of Baha al-Din's mother in the sources, only that he referred to her as \"Māmi\" (colloquial Persian for Māma),Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 44:“Baha al-Din’s father, Hosayn, had been a religious scholar with a bent for asceticism, occupied like his own father before him, Ahmad, with the family profession of preacher (khatib). Of the four canonical schools of Sunni Islam, the family adhered to the relatively liberal Hanafi fiqh. Hosayn-e Khatibi enjoyed such renown in his youth—so says Aflaki with characteristic exaggeration—that Razi al-Din Nayshapuri and other famous scholars came to study with him (Af 9; for the legend about Baha al-Din, see below, “The Mythical Baha al-Din”). Another report indicates that Baha al-Din’s grandfather, Ahmad al-Khatibi, was born to Ferdows Khatun, a daughter of the reputed Hanafite jurist and author Shams al-A’emma Abu Bakr of Sarakhs, who died circa 1088 (Af 75; FB 6 n.4; Mei 74 n. 17). This is far from implausible and, if true, would tend to suggest that Ahmad al-Khatabi had studied under Shams al-A’emma. Prior to that the family could supposedly trace its roots back to Isfahan. We do not learn the name of Baha al-Din’s mother in the sources, only that he referred to her as “Mama” (Mami), and that she lived to the 1200s.” (p. 44) and that she was a simple woman who lived to the 1200s. The mother of Rumi was Mu'mina Khātūn. The profession of the family for several generations was that of Islamic preachers of the liberal Hanafi rite, and this family tradition was continued by Rumi (see his Fihi Ma Fih and Seven Sermons) and Sultan Walad (see Ma'rif Waladi for examples of his everyday sermons and lectures).\n\nWhen the Mongols invaded Central Asia sometime between 1215 and 1220, Baha ud-Din Walad, with his whole family and a group of disciples, set out westwards. According to hagiographical account which is not agreed upon by all Rumi scholars, Rumi encountered one of the most famous mystic Persian poets, Attar, in the Iranian city of Nishapur, located in the province of Khorāsān. Attar immediately recognized Rumi's spiritual eminence. He saw the father walking ahead of the son and said, \"Here comes a sea followed by an ocean.\" He gave the boy his Asrārnāma, a book about the entanglement of the soul in the material world. This meeting had a deep impact on the eighteen-year-old Rumi and later on became the inspiration for his works.\n\nFrom Nishapur, Walad and his entourage set out for Baghdad, meeting many of the scholars and Sufis of the city.Ahmed, Nazeer, Islam in Global History: From the Death of Prophet Muhammed to the First World War, p.58, Xlibris Corporation (2000),  From Baghdad they went to Hejaz and performed the pilgrimage at Mecca. The migrating caravan then passed through Damascus, Malatya, Erzincan, Sivas, Kayseri and Nigde. They finally settled in Karaman for seven years; Rumi's mother and brother both died there. In 1225, Rumi married Gowhar Khatun in Karaman. They had two sons: Sultan Walad and Ala-eddin Chalabi. When his wife died, Rumi married again and had a son, Amir Alim Chalabi, and a daughter, Malakeh Khatun.\n\nOn 1 May 1228, most likely as a result of the insistent invitation of 'Alā' ud-Dīn Key-Qobād, ruler of Anatolia, Baha' ud-Din came and finally settled in Konya in Anatolia within the westernmost territories of the Seljuk Sultanate of Rûm.\n\nBaha' ud-Din became the head of a madrassa (religious school) and when he died, Rumi, aged twenty-five, inherited his position as the Islamic molvi. One of Baha' ud-Din's students, Sayyed Burhan ud-Din Muhaqqiq Termazi, continued to train Rumi in the Shariah as well as the Tariqa, especially that of Rumi's father. For nine years, Rumi practised Sufism as a disciple of Burhan ud-Din until the latter died in 1240 or 1241. Rumi's public life then began: he became an Islamic Jurist, issuing fatwas and giving sermons in the mosques of Konya. He also served as a Molvi (Islamic teacher) and taught his adherents in the madrassa.\n\nDuring this period, Rumi also travelled to Damascus and is said to have spent four years there.\n\nIt was his meeting with the dervish Shams-e Tabrizi on 15 November 1244 that completely changed his life. From an accomplished teacher and jurist, Rumi was transformed into an ascetic.\n\nShams had travelled throughout the Middle East searching and praying for someone who could \"endure my company\". A voice said to him, \"What will you give in return?\" Shams replied, \"My head!\" The voice then said, \"The one you seek is Jalal ud-Din of Konya.\" On the night of 5 December 1248, as Rumi and Shams were talking, Shams was called to the back door. He went out, never to be seen again. It is rumoured that Shams was murdered with the connivance of Rumi's son, 'Ala' ud-Din; if so, Shams indeed gave his head for the privilege of mystical friendship.\n\nRumi's love for, and his bereavement at the death of, Shams found their expression in an outpouring of lyric poems, Divan-e Shams-e Tabrizi. He himself went out searching for Shams and journeyed again to Damascus. There, he realised:\n\nMewlana had been spontaneously composing ghazals (Persian poems), and these had been collected in the Divan-i Kabir or Diwan Shams Tabrizi. Rumi found another companion in Salaḥ ud-Din-e Zarkub, a goldsmith. After Salah ud-Din's death, Rumi's scribe and favourite student, Hussam-e Chalabi, assumed the role of Rumi's companion. One day, the two of them were wandering through the Meram vineyards outside Konya when Hussam described to Rumi an idea he had had: \"If you were to write a book like the Ilāhīnāma of Sanai or the Mantiq ut-Tayr of 'Attar, it would become the companion of many troubadours. They would fill their hearts from your work and compose music to accompany it.\" Rumi smiled and took out a piece of paper on which were written the opening eighteen lines of his Masnavi, beginning with:\n\nHussam implored Rumi to write more. Rumi spent the next twelve years of his life in Anatolia dictating the six volumes of this masterwork, the Masnavi, to Hussam.\n\nIn December 1273, Rumi fell ill; he predicted his own death and composed the well-known ghazal, which begins with the verse:\n\nRumi died on 17 December 1273 in Konya; his body was interred beside that of his father, and a splendid shrine, the Yeşil Türbe (Green Tomb, قبه الخضراء; today the Mevlâna Museum), was erected over his place of burial. His epitaph reads:\n\nGeorgian Queen Gürcü Hatun was a close friend of Rumi. She was the one who sponsored the construction of his tomb in Konya.H. Crane \"Notes on Saldjūq Architectural Patronage in Thirteenth Century Anatolia,\" Journal of the Economic and Social History of the Orient, v. 36, n. 1 (1993), p. 18. The 13th century Mevlâna Mausoleum, with its mosque, dance hall, dervish living quarters, school and tombs of some leaders of the Mevlevi Order, continues to this day to draw pilgrims from all parts of the Muslim and non-Muslim world. Jalal al-Din who is also known as Rumi, was a philosopher and mystic of Islam.\n\nTeachings \n\nThe general theme of Rumi's thought, like that of other mystic and Sufi poets of Persian literature, is that of tawhid — union with the Beloved, from whom he sees himself as being cut off and aloof. His longing and desire to attain it is evident in the following poem from his book the Masnavi:\n\nThe Masnavi weaves fables, scenes from everyday life, Qur'anic revelations and exegesis, and metaphysics into a vast and intricate tapestry. In the East, it is said of him that he was \"not a prophet — but surely, he has brought a scripture.\"\n\nRumi believed passionately in the use of music, poetry and dance as a path for reaching God. For Rumi, music helped devotees to focus their whole being on the divine and to do this so intensely that the soul was both destroyed and resurrected. It was from these ideas that the practice of whirling Dervishes developed into a ritual form. His teachings became the base for the order of the Mevlevi, which his son Sultan Walad organised. Rumi encouraged Sama, listening to music and turning or doing the sacred dance. In the Mevlevi tradition, samāʿ represents a mystical journey of spiritual ascent through mind and love to the Perfect One. In this journey, the seeker symbolically turns towards the truth, grows through love, abandons the ego, finds the truth and arrives at the Perfect. The seeker then returns from this spiritual journey, with greater maturity, to love and to be of service to the whole of creation without discrimination with regard to beliefs, races, classes and nations.\n\nIn other verses in the Masnavi, Rumi describes in detail the universal message of love:\n\nRumi's favourite musical instrument was the ney (reed flute).\n\nMajor works \n\nRumi's poetry is often divided into various categories: the quatrains (rubayāt) and odes (ghazal) of the Divan, the six books of the Masnavi. The prose works are divided into The Discourses, The Letters, and the Seven Sermons.\n\nPoetic works \n\n* Rumi's major work is the Maṭnawīye Ma'nawī (Spiritual Couplets; ), a six-volume poem regarded by some Sufis\nAbdul Rahman Jami notes:\n\n(Khawaja Abdul Hamid Irfani, \"The Sayings of Rumi and Iqbal\", Bazm-e-Rumi, 1976.)\n as the Persian-language Qur'an. It is considered by many to be one of the greatest works of mystical poetry.J.T.P. de Bruijn, \"Comparative Notes on Sanai and 'Attar\", The Heritage of Sufism, L. Lewisohn, ed., p. 361: \"It is common place to mention Hakim Sana'i (d. 525/1131) and Farid al-Din 'Attar (1221) together as early highlights in a tradition of Persian mystical poetry which reached its culmination in the work of Mawlana Jalal al-Din Rumi and those who belonged to the early Mawlawi circle. There is abundant evidence available to prove that the founders of the Mawlawwiya in the thirteenth and fourteenth centuries regarded these two poets as their most important predecessors\" It contains approximately 27,000 lines of Persian poetry.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 306: \"The manuscripts versions differ greatly in the size of the text and orthography. Nicholson’s text has 25,577 lines though the average medieval and early modern manuscripts contained around 27,000 lines, meaning the scribes added two thousand lines or about eight percent more to the poem composed by Rumi. Some manuscripts give as many as 32,000!\"\n\n* Rumi's other major work is the Dīwān-e Kabīr (Great Work) or Dīwān-e Shams-e Tabrīzī (The Works of Shams of Tabriz; ), named in honour of Rumi's master Shams. Besides approximately 35000 Persian couplets and 2000 Persian quatrains,Franklin D. Lewis, Rumi: Past and Present, East and West: The Life, Teaching, and Poetry of Jalâl al-Din Rumi, rev. ed. (2008). p. 314: “The Foruzanfar’s edition of the Divan-e Shams compromises 3229 ghazals and qasidas making a total of almost 35000 lines, not including several hundred lines of stanzaic poems and nearly two thousand quatrains attributed to him” the Divan contains 90 Ghazals and 19 quatrains in Arabic,[http://www.dar-al-masnavi.org/about.html Dar al-Masnavi Website, accessed December 2009]: According to the Dar al-Masnavi website: “In Forûzânfar's edition of Rumi's Divan, there are 90 ghazals (Vol. 1, 29;Vol. 2, 1; Vol. 3, 6; Vol. 4, 8; Vol. 5, 19, Vol. 6, 0; Vol. 7, 27) and 19 quatrains entirely in Arabic. In addition, there are ghazals which are all Arabic except for the final line; many have one or two lines in Arabic within the body of the poem; some have as many as 9–13 consecutive lines in Arabic, with Persian verses preceding and following; some have alternating lines in Persian, then Arabic; some have the first half of the verse in Persian, the second half in Arabic.” a couple of dozen or so couplets in Turkish (mainly macaronic poems of mixed Persian and Turkish)Mecdut MensurOghlu: “The Divan of Jalal al-Din Rumi contains 35 couplets in Turkish and Turkish-Persian which have recently been published me” (Celal al-Din Rumi’s turkische Verse: UJb. XXIV (1952), pp. 106–115)Franklin D. Lewis, Rumi: Past and Present, East and West: The Life, Teaching, and Poetry of Jalâl al-Din Rumi, rev. ed. (2008): \"“a couple of dozen at most of the 35,000 lines of the Divan-I Shams are in Turkish, and almost all of these lines occur in poems that are predominantly in Persian”\" and 14 couplets in Greek (all of them in three macaronic poems of Greek-Persian).Dedes, D. 1993. Ποίηματα του Μαυλανά Ρουμή [Poems by Rumi]. Ta Istorika 10.18–19: 3–22.http://www.opoudjis.net/Play/rumiwalad.htmlFranklin D. Lewis, Rumi: Past and Present, East and West: The Life, Teaching, and Poetry of Jalâl al-Din Rumi, rev. ed. (2008): \"Three poems have bits of demotic Greek; these have been identified and translated into French, along with some Greek verses of Sultan Valad. Golpinarli (GM 416–417) indicates according to Vladimir Mir Mirughli, the Greek used in some of Rumi’s macaronic poems reflects the demotic Greek of the inhabitants of Anatolia. Golpinarli then argues that Rumi knew classical Persian and Arabic with precision, but typically composes poems in a more popular or colloquial Persian and Arabic.\".\n\nProse works \n\n* Fihi Ma Fihi (In It What's in It, Persian: فیه ما فیه) provides a record of seventy-one talks and lectures given by Rumi on various occasions to his disciples. It was compiled from the notes of his various disciples, so Rumi did not author the work directly.Franklin Lewis, Rumi: Past and Present, East and West — The Life, Teachings, and Poetry of Jalal al-Din Rumi, Oneworld Publications, 2000, Chapter 7. An English translation from the Persian was first published by A.J. Arberry as Discourses of Rumi (New York: Samuel Weiser, 1972), and a translation of the second book by Wheeler Thackston, Sign of the Unseen (Putney, VT: Threshold Books, 1994). The style of the Fihi ma fihi is colloquial and meant for middle-class men and women, and lack the sophisticated wordplay.“As Safa points out (Saf 2:1206) the Discourse reflect the stylistics of oral speech and lack the sophisticated word plays, Arabic vocabulary and sound patterning that we would except from a consciously literary text of this period. Once again, the style of Rumi as lecturer or orator in these discourses does not reflect an audience of great intellectual pretensions, but rather middle-class men and women, along with number of statesmen and rulers”” (Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 292)\n* Majāles-e Sab'a (Seven Sessions, Persian: ) contains seven Persian sermons (as the name implies) or lectures given in seven different assemblies. The sermons themselves give a commentary on the deeper meaning of Qur'an and Hadith. The sermons also include quotations from poems of Sana'i, 'Attar, and other poets, including Rumi himself. As Aflakī relates, after Shams-e Tabrīzī, Rumi gave sermons at the request of notables, especially Salāh al-Dīn Zarkūb. The style of Persian is rather simple, but quotation of Arabic and knowledge of history and the Hadith show Rumi's knowledge in the Islamic sciences. His style is typical of the genre of lectures given by Sufis and spiritual teachers.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 293\n* Makatib (The Letters, Persian: مکاتیب) is the book containing Rumi's letters in Persian to his disciples, family members, and men of state and of influence. The letters testify that Rumi kept very busy helping family members and administering a community of disciples that had grown up around them. Unlike the Persian style of the previous two mentioned works (which are lectures and sermons), the letters are consciously sophisticated and epistolary in style, which is in conformity with the expectations of correspondence directed to nobles, statesmen and kings.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2008 (revised edition). p. 295:“In contrast with the prose of his Discourses and sermons, the style of the letters is consciously sophisticated and epistolary, in conformity with the expectations of correspondence directed to nobles, statesmen and kings\"\n\nReligious outlook \n\nRumi belongs to the class of Islamic philosophers which include Ibn Arabi and Mulla Sadra. These transcendental philosophers are often studied together in traditional schools of irfan, philosophy and theosophy throughout the Muslim world.Nasr, Seyyed Hossein (2000) Transcendent Theosophy of Mulla Sadra \n\nRumi embeds his theosophy (transcendental philosophy) like a string through the beads of his poems and stories.  His main point and emphasis is the unity of being.\n\nIt is undeniable that Rumi was a Muslim scholar and took Islam seriously. Nonetheless, the depth of his spiritual vision extended beyond narrow understanding sectarian concerns. One rubaiyat reads:\n\nAccording to the Quran, Prophet Muhammad is a mercy sent by God to the Aalameen (to all creation), including humanity overall. In regards to this, Rumi states:\n\n\"The Light of Muhammad does not abandon a Zoroastrian or Jew in the world. May the shade of his good fortune shine upon everyone! He brings all of those who are led astray into the Way out of the desert.\"\n\nRumi, however, asserts the supremacy of Islam by stating:\n\n\"The Light of Muhammad has become a thousand branches (of knowledge), a thousand, so that both this world and the next have been seized from end to end. If Muhammad rips the veil open from a single such branch, thousands of monks and priests will tear the string of false belief from around their waists.\"\n\nMany of Rumi's poems suggest the importance of outward religious observance and the primacy of the Qur'an.\n\nRumi states:\n\nI am the servant of the Qur'an as long as I have life.\nI am the dust on the path of Muhammad, the Chosen one.\nIf anyone quotes anything except this from my sayings,\nI am quit of him and outraged by these words.\n\nRumi also states:\n\nOn the first page of the Masnavi, Rumi states:\n \"Hadha kitâbu 'l- mathnawîy wa huwa uSûlu uSûli uSûli 'd-dîn wa kashshâfu 'l-qur'ân.\"\n\"This is the book of the Masnavi, and it is the roots of the roots of the roots of the (Islamic) Religion and it is the Explainer of the Qur'ân.\"\n\nSeyyed Hossein Nasr states:\nOne of the greatest living authorities on Rûmî in Persia today, Hâdî Hâ'irî, has shown in an unpublished work that some 6,000 verses of the Dîwân and the Mathnawî are practically direct translations of Qur'ânic verses into Persian poetry.Seyyed Hossein Nasr, \"Rumi and the Sufi Tradition,\" in Chelkowski (ed.), The Scholar and the Saint, p. 183\n\nRumi states in his Dīwān:\nThe Sufi is hanging on to Muhammad, like Abu Bakr.Quoted in Ibrahim Gamard, Rumi and Islam: Selections from His Stories, Poems, and Discourses — Annotated and Explained, p. 171.\n\nHis Masnavi contains anecdotes and stories derived largely from the Quran and the hadith, as well as everyday tales.\n\nLegacy \n\nRumi's poetry forms the basis of much classical Iranian and Afghan music. Contemporary classical interpretations of his poetry are made by Muhammad Reza Shajarian, Shahram Nazeri, Davood Azad (the three from Iran) and Ustad Mohammad Hashem Cheshti (Afghanistan). To many modern Westerners, his teachings are one of the best introductions to the philosophy and practice of Sufism. In the West Shahram Shiva has been teaching, performing and sharing the translations of the poetry of Rumi for nearly twenty years and has been instrumental in spreading Rumi's legacy in the English-speaking parts of the world. Pakistan's National Poet, Muhammad Iqbal, was also inspired by Rumi's works and considered him to be his spiritual leader, addressing him as \"Pir Rumi\" in his poems (the honorific Pir literally means \"old man\", but in the Sufi/mystic context it means founder, master, or guide).\n\nShahram Shiva asserts that \"Rumi is able to verbalise the highly personal and often confusing world of personal growth and development in a very clear and direct fashion. He does not offend anyone, and he includes everyone.... Today Rumi's poems can be heard in churches, synagogues, Zen monasteries, as well as in the downtown New York art/performance/music scene.\"\n\nAccording to Professor Majid M. Naini, \"Rumi's life and transformation provide true testimony and proof that people of all religions and backgrounds can live together in peace and harmony. Rumi’s visions, words, and life teach us how to reach inner peace and happiness so we can finally stop the continual stream of hostility and hatred and achieve true global peace and harmony.”\n\nRumi's work has been translated into many of the world's languages, including Russian, German, Urdu, Turkish, Arabic, Bengali, French, Italian, and Spanish, and is being presented in a growing number of formats, including concerts, workshops, readings, dance performances, and other artistic creations. The English interpretations of Rumi's poetry by Coleman Barks have sold more than half a million copies worldwide, and Rumi is one of the most widely read poets in the United States.Curiel, Jonathan, San Francisco Chronicle Staff Writer, Islamic verses: The influence of Muslim literature in the United States has grown stronger since the Sept. 11 attacks (February 6, 2005), [http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2005/02/06/INGH7B3FM31.DTL Available online] (Retrieved Aug 2006) Shahram Shiva book \"Rending the Veil: Literal and Poetic Translations of Rumi\" (1995, HOHM Press) is the recipient of the Benjamin Franklin Award.\n\nRecordings of Rumi poems have made it to the USA's Billboard's Top 20 list. A selection of American author Deepak Chopra's editing of the translations by Fereydoun Kia of Rumi's love poems has been performed by Hollywood personalities such as Madonna, Goldie Hawn, Philip Glass and Demi Moore.\n\nThere is a famous landmark in Northern India, known as Rumi Gate, situated in Lucknow (the capital of Uttar Pradesh) named for Rumi.\n\nRumi and his mausoleum were depicted on the reverse of the 5000 Turkish lira banknotes of 1981–1994.Banknote Museum: 7. Emission Group—Five Thousand Turkish Lira—[http://www.tcmb.gov.tr/yeni/banknote/E7/274.htm I. Series] , [http://www.tcmb.gov.tr/yeni/banknote/E7/276.htm II. Series]  & [http://www.tcmb.gov.tr/yeni/banknote/E7/278.htm III. Series]. Retrieved on 20 April 2009.  \n\nIranian world \n\nThese cultural, historical and linguistic ties between Rumi and Iran have made Rumi an iconic Iranian poet, and some of the most important Rumi scholars including Foruzanfar, Naini, Sabzewari, etc., have come from modern Iran.Franklin Lewis, Rumi: Past and Present, East and West, Oneworld Publications, 2000. Rumi's poetry is displayed on the walls of many cities across Iran, sung in Persian music, and read in school books.See for example 4th grade Iranian school book where the story of the Parrot and Merchant from the Mathnawi is taught to students\n\nMewlewī Sufi Order \n\nThe Mewlewī Sufi order was founded in 1273 by Rumi's followers after his death. His first successor in the rectorship of the order was \"Husam Chalabi\" himself, after whose death in 1284 Rumi's younger and only surviving son, Sultan Walad (died 1312), popularly known as author of the mystical Maṭnawī Rabābnāma, or the Book of the Rabab was installed as grand master of the order.[http://www.islamicsupremecouncil.org/bin/site/wrappers/spirituality-mevlevi.html ISCA—The Islamic Supreme Council of America]  The leadership of the order has been kept within Rumi's family in Konya uninterruptedly since then.\nThe Mewlewī Sufis, also known as Whirling Dervishes, believe in performing their dhikr in the form of Sama. During the time of Rumi (as attested in the Manāqib ul-Ārefīn of Aflākī), his followers gathered for musical and \"turning\" practices.\n\nAccording to tradition, Rumi was himself a notable musician who played the robāb, although his favourite instrument was the ney or reed flute. The music accompanying the samāʿ consists of settings of poems from the Maṭnawī and Dīwān-e Kabīr, or of Sultan Walad's poems. The Mawlawīyah was a well-established Sufi order in the Ottoman Empire, and many of the members of the order served in various official positions of the Caliphate. The centre for the Mevlevi was in Konya. There is also a Mewlewī monastery (, dargāh) in Istanbul near the Galata Tower in which the samāʿ is performed and accessible to the public. The Mewlewī order issues an invitation to people of all backgrounds:\n\nDuring Ottoman times, the Mevlevi produced a number of notable poets and musicians, including Sheikh Ghalib, Ismail Rusuhi Dede of Ankara, Esrar Dede, Halet Efendi, and Gavsi Dede, who are all buried at the Galata Mewlewī Khāna (Turkish: Mevlevi-Hane) in Istanbul.[http://www.istanbulportal.com/istanbulportal/Divan.aspx Web Page Under Construction]  Music, especially that of the ney, plays an important part in the Mevlevi.\n\nWith the foundation of the modern, secular Republic of Turkey, Mustafa Kemal Atatürk removed religion from the sphere of public policy and restricted it exclusively to that of personal morals, behaviour and faith. On 13 December 1925, a law was passed closing all the tekkes (dervish lodges) and zāwiyas (chief dervish lodges), and the centres of veneration to which visits (ziyārat) were made. Istanbul alone had more than 250 tekkes as well as small centres for gatherings of various fraternities; this law dissolved the Sufi Orders, prohibited the use of mystical names, titles and costumes pertaining to their titles, impounded the Orders' assets, and banned their ceremonies and meetings. The law also provided penalties for those who tried to re-establish the Orders. Two years later, in 1927, the Mausoleum of Mevlâna in Konya was allowed to reopen as a Museum.Mango, Andrew, Atatürk: The Biography of the Founder of Modern Turkey, (2002), .\n\nIn the 1950s, the Turkish government began allowing the Whirling Dervishes to perform once a year in Konya. The Mewlānā festival is held over two weeks in December; its culmination is on 17 December, the Urs of Mewlānā (anniversary of Rumi's death), called Šabe Arūs (شب عروس) (Persian meaning \"nuptial night\"), the night of Rumi's union with God.[http://www.kloosterman.be/rumi.php Kloosterman Genealogy, Jalal al-Din Muhammad Rumi]  In 1974, the Whirling Dervishes were permitted to travel to the West for the first time. In 2005, UNESCO proclaimed \"The Mevlevi Sama Ceremony\" of Turkey as one of the Masterpieces of the Oral and Intangible Heritage of Humanity.[http://www.unesco.org/culture/intangible-heritage/39eur_uk.htm The Mevlevi Sema Ceremony] UNESCO.\n\nReligious denomination \n\nAs Edward G. Browne noted, the three most prominent mystical Persian poets Rumi, Sanai and Attar were all Sunni Muslims and their poetry abounds with praise for the first two caliphs Abu Bakr and Umar ibn al-Khattāb.Edward G. Browne, A Literary History of Persia from the Earliest Times Until Firdawsh, 543 pp., Adamant Media Corporation, 2002, ,  (see p.437) According to Annemarie Schimmel, the tendency among Shia authors to anachronistically include leading mystical poets such as Rumi and Attar among their own ranks, became stronger after the introduction of Twelver Shia as the state religion in the Safavid Empire in 1501.Annemarie Schimmel, Deciphering the Signs of God, 302 pp., SUNY Press, 1994, ,  (see p.210)\n\nEight hundredth anniversary celebrations \n\nIn Afghanistan, Rumi is known as Mawlānā, in Turkey as Mevlâna, and in Iran as Molavī.\n\nAt the proposal of the Permanent Delegations of Afghanistan, Iran, and Turkey, and as approved by its Executive Board and General Conference in conformity with its mission of “constructing in the minds of men the defences of peace”, UNESCO was associated with the celebration, in 2007, of the eight hundredth anniversary of Rumi's birth. The commemoration at UNESCO itself took place on 6 September 2007; UNESCO issued a medal in Rumi's name in the hope that it would prove an encouragement to those who are engaged in research on and dissemination of Rumi's ideas and ideals, which would, in turn, enhance the diffusion of the ideals of UNESCO.\n\nThe Afghan Ministry of Culture and Youth established a national committee, which organised an international seminar to celebrate the birth and life of the great ethical philosopher and world-renowned poet. This grand gathering of the intellectuals, diplomats, and followers of Mewlana was held in Kabul and in Balkh, the Mewlana's place of birth.\n\nOn 30 September 2007, Iranian school bells were rung throughout the country in honour of Mewlana.[http://www.hamshahrionline.ir/News/?id36533 همشهری آنلاین]  Also in that year, Iran held a Rumi Week from 26 October to 2 November. An international ceremony and conference were held in Tehran; the event was opened by the Iranian president and the chairman of the Iranian parliament. Scholars from twenty-nine countries attended the events, and 450 articles were presented at the conference.[http://www2.irna.ir/en/news/view/line-16/0710285006110934.htm Int'l congress on Molana opens in Tehran]  Iranian musician Shahram Nazeri was awarded the Légion d'honneur and Iran's House of Music Award in 2007 for his renowned works on Rumi masterpieces.[http://www.iran-daily.com/1385/2676/html/art.htm#s178308 Iran Daily — Arts & Culture — 10/03/06]   2007 was declared as the \"International Rumi Year\" by UNESCO.[http://www.chnpress.com/news/?section\n2&id=6694 CHN | News]\n\nAlso on 30 September 2007, Turkey celebrated Rumi’s eight-hundredth birthday with a giant Whirling Dervish ritual performance of the samāʿ, which was televised using forty-eight cameras and broadcast live in eight countries. Ertugrul Gunay, of the Ministry of Culture and Tourism, stated, \"Three hundred dervishes are scheduled to take part in this ritual, making it the largest performance of sema in history.\"[http://www.tehrantimes.com/index_View.asp?code=154044 tehrantimes.com, 300 dervishes whirl for Rumi in Turkey]\n\nMawlana Rumi Review \n\nThe Mawlana Rumi Review () is published annually by The Centre for Persian and Iranian Studies at the University of Exeter in collaboration with The Rumi Institute, Nicosia, Cyprus, and Archetype Books, Cambridge. The first volume was published in 2010, and it has come out annually since then. According to the principal editor of the journal, Leonard Lewisohn: \"Although a number of major Islamic poets easily rival the likes of Dante, Shakespeare and Milton in importance and output, they still enjoy only a marginal literary fame in the West because the works of Arabic and Persian thinkers, writers and poets are considered as negligible, frivolous, tawdry sideshows beside the grand narrative of the Western Canon. It is the aim of the Mawlana Rumi Review to redress this carelessly inattentive approach to world literature, which is something far more serious than a minor faux pas committed by the Western literary imagination.\". Rumi. http://en.wikipedia.org/?curid=16433."
  }
}
