{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18562",
  "eid" : "339ddc40-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778595844,
  "textBody" : "Leet (or \"1337\"), also known as eleet or leetspeak, is a system of modified spellings and verbiage used primarily on the Internet for many phonetic languages. It uses some alphabetic characters to replace others in ways that play on the similarity of their glyphs via reflection or other resemblance. Additionally, it modifies certain words based on a system of suffixes and alternative meanings.\n\nThe term \"leet\" is derived from the word elite. The leet lexicon involves a specialized form of symbolic writing. For example, leet spellings of the word leet include 1337 and l33t; eleet may be spelled 31337 or 3l33t. Leet may also be considered a substitution cipher, although many dialects or linguistic varieties exist in different online communities.\n\nThe word \"leet\" is also simply used as an adjective to describe formidable prowess or accomplishment, especially in the fields of online gaming and in its original usage for computer hacking.\n\nHistory\n\nLeet originated within bulletin board systems (BBS) in the 1980s,Mitchell.An Explanation of l33t Speak. where having \"elite\" status on a BBS allowed a user access to file folders, games, and special chat rooms.  The Cult of the Dead Cow hacker collective has been credited with the original coining of the term, in their text-files of that era.Mello, John P.(2015) \"[http://www.ecommercetimes.com/story/Google-Expands-Bug-Bounty-Program-81668.html] Google Expands Bug Bounty Program\" February 2, 2015. E-Commerce Times  One theory is that it was developed to defeat text filters created by BBS or Internet Relay Chat system operators for message boards to discourage the discussion of forbidden topics, like cracking and hacking. Creative misspellings and ASCII-art-derived words were also a way to attempt to indicate one was knowledgeable about the culture of computer users. Once the reserve of hackers, crackers, and script kiddies, leet has since entered the mainstream. It is now also used to mock newbies, or newcomers, on web sites, or in gaming communities.Rome. Some consider emoticons and ASCII art, like smiley faces, to be leet, while others maintain that leet consists of only symbolic word encryption. More obscure forms of leet, involving the use of symbol combinations and almost no letters or numbers, continue to be used for its original purpose of encrypted communication. It is also sometimes used as a script language. Variants of leet have been used for censorship purposes for many years; for instance \"@$$\" (ass) and \"$#!+\" (shit) are frequently seen to make a word appear censored to the untrained eye but obvious to a person familiar with leet.\n\nLeet symbols, especially the number 1337, are Internet memes that have spilled over into popular culture. Signs that show the numbers \"1337\" are popular motifs for pictures and shared widely across the Internet.\n\nOrthography\n\nOne of the hallmarks of leet is its unique approach to orthography, using substitutions of other characters, letters or otherwise, to represent a letter or letters in a word.Sterling, 70.Blashki & Nichol, 80. For more casual use of leet, the primary strategy is to use homoglyphs, symbols that closely resemble (to varying degrees) the letters for which they stand. The choice of symbol is not fixed—anything that the reader can make sense of is valid. However, this practice is not extensively used in regular leet; more often it is seen in situations where the argot (i.e., secret language) characteristics of the system are required, either to exclude newbies or outsiders in general, i.e., anything that the average reader cannot make sense of is valid; a valid reader should himself try to make sense, if deserving of the underlying message. Another use for Leet orthographic substitutions is the creation of paraphrased passwords. Limitations imposed by websites on password length (usually no more than 36) and the characters permitted (usually alphanumeric and underscore) require less extensive forms of Leet when used in this application.\n\nSome examples of leet include B1ff and n00b, a term for the stereotypical newbie; the l33t programming language; and the web-comic Megatokyo, which contains characters who speak leet.\n\nMorphology\n\nText rendered in leet is often characterized by distinctive, recurring forms.\n\n;The -xor suffix\nThe meaning of this suffix is parallel with the English -er and -r suffixes (seen in hacker and lesser), in that it derives agent nouns from a verb stem. It is realized in two different forms: -xor and -zor, and, respectively. For example, the first may be seen in the word hax(x)or (H4x0r in leet) and the second in pwnzor. Additionally, this nominalization may also be inflected with all of the suffixes of regular English verbs. The letter 'o' is often replaced with the numeral 0.\n\n;The -age suffix\nDerivation of a noun from a verb stem is possible by attaching -age to the base form of any verb. Attested derivations are pwnage, skillage,  and speakage. However, leet provides exceptions; the word leetage is acceptable, referring to actively being leet.Blashki & Nichol, 79. These nouns are often used with a form of \"to be\" rather than \"to have,\" e.g., \"that was pwnage\" rather than \"he has pwnage\". Either is a more emphatic way of expressing the simpler \"he pwns,\" but the former implies that the person is embodying the trait rather than merely possessing it.\n\n;The -ness suffix\nDerivation of a noun from an adjective stem is done by attaching -ness to any adjective. This is entirely the same as the English form, except it is used much more often in Leet. Nouns such as lulzness and leetness are derivations using this suffix.\n\n;Words ending in -ed\nWhen forming a past participle ending in -ed, the Leet user may replace the -e with an apostrophe, as was common in poetry of previous centuries, (e.g. \"pwned\" becomes \"pwn'd\"). Sometimes, the apostrophe is removed as well (e.g. \"pwned\" becomes \"pwnd\"). The word ending may also be substituted by -t (e.g. pwned becomes pwnt).LeBlanc, 33.\n\n;Use of the -& suffix\nWords ending in -and, -anned, -ant, or a similar sound can sometimes be spelled with an ampersand (&) to express the ending sound (e.g. \"This is the s&box,\" \"I'm sorry, you've been b&\", \"&hill/&farm\"). This is most commonly used with the word banned. An alternate form of \"B&\" is \"B7\", as the ampersand is typed with the \"7\" key in the standard US keyboard layout.  It is often seen in the phrase \"IBB7\" (in before banned), which indicates that the poster believes that a previous poster will soon be banned from the site, channel, or board on which they are both posting.\n\nGrammar\n\nLeet can be pronounced as a single syllable,, rhyming with eat, by way of aphesis of the initial vowel of \"elite\". It may also be pronounced as two syllables,. Like hacker slang, leet enjoys a looser grammar than standard English. The loose grammar, just like loose spelling, encodes some level of emphasis, ironic or otherwise. A reader must rely more on intuitive parsing of leet to determine the meaning of a sentence rather than the actual sentence structure. In particular, speakers of leet are fond of verbing nouns, turning verbs into nouns (and back again) as forms of emphasis, e.g. \"Austin rocks\" is weaker than \"Austin roxxorz\" (note spelling), which is weaker than \"Au5t1N is t3h r0xx0rz\" (note grammar), which is weaker than something like \"0MFG D00D /\\Ü571N 15 T3H l_l83Я 1337 Я0XX0ЯZ\" (OMG, dude, Austin is the über-elite rocks-er!). In essence, all of these mean \"Austin rocks,\" not necessarily the other options. Added words and misspellings add to the speaker's enjoyment. Leet, like hacker slang, employs analogy in construction of new words. For example, if haxored is the past tense of the verb \"to hack\" (hack → haxor → haxored), then winzored would be easily understood to be the past tense conjugation of \"to win,\" even if the reader had not seen that particular word before.\n\nLeet has its own colloquialisms, many of which originated as jokes based on common typing errors, habits of new computer users, or knowledge of cyberculture and history.Blashki & Nichol, 81. Leet is not solely based upon one language or character set. Greek, Russian, and other languages have leet forms, and leet in one language may use characters from another where they are available. As such, while it may be referred to as a \"cipher\", a \"dialect\", or a \"language\", leet does not fit squarely into any of these categories. The term leet itself is often written 31337, or 1337, and many other variations. After the meaning of these became widely familiar, 10100111001 came to be used in its place, because it is the binary form of 1337 decimal, making it more of a puzzle to interpret.This appears as an in-joke for technical illustrations such as these: (a)(b) An increasingly common characteristic of leet is the changing of grammatical usage so as to be deliberately incorrect. The widespread popularity of deliberate misspelling is similar to the cult following of the \"All your base are belong to us\" phrase. Indeed, the online and computer communities have been international from their inception, so spellings and phrases typical of non-native speakers are quite common.\n\nVocabulary\n\nMany words originally derived from leet slang have now become part of the modern Internet slang, such as \"pwned\". The original driving forces of new vocabulary in leet were common misspellings and typing errors such as \"teh\" (generally considered lolspeak), and intentional misspellings,Blashki & Nichol, 83. especially the \"z\" at the end of words (\"skillz\"). Another prominent example of a surviving leet expression is w00t, an exclamation of joy. w00t is sometimes used as a backronym for \"We owned the other team.\"\n\nNew words (or corruptions thereof) may arise from a need to make one's username unique. As any given Internet service reaches more people, the number of names available to a given user is drastically reduced. While many users may wish to have the username \"CatLover,\" for example, in many cases it is only possible for one user to have the moniker. As such, degradations of the name may evolve, such as \"C@7L0vr.\" As the leet cipher is highly dynamic, there is a wider possibility for multiple users to share the \"same\" name, through combinations of spelling and transliterations.\n\nAdditionally, leet—the word itself—can be found in the screen-names and gamertags of many Internet and video games. Use of the term in such a manner announces a high level of skill, though such an announcement may be seen as baseless hubris.Computer Hope Dictionary. \n\nTerminology and common misspellings\n\nWarez (nominally) is a plural shortening of \"software\", typically referring to cracked and redistributed software. Phreaking refers to the hacking of telephone systems and other non-Internet equipment. Teh originated as a typographical error of \"the\", and is sometimes spelled t3h.LeBlanc, 34-35. j00 takes the place of \"you\", originating from the affricate sound that occurs in place of the palatal approximant,, when you follows a word ending in an alveolar plosive consonant, such as or. Also, from German, is über, which means \"over\" or \"above\"; it usually appears as a prefix attached to adjectives, and is frequently written without the umlaut over the u.Van de Velde & Meuleman.\n\nHaxor and suxxor (suxorz)\n\nHaxor, and derivations thereof, is leet for \"hacker\",LeBlanc, 30; 32. and it is one of the most commonplace examples of the use of the -xor suffix. Suxxor (pronounced suck-zor) is a derogatory term which originated in warez culture and is currently used in multi-user environments such as multiplayer video games and instant messaging; it, like haxor, is one of the early leet words to use the -xor suffix. Suxxor is a modified version of \"sucks\" (the phrase \"to suck\"), and the meaning is the same as the English slang. Its negative definition essentially makes it the opposite of roxxor, and both can be used as a verb or a noun. The letters ck are often replaced with the Greek Χ (chi) in other words as well.\n\nn00b\n\nWithin leet, the term n00b, and derivations thereof, is used extensively. The word means and derives from newbie (as in new and inexperienced or uninformed), and is used as a means of segregating them as less than the \"elite,\" or even \"normal,\" members of a group.\n\nOwned and pwned\n\nOwned and pwn3d (generally pronounced \"owned\" and \"poned\", respectively) both refer to the domination of a player in a video game or argument (rather than just a win), or the successful hacking of a website or computer.LeBlanc, 32-33.\n\nAs is a common characteristic of leet, the terms have also been adapted into noun and adjective forms, ownage and pwnage, which can refer to the situation of pwning or to the superiority of its subject (e.g., \"He is a very good player. He is pwnage.\").\n\nPr0n\n\nPr0n is slang for pornography. This is a deliberately inaccurate spelling/pronunciation for porn,The Acronym Finder. where a zero is often used to replace the letter O. It is sometimes used in legitimate communications (such as email discussion groups, Usenet, chat rooms, and Internet web pages) to circumvent language and content filters, which may reject messages as offensive or spam. The word also helps prevent search engines from associating commercial sites with pornography, which might result in unwelcome traffic. Pr0n is also sometimes spelled backwards (n0rp) to further obscure the meaning to potentially uninformed readers.This can be observed by searching for \"n0rp\" on a search engine. It can also refer to ASCII art depicting pornographic images, or to photos of the internals of consumer and industrial hardware. Prawn, a spoof of the misspelling, has started to come into use, as well; in Grand Theft Auto: Vice City, a pornographer films his movies on \"Prawn Island\". Conversely, in the RPG Kingdom of Loathing, prawn, referring to a kind of crustacean, is spelled pr0n, leading to the creation of food items such as \"pr0n chow mein\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Leet" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18562" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Leet (or \"1337\"), also known as eleet or leetspeak, is a system of modified spellings and verbiage used primarily on the Internet for many phonetic languages. It uses some alphabetic characters to replace others in ways that play on the similarity of their glyphs via reflection or other resemblance. Additionally, it modifies certain words based on a system of suffixes and alternative meanings.\n\nThe term \"leet\" is derived from the word elite. The leet lexicon involves a specialized form of symbolic writing. For example, leet spellings of the word leet include 1337 and l33t; eleet may be spelled 31337 or 3l33t. Leet may also be considered a substitution cipher, although many dialects or linguistic varieties exist in different online communities.\n\nThe word \"leet\" is also simply used as an adjective to describe formidable prowess or accomplishment, especially in the fields of online gaming and in its original usage for computer hacking.\n\nHistory\n\nLeet originated within bulletin board systems (BBS) in the 1980s,Mitchell.An Explanation of l33t Speak. where having \"elite\" status on a BBS allowed a user access to file folders, games, and special chat rooms.  The Cult of the Dead Cow hacker collective has been credited with the original coining of the term, in their text-files of that era.Mello, John P.(2015) \"[http://www.ecommercetimes.com/story/Google-Expands-Bug-Bounty-Program-81668.html] Google Expands Bug Bounty Program\" February 2, 2015. E-Commerce Times  One theory is that it was developed to defeat text filters created by BBS or Internet Relay Chat system operators for message boards to discourage the discussion of forbidden topics, like cracking and hacking. Creative misspellings and ASCII-art-derived words were also a way to attempt to indicate one was knowledgeable about the culture of computer users. Once the reserve of hackers, crackers, and script kiddies, leet has since entered the mainstream. It is now also used to mock newbies, or newcomers, on web sites, or in gaming communities.Rome. Some consider emoticons and ASCII art, like smiley faces, to be leet, while others maintain that leet consists of only symbolic word encryption. More obscure forms of leet, involving the use of symbol combinations and almost no letters or numbers, continue to be used for its original purpose of encrypted communication. It is also sometimes used as a script language. Variants of leet have been used for censorship purposes for many years; for instance \"@$$\" (ass) and \"$#!+\" (shit) are frequently seen to make a word appear censored to the untrained eye but obvious to a person familiar with leet.\n\nLeet symbols, especially the number 1337, are Internet memes that have spilled over into popular culture. Signs that show the numbers \"1337\" are popular motifs for pictures and shared widely across the Internet.\n\nOrthography\n\nOne of the hallmarks of leet is its unique approach to orthography, using substitutions of other characters, letters or otherwise, to represent a letter or letters in a word.Sterling, 70.Blashki & Nichol, 80. For more casual use of leet, the primary strategy is to use homoglyphs, symbols that closely resemble (to varying degrees) the letters for which they stand. The choice of symbol is not fixed—anything that the reader can make sense of is valid. However, this practice is not extensively used in regular leet; more often it is seen in situations where the argot (i.e., secret language) characteristics of the system are required, either to exclude newbies or outsiders in general, i.e., anything that the average reader cannot make sense of is valid; a valid reader should himself try to make sense, if deserving of the underlying message. Another use for Leet orthographic substitutions is the creation of paraphrased passwords. Limitations imposed by websites on password length (usually no more than 36) and the characters permitted (usually alphanumeric and underscore) require less extensive forms of Leet when used in this application.\n\nSome examples of leet include B1ff and n00b, a term for the stereotypical newbie; the l33t programming language; and the web-comic Megatokyo, which contains characters who speak leet.\n\nMorphology\n\nText rendered in leet is often characterized by distinctive, recurring forms.\n\n;The -xor suffix\nThe meaning of this suffix is parallel with the English -er and -r suffixes (seen in hacker and lesser), in that it derives agent nouns from a verb stem. It is realized in two different forms: -xor and -zor, and, respectively. For example, the first may be seen in the word hax(x)or (H4x0r in leet) and the second in pwnzor. Additionally, this nominalization may also be inflected with all of the suffixes of regular English verbs. The letter 'o' is often replaced with the numeral 0.\n\n;The -age suffix\nDerivation of a noun from a verb stem is possible by attaching -age to the base form of any verb. Attested derivations are pwnage, skillage,  and speakage. However, leet provides exceptions; the word leetage is acceptable, referring to actively being leet.Blashki & Nichol, 79. These nouns are often used with a form of \"to be\" rather than \"to have,\" e.g., \"that was pwnage\" rather than \"he has pwnage\". Either is a more emphatic way of expressing the simpler \"he pwns,\" but the former implies that the person is embodying the trait rather than merely possessing it.\n\n;The -ness suffix\nDerivation of a noun from an adjective stem is done by attaching -ness to any adjective. This is entirely the same as the English form, except it is used much more often in Leet. Nouns such as lulzness and leetness are derivations using this suffix.\n\n;Words ending in -ed\nWhen forming a past participle ending in -ed, the Leet user may replace the -e with an apostrophe, as was common in poetry of previous centuries, (e.g. \"pwned\" becomes \"pwn'd\"). Sometimes, the apostrophe is removed as well (e.g. \"pwned\" becomes \"pwnd\"). The word ending may also be substituted by -t (e.g. pwned becomes pwnt).LeBlanc, 33.\n\n;Use of the -& suffix\nWords ending in -and, -anned, -ant, or a similar sound can sometimes be spelled with an ampersand (&) to express the ending sound (e.g. \"This is the s&box,\" \"I'm sorry, you've been b&\", \"&hill/&farm\"). This is most commonly used with the word banned. An alternate form of \"B&\" is \"B7\", as the ampersand is typed with the \"7\" key in the standard US keyboard layout.  It is often seen in the phrase \"IBB7\" (in before banned), which indicates that the poster believes that a previous poster will soon be banned from the site, channel, or board on which they are both posting.\n\nGrammar\n\nLeet can be pronounced as a single syllable,, rhyming with eat, by way of aphesis of the initial vowel of \"elite\". It may also be pronounced as two syllables,. Like hacker slang, leet enjoys a looser grammar than standard English. The loose grammar, just like loose spelling, encodes some level of emphasis, ironic or otherwise. A reader must rely more on intuitive parsing of leet to determine the meaning of a sentence rather than the actual sentence structure. In particular, speakers of leet are fond of verbing nouns, turning verbs into nouns (and back again) as forms of emphasis, e.g. \"Austin rocks\" is weaker than \"Austin roxxorz\" (note spelling), which is weaker than \"Au5t1N is t3h r0xx0rz\" (note grammar), which is weaker than something like \"0MFG D00D /\\Ü571N 15 T3H l_l83Я 1337 Я0XX0ЯZ\" (OMG, dude, Austin is the über-elite rocks-er!). In essence, all of these mean \"Austin rocks,\" not necessarily the other options. Added words and misspellings add to the speaker's enjoyment. Leet, like hacker slang, employs analogy in construction of new words. For example, if haxored is the past tense of the verb \"to hack\" (hack → haxor → haxored), then winzored would be easily understood to be the past tense conjugation of \"to win,\" even if the reader had not seen that particular word before.\n\nLeet has its own colloquialisms, many of which originated as jokes based on common typing errors, habits of new computer users, or knowledge of cyberculture and history.Blashki & Nichol, 81. Leet is not solely based upon one language or character set. Greek, Russian, and other languages have leet forms, and leet in one language may use characters from another where they are available. As such, while it may be referred to as a \"cipher\", a \"dialect\", or a \"language\", leet does not fit squarely into any of these categories. The term leet itself is often written 31337, or 1337, and many other variations. After the meaning of these became widely familiar, 10100111001 came to be used in its place, because it is the binary form of 1337 decimal, making it more of a puzzle to interpret.This appears as an in-joke for technical illustrations such as these: (a)(b) An increasingly common characteristic of leet is the changing of grammatical usage so as to be deliberately incorrect. The widespread popularity of deliberate misspelling is similar to the cult following of the \"All your base are belong to us\" phrase. Indeed, the online and computer communities have been international from their inception, so spellings and phrases typical of non-native speakers are quite common.\n\nVocabulary\n\nMany words originally derived from leet slang have now become part of the modern Internet slang, such as \"pwned\". The original driving forces of new vocabulary in leet were common misspellings and typing errors such as \"teh\" (generally considered lolspeak), and intentional misspellings,Blashki & Nichol, 83. especially the \"z\" at the end of words (\"skillz\"). Another prominent example of a surviving leet expression is w00t, an exclamation of joy. w00t is sometimes used as a backronym for \"We owned the other team.\"\n\nNew words (or corruptions thereof) may arise from a need to make one's username unique. As any given Internet service reaches more people, the number of names available to a given user is drastically reduced. While many users may wish to have the username \"CatLover,\" for example, in many cases it is only possible for one user to have the moniker. As such, degradations of the name may evolve, such as \"C@7L0vr.\" As the leet cipher is highly dynamic, there is a wider possibility for multiple users to share the \"same\" name, through combinations of spelling and transliterations.\n\nAdditionally, leet—the word itself—can be found in the screen-names and gamertags of many Internet and video games. Use of the term in such a manner announces a high level of skill, though such an announcement may be seen as baseless hubris.Computer Hope Dictionary. \n\nTerminology and common misspellings\n\nWarez (nominally) is a plural shortening of \"software\", typically referring to cracked and redistributed software. Phreaking refers to the hacking of telephone systems and other non-Internet equipment. Teh originated as a typographical error of \"the\", and is sometimes spelled t3h.LeBlanc, 34-35. j00 takes the place of \"you\", originating from the affricate sound that occurs in place of the palatal approximant,, when you follows a word ending in an alveolar plosive consonant, such as or. Also, from German, is über, which means \"over\" or \"above\"; it usually appears as a prefix attached to adjectives, and is frequently written without the umlaut over the u.Van de Velde & Meuleman.\n\nHaxor and suxxor (suxorz)\n\nHaxor, and derivations thereof, is leet for \"hacker\",LeBlanc, 30; 32. and it is one of the most commonplace examples of the use of the -xor suffix. Suxxor (pronounced suck-zor) is a derogatory term which originated in warez culture and is currently used in multi-user environments such as multiplayer video games and instant messaging; it, like haxor, is one of the early leet words to use the -xor suffix. Suxxor is a modified version of \"sucks\" (the phrase \"to suck\"), and the meaning is the same as the English slang. Its negative definition essentially makes it the opposite of roxxor, and both can be used as a verb or a noun. The letters ck are often replaced with the Greek Χ (chi) in other words as well.\n\nn00b\n\nWithin leet, the term n00b, and derivations thereof, is used extensively. The word means and derives from newbie (as in new and inexperienced or uninformed), and is used as a means of segregating them as less than the \"elite,\" or even \"normal,\" members of a group.\n\nOwned and pwned\n\nOwned and pwn3d (generally pronounced \"owned\" and \"poned\", respectively) both refer to the domination of a player in a video game or argument (rather than just a win), or the successful hacking of a website or computer.LeBlanc, 32-33.\n\nAs is a common characteristic of leet, the terms have also been adapted into noun and adjective forms, ownage and pwnage, which can refer to the situation of pwning or to the superiority of its subject (e.g., \"He is a very good player. He is pwnage.\").\n\nPr0n\n\nPr0n is slang for pornography. This is a deliberately inaccurate spelling/pronunciation for porn,The Acronym Finder. where a zero is often used to replace the letter O. It is sometimes used in legitimate communications (such as email discussion groups, Usenet, chat rooms, and Internet web pages) to circumvent language and content filters, which may reject messages as offensive or spam. The word also helps prevent search engines from associating commercial sites with pornography, which might result in unwelcome traffic. Pr0n is also sometimes spelled backwards (n0rp) to further obscure the meaning to potentially uninformed readers.This can be observed by searching for \"n0rp\" on a search engine. It can also refer to ASCII art depicting pornographic images, or to photos of the internals of consumer and industrial hardware. Prawn, a spoof of the misspelling, has started to come into use, as well; in Grand Theft Auto: Vice City, a pornographer films his movies on \"Prawn Island\". Conversely, in the RPG Kingdom of Loathing, prawn, referring to a kind of crustacean, is spelled pr0n, leading to the creation of food items such as \"pr0n chow mein\". Leet. http://en.wikipedia.org/?curid=18562."
  }
}
