{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5530",
  "eid" : "d59a2c20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778438114,
  "textBody" : "A conspiracy theory is an explanation of an event or situation that invokes an unwarranted conspiracy, generally one involving an illegal or harmful act carried out by government or other powerful actors. Conspiracy theories often produce hypotheses that contradict the prevailing understanding of history or simple facts. The term is often a derogatory one.Ayto, John (1999).20th Century Words. Oxford University Press, 15.\n\nAccording to the political scientist Michael Barkun, conspiracy theories rely on the view that the universe is governed by design, and embody three principles: nothing happens by accident, nothing is as it seems, and everything is connected. Another common feature is that conspiracy theories evolve to incorporate whatever evidence exists against them, so that they become, as Barkun writes, a closed system that is unfalsifiable, and therefore \"a matter of faith rather than proof\".\n\nEtymology \n\nThe Oxford English Dictionary defines conspiracy theory as \"the theory that an event or phenomenon occurs as a result of a conspiracy between interested parties; spec. a belief that some covert but influential agency (typically political in motivation and oppressive in intent) is responsible for an unexplained event\".  It cites a 1909 article in The American Historical Review as the earliest usage example,Oxford English Dictionary Second Edition on CD-ROM (v. 4.0), Oxford University Press, 2009, s.v. 4 [https://archive.org/stream/repealofmissouri01rayp/repealofmissouri01rayp_djvu.txt Full text.] although it also appears in journals as early as April 1870.\"Part IV. Psychological News\", The Journal of Mental Science, Volume 16, publ. Longman, Green, Longman & Roberts, 1871 ([https://books.google.co.uk/books?idVsRMAAAAYAAJ&dq\n%22conspiracy%20theory%22&pgPA141#v\nonepage&q%22conspiracy%20theory%22&f\nfalsepage 141])  The word \"conspiracy\" derives from the Latin con- (\"with, together\") and spirare (\"to breathe\").\n\nAccording to John Ayto, the phrase conspiracy theory was originally a neutral term and acquired a pejorative connotation only in the 1960s, with an implication that the theorist is paranoid. Lance deHaven-Smith has similarly suggested that the term was deployed in the 1960s by the Central Intelligence Agency (CIA) to discredit John F. Kennedy assassination conspiracy theories.deHaven-Smith, Lance (2013). [https://books.google.com/books?id\nTilCeCKDujQC&printsecfrontcover Conspiracy Theory in America], University of Texas Press  Robert Blaskiewicz rejects such claims, asserting instead that the term has always been derogatory and pointing to examples demonstrating that this has been so since the nineteenth century.\n\nExamples\n\nA conspiracy theory may take any matter as its subject, but certain subjects attract greater interest than others.  Favored subjects include famous deaths, government activities, new technologies, terrorism and questions of alien life.  Among the longest-standing and most widely recognized conspiracy theories are notions concerning the assassination of John F. Kennedy, the 1969 Apollo moon landings and the 9/11 terrorist attacks, as well as numerous theories pertaining to alleged plots for world domination by various groups both real and imaginary.\n\nPopularity\n\nSome scholars argue that conspiracy theories once limited to fringe audiences have become commonplace in mass media, contributing to conspiracism emerging as a cultural phenomenon in the United States of the late 20th and early 21st centuries. According to anthropologists Todd Sanders and Harry G. West, evidence suggests that a broad cross-section of Americans today gives credence to at least some conspiracy theories. Belief in conspiracy theories has therefore become a topic of interest for sociologists, psychologists and experts in folklore.\n\nConspiracy theories are widely present on the Web in the form of blogs and YouTube videos, as well as on social media.\nWhether the Web has increased the prevalence of conspiracy theories or not is an open research question.\nThe presence and representation of conspiracy theories in search engine results has been monitored and studied, showing significant variation across different topics, and a general absence of reputable, high-quality links in the results.\n\nTypes of conspiracy theory \n\nWalker's five kinds\n\nJesse Walker (2013) has identified five kinds of conspiracy theories:\n* The \"Enemy Outside\" refers to theories based on figures alleged to be scheming against a community from without.\n* The \"Enemy Within\" finds the conspirators lurking inside the nation, indistinguishable from ordinary citizens.\n* The \"Enemy Above\" involves powerful people manipulating events for their own gain.\n* The \"Enemy Below\" features the lower classes working to overturn the social order.\n* The \"Benevolent Conspiracies\" are angelic forces that work behind the scenes to improve the world and help people.Jesse Walker, The United States of Paranoia: A Conspiracy Theory (2013) [https://www.amazon.com/United-States-Paranoia-Conspiracy-Theory/dp/0062135554/ excerpt and text search]\n\nBarkun's three types\n\nBarkun has identified three classifications of conspiracy theory:\n* Event conspiracy theories.  This refers to limited and well-defined events.  Examples may include such conspiracies theories as those concerning the Kennedy assassination, 9/11, and the spread of AIDS.\n* Systemic conspiracy theories.  Such theories pertain to alleged broad objectives such as domination of a country or of the world.  According to Barkun, the conspiratorial machinery for such theories is usually simple, with a single evil organization.  Examples may include conspiracy theories about Jews, Freemasons, Communism, or the Catholic Church.\n* Superconspiracy theories. For Barkun, such theories link multiple alleged conspiracies together hierarchically.  At the summit is a distant but all-powerful evil force.  His cited examples are the ideas of David Icke and Milton William Cooper.\n\nRothbard: shallow vs. deep \n\nMurray Rothbard argues in favor of a model that contrasts \"deep\" conspiracy theories to \"shallow\" ones. According to Rothbard, a \"shallow\" theorist observes an event and asks Cui bono? (\"Who benefits?\"), jumping to the conclusion that a posited beneficiary is responsible for covertly influencing events.  On the other hand, the \"deep\" conspiracy theorist begins with a hunch, and then seeks out evidence. Rothbard describes this latter activity as a matter of confirming with certain facts one's initial paranoia.As quoted by B.K. Marcus in \"[https://mises.org/journals/jls/20_2/20_2_2.pdf Radio Free Rothbard],\" Journal of Libertarian Studies, Vol 20, No 2. (SPRING 2006): pp 17–51. Retrieved 16 May 2013.\n\nEvidence vs. conspiracy theory\n\nTheories involving multiple conspirators that are proven to be correct, such as the Watergate scandal, are usually referred to as \"investigative journalism\" or \"historical analysis\" rather than conspiracy theory. By contrast, the term \"Watergate conspiracy theory\" is used to refer to a variety of hypotheses in which those convicted in the conspiracy were in fact the victims of a deeper conspiracy.\n\nNoam Chomsky contrasts conspiracy theory to institutional analysis which focuses mostly on the public, long-term behavior of publicly known institutions, as recorded in, for example, scholarly documents or mainstream media reports. Conspiracy theory conversely posits the existence of secretive coalitions of individuals and speculates on their alleged activities.\n\nClare Birchall at King's College London describes conspiracy theory as a \"form of popular knowledge or interpretation\". The use of the word 'knowledge' here suggests ways in which conspiracy theory may be considered in relation to legitimate modes of knowing. The relationship between legitimate and illegitimate knowledge, Birchall claims, is closer than common dismissals of conspiracy theory contend.\n\n Conspiracism as a world view \n\nThe historian Richard Hofstadter addressed the role of paranoia and conspiracism throughout American history in his 1964 essay \"The Paranoid Style in American Politics\". Bernard Bailyn's classic The Ideological Origins of the American Revolution (1967) notes that a similar phenomenon could be found in America during the time preceding the American Revolution. Conspiracism labels people's attitudes as well as the type of conspiracy theories that are more global and historical in proportion.\n\nThe term \"conspiracism\" was further popularized by academic Frank P. Mintz in the 1980s. According to Mintz, conspiracism denotes \"belief in the primacy of conspiracies in the unfolding of history\":\n\nConspiracism serves the needs of diverse political and social groups in America and elsewhere. It identifies elites, blames them for economic and social catastrophes, and assumes that things will be better once popular action can remove them from positions of power. As such, conspiracy theories do not typify a particular epoch or ideology.\n\nJustin Fox of Time magazine has noted that Wall Street traders are among the most conspiracy-minded group of people, and ascribes this to the reality of some financial market conspiracies, and to the ability of conspiracy theories to provide necessary orientation in the market's day-to-day movements. According to Fox, most good investigative reporters are also conspiracy theorists.\n\nUnited States \n\nHarry G. West and others have noted that while conspiracy theorists may often be dismissed as a fringe minority, certain evidence suggests that a wide range of the American population maintains a belief in conspiracy theories. West also compares those theories to hypernationalism and religious fundamentalism.Shermer, Michael, and Pat Linse.  Conspiracy Theories.  Altadena, CA: Skeptics Society, n.d.  Print.\n\nNumerous authors have suggested that conspiracy theory maintains considerable popularity in America due to a history of a number of prominent verified conspiracies.Jewett, Robert; John Shelton Lawrence (2004) Captain America and the crusade against evil: the dilemma of zealous nationalism Wm. B. Eerdmans Publishing p. 206.Olmsted, Kathryn S. (2011) Real Enemies: Conspiracy Theories and American Democracy, World War I to 9/11 Oxford University Press p. 8.Whitfield, Stephen J. (2004) A companion to 20th-century America Wiley-Blackwell  p. 136.\n\nMiddle East\n\nMatthew Gray has noted that conspiracy theories are a prevalent feature of Arab culture and politics. Variants include conspiracies involving colonialism, Zionism, superpowers, oil, and the war on terrorism, which may be referred to as a War against Islam. For example,  The Protocols of the Elders of Zion, an infamous hoax document purporting to be a Jewish plan for world domination, is commonly read and promoted in the Muslim world. Report by Center for Religious Freedom of Freedom House. 2006[https://www.wsj.com/news/articles/SB113046423225782130 \"The Booksellers of Tehran\"], The Wall Street Journal, 28 October 2005 Roger Cohen has suggested that the popularity of conspiracy theories in the Arab world is \"the ultimate refuge of the powerless\".  Al-Mumin Said has noted the danger of such theories, for they \"keep us not only from the truth but also from confronting our faults and problems\".\n\nPsychological interpretations \n\nThe widespread belief in conspiracy theories has become a topic of interest for sociologists, psychologists, and experts in folklore since at least the 1960s, when a number of conspiracy theories arose regarding the assassination of U.S. President John F. Kennedy. Sociologist Türkay Salim Nefes underlines the political nature of conspiracy theories. He suggests that one of the most important characteristics of these accounts is their attempt to unveil the \"real but hidden\" power relations in social groups.\n\nThe attractions of conspiracy theory\n\nThe political scientist Michael Barkun, discussing the usage of \"conspiracy theory\" in contemporary American culture, holds that this term is used for a belief that explains an event as the result of a secret plot by exceptionally powerful and cunning conspirators to achieve a malevolent end. According to Barkun, the appeal of conspiracism is threefold:\n\n* \"First, conspiracy theories claim to explain what institutional analysis cannot. They appear to make sense out of a world that is otherwise confusing. \n* Second, they do so in an appealingly simple way, by dividing the world sharply between the forces of light, and the forces of darkness. They trace all evil back to a single source, the conspirators and their agents. \n* Third, conspiracy theories are often presented as special, secret knowledge unknown or unappreciated by others. For conspiracy theorists, the masses are a brainwashed herd, while the conspiracy theorists in the know can congratulate themselves on penetrating the plotters' deceptions.\"\n\nHumanistic psychologists argue that even if a posited cabal behind an alleged conspiracy is almost always perceived as hostile, there often remains an element of reassurance for theorists. This is because it is a consolation to imagine that difficulties in human affairs are created by humans, and remain within human control.  If a cabal can be implicated, there may be a hope of breaking its power or of joining it.  Belief in the power of a cabal is an implicit assertion of human dignity — an unconscious affirmation that man is responsible for his own destiny.\n\nPeople formulate conspiracy theories to explain, for example, power relations in social groups and the perceived existence of evil forces.  Proposed psychological origins of conspiracy theorising include projection; the personal need to explain \"a significant event [with] a significant cause;\" and the product of various kinds and stages of thought disorder, such as paranoid disposition, ranging in severity to diagnosable mental illnesses. Some people prefer socio-political explanations over the insecurity of encountering random, unpredictable, or otherwise inexplicable events.Justin Fox: [http://business.time.com/2009/10/01/wall-streeters-like-conspiracy-theories-always-have/ \"Wall Streeters like conspiracy theories. Always have\"], Time, 1 October 2009.\n\nAccording to Berlet and Lyons, \"Conspiracism is a particular narrative form of scapegoating that frames demonized enemies as part of a vast insidious plot against the common good, while it valorizes the scapegoater as a hero for sounding the alarm\".\n\nPsychological origins\n\nSome psychologists believe that a search for meaning is common in conspiracism. Once cognized, confirmation bias and avoidance of cognitive dissonance may reinforce the belief. In a context where a conspiracy theory has become popular within a social group, communal reinforcement may equally play a part. Research carried out at the University of Kent suggested people may be influenced by conspiracy theories without being aware that their attitudes have changed. After reading popular conspiracy theories about the death of Princess Diana, participants in the study correctly estimated how much their peers' attitudes had changed, but significantly underestimated how much their own attitudes had grown to favor conspiracy theories.\n\nA study published in 2012 also found that conspiracy theorists frequently believe in multiple conspiracies, even when one conspiracy contradicts the other. For example, the study found that people who believe Osama Bin Laden was captured alive by Americans are also likely to believe that Bin Laden was actually killed prior to the 2011 raid on his home in Pakistan.\n\nIn a 2013 article in Scientific American Mind, psychologist Sander van der Linden argues there is converging scientific evidence that (1) people who believe in one conspiracy are likely to espouse others (even when contradictory); (2) in some cases, conspiracy ideation has been associated with paranoia and schizotypy; (3) conspiracist worldviews tend to breed mistrust of well-established scientific principles, such as the association between smoking and cancer or global warming and CO2 emissions; and (4) conspiracy ideation often leads people to see patterns where none exist. &  Van der Linden also coined the term \"Conspiracy effect\".\n\nProjection\n\nSome historians have argued that there is an element of psychological projection in conspiracism. This projection, according to the argument, is manifested in the form of attribution of undesirable characteristics of the self to the conspirators. Historian Richard Hofstadter stated that:\n\n... it is hard to resist the conclusion that this enemy is on many counts the projection of the self; both the ideal and the unacceptable aspects of the self are attributed to him. The enemy may be the cosmopolitan intellectual, but the paranoid will outdo him in the apparatus of scholarship ... the Ku Klux Klan imitated Catholicism to the point of donning priestly vestments, developing an elaborate ritual and an equally elaborate hierarchy. The John Birch Society emulates Communist cells and quasi-secret operation through \"front\" groups, and preaches a ruthless prosecution of the ideological war along lines very similar to those it finds in the Communist enemy. Spokesmen of the various fundamentalist anti-Communist \"crusades\" openly express their admiration for the dedication and discipline the Communist cause calls forth.\n\nHofstadter also noted that \"sexual freedom\" is a vice frequently attributed to the conspiracist's target group, noting that \"very often the fantasies of true believers reveal strong sadomasochistic outlets, vividly expressed, for example, in the delight of anti-Masons with the cruelty of Masonic punishments.\"\n &   A 2011 study found that highly Machiavellian people are more likely to believe in conspiracy theories, since they themselves would be more willing to engage in a conspiracy when placed in the same situation as the alleged conspirators.\n\nEpistemic bias\n\nAccording to the British Psychological Society, it is possible that certain basic human epistemic biases are projected onto the material under scrutiny. One study cited by the group found that humans apply a rule of thumb by which we expect a significant event to have a significant cause.\"[http://www.bps.org.uk/media-centre/press-releases/releases$/annual-conferences-1999-2004/who-shot-the-president$.cfm Who shot the president?] ,\" The British Psychological Society, 18 March 2003. Retrieved 7 June 2005. The study offered subjects four versions of events, in which a foreign president (a) was successfully assassinated, (b) was wounded but survived, (c) survived with wounds but died of a heart attack at a later date, and (d) was unharmed. Subjects were significantly more likely to suspect conspiracy in the case of the major events—in which the president died—than in the other cases, despite all other evidence available to them being equal. Connected with apophenia, the genetic tendency of human beings to find patterns in coincidence, this allows the discovery of conspiracy in any significant event.\n\nClinical psychology\n\nFor some individuals, an obsessive compulsion to believe, prove, or re-tell a conspiracy theory may indicate one or a combination of well-understood psychological conditions, and other hypothetical ones: paranoia, denial, schizophrenia, mean world syndrome., The New Disease: A Journal of Narrative Pathology 2 (2004). Retrieved 7 June 2005. Quote: \"for relatively rare individuals, an obsessive compulsion to believe, prove or re-tell a conspiracy theory may indicate one or more of several well-understood psychological conditions, and other hypothetical ones: paranoia, denial, schizophrenia, and mean world syndrome.\" apud Lance Boyle [http://westminsterjournal.com/oldwjarchive/index2.php?optioncom_content&do_pdf\n1&id=54 Truthers: the Mental Health Headache], The Westminster Journal, 27 December 2007.\n\nSociological interpretations\n\nChristopher Hitchens described conspiracy theory as the \"exhaust fumes of democracy\": the unavoidable result of a large amount of information circulating among a large number of people.\n\nConspiracy theories may be emotionally satisfying, by assigning blame to a group to which the theorist does not belong and so absolving the theorist of moral or political responsibility in society. Sociologist Theodore Sasson has remarked, \"Conspiracy theories explain disturbing events or social phenomena in terms of the actions of specific, powerful individuals\". By providing simple explanations of distressing events—the conspiracy theory in the Arab world, for example, that the September 11 attacks were planned by the Israeli Mossad—they deflect responsibility or keep people from acknowledging that tragic events sometimes happen inexplicably.\" Likewise, Roger Cohen writing for The New York Times has said that, \"captive minds; ... resort to conspiracy theory because it is the ultimate refuge of the powerless. If you cannot change your own life, it must be that some greater force controls the world.\"\n\nSociological historian Holger Herwig found in studying German explanations for the origins of World War I, \"Those events that are most important are hardest to understand, because they attract the greatest attention from myth makers and charlatans.\"\n\nInfluence of critical theory\n\nFrench sociologist Bruno Latour suggests that the widespread popularity of conspiracy theories in mass culture may be due, in part, to the pervasive presence of Marxist-inspired critical theory and similar ideas in academia since the 1970s.\n\nLatour notes that about 90% of contemporary social criticism in academia displays one of two approaches, which he terms \"the fact position and the fairy position\". The fact position is anti-fetishist, arguing that \"objects of belief\" (e.g., religion, arts) are merely concepts onto which power is projected; Latour contends that those who use this approach show biases towards confirming their own dogmatic suspicions as most \"scientifically supported\". While the complete facts of the situation and correct methodology are ostensibly important to them, Latour proposes that the scientific process is instead laid on as a patina to one's pet theories to lend a sort of reputation high ground. The \"fairy position\" argues that individuals are dominated, often covertly and without their awareness, by external forces (e.g., economics, gender). Latour concludes that each of these two approaches in Academia has led to a polarized, inefficient atmosphere highlighted (in both approaches) by its causticness. \"Do you see now why it feels so good to be a critical mind?\" asks Latour: no matter which position you take, \"You're always right!\"\n\nLatour notes that such social criticism has been appropriated by those he describes as conspiracy theorists, including climate change denialists and the 9/11 Truth movement: \"Maybe I am taking conspiracy theories too seriously, but I am worried to detect, in those mad mixtures of knee-jerk disbelief, punctilious demands for proofs, and free use of powerful explanation from the social neverland, many of the weapons of social critique.\"\n\nFusion paranoia\n\nMichael Kelly, a Washington Post journalist and critic of anti-war movements on both the left and right, coined the term \"fusion paranoia\" to refer to a political convergence of left-wing and right-wing activists around anti-war issues and civil liberties, which he said were motivated by a shared belief in conspiracism or shared anti-government views.\n\nBarkun has adopted this term to refer to how the synthesis of paranoid conspiracy theories, which were once limited to American fringe audiences, has given them mass appeal and enabled them to become commonplace in mass media, thereby inaugurating an unrivaled period of people actively preparing for apocalyptic or millenarian scenarios in the United States of the late 20th and early 21st centuries. Barkun notes the occurrence of lone-wolf conflicts with law enforcement acting as proxy for threatening the established political powers.\n\nViability of conspiracies\n\nThe physicist David Robert Grimes published in the PLOS ONE journal an estimation of the time it would take for a conspiracy to be exposed, based on the number of people involved.  \nHis calculations used data from verified events such as The National Security Agency (NSA) PRISM affair, Tuskegee Syphilis Experiment and the FBI forensic scandal.\n\n* Moon landing hoax would require the involvement of 411,000 people and would be exposed within 3.68 years;\n* Climate-change fraud would require 405,000 people and would be exposed within 3.70 years;\n* Vaccination conspiracy would require a minimum of 22,000 people (without drug companies) and would be exposed within at least 3.15 years and at most 34.78 years depending on the number involved;\n* Suppressed cancer cure conspiracy would require 714,000 people and would be exposed within 3.17 years.\n\nPolitical use\n\nIn his book The Open Society and Its Enemies, the philosopher Karl Popper used the term \"conspiracy theory\" to criticize the ideologies driving historicism. Popper argued that totalitarianism was founded on \"conspiracy theories\" which drew on imaginary plots driven by paranoid scenarios predicated on tribalism, chauvinism, or racism.  Popper acknowledged that genuine conspiracies do exist, but noted how infrequently conspirators have been able to achieve their goal.\n\nThe historian Bruce Cumings similarly rejects the notion that history is controlled by conspiracies, stating that where real conspiracies have appeared they have usually had little effect on history and have had unforeseen consequences for the conspirators.  Cumings concludes that history is instead \"moved by the broad forces and large structures of human collectivities\".\n\nIn a 2009 article, the legal scholars Cass Sunstein and Adrian Vermeule considered a number of possible government responses to conspiracy theories, including censorship and taxation, and concluding that the authorities ought to engage in counter-speech and dialogue, which they termed \"cognitive infiltration\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Conspiracy theory" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5530" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A conspiracy theory is an explanation of an event or situation that invokes an unwarranted conspiracy, generally one involving an illegal or harmful act carried out by government or other powerful actors. Conspiracy theories often produce hypotheses that contradict the prevailing understanding of history or simple facts. The term is often a derogatory one.Ayto, John (1999).20th Century Words. Oxford University Press, 15.\n\nAccording to the political scientist Michael Barkun, conspiracy theories rely on the view that the universe is governed by design, and embody three principles: nothing happens by accident, nothing is as it seems, and everything is connected. Another common feature is that conspiracy theories evolve to incorporate whatever evidence exists against them, so that they become, as Barkun writes, a closed system that is unfalsifiable, and therefore \"a matter of faith rather than proof\".\n\nEtymology \n\nThe Oxford English Dictionary defines conspiracy theory as \"the theory that an event or phenomenon occurs as a result of a conspiracy between interested parties; spec. a belief that some covert but influential agency (typically political in motivation and oppressive in intent) is responsible for an unexplained event\".  It cites a 1909 article in The American Historical Review as the earliest usage example,Oxford English Dictionary Second Edition on CD-ROM (v. 4.0), Oxford University Press, 2009, s.v. 4 [https://archive.org/stream/repealofmissouri01rayp/repealofmissouri01rayp_djvu.txt Full text.] although it also appears in journals as early as April 1870.\"Part IV. Psychological News\", The Journal of Mental Science, Volume 16, publ. Longman, Green, Longman & Roberts, 1871 ([https://books.google.co.uk/books?idVsRMAAAAYAAJ&dq\n%22conspiracy%20theory%22&pgPA141#v\nonepage&q%22conspiracy%20theory%22&f\nfalsepage 141])  The word \"conspiracy\" derives from the Latin con- (\"with, together\") and spirare (\"to breathe\").\n\nAccording to John Ayto, the phrase conspiracy theory was originally a neutral term and acquired a pejorative connotation only in the 1960s, with an implication that the theorist is paranoid. Lance deHaven-Smith has similarly suggested that the term was deployed in the 1960s by the Central Intelligence Agency (CIA) to discredit John F. Kennedy assassination conspiracy theories.deHaven-Smith, Lance (2013). [https://books.google.com/books?id\nTilCeCKDujQC&printsecfrontcover Conspiracy Theory in America], University of Texas Press  Robert Blaskiewicz rejects such claims, asserting instead that the term has always been derogatory and pointing to examples demonstrating that this has been so since the nineteenth century.\n\nExamples\n\nA conspiracy theory may take any matter as its subject, but certain subjects attract greater interest than others.  Favored subjects include famous deaths, government activities, new technologies, terrorism and questions of alien life.  Among the longest-standing and most widely recognized conspiracy theories are notions concerning the assassination of John F. Kennedy, the 1969 Apollo moon landings and the 9/11 terrorist attacks, as well as numerous theories pertaining to alleged plots for world domination by various groups both real and imaginary.\n\nPopularity\n\nSome scholars argue that conspiracy theories once limited to fringe audiences have become commonplace in mass media, contributing to conspiracism emerging as a cultural phenomenon in the United States of the late 20th and early 21st centuries. According to anthropologists Todd Sanders and Harry G. West, evidence suggests that a broad cross-section of Americans today gives credence to at least some conspiracy theories. Belief in conspiracy theories has therefore become a topic of interest for sociologists, psychologists and experts in folklore.\n\nConspiracy theories are widely present on the Web in the form of blogs and YouTube videos, as well as on social media.\nWhether the Web has increased the prevalence of conspiracy theories or not is an open research question.\nThe presence and representation of conspiracy theories in search engine results has been monitored and studied, showing significant variation across different topics, and a general absence of reputable, high-quality links in the results.\n\nTypes of conspiracy theory \n\nWalker's five kinds\n\nJesse Walker (2013) has identified five kinds of conspiracy theories:\n* The \"Enemy Outside\" refers to theories based on figures alleged to be scheming against a community from without.\n* The \"Enemy Within\" finds the conspirators lurking inside the nation, indistinguishable from ordinary citizens.\n* The \"Enemy Above\" involves powerful people manipulating events for their own gain.\n* The \"Enemy Below\" features the lower classes working to overturn the social order.\n* The \"Benevolent Conspiracies\" are angelic forces that work behind the scenes to improve the world and help people.Jesse Walker, The United States of Paranoia: A Conspiracy Theory (2013) [https://www.amazon.com/United-States-Paranoia-Conspiracy-Theory/dp/0062135554/ excerpt and text search]\n\nBarkun's three types\n\nBarkun has identified three classifications of conspiracy theory:\n* Event conspiracy theories.  This refers to limited and well-defined events.  Examples may include such conspiracies theories as those concerning the Kennedy assassination, 9/11, and the spread of AIDS.\n* Systemic conspiracy theories.  Such theories pertain to alleged broad objectives such as domination of a country or of the world.  According to Barkun, the conspiratorial machinery for such theories is usually simple, with a single evil organization.  Examples may include conspiracy theories about Jews, Freemasons, Communism, or the Catholic Church.\n* Superconspiracy theories. For Barkun, such theories link multiple alleged conspiracies together hierarchically.  At the summit is a distant but all-powerful evil force.  His cited examples are the ideas of David Icke and Milton William Cooper.\n\nRothbard: shallow vs. deep \n\nMurray Rothbard argues in favor of a model that contrasts \"deep\" conspiracy theories to \"shallow\" ones. According to Rothbard, a \"shallow\" theorist observes an event and asks Cui bono? (\"Who benefits?\"), jumping to the conclusion that a posited beneficiary is responsible for covertly influencing events.  On the other hand, the \"deep\" conspiracy theorist begins with a hunch, and then seeks out evidence. Rothbard describes this latter activity as a matter of confirming with certain facts one's initial paranoia.As quoted by B.K. Marcus in \"[https://mises.org/journals/jls/20_2/20_2_2.pdf Radio Free Rothbard],\" Journal of Libertarian Studies, Vol 20, No 2. (SPRING 2006): pp 17–51. Retrieved 16 May 2013.\n\nEvidence vs. conspiracy theory\n\nTheories involving multiple conspirators that are proven to be correct, such as the Watergate scandal, are usually referred to as \"investigative journalism\" or \"historical analysis\" rather than conspiracy theory. By contrast, the term \"Watergate conspiracy theory\" is used to refer to a variety of hypotheses in which those convicted in the conspiracy were in fact the victims of a deeper conspiracy.\n\nNoam Chomsky contrasts conspiracy theory to institutional analysis which focuses mostly on the public, long-term behavior of publicly known institutions, as recorded in, for example, scholarly documents or mainstream media reports. Conspiracy theory conversely posits the existence of secretive coalitions of individuals and speculates on their alleged activities.\n\nClare Birchall at King's College London describes conspiracy theory as a \"form of popular knowledge or interpretation\". The use of the word 'knowledge' here suggests ways in which conspiracy theory may be considered in relation to legitimate modes of knowing. The relationship between legitimate and illegitimate knowledge, Birchall claims, is closer than common dismissals of conspiracy theory contend.\n\n Conspiracism as a world view \n\nThe historian Richard Hofstadter addressed the role of paranoia and conspiracism throughout American history in his 1964 essay \"The Paranoid Style in American Politics\". Bernard Bailyn's classic The Ideological Origins of the American Revolution (1967) notes that a similar phenomenon could be found in America during the time preceding the American Revolution. Conspiracism labels people's attitudes as well as the type of conspiracy theories that are more global and historical in proportion.\n\nThe term \"conspiracism\" was further popularized by academic Frank P. Mintz in the 1980s. According to Mintz, conspiracism denotes \"belief in the primacy of conspiracies in the unfolding of history\":\n\nConspiracism serves the needs of diverse political and social groups in America and elsewhere. It identifies elites, blames them for economic and social catastrophes, and assumes that things will be better once popular action can remove them from positions of power. As such, conspiracy theories do not typify a particular epoch or ideology.\n\nJustin Fox of Time magazine has noted that Wall Street traders are among the most conspiracy-minded group of people, and ascribes this to the reality of some financial market conspiracies, and to the ability of conspiracy theories to provide necessary orientation in the market's day-to-day movements. According to Fox, most good investigative reporters are also conspiracy theorists.\n\nUnited States \n\nHarry G. West and others have noted that while conspiracy theorists may often be dismissed as a fringe minority, certain evidence suggests that a wide range of the American population maintains a belief in conspiracy theories. West also compares those theories to hypernationalism and religious fundamentalism.Shermer, Michael, and Pat Linse.  Conspiracy Theories.  Altadena, CA: Skeptics Society, n.d.  Print.\n\nNumerous authors have suggested that conspiracy theory maintains considerable popularity in America due to a history of a number of prominent verified conspiracies.Jewett, Robert; John Shelton Lawrence (2004) Captain America and the crusade against evil: the dilemma of zealous nationalism Wm. B. Eerdmans Publishing p. 206.Olmsted, Kathryn S. (2011) Real Enemies: Conspiracy Theories and American Democracy, World War I to 9/11 Oxford University Press p. 8.Whitfield, Stephen J. (2004) A companion to 20th-century America Wiley-Blackwell  p. 136.\n\nMiddle East\n\nMatthew Gray has noted that conspiracy theories are a prevalent feature of Arab culture and politics. Variants include conspiracies involving colonialism, Zionism, superpowers, oil, and the war on terrorism, which may be referred to as a War against Islam. For example,  The Protocols of the Elders of Zion, an infamous hoax document purporting to be a Jewish plan for world domination, is commonly read and promoted in the Muslim world. Report by Center for Religious Freedom of Freedom House. 2006[https://www.wsj.com/news/articles/SB113046423225782130 \"The Booksellers of Tehran\"], The Wall Street Journal, 28 October 2005 Roger Cohen has suggested that the popularity of conspiracy theories in the Arab world is \"the ultimate refuge of the powerless\".  Al-Mumin Said has noted the danger of such theories, for they \"keep us not only from the truth but also from confronting our faults and problems\".\n\nPsychological interpretations \n\nThe widespread belief in conspiracy theories has become a topic of interest for sociologists, psychologists, and experts in folklore since at least the 1960s, when a number of conspiracy theories arose regarding the assassination of U.S. President John F. Kennedy. Sociologist Türkay Salim Nefes underlines the political nature of conspiracy theories. He suggests that one of the most important characteristics of these accounts is their attempt to unveil the \"real but hidden\" power relations in social groups.\n\nThe attractions of conspiracy theory\n\nThe political scientist Michael Barkun, discussing the usage of \"conspiracy theory\" in contemporary American culture, holds that this term is used for a belief that explains an event as the result of a secret plot by exceptionally powerful and cunning conspirators to achieve a malevolent end. According to Barkun, the appeal of conspiracism is threefold:\n\n* \"First, conspiracy theories claim to explain what institutional analysis cannot. They appear to make sense out of a world that is otherwise confusing. \n* Second, they do so in an appealingly simple way, by dividing the world sharply between the forces of light, and the forces of darkness. They trace all evil back to a single source, the conspirators and their agents. \n* Third, conspiracy theories are often presented as special, secret knowledge unknown or unappreciated by others. For conspiracy theorists, the masses are a brainwashed herd, while the conspiracy theorists in the know can congratulate themselves on penetrating the plotters' deceptions.\"\n\nHumanistic psychologists argue that even if a posited cabal behind an alleged conspiracy is almost always perceived as hostile, there often remains an element of reassurance for theorists. This is because it is a consolation to imagine that difficulties in human affairs are created by humans, and remain within human control.  If a cabal can be implicated, there may be a hope of breaking its power or of joining it.  Belief in the power of a cabal is an implicit assertion of human dignity — an unconscious affirmation that man is responsible for his own destiny.\n\nPeople formulate conspiracy theories to explain, for example, power relations in social groups and the perceived existence of evil forces.  Proposed psychological origins of conspiracy theorising include projection; the personal need to explain \"a significant event [with] a significant cause;\" and the product of various kinds and stages of thought disorder, such as paranoid disposition, ranging in severity to diagnosable mental illnesses. Some people prefer socio-political explanations over the insecurity of encountering random, unpredictable, or otherwise inexplicable events.Justin Fox: [http://business.time.com/2009/10/01/wall-streeters-like-conspiracy-theories-always-have/ \"Wall Streeters like conspiracy theories. Always have\"], Time, 1 October 2009.\n\nAccording to Berlet and Lyons, \"Conspiracism is a particular narrative form of scapegoating that frames demonized enemies as part of a vast insidious plot against the common good, while it valorizes the scapegoater as a hero for sounding the alarm\".\n\nPsychological origins\n\nSome psychologists believe that a search for meaning is common in conspiracism. Once cognized, confirmation bias and avoidance of cognitive dissonance may reinforce the belief. In a context where a conspiracy theory has become popular within a social group, communal reinforcement may equally play a part. Research carried out at the University of Kent suggested people may be influenced by conspiracy theories without being aware that their attitudes have changed. After reading popular conspiracy theories about the death of Princess Diana, participants in the study correctly estimated how much their peers' attitudes had changed, but significantly underestimated how much their own attitudes had grown to favor conspiracy theories.\n\nA study published in 2012 also found that conspiracy theorists frequently believe in multiple conspiracies, even when one conspiracy contradicts the other. For example, the study found that people who believe Osama Bin Laden was captured alive by Americans are also likely to believe that Bin Laden was actually killed prior to the 2011 raid on his home in Pakistan.\n\nIn a 2013 article in Scientific American Mind, psychologist Sander van der Linden argues there is converging scientific evidence that (1) people who believe in one conspiracy are likely to espouse others (even when contradictory); (2) in some cases, conspiracy ideation has been associated with paranoia and schizotypy; (3) conspiracist worldviews tend to breed mistrust of well-established scientific principles, such as the association between smoking and cancer or global warming and CO2 emissions; and (4) conspiracy ideation often leads people to see patterns where none exist. &  Van der Linden also coined the term \"Conspiracy effect\".\n\nProjection\n\nSome historians have argued that there is an element of psychological projection in conspiracism. This projection, according to the argument, is manifested in the form of attribution of undesirable characteristics of the self to the conspirators. Historian Richard Hofstadter stated that:\n\n... it is hard to resist the conclusion that this enemy is on many counts the projection of the self; both the ideal and the unacceptable aspects of the self are attributed to him. The enemy may be the cosmopolitan intellectual, but the paranoid will outdo him in the apparatus of scholarship ... the Ku Klux Klan imitated Catholicism to the point of donning priestly vestments, developing an elaborate ritual and an equally elaborate hierarchy. The John Birch Society emulates Communist cells and quasi-secret operation through \"front\" groups, and preaches a ruthless prosecution of the ideological war along lines very similar to those it finds in the Communist enemy. Spokesmen of the various fundamentalist anti-Communist \"crusades\" openly express their admiration for the dedication and discipline the Communist cause calls forth.\n\nHofstadter also noted that \"sexual freedom\" is a vice frequently attributed to the conspiracist's target group, noting that \"very often the fantasies of true believers reveal strong sadomasochistic outlets, vividly expressed, for example, in the delight of anti-Masons with the cruelty of Masonic punishments.\"\n &   A 2011 study found that highly Machiavellian people are more likely to believe in conspiracy theories, since they themselves would be more willing to engage in a conspiracy when placed in the same situation as the alleged conspirators.\n\nEpistemic bias\n\nAccording to the British Psychological Society, it is possible that certain basic human epistemic biases are projected onto the material under scrutiny. One study cited by the group found that humans apply a rule of thumb by which we expect a significant event to have a significant cause.\"[http://www.bps.org.uk/media-centre/press-releases/releases$/annual-conferences-1999-2004/who-shot-the-president$.cfm Who shot the president?] ,\" The British Psychological Society, 18 March 2003. Retrieved 7 June 2005. The study offered subjects four versions of events, in which a foreign president (a) was successfully assassinated, (b) was wounded but survived, (c) survived with wounds but died of a heart attack at a later date, and (d) was unharmed. Subjects were significantly more likely to suspect conspiracy in the case of the major events—in which the president died—than in the other cases, despite all other evidence available to them being equal. Connected with apophenia, the genetic tendency of human beings to find patterns in coincidence, this allows the discovery of conspiracy in any significant event.\n\nClinical psychology\n\nFor some individuals, an obsessive compulsion to believe, prove, or re-tell a conspiracy theory may indicate one or a combination of well-understood psychological conditions, and other hypothetical ones: paranoia, denial, schizophrenia, mean world syndrome., The New Disease: A Journal of Narrative Pathology 2 (2004). Retrieved 7 June 2005. Quote: \"for relatively rare individuals, an obsessive compulsion to believe, prove or re-tell a conspiracy theory may indicate one or more of several well-understood psychological conditions, and other hypothetical ones: paranoia, denial, schizophrenia, and mean world syndrome.\" apud Lance Boyle [http://westminsterjournal.com/oldwjarchive/index2.php?optioncom_content&do_pdf\n1&id=54 Truthers: the Mental Health Headache], The Westminster Journal, 27 December 2007.\n\nSociological interpretations\n\nChristopher Hitchens described conspiracy theory as the \"exhaust fumes of democracy\": the unavoidable result of a large amount of information circulating among a large number of people.\n\nConspiracy theories may be emotionally satisfying, by assigning blame to a group to which the theorist does not belong and so absolving the theorist of moral or political responsibility in society. Sociologist Theodore Sasson has remarked, \"Conspiracy theories explain disturbing events or social phenomena in terms of the actions of specific, powerful individuals\". By providing simple explanations of distressing events—the conspiracy theory in the Arab world, for example, that the September 11 attacks were planned by the Israeli Mossad—they deflect responsibility or keep people from acknowledging that tragic events sometimes happen inexplicably.\" Likewise, Roger Cohen writing for The New York Times has said that, \"captive minds; ... resort to conspiracy theory because it is the ultimate refuge of the powerless. If you cannot change your own life, it must be that some greater force controls the world.\"\n\nSociological historian Holger Herwig found in studying German explanations for the origins of World War I, \"Those events that are most important are hardest to understand, because they attract the greatest attention from myth makers and charlatans.\"\n\nInfluence of critical theory\n\nFrench sociologist Bruno Latour suggests that the widespread popularity of conspiracy theories in mass culture may be due, in part, to the pervasive presence of Marxist-inspired critical theory and similar ideas in academia since the 1970s.\n\nLatour notes that about 90% of contemporary social criticism in academia displays one of two approaches, which he terms \"the fact position and the fairy position\". The fact position is anti-fetishist, arguing that \"objects of belief\" (e.g., religion, arts) are merely concepts onto which power is projected; Latour contends that those who use this approach show biases towards confirming their own dogmatic suspicions as most \"scientifically supported\". While the complete facts of the situation and correct methodology are ostensibly important to them, Latour proposes that the scientific process is instead laid on as a patina to one's pet theories to lend a sort of reputation high ground. The \"fairy position\" argues that individuals are dominated, often covertly and without their awareness, by external forces (e.g., economics, gender). Latour concludes that each of these two approaches in Academia has led to a polarized, inefficient atmosphere highlighted (in both approaches) by its causticness. \"Do you see now why it feels so good to be a critical mind?\" asks Latour: no matter which position you take, \"You're always right!\"\n\nLatour notes that such social criticism has been appropriated by those he describes as conspiracy theorists, including climate change denialists and the 9/11 Truth movement: \"Maybe I am taking conspiracy theories too seriously, but I am worried to detect, in those mad mixtures of knee-jerk disbelief, punctilious demands for proofs, and free use of powerful explanation from the social neverland, many of the weapons of social critique.\"\n\nFusion paranoia\n\nMichael Kelly, a Washington Post journalist and critic of anti-war movements on both the left and right, coined the term \"fusion paranoia\" to refer to a political convergence of left-wing and right-wing activists around anti-war issues and civil liberties, which he said were motivated by a shared belief in conspiracism or shared anti-government views.\n\nBarkun has adopted this term to refer to how the synthesis of paranoid conspiracy theories, which were once limited to American fringe audiences, has given them mass appeal and enabled them to become commonplace in mass media, thereby inaugurating an unrivaled period of people actively preparing for apocalyptic or millenarian scenarios in the United States of the late 20th and early 21st centuries. Barkun notes the occurrence of lone-wolf conflicts with law enforcement acting as proxy for threatening the established political powers.\n\nViability of conspiracies\n\nThe physicist David Robert Grimes published in the PLOS ONE journal an estimation of the time it would take for a conspiracy to be exposed, based on the number of people involved.  \nHis calculations used data from verified events such as The National Security Agency (NSA) PRISM affair, Tuskegee Syphilis Experiment and the FBI forensic scandal.\n\n* Moon landing hoax would require the involvement of 411,000 people and would be exposed within 3.68 years;\n* Climate-change fraud would require 405,000 people and would be exposed within 3.70 years;\n* Vaccination conspiracy would require a minimum of 22,000 people (without drug companies) and would be exposed within at least 3.15 years and at most 34.78 years depending on the number involved;\n* Suppressed cancer cure conspiracy would require 714,000 people and would be exposed within 3.17 years.\n\nPolitical use\n\nIn his book The Open Society and Its Enemies, the philosopher Karl Popper used the term \"conspiracy theory\" to criticize the ideologies driving historicism. Popper argued that totalitarianism was founded on \"conspiracy theories\" which drew on imaginary plots driven by paranoid scenarios predicated on tribalism, chauvinism, or racism.  Popper acknowledged that genuine conspiracies do exist, but noted how infrequently conspirators have been able to achieve their goal.\n\nThe historian Bruce Cumings similarly rejects the notion that history is controlled by conspiracies, stating that where real conspiracies have appeared they have usually had little effect on history and have had unforeseen consequences for the conspirators.  Cumings concludes that history is instead \"moved by the broad forces and large structures of human collectivities\".\n\nIn a 2009 article, the legal scholars Cass Sunstein and Adrian Vermeule considered a number of possible government responses to conspiracy theories, including censorship and taxation, and concluding that the authorities ought to engage in counter-speech and dialogue, which they termed \"cognitive infiltration\". Conspiracy theory. http://en.wikipedia.org/?curid=5530."
  }
}
