{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11593",
  "eid" : "fc9321b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778503499,
  "textBody" : "The flat Earth model is an archaic and false conception of Earth's shape as a plane or disk. Many ancient cultures subscribed to a flat Earth cosmography, including Greece until the classical period, the Bronze Age and Iron Age civilizations of the Near East until the Hellenistic period, India until the Gupta period (early centuries AD), and China until the 17th century. That paradigm was also typically held in the aboriginal cultures of the Americas, and the notion of a flat Earth domed by the firmament in the shape of an inverted bowl was common in pre-scientific societies.\"Their cosmography as far as we know anything about it was practically of one type up til the time of the white man's arrival upon the scene. That of the Borneo Dayaks may furnish us with some idea of it. 'They consider the Earth to be a flat surface, whilst the heavens are a dome, a kind of glass shade which covers the Earth and comes in contact with it at the horizon.'\"\nLucien Levy-Bruhl, Primitive Mentality (repr. Boston: Beacon, 1966) 353; \"The usual primitive conception of the world's form ... [is] flat and round below and surmounted above by a solid firmament in the shape of an inverted bowl.\" H. B. Alexander, The Mythology of All Races 10: North American (repr. New York: Cooper Square, 1964) 249.\n\nThe idea of a spherical Earth appeared in Greek philosophy with Pythagoras (6th century BC), although most pre-Socratics (6th – 5th century BC) retained the flat Earth model. Aristotle provided evidence for the spherical shape of the Earth on empirical grounds by around 330 BC. Knowledge of the spherical Earth gradually began to spread beyond the Hellenistic world from then on.Continuation of Greek concept into Roman and medieval Christian thought: Reinhard Krüger: [http://www.uni-stuttgart.de/lettres/krueger/forschungsvorhaben_erdkugeltheorie_biblio.html Materialien und Dokumente zur mittelalterlichen Erdkugeltheorie von der Spätantike bis zur Kolumbusfahrt (1492)]Direct adoption of the Greek concept by Islam: Ragep, F. Jamil: \"Astronomy\", in: Krämer, Gudrun (ed.) et al.: Encyclopaedia of Islam, THREE, Brill 2010, without page numbersDirect adoption by India: D. Pingree: \"History of Mathematical Astronomy in India\", Dictionary of Scientific Biography, Vol. 15 (1978), pp. 533−633 (554ff.); Glick, Thomas F., Livesey, Steven John, Wallis, Faith (eds.): \"Medieval Science, Technology, and Medicine: An Encyclopedia\", Routledge, New York 2005, , p. 463Adoption by China via European science: Jean-Claude Martzloff, [http://www.eastm.org/index.php/journal/article/viewFile/526/457 \"Space and Time in Chinese Texts of Astronomy and of Mathematical Astronomy in the Seventeenth and Eighteenth Centuries\"], Chinese Science 11 (1993–94): 66–92 (69) and Christopher Cullen, \"A Chinese Eratosthenes of the Flat Earth: A Study of a Fragment of Cosmology in Huai Nan tzu 淮 南 子\", Bulletin of the School of Oriental and African Studies, Vol. 39, No. 1 (1976), pp. 106–27 (107)\n\nIn the modern era, pseudoscientific flat Earth theories have been espoused by modern flat Earth societies and, increasingly, by unaffiliated individuals using social media.\n\nHistory\n\nSupport for flat earth\n\nWest Asia\n\nIn early EgyptianH. and H. A. Frankfort, J. A. Wilson, and T. Jacobsen, Before Philosophy (Baltimore: Penguin, 1949) 54. and Mesopotamian thought, the world was portrayed as a disk floating in the ocean. A similar model is found in the Homeric account from the 8th century BC in which \"Okeanos, the personified body of water surrounding the circular surface of the Earth, is the begetter of all life and possibly of all gods.\"\n\nThe Israelites also imagined the Earth to be a disc floating on water; an arched firmament separated the Earth from the heavens. Like most ancient peoples, the Hebrews believed the sky was a solid dome with the Sun, Moon, planets and stars embedded in it.\n\nThe Pyramid Texts and Coffin Texts of ancient Egypt show a similar cosmography; Nun (the Ocean) encircled  nbwt (\"dry lands\" or \"Islands\").Pyramid Texts, Utterance 366, 629a–29c: \"Behold, thou art great and round like the Great Round; Behold, thou are bent around, and art round like the Circle which encircles the nbwt; Behold, thou art round and great like the Great Circle which sets.\"(Faulkner 1969, 120)Ancient Near Eastern Texts, Pritchard, 1969, p. 374.Coffin Texts, Spell 714.\n\nGreece\n\nPoets\n\nBoth HomerIliad, 28. 606. and HesiodThe Shield of Heracles, 314–16, transl. Hugh G. Evelyn-White, 1914. described a disc cosmography on the Shield of Achilles.The shield of Achilles and the poetics of ekphrasis, Andrew Sprague Becker, Rowman & Littlefield, 1995, p. 148.Professor of Classics (Emeritus) Mark W. Edwards in his The Iliad. A commentary (1991, p. 231) has noted of Homer's usage of the flat earth disc in the Iliad: \"Okeanos...surrounds the pictures on the shield and he surrounds the disc of the earth on which men and women work out their lives\". Quoted in The shield of Achilles and the poetics of ekphrasis, Andrew Sprague Becker, Rowman & Littlefield, 1995, p. 148\nThis poetic tradition of an earth-encircling (gaiaokhos) sea (Oceanus) and a disc also appears in Stasinus of Cyprus,Stasinus of Cyprus wrote in his Cypria (lost, only preserved in fragment) that Oceanus surrounded the entire earth: deep eddying Oceanus and that the earth was flat with furthest bounds', these quotes are found preserved in Athenaeus, Deipnosophistae, VIII. 334B. Mimnermus,Mimnermus of Colophon (630BC) details a flat earth model, with the sun (Helios) bathing at the edges of Oceanus that surround the earth (Mimnermus, frg. 11) Aeschylus,Seven against Thebes, verse 305; Prometheus Bound, 1, 136; 530; 665 (which also describe the 'edges' of the earth). and Apollonius Rhodius.Apollonius Rhodius, in his Argonautica (3rd century BC) included numerous flat earth references (IV. 590 ff): \"Now that river, rising from the ends of the earth, where are the portals and mansions of Nyx (Night), on one side bursts forth upon the beach of Okeanos.\"\n\nHomer's description of the disc cosmography on the shield of Achilles with the encircling ocean is repeated far later in Quintus Smyrnaeus' Posthomerica (4th century AD), which continues the narration of the Trojan War.Posthomerica (V. 14). \"Here [on the shield of Achilles] Tethys' all-embracing arms were wrought, and Okeanos fathomless flow. The outrushing flood of Rivers crying to the echoing hills all round, to right, to left, rolled o'er the land.\"  Translation by Way, A.S. 1913.\n\nPhilosophers\n\nSeveral pre-Socratic philosophers believed that the world was flat: Thales (c. 550 BC) according to several sources,The Physical World of the Greeks, Samuel Sambursky, Princeton University Press (August 1987), p. 12\nand Leucippus (c. 440 BC) and Democritus (c. 460–370 BC) according to Aristotle.Aristotle, De Caelo, 294b13–21\n\nThales thought the earth floated in water like a log.Aristotle, De Caelo, II. 13. 3; 294a 28: \"Many others say the earth rests upon water. This... is the oldest theory that has been preserved, and is attributed to Thales of Miletus\" It has been argued, however, that Thales actually believed in a round Earth. Anaximander (c. 550 BC) believed the Earth was a short cylinder with a flat, circular top that remained stable because it was the same distance from all things.Hippolytus, Refutation of all Heresies, i. 6Anaximander;  (Plut., Strom. 2 ; Dox. 579). Anaximenes of Miletus believed that \"the earth is flat and rides on air; in the same way the sun and the moon and the other heavenly bodies, which are all fiery, ride the air because of their flatness.\"Hippolytus, Refutation of all Heresies, i. 7; Cf. Aristotle, De Caelo, 294b13–21 Xenophanes of Colophon (c. 500 BC) thought that the Earth was flat, with its upper side touching the air, and the lower side extending without limit.Xenophanes DK 21B28, quoted in Achilles, Introduction to Aratus 4\n\nBelief in a flat Earth continued into the 5th century BC. Anaxagoras (c. 450 BC) agreed that the Earth was flat,Diogenes Laertius, ii. 8 and his pupil Archelaus believed that the flat Earth was depressed in the middle like a saucer, to allow for the fact that the Sun does not rise and set at the same time for everyone.Hippolytus, Refutation of all Heresies, i. 9\n\nHistorians\n\nHecataeus of Miletus believed the earth was flat and surrounded by water.FGrH F 18a. Herodotus in his Histories ridiculed the belief that water encircled the world,Herodotus knew of the conventional view, according to which the river Ocean runs around a circular flat earth (4.8), and of the division of the world into three - Jacoby, RE Suppl. 2.352 ff yet rejected this personal belief (Histories, 2. 21; 4. 8; 4. 36) yet most classicists agree he still believed the earth was flat because of his descriptions of literal \"ends\" or \"edges\" of the earth.The history of Herodotus, George Rawlinson, Appleton and company, 1889, p. 409\n\nEurope\n\nThe ancient Norse and Germanic peoples believed in a flat Earth cosmography with the Earth surrounded by an ocean, with the axis mundi, a world tree (Yggdrasil), or pillar (Irminsul) in the centre.The Sacred Tree in Religion and Myth, Mrs. J. H. Philpot, Courier Dover Publications, 2004, p. 113.\"The world was a flat disk, with the earth in the center and the sea all around. Thus the serpent is about as far away from the center, where men and gods lived\" (Norse mythology: a guide to the Gods, heroes, rituals, and beliefs, John Lindow Oxford University Press, 2002) p. 253. In the world-encircling ocean sat a snake called Jormungandr.One of the earliest literary references to the world encircling water snake comes from Bragi Boddason who lived in the 9th century, in his Ragnarsdrápa (XIV) The Norse creation account preserved in Gylfaginning (VIII) states that during the creation of the earth, an impassable sea was placed around it:\n\nThe late Norse Konungs skuggsjá, on the other hand, infers a spherical Earth:\n\nEast Asia\n\nIn ancient China, the prevailing belief was that the Earth was flat and square, while the heavens were round,Needham, Joseph (1986). Science and Civilization in China: Volume 3. Taipei: Caves Books, Ltd. pp. 498. an assumption virtually unquestioned until the introduction of European astronomy in the 17th century. The English sinologist Cullen emphasizes the point that there was no concept of a round Earth in ancient Chinese astronomy:\nChinese thought on the form of the earth remained almost unchanged from early times until the first contacts with modern science through the medium of Jesuit missionaries in the seventeenth century. While the heavens were variously described as being like an umbrella covering the earth (the Kai Tian theory), or like a sphere surrounding it (the Hun Tian theory), or as being without substance while the heavenly bodies float freely (the Hsüan yeh theory), the earth was at all times flat, although perhaps bulging up slightly.\n\nThe model of an egg was often used by Chinese astronomers such as Zhang Heng (78–139 AD) to describe the heavens as spherical:\n The heavens are like a hen's egg and as round as a crossbow bullet; the earth is like the yolk of the egg, and lies in the centre.\n\nThis analogy with a curved egg led some modern historians, notably Joseph Needham, to conjecture that Chinese astronomers were, after all, aware of the Earth's sphericity. The egg reference, however, was rather meant to clarify the relative position of the flat earth to the heavens:\n\nIn a passage of Zhang Heng's cosmogony not translated by Needham, Zhang himself says: \"Heaven takes its body from the Yang, so it is round and in motion. Earth takes its body from the Yin, so it is flat and quiescent\". The point of the egg analogy is simply to stress that the earth is completely enclosed by heaven, rather than merely covered from above as the Kai Tian describes. Chinese astronomers, many of them brilliant men by any standards, continued to think in flat-earth terms until the seventeenth century; this surprising fact might be the starting-point for a re-examination of the apparent facility with which the idea of a spherical earth found acceptance in fifth-century BC Greece.\n\nFurther examples cited by Needham supposed to demonstrate dissenting voices from the ancient Chinese consensus actually refer without exception to the Earth being square, not to it being flat. Accordingly, the 13th-century scholar Li Ye, who argued that the movements of the round heaven would be hindered by a square Earth, did not advocate a spherical Earth, but rather that its edge should be rounded off so as to be circular. However, Needham disagrees, affirming that Li Ye believed the earth to be spherical, similar in shape to the heavens but much smaller.Needham, Joseph; Wang, Ling. (1995) [1959]. Science and Civilization in China: Mathematics and the Sciences of the Heavens and the Earth, vol. 3, reprint edition. Cambridge: Cambridge University Press. , p. 498. This was preconceived by the 4th-century scholar Yu Xi, who argued for the infinity of outer space surrounding the Earth and that the latter could be either square or round, in accordance to the shape of the heavens.Needham, Joseph; Wang, Ling. (1995) [1959]. Science and Civilization in China: Mathematics and the Sciences of the Heavens and the Earth, vol. 3, reprint edition. Cambridge: Cambridge University Press. , pp. 220, 498. When Chinese geographers of the 17th century, influenced by European cartography and astronomy, showed the earth as a sphere that could be circumnavigated by sailing around the globe, they did so with formulaic terminology previously used by Zhang Heng to describe the spherical shape of the sun and moon (i.e. that they were as round as a crossbow bullet).Needham, Joseph; Wang, Ling. (1995) [1959]. Science and Civilization in China: Mathematics and the Sciences of the Heavens and the Earth, vol. 3, reprint edition. Cambridge: Cambridge University Press. , pp. 227, 499.\n\nAs noted in the book Huainanzi,Joseph Needham, p. 225 in the 2nd century BC Chinese astronomers effectively inverted Eratosthenes' calculation of the curvature of the Earth to calculate the height of the sun above the earth. By assuming the earth was flat, they arrived at a distance of 100,000 li (approximately 200,000 km).  The Zhoubi Suanjing also discusses how to determine the distance of the Sun by measuring the length of noontime shadows at different latitudes, a method similar to Eratosthenes' measurement of the circumference of the Earth, but the Zhoubi Suanjing assumes that the Earth is flat.\n\nAlternate or mixed theories\n\nGreece: Spherical earth\n\nPythagoras in the 6th-century BC and Parmenides in the 5th-century stated that the Earth is spherical,\n the spherical view spread rapidly in the Greek world. Around 330 BC, Aristotle maintained on the basis of physical theory and observational evidence that the Earth was spherical, and reported on an estimate on the circumference.On the Heavens, Book ii Chapter 14.  The Earth's circumference was first determined around 240 BC by Eratosthenes. By the second century AD, Ptolemy had derived his maps from a globe and developed the system of latitude, longitude, and climes. His Almagest was written in Greek and only translated into Latin in the 11th century from Arabic translations.\n\n In the 2nd century BC, Crates of Mallus devised a terrestrial sphere that divided the Earth into four continents, separated by great rivers or oceans, with people presumed living in each of the four regions. Opposite the oikumene, the inhabited world, were the antipodes, considered unreachable both because of an intervening torrid zone (equator) and the ocean. This took a strong hold on the medieval mind.\n\nLucretius (1st century BC) opposed the concept of a spherical Earth, because he considered that an infinite universe had no center towards which heavy bodies would tend. Thus, he thought the idea of animals walking around topsy-turvy under the Earth was absurd.Lucretius, De rerum natura, 1.1052–82. By the 1st century AD, Pliny the Elder was in a position to claim that everyone agreed on the spherical shape of Earth,Natural History, 2.64 though disputes continued regarding the nature of the antipodes, and how it is possible to keep the ocean in a curved shape. Pliny also considered the possibility of an imperfect sphere \"shaped like a pinecone\".\n\nIn late antiquity such widely read encyclopedists as Macrobius and Martianus Capella (both 5th century AD) discussed the circumference of the sphere of the Earth, its central position in the universe, the difference of the seasons in northern and southern hemispheres, and many other geographical details., translated in  In his commentary on Cicero's Dream of Scipio, Macrobius described the Earth as a globe of insignificant size in comparison to the remainder of the cosmos.\n\nSouth Asia\n\nThe Vedic texts depict the cosmos in many ways., Quote: \"The Vedic texts contain several depictions of the shape of the cosmos. The Rigveda alone contains two basic images of the cosmos: a bipartite cosmos, consisting of the two spheres of heavens and earth, and a tripartite cosmos consisting of the three spheres of heavens and earth (...)\" The earliest Indian cosmological texts picture the earth as one of a stack of flat disks.\n\nIn the Vedic texts, Dyaus (heaven) and Prithvi (earth) are compared to wheels on an axle, yielding a flat model. They are also described as bowls or leather bags, yielding a concave model. According to Macdonell, \"the conception of the earth being a disc surrounded by an ocean does not appear in the Samhitas. But it was naturally regarded as circular, being compared with a wheel (10.89) and expressly called circular (parimandala) in the Shatapatha Brahmana.\"\n\nBy about the 5th century CE, the siddhanta astronomy texts of South Asia, particularly of Aryabhata, assume a spherical earth as they develop mathematical methods for quantitative astronomy for calendar and time keeping.\n\nThe medieval Indian texts called the Puranas describe the earth as a flat-bottomed, circular disk with concentric oceans and continents.D. Pingree: \"History of Mathematical Astronomy in India\", Dictionary of Scientific Biography, Vol. 15 (1978), pp. 533–633 (554ff.), Quote: \"In the Purānas, the earth is a flat-bottomed, circular disk, in the center of which is a lofty mountain, Meru. Surrounding Meru is the circular continent Jambūdvīpa, which is in turn surrounded by a ring of water known as the Salt Ocean. There follow alternating rings of land and sea until there are seven continents and seven oceans. In the southern quarter of Jambūdvīpa lies India–Bhāratavarsa. This general scheme is present not only in the Hindu cosmologies but also in Buddhist and Jain cosmologies of South Asia. However, some Puranas include other models. For example, the fifth canto of the Bhagavata Purana, includes sections that describe the earth both as flat and spherical.\n\nIt has long been debated how and when the spherical conception arose in Indian astronomical models. Detailed records, particularly about the observational practices have not survived. The Greek text which possibly influenced the Indian astronomers in early medieval period is also unknown, and there is \"no textual evidence for any significant transmissions of Western astronomy between the early first millennium and the early second\". While the textual evidence has not survived, the precision of the constants used in pre-Greek Vedanga models, and the model's accuracy in predicting moon and sun's motion for Vedic rituals, probably came from direct astronomical observations. The cosmographic theories and assumptions in ancient India likely developed independently and in parallel, but these were influenced by some unknown quantitative Greek astronomy text in the medieval era.\n\nEarly Christian Church\n\nDuring the early Church period, the spherical view continued to be widely held, with some notable exceptions.\n\nEarly Christian beliefs mention a number of ideas about the shape of the earth. Athenagoras, an eastern Christian writing around the year 175 CE said, \"The world, being made spherical, is confined within the circles of heaven.\" Methodius (c. 290 AD), an eastern Christian writing against \"the theory of the Chaldeans and the Egyptians\" who asserted that the earth was spherical  said, \"Let us first lay bare ... the theory of the Chaldeans and the Egyptians. They say that the circumference of the universe is likened to the turnings of a well-rounded globe, the earth being a central point. They say that since its outline is spherical, ... the earth should be the center of the universe, around which the heaven is whirling.\" Lactantius, a western Christian writer and advisor to the first Christian Roman Emperor, Constantine, and writing sometime between 304–313 CE, ridiculed the notion of Antipodes and the philosophers who fancied that \"the universe is round like a ball. They also thought that heaven revolves in accordance with the motion of the heavenly bodies. ... For that reason, they constructed brass globes, as though after the figure of the universe. ... I am at a loss as to what to say concerning those who, once they have erred, continue in their folly, defending one vain thing by another vain thing.\"Lactantius, [http://www.ccel.org/ccel/schaff/anf07.iii.ii.iii.xxiv.html The Divine Institutes, Book III, Chapter XXIV], The Ante-Nicene Fathers, Vol VII, ed. Rev. Alexander Roberts, D.D., and James Donaldson, LL.D., American reprint of the Edinburgh edition (1979), William B. Eerdmans Publishing Co., Grand Rapids, MI, pp. 94–95. Arnobius, another eastern Christian writing sometime around 305 CE, said, \"In the first place, indeed, the world itself is neither right nor left. It has neither upper nor lower regions, nor front nor back. For whatever is round and bounded on every side by the circumference of a solid sphere, has no beginning or end ...\"\n\nThe influential theologian and philosopher Saint Augustine, one of the four Great Church Fathers of the Western Church, similarly objected to the \"fable\" of an inhabited Antipodes:\n\nThe view generally accepted by scholars of Augustine's work is that he shared the common view of his contemporaries that the Earth is spherical, in line with his endorsement of science in De Genesi ad litteram. That view has been challenged:\n\nYet other historians, however, do not view Augustine's scriptural commentaries as endorsing any particular cosmological model.\n\nDiodorus of Tarsus, a leading figure in the School of Antioch and mentor of John Chrysostom, may have argued for a flat Earth; however, Diodorus' opinion on the matter is known only from a later criticism.J. L. E. Dreyer, A History of Planetary Systems from Thales to Kepler. (1906); unabridged republication as A History of Astronomy from Thales to Kepler (New York: Dover Publications, 1953). Chrysostom, one of the four Great Church Fathers of the Eastern Church and Archbishop of Constantinople, explicitly espoused the idea, based on scripture, that the Earth floats miraculously on the water beneath the firmament.St. John Chrysostom, Homilies Concerning the Statues, Homily IX, paras. 7–8, in A Select Library of the Nicene and Post-Nicene Fathers of the Christian Church, Series I, Vol IX, ed. Philip Schaff, D.D., LL.D., American reprint of the Edinburgh edition (1978), W. B. Eerdmans Publishing Co.,Grand Rapids, MI, [https://archive.org/stream/aselectlibrary09unknuoft#page/403/mode/1up pp. 403–04].\n\"When therefore thou beholdest not a small pebble, but the whole earth borne upon the waters, and not submerged, admire the power of Him who wrought these marvellous things in a supernatural manner! And whence does this appear, that the earth is borne upon the waters? The prophet declares this when he says, 'He hath founded it upon the seas, and prepared it upon the floods.'1416 And again: 'To him who hath founded the earth upon the waters.'1417 What sayest thou? The water is not able to support a small pebble on its surface, and yet bears up the earth, great as it is; and mountains, and hills, and cities, and plants, and men, and brutes; and it is not submerged!\" Athanasius the Great, Church Father and Patriarch of Alexandria,  expressed a similar view in Against the Heathen.St. Athanasius, Against the Heathen, Ch.27 [http://www.ccel.org/ccel/schaff/npnf204.vi.ii.i.xxvii.html], Ch 36 [http://www.ccel.org/ccel/schaff/npnf204.vi.ii.iii.ii.html], in A Select Library of the Nicene and Post-Nicene Fathers of the Christian Church, Series II, Vol IV, ed. Philip Schaff, D.D., LL.D., American reprint of the Edinburgh edition (1978), W.B. Eerdmans Publishing Co.,Grand Rapids, MI.\n\nChristian Topography (547) by the Alexandrian monk Cosmas Indicopleustes, who had travelled as far as Sri Lanka and the source of the Blue Nile, is now widely considered the most valuable geographical document of the early medieval age, although it received relatively little attention from contemporaries. In it, the author repeatedly expounds the doctrine that the universe consists of only two places, the Earth below the firmament and heaven above it. Carefully drawing on arguments from scripture, he describes the Earth as a rectangle, 400 days' journey long by 200 wide, surrounded by four oceans and enclosed by four massive walls which support the firmament. The spherical Earth theory is contemptuously dismissed as \"pagan\".\n\nSeverian, Bishop of Gabala (d. 408), wrote that the Earth is flat and the sun does not pass under it in the night, but \"travels through the northern parts as if hidden by a wall\".J.L.E. Dreyer (1906), [https://books.google.com/books?idBTI9AAAAIAAJ&pg\nPA211 A History of Planetary Systems], (1906), [http://www.roger-pearse.com/weblog/?p=3921 pp. 211–212]. Basil of Caesarea (329–379) argued that the matter was theologically irrelevant.\n\nEurope: Early Middle Ages\n\nEarly medieval Christian writers in the early Middle Ages felt little urge to assume flatness of the earth, though they had fuzzy impressions of the writings of Ptolemy, Aristotle, and relied more on Pliny.\n\nWith the end of Roman civilization, Western Europe entered the Middle Ages with great difficulties that affected the continent's intellectual production. Most scientific treatises of classical antiquity (in Greek) were unavailable, leaving only simplified summaries and compilations. Still, many textbooks of the Early Middle Ages supported the sphericity of the Earth. For example: some early medieval manuscripts of Macrobius include maps of the Earth, including the antipodes, zonal maps showing the Ptolemaic climates derived from the concept of a spherical Earth and a diagram showing the Earth (labeled as globus terrae, the sphere of the Earth) at the center of the hierarchically ordered planetary spheres.B. Eastwood and G. Graßhoff, Planetary Diagrams for Roman Astronomy in Medieval Europe, ca. 800–1500, Transactions of the American Philosophical Society, 94, 3 (Philadelphia, 2004), pp. 49–50. Further examples of such medieval diagrams can be found in medieval manuscripts of the Dream of Scipio. In the Carolingian era, scholars discussed Macrobius's view of the antipodes. One of them, the Irish monk Dungal, asserted that the tropical gap between our habitable region and the other habitable region to the south was smaller than Macrobius had believed.Bruce S. Eastwood, Ordering the Heavens: Roman Astronomy and Cosmology in the Carolingian Renaissance, (Leiden: Brill, 2007), pp. 62–63.\n\nEurope's view of the shape of the Earth in Late Antiquity and the Early Middle Ages may be best expressed by the writings of early Christian scholars:\n\nA possible non-literary but graphic indication that people in the Middle Ages believed that the Earth (or perhaps the world) was a sphere is the use of the orb (globus cruciger) in the regalia of many kingdoms and of the Holy Roman Empire. It is attested from the time of the Christian late-Roman emperor Theodosius II (423) throughout the Middle Ages; the Reichsapfel was used in 1191 at the coronation of emperor Henry VI. However the word 'orbis' means 'circle' and there is no record of a globe as a representation of the Earth since ancient times in the west till that of Martin Behaim in 1492. Additionally it could well be a representation of the entire 'world' or cosmos.\n\nA recent study of medieval concepts of the sphericity of the Earth noted that \"since the eighth century, no cosmographer worthy of note has called into question the sphericity of the Earth\". However, the work of these intellectuals may not have had significant influence on public opinion, and it is difficult to tell what the wider population may have thought of the shape of the Earth, if they considered the question at all.\n\nEurope: Late Middle Ages\n\nHermannus Contractus (1013–1054) was among the earliest Christian scholars to estimate the circumference of Earth with Eratosthenes' method. Thomas Aquinas (1225–1274), the most important and widely taught theologian of the Middle Ages, believed in a spherical Earth; and he even took for granted his readers also knew the Earth is round. In his Summa Theologica he wrote, \"The physicist proves the earth to be round by one means, the astronomer by another: for the latter proves this by means of mathematics, e.g. by the shapes of eclipses, or something of the sort; while the former proves it by means of physics, e.g. by the movement of heavy bodies towards the center, and so forth.\" Lectures in the medieval universities commonly advanced evidence in favor of the idea that the Earth was a sphere. Also, On the Sphere of the World, the most influential astronomy textbook of the 13th century and required reading by students in all Western European universities, described the world as a sphere.\n\nThe shape of the Earth was not only discussed in scholarly works written in Latin; it was also treated in works written in vernacular languages or dialects and intended for wider audiences. The Norwegian book Konungs Skuggsjá, from around 1250, states clearly that the Earth is spherical – and that there is night on the opposite side of the Earth when there is daytime in Norway. The author also discusses the existence of antipodes – and he notes that (if they exist) they see the Sun in the north of the middle of the day, and that they experience seasons opposite those of people in the Northern Hemisphere.\n\nHowever Tattersall shows that in many vernacular works in 12th- and 13th-century French texts the Earth was considered \"round like a table\" rather than \"round like an apple\". \"In virtually all the examples quoted ... from epics and from non-'historical' romances (that is, works of a less learned character) the actual form of words used suggests strongly a circle rather than a sphere\", though he notes that even in these works the language is ambiguous.\n\nPortuguese navigation down and around the coast of Africa in the latter half of the 1400s gave wide-scale observational evidence for Earth's sphericity. In these explorations, the sun's position moved more northward the further south the explorers travel. Its position directly overhead at noon gave evidence for crossing the equator. These apparent solar motions in detail were more consistent with north-south curvature and a distant sun, than with any flat-earth explanation. The ultimate demonstration came when Ferdinand Magellan's expedition completed the first global circumnavigation in 1521. Antonio Pigafetta, one of the few survivors of the voyage, recorded the loss of a day in the course of the voyage, giving evidence for east-west curvature. No flat-earth theory could reconcile the daily apparent motions of the sun with the ability to sail around the world, and the loss of a day could make no sense, either.\n\nMiddle East: Islamic scholars\n\nThe Abbasid Caliphate saw a great flowering of astronomy and mathematics in the 9th century AD, in which Muslim scholars translated Ptolemy's work, which became the Almagest, and extended and updated his work based on spherical ideas. Since then, these have generally been respected.\n\nThe Quran mentions that the Earth (al-arḍ) was \"spread out\".For example, see verses , , , and . To this 12th-century commentary, the Tafsir al-Kabir (al-Razi) by Fakhr al-din al-Razi, states \"If it is said: Do the words 'And the earth We spread out' indicate that it is flat? We would respond: Yes, because the earth, even though it is round, is an enormous sphere, and each little part of this enormous sphere, when it is looked at, appears to be flat. As that is the case, this will dispel what they mentioned of confusion. The evidence for that is the verse in which Allah says (interpretation of the meaning): 'And the mountains as pegs' [an-Naba’ 78:7]. He called them awtaad (pegs) even though these mountains may have large flat surfaces. And the same is true in this case.\"\n\nThe 11th century Ibn Hazm stated, \"Evidence shows that the Earth is a sphere but public people say the opposite.\" He added, \"None of those who deserve being Imams for Muslims has denied that Earth is round. And we have not received anything indicates a denial, not even a single word.\"\n\nMing Dynasty in China\n\nA spherical terrestrial globe was introduced to Yuan-era Khanbaliq (i.e. Beijing) in 1267 by the Persian astronomer Jamal ad-Din, but it is not known to have made an impact on the traditional Chinese conception of the shape of the Earth.(cf. Joseph Needham et al.: \"Heavenly clockwork: the great astronomical clocks of medieval China\", Antiquarian Horological Society, 2nd. ed., Vol. 1, 1986, , p. 138) As late as 1595, an early Jesuit missionary to China, Matteo Ricci, recorded that the Ming-dynasty Chinese say: \"The earth is flat and square, and the sky is a round canopy; they did not succeed in conceiving the possibility of the antipodes.\" The universal belief in a flat Earth is confirmed by a contemporary Chinese encyclopedia from 1609 illustrating a flat Earth extending over the horizontal diametral plane of a spherical heaven. \n\nIn the 17th century, the idea of a spherical Earth spread in China due to the influence of the Jesuits, who held high positions as astronomers at the imperial court.Needham, Joseph (1986). Science and Civilization in China: Volume 3. Taipei: Caves Books, Ltd. pp. 499. Matteo Ricci, in collaboration with Chinese cartographers and translator Li Zhizao, published the Kunyu Wanguo Quantu in 1602, the first Chinese world map based on European discoveries. The astronomical and geographical treatise Gezhicao (格致草) written in 1648 by Xiong Mingyu (熊明遇) explained that the Earth was spherical, not flat or square, and could be circumnavigated.\n\nMyth of the flat Earth \n\nBeginning in the 19th century, a historical myth arose which held that the predominant cosmological doctrine during the Middle Ages was that the Earth was flat.  An early proponent of this myth was the American writer Washington Irving, who maintained that Christopher Columbus had to overcome the opposition of churchmen to gain sponsorship for his voyage of exploration.  Later significant advocates of this view were John William Draper and Andrew Dickson White, who used it as a major element in their advocacy of the thesis that there was a long lasting and essential conflict between science and religion. Subsequent studies of medieval science have shown that most scholars in the Middle Ages, including those read by Christopher Columbus, maintained that the Earth was spherical.  Studies of the historical connections between science and religion have demonstrated that theories of their mutual antagonism ignore examples of their mutual support.\n\nModern Flat-Earthers\n\nIn the modern era, the pseudoscientific belief in a flat Earth has been expressed by a variety of individuals and groups:\n* English writer Samuel Rowbotham (1816–1885), writing under the pseudonym \"Parallax\", produced a pamphlet called Zetetic Astronomy in 1849 arguing for a flat Earth and published results of many experiments that tested the curvatures of water over a long drainage ditch, followed by another called The inconsistency of Modern Astronomy and its Opposition to the Scripture. One of his supporters, John Hampden, lost a bet to Alfred Russel Wallace in the famous Bedford Level Experiment, which attempted to prove it. In 1877 Hampden produced a book called \"A New Manual of Biblical Cosmography\".\n Rowbotham also produced studies that purported to show that the effects of ships disappearing below the horizon could be explained by the laws of perspective in relation to the human eye. In 1883 he founded Zetetic Societies in England and New York, to which he shipped a thousand copies of Zetetic Astronomy.\n* William Carpenter, a printer originally from Greenwich, England (home of the Royal Observatory and central to the study of astronomy), was a supporter of Rowbotham.  Carpenter published Theoretical Astronomy Examined and Exposed – Proving the Earth not a Globe in eight parts from 1864 under the name Common Sense.  He later emigrated to Baltimore, where he published A hundred proofs the Earth is not a Globe in 1885.William Carpenter, One hundred proofs that the earth is not a globe, (Baltimore: The author, 1885).[https://www.gutenberg.org/files/55387/55387-h/55387-h.htm]  He said \"There are rivers that flow for hundreds of miles towards the level of the sea without falling more than a few feet – notably, the Nile, which, in a thousand miles, falls but a foot. A level expanse of this extent is quite incompatible with the idea of the Earth's convexity. It is, therefore, a reasonable proof that Earth is not a globe\", as well as \"If the Earth were a globe, a small model globe would be the very best – because the truest – thing for the navigator to take to sea with him. But such a thing as that is not known: with such a toy as a guide, the mariner would wreck his ship, of a certainty!, This is a proof that Earth is not a globe.\"\n* John Jasper, an American slave turned prolific preacher, echoed his friend Carpenter's sentiments in his most famous sermon \"Der Sun do move\", preached over 250 times, always by invitation.\"Low me ter ax ef de earth is roun', whar do it keep its corners? Er flat, squar thing has corners, but tell me where is de cornur uv er appul, ur a marbul, ur a cannun ball, ur a silver dollar.\"  See also Garwood, p165\n* In Brockport, New York, in 1887, M.C. Flanders argued the case of a flat Earth for three nights against two scientific gentlemen defending sphericity. Five townsmen chosen as judges voted unanimously for a flat Earth at the end. The case was reported in the Brockport Democrat.The Earth: Scripturally, Rationally, and Practically Described. A Geographical, Philosophical, and Educational Review, Nautical Guide, and General Student's Manual, n. 17 (November 1, 1887), p. 7. cited in \n* Professor Joseph W. Holden of Maine, a former justice of the peace, gave numerous lectures in New England and lectured on flat Earth theory at the Columbian Exposition in Chicago. His fame stretched to North Carolina where the Statesville Semi-weekly Landmark recorded at his death in 1900: \"We hold to the doctrine that the earth is flat ourselves and we regret exceedingly to learn that one of our members is dead.\"\n* After Rowbotham's death, Lady Elizabeth Blount (Elizabeth de Sodington Blount, née Elizabeth Anne Mould Williams) created the Universal Zetetic Society in 1893 in England and created a journal called Earth not a Globe Review, which sold for twopence, as well as one called Earth, which only lasted from 1901 to 1904. She held that the Bible was the unquestionable authority on the natural world and argued that one could not be a Christian and believe the Earth is a globe. Well-known members included E. W. Bullinger of the Trinitarian Bible Society, Edward Haughton, senior moderator in natural science in Trinity College, Dublin and an archbishop. She repeated Rowbotham's experiments, generating some interesting counter-experiments, but interest declined after the First World War. The movement gave rise to several books that argued for a flat, stationary earth, including Terra Firma by David Wardlaw Scott.\n* In 1898, during his solo circumnavigation of the world, Joshua Slocum encountered a group of flat-Earthers in Durban, South Africa. Three Boers, one of them a clergyman, presented Slocum with a pamphlet in which they set out to prove that the world was flat. Paul Kruger, President of the Transvaal Republic, advanced the same view: \"You don't mean round the world, it is impossible! You mean in the world. Impossible!\"Joshua Slocum, Sailing Alone Around the World, (New York: The Century Company, 1900), chaps. 17–18.[http://www.ibiblio.org/eldritch/js/saaw.htm]\n* Wilbur Glenn Voliva, who in 1906 took over the Christian Catholic Church, a Pentecostal sect that established a utopian community at Zion, Illinois, preached flat Earth doctrine from 1915 onwards and used a photograph of a twelve-mile stretch of the shoreline at Lake Winnebago, Wisconsin taken three feet above the waterline to prove his point. When the airship Italia disappeared on an expedition to the North Pole in 1928 he warned the world's press that it had sailed over the edge of the world. He offered a $5,000 award for proving the Earth is not flat, under his own conditions. Teaching a globular Earth was banned in the Zion schools and the message was transmitted on his WCBD radio station.\n\nFlat Earth Society\n\nIn 1956, Samuel Shenton set up the International Flat Earth Research Society (IFERS), better known as the Flat Earth Society from Dover, UK, as a direct descendant of the Universal Zetetic Society. This was just before the Soviet Union launched the first artificial satellite, Sputnik; he responded, \"Would sailing round the Isle of Wight prove that it were spherical? It is just the same for those satellites.\"\n\nHis primary aim was to reach children before they were convinced about a spherical Earth. Despite plenty of publicity, the space race eroded Shenton's support in Britain until 1967 when he started to become famous due to the Apollo program.\n\nIn 1972 Shenton's role was taken over by Charles K. Johnson, a correspondent  from California, US.  He incorporated the IFERS and steadily built up the membership to about 3,000.  He spent years examining the studies of flat and round Earth theories and proposed evidence of a conspiracy against flat Earth: \"The idea of a spinning globe is only a conspiracy of error that Moses, Columbus, and FDR all fought...\" His article was published in the magazine Science Digest, 1980.  It goes on to state, \"If it is a sphere, the surface of a large body of water must be curved.  The Johnsons have checked the surfaces of Lake Tahoe and the Salton Sea without detecting any curvature.\"\n\nThe Society declined in the 1990s following a fire at its headquarters in California and the death of Johnson in 2001. It was revived as a website in 2004 by Daniel Shenton (no relation to Samuel Shenton). He believes that no one has provided proof that the world is not flat.\n\nResurgence in the era of celebrity and social media\n\nIn the modern era, the proliferation of communications technology and social media platforms such as YouTube, Facebook and Twitter have given individuals, famous or otherwise, a platform to spread pseudo-scientific ideas and build stronger followings. The flat-earth conjecture has flourished in this environment.\n\nThe solar eclipse of August 21, 2017, gave rise to numerous YouTube videos purporting to show how the details of the eclipse prove the earth is flat. Also in 2017, a scandal developed in Arab scientific and educational circles when a Tunisian PhD student submitted a thesis declaring Earth to be flat, unmoving, the center of the universe, and only 13,500 years of age.\n\nCultural references\n\nThe term flat-Earther is often used in a derogatory sense to mean anyone who holds ridiculously antiquated views. The first use of the term flat-earther recorded by the Oxford English Dictionary is in 1934 in Punch: \"Without being a bigoted flat-earther, [Mercator] perceived the nuisance ... of fiddling about with globes ... in order to discover the South Seas.\"\n\n The term flat-earth-man was recorded in 1908: \"Fewer votes than one would have thought possible for any human candidate, were he even a flat-earth-man.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Flat Earth" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11593" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The flat Earth model is an archaic and false conception of Earth's shape as a plane or disk. Many ancient cultures subscribed to a flat Earth cosmography, including Greece until the classical period, the Bronze Age and Iron Age civilizations of the Near East until the Hellenistic period, India until the Gupta period (early centuries AD), and China until the 17th century. That paradigm was also typically held in the aboriginal cultures of the Americas, and the notion of a flat Earth domed by the firmament in the shape of an inverted bowl was common in pre-scientific societies.\"Their cosmography as far as we know anything about it was practically of one type up til the time of the white man's arrival upon the scene. That of the Borneo Dayaks may furnish us with some idea of it. 'They consider the Earth to be a flat surface, whilst the heavens are a dome, a kind of glass shade which covers the Earth and comes in contact with it at the horizon.'\"\nLucien Levy-Bruhl, Primitive Mentality (repr. Boston: Beacon, 1966) 353; \"The usual primitive conception of the world's form ... [is] flat and round below and surmounted above by a solid firmament in the shape of an inverted bowl.\" H. B. Alexander, The Mythology of All Races 10: North American (repr. New York: Cooper Square, 1964) 249.\n\nThe idea of a spherical Earth appeared in Greek philosophy with Pythagoras (6th century BC), although most pre-Socratics (6th – 5th century BC) retained the flat Earth model. Aristotle provided evidence for the spherical shape of the Earth on empirical grounds by around 330 BC. Knowledge of the spherical Earth gradually began to spread beyond the Hellenistic world from then on.Continuation of Greek concept into Roman and medieval Christian thought: Reinhard Krüger: [http://www.uni-stuttgart.de/lettres/krueger/forschungsvorhaben_erdkugeltheorie_biblio.html Materialien und Dokumente zur mittelalterlichen Erdkugeltheorie von der Spätantike bis zur Kolumbusfahrt (1492)]Direct adoption of the Greek concept by Islam: Ragep, F. Jamil: \"Astronomy\", in: Krämer, Gudrun (ed.) et al.: Encyclopaedia of Islam, THREE, Brill 2010, without page numbersDirect adoption by India: D. Pingree: \"History of Mathematical Astronomy in India\", Dictionary of Scientific Biography, Vol. 15 (1978), pp. 533−633 (554ff.); Glick, Thomas F., Livesey, Steven John, Wallis, Faith (eds.): \"Medieval Science, Technology, and Medicine: An Encyclopedia\", Routledge, New York 2005, , p. 463Adoption by China via European science: Jean-Claude Martzloff, [http://www.eastm.org/index.php/journal/article/viewFile/526/457 \"Space and Time in Chinese Texts of Astronomy and of Mathematical Astronomy in the Seventeenth and Eighteenth Centuries\"], Chinese Science 11 (1993–94): 66–92 (69) and Christopher Cullen, \"A Chinese Eratosthenes of the Flat Earth: A Study of a Fragment of Cosmology in Huai Nan tzu 淮 南 子\", Bulletin of the School of Oriental and African Studies, Vol. 39, No. 1 (1976), pp. 106–27 (107)\n\nIn the modern era, pseudoscientific flat Earth theories have been espoused by modern flat Earth societies and, increasingly, by unaffiliated individuals using social media.\n\nHistory\n\nSupport for flat earth\n\nWest Asia\n\nIn early EgyptianH. and H. A. Frankfort, J. A. Wilson, and T. Jacobsen, Before Philosophy (Baltimore: Penguin, 1949) 54. and Mesopotamian thought, the world was portrayed as a disk floating in the ocean. A similar model is found in the Homeric account from the 8th century BC in which \"Okeanos, the personified body of water surrounding the circular surface of the Earth, is the begetter of all life and possibly of all gods.\"\n\nThe Israelites also imagined the Earth to be a disc floating on water; an arched firmament separated the Earth from the heavens. Like most ancient peoples, the Hebrews believed the sky was a solid dome with the Sun, Moon, planets and stars embedded in it.\n\nThe Pyramid Texts and Coffin Texts of ancient Egypt show a similar cosmography; Nun (the Ocean) encircled  nbwt (\"dry lands\" or \"Islands\").Pyramid Texts, Utterance 366, 629a–29c: \"Behold, thou art great and round like the Great Round; Behold, thou are bent around, and art round like the Circle which encircles the nbwt; Behold, thou art round and great like the Great Circle which sets.\"(Faulkner 1969, 120)Ancient Near Eastern Texts, Pritchard, 1969, p. 374.Coffin Texts, Spell 714.\n\nGreece\n\nPoets\n\nBoth HomerIliad, 28. 606. and HesiodThe Shield of Heracles, 314–16, transl. Hugh G. Evelyn-White, 1914. described a disc cosmography on the Shield of Achilles.The shield of Achilles and the poetics of ekphrasis, Andrew Sprague Becker, Rowman & Littlefield, 1995, p. 148.Professor of Classics (Emeritus) Mark W. Edwards in his The Iliad. A commentary (1991, p. 231) has noted of Homer's usage of the flat earth disc in the Iliad: \"Okeanos...surrounds the pictures on the shield and he surrounds the disc of the earth on which men and women work out their lives\". Quoted in The shield of Achilles and the poetics of ekphrasis, Andrew Sprague Becker, Rowman & Littlefield, 1995, p. 148\nThis poetic tradition of an earth-encircling (gaiaokhos) sea (Oceanus) and a disc also appears in Stasinus of Cyprus,Stasinus of Cyprus wrote in his Cypria (lost, only preserved in fragment) that Oceanus surrounded the entire earth: deep eddying Oceanus and that the earth was flat with furthest bounds', these quotes are found preserved in Athenaeus, Deipnosophistae, VIII. 334B. Mimnermus,Mimnermus of Colophon (630BC) details a flat earth model, with the sun (Helios) bathing at the edges of Oceanus that surround the earth (Mimnermus, frg. 11) Aeschylus,Seven against Thebes, verse 305; Prometheus Bound, 1, 136; 530; 665 (which also describe the 'edges' of the earth). and Apollonius Rhodius.Apollonius Rhodius, in his Argonautica (3rd century BC) included numerous flat earth references (IV. 590 ff): \"Now that river, rising from the ends of the earth, where are the portals and mansions of Nyx (Night), on one side bursts forth upon the beach of Okeanos.\"\n\nHomer's description of the disc cosmography on the shield of Achilles with the encircling ocean is repeated far later in Quintus Smyrnaeus' Posthomerica (4th century AD), which continues the narration of the Trojan War.Posthomerica (V. 14). \"Here [on the shield of Achilles] Tethys' all-embracing arms were wrought, and Okeanos fathomless flow. The outrushing flood of Rivers crying to the echoing hills all round, to right, to left, rolled o'er the land.\"  Translation by Way, A.S. 1913.\n\nPhilosophers\n\nSeveral pre-Socratic philosophers believed that the world was flat: Thales (c. 550 BC) according to several sources,The Physical World of the Greeks, Samuel Sambursky, Princeton University Press (August 1987), p. 12\nand Leucippus (c. 440 BC) and Democritus (c. 460–370 BC) according to Aristotle.Aristotle, De Caelo, 294b13–21\n\nThales thought the earth floated in water like a log.Aristotle, De Caelo, II. 13. 3; 294a 28: \"Many others say the earth rests upon water. This... is the oldest theory that has been preserved, and is attributed to Thales of Miletus\" It has been argued, however, that Thales actually believed in a round Earth. Anaximander (c. 550 BC) believed the Earth was a short cylinder with a flat, circular top that remained stable because it was the same distance from all things.Hippolytus, Refutation of all Heresies, i. 6Anaximander;  (Plut., Strom. 2 ; Dox. 579). Anaximenes of Miletus believed that \"the earth is flat and rides on air; in the same way the sun and the moon and the other heavenly bodies, which are all fiery, ride the air because of their flatness.\"Hippolytus, Refutation of all Heresies, i. 7; Cf. Aristotle, De Caelo, 294b13–21 Xenophanes of Colophon (c. 500 BC) thought that the Earth was flat, with its upper side touching the air, and the lower side extending without limit.Xenophanes DK 21B28, quoted in Achilles, Introduction to Aratus 4\n\nBelief in a flat Earth continued into the 5th century BC. Anaxagoras (c. 450 BC) agreed that the Earth was flat,Diogenes Laertius, ii. 8 and his pupil Archelaus believed that the flat Earth was depressed in the middle like a saucer, to allow for the fact that the Sun does not rise and set at the same time for everyone.Hippolytus, Refutation of all Heresies, i. 9\n\nHistorians\n\nHecataeus of Miletus believed the earth was flat and surrounded by water.FGrH F 18a. Herodotus in his Histories ridiculed the belief that water encircled the world,Herodotus knew of the conventional view, according to which the river Ocean runs around a circular flat earth (4.8), and of the division of the world into three - Jacoby, RE Suppl. 2.352 ff yet rejected this personal belief (Histories, 2. 21; 4. 8; 4. 36) yet most classicists agree he still believed the earth was flat because of his descriptions of literal \"ends\" or \"edges\" of the earth.The history of Herodotus, George Rawlinson, Appleton and company, 1889, p. 409\n\nEurope\n\nThe ancient Norse and Germanic peoples believed in a flat Earth cosmography with the Earth surrounded by an ocean, with the axis mundi, a world tree (Yggdrasil), or pillar (Irminsul) in the centre.The Sacred Tree in Religion and Myth, Mrs. J. H. Philpot, Courier Dover Publications, 2004, p. 113.\"The world was a flat disk, with the earth in the center and the sea all around. Thus the serpent is about as far away from the center, where men and gods lived\" (Norse mythology: a guide to the Gods, heroes, rituals, and beliefs, John Lindow Oxford University Press, 2002) p. 253. In the world-encircling ocean sat a snake called Jormungandr.One of the earliest literary references to the world encircling water snake comes from Bragi Boddason who lived in the 9th century, in his Ragnarsdrápa (XIV) The Norse creation account preserved in Gylfaginning (VIII) states that during the creation of the earth, an impassable sea was placed around it:\n\nThe late Norse Konungs skuggsjá, on the other hand, infers a spherical Earth:\n\nEast Asia\n\nIn ancient China, the prevailing belief was that the Earth was flat and square, while the heavens were round,Needham, Joseph (1986). Science and Civilization in China: Volume 3. Taipei: Caves Books, Ltd. pp. 498. an assumption virtually unquestioned until the introduction of European astronomy in the 17th century. The English sinologist Cullen emphasizes the point that there was no concept of a round Earth in ancient Chinese astronomy:\nChinese thought on the form of the earth remained almost unchanged from early times until the first contacts with modern science through the medium of Jesuit missionaries in the seventeenth century. While the heavens were variously described as being like an umbrella covering the earth (the Kai Tian theory), or like a sphere surrounding it (the Hun Tian theory), or as being without substance while the heavenly bodies float freely (the Hsüan yeh theory), the earth was at all times flat, although perhaps bulging up slightly.\n\nThe model of an egg was often used by Chinese astronomers such as Zhang Heng (78–139 AD) to describe the heavens as spherical:\n The heavens are like a hen's egg and as round as a crossbow bullet; the earth is like the yolk of the egg, and lies in the centre.\n\nThis analogy with a curved egg led some modern historians, notably Joseph Needham, to conjecture that Chinese astronomers were, after all, aware of the Earth's sphericity. The egg reference, however, was rather meant to clarify the relative position of the flat earth to the heavens:\n\nIn a passage of Zhang Heng's cosmogony not translated by Needham, Zhang himself says: \"Heaven takes its body from the Yang, so it is round and in motion. Earth takes its body from the Yin, so it is flat and quiescent\". The point of the egg analogy is simply to stress that the earth is completely enclosed by heaven, rather than merely covered from above as the Kai Tian describes. Chinese astronomers, many of them brilliant men by any standards, continued to think in flat-earth terms until the seventeenth century; this surprising fact might be the starting-point for a re-examination of the apparent facility with which the idea of a spherical earth found acceptance in fifth-century BC Greece.\n\nFurther examples cited by Needham supposed to demonstrate dissenting voices from the ancient Chinese consensus actually refer without exception to the Earth being square, not to it being flat. Accordingly, the 13th-century scholar Li Ye, who argued that the movements of the round heaven would be hindered by a square Earth, did not advocate a spherical Earth, but rather that its edge should be rounded off so as to be circular. However, Needham disagrees, affirming that Li Ye believed the earth to be spherical, similar in shape to the heavens but much smaller.Needham, Joseph; Wang, Ling. (1995) [1959]. Science and Civilization in China: Mathematics and the Sciences of the Heavens and the Earth, vol. 3, reprint edition. Cambridge: Cambridge University Press. , p. 498. This was preconceived by the 4th-century scholar Yu Xi, who argued for the infinity of outer space surrounding the Earth and that the latter could be either square or round, in accordance to the shape of the heavens.Needham, Joseph; Wang, Ling. (1995) [1959]. Science and Civilization in China: Mathematics and the Sciences of the Heavens and the Earth, vol. 3, reprint edition. Cambridge: Cambridge University Press. , pp. 220, 498. When Chinese geographers of the 17th century, influenced by European cartography and astronomy, showed the earth as a sphere that could be circumnavigated by sailing around the globe, they did so with formulaic terminology previously used by Zhang Heng to describe the spherical shape of the sun and moon (i.e. that they were as round as a crossbow bullet).Needham, Joseph; Wang, Ling. (1995) [1959]. Science and Civilization in China: Mathematics and the Sciences of the Heavens and the Earth, vol. 3, reprint edition. Cambridge: Cambridge University Press. , pp. 227, 499.\n\nAs noted in the book Huainanzi,Joseph Needham, p. 225 in the 2nd century BC Chinese astronomers effectively inverted Eratosthenes' calculation of the curvature of the Earth to calculate the height of the sun above the earth. By assuming the earth was flat, they arrived at a distance of 100,000 li (approximately 200,000 km).  The Zhoubi Suanjing also discusses how to determine the distance of the Sun by measuring the length of noontime shadows at different latitudes, a method similar to Eratosthenes' measurement of the circumference of the Earth, but the Zhoubi Suanjing assumes that the Earth is flat.\n\nAlternate or mixed theories\n\nGreece: Spherical earth\n\nPythagoras in the 6th-century BC and Parmenides in the 5th-century stated that the Earth is spherical,\n the spherical view spread rapidly in the Greek world. Around 330 BC, Aristotle maintained on the basis of physical theory and observational evidence that the Earth was spherical, and reported on an estimate on the circumference.On the Heavens, Book ii Chapter 14.  The Earth's circumference was first determined around 240 BC by Eratosthenes. By the second century AD, Ptolemy had derived his maps from a globe and developed the system of latitude, longitude, and climes. His Almagest was written in Greek and only translated into Latin in the 11th century from Arabic translations.\n\n In the 2nd century BC, Crates of Mallus devised a terrestrial sphere that divided the Earth into four continents, separated by great rivers or oceans, with people presumed living in each of the four regions. Opposite the oikumene, the inhabited world, were the antipodes, considered unreachable both because of an intervening torrid zone (equator) and the ocean. This took a strong hold on the medieval mind.\n\nLucretius (1st century BC) opposed the concept of a spherical Earth, because he considered that an infinite universe had no center towards which heavy bodies would tend. Thus, he thought the idea of animals walking around topsy-turvy under the Earth was absurd.Lucretius, De rerum natura, 1.1052–82. By the 1st century AD, Pliny the Elder was in a position to claim that everyone agreed on the spherical shape of Earth,Natural History, 2.64 though disputes continued regarding the nature of the antipodes, and how it is possible to keep the ocean in a curved shape. Pliny also considered the possibility of an imperfect sphere \"shaped like a pinecone\".\n\nIn late antiquity such widely read encyclopedists as Macrobius and Martianus Capella (both 5th century AD) discussed the circumference of the sphere of the Earth, its central position in the universe, the difference of the seasons in northern and southern hemispheres, and many other geographical details., translated in  In his commentary on Cicero's Dream of Scipio, Macrobius described the Earth as a globe of insignificant size in comparison to the remainder of the cosmos.\n\nSouth Asia\n\nThe Vedic texts depict the cosmos in many ways., Quote: \"The Vedic texts contain several depictions of the shape of the cosmos. The Rigveda alone contains two basic images of the cosmos: a bipartite cosmos, consisting of the two spheres of heavens and earth, and a tripartite cosmos consisting of the three spheres of heavens and earth (...)\" The earliest Indian cosmological texts picture the earth as one of a stack of flat disks.\n\nIn the Vedic texts, Dyaus (heaven) and Prithvi (earth) are compared to wheels on an axle, yielding a flat model. They are also described as bowls or leather bags, yielding a concave model. According to Macdonell, \"the conception of the earth being a disc surrounded by an ocean does not appear in the Samhitas. But it was naturally regarded as circular, being compared with a wheel (10.89) and expressly called circular (parimandala) in the Shatapatha Brahmana.\"\n\nBy about the 5th century CE, the siddhanta astronomy texts of South Asia, particularly of Aryabhata, assume a spherical earth as they develop mathematical methods for quantitative astronomy for calendar and time keeping.\n\nThe medieval Indian texts called the Puranas describe the earth as a flat-bottomed, circular disk with concentric oceans and continents.D. Pingree: \"History of Mathematical Astronomy in India\", Dictionary of Scientific Biography, Vol. 15 (1978), pp. 533–633 (554ff.), Quote: \"In the Purānas, the earth is a flat-bottomed, circular disk, in the center of which is a lofty mountain, Meru. Surrounding Meru is the circular continent Jambūdvīpa, which is in turn surrounded by a ring of water known as the Salt Ocean. There follow alternating rings of land and sea until there are seven continents and seven oceans. In the southern quarter of Jambūdvīpa lies India–Bhāratavarsa. This general scheme is present not only in the Hindu cosmologies but also in Buddhist and Jain cosmologies of South Asia. However, some Puranas include other models. For example, the fifth canto of the Bhagavata Purana, includes sections that describe the earth both as flat and spherical.\n\nIt has long been debated how and when the spherical conception arose in Indian astronomical models. Detailed records, particularly about the observational practices have not survived. The Greek text which possibly influenced the Indian astronomers in early medieval period is also unknown, and there is \"no textual evidence for any significant transmissions of Western astronomy between the early first millennium and the early second\". While the textual evidence has not survived, the precision of the constants used in pre-Greek Vedanga models, and the model's accuracy in predicting moon and sun's motion for Vedic rituals, probably came from direct astronomical observations. The cosmographic theories and assumptions in ancient India likely developed independently and in parallel, but these were influenced by some unknown quantitative Greek astronomy text in the medieval era.\n\nEarly Christian Church\n\nDuring the early Church period, the spherical view continued to be widely held, with some notable exceptions.\n\nEarly Christian beliefs mention a number of ideas about the shape of the earth. Athenagoras, an eastern Christian writing around the year 175 CE said, \"The world, being made spherical, is confined within the circles of heaven.\" Methodius (c. 290 AD), an eastern Christian writing against \"the theory of the Chaldeans and the Egyptians\" who asserted that the earth was spherical  said, \"Let us first lay bare ... the theory of the Chaldeans and the Egyptians. They say that the circumference of the universe is likened to the turnings of a well-rounded globe, the earth being a central point. They say that since its outline is spherical, ... the earth should be the center of the universe, around which the heaven is whirling.\" Lactantius, a western Christian writer and advisor to the first Christian Roman Emperor, Constantine, and writing sometime between 304–313 CE, ridiculed the notion of Antipodes and the philosophers who fancied that \"the universe is round like a ball. They also thought that heaven revolves in accordance with the motion of the heavenly bodies. ... For that reason, they constructed brass globes, as though after the figure of the universe. ... I am at a loss as to what to say concerning those who, once they have erred, continue in their folly, defending one vain thing by another vain thing.\"Lactantius, [http://www.ccel.org/ccel/schaff/anf07.iii.ii.iii.xxiv.html The Divine Institutes, Book III, Chapter XXIV], The Ante-Nicene Fathers, Vol VII, ed. Rev. Alexander Roberts, D.D., and James Donaldson, LL.D., American reprint of the Edinburgh edition (1979), William B. Eerdmans Publishing Co., Grand Rapids, MI, pp. 94–95. Arnobius, another eastern Christian writing sometime around 305 CE, said, \"In the first place, indeed, the world itself is neither right nor left. It has neither upper nor lower regions, nor front nor back. For whatever is round and bounded on every side by the circumference of a solid sphere, has no beginning or end ...\"\n\nThe influential theologian and philosopher Saint Augustine, one of the four Great Church Fathers of the Western Church, similarly objected to the \"fable\" of an inhabited Antipodes:\n\nThe view generally accepted by scholars of Augustine's work is that he shared the common view of his contemporaries that the Earth is spherical, in line with his endorsement of science in De Genesi ad litteram. That view has been challenged:\n\nYet other historians, however, do not view Augustine's scriptural commentaries as endorsing any particular cosmological model.\n\nDiodorus of Tarsus, a leading figure in the School of Antioch and mentor of John Chrysostom, may have argued for a flat Earth; however, Diodorus' opinion on the matter is known only from a later criticism.J. L. E. Dreyer, A History of Planetary Systems from Thales to Kepler. (1906); unabridged republication as A History of Astronomy from Thales to Kepler (New York: Dover Publications, 1953). Chrysostom, one of the four Great Church Fathers of the Eastern Church and Archbishop of Constantinople, explicitly espoused the idea, based on scripture, that the Earth floats miraculously on the water beneath the firmament.St. John Chrysostom, Homilies Concerning the Statues, Homily IX, paras. 7–8, in A Select Library of the Nicene and Post-Nicene Fathers of the Christian Church, Series I, Vol IX, ed. Philip Schaff, D.D., LL.D., American reprint of the Edinburgh edition (1978), W. B. Eerdmans Publishing Co.,Grand Rapids, MI, [https://archive.org/stream/aselectlibrary09unknuoft#page/403/mode/1up pp. 403–04].\n\"When therefore thou beholdest not a small pebble, but the whole earth borne upon the waters, and not submerged, admire the power of Him who wrought these marvellous things in a supernatural manner! And whence does this appear, that the earth is borne upon the waters? The prophet declares this when he says, 'He hath founded it upon the seas, and prepared it upon the floods.'1416 And again: 'To him who hath founded the earth upon the waters.'1417 What sayest thou? The water is not able to support a small pebble on its surface, and yet bears up the earth, great as it is; and mountains, and hills, and cities, and plants, and men, and brutes; and it is not submerged!\" Athanasius the Great, Church Father and Patriarch of Alexandria,  expressed a similar view in Against the Heathen.St. Athanasius, Against the Heathen, Ch.27 [http://www.ccel.org/ccel/schaff/npnf204.vi.ii.i.xxvii.html], Ch 36 [http://www.ccel.org/ccel/schaff/npnf204.vi.ii.iii.ii.html], in A Select Library of the Nicene and Post-Nicene Fathers of the Christian Church, Series II, Vol IV, ed. Philip Schaff, D.D., LL.D., American reprint of the Edinburgh edition (1978), W.B. Eerdmans Publishing Co.,Grand Rapids, MI.\n\nChristian Topography (547) by the Alexandrian monk Cosmas Indicopleustes, who had travelled as far as Sri Lanka and the source of the Blue Nile, is now widely considered the most valuable geographical document of the early medieval age, although it received relatively little attention from contemporaries. In it, the author repeatedly expounds the doctrine that the universe consists of only two places, the Earth below the firmament and heaven above it. Carefully drawing on arguments from scripture, he describes the Earth as a rectangle, 400 days' journey long by 200 wide, surrounded by four oceans and enclosed by four massive walls which support the firmament. The spherical Earth theory is contemptuously dismissed as \"pagan\".\n\nSeverian, Bishop of Gabala (d. 408), wrote that the Earth is flat and the sun does not pass under it in the night, but \"travels through the northern parts as if hidden by a wall\".J.L.E. Dreyer (1906), [https://books.google.com/books?idBTI9AAAAIAAJ&pg\nPA211 A History of Planetary Systems], (1906), [http://www.roger-pearse.com/weblog/?p=3921 pp. 211–212]. Basil of Caesarea (329–379) argued that the matter was theologically irrelevant.\n\nEurope: Early Middle Ages\n\nEarly medieval Christian writers in the early Middle Ages felt little urge to assume flatness of the earth, though they had fuzzy impressions of the writings of Ptolemy, Aristotle, and relied more on Pliny.\n\nWith the end of Roman civilization, Western Europe entered the Middle Ages with great difficulties that affected the continent's intellectual production. Most scientific treatises of classical antiquity (in Greek) were unavailable, leaving only simplified summaries and compilations. Still, many textbooks of the Early Middle Ages supported the sphericity of the Earth. For example: some early medieval manuscripts of Macrobius include maps of the Earth, including the antipodes, zonal maps showing the Ptolemaic climates derived from the concept of a spherical Earth and a diagram showing the Earth (labeled as globus terrae, the sphere of the Earth) at the center of the hierarchically ordered planetary spheres.B. Eastwood and G. Graßhoff, Planetary Diagrams for Roman Astronomy in Medieval Europe, ca. 800–1500, Transactions of the American Philosophical Society, 94, 3 (Philadelphia, 2004), pp. 49–50. Further examples of such medieval diagrams can be found in medieval manuscripts of the Dream of Scipio. In the Carolingian era, scholars discussed Macrobius's view of the antipodes. One of them, the Irish monk Dungal, asserted that the tropical gap between our habitable region and the other habitable region to the south was smaller than Macrobius had believed.Bruce S. Eastwood, Ordering the Heavens: Roman Astronomy and Cosmology in the Carolingian Renaissance, (Leiden: Brill, 2007), pp. 62–63.\n\nEurope's view of the shape of the Earth in Late Antiquity and the Early Middle Ages may be best expressed by the writings of early Christian scholars:\n\nA possible non-literary but graphic indication that people in the Middle Ages believed that the Earth (or perhaps the world) was a sphere is the use of the orb (globus cruciger) in the regalia of many kingdoms and of the Holy Roman Empire. It is attested from the time of the Christian late-Roman emperor Theodosius II (423) throughout the Middle Ages; the Reichsapfel was used in 1191 at the coronation of emperor Henry VI. However the word 'orbis' means 'circle' and there is no record of a globe as a representation of the Earth since ancient times in the west till that of Martin Behaim in 1492. Additionally it could well be a representation of the entire 'world' or cosmos.\n\nA recent study of medieval concepts of the sphericity of the Earth noted that \"since the eighth century, no cosmographer worthy of note has called into question the sphericity of the Earth\". However, the work of these intellectuals may not have had significant influence on public opinion, and it is difficult to tell what the wider population may have thought of the shape of the Earth, if they considered the question at all.\n\nEurope: Late Middle Ages\n\nHermannus Contractus (1013–1054) was among the earliest Christian scholars to estimate the circumference of Earth with Eratosthenes' method. Thomas Aquinas (1225–1274), the most important and widely taught theologian of the Middle Ages, believed in a spherical Earth; and he even took for granted his readers also knew the Earth is round. In his Summa Theologica he wrote, \"The physicist proves the earth to be round by one means, the astronomer by another: for the latter proves this by means of mathematics, e.g. by the shapes of eclipses, or something of the sort; while the former proves it by means of physics, e.g. by the movement of heavy bodies towards the center, and so forth.\" Lectures in the medieval universities commonly advanced evidence in favor of the idea that the Earth was a sphere. Also, On the Sphere of the World, the most influential astronomy textbook of the 13th century and required reading by students in all Western European universities, described the world as a sphere.\n\nThe shape of the Earth was not only discussed in scholarly works written in Latin; it was also treated in works written in vernacular languages or dialects and intended for wider audiences. The Norwegian book Konungs Skuggsjá, from around 1250, states clearly that the Earth is spherical – and that there is night on the opposite side of the Earth when there is daytime in Norway. The author also discusses the existence of antipodes – and he notes that (if they exist) they see the Sun in the north of the middle of the day, and that they experience seasons opposite those of people in the Northern Hemisphere.\n\nHowever Tattersall shows that in many vernacular works in 12th- and 13th-century French texts the Earth was considered \"round like a table\" rather than \"round like an apple\". \"In virtually all the examples quoted ... from epics and from non-'historical' romances (that is, works of a less learned character) the actual form of words used suggests strongly a circle rather than a sphere\", though he notes that even in these works the language is ambiguous.\n\nPortuguese navigation down and around the coast of Africa in the latter half of the 1400s gave wide-scale observational evidence for Earth's sphericity. In these explorations, the sun's position moved more northward the further south the explorers travel. Its position directly overhead at noon gave evidence for crossing the equator. These apparent solar motions in detail were more consistent with north-south curvature and a distant sun, than with any flat-earth explanation. The ultimate demonstration came when Ferdinand Magellan's expedition completed the first global circumnavigation in 1521. Antonio Pigafetta, one of the few survivors of the voyage, recorded the loss of a day in the course of the voyage, giving evidence for east-west curvature. No flat-earth theory could reconcile the daily apparent motions of the sun with the ability to sail around the world, and the loss of a day could make no sense, either.\n\nMiddle East: Islamic scholars\n\nThe Abbasid Caliphate saw a great flowering of astronomy and mathematics in the 9th century AD, in which Muslim scholars translated Ptolemy's work, which became the Almagest, and extended and updated his work based on spherical ideas. Since then, these have generally been respected.\n\nThe Quran mentions that the Earth (al-arḍ) was \"spread out\".For example, see verses , , , and . To this 12th-century commentary, the Tafsir al-Kabir (al-Razi) by Fakhr al-din al-Razi, states \"If it is said: Do the words 'And the earth We spread out' indicate that it is flat? We would respond: Yes, because the earth, even though it is round, is an enormous sphere, and each little part of this enormous sphere, when it is looked at, appears to be flat. As that is the case, this will dispel what they mentioned of confusion. The evidence for that is the verse in which Allah says (interpretation of the meaning): 'And the mountains as pegs' [an-Naba’ 78:7]. He called them awtaad (pegs) even though these mountains may have large flat surfaces. And the same is true in this case.\"\n\nThe 11th century Ibn Hazm stated, \"Evidence shows that the Earth is a sphere but public people say the opposite.\" He added, \"None of those who deserve being Imams for Muslims has denied that Earth is round. And we have not received anything indicates a denial, not even a single word.\"\n\nMing Dynasty in China\n\nA spherical terrestrial globe was introduced to Yuan-era Khanbaliq (i.e. Beijing) in 1267 by the Persian astronomer Jamal ad-Din, but it is not known to have made an impact on the traditional Chinese conception of the shape of the Earth.(cf. Joseph Needham et al.: \"Heavenly clockwork: the great astronomical clocks of medieval China\", Antiquarian Horological Society, 2nd. ed., Vol. 1, 1986, , p. 138) As late as 1595, an early Jesuit missionary to China, Matteo Ricci, recorded that the Ming-dynasty Chinese say: \"The earth is flat and square, and the sky is a round canopy; they did not succeed in conceiving the possibility of the antipodes.\" The universal belief in a flat Earth is confirmed by a contemporary Chinese encyclopedia from 1609 illustrating a flat Earth extending over the horizontal diametral plane of a spherical heaven. \n\nIn the 17th century, the idea of a spherical Earth spread in China due to the influence of the Jesuits, who held high positions as astronomers at the imperial court.Needham, Joseph (1986). Science and Civilization in China: Volume 3. Taipei: Caves Books, Ltd. pp. 499. Matteo Ricci, in collaboration with Chinese cartographers and translator Li Zhizao, published the Kunyu Wanguo Quantu in 1602, the first Chinese world map based on European discoveries. The astronomical and geographical treatise Gezhicao (格致草) written in 1648 by Xiong Mingyu (熊明遇) explained that the Earth was spherical, not flat or square, and could be circumnavigated.\n\nMyth of the flat Earth \n\nBeginning in the 19th century, a historical myth arose which held that the predominant cosmological doctrine during the Middle Ages was that the Earth was flat.  An early proponent of this myth was the American writer Washington Irving, who maintained that Christopher Columbus had to overcome the opposition of churchmen to gain sponsorship for his voyage of exploration.  Later significant advocates of this view were John William Draper and Andrew Dickson White, who used it as a major element in their advocacy of the thesis that there was a long lasting and essential conflict between science and religion. Subsequent studies of medieval science have shown that most scholars in the Middle Ages, including those read by Christopher Columbus, maintained that the Earth was spherical.  Studies of the historical connections between science and religion have demonstrated that theories of their mutual antagonism ignore examples of their mutual support.\n\nModern Flat-Earthers\n\nIn the modern era, the pseudoscientific belief in a flat Earth has been expressed by a variety of individuals and groups:\n* English writer Samuel Rowbotham (1816–1885), writing under the pseudonym \"Parallax\", produced a pamphlet called Zetetic Astronomy in 1849 arguing for a flat Earth and published results of many experiments that tested the curvatures of water over a long drainage ditch, followed by another called The inconsistency of Modern Astronomy and its Opposition to the Scripture. One of his supporters, John Hampden, lost a bet to Alfred Russel Wallace in the famous Bedford Level Experiment, which attempted to prove it. In 1877 Hampden produced a book called \"A New Manual of Biblical Cosmography\".\n Rowbotham also produced studies that purported to show that the effects of ships disappearing below the horizon could be explained by the laws of perspective in relation to the human eye. In 1883 he founded Zetetic Societies in England and New York, to which he shipped a thousand copies of Zetetic Astronomy.\n* William Carpenter, a printer originally from Greenwich, England (home of the Royal Observatory and central to the study of astronomy), was a supporter of Rowbotham.  Carpenter published Theoretical Astronomy Examined and Exposed – Proving the Earth not a Globe in eight parts from 1864 under the name Common Sense.  He later emigrated to Baltimore, where he published A hundred proofs the Earth is not a Globe in 1885.William Carpenter, One hundred proofs that the earth is not a globe, (Baltimore: The author, 1885).[https://www.gutenberg.org/files/55387/55387-h/55387-h.htm]  He said \"There are rivers that flow for hundreds of miles towards the level of the sea without falling more than a few feet – notably, the Nile, which, in a thousand miles, falls but a foot. A level expanse of this extent is quite incompatible with the idea of the Earth's convexity. It is, therefore, a reasonable proof that Earth is not a globe\", as well as \"If the Earth were a globe, a small model globe would be the very best – because the truest – thing for the navigator to take to sea with him. But such a thing as that is not known: with such a toy as a guide, the mariner would wreck his ship, of a certainty!, This is a proof that Earth is not a globe.\"\n* John Jasper, an American slave turned prolific preacher, echoed his friend Carpenter's sentiments in his most famous sermon \"Der Sun do move\", preached over 250 times, always by invitation.\"Low me ter ax ef de earth is roun', whar do it keep its corners? Er flat, squar thing has corners, but tell me where is de cornur uv er appul, ur a marbul, ur a cannun ball, ur a silver dollar.\"  See also Garwood, p165\n* In Brockport, New York, in 1887, M.C. Flanders argued the case of a flat Earth for three nights against two scientific gentlemen defending sphericity. Five townsmen chosen as judges voted unanimously for a flat Earth at the end. The case was reported in the Brockport Democrat.The Earth: Scripturally, Rationally, and Practically Described. A Geographical, Philosophical, and Educational Review, Nautical Guide, and General Student's Manual, n. 17 (November 1, 1887), p. 7. cited in \n* Professor Joseph W. Holden of Maine, a former justice of the peace, gave numerous lectures in New England and lectured on flat Earth theory at the Columbian Exposition in Chicago. His fame stretched to North Carolina where the Statesville Semi-weekly Landmark recorded at his death in 1900: \"We hold to the doctrine that the earth is flat ourselves and we regret exceedingly to learn that one of our members is dead.\"\n* After Rowbotham's death, Lady Elizabeth Blount (Elizabeth de Sodington Blount, née Elizabeth Anne Mould Williams) created the Universal Zetetic Society in 1893 in England and created a journal called Earth not a Globe Review, which sold for twopence, as well as one called Earth, which only lasted from 1901 to 1904. She held that the Bible was the unquestionable authority on the natural world and argued that one could not be a Christian and believe the Earth is a globe. Well-known members included E. W. Bullinger of the Trinitarian Bible Society, Edward Haughton, senior moderator in natural science in Trinity College, Dublin and an archbishop. She repeated Rowbotham's experiments, generating some interesting counter-experiments, but interest declined after the First World War. The movement gave rise to several books that argued for a flat, stationary earth, including Terra Firma by David Wardlaw Scott.\n* In 1898, during his solo circumnavigation of the world, Joshua Slocum encountered a group of flat-Earthers in Durban, South Africa. Three Boers, one of them a clergyman, presented Slocum with a pamphlet in which they set out to prove that the world was flat. Paul Kruger, President of the Transvaal Republic, advanced the same view: \"You don't mean round the world, it is impossible! You mean in the world. Impossible!\"Joshua Slocum, Sailing Alone Around the World, (New York: The Century Company, 1900), chaps. 17–18.[http://www.ibiblio.org/eldritch/js/saaw.htm]\n* Wilbur Glenn Voliva, who in 1906 took over the Christian Catholic Church, a Pentecostal sect that established a utopian community at Zion, Illinois, preached flat Earth doctrine from 1915 onwards and used a photograph of a twelve-mile stretch of the shoreline at Lake Winnebago, Wisconsin taken three feet above the waterline to prove his point. When the airship Italia disappeared on an expedition to the North Pole in 1928 he warned the world's press that it had sailed over the edge of the world. He offered a $5,000 award for proving the Earth is not flat, under his own conditions. Teaching a globular Earth was banned in the Zion schools and the message was transmitted on his WCBD radio station.\n\nFlat Earth Society\n\nIn 1956, Samuel Shenton set up the International Flat Earth Research Society (IFERS), better known as the Flat Earth Society from Dover, UK, as a direct descendant of the Universal Zetetic Society. This was just before the Soviet Union launched the first artificial satellite, Sputnik; he responded, \"Would sailing round the Isle of Wight prove that it were spherical? It is just the same for those satellites.\"\n\nHis primary aim was to reach children before they were convinced about a spherical Earth. Despite plenty of publicity, the space race eroded Shenton's support in Britain until 1967 when he started to become famous due to the Apollo program.\n\nIn 1972 Shenton's role was taken over by Charles K. Johnson, a correspondent  from California, US.  He incorporated the IFERS and steadily built up the membership to about 3,000.  He spent years examining the studies of flat and round Earth theories and proposed evidence of a conspiracy against flat Earth: \"The idea of a spinning globe is only a conspiracy of error that Moses, Columbus, and FDR all fought...\" His article was published in the magazine Science Digest, 1980.  It goes on to state, \"If it is a sphere, the surface of a large body of water must be curved.  The Johnsons have checked the surfaces of Lake Tahoe and the Salton Sea without detecting any curvature.\"\n\nThe Society declined in the 1990s following a fire at its headquarters in California and the death of Johnson in 2001. It was revived as a website in 2004 by Daniel Shenton (no relation to Samuel Shenton). He believes that no one has provided proof that the world is not flat.\n\nResurgence in the era of celebrity and social media\n\nIn the modern era, the proliferation of communications technology and social media platforms such as YouTube, Facebook and Twitter have given individuals, famous or otherwise, a platform to spread pseudo-scientific ideas and build stronger followings. The flat-earth conjecture has flourished in this environment.\n\nThe solar eclipse of August 21, 2017, gave rise to numerous YouTube videos purporting to show how the details of the eclipse prove the earth is flat. Also in 2017, a scandal developed in Arab scientific and educational circles when a Tunisian PhD student submitted a thesis declaring Earth to be flat, unmoving, the center of the universe, and only 13,500 years of age.\n\nCultural references\n\nThe term flat-Earther is often used in a derogatory sense to mean anyone who holds ridiculously antiquated views. The first use of the term flat-earther recorded by the Oxford English Dictionary is in 1934 in Punch: \"Without being a bigoted flat-earther, [Mercator] perceived the nuisance ... of fiddling about with globes ... in order to discover the South Seas.\"\n\n The term flat-earth-man was recorded in 1908: \"Fewer votes than one would have thought possible for any human candidate, were he even a flat-earth-man.\". Flat Earth. http://en.wikipedia.org/?curid=11593."
  }
}
