{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12304",
  "eid" : "01a24c30-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778511987,
  "textBody" : "The title Grandmaster (GM) is awarded to chess players by the world chess organization FIDE. Apart from World Champion, Grandmaster is the highest title a chess player can attain.\n\nOnce achieved, the title is held for life. The abbreviation IGM for International Grandmaster is also sometimes used, particularly in older literature.\n\nThe title of Grandmaster, along with the lesser FIDE titles of International Master (IM) and FIDE Master (FM), is open to both men and women. The vast majority of grandmasters are men, but a number of women have also earned the GM title, with the first three having been Nona Gaprindashvili in 1978, Maia Chiburdanidze in 1984http://ratings.fide.com/card.phtml?event=13600036 and Susan Polgar in 1991. Since about 2000, most of the top 10 women have held the GM title.\nThere is also a Woman Grandmaster title with lower requirements awarded only to women.\n\nFIDE awards separate Grandmaster titles to composers and solvers of chess problems (see List of grandmasters for chess composition). The International Correspondence Chess Federation (ICCF) awards the title of International Correspondence Chess Grandmaster (ICCGM).\n\nHistory\n\nThe first known use of the term grandmaster in connection with chess was in an 1838 issue of Bell's Life, in which a correspondent referred to William Lewis as \"our past grandmaster\". Lewis himself later referred to Philidor as a grandmaster, and the term was also applied to a few other players.\n\nEarly tournament use\n\nIn the Ostend tournament of 1907 the term grandmaster (Großmeister in German) was used. The tournament was divided into two sections: the Championship Tournament and the Masters' Tournament. The Championship section was for players who had previously won an international tournament. Siegbert Tarrasch won the Championship section, over Carl Schlechter, Dawid Janowski, Frank Marshall, Amos Burn, and Mikhail Chigorin. These players were described as grandmasters for the purposes of the tournament.\n\nThe San Sebastián 1912 tournament won by Akiba Rubinstein was a designated grandmaster event. Rubinstein won with 12½ points out of 19. Tied for second with 12 points were Aron Nimzowitsch and Rudolf Spielmann.\n\nBy some accounts, in the St. Petersburg 1914 chess tournament, the title \"Grandmaster\" was formally conferred by Russian Tsar Nicholas II, who had partially funded the tournament. The Tsar reportedly awarded the title to the five finalists: Emanuel Lasker, José Raúl Capablanca, Alexander Alekhine, Siegbert Tarrasch, and Frank Marshall. Chess historian Edward Winter has questioned this, stating that the earliest known sources that support this story are an article by Robert Lewis Taylor in the June 15, 1940, issue of The New Yorker and Marshall's autobiography My 50 Years of Chess (1942).\n\nNon-standard and Soviet usage before 1950\n\nBefore 1950, the term grandmaster was sometimes informally applied to other world class players. The Fédération Internationale des Échecs (FIDE, or World Chess Federation) was formed in Paris in 1924, but at that time did not formulate criteria on who should earn the title.\n\nIn 1927, the Soviet Union's Chess Federation established the title of Grandmaster of the Soviet Union, for their own players, since at that time Soviets were not competing outside their own country. This title was abolished in 1931, after having been awarded to Boris Verlinsky, who won the 1929 Soviet Championship. The title was brought back in 1935, and awarded to Mikhail Botvinnik, who thus became the first \"official\" Grandmaster of the USSR. Verlinsky did not get his title back.\n\nOfficial status (1950 onwards)\n\nWhen FIDE reorganized after World War II it adopted regulations concerning the award of international titles. Titles were awarded by a resolution of the FIDE General Assembly and the Qualification Committee. FIDE first awarded the Grandmaster title in 1950 to 27 players. These players were:\n* The top players of the day: world champion Mikhail Botvinnik, and those who had qualified for (or been seeded into) the inaugural Candidates Tournament in 1950: Isaac Boleslavsky, Igor Bondarevsky, David Bronstein, Max Euwe, Reuben Fine, Salo Flohr, Paul Keres, Alexander Kotov, Andor Lilienthal, Miguel Najdorf, Samuel Reshevsky, Vasily Smyslov, Gideon Ståhlberg, and László Szabó.\n* Players still living who, though past their best in 1950, were recognised as having been world class when at their peak: Ossip Bernstein, Oldřich Duras, Ernst Grünfeld, Boris Kostić, Grigory Levenfish, Géza Maróczy, Jacques Mieses, Viacheslav Ragozin, Akiba Rubinstein, Friedrich Sämisch, Savielly Tartakower, and Milan Vidmar.\n\nSince FIDE did not award the Grandmaster title posthumously, world-class players who died prior to 1950, including World Champions Steinitz, Lasker, Capablanca, and Alekhine, never received the title.\n\n1953 regulations\n\nTitle awards under the original regulations were subject to political concerns. Efim Bogoljubov, who had emigrated from the Soviet Union to Germany, was not entered in the first class of Grandmasters, even though he had played two matches for the World Championship with Alekhine. He received the title in 1951, by a vote of thirteen to eight with five abstentions. Yugoslavia supported his application, but all other Communist countries opposed it. In 1953, FIDE abolished the old regulations, although a provision was maintained that allowed older masters who had been overlooked to be awarded titles. The new regulations awarded the title of International Grandmaster of the FIDE to players meeting any of the following criteria:\n# The world champion.\n# Masters who have the absolute right to play in the World Championship Candidates Tournament, or any player who replaces an absent contestant and earns at least a 50 percent score.\n# The winner of an international tournament meeting specified standards, and any player placing second in two such tournaments within a span of four years. The tournament must be at least eleven rounds with seven or more players, 80 percent or more being International Grandmasters or International Masters. Additionally, 30 percent of the players must be Grandmasters who have the absolute right to play in the next World Championship Candidates Tournament, or who have played in such a tournament in the previous ten years.\n# A player who demonstrates ability manifestly equal to that of (3) above in an international tournament or match. Such titles must be approved by the Qualification Committee with the support of at least five members.\n\n1957 regulations\n\nAfter FIDE issued the 1953 title regulations, it was recognized that they were somewhat haphazard, and work began to revise the regulations. The FIDE Congress in Vienna in 1957 adopted new regulations, called the FAV system, in recognition of the work done by International Judge Giovanni Ferrantes (Italy), Alexander (probably Conel Hugh O'Donel Alexander), and Giancarlo Dal Verme (Italy). Under the 1957 regulations, the title of International Grandmaster of the FIDE was automatically awarded to:\n# The world champion.\n# Any player qualifying from the Interzonal tournament to play in the Candidates Tournament, even if he did not play in the Candidates for any reason.\n# Any player who would qualify from the Interzonal to play in the Candidates but who was excluded because of a limitation on the number of participants from his Federation.\n# Any player who actually plays in a Candidates Tournament and scores at least 33⅓ percent.\nThe regulations also allowed titles to be awarded by a FIDE Congress on recommendation by the Qualification Committee. Recommendations were based on performance in qualifying tournaments, with the required score depending on the percentage of Grandmasters and International Masters in the tournament.\n\n1965 regulations\n\nConcerns were raised that the 1957 regulations were too lax. At the FIDE Congress in 1961, GM Milan Vidmar said that the regulations \"made it possible to award international titles to players without sufficient merit\". At the 1964 Congress in Tel Aviv, a subcommittee was formed to propose changes to the regulations. The subcommittee recommended that the automatic award of titles be abolished, criticized the methods used for awarding titles based on qualifying performances, and called for a change in the makeup of the Qualification Committee. Several delegates supported the subcommittee recommendations, including GM Miguel Najdorf who felt that existing regulations were leading to an inflation of international titles. At the 1965 Congress in Wiesbaden FIDE raised the standards required for international titles. The International Grandmaster title regulations were:\n* 1. Any World Champion is automatically awarded the GM title\n* 2a. Anyone who scores at least 40 percent in a quarter-final match in the Candidates Tournament\n* 2b. Scores at least the number of points in a tournament corresponding to the total of a 55 percent score against Grandmasters plus 75 percent against International Masters (IM) plus 85 percent against other players (a GM \"norm\").\n\nTo fulfill requirement 2b, the candidate must score one GM norm in a category 1a tournament or two norms within a three-year period in two Category 1b tournaments, or one Category 2a tournament and one Category 1b tournament.\n\nThe categories of tournaments are:\n* 1a—at least sixteen players, at least 50 percent are GMs, and 70 percent at least IMs\n* 1b—at least twelve players, at least 33⅓ percent GMs and 70 percent IMs\n* 2a—at least fifteen players, at least 50 percent IMs\n* 2b—ten to fourteen players, at least 50 percent IMs.\nSince FIDE titles are for life, a GM or IM does not count for the purposes of this requirement if he had not had a GM or IM result in the five years prior to the tournament.\n\nIn addition, no more than 50 percent plus one of the players can be from the same country for tournaments of 10 to 12 players, or no more than 50 percent plus two for larger tournaments.\n\nSeventy-four GM titles were awarded in 1951 through 1968. During that period, ten GM titles were awarded in 1965, but only one in 1966 and in 1968.\n\n1970 regulations\n\nThe modern system for awarding FIDE titles evolved from the \"Dorazil\" proposals, presented to the 1970 Siegen Chess Olympiad FIDE Congress. The proposals were put together by Dr Wilfried Dorazil (then FIDE Vice-President) and fellow Committee members Grandmaster Svetozar Gligorić and Professor Arpad Elo. The recommendations of the Committee report were adopted in full.\n\nIn essence, the proposals built on the work done by Professor Elo in devising his Elo rating system. The establishment of an updated list of players and their Elo rating enabled significantly strong international chess tournaments to be allocated a \"Category\", based on the average rating of the contestants. For instance, it was decided that 'Category 1' status would apply to tournaments with an average Elo rating of participants falling within the range 2251–2275; similarly Category 2 would apply to the range 2276–2300 etc. The higher the tournament Category, the stronger the tournament.\n\nAnother vital component involved the setting of meritorious \"scores\" for each Category of tournament. A player must meet or surpass the relevant score to demonstrate that they had performed at Grandmaster (GM) or International Master (IM) level. Scores were expressed as percentages of a perfect maximum score and decreased as the tournament Category increased, thereby reflecting the strength of a player's opposition and the relative difficulty of the task.\n\nTournament organisers could then apply the percentages to their own tournament format and declare in advance the actual score that participants must achieve to attain a GM or IM result (nowadays referred to as a norm).\n\nTo qualify for the Grandmaster title, a player needed to achieve three such GM results within a rolling period of three years. Exceptionally, if a player's contributory games totalled thirty or more, then the title could be awarded on the basis of two such results. There were also circumstances where the system could be adapted to fit team events and other competitions.\n\nThe full proposals included many other rules and regulations, covering such topics as:\n* Eligible tournament formats.\n* Eligible participants.\n* Unrated participants.\n* Registration of tournaments with FIDE.\n* Calculations, including the handling of fractions.\n\nHonorary grandmasters\n\nFrom 1977 until 2003, FIDE awarded honorary Grandmaster titles to 31 players based on their past performances or other contributions to chess. Since 2007, no distinction has been made between an \"honorary\" grandmaster and a full grandmaster. The following players have been awarded honorary Grandmaster titles:\n* 1977 - Julio Bolbochán, Esteban Canal, Borislav Milić, Carlos Torre Repetto\n* 1981 - Arnold Denker\n* 1982 - Lodewijk Prins, Raúl Sanguinetti\n* 1983 - Vladimir Alatortsev, Alexander Konstantinopolsky, Erik Lundin\n* 1984 - Eero Böök, Stojan Puc\n* 1985 - Harry Golombek, Mario Monticelli, Jaroslav Šajtar\n* 1986 - Arthur Dake, Theodor Ghiţescu\n* 1987 - Vladimir Makogonov, Vladas Mikėnas, Bogdan Śliwa\n* 1988 - George Koltanowski\n* 1990 - Andrija Fuderer, Rudolf Marić\n* 1991 - Dragoljub Minić\n* 1992 - Heinz Lehmann, Rudolf Teschner\n* 1993 - Jonathan Penrose\n* 1996 - Károly Honfi, Enrico Paoli\n* 1999 - Péter Dely\n* 2003 - Elmārs Zemgalis\n\nCurrent regulations\n\nThe requirements for becoming a Grandmaster are somewhat complex. A player must have attained an Elo rating of at least 2500 (although they need not maintain this level to obtain or keep the title). In addition, at least two favorable results (called norms) from a total of at least 27 games in tournaments involving at least three other Grandmasters, including some from countries other than the applicant's, are usually required before FIDE will confer the title on a player. There are other milestones a player can achieve to get the title, such as winning the Women's World Championship, the World Junior Championship, or the World Senior Championship. Current regulations can be found in the FIDE Handbook.\n\nTitle inflation\n\nIn 1957, there were 50 GMs (USSR: 19, Yugoslavia: 7, USA: 5, Argentina: 4, West Germany: 2, France: 2, Sweden: 1, Czechoslovakia: 1, Hungary: 1, Austria: 1, Belgium: 1, Denmark: 1, Netherlands: 1, Poland: 1).Ajedrez Revista Mensual 1957, p. 403. In 1972, there were 88 GMs with 33 representing the USSR. The current FIDE ratings list includes over 1000 Grandmasters. Nigel Short was rated the third best player in the world in 1989 with a rating of 2650; in the 21st century such a rating would only be good enough for a player to reach the top 100 or so, with the third best player in the world usually rated around 2800. Other minor factors come into play: there are more tournaments worldwide and cheaper air travel makes them more accessible to globe-trotting chess professionals, who include many players from the former Soviet Union and Eastern Europe whose movements are no longer restricted as they were before the 1990s. Additionally, players can make norms in tournaments that would have been previously considered too short for norms, making norms easier to get and allowing for more norm tournaments to be held.\n\nDecember 2008 saw a record number of GMs (1,192) and IMs (2,916), causing some FIDE officials to suggest that FIDE should consider an \"elite grandmaster\" title. The unofficial title \"Super Grandmaster\" is sometimes used by players to refer to those with a 2700+ rating to distinguish the most serious world champion contenders.\nThe proportion of titled players among rated players is actually becoming smaller due to the rise in the number of all chess players worldwide who have FIDE ratings. In response, one member of the FIDE Titles & Ratings Committee observed that it is now more common for weaker players to get FIDE ratings, so the comparison of Grandmasters as a proportion of all rated players is not really helpful.[http://www.chessbase.com/newsdetail.asp?newsid\n5111 Remarks on the ACP's FIDE Congress report], Nick Faulks, Chessbase, December 24, 2008",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Grandmaster (chess)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12304" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The title Grandmaster (GM) is awarded to chess players by the world chess organization FIDE. Apart from World Champion, Grandmaster is the highest title a chess player can attain.\n\nOnce achieved, the title is held for life. The abbreviation IGM for International Grandmaster is also sometimes used, particularly in older literature.\n\nThe title of Grandmaster, along with the lesser FIDE titles of International Master (IM) and FIDE Master (FM), is open to both men and women. The vast majority of grandmasters are men, but a number of women have also earned the GM title, with the first three having been Nona Gaprindashvili in 1978, Maia Chiburdanidze in 1984http://ratings.fide.com/card.phtml?event=13600036 and Susan Polgar in 1991. Since about 2000, most of the top 10 women have held the GM title.\nThere is also a Woman Grandmaster title with lower requirements awarded only to women.\n\nFIDE awards separate Grandmaster titles to composers and solvers of chess problems (see List of grandmasters for chess composition). The International Correspondence Chess Federation (ICCF) awards the title of International Correspondence Chess Grandmaster (ICCGM).\n\nHistory\n\nThe first known use of the term grandmaster in connection with chess was in an 1838 issue of Bell's Life, in which a correspondent referred to William Lewis as \"our past grandmaster\". Lewis himself later referred to Philidor as a grandmaster, and the term was also applied to a few other players.\n\nEarly tournament use\n\nIn the Ostend tournament of 1907 the term grandmaster (Großmeister in German) was used. The tournament was divided into two sections: the Championship Tournament and the Masters' Tournament. The Championship section was for players who had previously won an international tournament. Siegbert Tarrasch won the Championship section, over Carl Schlechter, Dawid Janowski, Frank Marshall, Amos Burn, and Mikhail Chigorin. These players were described as grandmasters for the purposes of the tournament.\n\nThe San Sebastián 1912 tournament won by Akiba Rubinstein was a designated grandmaster event. Rubinstein won with 12½ points out of 19. Tied for second with 12 points were Aron Nimzowitsch and Rudolf Spielmann.\n\nBy some accounts, in the St. Petersburg 1914 chess tournament, the title \"Grandmaster\" was formally conferred by Russian Tsar Nicholas II, who had partially funded the tournament. The Tsar reportedly awarded the title to the five finalists: Emanuel Lasker, José Raúl Capablanca, Alexander Alekhine, Siegbert Tarrasch, and Frank Marshall. Chess historian Edward Winter has questioned this, stating that the earliest known sources that support this story are an article by Robert Lewis Taylor in the June 15, 1940, issue of The New Yorker and Marshall's autobiography My 50 Years of Chess (1942).\n\nNon-standard and Soviet usage before 1950\n\nBefore 1950, the term grandmaster was sometimes informally applied to other world class players. The Fédération Internationale des Échecs (FIDE, or World Chess Federation) was formed in Paris in 1924, but at that time did not formulate criteria on who should earn the title.\n\nIn 1927, the Soviet Union's Chess Federation established the title of Grandmaster of the Soviet Union, for their own players, since at that time Soviets were not competing outside their own country. This title was abolished in 1931, after having been awarded to Boris Verlinsky, who won the 1929 Soviet Championship. The title was brought back in 1935, and awarded to Mikhail Botvinnik, who thus became the first \"official\" Grandmaster of the USSR. Verlinsky did not get his title back.\n\nOfficial status (1950 onwards)\n\nWhen FIDE reorganized after World War II it adopted regulations concerning the award of international titles. Titles were awarded by a resolution of the FIDE General Assembly and the Qualification Committee. FIDE first awarded the Grandmaster title in 1950 to 27 players. These players were:\n* The top players of the day: world champion Mikhail Botvinnik, and those who had qualified for (or been seeded into) the inaugural Candidates Tournament in 1950: Isaac Boleslavsky, Igor Bondarevsky, David Bronstein, Max Euwe, Reuben Fine, Salo Flohr, Paul Keres, Alexander Kotov, Andor Lilienthal, Miguel Najdorf, Samuel Reshevsky, Vasily Smyslov, Gideon Ståhlberg, and László Szabó.\n* Players still living who, though past their best in 1950, were recognised as having been world class when at their peak: Ossip Bernstein, Oldřich Duras, Ernst Grünfeld, Boris Kostić, Grigory Levenfish, Géza Maróczy, Jacques Mieses, Viacheslav Ragozin, Akiba Rubinstein, Friedrich Sämisch, Savielly Tartakower, and Milan Vidmar.\n\nSince FIDE did not award the Grandmaster title posthumously, world-class players who died prior to 1950, including World Champions Steinitz, Lasker, Capablanca, and Alekhine, never received the title.\n\n1953 regulations\n\nTitle awards under the original regulations were subject to political concerns. Efim Bogoljubov, who had emigrated from the Soviet Union to Germany, was not entered in the first class of Grandmasters, even though he had played two matches for the World Championship with Alekhine. He received the title in 1951, by a vote of thirteen to eight with five abstentions. Yugoslavia supported his application, but all other Communist countries opposed it. In 1953, FIDE abolished the old regulations, although a provision was maintained that allowed older masters who had been overlooked to be awarded titles. The new regulations awarded the title of International Grandmaster of the FIDE to players meeting any of the following criteria:\n# The world champion.\n# Masters who have the absolute right to play in the World Championship Candidates Tournament, or any player who replaces an absent contestant and earns at least a 50 percent score.\n# The winner of an international tournament meeting specified standards, and any player placing second in two such tournaments within a span of four years. The tournament must be at least eleven rounds with seven or more players, 80 percent or more being International Grandmasters or International Masters. Additionally, 30 percent of the players must be Grandmasters who have the absolute right to play in the next World Championship Candidates Tournament, or who have played in such a tournament in the previous ten years.\n# A player who demonstrates ability manifestly equal to that of (3) above in an international tournament or match. Such titles must be approved by the Qualification Committee with the support of at least five members.\n\n1957 regulations\n\nAfter FIDE issued the 1953 title regulations, it was recognized that they were somewhat haphazard, and work began to revise the regulations. The FIDE Congress in Vienna in 1957 adopted new regulations, called the FAV system, in recognition of the work done by International Judge Giovanni Ferrantes (Italy), Alexander (probably Conel Hugh O'Donel Alexander), and Giancarlo Dal Verme (Italy). Under the 1957 regulations, the title of International Grandmaster of the FIDE was automatically awarded to:\n# The world champion.\n# Any player qualifying from the Interzonal tournament to play in the Candidates Tournament, even if he did not play in the Candidates for any reason.\n# Any player who would qualify from the Interzonal to play in the Candidates but who was excluded because of a limitation on the number of participants from his Federation.\n# Any player who actually plays in a Candidates Tournament and scores at least 33⅓ percent.\nThe regulations also allowed titles to be awarded by a FIDE Congress on recommendation by the Qualification Committee. Recommendations were based on performance in qualifying tournaments, with the required score depending on the percentage of Grandmasters and International Masters in the tournament.\n\n1965 regulations\n\nConcerns were raised that the 1957 regulations were too lax. At the FIDE Congress in 1961, GM Milan Vidmar said that the regulations \"made it possible to award international titles to players without sufficient merit\". At the 1964 Congress in Tel Aviv, a subcommittee was formed to propose changes to the regulations. The subcommittee recommended that the automatic award of titles be abolished, criticized the methods used for awarding titles based on qualifying performances, and called for a change in the makeup of the Qualification Committee. Several delegates supported the subcommittee recommendations, including GM Miguel Najdorf who felt that existing regulations were leading to an inflation of international titles. At the 1965 Congress in Wiesbaden FIDE raised the standards required for international titles. The International Grandmaster title regulations were:\n* 1. Any World Champion is automatically awarded the GM title\n* 2a. Anyone who scores at least 40 percent in a quarter-final match in the Candidates Tournament\n* 2b. Scores at least the number of points in a tournament corresponding to the total of a 55 percent score against Grandmasters plus 75 percent against International Masters (IM) plus 85 percent against other players (a GM \"norm\").\n\nTo fulfill requirement 2b, the candidate must score one GM norm in a category 1a tournament or two norms within a three-year period in two Category 1b tournaments, or one Category 2a tournament and one Category 1b tournament.\n\nThe categories of tournaments are:\n* 1a—at least sixteen players, at least 50 percent are GMs, and 70 percent at least IMs\n* 1b—at least twelve players, at least 33⅓ percent GMs and 70 percent IMs\n* 2a—at least fifteen players, at least 50 percent IMs\n* 2b—ten to fourteen players, at least 50 percent IMs.\nSince FIDE titles are for life, a GM or IM does not count for the purposes of this requirement if he had not had a GM or IM result in the five years prior to the tournament.\n\nIn addition, no more than 50 percent plus one of the players can be from the same country for tournaments of 10 to 12 players, or no more than 50 percent plus two for larger tournaments.\n\nSeventy-four GM titles were awarded in 1951 through 1968. During that period, ten GM titles were awarded in 1965, but only one in 1966 and in 1968.\n\n1970 regulations\n\nThe modern system for awarding FIDE titles evolved from the \"Dorazil\" proposals, presented to the 1970 Siegen Chess Olympiad FIDE Congress. The proposals were put together by Dr Wilfried Dorazil (then FIDE Vice-President) and fellow Committee members Grandmaster Svetozar Gligorić and Professor Arpad Elo. The recommendations of the Committee report were adopted in full.\n\nIn essence, the proposals built on the work done by Professor Elo in devising his Elo rating system. The establishment of an updated list of players and their Elo rating enabled significantly strong international chess tournaments to be allocated a \"Category\", based on the average rating of the contestants. For instance, it was decided that 'Category 1' status would apply to tournaments with an average Elo rating of participants falling within the range 2251–2275; similarly Category 2 would apply to the range 2276–2300 etc. The higher the tournament Category, the stronger the tournament.\n\nAnother vital component involved the setting of meritorious \"scores\" for each Category of tournament. A player must meet or surpass the relevant score to demonstrate that they had performed at Grandmaster (GM) or International Master (IM) level. Scores were expressed as percentages of a perfect maximum score and decreased as the tournament Category increased, thereby reflecting the strength of a player's opposition and the relative difficulty of the task.\n\nTournament organisers could then apply the percentages to their own tournament format and declare in advance the actual score that participants must achieve to attain a GM or IM result (nowadays referred to as a norm).\n\nTo qualify for the Grandmaster title, a player needed to achieve three such GM results within a rolling period of three years. Exceptionally, if a player's contributory games totalled thirty or more, then the title could be awarded on the basis of two such results. There were also circumstances where the system could be adapted to fit team events and other competitions.\n\nThe full proposals included many other rules and regulations, covering such topics as:\n* Eligible tournament formats.\n* Eligible participants.\n* Unrated participants.\n* Registration of tournaments with FIDE.\n* Calculations, including the handling of fractions.\n\nHonorary grandmasters\n\nFrom 1977 until 2003, FIDE awarded honorary Grandmaster titles to 31 players based on their past performances or other contributions to chess. Since 2007, no distinction has been made between an \"honorary\" grandmaster and a full grandmaster. The following players have been awarded honorary Grandmaster titles:\n* 1977 - Julio Bolbochán, Esteban Canal, Borislav Milić, Carlos Torre Repetto\n* 1981 - Arnold Denker\n* 1982 - Lodewijk Prins, Raúl Sanguinetti\n* 1983 - Vladimir Alatortsev, Alexander Konstantinopolsky, Erik Lundin\n* 1984 - Eero Böök, Stojan Puc\n* 1985 - Harry Golombek, Mario Monticelli, Jaroslav Šajtar\n* 1986 - Arthur Dake, Theodor Ghiţescu\n* 1987 - Vladimir Makogonov, Vladas Mikėnas, Bogdan Śliwa\n* 1988 - George Koltanowski\n* 1990 - Andrija Fuderer, Rudolf Marić\n* 1991 - Dragoljub Minić\n* 1992 - Heinz Lehmann, Rudolf Teschner\n* 1993 - Jonathan Penrose\n* 1996 - Károly Honfi, Enrico Paoli\n* 1999 - Péter Dely\n* 2003 - Elmārs Zemgalis\n\nCurrent regulations\n\nThe requirements for becoming a Grandmaster are somewhat complex. A player must have attained an Elo rating of at least 2500 (although they need not maintain this level to obtain or keep the title). In addition, at least two favorable results (called norms) from a total of at least 27 games in tournaments involving at least three other Grandmasters, including some from countries other than the applicant's, are usually required before FIDE will confer the title on a player. There are other milestones a player can achieve to get the title, such as winning the Women's World Championship, the World Junior Championship, or the World Senior Championship. Current regulations can be found in the FIDE Handbook.\n\nTitle inflation\n\nIn 1957, there were 50 GMs (USSR: 19, Yugoslavia: 7, USA: 5, Argentina: 4, West Germany: 2, France: 2, Sweden: 1, Czechoslovakia: 1, Hungary: 1, Austria: 1, Belgium: 1, Denmark: 1, Netherlands: 1, Poland: 1).Ajedrez Revista Mensual 1957, p. 403. In 1972, there were 88 GMs with 33 representing the USSR. The current FIDE ratings list includes over 1000 Grandmasters. Nigel Short was rated the third best player in the world in 1989 with a rating of 2650; in the 21st century such a rating would only be good enough for a player to reach the top 100 or so, with the third best player in the world usually rated around 2800. Other minor factors come into play: there are more tournaments worldwide and cheaper air travel makes them more accessible to globe-trotting chess professionals, who include many players from the former Soviet Union and Eastern Europe whose movements are no longer restricted as they were before the 1990s. Additionally, players can make norms in tournaments that would have been previously considered too short for norms, making norms easier to get and allowing for more norm tournaments to be held.\n\nDecember 2008 saw a record number of GMs (1,192) and IMs (2,916), causing some FIDE officials to suggest that FIDE should consider an \"elite grandmaster\" title. The unofficial title \"Super Grandmaster\" is sometimes used by players to refer to those with a 2700+ rating to distinguish the most serious world champion contenders.\nThe proportion of titled players among rated players is actually becoming smaller due to the rise in the number of all chess players worldwide who have FIDE ratings. In response, one member of the FIDE Titles & Ratings Committee observed that it is now more common for weaker players to get FIDE ratings, so the comparison of Grandmasters as a proportion of all rated players is not really helpful.[http://www.chessbase.com/newsdetail.asp?newsid\n5111 Remarks on the ACP's FIDE Congress report], Nick Faulks, Chessbase, December 24, 2008. Grandmaster (chess). http://en.wikipedia.org/?curid=12304."
  }
}
