{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16693",
  "eid" : "27a68180-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778575768,
  "textBody" : "Since its independence in 1961, Kuwait maintained strong international relations with most countries, especially nations within the Arab world.  Its vast oil reserves gives it a prominent voice in global economic forums and organizations like the OPEC.\n\nOverview\n\nRegionally, Kuwait has a unique foreign policy that is characterized by neutrality. Kuwait's troubled relationship with neighboring Iraq formed the core of its foreign policy from late 1980s onwards.  Its first major foreign policy problem arose when Iraq claimed Kuwaiti territory. Iraq threatened invasion, but was dissuaded by the United Kingdom's ready response to the Amir's request for assistance. Kuwait presented its case before the United Nations and successfully preserved its sovereignty. UK forces were later withdrawn and replaced by troops from Arab League nations, which were withdrawn in 1963 at Kuwait's request.\n\nOn 2 August 1990, Iraq invaded and occupied Kuwait. Largely through the efforts of King Fahd bin Abdulaziz of Saudi Arabia who was instrumental in obtaining the help of the U.S., a multinational coalition was assembled, and, under UN auspices, initiated military action against Iraq to liberate Kuwait. Arab states, especially the other five members of the Gulf Cooperation Council (Saudi Arabia, Bahrain, Qatar, Oman, and the United Arab Emirates), Egypt, and Syria, supported Kuwait by sending troops to fight with the coalition.  Many European and East Asian states sent troops, equipment, and/or financial support.\n\nAfter its liberation, Kuwait largely directed its diplomatic and cooperative efforts toward states that had participated in the multinational coalition.  Notably, many of these states were given key roles in the reconstruction of Kuwait.  Conversely, Kuwait's relations with nations that had supported Iraq, among them Jordan, Sudan, Yemen, and Cuba, have proved to be strained.\n\nSince the conclusion of the Gulf War, Kuwait has made efforts to secure allies throughout the world, particularly United Nations Security Council members.  In addition to the United States, defense arrangements have been concluded with the Russia, United Kingdom, and France.  Close ties to other key Arab members of the Gulf War coalition — Egypt and Syria — also have been sustained.\n\nKuwait's foreign policy has been dominated for some time by its economic dependence on oil and natural gas.  As a developing nation, its various economies are insufficient to independently support it.  As a result, Kuwait has directed considerable attention toward oil or natural gas related issues. With the outbreak of the War on Iraq, Kuwait has taken a pro-U.S. stance, having been the nation from which the war was actually launched.  It supported the Coalition Provisional Authority, with particular stress upon strict border controls and adequate U.S. troop presence. Kuwait also has good relations with Iran.\n\nKuwait is a member of the UN and some of its specialized and related agencies, including the World Bank (IBRD), International Monetary Fund (IMF), World Trade Organization (WTO), General Agreement on Tariffs and Trade (GATT); African Development Bank (AFDB), Arab Fund for Economic and Social Development (AFESD), Arab League, Arab Monetary Fund (AMF), Council of Arab Economic Unity (CAEU), Economic and Social Commission for Western Asia (ESCWA), Group of 77 (G-77), Gulf Cooperation Council (GCC), INMARSAT, International Development Association (IDA), International Finance Corporation, International Fund for Agricultural Development, International Labour Organization (ILO), International Marine Organization, Interpol, IOC, Islamic Development Bank (IDB), League of Red Cross and Red Crescent Societies (LORCS), Non-Aligned Movement, Organization of Arab Petroleum Exporting Countries (OAPEC), Organisation of Islamic Cooperation (OIC), Organization of Petroleum Exporting Countries (OPEC), and the International Atomic Energy Agency (IAEA).\n\nInternational disputes\n\nIn November 1994, Iraq formally accepted the UN-demarcated border with Kuwait which had been spelled out in Security Council Resolutions 687 (1991), 773 (1992), and 883 (1993); this formally ends earlier claims to Kuwait and to Bubiyan and Warbah islands; ownership of Qaruh and Umm al Maradim islands disputed by Saudi Arabia. Kuwait and Saudi Arabia continue negotiating a joint maritime boundary with Iran; no maritime boundary exists with Iraq in the Persian Gulf.\n\nMiddle East\n\nIran\n\nIran and Kuwait signed a demarcation agreement in 1965.\n\nOn 13 July 2008, Kuwait's Speaker of the Parliament Jassem Al-Kharafi publicly accused the West of provoking Iran on the nuclear issue. In his interview with state-owned Kuwait TV, Al-Kharafi said, \"What is happening is that there are provocative Western statements, and Iran responds in the same way...  I believe that a matter this sensitive needs dialogue not escalation, and it shouldn't be dealt with as if Iran were one of America's states.\"[http://www.iht.com/articles/ap/2008/07/14/africa/ME-Kuwait-Iran-Nuclear.php Kuwait and Iean] IHT\n\nIraq\n\nOn November 8, 2008, Kuwaiti lawmaker Al-Mulla proposed that Kuwait allow Iraq to back pay its debt to Kuwait in natural gas. The Arab Times quoted Al- Mulla as saying, \"In this manner, Kuwait can take the loans back from Iraq and put an end to the shortage of fuel in its power stations.\"\n\nOn April 25, 2007, Kuwaiti lawmaker Saleh Ashour called in a statement for reopening Kuwait's embassy in Baghdad and for strongly supporting the government in Baghdad; Al-Ghanim, however, said he believes that it was too early to reopen the Kuwaiti embassy in Baghdad and that this issue should wait until security situations improve.\n\nIsrael\n\nKuwait has no diplomatic ties with Israel, and boycotts Israeli products. In January 2014, Kuwait boycotted a renewable energy conference attended by Israel in Abu Dhabi, because Kuwait opposes normalization of ties with Israel.\n\nIn December 2008, Kuwaiti lawmakers protested in front of the Kuwait National Assembly Building against Israel during the Gaza War. The Kuwaiti lawmakers burned Israeli flags, waved banners reading, \"No to hunger, no to submission\" and chanted \"Allahu Akbar\". Israel launched air strikes against Hamas in the Gaza Strip on December 26 after Hamas launched rockets into the Israeli town of Sderot following the expiration of a six-month ceasefire on December 18.[http://www.unnindia.com/english/story.php?Id3746]   On January 3, 2009, MPs protested in front of the National Assembly again.[http://www.arabtimesonline.com/kuwaitnews/pagesdetails.asp?nid\n26748&ccid9]   After Friday prayers on January 8, 2009, Jamaan Al-Harbash  and several other MPs urged Arab leaders to take a stronger stand against the Israeli attacks and open Rafah Crossing to end an embargo imposed by Israel on the residents of Gaza.[http://www.kuwaittimes.net/read_news.php?newsid\nMTIxMDY0NzU1NA\n]   \n\nIn November 2012, Kuwait and the World Bank concluded an agreement according to which Kuwait contributed a US$50 million grant to the World Bank's Palestinian Reform and Development Program (PRDP).\n\nJordan\n\nJordan and Kuwait had weak relations after the Gulf War, because of Jordan's stand with Iraq.  Things have shifted, however, as the two nations forgot the past, and His Majesty King Abdullah II and the Emir of Kuwait have worked to restore and strengthen relations.  Currently the two countries  have \"outstanding relations\".  Kuwait is also a large investor and donor to Jordan.\n\nSaudi Arabia\n\nAlthough Kuwait and Saudi Arabia have good relations and cooperate within OPEC and the GCC, Riyadh disputes Kuwait's ownership of the Qaruh and Umm al Maradim islands.[http://www.washingtoninstitute.org/pdf.php?templateC05&CID\n2927]\n\nSyria\n\nKuwait–Syria relations were severed following the Syrian Civil War. Relations were further strained since Kuwait closed its embassies along with the rest of the Arab States of the Persian Gulf. Bilaterial relations have since come to focus on humanitarian efforts for Syria instead. For example, Kuwait has hosted three international pledging conferences in 2013, 2014 and 2015, raising 1.5bn, 2.4bn and 3.8bn respectively.\n\nIn 2016, Kuwait co-hosted the Supporting Syria and the Region Conference in London along with the United Kingdom, Kuwait, Germany and Norway. The conference resulted in a record $10 billion pledge.\n\nTurkey\n\nThe Ministry of Foreign Affairs in Turkey describes the current relations at \"outstanding levels\". Bilateral trade between the two countries is worth around $275 million. The two countries have recently signed fifteen agreements for cooperation in tourism, health, environment, economy, commercial exchange and oil.\n\nYemen\n\nAs a member of the UN Security Council in 1990 and 1991, Yemen abstained on a number of resolutions concerning the Iraqi invasion of Kuwait and voted against the \"use of force resolution.\"  Kuwait responded by cancelling aid programs, cutting diplomatic contact, and expelling thousands of Yemeni workers.[http://www.irinnews.org/Report.aspx?ReportId=80088]\n\nGCC\n\nKuwait, is a member of the Cooperation Council for the Arab States of the Gulf, which includes, Saudi Arabia, Bahrain, Qatar, the United Arab Emirates, and Oman.  These countries, have solid, and unbreakable bilateral relations. Citizens of these countries, may enter other GCC, country with an ID.  GCC citizens are allowed to stay at any other GCC, nation an unlimited period of time.  They also follow the same economic plan, and give each other military, and Intelligence support.  They also have similar, educational, social, plans. The GCC countries, discuss their foreign policies, as they try to maintain similar foreign policies.  These six monarchies are also known as the oil-rich countries of the Middle East.\n\nEurope\n\nAlbania\n\nAlbania and Kuwait relationship are very good. Both couriers are member of the Organisation of Islamic Cooperation. Kuwait have a great contribution in the investments in Albania. The entire project for the restoration of Skanderbeg Square in Albanian capital Tirana is funded by a grant from the State of Kuwait.\n* Albania has an embassy in Kuwait City.\n* Kuwait has an embassy in Tirana.\n\nCyprus\n\nCyprus and Kuwait can be described as excellent with various exchange visits between the two countries.\n* Cyprus has an embassy in Kuwait City.\n* Kuwait has an embassy in Nicosia.\n\nDenmark\n\nDate started: 1964\n\nOn 6 November 2006, the Kuwaiti parliament voted 22–15 to approve severing diplomatic ties with Denmark over the Jyllands-Posten Muhammad cartoons controversy and spending about US$50 (€39.20) million to defend Muhammad's image in the West.  Both votes were nonbinding, meaning the Cabinet does not have to abide by them.  Kuwaiti lawmaker Abdulsamad voted in favor of cutting diplomatic ties, saying, \"We have to cut diplomatic and commercial ties with Denmark...We don't have to eat Danish cheese.\"[http://www.iht.com/articles/ap/2006/11/07/africa/ME_GEN_Kuwait_Prophet_Cartoons.php Prophet Cartoons] Al-Rashid voted against cutting diplomatic ties, arguing that Muslims have to be positive and remember that it were some individuals, not governments, who insulted Muhammad.  Al-Rashid was quoted as saying, \"We here in Kuwait curse Christians in many of our mosques, should those (Christian) countries boycott Kuwait?\"\nIn February 2008, MP Abdullah Al-Roumi called for an end to Kuwait's Denmark boycott and was quoted as saying, \"No Muslim can accept this insult against the Prophet... It is a form of terrorism.\"\n\nGreece\n\nDate started: 1964\n\nGreece was one of the 34 member countries in the coalition which assisted in the liberation of Kuwait from Iraq in 1991 during the Gulf War. Greece also participated in the UNICOM mission to patrol the demilitarized zone along the Kuwait-Iraq border.[http://www.mfa.gr/www.mfa.gr/en-US/Policy/Geographic+Regions/Mediterranean+-+Middle+East/Bilateral+Relations/Kuwait/]\n\nHoly See\n\nSee Foreign relations of the Holy See\n\nKosovo\n\n* Kuwait recognised the Republic of Kosovo on 11 October 2011.[http://www.mfa-ks.net/?page=2,4,981 Kuwait formally recognizes the Republic of Kosovo], Ministry of Foreign Affairs of the Republic of Kosovo, 2011-10-11\n* Kosovo and Kuwait established diplomatic relations on 16 January 2013.[http://www.mfa-ks.net/?page=2,4,1565 Kosovo establishes diplomatic relations with Kuwait], Ministry of Foreign Affairs of the Republic of Kosovo, 2013-01-16\n\nRussia\n\nOn 28 December 1991, Kuwait recognised the Russian Federation as the successor state to the Soviet Union. Russia has an embassy in Kuwait City, and Kuwait has an embassy in Moscow. The current Ambassador of Russia to Kuwait is Alexander Kinshchak, who was appointed by Russian President Vladimir Putin on 28 January 2008, and who presented his credentials to Emir Sabah Al-Ahmad Al-Jaber Al-Sabah on 28 April 2008. The current Ambassador of Kuwait to Russia is Nasser Haji Al-Muzayen, who presented his credentials to Vladimir Putin on 11 December 2007.\n\nUnited Kingdom\n\nThe diplomatic relations between two countries were started on 8 October 1961 and Kuwait's first ambassador to London was Khalifa Al Ghunaim.\n\nRest of world\n\nBelize\n\nBoth countries established diplomatic relations on 5 September 2006.http://www.kuna.net.kw/ArticlePrintPage.aspx?id1657377&language\nen\n\nCanada\n\nIn 1965, official relations between Kuwait and Canada were launched when the US ambassador to Kuwait began to act as a non-resident ambassador to Canada. In 1978, Canada opened its embassy in Kuwait City. Kuwait opened its embassy in Ottawa in 1993.\n\nChina\n\nChina and Kuwait initiated diplomatic relations in 1971.   In 2007, Kuwait exported $2.3 billion worth of goods to China ($2.1 billion of which was oil) and Kuwait imported $1.3 billion of goods from China.\n\nIn 2007, Kuwait supplied China with 95000 oilbbl of oil per day, accounting for 2.6% of China's total crude oil imports.  Saudi Arabia was China's top supplier with its shipments jumping 69.8 percent to 3.84 million tons (939,000 bbl/d), followed by Angola with 2.06 million tons (503,000 bbl/d), down 27.1 percent. Iran became third, with imports from the country shrinking 35.3 percent to 1.18 million tons (289,000 bbl/d). China is the world's second-biggest oil consumer after the US. Abdullatif Al-Houti, Managing Director of International Marketing at state-run Kuwait Petroleum Corporation (KPC), told KUNA in October that Kuwait is on course for its China-bound crude oil export target of 500000 oilbbl/d by 2015, but success will heavily depend on the Sino-Kuwaiti refinery project. The two countries have been in talks for the planned 300000 oilbbl/d refinery in China's southern Guangdong Province. The complex is expected to be on-stream by 2020.[http://news.xinhuanet.com/english/2008-12/28/content_10568853.htm News] Xinhua, 28 December 2008[http://www.arabtimesonline.com/kuwaitnews/pagesdetails.asp?nid26440&ccid\n12 News] Arab Times Online\n\nIndia\n\nIndia and Kuwait enjoy traditionally friendly relations.  These are based in history and have stood the test of time. Geographic proximity, historical trade links, cultural affinities and presence of a large number of Indian expatriates continue to sustain and nurture this long standing relationship.  India has been a natural trading partner and a destination for higher learning.  Until 1961, the Indian Rupee was the legal tender in Kuwait.  High level visits from India to Kuwait have included those by Hon’ble Vice President of India Dr. Zakir Husain in 1965, by Prime Minister Indira Gandhi in 1981 and by Hon’ble Vice President of India Shri M Hamid Ansari in 2009.  High level visits from Kuwait to India have included those by the Crown Prince and Prime Minister Sheikh Sabah Al-Salem Al-Sabah in November 1964, the Amir Sheikh Jaber Al-Ahmed Al-Jaber Al-Sabah in 1980 and again in 1983 (for the NAM Summit), and the Amir Sheikh Sabah Al-Ahmed Al-Jaber Al-Sabah in 2006.\n\nAccording to the Kuwaiti Ministry of Interior, there are approximately 600,000 Indians, who constitute the largest expatriate community in Kuwait. The Indian community is regarded as the community of first preference among the expatriates in Kuwait.  Kuwait views India as a fast-growing economy and a source of highly qualified professional and technical personnel. A large proportion of the Indian expatriates are unskilled and semi-skilled workers. Professionals like engineers, doctors, chartered accountants, scientists, software experts, management consultants, architects; skilled workers like technicians and nurses; semi-skilled workers; retail traders and businessmen are also present in the Indian community.\n\nOf late, there has been an increase in the number of highly qualified Indian experts in hi-tech areas, especially in the software and financial sector in Kuwait. In the field of health, India not only supplies top specialists but also para-medical staff who enjoy high reputation.\n\nThe total remittance from Kuwait to India is estimated to be upwards of US$3 billion annually.\n\nApproximately 300 associations exist within the Indian community in Kuwait, representing a variety of regional, professional and cultural interests. Of these, 128 Associations are presently registered with the Embassy. Cultural events are organised regularly by these associations through the year, to which leading Indian artistes are often invited.\n\nThere are 18 Indian Schools in Kuwait affiliated to the Central Board of Secondary Education, New Delhi.\n\nJapan\n\nThe two nations have agreed to work together on the security of the oil trade route that connects them.\n\nMalaysia\n\nKuwait has an embassy in Kuala Lumpur, and Malaysia has an embassy in Kuwait City. Relations are mainly in economic cooperation.\n\nMexico\n\n* Kuwait has an embassy in Mexico City.[http://www.mofa.gov.kw/en/embassies/mexicocity/Pages/default.aspx Embassy of Kuwait in Mexico City]\n* Mexico has an embassy in Kuwait City.[https://embamex.sre.gob.mx/kuwait/ Embassy of Mexico in Kuwait City (in English and Spanish)]\n\nPakistan\n\nThe relationship between Kuwait and Pakistan are exemplary, brotherly, historical and deep based on shared history, traditions and common culture. Kuwait and Pakistan have always enjoyed deep economic and cultural ties.\n\nAfter the end of the first Gulf War in 1991 Pakistani army engineers were involved in a programme of mine clearance in the country.[https://archive.is/20120803023037/http://www.ispr.gov.pk/Multimedia/UN%20Peace%20Keeping/UNIKOM.htm UN Iraq – Kuwait Observer Mission (UNIKOM)] Kuwait was also the first country to send aid to isolated mountain villages in Kashmir after the quake of 2005, also offering the largest amount of aid in the aftermath of the quake ($100m).\n\nSouth Korea\n\nThe Republic of Korea and Kuwait have had official relations since June 1979.http://terms.naver.com/entry.nhn?docId973085&cid\n44526&categoryId44527 On 2 March 2015, foreign minister Yun Byung-se and his Kuwaiti counterpart Sheikh Sabah Al-Khalid Al-Hamad Al-Sabah signed a bilateral Agreement on the mutual waiver of visa requirements for holders of diplomatic, official, and special passports in the presence of the heads of state of the Republic of Korea and Kuwait.http://www.mofa.go.kr/ENG/press/pressreleases/index.jsp?menu\nm_10_20&sp/webmodule/htsboard/template/read/engreadboard.jsp%3FtypeID\n12%26boardid302%26seqno\n314932\n\nUnited States\n\nThe United States opened a consulate in Kuwait in October 1951, which was elevated to embassy status at the time of Kuwait's independence 10 years later.\n\nVietnam\n\nOn Jan 10, 1976, Kuwait and  Vietnam established their bilateral diplomatic relations. Kuwait was the first country in the GCC that Vietnam chose to establish its trade representative office in 1993, and embassy in 2003. The former Prime Minister of Kuwait HE Sheikh Nasser Al-Mohammed Al-Ahmad Al-Sabah and  Prime Minister Nguyen Tan Dung in 2009 visited each other’s countries.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Foreign relations of Kuwait" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16693" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Since its independence in 1961, Kuwait maintained strong international relations with most countries, especially nations within the Arab world.  Its vast oil reserves gives it a prominent voice in global economic forums and organizations like the OPEC.\n\nOverview\n\nRegionally, Kuwait has a unique foreign policy that is characterized by neutrality. Kuwait's troubled relationship with neighboring Iraq formed the core of its foreign policy from late 1980s onwards.  Its first major foreign policy problem arose when Iraq claimed Kuwaiti territory. Iraq threatened invasion, but was dissuaded by the United Kingdom's ready response to the Amir's request for assistance. Kuwait presented its case before the United Nations and successfully preserved its sovereignty. UK forces were later withdrawn and replaced by troops from Arab League nations, which were withdrawn in 1963 at Kuwait's request.\n\nOn 2 August 1990, Iraq invaded and occupied Kuwait. Largely through the efforts of King Fahd bin Abdulaziz of Saudi Arabia who was instrumental in obtaining the help of the U.S., a multinational coalition was assembled, and, under UN auspices, initiated military action against Iraq to liberate Kuwait. Arab states, especially the other five members of the Gulf Cooperation Council (Saudi Arabia, Bahrain, Qatar, Oman, and the United Arab Emirates), Egypt, and Syria, supported Kuwait by sending troops to fight with the coalition.  Many European and East Asian states sent troops, equipment, and/or financial support.\n\nAfter its liberation, Kuwait largely directed its diplomatic and cooperative efforts toward states that had participated in the multinational coalition.  Notably, many of these states were given key roles in the reconstruction of Kuwait.  Conversely, Kuwait's relations with nations that had supported Iraq, among them Jordan, Sudan, Yemen, and Cuba, have proved to be strained.\n\nSince the conclusion of the Gulf War, Kuwait has made efforts to secure allies throughout the world, particularly United Nations Security Council members.  In addition to the United States, defense arrangements have been concluded with the Russia, United Kingdom, and France.  Close ties to other key Arab members of the Gulf War coalition — Egypt and Syria — also have been sustained.\n\nKuwait's foreign policy has been dominated for some time by its economic dependence on oil and natural gas.  As a developing nation, its various economies are insufficient to independently support it.  As a result, Kuwait has directed considerable attention toward oil or natural gas related issues. With the outbreak of the War on Iraq, Kuwait has taken a pro-U.S. stance, having been the nation from which the war was actually launched.  It supported the Coalition Provisional Authority, with particular stress upon strict border controls and adequate U.S. troop presence. Kuwait also has good relations with Iran.\n\nKuwait is a member of the UN and some of its specialized and related agencies, including the World Bank (IBRD), International Monetary Fund (IMF), World Trade Organization (WTO), General Agreement on Tariffs and Trade (GATT); African Development Bank (AFDB), Arab Fund for Economic and Social Development (AFESD), Arab League, Arab Monetary Fund (AMF), Council of Arab Economic Unity (CAEU), Economic and Social Commission for Western Asia (ESCWA), Group of 77 (G-77), Gulf Cooperation Council (GCC), INMARSAT, International Development Association (IDA), International Finance Corporation, International Fund for Agricultural Development, International Labour Organization (ILO), International Marine Organization, Interpol, IOC, Islamic Development Bank (IDB), League of Red Cross and Red Crescent Societies (LORCS), Non-Aligned Movement, Organization of Arab Petroleum Exporting Countries (OAPEC), Organisation of Islamic Cooperation (OIC), Organization of Petroleum Exporting Countries (OPEC), and the International Atomic Energy Agency (IAEA).\n\nInternational disputes\n\nIn November 1994, Iraq formally accepted the UN-demarcated border with Kuwait which had been spelled out in Security Council Resolutions 687 (1991), 773 (1992), and 883 (1993); this formally ends earlier claims to Kuwait and to Bubiyan and Warbah islands; ownership of Qaruh and Umm al Maradim islands disputed by Saudi Arabia. Kuwait and Saudi Arabia continue negotiating a joint maritime boundary with Iran; no maritime boundary exists with Iraq in the Persian Gulf.\n\nMiddle East\n\nIran\n\nIran and Kuwait signed a demarcation agreement in 1965.\n\nOn 13 July 2008, Kuwait's Speaker of the Parliament Jassem Al-Kharafi publicly accused the West of provoking Iran on the nuclear issue. In his interview with state-owned Kuwait TV, Al-Kharafi said, \"What is happening is that there are provocative Western statements, and Iran responds in the same way...  I believe that a matter this sensitive needs dialogue not escalation, and it shouldn't be dealt with as if Iran were one of America's states.\"[http://www.iht.com/articles/ap/2008/07/14/africa/ME-Kuwait-Iran-Nuclear.php Kuwait and Iean] IHT\n\nIraq\n\nOn November 8, 2008, Kuwaiti lawmaker Al-Mulla proposed that Kuwait allow Iraq to back pay its debt to Kuwait in natural gas. The Arab Times quoted Al- Mulla as saying, \"In this manner, Kuwait can take the loans back from Iraq and put an end to the shortage of fuel in its power stations.\"\n\nOn April 25, 2007, Kuwaiti lawmaker Saleh Ashour called in a statement for reopening Kuwait's embassy in Baghdad and for strongly supporting the government in Baghdad; Al-Ghanim, however, said he believes that it was too early to reopen the Kuwaiti embassy in Baghdad and that this issue should wait until security situations improve.\n\nIsrael\n\nKuwait has no diplomatic ties with Israel, and boycotts Israeli products. In January 2014, Kuwait boycotted a renewable energy conference attended by Israel in Abu Dhabi, because Kuwait opposes normalization of ties with Israel.\n\nIn December 2008, Kuwaiti lawmakers protested in front of the Kuwait National Assembly Building against Israel during the Gaza War. The Kuwaiti lawmakers burned Israeli flags, waved banners reading, \"No to hunger, no to submission\" and chanted \"Allahu Akbar\". Israel launched air strikes against Hamas in the Gaza Strip on December 26 after Hamas launched rockets into the Israeli town of Sderot following the expiration of a six-month ceasefire on December 18.[http://www.unnindia.com/english/story.php?Id3746]   On January 3, 2009, MPs protested in front of the National Assembly again.[http://www.arabtimesonline.com/kuwaitnews/pagesdetails.asp?nid\n26748&ccid9]   After Friday prayers on January 8, 2009, Jamaan Al-Harbash  and several other MPs urged Arab leaders to take a stronger stand against the Israeli attacks and open Rafah Crossing to end an embargo imposed by Israel on the residents of Gaza.[http://www.kuwaittimes.net/read_news.php?newsid\nMTIxMDY0NzU1NA\n]   \n\nIn November 2012, Kuwait and the World Bank concluded an agreement according to which Kuwait contributed a US$50 million grant to the World Bank's Palestinian Reform and Development Program (PRDP).\n\nJordan\n\nJordan and Kuwait had weak relations after the Gulf War, because of Jordan's stand with Iraq.  Things have shifted, however, as the two nations forgot the past, and His Majesty King Abdullah II and the Emir of Kuwait have worked to restore and strengthen relations.  Currently the two countries  have \"outstanding relations\".  Kuwait is also a large investor and donor to Jordan.\n\nSaudi Arabia\n\nAlthough Kuwait and Saudi Arabia have good relations and cooperate within OPEC and the GCC, Riyadh disputes Kuwait's ownership of the Qaruh and Umm al Maradim islands.[http://www.washingtoninstitute.org/pdf.php?templateC05&CID\n2927]\n\nSyria\n\nKuwait–Syria relations were severed following the Syrian Civil War. Relations were further strained since Kuwait closed its embassies along with the rest of the Arab States of the Persian Gulf. Bilaterial relations have since come to focus on humanitarian efforts for Syria instead. For example, Kuwait has hosted three international pledging conferences in 2013, 2014 and 2015, raising 1.5bn, 2.4bn and 3.8bn respectively.\n\nIn 2016, Kuwait co-hosted the Supporting Syria and the Region Conference in London along with the United Kingdom, Kuwait, Germany and Norway. The conference resulted in a record $10 billion pledge.\n\nTurkey\n\nThe Ministry of Foreign Affairs in Turkey describes the current relations at \"outstanding levels\". Bilateral trade between the two countries is worth around $275 million. The two countries have recently signed fifteen agreements for cooperation in tourism, health, environment, economy, commercial exchange and oil.\n\nYemen\n\nAs a member of the UN Security Council in 1990 and 1991, Yemen abstained on a number of resolutions concerning the Iraqi invasion of Kuwait and voted against the \"use of force resolution.\"  Kuwait responded by cancelling aid programs, cutting diplomatic contact, and expelling thousands of Yemeni workers.[http://www.irinnews.org/Report.aspx?ReportId=80088]\n\nGCC\n\nKuwait, is a member of the Cooperation Council for the Arab States of the Gulf, which includes, Saudi Arabia, Bahrain, Qatar, the United Arab Emirates, and Oman.  These countries, have solid, and unbreakable bilateral relations. Citizens of these countries, may enter other GCC, country with an ID.  GCC citizens are allowed to stay at any other GCC, nation an unlimited period of time.  They also follow the same economic plan, and give each other military, and Intelligence support.  They also have similar, educational, social, plans. The GCC countries, discuss their foreign policies, as they try to maintain similar foreign policies.  These six monarchies are also known as the oil-rich countries of the Middle East.\n\nEurope\n\nAlbania\n\nAlbania and Kuwait relationship are very good. Both couriers are member of the Organisation of Islamic Cooperation. Kuwait have a great contribution in the investments in Albania. The entire project for the restoration of Skanderbeg Square in Albanian capital Tirana is funded by a grant from the State of Kuwait.\n* Albania has an embassy in Kuwait City.\n* Kuwait has an embassy in Tirana.\n\nCyprus\n\nCyprus and Kuwait can be described as excellent with various exchange visits between the two countries.\n* Cyprus has an embassy in Kuwait City.\n* Kuwait has an embassy in Nicosia.\n\nDenmark\n\nDate started: 1964\n\nOn 6 November 2006, the Kuwaiti parliament voted 22–15 to approve severing diplomatic ties with Denmark over the Jyllands-Posten Muhammad cartoons controversy and spending about US$50 (€39.20) million to defend Muhammad's image in the West.  Both votes were nonbinding, meaning the Cabinet does not have to abide by them.  Kuwaiti lawmaker Abdulsamad voted in favor of cutting diplomatic ties, saying, \"We have to cut diplomatic and commercial ties with Denmark...We don't have to eat Danish cheese.\"[http://www.iht.com/articles/ap/2006/11/07/africa/ME_GEN_Kuwait_Prophet_Cartoons.php Prophet Cartoons] Al-Rashid voted against cutting diplomatic ties, arguing that Muslims have to be positive and remember that it were some individuals, not governments, who insulted Muhammad.  Al-Rashid was quoted as saying, \"We here in Kuwait curse Christians in many of our mosques, should those (Christian) countries boycott Kuwait?\"\nIn February 2008, MP Abdullah Al-Roumi called for an end to Kuwait's Denmark boycott and was quoted as saying, \"No Muslim can accept this insult against the Prophet... It is a form of terrorism.\"\n\nGreece\n\nDate started: 1964\n\nGreece was one of the 34 member countries in the coalition which assisted in the liberation of Kuwait from Iraq in 1991 during the Gulf War. Greece also participated in the UNICOM mission to patrol the demilitarized zone along the Kuwait-Iraq border.[http://www.mfa.gr/www.mfa.gr/en-US/Policy/Geographic+Regions/Mediterranean+-+Middle+East/Bilateral+Relations/Kuwait/]\n\nHoly See\n\nSee Foreign relations of the Holy See\n\nKosovo\n\n* Kuwait recognised the Republic of Kosovo on 11 October 2011.[http://www.mfa-ks.net/?page=2,4,981 Kuwait formally recognizes the Republic of Kosovo], Ministry of Foreign Affairs of the Republic of Kosovo, 2011-10-11\n* Kosovo and Kuwait established diplomatic relations on 16 January 2013.[http://www.mfa-ks.net/?page=2,4,1565 Kosovo establishes diplomatic relations with Kuwait], Ministry of Foreign Affairs of the Republic of Kosovo, 2013-01-16\n\nRussia\n\nOn 28 December 1991, Kuwait recognised the Russian Federation as the successor state to the Soviet Union. Russia has an embassy in Kuwait City, and Kuwait has an embassy in Moscow. The current Ambassador of Russia to Kuwait is Alexander Kinshchak, who was appointed by Russian President Vladimir Putin on 28 January 2008, and who presented his credentials to Emir Sabah Al-Ahmad Al-Jaber Al-Sabah on 28 April 2008. The current Ambassador of Kuwait to Russia is Nasser Haji Al-Muzayen, who presented his credentials to Vladimir Putin on 11 December 2007.\n\nUnited Kingdom\n\nThe diplomatic relations between two countries were started on 8 October 1961 and Kuwait's first ambassador to London was Khalifa Al Ghunaim.\n\nRest of world\n\nBelize\n\nBoth countries established diplomatic relations on 5 September 2006.http://www.kuna.net.kw/ArticlePrintPage.aspx?id1657377&language\nen\n\nCanada\n\nIn 1965, official relations between Kuwait and Canada were launched when the US ambassador to Kuwait began to act as a non-resident ambassador to Canada. In 1978, Canada opened its embassy in Kuwait City. Kuwait opened its embassy in Ottawa in 1993.\n\nChina\n\nChina and Kuwait initiated diplomatic relations in 1971.   In 2007, Kuwait exported $2.3 billion worth of goods to China ($2.1 billion of which was oil) and Kuwait imported $1.3 billion of goods from China.\n\nIn 2007, Kuwait supplied China with 95000 oilbbl of oil per day, accounting for 2.6% of China's total crude oil imports.  Saudi Arabia was China's top supplier with its shipments jumping 69.8 percent to 3.84 million tons (939,000 bbl/d), followed by Angola with 2.06 million tons (503,000 bbl/d), down 27.1 percent. Iran became third, with imports from the country shrinking 35.3 percent to 1.18 million tons (289,000 bbl/d). China is the world's second-biggest oil consumer after the US. Abdullatif Al-Houti, Managing Director of International Marketing at state-run Kuwait Petroleum Corporation (KPC), told KUNA in October that Kuwait is on course for its China-bound crude oil export target of 500000 oilbbl/d by 2015, but success will heavily depend on the Sino-Kuwaiti refinery project. The two countries have been in talks for the planned 300000 oilbbl/d refinery in China's southern Guangdong Province. The complex is expected to be on-stream by 2020.[http://news.xinhuanet.com/english/2008-12/28/content_10568853.htm News] Xinhua, 28 December 2008[http://www.arabtimesonline.com/kuwaitnews/pagesdetails.asp?nid26440&ccid\n12 News] Arab Times Online\n\nIndia\n\nIndia and Kuwait enjoy traditionally friendly relations.  These are based in history and have stood the test of time. Geographic proximity, historical trade links, cultural affinities and presence of a large number of Indian expatriates continue to sustain and nurture this long standing relationship.  India has been a natural trading partner and a destination for higher learning.  Until 1961, the Indian Rupee was the legal tender in Kuwait.  High level visits from India to Kuwait have included those by Hon’ble Vice President of India Dr. Zakir Husain in 1965, by Prime Minister Indira Gandhi in 1981 and by Hon’ble Vice President of India Shri M Hamid Ansari in 2009.  High level visits from Kuwait to India have included those by the Crown Prince and Prime Minister Sheikh Sabah Al-Salem Al-Sabah in November 1964, the Amir Sheikh Jaber Al-Ahmed Al-Jaber Al-Sabah in 1980 and again in 1983 (for the NAM Summit), and the Amir Sheikh Sabah Al-Ahmed Al-Jaber Al-Sabah in 2006.\n\nAccording to the Kuwaiti Ministry of Interior, there are approximately 600,000 Indians, who constitute the largest expatriate community in Kuwait. The Indian community is regarded as the community of first preference among the expatriates in Kuwait.  Kuwait views India as a fast-growing economy and a source of highly qualified professional and technical personnel. A large proportion of the Indian expatriates are unskilled and semi-skilled workers. Professionals like engineers, doctors, chartered accountants, scientists, software experts, management consultants, architects; skilled workers like technicians and nurses; semi-skilled workers; retail traders and businessmen are also present in the Indian community.\n\nOf late, there has been an increase in the number of highly qualified Indian experts in hi-tech areas, especially in the software and financial sector in Kuwait. In the field of health, India not only supplies top specialists but also para-medical staff who enjoy high reputation.\n\nThe total remittance from Kuwait to India is estimated to be upwards of US$3 billion annually.\n\nApproximately 300 associations exist within the Indian community in Kuwait, representing a variety of regional, professional and cultural interests. Of these, 128 Associations are presently registered with the Embassy. Cultural events are organised regularly by these associations through the year, to which leading Indian artistes are often invited.\n\nThere are 18 Indian Schools in Kuwait affiliated to the Central Board of Secondary Education, New Delhi.\n\nJapan\n\nThe two nations have agreed to work together on the security of the oil trade route that connects them.\n\nMalaysia\n\nKuwait has an embassy in Kuala Lumpur, and Malaysia has an embassy in Kuwait City. Relations are mainly in economic cooperation.\n\nMexico\n\n* Kuwait has an embassy in Mexico City.[http://www.mofa.gov.kw/en/embassies/mexicocity/Pages/default.aspx Embassy of Kuwait in Mexico City]\n* Mexico has an embassy in Kuwait City.[https://embamex.sre.gob.mx/kuwait/ Embassy of Mexico in Kuwait City (in English and Spanish)]\n\nPakistan\n\nThe relationship between Kuwait and Pakistan are exemplary, brotherly, historical and deep based on shared history, traditions and common culture. Kuwait and Pakistan have always enjoyed deep economic and cultural ties.\n\nAfter the end of the first Gulf War in 1991 Pakistani army engineers were involved in a programme of mine clearance in the country.[https://archive.is/20120803023037/http://www.ispr.gov.pk/Multimedia/UN%20Peace%20Keeping/UNIKOM.htm UN Iraq – Kuwait Observer Mission (UNIKOM)] Kuwait was also the first country to send aid to isolated mountain villages in Kashmir after the quake of 2005, also offering the largest amount of aid in the aftermath of the quake ($100m).\n\nSouth Korea\n\nThe Republic of Korea and Kuwait have had official relations since June 1979.http://terms.naver.com/entry.nhn?docId973085&cid\n44526&categoryId44527 On 2 March 2015, foreign minister Yun Byung-se and his Kuwaiti counterpart Sheikh Sabah Al-Khalid Al-Hamad Al-Sabah signed a bilateral Agreement on the mutual waiver of visa requirements for holders of diplomatic, official, and special passports in the presence of the heads of state of the Republic of Korea and Kuwait.http://www.mofa.go.kr/ENG/press/pressreleases/index.jsp?menu\nm_10_20&sp/webmodule/htsboard/template/read/engreadboard.jsp%3FtypeID\n12%26boardid302%26seqno\n314932\n\nUnited States\n\nThe United States opened a consulate in Kuwait in October 1951, which was elevated to embassy status at the time of Kuwait's independence 10 years later.\n\nVietnam\n\nOn Jan 10, 1976, Kuwait and  Vietnam established their bilateral diplomatic relations. Kuwait was the first country in the GCC that Vietnam chose to establish its trade representative office in 1993, and embassy in 2003. The former Prime Minister of Kuwait HE Sheikh Nasser Al-Mohammed Al-Ahmad Al-Sabah and  Prime Minister Nguyen Tan Dung in 2009 visited each other’s countries. Foreign relations of Kuwait. http://en.wikipedia.org/?curid=16693."
  }
}
