{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17282",
  "eid" : "2b324050-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778581717,
  "textBody" : "In economics, Kondratiev waves (also called supercycles, great surges, long waves, K-waves or the long economic cycle) are hypothesized cycle-like phenomena in the modern world economy.The term long wave originated from a poor early translation of long cycle from Russian to German. Freeman, Chris; Louçã, Francisco (2001) pp 70\n\nIt is stated that the period of a wave ranges from forty to sixty years, the cycles consist of alternating intervals between high sectoral growth and intervals of relatively slow growth.See, e.g. \n\nLong wave theory is not accepted by most academic economists. Among economists who accept it, there is a lack of agreement about both the cause of the waves and the start and end years of particular waves. This points to a major criticism of the theory: that it amounts to seeing patterns in a mass of statistics that aren't really there.\n\nHistory of concept\n\nThe Soviet economist Nikolai Kondratiev (also written Kondratieff or Kondratyev) was the first to bring these observations to international attention in his book The Major Economic Cycles (1925) alongside other works written in the same decade.Vincent Barnett, [http://www.encyclopedia.com/doc/1G2-3404100667.html Nikolai Dmitriyevich Kondratiev], Encyclopedia of Russian History, 2004, at Encyclopedia.com.Erik Buyst, [http://www.highbeam.com/doc/1G2-3447000528.html Kondratiev, Nikolai (1892–1938)], Encyclopedia of Modern Europe: Europe Since 1914: Encyclopedia of the Age of War and Reconstruction, Gale Publishing, January 1, 2006. In 1939, Joseph Schumpeter suggested naming the cycles \"Kondratieff waves\" in his honor.\n\nTwo Dutch economists, Jacob van Gelderen and Salomon de Wolff, had previously argued for the existence of 50- to 60-year cycles in 1913 and 1924, respectively.\n\nSince the inception of the theory, various studies have expanded the range of possible cycles, finding longer or shorter cycles in the data. The Marxist scholar Ernest Mandel revived interest in long-wave theory with his 1964 essay predicting the end of the long boom after five years, and in his Alfred Marshall lectures in 1979. However, in Mandel's theory, there are no long \"cycles\", only distinct epochs of faster and slower growth spanning 20–25 years.\n\nIn 1990, William Thompson at Indiana University has published influential papers and books documenting eighteen K-Waves dating back to 930 AD in China’s Song Province; and Michael Snyder wrote “It should be noted that economic cycle theories have enabled some analysts to correctly predict the timing of recessions, stock market peaks and stock market crashes over the past couple of decades.”\n\nThe historian Eric Hobsbawm also wrote of the theory: \"That good predictions have proved possible on the basis of Kondratiev Long Waves—this is not very common in economics—has convinced many historians and even some economists that there is something in them, even if we don't know what.Hobsbawm (1999), pp. 87f.\n\nEdward Tilley, a researcher and author in transition economics cited the 50-year economic control corrections on the Stone of Hammurabi (1763 BCE) – called \"Jubilees\" – as the first economic controls to recognize and to also counter these natural long waves in capitalist societies.\n\nCharacteristics of the cycle\n\nKondratiev identified three phases in the cycle: expansion, stagnation, and recession. More common today is the division into four periods with a turning point (collapse) between the first and second phases. Writing in the 1920s, Kondratiev proposed to apply the theory to the 19th century:\n* 1790–1849 with a turning point in 1815.\n* 1850–1896 with a turning point in 1873.\n* Kondratiev supposed that, in 1896, a new cycle had started.\n\nThe long cycle supposedly affects all sectors of an economy. Kondratiev focused on prices and interest rates, seeing the ascendant phase as characterized by an increase in prices and low interest rates, while the other phase consists of a decrease in prices and high interest rates.  Subsequent analysis concentrated on output.\n\nExplanations of the cycle\n\nCause and Effect\n\nUnderstanding the cause and effect of Kondratiev waves is a useful academic discussion and tool. Kondratiev Waves present both causes and effects of common recurring events in capitalistic economies throughout history. Although Kondratiev himself made little differentiation between cause and effect, obvious points emerge intuitively.\n\nThe causes documented by Kondratiev waves, primarily include inequity, opportunity and social freedoms; although very often, much more discussion is made of the notable effects of these causes as well. Effects are both good and bad and include, to name just a few, technological advance, birthrates, revolutions/populism - and revolution's contributing causes which can include racism, religious or political intolerance, failed-freedoms and opportunity, incarceration rates, terrorism and similar. \n\nWhen inequity is low and opportunity is easily available, peaceful, moral decisions are preferred and Aristotle's \"Good Life\" is possible (Americans call the good life \"the American Dream\"). Opportunity created the simple inspiration and genius for the Mayflower Compact for one example; Post-WWII and 1840's post-California gold rush bonanza, were times of great opportunity, low inequity, and this resulted in unprecedented technological industrial advance too. Alternatively, when 1893's global economic panics were not met with sufficient wealth-distributing government policies internationally, a dozen major revolutions resulted – perhaps also creating an effect we now call World War I. Few would argue that World War II also began in response to failed attempts at creating economic opportunity-supporting government policy during the Great Depression of 1929 and WWI's Treaty of Versailles.\n\nCause and effect is used extensively in transition economics, for example, as that science works to build sustainable solutions in government policy to extreme inequity and for its more catastrophic effects.\n\nTechnological innovation theory\n\nAccording to the innovation theory, these waves arise from the bunching of basic innovations that launch technological revolutions that in turn create leading industrial or commercial sectors. Kondratiev's ideas were taken up by Joseph Schumpeter in the 1930s. The theory hypothesized the existence of very long-run macroeconomic and price cycles, originally estimated to last 50–54 years.\n\nIn recent decades there has been considerable progress in historical economics and the history of technology, and numerous investigations of the relationship between technological innovation and economic cycles. Some of the works involving long cycle research and technology include Mensch (1979), Tylecote (1991), The International Institute for Applied Systems Analysis (IIASA) (Marchetti, Ayres), Freeman and Louçã (2001), Andrey Korotayev and Carlota Perez.\n\nPerez (2002) places the phases on a logistic or S curve, with the following labels: the beginning of a technological era as irruption, the ascent as frenzy, the rapid build out as synergy and the completion as maturity.\n\nDemographic theory\n\nBecause people have fairly typical spending patterns through their life cycle, such as spending on schooling, marriage, first car purchase, first home purchase, upgrade home purchase, maximum earnings period, maximum retirement savings and retirement, demographic anomalies such as baby booms and busts exert a rather predictable influence on the economy over a long time period. Harry Dent has written extensively on demographics and economic cycles. Tylecote (1991) devoted a chapter to demographics and the long cycle.\n\nLand speculation\n\nGeorgists, such as Mason Gaffney, Fred Foldvary, and Fred Harrison argue that land speculation is the driving force behind the boom and bust cycle. Land is a finite resource which is necessary for all production, and they claim that because exclusive usage rights are traded around, this creates speculative bubbles, which can be exacerbated by overzealous borrowing and lending. As early as 1997, a number of Georgists predicted that the next crash would come in 2008.\n\nDebt deflation\n\nDebt deflation is a theory of economic cycles, which holds that recessions and depressions are due to the overall level of debt shrinking (deflating): the credit cycle is the cause of the economic cycle.\n\nThe theory was developed by Irving Fisher following the Wall Street Crash of 1929 and the ensuing Great Depression. Debt deflation was largely ignored in favor of the ideas of John Maynard Keynes in Keynesian economics, but has enjoyed a resurgence of interest since the 1980s, both in mainstream economics and in the heterodox school of post-Keynesian economics, and has subsequently been developed by such post-Keynesian economists as Hyman Minsky and Steve Keen.\n\nEconomic controls within the cycle\n\nEdward Tilley suggested in 2016 that by actively correcting inequity within the long wave, capitalist societies can and have avoided depressions. The first documented economic controls for longwaves were \"Jubilees\" – as described on the Code of Hammurabi in 1763 BCE. Transition economics vernacular called empirically-proven inequity-correcting policies, \"TE-Mature\" policies and used a maturity model approach to assist countries while working toward sustainable policy.\n\nModern modifications of Kondratiev theory\n\nInequity appears to be the most obvious driver of  Kondratiev waves, and yet some researches have presented a technological and credit cycle explanation as well.\n\nThere are several modern timing versions of the cycle although most are based on either of two causes: one on technology and the other on the credit cycle.  \n\nAdditionally, there are several versions of the technological cycles, and they are best interpreted using diffusion curves of leading industries.  For example, railways only started in the 1830s, with steady growth for the next 45 years.  It was after Bessemer steel was introduced that railroads had their highest growth rates; however, this period is usually labeled the \"age of steel\".  Measured by value added, the leading industry in the U.S. from 1880 to 1920 was machinery, followed by iron and steel.[http://faculty.wcas.northwestern.edu/~jmokyr/Graphs-and-Tables.PDF Table 7: Ten leading industries in America, by value added, 1914 prices (millions of 1914 $'s)]\n\nThe technological cycles can be labeled as follows:\n\n* The Industrial Revolution—1771\n* The Age of Steam and Railways—1829\n* The Age of Steel and Heavy Engineering—1875\n* The Age of Oil, Electricity, the Automobile and Mass Production—1908\n* The Age of Information and Telecommunications—1971\n\nAny influence of technology during the cycle that began in the Industrial Revolution pertains mainly to England.  The U.S. was a commodity producer and was more influenced by agricultural commodity prices.  There was a commodity price cycle based on increasing consumption causing tight supplies and rising prices.  That allowed new land to the west to be purchased and after four or five years to be cleared and be in production, driving down prices and causing a depression, as in 1819 and 1839.\n\n  By the 1850s the U.S. was becoming industrialized.See: Joseph Whitworth's quote under American system of manufacturing#Use of machinery.\n\nOther researchers\n\nSeveral papers on the relationship between technology and the economy were written by researchers at the International Institute for Applied Systems Analysis (IIASA). A concise version of Kondratiev cycles can be found in the work of Robert Ayres (1989) in which he gives a historical overview of the relationships of the most significant technologies.\n Cesare Marchetti published on Kondretiev waves and on the diffusion of innovations.\n\n Arnulf Grübler’s book (1990) gives a detailed account of the diffusion of infrastructures including canals, railroads, highways and airlines, with findings that the principal infrastructures have midpoints spaced in time corresponding to 55-year K wavelengths, with railroads and highways taking almost a century to complete. Grübler devotes a chapter to the long economic wave.  \nGiancarlo Pallavicini published in 1996 the ratio between the long Kondratiev wave and information technology and communication.\n\nKorotayev et al. recently employed spectral analysis and claimed that it confirmed the presence of Kondratiev waves in the world GDP dynamics at an acceptable level of statistical significance.Spectral analysis is a mathematical technique that is used in such fields as electrical engineering for analyzing electrical circuits and radio waves to deconstruct a complex signal to determine the main frequencies and their relative contribution. Signal analysis is usually done with equipment. Data analysis is done with special computer software. Korotayev et al. also detected shorter business cycles, dating the Kuznets to about 17 years and calling it the third harmonic of the Kondratiev, meaning that there are three Kuznets cycles per Kondratiev.\n\nLeo A. Nefiodow shows that the fifth Kondratieff ended with the global economic crisis of 2000-2003, while the new, sixth Kondratieff started simultaneously. According to Leo A. Nefiodow the carrier of this new long cycle will be health in a holistic sense – including its physical, psychological, mental, social, ecological and spiritual aspects; the basic innovations of the sixth Kondratieff are \"psychosocial health\" and \"biotechnology\".See: Nefiodow, Leo; Nefiodow, Simone (2014): The Sixth Kondratieff. A New Long Wave in the Global Economy. Charleston 2014, .\n\nMore recently the physicist and systems scientist Tessaleno Devezas advanced a causal model for the long wave phenomenon based on a generation-learning model and a nonlinear dynamic behaviour of information systems. In both works a complete theory is presented containing not only the explanation for the existence of K-Waves, but also and for the first time an explanation for the timing of a K-Wave (≈60 years = two generations).\n\nA specific modification of the theory of Kondratieff cycles was developed by Daniel Šmihula. Šmihula identified six long-waves within modern society and the capitalist economy, each of which was initiated by a specific technological revolution:\n\n* 1. (1600–1780) The wave of the Financial-agricultural revolution\n* 2. (1780–1880) The wave of the Industrial revolution\n* 3. (1880–1940) The wave of the Technical revolution\n* 4. (1940–1985) The wave of the Scientific-technical revolution\n* 5. (1985–2015) The wave of the Information and telecommunications revolution\n* 6. (2015–2035?) The hypothetical wave of the post-informational technological revolution\n\nUnlike Kondratieff and Schumpeter, Šmihula believed that each new cycle is shorter than its predecessor. His main stress is put on technological progress and new technologies as decisive factors of any long-time economic development. Each of these waves has its innovation phase, which is described as a technological revolution and an application phase in which the number of revolutionary innovations falls and attention focuses on exploiting and extending existing innovations. As soon as an innovation or a series of innovations becomes available, it becomes more efficient to invest in its adoption, extension and use than in creating new innovations. Each wave of technological innovations can be characterized by the area in which the most revolutionary changes took place (\"leading sectors\").\n\nEvery wave of innovations lasts approximately until the profits from the new innovation or sector fall to the level of other, older, more traditional sectors.  It is a situation when the new technology, which originally increased a capacity to utilize new sources from nature, reached its limits and it is not possible to overcome this limit without an application of another new technology.\n\nFor the end of an application phase of any wave there are typical an economic crisis and stagnation. The economic crisis in 2007–2010 is a result of the coming end of the \"wave of the Information and telecommunications technological revolution\".  Some authors have started to predict what the sixth wave might be, such as James Bradfield Moody and Bianca Nogrady who forecast that it will be driven by resource efficiency and clean technology.\nOn the other hand, Šmihula himself considers the waves of technological innovations during the modern age (after 1600 AD) only as a part of a much longer “chain“ of technological revolutions going back to the pre-modern era. It means he believes that we can find long economic cycles (analogical to Kondratiev cycles in modern economy) dependent on technological revolutions even in the Middle Ages and the Ancient era.\n\nIn \"World Peace – The Transition\", Author Edward Tilley presents research to suggest that these economic booms and depressions are the natural result of climbing inequity and normal capitalism. As opportunity wains near the end of a long wave cycle, deep recessions and depressions are created which in history have resulted in either a war or revolution in approximately 20% of cases; 80% of the time, however, depressions were ended when inequity was reset by government policy and wealth distributions. The Great Depression of 1935 for example, was ended by the California gold rush; an event which multiplied the gold reserves of the U.S. by 10-times. Perhaps a dozen depressions were averted by the Hammurabi Code's economic control of 50-year jubilees in history. This control by jubilee worked within a monarchy form of government; however, within a democracy, all voters would have to be trained to insist upon, and then vote for economic controls which reset inequity. Without this control, depressions become inevitable. Tilley composed a civics course designed to give Grade 10 students this training as well.\n\nCriticism of long cycles\n\nLong wave theory is not accepted by many academic economists. It is important for innovation-based, development, and evolutionary economics however; yet among economists who accept it, there has been no formal universal agreement about the standards that will be used universally to place start and the end years for each wave. Agreement of start and end years can be +1 to 3 years for each 40- to 65-year cycle.\n\nThere can be little doubt  that inequity, created by normal healthy capitalist economies , is the primary the cause of this phenomenon . Health economist and biostatistician Andreas J. W. Goldschmidt searched for patterns and proposed that there is a phase shift and overlap of the so-called Kondratiev cycles of IT and health (shown in the figure). He argued that historical growth phases in combination with key technologies does not necessarily imply the existence of regular cycles in general. Goldschmidt is of the opinion that different fundamental innovations and their economic stimuli do not exclude each other, they mostly vary in length, and their benefit is not applicable to all participants in a \"market.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kondratiev wave" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17282" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In economics, Kondratiev waves (also called supercycles, great surges, long waves, K-waves or the long economic cycle) are hypothesized cycle-like phenomena in the modern world economy.The term long wave originated from a poor early translation of long cycle from Russian to German. Freeman, Chris; Louçã, Francisco (2001) pp 70\n\nIt is stated that the period of a wave ranges from forty to sixty years, the cycles consist of alternating intervals between high sectoral growth and intervals of relatively slow growth.See, e.g. \n\nLong wave theory is not accepted by most academic economists. Among economists who accept it, there is a lack of agreement about both the cause of the waves and the start and end years of particular waves. This points to a major criticism of the theory: that it amounts to seeing patterns in a mass of statistics that aren't really there.\n\nHistory of concept\n\nThe Soviet economist Nikolai Kondratiev (also written Kondratieff or Kondratyev) was the first to bring these observations to international attention in his book The Major Economic Cycles (1925) alongside other works written in the same decade.Vincent Barnett, [http://www.encyclopedia.com/doc/1G2-3404100667.html Nikolai Dmitriyevich Kondratiev], Encyclopedia of Russian History, 2004, at Encyclopedia.com.Erik Buyst, [http://www.highbeam.com/doc/1G2-3447000528.html Kondratiev, Nikolai (1892–1938)], Encyclopedia of Modern Europe: Europe Since 1914: Encyclopedia of the Age of War and Reconstruction, Gale Publishing, January 1, 2006. In 1939, Joseph Schumpeter suggested naming the cycles \"Kondratieff waves\" in his honor.\n\nTwo Dutch economists, Jacob van Gelderen and Salomon de Wolff, had previously argued for the existence of 50- to 60-year cycles in 1913 and 1924, respectively.\n\nSince the inception of the theory, various studies have expanded the range of possible cycles, finding longer or shorter cycles in the data. The Marxist scholar Ernest Mandel revived interest in long-wave theory with his 1964 essay predicting the end of the long boom after five years, and in his Alfred Marshall lectures in 1979. However, in Mandel's theory, there are no long \"cycles\", only distinct epochs of faster and slower growth spanning 20–25 years.\n\nIn 1990, William Thompson at Indiana University has published influential papers and books documenting eighteen K-Waves dating back to 930 AD in China’s Song Province; and Michael Snyder wrote “It should be noted that economic cycle theories have enabled some analysts to correctly predict the timing of recessions, stock market peaks and stock market crashes over the past couple of decades.”\n\nThe historian Eric Hobsbawm also wrote of the theory: \"That good predictions have proved possible on the basis of Kondratiev Long Waves—this is not very common in economics—has convinced many historians and even some economists that there is something in them, even if we don't know what.Hobsbawm (1999), pp. 87f.\n\nEdward Tilley, a researcher and author in transition economics cited the 50-year economic control corrections on the Stone of Hammurabi (1763 BCE) – called \"Jubilees\" – as the first economic controls to recognize and to also counter these natural long waves in capitalist societies.\n\nCharacteristics of the cycle\n\nKondratiev identified three phases in the cycle: expansion, stagnation, and recession. More common today is the division into four periods with a turning point (collapse) between the first and second phases. Writing in the 1920s, Kondratiev proposed to apply the theory to the 19th century:\n* 1790–1849 with a turning point in 1815.\n* 1850–1896 with a turning point in 1873.\n* Kondratiev supposed that, in 1896, a new cycle had started.\n\nThe long cycle supposedly affects all sectors of an economy. Kondratiev focused on prices and interest rates, seeing the ascendant phase as characterized by an increase in prices and low interest rates, while the other phase consists of a decrease in prices and high interest rates.  Subsequent analysis concentrated on output.\n\nExplanations of the cycle\n\nCause and Effect\n\nUnderstanding the cause and effect of Kondratiev waves is a useful academic discussion and tool. Kondratiev Waves present both causes and effects of common recurring events in capitalistic economies throughout history. Although Kondratiev himself made little differentiation between cause and effect, obvious points emerge intuitively.\n\nThe causes documented by Kondratiev waves, primarily include inequity, opportunity and social freedoms; although very often, much more discussion is made of the notable effects of these causes as well. Effects are both good and bad and include, to name just a few, technological advance, birthrates, revolutions/populism - and revolution's contributing causes which can include racism, religious or political intolerance, failed-freedoms and opportunity, incarceration rates, terrorism and similar. \n\nWhen inequity is low and opportunity is easily available, peaceful, moral decisions are preferred and Aristotle's \"Good Life\" is possible (Americans call the good life \"the American Dream\"). Opportunity created the simple inspiration and genius for the Mayflower Compact for one example; Post-WWII and 1840's post-California gold rush bonanza, were times of great opportunity, low inequity, and this resulted in unprecedented technological industrial advance too. Alternatively, when 1893's global economic panics were not met with sufficient wealth-distributing government policies internationally, a dozen major revolutions resulted – perhaps also creating an effect we now call World War I. Few would argue that World War II also began in response to failed attempts at creating economic opportunity-supporting government policy during the Great Depression of 1929 and WWI's Treaty of Versailles.\n\nCause and effect is used extensively in transition economics, for example, as that science works to build sustainable solutions in government policy to extreme inequity and for its more catastrophic effects.\n\nTechnological innovation theory\n\nAccording to the innovation theory, these waves arise from the bunching of basic innovations that launch technological revolutions that in turn create leading industrial or commercial sectors. Kondratiev's ideas were taken up by Joseph Schumpeter in the 1930s. The theory hypothesized the existence of very long-run macroeconomic and price cycles, originally estimated to last 50–54 years.\n\nIn recent decades there has been considerable progress in historical economics and the history of technology, and numerous investigations of the relationship between technological innovation and economic cycles. Some of the works involving long cycle research and technology include Mensch (1979), Tylecote (1991), The International Institute for Applied Systems Analysis (IIASA) (Marchetti, Ayres), Freeman and Louçã (2001), Andrey Korotayev and Carlota Perez.\n\nPerez (2002) places the phases on a logistic or S curve, with the following labels: the beginning of a technological era as irruption, the ascent as frenzy, the rapid build out as synergy and the completion as maturity.\n\nDemographic theory\n\nBecause people have fairly typical spending patterns through their life cycle, such as spending on schooling, marriage, first car purchase, first home purchase, upgrade home purchase, maximum earnings period, maximum retirement savings and retirement, demographic anomalies such as baby booms and busts exert a rather predictable influence on the economy over a long time period. Harry Dent has written extensively on demographics and economic cycles. Tylecote (1991) devoted a chapter to demographics and the long cycle.\n\nLand speculation\n\nGeorgists, such as Mason Gaffney, Fred Foldvary, and Fred Harrison argue that land speculation is the driving force behind the boom and bust cycle. Land is a finite resource which is necessary for all production, and they claim that because exclusive usage rights are traded around, this creates speculative bubbles, which can be exacerbated by overzealous borrowing and lending. As early as 1997, a number of Georgists predicted that the next crash would come in 2008.\n\nDebt deflation\n\nDebt deflation is a theory of economic cycles, which holds that recessions and depressions are due to the overall level of debt shrinking (deflating): the credit cycle is the cause of the economic cycle.\n\nThe theory was developed by Irving Fisher following the Wall Street Crash of 1929 and the ensuing Great Depression. Debt deflation was largely ignored in favor of the ideas of John Maynard Keynes in Keynesian economics, but has enjoyed a resurgence of interest since the 1980s, both in mainstream economics and in the heterodox school of post-Keynesian economics, and has subsequently been developed by such post-Keynesian economists as Hyman Minsky and Steve Keen.\n\nEconomic controls within the cycle\n\nEdward Tilley suggested in 2016 that by actively correcting inequity within the long wave, capitalist societies can and have avoided depressions. The first documented economic controls for longwaves were \"Jubilees\" – as described on the Code of Hammurabi in 1763 BCE. Transition economics vernacular called empirically-proven inequity-correcting policies, \"TE-Mature\" policies and used a maturity model approach to assist countries while working toward sustainable policy.\n\nModern modifications of Kondratiev theory\n\nInequity appears to be the most obvious driver of  Kondratiev waves, and yet some researches have presented a technological and credit cycle explanation as well.\n\nThere are several modern timing versions of the cycle although most are based on either of two causes: one on technology and the other on the credit cycle.  \n\nAdditionally, there are several versions of the technological cycles, and they are best interpreted using diffusion curves of leading industries.  For example, railways only started in the 1830s, with steady growth for the next 45 years.  It was after Bessemer steel was introduced that railroads had their highest growth rates; however, this period is usually labeled the \"age of steel\".  Measured by value added, the leading industry in the U.S. from 1880 to 1920 was machinery, followed by iron and steel.[http://faculty.wcas.northwestern.edu/~jmokyr/Graphs-and-Tables.PDF Table 7: Ten leading industries in America, by value added, 1914 prices (millions of 1914 $'s)]\n\nThe technological cycles can be labeled as follows:\n\n* The Industrial Revolution—1771\n* The Age of Steam and Railways—1829\n* The Age of Steel and Heavy Engineering—1875\n* The Age of Oil, Electricity, the Automobile and Mass Production—1908\n* The Age of Information and Telecommunications—1971\n\nAny influence of technology during the cycle that began in the Industrial Revolution pertains mainly to England.  The U.S. was a commodity producer and was more influenced by agricultural commodity prices.  There was a commodity price cycle based on increasing consumption causing tight supplies and rising prices.  That allowed new land to the west to be purchased and after four or five years to be cleared and be in production, driving down prices and causing a depression, as in 1819 and 1839.\n\n  By the 1850s the U.S. was becoming industrialized.See: Joseph Whitworth's quote under American system of manufacturing#Use of machinery.\n\nOther researchers\n\nSeveral papers on the relationship between technology and the economy were written by researchers at the International Institute for Applied Systems Analysis (IIASA). A concise version of Kondratiev cycles can be found in the work of Robert Ayres (1989) in which he gives a historical overview of the relationships of the most significant technologies.\n Cesare Marchetti published on Kondretiev waves and on the diffusion of innovations.\n\n Arnulf Grübler’s book (1990) gives a detailed account of the diffusion of infrastructures including canals, railroads, highways and airlines, with findings that the principal infrastructures have midpoints spaced in time corresponding to 55-year K wavelengths, with railroads and highways taking almost a century to complete. Grübler devotes a chapter to the long economic wave.  \nGiancarlo Pallavicini published in 1996 the ratio between the long Kondratiev wave and information technology and communication.\n\nKorotayev et al. recently employed spectral analysis and claimed that it confirmed the presence of Kondratiev waves in the world GDP dynamics at an acceptable level of statistical significance.Spectral analysis is a mathematical technique that is used in such fields as electrical engineering for analyzing electrical circuits and radio waves to deconstruct a complex signal to determine the main frequencies and their relative contribution. Signal analysis is usually done with equipment. Data analysis is done with special computer software. Korotayev et al. also detected shorter business cycles, dating the Kuznets to about 17 years and calling it the third harmonic of the Kondratiev, meaning that there are three Kuznets cycles per Kondratiev.\n\nLeo A. Nefiodow shows that the fifth Kondratieff ended with the global economic crisis of 2000-2003, while the new, sixth Kondratieff started simultaneously. According to Leo A. Nefiodow the carrier of this new long cycle will be health in a holistic sense – including its physical, psychological, mental, social, ecological and spiritual aspects; the basic innovations of the sixth Kondratieff are \"psychosocial health\" and \"biotechnology\".See: Nefiodow, Leo; Nefiodow, Simone (2014): The Sixth Kondratieff. A New Long Wave in the Global Economy. Charleston 2014, .\n\nMore recently the physicist and systems scientist Tessaleno Devezas advanced a causal model for the long wave phenomenon based on a generation-learning model and a nonlinear dynamic behaviour of information systems. In both works a complete theory is presented containing not only the explanation for the existence of K-Waves, but also and for the first time an explanation for the timing of a K-Wave (≈60 years = two generations).\n\nA specific modification of the theory of Kondratieff cycles was developed by Daniel Šmihula. Šmihula identified six long-waves within modern society and the capitalist economy, each of which was initiated by a specific technological revolution:\n\n* 1. (1600–1780) The wave of the Financial-agricultural revolution\n* 2. (1780–1880) The wave of the Industrial revolution\n* 3. (1880–1940) The wave of the Technical revolution\n* 4. (1940–1985) The wave of the Scientific-technical revolution\n* 5. (1985–2015) The wave of the Information and telecommunications revolution\n* 6. (2015–2035?) The hypothetical wave of the post-informational technological revolution\n\nUnlike Kondratieff and Schumpeter, Šmihula believed that each new cycle is shorter than its predecessor. His main stress is put on technological progress and new technologies as decisive factors of any long-time economic development. Each of these waves has its innovation phase, which is described as a technological revolution and an application phase in which the number of revolutionary innovations falls and attention focuses on exploiting and extending existing innovations. As soon as an innovation or a series of innovations becomes available, it becomes more efficient to invest in its adoption, extension and use than in creating new innovations. Each wave of technological innovations can be characterized by the area in which the most revolutionary changes took place (\"leading sectors\").\n\nEvery wave of innovations lasts approximately until the profits from the new innovation or sector fall to the level of other, older, more traditional sectors.  It is a situation when the new technology, which originally increased a capacity to utilize new sources from nature, reached its limits and it is not possible to overcome this limit without an application of another new technology.\n\nFor the end of an application phase of any wave there are typical an economic crisis and stagnation. The economic crisis in 2007–2010 is a result of the coming end of the \"wave of the Information and telecommunications technological revolution\".  Some authors have started to predict what the sixth wave might be, such as James Bradfield Moody and Bianca Nogrady who forecast that it will be driven by resource efficiency and clean technology.\nOn the other hand, Šmihula himself considers the waves of technological innovations during the modern age (after 1600 AD) only as a part of a much longer “chain“ of technological revolutions going back to the pre-modern era. It means he believes that we can find long economic cycles (analogical to Kondratiev cycles in modern economy) dependent on technological revolutions even in the Middle Ages and the Ancient era.\n\nIn \"World Peace – The Transition\", Author Edward Tilley presents research to suggest that these economic booms and depressions are the natural result of climbing inequity and normal capitalism. As opportunity wains near the end of a long wave cycle, deep recessions and depressions are created which in history have resulted in either a war or revolution in approximately 20% of cases; 80% of the time, however, depressions were ended when inequity was reset by government policy and wealth distributions. The Great Depression of 1935 for example, was ended by the California gold rush; an event which multiplied the gold reserves of the U.S. by 10-times. Perhaps a dozen depressions were averted by the Hammurabi Code's economic control of 50-year jubilees in history. This control by jubilee worked within a monarchy form of government; however, within a democracy, all voters would have to be trained to insist upon, and then vote for economic controls which reset inequity. Without this control, depressions become inevitable. Tilley composed a civics course designed to give Grade 10 students this training as well.\n\nCriticism of long cycles\n\nLong wave theory is not accepted by many academic economists. It is important for innovation-based, development, and evolutionary economics however; yet among economists who accept it, there has been no formal universal agreement about the standards that will be used universally to place start and the end years for each wave. Agreement of start and end years can be +1 to 3 years for each 40- to 65-year cycle.\n\nThere can be little doubt  that inequity, created by normal healthy capitalist economies , is the primary the cause of this phenomenon . Health economist and biostatistician Andreas J. W. Goldschmidt searched for patterns and proposed that there is a phase shift and overlap of the so-called Kondratiev cycles of IT and health (shown in the figure). He argued that historical growth phases in combination with key technologies does not necessarily imply the existence of regular cycles in general. Goldschmidt is of the opinion that different fundamental innovations and their economic stimuli do not exclude each other, they mostly vary in length, and their benefit is not applicable to all participants in a \"market.\". Kondratiev wave. http://en.wikipedia.org/?curid=17282."
  }
}
