{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2194",
  "eid" : "bea39240-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778399588,
  "textBody" : "Events\n\n* 823 – Lothair I is crowned King of Italy by Pope Paschal I.\n*1081 – Alexios I Komnenos is crowned Byzantine emperor at Constantinople, bringing the Komnenian dynasty to full power.\n*1242 – During the Battle on the Ice of Lake Peipus, Russian forces, led by Alexander Nevsky, rebuff an invasion attempt by the Teutonic Knights.\n*1536 – Royal Entry of Charles V into Rome: The last Roman triumph.\n*1566 – Two-hundred Dutch noblemen, led by Hendrick van Brederode, force themselves into the presence of Margaret of Parma and present the Petition of Compromise, denouncing the Spanish Inquisition in the Seventeen Provinces.\n*1609 – Daimyo (Lord) Shimazu Tadatsune of the Satsuma Domain in southern Kyūshū, Japan, completes his successful invasion of the Ryūkyū Kingdom in Okinawa.\n*1614 – In Virginia, Native American Pocahontas marries English colonist John Rolfe.\n*1621 – The Mayflower sets sail from Plymouth, Massachusetts on a return trip to England.\n*1710 – The Statute of Anne receives the royal assent establishing the Copyright law of the United Kingdom.\n*1722 – The Dutch explorer Jacob Roggeveen discovers Easter Island.\n*1792 – United States President George Washington exercises his authority to veto a bill, the first time this power is used in the United States.\n*1795 – Peace of Basel between France and Prussia is made.\n*1818 – In the Battle of Maipú, Chile's independence movement, led by Bernardo O'Higgins and José de San Martín, win a decisive victory over Spain, leaving 2,000 Spaniards and 1,000 Chilean patriots dead.\n*1862 – American Civil War: The Battle of Yorktown begins.\n*1879 – Chile declares war on Bolivia and Peru, starting the War of the Pacific.\n*1900 – Archaeologists in Knossos, Crete, discover a large cache of clay tablets with hieroglyphic writing in a script they call Linear B.\n*1904 – The first international rugby league match is played between England and an Other Nationalities team (Welsh & Scottish players) in Central Park, Wigan, England.\n*1915 – Boxing challenger Jess Willard knocks out Jack Johnson in Havana, Cuba to become the Heavyweight Champion of the World.\n*1922 – The American Birth Control League, forerunner of Planned Parenthood, is incorporated.\n*1932 – Dominion of Newfoundland: Ten thousand rioters seize the Colonial Building leading to the end of self-government.\n*1933 – U.S. President Franklin D. Roosevelt signs two executive orders: 6101 to establish the Civilian Conservation Corps, and 6102 \"forbidding the Hoarding of Gold Coin, Gold Bullion, and Gold Certificates\" by U.S. citizens.\n*1936 – Tupelo–Gainesville tornado outbreak: An F5 tornado kills 233 in Tupelo, Mississippi.\n*1942 – World War II: The Imperial Japanese Navy launches a carrier-based air attack on Colombo, Ceylon during the Indian Ocean raid. Port and civilian facilities are damaged and the Royal Navy cruisers  and  are sunk southwest of the island.\n*1943 – World War II: American bomber aircraft accidentally cause more than 900 civilian deaths, including 209 children, and 1,300 wounded among the civilian population of the Belgian town of Mortsel. Their target was the Erla factory one kilometer from the residential area hit.\n*1944 – World War II: Two hundred seventy inhabitants of the Greek town of Kleisoura are executed by the Germans.\n*1945 – Cold War: Yugoslav leader Josip Broz Tito signs an agreement with the Soviet Union to allow \"temporary entry of Soviet troops into Yugoslav territory\".\n*1946 – Soviet troops end their year-long occupation of the Danish island of Bornholm.\n*1949 – A fire in a hospital in Effingham, Illinois, kills 77 people and leads to nationwide fire code improvements in the United States.\n*1951 – Cold War: Ethel and Julius Rosenberg are sentenced to death for spying for the Soviet Union.\n*1956 – Cuban Revolution: Fidel Castro declares himself at war with Cuban President Fulgencio Batista.\n*  1956   – In Sri Lanka, the Mahajana Eksath Peramuna win the general elections in a landslide and S. W. R. D. Bandaranaike is sworn in as the Prime Minister of Ceylon.\n*1957 – In India, Communists win the first elections in united Kerala and E. M. S. Namboodiripad is sworn in as the first Chief Minister.\n*1958 – Ripple Rock, an underwater threat to navigation in the Seymour Narrows in Canada is destroyed in one of the largest non-nuclear controlled explosions of the time.\n*1969 – Vietnam War: Massive antiwar demonstrations occur in many U.S. cities.\n*1971 – In Sri Lanka, Janatha Vimukthi Peramuna launches a revolt against the United Front government of Sirimavo Bandaranaike.\n*1976 – In the People's Republic of China, the April Fifth Movement leads to the Tiananmen Incident.\n*1986 – Three people are killed in the bombing of the La Belle discotheque in West Berlin, Germany.\n*1991 – An ASA EMB 120 crashes in Brunswick, Georgia, killing all 23 aboard including Sen. John Tower and astronaut Sonny Carter.\n*1992 – Alberto Fujimori, president of Peru, dissolves the Peruvian congress by military force.\n*1992 – Peace protesters Suada Dilberovic and Olga Sučić are killed on the Vrbanja Bridge in Sarajevo, becoming the first casualties of the Bosnian War.\n*1998 – In Japan, the Akashi Kaikyō Bridge opens to traffic, becoming the longest bridge span in the world.\n*1999 – Two Libyans suspected of bringing down Pan Am Flight 103 in 1988 are handed over for eventual trial in the Netherlands.\n*2009 – North Korea launches its controversial Kwangmyŏngsŏng-2 rocket. The satellite passed over mainland Japan, which prompted an immediate reaction from the United Nations Security Council, as well as participating states of Six-party talks.\n*2010 – Twenty-nine coal miners are killed in an explosion at the Upper Big Branch Mine in West Virginia.\n\nBirths\n\n*1170 – Isabella of Hainault (d. 1190)\n*1288 – Emperor Go-Fushimi of Japan (d. 1336)\n*1315 – James III of Majorca (d. 1349)\n*1472 – Bianca Maria Sforza, Italian wife of Maximilian I, Holy Roman Emperor (d. 1510)\n*1498 – Giovanni dalle Bande Nere, Italian condottiero (d. 1526)\n*1508 – Ercole II d'Este, Duke of Ferrara, Italian noble (d. 1559)\n*1514 – Joachim Mörlin, German bishop (d. 1571)\n*1521 – Francesco Laparelli, Italian architect (d. 1570)\n*1523 – Blaise de Vigenère, French cryptographer and diplomat (d. 1596)\n*1568 – Pope Urban VIII (d. 1644)\n*1586 – Christopher Levett, English explorer (d. 1630)\n*1588 – Thomas Hobbes, English philosopher (d. 1679)\n*1595 – John Wilson, English composer and educator (d. 1674)\n*1604 – Charles IV, Duke of Lorraine (d. 1675)\n*1622 – Vincenzo Viviani, Italian mathematician, astronomer, and physicist (d. 1703)\n*1649 – Elihu Yale, American-English merchant and philanthropist (d. 1721)\n*1692 – Adrienne Lecouvreur, French actress (d. 1730)\n*1719 – Axel von Fersen the Elder, Swedish field marshal and politician, Lord Marshal of Sweden (d. 1794)\n*1727 – Pasquale Anfossi, Italian violinist and composer (d. 1797)\n*1732 – Jean-Honoré Fragonard, French painter and etcher (d. 1806)\n*1752 – Sébastien Érard, French instrument maker (d. 1831)\n*1761 – Sybil Ludington, heroine of the American Revolutionary War (d. 1839)\n*1769 – Sir Thomas Hardy, 1st Baronet, English admiral (d. 1839)\n*1780 – Benjamin Greene, English brewer and businessman, founded Greene King Brewery (d. 1860)\n*1784 – Louis Spohr, German violinist, composer, and conductor (d. 1859)\n*1805 – Samuel Forde, Irish painter (d. 1828)\n*1816 – Samuel Freeman Miller, American physician, lawyer, and jurist (d. 1890)\n*1824 – Moses Dickson, African-American abolitionist, soldier, minister and founder of The Knights of Liberty (d. 1901)\n*1827 – Joseph Lister, 1st Baron Lister, English surgeon and academic (d. 1912)\n*1832 – Jules Ferry, French lawyer and politician, 44th Prime Minister of France (d. 1893)\n*1835 – Carl Theodor Schulz, German-Norwegian gardener (d. 1914)\n*1837 – Algernon Charles Swinburne,  English poet, playwright, novelist, and critic (d. 1909)\n*1839 – Robert Smalls, African-American ship's pilot, sea captain, and politician (d. 1915)\n*1840 – Ghazaros Aghayan, Armenian historian and linguist (d. 1911)\n*1856 – Booker T. Washington, African-American educator, essayist and historian (d. 1915)\n*1857 – Alexander of Battenberg (d. 1893)\n*1858 – Washington Atlee Burpee, Canadian businessman, founded Burpee Seeds (d. 1915)\n*1863 – Princess Victoria of Hesse and by Rhine (d. 1950)\n*1867 – Helen Stratton, British book illustrator (d.1961)\n*1869 – Sergey Chaplygin, Russian physicist, mathematician, and engineer (d. 1942)\n*  1869   – Albert Roussel, French composer (d. 1937)\n*1872 – Samuel Cate Prescott, American microbiologist and chemist (d. 1962)\n*1875 – Mistinguett, French actress and singer (d. 1956)\n*1878 – Paul Weinstein, German high jumper (d. 1964)\n*1883 – Walter Huston, Canadian-American actor and singer (d. 1950)\n*1884 – Ion Inculeț, Bessarabian academic and politician, President of Moldova (d. 1940)\n*1886 – Gustavo Jiménez, Peruvian colonel and politician, 73rd President of Peru (d. 1933)\n*1891 – Arnold Jackson, English runner, soldier, and lawyer (d. 1972)\n*1893 – Clas Thunberg, Finnish speed skater (d. 1973) \n*1894 – Lawrence Dale Bell, American industrialist and founder of Bell Aircraft Corporation (d. 1956)\n*1899 – Alfred Blalock, American surgeon and academic (d. 1964)\n*  1899   – Elsie Thompson, American super-centenarian (d. 2013)\n*1900 – Herbert Bayer, Austrian-American graphic designer, painter, and photographer (d. 1985)\n*  1900   – Josefina Passadori, Argentinian writer and poet (d. 1987)\n*  1900   – Roman Steinberg, Estonian wrestler (d. 1928)\n*  1900   – Spencer Tracy, Irish-American actor (d. 1967)\n*1901 – Melvyn Douglas, American actor (d. 1981)\n*1902 – Wal Handley, English motorcycle road racer (d. 1941)\n*  1902   – Menachem Mendel Schneerson, Russian-American rabbi (d. 1994)\n*1904 – Richard Eberhart, American poet and academic (d. 2005)\n*1906 – Lord Buckley, English-American stage performer, recording artist and monologist (d. 1960)\n*1908 – Bette Davis, American actress (d. 1989)\n*  1908   – Ernestine Gilbreth Carey, German-American author (d. 2006)\n*  1908   – Jagjivan Ram, Indian politician, 4th Deputy Prime Minister of India (d. 1986)\n*  1908   – Herbert von Karajan, Austrian conductor and manager (d. 1989)\n*1909 – Albert R. Broccoli, American film producer, co-founded Eon Productions (d. 1996)\n*  1909   – Erwin Wegner, German hurdler (d. 1945)\n*1911 – Johnny Revolta, American golfer (d. 1991)\n*1912 – Makar Honcharenko, Ukrainian footballer and manager (d. 1997)\n*  1912   – John Le Mesurier, English actor (d. 1983)\n*  1912   – István Örkény, Jewish-Hungarian author and playwright (d. 1979)\n*  1912   – Bill Roberts, English sprinter and soldier (d. 2001)\n*1916 – Albert Henry Ottenweller, American bishop (d. 2012)\n*  1916   – Gregory Peck, American actor, political activist, and producer (d. 2003)\n*1917 – Robert Bloch, American author (d. 1994)\n*1920 – Barend Biesheuvel, Dutch politician, Prime Minister of the Netherlands (d. 2001)\n*  1920   – Arthur Hailey, English-Canadian soldier and author (d. 2004)\n*  1920   – Alfonso Thiele, Turkish-Italian race car driver (d. 1986)\n*  1920   – Rafiq Zakaria, Indian cleric, scholar, and politician (d. 2005)\n*1922 – Tom Finney, English footballer (d. 2014)\n*  1922   – Harry Freedman, Polish-Canadian horn player, composer, and educator (d. 2005)\n*  1922   – Christopher Hewett, English actor and director (d. 2001)\n*  1922   – Gale Storm, American actress and singer (d. 2009)\n*1923 – Michael V. Gazzo, American actor (d. 1995)\n*  1923   – Nguyễn Văn Thiệu, Vietnamese general and politician, 5th President of South Vietnam (d. 2001)\n*1926 – Roger Corman, American actor, director, producer, and screenwriter\n*  1926   – Süleyman Seba, Turkish footballer and colonel (d. 2014)\n*1928 – Fernand Dansereau, Canadian director, producer, and screenwriter\n*  1928   – Haldun Dormen, Turkish actor, director, and producer\n*  1928   – Tony Williams, American singer (d. 1992)\n*1929 – Hugo Claus, Belgian author, poet, and painter (d. 2008)\n*  1929   – Ivar Giaever, Norwegian-American physicist and academic, Nobel Prize laureate\n*  1929   – Nigel Hawthorne, English actor and producer (d. 2001)\n*  1929   – Joe Meek, English songwriter and producer (d. 1967)\n*1931 – Jack Clement, American singer-songwriter and producer (d. 2013)\n*1933 – Frank Gorshin, American actor (d. 2005)\n*  1933   – Barbara Holland, American author (d. 2010)\n*  1933   – K. Kailasapathy, Sri Lankan journalist and academic (d. 1982)\n*1934 – John Carey, English author and critic\n*  1934   – Roman Herzog, German lawyer and politician, 7th President of Germany (d. 2017)\n*  1934   – Moise Safra, Brazilian businessman and philanthropist, co-founded Banco Safra (d. 2014)\n*  1934   – Stanley Turrentine, American saxophonist and composer (d. 2000)\n*1935 – Peter Grant, English talent manager (d. 1995)\n*  1935   – Donald Lynden-Bell, English astrophysicist and astronomer\n*1936 – John Kelly, PIRA volunteer and Sinn Féin politician (d. 2007)\n*1937 – Joseph Lelyveld, American journalist and author\n*  1937   – Colin Powell, American general and politician, 65th United States Secretary of State\n*1938 – Colin Bland, Zimbabwean-South African cricketer\n*  1938   – Nancy Holt, American sculptor and painter (d. 2014) \n*1938 – Mal Colston, Australian educator and politician (d. 2003)\n*1938 – Natalya Kustinskaya, Soviet actress (d. 2012)\n*1939 – Crispian St. Peters, English singer-songwriter (d. 2010)\n*  1939   – Ronald White, American singer-songwriter (d. 1995)\n*1940 – Tommy Cash, American singer-songwriter and guitarist\n*  1940   – Gilles Proulx, Canadian journalist, historian, and radio host\n*1941 – Michael Moriarty, American-Canadian actor \n*  1941   – Dave Swarbrick, English singer-songwriter and fiddler (d. 2016)\n*1942 – Allan Clarke, English singer-songwriter \n*  1942   – Peter Greenaway, Welsh director and screenwriter\n*1943 – Max Gail, American actor and director\n*  1943   – Fighting Harada, Japanese boxer\n*  1943   – Jean-Louis Tauran, French cardinal\n*1944 – Peter T. King, American soldier, lawyer, and politician\n*  1944   – Pedro Rosselló, Puerto Rican physician and politician, 7th Governor of Puerto Rico\n*1946 – Jane Asher, English actress\n*  1946   – Russell Davies, Welsh journalist and radio host\n*  1946   – Takuro Yoshida, Japanese singer-songwriter\n*1947 – Gloria Macapagal-Arroyo, Filipino academic and politician, 14th President of the Philippines\n*  1947   – Virendra Sharma, Indian-English lawyer and politician\n*1948 – Les Binks, Irish drummer and songwriter \n*  1948   – Dave Holland, English drummer (d. 2018) \n*1949 – Judith Resnik, Ukrainian Jewish-American engineer and astronaut (d. 1986)\n*1950 – Agnetha Fältskog, Swedish singer-songwriter and producer\n*1951 – Yevgeniy Gavrilenko, Belarusian hurdler\n*  1951   – Dean Kamen, American inventor and businessman, founded Segway Inc.\n*  1951   – Dave McArtney, New Zealand singer-songwriter and guitarist (d. 2013)\n*1952 – John C. Dvorak, American author, editor and co-host of No Agenda podcast\n*  1952   – Mitch Pileggi, American actor\n*1953 – Frank Gaffney, American journalist and radio host\n*  1953   – Ian Swales, English accountant and politician\n*1954 – Guy Bertrand, Canadian linguist and radio host\n*  1954 – Peter Case, American singer-songwriter and guitarist\n*  1954   – Stan Ridgway, American singer-songwriter and guitarist \n*1955 – Charlotte de Turckheim, French actress, producer, and screenwriter\n*  1955   – Anthony Horowitz, English author and screenwriter\n*  1955   – Akira Toriyama, Japanese illustrator\n*1956 – Diamond Dallas Page, American wrestler and actor\n*1957 – Karin Roßley, German hurdler \n*1958 – Johan Kriek, South African-American tennis player\n*  1958   – Diana Nasution, Indonesian singer\n*  1958   – Lasantha Wickrematunge, Sri Lankan lawyer and journalist (d. 2009)\n*1959 – Julius Drake, English pianist and educator\n*1960 – Asteris Koutoulas, Romanian-German record producer, manager, and author\n*  1960   – Larry McCray, American singer-songwriter and guitarist\n*  1960   – Ian Redford, Scottish footballer and manager (d. 2014)\n*1961 – Jim LeRoy, American pilot (d. 2007)\n*1962 – Charlie Adam, Scottish footballer (d. 2012)\n*  1962   – Lana Clarkson, American actress and model (d. 2003)\n*  1962   – Gord Donnelly, Canadian ice hockey player and scout\n*  1962   – Kirsan Ilyumzhinov, Kalmyk businessman and politician, 1st President of Kalmykia\n*1964 – Princess Erika, French singer-songwriter \n*  1964   – Marius Lăcătuș, Romanian footballer and coach\n*  1964   – Christopher Reid, American rapper and actor \n*1965 – Cris Carpenter, American baseball player and educator\n*  1965   – Aykut Kocaman, Turkish footballer and manager\n*1966 – Mike McCready, American guitarist and songwriter \n*1967 – Gary Gait, Canadian lacrosse player and coach\n*  1967   – Anu Garg, Indian-American journalist and author\n*  1967   – Troy Gentry, American singer-songwriter and guitarist (d. 2017) \n*1968 – Paula Cole, American singer-songwriter and pianist\n*  1968   – Stewart Lee, British standup comedian and writer\n*1969 – Ryan Birch, English martial artist (d. 2013)\n*1970 – Soheil Ayari, French race car driver\n*  1970   – Krishnan Guru-Murthy, English journalist\n*  1970   – Miho Hatori, Japanese singer-songwriter \n*1971 – Dong Abay, Filipino singer-songwriter and guitarist \n*  1971   – Ayako Nishikawa, Japanese television personality, entertainer, comedian, and surgeon\n*1972 – Tim Coronel, Dutch race car driver\n*  1972   – Pat Green, American singer-songwriter and guitarist\n*  1972   – Paul Okon, Australian footballer and manager\n*  1972   – Waylon Payne, American singer-songwriter and actor\n*  1972   – Duncan Spencer, English cricketer\n*  1972   – Yasuhiro Takemoto, Japanese animator and director\n*1973 – Tony Banks, American football player and journalist\n*  1973   – Élodie Bouchez, French-American actress\n*  1973   – Brendan Cannon, Australian rugby player\n*  1973   – Cho Sung-min, South Korean baseball player (d. 2013)\n*  1973   – Pharrell Williams, American rapper, producer, and fashion designer \n*1974 – Sahaj, American singer-songwriter \n*  1974   – Marcus Jones, English lawyer and politician\n*  1974   – Vyacheslav Voronin, Russian high jumper\n*  1974   – Sheryl Cruz, Filipino actress and singer\n*1975 – Sarah Baldock, English organist and conductor\n*  1975   – John Hartson, Welsh footballer and coach\n*  1975   – Juicy J, American rapper and producer \n*  1975   – Caitlin Moran, English journalist, author, and critic\n*  1975   – Shammond Williams, American basketball player and coach\n*1976 – Ryan Drese, American baseball player\n*  1976   – Ross Gload, American baseball player\n*  1976   – Simone Inzaghi, Italian footballer\n*  1976   – Fernando Morientes, Spanish footballer and coach\n*  1976   – Indrek Tobreluts, Estonian biathlete\n*1977 – Stella Creasy, English psychologist and politician\n*1978 – Robert Glasper, African-American singer-songwriter, pianist, and producer\n*  1978   – Stephen Jackson, American basketball player\n*  1978   – Franziska van Almsick, German swimmer\n*1979 – Timo Hildebrand, German footballer\n*  1979   – Mitsuo Ogasawara, Japanese footballer\n*  1979   – Benji Radach, American mixed martial artist and trainer\n*  1979   – Dante Wesley, American football player\n*1980 – Matt Bonner, American basketball player\n*  1980   – David Chocarro, Argentinian baseball player and actor\n*  1980   – Mary Katharine Ham, American journalist and blogger\n*  1980   – Joris Mathijsen, Dutch footballer\n*1981 – Jorge de la Rosa, Mexican baseball player\n*  1981   – Michael A. Monsoor, American sailor, Medal of Honor recipient (d. 2006)\n*1982 – Hayley Atwell, English-American actress\n*  1982   – Thomas Hitzlsperger, German footballer\n*  1982   – Kelly Pavlik, American boxer\n*  1982   – Matt Pickens, American soccer player\n*  1982   – Alexandre Prémat, French race car driver\n*1983 – Jorge Andrés Martínez, Uruguayan footballer\n*1984 – David Dillehunt, American director, producer, and composer\n*  1984   – Kisho Yano, Japanese footballer\n*  1984   – Shin Min-a, South Korean actress\n*1984 – Saba Qamar, Pakistani actress-model\n*1985 – Daniel Congré, French footballer\n*  1985   – Lastings Milledge, American baseball player\n*1987 – Max Grün, German footballer\n*  1987   – Sergei Lepmets, Estonian footballer\n*1988 – Jon Kwang-ik, North Korean footballer\n*  1988   – Asumi Nakada, Japanese voice actress and model\n*  1988   – Christopher Papamichalopoulos, Cypriot skier\n*  1988   – Alex Valentini, Italian footballer\n*1989 – Lily James, English actress\n*1990 – Patrick Dangerfield, Australian rules footballer\n*1992 – Emmalyn Estrada, Canadian singer-songwriter and dancer\n*1993 – Benjamin Garcia, French rugby league player\n*  1993   – Maya DiRado, American swimmer\n*1995 – Viliame Kikau, Fijian rugby league player\n*1996 – Nicolas Beer, Danish racing driver\n*1998 – Kaito Nakamura, Japanese actor and model\n*1999 – Sharlene San Pedro, Filipino actress, singer, and dancer\n\nDeaths\n\n* 517 – Timothy I of Constantinople\n* 582 – Eutychius of Constantinople (b. 512)\n* 584 – Ruadán of Lorrha, Irish abbot\n* 902 – Al-Mu'tadid, Iraqi caliph (b. 960)\n*1168 – Robert de Beaumont, 2nd Earl of Leicester, English politician (b. 1104)\n*1205 – Queen Isabella I of Jerusalem (b. 1172)\n*1258 – Saint Juliana of Liège\n*1340 – William Melton, English archbishop \n*1419 – Vincent Ferrer, Spanish missionary and saint (b. 1350)\n*1431 – Bernard I, Margrave of Baden-Baden (b. 1364)\n*1534 – Jan Matthys, Anabaptist reformer\n*1605 – Adam Loftus, English-Irish archbishop and politician, Lord Chancellor of Ireland (b. 1513)\n*1617 – Alonso Lobo, Spanish composer (b. 1555)\n*1673 – François Caron, Belgian-French explorer and politician, 8th Governor of Formosa (b. 1600)\n*1693 – Anne Marie Louise d'Orléans, Duchess of Montpensier (b. 1627)\n*1695 – George Savile, 1st Marquess of Halifax, English politician, Lord President of the Council (b. 1633)\n*1697 – Charles XI of Sweden (b. 1655)\n*1717 – Jean Jouvenet, French painter (b. 1647)\n*1735 – William Derham, English minister and philosopher (b. 1657)\n*  1735   – Samuel Wesley, English clergyman and poet (b. 1662)\n*1765 – Edward Young, English poet and author (b. 1683)\n*1794 – Georges Danton, French lawyer and politician, French Minister of Justice (b. 1759)\n*  1794   – Camille Desmoulins, French journalist, lawyer, and politician (b. 1760)\n*1804 – Jean-Charles Pichegru, French general (b. 1761)\n*1834 – Richard Goodwin Keats, English admiral and politician, 40th Commodore Governor of Newfoundland (b. 1757)\n*1864 – Alaric Alexander Watts, English poet and journalist (b. 1797)\n*1900 – Joseph Louis François Bertrand, French mathematician, economist, and academic (b. 1822)\n*  1900   – Osman Nuri Pasha, Ottoman field marshal and the hero of the Siege of Plevna in 1877 (b. 1832)\n*1923 – George Herbert, 5th Earl of Carnarvon, English archaeologist and businessman (b. 1866)\n*1928 – Roy Kilner, English cricketer and soldier (b. 1890)\n*1936 – Chandler Egan, American golfer and architect (b. 1884)\n*1940 – Charles Freer Andrews, English-Indian priest, missionary, and educator (b. 1871)\n*1941 – Nigel Gresley, Scottish-English engineer (b. 1876)\n*1943 – Aleš Hrdlička, Czech-American anthropologist and scholar (b. 1869)\n*1945 – Karl-Otto Koch, German SS officer (b. 1897)\n*1946 – Vincent Youmans, American composer and producer (b. 1898)\n*1952 – Charles Collett, English engineer (b. 1871)\n*1964 – Douglas MacArthur, American general (b. 1880)\n*1966 – John Henry Starling, Australian public servant (b. 1883)\n*1967 – Mischa Elman, Ukrainian-American violinist (b. 1891)\n*  1967   – Hermann Joseph Muller, American geneticist and academic, Nobel Prize laureate (b. 1890)\n*1969 – Ain-Ervin Mere, Estonian SS officer (b. 1903)\n*  1969   – Shelby Storck, American journalist, actor, director, and producer (b. 1917)\n*1970 – Alfred Sturtevant, American geneticist and academic (b. 1891)\n*1972 – Brian Donlevy, American actor and producer (b. 1901)\n*  1972   – Isabel Jewell, American actress and singer (b. 1907)\n*  1972   – Robert Speck, Canadian politician, 1st Mayor of Mississauga (b. 1915)\n*1973 – John Coleman, Australian footballer and coach (b. 1928)\n*1974 – A. Y. Jackson, Canadian painter (b. 1882)\n*1975 – Chiang Kai-shek, Chinese general and politician, 1st President of the Republic of China (b. 1887)\n*1976 – Howard Hughes, American pilot, engineer, and director (b. 1905)\n*  1976   – Wilder Penfield, American-Canadian surgeon and academic (b. 1891)\n*1979 – Eugène Gabritschevsky, Russian biologist and painter (b. 1893)\n*1981 – Bob Hite, American singer-songwriter (b. 1945)\n*1982 – Abe Fortas, American lawyer and jurist (b. 1910)\n*1983 – Danny Rapp, American singer-songwriter (b. 1941)\n*1984 – Nikolai Matvejev, Estonian cyclist (b. 1923)\n*1987 – Jan Lindblad, Swedish journalist and photographer (b. 1932)\n*1989 – María Cristina Gómez, Salvadoran educator and activist (b. 1938)\n*1991 – Sonny Carter, American soccer player, physician, and astronaut (b. 1947)\n*  1991   – John Tower, American soldier, academic, and politician (b. 1925)\n*1992 – Sam Walton, American businessman, founded Walmart and Sam's Club (b. 1918)\n*1993 – Divya Bharti, Indian actress (b. 1974)\n*1994 – Kurt Cobain, American singer-songwriter and guitarist (b. 1967)\n*  1994   – Roy Smeck, American country musician (b. 1900)\n*1995 – Françoise Loranger, Canadian playwright and producer (b. 1913)\n*1996 – Larry LaPrise, American songwriter (b. 1913)\n*1997 – Allen Ginsberg, American poet (b. 1926)\n*1998 – Cozy Powell, English drummer (b. 1947)\n*1999 – Paul David, Canadian cardiologist and politician (b. 1919)\n*2000 – Lee Petty, American race car driver (b. 1914)\n*2001 – Brother Theodore, German-American comedian, actor, and screenwriter (b. 1906)\n*2001 – Malcolm Shepherd, 2nd Baron Shepherd (b. 1918)\n*2002 – Layne Staley, American singer-songwriter (b. 1967)\n*2004 – Sławomir Rawicz, Polish lieutenant (b. 1915)\n*  2004   – Heiner Zieschang, German mathematician and academic (b. 1936)\n*2005 – Saul Bellow, Canadian-American novelist, essayist and short story writer, Nobel Prize laureate (b. 1915)\n*  2005   – Dale Messick, American author and illustrator (b. 1906)\n*  2005   – John Sichel, French-English director, producer, and screenwriter (b. 1937)\n*  2005   – Neil Welliver, American painter (b. 1929)\n*2006 – Allan Kaprow, American painter and educator (b. 1927)\n*  2006   – Gene Pitney, American singer-songwriter (b. 1941)\n*2007 – Maria Gripe, Swedish journalist and author (b. 1923)\n*  2007   – Leela Majumdar, Indian author and academic (b. 1908)\n*  2007   – Mark St. John, American guitarist (b. 1956)\n*  2007   – Darryl Stingley, American football player and scout (b. 1951)\n*  2007   – Poornachandra Tejaswi, Indian ornithologist, author, and photographer (b. 1938)\n*2008 – Charlton Heston, American actor, director, and political activist (b. 1923)\n*2009 – Constantine Papadakis, Greek-American businessman and academic (b. 1946)\n*2012 – Joe Avezzano, American football player and coach (b. 1943)\n*  2012   – Jim Herr, American businessman, founded Herr's Snacks (b. 1924)\n*  2012   – Jim Marshall, English businessman, founded Marshall Amplification (b. 1923)\n*  2012   – Gil Noble, American journalist and producer (b. 1932)\n*  2012   – Peter Tapsell, New Zealand surgeon and politician, 30th New Zealand Minister of Defence (b. 1930)\n*  2012   – Bingu wa Mutharika, Malawian economist and politician, 3rd President of Malawi (b. 1934)\n*  2012   – Nakatindi Wina, Zambian Princess and politician\n*2013 – Regina Bianchi, Italian actress (b. 1921)\n*  2013   – Amnon Dankner, Israeli journalist and author (b. 1946)\n*  2013   – Piero de Palma, Italian tenor and actor (b. 1924)\n*  2013   – Dave Hunt, American radio host and author (b. 1926)\n*  2013   – Mohammad Ishaq Khan, Indian historian and academic (b. 1946)\n*  2013   – David Kuo, American journalist and author (b. 1968)\n*  2013   – Nikolaos Pappas, Greek admiral and politician, Greek Minister for Mercantile Marine (b. 1930)\n*2014 – Alan Davie, Scottish saxophonist and painter (b. 1920)\n*  2014   – Peter Matthiessen, American novelist, short story writer, editor, co-founded The Paris Review (b. 1927)\n*  2014   – John Pinette, American comedian (b. 1964)\n*  2014   – Gordon Smith, Scottish footballer (b. 1954)\n*  2014   – José Wilker, Brazilian actor, director, and producer (b. 1947)\n*2015 – Fredric Brandt, American dermatologist and author (b. 1949)\n*  2015   – Juan Carlos Cáceres, Argentinian singer and pianist (b. 1936)\n*  2015   – Richard Dysart, American actor (b. 1929)\n*  2015   – Steve Rickard, New Zealand-Australian wrestler, trainer, and promoter (b. 1929)\n*  2015   – Julie Wilson, American actress and singer (b. 1924)\n*2016 – Koço Kasapoğlu, Turkish footballer (b. 1936)\n\nHolidays and observances\n\n*Christian feast day:\n**Albert of Montecorvino\n**Blessed Mariano de la Mata\n**Derfel Gadarn\n**Æthelburh of Kent\n**Gerald of Sauve-Majeure\n**Juliana of Liège\n**Maria Crescentia Höss\n**Pandita Mary Ramabai (Episcopal Church (USA)) \n**Ruadhán of Lorrha\n**Vincent Ferrer\n**April 5 (Eastern Orthodox liturgics)\n*Cold Food Festival, held on April 4 if it is a leap year (China); and its related observances:\n*Earliest day on which Sham el-Nessim can fall, while May 9 is the latest; celebrated on Monday after the Orthodox Easter (Egypt)\n*Children's Day (Palestinian territories)\n*Sikmogil (South Korea)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "April 5" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2194" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 823 – Lothair I is crowned King of Italy by Pope Paschal I.\n*1081 – Alexios I Komnenos is crowned Byzantine emperor at Constantinople, bringing the Komnenian dynasty to full power.\n*1242 – During the Battle on the Ice of Lake Peipus, Russian forces, led by Alexander Nevsky, rebuff an invasion attempt by the Teutonic Knights.\n*1536 – Royal Entry of Charles V into Rome: The last Roman triumph.\n*1566 – Two-hundred Dutch noblemen, led by Hendrick van Brederode, force themselves into the presence of Margaret of Parma and present the Petition of Compromise, denouncing the Spanish Inquisition in the Seventeen Provinces.\n*1609 – Daimyo (Lord) Shimazu Tadatsune of the Satsuma Domain in southern Kyūshū, Japan, completes his successful invasion of the Ryūkyū Kingdom in Okinawa.\n*1614 – In Virginia, Native American Pocahontas marries English colonist John Rolfe.\n*1621 – The Mayflower sets sail from Plymouth, Massachusetts on a return trip to England.\n*1710 – The Statute of Anne receives the royal assent establishing the Copyright law of the United Kingdom.\n*1722 – The Dutch explorer Jacob Roggeveen discovers Easter Island.\n*1792 – United States President George Washington exercises his authority to veto a bill, the first time this power is used in the United States.\n*1795 – Peace of Basel between France and Prussia is made.\n*1818 – In the Battle of Maipú, Chile's independence movement, led by Bernardo O'Higgins and José de San Martín, win a decisive victory over Spain, leaving 2,000 Spaniards and 1,000 Chilean patriots dead.\n*1862 – American Civil War: The Battle of Yorktown begins.\n*1879 – Chile declares war on Bolivia and Peru, starting the War of the Pacific.\n*1900 – Archaeologists in Knossos, Crete, discover a large cache of clay tablets with hieroglyphic writing in a script they call Linear B.\n*1904 – The first international rugby league match is played between England and an Other Nationalities team (Welsh & Scottish players) in Central Park, Wigan, England.\n*1915 – Boxing challenger Jess Willard knocks out Jack Johnson in Havana, Cuba to become the Heavyweight Champion of the World.\n*1922 – The American Birth Control League, forerunner of Planned Parenthood, is incorporated.\n*1932 – Dominion of Newfoundland: Ten thousand rioters seize the Colonial Building leading to the end of self-government.\n*1933 – U.S. President Franklin D. Roosevelt signs two executive orders: 6101 to establish the Civilian Conservation Corps, and 6102 \"forbidding the Hoarding of Gold Coin, Gold Bullion, and Gold Certificates\" by U.S. citizens.\n*1936 – Tupelo–Gainesville tornado outbreak: An F5 tornado kills 233 in Tupelo, Mississippi.\n*1942 – World War II: The Imperial Japanese Navy launches a carrier-based air attack on Colombo, Ceylon during the Indian Ocean raid. Port and civilian facilities are damaged and the Royal Navy cruisers  and  are sunk southwest of the island.\n*1943 – World War II: American bomber aircraft accidentally cause more than 900 civilian deaths, including 209 children, and 1,300 wounded among the civilian population of the Belgian town of Mortsel. Their target was the Erla factory one kilometer from the residential area hit.\n*1944 – World War II: Two hundred seventy inhabitants of the Greek town of Kleisoura are executed by the Germans.\n*1945 – Cold War: Yugoslav leader Josip Broz Tito signs an agreement with the Soviet Union to allow \"temporary entry of Soviet troops into Yugoslav territory\".\n*1946 – Soviet troops end their year-long occupation of the Danish island of Bornholm.\n*1949 – A fire in a hospital in Effingham, Illinois, kills 77 people and leads to nationwide fire code improvements in the United States.\n*1951 – Cold War: Ethel and Julius Rosenberg are sentenced to death for spying for the Soviet Union.\n*1956 – Cuban Revolution: Fidel Castro declares himself at war with Cuban President Fulgencio Batista.\n*  1956   – In Sri Lanka, the Mahajana Eksath Peramuna win the general elections in a landslide and S. W. R. D. Bandaranaike is sworn in as the Prime Minister of Ceylon.\n*1957 – In India, Communists win the first elections in united Kerala and E. M. S. Namboodiripad is sworn in as the first Chief Minister.\n*1958 – Ripple Rock, an underwater threat to navigation in the Seymour Narrows in Canada is destroyed in one of the largest non-nuclear controlled explosions of the time.\n*1969 – Vietnam War: Massive antiwar demonstrations occur in many U.S. cities.\n*1971 – In Sri Lanka, Janatha Vimukthi Peramuna launches a revolt against the United Front government of Sirimavo Bandaranaike.\n*1976 – In the People's Republic of China, the April Fifth Movement leads to the Tiananmen Incident.\n*1986 – Three people are killed in the bombing of the La Belle discotheque in West Berlin, Germany.\n*1991 – An ASA EMB 120 crashes in Brunswick, Georgia, killing all 23 aboard including Sen. John Tower and astronaut Sonny Carter.\n*1992 – Alberto Fujimori, president of Peru, dissolves the Peruvian congress by military force.\n*1992 – Peace protesters Suada Dilberovic and Olga Sučić are killed on the Vrbanja Bridge in Sarajevo, becoming the first casualties of the Bosnian War.\n*1998 – In Japan, the Akashi Kaikyō Bridge opens to traffic, becoming the longest bridge span in the world.\n*1999 – Two Libyans suspected of bringing down Pan Am Flight 103 in 1988 are handed over for eventual trial in the Netherlands.\n*2009 – North Korea launches its controversial Kwangmyŏngsŏng-2 rocket. The satellite passed over mainland Japan, which prompted an immediate reaction from the United Nations Security Council, as well as participating states of Six-party talks.\n*2010 – Twenty-nine coal miners are killed in an explosion at the Upper Big Branch Mine in West Virginia.\n\nBirths\n\n*1170 – Isabella of Hainault (d. 1190)\n*1288 – Emperor Go-Fushimi of Japan (d. 1336)\n*1315 – James III of Majorca (d. 1349)\n*1472 – Bianca Maria Sforza, Italian wife of Maximilian I, Holy Roman Emperor (d. 1510)\n*1498 – Giovanni dalle Bande Nere, Italian condottiero (d. 1526)\n*1508 – Ercole II d'Este, Duke of Ferrara, Italian noble (d. 1559)\n*1514 – Joachim Mörlin, German bishop (d. 1571)\n*1521 – Francesco Laparelli, Italian architect (d. 1570)\n*1523 – Blaise de Vigenère, French cryptographer and diplomat (d. 1596)\n*1568 – Pope Urban VIII (d. 1644)\n*1586 – Christopher Levett, English explorer (d. 1630)\n*1588 – Thomas Hobbes, English philosopher (d. 1679)\n*1595 – John Wilson, English composer and educator (d. 1674)\n*1604 – Charles IV, Duke of Lorraine (d. 1675)\n*1622 – Vincenzo Viviani, Italian mathematician, astronomer, and physicist (d. 1703)\n*1649 – Elihu Yale, American-English merchant and philanthropist (d. 1721)\n*1692 – Adrienne Lecouvreur, French actress (d. 1730)\n*1719 – Axel von Fersen the Elder, Swedish field marshal and politician, Lord Marshal of Sweden (d. 1794)\n*1727 – Pasquale Anfossi, Italian violinist and composer (d. 1797)\n*1732 – Jean-Honoré Fragonard, French painter and etcher (d. 1806)\n*1752 – Sébastien Érard, French instrument maker (d. 1831)\n*1761 – Sybil Ludington, heroine of the American Revolutionary War (d. 1839)\n*1769 – Sir Thomas Hardy, 1st Baronet, English admiral (d. 1839)\n*1780 – Benjamin Greene, English brewer and businessman, founded Greene King Brewery (d. 1860)\n*1784 – Louis Spohr, German violinist, composer, and conductor (d. 1859)\n*1805 – Samuel Forde, Irish painter (d. 1828)\n*1816 – Samuel Freeman Miller, American physician, lawyer, and jurist (d. 1890)\n*1824 – Moses Dickson, African-American abolitionist, soldier, minister and founder of The Knights of Liberty (d. 1901)\n*1827 – Joseph Lister, 1st Baron Lister, English surgeon and academic (d. 1912)\n*1832 – Jules Ferry, French lawyer and politician, 44th Prime Minister of France (d. 1893)\n*1835 – Carl Theodor Schulz, German-Norwegian gardener (d. 1914)\n*1837 – Algernon Charles Swinburne,  English poet, playwright, novelist, and critic (d. 1909)\n*1839 – Robert Smalls, African-American ship's pilot, sea captain, and politician (d. 1915)\n*1840 – Ghazaros Aghayan, Armenian historian and linguist (d. 1911)\n*1856 – Booker T. Washington, African-American educator, essayist and historian (d. 1915)\n*1857 – Alexander of Battenberg (d. 1893)\n*1858 – Washington Atlee Burpee, Canadian businessman, founded Burpee Seeds (d. 1915)\n*1863 – Princess Victoria of Hesse and by Rhine (d. 1950)\n*1867 – Helen Stratton, British book illustrator (d.1961)\n*1869 – Sergey Chaplygin, Russian physicist, mathematician, and engineer (d. 1942)\n*  1869   – Albert Roussel, French composer (d. 1937)\n*1872 – Samuel Cate Prescott, American microbiologist and chemist (d. 1962)\n*1875 – Mistinguett, French actress and singer (d. 1956)\n*1878 – Paul Weinstein, German high jumper (d. 1964)\n*1883 – Walter Huston, Canadian-American actor and singer (d. 1950)\n*1884 – Ion Inculeț, Bessarabian academic and politician, President of Moldova (d. 1940)\n*1886 – Gustavo Jiménez, Peruvian colonel and politician, 73rd President of Peru (d. 1933)\n*1891 – Arnold Jackson, English runner, soldier, and lawyer (d. 1972)\n*1893 – Clas Thunberg, Finnish speed skater (d. 1973) \n*1894 – Lawrence Dale Bell, American industrialist and founder of Bell Aircraft Corporation (d. 1956)\n*1899 – Alfred Blalock, American surgeon and academic (d. 1964)\n*  1899   – Elsie Thompson, American super-centenarian (d. 2013)\n*1900 – Herbert Bayer, Austrian-American graphic designer, painter, and photographer (d. 1985)\n*  1900   – Josefina Passadori, Argentinian writer and poet (d. 1987)\n*  1900   – Roman Steinberg, Estonian wrestler (d. 1928)\n*  1900   – Spencer Tracy, Irish-American actor (d. 1967)\n*1901 – Melvyn Douglas, American actor (d. 1981)\n*1902 – Wal Handley, English motorcycle road racer (d. 1941)\n*  1902   – Menachem Mendel Schneerson, Russian-American rabbi (d. 1994)\n*1904 – Richard Eberhart, American poet and academic (d. 2005)\n*1906 – Lord Buckley, English-American stage performer, recording artist and monologist (d. 1960)\n*1908 – Bette Davis, American actress (d. 1989)\n*  1908   – Ernestine Gilbreth Carey, German-American author (d. 2006)\n*  1908   – Jagjivan Ram, Indian politician, 4th Deputy Prime Minister of India (d. 1986)\n*  1908   – Herbert von Karajan, Austrian conductor and manager (d. 1989)\n*1909 – Albert R. Broccoli, American film producer, co-founded Eon Productions (d. 1996)\n*  1909   – Erwin Wegner, German hurdler (d. 1945)\n*1911 – Johnny Revolta, American golfer (d. 1991)\n*1912 – Makar Honcharenko, Ukrainian footballer and manager (d. 1997)\n*  1912   – John Le Mesurier, English actor (d. 1983)\n*  1912   – István Örkény, Jewish-Hungarian author and playwright (d. 1979)\n*  1912   – Bill Roberts, English sprinter and soldier (d. 2001)\n*1916 – Albert Henry Ottenweller, American bishop (d. 2012)\n*  1916   – Gregory Peck, American actor, political activist, and producer (d. 2003)\n*1917 – Robert Bloch, American author (d. 1994)\n*1920 – Barend Biesheuvel, Dutch politician, Prime Minister of the Netherlands (d. 2001)\n*  1920   – Arthur Hailey, English-Canadian soldier and author (d. 2004)\n*  1920   – Alfonso Thiele, Turkish-Italian race car driver (d. 1986)\n*  1920   – Rafiq Zakaria, Indian cleric, scholar, and politician (d. 2005)\n*1922 – Tom Finney, English footballer (d. 2014)\n*  1922   – Harry Freedman, Polish-Canadian horn player, composer, and educator (d. 2005)\n*  1922   – Christopher Hewett, English actor and director (d. 2001)\n*  1922   – Gale Storm, American actress and singer (d. 2009)\n*1923 – Michael V. Gazzo, American actor (d. 1995)\n*  1923   – Nguyễn Văn Thiệu, Vietnamese general and politician, 5th President of South Vietnam (d. 2001)\n*1926 – Roger Corman, American actor, director, producer, and screenwriter\n*  1926   – Süleyman Seba, Turkish footballer and colonel (d. 2014)\n*1928 – Fernand Dansereau, Canadian director, producer, and screenwriter\n*  1928   – Haldun Dormen, Turkish actor, director, and producer\n*  1928   – Tony Williams, American singer (d. 1992)\n*1929 – Hugo Claus, Belgian author, poet, and painter (d. 2008)\n*  1929   – Ivar Giaever, Norwegian-American physicist and academic, Nobel Prize laureate\n*  1929   – Nigel Hawthorne, English actor and producer (d. 2001)\n*  1929   – Joe Meek, English songwriter and producer (d. 1967)\n*1931 – Jack Clement, American singer-songwriter and producer (d. 2013)\n*1933 – Frank Gorshin, American actor (d. 2005)\n*  1933   – Barbara Holland, American author (d. 2010)\n*  1933   – K. Kailasapathy, Sri Lankan journalist and academic (d. 1982)\n*1934 – John Carey, English author and critic\n*  1934   – Roman Herzog, German lawyer and politician, 7th President of Germany (d. 2017)\n*  1934   – Moise Safra, Brazilian businessman and philanthropist, co-founded Banco Safra (d. 2014)\n*  1934   – Stanley Turrentine, American saxophonist and composer (d. 2000)\n*1935 – Peter Grant, English talent manager (d. 1995)\n*  1935   – Donald Lynden-Bell, English astrophysicist and astronomer\n*1936 – John Kelly, PIRA volunteer and Sinn Féin politician (d. 2007)\n*1937 – Joseph Lelyveld, American journalist and author\n*  1937   – Colin Powell, American general and politician, 65th United States Secretary of State\n*1938 – Colin Bland, Zimbabwean-South African cricketer\n*  1938   – Nancy Holt, American sculptor and painter (d. 2014) \n*1938 – Mal Colston, Australian educator and politician (d. 2003)\n*1938 – Natalya Kustinskaya, Soviet actress (d. 2012)\n*1939 – Crispian St. Peters, English singer-songwriter (d. 2010)\n*  1939   – Ronald White, American singer-songwriter (d. 1995)\n*1940 – Tommy Cash, American singer-songwriter and guitarist\n*  1940   – Gilles Proulx, Canadian journalist, historian, and radio host\n*1941 – Michael Moriarty, American-Canadian actor \n*  1941   – Dave Swarbrick, English singer-songwriter and fiddler (d. 2016)\n*1942 – Allan Clarke, English singer-songwriter \n*  1942   – Peter Greenaway, Welsh director and screenwriter\n*1943 – Max Gail, American actor and director\n*  1943   – Fighting Harada, Japanese boxer\n*  1943   – Jean-Louis Tauran, French cardinal\n*1944 – Peter T. King, American soldier, lawyer, and politician\n*  1944   – Pedro Rosselló, Puerto Rican physician and politician, 7th Governor of Puerto Rico\n*1946 – Jane Asher, English actress\n*  1946   – Russell Davies, Welsh journalist and radio host\n*  1946   – Takuro Yoshida, Japanese singer-songwriter\n*1947 – Gloria Macapagal-Arroyo, Filipino academic and politician, 14th President of the Philippines\n*  1947   – Virendra Sharma, Indian-English lawyer and politician\n*1948 – Les Binks, Irish drummer and songwriter \n*  1948   – Dave Holland, English drummer (d. 2018) \n*1949 – Judith Resnik, Ukrainian Jewish-American engineer and astronaut (d. 1986)\n*1950 – Agnetha Fältskog, Swedish singer-songwriter and producer\n*1951 – Yevgeniy Gavrilenko, Belarusian hurdler\n*  1951   – Dean Kamen, American inventor and businessman, founded Segway Inc.\n*  1951   – Dave McArtney, New Zealand singer-songwriter and guitarist (d. 2013)\n*1952 – John C. Dvorak, American author, editor and co-host of No Agenda podcast\n*  1952   – Mitch Pileggi, American actor\n*1953 – Frank Gaffney, American journalist and radio host\n*  1953   – Ian Swales, English accountant and politician\n*1954 – Guy Bertrand, Canadian linguist and radio host\n*  1954 – Peter Case, American singer-songwriter and guitarist\n*  1954   – Stan Ridgway, American singer-songwriter and guitarist \n*1955 – Charlotte de Turckheim, French actress, producer, and screenwriter\n*  1955   – Anthony Horowitz, English author and screenwriter\n*  1955   – Akira Toriyama, Japanese illustrator\n*1956 – Diamond Dallas Page, American wrestler and actor\n*1957 – Karin Roßley, German hurdler \n*1958 – Johan Kriek, South African-American tennis player\n*  1958   – Diana Nasution, Indonesian singer\n*  1958   – Lasantha Wickrematunge, Sri Lankan lawyer and journalist (d. 2009)\n*1959 – Julius Drake, English pianist and educator\n*1960 – Asteris Koutoulas, Romanian-German record producer, manager, and author\n*  1960   – Larry McCray, American singer-songwriter and guitarist\n*  1960   – Ian Redford, Scottish footballer and manager (d. 2014)\n*1961 – Jim LeRoy, American pilot (d. 2007)\n*1962 – Charlie Adam, Scottish footballer (d. 2012)\n*  1962   – Lana Clarkson, American actress and model (d. 2003)\n*  1962   – Gord Donnelly, Canadian ice hockey player and scout\n*  1962   – Kirsan Ilyumzhinov, Kalmyk businessman and politician, 1st President of Kalmykia\n*1964 – Princess Erika, French singer-songwriter \n*  1964   – Marius Lăcătuș, Romanian footballer and coach\n*  1964   – Christopher Reid, American rapper and actor \n*1965 – Cris Carpenter, American baseball player and educator\n*  1965   – Aykut Kocaman, Turkish footballer and manager\n*1966 – Mike McCready, American guitarist and songwriter \n*1967 – Gary Gait, Canadian lacrosse player and coach\n*  1967   – Anu Garg, Indian-American journalist and author\n*  1967   – Troy Gentry, American singer-songwriter and guitarist (d. 2017) \n*1968 – Paula Cole, American singer-songwriter and pianist\n*  1968   – Stewart Lee, British standup comedian and writer\n*1969 – Ryan Birch, English martial artist (d. 2013)\n*1970 – Soheil Ayari, French race car driver\n*  1970   – Krishnan Guru-Murthy, English journalist\n*  1970   – Miho Hatori, Japanese singer-songwriter \n*1971 – Dong Abay, Filipino singer-songwriter and guitarist \n*  1971   – Ayako Nishikawa, Japanese television personality, entertainer, comedian, and surgeon\n*1972 – Tim Coronel, Dutch race car driver\n*  1972   – Pat Green, American singer-songwriter and guitarist\n*  1972   – Paul Okon, Australian footballer and manager\n*  1972   – Waylon Payne, American singer-songwriter and actor\n*  1972   – Duncan Spencer, English cricketer\n*  1972   – Yasuhiro Takemoto, Japanese animator and director\n*1973 – Tony Banks, American football player and journalist\n*  1973   – Élodie Bouchez, French-American actress\n*  1973   – Brendan Cannon, Australian rugby player\n*  1973   – Cho Sung-min, South Korean baseball player (d. 2013)\n*  1973   – Pharrell Williams, American rapper, producer, and fashion designer \n*1974 – Sahaj, American singer-songwriter \n*  1974   – Marcus Jones, English lawyer and politician\n*  1974   – Vyacheslav Voronin, Russian high jumper\n*  1974   – Sheryl Cruz, Filipino actress and singer\n*1975 – Sarah Baldock, English organist and conductor\n*  1975   – John Hartson, Welsh footballer and coach\n*  1975   – Juicy J, American rapper and producer \n*  1975   – Caitlin Moran, English journalist, author, and critic\n*  1975   – Shammond Williams, American basketball player and coach\n*1976 – Ryan Drese, American baseball player\n*  1976   – Ross Gload, American baseball player\n*  1976   – Simone Inzaghi, Italian footballer\n*  1976   – Fernando Morientes, Spanish footballer and coach\n*  1976   – Indrek Tobreluts, Estonian biathlete\n*1977 – Stella Creasy, English psychologist and politician\n*1978 – Robert Glasper, African-American singer-songwriter, pianist, and producer\n*  1978   – Stephen Jackson, American basketball player\n*  1978   – Franziska van Almsick, German swimmer\n*1979 – Timo Hildebrand, German footballer\n*  1979   – Mitsuo Ogasawara, Japanese footballer\n*  1979   – Benji Radach, American mixed martial artist and trainer\n*  1979   – Dante Wesley, American football player\n*1980 – Matt Bonner, American basketball player\n*  1980   – David Chocarro, Argentinian baseball player and actor\n*  1980   – Mary Katharine Ham, American journalist and blogger\n*  1980   – Joris Mathijsen, Dutch footballer\n*1981 – Jorge de la Rosa, Mexican baseball player\n*  1981   – Michael A. Monsoor, American sailor, Medal of Honor recipient (d. 2006)\n*1982 – Hayley Atwell, English-American actress\n*  1982   – Thomas Hitzlsperger, German footballer\n*  1982   – Kelly Pavlik, American boxer\n*  1982   – Matt Pickens, American soccer player\n*  1982   – Alexandre Prémat, French race car driver\n*1983 – Jorge Andrés Martínez, Uruguayan footballer\n*1984 – David Dillehunt, American director, producer, and composer\n*  1984   – Kisho Yano, Japanese footballer\n*  1984   – Shin Min-a, South Korean actress\n*1984 – Saba Qamar, Pakistani actress-model\n*1985 – Daniel Congré, French footballer\n*  1985   – Lastings Milledge, American baseball player\n*1987 – Max Grün, German footballer\n*  1987   – Sergei Lepmets, Estonian footballer\n*1988 – Jon Kwang-ik, North Korean footballer\n*  1988   – Asumi Nakada, Japanese voice actress and model\n*  1988   – Christopher Papamichalopoulos, Cypriot skier\n*  1988   – Alex Valentini, Italian footballer\n*1989 – Lily James, English actress\n*1990 – Patrick Dangerfield, Australian rules footballer\n*1992 – Emmalyn Estrada, Canadian singer-songwriter and dancer\n*1993 – Benjamin Garcia, French rugby league player\n*  1993   – Maya DiRado, American swimmer\n*1995 – Viliame Kikau, Fijian rugby league player\n*1996 – Nicolas Beer, Danish racing driver\n*1998 – Kaito Nakamura, Japanese actor and model\n*1999 – Sharlene San Pedro, Filipino actress, singer, and dancer\n\nDeaths\n\n* 517 – Timothy I of Constantinople\n* 582 – Eutychius of Constantinople (b. 512)\n* 584 – Ruadán of Lorrha, Irish abbot\n* 902 – Al-Mu'tadid, Iraqi caliph (b. 960)\n*1168 – Robert de Beaumont, 2nd Earl of Leicester, English politician (b. 1104)\n*1205 – Queen Isabella I of Jerusalem (b. 1172)\n*1258 – Saint Juliana of Liège\n*1340 – William Melton, English archbishop \n*1419 – Vincent Ferrer, Spanish missionary and saint (b. 1350)\n*1431 – Bernard I, Margrave of Baden-Baden (b. 1364)\n*1534 – Jan Matthys, Anabaptist reformer\n*1605 – Adam Loftus, English-Irish archbishop and politician, Lord Chancellor of Ireland (b. 1513)\n*1617 – Alonso Lobo, Spanish composer (b. 1555)\n*1673 – François Caron, Belgian-French explorer and politician, 8th Governor of Formosa (b. 1600)\n*1693 – Anne Marie Louise d'Orléans, Duchess of Montpensier (b. 1627)\n*1695 – George Savile, 1st Marquess of Halifax, English politician, Lord President of the Council (b. 1633)\n*1697 – Charles XI of Sweden (b. 1655)\n*1717 – Jean Jouvenet, French painter (b. 1647)\n*1735 – William Derham, English minister and philosopher (b. 1657)\n*  1735   – Samuel Wesley, English clergyman and poet (b. 1662)\n*1765 – Edward Young, English poet and author (b. 1683)\n*1794 – Georges Danton, French lawyer and politician, French Minister of Justice (b. 1759)\n*  1794   – Camille Desmoulins, French journalist, lawyer, and politician (b. 1760)\n*1804 – Jean-Charles Pichegru, French general (b. 1761)\n*1834 – Richard Goodwin Keats, English admiral and politician, 40th Commodore Governor of Newfoundland (b. 1757)\n*1864 – Alaric Alexander Watts, English poet and journalist (b. 1797)\n*1900 – Joseph Louis François Bertrand, French mathematician, economist, and academic (b. 1822)\n*  1900   – Osman Nuri Pasha, Ottoman field marshal and the hero of the Siege of Plevna in 1877 (b. 1832)\n*1923 – George Herbert, 5th Earl of Carnarvon, English archaeologist and businessman (b. 1866)\n*1928 – Roy Kilner, English cricketer and soldier (b. 1890)\n*1936 – Chandler Egan, American golfer and architect (b. 1884)\n*1940 – Charles Freer Andrews, English-Indian priest, missionary, and educator (b. 1871)\n*1941 – Nigel Gresley, Scottish-English engineer (b. 1876)\n*1943 – Aleš Hrdlička, Czech-American anthropologist and scholar (b. 1869)\n*1945 – Karl-Otto Koch, German SS officer (b. 1897)\n*1946 – Vincent Youmans, American composer and producer (b. 1898)\n*1952 – Charles Collett, English engineer (b. 1871)\n*1964 – Douglas MacArthur, American general (b. 1880)\n*1966 – John Henry Starling, Australian public servant (b. 1883)\n*1967 – Mischa Elman, Ukrainian-American violinist (b. 1891)\n*  1967   – Hermann Joseph Muller, American geneticist and academic, Nobel Prize laureate (b. 1890)\n*1969 – Ain-Ervin Mere, Estonian SS officer (b. 1903)\n*  1969   – Shelby Storck, American journalist, actor, director, and producer (b. 1917)\n*1970 – Alfred Sturtevant, American geneticist and academic (b. 1891)\n*1972 – Brian Donlevy, American actor and producer (b. 1901)\n*  1972   – Isabel Jewell, American actress and singer (b. 1907)\n*  1972   – Robert Speck, Canadian politician, 1st Mayor of Mississauga (b. 1915)\n*1973 – John Coleman, Australian footballer and coach (b. 1928)\n*1974 – A. Y. Jackson, Canadian painter (b. 1882)\n*1975 – Chiang Kai-shek, Chinese general and politician, 1st President of the Republic of China (b. 1887)\n*1976 – Howard Hughes, American pilot, engineer, and director (b. 1905)\n*  1976   – Wilder Penfield, American-Canadian surgeon and academic (b. 1891)\n*1979 – Eugène Gabritschevsky, Russian biologist and painter (b. 1893)\n*1981 – Bob Hite, American singer-songwriter (b. 1945)\n*1982 – Abe Fortas, American lawyer and jurist (b. 1910)\n*1983 – Danny Rapp, American singer-songwriter (b. 1941)\n*1984 – Nikolai Matvejev, Estonian cyclist (b. 1923)\n*1987 – Jan Lindblad, Swedish journalist and photographer (b. 1932)\n*1989 – María Cristina Gómez, Salvadoran educator and activist (b. 1938)\n*1991 – Sonny Carter, American soccer player, physician, and astronaut (b. 1947)\n*  1991   – John Tower, American soldier, academic, and politician (b. 1925)\n*1992 – Sam Walton, American businessman, founded Walmart and Sam's Club (b. 1918)\n*1993 – Divya Bharti, Indian actress (b. 1974)\n*1994 – Kurt Cobain, American singer-songwriter and guitarist (b. 1967)\n*  1994   – Roy Smeck, American country musician (b. 1900)\n*1995 – Françoise Loranger, Canadian playwright and producer (b. 1913)\n*1996 – Larry LaPrise, American songwriter (b. 1913)\n*1997 – Allen Ginsberg, American poet (b. 1926)\n*1998 – Cozy Powell, English drummer (b. 1947)\n*1999 – Paul David, Canadian cardiologist and politician (b. 1919)\n*2000 – Lee Petty, American race car driver (b. 1914)\n*2001 – Brother Theodore, German-American comedian, actor, and screenwriter (b. 1906)\n*2001 – Malcolm Shepherd, 2nd Baron Shepherd (b. 1918)\n*2002 – Layne Staley, American singer-songwriter (b. 1967)\n*2004 – Sławomir Rawicz, Polish lieutenant (b. 1915)\n*  2004   – Heiner Zieschang, German mathematician and academic (b. 1936)\n*2005 – Saul Bellow, Canadian-American novelist, essayist and short story writer, Nobel Prize laureate (b. 1915)\n*  2005   – Dale Messick, American author and illustrator (b. 1906)\n*  2005   – John Sichel, French-English director, producer, and screenwriter (b. 1937)\n*  2005   – Neil Welliver, American painter (b. 1929)\n*2006 – Allan Kaprow, American painter and educator (b. 1927)\n*  2006   – Gene Pitney, American singer-songwriter (b. 1941)\n*2007 – Maria Gripe, Swedish journalist and author (b. 1923)\n*  2007   – Leela Majumdar, Indian author and academic (b. 1908)\n*  2007   – Mark St. John, American guitarist (b. 1956)\n*  2007   – Darryl Stingley, American football player and scout (b. 1951)\n*  2007   – Poornachandra Tejaswi, Indian ornithologist, author, and photographer (b. 1938)\n*2008 – Charlton Heston, American actor, director, and political activist (b. 1923)\n*2009 – Constantine Papadakis, Greek-American businessman and academic (b. 1946)\n*2012 – Joe Avezzano, American football player and coach (b. 1943)\n*  2012   – Jim Herr, American businessman, founded Herr's Snacks (b. 1924)\n*  2012   – Jim Marshall, English businessman, founded Marshall Amplification (b. 1923)\n*  2012   – Gil Noble, American journalist and producer (b. 1932)\n*  2012   – Peter Tapsell, New Zealand surgeon and politician, 30th New Zealand Minister of Defence (b. 1930)\n*  2012   – Bingu wa Mutharika, Malawian economist and politician, 3rd President of Malawi (b. 1934)\n*  2012   – Nakatindi Wina, Zambian Princess and politician\n*2013 – Regina Bianchi, Italian actress (b. 1921)\n*  2013   – Amnon Dankner, Israeli journalist and author (b. 1946)\n*  2013   – Piero de Palma, Italian tenor and actor (b. 1924)\n*  2013   – Dave Hunt, American radio host and author (b. 1926)\n*  2013   – Mohammad Ishaq Khan, Indian historian and academic (b. 1946)\n*  2013   – David Kuo, American journalist and author (b. 1968)\n*  2013   – Nikolaos Pappas, Greek admiral and politician, Greek Minister for Mercantile Marine (b. 1930)\n*2014 – Alan Davie, Scottish saxophonist and painter (b. 1920)\n*  2014   – Peter Matthiessen, American novelist, short story writer, editor, co-founded The Paris Review (b. 1927)\n*  2014   – John Pinette, American comedian (b. 1964)\n*  2014   – Gordon Smith, Scottish footballer (b. 1954)\n*  2014   – José Wilker, Brazilian actor, director, and producer (b. 1947)\n*2015 – Fredric Brandt, American dermatologist and author (b. 1949)\n*  2015   – Juan Carlos Cáceres, Argentinian singer and pianist (b. 1936)\n*  2015   – Richard Dysart, American actor (b. 1929)\n*  2015   – Steve Rickard, New Zealand-Australian wrestler, trainer, and promoter (b. 1929)\n*  2015   – Julie Wilson, American actress and singer (b. 1924)\n*2016 – Koço Kasapoğlu, Turkish footballer (b. 1936)\n\nHolidays and observances\n\n*Christian feast day:\n**Albert of Montecorvino\n**Blessed Mariano de la Mata\n**Derfel Gadarn\n**Æthelburh of Kent\n**Gerald of Sauve-Majeure\n**Juliana of Liège\n**Maria Crescentia Höss\n**Pandita Mary Ramabai (Episcopal Church (USA)) \n**Ruadhán of Lorrha\n**Vincent Ferrer\n**April 5 (Eastern Orthodox liturgics)\n*Cold Food Festival, held on April 4 if it is a leap year (China); and its related observances:\n*Earliest day on which Sham el-Nessim can fall, while May 9 is the latest; celebrated on Monday after the Orthodox Easter (Egypt)\n*Children's Day (Palestinian territories)\n*Sikmogil (South Korea). April 5. http://en.wikipedia.org/?curid=2194."
  }
}
