{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9532",
  "eid" : "efd394f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778482111,
  "textBody" : "Electromagnetism is a branch of physics involving the study of the electromagnetic force, a type of physical interaction that occurs between electrically charged particles. The electromagnetic force usually exhibits electromagnetic fields such as electric fields, magnetic fields and light, and is one of the four fundamental interactions (commonly called forces) in nature. The other three fundamental interactions are the strong interaction, the weak interaction and gravitation.\n\nThe word electromagnetism is a compound form of two Greek terms, ἤλεκτρον ēlektron, \"amber\", and μαγνῆτις λίθος magnētis lithos,[https://books.google.com/books?idBkS2KW7u76MC&dq\n Platonis Opera], Meyer and Zeller, 1839, p. 989. which means \"Μagnesian stone\",The location of Magnesia is debated; it could be the region in mainland Greece or Magnesia ad Sipylum. See, for example,  a type of iron ore.  Electromagnetic phenomena are defined in terms of the electromagnetic force, sometimes called the Lorentz force, which includes both electricity and magnetism as different manifestations of the same phenomenon.\n\nThe electromagnetic force plays a major role in determining the internal properties of most objects encountered in daily life.  Ordinary matter takes its form as a result of intermolecular forces between individual atoms and molecules in matter, and is a manifestation of the electromagnetic force. Electrons are bound by the electromagnetic force to atomic nuclei, and their orbital shapes and their influence on nearby atoms with their electrons is described by quantum mechanics. The electromagnetic force governs the processes involved in chemistry, which arise from interactions between the electrons of neighboring atoms.\n\nThere are numerous mathematical descriptions of the electromagnetic field.  In classical electrodynamics, electric fields are described as electric potential and electric current. In Faraday's law, magnetic fields are associated with electromagnetic induction and magnetism, and Maxwell's equations describe how electric and magnetic fields are generated and altered by each other and by charges and currents.\n\nThe theoretical implications of electromagnetism, particularly the establishment of the speed of light based on properties of the \"medium\" of propagation (permeability and permittivity), led to the development of special relativity by Albert Einstein in 1905.\n\nAlthough electromagnetism is considered one of the four fundamental forces, at high energy the weak force and electromagnetic force are unified as a single electroweak force. In the history of the universe, during the quark epoch the unified force broke into the two separate forces as the universe cooled.\n\nHistory of the theory\n\nOriginally, electricity and magnetism were considered to be two separate forces. This view changed, however, with the publication of James Clerk Maxwell's 1873 A Treatise on Electricity and Magnetism in which the interactions of positive and negative charges were shown to be mediated by one force. There are four main effects resulting from these interactions, all of which have been clearly demonstrated by experiments:\n# Electric charges ' or ' one another with a force inversely proportional to the square of the distance between them: unlike charges attract, like ones repel.\n# Magnetic poles (or states of polarization at individual points) attract or repel one another in a manner similar to positive and negative charges and always exist as pairs: every north pole is yoked to a south pole.\n# An electric current inside a wire creates a corresponding circumferential magnetic field outside the wire.  Its direction (clockwise or counter-clockwise) depends on the direction of the current in the wire.\n# A current is induced in a loop of wire when it is moved toward or away from a magnetic field, or a magnet is moved towards or away from it; the direction of current depends on that of the movement.\n\nWhile preparing for an evening lecture on 21 April 1820, Hans Christian Ørsted made a surprising observation. As he was setting up his materials, he noticed a compass needle deflected away from magnetic north when the electric current from the battery he was using was switched on and off. This deflection convinced him that magnetic fields radiate from all sides of a wire carrying an electric current, just as light and heat do, and that it confirmed a direct relationship between electricity and magnetism.\n\nAt the time of discovery, Ørsted did not suggest any satisfactory explanation of the phenomenon, nor did he try to represent the phenomenon in a mathematical framework. However, three months later he began more intensive investigations. Soon thereafter he published his findings, proving that an electric current produces a magnetic field as it flows through a wire. The CGS unit of magnetic induction (oersted) is named in honor of his contributions to the field of electromagnetism.\n\nHis findings resulted in intensive research throughout the scientific community in electrodynamics. They influenced French physicist André-Marie Ampère's developments of a single mathematical form to represent the magnetic forces between current-carrying conductors. Ørsted's discovery also represented a major step toward a unified concept of energy.\n\nThis unification, which was observed by Michael Faraday, extended by James Clerk Maxwell, and partially reformulated by Oliver Heaviside and Heinrich Hertz, is one of the key accomplishments of 19th century mathematical physics. It has had far-reaching consequences, one of which was the understanding of the nature of light. Unlike what was proposed by electromagnetic theory of that time, light and other electromagnetic waves are at present seen as taking the form of quantized, self-propagating oscillatory electromagnetic field disturbances called photons. Different frequencies of oscillation give rise to the different forms of electromagnetic radiation, from radio waves at the lowest frequencies, to visible light at intermediate frequencies, to gamma rays at the highest frequencies.\n\nØrsted was not the only person to examine the relationship between electricity and magnetism. In 1802, Gian Domenico Romagnosi, an Italian legal scholar, deflected a magnetic needle using a Voltaic pile. The factual setup of the experiment is not completely clear, so if current flew across the needle or not. An account of the discovery was published in 1802 in an Italian newspaper, but it was largely overlooked by the contemporary scientific community, because Romagnosi seemingly did not belong to this community.\n\nFundamental forces \n\nThe electromagnetic force is one of the four known fundamental forces. The other fundamental forces are:\n* the weak nuclear force, which binds to all known particles in the Standard Model, and causes certain forms of radioactive decay. (In particle physics though, the electroweak interaction is the unified description of two of the four known fundamental interactions of nature: electromagnetism and the weak interaction);\n* the strong nuclear force, which binds quarks to form nucleons, and binds nucleons to form nuclei\n* the gravitational force.\nAll other forces (e.g., friction, contact forces) are derived from these four fundamental forces (including momentum which is carried by the movement of particles).Browne, \"Physics for Engineering and Science,\" p 160: \"Gravity is one of the fundamental forces of nature. The other forces such as friction, tension, and the normal force are derived from the electric force, another of the fundamental forces. Gravity is a rather weak force... The electric force between two protons is much stronger than the gravitational force between them.\"\n\nThe electromagnetic force is responsible for practically all phenomena one encounters in daily life above the nuclear scale, with the exception of gravity. Roughly speaking, all the forces involved in interactions between atoms can be explained by the electromagnetic force acting between the electrically charged atomic nuclei and electrons of the atoms. Electromagnetic forces also explain how these particles carry momentum by their movement. This includes the forces we experience in \"pushing\" or \"pulling\" ordinary material objects, which result from the intermolecular forces that act between the individual molecules in our bodies and those in the objects. The electromagnetic force is also involved in all forms of chemical phenomena.\n\nA necessary part of understanding the intra-atomic and intermolecular forces is the effective force generated by the momentum of the electrons' movement, such that as electrons move between interacting atoms they carry momentum with them. As a collection of electrons becomes more confined, their minimum momentum necessarily increases due to the Pauli exclusion principle. The behaviour of matter at the molecular scale including its density is determined by the balance between the electromagnetic force and the force generated by the exchange of momentum carried by the electrons themselves.Purcell, \"Electricity and Magnetism, 3rd Edition,\" p 546: Ch 11 Section 6, \"Electron Spin and Magnetic Moment.\"\n\nClassical electrodynamics\n\nIn 1600, William Gilbert proposed, in his De Magnete, that electricity and magnetism, while both capable of causing attraction and repulsion of objects, were distinct effects. Mariners had noticed that lightning strikes had the ability to disturb a compass needle. The link between lightning and electricity was not confirmed until Benjamin Franklin's proposed experiments in 1752.  One of the first to discover and publish a link between man-made electric current and magnetism was Romagnosi, who in 1802 noticed that connecting a wire across a voltaic pile deflected a nearby compass needle. However, the effect did not become widely known until 1820, when Ørsted performed a similar experiment. Ørsted's work influenced Ampère to produce a theory of electromagnetism that set the subject on a mathematical foundation.\n\nA theory of electromagnetism, known as classical electromagnetism, was developed by various physicists during the period between 1820 and 1873 when it culminated in the publication of a treatise by James Clerk Maxwell, which unified the preceding developments into a single theory and discovered the electromagnetic nature of light.Purcell, p 436. Chapter 9.3, \"Maxwell's description of the electromagnetic field was essentially complete.\" In classical electromagnetism, the behavior of the electromagnetic field is described by a set of equations known as Maxwell's equations, and the electromagnetic force is given by the Lorentz force law.Purcell: p 278: Chapter 6.1, \"Definition of the Magnetic Field.\" Lorentz force and force equation.\n\nOne of the peculiarities of classical electromagnetism is that it is difficult to reconcile with classical mechanics, but it is compatible with special relativity. According to Maxwell's equations, the speed of light in a vacuum is a universal constant that is dependent only on the electrical permittivity and magnetic permeability of free space. This violates Galilean invariance, a long-standing cornerstone of classical mechanics. One way to reconcile the two theories (electromagnetism and classical mechanics) is to assume the existence of a luminiferous aether through which the light propagates. However, subsequent experimental efforts failed to detect the presence of the aether. After important contributions of Hendrik Lorentz and Henri Poincaré, in 1905, Albert Einstein solved the problem with the introduction of special relativity, which replaced classical kinematics with a new theory of kinematics compatible with classical electromagnetism. (For more information, see History of special relativity.)\n\nIn addition, relativity theory implies that in moving frames of reference a magnetic field transforms to a field with a nonzero electric component and conversely, a moving electric field transforms to a nonzero magnetic component, thus firmly showing that the phenomena are two sides of the same coin. Hence the term \"electromagnetism\". (For more information, see Classical electromagnetism and special relativity and Covariant formulation of classical electromagnetism.\n\nChaotic and emergent phenomena\n\nThe mathematical models used in classical electromagnetism, quantum electrodynamics (QED) and the standard model all view the electromagnetic force as a linear set of equations. In these theories electromagnetism is a U(1) gauge theory, whose topological properties do not allow any complex nonlinear interaction of a field with and on itself. For example, in the QED vacuum the field fluctuates randomly as a consequence of the uncertainty principle but these fluctuations cancel each other out with no overall observable effect. However, there are many observed nonlinear physical electromagnetic phenomena such as Aharonov–Bohm (AB)\n\n and Altshuler–Aronov– Spivak (AAS) effects, Berry, Aharonov– Anandan, Pancharatnam and Chiao–Wu phase rotation effects, Josephson effect,\n\n Quantum Hall effect,\n the de Haas–van Alphen effect, the Sagnac effect and many other physically observable phenomena which would indicate that the electromagnetic potential field has real physical meaning rather than being a mathematical artifact and therefore an all encompassing theory would not confine electromagnetism as a local force as is currently done, but as a SU(2) gauge theory or higher geometry. Higher symmetries allow for nonlinear, aperiodic behaviour which manifest as a variety of complex non-equilibrium phenomena that do not arise in the linearised U(1) theory, such as multiple stable states, symmetry breaking, chaos and emergence.  In higher symmetry groups, the electromagnetic field is not a calm, randomly fluctuating, passive substance, but can at times be viewed as a turbulent virtual plasma that can have complex vortices, entangled states and a rich nonlinear structure.\n\nWhat are called Maxwell's equation's today are in fact a simplified version of the original equations reformulated by Heaviside, FitzGerald, Lodge and Hertz. The original equations used Hamilton's more expressive quaternion notation, a kind of Clifford algebra, which fully subsumes the standard Maxwell vectorial equations largely used today. In the late 1880s there was a debate over the relative merits of vector analysis and quaternions. According to Heaviside the electromagnetic potential field was purely metaphysical, an arbitrary mathematical fiction, that needed to be \"murdered\".  It was concluded that there was no need for the greater physical insights provided by the quaternions if the theory was purely local in nature. Local vector analysis has become the dominant way of using Maxwell's equations ever since. However, this strictly vectorial approach has led to a restrictive topological understanding in some areas of electromagnetism, for example, a full understanding of the energy transfer dynamics in Tesla's oscillator-shuttle-circuit can be achieved only in quaternionic algebra or higher SU(2) symmetries.   It has often been argued that quaternions are not compatible with special relativity, but multiple papers have shown ways of incorporating relativity\n\nA good example of nonlinear electromagnetics is in high energy dense plasmas, where vortical phenomena occur which seemingly violate the second law of thermodynamics by increasing the energy gradient within the electromagnetic field and violate Maxwell's laws by creating ion currents which capture and concentrate their own and surrounding magnetic fields. In particular Lorentz force law, which elaborates Maxwell's equations is violated by these force free vortices. These apparent violations are due to the fact that the traditional conservation laws in classical and quantum electrodynamics (QED) only display linear U(1) symmetry (in particular, by the extended Noether theorem, conservation laws such as the laws of thermodynamics need not always apply to dissipative systems, which are expressed in gauges of higher symmetry). The second law of thermodynamics states that in a closed linear system entropy flow can be only be positive (or exactly zero at the end of a cycle). However, negative entropy (i.e. increased order, structure or self-organisation) can spontaneously appear in an open nonlinear thermodynamic system that is far from equilibrium, so long as this emergent order accelerates the overall flow of entropy in the total system.\n\nGiven the complex and adaptive behaviour that arises from nonlinear systems considerable attention in recent years has gone into studying a new class of phase transitions which occur at absolute zero temperature. These are quantum phase transitions which are driven by electromagnetic field fluctuations as a consequence of zero-point energy A good example of a spontaneous phase transition that are attributed to zero-point fluctuations can be found in superconductors. Superconductivity is one of the best known empirically quantified macroscopic electromagnetic phenomena whose basis is recognised to be quantum mechanical in origin. The behaviour of the electric and magnetic fields under superconductivity is governed by the London equations. However, it has been questioned in a series of journal articles whether the quantum mechanically canonised London equations can be given a purely classical derivation. Bostick for instance, has claimed to show that the London equations do indeed have a classical origin that applies to superconductors and to some collisionless plasmas as well. In particular it has been asserted that the Beltrami vortices in the plasma focus display the same paired flux-tube morphology as Type II superconductors. Others have also pointed out this connection, Fröhlich has shown that the hydrodynamic equations of compressible fluids, together with the London equations, lead to a macroscopic parameter (\\mu = electric charge density / mass density), without involving either quantum phase factors or Planck's constant. In essence, it has been asserted that Beltrami plasma vortex structures are able to at least simulate the morphology of Type I and Type II superconductors. This occurs because the \"organised\" dissipative energy of the vortex configuration comprising the ions and electrons far exceeds the \"disorganised\" dissipative random thermal energy. The transition from disorganised fluctuations to organised helical structures is a phase transition involving a change in the condensate's energy  (i.e. the ground state or zero-point energy) but without any associated rise in temperature. This is an example of zero-point energy having multiple stable states (see Quantum phase transition, Quantum critical point, Topological degeneracy, Topological order) and where the overall system structure is independent of a reductionist or deterministic view, that \"classical\" macroscopic order can also causally affect quantum phenomena.\n\nQuantities and units\n\nElectromagnetic units are part of a system of electrical units based primarily upon the magnetic properties of electric currents, the fundamental SI unit being the ampere. The units are:\n\n*ampere (electric current)\n*coulomb (electric charge)\n*farad (capacitance)\n*henry (inductance)\n*ohm (resistance)\n*siemens (conductance)\n*tesla (magnetic flux density)\n*volt (electric potential)\n*watt (power)\n*weber (magnetic flux)\n\nIn the electromagnetic cgs system, electric current is a fundamental quantity defined via Ampère's law and takes the permeability as a dimensionless quantity (relative permeability) whose value in a vacuum is unity. As a consequence, the square of the speed of light appears explicitly in some of the equations interrelating quantities in this system.\n\nFormulas for physical laws of electromagnetism (such as Maxwell's equations) need to be adjusted depending on what system of units one uses. This is because there is no one-to-one correspondence between electromagnetic units in SI and those in CGS, as is the case for mechanical units. Furthermore, within CGS, there are several plausible choices of electromagnetic units, leading to different unit \"sub-systems\", including Gaussian, \"ESU\", \"EMU\", and Heaviside–Lorentz. Among these choices, Gaussian units are the most common today, and in fact the phrase \"CGS units\" is often used to refer specifically to CGS-Gaussian units.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Electromagnetism" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9532" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Electromagnetism is a branch of physics involving the study of the electromagnetic force, a type of physical interaction that occurs between electrically charged particles. The electromagnetic force usually exhibits electromagnetic fields such as electric fields, magnetic fields and light, and is one of the four fundamental interactions (commonly called forces) in nature. The other three fundamental interactions are the strong interaction, the weak interaction and gravitation.\n\nThe word electromagnetism is a compound form of two Greek terms, ἤλεκτρον ēlektron, \"amber\", and μαγνῆτις λίθος magnētis lithos,[https://books.google.com/books?idBkS2KW7u76MC&dq\n Platonis Opera], Meyer and Zeller, 1839, p. 989. which means \"Μagnesian stone\",The location of Magnesia is debated; it could be the region in mainland Greece or Magnesia ad Sipylum. See, for example,  a type of iron ore.  Electromagnetic phenomena are defined in terms of the electromagnetic force, sometimes called the Lorentz force, which includes both electricity and magnetism as different manifestations of the same phenomenon.\n\nThe electromagnetic force plays a major role in determining the internal properties of most objects encountered in daily life.  Ordinary matter takes its form as a result of intermolecular forces between individual atoms and molecules in matter, and is a manifestation of the electromagnetic force. Electrons are bound by the electromagnetic force to atomic nuclei, and their orbital shapes and their influence on nearby atoms with their electrons is described by quantum mechanics. The electromagnetic force governs the processes involved in chemistry, which arise from interactions between the electrons of neighboring atoms.\n\nThere are numerous mathematical descriptions of the electromagnetic field.  In classical electrodynamics, electric fields are described as electric potential and electric current. In Faraday's law, magnetic fields are associated with electromagnetic induction and magnetism, and Maxwell's equations describe how electric and magnetic fields are generated and altered by each other and by charges and currents.\n\nThe theoretical implications of electromagnetism, particularly the establishment of the speed of light based on properties of the \"medium\" of propagation (permeability and permittivity), led to the development of special relativity by Albert Einstein in 1905.\n\nAlthough electromagnetism is considered one of the four fundamental forces, at high energy the weak force and electromagnetic force are unified as a single electroweak force. In the history of the universe, during the quark epoch the unified force broke into the two separate forces as the universe cooled.\n\nHistory of the theory\n\nOriginally, electricity and magnetism were considered to be two separate forces. This view changed, however, with the publication of James Clerk Maxwell's 1873 A Treatise on Electricity and Magnetism in which the interactions of positive and negative charges were shown to be mediated by one force. There are four main effects resulting from these interactions, all of which have been clearly demonstrated by experiments:\n# Electric charges ' or ' one another with a force inversely proportional to the square of the distance between them: unlike charges attract, like ones repel.\n# Magnetic poles (or states of polarization at individual points) attract or repel one another in a manner similar to positive and negative charges and always exist as pairs: every north pole is yoked to a south pole.\n# An electric current inside a wire creates a corresponding circumferential magnetic field outside the wire.  Its direction (clockwise or counter-clockwise) depends on the direction of the current in the wire.\n# A current is induced in a loop of wire when it is moved toward or away from a magnetic field, or a magnet is moved towards or away from it; the direction of current depends on that of the movement.\n\nWhile preparing for an evening lecture on 21 April 1820, Hans Christian Ørsted made a surprising observation. As he was setting up his materials, he noticed a compass needle deflected away from magnetic north when the electric current from the battery he was using was switched on and off. This deflection convinced him that magnetic fields radiate from all sides of a wire carrying an electric current, just as light and heat do, and that it confirmed a direct relationship between electricity and magnetism.\n\nAt the time of discovery, Ørsted did not suggest any satisfactory explanation of the phenomenon, nor did he try to represent the phenomenon in a mathematical framework. However, three months later he began more intensive investigations. Soon thereafter he published his findings, proving that an electric current produces a magnetic field as it flows through a wire. The CGS unit of magnetic induction (oersted) is named in honor of his contributions to the field of electromagnetism.\n\nHis findings resulted in intensive research throughout the scientific community in electrodynamics. They influenced French physicist André-Marie Ampère's developments of a single mathematical form to represent the magnetic forces between current-carrying conductors. Ørsted's discovery also represented a major step toward a unified concept of energy.\n\nThis unification, which was observed by Michael Faraday, extended by James Clerk Maxwell, and partially reformulated by Oliver Heaviside and Heinrich Hertz, is one of the key accomplishments of 19th century mathematical physics. It has had far-reaching consequences, one of which was the understanding of the nature of light. Unlike what was proposed by electromagnetic theory of that time, light and other electromagnetic waves are at present seen as taking the form of quantized, self-propagating oscillatory electromagnetic field disturbances called photons. Different frequencies of oscillation give rise to the different forms of electromagnetic radiation, from radio waves at the lowest frequencies, to visible light at intermediate frequencies, to gamma rays at the highest frequencies.\n\nØrsted was not the only person to examine the relationship between electricity and magnetism. In 1802, Gian Domenico Romagnosi, an Italian legal scholar, deflected a magnetic needle using a Voltaic pile. The factual setup of the experiment is not completely clear, so if current flew across the needle or not. An account of the discovery was published in 1802 in an Italian newspaper, but it was largely overlooked by the contemporary scientific community, because Romagnosi seemingly did not belong to this community.\n\nFundamental forces \n\nThe electromagnetic force is one of the four known fundamental forces. The other fundamental forces are:\n* the weak nuclear force, which binds to all known particles in the Standard Model, and causes certain forms of radioactive decay. (In particle physics though, the electroweak interaction is the unified description of two of the four known fundamental interactions of nature: electromagnetism and the weak interaction);\n* the strong nuclear force, which binds quarks to form nucleons, and binds nucleons to form nuclei\n* the gravitational force.\nAll other forces (e.g., friction, contact forces) are derived from these four fundamental forces (including momentum which is carried by the movement of particles).Browne, \"Physics for Engineering and Science,\" p 160: \"Gravity is one of the fundamental forces of nature. The other forces such as friction, tension, and the normal force are derived from the electric force, another of the fundamental forces. Gravity is a rather weak force... The electric force between two protons is much stronger than the gravitational force between them.\"\n\nThe electromagnetic force is responsible for practically all phenomena one encounters in daily life above the nuclear scale, with the exception of gravity. Roughly speaking, all the forces involved in interactions between atoms can be explained by the electromagnetic force acting between the electrically charged atomic nuclei and electrons of the atoms. Electromagnetic forces also explain how these particles carry momentum by their movement. This includes the forces we experience in \"pushing\" or \"pulling\" ordinary material objects, which result from the intermolecular forces that act between the individual molecules in our bodies and those in the objects. The electromagnetic force is also involved in all forms of chemical phenomena.\n\nA necessary part of understanding the intra-atomic and intermolecular forces is the effective force generated by the momentum of the electrons' movement, such that as electrons move between interacting atoms they carry momentum with them. As a collection of electrons becomes more confined, their minimum momentum necessarily increases due to the Pauli exclusion principle. The behaviour of matter at the molecular scale including its density is determined by the balance between the electromagnetic force and the force generated by the exchange of momentum carried by the electrons themselves.Purcell, \"Electricity and Magnetism, 3rd Edition,\" p 546: Ch 11 Section 6, \"Electron Spin and Magnetic Moment.\"\n\nClassical electrodynamics\n\nIn 1600, William Gilbert proposed, in his De Magnete, that electricity and magnetism, while both capable of causing attraction and repulsion of objects, were distinct effects. Mariners had noticed that lightning strikes had the ability to disturb a compass needle. The link between lightning and electricity was not confirmed until Benjamin Franklin's proposed experiments in 1752.  One of the first to discover and publish a link between man-made electric current and magnetism was Romagnosi, who in 1802 noticed that connecting a wire across a voltaic pile deflected a nearby compass needle. However, the effect did not become widely known until 1820, when Ørsted performed a similar experiment. Ørsted's work influenced Ampère to produce a theory of electromagnetism that set the subject on a mathematical foundation.\n\nA theory of electromagnetism, known as classical electromagnetism, was developed by various physicists during the period between 1820 and 1873 when it culminated in the publication of a treatise by James Clerk Maxwell, which unified the preceding developments into a single theory and discovered the electromagnetic nature of light.Purcell, p 436. Chapter 9.3, \"Maxwell's description of the electromagnetic field was essentially complete.\" In classical electromagnetism, the behavior of the electromagnetic field is described by a set of equations known as Maxwell's equations, and the electromagnetic force is given by the Lorentz force law.Purcell: p 278: Chapter 6.1, \"Definition of the Magnetic Field.\" Lorentz force and force equation.\n\nOne of the peculiarities of classical electromagnetism is that it is difficult to reconcile with classical mechanics, but it is compatible with special relativity. According to Maxwell's equations, the speed of light in a vacuum is a universal constant that is dependent only on the electrical permittivity and magnetic permeability of free space. This violates Galilean invariance, a long-standing cornerstone of classical mechanics. One way to reconcile the two theories (electromagnetism and classical mechanics) is to assume the existence of a luminiferous aether through which the light propagates. However, subsequent experimental efforts failed to detect the presence of the aether. After important contributions of Hendrik Lorentz and Henri Poincaré, in 1905, Albert Einstein solved the problem with the introduction of special relativity, which replaced classical kinematics with a new theory of kinematics compatible with classical electromagnetism. (For more information, see History of special relativity.)\n\nIn addition, relativity theory implies that in moving frames of reference a magnetic field transforms to a field with a nonzero electric component and conversely, a moving electric field transforms to a nonzero magnetic component, thus firmly showing that the phenomena are two sides of the same coin. Hence the term \"electromagnetism\". (For more information, see Classical electromagnetism and special relativity and Covariant formulation of classical electromagnetism.\n\nChaotic and emergent phenomena\n\nThe mathematical models used in classical electromagnetism, quantum electrodynamics (QED) and the standard model all view the electromagnetic force as a linear set of equations. In these theories electromagnetism is a U(1) gauge theory, whose topological properties do not allow any complex nonlinear interaction of a field with and on itself. For example, in the QED vacuum the field fluctuates randomly as a consequence of the uncertainty principle but these fluctuations cancel each other out with no overall observable effect. However, there are many observed nonlinear physical electromagnetic phenomena such as Aharonov–Bohm (AB)\n\n and Altshuler–Aronov– Spivak (AAS) effects, Berry, Aharonov– Anandan, Pancharatnam and Chiao–Wu phase rotation effects, Josephson effect,\n\n Quantum Hall effect,\n the de Haas–van Alphen effect, the Sagnac effect and many other physically observable phenomena which would indicate that the electromagnetic potential field has real physical meaning rather than being a mathematical artifact and therefore an all encompassing theory would not confine electromagnetism as a local force as is currently done, but as a SU(2) gauge theory or higher geometry. Higher symmetries allow for nonlinear, aperiodic behaviour which manifest as a variety of complex non-equilibrium phenomena that do not arise in the linearised U(1) theory, such as multiple stable states, symmetry breaking, chaos and emergence.  In higher symmetry groups, the electromagnetic field is not a calm, randomly fluctuating, passive substance, but can at times be viewed as a turbulent virtual plasma that can have complex vortices, entangled states and a rich nonlinear structure.\n\nWhat are called Maxwell's equation's today are in fact a simplified version of the original equations reformulated by Heaviside, FitzGerald, Lodge and Hertz. The original equations used Hamilton's more expressive quaternion notation, a kind of Clifford algebra, which fully subsumes the standard Maxwell vectorial equations largely used today. In the late 1880s there was a debate over the relative merits of vector analysis and quaternions. According to Heaviside the electromagnetic potential field was purely metaphysical, an arbitrary mathematical fiction, that needed to be \"murdered\".  It was concluded that there was no need for the greater physical insights provided by the quaternions if the theory was purely local in nature. Local vector analysis has become the dominant way of using Maxwell's equations ever since. However, this strictly vectorial approach has led to a restrictive topological understanding in some areas of electromagnetism, for example, a full understanding of the energy transfer dynamics in Tesla's oscillator-shuttle-circuit can be achieved only in quaternionic algebra or higher SU(2) symmetries.   It has often been argued that quaternions are not compatible with special relativity, but multiple papers have shown ways of incorporating relativity\n\nA good example of nonlinear electromagnetics is in high energy dense plasmas, where vortical phenomena occur which seemingly violate the second law of thermodynamics by increasing the energy gradient within the electromagnetic field and violate Maxwell's laws by creating ion currents which capture and concentrate their own and surrounding magnetic fields. In particular Lorentz force law, which elaborates Maxwell's equations is violated by these force free vortices. These apparent violations are due to the fact that the traditional conservation laws in classical and quantum electrodynamics (QED) only display linear U(1) symmetry (in particular, by the extended Noether theorem, conservation laws such as the laws of thermodynamics need not always apply to dissipative systems, which are expressed in gauges of higher symmetry). The second law of thermodynamics states that in a closed linear system entropy flow can be only be positive (or exactly zero at the end of a cycle). However, negative entropy (i.e. increased order, structure or self-organisation) can spontaneously appear in an open nonlinear thermodynamic system that is far from equilibrium, so long as this emergent order accelerates the overall flow of entropy in the total system.\n\nGiven the complex and adaptive behaviour that arises from nonlinear systems considerable attention in recent years has gone into studying a new class of phase transitions which occur at absolute zero temperature. These are quantum phase transitions which are driven by electromagnetic field fluctuations as a consequence of zero-point energy A good example of a spontaneous phase transition that are attributed to zero-point fluctuations can be found in superconductors. Superconductivity is one of the best known empirically quantified macroscopic electromagnetic phenomena whose basis is recognised to be quantum mechanical in origin. The behaviour of the electric and magnetic fields under superconductivity is governed by the London equations. However, it has been questioned in a series of journal articles whether the quantum mechanically canonised London equations can be given a purely classical derivation. Bostick for instance, has claimed to show that the London equations do indeed have a classical origin that applies to superconductors and to some collisionless plasmas as well. In particular it has been asserted that the Beltrami vortices in the plasma focus display the same paired flux-tube morphology as Type II superconductors. Others have also pointed out this connection, Fröhlich has shown that the hydrodynamic equations of compressible fluids, together with the London equations, lead to a macroscopic parameter (\\mu = electric charge density / mass density), without involving either quantum phase factors or Planck's constant. In essence, it has been asserted that Beltrami plasma vortex structures are able to at least simulate the morphology of Type I and Type II superconductors. This occurs because the \"organised\" dissipative energy of the vortex configuration comprising the ions and electrons far exceeds the \"disorganised\" dissipative random thermal energy. The transition from disorganised fluctuations to organised helical structures is a phase transition involving a change in the condensate's energy  (i.e. the ground state or zero-point energy) but without any associated rise in temperature. This is an example of zero-point energy having multiple stable states (see Quantum phase transition, Quantum critical point, Topological degeneracy, Topological order) and where the overall system structure is independent of a reductionist or deterministic view, that \"classical\" macroscopic order can also causally affect quantum phenomena.\n\nQuantities and units\n\nElectromagnetic units are part of a system of electrical units based primarily upon the magnetic properties of electric currents, the fundamental SI unit being the ampere. The units are:\n\n*ampere (electric current)\n*coulomb (electric charge)\n*farad (capacitance)\n*henry (inductance)\n*ohm (resistance)\n*siemens (conductance)\n*tesla (magnetic flux density)\n*volt (electric potential)\n*watt (power)\n*weber (magnetic flux)\n\nIn the electromagnetic cgs system, electric current is a fundamental quantity defined via Ampère's law and takes the permeability as a dimensionless quantity (relative permeability) whose value in a vacuum is unity. As a consequence, the square of the speed of light appears explicitly in some of the equations interrelating quantities in this system.\n\nFormulas for physical laws of electromagnetism (such as Maxwell's equations) need to be adjusted depending on what system of units one uses. This is because there is no one-to-one correspondence between electromagnetic units in SI and those in CGS, as is the case for mechanical units. Furthermore, within CGS, there are several plausible choices of electromagnetic units, leading to different unit \"sub-systems\", including Gaussian, \"ESU\", \"EMU\", and Heaviside–Lorentz. Among these choices, Gaussian units are the most common today, and in fact the phrase \"CGS units\" is often used to refer specifically to CGS-Gaussian units. Electromagnetism. http://en.wikipedia.org/?curid=9532."
  }
}
