{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19852",
  "eid" : "3e433b90-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778613705,
  "textBody" : "Madhuri Dixit (born 15 May 1967), also known by her married name Madhuri Dixit Nene,http://www.bollywoodshaadis.com/articles/bollywood-actresses-and-their-surnames-after-wedding-3138 is an Indian actress who is known for her work in Hindi cinema. Dixit has been praised by critics for her acting and dancing skills. She has received six Filmfare Awards, four for Best Actress, one for Best Supporting Actress and one special award. She has been nominated for the Filmfare Award for Best Actress a record fourteen times. She was awarded the Padma Shri, India's fourth-highest civilian award, by the Government of India in 2008.\n\nDixit made her film debut in Abodh (1984) and received wider public recognition with Tezaab (1988). She went on to establish herself as a leading actress of Hindi cinema with the films Ram Lakhan (1989), Parinda (1989), Dil (1990), Saajan (1991), Beta (1992), Khalnayak (1993), Hum Aapke Hain Koun..! (1994), Raja (1995) and Dil To Pagal Hai (1997). She also garnered critical acclaim for her work in the dramas Anjaam (1994), Mrityudand (1997), Pukar (2000), Lajja (2001) and Devdas (2002). In 2002, she took a sabbatical from films to raise her children and made a comeback with the musical Aaja Nachle in 2007, later starring in the 2014 dramas Dedh Ishqiya and Gulaab Gang.\n\nIn addition to acting in films, Dixit has been featured as a talent judge for four seasons of the dance reality show Jhalak Dikhhla Jaa. She has participated in several stage shows and has engaged in philanthropic activities. Since 1999, she is married to doctor Shriram Madhav Nene, with whom she has two children.\n\nEarly life \n\nDixit is a native of Mumbai, India. She was born on 15 May 1967 in a Maharashtrian Chitpavan Brahmin family to Shankar and Snehlata Dixit.[http://indianexpress.com/photos/entertainment-gallery/happy-birthday-madhuri-dixit-dhak-dhak-girl-turns-47/#2madhuri_dixit_parents \"PHOTOS: Happy Birthday Madhuri Dixit: ‘Dhak Dhak’ girl turns 47\"]. The Indian Express.[http://indiatoday.intoday.in/gallery/madhuris-life-in-pics/3/3182.html \"Madhuri Dixit, the queen of dance and expressions turns 47 today\"]. India Today. Dixit attended Divine Child High School and Mumbai University and studied to be a microbiologist. She has always desired dance since the age of 3 and went on to practice the art of Kathak and later on to become a trained professional Kathak dancer.\n\nFilm career \n\n1984–88: Debut and career struggles \n\nDixit made her acting debut in Rajshri Productions' movie Abodh in 1984 opposite the Bengali actor, Tapas Paul. The film failed to do well but Dixit earned positive reviews from critics. Aakash Barvalia on Gomolo praised her as he wrote \"Madhuri excels in her role as a young bride who acquits herself well as the naive village girl and does not realize what marriage actually entails.\" Her only release of 1985 was Awara Baap which turned out to be another failure for Dixit.\n\nIn 1986, Dixit starred in two movies, Swati and Manav Hatya but both films flopped at the box office. Dixit had three releases in 1987 with Mohre, Hifazat and Uttar Dakshin but her films continued to flop at the box office. Among Dixit's three releases of 1988, the first two of them - Dayavan and Khatron Ke Khiladi too failed to do well commercially.\n\n1988–89: Breakthrough and public recognition \n\nDixit finally attained stardom after a series of consecutive flops when she landed the lead female role of Mohini in N. Chandra's romantic thriller Tezaab opposite Anil Kapoor. The film went on to become that year's highest-grossing movie. It was Dixit's first commercial success and her earliest of several collaborations with Kapoor. Akshay Shah of Planet Bollywood praised Dixit for her dancing skills and her acting. He wrote \"Mahduri Dixit gives a fine-tuned performance. Though she is more remembered for her crowd pleasing dance act Ek Do Teen, her acting needs to be noted, especially in the scenes where she is pitted against Anupam Kher. She looks and dances like a dream.\" Dixit received her first nomination for the Filmfare Best Actress Award for her work in Tezaab.\n\nIn 1989, her first release was Subhash Ghai's drama Ram Lakhan, in which she was paired once again with Anil Kapoor. The film became a super-hit and went on to become the second highest-grossing film of the year. Dixit's next release, the critically acclaimed romantic drama Prem Pratigyaa, in which she starred opposite Mithun Chakraborty, failed to do well commercially. However, critics were appreciative of her portrayal and she received her second nomination for the Filmfare Best Actress Award. Thereafter Dixit got success in Rajiv Rai's multi-starrer action thriller Tridev, in which she starred alongside Naseeruddin Shah, Jackie Shroff, Sunny Deol, Sangeeta Bijlani, Sonam and Amrish Puri. Dixit was paired with Deol. The movie became the year's third highest-grossing film. Dixit continued her success with her fourth pairing with Anil Kapoor in Vidhu Vinod Chopra's drama Parinda. Although Dixit's role was small, she received praise for her work. Aniket Joshi has praised her as he wrote \"Madhuri Dixit, the only female character in the film, has a small role as Paro (Karan´s love interest and Prakash´s sister) yet still does well in the few scenes she has.\"\n\n1990–2002: career expansion \n\nIn 1990, Dixit starred in the romantic drama Dil opposite Aamir Khan. She played the role of a rich and arrogant girl who falls in love with a poorer boy and later leaves her home to marry him. The film became the biggest box office hit of the year in India and Dixit's performance earned her the first Filmfare Best Actress Award of her career. She was also seen in the dramas Sailaab opposite Aditya Pancholi and Kishen Kanhaiya opposite Anil Kapoor; the former flopped while the latter went on to become the third biggest hit of the year. After the success of Dil, Dixit became one of the leading actresses of Bollywood. The following year, she starred in the super-hit movie Saajan opposite Salman Khan and Sanjay Dutt. This became the year's highest-grossing movie. Dixit's performance earned her the fourth nomination for the Filmfare Best Actress Award.\n\nIn 1992, Dixit featured in the film Beta opposite Anil Kapoor. Dixit's performance of Saraswati earned her critical acclaim. Upperstall.com praised Dixit's work: \"She made Beta her own film totally stealing a march over the film's hero, Anil Kapoor. While the highlight of the film was undoubtedly Dhak Dhak Karne Laga – probably the sexiest and most popular dance of Madhuri's career, her blazing performance – that of a woman married to an illiterate, well-meaning man and who exposes her scheming mother-in-law whom her husband dotes on – had film reviewers gushing with several people jokingly saying the film should have been called Beti instead!\" Dixit's performance in Beta won her a second Filmfare Best Actress Award. Following the film's success, Dixit became famously known as the \"Dhak Dhak Girl\" for her performance in the famous song \"Dhak Dhak Karne Laga\".\n\nIn 1993, Dixit starred in the controversial super-hit Khalnayak opposite Sanjay Dutt and Jackie Shroff. Her portrayal of the police officer Ganga earned her critical acclaim. Shahid Khan of Planet Bollywood praised Dixit's dancing and acting skills in the movie: \"In any other film, the heroine would not have much to do with a plot like this. So immense is the star-power of Madhuri Dixit that Subhash Ghai actually carved out a solid role for her in this macho tale of a bad boy and his shenanigans. She gives real competition to Sanjay Dutt. The audiences ran in droves to witness the Madhuri Dixit magic. In every scene, she holds you captive with her stunning beauty, demanding screen presence, expressive acting and excellent dancing skills. Saroj Khan’s dance choreography is entertaining to watch, particularly in \"Choli Ke Peeche Kya Hai\". Madhuri’s entrance is a riot with a prison inmate asking her, 'Kaisi aurat hai tu? (What kind of a woman are you?)' and she responds by slapping her and saying, 'Aisi aurat hoon main! (This is the kind of woman I am!)'\". Dixit's performance in Khalnayak earned her a sixth nomination for the Filmfare Best Actress Award and became the year's second highest grossing film. In 1994, Dixit starred in Anjaam, being paired with Shahrukh Khan for the first time. Dixit's performance of a revenge-seeking wife and mother earned her a seventh nomination for the Filmfare Best Actress Award. Dixit was praised for her performance, though the film was an average performer at the box office. Her next starring role was in the film Hum Aapke Hain Koun..! opposite Salman Khan. The film became one of the biggest hits in the history of Hindi cinema and made  1.35 billion worldwide, breaking the record of the film Sholay (1975). It became the highest grossing Bollywood film in Hindi cinema history after its theatrical run and held the record for 7 years till the release of Gadar: Ek Prem Katha (2001). Dixit's role of a modern yet family-oriented young girl fetched her the third Filmfare Best Actress Award of her career. Critics believed the film to be \"too sweet\" but appreciated Dixit's performance as she mesmerised on the screen. In the Millennium Edition of the \"Guinness Book of World Records\", Hum Aapke Hain Kaun became the Bollywood's highest-grossing film. Upperstall.com wrote \"Madhuri Dixit, reunited with the banner that launched her, stands out and is undoubtedly the life of the film as Nisha. Be it the mischievous but strong-minded, independent girl who gives it to Prem as good as she gets or the woman willing to sacrifice her love believing she is doing the right thing, Madhuri is absolutely spot on creating one of the more memorable female characters of Hindi Cinema.\"\n\n1995 saw Dixit star in the hit Raja opposite Sanjay Kapoor. The film became the fourth highest grosser of the year and its success was attributed to her immense popularity. Her next release was David Dhawan's Yaraana opposite Rishi Kapoor, in which she played a dancer on the run from her abusive lover. This film was a below average performer at the box office. Both films earned her nominations for the Filmfare Best Actress Award.\n\nDixit's career went into a slump during 1996 as films like Prem Granth and Rajkumar flopped at the box office. In 1997, Dixit bounced back with Prakash Jha's Mrityudand, in which she performed opposite Shabana Azmi and Shilpa Shirodkar. Dixit played the role of Ketki, one of the three troubled women and earned immense critical acclaim for her performance. Upperstall.com wrote \"Madhuri gives a wonderful, insightful performance as the self-respecting educated woman married into a family of male chauvinistic upper class landlords and who is humiliated by her husband when she objects to his misdeeds, never hitting a false note. She more than matches up to seasoned artists like Shabana and Om Puri in their scenes together. In a word, she is mesmerizing.\"\n\nDixit starred in Yash Chopra's musical romance Dil To Pagal Hai (1997), opposite Shahrukh Khan and Karisma Kapoor. Her role of a woman faced with a moral dilemma in a love triangle fetched her the fourth Filmfare Best Actress Award. The film also proved to be a success at the box office. However, her career then went to a decline with films like Wajood (1998) and Aarzoo (1999) sinking at the box office.\n\nIn 2000, Dixit starred in Rajkumar Santoshi's Pukar opposite Anil Kapoor. A love story based on the backdrop of the Indian Army, the film was shot over the course of 350 days. Dixit's portrayal of a negative role in it earned her the twelfth nomination for the Filmfare Best Actress Award. She then played the title character in Gaja Gamini, the first feature film directed by painter M. F. Husain. Hussain was fixated with Dixit, and watched her Hum Aapke Hain Koun..! several times, and was certain that he would make a film only with her. He directed it at the age of 85. The film followed the story of Gaja Gamini, who appears in various incarnations as Mona Lisa, Shakuntala and others. The former film was an average grosser, while the latter bombed at the box office.\n\nIn 2001, Dixit starred in Deepak Shivdasani's love triangle Yeh Raaste Hain Pyaar Ke opposite Ajay Devgan and Preity Zinta. Dixit followed up by reuniting with Rajkumar Santoshi in the multi-starrer Lajja (2001). Dealing with the issue of gender inequality, Dixit played the role of a stage player in it. Anita Bora of Rediff.com wrote: \"Madhuri slips into her role as Janaki..with consummate ease..and..dazzles us with a class act.\" The film was a box-office failure in India but was an overseas success. Dixit was nominated for the Filmfare Award for Best Supporting Actress for Lajja. In 2002, Dixit starred in a lead role in the love triangle film Hum Tumhare Hain Sanam opposite Shahrukh Khan and Salman Khan. A remake of director K. S. Adhiyaman's own Tamil film Thotta Chinungi (1995), the film took six years in the making, with huge sabbaticals in between shoots due to several production problems. Few critics noted that the delay made the film look outdated.\n\nDixit's next release was Sanjay Leela Bhansali's period romance Devdas, co-starring Shahrukh Khan and Aishwarya Rai. It was based on the Sharat Chandra Chattopadhyay's novel of the same name. She portrayed Chandramukhi, a courtesan who is in love with the title character. Sita Menon of Rediff.com wrote: \"The most understated role and perhaps the one that is most lingering, in terms of virtuosity, is that played by Madhuri Dixit. As Chandramukhi, she is simply stunning, lending passion, fire and gentleness with such consummate ease that watching her perform is sheer delight.\" The film was screened at the 2002 Cannes Film Festival and was featured by Time in their listing of the \"10 best films of the millennium\". The film emerged as a major international success with revenues of over . Devdas was chosen as India's official entry for the Academy Award for Best Foreign Language Film and received a nomination for the BAFTA Award for Best Film Not in the English Language. Dixit won the Filmfare Best supporting actress award for the film. It turned out to be her last film for a while as she shifted to Denver with her family.\n\nThe following year a film named after her, Main Madhuri Dixit Banna Chahti Hoon, was released in which a woman (played by Antara Mali) aspires to become the new Madhuri Dixit by trying her luck in Bollywood. Dixit also made her first appearance on television as a host for the India's first reality show Kahin Na Kahin Koi Hai on Sony TV.\n\n2007–present: return to films \n\nIn 2006, Dixit returned to India with her family, and acted in cinematographer Anil Mehta's dance film Aaja Nachle (2007). It was her first release in five years, where she played the role of a choreographer. The film was a box office failure, but Dixit's role was appreciated by critics. Rajeev Masand of CNN-IBN criticised the plot, while he wrote about Dixit's performance: \"It’s hard to take your eyes off the screen when she’s up there, dazzling you with her spontaneity, her easy charm and her 100-watt smile.\" Her performance earned her the nomination for the Filmfare Best Actress Award.\n\nIn 2011, Dixit was felicitated with the Filmfare Special Award for completing 25 years in the film industry.\n\nDixit returned to India in 2012, and made her acting comeback after seven years with the black comedy Dedh Ishqiya (2014). It was a sequel to Ishqiya (2010), where she was cast as con-woman \"Begum Para\" opposite Naseeruddin Shah, Arshad Warsi and Huma Qureshi. Dixit expressed that she agreed to do the film because of the \"unapologetic way\" its director Abhishek Chaubey presented Vidya Balan’s character\" in Ishqiya. The film opened to positive response from critics who called it \"one of the year's most important releases\". Anupama Chopra called Dixit \n\"compelling\", while Deepanjana Pal of Firstpost wrote \"She's still capable of keeping an audience glued to their seats when the credits start rolling, all because she's dancing on screen.\". The film earned her the fourteenth nomination for Filmfare Award for Best Actress.\n\nHer next release of the year was the debutant director Soumik Sen's Gulaab Gang, alongside Juhi Chawla. Dixit portrayed Rajjo, the leader of a women activist group, the film and her role were inspired from the real vigilante activist Sampat Pal Devi and her group Gulabi Gang. Pal filed a case against the film claiming that the makers did not take permission to make a film on her life, but the court later lifted the stay from the film. To prepare for her role, Dixit practised Shaolin Kung fu, stick training, and close combat. Gulaab Gang failed at the box office, earning mixed reviews. Subhash K. Jha labelled Dixit's performance and demeanour \"inconsistent\". Although Sampat Pal claimed that in Dixit's character she finds a \"reflection of her own life so stark\" that it makes her feel \"it was she on screen\".\n\nArtistry \n\nDance \n\nDixit is not only known for her acting skills, but for her dancing skills as well. Often referred to as the \"Dhak Dhak Girl\", she is famous for her dance in the song \"Dhak Dhak Karne Laga\" from the film Beta. She is also known for her dance sequences accompanying Bollywood songs such as \"Ek Do Teen\" (from Tezaab), \"Humko Aaj Kal Hai\" (from Sailaab), \"Bada Dukh Deenha\" (from Ram Lakhan), \"Chane Ke Khet Mein\" (from Anjaam), \"Didi Tera Devar Deewana\" (from Hum Aapke Hain Koun..!), \"Choli Ke Peechhe\" (from Khalnayak), \"Akhiyan Milaun\" (from Raja), \"Mera Piya Ghar Aaya\" (from Yaraana), \"Kay Sera Sera\" (from Pukar),  \"Badi Mushkil\" (from Lajja), \"Maar Daala\" (from Devdas), \"Aaja Nachle\" (from Aaja Nachle), and \"Ghagra\" (from Yeh Jawaani Hai Deewani).\n\nPandit Birju Maharaj, a Kathak dancer, who choreographed Dixit in the film Devdas for the song \"Kaahe Chhed\", calls her \"the best Bollywood dancer due to her versatility.\" Film critic Raja Sen describes Dixit as \"the industry's numero uno in every sense.\" Further he elaborates, \"She is an exemplary dancer. From Kathak to Dhak Dhak, she's done it all and wowed us every step of the way.\" Saroj Khan, who choreographed most of Dixit's early hits, after working with her again in Gulaab Gang called her the \"choreographer's delight\".\n\nNon-acting work \n\nStage performances \n\nDixit is a frequent performer and has participated in several world tours and concerts.\n\nIn the mid-2008, Madhuri, Aishwarya Rai, Abhishek Bachchan, Amitabh Bachchan, Preity Zinta and Ritesh Deshmukh starred in the \"Unforgettable World Tour\" stage production. The tour covered the USA, Canada, Trinidad, and London, England.\n\nIn 2013, Dixit joined the fourth instalment of Shah Rukh Khans Temptation tour \"Temptation Reloaded\" where they visited and performed a series of concerts in Auckland, Perth, Sydney and Dubai; it also featured Rani Mukerji, Deepika Padukone, Jacqueline Fernandez, Honey Singh and Meiyang Chang.\n\nLegal notice for alleged false representation in endorsements\n\nIn May–June 2015 the Tamil Nadu Consumer's Forum sent her notices for \"false representation\" in advertisements of Maggi, a noodle brand in which toxic levels of lead were found. She continued endorsing the safety of the product on Twitter, even when food regulators had already found more than 17 times the permissible limits of lead and its product was banned.\n\nOn June 5, 2015, Food Safety and Standards Authority of India (FSSAI) orders banned all nine variants of Maggi instant noodles from India, terming them \"unsafe and hazardous\" for human consumption. It was also found that the \"health oats noodles\", a product which had not even completed the mandatory \"process of risk assessment\", was promoted by the actress.\n\nSocial work \n\nIn 2001 Dixit won   on Kaun Banega Crorepati, a game show then in its first season on the air. She directed that her winnings be donated for the welfare of victims of an earthquake in Gujarat and to an orphanage in Pune.\n\nIn 2009 Dixit performed for NDTV Toyota Greenathon—India's first-ever nationwide campaign for saving the environment and creating awareness about environmental issues. NDTV organised India's first 24-hour live telethon, a fund-raising event that brings in people to donate money to support TERI's initiative—Lighting a Billion Lives which aims at providing solar power to villages without electricity. Dixit became a part of this great social cause, and she performed her hit numbers on the live show.http://www.ndtv.com/video/environment/news/madhuri-shares-the-green-cause-53938http://www.ndtv.com/video/environment/news/ndtv-toyota-greenathon-starts-on-february-7-53490\n\nOn 3 February 2011 Dixit spent an evening with 75 orphanage kids of farmers at an ashram in Trimbakeshwar and participated in the birthdays of two children: Hrishikesh and Rani. \"We artists are ready to help such children. People from the higher society should come forward and stand firmly behind them,\" she said on the occasion. Dixit is a Goodwill Ambassador and a patron for \"Emeralds for Elephants\" — a charity project for the conservation of Asian elephants and other endangered species. This project has been designed to create awareness and raise vital funds for the protection of the critically endangered Asian elephant. A collaborative project between the World Land Trust (a UK based nonprofit environmental organisation) and the Wildlife Trust of India that is creating protected wildlife corridors connecting National Parks and protected areas to others. Speaking about the issue she said: \"Elephants are one of my favourite animals and I love them. So what we need to do today is to see how we can preserve our animals. I feel very strongly about this.\"\n\nOn 4 February 2012 Madhuri Dixit interacted with Cancer affected children on World Cancer Day which was organised by Pawan Hans Helicopters Ltd at Juhu, Mumbai.On World Cancer Day Pawan Hans Helicopters Limited offered a Free Joy Ride to Cancer affected children with the support of Cancer Patients Aid Association.\n\nAward ceremony participation\n\nShe also participated in the Hiru Golden Film Awards 2016 in Sri Lanka as a special guest along with Bollywood actors such as Sunil Shetty, Neil Nitin Mukesh, Jackie Shroff, and actresses Sridevi, and Karishma Kapoor.\n\nTelevision appearances \n\nIn the year 1985, she appeared in the Rajshri Production's TV show Paying Guest. She came into the first episode of the show as Neena.\n\nIn 2001 on the game show Kaun Banega Crorepatis first season, hosted by Amitabh Bachchan, she won   that she donated for people affected in natural calamities. She also made an appearance in season 4's Grand Finale that aired in 2010. In 2002, Dixit hosted a TV show Kahina Kahi Koi Hai which was a match-making show that aired on Sony Entertainment.\n\nShe also made appearances on Koffee with Karan in Seasons two and three that aired in 2007 and 2011, respectively. Her Season 2 appearance was a solo appearance and in Season 3 she shared the chat show with Sonakshi Sinha. In 2014, Madhuri made her third appearance on Koffee with Karan and on its fourth season alongside Juhi Chawla.\n\nDixit has been a guest on Nach Baliye Season 1 and 3, a celebrity-couple dancing competition in 2005 (aired on Star One) & 2007 (aired on Star Plus).\n\nIn 2011, she appeared as a judge on the dance reality show Jhalak Dikhhla Jaa 4 along with other co-judges Remo D'souza and Malaika Arora Khan.\n\nIn 2012 and 2013, Dixit rejoined Jhalak Dikhhla Jaa 5 and Jhalak Dikhhla Jaa 6 along with her co-judges Remo D'souza and Karan Johar.\n\nMadhuri also appeared on Indias Got Talent as a guest judge on two separate occasions for the promotion of her upcoming movies Dedh Ishqiya and Gulaab Gang that released in early 2014.\n\nLater on in 2014, Jhalak Dikhhla Jaa was renewed for a new season, Jhalak Dikhhla Jaa 7 where Madhuri Dixit returned to the judging panel for her fourth time with her co-judges Remo D'souza and Karan Johar.\n\nPersonal life \n\nDuring the making of Saajan in 1990, Madhuri had an affair with Sanjay Dutt who was married at the time to Richa Sharma. Despite her father's objections, the relationship continued. However, with Dutt's arrest under TADA in 1993, Madhuri ended the relationship. Talking about this break-up, film journalist Bharati Pradhan reported in The Telegraph that \"Madhuri had always been a clean player. A Dutt-Dixit alliance would’ve been disastrous and she was too sensible not to see it.\"\n\nOn 17 October 1999, Dixit married Dr. Shriram Madhav Nene, a cardiovascular surgeon from Los Angeles, California. They have two sons, Arin (b. March 2003) and Rayaan (b. March 2005). After her marriage, Dixit relocated to Denver, Colorado, for almost a decade. She moved back to Mumbai with her family in October 2011.\n\nDixit has been the Muse for the Indian painter M. F. Husain. He was so fascinated by Dixit in Hum Aapke Hain Koun..! that he watched the film 67 times, and in 2007 he booked an entire theatre to see her comeback movie Aaja Nachle. He made a series of paintings of her, and in 2000 made a film named Gaja Gamini starring her, which was intended as a tribute to Dixit herself.\n\nDixit has always been a passionate dancer, and therefore turned her passion into reality by opening her own online dance academy \"Dance With Madhuri\", where her fans have a one-on-one lesson to learn some of her most famous and well known dance numbers.\n\nAwards and nominations \n\nFilmography \n\nSelected filmography",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Madhuri Dixit" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19852" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Madhuri Dixit (born 15 May 1967), also known by her married name Madhuri Dixit Nene,http://www.bollywoodshaadis.com/articles/bollywood-actresses-and-their-surnames-after-wedding-3138 is an Indian actress who is known for her work in Hindi cinema. Dixit has been praised by critics for her acting and dancing skills. She has received six Filmfare Awards, four for Best Actress, one for Best Supporting Actress and one special award. She has been nominated for the Filmfare Award for Best Actress a record fourteen times. She was awarded the Padma Shri, India's fourth-highest civilian award, by the Government of India in 2008.\n\nDixit made her film debut in Abodh (1984) and received wider public recognition with Tezaab (1988). She went on to establish herself as a leading actress of Hindi cinema with the films Ram Lakhan (1989), Parinda (1989), Dil (1990), Saajan (1991), Beta (1992), Khalnayak (1993), Hum Aapke Hain Koun..! (1994), Raja (1995) and Dil To Pagal Hai (1997). She also garnered critical acclaim for her work in the dramas Anjaam (1994), Mrityudand (1997), Pukar (2000), Lajja (2001) and Devdas (2002). In 2002, she took a sabbatical from films to raise her children and made a comeback with the musical Aaja Nachle in 2007, later starring in the 2014 dramas Dedh Ishqiya and Gulaab Gang.\n\nIn addition to acting in films, Dixit has been featured as a talent judge for four seasons of the dance reality show Jhalak Dikhhla Jaa. She has participated in several stage shows and has engaged in philanthropic activities. Since 1999, she is married to doctor Shriram Madhav Nene, with whom she has two children.\n\nEarly life \n\nDixit is a native of Mumbai, India. She was born on 15 May 1967 in a Maharashtrian Chitpavan Brahmin family to Shankar and Snehlata Dixit.[http://indianexpress.com/photos/entertainment-gallery/happy-birthday-madhuri-dixit-dhak-dhak-girl-turns-47/#2madhuri_dixit_parents \"PHOTOS: Happy Birthday Madhuri Dixit: ‘Dhak Dhak’ girl turns 47\"]. The Indian Express.[http://indiatoday.intoday.in/gallery/madhuris-life-in-pics/3/3182.html \"Madhuri Dixit, the queen of dance and expressions turns 47 today\"]. India Today. Dixit attended Divine Child High School and Mumbai University and studied to be a microbiologist. She has always desired dance since the age of 3 and went on to practice the art of Kathak and later on to become a trained professional Kathak dancer.\n\nFilm career \n\n1984–88: Debut and career struggles \n\nDixit made her acting debut in Rajshri Productions' movie Abodh in 1984 opposite the Bengali actor, Tapas Paul. The film failed to do well but Dixit earned positive reviews from critics. Aakash Barvalia on Gomolo praised her as he wrote \"Madhuri excels in her role as a young bride who acquits herself well as the naive village girl and does not realize what marriage actually entails.\" Her only release of 1985 was Awara Baap which turned out to be another failure for Dixit.\n\nIn 1986, Dixit starred in two movies, Swati and Manav Hatya but both films flopped at the box office. Dixit had three releases in 1987 with Mohre, Hifazat and Uttar Dakshin but her films continued to flop at the box office. Among Dixit's three releases of 1988, the first two of them - Dayavan and Khatron Ke Khiladi too failed to do well commercially.\n\n1988–89: Breakthrough and public recognition \n\nDixit finally attained stardom after a series of consecutive flops when she landed the lead female role of Mohini in N. Chandra's romantic thriller Tezaab opposite Anil Kapoor. The film went on to become that year's highest-grossing movie. It was Dixit's first commercial success and her earliest of several collaborations with Kapoor. Akshay Shah of Planet Bollywood praised Dixit for her dancing skills and her acting. He wrote \"Mahduri Dixit gives a fine-tuned performance. Though she is more remembered for her crowd pleasing dance act Ek Do Teen, her acting needs to be noted, especially in the scenes where she is pitted against Anupam Kher. She looks and dances like a dream.\" Dixit received her first nomination for the Filmfare Best Actress Award for her work in Tezaab.\n\nIn 1989, her first release was Subhash Ghai's drama Ram Lakhan, in which she was paired once again with Anil Kapoor. The film became a super-hit and went on to become the second highest-grossing film of the year. Dixit's next release, the critically acclaimed romantic drama Prem Pratigyaa, in which she starred opposite Mithun Chakraborty, failed to do well commercially. However, critics were appreciative of her portrayal and she received her second nomination for the Filmfare Best Actress Award. Thereafter Dixit got success in Rajiv Rai's multi-starrer action thriller Tridev, in which she starred alongside Naseeruddin Shah, Jackie Shroff, Sunny Deol, Sangeeta Bijlani, Sonam and Amrish Puri. Dixit was paired with Deol. The movie became the year's third highest-grossing film. Dixit continued her success with her fourth pairing with Anil Kapoor in Vidhu Vinod Chopra's drama Parinda. Although Dixit's role was small, she received praise for her work. Aniket Joshi has praised her as he wrote \"Madhuri Dixit, the only female character in the film, has a small role as Paro (Karan´s love interest and Prakash´s sister) yet still does well in the few scenes she has.\"\n\n1990–2002: career expansion \n\nIn 1990, Dixit starred in the romantic drama Dil opposite Aamir Khan. She played the role of a rich and arrogant girl who falls in love with a poorer boy and later leaves her home to marry him. The film became the biggest box office hit of the year in India and Dixit's performance earned her the first Filmfare Best Actress Award of her career. She was also seen in the dramas Sailaab opposite Aditya Pancholi and Kishen Kanhaiya opposite Anil Kapoor; the former flopped while the latter went on to become the third biggest hit of the year. After the success of Dil, Dixit became one of the leading actresses of Bollywood. The following year, she starred in the super-hit movie Saajan opposite Salman Khan and Sanjay Dutt. This became the year's highest-grossing movie. Dixit's performance earned her the fourth nomination for the Filmfare Best Actress Award.\n\nIn 1992, Dixit featured in the film Beta opposite Anil Kapoor. Dixit's performance of Saraswati earned her critical acclaim. Upperstall.com praised Dixit's work: \"She made Beta her own film totally stealing a march over the film's hero, Anil Kapoor. While the highlight of the film was undoubtedly Dhak Dhak Karne Laga – probably the sexiest and most popular dance of Madhuri's career, her blazing performance – that of a woman married to an illiterate, well-meaning man and who exposes her scheming mother-in-law whom her husband dotes on – had film reviewers gushing with several people jokingly saying the film should have been called Beti instead!\" Dixit's performance in Beta won her a second Filmfare Best Actress Award. Following the film's success, Dixit became famously known as the \"Dhak Dhak Girl\" for her performance in the famous song \"Dhak Dhak Karne Laga\".\n\nIn 1993, Dixit starred in the controversial super-hit Khalnayak opposite Sanjay Dutt and Jackie Shroff. Her portrayal of the police officer Ganga earned her critical acclaim. Shahid Khan of Planet Bollywood praised Dixit's dancing and acting skills in the movie: \"In any other film, the heroine would not have much to do with a plot like this. So immense is the star-power of Madhuri Dixit that Subhash Ghai actually carved out a solid role for her in this macho tale of a bad boy and his shenanigans. She gives real competition to Sanjay Dutt. The audiences ran in droves to witness the Madhuri Dixit magic. In every scene, she holds you captive with her stunning beauty, demanding screen presence, expressive acting and excellent dancing skills. Saroj Khan’s dance choreography is entertaining to watch, particularly in \"Choli Ke Peeche Kya Hai\". Madhuri’s entrance is a riot with a prison inmate asking her, 'Kaisi aurat hai tu? (What kind of a woman are you?)' and she responds by slapping her and saying, 'Aisi aurat hoon main! (This is the kind of woman I am!)'\". Dixit's performance in Khalnayak earned her a sixth nomination for the Filmfare Best Actress Award and became the year's second highest grossing film. In 1994, Dixit starred in Anjaam, being paired with Shahrukh Khan for the first time. Dixit's performance of a revenge-seeking wife and mother earned her a seventh nomination for the Filmfare Best Actress Award. Dixit was praised for her performance, though the film was an average performer at the box office. Her next starring role was in the film Hum Aapke Hain Koun..! opposite Salman Khan. The film became one of the biggest hits in the history of Hindi cinema and made  1.35 billion worldwide, breaking the record of the film Sholay (1975). It became the highest grossing Bollywood film in Hindi cinema history after its theatrical run and held the record for 7 years till the release of Gadar: Ek Prem Katha (2001). Dixit's role of a modern yet family-oriented young girl fetched her the third Filmfare Best Actress Award of her career. Critics believed the film to be \"too sweet\" but appreciated Dixit's performance as she mesmerised on the screen. In the Millennium Edition of the \"Guinness Book of World Records\", Hum Aapke Hain Kaun became the Bollywood's highest-grossing film. Upperstall.com wrote \"Madhuri Dixit, reunited with the banner that launched her, stands out and is undoubtedly the life of the film as Nisha. Be it the mischievous but strong-minded, independent girl who gives it to Prem as good as she gets or the woman willing to sacrifice her love believing she is doing the right thing, Madhuri is absolutely spot on creating one of the more memorable female characters of Hindi Cinema.\"\n\n1995 saw Dixit star in the hit Raja opposite Sanjay Kapoor. The film became the fourth highest grosser of the year and its success was attributed to her immense popularity. Her next release was David Dhawan's Yaraana opposite Rishi Kapoor, in which she played a dancer on the run from her abusive lover. This film was a below average performer at the box office. Both films earned her nominations for the Filmfare Best Actress Award.\n\nDixit's career went into a slump during 1996 as films like Prem Granth and Rajkumar flopped at the box office. In 1997, Dixit bounced back with Prakash Jha's Mrityudand, in which she performed opposite Shabana Azmi and Shilpa Shirodkar. Dixit played the role of Ketki, one of the three troubled women and earned immense critical acclaim for her performance. Upperstall.com wrote \"Madhuri gives a wonderful, insightful performance as the self-respecting educated woman married into a family of male chauvinistic upper class landlords and who is humiliated by her husband when she objects to his misdeeds, never hitting a false note. She more than matches up to seasoned artists like Shabana and Om Puri in their scenes together. In a word, she is mesmerizing.\"\n\nDixit starred in Yash Chopra's musical romance Dil To Pagal Hai (1997), opposite Shahrukh Khan and Karisma Kapoor. Her role of a woman faced with a moral dilemma in a love triangle fetched her the fourth Filmfare Best Actress Award. The film also proved to be a success at the box office. However, her career then went to a decline with films like Wajood (1998) and Aarzoo (1999) sinking at the box office.\n\nIn 2000, Dixit starred in Rajkumar Santoshi's Pukar opposite Anil Kapoor. A love story based on the backdrop of the Indian Army, the film was shot over the course of 350 days. Dixit's portrayal of a negative role in it earned her the twelfth nomination for the Filmfare Best Actress Award. She then played the title character in Gaja Gamini, the first feature film directed by painter M. F. Husain. Hussain was fixated with Dixit, and watched her Hum Aapke Hain Koun..! several times, and was certain that he would make a film only with her. He directed it at the age of 85. The film followed the story of Gaja Gamini, who appears in various incarnations as Mona Lisa, Shakuntala and others. The former film was an average grosser, while the latter bombed at the box office.\n\nIn 2001, Dixit starred in Deepak Shivdasani's love triangle Yeh Raaste Hain Pyaar Ke opposite Ajay Devgan and Preity Zinta. Dixit followed up by reuniting with Rajkumar Santoshi in the multi-starrer Lajja (2001). Dealing with the issue of gender inequality, Dixit played the role of a stage player in it. Anita Bora of Rediff.com wrote: \"Madhuri slips into her role as Janaki..with consummate ease..and..dazzles us with a class act.\" The film was a box-office failure in India but was an overseas success. Dixit was nominated for the Filmfare Award for Best Supporting Actress for Lajja. In 2002, Dixit starred in a lead role in the love triangle film Hum Tumhare Hain Sanam opposite Shahrukh Khan and Salman Khan. A remake of director K. S. Adhiyaman's own Tamil film Thotta Chinungi (1995), the film took six years in the making, with huge sabbaticals in between shoots due to several production problems. Few critics noted that the delay made the film look outdated.\n\nDixit's next release was Sanjay Leela Bhansali's period romance Devdas, co-starring Shahrukh Khan and Aishwarya Rai. It was based on the Sharat Chandra Chattopadhyay's novel of the same name. She portrayed Chandramukhi, a courtesan who is in love with the title character. Sita Menon of Rediff.com wrote: \"The most understated role and perhaps the one that is most lingering, in terms of virtuosity, is that played by Madhuri Dixit. As Chandramukhi, she is simply stunning, lending passion, fire and gentleness with such consummate ease that watching her perform is sheer delight.\" The film was screened at the 2002 Cannes Film Festival and was featured by Time in their listing of the \"10 best films of the millennium\". The film emerged as a major international success with revenues of over . Devdas was chosen as India's official entry for the Academy Award for Best Foreign Language Film and received a nomination for the BAFTA Award for Best Film Not in the English Language. Dixit won the Filmfare Best supporting actress award for the film. It turned out to be her last film for a while as she shifted to Denver with her family.\n\nThe following year a film named after her, Main Madhuri Dixit Banna Chahti Hoon, was released in which a woman (played by Antara Mali) aspires to become the new Madhuri Dixit by trying her luck in Bollywood. Dixit also made her first appearance on television as a host for the India's first reality show Kahin Na Kahin Koi Hai on Sony TV.\n\n2007–present: return to films \n\nIn 2006, Dixit returned to India with her family, and acted in cinematographer Anil Mehta's dance film Aaja Nachle (2007). It was her first release in five years, where she played the role of a choreographer. The film was a box office failure, but Dixit's role was appreciated by critics. Rajeev Masand of CNN-IBN criticised the plot, while he wrote about Dixit's performance: \"It’s hard to take your eyes off the screen when she’s up there, dazzling you with her spontaneity, her easy charm and her 100-watt smile.\" Her performance earned her the nomination for the Filmfare Best Actress Award.\n\nIn 2011, Dixit was felicitated with the Filmfare Special Award for completing 25 years in the film industry.\n\nDixit returned to India in 2012, and made her acting comeback after seven years with the black comedy Dedh Ishqiya (2014). It was a sequel to Ishqiya (2010), where she was cast as con-woman \"Begum Para\" opposite Naseeruddin Shah, Arshad Warsi and Huma Qureshi. Dixit expressed that she agreed to do the film because of the \"unapologetic way\" its director Abhishek Chaubey presented Vidya Balan’s character\" in Ishqiya. The film opened to positive response from critics who called it \"one of the year's most important releases\". Anupama Chopra called Dixit \n\"compelling\", while Deepanjana Pal of Firstpost wrote \"She's still capable of keeping an audience glued to their seats when the credits start rolling, all because she's dancing on screen.\". The film earned her the fourteenth nomination for Filmfare Award for Best Actress.\n\nHer next release of the year was the debutant director Soumik Sen's Gulaab Gang, alongside Juhi Chawla. Dixit portrayed Rajjo, the leader of a women activist group, the film and her role were inspired from the real vigilante activist Sampat Pal Devi and her group Gulabi Gang. Pal filed a case against the film claiming that the makers did not take permission to make a film on her life, but the court later lifted the stay from the film. To prepare for her role, Dixit practised Shaolin Kung fu, stick training, and close combat. Gulaab Gang failed at the box office, earning mixed reviews. Subhash K. Jha labelled Dixit's performance and demeanour \"inconsistent\". Although Sampat Pal claimed that in Dixit's character she finds a \"reflection of her own life so stark\" that it makes her feel \"it was she on screen\".\n\nArtistry \n\nDance \n\nDixit is not only known for her acting skills, but for her dancing skills as well. Often referred to as the \"Dhak Dhak Girl\", she is famous for her dance in the song \"Dhak Dhak Karne Laga\" from the film Beta. She is also known for her dance sequences accompanying Bollywood songs such as \"Ek Do Teen\" (from Tezaab), \"Humko Aaj Kal Hai\" (from Sailaab), \"Bada Dukh Deenha\" (from Ram Lakhan), \"Chane Ke Khet Mein\" (from Anjaam), \"Didi Tera Devar Deewana\" (from Hum Aapke Hain Koun..!), \"Choli Ke Peechhe\" (from Khalnayak), \"Akhiyan Milaun\" (from Raja), \"Mera Piya Ghar Aaya\" (from Yaraana), \"Kay Sera Sera\" (from Pukar),  \"Badi Mushkil\" (from Lajja), \"Maar Daala\" (from Devdas), \"Aaja Nachle\" (from Aaja Nachle), and \"Ghagra\" (from Yeh Jawaani Hai Deewani).\n\nPandit Birju Maharaj, a Kathak dancer, who choreographed Dixit in the film Devdas for the song \"Kaahe Chhed\", calls her \"the best Bollywood dancer due to her versatility.\" Film critic Raja Sen describes Dixit as \"the industry's numero uno in every sense.\" Further he elaborates, \"She is an exemplary dancer. From Kathak to Dhak Dhak, she's done it all and wowed us every step of the way.\" Saroj Khan, who choreographed most of Dixit's early hits, after working with her again in Gulaab Gang called her the \"choreographer's delight\".\n\nNon-acting work \n\nStage performances \n\nDixit is a frequent performer and has participated in several world tours and concerts.\n\nIn the mid-2008, Madhuri, Aishwarya Rai, Abhishek Bachchan, Amitabh Bachchan, Preity Zinta and Ritesh Deshmukh starred in the \"Unforgettable World Tour\" stage production. The tour covered the USA, Canada, Trinidad, and London, England.\n\nIn 2013, Dixit joined the fourth instalment of Shah Rukh Khans Temptation tour \"Temptation Reloaded\" where they visited and performed a series of concerts in Auckland, Perth, Sydney and Dubai; it also featured Rani Mukerji, Deepika Padukone, Jacqueline Fernandez, Honey Singh and Meiyang Chang.\n\nLegal notice for alleged false representation in endorsements\n\nIn May–June 2015 the Tamil Nadu Consumer's Forum sent her notices for \"false representation\" in advertisements of Maggi, a noodle brand in which toxic levels of lead were found. She continued endorsing the safety of the product on Twitter, even when food regulators had already found more than 17 times the permissible limits of lead and its product was banned.\n\nOn June 5, 2015, Food Safety and Standards Authority of India (FSSAI) orders banned all nine variants of Maggi instant noodles from India, terming them \"unsafe and hazardous\" for human consumption. It was also found that the \"health oats noodles\", a product which had not even completed the mandatory \"process of risk assessment\", was promoted by the actress.\n\nSocial work \n\nIn 2001 Dixit won   on Kaun Banega Crorepati, a game show then in its first season on the air. She directed that her winnings be donated for the welfare of victims of an earthquake in Gujarat and to an orphanage in Pune.\n\nIn 2009 Dixit performed for NDTV Toyota Greenathon—India's first-ever nationwide campaign for saving the environment and creating awareness about environmental issues. NDTV organised India's first 24-hour live telethon, a fund-raising event that brings in people to donate money to support TERI's initiative—Lighting a Billion Lives which aims at providing solar power to villages without electricity. Dixit became a part of this great social cause, and she performed her hit numbers on the live show.http://www.ndtv.com/video/environment/news/madhuri-shares-the-green-cause-53938http://www.ndtv.com/video/environment/news/ndtv-toyota-greenathon-starts-on-february-7-53490\n\nOn 3 February 2011 Dixit spent an evening with 75 orphanage kids of farmers at an ashram in Trimbakeshwar and participated in the birthdays of two children: Hrishikesh and Rani. \"We artists are ready to help such children. People from the higher society should come forward and stand firmly behind them,\" she said on the occasion. Dixit is a Goodwill Ambassador and a patron for \"Emeralds for Elephants\" — a charity project for the conservation of Asian elephants and other endangered species. This project has been designed to create awareness and raise vital funds for the protection of the critically endangered Asian elephant. A collaborative project between the World Land Trust (a UK based nonprofit environmental organisation) and the Wildlife Trust of India that is creating protected wildlife corridors connecting National Parks and protected areas to others. Speaking about the issue she said: \"Elephants are one of my favourite animals and I love them. So what we need to do today is to see how we can preserve our animals. I feel very strongly about this.\"\n\nOn 4 February 2012 Madhuri Dixit interacted with Cancer affected children on World Cancer Day which was organised by Pawan Hans Helicopters Ltd at Juhu, Mumbai.On World Cancer Day Pawan Hans Helicopters Limited offered a Free Joy Ride to Cancer affected children with the support of Cancer Patients Aid Association.\n\nAward ceremony participation\n\nShe also participated in the Hiru Golden Film Awards 2016 in Sri Lanka as a special guest along with Bollywood actors such as Sunil Shetty, Neil Nitin Mukesh, Jackie Shroff, and actresses Sridevi, and Karishma Kapoor.\n\nTelevision appearances \n\nIn the year 1985, she appeared in the Rajshri Production's TV show Paying Guest. She came into the first episode of the show as Neena.\n\nIn 2001 on the game show Kaun Banega Crorepatis first season, hosted by Amitabh Bachchan, she won   that she donated for people affected in natural calamities. She also made an appearance in season 4's Grand Finale that aired in 2010. In 2002, Dixit hosted a TV show Kahina Kahi Koi Hai which was a match-making show that aired on Sony Entertainment.\n\nShe also made appearances on Koffee with Karan in Seasons two and three that aired in 2007 and 2011, respectively. Her Season 2 appearance was a solo appearance and in Season 3 she shared the chat show with Sonakshi Sinha. In 2014, Madhuri made her third appearance on Koffee with Karan and on its fourth season alongside Juhi Chawla.\n\nDixit has been a guest on Nach Baliye Season 1 and 3, a celebrity-couple dancing competition in 2005 (aired on Star One) & 2007 (aired on Star Plus).\n\nIn 2011, she appeared as a judge on the dance reality show Jhalak Dikhhla Jaa 4 along with other co-judges Remo D'souza and Malaika Arora Khan.\n\nIn 2012 and 2013, Dixit rejoined Jhalak Dikhhla Jaa 5 and Jhalak Dikhhla Jaa 6 along with her co-judges Remo D'souza and Karan Johar.\n\nMadhuri also appeared on Indias Got Talent as a guest judge on two separate occasions for the promotion of her upcoming movies Dedh Ishqiya and Gulaab Gang that released in early 2014.\n\nLater on in 2014, Jhalak Dikhhla Jaa was renewed for a new season, Jhalak Dikhhla Jaa 7 where Madhuri Dixit returned to the judging panel for her fourth time with her co-judges Remo D'souza and Karan Johar.\n\nPersonal life \n\nDuring the making of Saajan in 1990, Madhuri had an affair with Sanjay Dutt who was married at the time to Richa Sharma. Despite her father's objections, the relationship continued. However, with Dutt's arrest under TADA in 1993, Madhuri ended the relationship. Talking about this break-up, film journalist Bharati Pradhan reported in The Telegraph that \"Madhuri had always been a clean player. A Dutt-Dixit alliance would’ve been disastrous and she was too sensible not to see it.\"\n\nOn 17 October 1999, Dixit married Dr. Shriram Madhav Nene, a cardiovascular surgeon from Los Angeles, California. They have two sons, Arin (b. March 2003) and Rayaan (b. March 2005). After her marriage, Dixit relocated to Denver, Colorado, for almost a decade. She moved back to Mumbai with her family in October 2011.\n\nDixit has been the Muse for the Indian painter M. F. Husain. He was so fascinated by Dixit in Hum Aapke Hain Koun..! that he watched the film 67 times, and in 2007 he booked an entire theatre to see her comeback movie Aaja Nachle. He made a series of paintings of her, and in 2000 made a film named Gaja Gamini starring her, which was intended as a tribute to Dixit herself.\n\nDixit has always been a passionate dancer, and therefore turned her passion into reality by opening her own online dance academy \"Dance With Madhuri\", where her fans have a one-on-one lesson to learn some of her most famous and well known dance numbers.\n\nAwards and nominations \n\nFilmography \n\nSelected filmography. Madhuri Dixit. http://en.wikipedia.org/?curid=19852."
  }
}
