{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13681",
  "eid" : "0c3bc4a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778529770,
  "textBody" : "Certain figures in this article use scientific notation for readability.\n\nIn economics, hyperinflation occurs when a country experiences very high and usually accelerating rates of inflation, rapidly eroding the real value of the local currency, and causing the population to minimize their holdings of local money. The population normally switches to holding relatively stable foreign currencies. Under such conditions, the general price level within an economy increases rapidly as the official currency quickly loses real value. The value of economic items remains relatively stable in terms of foreign currencies.\n\nUnlike low inflation, where the process of rising prices is protracted and not generally noticeable except by studying past market prices, hyperinflation sees a rapid and continuing increase in nominal prices, the nominal cost of goods, and in the supply of money.[https://www.forbes.com/sites/jerrybowyer/2012/08/09/wheres-the-hyperinflation/ Where's the Hyperinflation?], Forbes.com, 2012\nTypically, however, the general price level rises even more rapidly than the money supply as people try ridding themselves of the devaluing currency as quickly as possible. As this scenario happens, the real stock of money (i.e., the amount of circulating money divided by the price level) decreases considerably.Bernholz, Peter 2003, chapter 5.3\n\nEconomists believe that hyperinflations are caused by large persistent government deficits financed primarily by money creation (rather than by borrowing or by increasing taxation). As such, hyperinflation is often associated with some stress to the government budget, such as wars or their aftermath, sociopolitical upheavals, a collapse in export prices, or other crises that make it difficult for the government to collect tax revenue. A sharp decrease in real tax revenue coupled with a strong need to maintain government spending, together with an inability or unwillingness to borrow, can lead a country into hyperinflation.\n\nDefinition\n\nIn 1956, Phillip Cagan wrote The Monetary Dynamics of Hyperinflation, the book often regarded as the first serious study of hyperinflation and its effects (though The Economics of Inflation by C. Bresciani-Turroni on the German hyperinflation was published in Italian in 1931). In his book, Cagan defined a hyperinflationary episode as starting in the month that the monthly inflation rate exceeds 50%, and as ending when the monthly inflation rate drops below 50% and stays that way for at least a year.Phillip Cagan, The Monetary Dynamics of Hyperinflation, in Milton Friedman (Editor), Studies in the Quantity Theory of Money, Chicago: University of Chicago Press (1956). Economists usually follow Cagan’s description that hyperinflation occurs when the monthly inflation rate exceeds 50%.\n\nThe International Accounting Standards Board has issued guidance on accounting rules in a hyperinflationary environment. It does not establish an absolute rule on when hyperinflation arises. Instead, it lists factors that indicate the existence of hyperinflation:\n*The general population prefers to keep its wealth in non-monetary assets or in a relatively stable foreign currency. Amounts of local currency held are immediately invested to maintain purchasing power\n*The general population regards monetary amounts not in terms of the local currency but in terms of a relatively stable foreign currency. Prices may be quoted in that currency;\n*Sales and purchases on credit take place at prices that compensate for the expected loss of purchasing power during the credit period, even if the period is short;\n*Interest rates, wages, and prices are linked to a price index; and\n*The cumulative inflation rate over three years approaches, or exceeds, 100%.\n\nCauses\n\nWhile there can be a number of causes of high inflation, most hyperinflations have been caused by government budget deficits financed by money creation. Peter Bernholz analysed 29 hyperinflations (following Cagan's definition) and concludes that at least 25 of them have been caused in this way.Bernholz, Peter 2003, chapter 5.2 and Table 5.1 A necessary condition for hyperinflation is the use of paper money, instead of gold or silver coins. Most hyperinflations in history, with some exceptions, such as the French hyperinflation of 1789-1796, occurred after the use of fiat currency became widespread in the late 19th century. The French hyperinflation took place after the introduction of a non-convertible paper currency, the assignats.\n\nMoney supply\n\nHyperinflation occurs when there is a continuing (and often accelerating) rapid increase in the amount of money that is not supported by a corresponding growth in the output of goods and services.\n\nThe price increases that result from the rapid money creation creates a vicious circle, requiring ever growing amounts of new money creation to fund government deficits. Hence both monetary inflation and price inflation proceed at a rapid pace. Such rapidly increasing prices cause widespread unwillingness of the local population to hold the local currency as it rapidly loses its buying power. Instead they quickly spend any money they receive, which increases the velocity of money flow; this in turn causes further acceleration in prices. This means that the increase in the price level is greater than that of the money supply. The real stock of money, M/P, decreases. Here M refers to the money stock and P to the price level.\n\nThis results in an imbalance between the supply and demand for the money (including currency and bank deposits), causing rapid inflation. Very high inflation rates can result in a loss of confidence in the currency, similar to a bank run. Usually, the excessive money supply growth results from the government being either unable or unwilling to fully finance the government budget through taxation or borrowing, and instead it finances the government budget deficit through the printing of money.[https://web.archive.org/web/20080408131232/http://www.fingaz.co.zw/fingaz/2003/October/October2/1365.shtml Hyperinflation: causes, cures] Bernard Mufute, 2003-10-02, \"Hyperinflation has its root cause in money growth, which is not supported by growth in the output of goods and services. Usually the excessive money supply growth is caused by financing of the government budget deficit through the printing of money.\"\n\nGovernments have sometimes resorted to excessively loose monetary policy, as it allows a government to devalue its debts and reduce (or avoid) a tax increase. Inflation is effectively a regressive tax on the users of money, but less overt than levied taxes and is therefore harder to understand by ordinary citizens. Inflation can obscure quantitative assessments of the true cost of living, as published price indices only look at data in retrospect, so may increase only months later. Monetary inflation can become hyperinflation if monetary authorities fail to fund increasing government expenses from taxes, government debt, cost cutting, or by other means, because either\n*during the time between recording or levying taxable transactions and collecting the taxes due, the value of the taxes collected falls in real value to a small fraction of the original taxes receivable; or\n*government debt issues fail to find buyers except at very deep discounts; or\n*a combination of the above.\n\nTheories of hyperinflation generally look for a relationship between seigniorage and the inflation tax. In both Cagan's model and the neo-classical models, a tipping point occurs when the increase in money supply or the drop in the monetary base makes it impossible for a government to improve its financial position. Thus when fiat money is printed, government obligations that are not denominated in money increase in cost by more than the value of the money created.\n\nFrom this, it might be wondered why any rational government would engage in actions that cause or continue hyperinflation. One reason for such actions is that often the alternative to hyperinflation is either depression or military defeat. The root cause is a matter of more dispute. In both classical economics and monetarism, it is always the result of the monetary authority irresponsibly borrowing money to pay all its expenses. These models focus on the unrestrained seigniorage of the monetary authority, and the gains from the inflation tax.\n\nIn neo-classical economic theory, hyperinflation is rooted in a deterioration of the monetary base, that is the confidence that there is a store of value that the currency will be able to command later. In this model, the perceived risk of holding currency rises dramatically, and sellers demand increasingly high premiums to accept the currency. This in turn leads to a greater fear that the currency will collapse, causing even higher premiums. One example of this is during periods of warfare, civil war, or intense internal conflict of other kinds: governments need to do whatever is necessary to continue fighting, since the alternative is defeat. Expenses cannot be cut significantly since the main outlay is armaments. Further, a civil war may make it difficult to raise taxes or to collect existing taxes. While in peacetime the deficit is financed by selling bonds, during a war it is typically difficult and expensive to borrow, especially if the war is going poorly for the government in question. The banking authorities, whether central or not, \"monetize\" the deficit, printing money to pay for the government's efforts to survive. The hyperinflation under the Chinese Nationalists from 1939 to 1945 is a classic example of a government printing money to pay civil war costs. By the end, currency was flown in over the Himalayas, and then old currency was flown out to be destroyed.\n\nHyperinflation is a complex phenomenon and one explanation may not be applicable to all cases. In both of these models, however, whether loss of confidence comes first, or central bank seigniorage, the other phase is ignited. In the case of rapid expansion of the money supply, prices rise rapidly in response to the increased supply of money relative to the supply of goods and services, and in the case of loss of confidence, the monetary authority responds to the risk premiums it has to pay by \"running the printing presses.\"\n\nNevertheless, the immense acceleration process that occurs during hyperinflation (such as during the German hyperinflation of 1922/23) still remains unclear and unpredictable. The transformation of an inflationary development into the hyperinflation has to be identified as a very complex phenomenon, which could be a further advanced research avenue of the complexity economics in conjunction with research areas like mass hysteria, bandwagon effect, social brain, and mirror neurons.Wolfgang Chr. Fischer (Editor), [http://eprints.jcu.edu.au/11756/ German Hyperinflation 1922/23 – A Law and Economics Approach], Eul Verlag, Köln, Germany 2010, p. 124\n\nSupply shocks\n\nA number of hyperinflations were caused by some sort of extreme negative supply shock, often but not always associated with wars, the breakdown of the communist system or natural disasters.\n\nModels\n\nSince hyperinflation is visible as a monetary effect, models of hyperinflation center on the demand for money. Economists see both a rapid increase in the money supply and an increase in the velocity of money if the (monetary) inflating is not stopped. Either one, or both of these together are the root causes of inflation and hyperinflation. A dramatic increase in the velocity of money as the cause of hyperinflation is central to the \"crisis of confidence\" model of hyperinflation, where the risk premium that sellers demand for the paper currency over the nominal value grows rapidly. The second theory is that there is first a radical increase in the amount of circulating medium, which can be called the \"monetary model\" of hyperinflation. In either model, the second effect then follows from the first—either too little confidence forcing an increase in the money supply, or too much money destroying confidence.\n\nIn the confidence model, some event, or series of events, such as defeats in battle, or a run on stocks of the specie that back a currency, removes the belief that the authority issuing the money will remain solvent—whether a bank or a government. Because people do not want to hold notes that may become valueless, they want to spend them. Sellers, realizing that there is a higher risk for the currency, demand a greater and greater premium over the original value. Under this model, the method of ending hyperinflation is to change the backing of the currency, often by issuing a completely new one. War is one commonly cited cause of crisis of confidence, particularly losing in a war, as occurred during Napoleonic Vienna, and capital flight, sometimes because of \"contagion\" is another. In this view, the increase in the circulating medium is the result of the government attempting to buy time without coming to terms with the root cause of the lack of confidence itself.\n\nIn the monetary model, hyperinflation is a positive feedback cycle of rapid monetary expansion. It has the same cause as all other inflation: money-issuing bodies, central or otherwise, produce currency to pay spiraling costs, often from lax fiscal policy, or the mounting costs of warfare. When business people perceive that the issuer is committed to a policy of rapid currency expansion, they mark up prices to cover the expected decay in the currency's value. The issuer must then accelerate its expansion to cover these prices, which pushes the currency value down even faster than before. According to this model the issuer cannot \"win\" and the only solution is to abruptly stop expanding the currency. Unfortunately, the end of expansion can cause a severe financial shock to those using the currency as expectations are suddenly adjusted. This policy, combined with reductions of pensions, wages, and government outlays, formed part of the Washington consensus of the 1990s.\n\nWhatever the cause, hyperinflation involves both the supply and velocity of money. Which comes first is a matter of debate, and there may be no universal story that applies to all cases. But once the hyperinflation is established, the pattern of increasing the money stock, by whichever agencies are allowed to do so, is universal. Because this practice increases the supply of currency without any matching increase in demand for it, the price of the currency, that is the exchange rate, naturally falls relative to other currencies. Inflation becomes hyperinflation when the increase in money supply turns specific areas of pricing power into a general frenzy of spending quickly before money becomes worthless. The purchasing power of the currency drops so rapidly that holding cash for even a day is an unacceptable loss of purchasing power. As a result, no one holds currency, which increases the velocity of money, and worsens the crisis.\n\nBecause rapidly rising prices undermine the role of money as a store of value, people try to spend it on real goods or services as quickly as possible. Thus, the monetary model predicts that the velocity of money will increase as a result of an excessive increase in the money supply. At the point when money velocity and prices rapidly accelerate in a vicious circle, hyperinflation is out of control, because ordinary policy mechanisms, such as increasing reserve requirements, raising interest rates, or cutting government spending will be ineffective and be responded to by shifting away from the rapidly devalued money and towards other means of exchange.\n\nDuring a period of hyperinflation, bank runs, loans for 24-hour periods, switching to alternate currencies, the return to use of gold or silver or even barter become common. Many of the people who hoard gold today expect hyperinflation, and are hedging against it by holding specie. There may also be extensive capital flight or flight to a \"hard\" currency such as the US dollar. This is sometimes met with capital controls, an idea that has swung from standard, to anathema, and back into semi-respectability. All of this constitutes an economy that is operating in an \"abnormal\" way, which may lead to decreases in real production. If so, that intensifies the hyperinflation, since it means that the amount of goods in \"too much money chasing too few goods\" formulation is also reduced. This is also part of the vicious circle of hyperinflation.\n\nOnce the vicious circle of hyperinflation has been ignited, dramatic policy means are almost always required. Simply raising interest rates is insufficient. Bolivia, for example, underwent a period of hyperinflation in 1985, where prices increased 12,000% in the space of less than a year. The government raised the price of gasoline, which it had been selling at a huge loss to quiet popular discontent, and the hyperinflation came to a halt almost immediately, since it was able to bring in hard currency by selling its oil abroad. The crisis of confidence ended, and people returned deposits to banks. The German hyperinflation (1919–November 1923) was ended by producing a currency based on assets loaned against by banks, called the Rentenmark. Hyperinflation often ends when a civil conflict ends with one side winning.\n\nAlthough wage and price controls are sometimes used to control or prevent inflation, no episode of hyperinflation has been ended by the use of price controls alone, because price controls that force merchants to sell at prices far below their restocking costs result in shortages that cause prices to rise still further.\n\nNobel prize winner Milton Friedman said \"We economists don't know much, but we do know how to create a shortage. If you want to create a shortage of tomatoes, for example, just pass a law that retailers can't sell tomatoes for more than two cents per pound. Instantly you'll have a tomato shortage. It's the same with oil or gas.\"\"Controls blamed for U.S. energy woes\", Los Angeles Times, February 13, 1977, Milton Friedman press conference in Los Angeles.\n\nEffects\n\nHyperinflation effectively wipes out the purchasing power of private and public savings; distorts the economy in favor of the hoarding of real assets; causes the monetary base, whether specie or hard currency, to flee the country; and makes the afflicted area anathema to investment.\n\nOne of the most important characteristics of hyperinflation is the accelerating substitution of the inflating money by stable money—gold and silver in former times, then relatively stable foreign currencies after the breakdown of the gold or silver standards (Thiers' Law). If inflation is high enough, government regulations like heavy penalties and fines, often combined with exchange controls, cannot prevent this currency substitution. As a consequence, the inflating currency is usually heavily undervalued compared to stable foreign money in terms of purchasing power parity. So foreigners can live cheaply and buy at cheap prices in the countries hit by high inflation. It follows that governments who do not succeed in engineering a successful currency reform in time must finally legalize the stable foreign currencies (or, formerly, gold and silver) that threaten to fully substitute the inflating money. Otherwise, their tax revenues, including the inflation tax, will approach zero.Bernholz, Peter 2003 The last episode of hyperinflation in which this process could be observed was in Zimbabwe in the first decade of the 21st century. In this case, the local money was mainly driven out by the US dollar and the South African rand.\n\nEnactment of price controls to prevent discounting the value of paper money relative to gold, silver, hard currency, or other commodities fail to force acceptance of a paper money that lacks intrinsic value. If the entity responsible for printing a currency promotes excessive money printing, with other factors contributing a reinforcing effect, hyperinflation usually continues. Hyperinflation is generally associated with paper money, which can easily be used to increase the money supply: add more zeros to the plates and print, or even stamp old notes with new numbers.[https://blogs.wsj.com/marketbeat/2008/03/06/jefferson-county-memories/ Jefferson County Miracles], Wall Street Journal, March 6, 2008. Historically, there have been numerous episodes of hyperinflation in various countries followed by a return to \"hard money\". Older economies would revert to hard currency and barter when the circulating medium became excessively devalued, generally following a \"run\" on the store of value.\n\nMuch attention on hyperinflation centers on the effect on savers whose investments become worthless. Interest rate changes often cannot keep up with hyperinflation or even high inflation, certainly with contractually fixed interest rates. For example, in the 1970s in the United Kingdom inflation reached 25% per annum, yet interest rates did not rise above 15%—and then only briefly—and many fixed interest rate loans existed. Contractually, there is often no bar to a debtor clearing his long term debt with \"hyperinflated cash\", nor could a lender simply somehow suspend the loan. Contractual \"early redemption penalties\" were (and still are) often based on a penalty of n months of interest/payment; again no real bar to paying off what had been a large loan. In interwar Germany, for example, much private and corporate debt was effectively wiped out—certainly for those holding fixed interest rate loans.\n\nLudwig von Mises used the term \"crack-up boom\" (German: Katastrophenhausse) to describe the economic consequences of an unmitigated increasing in the base-money supply. As more and more money is provided, interest rates decline towards zero. Realizing that fiat money is losing value, investors will try to place money in assets such as real estate, stocks, even art; as these appear to represent \"real\" value. Asset prices are thus becoming inflated. This potentially spiraling process will ultimately lead to the collapse of the monetary system. The Cantillon effect[https://azizonomics.com/2012/08/07/the-cantillon-effect/ Definition of Cantillon effect, first described by Richard Cantillon] says that those institutions that receive the new money first are the beneficiaries of the policy.\n\nAftermath\n\nHyperinflation is ended by drastic remedies, such as imposing the shock therapy of slashing government expenditures or altering the currency basis. One form this may take is dollarization, the use of a foreign currency (not necessarily the U.S. dollar) as a national unit of currency. An example was dollarization in Ecuador, initiated in September 2000 in response to a 75% loss of value of the Ecuadorian sucre in early 2000. But usually the \"dollarization\" takes place in spite of all efforts of the government to prevent it by exchange controls, heavy fines and penalties. The government has thus to try to engineer a successful currency reform stabilizing the value of the money. If it does not succeed with this reform the substitution of the inflating by stable money goes on. Thus it is not surprising that there have been at least seven historical cases in which the good (foreign) money did fully drive out the use of the inflating currency. In the end the government had to legalize the former, for otherwise its revenues would have fallen to zero.\n\nHyperinflation has always been a traumatic experience for the people who suffer it, and the next political regime almost always enacts policies to try to prevent its recurrence. Often this means making the central bank very aggressive about maintaining price stability, as was the case with the German Bundesbank, or moving to some hard basis of currency, such as a currency board. Many governments have enacted extremely stiff wage and price controls in the wake of hyperinflation, but this does not prevent further inflation of the money supply by the central bank, and always leads to widespread shortages of consumer goods if the controls are rigidly enforced.\n\nCurrency\n\nIn countries experiencing hyperinflation, the central bank often prints money in larger and larger denominations as the smaller denomination notes become worthless. This can result in the production of some interesting banknotes, including those denominated in amounts of 1,000,000,000 or more.\n*By late 1923, the Weimar Republic of Germany was issuing two-trillion mark banknotes and postage stamps with a face value of fifty billion marks. The highest value banknote issued by the Weimar government's Reichsbank had a face value of 100 trillion marks (1014; 100,000,000,000,000; 100 million million).1 billion in the German long scale 1000 milliard \n 1 trillion US scale.[http://www.sammler.com/coins/inflation.htm Values of the most important German Banknotes of the Inflation Period from 1920 – 1923] At the height of the inflation, one US dollar was worth 4 trillion German marks. One of the firms printing these notes submitted an invoice for the work to the Reichsbank for 32,776,899,763,734,490,417.05 (3.28 × 1019, or 33 quintillion) marks.The Penniless Billionaires, Max Shapiro, New York Times Book Co., 1980, page 203,  Shipiro comments: \"Of course, one must not forget the 5 pfennig!\"\n*The largest denomination banknote ever officially issued for circulation was in 1946 by the Hungarian National Bank for the amount of 100 quintillion pengő (100,000,000,000,000,000,000, or 1020; 100 million million million) [http://bankjegy.szabadsagharcos.org/xxcentury/p136.htm image]. (A banknote worth 10 times as much, 1021 (1 sextillion) pengő, was printed but not issued [http://bankjegy.szabadsagharcos.org/xxcentury/p137.htm image].) The banknotes did not show the numbers in full: \"hundred million b.-pengő\" (\"hundred million trillion pengő\") and \"one milliard b.-pengő\" were spelled out instead. This makes the 100,000,000,000,000 Zimbabwean dollar banknotes the note with the greatest number of zeros shown.\n*The Post-World War II hyperinflation of Hungary held the record for the most extreme monthly inflation rate ever – 41,900,000,000,000,000% (4.19 × 1016% or 41.9 quadrillion percent) for July 1946, amounting to prices doubling every 15.3 hours. By comparison, recent figures (as of 14 November 2008) estimate Zimbabwe's annual inflation rate at 89.7 sextillion (1021) percent, which corresponds to a monthly rate of 79.6 billion percent, and a doubling time of 24.7 hours. In figures, that is 89,700,000,000,000,000,000,000%.\n\nOne way to avoid the use of large numbers is by declaring a new unit of currency. (As an example, instead of 10,000,000,000 dollars, a central bank might set 1 new dollar = 1,000,000,000 old dollars, so the new note would read \"10 new dollars\".) A recent example of this is Turkey's revaluation of the Lira on 1 January 2005, when the old Turkish lira (TRL) was converted to the New Turkish lira (TRY) at a rate of 1,000,000 old to 1 new Turkish Lira. While this does not lessen the actual value of a currency, it is called redenomination or revaluation and also occasionally happens in countries with lower inflation rates. During hyperinflation, currency inflation happens so quickly that bills reach large numbers before revaluation.\n\nSome banknotes were stamped to indicate changes of denomination, as it would have taken too long to print new notes. By the time new notes were printed, they would be obsolete (that is, they would be of too low a denomination to be useful).\n\nMetallic coins were rapid casualties of hyperinflation, as the scrap value of metal enormously exceeded its face value. Massive amounts of coinage were melted down, usually illicitly, and exported for hard currency.\n\nGovernments will often try to disguise the true rate of inflation through a variety of techniques. None of these actions addresses the root causes of inflation; and if discovered, they tend to further undermine trust in the currency, causing further increases in inflation. Price controls will generally result in shortages and hoarding and extremely high demand for the controlled goods, causing disruptions of supply chains. Products available to consumers may diminish or disappear as businesses no longer find it economic to continue producing and/or distributing such goods at the legal prices, further exacerbating the shortages.\n\nThere are also issues with computerized money-handling systems. In Zimbabwe, during the hyperinflation of the Zimbabwe dollar, many automated teller machines and payment card machines struggled with arithmetic overflow errors as customers required many billions and trillions of dollars at one time.\n\nNotable hyperinflationary episodes\n\nRome\n\nDuring the Crisis of the Third Century, Rome underwent hyper-inflation caused by years of coinage devaluation.\n\nAustria\n\nIn 1922, inflation in Austria reached 1,426%, and from 1914 to January 1923, the consumer price index rose by a factor of 11,836, with the highest banknote in denominations of 500,000 Austrian krones.[http://www.fee.org/pdf/the-freeman/0604RMEbeling.pdf ]  After World War I essentially all State enterprises ran at a loss. The number of state employees in the capital, Vienna, was greater than in the earlier monarchy, even though the new republic was almost eight times smaller.\n\nObserving the Austrian response to developing hyperinflation, which included the hoarding of food and the speculation in foreign currencies, Owen S. Phillpotts, the Commercial Secretary at the British Legation in Vienna wrote: \"The Austrians are like men on a ship who cannot manage it, and are continually signalling for help. While waiting, however, most of them begin to cut rafts, each for himself, out of the sides and decks. The ship has not yet sunk despite the leaks so caused, and those who have acquired stores of wood in this way may use them to cook their food, while the more seamanlike look on cold and hungry. The population lack courage and energy as well as patriotism.\"\n\n*Start and End Date: Oct. 1921 – Sep. 1922\n*Peak Month and Rate of Inflation: Aug. 1922, 129%Sargent, T. J. (1986) Rational Expectations and Inflation, New York: Harper & Row.\n\nChina\n\nAs the first user of fiat currency, China was also the first country to experience hyperinflation. Paper currency was introduced during the Tang Dynasty, and was generally welcomed. It maintained its value, as successive Chinese governments put in place strict controls on issuance. The convenience of paper currency for trade purposes led to strong demand for paper currency. It was only when discipline on quantity supplied broke down that hyperinflation emerged.The Truth About Inflation, Chapter 2, Paul Donovan, Routledge 2015 The Yuan Dynasty was the first to print large amounts of fiat paper money to fund their wars, resulting in hyperinflation. Much later, the Republic of China went through hyperinflation from 1948–49. In 1947, the highest denomination bill was 50,000 yuan. By mid-1948, the highest denomination was 180,000,000 yuan. The 1948 currency reform replaced the yuan by the gold yuan at an exchange rate of 1 gold yuan = 3,000,000 yuan. In less than a year, the highest denomination was 10,000,000 gold yuan. In the final days of the civil war, the Silver Yuan was briefly introduced at the rate of 500,000,000 Gold Yuan. Meanwhile, the highest denomination issued by a regional bank was 6,000,000,000 yuan (issued by Xinjiang Provincial Bank in 1949). After the renminbi was instituted by the new communist government, hyperinflation ceased, with a revaluation of 1:10,000 old Renminbi in 1955.\n\n*(1) Start and End Date: Jul. 1943 – Aug. 1945\n*(1) Peak Month and Rate of Inflation: Jun. 1945, 302%\n*(2) Start and End Date: Oct. 1947 – Mid. May 1949\n*(2) Peak Month and Rate of Inflation: Apr. 5,070%Chang, K. (1958) [https://books.google.com/books?id=pGAiAQAAMAAJ The Inflationary Spiral: The Experience in China, 1939–1950], New York: The Technology Press of Massachusetts Institute of Technology and John Wiley and Sons.\n\nFrance\n\nDuring the French Revolution and first Republic, the National Assembly issued bonds, some backed by seized church property, called assignats.[http://www.thecurrencycollector.com/pdfs/BankNotesoftheFrenchRevolutionPartII.pdf J.E. Sandrock: \"Bank notes of the French Revolution\" and First Republic] Napoleon replaced them with the franc in 1803, at which time the assignats were basically worthless.\nStephen D. Dillaye pointed out that one of the reasons for the failure was massive counterfeiting of the paper currency, \"the Assignats\" – largely through London – where, according to Dillaye: \"Seventeen manufacturing establishments were in full operation in London, with a force of four hundred men devoted to the production of false and forged Assignats.\" Stephen D. Dillaye, \"Assignats and Mandats, A True History, Including an Examination of Dr. Andrew Dickson White's 'Paper Money in France'\", (Philadelphia: Henry Carey Baird & Co, 1877)\n\n*Start and End Date: May 1795 – Nov. 1796\n*Peak Month and Rate of Inflation: Mid-Aug. 1796, 304%White, E.N. (1991) 'Measuring the French Revolution's Inflation: the Tableaux de depreciation,' Histoire & Mesure, 6 (3): 245–274.\n\nGermany (Weimar Republic)\n\nBy November 1922, the value in gold of money in circulation had fallen from £300 million before World War I to £20 million. The Reichsbank responded by the unlimited printing of notes, thereby accelerating the devaluation of the mark. In his report to London, Lord D'Abernon wrote: \"In the whole course of history, no dog has ever run after its own tail with the speed of the Reichsbank.\" Germany went through its worst inflation in 1923. In 1922, the highest denomination was 50,000 Marks. By 1923, the highest denomination was 100,000,000,000,000 (1014) Marks. In December 1923 the exchange rate was 4,200,000,000,000 (4.2 × 1012) Marks to 1 US dollar.[https://mises.org/books/economicsofinflation.pdf Bresciani-Turroni, page 335] In 1923, the rate of inflation hit 3.25 × 106 percent per month (prices double every two days). Beginning on 20 November 1923, 1,000,000,000,000 old Marks were exchanged for 1 Rentenmark, so that 4.2 Rentenmarks were worth 1 US dollar, exactly the same rate the Mark had in 1914.\n\n*(1) Start and End Date: Jan. 1920 – Jan. 1920\n*(1) Peak Month and Rate of Inflation: Jan. 1920, 56.9%\n*(2) Start and End Date: Aug. 1922 – Dec. 1923\n*(2) Peak Month and Rate of Inflation: Nov. 1923, 29,525%\n\nGreece (German-Italian occupation)\n\nWith the German invasion in April 1941, there was an abrupt increase in prices. This was due to psychological factors related to the fear of shortages and to the hoarding of goods. During the German and Italian Axis occupation of Greece (1941-1944), the agricultural, mineral, industrial etc. production of Greece were used to sustain the occupation forces, but also to secure provisions for the Afrika Korps. One part of these \"sales\" of provisions was settled with bilateral clearing through the German DEGRIGES and the Italian Sagic companies at very low prices. As the value of Greek exports in drachmas fell, the demand for drachmas followed suit and so did its forex rate.\nWhile shortages started due to naval blockades and hoarding, the prices of commodities soared. The other part of the \"purchases\" was settled with drachmas secured from the Bank of Greece and printed for this purpose by private printing presses. As prices soared, the Germans and Italians started requesting more and more drachmas from the Bank of Greece to offset price increases; each time prices increased, the note circulation followed suit soon afterwards. For the year November 1943 - November 1944, the inflation rate was 2.5 × 1010%, the circulation was 6.28 × 1018 drachmas and one gold sovereign cost 43,167 billion drachmas.\nThe hyperinflation started subsiding immediately after the departure of the German occupation forces, but inflation rates took several years before they fell below 50%.\n*Start and End Date: Jun. 1941 – Jan. 1946\n*Peak Month and Rate of Inflation: Dec. 1944, 3.0 × 1010%\n\nHungary\n\nThe Treaty of Trianon and political instability between 1919 and 1924 led to a major inflation of Hungary's currency. In 1921, in an attempt to stop inflation, the national assembly of Hungary passed the Hegedüs reforms, including a 20% levy on bank deposits. This action precipitated a mistrust of banks by the public, especially the peasants, and resulted in a reduction in savings and in the amount of currency in circulation. Unable to tax adequately, the government resorted to printing money, and in 1923 inflation in Hungary reached 98% per month.\n\nBetween the end of 1945 and July 1946, Hungary went through the worst inflation ever recorded. In 1944, the highest denomination was 1,000 pengő. By the end of 1945, it was 10,000,000 pengő. The highest denomination in mid-1946 was 100,000,000,000,000,000,000 (1020) pengő. A special currency, the adópengő – or tax pengő – was created for tax and postal payments.[http://heindorffhus.motivsamler.dk/shoebox/frame-HungaryInflation02.htm Hungary: Postal history – Hyperinflation (part 2)] The value of the adópengő was adjusted each day, by radio announcement. On 1 January 1946 one adópengő equaled one pengő. By late July, one adópengő equaled 2,000,000,000,000,000,000,000 or 2×1021 (2 sextillion) pengő. When the pengő was replaced in August 1946 by the forint, the total value of all Hungarian banknotes in circulation amounted to 1/1,000 of one US dollar. This is the most severe known incident of inflation recorded, peaking at 1.3 × 1016 percent per month (prices double every 15 hours).[http://www.zimbabwesituation.com/nov14_2008.html#Z2 Zimbabwe hyperinflation 'will set world record within six weeks'] Zimbabwe Situation 2008-11-14 The overall impact of hyperinflation: On 18 August 1946, 400,000,000,000,000,000,000,000,000,000 or 4 (four hundred quadrilliard on the long scale used in Hungary; four hundred octillion on short scale) pengő became 1 forint.\n\n*Start and End Date: Aug. 1945 – Jul. 1946\n*Peak Month and Rate of Inflation: Jul. 1946, 41.9 quadrillion percentNogaro, B. (1948) 'Hungary's Recent Monetary Crisis and Its Theoretical Meaning', American Economic Review, 38 (4): 526–42.\n\nNorth Korea\n\nNorth Korea has most likely experienced hyperinflation from December 2009 to mid-January 2011. Based on the price of rice, North Korea's hyperinflation peaked in mid-January 2010, but according to black market exchange-rate data, and calculations based on purchasing power parity, North Korea experienced its peak month of inflation in early March 2010. These data are unofficial, however, and therefore must be treated with a degree of caution.\n\nPoland\n\nPoland has gone through two episodes of hyperinflation since the country regained independence following the first world war: the first one in 1923, the second one in 1989-1990. Both of these events resulted in introduction of new currencies. In 1924, the złoty replaced the original currency of post-war Poland, the mark. The currency was then replaced by a new one of the same name in 1950, which was assigned the ISO code of PLZ. As a result of the second hyperinflation crisis, the current new złoty was introduced in 1990 (ISO code: PLN). See the article on Polish złoty for more information about the currency's history.\n\nThe newly independent Poland had been struggling with a large budget deficit since its inception in 1918 but it was in 1923 when inflation reached its peak. The exchange rate to the American dollar went up from 9 Polish marks for a dollar in 1918 to 6,375,000 marks per dollar at the end of 1923. A new personal 'inflation tax' was introduced. The resolution of the crisis is attributed to the person of Władysław Grabski, who became the prime minister of Poland in December 1923. Having nominated an all-new government and been granted extraordinary lawmaking powers by the Sejm for a period of six months, he went on to introduce a new currency, establish a new national bank and scrap the inflation tax, which took place throughout 1924.\n\nThe economic crisis in Poland in 1980s was accompanied by rising inflation when new money was printed to cover a budget deficit. Although the inflation was not as acute as in 1920s, it is estimated that its annual rate reached around 600% in a period of over a year spanning parts of 1989 and 1990. The economy was stabilised by the adoption of the Balcerowicz Plan in 1989, named so after the main author of the reforms, the minister of finance Leszek Balcerowicz. The plan was largely inspired by the previous Grabski's reforms.\n\nPhilippines\n\nThe Japanese government occupying the Philippines during World War II issued fiat currencies for general circulation. The Japanese-sponsored Second Philippine Republic government led by Jose P. Laurel at the same time outlawed possession of other currencies, most especially \"guerilla money.\" The fiat money's lack of value earned it the derisive nickname \"Mickey Mouse money\". Survivors of the war often tell tales of bringing suitcase or bayong (native bags made of woven coconut or buri leaf strips) overflowing with Japanese-issued bills. In the early times, 75 Mickey Mouse pesos could buy one duck egg. In 1944, a box of matches cost more than 100 Mickey Mouse pesos.Agoncillo, Teodoro A. & Guerrero, Milagros C., History of the Filipino People, 1986, R.P. Garcia Publishing Company, Quezon City, Philippines\n\nIn 1942, the highest denomination available was 10 pesos. Before the end of the war, because of inflation, the Japanese government was forced to issue 100, 500, and 1000 peso notes.\n\n*Start and End Date: Jan. 1944 – Dec. 1944\n*Peak Month and Rate of Inflation: Jan. 1944, 60%Hartendorp, A. (1958) History of Industry and Trade of the Philippines, Manila: American Chamber of Commerce on the Philippines, Inc.\n\nBritish Malaya\n\nMalaya and Singapore were under Japanese occupation from 1942 until 1945. The Japanese issued banana money as the official currency to replace the Straits currency issued by the British. During that time, the cost of basic necessities increased drastically. As the occupation proceeded, the Japanese authorities printed more money to fund their wartime activities, which resulted in hyperinflation and a severe depreciation in value of the banana note.\n\nFrom February to December 1942, $100 of Straits currency was worth $100 in Japanese scrip. By 1 August 1945, this had inflated to $10,500, and 11 days later it had reached $95,000. After 13 August 1945, Japanese scrip had become valueless.\n\nSoviet Union\n\nA seven-year period of uncontrollable spiralling inflation occurred in the early Soviet Union, running from the earliest days of the Bolshevik Revolution in November 1917 to the reestablishment of the gold standard with the introduction of the chervonets as part of the New Economic Policy. The inflationary crisis effectively ended in March 1924 with the introduction of the so-called \"gold ruble\" as the country's standard currency.\n\nThe early Soviet hyperinflationary period was marked by three successive redenominations of its currency, in which \"new rubles\" replaced old at the rates of 10,000-to-1 (January 1, 1922), 100-to-1 (January 1, 1923), and 50,000-to-1 (March 7, 1924), respectively.\n\nBetween 1921 and 1922, inflation in the Soviet Union reached 213%.\n\nYugoslavia\n\nYugoslavia went through a period of hyperinflation and subsequent currency reforms from 1989–1994. One of several regional conflicts accompanying the dissolution of Yugoslavia was the Bosnian War (1992–1995). The Belgrade government of Slobodan Milošević backed ethnic Serbian secessionist forces in the conflict, resulting in a United Nations boycott of Yugoslavia. The UN boycott collapsed an economy already weakened by regional war, with the projected monthly inflation rate accelerating to one million percent by December, 1993 (prices double every 2.3 days). The highest denomination in 1988 was 50,000 dinars. By 1989 it was 2,000,000 dinars. In the 1990 currency reform, 1 new dinar was exchanged for 10,000 old dinars. In the 1992 currency reform, 1 new dinar was exchanged for 10 old dinars. The highest denomination in 1992 was 50,000 dinars. By 1993, it was 10,000,000,000 dinars. In the 1993 currency reform, 1 new dinar was exchanged for 1,000,000 old dinars. Before the year was over, however, the highest denomination was 500,000,000,000 dinars. In the 1994 currency reform, 1 new dinar was exchanged for 1,000,000,000 old dinars. In another currency reform a month later, 1 novi dinar was exchanged for 13 million dinars (1 novi dinar = 1 German mark at the time of exchange). The overall impact of hyperinflation was that 1 novi dinar was equal to 1 × 1027~1.3 × 1027 pre-1990 dinars. Yugoslavia's rate of inflation hit 5 × 1015 percent cumulative inflation over the time period 1 October 1993 and 24 January 1994. \n\n(1) Start and End Date: Sept. 1989 – Dec. 1989\n(1) Peak Month and Rate of Inflation: Dec 1989, 59.7%\n(2) Start and End Date: Apr. 1992 – Jan. 1994\n(2) Peak Month and Rate of Inflation: Jan. 1994, 313 million percentRostowski, J. (1998) Macroeconomics Instability in Post-Communist Countries, New York: Carendon Press.\n\nZimbabwe\n\nHyperinflation in Zimbabwe was one of the few instances that resulted in the abandonment of the local currency. At independence in 1980, the Zimbabwe dollar (ZWD) was worth about USD 1.25. Afterwards, however, rampant inflation and the collapse of the economy severely devalued the currency. Inflation was steady before Robert Mugabe began confiscating land from the white farming community in 1998, resulting in a near total collapse in food production and the decline of foreign investment.Land reform in Zimbabwe[http://www.news24.com/News24/Archive/0,,2-1659_1401988,00.html Zimbabwe famine]Greenspan, Alan. The Age of Turbulence: Adventures in a New World. New York: The Penguin Press. 2007. Page 339. The result was that to pay its expenditures Mugabe's government and Gideon Gono's Reserve Bank printed more and more notes with higher face values.\n\nHyperinflation began early in the 21st century, reaching 624% in 2004. It fell back to low triple digits before surging to a new high of 1,730% in 2006. The Reserve Bank of Zimbabwe revalued on 1 August 2006 at a ratio of 1,000 ZWD to each second dollar (ZWN), but year-to-year inflation rose by June 2007 to 11,000% (versus an earlier estimate of 9,000%). Larger denominations were progressively issued in 2008:\n# 5 May: banknotes or \"bearer cheques\" for the value of ZWN 100 million and ZWN 250 million.[http://economictimes.indiatimes.com/Zimbabwe_issues_250_mn_dollar_banknote_to_tackle_price_spiral/articleshow/3015531.cms Zimbabwe issues 250 mn dollar banknote to tackle price spiral- International Business-News-The Economic Times]\n# 15 May: new bearer cheques with a value of ZWN 500 million (then equivalent to about USD 2.50).[http://news.bbc.co.uk/1/hi/world/africa/7402943.stm BBC NEWS: Zimbabwe bank issues $500m note]\n# 20 May: a new series of notes (\"agro cheques\") in denominations of $5 billion, $25 billion and $50 billion.\n# 21 July: \"agro cheque\" for $100 billion.[http://uk.news.yahoo.com/afp/20080719/tbs-zimbabwe-economy-inflation-5268574.html ]\n\nInflation by 16 July officially surged to 2,200,000% with some analysts estimating figures surpassing 9,000,000%. As of 22 July 2008 the value of the ZWN fell to approximately 688 billion per 1 USD, or 688 trillion pre-August 2006 Zimbabwean dollars.\n\nOn 1 August 2008, the Zimbabwe dollar was redenominated at the ratio of  ZWN to each third dollar (ZWR). On 19 August 2008, official figures announced for June estimated the inflation over 11,250,000%. Zimbabwe's annual inflation was 231,000,000% in July[https://news.yahoo.com/s/afp/20081009/wl_africa_afp/zimbabweeconomyinflation ]  (prices doubling every 17.3 days). By October 2008 Zimbabwe was mired in hyperinflation with wages falling far behind inflation. In this dysfunctional economy hospitals and schools had chronic staffing problems, because many nurses and teachers could not afford bus fare to work. Most of the capital of Harare was without water because the authorities had stopped paying the bills to buy and transport the treatment chemicals. Desperate for foreign currency to keep the government functioning, Zimbabwe's central bank governor, Gideon Gono, sent runners into the streets with suitcases of Zimbabwean dollars to buy up American dollars and South African rand. For periods after July 2008, no official inflation statistics were released. Prof. Steve H. Hanke overcame the problem by estimating inflation rates after July 2008 and publishing the Hanke Hyperinflation Index for Zimbabwe.Steve H. Hanke, \"New Hyperinflation Index (HHIZ) Puts Zimbabwe Inflation at 89.7 Sextillion Percent.\" Washington, D.C.: Cato Institute. (Retrieved 17 November 2008) [http://www.cato.org/zimbabwe] Prof. Hanke's HHIZ measure indicated that the inflation peaked at an annual rate of 89.7 sextillion percent (89,700,000,000,000,000,000,000%) in mid-November 2008. The peak monthly rate was 79.6 billion percent, which is equivalent to a 98% daily rate, or around  percent yearly rate. At that rate, prices were doubling every 24.7 hours. Note that many of these figures should be considered mostly theoretic, since the hyperinflation did not proceed at that rate a whole year.Steve H. Hanke and Alex K. F. Kwok, \"On the Measurement of Zimbabwe's Hyperinflation.\" Cato Journal, Vol. 29, No. 2 (Spring/Summer 2009). [http://www.cato.org/pubs/journal/cj29n2/cj29n2-8.pdf]\n\nAt its November 2008 peak, Zimbabwe's rate of inflation approached, but failed to surpass, Hungary's July 1946 world record. On 2 February 2009, the dollar was redenominated for the third time at the ratio of  ZWR to 1 ZWL, only three weeks after the $100 trillion banknote was issued on 16 January,[http://www.africasia.com/services/news/newsitem.php?area\nafrica&item090116063500.qczog3x4.php ]  but hyperinflation waned by then as official inflation rates in USD were announced and foreign transactions were legalised, and on 12 April the dollar was abandoned in favour of using only foreign currencies. The overall impact of hyperinflation was 1 ZWL =  ZWD.\n\n*Start and End Date: Mar. 2007 – Mid-Nov. 2008\n*Peak Month and Rate of Inflation: Mid-Nov. 2008, 79.6 billion percentHanke, S. H. and Kwok, A. K. F. (2009) 'On the Measurement of Zimbabwe's Hyperinflation', Cato Journal, 29 (2): 353–64.\n\nExamples of high inflation\n\nSome countries experienced very high inflation, but did not reach hyperinflation, as defined as a monthly inflation rate of 50%.\n\nIraq\n\nBetween 1987 and 1995 the Iraqi Dinar went from an official value of 0.306 Dinars/USD (or $3.26 USD per dinar, though the black market rate is thought to have been substantially lower) to 3,000 Dinars/USD due to government printing of 10s of trillions of dinars starting with a base of only 10s of billions. That equates to approximately 315% inflation per year averaged over that eight-year period.[http://cbi.iq/index.php?pid=History History page at the Central Bank of Iraq]\n\nMexico\n\nIn spite of increased oil prices in the late 1970s (Mexico is a producer and exporter), Mexico defaulted on its external debt in 1982. As a result, the country suffered a severe case of capital flight and several years of acute inflation and peso devaluation, leading to an accumulated inflation rate of almost 27,000% between December 1975 and late 1988. On 1 January 1993, Mexico created a new currency, the nuevo peso (\"new peso\", or MXN), which chopped three zeros off the old peso (One new peso was equal to 1,000 old MXP pesos).\n\nRoman Egypt\n\nIn Roman Egypt, where the best documentation on pricing has survived, the price of a measure of wheat was 200 drachmae in 276 AD, and increased to more than 2,000,000 drachmae in 334 AD, roughly 1,000,000% inflation in a span of 58 years.\n\nAlthough the price increased by a factor of 10,000 over 58 years, the annual rate of inflation was only 17.2% compounded.\n\nRomania\n\nRomania experienced high inflation in the 1990s. The highest denomination in 1990 was 100 lei and in 1998 was 100,000 lei. By 2000 it was 500,000 lei. In early 2005 it was 1,000,000 lei. In July 2005 the lei was replaced by the new leu at 10,000 old lei 1 new leu. Inflation in 2005 was 9%. In July 2005 the highest denomination became 500 lei (\n 5,000,000 old lei).\n\nUnited States\n\nDuring the Revolutionary War, when the Continental Congress authorized the printing of paper currency called continental currency, the monthly inflation rate reached a peak of 47 percent in November 1779 (Bernholz 2003: 48). These notes depreciated rapidly, giving rise to the expression \"not worth a continental.\"\nOne cause of the inflation was counterfeiting by the British, who ran a press on HMS Phoenix, moored in New York Harbour. The counterfeits were advertised and sold almost for the price of the paper they were printed on.Stealing Lincoln’s Body (Cambridge, Mass.: Belknap Press of Harvard University Press, 2007: pg. 33\n\nA second close encounter occurred during the U.S. Civil War, between January 1861 and April 1865, the Lerner Commodity Price Index of leading cities in the eastern Confederacy states increased from 100 to over 9,000. As the Civil War dragged on, the Confederate dollar had less and less value, until it was almost worthless by the last few months of the war. Similarly, the Union government inflated its greenbacks, with the monthly rate peaking at 40 percent in March 1864 (Bernholz 2003: 107).[http://www.cato.org/pubs/journal/cj29n2/cj29n2-8.pdf Steve H. Hanke and Alex K. F. Kwok \"On the Measurement of Zimbabwe’s Hyperinflation\" Cato Journal, Vol. 29, No. 2 (Spring/Summer 2009)] \n\nVietnam\n\nVietnam went through a period of chaos and hyperinflation in the late 1980s, with inflation peaking at 774% in 1988, after the country's \"price-wage-currency\" reform package led by Mr Tran Phuong, then Deputy Prime Minister, had failed bitterly. Hyperinflation also characterizes the early stage of economic renovation, usually referred to as Đổi Mới, in Vietnam.\n\nMost severe hyperinflations in world history\n\nUnits of inflation\n\nInflation rate is usually measured in percent per year. It can also be measured in percent per month or in price doubling time.\n\n\\hbox{New price } y \\hbox{ years later} = \\hbox{old price} \\times \\left(1+\\frac{\\hbox{inflation}}{100}\\right)^{y}\n\n\\hbox{Monthly inflation} = 100 \\times \\left(\\left(1+\\frac{\\hbox{inflation}}{100}\\right)^{\\frac{1}{12}} -1\\right)\n\n\\hbox{Price doubling time} = \\frac{\\log_{e} 2}{\\log_{e} \\left(1+ \\frac{\\hbox{inflation}}{100}\\right)}\n\n\\hbox{Years per added zero of the price} = \\frac{1}{\\log_{10} \\left(1+ \\frac{\\hbox{inflation}}{100}\\right)}\n\nOften, at redenominations, three zeroes are cut from the bills. It can be read from the table that if the (annual) inflation is for example 100%, it takes 3.32 years to produce one more zero on the price tags, or 3 × 3.32 = 9.96 years to produce three zeroes. Thus can one expect a redenomination to take place about 9.96 years after the currency was introduced.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hyperinflation" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13681" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Certain figures in this article use scientific notation for readability.\n\nIn economics, hyperinflation occurs when a country experiences very high and usually accelerating rates of inflation, rapidly eroding the real value of the local currency, and causing the population to minimize their holdings of local money. The population normally switches to holding relatively stable foreign currencies. Under such conditions, the general price level within an economy increases rapidly as the official currency quickly loses real value. The value of economic items remains relatively stable in terms of foreign currencies.\n\nUnlike low inflation, where the process of rising prices is protracted and not generally noticeable except by studying past market prices, hyperinflation sees a rapid and continuing increase in nominal prices, the nominal cost of goods, and in the supply of money.[https://www.forbes.com/sites/jerrybowyer/2012/08/09/wheres-the-hyperinflation/ Where's the Hyperinflation?], Forbes.com, 2012\nTypically, however, the general price level rises even more rapidly than the money supply as people try ridding themselves of the devaluing currency as quickly as possible. As this scenario happens, the real stock of money (i.e., the amount of circulating money divided by the price level) decreases considerably.Bernholz, Peter 2003, chapter 5.3\n\nEconomists believe that hyperinflations are caused by large persistent government deficits financed primarily by money creation (rather than by borrowing or by increasing taxation). As such, hyperinflation is often associated with some stress to the government budget, such as wars or their aftermath, sociopolitical upheavals, a collapse in export prices, or other crises that make it difficult for the government to collect tax revenue. A sharp decrease in real tax revenue coupled with a strong need to maintain government spending, together with an inability or unwillingness to borrow, can lead a country into hyperinflation.\n\nDefinition\n\nIn 1956, Phillip Cagan wrote The Monetary Dynamics of Hyperinflation, the book often regarded as the first serious study of hyperinflation and its effects (though The Economics of Inflation by C. Bresciani-Turroni on the German hyperinflation was published in Italian in 1931). In his book, Cagan defined a hyperinflationary episode as starting in the month that the monthly inflation rate exceeds 50%, and as ending when the monthly inflation rate drops below 50% and stays that way for at least a year.Phillip Cagan, The Monetary Dynamics of Hyperinflation, in Milton Friedman (Editor), Studies in the Quantity Theory of Money, Chicago: University of Chicago Press (1956). Economists usually follow Cagan’s description that hyperinflation occurs when the monthly inflation rate exceeds 50%.\n\nThe International Accounting Standards Board has issued guidance on accounting rules in a hyperinflationary environment. It does not establish an absolute rule on when hyperinflation arises. Instead, it lists factors that indicate the existence of hyperinflation:\n*The general population prefers to keep its wealth in non-monetary assets or in a relatively stable foreign currency. Amounts of local currency held are immediately invested to maintain purchasing power\n*The general population regards monetary amounts not in terms of the local currency but in terms of a relatively stable foreign currency. Prices may be quoted in that currency;\n*Sales and purchases on credit take place at prices that compensate for the expected loss of purchasing power during the credit period, even if the period is short;\n*Interest rates, wages, and prices are linked to a price index; and\n*The cumulative inflation rate over three years approaches, or exceeds, 100%.\n\nCauses\n\nWhile there can be a number of causes of high inflation, most hyperinflations have been caused by government budget deficits financed by money creation. Peter Bernholz analysed 29 hyperinflations (following Cagan's definition) and concludes that at least 25 of them have been caused in this way.Bernholz, Peter 2003, chapter 5.2 and Table 5.1 A necessary condition for hyperinflation is the use of paper money, instead of gold or silver coins. Most hyperinflations in history, with some exceptions, such as the French hyperinflation of 1789-1796, occurred after the use of fiat currency became widespread in the late 19th century. The French hyperinflation took place after the introduction of a non-convertible paper currency, the assignats.\n\nMoney supply\n\nHyperinflation occurs when there is a continuing (and often accelerating) rapid increase in the amount of money that is not supported by a corresponding growth in the output of goods and services.\n\nThe price increases that result from the rapid money creation creates a vicious circle, requiring ever growing amounts of new money creation to fund government deficits. Hence both monetary inflation and price inflation proceed at a rapid pace. Such rapidly increasing prices cause widespread unwillingness of the local population to hold the local currency as it rapidly loses its buying power. Instead they quickly spend any money they receive, which increases the velocity of money flow; this in turn causes further acceleration in prices. This means that the increase in the price level is greater than that of the money supply. The real stock of money, M/P, decreases. Here M refers to the money stock and P to the price level.\n\nThis results in an imbalance between the supply and demand for the money (including currency and bank deposits), causing rapid inflation. Very high inflation rates can result in a loss of confidence in the currency, similar to a bank run. Usually, the excessive money supply growth results from the government being either unable or unwilling to fully finance the government budget through taxation or borrowing, and instead it finances the government budget deficit through the printing of money.[https://web.archive.org/web/20080408131232/http://www.fingaz.co.zw/fingaz/2003/October/October2/1365.shtml Hyperinflation: causes, cures] Bernard Mufute, 2003-10-02, \"Hyperinflation has its root cause in money growth, which is not supported by growth in the output of goods and services. Usually the excessive money supply growth is caused by financing of the government budget deficit through the printing of money.\"\n\nGovernments have sometimes resorted to excessively loose monetary policy, as it allows a government to devalue its debts and reduce (or avoid) a tax increase. Inflation is effectively a regressive tax on the users of money, but less overt than levied taxes and is therefore harder to understand by ordinary citizens. Inflation can obscure quantitative assessments of the true cost of living, as published price indices only look at data in retrospect, so may increase only months later. Monetary inflation can become hyperinflation if monetary authorities fail to fund increasing government expenses from taxes, government debt, cost cutting, or by other means, because either\n*during the time between recording or levying taxable transactions and collecting the taxes due, the value of the taxes collected falls in real value to a small fraction of the original taxes receivable; or\n*government debt issues fail to find buyers except at very deep discounts; or\n*a combination of the above.\n\nTheories of hyperinflation generally look for a relationship between seigniorage and the inflation tax. In both Cagan's model and the neo-classical models, a tipping point occurs when the increase in money supply or the drop in the monetary base makes it impossible for a government to improve its financial position. Thus when fiat money is printed, government obligations that are not denominated in money increase in cost by more than the value of the money created.\n\nFrom this, it might be wondered why any rational government would engage in actions that cause or continue hyperinflation. One reason for such actions is that often the alternative to hyperinflation is either depression or military defeat. The root cause is a matter of more dispute. In both classical economics and monetarism, it is always the result of the monetary authority irresponsibly borrowing money to pay all its expenses. These models focus on the unrestrained seigniorage of the monetary authority, and the gains from the inflation tax.\n\nIn neo-classical economic theory, hyperinflation is rooted in a deterioration of the monetary base, that is the confidence that there is a store of value that the currency will be able to command later. In this model, the perceived risk of holding currency rises dramatically, and sellers demand increasingly high premiums to accept the currency. This in turn leads to a greater fear that the currency will collapse, causing even higher premiums. One example of this is during periods of warfare, civil war, or intense internal conflict of other kinds: governments need to do whatever is necessary to continue fighting, since the alternative is defeat. Expenses cannot be cut significantly since the main outlay is armaments. Further, a civil war may make it difficult to raise taxes or to collect existing taxes. While in peacetime the deficit is financed by selling bonds, during a war it is typically difficult and expensive to borrow, especially if the war is going poorly for the government in question. The banking authorities, whether central or not, \"monetize\" the deficit, printing money to pay for the government's efforts to survive. The hyperinflation under the Chinese Nationalists from 1939 to 1945 is a classic example of a government printing money to pay civil war costs. By the end, currency was flown in over the Himalayas, and then old currency was flown out to be destroyed.\n\nHyperinflation is a complex phenomenon and one explanation may not be applicable to all cases. In both of these models, however, whether loss of confidence comes first, or central bank seigniorage, the other phase is ignited. In the case of rapid expansion of the money supply, prices rise rapidly in response to the increased supply of money relative to the supply of goods and services, and in the case of loss of confidence, the monetary authority responds to the risk premiums it has to pay by \"running the printing presses.\"\n\nNevertheless, the immense acceleration process that occurs during hyperinflation (such as during the German hyperinflation of 1922/23) still remains unclear and unpredictable. The transformation of an inflationary development into the hyperinflation has to be identified as a very complex phenomenon, which could be a further advanced research avenue of the complexity economics in conjunction with research areas like mass hysteria, bandwagon effect, social brain, and mirror neurons.Wolfgang Chr. Fischer (Editor), [http://eprints.jcu.edu.au/11756/ German Hyperinflation 1922/23 – A Law and Economics Approach], Eul Verlag, Köln, Germany 2010, p. 124\n\nSupply shocks\n\nA number of hyperinflations were caused by some sort of extreme negative supply shock, often but not always associated with wars, the breakdown of the communist system or natural disasters.\n\nModels\n\nSince hyperinflation is visible as a monetary effect, models of hyperinflation center on the demand for money. Economists see both a rapid increase in the money supply and an increase in the velocity of money if the (monetary) inflating is not stopped. Either one, or both of these together are the root causes of inflation and hyperinflation. A dramatic increase in the velocity of money as the cause of hyperinflation is central to the \"crisis of confidence\" model of hyperinflation, where the risk premium that sellers demand for the paper currency over the nominal value grows rapidly. The second theory is that there is first a radical increase in the amount of circulating medium, which can be called the \"monetary model\" of hyperinflation. In either model, the second effect then follows from the first—either too little confidence forcing an increase in the money supply, or too much money destroying confidence.\n\nIn the confidence model, some event, or series of events, such as defeats in battle, or a run on stocks of the specie that back a currency, removes the belief that the authority issuing the money will remain solvent—whether a bank or a government. Because people do not want to hold notes that may become valueless, they want to spend them. Sellers, realizing that there is a higher risk for the currency, demand a greater and greater premium over the original value. Under this model, the method of ending hyperinflation is to change the backing of the currency, often by issuing a completely new one. War is one commonly cited cause of crisis of confidence, particularly losing in a war, as occurred during Napoleonic Vienna, and capital flight, sometimes because of \"contagion\" is another. In this view, the increase in the circulating medium is the result of the government attempting to buy time without coming to terms with the root cause of the lack of confidence itself.\n\nIn the monetary model, hyperinflation is a positive feedback cycle of rapid monetary expansion. It has the same cause as all other inflation: money-issuing bodies, central or otherwise, produce currency to pay spiraling costs, often from lax fiscal policy, or the mounting costs of warfare. When business people perceive that the issuer is committed to a policy of rapid currency expansion, they mark up prices to cover the expected decay in the currency's value. The issuer must then accelerate its expansion to cover these prices, which pushes the currency value down even faster than before. According to this model the issuer cannot \"win\" and the only solution is to abruptly stop expanding the currency. Unfortunately, the end of expansion can cause a severe financial shock to those using the currency as expectations are suddenly adjusted. This policy, combined with reductions of pensions, wages, and government outlays, formed part of the Washington consensus of the 1990s.\n\nWhatever the cause, hyperinflation involves both the supply and velocity of money. Which comes first is a matter of debate, and there may be no universal story that applies to all cases. But once the hyperinflation is established, the pattern of increasing the money stock, by whichever agencies are allowed to do so, is universal. Because this practice increases the supply of currency without any matching increase in demand for it, the price of the currency, that is the exchange rate, naturally falls relative to other currencies. Inflation becomes hyperinflation when the increase in money supply turns specific areas of pricing power into a general frenzy of spending quickly before money becomes worthless. The purchasing power of the currency drops so rapidly that holding cash for even a day is an unacceptable loss of purchasing power. As a result, no one holds currency, which increases the velocity of money, and worsens the crisis.\n\nBecause rapidly rising prices undermine the role of money as a store of value, people try to spend it on real goods or services as quickly as possible. Thus, the monetary model predicts that the velocity of money will increase as a result of an excessive increase in the money supply. At the point when money velocity and prices rapidly accelerate in a vicious circle, hyperinflation is out of control, because ordinary policy mechanisms, such as increasing reserve requirements, raising interest rates, or cutting government spending will be ineffective and be responded to by shifting away from the rapidly devalued money and towards other means of exchange.\n\nDuring a period of hyperinflation, bank runs, loans for 24-hour periods, switching to alternate currencies, the return to use of gold or silver or even barter become common. Many of the people who hoard gold today expect hyperinflation, and are hedging against it by holding specie. There may also be extensive capital flight or flight to a \"hard\" currency such as the US dollar. This is sometimes met with capital controls, an idea that has swung from standard, to anathema, and back into semi-respectability. All of this constitutes an economy that is operating in an \"abnormal\" way, which may lead to decreases in real production. If so, that intensifies the hyperinflation, since it means that the amount of goods in \"too much money chasing too few goods\" formulation is also reduced. This is also part of the vicious circle of hyperinflation.\n\nOnce the vicious circle of hyperinflation has been ignited, dramatic policy means are almost always required. Simply raising interest rates is insufficient. Bolivia, for example, underwent a period of hyperinflation in 1985, where prices increased 12,000% in the space of less than a year. The government raised the price of gasoline, which it had been selling at a huge loss to quiet popular discontent, and the hyperinflation came to a halt almost immediately, since it was able to bring in hard currency by selling its oil abroad. The crisis of confidence ended, and people returned deposits to banks. The German hyperinflation (1919–November 1923) was ended by producing a currency based on assets loaned against by banks, called the Rentenmark. Hyperinflation often ends when a civil conflict ends with one side winning.\n\nAlthough wage and price controls are sometimes used to control or prevent inflation, no episode of hyperinflation has been ended by the use of price controls alone, because price controls that force merchants to sell at prices far below their restocking costs result in shortages that cause prices to rise still further.\n\nNobel prize winner Milton Friedman said \"We economists don't know much, but we do know how to create a shortage. If you want to create a shortage of tomatoes, for example, just pass a law that retailers can't sell tomatoes for more than two cents per pound. Instantly you'll have a tomato shortage. It's the same with oil or gas.\"\"Controls blamed for U.S. energy woes\", Los Angeles Times, February 13, 1977, Milton Friedman press conference in Los Angeles.\n\nEffects\n\nHyperinflation effectively wipes out the purchasing power of private and public savings; distorts the economy in favor of the hoarding of real assets; causes the monetary base, whether specie or hard currency, to flee the country; and makes the afflicted area anathema to investment.\n\nOne of the most important characteristics of hyperinflation is the accelerating substitution of the inflating money by stable money—gold and silver in former times, then relatively stable foreign currencies after the breakdown of the gold or silver standards (Thiers' Law). If inflation is high enough, government regulations like heavy penalties and fines, often combined with exchange controls, cannot prevent this currency substitution. As a consequence, the inflating currency is usually heavily undervalued compared to stable foreign money in terms of purchasing power parity. So foreigners can live cheaply and buy at cheap prices in the countries hit by high inflation. It follows that governments who do not succeed in engineering a successful currency reform in time must finally legalize the stable foreign currencies (or, formerly, gold and silver) that threaten to fully substitute the inflating money. Otherwise, their tax revenues, including the inflation tax, will approach zero.Bernholz, Peter 2003 The last episode of hyperinflation in which this process could be observed was in Zimbabwe in the first decade of the 21st century. In this case, the local money was mainly driven out by the US dollar and the South African rand.\n\nEnactment of price controls to prevent discounting the value of paper money relative to gold, silver, hard currency, or other commodities fail to force acceptance of a paper money that lacks intrinsic value. If the entity responsible for printing a currency promotes excessive money printing, with other factors contributing a reinforcing effect, hyperinflation usually continues. Hyperinflation is generally associated with paper money, which can easily be used to increase the money supply: add more zeros to the plates and print, or even stamp old notes with new numbers.[https://blogs.wsj.com/marketbeat/2008/03/06/jefferson-county-memories/ Jefferson County Miracles], Wall Street Journal, March 6, 2008. Historically, there have been numerous episodes of hyperinflation in various countries followed by a return to \"hard money\". Older economies would revert to hard currency and barter when the circulating medium became excessively devalued, generally following a \"run\" on the store of value.\n\nMuch attention on hyperinflation centers on the effect on savers whose investments become worthless. Interest rate changes often cannot keep up with hyperinflation or even high inflation, certainly with contractually fixed interest rates. For example, in the 1970s in the United Kingdom inflation reached 25% per annum, yet interest rates did not rise above 15%—and then only briefly—and many fixed interest rate loans existed. Contractually, there is often no bar to a debtor clearing his long term debt with \"hyperinflated cash\", nor could a lender simply somehow suspend the loan. Contractual \"early redemption penalties\" were (and still are) often based on a penalty of n months of interest/payment; again no real bar to paying off what had been a large loan. In interwar Germany, for example, much private and corporate debt was effectively wiped out—certainly for those holding fixed interest rate loans.\n\nLudwig von Mises used the term \"crack-up boom\" (German: Katastrophenhausse) to describe the economic consequences of an unmitigated increasing in the base-money supply. As more and more money is provided, interest rates decline towards zero. Realizing that fiat money is losing value, investors will try to place money in assets such as real estate, stocks, even art; as these appear to represent \"real\" value. Asset prices are thus becoming inflated. This potentially spiraling process will ultimately lead to the collapse of the monetary system. The Cantillon effect[https://azizonomics.com/2012/08/07/the-cantillon-effect/ Definition of Cantillon effect, first described by Richard Cantillon] says that those institutions that receive the new money first are the beneficiaries of the policy.\n\nAftermath\n\nHyperinflation is ended by drastic remedies, such as imposing the shock therapy of slashing government expenditures or altering the currency basis. One form this may take is dollarization, the use of a foreign currency (not necessarily the U.S. dollar) as a national unit of currency. An example was dollarization in Ecuador, initiated in September 2000 in response to a 75% loss of value of the Ecuadorian sucre in early 2000. But usually the \"dollarization\" takes place in spite of all efforts of the government to prevent it by exchange controls, heavy fines and penalties. The government has thus to try to engineer a successful currency reform stabilizing the value of the money. If it does not succeed with this reform the substitution of the inflating by stable money goes on. Thus it is not surprising that there have been at least seven historical cases in which the good (foreign) money did fully drive out the use of the inflating currency. In the end the government had to legalize the former, for otherwise its revenues would have fallen to zero.\n\nHyperinflation has always been a traumatic experience for the people who suffer it, and the next political regime almost always enacts policies to try to prevent its recurrence. Often this means making the central bank very aggressive about maintaining price stability, as was the case with the German Bundesbank, or moving to some hard basis of currency, such as a currency board. Many governments have enacted extremely stiff wage and price controls in the wake of hyperinflation, but this does not prevent further inflation of the money supply by the central bank, and always leads to widespread shortages of consumer goods if the controls are rigidly enforced.\n\nCurrency\n\nIn countries experiencing hyperinflation, the central bank often prints money in larger and larger denominations as the smaller denomination notes become worthless. This can result in the production of some interesting banknotes, including those denominated in amounts of 1,000,000,000 or more.\n*By late 1923, the Weimar Republic of Germany was issuing two-trillion mark banknotes and postage stamps with a face value of fifty billion marks. The highest value banknote issued by the Weimar government's Reichsbank had a face value of 100 trillion marks (1014; 100,000,000,000,000; 100 million million).1 billion in the German long scale 1000 milliard \n 1 trillion US scale.[http://www.sammler.com/coins/inflation.htm Values of the most important German Banknotes of the Inflation Period from 1920 – 1923] At the height of the inflation, one US dollar was worth 4 trillion German marks. One of the firms printing these notes submitted an invoice for the work to the Reichsbank for 32,776,899,763,734,490,417.05 (3.28 × 1019, or 33 quintillion) marks.The Penniless Billionaires, Max Shapiro, New York Times Book Co., 1980, page 203,  Shipiro comments: \"Of course, one must not forget the 5 pfennig!\"\n*The largest denomination banknote ever officially issued for circulation was in 1946 by the Hungarian National Bank for the amount of 100 quintillion pengő (100,000,000,000,000,000,000, or 1020; 100 million million million) [http://bankjegy.szabadsagharcos.org/xxcentury/p136.htm image]. (A banknote worth 10 times as much, 1021 (1 sextillion) pengő, was printed but not issued [http://bankjegy.szabadsagharcos.org/xxcentury/p137.htm image].) The banknotes did not show the numbers in full: \"hundred million b.-pengő\" (\"hundred million trillion pengő\") and \"one milliard b.-pengő\" were spelled out instead. This makes the 100,000,000,000,000 Zimbabwean dollar banknotes the note with the greatest number of zeros shown.\n*The Post-World War II hyperinflation of Hungary held the record for the most extreme monthly inflation rate ever – 41,900,000,000,000,000% (4.19 × 1016% or 41.9 quadrillion percent) for July 1946, amounting to prices doubling every 15.3 hours. By comparison, recent figures (as of 14 November 2008) estimate Zimbabwe's annual inflation rate at 89.7 sextillion (1021) percent, which corresponds to a monthly rate of 79.6 billion percent, and a doubling time of 24.7 hours. In figures, that is 89,700,000,000,000,000,000,000%.\n\nOne way to avoid the use of large numbers is by declaring a new unit of currency. (As an example, instead of 10,000,000,000 dollars, a central bank might set 1 new dollar = 1,000,000,000 old dollars, so the new note would read \"10 new dollars\".) A recent example of this is Turkey's revaluation of the Lira on 1 January 2005, when the old Turkish lira (TRL) was converted to the New Turkish lira (TRY) at a rate of 1,000,000 old to 1 new Turkish Lira. While this does not lessen the actual value of a currency, it is called redenomination or revaluation and also occasionally happens in countries with lower inflation rates. During hyperinflation, currency inflation happens so quickly that bills reach large numbers before revaluation.\n\nSome banknotes were stamped to indicate changes of denomination, as it would have taken too long to print new notes. By the time new notes were printed, they would be obsolete (that is, they would be of too low a denomination to be useful).\n\nMetallic coins were rapid casualties of hyperinflation, as the scrap value of metal enormously exceeded its face value. Massive amounts of coinage were melted down, usually illicitly, and exported for hard currency.\n\nGovernments will often try to disguise the true rate of inflation through a variety of techniques. None of these actions addresses the root causes of inflation; and if discovered, they tend to further undermine trust in the currency, causing further increases in inflation. Price controls will generally result in shortages and hoarding and extremely high demand for the controlled goods, causing disruptions of supply chains. Products available to consumers may diminish or disappear as businesses no longer find it economic to continue producing and/or distributing such goods at the legal prices, further exacerbating the shortages.\n\nThere are also issues with computerized money-handling systems. In Zimbabwe, during the hyperinflation of the Zimbabwe dollar, many automated teller machines and payment card machines struggled with arithmetic overflow errors as customers required many billions and trillions of dollars at one time.\n\nNotable hyperinflationary episodes\n\nRome\n\nDuring the Crisis of the Third Century, Rome underwent hyper-inflation caused by years of coinage devaluation.\n\nAustria\n\nIn 1922, inflation in Austria reached 1,426%, and from 1914 to January 1923, the consumer price index rose by a factor of 11,836, with the highest banknote in denominations of 500,000 Austrian krones.[http://www.fee.org/pdf/the-freeman/0604RMEbeling.pdf ]  After World War I essentially all State enterprises ran at a loss. The number of state employees in the capital, Vienna, was greater than in the earlier monarchy, even though the new republic was almost eight times smaller.\n\nObserving the Austrian response to developing hyperinflation, which included the hoarding of food and the speculation in foreign currencies, Owen S. Phillpotts, the Commercial Secretary at the British Legation in Vienna wrote: \"The Austrians are like men on a ship who cannot manage it, and are continually signalling for help. While waiting, however, most of them begin to cut rafts, each for himself, out of the sides and decks. The ship has not yet sunk despite the leaks so caused, and those who have acquired stores of wood in this way may use them to cook their food, while the more seamanlike look on cold and hungry. The population lack courage and energy as well as patriotism.\"\n\n*Start and End Date: Oct. 1921 – Sep. 1922\n*Peak Month and Rate of Inflation: Aug. 1922, 129%Sargent, T. J. (1986) Rational Expectations and Inflation, New York: Harper & Row.\n\nChina\n\nAs the first user of fiat currency, China was also the first country to experience hyperinflation. Paper currency was introduced during the Tang Dynasty, and was generally welcomed. It maintained its value, as successive Chinese governments put in place strict controls on issuance. The convenience of paper currency for trade purposes led to strong demand for paper currency. It was only when discipline on quantity supplied broke down that hyperinflation emerged.The Truth About Inflation, Chapter 2, Paul Donovan, Routledge 2015 The Yuan Dynasty was the first to print large amounts of fiat paper money to fund their wars, resulting in hyperinflation. Much later, the Republic of China went through hyperinflation from 1948–49. In 1947, the highest denomination bill was 50,000 yuan. By mid-1948, the highest denomination was 180,000,000 yuan. The 1948 currency reform replaced the yuan by the gold yuan at an exchange rate of 1 gold yuan = 3,000,000 yuan. In less than a year, the highest denomination was 10,000,000 gold yuan. In the final days of the civil war, the Silver Yuan was briefly introduced at the rate of 500,000,000 Gold Yuan. Meanwhile, the highest denomination issued by a regional bank was 6,000,000,000 yuan (issued by Xinjiang Provincial Bank in 1949). After the renminbi was instituted by the new communist government, hyperinflation ceased, with a revaluation of 1:10,000 old Renminbi in 1955.\n\n*(1) Start and End Date: Jul. 1943 – Aug. 1945\n*(1) Peak Month and Rate of Inflation: Jun. 1945, 302%\n*(2) Start and End Date: Oct. 1947 – Mid. May 1949\n*(2) Peak Month and Rate of Inflation: Apr. 5,070%Chang, K. (1958) [https://books.google.com/books?id=pGAiAQAAMAAJ The Inflationary Spiral: The Experience in China, 1939–1950], New York: The Technology Press of Massachusetts Institute of Technology and John Wiley and Sons.\n\nFrance\n\nDuring the French Revolution and first Republic, the National Assembly issued bonds, some backed by seized church property, called assignats.[http://www.thecurrencycollector.com/pdfs/BankNotesoftheFrenchRevolutionPartII.pdf J.E. Sandrock: \"Bank notes of the French Revolution\" and First Republic] Napoleon replaced them with the franc in 1803, at which time the assignats were basically worthless.\nStephen D. Dillaye pointed out that one of the reasons for the failure was massive counterfeiting of the paper currency, \"the Assignats\" – largely through London – where, according to Dillaye: \"Seventeen manufacturing establishments were in full operation in London, with a force of four hundred men devoted to the production of false and forged Assignats.\" Stephen D. Dillaye, \"Assignats and Mandats, A True History, Including an Examination of Dr. Andrew Dickson White's 'Paper Money in France'\", (Philadelphia: Henry Carey Baird & Co, 1877)\n\n*Start and End Date: May 1795 – Nov. 1796\n*Peak Month and Rate of Inflation: Mid-Aug. 1796, 304%White, E.N. (1991) 'Measuring the French Revolution's Inflation: the Tableaux de depreciation,' Histoire & Mesure, 6 (3): 245–274.\n\nGermany (Weimar Republic)\n\nBy November 1922, the value in gold of money in circulation had fallen from £300 million before World War I to £20 million. The Reichsbank responded by the unlimited printing of notes, thereby accelerating the devaluation of the mark. In his report to London, Lord D'Abernon wrote: \"In the whole course of history, no dog has ever run after its own tail with the speed of the Reichsbank.\" Germany went through its worst inflation in 1923. In 1922, the highest denomination was 50,000 Marks. By 1923, the highest denomination was 100,000,000,000,000 (1014) Marks. In December 1923 the exchange rate was 4,200,000,000,000 (4.2 × 1012) Marks to 1 US dollar.[https://mises.org/books/economicsofinflation.pdf Bresciani-Turroni, page 335] In 1923, the rate of inflation hit 3.25 × 106 percent per month (prices double every two days). Beginning on 20 November 1923, 1,000,000,000,000 old Marks were exchanged for 1 Rentenmark, so that 4.2 Rentenmarks were worth 1 US dollar, exactly the same rate the Mark had in 1914.\n\n*(1) Start and End Date: Jan. 1920 – Jan. 1920\n*(1) Peak Month and Rate of Inflation: Jan. 1920, 56.9%\n*(2) Start and End Date: Aug. 1922 – Dec. 1923\n*(2) Peak Month and Rate of Inflation: Nov. 1923, 29,525%\n\nGreece (German-Italian occupation)\n\nWith the German invasion in April 1941, there was an abrupt increase in prices. This was due to psychological factors related to the fear of shortages and to the hoarding of goods. During the German and Italian Axis occupation of Greece (1941-1944), the agricultural, mineral, industrial etc. production of Greece were used to sustain the occupation forces, but also to secure provisions for the Afrika Korps. One part of these \"sales\" of provisions was settled with bilateral clearing through the German DEGRIGES and the Italian Sagic companies at very low prices. As the value of Greek exports in drachmas fell, the demand for drachmas followed suit and so did its forex rate.\nWhile shortages started due to naval blockades and hoarding, the prices of commodities soared. The other part of the \"purchases\" was settled with drachmas secured from the Bank of Greece and printed for this purpose by private printing presses. As prices soared, the Germans and Italians started requesting more and more drachmas from the Bank of Greece to offset price increases; each time prices increased, the note circulation followed suit soon afterwards. For the year November 1943 - November 1944, the inflation rate was 2.5 × 1010%, the circulation was 6.28 × 1018 drachmas and one gold sovereign cost 43,167 billion drachmas.\nThe hyperinflation started subsiding immediately after the departure of the German occupation forces, but inflation rates took several years before they fell below 50%.\n*Start and End Date: Jun. 1941 – Jan. 1946\n*Peak Month and Rate of Inflation: Dec. 1944, 3.0 × 1010%\n\nHungary\n\nThe Treaty of Trianon and political instability between 1919 and 1924 led to a major inflation of Hungary's currency. In 1921, in an attempt to stop inflation, the national assembly of Hungary passed the Hegedüs reforms, including a 20% levy on bank deposits. This action precipitated a mistrust of banks by the public, especially the peasants, and resulted in a reduction in savings and in the amount of currency in circulation. Unable to tax adequately, the government resorted to printing money, and in 1923 inflation in Hungary reached 98% per month.\n\nBetween the end of 1945 and July 1946, Hungary went through the worst inflation ever recorded. In 1944, the highest denomination was 1,000 pengő. By the end of 1945, it was 10,000,000 pengő. The highest denomination in mid-1946 was 100,000,000,000,000,000,000 (1020) pengő. A special currency, the adópengő – or tax pengő – was created for tax and postal payments.[http://heindorffhus.motivsamler.dk/shoebox/frame-HungaryInflation02.htm Hungary: Postal history – Hyperinflation (part 2)] The value of the adópengő was adjusted each day, by radio announcement. On 1 January 1946 one adópengő equaled one pengő. By late July, one adópengő equaled 2,000,000,000,000,000,000,000 or 2×1021 (2 sextillion) pengő. When the pengő was replaced in August 1946 by the forint, the total value of all Hungarian banknotes in circulation amounted to 1/1,000 of one US dollar. This is the most severe known incident of inflation recorded, peaking at 1.3 × 1016 percent per month (prices double every 15 hours).[http://www.zimbabwesituation.com/nov14_2008.html#Z2 Zimbabwe hyperinflation 'will set world record within six weeks'] Zimbabwe Situation 2008-11-14 The overall impact of hyperinflation: On 18 August 1946, 400,000,000,000,000,000,000,000,000,000 or 4 (four hundred quadrilliard on the long scale used in Hungary; four hundred octillion on short scale) pengő became 1 forint.\n\n*Start and End Date: Aug. 1945 – Jul. 1946\n*Peak Month and Rate of Inflation: Jul. 1946, 41.9 quadrillion percentNogaro, B. (1948) 'Hungary's Recent Monetary Crisis and Its Theoretical Meaning', American Economic Review, 38 (4): 526–42.\n\nNorth Korea\n\nNorth Korea has most likely experienced hyperinflation from December 2009 to mid-January 2011. Based on the price of rice, North Korea's hyperinflation peaked in mid-January 2010, but according to black market exchange-rate data, and calculations based on purchasing power parity, North Korea experienced its peak month of inflation in early March 2010. These data are unofficial, however, and therefore must be treated with a degree of caution.\n\nPoland\n\nPoland has gone through two episodes of hyperinflation since the country regained independence following the first world war: the first one in 1923, the second one in 1989-1990. Both of these events resulted in introduction of new currencies. In 1924, the złoty replaced the original currency of post-war Poland, the mark. The currency was then replaced by a new one of the same name in 1950, which was assigned the ISO code of PLZ. As a result of the second hyperinflation crisis, the current new złoty was introduced in 1990 (ISO code: PLN). See the article on Polish złoty for more information about the currency's history.\n\nThe newly independent Poland had been struggling with a large budget deficit since its inception in 1918 but it was in 1923 when inflation reached its peak. The exchange rate to the American dollar went up from 9 Polish marks for a dollar in 1918 to 6,375,000 marks per dollar at the end of 1923. A new personal 'inflation tax' was introduced. The resolution of the crisis is attributed to the person of Władysław Grabski, who became the prime minister of Poland in December 1923. Having nominated an all-new government and been granted extraordinary lawmaking powers by the Sejm for a period of six months, he went on to introduce a new currency, establish a new national bank and scrap the inflation tax, which took place throughout 1924.\n\nThe economic crisis in Poland in 1980s was accompanied by rising inflation when new money was printed to cover a budget deficit. Although the inflation was not as acute as in 1920s, it is estimated that its annual rate reached around 600% in a period of over a year spanning parts of 1989 and 1990. The economy was stabilised by the adoption of the Balcerowicz Plan in 1989, named so after the main author of the reforms, the minister of finance Leszek Balcerowicz. The plan was largely inspired by the previous Grabski's reforms.\n\nPhilippines\n\nThe Japanese government occupying the Philippines during World War II issued fiat currencies for general circulation. The Japanese-sponsored Second Philippine Republic government led by Jose P. Laurel at the same time outlawed possession of other currencies, most especially \"guerilla money.\" The fiat money's lack of value earned it the derisive nickname \"Mickey Mouse money\". Survivors of the war often tell tales of bringing suitcase or bayong (native bags made of woven coconut or buri leaf strips) overflowing with Japanese-issued bills. In the early times, 75 Mickey Mouse pesos could buy one duck egg. In 1944, a box of matches cost more than 100 Mickey Mouse pesos.Agoncillo, Teodoro A. & Guerrero, Milagros C., History of the Filipino People, 1986, R.P. Garcia Publishing Company, Quezon City, Philippines\n\nIn 1942, the highest denomination available was 10 pesos. Before the end of the war, because of inflation, the Japanese government was forced to issue 100, 500, and 1000 peso notes.\n\n*Start and End Date: Jan. 1944 – Dec. 1944\n*Peak Month and Rate of Inflation: Jan. 1944, 60%Hartendorp, A. (1958) History of Industry and Trade of the Philippines, Manila: American Chamber of Commerce on the Philippines, Inc.\n\nBritish Malaya\n\nMalaya and Singapore were under Japanese occupation from 1942 until 1945. The Japanese issued banana money as the official currency to replace the Straits currency issued by the British. During that time, the cost of basic necessities increased drastically. As the occupation proceeded, the Japanese authorities printed more money to fund their wartime activities, which resulted in hyperinflation and a severe depreciation in value of the banana note.\n\nFrom February to December 1942, $100 of Straits currency was worth $100 in Japanese scrip. By 1 August 1945, this had inflated to $10,500, and 11 days later it had reached $95,000. After 13 August 1945, Japanese scrip had become valueless.\n\nSoviet Union\n\nA seven-year period of uncontrollable spiralling inflation occurred in the early Soviet Union, running from the earliest days of the Bolshevik Revolution in November 1917 to the reestablishment of the gold standard with the introduction of the chervonets as part of the New Economic Policy. The inflationary crisis effectively ended in March 1924 with the introduction of the so-called \"gold ruble\" as the country's standard currency.\n\nThe early Soviet hyperinflationary period was marked by three successive redenominations of its currency, in which \"new rubles\" replaced old at the rates of 10,000-to-1 (January 1, 1922), 100-to-1 (January 1, 1923), and 50,000-to-1 (March 7, 1924), respectively.\n\nBetween 1921 and 1922, inflation in the Soviet Union reached 213%.\n\nYugoslavia\n\nYugoslavia went through a period of hyperinflation and subsequent currency reforms from 1989–1994. One of several regional conflicts accompanying the dissolution of Yugoslavia was the Bosnian War (1992–1995). The Belgrade government of Slobodan Milošević backed ethnic Serbian secessionist forces in the conflict, resulting in a United Nations boycott of Yugoslavia. The UN boycott collapsed an economy already weakened by regional war, with the projected monthly inflation rate accelerating to one million percent by December, 1993 (prices double every 2.3 days). The highest denomination in 1988 was 50,000 dinars. By 1989 it was 2,000,000 dinars. In the 1990 currency reform, 1 new dinar was exchanged for 10,000 old dinars. In the 1992 currency reform, 1 new dinar was exchanged for 10 old dinars. The highest denomination in 1992 was 50,000 dinars. By 1993, it was 10,000,000,000 dinars. In the 1993 currency reform, 1 new dinar was exchanged for 1,000,000 old dinars. Before the year was over, however, the highest denomination was 500,000,000,000 dinars. In the 1994 currency reform, 1 new dinar was exchanged for 1,000,000,000 old dinars. In another currency reform a month later, 1 novi dinar was exchanged for 13 million dinars (1 novi dinar = 1 German mark at the time of exchange). The overall impact of hyperinflation was that 1 novi dinar was equal to 1 × 1027~1.3 × 1027 pre-1990 dinars. Yugoslavia's rate of inflation hit 5 × 1015 percent cumulative inflation over the time period 1 October 1993 and 24 January 1994. \n\n(1) Start and End Date: Sept. 1989 – Dec. 1989\n(1) Peak Month and Rate of Inflation: Dec 1989, 59.7%\n(2) Start and End Date: Apr. 1992 – Jan. 1994\n(2) Peak Month and Rate of Inflation: Jan. 1994, 313 million percentRostowski, J. (1998) Macroeconomics Instability in Post-Communist Countries, New York: Carendon Press.\n\nZimbabwe\n\nHyperinflation in Zimbabwe was one of the few instances that resulted in the abandonment of the local currency. At independence in 1980, the Zimbabwe dollar (ZWD) was worth about USD 1.25. Afterwards, however, rampant inflation and the collapse of the economy severely devalued the currency. Inflation was steady before Robert Mugabe began confiscating land from the white farming community in 1998, resulting in a near total collapse in food production and the decline of foreign investment.Land reform in Zimbabwe[http://www.news24.com/News24/Archive/0,,2-1659_1401988,00.html Zimbabwe famine]Greenspan, Alan. The Age of Turbulence: Adventures in a New World. New York: The Penguin Press. 2007. Page 339. The result was that to pay its expenditures Mugabe's government and Gideon Gono's Reserve Bank printed more and more notes with higher face values.\n\nHyperinflation began early in the 21st century, reaching 624% in 2004. It fell back to low triple digits before surging to a new high of 1,730% in 2006. The Reserve Bank of Zimbabwe revalued on 1 August 2006 at a ratio of 1,000 ZWD to each second dollar (ZWN), but year-to-year inflation rose by June 2007 to 11,000% (versus an earlier estimate of 9,000%). Larger denominations were progressively issued in 2008:\n# 5 May: banknotes or \"bearer cheques\" for the value of ZWN 100 million and ZWN 250 million.[http://economictimes.indiatimes.com/Zimbabwe_issues_250_mn_dollar_banknote_to_tackle_price_spiral/articleshow/3015531.cms Zimbabwe issues 250 mn dollar banknote to tackle price spiral- International Business-News-The Economic Times]\n# 15 May: new bearer cheques with a value of ZWN 500 million (then equivalent to about USD 2.50).[http://news.bbc.co.uk/1/hi/world/africa/7402943.stm BBC NEWS: Zimbabwe bank issues $500m note]\n# 20 May: a new series of notes (\"agro cheques\") in denominations of $5 billion, $25 billion and $50 billion.\n# 21 July: \"agro cheque\" for $100 billion.[http://uk.news.yahoo.com/afp/20080719/tbs-zimbabwe-economy-inflation-5268574.html ]\n\nInflation by 16 July officially surged to 2,200,000% with some analysts estimating figures surpassing 9,000,000%. As of 22 July 2008 the value of the ZWN fell to approximately 688 billion per 1 USD, or 688 trillion pre-August 2006 Zimbabwean dollars.\n\nOn 1 August 2008, the Zimbabwe dollar was redenominated at the ratio of  ZWN to each third dollar (ZWR). On 19 August 2008, official figures announced for June estimated the inflation over 11,250,000%. Zimbabwe's annual inflation was 231,000,000% in July[https://news.yahoo.com/s/afp/20081009/wl_africa_afp/zimbabweeconomyinflation ]  (prices doubling every 17.3 days). By October 2008 Zimbabwe was mired in hyperinflation with wages falling far behind inflation. In this dysfunctional economy hospitals and schools had chronic staffing problems, because many nurses and teachers could not afford bus fare to work. Most of the capital of Harare was without water because the authorities had stopped paying the bills to buy and transport the treatment chemicals. Desperate for foreign currency to keep the government functioning, Zimbabwe's central bank governor, Gideon Gono, sent runners into the streets with suitcases of Zimbabwean dollars to buy up American dollars and South African rand. For periods after July 2008, no official inflation statistics were released. Prof. Steve H. Hanke overcame the problem by estimating inflation rates after July 2008 and publishing the Hanke Hyperinflation Index for Zimbabwe.Steve H. Hanke, \"New Hyperinflation Index (HHIZ) Puts Zimbabwe Inflation at 89.7 Sextillion Percent.\" Washington, D.C.: Cato Institute. (Retrieved 17 November 2008) [http://www.cato.org/zimbabwe] Prof. Hanke's HHIZ measure indicated that the inflation peaked at an annual rate of 89.7 sextillion percent (89,700,000,000,000,000,000,000%) in mid-November 2008. The peak monthly rate was 79.6 billion percent, which is equivalent to a 98% daily rate, or around  percent yearly rate. At that rate, prices were doubling every 24.7 hours. Note that many of these figures should be considered mostly theoretic, since the hyperinflation did not proceed at that rate a whole year.Steve H. Hanke and Alex K. F. Kwok, \"On the Measurement of Zimbabwe's Hyperinflation.\" Cato Journal, Vol. 29, No. 2 (Spring/Summer 2009). [http://www.cato.org/pubs/journal/cj29n2/cj29n2-8.pdf]\n\nAt its November 2008 peak, Zimbabwe's rate of inflation approached, but failed to surpass, Hungary's July 1946 world record. On 2 February 2009, the dollar was redenominated for the third time at the ratio of  ZWR to 1 ZWL, only three weeks after the $100 trillion banknote was issued on 16 January,[http://www.africasia.com/services/news/newsitem.php?area\nafrica&item090116063500.qczog3x4.php ]  but hyperinflation waned by then as official inflation rates in USD were announced and foreign transactions were legalised, and on 12 April the dollar was abandoned in favour of using only foreign currencies. The overall impact of hyperinflation was 1 ZWL =  ZWD.\n\n*Start and End Date: Mar. 2007 – Mid-Nov. 2008\n*Peak Month and Rate of Inflation: Mid-Nov. 2008, 79.6 billion percentHanke, S. H. and Kwok, A. K. F. (2009) 'On the Measurement of Zimbabwe's Hyperinflation', Cato Journal, 29 (2): 353–64.\n\nExamples of high inflation\n\nSome countries experienced very high inflation, but did not reach hyperinflation, as defined as a monthly inflation rate of 50%.\n\nIraq\n\nBetween 1987 and 1995 the Iraqi Dinar went from an official value of 0.306 Dinars/USD (or $3.26 USD per dinar, though the black market rate is thought to have been substantially lower) to 3,000 Dinars/USD due to government printing of 10s of trillions of dinars starting with a base of only 10s of billions. That equates to approximately 315% inflation per year averaged over that eight-year period.[http://cbi.iq/index.php?pid=History History page at the Central Bank of Iraq]\n\nMexico\n\nIn spite of increased oil prices in the late 1970s (Mexico is a producer and exporter), Mexico defaulted on its external debt in 1982. As a result, the country suffered a severe case of capital flight and several years of acute inflation and peso devaluation, leading to an accumulated inflation rate of almost 27,000% between December 1975 and late 1988. On 1 January 1993, Mexico created a new currency, the nuevo peso (\"new peso\", or MXN), which chopped three zeros off the old peso (One new peso was equal to 1,000 old MXP pesos).\n\nRoman Egypt\n\nIn Roman Egypt, where the best documentation on pricing has survived, the price of a measure of wheat was 200 drachmae in 276 AD, and increased to more than 2,000,000 drachmae in 334 AD, roughly 1,000,000% inflation in a span of 58 years.\n\nAlthough the price increased by a factor of 10,000 over 58 years, the annual rate of inflation was only 17.2% compounded.\n\nRomania\n\nRomania experienced high inflation in the 1990s. The highest denomination in 1990 was 100 lei and in 1998 was 100,000 lei. By 2000 it was 500,000 lei. In early 2005 it was 1,000,000 lei. In July 2005 the lei was replaced by the new leu at 10,000 old lei 1 new leu. Inflation in 2005 was 9%. In July 2005 the highest denomination became 500 lei (\n 5,000,000 old lei).\n\nUnited States\n\nDuring the Revolutionary War, when the Continental Congress authorized the printing of paper currency called continental currency, the monthly inflation rate reached a peak of 47 percent in November 1779 (Bernholz 2003: 48). These notes depreciated rapidly, giving rise to the expression \"not worth a continental.\"\nOne cause of the inflation was counterfeiting by the British, who ran a press on HMS Phoenix, moored in New York Harbour. The counterfeits were advertised and sold almost for the price of the paper they were printed on.Stealing Lincoln’s Body (Cambridge, Mass.: Belknap Press of Harvard University Press, 2007: pg. 33\n\nA second close encounter occurred during the U.S. Civil War, between January 1861 and April 1865, the Lerner Commodity Price Index of leading cities in the eastern Confederacy states increased from 100 to over 9,000. As the Civil War dragged on, the Confederate dollar had less and less value, until it was almost worthless by the last few months of the war. Similarly, the Union government inflated its greenbacks, with the monthly rate peaking at 40 percent in March 1864 (Bernholz 2003: 107).[http://www.cato.org/pubs/journal/cj29n2/cj29n2-8.pdf Steve H. Hanke and Alex K. F. Kwok \"On the Measurement of Zimbabwe’s Hyperinflation\" Cato Journal, Vol. 29, No. 2 (Spring/Summer 2009)] \n\nVietnam\n\nVietnam went through a period of chaos and hyperinflation in the late 1980s, with inflation peaking at 774% in 1988, after the country's \"price-wage-currency\" reform package led by Mr Tran Phuong, then Deputy Prime Minister, had failed bitterly. Hyperinflation also characterizes the early stage of economic renovation, usually referred to as Đổi Mới, in Vietnam.\n\nMost severe hyperinflations in world history\n\nUnits of inflation\n\nInflation rate is usually measured in percent per year. It can also be measured in percent per month or in price doubling time.\n\n\\hbox{New price } y \\hbox{ years later} = \\hbox{old price} \\times \\left(1+\\frac{\\hbox{inflation}}{100}\\right)^{y}\n\n\\hbox{Monthly inflation} = 100 \\times \\left(\\left(1+\\frac{\\hbox{inflation}}{100}\\right)^{\\frac{1}{12}} -1\\right)\n\n\\hbox{Price doubling time} = \\frac{\\log_{e} 2}{\\log_{e} \\left(1+ \\frac{\\hbox{inflation}}{100}\\right)}\n\n\\hbox{Years per added zero of the price} = \\frac{1}{\\log_{10} \\left(1+ \\frac{\\hbox{inflation}}{100}\\right)}\n\nOften, at redenominations, three zeroes are cut from the bills. It can be read from the table that if the (annual) inflation is for example 100%, it takes 3.32 years to produce one more zero on the price tags, or 3 × 3.32 = 9.96 years to produce three zeroes. Thus can one expect a redenomination to take place about 9.96 years after the currency was introduced. Hyperinflation. http://en.wikipedia.org/?curid=13681."
  }
}
