{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6936",
  "eid" : "dedffb70-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778453671,
  "textBody" : "Cheddar cheese is a relatively hard, off-white (or orange if spices such as annatto are added), sometimes sharp-tasting (i.e., bitter), natural cheese. Originating in the English village of Cheddar in Somerset, cheeses of this style are produced beyond the region and in several countries around the world.\n\nCheddar is the most popular type of cheese in the UK, accounting for 51% of the country's £1.9 billion annual cheese market. It is the second-most popular cheese in the US (behind mozzarella), with an average annual consumption of 10 lb per capita. The US produced approximately 3000000000 lb in 2014, and the UK 258000 LT in 2008.\n\nThe term \"Cheddar cheese\" is widely used, but has no protected designation of origin within the European Union. However, in 2007 a Protected Designation of Origin, \"West Country Farmhouse Cheddar\", was created and only Cheddar produced from local milk within Somerset, Dorset, Devon and Cornwall and manufactured using traditional methods may use the name.[https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/271260/pfn-west-country-farmhouse-cheddar.pdf \"West Country Farmhouse Cheddar”], gov.uk.Brown, Steve; Blackmon, Kate; and Cousins, Paul. Operations management: policy, practice and performance improvement. Butterworth-Heinemann, 2001, pp. 265–266. Outside Europe, the style and quality of cheeses labelled as cheddar may vary greatly; furthermore, cheeses that are more similar in taste and appearance to Red Leicester are sometimes popularly marketed as \"Red Cheddar\".\n\nHistory\n\nThe cheese originates from the village of Cheddar in Somerset, south west England. Cheddar Gorge on the edge of the village contains a number of caves, which provided the ideal humidity and steady temperature for maturing the cheese. Cheddar cheese traditionally had to be made within 30 mi of Wells Cathedral.\n\nCheddar has been produced since at least the 12th century. A pipe roll of King Henry II from 1170 records the purchase of 10240 lb at a farthing per pound (totalling £10.13s.4d).\nCharles I (1600–1649) also bought cheese from the village.\nRomans may have brought the recipe to Britain from the Cantal region of France.\n\nCentral to the modernisation and standardisation of Cheddar cheese was the 19th-century Somerset dairyman Joseph Harding.\nFor his technical innovations, promotion of dairy hygiene, and volunteer dissemination of modern cheese-making techniques, he has been dubbed \"the father of Cheddar cheese\".\nHarding introduced new equipment to the process of cheese-making, including his \"revolving breaker\" for curd cutting, saving much manual effort.Transactions of the Highland and Agricultural Society of Scotland, Highland and Agricultural Society of Scotland, 1866-7 volume 1, AberdeenChristabel Susan Lowry Orwin, Edith Holt Whetham, \"History of British Agriculture, 1846–1914\", Agriculture (1964), page 145\nThe \"Joseph Harding method\" was the first modern system for Cheddar production based upon scientific principles. Harding stated that Cheddar cheese is \"not made in the field, nor in the byre, nor even in the cow, it is made in the dairy\". His wife and he were behind the introduction of the cheese into Scotland and North America. His sons, Henry and William Harding, were responsible for introducing Cheddar cheese production to Australia and facilitating the establishment of the cheese industry in New Zealand, respectively.\n\nDuring the Second World War, and for nearly a decade after, most milk in Britain was used for the making of one single kind of cheese nicknamed \"government Cheddar\" as part of war economies and rationing. This almost resulted in wiping out all other cheese production in the country. Before the First World War, more than 3,500 cheese producers were in Britain; fewer than 100 remained after the Second World War.\n\nAccording to a United States Department of Agriculture researcher, Cheddar cheese is the world's most popular variety of cheese, and the most studied type of cheese in scientific publications.\n\nProcess\n\nThe curds and whey are separated using rennet, an enzyme complex normally produced from the stomachs of newborn calves (in vegetarian or kosher cheeses, bacterial, yeast or mould-derived chymosin is used).\n\n\"Cheddaring\" refers to an additional step in the production of Cheddar cheese where, after heating, the curd is kneaded with salt, cut into cubes to drain the whey, and then stacked and turned. Strong, extra-mature Cheddar, sometimes called vintage, needs to be matured for up to 15 months. The cheese is kept at a constant temperature, often requiring special facilities. As with other hard cheese varieties produced worldwide, caves provide an ideal environment for maturing cheese; still, today, some Cheddar cheese is matured in the caves at Wookey Hole and Cheddar Gorge. Additionally, some versions of Cheddar cheese are smoked.Kelly Jaggers, [https://books.google.com/books?id\n2xUCxt9ucKQC&pg=PA104 Moufflet: More Than 100 Gourmet Muffin Recipes That Rise to Any Occasion],  p. 104.\n\nCharacter\n\nThe ideal quality of the original Somerset Cheddar was described by Joseph Harding in 1864 as \"close and firm in texture, yet mellow in character or quality; it is rich with a tendency to melt in the mouth, the flavour full and fine, approaching to that of a hazelnut\".Transactions of the New-York State Agricultural Society for the Year 1864, page 232, volume 14 1865, Albany\n\nCheddar made in the classical way tends to have a sharp, pungent flavour, often slightly earthy. The \"sharpness\" of cheddar is associated with the levels of bitter peptides in the cheese. This bitterness has been found to be significant to the overall perception of the aged Cheddar flavour. The texture is firm, with farmhouse traditional Cheddar being slightly crumbly; it should also, if mature, contain large cheese crystals consisting of calcium lactate – often precipitated when matured for times longer than six months.\n\nCheddar can be a deep to pale yellow (off-white) colour, or a yellow-orange colour when certain plant extracts are added. One commonly used spice is annatto, extracted from seeds of the tropical achiote tree. Originally added to simulate the colour of high-quality milk from grass-fed Jersey and Guernsey cows, annatto may also impart a sweet, nutty flavour. The largest producer of Cheddar cheese in the United States, Kraft, uses a combination of annatto and oleoresin paprika, an extract of the lipophilic (oily) portion of paprika.\n\nCheddar cheese was sometimes (and still can be found) packaged in black wax, but was more commonly packaged in larded cloth, which was impermeable to contaminants, but still allowed the cheese to \"breathe\".\n\nThe Slow Food Movement has created a Cheddar Presidium, claiming that only three cheeses should be called \"original Cheddar\". Their specifications, which go further than the \"West Country Farmhouse Cheddar\" PDO, require that Cheddar cheese be made in Somerset and with traditional methods, such as using raw milk, traditional animal rennet, and a cloth wrapping.\n\nInternational production\n\nThe Cheddar cheese name is used internationally; its name does not have a PDO, but the use of the name \"West Country Farmhouse Cheddar\" does. As well as the United Kingdom, countries making Cheddar cheese include Australia, Argentina, Belgium, Canada, Ireland, the Netherlands, New Zealand, South Africa, Sweden, Finland and the United States. Cheddars can be industrial or artisan cheeses. The flavour, colour, and quality of industrial cheese varies significantly, and food packaging will usually indicate a strength, such as mild, medium, strong, tasty, sharp, extra sharp, mature, old, or vintage; this may indicate the maturation period, or food additives used to enhance the flavour. Artisan varieties develop strong and diverse flavours over time.\n\nAustralia\n\nAs of 2013, Cheddar accounts for over 55% of the Australian cheese market, with average annual consumption around  per person.[http://www.dairyaustralia.com.au/~/media/Documents/Stats%20and%20markets/In%20Focus/Australian%20Dairy%20Industry%20In%20Focus%202013.pdf \"Australian Dairy Industry\"]. dairyaustralia.com. Cheddar is so commonly found that the name is rarely used: instead, Cheddar is sold by strength alone as e.g. \"mild\", \"tasty\" or \"sharp\".\n\nCanada\n\nFollowing a wheat midge outbreak in Canada in the mid-19th century, farmers in Ontario began to convert to dairy farming in large numbers, and Cheddar cheese became their main exportable product, even being exported to England. By the turn of the 20th century, 1,242 Cheddar factories were in Ontario, and Cheddar had become Canada’s second-largest export after timber. Cheddar exports totalled 234000000 lbs in 1904, but by 2012, Canada was a net importer of cheese. James L. Kraft grew up on a dairy farm in Ontario, before moving to Chicago. According to the writer Sarah Champman, \"Although we cannot wholly lay the decline of cheese craft in Canada at the feet of James Lewis Kraft, it did correspond with the rise of Kraft’s processed cheese empire.\" Most Canadian Cheddar is produced by a number of large companies in Ontario, though other provinces produce some and some smaller artisanal producers exist. The annual production is 120,000 tons. It is aged a minimum of three months, but much of it is held for much longer, up to 10 years.\n\nCanadian Cheddar cheese soup is a featured dish at the Canada pavilion at Epcot, in Walt Disney World.\n\nNew Zealand\n\nMuch of the Cheddar cheese in New Zealand is factory produced. While most of it is sold young within the country, the Anchor dairy company ships New Zealand Cheddars to the UK, where the blocks mature for another year or so.\n\nUnited Kingdom\n\nOnly one producer of the cheese is now based in Cheddar itself, the Cheddar Gorge Cheese Co. The name \"cheddar\" is not protected by the European Union, though the name \"West Country Farmhouse Cheddar\" has an EU protected designation of origin, and may only be produced in Somerset, Devon, Dorset and Cornwall, using milk sourced from those counties. Cheddar is usually sold as mild, medium, mature, extra mature or vintage. Mature cheddar is the best-selling variety in the UK. Cheddar produced in Orkney is registered as an EU protected geographical indication under the name \"Orkney Scottish Island Cheddar\".\n\nUnited States\n\nThe state of Wisconsin produces the most Cheddar cheese in the US; other centres of production include: California, Idaho, upstate New York, Vermont, Oregon, Texas, and Oklahoma. It is sold in several varieties (mild, medium, sharp, extra-sharp, New York-style, white, and Vermont). New York-style Cheddar is particularly \"sharp\"/acidic, but tends to be somewhat softer than the milder-tasting varieties. Cheddar that does not contain annatto is frequently labelled \"white Cheddar\" or \"Vermont Cheddar\" (regardless of whether it was actually produced there). Vermont's three creameries produce what is regarded as first-class Cheddar cheeses: the Cabot Creamery, which produces the 16-month-old \"Private Stock Cheddar\", the Grafton Village Cheese Company, and Shelburne Farms.Ridgway, Judy. The Cheese Companion. Running Press, 2004, p. 77.\n\nSome processed cheeses or \"cheese foods\" are called \"Cheddar flavored\". Examples include Easy Cheese: a cheese-food packaged in a pressurised spray can; also, as packs of square, sliced,  individually wrapped, \"processed cheese\" (sometimes also pasteurised).\n\nCheddar is one of several products used by the United States Department of Agriculture to track the status of America's overall dairy industry; reports are issued weekly detailing prices and production quantities.\n\nRecord cheddars\n\nU.S. President Andrew Jackson once held an open house party at the White House at which he served a 1400 lb block of Cheddar cheese.\n\nA cheese of 7000 lb was produced in Ingersoll, Ontario, in 1866 and exhibited in New York and Britain; it was immortalised in the poem \"Ode on the Mammoth Cheese Weighing over 7,000 Pounds\"Wikisource:Ode on the Mammoth Cheese Weighing over 7,000 Pounds by James McIntyre, a Canadian poet.\n\nIn 1893, farmers from the town of Perth, Ontario, produced \"The Mammoth Cheese\", which weighed 22000 lb for the Chicago World's Fair. It was planned to be exhibited at the Canadian display, but the mammoth cheese fell through the floor and was placed on a reinforced concrete floor in the Agricultural Building. It received the most journalistic attention at the fair and was awarded the bronze medal. A larger, Wisconsin cheese of 34951 lb was made for the 1964 New York World's Fair. A cheese this size would use the equivalent of the daily milk production of 16,000 cows.\n\nOregon members of the Federation of American Cheese-makers created the largest Cheddar cheese in 1989. The cheese weighed 56850 lb.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cheddar cheese" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6936" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Cheddar cheese is a relatively hard, off-white (or orange if spices such as annatto are added), sometimes sharp-tasting (i.e., bitter), natural cheese. Originating in the English village of Cheddar in Somerset, cheeses of this style are produced beyond the region and in several countries around the world.\n\nCheddar is the most popular type of cheese in the UK, accounting for 51% of the country's £1.9 billion annual cheese market. It is the second-most popular cheese in the US (behind mozzarella), with an average annual consumption of 10 lb per capita. The US produced approximately 3000000000 lb in 2014, and the UK 258000 LT in 2008.\n\nThe term \"Cheddar cheese\" is widely used, but has no protected designation of origin within the European Union. However, in 2007 a Protected Designation of Origin, \"West Country Farmhouse Cheddar\", was created and only Cheddar produced from local milk within Somerset, Dorset, Devon and Cornwall and manufactured using traditional methods may use the name.[https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/271260/pfn-west-country-farmhouse-cheddar.pdf \"West Country Farmhouse Cheddar”], gov.uk.Brown, Steve; Blackmon, Kate; and Cousins, Paul. Operations management: policy, practice and performance improvement. Butterworth-Heinemann, 2001, pp. 265–266. Outside Europe, the style and quality of cheeses labelled as cheddar may vary greatly; furthermore, cheeses that are more similar in taste and appearance to Red Leicester are sometimes popularly marketed as \"Red Cheddar\".\n\nHistory\n\nThe cheese originates from the village of Cheddar in Somerset, south west England. Cheddar Gorge on the edge of the village contains a number of caves, which provided the ideal humidity and steady temperature for maturing the cheese. Cheddar cheese traditionally had to be made within 30 mi of Wells Cathedral.\n\nCheddar has been produced since at least the 12th century. A pipe roll of King Henry II from 1170 records the purchase of 10240 lb at a farthing per pound (totalling £10.13s.4d).\nCharles I (1600–1649) also bought cheese from the village.\nRomans may have brought the recipe to Britain from the Cantal region of France.\n\nCentral to the modernisation and standardisation of Cheddar cheese was the 19th-century Somerset dairyman Joseph Harding.\nFor his technical innovations, promotion of dairy hygiene, and volunteer dissemination of modern cheese-making techniques, he has been dubbed \"the father of Cheddar cheese\".\nHarding introduced new equipment to the process of cheese-making, including his \"revolving breaker\" for curd cutting, saving much manual effort.Transactions of the Highland and Agricultural Society of Scotland, Highland and Agricultural Society of Scotland, 1866-7 volume 1, AberdeenChristabel Susan Lowry Orwin, Edith Holt Whetham, \"History of British Agriculture, 1846–1914\", Agriculture (1964), page 145\nThe \"Joseph Harding method\" was the first modern system for Cheddar production based upon scientific principles. Harding stated that Cheddar cheese is \"not made in the field, nor in the byre, nor even in the cow, it is made in the dairy\". His wife and he were behind the introduction of the cheese into Scotland and North America. His sons, Henry and William Harding, were responsible for introducing Cheddar cheese production to Australia and facilitating the establishment of the cheese industry in New Zealand, respectively.\n\nDuring the Second World War, and for nearly a decade after, most milk in Britain was used for the making of one single kind of cheese nicknamed \"government Cheddar\" as part of war economies and rationing. This almost resulted in wiping out all other cheese production in the country. Before the First World War, more than 3,500 cheese producers were in Britain; fewer than 100 remained after the Second World War.\n\nAccording to a United States Department of Agriculture researcher, Cheddar cheese is the world's most popular variety of cheese, and the most studied type of cheese in scientific publications.\n\nProcess\n\nThe curds and whey are separated using rennet, an enzyme complex normally produced from the stomachs of newborn calves (in vegetarian or kosher cheeses, bacterial, yeast or mould-derived chymosin is used).\n\n\"Cheddaring\" refers to an additional step in the production of Cheddar cheese where, after heating, the curd is kneaded with salt, cut into cubes to drain the whey, and then stacked and turned. Strong, extra-mature Cheddar, sometimes called vintage, needs to be matured for up to 15 months. The cheese is kept at a constant temperature, often requiring special facilities. As with other hard cheese varieties produced worldwide, caves provide an ideal environment for maturing cheese; still, today, some Cheddar cheese is matured in the caves at Wookey Hole and Cheddar Gorge. Additionally, some versions of Cheddar cheese are smoked.Kelly Jaggers, [https://books.google.com/books?id\n2xUCxt9ucKQC&pg=PA104 Moufflet: More Than 100 Gourmet Muffin Recipes That Rise to Any Occasion],  p. 104.\n\nCharacter\n\nThe ideal quality of the original Somerset Cheddar was described by Joseph Harding in 1864 as \"close and firm in texture, yet mellow in character or quality; it is rich with a tendency to melt in the mouth, the flavour full and fine, approaching to that of a hazelnut\".Transactions of the New-York State Agricultural Society for the Year 1864, page 232, volume 14 1865, Albany\n\nCheddar made in the classical way tends to have a sharp, pungent flavour, often slightly earthy. The \"sharpness\" of cheddar is associated with the levels of bitter peptides in the cheese. This bitterness has been found to be significant to the overall perception of the aged Cheddar flavour. The texture is firm, with farmhouse traditional Cheddar being slightly crumbly; it should also, if mature, contain large cheese crystals consisting of calcium lactate – often precipitated when matured for times longer than six months.\n\nCheddar can be a deep to pale yellow (off-white) colour, or a yellow-orange colour when certain plant extracts are added. One commonly used spice is annatto, extracted from seeds of the tropical achiote tree. Originally added to simulate the colour of high-quality milk from grass-fed Jersey and Guernsey cows, annatto may also impart a sweet, nutty flavour. The largest producer of Cheddar cheese in the United States, Kraft, uses a combination of annatto and oleoresin paprika, an extract of the lipophilic (oily) portion of paprika.\n\nCheddar cheese was sometimes (and still can be found) packaged in black wax, but was more commonly packaged in larded cloth, which was impermeable to contaminants, but still allowed the cheese to \"breathe\".\n\nThe Slow Food Movement has created a Cheddar Presidium, claiming that only three cheeses should be called \"original Cheddar\". Their specifications, which go further than the \"West Country Farmhouse Cheddar\" PDO, require that Cheddar cheese be made in Somerset and with traditional methods, such as using raw milk, traditional animal rennet, and a cloth wrapping.\n\nInternational production\n\nThe Cheddar cheese name is used internationally; its name does not have a PDO, but the use of the name \"West Country Farmhouse Cheddar\" does. As well as the United Kingdom, countries making Cheddar cheese include Australia, Argentina, Belgium, Canada, Ireland, the Netherlands, New Zealand, South Africa, Sweden, Finland and the United States. Cheddars can be industrial or artisan cheeses. The flavour, colour, and quality of industrial cheese varies significantly, and food packaging will usually indicate a strength, such as mild, medium, strong, tasty, sharp, extra sharp, mature, old, or vintage; this may indicate the maturation period, or food additives used to enhance the flavour. Artisan varieties develop strong and diverse flavours over time.\n\nAustralia\n\nAs of 2013, Cheddar accounts for over 55% of the Australian cheese market, with average annual consumption around  per person.[http://www.dairyaustralia.com.au/~/media/Documents/Stats%20and%20markets/In%20Focus/Australian%20Dairy%20Industry%20In%20Focus%202013.pdf \"Australian Dairy Industry\"]. dairyaustralia.com. Cheddar is so commonly found that the name is rarely used: instead, Cheddar is sold by strength alone as e.g. \"mild\", \"tasty\" or \"sharp\".\n\nCanada\n\nFollowing a wheat midge outbreak in Canada in the mid-19th century, farmers in Ontario began to convert to dairy farming in large numbers, and Cheddar cheese became their main exportable product, even being exported to England. By the turn of the 20th century, 1,242 Cheddar factories were in Ontario, and Cheddar had become Canada’s second-largest export after timber. Cheddar exports totalled 234000000 lbs in 1904, but by 2012, Canada was a net importer of cheese. James L. Kraft grew up on a dairy farm in Ontario, before moving to Chicago. According to the writer Sarah Champman, \"Although we cannot wholly lay the decline of cheese craft in Canada at the feet of James Lewis Kraft, it did correspond with the rise of Kraft’s processed cheese empire.\" Most Canadian Cheddar is produced by a number of large companies in Ontario, though other provinces produce some and some smaller artisanal producers exist. The annual production is 120,000 tons. It is aged a minimum of three months, but much of it is held for much longer, up to 10 years.\n\nCanadian Cheddar cheese soup is a featured dish at the Canada pavilion at Epcot, in Walt Disney World.\n\nNew Zealand\n\nMuch of the Cheddar cheese in New Zealand is factory produced. While most of it is sold young within the country, the Anchor dairy company ships New Zealand Cheddars to the UK, where the blocks mature for another year or so.\n\nUnited Kingdom\n\nOnly one producer of the cheese is now based in Cheddar itself, the Cheddar Gorge Cheese Co. The name \"cheddar\" is not protected by the European Union, though the name \"West Country Farmhouse Cheddar\" has an EU protected designation of origin, and may only be produced in Somerset, Devon, Dorset and Cornwall, using milk sourced from those counties. Cheddar is usually sold as mild, medium, mature, extra mature or vintage. Mature cheddar is the best-selling variety in the UK. Cheddar produced in Orkney is registered as an EU protected geographical indication under the name \"Orkney Scottish Island Cheddar\".\n\nUnited States\n\nThe state of Wisconsin produces the most Cheddar cheese in the US; other centres of production include: California, Idaho, upstate New York, Vermont, Oregon, Texas, and Oklahoma. It is sold in several varieties (mild, medium, sharp, extra-sharp, New York-style, white, and Vermont). New York-style Cheddar is particularly \"sharp\"/acidic, but tends to be somewhat softer than the milder-tasting varieties. Cheddar that does not contain annatto is frequently labelled \"white Cheddar\" or \"Vermont Cheddar\" (regardless of whether it was actually produced there). Vermont's three creameries produce what is regarded as first-class Cheddar cheeses: the Cabot Creamery, which produces the 16-month-old \"Private Stock Cheddar\", the Grafton Village Cheese Company, and Shelburne Farms.Ridgway, Judy. The Cheese Companion. Running Press, 2004, p. 77.\n\nSome processed cheeses or \"cheese foods\" are called \"Cheddar flavored\". Examples include Easy Cheese: a cheese-food packaged in a pressurised spray can; also, as packs of square, sliced,  individually wrapped, \"processed cheese\" (sometimes also pasteurised).\n\nCheddar is one of several products used by the United States Department of Agriculture to track the status of America's overall dairy industry; reports are issued weekly detailing prices and production quantities.\n\nRecord cheddars\n\nU.S. President Andrew Jackson once held an open house party at the White House at which he served a 1400 lb block of Cheddar cheese.\n\nA cheese of 7000 lb was produced in Ingersoll, Ontario, in 1866 and exhibited in New York and Britain; it was immortalised in the poem \"Ode on the Mammoth Cheese Weighing over 7,000 Pounds\"Wikisource:Ode on the Mammoth Cheese Weighing over 7,000 Pounds by James McIntyre, a Canadian poet.\n\nIn 1893, farmers from the town of Perth, Ontario, produced \"The Mammoth Cheese\", which weighed 22000 lb for the Chicago World's Fair. It was planned to be exhibited at the Canadian display, but the mammoth cheese fell through the floor and was placed on a reinforced concrete floor in the Agricultural Building. It received the most journalistic attention at the fair and was awarded the bronze medal. A larger, Wisconsin cheese of 34951 lb was made for the 1964 New York World's Fair. A cheese this size would use the equivalent of the daily milk production of 16,000 cows.\n\nOregon members of the Federation of American Cheese-makers created the largest Cheddar cheese in 1989. The cheese weighed 56850 lb. Cheddar cheese. http://en.wikipedia.org/?curid=6936."
  }
}
