{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6896",
  "eid" : "deb234b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778453371,
  "textBody" : "The following outline is provided as an overview of and topical guide to chemistry:\n\nChemistry – science of atomic matter (matter that is composed of chemical elements), especially its chemical reactions, but also including its properties, structure, composition, behavior, and changes as they relate the chemical reactions.[http://dictionary.reference.com/browse/Chemistry Chemistry]. (n.d.). Merriam-Webster's Medical Dictionary. Retrieved August 19, 2007. Chemistry is centrally concerned with atoms and their interactions with other atoms, and particularly with the properties of chemical bonds.\n\nSummary of chemistry \n\nChemistry can be described as all of the following:\n* An academic discipline  – one with academic departments, curricula and degrees; national and international societies; and specialized journals.\n* A scientific field (a branch of science) – widely recognized category of specialized expertise within science, and typically embodies its own terminology and nomenclature. Such a field will usually be represented by one or more scientific journals, where peer reviewed research is published. There are several geophysics-related scientific journals.\n** A natural science – one that seeks to elucidate the rules that govern the natural world using empirical and scientific method.\n*** A physical science – one that studies non-living systems.\n*** A biological science – one that studies the role of chemicals and chemical processes in living organisms. See Outline of biochemistry.\n\nBranches of chemistry\n\n* Physical chemistry – study of the physical and fundamental basis of chemical systems and processes. In particular, the energetics and dynamics of such systems and processes are of interest to physical chemists. Important areas of study include chemical thermodynamics, chemical kinetics, electrochemistry, statistical mechanics, spectroscopy, and more recently, astrochemistry. Physical chemistry has large overlap with molecular physics. Physical chemistry involves the use of infinitesimal calculus in deriving equations. It is usually associated with quantum chemistry and theoretical chemistry. Physical chemistry is a distinct discipline from chemical physics, but again, there is very strong overlap.\n** Chemical kinetics – study of rates of chemical processes.\n** Chemical physics – investigates physicochemical phenomena using techniques from atomic and molecular physics and condensed matter physics; it is the branch of physics that studies chemical processes. \n** Electrochemistry – branch of chemistry that studies chemical reactions which take place in a solution at the interface of an electron conductor (the electrode: a metal or a semiconductor) and an ionic conductor (the electrolyte), and which involve electron transfer between the electrode and the electrolyte or species in solution.\n** Femtochemistry – area of physical chemistry that studies chemical reactions on extremely short timescales, approximately 10−15 seconds (one femtosecond).\n** Geochemistry – chemical study of the mechanisms behind major systems studied in geology.\n** Photochemistry – study of chemical reactions that proceed with the absorption of light by atoms or molecules.\n** Quantum chemistry – branch of chemistry whose primary focus is the application of quantum mechanics in physical models and experiments of chemical systems.\n** Solid-state chemistry – study of the synthesis, structure, and properties of solid phase materials, particularly, but not necessarily exclusively of, non-molecular solids. \n** Spectroscopy – study of the interaction between matter and radiated energy.\n** Stereochemistry – study of the relative spatial arrangement of atoms that form the structure of molecules\n** Surface science – study of physical and chemical phenomena that occur at the interface of two phases, including solid–liquid interfaces, solid–gas interfaces, solid–vacuum interfaces, and liquid-gas interfaces.\n** Thermochemistry –The branch of chemistry that studies the relation between chemical action and the amount of heat absorbed or generated.\n*** Calorimetry – The study of heat changes in physical and chemical processes.\n* Organic chemistry – study of the structure, properties, composition, mechanisms, and reactions of organic compounds. An organic compound is defined as any compound based on a carbon skeleton.\n** Biochemistry – study of the chemicals, chemical reactions and chemical interactions that take place in living organisms. Biochemistry and organic chemistry are closely related, as in medicinal chemistry or neurochemistry. Biochemistry is also associated with molecular biology and genetics.\n*** Neurochemistry – study of neurochemicals; including transmitters, peptides, proteins, lipids, sugars, and nucleic acids; their interactions, and the roles they play in forming, maintaining, and modifying the nervous system.\n** Bioorganic chemistry – combines organic chemistry and biochemistry toward biology.\n** Biophysical chemistry –  is a physical science that uses the concepts of physics and physical chemistry for the study of biological systems.\n** Medicinal chemistry – discipline which applies chemistry for medical or drug related purposes.\n** Organometallic chemistry\n** Pharmacy\n** Physical organic chemistry – study of the interrelationships between structure and reactivity in organic molecules.\n** Polymer chemistry – multidisciplinary science that deals with the chemical synthesis and chemical properties of polymers or macromolecules.\n** Click chemistry\n* Inorganic chemistry – study of the properties and reactions of inorganic compounds. The distinction between organic and inorganic disciplines is not absolute and there is much overlap, most importantly in the sub-discipline of organometallic chemistry.\n** Bioinorganic chemistry\n** Cluster chemistry\n** Materials chemistry – preparation, characterization, and understanding of substances with a useful function. The field is a new breadth of study in graduate programs, and it integrates elements from all classical areas of chemistry with a focus on fundamental issues that are unique to materials. Primary systems of study include the chemistry of condensed phases (solids, liquids, polymers) and interfaces between different phases.\n* Nuclear chemistry – study of how subatomic particles come together and make nuclei. Modern Transmutation is a large component of nuclear chemistry, and the table of nuclides is an important result and tool for this field.\n* Analytical chemistry – analysis of material samples to gain an understanding of their chemical composition and structure. Analytical chemistry incorporates standardized experimental methods in chemistry. These methods may be used in all subdisciplines of chemistry, excluding purely theoretical chemistry.\n** Astrochemistry – study of the abundance and reactions of chemical elements and molecules in the universe, and their interaction with radiation.\n*** Cosmochemistry – study of the chemical composition of matter in the universe and the processes that led to those compositions.\n** Computational chemistry\n** Environmental chemistry – study of chemical and biochemical phenomena that occur diverse aspects of the environment such the air, soil, and water. It also studies the effects of human activity on the environment.\n** Green chemistry is a philosophy of chemical research and engineering that encourages the design of products and processes that minimize the use and generation of hazardous substances.\n** Supramolecular chemistry – refers to the domain of chemistry beyond that of molecules and focuses on the chemical systems made up of a discrete number of assembled molecular subunits or components.\n** Theoretical chemistry – study of chemistry via fundamental theoretical reasoning (usually within mathematics or physics). In particular the application of quantum mechanics to chemistry is called quantum chemistry. Since the end of the Second World War, the development of computers has allowed a systematic development of computational chemistry, which is the art of developing and applying computer programs for solving chemical problems. Theoretical chemistry has large overlap with (theoretical and experimental) condensed matter physics and molecular physics.\n** Wet chemistry\n*Other\n** Agrochemistry – study and application of both chemistry and biochemistry for agricultural production, the processing of raw products into foods and beverages, and environmental monitoring and remediation.\n** Atmospheric chemistry – branch of atmospheric science which studies the chemistry of the Earth's atmosphere and that of other planets.\n** Chemical engineering – branch of engineering that applies the physical sciences (e.g., chemistry and physics) and/or life sciences (e.g., biology, microbiology and biochemistry) together with mathematics and economics to processes that convert raw materials or chemicals into more useful or valuable forms.\n** Chemical biology – scientific discipline spanning the fields of chemistry and biology and involves the application of chemical techniques and tools, often compounds produced through synthetic chemistry, to analyze and manipulation of biological systems. \n** Chemo-informatics – use of computer and informational techniques applied to a range of problems in the field of chemistry. \n** Flow chemistry – study of chemical reactions in continuous flow, not as stationary batches, in industry and macroprocessing equipment. \n** Immunohistochemistry – involves the process of detecting antigens (e.g., proteins) in cells of a tissue section by exploiting the principle of antibodies binding specifically to antigens in biological tissues.\n** Immunochemistry – is a branch of chemistry that involves the study of the reactions and components on the immune system.\n** Chemical oceanography – study of ocean chemistry: the behavior of the chemical elements within the Earth's oceans\n** Materials science – is an interdisciplinary field investigating the relationship between the structure of materials at atomic or molecular scales and their macroscopic properties. \n** Mathematical chemistry – area of study engaged in novel applications of mathematics to chemistry. It concerns itself principally with the mathematical modeling of chemical phenomena.\n** Mechanochemistry – coupling of mechanical and chemical phenomena on a molecular scale and can be seen as a coupling of chemistry and mechanical engineering. \n** Molecular biology – study of interactions between the various systems of a cell. It overlaps with biochemistry. \n** Molecular mechanics – applies classical mechanics to model molecular systems.\n** Nanotechnology – study and application of matter that is at an atomic and molecular scale. This broad field interacts with chemistry at such scales. \n** Oenology – study of all aspects of wine and winemaking.\n** Organometallic chemistry – study of chemical compounds containing bonds between carbon and a metal.\n** Petrochemistry – study of the transformation of petroleum and natural gas into useful products or raw materials.\n** Pharmacology – branch of medicine and biology concerned with the study of drug action along with the chemical effects.\n** Phytochemistry – study of phytochemicals which come from plants.\n** Radiochemistry – chemistry of radioactive materials.\n** Sonochemistry – study of effect of sonic waves and wave properties on chemical systems.\n** Synthetic chemistry – study of chemical synthesis.\n\nHistory of chemistry \n\nHistory of chemistry\n* Precursors to chemistry\n** Alchemy\n*** History of alchemy\n* History of the branches of chemistry\n** History of analytical chemistry – history of the study of the separation, identification, and quantification of the chemical components of natural and artificial materials.\n** History of astrochemistry – history of the study of the abundance and reactions of chemical elements and molecules in the universe, and their interaction with radiation.\n*** History of cosmochemistry – history of the study of the chemical composition of matter in the universe and the processes that led to those compositions\n** History of atmospheric chemistry – history of the branch of atmospheric science in which the chemistry of the Earth's atmosphere and that of other planets is studied. It is a multidisciplinary field of research and draws on environmental chemistry, physics, meteorology, computer modeling, oceanography, geology and volcanology and other disciplines\n**History of biochemistry – history of the study of chemical processes in living organisms, including, but not limited to, living matter. Biochemistry governs all living organisms and living processes.\n*** History of agrochemistry – history of the study of both chemistry and biochemistry which are important in agricultural production, the processing of raw products into foods and beverages, and in environmental monitoring and remediation.\n*** History of bioinorganic chemistry – history of the examines the role of metals in biology.\n*** History of bioorganic chemistry – history of the rapidly growing scientific discipline that combines organic chemistry and biochemistry.\n*** History of biophysical chemistry – history of the  new branch of chemistry that covers a broad spectrum of research activities involving biological systems.\n*** History of environmental chemistry – history of the scientific study of the chemical and biochemical phenomena that occur in natural places.\n*** History of immunochemistry – history of the branch of chemistry that involves the study of the reactions and components on the immune system.\n*** History of medicinal chemistry – history of the discipline at the intersection of chemistry, especially synthetic organic chemistry, and pharmacology and various other biological specialties, where they are involved with design, chemical synthesis and development for market of pharmaceutical agents (drugs).\n*** History of pharmacology – history of the branch of medicine and biology concerned with the study of drug action.\n*** History of natural product chemistry – history of the chemical compound or substance produced by a living organism – history of the found in nature that usually has a pharmacological or biological activity for use in pharmaceutical drug discovery and drug design.\n*** History of neurochemistry – history of the specific study of neurochemicals, which include neurotransmitters and other molecules such as neuro-active drugs that influence neuron function.\n** History of computational chemistry – history of the branch of chemistry that uses principles of computer science to assist in solving chemical problems.\n*** History of chemo-informatics – history of the use of computer and informational techniques, applied to a range of problems in the field of chemistry.\n*** History of molecular mechanics – history of the uses Newtonian mechanics to model molecular systems.\n** History of Flavor chemistry – history of the someone who uses chemistry to engineer artificial and natural flavors.\n** History of Flow chemistry – history of the chemical reaction is run in a continuously flowing stream rather than in batch production.\n** History of geochemistry – history of the study of the mechanisms behind major geological systems using chemistry\n*** History of aqueous geochemistry – history of the study of the role of various elements in watersheds, including copper, sulfur, mercury, and how elemental fluxes are exchanged through atmospheric-terrestrial-aquatic interactions\n*** History of isotope geochemistry – history of the study of the relative and absolute concentrations of the elements and their isotopes using chemistry and geology\n*** History of ocean chemistry – history of the studies the chemistry of marine environments including the influences of different variables.\n*** History of organic geochemistry – history of the study of the impacts and processes that organisms have had on Earth\n*** History of regional, environmental and exploration geochemistry – history of the study of the spatial variation in the chemical composition of materials at the surface of the Earth\n** History of inorganic chemistry – history of the branch of chemistry concerned with the properties and behavior of inorganic compounds.\n** History of nuclear chemistry – history of the subfield of chemistry dealing with radioactivity, nuclear processes and nuclear properties.\n*** History of radiochemistry – history of the chemistry of radioactive materials, where radioactive isotopes of elements are used to study the properties and chemical reactions of non-radioactive isotopes (often within radiochemistry the absence of radioactivity leads to a substance being described as being inactive as the isotopes are stable).\n**History of organic chemistry – history of the study of the structure, properties, composition, reactions, and preparation (by synthesis or by other means) of carbon-based compounds, hydrocarbons, and their derivatives.\n*** History of petrochemistry – history of the branch of chemistry that studies the transformation of crude oil (petroleum) and natural gas into useful products or raw materials.\n** History of organometallic chemistry – history of the study of chemical compounds containing bonds between carbon and a metal.\n** History of photochemistry – history of the study of chemical reactions that proceed with the absorption of light by atoms or molecules..\n** History of physical chemistry – history of the study of macroscopic, atomic, subatomic, and particulate phenomena in chemical systems in terms of physical laws and concepts.\n*** History of chemical kinetics – history of the study of rates of chemical processes.\n*** History of chemical thermodynamics – history of the study of the interrelation of heat and work with chemical reactions or with physical changes of state within the confines of the laws of thermodynamics.\n*** History of electrochemistry – history of the branch of chemistry that studies chemical reactions which take place in a solution at the interface of an electron conductor (a metal or a semiconductor) and an ionic conductor (the electrolyte), and which involve electron transfer between the electrode and the electrolyte or species in solution.\n*** History of Femtochemistry – history of the Femtochemistry is the science that studies chemical reactions on extremely short timescales, approximately 10−15 seconds (one femtosecond, hence the name).\n*** History of mathematical chemistry – history of the area of research engaged in novel applications of mathematics to chemistry; it concerns itself principally with the mathematical modeling of chemical phenomena.\n*** History of mechanochemistry – history of the coupling of the mechanical and the chemical phenomena on a molecular scale and includes mechanical breakage, chemical behaviour of mechanically stressed solids (e.g., stress-corrosion cracking), tribology, polymer degradation under shear, cavitation-related phenomena (e.g., sonochemistry and sonoluminescence), shock wave chemistry and physics, and even the burgeoning field of molecular machines.\n*** History of physical organic chemistry – history of the study of the interrelationships between structure and reactivity in organic molecules.\n*** History of quantum chemistry – history of the branch of chemistry whose primary focus is the application of quantum mechanics in physical models and experiments of chemical systems.\n*** History of sonochemistry – history of the study of the effect of sonic waves and wave properties on chemical systems.\n*** History of stereochemistry – history of the study of the relative spatial arrangement of atoms within molecules.\n*** History of supramolecular chemistry – history of the area of chemistry beyond the molecules and focuses on the chemical systems made up of a discrete number of assembled molecular subunits or components.\n*** History of thermochemistry – history of the study of the energy and heat associated with chemical reactions and/or physical transformations.\n** History of phytochemistry – history of the strict sense of the word the study of phytochemicals.\n** History of polymer chemistry – history of the multidisciplinary science that deals with the chemical synthesis and chemical properties of polymers or macromolecules.\n** History of solid-state chemistry – history of the study of the synthesis, structure, and properties of solid phase materials, particularly, but not necessarily exclusively of, non-molecular solids\n** History of multidisciplinary fields involving chemistry:\n*** History of chemical biology – history of the scientific discipline spanning the fields of chemistry and biology that involves the application of chemical techniques and tools, often compounds produced through synthetic chemistry, to the study and manipulation of biological systems.\n*** History of chemical engineering – history of the branch of engineering that deals with physical science (e.g., chemistry and physics), and life sciences (e.g., biology, microbiology and biochemistry) with mathematics and economics, to the process of converting raw materials or chemicals into more useful or valuable forms.\n*** History of chemical oceanography – history of the study of the behavior of the chemical elements within the Earth's oceans.\n*** History of chemical physics – history of the branch of physics that studies chemical processes from the point of view of physics.\n*** History of materials science – history of the interdisciplinary field applying the properties of matter to various areas of science and engineering.\n*** History of nanotechnology – history of the study of manipulating matter on an atomic and molecular scale\n*** History of oenology – history of the science and study of all aspects of wine and winemaking except vine-growing and grape-harvesting, which is a subfield called viticulture.\n*** History of spectroscopy – history of the study of the interaction between matter and radiated energy\n*** History of surface science – history of the Surface science is the study of physical and chemical phenomena that occur at the interface of two phases, including solid–liquid interfaces, solid–gas interfaces, solid–vacuum interfaces, and liquid–gas interfaces.\n* History of chemicals\n** History of chemical elements\n*** History of carbon\n*** History of hydrogen\n**** Timeline of hydrogen technologies\n*** History of oxygen\n** History of chemical products\n*** History of aspirin\n*** History of cosmetics\n*** History of gunpowder\n*** History of pharmaceutical drugs\n*** History of vitamins\n* History of chemical processes\n** History of manufactured gas\n*** History of the Haber process\n* History of the chemical industry\n** History of the petroleum industry\n** History of the pharmaceutical industry\n* History of the periodic table\n\nChemicals \n\n* Dictionary of chemical formulas\n* List of biomolecules\n* List of inorganic compounds\n* Periodic table\n\nAtomic Theory \n\nAtomic theory\nThe Atomic Model Timeline\n* The idea of what an atom is has changed over time.\n* Different scientists and their discoveries have led to the development of the current model of an atom.\n* Other examples include:\n** The solar system (BIG made SMALL)\n** The biological cell (SMALL made BIG)\n\nThe Democritus Model\n* A Greek philosopher\n* He conceived the idea of the atom to describe matter.\n* Atom comes from the word atomos which means \"indivisible\".\n* He believed that matter was finite (had a limit)\n* He believed the smallest piece of matter was an indestructible and indivisible particle which he called the \"atom\".\n\nThe John Dalton Model\n\nJ. J. Thomson: The Plum Pudding Model\n\nThermochemistry \n\nThermochemistry\n\nTerminology \n\n* Thermochemistry –\n* Chemical kinetics –  is the study of the rates of chemical reactions and investigates how different experimental conditions can influence the speed of a chemical reaction and yield information about the reaction's mechanism and transition states, as well as the construction of mathematical models that can describe the characteristics of a chemical reaction.\n* Exothermic –a process or reaction in which the system release energy to its surroundings in the form of heat.They are denoted by negative heat flow.\n* Endothermic –a process or reaction in which the system absorbs energy from its surroundings in the form of heat. They are denoted by positive heat flow.\n* Thermochemical equation –\n* Enthalpy change –\n* Enthalpy of reaction –\n* Temperature – is an objective comparative measure of heat.\n* Calorimeter –\n* Heat –\n* Joule –\n* Calorie –\n* Specific heat –\n* Specific heat capacity –\n* Latent heat –\n* Heat of fusion –\n* Heat of vaporization –\n* Collision theory –\n* Activation energy –\n* Activated complex –\n* Reaction rate –\n* Catalyst –\n\nThermochemical Equations \n\n* Chemical equations that include the heat involved in a reaction, either on the reactant side or the product side.\n* Examples:\n** H2O(l) + 240kJ → H2O(g)\n** N2 + 3H2 → 2NH3 + 92kJ\n* Joule (J) –\n\nEnthalpy \n\nHow to calculate  the enthalpy of N₂+3H₂ =2NH₃?\n\nEnthalpy and Thermochemical Equations \n\nEndothermic Reactions \n\nExothermic Reactions \n\nPotential Energy Diagrams \n\nThermochemistry Stoichiometry \n\nChemists\n\nFor more chemists, see: Nobel Prize in Chemistry and List of chemists\n* Marie Curie\n* John Dalton\n* Humphry Davy\n* Eleuthère Irénée du Pont\n* George Eastman\n* Michael Faraday\n* Dmitriy Mendeleyev\n* Alfred Nobel\n* Wilhelm Ostwald\n* Louis Pasteur\n* Linus Pauling\n* Joseph Priestley\n* Karl Ziegler\n* Ahmed Zewail\n\nChemistry literature \n\n* Scientific literature –\n* Scientific journal –\n* Academic journal –\n* List of important publications in chemistry\n* List of scientific journals in chemistry\n\n;List of science magazines\n* Scientific American\n\nLists \n\n;Chemical elements data references\n* List of chemical elements — atomic mass, atomic number, symbol, name\n* Electron configurations of the elements (data page) — electron configuration, electrons per shell\n* Densities of the elements (data page) — density (solid, liquid, gas)\n* Electron affinity (data page) — electron affinity\n* Melting points of the elements (data page) — melting point\n* Boiling points of the elements (data page) — boiling point\n* Critical points of the elements (data page) — critical point\n* Heats of fusion of the elements (data page) — heat of fusion\n* Heats of vaporization of the elements (data page) — heat of vaporization\n* Heat capacities of the elements (data page) — heat capacity\n* Vapor pressures of the elements (data page) — vapor pressure\n* Electronegativities of the elements (data page) — electronegativity (Pauling scale)\n* Ionization energies of the elements (data page) — ionization energies (in eV) and molar ionization energies (in kJ/mol)\n* Atomic radii of the elements (data page) — atomic radius (empirical), atomic radius (calculated), van der Waals radius, covalent radius\n* Electrical resistivities of the elements (data page) — electrical resistivity\n* Thermal conductivities of the elements (data page) — thermal conductivity\n* Thermal expansion coefficients of the elements (data page) — thermal expansion\n* Speeds of sound of the elements (data page) — speed of sound\n* Elastic properties of the elements (data page) — Young's modulus, Poisson ratio, bulk modulus, shear modulus\n* Hardnesses of the elements (data page) — Mohs hardness, Vickers hardness, Brinell hardness\n* Abundances of the elements (data page) — Earth's crust, sea water, Sun and solar system\n* List of oxidation states of the elements — oxidation states\n\n;List of compounds\n* List of CAS numbers by chemical compound\n* List of Extremely Hazardous Substances\n* List of inorganic compounds\n* List of organic compounds\n* List of alkanes\n* List of alloys\n\n;Other\n* List of thermal conductivities\n* List of purification methods in chemistry\n* List of unsolved problems in chemistry",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Outline of chemistry" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6896" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The following outline is provided as an overview of and topical guide to chemistry:\n\nChemistry – science of atomic matter (matter that is composed of chemical elements), especially its chemical reactions, but also including its properties, structure, composition, behavior, and changes as they relate the chemical reactions.[http://dictionary.reference.com/browse/Chemistry Chemistry]. (n.d.). Merriam-Webster's Medical Dictionary. Retrieved August 19, 2007. Chemistry is centrally concerned with atoms and their interactions with other atoms, and particularly with the properties of chemical bonds.\n\nSummary of chemistry \n\nChemistry can be described as all of the following:\n* An academic discipline  – one with academic departments, curricula and degrees; national and international societies; and specialized journals.\n* A scientific field (a branch of science) – widely recognized category of specialized expertise within science, and typically embodies its own terminology and nomenclature. Such a field will usually be represented by one or more scientific journals, where peer reviewed research is published. There are several geophysics-related scientific journals.\n** A natural science – one that seeks to elucidate the rules that govern the natural world using empirical and scientific method.\n*** A physical science – one that studies non-living systems.\n*** A biological science – one that studies the role of chemicals and chemical processes in living organisms. See Outline of biochemistry.\n\nBranches of chemistry\n\n* Physical chemistry – study of the physical and fundamental basis of chemical systems and processes. In particular, the energetics and dynamics of such systems and processes are of interest to physical chemists. Important areas of study include chemical thermodynamics, chemical kinetics, electrochemistry, statistical mechanics, spectroscopy, and more recently, astrochemistry. Physical chemistry has large overlap with molecular physics. Physical chemistry involves the use of infinitesimal calculus in deriving equations. It is usually associated with quantum chemistry and theoretical chemistry. Physical chemistry is a distinct discipline from chemical physics, but again, there is very strong overlap.\n** Chemical kinetics – study of rates of chemical processes.\n** Chemical physics – investigates physicochemical phenomena using techniques from atomic and molecular physics and condensed matter physics; it is the branch of physics that studies chemical processes. \n** Electrochemistry – branch of chemistry that studies chemical reactions which take place in a solution at the interface of an electron conductor (the electrode: a metal or a semiconductor) and an ionic conductor (the electrolyte), and which involve electron transfer between the electrode and the electrolyte or species in solution.\n** Femtochemistry – area of physical chemistry that studies chemical reactions on extremely short timescales, approximately 10−15 seconds (one femtosecond).\n** Geochemistry – chemical study of the mechanisms behind major systems studied in geology.\n** Photochemistry – study of chemical reactions that proceed with the absorption of light by atoms or molecules.\n** Quantum chemistry – branch of chemistry whose primary focus is the application of quantum mechanics in physical models and experiments of chemical systems.\n** Solid-state chemistry – study of the synthesis, structure, and properties of solid phase materials, particularly, but not necessarily exclusively of, non-molecular solids. \n** Spectroscopy – study of the interaction between matter and radiated energy.\n** Stereochemistry – study of the relative spatial arrangement of atoms that form the structure of molecules\n** Surface science – study of physical and chemical phenomena that occur at the interface of two phases, including solid–liquid interfaces, solid–gas interfaces, solid–vacuum interfaces, and liquid-gas interfaces.\n** Thermochemistry –The branch of chemistry that studies the relation between chemical action and the amount of heat absorbed or generated.\n*** Calorimetry – The study of heat changes in physical and chemical processes.\n* Organic chemistry – study of the structure, properties, composition, mechanisms, and reactions of organic compounds. An organic compound is defined as any compound based on a carbon skeleton.\n** Biochemistry – study of the chemicals, chemical reactions and chemical interactions that take place in living organisms. Biochemistry and organic chemistry are closely related, as in medicinal chemistry or neurochemistry. Biochemistry is also associated with molecular biology and genetics.\n*** Neurochemistry – study of neurochemicals; including transmitters, peptides, proteins, lipids, sugars, and nucleic acids; their interactions, and the roles they play in forming, maintaining, and modifying the nervous system.\n** Bioorganic chemistry – combines organic chemistry and biochemistry toward biology.\n** Biophysical chemistry –  is a physical science that uses the concepts of physics and physical chemistry for the study of biological systems.\n** Medicinal chemistry – discipline which applies chemistry for medical or drug related purposes.\n** Organometallic chemistry\n** Pharmacy\n** Physical organic chemistry – study of the interrelationships between structure and reactivity in organic molecules.\n** Polymer chemistry – multidisciplinary science that deals with the chemical synthesis and chemical properties of polymers or macromolecules.\n** Click chemistry\n* Inorganic chemistry – study of the properties and reactions of inorganic compounds. The distinction between organic and inorganic disciplines is not absolute and there is much overlap, most importantly in the sub-discipline of organometallic chemistry.\n** Bioinorganic chemistry\n** Cluster chemistry\n** Materials chemistry – preparation, characterization, and understanding of substances with a useful function. The field is a new breadth of study in graduate programs, and it integrates elements from all classical areas of chemistry with a focus on fundamental issues that are unique to materials. Primary systems of study include the chemistry of condensed phases (solids, liquids, polymers) and interfaces between different phases.\n* Nuclear chemistry – study of how subatomic particles come together and make nuclei. Modern Transmutation is a large component of nuclear chemistry, and the table of nuclides is an important result and tool for this field.\n* Analytical chemistry – analysis of material samples to gain an understanding of their chemical composition and structure. Analytical chemistry incorporates standardized experimental methods in chemistry. These methods may be used in all subdisciplines of chemistry, excluding purely theoretical chemistry.\n** Astrochemistry – study of the abundance and reactions of chemical elements and molecules in the universe, and their interaction with radiation.\n*** Cosmochemistry – study of the chemical composition of matter in the universe and the processes that led to those compositions.\n** Computational chemistry\n** Environmental chemistry – study of chemical and biochemical phenomena that occur diverse aspects of the environment such the air, soil, and water. It also studies the effects of human activity on the environment.\n** Green chemistry is a philosophy of chemical research and engineering that encourages the design of products and processes that minimize the use and generation of hazardous substances.\n** Supramolecular chemistry – refers to the domain of chemistry beyond that of molecules and focuses on the chemical systems made up of a discrete number of assembled molecular subunits or components.\n** Theoretical chemistry – study of chemistry via fundamental theoretical reasoning (usually within mathematics or physics). In particular the application of quantum mechanics to chemistry is called quantum chemistry. Since the end of the Second World War, the development of computers has allowed a systematic development of computational chemistry, which is the art of developing and applying computer programs for solving chemical problems. Theoretical chemistry has large overlap with (theoretical and experimental) condensed matter physics and molecular physics.\n** Wet chemistry\n*Other\n** Agrochemistry – study and application of both chemistry and biochemistry for agricultural production, the processing of raw products into foods and beverages, and environmental monitoring and remediation.\n** Atmospheric chemistry – branch of atmospheric science which studies the chemistry of the Earth's atmosphere and that of other planets.\n** Chemical engineering – branch of engineering that applies the physical sciences (e.g., chemistry and physics) and/or life sciences (e.g., biology, microbiology and biochemistry) together with mathematics and economics to processes that convert raw materials or chemicals into more useful or valuable forms.\n** Chemical biology – scientific discipline spanning the fields of chemistry and biology and involves the application of chemical techniques and tools, often compounds produced through synthetic chemistry, to analyze and manipulation of biological systems. \n** Chemo-informatics – use of computer and informational techniques applied to a range of problems in the field of chemistry. \n** Flow chemistry – study of chemical reactions in continuous flow, not as stationary batches, in industry and macroprocessing equipment. \n** Immunohistochemistry – involves the process of detecting antigens (e.g., proteins) in cells of a tissue section by exploiting the principle of antibodies binding specifically to antigens in biological tissues.\n** Immunochemistry – is a branch of chemistry that involves the study of the reactions and components on the immune system.\n** Chemical oceanography – study of ocean chemistry: the behavior of the chemical elements within the Earth's oceans\n** Materials science – is an interdisciplinary field investigating the relationship between the structure of materials at atomic or molecular scales and their macroscopic properties. \n** Mathematical chemistry – area of study engaged in novel applications of mathematics to chemistry. It concerns itself principally with the mathematical modeling of chemical phenomena.\n** Mechanochemistry – coupling of mechanical and chemical phenomena on a molecular scale and can be seen as a coupling of chemistry and mechanical engineering. \n** Molecular biology – study of interactions between the various systems of a cell. It overlaps with biochemistry. \n** Molecular mechanics – applies classical mechanics to model molecular systems.\n** Nanotechnology – study and application of matter that is at an atomic and molecular scale. This broad field interacts with chemistry at such scales. \n** Oenology – study of all aspects of wine and winemaking.\n** Organometallic chemistry – study of chemical compounds containing bonds between carbon and a metal.\n** Petrochemistry – study of the transformation of petroleum and natural gas into useful products or raw materials.\n** Pharmacology – branch of medicine and biology concerned with the study of drug action along with the chemical effects.\n** Phytochemistry – study of phytochemicals which come from plants.\n** Radiochemistry – chemistry of radioactive materials.\n** Sonochemistry – study of effect of sonic waves and wave properties on chemical systems.\n** Synthetic chemistry – study of chemical synthesis.\n\nHistory of chemistry \n\nHistory of chemistry\n* Precursors to chemistry\n** Alchemy\n*** History of alchemy\n* History of the branches of chemistry\n** History of analytical chemistry – history of the study of the separation, identification, and quantification of the chemical components of natural and artificial materials.\n** History of astrochemistry – history of the study of the abundance and reactions of chemical elements and molecules in the universe, and their interaction with radiation.\n*** History of cosmochemistry – history of the study of the chemical composition of matter in the universe and the processes that led to those compositions\n** History of atmospheric chemistry – history of the branch of atmospheric science in which the chemistry of the Earth's atmosphere and that of other planets is studied. It is a multidisciplinary field of research and draws on environmental chemistry, physics, meteorology, computer modeling, oceanography, geology and volcanology and other disciplines\n**History of biochemistry – history of the study of chemical processes in living organisms, including, but not limited to, living matter. Biochemistry governs all living organisms and living processes.\n*** History of agrochemistry – history of the study of both chemistry and biochemistry which are important in agricultural production, the processing of raw products into foods and beverages, and in environmental monitoring and remediation.\n*** History of bioinorganic chemistry – history of the examines the role of metals in biology.\n*** History of bioorganic chemistry – history of the rapidly growing scientific discipline that combines organic chemistry and biochemistry.\n*** History of biophysical chemistry – history of the  new branch of chemistry that covers a broad spectrum of research activities involving biological systems.\n*** History of environmental chemistry – history of the scientific study of the chemical and biochemical phenomena that occur in natural places.\n*** History of immunochemistry – history of the branch of chemistry that involves the study of the reactions and components on the immune system.\n*** History of medicinal chemistry – history of the discipline at the intersection of chemistry, especially synthetic organic chemistry, and pharmacology and various other biological specialties, where they are involved with design, chemical synthesis and development for market of pharmaceutical agents (drugs).\n*** History of pharmacology – history of the branch of medicine and biology concerned with the study of drug action.\n*** History of natural product chemistry – history of the chemical compound or substance produced by a living organism – history of the found in nature that usually has a pharmacological or biological activity for use in pharmaceutical drug discovery and drug design.\n*** History of neurochemistry – history of the specific study of neurochemicals, which include neurotransmitters and other molecules such as neuro-active drugs that influence neuron function.\n** History of computational chemistry – history of the branch of chemistry that uses principles of computer science to assist in solving chemical problems.\n*** History of chemo-informatics – history of the use of computer and informational techniques, applied to a range of problems in the field of chemistry.\n*** History of molecular mechanics – history of the uses Newtonian mechanics to model molecular systems.\n** History of Flavor chemistry – history of the someone who uses chemistry to engineer artificial and natural flavors.\n** History of Flow chemistry – history of the chemical reaction is run in a continuously flowing stream rather than in batch production.\n** History of geochemistry – history of the study of the mechanisms behind major geological systems using chemistry\n*** History of aqueous geochemistry – history of the study of the role of various elements in watersheds, including copper, sulfur, mercury, and how elemental fluxes are exchanged through atmospheric-terrestrial-aquatic interactions\n*** History of isotope geochemistry – history of the study of the relative and absolute concentrations of the elements and their isotopes using chemistry and geology\n*** History of ocean chemistry – history of the studies the chemistry of marine environments including the influences of different variables.\n*** History of organic geochemistry – history of the study of the impacts and processes that organisms have had on Earth\n*** History of regional, environmental and exploration geochemistry – history of the study of the spatial variation in the chemical composition of materials at the surface of the Earth\n** History of inorganic chemistry – history of the branch of chemistry concerned with the properties and behavior of inorganic compounds.\n** History of nuclear chemistry – history of the subfield of chemistry dealing with radioactivity, nuclear processes and nuclear properties.\n*** History of radiochemistry – history of the chemistry of radioactive materials, where radioactive isotopes of elements are used to study the properties and chemical reactions of non-radioactive isotopes (often within radiochemistry the absence of radioactivity leads to a substance being described as being inactive as the isotopes are stable).\n**History of organic chemistry – history of the study of the structure, properties, composition, reactions, and preparation (by synthesis or by other means) of carbon-based compounds, hydrocarbons, and their derivatives.\n*** History of petrochemistry – history of the branch of chemistry that studies the transformation of crude oil (petroleum) and natural gas into useful products or raw materials.\n** History of organometallic chemistry – history of the study of chemical compounds containing bonds between carbon and a metal.\n** History of photochemistry – history of the study of chemical reactions that proceed with the absorption of light by atoms or molecules..\n** History of physical chemistry – history of the study of macroscopic, atomic, subatomic, and particulate phenomena in chemical systems in terms of physical laws and concepts.\n*** History of chemical kinetics – history of the study of rates of chemical processes.\n*** History of chemical thermodynamics – history of the study of the interrelation of heat and work with chemical reactions or with physical changes of state within the confines of the laws of thermodynamics.\n*** History of electrochemistry – history of the branch of chemistry that studies chemical reactions which take place in a solution at the interface of an electron conductor (a metal or a semiconductor) and an ionic conductor (the electrolyte), and which involve electron transfer between the electrode and the electrolyte or species in solution.\n*** History of Femtochemistry – history of the Femtochemistry is the science that studies chemical reactions on extremely short timescales, approximately 10−15 seconds (one femtosecond, hence the name).\n*** History of mathematical chemistry – history of the area of research engaged in novel applications of mathematics to chemistry; it concerns itself principally with the mathematical modeling of chemical phenomena.\n*** History of mechanochemistry – history of the coupling of the mechanical and the chemical phenomena on a molecular scale and includes mechanical breakage, chemical behaviour of mechanically stressed solids (e.g., stress-corrosion cracking), tribology, polymer degradation under shear, cavitation-related phenomena (e.g., sonochemistry and sonoluminescence), shock wave chemistry and physics, and even the burgeoning field of molecular machines.\n*** History of physical organic chemistry – history of the study of the interrelationships between structure and reactivity in organic molecules.\n*** History of quantum chemistry – history of the branch of chemistry whose primary focus is the application of quantum mechanics in physical models and experiments of chemical systems.\n*** History of sonochemistry – history of the study of the effect of sonic waves and wave properties on chemical systems.\n*** History of stereochemistry – history of the study of the relative spatial arrangement of atoms within molecules.\n*** History of supramolecular chemistry – history of the area of chemistry beyond the molecules and focuses on the chemical systems made up of a discrete number of assembled molecular subunits or components.\n*** History of thermochemistry – history of the study of the energy and heat associated with chemical reactions and/or physical transformations.\n** History of phytochemistry – history of the strict sense of the word the study of phytochemicals.\n** History of polymer chemistry – history of the multidisciplinary science that deals with the chemical synthesis and chemical properties of polymers or macromolecules.\n** History of solid-state chemistry – history of the study of the synthesis, structure, and properties of solid phase materials, particularly, but not necessarily exclusively of, non-molecular solids\n** History of multidisciplinary fields involving chemistry:\n*** History of chemical biology – history of the scientific discipline spanning the fields of chemistry and biology that involves the application of chemical techniques and tools, often compounds produced through synthetic chemistry, to the study and manipulation of biological systems.\n*** History of chemical engineering – history of the branch of engineering that deals with physical science (e.g., chemistry and physics), and life sciences (e.g., biology, microbiology and biochemistry) with mathematics and economics, to the process of converting raw materials or chemicals into more useful or valuable forms.\n*** History of chemical oceanography – history of the study of the behavior of the chemical elements within the Earth's oceans.\n*** History of chemical physics – history of the branch of physics that studies chemical processes from the point of view of physics.\n*** History of materials science – history of the interdisciplinary field applying the properties of matter to various areas of science and engineering.\n*** History of nanotechnology – history of the study of manipulating matter on an atomic and molecular scale\n*** History of oenology – history of the science and study of all aspects of wine and winemaking except vine-growing and grape-harvesting, which is a subfield called viticulture.\n*** History of spectroscopy – history of the study of the interaction between matter and radiated energy\n*** History of surface science – history of the Surface science is the study of physical and chemical phenomena that occur at the interface of two phases, including solid–liquid interfaces, solid–gas interfaces, solid–vacuum interfaces, and liquid–gas interfaces.\n* History of chemicals\n** History of chemical elements\n*** History of carbon\n*** History of hydrogen\n**** Timeline of hydrogen technologies\n*** History of oxygen\n** History of chemical products\n*** History of aspirin\n*** History of cosmetics\n*** History of gunpowder\n*** History of pharmaceutical drugs\n*** History of vitamins\n* History of chemical processes\n** History of manufactured gas\n*** History of the Haber process\n* History of the chemical industry\n** History of the petroleum industry\n** History of the pharmaceutical industry\n* History of the periodic table\n\nChemicals \n\n* Dictionary of chemical formulas\n* List of biomolecules\n* List of inorganic compounds\n* Periodic table\n\nAtomic Theory \n\nAtomic theory\nThe Atomic Model Timeline\n* The idea of what an atom is has changed over time.\n* Different scientists and their discoveries have led to the development of the current model of an atom.\n* Other examples include:\n** The solar system (BIG made SMALL)\n** The biological cell (SMALL made BIG)\n\nThe Democritus Model\n* A Greek philosopher\n* He conceived the idea of the atom to describe matter.\n* Atom comes from the word atomos which means \"indivisible\".\n* He believed that matter was finite (had a limit)\n* He believed the smallest piece of matter was an indestructible and indivisible particle which he called the \"atom\".\n\nThe John Dalton Model\n\nJ. J. Thomson: The Plum Pudding Model\n\nThermochemistry \n\nThermochemistry\n\nTerminology \n\n* Thermochemistry –\n* Chemical kinetics –  is the study of the rates of chemical reactions and investigates how different experimental conditions can influence the speed of a chemical reaction and yield information about the reaction's mechanism and transition states, as well as the construction of mathematical models that can describe the characteristics of a chemical reaction.\n* Exothermic –a process or reaction in which the system release energy to its surroundings in the form of heat.They are denoted by negative heat flow.\n* Endothermic –a process or reaction in which the system absorbs energy from its surroundings in the form of heat. They are denoted by positive heat flow.\n* Thermochemical equation –\n* Enthalpy change –\n* Enthalpy of reaction –\n* Temperature – is an objective comparative measure of heat.\n* Calorimeter –\n* Heat –\n* Joule –\n* Calorie –\n* Specific heat –\n* Specific heat capacity –\n* Latent heat –\n* Heat of fusion –\n* Heat of vaporization –\n* Collision theory –\n* Activation energy –\n* Activated complex –\n* Reaction rate –\n* Catalyst –\n\nThermochemical Equations \n\n* Chemical equations that include the heat involved in a reaction, either on the reactant side or the product side.\n* Examples:\n** H2O(l) + 240kJ → H2O(g)\n** N2 + 3H2 → 2NH3 + 92kJ\n* Joule (J) –\n\nEnthalpy \n\nHow to calculate  the enthalpy of N₂+3H₂ =2NH₃?\n\nEnthalpy and Thermochemical Equations \n\nEndothermic Reactions \n\nExothermic Reactions \n\nPotential Energy Diagrams \n\nThermochemistry Stoichiometry \n\nChemists\n\nFor more chemists, see: Nobel Prize in Chemistry and List of chemists\n* Marie Curie\n* John Dalton\n* Humphry Davy\n* Eleuthère Irénée du Pont\n* George Eastman\n* Michael Faraday\n* Dmitriy Mendeleyev\n* Alfred Nobel\n* Wilhelm Ostwald\n* Louis Pasteur\n* Linus Pauling\n* Joseph Priestley\n* Karl Ziegler\n* Ahmed Zewail\n\nChemistry literature \n\n* Scientific literature –\n* Scientific journal –\n* Academic journal –\n* List of important publications in chemistry\n* List of scientific journals in chemistry\n\n;List of science magazines\n* Scientific American\n\nLists \n\n;Chemical elements data references\n* List of chemical elements — atomic mass, atomic number, symbol, name\n* Electron configurations of the elements (data page) — electron configuration, electrons per shell\n* Densities of the elements (data page) — density (solid, liquid, gas)\n* Electron affinity (data page) — electron affinity\n* Melting points of the elements (data page) — melting point\n* Boiling points of the elements (data page) — boiling point\n* Critical points of the elements (data page) — critical point\n* Heats of fusion of the elements (data page) — heat of fusion\n* Heats of vaporization of the elements (data page) — heat of vaporization\n* Heat capacities of the elements (data page) — heat capacity\n* Vapor pressures of the elements (data page) — vapor pressure\n* Electronegativities of the elements (data page) — electronegativity (Pauling scale)\n* Ionization energies of the elements (data page) — ionization energies (in eV) and molar ionization energies (in kJ/mol)\n* Atomic radii of the elements (data page) — atomic radius (empirical), atomic radius (calculated), van der Waals radius, covalent radius\n* Electrical resistivities of the elements (data page) — electrical resistivity\n* Thermal conductivities of the elements (data page) — thermal conductivity\n* Thermal expansion coefficients of the elements (data page) — thermal expansion\n* Speeds of sound of the elements (data page) — speed of sound\n* Elastic properties of the elements (data page) — Young's modulus, Poisson ratio, bulk modulus, shear modulus\n* Hardnesses of the elements (data page) — Mohs hardness, Vickers hardness, Brinell hardness\n* Abundances of the elements (data page) — Earth's crust, sea water, Sun and solar system\n* List of oxidation states of the elements — oxidation states\n\n;List of compounds\n* List of CAS numbers by chemical compound\n* List of Extremely Hazardous Substances\n* List of inorganic compounds\n* List of organic compounds\n* List of alkanes\n* List of alloys\n\n;Other\n* List of thermal conductivities\n* List of purification methods in chemistry\n* List of unsolved problems in chemistry. Outline of chemistry. http://en.wikipedia.org/?curid=6896."
  }
}
