{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19128",
  "eid" : "382cda40-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778603492,
  "textBody" : "Mali is located in Africa.\nThe history of the territory of modern Mali may be divided into:\n*Pre-Imperial Mali, before the 13th century \n*the history of the eponymous Mali Empire and of the Songhai Empire during the 13th to 16th centuries\n\nThe borders of Mali are those of French Sudan, drawn in 1891. They are artificial, and unite part of the larger Sudan region with parts of the Sahara.\nAs a consequence, Mali is a multiethnic country, with a majority of its population consisting of Mandé peoples.\n\nMali's history is dominated by its role in trans-Saharan trade, connecting West Africa and the Maghreb. The Malian city Timbuktu is exemplary of this - situated on the southern fringe of the Sahara and close to the River Niger it has played an important role in the trans-Saharan trade from the 13th century, with the establishment of the Mali Empire.\n\nMali Empire\n\nThe Mali Empire became Islamic in the early 14th century, under Musa I of Mali. From that time until the 19th century, Timbuktu remained important as an outpost at the southwestern fringe of the Muslim world and a hub of the Arab slave trade.\n\nMandinka from c. 1230 to c. 1600. The empire was found by Sundiata Keita and became known for the wealth of its rulers, especially Mansa Musa I. The Mali Empire had many profound cultural influences on West Africa, allowing the spread of its language, laws and customs along the Niger River. It extended over a large area and consisted of numerous vassal kingdoms and provinces.\n\nThe Mali Empire began to weaken in the 15th century, but it remained dominant for much of the 15th. It survived into the 16th century, but by then had lost much of its former strength and importance.\n\nSonghai Empire\n\nThe Mali Empire began to weaken by the mid 14th century. The Songhai took advantage of this and asserted their independence. The Songhai made Gao their capital and began an imperial expansion of their own throughout the western Sahel. And by 1420, Songhai was strong enough to exact tribute from Masina.\nThe emerging Songhai Empire and the declining Mali Empire co-existed during much of the later 14th and throughout the 15th century. In the later 15th century, control of Timbuktu shifted to the Songhai Empire. They were also technologically advanced.\n\nAfter the empires (1591–1892) \n\nThe Songhay empire eventually collapsed under the pressure from the Moroccan Saadi dynasty. The turning-point was the Battle of Tondibi of 13 March 1591). Morocco subsequently controlled Gao, Timbuktu, Djenné (also seen as Jenne), and related trade routes with much difficulty until around the end of the 17th century.\n\nAfter the collapse of the Songhai Empire, no single state controlled the region. The Moroccans only succeeded in occupying a few portions of the country, and even in those locations where they did attempt to rule, their hold was weak and challenged by rivals. Several small successor kingdoms arose. the most notable in what is now Mali were:\n\nBambara Empire or Kingdom of Segou \n\nThe Bambara Empire existed as a centralized state from 1712 to 1861, was based at Ségou and also Timbuktu (also seen as Segu), and ruled parts of central and southern Mali. It existed until El Hadj Umar Tall, a Toucouleur conqueror swept across West Africa from Futa Tooro. Umar Tall's mujahideen readily defeated the Bambara, seizing Ségou itself on March 10, 1861 and declaring an end to the empire.\n\nKingdom of Kaarta \n\nA split in the Coulibaly dynasty in Ségou led to the establishment of a second Bambara state, the kingdom of Kaarta, in what is now western Mali, in 1753. It was defeated in 1854 by Umar Tall, leader of Toucouleur Empire, before his war with Ségou.\n\nKenedougou Kingdom \n\nThe Senufo Kenedugu Kingdom originated in the 17th century in the area around what is now the border of Mali and Burkina Faso. In 1876 the capital was moved to Sikasso. It resisted the effort of Samori Ture, leader of Wassoulou Empire, in 1887, to conquer it, and was one of the last kingdoms in the area to fall to the French in 1898.\n\nMaasina \n\nAn Islamic-inspired uprising in the largely Fula Inner Niger Delta region against rule by Ségou in 1818 led to establishment of a separate state. It later allied with Bambara Empire against Umar Tall's Toucouleur Empire and was also defeated by it in 1862.\n\nToucouleur Empire \n\nThis empire, founded by El Hadj Umar Tall of the Toucouleur peoples, beginning in 1864, ruled eventually most of what is now Mali until the French conquest of the region in 1890. This was in some ways a turbulent period, with ongoing resistance in Massina and increasing pressure from the French.\n\nWassoulou Empire \n\nThe Wassoulou or Wassulu Empire was a short-lived (1878–1898) empire, led by Samori Ture in the predominantly Malinké area of what is now upper Guinea and southwestern Mali (Wassoulou). It later moved to Ivory Coast before being conquered by the French.\n\nFrench Sudan (1892–1960) \n\nMali fell under French colonial rule in 1892. In 1893, the French appointed a civilian governor of the territory they called Soudan Français (French Sudan), but active resistance to French rule continued. By 1905, most of the area was under firm French control. \n\nFrench Sudan was administered as part of the Federation of French West Africa and supplied labor to France’s colonies on the coast of West Africa. In 1958 the renamed Sudanese Republic obtained complete internal autonomy and joined the French Community. In early 1959, the Sudanese Republic and Senegal formed the Federation of Mali. On 31 March 1960 France agreed to the Federation of Mali becoming fully independent. On 20 June 1960 the Federation of Mali became an independent country and Modibo Keïta became its first President.\n\nIndependence (1960-present) \n\nFollowing the withdrawal of Senegal from the federation in August 1960, the former Sudanese Republic became the Republic of Mali on 22 September 1960, with Modibo Keïta as president.\n\nPresident Modibo Keïta, whose Sudanese Union-African Democratic Rally (US/RDA) party had dominated pre-independence politics (as a member of the African Democratic Rally), moved quickly to declare a single-party state and to pursue a socialist policy based on extensive nationalization. Keïta withdrew from the French Community and also had close ties to the Eastern bloc. A continuously deteriorating economy led to a decision to rejoin the Franc Zone in 1967 and modify some of the economic excesses.\n\nOne-party rule \n\nOn November 19, 1968, a group of young officers staged a bloodless coup and set up a 14-member Military Committee for National Liberation (CMLN), with Lt. Moussa Traoré as president. The military leaders attempted to pursue economic reforms, but for several years faced debilitating internal political struggles and the disastrous Sahelian drought.\n\nA new constitution, approved in 1974, created a one-party state and was designed to move Mali toward civilian rule. However, the military leaders remained in power. In September 1976, a new political party was established, the Democratic Union of the Malian People (UDPM), based on the concept of democratic centralism. Single-party presidential and legislative elections were held in June 1979, and Gen. Moussa Traoré received 99% of the votes. His efforts at consolidating the single-party government were challenged in 1980 by student-led anti-government demonstrations that led to three coup attempts, which were brutally quashed.\n\nThe political situation stabilized during 1981 and 1982, and remained generally calm throughout the 1980s. In late December 1985, however, a border dispute between Mali and Burkina Faso over the mineral rich Agacher strip erupted into a brief war. The UDPM spread its structure to Cercles and Arrondissements across the land.\n\nShifting its attention to Mali's economic difficulties, the government approved plans for some reforms of the state enterprise system, and attempted to control public corruption. It implemented cereal marketing liberalization, created new incentives to private enterprise, and worked out a new structural adjustment agreement with the International Monetary Fund (IMF). But the populace became increasingly dissatisfied with the austerity measures imposed by the IMF plan as well as their perception that the ruling elite was not subject to the same strictures. In response to the growing demands for multiparty democracy then sweeping the continent, the Traoré regime did allow some limited political liberalization. In National Assembly elections in June 1988, multiple UDPM candidates were permitted to contest each seat, and the regime organized nationwide conferences to consider how to implement democracy within the one-party framework. Nevertheless, the regime refused to usher in a full-fledged democratic system.\n\nHowever, by 1990, cohesive opposition movements began to emerge, including the National Democratic Initiative Committee and the Alliance for Democracy in Mali (Alliance pour la Démocratie au Mali, ADEMA). The increasingly turbulent political situation was complicated by the rise of ethnic violence in the north in mid-1990. The return to Mali of large numbers of Tuareg who had migrated to Algeria and Libya during the prolonged drought increased tensions in the region between the nomadic Tuareg and the sedentary population. Ostensibly fearing a Tuareg secessionist movement in the north, the Traoré regime imposed a state of emergency and harshly repressed Tuareg unrest. Despite the signing of a peace accord in January 1991, unrest and periodic armed clashes continued.\n\nTransition to multiparty democracy \n\nAs in other African countries, demands for multi-party democracy increased. The Traoré government allowed some opening of the system, including the establishment of an independent press and independent political associations, but insisted that Mali was not ready for democracy. In early 1991, student-led anti-government rioting broke out again, but this time it was supported also by government workers and others. On March 26, 1991, after 4 days of intense anti-government rioting, a group of 17 military officers, led by Amadou Toumani Touré, arrested President Traoré and suspended the constitution. \n\nWithin days, these officers joined with the Coordinating Committee of Democratic Associations to form a predominantly civilian, 25-member ruling body, the Transitional Committee for the Salvation of the People (CTSP). The CTSP then appointed a civilian-led government. A national conference held in August 1991 produced a draft constitution (approved in a referendum January 12, 1992), a charter for political parties, and an electoral code. Political parties were allowed to form freely. Between January and April 1992, a president, National Assembly, and municipal councils were elected. On June 8, 1992, Alpha Oumar Konaré, the candidate of ADEMA, was inaugurated as the president of Mali's Third Republic.\n\nIn 1997, attempts to renew national institutions through democratic elections ran into administrative difficulties, resulting in a court-ordered annulment of the legislative elections held in April 1997. The exercise, nonetheless, demonstrated the overwhelming strength of President Konaré's ADEMA party, causing some other historic parties to boycott subsequent elections. President Konaré won the presidential election against scant opposition on May 11. In the two-round legislative elections conducted on July 21 and August 3, ADEMA secured over 80% of the National Assembly seats.\n\n2000s \n\nKonaré stepped down after his constitutionally mandated limit of two terms and did not run in the 2002 elections. Touré then reemerged, this time as a civilian. Running as an independent on a platform of national unity, Touré won the presidency in a runoff against the candidate of Adema, which had been divided by infighting and suffered from the creation of a spin-off party, the Rally for Mali. Touré had retained great popularity because of his role in the transitional government in 1991–92. The 2002 election was a milestone, marking Mali's first successful transition from one democratically elected president to another, despite the persistence of electoral irregularities and low voter turnout. In the 2002 legislative elections, no party gained a majority; Touré then appointed a politically inclusive government and pledged to tackle Mali’s pressing social and economic development problems.Mali country profile, p. 4.\n\n2010s\n\nIn January 2012 an insurgency has begun, led by the National Movement for the Liberation of Azawad (MNLA).[http://www.news24.com/Africa/News/Mali-clashes-force-120-000-from-homes-20120222 Mali clashes force 120 000 from homes]. News24 (2012-02-22). Retrieved on: 23 Feb 2012.\n\nOn 22 March 2012, it was reported that rebel troops from the military appeared on state TV announcing they had seized control of the country.[http://www.bbc.co.uk/news/world-africa-17462111 Post-coup Mali hit with sanctions by African neighbours – Globe and Mail]. Bbc.co.uk (2012-03-22). Retrieved on 2012-05-04. Unrest over the president's handling of the conflict with the rebels was a motivating force. The former President was forced into hiding.\n\nHowever, due to the 2012 insurgency in northern Mali, the military government controls only the southern third of the country, leaving the north of the country (known as Azawad) to MNLA rebels. The rebels control Timbuktu, 700 km from the capital.[http://www.bbc.co.uk/news/world-africa-17576725 BBC News – Mali Tuareg rebels control Timbuktu as troops flee]. Bbc.co.uk (2012-04-02). Retrieved on 2012-05-04. In response, the Economic Community of West African States (ECOWAS) froze assets and imposed an embargo, leaving some with only days of fuel. Mali is dependent on fuel imports trucked overland from Senegal and Ivory Coast.[https://www.theglobeandmail.com/news/world/post-coup-mali-hit-with-sanctions-by-african-neighbours/article2390504/ Post-coup Mali hit with sanctions by African neighbours]. Theglobeandmail.com (2012-04-03). Retrieved on 2012-05-04.\n\nAs of July 17, 2012, the Tuareg rebels have since been pushed out by their allies, the Islamists, Ansar Dine, and Al Qaeda in the Islamic Maghreb (A.Q.I.M.). An extremist ministate in northern Mali is the unexpected result from the collapse of the earlier coup d'etat by the angry army officers.\n\nRefuges in the 92,000-person refugee camp at Mbera, Mauritania, describe the Islamists as \"intent on imposing an Islam of lash and gun on Malian Muslims.\" The Islamists in Timbuktu have destroyed about a half-dozen venerable above-ground tombs of revered holy men, proclaiming the tombs contrary to Shariah. One refugee in the camp spoke of encountering Afghans, Pakistanis and Nigerians.\n\nRamtane Lamamra, the African Union's peace and security commissioner, said the African Union has discussed sending a military force to reunify Mali and that negotiations with terrorists had been ruled out but negotiations with other armed factions is still open.\n\nOn 10 December 2012 Prime Minister Cheick Modibo Diarra was arrested by soldiers and taken to a military base in Kati. Hours later, the Prime Minister announced his resignation and the resignation of his government on national television.\n\nOn 10 January 2013, Islamist forces captured the strategic town of Konna, located 600 km from the capital, from the Malian army. The following day, the French military launched Opération Serval, intervening in the conflict.\n\nBy 8 February, the Islamist-held territory had been re-taken by the Malian military, with help from the international coalition. Tuareg separatists have continued to fight the Islamists as well, although the MNLA has also been accused of carrying out attacks against the Malian military.\n\nA peace deal between the government and Tuareg rebels was signed on 18 June 2013.\n\nPresidential elections were held in Mali on 28 July 2013, with a second round run-off held on 11 August.[http://www.aljazeera.com/news/africa/2013/05/201352814129579842.html Mali sets date for presidential election] Al Jazeera, 28 May 2013 Ibrahim Boubacar Keïta defeated Soumaïla Cissé in the run-off to become the new President of Mali.\n\nThe peace treaty between the Tuareg rebels and Malian Government was broken in late November 2013 because of fighting in the northern city of Kidal.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "History of Mali" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19128" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Mali is located in Africa.\nThe history of the territory of modern Mali may be divided into:\n*Pre-Imperial Mali, before the 13th century \n*the history of the eponymous Mali Empire and of the Songhai Empire during the 13th to 16th centuries\n\nThe borders of Mali are those of French Sudan, drawn in 1891. They are artificial, and unite part of the larger Sudan region with parts of the Sahara.\nAs a consequence, Mali is a multiethnic country, with a majority of its population consisting of Mandé peoples.\n\nMali's history is dominated by its role in trans-Saharan trade, connecting West Africa and the Maghreb. The Malian city Timbuktu is exemplary of this - situated on the southern fringe of the Sahara and close to the River Niger it has played an important role in the trans-Saharan trade from the 13th century, with the establishment of the Mali Empire.\n\nMali Empire\n\nThe Mali Empire became Islamic in the early 14th century, under Musa I of Mali. From that time until the 19th century, Timbuktu remained important as an outpost at the southwestern fringe of the Muslim world and a hub of the Arab slave trade.\n\nMandinka from c. 1230 to c. 1600. The empire was found by Sundiata Keita and became known for the wealth of its rulers, especially Mansa Musa I. The Mali Empire had many profound cultural influences on West Africa, allowing the spread of its language, laws and customs along the Niger River. It extended over a large area and consisted of numerous vassal kingdoms and provinces.\n\nThe Mali Empire began to weaken in the 15th century, but it remained dominant for much of the 15th. It survived into the 16th century, but by then had lost much of its former strength and importance.\n\nSonghai Empire\n\nThe Mali Empire began to weaken by the mid 14th century. The Songhai took advantage of this and asserted their independence. The Songhai made Gao their capital and began an imperial expansion of their own throughout the western Sahel. And by 1420, Songhai was strong enough to exact tribute from Masina.\nThe emerging Songhai Empire and the declining Mali Empire co-existed during much of the later 14th and throughout the 15th century. In the later 15th century, control of Timbuktu shifted to the Songhai Empire. They were also technologically advanced.\n\nAfter the empires (1591–1892) \n\nThe Songhay empire eventually collapsed under the pressure from the Moroccan Saadi dynasty. The turning-point was the Battle of Tondibi of 13 March 1591). Morocco subsequently controlled Gao, Timbuktu, Djenné (also seen as Jenne), and related trade routes with much difficulty until around the end of the 17th century.\n\nAfter the collapse of the Songhai Empire, no single state controlled the region. The Moroccans only succeeded in occupying a few portions of the country, and even in those locations where they did attempt to rule, their hold was weak and challenged by rivals. Several small successor kingdoms arose. the most notable in what is now Mali were:\n\nBambara Empire or Kingdom of Segou \n\nThe Bambara Empire existed as a centralized state from 1712 to 1861, was based at Ségou and also Timbuktu (also seen as Segu), and ruled parts of central and southern Mali. It existed until El Hadj Umar Tall, a Toucouleur conqueror swept across West Africa from Futa Tooro. Umar Tall's mujahideen readily defeated the Bambara, seizing Ségou itself on March 10, 1861 and declaring an end to the empire.\n\nKingdom of Kaarta \n\nA split in the Coulibaly dynasty in Ségou led to the establishment of a second Bambara state, the kingdom of Kaarta, in what is now western Mali, in 1753. It was defeated in 1854 by Umar Tall, leader of Toucouleur Empire, before his war with Ségou.\n\nKenedougou Kingdom \n\nThe Senufo Kenedugu Kingdom originated in the 17th century in the area around what is now the border of Mali and Burkina Faso. In 1876 the capital was moved to Sikasso. It resisted the effort of Samori Ture, leader of Wassoulou Empire, in 1887, to conquer it, and was one of the last kingdoms in the area to fall to the French in 1898.\n\nMaasina \n\nAn Islamic-inspired uprising in the largely Fula Inner Niger Delta region against rule by Ségou in 1818 led to establishment of a separate state. It later allied with Bambara Empire against Umar Tall's Toucouleur Empire and was also defeated by it in 1862.\n\nToucouleur Empire \n\nThis empire, founded by El Hadj Umar Tall of the Toucouleur peoples, beginning in 1864, ruled eventually most of what is now Mali until the French conquest of the region in 1890. This was in some ways a turbulent period, with ongoing resistance in Massina and increasing pressure from the French.\n\nWassoulou Empire \n\nThe Wassoulou or Wassulu Empire was a short-lived (1878–1898) empire, led by Samori Ture in the predominantly Malinké area of what is now upper Guinea and southwestern Mali (Wassoulou). It later moved to Ivory Coast before being conquered by the French.\n\nFrench Sudan (1892–1960) \n\nMali fell under French colonial rule in 1892. In 1893, the French appointed a civilian governor of the territory they called Soudan Français (French Sudan), but active resistance to French rule continued. By 1905, most of the area was under firm French control. \n\nFrench Sudan was administered as part of the Federation of French West Africa and supplied labor to France’s colonies on the coast of West Africa. In 1958 the renamed Sudanese Republic obtained complete internal autonomy and joined the French Community. In early 1959, the Sudanese Republic and Senegal formed the Federation of Mali. On 31 March 1960 France agreed to the Federation of Mali becoming fully independent. On 20 June 1960 the Federation of Mali became an independent country and Modibo Keïta became its first President.\n\nIndependence (1960-present) \n\nFollowing the withdrawal of Senegal from the federation in August 1960, the former Sudanese Republic became the Republic of Mali on 22 September 1960, with Modibo Keïta as president.\n\nPresident Modibo Keïta, whose Sudanese Union-African Democratic Rally (US/RDA) party had dominated pre-independence politics (as a member of the African Democratic Rally), moved quickly to declare a single-party state and to pursue a socialist policy based on extensive nationalization. Keïta withdrew from the French Community and also had close ties to the Eastern bloc. A continuously deteriorating economy led to a decision to rejoin the Franc Zone in 1967 and modify some of the economic excesses.\n\nOne-party rule \n\nOn November 19, 1968, a group of young officers staged a bloodless coup and set up a 14-member Military Committee for National Liberation (CMLN), with Lt. Moussa Traoré as president. The military leaders attempted to pursue economic reforms, but for several years faced debilitating internal political struggles and the disastrous Sahelian drought.\n\nA new constitution, approved in 1974, created a one-party state and was designed to move Mali toward civilian rule. However, the military leaders remained in power. In September 1976, a new political party was established, the Democratic Union of the Malian People (UDPM), based on the concept of democratic centralism. Single-party presidential and legislative elections were held in June 1979, and Gen. Moussa Traoré received 99% of the votes. His efforts at consolidating the single-party government were challenged in 1980 by student-led anti-government demonstrations that led to three coup attempts, which were brutally quashed.\n\nThe political situation stabilized during 1981 and 1982, and remained generally calm throughout the 1980s. In late December 1985, however, a border dispute between Mali and Burkina Faso over the mineral rich Agacher strip erupted into a brief war. The UDPM spread its structure to Cercles and Arrondissements across the land.\n\nShifting its attention to Mali's economic difficulties, the government approved plans for some reforms of the state enterprise system, and attempted to control public corruption. It implemented cereal marketing liberalization, created new incentives to private enterprise, and worked out a new structural adjustment agreement with the International Monetary Fund (IMF). But the populace became increasingly dissatisfied with the austerity measures imposed by the IMF plan as well as their perception that the ruling elite was not subject to the same strictures. In response to the growing demands for multiparty democracy then sweeping the continent, the Traoré regime did allow some limited political liberalization. In National Assembly elections in June 1988, multiple UDPM candidates were permitted to contest each seat, and the regime organized nationwide conferences to consider how to implement democracy within the one-party framework. Nevertheless, the regime refused to usher in a full-fledged democratic system.\n\nHowever, by 1990, cohesive opposition movements began to emerge, including the National Democratic Initiative Committee and the Alliance for Democracy in Mali (Alliance pour la Démocratie au Mali, ADEMA). The increasingly turbulent political situation was complicated by the rise of ethnic violence in the north in mid-1990. The return to Mali of large numbers of Tuareg who had migrated to Algeria and Libya during the prolonged drought increased tensions in the region between the nomadic Tuareg and the sedentary population. Ostensibly fearing a Tuareg secessionist movement in the north, the Traoré regime imposed a state of emergency and harshly repressed Tuareg unrest. Despite the signing of a peace accord in January 1991, unrest and periodic armed clashes continued.\n\nTransition to multiparty democracy \n\nAs in other African countries, demands for multi-party democracy increased. The Traoré government allowed some opening of the system, including the establishment of an independent press and independent political associations, but insisted that Mali was not ready for democracy. In early 1991, student-led anti-government rioting broke out again, but this time it was supported also by government workers and others. On March 26, 1991, after 4 days of intense anti-government rioting, a group of 17 military officers, led by Amadou Toumani Touré, arrested President Traoré and suspended the constitution. \n\nWithin days, these officers joined with the Coordinating Committee of Democratic Associations to form a predominantly civilian, 25-member ruling body, the Transitional Committee for the Salvation of the People (CTSP). The CTSP then appointed a civilian-led government. A national conference held in August 1991 produced a draft constitution (approved in a referendum January 12, 1992), a charter for political parties, and an electoral code. Political parties were allowed to form freely. Between January and April 1992, a president, National Assembly, and municipal councils were elected. On June 8, 1992, Alpha Oumar Konaré, the candidate of ADEMA, was inaugurated as the president of Mali's Third Republic.\n\nIn 1997, attempts to renew national institutions through democratic elections ran into administrative difficulties, resulting in a court-ordered annulment of the legislative elections held in April 1997. The exercise, nonetheless, demonstrated the overwhelming strength of President Konaré's ADEMA party, causing some other historic parties to boycott subsequent elections. President Konaré won the presidential election against scant opposition on May 11. In the two-round legislative elections conducted on July 21 and August 3, ADEMA secured over 80% of the National Assembly seats.\n\n2000s \n\nKonaré stepped down after his constitutionally mandated limit of two terms and did not run in the 2002 elections. Touré then reemerged, this time as a civilian. Running as an independent on a platform of national unity, Touré won the presidency in a runoff against the candidate of Adema, which had been divided by infighting and suffered from the creation of a spin-off party, the Rally for Mali. Touré had retained great popularity because of his role in the transitional government in 1991–92. The 2002 election was a milestone, marking Mali's first successful transition from one democratically elected president to another, despite the persistence of electoral irregularities and low voter turnout. In the 2002 legislative elections, no party gained a majority; Touré then appointed a politically inclusive government and pledged to tackle Mali’s pressing social and economic development problems.Mali country profile, p. 4.\n\n2010s\n\nIn January 2012 an insurgency has begun, led by the National Movement for the Liberation of Azawad (MNLA).[http://www.news24.com/Africa/News/Mali-clashes-force-120-000-from-homes-20120222 Mali clashes force 120 000 from homes]. News24 (2012-02-22). Retrieved on: 23 Feb 2012.\n\nOn 22 March 2012, it was reported that rebel troops from the military appeared on state TV announcing they had seized control of the country.[http://www.bbc.co.uk/news/world-africa-17462111 Post-coup Mali hit with sanctions by African neighbours – Globe and Mail]. Bbc.co.uk (2012-03-22). Retrieved on 2012-05-04. Unrest over the president's handling of the conflict with the rebels was a motivating force. The former President was forced into hiding.\n\nHowever, due to the 2012 insurgency in northern Mali, the military government controls only the southern third of the country, leaving the north of the country (known as Azawad) to MNLA rebels. The rebels control Timbuktu, 700 km from the capital.[http://www.bbc.co.uk/news/world-africa-17576725 BBC News – Mali Tuareg rebels control Timbuktu as troops flee]. Bbc.co.uk (2012-04-02). Retrieved on 2012-05-04. In response, the Economic Community of West African States (ECOWAS) froze assets and imposed an embargo, leaving some with only days of fuel. Mali is dependent on fuel imports trucked overland from Senegal and Ivory Coast.[https://www.theglobeandmail.com/news/world/post-coup-mali-hit-with-sanctions-by-african-neighbours/article2390504/ Post-coup Mali hit with sanctions by African neighbours]. Theglobeandmail.com (2012-04-03). Retrieved on 2012-05-04.\n\nAs of July 17, 2012, the Tuareg rebels have since been pushed out by their allies, the Islamists, Ansar Dine, and Al Qaeda in the Islamic Maghreb (A.Q.I.M.). An extremist ministate in northern Mali is the unexpected result from the collapse of the earlier coup d'etat by the angry army officers.\n\nRefuges in the 92,000-person refugee camp at Mbera, Mauritania, describe the Islamists as \"intent on imposing an Islam of lash and gun on Malian Muslims.\" The Islamists in Timbuktu have destroyed about a half-dozen venerable above-ground tombs of revered holy men, proclaiming the tombs contrary to Shariah. One refugee in the camp spoke of encountering Afghans, Pakistanis and Nigerians.\n\nRamtane Lamamra, the African Union's peace and security commissioner, said the African Union has discussed sending a military force to reunify Mali and that negotiations with terrorists had been ruled out but negotiations with other armed factions is still open.\n\nOn 10 December 2012 Prime Minister Cheick Modibo Diarra was arrested by soldiers and taken to a military base in Kati. Hours later, the Prime Minister announced his resignation and the resignation of his government on national television.\n\nOn 10 January 2013, Islamist forces captured the strategic town of Konna, located 600 km from the capital, from the Malian army. The following day, the French military launched Opération Serval, intervening in the conflict.\n\nBy 8 February, the Islamist-held territory had been re-taken by the Malian military, with help from the international coalition. Tuareg separatists have continued to fight the Islamists as well, although the MNLA has also been accused of carrying out attacks against the Malian military.\n\nA peace deal between the government and Tuareg rebels was signed on 18 June 2013.\n\nPresidential elections were held in Mali on 28 July 2013, with a second round run-off held on 11 August.[http://www.aljazeera.com/news/africa/2013/05/201352814129579842.html Mali sets date for presidential election] Al Jazeera, 28 May 2013 Ibrahim Boubacar Keïta defeated Soumaïla Cissé in the run-off to become the new President of Mali.\n\nThe peace treaty between the Tuareg rebels and Malian Government was broken in late November 2013 because of fighting in the northern city of Kidal. History of Mali. http://en.wikipedia.org/?curid=19128."
  }
}
