{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18020",
  "eid" : "304143c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778590204,
  "textBody" : "A lost city is a settlement that fell into terminal decline and became extensively or completely uninhabited, with the consequence that the site's former significance was no longer known to the wider world. The locations of many lost cities have been forgotten, but some have been rediscovered and studied extensively by scientists. Recently abandoned cities or cities whose location was never in question might be referred to as ruins or ghost towns. The search for such lost cities by European explorers and adventurers in Africa, the Americas, and Southeast Asia from the 15th century onwards eventually led to the development of archaeology.\n\nLost cities generally fall into two broad categories: those where all knowledge of the city's existence was forgotten before it was rediscovered, and those whose memory was preserved in myth, legend, or historical records but whose location was lost or at least no longer widely recognized.\n\nHow cities are lost\n\nCities may become lost for a variety of reasons including natural disasters, economic or social upheaval, or war.\n\nThe Incan capital city of Vilcabamba was destroyed and depopulated during the Spanish conquest of Peru in 1572. The Spanish did not rebuild the city, and the location went unrecorded and was forgotten until it was rediscovered through a detailed examination of period letters and documents.\n\nTroy was a city located in northwest Anatolia in what is now Turkey. It is best known for being the focus of the Trojan War described in the Greek Epic Cycle and especially in the Iliad, one of the two epic poems attributed to Homer. Repeatedly destroyed and rebuilt, the city slowly declined and was abandoned in the Byzantine era. Buried by time, the city was consigned to the realm of legend until the location was first excavated in the 1860s.\n\nOther settlements are lost with few or no clues to their decline. For example, Malden Island, in the central Pacific, was deserted when first visited by Europeans in 1825, but the unsuspected presence of ruined temples and the remains of other structures found on the island indicate that a population of Polynesians had lived there for perhaps several generations some centuries earlier. Prolonged drought seems the most likely explanation for their demise and the remote nature of the island meant few visitors.\n\nRediscovery\n\nWith the development of archaeology and the application of modern techniques, many previously lost cities have been rediscovered.\n\nMachu Picchu is a pre-Columbian Inca site situated on a mountain ridge above the Urubamba Valley in Peru. Often referred to as the \"Lost City of the Incas\", it is perhaps the most familiar icon of the Inca World. Machu Picchu was built around 1450, at the height of the Inca Empire. It was abandoned just over 100 years later, in 1572, as a belated result of the Spanish Conquest. It is possible that most of its inhabitants died from smallpox introduced by travelers before the Spanish conquistadors arrived in the area. In 1911, Melchor Arteaga led the explorer Hiram Bingham to Machu Picchu, which had been largely forgotten by everybody except the small number of people living in the immediate valley.\n\nHelike was an ancient Greek city that sank at night in the winter of 373 BCE. The city was located in Achaea, Northern Peloponnesos, two kilometres (12 stadia) from the Corinthian Gulf. The city was thought to be legend until 2001, when it was rediscovered in the Helike Delta. In 1988, the Greek archaeologist Dora Katsonopoulou launched the Helike Project to locate the site of the lost city. In 1994, in collaboration with the University of Patras, a magnetometer survey was carried out in the midplain of the delta, which revealed the outlines of a buried building. In 1995, this target was excavated (now known as the Klonis site), and a large Roman building with standing walls was brought to light. The city was rediscovered in 2001, buried in an ancient lagoon.\n\nLegends\n\nSome cities which are considered lost are (or may be) places of legend.\n*Ai – important city in the Hebrew Bible\n*Arthurian Camelot\n*Atlantis\n*Aztlán- the ancestral homeland in Aztec mythology\n*Ciudad de los Cesares (City of the Caesars, also variously known as City of the Patagonia, Elelín, Lin Lin, Trapalanda, Trapananda, or Wandering City) – a legendary city in Patagonia, never found\n*Dvārakā – An ancient city of Krishna, submerged in the sea. \n*El Dorado\n*Iram of the Pillars – this may refer to a lost Arabian city in the Empty Quarter, but sources also identify it as a tribe or an area mentioned in the Quran\n*Kitezh, Russia – legendary underwater city which supposedly may be seen in good weather\n*Lost City of Z – a city allegedly located in the jungles of the Mato Grosso region of Brazil, said to have been seen by the British explorer Col. Percy Harrison Fawcett some time before World War I\n*Lyonesse\n*Otuken – legendary capital city of Gokturks in Turkic mythology\n*Paititi – a legendary city and refuge in the rainforests where Bolivia, Brazil, and Peru meet\n*The Seven Cities of Gold\n*Shambhala – Mythical kingdom said to be located in Tibet \n*Sodom and Gomorrah\n*Vineta – legendary city somewhere at the Baltic coast of Germany or Poland\n*Ys – legendary city on the western coast of France\n\nOther lost cities, having once been considered legendary, are now known to have existed, such as Troy and Bjarmaland.\n\nLost cities by continent\n\nAfrica\n\nRediscovered\n\n*Akhetaten, Egypt – Capital during the reign of 18th Dynasty pharaoh Akhenaten. Later abandoned and almost totally destroyed. Modern day el Amarna.\n*Aoudaghost, Mauritania – Wealthy Berber city in medieval Ghana.\n*Avaris – capital city of the Hyksos in the Nile Delta.\n*Canopus, Egypt – Located on the now-dry Canopic branch of the Nile, east of Alexandria.\n*Carthage – Initially a Phoenician city, destroyed and then rebuilt by Rome. Later served as the capital of the Vandal Kingdom of North Africa, before being destroyed by the Arabs after its capture in 697 CE.  Now a UNESCO World Heritage site.\n*Dougga, Tunisia – Roman city located in present-day Tunisia.  Now a UNESCO World Heritage site.\n*Great Zimbabwe – Built between the 11th and the 14th century, this city is the namesake of modern-day Zimbabwe.  Now a UNESCO World Heritage site.\n*Leptis Magna – Roman city located in present-day Libya. It was the birthplace of Emperor Septimius Severus, who lavished an extensive public works programme on the city, including diverting the course of a nearby river. The river later returned to its original course, burying much of the city in silt and sand.  Now a UNESCO World Heritage site.\n*Memphis, Egypt – Administrative capital of ancient Egypt. Little remains.  Now a UNESCO World Heritage site.\n*Pi-Ramesses, Egypt – Imperial city of Rameses the Great, now thought to exist beneath Quantir\n*Tanis, Egypt – Capital during the 21st and 22nd Dynasties, in the Delta region.\n*Timgad, Algeria – Roman city founded by the emperor Trajan around 100 CE, covered by the sand at 7th century.  Now a UNESCO World Heritage site.\n\nUncertain or Disputed\n\n*Lost City of the Kalahari – possibly invented\n\nUndiscovered\n\n*Itjtawy, Egypt – Capital during the 12th Dynasty. Exact location still unknown, but it is believed to lie near the modern town of el-Lisht.\n*Thinis, Egypt – Undiscovered city and centre of the Thinite Confederacy, the leader of which, Menes, united Upper and Lower Egypt and was the first pharaoh.\n\nAsia\n\nCentral Asia\n\nRediscovered\n\n*Karakorum – Capital of Genghis Khan.\n*Loulan – Located in the Taklamakan Desert, on the ancient Silk Road route.\n*Mangazeya, Siberia\n*Niya – Located in the Taklamakan Desert, on the ancient Silk Road route.\n*Old Urgench – capital of Khwarezm.  Now a UNESCO World Heritage site.\n*Otrar – City located along the Silk Road, important in the history of Central Asia.\n*Sarai – Capital of the Golden Horde\n*Subashi – Located in the Taklamakan Desert, on the ancient Silk Road route.[http://alumnus.caltech.edu/~pamlogan/silkroad/index.html Lost Cities of the Silk Road]\n\nUndiscovered\n\n*Abaskun – Medieval Caspian Sea trading port\n*Atil, Tmutarakan, Sarai Berke – Capitals of the steppe peoples.\n*Balanjar – Earlier Khazar capital\n*Turquoise Mountain – Capital of Afghanistan, destroyed 1220\n\nFar East Asia\n\nRediscovered\n\n*Xanadu – China  Now a UNESCO World Heritage site.\n\nUncertain or Disputed\n\n*Yamatai – Japan\n\nSouth Asia\n\nIndia\n\nRediscovered\n\n*Dholavira – Located in Gujarat, India. City of the Indus Valley Civilization.\n*Dvārakā – Ancient city of Krishna, hero of the Mahabharata. Now largely excavated. Off the coast of the Indian state of Gujarat.\n*Kalibangan – Located in Rajasthan, India – early city of the Indus Valley Civilization.\n*Lothal – Located in Gujarat, India – early city of the Indus Valley Civilization.\n*Pattadakal – Located in Karnataka, South India.  Now a UNESCO World Heritage site.\n*Poompuhar – Located in Tamil Nadu, South India.\n*Rakhigarhi – Located in Haryana, largest Indus Valley Civilization site, dating back to 4600 BCE.\n*Surkotada – Located in Gujarat, India – early city of the Indus Valley Civilization.\n*Vasai – Located in India, former capital (1533–1740) of the Northern Provinces of Portuguese India\n*Vijayanagar – Located in Karnataka, India.  Now a UNESCO World Heritage site.\n\nUndiscovered\n\n*Muziris – Located near Cranganore, Kerala, southern India\n\nNepal\n\n*Lumbini – Located in Rupandehi district, birthplace of Gautam Buddha. Now a UNESCO World Heritage site.\n*Sinja Valley – Located in Jumla district, capital city of medieval Khasa kingdom and origin of Khas (Nepali) language. Now a UNESCO World Heritage site.\n\nPakistan\n\nRediscovered\n\n*Harappa – Located in Punjab, Pakistan – early city of the Indus Valley Civilization\n*Kot Diji – Located in Pakistan's Sindh province Indus Valley Civilization city\n*Mehrgarh – Located in Pakistan's Baluchistan province Indus Valley Civilization city\n*Mohenjo-Daro – Located in Pakistan Sindh — early city of the Indus Valley Civilization, the city was one of the early urban settlements in the world.  Now a UNESCO World Heritage site.\n*Taxila – Located in Pakistan's Punjab province\n\nSri Lanka\n\nRediscovered\n\n*Anuradhapura – Now a UNESCO World Heritage site.\n*Sigiriya – Now a UNESCO World Heritage site.\n*Polonnaruwa – Now a UNESCO World Heritage site.\n\nSoutheast Asia\n\nRediscovered\n\n*Angkor and surroundings.[https://www.independent.co.uk/news/world/asia/metropolis-angkor-the-worlds-first-megacity-461623.html Metropolis: Angkor, the world's first mega-city] – Now a UNESCO World Heritage site.\n*Ayutthaya – Now a UNESCO World Heritage site.\n*Mahendraparvata\n*Sukhothai – Now a UNESCO World Heritage site.\n\nUndiscovered\n\n*Gangga Negara – Malaysia (Malay Archipelago)\n\nUncertain or Disputed\n\n*Kota Gelanggi – Malaysia (Malay Archipelago)\n*Ma-i – Philippines – was a sovereign polity that pre-dated the Hispanic establishment of the Philippines and notable for having established trade relations with the Kingdom of Brunei, and with Song and Ming Dynasty China. Its existence was recorded both in the Chinese Imperial annals Zhu Fan Zhi (諸番志) and History of Song\n\nWestern Asia/Middle East\n\nRediscovered\n\n*Ani – Medieval Armenian capital, located on the Turkish side of the Armenia-Turkey border.\n*Antioch – Ancient Greek city, important stronghold in the time of the Crusades.\n*Babylon\n*Çatalhöyük – A Neolithic and Chalcolithic settlement, located near the modern city of Konya, Turkey.\n*Choqa Zanbil\n*Ctesiphon\n*Gobekli Tepe\n*Kourion, Cyprus\n*Hattusa – Capital of the Hittite Empire. Located near the modern village of Boğazköy in north-central Turkey.\n*Kish\n*Lagash\n*Mada'in Saleh (and capitol Petra) – Now a UNESCO World Heritage site.\n*Nineveh\n*Persepolis\n*Samaria\n*Troy\n*Ur\n\nUndiscovered\n\n*Akkad\n*Arimathea\n*Dilmun\n*Washukanni  the capital of the Hurrian kingdom of Mitanni, its precise location is unknown. A proposal locates it under the  unexcavated mound of Tell el Fakhariya.\n\nStatus Unknown\n\n*Narbata – Hebrew : נרבתא. Jewish city in The Great Revolt.\n\nEurope\n\nAustria\n\n*Noreia – the capital of the ancient Celtic kingdom of Noricum. Possibly in southern Austria or Slovenia.\n\nBosnia and Herzegovina\n\n*Daorson – the capital of ancient Hellenic community in present-day Bosnia and Herzegovina.\n\nBulgaria\n\n*Perperikon in Bulgaria – The megalith complex had been laid in ruins and re-erected many times in history – from the Bronze Age until Middle Ages.\n*Seuthopolis, Bulgaria – an ancient Thracian city, discovered and excavated in 1948. It was founded by king Seuthes III around 325 BC. Its ruins are now located at the bottom of the Koprinka Reservoir near the city of Kazanlak.\n\nCroatia\n\n*Heraclea somewhere in the Adriatic on the Croatian coast. Exact location unknown.\n\nFinland\n\n*Teljä, Finland\n\nFrance\n\n*Quentovic – In 842, the ancient port of Quentovicus was destroyed by a Viking fleet.\n*Thérouanne – In 1553, the city was razed, the roads broken up and the fields ploughed and salted by command of Charles V.\n\nGermany\n\n*Damasia – An ancient hill-top settlement on the Lech, of the Licates, a tribe of the Celtic Vindelici. Commonly identified with either the Auerberg or pre-Roman Augsburg. According to folklore, sunken into the Ammersee.\n*Hedeby, Germany\n*Rungholt – Wadden Sea in Germany, sunken during the \"Grote Mandrenke\", a storm surge in the North Sea on January 16, 1362\n*Niedam near Rungholt\n\nGreece\n\n*Akrotiri – On the island of Thera, Greece.\n*Chryse Island in the Aegean, reputed site of an ancient temple still visible on the sea floor.\n*Helike, Greece on the Peloponnese – Sunk by an earthquake in the 4th century BC and rediscovered in the 1990s.\n*Mycenae, Greece\n*Pavlopetri, Greece underwater off the coast of southern Laconia in Peloponnese, is about 5,000 years old, and is the oldest submerged archeological town site.\n\nHungary\n\n*Avar Ring, Hungary – Central stronghold of the Avars, it is believed to have been in the wide plain between the Danube and the Tisza.[http://www.mainlesson.com/display.php?authormorris&book\nfrench&story=avars Charlemagne and the Avars]\n\nItaly\n\n*Acerrae Vatriae – a town of the Sarranates mentioned by Pliny the elder as having been situated in an unknown location in Umbria.\n*Luni, Italy\n*Paestum – Greek and Roman city south of Naples, abandoned due to climate change. Three famous Greek temples.\n*Pompeii, Herculaneum and Stabia in Italy – buried by the eruption of Vesuvius in 79 AD and rediscovered in the 18th century\n*Sybaris, Italy – Ancient Greek colonial city of unsurpassed wealth utterly destroyed by its arch-rival Crotona in 510 BC.\n\nLithuania\n\n*Apuolė\n\nNetherlands\n\n*Brittenburg, ancient Roman settlement, Netherlands\n*Dorestad, Netherlands\n*Reimerswaal, Netherlands – flooded in the 16th century.\n*Saeftinghe, Netherlands – prosperous city lost to the sea in 1584.\n\nNorway\n\n*Kaupang – In Viksfjord near Larvik, Norway. Largest trading city around the Oslo Fjord during the Viking age. As sea levels retreated (the shoreline is 7m lower today than in 1000) the city was no longer accessible from the ocean and was abandoned.\n\nPoland\n\n*Biskupin\n*Truso\n\nPortugal\n\n*Conímbriga, Portugal – early trading post dating to the 9th century BC. Abandoned in the 8th century AD.Conímbriga\n\nRomania\n\n*Vicina, a port on the Danube, near the Delta.\n\nRussia\n\n*Alaborg – Varyagian fort mentioned in the Norse sagas.\n*Ilimsk was a small town in Siberia. Flooded by the Ust-Ilimsk Reservoir in the mid-1970s.\n*Kitezh – Mythical city beneath the waters in central Russia.\n*Lyubutsk was a Russian fortress, first mentioned in 1372.\n*Peremyshl – town that was founded in 1152.\n*Rurikovo Gorodische is a settlement, an archaeological site of the 9th century, in Veliky Novgorod.\n*Tmutarakan was a trading town of Rus' Khaganate\n\nSerbia\n\n*Stari Ras, Serbia – one of the first capitals of the medieval Serbian state of Raška, abandoned in the 13th century.\n\nSlovakia\n\n*Myšia Hôrka (near Spišský Štvrtok), Slovakia – 3500 years old town (rediscovered in the 20th century) and archaeological site, complex is called also Slovak Mycenae.\n*Wogastisburg (Wogastisburc), where in 631 Slav warriors under Samo defeated the Frankish forces of King Dagobert I, was a fortress of the Samo's Empire (the first Slavic state). The location of this site remains obscure.\n\nSpain\n\n*Amaya – mentioned by Barro, it was either the capital or one of the most important cities of the Cantabri. Probably located in what nowadays is called \"Amaya Peak\" in Burgos, northern Spain.\n*Cypsela, drowned Ibero-Greek settlement in the Catalan shore, Spain. Mentioned by Greek, Roman and Medieval chroniclers.\n*Reccopolis, Spain – One of the capital cities founded in Hispania by the Visigoths. The site was incrementally abandoned in the 10th century.\n*Tartessos, Spain- A harbor city or an economical complex of small harbors and trade routes set on the mouth of the Guadalquivir river, in modern Andalusia, Spain. Tartessos is believed to be either the seat of an independent kingdom or a community of palacial cities devoted to exporting the mineral resources of the Hispanic mainland to the sea, to meet the Phoenician and Greek traders. Its destruction is still a matter of debate among historians, and one modern tendency tends to believe that Tartessos was never a city, but a culture complex.\n\nSweden\n\n*Birka, Sweden\n*Ny Varberg, Sweden\n*Uppåkra, Sweden\n\nUnited Kingdom\n\n*Calleva Atrebatum, Silchester, England – Large Romano-British walled city 10 mi south of present-day Reading, Berkshire. Just the walls remain and a street pattern can be discerned from the air.\n*Dunwich, England – Lost to coastal erosion. Once a large town, now reduced to a small village\n*Newtown, Isle of Wight – formerly an important seaport, the settlement has been reduced to a small hamlet over time since the 17th century after interest shifted to Newport, a more easily defended settlement that has since become the county town.\n*Evonium, Scotland – purported coronation site and capital of 40 kings\n*Hampton-on-Sea, England – A drowned and abandoned village in what is now the Hampton area of Herne Bay, Kent.\n*Nant Gwrtheyrn former village on the North Welsh coast, abandoned after its quarry closed. Now regenerated as a language centre.\n*Old Sarum, England – population moved to nearby Salisbury although the owners of the archaeological site retained the right to elect a Member of Parliament to represent Old Sarum until the 19th century (see William Pitt).\n*Roxburgh, Scotland – abandoned in the 15th century\n*Selsey, England – mostly abandoned to coastal erosion after 1043.\n*Skara Brae, Orkney, Scotland – Neolithic settlement buried under sediment. Uncovered by a winter storm in 1850.\n*Trellech, Wales\n*Winchelsea, East Sussex – Old Winchelsea, Important Channel port, pop 4000+, abandoned after 1287 inundation and coastal erosion. Modern Winchelsea, 2 mi inland, was built to replace it as a planned town by Edward I of England\n\nUkraine\n\n*Bolokhiv, Ukraine abandoned in the 13th century.\n\nNorth America\n\nCanada\n\nRediscovered\n\n*L'Anse aux Meadows – Viking settlement founded around 1000.  Now a UNESCO World Heritage site.\n*Lost Villages – The Lost Villages are ten communities (Aultsville, Dickinson's Landing, Farran's Point, Maple Grove, Mille Roches, Moulinette, Santa Cruz, Sheek's Island, Wales, Woodlands) in the Canadian province of Ontario, in the former townships of Cornwall and Osnabruck (now South Stormont) near Cornwall, which were permanently submerged by the creation of the St. Lawrence Seaway in 1958.\n\nCaribbean\n\nRediscovered\n\n*Port Royal, Jamaica – Destroyed by the 1692 Jamaica earthquake.\n\nMexico and Central America\n\nMaya cities\n\nIncomplete list – for further information, see Maya civilization\n\nRediscovered\n\n*Calakmul – One of two superpowers in the classic Maya period.  Now a UNESCO World Heritage site.\n*Chichen Itza – This ancient place of pilgrimage is still the most visited Maya ruin.  Now a UNESCO World Heritage site.\n*Coba\n*Copán – In modern Honduras.  Now a UNESCO World Heritage site.\n*Naachtun – Rediscovered in 1922, it remains one of the most remote and least visited Maya sites. Located 44 km south-south-east of Calakmul, and 65 km north of Tikal, it is believed to have had strategic importance to, and been vulnerable to military attacks by, both neighbours. Its ancient name was identified in the mid-1990s as Masuul.\n*Palenque — in the Mexican state of Chiapas, known for its beautiful art and architecture.  Now a UNESCO World Heritage site.\n*Tikal — One of two superpowers in the classic Maya period.  Now a UNESCO World Heritage site.\n*Tulum – Mayan coastal city.\n\nOlmec cities\n\nRediscovered\n\n*La Venta – In the present day Mexican state of Tabasco.\n*San Lorenzo Tenochtitlán – In the present day Mexican state of Veracruz.\n\nTotonac  Cities\n\nRediscovered\n\n*Teotihuacan – Pre-Aztec Mexico.[http://www.metmuseum.org/toah/hd/teot/hd_teot.htm Teotihuacan], The Metropolitan Museum of Art  Now a UNESCO World Heritage site.\n\nOther\n\nRediscovered\n\n*La Ciudad Blanca – In Eastern Honduras. long thought mythical, existence confirmed in 2015.\n*Hueyatlaco – Oldest city in Mexico.\n*Izapa – Chief city of the Izapa civilization, whose territory extended from the Gulf Coast across to the Pacific Coast of Chiapas, in present-day Mexico, and Guatemala.\n*Guayabo – In Costa Rica  It is believed that the site was inhabited from 1500 BCE to 1400 CE, and had at its peak a population of around 10,000.\n\nUnited States\n\nRediscovered\n\n*The cities of the Ancestral Pueblo (or Anasazi) culture, located in the Four Corners region of the Southwest United States – The best known are located at Chaco Canyon and Mesa Verde.\n*Bethel Indian Town, New Jersey – Lenape settlement which has disappeared as the Lenape migrated west.\n*Cahokia – Located near present-day St. Louis, Missouri. At its height Cahokia is believed to have had a population of between 40,000 and 80,000 people, making it amongst the largest Pre-Columbian cities of the Americas. It is known chiefly for its huge pyramidal mounds of compacted earth.  Now a UNESCO World Heritage site.\n*Pueblo Grande de Nevada a complex of villages, located near Overton, Nevada\n*Roanoke Colony\n\nSouth America\n\nInca cities\n\nRediscovered\n\n*Choquequirao – Considered to be the last bastion of Incan resistance against the Spaniards and refuge of Manco Inca Yupanqui.\n*Machu Picchu – Possibly Pachacuti's Family Palace.  Now a UNESCO World Heritage site.\n*Vilcabamba – Currently known as Espiritu pampa.\n\nOther\n\nRediscovered\n\n*Cahuachi – Nazca, in present-day Peru.\n*Caral – An important center of the Norte Chico civilization, in present-day Peru.  Now a UNESCO World Heritage site.\n*Chan Chan – Chimu. Located near Trujillo, in present-day Peru.  Now a UNESCO World Heritage site.\n*Kuelap – A massive ruined city still covered in jungle that was the capital of the Chachapoyas culture in Northern Peru.[http://www.news.com.au/travel/story/0,28318,24750678-5014090,00.html Amazon jungle gives up lost city of the 'Cloud People'], News.com.au\n*Teyuna (Ciudad Perdida) located in present-day Colombia\n*Tiahuanaco – pre-Inca. Located in present-day Bolivia.  Now a UNESCO World Heritage site.\n\nStatus Unknown\n\n*Santa María la Antigua del Darién – First permanent European settlement in the mainland of the continental Americas, in the Darién region between Panama and Colombia. Founded by Vasco Núñez de Balboa in 1510.\n* La Ciudad Blanca",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lost city" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18020" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A lost city is a settlement that fell into terminal decline and became extensively or completely uninhabited, with the consequence that the site's former significance was no longer known to the wider world. The locations of many lost cities have been forgotten, but some have been rediscovered and studied extensively by scientists. Recently abandoned cities or cities whose location was never in question might be referred to as ruins or ghost towns. The search for such lost cities by European explorers and adventurers in Africa, the Americas, and Southeast Asia from the 15th century onwards eventually led to the development of archaeology.\n\nLost cities generally fall into two broad categories: those where all knowledge of the city's existence was forgotten before it was rediscovered, and those whose memory was preserved in myth, legend, or historical records but whose location was lost or at least no longer widely recognized.\n\nHow cities are lost\n\nCities may become lost for a variety of reasons including natural disasters, economic or social upheaval, or war.\n\nThe Incan capital city of Vilcabamba was destroyed and depopulated during the Spanish conquest of Peru in 1572. The Spanish did not rebuild the city, and the location went unrecorded and was forgotten until it was rediscovered through a detailed examination of period letters and documents.\n\nTroy was a city located in northwest Anatolia in what is now Turkey. It is best known for being the focus of the Trojan War described in the Greek Epic Cycle and especially in the Iliad, one of the two epic poems attributed to Homer. Repeatedly destroyed and rebuilt, the city slowly declined and was abandoned in the Byzantine era. Buried by time, the city was consigned to the realm of legend until the location was first excavated in the 1860s.\n\nOther settlements are lost with few or no clues to their decline. For example, Malden Island, in the central Pacific, was deserted when first visited by Europeans in 1825, but the unsuspected presence of ruined temples and the remains of other structures found on the island indicate that a population of Polynesians had lived there for perhaps several generations some centuries earlier. Prolonged drought seems the most likely explanation for their demise and the remote nature of the island meant few visitors.\n\nRediscovery\n\nWith the development of archaeology and the application of modern techniques, many previously lost cities have been rediscovered.\n\nMachu Picchu is a pre-Columbian Inca site situated on a mountain ridge above the Urubamba Valley in Peru. Often referred to as the \"Lost City of the Incas\", it is perhaps the most familiar icon of the Inca World. Machu Picchu was built around 1450, at the height of the Inca Empire. It was abandoned just over 100 years later, in 1572, as a belated result of the Spanish Conquest. It is possible that most of its inhabitants died from smallpox introduced by travelers before the Spanish conquistadors arrived in the area. In 1911, Melchor Arteaga led the explorer Hiram Bingham to Machu Picchu, which had been largely forgotten by everybody except the small number of people living in the immediate valley.\n\nHelike was an ancient Greek city that sank at night in the winter of 373 BCE. The city was located in Achaea, Northern Peloponnesos, two kilometres (12 stadia) from the Corinthian Gulf. The city was thought to be legend until 2001, when it was rediscovered in the Helike Delta. In 1988, the Greek archaeologist Dora Katsonopoulou launched the Helike Project to locate the site of the lost city. In 1994, in collaboration with the University of Patras, a magnetometer survey was carried out in the midplain of the delta, which revealed the outlines of a buried building. In 1995, this target was excavated (now known as the Klonis site), and a large Roman building with standing walls was brought to light. The city was rediscovered in 2001, buried in an ancient lagoon.\n\nLegends\n\nSome cities which are considered lost are (or may be) places of legend.\n*Ai – important city in the Hebrew Bible\n*Arthurian Camelot\n*Atlantis\n*Aztlán- the ancestral homeland in Aztec mythology\n*Ciudad de los Cesares (City of the Caesars, also variously known as City of the Patagonia, Elelín, Lin Lin, Trapalanda, Trapananda, or Wandering City) – a legendary city in Patagonia, never found\n*Dvārakā – An ancient city of Krishna, submerged in the sea. \n*El Dorado\n*Iram of the Pillars – this may refer to a lost Arabian city in the Empty Quarter, but sources also identify it as a tribe or an area mentioned in the Quran\n*Kitezh, Russia – legendary underwater city which supposedly may be seen in good weather\n*Lost City of Z – a city allegedly located in the jungles of the Mato Grosso region of Brazil, said to have been seen by the British explorer Col. Percy Harrison Fawcett some time before World War I\n*Lyonesse\n*Otuken – legendary capital city of Gokturks in Turkic mythology\n*Paititi – a legendary city and refuge in the rainforests where Bolivia, Brazil, and Peru meet\n*The Seven Cities of Gold\n*Shambhala – Mythical kingdom said to be located in Tibet \n*Sodom and Gomorrah\n*Vineta – legendary city somewhere at the Baltic coast of Germany or Poland\n*Ys – legendary city on the western coast of France\n\nOther lost cities, having once been considered legendary, are now known to have existed, such as Troy and Bjarmaland.\n\nLost cities by continent\n\nAfrica\n\nRediscovered\n\n*Akhetaten, Egypt – Capital during the reign of 18th Dynasty pharaoh Akhenaten. Later abandoned and almost totally destroyed. Modern day el Amarna.\n*Aoudaghost, Mauritania – Wealthy Berber city in medieval Ghana.\n*Avaris – capital city of the Hyksos in the Nile Delta.\n*Canopus, Egypt – Located on the now-dry Canopic branch of the Nile, east of Alexandria.\n*Carthage – Initially a Phoenician city, destroyed and then rebuilt by Rome. Later served as the capital of the Vandal Kingdom of North Africa, before being destroyed by the Arabs after its capture in 697 CE.  Now a UNESCO World Heritage site.\n*Dougga, Tunisia – Roman city located in present-day Tunisia.  Now a UNESCO World Heritage site.\n*Great Zimbabwe – Built between the 11th and the 14th century, this city is the namesake of modern-day Zimbabwe.  Now a UNESCO World Heritage site.\n*Leptis Magna – Roman city located in present-day Libya. It was the birthplace of Emperor Septimius Severus, who lavished an extensive public works programme on the city, including diverting the course of a nearby river. The river later returned to its original course, burying much of the city in silt and sand.  Now a UNESCO World Heritage site.\n*Memphis, Egypt – Administrative capital of ancient Egypt. Little remains.  Now a UNESCO World Heritage site.\n*Pi-Ramesses, Egypt – Imperial city of Rameses the Great, now thought to exist beneath Quantir\n*Tanis, Egypt – Capital during the 21st and 22nd Dynasties, in the Delta region.\n*Timgad, Algeria – Roman city founded by the emperor Trajan around 100 CE, covered by the sand at 7th century.  Now a UNESCO World Heritage site.\n\nUncertain or Disputed\n\n*Lost City of the Kalahari – possibly invented\n\nUndiscovered\n\n*Itjtawy, Egypt – Capital during the 12th Dynasty. Exact location still unknown, but it is believed to lie near the modern town of el-Lisht.\n*Thinis, Egypt – Undiscovered city and centre of the Thinite Confederacy, the leader of which, Menes, united Upper and Lower Egypt and was the first pharaoh.\n\nAsia\n\nCentral Asia\n\nRediscovered\n\n*Karakorum – Capital of Genghis Khan.\n*Loulan – Located in the Taklamakan Desert, on the ancient Silk Road route.\n*Mangazeya, Siberia\n*Niya – Located in the Taklamakan Desert, on the ancient Silk Road route.\n*Old Urgench – capital of Khwarezm.  Now a UNESCO World Heritage site.\n*Otrar – City located along the Silk Road, important in the history of Central Asia.\n*Sarai – Capital of the Golden Horde\n*Subashi – Located in the Taklamakan Desert, on the ancient Silk Road route.[http://alumnus.caltech.edu/~pamlogan/silkroad/index.html Lost Cities of the Silk Road]\n\nUndiscovered\n\n*Abaskun – Medieval Caspian Sea trading port\n*Atil, Tmutarakan, Sarai Berke – Capitals of the steppe peoples.\n*Balanjar – Earlier Khazar capital\n*Turquoise Mountain – Capital of Afghanistan, destroyed 1220\n\nFar East Asia\n\nRediscovered\n\n*Xanadu – China  Now a UNESCO World Heritage site.\n\nUncertain or Disputed\n\n*Yamatai – Japan\n\nSouth Asia\n\nIndia\n\nRediscovered\n\n*Dholavira – Located in Gujarat, India. City of the Indus Valley Civilization.\n*Dvārakā – Ancient city of Krishna, hero of the Mahabharata. Now largely excavated. Off the coast of the Indian state of Gujarat.\n*Kalibangan – Located in Rajasthan, India – early city of the Indus Valley Civilization.\n*Lothal – Located in Gujarat, India – early city of the Indus Valley Civilization.\n*Pattadakal – Located in Karnataka, South India.  Now a UNESCO World Heritage site.\n*Poompuhar – Located in Tamil Nadu, South India.\n*Rakhigarhi – Located in Haryana, largest Indus Valley Civilization site, dating back to 4600 BCE.\n*Surkotada – Located in Gujarat, India – early city of the Indus Valley Civilization.\n*Vasai – Located in India, former capital (1533–1740) of the Northern Provinces of Portuguese India\n*Vijayanagar – Located in Karnataka, India.  Now a UNESCO World Heritage site.\n\nUndiscovered\n\n*Muziris – Located near Cranganore, Kerala, southern India\n\nNepal\n\n*Lumbini – Located in Rupandehi district, birthplace of Gautam Buddha. Now a UNESCO World Heritage site.\n*Sinja Valley – Located in Jumla district, capital city of medieval Khasa kingdom and origin of Khas (Nepali) language. Now a UNESCO World Heritage site.\n\nPakistan\n\nRediscovered\n\n*Harappa – Located in Punjab, Pakistan – early city of the Indus Valley Civilization\n*Kot Diji – Located in Pakistan's Sindh province Indus Valley Civilization city\n*Mehrgarh – Located in Pakistan's Baluchistan province Indus Valley Civilization city\n*Mohenjo-Daro – Located in Pakistan Sindh — early city of the Indus Valley Civilization, the city was one of the early urban settlements in the world.  Now a UNESCO World Heritage site.\n*Taxila – Located in Pakistan's Punjab province\n\nSri Lanka\n\nRediscovered\n\n*Anuradhapura – Now a UNESCO World Heritage site.\n*Sigiriya – Now a UNESCO World Heritage site.\n*Polonnaruwa – Now a UNESCO World Heritage site.\n\nSoutheast Asia\n\nRediscovered\n\n*Angkor and surroundings.[https://www.independent.co.uk/news/world/asia/metropolis-angkor-the-worlds-first-megacity-461623.html Metropolis: Angkor, the world's first mega-city] – Now a UNESCO World Heritage site.\n*Ayutthaya – Now a UNESCO World Heritage site.\n*Mahendraparvata\n*Sukhothai – Now a UNESCO World Heritage site.\n\nUndiscovered\n\n*Gangga Negara – Malaysia (Malay Archipelago)\n\nUncertain or Disputed\n\n*Kota Gelanggi – Malaysia (Malay Archipelago)\n*Ma-i – Philippines – was a sovereign polity that pre-dated the Hispanic establishment of the Philippines and notable for having established trade relations with the Kingdom of Brunei, and with Song and Ming Dynasty China. Its existence was recorded both in the Chinese Imperial annals Zhu Fan Zhi (諸番志) and History of Song\n\nWestern Asia/Middle East\n\nRediscovered\n\n*Ani – Medieval Armenian capital, located on the Turkish side of the Armenia-Turkey border.\n*Antioch – Ancient Greek city, important stronghold in the time of the Crusades.\n*Babylon\n*Çatalhöyük – A Neolithic and Chalcolithic settlement, located near the modern city of Konya, Turkey.\n*Choqa Zanbil\n*Ctesiphon\n*Gobekli Tepe\n*Kourion, Cyprus\n*Hattusa – Capital of the Hittite Empire. Located near the modern village of Boğazköy in north-central Turkey.\n*Kish\n*Lagash\n*Mada'in Saleh (and capitol Petra) – Now a UNESCO World Heritage site.\n*Nineveh\n*Persepolis\n*Samaria\n*Troy\n*Ur\n\nUndiscovered\n\n*Akkad\n*Arimathea\n*Dilmun\n*Washukanni  the capital of the Hurrian kingdom of Mitanni, its precise location is unknown. A proposal locates it under the  unexcavated mound of Tell el Fakhariya.\n\nStatus Unknown\n\n*Narbata – Hebrew : נרבתא. Jewish city in The Great Revolt.\n\nEurope\n\nAustria\n\n*Noreia – the capital of the ancient Celtic kingdom of Noricum. Possibly in southern Austria or Slovenia.\n\nBosnia and Herzegovina\n\n*Daorson – the capital of ancient Hellenic community in present-day Bosnia and Herzegovina.\n\nBulgaria\n\n*Perperikon in Bulgaria – The megalith complex had been laid in ruins and re-erected many times in history – from the Bronze Age until Middle Ages.\n*Seuthopolis, Bulgaria – an ancient Thracian city, discovered and excavated in 1948. It was founded by king Seuthes III around 325 BC. Its ruins are now located at the bottom of the Koprinka Reservoir near the city of Kazanlak.\n\nCroatia\n\n*Heraclea somewhere in the Adriatic on the Croatian coast. Exact location unknown.\n\nFinland\n\n*Teljä, Finland\n\nFrance\n\n*Quentovic – In 842, the ancient port of Quentovicus was destroyed by a Viking fleet.\n*Thérouanne – In 1553, the city was razed, the roads broken up and the fields ploughed and salted by command of Charles V.\n\nGermany\n\n*Damasia – An ancient hill-top settlement on the Lech, of the Licates, a tribe of the Celtic Vindelici. Commonly identified with either the Auerberg or pre-Roman Augsburg. According to folklore, sunken into the Ammersee.\n*Hedeby, Germany\n*Rungholt – Wadden Sea in Germany, sunken during the \"Grote Mandrenke\", a storm surge in the North Sea on January 16, 1362\n*Niedam near Rungholt\n\nGreece\n\n*Akrotiri – On the island of Thera, Greece.\n*Chryse Island in the Aegean, reputed site of an ancient temple still visible on the sea floor.\n*Helike, Greece on the Peloponnese – Sunk by an earthquake in the 4th century BC and rediscovered in the 1990s.\n*Mycenae, Greece\n*Pavlopetri, Greece underwater off the coast of southern Laconia in Peloponnese, is about 5,000 years old, and is the oldest submerged archeological town site.\n\nHungary\n\n*Avar Ring, Hungary – Central stronghold of the Avars, it is believed to have been in the wide plain between the Danube and the Tisza.[http://www.mainlesson.com/display.php?authormorris&book\nfrench&story=avars Charlemagne and the Avars]\n\nItaly\n\n*Acerrae Vatriae – a town of the Sarranates mentioned by Pliny the elder as having been situated in an unknown location in Umbria.\n*Luni, Italy\n*Paestum – Greek and Roman city south of Naples, abandoned due to climate change. Three famous Greek temples.\n*Pompeii, Herculaneum and Stabia in Italy – buried by the eruption of Vesuvius in 79 AD and rediscovered in the 18th century\n*Sybaris, Italy – Ancient Greek colonial city of unsurpassed wealth utterly destroyed by its arch-rival Crotona in 510 BC.\n\nLithuania\n\n*Apuolė\n\nNetherlands\n\n*Brittenburg, ancient Roman settlement, Netherlands\n*Dorestad, Netherlands\n*Reimerswaal, Netherlands – flooded in the 16th century.\n*Saeftinghe, Netherlands – prosperous city lost to the sea in 1584.\n\nNorway\n\n*Kaupang – In Viksfjord near Larvik, Norway. Largest trading city around the Oslo Fjord during the Viking age. As sea levels retreated (the shoreline is 7m lower today than in 1000) the city was no longer accessible from the ocean and was abandoned.\n\nPoland\n\n*Biskupin\n*Truso\n\nPortugal\n\n*Conímbriga, Portugal – early trading post dating to the 9th century BC. Abandoned in the 8th century AD.Conímbriga\n\nRomania\n\n*Vicina, a port on the Danube, near the Delta.\n\nRussia\n\n*Alaborg – Varyagian fort mentioned in the Norse sagas.\n*Ilimsk was a small town in Siberia. Flooded by the Ust-Ilimsk Reservoir in the mid-1970s.\n*Kitezh – Mythical city beneath the waters in central Russia.\n*Lyubutsk was a Russian fortress, first mentioned in 1372.\n*Peremyshl – town that was founded in 1152.\n*Rurikovo Gorodische is a settlement, an archaeological site of the 9th century, in Veliky Novgorod.\n*Tmutarakan was a trading town of Rus' Khaganate\n\nSerbia\n\n*Stari Ras, Serbia – one of the first capitals of the medieval Serbian state of Raška, abandoned in the 13th century.\n\nSlovakia\n\n*Myšia Hôrka (near Spišský Štvrtok), Slovakia – 3500 years old town (rediscovered in the 20th century) and archaeological site, complex is called also Slovak Mycenae.\n*Wogastisburg (Wogastisburc), where in 631 Slav warriors under Samo defeated the Frankish forces of King Dagobert I, was a fortress of the Samo's Empire (the first Slavic state). The location of this site remains obscure.\n\nSpain\n\n*Amaya – mentioned by Barro, it was either the capital or one of the most important cities of the Cantabri. Probably located in what nowadays is called \"Amaya Peak\" in Burgos, northern Spain.\n*Cypsela, drowned Ibero-Greek settlement in the Catalan shore, Spain. Mentioned by Greek, Roman and Medieval chroniclers.\n*Reccopolis, Spain – One of the capital cities founded in Hispania by the Visigoths. The site was incrementally abandoned in the 10th century.\n*Tartessos, Spain- A harbor city or an economical complex of small harbors and trade routes set on the mouth of the Guadalquivir river, in modern Andalusia, Spain. Tartessos is believed to be either the seat of an independent kingdom or a community of palacial cities devoted to exporting the mineral resources of the Hispanic mainland to the sea, to meet the Phoenician and Greek traders. Its destruction is still a matter of debate among historians, and one modern tendency tends to believe that Tartessos was never a city, but a culture complex.\n\nSweden\n\n*Birka, Sweden\n*Ny Varberg, Sweden\n*Uppåkra, Sweden\n\nUnited Kingdom\n\n*Calleva Atrebatum, Silchester, England – Large Romano-British walled city 10 mi south of present-day Reading, Berkshire. Just the walls remain and a street pattern can be discerned from the air.\n*Dunwich, England – Lost to coastal erosion. Once a large town, now reduced to a small village\n*Newtown, Isle of Wight – formerly an important seaport, the settlement has been reduced to a small hamlet over time since the 17th century after interest shifted to Newport, a more easily defended settlement that has since become the county town.\n*Evonium, Scotland – purported coronation site and capital of 40 kings\n*Hampton-on-Sea, England – A drowned and abandoned village in what is now the Hampton area of Herne Bay, Kent.\n*Nant Gwrtheyrn former village on the North Welsh coast, abandoned after its quarry closed. Now regenerated as a language centre.\n*Old Sarum, England – population moved to nearby Salisbury although the owners of the archaeological site retained the right to elect a Member of Parliament to represent Old Sarum until the 19th century (see William Pitt).\n*Roxburgh, Scotland – abandoned in the 15th century\n*Selsey, England – mostly abandoned to coastal erosion after 1043.\n*Skara Brae, Orkney, Scotland – Neolithic settlement buried under sediment. Uncovered by a winter storm in 1850.\n*Trellech, Wales\n*Winchelsea, East Sussex – Old Winchelsea, Important Channel port, pop 4000+, abandoned after 1287 inundation and coastal erosion. Modern Winchelsea, 2 mi inland, was built to replace it as a planned town by Edward I of England\n\nUkraine\n\n*Bolokhiv, Ukraine abandoned in the 13th century.\n\nNorth America\n\nCanada\n\nRediscovered\n\n*L'Anse aux Meadows – Viking settlement founded around 1000.  Now a UNESCO World Heritage site.\n*Lost Villages – The Lost Villages are ten communities (Aultsville, Dickinson's Landing, Farran's Point, Maple Grove, Mille Roches, Moulinette, Santa Cruz, Sheek's Island, Wales, Woodlands) in the Canadian province of Ontario, in the former townships of Cornwall and Osnabruck (now South Stormont) near Cornwall, which were permanently submerged by the creation of the St. Lawrence Seaway in 1958.\n\nCaribbean\n\nRediscovered\n\n*Port Royal, Jamaica – Destroyed by the 1692 Jamaica earthquake.\n\nMexico and Central America\n\nMaya cities\n\nIncomplete list – for further information, see Maya civilization\n\nRediscovered\n\n*Calakmul – One of two superpowers in the classic Maya period.  Now a UNESCO World Heritage site.\n*Chichen Itza – This ancient place of pilgrimage is still the most visited Maya ruin.  Now a UNESCO World Heritage site.\n*Coba\n*Copán – In modern Honduras.  Now a UNESCO World Heritage site.\n*Naachtun – Rediscovered in 1922, it remains one of the most remote and least visited Maya sites. Located 44 km south-south-east of Calakmul, and 65 km north of Tikal, it is believed to have had strategic importance to, and been vulnerable to military attacks by, both neighbours. Its ancient name was identified in the mid-1990s as Masuul.\n*Palenque — in the Mexican state of Chiapas, known for its beautiful art and architecture.  Now a UNESCO World Heritage site.\n*Tikal — One of two superpowers in the classic Maya period.  Now a UNESCO World Heritage site.\n*Tulum – Mayan coastal city.\n\nOlmec cities\n\nRediscovered\n\n*La Venta – In the present day Mexican state of Tabasco.\n*San Lorenzo Tenochtitlán – In the present day Mexican state of Veracruz.\n\nTotonac  Cities\n\nRediscovered\n\n*Teotihuacan – Pre-Aztec Mexico.[http://www.metmuseum.org/toah/hd/teot/hd_teot.htm Teotihuacan], The Metropolitan Museum of Art  Now a UNESCO World Heritage site.\n\nOther\n\nRediscovered\n\n*La Ciudad Blanca – In Eastern Honduras. long thought mythical, existence confirmed in 2015.\n*Hueyatlaco – Oldest city in Mexico.\n*Izapa – Chief city of the Izapa civilization, whose territory extended from the Gulf Coast across to the Pacific Coast of Chiapas, in present-day Mexico, and Guatemala.\n*Guayabo – In Costa Rica  It is believed that the site was inhabited from 1500 BCE to 1400 CE, and had at its peak a population of around 10,000.\n\nUnited States\n\nRediscovered\n\n*The cities of the Ancestral Pueblo (or Anasazi) culture, located in the Four Corners region of the Southwest United States – The best known are located at Chaco Canyon and Mesa Verde.\n*Bethel Indian Town, New Jersey – Lenape settlement which has disappeared as the Lenape migrated west.\n*Cahokia – Located near present-day St. Louis, Missouri. At its height Cahokia is believed to have had a population of between 40,000 and 80,000 people, making it amongst the largest Pre-Columbian cities of the Americas. It is known chiefly for its huge pyramidal mounds of compacted earth.  Now a UNESCO World Heritage site.\n*Pueblo Grande de Nevada a complex of villages, located near Overton, Nevada\n*Roanoke Colony\n\nSouth America\n\nInca cities\n\nRediscovered\n\n*Choquequirao – Considered to be the last bastion of Incan resistance against the Spaniards and refuge of Manco Inca Yupanqui.\n*Machu Picchu – Possibly Pachacuti's Family Palace.  Now a UNESCO World Heritage site.\n*Vilcabamba – Currently known as Espiritu pampa.\n\nOther\n\nRediscovered\n\n*Cahuachi – Nazca, in present-day Peru.\n*Caral – An important center of the Norte Chico civilization, in present-day Peru.  Now a UNESCO World Heritage site.\n*Chan Chan – Chimu. Located near Trujillo, in present-day Peru.  Now a UNESCO World Heritage site.\n*Kuelap – A massive ruined city still covered in jungle that was the capital of the Chachapoyas culture in Northern Peru.[http://www.news.com.au/travel/story/0,28318,24750678-5014090,00.html Amazon jungle gives up lost city of the 'Cloud People'], News.com.au\n*Teyuna (Ciudad Perdida) located in present-day Colombia\n*Tiahuanaco – pre-Inca. Located in present-day Bolivia.  Now a UNESCO World Heritage site.\n\nStatus Unknown\n\n*Santa María la Antigua del Darién – First permanent European settlement in the mainland of the continental Americas, in the Darién region between Panama and Colombia. Founded by Vasco Núñez de Balboa in 1510.\n* La Ciudad Blanca. Lost city. http://en.wikipedia.org/?curid=18020."
  }
}
