{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17724",
  "eid" : "2d76d920-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778585522,
  "textBody" : "The Lighthouse of Alexandria, sometimes called the Pharos of Alexandria (; Ancient Greek: ὁ Φάρος τῆς Ἀλεξανδρείας, contemporary Koine), was a lighthouse built by the Ptolemaic Kingdom between 280 and 247 BC which has been estimated to be 100 metres in overall height. One of the Seven Wonders of the Ancient World, for many centuries it was one of the tallest man-made structures in the world. Badly damaged by three earthquakes between AD 956 and 1323, it then became an abandoned ruin. It was the third longest surviving ancient wonder (after the Mausoleum at Halicarnassus and the extant Great Pyramid of Giza), surviving in part until 1480, when the last of its remnant stones were used to build the Citadel of Qaitbay on the site. In 1994, French archaeologists discovered some remains of the lighthouse on the floor of Alexandria's Eastern Harbour. The Ministry of State of Antiquities in Egypt has planned, as of late 2015, to turn submerged ruins of ancient Alexandria, including those of the Pharos, into an underwater museum.\n\nOrigin\n\nPharos was a small island located on the western edge of the Nile Delta. In 332 BC Alexander the Great founded the city of Alexandria on an isthmus opposite Pharos. Alexandria and Pharos were later connected by a mole spanning more than 1200 metres (.75 mi), which was called the Heptastadion (\"seven stadia\"—a stadium was a Greek unit of length measuring approximately 180 m).\nThe east side of the mole became the Great Harbour, now an open bay; on the west side lay the port of Eunostos, with its inner basin Kibotos now vastly enlarged to form the modern harbour. Today's city development lying between the present Grand Square and the modern Ras el-Tin quarter is built on the silt which gradually widened and obliterated this mole, and the Ras el-Tin promontory represents all that is left of the island of Pharos, the site of the lighthouse at its eastern point having been weathered away by the sea.\n\nConstruction\n\nThe lighthouse was constructed in the 3rd century BC. After Alexander the Great died, the first Ptolemy (Ptolemy I Soter) announced himself king in 305 BC, and commissioned its construction shortly thereafter. The building was finished during the reign of his son, the second Ptolemy (Ptolemy II Philadelphus). It took twelve years to complete, at a total cost of 800 talents,Over twenty-three tons of silver. \"This was an enormous sum, a tenth of the treasury when Ptolemy I assumed the throne. (In comparison, the Parthenon is estimated to have cost at least 469 talents of silver.)\"[http://penelope.uchicago.edu/~grout/encyclopaedia_romana/greece/paganism/pharos.html] and served as a prototype for all later lighthouses in the world. The light was produced by a furnace at the top, and the tower was said to have been built mostly with solid blocks of limestone.\n\nStrabo reported that Sostratus had a dedication inscribed in metal letters to the \"Saviour Gods\". Later Pliny the Elder wrote that Sostratus was the architect, which is disputed. In the second century AD the satirist Lucian wrote that Sostratus inscribed his name under plaster bearing the name of Ptolemy. This was so that when the plaster with Ptolemy's name fell off, Sostratus's name would be visible in the stone.Lucian How to Write History, LXII\n\"After he [Sostratus] had built the work he wrote his name on the masonry inside, covered it with gypsum, and having hidden it inscribed the name of the reigning king. He knew, as actually happened, that in a very short time the letters would fall away with the plaster and there would be revealed: 'Sostratus of Cnidos, the son of Dexiphanes, to the Divine Saviours, for the sake of them that sail at sea.' Thus, not even he had regard for the immediate moment or his own brief life-time: he looked to our day and eternity, as long as the tower shall stand and his skill abide. History then should be written in that spirit, with truthfulness and an eye to future expectations rather than with adulation and a view to the pleasure of present praise.\"\n\nHeight and description\n\nJudith McKenzie writes that \"The Arab descriptions of the lighthouse are remarkably consistent, although it was repaired several times especially after earthquake damage. The height they give varies only fifteen per cent from c. 103 to, on a base c. 30 by square.\"\n\nThe fullest description of the lighthouse comes from Arab traveller Abou Haggag Youssef Ibn Mohammed el-Balawi el-Andaloussi, who visited Alexandria in A.D. 1166.Clayton & Price 1988, p. 153.\n\nThe Arab authors indicate that the lighthouse was constructed from large blocks of light-coloured stone, the tower was made up of three tapering tiers: a lower square section with a central core, a middle octagonal section, and, at the top, a circular section. At its apex was positioned a mirror which reflected sunlight during the day; a fire was lit at night. Extant Roman coins struck by the Alexandrian mint show that a statue of a Triton was positioned on each of the building's four corners. A statue of Poseidon or Zeus stood atop the lighthouse.Haas 1997, p. 144. The Pharos's masonry blocks were interlocked, sealed together using molten lead, to withstand the pounding of the waves.Beaver, Patrick (1971). A History of Lighthouses. London: Peter Davies Ltd, pp. 10–11. .\n\nAl-Masudi writes that the seaward-facing eastern side featured an inscription dedicated to Zeus.\n\nDestruction\n\nThe lighthouse was badly damaged in the earthquake of 956, and then again in 1303 and 1323. Finally the stubby remnant disappeared in 1480, when the then-Sultan of Egypt, Qaitbay, built a medieval fort on the larger platform of the lighthouse site using some of the fallen stone.\n\nThe 10th-century writer al-Mas'udi reports a legendary tale on the lighthouse's destruction, according to which at the time of Caliph Abd al-Malik ibn Marwan () the Byzantines sent a eunuch agent, who adopted Islam, gained the Caliph's confidence, and secured permission to search for hidden treasure at the base of the lighthouse. The search was cunningly made in such a manner that the foundations were undermined, and the Pharos collapsed. The agent managed to escape in a ship waiting for him.\n\nArchaeological research and rediscovery\n\nIn 1968 the lighthouse was rediscovered. UNESCO sponsored an expedition to send a team of marine archaeologists, led by Honor Frost, to the site. She confirmed the existence of the ruins representing part of the lighthouse. Due to the lack of specialized archaeologists and the area becoming a military zone, exploration was put on hold.Frost, H. (2000). From Byblos to Pharos: some archaeological considerations. In N. Grimal, M. H. Mostafa, & D. Nakashima (Authors), Underwater archaeology and coastal management: Focus on Alexandria (pp. 64-68). Paris: UNESCO.\n\nGreek archaeologists led by Jean-Yves Empereur re-discovered the physical remains of the lighthouse in late 1994 on the floor of Alexandria's Eastern Harbour. Some of these remains were brought up and were lying at the harbour on public view at the end of 1995.  Subsequent satellite imaging has revealed further remains. It is possible to go diving and see the ruins. The secretariat of the UNESCO Convention on the Protection of the Underwater Cultural Heritage are currently working with the Government of Egypt on an initiative to add the Bay of Alexandria (to include remains of the lighthouse) on a World Heritage List of submerged cultural sites.\n\nSignificance\n\nLegend has it that the people of the island of Pharos were wreckers; hence, Ptolemy I had the lighthouse built to help guide ships into port at night.Clayton, Price, & Price, Martin. (1988). The seven wonders of the ancient world. London ; New York: Routledge.\nPharos became the etymological origin of the word \"lighthouse\" in Greek (φάρος), Persian (Fānūs – فانوس), many Romance languages such as French (phare), Italian and Spanish (faro), Romanian (far) and Portuguese (farol), and even some Slavic languages like Bulgarian (far). In Russian, a derived word means \"headlight\" (fara – фара).\n\nIn 2008 it was suggested[http://www.dioi.org/vols/we0.pdf DIO volume 14] pages 3–12 and page 2 footnote. that the Pharos was the vertical yardstick used in the first precise measurement of the size of the earth.\n\nProposed reconstruction \n\nSince 1978 a number of proposals have been made to replace the lighthouse with a modern reconstruction. In 2015, the Egyptian government and the Alexandria governorate suggested building a skyscraper on the site of the lighthouse as part of the regeneration of the eastern harbour of Alexandria Port. The plan was opposed by Alexandria-based sociologist Amro Ali.\n\nPharos in culture\n\nThe lighthouse remains a civic symbol of the city of Alexandria and of the Alexandria Governorate with which the city is more or less coterminous. A stylised representation of the lighthouse appears on the flag and seal of the Governorate and on many public services of the city, including the seal of Alexandria University.\n\nIn architecture\n\n* A well-preserved ancient tomb in the town of Abusir, 48 km southwest of Alexandria, is thought to be a scaled-down model of the Alexandria Pharos. Known colloquially under various names – the Pharos of Abusir, the Abusir funerary monument and Burg al-Arab (Arab's Tower) – it consists of a 3-storey tower, approximately 20 m in height, with a square base, an octagonal midsection and cylindrical upper section, like the building upon which it was apparently modelled. It dates to the reign of Ptolemy II (285–246 BC), and is therefore likely to have been built at about the same time as the Alexandria Pharos.\n* The design of minarets in many early Egyptian Islamic mosques followed a similar three-stage design to that of the Pharos, attesting to the building's broader architectural influence.\n* The George Washington Masonic National Memorial, located in Alexandria, Virginia, is fashioned after the ancient Lighthouse.\"*Ferris, Gary W. Presidential Places: A Guide to the Historic Sites of U.S. Presidents. Winston-Salem, N.C.: J.F. Blair, 1999. p.21\"\n\nIn books\n\n*Julius Caesar, in his Civil Wars (Part III, 111–112), describes the Pharos and its strategic importance. Gaining control of the lighthouse helped him subdue Ptolemy XIII's armies (48 BC):\n*The Romano-Jewish historian Josephus (37 – c.100 AD) describes it in his book The Jewish War (4.10.5) when he gives a geographical overview of Egypt.\n*It was described in the Zhu fan zhi (\"Records of Foreign Peoples\") by Zhao Rugua (1170–1228), a Chinese customs inspector for the port city of Quanzhou during the Song dynasty.Needham, Joseph (1986). Science and Civilization in China: Volume 5, Physics and Physical Technology, Part 3: Civil Engineering and Nautics. Taipei: Caves Books, Ltd. Page 662.\n* In Robert Silverberg's science fiction novelette Sailing to Byzantium (1985), a culture of the far future recreates ancient cities, full with every detail, among them Alexandria; several episodes of Silverberg's story take place on the rebuilt Pharos.\n\nIn video games \n\n* The lighthouse was one of the Wonders of the World that could be built in the 1991 computer game Civilization by Sid Meier, giving a bonus to ship movement.\n* The lighthouse was featured in the action-adventure video game Assassins Creed Origins released on October 27, 2017. It is set in Ancient Egypt during the Ptolemaic period (48 BC). Ubisoft Montreal's research on Ancient Egypt was done with the help of French archaeologist and Egyptologist Jean-Claude Golvin.Nielsen, H. (2017, October 05). Assassin's Creed Origins: how Ubisoft painstakingly recreated ancient Egypt. Retrieved November 25, 2017, from https://www.theguardian.com/technology/2017/oct/05/assassins-creed-origins-recreated-ancient-egypt-ubisoft",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lighthouse of Alexandria" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17724" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Lighthouse of Alexandria, sometimes called the Pharos of Alexandria (; Ancient Greek: ὁ Φάρος τῆς Ἀλεξανδρείας, contemporary Koine), was a lighthouse built by the Ptolemaic Kingdom between 280 and 247 BC which has been estimated to be 100 metres in overall height. One of the Seven Wonders of the Ancient World, for many centuries it was one of the tallest man-made structures in the world. Badly damaged by three earthquakes between AD 956 and 1323, it then became an abandoned ruin. It was the third longest surviving ancient wonder (after the Mausoleum at Halicarnassus and the extant Great Pyramid of Giza), surviving in part until 1480, when the last of its remnant stones were used to build the Citadel of Qaitbay on the site. In 1994, French archaeologists discovered some remains of the lighthouse on the floor of Alexandria's Eastern Harbour. The Ministry of State of Antiquities in Egypt has planned, as of late 2015, to turn submerged ruins of ancient Alexandria, including those of the Pharos, into an underwater museum.\n\nOrigin\n\nPharos was a small island located on the western edge of the Nile Delta. In 332 BC Alexander the Great founded the city of Alexandria on an isthmus opposite Pharos. Alexandria and Pharos were later connected by a mole spanning more than 1200 metres (.75 mi), which was called the Heptastadion (\"seven stadia\"—a stadium was a Greek unit of length measuring approximately 180 m).\nThe east side of the mole became the Great Harbour, now an open bay; on the west side lay the port of Eunostos, with its inner basin Kibotos now vastly enlarged to form the modern harbour. Today's city development lying between the present Grand Square and the modern Ras el-Tin quarter is built on the silt which gradually widened and obliterated this mole, and the Ras el-Tin promontory represents all that is left of the island of Pharos, the site of the lighthouse at its eastern point having been weathered away by the sea.\n\nConstruction\n\nThe lighthouse was constructed in the 3rd century BC. After Alexander the Great died, the first Ptolemy (Ptolemy I Soter) announced himself king in 305 BC, and commissioned its construction shortly thereafter. The building was finished during the reign of his son, the second Ptolemy (Ptolemy II Philadelphus). It took twelve years to complete, at a total cost of 800 talents,Over twenty-three tons of silver. \"This was an enormous sum, a tenth of the treasury when Ptolemy I assumed the throne. (In comparison, the Parthenon is estimated to have cost at least 469 talents of silver.)\"[http://penelope.uchicago.edu/~grout/encyclopaedia_romana/greece/paganism/pharos.html] and served as a prototype for all later lighthouses in the world. The light was produced by a furnace at the top, and the tower was said to have been built mostly with solid blocks of limestone.\n\nStrabo reported that Sostratus had a dedication inscribed in metal letters to the \"Saviour Gods\". Later Pliny the Elder wrote that Sostratus was the architect, which is disputed. In the second century AD the satirist Lucian wrote that Sostratus inscribed his name under plaster bearing the name of Ptolemy. This was so that when the plaster with Ptolemy's name fell off, Sostratus's name would be visible in the stone.Lucian How to Write History, LXII\n\"After he [Sostratus] had built the work he wrote his name on the masonry inside, covered it with gypsum, and having hidden it inscribed the name of the reigning king. He knew, as actually happened, that in a very short time the letters would fall away with the plaster and there would be revealed: 'Sostratus of Cnidos, the son of Dexiphanes, to the Divine Saviours, for the sake of them that sail at sea.' Thus, not even he had regard for the immediate moment or his own brief life-time: he looked to our day and eternity, as long as the tower shall stand and his skill abide. History then should be written in that spirit, with truthfulness and an eye to future expectations rather than with adulation and a view to the pleasure of present praise.\"\n\nHeight and description\n\nJudith McKenzie writes that \"The Arab descriptions of the lighthouse are remarkably consistent, although it was repaired several times especially after earthquake damage. The height they give varies only fifteen per cent from c. 103 to, on a base c. 30 by square.\"\n\nThe fullest description of the lighthouse comes from Arab traveller Abou Haggag Youssef Ibn Mohammed el-Balawi el-Andaloussi, who visited Alexandria in A.D. 1166.Clayton & Price 1988, p. 153.\n\nThe Arab authors indicate that the lighthouse was constructed from large blocks of light-coloured stone, the tower was made up of three tapering tiers: a lower square section with a central core, a middle octagonal section, and, at the top, a circular section. At its apex was positioned a mirror which reflected sunlight during the day; a fire was lit at night. Extant Roman coins struck by the Alexandrian mint show that a statue of a Triton was positioned on each of the building's four corners. A statue of Poseidon or Zeus stood atop the lighthouse.Haas 1997, p. 144. The Pharos's masonry blocks were interlocked, sealed together using molten lead, to withstand the pounding of the waves.Beaver, Patrick (1971). A History of Lighthouses. London: Peter Davies Ltd, pp. 10–11. .\n\nAl-Masudi writes that the seaward-facing eastern side featured an inscription dedicated to Zeus.\n\nDestruction\n\nThe lighthouse was badly damaged in the earthquake of 956, and then again in 1303 and 1323. Finally the stubby remnant disappeared in 1480, when the then-Sultan of Egypt, Qaitbay, built a medieval fort on the larger platform of the lighthouse site using some of the fallen stone.\n\nThe 10th-century writer al-Mas'udi reports a legendary tale on the lighthouse's destruction, according to which at the time of Caliph Abd al-Malik ibn Marwan () the Byzantines sent a eunuch agent, who adopted Islam, gained the Caliph's confidence, and secured permission to search for hidden treasure at the base of the lighthouse. The search was cunningly made in such a manner that the foundations were undermined, and the Pharos collapsed. The agent managed to escape in a ship waiting for him.\n\nArchaeological research and rediscovery\n\nIn 1968 the lighthouse was rediscovered. UNESCO sponsored an expedition to send a team of marine archaeologists, led by Honor Frost, to the site. She confirmed the existence of the ruins representing part of the lighthouse. Due to the lack of specialized archaeologists and the area becoming a military zone, exploration was put on hold.Frost, H. (2000). From Byblos to Pharos: some archaeological considerations. In N. Grimal, M. H. Mostafa, & D. Nakashima (Authors), Underwater archaeology and coastal management: Focus on Alexandria (pp. 64-68). Paris: UNESCO.\n\nGreek archaeologists led by Jean-Yves Empereur re-discovered the physical remains of the lighthouse in late 1994 on the floor of Alexandria's Eastern Harbour. Some of these remains were brought up and were lying at the harbour on public view at the end of 1995.  Subsequent satellite imaging has revealed further remains. It is possible to go diving and see the ruins. The secretariat of the UNESCO Convention on the Protection of the Underwater Cultural Heritage are currently working with the Government of Egypt on an initiative to add the Bay of Alexandria (to include remains of the lighthouse) on a World Heritage List of submerged cultural sites.\n\nSignificance\n\nLegend has it that the people of the island of Pharos were wreckers; hence, Ptolemy I had the lighthouse built to help guide ships into port at night.Clayton, Price, & Price, Martin. (1988). The seven wonders of the ancient world. London ; New York: Routledge.\nPharos became the etymological origin of the word \"lighthouse\" in Greek (φάρος), Persian (Fānūs – فانوس), many Romance languages such as French (phare), Italian and Spanish (faro), Romanian (far) and Portuguese (farol), and even some Slavic languages like Bulgarian (far). In Russian, a derived word means \"headlight\" (fara – фара).\n\nIn 2008 it was suggested[http://www.dioi.org/vols/we0.pdf DIO volume 14] pages 3–12 and page 2 footnote. that the Pharos was the vertical yardstick used in the first precise measurement of the size of the earth.\n\nProposed reconstruction \n\nSince 1978 a number of proposals have been made to replace the lighthouse with a modern reconstruction. In 2015, the Egyptian government and the Alexandria governorate suggested building a skyscraper on the site of the lighthouse as part of the regeneration of the eastern harbour of Alexandria Port. The plan was opposed by Alexandria-based sociologist Amro Ali.\n\nPharos in culture\n\nThe lighthouse remains a civic symbol of the city of Alexandria and of the Alexandria Governorate with which the city is more or less coterminous. A stylised representation of the lighthouse appears on the flag and seal of the Governorate and on many public services of the city, including the seal of Alexandria University.\n\nIn architecture\n\n* A well-preserved ancient tomb in the town of Abusir, 48 km southwest of Alexandria, is thought to be a scaled-down model of the Alexandria Pharos. Known colloquially under various names – the Pharos of Abusir, the Abusir funerary monument and Burg al-Arab (Arab's Tower) – it consists of a 3-storey tower, approximately 20 m in height, with a square base, an octagonal midsection and cylindrical upper section, like the building upon which it was apparently modelled. It dates to the reign of Ptolemy II (285–246 BC), and is therefore likely to have been built at about the same time as the Alexandria Pharos.\n* The design of minarets in many early Egyptian Islamic mosques followed a similar three-stage design to that of the Pharos, attesting to the building's broader architectural influence.\n* The George Washington Masonic National Memorial, located in Alexandria, Virginia, is fashioned after the ancient Lighthouse.\"*Ferris, Gary W. Presidential Places: A Guide to the Historic Sites of U.S. Presidents. Winston-Salem, N.C.: J.F. Blair, 1999. p.21\"\n\nIn books\n\n*Julius Caesar, in his Civil Wars (Part III, 111–112), describes the Pharos and its strategic importance. Gaining control of the lighthouse helped him subdue Ptolemy XIII's armies (48 BC):\n*The Romano-Jewish historian Josephus (37 – c.100 AD) describes it in his book The Jewish War (4.10.5) when he gives a geographical overview of Egypt.\n*It was described in the Zhu fan zhi (\"Records of Foreign Peoples\") by Zhao Rugua (1170–1228), a Chinese customs inspector for the port city of Quanzhou during the Song dynasty.Needham, Joseph (1986). Science and Civilization in China: Volume 5, Physics and Physical Technology, Part 3: Civil Engineering and Nautics. Taipei: Caves Books, Ltd. Page 662.\n* In Robert Silverberg's science fiction novelette Sailing to Byzantium (1985), a culture of the far future recreates ancient cities, full with every detail, among them Alexandria; several episodes of Silverberg's story take place on the rebuilt Pharos.\n\nIn video games \n\n* The lighthouse was one of the Wonders of the World that could be built in the 1991 computer game Civilization by Sid Meier, giving a bonus to ship movement.\n* The lighthouse was featured in the action-adventure video game Assassins Creed Origins released on October 27, 2017. It is set in Ancient Egypt during the Ptolemaic period (48 BC). Ubisoft Montreal's research on Ancient Egypt was done with the help of French archaeologist and Egyptologist Jean-Claude Golvin.Nielsen, H. (2017, October 05). Assassin's Creed Origins: how Ubisoft painstakingly recreated ancient Egypt. Retrieved November 25, 2017, from https://www.theguardian.com/technology/2017/oct/05/assassins-creed-origins-recreated-ancient-egypt-ubisoft. Lighthouse of Alexandria. http://en.wikipedia.org/?curid=17724."
  }
}
