{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14672",
  "eid" : "16ef54c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778547724,
  "textBody" : "Since 1980, the foreign relations of Iraq were influenced by a number of controversial decisions by the Saddam Hussein administration. Hussein had good relations with the Soviet Union and a number of western countries such as France and Germany, who provided him with advanced weapons systems. He also developed a tenuous relation with the United States, who supported him during the Iran–Iraq war. However, the Invasion of Kuwait that triggered the Gulf War brutally changed Iraq's relations with the Arab World and the West. Egypt, Saudi Arabia, Syria and others were among the countries that supported Kuwait in the UN coalition. After the Hussein administration was toppled by the 2003 invasion of Iraq, the governments that succeeded it have now tried to establish relations with various nations.\n\nMiddle East\n\nEgypt\n\nIraq's relations with the Arab world have been extremely varied. Relations between Iraq and Egypt violently ruptured in 1977, when the two nations broke relations with each other following Iraq's criticism of Egyptian President Anwar Sadat's peace initiatives with Israel. In 1978, Baghdad hosted an Arab League summit that condemned and ostracized Egypt for accepting the Camp David accords. However, Egypt's strong material and diplomatic support for Iraq in the war with Iran led to warmer relations and numerous contacts between senior officials, despite the continued absence of ambassadorial-level representation. Since 1983, Iraq has repeatedly called for restoration of Egypt's \"natural role\" among Arab countries. In January 1984, Iraq successfully led Arab efforts within the OIC to restore Egypt's membership. However, Iraqi-Egyptian relations were broken in 1990 after Egypt joined the UN coalition that forced Iraq out of Kuwait. Relations have steadily improved in recent years, and Egypt is now one of Iraq's main trade partners (formerly under the Oil-for-Food Programme).\n\nLebanon\n\nIraq and Lebanon have maintained diplomatic relations with each other since 1943. Both countries have refused to recognize Israel and have supported the Palestinians.\n\nThroughout history, Iraq's relations with Lebanon have been relatively close, both politically and culturally. During the regime of Saddam Hussein, the leader of the Ba'ath Party had strong relations with Bachir, and Amine Gemayel; relations grew even stronger when Iraqi officials verbally lashed out against Israel's actions in the 2006 War. However, relations have diminished due to ongoing sectarian clashes between Iraq's Sunni and Shia Muslim branches.\n\nIran\n\nIn 1988 Iraq's main foreign policy issue was the war with Iran. This war had begun in September 1980, when Saddam Hussein sent Iraqi forces across the Shatt al Arab into southwestern Iran. Although the reasons for Saddam Husayn's decision to invade Iran were complicated, the leaders of the Baath Party had long resented Iranian hegemony in the Persian Gulf region and had especially resented the perceived Iranian interference in Iraq's internal affairs both before and after the 1979 Islamic Revolution. Their objectives were to halt any potential foreign assistance to the Shias and to the Kurdish opponents of the regime and to end Iranian domination of the area. The Baathists believed a weakened Iran would be incapable of posing a security threat and could not undermine Iraq's efforts to exercise the regional influence that had been blocked by non-Arab Iran since the mid-1960s. By early 1982, the Iraqi occupation forces were on the defensive and were being forced to retreat from some of their forward lines. In June 1982, Saddam Hussein ordered most of the Iraqi units to withdraw from Iranian territory; after that time, the Ba'athist government tried to obtain a cease-fire based on a return of all armed personnel to the international borders that prevailed as of September 21, 1979.\n\nIran did not accept Iraq's offer to negotiate an end to the war. Similarly, it rejected a July 1982 United Nations (UN) Security Council resolution calling for an immediate cease-fire. Subsequently, Iranian forces invaded Iraq by crossing the Shatt al Arab in the south and by capturing some mountain passes in the north. To discourage Iran's offensive, the Iraqi air force initiated bombing raids over several Iranian cities and towns. The air raids brought Iranian retaliation, which included the aerial bombing of Baghdad. Although Iraq eventually pushed back and contained the Iranian advances, it was not able to force Iranian troops completely out of Iraqi territory. The perceived threat to Iraq in the summer of 1982 thus was serious enough to force Saddam Hussein to request the Nonaligned Movement to change the venue of its scheduled September meeting from Baghdad to India; nevertheless, since the fall of 1982, the ground conflict has generally been a stalemated war of attrition—although Iran made small but demoralizing territorial advances as a result of its massive offensives in the reed marshes north of Basra in 1984 and in 1985, in Al Faw Peninsula in early 1986, and in the outskirts of Basra during January and February 1987. In addition, as of early 1988 the government had lost control of several mountainous districts in Kurdistan where, since 1983, dissident Kurds have cooperated militarily with Iran.\n\nSaddam Hussein's government has maintained consistently since the summer of 1982 that Iraq wants a negotiated end to the war based upon the status quo ante. Iran's stated conditions for ceasing hostilities, namely the removal of Saddam Hussein and the Baath from power, however, have been unacceptable. The main objective of the regime became the extrication of the country from the war with as little additional damage as possible. To further this goal, Iraq has used various diplomatic, economic, and military strategies; none of these had been successful in bringing about a cease-fire as of early 1988.\n\nAlthough the war was a heavy burden on Iran and Iraq politically, economically, and socially, the most profound consequence of the war's prolongation on Iraq, was its impact on the patterns of Iraq's foreign relations. Whereas trends toward a moderation of the Baath Party's ideological approach to foreign affairs were evident before 1980, the war helped to accelerate these trends. Two of the most dramatic changes were in Iraq's relationships with the Soviet Union and with the United States. During the course of the war Iraq moved away from the close friendship with the Soviet Union that had persisted throughout the 1970s, and it initiated a rapprochement with the United States. Iraq also sought to ally itself with Kuwait and with Saudi Arabia, two neighboring countries with which there had been considerable friction during much of the 1970s. The alignment with these countries was accompanied by a more moderate Iraqi approach to other Arab countries, such as Egypt and Jordan, which previously Iraq had perceived as hostile.\n\nIraqi–Iranian relations have remained cool since the end of the Iran–Iraq War in 1988. Outstanding issues from that war, including prisoner of war exchanges and support of armed opposition parties operating in each other's territory, remain to be solved.\n\nRelations appear to have improved since March 2008, when Iranian president Mahmoud Ahmadinejad made a two-day visit to Iraq.\n\nIsrael\n\nIraq participated in the Arab–Israeli wars of 1948, 1967 and 1973, and traditionally has opposed all attempts to reach a peaceful settlement between Israel and the Arab States. Israel attacked Iraq's nuclear research reactor under construction near Baghdad in July 1981. During the Iran–Iraq war, Iraq moderated its anti-Israel stance considerably. In August 1982 President Hussein stated to a visiting U.S. Congressman that \"a secure state is necessary for both Israel and the Palestinians.\" Iraq did not oppose then President Reagan's September 1, 1982 Arab-Israeli peace initiative, and it supported the moderate Arab position at the Fez summit that same month. Iraq repeatedly stated that it would support whatever settlement is found acceptable by the Palestinians.\n\nJordan\n\nIraq's relations with Jordan have improved significantly since 1980, when Jordan declared its support for Iraq at the outset of the Iran–Iraq War. Jordan's support for Iraq during the Persian Gulf War resulted in a further improvement of ties. Relations have cooled since the current King of Jordan took office in 2000, but remain good. King Abdullah of Jordan has become the first Arab leader to visit Iraq since the fall of Saddam Hussein in 2003, a landmark step towards reducing Baghdad's isolation among its Arab neighbours. Jordan is one of a small number of Arab countries to have named ambassadors to Iraq.\n\nKuwait\n\nIraq's invasion of Kuwait in 1990 resulted in its government-in-exile, the US, Saudi Arabia, and most Persian Gulf states to sever relations with Baghdad and joining the United Nations coalition that drove Iraqi forces out of Kuwait during the Persian Gulf War. Iraq's refusal to implement United Nations Security Council resolutions and continued threats toward Kuwait have resulted in relations remaining cool.\n\nSaudi Arabia\n\nSaudi leaders were relieved when Iraq was defeated, but they recognized that relations with Baghdad had been damaged. Consequently, postwar Saudi policy focused on ways to contain potential Iraqi threats to the kingdom and the region. One elements of Riyadh's containment policy included support for Iraqi opposition forces that advocated the overthrow of Saddam Hussein's government. In the past, backing for such groups had been discreet, but in early 1992 the Saudis invited several Iraqi opposition leaders to Riyadh to attend a well-publicised conference. To further demonstrate Saudi dissatisfaction with the regime in Baghdad, Crown Prince Abdallah permitted the media to videotape his meeting with some of the opponents of Saddam Hussein.\n\nSudan\n\nSudan has an Embassy in Baghdad and Iraq's Embassy is in Khartoum. Sudanese–Iraqi relations were and still are very close, Sudan supported Iraq during the Gulf War, and following the war, Baghdad established Khartoum as a major center for Iraqi intelligence.https://fas.org/news/iraq/1998/08/980824-in.htm Sudanese-Iraq Relations Iraq and Sudan are connected by remote cultural similarities such as language (both countries speak Arabic, though the two are different in dialect) and religion, both are Muslim\n\nSyria\n\nThe political states of Iraq and Syria were formed by the United Kingdom and France following the defeat of the Ottoman Empire in World War I. Iraq and Syria are united by historical, social, political, cultural and economic relations, but share a long foreign drawn border. The land known as Mesopotamia is Iraq and eastern Syria and is called such by its inhabitants. Political relations between Iraq and Syria have in the past seen difficulties, however, new diplomatic relations described by both sides as \"Historic\" were established in November 2006, beginning an era of close cooperation and political friendship between Iraq and Syria.http://news.bbc.co.uk/2/hi/middle_east/6167968.stm Iraq and Syria restore relations\n\nUnited Arab Emirates\n\nIn June 2008, the Iraqi government announced that the United Arab Emirates would send an ambassador to Baghdad within a few days. This would become the first Arab ambassador in Iraq since the kidnapping and murder of Ihab el-Sherif in July 2005. This announcement was made during a surprise visit by the United Arab Emirates' Foreign Minister Abdullah bin Zayed Al Nahyan to Baghdad on 5 June 2008. This marked the first time a high-ranking official from a Gulf state visited Iraq since March 2003.\n\nEurope\n\nIn September 2005, a joint political declaration between the European Union and Iraq was signed which forms the basis of regular political dialogue. A Trade and Cooperation Agreement between the EU and Iraq is in the process of being negotiated and will probably be concluded during 2008.\n\nJuly 2005 saw the introduction of EUJUST LEX, the European Union's rule of law operation intended to train Iraqi police and legal officials in human rights along with other issues. Over 1,400 Iraqis have already taken part in training courses.[http://www.sweden.gov.se/sb/d/8899]\n\nOutside the Middle East and Europe\n\nOutside the Middle East, Iraq maintained correct relations with other countries. Iraq identified itself as part of the Nonaligned Movement of primarily African and Asian nations, actively participated in its deliberations during the late 1970s, and successfully lobbied to have Baghdad chosen as the site for its September 1982 conference. Although significant resources were expended to prepare facilities for the conference, and Saddam Hussein would have emerged from the meeting as a recognized leader of the Nonaligned Movement, genuine fears of an Iranian bombing of the capital during the summer of 1982 forced the government reluctantly to request that the venue of the conference be transferred to New Delhi. Since that time, preoccupation with the war against Iran, which also is a member of the Nonaligned Movement, has tended to restrict the scope of Iraqi participation in that organization.\n\nBrazil\n\n* Diplomatic relations started in 1967.\n* Brazil was the first Latin American country to reopen its embassy in Iraq since the 1991 Gulf War.\n* Both countries are full members of the Group of 77.\n\nCuba\n\nCuba's relations with Iraq were prosperous during the presidency of Saddam Hussein. Cuba's friendly relations with Iraq dated back to the Non-Aligned Movement meeting held in Cuba 1979. Fidel Castro even provided doctors to perform back surgery on Hussein. Cuba consistently supported Iraq at the United Nations against sanctions and threats made by the United States. The thirteen-year sanction against Iraq prevented much trade between Havana and Baghdad.\n\nIraq has an embassy in Havana. Cuba has an embassy in Baghdad.\n\nIndia\n\n* Diplomatic relations started in 1947.\nIndia and Iraq maintained strong relationships since Indian independence.\n\nIndonesia\n\nIndonesia and Iraq shared similarity as the Muslim majority countries. Both nations share their experiences in rebuilding and development. Indonesia has an embassy in Baghdad, while Iraq has an embassy in Jakarta. Both nations are partners in multilateral organizations, such as World Trade Organization (WTO), The Non-Aligned Movement and Organisation of Islamic Cooperation (OIC).\n\nAfter World War II, Iraq had been one of the first countries to recognize Indonesia's independence in 1945. The two countries established diplomatic relations in 1950 and have signed around 15 agreements to boost bilateral ties. Indonesia has maintained its embassy in Baghdad during various crises, such as the Iran–Iraq war in the 1980s. However, at the height of the Iraq War, Indonesia was forced to temporarily closed its embassy in Baghdad in 2003, and reopen it in June 2011.\n\nIn 2003, Indonesian Government and people protested against a U.S.-led military campaign against Baghdad. Over 50,000 Indonesian people crowded the streets of the Indonesian capital, Jakarta on Sunday, February 9, 2003, to protest the United States' threat of military action against Iraq. After the war ended and Indonesia reopen its embassy in 2011, relations between the two countries have developed at a fast pace. Iraq invited Indonesia's companies to participate in the reconstruction of Iraq. Traditionally Indonesia sees Iraq as the source of energy, such as oil and gas. On the other hand, Iraqi people are familiar with Indonesian exported products such as tires, soaps, spices, furniture, coal, clothing, palm oil, shoes, paper, automobiles, rubber and electronic goods.\n\nNorth Korea\n\nDiplomatic relations started on 9 July 1968, but were cut on 10 October 1980 after Iran–Iraq War. DPRK and Iraq re-established relations on 29 September 2008.\n\nIraq had an embassy in Pyongyang and DPRK had an embassy in Baghdad between 1970 and 1980.[http://www.mofa.gov.iq/ Iraq Ministry of Foreign Affairs]\n\nPakistan\n\nDiplomatic relations started in 1947. Iraq and Pakistan have had close, friendly, and cooperative relations since the latter's independence in 1947. Issues such as Iraqi support for Pakistan in its 1971 war with India (Indo-Iraqi relations), and Pakistani support for Iraq against Iran in the Iran-Iraq War have forged relations between the two. Relations soured during the Gulf War when Pakistan contributed troops for the UN Coalition, seeing it as a betrayal due to Iraq's constant support for Pakistan in their previous wars with India. In 2002, Saddam Hussein visited India and said he gave his unwavering support to India over the Kashmir dispute. In 2003, Pakistan rejected US's request to send troops for the invasion which have helped soothed relations between the two.\n\nSingapore\n\nDiplomatic relations between both countries were established on 27 December 1977.[http://shinedom1.internet.gov.sg/mfa/dipCon/dipCon.nsf/FMDetailsAgent?OpenAgent&id=78] Ministry of Foreign Affairs, Singapore: Embassy of the Republic of Iraq The Embassy of Iraq in Indonesia also handles Singapore.\n\nSouth Korea\n\nBetween the Republic of Korea and Iraq`s High-level Exchanges 2005 June ROK-Iraq Ministerial Talks 2006 September ROK-Iraq Ministerial Talks 2007 April ROK-Iraq Summit 2011 April ROK-Iraq Summit.http://www.mofa.go.kr/ENG/countries/middleeast/countries/20070824/1_24455.jsp?menu=m_30_50\n\nUnited States\n\nBecause of the primary roles taken by the United States and Britain in deposing Saddam Hussein and establishing interim governments to replace his regime, Iraq's relationships with those countries, particularly the United States, are expected to remain paramount for the foreseeable future. Government and nongovernmental aid from the United States will continue as a crucial support in reconstruction. In 2006 formulation of more precise foreign policy priorities awaits the firm establishment of the permanent government. In the short term, Iraq's relations with Western and Far Eastern economic powers are determined by debt forgiveness and reconstruction assistance, which have come from many quarters. Relations with the United States were strained in mid-2006 when Iraq criticized Israeli attacks on Hezbollah forces in Lebanon.\n\nMember of international organizations\n\nIraq belongs to the following international organizations: Arab Fund for Economic and Social Development, Arab League, Arab Monetary Fund, Council of Arab Economic Unity, Customs Cooperation Council, Economic and Social Commission for Western Asia, G-77, International Atomic Energy Agency, International Monetary Fund, International Maritime Organization, Interpol, International Organization for Standardization, International Telecommunication Union, Non-Aligned Movement, Organization of Petroleum Exporting Countries, Organization of Arab Petroleum Exporting Countries, Organisation of Islamic Cooperation, United Nations, Universal Postal Union, World Health Organization and World Bank.\n\nMinistry of Foreign Affairs\n\nIraq's relations with other countries and with international organizations are supervised by the Ministry of Foreign Affairs. In 1988 the minister of foreign affairs was Tariq Aziz, who was an influential leader of the Ba'ath Party and had served in that post since 1983. Aziz, Saddam Hussein, and the other members of the Revolutionary Command Council (RCC) formulated Iraq's foreign policy, and the Ministry of Foreign Affairs bureaucracy implemented RCC directives. The Baath maintained control over the Ministry of Foreign Affairs and over all Iraqi diplomatic missions abroad.\n\nSince the overthrow of Saddam Hussein in 2003, Hoshyar Zebari was first appointed Minister of Foreign Affairs in the Iraqi Governing Council in Baghdad on 3 September 2003. On 28 June 2004, he was reappointed as Minister of Foreign Affairs by the Iraqi Interim Government, under Prime Minister Ayad Allawi. On 3 May 2005 he was sworn in as Minister of Foreign Affairs by the Iraqi Transitional Government, under Prime Minister Ibrahim al-Jaafari. On 20 May 2006, he was delegated in for the fourth consecutive time as Foreign Minister in the government of Nouri Al-Maliki.\n\nInternational disputes\n\nIran and Iraq restored diplomatic relations in 1990 but are still trying to work out written agreements settling outstanding disputes from their eight-year war concerning border demarcation, prisoners-of-war, and freedom of navigation and sovereignty over the Shatt al-Arab waterway; in November 1994, Iraq formally accepted the United Nations-demarcated border with Kuwait which had been spelled out in Security Council Resolutions 687 (1991), 773 (1992), and 883 (1993); this formally ends earlier claims to Kuwait and to Bubiyan and Warbah islands although the government continues periodic rhetorical challenges; dispute over water development plans by Turkey for the Tigris and Euphrates rivers.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Foreign relations of Iraq" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14672" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Since 1980, the foreign relations of Iraq were influenced by a number of controversial decisions by the Saddam Hussein administration. Hussein had good relations with the Soviet Union and a number of western countries such as France and Germany, who provided him with advanced weapons systems. He also developed a tenuous relation with the United States, who supported him during the Iran–Iraq war. However, the Invasion of Kuwait that triggered the Gulf War brutally changed Iraq's relations with the Arab World and the West. Egypt, Saudi Arabia, Syria and others were among the countries that supported Kuwait in the UN coalition. After the Hussein administration was toppled by the 2003 invasion of Iraq, the governments that succeeded it have now tried to establish relations with various nations.\n\nMiddle East\n\nEgypt\n\nIraq's relations with the Arab world have been extremely varied. Relations between Iraq and Egypt violently ruptured in 1977, when the two nations broke relations with each other following Iraq's criticism of Egyptian President Anwar Sadat's peace initiatives with Israel. In 1978, Baghdad hosted an Arab League summit that condemned and ostracized Egypt for accepting the Camp David accords. However, Egypt's strong material and diplomatic support for Iraq in the war with Iran led to warmer relations and numerous contacts between senior officials, despite the continued absence of ambassadorial-level representation. Since 1983, Iraq has repeatedly called for restoration of Egypt's \"natural role\" among Arab countries. In January 1984, Iraq successfully led Arab efforts within the OIC to restore Egypt's membership. However, Iraqi-Egyptian relations were broken in 1990 after Egypt joined the UN coalition that forced Iraq out of Kuwait. Relations have steadily improved in recent years, and Egypt is now one of Iraq's main trade partners (formerly under the Oil-for-Food Programme).\n\nLebanon\n\nIraq and Lebanon have maintained diplomatic relations with each other since 1943. Both countries have refused to recognize Israel and have supported the Palestinians.\n\nThroughout history, Iraq's relations with Lebanon have been relatively close, both politically and culturally. During the regime of Saddam Hussein, the leader of the Ba'ath Party had strong relations with Bachir, and Amine Gemayel; relations grew even stronger when Iraqi officials verbally lashed out against Israel's actions in the 2006 War. However, relations have diminished due to ongoing sectarian clashes between Iraq's Sunni and Shia Muslim branches.\n\nIran\n\nIn 1988 Iraq's main foreign policy issue was the war with Iran. This war had begun in September 1980, when Saddam Hussein sent Iraqi forces across the Shatt al Arab into southwestern Iran. Although the reasons for Saddam Husayn's decision to invade Iran were complicated, the leaders of the Baath Party had long resented Iranian hegemony in the Persian Gulf region and had especially resented the perceived Iranian interference in Iraq's internal affairs both before and after the 1979 Islamic Revolution. Their objectives were to halt any potential foreign assistance to the Shias and to the Kurdish opponents of the regime and to end Iranian domination of the area. The Baathists believed a weakened Iran would be incapable of posing a security threat and could not undermine Iraq's efforts to exercise the regional influence that had been blocked by non-Arab Iran since the mid-1960s. By early 1982, the Iraqi occupation forces were on the defensive and were being forced to retreat from some of their forward lines. In June 1982, Saddam Hussein ordered most of the Iraqi units to withdraw from Iranian territory; after that time, the Ba'athist government tried to obtain a cease-fire based on a return of all armed personnel to the international borders that prevailed as of September 21, 1979.\n\nIran did not accept Iraq's offer to negotiate an end to the war. Similarly, it rejected a July 1982 United Nations (UN) Security Council resolution calling for an immediate cease-fire. Subsequently, Iranian forces invaded Iraq by crossing the Shatt al Arab in the south and by capturing some mountain passes in the north. To discourage Iran's offensive, the Iraqi air force initiated bombing raids over several Iranian cities and towns. The air raids brought Iranian retaliation, which included the aerial bombing of Baghdad. Although Iraq eventually pushed back and contained the Iranian advances, it was not able to force Iranian troops completely out of Iraqi territory. The perceived threat to Iraq in the summer of 1982 thus was serious enough to force Saddam Hussein to request the Nonaligned Movement to change the venue of its scheduled September meeting from Baghdad to India; nevertheless, since the fall of 1982, the ground conflict has generally been a stalemated war of attrition—although Iran made small but demoralizing territorial advances as a result of its massive offensives in the reed marshes north of Basra in 1984 and in 1985, in Al Faw Peninsula in early 1986, and in the outskirts of Basra during January and February 1987. In addition, as of early 1988 the government had lost control of several mountainous districts in Kurdistan where, since 1983, dissident Kurds have cooperated militarily with Iran.\n\nSaddam Hussein's government has maintained consistently since the summer of 1982 that Iraq wants a negotiated end to the war based upon the status quo ante. Iran's stated conditions for ceasing hostilities, namely the removal of Saddam Hussein and the Baath from power, however, have been unacceptable. The main objective of the regime became the extrication of the country from the war with as little additional damage as possible. To further this goal, Iraq has used various diplomatic, economic, and military strategies; none of these had been successful in bringing about a cease-fire as of early 1988.\n\nAlthough the war was a heavy burden on Iran and Iraq politically, economically, and socially, the most profound consequence of the war's prolongation on Iraq, was its impact on the patterns of Iraq's foreign relations. Whereas trends toward a moderation of the Baath Party's ideological approach to foreign affairs were evident before 1980, the war helped to accelerate these trends. Two of the most dramatic changes were in Iraq's relationships with the Soviet Union and with the United States. During the course of the war Iraq moved away from the close friendship with the Soviet Union that had persisted throughout the 1970s, and it initiated a rapprochement with the United States. Iraq also sought to ally itself with Kuwait and with Saudi Arabia, two neighboring countries with which there had been considerable friction during much of the 1970s. The alignment with these countries was accompanied by a more moderate Iraqi approach to other Arab countries, such as Egypt and Jordan, which previously Iraq had perceived as hostile.\n\nIraqi–Iranian relations have remained cool since the end of the Iran–Iraq War in 1988. Outstanding issues from that war, including prisoner of war exchanges and support of armed opposition parties operating in each other's territory, remain to be solved.\n\nRelations appear to have improved since March 2008, when Iranian president Mahmoud Ahmadinejad made a two-day visit to Iraq.\n\nIsrael\n\nIraq participated in the Arab–Israeli wars of 1948, 1967 and 1973, and traditionally has opposed all attempts to reach a peaceful settlement between Israel and the Arab States. Israel attacked Iraq's nuclear research reactor under construction near Baghdad in July 1981. During the Iran–Iraq war, Iraq moderated its anti-Israel stance considerably. In August 1982 President Hussein stated to a visiting U.S. Congressman that \"a secure state is necessary for both Israel and the Palestinians.\" Iraq did not oppose then President Reagan's September 1, 1982 Arab-Israeli peace initiative, and it supported the moderate Arab position at the Fez summit that same month. Iraq repeatedly stated that it would support whatever settlement is found acceptable by the Palestinians.\n\nJordan\n\nIraq's relations with Jordan have improved significantly since 1980, when Jordan declared its support for Iraq at the outset of the Iran–Iraq War. Jordan's support for Iraq during the Persian Gulf War resulted in a further improvement of ties. Relations have cooled since the current King of Jordan took office in 2000, but remain good. King Abdullah of Jordan has become the first Arab leader to visit Iraq since the fall of Saddam Hussein in 2003, a landmark step towards reducing Baghdad's isolation among its Arab neighbours. Jordan is one of a small number of Arab countries to have named ambassadors to Iraq.\n\nKuwait\n\nIraq's invasion of Kuwait in 1990 resulted in its government-in-exile, the US, Saudi Arabia, and most Persian Gulf states to sever relations with Baghdad and joining the United Nations coalition that drove Iraqi forces out of Kuwait during the Persian Gulf War. Iraq's refusal to implement United Nations Security Council resolutions and continued threats toward Kuwait have resulted in relations remaining cool.\n\nSaudi Arabia\n\nSaudi leaders were relieved when Iraq was defeated, but they recognized that relations with Baghdad had been damaged. Consequently, postwar Saudi policy focused on ways to contain potential Iraqi threats to the kingdom and the region. One elements of Riyadh's containment policy included support for Iraqi opposition forces that advocated the overthrow of Saddam Hussein's government. In the past, backing for such groups had been discreet, but in early 1992 the Saudis invited several Iraqi opposition leaders to Riyadh to attend a well-publicised conference. To further demonstrate Saudi dissatisfaction with the regime in Baghdad, Crown Prince Abdallah permitted the media to videotape his meeting with some of the opponents of Saddam Hussein.\n\nSudan\n\nSudan has an Embassy in Baghdad and Iraq's Embassy is in Khartoum. Sudanese–Iraqi relations were and still are very close, Sudan supported Iraq during the Gulf War, and following the war, Baghdad established Khartoum as a major center for Iraqi intelligence.https://fas.org/news/iraq/1998/08/980824-in.htm Sudanese-Iraq Relations Iraq and Sudan are connected by remote cultural similarities such as language (both countries speak Arabic, though the two are different in dialect) and religion, both are Muslim\n\nSyria\n\nThe political states of Iraq and Syria were formed by the United Kingdom and France following the defeat of the Ottoman Empire in World War I. Iraq and Syria are united by historical, social, political, cultural and economic relations, but share a long foreign drawn border. The land known as Mesopotamia is Iraq and eastern Syria and is called such by its inhabitants. Political relations between Iraq and Syria have in the past seen difficulties, however, new diplomatic relations described by both sides as \"Historic\" were established in November 2006, beginning an era of close cooperation and political friendship between Iraq and Syria.http://news.bbc.co.uk/2/hi/middle_east/6167968.stm Iraq and Syria restore relations\n\nUnited Arab Emirates\n\nIn June 2008, the Iraqi government announced that the United Arab Emirates would send an ambassador to Baghdad within a few days. This would become the first Arab ambassador in Iraq since the kidnapping and murder of Ihab el-Sherif in July 2005. This announcement was made during a surprise visit by the United Arab Emirates' Foreign Minister Abdullah bin Zayed Al Nahyan to Baghdad on 5 June 2008. This marked the first time a high-ranking official from a Gulf state visited Iraq since March 2003.\n\nEurope\n\nIn September 2005, a joint political declaration between the European Union and Iraq was signed which forms the basis of regular political dialogue. A Trade and Cooperation Agreement between the EU and Iraq is in the process of being negotiated and will probably be concluded during 2008.\n\nJuly 2005 saw the introduction of EUJUST LEX, the European Union's rule of law operation intended to train Iraqi police and legal officials in human rights along with other issues. Over 1,400 Iraqis have already taken part in training courses.[http://www.sweden.gov.se/sb/d/8899]\n\nOutside the Middle East and Europe\n\nOutside the Middle East, Iraq maintained correct relations with other countries. Iraq identified itself as part of the Nonaligned Movement of primarily African and Asian nations, actively participated in its deliberations during the late 1970s, and successfully lobbied to have Baghdad chosen as the site for its September 1982 conference. Although significant resources were expended to prepare facilities for the conference, and Saddam Hussein would have emerged from the meeting as a recognized leader of the Nonaligned Movement, genuine fears of an Iranian bombing of the capital during the summer of 1982 forced the government reluctantly to request that the venue of the conference be transferred to New Delhi. Since that time, preoccupation with the war against Iran, which also is a member of the Nonaligned Movement, has tended to restrict the scope of Iraqi participation in that organization.\n\nBrazil\n\n* Diplomatic relations started in 1967.\n* Brazil was the first Latin American country to reopen its embassy in Iraq since the 1991 Gulf War.\n* Both countries are full members of the Group of 77.\n\nCuba\n\nCuba's relations with Iraq were prosperous during the presidency of Saddam Hussein. Cuba's friendly relations with Iraq dated back to the Non-Aligned Movement meeting held in Cuba 1979. Fidel Castro even provided doctors to perform back surgery on Hussein. Cuba consistently supported Iraq at the United Nations against sanctions and threats made by the United States. The thirteen-year sanction against Iraq prevented much trade between Havana and Baghdad.\n\nIraq has an embassy in Havana. Cuba has an embassy in Baghdad.\n\nIndia\n\n* Diplomatic relations started in 1947.\nIndia and Iraq maintained strong relationships since Indian independence.\n\nIndonesia\n\nIndonesia and Iraq shared similarity as the Muslim majority countries. Both nations share their experiences in rebuilding and development. Indonesia has an embassy in Baghdad, while Iraq has an embassy in Jakarta. Both nations are partners in multilateral organizations, such as World Trade Organization (WTO), The Non-Aligned Movement and Organisation of Islamic Cooperation (OIC).\n\nAfter World War II, Iraq had been one of the first countries to recognize Indonesia's independence in 1945. The two countries established diplomatic relations in 1950 and have signed around 15 agreements to boost bilateral ties. Indonesia has maintained its embassy in Baghdad during various crises, such as the Iran–Iraq war in the 1980s. However, at the height of the Iraq War, Indonesia was forced to temporarily closed its embassy in Baghdad in 2003, and reopen it in June 2011.\n\nIn 2003, Indonesian Government and people protested against a U.S.-led military campaign against Baghdad. Over 50,000 Indonesian people crowded the streets of the Indonesian capital, Jakarta on Sunday, February 9, 2003, to protest the United States' threat of military action against Iraq. After the war ended and Indonesia reopen its embassy in 2011, relations between the two countries have developed at a fast pace. Iraq invited Indonesia's companies to participate in the reconstruction of Iraq. Traditionally Indonesia sees Iraq as the source of energy, such as oil and gas. On the other hand, Iraqi people are familiar with Indonesian exported products such as tires, soaps, spices, furniture, coal, clothing, palm oil, shoes, paper, automobiles, rubber and electronic goods.\n\nNorth Korea\n\nDiplomatic relations started on 9 July 1968, but were cut on 10 October 1980 after Iran–Iraq War. DPRK and Iraq re-established relations on 29 September 2008.\n\nIraq had an embassy in Pyongyang and DPRK had an embassy in Baghdad between 1970 and 1980.[http://www.mofa.gov.iq/ Iraq Ministry of Foreign Affairs]\n\nPakistan\n\nDiplomatic relations started in 1947. Iraq and Pakistan have had close, friendly, and cooperative relations since the latter's independence in 1947. Issues such as Iraqi support for Pakistan in its 1971 war with India (Indo-Iraqi relations), and Pakistani support for Iraq against Iran in the Iran-Iraq War have forged relations between the two. Relations soured during the Gulf War when Pakistan contributed troops for the UN Coalition, seeing it as a betrayal due to Iraq's constant support for Pakistan in their previous wars with India. In 2002, Saddam Hussein visited India and said he gave his unwavering support to India over the Kashmir dispute. In 2003, Pakistan rejected US's request to send troops for the invasion which have helped soothed relations between the two.\n\nSingapore\n\nDiplomatic relations between both countries were established on 27 December 1977.[http://shinedom1.internet.gov.sg/mfa/dipCon/dipCon.nsf/FMDetailsAgent?OpenAgent&id=78] Ministry of Foreign Affairs, Singapore: Embassy of the Republic of Iraq The Embassy of Iraq in Indonesia also handles Singapore.\n\nSouth Korea\n\nBetween the Republic of Korea and Iraq`s High-level Exchanges 2005 June ROK-Iraq Ministerial Talks 2006 September ROK-Iraq Ministerial Talks 2007 April ROK-Iraq Summit 2011 April ROK-Iraq Summit.http://www.mofa.go.kr/ENG/countries/middleeast/countries/20070824/1_24455.jsp?menu=m_30_50\n\nUnited States\n\nBecause of the primary roles taken by the United States and Britain in deposing Saddam Hussein and establishing interim governments to replace his regime, Iraq's relationships with those countries, particularly the United States, are expected to remain paramount for the foreseeable future. Government and nongovernmental aid from the United States will continue as a crucial support in reconstruction. In 2006 formulation of more precise foreign policy priorities awaits the firm establishment of the permanent government. In the short term, Iraq's relations with Western and Far Eastern economic powers are determined by debt forgiveness and reconstruction assistance, which have come from many quarters. Relations with the United States were strained in mid-2006 when Iraq criticized Israeli attacks on Hezbollah forces in Lebanon.\n\nMember of international organizations\n\nIraq belongs to the following international organizations: Arab Fund for Economic and Social Development, Arab League, Arab Monetary Fund, Council of Arab Economic Unity, Customs Cooperation Council, Economic and Social Commission for Western Asia, G-77, International Atomic Energy Agency, International Monetary Fund, International Maritime Organization, Interpol, International Organization for Standardization, International Telecommunication Union, Non-Aligned Movement, Organization of Petroleum Exporting Countries, Organization of Arab Petroleum Exporting Countries, Organisation of Islamic Cooperation, United Nations, Universal Postal Union, World Health Organization and World Bank.\n\nMinistry of Foreign Affairs\n\nIraq's relations with other countries and with international organizations are supervised by the Ministry of Foreign Affairs. In 1988 the minister of foreign affairs was Tariq Aziz, who was an influential leader of the Ba'ath Party and had served in that post since 1983. Aziz, Saddam Hussein, and the other members of the Revolutionary Command Council (RCC) formulated Iraq's foreign policy, and the Ministry of Foreign Affairs bureaucracy implemented RCC directives. The Baath maintained control over the Ministry of Foreign Affairs and over all Iraqi diplomatic missions abroad.\n\nSince the overthrow of Saddam Hussein in 2003, Hoshyar Zebari was first appointed Minister of Foreign Affairs in the Iraqi Governing Council in Baghdad on 3 September 2003. On 28 June 2004, he was reappointed as Minister of Foreign Affairs by the Iraqi Interim Government, under Prime Minister Ayad Allawi. On 3 May 2005 he was sworn in as Minister of Foreign Affairs by the Iraqi Transitional Government, under Prime Minister Ibrahim al-Jaafari. On 20 May 2006, he was delegated in for the fourth consecutive time as Foreign Minister in the government of Nouri Al-Maliki.\n\nInternational disputes\n\nIran and Iraq restored diplomatic relations in 1990 but are still trying to work out written agreements settling outstanding disputes from their eight-year war concerning border demarcation, prisoners-of-war, and freedom of navigation and sovereignty over the Shatt al-Arab waterway; in November 1994, Iraq formally accepted the United Nations-demarcated border with Kuwait which had been spelled out in Security Council Resolutions 687 (1991), 773 (1992), and 883 (1993); this formally ends earlier claims to Kuwait and to Bubiyan and Warbah islands although the government continues periodic rhetorical challenges; dispute over water development plans by Turkey for the Tigris and Euphrates rivers. Foreign relations of Iraq. http://en.wikipedia.org/?curid=14672."
  }
}
