{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13210",
  "eid" : "070b7d90-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778521065,
  "textBody" : "The Levant is a geographical term that refers to a large area in Southwest Asia, south of the Taurus Mountains, bounded by the Mediterranean Sea in the west, the Arabian Desert in the south, and Mesopotamia in the east. It stretches 400 miles north to south from the Taurus Mountains to the Sinai desert, and 70 to 100 miles east to west between the sea and the Arabian desert.A History of Ancient Israel and Judah by Miller, James Maxwell, and Hayes, John Haralson (Westminster John Knox, 1986) . p.36] The term is also sometimes used to refer to modern events or states in the region immediately bordering the eastern Mediterranean Sea: Cyprus, Israel, Jordan, Lebanon, Palestine, and Syria.\n\nThe term normally does not include Anatolia (although at times Cilicia may be included), the Caucasus Mountains, Mesopotamia or any part of the Arabian Peninsula proper. The Sinai Peninsula is sometimes included, though it is more considered an intermediate, peripheral or marginal area forming a land bridge between the Levant and northern Egypt.\n\nStone Age\n\nMultiple waves of humans came Out of Africa I.  Anatomically modern Homo sapiens are demonstrated at the area of Mount Carmel, during the Middle Paleolithic dating from about c. 90,000 BC. This move out of Africa seems to have been unsuccessful and by c. 60,000 BC in Palestine/Israel/Syria, especially at Amud, classic Neanderthal groups seem to have profited from the worsening climate to have replaced Homo sapiens, who seem to have been confined once more to Africa.\n\nA second move out of Africa is demonstrated by the Boker Tachtit Upper Paleolithic culture, from 52–50,000 BC, with humans at Ksar Akil XXV level being modern humans.Marks, Anthony (1983)\"Prehistory and Paleoenvironments in the Central Negev, Israel\" (Institute for the Study of Earth and Man, Dallas) This culture bears close resemblance to the Badoshan Aurignacian culture of Iran, and the later Sebilian I Egyptian culture of c. 50,000 BC. Stephen OppenheimerOppemheiomer, Stephen (2004), \"Out of Eden\", (Constable and Robinson) suggests that this reflects a movement of modern human (possibly Caucasian) groups back into North Africa, at this time.\n\nIt would appear this sets the date by which Homo sapiens Upper Paleolithic cultures begin replacing Neanderthal Levalo-Mousterian, and by c. 40,000 BC Palestine was occupied by the Levanto-Aurignacian Ahmarian culture, lasting from 39–24,000 BC.Gladfelter, Bruce G. (1997) \"The Ahmarian tradition of the Levantine Upper Paleolithic: the environment of the archaeology\" (Vol 12, 4 Geoarchaeology) This culture was quite successful spreading as the Antelian culture (late Aurignacian), as far as Southern Anatolia, with the Atlitan culture.\n\nAfter the Late Glacial Maxima, a new Epipaleolithic culture appears in Southern Palestine. The appearance of the Kebarian culture, of microlithic type implies a significant rupture in the cultural continuity of Levantine Upper Paleolithic.  The Kebaran culture, with its use of microliths, is associated with the use of the bow and arrow and the domestication of the dog.Dayan, Tamar (1994), \"Early Domesticated Dogs of the Near East\" (Journal of Archaeological Science Volume 21, Issue 5, September 1994, Pages 633–640) Extending from 18–10,500 BC, the Kebaran cultureRonen, Avram, \"Climate, sea level, and culture in the Eastern Mediterranean 20 ky to the present\" in Valentina Yanko-Hombach, Allan S. Gilbert, Nicolae Panin and Pavel M. Dolukhanov (2007), The Black Sea Flood Question: Changes in Coastline, Climate, and Human Settlement (Springer) shows clear connections to the earlier Microlithic cultures using the bow and arrow, and using grinding stones to harvest wild grains, that developed from the c. 24,000–17,000 BC Halfan culture of Egypt, that came from the still earlier Aterian tradition of the Sahara. Some linguists see this as the earliest arrival of Nostratic languages in the Middle East.\nKebaran culture was quite successful, and was ancestral to the later Natufian culture (10,500–8500 BC), which extended throughout the whole of the Levantine region. These people pioneered the first sedentary settlements, and may have supported themselves from fishing, and from the harvest of wild grains plentiful in the region at that time.\n\nNatufian culture also demonstrates the earliest domestication of the dog, and the assistance of this animal in hunting and guarding human settlements may have contributed to the successful spread of this culture. In the northern Syrian, eastern Anatolian region of the Levant, Natufian culture at Cayonu and Mureybet developed the first fully agricultural culture with the addition of wild grains, later being supplemented with domesticated sheep and goats, which were probably domesticated first by the Zarzian culture of Northern Iraq and Iran (which like the Natufian culture may have also developed from Kebaran).\n\nBy 8500–7500 BC, the Pre-Pottery Neolithic A (PPNA) culture developed out of the earlier local tradition of Natufian in Southern Palestine, dwelling in round houses, and building the first defensive site at Jericho (guarding a valuable fresh water spring). This was replaced in 7500 BC by Pre-Pottery Neolithic B (PPNB), dwelling in square houses, coming from Northern Syria and the Euphrates bend.\n\nDuring the period of 8500–7500 BC, another hunter-gatherer group, showing clear affinities with the cultures of Egypt (particularly the Outacha retouch technique for working stone) was in Sinai. This Harifian cultureBelfer-Cohen, Anna and Bar-Yosef, Ofer \"Early Sedentism in the Near East: A Bumpy Ride to Village Life\" (Fundamental Issues in Archaeology, 2002, Part II, 19–38) may have adopted the use of pottery from the Isnan culture and Helwan culture of Egypt (which lasted from 9000 to 4500 BC), and subsequently fused with elements from the PPNB culture during the climatic crisis of 6000 BC to form what Juris Zarins calls the Syro-Arabian pastoral technocomplex,Zarins, Yuris \"Early Pastoral Nomadiism and the Settlement of Lower Mesopotamia\" (# Bulletin of the American Schools of Oriental Research No. 280, November, 1990) which saw the spread of the first Nomadic pastoralists in the Ancient Near East. These extended southwards along the Red Sea coast and penetrating the Arabian bifacial cultures, which became progressively more Neolithic and pastoral, and extending north and eastwards, to lay the foundations for the tent-dwelling Martu and Akkadian peoples of Mesopotamia.\n\nIn the Amuq valley of Syria, PPNB culture seems to have survived, influencing further cultural developments further south. Nomadic elements fused with PPNB to form the Minhata Culture and Yarmukian Culture which were to spread southwards, beginning the development of the classic mixed farming Mediterranean culture, and from 5600 BC were associated with the Ghassulian culture of the region, the first chalcolithic culture of the Levant. This period also witnessed the development of megalithic structures, which continued into the Bronze Age.Scheltema, H.G. (2008). Megalithic Jordan: An Introduction and Field Guide. Amman, Jordan: The American Center of Oriental Research. \n\nBronze Age\n\nIn modern scholarship the chronology of the Bronze Age Levant is divided into Early/Proto Syrian, corresponding to the Early Bronze; Old Syrian, corresponding to the Middle Bronze; and Middle Syrian, corresponding to the Late Bronze. The term Neo-Syria is used to designate the early Iron Age.\n\nThe old Syrian period was dominated by the Eblaite first kingdom, Nagar and the Mariote second kingdom. The Akkadian Empire conquered large areas of the Levant and were followed by the Amorite kingdoms, ca. 2000–1600 BC, which arose in Mari, Yamkhad and Qatna. Also following the Akkadians was the extension of Khirbet Kerak ware culture, showing affinities with the Caucasus, and possibly linked to the later appearance of the Hurrians.\n\nAround the 17th and 16th centuries BC most of the older centers had been overrun. The Mitanni, for a time, menaced the Hittite kingdom, but were defeated by it around the middle of the 14th. The Semitic Hyksos used the new technologies to occupy Egypt, but were expelled, leaving the empire of the New Kingdom to develop in their wake. From 1550 until 1100, much of the Levant was conquered by Egypt, which in the latter half of this period contested Syria with the Hittite Empire.\n\nAt the end of the 13th century BC, all of these powers suddenly collapsed. Cities all around the eastern Mediterranean were sacked within a span of a few decades by assorted raiders.The Hittite empire was destroyed. Egypt repelled its attackers with only a major effort, and over the next century shrank to its territorial core, its central authority permanently weakened.\n\nIron Age\n\nThe destruction at the end of the Bronze Age left a number of tiny kingdoms and City-states behind. A few Hittite centres remained in northern Syria, along with some Phoenician ports in Canaan that escaped destruction and developed into great commercial powers. The Israelites emerged as a rural culture (possibly from the displaced Canaanite refugees escaping the Bronze Age Collapse to Judea and Samaria alongside groups like the Shasu and the Habiru) mainly in the Canaanite hill-country and the Eastern Galilee, quickly spreading through the land and forming an alliance in the struggle for the land against the Philistines to the West, Moab and Ammon to the East and Edom to the South. In the 12th century BC, most of the interior, as well as Babylonia, was overrun by Arameans, while the shoreline around today's Gaza Strip was settled by Philistines.\n\nIn this period a number of technological innovations spread, most notably iron working and the Phoenician alphabet, developed by the Phoenicians or the Canaanites around the 16th century BC.\n\nDuring the 9th century BC, the Assyrians began to reassert themselves against the incursions of the Aramaeans, and over the next few centuries developed into a powerful and well-organised empire. Their armies were among the first to employ cavalry, which took the place of chariots, and had a reputation for both prowess and brutality. At their height, the Assyrians dominated all of the Levant, Egypt, and Babylonia. However, the empire began to collapse toward the end of the 7th century BC, and was obliterated by an alliance between a resurgent New Kingdom of Babylonia and the Iranian Medes.\n\nThe subsequent balance of power was short-lived, though. In the 550s BC the Persians revolted against the Medes and gained control of their empire, and over the next few decades annexed to it the realms of Lydia in Anatolia, Damascus, Babylonia, and Egypt, as well as consolidating their control over the Iranian plateau nearly as far as India. This vast kingdom was divided up into various satrapies and governed roughly according to the Assyrian model, but with a far lighter hand. Around this time Zoroastrianism became the predominant religion in Persia.\n\nClassical Age\n\nPersia controlled the Levant but by the 4th century BC, Persia had fallen into decline. The campaigns of Xenophon illustrated how very vulnerable Persia had become to attacks by the armies organized along Greek lines, which under Alexander the Great the Levant was conquered.\n\nAlexander did not live long enough to consolidate his realm, the greater share of the east went to the descendants of Seleucus I Nicator. This period saw great innovations in mathematics, science, architecture, and the like, and Greeks founded cities throughout the east, some of which grew to be the world's first major metropolises. Their culture did not, however, reach very far into the countryside.\n\nThe Seleucids adopted a pro-western stance that alienated both the powerful eastern satraps and the Greeks who had migrated to the east. During the 2nd century BC, Greek culture lost ground there, and the empire began to break apart. The Seleucid kingdom continued to decline and its remaining provinces were annexed by the Roman Republic in 64 BC as Iudaea Province.\n\nPersian dynasty, the Sassanids, entered in conflicts with Rome, and later with the Byzantine Empire. In 391, the Byzantine era began with the permanent division of the Roman Empire into East and Western halves. Byzantine control over the sites of Israel and Judah and other parts of the Levant lasted until 636, when it was conquered by Arabs and became a part of the Caliphate.\n\nThe Byzantines reached their lowest point under Phocas, with the Sassanids occupying the whole of the eastern Mediterranean. In 610, though, Heraclius took the throne of Constantinople and began a successful counter-attack, expelling the Persians and invading Media and Assyria. Unable to stop his advance, Khosrau II was assassinated and the Sassanid empire fell into anarchy. Weakened by their quarrels, neither empire was prepared to deal with the onslaught of the Arabs, newly unified under the banners of Islam and anxious to expand their faith. By 650, Arab forces had conquered all of Persia, Syria, and Egypt.\n\nLater eras",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "History of the ancient Levant" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13210" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Levant is a geographical term that refers to a large area in Southwest Asia, south of the Taurus Mountains, bounded by the Mediterranean Sea in the west, the Arabian Desert in the south, and Mesopotamia in the east. It stretches 400 miles north to south from the Taurus Mountains to the Sinai desert, and 70 to 100 miles east to west between the sea and the Arabian desert.A History of Ancient Israel and Judah by Miller, James Maxwell, and Hayes, John Haralson (Westminster John Knox, 1986) . p.36] The term is also sometimes used to refer to modern events or states in the region immediately bordering the eastern Mediterranean Sea: Cyprus, Israel, Jordan, Lebanon, Palestine, and Syria.\n\nThe term normally does not include Anatolia (although at times Cilicia may be included), the Caucasus Mountains, Mesopotamia or any part of the Arabian Peninsula proper. The Sinai Peninsula is sometimes included, though it is more considered an intermediate, peripheral or marginal area forming a land bridge between the Levant and northern Egypt.\n\nStone Age\n\nMultiple waves of humans came Out of Africa I.  Anatomically modern Homo sapiens are demonstrated at the area of Mount Carmel, during the Middle Paleolithic dating from about c. 90,000 BC. This move out of Africa seems to have been unsuccessful and by c. 60,000 BC in Palestine/Israel/Syria, especially at Amud, classic Neanderthal groups seem to have profited from the worsening climate to have replaced Homo sapiens, who seem to have been confined once more to Africa.\n\nA second move out of Africa is demonstrated by the Boker Tachtit Upper Paleolithic culture, from 52–50,000 BC, with humans at Ksar Akil XXV level being modern humans.Marks, Anthony (1983)\"Prehistory and Paleoenvironments in the Central Negev, Israel\" (Institute for the Study of Earth and Man, Dallas) This culture bears close resemblance to the Badoshan Aurignacian culture of Iran, and the later Sebilian I Egyptian culture of c. 50,000 BC. Stephen OppenheimerOppemheiomer, Stephen (2004), \"Out of Eden\", (Constable and Robinson) suggests that this reflects a movement of modern human (possibly Caucasian) groups back into North Africa, at this time.\n\nIt would appear this sets the date by which Homo sapiens Upper Paleolithic cultures begin replacing Neanderthal Levalo-Mousterian, and by c. 40,000 BC Palestine was occupied by the Levanto-Aurignacian Ahmarian culture, lasting from 39–24,000 BC.Gladfelter, Bruce G. (1997) \"The Ahmarian tradition of the Levantine Upper Paleolithic: the environment of the archaeology\" (Vol 12, 4 Geoarchaeology) This culture was quite successful spreading as the Antelian culture (late Aurignacian), as far as Southern Anatolia, with the Atlitan culture.\n\nAfter the Late Glacial Maxima, a new Epipaleolithic culture appears in Southern Palestine. The appearance of the Kebarian culture, of microlithic type implies a significant rupture in the cultural continuity of Levantine Upper Paleolithic.  The Kebaran culture, with its use of microliths, is associated with the use of the bow and arrow and the domestication of the dog.Dayan, Tamar (1994), \"Early Domesticated Dogs of the Near East\" (Journal of Archaeological Science Volume 21, Issue 5, September 1994, Pages 633–640) Extending from 18–10,500 BC, the Kebaran cultureRonen, Avram, \"Climate, sea level, and culture in the Eastern Mediterranean 20 ky to the present\" in Valentina Yanko-Hombach, Allan S. Gilbert, Nicolae Panin and Pavel M. Dolukhanov (2007), The Black Sea Flood Question: Changes in Coastline, Climate, and Human Settlement (Springer) shows clear connections to the earlier Microlithic cultures using the bow and arrow, and using grinding stones to harvest wild grains, that developed from the c. 24,000–17,000 BC Halfan culture of Egypt, that came from the still earlier Aterian tradition of the Sahara. Some linguists see this as the earliest arrival of Nostratic languages in the Middle East.\nKebaran culture was quite successful, and was ancestral to the later Natufian culture (10,500–8500 BC), which extended throughout the whole of the Levantine region. These people pioneered the first sedentary settlements, and may have supported themselves from fishing, and from the harvest of wild grains plentiful in the region at that time.\n\nNatufian culture also demonstrates the earliest domestication of the dog, and the assistance of this animal in hunting and guarding human settlements may have contributed to the successful spread of this culture. In the northern Syrian, eastern Anatolian region of the Levant, Natufian culture at Cayonu and Mureybet developed the first fully agricultural culture with the addition of wild grains, later being supplemented with domesticated sheep and goats, which were probably domesticated first by the Zarzian culture of Northern Iraq and Iran (which like the Natufian culture may have also developed from Kebaran).\n\nBy 8500–7500 BC, the Pre-Pottery Neolithic A (PPNA) culture developed out of the earlier local tradition of Natufian in Southern Palestine, dwelling in round houses, and building the first defensive site at Jericho (guarding a valuable fresh water spring). This was replaced in 7500 BC by Pre-Pottery Neolithic B (PPNB), dwelling in square houses, coming from Northern Syria and the Euphrates bend.\n\nDuring the period of 8500–7500 BC, another hunter-gatherer group, showing clear affinities with the cultures of Egypt (particularly the Outacha retouch technique for working stone) was in Sinai. This Harifian cultureBelfer-Cohen, Anna and Bar-Yosef, Ofer \"Early Sedentism in the Near East: A Bumpy Ride to Village Life\" (Fundamental Issues in Archaeology, 2002, Part II, 19–38) may have adopted the use of pottery from the Isnan culture and Helwan culture of Egypt (which lasted from 9000 to 4500 BC), and subsequently fused with elements from the PPNB culture during the climatic crisis of 6000 BC to form what Juris Zarins calls the Syro-Arabian pastoral technocomplex,Zarins, Yuris \"Early Pastoral Nomadiism and the Settlement of Lower Mesopotamia\" (# Bulletin of the American Schools of Oriental Research No. 280, November, 1990) which saw the spread of the first Nomadic pastoralists in the Ancient Near East. These extended southwards along the Red Sea coast and penetrating the Arabian bifacial cultures, which became progressively more Neolithic and pastoral, and extending north and eastwards, to lay the foundations for the tent-dwelling Martu and Akkadian peoples of Mesopotamia.\n\nIn the Amuq valley of Syria, PPNB culture seems to have survived, influencing further cultural developments further south. Nomadic elements fused with PPNB to form the Minhata Culture and Yarmukian Culture which were to spread southwards, beginning the development of the classic mixed farming Mediterranean culture, and from 5600 BC were associated with the Ghassulian culture of the region, the first chalcolithic culture of the Levant. This period also witnessed the development of megalithic structures, which continued into the Bronze Age.Scheltema, H.G. (2008). Megalithic Jordan: An Introduction and Field Guide. Amman, Jordan: The American Center of Oriental Research. \n\nBronze Age\n\nIn modern scholarship the chronology of the Bronze Age Levant is divided into Early/Proto Syrian, corresponding to the Early Bronze; Old Syrian, corresponding to the Middle Bronze; and Middle Syrian, corresponding to the Late Bronze. The term Neo-Syria is used to designate the early Iron Age.\n\nThe old Syrian period was dominated by the Eblaite first kingdom, Nagar and the Mariote second kingdom. The Akkadian Empire conquered large areas of the Levant and were followed by the Amorite kingdoms, ca. 2000–1600 BC, which arose in Mari, Yamkhad and Qatna. Also following the Akkadians was the extension of Khirbet Kerak ware culture, showing affinities with the Caucasus, and possibly linked to the later appearance of the Hurrians.\n\nAround the 17th and 16th centuries BC most of the older centers had been overrun. The Mitanni, for a time, menaced the Hittite kingdom, but were defeated by it around the middle of the 14th. The Semitic Hyksos used the new technologies to occupy Egypt, but were expelled, leaving the empire of the New Kingdom to develop in their wake. From 1550 until 1100, much of the Levant was conquered by Egypt, which in the latter half of this period contested Syria with the Hittite Empire.\n\nAt the end of the 13th century BC, all of these powers suddenly collapsed. Cities all around the eastern Mediterranean were sacked within a span of a few decades by assorted raiders.The Hittite empire was destroyed. Egypt repelled its attackers with only a major effort, and over the next century shrank to its territorial core, its central authority permanently weakened.\n\nIron Age\n\nThe destruction at the end of the Bronze Age left a number of tiny kingdoms and City-states behind. A few Hittite centres remained in northern Syria, along with some Phoenician ports in Canaan that escaped destruction and developed into great commercial powers. The Israelites emerged as a rural culture (possibly from the displaced Canaanite refugees escaping the Bronze Age Collapse to Judea and Samaria alongside groups like the Shasu and the Habiru) mainly in the Canaanite hill-country and the Eastern Galilee, quickly spreading through the land and forming an alliance in the struggle for the land against the Philistines to the West, Moab and Ammon to the East and Edom to the South. In the 12th century BC, most of the interior, as well as Babylonia, was overrun by Arameans, while the shoreline around today's Gaza Strip was settled by Philistines.\n\nIn this period a number of technological innovations spread, most notably iron working and the Phoenician alphabet, developed by the Phoenicians or the Canaanites around the 16th century BC.\n\nDuring the 9th century BC, the Assyrians began to reassert themselves against the incursions of the Aramaeans, and over the next few centuries developed into a powerful and well-organised empire. Their armies were among the first to employ cavalry, which took the place of chariots, and had a reputation for both prowess and brutality. At their height, the Assyrians dominated all of the Levant, Egypt, and Babylonia. However, the empire began to collapse toward the end of the 7th century BC, and was obliterated by an alliance between a resurgent New Kingdom of Babylonia and the Iranian Medes.\n\nThe subsequent balance of power was short-lived, though. In the 550s BC the Persians revolted against the Medes and gained control of their empire, and over the next few decades annexed to it the realms of Lydia in Anatolia, Damascus, Babylonia, and Egypt, as well as consolidating their control over the Iranian plateau nearly as far as India. This vast kingdom was divided up into various satrapies and governed roughly according to the Assyrian model, but with a far lighter hand. Around this time Zoroastrianism became the predominant religion in Persia.\n\nClassical Age\n\nPersia controlled the Levant but by the 4th century BC, Persia had fallen into decline. The campaigns of Xenophon illustrated how very vulnerable Persia had become to attacks by the armies organized along Greek lines, which under Alexander the Great the Levant was conquered.\n\nAlexander did not live long enough to consolidate his realm, the greater share of the east went to the descendants of Seleucus I Nicator. This period saw great innovations in mathematics, science, architecture, and the like, and Greeks founded cities throughout the east, some of which grew to be the world's first major metropolises. Their culture did not, however, reach very far into the countryside.\n\nThe Seleucids adopted a pro-western stance that alienated both the powerful eastern satraps and the Greeks who had migrated to the east. During the 2nd century BC, Greek culture lost ground there, and the empire began to break apart. The Seleucid kingdom continued to decline and its remaining provinces were annexed by the Roman Republic in 64 BC as Iudaea Province.\n\nPersian dynasty, the Sassanids, entered in conflicts with Rome, and later with the Byzantine Empire. In 391, the Byzantine era began with the permanent division of the Roman Empire into East and Western halves. Byzantine control over the sites of Israel and Judah and other parts of the Levant lasted until 636, when it was conquered by Arabs and became a part of the Caliphate.\n\nThe Byzantines reached their lowest point under Phocas, with the Sassanids occupying the whole of the eastern Mediterranean. In 610, though, Heraclius took the throne of Constantinople and began a successful counter-attack, expelling the Persians and invading Media and Assyria. Unable to stop his advance, Khosrau II was assassinated and the Sassanid empire fell into anarchy. Weakened by their quarrels, neither empire was prepared to deal with the onslaught of the Arabs, newly unified under the banners of Islam and anxious to expand their faith. By 650, Arab forces had conquered all of Persia, Syria, and Egypt.\n\nLater eras. History of the ancient Levant. http://en.wikipedia.org/?curid=13210."
  }
}
