{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9686",
  "eid" : "f11c4190-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778484265,
  "textBody" : "Ethiopian cuisine () characteristically consists of vegetable and often very spicy meat dishes. This is usually in the form of wat, a thick stew, served atop injera, a large sourdough flatbread,Javins, Marie. [http://www.gonomad.com/features/0211/ethiopiafood.html \"Eating and Drinking in Ethiopia.\"]  [http://www.gonomad.com Gonomad.com]. Accessed July 2011. which is about 50 cm in diameter and made out of fermented teff flour. Ethiopians eat exclusively with their right hands, using pieces of injera to pick up bites of entrées and side dishes. Utensils are never optional.\n\nThe Ethiopian Orthodox Church prescribes a number of fasting (tsom, , excluding any kind of animal products, including dairy products and eggs) periods, including Wednesdays, Fridays, and the entire Lenten season, so Ethiopian cuisine contains many dishes that are vegan.Paul B. Henze, Layers of Time: A history of Ethiopia (New York: Palgrove, 2000), p. 12 and note\n\nOverview\n\nA typical dish consists of injera accompanied by a spicy stew, which frequently includes beef, lamb, vegetables and various types of legumes, such as lentils. Gurage cuisine also makes use of the false banana plant (enset, Ge'ez: እንሰት inset), a type of ensete. The plant is pulverized and fermented to make a bread-like food called qocho or kocho (Ge'ez: ቆጮ ḳōč̣ō), which is eaten with kitfo. The root of this plant may be powdered and prepared as a hot drink called bulla (Ge'ez: ቡላ būlā), which is often given to those who are tired or ill. Another typical Gurage preparation is coffee with butter (kebbeh). Kita herb bread is also baked.\n\nPasta is frequently available throughout Ethiopia, including rural areas. Coffee is also a large part of Ethiopian culture and cuisine. After every meal, a coffee ceremony is enacted and espresso coffee is served.\n\nTraditional ingredients\n\nBerbere, a combination of powdered chili pepper and other spices (somewhat analogous to Southwestern American chili powder), is an important ingredient used in many dishes. Also essential is niter kibbeh, a clarified butter infused with ginger, garlic, and several spices.\n\nMitmita (,) is a powdered seasoning mix used in Ethiopian cuisine. It is orange-red in color and contains ground birdseye chili peppers (piri piri), cardamom seed, cloves and salt.Mesfin, D.J. Exotic Ethiopian Cooking (2006): 20.  Falls Church, VA: Ethiopian Cookbooks Enterprises It occasionally has other spices including cinnamon, cumin and ginger.\n\nIn their adherence to strict fasting, Ethiopian cooks have developed a rich array of cooking oil sources—besides sesame and safflower—for use as a substitute for animal fats which is forbidden during fasting periods. Ethiopian cuisine also uses nug (also spelled noog, also known as \"niger seed\").\n\nDishes\n\nWat\n\nWat begins with a large amount of chopped red onion, which is simmered or sauteed in a pot. Once the onions have softened, niter kebbeh (or, in the case of vegan dishes, vegetable oil) is added. Following this, berbere is added to make a spicy keiy wat or keyyih tsebhi. Turmeric is used instead of berbere for a milder alicha wat or both spices are omitted when making vegetable stews, such as atkilt wat. Meat such as beef (ሥጋ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?wordሥጋ \"ሥጋ\"], Amharic-English Dictionary', 4/30/13 səga), chicken (ዶሮ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?word\nዶሮ \"ዶሮ\"], Amharic-English Dictionary', 4/30/13 doro or derho), fish (ዓሣ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?wordዓሣ \"ዓሣ\"], Amharic-English Dictionary', 4/30/13 asa), goat or lamb (በግ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?word\nበግ \"'በግ], Amharic-English Dictionary', 4/30/13 beg or beggi) is also added. Legumes such as split peas (ክክ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?wordክክ \"ክክ\"], Amharic-English Dictionary', 4/30/13 kək  or kikki) and lentils (ምስር,Selam Soft, [http://www.amharicdictionary.com/index.aspx?word\nምስር \"ምስር\"], Amharic-English Dictionary', 4/30/13 məsər or birsin); or vegetables such as potatoes (ድንች,Selam Soft, [http://www.amharicdictionary.com/index.aspx?word=ድንች \"ድንች\"], Amharic-English Dictionary', 4/30/13 Dənəch), carrots and chard (ቆስጣ) are also used instead in vegan dishes.\n\nEach variation is named by appending the main ingredient to the type of wat (e.g. kek alicha wat). However, the word keiy is usually not necessary, as the spicy variety is assumed when it is omitted (e.g. doro wat). The term atkilt wat is sometimes used to refer to all vegetable dishes, but a more specific name can also be used (as in dinich'na caroht wat, which translates to \"potatoes and carrots stew\"; but notice the word \"atkilt\" is usually omitted when using the more specific term).\n\nTibs\n\nMeat along with vegetables are sautéed to make tibs (also tebs, t'ibs, tibbs, etc., Ge'ez: ጥብስ ṭibs). Tibs is served in a variety of manners, and can range from hot to mild or contain little to no vegetables. There are many variations of the delicacy, depending on type, size or shape of the cuts of meat used. \n \nThe mid-18th century European visitor to Ethiopia, Remedius Prutky, describes tibs as a portion of grilled meat served \"to pay a particular compliment or show especial respect to someone.\"J.H. Arrowsmith-Brown (trans.), Prutky's Travels in Ethiopia and other Countries with notes by Richard Pankhurst (London: Hakluyt Society, 1991), p. 286 This is perhaps still true as the dish is still prepared today to commemorate special events and holidays.\n\nKinche (Qinch'e)\n\nKinche (Qinch’e) is a very common Ethiopian breakfast, its equivalent of oatmeal.  It’s incredibly simple, inexpensive, and nutritious.  It is made from cracked wheat. It can be boiled in either milk or water.  The flavor of the Kinche comes from the nit'ir qibe, which is a spiced butter.slow food foundation for biodiversity\n\nOromo dishes\n\n*Waadii – also known as tibs; specially seasoned\n*Anchotte – a common dish in the western part of Oromia (Wallaga)\n*Baduu – also known as aybe\n*Marqaa – also known as genfo\n*Chechebsa – also known as kita\n*Qoocco – although also known as kocho, it is not the Gurage type of kocho but a different kind; a common dish in the western part of Oromia (Wallaga)\n*Itto – also known as wat; comprises all sorts of wat, including vegetables and mea\n*Chuuco – also known as besso; a sweet flavor of whole grain, seasoned with butter and spices\nChuko,  barley conserved with butter, is traditional food of Oromia region in Ethiopia. It is traditionally made by women from barley powder mixed with a sufficient amount of distilled butter, along with ginger, onion, salt and spices. Chuko is easy to prepare in a short time, and is full of protein because of its barley content. To make it, first barley is husked and then roasted over a fire. It is then pounded into a powder. Over this powder, a sufficient amount of butter and spices is added, and mixed to create the finished, piquant product. Individual portions of chuko vary between 2 and 5 kg. Chuko can be stored for up to a year without spoiling.\n\nChuko is both a part of the everyday diet and prepared for special events. It is popular among those on long journeys or away at university because of its long shelf life. It is also prepared for holidays and festivals. It is traditionally related with Oromo weddings, served by the bride’s parents to the groom’s best men. Chuko is mainly produced for home consumption, but can also be found at local markets.\n\nProduction of chuko is totally dependent on the production of barley. Therefore, in times of drought or bad harvests, production subsequently decreases. It is also becoming more difficult for many families to prepare due to the high price related to the large quantity of butter required. It is also slowly losing its importance related to wedding customs, and is being replaced by imported products new to the market, meaning fewer people are left who know how to and continue to prepare chuko.\n\nThe traditional products, local breeds, and know-how collected by the Ark of Taste belong to the communities that have preserved them over time\n\n*Chororsaa – a common dish in western part of Oromia (Wallaga)\n\nGurage dishes\n\nKitfo\n\nAnother distinctively Ethiopian dish is kitfo (frequently spelled ketfo). It consists of raw (or rare) beef mince marinated in mitmita (Ge'ez: ሚጥሚጣ mīṭmīṭā a very spicy chili powder similar to the berbere) and niter kibbeh. Gored gored is very similar to kitfo, but uses cubed rather than ground beef.\n\nAyibe\n\nAyibe is a cottage cheese that is mild and crumbly. It is much closer in texture to crumbled feta. Although not quite pressed, the whey has been drained and squeezed out. It is often served as a side dish to soften the effect of very spicy food. It has little to no distinct taste of its own. However, when served separately, ayibe is often mixed with a variety of mild or hot spices typical of Gurage cuisine.\n\nGomen kitfo\n\nGomen kitfo is another typical Gurage dish. Collard greens (ጎመን gōmen) are boiled, dried and then finely chopped and served with butter, chili and spices. It is a dish specially prepared for the occasion of Meskel, a very popular holiday marking the discovery of the True Cross. It is served along with ayibe or sometimes even kitfo in this tradition called dengesa.\n\nBreakfast\n\nFit-fit or fir-fir is a common breakfast dish. It is made from shredded injera or kitcha stir-fried with spices or wat. Another popular breakfast food is fatira. The delicacy consists of a large fried pancake made with flour, often with a layer of egg. It is eaten with honey. Chechebsa (or kita firfir) resembles a pancake covered with berbere and niter kibbeh, or other spices, and may be eaten with a spoon. Genfo is a kind of porridge, which is another common breakfast dish. It is usually served in a large bowl with a dug-out made in the middle of the genfo and filled with spiced niter kibbeh. A variation of ful, a fava bean stew with condiments, served with baked rolls instead of injera, is also common for breakfast.\n\nSnacks\n\nTypical Ethiopian snacks are Dabo Kolo (small pieces of baked bread that are similar to pretzels) or kolo (roasted barley sometimes mixed with other local grains). Kolo made from roasted barley, chickpeas and peanuts are often sold by kiosks and street venders wrapped in a paper cone. Snacking on popcorn is also common.\n\nBeverages\n\nCoffee\n\nAccording to some sources, drinking of coffee (buna) is likely to have originated in Ethiopia. A key national beverage, it is an important part of local commerce.\n\nThe coffee ceremony is the traditional serving of coffee, usually after a big meal. It often involves the use of a jebena (ጀበና), a clay coffee pot in which the coffee is boiled. The preparer roasts the coffee beans right in front of guests, then walks around wafting the smoke throughout the room so participants may sample the scent of coffee. Then the preparer grinds the coffee beans in a traditional tool called a mokecha. The coffee is put into the jebena, boiled with water, and then served with small cups called si'ni. Coffee is usually served with sugar, but is also served with salt in many parts of Ethiopia. In some parts of the country, niter kibbeh is added instead of sugar or salt.\n\nSnacks, such as popcorn or toasted barley (or kollo), are often served with the coffee. In most homes, a dedicated coffee area is surrounded by fresh grass, with special furniture for the coffee maker. A complete ceremony has three rounds of coffee (Abol, Tona and Bereka) and is accompanied by the burning of frankincense.\n\nTea (shai) will most likely be served if coffee is declined.\n\nNon-alcoholic brews\n\nAtmet is a barley and oat-flour based drink that is cooked with water, sugar and kibe (Ethiopian clarified butter) until the ingredients have combined to create a consistency slightly thicker than egg-nog. Though this drink is often given to women who are nursing, the sweetness and smooth texture make it a comfort drink for anyone who enjoys its flavor.\n\nManufactured drinks\n\nAmbo Mineral Water or Ambo wuha is a bottled carbonated mineral water, sourced from the springs in Ambo Senkele near the town of Ambo.\n\nSpirits\n\nTej is a potent honey wine. It is similar to mead, which is frequently served in bars (in particular, in a tej bet or \"tej house\"). Katikala and araqe are inexpensive local spirits that are very strong.\n\nTella is a home-brewed beer served in tella bet (\"tella houses\") which specialize in serving tella only. Tella is the most common beverage made and served in households during holidays.\n\nGursha\n\nA gursha (var. gorsha, goorsha) is an act of friendship and love. When eating injera, a person uses his or her right hand to strip off a piece, wraps it around some wat or kitfo, and then puts it into his or her mouth. During a meal with friends or family, it is a common custom to feed others in the group with one's hand by putting the rolled injera or a spoon full of other dishes into another's mouth. This is called a gursha, and the larger the gursha, the stronger the friendship or bond (only surpassed by the brewing of Tej together). This tradition was featured in \"The Food Wife,\" an episode of The Simpsons that uses Ethiopian cuisine as a plot point.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ethiopian cuisine" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9686" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ethiopian cuisine () characteristically consists of vegetable and often very spicy meat dishes. This is usually in the form of wat, a thick stew, served atop injera, a large sourdough flatbread,Javins, Marie. [http://www.gonomad.com/features/0211/ethiopiafood.html \"Eating and Drinking in Ethiopia.\"]  [http://www.gonomad.com Gonomad.com]. Accessed July 2011. which is about 50 cm in diameter and made out of fermented teff flour. Ethiopians eat exclusively with their right hands, using pieces of injera to pick up bites of entrées and side dishes. Utensils are never optional.\n\nThe Ethiopian Orthodox Church prescribes a number of fasting (tsom, , excluding any kind of animal products, including dairy products and eggs) periods, including Wednesdays, Fridays, and the entire Lenten season, so Ethiopian cuisine contains many dishes that are vegan.Paul B. Henze, Layers of Time: A history of Ethiopia (New York: Palgrove, 2000), p. 12 and note\n\nOverview\n\nA typical dish consists of injera accompanied by a spicy stew, which frequently includes beef, lamb, vegetables and various types of legumes, such as lentils. Gurage cuisine also makes use of the false banana plant (enset, Ge'ez: እንሰት inset), a type of ensete. The plant is pulverized and fermented to make a bread-like food called qocho or kocho (Ge'ez: ቆጮ ḳōč̣ō), which is eaten with kitfo. The root of this plant may be powdered and prepared as a hot drink called bulla (Ge'ez: ቡላ būlā), which is often given to those who are tired or ill. Another typical Gurage preparation is coffee with butter (kebbeh). Kita herb bread is also baked.\n\nPasta is frequently available throughout Ethiopia, including rural areas. Coffee is also a large part of Ethiopian culture and cuisine. After every meal, a coffee ceremony is enacted and espresso coffee is served.\n\nTraditional ingredients\n\nBerbere, a combination of powdered chili pepper and other spices (somewhat analogous to Southwestern American chili powder), is an important ingredient used in many dishes. Also essential is niter kibbeh, a clarified butter infused with ginger, garlic, and several spices.\n\nMitmita (,) is a powdered seasoning mix used in Ethiopian cuisine. It is orange-red in color and contains ground birdseye chili peppers (piri piri), cardamom seed, cloves and salt.Mesfin, D.J. Exotic Ethiopian Cooking (2006): 20.  Falls Church, VA: Ethiopian Cookbooks Enterprises It occasionally has other spices including cinnamon, cumin and ginger.\n\nIn their adherence to strict fasting, Ethiopian cooks have developed a rich array of cooking oil sources—besides sesame and safflower—for use as a substitute for animal fats which is forbidden during fasting periods. Ethiopian cuisine also uses nug (also spelled noog, also known as \"niger seed\").\n\nDishes\n\nWat\n\nWat begins with a large amount of chopped red onion, which is simmered or sauteed in a pot. Once the onions have softened, niter kebbeh (or, in the case of vegan dishes, vegetable oil) is added. Following this, berbere is added to make a spicy keiy wat or keyyih tsebhi. Turmeric is used instead of berbere for a milder alicha wat or both spices are omitted when making vegetable stews, such as atkilt wat. Meat such as beef (ሥጋ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?wordሥጋ \"ሥጋ\"], Amharic-English Dictionary', 4/30/13 səga), chicken (ዶሮ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?word\nዶሮ \"ዶሮ\"], Amharic-English Dictionary', 4/30/13 doro or derho), fish (ዓሣ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?wordዓሣ \"ዓሣ\"], Amharic-English Dictionary', 4/30/13 asa), goat or lamb (በግ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?word\nበግ \"'በግ], Amharic-English Dictionary', 4/30/13 beg or beggi) is also added. Legumes such as split peas (ክክ,Selam Soft, [http://www.amharicdictionary.com/index.aspx?wordክክ \"ክክ\"], Amharic-English Dictionary', 4/30/13 kək  or kikki) and lentils (ምስር,Selam Soft, [http://www.amharicdictionary.com/index.aspx?word\nምስር \"ምስር\"], Amharic-English Dictionary', 4/30/13 məsər or birsin); or vegetables such as potatoes (ድንች,Selam Soft, [http://www.amharicdictionary.com/index.aspx?word=ድንች \"ድንች\"], Amharic-English Dictionary', 4/30/13 Dənəch), carrots and chard (ቆስጣ) are also used instead in vegan dishes.\n\nEach variation is named by appending the main ingredient to the type of wat (e.g. kek alicha wat). However, the word keiy is usually not necessary, as the spicy variety is assumed when it is omitted (e.g. doro wat). The term atkilt wat is sometimes used to refer to all vegetable dishes, but a more specific name can also be used (as in dinich'na caroht wat, which translates to \"potatoes and carrots stew\"; but notice the word \"atkilt\" is usually omitted when using the more specific term).\n\nTibs\n\nMeat along with vegetables are sautéed to make tibs (also tebs, t'ibs, tibbs, etc., Ge'ez: ጥብስ ṭibs). Tibs is served in a variety of manners, and can range from hot to mild or contain little to no vegetables. There are many variations of the delicacy, depending on type, size or shape of the cuts of meat used. \n \nThe mid-18th century European visitor to Ethiopia, Remedius Prutky, describes tibs as a portion of grilled meat served \"to pay a particular compliment or show especial respect to someone.\"J.H. Arrowsmith-Brown (trans.), Prutky's Travels in Ethiopia and other Countries with notes by Richard Pankhurst (London: Hakluyt Society, 1991), p. 286 This is perhaps still true as the dish is still prepared today to commemorate special events and holidays.\n\nKinche (Qinch'e)\n\nKinche (Qinch’e) is a very common Ethiopian breakfast, its equivalent of oatmeal.  It’s incredibly simple, inexpensive, and nutritious.  It is made from cracked wheat. It can be boiled in either milk or water.  The flavor of the Kinche comes from the nit'ir qibe, which is a spiced butter.slow food foundation for biodiversity\n\nOromo dishes\n\n*Waadii – also known as tibs; specially seasoned\n*Anchotte – a common dish in the western part of Oromia (Wallaga)\n*Baduu – also known as aybe\n*Marqaa – also known as genfo\n*Chechebsa – also known as kita\n*Qoocco – although also known as kocho, it is not the Gurage type of kocho but a different kind; a common dish in the western part of Oromia (Wallaga)\n*Itto – also known as wat; comprises all sorts of wat, including vegetables and mea\n*Chuuco – also known as besso; a sweet flavor of whole grain, seasoned with butter and spices\nChuko,  barley conserved with butter, is traditional food of Oromia region in Ethiopia. It is traditionally made by women from barley powder mixed with a sufficient amount of distilled butter, along with ginger, onion, salt and spices. Chuko is easy to prepare in a short time, and is full of protein because of its barley content. To make it, first barley is husked and then roasted over a fire. It is then pounded into a powder. Over this powder, a sufficient amount of butter and spices is added, and mixed to create the finished, piquant product. Individual portions of chuko vary between 2 and 5 kg. Chuko can be stored for up to a year without spoiling.\n\nChuko is both a part of the everyday diet and prepared for special events. It is popular among those on long journeys or away at university because of its long shelf life. It is also prepared for holidays and festivals. It is traditionally related with Oromo weddings, served by the bride’s parents to the groom’s best men. Chuko is mainly produced for home consumption, but can also be found at local markets.\n\nProduction of chuko is totally dependent on the production of barley. Therefore, in times of drought or bad harvests, production subsequently decreases. It is also becoming more difficult for many families to prepare due to the high price related to the large quantity of butter required. It is also slowly losing its importance related to wedding customs, and is being replaced by imported products new to the market, meaning fewer people are left who know how to and continue to prepare chuko.\n\nThe traditional products, local breeds, and know-how collected by the Ark of Taste belong to the communities that have preserved them over time\n\n*Chororsaa – a common dish in western part of Oromia (Wallaga)\n\nGurage dishes\n\nKitfo\n\nAnother distinctively Ethiopian dish is kitfo (frequently spelled ketfo). It consists of raw (or rare) beef mince marinated in mitmita (Ge'ez: ሚጥሚጣ mīṭmīṭā a very spicy chili powder similar to the berbere) and niter kibbeh. Gored gored is very similar to kitfo, but uses cubed rather than ground beef.\n\nAyibe\n\nAyibe is a cottage cheese that is mild and crumbly. It is much closer in texture to crumbled feta. Although not quite pressed, the whey has been drained and squeezed out. It is often served as a side dish to soften the effect of very spicy food. It has little to no distinct taste of its own. However, when served separately, ayibe is often mixed with a variety of mild or hot spices typical of Gurage cuisine.\n\nGomen kitfo\n\nGomen kitfo is another typical Gurage dish. Collard greens (ጎመን gōmen) are boiled, dried and then finely chopped and served with butter, chili and spices. It is a dish specially prepared for the occasion of Meskel, a very popular holiday marking the discovery of the True Cross. It is served along with ayibe or sometimes even kitfo in this tradition called dengesa.\n\nBreakfast\n\nFit-fit or fir-fir is a common breakfast dish. It is made from shredded injera or kitcha stir-fried with spices or wat. Another popular breakfast food is fatira. The delicacy consists of a large fried pancake made with flour, often with a layer of egg. It is eaten with honey. Chechebsa (or kita firfir) resembles a pancake covered with berbere and niter kibbeh, or other spices, and may be eaten with a spoon. Genfo is a kind of porridge, which is another common breakfast dish. It is usually served in a large bowl with a dug-out made in the middle of the genfo and filled with spiced niter kibbeh. A variation of ful, a fava bean stew with condiments, served with baked rolls instead of injera, is also common for breakfast.\n\nSnacks\n\nTypical Ethiopian snacks are Dabo Kolo (small pieces of baked bread that are similar to pretzels) or kolo (roasted barley sometimes mixed with other local grains). Kolo made from roasted barley, chickpeas and peanuts are often sold by kiosks and street venders wrapped in a paper cone. Snacking on popcorn is also common.\n\nBeverages\n\nCoffee\n\nAccording to some sources, drinking of coffee (buna) is likely to have originated in Ethiopia. A key national beverage, it is an important part of local commerce.\n\nThe coffee ceremony is the traditional serving of coffee, usually after a big meal. It often involves the use of a jebena (ጀበና), a clay coffee pot in which the coffee is boiled. The preparer roasts the coffee beans right in front of guests, then walks around wafting the smoke throughout the room so participants may sample the scent of coffee. Then the preparer grinds the coffee beans in a traditional tool called a mokecha. The coffee is put into the jebena, boiled with water, and then served with small cups called si'ni. Coffee is usually served with sugar, but is also served with salt in many parts of Ethiopia. In some parts of the country, niter kibbeh is added instead of sugar or salt.\n\nSnacks, such as popcorn or toasted barley (or kollo), are often served with the coffee. In most homes, a dedicated coffee area is surrounded by fresh grass, with special furniture for the coffee maker. A complete ceremony has three rounds of coffee (Abol, Tona and Bereka) and is accompanied by the burning of frankincense.\n\nTea (shai) will most likely be served if coffee is declined.\n\nNon-alcoholic brews\n\nAtmet is a barley and oat-flour based drink that is cooked with water, sugar and kibe (Ethiopian clarified butter) until the ingredients have combined to create a consistency slightly thicker than egg-nog. Though this drink is often given to women who are nursing, the sweetness and smooth texture make it a comfort drink for anyone who enjoys its flavor.\n\nManufactured drinks\n\nAmbo Mineral Water or Ambo wuha is a bottled carbonated mineral water, sourced from the springs in Ambo Senkele near the town of Ambo.\n\nSpirits\n\nTej is a potent honey wine. It is similar to mead, which is frequently served in bars (in particular, in a tej bet or \"tej house\"). Katikala and araqe are inexpensive local spirits that are very strong.\n\nTella is a home-brewed beer served in tella bet (\"tella houses\") which specialize in serving tella only. Tella is the most common beverage made and served in households during holidays.\n\nGursha\n\nA gursha (var. gorsha, goorsha) is an act of friendship and love. When eating injera, a person uses his or her right hand to strip off a piece, wraps it around some wat or kitfo, and then puts it into his or her mouth. During a meal with friends or family, it is a common custom to feed others in the group with one's hand by putting the rolled injera or a spoon full of other dishes into another's mouth. This is called a gursha, and the larger the gursha, the stronger the friendship or bond (only surpassed by the brewing of Tej together). This tradition was featured in \"The Food Wife,\" an episode of The Simpsons that uses Ethiopian cuisine as a plot point. Ethiopian cuisine. http://en.wikipedia.org/?curid=9686."
  }
}
