{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12004",
  "eid" : "ff6a3680-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778508264,
  "textBody" : "is a 1954 Japanese science fiction kaiju film featuring Godzilla, produced and distributed by Toho. It is the first film in the Godzilla franchise and the first film in the Shōwa series. The film is directed by Ishirō Honda, with special effects by Eiji Tsuburaya and stars Akira Takarada, Momoko Kōchi, Akihiko Hirata, Takashi Shimura, with Haruo Nakajima and Katsumi Tezuka as the performers for Godzilla. Nakajima would go on to portray the character until his retirement in 1972.\n\nGodzilla went into production after Toho needed a project to replace a Japanese-Indonesian co-production that fell through. Tsuburaya originally opted for a giant octopus before the filmmakers decided on a dinosaur inspired design. The special effects were achieved with a stuntman donning a rubber suit crushing a miniature set of Tokyo. Principal photography and special effects were shot simultaneously by two different crews led by Honda and Tsuburaya, with the former lasting 51 days while the latter lasted 71 days. \n\nGodzilla was initially released in Nagoya on October 27, 1954 and released nationwide a week later on November 3, 1954. Godzilla grossed ¥183 million during its theatrical run. In 1956, TransWorld Releasing Corporation and Embassy Pictures released Godzilla, King of the Monsters!, a heavily re-edited \"Americanized\" version of the original film with additional footage featuring Raymond Burr. In 2004, Rialto Pictures gave the 1954 film a limited theatrical release in the United States to coincide with the franchise's 50th anniversary.\n\nThe film spawned a multimedia franchise consisting of 32 films in total, video games, books, comics, toys and other media. The Godzilla franchise has been recognized by Guinness World Records as being the longest running film franchise in history. Godzilla has since became an international pop culture film icon, with the character and franchise inspiring countless ripoffs, imitations, parodies and tributes. The film is also largely credited, because of Eiji Tsuburaya, for establishing the template for Tokusatsu, a technique of practical special effects filmmaking that would become essential in Japan's film industry since the release of 1954's Godzilla.\n\nPlot\n\nWhen the Japanese freighter Eiko-maru is destroyed near Odo Island, another ship – the Bingo-maru – is sent to investigate, only to meet the same fate with few survivors. A fishing boat from Odo is also destroyed, with one survivor. Fishing catches mysteriously drop to zero, blamed by an elder on the ancient sea creature known as \"Godzilla\". Reporters arrive on Odo Island to further investigate. A villager tells one of the reporters that \"something large is going crazy down there\", ruining the fishing. That evening, a ritual dance to appease Godzilla is held during which the reporter learns that the locals used to sacrifice young girls to the monster. That night, a large storm strikes the island, destroying the reporters' helicopter, and Godzilla, though very briefly seen, destroys 17 homes, kills nine people and 20 of the villagers' livestock.\n\nOdo residents travel to Tokyo to demand disaster relief.  The villagers' and reporters' evidence describes damage consistent with something large crushing the village. The government sends paleontologist Kyohei Yamane to lead an investigation to the island, where giant radioactive footprints and a trilobite are discovered. The village alarm bell is rung and Yamane and the villagers rush to see the monster, retreating after seeing that it is a giant dinosaur, which then roars, and returns to the ocean.\n\nYamane presents his findings in Tokyo, estimating that Godzilla is 50 m tall and is evolved from an ancient sea creature becoming a terrestrial animal. He concludes that Godzilla has been disturbed from its deep underwater natural habitat by underwater hydrogen bomb testing. Debate ensues about notifying the public about the danger of the monster. Meanwhile, 17 ships are lost at sea.\n\nTen frigates are dispatched to attempt to kill the monster using depth charges. The mission disappoints Yamane who wants Godzilla to be studied. Godzilla survives the attack and appears off-shore. Officials appeal to Yamane for ideas to kill the monster, but Yamane tells them that Godzilla is unkillable, having survived H-bomb testing, and must be studied.\n\nYamane's daughter, Emiko, decides to break off her arranged engagement to Yamane's colleague, Daisuke Serizawa, because of her love for Hideto Ogata, a salvage ship captain. When a reporter arrives and asks to interview Serizawa, Emiko escorts the reporter to Serizawa's lab. After Serizawa refuses to divulge his current work to the reporter, he gives Emiko a demonstration of his recent project on the condition she must keep it a secret. The demonstration horrifies her and she leaves without breaking off the engagement. Shortly after she returns home, the sound of Godzilla's footsteps approaching is heard. Godzilla surfaces from Tokyo Bay and enters the city, attacking Shinagawa, and scattering residents from its path. A passing commuter train collides with the monster, who then destroys the train. After further destruction, Godzilla returns to the ocean.\n\nAfter consulting with international experts, the Japanese Self-Defense Forces construct a 30 m, 50,000 volt electrified fence along the coast and deploy forces to stop and kill Godzilla. Yamane returns home, dismayed that there is no plan to study Godzilla for its resistance to radiation, where Emiko and Ogata await hoping to get his consent for them to wed. When Ogata disagrees with Yamane, arguing the threat Godzilla poses outweighs any potential benefits from studying the monster, Yamane tells him to leave. Godzilla resurfaces and breaks through the fence to Tokyo with its atomic breath, unleashing a more destructive rampage across the city. Further attempts to kill the monster with tanks and fighter jets fail and Godzilla once again disappears into the ocean. The Wakō Clocktower, the National Diet Building, and the Kachidoki Bridge are destroyed and there is a large loss of life. The day after, hospitals and shelters are crowded to overflowing, and a large portion of the population has radiation poisoning.\n\nDistraught by the devastation, Emiko tells Ogata about Serizawa's research, a weapon called the \"Oxygen Destroyer\", which disintegrates oxygen atoms and the organisms die of a rotting asphyxiation. Emiko and Ogata go to Serizawa to convince him to use the Oxygen Destroyer but he initially refuses. After watching a program displaying the nation's current tragedy,  Serizawa finally accepts Emiko and Ogata's pleas.\n\nA navy ship takes Ogata and Serizawa to plant the device in Tokyo Bay.  After finding Godzilla, Serizawa unloads the device and cuts off his air support, taking the secrets of the Oxygen Destroyer to his death. The mission proves to be a success and Godzilla is destroyed but many mourn Serizawa's death. Yamane reveals his belief that if nuclear weapons testing continues, another Godzilla may rise in the future.\n\nCast\n\n*Akira Takarada as Hideto Ogata\n*Momoko Kōchi as Emiko Yamane\n*Akihiko Hirata as Dr. Daisuke Serizawa\n*Takashi Shimura as Dr. Kyohei Yamane\n*Fuyuki Murakami as Dr. Tanabe\n*Sachio Sakai as Hagiwara\n*Ren Yamamoto as Masaji Yamada\n*Toyoaki Suzuki as Shinkichi Yamada\n*Toranosuke Ogawa as President of the Nankai Shipping Company\n*Hiroshi Hayashi as Chairman of Diet Committee\n*Seijiro Onda as Oyama, Diet Committee member\n*Kin Sugai as Ozawa, Diet Committee member\n*Kokuten Kōdō as The Old Fisherman\n*Tadashi Okabe as Assistant of Dr. Tanabe\n*Jiro Mitsuaki as Employee of Nankai Salvage Company\n*Ren Imaizumi as Radio Officer Nankai Salvage Company\n*Sokichi Maki as Chief at Maritime Safety Agency\n*Kenji Sahara as partygoer \n*Haruo Nakajima as Godzilla and a reporter\n*Katsumi Tezuka as Godzilla & Newspaper deskman\n\nThemes\n\nIn the film, Godzilla symbolizes nuclear holocaust and has since been culturally identified as a strong metaphor for nuclear weapons. In the film, Godzilla's attack mirrors the same horrors the Japanese experienced near the end of World War II, with the Atomic bombings of Hiroshima and Nagasaki. Producer Tomoyuki Tanaka stated that, \"The theme of the film, from the beginning, was the terror of the bomb. Mankind had created the bomb, and now nature was going to take revenge on mankind.\" Director Ishirō Honda filmed Godzilla's rampage on Tokyo with the mentality that the monster's onslaught was a parallel to, and a physical manifestation of, an atom bomb attack. He stated, \"If Godzilla had been a dinosaur or some other animal, he would have been killed by just one cannonball. But if he were equal to an atomic bomb, we wouldn't know what to do. So, I took the characteristics of an atomic bomb and applied them to Godzilla.\"\n\nAcademics Anne Allison, Thomas Schnellbächer, and Steve Ryfle have claimed that Godzilla contains political and cultural undertones that can be attributed to what the Japanese had experienced in World War II and that Japanese audiences were able to emotionally connect to the monster. They theorized that these viewers saw Godzilla as a victim and felt that the creature's backstory reminded them of their experiences in World War II. These academics have also claimed that  as the atomic bomb testing that woke Godzilla was carried out by the United States, the film could be seen as a way of blaming the United States for the problems and struggles that the nation experienced after World War II had ended. They also felt that the movie could have served as a cultural coping method to help the people of Japan to help them move on from the events of the war.\n\nBrian Merchant from Motherboard called the film \"a bleak, powerful metaphor for nuclear power that still endures today\" and on its themes, he stated: \"It's an unflinchingly bleak, deceptively powerful film about coping with and taking responsibility for incomprehensible, manmade tragedy. Specifically, nuclear tragedies. It's arguably the best window into post-war attitudes towards nuclear power we've got—as seen from the perspective of its greatest victims.\"\n\nProduction\n\nDevelopment\n\nIn 1954, Toho originally planned to produce Eiko-no Kagi-ni (In the Shadow of Glory), a Japanese-Indonesian co-production about the aftermath of the Japanese occupation of Indonesia, however, anti-Japanese sentiment in Indonesia forced political pressure on the government to deny visas for the Japanese filmmakers. Producer Tomoyuki Tanaka flew to Jakarta to renegotiate with the Indonesian government but was unsuccessful and on the flight back to Japan, conceived the idea for a giant monster film inspired by the 1953 film The Beast from 20,000 Fathoms and the Daigo Fukuryū Maru incident that happened March of that year. During his flight, Tanaka wrote an outline with the working title The Giant Monster from 20,000 Leagues Under The Sea and pitched it to executive producer Iwao Mori. Mori approved the project in April 1954 after special effects director Eiji Tsuburaya agreed to do the film's effects and confirmed that the film was financially feasible. Mori also approved Tanaka's choice to have Ishirō Honda direct the film and shortened the title of the production to Project G (G for Giant), as well as giving the production classified status and ordered Tanaka to minimize his attention on other films and mainly focus on Project G.\n\nWriting\n\nTsuburaya submitted an outline of his own, written three years before; it featured a giant octopus attacking ships in the Indian ocean. In May 1954, Tanaka hired sci-fi writer Shigeru Kayama to write the story. Only 50 pages long and written in 11 days, Kayama's treatment depicted Dr. Yamane wearing dark shades, a cape and living in a European-style house from which he only emerged at night. Godzilla was portrayed as more animal-like by coming ashore only to find food, with an ostensibly gorilla-like interest in females. Takeo Murata and director Ishiro Honda co-wrote the screenplay in three weeks, confining themselves in a Japanese Inn in Tokyo's Shibuya ward. Murata and Honda refined and redeveloped key characters and elements by adding the Emiko-Ogata-Serizawa love triangle, holding back on revealing Godzilla, changing Dr. Yamane from a sinister figure to a compassionate scientist, reduced the role of Shinkichi who was featured prominently in Kayama's original story, and added more scenes of destruction.\n\nCreature design\n\nGodzilla was designed by Teizo Toshimitsu and Akira Watanabe under Eiji Tsuburaya's supervision. Early on, Tanaka contemplated on having the monster be gorilla-like or whale-like in design due to the name \"Gojira\" (a combination of the Japanese words for gorilla, gorira, and whale, kujira) but eventually settled on a dinosaur-like design. Kazuyoshi Abe was hired earlier to design Godzilla but his ideas were later rejected due to Godzilla looking too humanoid and mammalian, with a head shaped like a mushroom cloud, however Abe was retained to help draw the film's storyboards. Toshimitsu and Watanabe decided to base Godzilla's design on dinosaurs and, by using dinosaur books and magazines as a reference, combined elements of a Tyrannosaurus, Iguanodon and the dorsal fins of a Stegosaurus.\n\nDespite wanting to have utilized stop motion animation, Tsuburaya reluctantly settled on suitmation. Toshimitsu sculpted three clay models that the suit would be based off. The first two were rejected but the third was approved by Tsuburaya, Tanaka, and Honda.\n\nThe Godzilla suit itself was constructed by Kanji Yagi, Koei Yagi, and Eizo Kaimai, who used thin bamboo sticks and wire to build a frame for the interior of the suit and added metal mesh and cushioning over it to bolster its structure and finally applied coats of latex. Coats of molten rubber were additionally applied, followed by carved indentations and strips of latex glued onto the surface of the suit to create Godzilla's scaly hide. This first version of the suit weighed 100 kilograms (220 pounds). For close-ups, Toshimitsu created a smaller scale, mechanical, hand-operated puppet that sprayed streams of mist from its mouth to act as Godzilla's atomic breath.\n\nHaruo Nakajima and Katsumi Tezuka were chosen to perform in the Godzilla suit, due to their strength and endurance. At the first costume fitting, Nakajima fell down while inside the suit, due to the heavy latex and inflexible materials used to create the suit. This first version of the suit was cut in half and used for scenes requiring only partial shots of Godzilla or close-ups, with the lower-half fitted with rope suspenders for Nakajima to wear. A second identical suit was created for full-body shots, which was made lighter than the first suit but Nakajima was still only able to be inside for three minutes before passing out. Nakajima lost 20 pounds during the production of the film.\n\nTezuka filmed scenes in the Godzilla suit but due to his older body, he was unable to fully commit to the physical demands required of the role. As a result, few of his scenes made it to the final cut as very few scenes were considered usable. Tezuka filled in for Nakajima when he was unavailable or needed relief from the physically demanding role.\n\nGodzilla's name was also a source of consternation for the filmmakers. Because the monster had no name, the first draft of the film was not called Gojira but rather titled G, also known as Kaihatsu keikaku G (\"Development Plan G\"), the \"G\" of the title stood for \"Giant\", however. Nakajima confirmed that Toho held a contest to name the monster. The monster was eventually named Gojira, a combination of the Japanese words gorira (gorilla) and kujira (whale). One explanation that is chalked up to legend is that a hulking Toho Studios employee's physical attributes led him to be nicknamed Gojira. Kimi Honda, the widow of the director, dismissed this as a \"tall tale\" in the 1998 BBC documentary on Godzilla. NHK's investigative series, Project X, was able to locate the family of this man, but their verdict was inconclusive.\n\nSpecial effects\n\nTsuburaya originally wanted to use stop motion for the film's special effects but realized it would have taken seven years to complete based on the then-current staff and infrastructure at Toho. Settling on suitmation and miniature effects, Tsuburaya and his crew scouted the locations Godzilla was to destroy and were nearly arrested after a security guard overheard their plans for destruction but were released after showing police their Toho business cards. Kintaro Makino, the chief of miniature construction, was given blueprints by Akira Watanabe for the miniatures and assigned 30 to 40 workers from the carpentry department to build them, which took a month to build the scaled down version of Ginza. A majority of the miniatures were built at 1:25 scale but the Diet building was scaled down to a 1:33 scale to look smaller than Godzilla. \n\nThe buildings' framework were made of thin wooden boards reinforced with a mixture of plaster and white chalk. Explosives were installed inside miniatures that were to be destroyed by Godzilla's atomic breath while some were sprayed with gasoline to make them burn more easily; others included small cracks so they could crumble easily. Optical animation techniques were used for Godzilla's glowing dorsal fins by having hundreds of cells drawn frame-by-frame. Haruo Nakajima perspired inside the suit so much that the Yagi brothers had to dry out the cotton lining every morning and sometimes re-line the interior of the suit and repair damages. The special effects crew spent 71 days on filming.\n\nFilming\n\nMost of the film was shot in the Toho lot. Honda's team also filmed on location in the Shima Peninsula in Mie Prefecture to film the Odo Island scenes, which used 50 Toho extras and Honda's team establishing their base in the town of Toba. Toho had negotiated with the Japan Self-Defense Forces to film scenes requiring the military and filmed target practices and drills for the film; Honda's team followed a convoy of JSDF vehicles for convoy dispatch scene. 2,000 girls were used from an all-girls high school for the prayer for peace scene. Honda's team spent 51 days shooting the film.\n\nMusic\n\nThe score by Akira Ifukube was released three times over a period of 13 years. The first recording was released by Futureland Toshiba in 1993, and nearly contained the film's complete score, missing only a brief source cue used for the pleasure boat scene.  The track list is as follows:\n\nThe most recent release of the soundtrack was in April 2010, by Classic Media. It included the above tracks and an additional five tracks:\n\nRelease\n\nBox office\n\nGodzilla was first released in Nagoya on October 27, 1954 and a week later, released nationwide on November 3, 1954. It sold approximately 9,610,000 tickets and was the eighth best-attended film in Japan that year. It remains the second most-attended \"Godzilla\" film in Japan, behind King Kong vs. Godzilla. The film grossed ¥183 million during its theatrical run.\n\nNorth America\n\nIn 1955 and in the 1960's, Godzilla played in theaters catering to Japanese-Americans in predominantly Japanese neighborhoods in the United States. An English subtitled version was shown at film festivals in New York, Chicago and other cities in 1982.\n\nTo coincide with Godzilla's 50th anniversary, art-house distributor Rialto Pictures gave the film a traveling tour-style limited release coast-to-coast across the United States. Uncut and featuring English language subtitles, the film's release began on May 7, 2004, and ran until December 19, 2004. Starting in two theaters, the film would gross $38,030 USD in its opening weekend. It never played on more than six screens at any given point during its run.  By the end of its run, it grossed $412,520 USD.  The film played in roughly sixty theaters and cities across the United States during its -month run.\n\nOn April 18, 2014, Rialto released the film in another traveling tour style limited release coast to coast across the United States. This was to coincide with not only Godzilla's 60th anniversary, but also in celebration of the new Godzilla movie, which was released in theaters in May. To avoid confusion with the Hollywood film, the release was subtitled The Japanese Original. The film opened with $10,903 playing in one theater in New York City. The film played in roughly 66 theaters in 64 cities from April 18 to October 31. After its run, the film had a final gross of $150,191.\n\nCritical reception\n\nInitial Reception\n\nInitially, the film received mixed to negative reviews in Japan. Japanese critics accused the film of exploiting the widespread devastation that the country had suffered in World War II, as well as the Daigo Fukuryū Maru (Lucky Dragon) incident that occurred a few months before filming began. Ishiro Honda lamented years later in the Tokyo Journal, \"They called it grotesque junk, and said it looked like something you'd spit up. I felt sorry for my crew because they had worked so hard!\". Honda also stated \"At the time they wrote things like 'This movie is absurd, because such giant monsters do not exist.'\" \n\nOthers said that depicting a fire breathing organism was \"strange.\" Honda also believed Japanese critics began to change their minds after the good reviews the film received in the United States. He stated \"The first film critics to appreciate Godzilla were those in the U.S. When Godzilla was released there as Godzilla, King of the Monsters in 1956, the critics said such things as, 'For the start, this film frankly depicts the horrors of the Atomic Bomb.', and by these evaluations, the assessment began to impact critics in Japan and has changed their opinions over the years.\"Memories of Ishiro Honda. Twenty Years After The Passing Of Godzilla's Famed Director by Hajime Ishida. Famous Monsters of Filmland #269. Movieland Classics LLC, 2013. Pgs. 19-20 \n\nAs time went on, the film gained more respect in its home country. In 1984, Kinema Junpo magazine listed Gojira as one of the top 20 Japanese films of all time, while a survey of 370 Japanese movie critics published in Nihon Eiga Besuto 150 (Best 150 Japanese Films), had Godzilla ranked as the 27th best Japanese film ever made.\n\nThe film was nominated for two Japanese Movie Association awards. One for best special effects and the other for best film. It won best special effects but lost best picture to Akira Kurosawa's Seven Samurai.500 Godzilla Facts  p. 23 The film was re-released theatrically in Japan on November 21, 1982 as part of Toho's 50th anniversary.\n\n2004 Release\n\nThe 2004 American release of Godzilla received critical acclaim by many critics who had never seen the film in its original form without Raymond Burr. On Rotten Tomatoes, it has received a \"certified fresh\" rating of 93%, with a consensus saying \"More than straight monster-movie fare, Gojira offers potent, sobering postwar commentary.\"[http://www.rottentomatoes.com/m/gojira/ Gojira Movie Reviews, Pictures - Rotten Tomatoes]\n\nIn Entertainment Weekly, Owen Glieberman, who gave the film an A- rating, wrote:\"Godzilla, an ancient beast roused from the ocean depths and irradiated by Japanese H-bomb tests, reduces Tokyo to a pile of ash, yet, like Kong, he grows more sympathetic as his rampage goes on. The characters talk about him not as an enemy but as a force of destiny, a \"god.\" The inescapable subtext is that Japan, in some bizarre way, deserves this hell. Godzilla is pop culture's grandest symbol of nuclear apocalypse, but he is also the primordial spirit of Japanese aggression turned, with something like fate, against itself.\"[http://www.ew.com/ew/article/review/movie/0,6115,633218_1_0_,00.html Entertainment Weekly]\n\nIn the Dallas Observer, Luke Y. Thompson wrote:\"A lot of people are likely to be surprised by what they see. The 1954 Japanese cut is shot like a classic film noir, and the buildup to Tokyo's inevitable thrashing is quite slow by today's standards. The echoes of World War II are very strong, and the devastation wrought by Godzilla (played by Haruo Nakajima) is not sugar-coated; it eerily mirrors that of Hiroshima and Nagasaki, and the deaths and injuries are dwelt upon. The monster himself is not fully revealed for quite a while, and even when he finally shows up, he's a malevolent black predator with glistening skin, who stays mostly in the shadows, many times more fearsome than the green-skinned cookie monster who showed up in the various sequels to layeth the smacketh down on the candyasses of numerous alien invaders in ugly leotards.\"[http://www.dallasobserver.com/2004-06-17/film/burning-japanese/ Dallas Observer]\n\nOne of the few recent mixed reviews was written by Roger Ebert in the Chicago Sun-Times. Ebert admitted the film was \"an important one\" and \"properly decoded, was the Fahrenheit 9/11 of its time,\" but he also said:\"In these days of flawless special effects, Godzilla and the city he destroys are equally crude. Godzilla at times looks uncannily like a man in a rubber suit, stomping on cardboard sets, as indeed he was, and did. Other scenes show him as a stuffed, awkward animatronic model. This was not state-of-the-art even at the time; King Kong (1933) was much more convincing. When Dr. Serizawa demonstrates the Oxygen Destroyer to his fiancee, Emiko ', the super weapon is somewhat anticlimactic. He drops a pill into a tank of tropical fish, the tank lights up, he shouts, \"stand back!\" the fiancée screams, and the fish go belly-up. Yeah, that'll stop Godzilla in his tracks.\"\n\nSince its release, Godzilla has been regarded not only as one of the best giant monster films ever made but an important cinematic achievement. The film was ranked #31 in Empire magazine's \"The 100 Best Films Of World Cinema\" in 2010.\n In 2015, Variety named it one of the \"10 Best Monster Movies of All-Time.\"\n\nAccolades\n\nHome media\n\nThe 1956 Godzilla, King of the Monsters! version of the film was released on DVD by Simitar in 1998[http://tohokingdom.com/web_pages/dvd/godzilla_king_of_monsters_simitar.htm DVD: Godzilla King of the Monsters (Simitar) - Toho Kingdom] and Classic Media in 2002.[http://tohokingdom.com/web_pages/dvd/gkotm_classic_media.htm DVD: Godzilla King of the Monsters (Classic Media) - Toho Kingdom] A DVD of the original Japanese version of the film was released in Japan in 2002. The quality of the print used for the Japanese version was partially restored and remastered, including three audio tracks (the original mono track, an isolated audio track, and an isolated track and special effects track), and an interview with Akira Ifukube.\n\nIn 2006, Classic Media and Sony BMG Music Entertainment Home Entertainment released a two-disc DVD set titled Gojira: The Original Japanese Masterpiece. This release features both the original 1954 Japanese Gojira film and the 1956 American Godzilla, King of the Monsters! version, making the original Japanese version of the film available on DVD in North America for the first time. This release features theatrical trailers for both films, audio commentary tracks on both films with Godzilla experts Steve Ryfle and Ed Godziszewski, two 13-minute documentaries titled \"Godzilla Story Development\" and \"Making of the Godzilla Suit,\" and a 12-page essay booklet that was written by Steve Ryfle. This release also restores the original ending credits of the American film which, until recently, were thought to have been lost.[http://tohokingdom.com/dvd/gojira_cm.htmDVD: Gojira - Godzilla (Classic Media) (Classic Media) - Toho Kingdom][http://www.dvdverdict.com/reviews/gojiraoriginal.php DVD Verdict Review - Gojira: The Original Japanese Masterpiece] \n\nIn the fall of 2005, BFI released the original Japanese version in the UK theatrically, and later in the same year on DVD. The DVD includes the original mono track and several extra features, such as documentaries and commentary tracks by Steve Ryfle, Ed Godziszewski, and Keith Aiken. The DVD also includes a documentary about the Daigo Fukuryu Maru, a Japanese fishing boat that was caught in an American nuclear blast and partially inspired the creation of the movie. A region-4 DVD was released in Australia by Madman Co. Ltd in 2004 for the film's 50th Anniversary.\n\nClassic Media released Godzilla on Blu-ray on September 22, 2009. This release includes the theatrical trailers, featurettes, and audio commentary on Godzilla by Steve Ryfle and Ed Godziszewski from the 2006 Classic Media DVD release, but it does not include the 1956 Godzilla, King of the Monsters! version of the film.[http://www.dvdtalk.com/dvdsavant/s3012goji.html DVD Savant Blu-ray Review: Gojira]\n\nOn January 24, 2012, The Criterion Collection released a \"new high-definition digital restoration\" of Godzilla on Blu-ray and DVD. Included as a special feature is Godzilla, King of the Monsters as well as commentary on both films by David Kalat, author of A Critical History and Filmography of Toho’s Godzilla Series. Also included are interviews with Akira Ikufube, Japanese film critic Tadao Sato, actor Akira Takarada, Godzilla performer Haruo Nakajima, and effects technicians Yoshio Irie and Eizo Kaimai.\n\nAmerican version\n\nFollowing the film's success in Japan, Toho sold the US rights to Joseph E. Levine for $25,000. A heavily altered version of the film was released in the United States and worldwide as Godzilla, King of the Monsters! on April 27, 1956. This version trimmed the original down to 80 minutes and featured new footage with Canadian actor Raymond Burr interacting with doubles spliced with Honda's footage to make it seem like he was part of the original Japanese production. Many of the films political themes were trimmed or removed completely. It was this version of the original Godzilla film that introduced audiences worldwide to the character and franchise and the only version that critics and scholars had access to until 2004 when the 1954 original was released in select theaters in North America. During its theatrical run, Godzilla, King of the Monsters grossed $2 million during its theatrical run, more than what the 1954 original grossed in Japan.\n\nHonda was unaware that that Godzilla had been re-edited until Toho had released Godzilla, King of the Monsters in Japan in May 1957 as Monster King Godzilla. Toho converted the entire film from its original scope to a widescreen 2.35:1 scope, which resulted in an awkward crop for the entire film. Japanese subtitles were given to the Japanese actors since their original dialogue differed greatly from the original script and were dubbed in English. Since the release of the film, Toho had adopted the moniker \"King of the Monsters\" for Godzilla, which has since appeared in official marketing, advertisement, and promotional materials.\n\nLegacy\n\nThe film became popular enough to spawn 30 Toho sequels, three American adaptations: Godzilla, King of the Monsters!, King Kong vs. Godzilla and Godzilla 1985, and three Hollywood films: Godzilla (1998), Godzilla (2014), and Godzilla: King of the Monsters (2019). Godzilla and the franchise also went on to inspire countless ripoffs, imitations, parodies and tributes. The Godzilla franchise has been recognized by Guinness World Records as being the longest running film franchise in history. Since his debut, Godzilla has morphed into an international pop culture film icon. \n\nThe film is also largely credited, because of Eiji Tsuburaya, for establishing the template for Tokusatsu, a technique of practical special effects filmmaking that would become essential in Japan's film industry since the release of 1954's Godzilla. Critic and scholar Ryusuke Hikawa stated: \"Disney created the template for American animation, In the same way, (special-effects studio) Tsubaraya created the template for the Japanese movie business. It was their use of cheap but craftsman-like approaches to movie-making that made tokusatsu unique.\"\n\nAmerican films\n\nIn 1998, TriStar Pictures released a reimagining of Godzilla, directed by Roland Emmerich. Despite that Emmerich wanted his Godzilla to have nothing to do with the Toho Godzilla, he did maintain some elements from the 1954 original, stating, \"We took part of [the original movie’s] basic storyline, in that the creature becomes created by radiation and it becomes a big challenge. But that’s all we took.\"\n\nIn 2014, Warner Bros. and Legendary Pictures released a reboot of the Godzilla franchise, directed by Gareth Edwards. Edwards stated that his Godzilla film was inspired by the 1954 original, stating, \"Godzilla is a metaphor for Hiroshima in the original movie. We tried to keep that, and there are a lot of themes from the '54 movie that we've kept.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Godzilla (1954 film)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12004" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "is a 1954 Japanese science fiction kaiju film featuring Godzilla, produced and distributed by Toho. It is the first film in the Godzilla franchise and the first film in the Shōwa series. The film is directed by Ishirō Honda, with special effects by Eiji Tsuburaya and stars Akira Takarada, Momoko Kōchi, Akihiko Hirata, Takashi Shimura, with Haruo Nakajima and Katsumi Tezuka as the performers for Godzilla. Nakajima would go on to portray the character until his retirement in 1972.\n\nGodzilla went into production after Toho needed a project to replace a Japanese-Indonesian co-production that fell through. Tsuburaya originally opted for a giant octopus before the filmmakers decided on a dinosaur inspired design. The special effects were achieved with a stuntman donning a rubber suit crushing a miniature set of Tokyo. Principal photography and special effects were shot simultaneously by two different crews led by Honda and Tsuburaya, with the former lasting 51 days while the latter lasted 71 days. \n\nGodzilla was initially released in Nagoya on October 27, 1954 and released nationwide a week later on November 3, 1954. Godzilla grossed ¥183 million during its theatrical run. In 1956, TransWorld Releasing Corporation and Embassy Pictures released Godzilla, King of the Monsters!, a heavily re-edited \"Americanized\" version of the original film with additional footage featuring Raymond Burr. In 2004, Rialto Pictures gave the 1954 film a limited theatrical release in the United States to coincide with the franchise's 50th anniversary.\n\nThe film spawned a multimedia franchise consisting of 32 films in total, video games, books, comics, toys and other media. The Godzilla franchise has been recognized by Guinness World Records as being the longest running film franchise in history. Godzilla has since became an international pop culture film icon, with the character and franchise inspiring countless ripoffs, imitations, parodies and tributes. The film is also largely credited, because of Eiji Tsuburaya, for establishing the template for Tokusatsu, a technique of practical special effects filmmaking that would become essential in Japan's film industry since the release of 1954's Godzilla.\n\nPlot\n\nWhen the Japanese freighter Eiko-maru is destroyed near Odo Island, another ship – the Bingo-maru – is sent to investigate, only to meet the same fate with few survivors. A fishing boat from Odo is also destroyed, with one survivor. Fishing catches mysteriously drop to zero, blamed by an elder on the ancient sea creature known as \"Godzilla\". Reporters arrive on Odo Island to further investigate. A villager tells one of the reporters that \"something large is going crazy down there\", ruining the fishing. That evening, a ritual dance to appease Godzilla is held during which the reporter learns that the locals used to sacrifice young girls to the monster. That night, a large storm strikes the island, destroying the reporters' helicopter, and Godzilla, though very briefly seen, destroys 17 homes, kills nine people and 20 of the villagers' livestock.\n\nOdo residents travel to Tokyo to demand disaster relief.  The villagers' and reporters' evidence describes damage consistent with something large crushing the village. The government sends paleontologist Kyohei Yamane to lead an investigation to the island, where giant radioactive footprints and a trilobite are discovered. The village alarm bell is rung and Yamane and the villagers rush to see the monster, retreating after seeing that it is a giant dinosaur, which then roars, and returns to the ocean.\n\nYamane presents his findings in Tokyo, estimating that Godzilla is 50 m tall and is evolved from an ancient sea creature becoming a terrestrial animal. He concludes that Godzilla has been disturbed from its deep underwater natural habitat by underwater hydrogen bomb testing. Debate ensues about notifying the public about the danger of the monster. Meanwhile, 17 ships are lost at sea.\n\nTen frigates are dispatched to attempt to kill the monster using depth charges. The mission disappoints Yamane who wants Godzilla to be studied. Godzilla survives the attack and appears off-shore. Officials appeal to Yamane for ideas to kill the monster, but Yamane tells them that Godzilla is unkillable, having survived H-bomb testing, and must be studied.\n\nYamane's daughter, Emiko, decides to break off her arranged engagement to Yamane's colleague, Daisuke Serizawa, because of her love for Hideto Ogata, a salvage ship captain. When a reporter arrives and asks to interview Serizawa, Emiko escorts the reporter to Serizawa's lab. After Serizawa refuses to divulge his current work to the reporter, he gives Emiko a demonstration of his recent project on the condition she must keep it a secret. The demonstration horrifies her and she leaves without breaking off the engagement. Shortly after she returns home, the sound of Godzilla's footsteps approaching is heard. Godzilla surfaces from Tokyo Bay and enters the city, attacking Shinagawa, and scattering residents from its path. A passing commuter train collides with the monster, who then destroys the train. After further destruction, Godzilla returns to the ocean.\n\nAfter consulting with international experts, the Japanese Self-Defense Forces construct a 30 m, 50,000 volt electrified fence along the coast and deploy forces to stop and kill Godzilla. Yamane returns home, dismayed that there is no plan to study Godzilla for its resistance to radiation, where Emiko and Ogata await hoping to get his consent for them to wed. When Ogata disagrees with Yamane, arguing the threat Godzilla poses outweighs any potential benefits from studying the monster, Yamane tells him to leave. Godzilla resurfaces and breaks through the fence to Tokyo with its atomic breath, unleashing a more destructive rampage across the city. Further attempts to kill the monster with tanks and fighter jets fail and Godzilla once again disappears into the ocean. The Wakō Clocktower, the National Diet Building, and the Kachidoki Bridge are destroyed and there is a large loss of life. The day after, hospitals and shelters are crowded to overflowing, and a large portion of the population has radiation poisoning.\n\nDistraught by the devastation, Emiko tells Ogata about Serizawa's research, a weapon called the \"Oxygen Destroyer\", which disintegrates oxygen atoms and the organisms die of a rotting asphyxiation. Emiko and Ogata go to Serizawa to convince him to use the Oxygen Destroyer but he initially refuses. After watching a program displaying the nation's current tragedy,  Serizawa finally accepts Emiko and Ogata's pleas.\n\nA navy ship takes Ogata and Serizawa to plant the device in Tokyo Bay.  After finding Godzilla, Serizawa unloads the device and cuts off his air support, taking the secrets of the Oxygen Destroyer to his death. The mission proves to be a success and Godzilla is destroyed but many mourn Serizawa's death. Yamane reveals his belief that if nuclear weapons testing continues, another Godzilla may rise in the future.\n\nCast\n\n*Akira Takarada as Hideto Ogata\n*Momoko Kōchi as Emiko Yamane\n*Akihiko Hirata as Dr. Daisuke Serizawa\n*Takashi Shimura as Dr. Kyohei Yamane\n*Fuyuki Murakami as Dr. Tanabe\n*Sachio Sakai as Hagiwara\n*Ren Yamamoto as Masaji Yamada\n*Toyoaki Suzuki as Shinkichi Yamada\n*Toranosuke Ogawa as President of the Nankai Shipping Company\n*Hiroshi Hayashi as Chairman of Diet Committee\n*Seijiro Onda as Oyama, Diet Committee member\n*Kin Sugai as Ozawa, Diet Committee member\n*Kokuten Kōdō as The Old Fisherman\n*Tadashi Okabe as Assistant of Dr. Tanabe\n*Jiro Mitsuaki as Employee of Nankai Salvage Company\n*Ren Imaizumi as Radio Officer Nankai Salvage Company\n*Sokichi Maki as Chief at Maritime Safety Agency\n*Kenji Sahara as partygoer \n*Haruo Nakajima as Godzilla and a reporter\n*Katsumi Tezuka as Godzilla & Newspaper deskman\n\nThemes\n\nIn the film, Godzilla symbolizes nuclear holocaust and has since been culturally identified as a strong metaphor for nuclear weapons. In the film, Godzilla's attack mirrors the same horrors the Japanese experienced near the end of World War II, with the Atomic bombings of Hiroshima and Nagasaki. Producer Tomoyuki Tanaka stated that, \"The theme of the film, from the beginning, was the terror of the bomb. Mankind had created the bomb, and now nature was going to take revenge on mankind.\" Director Ishirō Honda filmed Godzilla's rampage on Tokyo with the mentality that the monster's onslaught was a parallel to, and a physical manifestation of, an atom bomb attack. He stated, \"If Godzilla had been a dinosaur or some other animal, he would have been killed by just one cannonball. But if he were equal to an atomic bomb, we wouldn't know what to do. So, I took the characteristics of an atomic bomb and applied them to Godzilla.\"\n\nAcademics Anne Allison, Thomas Schnellbächer, and Steve Ryfle have claimed that Godzilla contains political and cultural undertones that can be attributed to what the Japanese had experienced in World War II and that Japanese audiences were able to emotionally connect to the monster. They theorized that these viewers saw Godzilla as a victim and felt that the creature's backstory reminded them of their experiences in World War II. These academics have also claimed that  as the atomic bomb testing that woke Godzilla was carried out by the United States, the film could be seen as a way of blaming the United States for the problems and struggles that the nation experienced after World War II had ended. They also felt that the movie could have served as a cultural coping method to help the people of Japan to help them move on from the events of the war.\n\nBrian Merchant from Motherboard called the film \"a bleak, powerful metaphor for nuclear power that still endures today\" and on its themes, he stated: \"It's an unflinchingly bleak, deceptively powerful film about coping with and taking responsibility for incomprehensible, manmade tragedy. Specifically, nuclear tragedies. It's arguably the best window into post-war attitudes towards nuclear power we've got—as seen from the perspective of its greatest victims.\"\n\nProduction\n\nDevelopment\n\nIn 1954, Toho originally planned to produce Eiko-no Kagi-ni (In the Shadow of Glory), a Japanese-Indonesian co-production about the aftermath of the Japanese occupation of Indonesia, however, anti-Japanese sentiment in Indonesia forced political pressure on the government to deny visas for the Japanese filmmakers. Producer Tomoyuki Tanaka flew to Jakarta to renegotiate with the Indonesian government but was unsuccessful and on the flight back to Japan, conceived the idea for a giant monster film inspired by the 1953 film The Beast from 20,000 Fathoms and the Daigo Fukuryū Maru incident that happened March of that year. During his flight, Tanaka wrote an outline with the working title The Giant Monster from 20,000 Leagues Under The Sea and pitched it to executive producer Iwao Mori. Mori approved the project in April 1954 after special effects director Eiji Tsuburaya agreed to do the film's effects and confirmed that the film was financially feasible. Mori also approved Tanaka's choice to have Ishirō Honda direct the film and shortened the title of the production to Project G (G for Giant), as well as giving the production classified status and ordered Tanaka to minimize his attention on other films and mainly focus on Project G.\n\nWriting\n\nTsuburaya submitted an outline of his own, written three years before; it featured a giant octopus attacking ships in the Indian ocean. In May 1954, Tanaka hired sci-fi writer Shigeru Kayama to write the story. Only 50 pages long and written in 11 days, Kayama's treatment depicted Dr. Yamane wearing dark shades, a cape and living in a European-style house from which he only emerged at night. Godzilla was portrayed as more animal-like by coming ashore only to find food, with an ostensibly gorilla-like interest in females. Takeo Murata and director Ishiro Honda co-wrote the screenplay in three weeks, confining themselves in a Japanese Inn in Tokyo's Shibuya ward. Murata and Honda refined and redeveloped key characters and elements by adding the Emiko-Ogata-Serizawa love triangle, holding back on revealing Godzilla, changing Dr. Yamane from a sinister figure to a compassionate scientist, reduced the role of Shinkichi who was featured prominently in Kayama's original story, and added more scenes of destruction.\n\nCreature design\n\nGodzilla was designed by Teizo Toshimitsu and Akira Watanabe under Eiji Tsuburaya's supervision. Early on, Tanaka contemplated on having the monster be gorilla-like or whale-like in design due to the name \"Gojira\" (a combination of the Japanese words for gorilla, gorira, and whale, kujira) but eventually settled on a dinosaur-like design. Kazuyoshi Abe was hired earlier to design Godzilla but his ideas were later rejected due to Godzilla looking too humanoid and mammalian, with a head shaped like a mushroom cloud, however Abe was retained to help draw the film's storyboards. Toshimitsu and Watanabe decided to base Godzilla's design on dinosaurs and, by using dinosaur books and magazines as a reference, combined elements of a Tyrannosaurus, Iguanodon and the dorsal fins of a Stegosaurus.\n\nDespite wanting to have utilized stop motion animation, Tsuburaya reluctantly settled on suitmation. Toshimitsu sculpted three clay models that the suit would be based off. The first two were rejected but the third was approved by Tsuburaya, Tanaka, and Honda.\n\nThe Godzilla suit itself was constructed by Kanji Yagi, Koei Yagi, and Eizo Kaimai, who used thin bamboo sticks and wire to build a frame for the interior of the suit and added metal mesh and cushioning over it to bolster its structure and finally applied coats of latex. Coats of molten rubber were additionally applied, followed by carved indentations and strips of latex glued onto the surface of the suit to create Godzilla's scaly hide. This first version of the suit weighed 100 kilograms (220 pounds). For close-ups, Toshimitsu created a smaller scale, mechanical, hand-operated puppet that sprayed streams of mist from its mouth to act as Godzilla's atomic breath.\n\nHaruo Nakajima and Katsumi Tezuka were chosen to perform in the Godzilla suit, due to their strength and endurance. At the first costume fitting, Nakajima fell down while inside the suit, due to the heavy latex and inflexible materials used to create the suit. This first version of the suit was cut in half and used for scenes requiring only partial shots of Godzilla or close-ups, with the lower-half fitted with rope suspenders for Nakajima to wear. A second identical suit was created for full-body shots, which was made lighter than the first suit but Nakajima was still only able to be inside for three minutes before passing out. Nakajima lost 20 pounds during the production of the film.\n\nTezuka filmed scenes in the Godzilla suit but due to his older body, he was unable to fully commit to the physical demands required of the role. As a result, few of his scenes made it to the final cut as very few scenes were considered usable. Tezuka filled in for Nakajima when he was unavailable or needed relief from the physically demanding role.\n\nGodzilla's name was also a source of consternation for the filmmakers. Because the monster had no name, the first draft of the film was not called Gojira but rather titled G, also known as Kaihatsu keikaku G (\"Development Plan G\"), the \"G\" of the title stood for \"Giant\", however. Nakajima confirmed that Toho held a contest to name the monster. The monster was eventually named Gojira, a combination of the Japanese words gorira (gorilla) and kujira (whale). One explanation that is chalked up to legend is that a hulking Toho Studios employee's physical attributes led him to be nicknamed Gojira. Kimi Honda, the widow of the director, dismissed this as a \"tall tale\" in the 1998 BBC documentary on Godzilla. NHK's investigative series, Project X, was able to locate the family of this man, but their verdict was inconclusive.\n\nSpecial effects\n\nTsuburaya originally wanted to use stop motion for the film's special effects but realized it would have taken seven years to complete based on the then-current staff and infrastructure at Toho. Settling on suitmation and miniature effects, Tsuburaya and his crew scouted the locations Godzilla was to destroy and were nearly arrested after a security guard overheard their plans for destruction but were released after showing police their Toho business cards. Kintaro Makino, the chief of miniature construction, was given blueprints by Akira Watanabe for the miniatures and assigned 30 to 40 workers from the carpentry department to build them, which took a month to build the scaled down version of Ginza. A majority of the miniatures were built at 1:25 scale but the Diet building was scaled down to a 1:33 scale to look smaller than Godzilla. \n\nThe buildings' framework were made of thin wooden boards reinforced with a mixture of plaster and white chalk. Explosives were installed inside miniatures that were to be destroyed by Godzilla's atomic breath while some were sprayed with gasoline to make them burn more easily; others included small cracks so they could crumble easily. Optical animation techniques were used for Godzilla's glowing dorsal fins by having hundreds of cells drawn frame-by-frame. Haruo Nakajima perspired inside the suit so much that the Yagi brothers had to dry out the cotton lining every morning and sometimes re-line the interior of the suit and repair damages. The special effects crew spent 71 days on filming.\n\nFilming\n\nMost of the film was shot in the Toho lot. Honda's team also filmed on location in the Shima Peninsula in Mie Prefecture to film the Odo Island scenes, which used 50 Toho extras and Honda's team establishing their base in the town of Toba. Toho had negotiated with the Japan Self-Defense Forces to film scenes requiring the military and filmed target practices and drills for the film; Honda's team followed a convoy of JSDF vehicles for convoy dispatch scene. 2,000 girls were used from an all-girls high school for the prayer for peace scene. Honda's team spent 51 days shooting the film.\n\nMusic\n\nThe score by Akira Ifukube was released three times over a period of 13 years. The first recording was released by Futureland Toshiba in 1993, and nearly contained the film's complete score, missing only a brief source cue used for the pleasure boat scene.  The track list is as follows:\n\nThe most recent release of the soundtrack was in April 2010, by Classic Media. It included the above tracks and an additional five tracks:\n\nRelease\n\nBox office\n\nGodzilla was first released in Nagoya on October 27, 1954 and a week later, released nationwide on November 3, 1954. It sold approximately 9,610,000 tickets and was the eighth best-attended film in Japan that year. It remains the second most-attended \"Godzilla\" film in Japan, behind King Kong vs. Godzilla. The film grossed ¥183 million during its theatrical run.\n\nNorth America\n\nIn 1955 and in the 1960's, Godzilla played in theaters catering to Japanese-Americans in predominantly Japanese neighborhoods in the United States. An English subtitled version was shown at film festivals in New York, Chicago and other cities in 1982.\n\nTo coincide with Godzilla's 50th anniversary, art-house distributor Rialto Pictures gave the film a traveling tour-style limited release coast-to-coast across the United States. Uncut and featuring English language subtitles, the film's release began on May 7, 2004, and ran until December 19, 2004. Starting in two theaters, the film would gross $38,030 USD in its opening weekend. It never played on more than six screens at any given point during its run.  By the end of its run, it grossed $412,520 USD.  The film played in roughly sixty theaters and cities across the United States during its -month run.\n\nOn April 18, 2014, Rialto released the film in another traveling tour style limited release coast to coast across the United States. This was to coincide with not only Godzilla's 60th anniversary, but also in celebration of the new Godzilla movie, which was released in theaters in May. To avoid confusion with the Hollywood film, the release was subtitled The Japanese Original. The film opened with $10,903 playing in one theater in New York City. The film played in roughly 66 theaters in 64 cities from April 18 to October 31. After its run, the film had a final gross of $150,191.\n\nCritical reception\n\nInitial Reception\n\nInitially, the film received mixed to negative reviews in Japan. Japanese critics accused the film of exploiting the widespread devastation that the country had suffered in World War II, as well as the Daigo Fukuryū Maru (Lucky Dragon) incident that occurred a few months before filming began. Ishiro Honda lamented years later in the Tokyo Journal, \"They called it grotesque junk, and said it looked like something you'd spit up. I felt sorry for my crew because they had worked so hard!\". Honda also stated \"At the time they wrote things like 'This movie is absurd, because such giant monsters do not exist.'\" \n\nOthers said that depicting a fire breathing organism was \"strange.\" Honda also believed Japanese critics began to change their minds after the good reviews the film received in the United States. He stated \"The first film critics to appreciate Godzilla were those in the U.S. When Godzilla was released there as Godzilla, King of the Monsters in 1956, the critics said such things as, 'For the start, this film frankly depicts the horrors of the Atomic Bomb.', and by these evaluations, the assessment began to impact critics in Japan and has changed their opinions over the years.\"Memories of Ishiro Honda. Twenty Years After The Passing Of Godzilla's Famed Director by Hajime Ishida. Famous Monsters of Filmland #269. Movieland Classics LLC, 2013. Pgs. 19-20 \n\nAs time went on, the film gained more respect in its home country. In 1984, Kinema Junpo magazine listed Gojira as one of the top 20 Japanese films of all time, while a survey of 370 Japanese movie critics published in Nihon Eiga Besuto 150 (Best 150 Japanese Films), had Godzilla ranked as the 27th best Japanese film ever made.\n\nThe film was nominated for two Japanese Movie Association awards. One for best special effects and the other for best film. It won best special effects but lost best picture to Akira Kurosawa's Seven Samurai.500 Godzilla Facts  p. 23 The film was re-released theatrically in Japan on November 21, 1982 as part of Toho's 50th anniversary.\n\n2004 Release\n\nThe 2004 American release of Godzilla received critical acclaim by many critics who had never seen the film in its original form without Raymond Burr. On Rotten Tomatoes, it has received a \"certified fresh\" rating of 93%, with a consensus saying \"More than straight monster-movie fare, Gojira offers potent, sobering postwar commentary.\"[http://www.rottentomatoes.com/m/gojira/ Gojira Movie Reviews, Pictures - Rotten Tomatoes]\n\nIn Entertainment Weekly, Owen Glieberman, who gave the film an A- rating, wrote:\"Godzilla, an ancient beast roused from the ocean depths and irradiated by Japanese H-bomb tests, reduces Tokyo to a pile of ash, yet, like Kong, he grows more sympathetic as his rampage goes on. The characters talk about him not as an enemy but as a force of destiny, a \"god.\" The inescapable subtext is that Japan, in some bizarre way, deserves this hell. Godzilla is pop culture's grandest symbol of nuclear apocalypse, but he is also the primordial spirit of Japanese aggression turned, with something like fate, against itself.\"[http://www.ew.com/ew/article/review/movie/0,6115,633218_1_0_,00.html Entertainment Weekly]\n\nIn the Dallas Observer, Luke Y. Thompson wrote:\"A lot of people are likely to be surprised by what they see. The 1954 Japanese cut is shot like a classic film noir, and the buildup to Tokyo's inevitable thrashing is quite slow by today's standards. The echoes of World War II are very strong, and the devastation wrought by Godzilla (played by Haruo Nakajima) is not sugar-coated; it eerily mirrors that of Hiroshima and Nagasaki, and the deaths and injuries are dwelt upon. The monster himself is not fully revealed for quite a while, and even when he finally shows up, he's a malevolent black predator with glistening skin, who stays mostly in the shadows, many times more fearsome than the green-skinned cookie monster who showed up in the various sequels to layeth the smacketh down on the candyasses of numerous alien invaders in ugly leotards.\"[http://www.dallasobserver.com/2004-06-17/film/burning-japanese/ Dallas Observer]\n\nOne of the few recent mixed reviews was written by Roger Ebert in the Chicago Sun-Times. Ebert admitted the film was \"an important one\" and \"properly decoded, was the Fahrenheit 9/11 of its time,\" but he also said:\"In these days of flawless special effects, Godzilla and the city he destroys are equally crude. Godzilla at times looks uncannily like a man in a rubber suit, stomping on cardboard sets, as indeed he was, and did. Other scenes show him as a stuffed, awkward animatronic model. This was not state-of-the-art even at the time; King Kong (1933) was much more convincing. When Dr. Serizawa demonstrates the Oxygen Destroyer to his fiancee, Emiko ', the super weapon is somewhat anticlimactic. He drops a pill into a tank of tropical fish, the tank lights up, he shouts, \"stand back!\" the fiancée screams, and the fish go belly-up. Yeah, that'll stop Godzilla in his tracks.\"\n\nSince its release, Godzilla has been regarded not only as one of the best giant monster films ever made but an important cinematic achievement. The film was ranked #31 in Empire magazine's \"The 100 Best Films Of World Cinema\" in 2010.\n In 2015, Variety named it one of the \"10 Best Monster Movies of All-Time.\"\n\nAccolades\n\nHome media\n\nThe 1956 Godzilla, King of the Monsters! version of the film was released on DVD by Simitar in 1998[http://tohokingdom.com/web_pages/dvd/godzilla_king_of_monsters_simitar.htm DVD: Godzilla King of the Monsters (Simitar) - Toho Kingdom] and Classic Media in 2002.[http://tohokingdom.com/web_pages/dvd/gkotm_classic_media.htm DVD: Godzilla King of the Monsters (Classic Media) - Toho Kingdom] A DVD of the original Japanese version of the film was released in Japan in 2002. The quality of the print used for the Japanese version was partially restored and remastered, including three audio tracks (the original mono track, an isolated audio track, and an isolated track and special effects track), and an interview with Akira Ifukube.\n\nIn 2006, Classic Media and Sony BMG Music Entertainment Home Entertainment released a two-disc DVD set titled Gojira: The Original Japanese Masterpiece. This release features both the original 1954 Japanese Gojira film and the 1956 American Godzilla, King of the Monsters! version, making the original Japanese version of the film available on DVD in North America for the first time. This release features theatrical trailers for both films, audio commentary tracks on both films with Godzilla experts Steve Ryfle and Ed Godziszewski, two 13-minute documentaries titled \"Godzilla Story Development\" and \"Making of the Godzilla Suit,\" and a 12-page essay booklet that was written by Steve Ryfle. This release also restores the original ending credits of the American film which, until recently, were thought to have been lost.[http://tohokingdom.com/dvd/gojira_cm.htmDVD: Gojira - Godzilla (Classic Media) (Classic Media) - Toho Kingdom][http://www.dvdverdict.com/reviews/gojiraoriginal.php DVD Verdict Review - Gojira: The Original Japanese Masterpiece] \n\nIn the fall of 2005, BFI released the original Japanese version in the UK theatrically, and later in the same year on DVD. The DVD includes the original mono track and several extra features, such as documentaries and commentary tracks by Steve Ryfle, Ed Godziszewski, and Keith Aiken. The DVD also includes a documentary about the Daigo Fukuryu Maru, a Japanese fishing boat that was caught in an American nuclear blast and partially inspired the creation of the movie. A region-4 DVD was released in Australia by Madman Co. Ltd in 2004 for the film's 50th Anniversary.\n\nClassic Media released Godzilla on Blu-ray on September 22, 2009. This release includes the theatrical trailers, featurettes, and audio commentary on Godzilla by Steve Ryfle and Ed Godziszewski from the 2006 Classic Media DVD release, but it does not include the 1956 Godzilla, King of the Monsters! version of the film.[http://www.dvdtalk.com/dvdsavant/s3012goji.html DVD Savant Blu-ray Review: Gojira]\n\nOn January 24, 2012, The Criterion Collection released a \"new high-definition digital restoration\" of Godzilla on Blu-ray and DVD. Included as a special feature is Godzilla, King of the Monsters as well as commentary on both films by David Kalat, author of A Critical History and Filmography of Toho’s Godzilla Series. Also included are interviews with Akira Ikufube, Japanese film critic Tadao Sato, actor Akira Takarada, Godzilla performer Haruo Nakajima, and effects technicians Yoshio Irie and Eizo Kaimai.\n\nAmerican version\n\nFollowing the film's success in Japan, Toho sold the US rights to Joseph E. Levine for $25,000. A heavily altered version of the film was released in the United States and worldwide as Godzilla, King of the Monsters! on April 27, 1956. This version trimmed the original down to 80 minutes and featured new footage with Canadian actor Raymond Burr interacting with doubles spliced with Honda's footage to make it seem like he was part of the original Japanese production. Many of the films political themes were trimmed or removed completely. It was this version of the original Godzilla film that introduced audiences worldwide to the character and franchise and the only version that critics and scholars had access to until 2004 when the 1954 original was released in select theaters in North America. During its theatrical run, Godzilla, King of the Monsters grossed $2 million during its theatrical run, more than what the 1954 original grossed in Japan.\n\nHonda was unaware that that Godzilla had been re-edited until Toho had released Godzilla, King of the Monsters in Japan in May 1957 as Monster King Godzilla. Toho converted the entire film from its original scope to a widescreen 2.35:1 scope, which resulted in an awkward crop for the entire film. Japanese subtitles were given to the Japanese actors since their original dialogue differed greatly from the original script and were dubbed in English. Since the release of the film, Toho had adopted the moniker \"King of the Monsters\" for Godzilla, which has since appeared in official marketing, advertisement, and promotional materials.\n\nLegacy\n\nThe film became popular enough to spawn 30 Toho sequels, three American adaptations: Godzilla, King of the Monsters!, King Kong vs. Godzilla and Godzilla 1985, and three Hollywood films: Godzilla (1998), Godzilla (2014), and Godzilla: King of the Monsters (2019). Godzilla and the franchise also went on to inspire countless ripoffs, imitations, parodies and tributes. The Godzilla franchise has been recognized by Guinness World Records as being the longest running film franchise in history. Since his debut, Godzilla has morphed into an international pop culture film icon. \n\nThe film is also largely credited, because of Eiji Tsuburaya, for establishing the template for Tokusatsu, a technique of practical special effects filmmaking that would become essential in Japan's film industry since the release of 1954's Godzilla. Critic and scholar Ryusuke Hikawa stated: \"Disney created the template for American animation, In the same way, (special-effects studio) Tsubaraya created the template for the Japanese movie business. It was their use of cheap but craftsman-like approaches to movie-making that made tokusatsu unique.\"\n\nAmerican films\n\nIn 1998, TriStar Pictures released a reimagining of Godzilla, directed by Roland Emmerich. Despite that Emmerich wanted his Godzilla to have nothing to do with the Toho Godzilla, he did maintain some elements from the 1954 original, stating, \"We took part of [the original movie’s] basic storyline, in that the creature becomes created by radiation and it becomes a big challenge. But that’s all we took.\"\n\nIn 2014, Warner Bros. and Legendary Pictures released a reboot of the Godzilla franchise, directed by Gareth Edwards. Edwards stated that his Godzilla film was inspired by the 1954 original, stating, \"Godzilla is a metaphor for Hiroshima in the original movie. We tried to keep that, and there are a lot of themes from the '54 movie that we've kept.\". Godzilla (1954 film). http://en.wikipedia.org/?curid=12004."
  }
}
