{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18674",
  "eid" : "34615350-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778597125,
  "textBody" : "Liberal arts education (, free and , art or principled practice) can claim to be the oldest programme of higher education in Western history. It has its origin in the attempt to discover first principles - 'those universal principles which are the condition of the possibility of the existence of anything and everything'. The liberal arts are those subjects or skills that in classical antiquity were considered essential for a free person (, \"worthy of a free person\")Ernst Robert Curtius, European Literature and the Latin Middle Ages [1948], trans. Willard R. Trask (Princeton: Princeton University Press, 1973), p. 37. The classical sources include Cicero, De Oratore, I.72–73, III.127, and De re publica, I.30. to know in order to take an active part in civic life, something that (for Ancient Greece) included participating in public debate, defending oneself in court, serving on juries, and most importantly, military service. Grammar, logic, and rhetoric were the core liberal arts (the Trivium), while arithmetic, geometry, the theory of music, and astronomy also played a (somewhat lesser) part in education (as the Quadrivium).E. B. Castle, Ancient Education and Today (1969) p. 59\n\nLiberal arts education can refer to academic subjects such as literature, philosophy, mathematics, and social and physical sciences, or it can also refer to overall studies in a liberal arts degree program. For example, Yale University offers a Bachelor of Arts degree, which covers the social and natural sciences as well as the humanities. For both interpretations, the term generally refers to matters not relating to the professional, vocational, or technical curriculum.\n\nHistory\n\nRooted in the basic curriculum – the enkuklios paideia or \"education in a circle\" – of late Classical and Hellenistic Greece, the \"liberal arts\" or \"liberal pursuits\" (Latin liberalia studia) were already so called in formal education during the Roman Empire; Seneca the Younger discusses liberal arts in education from a critical Stoic point of view in Moral Epistle 88. The exact classification of the liberal arts varied however in Roman times,H. Lausberg, Handbook of Literary Rhetoric (1998) p. 10 and it was only after Martianus Capella in the 5th century AD influentially brought the seven liberal arts as bridesmaids to the Marriage of Mercury and Philology,Helen Waddell, The Wandering Scholars (1968) p. 25 that they took on canonical form.\n\nThe four 'scientific' artes – music, arithmetic, geometry and astronomy (or astrology) – were known from the time of Boethius onwards as the Quadrivium. After the 9th century, the remaining three arts of the 'humanities' – grammar, logic, and rhetoric – were classed as well, as the Trivium. It was in that two-fold form that the seven liberal arts were studied in the medieval Western university. at Questia [https://www.questia.com/read/96213334/the-seven-liberal-arts-in-the-middle-ages] During the Middle Ages, logic gradually came to take predominance over the other parts of the Trivium.Helen Waddell, The Wandering Scholars (1968) pp. 141–3\n\nIn the Renaissance, the Italian humanists and their Northern counterparts, despite in many respects continuing the traditions of the Middle Ages, reversed that process.G. Norton ed., The Cambridge History of Literary Criticism Vol 3 (1999)p. 46 and pp. 601–4 Re-christening the old Trivium with a new and more ambitious name: Studia humanitatis, and also increasing its scope, they downplayed logic as opposed to the traditional Latin grammar and rhetoric, and added to them history, Greek, and moral philosophy (ethics), with a new emphasis on poetry as well.Paul Oskar Kristeller, Renaissance Thought II: Papers on Humanism and the Arts (New York: Harper Torchbooks, 1965), p. 178. The educational curriculum of humanism spread throughout Europe during the sixteenth century and became the educational foundation for the schooling of European elites, the functionaries of political administration, the clergy of the various legally recognized churches, and the learned professions of law and medicine.Charles G. Nauert, Humanism and the Culture of Renaissance Europe (New Approaches to European History) (Cambridge University Press, 2006), pp. 172–173. The ideal of a liberal arts, or humanistic education grounded in classical languages and literature, persisted until the middle of the twentieth century.Bod, Rens; A New History of the Humanities, Oxford University Press, Oxford, 2014.\n\nModern usage\n\nSome subsections of the liberal arts are in the trivium—the verbal arts: grammar, logic, and rhetoric; and in the quadrivium—the numerical arts: arithmetic, geometry, music, and astronomy. Analyzing and interpreting information is also included.\n\nAcademic areas that are associated with the term liberal arts include:\n\n* Arts (fine arts, music, performing arts, literature)\n* Mathematics\n* Natural science (biology, chemistry, physics, astronomy, earth science)\n* Philosophy\n* Religious studies\n* Social science (anthropology, economics, geography, history, jurisprudence, linguistics, political science, psychology, sociology)\n\nFor example, the core courses for Georgetown University's Doctor of Liberal Studies programGeorgetown University Doctor of Liberal Studies curriculum http://scs.georgetown.edu/departments/6/doctor-of-liberal-studies/about-the-program/curriculum#curriculum cover philosophy, theology, history, art, literature, and the social sciences. Wesleyan University's Master of Arts in Liberal Studies program includes courses in visual arts, art history, creative and professional writing, literature, history, mathematics, film, government, education, biology, psychology, and astronomy.http://www.wesleyan.edu/masters/index.html\n\nSecondary school\n\nThe liberal arts education at the secondary school level prepares the student for higher education at a university. They are thus meant for the more academically minded students. In addition to the usual curriculum, students of a liberal arts education often study Latin and Ancient Greek.\n\nSome liberal arts education provide general education, others have a specific focus. (This also differs from country to country.) The four traditional branches are:\n* humanities education (specializing in classical languages, such as Latin and Greek)\n* modern languages (students are required to study at least three languages)\n* mathematical-scientific education\n* economical and social-scientific education (students are required to study economics, world history, social studies and business informatics)\n\nCurricula differ from school to school, but generally include language, mathematics, informatics, physics, chemistry, biology, geography, art (as well as crafts and design), music, history, philosophy, civics / citizenship,this subject has different names in the different states of Germany. See :de:Gemeinschaftskunde social sciences, and several foreign languages.\n\nSchools concentrate not only on academic subjects, but on producing well-rounded individuals, so physical education and religion or ethics are compulsory, even in non-denominational schools which are prevalent. For example, the German constitution guarantees the separation of church and state, so although religion or ethics classes are compulsory, students may choose to study a specific religion or none at all.\n\nToday, a number of other areas of specialization exist, such as gymnasiums specializing in economics, technology or domestic sciences. In some countries, there is a notion of progymnasium, which is equivalent to beginning classes of the full gymnasium, with the rights to continue education in a gymnasium. Here, the prefix \"pro\" is equivalent to \"pre\".\n\nIn the United States\n\nIn the United States, liberal arts colleges are schools emphasizing undergraduate study in the liberal arts. The teaching at liberal arts colleges is often Socratic, typically with small classes, and often has a lower student-to-teacher ratio than at large universities; professors teaching classes are often allowed to concentrate more on their teaching responsibilities than primary research professors or graduate student teaching assistants in universities.\n\nIn addition, most four-year colleges that are not devoted exclusively or primarily to liberal arts degrees also offer those degrees, and students not majoring in liberal arts take courses to satisfy distribution requirements in liberal arts.\n\nTraditionally, a bachelor's degree either in liberal arts in general or in one particular area within liberal arts, with substantial study outside that main area, is earned over four years of full-time study. However, some universities such as Saint Leo University, Pennsylvania State University, Florida Institute of Technology and New England College have begun to offer an associate degree in liberal arts. Colleges like New Saint Andrews College in Moscow, Idaho, offer a unique program with only one degree offering, a Bachelor of Arts in Liberal Studies, and colleges like the University of Oklahoma College of Liberal Studies offers an online, part-time option for adult and nontraditional students.\n\nMost students earn either a Bachelor of Arts degree or a Bachelor of ScienceFor example, Georgia Institute of Technology's bachelor of science degree in Applied Languages and Intercultural Studies http://www.modlangs.gatech.edu degree; on completing undergraduate study, students might progress to either a liberal arts graduate school or a professional school (public administration, engineering, business, law, medicine, theology).\n\nIn Europe\n\nIn most parts of Europe, liberal arts education is deeply rooted. In Germany, Austria and countries influenced by their education system, e.g. it is called \"humanistische Bildung\" (humanistic education). The term is not to be mixed up with some modern educational concepts that use a similar wording. Educational institutions that see themselves in that tradition are often a \"Gymnasium\" (high school, grammar school). They aim at providing their pupils with comprehensive education (Bildung) in order to form personality with regard to a pupil's own humanity as well as his/her innate intellectual skills. Going back to the long tradition of the liberal arts in Europe, education in the above sense was freed from scholastic thinking and re-shaped by the theorists of enlightenment. In particular, Wilhelm von Humboldt played a key role in that regard. Since students are considered to have received a comprehensive liberal arts education at grammar schools, very often, the role of liberal arts education in undergraduate education at universities is reduced compared to the US educational system. Students are expected to use their skills received at the grammar school in order to further develop their personality in their own responsibility, e.g. in universities' music clubs, theatre groups, language clubs etc. Universities encourage students to do so and offer respective opportunities but do not make such activities part of the university's curriculum.\n\nThus, on the level of higher education, despite the European origin of the liberal arts college, the term liberal arts college usually denotes liberal arts colleges in the United States. With the exception of pioneering institutions such as Franklin University Switzerland (formerly known as Franklin College), established as a Europe-based, US-style liberal arts college in 1969, only recently some efforts have been undertaken to systematically \"re-import\" liberal arts education to continental Europe, as with Leiden University College The Hague, University College Utrecht, University College Maastricht, Amsterdam University College, Roosevelt Academy (now University College Roosevelt), [http://www.utwente.nl/en/education/bachelor/programmes/atlas-university-college/ ATLAS University College], [https://web.archive.org/web/20140626020959/http://www.eur.nl/informatie_voor/studiekiezers/erasmus_university_college/ Erasmus University College], [http://www.rug.nl/ucg/ University College Groningen], Bratislava International School of Liberal Arts, and Bard College Berlin, formerly known as the European College of Liberal Arts. As well as the colleges listed above, some universities in the Netherlands offer bachelors programs in Liberal Arts and Sciences (Tilburg University). Liberal arts (as a degree program) is just beginning to establish itself in Europe. For example, University College Dublin offers the degree, as does St. Marys University College Belfast, both institutions coincidentally on the island of Ireland. In the Netherlands, universities have opened constituent liberal arts colleges under the terminology university college since the late 1990s. The four-year bachelor's degree in Liberal Arts and Sciences at University College Freiburg is the first of its kind in Germany. It started in October 2012 with 78 students. The first Liberal Arts degree program in Sweden was established at Gothenburg University in 2011, followed by a Liberal Arts Bachelor Programme at Uppsala University's Campus Gotland in the autumn of 2013.[http://www.uu.se/utbildning/utbildningar/selma/program/?pKodHLA1K&lasar\n13/14 \"Liberal Arts Programme at Uppsala University\"] The first Liberal Arts program in Georgia was introduced in 2005 by [http://agile.ge/ American-Georgian Initiative for Liberal Education (AGILE)], an NGO. In collaboration with [http://agile.ge/ AGILE], Ilia State University became the first higher education institution in Georgia to establish a liberal arts program.\n\nIn France, Chavagnes Studium, a Liberal Arts Study Centre in partnership with the Institut Catholique d'études supérieures, and based in a former Catholic seminary, is launching a two-year intensive BA in the Liberal Arts, with a distinctively Catholic outlook.http://www.chavagnes.org/studium It has been suggested that the liberal arts degree may become part of mainstream education provision in the United Kingdom, Ireland and other European countries. In 1999, the European College of Liberal Arts (now Bard College Berlin) was founded in Berlin and in 2009 it introduced a four-year Bachelor of Arts program in Value Studies taught in English, leading to an interdisciplinary degree in the humanities.\n\nIn England, the first institution to retrieve and update a liberal arts education at undergraduate level was [http://www.winchester.ac.uk/Studyhere/Pages/ba-hons-modern-liberal-arts-philosophy.aspx The University of Winchester] with their [http://mla.winchester.ac.uk BA (Hons) Modern Liberal Arts] programme which launched in 2010. In 2012, University College London began its interdisciplinary Arts and Sciences BASc degree (which has kinship with the liberal arts model) with 80 students. King's College London launched the BA Liberal Arts, which has a slant towards arts, humanities and social sciences subjects. The New College of the Humanities also launched a new liberal education programme. In 2016, the University of Warwick launched a three/four-year liberal arts BA degree, which focuses on transdisciplinary approaches and Problem-based learning techniques in addition to providing structured disciplinary pathways.http://www2.warwick.ac.uk/study/undergraduate/courses/la99/ And for 2017 entry UCAS lists 20 providers of liberal arts programmes.\n\nIn Scotland, the four-year undergraduate Honours degree, specifically the Master of Arts, has historically demonstrated considerable breadth in focus. In the first two years of Scottish MA and BA degrees students typically study a number of different subjects before specialising in their Honours years (third and fourth year). The University of Dundee and the University of Glasgow (at its Crichton Campus) are the only Scottish universities that currently offer a specifically named 'Liberal Arts' degree.\n\nIn Asia\n\nThe Commission on Higher Education of the Philippines mandates a General Education curriculum required of all higher education institutions; it includes a number of liberal arts subjects, including history, art appreciation, and ethics, plus interdisciplinary electives. Many universities have much more robust liberal arts core curricula; most notably, the Jesuit universities such as Ateneo de Manila University have a strong liberal arts core curriculum that includes philosophy, theology, literature, history, and the social sciences.\nForman Christian College (A Chartered University) is a liberal arts education institution in Lahore, Pakistan. It is one of the oldest institutions in Indo-Pakistan subcontinent. It is a chartered university recognized by Higher Education Commission Pakistan.\nHabib University in Karachi, Pakistan offers a holistic liberal arts and sciences experience to its students through its uniquely tailored liberal core program which is compulsory for all undergraduate degree students.http://www.newslinemagazine.com/2014/12/liberal-classes/ The Underwood International College of Yonsei University, Korea, has compulsory liberal arts course for all the student body. [http://www.ssla.edu.in Symbiosis] & [http://www.flame.edu.in/ FLAME University] in Pune, Ahmedabad University, Ashoka University, Lingnan University and University of Liberal Arts- Bangladesh (ULAB) are also a few such liberal arts colleges in Asia. International Christian University in Tokyo is the first and one of the very few liberal arts universities in Japan.\n\nIn Australia\n\nCampion College is a Roman Catholic dedicated liberal arts college, located in the western suburbs of Sydney. Founded in 2006, it is the first tertiary educational liberal arts college of its type in Australia. Campion offers a Bachelor of Arts in the Liberal Arts as its sole undergraduate degree. The key disciplines studied are history, literature, philosophy, and theology.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Liberal arts education" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18674" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Liberal arts education (, free and , art or principled practice) can claim to be the oldest programme of higher education in Western history. It has its origin in the attempt to discover first principles - 'those universal principles which are the condition of the possibility of the existence of anything and everything'. The liberal arts are those subjects or skills that in classical antiquity were considered essential for a free person (, \"worthy of a free person\")Ernst Robert Curtius, European Literature and the Latin Middle Ages [1948], trans. Willard R. Trask (Princeton: Princeton University Press, 1973), p. 37. The classical sources include Cicero, De Oratore, I.72–73, III.127, and De re publica, I.30. to know in order to take an active part in civic life, something that (for Ancient Greece) included participating in public debate, defending oneself in court, serving on juries, and most importantly, military service. Grammar, logic, and rhetoric were the core liberal arts (the Trivium), while arithmetic, geometry, the theory of music, and astronomy also played a (somewhat lesser) part in education (as the Quadrivium).E. B. Castle, Ancient Education and Today (1969) p. 59\n\nLiberal arts education can refer to academic subjects such as literature, philosophy, mathematics, and social and physical sciences, or it can also refer to overall studies in a liberal arts degree program. For example, Yale University offers a Bachelor of Arts degree, which covers the social and natural sciences as well as the humanities. For both interpretations, the term generally refers to matters not relating to the professional, vocational, or technical curriculum.\n\nHistory\n\nRooted in the basic curriculum – the enkuklios paideia or \"education in a circle\" – of late Classical and Hellenistic Greece, the \"liberal arts\" or \"liberal pursuits\" (Latin liberalia studia) were already so called in formal education during the Roman Empire; Seneca the Younger discusses liberal arts in education from a critical Stoic point of view in Moral Epistle 88. The exact classification of the liberal arts varied however in Roman times,H. Lausberg, Handbook of Literary Rhetoric (1998) p. 10 and it was only after Martianus Capella in the 5th century AD influentially brought the seven liberal arts as bridesmaids to the Marriage of Mercury and Philology,Helen Waddell, The Wandering Scholars (1968) p. 25 that they took on canonical form.\n\nThe four 'scientific' artes – music, arithmetic, geometry and astronomy (or astrology) – were known from the time of Boethius onwards as the Quadrivium. After the 9th century, the remaining three arts of the 'humanities' – grammar, logic, and rhetoric – were classed as well, as the Trivium. It was in that two-fold form that the seven liberal arts were studied in the medieval Western university. at Questia [https://www.questia.com/read/96213334/the-seven-liberal-arts-in-the-middle-ages] During the Middle Ages, logic gradually came to take predominance over the other parts of the Trivium.Helen Waddell, The Wandering Scholars (1968) pp. 141–3\n\nIn the Renaissance, the Italian humanists and their Northern counterparts, despite in many respects continuing the traditions of the Middle Ages, reversed that process.G. Norton ed., The Cambridge History of Literary Criticism Vol 3 (1999)p. 46 and pp. 601–4 Re-christening the old Trivium with a new and more ambitious name: Studia humanitatis, and also increasing its scope, they downplayed logic as opposed to the traditional Latin grammar and rhetoric, and added to them history, Greek, and moral philosophy (ethics), with a new emphasis on poetry as well.Paul Oskar Kristeller, Renaissance Thought II: Papers on Humanism and the Arts (New York: Harper Torchbooks, 1965), p. 178. The educational curriculum of humanism spread throughout Europe during the sixteenth century and became the educational foundation for the schooling of European elites, the functionaries of political administration, the clergy of the various legally recognized churches, and the learned professions of law and medicine.Charles G. Nauert, Humanism and the Culture of Renaissance Europe (New Approaches to European History) (Cambridge University Press, 2006), pp. 172–173. The ideal of a liberal arts, or humanistic education grounded in classical languages and literature, persisted until the middle of the twentieth century.Bod, Rens; A New History of the Humanities, Oxford University Press, Oxford, 2014.\n\nModern usage\n\nSome subsections of the liberal arts are in the trivium—the verbal arts: grammar, logic, and rhetoric; and in the quadrivium—the numerical arts: arithmetic, geometry, music, and astronomy. Analyzing and interpreting information is also included.\n\nAcademic areas that are associated with the term liberal arts include:\n\n* Arts (fine arts, music, performing arts, literature)\n* Mathematics\n* Natural science (biology, chemistry, physics, astronomy, earth science)\n* Philosophy\n* Religious studies\n* Social science (anthropology, economics, geography, history, jurisprudence, linguistics, political science, psychology, sociology)\n\nFor example, the core courses for Georgetown University's Doctor of Liberal Studies programGeorgetown University Doctor of Liberal Studies curriculum http://scs.georgetown.edu/departments/6/doctor-of-liberal-studies/about-the-program/curriculum#curriculum cover philosophy, theology, history, art, literature, and the social sciences. Wesleyan University's Master of Arts in Liberal Studies program includes courses in visual arts, art history, creative and professional writing, literature, history, mathematics, film, government, education, biology, psychology, and astronomy.http://www.wesleyan.edu/masters/index.html\n\nSecondary school\n\nThe liberal arts education at the secondary school level prepares the student for higher education at a university. They are thus meant for the more academically minded students. In addition to the usual curriculum, students of a liberal arts education often study Latin and Ancient Greek.\n\nSome liberal arts education provide general education, others have a specific focus. (This also differs from country to country.) The four traditional branches are:\n* humanities education (specializing in classical languages, such as Latin and Greek)\n* modern languages (students are required to study at least three languages)\n* mathematical-scientific education\n* economical and social-scientific education (students are required to study economics, world history, social studies and business informatics)\n\nCurricula differ from school to school, but generally include language, mathematics, informatics, physics, chemistry, biology, geography, art (as well as crafts and design), music, history, philosophy, civics / citizenship,this subject has different names in the different states of Germany. See :de:Gemeinschaftskunde social sciences, and several foreign languages.\n\nSchools concentrate not only on academic subjects, but on producing well-rounded individuals, so physical education and religion or ethics are compulsory, even in non-denominational schools which are prevalent. For example, the German constitution guarantees the separation of church and state, so although religion or ethics classes are compulsory, students may choose to study a specific religion or none at all.\n\nToday, a number of other areas of specialization exist, such as gymnasiums specializing in economics, technology or domestic sciences. In some countries, there is a notion of progymnasium, which is equivalent to beginning classes of the full gymnasium, with the rights to continue education in a gymnasium. Here, the prefix \"pro\" is equivalent to \"pre\".\n\nIn the United States\n\nIn the United States, liberal arts colleges are schools emphasizing undergraduate study in the liberal arts. The teaching at liberal arts colleges is often Socratic, typically with small classes, and often has a lower student-to-teacher ratio than at large universities; professors teaching classes are often allowed to concentrate more on their teaching responsibilities than primary research professors or graduate student teaching assistants in universities.\n\nIn addition, most four-year colleges that are not devoted exclusively or primarily to liberal arts degrees also offer those degrees, and students not majoring in liberal arts take courses to satisfy distribution requirements in liberal arts.\n\nTraditionally, a bachelor's degree either in liberal arts in general or in one particular area within liberal arts, with substantial study outside that main area, is earned over four years of full-time study. However, some universities such as Saint Leo University, Pennsylvania State University, Florida Institute of Technology and New England College have begun to offer an associate degree in liberal arts. Colleges like New Saint Andrews College in Moscow, Idaho, offer a unique program with only one degree offering, a Bachelor of Arts in Liberal Studies, and colleges like the University of Oklahoma College of Liberal Studies offers an online, part-time option for adult and nontraditional students.\n\nMost students earn either a Bachelor of Arts degree or a Bachelor of ScienceFor example, Georgia Institute of Technology's bachelor of science degree in Applied Languages and Intercultural Studies http://www.modlangs.gatech.edu degree; on completing undergraduate study, students might progress to either a liberal arts graduate school or a professional school (public administration, engineering, business, law, medicine, theology).\n\nIn Europe\n\nIn most parts of Europe, liberal arts education is deeply rooted. In Germany, Austria and countries influenced by their education system, e.g. it is called \"humanistische Bildung\" (humanistic education). The term is not to be mixed up with some modern educational concepts that use a similar wording. Educational institutions that see themselves in that tradition are often a \"Gymnasium\" (high school, grammar school). They aim at providing their pupils with comprehensive education (Bildung) in order to form personality with regard to a pupil's own humanity as well as his/her innate intellectual skills. Going back to the long tradition of the liberal arts in Europe, education in the above sense was freed from scholastic thinking and re-shaped by the theorists of enlightenment. In particular, Wilhelm von Humboldt played a key role in that regard. Since students are considered to have received a comprehensive liberal arts education at grammar schools, very often, the role of liberal arts education in undergraduate education at universities is reduced compared to the US educational system. Students are expected to use their skills received at the grammar school in order to further develop their personality in their own responsibility, e.g. in universities' music clubs, theatre groups, language clubs etc. Universities encourage students to do so and offer respective opportunities but do not make such activities part of the university's curriculum.\n\nThus, on the level of higher education, despite the European origin of the liberal arts college, the term liberal arts college usually denotes liberal arts colleges in the United States. With the exception of pioneering institutions such as Franklin University Switzerland (formerly known as Franklin College), established as a Europe-based, US-style liberal arts college in 1969, only recently some efforts have been undertaken to systematically \"re-import\" liberal arts education to continental Europe, as with Leiden University College The Hague, University College Utrecht, University College Maastricht, Amsterdam University College, Roosevelt Academy (now University College Roosevelt), [http://www.utwente.nl/en/education/bachelor/programmes/atlas-university-college/ ATLAS University College], [https://web.archive.org/web/20140626020959/http://www.eur.nl/informatie_voor/studiekiezers/erasmus_university_college/ Erasmus University College], [http://www.rug.nl/ucg/ University College Groningen], Bratislava International School of Liberal Arts, and Bard College Berlin, formerly known as the European College of Liberal Arts. As well as the colleges listed above, some universities in the Netherlands offer bachelors programs in Liberal Arts and Sciences (Tilburg University). Liberal arts (as a degree program) is just beginning to establish itself in Europe. For example, University College Dublin offers the degree, as does St. Marys University College Belfast, both institutions coincidentally on the island of Ireland. In the Netherlands, universities have opened constituent liberal arts colleges under the terminology university college since the late 1990s. The four-year bachelor's degree in Liberal Arts and Sciences at University College Freiburg is the first of its kind in Germany. It started in October 2012 with 78 students. The first Liberal Arts degree program in Sweden was established at Gothenburg University in 2011, followed by a Liberal Arts Bachelor Programme at Uppsala University's Campus Gotland in the autumn of 2013.[http://www.uu.se/utbildning/utbildningar/selma/program/?pKodHLA1K&lasar\n13/14 \"Liberal Arts Programme at Uppsala University\"] The first Liberal Arts program in Georgia was introduced in 2005 by [http://agile.ge/ American-Georgian Initiative for Liberal Education (AGILE)], an NGO. In collaboration with [http://agile.ge/ AGILE], Ilia State University became the first higher education institution in Georgia to establish a liberal arts program.\n\nIn France, Chavagnes Studium, a Liberal Arts Study Centre in partnership with the Institut Catholique d'études supérieures, and based in a former Catholic seminary, is launching a two-year intensive BA in the Liberal Arts, with a distinctively Catholic outlook.http://www.chavagnes.org/studium It has been suggested that the liberal arts degree may become part of mainstream education provision in the United Kingdom, Ireland and other European countries. In 1999, the European College of Liberal Arts (now Bard College Berlin) was founded in Berlin and in 2009 it introduced a four-year Bachelor of Arts program in Value Studies taught in English, leading to an interdisciplinary degree in the humanities.\n\nIn England, the first institution to retrieve and update a liberal arts education at undergraduate level was [http://www.winchester.ac.uk/Studyhere/Pages/ba-hons-modern-liberal-arts-philosophy.aspx The University of Winchester] with their [http://mla.winchester.ac.uk BA (Hons) Modern Liberal Arts] programme which launched in 2010. In 2012, University College London began its interdisciplinary Arts and Sciences BASc degree (which has kinship with the liberal arts model) with 80 students. King's College London launched the BA Liberal Arts, which has a slant towards arts, humanities and social sciences subjects. The New College of the Humanities also launched a new liberal education programme. In 2016, the University of Warwick launched a three/four-year liberal arts BA degree, which focuses on transdisciplinary approaches and Problem-based learning techniques in addition to providing structured disciplinary pathways.http://www2.warwick.ac.uk/study/undergraduate/courses/la99/ And for 2017 entry UCAS lists 20 providers of liberal arts programmes.\n\nIn Scotland, the four-year undergraduate Honours degree, specifically the Master of Arts, has historically demonstrated considerable breadth in focus. In the first two years of Scottish MA and BA degrees students typically study a number of different subjects before specialising in their Honours years (third and fourth year). The University of Dundee and the University of Glasgow (at its Crichton Campus) are the only Scottish universities that currently offer a specifically named 'Liberal Arts' degree.\n\nIn Asia\n\nThe Commission on Higher Education of the Philippines mandates a General Education curriculum required of all higher education institutions; it includes a number of liberal arts subjects, including history, art appreciation, and ethics, plus interdisciplinary electives. Many universities have much more robust liberal arts core curricula; most notably, the Jesuit universities such as Ateneo de Manila University have a strong liberal arts core curriculum that includes philosophy, theology, literature, history, and the social sciences.\nForman Christian College (A Chartered University) is a liberal arts education institution in Lahore, Pakistan. It is one of the oldest institutions in Indo-Pakistan subcontinent. It is a chartered university recognized by Higher Education Commission Pakistan.\nHabib University in Karachi, Pakistan offers a holistic liberal arts and sciences experience to its students through its uniquely tailored liberal core program which is compulsory for all undergraduate degree students.http://www.newslinemagazine.com/2014/12/liberal-classes/ The Underwood International College of Yonsei University, Korea, has compulsory liberal arts course for all the student body. [http://www.ssla.edu.in Symbiosis] & [http://www.flame.edu.in/ FLAME University] in Pune, Ahmedabad University, Ashoka University, Lingnan University and University of Liberal Arts- Bangladesh (ULAB) are also a few such liberal arts colleges in Asia. International Christian University in Tokyo is the first and one of the very few liberal arts universities in Japan.\n\nIn Australia\n\nCampion College is a Roman Catholic dedicated liberal arts college, located in the western suburbs of Sydney. Founded in 2006, it is the first tertiary educational liberal arts college of its type in Australia. Campion offers a Bachelor of Arts in the Liberal Arts as its sole undergraduate degree. The key disciplines studied are history, literature, philosophy, and theology. Liberal arts education. http://en.wikipedia.org/?curid=18674."
  }
}
