{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15849",
  "eid" : "1f373c10-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778561617,
  "textBody" : "The Aphelion, the point in the year when the Earth is farthest from the Sun, occurs around this date.\n\nEvents\n\n* 362 BC – Battle of Mantinea: The Thebans, led by Epaminondas, defeated the Spartans. \n* 414 – Emperor Theodosius II, age 13, yields power to his older sister Aelia Pulcheria, who reigned as regent and proclaimed herself empress (Augusta) of the Eastern Roman Empire.\n* 836 – Pactum Sicardi, a peace treaty between the Principality of Benevento and the Duchy of Naples, is signed.\n* 993 – Ulrich of Augsburg is canonized as a saint.\n*1054 – A supernova, called SN 1054, is seen by Chinese Song dynasty, Arab, and possibly Amerindian observers near the star Zeta Tauri. For several months it remains bright enough to be seen during the day. Its remnants form the Crab Nebula.\n*1120 – Jordan II of Capua is anointed as prince after his infant nephew's death.\n*1187 – The Crusades: Battle of Hattin: Saladin defeats Guy of Lusignan, King of Jerusalem.\n*1253 – Battle of West-Capelle: John I of Avesnes defeats Guy of Dampierre.\n*1359 – Francesco II Ordelaffi of Forlì surrenders to the Papal commander Gil de Albornoz.\n*1456 – Ottoman wars in Europe: The Siege of Nándorfehérvár (Belgrade) begins.\n*1534 – Christian III is elected King of Denmark and Norway in the town of Rye.\n*1584 – Philip Amadas  and Arthur Barlowe arrive at Roanoke Island \n*1610 – The Battle of Klushino is fought between forces of the Polish–Lithuanian Commonwealth and Russia during the Polish–Muscovite War.\n*1634 – The city of Trois-Rivières is founded in New France (now Quebec, Canada).\n*1744 – The Treaty of Lancaster, in which the Iroquois cedes lands between the Allegheny Mountains and the Ohio River to the British colonies, was signed in Lancaster, Pennsylvania.\n*1774 – Orangetown Resolutions are adopted in the Province of New York, one of many protests against the British Parliament's Coercive Acts\n*1776 – American Revolution: The United States Declaration of Independence is adopted by the Second Continental Congress.\n*1778 – American Revolutionary War: American forces under George Clark capture Kaskaskia during the Illinois campaign.\n*1802 – At West Point, New York, the United States Military Academy opens.\n*1803 – The Louisiana Purchase is announced to the American people.\n*1817 – In Rome, New York, construction on the Erie Canal begins.\n*1826 – Thomas Jefferson, third president of the United States, dies the same day as John Adams, second president of the United States, on the fiftieth anniversary of the adoption of the United States Declaration of Independence.\n*1827 – Slavery is abolished in the State of New York.\n*1831 – Samuel Francis Smith writes \"My Country, 'Tis of Thee\" for the Boston, Massachusetts July 4 festivities.\n*1837 – Grand Junction Railway, the world's first long-distance railway, opens between Birmingham and Liverpool.\n*1838 – The Iowa Territory is organized.\n*1855 – The first edition of Walt Whitman's book of poems, Leaves of Grass, is published In Brooklyn.\n*1862 – Lewis Carroll tells Alice Liddell a story that would grow into Alice's Adventures in Wonderland and its sequels.\n*1863 – American Civil War: Siege of Vicksburg: Vicksburg, Mississippi surrenders to Ulysses S. Grant after 47 days of siege. One hundred fifty miles up the Mississippi River, a Confederate Army is repulsed at the Battle of Helena, Arkansas.\n*  1863   – American Civil War: The Army of Northern Virginia withdraws from the battlefield after losing the Battle of Gettysburg, signalling an end to the Southern invasion of the North.\n*1879 – Anglo-Zulu War: The Zululand capital of Ulundi is captured by British troops and burned to the ground, ending the war and forcing King Cetshwayo to flee.\n*1881 – In Alabama, the Tuskegee Institute opens.\n*1886 – The first scheduled Canadian transcontinental train arrives in Port Moody, British Columbia.\n*1887 – The founder of Pakistan, Quaid-i-Azam Muhammad Ali Jinnah, joins Sindh-Madrasa-tul-Islam, Karachi.\n*1892 – Western Samoa changes the International Date Line, causing Monday (July 4) to occur twice, resulting in a year with 367 days.\n*  1892   – The first double-decked street car service was inaugurated in San Diego, California.\n*1894 – The short-lived Republic of Hawaii is proclaimed by Sanford B. Dole.\n*1898 – En route from New York to Le Havre, the SS La Bourgogne collides with another ship and sinks off the coast of Sable Island, with the loss of 549 lives.\n*1901 – William Howard Taft becomes American governor of the Philippines.\n*1903 – Philippine–American War is officially concluded.\n*1910 – African-American boxer Jack Johnson knocks out white boxer Jim Jeffries in a heavyweight boxing match, sparking race riots across the United States.\n*1911 – A massive heat wave strikes the northeastern United States, killing 380 people in eleven days and breaking temperature records in several cities.\n*1913 – President Woodrow Wilson addresses American Civil War veterans at the Great Reunion of 1913.\n*1914 – The funeral of Archduke Franz Ferdinand and his wife Sophie takes place in Vienna, six days after their assassinations in Sarajevo.\n*1918 – Mehmed V died at the age of 73 and  Ottoman sultan Mehmed VI ascends to the throne.\n*  1918   – World War I: The Battle of Hamel, a successful attack by the Australian Corps against German positions near the town of Le Hamel on the Western Front.\n*  1918   – Bolsheviks kill Tsar Nicholas II of Russia and his family (Julian calendar date).\n*1927 – First flight of the Lockheed Vega.\n*1934 – Leo Szilard patents the chain-reaction design that would later be used in the atomic bomb.\n*1939 – Lou Gehrig, recently diagnosed with Amyotrophic lateral sclerosis, informs a crowd at Yankee Stadium that he considers himself \"The luckiest man on the face of the earth\", then announces his retirement from major league baseball.\n*1941 – Nazi crimes against the Polish nation: Nazi troops massacre Polish scientists and writers in the captured Ukrainian city of Lviv.\n*  1941   – World War II: The Burning of the Riga synagogues: The Great Choral Synagogue in German occupied Riga is burnt with 300 Jews locked in the basement.\n*1942 – World War II: The 250-day Siege of Sevastopol in the Crimea ends when the city falls to Axis forces.\n*1943 – World War II: The Battle of Kursk, the largest full-scale battle in history and the world's largest tank battle, begins in the village of Prokhorovka.\n*  1943   – World War II: In Gibraltar, a Royal Air Force B-24 Liberator bomber crashes into the sea in an apparent accident moments after takeoff, killing sixteen passengers on board,  including general Władysław Sikorski, the commander-in-chief of the Polish Army and the Prime Minister of the Polish government-in-exile; only the pilot survives.\n*1946 – The Kielce pogrom against Jewish Holocaust survivors in Poland.\n*  1946   – After 381 years of near-continuous colonial rule by various powers, the Philippines attains full independence from the United States.\n*1947 – The \"Indian Independence Bill\" is presented before the British House of Commons, proposing the independence of the Provinces of British India into two sovereign countries: India and Pakistan.\n*1950 – Cold War: Radio Free Europe first broadcasts.\n*1951 – Cold War: A court in Czechoslovakia sentences American journalist William N. Oatis to ten years in prison on charges of espionage.\n*  1951   – William Shockley announces the invention of the junction transistor.\n*1958 – U.S. President Dwight D. Eisenhower signed the Rivers and Harbors Flood Control Bill.\n*1960 – Due to the post-Independence Day admission of Hawaii as the 50th U.S. state on August 21, 1959, the 50-star flag of the United States debuts in Philadelphia, almost ten and a half months later (see Flag Acts (United States)).\n*1961 – On its maiden voyage, the Soviet nuclear-powered submarine K-19 suffers a complete loss of coolant to its reactor. The crew are able to effect repairs, but 22 of them die of radiation poisoning over the following two years.\n*1966 – U.S. President Lyndon B. Johnson signs the Freedom of Information Act into United States law. The act went into effect the next year.\n*1976 – Israeli commandos raid Entebbe airport in Uganda, rescuing all but four of the passengers and crew of an Air France jetliner seized by Palestinian terrorists.\n*  1976   – The U.S. celebrates its Bicentennial.\n*1977 – The George Jackson Brigade plants a bomb at the main power substation for the Washington state capitol in Olympia, in solidarity with a prison strike at the Walla Walla State Penitentiary Intensive Security Unit\n*1982 – Three Iranian diplomats and a journalist are kidnapped in Lebanon by Phalange forces, and their fate remains unknown.\n*1987 – In France, former Gestapo chief Klaus Barbie (a.k.a. the \"Butcher of Lyon\") is convicted of crimes against humanity and sentenced to life imprisonment.\n*1994 – Rwandan genocide: Kigali, the Rwandan capital, is captured by the Rwandan Patriotic Front, ending the genocide in the city.\n*1997 – NASA's Pathfinder space probe lands on the surface of Mars.\n*1998 – Japan launches the Nozomi probe to Mars, joining the United States and Russia as a space exploring nation.\n*2004 – The cornerstone of the Freedom Tower is laid on the World Trade Center site in New York City.\n*2005 – The Deep Impact collider hits the comet Tempel 1.\n*2009 – The Statue of Liberty's crown reopens to the public after eight years of closure due to security concerns following the September 11 attacks.\n*  2009   – The first of four days of bombings begins on the southern Philippine island group of Mindanao.\n*2012 – The discovery of particles consistent with the Higgs boson at the Large Hadron Collider is announced at CERN.\n\nBirths\n\n* AD 68 – Salonina Matidia, Roman daughter of Ulpia Marciana (d. 119)\n*1095 – Usama ibn Munqidh, Muslim poet, author and faris (Knight) (d. 1188)\n*1330 – Ashikaga Yoshiakira, Japanese shogun (d. 1367)\n*1477 – Johannes Aventinus, Bavarian historian and philologist (d. 1534)\n*1546 – Murad III, Ottoman sultan (d. 1595)\n*1656 – John Leake, Royal Navy admiral (d. 1720)\n*1694 – Louis-Claude Daquin, French organist and composer (d. 1772)\n*1715 – Christian Fürchtegott Gellert, German poet and academic (d. 1769)\n*1719 – Michel-Jean Sedaine, French playwright (d. 1797) \n*1729 – George Leonard, American lawyer, jurist and politician (d. 1819)\n*1753 – Jean-Pierre Blanchard, French inventor, best known as a pioneer in balloon flight (d. 1809)\n*1790 – George Everest, Welsh geographer and surveyor (d. 1866)\n*1799 – Oscar I of Sweden (d. 1859)\n*1804 – Nathaniel Hawthorne, American novelist and short story writer (d. 1864)\n*1807 – Giuseppe Garibaldi, Italian general and politician (d. 1882)\n*1816 – Hiram Walker, American businessman, founded Canadian club whiskey  (d. 1899)\n*1826 – Stephen Foster, American songwriter and composer (d. 1864)\n*1845 – Thomas John Barnardo, Irish philanthropist and humanitarian (d. 1905)\n*1847 – James Anthony Bailey, American circus ringmaster, co-founded Ringling Bros. and Barnum & Bailey Circus (d. 1906)\n*1854 – Victor Babeș, Romanian physician and biologist (d. 1926)\n*1868 – Henrietta Swan Leavitt, American astronomer and academic (d. 1921)\n*1872 – Calvin Coolidge, American lawyer and politician, 30th President of the United States (d. 1933)\n*1874 – John McPhee, Australian journalist and politician, 27th Premier of Tasmania (d. 1952)\n*1880 – Victor Kraft, Austrian philosopher from the Vienna Circle (d. 1975)\n*1881 – Ulysses S. Grant III, American general (d. 1968)\n*1883 – Rube Goldberg, American sculptor, cartoonist, and engineer (d. 1970)\n*1887 – Pio Pion, Italian engineer and businessman (d. 1965)\n*1888 – Henry Armetta, Italian-American actor and singer (d. 1945)\n*1895 – Irving Caesar, American songwriter and composer (d. 1996)\n*1896 – Mao Dun, Chinese journalist, author, and critic (d. 1981)\n*1897 – Alluri Sitarama Raju, Indian activist (d. 1924)\n*1898 – Pilar Barbosa, Puerto Rican-American historian and activist (d. 1997)\n*  1898   – Gertrude Lawrence, British actress, singer, and dancer (d. 1952)\n*  1898   – Gulzarilal Nanda, Indian politician (d. 1998)\n*  1898   – Gertrude Weaver, American supercentenarian (d. 2015)\n*1900 – Belinda Dann, Indigenous Australian who was one of the Stolen Generation, reunited with family aged 107 (d. 2007)\n*  1900   – Nellie Mae Rowe, African-American folk artist (d. 1982)\n*1902 – Meyer Lansky, American gangster (d. 1983)\n*  1902   – George Murphy, American actor and politician (d. 1992)\n*1903 – Flor Peeters, Belgian organist, composer, and educator (d. 1986)\n*1904 – Angela Baddeley, English actress (d. 1976)\n*1905 – Irving Johnson, American sailor and author (d. 1991)\n*  1905   – Robert Hankey, 2nd Baron Hankey, British diplomat and public servant (d. 1996)\n*  1905   – Lionel Trilling, American critic, essayist, short story writer, and educator (d. 1975)\n*1906 – Vincent Schaefer, American chemist and meteorologist (d. 1993)\n*1907 – John Anderson, American discus thrower (d. 1948)\n*  1907   – Howard Taubman, American author and critic (d. 1996)\n*1909 – Alec Templeton, Welsh composer, pianist and satirist (d. 1963) \n*1910 – Robert K. Merton, American sociologist and scholar (d. 2003)\n*  1910   – Gloria Stuart, American actress (d. 2010)\n*1911 – Bruce Hamilton, Australian public servant (d. 1989)\n*  1911   – Mitch Miller, American singer and producer (d. 2010)\n*1914 – Nuccio Bertone, Italian automobile designer (d. 1997)\n*1915 – Timmie Rogers, American actor and singer-songwriter (d. 2006)\n*1916 – Iva Toguri D'Aquino, American typist and broadcaster (d. 2006)\n*1918 – Eppie Lederer, American journalist and radio host (d. 2002)\n*  1918   – Johnnie Parsons, American race car driver (d. 1984)\n*  1918   – Taufa'ahau Tupou IV, King of Tonga (d. 2006)\n*  1918   – Alec Bedser, English cricketer (d. 2010)\n*  1918   – Eric Bedser, English cricketer (d. 2006)\n*  1918   – Pauline Phillips, American journalist and radio host, created Dear Abby (d. 2013)\n*1920 – Norm Drucker, American basketball player and referee (d. 2015)\n*  1920   – Leona Helmsley, American businesswoman (d. 2007)\n*  1920   – Fritz Wilde, German footballer and manager (d. 1977)\n*1921 – Gérard Debreu, French economist and mathematician, Nobel Prize laureate (d. 2004)\n*  1921   – Metropolitan Mikhail of Asyut (d. 2014)\n*  1921   – Philip Rose, American actor, playwright, and producer (d. 2011)\n*  1921   – Tibor Varga, Hungarian violinist and conductor (d. 2003)\n*1923 – Rudolf Friedrich, Swiss lawyer and politician (d. 2013)\n*1924 – Eva Marie Saint, American actress \n*1926 – Alfredo Di Stéfano, Argentinian-Spanish footballer and coach (d. 2014)\n*  1926   – Lake Underwood, American race car driver and businessman (d. 2008)\n*1927 – Gina Lollobrigida, Italian actress and photographer\n*  1927   – Neil Simon, American playwright and screenwriter\n*1928 – Giampiero Boniperti, Italian footballer and politician\n*  1928   – Teofisto Guingona Jr., Filipino politician; 11th Vice President of the Philippines\n*  1928   – Shan Ratnam, Sri Lankan physician and academic (d. 2001)\n*  1928   – Chuck Tanner, American baseball player and manager (d. 2011)\n*1929 – Al Davis, American football player, coach, and manager (d. 2011)\n*  1929   – Bill Tuttle, American baseball player (d. 1998)\n*1930 – Ron Casey, Australian journalist and sportscaster\n*  1930   – George Steinbrenner, American businessman (d. 2010)\n*1931 – Stephen Boyd, Northern Ireland-born American actor (d. 1977)\n*  1931   – Rick Casares, American football player and soldier (d. 2013)\n*  1931   – Sébastien Japrisot, French author, director, and screenwriter (d. 2003)\n*  1931   – Peter Richardson, English cricketer (d. 2017)\n*1932 – Aurèle Vandendriessche, Belgian runner\n*1934 – Yvonne B. Miller, American academic and politician (d. 2012)\n*  1934   – Colin Welland, English actor and screenwriter (d. 2015)\n*1935 – Paul Scoon, Grenadian politician, 2nd Governor-General of Grenada (d. 2013)\n*1936 – Zdzisława Donat, Polish soprano and actress\n*1937 – Thomas Nagel, American philosopher and academic\n*  1937   – Queen Sonja of Norway\n*  1937   – Richard Rhodes, American journalist and historian\n*  1937   – Eric Walters, Australian journalist (d. 2010)\n*1938 – Steven Rose, English biologist and academic\n*  1938   – Bill Withers, American singer-songwriter and producer\n*1940 – Pat Stapleton, Canadian ice hockey player\n*1941 – Sam Farr, American politician\n*  1941   – Tomaž Šalamun, Croatian-Slovenian poet and academic (d. 2014)\n*  1941   – Pavel Sedláček, Czech singer-songwriter and guitarist\n*  1941   – Brian Willson, American soldier, lawyer, and activist\n*1942 – Hal Lanier, American baseball player, coach, and manager\n*  1942   – Floyd Little, American football player and coach\n*  1942   – Stefan Meller, French-Polish academic and politician, Polish Minister of Foreign Affairs (d. 2008)\n*  1942   – Prince Michael of Kent\n*  1942   – Peter Rowan, American singer-songwriter and guitarist\n*1943 – Conny Bauer, German trombonist\n*  1943   – Emerson Boozer, American football player and sportscaster\n*  1943   – Adam Hart-Davis, English historian, author, and photographer\n*  1943   – Geraldo Rivera, American lawyer, journalist, and author\n*  1943   – Alan Wilson, American singer-songwriter and guitarist (d. 1970)\n*1945 – Andre Spitzer, Romanian-Israeli fencer and coach (d. 1972)\n*1946 – Ron Kovic, American author and activist\n*  1946   – Michael Milken, American businessman and philanthropist\n*1947 – Lembit Ulfsak, Estonian actor and director (d. 2017)\n*1948 – René Arnoux, French race car driver\n*  1948   – Tommy Körberg, Swedish singer and actor\n*  1948   – Jeremy Spencer, English singer-songwriter and guitarist \n*1950 – Philip Craven, English basketball player and swimmer\n*  1950   – David Jensen, Canadian-English radio and television host\n*1951 – John Alexander, Australian tennis player and politician \n*  1951   – Ralph Johnson, American R&B drummer and percussionist \n*  1951   – Vladimir Tismăneanu, Romanian-American political scientist, sociologist, and academic\n*  1951   – Kathleen Kennedy Townsend, American lawyer and politician, 6th Lieutenant Governor of Maryland\n*1952 – Álvaro Uribe, Colombian lawyer and politician, 39th President of Colombia\n*  1952   – Carol MacReady, English actress\n*  1952   – John Waite, English singer-songwriter and guitarist\n*  1952   – Paul Rogat Loeb, American author and activist \n*1953 – Francis Maude, English lawyer and politician, Minister for the Cabinet Office\n*1954 – Jim Beattie, American baseball player, coach, and manager\n*  1954   – Morganna, American model, actress, and dancer\n*1955 – Kevin Nichols, Australian cyclist\n*1956 – Robert Sinclair MacKay, British academic and educator\n*1957 – Rein Lang, Estonian politician and diplomat, 25th Estonian Minister of Foreign Affairs\n*1958 – Vera Leth, Greenlandic Ombudsman\n*  1958   – Kirk Pengilly, Australian guitarist, saxophonist, and songwriter \n*  1958   – Carl Valentine, English-Canadian footballer, coach, and manager\n*1959 – Victoria Abril, Spanish actress and singer\n*1960 – Roland Ratzenberger, Austrian race car driver (d. 1994)\n*1961 – Richard Garriott, English-American video game designer, created the Ultima series\n*1962 – Pam Shriver, American tennis player and sportscaster\n*1963 – Henri Leconte, French tennis player and sportscaster\n*  1963   – Laureano Márquez, Spanish-Venezuelan political scientist and journalist\n*  1963   – José Oquendo, Puerto Rican-American baseball player and coach\n*1964 – Cle Kooiman, American soccer player and manager\n*  1964   – Elie Saab, Lebanese fashion designer\n*  1964   – Edi Rama, Albanian politician\n*  1964   – Mark Slaughter, American singer-songwriter and producer \n*  1964   – Mark Whiting, American actor, director, and screenwriter\n*1965 – Harvey Grant, American basketball player and coach\n*  1965   – Horace Grant, American basketball player and coach\n*  1965   – Kiriakos Karataidis, Greek footballer and manager\n*  1965   – Gérard Watkins, English actor and playwright\n*1966 – Minas Hantzidis, German-Greek footballer\n*  1966   – Lee Reherman, American actor (d. 2016)\n*1967 – Vinny Castilla, Mexican baseball player and manager\n*  1967   – Sébastien Deleigne, French athlete\n*  1967   – Andy Walker, English-Canadian journalist\n*1968 – Ronni Ancona, Scottish actress and screenwriter\n*  1968   – Jack Frost, American guitarist and songwriter \n*1969 – Al Golden, American football player and coach\n*  1969   – Todd Marinovich, American football player and coach\n*  1969   – Wilfred Mugeyi, Zimbabwean footballer and coach\n*1972 – Stephen Giles, Canadian canoe racer and engineer\n*  1972   – William Goldsmith, American drummer \n*  1972   – Mike Knuble, Canadian-American ice hockey player and coach\n*1973 – Keiko Ihara, Japanese race car driver\n*  1973   – Michael Johnson, English-Jamaican footballer and manager\n*  1973   – Anjelika Krylova, Russian ice dancer and coach\n*  1973   – Jan Magnussen, Danish race car driver\n*  1973   – Tony Popovic, Australian footballer and manager\n*1974 – Jill Craybas, American tennis player\n*  1974   – La'Roi Glover, American football player and sportscaster\n*  1974   – Adrian Griffin, American basketball player and coach\n*1975 – John Lloyd Young, American actor and singer\n*1976 – Daijiro Kato, Japanese motorcycle racer (d. 2003)\n*  1976   – Yevgeniya Medvedeva, Russian skier\n*1977 – Zoe Naylor, Australian actress, journalist, and producer\n*1978 – Marcos Daniel, Brazilian tennis player\n*  1978   – Andrea Gabriel, American actress, producer, and screenwriter\n*  1978   – Stephen McNally, English singer-songwriter \n*  1978   – Émile Mpenza, Belgian footballer\n*1979 – Dumas, Canadian singer-songwriter and guitarist\n*  1979   – Siim Kabrits, Estonian politician\n*  1979   – Josh McCown, American football player\n*  1979   – Renny Vega, Venezuelan footballer\n*1980 – Kwame Steede, Bermudan footballer\n*1981 – Dedé, Angolan footballer\n*  1981   – Brock Berlin, American football player\n*  1981   – Christoph Preuß, German footballer\n*  1981   – Francisco Cruceta, Dominican baseball player\n*  1981   – Will Smith, American football player (d. 2016)\n*1982 – Vladimir Boisa, Georgian basketball player\n*  1982   – Vladimir Gusev, Russian cyclist\n*  1982   – Jeff Lima, New Zealand rugby league player\n*  1982   – Michael \"The Situation\" Sorrentino, American model, author and television personality\n*1983 – Melanie Fiona, Canadian singer-songwriter \n*  1983   – Ben Jorgensen, American singer-songwriter and guitarist \n*  1983   – Amantle Montsho, Botswanan sprinter\n*  1983   – Andrew Mrotek, American drummer \n*  1983   – Miguel Pinto, Chilean footballer\n*  1983   – Amol Rajan, Indian-English journalist\n*  1983   – Mattia Serafini, Italian footballer \n*1984 – Jin Akanishi, Japanese singer-songwriter \n*  1984   – Miguel Santos Soares, Timorese footballer\n*  1985   – Kane Tenace, Australian footballer\n*  1985   – Dimitrios Mavroeidis, Greek basketball player\n*  1985   – Wason Rentería, Colombian footballer\n*1986 – Ömer Aşık, Turkish basketball player\n*  1986   – Takahisa Masuda, Japanese singer \n*  1986   – Nguyen Ngoc Duy, Vietnamese footballer\n*  1986   – Rafael Arévalo, Salvadoran tennis player\n*  1986   – Willem Janssen, Dutch footballer\n*  1986   – Fanny Valette, French actress\n*  1986   – Terrance Knighton, American football player\n*  1986   – Marte Elden, Norwegian skier\n*1987 – Wude Ayalew, Ethiopian runner\n*  1987   – Guram Kashia, Georgian footballer\n*1989 – Benjamin Büchel, English footballer\n*1990 – Jake Gardiner, American ice hockey player\n*  1990   – Richard Mpong, Ghanaian footballer\n*  1990   – Naoki Yamada, Japanese footballer\n*  1990   – Ihar Yasinski, Belarusian footballer\n*1993 – Tom Barkhuizen, English footballer\n\nDeaths\n\n* 673 – Ecgberht, king of Kent \n* 907 – Luitpold, margrave of Bavaria\n*   907   – Dietmar I, archbishop of Salzburg\n* 910 – Luo Shaowei, Chinese warlord (b. 877)\n* 940 – Wang Jianli, Chinese general (b. 871)\n* 943 – Taejo of Goryeo, Korean king (b. 877)\n* 945 – Zhuo Yanming, Chinese Buddhist monk and emperor\n* 965 – Benedict V, pope of the Catholic Church\n* 973 – Ulrich of Augsburg, German bishop and saint (b. 890)\n* 975 – Gwangjong of Goryeo, Korean king (b. 925)\n*1187 – Raynald of Châtillon, French knight (b. 1125)\n*1307 – Rudolf I of Bohemia (b. 1281)\n*1336 – Saint Elizabeth of Portugal (b. 1271)\n*1429 – Carlo I Tocco, ruler of Epirus (b. 1372)\n*1533 – John Frith, English priest, writer, and martyr (b. 1503) \n*1541 – Pedro de Alvarado, Spanish general and explorer (b. 1495)\n*1546 – Hayreddin Barbarossa, Greek-Turkish admiral (b. 1478)\n*1551 – Gregory Cromwell, 1st Baron Cromwell, English politician (b. 1514)\n*1603 – Philippe de Monte, Flemish composer and educator (b. 1521)\n*1623 – William Byrd, English composer (b. c. 1540)\n*1644 – Brian Twyne, English academic, antiquarian  and archivist (b. 1581)\n*1648 – Antoine Daniel, French missionary and saint (b. 1601)\n*1742 – Luigi Guido Grandi, Italian monk, mathematician, and engineer (b. 1671)\n*1754 – Philippe Néricault Destouches, French playwright and author (b. 1680)\n*1761 – Samuel Richardson, English author and painter (b. 1689)\n*1780 – Prince Charles Alexander of Lorraine (b. 1712)\n*1787 – Charles, Prince of Soubise, Marshal of France (b. 1715)\n*1821 – Richard Cosway, English painter and academic (b. 1742)\n*1826 – John Adams, American lawyer and politician, 2nd President of the United States (b. 1735)\n*  1826   – Thomas Jefferson, American architect, lawyer, and politician, 3rd President of the United States (b. 1743)\n*1831 – James Monroe, American soldier, lawyer, and politician, 5th President of the United States (b. 1758)\n*1848 – François-René de Chateaubriand, French historian and politician (b. 1768)\n*1850 – William Kirby, English entomologist and author (b. 1759)\n*1854 – Karl Friedrich Eichhorn, German academic and jurist (b. 1781)\n*1857 – William L. Marcy, American lawyer, judge, and politician, 21st United States Secretary of State (b. 1786)\n*1881 – Johan Vilhelm Snellman, Finnish philosopher and politician (b. 1806)\n*1882 – Joseph Brackett, American composer and author (b. 1797)\n*1886 – Poundmaker, Canadian tribal chief (b. 1797)\n*1891 – Hannibal Hamlin, American lawyer and politician, 15th Vice President of the United States (b. 1809)\n*1901 – Johannes Schmidt, German linguist and academic (b. 1843)\n*1902 – Vivekananda, Indian monk and saint (b. 1863)\n*1905 – Élisée Reclus, French geographer and author (b. 1830)\n*1910 – Melville Fuller, American lawyer and jurist, 8th Chief Justice of the United States (b. 1833)\n*  1910   – Giovanni Schiaparelli, Italian astronomer and historian (b. 1835)\n*1916 – Alan Seeger, American soldier and poet (b. 1888)\n*1922 – Lothar von Richthofen, German lieutenant and pilot (b. 1894)\n*1926 – Pier Giorgio Frassati, Italian activist and saint (b. 1901)\n*1934 – Marie Curie, French-Polish physicist and chemist, Nobel Prize laureate (b. 1867)\n*1938 – Otto Bauer, Austrian philosopher and politician, Austrian Minister of Foreign Affairs (b. 1881)\n*  1938   – Suzanne Lenglen, French tennis player (b. 1899)\n*1941 – Antoni Łomnicki, Polish mathematician and academic (b. 1881)\n*1943 – Władysław Sikorski, Polish general and politician, 9th Prime Minister of the Second Republic of Poland (b. 1881)\n*1946 – Taffy O'Callaghan, Welsh footballer and coach (b. 1906)\n*1948 – Monteiro Lobato, Brazilian journalist and author (b. 1882)\n*1949 – François Brandt, Dutch rower and engineer (b. 1874)\n*1963 – Bernard Freyberg, 1st Baron Freyberg, New Zealand general and politician, 7th Governor-General of New Zealand (b. 1889)\n*  1963   – Clyde Kennard, American activist and martyr (b. 1927)\n*  1963   – Pingali Venkayya, Indian activist, designed the Flag of India (b. 1876) \n*1964 – Gaby Morlay, French actress and singer (b. 1893)\n*1969 – Henri Decoin, French director and screenwriter (b. 1890)\n*1970 – Barnett Newman, American painter and illustrator (b. 1905)\n*  1970   – Harold Stirling Vanderbilt, American sailor and businessman (b. 1884)\n*1971 – August Derleth, American anthologist and author (b. 1909)\n*  1971   – Thomas C. Hart, American admiral and politician (b. 1877)\n*1974 – Georgette Heyer, English author (b. 1902)\n*  1974   – André Randall, French actor (b. 1892)\n*1976 – Yonatan Netanyahu, Israeli colonel (b. 1946)\n*  1976   – Antoni Słonimski, Polish poet and playwright (b. 1895)\n*1977 – Gersh Budker, Ukrainian physicist and academic (b. 1918)\n*1979 – Lee Wai Tong, Chinese footballer and manager (b. 1905)\n*1980 – Maurice Grevisse, Belgian linguist and author (b. 1895)\n*1984 – Jimmie Spheeris, American singer-songwriter (b. 1949)\n*1986 – Paul-Gilbert Langevin, French musicologist, critique musical and physicist (b. 1933)\n*  1986   – Flor Peeters, Belgian organist and composer (b. 1903)\n*  1986   – Oscar Zariski, Belarusian-American mathematician and academic (b. 1899)\n*1988 – Adrian Adonis, American wrestler (b. 1954)\n*1990 – Olive Ann Burns, American journalist and author (b. 1924)\n*1991 – Victor Chang, Chinese-Australian surgeon and physician (b. 1936)\n*  1991   – Art Sansom, American cartoonist (b. 1920)\n*1992 – Astor Piazzolla, Argentinian bandoneon player and composer (b. 1921)\n*1993 – Bona Arsenault, Canadian historian, genealogist, and politician (b. 1903)\n*1994 – Joey Marella, American wrestling referee (b. 1964)\n*1995 – Eva Gabor, Hungarian-American actress and singer (b. 1919)\n*  1995   – Bob Ross, American painter and television host (b. 1942)\n*1997 – Charles Kuralt, American journalist (b. 1934)\n*  1997   – John Zachary Young, English zoologist and neurophysiologist (b. 1907)\n*1999 – Leo Garel, American illustrator and educator (b. 1917)\n*2000 – Gustaw Herling-Grudziński, Polish journalist and author (b. 1919)\n*2002 – Gerald Bales, Canadian organist and composer (b. 1919)\n*  2002   – Benjamin O. Davis, Jr., American general (b. 1912)\n*2003 – Larry Burkett, American author and radio host (b. 1939)\n*  2003   – André Claveau, French singer (b. 1915)\n*  2003   – Barry White, American singer-songwriter, pianist, and producer (b. 1944)\n*2004 – Jean-Marie Auberson, Swiss violinist and conductor (b. 1920)\n*2005 – Cliff Goupille, Canadian ice hockey player (b. 1915)\n*  2005   – Hank Stram, American football player and coach (b. 1923)\n*2007 – Bill Pinkney, American singer (b. 1925)\n*2008 – Thomas M. Disch, American author and poet (b. 1940)\n*  2008   – Jesse Helms, American politician (b. 1921)\n*  2008   – Evelyn Keyes, American actress (b. 1916)\n*  2008   – Terrence Kiel, American football player (b. 1980)\n*  2008   – Charles Wheeler, German-English soldier and journalist (b. 1923)\n*2009 – Brenda Joyce, American actress (b. 1917)\n*  2009   – Allen Klein, American businessman and talent agent, founded ABKCO Records (b. 1931)\n*  2009   – Drake Levin, American guitarist (b. 1946)\n*  2009   – Steve McNair, American football player (b. 1973)\n*  2009   – Lasse Strömstedt, Swedish author and actor (b. 1935)\n*  2009   – Jean-Baptiste Tati Loutard, Congolese poet and politician (b. 1938)\n*2010 – Robert Neil Butler, American physician and author (b. 1927)\n*2012 – Hiren Bhattacharyya, Indian poet and author (b. 1932)\n*  2012   – Jimmy Bivins, American boxer (b. 1919)\n*  2012   – Jeong Min-hyeong, South Korean footballer (b. 1987)\n*  2012   – Eric Sykes, English actor, director, and screenwriter (b. 1923)\n*2013 – Onllwyn Brace, Welsh rugby player and sportscaster (b. 1932)\n*  2013   – Jack Crompton, English footballer and manager (b. 1921)\n*  2013   – James Fulton, American dermatologist and academic (b. 1940)\n*  2013   – Charles A. Hines, American general (b. 1935)\n*  2013   – Bernie Nolan, Irish singer (b. 1960)\n*2014 – Giorgio Faletti, Italian author, screenwriter, and actor (b. 1950)\n*  2014   – C. J. Henderson, American author and critic (b. 1951)\n*  2014   – Earl Robinson, American baseball player (b. 1936)\n*  2014   – Richard Mellon Scaife, American businessman (b. 1932)\n*2015 – Nedelcho Beronov, Bulgarian judge and politician (b. 1928)\n*  2015   – William Conrad Gibbons, American historian, author, and academic (b. 1926)\n\nHolidays and observances\n\n*Christian feast day:\n**Andrew of Crete\n**Bertha of Artois\n**Blessed Catherine Jarrige\n**Blessed Pier Giorgio Frassati\n**Elizabeth of Aragon (or of Portugal)\n**Oda of Canterbury\n**Ulrich of Augsburg\n**July 4 (Eastern Orthodox liturgics)\n*Birthday of Queen Sonja (Norway)\n*The first evening of Dree Festival, celebrated until July 7 (Apatani people, Arunachal Pradesh, India)\n*Independence Day, celebrates the Declaration of Independence of the United States from Great Britain in 1776. (United States and its dependencies)\n*Liberation Day (Northern Mariana Islands)\n*Liberation Day (Rwanda)\n*Republic Day (Philippines)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "July 4" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15849" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Aphelion, the point in the year when the Earth is farthest from the Sun, occurs around this date.\n\nEvents\n\n* 362 BC – Battle of Mantinea: The Thebans, led by Epaminondas, defeated the Spartans. \n* 414 – Emperor Theodosius II, age 13, yields power to his older sister Aelia Pulcheria, who reigned as regent and proclaimed herself empress (Augusta) of the Eastern Roman Empire.\n* 836 – Pactum Sicardi, a peace treaty between the Principality of Benevento and the Duchy of Naples, is signed.\n* 993 – Ulrich of Augsburg is canonized as a saint.\n*1054 – A supernova, called SN 1054, is seen by Chinese Song dynasty, Arab, and possibly Amerindian observers near the star Zeta Tauri. For several months it remains bright enough to be seen during the day. Its remnants form the Crab Nebula.\n*1120 – Jordan II of Capua is anointed as prince after his infant nephew's death.\n*1187 – The Crusades: Battle of Hattin: Saladin defeats Guy of Lusignan, King of Jerusalem.\n*1253 – Battle of West-Capelle: John I of Avesnes defeats Guy of Dampierre.\n*1359 – Francesco II Ordelaffi of Forlì surrenders to the Papal commander Gil de Albornoz.\n*1456 – Ottoman wars in Europe: The Siege of Nándorfehérvár (Belgrade) begins.\n*1534 – Christian III is elected King of Denmark and Norway in the town of Rye.\n*1584 – Philip Amadas  and Arthur Barlowe arrive at Roanoke Island \n*1610 – The Battle of Klushino is fought between forces of the Polish–Lithuanian Commonwealth and Russia during the Polish–Muscovite War.\n*1634 – The city of Trois-Rivières is founded in New France (now Quebec, Canada).\n*1744 – The Treaty of Lancaster, in which the Iroquois cedes lands between the Allegheny Mountains and the Ohio River to the British colonies, was signed in Lancaster, Pennsylvania.\n*1774 – Orangetown Resolutions are adopted in the Province of New York, one of many protests against the British Parliament's Coercive Acts\n*1776 – American Revolution: The United States Declaration of Independence is adopted by the Second Continental Congress.\n*1778 – American Revolutionary War: American forces under George Clark capture Kaskaskia during the Illinois campaign.\n*1802 – At West Point, New York, the United States Military Academy opens.\n*1803 – The Louisiana Purchase is announced to the American people.\n*1817 – In Rome, New York, construction on the Erie Canal begins.\n*1826 – Thomas Jefferson, third president of the United States, dies the same day as John Adams, second president of the United States, on the fiftieth anniversary of the adoption of the United States Declaration of Independence.\n*1827 – Slavery is abolished in the State of New York.\n*1831 – Samuel Francis Smith writes \"My Country, 'Tis of Thee\" for the Boston, Massachusetts July 4 festivities.\n*1837 – Grand Junction Railway, the world's first long-distance railway, opens between Birmingham and Liverpool.\n*1838 – The Iowa Territory is organized.\n*1855 – The first edition of Walt Whitman's book of poems, Leaves of Grass, is published In Brooklyn.\n*1862 – Lewis Carroll tells Alice Liddell a story that would grow into Alice's Adventures in Wonderland and its sequels.\n*1863 – American Civil War: Siege of Vicksburg: Vicksburg, Mississippi surrenders to Ulysses S. Grant after 47 days of siege. One hundred fifty miles up the Mississippi River, a Confederate Army is repulsed at the Battle of Helena, Arkansas.\n*  1863   – American Civil War: The Army of Northern Virginia withdraws from the battlefield after losing the Battle of Gettysburg, signalling an end to the Southern invasion of the North.\n*1879 – Anglo-Zulu War: The Zululand capital of Ulundi is captured by British troops and burned to the ground, ending the war and forcing King Cetshwayo to flee.\n*1881 – In Alabama, the Tuskegee Institute opens.\n*1886 – The first scheduled Canadian transcontinental train arrives in Port Moody, British Columbia.\n*1887 – The founder of Pakistan, Quaid-i-Azam Muhammad Ali Jinnah, joins Sindh-Madrasa-tul-Islam, Karachi.\n*1892 – Western Samoa changes the International Date Line, causing Monday (July 4) to occur twice, resulting in a year with 367 days.\n*  1892   – The first double-decked street car service was inaugurated in San Diego, California.\n*1894 – The short-lived Republic of Hawaii is proclaimed by Sanford B. Dole.\n*1898 – En route from New York to Le Havre, the SS La Bourgogne collides with another ship and sinks off the coast of Sable Island, with the loss of 549 lives.\n*1901 – William Howard Taft becomes American governor of the Philippines.\n*1903 – Philippine–American War is officially concluded.\n*1910 – African-American boxer Jack Johnson knocks out white boxer Jim Jeffries in a heavyweight boxing match, sparking race riots across the United States.\n*1911 – A massive heat wave strikes the northeastern United States, killing 380 people in eleven days and breaking temperature records in several cities.\n*1913 – President Woodrow Wilson addresses American Civil War veterans at the Great Reunion of 1913.\n*1914 – The funeral of Archduke Franz Ferdinand and his wife Sophie takes place in Vienna, six days after their assassinations in Sarajevo.\n*1918 – Mehmed V died at the age of 73 and  Ottoman sultan Mehmed VI ascends to the throne.\n*  1918   – World War I: The Battle of Hamel, a successful attack by the Australian Corps against German positions near the town of Le Hamel on the Western Front.\n*  1918   – Bolsheviks kill Tsar Nicholas II of Russia and his family (Julian calendar date).\n*1927 – First flight of the Lockheed Vega.\n*1934 – Leo Szilard patents the chain-reaction design that would later be used in the atomic bomb.\n*1939 – Lou Gehrig, recently diagnosed with Amyotrophic lateral sclerosis, informs a crowd at Yankee Stadium that he considers himself \"The luckiest man on the face of the earth\", then announces his retirement from major league baseball.\n*1941 – Nazi crimes against the Polish nation: Nazi troops massacre Polish scientists and writers in the captured Ukrainian city of Lviv.\n*  1941   – World War II: The Burning of the Riga synagogues: The Great Choral Synagogue in German occupied Riga is burnt with 300 Jews locked in the basement.\n*1942 – World War II: The 250-day Siege of Sevastopol in the Crimea ends when the city falls to Axis forces.\n*1943 – World War II: The Battle of Kursk, the largest full-scale battle in history and the world's largest tank battle, begins in the village of Prokhorovka.\n*  1943   – World War II: In Gibraltar, a Royal Air Force B-24 Liberator bomber crashes into the sea in an apparent accident moments after takeoff, killing sixteen passengers on board,  including general Władysław Sikorski, the commander-in-chief of the Polish Army and the Prime Minister of the Polish government-in-exile; only the pilot survives.\n*1946 – The Kielce pogrom against Jewish Holocaust survivors in Poland.\n*  1946   – After 381 years of near-continuous colonial rule by various powers, the Philippines attains full independence from the United States.\n*1947 – The \"Indian Independence Bill\" is presented before the British House of Commons, proposing the independence of the Provinces of British India into two sovereign countries: India and Pakistan.\n*1950 – Cold War: Radio Free Europe first broadcasts.\n*1951 – Cold War: A court in Czechoslovakia sentences American journalist William N. Oatis to ten years in prison on charges of espionage.\n*  1951   – William Shockley announces the invention of the junction transistor.\n*1958 – U.S. President Dwight D. Eisenhower signed the Rivers and Harbors Flood Control Bill.\n*1960 – Due to the post-Independence Day admission of Hawaii as the 50th U.S. state on August 21, 1959, the 50-star flag of the United States debuts in Philadelphia, almost ten and a half months later (see Flag Acts (United States)).\n*1961 – On its maiden voyage, the Soviet nuclear-powered submarine K-19 suffers a complete loss of coolant to its reactor. The crew are able to effect repairs, but 22 of them die of radiation poisoning over the following two years.\n*1966 – U.S. President Lyndon B. Johnson signs the Freedom of Information Act into United States law. The act went into effect the next year.\n*1976 – Israeli commandos raid Entebbe airport in Uganda, rescuing all but four of the passengers and crew of an Air France jetliner seized by Palestinian terrorists.\n*  1976   – The U.S. celebrates its Bicentennial.\n*1977 – The George Jackson Brigade plants a bomb at the main power substation for the Washington state capitol in Olympia, in solidarity with a prison strike at the Walla Walla State Penitentiary Intensive Security Unit\n*1982 – Three Iranian diplomats and a journalist are kidnapped in Lebanon by Phalange forces, and their fate remains unknown.\n*1987 – In France, former Gestapo chief Klaus Barbie (a.k.a. the \"Butcher of Lyon\") is convicted of crimes against humanity and sentenced to life imprisonment.\n*1994 – Rwandan genocide: Kigali, the Rwandan capital, is captured by the Rwandan Patriotic Front, ending the genocide in the city.\n*1997 – NASA's Pathfinder space probe lands on the surface of Mars.\n*1998 – Japan launches the Nozomi probe to Mars, joining the United States and Russia as a space exploring nation.\n*2004 – The cornerstone of the Freedom Tower is laid on the World Trade Center site in New York City.\n*2005 – The Deep Impact collider hits the comet Tempel 1.\n*2009 – The Statue of Liberty's crown reopens to the public after eight years of closure due to security concerns following the September 11 attacks.\n*  2009   – The first of four days of bombings begins on the southern Philippine island group of Mindanao.\n*2012 – The discovery of particles consistent with the Higgs boson at the Large Hadron Collider is announced at CERN.\n\nBirths\n\n* AD 68 – Salonina Matidia, Roman daughter of Ulpia Marciana (d. 119)\n*1095 – Usama ibn Munqidh, Muslim poet, author and faris (Knight) (d. 1188)\n*1330 – Ashikaga Yoshiakira, Japanese shogun (d. 1367)\n*1477 – Johannes Aventinus, Bavarian historian and philologist (d. 1534)\n*1546 – Murad III, Ottoman sultan (d. 1595)\n*1656 – John Leake, Royal Navy admiral (d. 1720)\n*1694 – Louis-Claude Daquin, French organist and composer (d. 1772)\n*1715 – Christian Fürchtegott Gellert, German poet and academic (d. 1769)\n*1719 – Michel-Jean Sedaine, French playwright (d. 1797) \n*1729 – George Leonard, American lawyer, jurist and politician (d. 1819)\n*1753 – Jean-Pierre Blanchard, French inventor, best known as a pioneer in balloon flight (d. 1809)\n*1790 – George Everest, Welsh geographer and surveyor (d. 1866)\n*1799 – Oscar I of Sweden (d. 1859)\n*1804 – Nathaniel Hawthorne, American novelist and short story writer (d. 1864)\n*1807 – Giuseppe Garibaldi, Italian general and politician (d. 1882)\n*1816 – Hiram Walker, American businessman, founded Canadian club whiskey  (d. 1899)\n*1826 – Stephen Foster, American songwriter and composer (d. 1864)\n*1845 – Thomas John Barnardo, Irish philanthropist and humanitarian (d. 1905)\n*1847 – James Anthony Bailey, American circus ringmaster, co-founded Ringling Bros. and Barnum & Bailey Circus (d. 1906)\n*1854 – Victor Babeș, Romanian physician and biologist (d. 1926)\n*1868 – Henrietta Swan Leavitt, American astronomer and academic (d. 1921)\n*1872 – Calvin Coolidge, American lawyer and politician, 30th President of the United States (d. 1933)\n*1874 – John McPhee, Australian journalist and politician, 27th Premier of Tasmania (d. 1952)\n*1880 – Victor Kraft, Austrian philosopher from the Vienna Circle (d. 1975)\n*1881 – Ulysses S. Grant III, American general (d. 1968)\n*1883 – Rube Goldberg, American sculptor, cartoonist, and engineer (d. 1970)\n*1887 – Pio Pion, Italian engineer and businessman (d. 1965)\n*1888 – Henry Armetta, Italian-American actor and singer (d. 1945)\n*1895 – Irving Caesar, American songwriter and composer (d. 1996)\n*1896 – Mao Dun, Chinese journalist, author, and critic (d. 1981)\n*1897 – Alluri Sitarama Raju, Indian activist (d. 1924)\n*1898 – Pilar Barbosa, Puerto Rican-American historian and activist (d. 1997)\n*  1898   – Gertrude Lawrence, British actress, singer, and dancer (d. 1952)\n*  1898   – Gulzarilal Nanda, Indian politician (d. 1998)\n*  1898   – Gertrude Weaver, American supercentenarian (d. 2015)\n*1900 – Belinda Dann, Indigenous Australian who was one of the Stolen Generation, reunited with family aged 107 (d. 2007)\n*  1900   – Nellie Mae Rowe, African-American folk artist (d. 1982)\n*1902 – Meyer Lansky, American gangster (d. 1983)\n*  1902   – George Murphy, American actor and politician (d. 1992)\n*1903 – Flor Peeters, Belgian organist, composer, and educator (d. 1986)\n*1904 – Angela Baddeley, English actress (d. 1976)\n*1905 – Irving Johnson, American sailor and author (d. 1991)\n*  1905   – Robert Hankey, 2nd Baron Hankey, British diplomat and public servant (d. 1996)\n*  1905   – Lionel Trilling, American critic, essayist, short story writer, and educator (d. 1975)\n*1906 – Vincent Schaefer, American chemist and meteorologist (d. 1993)\n*1907 – John Anderson, American discus thrower (d. 1948)\n*  1907   – Howard Taubman, American author and critic (d. 1996)\n*1909 – Alec Templeton, Welsh composer, pianist and satirist (d. 1963) \n*1910 – Robert K. Merton, American sociologist and scholar (d. 2003)\n*  1910   – Gloria Stuart, American actress (d. 2010)\n*1911 – Bruce Hamilton, Australian public servant (d. 1989)\n*  1911   – Mitch Miller, American singer and producer (d. 2010)\n*1914 – Nuccio Bertone, Italian automobile designer (d. 1997)\n*1915 – Timmie Rogers, American actor and singer-songwriter (d. 2006)\n*1916 – Iva Toguri D'Aquino, American typist and broadcaster (d. 2006)\n*1918 – Eppie Lederer, American journalist and radio host (d. 2002)\n*  1918   – Johnnie Parsons, American race car driver (d. 1984)\n*  1918   – Taufa'ahau Tupou IV, King of Tonga (d. 2006)\n*  1918   – Alec Bedser, English cricketer (d. 2010)\n*  1918   – Eric Bedser, English cricketer (d. 2006)\n*  1918   – Pauline Phillips, American journalist and radio host, created Dear Abby (d. 2013)\n*1920 – Norm Drucker, American basketball player and referee (d. 2015)\n*  1920   – Leona Helmsley, American businesswoman (d. 2007)\n*  1920   – Fritz Wilde, German footballer and manager (d. 1977)\n*1921 – Gérard Debreu, French economist and mathematician, Nobel Prize laureate (d. 2004)\n*  1921   – Metropolitan Mikhail of Asyut (d. 2014)\n*  1921   – Philip Rose, American actor, playwright, and producer (d. 2011)\n*  1921   – Tibor Varga, Hungarian violinist and conductor (d. 2003)\n*1923 – Rudolf Friedrich, Swiss lawyer and politician (d. 2013)\n*1924 – Eva Marie Saint, American actress \n*1926 – Alfredo Di Stéfano, Argentinian-Spanish footballer and coach (d. 2014)\n*  1926   – Lake Underwood, American race car driver and businessman (d. 2008)\n*1927 – Gina Lollobrigida, Italian actress and photographer\n*  1927   – Neil Simon, American playwright and screenwriter\n*1928 – Giampiero Boniperti, Italian footballer and politician\n*  1928   – Teofisto Guingona Jr., Filipino politician; 11th Vice President of the Philippines\n*  1928   – Shan Ratnam, Sri Lankan physician and academic (d. 2001)\n*  1928   – Chuck Tanner, American baseball player and manager (d. 2011)\n*1929 – Al Davis, American football player, coach, and manager (d. 2011)\n*  1929   – Bill Tuttle, American baseball player (d. 1998)\n*1930 – Ron Casey, Australian journalist and sportscaster\n*  1930   – George Steinbrenner, American businessman (d. 2010)\n*1931 – Stephen Boyd, Northern Ireland-born American actor (d. 1977)\n*  1931   – Rick Casares, American football player and soldier (d. 2013)\n*  1931   – Sébastien Japrisot, French author, director, and screenwriter (d. 2003)\n*  1931   – Peter Richardson, English cricketer (d. 2017)\n*1932 – Aurèle Vandendriessche, Belgian runner\n*1934 – Yvonne B. Miller, American academic and politician (d. 2012)\n*  1934   – Colin Welland, English actor and screenwriter (d. 2015)\n*1935 – Paul Scoon, Grenadian politician, 2nd Governor-General of Grenada (d. 2013)\n*1936 – Zdzisława Donat, Polish soprano and actress\n*1937 – Thomas Nagel, American philosopher and academic\n*  1937   – Queen Sonja of Norway\n*  1937   – Richard Rhodes, American journalist and historian\n*  1937   – Eric Walters, Australian journalist (d. 2010)\n*1938 – Steven Rose, English biologist and academic\n*  1938   – Bill Withers, American singer-songwriter and producer\n*1940 – Pat Stapleton, Canadian ice hockey player\n*1941 – Sam Farr, American politician\n*  1941   – Tomaž Šalamun, Croatian-Slovenian poet and academic (d. 2014)\n*  1941   – Pavel Sedláček, Czech singer-songwriter and guitarist\n*  1941   – Brian Willson, American soldier, lawyer, and activist\n*1942 – Hal Lanier, American baseball player, coach, and manager\n*  1942   – Floyd Little, American football player and coach\n*  1942   – Stefan Meller, French-Polish academic and politician, Polish Minister of Foreign Affairs (d. 2008)\n*  1942   – Prince Michael of Kent\n*  1942   – Peter Rowan, American singer-songwriter and guitarist\n*1943 – Conny Bauer, German trombonist\n*  1943   – Emerson Boozer, American football player and sportscaster\n*  1943   – Adam Hart-Davis, English historian, author, and photographer\n*  1943   – Geraldo Rivera, American lawyer, journalist, and author\n*  1943   – Alan Wilson, American singer-songwriter and guitarist (d. 1970)\n*1945 – Andre Spitzer, Romanian-Israeli fencer and coach (d. 1972)\n*1946 – Ron Kovic, American author and activist\n*  1946   – Michael Milken, American businessman and philanthropist\n*1947 – Lembit Ulfsak, Estonian actor and director (d. 2017)\n*1948 – René Arnoux, French race car driver\n*  1948   – Tommy Körberg, Swedish singer and actor\n*  1948   – Jeremy Spencer, English singer-songwriter and guitarist \n*1950 – Philip Craven, English basketball player and swimmer\n*  1950   – David Jensen, Canadian-English radio and television host\n*1951 – John Alexander, Australian tennis player and politician \n*  1951   – Ralph Johnson, American R&B drummer and percussionist \n*  1951   – Vladimir Tismăneanu, Romanian-American political scientist, sociologist, and academic\n*  1951   – Kathleen Kennedy Townsend, American lawyer and politician, 6th Lieutenant Governor of Maryland\n*1952 – Álvaro Uribe, Colombian lawyer and politician, 39th President of Colombia\n*  1952   – Carol MacReady, English actress\n*  1952   – John Waite, English singer-songwriter and guitarist\n*  1952   – Paul Rogat Loeb, American author and activist \n*1953 – Francis Maude, English lawyer and politician, Minister for the Cabinet Office\n*1954 – Jim Beattie, American baseball player, coach, and manager\n*  1954   – Morganna, American model, actress, and dancer\n*1955 – Kevin Nichols, Australian cyclist\n*1956 – Robert Sinclair MacKay, British academic and educator\n*1957 – Rein Lang, Estonian politician and diplomat, 25th Estonian Minister of Foreign Affairs\n*1958 – Vera Leth, Greenlandic Ombudsman\n*  1958   – Kirk Pengilly, Australian guitarist, saxophonist, and songwriter \n*  1958   – Carl Valentine, English-Canadian footballer, coach, and manager\n*1959 – Victoria Abril, Spanish actress and singer\n*1960 – Roland Ratzenberger, Austrian race car driver (d. 1994)\n*1961 – Richard Garriott, English-American video game designer, created the Ultima series\n*1962 – Pam Shriver, American tennis player and sportscaster\n*1963 – Henri Leconte, French tennis player and sportscaster\n*  1963   – Laureano Márquez, Spanish-Venezuelan political scientist and journalist\n*  1963   – José Oquendo, Puerto Rican-American baseball player and coach\n*1964 – Cle Kooiman, American soccer player and manager\n*  1964   – Elie Saab, Lebanese fashion designer\n*  1964   – Edi Rama, Albanian politician\n*  1964   – Mark Slaughter, American singer-songwriter and producer \n*  1964   – Mark Whiting, American actor, director, and screenwriter\n*1965 – Harvey Grant, American basketball player and coach\n*  1965   – Horace Grant, American basketball player and coach\n*  1965   – Kiriakos Karataidis, Greek footballer and manager\n*  1965   – Gérard Watkins, English actor and playwright\n*1966 – Minas Hantzidis, German-Greek footballer\n*  1966   – Lee Reherman, American actor (d. 2016)\n*1967 – Vinny Castilla, Mexican baseball player and manager\n*  1967   – Sébastien Deleigne, French athlete\n*  1967   – Andy Walker, English-Canadian journalist\n*1968 – Ronni Ancona, Scottish actress and screenwriter\n*  1968   – Jack Frost, American guitarist and songwriter \n*1969 – Al Golden, American football player and coach\n*  1969   – Todd Marinovich, American football player and coach\n*  1969   – Wilfred Mugeyi, Zimbabwean footballer and coach\n*1972 – Stephen Giles, Canadian canoe racer and engineer\n*  1972   – William Goldsmith, American drummer \n*  1972   – Mike Knuble, Canadian-American ice hockey player and coach\n*1973 – Keiko Ihara, Japanese race car driver\n*  1973   – Michael Johnson, English-Jamaican footballer and manager\n*  1973   – Anjelika Krylova, Russian ice dancer and coach\n*  1973   – Jan Magnussen, Danish race car driver\n*  1973   – Tony Popovic, Australian footballer and manager\n*1974 – Jill Craybas, American tennis player\n*  1974   – La'Roi Glover, American football player and sportscaster\n*  1974   – Adrian Griffin, American basketball player and coach\n*1975 – John Lloyd Young, American actor and singer\n*1976 – Daijiro Kato, Japanese motorcycle racer (d. 2003)\n*  1976   – Yevgeniya Medvedeva, Russian skier\n*1977 – Zoe Naylor, Australian actress, journalist, and producer\n*1978 – Marcos Daniel, Brazilian tennis player\n*  1978   – Andrea Gabriel, American actress, producer, and screenwriter\n*  1978   – Stephen McNally, English singer-songwriter \n*  1978   – Émile Mpenza, Belgian footballer\n*1979 – Dumas, Canadian singer-songwriter and guitarist\n*  1979   – Siim Kabrits, Estonian politician\n*  1979   – Josh McCown, American football player\n*  1979   – Renny Vega, Venezuelan footballer\n*1980 – Kwame Steede, Bermudan footballer\n*1981 – Dedé, Angolan footballer\n*  1981   – Brock Berlin, American football player\n*  1981   – Christoph Preuß, German footballer\n*  1981   – Francisco Cruceta, Dominican baseball player\n*  1981   – Will Smith, American football player (d. 2016)\n*1982 – Vladimir Boisa, Georgian basketball player\n*  1982   – Vladimir Gusev, Russian cyclist\n*  1982   – Jeff Lima, New Zealand rugby league player\n*  1982   – Michael \"The Situation\" Sorrentino, American model, author and television personality\n*1983 – Melanie Fiona, Canadian singer-songwriter \n*  1983   – Ben Jorgensen, American singer-songwriter and guitarist \n*  1983   – Amantle Montsho, Botswanan sprinter\n*  1983   – Andrew Mrotek, American drummer \n*  1983   – Miguel Pinto, Chilean footballer\n*  1983   – Amol Rajan, Indian-English journalist\n*  1983   – Mattia Serafini, Italian footballer \n*1984 – Jin Akanishi, Japanese singer-songwriter \n*  1984   – Miguel Santos Soares, Timorese footballer\n*  1985   – Kane Tenace, Australian footballer\n*  1985   – Dimitrios Mavroeidis, Greek basketball player\n*  1985   – Wason Rentería, Colombian footballer\n*1986 – Ömer Aşık, Turkish basketball player\n*  1986   – Takahisa Masuda, Japanese singer \n*  1986   – Nguyen Ngoc Duy, Vietnamese footballer\n*  1986   – Rafael Arévalo, Salvadoran tennis player\n*  1986   – Willem Janssen, Dutch footballer\n*  1986   – Fanny Valette, French actress\n*  1986   – Terrance Knighton, American football player\n*  1986   – Marte Elden, Norwegian skier\n*1987 – Wude Ayalew, Ethiopian runner\n*  1987   – Guram Kashia, Georgian footballer\n*1989 – Benjamin Büchel, English footballer\n*1990 – Jake Gardiner, American ice hockey player\n*  1990   – Richard Mpong, Ghanaian footballer\n*  1990   – Naoki Yamada, Japanese footballer\n*  1990   – Ihar Yasinski, Belarusian footballer\n*1993 – Tom Barkhuizen, English footballer\n\nDeaths\n\n* 673 – Ecgberht, king of Kent \n* 907 – Luitpold, margrave of Bavaria\n*   907   – Dietmar I, archbishop of Salzburg\n* 910 – Luo Shaowei, Chinese warlord (b. 877)\n* 940 – Wang Jianli, Chinese general (b. 871)\n* 943 – Taejo of Goryeo, Korean king (b. 877)\n* 945 – Zhuo Yanming, Chinese Buddhist monk and emperor\n* 965 – Benedict V, pope of the Catholic Church\n* 973 – Ulrich of Augsburg, German bishop and saint (b. 890)\n* 975 – Gwangjong of Goryeo, Korean king (b. 925)\n*1187 – Raynald of Châtillon, French knight (b. 1125)\n*1307 – Rudolf I of Bohemia (b. 1281)\n*1336 – Saint Elizabeth of Portugal (b. 1271)\n*1429 – Carlo I Tocco, ruler of Epirus (b. 1372)\n*1533 – John Frith, English priest, writer, and martyr (b. 1503) \n*1541 – Pedro de Alvarado, Spanish general and explorer (b. 1495)\n*1546 – Hayreddin Barbarossa, Greek-Turkish admiral (b. 1478)\n*1551 – Gregory Cromwell, 1st Baron Cromwell, English politician (b. 1514)\n*1603 – Philippe de Monte, Flemish composer and educator (b. 1521)\n*1623 – William Byrd, English composer (b. c. 1540)\n*1644 – Brian Twyne, English academic, antiquarian  and archivist (b. 1581)\n*1648 – Antoine Daniel, French missionary and saint (b. 1601)\n*1742 – Luigi Guido Grandi, Italian monk, mathematician, and engineer (b. 1671)\n*1754 – Philippe Néricault Destouches, French playwright and author (b. 1680)\n*1761 – Samuel Richardson, English author and painter (b. 1689)\n*1780 – Prince Charles Alexander of Lorraine (b. 1712)\n*1787 – Charles, Prince of Soubise, Marshal of France (b. 1715)\n*1821 – Richard Cosway, English painter and academic (b. 1742)\n*1826 – John Adams, American lawyer and politician, 2nd President of the United States (b. 1735)\n*  1826   – Thomas Jefferson, American architect, lawyer, and politician, 3rd President of the United States (b. 1743)\n*1831 – James Monroe, American soldier, lawyer, and politician, 5th President of the United States (b. 1758)\n*1848 – François-René de Chateaubriand, French historian and politician (b. 1768)\n*1850 – William Kirby, English entomologist and author (b. 1759)\n*1854 – Karl Friedrich Eichhorn, German academic and jurist (b. 1781)\n*1857 – William L. Marcy, American lawyer, judge, and politician, 21st United States Secretary of State (b. 1786)\n*1881 – Johan Vilhelm Snellman, Finnish philosopher and politician (b. 1806)\n*1882 – Joseph Brackett, American composer and author (b. 1797)\n*1886 – Poundmaker, Canadian tribal chief (b. 1797)\n*1891 – Hannibal Hamlin, American lawyer and politician, 15th Vice President of the United States (b. 1809)\n*1901 – Johannes Schmidt, German linguist and academic (b. 1843)\n*1902 – Vivekananda, Indian monk and saint (b. 1863)\n*1905 – Élisée Reclus, French geographer and author (b. 1830)\n*1910 – Melville Fuller, American lawyer and jurist, 8th Chief Justice of the United States (b. 1833)\n*  1910   – Giovanni Schiaparelli, Italian astronomer and historian (b. 1835)\n*1916 – Alan Seeger, American soldier and poet (b. 1888)\n*1922 – Lothar von Richthofen, German lieutenant and pilot (b. 1894)\n*1926 – Pier Giorgio Frassati, Italian activist and saint (b. 1901)\n*1934 – Marie Curie, French-Polish physicist and chemist, Nobel Prize laureate (b. 1867)\n*1938 – Otto Bauer, Austrian philosopher and politician, Austrian Minister of Foreign Affairs (b. 1881)\n*  1938   – Suzanne Lenglen, French tennis player (b. 1899)\n*1941 – Antoni Łomnicki, Polish mathematician and academic (b. 1881)\n*1943 – Władysław Sikorski, Polish general and politician, 9th Prime Minister of the Second Republic of Poland (b. 1881)\n*1946 – Taffy O'Callaghan, Welsh footballer and coach (b. 1906)\n*1948 – Monteiro Lobato, Brazilian journalist and author (b. 1882)\n*1949 – François Brandt, Dutch rower and engineer (b. 1874)\n*1963 – Bernard Freyberg, 1st Baron Freyberg, New Zealand general and politician, 7th Governor-General of New Zealand (b. 1889)\n*  1963   – Clyde Kennard, American activist and martyr (b. 1927)\n*  1963   – Pingali Venkayya, Indian activist, designed the Flag of India (b. 1876) \n*1964 – Gaby Morlay, French actress and singer (b. 1893)\n*1969 – Henri Decoin, French director and screenwriter (b. 1890)\n*1970 – Barnett Newman, American painter and illustrator (b. 1905)\n*  1970   – Harold Stirling Vanderbilt, American sailor and businessman (b. 1884)\n*1971 – August Derleth, American anthologist and author (b. 1909)\n*  1971   – Thomas C. Hart, American admiral and politician (b. 1877)\n*1974 – Georgette Heyer, English author (b. 1902)\n*  1974   – André Randall, French actor (b. 1892)\n*1976 – Yonatan Netanyahu, Israeli colonel (b. 1946)\n*  1976   – Antoni Słonimski, Polish poet and playwright (b. 1895)\n*1977 – Gersh Budker, Ukrainian physicist and academic (b. 1918)\n*1979 – Lee Wai Tong, Chinese footballer and manager (b. 1905)\n*1980 – Maurice Grevisse, Belgian linguist and author (b. 1895)\n*1984 – Jimmie Spheeris, American singer-songwriter (b. 1949)\n*1986 – Paul-Gilbert Langevin, French musicologist, critique musical and physicist (b. 1933)\n*  1986   – Flor Peeters, Belgian organist and composer (b. 1903)\n*  1986   – Oscar Zariski, Belarusian-American mathematician and academic (b. 1899)\n*1988 – Adrian Adonis, American wrestler (b. 1954)\n*1990 – Olive Ann Burns, American journalist and author (b. 1924)\n*1991 – Victor Chang, Chinese-Australian surgeon and physician (b. 1936)\n*  1991   – Art Sansom, American cartoonist (b. 1920)\n*1992 – Astor Piazzolla, Argentinian bandoneon player and composer (b. 1921)\n*1993 – Bona Arsenault, Canadian historian, genealogist, and politician (b. 1903)\n*1994 – Joey Marella, American wrestling referee (b. 1964)\n*1995 – Eva Gabor, Hungarian-American actress and singer (b. 1919)\n*  1995   – Bob Ross, American painter and television host (b. 1942)\n*1997 – Charles Kuralt, American journalist (b. 1934)\n*  1997   – John Zachary Young, English zoologist and neurophysiologist (b. 1907)\n*1999 – Leo Garel, American illustrator and educator (b. 1917)\n*2000 – Gustaw Herling-Grudziński, Polish journalist and author (b. 1919)\n*2002 – Gerald Bales, Canadian organist and composer (b. 1919)\n*  2002   – Benjamin O. Davis, Jr., American general (b. 1912)\n*2003 – Larry Burkett, American author and radio host (b. 1939)\n*  2003   – André Claveau, French singer (b. 1915)\n*  2003   – Barry White, American singer-songwriter, pianist, and producer (b. 1944)\n*2004 – Jean-Marie Auberson, Swiss violinist and conductor (b. 1920)\n*2005 – Cliff Goupille, Canadian ice hockey player (b. 1915)\n*  2005   – Hank Stram, American football player and coach (b. 1923)\n*2007 – Bill Pinkney, American singer (b. 1925)\n*2008 – Thomas M. Disch, American author and poet (b. 1940)\n*  2008   – Jesse Helms, American politician (b. 1921)\n*  2008   – Evelyn Keyes, American actress (b. 1916)\n*  2008   – Terrence Kiel, American football player (b. 1980)\n*  2008   – Charles Wheeler, German-English soldier and journalist (b. 1923)\n*2009 – Brenda Joyce, American actress (b. 1917)\n*  2009   – Allen Klein, American businessman and talent agent, founded ABKCO Records (b. 1931)\n*  2009   – Drake Levin, American guitarist (b. 1946)\n*  2009   – Steve McNair, American football player (b. 1973)\n*  2009   – Lasse Strömstedt, Swedish author and actor (b. 1935)\n*  2009   – Jean-Baptiste Tati Loutard, Congolese poet and politician (b. 1938)\n*2010 – Robert Neil Butler, American physician and author (b. 1927)\n*2012 – Hiren Bhattacharyya, Indian poet and author (b. 1932)\n*  2012   – Jimmy Bivins, American boxer (b. 1919)\n*  2012   – Jeong Min-hyeong, South Korean footballer (b. 1987)\n*  2012   – Eric Sykes, English actor, director, and screenwriter (b. 1923)\n*2013 – Onllwyn Brace, Welsh rugby player and sportscaster (b. 1932)\n*  2013   – Jack Crompton, English footballer and manager (b. 1921)\n*  2013   – James Fulton, American dermatologist and academic (b. 1940)\n*  2013   – Charles A. Hines, American general (b. 1935)\n*  2013   – Bernie Nolan, Irish singer (b. 1960)\n*2014 – Giorgio Faletti, Italian author, screenwriter, and actor (b. 1950)\n*  2014   – C. J. Henderson, American author and critic (b. 1951)\n*  2014   – Earl Robinson, American baseball player (b. 1936)\n*  2014   – Richard Mellon Scaife, American businessman (b. 1932)\n*2015 – Nedelcho Beronov, Bulgarian judge and politician (b. 1928)\n*  2015   – William Conrad Gibbons, American historian, author, and academic (b. 1926)\n\nHolidays and observances\n\n*Christian feast day:\n**Andrew of Crete\n**Bertha of Artois\n**Blessed Catherine Jarrige\n**Blessed Pier Giorgio Frassati\n**Elizabeth of Aragon (or of Portugal)\n**Oda of Canterbury\n**Ulrich of Augsburg\n**July 4 (Eastern Orthodox liturgics)\n*Birthday of Queen Sonja (Norway)\n*The first evening of Dree Festival, celebrated until July 7 (Apatani people, Arunachal Pradesh, India)\n*Independence Day, celebrates the Declaration of Independence of the United States from Great Britain in 1776. (United States and its dependencies)\n*Liberation Day (Northern Mariana Islands)\n*Liberation Day (Rwanda)\n*Republic Day (Philippines). July 4. http://en.wikipedia.org/?curid=15849."
  }
}
