{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19166",
  "eid" : "38783b20-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778603986,
  "textBody" : "Maya Ying Lin (born October 5, 1959) is an American designer and artist who is known for her work in sculpture and land art. She achieved national recognition at the age of 21 while still an undergraduate at Yale University when her design was chosen in a national competition for the Vietnam Veterans Memorial in Washington, D.C. It is considered one of the most influential memorials of the post-World War II period.\n\nLin has completed designs for other memorials, as well as for numerous public and private buildings, landscape design, and sculpture. Although Lin’s most well known sculptures and architectural work are historical memorials, she also works to memorialize nature through her environmentally themed works. In creating works which deal with the depleting environment, Lin aims to raise awareness for the environment for audiences in urban spaces.\n\nEarly life and education\n\nMaya Lin was born in Athens, Ohio. Her parents had migrated to the United States from \nChina, her father in 1948 and her mother in 1949, and settled in Ohio before Maya was born.Finding Your Roots, February 2, 2016, PBS Her father, Henry Huan Lin, born in Fuzhou, Fujian, was a ceramist and former dean of the Ohio University College of Fine Arts. Her mother, Julia Chang Lin, born in Shanghai, is a poet and taught literature at Ohio University. She is the niece of Lin Huiyin, who is an American-educated artist, poet and said to be the first female architect in modern China. Lin Juemin and Lin Yin Ming, both of whom are among the 72 martyrs of the Second Guangzhou Uprising, were cousins of her grandfather. Lin Chang-min, a Hanlin of Qing dynasty and the emperor's teacher, was the father of Lin Hui-yin and great-grandfather of Maya Lin.\n\nLin graduated from Yale University, where she received a Bachelor of Arts degree in 1981 and a Master of Architecture degree in 1986.\n\nLin is married to Daniel Wolf, a New York photography dealer. They have two daughters, India and Rachel.\n\nLin is one of the youngest of the Baby Boom generation (https://www.saeculumresearch.com/knowledge-center/generations-and-turnings/the-generational-constellation) and has an older brother, the poet Tan Lin. Growing up, she did not have many friends and stayed home a lot. She loved school and loved to study. When she was not studying, she took independent courses from Ohio University and spent her free time casting bronzes in the school foundry.[http://www.achievement.org/achiever/maya-lin/#interview Maya Lin Interview – Academy of Achievement]. Achievement.org. Retrieved on April 25, 2012. Lin, having grown up as an Asian minority, has said that she \"didn't even realize\" she was Chinese until later in life. It was not until her 30s that she had a desire to understand her cultural background.  Commenting on her design of a new building for the Museum of Chinese in America near New York City's Chinatown, Lin attached a personal significance to the project being a Chinese-related project. She wants her two daughters to \"know that part of their heritage\".\n\nEnvironmental concerns  \n\nLin has stated that environmental issues have concerned her since she was very young, and she dedicated much of her time at Yale University to environmental activism.Munro, Eleanor C. Originals: American women artists. Boulder, CO: Da Capo Press, 2000.\n Much of her later work, after her work on memorials, focuses on the relationship that people have with their environment, which she displays in earthworks, sculptures, and installations. Lin's work centers on the concept of uncovering \"hidden histories\" to bring attention to landscapes and environments that may otherwise be inaccessible to viewers and \"deploys the concept to discuss the inextricable relationship between nature and the built environment.\"Min, Susette. \"Entropic Designs: A Review of Maya Lin: Systematic Landscapes and Asian/American/Modern Art: Shifting Currents, 1900-1970 at the De Young Museum.\" American Quarterly 61, no. 1 (2009): 193-215. Lin's focus on this relationship highlights the impact humanity has on the environment, and draws attention to her concerns such as global warming, endangered bodies of water, and animal extinction/endangerment. These issues are explored in what Lin calls her latest memorial, [http://whatismissing.net/ What Is Missing?].\n\nLin also sits on the Natural Resources Defense Council [https://www.nrdc.org/board-trustees board of trustees]. She constructs her works to have a minimal effect on the environment, utilizing recycled and sustainable materials, minimizes carbon emissions, and avoids damage to the landscapes/ecosystems she works upon.Mendelsohn, Meredith. \"Maya Lin.\" Art + Auction 33, no. 4 (December 2009): 40-90. Art & Architecture Source, EBSCOhost (accessed April 14, 2017).\n\nVietnam Veterans Memorial\n\nIn 1981, at 21 and still an undergraduate, Lin won a public design competition for the Vietnam Veterans Memorial, beating 1,441 other competition submissions. The black cut-stone masonry wall, with the names of 57,661 fallen soldiers carved into its face, was completed in late October 1982 and dedicated the next month, on November 1982. The wall is granite and V-shaped, with one side pointing to the Lincoln Memorial and the other to the Washington Monument.\n\nLin's conception was to create an opening or a wound in the earth to symbolize the gravity of the loss of the soldiers. The design was initially very controversial for several reasons. It was an unconventional and non-traditional design for a war memorial.[http://www.npr.org/2015/04/30/403034599/vietnam-veterans-memorial-founder-monument-almost-never-got-built Vietnam Veterans' Memorial Founder: Monument Almost Never Got Built] Also controversial were Lin's Asian ethnicity, and her lack of professional experience. The memorial has since become an important pilgrimage site for relatives and friends of the American military casualties in Vietnam, and personal tokens and mementos are left at the wall daily in the casualties' memory.[https://web.archive.org/web/20020203074950/http://www.gale.com/free_resources/whm/bio/lin_m.htm Free Resources – Women's History – Biographies – Maya Lin]. Gale (March 12, 2002). Retrieved on April 25, 2012.[http://www.greatbuildings.com/architects/Maya_Lin.html Maya Lin – Great Buildings Online]. Greatbuildings.com. Retrieved on April 25, 2012. In 2007, the American Institute of Architects ranked the memorial #10 on their list of America's Favorite Architecture.\"\n\nLin believes that if the competition had not been \"blind,\" with designs submitted by name instead of number, she \"never would have won.\" She received harassment after her ethnicity was revealed. Prominent businessman and later third party presidential candidate Ross Perot called her an \"egg roll\" after it was revealed that she was Asian. Lin defended her design in front of the US Congress, and eventually, a compromise was reached. The Three Soldiers, a bronze statue of a group of soldiers and an American flag, was placed off to one side of her design.\n\nHowever, the artist's architectural design was controversial due to particular aspects, such as the exclusion of the surviving veterans' names as well as the dark complexion of the marble. Many argue that the memorial only honors the soldiers who lost their lives during the Vietnam War, and others believe that the color of the marble resembles disgust and sadness towards this specific war. Yet, a 50-foot-high flagpole and an 8-foot-high statue of three soldiers were added to the Vietnam Veterans Memorial to appease any external pressures.\n\nLater work\n\nMaya Lin calls herself a \"designer,\" rather than an \"architect.\"In a 2008 interview, she said, \"I'm not licensed as an architect, so I technically cannot label myself as an architect, although I would say that we pretty much produce with architects of record supervising. I love architecture and I love building architecture, but technically, legally, I'm not licensed, so I’m a designer.\" Her vision and her focus are always on how space needs to be in the future and what it means to people. She has tried to focus less on how politics influences design and more on what emotions the space would create and what it would symbolize to the user. Her belief in a space being connected and the transition from inside to outside being fluid, coupled with what a space means, has led her to create some very memorable designs. She has also worked on sculptures and landscape installations. In doing so, Lin focuses on memorializing concepts of time periods instead of direct representations of figures, creating an abstract sculptures and installations.\n\nAccording to Lin, art should be an act of every individual that is willing to say something that is new and not quite familiar. Lin describes her creative process as having a very important writing and verbal component. She first imagines an artwork verbally to understand its concepts and meanings. She believes that gathering ideas and information is especially vital in architecture, which focuses on humanity and life and requires a well-rounded mind. When a project comes her way, she tries to \"understand the definition (of the site) in a verbal before finding the form to understand what a piece is conceptually and what its nature should be even before visiting the site.\" In her historical memorials, such as the Vietnam Veterans Memorial, the Women’s Table, and the Civil Rights Memorial, Lin tries to focus on the chronological aspect of what she is memorializing. That theme is shown in her art memorializing the changing environment and in charting the depletion of bodies of water.TenBrink, Marisa. \"Maya Lin’s Environmental Installations: Bringing the Outside In,\" 2 Lin also explores themes of juxtaposing materials and a fusion of opposites: \"I feel I exist on the boundaries. Somewhere between science and art, art and architecture, public and private, east and west.... I am always trying to find a balance between these opposing forces, finding the place where opposites meet... existing not on either side but on the line that divides.\"Deitsch, Dina. \"Maya Lin's Perpetual Landscapes and Storm King Wavefield.\" Woman's Art Journal 30, no. 1 (2009): 4.\n\nLin, who now owns and operates Maya Lin Studio in New York City, has designed numerous projects, including the  Civil Rights Memorial in Montgomery, Alabama (1989) and the Wave Field outdoor installation at the University of Michigan (1995).[https://www.pbs.org/art21/artists/lin/card2.html Art:21. Maya Lin's \"Wave Field\" PBS]. Pbs.org. Retrieved on April 25, 2012.\n\nIn 1995, Lin completed Wave Field, at the University of Michigan. Lin was inspired by both diagrams of fluids in motion and photographs of ocean waves. She was intrigued by the idea of capturing and freezing the motion of water, and she wished to capture that movement in the earth, rather than through photography. That was her first experience with earthworks.Deitsch, Dina. \"Maya Lin's Perpetual Landscapes and Storm King Wavefield.\" Woman's Art Journal 30, no. 1 (2009), 6\n\nIn 1999, Lin exhibited Il Cortile Mare (1998) of furniture design, maquettes and photos of works at the American Academy in Rome.R.J. Preece. (1999) [http://www.artdesigncafe.com/Maya-Lin-American-Academy-Rome-1999 \"Maya Lin at American Academy, Rome\"]. World Sculpture News / artdesigncafe. Retrieved December 30, 2011.\n\nIn 2000, Lin re-emerged in the public life with a book, \"Boundaries.\"[http://www.seattlepi.com/visualart/maya.shtml Maya Lin emerges from the shadows] Also in 2000, she agreed to act as the artist and architect for the Confluence Project, a series of outdoor installations at historical points along the Columbia River and Snake River in the states of Washington and Oregon. It is the largest and longest project that she has undertaken so far.\n\nIn 2004, Lin completed an earthwork, Eleven Minute Line, in Sweden that was designed for the [http://www.wanaskonst.se/sv-se/ Wanås Foundation]. Lin draws inspiration from the Serpent Mounds (Native American burial mounds) located in her home state, Ohio. It is meant to be a walkway for the viewers to experience, taking eleven minutes to complete.Deitsch, Dina. \"Maya Lin's Perpetual Landscapes and Storm King Wavefield.\" Woman's Art Journal 30, no. 1 (2009): 6 The earthwork is also inspired by Robert Smithson's Spiral Jetty.\n\nIn 2005, she designed the new plaza that anchors the Claire Trevor School of the Arts at the University of California, Irvine.\n\nIn 2006, Lin completed Waterline, which is composed of aluminum tubing and paint. She describes the piece as a drawing instead of a sculpture. It is a to-scale representation of the Mid-Atlantic ridge, and it is installed so that viewers may walk under the underwater mountain range. There is a purposeful ambiguity to where the actual water line is in relation to the mountain range, to highlight viewers' relationship to the environment and their effect on bodies of water.Min, Susette. \"Entropic Designs: A Review of Maya Lin: Systematic Landscapes and Asian/American/Modern Art: Shifting Currents, 1900-1970 at the De Young Museum.\" American Quarterly 61, no. 1 (2009): 198TenBrink, Marisa. \"Maya Lin’s Environmental Installations: Bringing the Outside In,\" 7.\n\nAlso in 2006, Lin completed her Bodies of Water series, which included representations of three bodies of water,  \"The Black Sea,\" \"The Caspian Sea,\" and  \"The Red Sea.\"  Each sculpture is made of layers of birch plywood, and are to-scale representations of three endangered bodies of water. The sculptures are balanced on the deepest point of the sea. Lin wishes to call attention to the \"unseen ecosystems\" that people continue to pollute.TenBrink, Marisa. \"Maya Lin’s Environmental Installations: Bringing the Outside In.\", 10\n\nLin was commissioned by Ohio University to design what is known as Input in that institution's Bicentennial Park, a landscape designed to resemble a computer punch card. The work relates to Lin's first official connection with the university. The daughter of the late Professor Emerita of English Julia Lin and the late Henry Lin, dean emeritus of the College of Fine Arts, Maya Lin studied computer programming at the university while in high school. The installation is located in a 3.5-acre park. It has 21 rectangles, some raised and some depressed, resembling computer punch cards, a mainstay of early programming courses.[http://www.ohiou.edu/Athens/bldgifs/bicentennial2.jpg photo].\n\nIn 2007, Lin installed Above and Below, an outdoor sculpture at the Indianapolis Museum of Art in Indiana. The artwork is made of aluminum tubing that has been electrolytically colored during a process called anodization.\n\nIn 2008, Lin completed a 30-ton sculpture called 2 x 4 Landscape, made of many pieces of wood, which was exhibited at the M.H. de Young Memorial Museum, in San Francisco.[http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2008/10/24/DD3713HMF1.DTL \"Maya Lin looks at nature – from the inside\"], Sfgate.com (October 24, 2008). Retrieved on April 25, 2012. The sculpture itself is evocative of the swelling movement of water, which is juxtaposed with the dry materiality of the lumber pieces. According to Lin, 2 x 4 Landscape was her attempt to bring the experience of Wavefield (1995) indoors. The 2 x 4 pieces are also meant to be reminiscent of pixels, to evoke the \"virtual or digital space that we are increasingly occupying.\"TenBrink, Marisa. \"Maya Lin’s Environmental Installations: Bringing the Outside In,\" 4.\n\nIn 2008, her projects included an installation, called Wave Field, at the Storm King Art Center in Upstate New York, near the Catskills. It is the center's first earthwork, spanning 4 acres of land, and is a larger version of her original Wave Field (1995) that focuses on the \"fusion of opposites,\"Deitsch, Dina. \"Maya Lin's Perpetual Landscapes and Storm King Wavefield.\" Woman's Art Journal 30, no. 1 (2009), 3 comparing the motion of water to the material of the earth.\n\nIn 2009, Lin completed Silver River, her first work of art in the Las Vegas Strip. It is part of a public fine art collection at MGM Mirage's CityCenter, which opened December 2009. Lin created an 84 ft cast of the Colorado River made entirely of reclaimed silver. With the sculpture, Lin wanted to make a statement about water conservation and the importance of the Colorado River to Nevada in terms of energy and water.  The sculpture is displayed behind the front desk of the Aria Resort and Casino.\n\nIn 2013, Lin completed her largest work to date, A Fold in the Field. It was built from 105,000m cubic meters of earth, covering 3 hectares. It forms part of a private collection within a sculpture park, owned by Alan Gibbs, north of Auckland, New Zealand .http://www.gibbsfarm.org.nz/lin.php\n\nSince around 2010, Lin has been working on what she calls \"her final memorial,\" the [http://whatismissing.net/#/home What Is Missing? Foundation], to commemorate the biodiversity that has been lost in the planet's sixth mass extinction. She aims to raise awareness about the loss of biodiversity and natural habitats by using sound, media, science, and art for temporary installations and a web-based project. What Is Missing? exists not in one specific site but in many forms and in many places simultaneously.\n\nBoth What is Missing and the Vietnam Veterans Memorial were referred to by the White House in its press release that announced Lin as one of the 2016 recipients of the Presidential Medal of Freedom. Nature and the environment have been central concerns for Lin in both her art and architecture: \"As an artist I often work in series, and so for me, I wanted my last memorial to be on a subject that I have personally been concerned with and connected to since I was a child. The last memorial is \"What Is Missing?\" And encompasses multiple platforms, with temporary and permanent physical installations as well as an interactive online component.\" She has expressed her concerns for the goals of the Trump administration: \"I think nature is resilient— if we protect it—and with my background I wanted to lend a voice to the incredible threat we are under from climate change and species and habitat loss.\"\n\nLin is represented by the Pace Gallery in New York City.\n\nRecognition\n\nShe has been awarded honorary doctorate degrees from Yale University, Harvard University, Williams College, and Smith College. In 1987 she was among the youngest to be awarded an honorary Doctorate of Fine Arts by Yale University.\n\nIn 1994, she was the subject of the Academy Award-winning documentary Maya Lin: A Strong Clear Vision. Its title comes from an address she gave at Juniata College in which she spoke of the monument design process in the origin of her work; \"My work originates from a simple desire to make people aware of their surroundings and this can include not just the physical but the psychological world that we live in.\"\n\nIn 2002, Lin was elected Alumni Fellow of the Yale Corporation, the governing body of Yale University (upon whose campus sits another of Lin's designs, the Women's Table, designed to commemorate the role of women at Yale University), in an unusually public contest. Her opponent was W. David Lee, a local New Haven minister and graduate of the Yale Divinity School, who was running on a platform to build ties to the community with the support of Yale's unionized employees. Lin was supported by Yale President Richard Levin and other members of the Yale Corporation, and she was the officially endorsed candidate of the Association of Yale Alumni.\n\nIn 2003, Lin was chosen to serve on the selection jury of the World Trade Center Site Memorial Competition. A trend toward minimalism and abstraction was noted among the entrants and the finalists as well as in the chosen design for the World Trade Center Memorial.\n\nIn 2005, Lin was elected to The American Academy of Arts and Letters, as well as the National Women's Hall of Fame in Seneca Falls, New York.\n\nIn 2009, Lin was awarded the National Medal of Arts by President Barack Obama.[https://web.archive.org/web/20100301095545/http://www.nea.gov/news/news10/Medals.html White House Announces 2009 National Medal of Arts Recipients]. Nea.gov (February 25, 2010). Retrieved on April 25, 2012.\n\nAwards and honors\n\n*1999: Rome Prize\n*2000: Golden Plate Award Academy of Achievement\n*2003: Finn Juhl Prize\n*2005: elected to The American Academy of Arts and Letters\n*2005: elected to National Women's Hall of Fame in Seneca Falls, New York\n*2007: AIA Twenty-five Year Award\n*2009: National Medal of Arts\n*2014: Dorothy and Lillian Gish Prize, a $300,000 art prize.\n*2016: Presidential Medal of Freedom\n\nSelected works\n\n*Vietnam Veterans Memorial (VVM) (1980–82), Washington, D.C.[http://prelectur.stanford.edu/lecturers/lin/ Presidential Lectures: Maya Lin]. Prelectur.stanford.edu (November 5, 1989). Retrieved on April 25, 2012.\n*Aligning Reeds (1985), New Haven, Connecticut\n*Civil Rights Memorial (1988–89), Montgomery, Alabama\n*Open-Air Peace Chapel (1988–89), Juniata College, Huntingdon, Pennsylvania\n*Topo (1989–91), Charlotte Sports Coliseum, Charlotte, North Carolina\n*Eclipsed Time (1989–95), Pennsylvania Station, New York, New York\n*Women's Table (1990–93), Yale University, New Haven, Connecticut\n*Weber House (1991–93), Williamstown, Massachusetts\n*Groundswell (1992–93), Wexner Center for the Arts, Columbus, Ohio\n*Museum for African Art (1992–93), New York, New York.\n*Wave Field (1993–95), FXB Aerospace Engineering Building, Ann Arbor, Michigan\n*10 Degrees North (1993–96), Rockefeller Foundation Headquarters, New York, New York\n*A Shift in the Stream (1995–97), Principal Financial Group Headquarters, Des Moines, Iowa\n*Reading a Garden (1996–98), Cleveland Public Library, Cleveland, Ohio\n*Private Duplex Apartment, New York City (1996–98), New York\n*Topographic Landscape (1997) (Portable sculpture)\n*Phases of the Moon (1998) (Portable sculpture)\n*Avalanche (1998) (Portable sculpture)\n*Langston Hughes Library (1999), Clinton, Tennessee\n*Timetable (2000), Stanford University, Stanford, California\n*The character of a hill, under glass (2000–01), American Express Client Services Center, Minneapolis, Minnesota\n*Ecliptic (2001), Grand Rapids, Michigan\n*Input (2004), Bicentennial Park, Athens, Ohio\n*Riggio-Lynch Chapel (2004), Clinton, Tennessee\n*Arts Plaza, Claire Trevor School of the Arts (2005), Irvine, California\n*Confluence Project: Cape Disappointment State Park (2006)\n*Confluence Project: Vancouver Land Bridge (2008)\n*Confluence Project: Sandy River Delta (2008)\n*Confluence Project: Sacajawea State Park (2010)\n*Ellen S. Clark Hope Plaza, Washington University in St. Louis (2010) \n*Confluence Project: Chief Timothy Park (2011)\n*A Fold in the Field (2013), The Gibbs Farm, Kaipara Harbour, New Zealand\n*\"[http://whatismissing.net/ What is Missing?] (2009–present), (Various locations, web project)\n*Under the Laurentide, Brown University (2015)\n*Folding the Chesapeake (part of Wonder exhibit): Renwick Gallery, Washington, DC (2015)\n\nSources\n\n*Maya Lin: Topologies (Artist and the community) (1998) \n*Maya Lin: [American Academy in Rome, 10 dicembre 1998-21 febbraio 1999] (1998) \n*Timetable: Maya Lin (2000) ASIN B000PT331Y (2002, )\n*Boundaries (2000)  (2006, )",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Maya Lin" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19166" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Maya Ying Lin (born October 5, 1959) is an American designer and artist who is known for her work in sculpture and land art. She achieved national recognition at the age of 21 while still an undergraduate at Yale University when her design was chosen in a national competition for the Vietnam Veterans Memorial in Washington, D.C. It is considered one of the most influential memorials of the post-World War II period.\n\nLin has completed designs for other memorials, as well as for numerous public and private buildings, landscape design, and sculpture. Although Lin’s most well known sculptures and architectural work are historical memorials, she also works to memorialize nature through her environmentally themed works. In creating works which deal with the depleting environment, Lin aims to raise awareness for the environment for audiences in urban spaces.\n\nEarly life and education\n\nMaya Lin was born in Athens, Ohio. Her parents had migrated to the United States from \nChina, her father in 1948 and her mother in 1949, and settled in Ohio before Maya was born.Finding Your Roots, February 2, 2016, PBS Her father, Henry Huan Lin, born in Fuzhou, Fujian, was a ceramist and former dean of the Ohio University College of Fine Arts. Her mother, Julia Chang Lin, born in Shanghai, is a poet and taught literature at Ohio University. She is the niece of Lin Huiyin, who is an American-educated artist, poet and said to be the first female architect in modern China. Lin Juemin and Lin Yin Ming, both of whom are among the 72 martyrs of the Second Guangzhou Uprising, were cousins of her grandfather. Lin Chang-min, a Hanlin of Qing dynasty and the emperor's teacher, was the father of Lin Hui-yin and great-grandfather of Maya Lin.\n\nLin graduated from Yale University, where she received a Bachelor of Arts degree in 1981 and a Master of Architecture degree in 1986.\n\nLin is married to Daniel Wolf, a New York photography dealer. They have two daughters, India and Rachel.\n\nLin is one of the youngest of the Baby Boom generation (https://www.saeculumresearch.com/knowledge-center/generations-and-turnings/the-generational-constellation) and has an older brother, the poet Tan Lin. Growing up, she did not have many friends and stayed home a lot. She loved school and loved to study. When she was not studying, she took independent courses from Ohio University and spent her free time casting bronzes in the school foundry.[http://www.achievement.org/achiever/maya-lin/#interview Maya Lin Interview – Academy of Achievement]. Achievement.org. Retrieved on April 25, 2012. Lin, having grown up as an Asian minority, has said that she \"didn't even realize\" she was Chinese until later in life. It was not until her 30s that she had a desire to understand her cultural background.  Commenting on her design of a new building for the Museum of Chinese in America near New York City's Chinatown, Lin attached a personal significance to the project being a Chinese-related project. She wants her two daughters to \"know that part of their heritage\".\n\nEnvironmental concerns  \n\nLin has stated that environmental issues have concerned her since she was very young, and she dedicated much of her time at Yale University to environmental activism.Munro, Eleanor C. Originals: American women artists. Boulder, CO: Da Capo Press, 2000.\n Much of her later work, after her work on memorials, focuses on the relationship that people have with their environment, which she displays in earthworks, sculptures, and installations. Lin's work centers on the concept of uncovering \"hidden histories\" to bring attention to landscapes and environments that may otherwise be inaccessible to viewers and \"deploys the concept to discuss the inextricable relationship between nature and the built environment.\"Min, Susette. \"Entropic Designs: A Review of Maya Lin: Systematic Landscapes and Asian/American/Modern Art: Shifting Currents, 1900-1970 at the De Young Museum.\" American Quarterly 61, no. 1 (2009): 193-215. Lin's focus on this relationship highlights the impact humanity has on the environment, and draws attention to her concerns such as global warming, endangered bodies of water, and animal extinction/endangerment. These issues are explored in what Lin calls her latest memorial, [http://whatismissing.net/ What Is Missing?].\n\nLin also sits on the Natural Resources Defense Council [https://www.nrdc.org/board-trustees board of trustees]. She constructs her works to have a minimal effect on the environment, utilizing recycled and sustainable materials, minimizes carbon emissions, and avoids damage to the landscapes/ecosystems she works upon.Mendelsohn, Meredith. \"Maya Lin.\" Art + Auction 33, no. 4 (December 2009): 40-90. Art & Architecture Source, EBSCOhost (accessed April 14, 2017).\n\nVietnam Veterans Memorial\n\nIn 1981, at 21 and still an undergraduate, Lin won a public design competition for the Vietnam Veterans Memorial, beating 1,441 other competition submissions. The black cut-stone masonry wall, with the names of 57,661 fallen soldiers carved into its face, was completed in late October 1982 and dedicated the next month, on November 1982. The wall is granite and V-shaped, with one side pointing to the Lincoln Memorial and the other to the Washington Monument.\n\nLin's conception was to create an opening or a wound in the earth to symbolize the gravity of the loss of the soldiers. The design was initially very controversial for several reasons. It was an unconventional and non-traditional design for a war memorial.[http://www.npr.org/2015/04/30/403034599/vietnam-veterans-memorial-founder-monument-almost-never-got-built Vietnam Veterans' Memorial Founder: Monument Almost Never Got Built] Also controversial were Lin's Asian ethnicity, and her lack of professional experience. The memorial has since become an important pilgrimage site for relatives and friends of the American military casualties in Vietnam, and personal tokens and mementos are left at the wall daily in the casualties' memory.[https://web.archive.org/web/20020203074950/http://www.gale.com/free_resources/whm/bio/lin_m.htm Free Resources – Women's History – Biographies – Maya Lin]. Gale (March 12, 2002). Retrieved on April 25, 2012.[http://www.greatbuildings.com/architects/Maya_Lin.html Maya Lin – Great Buildings Online]. Greatbuildings.com. Retrieved on April 25, 2012. In 2007, the American Institute of Architects ranked the memorial #10 on their list of America's Favorite Architecture.\"\n\nLin believes that if the competition had not been \"blind,\" with designs submitted by name instead of number, she \"never would have won.\" She received harassment after her ethnicity was revealed. Prominent businessman and later third party presidential candidate Ross Perot called her an \"egg roll\" after it was revealed that she was Asian. Lin defended her design in front of the US Congress, and eventually, a compromise was reached. The Three Soldiers, a bronze statue of a group of soldiers and an American flag, was placed off to one side of her design.\n\nHowever, the artist's architectural design was controversial due to particular aspects, such as the exclusion of the surviving veterans' names as well as the dark complexion of the marble. Many argue that the memorial only honors the soldiers who lost their lives during the Vietnam War, and others believe that the color of the marble resembles disgust and sadness towards this specific war. Yet, a 50-foot-high flagpole and an 8-foot-high statue of three soldiers were added to the Vietnam Veterans Memorial to appease any external pressures.\n\nLater work\n\nMaya Lin calls herself a \"designer,\" rather than an \"architect.\"In a 2008 interview, she said, \"I'm not licensed as an architect, so I technically cannot label myself as an architect, although I would say that we pretty much produce with architects of record supervising. I love architecture and I love building architecture, but technically, legally, I'm not licensed, so I’m a designer.\" Her vision and her focus are always on how space needs to be in the future and what it means to people. She has tried to focus less on how politics influences design and more on what emotions the space would create and what it would symbolize to the user. Her belief in a space being connected and the transition from inside to outside being fluid, coupled with what a space means, has led her to create some very memorable designs. She has also worked on sculptures and landscape installations. In doing so, Lin focuses on memorializing concepts of time periods instead of direct representations of figures, creating an abstract sculptures and installations.\n\nAccording to Lin, art should be an act of every individual that is willing to say something that is new and not quite familiar. Lin describes her creative process as having a very important writing and verbal component. She first imagines an artwork verbally to understand its concepts and meanings. She believes that gathering ideas and information is especially vital in architecture, which focuses on humanity and life and requires a well-rounded mind. When a project comes her way, she tries to \"understand the definition (of the site) in a verbal before finding the form to understand what a piece is conceptually and what its nature should be even before visiting the site.\" In her historical memorials, such as the Vietnam Veterans Memorial, the Women’s Table, and the Civil Rights Memorial, Lin tries to focus on the chronological aspect of what she is memorializing. That theme is shown in her art memorializing the changing environment and in charting the depletion of bodies of water.TenBrink, Marisa. \"Maya Lin’s Environmental Installations: Bringing the Outside In,\" 2 Lin also explores themes of juxtaposing materials and a fusion of opposites: \"I feel I exist on the boundaries. Somewhere between science and art, art and architecture, public and private, east and west.... I am always trying to find a balance between these opposing forces, finding the place where opposites meet... existing not on either side but on the line that divides.\"Deitsch, Dina. \"Maya Lin's Perpetual Landscapes and Storm King Wavefield.\" Woman's Art Journal 30, no. 1 (2009): 4.\n\nLin, who now owns and operates Maya Lin Studio in New York City, has designed numerous projects, including the  Civil Rights Memorial in Montgomery, Alabama (1989) and the Wave Field outdoor installation at the University of Michigan (1995).[https://www.pbs.org/art21/artists/lin/card2.html Art:21. Maya Lin's \"Wave Field\" PBS]. Pbs.org. Retrieved on April 25, 2012.\n\nIn 1995, Lin completed Wave Field, at the University of Michigan. Lin was inspired by both diagrams of fluids in motion and photographs of ocean waves. She was intrigued by the idea of capturing and freezing the motion of water, and she wished to capture that movement in the earth, rather than through photography. That was her first experience with earthworks.Deitsch, Dina. \"Maya Lin's Perpetual Landscapes and Storm King Wavefield.\" Woman's Art Journal 30, no. 1 (2009), 6\n\nIn 1999, Lin exhibited Il Cortile Mare (1998) of furniture design, maquettes and photos of works at the American Academy in Rome.R.J. Preece. (1999) [http://www.artdesigncafe.com/Maya-Lin-American-Academy-Rome-1999 \"Maya Lin at American Academy, Rome\"]. World Sculpture News / artdesigncafe. Retrieved December 30, 2011.\n\nIn 2000, Lin re-emerged in the public life with a book, \"Boundaries.\"[http://www.seattlepi.com/visualart/maya.shtml Maya Lin emerges from the shadows] Also in 2000, she agreed to act as the artist and architect for the Confluence Project, a series of outdoor installations at historical points along the Columbia River and Snake River in the states of Washington and Oregon. It is the largest and longest project that she has undertaken so far.\n\nIn 2004, Lin completed an earthwork, Eleven Minute Line, in Sweden that was designed for the [http://www.wanaskonst.se/sv-se/ Wanås Foundation]. Lin draws inspiration from the Serpent Mounds (Native American burial mounds) located in her home state, Ohio. It is meant to be a walkway for the viewers to experience, taking eleven minutes to complete.Deitsch, Dina. \"Maya Lin's Perpetual Landscapes and Storm King Wavefield.\" Woman's Art Journal 30, no. 1 (2009): 6 The earthwork is also inspired by Robert Smithson's Spiral Jetty.\n\nIn 2005, she designed the new plaza that anchors the Claire Trevor School of the Arts at the University of California, Irvine.\n\nIn 2006, Lin completed Waterline, which is composed of aluminum tubing and paint. She describes the piece as a drawing instead of a sculpture. It is a to-scale representation of the Mid-Atlantic ridge, and it is installed so that viewers may walk under the underwater mountain range. There is a purposeful ambiguity to where the actual water line is in relation to the mountain range, to highlight viewers' relationship to the environment and their effect on bodies of water.Min, Susette. \"Entropic Designs: A Review of Maya Lin: Systematic Landscapes and Asian/American/Modern Art: Shifting Currents, 1900-1970 at the De Young Museum.\" American Quarterly 61, no. 1 (2009): 198TenBrink, Marisa. \"Maya Lin’s Environmental Installations: Bringing the Outside In,\" 7.\n\nAlso in 2006, Lin completed her Bodies of Water series, which included representations of three bodies of water,  \"The Black Sea,\" \"The Caspian Sea,\" and  \"The Red Sea.\"  Each sculpture is made of layers of birch plywood, and are to-scale representations of three endangered bodies of water. The sculptures are balanced on the deepest point of the sea. Lin wishes to call attention to the \"unseen ecosystems\" that people continue to pollute.TenBrink, Marisa. \"Maya Lin’s Environmental Installations: Bringing the Outside In.\", 10\n\nLin was commissioned by Ohio University to design what is known as Input in that institution's Bicentennial Park, a landscape designed to resemble a computer punch card. The work relates to Lin's first official connection with the university. The daughter of the late Professor Emerita of English Julia Lin and the late Henry Lin, dean emeritus of the College of Fine Arts, Maya Lin studied computer programming at the university while in high school. The installation is located in a 3.5-acre park. It has 21 rectangles, some raised and some depressed, resembling computer punch cards, a mainstay of early programming courses.[http://www.ohiou.edu/Athens/bldgifs/bicentennial2.jpg photo].\n\nIn 2007, Lin installed Above and Below, an outdoor sculpture at the Indianapolis Museum of Art in Indiana. The artwork is made of aluminum tubing that has been electrolytically colored during a process called anodization.\n\nIn 2008, Lin completed a 30-ton sculpture called 2 x 4 Landscape, made of many pieces of wood, which was exhibited at the M.H. de Young Memorial Museum, in San Francisco.[http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2008/10/24/DD3713HMF1.DTL \"Maya Lin looks at nature – from the inside\"], Sfgate.com (October 24, 2008). Retrieved on April 25, 2012. The sculpture itself is evocative of the swelling movement of water, which is juxtaposed with the dry materiality of the lumber pieces. According to Lin, 2 x 4 Landscape was her attempt to bring the experience of Wavefield (1995) indoors. The 2 x 4 pieces are also meant to be reminiscent of pixels, to evoke the \"virtual or digital space that we are increasingly occupying.\"TenBrink, Marisa. \"Maya Lin’s Environmental Installations: Bringing the Outside In,\" 4.\n\nIn 2008, her projects included an installation, called Wave Field, at the Storm King Art Center in Upstate New York, near the Catskills. It is the center's first earthwork, spanning 4 acres of land, and is a larger version of her original Wave Field (1995) that focuses on the \"fusion of opposites,\"Deitsch, Dina. \"Maya Lin's Perpetual Landscapes and Storm King Wavefield.\" Woman's Art Journal 30, no. 1 (2009), 3 comparing the motion of water to the material of the earth.\n\nIn 2009, Lin completed Silver River, her first work of art in the Las Vegas Strip. It is part of a public fine art collection at MGM Mirage's CityCenter, which opened December 2009. Lin created an 84 ft cast of the Colorado River made entirely of reclaimed silver. With the sculpture, Lin wanted to make a statement about water conservation and the importance of the Colorado River to Nevada in terms of energy and water.  The sculpture is displayed behind the front desk of the Aria Resort and Casino.\n\nIn 2013, Lin completed her largest work to date, A Fold in the Field. It was built from 105,000m cubic meters of earth, covering 3 hectares. It forms part of a private collection within a sculpture park, owned by Alan Gibbs, north of Auckland, New Zealand .http://www.gibbsfarm.org.nz/lin.php\n\nSince around 2010, Lin has been working on what she calls \"her final memorial,\" the [http://whatismissing.net/#/home What Is Missing? Foundation], to commemorate the biodiversity that has been lost in the planet's sixth mass extinction. She aims to raise awareness about the loss of biodiversity and natural habitats by using sound, media, science, and art for temporary installations and a web-based project. What Is Missing? exists not in one specific site but in many forms and in many places simultaneously.\n\nBoth What is Missing and the Vietnam Veterans Memorial were referred to by the White House in its press release that announced Lin as one of the 2016 recipients of the Presidential Medal of Freedom. Nature and the environment have been central concerns for Lin in both her art and architecture: \"As an artist I often work in series, and so for me, I wanted my last memorial to be on a subject that I have personally been concerned with and connected to since I was a child. The last memorial is \"What Is Missing?\" And encompasses multiple platforms, with temporary and permanent physical installations as well as an interactive online component.\" She has expressed her concerns for the goals of the Trump administration: \"I think nature is resilient— if we protect it—and with my background I wanted to lend a voice to the incredible threat we are under from climate change and species and habitat loss.\"\n\nLin is represented by the Pace Gallery in New York City.\n\nRecognition\n\nShe has been awarded honorary doctorate degrees from Yale University, Harvard University, Williams College, and Smith College. In 1987 she was among the youngest to be awarded an honorary Doctorate of Fine Arts by Yale University.\n\nIn 1994, she was the subject of the Academy Award-winning documentary Maya Lin: A Strong Clear Vision. Its title comes from an address she gave at Juniata College in which she spoke of the monument design process in the origin of her work; \"My work originates from a simple desire to make people aware of their surroundings and this can include not just the physical but the psychological world that we live in.\"\n\nIn 2002, Lin was elected Alumni Fellow of the Yale Corporation, the governing body of Yale University (upon whose campus sits another of Lin's designs, the Women's Table, designed to commemorate the role of women at Yale University), in an unusually public contest. Her opponent was W. David Lee, a local New Haven minister and graduate of the Yale Divinity School, who was running on a platform to build ties to the community with the support of Yale's unionized employees. Lin was supported by Yale President Richard Levin and other members of the Yale Corporation, and she was the officially endorsed candidate of the Association of Yale Alumni.\n\nIn 2003, Lin was chosen to serve on the selection jury of the World Trade Center Site Memorial Competition. A trend toward minimalism and abstraction was noted among the entrants and the finalists as well as in the chosen design for the World Trade Center Memorial.\n\nIn 2005, Lin was elected to The American Academy of Arts and Letters, as well as the National Women's Hall of Fame in Seneca Falls, New York.\n\nIn 2009, Lin was awarded the National Medal of Arts by President Barack Obama.[https://web.archive.org/web/20100301095545/http://www.nea.gov/news/news10/Medals.html White House Announces 2009 National Medal of Arts Recipients]. Nea.gov (February 25, 2010). Retrieved on April 25, 2012.\n\nAwards and honors\n\n*1999: Rome Prize\n*2000: Golden Plate Award Academy of Achievement\n*2003: Finn Juhl Prize\n*2005: elected to The American Academy of Arts and Letters\n*2005: elected to National Women's Hall of Fame in Seneca Falls, New York\n*2007: AIA Twenty-five Year Award\n*2009: National Medal of Arts\n*2014: Dorothy and Lillian Gish Prize, a $300,000 art prize.\n*2016: Presidential Medal of Freedom\n\nSelected works\n\n*Vietnam Veterans Memorial (VVM) (1980–82), Washington, D.C.[http://prelectur.stanford.edu/lecturers/lin/ Presidential Lectures: Maya Lin]. Prelectur.stanford.edu (November 5, 1989). Retrieved on April 25, 2012.\n*Aligning Reeds (1985), New Haven, Connecticut\n*Civil Rights Memorial (1988–89), Montgomery, Alabama\n*Open-Air Peace Chapel (1988–89), Juniata College, Huntingdon, Pennsylvania\n*Topo (1989–91), Charlotte Sports Coliseum, Charlotte, North Carolina\n*Eclipsed Time (1989–95), Pennsylvania Station, New York, New York\n*Women's Table (1990–93), Yale University, New Haven, Connecticut\n*Weber House (1991–93), Williamstown, Massachusetts\n*Groundswell (1992–93), Wexner Center for the Arts, Columbus, Ohio\n*Museum for African Art (1992–93), New York, New York.\n*Wave Field (1993–95), FXB Aerospace Engineering Building, Ann Arbor, Michigan\n*10 Degrees North (1993–96), Rockefeller Foundation Headquarters, New York, New York\n*A Shift in the Stream (1995–97), Principal Financial Group Headquarters, Des Moines, Iowa\n*Reading a Garden (1996–98), Cleveland Public Library, Cleveland, Ohio\n*Private Duplex Apartment, New York City (1996–98), New York\n*Topographic Landscape (1997) (Portable sculpture)\n*Phases of the Moon (1998) (Portable sculpture)\n*Avalanche (1998) (Portable sculpture)\n*Langston Hughes Library (1999), Clinton, Tennessee\n*Timetable (2000), Stanford University, Stanford, California\n*The character of a hill, under glass (2000–01), American Express Client Services Center, Minneapolis, Minnesota\n*Ecliptic (2001), Grand Rapids, Michigan\n*Input (2004), Bicentennial Park, Athens, Ohio\n*Riggio-Lynch Chapel (2004), Clinton, Tennessee\n*Arts Plaza, Claire Trevor School of the Arts (2005), Irvine, California\n*Confluence Project: Cape Disappointment State Park (2006)\n*Confluence Project: Vancouver Land Bridge (2008)\n*Confluence Project: Sandy River Delta (2008)\n*Confluence Project: Sacajawea State Park (2010)\n*Ellen S. Clark Hope Plaza, Washington University in St. Louis (2010) \n*Confluence Project: Chief Timothy Park (2011)\n*A Fold in the Field (2013), The Gibbs Farm, Kaipara Harbour, New Zealand\n*\"[http://whatismissing.net/ What is Missing?] (2009–present), (Various locations, web project)\n*Under the Laurentide, Brown University (2015)\n*Folding the Chesapeake (part of Wonder exhibit): Renwick Gallery, Washington, DC (2015)\n\nSources\n\n*Maya Lin: Topologies (Artist and the community) (1998) \n*Maya Lin: [American Academy in Rome, 10 dicembre 1998-21 febbraio 1999] (1998) \n*Timetable: Maya Lin (2000) ASIN B000PT331Y (2002, )\n*Boundaries (2000)  (2006, ). Maya Lin. http://en.wikipedia.org/?curid=19166."
  }
}
