{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20193",
  "eid" : "409f5400-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778617664,
  "textBody" : "Mecklenburg (, locally, Low German: Mękel(n)borg) is a historical region in northern Germany comprising the western and larger part of the federal-state Mecklenburg-Vorpommern. The largest cities of the region are Rostock, Schwerin,  Neubrandenburg, Wismar and Güstrow.\n\nThe name Mecklenburg derives from a castle named \"Mikilenburg\" (Old Saxon: \"big castle\", hence the scientific translation used in New Latin Megalopolis), located between the cities of Schwerin and Wismar. In Slavic language it was known as Veligrad which also means \"big castle\". It was the ancestral seat of the House of Mecklenburg and for a time divided into Mecklenburg-Schwerin and Mecklenburg-Strelitz among the same dynasty.\n\nLinguistically Mecklenburgers retain and use many features of Low German vocabulary or phonology.\n\nThe adjective for the region is Mecklenburgian (), inhabitants are called Mecklenburgians ().\n\nGeography \n\nMecklenburg is known for its mostly flat countryside. Much of the terrain forms a morass, with ponds, marshes and fields as common features, with small forests interspersed.  The terrain changes as one moves north towards the Baltic Sea.\n\nUnder the peat of Mecklenburg are sometimes found deposits of ancient lava flows.  Traditionally, at least in the countryside, the stone from these flows is cut and used in the construction of homes, often in joint use with cement, brick and wood, forming a unique look to the exterior of country houses.\n\nMecklenburg has productive farming, but the land is most suitable for grazing purposes.\n\nList of urban centers in Mecklenburg \n\nHistory\n\nEarly history\n\nMecklenburg is the site of many prehistoric dolmen tombs.  Its earliest organised inhabitants may have had Celtic origins.  By no later than 100 BC the area had been populated by pre-Christian Germanic peoples.\n\nThe traditional symbol of Mecklenburg, the grinning steer's head (Low German: Ossenkopp, lit.: 'oxen's head', with osse being a synonym for steer and bull in Middle Low German), with an attached hide, and a crown above, may have originated from this period. It represents what early peoples would have worn, i.e. a steers's head as a hat, with the hide hanging down the back to protect the neck from the sun, and overall as a way to instill fear in the enemy.\n\nFrom the 7th through the 12th centuries, the area of Mecklenburg was taken over by Western Slavic peoples, most notably the Obotrites and other tribes that Frankish sources referred to as \"Wends\". The 11th century founder of the Mecklenburgian dynasty of Dukes and later Grand Dukes, which lasted until 1918, was Nyklot of the Obotrites.\n\nIn the late 12th century, Henry the Lion, Duke of the Saxons, conquered the region, subjugated its local lords, and Christianized its people, in a precursor to the Northern Crusades.  From 12th to 14th century, large numbers of Germans and Flemings settled the area (Ostsiedlung), importing German law and improved agricultural techniques. The Wends who survived all warfare and devastation of the centuries before, including invasions of and expeditions into Saxony, Denmark and Liutizic areas as well as internal conflicts, were assimilated in the centuries thereafter.  However, elements of certain names and words used in Mecklenburg speak to the lingering Slavic influence.  An example would be the city of Schwerin, which was originally called Zuarin in Slavic.  Another example is the town of Bresegard, the 'gard' portion of the town name deriving from the Slavic word 'grad', meaning city or town.\n\nSince the 12th century, the territory remained stable and relatively independent of its neighbours; one of the few German territories for which this is true. During the reformation the Duke in Schwerin would convert to Protestantism and so would follow the Duchy of Mecklenburg.\n\nHistory, 1621–1933\n\nLike many German territories, Mecklenburg was sometimes partitioned and re-partitioned among different members of the ruling dynasty. In 1621 it was divided into the two duchies of Mecklenburg-Schwerin and Mecklenburg-Güstrow. With the extinction of the Güstrow line in 1701, the Güstrow lands were redivided, part going to the Duke of Mecklenburg-Schwerin, and part going to the new line of Mecklenburg-Strelitz.\n\nIn 1815, the two Mecklenburgian duchies were raised to Grand Duchies, the Grand Duchy of Mecklenburg-Schwerin and the Grand Duchy of Mecklenburg-Strelitz, and subsequently existed separately as such in Germany under enlightened but absolute rule (constitutions being granted on the eve of World War I) until the revolution of 1918.  Life in Mecklenburg could be quite harsh.  Practices such as having to ask for permission from the Grand Duke to get married, or having to apply for permission to emigrate, would linger late into the history of Mecklenburg (i.e. 1918), long after such practices had been abandoned in other German areas.  Even as late as the later half of the 19th century the Grand Duke personally owned half of the countryside.  The last Duke abdicated in 1918, as monarchies fell throughout Europe.  The Duke's ruling house reigned in Mecklenburg uninterrupted (except for two years) from its incorporation into the Holy Roman Empire until 1918.  From 1918 to 1933, the duchies were free states in the Weimar Republic.\n\nTraditionally Mecklenburg has always been one of the poorer German areas, and later the poorer of the provinces, or Länder, within a unified Germany.  The reasons for this may be varied, but one factor stands out: agriculturally the land is poor and can not produce at the same level as other parts of Germany.  The two Mecklenburgs made attempts at being independent states after 1918, but eventually this failed as their dependence on the rest of the German lands became apparent.\n\nHistory since 1934\n\nAfter three centuries of partition, Mecklenburg was united in 1934 by the Nazi government. The Wehrmacht assigned Mecklenburg and Pomerania to Wehrkreis II under the command of General der Infanterie Werner Kienitz, with the headquarters at Stettin. Mecklenburg was assigned to an Area headquartered at Schwerin, which was responsible for military units in Schwerin; Rostock; Parchim; and Neustrelitz.\n\nAfter World War II, the Soviet government occupying eastern Germany merged Mecklenburg with the smaller neighbouring region of Western Pomerania (German Vorpommern) to form the state of Mecklenburg-Vorpommern. Mecklenburg contributed about two-thirds of the geographical size of the new state and the majority of its population. Also, the new state became temporary or permanent home for lots of refugees expelled from former German territories seized by the Soviet Union and Poland after the war. The Soviets changed the name from \"Mecklenburg-Western Pomerania\" to \"Mecklenburg\" in 1947.\n\nIn 1952, the East German government ended the independent existence of Mecklenburg, creating 3 districts (\"Bezirke\") out of its territory: Rostock, Schwerin and Neubrandenburg.\n\nDuring German reunification in 1990, the state of Mecklenburg-Vorpommern was revived, and is now one of the 16 states of the Federal Republic of Germany.\n\nCoat of arms of the duchies of Mecklenburg \n\nThe House of Mecklenburg was founded by Niklot, prince of the Obotrites, Chizzini and Circipani on the Baltic Sea, who died in 1160. His Christian progeny was recognized as prince of the Holy Roman Empire 1170 and Duke of Mecklenburg 8 July 1348. On 27 February 1658 the ducal house divided in two branches: Mecklenburg-Schwerin and Mecklenburg-Strelitz.\n\nThe flag of both Mecklenburg duchies is traditionally made of the colours blue, yellow and red. The sequence however changed more than once in the past 300 years. In 1813 the duchies used yellow-red-blue. 23 December 1863 for Schwerin and 4 January 1864 for Strelitz blue-yellow-red was ordered.(Ströhl, Deutsche Wappenrolle, Stuttgart, 1897, p. 89) Mecklenburg-Schwerin however used white instead of yellow for flags on sea by law of 24 March 1855.(Ströhl, 86)\n\nSiebmachers Wappenbuch gives therefore (?) blue-white-red for Schwerin and blue-yellow-red for Strelitz.Siebmachers Wappenbuch (Nurenberg, 1878)\nAccording to this source, the grand ducal house of Schwerin used a flag of 3.75 to 5.625 M with the middle arms on a white quadrant (1.75 M) in the middle.\n\nThe middle arms show the shield of Mecklenburg as arranged in the 17th century. The county of Schwerin in the middle and in the quartering Mecklenburg (bull's head with hide), Rostock (griffin), principality of Schwerin (griffin surmounting green rectangle), Ratzeburg (cross surmounted by crown), Stargard (arm with hand holding ring) and Wenden  (bull's head). The shield is supported by a bull and a griffin and surmounted by a royal crown.\n\nThe dukes of Strelitz used according to Siebmachers the blue-yellow-red flag with just the (oval) shield of Mecklenburg in the yellow band.\n\nStröhl in 1897 and Bulgaria,Berühmte Fahnen Deutscher Geschichte (Dresden, 1922) show another arrangement: The grand-duke of Mecklenburg-Schwerin flows a flag (4:5) with the arms of the figures from the shield of arms.\n\nThe former Schwerin standard with the white quadrant is now ascribed to the grand dukes of Strelitz.\nStröhl mentions a flag for the grand ducal house by law of 23 December 1863 with the middle arms in the yellow band. And he mentions a special sea flag, the same but with a white middle band. \n'Berühmte Fahnen' shows furthermore a standard for grand duchess Alexandra of Mecklenburg-Schwerin, princess of Hannover (1882–1963), showing her shield and that of Mecklenburg joined by the order of the Wendic Crown in a white oval. On sea the yellow band in her flag was of course white. \nThe princes (dukes) of Mecklenburg-Schwerin had according to this source their own standard, showing the griffin of Rostock.\n\nEconomy \n\nTourism \n\nMecklenburg faces a huge increase in tourism since German reunification in 1990, particularly with its beaches and seaside resorts at the Baltic Sea (\"German Riviera\", Warnemünde, Boltenhagen, Heiligendamm, Kühlungsborn, Rerik and others), the Mecklenburg Lakeland (Mecklenburgische Seenplatte) and the Mecklenburg Switzerland (Mecklenburgische Schweiz) with their pristine nature, the old Hanseatic towns of Rostock, Greifswald, Stralsund and Wismar (the latter two being World Heritage) well known for their medieval Brick Gothic buildings, and the former royal residences of Schwerin, Güstrow, Ludwigslust and Neustrelitz.\n\nNotable Mecklenburgers\n\n* Gebhard Leberecht von Blücher, Prussian army leader\n* Jan Ullrich, cyclist\n* Gottlob Frege, logician\n* Siegfried Marcus, automobile pioneer\n* Heinrich Schliemann,  classical archaeologist\n* Johannes Gillhoff, teacher, author of book on Mecklenburg emigrants to the US\n* Fritz Reuter, poet and novelist\n* Ludwig Jacoby, (1813–1874), born in Altstrelitz, an author and Methodist clergyman, commissioned as a missionary to St. Louis, Missouri, by the founder of the German Methodist Church in America, William Nast (1807–1899).  Jacoby founded the first Methodist Church West of the Mississippi River, originally known as Bethel Church, now known as Memorial United Methodist Church, in St. Louis in 1841.\n* Charlotte of Mecklenburg-Strelitz, (1744–1818), wife of George III of the United Kingdom and grandmother of Queen Victoria. Charlotte, North Carolina, USA and the county in which it lies were named in her honour, as was Charlottesville, Virginia, US.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mecklenburg" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20193" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Mecklenburg (, locally, Low German: Mękel(n)borg) is a historical region in northern Germany comprising the western and larger part of the federal-state Mecklenburg-Vorpommern. The largest cities of the region are Rostock, Schwerin,  Neubrandenburg, Wismar and Güstrow.\n\nThe name Mecklenburg derives from a castle named \"Mikilenburg\" (Old Saxon: \"big castle\", hence the scientific translation used in New Latin Megalopolis), located between the cities of Schwerin and Wismar. In Slavic language it was known as Veligrad which also means \"big castle\". It was the ancestral seat of the House of Mecklenburg and for a time divided into Mecklenburg-Schwerin and Mecklenburg-Strelitz among the same dynasty.\n\nLinguistically Mecklenburgers retain and use many features of Low German vocabulary or phonology.\n\nThe adjective for the region is Mecklenburgian (), inhabitants are called Mecklenburgians ().\n\nGeography \n\nMecklenburg is known for its mostly flat countryside. Much of the terrain forms a morass, with ponds, marshes and fields as common features, with small forests interspersed.  The terrain changes as one moves north towards the Baltic Sea.\n\nUnder the peat of Mecklenburg are sometimes found deposits of ancient lava flows.  Traditionally, at least in the countryside, the stone from these flows is cut and used in the construction of homes, often in joint use with cement, brick and wood, forming a unique look to the exterior of country houses.\n\nMecklenburg has productive farming, but the land is most suitable for grazing purposes.\n\nList of urban centers in Mecklenburg \n\nHistory\n\nEarly history\n\nMecklenburg is the site of many prehistoric dolmen tombs.  Its earliest organised inhabitants may have had Celtic origins.  By no later than 100 BC the area had been populated by pre-Christian Germanic peoples.\n\nThe traditional symbol of Mecklenburg, the grinning steer's head (Low German: Ossenkopp, lit.: 'oxen's head', with osse being a synonym for steer and bull in Middle Low German), with an attached hide, and a crown above, may have originated from this period. It represents what early peoples would have worn, i.e. a steers's head as a hat, with the hide hanging down the back to protect the neck from the sun, and overall as a way to instill fear in the enemy.\n\nFrom the 7th through the 12th centuries, the area of Mecklenburg was taken over by Western Slavic peoples, most notably the Obotrites and other tribes that Frankish sources referred to as \"Wends\". The 11th century founder of the Mecklenburgian dynasty of Dukes and later Grand Dukes, which lasted until 1918, was Nyklot of the Obotrites.\n\nIn the late 12th century, Henry the Lion, Duke of the Saxons, conquered the region, subjugated its local lords, and Christianized its people, in a precursor to the Northern Crusades.  From 12th to 14th century, large numbers of Germans and Flemings settled the area (Ostsiedlung), importing German law and improved agricultural techniques. The Wends who survived all warfare and devastation of the centuries before, including invasions of and expeditions into Saxony, Denmark and Liutizic areas as well as internal conflicts, were assimilated in the centuries thereafter.  However, elements of certain names and words used in Mecklenburg speak to the lingering Slavic influence.  An example would be the city of Schwerin, which was originally called Zuarin in Slavic.  Another example is the town of Bresegard, the 'gard' portion of the town name deriving from the Slavic word 'grad', meaning city or town.\n\nSince the 12th century, the territory remained stable and relatively independent of its neighbours; one of the few German territories for which this is true. During the reformation the Duke in Schwerin would convert to Protestantism and so would follow the Duchy of Mecklenburg.\n\nHistory, 1621–1933\n\nLike many German territories, Mecklenburg was sometimes partitioned and re-partitioned among different members of the ruling dynasty. In 1621 it was divided into the two duchies of Mecklenburg-Schwerin and Mecklenburg-Güstrow. With the extinction of the Güstrow line in 1701, the Güstrow lands were redivided, part going to the Duke of Mecklenburg-Schwerin, and part going to the new line of Mecklenburg-Strelitz.\n\nIn 1815, the two Mecklenburgian duchies were raised to Grand Duchies, the Grand Duchy of Mecklenburg-Schwerin and the Grand Duchy of Mecklenburg-Strelitz, and subsequently existed separately as such in Germany under enlightened but absolute rule (constitutions being granted on the eve of World War I) until the revolution of 1918.  Life in Mecklenburg could be quite harsh.  Practices such as having to ask for permission from the Grand Duke to get married, or having to apply for permission to emigrate, would linger late into the history of Mecklenburg (i.e. 1918), long after such practices had been abandoned in other German areas.  Even as late as the later half of the 19th century the Grand Duke personally owned half of the countryside.  The last Duke abdicated in 1918, as monarchies fell throughout Europe.  The Duke's ruling house reigned in Mecklenburg uninterrupted (except for two years) from its incorporation into the Holy Roman Empire until 1918.  From 1918 to 1933, the duchies were free states in the Weimar Republic.\n\nTraditionally Mecklenburg has always been one of the poorer German areas, and later the poorer of the provinces, or Länder, within a unified Germany.  The reasons for this may be varied, but one factor stands out: agriculturally the land is poor and can not produce at the same level as other parts of Germany.  The two Mecklenburgs made attempts at being independent states after 1918, but eventually this failed as their dependence on the rest of the German lands became apparent.\n\nHistory since 1934\n\nAfter three centuries of partition, Mecklenburg was united in 1934 by the Nazi government. The Wehrmacht assigned Mecklenburg and Pomerania to Wehrkreis II under the command of General der Infanterie Werner Kienitz, with the headquarters at Stettin. Mecklenburg was assigned to an Area headquartered at Schwerin, which was responsible for military units in Schwerin; Rostock; Parchim; and Neustrelitz.\n\nAfter World War II, the Soviet government occupying eastern Germany merged Mecklenburg with the smaller neighbouring region of Western Pomerania (German Vorpommern) to form the state of Mecklenburg-Vorpommern. Mecklenburg contributed about two-thirds of the geographical size of the new state and the majority of its population. Also, the new state became temporary or permanent home for lots of refugees expelled from former German territories seized by the Soviet Union and Poland after the war. The Soviets changed the name from \"Mecklenburg-Western Pomerania\" to \"Mecklenburg\" in 1947.\n\nIn 1952, the East German government ended the independent existence of Mecklenburg, creating 3 districts (\"Bezirke\") out of its territory: Rostock, Schwerin and Neubrandenburg.\n\nDuring German reunification in 1990, the state of Mecklenburg-Vorpommern was revived, and is now one of the 16 states of the Federal Republic of Germany.\n\nCoat of arms of the duchies of Mecklenburg \n\nThe House of Mecklenburg was founded by Niklot, prince of the Obotrites, Chizzini and Circipani on the Baltic Sea, who died in 1160. His Christian progeny was recognized as prince of the Holy Roman Empire 1170 and Duke of Mecklenburg 8 July 1348. On 27 February 1658 the ducal house divided in two branches: Mecklenburg-Schwerin and Mecklenburg-Strelitz.\n\nThe flag of both Mecklenburg duchies is traditionally made of the colours blue, yellow and red. The sequence however changed more than once in the past 300 years. In 1813 the duchies used yellow-red-blue. 23 December 1863 for Schwerin and 4 January 1864 for Strelitz blue-yellow-red was ordered.(Ströhl, Deutsche Wappenrolle, Stuttgart, 1897, p. 89) Mecklenburg-Schwerin however used white instead of yellow for flags on sea by law of 24 March 1855.(Ströhl, 86)\n\nSiebmachers Wappenbuch gives therefore (?) blue-white-red for Schwerin and blue-yellow-red for Strelitz.Siebmachers Wappenbuch (Nurenberg, 1878)\nAccording to this source, the grand ducal house of Schwerin used a flag of 3.75 to 5.625 M with the middle arms on a white quadrant (1.75 M) in the middle.\n\nThe middle arms show the shield of Mecklenburg as arranged in the 17th century. The county of Schwerin in the middle and in the quartering Mecklenburg (bull's head with hide), Rostock (griffin), principality of Schwerin (griffin surmounting green rectangle), Ratzeburg (cross surmounted by crown), Stargard (arm with hand holding ring) and Wenden  (bull's head). The shield is supported by a bull and a griffin and surmounted by a royal crown.\n\nThe dukes of Strelitz used according to Siebmachers the blue-yellow-red flag with just the (oval) shield of Mecklenburg in the yellow band.\n\nStröhl in 1897 and Bulgaria,Berühmte Fahnen Deutscher Geschichte (Dresden, 1922) show another arrangement: The grand-duke of Mecklenburg-Schwerin flows a flag (4:5) with the arms of the figures from the shield of arms.\n\nThe former Schwerin standard with the white quadrant is now ascribed to the grand dukes of Strelitz.\nStröhl mentions a flag for the grand ducal house by law of 23 December 1863 with the middle arms in the yellow band. And he mentions a special sea flag, the same but with a white middle band. \n'Berühmte Fahnen' shows furthermore a standard for grand duchess Alexandra of Mecklenburg-Schwerin, princess of Hannover (1882–1963), showing her shield and that of Mecklenburg joined by the order of the Wendic Crown in a white oval. On sea the yellow band in her flag was of course white. \nThe princes (dukes) of Mecklenburg-Schwerin had according to this source their own standard, showing the griffin of Rostock.\n\nEconomy \n\nTourism \n\nMecklenburg faces a huge increase in tourism since German reunification in 1990, particularly with its beaches and seaside resorts at the Baltic Sea (\"German Riviera\", Warnemünde, Boltenhagen, Heiligendamm, Kühlungsborn, Rerik and others), the Mecklenburg Lakeland (Mecklenburgische Seenplatte) and the Mecklenburg Switzerland (Mecklenburgische Schweiz) with their pristine nature, the old Hanseatic towns of Rostock, Greifswald, Stralsund and Wismar (the latter two being World Heritage) well known for their medieval Brick Gothic buildings, and the former royal residences of Schwerin, Güstrow, Ludwigslust and Neustrelitz.\n\nNotable Mecklenburgers\n\n* Gebhard Leberecht von Blücher, Prussian army leader\n* Jan Ullrich, cyclist\n* Gottlob Frege, logician\n* Siegfried Marcus, automobile pioneer\n* Heinrich Schliemann,  classical archaeologist\n* Johannes Gillhoff, teacher, author of book on Mecklenburg emigrants to the US\n* Fritz Reuter, poet and novelist\n* Ludwig Jacoby, (1813–1874), born in Altstrelitz, an author and Methodist clergyman, commissioned as a missionary to St. Louis, Missouri, by the founder of the German Methodist Church in America, William Nast (1807–1899).  Jacoby founded the first Methodist Church West of the Mississippi River, originally known as Bethel Church, now known as Memorial United Methodist Church, in St. Louis in 1841.\n* Charlotte of Mecklenburg-Strelitz, (1744–1818), wife of George III of the United Kingdom and grandmother of Queen Victoria. Charlotte, North Carolina, USA and the county in which it lies were named in her honour, as was Charlottesville, Virginia, US. Mecklenburg. http://en.wikipedia.org/?curid=20193."
  }
}
