{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6293",
  "eid" : "dad45e40-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778446884,
  "textBody" : "Cairo ( ;  ', ,  ') is the capital and largest city of Egypt. The city's metropolitan area is the largest in the Middle East and the Arab world, and the 15th-largest in the world, and is associated with ancient Egypt, as the famous Giza pyramid complex and the ancient city of Memphis are located in its geographical area. Located near the Nile Delta, modern Cairo was founded in 969 CE by the Fatimid dynasty, but the land composing the present-day city was the site of ancient national capitals whose remnants remain visible in parts of Old Cairo. Cairo has long been a center of the region's political and cultural life, and is titled \"the city of a thousand minarets\" for its preponderance of Islamic architecture. Cairo is considered a World City with a \"Beta +\" classification according to GaWC.\n\nCairo has the oldest and largest film and music industries in the Arab world, as well as the world's second-oldest institution of higher learning, Al-Azhar University. Many international media, businesses, and organizations have regional headquarters in the city; the Arab League has had its headquarters in Cairo for most of its existence.\n\nWith a population of 6.76 million. Adjusted census result, as Helwan governorate was created on 17 April 2008 from a.o.  parts of the Cairo governorate. spread over 453 km2, Cairo is by far the largest city in Egypt. An additional 9.5 million inhabitants live in close proximity to the city. Cairo, like many other mega-cities, suffers from high levels of pollution and traffic. Cairo's metro, one of two in Africa (the other being in Algiers, Algeria), ranks among the fifteen busiest in the world, with over 1 billion annual passenger rides. The economy of Cairo was ranked first in the Middle East in 2005, and 43rd globally on Foreign Policy 2010 Global Cities Index.\n\nEtymology\n\nEgyptians often refer to Cairo as ' (; ), the Egyptian Arabic name for Egypt itself, emphasizing the city's importance for the country. Its official name ' () means \"the Vanquisher\" or \"the Conqueror\", supposedly due to the fact that the planet Mars, an-Najm al-Qāhir (, \"the Conquering Star\"), was rising at the time when the city was founded, possibly also in reference to the much awaited arrival of the Fatimid Caliph Al-Mu'izz who reached Cairo in 973 from Mahdia, the old Fatimid capital.Cairo#Foundation and expansion In Coptic the city is known as Kahire (), meaning \"Place of the Sun\", possibly referring to the ancient city of Heliopolis, the main seat of worship of the solar deity Ra—(or Re). The location of the ancient city is the suburb of Ain Shams (, \"Sun-Eye\" or \"Eye of the Sun\"). The ancient Egyptian name for the area is thought to be Khere-Ohe, \"The Place of Combat\", supposedly in reference to a mythical battle that took place between Seth and Horus.  Sometimes the city is informally referred to as ' (; ).Good News for Me: [http://www.gn4me.com/gn4me/details.jsp?artId=3885468   بلال فضل يتفرغ لـ\"أهل اسكندرية\" بعد \"أهل كايرو\"] ‏  (Belal Fadl frees himself [to write] Ahl Eskendereyya (the People of Alexandria) after Ahl Kayro (the People of Cairo))\n\nHistory \n\nInitial settlements \n\nThe area around present-day Cairo, especially Memphis, had long been a focal point of Ancient Egypt due to its strategic location just upstream from the Nile Delta. However, the origins of the modern city are generally traced back to a series of settlements in the first millennium. Around the turn of the 4th century, as Memphis was continuing to decline in importance, the Romans established a fortress town along the east bank of the Nile. This fortress, known as Babylon, was the nucleus of the Roman and then the Byzantine city and is the oldest structure in the city today. It is also situated at the nucleus of the Coptic Orthodox community, which separated from the Roman and Byzantine churches in the late 4th century. Many of Cairo's oldest Coptic churches, including the Hanging Church, are located along the fortress walls in a section of the city known as Coptic Cairo.\n\nFollowing the Muslim conquest in 640 AD, the conqueror Amr ibn As settled to the north of the Babylon in an area that became known as al-Fustat. Originally a tented camp (Fustat signifies \"City of Tents\") Fustat became a permanent settlement and the first capital of Islamic Egypt.\n\nIn 750, following the overthrow of the Ummayad caliphate by the Abbasids, the new rulers created their own settlement to the northeast of Fustat which became their capital. This was known as al-Askar (the city of sections, or cantonments) as it was laid out like a military camp.\n\nA rebellion in 869 by Ahmad ibn Tulun led to the abandonment of Al Askar and the building of another settlement, which became the seat of government. This was al-Qatta'i (\"the Quarters\"), to the north of Fustat and closer to the river. Al Qatta'i was centred around a palace and ceremonial mosque, now known as the Mosque of ibn Tulun.\n\nIn 905, the Abbasids re-asserted control of the country and their governor returned to Fustat, razing al-Qatta'i to the ground.\n\nFoundation and expansion\n\nIn 968, the Fatimids were led by general Jawhar al-Siqilli to establish a new capital for the Fatimid dynasty. Egypt was conquered from their base in Ifriqiya and a new fortified city northeast of Fustat was established. It took four years to build the city, initially known as al-Manṣūriyyah, which was to serve as the new capital of the caliphate. During that time, Jawhar also commissioned the construction of the al-Azhar Mosque by order of the Caliph, which developed into the third-oldest university in the world. Cairo would eventually become a centre of learning, with the library of Cairo containing hundreds of thousands of books. When Caliph al-Mu'izz li Din Allah arrived from the old Fatimid capital of Mahdia in Tunisia in 973, he gave the city its present name, al-Qāhiratu (\"The Victorious\").\n\nFor nearly 200 years after Cairo was established, the administrative centre of Egypt remained in Fustat. However, in 1168 the Fatimids under the leadership of vizier Shawar set fire to Fustat to prevent Cairo's capture by the Crusaders. Egypt's capital was permanently moved to Cairo, which was eventually expanded to include the ruins of Fustat and the previous capitals of al-Askar and al-Qatta'i. As al Qahira expanded these earlier settlements were encompassed, and have since become part of the city of Cairo as it expanded and spread; they are now collectively known as \"Old Cairo\".\n\nWhile the Fustat fire successfully protected the city of Cairo, a continuing power struggle between Shawar, King Amalric I of Jerusalem, and the Zengid general Shirkuh led to the downfall of the Fatimid establishment.\n\nIn 1169, Saladin was appointed as the new vizier of Egypt by the Fatimids and two years later he seized power from the family of the last Fatimid caliph, al-'Āḍid. As the first Sultan of Egypt, Saladin established the Ayyubid dynasty, based in Cairo, and aligned Egypt with the Abbasids, who were based in Baghdad. During his reign, Saladin constructed the Cairo Citadel, which served as the seat of the Egyptian government until the mid-19th century.\n\nIn 1250, slave soldiers, known as the Mamluks, seized control of Egypt and like many of their predecessors established Cairo as the capital of their new dynasty. Continuing a practice started by the Ayyubids, much of the land occupied by former Fatimid palaces was sold and replaced by newer buildings. Construction projects initiated by the Mamluks pushed the city outward while also bringing new infrastructure to the centre of the city. Meanwhile, Cairo flourished as a centre of Islamic scholarship and a crossroads on the spice trade route among the civilisations in Afro-Eurasia. By 1340, Cairo had a population of close to half a million, making it the largest city west of China.\n\nOttoman rule\n\nAlthough Cairo avoided Europe's stagnation during the Late Middle Ages, it could not escape the Black Death, which struck the city more than fifty times between 1348 and 1517. During its initial, and most deadly waves, approximately 200,000 people were killed by the plague, and, by the 15th century, Cairo's population had been reduced to between 150,000 and 300,000. The city's status was further diminished after Vasco da Gama discovered a sea route around the Cape of Good Hope between 1497 and 1499, thereby allowing spice traders to avoid Cairo.\nCairo's political influence diminished significantly after the Ottomans supplanted Mamluk power over Egypt in 1517. Ruling from Constantinople, Sultan Selim I relegated Egypt to a province, with Cairo as its capital. For this reason, the history of Cairo during Ottoman times is often described as inconsequential, especially in comparison to other time periods. However, during the 16th and 17th centuries, Cairo remained an important economic and cultural centre. Although no longer on the spice route, the city facilitated the transportation of Yemeni coffee and Indian textiles, primarily to Anatolia, North Africa, and the Balkans. Cairene merchants were instrumental in bringing goods to the barren Hejaz, especially during the annual hajj to Mecca. It was during this same period that al-Azhar University reached the predominance among Islamic schools that it continues to hold today; pilgrims on their way to hajj often attested to the superiority of the institution, which had become associated with Egypt's body of Islamic scholars. By the 16th century, Cairo also had high-rise apartment buildings where the two lower floors were for commercial and storage purposes and the multiple stories above them were rented out to tenants.\n\nUnder the Ottomans, Cairo expanded south and west from its nucleus around the Citadel. The city was the second-largest in the empire, behind Constantinople, and, although migration was not the primary source of Cairo's growth, twenty percent of its population at the end of the 18th century consisted of religious minorities and foreigners from around the Mediterranean. Still, when Napoleon arrived in Cairo in 1798, the city's population was less than 300,000, forty percent lower than it was at the height of Mamluk—and Cairene—influence in the mid-14th century.\n\nThe French occupation was short-lived as British and Ottoman forces, including a sizeable Albanian contingent, recaptured the country in 1801. Cairo itself was besieged by a British and Ottoman force culminating with the French surrender on 22 June 1801. The British vacated Egypt two years later, leaving the Ottomans, the Albanians, and the long-weakened Mamluks jostling for control of the country. Continued civil war allowed an Albanian named Muhammad Ali Pasha to ascend to the role of commander and eventually, with the approval of the religious establishment, viceroy of Egypt in 1805.\n\nModern era\n\nUntil his death in 1848, Muhammad Ali Pasha instituted a number of social and economic reforms that earned him the title of founder of modern Egypt. However, while Muhammad Ali initiated the construction of public buildings in the city, those reforms had minimal effect on Cairo's landscape. Bigger changes came to Cairo under Isma'il Pasha (r. 1863–1879), who continued the modernisation processes started by his grandfather. Drawing inspiration from Paris, Isma'il envisioned a city of maidans and wide avenues; due to financial constraints, only some of them, in the area now composing Downtown Cairo, came to fruition. Isma'il also sought to modernize the city, which was merging with neighboring settlements, by establishing a public works ministry, bringing gas and lighting to the city, and opening a theater and opera house.\n\nThe immense debt resulting from Isma'il's projects provided a pretext for increasing European control, which culminated with the British invasion in 1882. The city's economic centre quickly moved west toward the Nile, away from the historic Islamic Cairo section and toward the contemporary, European-style areas built by Isma'il. Europeans accounted for five percent of Cairo's population at the end of the 19th century, by which point they held most top governmental positions.\n\nThe British occupation was intended to be temporary, but it lasted well into the 20th century. Nationalists staged large-scale demonstrations in Cairo in 1919, five years after Egypt had been declared a British protectorate. Nevertheless, while this led to Egypt's independence in 1922, British troops remained in the country until 1956. During this time, urban Cairo, spurred by new bridges and transport links, continued to expand to include the upscale neighbourhoods of Garden City, Zamalek, and Heliopolis. Between 1882 and 1937, the population of Cairo more than tripled—from 347,000 to 1.3 million—and its area increased from 10 to.\n\nThe city was devastated during the 1952 riots known as the Cairo Fire or Black Saturday, which saw the destruction of nearly 700 shops, movie theatres, casinos and hotels in Downtown Cairo. The British departed Cairo following the Egyptian Revolution of 1952, but the city's rapid growth showed no signs of abating. Seeking to accommodate the increasing population, President Gamal Abdel Nasser redeveloped Maidan Tahrir and the Nile Corniche, and improved the city's network of bridges and highways. Meanwhile, additional controls of the Nile fostered development within Gezira Island and along the city's waterfront. The metropolis began to encroach on the fertile Nile Delta, prompting the government to build desert satellite towns and devise incentives for city-dwellers to move to them.\n\nCairo's population has doubled since the 1960s, reaching close to seven million (with an additional ten million in its urban area). Concurrently, Cairo has established itself as a political and economic hub for North Africa and the Arab world, with many multinational businesses and organisations, including the Arab League, operating out of the city.\n\nIn 1992, Cairo was hit by an earthquake causing 545 deaths, 6,512 injuries and 50,000 people homeless.\n\n2011 Egyptian revolution\n\nCairo's Tahrir Square was the focal point of the 2011 Egyptian Revolution against former president Hosni Mubarak. Over 2 million protesters were at Cairo's Tahrir square. More than 50,000 protesters first occupied the square on 25 January, during which the area's wireless services were reported to be impaired. In the following days Tahrir Square continued to be the primary destination for protests in Cairo as it took place following a popular uprising that began on Tuesday, 25 January 2011 and is still continuing as of February 2012. The uprising was mainly a campaign of non-violent civil resistance, which featured a series of demonstrations, marches, acts of civil disobedience, and labour strikes. Millions of protesters from a variety of socio-economic and religious backgrounds demanded the overthrow of the regime of Egyptian President Hosni Mubarak. Despite being predominantly peaceful in nature, the revolution was not without violent clashes between security forces and protesters, with at least 846 people killed and 6,000 injured. The uprising took place in Cairo, Alexandria, and in other cities in Egypt, following the Tunisian revolution that resulted in the overthrow of the long-time Tunisian president Zine El Abidine Ben Ali. On 11 February, following weeks of determined popular protest and pressure, Hosni Mubarak resigned from office.\n\nPost-revolutionary Cairo\n\nUnder the rule of President el-Sisi, in March 2015 plans were announced for another yet-unnamed planned city to be built further east of the existing satellite city of New Cairo, intended to serve as the new capital of Egypt.\n\nGeography\n\nCairo is located in northern Egypt, known as Lower Egypt, 165 km south of the Mediterranean Sea and 120 km west of the Gulf of Suez and Suez Canal. The city is along the Nile River, immediately south of the point where the river leaves its desert-bound valley and branches into the low-lying Nile Delta region. Although the Cairo metropolis extends away from the Nile in all directions, the city of Cairo resides only on the east bank of the river and two islands within it on a total area of 453 km2.\n\nUntil the mid-19th century, when the river was tamed by dams, levees, and other controls, the Nile in the vicinity of Cairo was highly susceptible to changes in course and surface level. Over the years, the Nile gradually shifted westward, providing the site between the eastern edge of the river and the Mokattam highlands on which the city now stands. The land on which Cairo was established in 969 (present-day Islamic Cairo) was located underwater just over three hundred years earlier, when Fustat was first built.\n\nLow periods of the Nile during the 11th century continued to add to the landscape of Cairo; a new island, known as Geziret al-Fil, first appeared in 1174, but eventually became connected to the mainland. Today, the site of Geziret al-Fil is occupied by the Shubra district. The low periods created another island at the turn of the 14th century that now composes Zamalek and Gezira. Land reclamation efforts by the Mamluks and Ottomans further contributed to expansion on the east bank of the river.\n\nBecause of the Nile's movement, the newer parts of the city—Garden City, Downtown Cairo, and Zamalek—are located closest to the riverbank.\n The areas, which are home to most of Cairo's embassies, are surrounded on the north, east, and south by the older parts of the city. Old Cairo, located south of the centre, holds the remnants of Fustat and the heart of Egypt's Coptic Christian community, Coptic Cairo. The Boulaq district, which lies in the northern part of the city, was born out of a major 16th-century port and is now a major industrial centre. The Citadel is located east of the city centre around Islamic Cairo, which dates back to the Fatimid era and the foundation of Cairo. While western Cairo is dominated by wide boulevards, open spaces, and modern architecture of European influence, the eastern half, having grown haphazardly over the centuries, is dominated by small lanes, crowded tenements, and Islamic architecture.\n\nNorthern and extreme eastern parts of Cairo, which include satellite towns, are among the most recent additions to the city, as they developed in the late-20th and early-21st centuries to accommodate the city's rapid growth. The western bank of the Nile is commonly included within the urban area of Cairo, but it composes the city of Giza and the Giza Governorate. Giza has also undergone significant expansion over recent years, and today the city, although still a suburb of Cairo, has a population of 2.7 million. The Cairo Governorate was just north of the Helwan Governorate from 2008 when some Cairo's southern districts, including Maadi and New Cairo, were split off and annexed into the new governorate, to 2011 when the Helwan Governorate was reincorporated into the Cairo Governorate.\n\nClimate\n\nIn Cairo, and along the Nile River Valley, the climate is a hot desert climate (BWh according to the Köppen climate classification system), but often with high humidity as it is not very far from the Mediterranean Sea and the Nile Delta. Wind storms can be frequent, bringing Saharan dust into the city, sometimes from March to May (see Khamasin) and the air often becomes uncomfortably dry. High temperatures in winter range from 14 to, while night-time lows drop to below 11 °C, often to 5 °C. In summer, the highs rarely surpass 40 °C, and lows drop to about 20 °C. Rainfall is sparse and only happens in the colder months, but sudden showers do cause harsh flooding. Snowfall is extremely rare; a small amount of graupel, widely believed to be snow, fell on Cairo's easternmost suburbs on 13 December 2013, the first time Cairo's area received this kind of precipitation in many decades. Dewpoints in the hottest months range from  in June to  in August.\n\nMetropolitan area\n\nThe Greater Cairo is the largest metropolitan area in Africa. It consists of Cairo Governorate, parts of Giza Governorate, and parts of Qalyubia Governorate.\n\nSatellite cities\n\n6th of October City, west of Cairo, and New Cairo, east of Cairo, are major urban developments which have been built to accommodate additional growth and development of the Cairo area.[https://www.nytimes.com/2010/08/25/world/africa/25egypt.html \"To Catch Cairo Overflow, 2 Megacities Rise in Sand\"] article by Thanassis Cambanis in The New York Times 24 August 2010. Retrieved 25 August 2010 New development includes several high-end residential developments.[http://www.sodic.com/our-developments/ Map of Greater Cairo & SODIC Developments]. Retrieved 25 August 2010\n\nPlanned new capital\n\nIn March 2015, plans were announced for a yet-unnamed planned city to be built east of Cairo, in an undeveloped area of the Cairo Governorate, which would serve as the administrative and financial capital of Egypt.\n\nInfrastructure\n\nHealth\n\nCairo, as well as neighbouring Giza, has been established as Egypt's main centre for medical treatment, and despite some exceptions, has the most advanced level of medical care in the country. Cairo's hospitals include the JCI-accredited As-Salaam International Hospital—Corniche El Nile, Maadi (Egypt's largest private hospital with 350 beds), Ain Shams University Hospital, Dar El Fouad Hospital, as well as Kasr El Aini Hospital.\n\nEducation\n\nGreater Cairo has long been the hub of education and educational services for Egypt and the region.\nToday, Greater Cairo is the centre for many government offices governing the Egyptian educational system, has the largest number of educational schools, and higher learning institutes among other cities and governorates of Egypt.\n\nSome of the International Schools found in Cairo:\n\nUniversities in Greater Cairo:\n\nTransportation\n\nCairo has an extensive road network, rail system, subway system and maritime services. Road transport is facilitated by personal vehicles, taxi cabs, privately owned public buses and Cairo microbuses. Cairo, specifically Ramses Square, is the centre of almost the entire Egyptian transportation network.\n\nThe subway system, officially called \"Metro (مترو)\", is a fast and efficient way of getting around Cairo. Metro network covers Helwan and other suburbs. It can get very crowded during rush hour. Two train cars (the fourth and fifth ones) are reserved for women only, although women may ride in any car they want.\n\nTrams in Greater Cairo (Heliopolis and Nasr City) exists now, while Cairo trolleybus was closed.\n\nAn extensive road network connects Cairo with other Egyptian cities and villages. There is a new Ring Road that surrounds the outskirts of the city, with exits that reach outer Cairo districts. There are flyovers and bridges, such as the Sixth of October bridge that, when the traffic is not heavy, allow fast means of transportation from one side of the city to the other.\n\nCairo traffic is known to be overwhelming and overcrowded. Traffic moves at a relatively fluid pace. Drivers tend to be aggressive, but are more courteous at junctions, taking turns going, with police aiding in traffic control of some congested areas.\n\nOther forms of transport\n\n* Cairo International Airport\n* Ramses Railway Station\n* Cairo Tram\n* Cairo Transportation Authority CTA\n* Cairo Taxi/Yellow Cab\n* Cairo Metro\n* Cairo Nile Ferry\n\nSports\n\nFootball is the most popular sport in Egypt, and Cairo has a number of sporting teams that compete in national and regional leagues. The best known teams are Al-Ahly, El Zamalek and Al-Ismaily. Al-Ahly and El Zamalek  annual football tournament is perhaps the most watched sports event in Egypt as well as the African-Arab region. Both teams are known as the \"rivals\" of Egyptian football, and are the first and the second champions in Africa and the Arab world. They play their home games at Cairo International Stadium or Naser Stadium, which is Egypt's 2nd largest stadium, Cairo's largest one and one of the largest stadiums in the world.\n\nThe Cairo International Stadium was built in 1960 and its multi-purpose sports complex that houses the main football stadium, an indoor stadium, several satellite fields that held several regional, continental and global games, including the African Games, U17 Football World Championship and was one of the stadiums scheduled that hosted the 2006 Africa Cup of Nations which was played in January 2006. Egypt later won the competition and went on to win the next edition In Ghana (2008) making the Egyptian and Ghanaian national teams the only teams to win the African Nations Cup Back to back which resulted in Egypt winning the title for a record number of six times in the history of African Continental Competition. This was followed by a third consecutive win in Angola 2010, making Egypt the only country with a record 3-consecutive and 7-total Continental Football Competition winner. This achievement had also placed the Egyptian football team as the #9 best team in the world's FIFA rankings.\n\nCairo failed at the applicant stage when bidding for the 2008 Summer Olympic Games, which was hosted in Beijing, China. However, Cairo did host the 2007 Pan Arab Games.\n\nThere are several other sports teams in the city that participate in several sports including el Gezira Sporting Club, el Shams Club, el Seid Club, Heliopolis Club and several smaller clubs, but the biggest clubs in Egypt (not in area but in sports) are Al Ahly and Al Zamalek. They have the two biggest football teams in Egypt. There are new sports clubs in the area of New Cairo (one hour far from Cairo's down town), these are Al Zohour sporting club, Wadi Degla sporting club and Platinum Club.\n\nMost of the sports federations of the country are also located in the city suburbs, including the Egyptian Football Association. The headquarters of the Confederation of African Football (CAF) was previously located in Cairo, before relocating to its new headquarters in 6 October City, a small city away from Cairo's crowded districts.\n\nIn October 2008, the Egyptian Rugby Federation was officially formed and granted membership into the International Rugby Board.\n\nEgypt is internationally known for the excellence of its squash players who excel in both professional and junior divisions. Egypt currently has seven players in the top ten of the PSA men’s world rankings, and three in the women’s top ten. Mohamed El Shorbagy held the world number one position for more than a year before being overtaken by compatriot Karim Abdel Gawad, who is currently number two behind Gregory Gaultier of France. Ramy Ashour and Amr Shabana are regarded as two of the most talented squash players in history. Shabana won the World Open title four times and Ashour twice, although his recent form has been hampered by injury. Egypt’s Nour El Sherbini has won the Women’s World Championship twice and has been women’s world number one for 16 consecutive months. On 30 April 2016, she became the youngest woman to win the Women's World Championship which was held in Malaysia. On April 2017 she retained her title by winning the Women's World Championship which was held in the Egyptian resort of El Gouna.\n\nCulture\n\nIn 2017 Cairo was voted the most dangerous megacity for women with more than 10 million inhabitants in a poll by Thomson Reuters Foundation. Harassment was described as occurring on a daily basis.\n\nCultural tourism in Egypt \n\nCairo Opera House\n\nPresident Mubarak inaugurated the new Cairo Opera House of the Egyptian National Cultural Centres on 10 October 1988, 17 years after the Royal Opera House had been destroyed by fire. The National Cultural Centre was built with the help of JICA, the Japan International Co-operation Agency and stands as a prominent feature for the Japanese-Egyptian co-operation and the friendship between the two nations.\n\nKhedivial Opera House\n\nThe Khedivial Opera House, or Royal Opera House, was the original opera house in Cairo. It was dedicated on 1 November 1869 and burned down on 28 October 1971. After the original opera house was destroyed, Cairo was without an opera house for nearly two decades until the opening of the new Cairo Opera House in 1988.\n\nCairo International Film Festival\n\nCairo held its first international film festival 16 August 1976, when the first Cairo International Film Festival was launched by the Egyptian Association of Film Writers and Critics, headed by Kamal El-Mallakh. The Association ran the festival for seven years until 1983.\n\nThis achievement lead to the President of the Festival again contacting the FIAPF with the request that a competition should be included at the 1991 Festival. The request was granted.\n\nIn 1998, the Festival took place under the presidency of one of Egypt's leading actors, Hussein Fahmy, who was appointed by the Minister of Culture, Farouk Hosni, after the death of Saad El-Din Wahba. Four years later, the journalist and writer Cherif El-Shoubashy became president.\n\nCairo Geniza\n\nThe Cairo Geniza is an accumulation of almost 200,000 Jewish manuscripts that were found in the genizah of the Ben Ezra synagogue (built 882) of Fustat, Egypt (now Old Cairo), the Basatin cemetery east of Old Cairo, and a number of old documents that were bought in Cairo in the later 19th century. These documents were written from about 870 to 1880 AD and have been archived in various American and European libraries. The Taylor-Schechter collection in the University of Cambridge runs to 140,000 manuscripts, a further 40,000 manuscripts are at the Jewish Theological Seminary of America.\n\nReligion\n\nMost residents are Sunni Muslim, while the rest of the population is mostly Christian. Al-Azhar University, based in Cairo, is considered the leading authority of Sunni Islam worldwide. Most Christians are Coptic Orthodox. Until his death in March 2012, Pope Shenouda III of Alexandria was the leader of the Coptic Orthodox Church, followed by Pope Tawadros II who became Pope on 18 November 2012, whose residence is in Cairo. Cairo has several synagogues, but few Jews remain after Israel was established and the subsequent exodus, largely due to state sponsored discrimination. Tension between members of different religions has increased recently.\n\nEconomy\n\nCairo accounts for 11% of Egypt's population and 22% of its economy (PPP). The majority of the nation's commerce is generated there, or passes through the city. The great majority of publishing houses and media outlets and nearly all film studios are there, as are half of the nation's hospital beds and universities. This has fueled rapid construction in the city—one building in five is less than 15 years old.\n\nThis growth until recently surged well ahead of city services. Homes, roads, electricity, telephone and sewer services were all in short supply. Analysts trying to grasp the magnitude of the change coined terms like \"hyper-urbanization\".\n\nCairo's automobile assembler and manufacturer\n\n* Arab American Vehicles Company\n* Egyptian Light Transport Manufacturing Company (Egyptian NSU pedant)\n* Ghabbour Group (Fuso, Hyundai and Volvo)\n* MCV Corporate Group (a part of the Daimler AG)\n* Mod Car\n* Seoudi Group (Modern Motors: Nissan, BMW (formerly); El-Mashreq: Alfa Romeo and Fiat)\n* Speranza (former Daewoo Motors Egypt; Chery, Daewoo)\n* General Motors Egypt\n\nHistorical sites and landmarks\n\nFor a complete list, see Visitor attractions in Cairo, list of mosques\n\nTahrir Square\n\nTahrir Square was founded during the mid 19th century with the establishment of modern downtown Cairo. It was first named Ismailia Square, after the 19th-century ruler Khedive Ismail, who commissioned the new downtown district's 'Paris on the Nile' design. After the Egyptian Revolution of 1919 the square became widely known as Tahrir (Liberation) Square, though it was not officially renamed as such until after the 1952 Revolution which eliminated the monarchy. Several notable buildings surround the square including, the American University in Cairo's downtown campus, the Mogamma governmental administrative Building, the headquarters of the Arab League, the Nile Ritz Carlton Hotel, and the Egyptian Museum. Being at the heart of Cairo, the square witnessed several major protests over the years. However, the most notable event in the square was being the focal point of the 2011 Egyptian Revolution against former president Hosni Mubarak.\n\nEgyptian Museum\n\nThe Museum of Egyptian Antiquities, known commonly as the Egyptian Museum, is home to the most extensive collection of ancient Egyptian antiquities in the world. It has 136,000 items on display, with many more hundreds of thousands in its basement storerooms. Among its most famous collections on display are the finds from the Tomb of Tutankhamun.\n\nCairo Tower\n\nThe Cairo Tower is a free-standing tower with a revolving restaurant at the top. It provides a bird's eye view of Cairo to the restaurant patrons. It stands in the Zamalek district on Gezira Island in the Nile River, in the city centre. At 187 m, it is 44 m higher than the Great Pyramid of Giza, which stands some 15 km to the southwest.\n\nOld Cairo\n\nThis area of Cairo is so-named as it contains the remains of the ancient Roman fortress of Babylon and also overlaps the original site of Fustat, the first Arab settlement in Egypt (7th century AD) and the predecessor of later Cairo. The area is also known as Coptic Cairo as it holds a high concentration of old Christian churches including the Hanging Church, the Greek Orthodox Church of St. George, and other Christian or Coptic buildings, most of which are located over the site of the ancient Roman fortress. It is also the location of the Coptic Museum, which showcases the history of Coptic art from Greco-Roman to Islamic times, and of the Ben Ezra Synagogue, the oldest and best-known synagogue in Cairo, where the important collection of Geniza documents were discovered in the 19th century.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 43. To the north of this Coptic enclave is the Amr ibn al-'As Mosque, the first mosque in Egypt and the most important religious center of former Fustat, founded in 642 AD right after the Arab conquest but rebuilt many times since.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 39.\n\nIslamic Cairo\n\nCairo holds one of the greatest concentrations of historical monuments of Islamic architecture in the world.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press. The areas around the old walled city and around the Citadel are characterized by hundreds of mosques, tombs, madrasas, mansions, caravanserais, and fortifications dating from the Islamic era and are often referred to as \"Islamic Cairo\", especially in English travel literature.e.g. O'Neill, Zora et al. 2012. Lonely Planet: Egypt (11th edition). It is also the location of several important religious shrines such as the al-Hussein Mosque (whose shrine is believed to hold the head of Husayn ibn Ali), the Mausoleum of Imam al-Shafi'i (founder of the Shafi'i madhhab, one of the primary schools of thought in Sunni Islamic jurisprudence), the Tomb of Sayyida Ruqayya, the Mosque of Sayyida Nafisa, and others.\n\nWhile the first mosque in Egypt was the Mosque of Amr ibn al-As in Fustat, the Mosque of Ibn Tulun is the oldest mosque to retain its original form and is a rare example of Abbasid architecture, from the classical period of Islamic civilization. It was built in 876–879 AD in a style inspired by the Abbasid capital of Samarra in Iraq.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, pp. 50–54. It is one of the largest mosques in Cairo and is often cited as one of the most beautiful.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p 50.O'Neill, Zora et al. 2012. Lonely Planet: Egypt (11th edition), p. 87.  Another Abbasid construction, the Nilometer on Rhoda Island, is the oldest original structure in Cairo, built in 862 AD. It was designed to measure the level of the Nile, which was important for agricultural and administrative purposes.Yeomans, Richard. 2006. The Art and Architecture of Islamic Cairo. Garnet Publishing, p 29.\n\nThe city named Cairo (Arabic: al-Qahira) was founded to the northeast of Fustat in 959 AD by the victorious Fatimid army. The Fatimids built a separate palatial city which contained their palaces and institutions of government. It was enclosed by a circuit of walls, which were rebuilt in stone in the late 11th century AD by the vizir Badr al-Gamali,Raymond, André. 1993. Le Caire. Fayard, p. 62. parts of which survive today at Bab Zuwayla in the south and Bab al-Futuh and Bab al-Nasr in the north.\n\nOne of the most important and lasting institutions founded in the Fatimid period was the Mosque of al-Azhar, founded in 970 AD, which competes with the Qarawiyyin in Fes for the title of oldest university in the world.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 169. Today, al-Azhar University is the foremost center of Islamic learning in the world and one of Egypt's largest universities with campuses across the country. The mosque itself retains significant Fatimid elements but has been added to and expanded in subsequent centuries, notably by the Mamluk sultans Qaitbay and al-Ghuri and by Abd al-Rahman Katkhuda in the 18th century.\n\nOther extant monuments from the Fatimid era include the large Mosque of al-Hakim, the al-Aqmar mosque, Juyushi Mosque, Lulua Mosque, and the Mosque of Salih Tala'i.\n\nThe most prominent architectural heritage of medieval Cairo, however, dates from the Mamluk period, from 1250 to 1517 AD. The Mamluk sultans and elites were eager patrons of religious and scholarly life, commonly building religious or funerary complexes whose functions could include a mosque, madrasa, khanqah (for Sufis), a sabil (water dispensary), and mausoleum for themselves and their families.Behrens-Abouseif, Doris. 2007. Cairo of the Mamluks: A History of Architecture and its Culture. Cairo: The American University in Cairo Press.\nAmong the best-known examples of Mamluk monuments in Cairo are the huge Mosque-Madrasa of Sultan Hasan, the Mosque of Amir al-Maridani, the Mosque of Sultan al-Mu'ayyad (whose twin minarets were built above the gate of Bab Zuwayla), the Sultan Al-Ghuri complex, the funerary complex of Sultan Qaytbay in the Northern Cemetery, and the trio of monuments in the Bayn al-Qasrayn area comprising the complex of Sultan al-Mansur Qalawun, the Madrasa of al-Nasir Muhammad, and the Madrasa of Sultan Barquq. It is said that a lot of the columns found in mosques were taken from the Coptic churches because of their beautiful artistic carvings and placed in mosques.\n\nThe Mamluks, and the later Ottomans, also built wikalas or caravanserais to house merchants and goods due to the important role of trade and commerce in Cairo's economy.Raymond, André. 1993. Le Caire. Fayard, pp. 90–97. The most famous example still intact today is the Wikala al-Ghuri, which nowadays also hosts regular performances by the Al-Tannoura Egyptian Heritage Dance Troupe.O'Neill, Zora et al. 2012. Lonely Planet: Egypt (11th edition), p. 81. The famous Khan al-Khalili (see below) is a commercial hub which also integrated caravanserais (also known as khans).\n\nFile:Kairo Ibn Tulun Moschee BW 5.jpg|Ibn Tulun Mosque, courtyard and minaret\nFile:Flickr - HuTect ShOts - Masjid of Sultan Hassan مسجد ومدرسة السلطان حسن - Cairo - Egypt - 28 05 2010 (2).jpg|The courtyard of the Sultan Hassan mosque-madrasa.\nFile:Bab Zuwayla Cairo 12 0864.jpg|Bab Zuweila, a Fatimid gate with the Mamluk minarets of the Mosque of Sultan al-Mu'ayyad on top.\nFile:Al-Ghuri Complex 0930.JPG|Sultan al-Ghuri complex, with mausoleum and khanqah on the left, and madrasa on the right.\nFile:Dome of Qaytbay complex.jpg|The dome of Sultan Qaytbay's mausoleum.\nFile:Bayn al-Qasrayn2.JPG|The Qalawun mausoleum complex at Bayn al-Qasrayn.\nFile:Khan el khalili.jpg|A medieval gate, Bab al-Ghuri, in the Khan El-Khalili market.\n\nCitadel of Cairo\n\nThe Citadel is a fortified enclosure begun by Salah al-Din in 1176 AD on an outcrop of the Muqattam Hills as part of a large defensive system to protect both Cairo to the north and Fustat to the southwest. It was the center of Egyptian government and residence of its rulers until 1874, when Khedive Isma'il moved to 'Abdin Palace.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 221. It is still occupied by the military today, but is now open as a tourist attraction comprising, notably, the National Military Museum, the 14th century Mosque of al-Nasir Muhammad, and the 19th century Mosque of Muhammad Ali which commands a dominant position on Cairo's skyline.\nKhan El-Khalili\n\nKhan el-Khalili is an ancient bazaar, or marketplace adjacent to the Al-Hussein Mosque. It dates back to 1385, when Amir Jarkas el-Khalili built a large caravanserai, or khan. (A caravanserai is a hotel for traders, and usually the focal point for any surrounding area.) This original carvanserai building was demolished by Sultan al-Ghuri, who rebuilt it as a new commercial complex in the early 16th century, forming the basis for the network of souqs existing today.Raymond, André. 1993. Le Caire. Fayard, pp. 179. Many medieval elements remain today, including the ornate Mamluk-style gateways.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 179. Today, the Khan el-Khalili is a major tourist attraction and popular stop for tour groups.O'Neill, Zora et al. 2012. Lonely Planet: Egypt (11th edition), p. 74-75.\n\nPollution\n\nCairo is an expanding city, which has led to many environmental problems. The air pollution in Cairo is a matter of serious concern. Greater Cairo's volatile aromatic hydrocarbon levels are higher than many other similar cities. Air quality measurements in Cairo have also been recording dangerous levels of lead, carbon dioxide, sulphur dioxide, and suspended particulate matter concentrations due to decades of unregulated vehicle emissions, urban industrial operations, and chaff and trash burning. There are over 4,500,000 cars on the streets of Cairo, 60% of which are over 10 years old, and therefore lack modern emission cutting features like catalytic converters. Cairo has a very poor dispersion factor because of lack of rain and its layout of tall buildings and narrow streets, which create a bowl effect.\nIn recent years, a mysterious black cloud (as Egyptians refer to it) appeared over Cairo every autumn and causes serious respiratory diseases and eye irritations for the city's citizens. Tourists who are not familiar with such high levels of pollution must take extra care.\n\nCairo also has many unregistered lead and copper smelters which heavily pollute the city. The results of this has been a permanent haze over the city with particulate matter in the air reaching over three times normal levels. It is estimated that 10,000 to 25,000 people a year in Cairo die due to air pollution-related diseases. Lead has been shown to cause harm to the central nervous system and neurotoxicity particularly in children. In 1995, the first environmental acts were introduced and the situation has seen some improvement with 36 air monitoring stations and emissions tests on cars. Twenty thousand buses have also been commissioned to the city to improve congestion levels, which are very high.\n\nThe city also suffers from a high level of land pollution. Cairo produces 10,000 tons of waste material each day, 4,000 tons of which is not collected or managed. This once again is a huge health hazard and the Egyptian Government is looking for ways to combat this. The Cairo Cleaning and Beautification Agency was founded to collect and recycle the waste; however, they also work with the Zabbaleen (or Zabaleen), a community that has been collecting and recycling Cairo's waste since the turn of the 20th century and live in an area known locally as Manshiyat naser. Both are working together to pick up as much waste as possible within the city limits, though it remains a pressing problem.\n\nThe city also suffers from water pollution as the sewer system tends to fail and overflow. On occasion, sewage has escaped onto the streets to create a health hazard. This problem is hoped to be solved by a new sewer system funded by the European Union, which could cope with the demand of the city. The dangerously high levels of mercury in the city's water system has global health officials concerned over related health risks.\n\nInternational relations\n\nNotable people\n\n* Naguib Mahfouz (1911–2006), novelist, Nobel Prize in Literature in 1988\n* Abu Sa'id al-Afif, 15th century Samaritan\n* Yasser Arafat (1929–2004), founder and first president of the Palestine Liberation Organization\n* Boutros Boutros-Ghali (1922–2016), former Secretary-General of the United Nations\n* Dalida (1933–1987), Italian-Egyptian singer who lived most of her life in France, received 55 golden records and was the first singer to receive a diamond disc\n* Mohamed ElBaradei (born 1942), former Director General of the International Atomic Energy Agency, 2005 Nobel Peace Prize laureate\n* Dorothy Hodgkin (1910–1994), British chemist, credited with the development of protein crystallography, Nobel Prize in Chemistry in 1964\n* Yakub Kadri Karaosmanoğlu (1889–1974), Turkish novelist\n* Roland Moreno (1945–2012), French inventor, engineer, humorist and author who invented the smart card\n* Gaafar Nimeiry (1930–2009), President of the Sudan\n* Ahmed Sabri (1889–1955) painter\n* Naguib Sawiris (born 1954), 62nd richest person on earth in 2007 list of billionaires, reaching US$10.0 billion with his company Orascom Telecom Holding\n* Sir Magdi Yacoub (born 1935), British-Egyptian cardiothoracic surgeon",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cairo" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6293" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Cairo ( ;  ', ,  ') is the capital and largest city of Egypt. The city's metropolitan area is the largest in the Middle East and the Arab world, and the 15th-largest in the world, and is associated with ancient Egypt, as the famous Giza pyramid complex and the ancient city of Memphis are located in its geographical area. Located near the Nile Delta, modern Cairo was founded in 969 CE by the Fatimid dynasty, but the land composing the present-day city was the site of ancient national capitals whose remnants remain visible in parts of Old Cairo. Cairo has long been a center of the region's political and cultural life, and is titled \"the city of a thousand minarets\" for its preponderance of Islamic architecture. Cairo is considered a World City with a \"Beta +\" classification according to GaWC.\n\nCairo has the oldest and largest film and music industries in the Arab world, as well as the world's second-oldest institution of higher learning, Al-Azhar University. Many international media, businesses, and organizations have regional headquarters in the city; the Arab League has had its headquarters in Cairo for most of its existence.\n\nWith a population of 6.76 million. Adjusted census result, as Helwan governorate was created on 17 April 2008 from a.o.  parts of the Cairo governorate. spread over 453 km2, Cairo is by far the largest city in Egypt. An additional 9.5 million inhabitants live in close proximity to the city. Cairo, like many other mega-cities, suffers from high levels of pollution and traffic. Cairo's metro, one of two in Africa (the other being in Algiers, Algeria), ranks among the fifteen busiest in the world, with over 1 billion annual passenger rides. The economy of Cairo was ranked first in the Middle East in 2005, and 43rd globally on Foreign Policy 2010 Global Cities Index.\n\nEtymology\n\nEgyptians often refer to Cairo as ' (; ), the Egyptian Arabic name for Egypt itself, emphasizing the city's importance for the country. Its official name ' () means \"the Vanquisher\" or \"the Conqueror\", supposedly due to the fact that the planet Mars, an-Najm al-Qāhir (, \"the Conquering Star\"), was rising at the time when the city was founded, possibly also in reference to the much awaited arrival of the Fatimid Caliph Al-Mu'izz who reached Cairo in 973 from Mahdia, the old Fatimid capital.Cairo#Foundation and expansion In Coptic the city is known as Kahire (), meaning \"Place of the Sun\", possibly referring to the ancient city of Heliopolis, the main seat of worship of the solar deity Ra—(or Re). The location of the ancient city is the suburb of Ain Shams (, \"Sun-Eye\" or \"Eye of the Sun\"). The ancient Egyptian name for the area is thought to be Khere-Ohe, \"The Place of Combat\", supposedly in reference to a mythical battle that took place between Seth and Horus.  Sometimes the city is informally referred to as ' (; ).Good News for Me: [http://www.gn4me.com/gn4me/details.jsp?artId=3885468   بلال فضل يتفرغ لـ\"أهل اسكندرية\" بعد \"أهل كايرو\"] ‏  (Belal Fadl frees himself [to write] Ahl Eskendereyya (the People of Alexandria) after Ahl Kayro (the People of Cairo))\n\nHistory \n\nInitial settlements \n\nThe area around present-day Cairo, especially Memphis, had long been a focal point of Ancient Egypt due to its strategic location just upstream from the Nile Delta. However, the origins of the modern city are generally traced back to a series of settlements in the first millennium. Around the turn of the 4th century, as Memphis was continuing to decline in importance, the Romans established a fortress town along the east bank of the Nile. This fortress, known as Babylon, was the nucleus of the Roman and then the Byzantine city and is the oldest structure in the city today. It is also situated at the nucleus of the Coptic Orthodox community, which separated from the Roman and Byzantine churches in the late 4th century. Many of Cairo's oldest Coptic churches, including the Hanging Church, are located along the fortress walls in a section of the city known as Coptic Cairo.\n\nFollowing the Muslim conquest in 640 AD, the conqueror Amr ibn As settled to the north of the Babylon in an area that became known as al-Fustat. Originally a tented camp (Fustat signifies \"City of Tents\") Fustat became a permanent settlement and the first capital of Islamic Egypt.\n\nIn 750, following the overthrow of the Ummayad caliphate by the Abbasids, the new rulers created their own settlement to the northeast of Fustat which became their capital. This was known as al-Askar (the city of sections, or cantonments) as it was laid out like a military camp.\n\nA rebellion in 869 by Ahmad ibn Tulun led to the abandonment of Al Askar and the building of another settlement, which became the seat of government. This was al-Qatta'i (\"the Quarters\"), to the north of Fustat and closer to the river. Al Qatta'i was centred around a palace and ceremonial mosque, now known as the Mosque of ibn Tulun.\n\nIn 905, the Abbasids re-asserted control of the country and their governor returned to Fustat, razing al-Qatta'i to the ground.\n\nFoundation and expansion\n\nIn 968, the Fatimids were led by general Jawhar al-Siqilli to establish a new capital for the Fatimid dynasty. Egypt was conquered from their base in Ifriqiya and a new fortified city northeast of Fustat was established. It took four years to build the city, initially known as al-Manṣūriyyah, which was to serve as the new capital of the caliphate. During that time, Jawhar also commissioned the construction of the al-Azhar Mosque by order of the Caliph, which developed into the third-oldest university in the world. Cairo would eventually become a centre of learning, with the library of Cairo containing hundreds of thousands of books. When Caliph al-Mu'izz li Din Allah arrived from the old Fatimid capital of Mahdia in Tunisia in 973, he gave the city its present name, al-Qāhiratu (\"The Victorious\").\n\nFor nearly 200 years after Cairo was established, the administrative centre of Egypt remained in Fustat. However, in 1168 the Fatimids under the leadership of vizier Shawar set fire to Fustat to prevent Cairo's capture by the Crusaders. Egypt's capital was permanently moved to Cairo, which was eventually expanded to include the ruins of Fustat and the previous capitals of al-Askar and al-Qatta'i. As al Qahira expanded these earlier settlements were encompassed, and have since become part of the city of Cairo as it expanded and spread; they are now collectively known as \"Old Cairo\".\n\nWhile the Fustat fire successfully protected the city of Cairo, a continuing power struggle between Shawar, King Amalric I of Jerusalem, and the Zengid general Shirkuh led to the downfall of the Fatimid establishment.\n\nIn 1169, Saladin was appointed as the new vizier of Egypt by the Fatimids and two years later he seized power from the family of the last Fatimid caliph, al-'Āḍid. As the first Sultan of Egypt, Saladin established the Ayyubid dynasty, based in Cairo, and aligned Egypt with the Abbasids, who were based in Baghdad. During his reign, Saladin constructed the Cairo Citadel, which served as the seat of the Egyptian government until the mid-19th century.\n\nIn 1250, slave soldiers, known as the Mamluks, seized control of Egypt and like many of their predecessors established Cairo as the capital of their new dynasty. Continuing a practice started by the Ayyubids, much of the land occupied by former Fatimid palaces was sold and replaced by newer buildings. Construction projects initiated by the Mamluks pushed the city outward while also bringing new infrastructure to the centre of the city. Meanwhile, Cairo flourished as a centre of Islamic scholarship and a crossroads on the spice trade route among the civilisations in Afro-Eurasia. By 1340, Cairo had a population of close to half a million, making it the largest city west of China.\n\nOttoman rule\n\nAlthough Cairo avoided Europe's stagnation during the Late Middle Ages, it could not escape the Black Death, which struck the city more than fifty times between 1348 and 1517. During its initial, and most deadly waves, approximately 200,000 people were killed by the plague, and, by the 15th century, Cairo's population had been reduced to between 150,000 and 300,000. The city's status was further diminished after Vasco da Gama discovered a sea route around the Cape of Good Hope between 1497 and 1499, thereby allowing spice traders to avoid Cairo.\nCairo's political influence diminished significantly after the Ottomans supplanted Mamluk power over Egypt in 1517. Ruling from Constantinople, Sultan Selim I relegated Egypt to a province, with Cairo as its capital. For this reason, the history of Cairo during Ottoman times is often described as inconsequential, especially in comparison to other time periods. However, during the 16th and 17th centuries, Cairo remained an important economic and cultural centre. Although no longer on the spice route, the city facilitated the transportation of Yemeni coffee and Indian textiles, primarily to Anatolia, North Africa, and the Balkans. Cairene merchants were instrumental in bringing goods to the barren Hejaz, especially during the annual hajj to Mecca. It was during this same period that al-Azhar University reached the predominance among Islamic schools that it continues to hold today; pilgrims on their way to hajj often attested to the superiority of the institution, which had become associated with Egypt's body of Islamic scholars. By the 16th century, Cairo also had high-rise apartment buildings where the two lower floors were for commercial and storage purposes and the multiple stories above them were rented out to tenants.\n\nUnder the Ottomans, Cairo expanded south and west from its nucleus around the Citadel. The city was the second-largest in the empire, behind Constantinople, and, although migration was not the primary source of Cairo's growth, twenty percent of its population at the end of the 18th century consisted of religious minorities and foreigners from around the Mediterranean. Still, when Napoleon arrived in Cairo in 1798, the city's population was less than 300,000, forty percent lower than it was at the height of Mamluk—and Cairene—influence in the mid-14th century.\n\nThe French occupation was short-lived as British and Ottoman forces, including a sizeable Albanian contingent, recaptured the country in 1801. Cairo itself was besieged by a British and Ottoman force culminating with the French surrender on 22 June 1801. The British vacated Egypt two years later, leaving the Ottomans, the Albanians, and the long-weakened Mamluks jostling for control of the country. Continued civil war allowed an Albanian named Muhammad Ali Pasha to ascend to the role of commander and eventually, with the approval of the religious establishment, viceroy of Egypt in 1805.\n\nModern era\n\nUntil his death in 1848, Muhammad Ali Pasha instituted a number of social and economic reforms that earned him the title of founder of modern Egypt. However, while Muhammad Ali initiated the construction of public buildings in the city, those reforms had minimal effect on Cairo's landscape. Bigger changes came to Cairo under Isma'il Pasha (r. 1863–1879), who continued the modernisation processes started by his grandfather. Drawing inspiration from Paris, Isma'il envisioned a city of maidans and wide avenues; due to financial constraints, only some of them, in the area now composing Downtown Cairo, came to fruition. Isma'il also sought to modernize the city, which was merging with neighboring settlements, by establishing a public works ministry, bringing gas and lighting to the city, and opening a theater and opera house.\n\nThe immense debt resulting from Isma'il's projects provided a pretext for increasing European control, which culminated with the British invasion in 1882. The city's economic centre quickly moved west toward the Nile, away from the historic Islamic Cairo section and toward the contemporary, European-style areas built by Isma'il. Europeans accounted for five percent of Cairo's population at the end of the 19th century, by which point they held most top governmental positions.\n\nThe British occupation was intended to be temporary, but it lasted well into the 20th century. Nationalists staged large-scale demonstrations in Cairo in 1919, five years after Egypt had been declared a British protectorate. Nevertheless, while this led to Egypt's independence in 1922, British troops remained in the country until 1956. During this time, urban Cairo, spurred by new bridges and transport links, continued to expand to include the upscale neighbourhoods of Garden City, Zamalek, and Heliopolis. Between 1882 and 1937, the population of Cairo more than tripled—from 347,000 to 1.3 million—and its area increased from 10 to.\n\nThe city was devastated during the 1952 riots known as the Cairo Fire or Black Saturday, which saw the destruction of nearly 700 shops, movie theatres, casinos and hotels in Downtown Cairo. The British departed Cairo following the Egyptian Revolution of 1952, but the city's rapid growth showed no signs of abating. Seeking to accommodate the increasing population, President Gamal Abdel Nasser redeveloped Maidan Tahrir and the Nile Corniche, and improved the city's network of bridges and highways. Meanwhile, additional controls of the Nile fostered development within Gezira Island and along the city's waterfront. The metropolis began to encroach on the fertile Nile Delta, prompting the government to build desert satellite towns and devise incentives for city-dwellers to move to them.\n\nCairo's population has doubled since the 1960s, reaching close to seven million (with an additional ten million in its urban area). Concurrently, Cairo has established itself as a political and economic hub for North Africa and the Arab world, with many multinational businesses and organisations, including the Arab League, operating out of the city.\n\nIn 1992, Cairo was hit by an earthquake causing 545 deaths, 6,512 injuries and 50,000 people homeless.\n\n2011 Egyptian revolution\n\nCairo's Tahrir Square was the focal point of the 2011 Egyptian Revolution against former president Hosni Mubarak. Over 2 million protesters were at Cairo's Tahrir square. More than 50,000 protesters first occupied the square on 25 January, during which the area's wireless services were reported to be impaired. In the following days Tahrir Square continued to be the primary destination for protests in Cairo as it took place following a popular uprising that began on Tuesday, 25 January 2011 and is still continuing as of February 2012. The uprising was mainly a campaign of non-violent civil resistance, which featured a series of demonstrations, marches, acts of civil disobedience, and labour strikes. Millions of protesters from a variety of socio-economic and religious backgrounds demanded the overthrow of the regime of Egyptian President Hosni Mubarak. Despite being predominantly peaceful in nature, the revolution was not without violent clashes between security forces and protesters, with at least 846 people killed and 6,000 injured. The uprising took place in Cairo, Alexandria, and in other cities in Egypt, following the Tunisian revolution that resulted in the overthrow of the long-time Tunisian president Zine El Abidine Ben Ali. On 11 February, following weeks of determined popular protest and pressure, Hosni Mubarak resigned from office.\n\nPost-revolutionary Cairo\n\nUnder the rule of President el-Sisi, in March 2015 plans were announced for another yet-unnamed planned city to be built further east of the existing satellite city of New Cairo, intended to serve as the new capital of Egypt.\n\nGeography\n\nCairo is located in northern Egypt, known as Lower Egypt, 165 km south of the Mediterranean Sea and 120 km west of the Gulf of Suez and Suez Canal. The city is along the Nile River, immediately south of the point where the river leaves its desert-bound valley and branches into the low-lying Nile Delta region. Although the Cairo metropolis extends away from the Nile in all directions, the city of Cairo resides only on the east bank of the river and two islands within it on a total area of 453 km2.\n\nUntil the mid-19th century, when the river was tamed by dams, levees, and other controls, the Nile in the vicinity of Cairo was highly susceptible to changes in course and surface level. Over the years, the Nile gradually shifted westward, providing the site between the eastern edge of the river and the Mokattam highlands on which the city now stands. The land on which Cairo was established in 969 (present-day Islamic Cairo) was located underwater just over three hundred years earlier, when Fustat was first built.\n\nLow periods of the Nile during the 11th century continued to add to the landscape of Cairo; a new island, known as Geziret al-Fil, first appeared in 1174, but eventually became connected to the mainland. Today, the site of Geziret al-Fil is occupied by the Shubra district. The low periods created another island at the turn of the 14th century that now composes Zamalek and Gezira. Land reclamation efforts by the Mamluks and Ottomans further contributed to expansion on the east bank of the river.\n\nBecause of the Nile's movement, the newer parts of the city—Garden City, Downtown Cairo, and Zamalek—are located closest to the riverbank.\n The areas, which are home to most of Cairo's embassies, are surrounded on the north, east, and south by the older parts of the city. Old Cairo, located south of the centre, holds the remnants of Fustat and the heart of Egypt's Coptic Christian community, Coptic Cairo. The Boulaq district, which lies in the northern part of the city, was born out of a major 16th-century port and is now a major industrial centre. The Citadel is located east of the city centre around Islamic Cairo, which dates back to the Fatimid era and the foundation of Cairo. While western Cairo is dominated by wide boulevards, open spaces, and modern architecture of European influence, the eastern half, having grown haphazardly over the centuries, is dominated by small lanes, crowded tenements, and Islamic architecture.\n\nNorthern and extreme eastern parts of Cairo, which include satellite towns, are among the most recent additions to the city, as they developed in the late-20th and early-21st centuries to accommodate the city's rapid growth. The western bank of the Nile is commonly included within the urban area of Cairo, but it composes the city of Giza and the Giza Governorate. Giza has also undergone significant expansion over recent years, and today the city, although still a suburb of Cairo, has a population of 2.7 million. The Cairo Governorate was just north of the Helwan Governorate from 2008 when some Cairo's southern districts, including Maadi and New Cairo, were split off and annexed into the new governorate, to 2011 when the Helwan Governorate was reincorporated into the Cairo Governorate.\n\nClimate\n\nIn Cairo, and along the Nile River Valley, the climate is a hot desert climate (BWh according to the Köppen climate classification system), but often with high humidity as it is not very far from the Mediterranean Sea and the Nile Delta. Wind storms can be frequent, bringing Saharan dust into the city, sometimes from March to May (see Khamasin) and the air often becomes uncomfortably dry. High temperatures in winter range from 14 to, while night-time lows drop to below 11 °C, often to 5 °C. In summer, the highs rarely surpass 40 °C, and lows drop to about 20 °C. Rainfall is sparse and only happens in the colder months, but sudden showers do cause harsh flooding. Snowfall is extremely rare; a small amount of graupel, widely believed to be snow, fell on Cairo's easternmost suburbs on 13 December 2013, the first time Cairo's area received this kind of precipitation in many decades. Dewpoints in the hottest months range from  in June to  in August.\n\nMetropolitan area\n\nThe Greater Cairo is the largest metropolitan area in Africa. It consists of Cairo Governorate, parts of Giza Governorate, and parts of Qalyubia Governorate.\n\nSatellite cities\n\n6th of October City, west of Cairo, and New Cairo, east of Cairo, are major urban developments which have been built to accommodate additional growth and development of the Cairo area.[https://www.nytimes.com/2010/08/25/world/africa/25egypt.html \"To Catch Cairo Overflow, 2 Megacities Rise in Sand\"] article by Thanassis Cambanis in The New York Times 24 August 2010. Retrieved 25 August 2010 New development includes several high-end residential developments.[http://www.sodic.com/our-developments/ Map of Greater Cairo & SODIC Developments]. Retrieved 25 August 2010\n\nPlanned new capital\n\nIn March 2015, plans were announced for a yet-unnamed planned city to be built east of Cairo, in an undeveloped area of the Cairo Governorate, which would serve as the administrative and financial capital of Egypt.\n\nInfrastructure\n\nHealth\n\nCairo, as well as neighbouring Giza, has been established as Egypt's main centre for medical treatment, and despite some exceptions, has the most advanced level of medical care in the country. Cairo's hospitals include the JCI-accredited As-Salaam International Hospital—Corniche El Nile, Maadi (Egypt's largest private hospital with 350 beds), Ain Shams University Hospital, Dar El Fouad Hospital, as well as Kasr El Aini Hospital.\n\nEducation\n\nGreater Cairo has long been the hub of education and educational services for Egypt and the region.\nToday, Greater Cairo is the centre for many government offices governing the Egyptian educational system, has the largest number of educational schools, and higher learning institutes among other cities and governorates of Egypt.\n\nSome of the International Schools found in Cairo:\n\nUniversities in Greater Cairo:\n\nTransportation\n\nCairo has an extensive road network, rail system, subway system and maritime services. Road transport is facilitated by personal vehicles, taxi cabs, privately owned public buses and Cairo microbuses. Cairo, specifically Ramses Square, is the centre of almost the entire Egyptian transportation network.\n\nThe subway system, officially called \"Metro (مترو)\", is a fast and efficient way of getting around Cairo. Metro network covers Helwan and other suburbs. It can get very crowded during rush hour. Two train cars (the fourth and fifth ones) are reserved for women only, although women may ride in any car they want.\n\nTrams in Greater Cairo (Heliopolis and Nasr City) exists now, while Cairo trolleybus was closed.\n\nAn extensive road network connects Cairo with other Egyptian cities and villages. There is a new Ring Road that surrounds the outskirts of the city, with exits that reach outer Cairo districts. There are flyovers and bridges, such as the Sixth of October bridge that, when the traffic is not heavy, allow fast means of transportation from one side of the city to the other.\n\nCairo traffic is known to be overwhelming and overcrowded. Traffic moves at a relatively fluid pace. Drivers tend to be aggressive, but are more courteous at junctions, taking turns going, with police aiding in traffic control of some congested areas.\n\nOther forms of transport\n\n* Cairo International Airport\n* Ramses Railway Station\n* Cairo Tram\n* Cairo Transportation Authority CTA\n* Cairo Taxi/Yellow Cab\n* Cairo Metro\n* Cairo Nile Ferry\n\nSports\n\nFootball is the most popular sport in Egypt, and Cairo has a number of sporting teams that compete in national and regional leagues. The best known teams are Al-Ahly, El Zamalek and Al-Ismaily. Al-Ahly and El Zamalek  annual football tournament is perhaps the most watched sports event in Egypt as well as the African-Arab region. Both teams are known as the \"rivals\" of Egyptian football, and are the first and the second champions in Africa and the Arab world. They play their home games at Cairo International Stadium or Naser Stadium, which is Egypt's 2nd largest stadium, Cairo's largest one and one of the largest stadiums in the world.\n\nThe Cairo International Stadium was built in 1960 and its multi-purpose sports complex that houses the main football stadium, an indoor stadium, several satellite fields that held several regional, continental and global games, including the African Games, U17 Football World Championship and was one of the stadiums scheduled that hosted the 2006 Africa Cup of Nations which was played in January 2006. Egypt later won the competition and went on to win the next edition In Ghana (2008) making the Egyptian and Ghanaian national teams the only teams to win the African Nations Cup Back to back which resulted in Egypt winning the title for a record number of six times in the history of African Continental Competition. This was followed by a third consecutive win in Angola 2010, making Egypt the only country with a record 3-consecutive and 7-total Continental Football Competition winner. This achievement had also placed the Egyptian football team as the #9 best team in the world's FIFA rankings.\n\nCairo failed at the applicant stage when bidding for the 2008 Summer Olympic Games, which was hosted in Beijing, China. However, Cairo did host the 2007 Pan Arab Games.\n\nThere are several other sports teams in the city that participate in several sports including el Gezira Sporting Club, el Shams Club, el Seid Club, Heliopolis Club and several smaller clubs, but the biggest clubs in Egypt (not in area but in sports) are Al Ahly and Al Zamalek. They have the two biggest football teams in Egypt. There are new sports clubs in the area of New Cairo (one hour far from Cairo's down town), these are Al Zohour sporting club, Wadi Degla sporting club and Platinum Club.\n\nMost of the sports federations of the country are also located in the city suburbs, including the Egyptian Football Association. The headquarters of the Confederation of African Football (CAF) was previously located in Cairo, before relocating to its new headquarters in 6 October City, a small city away from Cairo's crowded districts.\n\nIn October 2008, the Egyptian Rugby Federation was officially formed and granted membership into the International Rugby Board.\n\nEgypt is internationally known for the excellence of its squash players who excel in both professional and junior divisions. Egypt currently has seven players in the top ten of the PSA men’s world rankings, and three in the women’s top ten. Mohamed El Shorbagy held the world number one position for more than a year before being overtaken by compatriot Karim Abdel Gawad, who is currently number two behind Gregory Gaultier of France. Ramy Ashour and Amr Shabana are regarded as two of the most talented squash players in history. Shabana won the World Open title four times and Ashour twice, although his recent form has been hampered by injury. Egypt’s Nour El Sherbini has won the Women’s World Championship twice and has been women’s world number one for 16 consecutive months. On 30 April 2016, she became the youngest woman to win the Women's World Championship which was held in Malaysia. On April 2017 she retained her title by winning the Women's World Championship which was held in the Egyptian resort of El Gouna.\n\nCulture\n\nIn 2017 Cairo was voted the most dangerous megacity for women with more than 10 million inhabitants in a poll by Thomson Reuters Foundation. Harassment was described as occurring on a daily basis.\n\nCultural tourism in Egypt \n\nCairo Opera House\n\nPresident Mubarak inaugurated the new Cairo Opera House of the Egyptian National Cultural Centres on 10 October 1988, 17 years after the Royal Opera House had been destroyed by fire. The National Cultural Centre was built with the help of JICA, the Japan International Co-operation Agency and stands as a prominent feature for the Japanese-Egyptian co-operation and the friendship between the two nations.\n\nKhedivial Opera House\n\nThe Khedivial Opera House, or Royal Opera House, was the original opera house in Cairo. It was dedicated on 1 November 1869 and burned down on 28 October 1971. After the original opera house was destroyed, Cairo was without an opera house for nearly two decades until the opening of the new Cairo Opera House in 1988.\n\nCairo International Film Festival\n\nCairo held its first international film festival 16 August 1976, when the first Cairo International Film Festival was launched by the Egyptian Association of Film Writers and Critics, headed by Kamal El-Mallakh. The Association ran the festival for seven years until 1983.\n\nThis achievement lead to the President of the Festival again contacting the FIAPF with the request that a competition should be included at the 1991 Festival. The request was granted.\n\nIn 1998, the Festival took place under the presidency of one of Egypt's leading actors, Hussein Fahmy, who was appointed by the Minister of Culture, Farouk Hosni, after the death of Saad El-Din Wahba. Four years later, the journalist and writer Cherif El-Shoubashy became president.\n\nCairo Geniza\n\nThe Cairo Geniza is an accumulation of almost 200,000 Jewish manuscripts that were found in the genizah of the Ben Ezra synagogue (built 882) of Fustat, Egypt (now Old Cairo), the Basatin cemetery east of Old Cairo, and a number of old documents that were bought in Cairo in the later 19th century. These documents were written from about 870 to 1880 AD and have been archived in various American and European libraries. The Taylor-Schechter collection in the University of Cambridge runs to 140,000 manuscripts, a further 40,000 manuscripts are at the Jewish Theological Seminary of America.\n\nReligion\n\nMost residents are Sunni Muslim, while the rest of the population is mostly Christian. Al-Azhar University, based in Cairo, is considered the leading authority of Sunni Islam worldwide. Most Christians are Coptic Orthodox. Until his death in March 2012, Pope Shenouda III of Alexandria was the leader of the Coptic Orthodox Church, followed by Pope Tawadros II who became Pope on 18 November 2012, whose residence is in Cairo. Cairo has several synagogues, but few Jews remain after Israel was established and the subsequent exodus, largely due to state sponsored discrimination. Tension between members of different religions has increased recently.\n\nEconomy\n\nCairo accounts for 11% of Egypt's population and 22% of its economy (PPP). The majority of the nation's commerce is generated there, or passes through the city. The great majority of publishing houses and media outlets and nearly all film studios are there, as are half of the nation's hospital beds and universities. This has fueled rapid construction in the city—one building in five is less than 15 years old.\n\nThis growth until recently surged well ahead of city services. Homes, roads, electricity, telephone and sewer services were all in short supply. Analysts trying to grasp the magnitude of the change coined terms like \"hyper-urbanization\".\n\nCairo's automobile assembler and manufacturer\n\n* Arab American Vehicles Company\n* Egyptian Light Transport Manufacturing Company (Egyptian NSU pedant)\n* Ghabbour Group (Fuso, Hyundai and Volvo)\n* MCV Corporate Group (a part of the Daimler AG)\n* Mod Car\n* Seoudi Group (Modern Motors: Nissan, BMW (formerly); El-Mashreq: Alfa Romeo and Fiat)\n* Speranza (former Daewoo Motors Egypt; Chery, Daewoo)\n* General Motors Egypt\n\nHistorical sites and landmarks\n\nFor a complete list, see Visitor attractions in Cairo, list of mosques\n\nTahrir Square\n\nTahrir Square was founded during the mid 19th century with the establishment of modern downtown Cairo. It was first named Ismailia Square, after the 19th-century ruler Khedive Ismail, who commissioned the new downtown district's 'Paris on the Nile' design. After the Egyptian Revolution of 1919 the square became widely known as Tahrir (Liberation) Square, though it was not officially renamed as such until after the 1952 Revolution which eliminated the monarchy. Several notable buildings surround the square including, the American University in Cairo's downtown campus, the Mogamma governmental administrative Building, the headquarters of the Arab League, the Nile Ritz Carlton Hotel, and the Egyptian Museum. Being at the heart of Cairo, the square witnessed several major protests over the years. However, the most notable event in the square was being the focal point of the 2011 Egyptian Revolution against former president Hosni Mubarak.\n\nEgyptian Museum\n\nThe Museum of Egyptian Antiquities, known commonly as the Egyptian Museum, is home to the most extensive collection of ancient Egyptian antiquities in the world. It has 136,000 items on display, with many more hundreds of thousands in its basement storerooms. Among its most famous collections on display are the finds from the Tomb of Tutankhamun.\n\nCairo Tower\n\nThe Cairo Tower is a free-standing tower with a revolving restaurant at the top. It provides a bird's eye view of Cairo to the restaurant patrons. It stands in the Zamalek district on Gezira Island in the Nile River, in the city centre. At 187 m, it is 44 m higher than the Great Pyramid of Giza, which stands some 15 km to the southwest.\n\nOld Cairo\n\nThis area of Cairo is so-named as it contains the remains of the ancient Roman fortress of Babylon and also overlaps the original site of Fustat, the first Arab settlement in Egypt (7th century AD) and the predecessor of later Cairo. The area is also known as Coptic Cairo as it holds a high concentration of old Christian churches including the Hanging Church, the Greek Orthodox Church of St. George, and other Christian or Coptic buildings, most of which are located over the site of the ancient Roman fortress. It is also the location of the Coptic Museum, which showcases the history of Coptic art from Greco-Roman to Islamic times, and of the Ben Ezra Synagogue, the oldest and best-known synagogue in Cairo, where the important collection of Geniza documents were discovered in the 19th century.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 43. To the north of this Coptic enclave is the Amr ibn al-'As Mosque, the first mosque in Egypt and the most important religious center of former Fustat, founded in 642 AD right after the Arab conquest but rebuilt many times since.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 39.\n\nIslamic Cairo\n\nCairo holds one of the greatest concentrations of historical monuments of Islamic architecture in the world.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press. The areas around the old walled city and around the Citadel are characterized by hundreds of mosques, tombs, madrasas, mansions, caravanserais, and fortifications dating from the Islamic era and are often referred to as \"Islamic Cairo\", especially in English travel literature.e.g. O'Neill, Zora et al. 2012. Lonely Planet: Egypt (11th edition). It is also the location of several important religious shrines such as the al-Hussein Mosque (whose shrine is believed to hold the head of Husayn ibn Ali), the Mausoleum of Imam al-Shafi'i (founder of the Shafi'i madhhab, one of the primary schools of thought in Sunni Islamic jurisprudence), the Tomb of Sayyida Ruqayya, the Mosque of Sayyida Nafisa, and others.\n\nWhile the first mosque in Egypt was the Mosque of Amr ibn al-As in Fustat, the Mosque of Ibn Tulun is the oldest mosque to retain its original form and is a rare example of Abbasid architecture, from the classical period of Islamic civilization. It was built in 876–879 AD in a style inspired by the Abbasid capital of Samarra in Iraq.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, pp. 50–54. It is one of the largest mosques in Cairo and is often cited as one of the most beautiful.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p 50.O'Neill, Zora et al. 2012. Lonely Planet: Egypt (11th edition), p. 87.  Another Abbasid construction, the Nilometer on Rhoda Island, is the oldest original structure in Cairo, built in 862 AD. It was designed to measure the level of the Nile, which was important for agricultural and administrative purposes.Yeomans, Richard. 2006. The Art and Architecture of Islamic Cairo. Garnet Publishing, p 29.\n\nThe city named Cairo (Arabic: al-Qahira) was founded to the northeast of Fustat in 959 AD by the victorious Fatimid army. The Fatimids built a separate palatial city which contained their palaces and institutions of government. It was enclosed by a circuit of walls, which were rebuilt in stone in the late 11th century AD by the vizir Badr al-Gamali,Raymond, André. 1993. Le Caire. Fayard, p. 62. parts of which survive today at Bab Zuwayla in the south and Bab al-Futuh and Bab al-Nasr in the north.\n\nOne of the most important and lasting institutions founded in the Fatimid period was the Mosque of al-Azhar, founded in 970 AD, which competes with the Qarawiyyin in Fes for the title of oldest university in the world.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 169. Today, al-Azhar University is the foremost center of Islamic learning in the world and one of Egypt's largest universities with campuses across the country. The mosque itself retains significant Fatimid elements but has been added to and expanded in subsequent centuries, notably by the Mamluk sultans Qaitbay and al-Ghuri and by Abd al-Rahman Katkhuda in the 18th century.\n\nOther extant monuments from the Fatimid era include the large Mosque of al-Hakim, the al-Aqmar mosque, Juyushi Mosque, Lulua Mosque, and the Mosque of Salih Tala'i.\n\nThe most prominent architectural heritage of medieval Cairo, however, dates from the Mamluk period, from 1250 to 1517 AD. The Mamluk sultans and elites were eager patrons of religious and scholarly life, commonly building religious or funerary complexes whose functions could include a mosque, madrasa, khanqah (for Sufis), a sabil (water dispensary), and mausoleum for themselves and their families.Behrens-Abouseif, Doris. 2007. Cairo of the Mamluks: A History of Architecture and its Culture. Cairo: The American University in Cairo Press.\nAmong the best-known examples of Mamluk monuments in Cairo are the huge Mosque-Madrasa of Sultan Hasan, the Mosque of Amir al-Maridani, the Mosque of Sultan al-Mu'ayyad (whose twin minarets were built above the gate of Bab Zuwayla), the Sultan Al-Ghuri complex, the funerary complex of Sultan Qaytbay in the Northern Cemetery, and the trio of monuments in the Bayn al-Qasrayn area comprising the complex of Sultan al-Mansur Qalawun, the Madrasa of al-Nasir Muhammad, and the Madrasa of Sultan Barquq. It is said that a lot of the columns found in mosques were taken from the Coptic churches because of their beautiful artistic carvings and placed in mosques.\n\nThe Mamluks, and the later Ottomans, also built wikalas or caravanserais to house merchants and goods due to the important role of trade and commerce in Cairo's economy.Raymond, André. 1993. Le Caire. Fayard, pp. 90–97. The most famous example still intact today is the Wikala al-Ghuri, which nowadays also hosts regular performances by the Al-Tannoura Egyptian Heritage Dance Troupe.O'Neill, Zora et al. 2012. Lonely Planet: Egypt (11th edition), p. 81. The famous Khan al-Khalili (see below) is a commercial hub which also integrated caravanserais (also known as khans).\n\nFile:Kairo Ibn Tulun Moschee BW 5.jpg|Ibn Tulun Mosque, courtyard and minaret\nFile:Flickr - HuTect ShOts - Masjid of Sultan Hassan مسجد ومدرسة السلطان حسن - Cairo - Egypt - 28 05 2010 (2).jpg|The courtyard of the Sultan Hassan mosque-madrasa.\nFile:Bab Zuwayla Cairo 12 0864.jpg|Bab Zuweila, a Fatimid gate with the Mamluk minarets of the Mosque of Sultan al-Mu'ayyad on top.\nFile:Al-Ghuri Complex 0930.JPG|Sultan al-Ghuri complex, with mausoleum and khanqah on the left, and madrasa on the right.\nFile:Dome of Qaytbay complex.jpg|The dome of Sultan Qaytbay's mausoleum.\nFile:Bayn al-Qasrayn2.JPG|The Qalawun mausoleum complex at Bayn al-Qasrayn.\nFile:Khan el khalili.jpg|A medieval gate, Bab al-Ghuri, in the Khan El-Khalili market.\n\nCitadel of Cairo\n\nThe Citadel is a fortified enclosure begun by Salah al-Din in 1176 AD on an outcrop of the Muqattam Hills as part of a large defensive system to protect both Cairo to the north and Fustat to the southwest. It was the center of Egyptian government and residence of its rulers until 1874, when Khedive Isma'il moved to 'Abdin Palace.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 221. It is still occupied by the military today, but is now open as a tourist attraction comprising, notably, the National Military Museum, the 14th century Mosque of al-Nasir Muhammad, and the 19th century Mosque of Muhammad Ali which commands a dominant position on Cairo's skyline.\nKhan El-Khalili\n\nKhan el-Khalili is an ancient bazaar, or marketplace adjacent to the Al-Hussein Mosque. It dates back to 1385, when Amir Jarkas el-Khalili built a large caravanserai, or khan. (A caravanserai is a hotel for traders, and usually the focal point for any surrounding area.) This original carvanserai building was demolished by Sultan al-Ghuri, who rebuilt it as a new commercial complex in the early 16th century, forming the basis for the network of souqs existing today.Raymond, André. 1993. Le Caire. Fayard, pp. 179. Many medieval elements remain today, including the ornate Mamluk-style gateways.Williams, Caroline. 2008 (6th ed.). Islamic Monuments in Cairo: The Practical Guide. Cairo: American University in Cairo Press, p. 179. Today, the Khan el-Khalili is a major tourist attraction and popular stop for tour groups.O'Neill, Zora et al. 2012. Lonely Planet: Egypt (11th edition), p. 74-75.\n\nPollution\n\nCairo is an expanding city, which has led to many environmental problems. The air pollution in Cairo is a matter of serious concern. Greater Cairo's volatile aromatic hydrocarbon levels are higher than many other similar cities. Air quality measurements in Cairo have also been recording dangerous levels of lead, carbon dioxide, sulphur dioxide, and suspended particulate matter concentrations due to decades of unregulated vehicle emissions, urban industrial operations, and chaff and trash burning. There are over 4,500,000 cars on the streets of Cairo, 60% of which are over 10 years old, and therefore lack modern emission cutting features like catalytic converters. Cairo has a very poor dispersion factor because of lack of rain and its layout of tall buildings and narrow streets, which create a bowl effect.\nIn recent years, a mysterious black cloud (as Egyptians refer to it) appeared over Cairo every autumn and causes serious respiratory diseases and eye irritations for the city's citizens. Tourists who are not familiar with such high levels of pollution must take extra care.\n\nCairo also has many unregistered lead and copper smelters which heavily pollute the city. The results of this has been a permanent haze over the city with particulate matter in the air reaching over three times normal levels. It is estimated that 10,000 to 25,000 people a year in Cairo die due to air pollution-related diseases. Lead has been shown to cause harm to the central nervous system and neurotoxicity particularly in children. In 1995, the first environmental acts were introduced and the situation has seen some improvement with 36 air monitoring stations and emissions tests on cars. Twenty thousand buses have also been commissioned to the city to improve congestion levels, which are very high.\n\nThe city also suffers from a high level of land pollution. Cairo produces 10,000 tons of waste material each day, 4,000 tons of which is not collected or managed. This once again is a huge health hazard and the Egyptian Government is looking for ways to combat this. The Cairo Cleaning and Beautification Agency was founded to collect and recycle the waste; however, they also work with the Zabbaleen (or Zabaleen), a community that has been collecting and recycling Cairo's waste since the turn of the 20th century and live in an area known locally as Manshiyat naser. Both are working together to pick up as much waste as possible within the city limits, though it remains a pressing problem.\n\nThe city also suffers from water pollution as the sewer system tends to fail and overflow. On occasion, sewage has escaped onto the streets to create a health hazard. This problem is hoped to be solved by a new sewer system funded by the European Union, which could cope with the demand of the city. The dangerously high levels of mercury in the city's water system has global health officials concerned over related health risks.\n\nInternational relations\n\nNotable people\n\n* Naguib Mahfouz (1911–2006), novelist, Nobel Prize in Literature in 1988\n* Abu Sa'id al-Afif, 15th century Samaritan\n* Yasser Arafat (1929–2004), founder and first president of the Palestine Liberation Organization\n* Boutros Boutros-Ghali (1922–2016), former Secretary-General of the United Nations\n* Dalida (1933–1987), Italian-Egyptian singer who lived most of her life in France, received 55 golden records and was the first singer to receive a diamond disc\n* Mohamed ElBaradei (born 1942), former Director General of the International Atomic Energy Agency, 2005 Nobel Peace Prize laureate\n* Dorothy Hodgkin (1910–1994), British chemist, credited with the development of protein crystallography, Nobel Prize in Chemistry in 1964\n* Yakub Kadri Karaosmanoğlu (1889–1974), Turkish novelist\n* Roland Moreno (1945–2012), French inventor, engineer, humorist and author who invented the smart card\n* Gaafar Nimeiry (1930–2009), President of the Sudan\n* Ahmed Sabri (1889–1955) painter\n* Naguib Sawiris (born 1954), 62nd richest person on earth in 2007 list of billionaires, reaching US$10.0 billion with his company Orascom Telecom Holding\n* Sir Magdi Yacoub (born 1935), British-Egyptian cardiothoracic surgeon. Cairo. http://en.wikipedia.org/?curid=6293."
  }
}
