{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19930",
  "eid" : "3ed71720-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778614674,
  "textBody" : "In  poetry, metre is the basic rhythmic structure of a verse or lines in verse.  Many traditional verse forms prescribe a specific verse metre, or a certain set of metres alternating in a particular order. The study and the actual use of metres and forms of versification are both known as prosody. (Within linguistics, \"prosody\" is used in a more general sense that includes not only poetic metre but also the rhythmic aspects of prose, whether formal or informal, that vary from language to language, and sometimes between poetic traditions.)\n\nCharacteristics\n\nAn assortment of features can be identified when classifying poetry and its metre.\n\nQualitative versus quantitative metre\n\nThe metre of most poetry of the Western world and elsewhere is based on patterns of syllables of particular types. The familiar type of metre in English-language poetry is called qualitative metre, with stressed syllables coming at regular intervals (e.g. in iambic pentameters, usually every even-numbered syllable). Many Romance languages use a scheme that is somewhat similar but where the position of only one particular stressed syllable (e.g. the last) needs to be fixed. The metre of the old Germanic poetry of languages such as Old Norse and Old English was radically different, but was still based on stress patterns.\n\nSome classical languages, in contrast, used a different scheme known as quantitative metre, where patterns were based on syllable weight rather than stress. In the dactylic hexameters of Classical Latin and Classical Greek, for example, each of the six feet making up the line was either a dactyl (long-short-short) or a spondee (long-long): a \"long syllable\" was literally one that took longer to pronounce than a short syllable: specifically, a syllable consisting of a long vowel or diphthong or followed by two consonants. The stress pattern of the words made no difference to the metre. A number of other ancient languages also used quantitative metre, such as Sanskrit and Classical Arabic (but not Biblical Hebrew).\n\nFinally, non-stressed languages that have little or no differentiation of syllable length, such as French or Chinese, base their verses on the number of syllables only. The most common form in French is the Alexandrine, with twelve syllables a verse, and in classical Chinese five characters, and thus five syllables. But since each Chinese character is pronounced using one syllable in a certain tone, classical Chinese poetry also had more strictly defined rules, such as parallelism or antithesis between lines.\n\nFeet\n\nIn many Western classical poetic traditions, the metre of a verse can be described as a sequence of feet, each foot being a specific sequence of syllable types — such as relatively unstressed/stressed (the norm for English poetry) or long/short (as in most classical Latin and Greek poetry).\n\nIambic pentameter, a common metre in English poetry, is based on a sequence of five iambic feet or iambs, each consisting of a relatively unstressed syllable (here represented with \"×\" above the syllable) followed by a relatively stressed one (here represented with \"/\" above the syllable) — \"da-DUM\" = \"× /\" :\n\n ×  /   ×   /   ×    /      ×  /     ×   /\nSo long as men can breathe, or eyes can see,\n ×  /    ×      /   ×     /   ×     /    ×   /\nSo long lives this, and this gives life to thee.\n\nThis approach to analyzing and classifying metres originates from Ancient Greek tragedians and poets such as Homer, Pindar, Hesiod, and Sappho.\n\nHowever some metres have an overall rhythmic pattern to the line that cannot easily be described using feet. This occurs in Sanskrit poetry; see Vedic metre and Sanskrit metre. (Although this poetry is in fact specified using feet, each \"foot\" is more or less equivalent to an entire line.) It also occurs in some Western metres, such as the hendecasyllable favoured by Catullus and Martial, which can be described as:\n\nx x — ∪ ∪ — ∪ — ∪ — —\n\n(where \"—\" long, \"∪\" \n short, and \"x x\" can be realized as \"— ∪\" or \"— —\" or \"∪ —\")\n\nClassification\n\nIf the line has only one foot, it is called a monometer; two feet, dimeter; three is trimeter; four is tetrameter; five is pentameter; six is hexameter, seven is heptameter and eight is octameter. For example, if the feet are iambs, and if there are five feet to a line, then it is called a iambic pentameter. If the feet are primarily dactyls and there are six to a line, then it is a dactylic hexameter.\n\nCaesura\n\nSometimes a natural pause occurs in the middle of a line rather than at a line-break.  This is a caesura (cut).  A good example is from The Winter's Tale by William Shakespeare; the caesurae are indicated by '/':\n\nIt is for you we speak, / not for ourselves:\nYou are abused / and by some putter-on\nThat will be damn'd for't; / would I knew the villain,\nI would land-damn him. / Be she honour-flaw'd,\nI have three daughters; / the eldest is eleven\n\nIn Latin and Greek poetry, a caesura is a break within a foot caused by the end of a word.\n\nEach line of traditional Germanic alliterative verse is divided into two half-lines by a caesura. This can be seen in Piers Plowman:\n\nA fair feeld ful of folk / fond I ther bitwene—\nOf alle manere of men / the meene and the riche,\nWerchynge and wandrynge / as the world asketh.\nSomme putten hem to the plough / pleiden ful selde,\nIn settynge and sowynge / swonken ful harde,\nAnd wonnen that thise wastours / with glotonye destruyeth.\n\nEnjambment\n\nBy contrast with caesura, enjambment is incomplete syntax at the end of a line; the meaning runs over from one poetic line to the next, without terminal punctuation.  Also from Shakespeare's The Winter's Tale:\n\nI am not prone to weeping, as our sex\nCommonly are; the want of which vain dew\nPerchance shall dry your pities; but I have\nThat honourable grief lodged here which burns\nWorse than tears drown.\n\nMetric variations\n\nPoems with a well-defined overall metric pattern often have a few lines that violate that pattern. A common variation is the inversion of a foot, which turns an iamb (\"da-DUM\") into a trochee (\"DUM-da\"). Another common variation is a headless verse, which lacks the first syllable of the first foot.  Yet a third variation is catalexis, where the end of a line is shortened by a foot, or two or part thereof - an example of this is at the end of each verse in Keats' 'La Belle Dame sans Merci':\n\nAnd on thy cheeks a fading rose (4 feet)\nFast withereth too  (2 feet)\n\nIn various languages\n\nSanskrit\n\nVersification in Classical Sanskrit poetry is of three kinds.\n\n#Syllabic verse (akṣaravṛtta): metres depend on the number of syllables in a verse, with relative freedom in the distribution of light and heavy syllables. This style is derived from older Vedic forms, and found in the great epics, the Mahabharata and the Ramayana.\n#Syllabo-quantitative verse (varṇavṛtta): metres depend on syllable count, but the light-heavy patterns are fixed.\n#Quantitative verse (mātrāvṛtta): metres depend on duration, where each verse-line has a fixed number of morae, usually grouped in sets of four.\n\nStandard traditional works on metre are Pingala's Chandaḥśāstra and Kedāra's Vṛttaratnākara. The most exhaustive compilations, such as the modern ones by Patwardhan and Velankar contain over 600 metres. This is a substantially larger repertoire than in any other metrical tradition.\n\nGreek and Latin\n\nThe metrical \"feet\" in the classical languages were based on the length of time taken to pronounce each syllable, which were categorized according to their weight as either \"long\" syllables or \"short\" syllables (indicated as dum and di below).  These are also called \"heavy\" and \"light\" syllables, respectively, to distinguish from long and short vowels. The foot is often compared to a musical measure and the long and short syllables to whole notes and half notes. In English poetry, feet are determined by emphasis rather than length, with stressed and unstressed syllables serving the same function as long and short syllables in classical metre.\n\nThe basic unit in Greek and Latin prosody is a mora, which is defined as a single short syllable.  A long syllable is equivalent to two morae.  A long syllable contains either a long vowel, a diphthong, or a short vowel followed by two or more consonants.  Various rules of elision sometimes prevent a grammatical syllable from making a full syllable, and certain other lengthening and shortening rules (such as correption) can create long or short syllables in contexts where one would expect the opposite.\n\nThe most important Classical metre is the dactylic hexameter, the metre of Homer and Virgil.  This form uses verses of six feet.  The word dactyl comes from the Greek word daktylos meaning finger, since there is one long part followed by two short stretches. The first four feet are dactyls (daa-duh-duh), but can be spondees (daa-daa).  The fifth foot is almost always a dactyl. The sixth foot is either a spondee or a trochee (daa-duh).  The initial syllable of either foot is called the ictus, the basic \"beat\" of the verse.  There is usually a caesura  after the ictus of the third foot.  The opening line of the Æneid is a typical line of dactylic hexameter:\n\nArmă vĭ | rumquĕ că | nō, Troi | ae quī | prīmŭs ăb | ōrīs\n(\"I sing of arms and the man, who first from the shores of Troy...\")\n\nIn this example, the first and second feet are dactyls; their first syllables, \"Ar\" and \"rum\" respectively, contain short vowels, but count as long because the vowels are both followed by two consonants. The third and fourth feet are spondees, the first of which is divided by the main caesura of the verse. The fifth foot is a dactyl, as is nearly always the case. The final foot is a spondee.\n\nThe dactylic hexameter was imitated in English by Henry Wadsworth Longfellow in his poem Evangeline:\n\nThis is the forest primeval. The murmuring pines and the hemlocks,\nBearded with moss, and in garments green, indistinct in the twilight,\nStand like Druids of old, with voices sad and prophetic,\nStand like harpers hoar, with beards that rest on their bosoms.\n\nNotice how the first line:\nThis is the | for-est pri | me-val.  The | mur-muring | pines and the | hem-locks\n\nFollows this pattern:\ndum diddy | dum diddy | dum diddy | dum diddy | dum diddy | dum dum\n\nAlso important in Greek and Latin poetry is the dactylic pentameter.  This was a line of verse, made up of two equal parts, each of which contains two dactyls followed by a long syllable, which counts as a half foot. In this way, the number of feet amounts to five in total. Spondees can take the place of the dactyls in the first half, but never in the second.  The long syllable at the close of the first half of the verse always ends a word, giving rise to a caesura.\n\nDactylic pentameter is never used in isolation.  Rather, a line of dactylic pentameter follows a line of dactylic hexameter in the elegiac distich or elegiac couplet, a form of verse that was used for the composition of elegies and other tragic and solemn verse in the Greek and Latin world, as well as love poetry that was sometimes light and cheerful.  An example from Ovid's Tristia:\n\nVergĭlĭ | um vī | dī tan | tum, nĕc ă | māră Tĭ | bullō\n:Tempŭs ă | mīcĭtĭ | ae || fātă dĕ | dērĕ mĕ | ae.\n\n(\"Virgil I merely saw, and the harsh Fates gave Tibullus no time for my friendship.\")\n\nThe Greeks and Romans also used a number of lyric metres, which were typically used for shorter poems than elegiacs or hexameter.  In Aeolic verse, one important line was called the hendecasyllabic, a line of eleven syllables.  This metre was used most often in the Sapphic stanza, named after the Greek poet Sappho, who wrote many of her poems in the form.  A hendecasyllabic is a line with a never-varying structure: two trochees, followed by a dactyl, then two more trochees.  In the Sapphic stanza, three hendecasyllabics are followed by an \"Adonic\" line, made up of a dactyl and a trochee.  This is the form of Catullus 51 (itself an homage to Sappho 31):\n\nIllĕ mī pār essĕ dĕō vĭdētur;\nillĕ, sī fās est, sŭpĕrārĕ dīvōs,\nquī sĕdēns adversŭs ĭdentĭdem tē\n:spectăt ĕt audit\n\n(\"He seems to me to be like a god; if it is permitted, he seems above the gods, who sitting across from you gazes at you and hears you again and again.\")\n\nThe Sapphic stanza was imitated in English by Algernon Charles Swinburne in a poem he simply called Sapphics:\n\nSaw the white implacable Aphrodite,\nSaw the hair unbound and the feet unsandalled\nShine as fire of sunset on western waters;\n:Saw the reluctant...\n\nClassical Arabic\n\nThe metrical system of Classical Arabic poetry, like those of classical Greek and Latin, is based on the weight of syllables classified as either \"long\" or \"short\". The basic principles of Arabic poetic metre Arūḍ or Arud ( ') Science of Poetry ( '), were put forward by Al-Farahidi (786 - 718 AD) who did so after noticing that poems consisted of repeated syllables in each verse. In his first book, Al-Ard ( '), he described 15 types of verse. Al-Akhfash described one extra, the 16th.\n\nA short syllable contains a short vowel with no following consonants. For example, the word kataba, which syllabifies as ka-ta-ba, contains three short vowels and is made up of three short syllables. A long syllable contains either a long vowel or a short vowel followed by a consonant as is the case in the word maktūbun which syllabifies as mak-tū-bun. These are the only syllable types possible in Classical Arabic phonology which, by and large, does not allow a syllable to end in more than one consonant or a consonant to occur in the same syllable after a long vowel. In other words, syllables of the type -āk- or -akr- are not found in classical Arabic.\n\nEach verse consists of a certain number of metrical feet (tafāʿīl or ʾaǧzāʾ) and a certain combination of possible feet constitutes a metre (baḥr).\n\nThe traditional Arabic practice for writing out a poem's metre is to use a concatenation of various derivations of the verbal root F-ʿ-L (فعل). Thus, the following hemistich\n\nقفا نبك من ذكرى حبيبٍ ومنزلِ\n\nWould be traditionally scanned as:\n\nفعولن مفاعيلن فعولن مفاعلن\n\nThat is, Romanized and with traditional Western scansion:\n\n Western:   u –  –  u  –   –  –  u – –   u  –  u –\n Verse:    Qifā nabki min ḏikrā ḥabībin wa-manzili\n Mnemonic:  fa`ūlun  mafā`īlun  fa`ūlun  mafā`ilun\n\nThe Arabic metres\n\nClassical Arabic has sixteen established metres. Though each of them allows for a certain amount of variation, their basic patterns are as follows, using:\n* \"–\" for 1 long syllable\n* \"u\" for 1 short syllable\n* \"x\" for a position that can contain 1 long or 1 short\n* \"o\" for a position that can contain 1 long or 2 shorts\n* \"S\" for a position that can contain 1 long, 2 shorts, or 1 long + 1 short\n\nClassical Persian\n\nThe terminology for metrical system used in classical and classical-style Persian poetry is the same as that of Classical Arabic, even though these are quite different in both origin and structure. This has led to serious confusion among prosodists, both ancient and modern, as to the true source and nature of the Persian meters, the most obvious error being the assumption that they were copied from Arabic.\n\nPersian poetry is quantitative, and the metrical patterns are made of long and short syllables, much as in Classical Greek, Latin and Arabic. Anceps positions in the line, however, that is places where either a long or short syllable can be used (marked \"x\" in the schemes below), are not found in Persian verse except in some metres at the beginning of a line.\n\nPersian poetry is written in couplets, with each half-line (hemistich) being 10-14 syllables long. Except in the ruba'i (quatrain), where either of two very similar metres may be used, the same metre is used for every line in the poem. Rhyme is always used, sometimes with double rhyme or internal rhymes in addition. In some poems, known as masnavi, the two halves of each couplet rhyme, with a scheme aa, bb, cc and so on. In lyric poetry, the same rhyme is used throughout the poem at the end of each couplet, but except in the opening couplet, the two halves of each couplet do not rhyme; hence the scheme is aa, ba, ca, da. A ruba'i (quatrain) also usually has the rhyme aa, ba.\n\nA particular feature of classical Persian prosody, not found in Latin, Greek or Arabic, is that instead of two lengths of syllables (long and short), there are three lengths (short, long, and overlong). Overlong syllables can be used anywhere in the line in place of a long + a short, or in the final position in a line or half line.Elwell-Sutton, L.P. The Persian Metres (1976).Hayes, Bruce (1979) [http://linguistics.ucla.edu/people/hayes/papers/HayesRhythmicStructureOfPersianVerse1979.pdf \"The rhythmic sructure of Persian verse\"] Edebiyat 4:193-242, p. When a metre has a pair of short syllables (u u), it is common for a long syllable to be substituted, especially at the end of a line or half-line.\n\nAbout 30 different metres are commonly used in Persian. 70% of lyric poems are written in one of the following seven metres:Elwell-Sutton (1976) The Persian Metres, p. 162.\n*u – u – u u – – u – u – u u –\n*– – u – u – u u – – u – u –\n*– u – – – u – – – u – – – u –\n*x u – – u u – – u u – – u u – \n*x u – – u – u – u u – \n*u – – – u – – – u – – – u – – – \n*– – u u – – u u – – u u – –\n\nMasnavi poems (that is, long poems in rhyming couplets) are always written in one of the shorter 11 or 10-syllable metres (traditionally seven in number) such as the following:\n*u – – u – – u – – u – (e.g. Ferdowsi's Shahnameh)\n*u – – – u – – – u – – (e.g. Gorgani's Vis o Ramin)\n*– u – – – u – – – u – (e.g. Rumi's Masnavi-e Ma'navi)\n*– – u u – u – u – –  (e.g. Nezami's Leyli o Majnun)\n\nThe two metres used for ruba'iyat (quatrains), which are only used for this, are the following, of which the second is a variant of the first:\n*– – u u – – u u – – u u –\n*– – u u – u – u – – u u –\n\nClassical Chinese\n\nClassical Chinese poetic metric may be divided into fixed and variable length line types, although the actual scansion of the metre is complicated by various factors, including linguistic changes and variations encountered in dealing with a tradition extending over a geographically extensive regional area for a continuous time period of over some two-and-a-half millennia. Beginning with the earlier recorded forms: the Classic of Poetry tends toward couplets of four-character lines, grouped in rhymed quatrains; and, the Chuci follows this to some extent, but moves toward variations in line length. Han Dynasty poetry tended towards the variable line-length forms of the folk ballads and the Music Bureau yuefu. Jian'an poetry, Six Dynasties poetry, and Tang Dynasty poetry tend towards a poetic metre based on fixed-length lines of five, seven, (or, more rarely six) characters/verbal units tended to predominate, generally in couplet/quatrain-based forms, of various total verse lengths. The Song poetry is specially known for its use of the ci, using variable line lengths which follow the specific pattern of a certain musical song's lyrics, thus ci are sometimes referred to as \"fixed-rhythm\" forms. Yuan poetry metres continued this practice with their qu forms, similarly fixed-rhythm forms based on now obscure or perhaps completely lost original examples (or, ur-types). Not that Classical Chinese poetry ever lost the use of the shi forms, with their metrical patterns found in the \"old style poetry\" (gushi) and the regulated verse forms of (lüshi or jintishi). The regulated verse forms also prescribed patterns based upon linguistic tonality. The use of caesura is important in regard to the metrical analysis of Classical Chinese poetry forms.\n\nOld English\n\nThe metric system of Old English poetry was different from that of modern English, and related more to the verse forms of most of the older Germanic languages such as Old Norse. It used alliterative verse, a metrical pattern involving varied numbers of syllables but a fixed number (usually four) of strong stresses in each line.  The unstressed syllables were relatively unimportant, but the caesurae (breaks between the half-lines) played a major role in Old English poetry.\n\nIn place of using feet, alliterative verse divided each line into two half-lines.  Each half-line had to follow one of five or so patterns, each of which defined a sequence of stressed and unstressed syllables, typically with two stressed syllables per half line.  Unlike typical Western poetry, however, the number of unstressed syllables could vary somewhat.  For example, the common pattern \"DUM-da-DUM-da\" could allow between one and five unstressed syllables between the two stresses.\n\nThe following is a famous example, taken from The Battle of Maldon, a poem written shortly after the date of that battle (AD 991):\n\nHige sceal þe heardra, || heorte þe cēnre,\nmōd sceal þe māre, || swā ūre mægen lȳtlað\n\n(\"Will must be the harder, courage the bolder,\nspirit must be the more, as our might lessens.\")\n\nIn the quoted section, the stressed syllables have been underlined. (Normally, the stressed syllable must be long if followed by another syllable in a word.  However, by a rule known as syllable resolution, two short syllables in a single word are considered equal to a single long syllable.  Hence, sometimes two syllables have been underlined, as in hige and mægen.) The German philologist Eduard Sievers (died 1932) identified five different patterns of half-line in Anglo-Saxon alliterative poetry. The first three half-lines have the type A pattern \"DUM-da-(da-)DUM-da\", while the last one has the type C pattern \"da-(da-da-)DUM-DUM-da\", with parentheses indicating optional unstressed syllables that have been inserted.  Note also the pervasive pattern of alliteration, where the first and/or second stressed syllables alliterate with the third, but not with the fourth.\n\nModern English\n\nMost English metre is classified according to the same system as Classical metre with an important difference. English is an accentual language, and therefore beats and offbeats (stressed and unstressed syllables) take the place of the long and short syllables of classical systems. In most English verse, the metre can be considered as a sort of back beat, against which natural speech rhythms vary expressively. The most common characteristic feet of English verse are the iamb in two syllables and the anapest in three.  (See Foot (prosody) for a complete list of the metrical feet and their names.)\n\nMetrical systems\n\nThe number of metrical systems in English is not agreed upon. asserts that there is only one metre in English: Accentual-Syllabic.  The essay is reprinted in . The four major types. are: accentual verse, accentual-syllabic verse, syllabic verse and quantitative verse.  The alliterative verse of Old English could also be added to this list, or included as a special type of accentual verse. Accentual verse focuses on the number of stresses in a line, while ignoring the number of offbeats and syllables; accentual-syllabic verse focuses on regulating both the number of stresses and the total number of syllables in a line; syllabic verse only counts the number of syllables in a line; quantitative verse regulates the patterns of long and short syllables (this sort of verse is often considered alien to English).. It is to be noted, however, that the use of foreign metres in English is all but exceptional..\n\nFrequently-used metres\n\nThe most frequently encountered metre of English verse is the iambic pentameter, in which the metrical norm is five iambic feet per line, though metrical substitution is common and rhythmic variations practically inexhaustible. John Milton's Paradise Lost, most sonnets, and much else besides in English are written in iambic pentameter. Lines of unrhymed iambic pentameter are commonly known as blank verse.  Blank verse in the English language is most famously represented in the plays of William Shakespeare and the great works of Milton, though Tennyson (Ulysses, The Princess) and Wordsworth (The Prelude) also make notable use of it.\n\nA rhymed pair of lines of iambic pentameter make a heroic couplet, a verse form which was used so often in the 18th century that it is now used mostly for humorous effect (although see Pale Fire for a non-trivial case). The most famous writers of heroic couplets are Dryden and Pope.\n\nAnother important metre in English is the ballad metre, also called the \"common metre\", which is a four-line stanza, with two pairs of a line of iambic tetrameter followed by a line of iambic trimeter; the rhymes usually fall on the lines of trimeter, although in many instances the tetrameter also rhymes.  This is the metre of most of the Border and Scots or English ballads.  In hymnody it is called the \"common metre\", as it is the most common of the named hymn metres used to pair many hymn lyrics with melodies, such as Amazing Grace:The ballad metre commonality among a wide range of song lyrics allow words and music to be interchanged seamlessly between various songs, such as Amazing Grace, the Ballad of Gilligan's Isle, House of the Rising Sun, theme from the Mickey Mouse Club, and others.\n\nAmazing Grace! how sweet the sound\n:That saved a wretch like me;\nI once was lost, but now am found;\n:Was blind, but now I see.\n\nEmily Dickinson is famous for her frequent use of ballad metre:\n\nGreat streets of silence led away\nTo neighborhoods of pause —\nHere was no notice — no dissent —\nNo universe — no laws.\n\nFrench\n\nIn French poetry, metre is determined solely by the number of syllables in a line, because it is considered less important than rhymes.  A silent 'e' counts as a syllable before a consonant, but is elided before a vowel (where h aspiré counts as a consonant). At the end of a line, the \"e\" remains unelided but is hypermetrical (outside the count of syllables, like a feminine ending in English verse), in that case, the rhyme is also called \"feminine\", whereas it is called \"masculine\" in the other cases.\n\nThe most frequently encountered metre in Classical French poetry is the alexandrine, composed of two hemistiches of six syllables each. Two famous alexandrines are\n\nLa fille de Minos et de Pasiphaë\n:(Jean Racine)\n\n(the daughter of Minos and Pasiphae), and\nWaterloo ! Waterloo ! Waterloo ! Morne plaine!\n:(Victor Hugo)\n\n(Waterloo! Waterloo! Waterloo! Gloomy plain!)\n\nClassical French poetry also had a complex set of rules for rhymes that goes beyond how words merely sound. These are usually taken into account when describing the metre of a poem.\n\nSpanish\n\nIn Spanish poetry the metre is determined by the number of syllables the verse has. Still it is the phonetic accent in the last word of the verse that decides the final count of the line. If the accent of the final word is at the last syllable, then the poetic rule states that one syllable shall be added to the actual count of syllables in the said line, thus having a higher number of poetic syllables than the number of grammatical syllables. If the accent lies on the second to last syllable of the last word in the verse, then the final count of poetic syllables will be the same as the grammatical number of syllables. Furthermore, if the accent lies on the third to last syllable, then one syllable is subtracted from the actual count, having then less poetic syllables than grammatical syllables.\n\nSpanish poetry uses poetic licenses, unique to Romance languages, to change the number of syllables by manipulating mainly the vowels in the line.\n\nRegarding these poetic licenses one must consider three kinds of phenomena: (1) syneresis, (2) dieresis and (3) hiatus\n\nThere are many types of licenses, used either to add or subtract syllables, that may be applied when needed after taking in consideration the poetic rules of the last word. Yet all have in common that they only manipulate vowels that are close to each other and not interrupted by consonants.\n\nSome common metres in Spanish verse are:\n* Septenary: A line with seven poetic syllables\n* Octosyllable: A line with eight poetic syllables. This metre is commonly used in romances, narrative poems similar to English ballads, and in most proverbs.\n* Hendecasyllable: A line with eleven poetic syllables. This metre plays a similar role to pentameter in English verse.  It is commonly used in sonnets, among other things.\n* Alexandrine: A line consisting of fourteen syllables, commonly separated by two hemistiches of seven syllables each (In Anglo-Saxon or French contexts this term refers to twelve syllable lines, but not in the Spanish context).\n\nItalian\n\nIn Italian poetry, metre is determined solely by the position of the last accent in a line, the position of the other accents being however important for verse equilibrium. Syllables are enumerated with respect to a verse which ends with a paroxytone, so that a Septenary (having seven syllables) is defined as a verse whose last accent falls on the sixth syllable: it may so contain eight syllables (Ei fu. Siccome immobile) or just six (la terra al nunzio sta). Moreover, when a word ends with a vowel and the next one starts with a vowel, they are considered to be in the same syllable (synalepha): so Gli anni e i giorni consists of only four syllables (\"Gli an\" \"ni e i\" \"gior\" \"ni\"). Even-syllabic verses have a fixed stress pattern. Because of the mostly trochaic nature of the Italian language, verses with an even number of syllables are far easier to compose, and the Novenary is usually regarded as the most difficult verse.\n\nSome common metres in Italian verse are:\n* Sexenary: A line whose last stressed syllable is on the fifth, with a fixed stress on the second one as well (Al Re Travicello / Piovuto ai ranocchi, Giusti)\n* Septenary: A line whose last stressed syllable is the sixth one.\n* Octosyllable: A line whose last accent falls on the seventh syllable. More often than not, the secondary accents fall on the first, third and fifth syllable, especially in nursery rhymes for which this metre is particularly well-suited.\n* Hendecasyllable: A line whose last accent falls on the tenth syllable. It therefore usually consists of eleven syllables; there are various kinds of possible accentuations. It is used in sonnets, in ottava rima, and in many other types of poetry. The Divine Comedy, in particular, is composed entirely of hendecasyllables, whose main stress pattern is on the 4th and 10th syllable. \n\nTurkish\n\nApart from Ottoman poetry, which was heavily influenced by Persian traditionshttp://global.britannica.com/art/Turkish-literature and created a unique Ottoman style, traditional Turkish poetry features a system in which the number of syllables in each verse must be the same, most frequently 7, 8, 11, 14 syllables. These verses are then divided into syllable groups depending on the number of total syllables in a verse: 4+3 for 7 syllables, 4+4 or 5+3 for 8, 4+4+3 or 6+5 for 11 syllables. The end of each group in a verse is called a \"durak\" (stop), and must coincide with the last syllable of a word.\n\nThe following example is by Faruk Nafiz Çamlıbel (died 1973), one of the most devoted users of traditional Turkish metre:\n\nIn this poem the 6+5 metre is used, so that there is a word-break (durak = \"stop\" or caesura) after the sixth syllable of every line, as well as at the end of each line.\n\nOttoman Turkish\n\nIn the Ottoman Turkish language, the structures of the poetic foot (تفعل tef'ile) and of poetic metre (وزن vezin) were imitated from Persian poetry. About twelve of the commonest Persian metres were used for writing Turkish poetry. As was the case with Persian, no use at all was made of the commonest metres of Arabic poetry (the tawīl, basīt, kāmil, and wāfir).Deo, Ashwini; Kiparsky, Paul (2011). [https://u.osu.edu/deo.13/files//2015/06/DeoKiparsky2011-2fsd6ay.pdf \"Poetries in Contact: Arabic, Persian, and Urdu\"]. In Maria-Kristina Lotman and Mihhail Lotman ed. Proceedings of International Conference on Frontiers in Comparative Metrics, Estonia, pp. 147–173. (See p. 156 of the pdf). However, the terminology used to described the metres was indirectly borrowed from the Arabic poetic tradition through the medium of the Persian language.\n\nAs a result, Ottoman poetry, also known as Dîvân poetry, was generally written in quantitative, mora-timed metre. The moras, or syllables, are divided into three basic types:\n\n*Open, or light, syllables (açık hece) consist of either a short vowel alone, or a consonant followed by a short vowel\n**Examples: a-dam (\"man\"); zir-ve (\"summit, peak\")\n*Closed, or heavy, syllables (kapalı hece) consist of either a long vowel alone, a consonant followed by a long vowel, or a short vowel followed by a consonant\n**Examples: Â-dem (\"Adam\"); kâ-fir (\"non-Muslim\"); at (\"horse\")\n*Lengthened, or superheavy, syllables (meddli hece) count as one closed plus one open syllable and consist of a vowel followed by a consonant cluster, or a long vowel followed by a consonant\n**Examples: kürk (\"fur\"); âb (\"water\")\n\nIn writing out a poem's poetic metre, open syllables are symbolized by \".\" and closed syllables are symbolized by \"–\". From the different syllable types, a total of sixteen different types of poetic foot—the majority of which are either three or four syllables in length—are constructed, which are named and scanned as follows:\n\nThese individual poetic feet are then combined in a number of different ways, most often with four feet per line, so as to give the poetic metre for a line of verse. Some of the most commonly used metres are the following:\n\n*me fâ’ î lün / me fâ’ î lün / me fâ’ î lün / me fâ’ î lün. – – – / . – – – / . – – – / . – – –\n\n:—Bâkî (1526–1600)\n*me fâ i lün / fe i lâ tün / me fâ i lün / fe i lün. – . – / . . – – / . – . – / . . –\n\n:—Şeyh Gâlib (1757–1799)\n*fâ i lâ tün / fâ i lâ tün / fâ i lâ tün / fâ i lün– . – – / – . – – / – . – – / – . –\n\n:—Nedîm (1681?–1730)\n*fe i lâ tün / fe i lâ tün / fe i lâ tün / fe i lün. . – – / . . – – / . . – – / . . –\n\n:—Fuzûlî (1483?–1556)\n*mef’ û lü / me fâ î lü / me fâ î lü / fâ û lün– – . / . – – . / . – – . / – – .\n\n:—Neşâtî (?–1674)\n\nPortuguese\n\nPortuguese poetry uses a syllabic metre in which the verse is classified according to the last stressed syllable. The Portuguese system is quite similar to those of Spanish, Italian and French languages, since they are cognate languages. The most commonly used verses are:\n* Redondilha menor: composed of 5 syllables.\n* Redondilha maior: composed of 7 syllables.\n* Decasyllable (decassílabo): composed of 10 syllables. Mostly used in Parnassian sonnets. It is equivalent to the Italian hendecasyllable.\n** Heroic (heróico): stresses on the sixth and tenth syllables.\n** Sapphic (sáfico): stresses on the fourth, eighth and tenth syllables.\n** Martelo: stresses on the third, sixth and tenth syllables.\n** Gaita galega or moinheira: stresses on the fourth, seventh and tenth syllables.\n* Dodecasyllable (dodecassílabo): composed of 12 syllables.\n** Alexandrine (alexandrino): divided into two hemistiches, the sixth and the twelfth syllables are stressed.\n* Barbarian (bárbaro): composed of 13 or more syllables.\n** Lucasian (lucasiano): composed of 16 syllables, divided into two hemistiches of 8 syllables each.\n\nHistory\n\nMetrical texts are first attested in early Indo-European languages. The earliest known unambiguously metrical texts, and at the same time the only metrical texts with a claim of dating to the Late Bronze Age,  are the hymns of the Rigveda. That the texts of the Ancient Near East (Sumerian, Egyptian or Semitic) should not exhibit metre is surprising, and may be partly due to the nature of Bronze Age writing. There were, in fact, attempts to reconstruct metrical qualities of the poetic portions of the Hebrew Bible, e.g. by Gustav Bickell\"Metrices biblicae regulae exemplis illustratae\", 1879, \"Carmina Vet. Test. metrice\", 1882 or Julius Ley,\"Leitfaden der Metrik der hebräischen Poesie\", 1887 but they remained inconclusiveThe Catholic Encyclopedia s.v. Hebrew Poetry of the Old Testament calls them 'Procrustean'. (see  Biblical poetry). Early Iron Age metrical poetry is found in the Iranian  Avesta and in the Greek works attributed to Homer and Hesiod.\nLatin verse survives from the Old Latin period (c. 2nd century BC), in the Saturnian metre. Persian poetryFereydoon Motamed La Metrique Diatemporelle: Quantitative poetic metric analysis and pursuit of reasoning on aesthetics of linguistics and poetry in Indo-European languages. arises in the Sassanid era. Tamil poetry of the early centuries AD may be the earliest known non-Indo-European\n\nMedieval poetry was metrical without exception, spanning traditions as diverse as European Minnesang, Trouvère or Bardic poetry, Classical Persian and Sanskrit poetry,  Tang dynasty Chinese poetry or the Japanese Nara period Man'yōshū. Renaissance and Early Modern poetry in Europe is characterized by a return to templates of Classical Antiquity, a tradition begun by Petrarca's generation and continued into the time of Shakespeare and Milton.\n\nDissent\n\nNot all poets accept the idea that metre is a fundamental part of poetry. 20th-century American poets Marianne Moore, William Carlos Williams and Robinson Jeffers were poets who believed that metre was imposed upon poetry by man and not a fundamental part of its nature. In an essay titled \"Robinson Jeffers, & The Metric Fallacy\" Dan Schneider echoes Jeffers' sentiments: \"What if someone actually said to you that all music was composed of just 2 notes? Or if someone claimed that there were just 2 colors in creation? Now, ponder if such a thing were true. Imagine the clunkiness & mechanicality of such music. Think of the visual arts devoid of not just color, but sepia tones, & even shades of gray.\" Jeffers called his technique \"rolling stresses\".\n\nMoore went further than Jeffers, openly declaring her poetry was written in syllabic form, and wholly denying metre. These syllabic lines from her famous poem \"Poetry\" illustrate her contempt for metre and other poetic tools. Even the syllabic pattern of this poem does not remain perfectly consistent:\n\n:::nor is it valid\n:::::to discriminate against \"business documents and\n\n:school-books\": all these phenomena are important. One must make a distinction\n::::however: when dragged into prominence by half poets, the result is not poetry\n\nWilliams tried to form poetry whose subject matter was centered on the lives of common people. He came up with the concept of the variable foot. Williams spurned traditional metre in most of his poems, preferring what he called \"colloquial idioms.\" Another poet that turned his back on traditional concepts of metre was Britain's Gerard Manley Hopkins. Hopkins' major innovation was what he called sprung rhythm. He claimed most poetry was written in this older rhythmic structure inherited from the Norman side of the English literary heritage, based on repeating groups of two or three syllables, with the stressed syllable falling in the same place on each repetition. Sprung rhythm is structured around feet with a variable number of syllables, generally between one and four syllables per foot, with the stress always falling on the first syllable in a foot.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Metre (poetry)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19930" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In  poetry, metre is the basic rhythmic structure of a verse or lines in verse.  Many traditional verse forms prescribe a specific verse metre, or a certain set of metres alternating in a particular order. The study and the actual use of metres and forms of versification are both known as prosody. (Within linguistics, \"prosody\" is used in a more general sense that includes not only poetic metre but also the rhythmic aspects of prose, whether formal or informal, that vary from language to language, and sometimes between poetic traditions.)\n\nCharacteristics\n\nAn assortment of features can be identified when classifying poetry and its metre.\n\nQualitative versus quantitative metre\n\nThe metre of most poetry of the Western world and elsewhere is based on patterns of syllables of particular types. The familiar type of metre in English-language poetry is called qualitative metre, with stressed syllables coming at regular intervals (e.g. in iambic pentameters, usually every even-numbered syllable). Many Romance languages use a scheme that is somewhat similar but where the position of only one particular stressed syllable (e.g. the last) needs to be fixed. The metre of the old Germanic poetry of languages such as Old Norse and Old English was radically different, but was still based on stress patterns.\n\nSome classical languages, in contrast, used a different scheme known as quantitative metre, where patterns were based on syllable weight rather than stress. In the dactylic hexameters of Classical Latin and Classical Greek, for example, each of the six feet making up the line was either a dactyl (long-short-short) or a spondee (long-long): a \"long syllable\" was literally one that took longer to pronounce than a short syllable: specifically, a syllable consisting of a long vowel or diphthong or followed by two consonants. The stress pattern of the words made no difference to the metre. A number of other ancient languages also used quantitative metre, such as Sanskrit and Classical Arabic (but not Biblical Hebrew).\n\nFinally, non-stressed languages that have little or no differentiation of syllable length, such as French or Chinese, base their verses on the number of syllables only. The most common form in French is the Alexandrine, with twelve syllables a verse, and in classical Chinese five characters, and thus five syllables. But since each Chinese character is pronounced using one syllable in a certain tone, classical Chinese poetry also had more strictly defined rules, such as parallelism or antithesis between lines.\n\nFeet\n\nIn many Western classical poetic traditions, the metre of a verse can be described as a sequence of feet, each foot being a specific sequence of syllable types — such as relatively unstressed/stressed (the norm for English poetry) or long/short (as in most classical Latin and Greek poetry).\n\nIambic pentameter, a common metre in English poetry, is based on a sequence of five iambic feet or iambs, each consisting of a relatively unstressed syllable (here represented with \"×\" above the syllable) followed by a relatively stressed one (here represented with \"/\" above the syllable) — \"da-DUM\" = \"× /\" :\n\n ×  /   ×   /   ×    /      ×  /     ×   /\nSo long as men can breathe, or eyes can see,\n ×  /    ×      /   ×     /   ×     /    ×   /\nSo long lives this, and this gives life to thee.\n\nThis approach to analyzing and classifying metres originates from Ancient Greek tragedians and poets such as Homer, Pindar, Hesiod, and Sappho.\n\nHowever some metres have an overall rhythmic pattern to the line that cannot easily be described using feet. This occurs in Sanskrit poetry; see Vedic metre and Sanskrit metre. (Although this poetry is in fact specified using feet, each \"foot\" is more or less equivalent to an entire line.) It also occurs in some Western metres, such as the hendecasyllable favoured by Catullus and Martial, which can be described as:\n\nx x — ∪ ∪ — ∪ — ∪ — —\n\n(where \"—\" long, \"∪\" \n short, and \"x x\" can be realized as \"— ∪\" or \"— —\" or \"∪ —\")\n\nClassification\n\nIf the line has only one foot, it is called a monometer; two feet, dimeter; three is trimeter; four is tetrameter; five is pentameter; six is hexameter, seven is heptameter and eight is octameter. For example, if the feet are iambs, and if there are five feet to a line, then it is called a iambic pentameter. If the feet are primarily dactyls and there are six to a line, then it is a dactylic hexameter.\n\nCaesura\n\nSometimes a natural pause occurs in the middle of a line rather than at a line-break.  This is a caesura (cut).  A good example is from The Winter's Tale by William Shakespeare; the caesurae are indicated by '/':\n\nIt is for you we speak, / not for ourselves:\nYou are abused / and by some putter-on\nThat will be damn'd for't; / would I knew the villain,\nI would land-damn him. / Be she honour-flaw'd,\nI have three daughters; / the eldest is eleven\n\nIn Latin and Greek poetry, a caesura is a break within a foot caused by the end of a word.\n\nEach line of traditional Germanic alliterative verse is divided into two half-lines by a caesura. This can be seen in Piers Plowman:\n\nA fair feeld ful of folk / fond I ther bitwene—\nOf alle manere of men / the meene and the riche,\nWerchynge and wandrynge / as the world asketh.\nSomme putten hem to the plough / pleiden ful selde,\nIn settynge and sowynge / swonken ful harde,\nAnd wonnen that thise wastours / with glotonye destruyeth.\n\nEnjambment\n\nBy contrast with caesura, enjambment is incomplete syntax at the end of a line; the meaning runs over from one poetic line to the next, without terminal punctuation.  Also from Shakespeare's The Winter's Tale:\n\nI am not prone to weeping, as our sex\nCommonly are; the want of which vain dew\nPerchance shall dry your pities; but I have\nThat honourable grief lodged here which burns\nWorse than tears drown.\n\nMetric variations\n\nPoems with a well-defined overall metric pattern often have a few lines that violate that pattern. A common variation is the inversion of a foot, which turns an iamb (\"da-DUM\") into a trochee (\"DUM-da\"). Another common variation is a headless verse, which lacks the first syllable of the first foot.  Yet a third variation is catalexis, where the end of a line is shortened by a foot, or two or part thereof - an example of this is at the end of each verse in Keats' 'La Belle Dame sans Merci':\n\nAnd on thy cheeks a fading rose (4 feet)\nFast withereth too  (2 feet)\n\nIn various languages\n\nSanskrit\n\nVersification in Classical Sanskrit poetry is of three kinds.\n\n#Syllabic verse (akṣaravṛtta): metres depend on the number of syllables in a verse, with relative freedom in the distribution of light and heavy syllables. This style is derived from older Vedic forms, and found in the great epics, the Mahabharata and the Ramayana.\n#Syllabo-quantitative verse (varṇavṛtta): metres depend on syllable count, but the light-heavy patterns are fixed.\n#Quantitative verse (mātrāvṛtta): metres depend on duration, where each verse-line has a fixed number of morae, usually grouped in sets of four.\n\nStandard traditional works on metre are Pingala's Chandaḥśāstra and Kedāra's Vṛttaratnākara. The most exhaustive compilations, such as the modern ones by Patwardhan and Velankar contain over 600 metres. This is a substantially larger repertoire than in any other metrical tradition.\n\nGreek and Latin\n\nThe metrical \"feet\" in the classical languages were based on the length of time taken to pronounce each syllable, which were categorized according to their weight as either \"long\" syllables or \"short\" syllables (indicated as dum and di below).  These are also called \"heavy\" and \"light\" syllables, respectively, to distinguish from long and short vowels. The foot is often compared to a musical measure and the long and short syllables to whole notes and half notes. In English poetry, feet are determined by emphasis rather than length, with stressed and unstressed syllables serving the same function as long and short syllables in classical metre.\n\nThe basic unit in Greek and Latin prosody is a mora, which is defined as a single short syllable.  A long syllable is equivalent to two morae.  A long syllable contains either a long vowel, a diphthong, or a short vowel followed by two or more consonants.  Various rules of elision sometimes prevent a grammatical syllable from making a full syllable, and certain other lengthening and shortening rules (such as correption) can create long or short syllables in contexts where one would expect the opposite.\n\nThe most important Classical metre is the dactylic hexameter, the metre of Homer and Virgil.  This form uses verses of six feet.  The word dactyl comes from the Greek word daktylos meaning finger, since there is one long part followed by two short stretches. The first four feet are dactyls (daa-duh-duh), but can be spondees (daa-daa).  The fifth foot is almost always a dactyl. The sixth foot is either a spondee or a trochee (daa-duh).  The initial syllable of either foot is called the ictus, the basic \"beat\" of the verse.  There is usually a caesura  after the ictus of the third foot.  The opening line of the Æneid is a typical line of dactylic hexameter:\n\nArmă vĭ | rumquĕ că | nō, Troi | ae quī | prīmŭs ăb | ōrīs\n(\"I sing of arms and the man, who first from the shores of Troy...\")\n\nIn this example, the first and second feet are dactyls; their first syllables, \"Ar\" and \"rum\" respectively, contain short vowels, but count as long because the vowels are both followed by two consonants. The third and fourth feet are spondees, the first of which is divided by the main caesura of the verse. The fifth foot is a dactyl, as is nearly always the case. The final foot is a spondee.\n\nThe dactylic hexameter was imitated in English by Henry Wadsworth Longfellow in his poem Evangeline:\n\nThis is the forest primeval. The murmuring pines and the hemlocks,\nBearded with moss, and in garments green, indistinct in the twilight,\nStand like Druids of old, with voices sad and prophetic,\nStand like harpers hoar, with beards that rest on their bosoms.\n\nNotice how the first line:\nThis is the | for-est pri | me-val.  The | mur-muring | pines and the | hem-locks\n\nFollows this pattern:\ndum diddy | dum diddy | dum diddy | dum diddy | dum diddy | dum dum\n\nAlso important in Greek and Latin poetry is the dactylic pentameter.  This was a line of verse, made up of two equal parts, each of which contains two dactyls followed by a long syllable, which counts as a half foot. In this way, the number of feet amounts to five in total. Spondees can take the place of the dactyls in the first half, but never in the second.  The long syllable at the close of the first half of the verse always ends a word, giving rise to a caesura.\n\nDactylic pentameter is never used in isolation.  Rather, a line of dactylic pentameter follows a line of dactylic hexameter in the elegiac distich or elegiac couplet, a form of verse that was used for the composition of elegies and other tragic and solemn verse in the Greek and Latin world, as well as love poetry that was sometimes light and cheerful.  An example from Ovid's Tristia:\n\nVergĭlĭ | um vī | dī tan | tum, nĕc ă | māră Tĭ | bullō\n:Tempŭs ă | mīcĭtĭ | ae || fātă dĕ | dērĕ mĕ | ae.\n\n(\"Virgil I merely saw, and the harsh Fates gave Tibullus no time for my friendship.\")\n\nThe Greeks and Romans also used a number of lyric metres, which were typically used for shorter poems than elegiacs or hexameter.  In Aeolic verse, one important line was called the hendecasyllabic, a line of eleven syllables.  This metre was used most often in the Sapphic stanza, named after the Greek poet Sappho, who wrote many of her poems in the form.  A hendecasyllabic is a line with a never-varying structure: two trochees, followed by a dactyl, then two more trochees.  In the Sapphic stanza, three hendecasyllabics are followed by an \"Adonic\" line, made up of a dactyl and a trochee.  This is the form of Catullus 51 (itself an homage to Sappho 31):\n\nIllĕ mī pār essĕ dĕō vĭdētur;\nillĕ, sī fās est, sŭpĕrārĕ dīvōs,\nquī sĕdēns adversŭs ĭdentĭdem tē\n:spectăt ĕt audit\n\n(\"He seems to me to be like a god; if it is permitted, he seems above the gods, who sitting across from you gazes at you and hears you again and again.\")\n\nThe Sapphic stanza was imitated in English by Algernon Charles Swinburne in a poem he simply called Sapphics:\n\nSaw the white implacable Aphrodite,\nSaw the hair unbound and the feet unsandalled\nShine as fire of sunset on western waters;\n:Saw the reluctant...\n\nClassical Arabic\n\nThe metrical system of Classical Arabic poetry, like those of classical Greek and Latin, is based on the weight of syllables classified as either \"long\" or \"short\". The basic principles of Arabic poetic metre Arūḍ or Arud ( ') Science of Poetry ( '), were put forward by Al-Farahidi (786 - 718 AD) who did so after noticing that poems consisted of repeated syllables in each verse. In his first book, Al-Ard ( '), he described 15 types of verse. Al-Akhfash described one extra, the 16th.\n\nA short syllable contains a short vowel with no following consonants. For example, the word kataba, which syllabifies as ka-ta-ba, contains three short vowels and is made up of three short syllables. A long syllable contains either a long vowel or a short vowel followed by a consonant as is the case in the word maktūbun which syllabifies as mak-tū-bun. These are the only syllable types possible in Classical Arabic phonology which, by and large, does not allow a syllable to end in more than one consonant or a consonant to occur in the same syllable after a long vowel. In other words, syllables of the type -āk- or -akr- are not found in classical Arabic.\n\nEach verse consists of a certain number of metrical feet (tafāʿīl or ʾaǧzāʾ) and a certain combination of possible feet constitutes a metre (baḥr).\n\nThe traditional Arabic practice for writing out a poem's metre is to use a concatenation of various derivations of the verbal root F-ʿ-L (فعل). Thus, the following hemistich\n\nقفا نبك من ذكرى حبيبٍ ومنزلِ\n\nWould be traditionally scanned as:\n\nفعولن مفاعيلن فعولن مفاعلن\n\nThat is, Romanized and with traditional Western scansion:\n\n Western:   u –  –  u  –   –  –  u – –   u  –  u –\n Verse:    Qifā nabki min ḏikrā ḥabībin wa-manzili\n Mnemonic:  fa`ūlun  mafā`īlun  fa`ūlun  mafā`ilun\n\nThe Arabic metres\n\nClassical Arabic has sixteen established metres. Though each of them allows for a certain amount of variation, their basic patterns are as follows, using:\n* \"–\" for 1 long syllable\n* \"u\" for 1 short syllable\n* \"x\" for a position that can contain 1 long or 1 short\n* \"o\" for a position that can contain 1 long or 2 shorts\n* \"S\" for a position that can contain 1 long, 2 shorts, or 1 long + 1 short\n\nClassical Persian\n\nThe terminology for metrical system used in classical and classical-style Persian poetry is the same as that of Classical Arabic, even though these are quite different in both origin and structure. This has led to serious confusion among prosodists, both ancient and modern, as to the true source and nature of the Persian meters, the most obvious error being the assumption that they were copied from Arabic.\n\nPersian poetry is quantitative, and the metrical patterns are made of long and short syllables, much as in Classical Greek, Latin and Arabic. Anceps positions in the line, however, that is places where either a long or short syllable can be used (marked \"x\" in the schemes below), are not found in Persian verse except in some metres at the beginning of a line.\n\nPersian poetry is written in couplets, with each half-line (hemistich) being 10-14 syllables long. Except in the ruba'i (quatrain), where either of two very similar metres may be used, the same metre is used for every line in the poem. Rhyme is always used, sometimes with double rhyme or internal rhymes in addition. In some poems, known as masnavi, the two halves of each couplet rhyme, with a scheme aa, bb, cc and so on. In lyric poetry, the same rhyme is used throughout the poem at the end of each couplet, but except in the opening couplet, the two halves of each couplet do not rhyme; hence the scheme is aa, ba, ca, da. A ruba'i (quatrain) also usually has the rhyme aa, ba.\n\nA particular feature of classical Persian prosody, not found in Latin, Greek or Arabic, is that instead of two lengths of syllables (long and short), there are three lengths (short, long, and overlong). Overlong syllables can be used anywhere in the line in place of a long + a short, or in the final position in a line or half line.Elwell-Sutton, L.P. The Persian Metres (1976).Hayes, Bruce (1979) [http://linguistics.ucla.edu/people/hayes/papers/HayesRhythmicStructureOfPersianVerse1979.pdf \"The rhythmic sructure of Persian verse\"] Edebiyat 4:193-242, p. When a metre has a pair of short syllables (u u), it is common for a long syllable to be substituted, especially at the end of a line or half-line.\n\nAbout 30 different metres are commonly used in Persian. 70% of lyric poems are written in one of the following seven metres:Elwell-Sutton (1976) The Persian Metres, p. 162.\n*u – u – u u – – u – u – u u –\n*– – u – u – u u – – u – u –\n*– u – – – u – – – u – – – u –\n*x u – – u u – – u u – – u u – \n*x u – – u – u – u u – \n*u – – – u – – – u – – – u – – – \n*– – u u – – u u – – u u – –\n\nMasnavi poems (that is, long poems in rhyming couplets) are always written in one of the shorter 11 or 10-syllable metres (traditionally seven in number) such as the following:\n*u – – u – – u – – u – (e.g. Ferdowsi's Shahnameh)\n*u – – – u – – – u – – (e.g. Gorgani's Vis o Ramin)\n*– u – – – u – – – u – (e.g. Rumi's Masnavi-e Ma'navi)\n*– – u u – u – u – –  (e.g. Nezami's Leyli o Majnun)\n\nThe two metres used for ruba'iyat (quatrains), which are only used for this, are the following, of which the second is a variant of the first:\n*– – u u – – u u – – u u –\n*– – u u – u – u – – u u –\n\nClassical Chinese\n\nClassical Chinese poetic metric may be divided into fixed and variable length line types, although the actual scansion of the metre is complicated by various factors, including linguistic changes and variations encountered in dealing with a tradition extending over a geographically extensive regional area for a continuous time period of over some two-and-a-half millennia. Beginning with the earlier recorded forms: the Classic of Poetry tends toward couplets of four-character lines, grouped in rhymed quatrains; and, the Chuci follows this to some extent, but moves toward variations in line length. Han Dynasty poetry tended towards the variable line-length forms of the folk ballads and the Music Bureau yuefu. Jian'an poetry, Six Dynasties poetry, and Tang Dynasty poetry tend towards a poetic metre based on fixed-length lines of five, seven, (or, more rarely six) characters/verbal units tended to predominate, generally in couplet/quatrain-based forms, of various total verse lengths. The Song poetry is specially known for its use of the ci, using variable line lengths which follow the specific pattern of a certain musical song's lyrics, thus ci are sometimes referred to as \"fixed-rhythm\" forms. Yuan poetry metres continued this practice with their qu forms, similarly fixed-rhythm forms based on now obscure or perhaps completely lost original examples (or, ur-types). Not that Classical Chinese poetry ever lost the use of the shi forms, with their metrical patterns found in the \"old style poetry\" (gushi) and the regulated verse forms of (lüshi or jintishi). The regulated verse forms also prescribed patterns based upon linguistic tonality. The use of caesura is important in regard to the metrical analysis of Classical Chinese poetry forms.\n\nOld English\n\nThe metric system of Old English poetry was different from that of modern English, and related more to the verse forms of most of the older Germanic languages such as Old Norse. It used alliterative verse, a metrical pattern involving varied numbers of syllables but a fixed number (usually four) of strong stresses in each line.  The unstressed syllables were relatively unimportant, but the caesurae (breaks between the half-lines) played a major role in Old English poetry.\n\nIn place of using feet, alliterative verse divided each line into two half-lines.  Each half-line had to follow one of five or so patterns, each of which defined a sequence of stressed and unstressed syllables, typically with two stressed syllables per half line.  Unlike typical Western poetry, however, the number of unstressed syllables could vary somewhat.  For example, the common pattern \"DUM-da-DUM-da\" could allow between one and five unstressed syllables between the two stresses.\n\nThe following is a famous example, taken from The Battle of Maldon, a poem written shortly after the date of that battle (AD 991):\n\nHige sceal þe heardra, || heorte þe cēnre,\nmōd sceal þe māre, || swā ūre mægen lȳtlað\n\n(\"Will must be the harder, courage the bolder,\nspirit must be the more, as our might lessens.\")\n\nIn the quoted section, the stressed syllables have been underlined. (Normally, the stressed syllable must be long if followed by another syllable in a word.  However, by a rule known as syllable resolution, two short syllables in a single word are considered equal to a single long syllable.  Hence, sometimes two syllables have been underlined, as in hige and mægen.) The German philologist Eduard Sievers (died 1932) identified five different patterns of half-line in Anglo-Saxon alliterative poetry. The first three half-lines have the type A pattern \"DUM-da-(da-)DUM-da\", while the last one has the type C pattern \"da-(da-da-)DUM-DUM-da\", with parentheses indicating optional unstressed syllables that have been inserted.  Note also the pervasive pattern of alliteration, where the first and/or second stressed syllables alliterate with the third, but not with the fourth.\n\nModern English\n\nMost English metre is classified according to the same system as Classical metre with an important difference. English is an accentual language, and therefore beats and offbeats (stressed and unstressed syllables) take the place of the long and short syllables of classical systems. In most English verse, the metre can be considered as a sort of back beat, against which natural speech rhythms vary expressively. The most common characteristic feet of English verse are the iamb in two syllables and the anapest in three.  (See Foot (prosody) for a complete list of the metrical feet and their names.)\n\nMetrical systems\n\nThe number of metrical systems in English is not agreed upon. asserts that there is only one metre in English: Accentual-Syllabic.  The essay is reprinted in . The four major types. are: accentual verse, accentual-syllabic verse, syllabic verse and quantitative verse.  The alliterative verse of Old English could also be added to this list, or included as a special type of accentual verse. Accentual verse focuses on the number of stresses in a line, while ignoring the number of offbeats and syllables; accentual-syllabic verse focuses on regulating both the number of stresses and the total number of syllables in a line; syllabic verse only counts the number of syllables in a line; quantitative verse regulates the patterns of long and short syllables (this sort of verse is often considered alien to English).. It is to be noted, however, that the use of foreign metres in English is all but exceptional..\n\nFrequently-used metres\n\nThe most frequently encountered metre of English verse is the iambic pentameter, in which the metrical norm is five iambic feet per line, though metrical substitution is common and rhythmic variations practically inexhaustible. John Milton's Paradise Lost, most sonnets, and much else besides in English are written in iambic pentameter. Lines of unrhymed iambic pentameter are commonly known as blank verse.  Blank verse in the English language is most famously represented in the plays of William Shakespeare and the great works of Milton, though Tennyson (Ulysses, The Princess) and Wordsworth (The Prelude) also make notable use of it.\n\nA rhymed pair of lines of iambic pentameter make a heroic couplet, a verse form which was used so often in the 18th century that it is now used mostly for humorous effect (although see Pale Fire for a non-trivial case). The most famous writers of heroic couplets are Dryden and Pope.\n\nAnother important metre in English is the ballad metre, also called the \"common metre\", which is a four-line stanza, with two pairs of a line of iambic tetrameter followed by a line of iambic trimeter; the rhymes usually fall on the lines of trimeter, although in many instances the tetrameter also rhymes.  This is the metre of most of the Border and Scots or English ballads.  In hymnody it is called the \"common metre\", as it is the most common of the named hymn metres used to pair many hymn lyrics with melodies, such as Amazing Grace:The ballad metre commonality among a wide range of song lyrics allow words and music to be interchanged seamlessly between various songs, such as Amazing Grace, the Ballad of Gilligan's Isle, House of the Rising Sun, theme from the Mickey Mouse Club, and others.\n\nAmazing Grace! how sweet the sound\n:That saved a wretch like me;\nI once was lost, but now am found;\n:Was blind, but now I see.\n\nEmily Dickinson is famous for her frequent use of ballad metre:\n\nGreat streets of silence led away\nTo neighborhoods of pause —\nHere was no notice — no dissent —\nNo universe — no laws.\n\nFrench\n\nIn French poetry, metre is determined solely by the number of syllables in a line, because it is considered less important than rhymes.  A silent 'e' counts as a syllable before a consonant, but is elided before a vowel (where h aspiré counts as a consonant). At the end of a line, the \"e\" remains unelided but is hypermetrical (outside the count of syllables, like a feminine ending in English verse), in that case, the rhyme is also called \"feminine\", whereas it is called \"masculine\" in the other cases.\n\nThe most frequently encountered metre in Classical French poetry is the alexandrine, composed of two hemistiches of six syllables each. Two famous alexandrines are\n\nLa fille de Minos et de Pasiphaë\n:(Jean Racine)\n\n(the daughter of Minos and Pasiphae), and\nWaterloo ! Waterloo ! Waterloo ! Morne plaine!\n:(Victor Hugo)\n\n(Waterloo! Waterloo! Waterloo! Gloomy plain!)\n\nClassical French poetry also had a complex set of rules for rhymes that goes beyond how words merely sound. These are usually taken into account when describing the metre of a poem.\n\nSpanish\n\nIn Spanish poetry the metre is determined by the number of syllables the verse has. Still it is the phonetic accent in the last word of the verse that decides the final count of the line. If the accent of the final word is at the last syllable, then the poetic rule states that one syllable shall be added to the actual count of syllables in the said line, thus having a higher number of poetic syllables than the number of grammatical syllables. If the accent lies on the second to last syllable of the last word in the verse, then the final count of poetic syllables will be the same as the grammatical number of syllables. Furthermore, if the accent lies on the third to last syllable, then one syllable is subtracted from the actual count, having then less poetic syllables than grammatical syllables.\n\nSpanish poetry uses poetic licenses, unique to Romance languages, to change the number of syllables by manipulating mainly the vowels in the line.\n\nRegarding these poetic licenses one must consider three kinds of phenomena: (1) syneresis, (2) dieresis and (3) hiatus\n\nThere are many types of licenses, used either to add or subtract syllables, that may be applied when needed after taking in consideration the poetic rules of the last word. Yet all have in common that they only manipulate vowels that are close to each other and not interrupted by consonants.\n\nSome common metres in Spanish verse are:\n* Septenary: A line with seven poetic syllables\n* Octosyllable: A line with eight poetic syllables. This metre is commonly used in romances, narrative poems similar to English ballads, and in most proverbs.\n* Hendecasyllable: A line with eleven poetic syllables. This metre plays a similar role to pentameter in English verse.  It is commonly used in sonnets, among other things.\n* Alexandrine: A line consisting of fourteen syllables, commonly separated by two hemistiches of seven syllables each (In Anglo-Saxon or French contexts this term refers to twelve syllable lines, but not in the Spanish context).\n\nItalian\n\nIn Italian poetry, metre is determined solely by the position of the last accent in a line, the position of the other accents being however important for verse equilibrium. Syllables are enumerated with respect to a verse which ends with a paroxytone, so that a Septenary (having seven syllables) is defined as a verse whose last accent falls on the sixth syllable: it may so contain eight syllables (Ei fu. Siccome immobile) or just six (la terra al nunzio sta). Moreover, when a word ends with a vowel and the next one starts with a vowel, they are considered to be in the same syllable (synalepha): so Gli anni e i giorni consists of only four syllables (\"Gli an\" \"ni e i\" \"gior\" \"ni\"). Even-syllabic verses have a fixed stress pattern. Because of the mostly trochaic nature of the Italian language, verses with an even number of syllables are far easier to compose, and the Novenary is usually regarded as the most difficult verse.\n\nSome common metres in Italian verse are:\n* Sexenary: A line whose last stressed syllable is on the fifth, with a fixed stress on the second one as well (Al Re Travicello / Piovuto ai ranocchi, Giusti)\n* Septenary: A line whose last stressed syllable is the sixth one.\n* Octosyllable: A line whose last accent falls on the seventh syllable. More often than not, the secondary accents fall on the first, third and fifth syllable, especially in nursery rhymes for which this metre is particularly well-suited.\n* Hendecasyllable: A line whose last accent falls on the tenth syllable. It therefore usually consists of eleven syllables; there are various kinds of possible accentuations. It is used in sonnets, in ottava rima, and in many other types of poetry. The Divine Comedy, in particular, is composed entirely of hendecasyllables, whose main stress pattern is on the 4th and 10th syllable. \n\nTurkish\n\nApart from Ottoman poetry, which was heavily influenced by Persian traditionshttp://global.britannica.com/art/Turkish-literature and created a unique Ottoman style, traditional Turkish poetry features a system in which the number of syllables in each verse must be the same, most frequently 7, 8, 11, 14 syllables. These verses are then divided into syllable groups depending on the number of total syllables in a verse: 4+3 for 7 syllables, 4+4 or 5+3 for 8, 4+4+3 or 6+5 for 11 syllables. The end of each group in a verse is called a \"durak\" (stop), and must coincide with the last syllable of a word.\n\nThe following example is by Faruk Nafiz Çamlıbel (died 1973), one of the most devoted users of traditional Turkish metre:\n\nIn this poem the 6+5 metre is used, so that there is a word-break (durak = \"stop\" or caesura) after the sixth syllable of every line, as well as at the end of each line.\n\nOttoman Turkish\n\nIn the Ottoman Turkish language, the structures of the poetic foot (تفعل tef'ile) and of poetic metre (وزن vezin) were imitated from Persian poetry. About twelve of the commonest Persian metres were used for writing Turkish poetry. As was the case with Persian, no use at all was made of the commonest metres of Arabic poetry (the tawīl, basīt, kāmil, and wāfir).Deo, Ashwini; Kiparsky, Paul (2011). [https://u.osu.edu/deo.13/files//2015/06/DeoKiparsky2011-2fsd6ay.pdf \"Poetries in Contact: Arabic, Persian, and Urdu\"]. In Maria-Kristina Lotman and Mihhail Lotman ed. Proceedings of International Conference on Frontiers in Comparative Metrics, Estonia, pp. 147–173. (See p. 156 of the pdf). However, the terminology used to described the metres was indirectly borrowed from the Arabic poetic tradition through the medium of the Persian language.\n\nAs a result, Ottoman poetry, also known as Dîvân poetry, was generally written in quantitative, mora-timed metre. The moras, or syllables, are divided into three basic types:\n\n*Open, or light, syllables (açık hece) consist of either a short vowel alone, or a consonant followed by a short vowel\n**Examples: a-dam (\"man\"); zir-ve (\"summit, peak\")\n*Closed, or heavy, syllables (kapalı hece) consist of either a long vowel alone, a consonant followed by a long vowel, or a short vowel followed by a consonant\n**Examples: Â-dem (\"Adam\"); kâ-fir (\"non-Muslim\"); at (\"horse\")\n*Lengthened, or superheavy, syllables (meddli hece) count as one closed plus one open syllable and consist of a vowel followed by a consonant cluster, or a long vowel followed by a consonant\n**Examples: kürk (\"fur\"); âb (\"water\")\n\nIn writing out a poem's poetic metre, open syllables are symbolized by \".\" and closed syllables are symbolized by \"–\". From the different syllable types, a total of sixteen different types of poetic foot—the majority of which are either three or four syllables in length—are constructed, which are named and scanned as follows:\n\nThese individual poetic feet are then combined in a number of different ways, most often with four feet per line, so as to give the poetic metre for a line of verse. Some of the most commonly used metres are the following:\n\n*me fâ’ î lün / me fâ’ î lün / me fâ’ î lün / me fâ’ î lün. – – – / . – – – / . – – – / . – – –\n\n:—Bâkî (1526–1600)\n*me fâ i lün / fe i lâ tün / me fâ i lün / fe i lün. – . – / . . – – / . – . – / . . –\n\n:—Şeyh Gâlib (1757–1799)\n*fâ i lâ tün / fâ i lâ tün / fâ i lâ tün / fâ i lün– . – – / – . – – / – . – – / – . –\n\n:—Nedîm (1681?–1730)\n*fe i lâ tün / fe i lâ tün / fe i lâ tün / fe i lün. . – – / . . – – / . . – – / . . –\n\n:—Fuzûlî (1483?–1556)\n*mef’ û lü / me fâ î lü / me fâ î lü / fâ û lün– – . / . – – . / . – – . / – – .\n\n:—Neşâtî (?–1674)\n\nPortuguese\n\nPortuguese poetry uses a syllabic metre in which the verse is classified according to the last stressed syllable. The Portuguese system is quite similar to those of Spanish, Italian and French languages, since they are cognate languages. The most commonly used verses are:\n* Redondilha menor: composed of 5 syllables.\n* Redondilha maior: composed of 7 syllables.\n* Decasyllable (decassílabo): composed of 10 syllables. Mostly used in Parnassian sonnets. It is equivalent to the Italian hendecasyllable.\n** Heroic (heróico): stresses on the sixth and tenth syllables.\n** Sapphic (sáfico): stresses on the fourth, eighth and tenth syllables.\n** Martelo: stresses on the third, sixth and tenth syllables.\n** Gaita galega or moinheira: stresses on the fourth, seventh and tenth syllables.\n* Dodecasyllable (dodecassílabo): composed of 12 syllables.\n** Alexandrine (alexandrino): divided into two hemistiches, the sixth and the twelfth syllables are stressed.\n* Barbarian (bárbaro): composed of 13 or more syllables.\n** Lucasian (lucasiano): composed of 16 syllables, divided into two hemistiches of 8 syllables each.\n\nHistory\n\nMetrical texts are first attested in early Indo-European languages. The earliest known unambiguously metrical texts, and at the same time the only metrical texts with a claim of dating to the Late Bronze Age,  are the hymns of the Rigveda. That the texts of the Ancient Near East (Sumerian, Egyptian or Semitic) should not exhibit metre is surprising, and may be partly due to the nature of Bronze Age writing. There were, in fact, attempts to reconstruct metrical qualities of the poetic portions of the Hebrew Bible, e.g. by Gustav Bickell\"Metrices biblicae regulae exemplis illustratae\", 1879, \"Carmina Vet. Test. metrice\", 1882 or Julius Ley,\"Leitfaden der Metrik der hebräischen Poesie\", 1887 but they remained inconclusiveThe Catholic Encyclopedia s.v. Hebrew Poetry of the Old Testament calls them 'Procrustean'. (see  Biblical poetry). Early Iron Age metrical poetry is found in the Iranian  Avesta and in the Greek works attributed to Homer and Hesiod.\nLatin verse survives from the Old Latin period (c. 2nd century BC), in the Saturnian metre. Persian poetryFereydoon Motamed La Metrique Diatemporelle: Quantitative poetic metric analysis and pursuit of reasoning on aesthetics of linguistics and poetry in Indo-European languages. arises in the Sassanid era. Tamil poetry of the early centuries AD may be the earliest known non-Indo-European\n\nMedieval poetry was metrical without exception, spanning traditions as diverse as European Minnesang, Trouvère or Bardic poetry, Classical Persian and Sanskrit poetry,  Tang dynasty Chinese poetry or the Japanese Nara period Man'yōshū. Renaissance and Early Modern poetry in Europe is characterized by a return to templates of Classical Antiquity, a tradition begun by Petrarca's generation and continued into the time of Shakespeare and Milton.\n\nDissent\n\nNot all poets accept the idea that metre is a fundamental part of poetry. 20th-century American poets Marianne Moore, William Carlos Williams and Robinson Jeffers were poets who believed that metre was imposed upon poetry by man and not a fundamental part of its nature. In an essay titled \"Robinson Jeffers, & The Metric Fallacy\" Dan Schneider echoes Jeffers' sentiments: \"What if someone actually said to you that all music was composed of just 2 notes? Or if someone claimed that there were just 2 colors in creation? Now, ponder if such a thing were true. Imagine the clunkiness & mechanicality of such music. Think of the visual arts devoid of not just color, but sepia tones, & even shades of gray.\" Jeffers called his technique \"rolling stresses\".\n\nMoore went further than Jeffers, openly declaring her poetry was written in syllabic form, and wholly denying metre. These syllabic lines from her famous poem \"Poetry\" illustrate her contempt for metre and other poetic tools. Even the syllabic pattern of this poem does not remain perfectly consistent:\n\n:::nor is it valid\n:::::to discriminate against \"business documents and\n\n:school-books\": all these phenomena are important. One must make a distinction\n::::however: when dragged into prominence by half poets, the result is not poetry\n\nWilliams tried to form poetry whose subject matter was centered on the lives of common people. He came up with the concept of the variable foot. Williams spurned traditional metre in most of his poems, preferring what he called \"colloquial idioms.\" Another poet that turned his back on traditional concepts of metre was Britain's Gerard Manley Hopkins. Hopkins' major innovation was what he called sprung rhythm. He claimed most poetry was written in this older rhythmic structure inherited from the Norman side of the English literary heritage, based on repeating groups of two or three syllables, with the stressed syllable falling in the same place on each repetition. Sprung rhythm is structured around feet with a variable number of syllables, generally between one and four syllables per foot, with the stress always falling on the first syllable in a foot. Metre (poetry). http://en.wikipedia.org/?curid=19930."
  }
}
