{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2062",
  "eid" : "bd7376b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778397595,
  "textBody" : "Amerigo Vespucci (; March 9, 1454February 22, 1512) was an Italian explorer, financier, navigator and cartographer who first demonstrated in about 1502 that Brazil and the West Indies did not represent Asia's eastern outskirts as initially conjectured from Columbus' voyages, but instead constituted an entirely separate landmass hitherto unknown to people of the Old World. In 1505 he became a citizen of Spain.https://www.biography.com/people/amerigo-vespucci-9517978\n\nColloquially referred to as the New World, this second super continent came to be termed \"Americas\", deriving its name from Americus, the Latin version of Vespucci's first name.See e.g. Encyclopædia Britannica Online, Amerigo Vespucci; and Room, Adrian. 2004. Placenames of the world: origins and meanings of the names for over 5000 natural features, countries, capitals, territories, cities and historic sights: America believed to have derived their name from the feminized Latin version of his first name.Rival explanations have been proposed (see  Arciniegas, Germán. Amerigo and the New World: The Life & Times of Amerigo Vespucci. Translated by Harriet de Onís. New York: Octagon Books, 1978.) For example, some have speculated that the name's origin may lie with Richard Amerike [http://www.bbc.co.uk/history/british/tudors/americaname_03.shtml BBC], or with the region Amerrique in Nicaragua. None of these theories has been accepted in mainstream academia.\n\nBackground \n\nAmerigo Vespucci was born and raised in Florence on the Italian Peninsula. He was the third son of Ser Nastagio (Anastasio) Vespucci, a Florentine notary, and Lisabetta Mini.C.R. Markham (1894) \"Introduction\", in The Letters of Amerigo Vespucci and other documents illustrative of his career.  London: Hakluyt.Alexander Christopher Bickle et alii [https://www.geni.com/people/Ser-Nastagio-Anastasio-Vespucci/6000000050473130275 page: 6000000050473130275] Geni November 28, 2016 Retrieved 2017-02-23  The father of Ser Nastagio (Anastasio) Vespucci had the name Amerigo Vespucci also.Alexander Christopher Bickle et alii - [https://www.geni.com/people/Amerigo-Vespucci/6000000050483095880 page:6000000050483095880] Geni November 28, 2016 Retrieved 2017-02-23\n\nAmerigo Vespucci was educated by his uncle, Fra Giorgio Antonio Vespucci, a Dominican friar of the monastery of San Marco in Florence. While his elder brothers were sent to the University of Pisa to pursue scholarly careers, Amerigo Vespucci embraced a mercantile life, and was hired as a clerk by the Florentine commercial house of Medici, headed by Lorenzo de' Medici.  Vespucci acquired the favor and protection of Lorenzo di Pierfrancesco de' Medici who became the head of the business after the elder Lorenzo's death in 1492.  In March 1492, the Medici dispatched the thirty-eight-year-old Vespucci and Donato Niccolini as confidential agents to look into the Medici branch office in Cádiz (Spain), whose managers and dealings were under suspicion.\n\nIn April 1495, by the intrigues of Bishop Juan Rodríguez de Fonseca, the Crown of Castile broke their monopoly deal with Christopher Columbus and began handing out licenses to other navigators for the West Indies.  Just around this time (1495–96), Vespucci was engaged as the executor of Giannotto Berardi, an Italian merchant who had recently died in Seville. Vespucci organized the fulfillment of Berardi's outstanding contract with the Castilian crown to provide twelve vessels for the Indies.  After these were delivered, Vespucci continued as a provision contractor for Indies expeditions, and is known to have secured beef supplies for at least one (if not two) of Columbus' voyages.\n\nExpeditions \n\nAt the invitation of king Manuel I of Portugal, Vespucci participated as observer in several voyages that explored the east coast of South America between 1499 and 1502. On the first of these voyages he was aboard the ship that discovered that South America extended much further south than previously thought.\n\nThe expeditions became widely known in Europe after two accounts attributed to Vespucci were published between 1502 and 1504. In 1507, Martin Waldseemüller produced a world map on which he named the new continent America after the feminine Latin version of Vespucci's first name, which is Americus. In an accompanying book, Waldseemüller published one of the Vespucci accounts, which led to criticism that Vespucci was trying to upset Christopher Columbus' glory. However, the rediscovery in the 18th century of other letters by Vespucci has led to the view that the early published accounts, notably the Soderini Letter, could be fabrications, not by Vespucci, but by others.\n\nHistorical role \n\nIn 1508, the position of chief of navigation of Spain (piloto mayor de Indias) was created for Vespucci, with the responsibility of planning navigation for voyages to the Indies.\n\nTwo letters attributed to Vespucci were published during his lifetime. Mundus Novus (New World) was a Latin translation of a lost Italian letter sent from Lisbon to Lorenzo di Pierfrancesco de' Medici. It describes a voyage to South America in 1501–1502. Mundus Novus was published in late 1502 or early 1503 and soon reprinted and distributed in numerous European countries.Formisano, Luciano (Ed.) (1992). Letters from a New World: Amerigo Vespucci's Discovery of America. New York: Marsilio. . Pp. xix–xxvi. Lettera di Amerigo Vespucci delle isole nuovamente trovate in quattro suoi viaggi (Letter of Amerigo Vespucci concerning the isles newly discovered on his four voyages), known as Lettera al Soderini or just Lettera, was a letter in Italian addressed to Piero Soderini. Printed in 1504 or 1505, it claimed to be an account of four voyages to the Americas made by Vespucci between 1497 and 1504. A Latin translation was published by the German Martin Waldseemüller in 1507 in Cosmographiae Introductio, a book on cosmography and geography, as Quattuor Americi Vespucij navigationes (Four Voyages of Amerigo Vespucci).\n\nOn March 22, 1508, King Ferdinand made Vespucci chief navigator of Spain at a huge salaryOber, p. 234 and commissioned him to found a school of navigation, in order to standardize and modernize navigation techniques used by Iberian sea captains then exploring the world. Vespucci even developed a rudimentary, but fairly accurate method of determining longitude (which only more accurate chronometers would later improve upon).\n\nIn the 18th century, three unpublished familiar letters from Vespucci to Lorenzo de' Medici were rediscovered. One describes a voyage made in 1499–1500 which corresponds with the second of the \"four voyages\". Another was written from Cape Verde in 1501 in the early part of the third of the four voyages, before crossing the Atlantic. The third letter was sent from Lisbon after the completion of that voyage.\n\nSome have suggested that Vespucci, in the two letters published in his lifetime, was exaggerating his role and constructed deliberate fabrications. However, many scholars now believe that the two letters were not written by him but were fabrications by others based in part on genuine letters by Vespucci. It was the publication and widespread circulation of the letters that might have led Waldseemüller to name the new continent America on his world map of 1507 in Lorraine. Vespucci used a Latinised form of his name, Americus Vespucius, in his Latin writings, which Waldseemüller used as a base for the new name, taking the feminine form America, according to the prevalent view. The book accompanying the map stated: \"I do not see what right any one would have to object to calling this part, after Americus who discovered it and who is a man of intelligence, Amerige, that is, the Land of Americus, or America: since both Europa and Asia got their names from women\". It is possible that Vespucci was not aware that Waldseemüller had named the continent after him.Ray, p.93\n\nThe two disputed letters claim that Vespucci made four voyages to America, while at most two can be verified from other sources. At the moment, there is a dispute between historians on when Vespucci visited the mainland the first time. Some historians like Germán ArciniegasGermán Arciniegas, Amerigo and the New World : The Life & Times of Amerigo Vespucci, translated by Harriet de Onís, Octagon (1978) \n and Gabriel Camargo Pérez think that his first voyage was made in June 1497 with the Spanish pilot Juan de la Cosa.\n\nVespucci's real historical importance may well rest more in his letters, whether he wrote them all or not, than in his discoveries. From these letters, the European public learned about the newly discovered continents of the Americas for the first time; their existence became generally known throughout Europe within a few years of the letters' publication. In his words:[https://books.google.com/books?id=upkyAQAAMAAJ Mundus Novus: Letter to Lorenzo Pietro Di Medici], by Amerigo Vespucci;\n translated by George Tyler Northrup, Princeton University Press, 1916...concerning my return from those new regions which we found and explored ... we may rightly call a new world. Because our ancestors had no knowledge of them, and it will be a matter wholly new to all those who hear about them, for this transcends the view held by our ancients, inasmuch as most of them hold that there is no continent to the south beyond the equator, but only the sea which they named the Atlantic and if some of them did aver that a continent there was, they denied with abundant argument that it was a habitable land. But that this their opinion is false and utterly opposed to the truth ... my last voyage has made manifest; for in those southern parts I have found a continent more densely peopled and abounding in animals than our Europe Asia or Africa, and, in addition, a climate milder and more delightful than in any other region known to us, as you shall learn in the following account.\n\nVoyages \n\nThe first and fourth voyages are perhaps fabricated, but the second and third are certain.\n\nFirst voyage \n\nA letter published in 1504 purports to be an account by Vespucci, written to Soderini, of a lengthy visit to the New World, leaving Spain in May 1497 and returning in October 1498. However, some modern scholars have doubted that this voyage took place, and consider this letter a forgery. Whoever did write the letter makes several observations of native customs, including use of hammocks and sweat lodges.\n\nSecond voyage \n\nAbout 1499–1500, Vespucci joined an expedition in the service of Spain, with Alonso de Ojeda (or Hojeda) as the fleet commander. The intention was to sail around the southern end of the African mainland into the Indian Ocean. After hitting land at the coast of what is now Guyana, the two seem to have separated. Vespucci sailed southward, discovering the mouth of the Amazon River and reaching 6°S, before turning around and seeing Trinidad and the Orinoco River and returning to Spain by way of Hispaniola. The letter, to Lorenzo di Pierfrancesco de' Medici, claims that Vespucci determined his longitude celestially\non a rainy and stormy day with calm seas, stars could be identified\n   near the horizon to judge latitude/longitude\n   celestially. Although South America's continental shelf\n   drops quickly into the deep ocean beyond the Orinoco River,\n   the mouth is on the shelf, avoiding the ocean swells\n   and waves which hinder visibility of stars near the\n   horizon.  Seamen who could navigate from Europe to America\n   and back could chart stars on the horizon, especially\n   for a cartographer like Vespucci.\non August 23, 1499, while on this voyage. However, that claim may be fraudulent, which could cast doubt on the letter's credibility.\n\nThird voyage (Mundus Novus: Letter to Lorenzo Pietro Di Medici) \n\nThe last certain voyage of Vespucci was led by Gonçalo Coelho in 1501–1502 in the service of Portugal. Departing from Lisbon, the fleet sailed first to Cape Verde where they met two of Pedro Álvares Cabral's ships returning from India. In a letter from Cape Verde, Vespucci says that he hopes to visit the same lands that Álvares Cabral had explored, suggesting that the intention is to sail west to Asia, as on the 1499–1500 voyage. On reaching the coast of Brazil, they sailed south along the coast of South America to Rio de Janeiro's bay. If his own account is to be believed, he reached the latitude of Patagonia before turning back, although this also seems doubtful, since his account does not mention the broad estuary of the Río de la Plata, which he must have seen if he had gotten that far south. Portuguese maps of South America, created after the voyage of Coelho and Vespucci, do not show any land south of present-day Cananéia at 25° S, so this may represent the southernmost extent of their voyages.\n\nAfter the first half of the expedition, Vespucci mapped Alpha and Beta Centauri, as well as the constellation Crux, the Southern Cross and the Coalsack Nebula.Dekker, Elly (1990), Annals of Science, vol. 47, pp. 535–543. Although these stars had been known to the ancient Greeks, gradual precession had lowered them below the European horizon so that they had been forgotten. On his return to Lisbon, Vespucci wrote in a letter to Medici that the land masses they explored were much larger than anticipated and different from the Asia described by Ptolemy or Marco Polo and therefore, must be a New World, that is, a previously unknown fourth continent, after Europe, Asia, and Africa.\n\nFourth voyage \n\nVespucci's fourth voyage was another expedition for the Portuguese crown down the eastern coast of Brazil, that set out in May 1503 and returned to Portugal in June 1504. Like his alleged first voyage, Vespucci's last voyage in 1503–1504 is also disputed to have taken place.Ray, p.91  The only source of information for the last voyage is the Letter to Soderini,Markham, pp.52–56 but as several modern scholars dispute Vespucci's authorship of the letter to Soderini, it is also sometimes doubted whether Vespucci undertook this trip.  However, Portuguese documents do confirm a voyage to Brazil was undertaken in 1503–04 by the captain Gonçalo Coelho, very likely the same captain of the 1501 mapping expedition (Vespucci's third voyage), and so it is quite possible that Vespucci went on board this one as well.Fernández-Armesto (2007: p.168–169).  However, it is not independently confirmed Vespucci was aboard and there are some difficulties in the reported dates and details.\n\nThe letters caused controversy after Vespucci's death, especially among the supporters of Columbus who believed Columbus' priority for the discovery of America was being undermined, and seriously damaged Vespucci's reputation.Ray, pp.96–97; Arciniegas (1955:p.16)\n\nPersonal life \n\nVespucci was a cousin of the husband of Simonetta Vespucci. He married Maria Cerezo. One of the very few references to Amerigo's wife is contained in a royal decree dated May 22, 1512, giving his widow, Maria Cerezo a lifetime pension of ten thousand marvedis per annum deducted from the salary of her husband's successor.\n\nFinal years \n\nNot long after his return to Spain, Vespucci became a Spanish citizen. On March 22, 1508 he was made the pilot major of Spain by Ferdinand II of Aragon in honor of his discoveries. Vespucci also ran a school for navigators in the Spanish House of Trade, based in Seville.\n\nHe died on February 22, 1512 at his home in Seville, Spain.\n\nNotes \n\nEuropeans had long conceptualized the Afro-Eurasian landmass as divided into the same three continents known today: Europe, Asia, and Africa.  Once cosmographers realized that the New World was not connected to the Old (but before its true geography was fully mapped), they considered the Americas to be a single, fourth continent.\n\nThe question of the authenticity of Vespucci's authorship of the 1504 Mundus Novus and the 1505 Letter of Soderini, the only two texts published in Vespucci's lifetime, was famously raised by Magnaghi (1924). He proposed the Soderini letter was not written by Vespucci, but rather cobbled together by unscrupulous Florentine publishers, cutting and pasting together various accounts, some from Vespucci, others from elsewhere. Magnaghi was the first to propose that only the second and third voyages were true (as they are corroborated in Vespucci's other manuscript letters), while the first and fourth voyages (which are only found in the Soderini text) were fabricated by the publishers. The later (1937) discovery of a corrobotary Vespucci manuscript letter for the first voyage – the \"Ridolfi fragment\" (Formisiano, 1992: p.37–44) – means only the fourth voyage is really found in Soderini alone. The Magnaghi thesis has been a bitterly divisive factor in Vespucci scholarship.  The Magnaghi thesis was accepted and popularized by Pohl (1944) but rejected by Arciniegas (1955), who posited all four voyages as truthful.  Formisiano (1992) also rejects the Magnaghi thesis (although recognizing publishers probably fiddled with it), and declares all four voyages genuine, but in details (esp. the first) differing from Arciniegas.  Fernández-Armesto (2007: p.128) declares the authenticity question \"inconclusive\", hypothesizes that the first voyage is probably just another version of the second, the third is unassailable, and the fourth probably true (but too mangled to be sure).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Amerigo Vespucci" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2062" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Amerigo Vespucci (; March 9, 1454February 22, 1512) was an Italian explorer, financier, navigator and cartographer who first demonstrated in about 1502 that Brazil and the West Indies did not represent Asia's eastern outskirts as initially conjectured from Columbus' voyages, but instead constituted an entirely separate landmass hitherto unknown to people of the Old World. In 1505 he became a citizen of Spain.https://www.biography.com/people/amerigo-vespucci-9517978\n\nColloquially referred to as the New World, this second super continent came to be termed \"Americas\", deriving its name from Americus, the Latin version of Vespucci's first name.See e.g. Encyclopædia Britannica Online, Amerigo Vespucci; and Room, Adrian. 2004. Placenames of the world: origins and meanings of the names for over 5000 natural features, countries, capitals, territories, cities and historic sights: America believed to have derived their name from the feminized Latin version of his first name.Rival explanations have been proposed (see  Arciniegas, Germán. Amerigo and the New World: The Life & Times of Amerigo Vespucci. Translated by Harriet de Onís. New York: Octagon Books, 1978.) For example, some have speculated that the name's origin may lie with Richard Amerike [http://www.bbc.co.uk/history/british/tudors/americaname_03.shtml BBC], or with the region Amerrique in Nicaragua. None of these theories has been accepted in mainstream academia.\n\nBackground \n\nAmerigo Vespucci was born and raised in Florence on the Italian Peninsula. He was the third son of Ser Nastagio (Anastasio) Vespucci, a Florentine notary, and Lisabetta Mini.C.R. Markham (1894) \"Introduction\", in The Letters of Amerigo Vespucci and other documents illustrative of his career.  London: Hakluyt.Alexander Christopher Bickle et alii [https://www.geni.com/people/Ser-Nastagio-Anastasio-Vespucci/6000000050473130275 page: 6000000050473130275] Geni November 28, 2016 Retrieved 2017-02-23  The father of Ser Nastagio (Anastasio) Vespucci had the name Amerigo Vespucci also.Alexander Christopher Bickle et alii - [https://www.geni.com/people/Amerigo-Vespucci/6000000050483095880 page:6000000050483095880] Geni November 28, 2016 Retrieved 2017-02-23\n\nAmerigo Vespucci was educated by his uncle, Fra Giorgio Antonio Vespucci, a Dominican friar of the monastery of San Marco in Florence. While his elder brothers were sent to the University of Pisa to pursue scholarly careers, Amerigo Vespucci embraced a mercantile life, and was hired as a clerk by the Florentine commercial house of Medici, headed by Lorenzo de' Medici.  Vespucci acquired the favor and protection of Lorenzo di Pierfrancesco de' Medici who became the head of the business after the elder Lorenzo's death in 1492.  In March 1492, the Medici dispatched the thirty-eight-year-old Vespucci and Donato Niccolini as confidential agents to look into the Medici branch office in Cádiz (Spain), whose managers and dealings were under suspicion.\n\nIn April 1495, by the intrigues of Bishop Juan Rodríguez de Fonseca, the Crown of Castile broke their monopoly deal with Christopher Columbus and began handing out licenses to other navigators for the West Indies.  Just around this time (1495–96), Vespucci was engaged as the executor of Giannotto Berardi, an Italian merchant who had recently died in Seville. Vespucci organized the fulfillment of Berardi's outstanding contract with the Castilian crown to provide twelve vessels for the Indies.  After these were delivered, Vespucci continued as a provision contractor for Indies expeditions, and is known to have secured beef supplies for at least one (if not two) of Columbus' voyages.\n\nExpeditions \n\nAt the invitation of king Manuel I of Portugal, Vespucci participated as observer in several voyages that explored the east coast of South America between 1499 and 1502. On the first of these voyages he was aboard the ship that discovered that South America extended much further south than previously thought.\n\nThe expeditions became widely known in Europe after two accounts attributed to Vespucci were published between 1502 and 1504. In 1507, Martin Waldseemüller produced a world map on which he named the new continent America after the feminine Latin version of Vespucci's first name, which is Americus. In an accompanying book, Waldseemüller published one of the Vespucci accounts, which led to criticism that Vespucci was trying to upset Christopher Columbus' glory. However, the rediscovery in the 18th century of other letters by Vespucci has led to the view that the early published accounts, notably the Soderini Letter, could be fabrications, not by Vespucci, but by others.\n\nHistorical role \n\nIn 1508, the position of chief of navigation of Spain (piloto mayor de Indias) was created for Vespucci, with the responsibility of planning navigation for voyages to the Indies.\n\nTwo letters attributed to Vespucci were published during his lifetime. Mundus Novus (New World) was a Latin translation of a lost Italian letter sent from Lisbon to Lorenzo di Pierfrancesco de' Medici. It describes a voyage to South America in 1501–1502. Mundus Novus was published in late 1502 or early 1503 and soon reprinted and distributed in numerous European countries.Formisano, Luciano (Ed.) (1992). Letters from a New World: Amerigo Vespucci's Discovery of America. New York: Marsilio. . Pp. xix–xxvi. Lettera di Amerigo Vespucci delle isole nuovamente trovate in quattro suoi viaggi (Letter of Amerigo Vespucci concerning the isles newly discovered on his four voyages), known as Lettera al Soderini or just Lettera, was a letter in Italian addressed to Piero Soderini. Printed in 1504 or 1505, it claimed to be an account of four voyages to the Americas made by Vespucci between 1497 and 1504. A Latin translation was published by the German Martin Waldseemüller in 1507 in Cosmographiae Introductio, a book on cosmography and geography, as Quattuor Americi Vespucij navigationes (Four Voyages of Amerigo Vespucci).\n\nOn March 22, 1508, King Ferdinand made Vespucci chief navigator of Spain at a huge salaryOber, p. 234 and commissioned him to found a school of navigation, in order to standardize and modernize navigation techniques used by Iberian sea captains then exploring the world. Vespucci even developed a rudimentary, but fairly accurate method of determining longitude (which only more accurate chronometers would later improve upon).\n\nIn the 18th century, three unpublished familiar letters from Vespucci to Lorenzo de' Medici were rediscovered. One describes a voyage made in 1499–1500 which corresponds with the second of the \"four voyages\". Another was written from Cape Verde in 1501 in the early part of the third of the four voyages, before crossing the Atlantic. The third letter was sent from Lisbon after the completion of that voyage.\n\nSome have suggested that Vespucci, in the two letters published in his lifetime, was exaggerating his role and constructed deliberate fabrications. However, many scholars now believe that the two letters were not written by him but were fabrications by others based in part on genuine letters by Vespucci. It was the publication and widespread circulation of the letters that might have led Waldseemüller to name the new continent America on his world map of 1507 in Lorraine. Vespucci used a Latinised form of his name, Americus Vespucius, in his Latin writings, which Waldseemüller used as a base for the new name, taking the feminine form America, according to the prevalent view. The book accompanying the map stated: \"I do not see what right any one would have to object to calling this part, after Americus who discovered it and who is a man of intelligence, Amerige, that is, the Land of Americus, or America: since both Europa and Asia got their names from women\". It is possible that Vespucci was not aware that Waldseemüller had named the continent after him.Ray, p.93\n\nThe two disputed letters claim that Vespucci made four voyages to America, while at most two can be verified from other sources. At the moment, there is a dispute between historians on when Vespucci visited the mainland the first time. Some historians like Germán ArciniegasGermán Arciniegas, Amerigo and the New World : The Life & Times of Amerigo Vespucci, translated by Harriet de Onís, Octagon (1978) \n and Gabriel Camargo Pérez think that his first voyage was made in June 1497 with the Spanish pilot Juan de la Cosa.\n\nVespucci's real historical importance may well rest more in his letters, whether he wrote them all or not, than in his discoveries. From these letters, the European public learned about the newly discovered continents of the Americas for the first time; their existence became generally known throughout Europe within a few years of the letters' publication. In his words:[https://books.google.com/books?id=upkyAQAAMAAJ Mundus Novus: Letter to Lorenzo Pietro Di Medici], by Amerigo Vespucci;\n translated by George Tyler Northrup, Princeton University Press, 1916...concerning my return from those new regions which we found and explored ... we may rightly call a new world. Because our ancestors had no knowledge of them, and it will be a matter wholly new to all those who hear about them, for this transcends the view held by our ancients, inasmuch as most of them hold that there is no continent to the south beyond the equator, but only the sea which they named the Atlantic and if some of them did aver that a continent there was, they denied with abundant argument that it was a habitable land. But that this their opinion is false and utterly opposed to the truth ... my last voyage has made manifest; for in those southern parts I have found a continent more densely peopled and abounding in animals than our Europe Asia or Africa, and, in addition, a climate milder and more delightful than in any other region known to us, as you shall learn in the following account.\n\nVoyages \n\nThe first and fourth voyages are perhaps fabricated, but the second and third are certain.\n\nFirst voyage \n\nA letter published in 1504 purports to be an account by Vespucci, written to Soderini, of a lengthy visit to the New World, leaving Spain in May 1497 and returning in October 1498. However, some modern scholars have doubted that this voyage took place, and consider this letter a forgery. Whoever did write the letter makes several observations of native customs, including use of hammocks and sweat lodges.\n\nSecond voyage \n\nAbout 1499–1500, Vespucci joined an expedition in the service of Spain, with Alonso de Ojeda (or Hojeda) as the fleet commander. The intention was to sail around the southern end of the African mainland into the Indian Ocean. After hitting land at the coast of what is now Guyana, the two seem to have separated. Vespucci sailed southward, discovering the mouth of the Amazon River and reaching 6°S, before turning around and seeing Trinidad and the Orinoco River and returning to Spain by way of Hispaniola. The letter, to Lorenzo di Pierfrancesco de' Medici, claims that Vespucci determined his longitude celestially\non a rainy and stormy day with calm seas, stars could be identified\n   near the horizon to judge latitude/longitude\n   celestially. Although South America's continental shelf\n   drops quickly into the deep ocean beyond the Orinoco River,\n   the mouth is on the shelf, avoiding the ocean swells\n   and waves which hinder visibility of stars near the\n   horizon.  Seamen who could navigate from Europe to America\n   and back could chart stars on the horizon, especially\n   for a cartographer like Vespucci.\non August 23, 1499, while on this voyage. However, that claim may be fraudulent, which could cast doubt on the letter's credibility.\n\nThird voyage (Mundus Novus: Letter to Lorenzo Pietro Di Medici) \n\nThe last certain voyage of Vespucci was led by Gonçalo Coelho in 1501–1502 in the service of Portugal. Departing from Lisbon, the fleet sailed first to Cape Verde where they met two of Pedro Álvares Cabral's ships returning from India. In a letter from Cape Verde, Vespucci says that he hopes to visit the same lands that Álvares Cabral had explored, suggesting that the intention is to sail west to Asia, as on the 1499–1500 voyage. On reaching the coast of Brazil, they sailed south along the coast of South America to Rio de Janeiro's bay. If his own account is to be believed, he reached the latitude of Patagonia before turning back, although this also seems doubtful, since his account does not mention the broad estuary of the Río de la Plata, which he must have seen if he had gotten that far south. Portuguese maps of South America, created after the voyage of Coelho and Vespucci, do not show any land south of present-day Cananéia at 25° S, so this may represent the southernmost extent of their voyages.\n\nAfter the first half of the expedition, Vespucci mapped Alpha and Beta Centauri, as well as the constellation Crux, the Southern Cross and the Coalsack Nebula.Dekker, Elly (1990), Annals of Science, vol. 47, pp. 535–543. Although these stars had been known to the ancient Greeks, gradual precession had lowered them below the European horizon so that they had been forgotten. On his return to Lisbon, Vespucci wrote in a letter to Medici that the land masses they explored were much larger than anticipated and different from the Asia described by Ptolemy or Marco Polo and therefore, must be a New World, that is, a previously unknown fourth continent, after Europe, Asia, and Africa.\n\nFourth voyage \n\nVespucci's fourth voyage was another expedition for the Portuguese crown down the eastern coast of Brazil, that set out in May 1503 and returned to Portugal in June 1504. Like his alleged first voyage, Vespucci's last voyage in 1503–1504 is also disputed to have taken place.Ray, p.91  The only source of information for the last voyage is the Letter to Soderini,Markham, pp.52–56 but as several modern scholars dispute Vespucci's authorship of the letter to Soderini, it is also sometimes doubted whether Vespucci undertook this trip.  However, Portuguese documents do confirm a voyage to Brazil was undertaken in 1503–04 by the captain Gonçalo Coelho, very likely the same captain of the 1501 mapping expedition (Vespucci's third voyage), and so it is quite possible that Vespucci went on board this one as well.Fernández-Armesto (2007: p.168–169).  However, it is not independently confirmed Vespucci was aboard and there are some difficulties in the reported dates and details.\n\nThe letters caused controversy after Vespucci's death, especially among the supporters of Columbus who believed Columbus' priority for the discovery of America was being undermined, and seriously damaged Vespucci's reputation.Ray, pp.96–97; Arciniegas (1955:p.16)\n\nPersonal life \n\nVespucci was a cousin of the husband of Simonetta Vespucci. He married Maria Cerezo. One of the very few references to Amerigo's wife is contained in a royal decree dated May 22, 1512, giving his widow, Maria Cerezo a lifetime pension of ten thousand marvedis per annum deducted from the salary of her husband's successor.\n\nFinal years \n\nNot long after his return to Spain, Vespucci became a Spanish citizen. On March 22, 1508 he was made the pilot major of Spain by Ferdinand II of Aragon in honor of his discoveries. Vespucci also ran a school for navigators in the Spanish House of Trade, based in Seville.\n\nHe died on February 22, 1512 at his home in Seville, Spain.\n\nNotes \n\nEuropeans had long conceptualized the Afro-Eurasian landmass as divided into the same three continents known today: Europe, Asia, and Africa.  Once cosmographers realized that the New World was not connected to the Old (but before its true geography was fully mapped), they considered the Americas to be a single, fourth continent.\n\nThe question of the authenticity of Vespucci's authorship of the 1504 Mundus Novus and the 1505 Letter of Soderini, the only two texts published in Vespucci's lifetime, was famously raised by Magnaghi (1924). He proposed the Soderini letter was not written by Vespucci, but rather cobbled together by unscrupulous Florentine publishers, cutting and pasting together various accounts, some from Vespucci, others from elsewhere. Magnaghi was the first to propose that only the second and third voyages were true (as they are corroborated in Vespucci's other manuscript letters), while the first and fourth voyages (which are only found in the Soderini text) were fabricated by the publishers. The later (1937) discovery of a corrobotary Vespucci manuscript letter for the first voyage – the \"Ridolfi fragment\" (Formisiano, 1992: p.37–44) – means only the fourth voyage is really found in Soderini alone. The Magnaghi thesis has been a bitterly divisive factor in Vespucci scholarship.  The Magnaghi thesis was accepted and popularized by Pohl (1944) but rejected by Arciniegas (1955), who posited all four voyages as truthful.  Formisiano (1992) also rejects the Magnaghi thesis (although recognizing publishers probably fiddled with it), and declares all four voyages genuine, but in details (esp. the first) differing from Arciniegas.  Fernández-Armesto (2007: p.128) declares the authenticity question \"inconclusive\", hypothesizes that the first voyage is probably just another version of the second, the third is unassailable, and the fourth probably true (but too mangled to be sure). Amerigo Vespucci. http://en.wikipedia.org/?curid=2062."
  }
}
