{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7851",
  "eid" : "e3c22280-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778461864,
  "textBody" : "The Comprehensive Nuclear-Test-Ban Treaty (CTBT) is a multilateral treaty that bans all nuclear explosions, for both civilian and military purposes, in all environments. It was adopted by the United Nations General Assembly on 10 September 1996, but has not entered into force, as eight specific states have not ratified the treaty.\n\nHistory\n\nThe movement for international control of nuclear weapons began in 1945, with a call from Canada and United Kingdom for a conference on the subject. In June 1946, Bernard Baruch, an emissary of President Harry S. Truman, proposed the Baruch Plan before the United Nations Atomic Energy Commission, which called for an international system of controls on the production of atomic energy. The plan, which would serve as the basis for United States nuclear policy into the 1950s, was rejected by the Soviet Union as a US ploy to cement its nuclear dominance.\n\nBetween the Trinity nuclear test of 16 July 1945 and the signing of the Partial Test Ban Treaty (PTBT) on 5 August 1963, 499 nuclear tests were conducted. Much of the impetus for the PTBT, the precursor to the CTBT, was rising public concern surrounding the size and resulting nuclear fallout from underwater and atmospheric nuclear tests, particularly tests of powerful thermonuclear weapons (hydrogen bombs). The Castle Bravo test of 1 March 1954, in particular, attracted significant attention as the detonation resulted in fallout that spread over inhabited areas and sickened a group of Japanese fishermen. Between 1945 and 1963, the US conducted 215 atmospheric tests, the Soviet Union conducted 219, the UK conducted 21, and France conducted three.\n\nIn 1954, following the Castle Bravo test, Prime Minister Jawaharlal Nehru of India issued the first appeal for a \"standstill agreement\" on testing, which was soon echoed by the British Labour Party. Negotiations on a comprehensive test ban, primarily involved the US, UK, and Soviet Union, began in 1955 following a proposal by Soviet leader Nikita Khrushchev. Of primary concern throughout the negotiations, which would stretch with some interruptions to July 1963, was the system of verifying compliance with the test ban and detecting illicit tests. On the Western side, there were concerns that the Soviet Union would be able to circumvent any test ban and secretly leap ahead in the nuclear arms race. These fears were amplified following the US Rainier shot of 19 September 1957, which was the first contained underground test of a nuclear weapon. Though the US held a significant advantage in underground testing capabilities, there was worry that the Soviet Union would be able to covertly conduct underground tests during a test ban, as underground detonations were more difficult to detect than above-ground tests. On the Soviet side, conversely, the on-site compliance inspections demanded by the US and UK were seen as amounting to espionage. Disagreement over verification would lead to the Anglo-American and Soviet negotiators abandoning a comprehensive test ban (i.e., a ban on all tests, including those underground) in favor of a partial ban, which would be finalized on 25 July 1963. The PTBT, joined by 123 states following the original three parties, banned detonations for military and civilian purposes underwater, in the atmosphere, and in outer space.\n\nThe PTBT had mixed results. On the one hand, enactment of the treaty was followed by a substantial drop in the atmospheric concentration of radioactive particles. On the other hand, nuclear proliferation was not halted entirely (though it may have been slowed) and nuclear testing continued at a rapid clip. Compared to the 499 tests from 1945 to the signing of the PTBT, 436 tests were conducted over the ten years following the PTBT. Furthermore, US and Soviet underground testing continued \"venting\" radioactive gas into the atmosphere. Additionally, though underground testing was generally safer than above-ground testing, underground tests continued to risk the leaking of radionuclides, including plutonium, into the ground. From 1964 through 1996, the year of the CTBT's adoption, an estimated 1,377 underground nuclear tests were conducted. The final non-underground (atmospheric or underwater) test was conducted by China in 1980.\n\nThe PTBT has been seen as a step towards the Nuclear Non-proliferation Treaty (NPT) of 1968, which directly made reference to the PTBT. Under the NPT, non-nuclear weapon states were prohibited from possessing, manufacturing, and acquiring nuclear weapons or other nuclear explosive devices. All signatories, including nuclear weapon states, were committed to the goal of total nuclear disarmament. However, India, Pakistan, and Israel have declined to sign the NPT on grounds that such a treaty is fundamentally discriminatory as it places limitations on states that do not have nuclear weapons while making no efforts to curb weapons development by declared nuclear weapons states.\n\nIn 1974, a step towards a comprehensive test ban was made with the Threshold Test Ban Treaty (TTBT), ratified by the US and Soviet Union, which banned underground tests with yields above 150 kilotons. In April 1976, the two states reached agreement on the Peaceful Nuclear Explosions Treaty (PNET), which concerns nuclear detonations outside the weapons sites discussed in the TTBT. As in the TTBT, the US and Soviet Union agreed to bar peaceful nuclear explosions (PNEs) at these other locations with yields above 150 kilotons, as well as group explosions with total yields in excess of 1,500 kilotons. To verify compliance, the PNET requires that states rely on national technical means of verification, share information on explosions, and grant on-site access to counterparties. The TTBT and PNET did not enter into force for the US and Soviet Union until 11 December 1990.\n\nIn October 1977, the US, UK, and Soviet Union returned to negotiations over a test ban. The three nuclear powers made notable progress in the late 1970s, agreeing to terms on a ban on all testing, including a temporary prohibition on PNEs, but continued disagreements over the compliance mechanisms led to an end to negotiations ahead of Ronald Reagan's inauguration as President in 1981. In 1985, Soviet leader Mikhail Gorbachev announced a unilateral testing moratorium, and in December 1986, Reagan reaffirmed US commitment to pursue the long-term goal of a comprehensive test ban. In November 1987, negotiations on a test ban restarted, followed by a joint US-Soviet program to research underground-test detection in December 1987.\n\nNegotiations\n\nGiven the political situation prevailing in the subsequent decades, little progress was made in nuclear disarmament until the end of the Cold War in 1991. Parties to the PTBT held an amendment conference that year to discuss a proposal to convert the Treaty into an instrument banning all nuclear-weapon tests. With strong support from the UN General Assembly, negotiations for a comprehensive test-ban treaty began in 1993.\n\nAdoption\n\nExtensive efforts were made over the next three years to draft the Treaty text and its two annexes. However, the Conference on Disarmament, in which negotiations were being held, did not succeed in reaching consensus on the adoption of the text. Under the direction of Prime Minister John Howard and Foreign Minister Alexander Downer, Australia then sent the text to the United Nations General Assembly in New York, where it was submitted as a draft resolution. On 10 September 1996, the Comprehensive Test-Ban Treaty (CTBT) was adopted by a large majority, exceeding two-thirds of the General Assembly's Membership.\n\nObligations\n\n(Article I):\n# Each State Party undertakes not to carry out any nuclear weapon test explosion or any other nuclear explosion, and to prohibit and prevent any such nuclear explosion at any place under its jurisdiction or control.\n# Each State Party undertakes, furthermore, to refrain from causing, encouraging, or in any way participating in the carrying out of any nuclear weapon test explosion or any other nuclear explosion.\n\nStatus\n\nThe Treaty was adopted by the United Nations General Assembly on 10 September 1996. It opened for signature in New York on 24 September 1996,United Nations Treaty Collection (2009).  \"[http://treaties.un.org/Pages/ViewDetails.aspx?srcTREATY&id\n488&chapter26&lang\nen Comprehensive Nuclear-Test-Ban Treaty] \". Retrieved 23 August 2009. when it was signed by 71 States, including five of the eight then nuclear-capable states. As of October 2016, 166 states have ratified the CTBT and another 17 states have signed but not ratified it.In this news article, the number of states ratifying was reported as 154.\n\nThe treaty will enter into force 180 days after the 44 states listed in Annex 2 of the treaty have ratified it. These \"Annex 2 states\" are states that participated in the CTBT’s negotiations between 1994 and 1996 and possessed nuclear power reactors or research reactors at that time. As of 2016, eight Annex 2 states have not ratified the treaty: China, Egypt, Iran, Israel and the United States have signed but not ratified the Treaty; India, North Korea and Pakistan  have not signed it.\n\nMonitoring\n\nGeophysical and other technologies are used to monitor for compliance with the Treaty: forensic seismology, hydroacoustics, infrasound, and radionuclide monitoring. The technologies are used to monitor the underground, the waters and the atmosphere for any sign of a nuclear explosion. Statistical theories and methods are integral to CTBT monitoring providing confidence in verification analysis. Once the Treaty enters into force, on-site inspection will be provided for where concerns about compliance arise.\n\nThe Preparatory Commission for the Comprehensive Test Ban Treaty Organization (CTBTO), an international organization headquartered in Vienna, Austria, was created to build the verification regime, including establishment and provisional operation of the network of monitoring stations, the creation of an international data centre, and development of the On Site Inspection capability.\n\nThe monitoring network consists of 337 facilities located all over the globe. As of May 2012, more than 260 facilities have been certified. The monitoring stations register data that is transmitted to the international data centre in Vienna for processing and analysis. The data are sent to states that have signed the Treaty.\n\nSubsequent nuclear testing\n\nThree countries have tested nuclear weapons since the CTBT opened for signature in 1996. India and Pakistan both carried out two sets of tests in 1998. North Korea carried out six announced tests in 2006, 2009, 2013, two in 2016 and one in 2017. All six North Korean tests were picked up by the International Monitoring System set up by the Comprehensive Nuclear-Test-Ban Treaty Organization Preparatory Commission. A North Korean test is believed to have taken place in January 2016, evidenced by an \"artificial earthquake\" measured as a magnitude 5.1 by the U.S. Geological Survey. The first successful North Korean hydrogen bomb test supposedly took place September 2017. It was estimated to have an explosive yield of 120 kilotons .",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Comprehensive Nuclear-Test-Ban Treaty" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7851" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Comprehensive Nuclear-Test-Ban Treaty (CTBT) is a multilateral treaty that bans all nuclear explosions, for both civilian and military purposes, in all environments. It was adopted by the United Nations General Assembly on 10 September 1996, but has not entered into force, as eight specific states have not ratified the treaty.\n\nHistory\n\nThe movement for international control of nuclear weapons began in 1945, with a call from Canada and United Kingdom for a conference on the subject. In June 1946, Bernard Baruch, an emissary of President Harry S. Truman, proposed the Baruch Plan before the United Nations Atomic Energy Commission, which called for an international system of controls on the production of atomic energy. The plan, which would serve as the basis for United States nuclear policy into the 1950s, was rejected by the Soviet Union as a US ploy to cement its nuclear dominance.\n\nBetween the Trinity nuclear test of 16 July 1945 and the signing of the Partial Test Ban Treaty (PTBT) on 5 August 1963, 499 nuclear tests were conducted. Much of the impetus for the PTBT, the precursor to the CTBT, was rising public concern surrounding the size and resulting nuclear fallout from underwater and atmospheric nuclear tests, particularly tests of powerful thermonuclear weapons (hydrogen bombs). The Castle Bravo test of 1 March 1954, in particular, attracted significant attention as the detonation resulted in fallout that spread over inhabited areas and sickened a group of Japanese fishermen. Between 1945 and 1963, the US conducted 215 atmospheric tests, the Soviet Union conducted 219, the UK conducted 21, and France conducted three.\n\nIn 1954, following the Castle Bravo test, Prime Minister Jawaharlal Nehru of India issued the first appeal for a \"standstill agreement\" on testing, which was soon echoed by the British Labour Party. Negotiations on a comprehensive test ban, primarily involved the US, UK, and Soviet Union, began in 1955 following a proposal by Soviet leader Nikita Khrushchev. Of primary concern throughout the negotiations, which would stretch with some interruptions to July 1963, was the system of verifying compliance with the test ban and detecting illicit tests. On the Western side, there were concerns that the Soviet Union would be able to circumvent any test ban and secretly leap ahead in the nuclear arms race. These fears were amplified following the US Rainier shot of 19 September 1957, which was the first contained underground test of a nuclear weapon. Though the US held a significant advantage in underground testing capabilities, there was worry that the Soviet Union would be able to covertly conduct underground tests during a test ban, as underground detonations were more difficult to detect than above-ground tests. On the Soviet side, conversely, the on-site compliance inspections demanded by the US and UK were seen as amounting to espionage. Disagreement over verification would lead to the Anglo-American and Soviet negotiators abandoning a comprehensive test ban (i.e., a ban on all tests, including those underground) in favor of a partial ban, which would be finalized on 25 July 1963. The PTBT, joined by 123 states following the original three parties, banned detonations for military and civilian purposes underwater, in the atmosphere, and in outer space.\n\nThe PTBT had mixed results. On the one hand, enactment of the treaty was followed by a substantial drop in the atmospheric concentration of radioactive particles. On the other hand, nuclear proliferation was not halted entirely (though it may have been slowed) and nuclear testing continued at a rapid clip. Compared to the 499 tests from 1945 to the signing of the PTBT, 436 tests were conducted over the ten years following the PTBT. Furthermore, US and Soviet underground testing continued \"venting\" radioactive gas into the atmosphere. Additionally, though underground testing was generally safer than above-ground testing, underground tests continued to risk the leaking of radionuclides, including plutonium, into the ground. From 1964 through 1996, the year of the CTBT's adoption, an estimated 1,377 underground nuclear tests were conducted. The final non-underground (atmospheric or underwater) test was conducted by China in 1980.\n\nThe PTBT has been seen as a step towards the Nuclear Non-proliferation Treaty (NPT) of 1968, which directly made reference to the PTBT. Under the NPT, non-nuclear weapon states were prohibited from possessing, manufacturing, and acquiring nuclear weapons or other nuclear explosive devices. All signatories, including nuclear weapon states, were committed to the goal of total nuclear disarmament. However, India, Pakistan, and Israel have declined to sign the NPT on grounds that such a treaty is fundamentally discriminatory as it places limitations on states that do not have nuclear weapons while making no efforts to curb weapons development by declared nuclear weapons states.\n\nIn 1974, a step towards a comprehensive test ban was made with the Threshold Test Ban Treaty (TTBT), ratified by the US and Soviet Union, which banned underground tests with yields above 150 kilotons. In April 1976, the two states reached agreement on the Peaceful Nuclear Explosions Treaty (PNET), which concerns nuclear detonations outside the weapons sites discussed in the TTBT. As in the TTBT, the US and Soviet Union agreed to bar peaceful nuclear explosions (PNEs) at these other locations with yields above 150 kilotons, as well as group explosions with total yields in excess of 1,500 kilotons. To verify compliance, the PNET requires that states rely on national technical means of verification, share information on explosions, and grant on-site access to counterparties. The TTBT and PNET did not enter into force for the US and Soviet Union until 11 December 1990.\n\nIn October 1977, the US, UK, and Soviet Union returned to negotiations over a test ban. The three nuclear powers made notable progress in the late 1970s, agreeing to terms on a ban on all testing, including a temporary prohibition on PNEs, but continued disagreements over the compliance mechanisms led to an end to negotiations ahead of Ronald Reagan's inauguration as President in 1981. In 1985, Soviet leader Mikhail Gorbachev announced a unilateral testing moratorium, and in December 1986, Reagan reaffirmed US commitment to pursue the long-term goal of a comprehensive test ban. In November 1987, negotiations on a test ban restarted, followed by a joint US-Soviet program to research underground-test detection in December 1987.\n\nNegotiations\n\nGiven the political situation prevailing in the subsequent decades, little progress was made in nuclear disarmament until the end of the Cold War in 1991. Parties to the PTBT held an amendment conference that year to discuss a proposal to convert the Treaty into an instrument banning all nuclear-weapon tests. With strong support from the UN General Assembly, negotiations for a comprehensive test-ban treaty began in 1993.\n\nAdoption\n\nExtensive efforts were made over the next three years to draft the Treaty text and its two annexes. However, the Conference on Disarmament, in which negotiations were being held, did not succeed in reaching consensus on the adoption of the text. Under the direction of Prime Minister John Howard and Foreign Minister Alexander Downer, Australia then sent the text to the United Nations General Assembly in New York, where it was submitted as a draft resolution. On 10 September 1996, the Comprehensive Test-Ban Treaty (CTBT) was adopted by a large majority, exceeding two-thirds of the General Assembly's Membership.\n\nObligations\n\n(Article I):\n# Each State Party undertakes not to carry out any nuclear weapon test explosion or any other nuclear explosion, and to prohibit and prevent any such nuclear explosion at any place under its jurisdiction or control.\n# Each State Party undertakes, furthermore, to refrain from causing, encouraging, or in any way participating in the carrying out of any nuclear weapon test explosion or any other nuclear explosion.\n\nStatus\n\nThe Treaty was adopted by the United Nations General Assembly on 10 September 1996. It opened for signature in New York on 24 September 1996,United Nations Treaty Collection (2009).  \"[http://treaties.un.org/Pages/ViewDetails.aspx?srcTREATY&id\n488&chapter26&lang\nen Comprehensive Nuclear-Test-Ban Treaty] \". Retrieved 23 August 2009. when it was signed by 71 States, including five of the eight then nuclear-capable states. As of October 2016, 166 states have ratified the CTBT and another 17 states have signed but not ratified it.In this news article, the number of states ratifying was reported as 154.\n\nThe treaty will enter into force 180 days after the 44 states listed in Annex 2 of the treaty have ratified it. These \"Annex 2 states\" are states that participated in the CTBT’s negotiations between 1994 and 1996 and possessed nuclear power reactors or research reactors at that time. As of 2016, eight Annex 2 states have not ratified the treaty: China, Egypt, Iran, Israel and the United States have signed but not ratified the Treaty; India, North Korea and Pakistan  have not signed it.\n\nMonitoring\n\nGeophysical and other technologies are used to monitor for compliance with the Treaty: forensic seismology, hydroacoustics, infrasound, and radionuclide monitoring. The technologies are used to monitor the underground, the waters and the atmosphere for any sign of a nuclear explosion. Statistical theories and methods are integral to CTBT monitoring providing confidence in verification analysis. Once the Treaty enters into force, on-site inspection will be provided for where concerns about compliance arise.\n\nThe Preparatory Commission for the Comprehensive Test Ban Treaty Organization (CTBTO), an international organization headquartered in Vienna, Austria, was created to build the verification regime, including establishment and provisional operation of the network of monitoring stations, the creation of an international data centre, and development of the On Site Inspection capability.\n\nThe monitoring network consists of 337 facilities located all over the globe. As of May 2012, more than 260 facilities have been certified. The monitoring stations register data that is transmitted to the international data centre in Vienna for processing and analysis. The data are sent to states that have signed the Treaty.\n\nSubsequent nuclear testing\n\nThree countries have tested nuclear weapons since the CTBT opened for signature in 1996. India and Pakistan both carried out two sets of tests in 1998. North Korea carried out six announced tests in 2006, 2009, 2013, two in 2016 and one in 2017. All six North Korean tests were picked up by the International Monitoring System set up by the Comprehensive Nuclear-Test-Ban Treaty Organization Preparatory Commission. A North Korean test is believed to have taken place in January 2016, evidenced by an \"artificial earthquake\" measured as a magnitude 5.1 by the U.S. Geological Survey. The first successful North Korean hydrogen bomb test supposedly took place September 2017. It was estimated to have an explosive yield of 120 kilotons . Comprehensive Nuclear-Test-Ban Treaty. http://en.wikipedia.org/?curid=7851."
  }
}
