{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18710",
  "eid" : "347e7840-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778597316,
  "textBody" : "Luke the Evangelist (Latin: Lūcās, , Loukãs, , Lūqās, , Lūqā’) is one of the Four Evangelists—the four traditionally ascribed authors of the canonical Gospels. The early church fathers ascribed to him authorship of both the Gospel according to Luke and the book of the Acts of the Apostles, which would mean Luke contributed over a quarter of the text of the New Testament, more than any other author. Prominent figures in early Christianity such as Jerome and Eusebius later reaffirmed his authorship, although the fragile evidence of the identity of the author of the works has led to discussion in scholarly circles, both secular and religious.\n\nThe New Testament mentions Luke briefly a few times, and the Pauline epistle to the Colossians refers to him as a physician (from Greek for 'one who heals'); thus he is thought to have been both a physician and a disciple of Paul. Christians since the faith's early years have regarded him as a saint. He is believed to have been a martyr, reportedly having been hanged from an olive tree, though some believe otherwise.\n\nThe Roman Catholic Church and other major denominations venerate him as Saint Luke the Evangelist and as a patron saint of artists, physicians, bachelors, surgeons, students and butchers; his feast day takes place on 18 October.\n\nLife \n\nMany scholars believe that Luke was a Greek physician who lived in the Greek city of Antioch in Ancient Syria, although some other scholars and theologians think Luke was a Hellenic Jew.Harris, Stephen L., Understanding the Bible. Palo Alto: Mayfield. 1985. \"The Gospels\" pp. 266–68Strelan, Rick. [https://books.google.com/books?idAeTdi13weAoC&pg\nPA103 Luke the Priest – the Authority of the Author of the Third Gospel] – Was Luke a Jew or Gentile? Ashgate Publishing, Ltd., May 1, 2013, pp. 102–10. Bart Koet stated that it was widely accepted that the theology of Luke–Acts points to a gentile Christian writing for a gentile audience. Although he concludes that it is more plausible that Luke-Acts is directed to a community made up of both Jewish and gentile Christians, because there is stress on the scriptural roots of the gentile mission (see the use of Isaiah 49,6 in Luke-Acts).Koet, Bart J., Five Studies on Interpretation of Scripture in Luke-Acts. Leuven University Press, 1989. pp. 157-158 Koet, Bart J., Dreams and Scripture in Luke-Acts. Leuven University Press, 2006. pp. 4-5 Gregory Sterling claims that he was either a Hellenistic Jew or a god-fearer.\n\nHis earliest notice is in Paul's Epistle to Philemon—. He is also mentioned in  and , two works commonly ascribed to Paul.The New Testament Documents: Their Origin and Early History, George Milligan, 1913, Macmillan and Co., p. 149Saints: A Visual Guide, Edward Mornin, Lorna Mornin, 2006, Eerdmans Books, p. 74\n[http://www.newadvent.org/cathen/09420a.htm \"Gospel of Saint Luke\"], Aherne, Cornelius, The Catholic Encyclopedia. Vol. 9. New York: Robert Appleton Company, 1910. 24 Feb. 2013New Outlook, Alfred Emanuel Smith, 1935, Outlook Pub. Co., p. 792New Testament Studies. I. Luke the Physician: The Author of the Third Gospel, Adolf von Harnack, 1907, Williams & Norgate; G.P. Putnam's Sons, p. 5 The next earliest account of Luke is in the Anti-Marcionite Prologue to the Gospel of Luke, a document once thought to date to the 2nd century, but which has more recently been dated to the later 4th century. Helmut Koester, however, claims that the following part, the only part preserved in the original Greek, may have been composed in the late 2nd century:\n\nEpiphanius states that Luke was one of the Seventy Apostles (Panarion 51.11), and John Chrysostom indicates at one point that the \"brother\" Paul mentions in the Second Epistle to the Corinthians 8:18 is either Luke or Barnabas.\n\nIf one accepts that Luke was in fact the author of the Gospel bearing his name and also the Acts of the Apostles, certain details of his personal life can be reasonably assumed. While he does exclude himself from those who were eyewitnesses to Jesus' ministry, he repeatedly uses the word \"we\" in describing the Pauline missions in Acts of the Apostles, indicating that he was personally there at those times.Encyclopædia Britannica, Micropædia vol. 7, pp. 554–55. Chicago: Encyclopædia Britannica, Inc, 1998. .\n\nThere is similar evidence that Luke resided in Troas, the province which included the ruins of ancient Troy, in that he writes in Acts in the third person about Paul and his travels until they get to Troas, where he switches to the first person plural. The \"we\" section of Acts continues until the group leaves Philippi, when his writing goes back to the third person. This change happens again when the group returns to Philippi. There are three \"we sections\" in Acts, all following this rule. Luke never stated, however, that he lived in Troas, and this is the only evidence that he did.\n\nThe composition of the writings, as well as the range of vocabulary used, indicate that the author was an educated man. A quote in the Epistle to the Colossians differentiates between Luke and other colleagues \"of the circumcision.\"\n\nThis comment has traditionally caused commentators to conclude that Luke was a gentile. If this were true, it would make Luke the only writer of the New Testament who can clearly be identified as not being Jewish. However, that is not the only possibility. Although Luke is considered likely to be a gentile Christian, some scholars believe him to be a Hellenized Jew.Thomas S. McCall, Th.D. [http://www.levitt.com/essays/luke Was Luke a Gentile?] The phrase could just as easily be used to differentiate between those Christians who strictly observed the rituals of Judaism and those who did not.\n\nLuke's presence in Rome with the Apostle Paul near the end of Paul's life was attested by 2 Timothy 4:11: \"Only Luke is with me\". In the last chapter of the Book of Acts, widely attributed to Luke, we find several accounts in the first person also affirming Luke's presence in Rome including : \"And when we came to Rome...\" According to some accounts, Luke also contributed to the authorship of the Epistle to the Hebrews.\n\nLuke died at age 84 in Boeotia, according to a \"fairly early and widespread tradition\".Michael Walsh, ed. \"Butler's Lives of the Saints.\" (HarperCollins Publishers: New York, 1991), p. 342. According to Nikephoros Kallistos Xanthopoulos (Ecclesiastical History 14th century AD., Migne P.G. 145, 876) and others, Luke's tomb was located in Thebes, whence his relics were transferred to Constantinople in the year 357.\n\nThe authorship of Luke and Acts \n\nThe Gospel of Luke does not name its author.E. P. Sanders, The Historical Figure of Jesus, (Penguin, 1995) pp. 63–64.Bart D. Ehrman (2000:43) The New Testament: a historical introduction to early Christian writings. Oxford University Press.Geoffrey W. Bromiley (1995:287) [https://books.google.com/books?id\nr7QTYwYvvx0C&pgPA287&dq\nmatthew,+like+the+other+three+Gospels+is+an+anonymous+document.&hlnl&ei\nulSOTJXtKNS7jAfajcGhBg&saX&oi\nbook_result&ctresult&resnum\n2&ved0CCwQ6AEwAQ#v\nonepage&qmatthew%2C%20like%20the%20other%20three%20Gospels%20is%20an%20anonymous%20document.&f\nfalse International Standard Bible Encyclopedia: K-P] Matthew, Gospel According To. Wm. B. Eerdmans Publishing. Quote: \"Matthew, like the other three Gospels is an anonymous document.\"Donald Senior, Paul J. Achtemeier, Robert J. Karris (2002:328) [https://books.google.com/books?idVrmW1eXBILgC&pg\nPA328&dqgospels+anonymous&hl\nnl&ei9V6OTMiWJMiOjAfs05X8BQ&sa\nX&oibook_result&ct\nresult&resnum5&ved\n0CEgQ6AEwBA#vonepage&q\ngospels%20anonymous&ffalse Invitation to the Gospels] Paulist Press.Keith Fullerton Nickle (2001:43) [https://books.google.com/books?id\n5SSytjasmAgC&pgPA43&dq\ngospels+anonymous&hlnl&ei\n9V6OTMiWJMiOjAfs05X8BQ&saX&oi\nbook_result&ctresult&resnum\n6&ved0CE8Q6AEwBQ#v\nonepage&qgospels%20anonymous&f\nfalse The Synoptic Gospels: an introduction] Westminster John Knox Press.Ben Witherington (2004:44) [https://books.google.com/books?id_1zuyIimlzcC&pg\nPA44&dqgospels+anonymous&hl\nnl&ei9V6OTMiWJMiOjAfs05X8BQ&sa\nX&oibook_result&ct\nresult&resnum7&ved\n0CFQQ6AEwBg#vonepage&q\ngospels%20anonymous&ffalse The Gospel code: novel claims about Jesus, Mary Magdalene, and Da Vinci] InterVarsity Press.F. F. Bruce (1994:1) [https://books.google.com/books?id\n0MzO2GD62JUC&pgPA1&dq\ngospels+anonymous&hlnl&ei\n9V6OTMiWJMiOjAfs05X8BQ&saX&oi\nbook_result&ctresult&resnum\n8&ved0CFkQ6AEwBw#v\nonepage&qgospels%20anonymous&f\nfalse The Gospel of John] Wm. B. Eerdmans Publishing.Patrick J. Flannagan (1997:16) [https://books.google.com/books?idLYjpVXhF-GIC&pg\nPA16&dqgospels+anonymous&hl\nnl&ei9V6OTMiWJMiOjAfs05X8BQ&sa\nX&oibook_result&ct\nresult&resnum10&ved\n0CGMQ6AEwCQ#vonepage&q\ngospels%20anonymous&ffalse The Gospel of Mark Made Easy] Paulist Press The Gospel was not written and does not claim to be written by direct witnesses to the reported events, unlike Acts beginning in the sixteenth chapter.Bart D. Ehrman (2005:235) [https://books.google.com/books?idURdACxKubDIC&pg\nPA235&dqehrman+gospels+%22do+not+claim+to+be+written&hl\nnl&eic4IXTPWcC4WWsQavv9HiCQ&sa\nX&oibook_result&ct\nresult&resnum2&ved\n0CDMQ6AEwAQ#vonepage&q&f\nfalse Lost Christianities: the battles for scripture and the faiths we never knew] Oxford University Press, New York.Bart D. Ehrman (2004:110) [https://books.google.com/books?idvbLK6kn5T-EC&pg\nPA110&dqehrman+gospels+%22don%27t+even+claim+to+be+written&hl\nnl&einYQXTJDEKpaisQboquDmCQ&sa\nX&oibook_result&ct\nresult&resnum1&ved\n0CC4Q6AEwAA#vonepage&q&f\nfalse Truth and Fiction in The Da Vinci Code: A Historian Reveals What We Really Know about Jesus, Mary Magdalene, and Constantine.] Oxford University Press.Bart D. Ehrman (2006:143) [https://books.google.com/books?id\noBuJMhJlTYwC&pgPA143&dq\nehrman+gospels+%22do+not+claim+to+be+written&hlnl&ei\nc4IXTPWcC4WWsQavv9HiCQ&saX&oi\nbook_result&ctresult&resnum\n1&ved0CC4Q6AEwAA#v\nonepage&q&f=false The lost Gospel of Judas Iscariot: a new look at betrayer and betrayed.] Oxford University Press.\n\nThe earliest manuscript of the Gospel, dated circa AD 200, ascribes the work to Luke; as did Irenaeus, writing circa AD 180, and the Muratorian fragment from AD 170.Brown, Raymond E. An Introduction to the New Testament, p. 267. Anchor Bible; 1st edition (October 13, 1997). .\n\nThe gospel of Luke and the Acts of the Apostles make up a two-volume work which scholars call Luke–Acts. Together they account for 27.5% of the New Testament, the largest contribution by a single author.\n\nAs a historian \n\nMost scholars understand Luke's works (Luke–Acts) in the tradition of Greek historiography.[http://www.religion-online.org/showchapter.asp?title\n1116&C1230 Grant, Robert M., \"A Historical Introduction to the New Testament\" (Harper and Row, 1963)]  The preface of The Gospel of Luke drawing on historical investigation identified the work to the readers as belonging to the genre of history.Richard Bauckham, Jesus and the Eyewitnesses. 117. There is some disagreement about how best to treat Luke's writings, with some historians regarding Luke as highly accurate, and others taking a more critical approach.\n\nBased on his accurate description of towns, cities and islands, as well as correctly naming various official titles, archaeologist Sir William Ramsay wrote that \"Luke is a historian of the first rank; not merely are his statements of fact trustworthy... [he] should be placed along with the very greatest of historians.\"Ramsay, The Bearing Of Recent Discovery On The Trustworthiness Of The New Testament, 222, 1915 Professor of Classics at Auckland University, E.M. Blaiklock, wrote: \"For accuracy of detail, and for evocation of atmosphere, Luke stands, in fact, with Thucydides. The Acts of the Apostles is not shoddy product of pious imagining, but a trustworthy record... it was the spadework of archaeology which first revealed the truth.\"Blaiklock, The Archaeology of the New Testament, p. 96, Zondervan Publishing Houst, Grand Rapids, Michigan, 1970. New Testament scholar Colin Hemer has made a number of advancements in understanding the historical nature and accuracy of Luke's writings.Hemer, \"The Book of Acts in the Setting of Hellenic History\", 104–07, as summarized by MacDowell.\n\nOn the purpose of Acts, New Testament Scholar Luke Timothy Johnson has noted that \"Luke's account is selected and shaped to suit his apologetic interests, not in defiance of but in conformity to ancient standards of historiography.\" Such a position is shared by most commentators such as Richard Heard who sees historical deficiencies as arising from \"special objects in writing and to the limitations of his sources of information.\"\n\nDuring modern times, Luke's competence as a historian is questioned, depending upon one's a priori view of the supernatural. Since post-Enlightenment historians work with methodological naturalism,McGrew, Timothy, \"Miracles\", The Stanford Encyclopedia of Philosophy (Winter 2015 Edition), Edward N. Zalta (ed.), http://plato.stanford.edu/entries/miracles/Flew, Antony, 1966, God and Philosophy, London: Hutchinson.Ehrman, Bart D., 2003, The New Testament: A Historical Introduction to the Early Christian Writings, 3rd ed., New York: Oxford University Press.Bradley, Francis Herbert, 1874, “The Presuppositions of Critical History,” in Collected Essays, vol. 1, Oxford, Clarendon Press, 1935.McGrew's conclusion: historians work with methodological naturalism, which precludes them from establishing miracles as objective historical facts (Flew 1966: 146; cf. Bradley 1874/1935; Ehrman 2003: 229). such historians would see a narrative that relates supernatural, fantastic things like angels, demons etc., as problematic as a historical source. Mark Powell claims that \"it is doubtful whether the writing of history was ever Luke's intent. Luke wrote to proclaim, to persuade, and to interpret; he did not write to preserve records for posterity. An awareness of this, has been, for many, the final nail in Luke the historian’s coffin.\"\n\nRobert M. Grant has noted that although Luke saw himself within the historical tradition, his work contains a number of statistical improbabilities such as the sizable crowd addressed by Peter in Acts 4:4. He has also noted chronological difficulties whereby Luke \"has Gamaliel refer to Theudas and Judas in the wrong order, and Theudas actually rebelled about a decade after Gamaliel spoke (5:36–7)\"\n\nAs an artist \n\nChristian tradition, starting from the 8th century, states that he was the first icon painter. He is said to have painted pictures of the Virgin Mary and Child, in particular the Hodegetria image in Constantinople (now lost). Starting from the 11th century a number of painted images were venerated as his autograph works, including for example, the Black Madonna of Częstochowa and Our Lady of Vladimir. He was also said to have painted Saints Peter and Paul, and to have illustrated a gospel book with a full cycle of miniatures.Grigg, Robert, \"Byzantine Credulity as an Impediment to Antiquarianism\", Gesta, Vol. 26, No. 1 (1987), pp. 5–6, The University of Chicago Press on behalf of the International Center of Medieval Art, [https://www.jstor.org/stable/767073 JSTOR]The basic study on the legends concerning Saint Luke as a painter is Michele Bacci, Il pennello dell'Evangelista. Storia delle immagini sacre attribuite a san Luca (Pisa: Gisem, 1998).\n\nLate medieval Guilds of St Luke in the cities of Late Medieval Europe, especially Flanders, or the \"Accademia di San Luca\" (Academy of Saint Luke) in Rome—imitated in many other European cities during the 16th century—gathered together and protected painters. The tradition that Luke painted icons of Mary and Jesus has been common, particularly in Eastern Orthodoxy. The tradition also has support from the Saint Thomas Christians of India who claim to still have one of the Theotokos icons that Saint Luke painted and which St. Thomas brought to India.Father H. Hosten in his book Antiquities notes the following \"The picture at the mount is one of the oldest, and, therefore, one of the most venerable Christian paintings to be had in India. Other traditions hold that St. Luke painted two icons which currently are in Greece: the \"Theotokos Mega Spileotissa\" (Our Lady of the Great Cave, where supposedly Saint Luke lived for a period of time in asceticism) and the \"Panagia Soumela\", and \"Panagia Kykkou\" which are in Cyprus.\"\n\nSymbol \n\nIn traditional depictions, such as paintings, evangelist portraits and church mosaics, Saint Luke is often accompanied by an ox or bull, usually having wings. Sometimes only the symbol is shown, especially when in a combination of those of all Four Evangelists. Reprinted by Kessinger Publishing, 2003, .\n\nRelics \n\nDespot George of Serbia bought the relics from the Ottoman sultan Murad II for 30,000 gold coins.[http://www.traces-cl.com/archive/2000/novembre/luca.htm The Beloved Physician]  St Luke, Padua.Wade, Nicholas. \"[https://query.nytimes.com/gst/fullpage.html?res=9A05E6D61E3FF935A25753C1A9679C8B63 Body of St. Luke Gains Credibility].\" New York Times, October 16, 2001. After the Ottoman conquest of Bosnia, the kingdom's last queen, George's granddaughter Mary, who had brought the relics with her from Serbia as her dowry, sold them to the Venetian Republic.Van Antwerp Fine, John, The Bosnian Church: a new interpretation: a study of the Bosnian Church and its place in state and society from the 13th to the 15th centuries, p. 331, East European quarterly, 1975.\n\nIn 1992, the then Greek Orthodox Metropolitan Ieronymos of Thebes and Levathia (the current Archbishop of Athens and All Greece) requested from Bishop Antonio Mattiazzo of Padua the return of \"a significant fragment of the relics of St. Luke to be placed on the site where the holy tomb of the Evangelist is located and venerated today\". This prompted a scientific investigation of the relics in Padua, and by numerous lines of empirical evidence (archeological analyses of the Tomb in Thebes and the Reliquary of Padua, anatomical analyses of the remains, Carbon-14 dating, comparison with the purported skull of the Evangelist located in Prague) confirmed that these were the remains of an individual of Syrian descent who died between 416 BC and AD 72. The Bishop of Padua then delivered to Metropolitan Ieronymos the rib of Saint Luke that was closest to his heart to be kept at his tomb in Thebes, Greece.\n\nThus, nowadays, the relics of Saint Luke are so divided:\n* The body, in the Abbey of Santa Giustina in Padua;\n* The head, in the St. Vitus Cathedral in Prague;\n* A rib, at his tomb in Thebes.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Luke the Evangelist" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18710" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Luke the Evangelist (Latin: Lūcās, , Loukãs, , Lūqās, , Lūqā’) is one of the Four Evangelists—the four traditionally ascribed authors of the canonical Gospels. The early church fathers ascribed to him authorship of both the Gospel according to Luke and the book of the Acts of the Apostles, which would mean Luke contributed over a quarter of the text of the New Testament, more than any other author. Prominent figures in early Christianity such as Jerome and Eusebius later reaffirmed his authorship, although the fragile evidence of the identity of the author of the works has led to discussion in scholarly circles, both secular and religious.\n\nThe New Testament mentions Luke briefly a few times, and the Pauline epistle to the Colossians refers to him as a physician (from Greek for 'one who heals'); thus he is thought to have been both a physician and a disciple of Paul. Christians since the faith's early years have regarded him as a saint. He is believed to have been a martyr, reportedly having been hanged from an olive tree, though some believe otherwise.\n\nThe Roman Catholic Church and other major denominations venerate him as Saint Luke the Evangelist and as a patron saint of artists, physicians, bachelors, surgeons, students and butchers; his feast day takes place on 18 October.\n\nLife \n\nMany scholars believe that Luke was a Greek physician who lived in the Greek city of Antioch in Ancient Syria, although some other scholars and theologians think Luke was a Hellenic Jew.Harris, Stephen L., Understanding the Bible. Palo Alto: Mayfield. 1985. \"The Gospels\" pp. 266–68Strelan, Rick. [https://books.google.com/books?idAeTdi13weAoC&pg\nPA103 Luke the Priest – the Authority of the Author of the Third Gospel] – Was Luke a Jew or Gentile? Ashgate Publishing, Ltd., May 1, 2013, pp. 102–10. Bart Koet stated that it was widely accepted that the theology of Luke–Acts points to a gentile Christian writing for a gentile audience. Although he concludes that it is more plausible that Luke-Acts is directed to a community made up of both Jewish and gentile Christians, because there is stress on the scriptural roots of the gentile mission (see the use of Isaiah 49,6 in Luke-Acts).Koet, Bart J., Five Studies on Interpretation of Scripture in Luke-Acts. Leuven University Press, 1989. pp. 157-158 Koet, Bart J., Dreams and Scripture in Luke-Acts. Leuven University Press, 2006. pp. 4-5 Gregory Sterling claims that he was either a Hellenistic Jew or a god-fearer.\n\nHis earliest notice is in Paul's Epistle to Philemon—. He is also mentioned in  and , two works commonly ascribed to Paul.The New Testament Documents: Their Origin and Early History, George Milligan, 1913, Macmillan and Co., p. 149Saints: A Visual Guide, Edward Mornin, Lorna Mornin, 2006, Eerdmans Books, p. 74\n[http://www.newadvent.org/cathen/09420a.htm \"Gospel of Saint Luke\"], Aherne, Cornelius, The Catholic Encyclopedia. Vol. 9. New York: Robert Appleton Company, 1910. 24 Feb. 2013New Outlook, Alfred Emanuel Smith, 1935, Outlook Pub. Co., p. 792New Testament Studies. I. Luke the Physician: The Author of the Third Gospel, Adolf von Harnack, 1907, Williams & Norgate; G.P. Putnam's Sons, p. 5 The next earliest account of Luke is in the Anti-Marcionite Prologue to the Gospel of Luke, a document once thought to date to the 2nd century, but which has more recently been dated to the later 4th century. Helmut Koester, however, claims that the following part, the only part preserved in the original Greek, may have been composed in the late 2nd century:\n\nEpiphanius states that Luke was one of the Seventy Apostles (Panarion 51.11), and John Chrysostom indicates at one point that the \"brother\" Paul mentions in the Second Epistle to the Corinthians 8:18 is either Luke or Barnabas.\n\nIf one accepts that Luke was in fact the author of the Gospel bearing his name and also the Acts of the Apostles, certain details of his personal life can be reasonably assumed. While he does exclude himself from those who were eyewitnesses to Jesus' ministry, he repeatedly uses the word \"we\" in describing the Pauline missions in Acts of the Apostles, indicating that he was personally there at those times.Encyclopædia Britannica, Micropædia vol. 7, pp. 554–55. Chicago: Encyclopædia Britannica, Inc, 1998. .\n\nThere is similar evidence that Luke resided in Troas, the province which included the ruins of ancient Troy, in that he writes in Acts in the third person about Paul and his travels until they get to Troas, where he switches to the first person plural. The \"we\" section of Acts continues until the group leaves Philippi, when his writing goes back to the third person. This change happens again when the group returns to Philippi. There are three \"we sections\" in Acts, all following this rule. Luke never stated, however, that he lived in Troas, and this is the only evidence that he did.\n\nThe composition of the writings, as well as the range of vocabulary used, indicate that the author was an educated man. A quote in the Epistle to the Colossians differentiates between Luke and other colleagues \"of the circumcision.\"\n\nThis comment has traditionally caused commentators to conclude that Luke was a gentile. If this were true, it would make Luke the only writer of the New Testament who can clearly be identified as not being Jewish. However, that is not the only possibility. Although Luke is considered likely to be a gentile Christian, some scholars believe him to be a Hellenized Jew.Thomas S. McCall, Th.D. [http://www.levitt.com/essays/luke Was Luke a Gentile?] The phrase could just as easily be used to differentiate between those Christians who strictly observed the rituals of Judaism and those who did not.\n\nLuke's presence in Rome with the Apostle Paul near the end of Paul's life was attested by 2 Timothy 4:11: \"Only Luke is with me\". In the last chapter of the Book of Acts, widely attributed to Luke, we find several accounts in the first person also affirming Luke's presence in Rome including : \"And when we came to Rome...\" According to some accounts, Luke also contributed to the authorship of the Epistle to the Hebrews.\n\nLuke died at age 84 in Boeotia, according to a \"fairly early and widespread tradition\".Michael Walsh, ed. \"Butler's Lives of the Saints.\" (HarperCollins Publishers: New York, 1991), p. 342. According to Nikephoros Kallistos Xanthopoulos (Ecclesiastical History 14th century AD., Migne P.G. 145, 876) and others, Luke's tomb was located in Thebes, whence his relics were transferred to Constantinople in the year 357.\n\nThe authorship of Luke and Acts \n\nThe Gospel of Luke does not name its author.E. P. Sanders, The Historical Figure of Jesus, (Penguin, 1995) pp. 63–64.Bart D. Ehrman (2000:43) The New Testament: a historical introduction to early Christian writings. Oxford University Press.Geoffrey W. Bromiley (1995:287) [https://books.google.com/books?id\nr7QTYwYvvx0C&pgPA287&dq\nmatthew,+like+the+other+three+Gospels+is+an+anonymous+document.&hlnl&ei\nulSOTJXtKNS7jAfajcGhBg&saX&oi\nbook_result&ctresult&resnum\n2&ved0CCwQ6AEwAQ#v\nonepage&qmatthew%2C%20like%20the%20other%20three%20Gospels%20is%20an%20anonymous%20document.&f\nfalse International Standard Bible Encyclopedia: K-P] Matthew, Gospel According To. Wm. B. Eerdmans Publishing. Quote: \"Matthew, like the other three Gospels is an anonymous document.\"Donald Senior, Paul J. Achtemeier, Robert J. Karris (2002:328) [https://books.google.com/books?idVrmW1eXBILgC&pg\nPA328&dqgospels+anonymous&hl\nnl&ei9V6OTMiWJMiOjAfs05X8BQ&sa\nX&oibook_result&ct\nresult&resnum5&ved\n0CEgQ6AEwBA#vonepage&q\ngospels%20anonymous&ffalse Invitation to the Gospels] Paulist Press.Keith Fullerton Nickle (2001:43) [https://books.google.com/books?id\n5SSytjasmAgC&pgPA43&dq\ngospels+anonymous&hlnl&ei\n9V6OTMiWJMiOjAfs05X8BQ&saX&oi\nbook_result&ctresult&resnum\n6&ved0CE8Q6AEwBQ#v\nonepage&qgospels%20anonymous&f\nfalse The Synoptic Gospels: an introduction] Westminster John Knox Press.Ben Witherington (2004:44) [https://books.google.com/books?id_1zuyIimlzcC&pg\nPA44&dqgospels+anonymous&hl\nnl&ei9V6OTMiWJMiOjAfs05X8BQ&sa\nX&oibook_result&ct\nresult&resnum7&ved\n0CFQQ6AEwBg#vonepage&q\ngospels%20anonymous&ffalse The Gospel code: novel claims about Jesus, Mary Magdalene, and Da Vinci] InterVarsity Press.F. F. Bruce (1994:1) [https://books.google.com/books?id\n0MzO2GD62JUC&pgPA1&dq\ngospels+anonymous&hlnl&ei\n9V6OTMiWJMiOjAfs05X8BQ&saX&oi\nbook_result&ctresult&resnum\n8&ved0CFkQ6AEwBw#v\nonepage&qgospels%20anonymous&f\nfalse The Gospel of John] Wm. B. Eerdmans Publishing.Patrick J. Flannagan (1997:16) [https://books.google.com/books?idLYjpVXhF-GIC&pg\nPA16&dqgospels+anonymous&hl\nnl&ei9V6OTMiWJMiOjAfs05X8BQ&sa\nX&oibook_result&ct\nresult&resnum10&ved\n0CGMQ6AEwCQ#vonepage&q\ngospels%20anonymous&ffalse The Gospel of Mark Made Easy] Paulist Press The Gospel was not written and does not claim to be written by direct witnesses to the reported events, unlike Acts beginning in the sixteenth chapter.Bart D. Ehrman (2005:235) [https://books.google.com/books?idURdACxKubDIC&pg\nPA235&dqehrman+gospels+%22do+not+claim+to+be+written&hl\nnl&eic4IXTPWcC4WWsQavv9HiCQ&sa\nX&oibook_result&ct\nresult&resnum2&ved\n0CDMQ6AEwAQ#vonepage&q&f\nfalse Lost Christianities: the battles for scripture and the faiths we never knew] Oxford University Press, New York.Bart D. Ehrman (2004:110) [https://books.google.com/books?idvbLK6kn5T-EC&pg\nPA110&dqehrman+gospels+%22don%27t+even+claim+to+be+written&hl\nnl&einYQXTJDEKpaisQboquDmCQ&sa\nX&oibook_result&ct\nresult&resnum1&ved\n0CC4Q6AEwAA#vonepage&q&f\nfalse Truth and Fiction in The Da Vinci Code: A Historian Reveals What We Really Know about Jesus, Mary Magdalene, and Constantine.] Oxford University Press.Bart D. Ehrman (2006:143) [https://books.google.com/books?id\noBuJMhJlTYwC&pgPA143&dq\nehrman+gospels+%22do+not+claim+to+be+written&hlnl&ei\nc4IXTPWcC4WWsQavv9HiCQ&saX&oi\nbook_result&ctresult&resnum\n1&ved0CC4Q6AEwAA#v\nonepage&q&f=false The lost Gospel of Judas Iscariot: a new look at betrayer and betrayed.] Oxford University Press.\n\nThe earliest manuscript of the Gospel, dated circa AD 200, ascribes the work to Luke; as did Irenaeus, writing circa AD 180, and the Muratorian fragment from AD 170.Brown, Raymond E. An Introduction to the New Testament, p. 267. Anchor Bible; 1st edition (October 13, 1997). .\n\nThe gospel of Luke and the Acts of the Apostles make up a two-volume work which scholars call Luke–Acts. Together they account for 27.5% of the New Testament, the largest contribution by a single author.\n\nAs a historian \n\nMost scholars understand Luke's works (Luke–Acts) in the tradition of Greek historiography.[http://www.religion-online.org/showchapter.asp?title\n1116&C1230 Grant, Robert M., \"A Historical Introduction to the New Testament\" (Harper and Row, 1963)]  The preface of The Gospel of Luke drawing on historical investigation identified the work to the readers as belonging to the genre of history.Richard Bauckham, Jesus and the Eyewitnesses. 117. There is some disagreement about how best to treat Luke's writings, with some historians regarding Luke as highly accurate, and others taking a more critical approach.\n\nBased on his accurate description of towns, cities and islands, as well as correctly naming various official titles, archaeologist Sir William Ramsay wrote that \"Luke is a historian of the first rank; not merely are his statements of fact trustworthy... [he] should be placed along with the very greatest of historians.\"Ramsay, The Bearing Of Recent Discovery On The Trustworthiness Of The New Testament, 222, 1915 Professor of Classics at Auckland University, E.M. Blaiklock, wrote: \"For accuracy of detail, and for evocation of atmosphere, Luke stands, in fact, with Thucydides. The Acts of the Apostles is not shoddy product of pious imagining, but a trustworthy record... it was the spadework of archaeology which first revealed the truth.\"Blaiklock, The Archaeology of the New Testament, p. 96, Zondervan Publishing Houst, Grand Rapids, Michigan, 1970. New Testament scholar Colin Hemer has made a number of advancements in understanding the historical nature and accuracy of Luke's writings.Hemer, \"The Book of Acts in the Setting of Hellenic History\", 104–07, as summarized by MacDowell.\n\nOn the purpose of Acts, New Testament Scholar Luke Timothy Johnson has noted that \"Luke's account is selected and shaped to suit his apologetic interests, not in defiance of but in conformity to ancient standards of historiography.\" Such a position is shared by most commentators such as Richard Heard who sees historical deficiencies as arising from \"special objects in writing and to the limitations of his sources of information.\"\n\nDuring modern times, Luke's competence as a historian is questioned, depending upon one's a priori view of the supernatural. Since post-Enlightenment historians work with methodological naturalism,McGrew, Timothy, \"Miracles\", The Stanford Encyclopedia of Philosophy (Winter 2015 Edition), Edward N. Zalta (ed.), http://plato.stanford.edu/entries/miracles/Flew, Antony, 1966, God and Philosophy, London: Hutchinson.Ehrman, Bart D., 2003, The New Testament: A Historical Introduction to the Early Christian Writings, 3rd ed., New York: Oxford University Press.Bradley, Francis Herbert, 1874, “The Presuppositions of Critical History,” in Collected Essays, vol. 1, Oxford, Clarendon Press, 1935.McGrew's conclusion: historians work with methodological naturalism, which precludes them from establishing miracles as objective historical facts (Flew 1966: 146; cf. Bradley 1874/1935; Ehrman 2003: 229). such historians would see a narrative that relates supernatural, fantastic things like angels, demons etc., as problematic as a historical source. Mark Powell claims that \"it is doubtful whether the writing of history was ever Luke's intent. Luke wrote to proclaim, to persuade, and to interpret; he did not write to preserve records for posterity. An awareness of this, has been, for many, the final nail in Luke the historian’s coffin.\"\n\nRobert M. Grant has noted that although Luke saw himself within the historical tradition, his work contains a number of statistical improbabilities such as the sizable crowd addressed by Peter in Acts 4:4. He has also noted chronological difficulties whereby Luke \"has Gamaliel refer to Theudas and Judas in the wrong order, and Theudas actually rebelled about a decade after Gamaliel spoke (5:36–7)\"\n\nAs an artist \n\nChristian tradition, starting from the 8th century, states that he was the first icon painter. He is said to have painted pictures of the Virgin Mary and Child, in particular the Hodegetria image in Constantinople (now lost). Starting from the 11th century a number of painted images were venerated as his autograph works, including for example, the Black Madonna of Częstochowa and Our Lady of Vladimir. He was also said to have painted Saints Peter and Paul, and to have illustrated a gospel book with a full cycle of miniatures.Grigg, Robert, \"Byzantine Credulity as an Impediment to Antiquarianism\", Gesta, Vol. 26, No. 1 (1987), pp. 5–6, The University of Chicago Press on behalf of the International Center of Medieval Art, [https://www.jstor.org/stable/767073 JSTOR]The basic study on the legends concerning Saint Luke as a painter is Michele Bacci, Il pennello dell'Evangelista. Storia delle immagini sacre attribuite a san Luca (Pisa: Gisem, 1998).\n\nLate medieval Guilds of St Luke in the cities of Late Medieval Europe, especially Flanders, or the \"Accademia di San Luca\" (Academy of Saint Luke) in Rome—imitated in many other European cities during the 16th century—gathered together and protected painters. The tradition that Luke painted icons of Mary and Jesus has been common, particularly in Eastern Orthodoxy. The tradition also has support from the Saint Thomas Christians of India who claim to still have one of the Theotokos icons that Saint Luke painted and which St. Thomas brought to India.Father H. Hosten in his book Antiquities notes the following \"The picture at the mount is one of the oldest, and, therefore, one of the most venerable Christian paintings to be had in India. Other traditions hold that St. Luke painted two icons which currently are in Greece: the \"Theotokos Mega Spileotissa\" (Our Lady of the Great Cave, where supposedly Saint Luke lived for a period of time in asceticism) and the \"Panagia Soumela\", and \"Panagia Kykkou\" which are in Cyprus.\"\n\nSymbol \n\nIn traditional depictions, such as paintings, evangelist portraits and church mosaics, Saint Luke is often accompanied by an ox or bull, usually having wings. Sometimes only the symbol is shown, especially when in a combination of those of all Four Evangelists. Reprinted by Kessinger Publishing, 2003, .\n\nRelics \n\nDespot George of Serbia bought the relics from the Ottoman sultan Murad II for 30,000 gold coins.[http://www.traces-cl.com/archive/2000/novembre/luca.htm The Beloved Physician]  St Luke, Padua.Wade, Nicholas. \"[https://query.nytimes.com/gst/fullpage.html?res=9A05E6D61E3FF935A25753C1A9679C8B63 Body of St. Luke Gains Credibility].\" New York Times, October 16, 2001. After the Ottoman conquest of Bosnia, the kingdom's last queen, George's granddaughter Mary, who had brought the relics with her from Serbia as her dowry, sold them to the Venetian Republic.Van Antwerp Fine, John, The Bosnian Church: a new interpretation: a study of the Bosnian Church and its place in state and society from the 13th to the 15th centuries, p. 331, East European quarterly, 1975.\n\nIn 1992, the then Greek Orthodox Metropolitan Ieronymos of Thebes and Levathia (the current Archbishop of Athens and All Greece) requested from Bishop Antonio Mattiazzo of Padua the return of \"a significant fragment of the relics of St. Luke to be placed on the site where the holy tomb of the Evangelist is located and venerated today\". This prompted a scientific investigation of the relics in Padua, and by numerous lines of empirical evidence (archeological analyses of the Tomb in Thebes and the Reliquary of Padua, anatomical analyses of the remains, Carbon-14 dating, comparison with the purported skull of the Evangelist located in Prague) confirmed that these were the remains of an individual of Syrian descent who died between 416 BC and AD 72. The Bishop of Padua then delivered to Metropolitan Ieronymos the rib of Saint Luke that was closest to his heart to be kept at his tomb in Thebes, Greece.\n\nThus, nowadays, the relics of Saint Luke are so divided:\n* The body, in the Abbey of Santa Giustina in Padua;\n* The head, in the St. Vitus Cathedral in Prague;\n* A rib, at his tomb in Thebes. Luke the Evangelist. http://en.wikipedia.org/?curid=18710."
  }
}
