{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19190",
  "eid" : "38aae3e0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778604318,
  "textBody" : "The Miami Dolphins are a professional American football franchise based in the Miami metropolitan area. The Dolphins compete in the National Football League (NFL) as a member club of the league's American Football Conference (AFC) East division. The Dolphins play their home games at Hard Rock Stadium in the northern suburb of Miami Gardens, Florida, and are headquartered in Davie, Florida. The Dolphins are Florida's oldest professional sports team. Of the four AFC East teams, they are the only team in the division that was not a charter member of the American Football League (AFL).\n\nThe Dolphins team was founded by attorney-politician Joe Robbie and actor-comedian Danny Thomas. They began play in the AFL in 1966. The region had not had a professional football team since the days of the Miami Seahawks, who played in the All-America Football Conference in 1946 before becoming the first incarnation of the Baltimore Colts. For the first few years the Dolphins' full-time training camp and practice facilities were at Saint Andrew's School, a private boys boarding prep school in Boca Raton. In 1970 the Dolphins joined the NFL when the AFL–NFL merger occurred.\n\nThe team made its first Super Bowl appearance in Super Bowl VI, but lost to the Dallas Cowboys, 24–3. The following year, the Dolphins completed the NFL's only perfect season culminating in a Super Bowl win, winning all 14 of their regular-season games, both of their NFL playoff games, and also Super Bowl VII. The 1972 Dolphins were the third NFL team to accomplish a perfect regular season, and won Super Bowl VIII, becoming the first team to appear in three consecutive Super Bowls, and the second team (the first AFL/AFC team) to win back-to-back championships. Miami also appeared in Super Bowl XVII and Super Bowl XIX, losing both games.\n\nFor most of their early history, the Dolphins were coached by Don Shula, the most successful head coach in professional football history in terms of total games won. Under Shula, the Dolphins posted losing records in only two of his 26 seasons as the head coach. During the period spanning 1983 to the end of 1999, quarterback Dan Marino became one of the most prolific passers in NFL history, breaking numerous league passing records. Marino led the Dolphins to five division titles, 10 playoff appearances, and Super Bowl XIX before retiring following the 1999 season.\n\nHistory\n\nThe Miami Dolphins joined the American Football League (AFL) when an expansion franchise was awarded to lawyer Joseph Robbie\nand actor Danny Thomas in 1965 for $7.5 million, although Thomas would eventually sell his stake in the team to Robbie. During the summer of 1966, the Dolphins' training camp was in St. Pete Beach with practices in August at Boca Ciega High School in Gulfport.Armistead, Tom \"On the Departing Dolphins: Observations and Conclusions\" (August 4, 1966), Evening Independent\n\nEarly years (1966–1970)\n\nThe Dolphins had a combined 15–39–2 record in their first four seasons under head coach George Wilson, before Don Shula was hired as head coach. Shula was a Paul Brown disciple who had been lured from the Baltimore Colts after losing Super Bowl III two seasons earlier to the AFL's New York Jets and finishing 8–5–1 the following season. Interestingly, Shula got his first NFL coaching job from then-Detroit Head Coach George Wilson, who hired him as the defensive coordinator. When Shula replaced Wilson at Miami the Colts charged the Dolphins with tampering in their hiring of Shula, costing the Dolphins their first round draft pick in 1971. Shula introduced himself to the Miami press by saying that he didn't have any magic formulas and that the only way he knew to make his teams successful was through hard work. Shula's early training camps with the Dolphins, with four workouts a day, would soon be the stuff of sweltering, painful legend. But Shula's hard work paid immediate dividends, as Miami improved to a 10–4 record and their first-ever playoff appearance, losing 21–14 at Oakland.\n\nChampionship years/The perfect season (1971–1974)\n\nThe Dolphins were successful in the early 1970s, becoming the first team to advance to the AFC Championship for three consecutive seasons. They captured the AFC championship in 1971 behind quarterback Bob Griese, running backs Larry Csonka and Jim Kiick, and wide receiver Paul Warfield. The AFC Divisional Playoff Game, in which the Dolphins defeated the Kansas City Chiefs, was the longest contest in NFL history (82 minutes 40 seconds). In Super Bowl VI, however, Miami lost to the Dallas Cowboys 24–3.\n\nIn 1972, the Dolphins completed the only fully undefeated season in the NFL, winning all 14 regular season games, two playoff games and Super Bowl VII, defeating the Washington Redskins 14–7. They finished the season 17-0, and are the only team to complete an undefeated season and win the NFL title. QB Bob Griese was victim to a broken leg and dislocated ankle in Week 5 versus the San Diego Chargers and was replaced by veteran Earl Morrall for the rest of the regular season, but returned to the field as a substitute during the AFC Championship game versus the Pittsburgh Steelers and then started in Super Bowl VII. The Dolphins set the NFL single-season rushing record, and running backs Csonka and Mercury Morris became the first teammates to each rush for 1,000 yards in a season. The offensive line included future Hall of Fame members Jim Langer and Larry Little and Pro Bowler Bob Kuechenberg. The 1972 Dolphins defensive unit, called the No-Name Defense because Miami's impressive offense received much more publicity, was the league's best that year. It was led by linebacker Nick Buoniconti, end Bill Stanfill, tackle Manny Fernandez and safeties Dick Anderson and Jake Scott. They secured the team rushing record by averaging more than 200 yards per game on the ground for an entire season, while the defense allowed only 171 points.\n\nPrior to the 1972 Dolphins, only the Chicago Bears, in 1934 and 1942, had finished an NFL regular season with no losses or ties. The 1934 team lost the NFL Championship Game that year to the New York Football Giants, and the 1942 team lost the Championship to the Redskins. The Cleveland Browns were undefeated in the 1948 All-America Football Conference season.\n\nThe Dolphins finished 12–2 after the 1973 regular season and repeated as NFL champions, beating the Minnesota Vikings 24–7 in Super Bowl VIII at Rice Stadium in Houston. Miami reached the playoffs again in 1974 but lost in the first round to the Oakland Raiders, in what has entered NFL lore as the \"Sea of Hands\" game, considered one of the greatest games ever played. Following the 1974 season, the Dolphins lost Csonka, Kiick, and Warfield to the World Football League.\n\nAfter the championship years (1975–1982)\n\nMiami rebounded from an injury-plagued 6–8 record in 1976 by winning ten or more games in four of the next five seasons. Shula built a solid defense around a new set of stars, including linebacker A. J. Duhe and linemen Bob Baumhower and Doug Betters. The Dolphins went 10–4 again in 1977, but again lost the division title (and playoff spot) to the Colts, similar to the team's fate in 1975. They made the playoffs as a wild card in 1978, but lost in the first round to the Houston Oilers 17–9.\n\nCsonka returned to the Dolphins in time for the 1979 season. After winning the division with a 10–6 record, the Dolphins lost the divisional playoff 34–14 to the eventual Super Bowl champion Pittsburgh Steelers at Three Rivers Stadium.\n\nThe Dolphins also accomplished another feat unmatched before or since by another NFL team. They beat their division rival Buffalo Bills 20 consecutive times in a decade. The Bills were \"0 for the seventies\" against the Dolphins, but would defeat them in their 1980 season opener.\n\nIn 1980, David Woodley, an athletic quarterback out of LSU, took over for Bob Griese, who severely injured his shoulder in a game against the Baltimore Colts. Griese never played again, retiring after the season. The Dolphins finished 8–8 and did not make the playoffs.\n\nThe Dolphins were back up on top of the AFC East in the 1981 NFL season, with an 11–4–1 record. That season, the Dolphins quarterback position was manned by both Woodley and back-up quarterback Don Strock, causing the local media to identify the Miami quarterback as \"Woodstrock.\" They reached the divisional playoff against the San Diego Chargers, known as The Epic in Miami and remembered as one of the most memorable games in NFL history. After being down 24–0 at the end of the first quarter, Don Strock entered the game and engineered a frenetic comeback, culminating in the historic \"hook and lateral\" play: On the last play of the first half' wide receiver Duriel Harris caught a pass from Strock and immediately lateraled the ball to streaking running back Tony Nathan who scored to cut the Chargers lead to 24–17.https://www.youtube.com/watch?v=LUHqAxXjSs8 After the Dolphins took the lead in the fourth quarter, San Diego tied it up 38–38 with under a minute to play. Chargers tight end Kellen Winslow, playing through exhaustion, blocked Uwe von Schamann's field goal try on the last play of regulation. In overtime, Von Schamann had another field goal attempt blocked, and Rolf Benirschke kicked the game-winner for San Diego (final score 41–38) after missing a chip shot field goal earlier. Strock finished the game with 403 passing yards and four touchdowns.\n\nIn the strike-shortened 1982 NFL season, the Dolphins, led by the \"Killer B's\" defense (Bob Baumhower, Bill Barnett, Lyle Blackwood, Kim Bokamper, Glenn Blackwood, Charles Bowser, Doug Betters, and Bob Brudzinski), held five of their nine opponents to 14 or fewer points en route to their fourth Super Bowl appearance. During the first two rounds of the 1982–83 NFL playoffs, they got revenge for previous losses, crushing the New England Patriots, 28–13 (revenge for the infamous Snow Plow game at Schaeffer Stadium played earlier in the season) and the San Diego Chargers, 34–13 at the Orange Bowl. In successive games against San Diego and the NY Jets, the ballhawking Miami defense logged ten interceptions, five each against Dan Fouts and Richard Todd. After shutting out the New York Jets in the AFC Championship 14–0 [paced by linebacker A. J. Duhe's three interceptions- the final one returned for the game-clinching touchdown in the fourth quarter], the Dolphins lost Super Bowl XVII to Washington, 27–17. After enjoying success rooted in a defense-first philosophy, and employing a ball control offense to take pressure off of lackluster quarterbacks, the next 17 seasons would be marked by an average rushing game and defense that limited a great quarterback.\n\nThe Dan Marino era (1983–1999)\n\nDuring the third game of the 1983 season at the Los Angeles Raiders on Monday Night Football, Shula replaced quarterback David Woodley with rookie Dan Marino, who threw 20 touchdowns with only 6 interceptions. Seldom sacked by defenders, Marino was protected by an outstanding offensive line as he passed to receivers such as Mark Clayton and Mark Duper. Despite the regular season success (the Dolphins went 12–4 winning their last five regular season games, the only team in the AFC East with a winning record), they were upset in the divisional playoff by the Seattle Seahawks at the Orange Bowl. Defensive end Doug Betters was named the NFL Defensive Player of the Year.\n\nIn 1984, the Dolphins won their first 11 games en route to a 14–2 season (the franchise's best 16-game season to date). Marino, in his first full season, produced one of the most impressive set of passing statistics in NFL history, setting single-season records for most yards (5,084), touchdown passes (48), and completions (362). He was voted NFL MVP. Miami avenged the Seahawks loss from the previous year 31–10 and crushed the Steelers 45–28 in the AFC Championship to advance to Super Bowl XIX. In the title game, however, Miami lost to the San Francisco 49ers 38–16. It would be Marino's only Super Bowl appearance.\n\nMiami finished 12–4–0 in 1985 and, in an epic Monday Night Football showdown, handed the previously-undefeated Chicago Bears their only defeat of the season. After rallying from a 21–3 third quarter deficit in the divisional playoffs to beat the Cleveland Browns 24–21, many people were looking forward to a rematch with Chicago in Super Bowl XX. The Cinderella New England Patriots, the Dolphins' opponents in the AFC Championship, had different plans. New England forced six turnovers on the way to a 31–14 win – the Patriots' first in Miami since 1966. The Patriots had lost 18 games in a row at the Orange Bowl. In 1969, the Boston Patriots had beaten the Dolphins at Tampa Stadium.\n\nIn 1986, the Dolphins, hampered by defensive struggles, stumbled to a 2–5 start and finished 8–8, missing the playoffs for the first time since 1980. They also lost their final game at the Orange Bowl, falling to the New England Patriots 34–27 on Monday Night Football. The problems continued in 1987, with an 8–7 (7–5 in non-strike games) record in a strike-shortened year, their first at new Joe Robbie Stadium. In 1988, Miami had its first losing season (6–10) since 1976, and finished 8–8 in 1989.\n\nShortly after the 1989 season was finished, Dolphins owner Joe Robbie died at the age of 73. Wayne Huizenga became majority owner of the Dolphins in 1994.\n\nIn 1990, the Dolphins shaped up on defense and finished with a 12–4 record, second in the AFC East. They came from behind to beat the Kansas City Chiefs 17–16 in the Wild Card round, but lost to the Buffalo Bills 44–34 in the divisional playoffs. The team struggled with defensive injuries in 1991, and narrowly missed the playoffs, losing the AFC's final berth in an overtime loss to the rival New York Jets in the final week of the season.\n\nThe Dolphins rebounded in 1992, starting the season 6–0 and finishing 11–5 to capture the AFC East title behind a career year from running back Mark Higgs and tight end Keith Jackson, newly acquired from the Philadelphia Eagles as an unrestricted free agent. They crushed the Chargers in the divisional playoffs 31–0, but were defeated by the Buffalo Bills 29–10 in the AFC Championship.\n\nDan Marino's season-ending Achilles injury in Cleveland led to the team missing the playoffs in 1993 despite a league-leading 9–2 start. Marino returned in 1994 to lead the Dolphins to a 10–6 record and the AFC East title. After defeating Joe Montana and the Kansas City Chiefs in the Wild Card round, the Dolphins gave up a 15-point halftime lead and suffered a 22–21 loss to the San Diego Chargers. Pete Stoyanovich missed a 46-yard field goal on the last play of the game and denied Marino a chance to play the Steelers for the AFC Championship in his hometown of Pittsburgh.\n\nIn 1995, Marino broke the career passing records held by Fran Tarkenton for yards (48,841), touchdowns (352), and completions (3,913), though two of the games where he broke those records were losses to the Indianapolis Colts. The Dolphins finished 9–7, second in the AFC East, but still made the playoffs as a wild card, losing to Buffalo in the first round. Following the 1995 season, Shula retired and became an executive in the Dolphins’ front office. Jimmy Johnson, who had won a collegiate national championship at the University of Miami and two Super Bowls with the Dallas Cowboys, was named as Shula's replacement. At the press conference announcing his retirement, Shula said that he \"agreed to step aside\", leading some to speculate that Huizenga had all but fired him.\n\nIn 1996, Miami finished 8–8 and out of the playoffs, with rookie Karim Abdul-Jabbar's 1,116-yard rushing season and the standout play of rookie linebacker Zach Thomas serving as two of the few bright spots. In 1997, Miami stumbled late and backed into the playoffs with a 9–7 season, losing to the New England Patriots in the Wild Card round.\n\nMiami had a solid 10–6 season in 1998 with a career season for receiver O.J. McDuffie, but it was not enough to get past the New York Jets into first place in the division. The Dolphins beat the Bills in the Wild Card round, but lost in the next round to the eventual champion Denver Broncos. (The Broncos lost only two regular season games in 1998, one of which was to the Dolphins.)\n\nIn 1999, the team advanced to the playoffs at 9–7. After a close win at Seattle in the Wild Card round 20–17, they suffered the second-worst playoff loss in NFL history losing to the Jacksonville Jaguars, 62–7 (the Chicago Bears beat the host Washington Redskins 73–0 in the 1940 NFL Championship game, the worst playoff game loss in league history). After the season, Jimmy Johnson left the team and Marino retired.\n\n2000–present\n\nBefore the 2000 season, Dave Wannstedt, formerly of the Chicago Bears, became the new coach, and ex-Jacksonville Jaguars backup Jay Fiedler became the new quarterback, even though former Marino backup Damon Huard had been considered the favorite. Despite lowered expectations, the defense broke through with Jason Taylor and Trace Armstrong each getting 10 sacks, and four players (Sam Madison, Brian Walker, Brock Marion and Patrick Surtain) tallying at least five interceptions. All-pro linebacker Zach Thomas also contributed many tackles. In addition, Lamar Smith rushed for 1,139 yards, and Miami finished atop the AFC East with an 11–5 record. In the first round of the playoffs, Miami took the Indianapolis Colts to overtime and won on a Lamar Smith touchdown run. Smith finished with 209 yards on 40 carries, but in the next round, the Dolphins were shut out by the Oakland Raiders, and a worn-out Smith was barely able to run. The 2001 off-season brought in rookie Chris Chambers at wide receiver, but Trace Armstrong left, as did two offensive linemen, Richmond Webb and Kevin Donnalley. During the 2001 season, the Dolphins relied on a strong defense to finish 11–5, earning a Wild Card spot and finishing second in the AFC East behind the eventual Super Bowl champions, the New England Patriots. The Dolphins lost in the first round of the playoffs, 20–3, to the Baltimore Ravens.\n\nMiami revitalized its running game in time for the 2002 season by trading for New Orleans Saints running back Ricky Williams. In addition, rookie tight end Randy McMichael had a productive season. Behind a new scheme under Norv Turner and a power running game led by Williams, Miami quickly rushed out to a 5–1 start, highlighted by the Dolphins' first victory over the New York Jets since 1997 and a last-minute comeback by Fiedler against the Broncos. However, Fiedler injured his thumb and missed the next six games. This intrigued some Dolphins fans, who believed backup Ray Lucas could outdo the much-maligned Fiedler, a view based in part on Lucas's 6–3 record with the 1999 Jets. However, Lucas was abysmal in losses to the Bills and Packers and merely average in a 13–10 loss to the Jets.  Miami rebounded with wins over Baltimore and an impressive thumping of San Diego, but were beaten 38–21 in a snowstorm at Buffalo; Lucas was benched and Fiedler made his return to the team. Still, Miami pulled off an impressive win over the Oakland Raiders and sat at 9–5 with two weeks left in the season, in prime position to steal the AFC East. However, they were beaten by the Vikings and then in Week 17 blew an 11-point lead late in the fourth quarter of a devastating loss to the Patriots. Due to a tiebreaker, both the Dolphins and Patriots lost out on the playoffs as the Jets took the AFC East title. Many fans called for Wannstedt's firing, but he was kept on for the 2003 season. Despite it all, the team believed it had plenty to look forward to, as Ricky Williams broke team records with 1,853 rushing yards and 16 touchdowns on the ground.\n \nThe Dolphins began the 2003 season with a 21–20 loss to the Houston Texans, but they rebounded to win four straight games. During a crushing overtime loss at the hands of the Patriots, Jay Fiedler was injured, forcing newly acquired backup Brian Griese to lead the Dolphins to victory the next week over San Diego. That, however, was Griese's high point, and after a good showing against Indianapolis in a losing effort (he threw for 231 yards and a touchdown in the 23–17 Colts win), he struggled against the Titans, throwing three interceptions in a 31–7 Tennessee win, and was highly ineffective against the Ravens, managing just 126 yards in a 9–6 overtime win.  The Dolphins fell behind to the Washington Redskins after Griese threw two interceptions; trailing 20–7, Fiedler came off the bench and led a comeback victory, 24–23. Miami looked like it might rebound thanks to a 40–21 Thanksgiving Day victory over the Dallas Cowboys that took them to 8–4, but two key losses to the Patriots and the Eagles ended Miami's postseason hopes. Miami finished 10–6 after victories over Buffalo and the Jets.\n\nThe 2004 offseason was disastrous for Miami. Tight end Randy McMichael was arrested for domestic violence and wide receiver David Boston (signed from San Diego) suffered an injury in training camp and missed the entire season (Boston also failed a drug test for steroids later in the season). But the biggest shock came when Ricky Williams retired for then-unspecified reasons. Eventually it was revealed that a) Williams had recently incurred his third strike under the NFL's substance abuse policy, and b) to a lesser degree felt he was unnecessarily overused by Wannstedt. Many experts predicted a disastrous season for the Dolphins. These predictions proved right as Miami dropped its first six games of the 2004 season, marking the worst start in franchise history at the time. The team fell to 1–8, leading Wannstedt to resign on November 9. He was replaced on an interim basis by defensive coordinator Jim Bates. The Dolphins fared slightly better under Bates, winning three of their final seven games, including a 29–28 upset victory over the defending champion Patriots. Despite this, the Dolphins decided not to hire Bates for the permanent coaching position.\n\nThe Dolphins hired LSU coach Nick Saban. With the second pick in the 2005 NFL Draft, Nick Saban elected to go with Auburn running back Ronnie Brown. The Dolphins struggled, losing seven of their first ten games to fall to 3–7. After a frustrating two months, however, the Dolphins rallied, winning their final six games, including a win to end the season over the New England Patriots. The team finished 9–7, missing the playoffs. \n\nIn the offseason the Dolphins showed major interest in signing free agent quarterback Drew Brees; however, Miami was unsure if Brees' shoulder was completely healed from a labrum tear he suffered with the San Diego Chargers. The Dolphins ended negotiations and traded for Minnesota Vikings QB Daunte Culpepper instead, a move that would haunt Miami Dolphins fans to this day. In Saban's second season, the Dolphins were expected to contend for a playoff spot. The season turned out to be a major disappointment. Culpepper never recovered from the devastating knee injury he suffered in 2005, was benched after the fourth game of the season and eventually put on injured reserve. After starting the season 1–6, the Dolphins won four straight and were back in the playoff hunt at 5–6, but a few losses later ended their playoff hopes. Saban then abandoned the Dolphins and took the head coaching position at the University of Alabama Crimson Tide after insisting that he was not interested. The Dolphins then hired Chargers offensive coordinator Cam Cameron as his replacement.\n\nThe Dolphins finished the 2007 season with a 1–15 record, the worst in franchise history. Late in the season, two-time Super Bowl winning coach Bill Parcells was named Executive Vice President of the Dolphins football operations. Shortly after the season finale, Parcells fired general manager Randy Mueller and on January 3, 2008, head coach Cam Cameron was fired along with almost all of his staff.\n\nParcells then hired Tony Sparano, who was previously an assistant under Parcells at the Dallas Cowboys. On the 2008 offseason, the Dolphins also parted ways with two long-time Dolphins, releasing linebacker Zach Thomas and trading defensive end Jason Taylor to the Washington Redskins for a second round draft pick. The Dolphins took Jake Long, star offensive lineman out of the University of Michigan with the first pick of the 2008 draft and drafted quarterback Chad Henne with their second round pick. After the New York Jets traded for Brett Favre and released quarterback Chad Pennington the same day, the Dolphins quickly signed Pennington. After starting the 2008 season with a 0–2 record the Dolphins used the \"wildcat\" offense against the New England Patriots on six plays, which produced four touchdowns (three rushing and one passing) in a 38–13 upset victory. The wildcat offense or single-wing was a \"new\" formation that allowed the Dolphins to utilize their two best offensive players, Ronnie Brown and Ricky Williams, both running backs. From that point on the Dolphins completed the greatest single-season turnaround in NFL history, going from a 1–15 in 2007 to 11–5. Additionally, Miami won the AFC East, becoming the first team in NFL history to win their division after only having one win the previous season. However, the Dolphins lost in the first round of the playoffs to the Baltimore Ravens, 27–9.\n\nIn 2009 the Dolphins again started off 0–2. In week 3 Chad Pennington suffered a shoulder injury against the San Diego Chargers and was out for the rest of the 2009 season. Second-year quarterback Chad Henne replaced him. Under Henne, the Dolphins won their first two games before losing to the Saints after leading 24–3 towards the end of the first half. The Dolphins finished the rest of the season without Ronnie Brown, who was sidelined by a Lisfranc foot injury that required surgery. Ricky Williams was the starter again and finished the season with 1,121 yards, surpassing his rookie year total at the age of 32. Miami ended the season with three consecutive losses to finish 7–9 and out of the playoffs.\n\nThe Dolphins looked to bounce back the next season by acquiring Brandon Marshall from the Denver Broncos for two second-round draft picks, and Karlos Dansby via free agency. Ronnie Brown and Ricky Williams returned to the team (while many speculated Williams would retire). In September 2010, Bill Parcells, stepped down as Vice President of Football Operations, but remained as a consultant. The Dolphins started out 2010 by winning their first two games at the Buffalo Bills and at the Minnesota Vikings. However, the rest of the season would be a disappointment.  They finished 7–9 again,  missing the playoffs for the 8th time in 9 years. Questions were raised about Chad Henne and Coach Sparano's futures with the team. It was reported that Stephen Ross was interested in hiring Stanford head coach Jim Harbaugh after flying to California to meet him; however, Ross denied those rumors, and in that same week he gave Tony Sparano a three-year extension.\n\nWith their first pick in the 2011 NFL Draft, and 15th selection overall, the Dolphins selected center Mike Pouncey from Florida.  Jason Taylor re-signed for his third stint.  The Dolphins got off to a disastrous 0-7 start, rebounded to win four of the next five games, and then lost 26–10 to the struggling Philadelphia Eagles, effectively ending their playoff contention and Tony Sparano's job as head coach. Todd Bowles stepped in as interim coach for the remainder of 2011. The Dolphins won two of their final three games, including a win over the Jets that ended the Jets' playoff chances and concluded Jason Taylor's NFL career.\n\nIn the offseason, fans organized a protest outside the Dolphins' team facility to call for the firing of General Manager Jeff Ireland. Looking to move on from the Tony Sparano era, the Dolphins hired Green Bay Packers offensive coordinator Joe Philbin on January 20, 2012, to mixed reactions from fans. The Dolphins were in contention to hire former NFL head coach Jeff Fisher, but he accepted the head coach position with the St. Louis Rams and the Dolphins hired Philbin instead. The Dolphins signed David Garrard after pursued several free agents for the position and selected Ryan Tannehill with the 8th pick in the 2012 NFL Draft. Garrard originally won the starting QB battle against Tannehill and Moore in training camp, but injured his knee in an accident at home. Tannehill won the starting job for the 2012 season after a strong showing in preseason and camp. Garrard was eventually released. In his first game as a professional football player, Tannehill struggled, throwing three interceptions in a loss on the road against the Houston Texans. But in his first home game, he ran for a touchdown and did not commit any turnovers while dominating the Oakland Raiders. Miami then lost back-to-back OT games against the Jets and the Arizona Cardinals, despite Tannehill throwing for 431 yards, the most ever for a rookie QB in a single game in team history, and receiver Brian Hartline racking up 253 receiving yards, the most ever by a Dolphin receiver, in the game against Arizona. Then they played Cincinnati on the road and won 17–13 win after Reshad Jones picked off the ball with under a minute and a half left in the game. Despite an impressive 4–3 start, the Dolphins lost a highly touted game against the Colts, 23–20, starting a 3-game losing streak. After staying in Wild Card contention through Week 16, Miami finished 7–9 after being shut out by the Patriots.\n\nWith many question marks about the future of some popular players, including Jake Long, the Dolphins went into the off-season looking for help at many positions. Despite the signings of Brandon Albert, Mike Wallace, Dannell Ellerbe, and a breakout season for Jelani Jenkins, the Dolphins finished the 2013 season at 8–8 and would have made the playoffs if not for a losing streak near the end of the season.\n\nAfter the 2013 season, general manager Jeff Ireland was fired, as urged by fans for the prior two years, and was replaced by Dennis Hickey. However, despite a 5-3 start, the Dolphins once again finished the 2014 season at 8-8 and missed the playoffs for a sixth consecutive season.\n\nIn January 2015, the Dolphins hired former New York Jets general manager Mike Tannenbaum to become the team's executive vice president of football operations.  Newly hired general manager Dennis Hickey would retain his power over the final 53-man roster. However, given Tannenbaum's history, it has been widely speculated that Tannenbaum has final say over personnel.  In March 2015, the Dolphins made the biggest free agent signing of the NFL off-season; they signed defensive tackle Ndamukong Suh to the richest contract in NFL history for any defensive player.  Suh's contract is for six years and $114 million ($60 million guaranteed). Two months later, in May 2015, the Dolphins locked up franchise quarterback Ryan Tannehill through the 2020 season with a contract extension worth $96 million ($45 million guaranteed).  However, the Dolphins began the 2015 season with a 1–3 record, which resulted in head coach Joe Philbin's firing on October 5, 2015, one day after the Dolphins lost to the Jets in London's Wembley Stadium.  Tight end coach Dan Campbell was appointed as interim head coach.\n\nOn January 9, 2016, Bears offensive coordinator Adam Gase was hired as head coach. The Dolphins swung a trade with the Philadelphia Eagles, sending the 8th overall pick for linebacker Kiko Alonso and cornerback Byron Maxwell and the 13th overall pick. The Adam Gase era got off to a lackluster start. However, the Dolphins upset the first place Pittsburgh Steelers, 30-15 in week 6, sparking a 6-game winning streak and launching the team into playoff contention at 7-4. After a blowout loss to the Baltimore Ravens, the Dolphins won three straight games against the Arizona Cardinals, New York Jets and Buffalo Bills to clinch their first playoff spot since 2008. The Dolphins finished 10-6 and locked up the number 6 seed in the playoffs. They were defeated in the first round by the Pittsburgh Steelers in a rematch of the week 6 contest. In the offseason, the Dolphins traded for tight end Julius Thomas, after being in need of someone in that position.\n\nDuring training camp in 2017, Tannehill suffered a torn ACL during a non-contact injury. The Dolphins brought veteran Jay Cutler out of retirement to start in Tannehill's place. Ultimately, the season was a disappointment as the Dolphins finished 6-10, finishing third in the AFC East.\n\nSuper Bowls\n\nAFC Championships\n\nRivalries\n\nThe Dolphins share intense rivalries with their three AFC East opponents, but also have had historical or occasional rivalries with other teams such as their cross-state rivals Tampa Bay Buccaneers, their former divisional rivals Indianapolis Colts, the Pittsburgh Steelers, San Diego/Los Angeles Chargers, Oakland Raiders, and to a lesser extent, the Jacksonville Jaguars.\nDivisional rivalries\n\nBuffalo Bills\n\nThe Dolphins and the Buffalo Bills share one of the more interesting rivalries in the league, as there are stark characteristic differences between the cities of Miami and Buffalo, especially in climate and culture. The rivalry was extremely lopsided in favor of Miami during the 1970s, as the Dolphins won all 20 games against the Bills during that decade. Fortunes changed in the 1980s and 1990s when Jim Kelly became the Bills' starting quarterback. Though both teams were extremely dominant during that period, the Bills ultimately held the edge and dominated the Dolphins during their four playoff match-ups in the 1990s, with the Dolphins' only playoff win coming after Kelly's retirement. With the rise of Tom Brady and the Patriots during the 2000s and the retirements of Kelly and Dolphins great Dan Marino, the Bills-Dolphins rivalry has faded in relevance, but remains somewhat intense to this day. Some former Dolphins have gone to play for the Bills as well, most notably Dan Carpenter, Chris Hogan, and Charles Clay.\n\nNew England Patriots\n\nThe Dolphins dominated the New England Patriots during the 1970s and the 1990s, but there were some notable moments as well, including a game now known as the Snowplow Game. Fortunes changed when Tom Brady became the franchise quarterback for the Patriots, and since then, the Patriots have virtually dominated the AFC, especially the AFC East. Miami did pose more of a challenge to the Brady-led Patriots in the 2000s, however, winning more games against them than the Bills or Jets did during that decade. Miami and New England are also the only two franchises to have posted undefeated regular season records since the NFL-AFL merger, with Miami going 14-0 in 1972 and New England going 16-0 in 2007, but only the 1972 Dolphins were able to win the Super Bowl.\n\nNew York Jets\n\nThe New York Jets are perhaps Miami's most bitter rivals. Dolphins fans despise the Jets due to the sheer amount of New York City transplants who have moved to South Florida and the Jets' usual cocky demeanor. Just as the Bills-Dolphins rivalry is motivated by differences, the Dolphins-Jets series is also notable for the differences between New York and Miami. Unlike the former, this rivalry has been more consistent over the years. Some of the more memorable moments in this rivalry include Dan Marino's fake spike, Vinny Testaverde leading the Jets to a notable comeback on Monday Night Football, and former Jets quarterback Chad Pennington signing with the Dolphins and leading them to a divisional title. The two teams have also played in the 1982 AFC Championship, with Miami winning to face the Washington Redskins in Super Bowl XVII.\n\nOther\n\nTampa Bay Buccaneers\n\nFacilities\n\nStadiums\n\nThe Dolphins originally played all home games in the Orange Bowl in Miami. They moved to the new Joe Robbie Stadium after the 1986 season. From 1993-2011, the Dolphins shared the stadium with Major League Baseball's Florida Marlins. The venue has had multiple naming rights deals since 1996, carrying the names Pro Player Stadium, Dolphins Stadium, Dolphin Stadium, LandShark Stadium, Sun Life Stadium, New Miami Stadium and, as of August 2016, Hard Rock Stadium. The facility is located in Miami Gardens, a suburb of Miami located approximately 15 mi north of downtown Miami. The Miami Dolphins share Hard Rock Stadium with the NCAA Miami Hurricanes. The 2015–2016 season will be the first season in the newly renovated Hard Rock Stadium. The Dolphins spent more than two years and over $400 million on a major overhaul to Hard Rock Stadium. Every seat has been replaced and the lower level seats have been moved closer to the field. There will be roughly 10,000 fewer seats.\n\nTraining\n\nSt. Petersburg Beach hosted the Dolphins' first training camp in 1966. Saint Andrew's School (Boca Raton, Florida) hosted training camp in the late 60's. The Dolphins subsequently trained in Miami Gardens at Biscayne College, later renamed St. Thomas University, from 1970 until 1993.\n\nIn 1993, the Dolphins opened the Miami Dolphins Training Facility at Nova Southeastern University in Davie, Florida. In 2006, the facility added a domed field which allows the team to practice during thunderstorms which are common during the summer.\n\nFranchise information\n\nLogos and uniforms\n\nLeaping dolphin (1966–2012)\n\nThe Dolphins logo and uniforms remained fairly consistent from the team's founding through 2012. The team's colors were originally aqua and coral, with the original logo consisted of a sunburst with a leaping dolphin wearing a football helmet bearing the letter M. At their debut in 1966, the dolphin's head was near the center of the sunburst. For the 1967, the dolphin was in the center of the sunburst, but reverted to the original logo between 1968 and 1973.  By 1974, the dolphin's body was centered on the sunburst in a slightly smaller logo than the 1967 version. The uniforms featured white pants with aqua and coral stripes, paired with either a white or aqua jersey. On the white jersey, aqua block numbers and names were outlined in coral, with aqua and coral sleeve stripes. These uniforms were used as the primary uniforms for road games and daytime home games, due to the extreme heat of South Florida.  The team also had an aqua jersey used mainly for night home games or road games in which the opponent chose to wear white.  The aqua jersey featured white block numbers and names with an coral outline, and coral and white sleeve stripes.\n\nAn update was given to the logo in 1997: the sunburst was simplified and the dolphin was darkened and given a more serious game-face expression.  The uniforms remained the same, however a different block number font was used and navy drop shadows were added.\n\nOn very rare occasions, an orange jersey was used for primetime games. The uniforms essentially swapped the location of orange and aqua from the aqua jersey. The orange jersey was first used on a Sunday night in 2003 against Washington, a Dolphin win. In 2004, the orange jersey was brought back for an ABC Monday Night Football match pitting the 2-11 Dolphins against the 12-1 defending champion New England Patriots. The Dolphins scored a huge upset win after trailing by 11 points with less than 5 minutes remaining. Due to the unusual orange jerseys, the game has become known within some Dolphin circles as \"The Night That Courage Wore Orange\". The orange jerseys were used for a 2009 Monday night win against the New York Jets. However, the Dolphins would lose a 2010 Sunday night matchup with the Jets, their first loss in orange, and the jerseys would not be worn again until a 2016 Thursday night defeat in Cincinnati.\n\nIn 2009, the Dolphins switched to black shoes for the first time since the glory days, following a recent trend among NFL teams. However, by 2011, they returned to wearing white shoes.\n\nThe Dolphins' final game in the original style uniforms with block numbers and the iconic leaping dolphin logo was the final game of the 2012 season, a 28-0 shutout loss to the New England Patriots in Foxboro. The white jerseys were worn for the game, and as rumors of a new look had been swirling, many fans watching knew that it would likely be the last time their team would wear the leaping dolphin logo.\n\nNew logo (2013–present)\n\nA radically new logo and new uniforms were unveiled shortly before the 2013 NFL Draft. The new logo features a stylized aqua dolphin swimming in front of a heavily modified version of the orange sunburst. The dolphin in the logo is more vague and artistic, and is not wearing a helmet as it is merely a silhouette of a dolphin cast in aqua and navy.\n\nNavy was incorporated as featured color for the first time, with orange becoming greatly de-emphasized. The uniforms feature both white pants and aqua pants, with a white or aqua jersey. The Dolphins continue to wear white at home, just as they had with the previous uniforms, with aqua being used for primetime home games. The white jersey features aqua numbers and names in a unique custom font, with orange and navy outlines on the numbers, however the names only use navy as an outline color.  The aqua jerseys use white numbers with an orange and aqua outline, and white names with a navy outline. The helmets are white with a white facemask, just like the final years of the previous look, however navy is a prominent color on the helmet stripe, joining aqua and a de-emphasized orange. Both jerseys have large \"Dolphins\" text above the numbers, written in the team's new script.  The pants are either aqua (worn only with the white jersey) or white, and contain no markings other than a small team wordmark.\n\nFight song\n\nThe song was written and composed by Lee Ofman. Ofman approached the Dolphins with it before the 1972 season because he wanted music to inspire his favorite team. The fight song would soon serve as a good luck charm for the Dolphins that season. The Dolphins became the first team in NFL history to record an undefeated season, going 17–0 en route to victory over the Washington Redskins in Super Bowl VII. The following season, Miami posted an equally-impressive 15–2 record and capped the season with another title, defeating the Minnesota Vikings in Super Bowl VIII. The back-to-back championship runs, coupled with the popularity of the fight song amongst Dolphins fans, have ensured the song's longevity. The Dolphins revealed a new fight song by T-Pain & Jimmy Buffett featuring Pitbull on August 7, 2009 which was introduced for the '09-10 NFL season.[http://www.hhspot.com/cover-story/t-pain-pitbull-remake-miami-dolphins-fight-song-279.html T-Pain, Pitbull Remake Miami Dolphins Fight Song]  The fight song was played during the preseason home opener against the Jacksonville Jaguars on August 17, 2009, but was not played during the second preseason game against the Carolina Panthers on August 22, 2009 after being booed heavily in the first game. Furthermore, the team has preferred to play Buffett's song \"Fins\" after scores during the 2009 regular season instead of the traditional fight song. The Dolphins shorthand nickname, \"The Fins\", has been recognized and used by the team.[http://www.miamidolphins.com/myaccount/mailphone.asp Dolphins Tickets]  Example of use of Fins by team. Accessed December 21, 2008.[http://www.miamidolphins.com/newsite/youthfootball/finsfrenzy.asp Fins Frenzy Contest]  Example of use of Fins by team. Accessed December 21, 2008.\n\nCheerleaders\n\nThe team's cheerleaders are known collectively as the Miami Dolphins Cheerleaders. The company had its debut in 1978 as the Dolphins Starbrites. (The name referred to the co-sponsor, Starbrite Car Polish.) The cheerleaders' founding choreographer was June Taylor, famed colleague of Jackie Gleason, who led the squad until her retirement in 1990.\n\nSpecial Teams/Volunteer Program\n\nIn April 2010, the Dolphins started the first Volunteer Program in the NFL. Special Teams is a unique volunteer organization created to enlist and mobilize the ongoing services of the community with the Dolphins staff, players and alumni. The mission of the Special Teams is to offer hands-on services to communities and families in need, to partner with existing organizations on worthwhile social, civic and charitable programs, to provide assistance at Miami Dolphins Foundation events, and to support community efforts in times of emergency. This program is headed by Leslie Nixon and Sergio Xiques. Since its inception, Special Teams has given over 100,000 community services hours to the South Florida and Mexico community.\n\nMascots\n\nT.D. \n\n(\"The Dolphin\")\nOn Friday, April 18, 1997, the first \"official\" mascot of the Miami Dolphins was introduced. The 7-foot mascot made his public debut on April 19 at Pro Player Stadium during the team's draft day party. The team then made a \"Name the Mascot\" contest that drew over 13,000 entries covering all 50 states and 22 countries. 529 names were suggested. The winning entry was announced at the annual Dolphins Awards Banquet on June 4, 1997.\n\nDolfan Denny\n\nDenny Sym cheered on the Miami Dolphins for 33 years as a one-man sideline show, leading Miami crowds in cheers and chants in his glittering coral (orange) and aqua hat from the Dolphins’ first game in 1966 until 2000.  Sym died on March 18, 2007. He was 72.\n\nFlipper\n\nFrom 1966 to 1968, and in the 1970s a live dolphin was situated in a water tank in the open (east) end of the Orange Bowl. He would jump in the tank to celebrate touchdowns and field goals. The tank that was set up in the 1970s was manufactured by Evan Bush and maintained during the games by Evan Bush and Dene Whitaker. Flipper was removed from the Orange Bowl after 1968 to save costs and the 1970s due to stress. In Ace Ventura: Pet Detective, Snowflake, a live dolphin who does special behaviors after the Dolphins score a touchdown, was the basis of the film after he is kidnapped as part of a revenge plot against Dan Marino.\n\nRadio and television\n\nIn August 2010, the team launched its own regional TV \"network.\" The Dolphins Television Network comprises 10 South Florida TV stations that agreed to carry the team-produced coverage.\"Miami Dolphins Launch Regional TV ‘Network’\" (August 16, 2010) [http://www.televisionbroadcast.com/article/104842 Television Broadcast] Preseason games are broadcast on television through WFOR in Miami-Dade and Broward counties, WTVX in West Palm Beach, WBBH in Fort Myers, and WRDQ in Orlando. Longtime TV and radio personality Dick Stockton provides play-by-play commentary, with Dolphins Hall-of-Fame QB Bob Griese and former Dolphins WR Nat Moore providing color commentary. The radio broadcast team features Jimmy Cefalo providing play-by-play commentary and Joe Rose providing color commentary during preseason games, along with Griese for regular season games. Griese replaced longtime color commentator Jim Mandich, who played for the Dolphins under Don Shula. Mandich lost his fight with cancer in 2011, opening the door for Griese as his replacement. Radio coverage is provided on WQAM-AM 560 and WKIS-FM 99.9. Additionally, games can also be heard in Spanish on WNMA-AM 1210, with Raúl Striker Jr. and Joaquin Duro providing play-by-play and color commentary, respectively.\n\nPreseason games are aired on CBS owned WFOR as does the regular season on the same station. If the team host an interconference opponent, WSVN, the local Fox affiliate will have the games being televised. When played every Sunday night, the team's matches will be broadcast on WTVJ, the NBC O&O station.\n\n[http://www.miamidolphins.com/finatics/radio-network.html Dolphins Radio Affiliates]\n\nEnglish\n\nSpanish\n\nSeason-by-season records\n\nPlayers\n\nCurrent roster\n\nPro Football Hall of Famers\n\nThe Dolphins currently have nine players, one coach, and one contributor enshrined in the Pro Football Hall of Fame, that have spent the majority (or entirety) of their careers, or made significant contributions with the Miami Dolphins. Three other players and one contributor that have spent only a \"minor portion\" of their careers with the Dolphins, have also been enshrined in the Pro Football Hall of Fame.\n\nRetired numbers\n\nThe Miami Dolphins currently have three retired jersey numbers: \n* No. 12 for Bob Griese, which was retired on a Monday Night Football broadcast in 1985.\n* No. 13 for Dan Marino, which was retired on Sept. 17, 2000 during halftime of the \"Ravens @ Dolphins\" game on Sunday Night Football.\n* No. 39 for Larry Csonka, which was retired on Dec. 9, 2002 (30th year anniversary of Miami's \"1972 Undefeated Team\") during halftime of the \"Bears @ Dolphins\" game on Monday Night Football.\n\nThe Dolphins have other numbers that have currently not been issued to any player, or are currently in reduced circulation. They include:\n* No. 54 for Zach Thomas\n* No. 99 for Jason Taylor\n\nMiami Dolphins Individual Awards\n\nBold indicates those elected to the Pro Football Hall of Fame.\n\nMiami Dolphins NFL All-Decade Team Selections\n\nThe following are Miami Dolphins (players and/or coaches) who have been selected to an \"All-Decade Team\" by the Pro Football Hall of Fame selection committee. Bold indicates those elected to the Pro Football Hall of Fame.\n\nPro Bowl selections\n\nMany former and current Miami Dolphin players have represented the franchise in the Pro Bowl. Below is a list of current or former players that play or have played for the Miami Dolphins that have been selected to multiple Pro Bowls. Bold indicates those elected to the Pro Football Hall of Fame.\n\nNotable Miami Dolphins selected to one Pro Bowl:\n* WRs Nat Moore, Chris Chambers, and Brandon Marshall\n* RBs Ricky Williams, Ronnie Brown, Andra Franklin, Delvin Williams, and Jay Ajayi\n* DTs Ndamukong Suh\n* DEs Doug Betters, Trace Armstrong, Jeff Cross, and Adewale Ogunleye\n* LBs Kim Bokamper, A. J. Duhe, and Joey Porter\n* O-Linemen Tim Ruddy, Wayne Moore, Richie Incognito, and Branden Albert\n* Ks and Ps Olindo Mare, Dan Carpenter, and Brandon Fields\n\nThe Miami Dolphins 50 Greatest Players\n\nIn 2015 to commemorate the Miami Dolphins 50th NFL season, the Dolphins organization announced through voting from the South Florida Media and Miami Dolphin fans the results of the 50 greatest players in Miami Dolphins franchise history. The results were announced during halftime on Monday Night Football between the Dolphins and the Giants. Here are the 50 greatest Dolphins broken down by position. Bold indicates those elected to the Pro Football Hall of Fame.\n\nOffense:\n* QBs Bob Griese, Dan Marino, Earl Morrall\n* HBs Jim Kiick, Mercury Morris, Tony Nathan, Ricky Williams\n* FBs Larry Csonka\n* WRs Mark Clayton, Mark Duper, O.J. McDuffie, Nat Moore, Paul Warfield\n* TEs Bruce Hardy, Keith Jackson, Jim Mandich\n* Cs Jim Langer, Mike Pouncey, Dwight Stephenson\n* Gs Bob Kuechenberg, Larry Little, Ed Newman, Keith Sims \n* Ts Norm Evans, Richmond Webb\n\nDefense:\n* DTs Bob Baumhower, Tim Bowens, Manny Fernandez\n* DEs Doug Betters, Vern Den Herder, Bill Stanfill, Jason Taylor, Cameron Wake \n* LBs Kim Bokamper, Bob Brudzinski, Nick Buoniconti, Bryan Cox, A. J. Duhe, John Offerdahl, Zach Thomas\n* CBs Brent Grimes, Sam Madison, Patrick Surtain\n* Ss Dick Anderson, Glenn Blackwood, Louis Oliver, Jake Scott\n\nSpecial Teams:\n* Ks Garo Yepremian\n* Ps Reggie Roby\n* STs Jim Jensen\n\nThe Miami Dolphins Honor Roll\n\nThe Miami Dolphin Honor Roll is a ring around the second tier of Hard Rock Stadium that honor former players, coaches, owners and contributors who have made significant contributions to the franchise throughout their history. Bold indicates those elected to the Pro Football Hall of Fame.\n\nEach of these players is honored with a placard on the facing of the upper level around Hard Rock Stadium including team founder-owner Joe Robbie. In place of a jersey number, Shula has the number 347, representing his record number of NFL coaching victories, 274 of them as Dolphins head coach.\n\nIn 1992 at the 20 year anniversary, Miami's \"1972 Undefeated Team\" was enshrined into the Honor Roll. At the 40 year anniversary, which enshrined former defensive coordinator Bill Arnsparger into the Honor Roll, his name went on the Honor Roll where the \"1972 Undefeated Team\" inductee previously and originally was enshrined, and an updated \"1972 Perfect Season Team 17-0\" inductee was put into one corner of Hard Rock Stadium with special placards of Super Bowl VII and Super Bowl VIII included next to it on each side.\n\nThe inductees as of 2014 include:\n\nAll-time first-round draft picks\n\nStaff\n\nHead coaches\n\nCurrent staff",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Miami Dolphins" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19190" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Miami Dolphins are a professional American football franchise based in the Miami metropolitan area. The Dolphins compete in the National Football League (NFL) as a member club of the league's American Football Conference (AFC) East division. The Dolphins play their home games at Hard Rock Stadium in the northern suburb of Miami Gardens, Florida, and are headquartered in Davie, Florida. The Dolphins are Florida's oldest professional sports team. Of the four AFC East teams, they are the only team in the division that was not a charter member of the American Football League (AFL).\n\nThe Dolphins team was founded by attorney-politician Joe Robbie and actor-comedian Danny Thomas. They began play in the AFL in 1966. The region had not had a professional football team since the days of the Miami Seahawks, who played in the All-America Football Conference in 1946 before becoming the first incarnation of the Baltimore Colts. For the first few years the Dolphins' full-time training camp and practice facilities were at Saint Andrew's School, a private boys boarding prep school in Boca Raton. In 1970 the Dolphins joined the NFL when the AFL–NFL merger occurred.\n\nThe team made its first Super Bowl appearance in Super Bowl VI, but lost to the Dallas Cowboys, 24–3. The following year, the Dolphins completed the NFL's only perfect season culminating in a Super Bowl win, winning all 14 of their regular-season games, both of their NFL playoff games, and also Super Bowl VII. The 1972 Dolphins were the third NFL team to accomplish a perfect regular season, and won Super Bowl VIII, becoming the first team to appear in three consecutive Super Bowls, and the second team (the first AFL/AFC team) to win back-to-back championships. Miami also appeared in Super Bowl XVII and Super Bowl XIX, losing both games.\n\nFor most of their early history, the Dolphins were coached by Don Shula, the most successful head coach in professional football history in terms of total games won. Under Shula, the Dolphins posted losing records in only two of his 26 seasons as the head coach. During the period spanning 1983 to the end of 1999, quarterback Dan Marino became one of the most prolific passers in NFL history, breaking numerous league passing records. Marino led the Dolphins to five division titles, 10 playoff appearances, and Super Bowl XIX before retiring following the 1999 season.\n\nHistory\n\nThe Miami Dolphins joined the American Football League (AFL) when an expansion franchise was awarded to lawyer Joseph Robbie\nand actor Danny Thomas in 1965 for $7.5 million, although Thomas would eventually sell his stake in the team to Robbie. During the summer of 1966, the Dolphins' training camp was in St. Pete Beach with practices in August at Boca Ciega High School in Gulfport.Armistead, Tom \"On the Departing Dolphins: Observations and Conclusions\" (August 4, 1966), Evening Independent\n\nEarly years (1966–1970)\n\nThe Dolphins had a combined 15–39–2 record in their first four seasons under head coach George Wilson, before Don Shula was hired as head coach. Shula was a Paul Brown disciple who had been lured from the Baltimore Colts after losing Super Bowl III two seasons earlier to the AFL's New York Jets and finishing 8–5–1 the following season. Interestingly, Shula got his first NFL coaching job from then-Detroit Head Coach George Wilson, who hired him as the defensive coordinator. When Shula replaced Wilson at Miami the Colts charged the Dolphins with tampering in their hiring of Shula, costing the Dolphins their first round draft pick in 1971. Shula introduced himself to the Miami press by saying that he didn't have any magic formulas and that the only way he knew to make his teams successful was through hard work. Shula's early training camps with the Dolphins, with four workouts a day, would soon be the stuff of sweltering, painful legend. But Shula's hard work paid immediate dividends, as Miami improved to a 10–4 record and their first-ever playoff appearance, losing 21–14 at Oakland.\n\nChampionship years/The perfect season (1971–1974)\n\nThe Dolphins were successful in the early 1970s, becoming the first team to advance to the AFC Championship for three consecutive seasons. They captured the AFC championship in 1971 behind quarterback Bob Griese, running backs Larry Csonka and Jim Kiick, and wide receiver Paul Warfield. The AFC Divisional Playoff Game, in which the Dolphins defeated the Kansas City Chiefs, was the longest contest in NFL history (82 minutes 40 seconds). In Super Bowl VI, however, Miami lost to the Dallas Cowboys 24–3.\n\nIn 1972, the Dolphins completed the only fully undefeated season in the NFL, winning all 14 regular season games, two playoff games and Super Bowl VII, defeating the Washington Redskins 14–7. They finished the season 17-0, and are the only team to complete an undefeated season and win the NFL title. QB Bob Griese was victim to a broken leg and dislocated ankle in Week 5 versus the San Diego Chargers and was replaced by veteran Earl Morrall for the rest of the regular season, but returned to the field as a substitute during the AFC Championship game versus the Pittsburgh Steelers and then started in Super Bowl VII. The Dolphins set the NFL single-season rushing record, and running backs Csonka and Mercury Morris became the first teammates to each rush for 1,000 yards in a season. The offensive line included future Hall of Fame members Jim Langer and Larry Little and Pro Bowler Bob Kuechenberg. The 1972 Dolphins defensive unit, called the No-Name Defense because Miami's impressive offense received much more publicity, was the league's best that year. It was led by linebacker Nick Buoniconti, end Bill Stanfill, tackle Manny Fernandez and safeties Dick Anderson and Jake Scott. They secured the team rushing record by averaging more than 200 yards per game on the ground for an entire season, while the defense allowed only 171 points.\n\nPrior to the 1972 Dolphins, only the Chicago Bears, in 1934 and 1942, had finished an NFL regular season with no losses or ties. The 1934 team lost the NFL Championship Game that year to the New York Football Giants, and the 1942 team lost the Championship to the Redskins. The Cleveland Browns were undefeated in the 1948 All-America Football Conference season.\n\nThe Dolphins finished 12–2 after the 1973 regular season and repeated as NFL champions, beating the Minnesota Vikings 24–7 in Super Bowl VIII at Rice Stadium in Houston. Miami reached the playoffs again in 1974 but lost in the first round to the Oakland Raiders, in what has entered NFL lore as the \"Sea of Hands\" game, considered one of the greatest games ever played. Following the 1974 season, the Dolphins lost Csonka, Kiick, and Warfield to the World Football League.\n\nAfter the championship years (1975–1982)\n\nMiami rebounded from an injury-plagued 6–8 record in 1976 by winning ten or more games in four of the next five seasons. Shula built a solid defense around a new set of stars, including linebacker A. J. Duhe and linemen Bob Baumhower and Doug Betters. The Dolphins went 10–4 again in 1977, but again lost the division title (and playoff spot) to the Colts, similar to the team's fate in 1975. They made the playoffs as a wild card in 1978, but lost in the first round to the Houston Oilers 17–9.\n\nCsonka returned to the Dolphins in time for the 1979 season. After winning the division with a 10–6 record, the Dolphins lost the divisional playoff 34–14 to the eventual Super Bowl champion Pittsburgh Steelers at Three Rivers Stadium.\n\nThe Dolphins also accomplished another feat unmatched before or since by another NFL team. They beat their division rival Buffalo Bills 20 consecutive times in a decade. The Bills were \"0 for the seventies\" against the Dolphins, but would defeat them in their 1980 season opener.\n\nIn 1980, David Woodley, an athletic quarterback out of LSU, took over for Bob Griese, who severely injured his shoulder in a game against the Baltimore Colts. Griese never played again, retiring after the season. The Dolphins finished 8–8 and did not make the playoffs.\n\nThe Dolphins were back up on top of the AFC East in the 1981 NFL season, with an 11–4–1 record. That season, the Dolphins quarterback position was manned by both Woodley and back-up quarterback Don Strock, causing the local media to identify the Miami quarterback as \"Woodstrock.\" They reached the divisional playoff against the San Diego Chargers, known as The Epic in Miami and remembered as one of the most memorable games in NFL history. After being down 24–0 at the end of the first quarter, Don Strock entered the game and engineered a frenetic comeback, culminating in the historic \"hook and lateral\" play: On the last play of the first half' wide receiver Duriel Harris caught a pass from Strock and immediately lateraled the ball to streaking running back Tony Nathan who scored to cut the Chargers lead to 24–17.https://www.youtube.com/watch?v=LUHqAxXjSs8 After the Dolphins took the lead in the fourth quarter, San Diego tied it up 38–38 with under a minute to play. Chargers tight end Kellen Winslow, playing through exhaustion, blocked Uwe von Schamann's field goal try on the last play of regulation. In overtime, Von Schamann had another field goal attempt blocked, and Rolf Benirschke kicked the game-winner for San Diego (final score 41–38) after missing a chip shot field goal earlier. Strock finished the game with 403 passing yards and four touchdowns.\n\nIn the strike-shortened 1982 NFL season, the Dolphins, led by the \"Killer B's\" defense (Bob Baumhower, Bill Barnett, Lyle Blackwood, Kim Bokamper, Glenn Blackwood, Charles Bowser, Doug Betters, and Bob Brudzinski), held five of their nine opponents to 14 or fewer points en route to their fourth Super Bowl appearance. During the first two rounds of the 1982–83 NFL playoffs, they got revenge for previous losses, crushing the New England Patriots, 28–13 (revenge for the infamous Snow Plow game at Schaeffer Stadium played earlier in the season) and the San Diego Chargers, 34–13 at the Orange Bowl. In successive games against San Diego and the NY Jets, the ballhawking Miami defense logged ten interceptions, five each against Dan Fouts and Richard Todd. After shutting out the New York Jets in the AFC Championship 14–0 [paced by linebacker A. J. Duhe's three interceptions- the final one returned for the game-clinching touchdown in the fourth quarter], the Dolphins lost Super Bowl XVII to Washington, 27–17. After enjoying success rooted in a defense-first philosophy, and employing a ball control offense to take pressure off of lackluster quarterbacks, the next 17 seasons would be marked by an average rushing game and defense that limited a great quarterback.\n\nThe Dan Marino era (1983–1999)\n\nDuring the third game of the 1983 season at the Los Angeles Raiders on Monday Night Football, Shula replaced quarterback David Woodley with rookie Dan Marino, who threw 20 touchdowns with only 6 interceptions. Seldom sacked by defenders, Marino was protected by an outstanding offensive line as he passed to receivers such as Mark Clayton and Mark Duper. Despite the regular season success (the Dolphins went 12–4 winning their last five regular season games, the only team in the AFC East with a winning record), they were upset in the divisional playoff by the Seattle Seahawks at the Orange Bowl. Defensive end Doug Betters was named the NFL Defensive Player of the Year.\n\nIn 1984, the Dolphins won their first 11 games en route to a 14–2 season (the franchise's best 16-game season to date). Marino, in his first full season, produced one of the most impressive set of passing statistics in NFL history, setting single-season records for most yards (5,084), touchdown passes (48), and completions (362). He was voted NFL MVP. Miami avenged the Seahawks loss from the previous year 31–10 and crushed the Steelers 45–28 in the AFC Championship to advance to Super Bowl XIX. In the title game, however, Miami lost to the San Francisco 49ers 38–16. It would be Marino's only Super Bowl appearance.\n\nMiami finished 12–4–0 in 1985 and, in an epic Monday Night Football showdown, handed the previously-undefeated Chicago Bears their only defeat of the season. After rallying from a 21–3 third quarter deficit in the divisional playoffs to beat the Cleveland Browns 24–21, many people were looking forward to a rematch with Chicago in Super Bowl XX. The Cinderella New England Patriots, the Dolphins' opponents in the AFC Championship, had different plans. New England forced six turnovers on the way to a 31–14 win – the Patriots' first in Miami since 1966. The Patriots had lost 18 games in a row at the Orange Bowl. In 1969, the Boston Patriots had beaten the Dolphins at Tampa Stadium.\n\nIn 1986, the Dolphins, hampered by defensive struggles, stumbled to a 2–5 start and finished 8–8, missing the playoffs for the first time since 1980. They also lost their final game at the Orange Bowl, falling to the New England Patriots 34–27 on Monday Night Football. The problems continued in 1987, with an 8–7 (7–5 in non-strike games) record in a strike-shortened year, their first at new Joe Robbie Stadium. In 1988, Miami had its first losing season (6–10) since 1976, and finished 8–8 in 1989.\n\nShortly after the 1989 season was finished, Dolphins owner Joe Robbie died at the age of 73. Wayne Huizenga became majority owner of the Dolphins in 1994.\n\nIn 1990, the Dolphins shaped up on defense and finished with a 12–4 record, second in the AFC East. They came from behind to beat the Kansas City Chiefs 17–16 in the Wild Card round, but lost to the Buffalo Bills 44–34 in the divisional playoffs. The team struggled with defensive injuries in 1991, and narrowly missed the playoffs, losing the AFC's final berth in an overtime loss to the rival New York Jets in the final week of the season.\n\nThe Dolphins rebounded in 1992, starting the season 6–0 and finishing 11–5 to capture the AFC East title behind a career year from running back Mark Higgs and tight end Keith Jackson, newly acquired from the Philadelphia Eagles as an unrestricted free agent. They crushed the Chargers in the divisional playoffs 31–0, but were defeated by the Buffalo Bills 29–10 in the AFC Championship.\n\nDan Marino's season-ending Achilles injury in Cleveland led to the team missing the playoffs in 1993 despite a league-leading 9–2 start. Marino returned in 1994 to lead the Dolphins to a 10–6 record and the AFC East title. After defeating Joe Montana and the Kansas City Chiefs in the Wild Card round, the Dolphins gave up a 15-point halftime lead and suffered a 22–21 loss to the San Diego Chargers. Pete Stoyanovich missed a 46-yard field goal on the last play of the game and denied Marino a chance to play the Steelers for the AFC Championship in his hometown of Pittsburgh.\n\nIn 1995, Marino broke the career passing records held by Fran Tarkenton for yards (48,841), touchdowns (352), and completions (3,913), though two of the games where he broke those records were losses to the Indianapolis Colts. The Dolphins finished 9–7, second in the AFC East, but still made the playoffs as a wild card, losing to Buffalo in the first round. Following the 1995 season, Shula retired and became an executive in the Dolphins’ front office. Jimmy Johnson, who had won a collegiate national championship at the University of Miami and two Super Bowls with the Dallas Cowboys, was named as Shula's replacement. At the press conference announcing his retirement, Shula said that he \"agreed to step aside\", leading some to speculate that Huizenga had all but fired him.\n\nIn 1996, Miami finished 8–8 and out of the playoffs, with rookie Karim Abdul-Jabbar's 1,116-yard rushing season and the standout play of rookie linebacker Zach Thomas serving as two of the few bright spots. In 1997, Miami stumbled late and backed into the playoffs with a 9–7 season, losing to the New England Patriots in the Wild Card round.\n\nMiami had a solid 10–6 season in 1998 with a career season for receiver O.J. McDuffie, but it was not enough to get past the New York Jets into first place in the division. The Dolphins beat the Bills in the Wild Card round, but lost in the next round to the eventual champion Denver Broncos. (The Broncos lost only two regular season games in 1998, one of which was to the Dolphins.)\n\nIn 1999, the team advanced to the playoffs at 9–7. After a close win at Seattle in the Wild Card round 20–17, they suffered the second-worst playoff loss in NFL history losing to the Jacksonville Jaguars, 62–7 (the Chicago Bears beat the host Washington Redskins 73–0 in the 1940 NFL Championship game, the worst playoff game loss in league history). After the season, Jimmy Johnson left the team and Marino retired.\n\n2000–present\n\nBefore the 2000 season, Dave Wannstedt, formerly of the Chicago Bears, became the new coach, and ex-Jacksonville Jaguars backup Jay Fiedler became the new quarterback, even though former Marino backup Damon Huard had been considered the favorite. Despite lowered expectations, the defense broke through with Jason Taylor and Trace Armstrong each getting 10 sacks, and four players (Sam Madison, Brian Walker, Brock Marion and Patrick Surtain) tallying at least five interceptions. All-pro linebacker Zach Thomas also contributed many tackles. In addition, Lamar Smith rushed for 1,139 yards, and Miami finished atop the AFC East with an 11–5 record. In the first round of the playoffs, Miami took the Indianapolis Colts to overtime and won on a Lamar Smith touchdown run. Smith finished with 209 yards on 40 carries, but in the next round, the Dolphins were shut out by the Oakland Raiders, and a worn-out Smith was barely able to run. The 2001 off-season brought in rookie Chris Chambers at wide receiver, but Trace Armstrong left, as did two offensive linemen, Richmond Webb and Kevin Donnalley. During the 2001 season, the Dolphins relied on a strong defense to finish 11–5, earning a Wild Card spot and finishing second in the AFC East behind the eventual Super Bowl champions, the New England Patriots. The Dolphins lost in the first round of the playoffs, 20–3, to the Baltimore Ravens.\n\nMiami revitalized its running game in time for the 2002 season by trading for New Orleans Saints running back Ricky Williams. In addition, rookie tight end Randy McMichael had a productive season. Behind a new scheme under Norv Turner and a power running game led by Williams, Miami quickly rushed out to a 5–1 start, highlighted by the Dolphins' first victory over the New York Jets since 1997 and a last-minute comeback by Fiedler against the Broncos. However, Fiedler injured his thumb and missed the next six games. This intrigued some Dolphins fans, who believed backup Ray Lucas could outdo the much-maligned Fiedler, a view based in part on Lucas's 6–3 record with the 1999 Jets. However, Lucas was abysmal in losses to the Bills and Packers and merely average in a 13–10 loss to the Jets.  Miami rebounded with wins over Baltimore and an impressive thumping of San Diego, but were beaten 38–21 in a snowstorm at Buffalo; Lucas was benched and Fiedler made his return to the team. Still, Miami pulled off an impressive win over the Oakland Raiders and sat at 9–5 with two weeks left in the season, in prime position to steal the AFC East. However, they were beaten by the Vikings and then in Week 17 blew an 11-point lead late in the fourth quarter of a devastating loss to the Patriots. Due to a tiebreaker, both the Dolphins and Patriots lost out on the playoffs as the Jets took the AFC East title. Many fans called for Wannstedt's firing, but he was kept on for the 2003 season. Despite it all, the team believed it had plenty to look forward to, as Ricky Williams broke team records with 1,853 rushing yards and 16 touchdowns on the ground.\n \nThe Dolphins began the 2003 season with a 21–20 loss to the Houston Texans, but they rebounded to win four straight games. During a crushing overtime loss at the hands of the Patriots, Jay Fiedler was injured, forcing newly acquired backup Brian Griese to lead the Dolphins to victory the next week over San Diego. That, however, was Griese's high point, and after a good showing against Indianapolis in a losing effort (he threw for 231 yards and a touchdown in the 23–17 Colts win), he struggled against the Titans, throwing three interceptions in a 31–7 Tennessee win, and was highly ineffective against the Ravens, managing just 126 yards in a 9–6 overtime win.  The Dolphins fell behind to the Washington Redskins after Griese threw two interceptions; trailing 20–7, Fiedler came off the bench and led a comeback victory, 24–23. Miami looked like it might rebound thanks to a 40–21 Thanksgiving Day victory over the Dallas Cowboys that took them to 8–4, but two key losses to the Patriots and the Eagles ended Miami's postseason hopes. Miami finished 10–6 after victories over Buffalo and the Jets.\n\nThe 2004 offseason was disastrous for Miami. Tight end Randy McMichael was arrested for domestic violence and wide receiver David Boston (signed from San Diego) suffered an injury in training camp and missed the entire season (Boston also failed a drug test for steroids later in the season). But the biggest shock came when Ricky Williams retired for then-unspecified reasons. Eventually it was revealed that a) Williams had recently incurred his third strike under the NFL's substance abuse policy, and b) to a lesser degree felt he was unnecessarily overused by Wannstedt. Many experts predicted a disastrous season for the Dolphins. These predictions proved right as Miami dropped its first six games of the 2004 season, marking the worst start in franchise history at the time. The team fell to 1–8, leading Wannstedt to resign on November 9. He was replaced on an interim basis by defensive coordinator Jim Bates. The Dolphins fared slightly better under Bates, winning three of their final seven games, including a 29–28 upset victory over the defending champion Patriots. Despite this, the Dolphins decided not to hire Bates for the permanent coaching position.\n\nThe Dolphins hired LSU coach Nick Saban. With the second pick in the 2005 NFL Draft, Nick Saban elected to go with Auburn running back Ronnie Brown. The Dolphins struggled, losing seven of their first ten games to fall to 3–7. After a frustrating two months, however, the Dolphins rallied, winning their final six games, including a win to end the season over the New England Patriots. The team finished 9–7, missing the playoffs. \n\nIn the offseason the Dolphins showed major interest in signing free agent quarterback Drew Brees; however, Miami was unsure if Brees' shoulder was completely healed from a labrum tear he suffered with the San Diego Chargers. The Dolphins ended negotiations and traded for Minnesota Vikings QB Daunte Culpepper instead, a move that would haunt Miami Dolphins fans to this day. In Saban's second season, the Dolphins were expected to contend for a playoff spot. The season turned out to be a major disappointment. Culpepper never recovered from the devastating knee injury he suffered in 2005, was benched after the fourth game of the season and eventually put on injured reserve. After starting the season 1–6, the Dolphins won four straight and were back in the playoff hunt at 5–6, but a few losses later ended their playoff hopes. Saban then abandoned the Dolphins and took the head coaching position at the University of Alabama Crimson Tide after insisting that he was not interested. The Dolphins then hired Chargers offensive coordinator Cam Cameron as his replacement.\n\nThe Dolphins finished the 2007 season with a 1–15 record, the worst in franchise history. Late in the season, two-time Super Bowl winning coach Bill Parcells was named Executive Vice President of the Dolphins football operations. Shortly after the season finale, Parcells fired general manager Randy Mueller and on January 3, 2008, head coach Cam Cameron was fired along with almost all of his staff.\n\nParcells then hired Tony Sparano, who was previously an assistant under Parcells at the Dallas Cowboys. On the 2008 offseason, the Dolphins also parted ways with two long-time Dolphins, releasing linebacker Zach Thomas and trading defensive end Jason Taylor to the Washington Redskins for a second round draft pick. The Dolphins took Jake Long, star offensive lineman out of the University of Michigan with the first pick of the 2008 draft and drafted quarterback Chad Henne with their second round pick. After the New York Jets traded for Brett Favre and released quarterback Chad Pennington the same day, the Dolphins quickly signed Pennington. After starting the 2008 season with a 0–2 record the Dolphins used the \"wildcat\" offense against the New England Patriots on six plays, which produced four touchdowns (three rushing and one passing) in a 38–13 upset victory. The wildcat offense or single-wing was a \"new\" formation that allowed the Dolphins to utilize their two best offensive players, Ronnie Brown and Ricky Williams, both running backs. From that point on the Dolphins completed the greatest single-season turnaround in NFL history, going from a 1–15 in 2007 to 11–5. Additionally, Miami won the AFC East, becoming the first team in NFL history to win their division after only having one win the previous season. However, the Dolphins lost in the first round of the playoffs to the Baltimore Ravens, 27–9.\n\nIn 2009 the Dolphins again started off 0–2. In week 3 Chad Pennington suffered a shoulder injury against the San Diego Chargers and was out for the rest of the 2009 season. Second-year quarterback Chad Henne replaced him. Under Henne, the Dolphins won their first two games before losing to the Saints after leading 24–3 towards the end of the first half. The Dolphins finished the rest of the season without Ronnie Brown, who was sidelined by a Lisfranc foot injury that required surgery. Ricky Williams was the starter again and finished the season with 1,121 yards, surpassing his rookie year total at the age of 32. Miami ended the season with three consecutive losses to finish 7–9 and out of the playoffs.\n\nThe Dolphins looked to bounce back the next season by acquiring Brandon Marshall from the Denver Broncos for two second-round draft picks, and Karlos Dansby via free agency. Ronnie Brown and Ricky Williams returned to the team (while many speculated Williams would retire). In September 2010, Bill Parcells, stepped down as Vice President of Football Operations, but remained as a consultant. The Dolphins started out 2010 by winning their first two games at the Buffalo Bills and at the Minnesota Vikings. However, the rest of the season would be a disappointment.  They finished 7–9 again,  missing the playoffs for the 8th time in 9 years. Questions were raised about Chad Henne and Coach Sparano's futures with the team. It was reported that Stephen Ross was interested in hiring Stanford head coach Jim Harbaugh after flying to California to meet him; however, Ross denied those rumors, and in that same week he gave Tony Sparano a three-year extension.\n\nWith their first pick in the 2011 NFL Draft, and 15th selection overall, the Dolphins selected center Mike Pouncey from Florida.  Jason Taylor re-signed for his third stint.  The Dolphins got off to a disastrous 0-7 start, rebounded to win four of the next five games, and then lost 26–10 to the struggling Philadelphia Eagles, effectively ending their playoff contention and Tony Sparano's job as head coach. Todd Bowles stepped in as interim coach for the remainder of 2011. The Dolphins won two of their final three games, including a win over the Jets that ended the Jets' playoff chances and concluded Jason Taylor's NFL career.\n\nIn the offseason, fans organized a protest outside the Dolphins' team facility to call for the firing of General Manager Jeff Ireland. Looking to move on from the Tony Sparano era, the Dolphins hired Green Bay Packers offensive coordinator Joe Philbin on January 20, 2012, to mixed reactions from fans. The Dolphins were in contention to hire former NFL head coach Jeff Fisher, but he accepted the head coach position with the St. Louis Rams and the Dolphins hired Philbin instead. The Dolphins signed David Garrard after pursued several free agents for the position and selected Ryan Tannehill with the 8th pick in the 2012 NFL Draft. Garrard originally won the starting QB battle against Tannehill and Moore in training camp, but injured his knee in an accident at home. Tannehill won the starting job for the 2012 season after a strong showing in preseason and camp. Garrard was eventually released. In his first game as a professional football player, Tannehill struggled, throwing three interceptions in a loss on the road against the Houston Texans. But in his first home game, he ran for a touchdown and did not commit any turnovers while dominating the Oakland Raiders. Miami then lost back-to-back OT games against the Jets and the Arizona Cardinals, despite Tannehill throwing for 431 yards, the most ever for a rookie QB in a single game in team history, and receiver Brian Hartline racking up 253 receiving yards, the most ever by a Dolphin receiver, in the game against Arizona. Then they played Cincinnati on the road and won 17–13 win after Reshad Jones picked off the ball with under a minute and a half left in the game. Despite an impressive 4–3 start, the Dolphins lost a highly touted game against the Colts, 23–20, starting a 3-game losing streak. After staying in Wild Card contention through Week 16, Miami finished 7–9 after being shut out by the Patriots.\n\nWith many question marks about the future of some popular players, including Jake Long, the Dolphins went into the off-season looking for help at many positions. Despite the signings of Brandon Albert, Mike Wallace, Dannell Ellerbe, and a breakout season for Jelani Jenkins, the Dolphins finished the 2013 season at 8–8 and would have made the playoffs if not for a losing streak near the end of the season.\n\nAfter the 2013 season, general manager Jeff Ireland was fired, as urged by fans for the prior two years, and was replaced by Dennis Hickey. However, despite a 5-3 start, the Dolphins once again finished the 2014 season at 8-8 and missed the playoffs for a sixth consecutive season.\n\nIn January 2015, the Dolphins hired former New York Jets general manager Mike Tannenbaum to become the team's executive vice president of football operations.  Newly hired general manager Dennis Hickey would retain his power over the final 53-man roster. However, given Tannenbaum's history, it has been widely speculated that Tannenbaum has final say over personnel.  In March 2015, the Dolphins made the biggest free agent signing of the NFL off-season; they signed defensive tackle Ndamukong Suh to the richest contract in NFL history for any defensive player.  Suh's contract is for six years and $114 million ($60 million guaranteed). Two months later, in May 2015, the Dolphins locked up franchise quarterback Ryan Tannehill through the 2020 season with a contract extension worth $96 million ($45 million guaranteed).  However, the Dolphins began the 2015 season with a 1–3 record, which resulted in head coach Joe Philbin's firing on October 5, 2015, one day after the Dolphins lost to the Jets in London's Wembley Stadium.  Tight end coach Dan Campbell was appointed as interim head coach.\n\nOn January 9, 2016, Bears offensive coordinator Adam Gase was hired as head coach. The Dolphins swung a trade with the Philadelphia Eagles, sending the 8th overall pick for linebacker Kiko Alonso and cornerback Byron Maxwell and the 13th overall pick. The Adam Gase era got off to a lackluster start. However, the Dolphins upset the first place Pittsburgh Steelers, 30-15 in week 6, sparking a 6-game winning streak and launching the team into playoff contention at 7-4. After a blowout loss to the Baltimore Ravens, the Dolphins won three straight games against the Arizona Cardinals, New York Jets and Buffalo Bills to clinch their first playoff spot since 2008. The Dolphins finished 10-6 and locked up the number 6 seed in the playoffs. They were defeated in the first round by the Pittsburgh Steelers in a rematch of the week 6 contest. In the offseason, the Dolphins traded for tight end Julius Thomas, after being in need of someone in that position.\n\nDuring training camp in 2017, Tannehill suffered a torn ACL during a non-contact injury. The Dolphins brought veteran Jay Cutler out of retirement to start in Tannehill's place. Ultimately, the season was a disappointment as the Dolphins finished 6-10, finishing third in the AFC East.\n\nSuper Bowls\n\nAFC Championships\n\nRivalries\n\nThe Dolphins share intense rivalries with their three AFC East opponents, but also have had historical or occasional rivalries with other teams such as their cross-state rivals Tampa Bay Buccaneers, their former divisional rivals Indianapolis Colts, the Pittsburgh Steelers, San Diego/Los Angeles Chargers, Oakland Raiders, and to a lesser extent, the Jacksonville Jaguars.\nDivisional rivalries\n\nBuffalo Bills\n\nThe Dolphins and the Buffalo Bills share one of the more interesting rivalries in the league, as there are stark characteristic differences between the cities of Miami and Buffalo, especially in climate and culture. The rivalry was extremely lopsided in favor of Miami during the 1970s, as the Dolphins won all 20 games against the Bills during that decade. Fortunes changed in the 1980s and 1990s when Jim Kelly became the Bills' starting quarterback. Though both teams were extremely dominant during that period, the Bills ultimately held the edge and dominated the Dolphins during their four playoff match-ups in the 1990s, with the Dolphins' only playoff win coming after Kelly's retirement. With the rise of Tom Brady and the Patriots during the 2000s and the retirements of Kelly and Dolphins great Dan Marino, the Bills-Dolphins rivalry has faded in relevance, but remains somewhat intense to this day. Some former Dolphins have gone to play for the Bills as well, most notably Dan Carpenter, Chris Hogan, and Charles Clay.\n\nNew England Patriots\n\nThe Dolphins dominated the New England Patriots during the 1970s and the 1990s, but there were some notable moments as well, including a game now known as the Snowplow Game. Fortunes changed when Tom Brady became the franchise quarterback for the Patriots, and since then, the Patriots have virtually dominated the AFC, especially the AFC East. Miami did pose more of a challenge to the Brady-led Patriots in the 2000s, however, winning more games against them than the Bills or Jets did during that decade. Miami and New England are also the only two franchises to have posted undefeated regular season records since the NFL-AFL merger, with Miami going 14-0 in 1972 and New England going 16-0 in 2007, but only the 1972 Dolphins were able to win the Super Bowl.\n\nNew York Jets\n\nThe New York Jets are perhaps Miami's most bitter rivals. Dolphins fans despise the Jets due to the sheer amount of New York City transplants who have moved to South Florida and the Jets' usual cocky demeanor. Just as the Bills-Dolphins rivalry is motivated by differences, the Dolphins-Jets series is also notable for the differences between New York and Miami. Unlike the former, this rivalry has been more consistent over the years. Some of the more memorable moments in this rivalry include Dan Marino's fake spike, Vinny Testaverde leading the Jets to a notable comeback on Monday Night Football, and former Jets quarterback Chad Pennington signing with the Dolphins and leading them to a divisional title. The two teams have also played in the 1982 AFC Championship, with Miami winning to face the Washington Redskins in Super Bowl XVII.\n\nOther\n\nTampa Bay Buccaneers\n\nFacilities\n\nStadiums\n\nThe Dolphins originally played all home games in the Orange Bowl in Miami. They moved to the new Joe Robbie Stadium after the 1986 season. From 1993-2011, the Dolphins shared the stadium with Major League Baseball's Florida Marlins. The venue has had multiple naming rights deals since 1996, carrying the names Pro Player Stadium, Dolphins Stadium, Dolphin Stadium, LandShark Stadium, Sun Life Stadium, New Miami Stadium and, as of August 2016, Hard Rock Stadium. The facility is located in Miami Gardens, a suburb of Miami located approximately 15 mi north of downtown Miami. The Miami Dolphins share Hard Rock Stadium with the NCAA Miami Hurricanes. The 2015–2016 season will be the first season in the newly renovated Hard Rock Stadium. The Dolphins spent more than two years and over $400 million on a major overhaul to Hard Rock Stadium. Every seat has been replaced and the lower level seats have been moved closer to the field. There will be roughly 10,000 fewer seats.\n\nTraining\n\nSt. Petersburg Beach hosted the Dolphins' first training camp in 1966. Saint Andrew's School (Boca Raton, Florida) hosted training camp in the late 60's. The Dolphins subsequently trained in Miami Gardens at Biscayne College, later renamed St. Thomas University, from 1970 until 1993.\n\nIn 1993, the Dolphins opened the Miami Dolphins Training Facility at Nova Southeastern University in Davie, Florida. In 2006, the facility added a domed field which allows the team to practice during thunderstorms which are common during the summer.\n\nFranchise information\n\nLogos and uniforms\n\nLeaping dolphin (1966–2012)\n\nThe Dolphins logo and uniforms remained fairly consistent from the team's founding through 2012. The team's colors were originally aqua and coral, with the original logo consisted of a sunburst with a leaping dolphin wearing a football helmet bearing the letter M. At their debut in 1966, the dolphin's head was near the center of the sunburst. For the 1967, the dolphin was in the center of the sunburst, but reverted to the original logo between 1968 and 1973.  By 1974, the dolphin's body was centered on the sunburst in a slightly smaller logo than the 1967 version. The uniforms featured white pants with aqua and coral stripes, paired with either a white or aqua jersey. On the white jersey, aqua block numbers and names were outlined in coral, with aqua and coral sleeve stripes. These uniforms were used as the primary uniforms for road games and daytime home games, due to the extreme heat of South Florida.  The team also had an aqua jersey used mainly for night home games or road games in which the opponent chose to wear white.  The aqua jersey featured white block numbers and names with an coral outline, and coral and white sleeve stripes.\n\nAn update was given to the logo in 1997: the sunburst was simplified and the dolphin was darkened and given a more serious game-face expression.  The uniforms remained the same, however a different block number font was used and navy drop shadows were added.\n\nOn very rare occasions, an orange jersey was used for primetime games. The uniforms essentially swapped the location of orange and aqua from the aqua jersey. The orange jersey was first used on a Sunday night in 2003 against Washington, a Dolphin win. In 2004, the orange jersey was brought back for an ABC Monday Night Football match pitting the 2-11 Dolphins against the 12-1 defending champion New England Patriots. The Dolphins scored a huge upset win after trailing by 11 points with less than 5 minutes remaining. Due to the unusual orange jerseys, the game has become known within some Dolphin circles as \"The Night That Courage Wore Orange\". The orange jerseys were used for a 2009 Monday night win against the New York Jets. However, the Dolphins would lose a 2010 Sunday night matchup with the Jets, their first loss in orange, and the jerseys would not be worn again until a 2016 Thursday night defeat in Cincinnati.\n\nIn 2009, the Dolphins switched to black shoes for the first time since the glory days, following a recent trend among NFL teams. However, by 2011, they returned to wearing white shoes.\n\nThe Dolphins' final game in the original style uniforms with block numbers and the iconic leaping dolphin logo was the final game of the 2012 season, a 28-0 shutout loss to the New England Patriots in Foxboro. The white jerseys were worn for the game, and as rumors of a new look had been swirling, many fans watching knew that it would likely be the last time their team would wear the leaping dolphin logo.\n\nNew logo (2013–present)\n\nA radically new logo and new uniforms were unveiled shortly before the 2013 NFL Draft. The new logo features a stylized aqua dolphin swimming in front of a heavily modified version of the orange sunburst. The dolphin in the logo is more vague and artistic, and is not wearing a helmet as it is merely a silhouette of a dolphin cast in aqua and navy.\n\nNavy was incorporated as featured color for the first time, with orange becoming greatly de-emphasized. The uniforms feature both white pants and aqua pants, with a white or aqua jersey. The Dolphins continue to wear white at home, just as they had with the previous uniforms, with aqua being used for primetime home games. The white jersey features aqua numbers and names in a unique custom font, with orange and navy outlines on the numbers, however the names only use navy as an outline color.  The aqua jerseys use white numbers with an orange and aqua outline, and white names with a navy outline. The helmets are white with a white facemask, just like the final years of the previous look, however navy is a prominent color on the helmet stripe, joining aqua and a de-emphasized orange. Both jerseys have large \"Dolphins\" text above the numbers, written in the team's new script.  The pants are either aqua (worn only with the white jersey) or white, and contain no markings other than a small team wordmark.\n\nFight song\n\nThe song was written and composed by Lee Ofman. Ofman approached the Dolphins with it before the 1972 season because he wanted music to inspire his favorite team. The fight song would soon serve as a good luck charm for the Dolphins that season. The Dolphins became the first team in NFL history to record an undefeated season, going 17–0 en route to victory over the Washington Redskins in Super Bowl VII. The following season, Miami posted an equally-impressive 15–2 record and capped the season with another title, defeating the Minnesota Vikings in Super Bowl VIII. The back-to-back championship runs, coupled with the popularity of the fight song amongst Dolphins fans, have ensured the song's longevity. The Dolphins revealed a new fight song by T-Pain & Jimmy Buffett featuring Pitbull on August 7, 2009 which was introduced for the '09-10 NFL season.[http://www.hhspot.com/cover-story/t-pain-pitbull-remake-miami-dolphins-fight-song-279.html T-Pain, Pitbull Remake Miami Dolphins Fight Song]  The fight song was played during the preseason home opener against the Jacksonville Jaguars on August 17, 2009, but was not played during the second preseason game against the Carolina Panthers on August 22, 2009 after being booed heavily in the first game. Furthermore, the team has preferred to play Buffett's song \"Fins\" after scores during the 2009 regular season instead of the traditional fight song. The Dolphins shorthand nickname, \"The Fins\", has been recognized and used by the team.[http://www.miamidolphins.com/myaccount/mailphone.asp Dolphins Tickets]  Example of use of Fins by team. Accessed December 21, 2008.[http://www.miamidolphins.com/newsite/youthfootball/finsfrenzy.asp Fins Frenzy Contest]  Example of use of Fins by team. Accessed December 21, 2008.\n\nCheerleaders\n\nThe team's cheerleaders are known collectively as the Miami Dolphins Cheerleaders. The company had its debut in 1978 as the Dolphins Starbrites. (The name referred to the co-sponsor, Starbrite Car Polish.) The cheerleaders' founding choreographer was June Taylor, famed colleague of Jackie Gleason, who led the squad until her retirement in 1990.\n\nSpecial Teams/Volunteer Program\n\nIn April 2010, the Dolphins started the first Volunteer Program in the NFL. Special Teams is a unique volunteer organization created to enlist and mobilize the ongoing services of the community with the Dolphins staff, players and alumni. The mission of the Special Teams is to offer hands-on services to communities and families in need, to partner with existing organizations on worthwhile social, civic and charitable programs, to provide assistance at Miami Dolphins Foundation events, and to support community efforts in times of emergency. This program is headed by Leslie Nixon and Sergio Xiques. Since its inception, Special Teams has given over 100,000 community services hours to the South Florida and Mexico community.\n\nMascots\n\nT.D. \n\n(\"The Dolphin\")\nOn Friday, April 18, 1997, the first \"official\" mascot of the Miami Dolphins was introduced. The 7-foot mascot made his public debut on April 19 at Pro Player Stadium during the team's draft day party. The team then made a \"Name the Mascot\" contest that drew over 13,000 entries covering all 50 states and 22 countries. 529 names were suggested. The winning entry was announced at the annual Dolphins Awards Banquet on June 4, 1997.\n\nDolfan Denny\n\nDenny Sym cheered on the Miami Dolphins for 33 years as a one-man sideline show, leading Miami crowds in cheers and chants in his glittering coral (orange) and aqua hat from the Dolphins’ first game in 1966 until 2000.  Sym died on March 18, 2007. He was 72.\n\nFlipper\n\nFrom 1966 to 1968, and in the 1970s a live dolphin was situated in a water tank in the open (east) end of the Orange Bowl. He would jump in the tank to celebrate touchdowns and field goals. The tank that was set up in the 1970s was manufactured by Evan Bush and maintained during the games by Evan Bush and Dene Whitaker. Flipper was removed from the Orange Bowl after 1968 to save costs and the 1970s due to stress. In Ace Ventura: Pet Detective, Snowflake, a live dolphin who does special behaviors after the Dolphins score a touchdown, was the basis of the film after he is kidnapped as part of a revenge plot against Dan Marino.\n\nRadio and television\n\nIn August 2010, the team launched its own regional TV \"network.\" The Dolphins Television Network comprises 10 South Florida TV stations that agreed to carry the team-produced coverage.\"Miami Dolphins Launch Regional TV ‘Network’\" (August 16, 2010) [http://www.televisionbroadcast.com/article/104842 Television Broadcast] Preseason games are broadcast on television through WFOR in Miami-Dade and Broward counties, WTVX in West Palm Beach, WBBH in Fort Myers, and WRDQ in Orlando. Longtime TV and radio personality Dick Stockton provides play-by-play commentary, with Dolphins Hall-of-Fame QB Bob Griese and former Dolphins WR Nat Moore providing color commentary. The radio broadcast team features Jimmy Cefalo providing play-by-play commentary and Joe Rose providing color commentary during preseason games, along with Griese for regular season games. Griese replaced longtime color commentator Jim Mandich, who played for the Dolphins under Don Shula. Mandich lost his fight with cancer in 2011, opening the door for Griese as his replacement. Radio coverage is provided on WQAM-AM 560 and WKIS-FM 99.9. Additionally, games can also be heard in Spanish on WNMA-AM 1210, with Raúl Striker Jr. and Joaquin Duro providing play-by-play and color commentary, respectively.\n\nPreseason games are aired on CBS owned WFOR as does the regular season on the same station. If the team host an interconference opponent, WSVN, the local Fox affiliate will have the games being televised. When played every Sunday night, the team's matches will be broadcast on WTVJ, the NBC O&O station.\n\n[http://www.miamidolphins.com/finatics/radio-network.html Dolphins Radio Affiliates]\n\nEnglish\n\nSpanish\n\nSeason-by-season records\n\nPlayers\n\nCurrent roster\n\nPro Football Hall of Famers\n\nThe Dolphins currently have nine players, one coach, and one contributor enshrined in the Pro Football Hall of Fame, that have spent the majority (or entirety) of their careers, or made significant contributions with the Miami Dolphins. Three other players and one contributor that have spent only a \"minor portion\" of their careers with the Dolphins, have also been enshrined in the Pro Football Hall of Fame.\n\nRetired numbers\n\nThe Miami Dolphins currently have three retired jersey numbers: \n* No. 12 for Bob Griese, which was retired on a Monday Night Football broadcast in 1985.\n* No. 13 for Dan Marino, which was retired on Sept. 17, 2000 during halftime of the \"Ravens @ Dolphins\" game on Sunday Night Football.\n* No. 39 for Larry Csonka, which was retired on Dec. 9, 2002 (30th year anniversary of Miami's \"1972 Undefeated Team\") during halftime of the \"Bears @ Dolphins\" game on Monday Night Football.\n\nThe Dolphins have other numbers that have currently not been issued to any player, or are currently in reduced circulation. They include:\n* No. 54 for Zach Thomas\n* No. 99 for Jason Taylor\n\nMiami Dolphins Individual Awards\n\nBold indicates those elected to the Pro Football Hall of Fame.\n\nMiami Dolphins NFL All-Decade Team Selections\n\nThe following are Miami Dolphins (players and/or coaches) who have been selected to an \"All-Decade Team\" by the Pro Football Hall of Fame selection committee. Bold indicates those elected to the Pro Football Hall of Fame.\n\nPro Bowl selections\n\nMany former and current Miami Dolphin players have represented the franchise in the Pro Bowl. Below is a list of current or former players that play or have played for the Miami Dolphins that have been selected to multiple Pro Bowls. Bold indicates those elected to the Pro Football Hall of Fame.\n\nNotable Miami Dolphins selected to one Pro Bowl:\n* WRs Nat Moore, Chris Chambers, and Brandon Marshall\n* RBs Ricky Williams, Ronnie Brown, Andra Franklin, Delvin Williams, and Jay Ajayi\n* DTs Ndamukong Suh\n* DEs Doug Betters, Trace Armstrong, Jeff Cross, and Adewale Ogunleye\n* LBs Kim Bokamper, A. J. Duhe, and Joey Porter\n* O-Linemen Tim Ruddy, Wayne Moore, Richie Incognito, and Branden Albert\n* Ks and Ps Olindo Mare, Dan Carpenter, and Brandon Fields\n\nThe Miami Dolphins 50 Greatest Players\n\nIn 2015 to commemorate the Miami Dolphins 50th NFL season, the Dolphins organization announced through voting from the South Florida Media and Miami Dolphin fans the results of the 50 greatest players in Miami Dolphins franchise history. The results were announced during halftime on Monday Night Football between the Dolphins and the Giants. Here are the 50 greatest Dolphins broken down by position. Bold indicates those elected to the Pro Football Hall of Fame.\n\nOffense:\n* QBs Bob Griese, Dan Marino, Earl Morrall\n* HBs Jim Kiick, Mercury Morris, Tony Nathan, Ricky Williams\n* FBs Larry Csonka\n* WRs Mark Clayton, Mark Duper, O.J. McDuffie, Nat Moore, Paul Warfield\n* TEs Bruce Hardy, Keith Jackson, Jim Mandich\n* Cs Jim Langer, Mike Pouncey, Dwight Stephenson\n* Gs Bob Kuechenberg, Larry Little, Ed Newman, Keith Sims \n* Ts Norm Evans, Richmond Webb\n\nDefense:\n* DTs Bob Baumhower, Tim Bowens, Manny Fernandez\n* DEs Doug Betters, Vern Den Herder, Bill Stanfill, Jason Taylor, Cameron Wake \n* LBs Kim Bokamper, Bob Brudzinski, Nick Buoniconti, Bryan Cox, A. J. Duhe, John Offerdahl, Zach Thomas\n* CBs Brent Grimes, Sam Madison, Patrick Surtain\n* Ss Dick Anderson, Glenn Blackwood, Louis Oliver, Jake Scott\n\nSpecial Teams:\n* Ks Garo Yepremian\n* Ps Reggie Roby\n* STs Jim Jensen\n\nThe Miami Dolphins Honor Roll\n\nThe Miami Dolphin Honor Roll is a ring around the second tier of Hard Rock Stadium that honor former players, coaches, owners and contributors who have made significant contributions to the franchise throughout their history. Bold indicates those elected to the Pro Football Hall of Fame.\n\nEach of these players is honored with a placard on the facing of the upper level around Hard Rock Stadium including team founder-owner Joe Robbie. In place of a jersey number, Shula has the number 347, representing his record number of NFL coaching victories, 274 of them as Dolphins head coach.\n\nIn 1992 at the 20 year anniversary, Miami's \"1972 Undefeated Team\" was enshrined into the Honor Roll. At the 40 year anniversary, which enshrined former defensive coordinator Bill Arnsparger into the Honor Roll, his name went on the Honor Roll where the \"1972 Undefeated Team\" inductee previously and originally was enshrined, and an updated \"1972 Perfect Season Team 17-0\" inductee was put into one corner of Hard Rock Stadium with special placards of Super Bowl VII and Super Bowl VIII included next to it on each side.\n\nThe inductees as of 2014 include:\n\nAll-time first-round draft picks\n\nStaff\n\nHead coaches\n\nCurrent staff. Miami Dolphins. http://en.wikipedia.org/?curid=19190."
  }
}
