{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14216",
  "eid" : "12f591e0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778541054,
  "textBody" : "Hausa (Yaren Hausa or Harshen Hausa) is the Chadic language (a branch of the Afroasiatic language family) with the largest number of speakers, spoken as a first language by some 27 million people, and as a second language by another 20 million. The ancestral language of the Hausa people, one of the largest ethnic groups in Central Africa, Hausa is commonly spoken throughout southern Niger and northern Nigeria. It has developed into a lingua franca across much of Western  Africa for purposes of trade.\n\nClassification\n\nHausa belongs to the West Chadic languages subgroup of the Chadic languages group, which in turn is part of the Afroasiatic language family.\n\nGeographic distribution\n\nNative speakers of Hausa, the Hausa people, are mostly found in Niger, in the north of Nigeria, and in Chad. Furthermore, the language is used as a trade language across a much larger swathe of West Africa (Benin, Ghana, Cameroon, Togo, Ivory Coast etc.), Central Africa (Chad, Central African Republic, Gabon) and in northwestern Sudan, and Some parts of Ethiopia  particularly amongst Muslims.\n\nIt is taught at universities in Africa and around the world. The language is the most commonly spoken language in Nigeria and it is also widely spoken outside Nigeria, especially in Niger, Ghana, Cameroon and Sudan. Radio stations like BBC, Radio France Internationale, China Radio International, Voice of Russia, Voice of America, Arewa 24 Deutsche Welle, and IRIB broadcast in Hausa.\n\nDialects\n\nTraditional dialects\n\nEastern Hausa dialects include Dauranchi in Daura, Kananci in Kano, Bausanchi in Bauchi, Gudduranci in Katagum Misau and part of Borno, and Hadejanci in Hadejiya.\n\nWestern Hausa dialects include Sakkwatanci in Sokoto, Katsinanci in Katsina, Arewanci in Gobir, Adar, Kebbi, and Zamfara, and Kurhwayanci in Kurfey in Niger. Katsina is transitional between Eastern and Western dialects.\n\nNorthern Hausa dialects include Arewa and Arawci.\n\nZazzaganci in Zazzau is the major Southern dialect.\n\nThe Daura (Dauranchi) and Kano (Kananci) dialect are the standard.  The BBC, Deutsche Welle, Radio France Internationale and Voice of America offer Hausa services on their international news web sites using Dauranci and Kananci. In recent language development Zazzaganci took over the innovation of writing and speaking the current Hausa language use.\n\nNorthernmost dialects and loss of tonality\n\nThe western to eastern Hausa dialects of Kurhwayanci, Daragaram and Aderawa, represent the traditional northernmost limit of native Hausa communities. These are spoken in the northernmost sahel and mid-Saharan regions in west and central Niger in the Tillaberi, Tahoua, Dosso, Maradi, Agadez and Zinder regions. While mutually comprehensible with other dialects (especially Sakkwatanci, and to a lesser extent Gaananci), the northernmost dialects have slight grammatical and lexical differences owing to frequent contact with the Zarma and Tuareg groups and cultural changes owing to the geographical differences between the grassland and desert zones. These dialects also have the quality of being non-tonal or pitch accent dialects.\n\nThis link between non-tonality and geographic location is not limited to Hausa alone, but is exhibited in other northern dialects of neighbouring languages; such as the difference within Songhay language (between the non-tonal northernmost dialects of Koyra Chiini in Timbuktu and Koyraboro Senni in Gao; and the tonal southern Zarma dialect, spoken from western Niger to northern Ghana), and within the Soninke language (between the non-tonal northernmost dialects of Imraguen and Nemadi spoken in east-central Mauritania; and the tonal southern dialects of Senegal, Mali and the sahel).\n\nGhanaian Hausa dialect\n\nThe Ghanaian Hausa dialect (Gaananci), spoken in Ghana, Togo, and western Ivory Coast, is a distinct western native Hausa dialect-bloc with adequate linguistic and media resources available. Separate smaller Hausa dialects are spoken by an unknown number of Hausa further west in parts of Burkina Faso, and in the Haoussa Foulane, Badji Haoussa, Guezou Haoussa, and Ansongo districts of northeastern Mali (where it is designated as a minority language by the Malian government), but there are very little linguistic resources and research done on these particular dialects at this time.\n\nGaananci forms a separate group from other Western Hausa dialects, as it now falls outside the contiguous Hausa-dominant area, and is usually identified by the use of c for ky, and j for gy. This is attributed to the fact that Ghana's Hausa population descend from Hausa-Fulani traders settled in the zongo districts of major trade-towns up and down the previous Asante, Gonja and Dagomba kingdoms stretching from the sahel to coastal regions, in particular the cities of Tamale, Salaga, Bawku, Bolgatanga, Achimota, Nima and Kumasi.\n\nGaananci exhibits noted inflected influences from Zarma, Gur, Dyula and Soninke, as Ghana is the westernmost area in which the Hausa language is a major lingua-franca; as well as it being the westernmost area both the Hausa and Djerma ethnic groups inhabit in large numbers. Immediately west from Ghana (in Ivory Coast, Togo, and Burkina Faso), Hausa is abruptly replaced with Dioula–Bambara as the main lingua-franca of what become predominantly Mandinka areas, and native Hausa populations plummet to a very small urban minority.\n\nBecause of this, and the presence of surrounding Akan, Gur and Mande languages, Gaananci was historically isolated from the other Hausa dialects.[http://www.njas.helsinki.fi/pdf-files/vol5num2/bodomo.pdf Njas.helsinki.fi] Despite this difference, grammatical similarities between Sakkwatanci and Ghanaian Hausa determine that the dialect, and the origin of the Ghanaian Hausa people themselves, are derived from the northwestern Hausa area surrounding Sokoto.[http://www.ethnorema.it/pdf/numero%204/03%20Articolo%201%20Guerini.pdf Ethnorema.it]\n\nHausa is also widely spoken by non-native Gur and Mande Ghanaian Muslims, but differs from Gaananci, and rather has features consistent with non-native Hausa dialects.\n\nOther native dialects\n\nHausa is also spoken various parts of Cameroon and Chad, which combined the mixed dialects of northern Nigeria and Niger. In addition, Arabic has had a great influence in the way Hausa is spoken by the native Hausa speakers in these areas.\n\nNon-native Hausa\n\nIn West Africa, Hausa's use as a lingua franca has given rise to a non-native pronunciation that differs vastly from native pronunciation by way of key omissions of implosive and ejective consonants present in native Hausa dialects, such as ɗ, ɓ and kʼ/ƙ, which are pronounced by non-native speakers as d, b and k respectively. This creates confusion among non-native and native Hausa speakers, as non-native pronunciation does not distinguish words like ' (\"correct\") and ' (\"one-by-one\"). Another difference between native and non-native Hausa is the omission of vowel length in words and change in the standard tone of native Hausa dialects (ranging from native Fulani and Tuareg Hausa-speakers omitting tone altogether, to Hausa speakers with Gur or Yoruba mother tongues using additional tonal structures similar to those used in their native languages). Use of masculine and feminine gender nouns and sentence structure are usually omitted or interchanged, and many native Hausa nouns and verbs are substituted with non-native terms from local languages.\n\nNon-native speakers of Hausa numbered more than 25 million and, in some areas, live close to native Hausa. It has replaced many other languages especially in the north-central and north-eastern part of Nigeria and continues to gain popularity in other parts of Africa as a result of Hausa movies and music which spread out throughout the region.\n\nThere are several pidgin forms of Hausa. Barikanchi was formerly used in the colonial army of Nigeria. Gibanawa is currently in widespread use in Jega in northwestern Nigeria, south of the native Hausa area.\n\nPhonology\n\nConsonants\n\nHausa has between 23 and 25 consonant phonemes depending on the speaker.\n\nThe three-way contrast between palatalized velars, plain velars, and labialized velars is found only before long and short, e.g. ('grass'), ('to increase'), ('shea-nuts'). Before front vowels, only palatalized and labialized velars occur, e.g. ('jealousy') vs. ('side of body'). Before rounded vowels, only labialized velars occur, e.g. ('ringworm').\n\nGlottalic consonants\n\nHausa has glottalic consonants (implosives and ejectives) at four or five places of articulation (depending on the dialect). They require movement of the glottis during pronunciation and have a staccato sound.\n\nThey are written with modified versions of Latin letters. They can also be denoted with an apostrophe, either before or after depending on the letter, as shown below.\n\n* ɓ / b', an implosive consonant,, sometimes;\n* ɗ / d', an implosive, sometimes;\n* ts', an ejective consonant, or, according to the dialect;\n* ch', an ejective (does not occur in Kano dialect)\n* ƙ / k', an ejective; and are separate consonants;\n* ƴ / 'y is a palatal approximant with creaky voice,,[http://www.phonetics.ucla.edu/course/chapter6/hausa/hausa.html Hausa ejectives and laryngealized consonants]. Sound files hosted by the University of California at Los Angeles, from: Ladefoged, Peter: [http://www.phonetics.ucla.edu/index.html A Course in Phonetics. 5th ed.] Thomson/Wadsworth. found in only a small number of high-frequency words (e.g. \"children\", \"daughter\"). Historically it developed from palatalized.Newman, Paul (1937/2000) The Hausa Language: an encyclopedic reference grammar. Yale University Press. p. 397.\n\nVowels\n\nHausa has five phonetic vowel sounds, which can be either short or long, giving a total of 10 monophthongs. In addition, there are four joint vowels (diphthongs), giving a total number of 14 vowel phonemes.\n\n; Monophthongs: Short (single) vowels:.  Long vowels:.\n\nIn comparison with the long vowels, the short can be similar in quality to the long vowels, mid-centralized to,]}} or centralized to,]}}.\n\nMedial can be neutralized to ~]}}, with the rounding depending on the environment.\n\nMedial are neutralized with.\n\nThe short can be either similar in quality to the long, or it can be as high as, with possible intermediate pronunciations ().\n\n; Diphthongs:.\n\nTones\n\nHausa is a tonal language. Each of its five vowels may have low tone, high tone or falling tone. In standard written Hausa, tone is not marked. In recent linguistic and pedagogical materials, tone is marked by means of diacritics.\n\n– low tone: grave accent ()\n\n– falling tone: circumflex ()\n\nAn acute accent () may be used for high tone, but the usual practice is to leave high tone unmarked.\n\nWriting systems\n\nBoko (Latin)\n\nHausa's modern official orthography is a Latin-based alphabet called boko, which was introduced in the 1930s by the British colonial administration.\n\nThe letter ƴ (y with a right hook) is used only in Niger; in Nigeria it is written ʼy.\n\nTone, vowel length, and the distinction between and (which does not exist for all speakers) are not marked in writing. So, for example, \"from\" and \"battle\" are both written daga.\n\nAjami (Arabic)\n\nHausa has also been written in ajami, an Arabic alphabet, since the early 17th century. There is no standard system of using ajami, and different writers may use letters with different values. Short vowels are written regularly with the help of vowel marks, which are seldom used in Arabic texts other than the Quran. Many medieval Hausa manuscripts in ajami, similar to the Timbuktu Manuscripts, have been discovered recently; some of them even describe constellations and calendars.\n\nIn the following table, vowels are shown with the Arabic letter for t () as an example.\n\nOther systems\n\nHausa is one of three indigenous languages of Nigeria which has been rendered in braille.\n\nAt least three other writing systems for Hausa have been proposed or \"discovered\". None of these are in active use beyond perhaps some individuals.\n\n* A Hausa alphabet supposedly of ancient origin and in use in north of Maradi, Niger.[http://www.bisharat.net/Demos/Hausa_alphabet.htm \"Hausa alphabet\"]\n* A script that apparently originated with the writing/publishing group Raina Kama in the 1980s.[http://www.bisharat.net/Demos/Hausa_alpha_2.htm Hausa alphabet from a 1993 publication]\n* A script called \"Tafi\" proposed in the 1970s(?)[http://www.bisharat.net/Demos/Hausa_alpha_3.htm Hausa alphabet from a 1993 publication]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hausa language" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14216" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hausa (Yaren Hausa or Harshen Hausa) is the Chadic language (a branch of the Afroasiatic language family) with the largest number of speakers, spoken as a first language by some 27 million people, and as a second language by another 20 million. The ancestral language of the Hausa people, one of the largest ethnic groups in Central Africa, Hausa is commonly spoken throughout southern Niger and northern Nigeria. It has developed into a lingua franca across much of Western  Africa for purposes of trade.\n\nClassification\n\nHausa belongs to the West Chadic languages subgroup of the Chadic languages group, which in turn is part of the Afroasiatic language family.\n\nGeographic distribution\n\nNative speakers of Hausa, the Hausa people, are mostly found in Niger, in the north of Nigeria, and in Chad. Furthermore, the language is used as a trade language across a much larger swathe of West Africa (Benin, Ghana, Cameroon, Togo, Ivory Coast etc.), Central Africa (Chad, Central African Republic, Gabon) and in northwestern Sudan, and Some parts of Ethiopia  particularly amongst Muslims.\n\nIt is taught at universities in Africa and around the world. The language is the most commonly spoken language in Nigeria and it is also widely spoken outside Nigeria, especially in Niger, Ghana, Cameroon and Sudan. Radio stations like BBC, Radio France Internationale, China Radio International, Voice of Russia, Voice of America, Arewa 24 Deutsche Welle, and IRIB broadcast in Hausa.\n\nDialects\n\nTraditional dialects\n\nEastern Hausa dialects include Dauranchi in Daura, Kananci in Kano, Bausanchi in Bauchi, Gudduranci in Katagum Misau and part of Borno, and Hadejanci in Hadejiya.\n\nWestern Hausa dialects include Sakkwatanci in Sokoto, Katsinanci in Katsina, Arewanci in Gobir, Adar, Kebbi, and Zamfara, and Kurhwayanci in Kurfey in Niger. Katsina is transitional between Eastern and Western dialects.\n\nNorthern Hausa dialects include Arewa and Arawci.\n\nZazzaganci in Zazzau is the major Southern dialect.\n\nThe Daura (Dauranchi) and Kano (Kananci) dialect are the standard.  The BBC, Deutsche Welle, Radio France Internationale and Voice of America offer Hausa services on their international news web sites using Dauranci and Kananci. In recent language development Zazzaganci took over the innovation of writing and speaking the current Hausa language use.\n\nNorthernmost dialects and loss of tonality\n\nThe western to eastern Hausa dialects of Kurhwayanci, Daragaram and Aderawa, represent the traditional northernmost limit of native Hausa communities. These are spoken in the northernmost sahel and mid-Saharan regions in west and central Niger in the Tillaberi, Tahoua, Dosso, Maradi, Agadez and Zinder regions. While mutually comprehensible with other dialects (especially Sakkwatanci, and to a lesser extent Gaananci), the northernmost dialects have slight grammatical and lexical differences owing to frequent contact with the Zarma and Tuareg groups and cultural changes owing to the geographical differences between the grassland and desert zones. These dialects also have the quality of being non-tonal or pitch accent dialects.\n\nThis link between non-tonality and geographic location is not limited to Hausa alone, but is exhibited in other northern dialects of neighbouring languages; such as the difference within Songhay language (between the non-tonal northernmost dialects of Koyra Chiini in Timbuktu and Koyraboro Senni in Gao; and the tonal southern Zarma dialect, spoken from western Niger to northern Ghana), and within the Soninke language (between the non-tonal northernmost dialects of Imraguen and Nemadi spoken in east-central Mauritania; and the tonal southern dialects of Senegal, Mali and the sahel).\n\nGhanaian Hausa dialect\n\nThe Ghanaian Hausa dialect (Gaananci), spoken in Ghana, Togo, and western Ivory Coast, is a distinct western native Hausa dialect-bloc with adequate linguistic and media resources available. Separate smaller Hausa dialects are spoken by an unknown number of Hausa further west in parts of Burkina Faso, and in the Haoussa Foulane, Badji Haoussa, Guezou Haoussa, and Ansongo districts of northeastern Mali (where it is designated as a minority language by the Malian government), but there are very little linguistic resources and research done on these particular dialects at this time.\n\nGaananci forms a separate group from other Western Hausa dialects, as it now falls outside the contiguous Hausa-dominant area, and is usually identified by the use of c for ky, and j for gy. This is attributed to the fact that Ghana's Hausa population descend from Hausa-Fulani traders settled in the zongo districts of major trade-towns up and down the previous Asante, Gonja and Dagomba kingdoms stretching from the sahel to coastal regions, in particular the cities of Tamale, Salaga, Bawku, Bolgatanga, Achimota, Nima and Kumasi.\n\nGaananci exhibits noted inflected influences from Zarma, Gur, Dyula and Soninke, as Ghana is the westernmost area in which the Hausa language is a major lingua-franca; as well as it being the westernmost area both the Hausa and Djerma ethnic groups inhabit in large numbers. Immediately west from Ghana (in Ivory Coast, Togo, and Burkina Faso), Hausa is abruptly replaced with Dioula–Bambara as the main lingua-franca of what become predominantly Mandinka areas, and native Hausa populations plummet to a very small urban minority.\n\nBecause of this, and the presence of surrounding Akan, Gur and Mande languages, Gaananci was historically isolated from the other Hausa dialects.[http://www.njas.helsinki.fi/pdf-files/vol5num2/bodomo.pdf Njas.helsinki.fi] Despite this difference, grammatical similarities between Sakkwatanci and Ghanaian Hausa determine that the dialect, and the origin of the Ghanaian Hausa people themselves, are derived from the northwestern Hausa area surrounding Sokoto.[http://www.ethnorema.it/pdf/numero%204/03%20Articolo%201%20Guerini.pdf Ethnorema.it]\n\nHausa is also widely spoken by non-native Gur and Mande Ghanaian Muslims, but differs from Gaananci, and rather has features consistent with non-native Hausa dialects.\n\nOther native dialects\n\nHausa is also spoken various parts of Cameroon and Chad, which combined the mixed dialects of northern Nigeria and Niger. In addition, Arabic has had a great influence in the way Hausa is spoken by the native Hausa speakers in these areas.\n\nNon-native Hausa\n\nIn West Africa, Hausa's use as a lingua franca has given rise to a non-native pronunciation that differs vastly from native pronunciation by way of key omissions of implosive and ejective consonants present in native Hausa dialects, such as ɗ, ɓ and kʼ/ƙ, which are pronounced by non-native speakers as d, b and k respectively. This creates confusion among non-native and native Hausa speakers, as non-native pronunciation does not distinguish words like ' (\"correct\") and ' (\"one-by-one\"). Another difference between native and non-native Hausa is the omission of vowel length in words and change in the standard tone of native Hausa dialects (ranging from native Fulani and Tuareg Hausa-speakers omitting tone altogether, to Hausa speakers with Gur or Yoruba mother tongues using additional tonal structures similar to those used in their native languages). Use of masculine and feminine gender nouns and sentence structure are usually omitted or interchanged, and many native Hausa nouns and verbs are substituted with non-native terms from local languages.\n\nNon-native speakers of Hausa numbered more than 25 million and, in some areas, live close to native Hausa. It has replaced many other languages especially in the north-central and north-eastern part of Nigeria and continues to gain popularity in other parts of Africa as a result of Hausa movies and music which spread out throughout the region.\n\nThere are several pidgin forms of Hausa. Barikanchi was formerly used in the colonial army of Nigeria. Gibanawa is currently in widespread use in Jega in northwestern Nigeria, south of the native Hausa area.\n\nPhonology\n\nConsonants\n\nHausa has between 23 and 25 consonant phonemes depending on the speaker.\n\nThe three-way contrast between palatalized velars, plain velars, and labialized velars is found only before long and short, e.g. ('grass'), ('to increase'), ('shea-nuts'). Before front vowels, only palatalized and labialized velars occur, e.g. ('jealousy') vs. ('side of body'). Before rounded vowels, only labialized velars occur, e.g. ('ringworm').\n\nGlottalic consonants\n\nHausa has glottalic consonants (implosives and ejectives) at four or five places of articulation (depending on the dialect). They require movement of the glottis during pronunciation and have a staccato sound.\n\nThey are written with modified versions of Latin letters. They can also be denoted with an apostrophe, either before or after depending on the letter, as shown below.\n\n* ɓ / b', an implosive consonant,, sometimes;\n* ɗ / d', an implosive, sometimes;\n* ts', an ejective consonant, or, according to the dialect;\n* ch', an ejective (does not occur in Kano dialect)\n* ƙ / k', an ejective; and are separate consonants;\n* ƴ / 'y is a palatal approximant with creaky voice,,[http://www.phonetics.ucla.edu/course/chapter6/hausa/hausa.html Hausa ejectives and laryngealized consonants]. Sound files hosted by the University of California at Los Angeles, from: Ladefoged, Peter: [http://www.phonetics.ucla.edu/index.html A Course in Phonetics. 5th ed.] Thomson/Wadsworth. found in only a small number of high-frequency words (e.g. \"children\", \"daughter\"). Historically it developed from palatalized.Newman, Paul (1937/2000) The Hausa Language: an encyclopedic reference grammar. Yale University Press. p. 397.\n\nVowels\n\nHausa has five phonetic vowel sounds, which can be either short or long, giving a total of 10 monophthongs. In addition, there are four joint vowels (diphthongs), giving a total number of 14 vowel phonemes.\n\n; Monophthongs: Short (single) vowels:.  Long vowels:.\n\nIn comparison with the long vowels, the short can be similar in quality to the long vowels, mid-centralized to,]}} or centralized to,]}}.\n\nMedial can be neutralized to ~]}}, with the rounding depending on the environment.\n\nMedial are neutralized with.\n\nThe short can be either similar in quality to the long, or it can be as high as, with possible intermediate pronunciations ().\n\n; Diphthongs:.\n\nTones\n\nHausa is a tonal language. Each of its five vowels may have low tone, high tone or falling tone. In standard written Hausa, tone is not marked. In recent linguistic and pedagogical materials, tone is marked by means of diacritics.\n\n– low tone: grave accent ()\n\n– falling tone: circumflex ()\n\nAn acute accent () may be used for high tone, but the usual practice is to leave high tone unmarked.\n\nWriting systems\n\nBoko (Latin)\n\nHausa's modern official orthography is a Latin-based alphabet called boko, which was introduced in the 1930s by the British colonial administration.\n\nThe letter ƴ (y with a right hook) is used only in Niger; in Nigeria it is written ʼy.\n\nTone, vowel length, and the distinction between and (which does not exist for all speakers) are not marked in writing. So, for example, \"from\" and \"battle\" are both written daga.\n\nAjami (Arabic)\n\nHausa has also been written in ajami, an Arabic alphabet, since the early 17th century. There is no standard system of using ajami, and different writers may use letters with different values. Short vowels are written regularly with the help of vowel marks, which are seldom used in Arabic texts other than the Quran. Many medieval Hausa manuscripts in ajami, similar to the Timbuktu Manuscripts, have been discovered recently; some of them even describe constellations and calendars.\n\nIn the following table, vowels are shown with the Arabic letter for t () as an example.\n\nOther systems\n\nHausa is one of three indigenous languages of Nigeria which has been rendered in braille.\n\nAt least three other writing systems for Hausa have been proposed or \"discovered\". None of these are in active use beyond perhaps some individuals.\n\n* A Hausa alphabet supposedly of ancient origin and in use in north of Maradi, Niger.[http://www.bisharat.net/Demos/Hausa_alphabet.htm \"Hausa alphabet\"]\n* A script that apparently originated with the writing/publishing group Raina Kama in the 1980s.[http://www.bisharat.net/Demos/Hausa_alpha_2.htm Hausa alphabet from a 1993 publication]\n* A script called \"Tafi\" proposed in the 1970s(?)[http://www.bisharat.net/Demos/Hausa_alpha_3.htm Hausa alphabet from a 1993 publication]. Hausa language. http://en.wikipedia.org/?curid=14216."
  }
}
