{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16082",
  "eid" : "236ca860-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778568678,
  "textBody" : "Jericho (;  ';  ') is a city in the Palestinian Territories and is located near the Jordan River in the West Bank. It is the administrative seat of the Jericho Governorate, and is governed by the Fatah faction of the Palestinian National Authority. In 2007, it had a population of 18,346.[http://www.pcbs.gov.ps/Portals/_PCBS/Downloads/book1487.pdf#page\n109 2007 PCBS Census] . Palestinian Central Bureau of Statistics (PCBS). The city was occupied by Jordan from 1949 to 1967, and has been held under Israeli occupation since 1967; administrative control was handed over to the Palestinian Authority in 1994.[http://www.aljazeera.com/news/middleeast/2012/08/2012829184442780471.html Palestinian farmers ordered to leave lands] Al Jazeera. 29 August 2012 It is believed to be one of the oldest inhabited cities in the worldMurphy-O'Connor, 1998, p. 288.Freedman et al., 2000, p. 689–671. and the city with the oldest known protective wall in the world.Michal Strutin, Discovering Natural Israel (2001), p. 4. It was thought to have the oldest stone tower in the world as well, but excavations at Tell Qaramel in Syria have discovered stone towers that are even older.\n\nArchaeologists have unearthed the remains of more than 20 successive settlements in Jericho, the first of which dates back 11,000 years (9000 BC), almost to the very beginning of the Holocene epoch of the Earth's history.\n\nCopious springs in and around the city have attracted human habitation for thousands of years.Bromiley, 1995, p. 715 Jericho is described in the Hebrew Bible as the \"City of Palm Trees\".\n\nEtymology\n\nJericho's name in Hebrew, , is generally thought to derive from the Canaanite word reaẖ (\"fragrant\"), but other theories hold that it originates in the Canaanite word for \"moon\" (Yareaẖ) or the name of the lunar deity Yarikh for whom the city was an early centre of worship.\n\nJericho's Arabic name, , means \"fragrant\" and also has its roots in Canaanite Reaẖ.Schreiber, 2003, p. 141.Bromiley, 1995, p. 1136.\n\nHistory and archaeology\n\nHistory of excavations\n\nThe first excavations of the site were made by Charles Warren in 1868. Ernst Sellin and Carl Watzinger excavated Tell es-Sultan and Tulul Abu el-'Alayiq between 1907–1909 and in 1911, and John Garstang excavated between 1930 and 1936. Extensive investigations using more modern techniques were made by Kathleen Kenyon between 1952 and 1958. Lorenzo Nigro and Nicolò Marchetti conducted excavations in 1997–2000. Since 2009 the Italian-Palestinian archaeological project of excavation and restoration was resumed by Rome \"La Sapienza\" University and Palestinian MOTA-DACH under the direction of Lorenzo Nigro and Hamdan Taha, and Jehad Yasine since 2015 (www.lasapienzatojericho.it). The Italian-Palestinian Expedition carried out 13 seasons in 20 years (1997–2017), with some major discoveries, like Tower A1 in the Middle Bronze Age southern Lower Town and Palace G on the eastern flanks of the Spring Hill overlooking the Spring of 'Ain es-Sultan dating from Early Bronze III.\n\nStone Age: Tell es-Sultan and its spring\n\nThe earliest settlement was located at the present-day Tell es-Sultan (or Sultan's Hill), a couple of kilometers from the current city. In both Arabic and Hebrew, tell means \"mound\" - consecutive layers of habitation built up a mound over time, as is common for ancient settlements in the Middle East and Anatolia. Jericho is the type site for the Pre-Pottery Neolithic A (PPNA) and Pre-Pottery Neolithic B (PPNB) periods.\n\nNatufian hunter-gatherers,  10,000 BC\n\nEpipaleolithic construction at the site appears to predate the invention of agriculture, with the construction of Natufian culture structures beginning earlier than 9000 BC, the very beginning of the Holocene epoch in geologic history.\n\nJericho has evidence of settlement dating back to 10,000 BC. During the Younger Dryas period of cold and drought, permanent habitation of any one location was impossible. However, the Ein es-Sultan spring at what would become Jericho was a popular camping ground for Natufian hunter-gatherer groups, who left a scattering of crescent-shaped microlith tools behind them. Around 9600 BC, the droughts and cold of the Younger Dryas stadial had come to an end, making it possible for Natufian groups to extend the duration of their stay, eventually leading to year-round habitation and permanent settlement.\n\nPre-Pottery Neolithic,  9500 BC\n\nPre-Pottery Neolithic A (PPNA)\n\nThe first permanent settlement on the site of Jericho developed near the Ein es-Sultan spring between 9,500 and 9000 BC. As the world warmed up, a new culture based on agriculture and sedentary dwelling emerged, which archaeologists have termed \"Pre-Pottery Neolithic A\" (abbreviated as PPNA). PPNA villages are characterized by small circular dwellings, burial of the dead under the floor of buildings, reliance on hunting wild game, the cultivation of wild or domestic cereals, and no use of pottery yet. At Jericho, circular dwellings were built of clay and straw bricks left to dry in the sun, which were plastered together with a mud mortar. Each house measured about 5 m across, and was roofed with mud-smeared brush. Hearths were located within and outside the homes.\n\nBy about 9400 BC, the town had grown to more than 70 modest dwellings.\n\nThe Pre-Pottery Neolithic A phase at Tell es-Sultan (c. 8350–7370 BC) is sometimes called Sultanian. The site is a 40000 m2 settlement surrounded by a massive stone wall over  high and  wide at the base (see Wall of Jericho), inside of which stood a stone tower (see Tower of Jericho), over  high, containing an internal staircase with 22 stone steps and placed in the centre of the west side of the tell.Ran Barkai and Roy Liran. \"Midsummer Sunset at Neolithic Jericho\". In Time and Mind: The Journal of Archaeology, Consciousness and Culture, Volume 1—Issue 3, November 2008, p. 279. DOI 10.2752/175169708X329345 This tower and the even older ones excavated at Tell Qaramel in Syria are the oldest ever to be discovered. The wall may have served as a defence against flood-water, with the tower used for ceremonial purposes. The wall and tower were built during the Pre-Pottery Neolithic A (PPNA) period around 8000 BCE.[http://www.jpost.com/VideoArticles/Video/Article.aspx?id208206 O'Sullivan, Arieh., World’s first skyscraper sought to intimidate masses, Jerusalem Post, 14 February 2011] For the tower, carbon dates published in 1981 and 1983 indicate that it was built around 8300 BC and stayed in use until c. 7800 BC. The wall and tower would have taken a hundred men more than a hundred days to construct, thus suggesting some kind of social organization. The town contained round mud-brick houses, yet no street planning. The identity and number of the inhabitants of Jericho during the PPNA period is still under debate, with estimates going as high as 2,000–3,000, and as low as 200–300. It is known that this population had domesticated emmer wheat, barley and pulses and hunted wild animals.\n\nPre-Pottery Neolithic B (PPNB)\n\nPre-Pottery Neolithic B, 7220 to 5850 BC (but carbon-14-dates are few and early). Expanded range of domesticated plants. Possible domestication of sheep. Apparent cult involving the preservation of human skulls, with facial features reconstructed from plaster and eyes set with shells in some cases.\n\nAfter a few centuries, the first settlement was abandoned. After the PPNA settlement phase, there was a settlement hiatus of several centuries, then the PPNB settlement was founded on the eroded surface of the tell. This second settlement, established in 6800 BC, perhaps represents the work of an invading people who absorbed the original inhabitants into their dominant culture. Artifacts dating from this period include ten plastered human skulls, painted so as to reconstitute the individuals' features. These represent either teraphim or the first example of portraiture in art history, and it is thought that they were kept in people's homes while the bodies were buried.Janson and Janson, 2003.\n\nThe architecture consisted of rectilinear buildings made of mudbricks on stone foundations. The mudbricks were loaf-shaped with deep thumb prints to facilitate bounding. No building has been excavated in its entirety. Normally, several rooms cluster around a central courtyard. There is one big room ( and 7 x) with internal divisions, the rest are small, presumably used for storage. The rooms have red or pinkish terrazzo-floors made of lime. Some impressions of mats made of reeds or rushes have been preserved. The courtyards have clay floors.\n\nKathleen Kenyon interpreted one building as a shrine. It contained a niche in the wall. A chipped pillar of volcanic stone that was found nearby might have fitted into this niche.\n\nThe dead were buried under the floors or in the rubble fill of abandoned buildings. There are several collective burials. Not all the skeletons are completely articulated, which may point to a time of exposure before burial. A skull cache contained seven skulls. The jaws were removed and the faces covered with plaster; cowries were used as eyes. A total of ten skulls were found. Modelled skulls were found in Tell Ramad and Beisamoun as well.\n\nOther finds included flints, such as arrowheads (tanged or side-notched), finely denticulated sickle-blades, burins, scrapers, a few tranchet axes, obsidian, and green obsidian from an unknown source. There were also querns, hammerstones, and a few ground-stone axes made of greenstone. Other items discovered included dishes and bowls carved from soft limestone, spindle whorls made of stone and possible loom weights, spatulae and drills, stylised anthropomorphic plaster figures, almost life-size, anthropomorphic and theriomorphic clay figurines, as well as shell and malachite beads.\n\nIn the late 4th millennium BC, Jericho was occupied during Neolithic 2 and the general character of the remains on the site link it culturally with Neolithic 2 (or PPNB) sites in the West Syrian and Middle Euphrates groups. This link is established by the presence of rectilinear mud-brick buildings and plaster floors that are characteristic of the age.\n\nBronze Age\n\nA succession of settlements followed from 4500 BC onward, the largest constructed in 2600 BC.\n\nJericho was continually occupied into the Middle Bronze Age; it was destroyed in the Late Bronze, after which it no longer served as an urban centre. The city was surrounded by extensive defensive walls strengthened with rectangular towers, and possessed an extensive cemetery with vertical shaft-tombs and underground burial chambers; the elaborate funeral offerings in some of these may reflect the emergence of local kings.\n\nDuring the Middle Bronze Age, Jericho was a small prominent city of the Canaan region, reaching its greatest Bronze Age extent in the period from 1700 to 1550 BC. It seems to have reflected the greater urbanization in the area at that time, and has been linked to the rise of the Maryannu, a class of chariot-using aristocrats linked to the rise of the Mitannite state to the north. Kathleen Kenyon reported \"the Middle Bronze Age is perhaps the most prosperous in the whole history of Kna'an. ... The defenses ... belong to a fairly advanced date in that period\" and there was \"a massive stone revetment ... part of a complex system\" of defenses (pp. 213–218).Kenyon, Kathleen \"Digging up Jericho\"(London, 1957) Bronze Age Jericho fell in the 16th century at the end of the Middle Bronze Age, the calibrated carbon remains from its City-IV destruction layer dating to 1617–1530 BC. Notably this carbon dating  1573 BC confirmed the accuracy of the stratigraphical dating  1550 by Kenyon.\n\nThere was evidence of a small settlement in the Late Bronze Age (c. 1400s BC) on the site, but erosion and destruction from previous excavations have erased significant parts of this layer.\n\nIron Age\n\nTell es-Sultan remained unoccupied from the end of the 15th to the 10th–9th centuries BC, when the city was rebuilt. Of this new city not much more remains than a four-room house on the eastern slope. By the 7th century, Jericho had become an extensive town, but this settlement was destroyed in the Babylonian conquest of Judah in the late 6th century.\n\nPersian and Early Hellenistic periods\n\nAfter the destruction of the Judahite city by the Babylonians in the late 6th century, whatever was rebuilt in the Persian period as part of the Restoration after the Babylonian captivity, left only very few remains. The tell was abandoned as a place of settlement not long after this period. During the Persian through Hellenistic periods, there is little in terms of occupation attested throughout the region.\n\nJericho went from being an administrative centre of Yehud Medinata (\"the Province of Judah\") under Persian rule to serving as the private estate of Alexander the Great between 336 and 323 BC after his conquest of the region. In the middle of the 2nd century BC Jericho was under Hellenistic rule of the Seleucid Empire, when the Syrian General Bacchides built a number of forts to strengthen the defences of the area around Jericho against the revolt by the Macabees.1 Maccabees 9:50 One of these forts, built at the entrance to Wadi Qelt, was later refortified by Herod the Great, who named it Kypros after his mother.Murphy-O'Connor, 1998, pp. 289–291.\n\nHasmonean and Herodian periods\n\nAfter the abandonment of the Tell es-Sultan location, the new Jericho of the Late Hellenistic or Hasmonean and Early Roman or Herodian periods, was established as a garden city in the vicinity of the royal estate at Tulul Abu el-'Alayiq and expanded greatly thanks to the intensive exploitation of the springs of the area. The new site consists of a group of low mounds on both banks of Wadi Qelt. The Hasmoneans were a dynasty descending from a priestly group (kohanim) from the tribe of Levi, who ruled over Judea following the success of the Maccabean Revolt until Roman influence over the region brought Herod to claim the Hasmonean throne.Magnusson, Magnus (1977). Archaeology of the Bible. New York: Simon and Schuster. p. 219. .\n\nThe rock-cut tombs of a Herodian- and Hasmonean-era cemetery lie in the lowest part of the cliffs between Nuseib al-Aweishireh and Jabal Quruntul in Jericho and were used between 100 BC and 68 CE.\n\nHerodian period\n\nHerod had to lease back the royal estate at Jericho from Cleopatra, after Mark Antony had given it to her as a gift. After their joint suicide in 30 BC, Octavian assumed control of the Roman Empire and granted Herod absolute rule over Jericho, as part of the new Herodian domain. Herod's rule oversaw the construction of a hippodrome-theatre (Tell es-Samrat) to entertain his guests and new aqueducts to irrigate the area below the cliffs and reach his winter palaces built at the site of Tulul Abu el-Alaiq (also written Alayiq). In 2008 the Israel Exploration Society published an illustrated volume of Herod's third Jericho palace.Silvia Rozenberg; Ehud Netzer (2008). Hasmonean and Herodian palaces at Jericho: final reports of the 1973–1987 excavations. 4, \"The decoration of Herod's third palace at Jericho\". Jerusalem: Israel Exploration Society: Institute of Archaeology, The Hebrew University of Jerusalem. . [https://www.worldcat.org/title/hasmonean-and-herodian-palaces-at-jericho-final-reports-of-the-1973-1987-excavations-4-the-decoration-of-herods-third-palace-at-jericho/oclc/758612875?ht\nedition&referer=di WorldCat website]\n\nThe dramatic murder of Aristobulus III in a swimming pool at the winter palaces near Jericho, as described by the Roman Jewish historian Josephus, took place during a banquet organized by Herod's Hasmonean mother-in-law. After the construction of the palaces, the city had functioned not only as an agricultural center and as a crossroad, but also as a winter resort for Jerusalem's aristocracy.[http://www.christusrex.org/www1/ofm/mad/discussion/012discuss.html Jericho - (Ariha)] Studium Biblicum Franciscum - Jerusalem.\n\nHerod was succeeded in Judea by his son, Herod Archelaus, who built a village in his name not far to the north, Archelaïs (modern Khirbet al-Beiyudat), to house workers for his date plantation.\n\nFirst-century Jericho is described in Strabo's Geography as follows:\n\nIn the New Testament\n\nThe Christian Gospels state that Jesus of Nazareth passed through Jericho where he healed blind beggars (), and inspired a local chief tax-collector named Zacchaeus to repent of his dishonest practices (). The road between Jerusalem and Jericho is the setting for the Parable of the Good Samaritan.\n\nJohn Wesley, in his New Testament Notes on this section of Luke's Gospel, claimed that \"about twelve thousand priests and Levites dwelt there, who all attended the service of the temple\".Wesley, J., [http://wesley.nnu.edu/john-wesley/john-wesleys-notes-on-the-bible/notes-on-the-gospel-according-to-st-luke/#Chapter+X Notes on The Gospel According to St Luke]\n\nSmith's Bible Names Dictionary suggests that on the arrival of Jesus and his entourage, \"Jericho was once more 'a city of palms' when our Lord visited it. Here he restored sight to the blind (Matthew 20:30; Mark 10:46; Luke 18:35). Here the descendant of Rahab did not disdain the hospitality of Zaccaeus the publican. Finally, between Jerusalem and Jericho was laid the scene of his story of the good Samaritan.\"[https://www.biblegateway.com/resources/smiths-bible-names-dictionary/Jericho Smith's Bible Names Dictionary: Jericho], accessed 6 February 2017\n\nRoman province\n\nAfter the fall of Jerusalem to Vespasian's armies in the Great Revolt of Judea in 70 AD, Jericho declined rapidly, and by 100 AD it was but a small Roman garrison town. A fort was built there in 130 and played a role in putting down the Bar Kochba revolt in 133.\n\nByzantine period\n\nAccounts of Jericho by a Christian pilgrim are given in 333. Shortly thereafter the built-up area of the town was abandoned and a Byzantine Jericho, Ericha, was built 1600 metres (1 mi) to the east, on which the modern town is centered.Losch, 2005, p. 117–118. Christianity took hold in the city during the Byzantine era and the area was heavily populated. A number of monasteries and churches were built, including St George of Koziba in 340 AD and a domed church dedicated to Saint Eliseus. At least two synagogues were also built in the 6th century AD. The monasteries were abandoned after the Persian invasion of 614.\n\nThe Jericho Synagogue in the Royal Maccabean winter palace at Jericho dates from 70–50 BC.\n\nA synagogue dating to the late 6th or early 7th century AD was discovered in Jericho in 1936, and was named Shalom Al Yisrael Synagogue, or \"peace unto Israel\", after the central Hebrew motto in its mosaic floor. It was controlled by Israel after the Six Day War, but after the handover to Palestinian Authority control per the Oslo Accords, it has been a source of conflict. On the night of 12 October 2000, the synagogue was vandalized by Palestinians who burned holy books and relics and damaged the mosaic.\n\nThe Na'aran synagogue, another Byzantine era construction, was discovered on the northern outskirts of Jericho in 1918. While less is known of it than Shalom Al Yisrael, it has a larger mosaic and is in similar condition.\n\nEarly Muslim period\n\nJericho, by then named \"Ariha\" in Arabic variation, became part of Jund Filastin (\"Military District of Palestine\"), part of the larger province of Bilad al-Sham. The Arab Muslim historian Musa b. 'Uqba (d. 758) recorded that caliph Umar ibn al-Khattab exiled the Jews and Christians of Khaybar to Jericho (and Tayma).Several hadith collections: e.g. Bukhari, Sahih as translated Muḥammad Muḥsin Khân, The Translation of the Meanings of Sahih al-Bukhari (India: Kitab Bhavan, 1987) 3.39.531 and 4.53.380, and Muslim Sahih trans. Abdul Hamid Siddiqui (Lahore: Kazi Publications, 1976) 10.3763.\n\nBy 659, that district had come under the control of Mu'awiya, founder of the Umayyad dynasty. That year, an earthquake destroyed Jericho.The Maronite Chronicle, written during Mu'awiya's caliphate. Note that for propaganda reasons it dates the earthquake to the wrong year: Andrew Palmer, The Seventh Century in the West-Syrian Chronicles (Liverpool: Liverpool University Press, 1993), 30, 31, 32. A decade later, the pilgrim Arculf visited Jericho and found it in ruins, all its \"miserable Canaanite\" inhabitants now dispersed in shanty towns around the Dead Sea shore.\"The Pilgrimage of Arculf in the Holy Land\", De Locis Sanctis as translated by Rev. James Rose MacPherson (W. London: BD. 24, Hanover Square, 1895), ch. I.11.\n\nA palatial complex long attributed to the tenth Umayyad caliph, Hisham ibn Abd al-Malik (r. 724–743) and thus known as Hisham's Palace, is located at Khirbet al-Mafjar, about 1.5 kilometres (1 mi) north of Tell es-Sultan. This \"desert castle\" or qasr was more likely built by Caliph Walid ibn Yazid (r. 743–744), who was assassinated before he could complete the construction.Jerome Murphy-O’Connor, The Holy Land: An Oxford Archaeological Guide from Earliest Times to 1700, Oxford University Press 2008, pp. 342–344. The remains of two mosques, a courtyard, mosaics, and other items can still be seen in situ today. The unfinished structure was largely destroyed in an earthquake in 747.\n \nUmayyad rule ended in 750 and was followed by the Arab caliphates of the Abbasid and Fatimid dynasties. Irrigated agriculture was developed under Islamic rule, reaffirming Jericho's reputation as a fertile \"City of the Palms\".Shahin, 2005, p. 285. Al-Maqdisi, the Arab geographer, wrote in 985 that \"the water of Jericho is held to be the highest and best in all Islam. Bananas are plentiful, also dates and flowers of fragrant odor\".Shahin, 2005, p. 283. Jericho is also referred to by him as one of the principal cities of Jund Filastin.al-Muqaddasi quoted in Le Strange, 1890, p. [https://archive.org/stream/palestineundermo00lestuoft#page/39/mode/1up 39]\n\nThe city flourished until 1071 with the invasion of the Seljuk Turks, followed by the upheavals of the Crusades.\n\nCrusader period\n\nIn 1179, the Crusaders rebuilt the Monastery of St. George of Koziba, at its original site 10 kilometres (6 mi) from the center of town. They also built another two churches and a monastery dedicated to John the Baptist, and are credited with introducing sugarcane production to the city.Hull, 1855. The site of Tawahin es-Sukkar (lit. \"sugar mills\") holds remains of a Crusader sugar production facility. In 1187, the Crusaders were evicted by the Ayyubid forces of Saladin after their victory in the Battle of Hattin, and the town slowly went into decline.\n\nAyyubid and Mamluk periods\n\nIn 1226, Arab geographer Yaqut al-Hamawi said of Jericho, \"it has many palm trees, also sugarcane in quantities, and bananas. The best of all the sugar in the Ghaur land is made here.\" In the 14th century, Abu al-Fida writes there are sulfur mines in Jericho, \"the only ones in Palestine\".al-Hamawi and Abu-l Fida quoted in Le Strange, 1890, p. [https://archive.org/stream/palestineundermo00lestuoft#page/397/mode/1up 397]\n\nOttoman period\n\nJericho  was incorporated into the Ottoman Empire in 1517 with all of Palestine, and in 1545 a revenue of 19,000 Akçe was recorded, destined for the new Waqf  for the Haseki Sultan Imaret of Jerusalem.Singer, 2002, pp. [https://books.google.com/books?id\nzHBHBTNwBQoC&pgPA50  50], [https://books.google.com/books?id\nzHBHBTNwBQoC&pgPA52  52] The villagers processed indigo as one source of revenue, using a cauldron specifically for this purpose that was loaned to them by the Ottoman authorities in Jerusalem.Singer, 2002, p. [https://books.google.com/books?idzHBHBTNwBQoC&pg\nPA120  120] Later that century, the Jericho revenues no longer went to the Haseki Sultan Imaret.Singer, 2002, p. [https://books.google.com/books?id\nzHBHBTNwBQoC&pg=PA126  126]\n\nIn 1596 Jericho  appeared in the  tax registers  under the name of Riha,  being in the nahiya of Al-Quds in the liwa of Al-Quds. It had a population of 51 household, all Muslims. They paid a fixed  tax-rate of 33,3 % on agricultural products, including wheat, barley, summer crops,  vineyards and fruit trees,  goats and beehives, water buffaloes, in addition to occasional revenues; a total of 40,000 Akçe. All of the revenue still  went to a Waqf.Hütteroth and Abdulfattah, 1977, p. 114 \n\nThe French traveler Laurent d'Arvieux described the city in 1659 as \"now desolate, and consists only of about fifty poor houses, in bad condition ... The plain around is extremely fertile; the soil is middling fat; but it is watered by several rivulets, which flow into the Jordan. Notwithstanding these advantages only the gardens adjacent to the town are cultivated.\"Graham, 1836, p. [https://archive.org/stream/bub_gb_0ZYCAAAAQAAJ#page/n136/mode/1up 122] \n\nIn the 19th century, European scholars, archaeologists and missionaries visited often. At the time it was an oasis in a poor state, similar to other regions in the plains and deserts.Ben-Arieh, Yehoshua. [http://www.ybz.org.il/_Uploads/dbsAttachedFiles/Article_36.8.pdf \"The Sanjak of Jerusalem in the 1870s\"]. In Cathedra, 36. Jerusalem: Yad Yitzhak Ben Zvi. 1985. pp. 80–82 Edward Robinson (1838) reported 50 families, which were about 200 people,Robinson and Smith, 1841, vol. 2, p.  [https://archive.org/stream/biblicalresearc00smitgoog#page/n302/mode/1up   280] Titus Tobler (1854) reported some 30 poor huts, whose residents paid a total of 3611 Kuruş in tax.Titus Tobler, Topographie von Jerusalem und seinen Umgebungen, Berlin, 1853–1854, p. 642 Abraham Samuel Hershberg also reported some 30 poor huts and 300 residents.A.s. Hershberg, In the Land of the East, Vilna 1899, p. 469 At that time, Jericho was the residence of the region's Turkish governor. The main water sources for the village were a spring called Ein al-Sultan in Arabic and Elisha Spring in Hebrew, and springs in Wadi Qelt.\n\nAn Ottoman  village list from around 1870 showed that  Riha, Jericho,  had 36 houses and a population of 105, though the population count included men, only.Socin, 1879, p. [https://archive.org/stream/zeitschriftdesde01deut#page/159/mode/1up 159]Hartmann, 1883, p. [https://archive.org/stream/bub_gb_BZobAQAAIAAJ#page/n932/mode/1up  124],  noted  34 houses   \n\nThe first excavation at Tell es-Sultan was carried out in 1867, and the monasteries of St. George of Koziba and John the Baptist were refounded and completed in 1901 and 1904, respectively.\n\nBritish Mandate period\n\nDuring World War II The British built fortresses in Jericho with the help of the Jewish company Solel Boneh, and bridges were rigged with explosives in preparation for a possible invasion by German allied forces.Friling and Cummings, 2005, p. 65.  After the collapse of the Ottoman Empire at the end of World War I, Jericho came under the rule of the Mandatory Palestine. \n\nAccording to the 1922 census of Palestine, Jericho had 1,029 inhabitants, consisting of 931 Muslims, 6 Jews and 92 Christians;Barron, 1923,  Table VII, Sub-district of Jericho, p. [https://archive.org/stream/PalestineCensus1922/Palestine%20Census%20%281922%29#page/n21/mode/1up  19] where the Christians were 45 Orthodox, 12 Roman Catholics, 13 Greek Catholics (Melchites), 6 Syrian Catholic, 11 Armenians, 4 Copts and 1 Church of England.Barron, 1923,  Table XIV,  p. [https://archive.org/stream/PalestineCensus1922/Palestine%20Census%20%281922%29#page/n47/mode/1up  45] \n\nIn 1927, an earthquake struck and affected Jericho and other cities. Around 300 people died,  but by the  1931 census the population had increased to 1,693 inhabitants, in 347 houses.Mills, 1932, p.[https://archive.org/details/CensusOfPalestine1931.PopulationOfVillagesTownsAndAdministrativeAreas   45] \n\nIn   1945, the Jericho's population was 3,010; 2,570 Muslims, 170 Jews, 260 Christians and 10 classified as \"other\",Department of Statistics, 1945, p. [http://users.cecs.anu.edu.au/~bdm/yabber/census/VSpages/VS1945_p24.jpg 24] and it had jurisdiction over 37,481 dunams of land.Government of Palestine, Department of Statistics. Village Statistics, April, 1945. Quoted in  Hadawi, 1970, p. [http://www.palestineremembered.com/download/VillageStatistics/Table%20I/Jerusalem/Page-057.jpg 57] Of this, 948 dunams were used for citrus and bananas, 5,873 dunams were for plantations and irrigable land,  9,141 for cereals,Government of Palestine, Department of Statistics. Village Statistics, April, 1945. Quoted in  Hadawi, 1970, p. [http://www.palestineremembered.com/download/VillageStatistics/Table%20II/Jerusalem/Page-102.jpg  102] while a total of 38 dunams were urban, built-up areas.Government of Palestine, Department of Statistics. Village Statistics, April, 1945. Quoted in  Hadawi,  1970, p. [http://www.palestineremembered.com/download/VillageStatistics/Table%20III/Jerusalem/Page-153.jpg  153]\n\nJordanian period\n\nJericho came under Jordanian control after the 1948 Arab–Israeli War. The Jericho Conference, organized by King Abdullah and attended by over 2,000 Palestinian delegates in 1948 proclaimed \"His Majesty Abdullah as King of all Palestine\" and called for \"the unification of Palestine and Transjordan as a step toward full Arab unity\". In mid-1950, Jordan formally annexed the West Bank and Jericho residents, like other residents of West Bank localities became Jordanian citizens.Benvenisti, 1998, pp. 27-28.\n\nIn 1961, the population of Jericho was  10,166,Government of Jordan, 1964, p. [http://users.cecs.anu.edu.au/~bdm/yabber/census/JordanCensusPages/JordanCensus1961-p13.pdf 13] of whom 935 were Christian, the rest Muslim.Government of Jordan, Department of Statistics, 1964, pp. [http://users.cecs.anu.edu.au/~bdm/yabber/census/JordanCensusPages/JordanCensus1961-pp115-116.pdf 115-116]\n\n1967, aftermath\n\nJericho has been occupied by Israel since the Six-Day War of 1967 along with the rest of the West Bank. It was the first city handed over to Palestinian Authority control in accordance with the Oslo Accords. The limited Palestinian self-rule of Jericho was agreed on in the Gaza–Jericho Agreement of 4 May 1994. Part of the agreement was a \"Protocol on Economic Relations\", signed on 29 April 1994. The city is in an enclave of the Jordan Valley that is in Area A of the West Bank, while the surrounding area is designated as being in Area C under full Israeli military control. Four roadblocks encircle the enclave, restricting Jericho's Palestinian population's movement through the West Bank.\n\nIn response to the 2001 Second Intifada and suicide bombings, Jericho was re-occupied by Israeli troops. A 2 m deep trench was built around a large part of the city to control Palestinian traffic to and from Jericho.ARIJ & LRC, 20 March 2001, [http://www.poica.org/editor/case_studies/view.php?recordID=138 The Tightening of the Siege on Jericho: Israel Employs a New Policy of Trench Digging] \n\nOn 14 March 2006, the Israel Defense Forces launched Operation Bringing Home the Goods, raiding a Jericho prison to capture the PFLP general secretary, Ahmad Sa'adat, and five other prisoners, all of whom had been charged with assassinating the Israeli tourist minister Rehavam Zeevi in 2001.[http://news.bbc.co.uk/1/hi/world/middle_east/4806714.stm Israel holds militant after siege] 14 March 2006 BBC News\n\nAfter Hamas assaulted a neighborhood in Gaza mostly populated by the Fatah-aligned Hilles clan, in response to their attack that killed six Hamas members, the Hilles clan was relocated to Jericho on 4 August 2008.[http://fr.jpost.com/servlet/Satellite?cid1215331192135&pagename\nJPost/JPArticle/ShowFull Jerusalem Post]  4 August 2008 IDF: Hilles clan won't boost terrorism Yaacov Katz And Khaled Abu Toameh\n\nIn 2009, Palestinian Authority Prime Minister Salam Fayyad and U.S. Assistant Secretary of State for International Narcotics and Law Enforcement Affairs David Johnson inaugurated the Presidential Guard Training Center in Jericho, a $9.1 million training facility for Palestinian Authority security forces built with U.S. funding.\n\nThe city's current mayor is Hassan Saleh, a former lawyer.\n\nGeography and climate\n\nJericho is located 258 m below sea level in an oasis in Wadi Qelt in the Jordan Valley, which makes it the lowest city in the world. The nearby spring of Ein es-Sultan produces 3.8 m3 (1,000 gallons) of water per minute, irrigating some 2500 acre through multiple channels and feeding into the Jordan River, 6 mi away.Ring et al., 1994, [https://books.google.com/books?idR44VRnNCzAYC&pg\nRA1-PA367&dqjericho+babylonian+ring&lr\n#vonepage&q\n&ffalse p. 367–370]. Annual rainfall is 204 mm, mostly concentrated in the winter months and into early spring. The average temperature is 11 C in January and 31 C in July.\n\nAccording to the Köppen climate classification, Jericho has a hot desert climate (BWh). Rich alluvial soil and abundant spring water have made Jericho an attractive place for settlement.\n\nDemographics\n\nIn the first census carried out by the Palestinian Central Bureau of Statistics (PCBS), in 1997, Jericho's population was 14,674. Palestinian refugees constituted a significant 43.6% of the residents or 6,393 people.[http://www.pcbs.gov.ps/Portals/_pcbs/phc_97/jer_t6.aspx Palestinian Population by Locality and Refugee Status]  Palestinian Central Bureau of Statistics (PCBS). The gender make-up of the city was 51% male and 49% female. Jericho has a young population, with nearly half (49.2%) of the inhabitants being under the age of 20. People between the ages of 20 and 44 made up 36.2% of the population, 10.7% between the ages of 45 and 64, and 3.6% were over the age of 64.[http://www.pcbs.gov.ps/Portals/_pcbs/phc_97/jer_t1.aspx Palestinian Population by Locality, Sex and Age Groups in Years]  (PCBS). In the 2007 census by the PCBS, Jericho had a population of 18,346.\n\nDemographics have varied widely depending on the dominant ethnic group and rule in the region over the past three thousand years. In a 1945 land and population survey by Sami Hadawi, 3,010 inhabitants is the figure given for Jericho, of which 94% (2840) were Arab and 6% (170) were Jews.Hadawi, 1970, [http://www.palestineremembered.com/download/VillageStatistics/Table%20I/Jerusalem/Page-057.jpg p.57]\nToday, the overwhelming majority of the population is Muslim. The Christian community makes up around 1% of the population. A large community of black Palestinians is present in Jericho.\n\nEconomy\n\nIn 1994, Israel and the Palestinians signed an economic accord that enabled Palestinians in Jericho to open banks, collect taxes and engage in export and import in preparation for self-rule.\n\nTourism\n\nIn 2010, Jericho, with its proximity to the Dead Sea, was declared the most popular destination among Palestinian tourists.\n\nIn 1998, a $150 million casino-hotel was built in Jericho with the backing of Yasser Arafat. The casino is now closed, though the hotel on the premises is open for guests.\n\nBiblical and Christian tourism\n\nChristian tourism is one of Jericho's primary sources of income. There are several major Christian pilgrimage sites in and around Jericho.\n* Mount of Temptation, topped by a Greek Orthodox monastery with panoramic views of the region. A cable car runs up to the monastery.\n* the Spring of Elisha, as the Ein es-Sultan spring is known to Jews and Christians\n* the Sycamore tree of Zacchaeus (two such trees are venerated at different locations as being related to the original tree mentioned in the Gospels)\n* the nearby traditional site of the baptism of Jesus at Qasr el-Yahud/Al-Maghtas on the Jordan River\n* the Monastery of Saint Gerasimos known as Deir Hajla; in the Jordan Valley near Jericho\n* the Saint George Monastery in Wadi Qelt above Jericho.\n\nArchaeological tourism\n\nThe archaeological sites in and near Jericho have a high potential for attracting tourists. These are dealt with in detail in the History and archaeology paragraph:\n* the Stone, Bronze and Iron Age cities at Tell es-Sultan\n* the Hasmonean and Herodian winter palaces at Tulul Abu el-'Alayiq\n* the Byzantine-period synagogues at Jericho (Shalom Al Yisrael Synagogue) and Na'aran\n* the Umayyad palace at Khirbet al-Mafjar known as Hisham's Palace\n* the Crusader sugar production facility at Tawahin es-Sukkar (lit. \"sugar mills\")\n* Nabi Musa, the Mamluk and Ottoman shrine dedicated to Moses (\"Prophet Musa\" to the Muslims)\n\nAgriculture\n\nAgriculture is another source of income, with banana groves ringing the city.\n\nThe Jericho Agro-Industrial Park is a public-private enterprise being developed in the Jericho area. Agricultural processing companies are being offered financial concessions to lease plots of land in the park in a bid to boost Jericho's economy.\n\nSchools and religious institutions\n\nIn 1925, Christian friars opened a school for 100 pupils that became the Terra Santa School. The city has 22 state schools and a number of private schools.\n\nHealth care\n\nIn April 2010, the United States Agency for International Development (USAID) held a groundbreaking ceremony for the renovation of the Jericho Governmental Hospital. USAID is providing $2.5 million in funding for this project.\n\nSports\n\nThe sports team Hilal Areeha plays association football in the West Bank First Division. They play home games in the 15,000 spectator Jericho International Stadium.\n\nTwin towns – sister cities\n\nJericho is twinned with:\n\n* Campinas in São Paulo, Brazil\n* Eger in Hungary(since 2013)\n* Alessandria in Alessandria, Piedmont, Italy (since 2004)\n* Pisa in Pisa, Tuscany, Italy (since 2000)\n* Lærdal in Norway(since 1998)\n* Iaşi in Romania\n* Kragujevac in Serbia\n* Calipatria, California in the USA\n\nNotable residents\n\n*Musa Alami",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jericho" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16082" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jericho (;  ';  ') is a city in the Palestinian Territories and is located near the Jordan River in the West Bank. It is the administrative seat of the Jericho Governorate, and is governed by the Fatah faction of the Palestinian National Authority. In 2007, it had a population of 18,346.[http://www.pcbs.gov.ps/Portals/_PCBS/Downloads/book1487.pdf#page\n109 2007 PCBS Census] . Palestinian Central Bureau of Statistics (PCBS). The city was occupied by Jordan from 1949 to 1967, and has been held under Israeli occupation since 1967; administrative control was handed over to the Palestinian Authority in 1994.[http://www.aljazeera.com/news/middleeast/2012/08/2012829184442780471.html Palestinian farmers ordered to leave lands] Al Jazeera. 29 August 2012 It is believed to be one of the oldest inhabited cities in the worldMurphy-O'Connor, 1998, p. 288.Freedman et al., 2000, p. 689–671. and the city with the oldest known protective wall in the world.Michal Strutin, Discovering Natural Israel (2001), p. 4. It was thought to have the oldest stone tower in the world as well, but excavations at Tell Qaramel in Syria have discovered stone towers that are even older.\n\nArchaeologists have unearthed the remains of more than 20 successive settlements in Jericho, the first of which dates back 11,000 years (9000 BC), almost to the very beginning of the Holocene epoch of the Earth's history.\n\nCopious springs in and around the city have attracted human habitation for thousands of years.Bromiley, 1995, p. 715 Jericho is described in the Hebrew Bible as the \"City of Palm Trees\".\n\nEtymology\n\nJericho's name in Hebrew, , is generally thought to derive from the Canaanite word reaẖ (\"fragrant\"), but other theories hold that it originates in the Canaanite word for \"moon\" (Yareaẖ) or the name of the lunar deity Yarikh for whom the city was an early centre of worship.\n\nJericho's Arabic name, , means \"fragrant\" and also has its roots in Canaanite Reaẖ.Schreiber, 2003, p. 141.Bromiley, 1995, p. 1136.\n\nHistory and archaeology\n\nHistory of excavations\n\nThe first excavations of the site were made by Charles Warren in 1868. Ernst Sellin and Carl Watzinger excavated Tell es-Sultan and Tulul Abu el-'Alayiq between 1907–1909 and in 1911, and John Garstang excavated between 1930 and 1936. Extensive investigations using more modern techniques were made by Kathleen Kenyon between 1952 and 1958. Lorenzo Nigro and Nicolò Marchetti conducted excavations in 1997–2000. Since 2009 the Italian-Palestinian archaeological project of excavation and restoration was resumed by Rome \"La Sapienza\" University and Palestinian MOTA-DACH under the direction of Lorenzo Nigro and Hamdan Taha, and Jehad Yasine since 2015 (www.lasapienzatojericho.it). The Italian-Palestinian Expedition carried out 13 seasons in 20 years (1997–2017), with some major discoveries, like Tower A1 in the Middle Bronze Age southern Lower Town and Palace G on the eastern flanks of the Spring Hill overlooking the Spring of 'Ain es-Sultan dating from Early Bronze III.\n\nStone Age: Tell es-Sultan and its spring\n\nThe earliest settlement was located at the present-day Tell es-Sultan (or Sultan's Hill), a couple of kilometers from the current city. In both Arabic and Hebrew, tell means \"mound\" - consecutive layers of habitation built up a mound over time, as is common for ancient settlements in the Middle East and Anatolia. Jericho is the type site for the Pre-Pottery Neolithic A (PPNA) and Pre-Pottery Neolithic B (PPNB) periods.\n\nNatufian hunter-gatherers,  10,000 BC\n\nEpipaleolithic construction at the site appears to predate the invention of agriculture, with the construction of Natufian culture structures beginning earlier than 9000 BC, the very beginning of the Holocene epoch in geologic history.\n\nJericho has evidence of settlement dating back to 10,000 BC. During the Younger Dryas period of cold and drought, permanent habitation of any one location was impossible. However, the Ein es-Sultan spring at what would become Jericho was a popular camping ground for Natufian hunter-gatherer groups, who left a scattering of crescent-shaped microlith tools behind them. Around 9600 BC, the droughts and cold of the Younger Dryas stadial had come to an end, making it possible for Natufian groups to extend the duration of their stay, eventually leading to year-round habitation and permanent settlement.\n\nPre-Pottery Neolithic,  9500 BC\n\nPre-Pottery Neolithic A (PPNA)\n\nThe first permanent settlement on the site of Jericho developed near the Ein es-Sultan spring between 9,500 and 9000 BC. As the world warmed up, a new culture based on agriculture and sedentary dwelling emerged, which archaeologists have termed \"Pre-Pottery Neolithic A\" (abbreviated as PPNA). PPNA villages are characterized by small circular dwellings, burial of the dead under the floor of buildings, reliance on hunting wild game, the cultivation of wild or domestic cereals, and no use of pottery yet. At Jericho, circular dwellings were built of clay and straw bricks left to dry in the sun, which were plastered together with a mud mortar. Each house measured about 5 m across, and was roofed with mud-smeared brush. Hearths were located within and outside the homes.\n\nBy about 9400 BC, the town had grown to more than 70 modest dwellings.\n\nThe Pre-Pottery Neolithic A phase at Tell es-Sultan (c. 8350–7370 BC) is sometimes called Sultanian. The site is a 40000 m2 settlement surrounded by a massive stone wall over  high and  wide at the base (see Wall of Jericho), inside of which stood a stone tower (see Tower of Jericho), over  high, containing an internal staircase with 22 stone steps and placed in the centre of the west side of the tell.Ran Barkai and Roy Liran. \"Midsummer Sunset at Neolithic Jericho\". In Time and Mind: The Journal of Archaeology, Consciousness and Culture, Volume 1—Issue 3, November 2008, p. 279. DOI 10.2752/175169708X329345 This tower and the even older ones excavated at Tell Qaramel in Syria are the oldest ever to be discovered. The wall may have served as a defence against flood-water, with the tower used for ceremonial purposes. The wall and tower were built during the Pre-Pottery Neolithic A (PPNA) period around 8000 BCE.[http://www.jpost.com/VideoArticles/Video/Article.aspx?id208206 O'Sullivan, Arieh., World’s first skyscraper sought to intimidate masses, Jerusalem Post, 14 February 2011] For the tower, carbon dates published in 1981 and 1983 indicate that it was built around 8300 BC and stayed in use until c. 7800 BC. The wall and tower would have taken a hundred men more than a hundred days to construct, thus suggesting some kind of social organization. The town contained round mud-brick houses, yet no street planning. The identity and number of the inhabitants of Jericho during the PPNA period is still under debate, with estimates going as high as 2,000–3,000, and as low as 200–300. It is known that this population had domesticated emmer wheat, barley and pulses and hunted wild animals.\n\nPre-Pottery Neolithic B (PPNB)\n\nPre-Pottery Neolithic B, 7220 to 5850 BC (but carbon-14-dates are few and early). Expanded range of domesticated plants. Possible domestication of sheep. Apparent cult involving the preservation of human skulls, with facial features reconstructed from plaster and eyes set with shells in some cases.\n\nAfter a few centuries, the first settlement was abandoned. After the PPNA settlement phase, there was a settlement hiatus of several centuries, then the PPNB settlement was founded on the eroded surface of the tell. This second settlement, established in 6800 BC, perhaps represents the work of an invading people who absorbed the original inhabitants into their dominant culture. Artifacts dating from this period include ten plastered human skulls, painted so as to reconstitute the individuals' features. These represent either teraphim or the first example of portraiture in art history, and it is thought that they were kept in people's homes while the bodies were buried.Janson and Janson, 2003.\n\nThe architecture consisted of rectilinear buildings made of mudbricks on stone foundations. The mudbricks were loaf-shaped with deep thumb prints to facilitate bounding. No building has been excavated in its entirety. Normally, several rooms cluster around a central courtyard. There is one big room ( and 7 x) with internal divisions, the rest are small, presumably used for storage. The rooms have red or pinkish terrazzo-floors made of lime. Some impressions of mats made of reeds or rushes have been preserved. The courtyards have clay floors.\n\nKathleen Kenyon interpreted one building as a shrine. It contained a niche in the wall. A chipped pillar of volcanic stone that was found nearby might have fitted into this niche.\n\nThe dead were buried under the floors or in the rubble fill of abandoned buildings. There are several collective burials. Not all the skeletons are completely articulated, which may point to a time of exposure before burial. A skull cache contained seven skulls. The jaws were removed and the faces covered with plaster; cowries were used as eyes. A total of ten skulls were found. Modelled skulls were found in Tell Ramad and Beisamoun as well.\n\nOther finds included flints, such as arrowheads (tanged or side-notched), finely denticulated sickle-blades, burins, scrapers, a few tranchet axes, obsidian, and green obsidian from an unknown source. There were also querns, hammerstones, and a few ground-stone axes made of greenstone. Other items discovered included dishes and bowls carved from soft limestone, spindle whorls made of stone and possible loom weights, spatulae and drills, stylised anthropomorphic plaster figures, almost life-size, anthropomorphic and theriomorphic clay figurines, as well as shell and malachite beads.\n\nIn the late 4th millennium BC, Jericho was occupied during Neolithic 2 and the general character of the remains on the site link it culturally with Neolithic 2 (or PPNB) sites in the West Syrian and Middle Euphrates groups. This link is established by the presence of rectilinear mud-brick buildings and plaster floors that are characteristic of the age.\n\nBronze Age\n\nA succession of settlements followed from 4500 BC onward, the largest constructed in 2600 BC.\n\nJericho was continually occupied into the Middle Bronze Age; it was destroyed in the Late Bronze, after which it no longer served as an urban centre. The city was surrounded by extensive defensive walls strengthened with rectangular towers, and possessed an extensive cemetery with vertical shaft-tombs and underground burial chambers; the elaborate funeral offerings in some of these may reflect the emergence of local kings.\n\nDuring the Middle Bronze Age, Jericho was a small prominent city of the Canaan region, reaching its greatest Bronze Age extent in the period from 1700 to 1550 BC. It seems to have reflected the greater urbanization in the area at that time, and has been linked to the rise of the Maryannu, a class of chariot-using aristocrats linked to the rise of the Mitannite state to the north. Kathleen Kenyon reported \"the Middle Bronze Age is perhaps the most prosperous in the whole history of Kna'an. ... The defenses ... belong to a fairly advanced date in that period\" and there was \"a massive stone revetment ... part of a complex system\" of defenses (pp. 213–218).Kenyon, Kathleen \"Digging up Jericho\"(London, 1957) Bronze Age Jericho fell in the 16th century at the end of the Middle Bronze Age, the calibrated carbon remains from its City-IV destruction layer dating to 1617–1530 BC. Notably this carbon dating  1573 BC confirmed the accuracy of the stratigraphical dating  1550 by Kenyon.\n\nThere was evidence of a small settlement in the Late Bronze Age (c. 1400s BC) on the site, but erosion and destruction from previous excavations have erased significant parts of this layer.\n\nIron Age\n\nTell es-Sultan remained unoccupied from the end of the 15th to the 10th–9th centuries BC, when the city was rebuilt. Of this new city not much more remains than a four-room house on the eastern slope. By the 7th century, Jericho had become an extensive town, but this settlement was destroyed in the Babylonian conquest of Judah in the late 6th century.\n\nPersian and Early Hellenistic periods\n\nAfter the destruction of the Judahite city by the Babylonians in the late 6th century, whatever was rebuilt in the Persian period as part of the Restoration after the Babylonian captivity, left only very few remains. The tell was abandoned as a place of settlement not long after this period. During the Persian through Hellenistic periods, there is little in terms of occupation attested throughout the region.\n\nJericho went from being an administrative centre of Yehud Medinata (\"the Province of Judah\") under Persian rule to serving as the private estate of Alexander the Great between 336 and 323 BC after his conquest of the region. In the middle of the 2nd century BC Jericho was under Hellenistic rule of the Seleucid Empire, when the Syrian General Bacchides built a number of forts to strengthen the defences of the area around Jericho against the revolt by the Macabees.1 Maccabees 9:50 One of these forts, built at the entrance to Wadi Qelt, was later refortified by Herod the Great, who named it Kypros after his mother.Murphy-O'Connor, 1998, pp. 289–291.\n\nHasmonean and Herodian periods\n\nAfter the abandonment of the Tell es-Sultan location, the new Jericho of the Late Hellenistic or Hasmonean and Early Roman or Herodian periods, was established as a garden city in the vicinity of the royal estate at Tulul Abu el-'Alayiq and expanded greatly thanks to the intensive exploitation of the springs of the area. The new site consists of a group of low mounds on both banks of Wadi Qelt. The Hasmoneans were a dynasty descending from a priestly group (kohanim) from the tribe of Levi, who ruled over Judea following the success of the Maccabean Revolt until Roman influence over the region brought Herod to claim the Hasmonean throne.Magnusson, Magnus (1977). Archaeology of the Bible. New York: Simon and Schuster. p. 219. .\n\nThe rock-cut tombs of a Herodian- and Hasmonean-era cemetery lie in the lowest part of the cliffs between Nuseib al-Aweishireh and Jabal Quruntul in Jericho and were used between 100 BC and 68 CE.\n\nHerodian period\n\nHerod had to lease back the royal estate at Jericho from Cleopatra, after Mark Antony had given it to her as a gift. After their joint suicide in 30 BC, Octavian assumed control of the Roman Empire and granted Herod absolute rule over Jericho, as part of the new Herodian domain. Herod's rule oversaw the construction of a hippodrome-theatre (Tell es-Samrat) to entertain his guests and new aqueducts to irrigate the area below the cliffs and reach his winter palaces built at the site of Tulul Abu el-Alaiq (also written Alayiq). In 2008 the Israel Exploration Society published an illustrated volume of Herod's third Jericho palace.Silvia Rozenberg; Ehud Netzer (2008). Hasmonean and Herodian palaces at Jericho: final reports of the 1973–1987 excavations. 4, \"The decoration of Herod's third palace at Jericho\". Jerusalem: Israel Exploration Society: Institute of Archaeology, The Hebrew University of Jerusalem. . [https://www.worldcat.org/title/hasmonean-and-herodian-palaces-at-jericho-final-reports-of-the-1973-1987-excavations-4-the-decoration-of-herods-third-palace-at-jericho/oclc/758612875?ht\nedition&referer=di WorldCat website]\n\nThe dramatic murder of Aristobulus III in a swimming pool at the winter palaces near Jericho, as described by the Roman Jewish historian Josephus, took place during a banquet organized by Herod's Hasmonean mother-in-law. After the construction of the palaces, the city had functioned not only as an agricultural center and as a crossroad, but also as a winter resort for Jerusalem's aristocracy.[http://www.christusrex.org/www1/ofm/mad/discussion/012discuss.html Jericho - (Ariha)] Studium Biblicum Franciscum - Jerusalem.\n\nHerod was succeeded in Judea by his son, Herod Archelaus, who built a village in his name not far to the north, Archelaïs (modern Khirbet al-Beiyudat), to house workers for his date plantation.\n\nFirst-century Jericho is described in Strabo's Geography as follows:\n\nIn the New Testament\n\nThe Christian Gospels state that Jesus of Nazareth passed through Jericho where he healed blind beggars (), and inspired a local chief tax-collector named Zacchaeus to repent of his dishonest practices (). The road between Jerusalem and Jericho is the setting for the Parable of the Good Samaritan.\n\nJohn Wesley, in his New Testament Notes on this section of Luke's Gospel, claimed that \"about twelve thousand priests and Levites dwelt there, who all attended the service of the temple\".Wesley, J., [http://wesley.nnu.edu/john-wesley/john-wesleys-notes-on-the-bible/notes-on-the-gospel-according-to-st-luke/#Chapter+X Notes on The Gospel According to St Luke]\n\nSmith's Bible Names Dictionary suggests that on the arrival of Jesus and his entourage, \"Jericho was once more 'a city of palms' when our Lord visited it. Here he restored sight to the blind (Matthew 20:30; Mark 10:46; Luke 18:35). Here the descendant of Rahab did not disdain the hospitality of Zaccaeus the publican. Finally, between Jerusalem and Jericho was laid the scene of his story of the good Samaritan.\"[https://www.biblegateway.com/resources/smiths-bible-names-dictionary/Jericho Smith's Bible Names Dictionary: Jericho], accessed 6 February 2017\n\nRoman province\n\nAfter the fall of Jerusalem to Vespasian's armies in the Great Revolt of Judea in 70 AD, Jericho declined rapidly, and by 100 AD it was but a small Roman garrison town. A fort was built there in 130 and played a role in putting down the Bar Kochba revolt in 133.\n\nByzantine period\n\nAccounts of Jericho by a Christian pilgrim are given in 333. Shortly thereafter the built-up area of the town was abandoned and a Byzantine Jericho, Ericha, was built 1600 metres (1 mi) to the east, on which the modern town is centered.Losch, 2005, p. 117–118. Christianity took hold in the city during the Byzantine era and the area was heavily populated. A number of monasteries and churches were built, including St George of Koziba in 340 AD and a domed church dedicated to Saint Eliseus. At least two synagogues were also built in the 6th century AD. The monasteries were abandoned after the Persian invasion of 614.\n\nThe Jericho Synagogue in the Royal Maccabean winter palace at Jericho dates from 70–50 BC.\n\nA synagogue dating to the late 6th or early 7th century AD was discovered in Jericho in 1936, and was named Shalom Al Yisrael Synagogue, or \"peace unto Israel\", after the central Hebrew motto in its mosaic floor. It was controlled by Israel after the Six Day War, but after the handover to Palestinian Authority control per the Oslo Accords, it has been a source of conflict. On the night of 12 October 2000, the synagogue was vandalized by Palestinians who burned holy books and relics and damaged the mosaic.\n\nThe Na'aran synagogue, another Byzantine era construction, was discovered on the northern outskirts of Jericho in 1918. While less is known of it than Shalom Al Yisrael, it has a larger mosaic and is in similar condition.\n\nEarly Muslim period\n\nJericho, by then named \"Ariha\" in Arabic variation, became part of Jund Filastin (\"Military District of Palestine\"), part of the larger province of Bilad al-Sham. The Arab Muslim historian Musa b. 'Uqba (d. 758) recorded that caliph Umar ibn al-Khattab exiled the Jews and Christians of Khaybar to Jericho (and Tayma).Several hadith collections: e.g. Bukhari, Sahih as translated Muḥammad Muḥsin Khân, The Translation of the Meanings of Sahih al-Bukhari (India: Kitab Bhavan, 1987) 3.39.531 and 4.53.380, and Muslim Sahih trans. Abdul Hamid Siddiqui (Lahore: Kazi Publications, 1976) 10.3763.\n\nBy 659, that district had come under the control of Mu'awiya, founder of the Umayyad dynasty. That year, an earthquake destroyed Jericho.The Maronite Chronicle, written during Mu'awiya's caliphate. Note that for propaganda reasons it dates the earthquake to the wrong year: Andrew Palmer, The Seventh Century in the West-Syrian Chronicles (Liverpool: Liverpool University Press, 1993), 30, 31, 32. A decade later, the pilgrim Arculf visited Jericho and found it in ruins, all its \"miserable Canaanite\" inhabitants now dispersed in shanty towns around the Dead Sea shore.\"The Pilgrimage of Arculf in the Holy Land\", De Locis Sanctis as translated by Rev. James Rose MacPherson (W. London: BD. 24, Hanover Square, 1895), ch. I.11.\n\nA palatial complex long attributed to the tenth Umayyad caliph, Hisham ibn Abd al-Malik (r. 724–743) and thus known as Hisham's Palace, is located at Khirbet al-Mafjar, about 1.5 kilometres (1 mi) north of Tell es-Sultan. This \"desert castle\" or qasr was more likely built by Caliph Walid ibn Yazid (r. 743–744), who was assassinated before he could complete the construction.Jerome Murphy-O’Connor, The Holy Land: An Oxford Archaeological Guide from Earliest Times to 1700, Oxford University Press 2008, pp. 342–344. The remains of two mosques, a courtyard, mosaics, and other items can still be seen in situ today. The unfinished structure was largely destroyed in an earthquake in 747.\n \nUmayyad rule ended in 750 and was followed by the Arab caliphates of the Abbasid and Fatimid dynasties. Irrigated agriculture was developed under Islamic rule, reaffirming Jericho's reputation as a fertile \"City of the Palms\".Shahin, 2005, p. 285. Al-Maqdisi, the Arab geographer, wrote in 985 that \"the water of Jericho is held to be the highest and best in all Islam. Bananas are plentiful, also dates and flowers of fragrant odor\".Shahin, 2005, p. 283. Jericho is also referred to by him as one of the principal cities of Jund Filastin.al-Muqaddasi quoted in Le Strange, 1890, p. [https://archive.org/stream/palestineundermo00lestuoft#page/39/mode/1up 39]\n\nThe city flourished until 1071 with the invasion of the Seljuk Turks, followed by the upheavals of the Crusades.\n\nCrusader period\n\nIn 1179, the Crusaders rebuilt the Monastery of St. George of Koziba, at its original site 10 kilometres (6 mi) from the center of town. They also built another two churches and a monastery dedicated to John the Baptist, and are credited with introducing sugarcane production to the city.Hull, 1855. The site of Tawahin es-Sukkar (lit. \"sugar mills\") holds remains of a Crusader sugar production facility. In 1187, the Crusaders were evicted by the Ayyubid forces of Saladin after their victory in the Battle of Hattin, and the town slowly went into decline.\n\nAyyubid and Mamluk periods\n\nIn 1226, Arab geographer Yaqut al-Hamawi said of Jericho, \"it has many palm trees, also sugarcane in quantities, and bananas. The best of all the sugar in the Ghaur land is made here.\" In the 14th century, Abu al-Fida writes there are sulfur mines in Jericho, \"the only ones in Palestine\".al-Hamawi and Abu-l Fida quoted in Le Strange, 1890, p. [https://archive.org/stream/palestineundermo00lestuoft#page/397/mode/1up 397]\n\nOttoman period\n\nJericho  was incorporated into the Ottoman Empire in 1517 with all of Palestine, and in 1545 a revenue of 19,000 Akçe was recorded, destined for the new Waqf  for the Haseki Sultan Imaret of Jerusalem.Singer, 2002, pp. [https://books.google.com/books?id\nzHBHBTNwBQoC&pgPA50  50], [https://books.google.com/books?id\nzHBHBTNwBQoC&pgPA52  52] The villagers processed indigo as one source of revenue, using a cauldron specifically for this purpose that was loaned to them by the Ottoman authorities in Jerusalem.Singer, 2002, p. [https://books.google.com/books?idzHBHBTNwBQoC&pg\nPA120  120] Later that century, the Jericho revenues no longer went to the Haseki Sultan Imaret.Singer, 2002, p. [https://books.google.com/books?id\nzHBHBTNwBQoC&pg=PA126  126]\n\nIn 1596 Jericho  appeared in the  tax registers  under the name of Riha,  being in the nahiya of Al-Quds in the liwa of Al-Quds. It had a population of 51 household, all Muslims. They paid a fixed  tax-rate of 33,3 % on agricultural products, including wheat, barley, summer crops,  vineyards and fruit trees,  goats and beehives, water buffaloes, in addition to occasional revenues; a total of 40,000 Akçe. All of the revenue still  went to a Waqf.Hütteroth and Abdulfattah, 1977, p. 114 \n\nThe French traveler Laurent d'Arvieux described the city in 1659 as \"now desolate, and consists only of about fifty poor houses, in bad condition ... The plain around is extremely fertile; the soil is middling fat; but it is watered by several rivulets, which flow into the Jordan. Notwithstanding these advantages only the gardens adjacent to the town are cultivated.\"Graham, 1836, p. [https://archive.org/stream/bub_gb_0ZYCAAAAQAAJ#page/n136/mode/1up 122] \n\nIn the 19th century, European scholars, archaeologists and missionaries visited often. At the time it was an oasis in a poor state, similar to other regions in the plains and deserts.Ben-Arieh, Yehoshua. [http://www.ybz.org.il/_Uploads/dbsAttachedFiles/Article_36.8.pdf \"The Sanjak of Jerusalem in the 1870s\"]. In Cathedra, 36. Jerusalem: Yad Yitzhak Ben Zvi. 1985. pp. 80–82 Edward Robinson (1838) reported 50 families, which were about 200 people,Robinson and Smith, 1841, vol. 2, p.  [https://archive.org/stream/biblicalresearc00smitgoog#page/n302/mode/1up   280] Titus Tobler (1854) reported some 30 poor huts, whose residents paid a total of 3611 Kuruş in tax.Titus Tobler, Topographie von Jerusalem und seinen Umgebungen, Berlin, 1853–1854, p. 642 Abraham Samuel Hershberg also reported some 30 poor huts and 300 residents.A.s. Hershberg, In the Land of the East, Vilna 1899, p. 469 At that time, Jericho was the residence of the region's Turkish governor. The main water sources for the village were a spring called Ein al-Sultan in Arabic and Elisha Spring in Hebrew, and springs in Wadi Qelt.\n\nAn Ottoman  village list from around 1870 showed that  Riha, Jericho,  had 36 houses and a population of 105, though the population count included men, only.Socin, 1879, p. [https://archive.org/stream/zeitschriftdesde01deut#page/159/mode/1up 159]Hartmann, 1883, p. [https://archive.org/stream/bub_gb_BZobAQAAIAAJ#page/n932/mode/1up  124],  noted  34 houses   \n\nThe first excavation at Tell es-Sultan was carried out in 1867, and the monasteries of St. George of Koziba and John the Baptist were refounded and completed in 1901 and 1904, respectively.\n\nBritish Mandate period\n\nDuring World War II The British built fortresses in Jericho with the help of the Jewish company Solel Boneh, and bridges were rigged with explosives in preparation for a possible invasion by German allied forces.Friling and Cummings, 2005, p. 65.  After the collapse of the Ottoman Empire at the end of World War I, Jericho came under the rule of the Mandatory Palestine. \n\nAccording to the 1922 census of Palestine, Jericho had 1,029 inhabitants, consisting of 931 Muslims, 6 Jews and 92 Christians;Barron, 1923,  Table VII, Sub-district of Jericho, p. [https://archive.org/stream/PalestineCensus1922/Palestine%20Census%20%281922%29#page/n21/mode/1up  19] where the Christians were 45 Orthodox, 12 Roman Catholics, 13 Greek Catholics (Melchites), 6 Syrian Catholic, 11 Armenians, 4 Copts and 1 Church of England.Barron, 1923,  Table XIV,  p. [https://archive.org/stream/PalestineCensus1922/Palestine%20Census%20%281922%29#page/n47/mode/1up  45] \n\nIn 1927, an earthquake struck and affected Jericho and other cities. Around 300 people died,  but by the  1931 census the population had increased to 1,693 inhabitants, in 347 houses.Mills, 1932, p.[https://archive.org/details/CensusOfPalestine1931.PopulationOfVillagesTownsAndAdministrativeAreas   45] \n\nIn   1945, the Jericho's population was 3,010; 2,570 Muslims, 170 Jews, 260 Christians and 10 classified as \"other\",Department of Statistics, 1945, p. [http://users.cecs.anu.edu.au/~bdm/yabber/census/VSpages/VS1945_p24.jpg 24] and it had jurisdiction over 37,481 dunams of land.Government of Palestine, Department of Statistics. Village Statistics, April, 1945. Quoted in  Hadawi, 1970, p. [http://www.palestineremembered.com/download/VillageStatistics/Table%20I/Jerusalem/Page-057.jpg 57] Of this, 948 dunams were used for citrus and bananas, 5,873 dunams were for plantations and irrigable land,  9,141 for cereals,Government of Palestine, Department of Statistics. Village Statistics, April, 1945. Quoted in  Hadawi, 1970, p. [http://www.palestineremembered.com/download/VillageStatistics/Table%20II/Jerusalem/Page-102.jpg  102] while a total of 38 dunams were urban, built-up areas.Government of Palestine, Department of Statistics. Village Statistics, April, 1945. Quoted in  Hadawi,  1970, p. [http://www.palestineremembered.com/download/VillageStatistics/Table%20III/Jerusalem/Page-153.jpg  153]\n\nJordanian period\n\nJericho came under Jordanian control after the 1948 Arab–Israeli War. The Jericho Conference, organized by King Abdullah and attended by over 2,000 Palestinian delegates in 1948 proclaimed \"His Majesty Abdullah as King of all Palestine\" and called for \"the unification of Palestine and Transjordan as a step toward full Arab unity\". In mid-1950, Jordan formally annexed the West Bank and Jericho residents, like other residents of West Bank localities became Jordanian citizens.Benvenisti, 1998, pp. 27-28.\n\nIn 1961, the population of Jericho was  10,166,Government of Jordan, 1964, p. [http://users.cecs.anu.edu.au/~bdm/yabber/census/JordanCensusPages/JordanCensus1961-p13.pdf 13] of whom 935 were Christian, the rest Muslim.Government of Jordan, Department of Statistics, 1964, pp. [http://users.cecs.anu.edu.au/~bdm/yabber/census/JordanCensusPages/JordanCensus1961-pp115-116.pdf 115-116]\n\n1967, aftermath\n\nJericho has been occupied by Israel since the Six-Day War of 1967 along with the rest of the West Bank. It was the first city handed over to Palestinian Authority control in accordance with the Oslo Accords. The limited Palestinian self-rule of Jericho was agreed on in the Gaza–Jericho Agreement of 4 May 1994. Part of the agreement was a \"Protocol on Economic Relations\", signed on 29 April 1994. The city is in an enclave of the Jordan Valley that is in Area A of the West Bank, while the surrounding area is designated as being in Area C under full Israeli military control. Four roadblocks encircle the enclave, restricting Jericho's Palestinian population's movement through the West Bank.\n\nIn response to the 2001 Second Intifada and suicide bombings, Jericho was re-occupied by Israeli troops. A 2 m deep trench was built around a large part of the city to control Palestinian traffic to and from Jericho.ARIJ & LRC, 20 March 2001, [http://www.poica.org/editor/case_studies/view.php?recordID=138 The Tightening of the Siege on Jericho: Israel Employs a New Policy of Trench Digging] \n\nOn 14 March 2006, the Israel Defense Forces launched Operation Bringing Home the Goods, raiding a Jericho prison to capture the PFLP general secretary, Ahmad Sa'adat, and five other prisoners, all of whom had been charged with assassinating the Israeli tourist minister Rehavam Zeevi in 2001.[http://news.bbc.co.uk/1/hi/world/middle_east/4806714.stm Israel holds militant after siege] 14 March 2006 BBC News\n\nAfter Hamas assaulted a neighborhood in Gaza mostly populated by the Fatah-aligned Hilles clan, in response to their attack that killed six Hamas members, the Hilles clan was relocated to Jericho on 4 August 2008.[http://fr.jpost.com/servlet/Satellite?cid1215331192135&pagename\nJPost/JPArticle/ShowFull Jerusalem Post]  4 August 2008 IDF: Hilles clan won't boost terrorism Yaacov Katz And Khaled Abu Toameh\n\nIn 2009, Palestinian Authority Prime Minister Salam Fayyad and U.S. Assistant Secretary of State for International Narcotics and Law Enforcement Affairs David Johnson inaugurated the Presidential Guard Training Center in Jericho, a $9.1 million training facility for Palestinian Authority security forces built with U.S. funding.\n\nThe city's current mayor is Hassan Saleh, a former lawyer.\n\nGeography and climate\n\nJericho is located 258 m below sea level in an oasis in Wadi Qelt in the Jordan Valley, which makes it the lowest city in the world. The nearby spring of Ein es-Sultan produces 3.8 m3 (1,000 gallons) of water per minute, irrigating some 2500 acre through multiple channels and feeding into the Jordan River, 6 mi away.Ring et al., 1994, [https://books.google.com/books?idR44VRnNCzAYC&pg\nRA1-PA367&dqjericho+babylonian+ring&lr\n#vonepage&q\n&ffalse p. 367–370]. Annual rainfall is 204 mm, mostly concentrated in the winter months and into early spring. The average temperature is 11 C in January and 31 C in July.\n\nAccording to the Köppen climate classification, Jericho has a hot desert climate (BWh). Rich alluvial soil and abundant spring water have made Jericho an attractive place for settlement.\n\nDemographics\n\nIn the first census carried out by the Palestinian Central Bureau of Statistics (PCBS), in 1997, Jericho's population was 14,674. Palestinian refugees constituted a significant 43.6% of the residents or 6,393 people.[http://www.pcbs.gov.ps/Portals/_pcbs/phc_97/jer_t6.aspx Palestinian Population by Locality and Refugee Status]  Palestinian Central Bureau of Statistics (PCBS). The gender make-up of the city was 51% male and 49% female. Jericho has a young population, with nearly half (49.2%) of the inhabitants being under the age of 20. People between the ages of 20 and 44 made up 36.2% of the population, 10.7% between the ages of 45 and 64, and 3.6% were over the age of 64.[http://www.pcbs.gov.ps/Portals/_pcbs/phc_97/jer_t1.aspx Palestinian Population by Locality, Sex and Age Groups in Years]  (PCBS). In the 2007 census by the PCBS, Jericho had a population of 18,346.\n\nDemographics have varied widely depending on the dominant ethnic group and rule in the region over the past three thousand years. In a 1945 land and population survey by Sami Hadawi, 3,010 inhabitants is the figure given for Jericho, of which 94% (2840) were Arab and 6% (170) were Jews.Hadawi, 1970, [http://www.palestineremembered.com/download/VillageStatistics/Table%20I/Jerusalem/Page-057.jpg p.57]\nToday, the overwhelming majority of the population is Muslim. The Christian community makes up around 1% of the population. A large community of black Palestinians is present in Jericho.\n\nEconomy\n\nIn 1994, Israel and the Palestinians signed an economic accord that enabled Palestinians in Jericho to open banks, collect taxes and engage in export and import in preparation for self-rule.\n\nTourism\n\nIn 2010, Jericho, with its proximity to the Dead Sea, was declared the most popular destination among Palestinian tourists.\n\nIn 1998, a $150 million casino-hotel was built in Jericho with the backing of Yasser Arafat. The casino is now closed, though the hotel on the premises is open for guests.\n\nBiblical and Christian tourism\n\nChristian tourism is one of Jericho's primary sources of income. There are several major Christian pilgrimage sites in and around Jericho.\n* Mount of Temptation, topped by a Greek Orthodox monastery with panoramic views of the region. A cable car runs up to the monastery.\n* the Spring of Elisha, as the Ein es-Sultan spring is known to Jews and Christians\n* the Sycamore tree of Zacchaeus (two such trees are venerated at different locations as being related to the original tree mentioned in the Gospels)\n* the nearby traditional site of the baptism of Jesus at Qasr el-Yahud/Al-Maghtas on the Jordan River\n* the Monastery of Saint Gerasimos known as Deir Hajla; in the Jordan Valley near Jericho\n* the Saint George Monastery in Wadi Qelt above Jericho.\n\nArchaeological tourism\n\nThe archaeological sites in and near Jericho have a high potential for attracting tourists. These are dealt with in detail in the History and archaeology paragraph:\n* the Stone, Bronze and Iron Age cities at Tell es-Sultan\n* the Hasmonean and Herodian winter palaces at Tulul Abu el-'Alayiq\n* the Byzantine-period synagogues at Jericho (Shalom Al Yisrael Synagogue) and Na'aran\n* the Umayyad palace at Khirbet al-Mafjar known as Hisham's Palace\n* the Crusader sugar production facility at Tawahin es-Sukkar (lit. \"sugar mills\")\n* Nabi Musa, the Mamluk and Ottoman shrine dedicated to Moses (\"Prophet Musa\" to the Muslims)\n\nAgriculture\n\nAgriculture is another source of income, with banana groves ringing the city.\n\nThe Jericho Agro-Industrial Park is a public-private enterprise being developed in the Jericho area. Agricultural processing companies are being offered financial concessions to lease plots of land in the park in a bid to boost Jericho's economy.\n\nSchools and religious institutions\n\nIn 1925, Christian friars opened a school for 100 pupils that became the Terra Santa School. The city has 22 state schools and a number of private schools.\n\nHealth care\n\nIn April 2010, the United States Agency for International Development (USAID) held a groundbreaking ceremony for the renovation of the Jericho Governmental Hospital. USAID is providing $2.5 million in funding for this project.\n\nSports\n\nThe sports team Hilal Areeha plays association football in the West Bank First Division. They play home games in the 15,000 spectator Jericho International Stadium.\n\nTwin towns – sister cities\n\nJericho is twinned with:\n\n* Campinas in São Paulo, Brazil\n* Eger in Hungary(since 2013)\n* Alessandria in Alessandria, Piedmont, Italy (since 2004)\n* Pisa in Pisa, Tuscany, Italy (since 2000)\n* Lærdal in Norway(since 1998)\n* Iaşi in Romania\n* Kragujevac in Serbia\n* Calipatria, California in the USA\n\nNotable residents\n\n*Musa Alami. Jericho. http://en.wikipedia.org/?curid=16082."
  }
}
