{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1652",
  "eid" : "bb2d0920-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778393778,
  "textBody" : "Alyattes reigned as king of Lydia from c. 610 BC to 560 BC. He belonged to the house of the Mermnadae, was the son of king Sadyattes and father of king Croesus. Under Alyattes, the kingdom of Lydia entered its period of greatest prosperity and power. \n\nLife \n\nFor several years he continued the war against the Greek colony of Miletus begun by his father, but was obliged to turn his attention towards the Medes and Babylonians. On May 28, 585 BC, during the Battle of Halys fought against Cyaxares, king of Media, a solar eclipse took place; hostilities were suspended, peace concluded, and the Halys River was fixed as the boundary between the two kingdoms.\n\nAlyattes drove the Cimmerians from Asia Minor,Herodotus, 1.16; Sergei R. Tokhtas’ev \"Cimmerians\" in the Encyclopedia Iranica (1991), several nineteenth-century summaries. with the help of war dogs.Polyaenus, 7.2 He further subdued the Carians, and took several Ionian cities, including Smyrna and Colophon. Smyrna was sacked and destroyed with its inhabitants forced to move into the countryside.\n\nHe standardised the weight of coins (1 stater = 168 grains of wheat). The coins were produced using an anvil die technique and stamped with a lion's head, the symbol of the Mermnadae.\n\nHe was succeeded by his son Croesus. His daughter Aryenis of Lydia was queen consort of Astyages, King of Media.\n\nTomb \n\nAlyattes' tomb still exists on the plateau between Lake Gygaea and the river Hermus to the north of the Lydian capital Sardis—a large mound of earth with a substructure of huge stones.  It was excavated by Spiegelthal in 1854, who found that it covered a large vault of finely cut marble blocks approached by a flat-roofed passage of the same stone from the south. The sarcophagus and its contents had been removed by early plunderers of the tomb. All that was left were some broken alabaster vases, pottery and charcoal. On the summit of the mound were large phalli of stone.\n\nAppearance in The Histories\n\nIn The Histories, Herodotus recounts how Alyattes continued his father's war against Miletus. According to Herodotus, Alyattes invaded Miletus annually to burn their crops over the course of several years. The troops left the horses and houses untouched so that the Milesians could plant a new crop, which the Lydians would then burn the following year. This continued until the end of the war eleven years later.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Alyattes of Lydia" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1652" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Alyattes reigned as king of Lydia from c. 610 BC to 560 BC. He belonged to the house of the Mermnadae, was the son of king Sadyattes and father of king Croesus. Under Alyattes, the kingdom of Lydia entered its period of greatest prosperity and power. \n\nLife \n\nFor several years he continued the war against the Greek colony of Miletus begun by his father, but was obliged to turn his attention towards the Medes and Babylonians. On May 28, 585 BC, during the Battle of Halys fought against Cyaxares, king of Media, a solar eclipse took place; hostilities were suspended, peace concluded, and the Halys River was fixed as the boundary between the two kingdoms.\n\nAlyattes drove the Cimmerians from Asia Minor,Herodotus, 1.16; Sergei R. Tokhtas’ev \"Cimmerians\" in the Encyclopedia Iranica (1991), several nineteenth-century summaries. with the help of war dogs.Polyaenus, 7.2 He further subdued the Carians, and took several Ionian cities, including Smyrna and Colophon. Smyrna was sacked and destroyed with its inhabitants forced to move into the countryside.\n\nHe standardised the weight of coins (1 stater = 168 grains of wheat). The coins were produced using an anvil die technique and stamped with a lion's head, the symbol of the Mermnadae.\n\nHe was succeeded by his son Croesus. His daughter Aryenis of Lydia was queen consort of Astyages, King of Media.\n\nTomb \n\nAlyattes' tomb still exists on the plateau between Lake Gygaea and the river Hermus to the north of the Lydian capital Sardis—a large mound of earth with a substructure of huge stones.  It was excavated by Spiegelthal in 1854, who found that it covered a large vault of finely cut marble blocks approached by a flat-roofed passage of the same stone from the south. The sarcophagus and its contents had been removed by early plunderers of the tomb. All that was left were some broken alabaster vases, pottery and charcoal. On the summit of the mound were large phalli of stone.\n\nAppearance in The Histories\n\nIn The Histories, Herodotus recounts how Alyattes continued his father's war against Miletus. According to Herodotus, Alyattes invaded Miletus annually to burn their crops over the course of several years. The troops left the horses and houses untouched so that the Milesians could plant a new crop, which the Lydians would then burn the following year. This continued until the end of the war eleven years later. Alyattes of Lydia. http://en.wikipedia.org/?curid=1652."
  }
}
