{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9869",
  "eid" : "f27ac020-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778486562,
  "textBody" : "The Epistle to the Ephesians, also called the Letter to the Ephesians and often shortened to Ephesians, is the tenth book of the New Testament. Its authorship has traditionally been attributed to Paul the Apostle but, starting in 1792, this has been challenged  as Deutero-Pauline, that is, written in Paul's name by a later author strongly influenced by Paul's thought.Authenticity of [http://www.bible-apologetics.com/history/ephesians.htm Ephesians]Hoehner, Harold. Ephesians: An Exegetical Commentary. Baker Academic, 2002. \n\nThemes\n\nThe main theme of Ephesians is \"the Church, which is the Body of Christ.\"\n\nThe Church is to maintain the unity in practice which Christ has brought about positionally. According to New Testament scholar Daniel Wallace, the theme may be stated pragmatically as \"Christians, get along with each other! Maintain the unity practically which Christ has effected positionally by his death.\"Wallace, Daniel B. \"Ephesians:Introduction, Argument, and Outline.\" Web: [http://bible.org/seriespage/ephesians-introduction-argument-and-outline] 1 January 2010\n\nAnother major theme in Ephesians is the keeping of Christ's body (that is, the Church) pure and holy. \n\nIn the second part of the letter, Ephesians 4:17–6:20, the author gives practical advice in how to live a holy, pure, and Christ-inspired lifestyle. Many devotional thoughts and sermons that are addressed to the practically minded-individual have been drawn from this section of the New Testament.\n\nComposition\n\nAccording to tradition, the Apostle Paul wrote the letter while he was in prison in Rome (around AD 62). This would be about the same time as the Epistle to the Colossians (which in many points it resembles) and the Epistle to Philemon. However, many critical scholars have questioned the authorship of the letter and suggest that it may have been written between AD 80 and 100.\n\nAuthorship\n\nThe first verse in the letter identifies Paul as its author. While early lists of New Testament books, including Marcion's canon and the Muratorian fragment, attribute the letter to Paul, more recently there have been challenges to Pauline authorship on the basis of the letter's characteristically non-Pauline syntax, terminology, and eschatology.\n\nBiblical scholar Harold Hoehner, surveying 279 commentaries written between 1519 and 2001, found that 54% favoured Pauline authorship, 39% concluded against Pauline authorship and 7% remained uncertain.\n\nThere are four main theories in biblical scholarship that address the question of Pauline authorship.These four views all come from Markus Barth, Ephesians: Introduction, Translation, and Commentary on Chapters 1–3 (New York: Doubleday and Company Inc., 1974), 38\n* The traditional view that the epistle is written by Paul is supported by scholars that include Frank Thielman, Ezra Abbot, Asting, Gaugler, Grant, Harnack, Haupt, Fenton John Anthony Hort, Klijn, Johann David Michaelis, A. Robert, and André Feuillet, Sanders, Schille, Brooke Foss Westcott, and Theodor Zahn. For a defense of the Pauline authorship of  Ephesians, see Ephesians: An Exegetical Commentary by Harold Hoehner, pp 2–61.\n* A second position suggests that Ephesians was dictated by Paul with interpolations from another author. Some of the scholars that espouse this view include Albertz, Benoit, Cerfaux, Goguel, Harrison, H. J. Holtzmann, Murphy-O'Connor, and Wagenfuhrer.\n* Currently, most critical scholars think it improbable that Paul authored Ephesians. Among this group are Allan, Beare, Brandon, Bultmann, Conzelmann, Dibelius, Goodspeed, Kilsemann, J. Knox, W.L. Knox, Kümmel, K and S Lake, Marxsen, Masson, Mitton, Moffatt, Nineham, Pokorny, Schweizer, and J. Weiss.\n* Still other scholars suggest there is a lack of conclusive evidence. Some of this group are Cadbury, Julicher, McNeile, and Williams.\n\nPlace, date, and purpose of the writing of the letter\n\nWhile most English translations indicate that the letter was addressed to \"the saints who are in Ephesus\" (1:1), the words \"in Ephesus\" do not appear in the best and earliest manuscripts of the letter, leading most textual critics, like Bart Ehrman, to regard the words as an interpolation. This lack of any internal references to Ephesus in the early manuscripts may have led Marcion, a second-century heresiarch who created the first New Testament canon, to believe that the letter was actually addressed to the church at Laodicea, for details see Epistle to the Laodiceans. The view is not uncommon in later traditions either, considering that the content of the letter seems to suggest a similar socio-critical context to the Laodicean church mentioned in the Revelation of John.\n\nFurthermore, if Paul is regarded as the author, the impersonal character of the letter, which lacks personal greetings or any indication that the author has personal knowledge of his recipients, is incongruous with the account in Acts of Paul staying more than two years in Ephesus. For these reasons, most regard Ephesians to be a circular letter intended for many churches. The Jerusalem Bible notes that some critics think the words \"who are ...\" would have been followed by a blank to be filled in with the name of \"whichever church was being sent the letter\".Jersualem Bible (1966), Footnote a at Ephesians 1:1\n\nIf Paul was the author of the letter, then it was probably written from Rome during Paul's first imprisonment (; ; ), and probably soon after his arrival there in the year 62, four years after he had parted with the Ephesian elders at Miletus. However, scholars who dispute Paul's authorship date the letter to between 70–80 AD. In the latter case, the possible location of the authorship could have been within the church of Ephesus itself. Ignatius of Antioch himself seemed to be very well versed in the epistle to the Ephesians, and mirrors many of his own thoughts in his own epistle to the Ephesians.See Markus Barth, Ephesians: Introduction, Translation, and Commentary on Chapters 1–3 (New York: Doubleday and Company Inc., 1974), 50–51\n\nThe major theme of the letter is the unity and reconciliation of the whole of creation through the agency of the Church and, in particular, its foundation in Christ as part of the will of the Father.\n\nIn the Epistle to the Romans, Paul writes from the point of view of the demonstration of the righteousness of God—his covenant faithfulness and saving justice—in the gospel; the author of Ephesians writes from the perspective of union with Christ, who is the head of the true church.\n\nOutline\n\nEphesians contains:\n* . The greeting, from Paul to the church of Ephesus.\n* . A general account of the blessings that the gospel reveals. This includes the source of these blessings, the means by which they are attained, the reason why they are given, and their final result. The whole of the section  consists in the original Greek of just two lengthy and complex sentences (). It ends with a fervent prayer for the further spiritual enrichment of the Ephesians.\n* . A description of the change in the spiritual position of Gentiles as a result of the work of Christ. It ends with an account of how Paul was selected and qualified to be an apostle to the Gentiles, in the hope that this will keep them from being dispirited and lead him to pray for them.\n* . A chapter on unity in the midst of the diversity of gifts among believers.\n* . Instructions about ordinary life and different relationships.\n* . The imagery of spiritual warfare (including the metaphor of the Armor of God), the mission of Tychicus, and valedictory blessings.\n\nFounding of the church at Ephesus\n\nPaul's first and hurried visit for the space of three months to Ephesus is recorded in . The work he began on this occasion was carried forward by Apollos and Aquila and Priscilla. On his second visit early in the following year, he remained at Ephesus \"three years\", for he found it was the key to the western provinces of Asia Minor. Here \"a great door and effectual\" was opened to him, and the church was established and strengthened by his diligent labours there. From Ephesus the gospel spread abroad \"almost throughout all Asia.\" The word \"mightily grew and prevailed\" despite all the opposition and persecution he encountered.\n\nOn his last journey to Jerusalem, the apostle landed at Miletus and, summoning together the elders of the church from Ephesus, delivered to them a farewell charge, expecting to see them no more.\n\nThe following parallels between this epistle and the Milesian charge may be traced:\n\n#  = . The phrase \"lowliness of mind\".\n#  = . The word \"counsel\", denoting the divine plan.\n#  = . The divine ability.\n#  = . The building upon the foundation.\n#  =  \"The inheritance of the saints.\"\n\nPurpose\n\nThe purpose of the epistle, and to whom it was written, are matters of much speculation.Bruce, F.F. The New International Commentary on the New Testament. Eerdmans, 1984, 1991. . It was regarded by C.H. Dodd as the \"crown of Paulinism.\" In general, it is born out of its particular socio-historical context and the situational context of both the author and the audience. Originating in the circumstance of a multicultural church (primarily Jewish and Hellenistic), the author addressed issues appropriate to the diverse religious and cultural backgrounds present in the community.\n\nPaul exhorts the church repeatedly to embrace a specific view of salvation, which he then explicates. It seems most likely that Paul's Christology of sacrifice is the manner in which he intends to effect an environment of peace within the church. In short: \"If Christ was sacrificed for your sake, be like him and be in submission to one another.\" Paul addresses hostility, division, and self-interest more than any other topic in the letter, leading many scholars to believe that his primary concern was not doctrinal, but behavioral.\n\nSome theologians, such as Frank Charles Thompson,Thompson, Frank C. Thompson Chain Reference Study Bible (NIV). Kirkbride Bible Company, 2000.  agree the main theme of Ephesians is in response to the newly converted Jews who often separated themselves from their Gentile brethren. The unity of the church, especially between Jew and Gentile believers, is the keynote of the book. This is shown by the recurrence of such words and phrases as:\n\nTogether: made alive together; raised up together, sitting together; built together.\n\nOne, indicating unity: one new man, one body, one Spirit, one hope, one Lord, one faith, one baptism, one God and Father of all.\n\nThe Pauline theme of unity based on a sacrificial Christology may also be noted in the epistle to the Philippians.\n\nInterpretations\n\nEphesians is notable for its domestic code treatment in , covering husband-wife, parent-child, and master-slave relationships. In , wives are urged to submit to their husbands, and husbands to love their wives \"as Christ loved the Church.\" Christian Egalitarian theologians, such as Katharine Bushnell and Jessie Penn-Lewis, interpret these commands in the context of the preceding verse,  for all Christians to \"submit to one another.\" Thus, it is two-way, mutual submission of both husbands to wives and wives to husbands. But according to Peter O'Brien, Professor Emeritus at Moore Theological College, this would be the only instance of this meaning of submission in the whole New Testament, indeed in any extant comparable Greek texts; by O'Brien's account, the word simply does not connote mutuality. Dallas Theological Seminary professor Daniel Wallace understands it to be an extension of  on being filled by the Holy Spirit.\n\nIn the period leading up to the American Civil War (1861–65),  on master-slave relationships was one of the Bible verses used by Confederate slaveholders in support of a slaveholding position.E.N. Elliott, ed. Cotton is king, and pro-slavery arguments comprising the writings of Hammond, Harper, Christy, Stringfellow, Hodge, Bledsoe, and Cartwright, on this important subject. Augusta, Ga. : Pritchard, Abbott & Loomis, 1860.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Epistle to the Ephesians" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9869" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Epistle to the Ephesians, also called the Letter to the Ephesians and often shortened to Ephesians, is the tenth book of the New Testament. Its authorship has traditionally been attributed to Paul the Apostle but, starting in 1792, this has been challenged  as Deutero-Pauline, that is, written in Paul's name by a later author strongly influenced by Paul's thought.Authenticity of [http://www.bible-apologetics.com/history/ephesians.htm Ephesians]Hoehner, Harold. Ephesians: An Exegetical Commentary. Baker Academic, 2002. \n\nThemes\n\nThe main theme of Ephesians is \"the Church, which is the Body of Christ.\"\n\nThe Church is to maintain the unity in practice which Christ has brought about positionally. According to New Testament scholar Daniel Wallace, the theme may be stated pragmatically as \"Christians, get along with each other! Maintain the unity practically which Christ has effected positionally by his death.\"Wallace, Daniel B. \"Ephesians:Introduction, Argument, and Outline.\" Web: [http://bible.org/seriespage/ephesians-introduction-argument-and-outline] 1 January 2010\n\nAnother major theme in Ephesians is the keeping of Christ's body (that is, the Church) pure and holy. \n\nIn the second part of the letter, Ephesians 4:17–6:20, the author gives practical advice in how to live a holy, pure, and Christ-inspired lifestyle. Many devotional thoughts and sermons that are addressed to the practically minded-individual have been drawn from this section of the New Testament.\n\nComposition\n\nAccording to tradition, the Apostle Paul wrote the letter while he was in prison in Rome (around AD 62). This would be about the same time as the Epistle to the Colossians (which in many points it resembles) and the Epistle to Philemon. However, many critical scholars have questioned the authorship of the letter and suggest that it may have been written between AD 80 and 100.\n\nAuthorship\n\nThe first verse in the letter identifies Paul as its author. While early lists of New Testament books, including Marcion's canon and the Muratorian fragment, attribute the letter to Paul, more recently there have been challenges to Pauline authorship on the basis of the letter's characteristically non-Pauline syntax, terminology, and eschatology.\n\nBiblical scholar Harold Hoehner, surveying 279 commentaries written between 1519 and 2001, found that 54% favoured Pauline authorship, 39% concluded against Pauline authorship and 7% remained uncertain.\n\nThere are four main theories in biblical scholarship that address the question of Pauline authorship.These four views all come from Markus Barth, Ephesians: Introduction, Translation, and Commentary on Chapters 1–3 (New York: Doubleday and Company Inc., 1974), 38\n* The traditional view that the epistle is written by Paul is supported by scholars that include Frank Thielman, Ezra Abbot, Asting, Gaugler, Grant, Harnack, Haupt, Fenton John Anthony Hort, Klijn, Johann David Michaelis, A. Robert, and André Feuillet, Sanders, Schille, Brooke Foss Westcott, and Theodor Zahn. For a defense of the Pauline authorship of  Ephesians, see Ephesians: An Exegetical Commentary by Harold Hoehner, pp 2–61.\n* A second position suggests that Ephesians was dictated by Paul with interpolations from another author. Some of the scholars that espouse this view include Albertz, Benoit, Cerfaux, Goguel, Harrison, H. J. Holtzmann, Murphy-O'Connor, and Wagenfuhrer.\n* Currently, most critical scholars think it improbable that Paul authored Ephesians. Among this group are Allan, Beare, Brandon, Bultmann, Conzelmann, Dibelius, Goodspeed, Kilsemann, J. Knox, W.L. Knox, Kümmel, K and S Lake, Marxsen, Masson, Mitton, Moffatt, Nineham, Pokorny, Schweizer, and J. Weiss.\n* Still other scholars suggest there is a lack of conclusive evidence. Some of this group are Cadbury, Julicher, McNeile, and Williams.\n\nPlace, date, and purpose of the writing of the letter\n\nWhile most English translations indicate that the letter was addressed to \"the saints who are in Ephesus\" (1:1), the words \"in Ephesus\" do not appear in the best and earliest manuscripts of the letter, leading most textual critics, like Bart Ehrman, to regard the words as an interpolation. This lack of any internal references to Ephesus in the early manuscripts may have led Marcion, a second-century heresiarch who created the first New Testament canon, to believe that the letter was actually addressed to the church at Laodicea, for details see Epistle to the Laodiceans. The view is not uncommon in later traditions either, considering that the content of the letter seems to suggest a similar socio-critical context to the Laodicean church mentioned in the Revelation of John.\n\nFurthermore, if Paul is regarded as the author, the impersonal character of the letter, which lacks personal greetings or any indication that the author has personal knowledge of his recipients, is incongruous with the account in Acts of Paul staying more than two years in Ephesus. For these reasons, most regard Ephesians to be a circular letter intended for many churches. The Jerusalem Bible notes that some critics think the words \"who are ...\" would have been followed by a blank to be filled in with the name of \"whichever church was being sent the letter\".Jersualem Bible (1966), Footnote a at Ephesians 1:1\n\nIf Paul was the author of the letter, then it was probably written from Rome during Paul's first imprisonment (; ; ), and probably soon after his arrival there in the year 62, four years after he had parted with the Ephesian elders at Miletus. However, scholars who dispute Paul's authorship date the letter to between 70–80 AD. In the latter case, the possible location of the authorship could have been within the church of Ephesus itself. Ignatius of Antioch himself seemed to be very well versed in the epistle to the Ephesians, and mirrors many of his own thoughts in his own epistle to the Ephesians.See Markus Barth, Ephesians: Introduction, Translation, and Commentary on Chapters 1–3 (New York: Doubleday and Company Inc., 1974), 50–51\n\nThe major theme of the letter is the unity and reconciliation of the whole of creation through the agency of the Church and, in particular, its foundation in Christ as part of the will of the Father.\n\nIn the Epistle to the Romans, Paul writes from the point of view of the demonstration of the righteousness of God—his covenant faithfulness and saving justice—in the gospel; the author of Ephesians writes from the perspective of union with Christ, who is the head of the true church.\n\nOutline\n\nEphesians contains:\n* . The greeting, from Paul to the church of Ephesus.\n* . A general account of the blessings that the gospel reveals. This includes the source of these blessings, the means by which they are attained, the reason why they are given, and their final result. The whole of the section  consists in the original Greek of just two lengthy and complex sentences (). It ends with a fervent prayer for the further spiritual enrichment of the Ephesians.\n* . A description of the change in the spiritual position of Gentiles as a result of the work of Christ. It ends with an account of how Paul was selected and qualified to be an apostle to the Gentiles, in the hope that this will keep them from being dispirited and lead him to pray for them.\n* . A chapter on unity in the midst of the diversity of gifts among believers.\n* . Instructions about ordinary life and different relationships.\n* . The imagery of spiritual warfare (including the metaphor of the Armor of God), the mission of Tychicus, and valedictory blessings.\n\nFounding of the church at Ephesus\n\nPaul's first and hurried visit for the space of three months to Ephesus is recorded in . The work he began on this occasion was carried forward by Apollos and Aquila and Priscilla. On his second visit early in the following year, he remained at Ephesus \"three years\", for he found it was the key to the western provinces of Asia Minor. Here \"a great door and effectual\" was opened to him, and the church was established and strengthened by his diligent labours there. From Ephesus the gospel spread abroad \"almost throughout all Asia.\" The word \"mightily grew and prevailed\" despite all the opposition and persecution he encountered.\n\nOn his last journey to Jerusalem, the apostle landed at Miletus and, summoning together the elders of the church from Ephesus, delivered to them a farewell charge, expecting to see them no more.\n\nThe following parallels between this epistle and the Milesian charge may be traced:\n\n#  = . The phrase \"lowliness of mind\".\n#  = . The word \"counsel\", denoting the divine plan.\n#  = . The divine ability.\n#  = . The building upon the foundation.\n#  =  \"The inheritance of the saints.\"\n\nPurpose\n\nThe purpose of the epistle, and to whom it was written, are matters of much speculation.Bruce, F.F. The New International Commentary on the New Testament. Eerdmans, 1984, 1991. . It was regarded by C.H. Dodd as the \"crown of Paulinism.\" In general, it is born out of its particular socio-historical context and the situational context of both the author and the audience. Originating in the circumstance of a multicultural church (primarily Jewish and Hellenistic), the author addressed issues appropriate to the diverse religious and cultural backgrounds present in the community.\n\nPaul exhorts the church repeatedly to embrace a specific view of salvation, which he then explicates. It seems most likely that Paul's Christology of sacrifice is the manner in which he intends to effect an environment of peace within the church. In short: \"If Christ was sacrificed for your sake, be like him and be in submission to one another.\" Paul addresses hostility, division, and self-interest more than any other topic in the letter, leading many scholars to believe that his primary concern was not doctrinal, but behavioral.\n\nSome theologians, such as Frank Charles Thompson,Thompson, Frank C. Thompson Chain Reference Study Bible (NIV). Kirkbride Bible Company, 2000.  agree the main theme of Ephesians is in response to the newly converted Jews who often separated themselves from their Gentile brethren. The unity of the church, especially between Jew and Gentile believers, is the keynote of the book. This is shown by the recurrence of such words and phrases as:\n\nTogether: made alive together; raised up together, sitting together; built together.\n\nOne, indicating unity: one new man, one body, one Spirit, one hope, one Lord, one faith, one baptism, one God and Father of all.\n\nThe Pauline theme of unity based on a sacrificial Christology may also be noted in the epistle to the Philippians.\n\nInterpretations\n\nEphesians is notable for its domestic code treatment in , covering husband-wife, parent-child, and master-slave relationships. In , wives are urged to submit to their husbands, and husbands to love their wives \"as Christ loved the Church.\" Christian Egalitarian theologians, such as Katharine Bushnell and Jessie Penn-Lewis, interpret these commands in the context of the preceding verse,  for all Christians to \"submit to one another.\" Thus, it is two-way, mutual submission of both husbands to wives and wives to husbands. But according to Peter O'Brien, Professor Emeritus at Moore Theological College, this would be the only instance of this meaning of submission in the whole New Testament, indeed in any extant comparable Greek texts; by O'Brien's account, the word simply does not connote mutuality. Dallas Theological Seminary professor Daniel Wallace understands it to be an extension of  on being filled by the Holy Spirit.\n\nIn the period leading up to the American Civil War (1861–65),  on master-slave relationships was one of the Bible verses used by Confederate slaveholders in support of a slaveholding position.E.N. Elliott, ed. Cotton is king, and pro-slavery arguments comprising the writings of Hammond, Harper, Christy, Stringfellow, Hodge, Bledsoe, and Cartwright, on this important subject. Augusta, Ga. : Pritchard, Abbott & Loomis, 1860. Epistle to the Ephesians. http://en.wikipedia.org/?curid=9869."
  }
}
