{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1606",
  "eid" : "baae1520-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778392946,
  "textBody" : ":To see other rulers related or affiliated with Alexander Jannaeus, see List of Hasmonean and Herodian rulers\n\nAlexander Jannaeus (also known as Alexander Jannai/Yannai; ) was the second Hasmonean king of Judaea from 103 to 76 BC. A son of John Hyrcanus, he inherited the throne from his brother Aristobulus I, and married his brother's widow, Queen Salome Alexandra. From his conquests to expand the kingdom to a bloody civil war, Alexander's reign has been generalized as cruel and oppressive with never ending conflict. Although Josephus and other historians refer to him by the name of \"Alexander Yannai\", his full name was \"Alexander Jonathan\" as attested to by his coins wherein he calls himself \"Yehonathan the king\".Jewish Virtual Library, Yannai Alexander\n\nFamily\n\nAlexander Jannaeus was the third son of John Hyrcanus, by his second wife. When Aristobulus I, Hyrcanus' son by his first wife, became king, he deemed it necessary for his own security to imprison his half-brother. Aristobulus died after a reign of one year. Upon his death, his widow, Salome Alexandra had Alexander and his brothers released from prison.\n\nAlexander, as the oldest living brother, had the right not only to the throne but also to Salome, the widow of his deceased brother, who had died childless; and, although she was thirteen years older than him, he married her in accordance with Jewish law. By her, he had two sons, the eldest, Hyrcanus II became high-priest in 62 BC and Aristobulus II who was high-priest from 66 - 62 BC and started a bloody civil war with his brother, ending in his capture by Pompey the Great. Like his brother he was an avid supporter of the aristocratic priestly faction known as the Sadducees, his wife Salome on the other hand came from a pharisaic family (her brother was Simeon ben Shetach a famous pharisee leader), and was more sympathetic to their cause and protected them throughout his turbulent reign.New World Encyclopedia, Alexander Jannaeus Like his father Alexander also served as the high priest. This raised the ire of the Rabbis who insisted that these two offices should not be combined.ibid According to the Talmudkiddushin 66a Yannai was a questionable desecrated priest (rumour had it that his mother was captured in Modiin and violated) and was not allowed to serve in the temple according to the rabbis, this infuriated the king and sided with the Sadducees who defended him. This incident led the king to turn against the pharisees and persecute them until his death.\n\nConquests\n\nWar with Ptolemy Lathyrus\n\nAlexander's first expedition was against the city of Ptolemais (Acre). While Alexander went forward to siege the city, Zoilus, ruler of the coastal city Dora and Straton's Tower took the opportunity to see if he could perhaps save Ptolemais in hopes of gaining territory. Alexander's Hasmonean army quickly defeated Zoilus's forces with little trouble. Ptolemais and Zoilus then requested aid from Ptolemy IX Lathyros, who had been cast out by his mother Cleopatra III. Ptolemy founded a kingdom in Cyprus after being cast out by his mother. The situation at Ptolemais was seized as an opportunity by Ptolemy to possibly gain a stronghold and control the Judean coast in order to invade Egypt.\n\nPtolemy landed a large army for the relief of the town; but Alexander met him with treachery, arranging an alliance with him openly while secretly he sought to obtain the help of his mother against him. When Alexander formed an alliance with Ptolemy, Ptolemy in good gesture, handed over Ptolemais, Zoilus, Dora, and Straton's Tower to Alexander. As soon as Ptolemy learned of Alexander's scheme, he invaded the Galilee region capturing Asochis. Ptolemy also initiated an attack upon Sepphoris but failed.\n\nAlexander might easily have lost his crown and Judea its independence as the result of this battle, had it not been for the assistance extended by Egypt. Cleopatra's two Jewish generals, Helkias and Ananias, persuaded the queen of the dangers of allowing her banished son Ptolemy to remain victorious and she entrusted them with an army against him. As a result, Ptolemy was forced to withdraw to Cyprus, and Alexander was saved. The Egyptians, as compensation for their aid, desired to annex Judea to their country, but considerations touching the resident Egyptian Jews, who were the main support of her throne, induced Cleopatra to modify her longings for conquest. The Egyptian army withdrawn, Alexander found his hands free; and forthwith he planned new campaigns.\n\nTransjordan and coastal conquest\n\nAlexander captured Gadara and the strong fortress Amathus in the Transjordan region; but, in an ambush set for him by Theodorus, ruler of Amathus, he lost the battle. Alexander was more successful in his expedition against the Hellenized coastal cities (what had once been Philistia), capturing Raphia and Anthedon. Finally, in 96 BC Jannaeus outlasted the inhabitants of Gaza in a year-long siege, which he occupied through treachery, and gave up to be pillaged and burned by his soldiery. This victory gained Judean control over the Mediterranean outlet for the Nabatean trade routes.\n\nJudean Civil War\n\nThe Judean Civil War initially began after the conquest of Gaza by Jannaeus around 96 BC. Due to Jannaeus's victory at Gaza, the Nabatean kingdom no longer controlled their main trade route to the Mediterranean Sea at Gaza and to the road leading to Damascus. Therefore, the Nabatean king Obodas I launched an ambush on Alexander in a steep valley in Gadara where Jannaeus \"was lucky to escape alive\". After Jannaeus was defeated in the Battle of Gadara against the Nabataeans, he returned to fierce Jewish opposition in Jerusalem. Alexander had to cede the acquired territories to the Nabataeans so that he could dissuade Obodas from supporting his opponents in Judea.\n\nDuring the Jewish holiday of Feast of Tabernacles, Alexander Jannaeus, while officiating as the High Priest at the Temple in Jerusalem, demonstrated his support of the Sadducees by refusing to perform the water libation ceremony properly: instead of pouring it on the altar, he poured it on his feet. The crowd responded with shock at his mockery and showed their displeasure by pelting Alexander with the etrogim (citrons) that they were holding in their hands. Outraged, he ordered soldiers to kill those who insulted him, more than 6,000 people in the Temple courtyard were massacred. With further frustration, Alexander had wooden barriers build around the altars preventing people from sacrificing and deny daily offerings except for the priests. He also allied himself with foreign troops such as the Pisidians and the Cilicians who would later help his regime during the civil war. This incident during the Feast of Tabernacles was a major factor leading up to the Judean Civil War by igniting popular opposition to Jannaeus.\n\nOverall, the war lasted six years and left 50,000 Judeans dead. After Jannaeus succeeded early in the war, the rebels asked for Seleucid assistance. Judean insurgents joined forces with Demetrius III Eucaerus to fight against Jannaeus. The Seleucid forces defeated Jannaeus at Shechem and forced him to take refuge in the mountains. However, these Judean rebels ultimately decided that it was better to live under a terrible Jewish king than return to a Seleucid ruler. After 6,000 Jews returned to Jannaeus, Demetrius was defeated. The end of the Civil War brought a sense of national solidarity against Seleucid influence. Nevertheless, Jannaeus was uninterested in reconciliation within the Judean State.\n\nThe aftermath of the Judean Civil War consisted of popular unrest, poverty and grief over the fallen soldiers on both sides. The greatest impact of the war was the victor's revenge. Josephus reports that Jannaeus brought 800 Pharisee rebels to Jerusalem and had them crucified, and had the throats of the rebel's wives and children cut before their eyes as Jannaeus ate with his concubines.\n\nCoinage\n\nThe coinage of Alexander Jannaeus is characteristic of the early Jewish coinage in that it avoided human or animal representations, in opposition to the surrounding Greek, and later Roman types of the period. Jewish coinage instead focused on symbols, either natural, such as the palm tree, the pomegranate or the star, or man-made, such as the Temple, the Menorah, trumpets or cornucopia.\n\nAlexander Jannaeus was the first of the Jewish kings to introduce the \"eight-ray star\" or \"eight-spoked wheel\" symbol, in his bronze \"Widow's mite\" coins, in combination with the widespread Seleucid numismatic symbol of the anchor. Depending on the make, the star symbol can be shown with straight spokes connected to the outside circle, in a style rather indicative of a wheel. On others, the spokes can have a more \"flame-like\" shape, more indicative of the representation of a star within a diadem.\n\nIt is not clear what the wheel or star may exactly symbolize, and interpretations vary, from the morning star, to the sun or the heavens. The influence of some Persian symbols of a star within a diadem, or the eight-spoked Buddhist wheel (see the coins of the Indo-Greek king Menander I with this symbol) have also been suggested. The eight-spoked Macedonian star (a variation of which is the Vergina Sun), emblem of the royal Argead dynasty and the ancient kingdom of Macedonia, within a Hellenistic diadem symbolizing royalty (many of the coins depict a small knot with two ends on top of the diadem), seem to be the most probable source for this symbol.\n\nThe most likely explanation is that the symbol is a star encased in a diadem and it is a religious explanation. Biblical law forbids the making of graven images for worship (especially see ), yet the image of a monarch is a staple of Hellenistic coins. In place of an image of himself, therefore, it is likely that Alexander Jannaeus chose a star, in keeping with , \"A star rises from Jacob, a sceptre comes forth from Israel\". This verse generally was seen as a biblical support for monarchy (and specifically as support for a Davidic monarchy). Jannaeus, however, could have seen it as an image of his achievements, if not his own rule. This is how the rest of Numbers 24:17 and verses 18 and 19 continue: The star, it says, \"smashes the brow of Moab, the foundation of all children of Seth. Edom becomes a possession, yea, Seir a possession of its enemies; but Israel is triumphant. A victor issues from Jacob to wipe out what is left of Ir\". Considering Jannaeus' conquests—creating a kingdom that rivalled those of David and Solomon and may have even exceeded those—the \"star\" envisioned in the prophecy of Balaam in Numbers was a perfect match for him.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Alexander Jannaeus" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1606" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : ":To see other rulers related or affiliated with Alexander Jannaeus, see List of Hasmonean and Herodian rulers\n\nAlexander Jannaeus (also known as Alexander Jannai/Yannai; ) was the second Hasmonean king of Judaea from 103 to 76 BC. A son of John Hyrcanus, he inherited the throne from his brother Aristobulus I, and married his brother's widow, Queen Salome Alexandra. From his conquests to expand the kingdom to a bloody civil war, Alexander's reign has been generalized as cruel and oppressive with never ending conflict. Although Josephus and other historians refer to him by the name of \"Alexander Yannai\", his full name was \"Alexander Jonathan\" as attested to by his coins wherein he calls himself \"Yehonathan the king\".Jewish Virtual Library, Yannai Alexander\n\nFamily\n\nAlexander Jannaeus was the third son of John Hyrcanus, by his second wife. When Aristobulus I, Hyrcanus' son by his first wife, became king, he deemed it necessary for his own security to imprison his half-brother. Aristobulus died after a reign of one year. Upon his death, his widow, Salome Alexandra had Alexander and his brothers released from prison.\n\nAlexander, as the oldest living brother, had the right not only to the throne but also to Salome, the widow of his deceased brother, who had died childless; and, although she was thirteen years older than him, he married her in accordance with Jewish law. By her, he had two sons, the eldest, Hyrcanus II became high-priest in 62 BC and Aristobulus II who was high-priest from 66 - 62 BC and started a bloody civil war with his brother, ending in his capture by Pompey the Great. Like his brother he was an avid supporter of the aristocratic priestly faction known as the Sadducees, his wife Salome on the other hand came from a pharisaic family (her brother was Simeon ben Shetach a famous pharisee leader), and was more sympathetic to their cause and protected them throughout his turbulent reign.New World Encyclopedia, Alexander Jannaeus Like his father Alexander also served as the high priest. This raised the ire of the Rabbis who insisted that these two offices should not be combined.ibid According to the Talmudkiddushin 66a Yannai was a questionable desecrated priest (rumour had it that his mother was captured in Modiin and violated) and was not allowed to serve in the temple according to the rabbis, this infuriated the king and sided with the Sadducees who defended him. This incident led the king to turn against the pharisees and persecute them until his death.\n\nConquests\n\nWar with Ptolemy Lathyrus\n\nAlexander's first expedition was against the city of Ptolemais (Acre). While Alexander went forward to siege the city, Zoilus, ruler of the coastal city Dora and Straton's Tower took the opportunity to see if he could perhaps save Ptolemais in hopes of gaining territory. Alexander's Hasmonean army quickly defeated Zoilus's forces with little trouble. Ptolemais and Zoilus then requested aid from Ptolemy IX Lathyros, who had been cast out by his mother Cleopatra III. Ptolemy founded a kingdom in Cyprus after being cast out by his mother. The situation at Ptolemais was seized as an opportunity by Ptolemy to possibly gain a stronghold and control the Judean coast in order to invade Egypt.\n\nPtolemy landed a large army for the relief of the town; but Alexander met him with treachery, arranging an alliance with him openly while secretly he sought to obtain the help of his mother against him. When Alexander formed an alliance with Ptolemy, Ptolemy in good gesture, handed over Ptolemais, Zoilus, Dora, and Straton's Tower to Alexander. As soon as Ptolemy learned of Alexander's scheme, he invaded the Galilee region capturing Asochis. Ptolemy also initiated an attack upon Sepphoris but failed.\n\nAlexander might easily have lost his crown and Judea its independence as the result of this battle, had it not been for the assistance extended by Egypt. Cleopatra's two Jewish generals, Helkias and Ananias, persuaded the queen of the dangers of allowing her banished son Ptolemy to remain victorious and she entrusted them with an army against him. As a result, Ptolemy was forced to withdraw to Cyprus, and Alexander was saved. The Egyptians, as compensation for their aid, desired to annex Judea to their country, but considerations touching the resident Egyptian Jews, who were the main support of her throne, induced Cleopatra to modify her longings for conquest. The Egyptian army withdrawn, Alexander found his hands free; and forthwith he planned new campaigns.\n\nTransjordan and coastal conquest\n\nAlexander captured Gadara and the strong fortress Amathus in the Transjordan region; but, in an ambush set for him by Theodorus, ruler of Amathus, he lost the battle. Alexander was more successful in his expedition against the Hellenized coastal cities (what had once been Philistia), capturing Raphia and Anthedon. Finally, in 96 BC Jannaeus outlasted the inhabitants of Gaza in a year-long siege, which he occupied through treachery, and gave up to be pillaged and burned by his soldiery. This victory gained Judean control over the Mediterranean outlet for the Nabatean trade routes.\n\nJudean Civil War\n\nThe Judean Civil War initially began after the conquest of Gaza by Jannaeus around 96 BC. Due to Jannaeus's victory at Gaza, the Nabatean kingdom no longer controlled their main trade route to the Mediterranean Sea at Gaza and to the road leading to Damascus. Therefore, the Nabatean king Obodas I launched an ambush on Alexander in a steep valley in Gadara where Jannaeus \"was lucky to escape alive\". After Jannaeus was defeated in the Battle of Gadara against the Nabataeans, he returned to fierce Jewish opposition in Jerusalem. Alexander had to cede the acquired territories to the Nabataeans so that he could dissuade Obodas from supporting his opponents in Judea.\n\nDuring the Jewish holiday of Feast of Tabernacles, Alexander Jannaeus, while officiating as the High Priest at the Temple in Jerusalem, demonstrated his support of the Sadducees by refusing to perform the water libation ceremony properly: instead of pouring it on the altar, he poured it on his feet. The crowd responded with shock at his mockery and showed their displeasure by pelting Alexander with the etrogim (citrons) that they were holding in their hands. Outraged, he ordered soldiers to kill those who insulted him, more than 6,000 people in the Temple courtyard were massacred. With further frustration, Alexander had wooden barriers build around the altars preventing people from sacrificing and deny daily offerings except for the priests. He also allied himself with foreign troops such as the Pisidians and the Cilicians who would later help his regime during the civil war. This incident during the Feast of Tabernacles was a major factor leading up to the Judean Civil War by igniting popular opposition to Jannaeus.\n\nOverall, the war lasted six years and left 50,000 Judeans dead. After Jannaeus succeeded early in the war, the rebels asked for Seleucid assistance. Judean insurgents joined forces with Demetrius III Eucaerus to fight against Jannaeus. The Seleucid forces defeated Jannaeus at Shechem and forced him to take refuge in the mountains. However, these Judean rebels ultimately decided that it was better to live under a terrible Jewish king than return to a Seleucid ruler. After 6,000 Jews returned to Jannaeus, Demetrius was defeated. The end of the Civil War brought a sense of national solidarity against Seleucid influence. Nevertheless, Jannaeus was uninterested in reconciliation within the Judean State.\n\nThe aftermath of the Judean Civil War consisted of popular unrest, poverty and grief over the fallen soldiers on both sides. The greatest impact of the war was the victor's revenge. Josephus reports that Jannaeus brought 800 Pharisee rebels to Jerusalem and had them crucified, and had the throats of the rebel's wives and children cut before their eyes as Jannaeus ate with his concubines.\n\nCoinage\n\nThe coinage of Alexander Jannaeus is characteristic of the early Jewish coinage in that it avoided human or animal representations, in opposition to the surrounding Greek, and later Roman types of the period. Jewish coinage instead focused on symbols, either natural, such as the palm tree, the pomegranate or the star, or man-made, such as the Temple, the Menorah, trumpets or cornucopia.\n\nAlexander Jannaeus was the first of the Jewish kings to introduce the \"eight-ray star\" or \"eight-spoked wheel\" symbol, in his bronze \"Widow's mite\" coins, in combination with the widespread Seleucid numismatic symbol of the anchor. Depending on the make, the star symbol can be shown with straight spokes connected to the outside circle, in a style rather indicative of a wheel. On others, the spokes can have a more \"flame-like\" shape, more indicative of the representation of a star within a diadem.\n\nIt is not clear what the wheel or star may exactly symbolize, and interpretations vary, from the morning star, to the sun or the heavens. The influence of some Persian symbols of a star within a diadem, or the eight-spoked Buddhist wheel (see the coins of the Indo-Greek king Menander I with this symbol) have also been suggested. The eight-spoked Macedonian star (a variation of which is the Vergina Sun), emblem of the royal Argead dynasty and the ancient kingdom of Macedonia, within a Hellenistic diadem symbolizing royalty (many of the coins depict a small knot with two ends on top of the diadem), seem to be the most probable source for this symbol.\n\nThe most likely explanation is that the symbol is a star encased in a diadem and it is a religious explanation. Biblical law forbids the making of graven images for worship (especially see ), yet the image of a monarch is a staple of Hellenistic coins. In place of an image of himself, therefore, it is likely that Alexander Jannaeus chose a star, in keeping with , \"A star rises from Jacob, a sceptre comes forth from Israel\". This verse generally was seen as a biblical support for monarchy (and specifically as support for a Davidic monarchy). Jannaeus, however, could have seen it as an image of his achievements, if not his own rule. This is how the rest of Numbers 24:17 and verses 18 and 19 continue: The star, it says, \"smashes the brow of Moab, the foundation of all children of Seth. Edom becomes a possession, yea, Seir a possession of its enemies; but Israel is triumphant. A victor issues from Jacob to wipe out what is left of Ir\". Considering Jannaeus' conquests—creating a kingdom that rivalled those of David and Solomon and may have even exceeded those—the \"star\" envisioned in the prophecy of Balaam in Numbers was a perfect match for him. Alexander Jannaeus. http://en.wikipedia.org/?curid=1606."
  }
}
