{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7015",
  "eid" : "df3ff5c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778454300,
  "textBody" : "Christiaan Neethling Barnard (8 November 1922 – 2 September 2001) was a South African cardiac surgeon who performed the world's first human-to-human heart transplant on 3 December 1967 at Groote Schuur Hospital in Cape Town, South Africa.  Growing up in Beaufort West, Cape Province, he studied medicine and practised for several years in his native country.  As a young doctor experimenting on dogs, Barnard developed a remedy for the infant defect of intestinal atresia.  His technique saved the lives of ten babies in Cape Town and was adopted by surgeons in Britain and the United States.  In 1955, he travelled to the United States and was initially assigned further gastrointestinal work by Owen Wangensteen.  He was introduced to the heart-lung machine, and Barnard was allowed to transfer to the service run by open heart surgery pioneer Walt Lillehei. Upon returning to South Africa in 1958, Barnard was appointed head of the Department of Experimental Surgery at the Groote Schuur Hospital, Cape Town.\n\nOn 3 December 1967, Barnard transplanted the heart of Denise Darvall, who had just died from a head injury, into the chest of a 54-year-old Louis Washkansky.  Washkansky regained full consciousness and lived for eighteen days, even spending time with his wife, before he died of pneumonia, with the suppression of his immune system by the anti-rejection drugs being a major contributing factor.  Barnard had told Mr. and Mrs. Washkansky that the operation had an 80% chance of success, a claim which has been criticised as misleading.\n\nBarnard's second transplant patient Philip Blaiberg, with the operation performed at the beginning of 1968, lived for nineteen months and was able to go home from the hospital.\n\nHe retired as Head of the Department of Cardiothoracic Surgery in Cape Town in 1983 after developing rheumatoid arthritis in his hands which ended his surgical career. He became interested in anti-aging research, and in 1986 his reputation suffered when he promoted Glycel, an expensive \"anti-aging\" skin cream, whose approval was withdrawn by the United States Food and Drug Administration soon thereafter. During his remaining years, he established the Christiaan Barnard Foundation, dedicated to helping underprivileged children throughout the world. He died in 2001 at the age of 78 after an asthma attack.\n\nEarly life \n\nBarnard grew up in Beaufort West, Cape Province, Union of South Africa. His father, Adam Barnard, was a minister in the Dutch Reformed Church. One of his four brothers, Abraham, was a \"blue baby\" who died of a heart problem at the age of three (Barnard would later guess that it was tetralogy of Fallot).  The family also experienced the loss of a daughter who was stillborn and who had been the fraternal twin of Barnard's older brother Johannes, who was twelve years older than Chris.Every Second Counts, McRae [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT44&lpg\nPT44&dq%22Chris+and+Marius+often+felt+that+she+was+grieving+over+the+loss+of+her+only+daughter%22&source\nbl&ots0sfG2pL-b5&sig\nAHk7xZK5s6ocBHV7gUmxq6fKvao&hlen&sa\nX&ved0ahUKEwiJ-8GRvO_RAhUnw1QKHS1rDakQ6AEIGjAA#v\nonepage&q%22Chris%20and%20Marius%20often%20felt%20that%20she%20was%20grieving%20over%20the%20loss%20of%20her%20only%20daughter%22&f\nfalse page 46]. Barnard matriculated from the Beaufort West High School in 1940, and went to study medicine at the University of Cape Town Medical School, where he obtained his MB ChB in 1945.\n\nHis father served as a missionary to mixed-race peoples.  His mother, the former Maria Elisabeth de Swart, instilled in the surviving brothers the belief that they could do anything they set their minds to.\n\nCareer\n\nBarnard did his internship and residency at the Groote Schuur Hospital in Cape Town, after which he worked as a general practitioner in Ceres, a rural town in the Cape Province.Every Second Counts: The Race to Transplant the First Human Heart, Donald McRae, New York: Penguin (Berkley/Putnam), 2006.  See esp. Ch. 10 \"The Wait\" and Ch. 11 \"Fame and Heartbreak,\" pages 173–214. In 1951, he returned to Cape Town where he worked at the City Hospital as a Senior Resident Medical Officer, and in the Department of Medicine at the Groote Schuur Hospital as a registrar. He completed his master's degree, receiving Master of Medicine in 1953 from the University of Cape Town. In the same year he obtained a doctorate in medicine (MD) from the same university for a dissertation titled \"The treatment of tuberculous meningitis\".\n\nSoon after qualifying as a doctor, Barnard performed experiments on dogs investigating intestinal atresia, a birth defect which allows life-threatening gaps to develop in the intestines.  He followed a medical hunch that this was caused by inadequate blood flow to the fetus.  After nine months and forty-three attempts, Barnard was able to reproduce this condition in a fetus puppy by tying off some of the blood supply to a puppy's intestines and then placing the animal back in the womb, after which it was born some two weeks later, with the condition of intestinal atresia.  He was also able to cure the condition by removing the piece of intestine with inadequate blood supply.  The mistake of previous surgeons had been attempting to reconnect ends of intestine which themselves still had inadequate blood supply.  To be successful, it was typically necessary to remove between 15 and 20 centimeters of intestine (6 to 8 inches).  Jannie Louw used this innovation in a clinical setting, and Barnard's method saved the lives of ten babies in Cape Town.  This technique was also adapted by surgeons in Britain and the US.  In addition, Barnard analyzed 259 cases of tubercular meningitis.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT45&lpg\nPT45&dq%22Soon+after+qualifying+as+a+doctor,+Barnard+produced+a+staggering+piece+of+experimental+research%22&source\nbl&ots0sfG1rO1f1&sig\nnA43OxSj7yF1KpnylXq1K8yOp8Y&hlen&sa\nX&ved0ahUKEwiIkrSVnu3RAhUJxmMKHXvEB_QQ6AEIGjAA#v\nonepage&q%22Soon%20after%20qualifying%20as%20a%20doctor%2C%20Barnard%20produced%20a%20staggering%20piece%20of%20experimental%20research%22&f\nfalse pages 48–49].  \n\nOwen Wangensteen in Minnesota had been impressed by the work of Alan Thal, a young South African doctor working in Minnesota.  He asked Groote Schuur Head of Medicine John Brock if he might recommend any similarly talented South Africans and Brock recommended Barnard.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT47&dq\n%22In+December+1955,+Christiaan+Barnard+flew+to+the+city+of+snow%22&hlen&sa\nX&ved0ahUKEwiK3vTLo5DSAhVDMGMKHalQCt4Q6AEIGjAA#v\nonepage&q%22In%20December%201955%2C%20Christiaan%20Barnard%20flew%20to%20the%20city%20of%20snow%22&f\nfalse page 49].  In December 1955, Barnard travelled to the University of Minnesota, Minneapolis, United States, to begin a two-year scholarship under Chief of Surgery Wangensteen, who assigned Barnard more work on the intestines, which Barnard accepted even though he wanted to move onto something new.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT48&lpg\nPT48&dq%22Wangensteen+considered+gastrointestinal+research+to+be+intellectually+delicious%22&source\nbl&ots0sfI2oM_g3&sig\njPUPhhkvTYfmK5dlqON8uzv_nas&hlen&sa\nX&ved0ahUKEwi67cj_tKnSAhVIwWMKHVSsAZIQ6AEIHDAA#v\nonepage&q%22Wangensteen%20considered%20gastrointestinal%20research%20to%20be%20intellectually%20delicious%22&f\nfalse page 51].  Simply by luck, whenever Barnard needed a break from this work, he could wander across the hall and talk with Vince Gott who ran the lab for open-heart surgery pioneer Walt Lillehei.  Gott had begun to develop a technique of running blood backwards through the veins of the heart so Lillehei could more easily operate on the aortic valve (McRae writes, \"It was the type of inspired thinking that entranced Barnard\").  In March 1956, Gott asked Barnard to help him run the heart-lung machine for an operation.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT50&lpg\nPT50&dq%22Whenever+he+needed+a+break+from+the+gullet,+Barnard+wandered+across+the+hall%22&source\nbl&ots0sfI2oPW86&sig\n_mVcwW7qo08i8kXim2ERnySlu9k&hlen&sa\nX&ved0ahUKEwja28myvqnSAhVQ42MKHeTSBgsQ6AEIGjAA#v\nonepage&q%22Whenever%20he%20needed%20a%20break%20from%20the%20gullet%2C%20Barnard%20wandered%20across%20the%20hall%22&f\nfalse page 53].  Shortly thereafter, Wangensteen agreed to let Barnard switch to Lillehei's service.  It was during this time that Barnard first became acquainted with fellow future heart transplantation surgeon Norman Shumway.  Barnard also became friendly with Gil Campbell who had demonstrated that a dog's lung could be used to oxygenate blood during open-heart surgery.  (The year before Barnard arrived, Lillehei and Campbell had used this procedure for twenty minutes during surgery on a 13-year-old boy with ventricular septal defect, and the boy had made a full recovery.)  Barnard and Campbell met regularly for early breakfast.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT51&lpg\nPT51&dq%22the+South+African+relaxed+a+little+and+became+friendly+with+Gil+Campbell%22&source\nbl&ots0sfI2oS_9-&sig\n-StBQtHhsq9nLASuHfslCkY_HC4&hlen&sa\nX&ved0ahUKEwiZqJ6Jy6nSAhVGHGMKHbCpC5kQ6AEIGjAA#v\nonepage&q%22the%20South%20African%20relaxed%20a%20little%20and%20became%20friendly%20with%20Gil%20Campbell%22&f\nfalse page 54].  In 1958, Barnard received a Master of Science in Surgery for a thesis titled \"The aortic valve – problems in the fabrication and testing of a prosthetic valve\". The same year he was awarded a Ph.D. for his dissertation titled \"The aetiology of congenital intestinal atresia\". Barnard described the two years he spent in the United States as \"the most fascinating time in my life.\"\n\nUpon returning to South Africa in 1958, Barnard was appointed head of the Department of Experimental Surgery at Groote Schuur hospital, as well as holding a joint post at the University of Cape Town.Dictionary of African Biography, Volume 6, Emmanuel Kwaku Akyeampong, Henry Louis Gates, Jr., editors-in-chief,  [https://books.google.com/books?id39JMAgAAQBAJ&pg\nPA386&lpgPA386&dq\n%22as+well+as+surgical+work+and+teaching,+he+did+advanced+work+in+research+laboratories%22&sourcebl&ots\n1zei2rxyZr&sigAGMrRsI4d9USWLfdubmfPnb0SNg&hl\nen&saX&ved\n0ahUKEwjj0ejP3e_SAhUX1GMKHSQXCYIQ6AEIGjAA#vonepage&q\n%22as%20well%20as%20surgical%20work%20and%20teaching%2C%20he%20did%20advanced%20work%20in%20research%20laboratories%22&ffalse Barnard, Christiaan Neethling], Anne Digby, Oxford University Press, 2012.  He was promoted to full-time lecturer and Director of Surgical Research at the University of Cape Town. In 1960, he flew to Moscow in order to meet Vladimir Demikhov, a top expert on organ transplantsBosco, Teresio (1968) Uomini come noi, Società Editrice Internazionale (later he credited Demikhov's accomplishment saying that \"if there is a father of heart and lung transplantation then Demikhov certainly deserves this title.\")Fricke, T. A.; Konstantinov, I. E. (2013) [https://books.google.com/books?id\npejGYnnkddwC&pgPA82&redir_esc\ny#vonepage&q&f\nfalse Dawn and Evolution of Cardiac Procedures], Springer In 1961 he was appointed Head of the Division of Cardiothoracic Surgery at the teaching hospitals of the University of Cape Town. He rose to the position of Associate Professor in the Department of Surgery at the University of Cape Town in 1962. Barnard's younger brother Marius, who also studied medicine, eventually became Barnard's right-hand man at the department of Cardiac Surgery. Over time, Barnard became known as a brilliant surgeon with many contributions to the treatment of cardiac diseases, such as the Tetralogy of Fallot and Ebstein's anomaly. He was promoted to Professor of Surgical Science in the Department of Surgery at the University of Cape Town in 1972. In 1981, Barnard became a founding member of the World Cultural Council. Among the many awards he received over the years, he was named Professor Emeritus in 1984.\n\nHistorical context \n\nFollowing the first successful kidney transplant in 1953, in the United States, Barnard performed the second kidney transplant in South Africa in October 1967, the first being done in Johannesburg the previous year.\n\nOn 23 January 1964, James Hardy at the University of Mississippi Medical Center in Jackson, Mississippi, performed the world's first heart transplant and world's first cardiac xenotransplant by transplanting the heart of a chimpanzee into a desperately ill and dying man.  This heart did beat in the patient's chest for approximately 60 to 90 minutes.  The patient, Boyd Rush, died without ever regaining consciousness.[http://jamanetwork.com/journals/jama/article-abstract/1163619 Heart Transplantation in Man: Developmental Studies and Report of a Case], JAMA (Journal of the American Medical Association), James D. Hardy, MD; Carlos M. Chavez, MD; Fred D. Kurrus, MD; William A. Neely, MD; Sadan Eraslan, MD; M. Don Turner, PhD; Leonard W. Fabian, MD; Thaddeus D. Labecki, MD; 188(13): 1132-1140; 29 June 1964.[http://www.telegraph.co.uk/news/obituaries/1425080/James-Hardy.html James Hardy], Obituary, The Telegraph [UK], 20 March 2003.Every Second Counts, McRae, see Ch. 7 \"Mississippi Gambling\", esp. [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT109&dq\n%22Rush+was+in+a+comatose+state+with+only+a+faint+pulse%22&hlen&sa\nX&ved0ahUKEwjHmuLxhtDTAhUI3IMKHb3HBLgQ6AEIJjAA#v\nonepage&q%22Rush%20was%20in%20a%20comatose%20state%20with%20only%20a%20faint%20pulse%22&f\nfalse pages bottom 122 through 127] which talk about the 23 January 1964, operation in which surgeon James Hardy transplanted a chimp's heart into patient Boyd Rush.[https://www.umc.edu/Education/Schools/Medicine/Clinical_Science/Surgery/Dr__James_D__Hardy.aspx Dr. James D. Hardy], University of Mississippi Medical Center (Bio Sketch).\n\nBarnard had experimentally transplanted forty-eight hearts into dogs, which was about a fifth the number that Adrian Kantrowitz had performed at Maimonides Medical Center in New York and about a sixth the number Norman Shumway had performed at Stanford University in California.  Barnard had no dogs which had survived longer than ten days, unlike Kantrowitz and Shumway who had had dogs survive for more than a year.[https://www.theguardian.com/society/2006/jun/26/health.southafrica A new heart, a new era], The Guardian, Donald McRae, 25 June 2006.Every Second Counts, McRae, page 190.\n\nWith the availability of new breakthroughs introduced by several pioneers, also including Richard Lower at the Medical College of Virginia, several surgical teams were in a position to prepare for a human heart transplant.[https://profiles.nlm.nih.gov/ps/retrieve/Narrative/GN/p-nid/315 The Adrian Kantrowitz Papers, Replacing Hearts: Left Ventricle Assist Devices and Transplants, 1960–1970], National Institutes of Health, U.S. National Library of Medicine.  \"  .  .  Two Stanford surgeons, Norman Shumway and Richard Lower, had started transplanting dog hearts while experimenting with hypothermia during the late 1950s.  .  \" Barnard had a patient willing to undergo the procedure, but as with other surgeons, he needed a suitable donor.\n\nDuring the Apartheid era in South Africa, non-white persons and citizens were not given equal opportunities in the medical professions.  At Groote Schuur Hospital, Hamilton Naki was an informally taught surgeon.  He started out as a gardener and cleaner.  One day he was asked to help out with an experiment on a giraffe.  From this modest beginning, Naki became principal lab technician and taught hundredshttps://www.nytimes.com/2005/08/27/world/africa/accounts-of-south-africans-career-now-seen-as-overstated.html of surgeons, and assisted with Barnard's organ transplant program.  Barnard said, \"Hamilton Naki had better technical skills than I did.  He was a better craftsman than me, especially when it came to stitching, and had very good hands in the theatre\".  A popular myth, propagated principally by a widely discredited documentary film called Hidden HeartMcKay R. Heart movie skips a beat. Times Live (South Africa) 1 September 2009.  Berger S. Inspiring tale dismissed as 'rubbish.' The National (Abu Dhabi) 4 June 2009.October A. Dokkie 'verdraai' Barnard-verhaal.https://web.archive.org/web/20110723010408/http://www.sabcnews.co.za/SABCnews.com/Documents/SpecialAssignment/HEART-SCRIPT.pdf and an erroneous newspaper article , maintains incorrectly that Naki was present during the Washkansky transplant.[https://www.theguardian.com/world/2009/may/31/black-surgeon-first-heart-transplant Film on black surgeon in first heart transplant team rekindles controversy], The Guardian (UK), David Smith, 31 May 2009.  Refers to documentary film Hidden Heart about Hamilton Naki.\n\nFirst human-to-human heart transplant \n\nBarnard performed the world's first human-to-human heart transplant operation in the early morning hours of Sunday 3 December 1967.S Afr Med J, \"[http://www.grandroundsjournal.com/articles/gr049002/grhist-001-barnard.pdf A human cardiac transplant: an interim report of a successful operation performed at Groote Schuur Hospital, Cape Town]\", Barnard CN, 1967 Dec 30; 41(48): 1271–74.[http://articles.latimes.com/1988-03-20/magazine/tm-1895_1_cardiac-care Milestones in Cardiac Care], Los Angeles Times, Jill Gottesman, 20 March 1988. Louis Washkansky, a 54-year-old grocer who was suffering from diabetes and incurable heart disease, was the patient.[http://www.sciencemuseum.org.uk/broughttolife/people/louiswashkansky Louis Washkansky (1913–1967)], Science Museum.  Louis was born in Lithuania in 1913 and moved to South Africa in 1922.[http://www.haaretz.com/jewish/this-day-in-jewish-history/.premium-1.561467 1967: First Heart Transplant Patient Goes Under the Knife], Haaretz, This Day in Jewish History, David B. Green, 3 December 2013.  \"  .  .  When he was 9, his mother took him [Louis Washkansky] and his three siblings to Cape Town, to join their father, who had come ahead of the family  .  .  \"  Barnard was assisted by his brother Marius Barnard, as well as a team of thirty persons.  The operation lasted approximately five hours.Every Second Counts, McRae, 2006, pages 191–96.[http://www.sahistory.org.za/people/christiaan-neethling-barnard Christiaan Neethling Barnard], South African History Online, updated 11 January 2017.\n\nBarnard stated to Washkansky and his wife Ann Washkansky that the transplant had an 80% chance of success.[https://books.google.com/books?id\n10yfCgAAQBAJ&pgPA27&lpg\nPA27&dq%22calculated+risks%22+Barnard+Washkansky&source\nbl&otsFYxKViDZ9W&sig\nOt46od0J3PLFvTCq_rLo2XBqyrM&hlen&sa\nX&ved0ahUKEwi52_2X6LzQAhUCilQKHUXRDkIQ6AEIGzAA#v\nonepage&q%22calculated%20risks%22%20Barnard%20Washkansky&f\nfalse Calculated Risks: How to Know When Numbers Deceive You], Gerd Gigerenzer, Simon & Schuster, 2002.Every Second Counts, McRae, pages 176, 190.[https://books.google.com/books?idPbgzAAAAQBAJ&pg\nPA38&lpgPA38&dq\n%22Barnard's+failure+to+tell+Washkansky's+wife+that+her+husband+was+dying%22&sourcebl&ots\nIQXk2sdVJ9&sigcffx8FCmKtYRwNc4cj29VxifqPg&hl\nen&saX&ved\n0ahUKEwjB9YqA2OrSAhUB52MKHaZ9CkIQ6AEIGjAA#vonepage&q\n%22Barnard's%20failure%20to%20tell%20Washkansky's%20wife%20that%20her%20husband%20was%20dying%22&ffalse Ethics of Scientific Research], Kristin Shrader-Frechette, Rowman & Littlefield, 1994, page 38.  Along a similar line, this author states, \"Barnard's failure to tell Washkansky's wife that her husband was dying,\" although it's not clear whether this was pre- or post-transplant. This has been criticised by the ethicists Peter Singer and Helga Kuhse as making claims for chances of success to the patient and family which were \"unfounded\" and \"misleading\".[https://books.google.com/books?id_e03TWSl1OIC&pg\nPT542&lpgPT542&dq\n%22Barnard+gave+Washkansky+an+unfounded+and+misleading+assurance%22&sourcebl&ots\nWWHCNRbstw&sigba0P1vuCZpPrOckqOSbmqLTlXmY&hl\nen&saX&ved\n0ahUKEwjL-bqw6KnUAhWJLmMKHZDpAbkQ6AEIIjAA#vonepage&q\n%22Barnard%20gave%20Washkansky%20an%20unfounded%20and%20misleading%20assurance%22&f=false A Companion to Bioethics, Second Edition], Helga Kuhse, Peter Singer, Wiley-Blackwell, 2012.\n \nBarnard later wrote, \"For a dying man it is not a difficult decision because he knows he is at the end. If a lion chases you to the bank of a river filled with crocodiles, you will leap into the water, convinced you have a chance to swim to the other side.\" The donor heart came from a young woman, Denise Darvall, who had been rendered brain dead in an accident on 2 December 1967, while crossing a street in Cape Town. On examination at Groote Schuur hospital, Darvall had two serious fractures in her skull, with no electrical activity in her brain detected, and no sign of pain when ice water was poured into her ear.Every Second Counts, McRae, 2006, p. 188.  Coert Venter and Bertie Bosman requested permission from Darvall's father for Denise's heart to be used in the transplant attempt.Every Second Counts, McRae, [https://books.google.com/books?id\nnBYTCwAAQBAJ&pgPA189&lpg\nPA189&dq%22He+was+still+in+a+daze+when+Coert+Venter+knocked+gently%22&source\nbl&otseK3RGGCxdA&sig\nigcAK_m1D47HUZCvy3t1qlsOPTE&hlen&sa\nX&ved0ahUKEwj4mdywoejQAhXphlQKHTg4DccQ6AEIGjAA#v\nonepage&q%22He%20was%20still%20in%20a%20daze%20when%20Coert%20Venter%20knocked%20gently%22&f\nfalse page 189], \"Coert Venter . . [and] Bertie Bosman . . withdrew, stressing that he should take as long as he needed to consider their request.  They would understand if he declined to give his consent.\"  Edward Darvall took four minutes to reach his decision, mainly thinking about his daughter, including how she tried to help others.  He then told the doctors, \"If you can't save my daughter, you must try and save this man.\" The afternoon before his first transplant, Barnard dozed at his home while listening to music.  When he awoke, he decided to modify Shumway and Lower's technique.  Instead of cutting straight across the back of the atrial chambers of the donor heart, he would avoid damage to the septum and instead cut two small holes for the venae cavae and pulmonary veins.Every Second Counts, McRae, 2006, [https://books.google.com/books?id2Fv9dRT9TC4C&pg\nPT162&lpgPT162&dq\n%22Barnard+eventually+became+drowsy+and+he+drifted+in+and+out+of+sleep%22&sourcebl&ots\n0sfC-nP083&sigxGL_NszJxgKT5LeGYIbA5FZiREI&hl\nen&saX&ved\n0ahUKEwiIjOGE7vHQAhXmrVQKHdWDBkkQ6AEIGjAA#vonepage&q\n%22Barnard%20eventually%20became%20drowsy%20and%20he%20drifted%20in%20and%20out%20of%20sleep%22&ffalse page 187].  Prior to the transplant, rather than wait for Darvall's heart to stop beating, at his brother Marius Barnard's urging, Christiaan had injected potassium into her heart to paralyse it and render her technically dead by the whole-body standard. Twenty years later, Marius Barnard recounted, \"Chris stood there for a few moments, watching, then stood back and said, 'It works.'\"\n\nWashkansky survived the operation and lived for 18 days, having succumbed to pneumonia as he was taking immunosuppressive drugs.\n\nAdditional heart transplants \n\nBarnard was celebrated around the world for his accomplishment. He was photogenic, and enjoyed the media attention following the operation.\n\nWorldwide, approximately 100 transplants were performed by various doctors during 1968.[http://dspace.ucalgary.ca/bitstream/1880/48963/1/2009_HMD_Elzinga.pdf MAJOR MEDICAL MILESTONES LEADING UP TO THE FIRST HUMAN HEART TRANSPLANTATION], Kate Elzinga, from Proceedings of the 18th Annual History of Medicine Days Conference 2009: The University of Calgary Faculty of Medicine, Alberta, Canada, Cambridge Scholars Publishing, 2011. \" . . following Barnard's landmark heart transplantation on December 3, 1967, 107 human heart transplants were performed by 64 surgical teams in 24 countries in 1968. . \"  Only a third of these patients lived longer than three months.  A U.S. National Institutes of Health publication states, \"Within several years, only Shumway's team at Stanford was attempting transplants.\"\n\nBarnard's second transplant operation was conducted on 2 January 1968, and the patient, Philip Blaiberg, survived for 19 months.[http://archives.chicagotribune.com/1969/10/12/page/254/article/philip-blaiberg-was-dying-this-time-for-certain Philip Blaiberg was dying—this time for certain], Chicago Tribune, Mrs. Philip Blaiberg, 12 October 1969, page 68.  Dirk van Zyl, who received a new heart in 1971, was the longest-lived recipient, surviving over 23 years.\n\nBetween December 1967 and November 1974 at Groote Schuur Hospital in Cape Town, South Africa, ten heart transplants were performed, as well as a heart and lung transplant in 1971.  Of these ten patients, four lived longer than 18 months, with two of these four becoming long-term survivors.  One patient lived for over thirteen years and another for over twenty-four years.[http://www.samj.org.za/index.php/samj/article/view/5020/4123 Transplantation of the heart: An overview of 40 years' clinical and research experience at Groote Schuur Hospital and the University of Cape Town], South African Medical Journal, \"Part I. Surgical experience and clinical studies.\" J Hassoulas, Vol. 102, No. 6 (2012).\n\nFull recovery of donor heart function often takes place over hours or days, during which time considerable damage can occur.  Other deaths to patients can occur from preexisting conditions.  For example, in pulmonary hypertension the patient's right ventricle has often adapted to the higher pressure over time and, although diseased and hypertrophied, is often capable of maintaining circulation to the lungs.  Barnard designed the idea of the heterotopic (or \"piggy back\" transplant) in which the patient's diseased heart is left in place while the donor heart is added, essentially forming a \"double heart\".  Barnard performed the first such heterotopic heart transplant in 1974.[http://pmj.bmj.com/content/early/2016/07/27/postgradmedj-2016-134309.extract \"A tale of two hearts\"], Postgrad Medical Journal, 27 July 2016.  \"...  HHT [Heterotopic Heart Transplantation] involves transplanting the donor heart without removing the recipient heart, effectively forming a 'double heart'.  It was widely used in the pre-cyclosporine era when the donor was not strong enough (eg, the recipient had a much larger body) or the recipient had pre-existing pulmonary hypertension.  Christiaan Barnard performed the first HHT ('piggy back' transplant) in 1974 ...\"\n\nFrom November 1974 through December 1983, 49 consecutive heterotopic heart transplants on 43 patients were performed at Groote Schuur. The survival rate for patients at one year was over 60%, as compared to less than 40% with standard transplants, and the survival rate at five years was over 36% as compared to less than 20% with standard transplants.\n\nMany surgeons gave up cardiac transplantation due to poor results, often due to rejection of the transplanted heart by the patient's immune system. Barnard persisted until the advent of cyclosporine, an effective immunosuppressive drug, which helped revive the operation throughout the world. He also attempted xenotransplantation in a human patient, while attempting to save the life of a girl who was unable to leave artificial life support after her second aortic valve replacement.\n\nPublic life \n\nBarnard was an outspoken opponent of South Africa's laws of apartheid, and was not afraid to criticise his nation's government, although he had to temper his remarks to some extent to travel abroad.  Rather than leaving his homeland, he used his fame to campaign for a change in the law. Christiaan's brother, Marius Barnard, went into politics, and was elected to the legislature from Progressive Federal Party. Barnard later stated that the reason he never won the Nobel Prize in Physiology or Medicine was probably because he was a \"white South African\".[http://www.hinduonnet.com/fline/fl1422/14220850.htm \"It's the quality of survival that's important\"]. Hinduonnet.com (31 October 1997). Retrieved on 30 June 2015.\n\nShortly before his visit to Kenya in 1978, the following was written about his views regarding race relations in South Africa;\n\"While he believes in the participation of Africans in the political process of South Africa, he is opposed to a one-man-one-vote system in South Africa\".\n\nIn answering a hypothetical question on how he would solve the race problem were he a \"benevolent dictator in South Africa\", Barnard stated the following in a long interview at the Weekly Review:\n* While \"I would abolish Social discrimination\", political discrimination would continue. \n* He favoured the total division of the country along racial lines. His words were; \"I somehow feel ... but we may have to divide South Africa into two equal divisions\". In a followup question about where the coloured people would end up in that scenario, he replied that 'I would include them in the white South Africa\".\n* That coloured people have \"always been accepted\" among whites.\n* That \"the black man will not accept this view\" of universal suffrage.\n* That \"we are still out of the Olympic games\" despite the fact that \"in the field of sports where we have virtually integrated completely.\"\n* Regarding the Soweto uprising, he claimed it \"there was ... a lot of external stirring up of turbulence\". Regarding the anger from the black population when Steve Biko was murdered, he said that \"I think that something like $50,000 came in from outside to work up feelings at that funeral.\"\n* He stated that the National Party members were as upset about Biko's murder as were blacks; \"The white community was thoroughly upset, let me tell you. The nationalists themselves were very upset.\"\n\nThe interview ended with the following summary from he himself;\n\"I often say that, like King Lear, South Africa is a country more sinned against than sinning.\"\n\nPersonal life \n\nBarnard's first marriage was to Aletta Gertruida Louw, a nurse, whom he married in 1948 while practising medicine in Ceres. The couple had two children — Deirdre (born 1950) and Andre (1951–1984).\"[https://www.independent.co.uk/news/world/africa/christiaan-barnard-celebrated-pioneer-of-heart-transplant-surgery-dies-aged-78-667863.html Christiaan Barnard, celebrated pioneer of heart transplant surgery, dies aged 78]\", The Independent, 3 September 2001. Retrieved 18 September 2010. International fame took a toll on his personal life, and in 1969, Barnard and his wife divorced. In 1970, he married heiress Barbara Zoellner when she was 19, the same age as his son, and they had two children — Frederick (born 1972) and Christiaan Jr. (born 1974). He divorced Zoellner in 1982. Barnard married for a third time in 1988 to Karin Setzkorn, a young model. They also had two children, Armin (born 1989) and Lara (born 1997), but this last marriage also ended in divorce in 2000.\n\nBarnard described in his autobiography The Second Life a one-night extramarital affair with Italian film star Gina Lollobrigida, that occurred in January 1968. During that visit to Rome he received an audience from Pope Paul VI.\n\nIn October 2016, U.S. Congresswoman Ann McLane Kuster (D-NH) stated that Barnard sexually assaulted her when she was 23 years old. According to Kuster, he attempted to grope her under her skirt, while seated at a business luncheon with  Rep. Pete McCloskey (R-CA), whom she worked for at the time.http://www.dailyherald.com/article/20161013/news/310139819/http://www.nh1.com/news/rep-annie-kuster-tells-concord-monitor-famous-doctor-sexually-assaulted-her-decades-ago/https://www.usnews.com/news/politics/articles/2016-10-13/trump-comments-prompt-congresswoman-to-share-assault-story\n\nRetirement \n\nBarnard retired as Head of the Department of Cardiothoracic Surgery in Cape Town in 1983 after developing rheumatoid arthritis in his hands which ended his surgical career. He had struggled with arthritis since 1956, when it was diagnosed during his postgraduate work in the United States. After retirement, he spent two years as the Scientist-In-Residence at the Oklahoma Transplantation Institute in the United States and as an acting consultant for various institutions.\n\nHe had by this time become very interested in anti-aging research, and his reputation suffered in 1986 when he promoted Glycel, an expensive \"anti-aging\" skin cream, whose approval was withdrawn by the United States Food and Drug Administration soon thereafter. He also spent time as a research advisor to the Clinique la Prairie, in Switzerland, where the controversial \"rejuvenation therapy\" was practised.\n\nBarnard divided the remainder of his years between Austria, where he established the Christiaan Barnard Foundation, dedicated to helping underprivileged children throughout the world, and his game farm in Beaufort West, South Africa.\n\nDeath \n\nChristiaan Barnard died on 2 September 2001, while on holiday in Paphos, Cyprus. Early reports stated that he had died of a heart attack, but an autopsy showed his death was caused by a severe asthma attack.\n\nBooks\n\nChristiaan Barnard wrote two autobiographies. His first book, One Life, was published in 1969 () and sold copies worldwide. Some of the proceeds were used to set up the Chris Barnard Fund for research into heart disease and heart transplants in Cape Town. His second autobiography, The Second Life, was published in 1993, eight years before his death ().\n\nApart from his autobiographies, Dr Barnard also wrote several other books including:\n*The Donor\n*Your Healthy Heart\n*In The Night Season\n*The Best Medicine\n*Arthritis Handbook: How to Live With Arthritis\n*Good Life Good Death: A Doctor's Case for Euthanasia and Suicide\n*South Africa: Sharp Dissection\n*50 Ways to a Healthy Heart\n*Body Machine",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Christiaan Barnard" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7015" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Christiaan Neethling Barnard (8 November 1922 – 2 September 2001) was a South African cardiac surgeon who performed the world's first human-to-human heart transplant on 3 December 1967 at Groote Schuur Hospital in Cape Town, South Africa.  Growing up in Beaufort West, Cape Province, he studied medicine and practised for several years in his native country.  As a young doctor experimenting on dogs, Barnard developed a remedy for the infant defect of intestinal atresia.  His technique saved the lives of ten babies in Cape Town and was adopted by surgeons in Britain and the United States.  In 1955, he travelled to the United States and was initially assigned further gastrointestinal work by Owen Wangensteen.  He was introduced to the heart-lung machine, and Barnard was allowed to transfer to the service run by open heart surgery pioneer Walt Lillehei. Upon returning to South Africa in 1958, Barnard was appointed head of the Department of Experimental Surgery at the Groote Schuur Hospital, Cape Town.\n\nOn 3 December 1967, Barnard transplanted the heart of Denise Darvall, who had just died from a head injury, into the chest of a 54-year-old Louis Washkansky.  Washkansky regained full consciousness and lived for eighteen days, even spending time with his wife, before he died of pneumonia, with the suppression of his immune system by the anti-rejection drugs being a major contributing factor.  Barnard had told Mr. and Mrs. Washkansky that the operation had an 80% chance of success, a claim which has been criticised as misleading.\n\nBarnard's second transplant patient Philip Blaiberg, with the operation performed at the beginning of 1968, lived for nineteen months and was able to go home from the hospital.\n\nHe retired as Head of the Department of Cardiothoracic Surgery in Cape Town in 1983 after developing rheumatoid arthritis in his hands which ended his surgical career. He became interested in anti-aging research, and in 1986 his reputation suffered when he promoted Glycel, an expensive \"anti-aging\" skin cream, whose approval was withdrawn by the United States Food and Drug Administration soon thereafter. During his remaining years, he established the Christiaan Barnard Foundation, dedicated to helping underprivileged children throughout the world. He died in 2001 at the age of 78 after an asthma attack.\n\nEarly life \n\nBarnard grew up in Beaufort West, Cape Province, Union of South Africa. His father, Adam Barnard, was a minister in the Dutch Reformed Church. One of his four brothers, Abraham, was a \"blue baby\" who died of a heart problem at the age of three (Barnard would later guess that it was tetralogy of Fallot).  The family also experienced the loss of a daughter who was stillborn and who had been the fraternal twin of Barnard's older brother Johannes, who was twelve years older than Chris.Every Second Counts, McRae [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT44&lpg\nPT44&dq%22Chris+and+Marius+often+felt+that+she+was+grieving+over+the+loss+of+her+only+daughter%22&source\nbl&ots0sfG2pL-b5&sig\nAHk7xZK5s6ocBHV7gUmxq6fKvao&hlen&sa\nX&ved0ahUKEwiJ-8GRvO_RAhUnw1QKHS1rDakQ6AEIGjAA#v\nonepage&q%22Chris%20and%20Marius%20often%20felt%20that%20she%20was%20grieving%20over%20the%20loss%20of%20her%20only%20daughter%22&f\nfalse page 46]. Barnard matriculated from the Beaufort West High School in 1940, and went to study medicine at the University of Cape Town Medical School, where he obtained his MB ChB in 1945.\n\nHis father served as a missionary to mixed-race peoples.  His mother, the former Maria Elisabeth de Swart, instilled in the surviving brothers the belief that they could do anything they set their minds to.\n\nCareer\n\nBarnard did his internship and residency at the Groote Schuur Hospital in Cape Town, after which he worked as a general practitioner in Ceres, a rural town in the Cape Province.Every Second Counts: The Race to Transplant the First Human Heart, Donald McRae, New York: Penguin (Berkley/Putnam), 2006.  See esp. Ch. 10 \"The Wait\" and Ch. 11 \"Fame and Heartbreak,\" pages 173–214. In 1951, he returned to Cape Town where he worked at the City Hospital as a Senior Resident Medical Officer, and in the Department of Medicine at the Groote Schuur Hospital as a registrar. He completed his master's degree, receiving Master of Medicine in 1953 from the University of Cape Town. In the same year he obtained a doctorate in medicine (MD) from the same university for a dissertation titled \"The treatment of tuberculous meningitis\".\n\nSoon after qualifying as a doctor, Barnard performed experiments on dogs investigating intestinal atresia, a birth defect which allows life-threatening gaps to develop in the intestines.  He followed a medical hunch that this was caused by inadequate blood flow to the fetus.  After nine months and forty-three attempts, Barnard was able to reproduce this condition in a fetus puppy by tying off some of the blood supply to a puppy's intestines and then placing the animal back in the womb, after which it was born some two weeks later, with the condition of intestinal atresia.  He was also able to cure the condition by removing the piece of intestine with inadequate blood supply.  The mistake of previous surgeons had been attempting to reconnect ends of intestine which themselves still had inadequate blood supply.  To be successful, it was typically necessary to remove between 15 and 20 centimeters of intestine (6 to 8 inches).  Jannie Louw used this innovation in a clinical setting, and Barnard's method saved the lives of ten babies in Cape Town.  This technique was also adapted by surgeons in Britain and the US.  In addition, Barnard analyzed 259 cases of tubercular meningitis.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT45&lpg\nPT45&dq%22Soon+after+qualifying+as+a+doctor,+Barnard+produced+a+staggering+piece+of+experimental+research%22&source\nbl&ots0sfG1rO1f1&sig\nnA43OxSj7yF1KpnylXq1K8yOp8Y&hlen&sa\nX&ved0ahUKEwiIkrSVnu3RAhUJxmMKHXvEB_QQ6AEIGjAA#v\nonepage&q%22Soon%20after%20qualifying%20as%20a%20doctor%2C%20Barnard%20produced%20a%20staggering%20piece%20of%20experimental%20research%22&f\nfalse pages 48–49].  \n\nOwen Wangensteen in Minnesota had been impressed by the work of Alan Thal, a young South African doctor working in Minnesota.  He asked Groote Schuur Head of Medicine John Brock if he might recommend any similarly talented South Africans and Brock recommended Barnard.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT47&dq\n%22In+December+1955,+Christiaan+Barnard+flew+to+the+city+of+snow%22&hlen&sa\nX&ved0ahUKEwiK3vTLo5DSAhVDMGMKHalQCt4Q6AEIGjAA#v\nonepage&q%22In%20December%201955%2C%20Christiaan%20Barnard%20flew%20to%20the%20city%20of%20snow%22&f\nfalse page 49].  In December 1955, Barnard travelled to the University of Minnesota, Minneapolis, United States, to begin a two-year scholarship under Chief of Surgery Wangensteen, who assigned Barnard more work on the intestines, which Barnard accepted even though he wanted to move onto something new.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT48&lpg\nPT48&dq%22Wangensteen+considered+gastrointestinal+research+to+be+intellectually+delicious%22&source\nbl&ots0sfI2oM_g3&sig\njPUPhhkvTYfmK5dlqON8uzv_nas&hlen&sa\nX&ved0ahUKEwi67cj_tKnSAhVIwWMKHVSsAZIQ6AEIHDAA#v\nonepage&q%22Wangensteen%20considered%20gastrointestinal%20research%20to%20be%20intellectually%20delicious%22&f\nfalse page 51].  Simply by luck, whenever Barnard needed a break from this work, he could wander across the hall and talk with Vince Gott who ran the lab for open-heart surgery pioneer Walt Lillehei.  Gott had begun to develop a technique of running blood backwards through the veins of the heart so Lillehei could more easily operate on the aortic valve (McRae writes, \"It was the type of inspired thinking that entranced Barnard\").  In March 1956, Gott asked Barnard to help him run the heart-lung machine for an operation.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT50&lpg\nPT50&dq%22Whenever+he+needed+a+break+from+the+gullet,+Barnard+wandered+across+the+hall%22&source\nbl&ots0sfI2oPW86&sig\n_mVcwW7qo08i8kXim2ERnySlu9k&hlen&sa\nX&ved0ahUKEwja28myvqnSAhVQ42MKHeTSBgsQ6AEIGjAA#v\nonepage&q%22Whenever%20he%20needed%20a%20break%20from%20the%20gullet%2C%20Barnard%20wandered%20across%20the%20hall%22&f\nfalse page 53].  Shortly thereafter, Wangensteen agreed to let Barnard switch to Lillehei's service.  It was during this time that Barnard first became acquainted with fellow future heart transplantation surgeon Norman Shumway.  Barnard also became friendly with Gil Campbell who had demonstrated that a dog's lung could be used to oxygenate blood during open-heart surgery.  (The year before Barnard arrived, Lillehei and Campbell had used this procedure for twenty minutes during surgery on a 13-year-old boy with ventricular septal defect, and the boy had made a full recovery.)  Barnard and Campbell met regularly for early breakfast.Every Second Counts, McRae, [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT51&lpg\nPT51&dq%22the+South+African+relaxed+a+little+and+became+friendly+with+Gil+Campbell%22&source\nbl&ots0sfI2oS_9-&sig\n-StBQtHhsq9nLASuHfslCkY_HC4&hlen&sa\nX&ved0ahUKEwiZqJ6Jy6nSAhVGHGMKHbCpC5kQ6AEIGjAA#v\nonepage&q%22the%20South%20African%20relaxed%20a%20little%20and%20became%20friendly%20with%20Gil%20Campbell%22&f\nfalse page 54].  In 1958, Barnard received a Master of Science in Surgery for a thesis titled \"The aortic valve – problems in the fabrication and testing of a prosthetic valve\". The same year he was awarded a Ph.D. for his dissertation titled \"The aetiology of congenital intestinal atresia\". Barnard described the two years he spent in the United States as \"the most fascinating time in my life.\"\n\nUpon returning to South Africa in 1958, Barnard was appointed head of the Department of Experimental Surgery at Groote Schuur hospital, as well as holding a joint post at the University of Cape Town.Dictionary of African Biography, Volume 6, Emmanuel Kwaku Akyeampong, Henry Louis Gates, Jr., editors-in-chief,  [https://books.google.com/books?id39JMAgAAQBAJ&pg\nPA386&lpgPA386&dq\n%22as+well+as+surgical+work+and+teaching,+he+did+advanced+work+in+research+laboratories%22&sourcebl&ots\n1zei2rxyZr&sigAGMrRsI4d9USWLfdubmfPnb0SNg&hl\nen&saX&ved\n0ahUKEwjj0ejP3e_SAhUX1GMKHSQXCYIQ6AEIGjAA#vonepage&q\n%22as%20well%20as%20surgical%20work%20and%20teaching%2C%20he%20did%20advanced%20work%20in%20research%20laboratories%22&ffalse Barnard, Christiaan Neethling], Anne Digby, Oxford University Press, 2012.  He was promoted to full-time lecturer and Director of Surgical Research at the University of Cape Town. In 1960, he flew to Moscow in order to meet Vladimir Demikhov, a top expert on organ transplantsBosco, Teresio (1968) Uomini come noi, Società Editrice Internazionale (later he credited Demikhov's accomplishment saying that \"if there is a father of heart and lung transplantation then Demikhov certainly deserves this title.\")Fricke, T. A.; Konstantinov, I. E. (2013) [https://books.google.com/books?id\npejGYnnkddwC&pgPA82&redir_esc\ny#vonepage&q&f\nfalse Dawn and Evolution of Cardiac Procedures], Springer In 1961 he was appointed Head of the Division of Cardiothoracic Surgery at the teaching hospitals of the University of Cape Town. He rose to the position of Associate Professor in the Department of Surgery at the University of Cape Town in 1962. Barnard's younger brother Marius, who also studied medicine, eventually became Barnard's right-hand man at the department of Cardiac Surgery. Over time, Barnard became known as a brilliant surgeon with many contributions to the treatment of cardiac diseases, such as the Tetralogy of Fallot and Ebstein's anomaly. He was promoted to Professor of Surgical Science in the Department of Surgery at the University of Cape Town in 1972. In 1981, Barnard became a founding member of the World Cultural Council. Among the many awards he received over the years, he was named Professor Emeritus in 1984.\n\nHistorical context \n\nFollowing the first successful kidney transplant in 1953, in the United States, Barnard performed the second kidney transplant in South Africa in October 1967, the first being done in Johannesburg the previous year.\n\nOn 23 January 1964, James Hardy at the University of Mississippi Medical Center in Jackson, Mississippi, performed the world's first heart transplant and world's first cardiac xenotransplant by transplanting the heart of a chimpanzee into a desperately ill and dying man.  This heart did beat in the patient's chest for approximately 60 to 90 minutes.  The patient, Boyd Rush, died without ever regaining consciousness.[http://jamanetwork.com/journals/jama/article-abstract/1163619 Heart Transplantation in Man: Developmental Studies and Report of a Case], JAMA (Journal of the American Medical Association), James D. Hardy, MD; Carlos M. Chavez, MD; Fred D. Kurrus, MD; William A. Neely, MD; Sadan Eraslan, MD; M. Don Turner, PhD; Leonard W. Fabian, MD; Thaddeus D. Labecki, MD; 188(13): 1132-1140; 29 June 1964.[http://www.telegraph.co.uk/news/obituaries/1425080/James-Hardy.html James Hardy], Obituary, The Telegraph [UK], 20 March 2003.Every Second Counts, McRae, see Ch. 7 \"Mississippi Gambling\", esp. [https://books.google.com/books?id\n2Fv9dRT9TC4C&pgPT109&dq\n%22Rush+was+in+a+comatose+state+with+only+a+faint+pulse%22&hlen&sa\nX&ved0ahUKEwjHmuLxhtDTAhUI3IMKHb3HBLgQ6AEIJjAA#v\nonepage&q%22Rush%20was%20in%20a%20comatose%20state%20with%20only%20a%20faint%20pulse%22&f\nfalse pages bottom 122 through 127] which talk about the 23 January 1964, operation in which surgeon James Hardy transplanted a chimp's heart into patient Boyd Rush.[https://www.umc.edu/Education/Schools/Medicine/Clinical_Science/Surgery/Dr__James_D__Hardy.aspx Dr. James D. Hardy], University of Mississippi Medical Center (Bio Sketch).\n\nBarnard had experimentally transplanted forty-eight hearts into dogs, which was about a fifth the number that Adrian Kantrowitz had performed at Maimonides Medical Center in New York and about a sixth the number Norman Shumway had performed at Stanford University in California.  Barnard had no dogs which had survived longer than ten days, unlike Kantrowitz and Shumway who had had dogs survive for more than a year.[https://www.theguardian.com/society/2006/jun/26/health.southafrica A new heart, a new era], The Guardian, Donald McRae, 25 June 2006.Every Second Counts, McRae, page 190.\n\nWith the availability of new breakthroughs introduced by several pioneers, also including Richard Lower at the Medical College of Virginia, several surgical teams were in a position to prepare for a human heart transplant.[https://profiles.nlm.nih.gov/ps/retrieve/Narrative/GN/p-nid/315 The Adrian Kantrowitz Papers, Replacing Hearts: Left Ventricle Assist Devices and Transplants, 1960–1970], National Institutes of Health, U.S. National Library of Medicine.  \"  .  .  Two Stanford surgeons, Norman Shumway and Richard Lower, had started transplanting dog hearts while experimenting with hypothermia during the late 1950s.  .  \" Barnard had a patient willing to undergo the procedure, but as with other surgeons, he needed a suitable donor.\n\nDuring the Apartheid era in South Africa, non-white persons and citizens were not given equal opportunities in the medical professions.  At Groote Schuur Hospital, Hamilton Naki was an informally taught surgeon.  He started out as a gardener and cleaner.  One day he was asked to help out with an experiment on a giraffe.  From this modest beginning, Naki became principal lab technician and taught hundredshttps://www.nytimes.com/2005/08/27/world/africa/accounts-of-south-africans-career-now-seen-as-overstated.html of surgeons, and assisted with Barnard's organ transplant program.  Barnard said, \"Hamilton Naki had better technical skills than I did.  He was a better craftsman than me, especially when it came to stitching, and had very good hands in the theatre\".  A popular myth, propagated principally by a widely discredited documentary film called Hidden HeartMcKay R. Heart movie skips a beat. Times Live (South Africa) 1 September 2009.  Berger S. Inspiring tale dismissed as 'rubbish.' The National (Abu Dhabi) 4 June 2009.October A. Dokkie 'verdraai' Barnard-verhaal.https://web.archive.org/web/20110723010408/http://www.sabcnews.co.za/SABCnews.com/Documents/SpecialAssignment/HEART-SCRIPT.pdf and an erroneous newspaper article , maintains incorrectly that Naki was present during the Washkansky transplant.[https://www.theguardian.com/world/2009/may/31/black-surgeon-first-heart-transplant Film on black surgeon in first heart transplant team rekindles controversy], The Guardian (UK), David Smith, 31 May 2009.  Refers to documentary film Hidden Heart about Hamilton Naki.\n\nFirst human-to-human heart transplant \n\nBarnard performed the world's first human-to-human heart transplant operation in the early morning hours of Sunday 3 December 1967.S Afr Med J, \"[http://www.grandroundsjournal.com/articles/gr049002/grhist-001-barnard.pdf A human cardiac transplant: an interim report of a successful operation performed at Groote Schuur Hospital, Cape Town]\", Barnard CN, 1967 Dec 30; 41(48): 1271–74.[http://articles.latimes.com/1988-03-20/magazine/tm-1895_1_cardiac-care Milestones in Cardiac Care], Los Angeles Times, Jill Gottesman, 20 March 1988. Louis Washkansky, a 54-year-old grocer who was suffering from diabetes and incurable heart disease, was the patient.[http://www.sciencemuseum.org.uk/broughttolife/people/louiswashkansky Louis Washkansky (1913–1967)], Science Museum.  Louis was born in Lithuania in 1913 and moved to South Africa in 1922.[http://www.haaretz.com/jewish/this-day-in-jewish-history/.premium-1.561467 1967: First Heart Transplant Patient Goes Under the Knife], Haaretz, This Day in Jewish History, David B. Green, 3 December 2013.  \"  .  .  When he was 9, his mother took him [Louis Washkansky] and his three siblings to Cape Town, to join their father, who had come ahead of the family  .  .  \"  Barnard was assisted by his brother Marius Barnard, as well as a team of thirty persons.  The operation lasted approximately five hours.Every Second Counts, McRae, 2006, pages 191–96.[http://www.sahistory.org.za/people/christiaan-neethling-barnard Christiaan Neethling Barnard], South African History Online, updated 11 January 2017.\n\nBarnard stated to Washkansky and his wife Ann Washkansky that the transplant had an 80% chance of success.[https://books.google.com/books?id\n10yfCgAAQBAJ&pgPA27&lpg\nPA27&dq%22calculated+risks%22+Barnard+Washkansky&source\nbl&otsFYxKViDZ9W&sig\nOt46od0J3PLFvTCq_rLo2XBqyrM&hlen&sa\nX&ved0ahUKEwi52_2X6LzQAhUCilQKHUXRDkIQ6AEIGzAA#v\nonepage&q%22calculated%20risks%22%20Barnard%20Washkansky&f\nfalse Calculated Risks: How to Know When Numbers Deceive You], Gerd Gigerenzer, Simon & Schuster, 2002.Every Second Counts, McRae, pages 176, 190.[https://books.google.com/books?idPbgzAAAAQBAJ&pg\nPA38&lpgPA38&dq\n%22Barnard's+failure+to+tell+Washkansky's+wife+that+her+husband+was+dying%22&sourcebl&ots\nIQXk2sdVJ9&sigcffx8FCmKtYRwNc4cj29VxifqPg&hl\nen&saX&ved\n0ahUKEwjB9YqA2OrSAhUB52MKHaZ9CkIQ6AEIGjAA#vonepage&q\n%22Barnard's%20failure%20to%20tell%20Washkansky's%20wife%20that%20her%20husband%20was%20dying%22&ffalse Ethics of Scientific Research], Kristin Shrader-Frechette, Rowman & Littlefield, 1994, page 38.  Along a similar line, this author states, \"Barnard's failure to tell Washkansky's wife that her husband was dying,\" although it's not clear whether this was pre- or post-transplant. This has been criticised by the ethicists Peter Singer and Helga Kuhse as making claims for chances of success to the patient and family which were \"unfounded\" and \"misleading\".[https://books.google.com/books?id_e03TWSl1OIC&pg\nPT542&lpgPT542&dq\n%22Barnard+gave+Washkansky+an+unfounded+and+misleading+assurance%22&sourcebl&ots\nWWHCNRbstw&sigba0P1vuCZpPrOckqOSbmqLTlXmY&hl\nen&saX&ved\n0ahUKEwjL-bqw6KnUAhWJLmMKHZDpAbkQ6AEIIjAA#vonepage&q\n%22Barnard%20gave%20Washkansky%20an%20unfounded%20and%20misleading%20assurance%22&f=false A Companion to Bioethics, Second Edition], Helga Kuhse, Peter Singer, Wiley-Blackwell, 2012.\n \nBarnard later wrote, \"For a dying man it is not a difficult decision because he knows he is at the end. If a lion chases you to the bank of a river filled with crocodiles, you will leap into the water, convinced you have a chance to swim to the other side.\" The donor heart came from a young woman, Denise Darvall, who had been rendered brain dead in an accident on 2 December 1967, while crossing a street in Cape Town. On examination at Groote Schuur hospital, Darvall had two serious fractures in her skull, with no electrical activity in her brain detected, and no sign of pain when ice water was poured into her ear.Every Second Counts, McRae, 2006, p. 188.  Coert Venter and Bertie Bosman requested permission from Darvall's father for Denise's heart to be used in the transplant attempt.Every Second Counts, McRae, [https://books.google.com/books?id\nnBYTCwAAQBAJ&pgPA189&lpg\nPA189&dq%22He+was+still+in+a+daze+when+Coert+Venter+knocked+gently%22&source\nbl&otseK3RGGCxdA&sig\nigcAK_m1D47HUZCvy3t1qlsOPTE&hlen&sa\nX&ved0ahUKEwj4mdywoejQAhXphlQKHTg4DccQ6AEIGjAA#v\nonepage&q%22He%20was%20still%20in%20a%20daze%20when%20Coert%20Venter%20knocked%20gently%22&f\nfalse page 189], \"Coert Venter . . [and] Bertie Bosman . . withdrew, stressing that he should take as long as he needed to consider their request.  They would understand if he declined to give his consent.\"  Edward Darvall took four minutes to reach his decision, mainly thinking about his daughter, including how she tried to help others.  He then told the doctors, \"If you can't save my daughter, you must try and save this man.\" The afternoon before his first transplant, Barnard dozed at his home while listening to music.  When he awoke, he decided to modify Shumway and Lower's technique.  Instead of cutting straight across the back of the atrial chambers of the donor heart, he would avoid damage to the septum and instead cut two small holes for the venae cavae and pulmonary veins.Every Second Counts, McRae, 2006, [https://books.google.com/books?id2Fv9dRT9TC4C&pg\nPT162&lpgPT162&dq\n%22Barnard+eventually+became+drowsy+and+he+drifted+in+and+out+of+sleep%22&sourcebl&ots\n0sfC-nP083&sigxGL_NszJxgKT5LeGYIbA5FZiREI&hl\nen&saX&ved\n0ahUKEwiIjOGE7vHQAhXmrVQKHdWDBkkQ6AEIGjAA#vonepage&q\n%22Barnard%20eventually%20became%20drowsy%20and%20he%20drifted%20in%20and%20out%20of%20sleep%22&ffalse page 187].  Prior to the transplant, rather than wait for Darvall's heart to stop beating, at his brother Marius Barnard's urging, Christiaan had injected potassium into her heart to paralyse it and render her technically dead by the whole-body standard. Twenty years later, Marius Barnard recounted, \"Chris stood there for a few moments, watching, then stood back and said, 'It works.'\"\n\nWashkansky survived the operation and lived for 18 days, having succumbed to pneumonia as he was taking immunosuppressive drugs.\n\nAdditional heart transplants \n\nBarnard was celebrated around the world for his accomplishment. He was photogenic, and enjoyed the media attention following the operation.\n\nWorldwide, approximately 100 transplants were performed by various doctors during 1968.[http://dspace.ucalgary.ca/bitstream/1880/48963/1/2009_HMD_Elzinga.pdf MAJOR MEDICAL MILESTONES LEADING UP TO THE FIRST HUMAN HEART TRANSPLANTATION], Kate Elzinga, from Proceedings of the 18th Annual History of Medicine Days Conference 2009: The University of Calgary Faculty of Medicine, Alberta, Canada, Cambridge Scholars Publishing, 2011. \" . . following Barnard's landmark heart transplantation on December 3, 1967, 107 human heart transplants were performed by 64 surgical teams in 24 countries in 1968. . \"  Only a third of these patients lived longer than three months.  A U.S. National Institutes of Health publication states, \"Within several years, only Shumway's team at Stanford was attempting transplants.\"\n\nBarnard's second transplant operation was conducted on 2 January 1968, and the patient, Philip Blaiberg, survived for 19 months.[http://archives.chicagotribune.com/1969/10/12/page/254/article/philip-blaiberg-was-dying-this-time-for-certain Philip Blaiberg was dying—this time for certain], Chicago Tribune, Mrs. Philip Blaiberg, 12 October 1969, page 68.  Dirk van Zyl, who received a new heart in 1971, was the longest-lived recipient, surviving over 23 years.\n\nBetween December 1967 and November 1974 at Groote Schuur Hospital in Cape Town, South Africa, ten heart transplants were performed, as well as a heart and lung transplant in 1971.  Of these ten patients, four lived longer than 18 months, with two of these four becoming long-term survivors.  One patient lived for over thirteen years and another for over twenty-four years.[http://www.samj.org.za/index.php/samj/article/view/5020/4123 Transplantation of the heart: An overview of 40 years' clinical and research experience at Groote Schuur Hospital and the University of Cape Town], South African Medical Journal, \"Part I. Surgical experience and clinical studies.\" J Hassoulas, Vol. 102, No. 6 (2012).\n\nFull recovery of donor heart function often takes place over hours or days, during which time considerable damage can occur.  Other deaths to patients can occur from preexisting conditions.  For example, in pulmonary hypertension the patient's right ventricle has often adapted to the higher pressure over time and, although diseased and hypertrophied, is often capable of maintaining circulation to the lungs.  Barnard designed the idea of the heterotopic (or \"piggy back\" transplant) in which the patient's diseased heart is left in place while the donor heart is added, essentially forming a \"double heart\".  Barnard performed the first such heterotopic heart transplant in 1974.[http://pmj.bmj.com/content/early/2016/07/27/postgradmedj-2016-134309.extract \"A tale of two hearts\"], Postgrad Medical Journal, 27 July 2016.  \"...  HHT [Heterotopic Heart Transplantation] involves transplanting the donor heart without removing the recipient heart, effectively forming a 'double heart'.  It was widely used in the pre-cyclosporine era when the donor was not strong enough (eg, the recipient had a much larger body) or the recipient had pre-existing pulmonary hypertension.  Christiaan Barnard performed the first HHT ('piggy back' transplant) in 1974 ...\"\n\nFrom November 1974 through December 1983, 49 consecutive heterotopic heart transplants on 43 patients were performed at Groote Schuur. The survival rate for patients at one year was over 60%, as compared to less than 40% with standard transplants, and the survival rate at five years was over 36% as compared to less than 20% with standard transplants.\n\nMany surgeons gave up cardiac transplantation due to poor results, often due to rejection of the transplanted heart by the patient's immune system. Barnard persisted until the advent of cyclosporine, an effective immunosuppressive drug, which helped revive the operation throughout the world. He also attempted xenotransplantation in a human patient, while attempting to save the life of a girl who was unable to leave artificial life support after her second aortic valve replacement.\n\nPublic life \n\nBarnard was an outspoken opponent of South Africa's laws of apartheid, and was not afraid to criticise his nation's government, although he had to temper his remarks to some extent to travel abroad.  Rather than leaving his homeland, he used his fame to campaign for a change in the law. Christiaan's brother, Marius Barnard, went into politics, and was elected to the legislature from Progressive Federal Party. Barnard later stated that the reason he never won the Nobel Prize in Physiology or Medicine was probably because he was a \"white South African\".[http://www.hinduonnet.com/fline/fl1422/14220850.htm \"It's the quality of survival that's important\"]. Hinduonnet.com (31 October 1997). Retrieved on 30 June 2015.\n\nShortly before his visit to Kenya in 1978, the following was written about his views regarding race relations in South Africa;\n\"While he believes in the participation of Africans in the political process of South Africa, he is opposed to a one-man-one-vote system in South Africa\".\n\nIn answering a hypothetical question on how he would solve the race problem were he a \"benevolent dictator in South Africa\", Barnard stated the following in a long interview at the Weekly Review:\n* While \"I would abolish Social discrimination\", political discrimination would continue. \n* He favoured the total division of the country along racial lines. His words were; \"I somehow feel ... but we may have to divide South Africa into two equal divisions\". In a followup question about where the coloured people would end up in that scenario, he replied that 'I would include them in the white South Africa\".\n* That coloured people have \"always been accepted\" among whites.\n* That \"the black man will not accept this view\" of universal suffrage.\n* That \"we are still out of the Olympic games\" despite the fact that \"in the field of sports where we have virtually integrated completely.\"\n* Regarding the Soweto uprising, he claimed it \"there was ... a lot of external stirring up of turbulence\". Regarding the anger from the black population when Steve Biko was murdered, he said that \"I think that something like $50,000 came in from outside to work up feelings at that funeral.\"\n* He stated that the National Party members were as upset about Biko's murder as were blacks; \"The white community was thoroughly upset, let me tell you. The nationalists themselves were very upset.\"\n\nThe interview ended with the following summary from he himself;\n\"I often say that, like King Lear, South Africa is a country more sinned against than sinning.\"\n\nPersonal life \n\nBarnard's first marriage was to Aletta Gertruida Louw, a nurse, whom he married in 1948 while practising medicine in Ceres. The couple had two children — Deirdre (born 1950) and Andre (1951–1984).\"[https://www.independent.co.uk/news/world/africa/christiaan-barnard-celebrated-pioneer-of-heart-transplant-surgery-dies-aged-78-667863.html Christiaan Barnard, celebrated pioneer of heart transplant surgery, dies aged 78]\", The Independent, 3 September 2001. Retrieved 18 September 2010. International fame took a toll on his personal life, and in 1969, Barnard and his wife divorced. In 1970, he married heiress Barbara Zoellner when she was 19, the same age as his son, and they had two children — Frederick (born 1972) and Christiaan Jr. (born 1974). He divorced Zoellner in 1982. Barnard married for a third time in 1988 to Karin Setzkorn, a young model. They also had two children, Armin (born 1989) and Lara (born 1997), but this last marriage also ended in divorce in 2000.\n\nBarnard described in his autobiography The Second Life a one-night extramarital affair with Italian film star Gina Lollobrigida, that occurred in January 1968. During that visit to Rome he received an audience from Pope Paul VI.\n\nIn October 2016, U.S. Congresswoman Ann McLane Kuster (D-NH) stated that Barnard sexually assaulted her when she was 23 years old. According to Kuster, he attempted to grope her under her skirt, while seated at a business luncheon with  Rep. Pete McCloskey (R-CA), whom she worked for at the time.http://www.dailyherald.com/article/20161013/news/310139819/http://www.nh1.com/news/rep-annie-kuster-tells-concord-monitor-famous-doctor-sexually-assaulted-her-decades-ago/https://www.usnews.com/news/politics/articles/2016-10-13/trump-comments-prompt-congresswoman-to-share-assault-story\n\nRetirement \n\nBarnard retired as Head of the Department of Cardiothoracic Surgery in Cape Town in 1983 after developing rheumatoid arthritis in his hands which ended his surgical career. He had struggled with arthritis since 1956, when it was diagnosed during his postgraduate work in the United States. After retirement, he spent two years as the Scientist-In-Residence at the Oklahoma Transplantation Institute in the United States and as an acting consultant for various institutions.\n\nHe had by this time become very interested in anti-aging research, and his reputation suffered in 1986 when he promoted Glycel, an expensive \"anti-aging\" skin cream, whose approval was withdrawn by the United States Food and Drug Administration soon thereafter. He also spent time as a research advisor to the Clinique la Prairie, in Switzerland, where the controversial \"rejuvenation therapy\" was practised.\n\nBarnard divided the remainder of his years between Austria, where he established the Christiaan Barnard Foundation, dedicated to helping underprivileged children throughout the world, and his game farm in Beaufort West, South Africa.\n\nDeath \n\nChristiaan Barnard died on 2 September 2001, while on holiday in Paphos, Cyprus. Early reports stated that he had died of a heart attack, but an autopsy showed his death was caused by a severe asthma attack.\n\nBooks\n\nChristiaan Barnard wrote two autobiographies. His first book, One Life, was published in 1969 () and sold copies worldwide. Some of the proceeds were used to set up the Chris Barnard Fund for research into heart disease and heart transplants in Cape Town. His second autobiography, The Second Life, was published in 1993, eight years before his death ().\n\nApart from his autobiographies, Dr Barnard also wrote several other books including:\n*The Donor\n*Your Healthy Heart\n*In The Night Season\n*The Best Medicine\n*Arthritis Handbook: How to Live With Arthritis\n*Good Life Good Death: A Doctor's Case for Euthanasia and Suicide\n*South Africa: Sharp Dissection\n*50 Ways to a Healthy Heart\n*Body Machine. Christiaan Barnard. http://en.wikipedia.org/?curid=7015."
  }
}
