{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5350",
  "eid" : "d417f8f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778435583,
  "textBody" : "Riding shotgun was used to describe the guard who rode alongside a stagecoach driver, ready to use his shotgun to ward off bandits or hostile Native Americans. In modern use, it refers to the practice of sitting alongside the driver in a moving vehicle. The phrase has been used to mean giving actual or figurative support or aid to someone in a situation. The earliest coining of this phrase dates to at most 1919.\n\nEtymology \n\nThe expression \"riding shotgun\" is derived from \"shotgun messenger\", a colloquial term for \"express messenger\", when stagecoach travel was popular during the American Wild West and the Colonial period in Australia. The person rode alongside the driver. The first known use of the phrase \"riding shotgun\" was by The Ogden Examiner in May 1919, in a story titled \"Ross Will Again Ride Shotgun on Old Stage Coach.\"\n\nIt was later used in print and especially film depiction of stagecoaches and wagons in the Old West in danger of being robbed or attacked by bandits. A special armed employee of the express service using the stage for transportation of bullion or cash would sit beside the driver, carrying a short shotgun (or alternatively a rifle), to provide an armed response in case of threat to the cargo, which was usually a strongbox. Absence of an armed person in that position often signaled that the stage was not carrying a strongbox, but only passengers.\n\nHistorical examples \n\nTombstone, Arizona Territory \n\nOn the evening of March 15, 1881, a Kinnear & Company stagecoach carrying US$26,000 in silver bullion (about $ in today's dollars) was en route from the boom town of Tombstone, Arizona Territory to Benson, Arizona, the nearest freight terminal. Bob Paul, who had run for Pima County Sheriff and was contesting the election he lost due to ballot-stuffing, was temporarily working once again as the Wells Fargo shotgun messenger. He had taken the reins and driver's seat in Contention City because the usual driver, a well-known and popular man named Eli \"Budd\" Philpot, was ill. Philpot was riding shotgun.\n\nNear Drew's Station, just outside Contention City, a man stepped into the road and commanded them to \"Hold!\" Three Cowboys attempted to rob the stage. Paul, in the driver's seat, fired his shotgun and emptied his revolver at the robbers, wounding a Cowboy later identified as Bill Leonard in the groin. Philpot, riding shotgun, and passenger Peter Roerig, riding in the rear dickey seat, were both shot and killed. The horses spooked and Paul wasn't able to bring the stage under control for almost a mile, leaving the robbers with nothing. Paul, who normally rode shotgun, later said he thought the first shot killing Philpot had been meant for him.\n \nWhen Wyatt Earp first arrived in Tombstone in December 1879, he initially took a job as a stagecoach shotgun messenger for Wells Fargo, guarding shipments of silver bullion. When Wyatt Earp was appointed Pima County Deputy Sheriff on July 27, 1881, his brother Morgan Earp took over his job.\n\nHistorical weapon \n\nWhen Wells, Fargo & Co. began regular stagecoach service from Tipton, Missouri to San Francisco, California in 1858, they issued shotguns to its drivers and guards for defense along the perilous 2,800 mile route. The guard was called a shotgun messenger and they were issued a Coach gun, typically a 10-gauge or 12-gauge, short, double-barreled shotgun.\n\nModern usage \n\nMore recently, the term has been applied to a game, usually played by groups of friends to determine who rides beside the driver in a car. Typically, this involves claiming the right to ride shotgun by being the first person to call out \"shotgun\".  While there are many other rules for the game, such as a requirement that the vehicle be in sight, nearly all players agree that the game may only begin on the way to the car. The game creates an environment that is fair by forgetting and leaving out most seniority except for that Moms and significant others automatically get shotgun, and this meanwhile leaves out any conflicts that may have previously occurred when deciding who gets to ride shotgun. Therefore, it is best played and seen mainly within friend groups because of the lack of seniority, and it is when most people enjoy participating in games. Also, the front passenger seat is typically most wanted because of the small perks it contains like more leg room and easier access to the radio and air controls of the car. Calling shotgun does not apply to bi-directional trips, shotgun must be called before each journey.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Riding shotgun" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5350" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Riding shotgun was used to describe the guard who rode alongside a stagecoach driver, ready to use his shotgun to ward off bandits or hostile Native Americans. In modern use, it refers to the practice of sitting alongside the driver in a moving vehicle. The phrase has been used to mean giving actual or figurative support or aid to someone in a situation. The earliest coining of this phrase dates to at most 1919.\n\nEtymology \n\nThe expression \"riding shotgun\" is derived from \"shotgun messenger\", a colloquial term for \"express messenger\", when stagecoach travel was popular during the American Wild West and the Colonial period in Australia. The person rode alongside the driver. The first known use of the phrase \"riding shotgun\" was by The Ogden Examiner in May 1919, in a story titled \"Ross Will Again Ride Shotgun on Old Stage Coach.\"\n\nIt was later used in print and especially film depiction of stagecoaches and wagons in the Old West in danger of being robbed or attacked by bandits. A special armed employee of the express service using the stage for transportation of bullion or cash would sit beside the driver, carrying a short shotgun (or alternatively a rifle), to provide an armed response in case of threat to the cargo, which was usually a strongbox. Absence of an armed person in that position often signaled that the stage was not carrying a strongbox, but only passengers.\n\nHistorical examples \n\nTombstone, Arizona Territory \n\nOn the evening of March 15, 1881, a Kinnear & Company stagecoach carrying US$26,000 in silver bullion (about $ in today's dollars) was en route from the boom town of Tombstone, Arizona Territory to Benson, Arizona, the nearest freight terminal. Bob Paul, who had run for Pima County Sheriff and was contesting the election he lost due to ballot-stuffing, was temporarily working once again as the Wells Fargo shotgun messenger. He had taken the reins and driver's seat in Contention City because the usual driver, a well-known and popular man named Eli \"Budd\" Philpot, was ill. Philpot was riding shotgun.\n\nNear Drew's Station, just outside Contention City, a man stepped into the road and commanded them to \"Hold!\" Three Cowboys attempted to rob the stage. Paul, in the driver's seat, fired his shotgun and emptied his revolver at the robbers, wounding a Cowboy later identified as Bill Leonard in the groin. Philpot, riding shotgun, and passenger Peter Roerig, riding in the rear dickey seat, were both shot and killed. The horses spooked and Paul wasn't able to bring the stage under control for almost a mile, leaving the robbers with nothing. Paul, who normally rode shotgun, later said he thought the first shot killing Philpot had been meant for him.\n \nWhen Wyatt Earp first arrived in Tombstone in December 1879, he initially took a job as a stagecoach shotgun messenger for Wells Fargo, guarding shipments of silver bullion. When Wyatt Earp was appointed Pima County Deputy Sheriff on July 27, 1881, his brother Morgan Earp took over his job.\n\nHistorical weapon \n\nWhen Wells, Fargo & Co. began regular stagecoach service from Tipton, Missouri to San Francisco, California in 1858, they issued shotguns to its drivers and guards for defense along the perilous 2,800 mile route. The guard was called a shotgun messenger and they were issued a Coach gun, typically a 10-gauge or 12-gauge, short, double-barreled shotgun.\n\nModern usage \n\nMore recently, the term has been applied to a game, usually played by groups of friends to determine who rides beside the driver in a car. Typically, this involves claiming the right to ride shotgun by being the first person to call out \"shotgun\".  While there are many other rules for the game, such as a requirement that the vehicle be in sight, nearly all players agree that the game may only begin on the way to the car. The game creates an environment that is fair by forgetting and leaving out most seniority except for that Moms and significant others automatically get shotgun, and this meanwhile leaves out any conflicts that may have previously occurred when deciding who gets to ride shotgun. Therefore, it is best played and seen mainly within friend groups because of the lack of seniority, and it is when most people enjoy participating in games. Also, the front passenger seat is typically most wanted because of the small perks it contains like more leg room and easier access to the radio and air controls of the car. Calling shotgun does not apply to bi-directional trips, shotgun must be called before each journey. Riding shotgun. http://en.wikipedia.org/?curid=5350."
  }
}
