{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3079",
  "eid" : "c415eb60-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778408726,
  "textBody" : "The Australian Broadcasting Corporation (ABC) is Australia's national broadcaster, funded by the Australian Federal Government but specifically independent of Government and politics in the Commonwealth. The ABC plays a leading role in journalistic independence and is fundamental in the history of broadcasting in Australia, its model based on – but not restricted to – the BBC in the United Kingdom. Originally financed in a similar method to the British model using consumer licence fees on broadcasting receivers, its funding evolved to a projected model approved by the Australian Parliament. In recent times, the Corporation provides television, radio, online and mobile services throughout metropolitan and regional Australia, as well as overseas through Australia Plus and Radio Australia.\n\nOrigin\n\nFounded in 1929 as the Australian Broadcasting Company, the ABC was a Government licensed consortium of private entertainment and content providers, authorised under supervision to broadcast on the airwaves using a two-tiered system. The \"A\" system derived its funds primarily from the licence fees levied on the purchasers of the radio receivers, with an emphasis on building the radio wave infrastructure into regional and remote areas, whilst the \"B\" system relied on privateers and their capacity to establish viable enterprises using the new technology. Following the general downward economic trends of the era, as entrepreneurial ventures in National infrastructure struggled with viability, the \"Company\" was subsequently acquired to become a fully state-owned corporation on 1 July 1932 and renamed as Australian Broadcasting Commission, re-aligning more closely to the British, BBC model.\n\nThe Australian Broadcasting Corporation Act 1983 changed the name of the organisation to the Australian Broadcasting Corporation, effective 1 July 1983. Although funded and owned by the government, the ABC remains editorially independent as ensured through the Australian Broadcasting Corporation Act 1983.\n\nThe ABC is sometimes informally referred to as \"Aunty\", originally in imitation of the British Broadcasting Corporation's nickname.\n\nHistory\n\n1920s–40s\n\nThe first public radio station in Australia opened in Sydney on 23 November 1923 under the call sign 2SB with other stations in Melbourne, Brisbane, Adelaide, Perth and Hobart following. A licensing scheme, administered by the Postmaster-General's Department, was soon established allowing certain stations government funding, albeit with restrictions placed on their advertising content.\n\nFollowing a 1927 royal commission inquiry into radio licensing issues, the government established the National Broadcasting Service which subsequently took over a number of the larger funded stations. It also nationalised the Australian Broadcasting Company which had been created by entertainment interests to supply programs to various radio stations. On 1 July 1932, the Australian Broadcasting Commission was established, taking over the operations of the National Broadcasting Service and eventually establishing offices in each of Australia's capital cities.\n\nOver the next four years the stations were reformed into a cohesive broadcasting organisation through regular program relays, coordinated by a centralised bureaucracy. The Australian broadcast radio spectrum was constituted of the ABC and the commercial sector.\n\nNews broadcasts were initially restricted, due to pressure from Sir Keith Murdoch, who controlled many Australian newspapers. However, journalists such as Frank Dixon and John Hinde began to subvert the agreements in the late 1930s. in 1939, Warren Denning was appointed to Canberra as the first ABC political correspondent, after Murdoch had refused to allow his newspapers to cover a speech by Joseph Lyons.\n\nIn 1942 The Australian Broadcasting Act was passed, giving the ABC the power to decide when, and in what circumstances, political speeches should be broadcast. Directions from the Minister about whether or not to broadcast any matter now had to be made in writing, and any exercise of the power had to be mentioned in the Commission's Annual Report. It was used only once, in 1963. In the same year, \"Kindergarten of the Air\" began on ABC Radio in Perth, and was later broadcast nationally.\n\nCater argues that reform was urgently needed in 1945:\nBy the end of World War II, the ABC was a decadent, hollow institution.  Its authority had been compromised by a poorly drafted charter and further undermined by timid management, poor governance and creeping wartime censorship. In April 1945, Boyer refused to accept the post of chairman until Prime Minister Curtin issued a mandate of independence which Boyer drafted itself.  The ABC under Boyer and general manager Charles Moses invested as best it could in the cultural capital of the nation, establishing viable symphony orchestras and seizing on the potential of television.... [Boyer's] neutrality was never seriously questioned.Nick Cater, The Lucky Culture and the Rise of an Australian Ruling Class  (2013) p 201\n\n1950s–70s\n\nThe ABC commenced television broadcasting in 1956, and followed the earlier radio practice of naming the station after the first letter of the base state. ABN-2 (New South Wales) Sydney was inaugurated by Prime Minister Robert Menzies on 5 November 1956, with the first broadcast presented by Michael Charlton, and James Dibble reading the first television news bulletin.Australian Broadcasting Corporation, [http://www.abc.net.au/corp/history/galpost9.htm \"About the ABC: History of the ABC: James Dibble\"]. Retrieved 3 September 2008. ABV-2 (Melbourne, Victoria) followed two weeks later, on 18 November 1956. Stations in other capital cities followed: ABQ-2 (Brisbane, Queensland) (1959), ABS-2 (Adelaide, South Australia) (1960), ABW-2 (Perth, Western Australia) (1960), and ABT-2 (Hobart, Tasmania) (1960). ABC-3 Canberra opened in 1961, and ABD-6 (Darwin, Northern Territories) started broadcasting in 1971, both named after the base city.\n\nAlthough radio programs could be distributed nationally by landline, television relay facilities were not in place until the early 1960s. This meant that news bulletins had to be sent to each capital city by teleprinter, to be prepared and presented separately in each city, with filmed materials copied manually and sent to each state. Other television programs at the time included the popular Six O'Clock Rock hosted by Johnny O'Keefe, Mr. Squiggle, as well as operas and plays.\n\nIn 1973 New South Wales Rugby League boss Kevin Humphreys negotiated rugby league's first television deal with the ABC.\nIn 1975, colour television was introduced into Australia, and within a decade the ABC had moved into satellite broadcasting, greatly enhancing its ability to distribute content nationally. In the same year, the ABC introduced a 24-hour-a-day AM rock station in Sydney, 2JJ (Double Jay), which was eventually expanded into the national Triple J FM network. A year later, a national classical music network was established on the FM band, broadcasting from Adelaide. It was initially known as ABC-FM (now called ABC Classic FM) – referring both to its 'fine music' programming and radio frequency.\n\nABC budget cuts began in 1976 and continued until 1985. In 1978 the ABC NSW Staff Association organised a strike against budget cuts and political interference. Sydney ABC was off air for four days.Molomby, Tom, Is there a moderate on the roof? ABC Years, William Heinemann Australia, Port Melbourne, 1991, p.110 A packed free concert in support was held at the Regent Theatre and compered by Bob Hudson. It featured Fred Dagg and Robyn Archer.Molomby, Tom, Is there a moderate on the roof? ABC Years, William Heinemann Australia, Port Melbourne, 1991, p.114 In 1991, Tom Molomby wrote:\n\"The effects of the budget reductions had been so badly handled that the organisation was to remain seriously crippled for years.\"Molomby, Tom, Is there a moderate on the roof? ABC Years, William Heinemann Australia, Port Melbourne, 1991, p.160\n\n1980s–90s\n\nThe Australian Broadcasting Corporation Act 1983 changed the name of the organisation from the \"Australian Broadcasting Commission\" to the \"Australian Broadcasting Corporation\", effective 1 July 1983. At the same time, the newly formed Corporation underwent significant restructuring. The ABC was split into separate television and radio divisions, with an overhaul of management, finance, property and engineering. Geoffrey Whitehead[http://bookstore.iuniverse.com/Products/SKU-000538367/Tending-the-Flame-of-Democracy.aspx 2012 publication by Geoffrey Whitehead \"Tending the Flame of Democracy\"]  retrieved 26 June 2013 was the initial managing director; however, following his resignation in 1986, David Hill (at the time chair of the ABC Board) took over his position.\n\nProgram production in indigenous affairs, comedy, social history and current affairs was significantly expanded, while the Corporation's output of drama was boosted. Local production trebled from 1986–91 with the assistance of co-production, co-financing, and pre-sales arrangements.\n\nA new Concert Music Department was formed in 1985 to co-ordinate the corporation's six symphony orchestras, which in turn received a greater level of autonomy to better respond to local needs. Open-air free concerts and tours, educational activities, and joint ventures with other music groups were undertaken at the time to expand the orchestras' audience reach.\n\nABC Radio was restructured significantly again in 1985 – Radio One became the Metropolitan network, while Radio 2 became known as Radio National (callsigns, however, were not standardised until 1990). New programs such as The World Today, Australia All Over, and The Coodabeen Champions were introduced, while ABC-FM established an Australian Music Unit in 1989. Radio Australia began to focus on the Asia-Pacific region, with coverage targeted at the south west and central Pacific, south-east Asia, and north Asia. Radio Australia also carried more news coverage, with special broadcasts during the 1987 Fijian coup, Tiananmen Square massacre, and the First Gulf War.\n\nIn 1991, the Corporation's Sydney radio and orchestral operations moved to a new building built by Leighton Holdings on a single site in the inner-city suburb of Ultimo. In Melbourne, the ABC Southbank Centre was completed in 1994, and now houses the radio division in Victoria as well as the Melbourne Symphony Orchestra.\n\nThe ABC Multimedia Unit was established in July 1995, to manage the new ABC website (launched in August). Funding was allocated later that year specifically for online content, as opposed to reliance on funding for television and radio content. The first online election coverage was put together in 1996, and included news, electorate maps, candidate information and live results.\n\nBy the early 1990s, all major ABC broadcasting outlets moved to 24-hour-a-day operation, while regional radio coverage in Australia was extended with 80 new transmitters. Live television broadcasts of selected parliamentary sessions started in 1990. ABC NewsRadio, a continuous news network broadcast on the Parliamentary and News Network when parliament is not sitting, was launched on 5 October 1994.\n\nInternational television service Australia Television International was established in 1993, while at the same time Radio Australia increased its international reach. Reduced funding in 1997 for Radio Australia resulted in staff and programming cuts.\n\nAustralia Television was sold to the Seven Network in 1998, however the service continued to show ABC news and current affairs programming up until its closure in 2001. The ABC's television operation joined its radio and online divisions at the corporation's Ultimo headquarters in 2000.\n\n2000s\n\nIn 2001, digital television commenced after four years of preparation. In readiness, the ABC had fully digitised its production, post-production and transmission facilities – heralded at the time as \"the greatest advance in television technology since the introduction of colour\". The first programmes to be produced in widescreen were drama series Something in the Air, Grass Roots and In the Mind of the Architect.\n\nAt the same time, the ABC's Multimedia division was renamed \"ABC New Media\", becoming an output division of the ABC alongside Television and Radio. Legislation allowed the ABC to provide 'multichannels' – additional, digital-only, television services managed by the New Media Division. Soon after the introduction of digital television in 2001, Fly TV and the ABC Kids channel launched, showing a mix of programming aimed at teenagers and children.\n\nIn 2002, the ABC launched ABC Asia Pacific – the replacement for the defunct Australia Television International operated previously by the Seven Network. Much like its predecessor, and companion radio network Radio Australia, the service provided a mix of programming targeted at audiences throughout the Asia-Pacific region. Funding cuts in 2003 led to the closure of Fly TV and the ABC Kids channel.\n\nThe ABC launched a digital radio service, ABC DiG, in November 2002, available though the internet and digital television, but not available through any other terrestrial broadcast until DAB+ became available in 2009.\n\nABC2, a second attempt at a digital-only television channel, launched on 7 March 2005. Unlike its predecessors the new service was not dependent on government funding, instead running on a budget of A$3 million per year. Minister for Communications Helen Coonan inaugurated the channel at Parliament House three days later. Genre restrictions limiting the types of programming the channel could carry were lifted in October 2006 – ABC2 was henceforth able to carry programming classified as comedy, drama, national news, sport and entertainment.\n\nA high incidence of breast cancer in female staff working at the ABC's offices in Brisbane led to the closure of the site, based in Toowong, on 21 December 2006. Sixteen women were diagnosed with the disease in a period spanning 1994 to 2007. A progress report released in March 2007 by an independent panel formed to investigate the occurrences found that the rate of occurrence for breast cancer rate at the offices was eleven times higher than elsewhere – after the closure of the site, the ABC's Brisbane-based television and radio operations were moved to alternate locations around the city, including Ten Brisbane's studios at Mt Coot-tha. The ABC's managing director, Mark Scott, announced in August 2007 that new studios would be built on the site, following the final release of the Review and Scientific Investigation Panel's report. In January 2012 the ABC in Brisbane moved into purpose-built accommodation in South Bank.\n\nOn 8 February 2008, ABC TV was rebranded as ABC1, complementing the existing ABC2 digital-only channel which was launched on 7 March 2005. Branding was also added for a new kids' channel that had been announced throughout the Howard Government based on their winning the 2007 election but left to the 2009 Rudd Government Budget where ABC3 was funded and announced in June. A new online video-on-demand service launched in July of the same year, titled ABC iview, and the ABC launched digital radio broadcasts in the same month.\n\n2010s\n\nABC News launched on 22 July 2010, and brought with it both new programming content as well as a collaboration of existing news and current affair productions and resources. The ABC launched the 24-hour news channel to both complement its existing 24-hour ABC News Radio service and compete with commercial offerings on cable TV. It became the ABC's fifth domestic TV channel and the fourth launched within the past 10 years.\n\nOn 20 July 2014, ABC1 reverted to its original name of ABC.[https://www.theguardian.com/media/2014/jul/10/abc-rebrands-its-main-television-channel-using-social-media-hashtag ABC rebrands its main television channel using social media hashtag], The Guardian,  \n10 July 2014\n\nIn 2014 the ABC ran its first \"Mental As\" week focusing on improving awareness of mental health issues, as part of Mental Health Week.\n\nIn December 2015 it was announced that former BSkyB, Star TV and Google executive Michelle Guthrie would take over from managing director Mark Scott, who was to retire in April 2016.\n\nCorporation\n\nStructure\n\nBelow is a diagram of the ABC's divisional structure.\n\nManagement\n\nThe operations of the ABC are governed by a board of directors, consisting of a managing director, five to seven directors, and until 2006, a staff-elected director. The managing director is appointed by the board for a period of up to five years, but is eligible for renewal. The authority and guidelines for the appointment of directors is provided for in the Australian Broadcasting Corporation Act 1983.\n\nAppointments to the ABC Board made by successive governments have often resulted in criticism of the appointees' political affiliation, background, and relative merit. Past appointments have associated directly with political parties – five of fourteen appointed chairmen have been accused of political affiliation or friendship, include Richard Downing and Ken Myer (both of whom publicly endorsed the Australian Labor Party at the 1972 election), as well as Sir Henry Bland.  David Hill was close to Neville Wran, while Donald McDonald was considered to be a close friend of John Howard.\n\nFrom 2003 the Howard Government made several controversial appointments to the ABC Board, including prominent ABC critic Janet Albrechtsen, Ron Brunton, and Keith Windschuttle.\n\nDuring their 2007 federal election campaign, Labor announced plans to introduce a new system, similar to that of the BBC, for appointing members to the board. Under the new system, candidates for the ABC Board would be considered by an independent panel established \"at arm's length\" from the Communications Minister. If the Minister chose someone not on the panel's shortlist, they would be required to justify this to parliament. The ABC chairman would be nominated by the Prime Minister and endorsed by the Leader of the Opposition.\n\nThe new merit-based appointment system was announced on 16 October, in advance of the new triennial funding period starting in 2009.\n\nCurrent Board members are:\n\nFunding\n\nThe ABC is funded mainly by the Australian government, in addition to some revenue received from its retail outlets. In the 2006–07 federal budget, the ABC received A$823 million of government funding, increased to $840 million in 2008–09.Retrieved 4 December 2013 [http://www.budget.gov.au/2012-13/content/bp4/html/bp4_ar_04_dbcde.htm Budget Paper No. 4 2012–2013] In the 2009–10 federal budget, the ABC received funding of $929.9 million.\n\nUntil 1948, the ABC was funded directly by radio licence fees; amendments were also made to the Australian Broadcasting Act that meant the ABC would receive its funding directly from the federal government. Licence fees remained until 1973 when they were abolished by the Whitlam Labor government, on the basis that the near-universality of television and radio services meant that public funding was a fairer method of providing revenue for government-owned radio and television broadcasters.\n\nThe term \"where your 8 cents a day goes\", coined in the late 1980s during funding negotiations, is often used in reference to the services provided by the ABC. It is estimated that the cost of the ABC per head of population per day was 7.1 cents a day, based on the Corporation's 2007–08 'base funding' of $543 million.  Budget figures above show the ABC costs over 14 cents per day today.\n\nFederal funding to the ABC: of $1,022.6 million in 2016-17; $1,029.9 million in 2017-18; and $1,036.5 million in 2018-19. https://www.communications.gov.au/file/17236/download?token=atNjL8Za\n\nPolitics and criticism\n\nIndependence and impartiality\n\nUnder the Australian Broadcasting Corporation Act 1983, the ABC Board is bound to \"maintain the independence and integrity of the Corporation\" and to ensure that \"the gathering and presentation by the Corporation of news and information is accurate and impartial according to the recognized standards of objective journalism.\"\n\nIn relation to impartiality and diversity of perspectives, the current ABC editorial policy requires of the broadcaster that:\n\nCriticisms \n\nAs a publicly funded broadcaster, the ABC is expected not to take editorial stances on political issues, and is required to present a range of views with impartiality. Over the decades, accusations of \"bias\" at the ABC have arisen at different times, and various inquiries undertaken.\n\nReviews of the ABC are regularly commissioned and sometimes not released. A 2004 Roy Morgan media credibility survey found that media professionals regarded ABC Radio as the most accurate news source in the country. In mid 2013 the University of the Sunshine Coast released a study of the professional views of journalists. Slightly over half of respondents expected to vote for either Labor or The Greens whereas just under a third planned to vote Coalition. In contrast over 40% of ABC journalists would vote for The Greens and almost a third Labor.[http://www.theaustralian.com.au/opinion/columnists/jennifer-oriel/diversity-of-thought-practically-whitewashed-by-pc-ideology/news-story/9d16179ec45fe24f6b05072f64540ec7 Why the ABC is at odds with us]; www.theaustralia.com.au; July 24, 2017 \n \nDr Rhonda Jolly's 2014 ABC Overview noted that \"many commentators have argued consistently that there is a left wing bias which dominates ABC news and programming\" and cited a 2005 piece by Paul Gray that the broadcaster was overly influenced by the \"narrow middle-class values of the Australian secular Left\" and said that \"while the national broadcaster had at times offended governments of all persuasions, it had always adopted a 'from the Left' perspective.\" Jolly also noted however that supporters of the ABC \"deny claims that the broadcaster is either intentionally or inadvertently biased\" and that \"Speaking from opposition, politicians have praised the ABC for its scrutiny of government.\" The paper noted that, in December 2013, ABC chairman James Spigelman called four independent audits a year in response to the frequent allegations of lack of impartiality in news and current affairs.[http://www.aph.gov.au/About_Parliament/Parliamentary_Departments/Parliamentary_Library/pubs/rp/rp1415/ABCoverview#_Toc395086092 The AVC: An Overview]; http://www.aph.gov.au; 11 August 2014 In response to one set of criticisms, journalist Annabel Crabb, who has worked at the ABC, commented: \"every single day I see that organisation give voices to Australians who otherwise wouldn't be heard, on topics that are too uncommercial or too remote or too hard to be covered by anyone else, broadcasting into areas from which others have long withdrawn resources.\"\n\n1960s and 1970s \n\nThe conservative Liberal Party governments in the 1960s and 1970s attempted to influence the ABC's political coverage by threatening to reduce funding for its news and current affairs division.\n\nHawke-Keating Government \n\nBob Hawke criticised some of the 7.30 Report's coverage of the 1991 Gulf War to which he committed naval forces as being \"loaded\", \"biased\" and \"disgraceful\".[http://www.theage.com.au/comment/abbotts-bias-crusade-as-simple-as-abc-20140130-31phn.html#ixzz48nAslZrK Abbott's Bias Crusade: as simple as ABC]; The Age; January 31, 2014\n\nHoward Government \n\nFor much of the Howard Government years, ABC TV's masthead political programs were anchored by Labor affiliated journalists Kerry O'Brien, Barrie Cassidy and Maxine McKew. 7.30 Report and Insiders were hosted by former Labor staffers Kerry O'Brien and Barrie Cassidy respectively, while the 2007 election saw Lateline host McKew defeat Liberal Prime Minister John Howard as the Labor candidate for the seat of Bennelong. At that same election, Liberal front bencher Joe Hockey was challenged unsuccessfully by ABC Sydney News weatherman turned Labor candidate Mike Bailey in the Seat of North Sydney.[http://www.smh.com.au/news/national/weatherman-bailey-labors-newest-recruit/2007/05/22/1179601361057.html Weatherman Bailey Labor's newest recruit]; May 22, 2007\n\nOf the 1996 prime ministerial Election debates between Opposition Leader John Howard and Labor Prime Minister Paul Keating, Howard later wrote: \"I flatly refused to have Kerry O'Brien of the ABC [moderate the debates] because of the way he had handled the second Keating-Hewson debate in 1993\" in which O'Brien \"went in to bat\" for Keating.John Howard; Lazarus Rising: A Personal and Political Autobiography; Harper Collins; 2010; pp. 194 & 223 Howard went on to win that election. A decade later, the ABC Media Watch program reported that NSW Liberal Senator Concetta Fierravanti-Wells had written to her constituents to say that the ABC had \"a collective loathing\" of John Howard. At the end of the Howard Government's term in 2007, left-wing political commentator Robert Manne wrote in The Monthly that the Howard Government had viewed the broadcaster as being run by \"left-wing ideologues\" who had \"supposedly pushed the agenda of the Left on issues like refugees, the republic, multiculturalism, reconciliation, radical feminism, extreme environmentalism, anti-Americanism, gay rights and so on.\"\n\nSoon after coming to office in 1996, the Howard Government reduced the ABC's operating grants by 10%.Senator K. Lundy, Adjournment speech, Senate Hansard, 10 September 1996 Its appointment of Jonathan Shier to the position of managing director was controversial, for his program of budget cuts, restructuring and the loss of several high-profile personalities and shows. Shier left the position early, on 31 October 2001. 7.30 Report anchor Kerry O'Brien opposed Howard's budget cuts to the ABC, and describes the appointment of Shier as its Managing Director as a manifestation of the \"conservative obsession with the ABC as a kind of biased, left-wing culture\".http://www.smh.com.au/entertainment/tv-and-radio/kerry-obrien-opens-up-about-his-critics-his-family-and-a-new-life-in-byron-20101130-18el9.html#ixzz437fX64JG\n\nIn Howard's last election, he was defeated in the Seat of Bennelong by Labor candidate Maxine McKew, who had hosted Lateline during the Howard era. Peter Mares reported for Radio National that \"some wags described it as an 'internal promotion', while others said she'd simply moved from the 'media wing' to the 'political wing' of the ALP\". Mares consulted ABC journalist turned NSW Liberal MLA Pru Goward who said: \" I have no doubt there was left-wing bias, I certainly thought it when I was there\", while McKew said there was no left wing bias, though \"what I detected years ago in the ABC, much more of a collectivist philosophy\".\n\nRudd-Gillard-Rudd Government (2007–2013) \n\nABC TV's masthead political programs continued to have strong Labor Party connections through the period. In October 2010, the ABC announced that former Labor staffer Kerry O'Brien would host Four Corners, beginning in 2011. Former Labor staffer Barrie Cassidy continued to host the Insiders program. In December 2010, Chris Uhlmann, husband of Labor MP Gai Brodtmann, was appointed as co-host of the 7.30 current affairs program. In 2012, Sydney ABC News anchor Juanita Phillips began a relationship with Labor's Minister for Climate Change, Greg Combet.\n\nConservative commentators such as Andrew Bolt, Tim Blair and Gerard Henderson accused the ABC of a left-wing bias.\n\nAbbott-Turnbull Government (2013–present) \n\nLiberal Prime Minister Tony Abbott perceived the ABC to be left wing and hostile to his government, while his successor Malcolm Turnbull enjoyed better relations with the National Broadcaster. When the ABC co-operated with The Guardian to publish stolen documents purporting to reveal monitoring of Indonesian officials by Australian spy agencies under the Rudd Government, Abbott told 2GB radio: \"A lot of people feel at the moment that the ABC instinctively takes everyone's side but Australia's\".  Abbott reportedly called the Q&A program a \"Lefty Lynch Mob\".[http://www.news.com.au/entertainment/tv/tony-abbott-calls-qa-a-lefty-lynch-mob-as-abc-agrees-to-external-review-of-the-show/news-story/f2a708455ee73c79a4db75e2563130a5 Tony Abbott reportedly calls Q&A a 'lefty lynch mob', as ABC agrees to external review of the show]; news.com.au; 24 June 2015 When it invited a man convicted of threatening Commonwealth officials to participate in questioning one of his ministers amid a heightened terrorism alert in June 2015, Abbott asked the makers of the program: \"whose side are you on?\".[http://www.smh.com.au/federal-politics/political-news/whose-side-are-you-on-tony-abbott-lashes-abcs-qa-program-20150623-ghvd0l.html#ixzz48n1mfY00 'Whose side are you on?' Tony Abbott lashes ABC's Q&A program]; smh.com.au; June 23, 2015 The ABC found that there had been an \"error of judgement', but repeated the program later in the week, prompting Abbott to say that \"heads should roll\" over the affair.[http://www.skynews.com.au/news/top-stories/2015/06/25/-heads-should-roll--at-abc-over-q-and-a-rerun.html 'Heads should roll' at ABC over Q and A rerun] ; Sky News; 25 June 2015 Abbott initiated a brief ministerial boycott of the Q&A program following the affair.[http://www.smh.com.au/federal-politics/political-news/qa-fallout-tony-abbott-orders-frontbench-ministers-to-boycott-abc-show-20150705-gi5olb.html Q&A fallout: Tony Abbott orders frontbench ministers to boycott ABC show]; SMH; 6 July 2015\n\nThe broadcaster was critical of Abbott when he broke an election-eve promise not to make cuts to the ABC, and required 4.6% cuts over five years as part of his \"Budget repair\" program. In early 2015, an internal ABC review of its coverage of Joe Hockey's first Budget criticised the post-budget interviews by 7:30 and Lateline, finding that the interviewers had given the impression of bias.[http://www.smh.com.au/federal-politics/political-news/sarah-ferguson-interview-with-joe-hockey-breached-abc-bias-guidelines-review-20150216-13gbmj.html#ixzz3kdTWqNtk Sarah Ferguson interview with Joe Hockey 'breached ABC bias guidelines': review]; The Sydney Morning Herald; 17 February 2015\n\nWhen Abbott lost the leadership to Turnbull in the September 2015 Liberal leadership spill, the hosts of the ABC's political programs spoke in favour of Abbott's demise. Kerry O'Brien and Barrie Cassidy, hosts respectively of the ABC's flagship weekly current affairs programs Four Corners and Insiders, welcomed the replacement of Abbott by Turnbull,http://www.smh.com.au/entertainment/tv-and-radio/kerry-obrien-stepping-down-as-host-of-abctvs-four-corners-20151106-gkssti.htmlhttp://www.abc.net.au/news/2015-09-18/cassidy-the-rage-in-canberra-isnt-felt-elsewhere/6783840 as did ABC radio commentators Fran Kellyhttp://www.abc.net.au/insiders/content/2015/s4352244.htm Paul BongiornoRN Breakfast with Fran Kelly, ABC Radio National, 8 March 2016 and Amanda Vanstone.Counterpoint, ABC Radio National, 18 April 2016 Fairfax and News Limited reported that Leigh Sales, the host of 7.30 gave Turnbull an unusually warm first interview following his toppling of Abbott.http://www.smh.com.au/entertainment/tv-and-radio/leigh-sales-criticised-for-softtouch-interview-with-malcolm-turnbull-20150921-gjrsmg.htmlhttp://www.theaustralian.com.au/subscribe/news/1/index.html?sourceCodeTAWEB_WRE170_a_GGL&mode\npremium&desthttp://www.theaustralian.com.au/business/media/softly-softly-as-leigh-sales-uses-kid-gloves-on-malcolm-turnbull/story-fna045gd-1227537789836&memtype\nanonymous\n\nIn a March 2016 interview with ABC Managing Director Mark Scott, Media Watch host Paul Barry examined the question of perceptions of left wing bias at the ABC. Scott noted that while perhaps the ABC was more concerned about gay marriage than about electricity prices, he did not accept the criticism of bias because \"a lot of that criticism comes from right wing commentators and they wonder where are the strong right wing commentators on the ABC. We don't do that kind of journalism. We don't ask questions about our journalists' voting pattern and where their ideology are. We look at the journalism that they put to air and we have strong editorial standards...\"[http://www.abc.net.au/mediawatch/transcripts/s4432757.htm Easter Special: An interview with Mark Scott]; Media Watch; Episode 09, 28 March 2016. Following the interview, conservative ABC critic Andrew Bolt wrote \"How can the man heading our biggest media organisation be so blind to the ABC's unlawful and dangerous Leftist bias?\" while former Media Watch host Jonathan Holmes wrote for The Age that this interview indicated that ABC management had failed to recognise a clear problem of left wing bias among some capital city radio presenters.[http://www.theage.com.au/comment/abc-radio-personalities-need-to-tune-out-their-leftwing-bias-20160404-gnyfse.html#ixzz48n8clYIF ABC radio personalities need to tune out their left-wing bias]; Jonathan Holmes, The Age; April 5, 2016\n\nOver the period, ABC TV and radio hosts advocated strongly in support of same-sex marriage, upon which the wider Australian community and political parties were divided. When the Turnbull Government announced plans for a postal plebiscite on the issue, advocacy for change continued, prompting a call for restraint from the ABC's editorial policy manager Mark Maley.[http://www.news.com.au/finance/business/media/the-abc-does-not-have-a-position-on-the-issue-abc-tells-staff-to-stop-campaigning-for-samesex-marriage/news-story/5b66b904187e8bb7651f6275bc6dbe8b 'The ABC does not have a position on the issue': ABC tells staff to stop campaigning for same-sex marriage]; www.news.com.au; Auhust 10, 2017\n\nAn interview by ABC presenter Joe O'Brien with Lyle Shelton was the subject of a complaint by the Australian Christian Lobby. Bringing up Ian Thorpe's swimming achievements, O'Brien asked Shelton \"what right do you have to participate in that joy, and take national pride in those achievements, if you now deny him the right to feel like an equal and experience the joy of marriage?\" In rejecting any perceived bias, the ABC said \"It was a 'devil's advocate' question and not inconsistent with standards\".\n\nOpposition to Australia Day\n\nThe ABC is criticised for giving undue support to opposition to Australia Day being held on 26 January.[http://www.heraldsun.com.au/news/abc-under-fire-for-politicising-australia-day-by-moving-triple-js-hottest-100-countdown/news-story/3a7e2e553ec4fca81538bb734ccb88fd ABC under fire for ‘politicising’ Australia Day by moving Triple J’s Hottest 100 countdown]; http://www.heraldsun.com.au/; 27 November 2017 In 2017, the ABC's youth radio network announced that, after extensive consultation and opinion polling, it would no longer play its Hottest 100 Australian music list on Australia Day, choosing instead to broadcast the playlist on the fourth weekend in January. [http://www.abc.net.au/triplej/news/musicnews/triple-j-hottest-100-is-moving-to-a-new-date-and-heres-why/9197254 triple j's Hottest 100 is moving to a new date and here's why]; www.abc.net.au; 27 Nov 2017 The Federal Communications Minister Mitch Fifield said in response \"I am bewildered by the ABC’s decision to move the Hottest 100 from Australia Day. The ABC shouldn’t be buying into this debate. Australia Day is our national day. The ABC should honour it and not mess with the Hottest 100.\"[http://www.theaustralian.com.au/national-affairs/cool-reception-as-jjj-moves-its-hottest-100/news-story/17f9b03c1dce83fe20cee3f2ef548241 Cool reception as JJJ moves its Hottest 100]; www.theaustralian.com.au, 28 November 2017[https://www.theguardian.com/australia-news/2017/nov/27/triple-j-moves-hottest-100-from-australia-day-after-protests Triple J moves Hottest 100 from Australia Day after protests]; www.theguardian.com; 27 November 2017 In 2018, an opinion piece  appeared on ABC's website suggesting the date should be moved to 1 January, citing symbolism.\n\nABC journalists in politics\n\nA number of former journalists and presenters have moved from positions at the ABC to politics.\n\nState Labor premiers and chief ministers Bob Carr,\nAlan Carpenter,\nand Clare Martin are all former ABC journalists. Other ABC Labor politicians include Mary Delahunty, Maxine McKew,  Mike Bailey, Ian Baker, Leon Bignell, John Bowler, Bob Debus, Malarndirri McCarthy, Frank McGuire, Neville Oliver and Diana Warnock. Senior ABC political reporter Kerry O'Brien was press secretary to Labor prime minister Gough Whitlam and Labor deputy leader Lionel Bowenhttp://www.smh.com.au/entertainment/tv-and-radio/kerry-obrien-opens-up-about-his-critics-his-family-and-a-new-life-in-byron-20101130-18el9.html and Barrie Cassidy was press secretary to Labor prime minister Bob Hawke. Susan Templeman's husband, Ron Fuller, is the former Chief of Staff for ABC TV News. Radio National's Phillip Adams is a former member of the Communist Party of Australia and the Labor Party, and Melbourne ABC radio's Jon Faine is a former member of the Labor Party.[http://www.crikey.com.au/2007/06/29/crikeys-bias-o-meter-part-v-the-shock-jocks/ Crikey's Bias-o-meter Part V: the shock jocks]; Stephen Mayne; crikey.com.au; 29 June 2007\n\nOn the Coalition side of politics,  Pru Goward has served as a Minister in the NSW state Liberal Government, Rob Messenger, Peter Collins, Eoin Cameron, Scott Emerson and Sarah Henderson all held, or hold, positions at the ABC. Radio National's Counterpoint program is hosted by former Liberal minister Amanda Vanstone, who describes herself as \"liberal\" rather than \"conservative\".Counterpoint, ABC Radio National, 18 April 2016\n\nResearch undertaken by the broadcaster in 2007 indicated that out of a total of 19 former employees moving into party political positions, 10 have joined the Labor Party and nine the Liberal Party.\n\nServices\n\nRadio\n\nThe ABC operates 54 local radio stations, in addition to four national networks and international service Radio Australia. In addition, DiG Radio launched on digital platforms in 2002, currently offering three separate stations.\n\nABC Local Radio is the Corporation's flagship radio station in each broadcast area. There are 54 individual stations, each with a similar format consisting of locally presented light entertainment, news, talk back, music, sport and interviews, in addition to some national programming such as AM, PM, The World Today, sporting events and Nightlife.\n\nABC Grandstand is a live radio sports focused commentary and talk-back program which runs on the Australian Broadcasting Corporation local radio network across Australia and on one digital-only station. The program runs on Saturdays and Sundays, typically from noon or an hour before, until 6 pm.\n\nDouble J is aimed at over-30s alternative music listeners. It is owned and operated by the Australian Broadcasting Corporation.\n\nABC Jazz was launched as a digital only station designed to broadcast a variety of different jazz styles including bebop, acid jazz, cool jazz and contemporary styles of Jazz.\n\nTriple J Unearthed is where artists upload their music and they play and judge it on the channel.\n\nABC Extra is for special events national Digital Radio channel brings you extra coverage of events and ideas that matter.\n\nABC Radio Australia is the international radio station.\n\nABC Country features country style music.\n\nABC Radio National broadcasts more than 60 special interest programmes per week covering a range of topics including music, comedy, book readings, radio dramas, poetry, science, health, the arts, religion, social history and current affairs.\n\nABC NewsRadio is a rolling news service, previously known as the Parliamentary and News Network. The service was established to broadcast federal parliamentary sittings, to relieve the local ABC radio network from this intermittent task, and to provide a news service at other times. The network broadcasts news on a 24/7 format with updates on the quarter-hour. Much of its news content is produced by the ABC itself, however many programmes are relayed from the BBC World Service, NPR, Deutsche Welle, Radio Netherlands and CNN Radio.\n\nABC Classic FM was the ABC's first FM radio service. It was originally known simply as \"ABC FM\", and for a short time \"ABC Fine Music\". Its format borrowed heavily from community stations that eventually founded the Fine Music Network, as well as BBC Radio 3.\n\nTriple J is the national youth radio network, and broadcasts contemporary alternative and independent music; it is targeted at people aged 18–35. While the network plays music from around the world, it has a strong focus on local artists. Triple J was formerly known as \"Double Jay\" when it launched in Sydney on 19 January 1975.\n\nABC Radio broadcasts regular news bulletins across most of its radio stations.  Many of these bulletins are heralded by the \"Majestic Fanfare\", written by British composer Charles Williams in 1935.\n\nTelevision\n\nThe ABC operates 6 national television channels.\n\nABC is a TV channel that consists of programs of:\n* Art and Culture: Stories I Want To Tell You In Person, The A-Z Of Contemporary Art, \n* Current Affairs: 7.30, ABC News, Australian Story, Back Roads, Four Corners, Insiders, Landline, Media Watch, Q&A, The Drum. \n* Comedy: Birds of a feather, Growing Up Gracefully, It's A Date, Luke Warm Sex, Shaun Micallef's MAD AS HELL, Utopia\n* Documentaries and Factual: Antiques Roadshow, Ask The Doctor, Back Roads, Brian Cox: Life Of A Universe, Catalyst, City In The Sky, Compass, David Attenborough's Natural History Museum Alive, Dream Build, Enigma Man: A Stone Age Mystery, Grand Designs, Grand Designs New Zealand, The Checkout, Q&A, Joanna Lumley's India, Mary Berry's Absolute Favourites, Media Watch.\n* Drama: Agatha Raisin, Cleverman, Death In Paradise, Doc Martin, Father Brown, Happy Valley, Humans, Line Of Duty, Midsomer Murders, Prime Suspect 1973, Pulse\n* Entertainment: Adam Hills: The Last Leg, Eggheads, Gardening Australia, Grand Designs, Growing Up Grafefully, Hard Quiz, Pointless, QI, Antiques Roadshow, Short Cuts To Glory, The Checkout, The House,  You Can't Ask That\n* Indigenous: Cleverman\n* Environment: Wild Life At The Zoo, Landline, Gardening Australia\n* News: 7.30, ABC News, Australian Story, Back Roads, Four Corners, Insiders, Landline, Media Watch, Offsiders, Q&A, The Drum.\n* Sport: Golf: PGA TOUR Highlights, Offsiders\n* Special Events\n* Science: Ask The Doctor, Becoming Superhuman, Brian Cox: Life Of A Universe, Catalyst, Gardening Australia, Humans, Stargazing Live, Todd Sampson's Life On The Line\n\nABC HD has the same programs as ABC but is in high definition.\n\nABC Comedy has comedy and was renamed on 4 December 2017 from ABC 2.\n\nABC Me is another TV channel, but with a focus for primary school children, 6–15 years old. It broadcasts a range of genres, including comedy, drama, music, animation, extreme sports, wildlife and news-based programmes.\n\nABC Kids is a TV channel for children under 6, with educational programs.\n\nABC NEWS is a 24-hour news channel with news related programs, such as News Breakfast, Weekend Breakfast, ABC News Mornings, ABC News at Noon, ABC News Afternoons, ABC News — Early Edition, 7.30, Insiders, Four Corners, Behind the News, Q&A, Catalyst, Landline, Offsiders, One Plus One, The Business, The Drum, The Quarters, The World, State to State, Capital Hill\n\nStudios\n\nThe ABC operates ABC Studios.[http://www.abc.net.au/studiosmediaproduction/ ABC Studios and Media Production] ABC, the Corporation's original television service, receives the bulk of funding for television and shows first-run news, and ABC Kids.\n\nOnline\n\nAn experimental Multimedia Unit was established in 1995, charged with developing policy for the ABC's work in web publishing. This unit continued until 2000, when the New Media division was formed, bringing together the ABC's online output as a division similar to Television or Radio. The division had over a million pages of material published by late 2003.\n\nIn 2001 the New Media division became New Media and Digital Services, reflecting the broader remit to develop content for digital platforms such as digital television. In addition to ABC Online, the division also had responsibility over the ABC's two digital television services, Fly TV and the ABC Kids channel, until their closure in 2003. In March 2005 the division oversaw the launch of ABC2, a free-to-air digital television channel, in effect a replacement for ABC Kids and Fly.\n\nIn conjunction with the ABC's radio division, New Media and Digital Services implemented the ABC's first podcasts in December 2004. By mid-2006 the ABC had become an international leader in podcasting with over fifty podcast programmes delivering hundreds of thousands of downloads per week, including trial video podcasts of The Chaser's War on Everything and jtv.\n\nIn February 2007, the New Media & Digital Services division was dissolved and divided up amongst other areas of the ABC. It was replaced by a new Innovation division, to manage ABC Online and investigate new technologies for the ABC.\nIn 2015 the Innovation division was replaced with the Digital Network division.\n\nInternational\n\nAustralia Network, formerly ABC Asia Pacific, is an international satellite television service operated by the Australian Broadcasting Corporation, funded by advertising and grants from the Department of Foreign Affairs and Trade. Aimed at the Asia-Pacific region, the service broadcasts a mixture of English language programming, including general entertainment, sport, and current affairs.\n\nABC Radio Australia is an international shortwave, satellite and internet radio service with transmissions aimed at East Asia and the Pacific Islands, although its signals are also audible in many other parts of the world. It features programmes in various languages spoken in these regions, including Mandarin, Indonesian, Vietnamese, Khmer and Tok Pisin.\n\nRadio Australia bulletins are also carried on WRN Broadcast, available via satellite in Europe and North America.\n\nCommercial\n\nABC Commercial is the division of the ABC responsible for pursuing new sources of revenue for the Corporation. It is composed of ABC Retail, ABC Consumer Publishing and Content Sales, as well as ABC Resource Hire. ABC retail outlets were established in 1974. All profits from the sale of consumer product and production services return to the Corporation to reinvest in programme-making.\n\nOrchestras\n\nUp until the installation of disc recording equipment in 1935, all content broadcast on the ABC was produced live, including music. For this purpose, the ABC established broadcasting orchestras in each state, and in some centres also employed choruses and dance bands.  This became known as the ABC Concert Music Division, which was controlled by the Federal Director of Music – the first of whom was W. G. James.\n\nThere are currently six state symphony orchestras:\n* Adelaide Symphony Orchestra\n* Melbourne Symphony Orchestra\n* Queensland Symphony Orchestra\n* Sydney Symphony Orchestra\n* Tasmanian Symphony Orchestra\n* West Australian Symphony Orchestra\n\nThe orchestras were corporatised in the 1990s, and were divested into independent companies on 1 January 2007.http://www.abc.net.au/corp/history/75years/timeline/orchestras.pdf\n\nLissajous curve logo\n\nThe ABC logo is one of the most recognisable logos in Australia. In the early years of television, the ABC had been using Lissajous curves as fillers between programmes. In July 1963, the ABC conducted a staff competition to create a new logo for use on television, stationery, publications, microphone badges and ABC vehicles. In 1965, ABC graphics designer Bill Kennard, who had been experimenting with telerecording of the cathode ray oscilloscope displays, submitted a design which was part of the waveform from an oscilloscope. The letters \"ABC\" were added to the design and it was adopted as the ABC's official logo. Kennard was presented with £25 for his design.\n\nSince its original introduction in 1965, it has been updated several times, including with the introduction of colour television in 1975. The line was thickened to feature colour in the logo. The 1975 logo is the longest-running logo, with a lifespan of 27 years. In 2001, with the introduction of digital television in Australia, ABC Television adopted a modified version of the logo, featuring a silver 3D look and losing the \"over and under\" design. However, despite the launch of this logo, the 1975 logo is still used by the corporation. In July 2002, to celebrate the ABC's 70th anniversary, the corporation adopted a new logo across all media. This new logo still used the silver 3D colour but reverted to its \"over and under\" design. In 2014, as part of ABC1's renaming back into \"ABC TV\", the 1975 logo was brought back to on-air presentation. Despite this, the 2002 silver logo remains in usage by the corporation.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Australian Broadcasting Corporation" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3079" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Australian Broadcasting Corporation (ABC) is Australia's national broadcaster, funded by the Australian Federal Government but specifically independent of Government and politics in the Commonwealth. The ABC plays a leading role in journalistic independence and is fundamental in the history of broadcasting in Australia, its model based on – but not restricted to – the BBC in the United Kingdom. Originally financed in a similar method to the British model using consumer licence fees on broadcasting receivers, its funding evolved to a projected model approved by the Australian Parliament. In recent times, the Corporation provides television, radio, online and mobile services throughout metropolitan and regional Australia, as well as overseas through Australia Plus and Radio Australia.\n\nOrigin\n\nFounded in 1929 as the Australian Broadcasting Company, the ABC was a Government licensed consortium of private entertainment and content providers, authorised under supervision to broadcast on the airwaves using a two-tiered system. The \"A\" system derived its funds primarily from the licence fees levied on the purchasers of the radio receivers, with an emphasis on building the radio wave infrastructure into regional and remote areas, whilst the \"B\" system relied on privateers and their capacity to establish viable enterprises using the new technology. Following the general downward economic trends of the era, as entrepreneurial ventures in National infrastructure struggled with viability, the \"Company\" was subsequently acquired to become a fully state-owned corporation on 1 July 1932 and renamed as Australian Broadcasting Commission, re-aligning more closely to the British, BBC model.\n\nThe Australian Broadcasting Corporation Act 1983 changed the name of the organisation to the Australian Broadcasting Corporation, effective 1 July 1983. Although funded and owned by the government, the ABC remains editorially independent as ensured through the Australian Broadcasting Corporation Act 1983.\n\nThe ABC is sometimes informally referred to as \"Aunty\", originally in imitation of the British Broadcasting Corporation's nickname.\n\nHistory\n\n1920s–40s\n\nThe first public radio station in Australia opened in Sydney on 23 November 1923 under the call sign 2SB with other stations in Melbourne, Brisbane, Adelaide, Perth and Hobart following. A licensing scheme, administered by the Postmaster-General's Department, was soon established allowing certain stations government funding, albeit with restrictions placed on their advertising content.\n\nFollowing a 1927 royal commission inquiry into radio licensing issues, the government established the National Broadcasting Service which subsequently took over a number of the larger funded stations. It also nationalised the Australian Broadcasting Company which had been created by entertainment interests to supply programs to various radio stations. On 1 July 1932, the Australian Broadcasting Commission was established, taking over the operations of the National Broadcasting Service and eventually establishing offices in each of Australia's capital cities.\n\nOver the next four years the stations were reformed into a cohesive broadcasting organisation through regular program relays, coordinated by a centralised bureaucracy. The Australian broadcast radio spectrum was constituted of the ABC and the commercial sector.\n\nNews broadcasts were initially restricted, due to pressure from Sir Keith Murdoch, who controlled many Australian newspapers. However, journalists such as Frank Dixon and John Hinde began to subvert the agreements in the late 1930s. in 1939, Warren Denning was appointed to Canberra as the first ABC political correspondent, after Murdoch had refused to allow his newspapers to cover a speech by Joseph Lyons.\n\nIn 1942 The Australian Broadcasting Act was passed, giving the ABC the power to decide when, and in what circumstances, political speeches should be broadcast. Directions from the Minister about whether or not to broadcast any matter now had to be made in writing, and any exercise of the power had to be mentioned in the Commission's Annual Report. It was used only once, in 1963. In the same year, \"Kindergarten of the Air\" began on ABC Radio in Perth, and was later broadcast nationally.\n\nCater argues that reform was urgently needed in 1945:\nBy the end of World War II, the ABC was a decadent, hollow institution.  Its authority had been compromised by a poorly drafted charter and further undermined by timid management, poor governance and creeping wartime censorship. In April 1945, Boyer refused to accept the post of chairman until Prime Minister Curtin issued a mandate of independence which Boyer drafted itself.  The ABC under Boyer and general manager Charles Moses invested as best it could in the cultural capital of the nation, establishing viable symphony orchestras and seizing on the potential of television.... [Boyer's] neutrality was never seriously questioned.Nick Cater, The Lucky Culture and the Rise of an Australian Ruling Class  (2013) p 201\n\n1950s–70s\n\nThe ABC commenced television broadcasting in 1956, and followed the earlier radio practice of naming the station after the first letter of the base state. ABN-2 (New South Wales) Sydney was inaugurated by Prime Minister Robert Menzies on 5 November 1956, with the first broadcast presented by Michael Charlton, and James Dibble reading the first television news bulletin.Australian Broadcasting Corporation, [http://www.abc.net.au/corp/history/galpost9.htm \"About the ABC: History of the ABC: James Dibble\"]. Retrieved 3 September 2008. ABV-2 (Melbourne, Victoria) followed two weeks later, on 18 November 1956. Stations in other capital cities followed: ABQ-2 (Brisbane, Queensland) (1959), ABS-2 (Adelaide, South Australia) (1960), ABW-2 (Perth, Western Australia) (1960), and ABT-2 (Hobart, Tasmania) (1960). ABC-3 Canberra opened in 1961, and ABD-6 (Darwin, Northern Territories) started broadcasting in 1971, both named after the base city.\n\nAlthough radio programs could be distributed nationally by landline, television relay facilities were not in place until the early 1960s. This meant that news bulletins had to be sent to each capital city by teleprinter, to be prepared and presented separately in each city, with filmed materials copied manually and sent to each state. Other television programs at the time included the popular Six O'Clock Rock hosted by Johnny O'Keefe, Mr. Squiggle, as well as operas and plays.\n\nIn 1973 New South Wales Rugby League boss Kevin Humphreys negotiated rugby league's first television deal with the ABC.\nIn 1975, colour television was introduced into Australia, and within a decade the ABC had moved into satellite broadcasting, greatly enhancing its ability to distribute content nationally. In the same year, the ABC introduced a 24-hour-a-day AM rock station in Sydney, 2JJ (Double Jay), which was eventually expanded into the national Triple J FM network. A year later, a national classical music network was established on the FM band, broadcasting from Adelaide. It was initially known as ABC-FM (now called ABC Classic FM) – referring both to its 'fine music' programming and radio frequency.\n\nABC budget cuts began in 1976 and continued until 1985. In 1978 the ABC NSW Staff Association organised a strike against budget cuts and political interference. Sydney ABC was off air for four days.Molomby, Tom, Is there a moderate on the roof? ABC Years, William Heinemann Australia, Port Melbourne, 1991, p.110 A packed free concert in support was held at the Regent Theatre and compered by Bob Hudson. It featured Fred Dagg and Robyn Archer.Molomby, Tom, Is there a moderate on the roof? ABC Years, William Heinemann Australia, Port Melbourne, 1991, p.114 In 1991, Tom Molomby wrote:\n\"The effects of the budget reductions had been so badly handled that the organisation was to remain seriously crippled for years.\"Molomby, Tom, Is there a moderate on the roof? ABC Years, William Heinemann Australia, Port Melbourne, 1991, p.160\n\n1980s–90s\n\nThe Australian Broadcasting Corporation Act 1983 changed the name of the organisation from the \"Australian Broadcasting Commission\" to the \"Australian Broadcasting Corporation\", effective 1 July 1983. At the same time, the newly formed Corporation underwent significant restructuring. The ABC was split into separate television and radio divisions, with an overhaul of management, finance, property and engineering. Geoffrey Whitehead[http://bookstore.iuniverse.com/Products/SKU-000538367/Tending-the-Flame-of-Democracy.aspx 2012 publication by Geoffrey Whitehead \"Tending the Flame of Democracy\"]  retrieved 26 June 2013 was the initial managing director; however, following his resignation in 1986, David Hill (at the time chair of the ABC Board) took over his position.\n\nProgram production in indigenous affairs, comedy, social history and current affairs was significantly expanded, while the Corporation's output of drama was boosted. Local production trebled from 1986–91 with the assistance of co-production, co-financing, and pre-sales arrangements.\n\nA new Concert Music Department was formed in 1985 to co-ordinate the corporation's six symphony orchestras, which in turn received a greater level of autonomy to better respond to local needs. Open-air free concerts and tours, educational activities, and joint ventures with other music groups were undertaken at the time to expand the orchestras' audience reach.\n\nABC Radio was restructured significantly again in 1985 – Radio One became the Metropolitan network, while Radio 2 became known as Radio National (callsigns, however, were not standardised until 1990). New programs such as The World Today, Australia All Over, and The Coodabeen Champions were introduced, while ABC-FM established an Australian Music Unit in 1989. Radio Australia began to focus on the Asia-Pacific region, with coverage targeted at the south west and central Pacific, south-east Asia, and north Asia. Radio Australia also carried more news coverage, with special broadcasts during the 1987 Fijian coup, Tiananmen Square massacre, and the First Gulf War.\n\nIn 1991, the Corporation's Sydney radio and orchestral operations moved to a new building built by Leighton Holdings on a single site in the inner-city suburb of Ultimo. In Melbourne, the ABC Southbank Centre was completed in 1994, and now houses the radio division in Victoria as well as the Melbourne Symphony Orchestra.\n\nThe ABC Multimedia Unit was established in July 1995, to manage the new ABC website (launched in August). Funding was allocated later that year specifically for online content, as opposed to reliance on funding for television and radio content. The first online election coverage was put together in 1996, and included news, electorate maps, candidate information and live results.\n\nBy the early 1990s, all major ABC broadcasting outlets moved to 24-hour-a-day operation, while regional radio coverage in Australia was extended with 80 new transmitters. Live television broadcasts of selected parliamentary sessions started in 1990. ABC NewsRadio, a continuous news network broadcast on the Parliamentary and News Network when parliament is not sitting, was launched on 5 October 1994.\n\nInternational television service Australia Television International was established in 1993, while at the same time Radio Australia increased its international reach. Reduced funding in 1997 for Radio Australia resulted in staff and programming cuts.\n\nAustralia Television was sold to the Seven Network in 1998, however the service continued to show ABC news and current affairs programming up until its closure in 2001. The ABC's television operation joined its radio and online divisions at the corporation's Ultimo headquarters in 2000.\n\n2000s\n\nIn 2001, digital television commenced after four years of preparation. In readiness, the ABC had fully digitised its production, post-production and transmission facilities – heralded at the time as \"the greatest advance in television technology since the introduction of colour\". The first programmes to be produced in widescreen were drama series Something in the Air, Grass Roots and In the Mind of the Architect.\n\nAt the same time, the ABC's Multimedia division was renamed \"ABC New Media\", becoming an output division of the ABC alongside Television and Radio. Legislation allowed the ABC to provide 'multichannels' – additional, digital-only, television services managed by the New Media Division. Soon after the introduction of digital television in 2001, Fly TV and the ABC Kids channel launched, showing a mix of programming aimed at teenagers and children.\n\nIn 2002, the ABC launched ABC Asia Pacific – the replacement for the defunct Australia Television International operated previously by the Seven Network. Much like its predecessor, and companion radio network Radio Australia, the service provided a mix of programming targeted at audiences throughout the Asia-Pacific region. Funding cuts in 2003 led to the closure of Fly TV and the ABC Kids channel.\n\nThe ABC launched a digital radio service, ABC DiG, in November 2002, available though the internet and digital television, but not available through any other terrestrial broadcast until DAB+ became available in 2009.\n\nABC2, a second attempt at a digital-only television channel, launched on 7 March 2005. Unlike its predecessors the new service was not dependent on government funding, instead running on a budget of A$3 million per year. Minister for Communications Helen Coonan inaugurated the channel at Parliament House three days later. Genre restrictions limiting the types of programming the channel could carry were lifted in October 2006 – ABC2 was henceforth able to carry programming classified as comedy, drama, national news, sport and entertainment.\n\nA high incidence of breast cancer in female staff working at the ABC's offices in Brisbane led to the closure of the site, based in Toowong, on 21 December 2006. Sixteen women were diagnosed with the disease in a period spanning 1994 to 2007. A progress report released in March 2007 by an independent panel formed to investigate the occurrences found that the rate of occurrence for breast cancer rate at the offices was eleven times higher than elsewhere – after the closure of the site, the ABC's Brisbane-based television and radio operations were moved to alternate locations around the city, including Ten Brisbane's studios at Mt Coot-tha. The ABC's managing director, Mark Scott, announced in August 2007 that new studios would be built on the site, following the final release of the Review and Scientific Investigation Panel's report. In January 2012 the ABC in Brisbane moved into purpose-built accommodation in South Bank.\n\nOn 8 February 2008, ABC TV was rebranded as ABC1, complementing the existing ABC2 digital-only channel which was launched on 7 March 2005. Branding was also added for a new kids' channel that had been announced throughout the Howard Government based on their winning the 2007 election but left to the 2009 Rudd Government Budget where ABC3 was funded and announced in June. A new online video-on-demand service launched in July of the same year, titled ABC iview, and the ABC launched digital radio broadcasts in the same month.\n\n2010s\n\nABC News launched on 22 July 2010, and brought with it both new programming content as well as a collaboration of existing news and current affair productions and resources. The ABC launched the 24-hour news channel to both complement its existing 24-hour ABC News Radio service and compete with commercial offerings on cable TV. It became the ABC's fifth domestic TV channel and the fourth launched within the past 10 years.\n\nOn 20 July 2014, ABC1 reverted to its original name of ABC.[https://www.theguardian.com/media/2014/jul/10/abc-rebrands-its-main-television-channel-using-social-media-hashtag ABC rebrands its main television channel using social media hashtag], The Guardian,  \n10 July 2014\n\nIn 2014 the ABC ran its first \"Mental As\" week focusing on improving awareness of mental health issues, as part of Mental Health Week.\n\nIn December 2015 it was announced that former BSkyB, Star TV and Google executive Michelle Guthrie would take over from managing director Mark Scott, who was to retire in April 2016.\n\nCorporation\n\nStructure\n\nBelow is a diagram of the ABC's divisional structure.\n\nManagement\n\nThe operations of the ABC are governed by a board of directors, consisting of a managing director, five to seven directors, and until 2006, a staff-elected director. The managing director is appointed by the board for a period of up to five years, but is eligible for renewal. The authority and guidelines for the appointment of directors is provided for in the Australian Broadcasting Corporation Act 1983.\n\nAppointments to the ABC Board made by successive governments have often resulted in criticism of the appointees' political affiliation, background, and relative merit. Past appointments have associated directly with political parties – five of fourteen appointed chairmen have been accused of political affiliation or friendship, include Richard Downing and Ken Myer (both of whom publicly endorsed the Australian Labor Party at the 1972 election), as well as Sir Henry Bland.  David Hill was close to Neville Wran, while Donald McDonald was considered to be a close friend of John Howard.\n\nFrom 2003 the Howard Government made several controversial appointments to the ABC Board, including prominent ABC critic Janet Albrechtsen, Ron Brunton, and Keith Windschuttle.\n\nDuring their 2007 federal election campaign, Labor announced plans to introduce a new system, similar to that of the BBC, for appointing members to the board. Under the new system, candidates for the ABC Board would be considered by an independent panel established \"at arm's length\" from the Communications Minister. If the Minister chose someone not on the panel's shortlist, they would be required to justify this to parliament. The ABC chairman would be nominated by the Prime Minister and endorsed by the Leader of the Opposition.\n\nThe new merit-based appointment system was announced on 16 October, in advance of the new triennial funding period starting in 2009.\n\nCurrent Board members are:\n\nFunding\n\nThe ABC is funded mainly by the Australian government, in addition to some revenue received from its retail outlets. In the 2006–07 federal budget, the ABC received A$823 million of government funding, increased to $840 million in 2008–09.Retrieved 4 December 2013 [http://www.budget.gov.au/2012-13/content/bp4/html/bp4_ar_04_dbcde.htm Budget Paper No. 4 2012–2013] In the 2009–10 federal budget, the ABC received funding of $929.9 million.\n\nUntil 1948, the ABC was funded directly by radio licence fees; amendments were also made to the Australian Broadcasting Act that meant the ABC would receive its funding directly from the federal government. Licence fees remained until 1973 when they were abolished by the Whitlam Labor government, on the basis that the near-universality of television and radio services meant that public funding was a fairer method of providing revenue for government-owned radio and television broadcasters.\n\nThe term \"where your 8 cents a day goes\", coined in the late 1980s during funding negotiations, is often used in reference to the services provided by the ABC. It is estimated that the cost of the ABC per head of population per day was 7.1 cents a day, based on the Corporation's 2007–08 'base funding' of $543 million.  Budget figures above show the ABC costs over 14 cents per day today.\n\nFederal funding to the ABC: of $1,022.6 million in 2016-17; $1,029.9 million in 2017-18; and $1,036.5 million in 2018-19. https://www.communications.gov.au/file/17236/download?token=atNjL8Za\n\nPolitics and criticism\n\nIndependence and impartiality\n\nUnder the Australian Broadcasting Corporation Act 1983, the ABC Board is bound to \"maintain the independence and integrity of the Corporation\" and to ensure that \"the gathering and presentation by the Corporation of news and information is accurate and impartial according to the recognized standards of objective journalism.\"\n\nIn relation to impartiality and diversity of perspectives, the current ABC editorial policy requires of the broadcaster that:\n\nCriticisms \n\nAs a publicly funded broadcaster, the ABC is expected not to take editorial stances on political issues, and is required to present a range of views with impartiality. Over the decades, accusations of \"bias\" at the ABC have arisen at different times, and various inquiries undertaken.\n\nReviews of the ABC are regularly commissioned and sometimes not released. A 2004 Roy Morgan media credibility survey found that media professionals regarded ABC Radio as the most accurate news source in the country. In mid 2013 the University of the Sunshine Coast released a study of the professional views of journalists. Slightly over half of respondents expected to vote for either Labor or The Greens whereas just under a third planned to vote Coalition. In contrast over 40% of ABC journalists would vote for The Greens and almost a third Labor.[http://www.theaustralian.com.au/opinion/columnists/jennifer-oriel/diversity-of-thought-practically-whitewashed-by-pc-ideology/news-story/9d16179ec45fe24f6b05072f64540ec7 Why the ABC is at odds with us]; www.theaustralia.com.au; July 24, 2017 \n \nDr Rhonda Jolly's 2014 ABC Overview noted that \"many commentators have argued consistently that there is a left wing bias which dominates ABC news and programming\" and cited a 2005 piece by Paul Gray that the broadcaster was overly influenced by the \"narrow middle-class values of the Australian secular Left\" and said that \"while the national broadcaster had at times offended governments of all persuasions, it had always adopted a 'from the Left' perspective.\" Jolly also noted however that supporters of the ABC \"deny claims that the broadcaster is either intentionally or inadvertently biased\" and that \"Speaking from opposition, politicians have praised the ABC for its scrutiny of government.\" The paper noted that, in December 2013, ABC chairman James Spigelman called four independent audits a year in response to the frequent allegations of lack of impartiality in news and current affairs.[http://www.aph.gov.au/About_Parliament/Parliamentary_Departments/Parliamentary_Library/pubs/rp/rp1415/ABCoverview#_Toc395086092 The AVC: An Overview]; http://www.aph.gov.au; 11 August 2014 In response to one set of criticisms, journalist Annabel Crabb, who has worked at the ABC, commented: \"every single day I see that organisation give voices to Australians who otherwise wouldn't be heard, on topics that are too uncommercial or too remote or too hard to be covered by anyone else, broadcasting into areas from which others have long withdrawn resources.\"\n\n1960s and 1970s \n\nThe conservative Liberal Party governments in the 1960s and 1970s attempted to influence the ABC's political coverage by threatening to reduce funding for its news and current affairs division.\n\nHawke-Keating Government \n\nBob Hawke criticised some of the 7.30 Report's coverage of the 1991 Gulf War to which he committed naval forces as being \"loaded\", \"biased\" and \"disgraceful\".[http://www.theage.com.au/comment/abbotts-bias-crusade-as-simple-as-abc-20140130-31phn.html#ixzz48nAslZrK Abbott's Bias Crusade: as simple as ABC]; The Age; January 31, 2014\n\nHoward Government \n\nFor much of the Howard Government years, ABC TV's masthead political programs were anchored by Labor affiliated journalists Kerry O'Brien, Barrie Cassidy and Maxine McKew. 7.30 Report and Insiders were hosted by former Labor staffers Kerry O'Brien and Barrie Cassidy respectively, while the 2007 election saw Lateline host McKew defeat Liberal Prime Minister John Howard as the Labor candidate for the seat of Bennelong. At that same election, Liberal front bencher Joe Hockey was challenged unsuccessfully by ABC Sydney News weatherman turned Labor candidate Mike Bailey in the Seat of North Sydney.[http://www.smh.com.au/news/national/weatherman-bailey-labors-newest-recruit/2007/05/22/1179601361057.html Weatherman Bailey Labor's newest recruit]; May 22, 2007\n\nOf the 1996 prime ministerial Election debates between Opposition Leader John Howard and Labor Prime Minister Paul Keating, Howard later wrote: \"I flatly refused to have Kerry O'Brien of the ABC [moderate the debates] because of the way he had handled the second Keating-Hewson debate in 1993\" in which O'Brien \"went in to bat\" for Keating.John Howard; Lazarus Rising: A Personal and Political Autobiography; Harper Collins; 2010; pp. 194 & 223 Howard went on to win that election. A decade later, the ABC Media Watch program reported that NSW Liberal Senator Concetta Fierravanti-Wells had written to her constituents to say that the ABC had \"a collective loathing\" of John Howard. At the end of the Howard Government's term in 2007, left-wing political commentator Robert Manne wrote in The Monthly that the Howard Government had viewed the broadcaster as being run by \"left-wing ideologues\" who had \"supposedly pushed the agenda of the Left on issues like refugees, the republic, multiculturalism, reconciliation, radical feminism, extreme environmentalism, anti-Americanism, gay rights and so on.\"\n\nSoon after coming to office in 1996, the Howard Government reduced the ABC's operating grants by 10%.Senator K. Lundy, Adjournment speech, Senate Hansard, 10 September 1996 Its appointment of Jonathan Shier to the position of managing director was controversial, for his program of budget cuts, restructuring and the loss of several high-profile personalities and shows. Shier left the position early, on 31 October 2001. 7.30 Report anchor Kerry O'Brien opposed Howard's budget cuts to the ABC, and describes the appointment of Shier as its Managing Director as a manifestation of the \"conservative obsession with the ABC as a kind of biased, left-wing culture\".http://www.smh.com.au/entertainment/tv-and-radio/kerry-obrien-opens-up-about-his-critics-his-family-and-a-new-life-in-byron-20101130-18el9.html#ixzz437fX64JG\n\nIn Howard's last election, he was defeated in the Seat of Bennelong by Labor candidate Maxine McKew, who had hosted Lateline during the Howard era. Peter Mares reported for Radio National that \"some wags described it as an 'internal promotion', while others said she'd simply moved from the 'media wing' to the 'political wing' of the ALP\". Mares consulted ABC journalist turned NSW Liberal MLA Pru Goward who said: \" I have no doubt there was left-wing bias, I certainly thought it when I was there\", while McKew said there was no left wing bias, though \"what I detected years ago in the ABC, much more of a collectivist philosophy\".\n\nRudd-Gillard-Rudd Government (2007–2013) \n\nABC TV's masthead political programs continued to have strong Labor Party connections through the period. In October 2010, the ABC announced that former Labor staffer Kerry O'Brien would host Four Corners, beginning in 2011. Former Labor staffer Barrie Cassidy continued to host the Insiders program. In December 2010, Chris Uhlmann, husband of Labor MP Gai Brodtmann, was appointed as co-host of the 7.30 current affairs program. In 2012, Sydney ABC News anchor Juanita Phillips began a relationship with Labor's Minister for Climate Change, Greg Combet.\n\nConservative commentators such as Andrew Bolt, Tim Blair and Gerard Henderson accused the ABC of a left-wing bias.\n\nAbbott-Turnbull Government (2013–present) \n\nLiberal Prime Minister Tony Abbott perceived the ABC to be left wing and hostile to his government, while his successor Malcolm Turnbull enjoyed better relations with the National Broadcaster. When the ABC co-operated with The Guardian to publish stolen documents purporting to reveal monitoring of Indonesian officials by Australian spy agencies under the Rudd Government, Abbott told 2GB radio: \"A lot of people feel at the moment that the ABC instinctively takes everyone's side but Australia's\".  Abbott reportedly called the Q&A program a \"Lefty Lynch Mob\".[http://www.news.com.au/entertainment/tv/tony-abbott-calls-qa-a-lefty-lynch-mob-as-abc-agrees-to-external-review-of-the-show/news-story/f2a708455ee73c79a4db75e2563130a5 Tony Abbott reportedly calls Q&A a 'lefty lynch mob', as ABC agrees to external review of the show]; news.com.au; 24 June 2015 When it invited a man convicted of threatening Commonwealth officials to participate in questioning one of his ministers amid a heightened terrorism alert in June 2015, Abbott asked the makers of the program: \"whose side are you on?\".[http://www.smh.com.au/federal-politics/political-news/whose-side-are-you-on-tony-abbott-lashes-abcs-qa-program-20150623-ghvd0l.html#ixzz48n1mfY00 'Whose side are you on?' Tony Abbott lashes ABC's Q&A program]; smh.com.au; June 23, 2015 The ABC found that there had been an \"error of judgement', but repeated the program later in the week, prompting Abbott to say that \"heads should roll\" over the affair.[http://www.skynews.com.au/news/top-stories/2015/06/25/-heads-should-roll--at-abc-over-q-and-a-rerun.html 'Heads should roll' at ABC over Q and A rerun] ; Sky News; 25 June 2015 Abbott initiated a brief ministerial boycott of the Q&A program following the affair.[http://www.smh.com.au/federal-politics/political-news/qa-fallout-tony-abbott-orders-frontbench-ministers-to-boycott-abc-show-20150705-gi5olb.html Q&A fallout: Tony Abbott orders frontbench ministers to boycott ABC show]; SMH; 6 July 2015\n\nThe broadcaster was critical of Abbott when he broke an election-eve promise not to make cuts to the ABC, and required 4.6% cuts over five years as part of his \"Budget repair\" program. In early 2015, an internal ABC review of its coverage of Joe Hockey's first Budget criticised the post-budget interviews by 7:30 and Lateline, finding that the interviewers had given the impression of bias.[http://www.smh.com.au/federal-politics/political-news/sarah-ferguson-interview-with-joe-hockey-breached-abc-bias-guidelines-review-20150216-13gbmj.html#ixzz3kdTWqNtk Sarah Ferguson interview with Joe Hockey 'breached ABC bias guidelines': review]; The Sydney Morning Herald; 17 February 2015\n\nWhen Abbott lost the leadership to Turnbull in the September 2015 Liberal leadership spill, the hosts of the ABC's political programs spoke in favour of Abbott's demise. Kerry O'Brien and Barrie Cassidy, hosts respectively of the ABC's flagship weekly current affairs programs Four Corners and Insiders, welcomed the replacement of Abbott by Turnbull,http://www.smh.com.au/entertainment/tv-and-radio/kerry-obrien-stepping-down-as-host-of-abctvs-four-corners-20151106-gkssti.htmlhttp://www.abc.net.au/news/2015-09-18/cassidy-the-rage-in-canberra-isnt-felt-elsewhere/6783840 as did ABC radio commentators Fran Kellyhttp://www.abc.net.au/insiders/content/2015/s4352244.htm Paul BongiornoRN Breakfast with Fran Kelly, ABC Radio National, 8 March 2016 and Amanda Vanstone.Counterpoint, ABC Radio National, 18 April 2016 Fairfax and News Limited reported that Leigh Sales, the host of 7.30 gave Turnbull an unusually warm first interview following his toppling of Abbott.http://www.smh.com.au/entertainment/tv-and-radio/leigh-sales-criticised-for-softtouch-interview-with-malcolm-turnbull-20150921-gjrsmg.htmlhttp://www.theaustralian.com.au/subscribe/news/1/index.html?sourceCodeTAWEB_WRE170_a_GGL&mode\npremium&desthttp://www.theaustralian.com.au/business/media/softly-softly-as-leigh-sales-uses-kid-gloves-on-malcolm-turnbull/story-fna045gd-1227537789836&memtype\nanonymous\n\nIn a March 2016 interview with ABC Managing Director Mark Scott, Media Watch host Paul Barry examined the question of perceptions of left wing bias at the ABC. Scott noted that while perhaps the ABC was more concerned about gay marriage than about electricity prices, he did not accept the criticism of bias because \"a lot of that criticism comes from right wing commentators and they wonder where are the strong right wing commentators on the ABC. We don't do that kind of journalism. We don't ask questions about our journalists' voting pattern and where their ideology are. We look at the journalism that they put to air and we have strong editorial standards...\"[http://www.abc.net.au/mediawatch/transcripts/s4432757.htm Easter Special: An interview with Mark Scott]; Media Watch; Episode 09, 28 March 2016. Following the interview, conservative ABC critic Andrew Bolt wrote \"How can the man heading our biggest media organisation be so blind to the ABC's unlawful and dangerous Leftist bias?\" while former Media Watch host Jonathan Holmes wrote for The Age that this interview indicated that ABC management had failed to recognise a clear problem of left wing bias among some capital city radio presenters.[http://www.theage.com.au/comment/abc-radio-personalities-need-to-tune-out-their-leftwing-bias-20160404-gnyfse.html#ixzz48n8clYIF ABC radio personalities need to tune out their left-wing bias]; Jonathan Holmes, The Age; April 5, 2016\n\nOver the period, ABC TV and radio hosts advocated strongly in support of same-sex marriage, upon which the wider Australian community and political parties were divided. When the Turnbull Government announced plans for a postal plebiscite on the issue, advocacy for change continued, prompting a call for restraint from the ABC's editorial policy manager Mark Maley.[http://www.news.com.au/finance/business/media/the-abc-does-not-have-a-position-on-the-issue-abc-tells-staff-to-stop-campaigning-for-samesex-marriage/news-story/5b66b904187e8bb7651f6275bc6dbe8b 'The ABC does not have a position on the issue': ABC tells staff to stop campaigning for same-sex marriage]; www.news.com.au; Auhust 10, 2017\n\nAn interview by ABC presenter Joe O'Brien with Lyle Shelton was the subject of a complaint by the Australian Christian Lobby. Bringing up Ian Thorpe's swimming achievements, O'Brien asked Shelton \"what right do you have to participate in that joy, and take national pride in those achievements, if you now deny him the right to feel like an equal and experience the joy of marriage?\" In rejecting any perceived bias, the ABC said \"It was a 'devil's advocate' question and not inconsistent with standards\".\n\nOpposition to Australia Day\n\nThe ABC is criticised for giving undue support to opposition to Australia Day being held on 26 January.[http://www.heraldsun.com.au/news/abc-under-fire-for-politicising-australia-day-by-moving-triple-js-hottest-100-countdown/news-story/3a7e2e553ec4fca81538bb734ccb88fd ABC under fire for ‘politicising’ Australia Day by moving Triple J’s Hottest 100 countdown]; http://www.heraldsun.com.au/; 27 November 2017 In 2017, the ABC's youth radio network announced that, after extensive consultation and opinion polling, it would no longer play its Hottest 100 Australian music list on Australia Day, choosing instead to broadcast the playlist on the fourth weekend in January. [http://www.abc.net.au/triplej/news/musicnews/triple-j-hottest-100-is-moving-to-a-new-date-and-heres-why/9197254 triple j's Hottest 100 is moving to a new date and here's why]; www.abc.net.au; 27 Nov 2017 The Federal Communications Minister Mitch Fifield said in response \"I am bewildered by the ABC’s decision to move the Hottest 100 from Australia Day. The ABC shouldn’t be buying into this debate. Australia Day is our national day. The ABC should honour it and not mess with the Hottest 100.\"[http://www.theaustralian.com.au/national-affairs/cool-reception-as-jjj-moves-its-hottest-100/news-story/17f9b03c1dce83fe20cee3f2ef548241 Cool reception as JJJ moves its Hottest 100]; www.theaustralian.com.au, 28 November 2017[https://www.theguardian.com/australia-news/2017/nov/27/triple-j-moves-hottest-100-from-australia-day-after-protests Triple J moves Hottest 100 from Australia Day after protests]; www.theguardian.com; 27 November 2017 In 2018, an opinion piece  appeared on ABC's website suggesting the date should be moved to 1 January, citing symbolism.\n\nABC journalists in politics\n\nA number of former journalists and presenters have moved from positions at the ABC to politics.\n\nState Labor premiers and chief ministers Bob Carr,\nAlan Carpenter,\nand Clare Martin are all former ABC journalists. Other ABC Labor politicians include Mary Delahunty, Maxine McKew,  Mike Bailey, Ian Baker, Leon Bignell, John Bowler, Bob Debus, Malarndirri McCarthy, Frank McGuire, Neville Oliver and Diana Warnock. Senior ABC political reporter Kerry O'Brien was press secretary to Labor prime minister Gough Whitlam and Labor deputy leader Lionel Bowenhttp://www.smh.com.au/entertainment/tv-and-radio/kerry-obrien-opens-up-about-his-critics-his-family-and-a-new-life-in-byron-20101130-18el9.html and Barrie Cassidy was press secretary to Labor prime minister Bob Hawke. Susan Templeman's husband, Ron Fuller, is the former Chief of Staff for ABC TV News. Radio National's Phillip Adams is a former member of the Communist Party of Australia and the Labor Party, and Melbourne ABC radio's Jon Faine is a former member of the Labor Party.[http://www.crikey.com.au/2007/06/29/crikeys-bias-o-meter-part-v-the-shock-jocks/ Crikey's Bias-o-meter Part V: the shock jocks]; Stephen Mayne; crikey.com.au; 29 June 2007\n\nOn the Coalition side of politics,  Pru Goward has served as a Minister in the NSW state Liberal Government, Rob Messenger, Peter Collins, Eoin Cameron, Scott Emerson and Sarah Henderson all held, or hold, positions at the ABC. Radio National's Counterpoint program is hosted by former Liberal minister Amanda Vanstone, who describes herself as \"liberal\" rather than \"conservative\".Counterpoint, ABC Radio National, 18 April 2016\n\nResearch undertaken by the broadcaster in 2007 indicated that out of a total of 19 former employees moving into party political positions, 10 have joined the Labor Party and nine the Liberal Party.\n\nServices\n\nRadio\n\nThe ABC operates 54 local radio stations, in addition to four national networks and international service Radio Australia. In addition, DiG Radio launched on digital platforms in 2002, currently offering three separate stations.\n\nABC Local Radio is the Corporation's flagship radio station in each broadcast area. There are 54 individual stations, each with a similar format consisting of locally presented light entertainment, news, talk back, music, sport and interviews, in addition to some national programming such as AM, PM, The World Today, sporting events and Nightlife.\n\nABC Grandstand is a live radio sports focused commentary and talk-back program which runs on the Australian Broadcasting Corporation local radio network across Australia and on one digital-only station. The program runs on Saturdays and Sundays, typically from noon or an hour before, until 6 pm.\n\nDouble J is aimed at over-30s alternative music listeners. It is owned and operated by the Australian Broadcasting Corporation.\n\nABC Jazz was launched as a digital only station designed to broadcast a variety of different jazz styles including bebop, acid jazz, cool jazz and contemporary styles of Jazz.\n\nTriple J Unearthed is where artists upload their music and they play and judge it on the channel.\n\nABC Extra is for special events national Digital Radio channel brings you extra coverage of events and ideas that matter.\n\nABC Radio Australia is the international radio station.\n\nABC Country features country style music.\n\nABC Radio National broadcasts more than 60 special interest programmes per week covering a range of topics including music, comedy, book readings, radio dramas, poetry, science, health, the arts, religion, social history and current affairs.\n\nABC NewsRadio is a rolling news service, previously known as the Parliamentary and News Network. The service was established to broadcast federal parliamentary sittings, to relieve the local ABC radio network from this intermittent task, and to provide a news service at other times. The network broadcasts news on a 24/7 format with updates on the quarter-hour. Much of its news content is produced by the ABC itself, however many programmes are relayed from the BBC World Service, NPR, Deutsche Welle, Radio Netherlands and CNN Radio.\n\nABC Classic FM was the ABC's first FM radio service. It was originally known simply as \"ABC FM\", and for a short time \"ABC Fine Music\". Its format borrowed heavily from community stations that eventually founded the Fine Music Network, as well as BBC Radio 3.\n\nTriple J is the national youth radio network, and broadcasts contemporary alternative and independent music; it is targeted at people aged 18–35. While the network plays music from around the world, it has a strong focus on local artists. Triple J was formerly known as \"Double Jay\" when it launched in Sydney on 19 January 1975.\n\nABC Radio broadcasts regular news bulletins across most of its radio stations.  Many of these bulletins are heralded by the \"Majestic Fanfare\", written by British composer Charles Williams in 1935.\n\nTelevision\n\nThe ABC operates 6 national television channels.\n\nABC is a TV channel that consists of programs of:\n* Art and Culture: Stories I Want To Tell You In Person, The A-Z Of Contemporary Art, \n* Current Affairs: 7.30, ABC News, Australian Story, Back Roads, Four Corners, Insiders, Landline, Media Watch, Q&A, The Drum. \n* Comedy: Birds of a feather, Growing Up Gracefully, It's A Date, Luke Warm Sex, Shaun Micallef's MAD AS HELL, Utopia\n* Documentaries and Factual: Antiques Roadshow, Ask The Doctor, Back Roads, Brian Cox: Life Of A Universe, Catalyst, City In The Sky, Compass, David Attenborough's Natural History Museum Alive, Dream Build, Enigma Man: A Stone Age Mystery, Grand Designs, Grand Designs New Zealand, The Checkout, Q&A, Joanna Lumley's India, Mary Berry's Absolute Favourites, Media Watch.\n* Drama: Agatha Raisin, Cleverman, Death In Paradise, Doc Martin, Father Brown, Happy Valley, Humans, Line Of Duty, Midsomer Murders, Prime Suspect 1973, Pulse\n* Entertainment: Adam Hills: The Last Leg, Eggheads, Gardening Australia, Grand Designs, Growing Up Grafefully, Hard Quiz, Pointless, QI, Antiques Roadshow, Short Cuts To Glory, The Checkout, The House,  You Can't Ask That\n* Indigenous: Cleverman\n* Environment: Wild Life At The Zoo, Landline, Gardening Australia\n* News: 7.30, ABC News, Australian Story, Back Roads, Four Corners, Insiders, Landline, Media Watch, Offsiders, Q&A, The Drum.\n* Sport: Golf: PGA TOUR Highlights, Offsiders\n* Special Events\n* Science: Ask The Doctor, Becoming Superhuman, Brian Cox: Life Of A Universe, Catalyst, Gardening Australia, Humans, Stargazing Live, Todd Sampson's Life On The Line\n\nABC HD has the same programs as ABC but is in high definition.\n\nABC Comedy has comedy and was renamed on 4 December 2017 from ABC 2.\n\nABC Me is another TV channel, but with a focus for primary school children, 6–15 years old. It broadcasts a range of genres, including comedy, drama, music, animation, extreme sports, wildlife and news-based programmes.\n\nABC Kids is a TV channel for children under 6, with educational programs.\n\nABC NEWS is a 24-hour news channel with news related programs, such as News Breakfast, Weekend Breakfast, ABC News Mornings, ABC News at Noon, ABC News Afternoons, ABC News — Early Edition, 7.30, Insiders, Four Corners, Behind the News, Q&A, Catalyst, Landline, Offsiders, One Plus One, The Business, The Drum, The Quarters, The World, State to State, Capital Hill\n\nStudios\n\nThe ABC operates ABC Studios.[http://www.abc.net.au/studiosmediaproduction/ ABC Studios and Media Production] ABC, the Corporation's original television service, receives the bulk of funding for television and shows first-run news, and ABC Kids.\n\nOnline\n\nAn experimental Multimedia Unit was established in 1995, charged with developing policy for the ABC's work in web publishing. This unit continued until 2000, when the New Media division was formed, bringing together the ABC's online output as a division similar to Television or Radio. The division had over a million pages of material published by late 2003.\n\nIn 2001 the New Media division became New Media and Digital Services, reflecting the broader remit to develop content for digital platforms such as digital television. In addition to ABC Online, the division also had responsibility over the ABC's two digital television services, Fly TV and the ABC Kids channel, until their closure in 2003. In March 2005 the division oversaw the launch of ABC2, a free-to-air digital television channel, in effect a replacement for ABC Kids and Fly.\n\nIn conjunction with the ABC's radio division, New Media and Digital Services implemented the ABC's first podcasts in December 2004. By mid-2006 the ABC had become an international leader in podcasting with over fifty podcast programmes delivering hundreds of thousands of downloads per week, including trial video podcasts of The Chaser's War on Everything and jtv.\n\nIn February 2007, the New Media & Digital Services division was dissolved and divided up amongst other areas of the ABC. It was replaced by a new Innovation division, to manage ABC Online and investigate new technologies for the ABC.\nIn 2015 the Innovation division was replaced with the Digital Network division.\n\nInternational\n\nAustralia Network, formerly ABC Asia Pacific, is an international satellite television service operated by the Australian Broadcasting Corporation, funded by advertising and grants from the Department of Foreign Affairs and Trade. Aimed at the Asia-Pacific region, the service broadcasts a mixture of English language programming, including general entertainment, sport, and current affairs.\n\nABC Radio Australia is an international shortwave, satellite and internet radio service with transmissions aimed at East Asia and the Pacific Islands, although its signals are also audible in many other parts of the world. It features programmes in various languages spoken in these regions, including Mandarin, Indonesian, Vietnamese, Khmer and Tok Pisin.\n\nRadio Australia bulletins are also carried on WRN Broadcast, available via satellite in Europe and North America.\n\nCommercial\n\nABC Commercial is the division of the ABC responsible for pursuing new sources of revenue for the Corporation. It is composed of ABC Retail, ABC Consumer Publishing and Content Sales, as well as ABC Resource Hire. ABC retail outlets were established in 1974. All profits from the sale of consumer product and production services return to the Corporation to reinvest in programme-making.\n\nOrchestras\n\nUp until the installation of disc recording equipment in 1935, all content broadcast on the ABC was produced live, including music. For this purpose, the ABC established broadcasting orchestras in each state, and in some centres also employed choruses and dance bands.  This became known as the ABC Concert Music Division, which was controlled by the Federal Director of Music – the first of whom was W. G. James.\n\nThere are currently six state symphony orchestras:\n* Adelaide Symphony Orchestra\n* Melbourne Symphony Orchestra\n* Queensland Symphony Orchestra\n* Sydney Symphony Orchestra\n* Tasmanian Symphony Orchestra\n* West Australian Symphony Orchestra\n\nThe orchestras were corporatised in the 1990s, and were divested into independent companies on 1 January 2007.http://www.abc.net.au/corp/history/75years/timeline/orchestras.pdf\n\nLissajous curve logo\n\nThe ABC logo is one of the most recognisable logos in Australia. In the early years of television, the ABC had been using Lissajous curves as fillers between programmes. In July 1963, the ABC conducted a staff competition to create a new logo for use on television, stationery, publications, microphone badges and ABC vehicles. In 1965, ABC graphics designer Bill Kennard, who had been experimenting with telerecording of the cathode ray oscilloscope displays, submitted a design which was part of the waveform from an oscilloscope. The letters \"ABC\" were added to the design and it was adopted as the ABC's official logo. Kennard was presented with £25 for his design.\n\nSince its original introduction in 1965, it has been updated several times, including with the introduction of colour television in 1975. The line was thickened to feature colour in the logo. The 1975 logo is the longest-running logo, with a lifespan of 27 years. In 2001, with the introduction of digital television in Australia, ABC Television adopted a modified version of the logo, featuring a silver 3D look and losing the \"over and under\" design. However, despite the launch of this logo, the 1975 logo is still used by the corporation. In July 2002, to celebrate the ABC's 70th anniversary, the corporation adopted a new logo across all media. This new logo still used the silver 3D colour but reverted to its \"over and under\" design. In 2014, as part of ABC1's renaming back into \"ABC TV\", the 1975 logo was brought back to on-air presentation. Despite this, the 2002 silver logo remains in usage by the corporation. Australian Broadcasting Corporation. http://en.wikipedia.org/?curid=3079."
  }
}
