{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16162",
  "eid" : "24206800-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778569856,
  "textBody" : "Jewish eschatology is the area of theology and philosophy concerned with events that will happen in the end of days and related concepts, according to the Hebrew Bible and Jewish thought. This includes the ingathering of the exiled diaspora, the coming of a Jewish Messiah, afterlife, and the revival of the dead Tzadikim.  In Judaism, end times are usually called the \"end of days\" (aḥarit ha-yamim, אחרית הימים), a phrase that appears several times in the Tanakh. \n\nUntil the late modern era, the standard Jewish belief was that after one dies, one's immortal soul joins God in the world to come while one's body decomposes.  At the end of days, God will recompose one's body, place within it one's immortal soul, and that person will  stand before God in judgement.  The idea of a messianic age has a prominent place in Jewish thought, and is incorporated as part of the end of days.   Jewish philosophers from medieval times to the present day have emphasized the soul's immortality and deemphasized the resurrection of the dead.Gillman, Neil. \"Eschatology.\" Etz Hayim: Torah and Commentary. Ed. David L. Lieber. The Jewish Publication Society, 2001. 1434-1439.\n\nOverview and textual sources\n\nIn Judaism, the main textual source for the belief in the end of days and accompanying events is the Tanakh or Hebrew Bible. In the Five Books of Moses (the Torah), references are made in Deuteronomy 28-31, that the Jews will not be able to keep the Laws of Moses in the Land of Israel and will be subsequently exiled but ultimately redeemed. The books of the Hebrew Prophets elaborated and prophesied about the end of days.\n\nIn rabbinic literature, the Rabbis elaborated and explained the prophecies that were found in the Hebrew Bible along with the oral law and Rabbinic traditions about its meaning.\n\nThe main tenets of Jewish eschatology are the following, in no particular order, elaborated in the Books of Isaiah, Jeremiah and Ezekiel:\n*End of world (before everything as follows).\n*God redeems Israel (i.e. the Jewish people) from the captivity that began during the Babylonian Exile, in a new Exodus\n*God returns the Jewish people to the Land of Israel\n*God restores the House of David and the Temple in Jerusalem\n*God creates a regent from the House of David (i.e. the Jewish Messiah) to lead the Jewish people and the world and usher in an age of justice and peace\n*All nations recognize that the God of Israel is the only true God\n*God resurrects the dead\n*God creates a new heaven and a new earth\n\nIt is also believed that history will complete itself and the ultimate destination will be reached when all mankind returns to the Garden of Eden.\n\nJewish messianism\n\nThe Hebrew word mashiach (or moshiach) refers to the Jewish idea of the messiah. Mashiach means anointed, a meaning preserved in the English word derived from it, messiah. The Messiah is to be a human leader, physically descended from the Davidic line, who will rule and unite the people of IsraelMegillah 17b-18a, Taanit 8b and will usher in the Messianic AgeSotah 9a of global and universal peace. While the name of Jewish Messiah is considered to be one of the things that precede creation,[http://www.chabad.org/library/moshiach/article_cdo/aid/101679/jewish/The-Personality-of-Mashiach.htm The Personality of Mashiach]; web-look-up: 18-11-2011. he is not considered divine, in contrast to Christianity where Jesus is both divine and the Messiah.\n\nIn biblical times the title mashiach was awarded to someone in a high position of nobility and greatness. For example, Cohen ha-Mašíaḥ means High Priest. In the Talmudic era the title mashiach or מלך המשיח, Méleḫ ha-Mašíaḥ (in the Tiberian vocalization is pronounced Méleḵ haMMāšîªḥ) and literally means \"the anointed King\". It is a reference to the Jewish leader and king that will redeem Israel in the end of days and usher in a messianic era of peace and prosperity for both the living and deceased.[http://www.chabad.org/library/article_cdo/aid/108400/jewish/The-End-of-Days.htm What is the Jewish Belief About Moshiach?]; web-look-up: 03-10-2010.\n\nInterpretations from the Tanakh (Hebrew Bible)\n\nMost textual requirements concerning the Messiah and his reign are inferred from verses in the Book of Isaiah, although aspects are mentioned in other prophets as well.\n*The Sanhedrin will be re-established (Isaiah 1:26)\n*Once he is King, leaders of other nations will look to him for guidance (Isaiah 2:4)\n*The whole world will worship the One God of Israel (Isaiah 2:17)\n*He will be descended from King David (Isaiah 11:1) via King Solomon (1 Chron. 22:8–10)\n*The messiah will be a man of this world, an observant Jew with \"fear of God\" (Isaiah 11:2)\n*Evil and tyranny will not be able to stand before his leadership (Isaiah 11:4)\n*Knowledge of God will fill the world (Isaiah 11:9)\n*He will include and attract people from all cultures and nations (Isaiah 11:10)\n*All Israelites will be returned to their homeland (Isaiah 11:12, Zechariah 10:6)\n*Death will be swallowed up forever (Isaiah 25:8)\n*There will be no more hunger or illness, and death will cease (Isaiah 25:8)\n*The dead will rise again (Isaiah 26:19)\n*The house of David shall be as God (Zechariah 12:8) \n*God will seek to destroy all the nations that go against Jerusalem (Zechariah 12:9, Isaiah 60:12)\n*Israel and Judah will be made into one nation again (Zechariah 11:12-14, Ezekiel 37:16-22)\n*The Jewish people will experience eternal joy and gladness (Isaiah 51:11)\n*He will be a messenger of peace (Isaiah 53:7)\n*Nations will recognize the wrongs they did Israel (Isaiah 52:13–53:5)\n*The peoples of the world will turn to the Jews for spiritual guidance (Zechariah 8:23)\n*The ruined cities of Israel will be restored (Ezekiel 16:55)\n*Weapons of war will be destroyed (Ezekiel 39:9)\n*The Temple will be rebuilt (Ezekiel 40) resuming many of the suspended mitzvot (commandments)\n*He will then perfect the entire world to serve God together (Zephaniah 3:9)\n*He will take the barren land and make it abundant and fruitful (Isaiah 51:3, Amos 9:13–15, Ezekiel 36:29–30, Isaiah 11:6–9)\n\nTalmud\n\nThe Babylonian Talmud, tractate Sanhedrin, contains a long discussion of the events leading to the coming of the Messiah, for example:\n\nThroughout Jewish history Jews have compared these passages (and others) to contemporary events in search of signs of the Messiah's imminent arrival, continuing into present times. For example, many Orthodox Jewish leaders have suggested that the devastation among Jews wrought by the Holocaust may represent a sign of hope for the Messiah's present imminent arrival.\n\nThe Talmud tells many stories about the Messiah, some of which represent famous Talmudic rabbis as receiving personal visitations from Elijah the Prophet and the Messiah. For example:\n\nRabbinic commentaries\n\nThe Medieval rabbinic figure Maimonides (Rabbi Moshe ben Maimon), also known as the Rambam, wrote a commentary to tractate Sanhedrin stressing a relatively naturalistic interpretation of the Messiah and de-emphasizing miraculous elements. His commentary became widely (although not universally) accepted in the non- or less-mystical branches of Orthodox Judaism:\n\nAccording to the Talmud,Babylonian Talmud Rosh Hashana 31a and Sanhedrin 97a the Midrash,Pirke De Rabbi Eliezer, Gerald Friedlander, Sepher-Hermon Press, New York, 1981, p. 141. and the Kabbalistic work, the Zohar,Zohar (1:117a) and Zohar Vayera 119a the 'deadline' by which the Messiah must appear is 6000 years from creation. Orthodox and Hasidic Jews believe that the Hebrew calendar dates back to the time of creation; the year 2009-2010 (the Hebrew New Year begins during September or October) of the Gregorian calendar corresponds to the Hebrew year 5770.\n\nThere is a kabbalistic traditionZohar, Vayera 119a, Ramban on Genesis 2:3 that maintains that the seven days of creation in Genesis 1 correspond to seven millennia of the existence of natural creation. The tradition teaches that the seventh day of the week, Shabbat or the day of rest, corresponds to the seventh millennium (Hebrew years 6000 - 7000), the age of universal 'rest' - the Messianic Era.\n\nThe Talmud comments:\n\nR. Katina said, “Six thousand years the world will exist and one [thousand, the seventh], it shall be desolate (haruv), as it is written, ‘And the Lord alone shall be exalted in that day’ (Isa. 2:11)... R. Katina also taught, “Just as the seventh year is the Shmita year, so too does the world have one thousand years out of seven that are fallow (mushmat), as it is written, ‘And the Lord alone shall be exalted in that day’ (Isa. 2:11); and further it is written, ‘A psalm and song for the Shabbat day’ (Ps. 92:1) – meaning the day that is altogether Shabbat – and also it is said, ‘For a thousand years in Thy sight are but as yesterday when it is past’ (Ps.90:4) (Sanhedrin 97a).”\n\nThe Midrash comments:\n\n\"Six eons for going in and coming out, for war and peace. The seventh eon is entirely Shabbat and rest for life everlasting \".\n\nThe Zohar explains:\n\n\"The redemption of Israel will come about through the mystic force of the letter “Vav” [which has the numerical value of six], namely, in the sixth millennium.... Happy are those who will be left alive at the end of the sixth millennium to enter the Shabbat, which is the seventh millennium; for that is a day set apart for the Holy One on which to effect the union of new souls with old souls in the world (Zohar, Vayera 119a).\"\n\nElaborating on this theme are numerous early and late Jewish scholars, including the Ramban,Ramban on Genesis (2:3) Isaac Abrabanel,Abarbanel on Genesis 2 Abraham Ibn Ezra,Ramban quoting Ibn Ezra at Leviticus (25:2) Rabbeinu Bachya,Bachya on Genesis 2:3 the Vilna Gaon,Safra D'Tzniusa, Ch. 5 the Lubavitcher Rebbe,Sefer HaSichos 5750:254 the Ramchal,Derech Hashem 4:7:2 Aryeh Kaplan, and Rebbetzin Esther Jungreis.\n\nOrthodox Judaism\n\nThe belief in a personal Messiah of the Davidic line is a universal tenet of faith among Orthodox Jews and one of Maimonides' thirteen principles of faith.\n\nSome authorities in Orthodox Judaism believe that this era will lead to supernatural events culminating in a bodily resurrection of the dead. Maimonides, on the other hand, holds that the events of the messianic era are not specifically connected with the resurrection. (See the Maimonides article.)\n\nConservative Judaism\n\nConservative Judaism varies in its teachings. While it retains traditional references to a personal redeemer and prayers for the restoration of the Davidic line in the liturgy, Conservative Jews are more inclined to accept the idea of a messianic era:\n\nReform Judaism\n\nReform Judaism generally concurs with the more liberal Conservative perspective of a future messianic era rather than a personal Messiah.Ginsberg, Harold Louis, et al. (2007). \"[http://www.jewishvirtuallibrary.org/messiah Messiah].\" In Michael Berenbaum and Fred Skolnik (Eds.), Encyclopaedia Judaica. 2nd ed. Detroit: Macmillan Reference USA. Vol. 14, pp. 110-115; here: section \"In Modern Jewish Thought\", by Louis Jacobs, p. 114. Retrieved via Gale Virtual Reference Library, 30 January 2018. Available online via Jewish Virtual Library. Reflecting its philosophical position, Reform Judaism, unlike Conservative Judaism, has altered the traditional prayers to refer to \"redemption\" rather than a \"redeemer\" and removed petitions for restoration of the House of David.\n\nGog and Magog\n\nAccording to some commentators, the war of Gog and Magog envisioned in Ezekiel 38 is expected to occur in the end of days. This is described to be a climactic war that is said to occur at the end of the Jewish exile. Radak comments on Zechariah 14, that in the end of days Jerusalem will be the battle ground of Gog and Magog.\n\nAccording to other commentators the long exile has already made up for it and it will no longer occur.\n\nThe world to come\n\nThe hereafter is known as olam ha-baCraig L. Blomberg, Sung Wook Chung A case for historic premillennialism 2009 \"In certain sources, Olam Ha-Ba is uniquely associated with teachings about collective redemption and resurrection, but in other places Olam Ha-Ba is conceived of as an afterlife realm for the individual.\"Elliot Kiba Ginsburg The Sabbath in the classical Kabbalah 1989 p145 \"More frequently the Rabbis used 'olam ha-ba' with reference to the hereafter:\" (the \"world to come\", עולם הבא in Hebrew), and related to concepts of Gan Eden (the Heavenly \"Garden in Eden\", or paradise) and Gehinom.They are told to live their life on earth to the full as their body will stay there but their soul live on.[http://www.simpletoremember.com/vitals/jewish-afterlife-beliefs.htm Jewish Afterlife Beliefs at SimpleToRemember.com] The accepted halakha is that it is impossible for living human beings to know what the world to come is like,Steinsaltz, Adin Evan-Israel.  Berakhot. Edited by Tvi Hersh Weinreb. Koren Publishers Jerusalem, 2012.  Koren Talmud Bavli. although Rav, a rabbi quoted in the Talmud, describes it thusly: \"In the World-to-Come there is no eating, no drinking, no procreation, no business negotiations, no jealousy, no hatred, and no competition.  Rather, the righteous sit with their crowns upon their heads, enjoying the splendor of the Divine Presence.\"Koren Talmud Bavli: Berakhot 17a.  Editor-in-chief, Tzvi Hersh Weinreb.  Koren Publishers Jerusalem, 2012.\n\nThe phrase \"olam ha-ba\" does not occur in the Hebrew Bible.  \n\nIn the late Second Temple period, beliefs about the ultimate fate of the individual were diverse. The Essenes believed in the immortality of the soul, but the Pharisees and Sadducees, apparently, did not.ed. Jacob Neusner, Alan Jeffery Avery-Peck Judaism in Late Antiquity: Part Four: Death, Life-After-Death,\" 2000 Page 187 III. THE DEAD SEA SCROLLS 8. DEATH, RESURRECTION, AND LIFE AFTER DEATH IN THE QUMRAN THE DEAD SEA SCROLLS. chapter by Philip R. Davies University of Sheffield. \"In the late Second Temple Period, beliefs about the ultimate fate of the individual were diverse. It is well-known that Josephus, in his description of the four Jewish \"sects\" (and supported by Matt. ... in the resurrection while the Pharisees did, and the Essenes subscribed to the doctrine of the immortality of the soul (War 2.154: \"...although bodies are corruptible and their matter unstable, souls are immortal and live forever...\")\" The Dead Sea Scrolls, Jewish Pseudepigrapha and Jewish magical papyri reflect this diversity.\n\nAccording to Maimonides, any non-Jew who lives according to the Seven Laws of Noah is regarded as a righteous gentile, and is assured of a place in the world to come, the final reward of the righteous.Mishneh Torah, Hilkhot M'lakhim 8:14Encyclopedia Talmudit (Hebrew edition, Israel, 5741/1981, entry Ben Noah, end of article); note the variant reading of Maimonides and the references in the footnote\n\nMedieval rabbinical views\n\nWhile all classic rabbinic sources discuss the afterlife, the classic Medieval scholars dispute the nature of existence in the \"End of Days\" after the messianic period. While Maimonides describes an entirely spiritual existence for souls, which he calls \"disembodied intellects,\" Nahmanides discusses an intensely spiritual existence on Earth, where spirituality and physicality are merged. Both agree that life after death is as Maimonides describes the \"End of Days.\" This existence entails an extremely heightened understanding of and connection to the Divine Presence. This view is shared by all classic rabbinic scholars.\n\nThere is much rabbinic material on what happens to the soul of the deceased after death, what it experiences, and where it goes. At various points in the afterlife journey, the soul may encounter: Hibbut ha-kever, the pains of the grave; Dumah, the angel of silence; Satan as the angel of death; the Kaf ha-Kela, the catapult of the soul; Gehinom (purgatory); and Gan Eden (heaven or paradise). All classic rabbinic scholars agree that these concepts are beyond typical human understanding. Therefore, these ideas are expressed throughout rabbinic literature through many varied parables and analogies.\n\nGehinom is fairly well defined in rabbinic literature. It is sometimes translated as \"hell\", but is much closer to the Catholic view of purgatory than to the Christian view of hell, which differs from the classical Jewish view. Rabbinic thought maintains that souls are not tortured in gehinom forever; the longest that one can be there is said to be eleven months, with the exception of heretics, and unobservant Jews. This is the reason that even when in mourning for near relatives, Jews will not recite mourner's kaddish for longer than an eleven-month period. Gehinom is considered a spiritual forge where the soul is purified for its eventual ascent to Gan Eden (\"Garden of Eden\").\n\nIn contemporary Judaism\n\nIn explaining the Orthodox view of the afterlife, Irving Greenberg, a Modern Orthodox rabbi, discussed both the \"world to come\" and the belief in punishment and reward in a Moment Magazine \"Ask the Rabbis\" forum:\n\nConservative Judaism both affirms belief in the world beyond (as referenced in the Amidah and Maimonides' Thirteen Precepts of Faith) while recognizing that human understanding is limited and we cannot know exactly what the world beyond consists of.  Reform and Reconstructionist Judaism affirm belief in the afterlife, though they downplay the theological implications in favor of emphasizing the importance of the \"here and now,\" as opposed to reward and punishment.\n\nResurrection of the dead\n\nThe Book of the Prophet of Ezekiel displays the first perception of resurrection. Under the Babylonian Empire in 539 BCE, Ezekiel described God's will to revive flesh upon the bones of dead Judeans. However, Ezekiel's narrative of resurrection was intended only as a metaphor for national rebirth, promising the Jews return to Israel and reconstruction of the Temple. \n\nDaniel's eschatological prophecy, taking place in the 6th century BCE, promised literal resurrection to the Jews, in concrete detail. Daniel wrote that with the coming of the Archangel Michael, misery would beset the world, and only those whose names were in a divine book would be resurrected. Moreover, Daniel's promise of resurrection was intended only for the most righteous and the most sinful because the afterlife was a place for the virtuous individuals to be rewarded and the sinful individuals to receive eternal punishment.\n\nGreek and Persian culture influenced Jewish sects to believe in an afterlife between the 6th and 4th centuries BCE as well.\n\nThe Hebrew Bible, at least as seen through interpretation of Bavli Sanhedrin, contains frequent reference to resurrection of the dead.Jacob Neusner The Documentary History of Judaism and Its Recent Interpreters 2012 - Page 138 - \"... tense in Scripture, proof of the resurrection is drawn from numerous passages: Exodus 15.1; Joshua 8.30; 1 Kings 11.7; Psalm 84.5; Isaiah 52.8; Deuteronomy 33.6; Daniel 12.2 and 12.13. The grave and womb in Proverbs 30.16 are likewise ... The Mishnah (c. 200) lists belief in the resurrection of the dead as one of three essential beliefs necessary for a Jew to participate in it:\n\nIn the late Second Temple period, the Pharisees believed in resurrection, while Essenes and Sadducees did not. During the Rabbinic period, beginning in the late first century and carrying on to the present, the works of Daniel were included into the Hebrew Bible, signaling the adoption of Jewish resurrection into the officially sacred texts.\n\n \n\nJewish liturgy, most notably the Amidah, contains references to the tenet of the bodily resurrection of the dead.Sommer, Benjamin D. \"Isaiah\" Introduction and Annotations.  The Jewish Study Bible.  Ed. Adele Berlin and Marc Zvi Brettler. New York: Oxford University Press, 2004.  780–916. In contemporary Judaism, both Orthodox Judaism and Conservative Judaism maintain the traditional references to it in their liturgy. However, many Conservative Jews interpret the tenet metaphorically rather than literally.Emet Ve-Emunah: Statement of Principles of Conservative Judaism. Reform and Reconstructionist Judaism have altered traditional references to the resurrection of the dead in the liturgy (\"who gives life to the dead\") to refer to \"who gives life to all.\"\n\nReincarnation\n\nThe notion of reincarnation, while held as a mystical belief by some, is not an essential tenet of traditional Judaism. It is not mentioned in traditional classical sources such as the Tanakh (\"Hebrew Bible\"), the classical rabbinic works (Mishnah and Talmud), or Maimonides' 13 Principles of Faith. While one might contend the idea of reincarnation is not outlined in the Tanakh, there exist references to resurrection throughout Isaiah. However, books of Kabbalah — Jewish mysticism — teach a belief in gilgul, transmigration of souls, and hence the belief is universal in Hasidic Judaism, which regards the Kabbalah as sacred and authoritative.\n\nAmong well-known Rabbis who rejected the idea of reincarnation are Saadia Gaon, David Kimhi, Hasdai Crescas, Yedayah Bedershi (early 14th century), Joseph Albo, Abraham ibn Daud and Leon de Modena. Among the Geonim, Hai Gaon argued with Saadia Gaon in favour of gilgulim.\n\nRabbis who accepted the idea of reincarnation include, from Medieval times: the mystical leaders Nahmanides (the Ramban) and Rabbenu Bahya ben Asher; from the 16th-century: Levi ibn Habib (the Ralbah), and from the mystical school of Safed Shelomoh Alkabez, Isaac Luria (the Ari) and his exponent Hayyim Vital; and from the 18th-century: the founder of Hasidism Yisrael Baal Shem Tov, later Hasidic Masters, and the Lithuanian Jewish Orthodox leader and Kabbalist the Vilna Gaon.\n\nWith the 16th-century rational systemisation of Cordoveran Kabbalah by the Ramak, and the subsequent new paradigm of Lurianic Kabbalah by the Ari, Kabbalah replaced \"Hakirah\" (Rationalistic Medieval Jewish Philosophy) as the mainstream traditional Jewish theology, both in scholarly circles and in the popular imagination. Isaac Luria taught new explanations of the process of gilgul, and identification of the reincarnations of historic Jewish figures, which were compiled by Haim Vital in his Shaar HaGilgulim.\n\nIn Kabbalistic understanding of gilgul, which differs from many Eastern-religious views, reincarnation is not fatalistic or automatic, nor is it essentially a punishment of sin, or reward of virtue. In Judaism, the Heavenly realms could fulfill Maimonides' Principle of faith in Reward and Punishment. Rather, it is concerned with the process of individual Tikkun (Rectification) of the soul. In Kabbalistic interpretation, each Jewish soul is reincarnated enough times only in order to fulfil each of the 613 Mitzvot. The souls of the righteous among the Nations may be assisted through gilgulim to fulfil their Seven Laws of Noah. As such gilgul is an expression of Divine compassion, and is seen as a Heavenly agreement with the individual soul to descend again. This stress on physical performance and perfection of each Mitzvah is tied to the Lurianic doctrine of Cosmic Tikkun of Creation. In these new teachings, a cosmic catastrophe occurred at the beginning of creation called the \"Shattering of the Vessels\" of the Sephirot in the \"World of Tohu (Chaos)\". The vessels of the Sephirot broke and fell down through the spiritual worlds until they were embedded in our physical realm as \"sparks of holiness\" (Nitzutzot). The reason in Lurianic Kabbalah that almost all Mitzvot involve physical action is that through their performance, they elevate each particular spark of holiness associated with that commandment. Once all the sparks are redeemed to their spiritual source, the Messianic Era begins. This metaphysical theology gives cosmic significance to the life of each person, as each individual has particular tasks that only they can fulfil. Therefore, gilgulim assist the individual soul in this cosmic plan. This also explains the Kabbalistic reason why the future eschatological Utopia will be in this world, as only in the lowest, physical realm is the purpose of creation fulfilled.\n\nThe idea of gilgul became popular in folk belief, and is found in much Yiddish literature among Ashkenazi Jews.\n\nThe last judgment\n\nIn Judaism, the day of judgment happens every year on Rosh Hashanah; therefore, the belief in a last day of judgment for all mankind is disputed. Some rabbis hold that there will be such a day following the resurrection of the dead. Others hold that there is no need for that because of Rosh Hashanah. Yet others hold that this accounting and judgment happens when one dies. Other rabbis hold that the last judgment only applies to the gentile nations and not the Jewish people.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jewish eschatology" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16162" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jewish eschatology is the area of theology and philosophy concerned with events that will happen in the end of days and related concepts, according to the Hebrew Bible and Jewish thought. This includes the ingathering of the exiled diaspora, the coming of a Jewish Messiah, afterlife, and the revival of the dead Tzadikim.  In Judaism, end times are usually called the \"end of days\" (aḥarit ha-yamim, אחרית הימים), a phrase that appears several times in the Tanakh. \n\nUntil the late modern era, the standard Jewish belief was that after one dies, one's immortal soul joins God in the world to come while one's body decomposes.  At the end of days, God will recompose one's body, place within it one's immortal soul, and that person will  stand before God in judgement.  The idea of a messianic age has a prominent place in Jewish thought, and is incorporated as part of the end of days.   Jewish philosophers from medieval times to the present day have emphasized the soul's immortality and deemphasized the resurrection of the dead.Gillman, Neil. \"Eschatology.\" Etz Hayim: Torah and Commentary. Ed. David L. Lieber. The Jewish Publication Society, 2001. 1434-1439.\n\nOverview and textual sources\n\nIn Judaism, the main textual source for the belief in the end of days and accompanying events is the Tanakh or Hebrew Bible. In the Five Books of Moses (the Torah), references are made in Deuteronomy 28-31, that the Jews will not be able to keep the Laws of Moses in the Land of Israel and will be subsequently exiled but ultimately redeemed. The books of the Hebrew Prophets elaborated and prophesied about the end of days.\n\nIn rabbinic literature, the Rabbis elaborated and explained the prophecies that were found in the Hebrew Bible along with the oral law and Rabbinic traditions about its meaning.\n\nThe main tenets of Jewish eschatology are the following, in no particular order, elaborated in the Books of Isaiah, Jeremiah and Ezekiel:\n*End of world (before everything as follows).\n*God redeems Israel (i.e. the Jewish people) from the captivity that began during the Babylonian Exile, in a new Exodus\n*God returns the Jewish people to the Land of Israel\n*God restores the House of David and the Temple in Jerusalem\n*God creates a regent from the House of David (i.e. the Jewish Messiah) to lead the Jewish people and the world and usher in an age of justice and peace\n*All nations recognize that the God of Israel is the only true God\n*God resurrects the dead\n*God creates a new heaven and a new earth\n\nIt is also believed that history will complete itself and the ultimate destination will be reached when all mankind returns to the Garden of Eden.\n\nJewish messianism\n\nThe Hebrew word mashiach (or moshiach) refers to the Jewish idea of the messiah. Mashiach means anointed, a meaning preserved in the English word derived from it, messiah. The Messiah is to be a human leader, physically descended from the Davidic line, who will rule and unite the people of IsraelMegillah 17b-18a, Taanit 8b and will usher in the Messianic AgeSotah 9a of global and universal peace. While the name of Jewish Messiah is considered to be one of the things that precede creation,[http://www.chabad.org/library/moshiach/article_cdo/aid/101679/jewish/The-Personality-of-Mashiach.htm The Personality of Mashiach]; web-look-up: 18-11-2011. he is not considered divine, in contrast to Christianity where Jesus is both divine and the Messiah.\n\nIn biblical times the title mashiach was awarded to someone in a high position of nobility and greatness. For example, Cohen ha-Mašíaḥ means High Priest. In the Talmudic era the title mashiach or מלך המשיח, Méleḫ ha-Mašíaḥ (in the Tiberian vocalization is pronounced Méleḵ haMMāšîªḥ) and literally means \"the anointed King\". It is a reference to the Jewish leader and king that will redeem Israel in the end of days and usher in a messianic era of peace and prosperity for both the living and deceased.[http://www.chabad.org/library/article_cdo/aid/108400/jewish/The-End-of-Days.htm What is the Jewish Belief About Moshiach?]; web-look-up: 03-10-2010.\n\nInterpretations from the Tanakh (Hebrew Bible)\n\nMost textual requirements concerning the Messiah and his reign are inferred from verses in the Book of Isaiah, although aspects are mentioned in other prophets as well.\n*The Sanhedrin will be re-established (Isaiah 1:26)\n*Once he is King, leaders of other nations will look to him for guidance (Isaiah 2:4)\n*The whole world will worship the One God of Israel (Isaiah 2:17)\n*He will be descended from King David (Isaiah 11:1) via King Solomon (1 Chron. 22:8–10)\n*The messiah will be a man of this world, an observant Jew with \"fear of God\" (Isaiah 11:2)\n*Evil and tyranny will not be able to stand before his leadership (Isaiah 11:4)\n*Knowledge of God will fill the world (Isaiah 11:9)\n*He will include and attract people from all cultures and nations (Isaiah 11:10)\n*All Israelites will be returned to their homeland (Isaiah 11:12, Zechariah 10:6)\n*Death will be swallowed up forever (Isaiah 25:8)\n*There will be no more hunger or illness, and death will cease (Isaiah 25:8)\n*The dead will rise again (Isaiah 26:19)\n*The house of David shall be as God (Zechariah 12:8) \n*God will seek to destroy all the nations that go against Jerusalem (Zechariah 12:9, Isaiah 60:12)\n*Israel and Judah will be made into one nation again (Zechariah 11:12-14, Ezekiel 37:16-22)\n*The Jewish people will experience eternal joy and gladness (Isaiah 51:11)\n*He will be a messenger of peace (Isaiah 53:7)\n*Nations will recognize the wrongs they did Israel (Isaiah 52:13–53:5)\n*The peoples of the world will turn to the Jews for spiritual guidance (Zechariah 8:23)\n*The ruined cities of Israel will be restored (Ezekiel 16:55)\n*Weapons of war will be destroyed (Ezekiel 39:9)\n*The Temple will be rebuilt (Ezekiel 40) resuming many of the suspended mitzvot (commandments)\n*He will then perfect the entire world to serve God together (Zephaniah 3:9)\n*He will take the barren land and make it abundant and fruitful (Isaiah 51:3, Amos 9:13–15, Ezekiel 36:29–30, Isaiah 11:6–9)\n\nTalmud\n\nThe Babylonian Talmud, tractate Sanhedrin, contains a long discussion of the events leading to the coming of the Messiah, for example:\n\nThroughout Jewish history Jews have compared these passages (and others) to contemporary events in search of signs of the Messiah's imminent arrival, continuing into present times. For example, many Orthodox Jewish leaders have suggested that the devastation among Jews wrought by the Holocaust may represent a sign of hope for the Messiah's present imminent arrival.\n\nThe Talmud tells many stories about the Messiah, some of which represent famous Talmudic rabbis as receiving personal visitations from Elijah the Prophet and the Messiah. For example:\n\nRabbinic commentaries\n\nThe Medieval rabbinic figure Maimonides (Rabbi Moshe ben Maimon), also known as the Rambam, wrote a commentary to tractate Sanhedrin stressing a relatively naturalistic interpretation of the Messiah and de-emphasizing miraculous elements. His commentary became widely (although not universally) accepted in the non- or less-mystical branches of Orthodox Judaism:\n\nAccording to the Talmud,Babylonian Talmud Rosh Hashana 31a and Sanhedrin 97a the Midrash,Pirke De Rabbi Eliezer, Gerald Friedlander, Sepher-Hermon Press, New York, 1981, p. 141. and the Kabbalistic work, the Zohar,Zohar (1:117a) and Zohar Vayera 119a the 'deadline' by which the Messiah must appear is 6000 years from creation. Orthodox and Hasidic Jews believe that the Hebrew calendar dates back to the time of creation; the year 2009-2010 (the Hebrew New Year begins during September or October) of the Gregorian calendar corresponds to the Hebrew year 5770.\n\nThere is a kabbalistic traditionZohar, Vayera 119a, Ramban on Genesis 2:3 that maintains that the seven days of creation in Genesis 1 correspond to seven millennia of the existence of natural creation. The tradition teaches that the seventh day of the week, Shabbat or the day of rest, corresponds to the seventh millennium (Hebrew years 6000 - 7000), the age of universal 'rest' - the Messianic Era.\n\nThe Talmud comments:\n\nR. Katina said, “Six thousand years the world will exist and one [thousand, the seventh], it shall be desolate (haruv), as it is written, ‘And the Lord alone shall be exalted in that day’ (Isa. 2:11)... R. Katina also taught, “Just as the seventh year is the Shmita year, so too does the world have one thousand years out of seven that are fallow (mushmat), as it is written, ‘And the Lord alone shall be exalted in that day’ (Isa. 2:11); and further it is written, ‘A psalm and song for the Shabbat day’ (Ps. 92:1) – meaning the day that is altogether Shabbat – and also it is said, ‘For a thousand years in Thy sight are but as yesterday when it is past’ (Ps.90:4) (Sanhedrin 97a).”\n\nThe Midrash comments:\n\n\"Six eons for going in and coming out, for war and peace. The seventh eon is entirely Shabbat and rest for life everlasting \".\n\nThe Zohar explains:\n\n\"The redemption of Israel will come about through the mystic force of the letter “Vav” [which has the numerical value of six], namely, in the sixth millennium.... Happy are those who will be left alive at the end of the sixth millennium to enter the Shabbat, which is the seventh millennium; for that is a day set apart for the Holy One on which to effect the union of new souls with old souls in the world (Zohar, Vayera 119a).\"\n\nElaborating on this theme are numerous early and late Jewish scholars, including the Ramban,Ramban on Genesis (2:3) Isaac Abrabanel,Abarbanel on Genesis 2 Abraham Ibn Ezra,Ramban quoting Ibn Ezra at Leviticus (25:2) Rabbeinu Bachya,Bachya on Genesis 2:3 the Vilna Gaon,Safra D'Tzniusa, Ch. 5 the Lubavitcher Rebbe,Sefer HaSichos 5750:254 the Ramchal,Derech Hashem 4:7:2 Aryeh Kaplan, and Rebbetzin Esther Jungreis.\n\nOrthodox Judaism\n\nThe belief in a personal Messiah of the Davidic line is a universal tenet of faith among Orthodox Jews and one of Maimonides' thirteen principles of faith.\n\nSome authorities in Orthodox Judaism believe that this era will lead to supernatural events culminating in a bodily resurrection of the dead. Maimonides, on the other hand, holds that the events of the messianic era are not specifically connected with the resurrection. (See the Maimonides article.)\n\nConservative Judaism\n\nConservative Judaism varies in its teachings. While it retains traditional references to a personal redeemer and prayers for the restoration of the Davidic line in the liturgy, Conservative Jews are more inclined to accept the idea of a messianic era:\n\nReform Judaism\n\nReform Judaism generally concurs with the more liberal Conservative perspective of a future messianic era rather than a personal Messiah.Ginsberg, Harold Louis, et al. (2007). \"[http://www.jewishvirtuallibrary.org/messiah Messiah].\" In Michael Berenbaum and Fred Skolnik (Eds.), Encyclopaedia Judaica. 2nd ed. Detroit: Macmillan Reference USA. Vol. 14, pp. 110-115; here: section \"In Modern Jewish Thought\", by Louis Jacobs, p. 114. Retrieved via Gale Virtual Reference Library, 30 January 2018. Available online via Jewish Virtual Library. Reflecting its philosophical position, Reform Judaism, unlike Conservative Judaism, has altered the traditional prayers to refer to \"redemption\" rather than a \"redeemer\" and removed petitions for restoration of the House of David.\n\nGog and Magog\n\nAccording to some commentators, the war of Gog and Magog envisioned in Ezekiel 38 is expected to occur in the end of days. This is described to be a climactic war that is said to occur at the end of the Jewish exile. Radak comments on Zechariah 14, that in the end of days Jerusalem will be the battle ground of Gog and Magog.\n\nAccording to other commentators the long exile has already made up for it and it will no longer occur.\n\nThe world to come\n\nThe hereafter is known as olam ha-baCraig L. Blomberg, Sung Wook Chung A case for historic premillennialism 2009 \"In certain sources, Olam Ha-Ba is uniquely associated with teachings about collective redemption and resurrection, but in other places Olam Ha-Ba is conceived of as an afterlife realm for the individual.\"Elliot Kiba Ginsburg The Sabbath in the classical Kabbalah 1989 p145 \"More frequently the Rabbis used 'olam ha-ba' with reference to the hereafter:\" (the \"world to come\", עולם הבא in Hebrew), and related to concepts of Gan Eden (the Heavenly \"Garden in Eden\", or paradise) and Gehinom.They are told to live their life on earth to the full as their body will stay there but their soul live on.[http://www.simpletoremember.com/vitals/jewish-afterlife-beliefs.htm Jewish Afterlife Beliefs at SimpleToRemember.com] The accepted halakha is that it is impossible for living human beings to know what the world to come is like,Steinsaltz, Adin Evan-Israel.  Berakhot. Edited by Tvi Hersh Weinreb. Koren Publishers Jerusalem, 2012.  Koren Talmud Bavli. although Rav, a rabbi quoted in the Talmud, describes it thusly: \"In the World-to-Come there is no eating, no drinking, no procreation, no business negotiations, no jealousy, no hatred, and no competition.  Rather, the righteous sit with their crowns upon their heads, enjoying the splendor of the Divine Presence.\"Koren Talmud Bavli: Berakhot 17a.  Editor-in-chief, Tzvi Hersh Weinreb.  Koren Publishers Jerusalem, 2012.\n\nThe phrase \"olam ha-ba\" does not occur in the Hebrew Bible.  \n\nIn the late Second Temple period, beliefs about the ultimate fate of the individual were diverse. The Essenes believed in the immortality of the soul, but the Pharisees and Sadducees, apparently, did not.ed. Jacob Neusner, Alan Jeffery Avery-Peck Judaism in Late Antiquity: Part Four: Death, Life-After-Death,\" 2000 Page 187 III. THE DEAD SEA SCROLLS 8. DEATH, RESURRECTION, AND LIFE AFTER DEATH IN THE QUMRAN THE DEAD SEA SCROLLS. chapter by Philip R. Davies University of Sheffield. \"In the late Second Temple Period, beliefs about the ultimate fate of the individual were diverse. It is well-known that Josephus, in his description of the four Jewish \"sects\" (and supported by Matt. ... in the resurrection while the Pharisees did, and the Essenes subscribed to the doctrine of the immortality of the soul (War 2.154: \"...although bodies are corruptible and their matter unstable, souls are immortal and live forever...\")\" The Dead Sea Scrolls, Jewish Pseudepigrapha and Jewish magical papyri reflect this diversity.\n\nAccording to Maimonides, any non-Jew who lives according to the Seven Laws of Noah is regarded as a righteous gentile, and is assured of a place in the world to come, the final reward of the righteous.Mishneh Torah, Hilkhot M'lakhim 8:14Encyclopedia Talmudit (Hebrew edition, Israel, 5741/1981, entry Ben Noah, end of article); note the variant reading of Maimonides and the references in the footnote\n\nMedieval rabbinical views\n\nWhile all classic rabbinic sources discuss the afterlife, the classic Medieval scholars dispute the nature of existence in the \"End of Days\" after the messianic period. While Maimonides describes an entirely spiritual existence for souls, which he calls \"disembodied intellects,\" Nahmanides discusses an intensely spiritual existence on Earth, where spirituality and physicality are merged. Both agree that life after death is as Maimonides describes the \"End of Days.\" This existence entails an extremely heightened understanding of and connection to the Divine Presence. This view is shared by all classic rabbinic scholars.\n\nThere is much rabbinic material on what happens to the soul of the deceased after death, what it experiences, and where it goes. At various points in the afterlife journey, the soul may encounter: Hibbut ha-kever, the pains of the grave; Dumah, the angel of silence; Satan as the angel of death; the Kaf ha-Kela, the catapult of the soul; Gehinom (purgatory); and Gan Eden (heaven or paradise). All classic rabbinic scholars agree that these concepts are beyond typical human understanding. Therefore, these ideas are expressed throughout rabbinic literature through many varied parables and analogies.\n\nGehinom is fairly well defined in rabbinic literature. It is sometimes translated as \"hell\", but is much closer to the Catholic view of purgatory than to the Christian view of hell, which differs from the classical Jewish view. Rabbinic thought maintains that souls are not tortured in gehinom forever; the longest that one can be there is said to be eleven months, with the exception of heretics, and unobservant Jews. This is the reason that even when in mourning for near relatives, Jews will not recite mourner's kaddish for longer than an eleven-month period. Gehinom is considered a spiritual forge where the soul is purified for its eventual ascent to Gan Eden (\"Garden of Eden\").\n\nIn contemporary Judaism\n\nIn explaining the Orthodox view of the afterlife, Irving Greenberg, a Modern Orthodox rabbi, discussed both the \"world to come\" and the belief in punishment and reward in a Moment Magazine \"Ask the Rabbis\" forum:\n\nConservative Judaism both affirms belief in the world beyond (as referenced in the Amidah and Maimonides' Thirteen Precepts of Faith) while recognizing that human understanding is limited and we cannot know exactly what the world beyond consists of.  Reform and Reconstructionist Judaism affirm belief in the afterlife, though they downplay the theological implications in favor of emphasizing the importance of the \"here and now,\" as opposed to reward and punishment.\n\nResurrection of the dead\n\nThe Book of the Prophet of Ezekiel displays the first perception of resurrection. Under the Babylonian Empire in 539 BCE, Ezekiel described God's will to revive flesh upon the bones of dead Judeans. However, Ezekiel's narrative of resurrection was intended only as a metaphor for national rebirth, promising the Jews return to Israel and reconstruction of the Temple. \n\nDaniel's eschatological prophecy, taking place in the 6th century BCE, promised literal resurrection to the Jews, in concrete detail. Daniel wrote that with the coming of the Archangel Michael, misery would beset the world, and only those whose names were in a divine book would be resurrected. Moreover, Daniel's promise of resurrection was intended only for the most righteous and the most sinful because the afterlife was a place for the virtuous individuals to be rewarded and the sinful individuals to receive eternal punishment.\n\nGreek and Persian culture influenced Jewish sects to believe in an afterlife between the 6th and 4th centuries BCE as well.\n\nThe Hebrew Bible, at least as seen through interpretation of Bavli Sanhedrin, contains frequent reference to resurrection of the dead.Jacob Neusner The Documentary History of Judaism and Its Recent Interpreters 2012 - Page 138 - \"... tense in Scripture, proof of the resurrection is drawn from numerous passages: Exodus 15.1; Joshua 8.30; 1 Kings 11.7; Psalm 84.5; Isaiah 52.8; Deuteronomy 33.6; Daniel 12.2 and 12.13. The grave and womb in Proverbs 30.16 are likewise ... The Mishnah (c. 200) lists belief in the resurrection of the dead as one of three essential beliefs necessary for a Jew to participate in it:\n\nIn the late Second Temple period, the Pharisees believed in resurrection, while Essenes and Sadducees did not. During the Rabbinic period, beginning in the late first century and carrying on to the present, the works of Daniel were included into the Hebrew Bible, signaling the adoption of Jewish resurrection into the officially sacred texts.\n\n \n\nJewish liturgy, most notably the Amidah, contains references to the tenet of the bodily resurrection of the dead.Sommer, Benjamin D. \"Isaiah\" Introduction and Annotations.  The Jewish Study Bible.  Ed. Adele Berlin and Marc Zvi Brettler. New York: Oxford University Press, 2004.  780–916. In contemporary Judaism, both Orthodox Judaism and Conservative Judaism maintain the traditional references to it in their liturgy. However, many Conservative Jews interpret the tenet metaphorically rather than literally.Emet Ve-Emunah: Statement of Principles of Conservative Judaism. Reform and Reconstructionist Judaism have altered traditional references to the resurrection of the dead in the liturgy (\"who gives life to the dead\") to refer to \"who gives life to all.\"\n\nReincarnation\n\nThe notion of reincarnation, while held as a mystical belief by some, is not an essential tenet of traditional Judaism. It is not mentioned in traditional classical sources such as the Tanakh (\"Hebrew Bible\"), the classical rabbinic works (Mishnah and Talmud), or Maimonides' 13 Principles of Faith. While one might contend the idea of reincarnation is not outlined in the Tanakh, there exist references to resurrection throughout Isaiah. However, books of Kabbalah — Jewish mysticism — teach a belief in gilgul, transmigration of souls, and hence the belief is universal in Hasidic Judaism, which regards the Kabbalah as sacred and authoritative.\n\nAmong well-known Rabbis who rejected the idea of reincarnation are Saadia Gaon, David Kimhi, Hasdai Crescas, Yedayah Bedershi (early 14th century), Joseph Albo, Abraham ibn Daud and Leon de Modena. Among the Geonim, Hai Gaon argued with Saadia Gaon in favour of gilgulim.\n\nRabbis who accepted the idea of reincarnation include, from Medieval times: the mystical leaders Nahmanides (the Ramban) and Rabbenu Bahya ben Asher; from the 16th-century: Levi ibn Habib (the Ralbah), and from the mystical school of Safed Shelomoh Alkabez, Isaac Luria (the Ari) and his exponent Hayyim Vital; and from the 18th-century: the founder of Hasidism Yisrael Baal Shem Tov, later Hasidic Masters, and the Lithuanian Jewish Orthodox leader and Kabbalist the Vilna Gaon.\n\nWith the 16th-century rational systemisation of Cordoveran Kabbalah by the Ramak, and the subsequent new paradigm of Lurianic Kabbalah by the Ari, Kabbalah replaced \"Hakirah\" (Rationalistic Medieval Jewish Philosophy) as the mainstream traditional Jewish theology, both in scholarly circles and in the popular imagination. Isaac Luria taught new explanations of the process of gilgul, and identification of the reincarnations of historic Jewish figures, which were compiled by Haim Vital in his Shaar HaGilgulim.\n\nIn Kabbalistic understanding of gilgul, which differs from many Eastern-religious views, reincarnation is not fatalistic or automatic, nor is it essentially a punishment of sin, or reward of virtue. In Judaism, the Heavenly realms could fulfill Maimonides' Principle of faith in Reward and Punishment. Rather, it is concerned with the process of individual Tikkun (Rectification) of the soul. In Kabbalistic interpretation, each Jewish soul is reincarnated enough times only in order to fulfil each of the 613 Mitzvot. The souls of the righteous among the Nations may be assisted through gilgulim to fulfil their Seven Laws of Noah. As such gilgul is an expression of Divine compassion, and is seen as a Heavenly agreement with the individual soul to descend again. This stress on physical performance and perfection of each Mitzvah is tied to the Lurianic doctrine of Cosmic Tikkun of Creation. In these new teachings, a cosmic catastrophe occurred at the beginning of creation called the \"Shattering of the Vessels\" of the Sephirot in the \"World of Tohu (Chaos)\". The vessels of the Sephirot broke and fell down through the spiritual worlds until they were embedded in our physical realm as \"sparks of holiness\" (Nitzutzot). The reason in Lurianic Kabbalah that almost all Mitzvot involve physical action is that through their performance, they elevate each particular spark of holiness associated with that commandment. Once all the sparks are redeemed to their spiritual source, the Messianic Era begins. This metaphysical theology gives cosmic significance to the life of each person, as each individual has particular tasks that only they can fulfil. Therefore, gilgulim assist the individual soul in this cosmic plan. This also explains the Kabbalistic reason why the future eschatological Utopia will be in this world, as only in the lowest, physical realm is the purpose of creation fulfilled.\n\nThe idea of gilgul became popular in folk belief, and is found in much Yiddish literature among Ashkenazi Jews.\n\nThe last judgment\n\nIn Judaism, the day of judgment happens every year on Rosh Hashanah; therefore, the belief in a last day of judgment for all mankind is disputed. Some rabbis hold that there will be such a day following the resurrection of the dead. Others hold that there is no need for that because of Rosh Hashanah. Yet others hold that this accounting and judgment happens when one dies. Other rabbis hold that the last judgment only applies to the gentile nations and not the Jewish people. Jewish eschatology. http://en.wikipedia.org/?curid=16162."
  }
}
