{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14233",
  "eid" : "132bbd10-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778541409,
  "textBody" : "Hate speech is speech which attacks a person or group on the basis of attributes such as race, religion, ethnic origin, sexual orientation, disability, or gender.[http://dictionary.reference.com/browse/hate+speech Definitions for \"hate speech\"], Dictionary.com. Retrieved 25 June 2011Nockleby, John T. (2000), “Hate Speech” in Encyclopedia of the American Constitution, ed. Leonard W. Levy and Kenneth L. Karst, vol. 3. (2nd ed.), Detroit: Macmillan Reference US, pp. 1277–79. Cited in \"Library 2.0 and the Problem of Hate Speech,\" by Margaret Brown-Sica and Jeffrey Beall, [http://southernlibrarianship.icaap.org/content/v09n02/brown-sica_m01.html#_edn2 Electronic Journal of Academic and Special Librarianship, vol. 9 no. 2 (Summer 2008)]. In the law of some countries, hate speech is described as speech, gesture or conduct, writing, or display which is forbidden because it incites violence or prejudicial action against a protected group, or individual on the basis of their membership of the group, or because it disparages or intimidates a protected group, or individual on the basis of their membership of the group. The law may identify a protected group by certain characteristics.  In some countries, hate speech is not a legal term and in some it is constitutionally protected.\n\nIn some countries, a victim of hate speech may seek redress under civil law, criminal law, or both. A website which uses hate speech may be called a hate site. Many of these sites contain Internet forums and news briefs that emphasize a particular viewpoint.\n\nThere has been debate over freedom of speech, hate speech and hate speech legislation.Herz, Michael and Peter Molnar, eds. 2012. The content and context of hate speech. Cambridge University Press. Critics have argued that the term \"hate speech\" is used to silence critics.\n\nHarm caused\n\nOn the Internet\n\nOn May 31, 2016, Facebook, Google, Microsoft, and Twitter, jointly agreed to a European Union code of conduct obligating them to review \"[the] majority of valid notifications for removal of illegal hate speech\" posted on their services within 24 hours.\n\nFollowing a campaign which involved the participation of Women, Action and the Media, the Everyday Sexism Project and the activist Soraya Chemaly, who were among 100 advocacy groups, Facebook agreed to update its policy on hate speech. The campaign highlighted content that promoted domestic and sexual violence against women, and used over 57,000 tweets and more than 4,900 emails to create outcomes such as the withdrawal of advertising from Facebook by 15 companies, including Nissan UK and Nationwide UK. The social media website initially responded by stating that \"While it may be vulgar and offensive, distasteful content on its own does not violate our policies\", but then agreed to take action on May 29, 2013, after it had \"become clear that our systems to identify and remove hate speech have failed to work as effectively as we would like, particularly around issues of gender-based hate\".\n\nWith relative anonymity hate groups are able to spread misinformation easily through social media often disguised as if they were generated from legitimate sources. Some users also manipulate search engines so their hate propaganda is more accessible.\n\nCritical theory\n\nAccording to the ritual model of communication, racist expressions allow minorities to be categorized with negative attributes tied to them, and are directly harmful to them. Matsuda et al. (1993) found that racist speech could cause in the recipient of the message direct, adverse physical and emotional changes.Mari Matsuda, Charles R. Lawrence, III, et al., Words That Wound: Critical Race Theory, Assaultive Speech, and the First Amendment (Westview Press 1993) The repeated use of such expressions cause and reinforce the subordination of these minorities.\n\nHate speech laws\n\nThe International Covenant on Civil and Political Rights (ICCPR) states that \"any advocacy of national, racial or religious hatred that constitutes incitement to discrimination, hostility or violence shall be prohibited by law\".International Covenant on Civil and Political Rights, Article 20 The Convention on the Elimination of All Forms of Racial Discrimination (ICERD) prohibits all incitement of racism.Convention on the Elimination of All Forms of Racial Discrimination, Article 4 Concerning the debate over how freedom of speech applies to the Internet, conferences concerning such sites have been sponsored by the United Nations High Commissioner for Refugees.[http://www.unhchr.ch/huridocda/huridoca.nsf/AllSymbols/FA869F4E19CCCBC1C1256A570031F062/$File/G0113724.doc?OpenElement Report of the High Commissioner for Human Rights on the use of the Internet for purposes of incitement to racial hatred, racist propaganda and xenophobia, and on ways of promoting international cooperation in this area], Preparatory Committee for the World Conference Against Racism, Racial Discrimination, Xenophobia, and Related Intolerance, United Nations, 27 April 2001\n\nEnforcement \n\nHate law regulations can be divided into two types: those which are designed for public order and those which are designed to protect human dignity. Those designed to protect public order require a higher threshold to be violated, so they are not specifically enforced frequently. For example, in Northern Ireland, as of 1992 only one person was prosecuted for violating the regulation in twenty-one years. Those meant to protect human dignity have a much lower threshold to be violated, so those in Canada, Denmark, France, Germany and the Netherlands seem to be frequently enforced.\n\nEnforcement of laws regarding hate speech in the USA can interfere with constitutional rights to freedom of speech. Court rulings often must be reexamined to ensure the U.S. Constitution is being upheld in the ruling on whether or not the words count as a violation.\n\nHate speech laws by country\n\nAustralia \n\nAustralia's hate speech laws vary by jurisdiction, and seek especially to prevent victimisation on account of race.\n\nBelgium \n\nThe Belgian Anti-Racism Law, in full, the Law of 30 July 1981 on the Punishment of Certain Acts inspired by Racism or Xenophobia, is a law against hate speech and discrimination passed by the Federal Parliament of Belgium in 1981 which made certain acts motivated by racism or xenophobia illegal. It is also known as the Moureaux Law.\n\nThe Belgian Holocaust denial law, passed on 23 March 1995, bans public Holocaust denial. Specifically, the law makes it illegal to publicly \"deny, play down, justify or approve of the genocide committed by the Nazi German regime during the Second World War\". Prosecution is led by the Belgian Centre for Equal Opportunities. The offense is punishable by imprisonment of up to one year and fines of up to 2500 EUR.\n\nBrazil \n\nIn Brazil, according to the 1988 Brazilian Constitution, racism is an \"Offense with no statute of limitations and no right to bail for the defendant\".[http://www1.folha.uol.com.br/folha/cotidiano/ult95u107965.shtml \"1988 Constitution made racism a crime with no right to bail\"], Folha de S.Paulo, 15 April 2005.\n\nCanada \n\nIn Canada, advocating genocide against any \"identifiable group\" is an indictable offence under the Criminal Code and  carries a maximum sentence of five years imprisonment.  There is no minimum sentence.Criminal Code, [http://laws-lois.justice.gc.ca/eng/acts/C-46/section-318.html#h-92 RSC 1985, c C-46, s 318], \"Advocating Genocide\".\n\nPublicly inciting hatred against any identifiable group is also an offence.  It can be prosecuted either as an indictable offence with a maximum sentence of two years imprisonment, or as a summary conviction offence with a maximum sentence of six months imprisonment.  There are no minimum sentences in either case.[http://laws-lois.justice.gc.ca/eng/acts/C-46/section-319.html#h-92 RSC 1985, c C-46, s 319] [http://laws-lois.justice.gc.ca/eng/acts/C-46/section-319.html \"Public incitement of hatred\" and \"Wilful promotion of hatred\"]. The offence of publicly inciting hatred makes exceptions for cases of statements of truth, and subjects of public debate and religious doctrine. The landmark judicial decision on the constitutionality of this law was R. v. Keegstra (1990).\n\nAn \"identifiable group\" is defined for both offences as \"any section of the public distinguished by colour, race, religion, national or ethnic origin, age, sex, sexual orientation, or mental or physical disability\".\n\nChile \n\nArticle 31 of the \"Ley sobre Libertades de Opinión e Información y Ejercicio del Periodismo\" (statute on freedom of opinion and information and the performance of journalism), punishes with a large fine those who “through any means of social communication makes publications or transmissions intended to promote hatred or hostility towards persons or a group of persons due to their race, sex, religion or nationality\".  This law has been applied to expressions transmitted via the internet. There is also a rule increasing the penalties for crimes motivated by discriminatory hatred.\n\nCouncil of Europe \n\nThe Council of Europe has worked intensively on this issue. While Article 10 of the European Convention on Human Rights does not prohibit criminal laws against revisionism such as denial or minimization of genocides or crimes against humanity, as interpreted by the European Court of Human Rights (ECtHR), the Committee of Ministers of the Council of Europe went further and recommended in 1997 that member governments \"take appropriate steps to combat hate speech\" under its Recommendation R (97) 20.Council of Europe, Committee of Ministers, [https://wcd.coe.int/com.instranet.InstraServlet?commandcom.instranet.CmdBlobGet&InstranetImage\n1658005&SecMode1&DocId\n582600&Usage=2 Recommendation R (97) 20 of the Committee of Ministers to Member States on \"Hate Speech\"], adopted by the Committee of Ministers on 30 October 1997, accessed 10 March 2017 The ECtHR does not offer an accepted definition for \"hate speech\" but instead offers only parameters by which prosecutors can decide if the \"hate speech\" is entitled to the protection of freedom of speech.\n\nThe Council of Europe also created the European Commission against Racism and Intolerance, which has produced country reports and several general policy recommendations, for instance against anti-Semitism and intolerance against Muslims.\n\nCroatia \n\nThe Croatian Constitution guarantees freedom of speech, but Croatian penal code prohibits and punishes anyone \"who based on differences of race, religion, language, political or any other belief, wealth, birth, education, social status or other properties, gender, skin color, nationality or ethnicity violates basic human rights and freedoms recognized from international community\".Article 174. of Croatian penal code on Croatian Wikisource\n\nDenmark \n\nDenmark prohibits hate speech, and defines it as publicly making statements by which a group is threatened ('), insulted (') or degraded (') due to race, skin colour, national or ethnic origin, faith or sexual orientation.Danish Penal code, Straffeloven, section 266 B.\n\nFinland \n\nThere has been considerable debate over the definition of \"hate speech\" (vihapuhe) in the Finnish language.\n\nIf \"hate speech\" is taken to mean ethnic agitation, it is prohibited in Finland and defined in the section 11 of the penal code, War crimes and crimes against humanity, as published information or as an opinion or other statement that threatens or insults a group because of race, nationality, ethnicity, religion or conviction, sexual orientation, disability, or any comparable trait. Ethnic agitation is punishable with a fine or up to 2 years in prison, or 4 months to 4 years if aggravated (such as incitement to genocide).[http://www.finlex.fi/fi/laki/kaannokset/1889/en18890039.pdf Finnish Penal code] [http://www.finlex.fi/fi/laki/ajantasa/1889/18890039001 Rikoslaki]/Strafflagen Chapter 11, section 10 Ethnic agitation / Kiihottaminen kansanryhmää vastaan\n\nCritics claim that, in political contexts, labeling certain opinions and statements \"hate speech\" can be used to silence unfavorable or critical opinions and suppress debate. Certain politicians, including Member of Parliament and the leader of the Finns Party Jussi Halla-aho, consider the term \"hate speech\" problematic because of the lack of an easy definition.\n\nFrance \n\nFrance prohibits by its penal code and by its press laws public and private communication which is defamatory or insulting, or which incites discrimination, hatred, or violence against a person or a group of persons on account of place of origin, ethnicity or lack thereof, nationality, race, specific religion, sex, sexual orientation, or handicap. The law prohibits declarations that justify or deny crimes against humanity, for example, the Holocaust (Gayssot Act).Loi 90-615 du 13 juillet 1990\n\nGermany \n\nIn Germany, Volksverhetzung (\"incitement to hatred\") is a punishable offense under Section 130 of the Strafgesetzbuch (Germany's criminal code) and can lead to up to five years' imprisonment. Section 130 makes it a crime to publicly incite hatred against parts of the population or to call for violent or arbitrary measures against them or to insult, maliciously slur or defame them in a manner violating their (constitutionally protected) human dignity. Thus for instance it is illegal to publicly call certain ethnic groups \"maggots\" or \"freeloaders\".StGB §130 (2) 1. c) Volksverhetzung is punishable in Germany even if committed abroad and even if committed by non-German citizens, if only the incitement of hatred takes effect within German territory, e.g., the seditious sentiment was expressed in German writing or speech and made accessible in Germany (German criminal code's Principle of Ubiquity, Section 9 §1 Alt. 3 and 4 of the Strafgesetzbuch).\n\nOn June 30, 2017, Germany approved a bill criminalizing hate speech on social media sites. Among criminalizing hate speech, the law states that social networking sites may be fined up to €50 million ($56 million) if they persistently fail to remove illegal content within a week, including defamatory \"fake news\". \n\nIceland \n\nIn Iceland, the hate speech law is not confined to inciting hatred, as one can see from Article 233 a. in the Icelandic Penal Code, but includes simply expressing such hatred publicly:\n\nIn this context \"assault\" does not refer to physical violence but only to verbal assault.\n\nIndia \n\nFreedom of speech and expression is protected by article 19 (1) of the constitution of India, but under article 19(2) \"reasonable restrictions\" can be imposed on freedom of speech and expression in the interest of \"the sovereignty and integrity of India, the security of the State, friendly relations with foreign States, public order, decency or morality, or in relation to contempt of court, defamation or incitement to an offence\".\n\nIndonesia \n\nIndonesia has been a signatory to the International Covenant on Civil and Political Rights since 2006, but has not promulgated comprehensive legislation against hate-speech crimes. Calls for a comprehensive anti-hate speech law and associated educational program have followed statements by a leader of a hard-line Islamic organization that Balinese Hindus were mustering forces to protect the \"lascivious Miss World pageant\" in “a war against Islam\" and that \"those who fight on the path of Allah are promised heaven\". The statements are said to be an example of similar messages intolerance being preached throughout the country by radical clerics.[http://www.thejakartaglobe.com/opinion/hard-liners-targeting-miss-world-in-bali-shows-need-for-anti-hate-speech-law-in-indonesia/ \"Hard-Liners Targeting Miss World in Bali Shows Need for Anti-Hate-Speech Law in Indonesia\"], Johannes Nugroho, Jakarta Globe, 23 September 2013. Retrieved 29 September 2013.\n\nThe National Police ordered all of their personnel to anticipate any potential conflicts in society caused by hate speech. The order is stipulated in the circular signed by the National Police chief General Badrodin Haiti on Oct. 8, 2015.\n\nIreland \n\nThe Constitution of Ireland guarantees Irish citizens the right \"to express freely their convictions and opinions\"; however, this right is \"subject to public order and morality\", mass media \"shall not be used to undermine public order or morality or the authority of the State\", and \"publication or utterance of blasphemous, seditious, or indecent matter is an offence\". The Prohibition of Incitement to Hatred Act 1989 made it an offence to make, distribute, or broadcast \"threatening, abusive or insulting\" words, images, or sounds with intent or likelihood to \"stir up hatred\", where \"hatred\" is \"against a group of persons in the State or elsewhere on account of their race, colour, nationality, religion, ethnic or national origins, membership of the travelling community or sexual orientation\". The first conviction was in 2000, of a bus driver who told a Gambian passenger \"You should go back to where you came from\". Frustration at the low number of prosecutions (18 by 2011) was attributed to a misconception that the law addressed hate crimes more generally as opposed to incitement in particular.;  In 2013 the Constitutional Convention considered the constitutional prohibition of blasphemy, and recommended replacing it with a ban on incitement to religious hatred. This was endorsed by the Oireachtas, and in 2017 the Fine Gael-led government planned a referendum for October 2018.; \n\nJapan \n\nJapanese law covers threats and slander, but it \"does not apply to hate speech against general groups of people\".[http://mainichi.jp/english/english/newsselect/news/20130710p2a00m0na009000c.html \"Foreign correspondents share opinions on Japanese hate speech marches\"], The Mainichi, 10 July 2013. Retrieved 26 September 2013.  Japan became a member of the United Nations International Convention on the Elimination of All Forms of Racial Discrimination in 1995. Article 4 of the convention sets forth provisions calling for the criminalization of hate speech. But the Japanese government has suspended the provisions, saying actions to spread or promote the idea of racial discrimination have not been taken in Japan to such an extent that legal action is necessary. The Foreign Ministry says that this assessment remains unchanged.[http://ajw.asahi.com/article/behind_news/social_affairs/AJ201305100069 \"Justice minister criticizes hate speech in Japan but won't punish offenders\"], The Asahi Shimbun, 10 May 2013.  \n\nIn May 2013, the United Nations Committee on Economic, Social and Cultural Rights (CESCR) warned the Japanese government that it needs to take measures to curb hate speech against so-called comfort women. The committee's recommendation called for the Japanese government to better educate Japanese society on the plight of women who were forced into sexual slavery to prevent stigmatization, and to take necessary measures to repair the lasting effects of exploitation, including addressing their right to compensation.[http://koreajoongangdaily.joins.com/news/article/Article.aspx?aid=2972061 \"UN group urges Tokyo to curb hate speech\"], Sarah Kim, Korea JoongAng Daily, 24 May 2013. Retrieved 21 October 2013.[http://www.ecoi.net/file_upload/1930_1375189270_g1344448.pdf \"C. Principal subjects of concern and recommendations\"], Concluding observations on the third periodic report of Japan, adopted by the Committee at its fiftieth session, 29 April–17 May 2013 (E/C.12/JPN/CO/3), Committee on Economic, Social and Cultural Rights, Economic and Social Council, United Nations, 10 June 2013. \"26. The Committee is concerned about the lasting negative effects of the exploitation to which 'comfort women' were subjected on their enjoyment of economic, social and cultural rights and their entitlement to reparation (arts. 11 and 3). The Committee recommends that the State party take all necessary measures to address the lasting effects of the exploitation and to guarantee the enjoyment of economic, social and cultural rights by 'comfort women'. The Committee also recommends that the State party educate the public on the exploitation of 'comfort women' so as to prevent hate speech and other manifestations of hatred that stigmatize them.\"\n\nIn 2013, following demonstrations, parades, and comments posted on the Internet threatening violence against foreign residents of Japan, especially Koreans, there are concerns that hate speech is a growing problem in Japan.[http://www.japantimes.co.jp/news/2013/07/10/national/politicians-silent-on-curbing-hate-speech/ \"Politicians silent on curbing hate speech\"], Eric Johnston, Japan Times, 10 July 2013. Retrieved 26 September 2013.[http://www.dw.de/japan-conservatives-hate-speech-goes-too-far/a-16938717 \"Japan conservatives: 'Hate speech goes too far' \"], Julian Ryall, Deutsche Welle, 9 July 2013. Retrieved 26 September 2013.[http://www.japantimes.co.jp/opinion/2013/06/05/editorials/no-place-for-hate-speech/ \"No place for hate speech\"], Japan Times, 5 June 2013. Retrieved 26 September 2013. Prime Minister Shinzo Abe and Justice Minister Sadakazu Tanigaki have expressed concerns about the increase in hate speech, saying that it \"goes completely against the nation's dignity\", but so far have stopped short of proposing any legal action against protesters.\n\nOn 22 September 2013 around 2,000 people participated in the \"March on Tokyo for Freedom\" campaigning against recent hate speech marches. Participants called on the Japanese government to \"sincerely adhere\" to the International Convention on the Elimination of All Forms of Racial Discrimination. Sexual minorities and the disabled also participated in the march.[http://mainichi.jp/english/english/newsselect/news/20130923p2a00m0na010000c.html \"Anti-hate speech march fills streets around Shinjuku\"] , The Mainichi, 23 September 2013. Retrieved 26 September 2013.\n\nOn 25 September 2013 a new organization, \"An international network overcoming hate speech and racism\" (Norikoenet), that is opposed to hate speech against ethnic Koreans and other minorities in Japan was launched.[http://mainichi.jp/english/english/newsselect/news/20130926p2a00m0na007000c.html \"Anti-hate speech group launched in Japan\"] , The Mainichi, 26 September 2013. Retrieved 26 September 2013.\n\nOn 7 October 2013, in a rare ruling on racial discrimination against ethnic Koreans, a Japanese court ordered an anti-Korean group, Zaitokukai, to stop \"hate speech\" protests against a Korean school in Kyoto and pay the school 12.26 million yen ($126,400 U.S.) in compensation for protests that took place in 2009 and 2010.[http://www.bbc.co.uk/news/world-asia-24427921 \"Japan court in Korean discrimination ruling\"], BBC News, 7 October 2013. Retrieved 7 October 2013.[http://ajw.asahi.com/article/behind_news/social_affairs/AJ201310070090 \"Kyoto court bans 'hate speech' around school for ethnic Koreans\"] , Gakushi Fujiwara, The Asahi Shimbun, 7 October 2013. Retrieved 7 October 2013.\n\nA United Nations panel urged Japan to ban hate speech.\n\nIn May 2016 Japan passed a law dealing with hate speech. However, it does not ban hate speech and sets no penalty for committing it.Osaki, Tomohiro [http://www.japantimes.co.jp/news/2016/05/24/national/social-issues/diet-passes-japans-first-law-curb-hate-speech/ Diet passes Japan’s first law to curb hate speech May 24, 2016] Japan Times Retrieved May 27, 2016\n\nJordan \n\nSeveral Jordanian laws seek to prevent the publication or dissemination of material that would provoke strife or hatred:[http://www2.ohchr.org/english/bodies/cerd/docs/AdvanceVersions/CERD-C-JOR-13-17_en.pdf \"Jordan, Combined reports submitted for 1999, 2001, 2003, 2005, and 2007\"], Reports submitted by States parties under article 9 of the Convention on the Elimination of All Forms of Racial Discrimination, Committee on the Elimination of Racial Discrimination, United Nations, 21 September 2011, accessed 13 September 2012\n* Article 6 of Act No. 76 of 2009 regulating publicity and advertising in municipal areas states: (a) The following shall be deemed an infringement of this regulation: (i) The inclusion in publicity or advertisements of material that offends national or religious sentiment or public morals or that is prejudicial to the maintenance of public order. The publicization of ideas based on racial superiority, racial hatred and the instigation of racial discrimination against any person or group constitute punishable offences.\n* Article 20 of the Audiovisual Media Act No. 71 of 2002 states: “The licensee shall not broadcast or rebroadcast any material that is likely to provoke confessional and interethnic strife, to undermine national unity or to instigate terrorism, racism or religious intolerance or to damage domestic relations in the Kingdom.”\n* Article 7 of the Printing and Publications Act No. 8 of 1998 sets out the ethical rules that apply to journalism and the conduct of journalists. It is illegal to publish material likely to stir up hatred or to make propaganda with a view to setting citizens against one another.\n* Article 40(a)(iv) of the Print and Publications Act No. 10 of 1993 states that it is prohibited to publish articles that are likely to jeopardize national unity, incite others to commit crimes, stir up hostility, and foment hatred, division and discord between members of society.\n\nMalta\n\nThe Maltese criminal code through Articles 82A-82D prohibits in substance hate speech comprehensively as follows:\n\nNetherlands \n\nThe Dutch penal code prohibits both insulting a group (article 137c) and inciting hatred, discrimination or violence (article 137d). The definition of the offences as outlined in the penal code is as follows:\n* Article 137c: \"He who publicly, orally, in writing or graphically, intentionally expresses himself insultingly regarding a group of people because of their race, their religion or their life philosophy, their heterosexual or homosexual orientation or their physical, psychological or mental disability, shall be punished by imprisonment of no more than a year or a monetary penalty of the third category.\" [http://wetten.overheid.nl/BWBR0001854/TweedeBoek/TitelV/Artikel137c Dutch penal code – article 137c]\n* Article 137d: \"He who publicly, orally, in writing or graphically, incites hatred against, discrimination of or violent action against person or belongings of people because of their race, their religion or their life philosophy, their gender, their heterosexual or homosexual orientation or their physical, psychological or mental disability, shall be punished by imprisonment of no more than a year or a monetary penalty of the third category.\" [http://wetten.overheid.nl/BWBR0001854/TweedeBoek/TitelV/Artikel137d Dutch penal code – article 137d]\n\nIn January 2009, a court in Amsterdam ordered the prosecution of Geert Wilders, a Dutch Member of Parliament, for breaching articles 137c and 137d. On 23 June 2011, Wilders was acquitted of all charges. In 2016, in a separate case, Wilders was found guilty of both insulting a group and inciting discrimination for promising an audience that he would deliver on their demand for there to be \"fewer Moroccans\".\n\nNew Zealand \n\nNew Zealand prohibits hate speech under the Human Rights Act 1993. Section 61 (Racial Disharmony) makes it unlawful to publish or distribute \"threatening, abusive, or insulting...matter or words likely to excite hostility against or bring into contempt any group of persons...on the ground of the colour, race, or ethnic or national or ethnic origins of that group of persons\". Section 131 (Inciting Racial Disharmony) lists offences for which \"racial disharmony\" creates liability.\n\nNorway \n\nNorway prohibits hate speech, and defines it as publicly making statements that threaten or ridicule someone or that incite hatred, persecution or contempt for someone due to their skin colour, ethnic origin, homosexual orientation, religion or philosophy of life. At the same time, the Norwegian Constitution guarantees the right to free speech, and there has been an ongoing public and judicial debate over where the right balance between the ban against hate speech and the right to free speech lies. Norwegian courts have been restrictive in the use of the hate speech law and only a few persons have been sentenced for violating the law since its implementation in 1970. A public Free Speech committee (1996–1999) recommended to abolish the hate speech law but the Norwegian Parliament instead voted to slightly strengthen it.Sindre Bangstad: [http://snl.no/diskriminerende_ytringer diskriminerende ytringer] Store norske leksikon , retrieved 25 April 2013\n\nPoland \n\nThe hate speech laws in Poland punish those who offend the feelings of the religious by e.g. disturbing a religious ceremony or creating public calumny. They also prohibit public expression that insults a person or a group on account of national, ethnic, racial, or religious affiliation or the lack of a religious affiliation.\n\nRussia \n\nAccording to Article 282 of the Criminal Code, 'Raising hates or hostility, or equally humiliation of human dignity':\n\nSerbia \n\nThe Serbian constitution guarantees freedom of speech, but restricts it in certain cases to protect the rights of others. The criminal charge of \"Provoking ethnic, racial and religion based animosity and intolerance\" carries a minimum six months prison term and a maximum of ten years.Serbian Penal code, section 317.\n\nSingapore \n\nSingapore has passed numerous laws that prohibit speech that causes disharmony among various religious groups.  The Maintenance of Religious Harmony Act is an example of such legislation. The Penal Code criminalizes the deliberate promotion by someone of enmity, hatred or ill-will between different racial and religious groups on grounds of race or religion. It also makes it an offence for anyone to deliberately wound the religious or racial feelings of any person.\n\nSouth Africa \n\nIn South Africa, hate speech (along with incitement to violence and propaganda for war) is specifically excluded from protection of free speech in the Constitution. The Promotion of Equality and Prevention of Unfair Discrimination Act, 2000 contains the following clause:\n\nThe \"prohibited grounds\" include race, gender, sex, pregnancy, marital status, ethnic or social origin, colour, sexual orientation, age, disability, religion, conscience, belief, culture, language and birth.\n\nThe crime of crimen injuria (\"unlawfully, intentionally and seriously impairing the dignity of another\") may also be used to prosecute hate speech.\n\nIn 2011, a South African court banned \"Dubula iBhunu (Shoot the Boer)\", a derogatory song degrading Afrikaners, on the basis that it violated a South African law prohibiting speech that demonstrates a clear intention to be hurtful, to incite harm, or to promote hatred.\n\nIn October 2016, \"the draft Hate Crimes Bill was introduced. It aims to address racism, racial discrimination, xenophobia and discrimination based on gender, sex, sexual orientation and other issues, by providing an offence of hate crime. It includes controversial provisions that criminalize hate speech in ways that could be used to impermissibly restrict the right to freedom of expression\".[https://www.amnesty.org.uk/files/2017-02/POL1048002017ENGLISH.PDF?xMHdSpNaJBUNbiuvtMCJvJrnGuLiZnFU Amnesty International, Report 2016/2017, p. 333]. The Foundation of Economic Education views this bill as a repetition of a mistake done during the time of apartheid as it constitutes \"the gravest threat to freedom of expression which South Africans have ever faced\".Van Staden, Martin. [https://fee.org/articles/south-africa-is-repeating-the-mistakes-of-apartheid/ \"South Africa Is Repeating the Mistakes of Apartheid\"], Foundation for Economic Education, June 21, 2017.\n\nSweden \n\nSweden prohibits hate speech, and defines it as publicly making statements that threaten or express disrespect for an ethnic group or similar group regarding their race, skin colour, national or ethnic origin, faith, or sexual orientation.Swedish Penal code, [http://sv.wikisource.org/wiki/Brottsbalken%2C_andra_avdelningen#8_.C2.A7_5 Brottsbalken, chapter 16, section 8.] The crime does not prohibit a pertinent and responsible debate (en saklig och vederhäftig diskussion), nor statements made in a completely private sphere. There are constitutional restrictions pertaining to which acts are criminalized, as well limits set by the European Convention on Human Rights.[http://www.domstol.se/Domstolar/hogstadomstolen/Avgoranden/2005/Dom_pa_engelska_B_1050-05.pdf Judgment of the Supreme Court of Sweden in the Åke Green case]  The crime is called Hets mot folkgrupp in Swedish which directly translated can be translated to Incitement (of hatred/violence) towards population groups.\n\nThe sexual orientation provision, added in 2002, was used to convict Pentecostalist pastor Åke Green of hate speech based on a 2003 sermon. His conviction was later overturned.\n\nSwitzerland \n\nIn Switzerland public discrimination or invoking to rancor against persons or a group of people because of their race, ethnicity, is getting penalized with a term of imprisonment until 3 years or a mulct. In 1934, the authorities of the Basel-Stadt canton criminalized anti-Jewish hate speech, e.g., the accusation of ritual murders, mostly in reaction against a pro-Nazi antisemitic group and newspaper, the Volksbund.\n\nUnited Kingdom \n\nIn the United Kingdom, several statutes criminalize hate speech against several categories of persons. The statutes forbid communication which is hateful, threatening, or abusive, and which targets a person on account of disability, ethnic or national origin, nationality (including citizenship), race, religion, sexual orientation, or  skin colour. The penalties for hate speech include fines, imprisonment, or both. Legislation against Sectarian hate in Scotland, which is aimed principally at football matches, does not criminalise jokes about people's beliefs, nor outlaw \"harsh\" comment about their religious faith.\n\nUnited States \n\nCombating hate speech\n\nThe Council of Europe sponsored 'No Hate Speech' actively raises awareness about hate speech, helping to combat the problem. A growing awareness of the problem has resulted in increasing teaching in school of the issue, with enhanced reporting often occurring.Walker, M.D. Activities to tackle Hate Crime. SecEd 2017. https://www.academia.edu/33555930/Activities_to_tackle_Hate_speech_SecEd_Magazine",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hate speech" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14233" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hate speech is speech which attacks a person or group on the basis of attributes such as race, religion, ethnic origin, sexual orientation, disability, or gender.[http://dictionary.reference.com/browse/hate+speech Definitions for \"hate speech\"], Dictionary.com. Retrieved 25 June 2011Nockleby, John T. (2000), “Hate Speech” in Encyclopedia of the American Constitution, ed. Leonard W. Levy and Kenneth L. Karst, vol. 3. (2nd ed.), Detroit: Macmillan Reference US, pp. 1277–79. Cited in \"Library 2.0 and the Problem of Hate Speech,\" by Margaret Brown-Sica and Jeffrey Beall, [http://southernlibrarianship.icaap.org/content/v09n02/brown-sica_m01.html#_edn2 Electronic Journal of Academic and Special Librarianship, vol. 9 no. 2 (Summer 2008)]. In the law of some countries, hate speech is described as speech, gesture or conduct, writing, or display which is forbidden because it incites violence or prejudicial action against a protected group, or individual on the basis of their membership of the group, or because it disparages or intimidates a protected group, or individual on the basis of their membership of the group. The law may identify a protected group by certain characteristics.  In some countries, hate speech is not a legal term and in some it is constitutionally protected.\n\nIn some countries, a victim of hate speech may seek redress under civil law, criminal law, or both. A website which uses hate speech may be called a hate site. Many of these sites contain Internet forums and news briefs that emphasize a particular viewpoint.\n\nThere has been debate over freedom of speech, hate speech and hate speech legislation.Herz, Michael and Peter Molnar, eds. 2012. The content and context of hate speech. Cambridge University Press. Critics have argued that the term \"hate speech\" is used to silence critics.\n\nHarm caused\n\nOn the Internet\n\nOn May 31, 2016, Facebook, Google, Microsoft, and Twitter, jointly agreed to a European Union code of conduct obligating them to review \"[the] majority of valid notifications for removal of illegal hate speech\" posted on their services within 24 hours.\n\nFollowing a campaign which involved the participation of Women, Action and the Media, the Everyday Sexism Project and the activist Soraya Chemaly, who were among 100 advocacy groups, Facebook agreed to update its policy on hate speech. The campaign highlighted content that promoted domestic and sexual violence against women, and used over 57,000 tweets and more than 4,900 emails to create outcomes such as the withdrawal of advertising from Facebook by 15 companies, including Nissan UK and Nationwide UK. The social media website initially responded by stating that \"While it may be vulgar and offensive, distasteful content on its own does not violate our policies\", but then agreed to take action on May 29, 2013, after it had \"become clear that our systems to identify and remove hate speech have failed to work as effectively as we would like, particularly around issues of gender-based hate\".\n\nWith relative anonymity hate groups are able to spread misinformation easily through social media often disguised as if they were generated from legitimate sources. Some users also manipulate search engines so their hate propaganda is more accessible.\n\nCritical theory\n\nAccording to the ritual model of communication, racist expressions allow minorities to be categorized with negative attributes tied to them, and are directly harmful to them. Matsuda et al. (1993) found that racist speech could cause in the recipient of the message direct, adverse physical and emotional changes.Mari Matsuda, Charles R. Lawrence, III, et al., Words That Wound: Critical Race Theory, Assaultive Speech, and the First Amendment (Westview Press 1993) The repeated use of such expressions cause and reinforce the subordination of these minorities.\n\nHate speech laws\n\nThe International Covenant on Civil and Political Rights (ICCPR) states that \"any advocacy of national, racial or religious hatred that constitutes incitement to discrimination, hostility or violence shall be prohibited by law\".International Covenant on Civil and Political Rights, Article 20 The Convention on the Elimination of All Forms of Racial Discrimination (ICERD) prohibits all incitement of racism.Convention on the Elimination of All Forms of Racial Discrimination, Article 4 Concerning the debate over how freedom of speech applies to the Internet, conferences concerning such sites have been sponsored by the United Nations High Commissioner for Refugees.[http://www.unhchr.ch/huridocda/huridoca.nsf/AllSymbols/FA869F4E19CCCBC1C1256A570031F062/$File/G0113724.doc?OpenElement Report of the High Commissioner for Human Rights on the use of the Internet for purposes of incitement to racial hatred, racist propaganda and xenophobia, and on ways of promoting international cooperation in this area], Preparatory Committee for the World Conference Against Racism, Racial Discrimination, Xenophobia, and Related Intolerance, United Nations, 27 April 2001\n\nEnforcement \n\nHate law regulations can be divided into two types: those which are designed for public order and those which are designed to protect human dignity. Those designed to protect public order require a higher threshold to be violated, so they are not specifically enforced frequently. For example, in Northern Ireland, as of 1992 only one person was prosecuted for violating the regulation in twenty-one years. Those meant to protect human dignity have a much lower threshold to be violated, so those in Canada, Denmark, France, Germany and the Netherlands seem to be frequently enforced.\n\nEnforcement of laws regarding hate speech in the USA can interfere with constitutional rights to freedom of speech. Court rulings often must be reexamined to ensure the U.S. Constitution is being upheld in the ruling on whether or not the words count as a violation.\n\nHate speech laws by country\n\nAustralia \n\nAustralia's hate speech laws vary by jurisdiction, and seek especially to prevent victimisation on account of race.\n\nBelgium \n\nThe Belgian Anti-Racism Law, in full, the Law of 30 July 1981 on the Punishment of Certain Acts inspired by Racism or Xenophobia, is a law against hate speech and discrimination passed by the Federal Parliament of Belgium in 1981 which made certain acts motivated by racism or xenophobia illegal. It is also known as the Moureaux Law.\n\nThe Belgian Holocaust denial law, passed on 23 March 1995, bans public Holocaust denial. Specifically, the law makes it illegal to publicly \"deny, play down, justify or approve of the genocide committed by the Nazi German regime during the Second World War\". Prosecution is led by the Belgian Centre for Equal Opportunities. The offense is punishable by imprisonment of up to one year and fines of up to 2500 EUR.\n\nBrazil \n\nIn Brazil, according to the 1988 Brazilian Constitution, racism is an \"Offense with no statute of limitations and no right to bail for the defendant\".[http://www1.folha.uol.com.br/folha/cotidiano/ult95u107965.shtml \"1988 Constitution made racism a crime with no right to bail\"], Folha de S.Paulo, 15 April 2005.\n\nCanada \n\nIn Canada, advocating genocide against any \"identifiable group\" is an indictable offence under the Criminal Code and  carries a maximum sentence of five years imprisonment.  There is no minimum sentence.Criminal Code, [http://laws-lois.justice.gc.ca/eng/acts/C-46/section-318.html#h-92 RSC 1985, c C-46, s 318], \"Advocating Genocide\".\n\nPublicly inciting hatred against any identifiable group is also an offence.  It can be prosecuted either as an indictable offence with a maximum sentence of two years imprisonment, or as a summary conviction offence with a maximum sentence of six months imprisonment.  There are no minimum sentences in either case.[http://laws-lois.justice.gc.ca/eng/acts/C-46/section-319.html#h-92 RSC 1985, c C-46, s 319] [http://laws-lois.justice.gc.ca/eng/acts/C-46/section-319.html \"Public incitement of hatred\" and \"Wilful promotion of hatred\"]. The offence of publicly inciting hatred makes exceptions for cases of statements of truth, and subjects of public debate and religious doctrine. The landmark judicial decision on the constitutionality of this law was R. v. Keegstra (1990).\n\nAn \"identifiable group\" is defined for both offences as \"any section of the public distinguished by colour, race, religion, national or ethnic origin, age, sex, sexual orientation, or mental or physical disability\".\n\nChile \n\nArticle 31 of the \"Ley sobre Libertades de Opinión e Información y Ejercicio del Periodismo\" (statute on freedom of opinion and information and the performance of journalism), punishes with a large fine those who “through any means of social communication makes publications or transmissions intended to promote hatred or hostility towards persons or a group of persons due to their race, sex, religion or nationality\".  This law has been applied to expressions transmitted via the internet. There is also a rule increasing the penalties for crimes motivated by discriminatory hatred.\n\nCouncil of Europe \n\nThe Council of Europe has worked intensively on this issue. While Article 10 of the European Convention on Human Rights does not prohibit criminal laws against revisionism such as denial or minimization of genocides or crimes against humanity, as interpreted by the European Court of Human Rights (ECtHR), the Committee of Ministers of the Council of Europe went further and recommended in 1997 that member governments \"take appropriate steps to combat hate speech\" under its Recommendation R (97) 20.Council of Europe, Committee of Ministers, [https://wcd.coe.int/com.instranet.InstraServlet?commandcom.instranet.CmdBlobGet&InstranetImage\n1658005&SecMode1&DocId\n582600&Usage=2 Recommendation R (97) 20 of the Committee of Ministers to Member States on \"Hate Speech\"], adopted by the Committee of Ministers on 30 October 1997, accessed 10 March 2017 The ECtHR does not offer an accepted definition for \"hate speech\" but instead offers only parameters by which prosecutors can decide if the \"hate speech\" is entitled to the protection of freedom of speech.\n\nThe Council of Europe also created the European Commission against Racism and Intolerance, which has produced country reports and several general policy recommendations, for instance against anti-Semitism and intolerance against Muslims.\n\nCroatia \n\nThe Croatian Constitution guarantees freedom of speech, but Croatian penal code prohibits and punishes anyone \"who based on differences of race, religion, language, political or any other belief, wealth, birth, education, social status or other properties, gender, skin color, nationality or ethnicity violates basic human rights and freedoms recognized from international community\".Article 174. of Croatian penal code on Croatian Wikisource\n\nDenmark \n\nDenmark prohibits hate speech, and defines it as publicly making statements by which a group is threatened ('), insulted (') or degraded (') due to race, skin colour, national or ethnic origin, faith or sexual orientation.Danish Penal code, Straffeloven, section 266 B.\n\nFinland \n\nThere has been considerable debate over the definition of \"hate speech\" (vihapuhe) in the Finnish language.\n\nIf \"hate speech\" is taken to mean ethnic agitation, it is prohibited in Finland and defined in the section 11 of the penal code, War crimes and crimes against humanity, as published information or as an opinion or other statement that threatens or insults a group because of race, nationality, ethnicity, religion or conviction, sexual orientation, disability, or any comparable trait. Ethnic agitation is punishable with a fine or up to 2 years in prison, or 4 months to 4 years if aggravated (such as incitement to genocide).[http://www.finlex.fi/fi/laki/kaannokset/1889/en18890039.pdf Finnish Penal code] [http://www.finlex.fi/fi/laki/ajantasa/1889/18890039001 Rikoslaki]/Strafflagen Chapter 11, section 10 Ethnic agitation / Kiihottaminen kansanryhmää vastaan\n\nCritics claim that, in political contexts, labeling certain opinions and statements \"hate speech\" can be used to silence unfavorable or critical opinions and suppress debate. Certain politicians, including Member of Parliament and the leader of the Finns Party Jussi Halla-aho, consider the term \"hate speech\" problematic because of the lack of an easy definition.\n\nFrance \n\nFrance prohibits by its penal code and by its press laws public and private communication which is defamatory or insulting, or which incites discrimination, hatred, or violence against a person or a group of persons on account of place of origin, ethnicity or lack thereof, nationality, race, specific religion, sex, sexual orientation, or handicap. The law prohibits declarations that justify or deny crimes against humanity, for example, the Holocaust (Gayssot Act).Loi 90-615 du 13 juillet 1990\n\nGermany \n\nIn Germany, Volksverhetzung (\"incitement to hatred\") is a punishable offense under Section 130 of the Strafgesetzbuch (Germany's criminal code) and can lead to up to five years' imprisonment. Section 130 makes it a crime to publicly incite hatred against parts of the population or to call for violent or arbitrary measures against them or to insult, maliciously slur or defame them in a manner violating their (constitutionally protected) human dignity. Thus for instance it is illegal to publicly call certain ethnic groups \"maggots\" or \"freeloaders\".StGB §130 (2) 1. c) Volksverhetzung is punishable in Germany even if committed abroad and even if committed by non-German citizens, if only the incitement of hatred takes effect within German territory, e.g., the seditious sentiment was expressed in German writing or speech and made accessible in Germany (German criminal code's Principle of Ubiquity, Section 9 §1 Alt. 3 and 4 of the Strafgesetzbuch).\n\nOn June 30, 2017, Germany approved a bill criminalizing hate speech on social media sites. Among criminalizing hate speech, the law states that social networking sites may be fined up to €50 million ($56 million) if they persistently fail to remove illegal content within a week, including defamatory \"fake news\". \n\nIceland \n\nIn Iceland, the hate speech law is not confined to inciting hatred, as one can see from Article 233 a. in the Icelandic Penal Code, but includes simply expressing such hatred publicly:\n\nIn this context \"assault\" does not refer to physical violence but only to verbal assault.\n\nIndia \n\nFreedom of speech and expression is protected by article 19 (1) of the constitution of India, but under article 19(2) \"reasonable restrictions\" can be imposed on freedom of speech and expression in the interest of \"the sovereignty and integrity of India, the security of the State, friendly relations with foreign States, public order, decency or morality, or in relation to contempt of court, defamation or incitement to an offence\".\n\nIndonesia \n\nIndonesia has been a signatory to the International Covenant on Civil and Political Rights since 2006, but has not promulgated comprehensive legislation against hate-speech crimes. Calls for a comprehensive anti-hate speech law and associated educational program have followed statements by a leader of a hard-line Islamic organization that Balinese Hindus were mustering forces to protect the \"lascivious Miss World pageant\" in “a war against Islam\" and that \"those who fight on the path of Allah are promised heaven\". The statements are said to be an example of similar messages intolerance being preached throughout the country by radical clerics.[http://www.thejakartaglobe.com/opinion/hard-liners-targeting-miss-world-in-bali-shows-need-for-anti-hate-speech-law-in-indonesia/ \"Hard-Liners Targeting Miss World in Bali Shows Need for Anti-Hate-Speech Law in Indonesia\"], Johannes Nugroho, Jakarta Globe, 23 September 2013. Retrieved 29 September 2013.\n\nThe National Police ordered all of their personnel to anticipate any potential conflicts in society caused by hate speech. The order is stipulated in the circular signed by the National Police chief General Badrodin Haiti on Oct. 8, 2015.\n\nIreland \n\nThe Constitution of Ireland guarantees Irish citizens the right \"to express freely their convictions and opinions\"; however, this right is \"subject to public order and morality\", mass media \"shall not be used to undermine public order or morality or the authority of the State\", and \"publication or utterance of blasphemous, seditious, or indecent matter is an offence\". The Prohibition of Incitement to Hatred Act 1989 made it an offence to make, distribute, or broadcast \"threatening, abusive or insulting\" words, images, or sounds with intent or likelihood to \"stir up hatred\", where \"hatred\" is \"against a group of persons in the State or elsewhere on account of their race, colour, nationality, religion, ethnic or national origins, membership of the travelling community or sexual orientation\". The first conviction was in 2000, of a bus driver who told a Gambian passenger \"You should go back to where you came from\". Frustration at the low number of prosecutions (18 by 2011) was attributed to a misconception that the law addressed hate crimes more generally as opposed to incitement in particular.;  In 2013 the Constitutional Convention considered the constitutional prohibition of blasphemy, and recommended replacing it with a ban on incitement to religious hatred. This was endorsed by the Oireachtas, and in 2017 the Fine Gael-led government planned a referendum for October 2018.; \n\nJapan \n\nJapanese law covers threats and slander, but it \"does not apply to hate speech against general groups of people\".[http://mainichi.jp/english/english/newsselect/news/20130710p2a00m0na009000c.html \"Foreign correspondents share opinions on Japanese hate speech marches\"], The Mainichi, 10 July 2013. Retrieved 26 September 2013.  Japan became a member of the United Nations International Convention on the Elimination of All Forms of Racial Discrimination in 1995. Article 4 of the convention sets forth provisions calling for the criminalization of hate speech. But the Japanese government has suspended the provisions, saying actions to spread or promote the idea of racial discrimination have not been taken in Japan to such an extent that legal action is necessary. The Foreign Ministry says that this assessment remains unchanged.[http://ajw.asahi.com/article/behind_news/social_affairs/AJ201305100069 \"Justice minister criticizes hate speech in Japan but won't punish offenders\"], The Asahi Shimbun, 10 May 2013.  \n\nIn May 2013, the United Nations Committee on Economic, Social and Cultural Rights (CESCR) warned the Japanese government that it needs to take measures to curb hate speech against so-called comfort women. The committee's recommendation called for the Japanese government to better educate Japanese society on the plight of women who were forced into sexual slavery to prevent stigmatization, and to take necessary measures to repair the lasting effects of exploitation, including addressing their right to compensation.[http://koreajoongangdaily.joins.com/news/article/Article.aspx?aid=2972061 \"UN group urges Tokyo to curb hate speech\"], Sarah Kim, Korea JoongAng Daily, 24 May 2013. Retrieved 21 October 2013.[http://www.ecoi.net/file_upload/1930_1375189270_g1344448.pdf \"C. Principal subjects of concern and recommendations\"], Concluding observations on the third periodic report of Japan, adopted by the Committee at its fiftieth session, 29 April–17 May 2013 (E/C.12/JPN/CO/3), Committee on Economic, Social and Cultural Rights, Economic and Social Council, United Nations, 10 June 2013. \"26. The Committee is concerned about the lasting negative effects of the exploitation to which 'comfort women' were subjected on their enjoyment of economic, social and cultural rights and their entitlement to reparation (arts. 11 and 3). The Committee recommends that the State party take all necessary measures to address the lasting effects of the exploitation and to guarantee the enjoyment of economic, social and cultural rights by 'comfort women'. The Committee also recommends that the State party educate the public on the exploitation of 'comfort women' so as to prevent hate speech and other manifestations of hatred that stigmatize them.\"\n\nIn 2013, following demonstrations, parades, and comments posted on the Internet threatening violence against foreign residents of Japan, especially Koreans, there are concerns that hate speech is a growing problem in Japan.[http://www.japantimes.co.jp/news/2013/07/10/national/politicians-silent-on-curbing-hate-speech/ \"Politicians silent on curbing hate speech\"], Eric Johnston, Japan Times, 10 July 2013. Retrieved 26 September 2013.[http://www.dw.de/japan-conservatives-hate-speech-goes-too-far/a-16938717 \"Japan conservatives: 'Hate speech goes too far' \"], Julian Ryall, Deutsche Welle, 9 July 2013. Retrieved 26 September 2013.[http://www.japantimes.co.jp/opinion/2013/06/05/editorials/no-place-for-hate-speech/ \"No place for hate speech\"], Japan Times, 5 June 2013. Retrieved 26 September 2013. Prime Minister Shinzo Abe and Justice Minister Sadakazu Tanigaki have expressed concerns about the increase in hate speech, saying that it \"goes completely against the nation's dignity\", but so far have stopped short of proposing any legal action against protesters.\n\nOn 22 September 2013 around 2,000 people participated in the \"March on Tokyo for Freedom\" campaigning against recent hate speech marches. Participants called on the Japanese government to \"sincerely adhere\" to the International Convention on the Elimination of All Forms of Racial Discrimination. Sexual minorities and the disabled also participated in the march.[http://mainichi.jp/english/english/newsselect/news/20130923p2a00m0na010000c.html \"Anti-hate speech march fills streets around Shinjuku\"] , The Mainichi, 23 September 2013. Retrieved 26 September 2013.\n\nOn 25 September 2013 a new organization, \"An international network overcoming hate speech and racism\" (Norikoenet), that is opposed to hate speech against ethnic Koreans and other minorities in Japan was launched.[http://mainichi.jp/english/english/newsselect/news/20130926p2a00m0na007000c.html \"Anti-hate speech group launched in Japan\"] , The Mainichi, 26 September 2013. Retrieved 26 September 2013.\n\nOn 7 October 2013, in a rare ruling on racial discrimination against ethnic Koreans, a Japanese court ordered an anti-Korean group, Zaitokukai, to stop \"hate speech\" protests against a Korean school in Kyoto and pay the school 12.26 million yen ($126,400 U.S.) in compensation for protests that took place in 2009 and 2010.[http://www.bbc.co.uk/news/world-asia-24427921 \"Japan court in Korean discrimination ruling\"], BBC News, 7 October 2013. Retrieved 7 October 2013.[http://ajw.asahi.com/article/behind_news/social_affairs/AJ201310070090 \"Kyoto court bans 'hate speech' around school for ethnic Koreans\"] , Gakushi Fujiwara, The Asahi Shimbun, 7 October 2013. Retrieved 7 October 2013.\n\nA United Nations panel urged Japan to ban hate speech.\n\nIn May 2016 Japan passed a law dealing with hate speech. However, it does not ban hate speech and sets no penalty for committing it.Osaki, Tomohiro [http://www.japantimes.co.jp/news/2016/05/24/national/social-issues/diet-passes-japans-first-law-curb-hate-speech/ Diet passes Japan’s first law to curb hate speech May 24, 2016] Japan Times Retrieved May 27, 2016\n\nJordan \n\nSeveral Jordanian laws seek to prevent the publication or dissemination of material that would provoke strife or hatred:[http://www2.ohchr.org/english/bodies/cerd/docs/AdvanceVersions/CERD-C-JOR-13-17_en.pdf \"Jordan, Combined reports submitted for 1999, 2001, 2003, 2005, and 2007\"], Reports submitted by States parties under article 9 of the Convention on the Elimination of All Forms of Racial Discrimination, Committee on the Elimination of Racial Discrimination, United Nations, 21 September 2011, accessed 13 September 2012\n* Article 6 of Act No. 76 of 2009 regulating publicity and advertising in municipal areas states: (a) The following shall be deemed an infringement of this regulation: (i) The inclusion in publicity or advertisements of material that offends national or religious sentiment or public morals or that is prejudicial to the maintenance of public order. The publicization of ideas based on racial superiority, racial hatred and the instigation of racial discrimination against any person or group constitute punishable offences.\n* Article 20 of the Audiovisual Media Act No. 71 of 2002 states: “The licensee shall not broadcast or rebroadcast any material that is likely to provoke confessional and interethnic strife, to undermine national unity or to instigate terrorism, racism or religious intolerance or to damage domestic relations in the Kingdom.”\n* Article 7 of the Printing and Publications Act No. 8 of 1998 sets out the ethical rules that apply to journalism and the conduct of journalists. It is illegal to publish material likely to stir up hatred or to make propaganda with a view to setting citizens against one another.\n* Article 40(a)(iv) of the Print and Publications Act No. 10 of 1993 states that it is prohibited to publish articles that are likely to jeopardize national unity, incite others to commit crimes, stir up hostility, and foment hatred, division and discord between members of society.\n\nMalta\n\nThe Maltese criminal code through Articles 82A-82D prohibits in substance hate speech comprehensively as follows:\n\nNetherlands \n\nThe Dutch penal code prohibits both insulting a group (article 137c) and inciting hatred, discrimination or violence (article 137d). The definition of the offences as outlined in the penal code is as follows:\n* Article 137c: \"He who publicly, orally, in writing or graphically, intentionally expresses himself insultingly regarding a group of people because of their race, their religion or their life philosophy, their heterosexual or homosexual orientation or their physical, psychological or mental disability, shall be punished by imprisonment of no more than a year or a monetary penalty of the third category.\" [http://wetten.overheid.nl/BWBR0001854/TweedeBoek/TitelV/Artikel137c Dutch penal code – article 137c]\n* Article 137d: \"He who publicly, orally, in writing or graphically, incites hatred against, discrimination of or violent action against person or belongings of people because of their race, their religion or their life philosophy, their gender, their heterosexual or homosexual orientation or their physical, psychological or mental disability, shall be punished by imprisonment of no more than a year or a monetary penalty of the third category.\" [http://wetten.overheid.nl/BWBR0001854/TweedeBoek/TitelV/Artikel137d Dutch penal code – article 137d]\n\nIn January 2009, a court in Amsterdam ordered the prosecution of Geert Wilders, a Dutch Member of Parliament, for breaching articles 137c and 137d. On 23 June 2011, Wilders was acquitted of all charges. In 2016, in a separate case, Wilders was found guilty of both insulting a group and inciting discrimination for promising an audience that he would deliver on their demand for there to be \"fewer Moroccans\".\n\nNew Zealand \n\nNew Zealand prohibits hate speech under the Human Rights Act 1993. Section 61 (Racial Disharmony) makes it unlawful to publish or distribute \"threatening, abusive, or insulting...matter or words likely to excite hostility against or bring into contempt any group of persons...on the ground of the colour, race, or ethnic or national or ethnic origins of that group of persons\". Section 131 (Inciting Racial Disharmony) lists offences for which \"racial disharmony\" creates liability.\n\nNorway \n\nNorway prohibits hate speech, and defines it as publicly making statements that threaten or ridicule someone or that incite hatred, persecution or contempt for someone due to their skin colour, ethnic origin, homosexual orientation, religion or philosophy of life. At the same time, the Norwegian Constitution guarantees the right to free speech, and there has been an ongoing public and judicial debate over where the right balance between the ban against hate speech and the right to free speech lies. Norwegian courts have been restrictive in the use of the hate speech law and only a few persons have been sentenced for violating the law since its implementation in 1970. A public Free Speech committee (1996–1999) recommended to abolish the hate speech law but the Norwegian Parliament instead voted to slightly strengthen it.Sindre Bangstad: [http://snl.no/diskriminerende_ytringer diskriminerende ytringer] Store norske leksikon , retrieved 25 April 2013\n\nPoland \n\nThe hate speech laws in Poland punish those who offend the feelings of the religious by e.g. disturbing a religious ceremony or creating public calumny. They also prohibit public expression that insults a person or a group on account of national, ethnic, racial, or religious affiliation or the lack of a religious affiliation.\n\nRussia \n\nAccording to Article 282 of the Criminal Code, 'Raising hates or hostility, or equally humiliation of human dignity':\n\nSerbia \n\nThe Serbian constitution guarantees freedom of speech, but restricts it in certain cases to protect the rights of others. The criminal charge of \"Provoking ethnic, racial and religion based animosity and intolerance\" carries a minimum six months prison term and a maximum of ten years.Serbian Penal code, section 317.\n\nSingapore \n\nSingapore has passed numerous laws that prohibit speech that causes disharmony among various religious groups.  The Maintenance of Religious Harmony Act is an example of such legislation. The Penal Code criminalizes the deliberate promotion by someone of enmity, hatred or ill-will between different racial and religious groups on grounds of race or religion. It also makes it an offence for anyone to deliberately wound the religious or racial feelings of any person.\n\nSouth Africa \n\nIn South Africa, hate speech (along with incitement to violence and propaganda for war) is specifically excluded from protection of free speech in the Constitution. The Promotion of Equality and Prevention of Unfair Discrimination Act, 2000 contains the following clause:\n\nThe \"prohibited grounds\" include race, gender, sex, pregnancy, marital status, ethnic or social origin, colour, sexual orientation, age, disability, religion, conscience, belief, culture, language and birth.\n\nThe crime of crimen injuria (\"unlawfully, intentionally and seriously impairing the dignity of another\") may also be used to prosecute hate speech.\n\nIn 2011, a South African court banned \"Dubula iBhunu (Shoot the Boer)\", a derogatory song degrading Afrikaners, on the basis that it violated a South African law prohibiting speech that demonstrates a clear intention to be hurtful, to incite harm, or to promote hatred.\n\nIn October 2016, \"the draft Hate Crimes Bill was introduced. It aims to address racism, racial discrimination, xenophobia and discrimination based on gender, sex, sexual orientation and other issues, by providing an offence of hate crime. It includes controversial provisions that criminalize hate speech in ways that could be used to impermissibly restrict the right to freedom of expression\".[https://www.amnesty.org.uk/files/2017-02/POL1048002017ENGLISH.PDF?xMHdSpNaJBUNbiuvtMCJvJrnGuLiZnFU Amnesty International, Report 2016/2017, p. 333]. The Foundation of Economic Education views this bill as a repetition of a mistake done during the time of apartheid as it constitutes \"the gravest threat to freedom of expression which South Africans have ever faced\".Van Staden, Martin. [https://fee.org/articles/south-africa-is-repeating-the-mistakes-of-apartheid/ \"South Africa Is Repeating the Mistakes of Apartheid\"], Foundation for Economic Education, June 21, 2017.\n\nSweden \n\nSweden prohibits hate speech, and defines it as publicly making statements that threaten or express disrespect for an ethnic group or similar group regarding their race, skin colour, national or ethnic origin, faith, or sexual orientation.Swedish Penal code, [http://sv.wikisource.org/wiki/Brottsbalken%2C_andra_avdelningen#8_.C2.A7_5 Brottsbalken, chapter 16, section 8.] The crime does not prohibit a pertinent and responsible debate (en saklig och vederhäftig diskussion), nor statements made in a completely private sphere. There are constitutional restrictions pertaining to which acts are criminalized, as well limits set by the European Convention on Human Rights.[http://www.domstol.se/Domstolar/hogstadomstolen/Avgoranden/2005/Dom_pa_engelska_B_1050-05.pdf Judgment of the Supreme Court of Sweden in the Åke Green case]  The crime is called Hets mot folkgrupp in Swedish which directly translated can be translated to Incitement (of hatred/violence) towards population groups.\n\nThe sexual orientation provision, added in 2002, was used to convict Pentecostalist pastor Åke Green of hate speech based on a 2003 sermon. His conviction was later overturned.\n\nSwitzerland \n\nIn Switzerland public discrimination or invoking to rancor against persons or a group of people because of their race, ethnicity, is getting penalized with a term of imprisonment until 3 years or a mulct. In 1934, the authorities of the Basel-Stadt canton criminalized anti-Jewish hate speech, e.g., the accusation of ritual murders, mostly in reaction against a pro-Nazi antisemitic group and newspaper, the Volksbund.\n\nUnited Kingdom \n\nIn the United Kingdom, several statutes criminalize hate speech against several categories of persons. The statutes forbid communication which is hateful, threatening, or abusive, and which targets a person on account of disability, ethnic or national origin, nationality (including citizenship), race, religion, sexual orientation, or  skin colour. The penalties for hate speech include fines, imprisonment, or both. Legislation against Sectarian hate in Scotland, which is aimed principally at football matches, does not criminalise jokes about people's beliefs, nor outlaw \"harsh\" comment about their religious faith.\n\nUnited States \n\nCombating hate speech\n\nThe Council of Europe sponsored 'No Hate Speech' actively raises awareness about hate speech, helping to combat the problem. A growing awareness of the problem has resulted in increasing teaching in school of the issue, with enhanced reporting often occurring.Walker, M.D. Activities to tackle Hate Crime. SecEd 2017. https://www.academia.edu/33555930/Activities_to_tackle_Hate_speech_SecEd_Magazine. Hate speech. http://en.wikipedia.org/?curid=14233."
  }
}
