{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9338",
  "eid" : "ee6251b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778479691,
  "textBody" : "The politics of Ecuador are multi-party.  The central government polity is a four-yearly elected presidential, unicameral representative democracy. The President of Ecuador is head of state and head of government on a multi-party system, leading a cabinet with further executive power. Legislative power is not limited to the National Assembly as it may to a lesser degree be exercised by the executive which consists of the President convening an appointed executive cabinet.  Subsequent acts of the National Assembly are supreme over Executive Orders where sufficient votes have been cast by the legislators. The judiciary is independent of the executive and the legislature.There is also constitutional republic\n\nThe constitution of Ecuador provides for a four-year term of office for the President, Vice President, and members of the National Assembly with concurrent elections. Presidents and legislators may be re-elected immediately. Citizens must be at least 16 years of age to vote: suffrage is universal and compulsory for literate persons aged 18 to 65 and optional for 16 and 17 years of age and other eligible voters.\n\nThe Economist Intelligence Unit has rated Ecuador as \"hybrid regime\" in 2016.\n\nPolitical conditions\n\nEcuador's political parties have historically been small, loose organizations that depended more on populist, often charismatic, leaders to retain support than on programs or ideology. Frequent internal splits have produced extreme factionalism. However, a pattern has emerged in which administrations from the center-left alternate with those from the center-right. Although Ecuador's political elite is highly factionalized along regional, ideological, and personal lines, a strong desire for consensus on major issues often leads to compromise. Opposition forces in Congress are loosely organized, but historically they often unite to block the administration's initiatives and to remove cabinet ministers.\n\nConstitutional changes enacted by a specially elected National Constitutional Assembly in 1998 took effect on August 10, 1998. The new constitution strengthens the executive branch by eliminating mid-term congressional elections and by circumscribing Congress' power to challenge cabinet ministers. Party discipline is traditionally weak, and routinely many deputies switch allegiance during each Congress. However, after the new Constitution took effect, the Congress passed a Code of Ethics which imposes penalties on members who defy their party leadership on key votes.\n\nBeginning with the 1996 election, the more indigenous, less Spanish-rooted, ethnic groups abandoned their traditional policy of shunning the official political system and participated actively. The indigenous population has established itself as a significant force in Ecuadorian politics, as shown by the selection of indigenous representative Nina Pacari, who led the indigenous political party, Pachakutik, as second vice president of the 1998 Congress.\n\nA presidential election was held on October 15 and November 26, 2006. Rafael Correa defeated Alvaro Noboa in a run-off election, or second and final round. Correa won with 56.8% of the vote.\"Ecuador Exit Polls Show Correa Wins Presidential Vote (Update2)\" Bloomberg There was an attempted coup against President Rafael Correa in 2010. Correa became the first president in decades to win re-election and complete multiple full terms.  He enjoyed a long period of sustained high approval ratings and stability before plummeting oil prices, proposed tax increases, and accusations of increasingly authoritarian behavior sparked protests and eroded his popularity in the final two years of his presidency.\n\nJudicial branch\n\nNew justices of the Supreme Court are elected by the sitting members of the court.  A bare majority of Congress, acting in a special session called by former President Lucio Gutiérrez in December 2004, ousted 27 of the 31 justices and replaced them with new members chosen by Congress, notwithstanding the lack of any provisions permitting impeachment of Supreme Court justices by Congress and the specific provisions giving the Court the power to select new members. Earlier, in November 2004, Congress replaced the majority of judges on the country's Electoral Court and Constitutional Court by a similar process.\n\nAfter the adoption of a new Constitution in 2008, the judicial branch of the country was completely renewed. Now it has a cooperative leadership having a judicial and an administrative head. First you have the National Court of Justice, which seats 21 judges elected for a period of 9 years. They are elected by the Judiciary Council based on a merits contest held by that office. They are the final stage of any judicial process serving as a Court of Cassation and create binding precedent based on Triple Reiterative Rulings from the Chambers of the Court. The President of the Court is elected amongst the members of the Court for a Period of 3 years where he will represent the Judicial Branch before the State. The current president of the National Court of Justice is Dr. Carlos Ruiz.\n\nSecond, you have the administrative branch of the Judicial Power, which consists of The Judiciary Council. The Council is formed by 9 Vocals who are elected by the Branch of Transparency and Social Control, which is formed by the Control Authorities of the State. The Vocals are elected also by a merits contest and it shall be formed by six experts in law and 3 experts in management, economics and other related areas. However, after the National Referendum that took place on May 5, 2011, the proposition impulsed by the government of Mr. Correa won and now the Judiciary Council change its formation making a constitutional amendment. Currently a Tri-Party Commission is serving as a Transitional Council with delegates from the Legislative, Executive and Transparency Branch, to reform the broken judicial system of the Country.\n\nFinally it is wise to say that there exist a Constitutional Court. However it does not exercise legal revision, but rather constitutional control of situations where constitutional rights are violated. Also they are the sole body in the State to interpret what the Constitution says.\n\nExecutive branch\n\n|President\n|Lenín Moreno\n|Alianza País\n|24 May 2017\n|-\n|Vice President\n|Jorge Glas\n|Alianza País\n|24 May 2013\n|}\nThe president and vice president are elected on the same ticket by popular vote for four-year term; Lucio Gutiérrez was dramatically removed by an act of Congress on 20 April 2005; election last held 20 October 2002; runoff election held 24 November 2002 (next to be held 2006)\n\nThe executive branch includes 28 ministries. Provincial governors and councilors, like mayors and aldermen and parish boards, are directly elected. Congress meets throughout the year except for recess in July and December. There are 20 seven-member congressional committees.\n\nFormer Vice President Alfredo Palacio assumed the presidency on April 20, 2005 after Congress removed Lucio Gutiérrez amid escalating street protests precipitated by growing criticism of Gutiérrez Supreme Court appointments.\n\nLegislative branch\n\nEcuador has a unicameral National Assembly (Asamblea Nacional in Spanish). It has 137 members, which are elected by popular vote to serve four-year terms.  It is based on provincial constituencies, but it also has members coming from a national list and it has members representing the emigrant community.\n\nHistory\n\nOn November 29, 2007 the Ecuadorian Constituent Assembly dismissed Congress on charges of corruption and then assumed legislative powers for itself. The Constituent Assembly then proposed a new National Assembly, which is the current institution.\n\nPolitical parties and elections\n\nAdministrative divisions\n\nEcuador is divided into 24 provinces: Azuay, Bolívar, Cañar, Carchi, Chimborazo, Cotopaxi, El Oro, Esmeraldas, Galápagos Islands, Guayas, Imbabura, Loja, Los Ríos, Manabí, Morona-Santiago, Napo, Orellana, Pastaza, Pichincha, Santa Elena, Santo Domingo de los Tsáchilas, Sucumbíos, Tungurahua, Zamora-Chinchipe\nSanta Elena Province\n\nLegal system\n\nEcuador's legal system is based on the civil law system. Ecuador recently accepted compulsory International Court of Justice jurisdiction.\n\nFemale representation in the Assembly\n\nIn 1979, there was no female representation, in 1984 it was only 4.2%, with three deputies, and in 1986 it was reduced to one female parliamentarian. Between 1988 and 1996 the average was around of 5%. It increased from 1998 : 13% in 1998, 18% in 2003, 26% in 2006, 35% in 2007, 29% in 2009 and 42% in 2013. In 2017, the leadership is led by three women: Gabriela Rivadeneira, president; Rosana Alvarado, first vice president and Marcela Aguiñaga, second vice president.http://ecuadoruniversitario.com/noticias_destacadas/en-ecuador-representacion-femenina-en-la-asamblea-nacional-supera-el-promedio-mundial/\n\nInternational organization participation\n\nEcuador or Ecuadorian organizations participate in the following international organizations:  Bolivarian Alliance for the Americas (ALBA), Andean Community of Nations (CAN), Community of Latin American and Caribbean States (CELAC), Economic Commission for Latin America and the Caribbean (ECLAC), Food and Agriculture Organization (FAO), Group of Eleven (G-11), Group of 77 (G-77), Inter-American Development Bank (IADB), International Atomic Energy Agency (IAEA), International Bank for Reconstruction and Development (World Bank), International Civil Aviation Organization (ICAO), ICC, ICC, International Red Cross, International Development Association (IDA), International Fund for Agricultural Development (IFAD), International Finance Corporation (IFC), International Hydrographic Organization (IHO), International Labour Organization (ILO), IMF, International Maritime Organization (IMO), International Telecommunications Satellite Organization (Intelsat), Interpol, IOC, International Organization for Migration (IOM), International Organization for Standardization (ISO), International Telecommunication Union (ITU), International Trade Union Confederation (ITUC), Latin American Economic System (LAES), Latin American Integration Association (LAIA), Non-Aligned Movement (NAM), OAS, Agency for the Prohibition of Nuclear Weapons in Latin America and the Caribbean (OPANAL), Organization for the Prohibition of Chemical Weapons (OPCW), Permanent Court of Arbitration (PCA), RG, UNASUR (headquarters), United Nations, United Nations Conference on Trade and Development (UNCTAD), United Nations Educational, Scientific, and Cultural Organization (UNESCO), United Nations Industrial Development Organization (UNIDO), Universal Postal Union (UPU), World Federation of Trade Unions (WFTU), World Health Organization (WHO), World Intellectual Property Organization (WIPO), World Meteorological Organization (WMO), World Tourism Organization (WToO), World Trade Organization (WTO)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Politics of Ecuador" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9338" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The politics of Ecuador are multi-party.  The central government polity is a four-yearly elected presidential, unicameral representative democracy. The President of Ecuador is head of state and head of government on a multi-party system, leading a cabinet with further executive power. Legislative power is not limited to the National Assembly as it may to a lesser degree be exercised by the executive which consists of the President convening an appointed executive cabinet.  Subsequent acts of the National Assembly are supreme over Executive Orders where sufficient votes have been cast by the legislators. The judiciary is independent of the executive and the legislature.There is also constitutional republic\n\nThe constitution of Ecuador provides for a four-year term of office for the President, Vice President, and members of the National Assembly with concurrent elections. Presidents and legislators may be re-elected immediately. Citizens must be at least 16 years of age to vote: suffrage is universal and compulsory for literate persons aged 18 to 65 and optional for 16 and 17 years of age and other eligible voters.\n\nThe Economist Intelligence Unit has rated Ecuador as \"hybrid regime\" in 2016.\n\nPolitical conditions\n\nEcuador's political parties have historically been small, loose organizations that depended more on populist, often charismatic, leaders to retain support than on programs or ideology. Frequent internal splits have produced extreme factionalism. However, a pattern has emerged in which administrations from the center-left alternate with those from the center-right. Although Ecuador's political elite is highly factionalized along regional, ideological, and personal lines, a strong desire for consensus on major issues often leads to compromise. Opposition forces in Congress are loosely organized, but historically they often unite to block the administration's initiatives and to remove cabinet ministers.\n\nConstitutional changes enacted by a specially elected National Constitutional Assembly in 1998 took effect on August 10, 1998. The new constitution strengthens the executive branch by eliminating mid-term congressional elections and by circumscribing Congress' power to challenge cabinet ministers. Party discipline is traditionally weak, and routinely many deputies switch allegiance during each Congress. However, after the new Constitution took effect, the Congress passed a Code of Ethics which imposes penalties on members who defy their party leadership on key votes.\n\nBeginning with the 1996 election, the more indigenous, less Spanish-rooted, ethnic groups abandoned their traditional policy of shunning the official political system and participated actively. The indigenous population has established itself as a significant force in Ecuadorian politics, as shown by the selection of indigenous representative Nina Pacari, who led the indigenous political party, Pachakutik, as second vice president of the 1998 Congress.\n\nA presidential election was held on October 15 and November 26, 2006. Rafael Correa defeated Alvaro Noboa in a run-off election, or second and final round. Correa won with 56.8% of the vote.\"Ecuador Exit Polls Show Correa Wins Presidential Vote (Update2)\" Bloomberg There was an attempted coup against President Rafael Correa in 2010. Correa became the first president in decades to win re-election and complete multiple full terms.  He enjoyed a long period of sustained high approval ratings and stability before plummeting oil prices, proposed tax increases, and accusations of increasingly authoritarian behavior sparked protests and eroded his popularity in the final two years of his presidency.\n\nJudicial branch\n\nNew justices of the Supreme Court are elected by the sitting members of the court.  A bare majority of Congress, acting in a special session called by former President Lucio Gutiérrez in December 2004, ousted 27 of the 31 justices and replaced them with new members chosen by Congress, notwithstanding the lack of any provisions permitting impeachment of Supreme Court justices by Congress and the specific provisions giving the Court the power to select new members. Earlier, in November 2004, Congress replaced the majority of judges on the country's Electoral Court and Constitutional Court by a similar process.\n\nAfter the adoption of a new Constitution in 2008, the judicial branch of the country was completely renewed. Now it has a cooperative leadership having a judicial and an administrative head. First you have the National Court of Justice, which seats 21 judges elected for a period of 9 years. They are elected by the Judiciary Council based on a merits contest held by that office. They are the final stage of any judicial process serving as a Court of Cassation and create binding precedent based on Triple Reiterative Rulings from the Chambers of the Court. The President of the Court is elected amongst the members of the Court for a Period of 3 years where he will represent the Judicial Branch before the State. The current president of the National Court of Justice is Dr. Carlos Ruiz.\n\nSecond, you have the administrative branch of the Judicial Power, which consists of The Judiciary Council. The Council is formed by 9 Vocals who are elected by the Branch of Transparency and Social Control, which is formed by the Control Authorities of the State. The Vocals are elected also by a merits contest and it shall be formed by six experts in law and 3 experts in management, economics and other related areas. However, after the National Referendum that took place on May 5, 2011, the proposition impulsed by the government of Mr. Correa won and now the Judiciary Council change its formation making a constitutional amendment. Currently a Tri-Party Commission is serving as a Transitional Council with delegates from the Legislative, Executive and Transparency Branch, to reform the broken judicial system of the Country.\n\nFinally it is wise to say that there exist a Constitutional Court. However it does not exercise legal revision, but rather constitutional control of situations where constitutional rights are violated. Also they are the sole body in the State to interpret what the Constitution says.\n\nExecutive branch\n\n|President\n|Lenín Moreno\n|Alianza País\n|24 May 2017\n|-\n|Vice President\n|Jorge Glas\n|Alianza País\n|24 May 2013\n|}\nThe president and vice president are elected on the same ticket by popular vote for four-year term; Lucio Gutiérrez was dramatically removed by an act of Congress on 20 April 2005; election last held 20 October 2002; runoff election held 24 November 2002 (next to be held 2006)\n\nThe executive branch includes 28 ministries. Provincial governors and councilors, like mayors and aldermen and parish boards, are directly elected. Congress meets throughout the year except for recess in July and December. There are 20 seven-member congressional committees.\n\nFormer Vice President Alfredo Palacio assumed the presidency on April 20, 2005 after Congress removed Lucio Gutiérrez amid escalating street protests precipitated by growing criticism of Gutiérrez Supreme Court appointments.\n\nLegislative branch\n\nEcuador has a unicameral National Assembly (Asamblea Nacional in Spanish). It has 137 members, which are elected by popular vote to serve four-year terms.  It is based on provincial constituencies, but it also has members coming from a national list and it has members representing the emigrant community.\n\nHistory\n\nOn November 29, 2007 the Ecuadorian Constituent Assembly dismissed Congress on charges of corruption and then assumed legislative powers for itself. The Constituent Assembly then proposed a new National Assembly, which is the current institution.\n\nPolitical parties and elections\n\nAdministrative divisions\n\nEcuador is divided into 24 provinces: Azuay, Bolívar, Cañar, Carchi, Chimborazo, Cotopaxi, El Oro, Esmeraldas, Galápagos Islands, Guayas, Imbabura, Loja, Los Ríos, Manabí, Morona-Santiago, Napo, Orellana, Pastaza, Pichincha, Santa Elena, Santo Domingo de los Tsáchilas, Sucumbíos, Tungurahua, Zamora-Chinchipe\nSanta Elena Province\n\nLegal system\n\nEcuador's legal system is based on the civil law system. Ecuador recently accepted compulsory International Court of Justice jurisdiction.\n\nFemale representation in the Assembly\n\nIn 1979, there was no female representation, in 1984 it was only 4.2%, with three deputies, and in 1986 it was reduced to one female parliamentarian. Between 1988 and 1996 the average was around of 5%. It increased from 1998 : 13% in 1998, 18% in 2003, 26% in 2006, 35% in 2007, 29% in 2009 and 42% in 2013. In 2017, the leadership is led by three women: Gabriela Rivadeneira, president; Rosana Alvarado, first vice president and Marcela Aguiñaga, second vice president.http://ecuadoruniversitario.com/noticias_destacadas/en-ecuador-representacion-femenina-en-la-asamblea-nacional-supera-el-promedio-mundial/\n\nInternational organization participation\n\nEcuador or Ecuadorian organizations participate in the following international organizations:  Bolivarian Alliance for the Americas (ALBA), Andean Community of Nations (CAN), Community of Latin American and Caribbean States (CELAC), Economic Commission for Latin America and the Caribbean (ECLAC), Food and Agriculture Organization (FAO), Group of Eleven (G-11), Group of 77 (G-77), Inter-American Development Bank (IADB), International Atomic Energy Agency (IAEA), International Bank for Reconstruction and Development (World Bank), International Civil Aviation Organization (ICAO), ICC, ICC, International Red Cross, International Development Association (IDA), International Fund for Agricultural Development (IFAD), International Finance Corporation (IFC), International Hydrographic Organization (IHO), International Labour Organization (ILO), IMF, International Maritime Organization (IMO), International Telecommunications Satellite Organization (Intelsat), Interpol, IOC, International Organization for Migration (IOM), International Organization for Standardization (ISO), International Telecommunication Union (ITU), International Trade Union Confederation (ITUC), Latin American Economic System (LAES), Latin American Integration Association (LAIA), Non-Aligned Movement (NAM), OAS, Agency for the Prohibition of Nuclear Weapons in Latin America and the Caribbean (OPANAL), Organization for the Prohibition of Chemical Weapons (OPCW), Permanent Court of Arbitration (PCA), RG, UNASUR (headquarters), United Nations, United Nations Conference on Trade and Development (UNCTAD), United Nations Educational, Scientific, and Cultural Organization (UNESCO), United Nations Industrial Development Organization (UNIDO), Universal Postal Union (UPU), World Federation of Trade Unions (WFTU), World Health Organization (WHO), World Intellectual Property Organization (WIPO), World Meteorological Organization (WMO), World Tourism Organization (WToO), World Trade Organization (WTO). Politics of Ecuador. http://en.wikipedia.org/?curid=9338."
  }
}
