{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8022",
  "eid" : "e4b471c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778463452,
  "textBody" : "The region that is now the Democratic Republic of the Congo was first settled about 80,000 years ago. The Kingdom of Kongo remained present in the region between the 14th and the early 19th centuries. Belgian colonization began when King Leopold II founded the Congo Free State, a corporate state run solely by King Leopold. Reports of widespread murder and torture in the rubber plantations led the Belgian government to seize the Congo from Leopold II and establish the Belgian Congo. Under Belgian rule, the colony was run with the presence of numerous Christian organizations that wanted to Westernize the Congolese people.\n\nAfter an uprising by the Congolese people, Belgium surrendered to the independence of the Congo in 1960. However, the Congo was left unstable because tribal leaders had more power than the central government. Prime Minister Patrice Lumumba tried to restore order with the aid of the Soviet Union as part of the Cold War, causing the United States to support a coup led by Colonel Joseph Mobutu in 1965. Mobutu quickly seized complete power of the Congo and renamed the country Zaire. He sought to Africanize the country, changing his own name to Mobutu Sese Seko, and demanded that African citizens change their Western names to traditional African names. Mobutu sought to repress any opposition to his rule, in which he successfully did throughout the 1980s. However, with his regime weakened in the early 1990s, Mobutu was forced to agree to a power-sharing government with the opposition party. Mobutu remained the head of state and promised elections for the next two years that never happened.\n\nIn the First Congo War, Rwanda invaded Zaire, which overthrew Mobutu during the process. Laurent-Desire Kabila later took power and renamed the Democratic Republic of the Congo. After a disappointing rule under Kabila, the Second Congo War broke out, resulting in a regional war with many different African nations taking part. Kabila was assassinated by his bodyguard in 2001, and his son, Joseph, succeeded him and was later elected president by the Congolese government in 2006. Kabila quickly sought peace, ending the era of war in Africa. Soldiers were left in the Congo for a few years and a power-sharing government between Kabila and the opposition party was set up. Kabila later resumed complete control over the Congo and was re-elected in a disputed election in 2011. Today, the Congo remains dangerously unstable.\n\nEarly history\n\nThe area now known as the karmalli walaDemocratic Republic of the Congo was populated as early as 80,000 years ago, as shown by the 1988 discovery of the Semliki harpoon at Katanda, one of the oldest barbed harpoons ever found, and which is believed to have been used to catch giant river catfish.http://www.springerlink.com/content/g36v03001423n142/ During its history, the area has also been known as Congo, Congo Free State, Belgian Congo, and Zaire. The Kingdom of Kongo was a powerful kingdom that existed between the 14th and the early 19th century. It was the dominant force in the region along with the luba empire, the lunda and the mongo until the arrival of the Portuguese. Second in importance was the Anziku Kingdom.\n\nColonial rule\n\nCongo Free State (1885–1908)\n\nThe Congo Free State was a corporate state privately controlled by Leopold II of Belgium through the Association internationale africaine, a non-governmental organization. Leopold was the sole shareholder and chairman. The state included the entire area of the present Democratic Republic of the Congo. Under Leopold II's administration, the Congo Free State became the site of one of the most infamous international scandals of the turn of the twentieth century. The report of the British Consul Roger Casement led to the arrest and punishment of white officials who had been responsible for cold-blooded killings during a rubber-collecting expedition in 1900, including one Belgian national for causing the shooting of at least 122 Congolese natives. Estimates of the total death toll vary considerably. In the absence of a census, the first was made in 1924, it is even more difficult to quantify the population loss of the period. Roger Casement's famous 1904 report estimated ten million people. According to Casement's report, indiscriminate \"war\", starvation, reduction of births and tropical diseases caused the country's depopulation.[http://www.urome.be/fr2/reflexions/casemrepo.pdf Report of the British Consul, Roger Casement, on the Administration of the Congo Free State] The European and U.S. press agencies exposed the conditions in the Congo Free State to the public in 1900. By 1908 public and diplomatic pressure led Leopold II to annex the Congo as the Belgian Congo colony.\n\nBelgian Congo (1908–60)\n\nOn the 15th of November 1908 King Léopold II of Belgium formally relinquished personal control of the Congo Free State. The renamed Belgian Congo was put under the direct administration of the Belgian government and its Ministry of Colonies.\n\nBelgian rule in the Congo was based around the \"colonial trinity\" (trinité coloniale) of state, missionary and private company interests. The privileging of Belgian commercial interests meant that large amounts of capital flowed into the Congo and that individual regions became specialised. On many occasions, the interests of the government and private enterprise became closely tied and the state helped companies break strikes and remove other barriers imposed by the indigenous population. The country was split into nesting, hierarchically organised administrative subdivisions, and run uniformly according to a set \"native policy\" (politique indigène)—in contrast to the British and the French, who generally favoured the system of indirect rule whereby traditional leaders were retained in positions of authority under colonial oversight. There was also a high degree of racial segregation. Large numbers of white immigrants who moved to the Congo after the end of World War II came from across the social spectrum, but were nonetheless always treated as superior to blacks.\n\nDuring the 1940s and 1950s, the Congo experienced an unprecedented level of urbanisation and the colonial administration began various development programmes aimed at making the territory into a \"model colony\". Notable advances were made in treating diseases such as African trypanosomiasis. One of the results of these measures was the development of a new middle class of Europeanised African \"évolué\" in the cities. By the 1950s the Congo had a wage labour force twice as large as that in any other African colony. The Congo's rich natural resources, including uranium—much of the uranium used by the U.S. nuclear programme during World War II was Congolese—led to substantial interest in the region from both the Soviet Union and the United States as the Cold War developed.\n\nIndependence and the Congo Crisis (1960–65)\n\nFollowing riots in Leopoldville between 4–7 January 1959, and Stanleyville on 31 October 1959, the Belgians realised they could not maintain control of such a vast country in the face of rising demands for independence. The Belgians and Congolese political leaders held a Round Table Conference in Brussels beginning on 18 January 1960. At the end of the Conference on 27 January 1960 it was announced that elections would be held in the Congo on 22 May 1960, and full independence granted on 30 June 1960. The Congo was indeed granted its independence on 30 June 1960, adopting the name \"Republic of the Congo\" (République du Congo).  As the French colony of Middle Congo (Moyen Congo) also chose the name Republic of Congo upon receiving its independence, the two countries were more commonly known as Congo-Léopoldville and Congo-Brazzaville, after their capital cities. President Mobutu changed the country's official name to Zaire in 1971, which comes from Portuguese, adapted from the Kongo word nzere or nzadi (\"river that swallows all rivers\")Forbath, Peter (1977). The River Congo: The Discovery, Exploration and Exploitation of the World's Most Dramatic Rivers. Harper & Row. p. 19. .\n\nIn 1960, the country was in a very unstable state—regional tribal leaders held far more power than the central government—and with the departure of the Belgian administrators, there were almost no skilled bureaucrats left in the country. The first Congolese university graduate was only in 1956, and very few in the new nation had any idea of how to manage a country of such size.\n\nParliamentary elections in 1960 produced the nationalist Patrice Lumumba as prime minister and pro-Western Joseph Kasavubu as president of the newly independent Republic of The Congo.\n\nEven from this fleeting moment of independence democracy began to unravel. On 5 July 1960, a military mutiny by Congolese soldiers against their European officers broke out in the capital and rampant looting began. On 11 July 1960 the richest province of the country, Katanga, seceded under Moise Tshombe. The United Nations sent 20,000 peacekeepers to protect Europeans in the country and try to restore order. Western paramilitaries and mercenaries, often hired by mining companies to protect their interests, also began to pour into the country. In this same period Congo's second richest province, Kasai, also announced its independence on 8 August 1960.\n\nPrime Minister Lumumba turned to the USSR for assistance. Nikita Khrushchev agreed to help, offering advanced weaponry and technical advisors.  The United States viewed the Soviet presence as an attempt to take advantage of the situation and gain a proxy state in sub-Saharan Africa. UN forces were ordered to block any shipments of arms into the country. The United States also looked for a way to replace Lumumba as leader. President Kasavubu had clashed with Prime Minister Lumumba and advocated an alliance with the West rather than the Soviets. The U.S. sent weapons and CIA personnel to aid forces allied with Kasavubu and combat the Soviet presence. On 14 September 1960, with U.S. and CIA support, Colonel Joseph Mobutu overthrew the government and arrested Lumumba.\n\nOn 17 January 1961 Mobutu sent Lumumba to Élisabethville (now Lubumbashi), capital of Katanga. In full view of the press he was beaten and forced to eat copies of his own speeches. For the next three weeks, he was not seen or heard from. Then Katangan radio announced implausibly that he had escaped and been killed by some villagers. In fact he had been tortured and killed along with two others shortly after his arrival. It was soon clear that he had been murdered in custody. In 2001, a Belgian inquiry established that he had been shot by Katangan gendarmes in the presence of Belgian officers, under Katangan command. Lumumba was beaten, placed in front of a firing squad with 2 other allies, cut up, buried, dug up and what remained was dissolved in acid.De Witte, Ludo: The Assassination of Lumumba, Verso, 2001.\n\nIn Stanleyville, those loyal to the deposed Lumumba set up a rival government under Antoine Gizenga which lasted from 31 March 1961 until it was reintegrated on 5 August 1961. After some reverses, UN and Congolese government forces succeeded in recapturing the breakaway provinces of South Kasai on 30 December 1961, and Katanga on 15 January 1963.\n\nA new crisis erupted in the Simba Rebellion of 1964-1965 which saw half the country taken by the rebels. European mercenaries, US, and Belgian troops were called in by the Congolese government to defeat the rebellion.\n\nZaire (1965–97)\n\nUnrest and rebellion plagued the government until November 1965, when Lieutenant General Mobutu, by then commander in chief of the national army, seized control of the country and declared himself president for five years. Mobutu quickly consolidated his power and was elected unopposed as president in 1970. Embarking on a campaign of cultural awareness, Mobutu renamed the country the Republic of Zaire in 1971 and required citizens to adopt African names as well as drop their French-language ones. Relative peace and stability prevailed until 1977 and 1978 when Katangan rebels, based in Angola, launched a series of invasions (Shaba I and II) into the Shaba (Katanga) region. The rebels were driven out with the aid of Belgian paratroopers.\n\nZaire remained a one-party state in the 1980s. Although Mobutu successfully maintained control during this period, opposition parties, most notably the Union pour la Démocratie et le Progrès Social (UDPS), were active. Mobutu's attempts to quell these groups drew significant international criticism.\n\nAs the Cold War came to a close, internal and external pressures on Mobutu increased. In late 1989 and early 1990, Mobutu was weakened by a series of domestic protests, by heightened international criticism of his regime's human rights practices, by a faltering economy, and by government corruption, most notably his massive embezzlement of government funds for personal use.\n\nIn April 1990, Mobutu declared the Third Republic, agreeing to a limited multi-party system with elections and a constitution. As details of a reform package were delayed, soldiers in September 1991 began looting Kinshasa to protest their unpaid wages. Two thousand French and Belgian troops, some of whom were flown in on U.S. Air Force planes, arrived to evacuate the 20,000 endangered foreign nationals in Kinshasa.\n\nIn 1992, after previous similar attempts, the long-promised Sovereign National Conference was staged, encompassing over 2,000 representatives from various political parties. The conference gave itself a legislative mandate and elected Archbishop Laurent Monsengwo as its chairman, along with Étienne Tshisekedi wa Mulumba, leader of the UDPS, as prime minister. By the end of the year Mobutu had created a rival government with its own prime minister. The ensuing stalemate produced a compromise merger of the two governments into the High Council of Republic-Parliament of Transition (HCR-PT) in 1994, with Mobutu as head of state and Kengo Wa Dondo as prime minister. Although presidential and legislative elections were scheduled repeatedly over the next two years, they never took place.\n\nCivil Wars (1996-2003)\n\nFirst Congo War (1996–97)\n\nBy 1996, tensions from the neighboring Rwanda war and genocide had spilled over to Zaire: see History of Rwanda. Rwandan Hutu militia forces (Interahamwe), who had fled Rwanda following the ascension of a Tutsi-led government, had been using Hutu refugees camps in eastern Zaire as a basis for incursion against Rwanda. These Hutu militia forces soon allied with the Zairian armed forces (FAZ) to launch a campaign against Congolese ethnic Tutsis in eastern Zaire. In turn, these Tutsis formed a militia to defend themselves against attacks. When the Zairian government began to escalate its massacres in November 1996, the Tutsi militias erupted in rebellion against Mobutu.\n\nThe Tutsi militia was soon joined by various opposition groups and supported by several countries, including Rwanda and Uganda. This coalition, led by Laurent-Desire Kabila, became known as the Alliance des Forces Démocratiques pour la Libération du Congo-Zaïre (AFDL). The AFDL, now seeking the broader goal of ousting Mobutu, made significant military gains in early 1997. They were soon joined by various Zairean politicians, who had been unsuccessfully opposing the dictatorship of Mobutu for many years, and now saw an opportunity for them in the invasion of Zaire by two of the region's strongest military forces. Following failed peace talks between Mobutu and Kabila in May 1997, Mobutu left the country, and Kabila marched unopposed to Kinshasa on 20 May. Kabila named himself president, consolidated power around himself and the AFDL, and reverted the name of the country to the Democratic Republic of Congo.\n\nSecond Congo War (1998–2003)\n\nKabila demonstrated little ability to manage the problems of his country, and lost his allies. To counterbalance the power and influence of Rwanda in DRC, the Ugandan troops instigated the creation of another rebel movement called the Movement for the Liberation of Congo (MLC), led by the Congolese warlord Jean-Pierre Bemba. They attacked in August 1998, backed by Rwandan and Ugandan troops. Soon afterwards, Angola, Namibia, and Zimbabwe became involved militarily in the Congo, with Angola and Zimbabwe supporting the government. While the six African governments involved in the war signed a ceasefire accord in Lusaka in July 1999, the Congolese rebels did not and the ceasefire broke down within months. However, Kabila was assassinated in 2001 by one of his bodyguards and was succeeded by his son, Joseph. Upon taking office, Kabila called for multilateral peace talks to end the war. Kabila partly succeeded when a further peace deal was brokered between him, Uganda, and Rwanda leading to the apparent withdrawal of foreign troops.\n\nCurrently, the Ugandans and the MLC still hold a 200 mi wide section of the north of the country; Rwandan forces and its front, the Rassemblement Congolais pour la Démocratie (RCD) control a large section of the east; and government forces or their allies hold the west and south of the country. There were reports that the conflict is being prolonged as a cover for extensive looting of the substantial natural resources in the country, including diamonds, copper, zinc, and coltan. The conflict was reignited in January 2002 by ethnic clashes in the northeast and both Uganda and Rwanda then halted their withdrawal and sent in more troops. Talks between Kabila and the rebel leaders, held in Sun City, lasted a full six weeks, beginning in April 2002. In June, they signed a peace accord in which Kabila would share power with former rebels. By June 2003, all foreign armies except those of Rwanda had pulled out of Congo. Few people in the Congo  have been unaffected by the armed conflict. A survey conducted in 2009 by the ICRC and Ipsos shows that three quarters (76%) of the people interviewed have been affected in some way–either personally or due to the wider consequences of armed conflict.[http://www.icrc.org/Web/eng/siteeng0.nsf/htmlall/views-from-field-report-240609/$File/Our-World-Views-from-DRC-I-ICRC.pdf DRC, Opinion survey 2009], by ICRC and Ipsos\n\nThe response of the international community has been incommensurate with the scale of the disaster resulting from the war in the Congo. Its support for political and diplomatic efforts to end the war has been relatively consistent, but it has taken no effective steps to abide by repeated pledges to demand accountability for the war crimes and crimes against humanity that were routinely committed in Congo. United Nations Security Council and the U.N. Secretary-General have frequently denounced human rights abuses and the humanitarian disaster that the war unleashed on the local population. But they had shown little will to tackle the responsibility of occupying powers for the atrocities taking place in areas under their control, areas where the worst violence in the country took place. Hence Rwanda, like Uganda, has escaped any significant sanction for its role.\n\nJoseph Kabila period\n\nTransitional government (2003–06)\n\nDR Congo had a transitional government in July 2003 until the election was over. A constitution was approved by voters and on 30 July 2006 the Congo held its first multi-party elections since independence in 1960. After this Joseph Kabila took 45% of the votes and his opponent Jean-Pierre Bemba took 20%. That was the origin of a fight between the two parts from  20–22 August 2006 in the streets of the capital, Kinshasa. Sixteen people died before policemen and UN mission MONUC took control of the city. A new election was held on 29 October 2006, which Kabila won with 70% of the vote. Bemba has publicly commented on election \"irregularities,\" despite the fact that every neutral observer has praised the elections. On 6 December 2006 the Transitional Government came to an end as Joseph Kabila was sworn in as President.\n\nKabila exceeds his mandate\n\nIn December 2011, Joseph Kabila was re-elected for a second term as president. After the results were announced on 9 December, there was violent unrest in Kinshasa and Mbuji-Mayi, where official tallies showed that a strong majority had voted for the opposition candidate Etienne Tshisekedi. Official observers from the Carter Center reported that returns from almost 2,000 polling stations in areas where support for Tshisekedi was strong had been lost and not included in the official results. They described the election as lacking credibility.  On 20 December, Kabila was sworn in for a second term, promising to invest in infrastructure and public services. However, Tshisekedi maintained that the result of the election was illegitimate and said that he intended also to \"swear himself in\" as president.\n\nOn 19 January 2015 protests led by students at the University of Kinshasa broke out. The protests began following the announcement of a proposed law that would allow Kabila to remain in power until a national census can be conducted (elections had been planned for 2016). By Wednesday 21 January clashes between police and protesters had claimed at least 42 lives (although the government claimed only 15 people had been killed).\n\nSimilarly, in September 2016, violent protests were met with brutal force by the police and Republican Guard soldiers. Opposition groups claim 80 dead, including the Students' Union leader. From Monday 19 September Kinshasa residents, as well as residents elsewhere in Congo, where mostly confined to their homes. Police arrested anyone remotely connected to the opposition as well as innocent onlookers. Government propaganda, on television, and actions of covert government groups in the streets, act against opposition as well as foreigners. The president's mandate was due to end on December 19, 2016, but no plans have been made to elect a replacement at that time. More demonstrations are planned to mark the passing of this date.[https://www.theguardian.com/world/2016/sep/19/democratic-republic-congo-demonstrations-banned-police-killed-joseph-kabila-etienne-tshisekedi  Guardian - Demonstrations banned Police killed (20 September 2016)] Opposition groups claim that the outcome of late elections would be civil war.[https://www.theguardian.com/world/2016/nov/10/democratic-republic-of-the-congo-faces-civil-war-if-president-fails-to-quit  Democratic Republic of Congo faces civil war]\n\nMaman Sidikou, the Secretary-General's Special Representative for DR Congo and head of MONUSCO, said that a tipping point into uncontrolable violence could come about very quickly if the political situation is not normalised.[https://www.un.org/apps/news/story.asp?NewsID=55266#.WCXw_r2LSM8  Political polarization in DR Congo may spark ‘large-scale violence,’ UN envoy warns Security Council]\n\nContinued conflicts\n\nThe inability of the state and the world's largest United Nations peacekeeping force to provide security throughout the vast country has led to the emergence of up to 70 armed groups, perhaps the largest number in the world, and a collection of mini-wars between them, especially in the remote east of the country. Armed groups are often accused of being proxies or being supported by regional governments interested in Eastern Congo’s vast mineral wealth. Some argue that much of the lack of security by the national army is strategic on the part of the government, who let the army profit from illegal logging and mining operations in return for loyalty.\n\nIturi conflict\n\nThe Ituri conflict involved fighting between the agriculturalist Lendu and pastoralist Hema ethnic groups in the Ituri region of the north-eastern DRC. While \"Ituri conflict\" often refers to the major fighting from 1999 to 2003, low level fighting has existed before and continues since that time.\n\nDongo Conflict\n\nIn October 2009 a new conflict started in Dongo, Sud-Ubangi District where clashes had broken out over access to fishing ponds.\n\nConflict in Kivu (2004-present)\n\nLaurent Nkunda with other soldiers from RCD-Goma who were integrated into the army defected and called themselves the National Congress for the Defence of the People (CNDP). Starting in 2004, CNDP, believed to be backed by Rwanda as a way to tackle the Hutu group Democratic Forces for the Liberation of Rwanda (FDLR), rebelled against the government, claiming to protect the Banyamulenge (Congolese Tutsis). In 2009, after a deal between the DRC and Rwanda, Rwandan troops entered the DRC and arrested Nkunda and were allowed to pursue FDLR militants. The CNDP signed a peace treaty with the government where its soldiers would be integrated into the national army.\n\nIn April 2012, the leader of the CNDP, Bosco Ntaganda and troops loyal to him mutinied, claiming a violation of the peace treaty and formed a rebel group, the March 23 Movement (M23), which was believed to be backed by Rwanda. On 20 November 2012, M23 took control of Goma, a provincial capital with a population of one million people. The UN authorized the Force Intervention Brigade (FIB), which was the first UN peacekeeping force with a mandate to neutralize opposition rather than a defensive mandate, and the FIB quickly defeated M23. The FIB was then to fight the FDLR but were hampered by the efforts of the Congolese government, who some believe tolerate the FDLR as a counterweight to Rwandan interests. Since 2017, fighters from M23, most of whom had fled into Uganda and Rwanda (both were believed to have supported them), started crossing back into DRC with the rising crisis over Kabila's extension of his term limit. DRC claimed of clashes with M23.\n\nAllied Democratic Forces insurgency\n\nThe Allied Democratic Forces has been waging an insurgency in the Democratic Republic of the Congo and is blamed for the Beni massacre in 2016. While the Congolese army maintains that the ADF is an Islamist insurgency, most observers feel that they are only a criminal group interested in gold mining and logging.\n\nEthnic Mai Mai factions\n\nIn June 2017, the group, mostly based in South Kivu, called the National People’s Coalition for the Sovereignty of Congo (CNPSC) led by William Yakutumba was formed and became the strongest rebel group in the east, even briefly capturing a few strategic towns. The rebel group is one of three alliances of various Mai-Mai militias and has been referred to as the Alliance of Article 64, a reference to Article 64 of the constitution, which says the people have an obligation to fight efforts of those who seek to take power by force, in reference to President Kabila. Bembe warlord Yakutumba's Mai-Mai Yakutumba is the largest component of the CNPSC and have had friction with the Congolese Tutsis who often make up commanders in army units.\n\nIn 2012, the Congolese army in its attempt to crush the Rwandan backed and Tutsi-dominated CNDP and M23 rebels, empowered and used Hutu groups such as the FDLR and a Hutu dominated Mai-Mai group called Nyatura as proxies in its fight. The Nyatura and FDLR even arbitrarily executed up to 264 mostly Tembo civlians in 2012. In 2015, the army then launched an offensive against the FDLR militia. The FDLR are accused of killing at least 14 Nande people in January 2016 and of killing 10 Nandes and burning houses in July 2016 while an FDLR allied group Maï Maï Nyatura are also accused of killing Nandes. The Nande-dominate UPDI militia, a Nande militia called Mai-Mai Mazembe and a militia dominated by Nyanga people, the \"Nduma Defence of Congo\" (NDC), also called Maï-Maï Sheka and led by Gédéon Kyungu Mutanga, are accused of attacking Hutus. In North Kivu, in 2017, an alliance of Mai-Mai groups called the National Movement of Revolutionaries (MNR) began attacks in June 2017 includes Nande Mai-Mai leaders from groups such as Corps du Christ and Mai-Mai Mazembe. Another alliance of Mai-Mai groups is CMC which brings together Hutu militia Nyatura and are active along the border between North Kivu and South Kivu.\n\nConflict in Katanga\n\nIn Northern Katanga Province starting in 2013, the Pygmy Batwa people, whom the Luba people often exploit and allegedly enslave, rose up into militias, such as the \"Perci\" militia, and attacked Luba villages. A Luba militia known as \"Elements\" or \"Elema\" attacked back, notably killing at least 30 people in the \"Vumilia 1\" displaced people camp in April 2015. Since the start of the conflict, hundreds have been killed and tens of thousands have been displaced from their homes. The weapons used in the conflict are often arrows and axes, rather than guns.\n\nElema also began fighting the government mainly with machetes, bows and arrows in Congo’s Haut Katanga and Tanganyika provinces. The government forces fought alongside a tribe known as the Abatembo and targeting civilians of the Luba and the Tabwa tribes who were believed to be sympathetic to the Elema. \n\nConflict in Kasai\n\nIn the Kasaï-Central province, starting in 2016, the largely Luba Kamwina Nsapu militia led by Kamwina Nsapu attacked state institutions. The leader was killed by authorities in August 2016 and the militia reportedly took revenge by attacking civilians. By June 2017, it is estimated that more than 3,300 people have been killed and 20 villages have been completely destroyed, half of them by government troops. The militia has expanded to the neighboring Kasai-Oriental area, Kasaï and Lomami.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "History of the Democratic Republic of the Congo" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8022" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The region that is now the Democratic Republic of the Congo was first settled about 80,000 years ago. The Kingdom of Kongo remained present in the region between the 14th and the early 19th centuries. Belgian colonization began when King Leopold II founded the Congo Free State, a corporate state run solely by King Leopold. Reports of widespread murder and torture in the rubber plantations led the Belgian government to seize the Congo from Leopold II and establish the Belgian Congo. Under Belgian rule, the colony was run with the presence of numerous Christian organizations that wanted to Westernize the Congolese people.\n\nAfter an uprising by the Congolese people, Belgium surrendered to the independence of the Congo in 1960. However, the Congo was left unstable because tribal leaders had more power than the central government. Prime Minister Patrice Lumumba tried to restore order with the aid of the Soviet Union as part of the Cold War, causing the United States to support a coup led by Colonel Joseph Mobutu in 1965. Mobutu quickly seized complete power of the Congo and renamed the country Zaire. He sought to Africanize the country, changing his own name to Mobutu Sese Seko, and demanded that African citizens change their Western names to traditional African names. Mobutu sought to repress any opposition to his rule, in which he successfully did throughout the 1980s. However, with his regime weakened in the early 1990s, Mobutu was forced to agree to a power-sharing government with the opposition party. Mobutu remained the head of state and promised elections for the next two years that never happened.\n\nIn the First Congo War, Rwanda invaded Zaire, which overthrew Mobutu during the process. Laurent-Desire Kabila later took power and renamed the Democratic Republic of the Congo. After a disappointing rule under Kabila, the Second Congo War broke out, resulting in a regional war with many different African nations taking part. Kabila was assassinated by his bodyguard in 2001, and his son, Joseph, succeeded him and was later elected president by the Congolese government in 2006. Kabila quickly sought peace, ending the era of war in Africa. Soldiers were left in the Congo for a few years and a power-sharing government between Kabila and the opposition party was set up. Kabila later resumed complete control over the Congo and was re-elected in a disputed election in 2011. Today, the Congo remains dangerously unstable.\n\nEarly history\n\nThe area now known as the karmalli walaDemocratic Republic of the Congo was populated as early as 80,000 years ago, as shown by the 1988 discovery of the Semliki harpoon at Katanda, one of the oldest barbed harpoons ever found, and which is believed to have been used to catch giant river catfish.http://www.springerlink.com/content/g36v03001423n142/ During its history, the area has also been known as Congo, Congo Free State, Belgian Congo, and Zaire. The Kingdom of Kongo was a powerful kingdom that existed between the 14th and the early 19th century. It was the dominant force in the region along with the luba empire, the lunda and the mongo until the arrival of the Portuguese. Second in importance was the Anziku Kingdom.\n\nColonial rule\n\nCongo Free State (1885–1908)\n\nThe Congo Free State was a corporate state privately controlled by Leopold II of Belgium through the Association internationale africaine, a non-governmental organization. Leopold was the sole shareholder and chairman. The state included the entire area of the present Democratic Republic of the Congo. Under Leopold II's administration, the Congo Free State became the site of one of the most infamous international scandals of the turn of the twentieth century. The report of the British Consul Roger Casement led to the arrest and punishment of white officials who had been responsible for cold-blooded killings during a rubber-collecting expedition in 1900, including one Belgian national for causing the shooting of at least 122 Congolese natives. Estimates of the total death toll vary considerably. In the absence of a census, the first was made in 1924, it is even more difficult to quantify the population loss of the period. Roger Casement's famous 1904 report estimated ten million people. According to Casement's report, indiscriminate \"war\", starvation, reduction of births and tropical diseases caused the country's depopulation.[http://www.urome.be/fr2/reflexions/casemrepo.pdf Report of the British Consul, Roger Casement, on the Administration of the Congo Free State] The European and U.S. press agencies exposed the conditions in the Congo Free State to the public in 1900. By 1908 public and diplomatic pressure led Leopold II to annex the Congo as the Belgian Congo colony.\n\nBelgian Congo (1908–60)\n\nOn the 15th of November 1908 King Léopold II of Belgium formally relinquished personal control of the Congo Free State. The renamed Belgian Congo was put under the direct administration of the Belgian government and its Ministry of Colonies.\n\nBelgian rule in the Congo was based around the \"colonial trinity\" (trinité coloniale) of state, missionary and private company interests. The privileging of Belgian commercial interests meant that large amounts of capital flowed into the Congo and that individual regions became specialised. On many occasions, the interests of the government and private enterprise became closely tied and the state helped companies break strikes and remove other barriers imposed by the indigenous population. The country was split into nesting, hierarchically organised administrative subdivisions, and run uniformly according to a set \"native policy\" (politique indigène)—in contrast to the British and the French, who generally favoured the system of indirect rule whereby traditional leaders were retained in positions of authority under colonial oversight. There was also a high degree of racial segregation. Large numbers of white immigrants who moved to the Congo after the end of World War II came from across the social spectrum, but were nonetheless always treated as superior to blacks.\n\nDuring the 1940s and 1950s, the Congo experienced an unprecedented level of urbanisation and the colonial administration began various development programmes aimed at making the territory into a \"model colony\". Notable advances were made in treating diseases such as African trypanosomiasis. One of the results of these measures was the development of a new middle class of Europeanised African \"évolué\" in the cities. By the 1950s the Congo had a wage labour force twice as large as that in any other African colony. The Congo's rich natural resources, including uranium—much of the uranium used by the U.S. nuclear programme during World War II was Congolese—led to substantial interest in the region from both the Soviet Union and the United States as the Cold War developed.\n\nIndependence and the Congo Crisis (1960–65)\n\nFollowing riots in Leopoldville between 4–7 January 1959, and Stanleyville on 31 October 1959, the Belgians realised they could not maintain control of such a vast country in the face of rising demands for independence. The Belgians and Congolese political leaders held a Round Table Conference in Brussels beginning on 18 January 1960. At the end of the Conference on 27 January 1960 it was announced that elections would be held in the Congo on 22 May 1960, and full independence granted on 30 June 1960. The Congo was indeed granted its independence on 30 June 1960, adopting the name \"Republic of the Congo\" (République du Congo).  As the French colony of Middle Congo (Moyen Congo) also chose the name Republic of Congo upon receiving its independence, the two countries were more commonly known as Congo-Léopoldville and Congo-Brazzaville, after their capital cities. President Mobutu changed the country's official name to Zaire in 1971, which comes from Portuguese, adapted from the Kongo word nzere or nzadi (\"river that swallows all rivers\")Forbath, Peter (1977). The River Congo: The Discovery, Exploration and Exploitation of the World's Most Dramatic Rivers. Harper & Row. p. 19. .\n\nIn 1960, the country was in a very unstable state—regional tribal leaders held far more power than the central government—and with the departure of the Belgian administrators, there were almost no skilled bureaucrats left in the country. The first Congolese university graduate was only in 1956, and very few in the new nation had any idea of how to manage a country of such size.\n\nParliamentary elections in 1960 produced the nationalist Patrice Lumumba as prime minister and pro-Western Joseph Kasavubu as president of the newly independent Republic of The Congo.\n\nEven from this fleeting moment of independence democracy began to unravel. On 5 July 1960, a military mutiny by Congolese soldiers against their European officers broke out in the capital and rampant looting began. On 11 July 1960 the richest province of the country, Katanga, seceded under Moise Tshombe. The United Nations sent 20,000 peacekeepers to protect Europeans in the country and try to restore order. Western paramilitaries and mercenaries, often hired by mining companies to protect their interests, also began to pour into the country. In this same period Congo's second richest province, Kasai, also announced its independence on 8 August 1960.\n\nPrime Minister Lumumba turned to the USSR for assistance. Nikita Khrushchev agreed to help, offering advanced weaponry and technical advisors.  The United States viewed the Soviet presence as an attempt to take advantage of the situation and gain a proxy state in sub-Saharan Africa. UN forces were ordered to block any shipments of arms into the country. The United States also looked for a way to replace Lumumba as leader. President Kasavubu had clashed with Prime Minister Lumumba and advocated an alliance with the West rather than the Soviets. The U.S. sent weapons and CIA personnel to aid forces allied with Kasavubu and combat the Soviet presence. On 14 September 1960, with U.S. and CIA support, Colonel Joseph Mobutu overthrew the government and arrested Lumumba.\n\nOn 17 January 1961 Mobutu sent Lumumba to Élisabethville (now Lubumbashi), capital of Katanga. In full view of the press he was beaten and forced to eat copies of his own speeches. For the next three weeks, he was not seen or heard from. Then Katangan radio announced implausibly that he had escaped and been killed by some villagers. In fact he had been tortured and killed along with two others shortly after his arrival. It was soon clear that he had been murdered in custody. In 2001, a Belgian inquiry established that he had been shot by Katangan gendarmes in the presence of Belgian officers, under Katangan command. Lumumba was beaten, placed in front of a firing squad with 2 other allies, cut up, buried, dug up and what remained was dissolved in acid.De Witte, Ludo: The Assassination of Lumumba, Verso, 2001.\n\nIn Stanleyville, those loyal to the deposed Lumumba set up a rival government under Antoine Gizenga which lasted from 31 March 1961 until it was reintegrated on 5 August 1961. After some reverses, UN and Congolese government forces succeeded in recapturing the breakaway provinces of South Kasai on 30 December 1961, and Katanga on 15 January 1963.\n\nA new crisis erupted in the Simba Rebellion of 1964-1965 which saw half the country taken by the rebels. European mercenaries, US, and Belgian troops were called in by the Congolese government to defeat the rebellion.\n\nZaire (1965–97)\n\nUnrest and rebellion plagued the government until November 1965, when Lieutenant General Mobutu, by then commander in chief of the national army, seized control of the country and declared himself president for five years. Mobutu quickly consolidated his power and was elected unopposed as president in 1970. Embarking on a campaign of cultural awareness, Mobutu renamed the country the Republic of Zaire in 1971 and required citizens to adopt African names as well as drop their French-language ones. Relative peace and stability prevailed until 1977 and 1978 when Katangan rebels, based in Angola, launched a series of invasions (Shaba I and II) into the Shaba (Katanga) region. The rebels were driven out with the aid of Belgian paratroopers.\n\nZaire remained a one-party state in the 1980s. Although Mobutu successfully maintained control during this period, opposition parties, most notably the Union pour la Démocratie et le Progrès Social (UDPS), were active. Mobutu's attempts to quell these groups drew significant international criticism.\n\nAs the Cold War came to a close, internal and external pressures on Mobutu increased. In late 1989 and early 1990, Mobutu was weakened by a series of domestic protests, by heightened international criticism of his regime's human rights practices, by a faltering economy, and by government corruption, most notably his massive embezzlement of government funds for personal use.\n\nIn April 1990, Mobutu declared the Third Republic, agreeing to a limited multi-party system with elections and a constitution. As details of a reform package were delayed, soldiers in September 1991 began looting Kinshasa to protest their unpaid wages. Two thousand French and Belgian troops, some of whom were flown in on U.S. Air Force planes, arrived to evacuate the 20,000 endangered foreign nationals in Kinshasa.\n\nIn 1992, after previous similar attempts, the long-promised Sovereign National Conference was staged, encompassing over 2,000 representatives from various political parties. The conference gave itself a legislative mandate and elected Archbishop Laurent Monsengwo as its chairman, along with Étienne Tshisekedi wa Mulumba, leader of the UDPS, as prime minister. By the end of the year Mobutu had created a rival government with its own prime minister. The ensuing stalemate produced a compromise merger of the two governments into the High Council of Republic-Parliament of Transition (HCR-PT) in 1994, with Mobutu as head of state and Kengo Wa Dondo as prime minister. Although presidential and legislative elections were scheduled repeatedly over the next two years, they never took place.\n\nCivil Wars (1996-2003)\n\nFirst Congo War (1996–97)\n\nBy 1996, tensions from the neighboring Rwanda war and genocide had spilled over to Zaire: see History of Rwanda. Rwandan Hutu militia forces (Interahamwe), who had fled Rwanda following the ascension of a Tutsi-led government, had been using Hutu refugees camps in eastern Zaire as a basis for incursion against Rwanda. These Hutu militia forces soon allied with the Zairian armed forces (FAZ) to launch a campaign against Congolese ethnic Tutsis in eastern Zaire. In turn, these Tutsis formed a militia to defend themselves against attacks. When the Zairian government began to escalate its massacres in November 1996, the Tutsi militias erupted in rebellion against Mobutu.\n\nThe Tutsi militia was soon joined by various opposition groups and supported by several countries, including Rwanda and Uganda. This coalition, led by Laurent-Desire Kabila, became known as the Alliance des Forces Démocratiques pour la Libération du Congo-Zaïre (AFDL). The AFDL, now seeking the broader goal of ousting Mobutu, made significant military gains in early 1997. They were soon joined by various Zairean politicians, who had been unsuccessfully opposing the dictatorship of Mobutu for many years, and now saw an opportunity for them in the invasion of Zaire by two of the region's strongest military forces. Following failed peace talks between Mobutu and Kabila in May 1997, Mobutu left the country, and Kabila marched unopposed to Kinshasa on 20 May. Kabila named himself president, consolidated power around himself and the AFDL, and reverted the name of the country to the Democratic Republic of Congo.\n\nSecond Congo War (1998–2003)\n\nKabila demonstrated little ability to manage the problems of his country, and lost his allies. To counterbalance the power and influence of Rwanda in DRC, the Ugandan troops instigated the creation of another rebel movement called the Movement for the Liberation of Congo (MLC), led by the Congolese warlord Jean-Pierre Bemba. They attacked in August 1998, backed by Rwandan and Ugandan troops. Soon afterwards, Angola, Namibia, and Zimbabwe became involved militarily in the Congo, with Angola and Zimbabwe supporting the government. While the six African governments involved in the war signed a ceasefire accord in Lusaka in July 1999, the Congolese rebels did not and the ceasefire broke down within months. However, Kabila was assassinated in 2001 by one of his bodyguards and was succeeded by his son, Joseph. Upon taking office, Kabila called for multilateral peace talks to end the war. Kabila partly succeeded when a further peace deal was brokered between him, Uganda, and Rwanda leading to the apparent withdrawal of foreign troops.\n\nCurrently, the Ugandans and the MLC still hold a 200 mi wide section of the north of the country; Rwandan forces and its front, the Rassemblement Congolais pour la Démocratie (RCD) control a large section of the east; and government forces or their allies hold the west and south of the country. There were reports that the conflict is being prolonged as a cover for extensive looting of the substantial natural resources in the country, including diamonds, copper, zinc, and coltan. The conflict was reignited in January 2002 by ethnic clashes in the northeast and both Uganda and Rwanda then halted their withdrawal and sent in more troops. Talks between Kabila and the rebel leaders, held in Sun City, lasted a full six weeks, beginning in April 2002. In June, they signed a peace accord in which Kabila would share power with former rebels. By June 2003, all foreign armies except those of Rwanda had pulled out of Congo. Few people in the Congo  have been unaffected by the armed conflict. A survey conducted in 2009 by the ICRC and Ipsos shows that three quarters (76%) of the people interviewed have been affected in some way–either personally or due to the wider consequences of armed conflict.[http://www.icrc.org/Web/eng/siteeng0.nsf/htmlall/views-from-field-report-240609/$File/Our-World-Views-from-DRC-I-ICRC.pdf DRC, Opinion survey 2009], by ICRC and Ipsos\n\nThe response of the international community has been incommensurate with the scale of the disaster resulting from the war in the Congo. Its support for political and diplomatic efforts to end the war has been relatively consistent, but it has taken no effective steps to abide by repeated pledges to demand accountability for the war crimes and crimes against humanity that were routinely committed in Congo. United Nations Security Council and the U.N. Secretary-General have frequently denounced human rights abuses and the humanitarian disaster that the war unleashed on the local population. But they had shown little will to tackle the responsibility of occupying powers for the atrocities taking place in areas under their control, areas where the worst violence in the country took place. Hence Rwanda, like Uganda, has escaped any significant sanction for its role.\n\nJoseph Kabila period\n\nTransitional government (2003–06)\n\nDR Congo had a transitional government in July 2003 until the election was over. A constitution was approved by voters and on 30 July 2006 the Congo held its first multi-party elections since independence in 1960. After this Joseph Kabila took 45% of the votes and his opponent Jean-Pierre Bemba took 20%. That was the origin of a fight between the two parts from  20–22 August 2006 in the streets of the capital, Kinshasa. Sixteen people died before policemen and UN mission MONUC took control of the city. A new election was held on 29 October 2006, which Kabila won with 70% of the vote. Bemba has publicly commented on election \"irregularities,\" despite the fact that every neutral observer has praised the elections. On 6 December 2006 the Transitional Government came to an end as Joseph Kabila was sworn in as President.\n\nKabila exceeds his mandate\n\nIn December 2011, Joseph Kabila was re-elected for a second term as president. After the results were announced on 9 December, there was violent unrest in Kinshasa and Mbuji-Mayi, where official tallies showed that a strong majority had voted for the opposition candidate Etienne Tshisekedi. Official observers from the Carter Center reported that returns from almost 2,000 polling stations in areas where support for Tshisekedi was strong had been lost and not included in the official results. They described the election as lacking credibility.  On 20 December, Kabila was sworn in for a second term, promising to invest in infrastructure and public services. However, Tshisekedi maintained that the result of the election was illegitimate and said that he intended also to \"swear himself in\" as president.\n\nOn 19 January 2015 protests led by students at the University of Kinshasa broke out. The protests began following the announcement of a proposed law that would allow Kabila to remain in power until a national census can be conducted (elections had been planned for 2016). By Wednesday 21 January clashes between police and protesters had claimed at least 42 lives (although the government claimed only 15 people had been killed).\n\nSimilarly, in September 2016, violent protests were met with brutal force by the police and Republican Guard soldiers. Opposition groups claim 80 dead, including the Students' Union leader. From Monday 19 September Kinshasa residents, as well as residents elsewhere in Congo, where mostly confined to their homes. Police arrested anyone remotely connected to the opposition as well as innocent onlookers. Government propaganda, on television, and actions of covert government groups in the streets, act against opposition as well as foreigners. The president's mandate was due to end on December 19, 2016, but no plans have been made to elect a replacement at that time. More demonstrations are planned to mark the passing of this date.[https://www.theguardian.com/world/2016/sep/19/democratic-republic-congo-demonstrations-banned-police-killed-joseph-kabila-etienne-tshisekedi  Guardian - Demonstrations banned Police killed (20 September 2016)] Opposition groups claim that the outcome of late elections would be civil war.[https://www.theguardian.com/world/2016/nov/10/democratic-republic-of-the-congo-faces-civil-war-if-president-fails-to-quit  Democratic Republic of Congo faces civil war]\n\nMaman Sidikou, the Secretary-General's Special Representative for DR Congo and head of MONUSCO, said that a tipping point into uncontrolable violence could come about very quickly if the political situation is not normalised.[https://www.un.org/apps/news/story.asp?NewsID=55266#.WCXw_r2LSM8  Political polarization in DR Congo may spark ‘large-scale violence,’ UN envoy warns Security Council]\n\nContinued conflicts\n\nThe inability of the state and the world's largest United Nations peacekeeping force to provide security throughout the vast country has led to the emergence of up to 70 armed groups, perhaps the largest number in the world, and a collection of mini-wars between them, especially in the remote east of the country. Armed groups are often accused of being proxies or being supported by regional governments interested in Eastern Congo’s vast mineral wealth. Some argue that much of the lack of security by the national army is strategic on the part of the government, who let the army profit from illegal logging and mining operations in return for loyalty.\n\nIturi conflict\n\nThe Ituri conflict involved fighting between the agriculturalist Lendu and pastoralist Hema ethnic groups in the Ituri region of the north-eastern DRC. While \"Ituri conflict\" often refers to the major fighting from 1999 to 2003, low level fighting has existed before and continues since that time.\n\nDongo Conflict\n\nIn October 2009 a new conflict started in Dongo, Sud-Ubangi District where clashes had broken out over access to fishing ponds.\n\nConflict in Kivu (2004-present)\n\nLaurent Nkunda with other soldiers from RCD-Goma who were integrated into the army defected and called themselves the National Congress for the Defence of the People (CNDP). Starting in 2004, CNDP, believed to be backed by Rwanda as a way to tackle the Hutu group Democratic Forces for the Liberation of Rwanda (FDLR), rebelled against the government, claiming to protect the Banyamulenge (Congolese Tutsis). In 2009, after a deal between the DRC and Rwanda, Rwandan troops entered the DRC and arrested Nkunda and were allowed to pursue FDLR militants. The CNDP signed a peace treaty with the government where its soldiers would be integrated into the national army.\n\nIn April 2012, the leader of the CNDP, Bosco Ntaganda and troops loyal to him mutinied, claiming a violation of the peace treaty and formed a rebel group, the March 23 Movement (M23), which was believed to be backed by Rwanda. On 20 November 2012, M23 took control of Goma, a provincial capital with a population of one million people. The UN authorized the Force Intervention Brigade (FIB), which was the first UN peacekeeping force with a mandate to neutralize opposition rather than a defensive mandate, and the FIB quickly defeated M23. The FIB was then to fight the FDLR but were hampered by the efforts of the Congolese government, who some believe tolerate the FDLR as a counterweight to Rwandan interests. Since 2017, fighters from M23, most of whom had fled into Uganda and Rwanda (both were believed to have supported them), started crossing back into DRC with the rising crisis over Kabila's extension of his term limit. DRC claimed of clashes with M23.\n\nAllied Democratic Forces insurgency\n\nThe Allied Democratic Forces has been waging an insurgency in the Democratic Republic of the Congo and is blamed for the Beni massacre in 2016. While the Congolese army maintains that the ADF is an Islamist insurgency, most observers feel that they are only a criminal group interested in gold mining and logging.\n\nEthnic Mai Mai factions\n\nIn June 2017, the group, mostly based in South Kivu, called the National People’s Coalition for the Sovereignty of Congo (CNPSC) led by William Yakutumba was formed and became the strongest rebel group in the east, even briefly capturing a few strategic towns. The rebel group is one of three alliances of various Mai-Mai militias and has been referred to as the Alliance of Article 64, a reference to Article 64 of the constitution, which says the people have an obligation to fight efforts of those who seek to take power by force, in reference to President Kabila. Bembe warlord Yakutumba's Mai-Mai Yakutumba is the largest component of the CNPSC and have had friction with the Congolese Tutsis who often make up commanders in army units.\n\nIn 2012, the Congolese army in its attempt to crush the Rwandan backed and Tutsi-dominated CNDP and M23 rebels, empowered and used Hutu groups such as the FDLR and a Hutu dominated Mai-Mai group called Nyatura as proxies in its fight. The Nyatura and FDLR even arbitrarily executed up to 264 mostly Tembo civlians in 2012. In 2015, the army then launched an offensive against the FDLR militia. The FDLR are accused of killing at least 14 Nande people in January 2016 and of killing 10 Nandes and burning houses in July 2016 while an FDLR allied group Maï Maï Nyatura are also accused of killing Nandes. The Nande-dominate UPDI militia, a Nande militia called Mai-Mai Mazembe and a militia dominated by Nyanga people, the \"Nduma Defence of Congo\" (NDC), also called Maï-Maï Sheka and led by Gédéon Kyungu Mutanga, are accused of attacking Hutus. In North Kivu, in 2017, an alliance of Mai-Mai groups called the National Movement of Revolutionaries (MNR) began attacks in June 2017 includes Nande Mai-Mai leaders from groups such as Corps du Christ and Mai-Mai Mazembe. Another alliance of Mai-Mai groups is CMC which brings together Hutu militia Nyatura and are active along the border between North Kivu and South Kivu.\n\nConflict in Katanga\n\nIn Northern Katanga Province starting in 2013, the Pygmy Batwa people, whom the Luba people often exploit and allegedly enslave, rose up into militias, such as the \"Perci\" militia, and attacked Luba villages. A Luba militia known as \"Elements\" or \"Elema\" attacked back, notably killing at least 30 people in the \"Vumilia 1\" displaced people camp in April 2015. Since the start of the conflict, hundreds have been killed and tens of thousands have been displaced from their homes. The weapons used in the conflict are often arrows and axes, rather than guns.\n\nElema also began fighting the government mainly with machetes, bows and arrows in Congo’s Haut Katanga and Tanganyika provinces. The government forces fought alongside a tribe known as the Abatembo and targeting civilians of the Luba and the Tabwa tribes who were believed to be sympathetic to the Elema. \n\nConflict in Kasai\n\nIn the Kasaï-Central province, starting in 2016, the largely Luba Kamwina Nsapu militia led by Kamwina Nsapu attacked state institutions. The leader was killed by authorities in August 2016 and the militia reportedly took revenge by attacking civilians. By June 2017, it is estimated that more than 3,300 people have been killed and 20 villages have been completely destroyed, half of them by government troops. The militia has expanded to the neighboring Kasai-Oriental area, Kasaï and Lomami. History of the Democratic Republic of the Congo. http://en.wikipedia.org/?curid=8022."
  }
}
