{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11114",
  "eid" : "f9acf1b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778498635,
  "textBody" : "Fiqh (; ) is Islamic jurisprudence.[http://www.britannica.com/EBchecked/topic/207723/fiqh Fiqh] Encyclopædia Britannica  While sharia is believed by Muslims to represent divine law as revealed in the Quran and the Sunnah (the teachings and practices of the Islamic prophet Muhammad), fiqh is the human understanding of the sharia—sharia expanded and developed by interpretation (ijtihad) of the Quran and Sunnah by Islamic jurists (ulama) and implemented by the rulings (fatwa) of jurists on questions presented to them. Thus conceptually, whereas sharia is considered immutable and infallible, fiqh is considered fallible and changeable. Fiqh deals with the observance of rituals, morals and social legislation in Islam. In the modern era, there are four prominent schools (madh'hab) of fiqh within Sunni practice, plus two (or three) within Shi'a practice. A person trained in fiqh is known as a faqīh (plural fuqaha).Glasse, Cyril, The New Encyclopedia of Islam, Altamira, 2001, p.141\n\nFiguratively, fiqh means knowledge about Islamic legal rulings from their sources. Thus the figurative definition of fiqh is taken from its literal one in the sense that deriving religious rulings from their sources necessitates the mujtahid (an individual who exercises ijtihad) to have a deep understanding in the different discussions of jurisprudence. A faqīh must look deep down into a matter and not suffice himself with just the apparent meaning, and a person who only knows the appearance of a matter is not qualified as a faqīh.\n\nOn the studies of fiqh, it is traditionally divided into Uṣūl al-fiqh (principles of Islamic jurisprudence, lit. the roots of fiqh), the methods of legal interpretation and analysis, and Furūʿ al-fiqh (lit. the branches of fiqh), the elaboration of rulings on the basis of these principles. Furūʿ al-fiqh is the product of the application of Uṣūl al-fiqh and the total product of human efforts at understanding the divine will. A hukm (plural aḥkām) is a particular ruling in a given case.\n\nEtymology \n\nThe word fiqh is an Arabic term meaning \"deep understanding\" or \"full comprehension\". Technically it refers to the body of Islamic law extracted from detailed Islamic sources (which are studied in the principles of Islamic jurisprudence) and the process of gaining knowledge of Islam through jurisprudence. The historian Ibn Khaldun describes fiqh as \"knowledge of the rules of God which concern the actions of persons who own themselves connected to obey the law respecting what is required (wajib), sinful (haraam), recommended (mandūb), disapproved (makrūh) or neutral (mubah)\".Levy (1957). Page 150. This definition is consistent amongst the jurists.\n\nIn Modern Standard Arabic, fiqh has come to mean jurisprudence in general, be it Islamic or secular. It is thus possible to speak of Chief Justice John Roberts as an expert in the common law fiqh of the United States, or of Egyptian legal scholar Abd El-Razzak El-Sanhuri as an expert in the civil law fiqh of Egypt.\n\nHistory\n\nThe history of Islamic jurisprudence is \"customarily divided into eight periods\".El-Gamal, Islamic Finance, 2006: p.30-1\n*the first period ending with the death of Muhammad in 11 AH.\n*second period \"characterized by personal interpretations\" of the canon by the Sahabah or companions of Muhammad, lasting until 50 A.H.\n*from 50 AH until the early second century AH there was competition between a \"a traditionalist approach to jurisprudence\" in western Arabia where Islam was revealed and a \"rationalist approach in Iraq\".\n*the \"golden age of classical Islamic jurisprudence\" from the \"early second to the mid-fourth century when the eight \"most significant\" schools of Sunni and Shi'i jurisprudence emerged.\"\n*from the mid-fourth century to mid-seventh AH Islamic jurisprudence was \"limited to elaborations within the main juristic schools\".\n*the \"dark age\" of Islamic jurisprudence stretched from the fall of Baghdad in the mid-seventh AH (1258 CE) to 1293 AH/1876 CE.\n*In 1293 AH (1876 CE) the Ottomans codified Hanafi jurisprudence in the Majallah el-Ahkam-i-Adliya. Several \"juristic revival movements\" influenced by \"exposure to Western legal and technological progress\"  followed until the mid-20th century CE. Muhammad Abduh and Abd El-Razzak El-Sanhuri were products of this era.\n*The most recent era has been that of the \"Islamic revival\", which has been \"predicated on rejection of Western social and legal advances\" and the development of specifically Islamic states, social sciences, economics, and finance.\nThe formative period of Islamic jurisprudence stretches back to the time of the early Muslim communities. In this period, jurists were more concerned with issues of authority and teaching than with theory and methodology.Weiss, Bernard G. (2002) Studies in Islamic Legal Theory, edited by Bernard G. Weiss, (Leiden: E. J. Brill, 2002. pp.3, 161.)\n\nProgress in theory and methodology happened with the coming of the early Muslim jurist Muhammad ibn Idris ash-Shafi`i (767–820), who codified the basic principles of Islamic jurisprudence in his book ar-Risālah. The book details the four roots of law (Qur'an, Sunnah, ijma, and qiyas) while specifying that the primary Islamic texts (the Qur'an and the hadith) be understood according to objective rules of interpretation derived from scientific study of the Arabic language.Weiss, Bernard G. (2002), Studies in Islamic Legal Theory, edited by Bernard G. Weiss, (Leiden: E. J. Brill, 2002. p.162.\n\nSecondary sources of law were developed and refined over the subsequent centuries, consisting primarily of juristic preference (istihsan), laws of the previous prophets (shara man qablana), continuity (istishab), extended analogy (maslaha mursala), blocking the means (sadd al-dhari'ah), custome urf and saying of a companion (qawl al-sahabi).Nyazee, Imran Ahsan Khan (2000). Islamic Jurisprudence (UsulAI-Fiqh). Islamabad: Islamic Research Institute Press.\n\nDiagram of early scholars \n\nThe Quran set the rights, the responsibilities and the rules for people and for societies to adhere to, like not dealing in interest. Muhammad then provided an example, which is recorded in the hadith books, showing people how he practically implemented these rules in a society. After the passing of Muhammad, there was a need for jurists, to decide on new legal matters where there is no such ruling in the Quran or the Hadith, example of Islamic prophet Muhammad regarding a similar case.\n\nIn the years proceeding Muhammad, the community in Madina continued to use the same rules. People were familiar with the practice of Muhammad and therefore continued to use the same rules.\n\nThe scholars appearing in the diagram below were taught by Muhammad's companions, many of whom settled in Madina. Muwatta by Malik ibn Anas was written as a consensus of the opinion, of these scholars. The Muwatta by Malik ibn Anas quotes 13 hadiths from Imam Jafar al-Sadiq.Al-Muwatta of Imam Malik Ibn Anas, translated by Aisha Bewley (Book #5, Hadith #5.9.23)(Book #16, Hadith #16.1.1)(Book #17, Hadith #17.24.43)(Book #20, Hadith #20.10.40)(Book #20, Hadith #20.11.44)(Book #20, Hadith #20.32.108)(Book #20, Hadith #20.39.127)(Book #20, Hadith #20.40.132)(Book #20, Hadith #20.49.167) (Book #20, Hadith #20.57.190)(Book #26, Hadith #26.1.2)(Book #29, Hadith #29.5.17)(Book #36, Hadith #36.4.5) [http://bewley.virtualave.net/muwcont.html Al-Muwatta']\n\nMuch of the knowledge we have about Muhammad is narrated through Aisha the wife of Muhammad, also a renowned scholar of her time. Aisha raised and taught her nephew Qasim ibn Muhammad ibn Abu Bakr after her brother Muhammad ibn Abu Bakr was killed by the Syrians.\n\nQasim ibn Muhammad ibn Abu Bakrs mother was from Alis family and Qasims daughter Farwah bint al-Qasim was married to Muhammad al-Baqir and was the mother of Jafar al-Sadiq. Therefore, Qasim ibn Muhammad ibn Abu Bakr was the grand son of Abu Bakr the first caliph and the grand father of Jafar al-Sadiq whose views the twelver Shias follow. The twelver Shia do not accept Abu Bakr as the first caliph but do accept his great-great-grandson Jafar al-Sadiq.\n\nAishas also taught her nephew Urwah ibn Zubayr. He then taught his son Hisham ibn Urwah, who was the main teacher of Malik ibn Anas whose views many Sunni follow and also taught Jafar al-Sadiq. Qasim ibn Muhammad ibn Abu Bakr, Hisham ibn Urwah and Muhammad al-Baqir taught Zayd ibn Ali, Jafar al-Sadiq, Abu Hanifa, and Malik ibn Anas.\n\nImam Jafar al-Sadiq, Imam Abu Hanifa and Malik ibn Anas worked together in Al-Masjid an-Nabawi in Medina. Along with Qasim ibn Muhammad ibn Abu Bakr, Muhammad al-Baqir, Zayd ibn Ali and over 70 other leading jurists and scholars.\n\nAl-Shafi‘i was taught by Malik ibn Anas. Ahmad ibn Hanbal was taught by Al-Shafi‘i. Muhammad al-Bukhari travelled every where collecting hadith and his father Ismail ibn Ibrahim was a student of Malik ibn Anas\n\nIn the books actually written by these original jurists and scholars, there are very few theological and judicial differences between them. Imam Ahmad rejected the writing down and codifying of the religious rulings he gave. They knew that they might have fallen into error in some of their judgements and stated this clearly. They never introduced their rulings by saying, \"Here, this judgement is the judgement of God and His prophet.\" There is also very little text actually written down by Jafar al-Sadiq himself. They all give priority to the Qur'an and the Hadith (the practice of Muhammad). They felt that the Quran and the Hadith, the example of Muhammad provided people with almost everything they needed. \"This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion\" Quran 5:3. [http://irebd.com/quran/english/surah-5/verse-3/ Quran Surah Al-Maaida ( Verse 3 )]\n\nThese scholars did not distinguish between each other. They were not Sunni or Shia. They felt that they were following the religion of Abraham as described in the Quran \"Say: Allah speaks the truth; so follow the religion of Abraham, the upright one. And he was not one of the polytheists\" (Qur'an 3:95).\n\nMost of the differences are regarding Sharia laws devised through Ijtihad where there is no such ruling in the Quran or the Hadiths of Islamic prophet Muhammad regarding a similar case. As these jurists went to new areas, they were pragmatic and continued to use the same ruling as was given in that area during pre-Islamic times, if the population felt comfortable with it, it was just and they used Ijtihad to deduce that it did not conflict with the Quran or the Hadith. As explained in the Muwatta by Malik ibn Anas. This made it easier for the different communities to integrate into the Islamic State and assisted in the quick expansion of the Islamic State.\n\nTo reduce the divergence, ash-Shafi'i proposed giving priority to the Qur'an and the Hadith (the practice of Muhammad) and only then look at the consensus of the Muslim jurists (ijma) and analogical reasoning (qiyas). This then resulted in jurists like Muhammad al-Bukhari dedicating their lives to the collection of the correct Hadith, in books like Sahih al-Bukhari. Sahih translates as authentic or correct. They also felt that Muhammad's judgement was more impartial and better than their own.\n\nThese original jurists and scholars also acted as a counterbalance to the rulers. When they saw injustice, all these scholars spoke out against it. As the state expanded outside Madina, the rights of the different communities, as they were constituted in the Constitution of Medina still applied. The Quran also gave additional rights to the citizens of the state and these rights were also applied. Ali, Hassan and Hussein ibn Ali gave their allegiance to the first three caliphs because they abided by these conditions. Later Ali the fourth caliph wrote in a letter \"I did not approach the people to get their oath of allegiance but they came to me with their desire to make me their Amir (ruler). I did not extend my hands towards them so that they might swear the oath of allegiance to me but they themselves extended their hands towards me\".Nahj ul Balagha Letter 54 But later as fate would have it (Predestination in Islam) when Yazid I, an oppressive ruler took power, Hussein ibn Ali the grand son of Muhammad felt that it was a test from God for him and his duty to confront him. Then Abd Allah ibn al-Zubayr, Qasim ibn Muhammad ibn Abu Bakrs cousin confronted the Umayyad rulers after Hussein ibn Ali was betrayed by the people of Kufa and killed by Syrian Roman Army now under the control of the Yazid I the Umayyad ruler.Najeebabadi, Akbar Shah (2001). The History of Islam V.2. Riyadh: Darussalam. pp. 110. . Abd Allah ibn al-Zubayr then took on the Umayyad's and expelled their forces from Hijaz and Iraq. But then his forces were depleted in Iraq, trying to stop the Khawarij. The Ummayad's then moved in. After a lengthy campaign, on his last hour Abd Allah ibn al-Zubayr asked his mother Asma' bint Abu Bakr the daughter of Abu Bakr the first caliph for advice. Asma' bint Abu Bakr replied to her son, she said: \"You know better in your own self, that if you are upon the truth and you are calling towards the truth go forth, for people more honourable than you have been killed and if you are not upon the truth, then what an evil son you are and you have destroyed yourself and those who are with you. If you say, that if you are upon the truth and you will be killed at the hands of others, then you will not truly be free\". Abd Allah ibn al-Zubayr left and was later also killed and crucified by the Syrian Roman Army now under the control of the Umayyads and led by Hajjaj. Muhammad ibn Abi Bakr the son of Abu Bakr the first caliph and raised by Ali the fourth caliph was also killed by the Ummayads.Nahj al-Balagha Sermon 71, Letter 27, Letter 34, Letter 35 Aisha then raised and taught his son Qasim ibn Muhammad ibn Abu Bakr who later taught his grandson Jafar al-Sadiq.\n\nDuring the early Ummayad period, there was more community involvement. The Quran and Muhammad's example was the main source of law after which the community decided. If it worked for the community, was just and did not conflict with the Quran and the example of Muhammad, it was accepted. This made it easier for the different communities, with Roman, Persian, Central Asia and North African backgrounds to integrate into the Islamic State and that assisted in the quick expansion of the Islamic State. The scholars in Madina were consulted on the more complex judicial issues. The Sharia and the official more centralized schools of fiqh developed later, during the time of the Abbasids.Muawiya Restorer of the Muslim Faith By Aisha Bewley Page 68\n\nComponents\n\nThe sources of fiqh in order of importance are\n#the Qur'an\n#Hadith\n#Ijma, i.e. collective reasoning and consensus amongst authoritative Muslims of a particular generation, and its interpretation by Islamic scholars.\n#Qiyas, i.e. analogy which is deployed if Ijma or historic collective reasoning on the issue is not available.\nThe Qur'an gives clear instructions on many issues, such as how to perform the ritual purification (') before the obligatory daily prayers ('), but on other issues, some Muslims believe the Qur'an alone is not enough to make things clear. For example, the Qur'an states one needs to engage in daily prayers (') and fast (') during the month of Ramadan but Muslims believe they need further instructions on how to perform these duties. Details about these issues can be found in the traditions of Muhammad, so Qur'an and Sunnah are in most cases the basis for (').\n\nSome topics are without precedent in Islam's early period. In those cases, Muslim jurists (') try to arrive at conclusions by other means. Sunni jurists use historical consensus of the community ('); a majority in the modern era also use analogy (') and weigh the harms and benefits of new topics ('), and a plurality utilizes juristic preference ('). The conclusions arrived at with the aid of these additional tools constitute a wider array of laws than the Sharia consists of, and is called fiqh. Thus, in contrast to the sharia, fiqh is not regarded as sacred and the schools of thought have differing views on its details, without viewing other conclusions as sacrilegious. This division of interpretation in more detailed issues has resulted in different schools of thought (').\n\nThis wider concept of Islamic jurisprudence is the source of a range of laws in different topics that guide Muslims in everyday life.\n\nComponent categories \n\nIslamic jurisprudence (fiqh) covers two main areas:\n# Rules in relation to actions, and,\n# Rules in relation to circumstances surrounding actions.\n\nThese types of rules can also fall into two groups:\n# Worship (Ibadaat)\n# Dealings & Transactions (with people) (Mu`amalaat)\n\nRules in relation to actions (amaliyya — عملية) or \"decision types\" comprise:\n# Obligation (fardh)\n# Recommendation (mustahabb)\n# Permissibility (mubah)\n# Disrecommendation (makrooh)\n# Prohibition (haraam)\n\nRules in relation to circumstances (wadia) comprise:\n# Condition (shart)\n# Cause (sabab)\n# Preventor (mani)\n# Permit / Enforced (rukhsah, azeemah)\n# Valid / Corrupt / Invalid (sahih, fasid, batil)\n# In time / Deferred / Repeat (adaa, qadaa, i'ada)\n\nMethodologies of jurisprudence \n\nThe modus operandi of the Muslim jurist is known as usul al-fiqh (\"principles of jurisprudence\").\n\nThere are different approaches to the methodology used in jurisprudence to derive Islamic law from the primary sources. The main methodologies are those of the Sunni, Shi'a and Ibadi denominations. While both Sunni and Shi'ite are divided into smaller sub-schools, the differences among the Shi'ite schools is considerably greater. Ibadites only follow a single school without divisions.\n\n;Fatawa\nWhile using court decisions as legal precedents and case law are central to Western law, the importance of the institution of fatawa (non-binding answers by Islamic legal scholars to legal questions) has been called \"central to the development\" of Islamic jurisprudence.El-Gamal, Islamic Finance, 2006: p.32  This is in part because of a \"vacuum\" in the other source of Islamic law, qada` (legal rulings by state appointed Islamic judges) after the fall of the last caliphate the Ottoman Empire. While the practice in Islam dates back to the time of Muhammad, according to at least one source (Muhammad El-Gamal), it is \"modeled after the Roman system of responsa,\" and gives the questioner \"decisive primary-mover advantage in choosing he question and its wording.\"\n\n;Arguments for and against reform\nEach school (madhhab) reflects a unique al-urf or culture (a cultural practice that was influenced by traditions), that the classical jurists themselves lived in, when rulings were made. Some suggest that the discipline of isnad, which developed to validate hadith made it relatively easy to record and validate also the rulings of jurists. This, in turn, made them far easier to imitate (taqlid) than to challenge in new contexts. The argument is, the schools have been more or less frozen for centuries, and reflect a culture that simply no longer exists. Traditional scholars hold that religion is there to regulate human behavior and nurture people's moral side and since human nature has not fundamentally changed since the beginning of Islam a call to modernize the religion is essentially one to relax all laws and institutions.\n\nEarly shariah had a much more flexible character, and some modern Muslim scholars believe that it should be renewed, and that the classical jurists should lose special status.  This would require formulating a new fiqh suitable for the modern world, e.g. as proposed by advocates of the Islamization of knowledge, which would deal with the modern context. This modernization is opposed by most conservative ulema. Traditional scholars hold that the laws are contextual and consider circumstance such as time, place and culture, the principles they are based upon are universal such as justice, equality and respect. Many Muslim scholars argue that even though technology may have advanced, the fundamentals of human life have not.\n\nFields of jurisprudence \n\n*Criminal\n*Economics\n*Etiquette\n*Hygienical\n*Inheritance\n*Marital\n*Military\n*Political\n*Theological\n\nSchools of jurisprudence \n\nThere are several schools of fiqh thought ( '; pl.  ')\n\nThe schools of Sunni Islam are each named by students of the classical jurist who taught them.  The Sunni schools (and where they are commonly found) are\n*Hanafi (Turkey, the Balkans, Central Asia, Indian subcontinent, China and Egypt)\n*Maliki (North Africa, West Africa and several of the Arab states of the Persian Gulf)\n*Shafi'i (Kurdistan, Indonesia, Malaysia, Egypt, East Africa, Yemen, and southern parts of India)\n*Hanbali (Saudi Arabia) see Wahhabism\n*Zahiri (minority communities in Morocco and Pakistan)\n*Qurtubi No longer exists\n*Laythi No longer exists but there are a few texts left of it.\n\nThe schools of Shia Islam comprise:\n*Ja'fari (Twelver Shia: Iran, Iraq, Lebanon, etc.)\n*Zaydi (Yemen)\n\nEntirely separate from both the Sunni and Shia traditions, Khawarij Islam has evolved its own distinct school.\n*Ibadi (Oman)\n\nThese schools share many of their rulings, but differ on the particular hadiths they accept as authentic and the weight they give to analogy or reason (qiyas) in deciding difficulties.\n\nPossible links with Western law \n\nA number of important legal institutions were developed by Muslim jurists during the classical period of Islam, known as the Islamic Golden Age. One such institution was the Hawala, an early informal value transfer system, which is mentioned in texts of Islamic jurisprudence as early as the 8th century. Hawala itself later influenced the development of the agency in common law and in civil laws such as the aval in French law and the avallo in Italian law. The \"European commenda\" (Islamic Qirad) used in European civil law may have also originated from Islamic law.\n\nThe Waqf in Islamic law, which developed during the 7th–9th centuries, bears a notable resemblance to the trusts in the English trust law. For example, every Waqf was required to have a waqif (settlor), mutawillis (trustee), qadi (judge) and beneficiaries. The trust law developed in England at the time of the Crusades, during the 12th and 13th centuries, was introduced by Crusaders who may have been influenced by the Waqf institutions they came across in the Middle East.\n\nThe Islamic lafif was a body of twelve members drawn from the neighbourhood and sworn to tell the truth, who were bound to give a unanimous verdict, about matters \"which they had personally seen or heard, binding on the judge, to settle the truth concerning facts in a case, between ordinary people, and obtained as of right by the plaintiff.\" The only characteristic of the English jury which the Islamic lafif lacked was the \"judicial writ directing the jury to be summoned and directing the bailiff to hear its recognition.\" According to Professor John Makdisi, \"no other institution in any legal institution studied to date shares all of these characteristics with the English jury.\" It is thus likely that the concept of the lafif may have been introduced to England by the Normans, who conquered both England and the Emirate of Sicily, and then evolved into the modern English jury.\n\nSeveral other fundamental common law institutions may have been adapted from similar legal institutions in Islamic law and jurisprudence, and introduced to England by the Normans after the Norman conquest of England and the Emirate of Sicily, and by Crusaders during the Crusades. In particular, the \"royal English contract protected by the action of debt is identified with the Islamic Aqd, the English assize of novel disseisin is identified with the Islamic Istihqaq, and the English jury is identified with the Islamic lafif.\" Other English legal institutions such as \"the scholastic method, the licence to teach\", the \"law schools known as Inns of Court in England and Madrasas in Islam\" and the \"European commenda\" (Islamic Qirad) may have also originated from Islamic law. The methodology of legal precedent and reasoning by analogy (Qiyas) are also similar in both the Islamic and common law systems. These influences have led some scholars to suggest that Islamic law may have laid the foundations for \"the common law as an integrated whole\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fiqh" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11114" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Fiqh (; ) is Islamic jurisprudence.[http://www.britannica.com/EBchecked/topic/207723/fiqh Fiqh] Encyclopædia Britannica  While sharia is believed by Muslims to represent divine law as revealed in the Quran and the Sunnah (the teachings and practices of the Islamic prophet Muhammad), fiqh is the human understanding of the sharia—sharia expanded and developed by interpretation (ijtihad) of the Quran and Sunnah by Islamic jurists (ulama) and implemented by the rulings (fatwa) of jurists on questions presented to them. Thus conceptually, whereas sharia is considered immutable and infallible, fiqh is considered fallible and changeable. Fiqh deals with the observance of rituals, morals and social legislation in Islam. In the modern era, there are four prominent schools (madh'hab) of fiqh within Sunni practice, plus two (or three) within Shi'a practice. A person trained in fiqh is known as a faqīh (plural fuqaha).Glasse, Cyril, The New Encyclopedia of Islam, Altamira, 2001, p.141\n\nFiguratively, fiqh means knowledge about Islamic legal rulings from their sources. Thus the figurative definition of fiqh is taken from its literal one in the sense that deriving religious rulings from their sources necessitates the mujtahid (an individual who exercises ijtihad) to have a deep understanding in the different discussions of jurisprudence. A faqīh must look deep down into a matter and not suffice himself with just the apparent meaning, and a person who only knows the appearance of a matter is not qualified as a faqīh.\n\nOn the studies of fiqh, it is traditionally divided into Uṣūl al-fiqh (principles of Islamic jurisprudence, lit. the roots of fiqh), the methods of legal interpretation and analysis, and Furūʿ al-fiqh (lit. the branches of fiqh), the elaboration of rulings on the basis of these principles. Furūʿ al-fiqh is the product of the application of Uṣūl al-fiqh and the total product of human efforts at understanding the divine will. A hukm (plural aḥkām) is a particular ruling in a given case.\n\nEtymology \n\nThe word fiqh is an Arabic term meaning \"deep understanding\" or \"full comprehension\". Technically it refers to the body of Islamic law extracted from detailed Islamic sources (which are studied in the principles of Islamic jurisprudence) and the process of gaining knowledge of Islam through jurisprudence. The historian Ibn Khaldun describes fiqh as \"knowledge of the rules of God which concern the actions of persons who own themselves connected to obey the law respecting what is required (wajib), sinful (haraam), recommended (mandūb), disapproved (makrūh) or neutral (mubah)\".Levy (1957). Page 150. This definition is consistent amongst the jurists.\n\nIn Modern Standard Arabic, fiqh has come to mean jurisprudence in general, be it Islamic or secular. It is thus possible to speak of Chief Justice John Roberts as an expert in the common law fiqh of the United States, or of Egyptian legal scholar Abd El-Razzak El-Sanhuri as an expert in the civil law fiqh of Egypt.\n\nHistory\n\nThe history of Islamic jurisprudence is \"customarily divided into eight periods\".El-Gamal, Islamic Finance, 2006: p.30-1\n*the first period ending with the death of Muhammad in 11 AH.\n*second period \"characterized by personal interpretations\" of the canon by the Sahabah or companions of Muhammad, lasting until 50 A.H.\n*from 50 AH until the early second century AH there was competition between a \"a traditionalist approach to jurisprudence\" in western Arabia where Islam was revealed and a \"rationalist approach in Iraq\".\n*the \"golden age of classical Islamic jurisprudence\" from the \"early second to the mid-fourth century when the eight \"most significant\" schools of Sunni and Shi'i jurisprudence emerged.\"\n*from the mid-fourth century to mid-seventh AH Islamic jurisprudence was \"limited to elaborations within the main juristic schools\".\n*the \"dark age\" of Islamic jurisprudence stretched from the fall of Baghdad in the mid-seventh AH (1258 CE) to 1293 AH/1876 CE.\n*In 1293 AH (1876 CE) the Ottomans codified Hanafi jurisprudence in the Majallah el-Ahkam-i-Adliya. Several \"juristic revival movements\" influenced by \"exposure to Western legal and technological progress\"  followed until the mid-20th century CE. Muhammad Abduh and Abd El-Razzak El-Sanhuri were products of this era.\n*The most recent era has been that of the \"Islamic revival\", which has been \"predicated on rejection of Western social and legal advances\" and the development of specifically Islamic states, social sciences, economics, and finance.\nThe formative period of Islamic jurisprudence stretches back to the time of the early Muslim communities. In this period, jurists were more concerned with issues of authority and teaching than with theory and methodology.Weiss, Bernard G. (2002) Studies in Islamic Legal Theory, edited by Bernard G. Weiss, (Leiden: E. J. Brill, 2002. pp.3, 161.)\n\nProgress in theory and methodology happened with the coming of the early Muslim jurist Muhammad ibn Idris ash-Shafi`i (767–820), who codified the basic principles of Islamic jurisprudence in his book ar-Risālah. The book details the four roots of law (Qur'an, Sunnah, ijma, and qiyas) while specifying that the primary Islamic texts (the Qur'an and the hadith) be understood according to objective rules of interpretation derived from scientific study of the Arabic language.Weiss, Bernard G. (2002), Studies in Islamic Legal Theory, edited by Bernard G. Weiss, (Leiden: E. J. Brill, 2002. p.162.\n\nSecondary sources of law were developed and refined over the subsequent centuries, consisting primarily of juristic preference (istihsan), laws of the previous prophets (shara man qablana), continuity (istishab), extended analogy (maslaha mursala), blocking the means (sadd al-dhari'ah), custome urf and saying of a companion (qawl al-sahabi).Nyazee, Imran Ahsan Khan (2000). Islamic Jurisprudence (UsulAI-Fiqh). Islamabad: Islamic Research Institute Press.\n\nDiagram of early scholars \n\nThe Quran set the rights, the responsibilities and the rules for people and for societies to adhere to, like not dealing in interest. Muhammad then provided an example, which is recorded in the hadith books, showing people how he practically implemented these rules in a society. After the passing of Muhammad, there was a need for jurists, to decide on new legal matters where there is no such ruling in the Quran or the Hadith, example of Islamic prophet Muhammad regarding a similar case.\n\nIn the years proceeding Muhammad, the community in Madina continued to use the same rules. People were familiar with the practice of Muhammad and therefore continued to use the same rules.\n\nThe scholars appearing in the diagram below were taught by Muhammad's companions, many of whom settled in Madina. Muwatta by Malik ibn Anas was written as a consensus of the opinion, of these scholars. The Muwatta by Malik ibn Anas quotes 13 hadiths from Imam Jafar al-Sadiq.Al-Muwatta of Imam Malik Ibn Anas, translated by Aisha Bewley (Book #5, Hadith #5.9.23)(Book #16, Hadith #16.1.1)(Book #17, Hadith #17.24.43)(Book #20, Hadith #20.10.40)(Book #20, Hadith #20.11.44)(Book #20, Hadith #20.32.108)(Book #20, Hadith #20.39.127)(Book #20, Hadith #20.40.132)(Book #20, Hadith #20.49.167) (Book #20, Hadith #20.57.190)(Book #26, Hadith #26.1.2)(Book #29, Hadith #29.5.17)(Book #36, Hadith #36.4.5) [http://bewley.virtualave.net/muwcont.html Al-Muwatta']\n\nMuch of the knowledge we have about Muhammad is narrated through Aisha the wife of Muhammad, also a renowned scholar of her time. Aisha raised and taught her nephew Qasim ibn Muhammad ibn Abu Bakr after her brother Muhammad ibn Abu Bakr was killed by the Syrians.\n\nQasim ibn Muhammad ibn Abu Bakrs mother was from Alis family and Qasims daughter Farwah bint al-Qasim was married to Muhammad al-Baqir and was the mother of Jafar al-Sadiq. Therefore, Qasim ibn Muhammad ibn Abu Bakr was the grand son of Abu Bakr the first caliph and the grand father of Jafar al-Sadiq whose views the twelver Shias follow. The twelver Shia do not accept Abu Bakr as the first caliph but do accept his great-great-grandson Jafar al-Sadiq.\n\nAishas also taught her nephew Urwah ibn Zubayr. He then taught his son Hisham ibn Urwah, who was the main teacher of Malik ibn Anas whose views many Sunni follow and also taught Jafar al-Sadiq. Qasim ibn Muhammad ibn Abu Bakr, Hisham ibn Urwah and Muhammad al-Baqir taught Zayd ibn Ali, Jafar al-Sadiq, Abu Hanifa, and Malik ibn Anas.\n\nImam Jafar al-Sadiq, Imam Abu Hanifa and Malik ibn Anas worked together in Al-Masjid an-Nabawi in Medina. Along with Qasim ibn Muhammad ibn Abu Bakr, Muhammad al-Baqir, Zayd ibn Ali and over 70 other leading jurists and scholars.\n\nAl-Shafi‘i was taught by Malik ibn Anas. Ahmad ibn Hanbal was taught by Al-Shafi‘i. Muhammad al-Bukhari travelled every where collecting hadith and his father Ismail ibn Ibrahim was a student of Malik ibn Anas\n\nIn the books actually written by these original jurists and scholars, there are very few theological and judicial differences between them. Imam Ahmad rejected the writing down and codifying of the religious rulings he gave. They knew that they might have fallen into error in some of their judgements and stated this clearly. They never introduced their rulings by saying, \"Here, this judgement is the judgement of God and His prophet.\" There is also very little text actually written down by Jafar al-Sadiq himself. They all give priority to the Qur'an and the Hadith (the practice of Muhammad). They felt that the Quran and the Hadith, the example of Muhammad provided people with almost everything they needed. \"This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion\" Quran 5:3. [http://irebd.com/quran/english/surah-5/verse-3/ Quran Surah Al-Maaida ( Verse 3 )]\n\nThese scholars did not distinguish between each other. They were not Sunni or Shia. They felt that they were following the religion of Abraham as described in the Quran \"Say: Allah speaks the truth; so follow the religion of Abraham, the upright one. And he was not one of the polytheists\" (Qur'an 3:95).\n\nMost of the differences are regarding Sharia laws devised through Ijtihad where there is no such ruling in the Quran or the Hadiths of Islamic prophet Muhammad regarding a similar case. As these jurists went to new areas, they were pragmatic and continued to use the same ruling as was given in that area during pre-Islamic times, if the population felt comfortable with it, it was just and they used Ijtihad to deduce that it did not conflict with the Quran or the Hadith. As explained in the Muwatta by Malik ibn Anas. This made it easier for the different communities to integrate into the Islamic State and assisted in the quick expansion of the Islamic State.\n\nTo reduce the divergence, ash-Shafi'i proposed giving priority to the Qur'an and the Hadith (the practice of Muhammad) and only then look at the consensus of the Muslim jurists (ijma) and analogical reasoning (qiyas). This then resulted in jurists like Muhammad al-Bukhari dedicating their lives to the collection of the correct Hadith, in books like Sahih al-Bukhari. Sahih translates as authentic or correct. They also felt that Muhammad's judgement was more impartial and better than their own.\n\nThese original jurists and scholars also acted as a counterbalance to the rulers. When they saw injustice, all these scholars spoke out against it. As the state expanded outside Madina, the rights of the different communities, as they were constituted in the Constitution of Medina still applied. The Quran also gave additional rights to the citizens of the state and these rights were also applied. Ali, Hassan and Hussein ibn Ali gave their allegiance to the first three caliphs because they abided by these conditions. Later Ali the fourth caliph wrote in a letter \"I did not approach the people to get their oath of allegiance but they came to me with their desire to make me their Amir (ruler). I did not extend my hands towards them so that they might swear the oath of allegiance to me but they themselves extended their hands towards me\".Nahj ul Balagha Letter 54 But later as fate would have it (Predestination in Islam) when Yazid I, an oppressive ruler took power, Hussein ibn Ali the grand son of Muhammad felt that it was a test from God for him and his duty to confront him. Then Abd Allah ibn al-Zubayr, Qasim ibn Muhammad ibn Abu Bakrs cousin confronted the Umayyad rulers after Hussein ibn Ali was betrayed by the people of Kufa and killed by Syrian Roman Army now under the control of the Yazid I the Umayyad ruler.Najeebabadi, Akbar Shah (2001). The History of Islam V.2. Riyadh: Darussalam. pp. 110. . Abd Allah ibn al-Zubayr then took on the Umayyad's and expelled their forces from Hijaz and Iraq. But then his forces were depleted in Iraq, trying to stop the Khawarij. The Ummayad's then moved in. After a lengthy campaign, on his last hour Abd Allah ibn al-Zubayr asked his mother Asma' bint Abu Bakr the daughter of Abu Bakr the first caliph for advice. Asma' bint Abu Bakr replied to her son, she said: \"You know better in your own self, that if you are upon the truth and you are calling towards the truth go forth, for people more honourable than you have been killed and if you are not upon the truth, then what an evil son you are and you have destroyed yourself and those who are with you. If you say, that if you are upon the truth and you will be killed at the hands of others, then you will not truly be free\". Abd Allah ibn al-Zubayr left and was later also killed and crucified by the Syrian Roman Army now under the control of the Umayyads and led by Hajjaj. Muhammad ibn Abi Bakr the son of Abu Bakr the first caliph and raised by Ali the fourth caliph was also killed by the Ummayads.Nahj al-Balagha Sermon 71, Letter 27, Letter 34, Letter 35 Aisha then raised and taught his son Qasim ibn Muhammad ibn Abu Bakr who later taught his grandson Jafar al-Sadiq.\n\nDuring the early Ummayad period, there was more community involvement. The Quran and Muhammad's example was the main source of law after which the community decided. If it worked for the community, was just and did not conflict with the Quran and the example of Muhammad, it was accepted. This made it easier for the different communities, with Roman, Persian, Central Asia and North African backgrounds to integrate into the Islamic State and that assisted in the quick expansion of the Islamic State. The scholars in Madina were consulted on the more complex judicial issues. The Sharia and the official more centralized schools of fiqh developed later, during the time of the Abbasids.Muawiya Restorer of the Muslim Faith By Aisha Bewley Page 68\n\nComponents\n\nThe sources of fiqh in order of importance are\n#the Qur'an\n#Hadith\n#Ijma, i.e. collective reasoning and consensus amongst authoritative Muslims of a particular generation, and its interpretation by Islamic scholars.\n#Qiyas, i.e. analogy which is deployed if Ijma or historic collective reasoning on the issue is not available.\nThe Qur'an gives clear instructions on many issues, such as how to perform the ritual purification (') before the obligatory daily prayers ('), but on other issues, some Muslims believe the Qur'an alone is not enough to make things clear. For example, the Qur'an states one needs to engage in daily prayers (') and fast (') during the month of Ramadan but Muslims believe they need further instructions on how to perform these duties. Details about these issues can be found in the traditions of Muhammad, so Qur'an and Sunnah are in most cases the basis for (').\n\nSome topics are without precedent in Islam's early period. In those cases, Muslim jurists (') try to arrive at conclusions by other means. Sunni jurists use historical consensus of the community ('); a majority in the modern era also use analogy (') and weigh the harms and benefits of new topics ('), and a plurality utilizes juristic preference ('). The conclusions arrived at with the aid of these additional tools constitute a wider array of laws than the Sharia consists of, and is called fiqh. Thus, in contrast to the sharia, fiqh is not regarded as sacred and the schools of thought have differing views on its details, without viewing other conclusions as sacrilegious. This division of interpretation in more detailed issues has resulted in different schools of thought (').\n\nThis wider concept of Islamic jurisprudence is the source of a range of laws in different topics that guide Muslims in everyday life.\n\nComponent categories \n\nIslamic jurisprudence (fiqh) covers two main areas:\n# Rules in relation to actions, and,\n# Rules in relation to circumstances surrounding actions.\n\nThese types of rules can also fall into two groups:\n# Worship (Ibadaat)\n# Dealings & Transactions (with people) (Mu`amalaat)\n\nRules in relation to actions (amaliyya — عملية) or \"decision types\" comprise:\n# Obligation (fardh)\n# Recommendation (mustahabb)\n# Permissibility (mubah)\n# Disrecommendation (makrooh)\n# Prohibition (haraam)\n\nRules in relation to circumstances (wadia) comprise:\n# Condition (shart)\n# Cause (sabab)\n# Preventor (mani)\n# Permit / Enforced (rukhsah, azeemah)\n# Valid / Corrupt / Invalid (sahih, fasid, batil)\n# In time / Deferred / Repeat (adaa, qadaa, i'ada)\n\nMethodologies of jurisprudence \n\nThe modus operandi of the Muslim jurist is known as usul al-fiqh (\"principles of jurisprudence\").\n\nThere are different approaches to the methodology used in jurisprudence to derive Islamic law from the primary sources. The main methodologies are those of the Sunni, Shi'a and Ibadi denominations. While both Sunni and Shi'ite are divided into smaller sub-schools, the differences among the Shi'ite schools is considerably greater. Ibadites only follow a single school without divisions.\n\n;Fatawa\nWhile using court decisions as legal precedents and case law are central to Western law, the importance of the institution of fatawa (non-binding answers by Islamic legal scholars to legal questions) has been called \"central to the development\" of Islamic jurisprudence.El-Gamal, Islamic Finance, 2006: p.32  This is in part because of a \"vacuum\" in the other source of Islamic law, qada` (legal rulings by state appointed Islamic judges) after the fall of the last caliphate the Ottoman Empire. While the practice in Islam dates back to the time of Muhammad, according to at least one source (Muhammad El-Gamal), it is \"modeled after the Roman system of responsa,\" and gives the questioner \"decisive primary-mover advantage in choosing he question and its wording.\"\n\n;Arguments for and against reform\nEach school (madhhab) reflects a unique al-urf or culture (a cultural practice that was influenced by traditions), that the classical jurists themselves lived in, when rulings were made. Some suggest that the discipline of isnad, which developed to validate hadith made it relatively easy to record and validate also the rulings of jurists. This, in turn, made them far easier to imitate (taqlid) than to challenge in new contexts. The argument is, the schools have been more or less frozen for centuries, and reflect a culture that simply no longer exists. Traditional scholars hold that religion is there to regulate human behavior and nurture people's moral side and since human nature has not fundamentally changed since the beginning of Islam a call to modernize the religion is essentially one to relax all laws and institutions.\n\nEarly shariah had a much more flexible character, and some modern Muslim scholars believe that it should be renewed, and that the classical jurists should lose special status.  This would require formulating a new fiqh suitable for the modern world, e.g. as proposed by advocates of the Islamization of knowledge, which would deal with the modern context. This modernization is opposed by most conservative ulema. Traditional scholars hold that the laws are contextual and consider circumstance such as time, place and culture, the principles they are based upon are universal such as justice, equality and respect. Many Muslim scholars argue that even though technology may have advanced, the fundamentals of human life have not.\n\nFields of jurisprudence \n\n*Criminal\n*Economics\n*Etiquette\n*Hygienical\n*Inheritance\n*Marital\n*Military\n*Political\n*Theological\n\nSchools of jurisprudence \n\nThere are several schools of fiqh thought ( '; pl.  ')\n\nThe schools of Sunni Islam are each named by students of the classical jurist who taught them.  The Sunni schools (and where they are commonly found) are\n*Hanafi (Turkey, the Balkans, Central Asia, Indian subcontinent, China and Egypt)\n*Maliki (North Africa, West Africa and several of the Arab states of the Persian Gulf)\n*Shafi'i (Kurdistan, Indonesia, Malaysia, Egypt, East Africa, Yemen, and southern parts of India)\n*Hanbali (Saudi Arabia) see Wahhabism\n*Zahiri (minority communities in Morocco and Pakistan)\n*Qurtubi No longer exists\n*Laythi No longer exists but there are a few texts left of it.\n\nThe schools of Shia Islam comprise:\n*Ja'fari (Twelver Shia: Iran, Iraq, Lebanon, etc.)\n*Zaydi (Yemen)\n\nEntirely separate from both the Sunni and Shia traditions, Khawarij Islam has evolved its own distinct school.\n*Ibadi (Oman)\n\nThese schools share many of their rulings, but differ on the particular hadiths they accept as authentic and the weight they give to analogy or reason (qiyas) in deciding difficulties.\n\nPossible links with Western law \n\nA number of important legal institutions were developed by Muslim jurists during the classical period of Islam, known as the Islamic Golden Age. One such institution was the Hawala, an early informal value transfer system, which is mentioned in texts of Islamic jurisprudence as early as the 8th century. Hawala itself later influenced the development of the agency in common law and in civil laws such as the aval in French law and the avallo in Italian law. The \"European commenda\" (Islamic Qirad) used in European civil law may have also originated from Islamic law.\n\nThe Waqf in Islamic law, which developed during the 7th–9th centuries, bears a notable resemblance to the trusts in the English trust law. For example, every Waqf was required to have a waqif (settlor), mutawillis (trustee), qadi (judge) and beneficiaries. The trust law developed in England at the time of the Crusades, during the 12th and 13th centuries, was introduced by Crusaders who may have been influenced by the Waqf institutions they came across in the Middle East.\n\nThe Islamic lafif was a body of twelve members drawn from the neighbourhood and sworn to tell the truth, who were bound to give a unanimous verdict, about matters \"which they had personally seen or heard, binding on the judge, to settle the truth concerning facts in a case, between ordinary people, and obtained as of right by the plaintiff.\" The only characteristic of the English jury which the Islamic lafif lacked was the \"judicial writ directing the jury to be summoned and directing the bailiff to hear its recognition.\" According to Professor John Makdisi, \"no other institution in any legal institution studied to date shares all of these characteristics with the English jury.\" It is thus likely that the concept of the lafif may have been introduced to England by the Normans, who conquered both England and the Emirate of Sicily, and then evolved into the modern English jury.\n\nSeveral other fundamental common law institutions may have been adapted from similar legal institutions in Islamic law and jurisprudence, and introduced to England by the Normans after the Norman conquest of England and the Emirate of Sicily, and by Crusaders during the Crusades. In particular, the \"royal English contract protected by the action of debt is identified with the Islamic Aqd, the English assize of novel disseisin is identified with the Islamic Istihqaq, and the English jury is identified with the Islamic lafif.\" Other English legal institutions such as \"the scholastic method, the licence to teach\", the \"law schools known as Inns of Court in England and Madrasas in Islam\" and the \"European commenda\" (Islamic Qirad) may have also originated from Islamic law. The methodology of legal precedent and reasoning by analogy (Qiyas) are also similar in both the Islamic and common law systems. These influences have led some scholars to suggest that Islamic law may have laid the foundations for \"the common law as an integrated whole\". Fiqh. http://en.wikipedia.org/?curid=11114."
  }
}
