{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14598",
  "eid" : "15cf65d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778545837,
  "textBody" : "India is the second most populated country in the world with nearly a fifth of the world's population. According to , the population stood at .\n\nDuring 1975–2019 the population doubled to 1.2 billion. The Indian population reached the billion mark in 1998. India is projected to be the world's most populous country by 2024, surpassing the population of China. It is expected to become the first political entity in history to be home to more than 1.5 billion people by 2030, and its population is set to reach 1.7 billion by 2050. Its population growth rate is 1.2%, ranking 94th in the world in 2013.\n\nIndia has more than 50% of its population below the age of 25 and more than 65% below the age of 35. It is expected that, in 2020, the average age of an Indian will be 29 years, compared to 37 for China and 48 for Japan; and, by 2030, India's dependency ratio should be just over 0.4.\n\nIndia has more than two thousand ethnic groups, and every major religion is represented, as are four major families of languages (Indo-European, Dravidian, Austroasiatic and Sino-Tibetan languages) as well as two language isolates (the Nihali language spoken in parts of Maharashtra and the Burushaski language spoken in parts of Jammu and Kashmir (Kashmir).\n\nFurther complexity is lent by the great variation that occurs across this population on social parameters such as income and education. Only the continent of Africa exceeds the linguistic, genetic and cultural diversity of the nation of India.[http://lcweb2.loc.gov/frd/cs/profiles/India.pdf India, a Country Study] United States Library of Congress, Note on Ethnic groups\n\nThe sex ratio is 944 females for 1000 males (2016) (940 per 1000 in 2011)  This ratio has been showing an upwards trend for the last two decades after a continuous decline in the last century.\n\nHistory\n\nPrehistory to early 19th century\n\nThe following table lists estimates for the population of India (including what are now Pakistan and Bangladesh) from prehistory up until 1820. It includes estimates and growth rates according to five different economic historians, along with interpolated estimates and overall aggregate averages derived from their estimates.\n\nThe population grew from the South Asian Stone Age in 10,000 BC to the Maurya Empire in 200 BC at a steadily increasing growth rate, before population growth slowed down in the classical era up to 500 AD, and then became largely stagnant during the early medieval era era up to 1000 AD. The population growth rate then increased in the late medieval era (during the Delhi Sultanate) from 1000 to 1500.\n\nIndia's population growth rate under the Mughal Empire (16th–18th centuries) was higher than during any previous period in Indian history.Angus Maddison (2001), The World Economy: A Millennial Perspective, [http://theunbrokenwindow.com/Development/MADDISON%20The%20World%20Economy--A%20Millennial.pdf#page\n243 page 242], OECD Development Centre Under the Mughal Empire, India experienced an unprecedented economic and demographic upsurge, due to Mughal agrarian reforms that intensified agricultural production,John F. Richards (1995), [https://books.google.com/books?id\nHHyVh29gy4QC&pgPA190 The Mughal Empire, page 190], Cambridge University Press proto-industrialization that established India as the most important center of manufacturing in international trade, and a relatively high degree of urbanization for its time;Abraham Eraly (2007), [https://books.google.com/books?idZpa8gyGW_twC&pg\nPA5 The Mughal World: Life in India's Last Golden Age, page 5], Penguin Books 15% of the population lived in urban centres, higher than the percentage of the population in 19th-century British India and contemporary Europe up until the 19th century.\n\nUnder the reign of Akbar the Great (reigned 1556–1605) in 1600, the Mughal Empire's urban population was up to 17 million people, larger than the urban population in Europe. By 1700, Mughal India had an urban population of 23 million people, larger than British India's urban population of 22.3 million in 1871. Nizamuddin Ahmad (1551–1621) reported that, under Akbar's reign, Mughal India had 120 large cities and 3,200 townships. A number of cities in India had a population between a quarter-million and half-million people, with larger cities including Agra (in Agra Subah) with up to 800,000 people and Dhaka (in Bengal Subah) with over 1 million people.[https://books.google.com/books?id\npKIlAQAAMAAJ Social Science Review, Volume 14, Issue 1], page 126, Dhaka University Mughal India also had a large number of villages, with 455,698 villages by the time of Aurangzeb (reigned 1658–1707).\n\nLate 19th century to early 20th century\n\nThe population of India under the British Raj (including what are now Pakistan and Bangladesh) according to censuses:\n\nStudies of India's population since 1881 have focused on such topics as total population, birth and death rates, growth rates, geographic distribution, literacy, the rural and urban divide, cities of a million, and the three cities with populations over eight million: Delhi, Greater Mumbai (Bombay), and Kolkata (Calcutta).\n\nMortality rates fell in the period 1920–45, primarily due to biological immunisation. Other factors included rising incomes, better living conditions, improved nutrition, a safer and cleaner environment, and better official health policies and medical care.\n\nSalient features\n\nIndia occupies 2.41% of the world's land area but supports over 18% of the world's population. At the 2001 census 72.2% of the population[http://www.censusindia.gov.in/Census_Data_2001/India_at_glance/rural.aspx Rural-Urban distribution] Census of India: Census Data 2001: India at a glance >> Rural-Urban Distribution. Office of the Registrar General and Census Commissioner, India. Retrieved on 2008-11-26. lived in about 638,000 villages[http://www.censusindia.gov.in/Census_Data_2001/Census_data_finder/A_Series/Number_of_Village.htm Number of Villages] Census of India: Number of Villages Office of the Registrar General and Census Commissioner, India. Retrieved on 2008-11-26. and the remaining 27.8% lived in more than 5,100 towns and over 380 urban agglomerations.[http://www.censusindia.gov.in/Census_Data_2001/Census_data_finder/A_Series/Urban_agglomerations.htm Urban Agglomerations and Towns] Census of India: Urban Agglomerations and Towns. Office of the Registrar General and Census Commissioner, India. Retrieved on 2008-11-26.\n\nIndia's population exceeded that of the entire continent of Africa by 200 million people in 2010. However, because Africa's population growth is nearly double that of India, it is expected to surpass both China and India by 2025.\n\nComparative demographics\n\nList of states and union territories by demographics\n\nReligious demographics\n\nThe table below summarises India's demographics (excluding the Mao-Maram, Paomata and Purul subdivisions of Senapati District of Manipur state due to cancellation of census results) according to religion at the 2011 census in per cent. The data is \"unadjusted\" (without excluding Assam and Jammu and Kashmir); the 1981 census was not conducted in Assam and the 1991 census was not conducted in Jammu and Kashmir.\n\n;Characteristics of religious groups\n\nNeonatal and infant demographics\n\nThe table below represents the infant mortality rate trends in India, based on sex, over the last 15 years. In the urban areas of India, average male infant mortality rates are slightly higher than average female infant mortality rates.\n\nSome activists believe India's 2011 census shows a serious decline in the number of girls under the age of seven – activists posit that eight million female fetuses may have been aborted between 2001 and 2011.  These claims are controversial. Scientists who study human sex ratios and demographic trends suggest that birth sex ratio between 1.08 and 1.12 can be because of natural factors, such as the age of mother at baby's birth, age of father at baby's birth, number of babies per couple, economic stress, endocrinological factors, etc. The 2011 census birth sex ratio in India, of 917 girls to 1000 boys, is similar to 870–930 girls to 1000 boys birth sex ratios observed in Japanese, Chinese, Cuban, Filipino and Hawaiian ethnic groups in the United States between 1940 and 2005. They are also similar to birth sex ratios below 900 girls to 1000 boys observed in mothers of different age groups and gestation periods in the United States.\n\nPopulation within the age group of 0–6\n\nPopulation above the age of 7\n\nLiteracy rate\n\nLinguistic demographics\n\n41.03% of the Indians speak Hindi while the rest speak Assamese, Bengali, Gujarati, Maithili, Kannada, Malayalam, Marathi, Odia, Punjabi, Tamil, Telugu, Urdu and a variety of other languages. There are a total of 122 languages and 234 mother tongues. The 22 languages are Languages specified in the Eighth Schedule of Indian Constitution and 100 non-specified languages.\n\nThe table immediately below excludes Mao-Maram, Paomata and Purul subdivisions of Senapati District of Manipur state due to cancellation of census results.\n\nLargest cities\n\nVital statistics\n\nUN estimates\n\nCensus of India: sample registration system\n\nStructure of the population  \n\nStructure of the population (09.02.2011) (Census) (Includes data for the Indian-held part of Jammu and Kashmir, the final status of which has not yet been determined):\n\nFertility rate\n\nFrom the Demographic Health Survey:\n\nRegional vital statistics\n\nCIA World Factbook demographic statistics\n\nThe following demographic statistics are from the CIA World Factbook, unless otherwise indicated.\n\n;Total population:\n1,166,079,217 (July 2009 est. CIA); 1,210 million (2011 census)[http://censusindia.gov.in/2011-prov-results/data_files/india/Final_PPT_2011_chapter3.pdf Census India, 2011, chapter 3]\n\n;Rural population:\n72.2%; male: 381,668,992, female: 360,948,755 (2001 census)\n\n;Age structure:\n0–14 years: 30.8%; male: 188,208,196, female: 171,356,024\n15–64 years: 64.3%; male: 386,432,921, female: 364,215,759\n65+ years: 4.9%; male: 27,258,259, female: 30,031,289 (2007 est.)\n\n;Median age:\n25.1 years\n\n;Population growth rate:\n1.548% (2009 est.)\n\n;Literacy rate:\n74% (age 7 and above, in 2011)\n81.4% (total population, age 15–25, in 2006)\n\n;Per cent of population below poverty line:\n22% (2006 est.)\n\n;Unemployment rate:\n7.8%\n\n;Net migration rate:\n−0.05 migrant(s)/1,000 population (2007 est.)\n\n;Sex ratio:\nAt birth:\n1.12 male(s)/female\nUnder 10 years:\n1.14 male(s)/female\n15–24 years:\n1.09 male(s)/female\n24–64 years:\n1.06 male(s)/female\n65 years and over:\n0.908 male(s)/female\nTotal population:\n1.08 male(s)/female (2011 est.)\n\n;Life expectancy at birth:\nTotal population:\n68.3 years (source: UN Human Development Report, 2015)\n\n;Total fertility rate:\n2.45 (2016 est.)\n\nThe TFR (total number of children born per women) by religion in 2005-2006 was: Hindus, 2.7; Muslims, 3.1; Christians, 2.4; and Sikhs, 2.0.\n\n;Religions:\nHindu 80.5%, Muslim 13.4%, Christian 2.3%, Sikh 1.8%, Buddhists 0.8%, Jains 0.4%, others 0.7%, unspecified 0.1% (2001 census)[http://www.censusindia.gov.in/Census_Data_2001/India_at_glance/religion.aspx Religious Composition] Census of India: Census Data 2001: India at a glance >> Religious Composition. Office of the Registrar General and Census Commissioner, India. Retrieved on 2008-11-26.[https://www.state.gov/g/drl/rls/irf/2007/90228.htm International Religious Freedom Report 2007 — India] International Religious Freedom Report 2007. U.S. Department of State.\n\n;Scheduled castes and tribes:\nScheduled castes: 16.6% (2011 census);[http://www.censusindia.gov.in/2011census/hlo/pca/pca_pdf/PCA-CRC-0000.pdf 2011 Census Primary Census Abstract]\nscheduled tribes: 8.6% (2011 census)\n\n;Languages:\nSee Languages of India and List of Indian languages by total speakers. There are 216 languages with more than 10,000 native speakers in India. The largest of these is Hindi with some 337 million, and the second largest is Bengali with 238 million. 22 languages are recognised as official languages. In India, there are 1,652 languages and dialects in total.Rupert Goodwins.[http://news.zdnet.co.uk/software/0,1000000121,39268336,00.htm Smashing India's language barriers]. ZDNet UK\n\nPopulation projections\n\nIndia is projected to overtake China as the world's most populous nation by 2030. India's population growth has raised concerns that it would lead to widespread unemployment and political instability. Note that these projections make assumptions about future fertility and death rates which may not turn out to be correct in the event. Fertility rates also vary from region to region, with some higher than the national average and some lower.\n\nSource:\n* 2020: 1,326,093,000\n* 2030: 1,460,743,000\n* 2040: 1,571,715,000\n* 2050: 1,656,554,000\n\n2020 estimate\n\nIn millions (example: 361 = 361,000,000)\n\nSource:Based on P.N. Mari Bhat, \"Indian Demographic Scenario 2025\", Institute of Economic Growth, New Delhi, Discussion Paper No. 27/2001.\n\nEthnic groups\n\nThe national Census of India does not recognise racial or ethnic groups within India,Kumar, Jayant. Census of India. 2001. 4 September 2006. [http://www.censusindia.gov.in/ Indian Census] but recognises many of the tribal groups as Scheduled Castes and Tribes (see list of Scheduled Tribes in India).\n\nAccording to a 2009 study published by Reich et al., the modern Indian population is composed of two genetically divergent and heterogeneous populations which mixed in ancient times (about 1,200–3,500 BC), known as Ancestral North Indians (ANI) and Ancestral South Indians (ASI). ASI corresponds to the Dravidian-speaking population of southern India, whereas ANI corresponds to the Indo-Aryan-speaking population of northern India.\n\nFor a list of ethnic groups in the Republic of India (as well as neighbouring countries) see ethnic groups of the Indian subcontinent.\n\nGenetics\n\nY-chromosome DNA\n\nY-Chromosome DNA Y-DNA represents the male lineage, The Indian Y-chromosome pool may be summarised as follows where haplogroups R-M420, H, R2, L and NOP comprise generally more than 80% of the total chromosomes.\nHammer et al. 2005, S. Sahoo et al. 2006, R. Trivedi et al. 2007, Zhao et al. 2008\n* H ~ 30%\n* R1a ~ 34%\n* R2 ~ 15%\n* L ~ 10%\n* NOP ~ 10% (Excluding R)\n* Other Haplogroups 15%\n\nMitochondrial DNA\n\nMitochondrial DNA mtDNA represents the female lineage. The Indian mitochondrial DNA is primarily made up of Haplogroup MSemino et al. 2000, Kivisild et al. 2003, Metspalu et al. 2004, Rajkumar et al. 2005, Chandrasekar et al. 2007, Gonzalez et al. 2007\n* Haplogroup M ~ 60%\n* Haplogroup UK ~ 15%\n* Haplogroup N ~ 25% (Excluding UK)\n\nAutosomal DNA\n\nNumerous genomic studies have been conducted in the last 15 years to seek insights into India's demographic and cultural diversity. These studies paint a complex and conflicting picture.\n* In a 2003 study, Basu, Majumder et al. have concluded on the basis of results obtained from mtDNA, Y-chromosome and autosomal markers that \"(1) there is an underlying unity of female lineages in India, indicating that the initial number of female settlers may have been small; (2) the tribal and the caste populations are highly differentiated; (3) the Austroasiatic tribals are the earliest settlers in India, providing support to one anthropological hypothesis while refuting some others; (4) a major wave of humans entered India through the northeast; (5) the Tibeto-Burman tribals share considerable genetic commonalities with the Austroasiatic tribals, supporting the hypothesis that they may have shared a common habitat in southern China, but the two groups of tribals can be differentiated on the basis of Y-chromosomal haplotypes; (6) the Dravidian speaking populations were possibly widespread throughout India but are regulated to South India now ; (7) formation of populations by fission that resulted in founder and drift effects have left their imprints on the genetic structures of contemporary populations; (8) the upper castes show closer genetic affinities with Central Asian populations, although those of southern India are more distant than those of northern India; (9) historical gene flow into India has contributed to a considerable obliteration of genetic histories of contemporary populations so that there is at present no clear congruence of genetic and geographical or sociocultural affinities.\"\n* In a later 2010 review article, Majumder affirms some of these conclusions, introduces and revises some other. The ongoing studies, concludes Majumder, suggest India has served as the major early corridor for geographical dispersal of modern humans from out-of-Africa. The archaeological and genetic traces of the earliest settlers in India has not provided any conclusive evidence. The tribal populations of India are older than the non-tribal populations. The autosomal differentiation and genetic diversity within India's caste populations at 0.04 is significantly lower than 0.14 for continental populations and 0.09 for 31 world population sets studied by Watkins et al., suggesting that while tribal populations were differentiated, the differentiation effects within India's caste population was less than previously thought. Majumder also concludes that recent studies suggest India has been a major contributor to the gene pool of southeast Asia.\n* Another study covering a large sample of Indian populations allowed Watkins et al. to examine eight Indian caste groups and four endogamous south Indian tribal populations. The Indian castes data show low between-group differences, while the tribal Indian groups show relatively high between-group differentiation. This suggests that people between Indian castes were not reproductively isolated, while Indian tribal populations experienced reproductive isolation and drift. Furthermore, the genetic fixation index data shows historical genetic differentiation and segregation between Indian castes population is much smaller than those found in east Asia, Africa and other continental populations; while being similar to the genetic differentiation and segregation observed in European populations.\n* In 2006, Sahoo et al. reported their analysis of genomic data on 936 Y-chromosomes representing 32 tribal and 45 caste groups from different regions of India. These scientists find that the haplogroup frequency distribution across the country, between different caste groups, was found to be predominantly driven by geographical, rather than cultural determinants. They conclude there is clear evidence for both large-scale immigration into ancient India of Sino-Tibetan speakers and language change of former Austroasiatic speakers, in the northeast Indian region.\n* The genome studies conducted up until 2010 have been on relatively small population sets. Many are from just one southeastern state of Andhra Pradesh (including Telangana, which was part of the state until June 2014). Thus, any conclusions on demographic history of India must be interpreted with caution. A larger national genome study with demographic growth and sex ratio balances may offer further insights on the extent of genetic differentiation and segregation in India over the millenniums.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Demographics of India" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14598" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "India is the second most populated country in the world with nearly a fifth of the world's population. According to , the population stood at .\n\nDuring 1975–2019 the population doubled to 1.2 billion. The Indian population reached the billion mark in 1998. India is projected to be the world's most populous country by 2024, surpassing the population of China. It is expected to become the first political entity in history to be home to more than 1.5 billion people by 2030, and its population is set to reach 1.7 billion by 2050. Its population growth rate is 1.2%, ranking 94th in the world in 2013.\n\nIndia has more than 50% of its population below the age of 25 and more than 65% below the age of 35. It is expected that, in 2020, the average age of an Indian will be 29 years, compared to 37 for China and 48 for Japan; and, by 2030, India's dependency ratio should be just over 0.4.\n\nIndia has more than two thousand ethnic groups, and every major religion is represented, as are four major families of languages (Indo-European, Dravidian, Austroasiatic and Sino-Tibetan languages) as well as two language isolates (the Nihali language spoken in parts of Maharashtra and the Burushaski language spoken in parts of Jammu and Kashmir (Kashmir).\n\nFurther complexity is lent by the great variation that occurs across this population on social parameters such as income and education. Only the continent of Africa exceeds the linguistic, genetic and cultural diversity of the nation of India.[http://lcweb2.loc.gov/frd/cs/profiles/India.pdf India, a Country Study] United States Library of Congress, Note on Ethnic groups\n\nThe sex ratio is 944 females for 1000 males (2016) (940 per 1000 in 2011)  This ratio has been showing an upwards trend for the last two decades after a continuous decline in the last century.\n\nHistory\n\nPrehistory to early 19th century\n\nThe following table lists estimates for the population of India (including what are now Pakistan and Bangladesh) from prehistory up until 1820. It includes estimates and growth rates according to five different economic historians, along with interpolated estimates and overall aggregate averages derived from their estimates.\n\nThe population grew from the South Asian Stone Age in 10,000 BC to the Maurya Empire in 200 BC at a steadily increasing growth rate, before population growth slowed down in the classical era up to 500 AD, and then became largely stagnant during the early medieval era era up to 1000 AD. The population growth rate then increased in the late medieval era (during the Delhi Sultanate) from 1000 to 1500.\n\nIndia's population growth rate under the Mughal Empire (16th–18th centuries) was higher than during any previous period in Indian history.Angus Maddison (2001), The World Economy: A Millennial Perspective, [http://theunbrokenwindow.com/Development/MADDISON%20The%20World%20Economy--A%20Millennial.pdf#page\n243 page 242], OECD Development Centre Under the Mughal Empire, India experienced an unprecedented economic and demographic upsurge, due to Mughal agrarian reforms that intensified agricultural production,John F. Richards (1995), [https://books.google.com/books?id\nHHyVh29gy4QC&pgPA190 The Mughal Empire, page 190], Cambridge University Press proto-industrialization that established India as the most important center of manufacturing in international trade, and a relatively high degree of urbanization for its time;Abraham Eraly (2007), [https://books.google.com/books?idZpa8gyGW_twC&pg\nPA5 The Mughal World: Life in India's Last Golden Age, page 5], Penguin Books 15% of the population lived in urban centres, higher than the percentage of the population in 19th-century British India and contemporary Europe up until the 19th century.\n\nUnder the reign of Akbar the Great (reigned 1556–1605) in 1600, the Mughal Empire's urban population was up to 17 million people, larger than the urban population in Europe. By 1700, Mughal India had an urban population of 23 million people, larger than British India's urban population of 22.3 million in 1871. Nizamuddin Ahmad (1551–1621) reported that, under Akbar's reign, Mughal India had 120 large cities and 3,200 townships. A number of cities in India had a population between a quarter-million and half-million people, with larger cities including Agra (in Agra Subah) with up to 800,000 people and Dhaka (in Bengal Subah) with over 1 million people.[https://books.google.com/books?id\npKIlAQAAMAAJ Social Science Review, Volume 14, Issue 1], page 126, Dhaka University Mughal India also had a large number of villages, with 455,698 villages by the time of Aurangzeb (reigned 1658–1707).\n\nLate 19th century to early 20th century\n\nThe population of India under the British Raj (including what are now Pakistan and Bangladesh) according to censuses:\n\nStudies of India's population since 1881 have focused on such topics as total population, birth and death rates, growth rates, geographic distribution, literacy, the rural and urban divide, cities of a million, and the three cities with populations over eight million: Delhi, Greater Mumbai (Bombay), and Kolkata (Calcutta).\n\nMortality rates fell in the period 1920–45, primarily due to biological immunisation. Other factors included rising incomes, better living conditions, improved nutrition, a safer and cleaner environment, and better official health policies and medical care.\n\nSalient features\n\nIndia occupies 2.41% of the world's land area but supports over 18% of the world's population. At the 2001 census 72.2% of the population[http://www.censusindia.gov.in/Census_Data_2001/India_at_glance/rural.aspx Rural-Urban distribution] Census of India: Census Data 2001: India at a glance >> Rural-Urban Distribution. Office of the Registrar General and Census Commissioner, India. Retrieved on 2008-11-26. lived in about 638,000 villages[http://www.censusindia.gov.in/Census_Data_2001/Census_data_finder/A_Series/Number_of_Village.htm Number of Villages] Census of India: Number of Villages Office of the Registrar General and Census Commissioner, India. Retrieved on 2008-11-26. and the remaining 27.8% lived in more than 5,100 towns and over 380 urban agglomerations.[http://www.censusindia.gov.in/Census_Data_2001/Census_data_finder/A_Series/Urban_agglomerations.htm Urban Agglomerations and Towns] Census of India: Urban Agglomerations and Towns. Office of the Registrar General and Census Commissioner, India. Retrieved on 2008-11-26.\n\nIndia's population exceeded that of the entire continent of Africa by 200 million people in 2010. However, because Africa's population growth is nearly double that of India, it is expected to surpass both China and India by 2025.\n\nComparative demographics\n\nList of states and union territories by demographics\n\nReligious demographics\n\nThe table below summarises India's demographics (excluding the Mao-Maram, Paomata and Purul subdivisions of Senapati District of Manipur state due to cancellation of census results) according to religion at the 2011 census in per cent. The data is \"unadjusted\" (without excluding Assam and Jammu and Kashmir); the 1981 census was not conducted in Assam and the 1991 census was not conducted in Jammu and Kashmir.\n\n;Characteristics of religious groups\n\nNeonatal and infant demographics\n\nThe table below represents the infant mortality rate trends in India, based on sex, over the last 15 years. In the urban areas of India, average male infant mortality rates are slightly higher than average female infant mortality rates.\n\nSome activists believe India's 2011 census shows a serious decline in the number of girls under the age of seven – activists posit that eight million female fetuses may have been aborted between 2001 and 2011.  These claims are controversial. Scientists who study human sex ratios and demographic trends suggest that birth sex ratio between 1.08 and 1.12 can be because of natural factors, such as the age of mother at baby's birth, age of father at baby's birth, number of babies per couple, economic stress, endocrinological factors, etc. The 2011 census birth sex ratio in India, of 917 girls to 1000 boys, is similar to 870–930 girls to 1000 boys birth sex ratios observed in Japanese, Chinese, Cuban, Filipino and Hawaiian ethnic groups in the United States between 1940 and 2005. They are also similar to birth sex ratios below 900 girls to 1000 boys observed in mothers of different age groups and gestation periods in the United States.\n\nPopulation within the age group of 0–6\n\nPopulation above the age of 7\n\nLiteracy rate\n\nLinguistic demographics\n\n41.03% of the Indians speak Hindi while the rest speak Assamese, Bengali, Gujarati, Maithili, Kannada, Malayalam, Marathi, Odia, Punjabi, Tamil, Telugu, Urdu and a variety of other languages. There are a total of 122 languages and 234 mother tongues. The 22 languages are Languages specified in the Eighth Schedule of Indian Constitution and 100 non-specified languages.\n\nThe table immediately below excludes Mao-Maram, Paomata and Purul subdivisions of Senapati District of Manipur state due to cancellation of census results.\n\nLargest cities\n\nVital statistics\n\nUN estimates\n\nCensus of India: sample registration system\n\nStructure of the population  \n\nStructure of the population (09.02.2011) (Census) (Includes data for the Indian-held part of Jammu and Kashmir, the final status of which has not yet been determined):\n\nFertility rate\n\nFrom the Demographic Health Survey:\n\nRegional vital statistics\n\nCIA World Factbook demographic statistics\n\nThe following demographic statistics are from the CIA World Factbook, unless otherwise indicated.\n\n;Total population:\n1,166,079,217 (July 2009 est. CIA); 1,210 million (2011 census)[http://censusindia.gov.in/2011-prov-results/data_files/india/Final_PPT_2011_chapter3.pdf Census India, 2011, chapter 3]\n\n;Rural population:\n72.2%; male: 381,668,992, female: 360,948,755 (2001 census)\n\n;Age structure:\n0–14 years: 30.8%; male: 188,208,196, female: 171,356,024\n15–64 years: 64.3%; male: 386,432,921, female: 364,215,759\n65+ years: 4.9%; male: 27,258,259, female: 30,031,289 (2007 est.)\n\n;Median age:\n25.1 years\n\n;Population growth rate:\n1.548% (2009 est.)\n\n;Literacy rate:\n74% (age 7 and above, in 2011)\n81.4% (total population, age 15–25, in 2006)\n\n;Per cent of population below poverty line:\n22% (2006 est.)\n\n;Unemployment rate:\n7.8%\n\n;Net migration rate:\n−0.05 migrant(s)/1,000 population (2007 est.)\n\n;Sex ratio:\nAt birth:\n1.12 male(s)/female\nUnder 10 years:\n1.14 male(s)/female\n15–24 years:\n1.09 male(s)/female\n24–64 years:\n1.06 male(s)/female\n65 years and over:\n0.908 male(s)/female\nTotal population:\n1.08 male(s)/female (2011 est.)\n\n;Life expectancy at birth:\nTotal population:\n68.3 years (source: UN Human Development Report, 2015)\n\n;Total fertility rate:\n2.45 (2016 est.)\n\nThe TFR (total number of children born per women) by religion in 2005-2006 was: Hindus, 2.7; Muslims, 3.1; Christians, 2.4; and Sikhs, 2.0.\n\n;Religions:\nHindu 80.5%, Muslim 13.4%, Christian 2.3%, Sikh 1.8%, Buddhists 0.8%, Jains 0.4%, others 0.7%, unspecified 0.1% (2001 census)[http://www.censusindia.gov.in/Census_Data_2001/India_at_glance/religion.aspx Religious Composition] Census of India: Census Data 2001: India at a glance >> Religious Composition. Office of the Registrar General and Census Commissioner, India. Retrieved on 2008-11-26.[https://www.state.gov/g/drl/rls/irf/2007/90228.htm International Religious Freedom Report 2007 — India] International Religious Freedom Report 2007. U.S. Department of State.\n\n;Scheduled castes and tribes:\nScheduled castes: 16.6% (2011 census);[http://www.censusindia.gov.in/2011census/hlo/pca/pca_pdf/PCA-CRC-0000.pdf 2011 Census Primary Census Abstract]\nscheduled tribes: 8.6% (2011 census)\n\n;Languages:\nSee Languages of India and List of Indian languages by total speakers. There are 216 languages with more than 10,000 native speakers in India. The largest of these is Hindi with some 337 million, and the second largest is Bengali with 238 million. 22 languages are recognised as official languages. In India, there are 1,652 languages and dialects in total.Rupert Goodwins.[http://news.zdnet.co.uk/software/0,1000000121,39268336,00.htm Smashing India's language barriers]. ZDNet UK\n\nPopulation projections\n\nIndia is projected to overtake China as the world's most populous nation by 2030. India's population growth has raised concerns that it would lead to widespread unemployment and political instability. Note that these projections make assumptions about future fertility and death rates which may not turn out to be correct in the event. Fertility rates also vary from region to region, with some higher than the national average and some lower.\n\nSource:\n* 2020: 1,326,093,000\n* 2030: 1,460,743,000\n* 2040: 1,571,715,000\n* 2050: 1,656,554,000\n\n2020 estimate\n\nIn millions (example: 361 = 361,000,000)\n\nSource:Based on P.N. Mari Bhat, \"Indian Demographic Scenario 2025\", Institute of Economic Growth, New Delhi, Discussion Paper No. 27/2001.\n\nEthnic groups\n\nThe national Census of India does not recognise racial or ethnic groups within India,Kumar, Jayant. Census of India. 2001. 4 September 2006. [http://www.censusindia.gov.in/ Indian Census] but recognises many of the tribal groups as Scheduled Castes and Tribes (see list of Scheduled Tribes in India).\n\nAccording to a 2009 study published by Reich et al., the modern Indian population is composed of two genetically divergent and heterogeneous populations which mixed in ancient times (about 1,200–3,500 BC), known as Ancestral North Indians (ANI) and Ancestral South Indians (ASI). ASI corresponds to the Dravidian-speaking population of southern India, whereas ANI corresponds to the Indo-Aryan-speaking population of northern India.\n\nFor a list of ethnic groups in the Republic of India (as well as neighbouring countries) see ethnic groups of the Indian subcontinent.\n\nGenetics\n\nY-chromosome DNA\n\nY-Chromosome DNA Y-DNA represents the male lineage, The Indian Y-chromosome pool may be summarised as follows where haplogroups R-M420, H, R2, L and NOP comprise generally more than 80% of the total chromosomes.\nHammer et al. 2005, S. Sahoo et al. 2006, R. Trivedi et al. 2007, Zhao et al. 2008\n* H ~ 30%\n* R1a ~ 34%\n* R2 ~ 15%\n* L ~ 10%\n* NOP ~ 10% (Excluding R)\n* Other Haplogroups 15%\n\nMitochondrial DNA\n\nMitochondrial DNA mtDNA represents the female lineage. The Indian mitochondrial DNA is primarily made up of Haplogroup MSemino et al. 2000, Kivisild et al. 2003, Metspalu et al. 2004, Rajkumar et al. 2005, Chandrasekar et al. 2007, Gonzalez et al. 2007\n* Haplogroup M ~ 60%\n* Haplogroup UK ~ 15%\n* Haplogroup N ~ 25% (Excluding UK)\n\nAutosomal DNA\n\nNumerous genomic studies have been conducted in the last 15 years to seek insights into India's demographic and cultural diversity. These studies paint a complex and conflicting picture.\n* In a 2003 study, Basu, Majumder et al. have concluded on the basis of results obtained from mtDNA, Y-chromosome and autosomal markers that \"(1) there is an underlying unity of female lineages in India, indicating that the initial number of female settlers may have been small; (2) the tribal and the caste populations are highly differentiated; (3) the Austroasiatic tribals are the earliest settlers in India, providing support to one anthropological hypothesis while refuting some others; (4) a major wave of humans entered India through the northeast; (5) the Tibeto-Burman tribals share considerable genetic commonalities with the Austroasiatic tribals, supporting the hypothesis that they may have shared a common habitat in southern China, but the two groups of tribals can be differentiated on the basis of Y-chromosomal haplotypes; (6) the Dravidian speaking populations were possibly widespread throughout India but are regulated to South India now ; (7) formation of populations by fission that resulted in founder and drift effects have left their imprints on the genetic structures of contemporary populations; (8) the upper castes show closer genetic affinities with Central Asian populations, although those of southern India are more distant than those of northern India; (9) historical gene flow into India has contributed to a considerable obliteration of genetic histories of contemporary populations so that there is at present no clear congruence of genetic and geographical or sociocultural affinities.\"\n* In a later 2010 review article, Majumder affirms some of these conclusions, introduces and revises some other. The ongoing studies, concludes Majumder, suggest India has served as the major early corridor for geographical dispersal of modern humans from out-of-Africa. The archaeological and genetic traces of the earliest settlers in India has not provided any conclusive evidence. The tribal populations of India are older than the non-tribal populations. The autosomal differentiation and genetic diversity within India's caste populations at 0.04 is significantly lower than 0.14 for continental populations and 0.09 for 31 world population sets studied by Watkins et al., suggesting that while tribal populations were differentiated, the differentiation effects within India's caste population was less than previously thought. Majumder also concludes that recent studies suggest India has been a major contributor to the gene pool of southeast Asia.\n* Another study covering a large sample of Indian populations allowed Watkins et al. to examine eight Indian caste groups and four endogamous south Indian tribal populations. The Indian castes data show low between-group differences, while the tribal Indian groups show relatively high between-group differentiation. This suggests that people between Indian castes were not reproductively isolated, while Indian tribal populations experienced reproductive isolation and drift. Furthermore, the genetic fixation index data shows historical genetic differentiation and segregation between Indian castes population is much smaller than those found in east Asia, Africa and other continental populations; while being similar to the genetic differentiation and segregation observed in European populations.\n* In 2006, Sahoo et al. reported their analysis of genomic data on 936 Y-chromosomes representing 32 tribal and 45 caste groups from different regions of India. These scientists find that the haplogroup frequency distribution across the country, between different caste groups, was found to be predominantly driven by geographical, rather than cultural determinants. They conclude there is clear evidence for both large-scale immigration into ancient India of Sino-Tibetan speakers and language change of former Austroasiatic speakers, in the northeast Indian region.\n* The genome studies conducted up until 2010 have been on relatively small population sets. Many are from just one southeastern state of Andhra Pradesh (including Telangana, which was part of the state until June 2014). Thus, any conclusions on demographic history of India must be interpreted with caution. A larger national genome study with demographic growth and sex ratio balances may offer further insights on the extent of genetic differentiation and segregation in India over the millenniums. Demographics of India. http://en.wikipedia.org/?curid=14598."
  }
}
