{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10408",
  "eid" : "f5a3ec90-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778491865,
  "textBody" : "Edward Lear (12 or 13 May 1812Metropolitan Museum of Art (New York, N.Y.), and Katharine Baetjer. 2009. British paintings in the Metropolitan Museum of Art, 1575-1875. New York: Metropolitan Museum of Art. p. 270. Vivian Noakes says Lear's birth certificate gives 13 May as his birthdate but says \"there is some doubt about the exact date\". Noakes, Vivien. 1986. Edward Lear, 1812-1888. New York: H.N. Abrams. p. 74.  – 29 January 1888) was an English artist, illustrator, musician, author and poet, and is known now mostly for his literary nonsense in poetry and prose and especially his limericks, a form he popularised. His principal areas of work as an artist were threefold: as a draughtsman employed to illustrate birds and animals; making coloured drawings during his journeys, which he reworked later, sometimes as plates for his travel books; as a (minor) illustrator of Alfred Tennyson's poems. As an author, he is known principally for his popular nonsense collections of poems, songs, short stories, botanical drawings, recipes, and alphabets. He also composed and published twelve musical settings of Tennyson's poetry.\n\nBiography\n\nEarly years\n\nLear was born into a middle-class family at Holloway, North London, the penultimate of twenty-one children (and youngest to survive) of Ann Clark Skerrett and Jeremiah Lear, a stockbroker formerly working for the family sugar refining business.Edward Lear, Ina Rae Hark, Twayne Publishers, 1982, pg 2 He was raised by his eldest sister, also named Ann, 21 years his senior. Jeremiah Lear ended up defaulting to the London Stock Exchange in the economic upheaval following the Napoleonic Wars;Pictures at an Exhibition: Selected Essays on Art and Art Therapy, ed. Andrea Gilroy and Tessa Dalley, Routledge, 1989, pg 66 owing to the family's now more limited finances, Lear and his sister were required to leave the family home, Bowmans Lodge, and live together when he was aged four. Ann doted on Edward and continued to act as a mother for him until her death, when he was almost 50 years of age.Jackson, Holbrook (ed). The Complete Nonsense of Edward Lear. Dover Publications, 1951. Page xii.\n\nLear suffered from lifelong health afflictions. From the age of six he suffered frequent grand mal epileptic seizures, and bronchitis, asthma, and during later life, partial blindness. Lear experienced his first seizure at a fair near Highgate with his father. The event scared and embarrassed him. Lear felt lifelong guilt and shame for his epileptic condition. His adult diaries indicate that he always sensed the onset of a seizure in time to remove himself from public view. When Lear was about seven years old he began to show signs of depression, possibly due to the instability of his childhood. He suffered from periods of severe melancholia which he referred to as \"the Morbids.\"\n\nArtist\n\nLear was already drawing \"for bread and cheese\" by the time he was aged 16 and soon developed into a serious \"ornithological draughtsman\" employed by the Zoological Society and then from 1832 to 1836 by the Earl of Derby, who kept a private menagerie at his estate, Knowsley Hall. He was the first major bird artist to draw birds from real live birds, instead of skins. Lear's first publication, published when he was 19 years old, was Illustrations of the Family of Psittacidae, or Parrots in 1830. One of the greatest ornithological artists of his era, he taught Elizabeth Gould whilst also contributing to John Gould's works and was compared favourably with the naturalist John James Audubon. Unfortunately his eyesight deteriorated too much to work with such precision on the fine drawings and etchings of plates used in lithography, thus he turned to landscape painting and travel.Roger F. Pastier & John Farrand, Jr., \"Masterpieces of Bird Art, 700 Years of Ornithological Illustration,\" pp.122-123, Abbeville Press, New York, 1991, \n\nAmong other travels, he visited Greece and Egypt during 1848–49, and toured India during 1873–75, including a brief detour to Ceylon. While travelling he produced large quantities of coloured wash drawings in a distinctive style, which he converted later in his studio into oil and watercolour paintings, as well as prints for his books.Andrew Wilton & Anne Lyles, The Great Age of British Watercolours (1750–1880), p. 318, 1993, Prestel,  His landscape style often shows views with strong sunlight, with intense contrasts of colour.\n\nBetween 1878 and 1883 Lear spent his summers on Monte Generoso, a mountain on the border between the Swiss canton of Ticino and the Italian region of Lombardy. His oil painting The Plains of Lombardy from Monte Generoso is in the Ashmolean Museum in the English city of Oxford.\n\nThroughout his life he continued to paint seriously. He had a lifelong ambition to illustrate Tennyson's poems; near the end of his life a volume with a small number of illustrations was published.\n\nIllustrated Excursions in Italy (1842-46) \n\nIn 1842 Lear began a journey into the Italian peninsula, travelling through the Lazio, Rome, Abruzzo, Molise, Apulia, Calabria, and Sicily. In personal notes, together with drawings, Lear gathered his impressions on the Italian way of life, folk traditions, and the beauty of the ancient monuments. Of particular interest to Lear was the Abruzzo, which he visited in 1843, through the Marsica (Celano, Avezzano, Alba Fucens, Trasacco) and the plateau of Cinque Miglia (Castel di Sangro and Alfedena), by an old sheep track of the shepherds.\n\nLear drew a sketch of the medieval village of Albe with Mount Sirente, and described the medieval village of Celano, with the castle of Piccolomini dominating the vast plain of Lago Fucino, which was drained a few years later to promote agricultural development. At Castel di Sangro, Lear described the winter stillness of the mountains and the beautiful basilica.\n\nComposer and musician\n\nLear played the accordion, flute, and guitar, but primarily the piano. He composed music for many Romantic and Victorian poems, but was known mostly for his many musical settings of Tennyson's poetry. He published four settings in 1853, five in 1859, and three in 1860. Lear's were the only musical settings that Tennyson approved of. Lear also composed music for many of his nonsense songs, including \"The Owl and the Pussy-cat,\" but only two of the scores have survived, the music for \"The Courtship of the Yonghy-Bonghy-Bò\" and \"The Pelican Chorus.\" While he never played professionally, he did perform his own nonsense songs and his settings of others' poetry at countless social gatherings, sometimes adding his own lyrics (as with the song \"The Nervous Family\"), and sometimes replacing serious lyrics with nursery rhymes.Noakes, Vivien. Edward Lear: The Life of a Wanderer, Revised Edition, p. 99-100, 2004, \n\nRelationships\n\nLear's most fervent and painful friendship was with Franklin Lushington. He met the young barrister in Malta in 1849 and then toured southern Greece with him. Lear developed an infatuation for him that Lushington did not wholly reciprocate. Although they remained friends for almost forty years, until Lear's death, the disparity of their feelings constantly tormented Lear. Indeed, Lear's attempts at male companionship were not always successful; the very intensity of Lear's affections may have doomed these relationships.Susan Chitty, That Singular Person Called Lear, Atheneum, 1989\n\nThe closest he came to marriage was two proposals, both to the same woman 46 years his junior, which were not accepted. For companions he relied instead on friends and correspondents, and especially, during later life, on his Albanian Souliote chef, Giorgis, a faithful friend and, as Lear complained, a thoroughly unsatisfactory chef.Levi, Peter.  Edward Lear, a Biography. Another trusted companion in San Remo was his cat, Foss, who died in 1886 and was buried with some ceremony in a garden at Villa Tennyson.\n\nSan Remo and death\n\nLear travelled widely throughout his life and eventually settled in San Remo, on his beloved Mediterranean coast, in the 1870s, at a villa he named \"Villa Tennyson.\"\n\nLear was known to introduce himself with a long pseudonym: \"Mr Abebika kratoponoko Prizzikalo Kattefello Ablegorabalus Ableborinto phashyph\" or \"Chakonoton the Cozovex Dossi Fossi Sini Tomentilla Coronilla Polentilla\nBattledore & Shuttlecock Derry down Derry Dumps\" which he based on Aldiborontiphoskyphorniostikos.\n\nAfter a long decline in his health, Lear died at his villa in 1888 of heart disease, from which he had suffered since at least 1870. Lear's funeral was said to be a sad, lonely affair by the wife of Dr. Hassall, Lear's physician, none of Lear's many lifelong friends being able to attend.Strachie, Lady Constance Braham. Later Letters of Edward Lear: Author of \"The Book of Nonsense.\" 1911: Duffield and Company. P. 332\n\nLear is buried in the Cemetery Foce in San Remo.  On his headstone are inscribed these lines about Mount Tomohrit (in Albania) from Tennyson's poem To E.L. [Edward Lear], On His Travels in Greece:\n\nall things fair.\nWith such a pencil, such a pen.\nYou shadow'd forth to distant men,\nI read and felt that I was there.\n\nThe centenary of his death was marked in Britain with a set of Royal Mail stamps in 1988 and an exhibition at the Royal Academy. Lear's birthplace area is now marked with a plaque at Bowman's Mews, Islington, in London, and his bicentenary during 2012 was celebrated with a variety of events, exhibitions and lectures in venues across the world including an International Owl and Pussycat Day on his birth anniversary.\n\nAuthor\n\nIn 1846 Lear published A Book of Nonsense, a volume of limericks that went through three editions and helped popularize the form and the genre of literary nonsense. In 1871 he published Nonsense Songs, Stories, Botany and Alphabets, which included his most famous nonsense song, The Owl and the Pussycat, which he wrote for the children of his patron Edward Stanley, 13th Earl of Derby. Many other works followed.\n\nLear's nonsense books were quite popular during his lifetime, but a rumor developed that \"Edward Lear\" was merely a pseudonym, and the books' true author was the man to whom Lear had dedicated the works, his patron the Earl of Derby. Promoters of this rumor offered as evidence the facts that both men were named Edward, and that \"Lear\" is an anagram of \"Earl.\"\n\nLear's nonsense works are distinguished by a facility of verbal invention and a poet's delight in the sounds of words, both real and imaginary. A stuffed rhinoceros becomes a \"diaphanous doorscraper.\" A \"blue Boss-Woss\" plunges into \"a perpendicular, spicular, orbicular, quadrangular, circular depth of soft mud.\" His heroes are Quangle-Wangles, Pobbles, and Jumblies. One of his most famous verbal inventions, the phrase \"runcible spoon,\" occurs in the closing lines of The Owl and the Pussycat, and is now found in many English dictionaries:\n\nThey dined on mince, and slices of quince\n:Which they ate with a runcible spoon;\nAnd hand in hand, on the edge of the sand,\n:They danced by the light of the moon,\n::The moon,\n::The moon,\nThey danced by the light of the moon.\n\nThough famous for his neologisms, Lear used a number of other devices in his works in order to defy reader expectations. For example, \"Cold Are the Crabs\" conforms to the sonnet tradition until its dramatically foreshortened last line.\n\nLimericks are invariably typeset as four plus one lines presently, but Lear's limericks were published in a variety of formats. It appears that Lear wrote them in manuscript in as many lines as there was room for beneath the picture. For the first three editions most are typeset as, respectively, two, five, and three lines. The cover of one edition bears an entire limerick typeset in two lines:\n\nThere was an Old Derry down Derry, who loved to see little folks merry;\nSo he made them a book, and with laughter they shook at the fun of that Derry down Derry.\n\nIn Lear's limericks the first and last lines usually end with the same word rather than rhyming. For the most part they are truly nonsensical and devoid of any punch line or point. They are completely free of the bawdyness with which the verse form is now associated. A typical thematic element is the presence of a callous and critical \"they.\" An example of a typical Lear limerick:\n\nThere was an Old Man of Aôsta,\nWho possessed a large Cow, but he lost her;\nBut they said, 'Don't you see,\nshe has rushed up a tree?\nYou invidious Old Man of Aôsta!'\n\nLear's self-description in verse, How Pleasant to know Mr. Lear, ends with this stanza, a reference to his own mortality:\n\nHe reads but he cannot speak Spanish,\n:He cannot abide ginger-beer;\nEre the days of his pilgrimage vanish,\n:How pleasant to know Mr. Lear!\n\nFive of Lear's limericks from the Book of Nonsense, in the 1946 Italian translation by Carlo Izzo, were set to music for choir a cappella by Goffredo Petrassi in 1952.\n\nPortrayals\n\nEdward Lear has been played in radio dramas by Andrew Sachs in The Need for Nonsense by Julia Blackburn (BBC Radio 4, 9 February 2009) and by Derek Jacobi in By the Coast of Coromandel by Lavinia Murray (BBC Radio 4, 21 December 2011).\n\nWorks\n\n*Illustrations of the Family of Psittacidae, or Parrots (1832)\n*Views in Rome and its Environs (1841)\n*Gleanings from the Menagerie at Knowsley Hall (1846)\n*Book of Nonsense (1846)\n*Illustrated Excursions in Italy (1846)\n*Mount Timohorit, Albania (1848)\n*Journal of a Landscape Painter in Greece and Albania (1851)\n*The falls of the Kalama Albania (1851)\n*Journal of a Landscape Painter in Southern Calabria (1852)\n*Poems and Songs by Alfred Tennyson (1853, 1859, 1860) Twelve total musical settings published, each being for a Tennyson poem.\n*Journal of a Landscape Painter in Corsica (1870)\n*Nonsense Songs and Stories (1870, dated 1871)\n*Tortoises, Terrapins, and Turtles (1872), introduction by J.E. Gray\n*More Nonsense Songs, Pictures, etc. (1872)\n*Laughable Lyrics (1877)\n*Nonsense Alphabets\n*Argos from Mycenae (1884), now in the collection of Trinity College, Cambridge \n*Nonsense Botany (1888)\n*Tennyson's Poems, illustrated by Lear (1889)\n*Facsimile of a Nonsense Alphabet (1849, but not published until 1926)\n*The Quangle-Wangle's Hat (unknown)\n*Edward Lear's Parrots by Brian Reade, Duckworth (1949), including 12 coloured plates from Lear's Psittacidae\n*The Scroobious Pip, unfinished at his death, but completed by Ogden Nash and illustrated by Nancy Ekholm Burkert (1968)\n* \"Edward Lear: The Corfu Years\" (1988) \n* The 1970 Saturday morning cartoon Tomfoolery, based on the works of Lear and Lewis Carroll\n\nIllustrations\n\nFile:Ara macao -painting by Edward Lear.jpg|Ara macao from his first book, 1830\nFile:Houghton MS Typ 55.12 - Edward Lear, chimpanzee head.jpg|Chimpanzee, 1835\nFile:eagleowl.jpg|Eagle Owl, Edward Lear, 1837\nFile:owlpussycat.jpg|Another Edward Lear owl, in his more familiar style\nFile:EdwardLearSelfPortrait.jpg|Lear self-portrait, illustrating a real incident when he encountered a stranger who claimed that \"Edward Lear\" was merely a pseudonym. Lear (on the right) is showing the stranger (left) the inside of his hat, with his name in the lining.\nFile:Edward Lear A Book of Nonsense 73.jpg|Illustration by Edward Lear for There was a Young Lady of Hull\nFile:Edward Lear - A Weasel - Google Art Project.jpg|A Weasel \nFile:Melfi - Edward Lear.jpg|Lithograph of Melfi, Italian city in the Basilicata region\nFile:Edward Lear self-caricature.jpg|Self-caricature (1870)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Edward Lear" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10408" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Edward Lear (12 or 13 May 1812Metropolitan Museum of Art (New York, N.Y.), and Katharine Baetjer. 2009. British paintings in the Metropolitan Museum of Art, 1575-1875. New York: Metropolitan Museum of Art. p. 270. Vivian Noakes says Lear's birth certificate gives 13 May as his birthdate but says \"there is some doubt about the exact date\". Noakes, Vivien. 1986. Edward Lear, 1812-1888. New York: H.N. Abrams. p. 74.  – 29 January 1888) was an English artist, illustrator, musician, author and poet, and is known now mostly for his literary nonsense in poetry and prose and especially his limericks, a form he popularised. His principal areas of work as an artist were threefold: as a draughtsman employed to illustrate birds and animals; making coloured drawings during his journeys, which he reworked later, sometimes as plates for his travel books; as a (minor) illustrator of Alfred Tennyson's poems. As an author, he is known principally for his popular nonsense collections of poems, songs, short stories, botanical drawings, recipes, and alphabets. He also composed and published twelve musical settings of Tennyson's poetry.\n\nBiography\n\nEarly years\n\nLear was born into a middle-class family at Holloway, North London, the penultimate of twenty-one children (and youngest to survive) of Ann Clark Skerrett and Jeremiah Lear, a stockbroker formerly working for the family sugar refining business.Edward Lear, Ina Rae Hark, Twayne Publishers, 1982, pg 2 He was raised by his eldest sister, also named Ann, 21 years his senior. Jeremiah Lear ended up defaulting to the London Stock Exchange in the economic upheaval following the Napoleonic Wars;Pictures at an Exhibition: Selected Essays on Art and Art Therapy, ed. Andrea Gilroy and Tessa Dalley, Routledge, 1989, pg 66 owing to the family's now more limited finances, Lear and his sister were required to leave the family home, Bowmans Lodge, and live together when he was aged four. Ann doted on Edward and continued to act as a mother for him until her death, when he was almost 50 years of age.Jackson, Holbrook (ed). The Complete Nonsense of Edward Lear. Dover Publications, 1951. Page xii.\n\nLear suffered from lifelong health afflictions. From the age of six he suffered frequent grand mal epileptic seizures, and bronchitis, asthma, and during later life, partial blindness. Lear experienced his first seizure at a fair near Highgate with his father. The event scared and embarrassed him. Lear felt lifelong guilt and shame for his epileptic condition. His adult diaries indicate that he always sensed the onset of a seizure in time to remove himself from public view. When Lear was about seven years old he began to show signs of depression, possibly due to the instability of his childhood. He suffered from periods of severe melancholia which he referred to as \"the Morbids.\"\n\nArtist\n\nLear was already drawing \"for bread and cheese\" by the time he was aged 16 and soon developed into a serious \"ornithological draughtsman\" employed by the Zoological Society and then from 1832 to 1836 by the Earl of Derby, who kept a private menagerie at his estate, Knowsley Hall. He was the first major bird artist to draw birds from real live birds, instead of skins. Lear's first publication, published when he was 19 years old, was Illustrations of the Family of Psittacidae, or Parrots in 1830. One of the greatest ornithological artists of his era, he taught Elizabeth Gould whilst also contributing to John Gould's works and was compared favourably with the naturalist John James Audubon. Unfortunately his eyesight deteriorated too much to work with such precision on the fine drawings and etchings of plates used in lithography, thus he turned to landscape painting and travel.Roger F. Pastier & John Farrand, Jr., \"Masterpieces of Bird Art, 700 Years of Ornithological Illustration,\" pp.122-123, Abbeville Press, New York, 1991, \n\nAmong other travels, he visited Greece and Egypt during 1848–49, and toured India during 1873–75, including a brief detour to Ceylon. While travelling he produced large quantities of coloured wash drawings in a distinctive style, which he converted later in his studio into oil and watercolour paintings, as well as prints for his books.Andrew Wilton & Anne Lyles, The Great Age of British Watercolours (1750–1880), p. 318, 1993, Prestel,  His landscape style often shows views with strong sunlight, with intense contrasts of colour.\n\nBetween 1878 and 1883 Lear spent his summers on Monte Generoso, a mountain on the border between the Swiss canton of Ticino and the Italian region of Lombardy. His oil painting The Plains of Lombardy from Monte Generoso is in the Ashmolean Museum in the English city of Oxford.\n\nThroughout his life he continued to paint seriously. He had a lifelong ambition to illustrate Tennyson's poems; near the end of his life a volume with a small number of illustrations was published.\n\nIllustrated Excursions in Italy (1842-46) \n\nIn 1842 Lear began a journey into the Italian peninsula, travelling through the Lazio, Rome, Abruzzo, Molise, Apulia, Calabria, and Sicily. In personal notes, together with drawings, Lear gathered his impressions on the Italian way of life, folk traditions, and the beauty of the ancient monuments. Of particular interest to Lear was the Abruzzo, which he visited in 1843, through the Marsica (Celano, Avezzano, Alba Fucens, Trasacco) and the plateau of Cinque Miglia (Castel di Sangro and Alfedena), by an old sheep track of the shepherds.\n\nLear drew a sketch of the medieval village of Albe with Mount Sirente, and described the medieval village of Celano, with the castle of Piccolomini dominating the vast plain of Lago Fucino, which was drained a few years later to promote agricultural development. At Castel di Sangro, Lear described the winter stillness of the mountains and the beautiful basilica.\n\nComposer and musician\n\nLear played the accordion, flute, and guitar, but primarily the piano. He composed music for many Romantic and Victorian poems, but was known mostly for his many musical settings of Tennyson's poetry. He published four settings in 1853, five in 1859, and three in 1860. Lear's were the only musical settings that Tennyson approved of. Lear also composed music for many of his nonsense songs, including \"The Owl and the Pussy-cat,\" but only two of the scores have survived, the music for \"The Courtship of the Yonghy-Bonghy-Bò\" and \"The Pelican Chorus.\" While he never played professionally, he did perform his own nonsense songs and his settings of others' poetry at countless social gatherings, sometimes adding his own lyrics (as with the song \"The Nervous Family\"), and sometimes replacing serious lyrics with nursery rhymes.Noakes, Vivien. Edward Lear: The Life of a Wanderer, Revised Edition, p. 99-100, 2004, \n\nRelationships\n\nLear's most fervent and painful friendship was with Franklin Lushington. He met the young barrister in Malta in 1849 and then toured southern Greece with him. Lear developed an infatuation for him that Lushington did not wholly reciprocate. Although they remained friends for almost forty years, until Lear's death, the disparity of their feelings constantly tormented Lear. Indeed, Lear's attempts at male companionship were not always successful; the very intensity of Lear's affections may have doomed these relationships.Susan Chitty, That Singular Person Called Lear, Atheneum, 1989\n\nThe closest he came to marriage was two proposals, both to the same woman 46 years his junior, which were not accepted. For companions he relied instead on friends and correspondents, and especially, during later life, on his Albanian Souliote chef, Giorgis, a faithful friend and, as Lear complained, a thoroughly unsatisfactory chef.Levi, Peter.  Edward Lear, a Biography. Another trusted companion in San Remo was his cat, Foss, who died in 1886 and was buried with some ceremony in a garden at Villa Tennyson.\n\nSan Remo and death\n\nLear travelled widely throughout his life and eventually settled in San Remo, on his beloved Mediterranean coast, in the 1870s, at a villa he named \"Villa Tennyson.\"\n\nLear was known to introduce himself with a long pseudonym: \"Mr Abebika kratoponoko Prizzikalo Kattefello Ablegorabalus Ableborinto phashyph\" or \"Chakonoton the Cozovex Dossi Fossi Sini Tomentilla Coronilla Polentilla\nBattledore & Shuttlecock Derry down Derry Dumps\" which he based on Aldiborontiphoskyphorniostikos.\n\nAfter a long decline in his health, Lear died at his villa in 1888 of heart disease, from which he had suffered since at least 1870. Lear's funeral was said to be a sad, lonely affair by the wife of Dr. Hassall, Lear's physician, none of Lear's many lifelong friends being able to attend.Strachie, Lady Constance Braham. Later Letters of Edward Lear: Author of \"The Book of Nonsense.\" 1911: Duffield and Company. P. 332\n\nLear is buried in the Cemetery Foce in San Remo.  On his headstone are inscribed these lines about Mount Tomohrit (in Albania) from Tennyson's poem To E.L. [Edward Lear], On His Travels in Greece:\n\nall things fair.\nWith such a pencil, such a pen.\nYou shadow'd forth to distant men,\nI read and felt that I was there.\n\nThe centenary of his death was marked in Britain with a set of Royal Mail stamps in 1988 and an exhibition at the Royal Academy. Lear's birthplace area is now marked with a plaque at Bowman's Mews, Islington, in London, and his bicentenary during 2012 was celebrated with a variety of events, exhibitions and lectures in venues across the world including an International Owl and Pussycat Day on his birth anniversary.\n\nAuthor\n\nIn 1846 Lear published A Book of Nonsense, a volume of limericks that went through three editions and helped popularize the form and the genre of literary nonsense. In 1871 he published Nonsense Songs, Stories, Botany and Alphabets, which included his most famous nonsense song, The Owl and the Pussycat, which he wrote for the children of his patron Edward Stanley, 13th Earl of Derby. Many other works followed.\n\nLear's nonsense books were quite popular during his lifetime, but a rumor developed that \"Edward Lear\" was merely a pseudonym, and the books' true author was the man to whom Lear had dedicated the works, his patron the Earl of Derby. Promoters of this rumor offered as evidence the facts that both men were named Edward, and that \"Lear\" is an anagram of \"Earl.\"\n\nLear's nonsense works are distinguished by a facility of verbal invention and a poet's delight in the sounds of words, both real and imaginary. A stuffed rhinoceros becomes a \"diaphanous doorscraper.\" A \"blue Boss-Woss\" plunges into \"a perpendicular, spicular, orbicular, quadrangular, circular depth of soft mud.\" His heroes are Quangle-Wangles, Pobbles, and Jumblies. One of his most famous verbal inventions, the phrase \"runcible spoon,\" occurs in the closing lines of The Owl and the Pussycat, and is now found in many English dictionaries:\n\nThey dined on mince, and slices of quince\n:Which they ate with a runcible spoon;\nAnd hand in hand, on the edge of the sand,\n:They danced by the light of the moon,\n::The moon,\n::The moon,\nThey danced by the light of the moon.\n\nThough famous for his neologisms, Lear used a number of other devices in his works in order to defy reader expectations. For example, \"Cold Are the Crabs\" conforms to the sonnet tradition until its dramatically foreshortened last line.\n\nLimericks are invariably typeset as four plus one lines presently, but Lear's limericks were published in a variety of formats. It appears that Lear wrote them in manuscript in as many lines as there was room for beneath the picture. For the first three editions most are typeset as, respectively, two, five, and three lines. The cover of one edition bears an entire limerick typeset in two lines:\n\nThere was an Old Derry down Derry, who loved to see little folks merry;\nSo he made them a book, and with laughter they shook at the fun of that Derry down Derry.\n\nIn Lear's limericks the first and last lines usually end with the same word rather than rhyming. For the most part they are truly nonsensical and devoid of any punch line or point. They are completely free of the bawdyness with which the verse form is now associated. A typical thematic element is the presence of a callous and critical \"they.\" An example of a typical Lear limerick:\n\nThere was an Old Man of Aôsta,\nWho possessed a large Cow, but he lost her;\nBut they said, 'Don't you see,\nshe has rushed up a tree?\nYou invidious Old Man of Aôsta!'\n\nLear's self-description in verse, How Pleasant to know Mr. Lear, ends with this stanza, a reference to his own mortality:\n\nHe reads but he cannot speak Spanish,\n:He cannot abide ginger-beer;\nEre the days of his pilgrimage vanish,\n:How pleasant to know Mr. Lear!\n\nFive of Lear's limericks from the Book of Nonsense, in the 1946 Italian translation by Carlo Izzo, were set to music for choir a cappella by Goffredo Petrassi in 1952.\n\nPortrayals\n\nEdward Lear has been played in radio dramas by Andrew Sachs in The Need for Nonsense by Julia Blackburn (BBC Radio 4, 9 February 2009) and by Derek Jacobi in By the Coast of Coromandel by Lavinia Murray (BBC Radio 4, 21 December 2011).\n\nWorks\n\n*Illustrations of the Family of Psittacidae, or Parrots (1832)\n*Views in Rome and its Environs (1841)\n*Gleanings from the Menagerie at Knowsley Hall (1846)\n*Book of Nonsense (1846)\n*Illustrated Excursions in Italy (1846)\n*Mount Timohorit, Albania (1848)\n*Journal of a Landscape Painter in Greece and Albania (1851)\n*The falls of the Kalama Albania (1851)\n*Journal of a Landscape Painter in Southern Calabria (1852)\n*Poems and Songs by Alfred Tennyson (1853, 1859, 1860) Twelve total musical settings published, each being for a Tennyson poem.\n*Journal of a Landscape Painter in Corsica (1870)\n*Nonsense Songs and Stories (1870, dated 1871)\n*Tortoises, Terrapins, and Turtles (1872), introduction by J.E. Gray\n*More Nonsense Songs, Pictures, etc. (1872)\n*Laughable Lyrics (1877)\n*Nonsense Alphabets\n*Argos from Mycenae (1884), now in the collection of Trinity College, Cambridge \n*Nonsense Botany (1888)\n*Tennyson's Poems, illustrated by Lear (1889)\n*Facsimile of a Nonsense Alphabet (1849, but not published until 1926)\n*The Quangle-Wangle's Hat (unknown)\n*Edward Lear's Parrots by Brian Reade, Duckworth (1949), including 12 coloured plates from Lear's Psittacidae\n*The Scroobious Pip, unfinished at his death, but completed by Ogden Nash and illustrated by Nancy Ekholm Burkert (1968)\n* \"Edward Lear: The Corfu Years\" (1988) \n* The 1970 Saturday morning cartoon Tomfoolery, based on the works of Lear and Lewis Carroll\n\nIllustrations\n\nFile:Ara macao -painting by Edward Lear.jpg|Ara macao from his first book, 1830\nFile:Houghton MS Typ 55.12 - Edward Lear, chimpanzee head.jpg|Chimpanzee, 1835\nFile:eagleowl.jpg|Eagle Owl, Edward Lear, 1837\nFile:owlpussycat.jpg|Another Edward Lear owl, in his more familiar style\nFile:EdwardLearSelfPortrait.jpg|Lear self-portrait, illustrating a real incident when he encountered a stranger who claimed that \"Edward Lear\" was merely a pseudonym. Lear (on the right) is showing the stranger (left) the inside of his hat, with his name in the lining.\nFile:Edward Lear A Book of Nonsense 73.jpg|Illustration by Edward Lear for There was a Young Lady of Hull\nFile:Edward Lear - A Weasel - Google Art Project.jpg|A Weasel \nFile:Melfi - Edward Lear.jpg|Lithograph of Melfi, Italian city in the Basilicata region\nFile:Edward Lear self-caricature.jpg|Self-caricature (1870). Edward Lear. http://en.wikipedia.org/?curid=10408."
  }
}
