{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8378",
  "eid" : "e77ae4c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778468108,
  "textBody" : "In electromagnetism, there are two kinds of dipoles:\n*An electric dipole is a separation of positive and negative charges. The simplest example of this is a pair of electric charges of equal magnitude but opposite sign, separated by some (usually small) distance. A permanent electric dipole is called an electret.\n*A magnetic dipole is a closed circulation of electric current. A simple example of this is a single loop of wire with some constant current through it.\n\nDipoles can be characterized by their dipole moment, a vector quantity. For the simple electric dipole given above, the electric dipole moment points from the negative charge towards the positive charge, and has a magnitude equal to the strength of each charge times the separation between the charges. (To be precise: for the definition of the dipole moment, one should always consider the \"dipole limit\", where, for example, the distance of the generating charges should converge to 0 while simultaneously, the charge strength should diverge to infinity in such a way that the product remains a positive constant.)\n\nFor the current loop, the magnetic dipole moment points through the loop (according to the right hand grip rule), with a magnitude equal to the current in the loop times the area of the loop.\n\nIn addition to current loops, the electron, among other fundamental particles, has a magnetic dipole moment. That is because it generates a magnetic field that is identical to that generated by a very small current loop. However, the electron's magnetic moment is not due to a current loop, but is instead an intrinsic property of the electron. It is also possible that the electron has an electric dipole moment although it has not yet been observed (see electron electric dipole moment for more information).\n\nA permanent magnet, such as a bar magnet, owes its magnetism to the intrinsic magnetic dipole moment of the electron. The two ends of a bar magnet are referred to as poles (not to be confused with monopoles), and may be labeled \"north\" and \"south\". In terms of the Earth's magnetic field, they are respectively \"north-seeking\" and \"south-seeking\" poles: if the magnet were freely suspended in the Earth's magnetic field, the north-seeking pole would point towards the north and the south-seeking pole would point towards the south. The dipole moment of the bar magnet points from its magnetic south to its magnetic north pole. The north pole of a bar magnet in a compass points north. However, that means that Earth's geomagnetic north pole is the south pole (south-seeking pole) of its dipole moment and vice versa.\n\nThe only known mechanisms for the creation of magnetic dipoles are by current loops or quantum-mechanical spin since the existence of magnetic monopoles has never been experimentally demonstrated.\n\nThe term comes from the Greek  (dis), \"twice\"[http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.04.0057%3Aentry%3Ddi%2Fs δίς], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus and  (polos), \"axis\".[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3Dpo%2Flos πόλος], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus\n\nClassification\n\nA physical dipole consists of two equal and opposite point charges: in the literal sense, two poles. Its field at large distances (i.e., distances large in comparison to the separation of the poles) depends almost entirely on the dipole moment as defined above. A point (electric) dipole is the limit obtained by letting the separation tend to 0 while keeping the dipole moment fixed. The field of a point dipole has a particularly simple form, and the order-1 term in the multipole expansion is precisely the point dipole field.\n\nAlthough there are no known magnetic monopoles in nature, there are magnetic dipoles in the form of the quantum-mechanical spin associated with particles such as electrons (although the accurate description of such effects falls outside of classical electromagnetism). A theoretical magnetic point dipole has a magnetic field of exactly the same form as the electric field of an electric point dipole. A very small current-carrying loop is approximately a magnetic point dipole; the magnetic dipole moment of such a loop is the product of the current flowing in the loop and the (vector) area of the loop.\n\nAny configuration of charges or currents has a 'dipole moment', which describes the dipole whose field is the best approximation, at large distances, to that of the given configuration.  This is simply one term in the multipole expansion when the total charge (\"monopole moment\") is 0—as it always is for the magnetic case, since there are no magnetic monopoles.  The dipole term is the dominant one at large distances:  Its field falls off in proportion to , as compared to  for the next (quadrupole) term and higher powers of  for higher terms, or  for the monopole term.\n\nMolecular dipoles\n\nMany molecules have such dipole moments due to non-uniform distributions of positive and negative charges on the various atoms.  Such is the case with polar compounds like hydrogen fluoride (HF), where electron density is shared unequally between atoms. Therefore, a molecule's dipole is an electric dipole with an inherent electric field which should not be confused with a magnetic dipole which generates a magnetic field.\n\nThe physical chemist Peter J. W. Debye was the first scientist to study molecular dipoles extensively, and, as a consequence, dipole moments are measured in units named debye in his honor.\n\nFor molecules there are three types of dipoles:\n* Permanent dipoles: These occur when two atoms in a molecule have substantially different electronegativity: One atom attracts electrons more than another, becoming more negative, while the other atom becomes more positive. A molecule with a permanent dipole moment is called a polar molecule. See dipole–dipole attractions.\n* Instantaneous dipoles: These occur due to chance when electrons happen to be more concentrated in one place than another in a molecule, creating a temporary dipole. See instantaneous dipole.\n* Induced dipoles: These can occur when one molecule with a permanent dipole repels another molecule's electrons, inducing a dipole moment in that molecule. A molecule is polarized when it carries an induced dipole. See induced-dipole attraction.\n\nMore generally, an induced dipole of any polarizable charge distribution ρ (remember that a molecule has a charge distribution) is caused by an electric field external to ρ. This field may, for instance, originate from an ion or polar molecule in the vicinity of ρ or may be macroscopic (e.g., a molecule between the plates of a charged capacitor). The size of the induced dipole moment is equal to the product of the strength of the external field and the dipole polarizability of ρ.\n\nDipole moment values can be obtained from measurement of the dielectric constant. Some typical gas phase values in debye units are:\n\n* carbon dioxide: 0\n* carbon monoxide: 0.112 D\n* ozone: 0.53 D\n* phosgene: 1.17 D\n* water vapor: 1.85 D\n* hydrogen cyanide: 2.98 D\n* cyanamide: 4.27 D\n* potassium bromide: 10.41 D\n\nKBr has one of the highest dipole moments because it is an ionic compound that exists as a molecule in the gas phase.\n\nThe overall dipole moment of a molecule may be approximated as a vector sum of bond dipole moments. As a vector sum it depends on the relative orientation of the bonds, so that from the dipole moment information can be deduced about the molecular geometry.\n\nFor example, the zero dipole of CO2 implies that the two C=O bond dipole moments cancel so that the molecule must be linear. For H2O the O−H bond moments do not cancel because the molecule is bent. For ozone (O3) which is also a bent molecule, the bond dipole moments are not zero even though the O−O bonds are between similar atoms. This agrees with the Lewis structures for the resonance forms of ozone which show a positive charge on the central oxygen atom. \n\nAn example in organic chemistry of the role of geometry in determining dipole moment is the cis and trans isomers of 1,2-dichloroethene. In the cis isomer the two polar C−Cl bonds are on the same side of the CC double bond and the molecular dipole moment is 1.90 D. In the trans isomer, the dipole moment is zero because the two C−Cl bonds are on opposite sides of the C\nC and cancel (and the two bond moments for the much less polar C−H bonds also cancel).\n\nAnother example of the role of molecular geometry is boron trifluoride, which has three polar bonds with a difference in electronegativity greater than the traditionally cited threshold of 1.7 for ionic bonding. However, due to the equilateral triangular distribution of the fluoride ions about the boron cation center, the molecule as a whole does not exhibit any identifiable pole: one cannot construct a plane that divides the molecule into a net negative part and a net positive part.\n\nQuantum mechanical dipole operator\n\nConsider a collection of N particles with charges qi and position vectors ri. For instance, this collection may be a molecule consisting of electrons, all with charge −e, and nuclei with charge eZi, where Zi is the atomic number of the i th nucleus.\nThe dipole observable (physical quantity) has the quantum mechanical dipole operator:\n\\mathfrak{p} \\sum_{i\n1}^N \\, q_i \\, \\mathbf{r}_i \\, .\nNotice that this definition is valid only for non-charged dipoles, i.e. total charge equal to zero. To a charged dipole we have the next equation:\n\\mathfrak{p} \\sum_{i\n1}^N \\, q_i \\, (\\mathbf{r}_i - \\mathbf{r}_c) \\, .\nwhere  \\mathbf{r}_c is the center of mass of the molecule/group of particles.http://www.av8n.com/physics/electric-dipole.htm#eq-dipole-ref\n\nAtomic dipoles\n\nA non-degenerate (S-state) atom can have only a zero permanent dipole. This fact follows quantum mechanically from the inversion symmetry of atoms. All 3 components of the dipole operator are antisymmetric under inversion with respect to the nucleus,\n  \\mathfrak{I} \\;\\mathfrak{p}\\;  \\mathfrak{I}^{-1} = - \\mathfrak{p}, \nwhere \\mathfrak{p} is the dipole operator  and \\mathfrak{I} is the inversion operator.\nThe permanent dipole moment  of an atom in a non-degenerate state (see degenerate energy level) is given as the expectation (average) value of the dipole operator,\n\n\\langle \\mathfrak{p} \\rangle = \\langle\\, S\\, | \\mathfrak{p} |\\, S \\,\\rangle,\n\nwhere  |\\, S\\, \\rangle  is an S-state, non-degenerate, wavefunction, which is symmetric or antisymmetric under inversion:   \\mathfrak{I}\\,|\\, S\\, \\rangle= \\pm |\\, S\\, \\rangle. Since the product of the wavefunction (in the ket) and its complex conjugate (in the bra) is always symmetric under inversion and its inverse,\n\n\\langle \\mathfrak{p} \\rangle = \\langle\\,  \\mathfrak{I}^{-1}\\, S\\, | \\mathfrak{p} |\\, \\mathfrak{I}^{-1}\\, S \\,\\rangle\n \\langle\\,  S\\, |  \\mathfrak{I}\\, \\mathfrak{p} \\, \\mathfrak{I}^{-1}| \\, S \\,\\rangle \n -\\langle \\mathfrak{p} \\rangle\n\nit follows that the expectation value changes sign under inversion.  We used here the fact that  \\mathfrak{I}, being a symmetry operator, is unitary:  \\mathfrak{I}^{-1}  \\mathfrak{I}^{*}\\, and by definition the Hermitian adjoint  \\mathfrak{I}^*\\, may be moved from bra to ket and then becomes  \\mathfrak{I}^{**} \n  \\mathfrak{I}\\,. Since the only quantity that is equal to minus itself is the zero, the expectation  value vanishes,\n\n\\langle \\mathfrak{p}\\rangle = 0.\n\nIn the case of open-shell atoms with degenerate  energy levels, one could define a dipole moment by the aid of the first-order Stark effect. This gives a non-vanishing dipole (by definition proportional to a non-vanishing first-order Stark shift) only if some of the wavefunctions belonging to the degenerate energies have opposite parity; i.e., have different behavior under inversion. This is a rare occurrence, but happens for the excited H-atom, where 2s and 2p states are \"accidentally\" degenerate (see article Laplace–Runge–Lenz vector for the origin of this degeneracy) and have opposite parity (2s is even and 2p is odd).\n\nField of a static magnetic dipole\n\nMagnitude\n\nThe far-field strength, B, of a dipole magnetic field is given by\n\nB(m, r, \\lambda) = \\frac {\\mu_0} {4\\pi} \\frac {m} {r^3} \\sqrt {1+3\\sin^2\\lambda} \\, ,\n\nwhere\nB is the strength of the field, measured in teslas\nr is the distance from the center, measured in metres\nλ is the magnetic latitude (equal to 90° − θ) where θ is the magnetic colatitude, measured in radians or degrees from the dipole axisMagnetic colatitude is 0 along the dipole's axis and 90° in the plane perpendicular to its axis.\nm is the dipole moment, measured in ampere-square metres or joules per tesla\nμ0 is the permeability of free space, measured in henries per metre.\n\nConversion to cylindrical coordinates is achieved using  and\n\\lambda = \\arcsin\\left(\\frac{z}{\\sqrt{z^2+\\rho^2}}\\right)\n\nwhere ρ is the perpendicular distance from the z-axis. Then,\n\nB(\\rho,z) = \\frac{\\mu_0 m}{4 \\pi \\left(z^2+\\rho^2\\right)^\\frac32} \\sqrt{1+\\frac{3 z^2}{z^2 + \\rho^2}}\n\nVector form\n\nThe field itself is a vector quantity:\n\n\\mathbf{B}(\\mathbf{m}, \\mathbf{r}) = \\frac {\\mu_0} {4\\pi} \\left(\\frac{3(\\mathbf{m}\\cdot\\hat{\\mathbf{r}})\\hat{\\mathbf{r}}-\\mathbf{m}}{r^3}\\right) + \\frac{2\\mu_0}{3}\\mathbf{m}\\delta^3(\\mathbf{r})\n\nwhere\n\nB is the field\nr is the vector from the position of the dipole to the position where the field is being measured\nr is the absolute value of r: the distance from the dipole\nr̂ =  is the unit vector parallel to r;\nm is the (vector) dipole moment\nμ0 is the permeability of free space\nδ3 is the three-dimensional delta function.δ3(r) = 0 except at , so this term is ignored in multipole expansion.\nThis is exactly the field of a point dipole, exactly the dipole term in the multipole expansion of an arbitrary field, and approximately the field of any dipole-like configuration at large distances.\n\nMagnetic vector potential\n\nThe vector potential A of a magnetic dipole is\n\n\\mathbf{A}(\\mathbf{r}) = \\frac {\\mu_0} {4\\pi} \\frac{\\mathbf{m}\\times\\hat{\\mathbf{r}}}{r^2}\n\nwith the same definitions as above.\n\nField from an electric dipole\n\nThe electrostatic potential at position r due to an electric dipole at the origin is given by:\n\n \\Phi(\\mathbf{r}) = \\frac{1}{4\\pi\\varepsilon_0}\\,\\frac{\\mathbf{p}\\cdot\\hat{\\mathbf{r}}}{r^2}\n\nwhere\n\\hat{\\mathbf{r}} is a unit vector in the direction of r, p is the (vector) dipole moment, and ε0 is the permittivity of free space.\n\nThis term appears as the second term in the multipole expansion of an arbitrary electrostatic potential Φ(r). If the source of Φ(r) is a dipole, as it is assumed here, this term is  the only non-vanishing term in the multipole expansion of Φ(r). The electric field from a dipole can be found from the gradient of this potential:\n\n \\mathbf{E} - \\nabla \\Phi \n\\frac {1} {4\\pi\\epsilon_0} \\left(\\frac{3(\\mathbf{p}\\cdot\\hat{\\mathbf{r}})\\hat{\\mathbf{r}}-\\mathbf{p}}{r^3}\\right) - \\frac{1}{3\\epsilon_0}\\mathbf{p}\\delta^3(\\mathbf{r})\n\nwhere E is the electric field and δ3 is the 3-dimensional delta function. This is formally identical to the magnetic H field of a point magnetic dipole with only a few names changed.\n\nTorque on a dipole\n\nSince the direction of an electric field is defined as the direction of the force on a positive charge, electric field lines point away from a positive charge and toward a negative charge.\n\nWhen placed in an electric or magnetic field, equal but opposite forces arise on each side of the dipole creating a torque :\n\n \\boldsymbol{\\tau} = \\mathbf{p} \\times \\mathbf{E}\nfor an electric dipole moment p (in coulomb-meters), or\n\n \\boldsymbol{\\tau} = \\mathbf{m} \\times \\mathbf{B}\nfor a magnetic dipole moment m (in ampere-square meters).\n\nThe resulting torque will tend to align the dipole with the applied field, which in the case of an electric dipole, yields a potential energy of\n\n U = -\\mathbf{p} \\cdot \\mathbf{E}.\n\nThe energy of a magnetic dipole is similarly\n\n U = -\\mathbf{m} \\cdot \\mathbf{B}.\n\nDipole radiation\n\nIn addition to dipoles in electrostatics, it is also common to consider an electric or magnetic dipole that is oscillating in time. It is an extension, or a more physical next-step, to spherical wave radiation.\n\nIn particular, consider a harmonically oscillating electric dipole, with angular frequency ω and a dipole moment p0 along the ẑ direction of the form\n\\mathbf{p}(\\mathbf{r},t)\\mathbf{p}(\\mathbf{r})e^{-i\\omega t}  \n p_0\\hat{\\mathbf{z}}e^{-i\\omega t} .\n\nIn vacuum, the exact field produced by this oscillating dipole can be derived using the retarded potential formulation as:\n\n\\mathbf{E} = \\frac{1}{4\\pi\\varepsilon_0} \\left\\{ \\frac{\\omega^2}{c^2 r}\n( \\hat{\\mathbf{r}} \\times \\mathbf{p} ) \\times \\hat{\\mathbf{r}}\n+ \\left( \\frac{1}{r^3} - \\frac{i\\omega}{cr^2} \\right) \\left[ 3 \\hat{\\mathbf{r}} (\\hat{\\mathbf{r}} \\cdot \\mathbf{p}) - \\mathbf{p} \\right]  \\right\\} e^{i\\omega r/c} e^{-i\\omega t}\n\n\\mathbf{B} = \\frac{\\omega^2}{4\\pi\\varepsilon_0 c^3} \\hat{\\mathbf{r}} \\times \\mathbf{p} \\left( 1 - \\frac{c}{i\\omega r} \\right) \\frac{e^{i\\omega r/c}}{r} e^{-i\\omega t}.\n\nFor  ≫ 1, the far-field takes the simpler form of a radiating \"spherical\" wave, but with angular dependence embedded in the cross-product:David J. Griffiths, Introduction to Electrodynamics, Prentice Hall, 1999, page 447\n\n\\mathbf{B} = \\frac{\\omega^2}{4\\pi\\varepsilon_0 c^3} (\\hat{\\mathbf{r}} \\times \\mathbf{p}) \\frac{e^{i\\omega (r/c-t)}}{r}\n = \\frac{\\omega^2 \\mu_0 p_0 }{4\\pi  c} (\\hat{\\mathbf{r}} \\times \\hat{\\mathbf{z}}) \\frac{e^{i\\omega (r/c-t)}}{r}\n = -\\frac{\\omega^2 \\mu_0 p_0 }{4\\pi c} \\sin\\theta \\frac{e^{i\\omega (r/c-t)}}{r} \\mathbf{\\hat{\\phi} }\n\n\\mathbf{E} = c \\mathbf{B} \\times \\hat{\\mathbf{r}}\n= -\\frac{\\omega^2 \\mu_0 p_0 }{4\\pi} \\sin\\theta (\\hat{\\phi} \\times \\mathbf{\\hat{r} } )\\frac{e^{i\\omega (r/c-t)}}{r}\n= -\\frac{\\omega^2 \\mu_0 p_0 }{4\\pi} \\sin\\theta \\frac{e^{i\\omega (r/c-t)}}{r} \\hat{\\theta}.\n\nThe time-averaged Poynting vector\n\n \\langle \\mathbf{S} \\rangle = \\bigg(\\frac{\\mu_0p_0^2\\omega^4}{32\\pi^2 c}\\bigg) \\frac{\\sin^2\\theta}{r^2} \\mathbf{\\hat{r}}\n\nis not distributed isotropically, but concentrated around the directions lying perpendicular to the dipole moment, as a result of the non-spherical electric and magnetic waves. In fact, the spherical harmonic function (sin θ) responsible for such toroidal angular distribution is precisely the l = 1 \"p\" wave.\n\nThe total time-average power radiated by the field can then be derived from the Poynting vector as\n\nP = \\frac{\\mu_0 \\omega^4 p_0^2}{12\\pi c}.\n\nNotice that the dependence of the power on the fourth power of the frequency of the radiation is in accordance with the Rayleigh scattering, and the underlying effects why the sky consists of mainly blue colour.\n\nA circular polarized dipole is described as a superposition of two linear dipoles.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dipole" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8378" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In electromagnetism, there are two kinds of dipoles:\n*An electric dipole is a separation of positive and negative charges. The simplest example of this is a pair of electric charges of equal magnitude but opposite sign, separated by some (usually small) distance. A permanent electric dipole is called an electret.\n*A magnetic dipole is a closed circulation of electric current. A simple example of this is a single loop of wire with some constant current through it.\n\nDipoles can be characterized by their dipole moment, a vector quantity. For the simple electric dipole given above, the electric dipole moment points from the negative charge towards the positive charge, and has a magnitude equal to the strength of each charge times the separation between the charges. (To be precise: for the definition of the dipole moment, one should always consider the \"dipole limit\", where, for example, the distance of the generating charges should converge to 0 while simultaneously, the charge strength should diverge to infinity in such a way that the product remains a positive constant.)\n\nFor the current loop, the magnetic dipole moment points through the loop (according to the right hand grip rule), with a magnitude equal to the current in the loop times the area of the loop.\n\nIn addition to current loops, the electron, among other fundamental particles, has a magnetic dipole moment. That is because it generates a magnetic field that is identical to that generated by a very small current loop. However, the electron's magnetic moment is not due to a current loop, but is instead an intrinsic property of the electron. It is also possible that the electron has an electric dipole moment although it has not yet been observed (see electron electric dipole moment for more information).\n\nA permanent magnet, such as a bar magnet, owes its magnetism to the intrinsic magnetic dipole moment of the electron. The two ends of a bar magnet are referred to as poles (not to be confused with monopoles), and may be labeled \"north\" and \"south\". In terms of the Earth's magnetic field, they are respectively \"north-seeking\" and \"south-seeking\" poles: if the magnet were freely suspended in the Earth's magnetic field, the north-seeking pole would point towards the north and the south-seeking pole would point towards the south. The dipole moment of the bar magnet points from its magnetic south to its magnetic north pole. The north pole of a bar magnet in a compass points north. However, that means that Earth's geomagnetic north pole is the south pole (south-seeking pole) of its dipole moment and vice versa.\n\nThe only known mechanisms for the creation of magnetic dipoles are by current loops or quantum-mechanical spin since the existence of magnetic monopoles has never been experimentally demonstrated.\n\nThe term comes from the Greek  (dis), \"twice\"[http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.04.0057%3Aentry%3Ddi%2Fs δίς], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus and  (polos), \"axis\".[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3Dpo%2Flos πόλος], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus\n\nClassification\n\nA physical dipole consists of two equal and opposite point charges: in the literal sense, two poles. Its field at large distances (i.e., distances large in comparison to the separation of the poles) depends almost entirely on the dipole moment as defined above. A point (electric) dipole is the limit obtained by letting the separation tend to 0 while keeping the dipole moment fixed. The field of a point dipole has a particularly simple form, and the order-1 term in the multipole expansion is precisely the point dipole field.\n\nAlthough there are no known magnetic monopoles in nature, there are magnetic dipoles in the form of the quantum-mechanical spin associated with particles such as electrons (although the accurate description of such effects falls outside of classical electromagnetism). A theoretical magnetic point dipole has a magnetic field of exactly the same form as the electric field of an electric point dipole. A very small current-carrying loop is approximately a magnetic point dipole; the magnetic dipole moment of such a loop is the product of the current flowing in the loop and the (vector) area of the loop.\n\nAny configuration of charges or currents has a 'dipole moment', which describes the dipole whose field is the best approximation, at large distances, to that of the given configuration.  This is simply one term in the multipole expansion when the total charge (\"monopole moment\") is 0—as it always is for the magnetic case, since there are no magnetic monopoles.  The dipole term is the dominant one at large distances:  Its field falls off in proportion to , as compared to  for the next (quadrupole) term and higher powers of  for higher terms, or  for the monopole term.\n\nMolecular dipoles\n\nMany molecules have such dipole moments due to non-uniform distributions of positive and negative charges on the various atoms.  Such is the case with polar compounds like hydrogen fluoride (HF), where electron density is shared unequally between atoms. Therefore, a molecule's dipole is an electric dipole with an inherent electric field which should not be confused with a magnetic dipole which generates a magnetic field.\n\nThe physical chemist Peter J. W. Debye was the first scientist to study molecular dipoles extensively, and, as a consequence, dipole moments are measured in units named debye in his honor.\n\nFor molecules there are three types of dipoles:\n* Permanent dipoles: These occur when two atoms in a molecule have substantially different electronegativity: One atom attracts electrons more than another, becoming more negative, while the other atom becomes more positive. A molecule with a permanent dipole moment is called a polar molecule. See dipole–dipole attractions.\n* Instantaneous dipoles: These occur due to chance when electrons happen to be more concentrated in one place than another in a molecule, creating a temporary dipole. See instantaneous dipole.\n* Induced dipoles: These can occur when one molecule with a permanent dipole repels another molecule's electrons, inducing a dipole moment in that molecule. A molecule is polarized when it carries an induced dipole. See induced-dipole attraction.\n\nMore generally, an induced dipole of any polarizable charge distribution ρ (remember that a molecule has a charge distribution) is caused by an electric field external to ρ. This field may, for instance, originate from an ion or polar molecule in the vicinity of ρ or may be macroscopic (e.g., a molecule between the plates of a charged capacitor). The size of the induced dipole moment is equal to the product of the strength of the external field and the dipole polarizability of ρ.\n\nDipole moment values can be obtained from measurement of the dielectric constant. Some typical gas phase values in debye units are:\n\n* carbon dioxide: 0\n* carbon monoxide: 0.112 D\n* ozone: 0.53 D\n* phosgene: 1.17 D\n* water vapor: 1.85 D\n* hydrogen cyanide: 2.98 D\n* cyanamide: 4.27 D\n* potassium bromide: 10.41 D\n\nKBr has one of the highest dipole moments because it is an ionic compound that exists as a molecule in the gas phase.\n\nThe overall dipole moment of a molecule may be approximated as a vector sum of bond dipole moments. As a vector sum it depends on the relative orientation of the bonds, so that from the dipole moment information can be deduced about the molecular geometry.\n\nFor example, the zero dipole of CO2 implies that the two C=O bond dipole moments cancel so that the molecule must be linear. For H2O the O−H bond moments do not cancel because the molecule is bent. For ozone (O3) which is also a bent molecule, the bond dipole moments are not zero even though the O−O bonds are between similar atoms. This agrees with the Lewis structures for the resonance forms of ozone which show a positive charge on the central oxygen atom. \n\nAn example in organic chemistry of the role of geometry in determining dipole moment is the cis and trans isomers of 1,2-dichloroethene. In the cis isomer the two polar C−Cl bonds are on the same side of the CC double bond and the molecular dipole moment is 1.90 D. In the trans isomer, the dipole moment is zero because the two C−Cl bonds are on opposite sides of the C\nC and cancel (and the two bond moments for the much less polar C−H bonds also cancel).\n\nAnother example of the role of molecular geometry is boron trifluoride, which has three polar bonds with a difference in electronegativity greater than the traditionally cited threshold of 1.7 for ionic bonding. However, due to the equilateral triangular distribution of the fluoride ions about the boron cation center, the molecule as a whole does not exhibit any identifiable pole: one cannot construct a plane that divides the molecule into a net negative part and a net positive part.\n\nQuantum mechanical dipole operator\n\nConsider a collection of N particles with charges qi and position vectors ri. For instance, this collection may be a molecule consisting of electrons, all with charge −e, and nuclei with charge eZi, where Zi is the atomic number of the i th nucleus.\nThe dipole observable (physical quantity) has the quantum mechanical dipole operator:\n\\mathfrak{p} \\sum_{i\n1}^N \\, q_i \\, \\mathbf{r}_i \\, .\nNotice that this definition is valid only for non-charged dipoles, i.e. total charge equal to zero. To a charged dipole we have the next equation:\n\\mathfrak{p} \\sum_{i\n1}^N \\, q_i \\, (\\mathbf{r}_i - \\mathbf{r}_c) \\, .\nwhere  \\mathbf{r}_c is the center of mass of the molecule/group of particles.http://www.av8n.com/physics/electric-dipole.htm#eq-dipole-ref\n\nAtomic dipoles\n\nA non-degenerate (S-state) atom can have only a zero permanent dipole. This fact follows quantum mechanically from the inversion symmetry of atoms. All 3 components of the dipole operator are antisymmetric under inversion with respect to the nucleus,\n  \\mathfrak{I} \\;\\mathfrak{p}\\;  \\mathfrak{I}^{-1} = - \\mathfrak{p}, \nwhere \\mathfrak{p} is the dipole operator  and \\mathfrak{I} is the inversion operator.\nThe permanent dipole moment  of an atom in a non-degenerate state (see degenerate energy level) is given as the expectation (average) value of the dipole operator,\n\n\\langle \\mathfrak{p} \\rangle = \\langle\\, S\\, | \\mathfrak{p} |\\, S \\,\\rangle,\n\nwhere  |\\, S\\, \\rangle  is an S-state, non-degenerate, wavefunction, which is symmetric or antisymmetric under inversion:   \\mathfrak{I}\\,|\\, S\\, \\rangle= \\pm |\\, S\\, \\rangle. Since the product of the wavefunction (in the ket) and its complex conjugate (in the bra) is always symmetric under inversion and its inverse,\n\n\\langle \\mathfrak{p} \\rangle = \\langle\\,  \\mathfrak{I}^{-1}\\, S\\, | \\mathfrak{p} |\\, \\mathfrak{I}^{-1}\\, S \\,\\rangle\n \\langle\\,  S\\, |  \\mathfrak{I}\\, \\mathfrak{p} \\, \\mathfrak{I}^{-1}| \\, S \\,\\rangle \n -\\langle \\mathfrak{p} \\rangle\n\nit follows that the expectation value changes sign under inversion.  We used here the fact that  \\mathfrak{I}, being a symmetry operator, is unitary:  \\mathfrak{I}^{-1}  \\mathfrak{I}^{*}\\, and by definition the Hermitian adjoint  \\mathfrak{I}^*\\, may be moved from bra to ket and then becomes  \\mathfrak{I}^{**} \n  \\mathfrak{I}\\,. Since the only quantity that is equal to minus itself is the zero, the expectation  value vanishes,\n\n\\langle \\mathfrak{p}\\rangle = 0.\n\nIn the case of open-shell atoms with degenerate  energy levels, one could define a dipole moment by the aid of the first-order Stark effect. This gives a non-vanishing dipole (by definition proportional to a non-vanishing first-order Stark shift) only if some of the wavefunctions belonging to the degenerate energies have opposite parity; i.e., have different behavior under inversion. This is a rare occurrence, but happens for the excited H-atom, where 2s and 2p states are \"accidentally\" degenerate (see article Laplace–Runge–Lenz vector for the origin of this degeneracy) and have opposite parity (2s is even and 2p is odd).\n\nField of a static magnetic dipole\n\nMagnitude\n\nThe far-field strength, B, of a dipole magnetic field is given by\n\nB(m, r, \\lambda) = \\frac {\\mu_0} {4\\pi} \\frac {m} {r^3} \\sqrt {1+3\\sin^2\\lambda} \\, ,\n\nwhere\nB is the strength of the field, measured in teslas\nr is the distance from the center, measured in metres\nλ is the magnetic latitude (equal to 90° − θ) where θ is the magnetic colatitude, measured in radians or degrees from the dipole axisMagnetic colatitude is 0 along the dipole's axis and 90° in the plane perpendicular to its axis.\nm is the dipole moment, measured in ampere-square metres or joules per tesla\nμ0 is the permeability of free space, measured in henries per metre.\n\nConversion to cylindrical coordinates is achieved using  and\n\\lambda = \\arcsin\\left(\\frac{z}{\\sqrt{z^2+\\rho^2}}\\right)\n\nwhere ρ is the perpendicular distance from the z-axis. Then,\n\nB(\\rho,z) = \\frac{\\mu_0 m}{4 \\pi \\left(z^2+\\rho^2\\right)^\\frac32} \\sqrt{1+\\frac{3 z^2}{z^2 + \\rho^2}}\n\nVector form\n\nThe field itself is a vector quantity:\n\n\\mathbf{B}(\\mathbf{m}, \\mathbf{r}) = \\frac {\\mu_0} {4\\pi} \\left(\\frac{3(\\mathbf{m}\\cdot\\hat{\\mathbf{r}})\\hat{\\mathbf{r}}-\\mathbf{m}}{r^3}\\right) + \\frac{2\\mu_0}{3}\\mathbf{m}\\delta^3(\\mathbf{r})\n\nwhere\n\nB is the field\nr is the vector from the position of the dipole to the position where the field is being measured\nr is the absolute value of r: the distance from the dipole\nr̂ =  is the unit vector parallel to r;\nm is the (vector) dipole moment\nμ0 is the permeability of free space\nδ3 is the three-dimensional delta function.δ3(r) = 0 except at , so this term is ignored in multipole expansion.\nThis is exactly the field of a point dipole, exactly the dipole term in the multipole expansion of an arbitrary field, and approximately the field of any dipole-like configuration at large distances.\n\nMagnetic vector potential\n\nThe vector potential A of a magnetic dipole is\n\n\\mathbf{A}(\\mathbf{r}) = \\frac {\\mu_0} {4\\pi} \\frac{\\mathbf{m}\\times\\hat{\\mathbf{r}}}{r^2}\n\nwith the same definitions as above.\n\nField from an electric dipole\n\nThe electrostatic potential at position r due to an electric dipole at the origin is given by:\n\n \\Phi(\\mathbf{r}) = \\frac{1}{4\\pi\\varepsilon_0}\\,\\frac{\\mathbf{p}\\cdot\\hat{\\mathbf{r}}}{r^2}\n\nwhere\n\\hat{\\mathbf{r}} is a unit vector in the direction of r, p is the (vector) dipole moment, and ε0 is the permittivity of free space.\n\nThis term appears as the second term in the multipole expansion of an arbitrary electrostatic potential Φ(r). If the source of Φ(r) is a dipole, as it is assumed here, this term is  the only non-vanishing term in the multipole expansion of Φ(r). The electric field from a dipole can be found from the gradient of this potential:\n\n \\mathbf{E} - \\nabla \\Phi \n\\frac {1} {4\\pi\\epsilon_0} \\left(\\frac{3(\\mathbf{p}\\cdot\\hat{\\mathbf{r}})\\hat{\\mathbf{r}}-\\mathbf{p}}{r^3}\\right) - \\frac{1}{3\\epsilon_0}\\mathbf{p}\\delta^3(\\mathbf{r})\n\nwhere E is the electric field and δ3 is the 3-dimensional delta function. This is formally identical to the magnetic H field of a point magnetic dipole with only a few names changed.\n\nTorque on a dipole\n\nSince the direction of an electric field is defined as the direction of the force on a positive charge, electric field lines point away from a positive charge and toward a negative charge.\n\nWhen placed in an electric or magnetic field, equal but opposite forces arise on each side of the dipole creating a torque :\n\n \\boldsymbol{\\tau} = \\mathbf{p} \\times \\mathbf{E}\nfor an electric dipole moment p (in coulomb-meters), or\n\n \\boldsymbol{\\tau} = \\mathbf{m} \\times \\mathbf{B}\nfor a magnetic dipole moment m (in ampere-square meters).\n\nThe resulting torque will tend to align the dipole with the applied field, which in the case of an electric dipole, yields a potential energy of\n\n U = -\\mathbf{p} \\cdot \\mathbf{E}.\n\nThe energy of a magnetic dipole is similarly\n\n U = -\\mathbf{m} \\cdot \\mathbf{B}.\n\nDipole radiation\n\nIn addition to dipoles in electrostatics, it is also common to consider an electric or magnetic dipole that is oscillating in time. It is an extension, or a more physical next-step, to spherical wave radiation.\n\nIn particular, consider a harmonically oscillating electric dipole, with angular frequency ω and a dipole moment p0 along the ẑ direction of the form\n\\mathbf{p}(\\mathbf{r},t)\\mathbf{p}(\\mathbf{r})e^{-i\\omega t}  \n p_0\\hat{\\mathbf{z}}e^{-i\\omega t} .\n\nIn vacuum, the exact field produced by this oscillating dipole can be derived using the retarded potential formulation as:\n\n\\mathbf{E} = \\frac{1}{4\\pi\\varepsilon_0} \\left\\{ \\frac{\\omega^2}{c^2 r}\n( \\hat{\\mathbf{r}} \\times \\mathbf{p} ) \\times \\hat{\\mathbf{r}}\n+ \\left( \\frac{1}{r^3} - \\frac{i\\omega}{cr^2} \\right) \\left[ 3 \\hat{\\mathbf{r}} (\\hat{\\mathbf{r}} \\cdot \\mathbf{p}) - \\mathbf{p} \\right]  \\right\\} e^{i\\omega r/c} e^{-i\\omega t}\n\n\\mathbf{B} = \\frac{\\omega^2}{4\\pi\\varepsilon_0 c^3} \\hat{\\mathbf{r}} \\times \\mathbf{p} \\left( 1 - \\frac{c}{i\\omega r} \\right) \\frac{e^{i\\omega r/c}}{r} e^{-i\\omega t}.\n\nFor  ≫ 1, the far-field takes the simpler form of a radiating \"spherical\" wave, but with angular dependence embedded in the cross-product:David J. Griffiths, Introduction to Electrodynamics, Prentice Hall, 1999, page 447\n\n\\mathbf{B} = \\frac{\\omega^2}{4\\pi\\varepsilon_0 c^3} (\\hat{\\mathbf{r}} \\times \\mathbf{p}) \\frac{e^{i\\omega (r/c-t)}}{r}\n = \\frac{\\omega^2 \\mu_0 p_0 }{4\\pi  c} (\\hat{\\mathbf{r}} \\times \\hat{\\mathbf{z}}) \\frac{e^{i\\omega (r/c-t)}}{r}\n = -\\frac{\\omega^2 \\mu_0 p_0 }{4\\pi c} \\sin\\theta \\frac{e^{i\\omega (r/c-t)}}{r} \\mathbf{\\hat{\\phi} }\n\n\\mathbf{E} = c \\mathbf{B} \\times \\hat{\\mathbf{r}}\n= -\\frac{\\omega^2 \\mu_0 p_0 }{4\\pi} \\sin\\theta (\\hat{\\phi} \\times \\mathbf{\\hat{r} } )\\frac{e^{i\\omega (r/c-t)}}{r}\n= -\\frac{\\omega^2 \\mu_0 p_0 }{4\\pi} \\sin\\theta \\frac{e^{i\\omega (r/c-t)}}{r} \\hat{\\theta}.\n\nThe time-averaged Poynting vector\n\n \\langle \\mathbf{S} \\rangle = \\bigg(\\frac{\\mu_0p_0^2\\omega^4}{32\\pi^2 c}\\bigg) \\frac{\\sin^2\\theta}{r^2} \\mathbf{\\hat{r}}\n\nis not distributed isotropically, but concentrated around the directions lying perpendicular to the dipole moment, as a result of the non-spherical electric and magnetic waves. In fact, the spherical harmonic function (sin θ) responsible for such toroidal angular distribution is precisely the l = 1 \"p\" wave.\n\nThe total time-average power radiated by the field can then be derived from the Poynting vector as\n\nP = \\frac{\\mu_0 \\omega^4 p_0^2}{12\\pi c}.\n\nNotice that the dependence of the power on the fourth power of the frequency of the radiation is in accordance with the Rayleigh scattering, and the underlying effects why the sky consists of mainly blue colour.\n\nA circular polarized dipole is described as a superposition of two linear dipoles. Dipole. http://en.wikipedia.org/?curid=8378."
  }
}
