{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=599",
  "eid" : "8758c170-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778306823,
  "textBody" : "Afroasiatic (Afro-Asiatic), also known as Afrasian and traditionally as Hamito-Semitic (Chamito-Semitic) or Semito-Hamitic,Robert Hetzron, \"Afroasiatic Languages\" in Bernard Comrie, The World's Major Languages, 2009, , p. 545 is a large language family of about 300 languages and dialects.[http://www.ethnologue.com/show_family.asp?subid\n52-16 Ethnologue family tree for Afroasiatic languages] It includes languages spoken predominantly in West Asia, North Africa, the Horn of Africa and parts of the Sahel.\n\nAfroasiatic languages have over 350 million native speakers, the fourth largest number of any language family (after Indo-European, Sino-Tibetan and Niger–Congo).[http://www.ethnologue.com/statistics/family Summary by language family] The phylum has six branches: Berber, Chadic, Cushitic, Egyptian, Omotic and Semitic. \n\nBy far the most widely spoken Afroasiatic language is Arabic. A language within the Semitic branch, it includes Modern Standard Arabic as well as spoken colloquial varieties. Arabic has around 290 million native speakers, who are concentrated primarily in West Asia, North Africa and the Horn of Africa.https://www.ethnologue.com/language/ara\n\nOther widely spoken Afroasiatic languages include:\n* Hausa (Chadic branch), the dominant language of northern Nigeria, Ghana, and southern Niger, spoken as a first language by over 27 million people and used as a lingua franca by another 20 million across West Africa and the Sahel[http://www.ethnologue.com/show_language.asp?code\nhau Ethnologue - Hausa]\n* Oromo (Cushitic branch), spoken in Ethiopia and Kenya by around 33 million people total\n* Amharic (Semitic branch), spoken in Ethiopia, with over 25 million native speakers in addition to millions of other Ethiopians speaking it as a second language\n* Somali (Cushitic branch), spoken by 15 million people in Somalia, Djibouti, eastern Ethiopia and northeastern Kenya\n* Hebrew (Semitic branch), spoken by around 9 million people in Israel and worldwide\n* Tigrinya (Semitic branch), spoken by around 6.9 million people in Eritrea and Ethiopia\n* Kabyle (Berber branch), spoken by around 5 million people in Algeria.\n* Central Atlas Tamazight (Berber branch), spoken by around 2.49 million people in Morocco\n* Neo-Aramaic languages (Semitic branch), spoken by about 550,000 people worldwide.Nordhoff, Sebastian; Hammarström, Harald; Forkel, Robert; Haspelmath, Martin, eds. (2013). \"Northeastern Neo-Aramaic\". Glottolog 2.2. Leipzig: Max Planck Institute for Evolutionary Anthropology. This is not just one language — It includes a number of subdivisions, with Assyrian Neo-Aramaic being the most spoken variety (232,300).Beyer, Klaus; John F. Healey (trans.) (1986). The Aramaic Language: its distribution and subdivisions. Göttingen: Vandenhoeck und Ruprecht. p. 44. .\n\nIn addition to languages spoken today, Afroasiatic includes several important ancient languages, such as Ancient Egyptian, Akkadian, Biblical Hebrew and Old Aramaic. It is debated when and where the original homeland of the Afroasiatic family existed. Proposed locations include North Africa, the Horn of Africa, the Eastern Sahara and the Levant.\n\nEtymology\n\nDuring the early 1800s, linguists grouped the Berber, Cushitic and Egyptian languages within a \"Hamitic\" phylum, in acknowledgement of these languages' genetic relation with each other and with those in the Semitic phylum. The terms \"Hamitic\" and \"Semitic\" were etymologically derived from the Book of Genesis, which describes various Biblical tribes descended from Ham and Shem, two sons of Noah. By the 1860s, the main constituent elements within the broader Afroasiatic family had been worked out.\n\nThe scholar Friedrich Müller introduced the name \"Hamito-Semitic\" for the entire family in his Grundriss der Sprachwissenschaft (1876). Maurice Delafosse (1914) later coined the term \"Afroasiatic\" (often now spelled \"Afro-Asiatic\"). However, it did not come into general use until Joseph Greenberg (1950) formally proposed its adoption. In doing so, Greenberg sought to emphasize the fact that Afroasiatic spanned the continents of both Africa and Asia.\n\nIndividual scholars have also called the family \"Erythraean\" (Tucker 1966) and \"Lisramic\" (Hodge 1972). In lieu of \"Hamito-Semitic\", the Russian linguist Igor Diakonoff later suggested the term \"Afrasian\", meaning \"half African, half Asiatic\", in reference to the geographic distribution of the family's constituent languages.\n\nThe term \"Hamito-Semitic\" remains in use in the academic traditions of some European countries.\n\nDistribution and branches\n\nThe Afroasiatic language family is usually considered to include the following branches:\n* Berber\n* Chadic\n* Cushitic\n* Egyptian\n* Omotic\n* Semitic\n\nAlthough there is general agreement on these six families, there are some points of disagreement among linguists who study Afroasiatic. In particular:\n* The Omotic language branch is the most controversial member of Afroasiatic, because the grammatical formatives that most linguists have given greatest weight in classifying languages in the family \"are either absent or distinctly wobbly\" (Hayward 1995). Greenberg (1963) and others considered it a subgroup of Cushitic, whereas others have raised doubts about it being part of Afroasiatic at all (e.g. Theil 2006).Sands, Bonny (2009). \"Africa’s Linguistic Diversity\". Language and Linguistics Compass 3/2 (2009): 559–580, 10.1111/j.1749-818x.2008.00124.x\n* The Afroasiatic identity of Ongota is also broadly questioned, as is its position within Afroasiatic among those who accept it, due to the \"mixed\" appearance of the language and a paucity of research and data. Harold Fleming (2006) proposes that Ongota constitutes a separate branch of Afroasiatic.[http://www.harrassowitz-verlag.de/pcgi/a.cgi?ausgabeindex&T\n1235007315045{haupt_harrassowitzhttp://www.harrassowitz-verlag.de/title_3277.ahtml?T\n1235007315045} Harrassowitz Verlag - The Harrassowitz Publishing House] Bonny Sands (2009) believes the most convincing proposal is by Savà and Tosco (2003), namely that Ongota is an East Cushitic language with a Nilo-Saharan substratum. In other words, it would appear that the Ongota people once spoke a Nilo-Saharan language but then shifted to speaking a Cushitic language but retained some characteristics of their earlier Nilo-Saharan language.\n* Beja is sometimes listed as a separate branch of Afroasiatic but is more often included in the Cushitic branch, which has a high degree of internal diversity.\n* Whether the various branches of Cushitic actually form a language family is sometimes questioned, but not their inclusion in Afroasiatic itself.\n* There is no consensus on the interrelationships of the five non-Omotic branches of Afroasiatic (see § Subgrouping below). This situation is not unusual, even among long-established language families: there are also many disagreements concerning the internal classification of the Indo-European languages, for instance.\n* Meroitic has been proposed as an unclassified Afroasiatic language, because it shares the phonotactics characteristic of the family, but there is not enough evidence to secure a classification.\n\nClassification history\n\nIn the 9th century, the Hebrew grammarian Judah ibn Quraysh of Tiaret in Algeria was the first to link two branches of Afroasiatic together; he perceived a relationship between Berber and Semitic. He knew of Semitic through his study of Arabic, Hebrew, and Aramaic.\n\nIn the course of the 19th century, Europeans also began suggesting such relationships. In 1844, Theodor Benfey suggested a language family consisting of Semitic, Berber, and Cushitic (calling the latter \"Ethiopic\"). In the same year, T.N. Newman suggested a relationship between Semitic and Hausa, but this would long remain a topic of dispute and uncertainty.\n\nFriedrich Müller named the traditional Hamito-Semitic family in 1876 in his Grundriss der Sprachwissenschaft (\"Outline of Linguistics\"), and defined it as consisting of a Semitic group plus a \"Hamitic\" group containing Egyptian, Berber, and Cushitic; he excluded the Chadic group. It was the Egyptologist Karl Richard Lepsius (1810–1884) who restricted Hamitic to the non-Semitic languages in Africa, which are characterized by a grammatical gender system. This \"Hamitic language group\" was proposed to unite various, mainly North-African, languages, including the Ancient Egyptian language, the Berber languages, the Cushitic languages, the Beja language, and the Chadic languages. Unlike Müller, Lepsius considered that Hausa and Nama were part of the Hamitic group. These classifications relied in part on non-linguistic anthropological and racial arguments. Both authors used the skin-color, mode of subsistence, and other characteristics of native speakers as part of their arguments that particular languages should be grouped together.Merritt Ruhlen, A Guide to the World's Languages: Classification, Stanford University Press, 1991, pp. 80–1\n\nIn 1912, Carl Meinhof published Die Sprachen der Hamiten (\"The Languages of the Hamites\"), in which he expanded Lepsius's model, adding the Fula, Maasai, Bari, Nandi, Sandawe and Hadza languages to the Hamitic group. Meinhof's model was widely supported into the 1940s. Meinhof's system of classification of the Hamitic languages was based on a belief that \"speakers of Hamitic became largely coterminous with cattle herding peoples with essentially Caucasian origins, intrinsically different from and superior to the 'Negroes of Africa'.\"Kevin Shillington, Encyclopedia of African History, CRC Press, 2005, p.797 But, in the case of the so-called Nilo-Hamitic languages (a concept he introduced), it was based on the typological feature of gender and a \"fallacious theory of language mixture.\" Meinhof did this although earlier work by scholars such as Lepsius and Johnston had substantiated that the languages which he would later dub \"Nilo-Hamitic\" were in fact Nilotic languages, with numerous similarities in vocabulary to other Nilotic languages.Merritt Ruhlen, A Guide to the World's Languages, (Stanford University Press: 1991), p.109\n\nLeo Reinisch (1909) had already proposed linking Cushitic and Chadic, while urging their more distant affinity with Egyptian and Semitic. However, his suggestion found little acceptance. Marcel Cohen (1924) rejected the idea of a distinct \"Hamitic\" subgroup, and included Hausa (a Chadic language) in his comparative Hamito-Semitic vocabulary. Finally, Joseph Greenberg's 1950 work led to the widespread rejection of \"Hamitic\" as a language category by linguists. Greenberg refuted Meinhof's linguistic theories, and rejected the use of racial and social evidence. In dismissing the notion of a separate \"Nilo-Hamitic\" language category in particular, Greenberg was \"returning to a view widely held a half century earlier.\" He consequently rejoined Meinhof's so-called Nilo-Hamitic languages with their appropriate Nilotic siblings. He also added (and sub-classified) the Chadic languages, and proposed the new name Afroasiatic for the family. Almost all scholars have accepted this classification as the new and continued consensus.\n\nGreenberg's model was fully developed in his book The Languages of Africa (1963), in which he reassigned most of Meinhof's additions to Hamitic to other language families, notably Nilo-Saharan. Following Isaac Schapera and rejecting Meinhof, he classified the Hottentot language as a member of the Central Khoisan languages. To Khoisan he also added the Tanzanian Hadza and Sandawe, though this view remains controversial since some scholars consider these languages to be linguistic isolates.Sands, Bonny E. (1998) 'Eastern and Southern African Khoisan: evaluating claims of distant linguistic relationships.' Quellen zur Khoisan-Forschung 14. Köln: Köppe.Ruhlen, p.117 Despite this, Greenberg's model remains the basis for modern classifications of languages spoken in Africa, and the Hamitic category (and its extension to Nilo-Hamitic) has no part in this.\n\nSince the three traditional branches of the Hamitic languages (Berber, Cushitic and Egyptian) have not been shown to form an exclusive (monophyletic) phylogenetic unit of their own, separate from other Afroasiatic languages, linguists no longer use the term in this sense. Each of these branches is instead now regarded as an independent subgroup of the larger Afroasiatic family.\n\nIn 1969, Harold Fleming proposed that what had previously been known as Western Cushitic is an independent branch of Afroasiatic, suggesting for it the new name Omotic. This proposal and name have met with widespread acceptance.\n\nSeveral scholars, including Harold Fleming and Robert Hetzron, have since questioned the traditional inclusion of Beja in Cushitic.\n\nGlottolog does not accept that the inclusion or even unity of Omotic has been established, nor that of Ongota or the unclassified Kujarge. It therefore splits off the following groups as small families: South Omotic, Mao, Dizoid, Gonga–Gimojan (North Omotic apart from the preceding), Ongota, Kujarge.\n\nSubgrouping\n\nLittle agreement exists on the subgrouping of the five or six branches of Afroasiatic: Semitic, Egyptian, Berber, Chadic, Cushitic, and Omotic. However, Christopher Ehret (1979), Harold Fleming (1981), and Joseph Greenberg (1981) all agree that the Omotic branch split from the rest first.\n\nOtherwise:\n* Paul Newman (1980) groups Berber with Chadic and Egyptian with Semitic, while questioning the inclusion of Omotic in Afroasiatic. Rolf Theil (2006) concurs with the exclusion of Omotic, but does not otherwise address the structure of the family.[http://www.uio.no/studier/emner/hf/iln/LING2110/v07/THEIL%20Is%20Omotic%20Afroasiatic.pdf Is Omotic Afroasiatic? (In Norwegian)]\n* Harold Fleming (1981) divides non-Omotic Afroasiatic, or \"Erythraean\", into three groups, Cushitic, Semitic, and Chadic-Berber-Egyptian. He later added Semitic and Beja to Chadic-Berber-Egyptian and tentatively proposed Ongota as a new third branch of Erythraean. He thus divided Afroasiatic into two major branches, Omotic and Erythraean, with Erythraean consisting of three sub-branches, Cushitic, Chadic-Berber-Egyptian-Semitic-Beja, and Ongota.\n* Like Harold Fleming, Christopher Ehret (1995: 490) divides Afroasiatic into two branches, Omotic and Erythrean. He divides Omotic into two branches, North Omotic and South Omotic. He divides Erythrean into Cushitic, comprising Beja, Agaw, and East-South Cushitic, and North Erythrean, comprising Chadic and \"Boreafrasian.\" According to his classification, Boreafrasian consists of Egyptian, Berber, and Semitic.\n* Vladimir Orel and Olga Stolbova (1995) group Berber with Semitic and Chadic with Egyptian. They split up Cushitic into five or more independent branches of Afroasiatic, viewing Cushitic as a Sprachbund rather than a language family.\n* Igor M. Diakonoff (1996) subdivides Afroasiatic in two, grouping Berber, Cushitic, and Semitic together as East-West Afrasian (ESA), and Chadic with Egyptian as North-South Afrasian (NSA). He excludes Omotic from Afroasiatic.\n* Lionel Bender (1997) groups Berber, Cushitic, and Semitic together as \"Macro-Cushitic\". He regards Chadic and Omotic as the branches of Afroasiatic most remote from the others.\n* Alexander Militarev (2000), on the basis of lexicostatistics, groups Berber with Chadic and both more distantly with Semitic, as against Cushitic and Omotic. He places Ongota in South Omotic.\n\nPosition among the world's languages\n\nAfroasiatic is one of the four major language families spoken in Africa identified by Joseph Greenberg in his book The Languages of Africa (1963). It is one of the few whose speech area is transcontinental, with languages from Afroasiatic's Semitic branch also spoken in the Middle East and Europe.\n\nThere are no generally accepted relations between Afroasiatic and any other language family. However, several proposals grouping Afroasiatic with one or more other language families have been made. The best-known of these are the following:\n* Hermann Möller (1906) argued for a relation between Semitic and the Indo-European languages. This proposal was accepted by a few linguists (e.g. Holger Pedersen and Louis Hjelmslev). (For a fuller account, see Indo-Semitic languages.) However, the theory has little currency today, although most linguists do not deny the existence of grammatical similarities between both families (such as grammatical gender, noun-adjective agreement, three-way number distinction, and vowel alternation as a means of derivation).\n* Apparently influenced by Möller (a colleague of his at the University of Copenhagen), Holger Pedersen included Hamito-Semitic (the term replaced by Afroasiatic) in his proposed Nostratic macro-family (cf. Pedersen 1931:336–338), also included the Indo-European, Uralic, Altaic, Yukaghir languages, and Dravidian Languages. This inclusion was retained by subsequent Nostraticists, starting with Vladislav Illich-Svitych and Aharon Dolgopolsky.\n* Joseph Greenberg (2000–2002) did not reject a relationship of Afroasiatic to these other languages, but he considered it more distantly related to them than they were to each other, grouping instead these other languages in a separate macro-family, which he called Eurasiatic, and to which he added Chukotian, Gilyak, Korean, Japanese-Ryukyuan, Eskimo–Aleut, and Ainu.\n* Most recently, Sergei Starostin's school has accepted Eurasiatic as a subgroup of Nostratic, with Afroasiatic, Dravidian and Kartvelian in Nostratic outside of Eurasiatic. The even larger Borean super-family contains Nostratic as well as Dené-Caucasian and Austric.\n\nDate of Afroasiatic\n\nThe earliest written evidence of an Afroasiatic language is an Ancient Egyptian inscription dated to c. 3400 BC (5,400 years ago).[http://www.archaeology.org/9903/newsbriefs/egypt.html Earliest Egyptian Glyphs] Symbols on Gerzean (Naqada II) pottery resembling Egyptian hieroglyphs date back to c. 4000 BC, suggesting an earlier possible dating. This gives us a minimum date for the age of Afroasiatic. However, Ancient Egyptian is highly divergent from Proto-Afroasiatic (Trombetti 1905: 1–2), and considerable time must have elapsed in between them. Estimates of the date at which the Proto-Afroasiatic language was spoken vary widely. They fall within a range between approximately 7,500 BC (9,500 years ago), and approximately 16,000 BC (18,000 years ago). According to Igor M. Diakonoff (1988: 33n), Proto-Afroasiatic was spoken c. 10,000 BC. Christopher Ehret (2002: 35–36) asserts that Proto-Afroasiatic was spoken c. 11,000 BC at the latest, and possibly as early as c. 16,000 BC. These dates are older than those associated with other proto-languages.\n\nAfroasiatic Urheimat\n\nThe term Afroasiatic Urheimat (Urheimat meaning \"original homeland\" in German) refers to the hypothetical place where Proto-Afroasiatic language speakers lived in a single linguistic community, or complex of communities, before this original language dispersed geographically and divided into distinct languages. Afroasiatic languages are today primarily spoken in West Asia, North Africa, the Horn of Africa, and parts of the Sahel. Their distribution seems to have been influenced by the Sahara pump operating over the last 10,000 years.\n\nThere is no agreement when or where the original homeland of this language family existed. Proposed locations include North Africa, the Horn of Africa, the Eastern Sahara,Blench R (2006) Archaeology, Language, and the African Past, Rowman Altamira, , , https://books.google.com/books?id\nesFy3Po57A8CEhret C, Keita SOY, Newman P (2004) The Origins of Afroasiatic a response to Diamond and Bellwood (2003) in the Letters of SCIENCE 306, no. 5702, p. 1680 Bernal M (1987) Black Athena: the Afroasiatic roots of classical civilization, Rutgers University Press, , . https://books.google.com/books?idyFLm_M_OdK4CBender ML (1997), Upside Down Afrasian, Afrikanistische Arbeitspapiere 50, pp. 19-34Militarev A (2005) [http://starling.rinet.ru/Texts/fleming.pdf Once more about glottochronology and comparative method: the Omotic-Afrasian case, Аспекты компаративистики - 1 (Aspects of comparative linguistics - 1)]. FS S. Starostin. Orientalia et Classica II (Moscow), p. 339-408. and the Levant.\n\nSimilarities in grammar and syntax\n\nWidespread (though not universal) features of the Afroasiatic languages include:\n* A set of emphatic consonants, variously realized as glottalized, pharyngealized, or implosive.\n* VSO typology with SVO tendencies.\n* A two-gender system in the singular, with the feminine marked by the sound /t/.\n* All Afroasiatic subfamilies show evidence of a causative affix s.\n* Semitic, Berber, Cushitic (including Beja), and Chadic support possessive suffixes.\n*  Nisba derivation in -j (earlier Egyptian) or -ī (Semitic)Carsten Peust,  [http://www.peust.de/2012_afroasiatic.pdf \"On the subgrouping of Afroasiatic\"], LingAeg 20 (2012), 221-251 (p. 243).\n* Morphology in which words inflect by changes within the root (vowel changes or gemination) as well as with prefixes and suffixes.\n\nOne of the most remarkable shared features among the Afroasiatic languages is the prefixing verb conjugation (see the table at the start of this section), with a distinctive pattern of prefixes beginning with /ʔ t n y/, and in particular a pattern whereby third-singular masculine /y-/ is opposed to third-singular feminine and second-singular /t-/.\n\nAccording to Ehret (1996), tonal languages appear in the Omotic and Chadic branches of Afroasiatic, as well as in certain Cushitic languages. The Semitic, Berber and Egyptian branches generally do not use tones phonemically.\n\nShared vocabulary\n\nThe following are some examples of Afroasiatic cognates, including ten pronouns, three nouns, and three verbs.\n\nSource: Christopher Ehret, Reconstructing Proto-Afroasiatic (Berkeley: University of California Press, 1995).\n\nNote: Ehret does not make use of Berber in his etymologies, stating (1995: 12): \"the kind of extensive reconstruction of proto-Berber lexicon that might help in sorting through alternative possible etymologies is not yet available.\" The Berber cognates here are taken from previous version of table in this article and need to be completed and referenced.\n\nAbbreviations: NOm 'North Omotic', SOm \n 'South Omotic'. MSA 'Modern South Arabian', PSC \n 'Proto-Southern Cushitic', PSom-II 'Proto-Somali, stage 2'. masc. \n 'masculine', fem. 'feminine', sing. \n 'singular', pl. 'plural'. 1s. \n 'first person singular', 2s. = 'second person singular'.\n\nSymbols: Following Ehret (1995: 70), a caron ˇ over a vowel indicates rising tone, and a circumflex ^ over a vowel indicates falling tone. V indicates a vowel of unknown quality. Ɂ indicates a glottal stop. * indicates reconstructed forms based on comparison of related languages.\n\nThere are two etymological dictionaries of Afroasiatic, one by Christopher Ehret, and one by Vladimir Orel and Olga Stolbova. The two dictionaries disagree on almost everything. The following table contains the thirty roots or so (out of thousands) that represent a fragile consensus of present research:\n\nEtymological bibliography\n\nSome of the main sources for Afroasiatic etymologies include:\n* Cohen, Marcel. 1947. Essai comparatif sur le vocabulaire et la phonétique du chamito-sémitique. Paris: Champion.\n* Diakonoff, Igor M. et al. 1993–1997. \"Historical-comparative vocabulary of Afrasian\", St. Petersburg Journal of African Studies 2–6.\n* Ehret, Christopher. 1995. Reconstructing Proto-Afroasiatic (Proto-Afrasian): Vowels, Tone, Consonants, and Vocabulary (= University of California Publications in Linguistics 126). Berkeley and Los Angeles: University of California Press.\n* Orel, Vladimir E. and Olga V. Stolbova. 1995. Hamito-Semitic Etymological Dictionary: Materials for a Reconstruction. Leiden: Brill. .",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Afroasiatic languages" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=599" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Afroasiatic (Afro-Asiatic), also known as Afrasian and traditionally as Hamito-Semitic (Chamito-Semitic) or Semito-Hamitic,Robert Hetzron, \"Afroasiatic Languages\" in Bernard Comrie, The World's Major Languages, 2009, , p. 545 is a large language family of about 300 languages and dialects.[http://www.ethnologue.com/show_family.asp?subid\n52-16 Ethnologue family tree for Afroasiatic languages] It includes languages spoken predominantly in West Asia, North Africa, the Horn of Africa and parts of the Sahel.\n\nAfroasiatic languages have over 350 million native speakers, the fourth largest number of any language family (after Indo-European, Sino-Tibetan and Niger–Congo).[http://www.ethnologue.com/statistics/family Summary by language family] The phylum has six branches: Berber, Chadic, Cushitic, Egyptian, Omotic and Semitic. \n\nBy far the most widely spoken Afroasiatic language is Arabic. A language within the Semitic branch, it includes Modern Standard Arabic as well as spoken colloquial varieties. Arabic has around 290 million native speakers, who are concentrated primarily in West Asia, North Africa and the Horn of Africa.https://www.ethnologue.com/language/ara\n\nOther widely spoken Afroasiatic languages include:\n* Hausa (Chadic branch), the dominant language of northern Nigeria, Ghana, and southern Niger, spoken as a first language by over 27 million people and used as a lingua franca by another 20 million across West Africa and the Sahel[http://www.ethnologue.com/show_language.asp?code\nhau Ethnologue - Hausa]\n* Oromo (Cushitic branch), spoken in Ethiopia and Kenya by around 33 million people total\n* Amharic (Semitic branch), spoken in Ethiopia, with over 25 million native speakers in addition to millions of other Ethiopians speaking it as a second language\n* Somali (Cushitic branch), spoken by 15 million people in Somalia, Djibouti, eastern Ethiopia and northeastern Kenya\n* Hebrew (Semitic branch), spoken by around 9 million people in Israel and worldwide\n* Tigrinya (Semitic branch), spoken by around 6.9 million people in Eritrea and Ethiopia\n* Kabyle (Berber branch), spoken by around 5 million people in Algeria.\n* Central Atlas Tamazight (Berber branch), spoken by around 2.49 million people in Morocco\n* Neo-Aramaic languages (Semitic branch), spoken by about 550,000 people worldwide.Nordhoff, Sebastian; Hammarström, Harald; Forkel, Robert; Haspelmath, Martin, eds. (2013). \"Northeastern Neo-Aramaic\". Glottolog 2.2. Leipzig: Max Planck Institute for Evolutionary Anthropology. This is not just one language — It includes a number of subdivisions, with Assyrian Neo-Aramaic being the most spoken variety (232,300).Beyer, Klaus; John F. Healey (trans.) (1986). The Aramaic Language: its distribution and subdivisions. Göttingen: Vandenhoeck und Ruprecht. p. 44. .\n\nIn addition to languages spoken today, Afroasiatic includes several important ancient languages, such as Ancient Egyptian, Akkadian, Biblical Hebrew and Old Aramaic. It is debated when and where the original homeland of the Afroasiatic family existed. Proposed locations include North Africa, the Horn of Africa, the Eastern Sahara and the Levant.\n\nEtymology\n\nDuring the early 1800s, linguists grouped the Berber, Cushitic and Egyptian languages within a \"Hamitic\" phylum, in acknowledgement of these languages' genetic relation with each other and with those in the Semitic phylum. The terms \"Hamitic\" and \"Semitic\" were etymologically derived from the Book of Genesis, which describes various Biblical tribes descended from Ham and Shem, two sons of Noah. By the 1860s, the main constituent elements within the broader Afroasiatic family had been worked out.\n\nThe scholar Friedrich Müller introduced the name \"Hamito-Semitic\" for the entire family in his Grundriss der Sprachwissenschaft (1876). Maurice Delafosse (1914) later coined the term \"Afroasiatic\" (often now spelled \"Afro-Asiatic\"). However, it did not come into general use until Joseph Greenberg (1950) formally proposed its adoption. In doing so, Greenberg sought to emphasize the fact that Afroasiatic spanned the continents of both Africa and Asia.\n\nIndividual scholars have also called the family \"Erythraean\" (Tucker 1966) and \"Lisramic\" (Hodge 1972). In lieu of \"Hamito-Semitic\", the Russian linguist Igor Diakonoff later suggested the term \"Afrasian\", meaning \"half African, half Asiatic\", in reference to the geographic distribution of the family's constituent languages.\n\nThe term \"Hamito-Semitic\" remains in use in the academic traditions of some European countries.\n\nDistribution and branches\n\nThe Afroasiatic language family is usually considered to include the following branches:\n* Berber\n* Chadic\n* Cushitic\n* Egyptian\n* Omotic\n* Semitic\n\nAlthough there is general agreement on these six families, there are some points of disagreement among linguists who study Afroasiatic. In particular:\n* The Omotic language branch is the most controversial member of Afroasiatic, because the grammatical formatives that most linguists have given greatest weight in classifying languages in the family \"are either absent or distinctly wobbly\" (Hayward 1995). Greenberg (1963) and others considered it a subgroup of Cushitic, whereas others have raised doubts about it being part of Afroasiatic at all (e.g. Theil 2006).Sands, Bonny (2009). \"Africa’s Linguistic Diversity\". Language and Linguistics Compass 3/2 (2009): 559–580, 10.1111/j.1749-818x.2008.00124.x\n* The Afroasiatic identity of Ongota is also broadly questioned, as is its position within Afroasiatic among those who accept it, due to the \"mixed\" appearance of the language and a paucity of research and data. Harold Fleming (2006) proposes that Ongota constitutes a separate branch of Afroasiatic.[http://www.harrassowitz-verlag.de/pcgi/a.cgi?ausgabeindex&T\n1235007315045{haupt_harrassowitzhttp://www.harrassowitz-verlag.de/title_3277.ahtml?T\n1235007315045} Harrassowitz Verlag - The Harrassowitz Publishing House] Bonny Sands (2009) believes the most convincing proposal is by Savà and Tosco (2003), namely that Ongota is an East Cushitic language with a Nilo-Saharan substratum. In other words, it would appear that the Ongota people once spoke a Nilo-Saharan language but then shifted to speaking a Cushitic language but retained some characteristics of their earlier Nilo-Saharan language.\n* Beja is sometimes listed as a separate branch of Afroasiatic but is more often included in the Cushitic branch, which has a high degree of internal diversity.\n* Whether the various branches of Cushitic actually form a language family is sometimes questioned, but not their inclusion in Afroasiatic itself.\n* There is no consensus on the interrelationships of the five non-Omotic branches of Afroasiatic (see § Subgrouping below). This situation is not unusual, even among long-established language families: there are also many disagreements concerning the internal classification of the Indo-European languages, for instance.\n* Meroitic has been proposed as an unclassified Afroasiatic language, because it shares the phonotactics characteristic of the family, but there is not enough evidence to secure a classification.\n\nClassification history\n\nIn the 9th century, the Hebrew grammarian Judah ibn Quraysh of Tiaret in Algeria was the first to link two branches of Afroasiatic together; he perceived a relationship between Berber and Semitic. He knew of Semitic through his study of Arabic, Hebrew, and Aramaic.\n\nIn the course of the 19th century, Europeans also began suggesting such relationships. In 1844, Theodor Benfey suggested a language family consisting of Semitic, Berber, and Cushitic (calling the latter \"Ethiopic\"). In the same year, T.N. Newman suggested a relationship between Semitic and Hausa, but this would long remain a topic of dispute and uncertainty.\n\nFriedrich Müller named the traditional Hamito-Semitic family in 1876 in his Grundriss der Sprachwissenschaft (\"Outline of Linguistics\"), and defined it as consisting of a Semitic group plus a \"Hamitic\" group containing Egyptian, Berber, and Cushitic; he excluded the Chadic group. It was the Egyptologist Karl Richard Lepsius (1810–1884) who restricted Hamitic to the non-Semitic languages in Africa, which are characterized by a grammatical gender system. This \"Hamitic language group\" was proposed to unite various, mainly North-African, languages, including the Ancient Egyptian language, the Berber languages, the Cushitic languages, the Beja language, and the Chadic languages. Unlike Müller, Lepsius considered that Hausa and Nama were part of the Hamitic group. These classifications relied in part on non-linguistic anthropological and racial arguments. Both authors used the skin-color, mode of subsistence, and other characteristics of native speakers as part of their arguments that particular languages should be grouped together.Merritt Ruhlen, A Guide to the World's Languages: Classification, Stanford University Press, 1991, pp. 80–1\n\nIn 1912, Carl Meinhof published Die Sprachen der Hamiten (\"The Languages of the Hamites\"), in which he expanded Lepsius's model, adding the Fula, Maasai, Bari, Nandi, Sandawe and Hadza languages to the Hamitic group. Meinhof's model was widely supported into the 1940s. Meinhof's system of classification of the Hamitic languages was based on a belief that \"speakers of Hamitic became largely coterminous with cattle herding peoples with essentially Caucasian origins, intrinsically different from and superior to the 'Negroes of Africa'.\"Kevin Shillington, Encyclopedia of African History, CRC Press, 2005, p.797 But, in the case of the so-called Nilo-Hamitic languages (a concept he introduced), it was based on the typological feature of gender and a \"fallacious theory of language mixture.\" Meinhof did this although earlier work by scholars such as Lepsius and Johnston had substantiated that the languages which he would later dub \"Nilo-Hamitic\" were in fact Nilotic languages, with numerous similarities in vocabulary to other Nilotic languages.Merritt Ruhlen, A Guide to the World's Languages, (Stanford University Press: 1991), p.109\n\nLeo Reinisch (1909) had already proposed linking Cushitic and Chadic, while urging their more distant affinity with Egyptian and Semitic. However, his suggestion found little acceptance. Marcel Cohen (1924) rejected the idea of a distinct \"Hamitic\" subgroup, and included Hausa (a Chadic language) in his comparative Hamito-Semitic vocabulary. Finally, Joseph Greenberg's 1950 work led to the widespread rejection of \"Hamitic\" as a language category by linguists. Greenberg refuted Meinhof's linguistic theories, and rejected the use of racial and social evidence. In dismissing the notion of a separate \"Nilo-Hamitic\" language category in particular, Greenberg was \"returning to a view widely held a half century earlier.\" He consequently rejoined Meinhof's so-called Nilo-Hamitic languages with their appropriate Nilotic siblings. He also added (and sub-classified) the Chadic languages, and proposed the new name Afroasiatic for the family. Almost all scholars have accepted this classification as the new and continued consensus.\n\nGreenberg's model was fully developed in his book The Languages of Africa (1963), in which he reassigned most of Meinhof's additions to Hamitic to other language families, notably Nilo-Saharan. Following Isaac Schapera and rejecting Meinhof, he classified the Hottentot language as a member of the Central Khoisan languages. To Khoisan he also added the Tanzanian Hadza and Sandawe, though this view remains controversial since some scholars consider these languages to be linguistic isolates.Sands, Bonny E. (1998) 'Eastern and Southern African Khoisan: evaluating claims of distant linguistic relationships.' Quellen zur Khoisan-Forschung 14. Köln: Köppe.Ruhlen, p.117 Despite this, Greenberg's model remains the basis for modern classifications of languages spoken in Africa, and the Hamitic category (and its extension to Nilo-Hamitic) has no part in this.\n\nSince the three traditional branches of the Hamitic languages (Berber, Cushitic and Egyptian) have not been shown to form an exclusive (monophyletic) phylogenetic unit of their own, separate from other Afroasiatic languages, linguists no longer use the term in this sense. Each of these branches is instead now regarded as an independent subgroup of the larger Afroasiatic family.\n\nIn 1969, Harold Fleming proposed that what had previously been known as Western Cushitic is an independent branch of Afroasiatic, suggesting for it the new name Omotic. This proposal and name have met with widespread acceptance.\n\nSeveral scholars, including Harold Fleming and Robert Hetzron, have since questioned the traditional inclusion of Beja in Cushitic.\n\nGlottolog does not accept that the inclusion or even unity of Omotic has been established, nor that of Ongota or the unclassified Kujarge. It therefore splits off the following groups as small families: South Omotic, Mao, Dizoid, Gonga–Gimojan (North Omotic apart from the preceding), Ongota, Kujarge.\n\nSubgrouping\n\nLittle agreement exists on the subgrouping of the five or six branches of Afroasiatic: Semitic, Egyptian, Berber, Chadic, Cushitic, and Omotic. However, Christopher Ehret (1979), Harold Fleming (1981), and Joseph Greenberg (1981) all agree that the Omotic branch split from the rest first.\n\nOtherwise:\n* Paul Newman (1980) groups Berber with Chadic and Egyptian with Semitic, while questioning the inclusion of Omotic in Afroasiatic. Rolf Theil (2006) concurs with the exclusion of Omotic, but does not otherwise address the structure of the family.[http://www.uio.no/studier/emner/hf/iln/LING2110/v07/THEIL%20Is%20Omotic%20Afroasiatic.pdf Is Omotic Afroasiatic? (In Norwegian)]\n* Harold Fleming (1981) divides non-Omotic Afroasiatic, or \"Erythraean\", into three groups, Cushitic, Semitic, and Chadic-Berber-Egyptian. He later added Semitic and Beja to Chadic-Berber-Egyptian and tentatively proposed Ongota as a new third branch of Erythraean. He thus divided Afroasiatic into two major branches, Omotic and Erythraean, with Erythraean consisting of three sub-branches, Cushitic, Chadic-Berber-Egyptian-Semitic-Beja, and Ongota.\n* Like Harold Fleming, Christopher Ehret (1995: 490) divides Afroasiatic into two branches, Omotic and Erythrean. He divides Omotic into two branches, North Omotic and South Omotic. He divides Erythrean into Cushitic, comprising Beja, Agaw, and East-South Cushitic, and North Erythrean, comprising Chadic and \"Boreafrasian.\" According to his classification, Boreafrasian consists of Egyptian, Berber, and Semitic.\n* Vladimir Orel and Olga Stolbova (1995) group Berber with Semitic and Chadic with Egyptian. They split up Cushitic into five or more independent branches of Afroasiatic, viewing Cushitic as a Sprachbund rather than a language family.\n* Igor M. Diakonoff (1996) subdivides Afroasiatic in two, grouping Berber, Cushitic, and Semitic together as East-West Afrasian (ESA), and Chadic with Egyptian as North-South Afrasian (NSA). He excludes Omotic from Afroasiatic.\n* Lionel Bender (1997) groups Berber, Cushitic, and Semitic together as \"Macro-Cushitic\". He regards Chadic and Omotic as the branches of Afroasiatic most remote from the others.\n* Alexander Militarev (2000), on the basis of lexicostatistics, groups Berber with Chadic and both more distantly with Semitic, as against Cushitic and Omotic. He places Ongota in South Omotic.\n\nPosition among the world's languages\n\nAfroasiatic is one of the four major language families spoken in Africa identified by Joseph Greenberg in his book The Languages of Africa (1963). It is one of the few whose speech area is transcontinental, with languages from Afroasiatic's Semitic branch also spoken in the Middle East and Europe.\n\nThere are no generally accepted relations between Afroasiatic and any other language family. However, several proposals grouping Afroasiatic with one or more other language families have been made. The best-known of these are the following:\n* Hermann Möller (1906) argued for a relation between Semitic and the Indo-European languages. This proposal was accepted by a few linguists (e.g. Holger Pedersen and Louis Hjelmslev). (For a fuller account, see Indo-Semitic languages.) However, the theory has little currency today, although most linguists do not deny the existence of grammatical similarities between both families (such as grammatical gender, noun-adjective agreement, three-way number distinction, and vowel alternation as a means of derivation).\n* Apparently influenced by Möller (a colleague of his at the University of Copenhagen), Holger Pedersen included Hamito-Semitic (the term replaced by Afroasiatic) in his proposed Nostratic macro-family (cf. Pedersen 1931:336–338), also included the Indo-European, Uralic, Altaic, Yukaghir languages, and Dravidian Languages. This inclusion was retained by subsequent Nostraticists, starting with Vladislav Illich-Svitych and Aharon Dolgopolsky.\n* Joseph Greenberg (2000–2002) did not reject a relationship of Afroasiatic to these other languages, but he considered it more distantly related to them than they were to each other, grouping instead these other languages in a separate macro-family, which he called Eurasiatic, and to which he added Chukotian, Gilyak, Korean, Japanese-Ryukyuan, Eskimo–Aleut, and Ainu.\n* Most recently, Sergei Starostin's school has accepted Eurasiatic as a subgroup of Nostratic, with Afroasiatic, Dravidian and Kartvelian in Nostratic outside of Eurasiatic. The even larger Borean super-family contains Nostratic as well as Dené-Caucasian and Austric.\n\nDate of Afroasiatic\n\nThe earliest written evidence of an Afroasiatic language is an Ancient Egyptian inscription dated to c. 3400 BC (5,400 years ago).[http://www.archaeology.org/9903/newsbriefs/egypt.html Earliest Egyptian Glyphs] Symbols on Gerzean (Naqada II) pottery resembling Egyptian hieroglyphs date back to c. 4000 BC, suggesting an earlier possible dating. This gives us a minimum date for the age of Afroasiatic. However, Ancient Egyptian is highly divergent from Proto-Afroasiatic (Trombetti 1905: 1–2), and considerable time must have elapsed in between them. Estimates of the date at which the Proto-Afroasiatic language was spoken vary widely. They fall within a range between approximately 7,500 BC (9,500 years ago), and approximately 16,000 BC (18,000 years ago). According to Igor M. Diakonoff (1988: 33n), Proto-Afroasiatic was spoken c. 10,000 BC. Christopher Ehret (2002: 35–36) asserts that Proto-Afroasiatic was spoken c. 11,000 BC at the latest, and possibly as early as c. 16,000 BC. These dates are older than those associated with other proto-languages.\n\nAfroasiatic Urheimat\n\nThe term Afroasiatic Urheimat (Urheimat meaning \"original homeland\" in German) refers to the hypothetical place where Proto-Afroasiatic language speakers lived in a single linguistic community, or complex of communities, before this original language dispersed geographically and divided into distinct languages. Afroasiatic languages are today primarily spoken in West Asia, North Africa, the Horn of Africa, and parts of the Sahel. Their distribution seems to have been influenced by the Sahara pump operating over the last 10,000 years.\n\nThere is no agreement when or where the original homeland of this language family existed. Proposed locations include North Africa, the Horn of Africa, the Eastern Sahara,Blench R (2006) Archaeology, Language, and the African Past, Rowman Altamira, , , https://books.google.com/books?id\nesFy3Po57A8CEhret C, Keita SOY, Newman P (2004) The Origins of Afroasiatic a response to Diamond and Bellwood (2003) in the Letters of SCIENCE 306, no. 5702, p. 1680 Bernal M (1987) Black Athena: the Afroasiatic roots of classical civilization, Rutgers University Press, , . https://books.google.com/books?idyFLm_M_OdK4CBender ML (1997), Upside Down Afrasian, Afrikanistische Arbeitspapiere 50, pp. 19-34Militarev A (2005) [http://starling.rinet.ru/Texts/fleming.pdf Once more about glottochronology and comparative method: the Omotic-Afrasian case, Аспекты компаративистики - 1 (Aspects of comparative linguistics - 1)]. FS S. Starostin. Orientalia et Classica II (Moscow), p. 339-408. and the Levant.\n\nSimilarities in grammar and syntax\n\nWidespread (though not universal) features of the Afroasiatic languages include:\n* A set of emphatic consonants, variously realized as glottalized, pharyngealized, or implosive.\n* VSO typology with SVO tendencies.\n* A two-gender system in the singular, with the feminine marked by the sound /t/.\n* All Afroasiatic subfamilies show evidence of a causative affix s.\n* Semitic, Berber, Cushitic (including Beja), and Chadic support possessive suffixes.\n*  Nisba derivation in -j (earlier Egyptian) or -ī (Semitic)Carsten Peust,  [http://www.peust.de/2012_afroasiatic.pdf \"On the subgrouping of Afroasiatic\"], LingAeg 20 (2012), 221-251 (p. 243).\n* Morphology in which words inflect by changes within the root (vowel changes or gemination) as well as with prefixes and suffixes.\n\nOne of the most remarkable shared features among the Afroasiatic languages is the prefixing verb conjugation (see the table at the start of this section), with a distinctive pattern of prefixes beginning with /ʔ t n y/, and in particular a pattern whereby third-singular masculine /y-/ is opposed to third-singular feminine and second-singular /t-/.\n\nAccording to Ehret (1996), tonal languages appear in the Omotic and Chadic branches of Afroasiatic, as well as in certain Cushitic languages. The Semitic, Berber and Egyptian branches generally do not use tones phonemically.\n\nShared vocabulary\n\nThe following are some examples of Afroasiatic cognates, including ten pronouns, three nouns, and three verbs.\n\nSource: Christopher Ehret, Reconstructing Proto-Afroasiatic (Berkeley: University of California Press, 1995).\n\nNote: Ehret does not make use of Berber in his etymologies, stating (1995: 12): \"the kind of extensive reconstruction of proto-Berber lexicon that might help in sorting through alternative possible etymologies is not yet available.\" The Berber cognates here are taken from previous version of table in this article and need to be completed and referenced.\n\nAbbreviations: NOm 'North Omotic', SOm \n 'South Omotic'. MSA 'Modern South Arabian', PSC \n 'Proto-Southern Cushitic', PSom-II 'Proto-Somali, stage 2'. masc. \n 'masculine', fem. 'feminine', sing. \n 'singular', pl. 'plural'. 1s. \n 'first person singular', 2s. = 'second person singular'.\n\nSymbols: Following Ehret (1995: 70), a caron ˇ over a vowel indicates rising tone, and a circumflex ^ over a vowel indicates falling tone. V indicates a vowel of unknown quality. Ɂ indicates a glottal stop. * indicates reconstructed forms based on comparison of related languages.\n\nThere are two etymological dictionaries of Afroasiatic, one by Christopher Ehret, and one by Vladimir Orel and Olga Stolbova. The two dictionaries disagree on almost everything. The following table contains the thirty roots or so (out of thousands) that represent a fragile consensus of present research:\n\nEtymological bibliography\n\nSome of the main sources for Afroasiatic etymologies include:\n* Cohen, Marcel. 1947. Essai comparatif sur le vocabulaire et la phonétique du chamito-sémitique. Paris: Champion.\n* Diakonoff, Igor M. et al. 1993–1997. \"Historical-comparative vocabulary of Afrasian\", St. Petersburg Journal of African Studies 2–6.\n* Ehret, Christopher. 1995. Reconstructing Proto-Afroasiatic (Proto-Afrasian): Vowels, Tone, Consonants, and Vocabulary (= University of California Publications in Linguistics 126). Berkeley and Los Angeles: University of California Press.\n* Orel, Vladimir E. and Olga V. Stolbova. 1995. Hamito-Semitic Etymological Dictionary: Materials for a Reconstruction. Leiden: Brill. . Afroasiatic languages. http://en.wikipedia.org/?curid=599."
  }
}
