{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2395",
  "eid" : "bfff9fd0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778401869,
  "textBody" : "Events\n\n* 491 – Flavius Anastasius becomes Byzantine emperor, with the name of Anastasius I.\n*1079 – Bishop Stanislaus of Kraków is executed by order of Bolesław II of Poland.\n*1241 – Batu Khan defeats Béla IV of Hungary at the Battle of Mohi.\n*1512 – War of the League of Cambrai: French forces led by Gaston de Foix win the Battle of Ravenna.\n*1544 – French forces defeat a Spanish army at Ceresole.\n*1689 – William III and Mary II are crowned as joint sovereigns of Great Britain.\n*1713 – War of the Spanish Succession (Queen Anne's War): Treaty of Utrecht.\n*1727 – Premiere of Johann Sebastian Bach's St Matthew Passion BWV 244b at the St. Thomas Church, Leipzig\n*1809 – Battle of the Basque Roads Naval battle fought between France and the United Kingdom\n*1814 – The Treaty of Fontainebleau ends the War of the Sixth Coalition against Napoleon Bonaparte, and forces him to abdicate unconditionally for the first time.\n*1856 – Second Battle of Rivas: Juan Santamaría burns down the hostel where William Walker's filibusters are holed up.\n*1868 – Former Shogun Tokugawa Yoshinobu surrenders Edo Castle to Imperial forces, marking the end of the Tokugawa shogunate.\n*1876 – The Benevolent and Protective Order of Elks is organized.\n*1881 – Spelman College is founded in Atlanta, Georgia as the Atlanta Baptist Female Seminary, an institute of higher education for African-American women.\n*1908 – , the last armored cruiser to be built by the Imperial German Navy, launches.\n*1909 – The city of Tel Aviv is founded.\n*1921 – Emir Abdullah establishes the first centralised government in the newly created British protectorate of Transjordan.\n*1945 – World War II: American forces liberate the Buchenwald concentration camp.\n*1951 – Korean War: President Harry Truman relieves General of the Army Douglas MacArthur of overall command in Korea.\n*  1951   – The Stone of Scone, the stone upon which Scottish monarchs were traditionally crowned, is found on the site of the altar of Arbroath Abbey. It had been taken by Scottish nationalist students from its place in Westminster Abbey.\n*1955 – The Air India Kashmir Princess is bombed and crashes in a failed assassination attempt on Zhou Enlai by the Kuomintang.\n*1957 – United Kingdom agrees to Singaporean self-rule.\n*1961 – The trial of Adolf Eichmann begins in Jerusalem.\n*1963 – Pope John XXIII issues Pacem in terris, the first encyclical addressed to all Christians instead of only Catholics.\n*1965 – The Palm Sunday tornado outbreak of 1965: Fifty-one tornadoes hit in six Midwestern states, killing 256 people.\n*1968 – President Lyndon B. Johnson signs the Civil Rights Act of 1968, prohibiting discrimination in the sale, rental, and financing of housing.\n*1970 – Apollo 13 is launched.\n*1976 – The Apple I is created.\n*1977 – London Transport's Silver Jubilee AEC Routemaster buses are launched.\n*1979 – Ugandan dictator Idi Amin is deposed.\n*1981 – A massive riot in Brixton, south London results in almost 300 police injuries and 65 serious civilian injuries.\n*1986 – FBI Miami Shootout: A gun battle in broad daylight in Dade County, Florida between two bank/armored car robbers and pursuing FBI agents. During the firefight, FBI agents Jerry L. Dove and Benjamin P. Grogan were killed, while five other agents were wounded. As a result, the popular .40 S&W cartridge was developed.\n*1987 – The London Agreement is secretly signed between Israeli Foreign Affairs Minister Shimon Peres and King Hussein of Jordan.\n*1990 – Customs officers in Middlesbrough, England, seize what they believe to be the barrel of a massive gun on a ship bound for Iraq.\n*1993 – Four hundred fifty prisoners rioted at the Southern Ohio Correctional Facility in Lucasville, Ohio, and continued to do so for ten days, citing grievances related to prison conditions, as well as the forced vaccination of Nation of Islam prisoners (for tuberculosis) against their religious beliefs.\n*2001 – The detained crew of a United States EP-3E aircraft that landed in Hainan, China after a collision with a J-8 fighter, is released.\n*2002 – The Ghriba synagogue bombing by al-Qaeda kills 21 in Tunisia.\n*  2002   – Over two hundred thousand people march in Caracas towards the Presidential palace to demand the resignation of president Hugo Chávez. Nineteen protesters are killed.\n*2006 – Iranian president Mahmoud Ahmadinejad announces Iran's claim to have successfully enriched uranium.\n*2007 – Algiers bombings: Two bombings in Algiers kill 33 people and wound a further 222 others.\n*2011 – An explosion in the Minsk Metro, Belarus kills 15 people and injures 204 others.\n*2012 – A pair of great earthquakes occur in the Wharton Basin west of Sumatra in Indonesia. The maximum Mercalli intensity of this strike-slip doublet earthquake was VII (Very strong). Ten were killed, twelve were injured, and a non-destructive tsunami was observed on the island of Nias.\n\nBirths\n\n* 145 – Septimius Severus, Roman emperor (d. 211)\n* 999 – Bao Zheng, Chinese magistrate and ruler of Kaifeng (d. 1062)\n*1184 – William of Winchester, Lord of Lüneburg (d. 1213)\n*1357 – John I of Portugal (d. 1433)\n*1370 – Frederick I, Elector of Saxony (d. 1428)\n*1374 – Roger Mortimer, 4th Earl of March, heir to the throne of England (d. 1398)\n*1493 – George I, Duke of Pomerania (d. 1531)\n*1591 – Bartholomeus Strobel, Silezian painter (d. 1650)\n*1592 – John Eliot, English lawyer and politician (d. 1632)\n*1644 – Marie Jeanne Baptiste of Savoy-Nemours, Duchess of Savoy (d. 1724)\n*1658 – James Hamilton, 4th Duke of Hamilton, Scottish peer (d. 1712)\n*1683 – Jean-Joseph Mouret, French composer and conductor (d. 1738)\n*1715 – John Alcock, English organist and composer (d. 1806)\n*1721 – David Zeisberger, Czech-American clergyman and missionary (d. 1808)\n*1722 – Christopher Smart, English actor, playwright, and poet (d. 1771)\n*1755 – James Parkinson, English surgeon, geologist, and paleontologist (d. 1824)\n*1770 – George Canning, Irish-English lawyer and politician, Prime Minister of the United Kingdom (d. 1827)\n*1794 – Edward Everett, English-American educator and politician, 15th Governor of Massachusetts (d. 1865)\n*1798 – Macedonio Melloni, Italian physicist and academic (d. 1854)\n*1819 – Charles Hallé, German-English pianist and conductor (d. 1895)\n*1825 – Ferdinand Lassalle, German philosopher and jurist (d. 1864)\n*1827 – Jyotirao Phule, Indian scholar, philosopher, and activist (d. 1890)\n*1854 – Hugh Massie, Australian cricketer (d. 1938)\n*1856 – Arthur Shrewsbury, English cricketer and rugby player (d. 1903)\n*1859 – Stefanos Thomopoulos, Greek historian and author (d. 1939)\n*1862 – William Wallace Campbell, American astronomer and academic (d. 1938)\n*  1862   – Charles Evans Hughes, American lawyer and politician, 44th United States Secretary of State (d. 1948)\n*1864 – Johanna Elberskirchen, German author and activist (d. 1943)\n*1866 – Bernard O'Dowd, Australian journalist, author, and poet (d. 1953)\n*1867 – Mark Keppel, American educator (d. 1928)\n*1869 – Gustav Vigeland, Norwegian sculptor, designed the Nobel Peace Prize medal (d. 1943)\n*1871 – Gyula Kellner, Hungarian runner (d. 1940)\n*1873 – Edward Lawson, English soldier, Victoria Cross recipient (d. 1955)\n*1876 – Paul Henry, Irish painter (d. 1958)\n*  1876   – Ivane Javakhishvili, Georgian historian and academic (d. 1940)\n*1879 – Bernhard Schmidt, Estonian-German astronomer and optician (d. 1935)\n*1887 – Jamini Roy, Indian painter (d. 1972)\n*1893 – Dean Acheson, American lawyer and politician, 51st United States Secretary of State (d. 1971)\n*1896 – Léo-Paul Desrosiers, Canadian journalist and author (d. 1967)\n*1899 – Percy Lavon Julian, African-American chemist and academic (d. 1975)\n*1900 – Sándor Márai, Hungarian journalist and author (d. 1989)\n*1903 – Misuzu Kaneko, Japanese poet (d. 1930)\n*1905 – Attila József, Hungarian poet and educator (d. 1937)\n*1906 – Dale Messick, American author and illustrator (d. 2005)\n*1907 – Paul Douglas, American actor (d. 1959)\n*  1907   – Ivor Spencer-Thomas, Welsh farmer and businessman (d. 2001)\n*1908 – Jane Bolin, American lawyer and judge (d. 2007)\n*  1908   – Masaru Ibuka, Japanese businessman, co-founded Sony (d. 1997)\n*  1908   – Dan Maskell, English tennis player and sportscaster (d. 1992)\n*  1908   – Leo Rosten, Polish-American author and academic (d. 1997)\n*1910 – António de Spínola, Portuguese general and politician, 14th President of Portugal (d. 1996)\n*1912 – John Levy, American bassist and businessman (d. 2012)\n*1913 – Oleg Cassini, French-American fashion designer (d. 2006)\n*1914 – Norman McLaren, Scottish-Canadian animator, director, and producer (d. 1987)\n*  1914   – Robert Stanfield, Canadian economist, lawyer, and politician, 17th Premier of Nova Scotia (d. 2003)\n*  1914   – Dorothy Lewis Bernstein, American mathematician (d. 1988)\n*1916 – Alberto Ginastera, Argentinian-Swiss pianist and composer (d. 1983)\n*  1916   – Howard W. Koch, American director and producer (d. 2001)\n*1917 – Danny Gallivan, Canadian radio and television broadcaster and sportscaster (d. 1993)\n*  1917   – David Westheimer, American soldier, journalist, and author (d. 2005)\n*1918 – Richard Wainwright, English soldier and politician (d. 2003)\n*1919 – Raymond Carr, English historian and academic (d. 2015)\n*1920 – Emilio Colombo, Italian lawyer and politician, 40th Prime Minister of Italy (d. 2013)\n*  1920   – Peter O'Donnell, English soldier and author (d. 2010)\n*  1920   – William Royer, American soldier and politician (d. 2013)\n*1921 – Jim Hearn, American baseball player (d. 1998)\n*  1921   – Jack Rayner, Australian rugby league player and coach (d. 2008)\n*1922 – Arved Viirlaid, Estonian-Canadian soldier and author (d. 2015)\n*1923 – George J. Maloof, Sr., American businessman (d. 1980)\n*1924 – Mohammad Naseem, Pakistani-English activist and politician (d. 2014)\n*1925 – Yuriy Lituyev, Russian hurdler and commander (d. 2000)\n*  1925   – Viola Liuzzo, American civil rights activist (d. 1965)\n*  1925   – Viktor Masing, Estonian botanist and ecologist (d. 2001)\n*  1925   – Pierre Péladeau, Canadian businessman, founded Quebecor (d. 1997)\n*1926 – David Manker Abshire, American commander and diplomat, United States Permanent Representative to NATO (d. 2014)\n*  1926   – Victor Bouchard, Canadian pianist and composer (d. 2011)\n*  1926   – Karl Rebane, Estonian physicist and academic (d. 2007)\n*1928 – Ethel Kennedy, American philanthropist\n*  1928   – Edwin Pope, American journalist and author (d. 2017)\n*  1928   – Tommy Tycho, Hungarian-Australian pianist, composer, and conductor (d. 2013)\n*1930 – Nicholas F. Brady, American businessman and politician, 68th United States Secretary of the Treasury\n*  1930   – Walter Krüger, German javelin thrower\n*  1930   – Anton LaVey, American occultist, founded the Church of Satan (d. 1997)\n*1931 – Lewis Jones, Welsh rugby player and coach\n*1932 – Joel Grey, American actor, singer, and dancer\n*1933 – Tony Brown, American journalist and academic\n*1934 – Mark Strand, Canadian-born American poet, essayist, and translator (d. 2014)\n*  1934   – Ron Pember, English actor, director and playwright\n*1935 – Richard Berry, American singer-songwriter (d. 1997)\n*1936 – Brian Noble, English bishop\n*1937 – Jill Gascoine, English actress and author\n*1938 – Gerry Baker, American soccer player and manager (d. 2013)\n*  1938   – Michael Deaver, American politician, Deputy White House Chief of Staff (d. 2007)\n*  1938   – Reatha King, American chemist and businesswoman\n*1939 – Luther Johnson, American singer and guitarist\n*  1939   – Louise Lasser, American actress \n*1940 – Col Firmin, Australian politician (d. 2013)\n*  1940   – Thomas Harris, American author and screenwriter\n*  1940   – Władysław Komar, Polish shot putter and actor (d. 1998)\n*1941 – Ellen Goodman, American journalist and author\n*  1941   – Shirley Stelfox, English actress (d. 2015)\n*1942 – Anatoly Berezovoy, Russian colonel, pilot, and astronaut (d. 2014)\n*  1942   – James Underwood, English pathologist and academic\n*1943 – John Montagu, 11th Earl of Sandwich, English businessman and politician\n*  1943   – Harley Race, American wrestler and trainer\n*1944 – Peter Barfuß, German footballer\n*  1944   – John Milius, American director, producer, and screenwriter\n*1945 – John Krebs, Baron Krebs, English zoologist and academic\n*1946 – Chris Burden, American sculptor, illustrator, and academic (d. 2015)\n*  1946   – Bob Harris, English journalist and radio host\n*1947 – Lev Bulat, Ukrainian-Russian physicist and academic (d. 2016)\n*  1947   – Uli Edel, German director and screenwriter\n*  1947   – Frank Mantooth, American pianist and composer (d. 2004)\n*  1947   – Peter Riegert, American actor, screenwriter and film director\n*  1947   – Michael T. Wright, English engineer and academic (d. 2015)\n*1949 – Bernd Eichinger, German director and producer (d. 2011)\n*1950 – Bill Irwin, American actor and clown\n*1951 – Paul Fox, English singer and guitarist (d. 2007)\n*1952 – Nancy Honeytree, American singer and guitarist\n*  1952   – Indira Samarasekera, Sri Lankan engineer and academic\n*  1952   – Peter Windsor, English-Australian journalist and sportscaster\n*1953 – Guy Verhofstadt, Belgian politician, 47th Prime Minister of Belgium\n*  1953   – Andrew Wiles, English mathematician and academic\n*1954 – Abdullah Atalar, Turkish engineer and academic\n*  1954   – Aleksandr Averin Azerbaijani cyclist and coach\n*  1954   – Francis Lickerish, English guitarist and composer \n*  1954   – David Perrett, Scottish psychologist and academic\n*  1954   – Ian Redmond, English biologist and conservationist\n*  1954   – Willie Royster, American baseball player (d. 2015)\n*1955 – Kevin Brady, American lawyer and politician\n*  1955   – Michael Callen, American singer-songwriter and AIDS activist (d. 1993)\n*  1955   – Micheal Ray Richardson, American basketball player and coach\n*1958 – Stuart Adamson, Scottish singer-songwriter and guitarist (d. 2001)\n*  1958   – Lyudmila Kondratyeva, Russian sprinter \n*1959 – Pierre Lacroix, Canadian ice hockey player\n*  1959   – Ana María Polo, Cuban-American lawyer and judge\n*1960 – Jeremy Clarkson, English journalist and television presenter\n*1961 – Vincent Gallo, American actor, director, producer, and musician\n*  1961   – Doug Hopkins, American guitarist and songwriter (d. 1993)\n*  1961   – Nobuaki Kakuda, Japanese martial artist\n*1962 – Franck Ducheix, French fencer\n*  1962   – Mark Lawson, English journalist and author\n*1963 – Billy Bowden, New Zealand cricketer and umpire\n*  1963   – Waldemar Fornalik, Polish footballer and manager\n*  1963   – June and Jennifer Gibbons, identical twins known as \"The Silent Twins\"\n*  1963   – Elizabeth Smylie, Australian tennis player\n*1964 – Steve Azar, American singer-songwriter and guitarist\n*  1964   – John Cryer, English journalist and politician\n*  1964   – Johann Sebastian Paetsch, American cellist\n*  1964   – Bret Saberhagen, American baseball player and coach\n*  1964   – Patrick Sang, Kenyan runner\n*1966 – Steve Scarsone, American baseball player and manager\n*  1966   – Lisa Stansfield, English singer-songwriter and actress \n*1968 – Sergei Lukyanenko, Kazakh-Russian journalist and author\n*1969 – Cerys Matthews, Welsh singer-songwriter\n*  1969   – Michael von Grünigen, Swiss skier\n*1970 – Trevor Linden, Canadian ice hockey player and manager\n*  1970   – Delroy Pearson, English singer-songwriter and producer \n*1971 – John Leech, English politician\n*  1971   – Oliver Riedel, German bass player \n*1972 – Balls Mahoney, American wrestler (d. 2016)\n*  1972   – Allan Théo, French singer\n*  1972   – Jason Varitek, American baseball player and manager\n*1973 – Jennifer Esposito, American actress \n*  1973   – Olivier Magne, French rugby player\n*1974 – Àlex Corretja, Spanish tennis player and coach\n*  1974   – Ashot Danielyan, Armenian weightlifter\n*  1974   – David Jassy, Swedish singer-songwriter and producer \n*  1974   – Zöe Lucker, English actress\n*  1974   – Trot Nixon, American baseball player and sportscaster\n*1975 – Olga Hostáková, Czech tennis player\n*  1975   – Walid Soliman, Tunisian author and translator\n*1976 – Kelvim Escobar, Venezuelan baseball player\n*1977 – Ivonne Teichmann, German runner\n*1978 – Josh Hancock, American baseball player (d. 2007)\n*  1978   – Tom Thacker, Canadian singer-songwriter, guitarist, and producer \n*1979 – Malcolm Christie, English footballer\n*  1979   – Sebastien Grainger, Canadian singer-songwriter and guitarist \n*  1979   – Michel Riesen, Swiss ice hockey player\n*1980 – Keiji Tamada, Japanese footballer\n*  1980   – Mark Teixeira, American baseball player\n*1981 – Alexandre Burrows, Canadian ice hockey player\n*  1981   – Veronica Pyke, Australian cricketer\n*1982 – Ian Bell, English cricketer\n*  1982   – Peeter Kümmel, Estonian skier\n*1983 – Jennifer Heil, Canadian skier\n*  1983   – Rubén Palazuelos, Spanish footballer\n*  1983   – Nicky Pastorelli, Dutch race car driver\n*1984 – Kelli Garner, American actress\n*  1984   – Nikola Karabatić, French handball player\n*1985 – Pablo Hernández Domínguez, Spanish footballer\n*  1985   – Will Minson, Australian footballer\n*1986 – Dai Greene, Welsh hurdler\n*  1986   – Lena Schöneborn, German pentathlete\n*1987 – Joss Stone, English singer-songwriter and actress \n*1988 – Leland Irving, Canadian ice hockey player\n*  1989   – Torrin Lawrence, American sprinter (d. 2014)\n*1990 – Dimitrios Anastasopoulos, Greek footballer\n*  1990   – Thulani Serero, South African footballer\n*1991 – Thiago Alcântara, Spanish footballer\n*1996 – Dele Alli, English footballer\n*1997 – Georgia Bohl, Australian swimmer\n*  1997   – Miriam Kolodziejová, Czech tennis player\n\nDeaths\n\n* 618 – Emperor Yang of Sui, emperor of the Sui Dynasty (b. 569)\n* 678 – Pope Donus\n* 924 – Herman I, archbishop of Cologne\n*1034 – Romanos III Argyros, Byzantine emperor (b. 968)\n*1077 – Anawrahta, king of Burma and founder of the Pagan Empire (b. 1014)\n*1079 – Stanislaus of Szczepanów, bishop of Kraków (b. 1030)\n*1165 – Stephen IV of Hungary (b. 1133)\n*1240 – Llywelyn the Great, Welsh prince (b. 1172)\n*1447 – Henry Beaufort, Cardinal, Lord Chancellor of England (b. 1377)\n*1512 – Gaston de Foix, French military commander (b. 1489)\n*1554 – Thomas Wyatt the Younger, English rebel leader (b. 1521)\n*1587 – Thomas Bromley, English lord chancellor (b. 1530)\n*1609 – John Lumley, 1st Baron Lumley, English noble (b. 1533)\n*1612 – Emanuel van Meteren, Flemish historian and author (b. 1535)\n*  1612   – Edward Wightman, English minister and martyr (b. 1566)\n*1626 – Marino Ghetaldi, Ragusan mathematician and physicist (b. 1568)\n*1712 – Richard Simon, French priest and critic (b. 1638)\n*1723 – John Robinson, English bishop and diplomat (b. 1650)\n*1783 – Nikita Ivanovich Panin, Polish-Russian politician, Russian Minister of Foreign Affairs (b. 1718)\n*1798 – Karl Wilhelm Ramler, German poet and academic (b. 1725)\n*1856 – Juan Santamaría, Costa Rican soldier (b. 1831)\n*1861 – Francisco González Bocanegra, Mexican poet and composer (b. 1824)\n*1873 – Edward Canby, American general (b. 1817)\n*1890 – David de Jahacob Lopez Cardozo, Dutch Talmudist (b. 1808)\n*  1890   – Joseph Merrick, English man with severe deformities (b. 1862)\n*1894 – Constantin Lipsius, German architect and theorist (b. 1832) \n*1895 – Julius Lothar Meyer, German chemist (b. 1830) \n*1902 – Wade Hampton III, American general and politician, 77th Governor of South Carolina (b. 1818)\n*1903 – Gemma Galgani, Italian mystic and saint (b. 1878)\n*1906 – James Anthony Bailey, American businessman, co-founded Ringling Bros. and Barnum & Bailey Circus (b. 1847)\n*  1906   – Francis Pharcellus Church, American journalist and publisher, co-founded Armed Forces Journal and The Galaxy Magazine (b. 1839)\n*1908 – Henry Bird, English chess player and author (b. 1829)\n*1916 – Richard Harding Davis, American journalist and author (b. 1864)\n*1918 – Otto Wagner, Austrian architect and urban planner (b. 1841)\n*1926 – Luther Burbank, American botanist and academic (b. 1849)\n*1939 – Kurtdereli Mehmet, Turkish wrestler (b. 1864)\n*1953 – Kid Nichols, American baseball player and manager (b. 1869)\n*1954 – Paul Specht, American violinist and bandleader (b. 1895)\n*1958 – Konstantin Yuon, Russian painter and educator (b. 1875)\n*1960 – Rosa Grünberg, Swedish actress (b. 1878)\n*1962 – Ukichiro Nakaya, Japanese physicist and academic (b. 1900)\n*  1962   – George Poage, American hurdler and educator (b. 1880)\n*1967 – Thomas Farrell, American general (b. 1891)\n*  1967   – Donald Sangster, Jamaican lawyer and politician, 2nd Prime Minister of Jamaica (b. 1911)\n*1970 – Cathy O'Donnell, American actress (b. 1923)\n*  1970   – John O'Hara, American novelist and short story writer  (b. 1905)\n*1974 – Ernst Ziegler, German actor (b. 1894)\n*1977 – Jacques Prévert, French poet and screenwriter (b. 1900)\n*  1977   – Phanishwar Nath 'Renu', Indian author and activist (b. 1921)\n*1980 – Ümit Kaftancıoğlu, Turkish journalist and producer (b. 1935)\n*1981 – Caroline Gordon, American author and critic (b. 1895)\n*1983 – Dolores del Río, Mexican actress (b. 1904)\n*1984 – Edgar V. Saks, Estonian historian and politician, Estonian Minister of Education (b. 1910)\n*1985 – Bunny Ahearne, Irish-born English businessman (b. 1900)\n*  1985   – John Gilroy, English artist and illustrator (b. 1898)\n*  1985   – Enver Hoxha, Albanian educator and politician, 21st Prime Minister of Albania (b. 1908)\n*1987 – Erskine Caldwell,  American novelist and short story writer (b. 1903)\n*  1987   – Primo Levi, Italian chemist and author (b. 1919)\n*1990 – Harold Ballard, Canadian businessman (b. 1903)\n*1991 – Walker Cooper, American baseball player and manager (b. 1915)\n*  1991   – Bruno Hoffmann. German glass harp player (b. 1913)\n*1992 – James Brown, American actor and singer (b. 1920)\n*  1992   – Eve Merriam, American author and poet (b. 1916)\n*  1992   – Alejandro Obregón, Colombian painter, sculptor, and engraver (b. 1920)\n*1996 – Jessica Dubroff, American pilot (b. 1988)\n*1997 – Muriel McQueen Fergusson, Canadian lawyer and politician, Canadian Speaker of the Senate (b. 1899)\n*1997 – Wang Xiaobo, contemporary Chinese novelist and essayist (b. 1952)\n*1999 – William H. Armstrong, American author and educator (b. 1911)\n*2000 – Diana Darvey, English actress, singer and dancer (b. 1945)\n*2001 – Harry Secombe, Welsh-English actor (b. 1921)\n*2003 – Cecil Howard Green, English-American geophysicist and businessman, founded Texas Instruments (b. 1900)\n*2005 – André François, Romanian-French cartoonist, painter, and sculptor (b. 1915)\n*  2005   – Lucien Laurent, French footballer and coach (b. 1907)\n*2006 – June Pointer, American singer (b. 1953)\n*2007 – Roscoe Lee Browne, American actor and director (b. 1922)\n*  2007   – Loïc Leferme, French diver (b. 1970)\n*  2007   – Janet McDonald, American lawyer and author (b. 1954)\n*  2007   – Ronald Speirs, Scottish-American colonel (b. 1920)\n*  2007   – Kurt Vonnegut, American novelist, short story writer, and playwright (b. 1922)\n*2008 – Merlin German, American sergeant (b. 1985)\n*2009 – Gerda Gilboe, Danish actress and singer (b. 1914)\n*  2009   – Vishnu Prabhakar, Indian author and playwright (b. 1912)\n*  2009   – Corín Tellado, Spanish author (b. 1927)\n*2010 – Julia Tsenova, Bulgarian pianist and composer (b. 1948)\n*2011 – Larry Sweeney, American wrestler and manager (b. 1981)\n*2012 – Ahmed Ben Bella, Algerian soldier and politician, 1st President of Algeria (b. 1916)\n*  2012   – Roger Caron, Canadian criminal and author (b. 1938)\n*  2012   – Tippy Dye, American basketball player and coach (b. 1915)\n*  2012   – Hal McKusick, American saxophonist, clarinet player, and flute player (b. 1924)\n*  2012   – Agustin Roman, American bishop (b. 1928)\n*2013 – Don Blackman, American singer-songwriter, pianist, and producer (b. 1953)\n*  2013   – Grady Hatton, American baseball player, coach, and manager (b. 1922)\n*  2013   – Thomas Hemsley, English actor and singer (b. 1927)\n*  2013   – Hilary Koprowski, Polish-American virologist and immunologist (b. 1916)\n*  2013   – Gilles Marchal, French singer-songwriter (b. 1944)\n*  2013   – Maria Tallchief, American ballerina (b. 1925)\n*  2013   – Clorindo Testa, Italian-Argentinian architect (b. 1923)\n*  2013   – Jonathan Winters, American comedian, actor and screenwriter (b. 1925)\n*2014 – Rolf Brem, Swiss sculptor and illustrator (b. 1926)\n*  2014   – Edna Doré, English actress (b. 1921)\n*  2014   – Bill Henry, American baseball player (b. 1927)\n*  2014   – Lou Hudson, American basketball player and sportscaster (b. 1944)\n*  2014   – Myer S. Kripke, American rabbi and scholar (b. 1914)\n*  2014   – Sergey Nepobedimy, Russian engineer (b. 1921)\n*  2014   – Jesse Winchester, American singer-songwriter, guitarist, and producer (b. 1944)\n*2015 – Jimmy Gunn, American football player (b. 1948)\n*  2015   – Muhammad Kamaruzzaman, Bangladeshi journalist and politician (b. 1952)\n*  2015   – François Maspero, French journalist and author (b. 1932)\n*  2015   – Hanut Singh Rathore, Indian general (b. 1933)\n*  2015   – Tekena Tamuno, Nigerian historian and academic (b. 1932)\n*2017 – J. Geils, American singer and guitarist (b. 1946)\n*  2017   – Mark Wainberg, Canadian researcher and HIV/AIDS activist (b. 1945)\n\nHolidays and observances\n\n*Christian feast day:\n**Antipas of Pergamum (Greek Orthodox Church)\n**Gemma Galgani\n**Godeberta\n**Guthlac of Crowland\n**George Selwyn (Anglicanism)\n**Stanislaus of Szczepanów\n**April 11 (Eastern Orthodox liturgics)\n*Juan Santamaría Day, anniversary of his death in the Second Battle of Rivas. (Costa Rica)\n*International Louie Louie Day\n*World Parkinson's Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "April 11" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2395" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 491 – Flavius Anastasius becomes Byzantine emperor, with the name of Anastasius I.\n*1079 – Bishop Stanislaus of Kraków is executed by order of Bolesław II of Poland.\n*1241 – Batu Khan defeats Béla IV of Hungary at the Battle of Mohi.\n*1512 – War of the League of Cambrai: French forces led by Gaston de Foix win the Battle of Ravenna.\n*1544 – French forces defeat a Spanish army at Ceresole.\n*1689 – William III and Mary II are crowned as joint sovereigns of Great Britain.\n*1713 – War of the Spanish Succession (Queen Anne's War): Treaty of Utrecht.\n*1727 – Premiere of Johann Sebastian Bach's St Matthew Passion BWV 244b at the St. Thomas Church, Leipzig\n*1809 – Battle of the Basque Roads Naval battle fought between France and the United Kingdom\n*1814 – The Treaty of Fontainebleau ends the War of the Sixth Coalition against Napoleon Bonaparte, and forces him to abdicate unconditionally for the first time.\n*1856 – Second Battle of Rivas: Juan Santamaría burns down the hostel where William Walker's filibusters are holed up.\n*1868 – Former Shogun Tokugawa Yoshinobu surrenders Edo Castle to Imperial forces, marking the end of the Tokugawa shogunate.\n*1876 – The Benevolent and Protective Order of Elks is organized.\n*1881 – Spelman College is founded in Atlanta, Georgia as the Atlanta Baptist Female Seminary, an institute of higher education for African-American women.\n*1908 – , the last armored cruiser to be built by the Imperial German Navy, launches.\n*1909 – The city of Tel Aviv is founded.\n*1921 – Emir Abdullah establishes the first centralised government in the newly created British protectorate of Transjordan.\n*1945 – World War II: American forces liberate the Buchenwald concentration camp.\n*1951 – Korean War: President Harry Truman relieves General of the Army Douglas MacArthur of overall command in Korea.\n*  1951   – The Stone of Scone, the stone upon which Scottish monarchs were traditionally crowned, is found on the site of the altar of Arbroath Abbey. It had been taken by Scottish nationalist students from its place in Westminster Abbey.\n*1955 – The Air India Kashmir Princess is bombed and crashes in a failed assassination attempt on Zhou Enlai by the Kuomintang.\n*1957 – United Kingdom agrees to Singaporean self-rule.\n*1961 – The trial of Adolf Eichmann begins in Jerusalem.\n*1963 – Pope John XXIII issues Pacem in terris, the first encyclical addressed to all Christians instead of only Catholics.\n*1965 – The Palm Sunday tornado outbreak of 1965: Fifty-one tornadoes hit in six Midwestern states, killing 256 people.\n*1968 – President Lyndon B. Johnson signs the Civil Rights Act of 1968, prohibiting discrimination in the sale, rental, and financing of housing.\n*1970 – Apollo 13 is launched.\n*1976 – The Apple I is created.\n*1977 – London Transport's Silver Jubilee AEC Routemaster buses are launched.\n*1979 – Ugandan dictator Idi Amin is deposed.\n*1981 – A massive riot in Brixton, south London results in almost 300 police injuries and 65 serious civilian injuries.\n*1986 – FBI Miami Shootout: A gun battle in broad daylight in Dade County, Florida between two bank/armored car robbers and pursuing FBI agents. During the firefight, FBI agents Jerry L. Dove and Benjamin P. Grogan were killed, while five other agents were wounded. As a result, the popular .40 S&W cartridge was developed.\n*1987 – The London Agreement is secretly signed between Israeli Foreign Affairs Minister Shimon Peres and King Hussein of Jordan.\n*1990 – Customs officers in Middlesbrough, England, seize what they believe to be the barrel of a massive gun on a ship bound for Iraq.\n*1993 – Four hundred fifty prisoners rioted at the Southern Ohio Correctional Facility in Lucasville, Ohio, and continued to do so for ten days, citing grievances related to prison conditions, as well as the forced vaccination of Nation of Islam prisoners (for tuberculosis) against their religious beliefs.\n*2001 – The detained crew of a United States EP-3E aircraft that landed in Hainan, China after a collision with a J-8 fighter, is released.\n*2002 – The Ghriba synagogue bombing by al-Qaeda kills 21 in Tunisia.\n*  2002   – Over two hundred thousand people march in Caracas towards the Presidential palace to demand the resignation of president Hugo Chávez. Nineteen protesters are killed.\n*2006 – Iranian president Mahmoud Ahmadinejad announces Iran's claim to have successfully enriched uranium.\n*2007 – Algiers bombings: Two bombings in Algiers kill 33 people and wound a further 222 others.\n*2011 – An explosion in the Minsk Metro, Belarus kills 15 people and injures 204 others.\n*2012 – A pair of great earthquakes occur in the Wharton Basin west of Sumatra in Indonesia. The maximum Mercalli intensity of this strike-slip doublet earthquake was VII (Very strong). Ten were killed, twelve were injured, and a non-destructive tsunami was observed on the island of Nias.\n\nBirths\n\n* 145 – Septimius Severus, Roman emperor (d. 211)\n* 999 – Bao Zheng, Chinese magistrate and ruler of Kaifeng (d. 1062)\n*1184 – William of Winchester, Lord of Lüneburg (d. 1213)\n*1357 – John I of Portugal (d. 1433)\n*1370 – Frederick I, Elector of Saxony (d. 1428)\n*1374 – Roger Mortimer, 4th Earl of March, heir to the throne of England (d. 1398)\n*1493 – George I, Duke of Pomerania (d. 1531)\n*1591 – Bartholomeus Strobel, Silezian painter (d. 1650)\n*1592 – John Eliot, English lawyer and politician (d. 1632)\n*1644 – Marie Jeanne Baptiste of Savoy-Nemours, Duchess of Savoy (d. 1724)\n*1658 – James Hamilton, 4th Duke of Hamilton, Scottish peer (d. 1712)\n*1683 – Jean-Joseph Mouret, French composer and conductor (d. 1738)\n*1715 – John Alcock, English organist and composer (d. 1806)\n*1721 – David Zeisberger, Czech-American clergyman and missionary (d. 1808)\n*1722 – Christopher Smart, English actor, playwright, and poet (d. 1771)\n*1755 – James Parkinson, English surgeon, geologist, and paleontologist (d. 1824)\n*1770 – George Canning, Irish-English lawyer and politician, Prime Minister of the United Kingdom (d. 1827)\n*1794 – Edward Everett, English-American educator and politician, 15th Governor of Massachusetts (d. 1865)\n*1798 – Macedonio Melloni, Italian physicist and academic (d. 1854)\n*1819 – Charles Hallé, German-English pianist and conductor (d. 1895)\n*1825 – Ferdinand Lassalle, German philosopher and jurist (d. 1864)\n*1827 – Jyotirao Phule, Indian scholar, philosopher, and activist (d. 1890)\n*1854 – Hugh Massie, Australian cricketer (d. 1938)\n*1856 – Arthur Shrewsbury, English cricketer and rugby player (d. 1903)\n*1859 – Stefanos Thomopoulos, Greek historian and author (d. 1939)\n*1862 – William Wallace Campbell, American astronomer and academic (d. 1938)\n*  1862   – Charles Evans Hughes, American lawyer and politician, 44th United States Secretary of State (d. 1948)\n*1864 – Johanna Elberskirchen, German author and activist (d. 1943)\n*1866 – Bernard O'Dowd, Australian journalist, author, and poet (d. 1953)\n*1867 – Mark Keppel, American educator (d. 1928)\n*1869 – Gustav Vigeland, Norwegian sculptor, designed the Nobel Peace Prize medal (d. 1943)\n*1871 – Gyula Kellner, Hungarian runner (d. 1940)\n*1873 – Edward Lawson, English soldier, Victoria Cross recipient (d. 1955)\n*1876 – Paul Henry, Irish painter (d. 1958)\n*  1876   – Ivane Javakhishvili, Georgian historian and academic (d. 1940)\n*1879 – Bernhard Schmidt, Estonian-German astronomer and optician (d. 1935)\n*1887 – Jamini Roy, Indian painter (d. 1972)\n*1893 – Dean Acheson, American lawyer and politician, 51st United States Secretary of State (d. 1971)\n*1896 – Léo-Paul Desrosiers, Canadian journalist and author (d. 1967)\n*1899 – Percy Lavon Julian, African-American chemist and academic (d. 1975)\n*1900 – Sándor Márai, Hungarian journalist and author (d. 1989)\n*1903 – Misuzu Kaneko, Japanese poet (d. 1930)\n*1905 – Attila József, Hungarian poet and educator (d. 1937)\n*1906 – Dale Messick, American author and illustrator (d. 2005)\n*1907 – Paul Douglas, American actor (d. 1959)\n*  1907   – Ivor Spencer-Thomas, Welsh farmer and businessman (d. 2001)\n*1908 – Jane Bolin, American lawyer and judge (d. 2007)\n*  1908   – Masaru Ibuka, Japanese businessman, co-founded Sony (d. 1997)\n*  1908   – Dan Maskell, English tennis player and sportscaster (d. 1992)\n*  1908   – Leo Rosten, Polish-American author and academic (d. 1997)\n*1910 – António de Spínola, Portuguese general and politician, 14th President of Portugal (d. 1996)\n*1912 – John Levy, American bassist and businessman (d. 2012)\n*1913 – Oleg Cassini, French-American fashion designer (d. 2006)\n*1914 – Norman McLaren, Scottish-Canadian animator, director, and producer (d. 1987)\n*  1914   – Robert Stanfield, Canadian economist, lawyer, and politician, 17th Premier of Nova Scotia (d. 2003)\n*  1914   – Dorothy Lewis Bernstein, American mathematician (d. 1988)\n*1916 – Alberto Ginastera, Argentinian-Swiss pianist and composer (d. 1983)\n*  1916   – Howard W. Koch, American director and producer (d. 2001)\n*1917 – Danny Gallivan, Canadian radio and television broadcaster and sportscaster (d. 1993)\n*  1917   – David Westheimer, American soldier, journalist, and author (d. 2005)\n*1918 – Richard Wainwright, English soldier and politician (d. 2003)\n*1919 – Raymond Carr, English historian and academic (d. 2015)\n*1920 – Emilio Colombo, Italian lawyer and politician, 40th Prime Minister of Italy (d. 2013)\n*  1920   – Peter O'Donnell, English soldier and author (d. 2010)\n*  1920   – William Royer, American soldier and politician (d. 2013)\n*1921 – Jim Hearn, American baseball player (d. 1998)\n*  1921   – Jack Rayner, Australian rugby league player and coach (d. 2008)\n*1922 – Arved Viirlaid, Estonian-Canadian soldier and author (d. 2015)\n*1923 – George J. Maloof, Sr., American businessman (d. 1980)\n*1924 – Mohammad Naseem, Pakistani-English activist and politician (d. 2014)\n*1925 – Yuriy Lituyev, Russian hurdler and commander (d. 2000)\n*  1925   – Viola Liuzzo, American civil rights activist (d. 1965)\n*  1925   – Viktor Masing, Estonian botanist and ecologist (d. 2001)\n*  1925   – Pierre Péladeau, Canadian businessman, founded Quebecor (d. 1997)\n*1926 – David Manker Abshire, American commander and diplomat, United States Permanent Representative to NATO (d. 2014)\n*  1926   – Victor Bouchard, Canadian pianist and composer (d. 2011)\n*  1926   – Karl Rebane, Estonian physicist and academic (d. 2007)\n*1928 – Ethel Kennedy, American philanthropist\n*  1928   – Edwin Pope, American journalist and author (d. 2017)\n*  1928   – Tommy Tycho, Hungarian-Australian pianist, composer, and conductor (d. 2013)\n*1930 – Nicholas F. Brady, American businessman and politician, 68th United States Secretary of the Treasury\n*  1930   – Walter Krüger, German javelin thrower\n*  1930   – Anton LaVey, American occultist, founded the Church of Satan (d. 1997)\n*1931 – Lewis Jones, Welsh rugby player and coach\n*1932 – Joel Grey, American actor, singer, and dancer\n*1933 – Tony Brown, American journalist and academic\n*1934 – Mark Strand, Canadian-born American poet, essayist, and translator (d. 2014)\n*  1934   – Ron Pember, English actor, director and playwright\n*1935 – Richard Berry, American singer-songwriter (d. 1997)\n*1936 – Brian Noble, English bishop\n*1937 – Jill Gascoine, English actress and author\n*1938 – Gerry Baker, American soccer player and manager (d. 2013)\n*  1938   – Michael Deaver, American politician, Deputy White House Chief of Staff (d. 2007)\n*  1938   – Reatha King, American chemist and businesswoman\n*1939 – Luther Johnson, American singer and guitarist\n*  1939   – Louise Lasser, American actress \n*1940 – Col Firmin, Australian politician (d. 2013)\n*  1940   – Thomas Harris, American author and screenwriter\n*  1940   – Władysław Komar, Polish shot putter and actor (d. 1998)\n*1941 – Ellen Goodman, American journalist and author\n*  1941   – Shirley Stelfox, English actress (d. 2015)\n*1942 – Anatoly Berezovoy, Russian colonel, pilot, and astronaut (d. 2014)\n*  1942   – James Underwood, English pathologist and academic\n*1943 – John Montagu, 11th Earl of Sandwich, English businessman and politician\n*  1943   – Harley Race, American wrestler and trainer\n*1944 – Peter Barfuß, German footballer\n*  1944   – John Milius, American director, producer, and screenwriter\n*1945 – John Krebs, Baron Krebs, English zoologist and academic\n*1946 – Chris Burden, American sculptor, illustrator, and academic (d. 2015)\n*  1946   – Bob Harris, English journalist and radio host\n*1947 – Lev Bulat, Ukrainian-Russian physicist and academic (d. 2016)\n*  1947   – Uli Edel, German director and screenwriter\n*  1947   – Frank Mantooth, American pianist and composer (d. 2004)\n*  1947   – Peter Riegert, American actor, screenwriter and film director\n*  1947   – Michael T. Wright, English engineer and academic (d. 2015)\n*1949 – Bernd Eichinger, German director and producer (d. 2011)\n*1950 – Bill Irwin, American actor and clown\n*1951 – Paul Fox, English singer and guitarist (d. 2007)\n*1952 – Nancy Honeytree, American singer and guitarist\n*  1952   – Indira Samarasekera, Sri Lankan engineer and academic\n*  1952   – Peter Windsor, English-Australian journalist and sportscaster\n*1953 – Guy Verhofstadt, Belgian politician, 47th Prime Minister of Belgium\n*  1953   – Andrew Wiles, English mathematician and academic\n*1954 – Abdullah Atalar, Turkish engineer and academic\n*  1954   – Aleksandr Averin Azerbaijani cyclist and coach\n*  1954   – Francis Lickerish, English guitarist and composer \n*  1954   – David Perrett, Scottish psychologist and academic\n*  1954   – Ian Redmond, English biologist and conservationist\n*  1954   – Willie Royster, American baseball player (d. 2015)\n*1955 – Kevin Brady, American lawyer and politician\n*  1955   – Michael Callen, American singer-songwriter and AIDS activist (d. 1993)\n*  1955   – Micheal Ray Richardson, American basketball player and coach\n*1958 – Stuart Adamson, Scottish singer-songwriter and guitarist (d. 2001)\n*  1958   – Lyudmila Kondratyeva, Russian sprinter \n*1959 – Pierre Lacroix, Canadian ice hockey player\n*  1959   – Ana María Polo, Cuban-American lawyer and judge\n*1960 – Jeremy Clarkson, English journalist and television presenter\n*1961 – Vincent Gallo, American actor, director, producer, and musician\n*  1961   – Doug Hopkins, American guitarist and songwriter (d. 1993)\n*  1961   – Nobuaki Kakuda, Japanese martial artist\n*1962 – Franck Ducheix, French fencer\n*  1962   – Mark Lawson, English journalist and author\n*1963 – Billy Bowden, New Zealand cricketer and umpire\n*  1963   – Waldemar Fornalik, Polish footballer and manager\n*  1963   – June and Jennifer Gibbons, identical twins known as \"The Silent Twins\"\n*  1963   – Elizabeth Smylie, Australian tennis player\n*1964 – Steve Azar, American singer-songwriter and guitarist\n*  1964   – John Cryer, English journalist and politician\n*  1964   – Johann Sebastian Paetsch, American cellist\n*  1964   – Bret Saberhagen, American baseball player and coach\n*  1964   – Patrick Sang, Kenyan runner\n*1966 – Steve Scarsone, American baseball player and manager\n*  1966   – Lisa Stansfield, English singer-songwriter and actress \n*1968 – Sergei Lukyanenko, Kazakh-Russian journalist and author\n*1969 – Cerys Matthews, Welsh singer-songwriter\n*  1969   – Michael von Grünigen, Swiss skier\n*1970 – Trevor Linden, Canadian ice hockey player and manager\n*  1970   – Delroy Pearson, English singer-songwriter and producer \n*1971 – John Leech, English politician\n*  1971   – Oliver Riedel, German bass player \n*1972 – Balls Mahoney, American wrestler (d. 2016)\n*  1972   – Allan Théo, French singer\n*  1972   – Jason Varitek, American baseball player and manager\n*1973 – Jennifer Esposito, American actress \n*  1973   – Olivier Magne, French rugby player\n*1974 – Àlex Corretja, Spanish tennis player and coach\n*  1974   – Ashot Danielyan, Armenian weightlifter\n*  1974   – David Jassy, Swedish singer-songwriter and producer \n*  1974   – Zöe Lucker, English actress\n*  1974   – Trot Nixon, American baseball player and sportscaster\n*1975 – Olga Hostáková, Czech tennis player\n*  1975   – Walid Soliman, Tunisian author and translator\n*1976 – Kelvim Escobar, Venezuelan baseball player\n*1977 – Ivonne Teichmann, German runner\n*1978 – Josh Hancock, American baseball player (d. 2007)\n*  1978   – Tom Thacker, Canadian singer-songwriter, guitarist, and producer \n*1979 – Malcolm Christie, English footballer\n*  1979   – Sebastien Grainger, Canadian singer-songwriter and guitarist \n*  1979   – Michel Riesen, Swiss ice hockey player\n*1980 – Keiji Tamada, Japanese footballer\n*  1980   – Mark Teixeira, American baseball player\n*1981 – Alexandre Burrows, Canadian ice hockey player\n*  1981   – Veronica Pyke, Australian cricketer\n*1982 – Ian Bell, English cricketer\n*  1982   – Peeter Kümmel, Estonian skier\n*1983 – Jennifer Heil, Canadian skier\n*  1983   – Rubén Palazuelos, Spanish footballer\n*  1983   – Nicky Pastorelli, Dutch race car driver\n*1984 – Kelli Garner, American actress\n*  1984   – Nikola Karabatić, French handball player\n*1985 – Pablo Hernández Domínguez, Spanish footballer\n*  1985   – Will Minson, Australian footballer\n*1986 – Dai Greene, Welsh hurdler\n*  1986   – Lena Schöneborn, German pentathlete\n*1987 – Joss Stone, English singer-songwriter and actress \n*1988 – Leland Irving, Canadian ice hockey player\n*  1989   – Torrin Lawrence, American sprinter (d. 2014)\n*1990 – Dimitrios Anastasopoulos, Greek footballer\n*  1990   – Thulani Serero, South African footballer\n*1991 – Thiago Alcântara, Spanish footballer\n*1996 – Dele Alli, English footballer\n*1997 – Georgia Bohl, Australian swimmer\n*  1997   – Miriam Kolodziejová, Czech tennis player\n\nDeaths\n\n* 618 – Emperor Yang of Sui, emperor of the Sui Dynasty (b. 569)\n* 678 – Pope Donus\n* 924 – Herman I, archbishop of Cologne\n*1034 – Romanos III Argyros, Byzantine emperor (b. 968)\n*1077 – Anawrahta, king of Burma and founder of the Pagan Empire (b. 1014)\n*1079 – Stanislaus of Szczepanów, bishop of Kraków (b. 1030)\n*1165 – Stephen IV of Hungary (b. 1133)\n*1240 – Llywelyn the Great, Welsh prince (b. 1172)\n*1447 – Henry Beaufort, Cardinal, Lord Chancellor of England (b. 1377)\n*1512 – Gaston de Foix, French military commander (b. 1489)\n*1554 – Thomas Wyatt the Younger, English rebel leader (b. 1521)\n*1587 – Thomas Bromley, English lord chancellor (b. 1530)\n*1609 – John Lumley, 1st Baron Lumley, English noble (b. 1533)\n*1612 – Emanuel van Meteren, Flemish historian and author (b. 1535)\n*  1612   – Edward Wightman, English minister and martyr (b. 1566)\n*1626 – Marino Ghetaldi, Ragusan mathematician and physicist (b. 1568)\n*1712 – Richard Simon, French priest and critic (b. 1638)\n*1723 – John Robinson, English bishop and diplomat (b. 1650)\n*1783 – Nikita Ivanovich Panin, Polish-Russian politician, Russian Minister of Foreign Affairs (b. 1718)\n*1798 – Karl Wilhelm Ramler, German poet and academic (b. 1725)\n*1856 – Juan Santamaría, Costa Rican soldier (b. 1831)\n*1861 – Francisco González Bocanegra, Mexican poet and composer (b. 1824)\n*1873 – Edward Canby, American general (b. 1817)\n*1890 – David de Jahacob Lopez Cardozo, Dutch Talmudist (b. 1808)\n*  1890   – Joseph Merrick, English man with severe deformities (b. 1862)\n*1894 – Constantin Lipsius, German architect and theorist (b. 1832) \n*1895 – Julius Lothar Meyer, German chemist (b. 1830) \n*1902 – Wade Hampton III, American general and politician, 77th Governor of South Carolina (b. 1818)\n*1903 – Gemma Galgani, Italian mystic and saint (b. 1878)\n*1906 – James Anthony Bailey, American businessman, co-founded Ringling Bros. and Barnum & Bailey Circus (b. 1847)\n*  1906   – Francis Pharcellus Church, American journalist and publisher, co-founded Armed Forces Journal and The Galaxy Magazine (b. 1839)\n*1908 – Henry Bird, English chess player and author (b. 1829)\n*1916 – Richard Harding Davis, American journalist and author (b. 1864)\n*1918 – Otto Wagner, Austrian architect and urban planner (b. 1841)\n*1926 – Luther Burbank, American botanist and academic (b. 1849)\n*1939 – Kurtdereli Mehmet, Turkish wrestler (b. 1864)\n*1953 – Kid Nichols, American baseball player and manager (b. 1869)\n*1954 – Paul Specht, American violinist and bandleader (b. 1895)\n*1958 – Konstantin Yuon, Russian painter and educator (b. 1875)\n*1960 – Rosa Grünberg, Swedish actress (b. 1878)\n*1962 – Ukichiro Nakaya, Japanese physicist and academic (b. 1900)\n*  1962   – George Poage, American hurdler and educator (b. 1880)\n*1967 – Thomas Farrell, American general (b. 1891)\n*  1967   – Donald Sangster, Jamaican lawyer and politician, 2nd Prime Minister of Jamaica (b. 1911)\n*1970 – Cathy O'Donnell, American actress (b. 1923)\n*  1970   – John O'Hara, American novelist and short story writer  (b. 1905)\n*1974 – Ernst Ziegler, German actor (b. 1894)\n*1977 – Jacques Prévert, French poet and screenwriter (b. 1900)\n*  1977   – Phanishwar Nath 'Renu', Indian author and activist (b. 1921)\n*1980 – Ümit Kaftancıoğlu, Turkish journalist and producer (b. 1935)\n*1981 – Caroline Gordon, American author and critic (b. 1895)\n*1983 – Dolores del Río, Mexican actress (b. 1904)\n*1984 – Edgar V. Saks, Estonian historian and politician, Estonian Minister of Education (b. 1910)\n*1985 – Bunny Ahearne, Irish-born English businessman (b. 1900)\n*  1985   – John Gilroy, English artist and illustrator (b. 1898)\n*  1985   – Enver Hoxha, Albanian educator and politician, 21st Prime Minister of Albania (b. 1908)\n*1987 – Erskine Caldwell,  American novelist and short story writer (b. 1903)\n*  1987   – Primo Levi, Italian chemist and author (b. 1919)\n*1990 – Harold Ballard, Canadian businessman (b. 1903)\n*1991 – Walker Cooper, American baseball player and manager (b. 1915)\n*  1991   – Bruno Hoffmann. German glass harp player (b. 1913)\n*1992 – James Brown, American actor and singer (b. 1920)\n*  1992   – Eve Merriam, American author and poet (b. 1916)\n*  1992   – Alejandro Obregón, Colombian painter, sculptor, and engraver (b. 1920)\n*1996 – Jessica Dubroff, American pilot (b. 1988)\n*1997 – Muriel McQueen Fergusson, Canadian lawyer and politician, Canadian Speaker of the Senate (b. 1899)\n*1997 – Wang Xiaobo, contemporary Chinese novelist and essayist (b. 1952)\n*1999 – William H. Armstrong, American author and educator (b. 1911)\n*2000 – Diana Darvey, English actress, singer and dancer (b. 1945)\n*2001 – Harry Secombe, Welsh-English actor (b. 1921)\n*2003 – Cecil Howard Green, English-American geophysicist and businessman, founded Texas Instruments (b. 1900)\n*2005 – André François, Romanian-French cartoonist, painter, and sculptor (b. 1915)\n*  2005   – Lucien Laurent, French footballer and coach (b. 1907)\n*2006 – June Pointer, American singer (b. 1953)\n*2007 – Roscoe Lee Browne, American actor and director (b. 1922)\n*  2007   – Loïc Leferme, French diver (b. 1970)\n*  2007   – Janet McDonald, American lawyer and author (b. 1954)\n*  2007   – Ronald Speirs, Scottish-American colonel (b. 1920)\n*  2007   – Kurt Vonnegut, American novelist, short story writer, and playwright (b. 1922)\n*2008 – Merlin German, American sergeant (b. 1985)\n*2009 – Gerda Gilboe, Danish actress and singer (b. 1914)\n*  2009   – Vishnu Prabhakar, Indian author and playwright (b. 1912)\n*  2009   – Corín Tellado, Spanish author (b. 1927)\n*2010 – Julia Tsenova, Bulgarian pianist and composer (b. 1948)\n*2011 – Larry Sweeney, American wrestler and manager (b. 1981)\n*2012 – Ahmed Ben Bella, Algerian soldier and politician, 1st President of Algeria (b. 1916)\n*  2012   – Roger Caron, Canadian criminal and author (b. 1938)\n*  2012   – Tippy Dye, American basketball player and coach (b. 1915)\n*  2012   – Hal McKusick, American saxophonist, clarinet player, and flute player (b. 1924)\n*  2012   – Agustin Roman, American bishop (b. 1928)\n*2013 – Don Blackman, American singer-songwriter, pianist, and producer (b. 1953)\n*  2013   – Grady Hatton, American baseball player, coach, and manager (b. 1922)\n*  2013   – Thomas Hemsley, English actor and singer (b. 1927)\n*  2013   – Hilary Koprowski, Polish-American virologist and immunologist (b. 1916)\n*  2013   – Gilles Marchal, French singer-songwriter (b. 1944)\n*  2013   – Maria Tallchief, American ballerina (b. 1925)\n*  2013   – Clorindo Testa, Italian-Argentinian architect (b. 1923)\n*  2013   – Jonathan Winters, American comedian, actor and screenwriter (b. 1925)\n*2014 – Rolf Brem, Swiss sculptor and illustrator (b. 1926)\n*  2014   – Edna Doré, English actress (b. 1921)\n*  2014   – Bill Henry, American baseball player (b. 1927)\n*  2014   – Lou Hudson, American basketball player and sportscaster (b. 1944)\n*  2014   – Myer S. Kripke, American rabbi and scholar (b. 1914)\n*  2014   – Sergey Nepobedimy, Russian engineer (b. 1921)\n*  2014   – Jesse Winchester, American singer-songwriter, guitarist, and producer (b. 1944)\n*2015 – Jimmy Gunn, American football player (b. 1948)\n*  2015   – Muhammad Kamaruzzaman, Bangladeshi journalist and politician (b. 1952)\n*  2015   – François Maspero, French journalist and author (b. 1932)\n*  2015   – Hanut Singh Rathore, Indian general (b. 1933)\n*  2015   – Tekena Tamuno, Nigerian historian and academic (b. 1932)\n*2017 – J. Geils, American singer and guitarist (b. 1946)\n*  2017   – Mark Wainberg, Canadian researcher and HIV/AIDS activist (b. 1945)\n\nHolidays and observances\n\n*Christian feast day:\n**Antipas of Pergamum (Greek Orthodox Church)\n**Gemma Galgani\n**Godeberta\n**Guthlac of Crowland\n**George Selwyn (Anglicanism)\n**Stanislaus of Szczepanów\n**April 11 (Eastern Orthodox liturgics)\n*Juan Santamaría Day, anniversary of his death in the Second Battle of Rivas. (Costa Rica)\n*International Louie Louie Day\n*World Parkinson's Day. April 11. http://en.wikipedia.org/?curid=2395."
  }
}
