{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7425",
  "eid" : "e171c9e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778457982,
  "textBody" : "An electromagnetic coil is an electrical conductor such as a wire in the shape of a coil, spiral or helix.  Electromagnetic coils are used in electrical engineering, in applications where electric currents interact with magnetic fields, in devices such as electric motors, generators, inductors, electromagnets, transformers, and sensor coils.  Either an electric current is passed through the wire of the coil to generate a magnetic field,  or conversely an external time-varying magnetic field through the interior of the coil generates an EMF (voltage) in the conductor.\n\nA current through any conductor creates a circular magnetic field around the conductor due to Ampere's law.  The advantage of using the coil shape is that it increases the strength of magnetic field produced by a given current.  The magnetic fields generated by the separate turns of wire all pass through the center of the coil and add (superpose) to produce a strong field there.  The more turns of wire, the stronger the field produced.   Conversely, a changing external magnetic flux induces a voltage in a conductor such as a wire, due to Faraday's law of induction.[https://books.google.com/books?id\nlROa-MpIrucC&pgPA129&dq\nFaradays+law    Newnes 2002, p. 129]  The induced voltage can be increased by winding the wire into a coil, because the field lines intersect the circuit multiple times.\n\nThe direction of the magnetic field produced by a coil can be determined by the right hand grip rule.  If the fingers of the right hand are wrapped around the magnetic core of a coil in the direction of conventional current through the wire, the thumb will point in the direction the magnetic field lines  pass through the coil.  The end of a magnetic core from which the field lines emerge is defined to be the North pole.\n\nThere are many different types of coils used in electric and electronic equipment.\n\nWindings and taps\n\nThe wire or conductor which constitutes the coil is called the winding.  The hole in the center of the coil is called the core area or magnetic axis.  Each loop of wire is called a  turn.  In windings in which the turns touch, the wire must be insulated with a coating of nonconductive insulation such as plastic or enamel to prevent the current from passing between the wire turns. The winding is often wrapped around a coil form made of plastic or other material to hold it in place.  The ends of the wire are brought out and attached to an external circuit. Windings may have additional electrical connections along their length; these are called taps.  A winding which has a single tap in the center of its length is called center-tapped.\n\nCoils can have more than one winding, insulated electrically from each other. When there are two or more windings around a common magnetic axis, the windings are said to be inductively coupled or magnetically coupled.  A time-varying current through one winding will create a time-varying magnetic field which passes through the other winding, which will induce a time-varying voltage in the other windings. This is called a transformer.  The winding to which current is applied, which creates the magnetic field, is called the primary winding. The other windings are called secondary windings.\n\nMagnetic core\n\nMany electromagnetic coils have a magnetic core, a piece of ferromagnetic material like iron in the center to increase the magnetic field.  The current through the coil magnetizes the iron, and the field of the magnetized material adds to the field produced by the wire. This is called a ferromagnetic-core or iron-core coil.  A ferromagnetic core can increase the magnetic field and inductance of a coil by hundreds or thousands of times over what it would be without the core. A ferrite core coil is a variety of coil with a core made of ferrite, a ferrimagnetic ceramic compound.  Ferrite coils have lower core losses at high frequencies.\n*A coil with a core which forms a closed loop, possibly with some narrow air gaps, is called a closed-core coil.  By providing a closed path for the magnetic field lines, this geometry minimizes the magnetic reluctance and produces the strongest magnetic field. It is often used in transformers.   \n**A common form for closed-core coils is a toroidal core coil, in which the core has the shape of a torus or doughnut, with either a circular or rectangular cross section. This geometry has minimum leakage flux and radiates minimum electromagnetic interference (EMI).   \n*A coil with a core which is a straight bar or other non-loop shape is called an open-core coil.  This has lower magnetic field and inductance than a closed core, but is often used to prevent magnetic saturation of the core.   \nA coil without a ferromagnetic core is called an air-core coil. This includes coils wound on plastic or other nonmagnetic forms, as well as coils which actually have empty air space inside their windings.\n\nTypes of coils\n\nCoils can be classified by the frequency of the current they are designed to operate with:\n*Direct current or DC coils or electromagnets operate with a steady direct current in their windings \n*Audio-frequency or AF coils, inductors or transformers operate with alternating currents in the  audio frequency range, less than 20 kHz\n*Radio-frequency or RF coils, inductors or transformers operate with alternating currents in the radio frequency range, above 20 kHz\n\nCoils can be classified by their function:\n\nElectromagnets\n\nElectromagnets are coils that generate a magnetic field for some external use, often to exert a mechanical force on something.  A few specific types:\n*Solenoid - an electromagnet in the form of a straight hollow helix of wire\n*Motor and generator windings - iron core electromagnets on the rotor or stator of electric motors and generators which act on each other to either turn the shaft (motor) or generate an electric current (generator)\n**Field winding - an iron-core coil which generates a steady magnetic field to act on the armature winding.\n**Armature winding - an iron-core coil which is acted on by the magnetic field of the field winding to either create torque (motor) or induce a voltage to produce power (generator)\n*Helmholtz coil, Maxwell coil - air-core coils which serve to cancel an external magnetic field\n*Degaussing coil - a coil used to demagnetize parts\n*Voice coil - a coil used in a moving-coil loudspeaker, suspended between the poles of a magnet. When the audio signal is passed through the coil, it vibrates, moving the attached speaker cone to create sound waves. The reverse is used in a dynamic microphone, where sound vibrations intercepted by something like a diaphragm physically transfer to a voice coil immersed in a magnetic field, and the coil's terminal ends then provide an electric analog of those vibrations.\n\nInductors\n\nInductors or reactors are coils which generate a magnetic field which interacts with the coil itself, to induce a back EMF which opposes changes in current through the coil. Inductors are used as circuit elements in electrical circuits, to temporarily store energy or resist changes in current. A few types:\n*Tank coil - an inductor used in a tuned circuit\n*Choke - an inductor used to block high frequency AC while allowing through low frequency AC.\n*Loading coil - an inductor used to add inductance to an antenna, to make it resonant, or to a cable to prevent distortion of signals.\n*Variometer - an adjustable inductor consisting of two coils in series, an outer stationary coil and a second one inside it which can be rotated so their magnetic axes are in the same direction or opposed.\n*Flyback transformer - Although called a transformer, this is actually an inductor which serves to store energy in switching power supplies and horizontal deflection circuits for  CRT televisions and monitors\n*Saturable reactor - an iron-core inductor used to control AC power by varying the saturation of the core using a DC control voltage in an auxiliary winding.\n*Inductive ballast - an inductor used in gas-discharge lamp circuits, such as fluorescent lamps, to limit the current through the lamp.\n\nTransformers\n\nA transformer is a device with two or more magnetically coupled windings (or sections of a single winding). A time varying current in one coil (called the primary winding) generates a magnetic field which induces a voltage in the other coil (called the secondary winding). A few types:\n*Distribution transformer - A transformer in an electric power grid which transforms the high voltage from the electric power line to the lower voltage used by utility customers.\n*Autotransformer - a transformer with only one winding. Different portions of the winding, accessed with taps, act as  primary and secondary windings of the transformer.  \n*Toroidal transformer - the core is in the shape of a toroid. This is a commonly used shape as it decreases the leakage flux, resulting in less electromagnetic interference.\n*Induction coil or trembler coil - an early transformer which uses a vibrating interrupter mechanism to break the primary current so it can operate off of DC current. \n**Ignition coil - an induction coil used in internal combustion engines to create a pulse of high voltage to fire the spark plug which initiates the fuel burning.\n*Balun - a transformer which matches a balanced transmission line to an unbalanced one.\n*Bifilar coil - a coil wound with two parallel, closely spaced strands. If AC currents are passed through it in the same direction, the magnetic fluxes will add, but if equal currents in opposite directions pass through the windings the opposite fluxes will cancel, resulting in zero flux in the core. So no voltage will be induced in a third winding on the core. These are used in instruments and in devices like Ground Fault Interrupters. They are also used in low inductance wirewound resistors for use at RF frequencies.\n*Audio transformer - A transformer used with audio signals. They are used for impedance matching.\n**Hybrid coil - a specialized audio transformer with 3 windings used in telephony circuits to convert between two-wire and four-wire circuits\n\nElectric machines\n\nElectric machines such as motors and generators have one or more windings which interact with moving magnetic fields to convert electrical energy to mechanical energy.  Often a machine will have one winding through which passes most of the power of the machine (the  \"armature\"), and a second winding which provides the magnetic field of the rotating element ( the \"field winding\") which may be connected by brushes or slip rings to an external source of electric current. In an induction  motor, the \"field\" winding of the rotor is energized by the slow relative motion between the rotating winding and the rotating magnetic field produced by the stator winding, which induces the necessary exciting current in the rotor. \n \nTransducer coils\n\nThese are coils used to translate time-varying magnetic fields to electric signals, and vice versa. A few types:\n*Sensor or pickup coils - these are used to detect external time-varying magnetic fields \n*Inductive sensor - a coil which senses when a magnet or iron object passes near it \n*Recording head - a coil which is used to create a magnetic field to write data to a magnetic storage medium, such as magnetic tape, or a hard disk. Conversely it is also used to read the data in the form of changing magnetic fields in the medium.\n*Induction heating coil - an AC coil used to heat an object by inducing eddy currents in it, a process called induction heating.\n*Loop antenna - a coil which serves as a radio antenna, to convert radio waves to electric currents. \n*Rogowski coil - a toroidal coil used as an AC measuring device\n*Musical instrument pickup - a coil used to produce the output audio signal in an electric guitar or electric bass.\n*Flux gate - a sensor coil used in a magnetometer\n*Magnetic phonograph cartridge - a sensor in a record player that uses a coil to translate vibration of a needle to an audio signal in playing vinyl phonograph records.\n\nThere are also types of coil which don't fit into these categories.\n\nWinding technology",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Electromagnetic coil" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7425" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "An electromagnetic coil is an electrical conductor such as a wire in the shape of a coil, spiral or helix.  Electromagnetic coils are used in electrical engineering, in applications where electric currents interact with magnetic fields, in devices such as electric motors, generators, inductors, electromagnets, transformers, and sensor coils.  Either an electric current is passed through the wire of the coil to generate a magnetic field,  or conversely an external time-varying magnetic field through the interior of the coil generates an EMF (voltage) in the conductor.\n\nA current through any conductor creates a circular magnetic field around the conductor due to Ampere's law.  The advantage of using the coil shape is that it increases the strength of magnetic field produced by a given current.  The magnetic fields generated by the separate turns of wire all pass through the center of the coil and add (superpose) to produce a strong field there.  The more turns of wire, the stronger the field produced.   Conversely, a changing external magnetic flux induces a voltage in a conductor such as a wire, due to Faraday's law of induction.[https://books.google.com/books?id\nlROa-MpIrucC&pgPA129&dq\nFaradays+law    Newnes 2002, p. 129]  The induced voltage can be increased by winding the wire into a coil, because the field lines intersect the circuit multiple times.\n\nThe direction of the magnetic field produced by a coil can be determined by the right hand grip rule.  If the fingers of the right hand are wrapped around the magnetic core of a coil in the direction of conventional current through the wire, the thumb will point in the direction the magnetic field lines  pass through the coil.  The end of a magnetic core from which the field lines emerge is defined to be the North pole.\n\nThere are many different types of coils used in electric and electronic equipment.\n\nWindings and taps\n\nThe wire or conductor which constitutes the coil is called the winding.  The hole in the center of the coil is called the core area or magnetic axis.  Each loop of wire is called a  turn.  In windings in which the turns touch, the wire must be insulated with a coating of nonconductive insulation such as plastic or enamel to prevent the current from passing between the wire turns. The winding is often wrapped around a coil form made of plastic or other material to hold it in place.  The ends of the wire are brought out and attached to an external circuit. Windings may have additional electrical connections along their length; these are called taps.  A winding which has a single tap in the center of its length is called center-tapped.\n\nCoils can have more than one winding, insulated electrically from each other. When there are two or more windings around a common magnetic axis, the windings are said to be inductively coupled or magnetically coupled.  A time-varying current through one winding will create a time-varying magnetic field which passes through the other winding, which will induce a time-varying voltage in the other windings. This is called a transformer.  The winding to which current is applied, which creates the magnetic field, is called the primary winding. The other windings are called secondary windings.\n\nMagnetic core\n\nMany electromagnetic coils have a magnetic core, a piece of ferromagnetic material like iron in the center to increase the magnetic field.  The current through the coil magnetizes the iron, and the field of the magnetized material adds to the field produced by the wire. This is called a ferromagnetic-core or iron-core coil.  A ferromagnetic core can increase the magnetic field and inductance of a coil by hundreds or thousands of times over what it would be without the core. A ferrite core coil is a variety of coil with a core made of ferrite, a ferrimagnetic ceramic compound.  Ferrite coils have lower core losses at high frequencies.\n*A coil with a core which forms a closed loop, possibly with some narrow air gaps, is called a closed-core coil.  By providing a closed path for the magnetic field lines, this geometry minimizes the magnetic reluctance and produces the strongest magnetic field. It is often used in transformers.   \n**A common form for closed-core coils is a toroidal core coil, in which the core has the shape of a torus or doughnut, with either a circular or rectangular cross section. This geometry has minimum leakage flux and radiates minimum electromagnetic interference (EMI).   \n*A coil with a core which is a straight bar or other non-loop shape is called an open-core coil.  This has lower magnetic field and inductance than a closed core, but is often used to prevent magnetic saturation of the core.   \nA coil without a ferromagnetic core is called an air-core coil. This includes coils wound on plastic or other nonmagnetic forms, as well as coils which actually have empty air space inside their windings.\n\nTypes of coils\n\nCoils can be classified by the frequency of the current they are designed to operate with:\n*Direct current or DC coils or electromagnets operate with a steady direct current in their windings \n*Audio-frequency or AF coils, inductors or transformers operate with alternating currents in the  audio frequency range, less than 20 kHz\n*Radio-frequency or RF coils, inductors or transformers operate with alternating currents in the radio frequency range, above 20 kHz\n\nCoils can be classified by their function:\n\nElectromagnets\n\nElectromagnets are coils that generate a magnetic field for some external use, often to exert a mechanical force on something.  A few specific types:\n*Solenoid - an electromagnet in the form of a straight hollow helix of wire\n*Motor and generator windings - iron core electromagnets on the rotor or stator of electric motors and generators which act on each other to either turn the shaft (motor) or generate an electric current (generator)\n**Field winding - an iron-core coil which generates a steady magnetic field to act on the armature winding.\n**Armature winding - an iron-core coil which is acted on by the magnetic field of the field winding to either create torque (motor) or induce a voltage to produce power (generator)\n*Helmholtz coil, Maxwell coil - air-core coils which serve to cancel an external magnetic field\n*Degaussing coil - a coil used to demagnetize parts\n*Voice coil - a coil used in a moving-coil loudspeaker, suspended between the poles of a magnet. When the audio signal is passed through the coil, it vibrates, moving the attached speaker cone to create sound waves. The reverse is used in a dynamic microphone, where sound vibrations intercepted by something like a diaphragm physically transfer to a voice coil immersed in a magnetic field, and the coil's terminal ends then provide an electric analog of those vibrations.\n\nInductors\n\nInductors or reactors are coils which generate a magnetic field which interacts with the coil itself, to induce a back EMF which opposes changes in current through the coil. Inductors are used as circuit elements in electrical circuits, to temporarily store energy or resist changes in current. A few types:\n*Tank coil - an inductor used in a tuned circuit\n*Choke - an inductor used to block high frequency AC while allowing through low frequency AC.\n*Loading coil - an inductor used to add inductance to an antenna, to make it resonant, or to a cable to prevent distortion of signals.\n*Variometer - an adjustable inductor consisting of two coils in series, an outer stationary coil and a second one inside it which can be rotated so their magnetic axes are in the same direction or opposed.\n*Flyback transformer - Although called a transformer, this is actually an inductor which serves to store energy in switching power supplies and horizontal deflection circuits for  CRT televisions and monitors\n*Saturable reactor - an iron-core inductor used to control AC power by varying the saturation of the core using a DC control voltage in an auxiliary winding.\n*Inductive ballast - an inductor used in gas-discharge lamp circuits, such as fluorescent lamps, to limit the current through the lamp.\n\nTransformers\n\nA transformer is a device with two or more magnetically coupled windings (or sections of a single winding). A time varying current in one coil (called the primary winding) generates a magnetic field which induces a voltage in the other coil (called the secondary winding). A few types:\n*Distribution transformer - A transformer in an electric power grid which transforms the high voltage from the electric power line to the lower voltage used by utility customers.\n*Autotransformer - a transformer with only one winding. Different portions of the winding, accessed with taps, act as  primary and secondary windings of the transformer.  \n*Toroidal transformer - the core is in the shape of a toroid. This is a commonly used shape as it decreases the leakage flux, resulting in less electromagnetic interference.\n*Induction coil or trembler coil - an early transformer which uses a vibrating interrupter mechanism to break the primary current so it can operate off of DC current. \n**Ignition coil - an induction coil used in internal combustion engines to create a pulse of high voltage to fire the spark plug which initiates the fuel burning.\n*Balun - a transformer which matches a balanced transmission line to an unbalanced one.\n*Bifilar coil - a coil wound with two parallel, closely spaced strands. If AC currents are passed through it in the same direction, the magnetic fluxes will add, but if equal currents in opposite directions pass through the windings the opposite fluxes will cancel, resulting in zero flux in the core. So no voltage will be induced in a third winding on the core. These are used in instruments and in devices like Ground Fault Interrupters. They are also used in low inductance wirewound resistors for use at RF frequencies.\n*Audio transformer - A transformer used with audio signals. They are used for impedance matching.\n**Hybrid coil - a specialized audio transformer with 3 windings used in telephony circuits to convert between two-wire and four-wire circuits\n\nElectric machines\n\nElectric machines such as motors and generators have one or more windings which interact with moving magnetic fields to convert electrical energy to mechanical energy.  Often a machine will have one winding through which passes most of the power of the machine (the  \"armature\"), and a second winding which provides the magnetic field of the rotating element ( the \"field winding\") which may be connected by brushes or slip rings to an external source of electric current. In an induction  motor, the \"field\" winding of the rotor is energized by the slow relative motion between the rotating winding and the rotating magnetic field produced by the stator winding, which induces the necessary exciting current in the rotor. \n \nTransducer coils\n\nThese are coils used to translate time-varying magnetic fields to electric signals, and vice versa. A few types:\n*Sensor or pickup coils - these are used to detect external time-varying magnetic fields \n*Inductive sensor - a coil which senses when a magnet or iron object passes near it \n*Recording head - a coil which is used to create a magnetic field to write data to a magnetic storage medium, such as magnetic tape, or a hard disk. Conversely it is also used to read the data in the form of changing magnetic fields in the medium.\n*Induction heating coil - an AC coil used to heat an object by inducing eddy currents in it, a process called induction heating.\n*Loop antenna - a coil which serves as a radio antenna, to convert radio waves to electric currents. \n*Rogowski coil - a toroidal coil used as an AC measuring device\n*Musical instrument pickup - a coil used to produce the output audio signal in an electric guitar or electric bass.\n*Flux gate - a sensor coil used in a magnetometer\n*Magnetic phonograph cartridge - a sensor in a record player that uses a coil to translate vibration of a needle to an audio signal in playing vinyl phonograph records.\n\nThere are also types of coil which don't fit into these categories.\n\nWinding technology. Electromagnetic coil. http://en.wikipedia.org/?curid=7425."
  }
}
