{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5026",
  "eid" : "d1e5d6b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778431899,
  "textBody" : "The Brisbane Lions is a professional Australian rules football club which plays in the Australian Football League (AFL). The club is based in Brisbane, Queensland, Australia. The club was formed in 1996 from the merger of the Fitzroy Football Club and the Brisbane Bears. The Lions are one of the most successful AFL clubs of the 21st century, having appeared in four consecutive AFL Grand Finals from 2001 to 2004 and winning three premierships (2001, 2002, 2003).\n\nThe club is based at the Gabba. The team is captained by Dayne Beams and coached by Chris Fagan.\n\nHistory: Start of a new era\n\nThe Brisbane Lions were officially launched on 1 November 1996, joining the national competition in 1997.\n\nBeginnings: 1997–2000\n\nIn their first year as a combined club the Lions made the finals, finishing in eighth position after being defeated by the St Kilda Football Club in a qualifying final. The following year, however, they finished in last position, despite boasting a talented playing list.\n\nTriple premiership success: 2001–2003\n\nAs the Brisbane Lions, the club won its first AFL premiership in the 2001 AFL Grand Final, defeating Essendon 15.18 (108) to 12.10 (82). Lions utility player Shaun Hart won the Norm Smith Medal as best on ground in the Grand Final.\n\nIn 2002, the Lions won back-to-back premierships when they defeated Collingwood 9.12 (66) to 10.15 (75) in the 2002 AFL Grand Final in cold and wet conditions at the Melbourne Cricket Ground. Early in the contest the Lions lost both ruckman Beau McDonald and utility player Martin Pike (who had already had nine possessions in the first quarter) to injury and had to complete the match with a limited bench.\n\nIn 2003, the Lions would win their 3rd premiership in a row, and second in a row against the Collingwood Magpies. With a number of players under an injury cloud – and having lost to Collingwood in a qualifying final at the Melbourne Cricket Ground three weeks previously – the Lions went into the game as underdogs. However, they sealed their place in history as an AFL dynasty by thrashing the Magpies in cool but sunny conditions. At one stage in the final quarter the Lions led by almost 80 points before relaxing when the match was well and truly won, allowing Collingwood to score the last four goals. The final score of 20.14 (134) to 12.12 (84) saw the club become only the fourth in VFL/AFL history to win three consecutive premierships and the first since the creation of the AFL. Simon Black claimed the Norm Smith Medal with a dominant 39 possession match, the most possessions ever gathered by a player in a grand final.\n\nThe 2004 season saw Brisbane remain in the top portion of the ladder for most of the season. Reaching the finals in second position, Brisbane controversially had to travel to Melbourne to play against Geelong in the preliminary final, due to a contract between the Melbourne Cricket Ground (MCG) and the Australian Football League (AFL) that required one preliminary final to be played each year at the MCG. Port Adelaide had finished on top of the ladder and hosted the other preliminary final in Adelaide.  Despite this setback, Brisbane beat Geelong and reached the AFL Grand Final for the fourth consecutive year.  Their opponents, Port Adelaide, playing in their first ever grand final, were too good on the day and recorded a 40-point win.\n\nRebuild of the Lions' second generation: 2005–2008\n\nThe Lions began the 2006 season optimistically, but injuries again plagued the club, whose players recorded an AFL record total of 200 matches lost to injury for the season.\n\nThe Brisbane Lions finished runner up in the 2007 NAB Cup and then went on to create history by being the first team in the history of the AFL to have five co-captains. That year, the Lions failed to make the finals for a third successive year in 2007.\n\nThe Lions began the 2008 NAB Cup shakily, losing to Essendon by 27 points. The team struggled for the season and missed out on the finals with a 10–12 record, losing 3 games despite having at least 5 more scoring shots in each of those games. Coach Leigh Matthews resigned at the end of the season after 10 seasons and 3 premierships with the club.\n\nMichael Voss: 2009–2013\n\nThe Lions made a good start in the 2009 NAB Cup under new senior coach Michael Voss by registering a 9-point win over St Kilda. However this was followed by a series of losses in the pre-season to Essendon, Melbourne and Richmond. Their season ended with a 51-point loss to the Western Bulldogs.\n\nThe 2009/2010 off-season was dominated by the arrival of Brendan Fevola from Carlton, and the hype was focused on Fevola and Jonathan Brown in the sense that the Lions could capitalise on their strong 2009 season. Indeed, the Lions won their first four matches of the 2010 season to be top of the ladder after four rounds, but they would only win three more games after that to crash to a lowly finish by season's end. One of those wins however, was against eventual premiers .\n\nThe Lions' 2010/2011 off-season was disrupted by the sacking of Fevola after just one season at the Lions, following repeated off-field indiscretions which included getting drunk in the Brisbane streets during New Year's Eve celebrations. On the field, the Lions won only four games for the year, but only one against any Victorian team, and that was , in Round 9. Despite their worst season since 1998, coach Michael Voss was granted a contract extension after the board recommended that Voss was the best man to take the club forward into the future. Leading into season 2012, only two players from the triple-premiership winning team of 2001–2003 remained: Simon Black and Jonathan Brown.\n\nThe 2013 season started well for Brisbane, defeating Carlton in the final of the NAB Cup, with Daniel Rich winning the Michael Tuck Medal for best on ground and Aaron Cornelius showing some good form. However, things began to decline from then, with losses to the Western Bulldogs and Adelaide. However, in the 5th QClash match against Gold Coast, the Lions won by two points, with Jonathan Brown winning the Marcus Ashcroft Medal. Injuries were beginning to take a toll, with young players Claye Beams and Jared Polec suffering severe injuries. In Round 13, Brisbane defeated second-placed Geelong, coming from 52 points down late in the third quarter to win by 5 points due to an Ash McGrath goal after the siren in his 200th match.\n\nOn 13 August 2013, coach Michael Voss was told that his contract would not be renewed.http://www.heraldsun.com.au/sport/afl/brisbane-lions-coach-michael-voss-will-not-be-given-a-new-contract/story-fni5f4q3-1226696515172http://www.brisbanetimes.com.au/afl/afl-news/lions-sack-coach-michael-voss-20130813-2ru9b.html\n\nPlaying under Justin Leppitsch: 2014–2016 \n\nOn 25 August 2013, former premiership player of the Lions, Justin Leppitsch, was confirmed to be the senior coach of the Lions for the next 3 seasons starting in 2014\n\nOn 18 October 2013, Brisbane Lions legend Simon Black announced his retirement.\n\nDuring round 13, 2014 Lions captain Jonathan Brown was the victim of a facial injury in a clash between the Lions and the Greater Western Sydney Giants. He collided with Tomas Bugg's knee and was taken off the ground. He suffered a concussion, which caused his retirement from football. Along with the retirement of Ashley McGrath in August 2014, no active players remain from any of the club's triple-premiership winning sides.[http://www.triplem.com.au/melbourne/sport/afl/news/2014/8/brisbane-lions-ash-mcgrath-retiring-from-afl/ Brisbane Lions' Ash McGrath Retiring From AFL] , Triple M Melbourne, 21 August 2014\n\nOn 29 August 2016, Leppitsch was sacked as coach of the Lions.\n\nChris Fagan era: 2017–\n\nOn 4 October 2016, Chris Fagan was announced as the Lions' coach from the 2017 season onwards.\n\nCorporate\n\nMembership base and sponsorship\n\nCrowds and memberships for the Brisbane Lions grew dramatically during the four seasons in which they made the AFL Grand Final. Since then, with the team being less successful, attendances have declined, but have remained stable over the past three seasons. In 2009 the Lions found it so difficult to sell corporate boxes that they resorted to doing so on a game-by-game basis.[http://www.heraldsun.com.au/sport/afl/lions-hit-by-fall-in-sales/story-e6frf9jf-1225697726606 Lions hit by fall in corporate box sales] heraldson.com.au. Retrieved 27 September 2009. 2011 saw the Brisbane Lions suffer their worst ever drop in support, as memberships decreased by 28%. 2017 memberships are the lowest the club has had since 2012.\n\nStatistics highlighted in bold denote the known best season for Brisbane in that category\nStatistics highlighted in italic denote the known worst season for Brisbane in that category\n\nNon-playing/coaching staff\n\nClub symbols\n\nEmblem\n\nIn 1997 the club unveiled its new merger emblem it would consist of the iconic golden Fitzroy Lion on a badge (which was the style in the AFL at the time) of Maroon and Blue. The club used this from 1997 to the end of 2001 after their first premiership. In 2002 the club would unveil a new emblem in the shape of a football with the words \"Brisbane Lions\" in the middle with the golden Lion placed inside the O of Lion. The club continued the use of this emblem until the 2010 season when they changed the entire emblem dropping the golden Lion and replaced it with a cartoonish style Lions head. The club also removed the golden Lion from the team guernseys and introduced the new emblem on the body of the original Lion. The change was met with much backlash as many supporters dubbed the new emblem the \"Paddle Pop Lion\" after the popular ice cream of the same name. In 2014 after overwhelming response from the supporters the club dropped the new emblem from their guernseys and reintroduced the classic golden Lion which they wore from 1997 until 2010. Though the club has kept the current emblem for all club related advertising and marketing.\n\nGuernseys\n\nThe three types of guernsey are:\n\n*Home guernsey (worn since 2015): Maroon and blue based guernsey with original Fitzroy lion, coloured gold and maroon. Vero Insurance is the sponsor on the front and Camperdown Dairy International is the sponsor on the back (home shorts worn in home games and away shorts worn in away games not played in Victoria). The Lions also wore this jumper from 1997-2009 before switching to a more 'modern' lion.\n*Away guernsey (Worn since 2015): Red and blue based guernsey with original Fitzroy lion, coloured gold and red. Camperdown Dairy International is the sponsor on the front and Vero Insurance is the sponsor on the back (away shorts worn).  The Lions also wore this jumper from 2008-2009 before switching to a more 'modern' lion.\n*Clash guernsey (Worn since 2017): Reminiscent of the Bears’ final guernsey, this guernsey features maroon, yellow and white with original Fitzroy lion, coloured maroon and gold.  Camperdown Dairy International is the sponsor on the front and Vero Insurance is the sponsor on the back (away shorts worn).\n\nMascot\n\nAs of 2016 the lions new mascot 'Roy' was introduced.\nThe Lion's Mascot Manor representative and club mascot is Bernie \"Gabba\" Vegas, a caricature of a lion dressed in Brisbane Lions jumper, sunglasses, wide lapels, and flares, designed to resemble Elvis Presley.\n\nSong\n\nThe club's team song, \"The Pride of Brisbane Town\", is based on the Fitzroy club song, and is sung to the music of \"La Marseillaise\", the French national anthem:\n\nWe are the pride of Brisbane town,\nwe wear maroon, blue and gold,\nwe will always fight for victory,\nlike Fitzroy and Bears of old,\nall for one, and one for all,\nwe will answer to the call,\ngo Lions, Brisbane Lions,\nwe'll kick the winning score,\nyou'll hear our mighty roar!\n\nRivalries\n\nThe Brisbane Lions have three main rivals, Collingwood, Port Adelaide and Gold Coast.\n\nCollingwood\n\nThe biggest rival for the Lions is Collingwood, having built up plenty of history in the relatively short existence as a merged club. Pre-merger Fitzroy was a neighbouring suburb to Collingwood, with the boundary being based on Smith Street,http://www.yarracity.vic.gov.au/About-Yarra/Maps/ along with the fact that Fitzroy and Collingwood topped the VFL/AFL premiership tally during the early decades of the VFL competition. The Brisbane Bears also had a bit of history with the Magpies as Nathan Buckley famously deflected to Collingwood after one season on the Bears list, citing that he wanted to win premierships, ironically retiring at the end of the 2007 season without a premiership as a player in the AFL.http://www.theage.com.au/afl/afl-news/buckley-still-haunted-by-flag-failures-20120116-1q38x.html The Bears also lost their final regular season match in their final season to the Magpies, costing the Bears the minor premiership that season.https://forever.collingwoodfc.com.au/matches/1996-collingwood-vs-brisbane-round-22/ However the rivalry between the Lions and the Magpies has been properly ignited post-merger, starting in late 1999 when Collingwood played their last ever VFL/AFL game at their spiritual home ground, Victoria Park with the Lions emerging 42 point victors that day and consigning the Magpies to their second wooden spoon, to the dissatisfaction of the Collingwood supporters.http://www.footywire.com/afl/footy/ft_match_statistics?mid\n1086 The rivalry between the two clubs went to the next level as the clubs played off in two consecutive Grand Finals in 2002 and 2003, with the Lions emerging victors on both occasions.http://www.footywire.com/afl/footy/ft_match_statistics?mid1654http://www.footywire.com/afl/footy/ft_match_statistics?mid\n1839 These grand final results further fueled the bitterness that Collingwood supporters and their president Eddie McGuire still have towards the Brisbane Lions to this day, despite the Lions having a poor decade on the field after their golden era. Due to many Collingwood supporters migrating up to Queensland and many Brisbane Lions supporters residing in Victoria (many of which were ex-Fitzroy supporters), along with the on-field history between the two clubs, many Lions supporters consider a Brisbane Lions v Collingwood match-up to be their derby, despite the clubs being over 1700 km apart and the fact that there are many clubs in the competition that are geographically closer to each other.\n\nPort Adelaide\n\nThe second biggest rival of the Lions is Port Adelaide, with the Brisbane Bears and Fitzroy merging to become the Brisbane Lions in order to allow Port Adelaide to enter the AFL competition. This created some dissatisfaction between old Bears and Fitzroy supporters who have felt that they have lost their clubs. In their first season in the AFL, the Lions narrowly made the finals at the expense of Port Adelaide, with the Power narrowly missing out on percentage.http://www.footywire.com/afl/footy/ft_ladder?year1997&pt\nSE&stSE& However the rivalry was properly ignited during the early 2000s, as both clubs fielded strong teams during that period. In 2001 the Lions defeated the Power in the Qualifying final en route to their first of three consecutive premierships,http://finalsiren.com/MatchDetails.asp?GameID\n1761&Coded792a5fb1374aeb888c9354990eda506 with Port bowing out in straight sets that year. In 2002 Port defeated Brisbane by 6 points in the final regular season game to narrowly claim the minor premiership,http://finalsiren.com/MatchDetails.asp?GameID\n171&Codeb211f2aceea18ad41bfb3de17404a733&Sort\nPlayerName%20Asc however Brisbane would eliminate Port in the Preliminary Final that year to claim their second premiership out of their hat-trick of premierships.http://finalsiren.com/MatchDetails.asp?Code95b1fd3a00988baeead214a288e7fd65&GameID\n1757 In 2003 Port would claim their second consecutive minor premiership, however they would go on to lose their qualifying and preliminary finals again, as the Lions would claim their hat-trick of premierships that season. However, in 2004 Port Adelaide would finally break through and win their first AFL premiership, defeating the Brisbane Lions in the Grand Final and preventing them from what would have been a historic four premierships in a row.http://www.footywire.com/afl/footy/ft_match_statistics?mid=2024 In adding further insult to injury for Lions fans, it meant that their biggest rivals, Collingwood, would remain the only team in the VFL/AFL to win four-in-a-row. The rivalry between the two clubs has cooled down since the early 2000s, however, there are a few Lions supporters that still consider Port Adelaide to be a bigger rival than Collingwood.\n\nGold Coast\n\nThe introduction of the Gold Coast Suns into the competition in 2011 saw a rivalry within Queensland Football for the first time ever. The Lions and Suns play each other two times a year. The best player on the ground is awarded the Marcus Ashcroft Medal. Gold Coast won the first QClash by 8 points in Round 7, 2011.\n\nHonours\n\nClub\n\n* Australian Football League\n** Premierships (3): 2001, 2002, 2003\n** Runners-up (1): 2004\n** Wooden Spoons (2): 1998, 2017\n* Pre-Season Grand Final Appearances\n** Premierships (1): 2013\n** Runners-up (2): 2001, 2007\n\nReserves\n\n* North East Australian Football League (4): 2001, 2012, 2013\n2017\n\nIndividual\n\nClub facts\n\nPremierships\n*2001\n*2002\n*2003\n\nRunners Up\n*2004\n\nWooden Spoons\n*1998\n*2017\n\nCoaches\n* John Northey: 1997–1998\n* Roger Merrett: 1998 (caretaker)\n* Leigh Matthews: 1999–2008\n* John Blakey: 2005 (caretaker)\n* Michael Voss: 2009–2013\n* Mark Harvey: 2013 (caretaker)\n* Justin Leppitsch: 2014–2016\n* Chris Fagan: 2017–present\n\nCaptains\n* Michael Voss (co-captain: 1997–2000; captain: 2000–2006)\n* Alastair Lynch (co-captain: 1997–2000)\n* Chris Johnson (co-captain: 2007)\n* Nigel Lappin (co-captain: 2007–2008)\n* Simon Black (co-captain: 2007–2008)\n* Luke Power (co-captain: 2007–2008)\n* Jonathan Brown (co-captain: 2007–2008, 2013; captain: 2009–2012)\n* Jed Adcock (co-captain: 2013; captain: 2014)\n* Tom Rockliff (captain: 2015–2016)\n* Dayne Beams (captain: 2017–present)\n\nBiggest home crowds\n\nPlayers\n\nCurrent squad\n\nReserves team\n\nThe Brisbane Lions have entered a reserves team in the North East Australian Football League (NEAFL) competition since 2011. The club had previously entered a reserves team in the local Queensland Australian Football League in 1998, known as the Lion Cubs but became the Suncoast Lions Football Club in 2004 and were based on the Sunshine Coast. They would win their first premiership in 2001 when they defeated the Southport Sharks in the QAFL Grand Final. A stand-alone Brisbane Lions reserves team was created in 2011 and began playing in the Northern Conference of the North East Australian Football League. In 2012, the Lions won the Northern Conference and overall NEAFL premierships, a feat which was repeated in 2013. The Lions reserves play home games at the South Pine Sports Complex in Brendale, a facility opened in 2016.\n\nPremierships\n\nSeason summaries\n\nCoaches\n\n* 1998: Roger Merrett\n* 1999–2000: Unknown\n* 2001–2005: Craig Brittain\n* 2006: John Blakey/Daryn Cresswell\n* 2007: Craig Brittain\n* 2007: Justin Leppitsch (caretaker)\n* 2008: Paul Hudson\n* 2008: Justin Leppitsch (caretaker)\n* 2009: Craig Brittain\n* 2010: Craig McRae\n* 2011–2012: Nathan Clarke\n* 2013–2014: Leigh Harding\n* 2015–2016: Shane Woewodin\n* 2017–: Mitch Hahn\n\nAFL Women's team\n\nIn May 2016, the club launched a bid to enter a team in the inaugural AFL Women's season in 2017. \nThe Brisbane Lions were granted a license on 15 June 2016, becoming one of eight teams to compete in the league's first season. Former AFL Queensland employee Breeanna Brock was appointed to the position of Women’s CEO the following day.\n\nTayla Harris and Sabrina Frederick-Traub were the club's first signings, unveiled along with the league's other 14 marquee players on 27 July 2016. A further 23 senior players and two rookie players were added to the club's inaugural list in the league's drafting and signing period. Emma Zielke will captain the team for their inaugural season.http://www.lions.com.au/news/2017-01-05/aflw-captain-named\n\nFormer Collingwood and Brisbane Bears player and AFL Queensland coach Craig Starcevich was appointed the team's inaugural head coach in June 2016. The rest of the coaching team was announced on 8 November 2016 as David Lake as the midfield coach, Daniel Merrett as the backline coach and Brent Staker as the forward coach.\n\nExisting club sponsor Hyundai, along with Epic Pharmacy, will sponsor the team in 2017.\n\nThe team plays its home games at the South Pine Sports Complex in Brendale.\n\nCurrent squad\n\nNon-playing/coaching staff\n\nBest and fairest winners\n\nSeason summaries",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Brisbane Lions" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5026" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Brisbane Lions is a professional Australian rules football club which plays in the Australian Football League (AFL). The club is based in Brisbane, Queensland, Australia. The club was formed in 1996 from the merger of the Fitzroy Football Club and the Brisbane Bears. The Lions are one of the most successful AFL clubs of the 21st century, having appeared in four consecutive AFL Grand Finals from 2001 to 2004 and winning three premierships (2001, 2002, 2003).\n\nThe club is based at the Gabba. The team is captained by Dayne Beams and coached by Chris Fagan.\n\nHistory: Start of a new era\n\nThe Brisbane Lions were officially launched on 1 November 1996, joining the national competition in 1997.\n\nBeginnings: 1997–2000\n\nIn their first year as a combined club the Lions made the finals, finishing in eighth position after being defeated by the St Kilda Football Club in a qualifying final. The following year, however, they finished in last position, despite boasting a talented playing list.\n\nTriple premiership success: 2001–2003\n\nAs the Brisbane Lions, the club won its first AFL premiership in the 2001 AFL Grand Final, defeating Essendon 15.18 (108) to 12.10 (82). Lions utility player Shaun Hart won the Norm Smith Medal as best on ground in the Grand Final.\n\nIn 2002, the Lions won back-to-back premierships when they defeated Collingwood 9.12 (66) to 10.15 (75) in the 2002 AFL Grand Final in cold and wet conditions at the Melbourne Cricket Ground. Early in the contest the Lions lost both ruckman Beau McDonald and utility player Martin Pike (who had already had nine possessions in the first quarter) to injury and had to complete the match with a limited bench.\n\nIn 2003, the Lions would win their 3rd premiership in a row, and second in a row against the Collingwood Magpies. With a number of players under an injury cloud – and having lost to Collingwood in a qualifying final at the Melbourne Cricket Ground three weeks previously – the Lions went into the game as underdogs. However, they sealed their place in history as an AFL dynasty by thrashing the Magpies in cool but sunny conditions. At one stage in the final quarter the Lions led by almost 80 points before relaxing when the match was well and truly won, allowing Collingwood to score the last four goals. The final score of 20.14 (134) to 12.12 (84) saw the club become only the fourth in VFL/AFL history to win three consecutive premierships and the first since the creation of the AFL. Simon Black claimed the Norm Smith Medal with a dominant 39 possession match, the most possessions ever gathered by a player in a grand final.\n\nThe 2004 season saw Brisbane remain in the top portion of the ladder for most of the season. Reaching the finals in second position, Brisbane controversially had to travel to Melbourne to play against Geelong in the preliminary final, due to a contract between the Melbourne Cricket Ground (MCG) and the Australian Football League (AFL) that required one preliminary final to be played each year at the MCG. Port Adelaide had finished on top of the ladder and hosted the other preliminary final in Adelaide.  Despite this setback, Brisbane beat Geelong and reached the AFL Grand Final for the fourth consecutive year.  Their opponents, Port Adelaide, playing in their first ever grand final, were too good on the day and recorded a 40-point win.\n\nRebuild of the Lions' second generation: 2005–2008\n\nThe Lions began the 2006 season optimistically, but injuries again plagued the club, whose players recorded an AFL record total of 200 matches lost to injury for the season.\n\nThe Brisbane Lions finished runner up in the 2007 NAB Cup and then went on to create history by being the first team in the history of the AFL to have five co-captains. That year, the Lions failed to make the finals for a third successive year in 2007.\n\nThe Lions began the 2008 NAB Cup shakily, losing to Essendon by 27 points. The team struggled for the season and missed out on the finals with a 10–12 record, losing 3 games despite having at least 5 more scoring shots in each of those games. Coach Leigh Matthews resigned at the end of the season after 10 seasons and 3 premierships with the club.\n\nMichael Voss: 2009–2013\n\nThe Lions made a good start in the 2009 NAB Cup under new senior coach Michael Voss by registering a 9-point win over St Kilda. However this was followed by a series of losses in the pre-season to Essendon, Melbourne and Richmond. Their season ended with a 51-point loss to the Western Bulldogs.\n\nThe 2009/2010 off-season was dominated by the arrival of Brendan Fevola from Carlton, and the hype was focused on Fevola and Jonathan Brown in the sense that the Lions could capitalise on their strong 2009 season. Indeed, the Lions won their first four matches of the 2010 season to be top of the ladder after four rounds, but they would only win three more games after that to crash to a lowly finish by season's end. One of those wins however, was against eventual premiers .\n\nThe Lions' 2010/2011 off-season was disrupted by the sacking of Fevola after just one season at the Lions, following repeated off-field indiscretions which included getting drunk in the Brisbane streets during New Year's Eve celebrations. On the field, the Lions won only four games for the year, but only one against any Victorian team, and that was , in Round 9. Despite their worst season since 1998, coach Michael Voss was granted a contract extension after the board recommended that Voss was the best man to take the club forward into the future. Leading into season 2012, only two players from the triple-premiership winning team of 2001–2003 remained: Simon Black and Jonathan Brown.\n\nThe 2013 season started well for Brisbane, defeating Carlton in the final of the NAB Cup, with Daniel Rich winning the Michael Tuck Medal for best on ground and Aaron Cornelius showing some good form. However, things began to decline from then, with losses to the Western Bulldogs and Adelaide. However, in the 5th QClash match against Gold Coast, the Lions won by two points, with Jonathan Brown winning the Marcus Ashcroft Medal. Injuries were beginning to take a toll, with young players Claye Beams and Jared Polec suffering severe injuries. In Round 13, Brisbane defeated second-placed Geelong, coming from 52 points down late in the third quarter to win by 5 points due to an Ash McGrath goal after the siren in his 200th match.\n\nOn 13 August 2013, coach Michael Voss was told that his contract would not be renewed.http://www.heraldsun.com.au/sport/afl/brisbane-lions-coach-michael-voss-will-not-be-given-a-new-contract/story-fni5f4q3-1226696515172http://www.brisbanetimes.com.au/afl/afl-news/lions-sack-coach-michael-voss-20130813-2ru9b.html\n\nPlaying under Justin Leppitsch: 2014–2016 \n\nOn 25 August 2013, former premiership player of the Lions, Justin Leppitsch, was confirmed to be the senior coach of the Lions for the next 3 seasons starting in 2014\n\nOn 18 October 2013, Brisbane Lions legend Simon Black announced his retirement.\n\nDuring round 13, 2014 Lions captain Jonathan Brown was the victim of a facial injury in a clash between the Lions and the Greater Western Sydney Giants. He collided with Tomas Bugg's knee and was taken off the ground. He suffered a concussion, which caused his retirement from football. Along with the retirement of Ashley McGrath in August 2014, no active players remain from any of the club's triple-premiership winning sides.[http://www.triplem.com.au/melbourne/sport/afl/news/2014/8/brisbane-lions-ash-mcgrath-retiring-from-afl/ Brisbane Lions' Ash McGrath Retiring From AFL] , Triple M Melbourne, 21 August 2014\n\nOn 29 August 2016, Leppitsch was sacked as coach of the Lions.\n\nChris Fagan era: 2017–\n\nOn 4 October 2016, Chris Fagan was announced as the Lions' coach from the 2017 season onwards.\n\nCorporate\n\nMembership base and sponsorship\n\nCrowds and memberships for the Brisbane Lions grew dramatically during the four seasons in which they made the AFL Grand Final. Since then, with the team being less successful, attendances have declined, but have remained stable over the past three seasons. In 2009 the Lions found it so difficult to sell corporate boxes that they resorted to doing so on a game-by-game basis.[http://www.heraldsun.com.au/sport/afl/lions-hit-by-fall-in-sales/story-e6frf9jf-1225697726606 Lions hit by fall in corporate box sales] heraldson.com.au. Retrieved 27 September 2009. 2011 saw the Brisbane Lions suffer their worst ever drop in support, as memberships decreased by 28%. 2017 memberships are the lowest the club has had since 2012.\n\nStatistics highlighted in bold denote the known best season for Brisbane in that category\nStatistics highlighted in italic denote the known worst season for Brisbane in that category\n\nNon-playing/coaching staff\n\nClub symbols\n\nEmblem\n\nIn 1997 the club unveiled its new merger emblem it would consist of the iconic golden Fitzroy Lion on a badge (which was the style in the AFL at the time) of Maroon and Blue. The club used this from 1997 to the end of 2001 after their first premiership. In 2002 the club would unveil a new emblem in the shape of a football with the words \"Brisbane Lions\" in the middle with the golden Lion placed inside the O of Lion. The club continued the use of this emblem until the 2010 season when they changed the entire emblem dropping the golden Lion and replaced it with a cartoonish style Lions head. The club also removed the golden Lion from the team guernseys and introduced the new emblem on the body of the original Lion. The change was met with much backlash as many supporters dubbed the new emblem the \"Paddle Pop Lion\" after the popular ice cream of the same name. In 2014 after overwhelming response from the supporters the club dropped the new emblem from their guernseys and reintroduced the classic golden Lion which they wore from 1997 until 2010. Though the club has kept the current emblem for all club related advertising and marketing.\n\nGuernseys\n\nThe three types of guernsey are:\n\n*Home guernsey (worn since 2015): Maroon and blue based guernsey with original Fitzroy lion, coloured gold and maroon. Vero Insurance is the sponsor on the front and Camperdown Dairy International is the sponsor on the back (home shorts worn in home games and away shorts worn in away games not played in Victoria). The Lions also wore this jumper from 1997-2009 before switching to a more 'modern' lion.\n*Away guernsey (Worn since 2015): Red and blue based guernsey with original Fitzroy lion, coloured gold and red. Camperdown Dairy International is the sponsor on the front and Vero Insurance is the sponsor on the back (away shorts worn).  The Lions also wore this jumper from 2008-2009 before switching to a more 'modern' lion.\n*Clash guernsey (Worn since 2017): Reminiscent of the Bears’ final guernsey, this guernsey features maroon, yellow and white with original Fitzroy lion, coloured maroon and gold.  Camperdown Dairy International is the sponsor on the front and Vero Insurance is the sponsor on the back (away shorts worn).\n\nMascot\n\nAs of 2016 the lions new mascot 'Roy' was introduced.\nThe Lion's Mascot Manor representative and club mascot is Bernie \"Gabba\" Vegas, a caricature of a lion dressed in Brisbane Lions jumper, sunglasses, wide lapels, and flares, designed to resemble Elvis Presley.\n\nSong\n\nThe club's team song, \"The Pride of Brisbane Town\", is based on the Fitzroy club song, and is sung to the music of \"La Marseillaise\", the French national anthem:\n\nWe are the pride of Brisbane town,\nwe wear maroon, blue and gold,\nwe will always fight for victory,\nlike Fitzroy and Bears of old,\nall for one, and one for all,\nwe will answer to the call,\ngo Lions, Brisbane Lions,\nwe'll kick the winning score,\nyou'll hear our mighty roar!\n\nRivalries\n\nThe Brisbane Lions have three main rivals, Collingwood, Port Adelaide and Gold Coast.\n\nCollingwood\n\nThe biggest rival for the Lions is Collingwood, having built up plenty of history in the relatively short existence as a merged club. Pre-merger Fitzroy was a neighbouring suburb to Collingwood, with the boundary being based on Smith Street,http://www.yarracity.vic.gov.au/About-Yarra/Maps/ along with the fact that Fitzroy and Collingwood topped the VFL/AFL premiership tally during the early decades of the VFL competition. The Brisbane Bears also had a bit of history with the Magpies as Nathan Buckley famously deflected to Collingwood after one season on the Bears list, citing that he wanted to win premierships, ironically retiring at the end of the 2007 season without a premiership as a player in the AFL.http://www.theage.com.au/afl/afl-news/buckley-still-haunted-by-flag-failures-20120116-1q38x.html The Bears also lost their final regular season match in their final season to the Magpies, costing the Bears the minor premiership that season.https://forever.collingwoodfc.com.au/matches/1996-collingwood-vs-brisbane-round-22/ However the rivalry between the Lions and the Magpies has been properly ignited post-merger, starting in late 1999 when Collingwood played their last ever VFL/AFL game at their spiritual home ground, Victoria Park with the Lions emerging 42 point victors that day and consigning the Magpies to their second wooden spoon, to the dissatisfaction of the Collingwood supporters.http://www.footywire.com/afl/footy/ft_match_statistics?mid\n1086 The rivalry between the two clubs went to the next level as the clubs played off in two consecutive Grand Finals in 2002 and 2003, with the Lions emerging victors on both occasions.http://www.footywire.com/afl/footy/ft_match_statistics?mid1654http://www.footywire.com/afl/footy/ft_match_statistics?mid\n1839 These grand final results further fueled the bitterness that Collingwood supporters and their president Eddie McGuire still have towards the Brisbane Lions to this day, despite the Lions having a poor decade on the field after their golden era. Due to many Collingwood supporters migrating up to Queensland and many Brisbane Lions supporters residing in Victoria (many of which were ex-Fitzroy supporters), along with the on-field history between the two clubs, many Lions supporters consider a Brisbane Lions v Collingwood match-up to be their derby, despite the clubs being over 1700 km apart and the fact that there are many clubs in the competition that are geographically closer to each other.\n\nPort Adelaide\n\nThe second biggest rival of the Lions is Port Adelaide, with the Brisbane Bears and Fitzroy merging to become the Brisbane Lions in order to allow Port Adelaide to enter the AFL competition. This created some dissatisfaction between old Bears and Fitzroy supporters who have felt that they have lost their clubs. In their first season in the AFL, the Lions narrowly made the finals at the expense of Port Adelaide, with the Power narrowly missing out on percentage.http://www.footywire.com/afl/footy/ft_ladder?year1997&pt\nSE&stSE& However the rivalry was properly ignited during the early 2000s, as both clubs fielded strong teams during that period. In 2001 the Lions defeated the Power in the Qualifying final en route to their first of three consecutive premierships,http://finalsiren.com/MatchDetails.asp?GameID\n1761&Coded792a5fb1374aeb888c9354990eda506 with Port bowing out in straight sets that year. In 2002 Port defeated Brisbane by 6 points in the final regular season game to narrowly claim the minor premiership,http://finalsiren.com/MatchDetails.asp?GameID\n171&Codeb211f2aceea18ad41bfb3de17404a733&Sort\nPlayerName%20Asc however Brisbane would eliminate Port in the Preliminary Final that year to claim their second premiership out of their hat-trick of premierships.http://finalsiren.com/MatchDetails.asp?Code95b1fd3a00988baeead214a288e7fd65&GameID\n1757 In 2003 Port would claim their second consecutive minor premiership, however they would go on to lose their qualifying and preliminary finals again, as the Lions would claim their hat-trick of premierships that season. However, in 2004 Port Adelaide would finally break through and win their first AFL premiership, defeating the Brisbane Lions in the Grand Final and preventing them from what would have been a historic four premierships in a row.http://www.footywire.com/afl/footy/ft_match_statistics?mid=2024 In adding further insult to injury for Lions fans, it meant that their biggest rivals, Collingwood, would remain the only team in the VFL/AFL to win four-in-a-row. The rivalry between the two clubs has cooled down since the early 2000s, however, there are a few Lions supporters that still consider Port Adelaide to be a bigger rival than Collingwood.\n\nGold Coast\n\nThe introduction of the Gold Coast Suns into the competition in 2011 saw a rivalry within Queensland Football for the first time ever. The Lions and Suns play each other two times a year. The best player on the ground is awarded the Marcus Ashcroft Medal. Gold Coast won the first QClash by 8 points in Round 7, 2011.\n\nHonours\n\nClub\n\n* Australian Football League\n** Premierships (3): 2001, 2002, 2003\n** Runners-up (1): 2004\n** Wooden Spoons (2): 1998, 2017\n* Pre-Season Grand Final Appearances\n** Premierships (1): 2013\n** Runners-up (2): 2001, 2007\n\nReserves\n\n* North East Australian Football League (4): 2001, 2012, 2013\n2017\n\nIndividual\n\nClub facts\n\nPremierships\n*2001\n*2002\n*2003\n\nRunners Up\n*2004\n\nWooden Spoons\n*1998\n*2017\n\nCoaches\n* John Northey: 1997–1998\n* Roger Merrett: 1998 (caretaker)\n* Leigh Matthews: 1999–2008\n* John Blakey: 2005 (caretaker)\n* Michael Voss: 2009–2013\n* Mark Harvey: 2013 (caretaker)\n* Justin Leppitsch: 2014–2016\n* Chris Fagan: 2017–present\n\nCaptains\n* Michael Voss (co-captain: 1997–2000; captain: 2000–2006)\n* Alastair Lynch (co-captain: 1997–2000)\n* Chris Johnson (co-captain: 2007)\n* Nigel Lappin (co-captain: 2007–2008)\n* Simon Black (co-captain: 2007–2008)\n* Luke Power (co-captain: 2007–2008)\n* Jonathan Brown (co-captain: 2007–2008, 2013; captain: 2009–2012)\n* Jed Adcock (co-captain: 2013; captain: 2014)\n* Tom Rockliff (captain: 2015–2016)\n* Dayne Beams (captain: 2017–present)\n\nBiggest home crowds\n\nPlayers\n\nCurrent squad\n\nReserves team\n\nThe Brisbane Lions have entered a reserves team in the North East Australian Football League (NEAFL) competition since 2011. The club had previously entered a reserves team in the local Queensland Australian Football League in 1998, known as the Lion Cubs but became the Suncoast Lions Football Club in 2004 and were based on the Sunshine Coast. They would win their first premiership in 2001 when they defeated the Southport Sharks in the QAFL Grand Final. A stand-alone Brisbane Lions reserves team was created in 2011 and began playing in the Northern Conference of the North East Australian Football League. In 2012, the Lions won the Northern Conference and overall NEAFL premierships, a feat which was repeated in 2013. The Lions reserves play home games at the South Pine Sports Complex in Brendale, a facility opened in 2016.\n\nPremierships\n\nSeason summaries\n\nCoaches\n\n* 1998: Roger Merrett\n* 1999–2000: Unknown\n* 2001–2005: Craig Brittain\n* 2006: John Blakey/Daryn Cresswell\n* 2007: Craig Brittain\n* 2007: Justin Leppitsch (caretaker)\n* 2008: Paul Hudson\n* 2008: Justin Leppitsch (caretaker)\n* 2009: Craig Brittain\n* 2010: Craig McRae\n* 2011–2012: Nathan Clarke\n* 2013–2014: Leigh Harding\n* 2015–2016: Shane Woewodin\n* 2017–: Mitch Hahn\n\nAFL Women's team\n\nIn May 2016, the club launched a bid to enter a team in the inaugural AFL Women's season in 2017. \nThe Brisbane Lions were granted a license on 15 June 2016, becoming one of eight teams to compete in the league's first season. Former AFL Queensland employee Breeanna Brock was appointed to the position of Women’s CEO the following day.\n\nTayla Harris and Sabrina Frederick-Traub were the club's first signings, unveiled along with the league's other 14 marquee players on 27 July 2016. A further 23 senior players and two rookie players were added to the club's inaugural list in the league's drafting and signing period. Emma Zielke will captain the team for their inaugural season.http://www.lions.com.au/news/2017-01-05/aflw-captain-named\n\nFormer Collingwood and Brisbane Bears player and AFL Queensland coach Craig Starcevich was appointed the team's inaugural head coach in June 2016. The rest of the coaching team was announced on 8 November 2016 as David Lake as the midfield coach, Daniel Merrett as the backline coach and Brent Staker as the forward coach.\n\nExisting club sponsor Hyundai, along with Epic Pharmacy, will sponsor the team in 2017.\n\nThe team plays its home games at the South Pine Sports Complex in Brendale.\n\nCurrent squad\n\nNon-playing/coaching staff\n\nBest and fairest winners\n\nSeason summaries. Brisbane Lions. http://en.wikipedia.org/?curid=5026."
  }
}
