{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20018",
  "eid" : "3f60e090-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778615577,
  "textBody" : "In mathematics, a metric space is a set for which distances  between all members of the set are defined. Those distances, taken together, are  called a metric on the set. A metric on a space induces topological properties like open and closed sets, which lead to the study of more abstract topological spaces.\n\nThe most familiar metric space is 3-dimensional Euclidean space. In fact, a \"metric\" is the generalization of the Euclidean metric arising from the four long-known properties of the Euclidean distance. The Euclidean metric  defines the distance between two points as the length of the straight line segment connecting them. Other metric spaces occur for example in elliptic geometry and hyperbolic geometry, where distance on a sphere measured by angle is a metric, and the hyperboloid model of hyperbolic geometry is used by special relativity as a metric space of velocities.\n\nHistory \n\nIn 1906 Maurice Fréchet introduced metric spaces in his work Sur quelques points du calcul fonctionnel.Rendic. Circ. Mat. Palermo 22 (1906) 1–74 However the name is due to Felix Hausdorff.\n\nDefinition \n\nA metric space is an ordered pair (M,d) where M is a set and d is a metric on M, i.e., a function\n\nd \\colon M \\times M \\to \\mathbb{R}\n\nsuch that for any x, y, z \\in M, the following holds:\n\nThe first condition follows from the other three. Since for any x, y \\in M:\n\nThe function d is also called distance function or simply distance. Often, d is omitted and one just writes M for a metric space if it is clear from the context what metric is used.\n\nIgnoring mathematical details, for any system of roads and terrains the distance between two locations can be defined as the length of the shortest route connecting those locations. To be a metric there shouldn't be any one-way roads. The triangle inequality expresses the fact that detours aren't shortcuts. If the distance between two points is zero, the two points are indistinguishable from one-another. Many of the examples below can be seen as concrete versions of this general idea.\n\nExamples of metric spaces \n \n* The real numbers with the distance function d(x,y) = \\vert y - x \\vert given by the absolute difference, and, more generally, Euclidean -space with the Euclidean distance, are complete metric spaces. The rational numbers with the same distance function also form a metric space, but not a complete one.\n* The positive real numbers with distance function d(x,y) =\\vert \\log(y/x) \\vert is a complete metric space.\n* Any normed vector space is a metric space by defining d(x,y) = \\lVert y - x \\rVert, see also metrics on vector spaces. (If such a space is complete, we call it a Banach space.) Examples:\n** The Manhattan norm gives rise to the Manhattan distance, where the distance between any two points, or vectors, is the sum of the differences between corresponding coordinates.\n** The maximum norm gives rise to the Chebyshev distance or chessboard distance, the minimal number of moves a chess king would take to travel from x to y.\n* The British Rail metric (also called the Post Office metric or the SNCF metric) on a normed vector space is given by d(x,y) \\lVert x \\rVert + \\lVert y \\rVert for distinct points x and y, and d(x,x) \n 0. More generally \\lVert . \\rVert can be replaced with a function f taking an arbitrary set S to non-negative reals and taking the value 0 at most once:  then the metric is defined on S by d(x,y) f(x) + f(y) for distinct points x and y, and d(x,x) \n 0.  The name alludes to the tendency of railway journeys (or letters) to proceed via London (or Paris) irrespective of their final destination.\n* If (M,d) is a metric space and X is a subset of M, then (X,d) becomes a metric space by restricting the domain of d to X \\times X.\n* The discrete metric, where d(x,y) 0 if x\ny and d(x,y) = 1 otherwise, is a simple but important example, and can be applied to all sets. This, in particular, shows that for any set, there is always a metric space associated to it. Using this metric, any point is an open ball, and therefore every subset is open and the space has the discrete topology.\n* A finite metric space is a metric space having a finite number of points.  Not every finite metric space can be isometrically embedded in a Euclidean space.Nathan Linial. [https://arxiv.org/abs/math/0304466 Finite Metric Spaces—Combinatorics, Geometry and Algorithms, Proceedings of the ICM, Beijing 2002, vol. 3, pp573–586][http://kam.mff.cuni.cz/~matousek/metrop.psOpen problems  on embeddings  of finite  metric  spaces, edited by Jirīı Matoušek, 2007]\n* The hyperbolic plane is a metric space. More generally:\n* If M is any connected Riemannian manifold, then we can turn M into a metric space by defining the distance of two points as the infimum of the lengths of the paths (continuously differentiable curves) connecting them.\n* If X is some set and M is a metric space, then, the set of all bounded functions f \\colon X \\rightarrow M (i.e. those functions whose image is a bounded subset of M) can be turned into a metric space by defining d(f,g) \\sup_{x \\in X} d(f(x),g(x)) for any two bounded functions f and g (where \\sup is supremum).Searcóid, [https://books.google.com/books?id\naP37I4QWFRcC&pg=PA107 p. 107]. This metric is called the uniform metric or supremum metric, and If M is complete, then this function space is complete as well. If X is also a topological space, then the set of all bounded continuous functions from X to M (endowed with the uniform metric), will also be a complete metric if M is.\n* If G is an undirected connected graph, then the set V of vertices of G can be turned into a metric space by defining d(x,y) to be the length of the shortest path connecting the vertices x and y. In geometric group theory this is applied to the Cayley graph of a group, yielding the word metric.\n* Graph edit distance is a measure of dissimilarity between two graphs, defined as the minimal number of graph edit operations required to transform one graph into another.\n* The Levenshtein distance is a measure of the dissimilarity between two strings u and v, defined as the minimal number of character deletions, insertions, or substitutions required to transform u into v. This can be thought of as a special case of the shortest path metric in a graph and is one example of an edit distance.\n* Given a metric space (X,d) and an increasing concave function f \\colon [0,\\infty) \\rightarrow [0,\\infty) such that f(x) 0 if and only if x\n0, then f \\circ d is also a metric on X.\n* Given an injective function f from any set A to a metric space (X,d), d(f(x), f(y)) defines a metric on A.\n* Using T-theory, the tight span of a metric space is also a metric space. The tight span is useful in several types of analysis.\n* The set of all m by n matrices over some field is a metric space with respect to the rank distance d(X,Y) = \\mathrm{rank}(Y - X).\n* The Helly metric  is used in game theory.\n\nOpen and closed sets, topology and convergence \n\nEvery metric space is a topological space in a natural manner, and therefore all definitions and theorems about general topological spaces also apply to all metric spaces.\n\nAbout any point x in a metric space M we define the open ball of radius r > 0 (where r is a real number) about x  as the set\nB(x;r) = \\{y \\in M : d(x,y) \nThese open balls form the base for a topology on M, making it a topological space.\n\nExplicitly, a subset U of M is called open if for every x in U there exists an r > 0 such that B(x;r) is contained in U. The complement of an open set is called closed. A neighborhood of the point x is any subset of M that contains an open ball about x as a subset.\n\nA topological space which can arise in this way from a metric space is called a metrizable space; see the article on metrization theorems for further details.\n\nA sequence (x_n) in a metric space M is said to converge to the limit x \\in M iff for every \\epsilon>0, there exists a natural number N such that d(x_n,x)  for all n > N. Equivalently, one can use the general definition of convergence available in all topological spaces.\n\nA subset A of the metric space M is closed iff every sequence in A that converges to a limit in M has its limit in A.\n\nTypes of metric spaces \n\nComplete spaces\n\nA metric space M is said to be complete if every Cauchy sequence converges in M. That is to say: if d(x_n, x_m) \\to 0 as both n and m independently go to infinity, then there is some y\\in M with d(x_n, y) \\to 0.\n\nEvery Euclidean space is complete, as is every closed subset of a complete space. The rational numbers, using the absolute value metric d(x,y) = \\vert x - y \\vert, are not complete.\n\nEvery metric space has a unique (up to isometry) completion, which is a complete space that contains the given space as a dense subset. For example, the real numbers are the completion of the rationals.\n\nIf X is a complete subset of the metric space M, then X is closed in M. Indeed, a space is complete iff it is closed in any containing metric space.\n\nEvery complete metric space is a Baire space.\n\nBounded and totally bounded spaces\n\nA metric space M is called bounded if there exists some number r, such that d(x,y) ≤ r for all x and y in M.  The smallest possible such r is called the diameter of M. The space M is called precompact or totally bounded if for every r > 0 there exist finitely many open balls of radius r whose union covers M. Since the set of the centres of these balls is finite, it has finite diameter, from which it follows (using the triangle inequality) that every totally bounded space is bounded.  The converse does not hold, since any infinite set can be given the discrete metric (one of the examples above) under which it is bounded and yet not totally bounded.\n\nNote that in the context of intervals in the space of real numbers and occasionally regions in a Euclidean space Rn a bounded set is referred to as \"a finite interval\" or \"finite region\". However boundedness should not in general be confused with \"finite\", which refers to the number of elements, not to how far the set extends; finiteness implies boundedness, but not conversely. Also note that an unbounded subset of Rn may have a finite volume.\n\nCompact spaces\n\nA metric space M is compact if every sequence in M has a subsequence that converges to a point in M. This is known as sequential compactness and, in metric spaces (but not in general topological spaces), is equivalent to the topological notions of countable compactness and compactness defined via open covers.\n\nExamples of compact metric spaces include the closed interval [0,1] with the absolute value metric, all metric spaces with finitely many points, and the Cantor set. Every closed subset of a compact space is itself compact.\n\nA metric space is compact iff it is complete and totally bounded.  This is known as the Heine–Borel theorem. Note that compactness depends only on the topology, while boundedness depends on the metric.\n\nLebesgue's number lemma states that for every open cover of a compact metric space M, there exists a \"Lebesgue number\" δ such that every subset of M of diameter [http://planetmath.org/encyclopedia/CompactMetricSpacesAreSecondCountable.html PlanetMath: a compact metric space is second countable] and is a continuous image of the Cantor set. (The latter result is due to Pavel Alexandrov and Urysohn.)\n\nLocally compact and proper spaces\n\nA metric space is said to be locally compact if every point has a compact neighborhood. Euclidean spaces are locally compact, but infinite-dimensional Banach spaces are not.\n\nA space is proper if every closed ball {y : d(x,y) ≤ r} is compact. Proper spaces are locally compact, but the converse is not true in general.\n\nConnectedness\n\nA metric space M is connected if the only subsets that are both open and closed are the empty set and M itself.\n\nA metric space M is path connected if for any two points x, y \\in M there exists a continuous map f\\colon [0,1] \\to M with f(0)x and f(1)\ny.\nEvery path connected space is connected, but the converse is not true in general.\n\nThere are also local versions of these definitions: locally connected spaces and locally path connected spaces.\n\nSimply connected spaces are those that, in a certain sense, do not have \"holes\".\n\nSeparable spaces\n\nA metric space is separable space if it has a countable dense subset. Typical examples are the real numbers or any Euclidean space. For metric spaces (but not for general topological spaces) separability is equivalent to second-countability and also to the Lindelöf property.\n\nPointed metric spaces\n\nIf X is a nonempty metric space and x_0\\in X then (X,x_0) is called a pointed metric space, and x_0 is called a distinguished point.  Note that a pointed metric space is just a nonempty metric space with attention drawn to its distinguished point, and that any nonempty metric space can be viewed as a pointed metric space. The distinguished point is sometimes denoted 0 due to its similar behavior to zero in certain contexts.\n\nTypes of maps between metric spaces\n\nSuppose (M1,d1) and (M2,d2) are two metric spaces.\n\nContinuous maps\n\nThe map f:M1→M2 is continuous\nif it has one (and therefore all) of the following equivalent properties:\n;General topological continuity: for every open set U in M2, the preimage f -1(U) is open in M1\nThis is the general definition of continuity in topology.\n;Sequential continuity: if (xn) is a sequence in M1 that converges to x in M1, then the sequence (f(xn)) converges to f(x) in M2.\nThis is sequential continuity, due to Eduard Heine.\n;ε-δ definition: for every x in M1 and every ε>0 there exists δ>0 such that for all y in M1 we have\n:d_1(x,y)\nThis uses the (ε, δ)-definition of limit, and is due to Augustin Louis Cauchy.\n\nMoreover, f is continuous if and only if it is continuous on every compact subset of M1.\n\nThe image of every compact set under a continuous function is compact, and the image of every connected set under a continuous function is connected.\n\nUniformly continuous maps\n\nThe map ƒ : M1 → M2 is uniformly continuous if for every ε > 0 there exists δ > 0 such that\n\nd_1(x,y)\n\nEvery uniformly continuous map ƒ : M1 → M2 is continuous.  The converse is true if M1 is compact (Heine–Cantor theorem).\n\nUniformly continuous maps turn Cauchy sequences in M1 into Cauchy sequences in M2. For continuous maps this is generally wrong; for example, a continuous map\nfrom the open interval (0,1) onto the real line turns some Cauchy sequences into unbounded sequences.\n\nLipschitz-continuous maps and contractions\n\nGiven a real number K > 0, the map ƒ : M1 → M2 is K-Lipschitz continuous if\n\nd_2(f(x),f(y))\\leq K d_1(x,y)\\quad\\mbox{for all}\\quad x,y\\in M_1.\n\nEvery Lipschitz-continuous map is uniformly continuous, but the converse is not true in general.\n\nIf K 2 = M1 and M1 is complete. If ƒ is a contraction, then ƒ admits a unique fixed point (Banach fixed point theorem). If M1 is compact, the condition can be weakened a bit: ƒ admits a unique fixed point if\n\n d(f(x), f(y)) .\n\nIsometries\n\nThe map f:M1→M2 is an isometry if\nd_2(f(x),f(y))=d_1(x,y)\\quad\\mbox{for all}\\quad x,y\\in M_1\nIsometries are always injective; the image of a compact or complete set under an isometry is compact or complete, respectively. However, if the isometry is not surjective, then the image of a closed (or open) set need not be closed (or open).\n\nQuasi-isometries\n\nThe map f : M1 → M2 is a quasi-isometry if there exist constants A ≥ 1 and B ≥ 0 such that\n\n\\frac{1}{A} d_2(f(x),f(y))-B\\leq d_1(x,y)\\leq A d_2(f(x),f(y))+B \\text{ for all } x,y\\in M_1\n\nand a constant C ≥ 0 such that every point in M2 has a distance at most C from some point in the image f(M1).\n\nNote that a quasi-isometry is not required to be continuous. Quasi-isometries compare the \"large-scale structure\" of metric spaces; they find use in geometric group theory in relation to the word metric.\n\nNotions of metric space equivalence\n\nGiven two metric spaces (M1, d1) and (M2, d2):\n\n*They are called homeomorphic (topologically isomorphic) if there exists a homeomorphism between them (i.e., a bijection continuous in both directions).\n*They are called uniformic (uniformly isomorphic) if there exists a uniform isomorphism between them (i.e., a bijection uniformly continuous in both directions).\n*They are called isometric if there exists a bijective isometry between them. In this case, the two metric spaces are essentially identical.\n*They are called quasi-isometric if there exists a quasi-isometry between them.\n\nTopological properties\n\nMetric spaces are paracompactRudin, Mary Ellen.  [https://www.jstor.org/stable/2035708 A new proof that metric spaces are paracompact].  Proceedings of the American Mathematical Society, Vol. 20, No. 2. (Feb., 1969), p. 603. Hausdorff spaces and hence normal (indeed they are perfectly normal). An important consequence is that every metric space admits partitions of unity and that every continuous real-valued function defined on a closed subset of a metric space can be extended to a continuous map on the whole space (Tietze extension theorem). It is also true that every real-valued Lipschitz-continuous map defined on a subset of a metric space can be extended to a Lipschitz-continuous map on the whole space.\n\nMetric spaces are first countable since one can use balls with rational radius as a neighborhood base.\n\nThe metric topology on a metric space M is the coarsest topology on M relative to which the metric d is a continuous map from the product of M with itself to the non-negative real numbers.\n\nDistance between points and sets; Hausdorff distance and Gromov metric\n\nA simple way to construct a function separating a point from a closed set (as required for a completely regular space) is to consider the distance between the point and the set. If (M,d) is a metric space, S is a subset of M and x is a point of M, we define the distance from x to S as\nd(x,S) = \\inf\\{d(x,s) : s \\in S \\}  where \\inf represents the infimum.\n\nThen d(x, S) = 0 if and only if x belongs to the closure of S. Furthermore, we have the following generalization of the triangle inequality:\nd(x,S) \\leq d(x,y) + d(y,S),\nwhich in particular shows that the map x\\mapsto d(x,S) is continuous.\n\nGiven two subsets S and T of M, we define their Hausdorff distance to be\nd_H(S,T) = \\max \\{ \\sup\\{d(s,T) : s \\in S \\} , \\sup\\{ d(t,S) : t \\in T \\} \\}  where \\sup represents the supremum.\n\nIn general, the Hausdorff distance dH(S,T) can be infinite. Two sets are close to each other in the Hausdorff distance if every element of either set is close to some element of the other set.\n\nThe Hausdorff distance dH turns the set K(M) of all non-empty compact subsets of M into a metric space. One can show that K(M) is complete if M is complete.\n(A different notion of convergence of compact subsets is given by the Kuratowski convergence.)\n\nOne can then define the Gromov–Hausdorff distance between any two metric spaces by considering the minimal Hausdorff distance of isometrically embedded versions of the two spaces. Using this distance, the class of all (isometry classes of) compact metric spaces becomes a metric space in its own right.\n\nProduct metric spaces\n\nIf (M_1,d_1),\\ldots,(M_n,d_n) are metric spaces, and N is the Euclidean norm on Rn, then \\Big(M_1\\times \\ldots \\times M_n, N(d_1,\\ldots,d_n)\\Big) is a metric space, where the product metric is defined by\n\nN(d_1,...,d_n)\\Big((x_1,\\ldots,x_n),(y_1,\\ldots,y_n)\\Big) = N\\Big(d_1(x_1,y_1),\\ldots,d_n(x_n,y_n)\\Big),\n\nand the induced topology agrees with the product topology.  By the equivalence of norms in finite dimensions, an equivalent metric is obtained if N is the taxicab norm, a p-norm, the max norm, or any other norm which is non-decreasing as the coordinates of a positive n-tuple increase (yielding the triangle inequality).\n\nSimilarly, a countable product of metric spaces can be obtained using the following metric\n\nd(x,y)\\sum_{i\n1}^\\infty \\frac1{2^i}\\frac{d_i(x_i,y_i)}{1+d_i(x_i,y_i)}.\n\nAn uncountable product of metric spaces need not be metrizable. For example, \\mathbf{R}^\\mathbf{R} is not first-countable and thus isn't metrizable.\n\nContinuity of distance\n\nIn the case of a single space (M,d), the distance map d\\colon M\\times M \\rightarrow R^+ (from the definition) is uniformly continuous with respect to any of the above product metrics N(d,d), and in particular is continuous with respect to the product topology of M\\times M.\n\nQuotient metric spaces\n\nIf M is a metric space with metric d, and ~ is an equivalence relation on M, then we can endow the quotient set M/~ with the following (pseudo)metric. Given two equivalence classes [x] and [y], we define\nd'([x],[y]) = \\inf\\{d(p_1,q_1)+d(p_2,q_2)+\\dotsb+d(p_{n},q_{n})\\}\n\nwhere the infimum is taken over all finite sequences (p_1, p_2, \\dots, p_n) and (q_1, q_2, \\dots, q_n) with [p_1][x], [q_n]\n[y], [q_i][p_{i+1}], i\n1,2,\\dots, n-1. In general this will only define a pseudometric, i.e. d'([x],[y])0 does not necessarily imply that [x]\n[y]. However, for nice equivalence relations (e.g., those given by gluing together polyhedra along faces), it is a metric.\n\nThe quotient metric d is characterized by the following universal property. If f:(M,d)\\longrightarrow(X,\\delta) is a metric map between metric spaces (that is, \\delta(f(x),f(y))\\le d(x,y) for all x, y) satisfying f(x)f(y) whenever x\\sim y, then the induced function \\overline{f}\\colon M/\\sim\\longrightarrow X, given by \\overline{f}([x])\nf(x), is a metric map \\overline{f}\\colon (M/\\sim,d')\\longrightarrow (X,\\delta).\n\nA topological space is sequential if and only if it is a quotient of a metric space.Goreham, Anthony. [http://at.yorku.ca/p/a/a/o/51.pdf Sequential convergence in Topological Spaces]. Honours' Dissertation, Queen's College, Oxford (April, 2001), p. 14\n\nGeneralizations of metric spaces\n\n*Every metric space is a uniform space in a natural manner, and every uniform space is naturally a topological space. Uniform and topological spaces can therefore be regarded as generalizations of metric spaces.\n*If we consider the first definition of a metric space given above and relax the second requirement, we arrive at the concepts of a pseudometric space or a dislocated metric space.Pascal Hitzler and Anthony Seda, Mathematical Aspects of Logic Programming Semantics. Chapman and Hall/CRC, 2010. If we remove the third or fourth, we arrive at a quasimetric space, or a semimetric space.\n*If the distance function takes values in the extended real number line R∪{+∞}, but otherwise satisfies all four conditions, then it is called an extended metric and the corresponding space is called an \\infty-metric space. If the distance function takes values in some (suitable) ordered set (and the triangle inequality is adjusted accordingly), then we arrive at the notion of generalized ultrametric.Pascal Hitzler and Anthony Seda, Mathematical Aspects of Logic Programming Semantics. Chapman and Hall/CRC, 2010.\n*Approach spaces are a generalization of metric spaces, based on point-to-set distances, instead of point-to-point distances.\n*A continuity space is a generalization of metric spaces and posets, that can be used to unify the notions of metric spaces and domains.\n* A partial metric space is intended to be the least generalisation of the notion of a metric space, such that the distance of each point from itself is no longer necessarily zero.http://www.dcs.warwick.ac.uk/pmetric/\n\nMetric spaces as enriched categories \n\nThe ordered set (\\mathbb{R},\\geq) can be seen as a category by requesting exactly one morphism a\\to b if a\\geq b and none otherwise. By using + as the tensor product and 0 as the identity, it becomes a monoidal category R^*.\nEvery metric space (M,d) can now be viewed as a category M^* enriched over R^*:\n* Set \\operatorname{Ob}(M^*):=M\n* For each X,Y\\in M set \\operatorname{Hom}(X,Y):=d(X,Y)\\in \\operatorname{Ob}(R^*)\n* The composition morphism \\operatorname{Hom}(Y,Z)\\otimes \\operatorname{Hom}(X,Y)\\to \\operatorname{Hom}(X,Z) will be the unique morphism in R^* given from the triangle inequality d(y,z)+d(x,y)\\geq d(x,z)\n* The identity morphism 0\\to \\operatorname{Hom}(X,X) will be the unique morphism given from the fact that 0\\geq d(X,X).\n* Since R^* is a poset, all diagrams that are required for an enriched category commute automatically.\n\nSee the paper by F.W. Lawvere listed below.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Metric space" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20018" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In mathematics, a metric space is a set for which distances  between all members of the set are defined. Those distances, taken together, are  called a metric on the set. A metric on a space induces topological properties like open and closed sets, which lead to the study of more abstract topological spaces.\n\nThe most familiar metric space is 3-dimensional Euclidean space. In fact, a \"metric\" is the generalization of the Euclidean metric arising from the four long-known properties of the Euclidean distance. The Euclidean metric  defines the distance between two points as the length of the straight line segment connecting them. Other metric spaces occur for example in elliptic geometry and hyperbolic geometry, where distance on a sphere measured by angle is a metric, and the hyperboloid model of hyperbolic geometry is used by special relativity as a metric space of velocities.\n\nHistory \n\nIn 1906 Maurice Fréchet introduced metric spaces in his work Sur quelques points du calcul fonctionnel.Rendic. Circ. Mat. Palermo 22 (1906) 1–74 However the name is due to Felix Hausdorff.\n\nDefinition \n\nA metric space is an ordered pair (M,d) where M is a set and d is a metric on M, i.e., a function\n\nd \\colon M \\times M \\to \\mathbb{R}\n\nsuch that for any x, y, z \\in M, the following holds:\n\nThe first condition follows from the other three. Since for any x, y \\in M:\n\nThe function d is also called distance function or simply distance. Often, d is omitted and one just writes M for a metric space if it is clear from the context what metric is used.\n\nIgnoring mathematical details, for any system of roads and terrains the distance between two locations can be defined as the length of the shortest route connecting those locations. To be a metric there shouldn't be any one-way roads. The triangle inequality expresses the fact that detours aren't shortcuts. If the distance between two points is zero, the two points are indistinguishable from one-another. Many of the examples below can be seen as concrete versions of this general idea.\n\nExamples of metric spaces \n \n* The real numbers with the distance function d(x,y) = \\vert y - x \\vert given by the absolute difference, and, more generally, Euclidean -space with the Euclidean distance, are complete metric spaces. The rational numbers with the same distance function also form a metric space, but not a complete one.\n* The positive real numbers with distance function d(x,y) =\\vert \\log(y/x) \\vert is a complete metric space.\n* Any normed vector space is a metric space by defining d(x,y) = \\lVert y - x \\rVert, see also metrics on vector spaces. (If such a space is complete, we call it a Banach space.) Examples:\n** The Manhattan norm gives rise to the Manhattan distance, where the distance between any two points, or vectors, is the sum of the differences between corresponding coordinates.\n** The maximum norm gives rise to the Chebyshev distance or chessboard distance, the minimal number of moves a chess king would take to travel from x to y.\n* The British Rail metric (also called the Post Office metric or the SNCF metric) on a normed vector space is given by d(x,y) \\lVert x \\rVert + \\lVert y \\rVert for distinct points x and y, and d(x,x) \n 0. More generally \\lVert . \\rVert can be replaced with a function f taking an arbitrary set S to non-negative reals and taking the value 0 at most once:  then the metric is defined on S by d(x,y) f(x) + f(y) for distinct points x and y, and d(x,x) \n 0.  The name alludes to the tendency of railway journeys (or letters) to proceed via London (or Paris) irrespective of their final destination.\n* If (M,d) is a metric space and X is a subset of M, then (X,d) becomes a metric space by restricting the domain of d to X \\times X.\n* The discrete metric, where d(x,y) 0 if x\ny and d(x,y) = 1 otherwise, is a simple but important example, and can be applied to all sets. This, in particular, shows that for any set, there is always a metric space associated to it. Using this metric, any point is an open ball, and therefore every subset is open and the space has the discrete topology.\n* A finite metric space is a metric space having a finite number of points.  Not every finite metric space can be isometrically embedded in a Euclidean space.Nathan Linial. [https://arxiv.org/abs/math/0304466 Finite Metric Spaces—Combinatorics, Geometry and Algorithms, Proceedings of the ICM, Beijing 2002, vol. 3, pp573–586][http://kam.mff.cuni.cz/~matousek/metrop.psOpen problems  on embeddings  of finite  metric  spaces, edited by Jirīı Matoušek, 2007]\n* The hyperbolic plane is a metric space. More generally:\n* If M is any connected Riemannian manifold, then we can turn M into a metric space by defining the distance of two points as the infimum of the lengths of the paths (continuously differentiable curves) connecting them.\n* If X is some set and M is a metric space, then, the set of all bounded functions f \\colon X \\rightarrow M (i.e. those functions whose image is a bounded subset of M) can be turned into a metric space by defining d(f,g) \\sup_{x \\in X} d(f(x),g(x)) for any two bounded functions f and g (where \\sup is supremum).Searcóid, [https://books.google.com/books?id\naP37I4QWFRcC&pg=PA107 p. 107]. This metric is called the uniform metric or supremum metric, and If M is complete, then this function space is complete as well. If X is also a topological space, then the set of all bounded continuous functions from X to M (endowed with the uniform metric), will also be a complete metric if M is.\n* If G is an undirected connected graph, then the set V of vertices of G can be turned into a metric space by defining d(x,y) to be the length of the shortest path connecting the vertices x and y. In geometric group theory this is applied to the Cayley graph of a group, yielding the word metric.\n* Graph edit distance is a measure of dissimilarity between two graphs, defined as the minimal number of graph edit operations required to transform one graph into another.\n* The Levenshtein distance is a measure of the dissimilarity between two strings u and v, defined as the minimal number of character deletions, insertions, or substitutions required to transform u into v. This can be thought of as a special case of the shortest path metric in a graph and is one example of an edit distance.\n* Given a metric space (X,d) and an increasing concave function f \\colon [0,\\infty) \\rightarrow [0,\\infty) such that f(x) 0 if and only if x\n0, then f \\circ d is also a metric on X.\n* Given an injective function f from any set A to a metric space (X,d), d(f(x), f(y)) defines a metric on A.\n* Using T-theory, the tight span of a metric space is also a metric space. The tight span is useful in several types of analysis.\n* The set of all m by n matrices over some field is a metric space with respect to the rank distance d(X,Y) = \\mathrm{rank}(Y - X).\n* The Helly metric  is used in game theory.\n\nOpen and closed sets, topology and convergence \n\nEvery metric space is a topological space in a natural manner, and therefore all definitions and theorems about general topological spaces also apply to all metric spaces.\n\nAbout any point x in a metric space M we define the open ball of radius r > 0 (where r is a real number) about x  as the set\nB(x;r) = \\{y \\in M : d(x,y) \nThese open balls form the base for a topology on M, making it a topological space.\n\nExplicitly, a subset U of M is called open if for every x in U there exists an r > 0 such that B(x;r) is contained in U. The complement of an open set is called closed. A neighborhood of the point x is any subset of M that contains an open ball about x as a subset.\n\nA topological space which can arise in this way from a metric space is called a metrizable space; see the article on metrization theorems for further details.\n\nA sequence (x_n) in a metric space M is said to converge to the limit x \\in M iff for every \\epsilon>0, there exists a natural number N such that d(x_n,x)  for all n > N. Equivalently, one can use the general definition of convergence available in all topological spaces.\n\nA subset A of the metric space M is closed iff every sequence in A that converges to a limit in M has its limit in A.\n\nTypes of metric spaces \n\nComplete spaces\n\nA metric space M is said to be complete if every Cauchy sequence converges in M. That is to say: if d(x_n, x_m) \\to 0 as both n and m independently go to infinity, then there is some y\\in M with d(x_n, y) \\to 0.\n\nEvery Euclidean space is complete, as is every closed subset of a complete space. The rational numbers, using the absolute value metric d(x,y) = \\vert x - y \\vert, are not complete.\n\nEvery metric space has a unique (up to isometry) completion, which is a complete space that contains the given space as a dense subset. For example, the real numbers are the completion of the rationals.\n\nIf X is a complete subset of the metric space M, then X is closed in M. Indeed, a space is complete iff it is closed in any containing metric space.\n\nEvery complete metric space is a Baire space.\n\nBounded and totally bounded spaces\n\nA metric space M is called bounded if there exists some number r, such that d(x,y) ≤ r for all x and y in M.  The smallest possible such r is called the diameter of M. The space M is called precompact or totally bounded if for every r > 0 there exist finitely many open balls of radius r whose union covers M. Since the set of the centres of these balls is finite, it has finite diameter, from which it follows (using the triangle inequality) that every totally bounded space is bounded.  The converse does not hold, since any infinite set can be given the discrete metric (one of the examples above) under which it is bounded and yet not totally bounded.\n\nNote that in the context of intervals in the space of real numbers and occasionally regions in a Euclidean space Rn a bounded set is referred to as \"a finite interval\" or \"finite region\". However boundedness should not in general be confused with \"finite\", which refers to the number of elements, not to how far the set extends; finiteness implies boundedness, but not conversely. Also note that an unbounded subset of Rn may have a finite volume.\n\nCompact spaces\n\nA metric space M is compact if every sequence in M has a subsequence that converges to a point in M. This is known as sequential compactness and, in metric spaces (but not in general topological spaces), is equivalent to the topological notions of countable compactness and compactness defined via open covers.\n\nExamples of compact metric spaces include the closed interval [0,1] with the absolute value metric, all metric spaces with finitely many points, and the Cantor set. Every closed subset of a compact space is itself compact.\n\nA metric space is compact iff it is complete and totally bounded.  This is known as the Heine–Borel theorem. Note that compactness depends only on the topology, while boundedness depends on the metric.\n\nLebesgue's number lemma states that for every open cover of a compact metric space M, there exists a \"Lebesgue number\" δ such that every subset of M of diameter [http://planetmath.org/encyclopedia/CompactMetricSpacesAreSecondCountable.html PlanetMath: a compact metric space is second countable] and is a continuous image of the Cantor set. (The latter result is due to Pavel Alexandrov and Urysohn.)\n\nLocally compact and proper spaces\n\nA metric space is said to be locally compact if every point has a compact neighborhood. Euclidean spaces are locally compact, but infinite-dimensional Banach spaces are not.\n\nA space is proper if every closed ball {y : d(x,y) ≤ r} is compact. Proper spaces are locally compact, but the converse is not true in general.\n\nConnectedness\n\nA metric space M is connected if the only subsets that are both open and closed are the empty set and M itself.\n\nA metric space M is path connected if for any two points x, y \\in M there exists a continuous map f\\colon [0,1] \\to M with f(0)x and f(1)\ny.\nEvery path connected space is connected, but the converse is not true in general.\n\nThere are also local versions of these definitions: locally connected spaces and locally path connected spaces.\n\nSimply connected spaces are those that, in a certain sense, do not have \"holes\".\n\nSeparable spaces\n\nA metric space is separable space if it has a countable dense subset. Typical examples are the real numbers or any Euclidean space. For metric spaces (but not for general topological spaces) separability is equivalent to second-countability and also to the Lindelöf property.\n\nPointed metric spaces\n\nIf X is a nonempty metric space and x_0\\in X then (X,x_0) is called a pointed metric space, and x_0 is called a distinguished point.  Note that a pointed metric space is just a nonempty metric space with attention drawn to its distinguished point, and that any nonempty metric space can be viewed as a pointed metric space. The distinguished point is sometimes denoted 0 due to its similar behavior to zero in certain contexts.\n\nTypes of maps between metric spaces\n\nSuppose (M1,d1) and (M2,d2) are two metric spaces.\n\nContinuous maps\n\nThe map f:M1→M2 is continuous\nif it has one (and therefore all) of the following equivalent properties:\n;General topological continuity: for every open set U in M2, the preimage f -1(U) is open in M1\nThis is the general definition of continuity in topology.\n;Sequential continuity: if (xn) is a sequence in M1 that converges to x in M1, then the sequence (f(xn)) converges to f(x) in M2.\nThis is sequential continuity, due to Eduard Heine.\n;ε-δ definition: for every x in M1 and every ε>0 there exists δ>0 such that for all y in M1 we have\n:d_1(x,y)\nThis uses the (ε, δ)-definition of limit, and is due to Augustin Louis Cauchy.\n\nMoreover, f is continuous if and only if it is continuous on every compact subset of M1.\n\nThe image of every compact set under a continuous function is compact, and the image of every connected set under a continuous function is connected.\n\nUniformly continuous maps\n\nThe map ƒ : M1 → M2 is uniformly continuous if for every ε > 0 there exists δ > 0 such that\n\nd_1(x,y)\n\nEvery uniformly continuous map ƒ : M1 → M2 is continuous.  The converse is true if M1 is compact (Heine–Cantor theorem).\n\nUniformly continuous maps turn Cauchy sequences in M1 into Cauchy sequences in M2. For continuous maps this is generally wrong; for example, a continuous map\nfrom the open interval (0,1) onto the real line turns some Cauchy sequences into unbounded sequences.\n\nLipschitz-continuous maps and contractions\n\nGiven a real number K > 0, the map ƒ : M1 → M2 is K-Lipschitz continuous if\n\nd_2(f(x),f(y))\\leq K d_1(x,y)\\quad\\mbox{for all}\\quad x,y\\in M_1.\n\nEvery Lipschitz-continuous map is uniformly continuous, but the converse is not true in general.\n\nIf K 2 = M1 and M1 is complete. If ƒ is a contraction, then ƒ admits a unique fixed point (Banach fixed point theorem). If M1 is compact, the condition can be weakened a bit: ƒ admits a unique fixed point if\n\n d(f(x), f(y)) .\n\nIsometries\n\nThe map f:M1→M2 is an isometry if\nd_2(f(x),f(y))=d_1(x,y)\\quad\\mbox{for all}\\quad x,y\\in M_1\nIsometries are always injective; the image of a compact or complete set under an isometry is compact or complete, respectively. However, if the isometry is not surjective, then the image of a closed (or open) set need not be closed (or open).\n\nQuasi-isometries\n\nThe map f : M1 → M2 is a quasi-isometry if there exist constants A ≥ 1 and B ≥ 0 such that\n\n\\frac{1}{A} d_2(f(x),f(y))-B\\leq d_1(x,y)\\leq A d_2(f(x),f(y))+B \\text{ for all } x,y\\in M_1\n\nand a constant C ≥ 0 such that every point in M2 has a distance at most C from some point in the image f(M1).\n\nNote that a quasi-isometry is not required to be continuous. Quasi-isometries compare the \"large-scale structure\" of metric spaces; they find use in geometric group theory in relation to the word metric.\n\nNotions of metric space equivalence\n\nGiven two metric spaces (M1, d1) and (M2, d2):\n\n*They are called homeomorphic (topologically isomorphic) if there exists a homeomorphism between them (i.e., a bijection continuous in both directions).\n*They are called uniformic (uniformly isomorphic) if there exists a uniform isomorphism between them (i.e., a bijection uniformly continuous in both directions).\n*They are called isometric if there exists a bijective isometry between them. In this case, the two metric spaces are essentially identical.\n*They are called quasi-isometric if there exists a quasi-isometry between them.\n\nTopological properties\n\nMetric spaces are paracompactRudin, Mary Ellen.  [https://www.jstor.org/stable/2035708 A new proof that metric spaces are paracompact].  Proceedings of the American Mathematical Society, Vol. 20, No. 2. (Feb., 1969), p. 603. Hausdorff spaces and hence normal (indeed they are perfectly normal). An important consequence is that every metric space admits partitions of unity and that every continuous real-valued function defined on a closed subset of a metric space can be extended to a continuous map on the whole space (Tietze extension theorem). It is also true that every real-valued Lipschitz-continuous map defined on a subset of a metric space can be extended to a Lipschitz-continuous map on the whole space.\n\nMetric spaces are first countable since one can use balls with rational radius as a neighborhood base.\n\nThe metric topology on a metric space M is the coarsest topology on M relative to which the metric d is a continuous map from the product of M with itself to the non-negative real numbers.\n\nDistance between points and sets; Hausdorff distance and Gromov metric\n\nA simple way to construct a function separating a point from a closed set (as required for a completely regular space) is to consider the distance between the point and the set. If (M,d) is a metric space, S is a subset of M and x is a point of M, we define the distance from x to S as\nd(x,S) = \\inf\\{d(x,s) : s \\in S \\}  where \\inf represents the infimum.\n\nThen d(x, S) = 0 if and only if x belongs to the closure of S. Furthermore, we have the following generalization of the triangle inequality:\nd(x,S) \\leq d(x,y) + d(y,S),\nwhich in particular shows that the map x\\mapsto d(x,S) is continuous.\n\nGiven two subsets S and T of M, we define their Hausdorff distance to be\nd_H(S,T) = \\max \\{ \\sup\\{d(s,T) : s \\in S \\} , \\sup\\{ d(t,S) : t \\in T \\} \\}  where \\sup represents the supremum.\n\nIn general, the Hausdorff distance dH(S,T) can be infinite. Two sets are close to each other in the Hausdorff distance if every element of either set is close to some element of the other set.\n\nThe Hausdorff distance dH turns the set K(M) of all non-empty compact subsets of M into a metric space. One can show that K(M) is complete if M is complete.\n(A different notion of convergence of compact subsets is given by the Kuratowski convergence.)\n\nOne can then define the Gromov–Hausdorff distance between any two metric spaces by considering the minimal Hausdorff distance of isometrically embedded versions of the two spaces. Using this distance, the class of all (isometry classes of) compact metric spaces becomes a metric space in its own right.\n\nProduct metric spaces\n\nIf (M_1,d_1),\\ldots,(M_n,d_n) are metric spaces, and N is the Euclidean norm on Rn, then \\Big(M_1\\times \\ldots \\times M_n, N(d_1,\\ldots,d_n)\\Big) is a metric space, where the product metric is defined by\n\nN(d_1,...,d_n)\\Big((x_1,\\ldots,x_n),(y_1,\\ldots,y_n)\\Big) = N\\Big(d_1(x_1,y_1),\\ldots,d_n(x_n,y_n)\\Big),\n\nand the induced topology agrees with the product topology.  By the equivalence of norms in finite dimensions, an equivalent metric is obtained if N is the taxicab norm, a p-norm, the max norm, or any other norm which is non-decreasing as the coordinates of a positive n-tuple increase (yielding the triangle inequality).\n\nSimilarly, a countable product of metric spaces can be obtained using the following metric\n\nd(x,y)\\sum_{i\n1}^\\infty \\frac1{2^i}\\frac{d_i(x_i,y_i)}{1+d_i(x_i,y_i)}.\n\nAn uncountable product of metric spaces need not be metrizable. For example, \\mathbf{R}^\\mathbf{R} is not first-countable and thus isn't metrizable.\n\nContinuity of distance\n\nIn the case of a single space (M,d), the distance map d\\colon M\\times M \\rightarrow R^+ (from the definition) is uniformly continuous with respect to any of the above product metrics N(d,d), and in particular is continuous with respect to the product topology of M\\times M.\n\nQuotient metric spaces\n\nIf M is a metric space with metric d, and ~ is an equivalence relation on M, then we can endow the quotient set M/~ with the following (pseudo)metric. Given two equivalence classes [x] and [y], we define\nd'([x],[y]) = \\inf\\{d(p_1,q_1)+d(p_2,q_2)+\\dotsb+d(p_{n},q_{n})\\}\n\nwhere the infimum is taken over all finite sequences (p_1, p_2, \\dots, p_n) and (q_1, q_2, \\dots, q_n) with [p_1][x], [q_n]\n[y], [q_i][p_{i+1}], i\n1,2,\\dots, n-1. In general this will only define a pseudometric, i.e. d'([x],[y])0 does not necessarily imply that [x]\n[y]. However, for nice equivalence relations (e.g., those given by gluing together polyhedra along faces), it is a metric.\n\nThe quotient metric d is characterized by the following universal property. If f:(M,d)\\longrightarrow(X,\\delta) is a metric map between metric spaces (that is, \\delta(f(x),f(y))\\le d(x,y) for all x, y) satisfying f(x)f(y) whenever x\\sim y, then the induced function \\overline{f}\\colon M/\\sim\\longrightarrow X, given by \\overline{f}([x])\nf(x), is a metric map \\overline{f}\\colon (M/\\sim,d')\\longrightarrow (X,\\delta).\n\nA topological space is sequential if and only if it is a quotient of a metric space.Goreham, Anthony. [http://at.yorku.ca/p/a/a/o/51.pdf Sequential convergence in Topological Spaces]. Honours' Dissertation, Queen's College, Oxford (April, 2001), p. 14\n\nGeneralizations of metric spaces\n\n*Every metric space is a uniform space in a natural manner, and every uniform space is naturally a topological space. Uniform and topological spaces can therefore be regarded as generalizations of metric spaces.\n*If we consider the first definition of a metric space given above and relax the second requirement, we arrive at the concepts of a pseudometric space or a dislocated metric space.Pascal Hitzler and Anthony Seda, Mathematical Aspects of Logic Programming Semantics. Chapman and Hall/CRC, 2010. If we remove the third or fourth, we arrive at a quasimetric space, or a semimetric space.\n*If the distance function takes values in the extended real number line R∪{+∞}, but otherwise satisfies all four conditions, then it is called an extended metric and the corresponding space is called an \\infty-metric space. If the distance function takes values in some (suitable) ordered set (and the triangle inequality is adjusted accordingly), then we arrive at the notion of generalized ultrametric.Pascal Hitzler and Anthony Seda, Mathematical Aspects of Logic Programming Semantics. Chapman and Hall/CRC, 2010.\n*Approach spaces are a generalization of metric spaces, based on point-to-set distances, instead of point-to-point distances.\n*A continuity space is a generalization of metric spaces and posets, that can be used to unify the notions of metric spaces and domains.\n* A partial metric space is intended to be the least generalisation of the notion of a metric space, such that the distance of each point from itself is no longer necessarily zero.http://www.dcs.warwick.ac.uk/pmetric/\n\nMetric spaces as enriched categories \n\nThe ordered set (\\mathbb{R},\\geq) can be seen as a category by requesting exactly one morphism a\\to b if a\\geq b and none otherwise. By using + as the tensor product and 0 as the identity, it becomes a monoidal category R^*.\nEvery metric space (M,d) can now be viewed as a category M^* enriched over R^*:\n* Set \\operatorname{Ob}(M^*):=M\n* For each X,Y\\in M set \\operatorname{Hom}(X,Y):=d(X,Y)\\in \\operatorname{Ob}(R^*)\n* The composition morphism \\operatorname{Hom}(Y,Z)\\otimes \\operatorname{Hom}(X,Y)\\to \\operatorname{Hom}(X,Z) will be the unique morphism in R^* given from the triangle inequality d(y,z)+d(x,y)\\geq d(x,z)\n* The identity morphism 0\\to \\operatorname{Hom}(X,X) will be the unique morphism given from the fact that 0\\geq d(X,X).\n* Since R^* is a poset, all diagrams that are required for an enriched category commute automatically.\n\nSee the paper by F.W. Lawvere listed below. Metric space. http://en.wikipedia.org/?curid=20018."
  }
}
