{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19829",
  "eid" : "3e087c80-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778613320,
  "textBody" : "May Day is a public holiday usually celebrated on May 1. It is an ancient northern hemisphere spring festivalAveni, Anthony Aveni (2004).  \"May Day: A Collision of Forces\".  The Book of the Year: A Brief History of Our Seasonal Holidays. Oxford: Oxford University Press. pp. 79-89. and a traditional spring holiday in many cultures. Dances, singing, and cake are usually part of the festivities. \nIn the late 19th century, May Day was chosen as the date for International Workers' Day by the Socialists and Communists of the Second International to commemorate the Haymarket affair in Chicago. International Workers' Day may also be referred to as \"May Day\", but it is a different celebration from the traditional May Day.\n\nTraditional May Day origins and celebrations \n\nThe earliest May Day celebrations appeared with the Floralia, festival of Flora, the Roman goddess of flowers, held on April 27 during the Roman Republic era, and with the Walpurgis Night celebrations of the Germanic countries.  It is also associated with the Gaelic Beltane, most commonly held on April 30. The day was a traditional summer holiday in many European pagan cultures.  While February 1 was the first day of spring, May 1 was the first day of summer; hence, the summer solstice on June 25 (now June 21) was Midsummer.\n\nAs Europe became Christianised, the pagan holidays lost their religious character and May Day changed into a popular secular celebration.  A significant celebration of May Day occurs in Germany where it is one of several days on which St. Walburga, credited with bringing Christianity to Germany, is celebrated.  The secular versions of May Day, observed in Europe and North America, may be best known for their traditions of dancing around the maypole and crowning the Queen of May.  Fading in popularity since the late 20th century is the giving of \"May baskets,\" small baskets of sweets or flowers, usually left anonymously on neighbours' doorsteps.\n\nSince the 18th century, many Roman Catholics have observed May – and May Day – with various May devotions to the Blessed Virgin Mary  In works of art, school skits, and so forth, Mary's head will often be adorned with flowers in a May crowning.  May 1 is also one of two feast days of the Catholic patron saint of workers St Joseph the Worker, a carpenter, husband to Mother Mary, and surrogate father of Jesus. Replacing another feast to St. Joseph, this date was chosen by Pope Pius XII in 1955 as a counterpoint to the communist International Workers Day celebrations on May Day.\n\nIn the late 20th century, many neopagans began reconstructing traditions and celebrating May Day as a pagan religious festival.E.g. [http://www.vancouversun.com/news/Todd+dancing+celebrates+pagan+fertility/6554073/story.html Douglas Todd: \"May Day dancing celebrates neo-pagan fertility\", Vancouver Sun, 1 May 2012]: accessed May 8, 2014\n\nEurope \n\nUnited Kingdom \n\nTraditional English May Day rites and celebrations include crowning a May Queen and celebrations involving a maypole. Historically, Morris dancing has been linked to May Day celebrations.Rodney P. Carlisle (2009) Encyclopedia of Play in Today's Society, Volume 1. SAGE  [https://books.google.co.uk/books?idjLqXM3U_pzEC&pg\nPA402&dqmay+day+england+morris+dancing&hl\nen&saX&ved\n0ahUKEwim-uTRr8XSAhUMLcAKHYQdCoc4FBDoAQgZMAA#vonepage&q\nmay%20day%20england%20morris%20dancing&ffalse] Much of this tradition derives from the pagan Anglo-Saxon customs held during \"Þrimilci-mōnaþ\"Caput XV:\nDe mensibus Anglorum from De mensibus Anglorum. Available online: [http://www.nabkal.de/beda/beda_15.html] (the Old English name for the month of May meaning Month of Three Milkings) along with many Celtic traditions.\n\nMay Day has been a traditional day of festivities throughout the centuries, most associated with towns and villages celebrating springtime fertility (of the soil, livestock, and people) and revelry with village fetes and community gatherings. Seeding has been completed by this date and it was convenient to give farm labourers a day off. Perhaps the most significant of the traditions is the maypole, around which traditional dancers circle with ribbons.\n\nThe spring bank holiday on the first Monday in May was created in 1978; May Day itself May 1 is not a public holiday in England (unless it falls on a Monday). In February 2011, the UK Parliament was reported to be considering scrapping the bank holiday associated with May Day, replacing it with a bank holiday in October, possibly coinciding with Trafalgar Day (celebrated on October 21), to create a \"United Kingdom Day\".\n\nUnlike the other Bank Holidays and common law holidays, the first Monday in May is taken off from (state) schools by itself, and not as part of a half term or end of term holiday. This is because it has no Christian significance and does not otherwise fit into the usual school holiday pattern. (By contrast, the Easter Holiday can start as late - relative to Easter - as Good Friday, if Easter falls early in the year;  or finish as early - relative to Easter - as Easter Monday, if Easter falls late in the year, because of the supreme significance of Good Friday and Easter Day to Christianity.)\n\nMay Day was abolished and its celebration banned by Puritan parliaments during the Interregnum, but reinstated with the restoration of Charles II in 1660.  May 1, 1707, was the day the Act of Union came into effect, joining England and Scotland to form the Kingdom of Great Britain.\n\nIn Oxford, it is a centuries-old tradition for May Morning revellers to gather below the Great Tower of Magdalen College at 6am to listen to the college choir sing traditional madrigals as a conclusion to the previous night's celebrations. Since the 1980s some people then jump off Magdalen Bridge into the River Cherwell. For some years, the bridge has been closed on 1 May to prevent people from jumping, as the water under the bridge is only 2 ft deep and jumping from the bridge has resulted in serious injury in the past. There are still people who climb the barriers and leap into the water, causing themselves injury.Staff (May 1, 2008).  [http://news.bbc.co.uk/1/hi/england/oxfordshire/7376954.stm \"Jumpers Flout May Day Bridge Ban\"]. BBC News. Retrieved May 1, 2013.\n\nIn Durham, students of the University of Durham gather on Prebend's Bridge to see the sunrise and enjoy festivities, folk music, dancing, madrigal singing and a barbecue breakfast. This is an emerging Durham tradition, with patchy observance since 2001.\n\nKingsbury Episcopi, Somerset, has seen its yearly May Day Festival celebrations on the May bank holiday Monday burgeon in popularity in the recent years. Since it was reinstated 21 years ago it has grown in size, and on May 5, 2014 thousands of revellers were attracted from all over the south west to enjoy the festivities, with BBC Somerset covering the celebrations. These include traditional maypole dancing and morris dancing, as well as contemporary music acts..\n\nWhitstable, Kent, hosts a good example of more traditional May Day festivities, where the Jack in the Green festival was revived in 1976 and continues to lead an annual procession of morris dancers through the town on the May bank holiday. A separate revival occurred in Hastings in 1983 and has become a major event in the town calendar. A traditional sweeps festival is performed over the May bank holiday in Rochester, Kent, where the Jack in the Green is woken at dawn on May 1 by Morris dancers.\n\nAt 7:15 p.m. on May 1 each year, the Kettle Bridge Clogs morris dancing side dance across Barming Bridge (otherwise known as the Kettle Bridge), which spans the River Medway near Maidstone, to mark the official start of their morris dancing season.\n\nAlso known as Ashtoria Day in northern parts of rural Cumbria. A celebration of unity and female bonding. Although not very well known, it is often cause for huge celebration.\n\nThe Maydayrun involves thousands of motorbikes taking a 55 mi trip from London (Locksbottom) to the Hastings seafront, East Sussex. The event has been taking place for almost 30 years now and has grown in interest from around the country, both commercially and publicly. The event is not officially organised; the police only manage the traffic, and volunteers manage the parking.\n\nPadstow in Cornwall holds its annual Obby-Oss (Hobby Horse) day of festivities. This is believed to be one of the oldest fertility rites in the UK; revellers dance with the Oss through the streets of the town and even through the private gardens of the citizens, accompanied by accordion players and followers dressed in white with red or blue sashes who sing the traditional \"May Day\" song. The whole town is decorated with springtime greenery, and every year thousands of onlookers attend. Prior to the 19th-century, distinctive May Day celebrations were widespread throughout west Cornwall, and are being revived in St. Ives and Penzance.\n\nKingsand, Cawsand and Millbrook in Cornwall celebrate Flower Boat Ritual on the May Day bank holiday.  A model of the ship The Black Prince is covered in flowers and is taken in procession from the Quay at Millbrook to the beach at Cawsand where it is cast adrift.  The houses in the villages are decorated with flowers and people traditionally wear red and white clothes.  There are further celebrations in Cawsand Square with Morris dancing and May pole dancing.\n\nScotland\n\nMay Day has been celebrated in Scotland for centuries. It was previously closely associated with the Beltane festival.http://www.dsl.ac.uk/entry/dost/beltane Reference to this earlier celebration is found in poem 'Peblis to the Play', contained in the Maitland Manuscripts of fifteenth- and sixteenth-century Scots poetry: \n\nAt Beltane, quhen ilk bodie bownis\nTo Peblis to the Play,\nTo heir the singin and the soundis;\nThe solace, suth to say,\nBe firth and forrest furth they found\nThay graythis tham full gay;\nGod wait that wald they do that stound,\nFor it was their feist day,\nThay said, [...]\n\nThe poem describes the celebration in the town of Peebles in the Scottish Borders, which continues to stage a parade and pageant each year, including the annual ‘Common Riding’, which takes place in many towns throughout the Borders. As well as the crowning of a Beltane Queen each year, it is custom to sing ‘The Beltane Song’. http://www.tracscotland.org/sites/default/files/May%20Songs%20and%20Rhymes_0.pdf\n\nJohn Jamieson, in his Etymological Dictionary of the Scottish Language (1808) describes some of the May Day/Beltane customs which persisted in the eighteenth and early nineteenth centuries in parts of Scotland, which he noted were beginning to die out. http://www.scotsdictionary.com/ In the nineteenth century,  folklorist Alexander Carmichael (1832–1912), collected the song Am Beannachadh Bealltain (The Beltane Blessing) in his Carmina Gadelica, which he heard from a Crofter in South Uist. http://www.tracscotland.org/sites/default/files/May%20Songs%20and%20Rhymes_0.pdf\n\nScottish May Day/Beltane celebrations have been somewhat revived in the late twentieth century. Both Edinburgh and Glasgow organise Mayday festivals and rallies.  In Edinburgh, the Beltane Fire Festival is held on the evening of May eve and into the early hours of May Day on the city's Calton Hill.  An older Edinburgh tradition has it that young women who climb Arthur's Seat and wash their faces in the morning dew will have lifelong beauty. At the University of St Andrews, some of the students gather on the beach late on April 30 and run into the North Sea at sunrise on May Day, occasionally naked.  This is accompanied by torchlit processions and much elated celebration.\n\nAt the University of St Andrews, some of the students gather on the beach late on April 30 and run into the North Sea at sunrise on May Day, occasionally naked.  This is accompanied by torchlit processions and much elated celebration.\n\nBoth Edinburgh and Glasgow organise Mayday festivals and rallies.  In Edinburgh, the Beltane Fire Festival is held on the evening of May eve and into the early hours of May Day on the city's Calton Hill.  An older Edinburgh tradition has it that young women who climb Arthur's Seat and wash their faces in the morning dew will have lifelong beauty.\n\nFinland \n\nCelebrations among the younger generations take place on May Day Eve, see Walpurgis Night in Finland, most prominent being the afternoon \"crowning\" of statues in towns around the country with a student cap.\n\nMay Day is known as Vappu in Finnish. This is a public holiday that is the only carnival-style street festivity in the country. People young and old, particularly students, party outside, picnic and wear caps or other decorative clothing.\n\nMany Finns make a special mead from lemons, brown sugar, and yeast called \"sima\". It contains very little alcohol, so even children can drink it. A similar product can also be bought in all stores. Finns also make doughnuts and a crisp pastry fried in oil made from a similar, more liquid dough called  that resembles funnel cake.\n\nBalloons and other decorations like paper streamers are seen everywhere.\n\nEstonia \n\nMay Day or \"Spring Day\" (Kevadpüha) is a national holiday in Estonia celebrating the arrival of spring.\n\nMore traditional festivities take place throughout the night before and into the early hours of May 1, on the Walpurgis Night (Volbriöö).\n\nFrance \n\n \nOn May 1, 1561, King Charles IX of France received a lily of the valley as a lucky charm. He decided to offer a lily of the valley each year to the ladies of the court. At the beginning of the 20th century, it became custom to give a sprig of lily of the valley, a symbol of springtime, on May 1. The government permits individuals and workers' organisations to sell them tax-free on that single day. Nowadays, people may present loved ones either with bunches of lily of the valley or dog rose flowers.[http://www.timeanddate.com/holidays/france/labor-day May Day in France Timeanddate.com].\n\nGermany \n\nIn rural regions of Germany, especially the Harz Mountains, Walpurgisnacht celebrations of pagan origin are traditionally held on the night before May Day, including bonfires and the wrapping of a Maibaum (maypole). Young people use this opportunity to party, while the day itself is used by many families to get some fresh air. Motto: \"Tanz in den Mai\" (\"Dance into May\").\n\nIn the Rhineland, May 1 is also celebrated by the delivery of a maypole, a tree covered in streamers to the house of a girl the night before. The tree is typically from a love interest, though a tree wrapped only in white streamers is a sign of dislike. Women usually place roses or rice in the form of a heart at the house of their beloved one. It is common to stick the heart to a window or place it in front of the doormat. In leap years, it is the responsibility of the women to place the maypole. All the action is usually done secretly and it is an individual's choice whether to give a hint of their identity or stay anonymous.\n\nMay Day was not established as a public holiday until 1933. As Labour Day, many political parties and unions host activities related to work and employment.\n\nIreland \n\nMay Day has been celebrated in Ireland since pagan times as the feast of Beltane (Bealtaine) and in latter times as Mary's day. Traditionally, bonfires were lit to mark the coming of summer and to banish the long nights of winter. Officially Irish May Day holiday is the first Monday in May. Old traditions such as bonfires are no longer widely observed, though the practice still persists in some places across the country. Limerick, Clare and many other people in other counties still keep on this tradition, including areas in Dublin city such as Ringsend.\n\nItaly \n\nIn Italy it is called Calendimaggio or cantar maggio a seasonal feast held to celebrate the arrival of spring. The event takes its name from the period in which it takes place, that is, the beginning of May, from the Latin calenda maia. The Calendimaggio is a tradition still alive today in many regions of Italy as an allegory of the return to life and rebirth: among these Piedmont, Liguria, Lombardy, Emilia-Romagna (for example, is celebrated in the area of the Quattro Province or Piacenza, Pavia, Alessandria and Genoa), Tuscany and Umbria. This magical-propitiatory ritual is often performed during an almsgiving in which, in exchange for gifts (traditionally eggs, wine, food or sweets), the Maggi (or maggerini) sing auspicious verses to the inhabitants of the houses they visit. Throughout the Italian peninsula these Il Maggio couplets are very diverse—most are love songs with a strong romantic theme, that young people sang to celebrate the arrival of spring. Symbols of spring revival are the trees (alder, golden rain) and flowers (violets, roses), mentioned in the verses of the songs, and with which the maggerini adorn themselves. In particular the plant alder, which grows along the rivers, is considered the symbol of life and that's why it is often present in the ritual.\n\nCalendimaggio can be historically noted in Tuscany as a mythical character who had a predominant role and met many of the attributes of the god Belenus.  In Lucania, the Maggi have a clear auspicious character of pagan origin. In Syracuse, Sicily, the Albero della Cuccagna (cf. \"Greasy pole\") is held during the month of May,  a feast celebrated to commemorate the victory over the Athenians led by Nicias. However, Angelo de Gubernatis, in his work Mythology of Plants, believes that without doubt the festival was previous to that of said victory.\n\nIt is a celebration that dates back to ancient peoples, and is very integrated with the rhythms of nature, such as the Celts (celebrating Beltane), Etruscans and Ligures, in which the arrival of summer was of great importance.\n\nGreece \n\nMay 1st is a day that celebrates Spring.\n\nMaios (Latin Maius), the month of May, took its name from the goddess Maia (Gr ), a Greek and Roman goddess of fertility. The day of Maios (Modern Greek Πρωτομαγιά) celebrates the final victory of the summer against winter as the victory of life against death. The celebration is similar to an ancient ritual associated with another minor demi-god Adonis which also celebrated the revival of nature. There is today some conflation with yet another tradition, the revival or marriage of Dionysus (the Greek God of theatre and wine-making). This event, however, was celebrated in ancient times not in May but in association with the Anthesteria, a festival held in February and dedicated to the goddess of agriculture Demeter and her daughter Persephone. Persephone emerged every year at the end of Winter from the Underworld. The Anthesteria was a festival of souls, plants and flowers, and Persephone's coming to earth from Hades marked the rebirth of nature, a common theme in all these traditions.\n\nWhat remains of the customs today, echoes these traditions of antiquity. A common, until recently, May Day custom involved the annual revival of a youth called Adonis, or alternatively of Dionysus, or of Maios (in Modern Greek Μαγιόπουλο, the Son of Maia). In a simple theatrical ritual, the significance of which has long been forgotten, a chorus of young girls sang a song over a youth lying on the ground, representing Adonis, Dionysus or Maios. At the end of the song, the youth rose up and a flower wreath was placed on his head.\n\nThe most common aspect of modern May Day celebrations is the preparation of a flower wreath from wild flowers, although as a result of urbanisation there is an increasing trend to buy wreaths from flower shops. The flowers are placed on the wreath against a background of green leaves and the wreath is hung either on the entrance to the family house/apartment or on a balcony. It remains there until midsummer night. On that night, the flower wreaths are set alight in bonfires known as St John’s fires. Youths leap over the flames consuming the flower wreaths. This custom has also practically disappeared, like the theatrical revival of Adonis/Dionysus/Maios, as a result of rising urban traffic and with no alternative public grounds in most Greek city neighbourhoods, not to mention potential conflicts with demonstrating workers.\n\nBulgaria \n\nOn May Day, Bulgarians celebrate Irminden (or Yeremiya, Eremiya, Irima, Zamski den). The holiday is associated with snakes and lizards and rituals are made in order to protect people from them. The name of the holiday comes from the prophet Jeremiah, but its origins are most probably pagan.\n\nIt is said that on the days of the Holy Forty or Annunciation snakes come out of their burrows, and on Irminden their king comes out. Old people believe that those working in the fields on this day will be bitten by a snake in summer.\n\nIn western Bulgaria people light fires, jump over them and make noises to scare snakes. Another custom is to prepare \"podnici\" (special clay pots made for baking bread).\n\nThis day is especially observed by pregnant women so that their offspring do not catch \"yeremiya\" — an illness due to evil powers.\n\nRomania \n\nOn May Day, the Romanians celebrate the arminden (or armindeni), the beginning of summer, symbolically tied with the protection of crops and farm animals. The name comes from Slavonic Jeremiinŭ dĭnĭ, meaning prophet Jeremiah's day, but the celebration rites and habits of this day are apotropaic and pagan (possibly originating in the cult of the god Pan).\n\nThe day is also called ziua pelinului (\"mugwort day\") or ziua bețivilor (\"drunkards' day\") and it is celebrated to ensure good wine in autumn and, for people and farm animals alike, good health and protection from the elements of nature (storms, hail, illness, pests). People would have parties in natural surroundings, with lăutari (fiddlers) for those who could afford it. Then it is customary to roast and eat lamb, along with new mutton cheese, and to drink mugwort-flavoured wine, or just red wine, to refresh the blood and get protection from diseases. On the way back, the men wear lilac or mugwort flowers on their hats.\n\nOther apotropaic rites include, in some areas of the country, people washing their faces with the morning dew (for good health) and adorning the gates for good luck and abundance with green branches or with birch saplings (for the houses with maiden girls). The entries to the animals' shelters are also adorned with green branches. All branches are left in place until the wheat harvest when they are used in the fire which will bake the first bread from the new wheat.\n\nOn May Day eve, country women do not work in the field as well as in the house to avoid devastating storms and hail coming down on the village.\n\nArminden is also ziua boilor (oxen day) and thus the animals are not to be used for work, or else they could die or their owners could get ill.\n\nIt is said that the weather is always good on May Day to allow people to celebrate.\n\nPortugal \n\n\"Os Maios\" is celebrated throughout Portugal, with special focus on the northern territories. These festivities are a continuum of the \"Os Maios\" of Galiza. People put the yellow flowers of Portuguese brooms, known as giestas, on windows, doors, gates and every doorway of houses, granaries, cars, etc., which they collect on the evening of the 30th of April when the Portuguese brooms are blooming, to defend those places from bad spirits, witches and the evil eye. This must be done before midnight. In ancient times, this was done while playing traditional night-music. In some places, children were dressed in these flowers and went from place to place begging for money or bread. On the 1st of May, people also used to sing \"Cantigas de Maio\", traditional songs related to this day and the whole month of May.[https://books.google.co.uk/books?idc3I-AAAAYAAJ&pg\nRA1-PA138&lpgRA1-PA138&dq\ncantar+as+janeiras+e+as+maias&sourcebl&ots\nx7tH5pJAdE&sigjgZGPvh_GLWqa1yxC5Lxuc48If4&hl\nen&saX&ei\nwP2DUKrvJ4rD0QXX4oHwAw#vonepage&q\ncantar%20as%20janeiras%20e%20as%20maias&f=false]\n\nSpain \n\nMay Day is celebrated throughout the country as Los Mayos (lit. \"the Mays\")  often in a similar way to \"Fiesta de las Cruces\" in many parts of Hispanic America.  By way of example, in Galicia, the festival (os maios, in the local language) consists in different representations around a decorated tree or sculpture. People sing popular songs (also called maios,) making mentions to social and political events during the past year, sometimes under the form of a converse, while they walk around the sculpture with the percussion of two sticks. In Lugo and in the village of Vilagarcía de Arousa it was usual to ask a tip to the attendees, which used to be a handful of dry chestnuts (castañas maiolas), walnuts or hazelnuts. Today the tradition became a competition where the best sculptures and songs receive a prize.\n\nIn the Galician city of Ourense this day is celebrated traditionally on 3 May, the day of the Holy Cross, that in the Christian tradition replaced the tree \"where the health, life and resurrection are,\" according to the introit of that day's mass.\n\nSweden \n\nThe more traditional festivities have moved to the day before, Walpurgis Night (\"Valborgsmässoafton\"), known in some locales as simply \"Last of April\". The first of May is instead celebrated as International Workers' Day.\n\nPoland \n\nIn Poland, there is a state holiday on May 1. It is currently celebrated without a specific connotation, and as such it is May Day. However, due to historical connotations, most of the celebrations are focused around Labour Day festivities. It is customary for labour activists and left-wing political parties to organize parades in cities and towns across Poland on this day. The holiday is also commonly referred to as \"Labour Day\" (\"Święto Pracy\").\n\nIn Poland, May Day is closely followed by May 3rd Constitution Day. These two dates combined often result in a long weekend called \"Majówka\". People often travel, and \"Majówka\" is unofficially considered the start of the barbecuing season in Poland.  Between these two, on May 2, though formerly a working day, there is now a patriotic holiday, the Day of the Polish Flag (Dzień Flagi Rzeczypospolitej Polskiej), introduced by a Parliamentary Act of February 20, 2004.May Day has a public holiday too.\n\nNorth America \n\nCanada \n\nMay Day is celebrated in some parts of the provinces of British Columbia, New Brunswick and Ontario.\n\nToronto\n\nIn Toronto, on the morning of 1 May, various Morris Dancing troops from Toronto and Hamilton gather on the road by Grenadier Cafe, in High Park to \"dance in the May\". The dancers and crowd then gather together and sing traditional May Day songs such as Hal-An-Tow and Padstow.\n\nBritish Columbia\n\nCelebrations often take place not on 1 May but during the Victoria Day long weekend, later in the month and when the weather is likely to be better. The longest continually observed May Day in the British Commonwealth is held in the city of New Westminster, BC. There, the first May Day celebration was held on 4 May 1870.\n\nUnited States \n\nMay Day was also celebrated by some early European settlers of the American continent. In some parts of the United States, May baskets are made. These are small baskets usually filled with flowers or treats and left at someone's doorstep. The giver rings the bell and runs away.\n\nModern May Day ceremonies in the U.S. vary greatly from region to region and many unite both the holiday's \"Green Root\" (pagan) and \"Red Root\" (labour) traditions.Sheehy, Colleen J. (Ed., 1999). Theatre of Wonder: 25 Years in the Heart of the Beast. Minneapolis: University of Minnesota Press.. p. 79-89.\n\nMay Day celebrations were common at women's colleges and academic institutions in the late nineteenth and early twentieth century, a tradition that continues at Bryn Mawr College and Brenau University to this day.\n\nIn Minneapolis, the May Day Parade and Festival is presented annually by In the Heart of the Beast Puppet and Mask Theatre on the first Sunday in May, and draws around 50,000 people to Powderhorn Park.\n\nHawaii \n\nIn Hawaii, May Day is also known as Lei Day, and it is normally set aside as a day to celebrate island culture in general and the culture of the Native Hawaiians in particular.. Invented by poet and local newspaper columnist Don Blanding, the first Lei Day was celebrated on 1 May 1927 in Honolulu. Leonard \"Red\" and Ruth Hawk composed \"May Day Is Lei Day in Hawai'i,\" the traditional holiday song.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May Day" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19829" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "May Day is a public holiday usually celebrated on May 1. It is an ancient northern hemisphere spring festivalAveni, Anthony Aveni (2004).  \"May Day: A Collision of Forces\".  The Book of the Year: A Brief History of Our Seasonal Holidays. Oxford: Oxford University Press. pp. 79-89. and a traditional spring holiday in many cultures. Dances, singing, and cake are usually part of the festivities. \nIn the late 19th century, May Day was chosen as the date for International Workers' Day by the Socialists and Communists of the Second International to commemorate the Haymarket affair in Chicago. International Workers' Day may also be referred to as \"May Day\", but it is a different celebration from the traditional May Day.\n\nTraditional May Day origins and celebrations \n\nThe earliest May Day celebrations appeared with the Floralia, festival of Flora, the Roman goddess of flowers, held on April 27 during the Roman Republic era, and with the Walpurgis Night celebrations of the Germanic countries.  It is also associated with the Gaelic Beltane, most commonly held on April 30. The day was a traditional summer holiday in many European pagan cultures.  While February 1 was the first day of spring, May 1 was the first day of summer; hence, the summer solstice on June 25 (now June 21) was Midsummer.\n\nAs Europe became Christianised, the pagan holidays lost their religious character and May Day changed into a popular secular celebration.  A significant celebration of May Day occurs in Germany where it is one of several days on which St. Walburga, credited with bringing Christianity to Germany, is celebrated.  The secular versions of May Day, observed in Europe and North America, may be best known for their traditions of dancing around the maypole and crowning the Queen of May.  Fading in popularity since the late 20th century is the giving of \"May baskets,\" small baskets of sweets or flowers, usually left anonymously on neighbours' doorsteps.\n\nSince the 18th century, many Roman Catholics have observed May – and May Day – with various May devotions to the Blessed Virgin Mary  In works of art, school skits, and so forth, Mary's head will often be adorned with flowers in a May crowning.  May 1 is also one of two feast days of the Catholic patron saint of workers St Joseph the Worker, a carpenter, husband to Mother Mary, and surrogate father of Jesus. Replacing another feast to St. Joseph, this date was chosen by Pope Pius XII in 1955 as a counterpoint to the communist International Workers Day celebrations on May Day.\n\nIn the late 20th century, many neopagans began reconstructing traditions and celebrating May Day as a pagan religious festival.E.g. [http://www.vancouversun.com/news/Todd+dancing+celebrates+pagan+fertility/6554073/story.html Douglas Todd: \"May Day dancing celebrates neo-pagan fertility\", Vancouver Sun, 1 May 2012]: accessed May 8, 2014\n\nEurope \n\nUnited Kingdom \n\nTraditional English May Day rites and celebrations include crowning a May Queen and celebrations involving a maypole. Historically, Morris dancing has been linked to May Day celebrations.Rodney P. Carlisle (2009) Encyclopedia of Play in Today's Society, Volume 1. SAGE  [https://books.google.co.uk/books?idjLqXM3U_pzEC&pg\nPA402&dqmay+day+england+morris+dancing&hl\nen&saX&ved\n0ahUKEwim-uTRr8XSAhUMLcAKHYQdCoc4FBDoAQgZMAA#vonepage&q\nmay%20day%20england%20morris%20dancing&ffalse] Much of this tradition derives from the pagan Anglo-Saxon customs held during \"Þrimilci-mōnaþ\"Caput XV:\nDe mensibus Anglorum from De mensibus Anglorum. Available online: [http://www.nabkal.de/beda/beda_15.html] (the Old English name for the month of May meaning Month of Three Milkings) along with many Celtic traditions.\n\nMay Day has been a traditional day of festivities throughout the centuries, most associated with towns and villages celebrating springtime fertility (of the soil, livestock, and people) and revelry with village fetes and community gatherings. Seeding has been completed by this date and it was convenient to give farm labourers a day off. Perhaps the most significant of the traditions is the maypole, around which traditional dancers circle with ribbons.\n\nThe spring bank holiday on the first Monday in May was created in 1978; May Day itself May 1 is not a public holiday in England (unless it falls on a Monday). In February 2011, the UK Parliament was reported to be considering scrapping the bank holiday associated with May Day, replacing it with a bank holiday in October, possibly coinciding with Trafalgar Day (celebrated on October 21), to create a \"United Kingdom Day\".\n\nUnlike the other Bank Holidays and common law holidays, the first Monday in May is taken off from (state) schools by itself, and not as part of a half term or end of term holiday. This is because it has no Christian significance and does not otherwise fit into the usual school holiday pattern. (By contrast, the Easter Holiday can start as late - relative to Easter - as Good Friday, if Easter falls early in the year;  or finish as early - relative to Easter - as Easter Monday, if Easter falls late in the year, because of the supreme significance of Good Friday and Easter Day to Christianity.)\n\nMay Day was abolished and its celebration banned by Puritan parliaments during the Interregnum, but reinstated with the restoration of Charles II in 1660.  May 1, 1707, was the day the Act of Union came into effect, joining England and Scotland to form the Kingdom of Great Britain.\n\nIn Oxford, it is a centuries-old tradition for May Morning revellers to gather below the Great Tower of Magdalen College at 6am to listen to the college choir sing traditional madrigals as a conclusion to the previous night's celebrations. Since the 1980s some people then jump off Magdalen Bridge into the River Cherwell. For some years, the bridge has been closed on 1 May to prevent people from jumping, as the water under the bridge is only 2 ft deep and jumping from the bridge has resulted in serious injury in the past. There are still people who climb the barriers and leap into the water, causing themselves injury.Staff (May 1, 2008).  [http://news.bbc.co.uk/1/hi/england/oxfordshire/7376954.stm \"Jumpers Flout May Day Bridge Ban\"]. BBC News. Retrieved May 1, 2013.\n\nIn Durham, students of the University of Durham gather on Prebend's Bridge to see the sunrise and enjoy festivities, folk music, dancing, madrigal singing and a barbecue breakfast. This is an emerging Durham tradition, with patchy observance since 2001.\n\nKingsbury Episcopi, Somerset, has seen its yearly May Day Festival celebrations on the May bank holiday Monday burgeon in popularity in the recent years. Since it was reinstated 21 years ago it has grown in size, and on May 5, 2014 thousands of revellers were attracted from all over the south west to enjoy the festivities, with BBC Somerset covering the celebrations. These include traditional maypole dancing and morris dancing, as well as contemporary music acts..\n\nWhitstable, Kent, hosts a good example of more traditional May Day festivities, where the Jack in the Green festival was revived in 1976 and continues to lead an annual procession of morris dancers through the town on the May bank holiday. A separate revival occurred in Hastings in 1983 and has become a major event in the town calendar. A traditional sweeps festival is performed over the May bank holiday in Rochester, Kent, where the Jack in the Green is woken at dawn on May 1 by Morris dancers.\n\nAt 7:15 p.m. on May 1 each year, the Kettle Bridge Clogs morris dancing side dance across Barming Bridge (otherwise known as the Kettle Bridge), which spans the River Medway near Maidstone, to mark the official start of their morris dancing season.\n\nAlso known as Ashtoria Day in northern parts of rural Cumbria. A celebration of unity and female bonding. Although not very well known, it is often cause for huge celebration.\n\nThe Maydayrun involves thousands of motorbikes taking a 55 mi trip from London (Locksbottom) to the Hastings seafront, East Sussex. The event has been taking place for almost 30 years now and has grown in interest from around the country, both commercially and publicly. The event is not officially organised; the police only manage the traffic, and volunteers manage the parking.\n\nPadstow in Cornwall holds its annual Obby-Oss (Hobby Horse) day of festivities. This is believed to be one of the oldest fertility rites in the UK; revellers dance with the Oss through the streets of the town and even through the private gardens of the citizens, accompanied by accordion players and followers dressed in white with red or blue sashes who sing the traditional \"May Day\" song. The whole town is decorated with springtime greenery, and every year thousands of onlookers attend. Prior to the 19th-century, distinctive May Day celebrations were widespread throughout west Cornwall, and are being revived in St. Ives and Penzance.\n\nKingsand, Cawsand and Millbrook in Cornwall celebrate Flower Boat Ritual on the May Day bank holiday.  A model of the ship The Black Prince is covered in flowers and is taken in procession from the Quay at Millbrook to the beach at Cawsand where it is cast adrift.  The houses in the villages are decorated with flowers and people traditionally wear red and white clothes.  There are further celebrations in Cawsand Square with Morris dancing and May pole dancing.\n\nScotland\n\nMay Day has been celebrated in Scotland for centuries. It was previously closely associated with the Beltane festival.http://www.dsl.ac.uk/entry/dost/beltane Reference to this earlier celebration is found in poem 'Peblis to the Play', contained in the Maitland Manuscripts of fifteenth- and sixteenth-century Scots poetry: \n\nAt Beltane, quhen ilk bodie bownis\nTo Peblis to the Play,\nTo heir the singin and the soundis;\nThe solace, suth to say,\nBe firth and forrest furth they found\nThay graythis tham full gay;\nGod wait that wald they do that stound,\nFor it was their feist day,\nThay said, [...]\n\nThe poem describes the celebration in the town of Peebles in the Scottish Borders, which continues to stage a parade and pageant each year, including the annual ‘Common Riding’, which takes place in many towns throughout the Borders. As well as the crowning of a Beltane Queen each year, it is custom to sing ‘The Beltane Song’. http://www.tracscotland.org/sites/default/files/May%20Songs%20and%20Rhymes_0.pdf\n\nJohn Jamieson, in his Etymological Dictionary of the Scottish Language (1808) describes some of the May Day/Beltane customs which persisted in the eighteenth and early nineteenth centuries in parts of Scotland, which he noted were beginning to die out. http://www.scotsdictionary.com/ In the nineteenth century,  folklorist Alexander Carmichael (1832–1912), collected the song Am Beannachadh Bealltain (The Beltane Blessing) in his Carmina Gadelica, which he heard from a Crofter in South Uist. http://www.tracscotland.org/sites/default/files/May%20Songs%20and%20Rhymes_0.pdf\n\nScottish May Day/Beltane celebrations have been somewhat revived in the late twentieth century. Both Edinburgh and Glasgow organise Mayday festivals and rallies.  In Edinburgh, the Beltane Fire Festival is held on the evening of May eve and into the early hours of May Day on the city's Calton Hill.  An older Edinburgh tradition has it that young women who climb Arthur's Seat and wash their faces in the morning dew will have lifelong beauty. At the University of St Andrews, some of the students gather on the beach late on April 30 and run into the North Sea at sunrise on May Day, occasionally naked.  This is accompanied by torchlit processions and much elated celebration.\n\nAt the University of St Andrews, some of the students gather on the beach late on April 30 and run into the North Sea at sunrise on May Day, occasionally naked.  This is accompanied by torchlit processions and much elated celebration.\n\nBoth Edinburgh and Glasgow organise Mayday festivals and rallies.  In Edinburgh, the Beltane Fire Festival is held on the evening of May eve and into the early hours of May Day on the city's Calton Hill.  An older Edinburgh tradition has it that young women who climb Arthur's Seat and wash their faces in the morning dew will have lifelong beauty.\n\nFinland \n\nCelebrations among the younger generations take place on May Day Eve, see Walpurgis Night in Finland, most prominent being the afternoon \"crowning\" of statues in towns around the country with a student cap.\n\nMay Day is known as Vappu in Finnish. This is a public holiday that is the only carnival-style street festivity in the country. People young and old, particularly students, party outside, picnic and wear caps or other decorative clothing.\n\nMany Finns make a special mead from lemons, brown sugar, and yeast called \"sima\". It contains very little alcohol, so even children can drink it. A similar product can also be bought in all stores. Finns also make doughnuts and a crisp pastry fried in oil made from a similar, more liquid dough called  that resembles funnel cake.\n\nBalloons and other decorations like paper streamers are seen everywhere.\n\nEstonia \n\nMay Day or \"Spring Day\" (Kevadpüha) is a national holiday in Estonia celebrating the arrival of spring.\n\nMore traditional festivities take place throughout the night before and into the early hours of May 1, on the Walpurgis Night (Volbriöö).\n\nFrance \n\n \nOn May 1, 1561, King Charles IX of France received a lily of the valley as a lucky charm. He decided to offer a lily of the valley each year to the ladies of the court. At the beginning of the 20th century, it became custom to give a sprig of lily of the valley, a symbol of springtime, on May 1. The government permits individuals and workers' organisations to sell them tax-free on that single day. Nowadays, people may present loved ones either with bunches of lily of the valley or dog rose flowers.[http://www.timeanddate.com/holidays/france/labor-day May Day in France Timeanddate.com].\n\nGermany \n\nIn rural regions of Germany, especially the Harz Mountains, Walpurgisnacht celebrations of pagan origin are traditionally held on the night before May Day, including bonfires and the wrapping of a Maibaum (maypole). Young people use this opportunity to party, while the day itself is used by many families to get some fresh air. Motto: \"Tanz in den Mai\" (\"Dance into May\").\n\nIn the Rhineland, May 1 is also celebrated by the delivery of a maypole, a tree covered in streamers to the house of a girl the night before. The tree is typically from a love interest, though a tree wrapped only in white streamers is a sign of dislike. Women usually place roses or rice in the form of a heart at the house of their beloved one. It is common to stick the heart to a window or place it in front of the doormat. In leap years, it is the responsibility of the women to place the maypole. All the action is usually done secretly and it is an individual's choice whether to give a hint of their identity or stay anonymous.\n\nMay Day was not established as a public holiday until 1933. As Labour Day, many political parties and unions host activities related to work and employment.\n\nIreland \n\nMay Day has been celebrated in Ireland since pagan times as the feast of Beltane (Bealtaine) and in latter times as Mary's day. Traditionally, bonfires were lit to mark the coming of summer and to banish the long nights of winter. Officially Irish May Day holiday is the first Monday in May. Old traditions such as bonfires are no longer widely observed, though the practice still persists in some places across the country. Limerick, Clare and many other people in other counties still keep on this tradition, including areas in Dublin city such as Ringsend.\n\nItaly \n\nIn Italy it is called Calendimaggio or cantar maggio a seasonal feast held to celebrate the arrival of spring. The event takes its name from the period in which it takes place, that is, the beginning of May, from the Latin calenda maia. The Calendimaggio is a tradition still alive today in many regions of Italy as an allegory of the return to life and rebirth: among these Piedmont, Liguria, Lombardy, Emilia-Romagna (for example, is celebrated in the area of the Quattro Province or Piacenza, Pavia, Alessandria and Genoa), Tuscany and Umbria. This magical-propitiatory ritual is often performed during an almsgiving in which, in exchange for gifts (traditionally eggs, wine, food or sweets), the Maggi (or maggerini) sing auspicious verses to the inhabitants of the houses they visit. Throughout the Italian peninsula these Il Maggio couplets are very diverse—most are love songs with a strong romantic theme, that young people sang to celebrate the arrival of spring. Symbols of spring revival are the trees (alder, golden rain) and flowers (violets, roses), mentioned in the verses of the songs, and with which the maggerini adorn themselves. In particular the plant alder, which grows along the rivers, is considered the symbol of life and that's why it is often present in the ritual.\n\nCalendimaggio can be historically noted in Tuscany as a mythical character who had a predominant role and met many of the attributes of the god Belenus.  In Lucania, the Maggi have a clear auspicious character of pagan origin. In Syracuse, Sicily, the Albero della Cuccagna (cf. \"Greasy pole\") is held during the month of May,  a feast celebrated to commemorate the victory over the Athenians led by Nicias. However, Angelo de Gubernatis, in his work Mythology of Plants, believes that without doubt the festival was previous to that of said victory.\n\nIt is a celebration that dates back to ancient peoples, and is very integrated with the rhythms of nature, such as the Celts (celebrating Beltane), Etruscans and Ligures, in which the arrival of summer was of great importance.\n\nGreece \n\nMay 1st is a day that celebrates Spring.\n\nMaios (Latin Maius), the month of May, took its name from the goddess Maia (Gr ), a Greek and Roman goddess of fertility. The day of Maios (Modern Greek Πρωτομαγιά) celebrates the final victory of the summer against winter as the victory of life against death. The celebration is similar to an ancient ritual associated with another minor demi-god Adonis which also celebrated the revival of nature. There is today some conflation with yet another tradition, the revival or marriage of Dionysus (the Greek God of theatre and wine-making). This event, however, was celebrated in ancient times not in May but in association with the Anthesteria, a festival held in February and dedicated to the goddess of agriculture Demeter and her daughter Persephone. Persephone emerged every year at the end of Winter from the Underworld. The Anthesteria was a festival of souls, plants and flowers, and Persephone's coming to earth from Hades marked the rebirth of nature, a common theme in all these traditions.\n\nWhat remains of the customs today, echoes these traditions of antiquity. A common, until recently, May Day custom involved the annual revival of a youth called Adonis, or alternatively of Dionysus, or of Maios (in Modern Greek Μαγιόπουλο, the Son of Maia). In a simple theatrical ritual, the significance of which has long been forgotten, a chorus of young girls sang a song over a youth lying on the ground, representing Adonis, Dionysus or Maios. At the end of the song, the youth rose up and a flower wreath was placed on his head.\n\nThe most common aspect of modern May Day celebrations is the preparation of a flower wreath from wild flowers, although as a result of urbanisation there is an increasing trend to buy wreaths from flower shops. The flowers are placed on the wreath against a background of green leaves and the wreath is hung either on the entrance to the family house/apartment or on a balcony. It remains there until midsummer night. On that night, the flower wreaths are set alight in bonfires known as St John’s fires. Youths leap over the flames consuming the flower wreaths. This custom has also practically disappeared, like the theatrical revival of Adonis/Dionysus/Maios, as a result of rising urban traffic and with no alternative public grounds in most Greek city neighbourhoods, not to mention potential conflicts with demonstrating workers.\n\nBulgaria \n\nOn May Day, Bulgarians celebrate Irminden (or Yeremiya, Eremiya, Irima, Zamski den). The holiday is associated with snakes and lizards and rituals are made in order to protect people from them. The name of the holiday comes from the prophet Jeremiah, but its origins are most probably pagan.\n\nIt is said that on the days of the Holy Forty or Annunciation snakes come out of their burrows, and on Irminden their king comes out. Old people believe that those working in the fields on this day will be bitten by a snake in summer.\n\nIn western Bulgaria people light fires, jump over them and make noises to scare snakes. Another custom is to prepare \"podnici\" (special clay pots made for baking bread).\n\nThis day is especially observed by pregnant women so that their offspring do not catch \"yeremiya\" — an illness due to evil powers.\n\nRomania \n\nOn May Day, the Romanians celebrate the arminden (or armindeni), the beginning of summer, symbolically tied with the protection of crops and farm animals. The name comes from Slavonic Jeremiinŭ dĭnĭ, meaning prophet Jeremiah's day, but the celebration rites and habits of this day are apotropaic and pagan (possibly originating in the cult of the god Pan).\n\nThe day is also called ziua pelinului (\"mugwort day\") or ziua bețivilor (\"drunkards' day\") and it is celebrated to ensure good wine in autumn and, for people and farm animals alike, good health and protection from the elements of nature (storms, hail, illness, pests). People would have parties in natural surroundings, with lăutari (fiddlers) for those who could afford it. Then it is customary to roast and eat lamb, along with new mutton cheese, and to drink mugwort-flavoured wine, or just red wine, to refresh the blood and get protection from diseases. On the way back, the men wear lilac or mugwort flowers on their hats.\n\nOther apotropaic rites include, in some areas of the country, people washing their faces with the morning dew (for good health) and adorning the gates for good luck and abundance with green branches or with birch saplings (for the houses with maiden girls). The entries to the animals' shelters are also adorned with green branches. All branches are left in place until the wheat harvest when they are used in the fire which will bake the first bread from the new wheat.\n\nOn May Day eve, country women do not work in the field as well as in the house to avoid devastating storms and hail coming down on the village.\n\nArminden is also ziua boilor (oxen day) and thus the animals are not to be used for work, or else they could die or their owners could get ill.\n\nIt is said that the weather is always good on May Day to allow people to celebrate.\n\nPortugal \n\n\"Os Maios\" is celebrated throughout Portugal, with special focus on the northern territories. These festivities are a continuum of the \"Os Maios\" of Galiza. People put the yellow flowers of Portuguese brooms, known as giestas, on windows, doors, gates and every doorway of houses, granaries, cars, etc., which they collect on the evening of the 30th of April when the Portuguese brooms are blooming, to defend those places from bad spirits, witches and the evil eye. This must be done before midnight. In ancient times, this was done while playing traditional night-music. In some places, children were dressed in these flowers and went from place to place begging for money or bread. On the 1st of May, people also used to sing \"Cantigas de Maio\", traditional songs related to this day and the whole month of May.[https://books.google.co.uk/books?idc3I-AAAAYAAJ&pg\nRA1-PA138&lpgRA1-PA138&dq\ncantar+as+janeiras+e+as+maias&sourcebl&ots\nx7tH5pJAdE&sigjgZGPvh_GLWqa1yxC5Lxuc48If4&hl\nen&saX&ei\nwP2DUKrvJ4rD0QXX4oHwAw#vonepage&q\ncantar%20as%20janeiras%20e%20as%20maias&f=false]\n\nSpain \n\nMay Day is celebrated throughout the country as Los Mayos (lit. \"the Mays\")  often in a similar way to \"Fiesta de las Cruces\" in many parts of Hispanic America.  By way of example, in Galicia, the festival (os maios, in the local language) consists in different representations around a decorated tree or sculpture. People sing popular songs (also called maios,) making mentions to social and political events during the past year, sometimes under the form of a converse, while they walk around the sculpture with the percussion of two sticks. In Lugo and in the village of Vilagarcía de Arousa it was usual to ask a tip to the attendees, which used to be a handful of dry chestnuts (castañas maiolas), walnuts or hazelnuts. Today the tradition became a competition where the best sculptures and songs receive a prize.\n\nIn the Galician city of Ourense this day is celebrated traditionally on 3 May, the day of the Holy Cross, that in the Christian tradition replaced the tree \"where the health, life and resurrection are,\" according to the introit of that day's mass.\n\nSweden \n\nThe more traditional festivities have moved to the day before, Walpurgis Night (\"Valborgsmässoafton\"), known in some locales as simply \"Last of April\". The first of May is instead celebrated as International Workers' Day.\n\nPoland \n\nIn Poland, there is a state holiday on May 1. It is currently celebrated without a specific connotation, and as such it is May Day. However, due to historical connotations, most of the celebrations are focused around Labour Day festivities. It is customary for labour activists and left-wing political parties to organize parades in cities and towns across Poland on this day. The holiday is also commonly referred to as \"Labour Day\" (\"Święto Pracy\").\n\nIn Poland, May Day is closely followed by May 3rd Constitution Day. These two dates combined often result in a long weekend called \"Majówka\". People often travel, and \"Majówka\" is unofficially considered the start of the barbecuing season in Poland.  Between these two, on May 2, though formerly a working day, there is now a patriotic holiday, the Day of the Polish Flag (Dzień Flagi Rzeczypospolitej Polskiej), introduced by a Parliamentary Act of February 20, 2004.May Day has a public holiday too.\n\nNorth America \n\nCanada \n\nMay Day is celebrated in some parts of the provinces of British Columbia, New Brunswick and Ontario.\n\nToronto\n\nIn Toronto, on the morning of 1 May, various Morris Dancing troops from Toronto and Hamilton gather on the road by Grenadier Cafe, in High Park to \"dance in the May\". The dancers and crowd then gather together and sing traditional May Day songs such as Hal-An-Tow and Padstow.\n\nBritish Columbia\n\nCelebrations often take place not on 1 May but during the Victoria Day long weekend, later in the month and when the weather is likely to be better. The longest continually observed May Day in the British Commonwealth is held in the city of New Westminster, BC. There, the first May Day celebration was held on 4 May 1870.\n\nUnited States \n\nMay Day was also celebrated by some early European settlers of the American continent. In some parts of the United States, May baskets are made. These are small baskets usually filled with flowers or treats and left at someone's doorstep. The giver rings the bell and runs away.\n\nModern May Day ceremonies in the U.S. vary greatly from region to region and many unite both the holiday's \"Green Root\" (pagan) and \"Red Root\" (labour) traditions.Sheehy, Colleen J. (Ed., 1999). Theatre of Wonder: 25 Years in the Heart of the Beast. Minneapolis: University of Minnesota Press.. p. 79-89.\n\nMay Day celebrations were common at women's colleges and academic institutions in the late nineteenth and early twentieth century, a tradition that continues at Bryn Mawr College and Brenau University to this day.\n\nIn Minneapolis, the May Day Parade and Festival is presented annually by In the Heart of the Beast Puppet and Mask Theatre on the first Sunday in May, and draws around 50,000 people to Powderhorn Park.\n\nHawaii \n\nIn Hawaii, May Day is also known as Lei Day, and it is normally set aside as a day to celebrate island culture in general and the culture of the Native Hawaiians in particular.. Invented by poet and local newspaper columnist Don Blanding, the first Lei Day was celebrated on 1 May 1927 in Honolulu. Leonard \"Red\" and Ruth Hawk composed \"May Day Is Lei Day in Hawai'i,\" the traditional holiday song. May Day. http://en.wikipedia.org/?curid=19829."
  }
}
