{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14582",
  "eid" : "159e6ac0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778545516,
  "textBody" : "Iqaluit  (;;), meaning \"place of fish\", is the capital of the Canadian territory of Nunavut; its largest community, and its only city. It was known as Frobisher Bay until 1987, after the large bay on the coast of which the city is situated.  In 1999, Iqaluit became the capital of Nunavut after the division of the Northwest Territories into two separate territories.  Before this event, Iqaluit was a small city and not well-known outside the Canadian Arctic or Canada, with population and economic growth highly limited. This is due to the city's isolation and heavy dependence on expensively imported supplies as the city, like the rest of Nunavut, has no road, rail, or even ship connections for part of the year to the rest of Canada. The city also has a polar climate, influenced by the cold deep waters of the Labrador Current just off Baffin Island; this makes the city of Iqaluit cold, even though the city is well south of the Arctic Circle.\n\nAs of the 2016 census the population was 7,740 (Population Centre: 7,082), an increase of 15.5 percent from the 2011 census. Iqaluit has the lowest population of any capital city in Canada. Inhabitants of Iqaluit are called Iqalummiut (singular: Iqalummiuq).\n\nHistory \n\nIqaluit has been a traditional fishing location used by Inuit for thousands of years, hence the name Iqaluit, which means place of many fish.[http://www.city.iqaluit.nu.ca/visitors/explore-iqaluit/history About Iqaluit: History & Milestones ] In 1942 an American air base was built there, intended to provide a stop-over and refuelling site for short range aircraft being ferried to Europe to support the war effort. Iqaluit's first permanent resident was Nakasuk, an Inuk guide who helped American Air Force planners to choose a site with a large flat area suitable for a landing strip. The wartime airstrip was known as Crystal Two and was part of the Crimson Route. Long regarded as a campsite and fishing spot by the Inuit, the place chosen had been called Iqaluit – \"place of many fish\" in Inuktitut – but Canadian and American authorities named it Frobisher Bay, after the name of the body of water it abuts. For the history of the air base, see Frobisher Bay Air Base.\n\nThe Hudson's Bay Company moved its south Baffin operations to the neighbouring valley of Niaqunngut, officially called Apex, in 1949 to take advantage of the airfield. The population of Frobisher Bay increased rapidly during the construction of the Distant Early Warning Line (DEW line, a system of radar stations, see North American Aerospace Defense Command (NORAD)) in the mid-1950s. Hundreds of construction workers, military personnel, and administrative staff moved into the community, and several hundred Inuit followed to take advantage of the access to medical care and jobs the base provided. In 1957, 489 of the town's 1,200 residents were reported to be Inuit. After 1959, the Canadian government established permanent services at Frobisher Bay, including full-time doctors, a school and social services. The Inuit population grew rapidly in response, as the government encouraged Inuit to settle permanently in communities with government services.\n\nNaval Radio Station (NRS) Frobisher Bay, callsign CFI,  was established in July 1954 as a result of the closure of NRS Chimo, Quebec. Station CFI was part of the Supplementary Radio network. Because of its remoteness and size, it was very expensive to operate. Advancing technology eventually forced the closure of CFI in 1967.\n\nThe American military left Iqaluit in 1963, as intercontinental ballistic missiles (ICBM) diminished the strategic value of the DEW line and Arctic airbases, but Frobisher Bay remained the government's administrative and logistical centre for much of the eastern Arctic. In 1964, the first elections were held for a community council, and in 1979 for the first mayor. The founding of the Gordon Robertson Educational Centre, now Inuksuk High School, in the early 1970s at Iqaluit confirmed the government's commitment to the community as an administrative centre. At the time of its founding, it was the sole high school operating in more than one-seventh of Canadian territory.\n\nOn 1 January 1987, the name of the municipality was changed from \"Frobisher Bay\" to \"Iqaluit\" – aligning official usage with the name that the Inuit population had always used (although, many documents still referred to Iqaluit as Frobisher Bay for several years after 1987). In December 1995, Iqaluit was selected to serve as Nunavut's future capital in a territory-wide referendum, in which it was chosen over Rankin Inlet. On 19 April 2001, it was redesignated as a city.\n\nIqaluit was designated by Canada as the host city for the 2010 meeting of the G7 finance ministers, held on 5–6 February. The meeting strained the northern communications technology infrastructure.\n\nTimeline \n\n* 1576 – Englishman Martin Frobisher sails into Frobisher Bay believing he has found the route to China. First Anglican/Episcopalian church service in North America.\n* 1861 – Charles Francis Hall, an American, camps at the Sylvia Grinnell River and explores the waters of Koojesse Inlet, which he names after his Inuit guide\n* 1942 – U.S. Army Air Forces selects Iqaluit’s current location as the site of a major air base\n* 1949 – The HBC moves its trading post from Ward Inlet to Apex\n* 1955 – Frobisher Bay becomes the centre for U.S. Canada DEW Line construction operations\n* 1958 – Telephone exchange service established by Bell Canada\n* 1963 – US military move out of Iqaluit\n* 1964 – First community council formed; population of Frobisher Bay is 900\n* 1970 – Frobisher Bay officially recognized as a Settlement\n* 1974 – Settlement of Frobisher Bay gains village status\n* 1976 – Inuit present the Nunavut proposal to the Federal government\n* 1979 – First mayor elected\n* 1980 – Frobisher Bay designated as a town\n* 1982 – Government of Canada agrees in principle to the creation of Nunavut\n* 1987 – Frobisher Bay becomes Iqaluit, reverting to its original Inuktitut name meaning \"place of (many) fish\"\n* 1993 – The Nunavut Land Claims Agreement is signed in Iqaluit\n* 1995 – Nunavut residents select Iqaluit as capital of the new territory\n* 1 April 1999 – The Territory of Nunavut comes into being\n* 19 April 2001 – Iqaluit receives its order of status as a city\n* 2002 – Iqaluit, along with Nuuk, Greenland, co-host the first jointly hosted Arctic Winter Games; the Arctic Winter Games Arena was constructed in Iqaluit for the event.\n* 5 February 2010 – Iqaluit hosted the finance meeting as part of the 2010 G7 summit.\n\nGeography \n\nIqaluit is located in the Everett Mountains rising from Koojesse (Kuujussi) Inlet, an inlet of Frobisher Bay, on the southeast part of Baffin Island. It is well to the east of Nunavut's mainland, and northeast of Hudson Bay.\n\nNeighbourhoods\n\n* Downtown (central)\n* Happy Valley (north)\n* Lake Subdivision (north) – residential area\n* Lower Base (south)\n* Lower Iqaluit (southeast)\n* North 40 (northwest) – located on the north side of the airport\n* Plateau Subidivison (northwest) – residential area\n* Road To Nowhere (north) \n* Tundra Valley (west)\n* Tundra Ridge (west) – home to two of the city's schools and youth centre\n* West 40 (southwest) – commercial area\n\nSuburbs \n\nApex, officially and functionally part of the City of Iqaluit, is a small community about 5 km southeast () from Iqaluit's centre and is known in Inuktitut as Niaqunngut. It is located on a small peninsula separating Koojesse Inlet from Tarr Inlet. There is a women's shelter, a church, a primary school (Nanook Elementary School), a design shop and a bed-and-breakfast in the community.\n\nApex was where most Inuit lived when Iqaluit was a military site, and as such the suburb was off-limits to anyone not working at the base.\n\nClimate \n\nIqaluit has a tundra climate (Köppen: ET) typical of the Arctic region, although it is well outside the Arctic Circle. The city has cold winters and short summers that are too cool to permit the growth of trees. Although it is north of the tree line, there are still shrubs that are classed, locally, as trees. These include the Arctic willow (Salix arctica) which is hard to recognize as a tree because of its low height. The permafrost does not allow the taproot to get deeper than 6 in so this does not allow vertical growth. The Arctic willow may be up to around  horizontally, but only 6 in tall. Average monthly temperatures are below freezing for eight months of the year. Iqaluit averages just over 400 mm  of precipitation annually, much wetter than many other localities in the Canadian Arctic Archipelago, with the summer being the wettest season. Temperatures of the winter months are comparable to other northern communities further west on the continent such as Yellowknife and to some extent even Fairbanks, even though Iqaluit is a few degrees colder than the latter. Summer temperatures are, however, much colder due to its easterly maritime position affected by the waters of the cold Baffin Island Current. This means that the tree line is much further south in the eastern part of Canada, being as southbound, in spite of low elevation, as northern Labrador.\n\nThe highest temperature ever recorded in Iqaluit was  on 21 July 2008. The lowest temperature ever recorded was  on 10 February 1967.\n\nDemographics \n\nThe 2016 census reported that there were 7,740, people living in Iqaluit, a 15.5% increase from 2011 census. The land area of the city is , therefore a population density of . Iqaluit has 3,419 private dwellings, 2,749 of which are occupied by usual residents. The median value of these dwellings is $376,639, quite a bit higher than the national median at $280,552. The average household has about 2.8 people living in it, and the average family has 1.4 children living at home with them. The median (after-tax) household income in Iqaluit is quite high, $98,921, almost double the national rate at $54,089. The median income for an individual in the city, is also high, $60,688. 5.9% of people (over 15 years old) are either divorced or separated, which is quite a bit lower than the national rate at 8.6%. Also, 53.3% of the population is either married or living with a common law partner.\n\nIqaluit has quite a young population, the median age of the population is more than 10 years younger than the national rate, 30.1 years old compared to 40.6 years old.\n\nIqaluit has the most Inuit people in both numbers (3,900) and percentages (59.1%), of all Canadian cities with populations greater than 5,000. The racial make up is:\n\nThere is no \"majority mother tongue\" in Iqaluit, as 45.4% reported their mother tongue as being English, and 45.4% also reported their mother tongue as Inuktitut. However 97.2% of Iqalummiuts can speak English, whereas only 53.1% can speak Inuktitut. French was the mother tongue of 4.8% of the population, which is the same figure of the population who can speak the language. As of 2012, \"Pirurvik, Iqaluit’s Inuktitut language training centre, has a new goal: to train instructors from Nunavut communities to teach Inuktitut in different ways and in their own dialects when they return home.\"\n\n74.9% of the population practise some form of Christianity (Anglican is the most popular at 42.6%), and 22.9% of the population identify as having no religious affiliation. There are other religions practised in the city, just not in large numbers.\n\nFor those over the age of 25:\n* 75.7% are high school educated (15.9% as their highest level of education)\n* 59.8% are post-secondary school educated\n* 24.3% have no certificate, diploma or degree\n\nNotable people \n\n* Eva Aariak, politician, former MLA and second Premier of Nunavut\n* Paul-André Brasseur, child actor\n* Ann Meekitjuk Hanson, former Commissioner of Nunavut\n* Kenn Harper, grocer, amateur historian, and entrepreneur\n* Lucie Idlout, rock singer, songwriter\n* Matty McNair, US-born explorer\n*Mosha Michael, filmmaker[http://www.cbc.ca/news/canada/toronto/inuk-filmmaker-mourned-1.860081 \"Inuk filmmaker mourned\"]. CBC News, November 20, 2009. \n* Simonie Michael, first Inuk to be elected to what is now the Legislative Assembly of the Northwest Territories in 1966[https://books.google.com/books?id\nbKOxw3HB51YC&pgPA116&lpg\nPA116&dq=Simonie+Michael The road to Nunavut: the progress of the eastern Arctic Inuit since the Second World War] by Ronald Quinn Duffy\n* Nakasuk, founder of Iqaluit\n* Paul Okalik, lawyer, politician, member of the Legislative Assembly of Nunavut, first Premier of Nunavut and former Speaker of the Legislative Assembly of Nunavut. Unsuccessful federal Liberal candidate for Nunavut\n\n* Abe Okpik, politician, worked on Project Surname to obtain family names for Inuit rather than disc numbers and first Inuk to sit (appointed) on what is now the NWT Legislative Assembly\n* Dennis Patterson, politician, former MLA and Premier of the NWT (prior to division), current Canadian Senator for Nunavut\n* Aqpik Peter, Nunavut speed skater, contestant in 2010 Winter Olympics\n* Ed Picco, politician, former MLA in NWT and Nunavut\n* Annabella Piugattuk, actress\n* Elisapee Sheutiapik, ex-politician & mayor\n* Hunter Tootoo, territorial and federal politician, and former speaker of the Nunavut Legislative Assembly\n* Sheila Watt-Cloutier, politician, environmental activist, Nobel nominee\n\nTransportation \n\nIqaluit is the smallest Canadian capital in terms of population, and the only capital that is not connected to other settlements by a highway. Located on an island remote from the Canadian highway system, Iqaluit is generally only accessible by aircraft and, subject to ice conditions, by boat.\n\nIqaluit Airport is a modern facility with a runway long enough for most modern jet aircraft. Plans are underway to build a new, larger passenger terminal building north of the current terminal, which would also include a larger apron adjacent to the new terminal.\n\nCanadian North and First Air serve Iqaluit from Ottawa, Yellowknife and several communities in Nunavut. Locally based airlines Air Nunavut, Canadian Helicopters, Nunasi Helicopters and Unaalik Aviation provide air charters, and Air Nunavut and Kivalliq Air provide MEDIVAC/air ambulance service. Air Canada Jazz provided daily service to Iqaluit from Ottawa in 2010 and 2011, but cancelled service due to rising fuel costs, which prevented the route from being profitable.\n\nIqaluit shared its runway with the Royal Canadian Air Force until the Canadian Forces stopped using Iqaluit as a Forward Operating Location (FOL). The barracks and CF-18 hangars are maintained. The airport was a centre for cold-weather testing of new aircraft, such as the Airbus A380 in February 2006.\n\nRumours that Iqaluit was an emergency landing site for the Space Shuttle are false.\n\nIn the middle of summer, a few ships—generally no larger than a Liberty-class vessel—transport bulk and heavy goods to the city. Cargo is off-loaded onto barges as the harbour is not deep enough. The city is planning a deepwater port.[http://www.city.iqaluit.nu.ca/i18n/english/pdf/portproject.pdf Strategic Plan for the Iqaluit Deepwater Port Project] , retrieved from the City of Iqaluit web site, October 2008 Experienced locals also cross the Hudson Strait from the Canadian mainland when it freezes over, either on foot or by dog sled or snowmobile, a distance of over 100 km.\n\nIqaluit has a local road system only stretching from the nearby community of Apex to the Sylvia Grinnell Territorial Park, 1 km west of town. Iqaluit has no public transportation, although there is citywide taxi service. (There used to be bus service in the city, but the service was cancelled due to low ridership.) Motor cars are increasing in number, to the extent of causing occasional traffic jams known locally as \"the rush minute\". However, the cost of shipping automobiles and the wear-and-tear of the harsh Arctic climate combined with its notoriously rough roadways mean that snowmobiles remain the preferred form of personal transportation. All-terrain vehicles are also increasingly common in most of the Canadian Arctic. Snowmobiles are used to travel within the city and in the surrounding area. In winter, dog sleds are still used, but primarily for recreation. In winter, the nearby Qaummaarviit Territorial Historic Park and the more remote Katannilik Territorial Park Reserve are only accessible by snowmobile, dog sled or foot. In the summer, both are accessible by boat.\n\nResidents and businesses identify their locations mostly by building number, and occasionally by the name of a prominent structure. Residents know where in the city certain series of building numbers are located; numbers tend to be aggregated in blocks, so someone might say that they live in the 2600s. Around 2003, street names were developed, although there were delays in finalizing them and posting the signs. Street numbers have not been assigned, and building numbers continue to be used. Iqaluit is the only Canadian capital city not to have traffic signals.[http://www.city.iqaluit.nu.ca/i18n/english/pdf/iqaluit_visitors2009]\n\nRoads\n\nMost major roads in Iqaluit are paved with asphalt, but local and smaller roads are gravel. Roads do not have traffic signals, but use stop signs to control intersections.\n\nEducation\n\nThe Qikiqtani School Operations based in Pond Inlet operates five schools in the area. Nanook Elementary School, located in Apex, Nakasuk School and Joamie Ilinniarvik School offer Kindergarten to grade 5. Aqsarniit Ilinniarvik School offers grades 6 to 8 and Inuksuk High School offers grades 9 to 12.[http://www.gov.nu.ca/sites/default/files/nunavut_school_contact_list_24-sept-2015.pdf Nunavut Schools Contact List] \n \nThe Commission scolaire francophone du Nunavut runs École des Trois-Soleils and offers kindergarten to grade 8.[http://www.nunatsiaqonline.ca/stories/article/98789_iqaluits_french-language_school_spreads_its_wings/ Iqaluit’s French-language school spreads its wings]\n\nAt the post-secondary level there are two, Nunavut Arctic College (Nunatta Campus) and Akitsiraq Law School.\n\nInfrastructure\n\nWaste and water treatment\n\nThe city's infrastructure is stressed by growth and lack of means to upgrade. Waste from the city is disposed off into an open air dump on Akilliq Drive (West 40) located south of the city.\n\nWhile the city has water treatment facilities, raw sewage from the city is often dumped untreated into nearby Frobisher Bay.\n\nAs the dump has reached capacity, the city is planning to open a second dump 9 km north of the city. Iqaluit does not have a recycling program in place with all recyclable materials sent into the waste stream.\n\nEmergency services\n\nEmergency services (fire and ambulance) are provided by city from a single station on Niaqunngusiariaq.\n\nThe emergency services fleet consists of:\n* Engine 1: Spartan Diamond/Smeal pumper\n* Ladder 1: Spartan Metro Star/Smeal 75' aerial\n* Command 1: Ford SUV\n* Command 2: Ford F250 4×4 pickup\n* Medic 1 and 2: Ford F450 Type II ambulances\n\nIqaluit Airport Emergency Services is responsible for fire services at the airport. Following a fire at the airport in 1998, the Government of Nunavut re-opened the fire station at the airport. Their fleet consists of:\n\n* Waltek C-5500 ARFF\n* Oshkosh T3000 ARFF\n\nPolicing in Iqaluit, as with the rest of Nunavut is contracted to the Royal Canadian Mounted Police (RCMP) V Division.[http://www.rcmp.gc.ca/nu/about-ausujet-eng.htm About the RCMP in Nunavut]\n\nMedical services\n\nQikiqtani General Hospital is the primary care facility in the city. There is also a Family Practice Clinic providing primary care services by Nurse Practitioners. There are two dental clinics in the city.\n\nArchitecture and attractions \n\nMuch of Iqaluit's architecture is functional – designed to minimize material costs, while retaining heat and withstanding the climate. Early architecture runs from the 1950s military barracks of the original DEW line installation, through the 1970s white hyper-modernist fibreglass block of the Nakasuk School and Municipal Offices and Arena, to the lines of the steel-reinforced concrete high-rise complex on the hill above it. A number of older Hudson's Bay Company and early 1950s buildings have been retained and restored in Apex (the former nursing station has been revived as the Rannva Bed and Breakfast, the HBC buildings as an art gallery). The newer buildings are more colourful and diverse, and closer to the norms of southern architecture.\n\nThe principal exception is the Nunavut Legislative Assembly Building, which is remarkable for its colourful interior, adorned with some of the very best in Inuit art. A new legislative building is in planning to be developed and built outside the city on the Apex Road.\n\nAnother distinctive building was St. Jude's Anglican Cathedral, see of the Anglican Diocese of The Arctic, which was a white building shaped like an igloo. The altar was built by the parishioners, under the guidance of Markoosie Peter, a traditional master carpenter. It was shaped like a traditional Inuit sled, and the cross composed of two crossed narwhal tusks. An incident of arson severely affected the Cathedral structure and interior on 5 November 2005, and it was demolished on 1 June 2006. The cathedral is slowly being rebuilt (foundation 2008 superstructure 2010) and fund-raising continues locally and internationally. In December 2010, the exterior of a similarly shaped replacement cathedral was completed, and interior work was planned for 2011 with a potential opening for Christmas 2011. The current building, informally referred to as the Igloo Cathedral, was opened on June 3, 2012. The unique building, in the shape of an igloo, has traditionally been a landmark and tourist attraction in Iqaluit, besides its important spiritual role for Iqalummiut (people of Iqaluit). On a ridge overlooking the city is the distinctive blue and white Inuksuk High School. The school is made up of four square sections joined together that give a clover leaf shape when viewed from the air.\n\nThe city is also the location of the Nunatta Sunakkutaangit Museum, which houses a large collection of Inuit and Arctic objects. The museum is housed in a restored and extended Hudson's Bay Company building, clad in the HBC signature red and white, transported to Iqaluit from its original site on the Apex Beach.\n\nJust west of Iqaluit is the Sylvia Grinnell Territorial Park Reserve. This park is dominated by the valley of the Sylvia Grinnell River. A small visitor's centre with viewing platform is located on top of a hill overlooking scenic waterfalls, tidal flats and traditional fishing sites.\n\nNearby on an island near Peterhead Inlet, is the Qaummaarviit Territorial Historic Park. It is a site with a long Inuit history and numerous artifacts have been recovered, including the remains of 11 semi-buried sod houses.\n\nA little farther, across Frobisher Bay, are the Katannilik Territorial Park Reserve and the Soper Heritage River Park forming a park corridor linking Iqaluit along traditional overland travel routes with Kimmirut (formerly Lake Harbour). Frobisher Bay extends for almost 70 mi to the east, with moderate hills, glaciers and traditional and summer camp sites, opening into the Davis Straits which divide Nunavut from Greenland.\n\nIqaluit, like many Nunavut communities has a volunteer-run annual spring festival. Called Toonik Tyme it involves a combination of traditional Inuit activities combined with more modern events, while the Alianait Music and Arts Festival is held for a week each June 21.\n\nMedia \n\nRadio\n\nTelevision\n\nIqaluit was served by CFFB-TV channel 8, a CBC Television/CBC North repeater of CFYK-DT (Yellowknife) until July 31, 2012 when it was closed because of budget cuts at the CBC.[http://cbc.radio-canada.ca/en/media-centre/2012/04/04/ Speaking notes for Hubert T. Lacroix regarding measures announced in the context of the Deficit Reduction Action Plan][http://www.crtc.gc.ca/eng/archive/2012/2012-384.htm Broadcasting Decision CRTC 2012-384, July 17, 2012.]\n\nCommunications\n* Meshnet Community WiFi—free community WiFi and paid service available in most areas of city. Free services include access to Isuma.tv, and many other resources.\n\nPress\n* Nunatsiaq News\n* News/North",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Iqaluit" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14582" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Iqaluit  (;;), meaning \"place of fish\", is the capital of the Canadian territory of Nunavut; its largest community, and its only city. It was known as Frobisher Bay until 1987, after the large bay on the coast of which the city is situated.  In 1999, Iqaluit became the capital of Nunavut after the division of the Northwest Territories into two separate territories.  Before this event, Iqaluit was a small city and not well-known outside the Canadian Arctic or Canada, with population and economic growth highly limited. This is due to the city's isolation and heavy dependence on expensively imported supplies as the city, like the rest of Nunavut, has no road, rail, or even ship connections for part of the year to the rest of Canada. The city also has a polar climate, influenced by the cold deep waters of the Labrador Current just off Baffin Island; this makes the city of Iqaluit cold, even though the city is well south of the Arctic Circle.\n\nAs of the 2016 census the population was 7,740 (Population Centre: 7,082), an increase of 15.5 percent from the 2011 census. Iqaluit has the lowest population of any capital city in Canada. Inhabitants of Iqaluit are called Iqalummiut (singular: Iqalummiuq).\n\nHistory \n\nIqaluit has been a traditional fishing location used by Inuit for thousands of years, hence the name Iqaluit, which means place of many fish.[http://www.city.iqaluit.nu.ca/visitors/explore-iqaluit/history About Iqaluit: History & Milestones ] In 1942 an American air base was built there, intended to provide a stop-over and refuelling site for short range aircraft being ferried to Europe to support the war effort. Iqaluit's first permanent resident was Nakasuk, an Inuk guide who helped American Air Force planners to choose a site with a large flat area suitable for a landing strip. The wartime airstrip was known as Crystal Two and was part of the Crimson Route. Long regarded as a campsite and fishing spot by the Inuit, the place chosen had been called Iqaluit – \"place of many fish\" in Inuktitut – but Canadian and American authorities named it Frobisher Bay, after the name of the body of water it abuts. For the history of the air base, see Frobisher Bay Air Base.\n\nThe Hudson's Bay Company moved its south Baffin operations to the neighbouring valley of Niaqunngut, officially called Apex, in 1949 to take advantage of the airfield. The population of Frobisher Bay increased rapidly during the construction of the Distant Early Warning Line (DEW line, a system of radar stations, see North American Aerospace Defense Command (NORAD)) in the mid-1950s. Hundreds of construction workers, military personnel, and administrative staff moved into the community, and several hundred Inuit followed to take advantage of the access to medical care and jobs the base provided. In 1957, 489 of the town's 1,200 residents were reported to be Inuit. After 1959, the Canadian government established permanent services at Frobisher Bay, including full-time doctors, a school and social services. The Inuit population grew rapidly in response, as the government encouraged Inuit to settle permanently in communities with government services.\n\nNaval Radio Station (NRS) Frobisher Bay, callsign CFI,  was established in July 1954 as a result of the closure of NRS Chimo, Quebec. Station CFI was part of the Supplementary Radio network. Because of its remoteness and size, it was very expensive to operate. Advancing technology eventually forced the closure of CFI in 1967.\n\nThe American military left Iqaluit in 1963, as intercontinental ballistic missiles (ICBM) diminished the strategic value of the DEW line and Arctic airbases, but Frobisher Bay remained the government's administrative and logistical centre for much of the eastern Arctic. In 1964, the first elections were held for a community council, and in 1979 for the first mayor. The founding of the Gordon Robertson Educational Centre, now Inuksuk High School, in the early 1970s at Iqaluit confirmed the government's commitment to the community as an administrative centre. At the time of its founding, it was the sole high school operating in more than one-seventh of Canadian territory.\n\nOn 1 January 1987, the name of the municipality was changed from \"Frobisher Bay\" to \"Iqaluit\" – aligning official usage with the name that the Inuit population had always used (although, many documents still referred to Iqaluit as Frobisher Bay for several years after 1987). In December 1995, Iqaluit was selected to serve as Nunavut's future capital in a territory-wide referendum, in which it was chosen over Rankin Inlet. On 19 April 2001, it was redesignated as a city.\n\nIqaluit was designated by Canada as the host city for the 2010 meeting of the G7 finance ministers, held on 5–6 February. The meeting strained the northern communications technology infrastructure.\n\nTimeline \n\n* 1576 – Englishman Martin Frobisher sails into Frobisher Bay believing he has found the route to China. First Anglican/Episcopalian church service in North America.\n* 1861 – Charles Francis Hall, an American, camps at the Sylvia Grinnell River and explores the waters of Koojesse Inlet, which he names after his Inuit guide\n* 1942 – U.S. Army Air Forces selects Iqaluit’s current location as the site of a major air base\n* 1949 – The HBC moves its trading post from Ward Inlet to Apex\n* 1955 – Frobisher Bay becomes the centre for U.S. Canada DEW Line construction operations\n* 1958 – Telephone exchange service established by Bell Canada\n* 1963 – US military move out of Iqaluit\n* 1964 – First community council formed; population of Frobisher Bay is 900\n* 1970 – Frobisher Bay officially recognized as a Settlement\n* 1974 – Settlement of Frobisher Bay gains village status\n* 1976 – Inuit present the Nunavut proposal to the Federal government\n* 1979 – First mayor elected\n* 1980 – Frobisher Bay designated as a town\n* 1982 – Government of Canada agrees in principle to the creation of Nunavut\n* 1987 – Frobisher Bay becomes Iqaluit, reverting to its original Inuktitut name meaning \"place of (many) fish\"\n* 1993 – The Nunavut Land Claims Agreement is signed in Iqaluit\n* 1995 – Nunavut residents select Iqaluit as capital of the new territory\n* 1 April 1999 – The Territory of Nunavut comes into being\n* 19 April 2001 – Iqaluit receives its order of status as a city\n* 2002 – Iqaluit, along with Nuuk, Greenland, co-host the first jointly hosted Arctic Winter Games; the Arctic Winter Games Arena was constructed in Iqaluit for the event.\n* 5 February 2010 – Iqaluit hosted the finance meeting as part of the 2010 G7 summit.\n\nGeography \n\nIqaluit is located in the Everett Mountains rising from Koojesse (Kuujussi) Inlet, an inlet of Frobisher Bay, on the southeast part of Baffin Island. It is well to the east of Nunavut's mainland, and northeast of Hudson Bay.\n\nNeighbourhoods\n\n* Downtown (central)\n* Happy Valley (north)\n* Lake Subdivision (north) – residential area\n* Lower Base (south)\n* Lower Iqaluit (southeast)\n* North 40 (northwest) – located on the north side of the airport\n* Plateau Subidivison (northwest) – residential area\n* Road To Nowhere (north) \n* Tundra Valley (west)\n* Tundra Ridge (west) – home to two of the city's schools and youth centre\n* West 40 (southwest) – commercial area\n\nSuburbs \n\nApex, officially and functionally part of the City of Iqaluit, is a small community about 5 km southeast () from Iqaluit's centre and is known in Inuktitut as Niaqunngut. It is located on a small peninsula separating Koojesse Inlet from Tarr Inlet. There is a women's shelter, a church, a primary school (Nanook Elementary School), a design shop and a bed-and-breakfast in the community.\n\nApex was where most Inuit lived when Iqaluit was a military site, and as such the suburb was off-limits to anyone not working at the base.\n\nClimate \n\nIqaluit has a tundra climate (Köppen: ET) typical of the Arctic region, although it is well outside the Arctic Circle. The city has cold winters and short summers that are too cool to permit the growth of trees. Although it is north of the tree line, there are still shrubs that are classed, locally, as trees. These include the Arctic willow (Salix arctica) which is hard to recognize as a tree because of its low height. The permafrost does not allow the taproot to get deeper than 6 in so this does not allow vertical growth. The Arctic willow may be up to around  horizontally, but only 6 in tall. Average monthly temperatures are below freezing for eight months of the year. Iqaluit averages just over 400 mm  of precipitation annually, much wetter than many other localities in the Canadian Arctic Archipelago, with the summer being the wettest season. Temperatures of the winter months are comparable to other northern communities further west on the continent such as Yellowknife and to some extent even Fairbanks, even though Iqaluit is a few degrees colder than the latter. Summer temperatures are, however, much colder due to its easterly maritime position affected by the waters of the cold Baffin Island Current. This means that the tree line is much further south in the eastern part of Canada, being as southbound, in spite of low elevation, as northern Labrador.\n\nThe highest temperature ever recorded in Iqaluit was  on 21 July 2008. The lowest temperature ever recorded was  on 10 February 1967.\n\nDemographics \n\nThe 2016 census reported that there were 7,740, people living in Iqaluit, a 15.5% increase from 2011 census. The land area of the city is , therefore a population density of . Iqaluit has 3,419 private dwellings, 2,749 of which are occupied by usual residents. The median value of these dwellings is $376,639, quite a bit higher than the national median at $280,552. The average household has about 2.8 people living in it, and the average family has 1.4 children living at home with them. The median (after-tax) household income in Iqaluit is quite high, $98,921, almost double the national rate at $54,089. The median income for an individual in the city, is also high, $60,688. 5.9% of people (over 15 years old) are either divorced or separated, which is quite a bit lower than the national rate at 8.6%. Also, 53.3% of the population is either married or living with a common law partner.\n\nIqaluit has quite a young population, the median age of the population is more than 10 years younger than the national rate, 30.1 years old compared to 40.6 years old.\n\nIqaluit has the most Inuit people in both numbers (3,900) and percentages (59.1%), of all Canadian cities with populations greater than 5,000. The racial make up is:\n\nThere is no \"majority mother tongue\" in Iqaluit, as 45.4% reported their mother tongue as being English, and 45.4% also reported their mother tongue as Inuktitut. However 97.2% of Iqalummiuts can speak English, whereas only 53.1% can speak Inuktitut. French was the mother tongue of 4.8% of the population, which is the same figure of the population who can speak the language. As of 2012, \"Pirurvik, Iqaluit’s Inuktitut language training centre, has a new goal: to train instructors from Nunavut communities to teach Inuktitut in different ways and in their own dialects when they return home.\"\n\n74.9% of the population practise some form of Christianity (Anglican is the most popular at 42.6%), and 22.9% of the population identify as having no religious affiliation. There are other religions practised in the city, just not in large numbers.\n\nFor those over the age of 25:\n* 75.7% are high school educated (15.9% as their highest level of education)\n* 59.8% are post-secondary school educated\n* 24.3% have no certificate, diploma or degree\n\nNotable people \n\n* Eva Aariak, politician, former MLA and second Premier of Nunavut\n* Paul-André Brasseur, child actor\n* Ann Meekitjuk Hanson, former Commissioner of Nunavut\n* Kenn Harper, grocer, amateur historian, and entrepreneur\n* Lucie Idlout, rock singer, songwriter\n* Matty McNair, US-born explorer\n*Mosha Michael, filmmaker[http://www.cbc.ca/news/canada/toronto/inuk-filmmaker-mourned-1.860081 \"Inuk filmmaker mourned\"]. CBC News, November 20, 2009. \n* Simonie Michael, first Inuk to be elected to what is now the Legislative Assembly of the Northwest Territories in 1966[https://books.google.com/books?id\nbKOxw3HB51YC&pgPA116&lpg\nPA116&dq=Simonie+Michael The road to Nunavut: the progress of the eastern Arctic Inuit since the Second World War] by Ronald Quinn Duffy\n* Nakasuk, founder of Iqaluit\n* Paul Okalik, lawyer, politician, member of the Legislative Assembly of Nunavut, first Premier of Nunavut and former Speaker of the Legislative Assembly of Nunavut. Unsuccessful federal Liberal candidate for Nunavut\n\n* Abe Okpik, politician, worked on Project Surname to obtain family names for Inuit rather than disc numbers and first Inuk to sit (appointed) on what is now the NWT Legislative Assembly\n* Dennis Patterson, politician, former MLA and Premier of the NWT (prior to division), current Canadian Senator for Nunavut\n* Aqpik Peter, Nunavut speed skater, contestant in 2010 Winter Olympics\n* Ed Picco, politician, former MLA in NWT and Nunavut\n* Annabella Piugattuk, actress\n* Elisapee Sheutiapik, ex-politician & mayor\n* Hunter Tootoo, territorial and federal politician, and former speaker of the Nunavut Legislative Assembly\n* Sheila Watt-Cloutier, politician, environmental activist, Nobel nominee\n\nTransportation \n\nIqaluit is the smallest Canadian capital in terms of population, and the only capital that is not connected to other settlements by a highway. Located on an island remote from the Canadian highway system, Iqaluit is generally only accessible by aircraft and, subject to ice conditions, by boat.\n\nIqaluit Airport is a modern facility with a runway long enough for most modern jet aircraft. Plans are underway to build a new, larger passenger terminal building north of the current terminal, which would also include a larger apron adjacent to the new terminal.\n\nCanadian North and First Air serve Iqaluit from Ottawa, Yellowknife and several communities in Nunavut. Locally based airlines Air Nunavut, Canadian Helicopters, Nunasi Helicopters and Unaalik Aviation provide air charters, and Air Nunavut and Kivalliq Air provide MEDIVAC/air ambulance service. Air Canada Jazz provided daily service to Iqaluit from Ottawa in 2010 and 2011, but cancelled service due to rising fuel costs, which prevented the route from being profitable.\n\nIqaluit shared its runway with the Royal Canadian Air Force until the Canadian Forces stopped using Iqaluit as a Forward Operating Location (FOL). The barracks and CF-18 hangars are maintained. The airport was a centre for cold-weather testing of new aircraft, such as the Airbus A380 in February 2006.\n\nRumours that Iqaluit was an emergency landing site for the Space Shuttle are false.\n\nIn the middle of summer, a few ships—generally no larger than a Liberty-class vessel—transport bulk and heavy goods to the city. Cargo is off-loaded onto barges as the harbour is not deep enough. The city is planning a deepwater port.[http://www.city.iqaluit.nu.ca/i18n/english/pdf/portproject.pdf Strategic Plan for the Iqaluit Deepwater Port Project] , retrieved from the City of Iqaluit web site, October 2008 Experienced locals also cross the Hudson Strait from the Canadian mainland when it freezes over, either on foot or by dog sled or snowmobile, a distance of over 100 km.\n\nIqaluit has a local road system only stretching from the nearby community of Apex to the Sylvia Grinnell Territorial Park, 1 km west of town. Iqaluit has no public transportation, although there is citywide taxi service. (There used to be bus service in the city, but the service was cancelled due to low ridership.) Motor cars are increasing in number, to the extent of causing occasional traffic jams known locally as \"the rush minute\". However, the cost of shipping automobiles and the wear-and-tear of the harsh Arctic climate combined with its notoriously rough roadways mean that snowmobiles remain the preferred form of personal transportation. All-terrain vehicles are also increasingly common in most of the Canadian Arctic. Snowmobiles are used to travel within the city and in the surrounding area. In winter, dog sleds are still used, but primarily for recreation. In winter, the nearby Qaummaarviit Territorial Historic Park and the more remote Katannilik Territorial Park Reserve are only accessible by snowmobile, dog sled or foot. In the summer, both are accessible by boat.\n\nResidents and businesses identify their locations mostly by building number, and occasionally by the name of a prominent structure. Residents know where in the city certain series of building numbers are located; numbers tend to be aggregated in blocks, so someone might say that they live in the 2600s. Around 2003, street names were developed, although there were delays in finalizing them and posting the signs. Street numbers have not been assigned, and building numbers continue to be used. Iqaluit is the only Canadian capital city not to have traffic signals.[http://www.city.iqaluit.nu.ca/i18n/english/pdf/iqaluit_visitors2009]\n\nRoads\n\nMost major roads in Iqaluit are paved with asphalt, but local and smaller roads are gravel. Roads do not have traffic signals, but use stop signs to control intersections.\n\nEducation\n\nThe Qikiqtani School Operations based in Pond Inlet operates five schools in the area. Nanook Elementary School, located in Apex, Nakasuk School and Joamie Ilinniarvik School offer Kindergarten to grade 5. Aqsarniit Ilinniarvik School offers grades 6 to 8 and Inuksuk High School offers grades 9 to 12.[http://www.gov.nu.ca/sites/default/files/nunavut_school_contact_list_24-sept-2015.pdf Nunavut Schools Contact List] \n \nThe Commission scolaire francophone du Nunavut runs École des Trois-Soleils and offers kindergarten to grade 8.[http://www.nunatsiaqonline.ca/stories/article/98789_iqaluits_french-language_school_spreads_its_wings/ Iqaluit’s French-language school spreads its wings]\n\nAt the post-secondary level there are two, Nunavut Arctic College (Nunatta Campus) and Akitsiraq Law School.\n\nInfrastructure\n\nWaste and water treatment\n\nThe city's infrastructure is stressed by growth and lack of means to upgrade. Waste from the city is disposed off into an open air dump on Akilliq Drive (West 40) located south of the city.\n\nWhile the city has water treatment facilities, raw sewage from the city is often dumped untreated into nearby Frobisher Bay.\n\nAs the dump has reached capacity, the city is planning to open a second dump 9 km north of the city. Iqaluit does not have a recycling program in place with all recyclable materials sent into the waste stream.\n\nEmergency services\n\nEmergency services (fire and ambulance) are provided by city from a single station on Niaqunngusiariaq.\n\nThe emergency services fleet consists of:\n* Engine 1: Spartan Diamond/Smeal pumper\n* Ladder 1: Spartan Metro Star/Smeal 75' aerial\n* Command 1: Ford SUV\n* Command 2: Ford F250 4×4 pickup\n* Medic 1 and 2: Ford F450 Type II ambulances\n\nIqaluit Airport Emergency Services is responsible for fire services at the airport. Following a fire at the airport in 1998, the Government of Nunavut re-opened the fire station at the airport. Their fleet consists of:\n\n* Waltek C-5500 ARFF\n* Oshkosh T3000 ARFF\n\nPolicing in Iqaluit, as with the rest of Nunavut is contracted to the Royal Canadian Mounted Police (RCMP) V Division.[http://www.rcmp.gc.ca/nu/about-ausujet-eng.htm About the RCMP in Nunavut]\n\nMedical services\n\nQikiqtani General Hospital is the primary care facility in the city. There is also a Family Practice Clinic providing primary care services by Nurse Practitioners. There are two dental clinics in the city.\n\nArchitecture and attractions \n\nMuch of Iqaluit's architecture is functional – designed to minimize material costs, while retaining heat and withstanding the climate. Early architecture runs from the 1950s military barracks of the original DEW line installation, through the 1970s white hyper-modernist fibreglass block of the Nakasuk School and Municipal Offices and Arena, to the lines of the steel-reinforced concrete high-rise complex on the hill above it. A number of older Hudson's Bay Company and early 1950s buildings have been retained and restored in Apex (the former nursing station has been revived as the Rannva Bed and Breakfast, the HBC buildings as an art gallery). The newer buildings are more colourful and diverse, and closer to the norms of southern architecture.\n\nThe principal exception is the Nunavut Legislative Assembly Building, which is remarkable for its colourful interior, adorned with some of the very best in Inuit art. A new legislative building is in planning to be developed and built outside the city on the Apex Road.\n\nAnother distinctive building was St. Jude's Anglican Cathedral, see of the Anglican Diocese of The Arctic, which was a white building shaped like an igloo. The altar was built by the parishioners, under the guidance of Markoosie Peter, a traditional master carpenter. It was shaped like a traditional Inuit sled, and the cross composed of two crossed narwhal tusks. An incident of arson severely affected the Cathedral structure and interior on 5 November 2005, and it was demolished on 1 June 2006. The cathedral is slowly being rebuilt (foundation 2008 superstructure 2010) and fund-raising continues locally and internationally. In December 2010, the exterior of a similarly shaped replacement cathedral was completed, and interior work was planned for 2011 with a potential opening for Christmas 2011. The current building, informally referred to as the Igloo Cathedral, was opened on June 3, 2012. The unique building, in the shape of an igloo, has traditionally been a landmark and tourist attraction in Iqaluit, besides its important spiritual role for Iqalummiut (people of Iqaluit). On a ridge overlooking the city is the distinctive blue and white Inuksuk High School. The school is made up of four square sections joined together that give a clover leaf shape when viewed from the air.\n\nThe city is also the location of the Nunatta Sunakkutaangit Museum, which houses a large collection of Inuit and Arctic objects. The museum is housed in a restored and extended Hudson's Bay Company building, clad in the HBC signature red and white, transported to Iqaluit from its original site on the Apex Beach.\n\nJust west of Iqaluit is the Sylvia Grinnell Territorial Park Reserve. This park is dominated by the valley of the Sylvia Grinnell River. A small visitor's centre with viewing platform is located on top of a hill overlooking scenic waterfalls, tidal flats and traditional fishing sites.\n\nNearby on an island near Peterhead Inlet, is the Qaummaarviit Territorial Historic Park. It is a site with a long Inuit history and numerous artifacts have been recovered, including the remains of 11 semi-buried sod houses.\n\nA little farther, across Frobisher Bay, are the Katannilik Territorial Park Reserve and the Soper Heritage River Park forming a park corridor linking Iqaluit along traditional overland travel routes with Kimmirut (formerly Lake Harbour). Frobisher Bay extends for almost 70 mi to the east, with moderate hills, glaciers and traditional and summer camp sites, opening into the Davis Straits which divide Nunavut from Greenland.\n\nIqaluit, like many Nunavut communities has a volunteer-run annual spring festival. Called Toonik Tyme it involves a combination of traditional Inuit activities combined with more modern events, while the Alianait Music and Arts Festival is held for a week each June 21.\n\nMedia \n\nRadio\n\nTelevision\n\nIqaluit was served by CFFB-TV channel 8, a CBC Television/CBC North repeater of CFYK-DT (Yellowknife) until July 31, 2012 when it was closed because of budget cuts at the CBC.[http://cbc.radio-canada.ca/en/media-centre/2012/04/04/ Speaking notes for Hubert T. Lacroix regarding measures announced in the context of the Deficit Reduction Action Plan][http://www.crtc.gc.ca/eng/archive/2012/2012-384.htm Broadcasting Decision CRTC 2012-384, July 17, 2012.]\n\nCommunications\n* Meshnet Community WiFi—free community WiFi and paid service available in most areas of city. Free services include access to Isuma.tv, and many other resources.\n\nPress\n* Nunatsiaq News\n* News/North. Iqaluit. http://en.wikipedia.org/?curid=14582."
  }
}
