{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9951",
  "eid" : "f2e0d4f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778487231,
  "textBody" : "The Epistle of Paul to the Colossians, usually referred to simply as Colossians, is the twelfth book of the New Testament. It was written, according to the text, by Paul the Apostle and Timothy to the Church in Colossae, a small Phrygian city near Laodicea and approximately 100 mi from Ephesus in Asia Minor.\"Colossians, Epistle to the.\" Cross, F. L., ed. The Oxford dictionary of the Christian church. New York: Oxford University Press. 2005\n\nScholars have increasingly questioned Paul's authorship and attributed the letter to an early follower instead. The authenticity of the letter, however, has been defended with equal strength. If Paul were the author, he probably used an amanuensis, or secretary, in writing the letter (Col 4:18),Richards, E. Randolph. Paul and First-Century Letter Writing: Secretaries, Composition and Collection. Downers Grove, IL; Leicester, England: InterVarsity Press; Apollos, 2004. possibly Timothy.James D. G. Dunn, The Epistles to the Colossians and to Philemon: A Commentary on the Greek Text, New International Greek Testament Commentary (Grand Rapids, MI; Carlisle: William B. Eerdmans Publishing; Paternoster Press, 1996), 38.\n\nComposition\n\nDuring the first generation after Jesus, Paul's epistles to various churches helped establish early Christian theology. According to Bruce Metzger, it was written in the 50s while Paul was in prison. Colossians is similar to Ephesians, also written at this time.May, Herbert G. and Bruce M. Metzger. The New Oxford Annotated Bible with the Apocrypha. 1977. Some critical scholars have ascribed the epistle to an early follower of Paul, writing as Paul. The epistle's description of Christ as pre-eminent over creation marks it, for some scholars, as representing an advanced christology not present during Paul's lifetime. Defenders of Pauline authorship cite the work's similarities to Philemon, which is broadly accepted as authentic.\n\nDate\n\nThe letter may have been written by Paul at Rome during his first imprisonment. (Acts , ) Other scholars have suggested that it was written from Caesarea or Ephesus.Wright, N. T., Colossians and Philemon, Tyndale New Testament Commentaries (Grand Rapids: Eerdmans, 1986), pp. 34–39. If the letter is not considered to be an authentic part of the Pauline corpus, then it might be dated during the late 1st century, possibly as late as AD 80.Mack, Burton L. Who Wrote the New Testament? San Francisco:Harper Collins, 1996.\n\nAuthorship \n\nThe letter's authors claim to be Paul and Timothy, but authorship began to be authoritatively questioned during the 19th century.“The earliest evidence for Pauline authorship, aside from the letter itself ... is from the mid to late 2d cent. (Marcionite canon; Irenaeus, Adv. Haer. 3.14.1; Muratorian canon). This traditional view stood [usually] unquestioned until 1838, when E. T. Mayerhoff denied the authenticity of this letter, claiming that it was full of non-Pauline ideas and dependent on the letter of Ephesians. Thereafter others have found additional arguments against Pauline authorship.\" New Jerome Biblical Commentary Pauline authorship was held to by many of the early church's prominent theologians, such as Irenaeus, Clement of Alexandria, Tertullian, Origen of Alexandria  and Eusebius.For a defense of Pauline authorship for Colossians see: Authenticity of [http://www.bible-apologetics.com/history/colossians.htm Colossians]\n\nHowever, as with several epistles attributed to Paul, critical scholarship disputes this claim.\"The cumulative weight of the many differences from the undisputed Pauline epistles has persuaded most modern [also some XVI century] scholars that Paul did not write Colossians ... Those who defend the authenticity of the letter include Martin, Caird, Houlden, Cannon and Moule. Some... describe the letter as Pauline but say that it was heavily interpolated or edited. Schweizer suggests that Col was jointly written by Paul and Timothy. The position taken here is that Col is Deutero-Pauline; it was composed after Paul’s lifetime, between AD 70 (Gnilka) and AD 80 (Lohse) by someone who knew the Pauline tradition. Lohse regards Col as the product of a Pauline school tradition, probably located in Ephesus.\" [TNJBC 1990 p. 877] One ground is that the epistle's language doesn't seem to match Paul's, with 48 words appearing in Colossians that are found nowhere else in his writings and 33 of which occur nowhere else in the New Testament.Koester, Helmut. History and Literature of Early Christianity, Introduction to the New Testament Vol 2. Berlin: Walter de Gruyter & Co, 1982, 1987. A second ground is that the epistle features a strong use of liturgical-hymnic style which appears nowhere else in Paul's work to the same extent.Kummel, Georg Werner. Introduction To The New Testament, Revised English Edition, Translated by Howard Kee. Nashville: Abingdon Press, 1973, 1975 A third is that the epistle's themes related to Christ, eschatology and the church seem to have no parallel in Paul's undisputed works.“The christology of Col is built on the traditional hymn in 1:15–20, according to which Christ is the image of the invisible God... and other christological statements that have no parallel in the undisputed Pauline writings are added: that Christ is the mystery of God... that believers have been raised with Christ ... that Christ forgives sins... that Christ is victorious over the principalities and powers...\" Compared to undisputed Pauline epistles, in which Paul looks forward to an imminent Second Coming, Colossians presents a completed eschatology, in which baptism relates to the past (a completed salvation) rather than to the future: “...whereas Paul expected the parousia in the near future (I Thes 4:15; 5:23; I Cor 7:26)... The congregation has already been raised from the dead with Christ ... whereas in the undisputed letters resurrection is a future expectation... The difference in eschatological orientation between Col and the undisputed letters results in a different theology of baptism... Whereas in Rom 6:1–4 baptism looks forward to the future, in Col baptism looks back to a completed salvation. In baptism believers have not only died with Christ but also been raised with him.” The New Jerome Biblical Commentary, Edited by Raymond E. Brown, S.S., Union Theological Seminary, New York; NY, Maurya P. Horgan (Colossians); Roland E. Murphy, O. Carm. (emeritus) The Divinity School, Duke University, Durham, NC, with a foreword by His Eminence Carlo Maria Cardinal Martini, S.J.; Prentice Hall, Englewood Cliffs, New Jersey, 1990 1990 p. 876\n\nAdvocates of Pauline authorship defend the differences that there are between elements in this letter and those commonly considered the genuine work of Paul (e.g. 1 Thessalonians). It is argued that these differences can come by human variability, such as by growth in theological knowledge over time, different occasion for writing, as well as use of different secretaries (or amanuensis) in composition.Richard R. Melick, vol. 32, Philippians, Colossians, Philemon, electronic ed., Logos Library System; The New American Commentary (Nashville: Broadman & Holman Publishers, 2001, c. 1991), 166 As it is usually pointed out by the same authors who note the differences in language and style, the number of words foreign to the New Testament and Paul is no greater in Colossians than in the undisputed Pauline letters (Galatians, of similar length, has 35 hapax legomena). In regard to the style, as Norman Perrin, who argues for pseudonymity, notes, \"The letter does employ a great deal of traditional material and it can be argued that this accounts for the non-Pauline language and style. If this is the case, the non-Pauline language and style are not indications of pseudonymity.\"Perrin, Norman. The New Testament: An Introduction: Proclamation and Parenesis, Myth and History. Harcourt College Pub., 1974, p. 121 Not only that, but it has been noted that Colossians has indisputably Pauline stylistic characteristics, found nowhere else in the New Testament.Kummel, W.G. Introduction to the New Testament. 1966, p. 241: 'Pleonastic \"kai\" after \"dia touto\" (Col 1:9) is found in the NT only in Paul (1 Thess. 2:13; 3:5; Rom. 13:6)...\"hoi hagioi autou\" Col 1:25\n1 Thess. 3:13, 2 Thess. 1:10, \"charixesthai\"=to forgive (Col 2:13, 3:13) only in 2 Cor 2:7, 10, 12:13' etc. Advocates of Pauline authorship also argue that the differences between Colossians and the rest of the New Testament are not as great as they are purported to be.P. O’Brien, Colossians, Philemon, WBC (Waco, Tex.: Word, 1982), xiv\n\nContent of the letter \n\nColossae is in the region of the seven churches of . In  there is mention of local brethren in Colossae, Laodicea, and Hierapolis. Colossae was approximately 12 mi from Laodicea and 14 mi from Hierapolis. Members of the congregation at Colossae had incorporated pagan elements into their practice, including worship of elemental spirits. The Epistle to the Colossians declares Christ's supremacy over the entire created universe and exhorts Christians to lead godly lives. The letter consists of two parts: first a doctrinal section, then a second regarding conduct. In both sections, false teachers who have been spreading error in the congregation are opposed.\n\nOutline\n\nI. Introduction (1:1–14)\n* A. Greetings (1:1–2)\n* B. Thanksgiving (1:3–8)\n* C. Prayer (1:9–14)\nII. The Supremacy of Christ (1:15–23)\n\nIII. Paul's Labor for the Church (1:24–2:7)\n* A. A Ministry for the Sake of the Church (1:24–2:7)\n* B. A Concern for the Spiritual Welfare of His Readers (2:1–7)\nIV. Freedom from Human Regulations through Life with Christ (2:8–23)\n* A. Warning to Guard against the False Teachers (2:8–15)\n* B. Pleas to Reject the False Teachers (2:16–19)\n* C. An Analysis of the Heresy (2:20–23)\nV. Rules for Holy Living (3:1–4:6)\n* A. The Old Self and the New Self (3:1–17)\n* B. Rules for Christian Households (3:18–4:1)\n* C. Further Instructions (4:2–6)\nVI. Final Greetings (4:7–18)\nNIV Bible (Large Print ed.). (2007). London: Hodder & Stoughton Ltd\n\nDoctrinal sections\n\nIn its doctrinal sections, Colossians emphatically explains that Christ is begotten before all creation (not created) and is supreme over all that has been created. All things were created through him and for him, and the universe is sustained by him. God had chosen for his complete being to dwell in Christ. The \"cosmic powers\" revered by the false teachers had been \"discarded\" and \"led captive\" at Christ's death. Christ is the master of all angelic forces and the head of the church. Christ is the only mediator between God and humanity, the unique agent of cosmic reconciliation. Interestingly, it is the Father in Colossians who is said to have delivered us from the domain of darkness and transferred us to the kingdom of His beloved Son (), not the typical way of articulating salvation today. The Son is the agent of reconciliation and salvation not merely of the church, but in some sense redeems the rest of creation as well (\"all things, whether things on earth or things in heaven\" ().\n\nThe doctrinal part comprises the first two chapters. Its main theme is developed in chapter , with a warning against being drawn away from Him in whom dwelt all the fullness of the deity, and who was the head of all spiritual powers. Christ was the head of the body of which they were members; and if they were truly united to him, what more did they need?\n\nColossians praises the spiritual growth of the recipients because of their love for all the set-apart ones in Christ. It calls them to grow in wisdom and knowledge that their love might be principled love and not sentimentality. \"Christ in you is your hope of glory!\".\n\n\"Christ in you, the hope of Glory\"\n\nOne of the great themes of the doctrinal section of Colossians is promise of union with Christ through the indwelling life of God the Holy Spirit. For example, Colossians 1:27, \"To them God has chosen to make known among the Gentiles the glorious riches of this mystery, which is Christ in you, the hope of glory.\" The Apostle Paul wrote to remind them of this promise and guard them against moving their on going trust from Christ to other philosophies and traditions which did not depend on Christ.\n\nConduct \n\nAs does 1 Corinthians 13, Colossians 1, in early verses, deals with faith, hope and love. While in the case of 1 Corinthians, the love \"does not\" statements, such as boasting, recall the criticisms of the Corinthians earlier in the book. Colossians is different. Paul looks at the faith, hope and love of the Colossian believers as evidence and validation of their faith experience. In introductory verses, 1:6–7, Paul states that the fruit seen in them started the day they understood the grace of God in truth. Conduct is a fruit of faith.\n\nColossians denounces ascetic practices or avoiding certain foods because Christ's death put an end to such distinctions. Believers are one in Christ, not divided between circumcised and uncircumcised, slave and free, and so on. He then calls on his audience to fulfill all domestic and social obligations. A striking image of religion by such rules used by Paul is his use of the word \"shadows\". Some practices in the past may be shadows of what is to come, but Christ is the one who cast the shadow.\n\nColossians does not state with precision what heresies were being faced by the church. There are approximately 44 different theories what the heresies encountered by the church at Colossae were, including a view there was no particular heresy at all but issues typical of those faced by believers. Some argue that it is not merely fasting or feasting or particular area of emotions, conduct or intellect that are denounced but doing them with an independent spirit, not connected to Christ, the head of the body or lack of appreciation of the gospel of grace.\n\nThe practical part of the Epistle, , enforces various duties naturally flowing from the doctrines expounded. They are exhorted to mind things that are above , to mortify every evil principle of their nature, and to put on the new man. Many special duties of the Christian life are also insisted upon as the fitting evidence of the Christian character. The letter ends with customary prayer, instruction, and greetings.Harris, Stephen L., Understanding the Bible. Palo Alto: Mayfield. 1985. \"Colossians\" pp. 337–38\n\nThe Prison Epistles \n\nColossians is often categorized as one of the \"prison epistles\" that include Ephesians, Colossians, Philippians, and Philemon. Colossians has some close parallels with the letter to Philemon—names of some of the same people (e.g., Timothy, Aristarchus, Archippus, Mark, Epaphras, Luke, Onesimus, and Demas) appear in both epistles, and both were written by Paul.[Survey of the New Testament: Ephesians, Philippians, Colossians and Philemon]\n\nTychicus is named as the bearer of the letter, just as he is in Ephesians and Philemon, and he is to tell the recipients of the state of the apostle. After friendly greetings, he bids them exchange this letter with the one he had sent to the neighbouring Laodicean Church. (The Epistle to the Laodiceans was a possible lost letter of Paul which some scholars identify with the canonical Epistle to the Ephesians, others dispute this view.) He then closes the letter with the usual salutation.\n\nColossians calls, in several places, for faithfulness to be recognized:\n* . \"to the faithful brethren\"\n* . \"Epaphras...our dear fellowservant...faithful minister\"\n* . \"Tychicus...faithful minister and fellowservant\"\n* . \"Onesimus, a faithful and beloved brother\"\n\nIt is striking that the apostle writes in Col 1:28 [ESV]: \"Him we proclaim, warning everyone and teaching everyone with all wisdom, that we may present everyone mature in Christ. For this I [Paul] toil, struggling with all his energy that he powerfully works within me.\" Then in Col 3:16, Paul's goal is that the Colossians themselves to in some manner continue in this ministry and admonish and test each other, \"one another\" as Paul did for them. Col 3:16: \"Let the word of Christ dwell in you [Colossian believers] richly, teaching and admonishing one another in all wisdom, singing psalms and hymns and spiritual songs, with thankfulness in your hearts to God.\" In some sense, Paul would have the teaching and admonishing ministry continue by members of the church in Colossae.\n\nColossians has some interesting interpersonal dynamics. Epaphras, who first shared the good news to Colossae, near the opening of the book is presented as a beloved fellow servant—\"one of us\" from Paul's ministry point of view. In contrast, towards the closing of the book he is called \"one of you\". Onesimus is also referred to as \"one of you\" and an important helper of Paul who was the run away slave in the book of Philemon who became a believer. His past is not brought up. Mark and Barnabus parted company with Paul over Mark leaving the mission after violent opposition in the book of Acts, but here is reconciled to Paul and spoken of as a comfort. Epharoditus, Paul refers to as a fellow prisoner, we recognize as the person in the book of Acts who was literally dragged through the streets into court on charges. Paul acknowledges that most never saw his face in Colossae or Laodicea, yet was concerned throughout the book they were aware of the events going on with himself, and appointed Tychicus to inform them so that they should understand how great Paul's suffering for them has been.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Epistle to the Colossians" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9951" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Epistle of Paul to the Colossians, usually referred to simply as Colossians, is the twelfth book of the New Testament. It was written, according to the text, by Paul the Apostle and Timothy to the Church in Colossae, a small Phrygian city near Laodicea and approximately 100 mi from Ephesus in Asia Minor.\"Colossians, Epistle to the.\" Cross, F. L., ed. The Oxford dictionary of the Christian church. New York: Oxford University Press. 2005\n\nScholars have increasingly questioned Paul's authorship and attributed the letter to an early follower instead. The authenticity of the letter, however, has been defended with equal strength. If Paul were the author, he probably used an amanuensis, or secretary, in writing the letter (Col 4:18),Richards, E. Randolph. Paul and First-Century Letter Writing: Secretaries, Composition and Collection. Downers Grove, IL; Leicester, England: InterVarsity Press; Apollos, 2004. possibly Timothy.James D. G. Dunn, The Epistles to the Colossians and to Philemon: A Commentary on the Greek Text, New International Greek Testament Commentary (Grand Rapids, MI; Carlisle: William B. Eerdmans Publishing; Paternoster Press, 1996), 38.\n\nComposition\n\nDuring the first generation after Jesus, Paul's epistles to various churches helped establish early Christian theology. According to Bruce Metzger, it was written in the 50s while Paul was in prison. Colossians is similar to Ephesians, also written at this time.May, Herbert G. and Bruce M. Metzger. The New Oxford Annotated Bible with the Apocrypha. 1977. Some critical scholars have ascribed the epistle to an early follower of Paul, writing as Paul. The epistle's description of Christ as pre-eminent over creation marks it, for some scholars, as representing an advanced christology not present during Paul's lifetime. Defenders of Pauline authorship cite the work's similarities to Philemon, which is broadly accepted as authentic.\n\nDate\n\nThe letter may have been written by Paul at Rome during his first imprisonment. (Acts , ) Other scholars have suggested that it was written from Caesarea or Ephesus.Wright, N. T., Colossians and Philemon, Tyndale New Testament Commentaries (Grand Rapids: Eerdmans, 1986), pp. 34–39. If the letter is not considered to be an authentic part of the Pauline corpus, then it might be dated during the late 1st century, possibly as late as AD 80.Mack, Burton L. Who Wrote the New Testament? San Francisco:Harper Collins, 1996.\n\nAuthorship \n\nThe letter's authors claim to be Paul and Timothy, but authorship began to be authoritatively questioned during the 19th century.“The earliest evidence for Pauline authorship, aside from the letter itself ... is from the mid to late 2d cent. (Marcionite canon; Irenaeus, Adv. Haer. 3.14.1; Muratorian canon). This traditional view stood [usually] unquestioned until 1838, when E. T. Mayerhoff denied the authenticity of this letter, claiming that it was full of non-Pauline ideas and dependent on the letter of Ephesians. Thereafter others have found additional arguments against Pauline authorship.\" New Jerome Biblical Commentary Pauline authorship was held to by many of the early church's prominent theologians, such as Irenaeus, Clement of Alexandria, Tertullian, Origen of Alexandria  and Eusebius.For a defense of Pauline authorship for Colossians see: Authenticity of [http://www.bible-apologetics.com/history/colossians.htm Colossians]\n\nHowever, as with several epistles attributed to Paul, critical scholarship disputes this claim.\"The cumulative weight of the many differences from the undisputed Pauline epistles has persuaded most modern [also some XVI century] scholars that Paul did not write Colossians ... Those who defend the authenticity of the letter include Martin, Caird, Houlden, Cannon and Moule. Some... describe the letter as Pauline but say that it was heavily interpolated or edited. Schweizer suggests that Col was jointly written by Paul and Timothy. The position taken here is that Col is Deutero-Pauline; it was composed after Paul’s lifetime, between AD 70 (Gnilka) and AD 80 (Lohse) by someone who knew the Pauline tradition. Lohse regards Col as the product of a Pauline school tradition, probably located in Ephesus.\" [TNJBC 1990 p. 877] One ground is that the epistle's language doesn't seem to match Paul's, with 48 words appearing in Colossians that are found nowhere else in his writings and 33 of which occur nowhere else in the New Testament.Koester, Helmut. History and Literature of Early Christianity, Introduction to the New Testament Vol 2. Berlin: Walter de Gruyter & Co, 1982, 1987. A second ground is that the epistle features a strong use of liturgical-hymnic style which appears nowhere else in Paul's work to the same extent.Kummel, Georg Werner. Introduction To The New Testament, Revised English Edition, Translated by Howard Kee. Nashville: Abingdon Press, 1973, 1975 A third is that the epistle's themes related to Christ, eschatology and the church seem to have no parallel in Paul's undisputed works.“The christology of Col is built on the traditional hymn in 1:15–20, according to which Christ is the image of the invisible God... and other christological statements that have no parallel in the undisputed Pauline writings are added: that Christ is the mystery of God... that believers have been raised with Christ ... that Christ forgives sins... that Christ is victorious over the principalities and powers...\" Compared to undisputed Pauline epistles, in which Paul looks forward to an imminent Second Coming, Colossians presents a completed eschatology, in which baptism relates to the past (a completed salvation) rather than to the future: “...whereas Paul expected the parousia in the near future (I Thes 4:15; 5:23; I Cor 7:26)... The congregation has already been raised from the dead with Christ ... whereas in the undisputed letters resurrection is a future expectation... The difference in eschatological orientation between Col and the undisputed letters results in a different theology of baptism... Whereas in Rom 6:1–4 baptism looks forward to the future, in Col baptism looks back to a completed salvation. In baptism believers have not only died with Christ but also been raised with him.” The New Jerome Biblical Commentary, Edited by Raymond E. Brown, S.S., Union Theological Seminary, New York; NY, Maurya P. Horgan (Colossians); Roland E. Murphy, O. Carm. (emeritus) The Divinity School, Duke University, Durham, NC, with a foreword by His Eminence Carlo Maria Cardinal Martini, S.J.; Prentice Hall, Englewood Cliffs, New Jersey, 1990 1990 p. 876\n\nAdvocates of Pauline authorship defend the differences that there are between elements in this letter and those commonly considered the genuine work of Paul (e.g. 1 Thessalonians). It is argued that these differences can come by human variability, such as by growth in theological knowledge over time, different occasion for writing, as well as use of different secretaries (or amanuensis) in composition.Richard R. Melick, vol. 32, Philippians, Colossians, Philemon, electronic ed., Logos Library System; The New American Commentary (Nashville: Broadman & Holman Publishers, 2001, c. 1991), 166 As it is usually pointed out by the same authors who note the differences in language and style, the number of words foreign to the New Testament and Paul is no greater in Colossians than in the undisputed Pauline letters (Galatians, of similar length, has 35 hapax legomena). In regard to the style, as Norman Perrin, who argues for pseudonymity, notes, \"The letter does employ a great deal of traditional material and it can be argued that this accounts for the non-Pauline language and style. If this is the case, the non-Pauline language and style are not indications of pseudonymity.\"Perrin, Norman. The New Testament: An Introduction: Proclamation and Parenesis, Myth and History. Harcourt College Pub., 1974, p. 121 Not only that, but it has been noted that Colossians has indisputably Pauline stylistic characteristics, found nowhere else in the New Testament.Kummel, W.G. Introduction to the New Testament. 1966, p. 241: 'Pleonastic \"kai\" after \"dia touto\" (Col 1:9) is found in the NT only in Paul (1 Thess. 2:13; 3:5; Rom. 13:6)...\"hoi hagioi autou\" Col 1:25\n1 Thess. 3:13, 2 Thess. 1:10, \"charixesthai\"=to forgive (Col 2:13, 3:13) only in 2 Cor 2:7, 10, 12:13' etc. Advocates of Pauline authorship also argue that the differences between Colossians and the rest of the New Testament are not as great as they are purported to be.P. O’Brien, Colossians, Philemon, WBC (Waco, Tex.: Word, 1982), xiv\n\nContent of the letter \n\nColossae is in the region of the seven churches of . In  there is mention of local brethren in Colossae, Laodicea, and Hierapolis. Colossae was approximately 12 mi from Laodicea and 14 mi from Hierapolis. Members of the congregation at Colossae had incorporated pagan elements into their practice, including worship of elemental spirits. The Epistle to the Colossians declares Christ's supremacy over the entire created universe and exhorts Christians to lead godly lives. The letter consists of two parts: first a doctrinal section, then a second regarding conduct. In both sections, false teachers who have been spreading error in the congregation are opposed.\n\nOutline\n\nI. Introduction (1:1–14)\n* A. Greetings (1:1–2)\n* B. Thanksgiving (1:3–8)\n* C. Prayer (1:9–14)\nII. The Supremacy of Christ (1:15–23)\n\nIII. Paul's Labor for the Church (1:24–2:7)\n* A. A Ministry for the Sake of the Church (1:24–2:7)\n* B. A Concern for the Spiritual Welfare of His Readers (2:1–7)\nIV. Freedom from Human Regulations through Life with Christ (2:8–23)\n* A. Warning to Guard against the False Teachers (2:8–15)\n* B. Pleas to Reject the False Teachers (2:16–19)\n* C. An Analysis of the Heresy (2:20–23)\nV. Rules for Holy Living (3:1–4:6)\n* A. The Old Self and the New Self (3:1–17)\n* B. Rules for Christian Households (3:18–4:1)\n* C. Further Instructions (4:2–6)\nVI. Final Greetings (4:7–18)\nNIV Bible (Large Print ed.). (2007). London: Hodder & Stoughton Ltd\n\nDoctrinal sections\n\nIn its doctrinal sections, Colossians emphatically explains that Christ is begotten before all creation (not created) and is supreme over all that has been created. All things were created through him and for him, and the universe is sustained by him. God had chosen for his complete being to dwell in Christ. The \"cosmic powers\" revered by the false teachers had been \"discarded\" and \"led captive\" at Christ's death. Christ is the master of all angelic forces and the head of the church. Christ is the only mediator between God and humanity, the unique agent of cosmic reconciliation. Interestingly, it is the Father in Colossians who is said to have delivered us from the domain of darkness and transferred us to the kingdom of His beloved Son (), not the typical way of articulating salvation today. The Son is the agent of reconciliation and salvation not merely of the church, but in some sense redeems the rest of creation as well (\"all things, whether things on earth or things in heaven\" ().\n\nThe doctrinal part comprises the first two chapters. Its main theme is developed in chapter , with a warning against being drawn away from Him in whom dwelt all the fullness of the deity, and who was the head of all spiritual powers. Christ was the head of the body of which they were members; and if they were truly united to him, what more did they need?\n\nColossians praises the spiritual growth of the recipients because of their love for all the set-apart ones in Christ. It calls them to grow in wisdom and knowledge that their love might be principled love and not sentimentality. \"Christ in you is your hope of glory!\".\n\n\"Christ in you, the hope of Glory\"\n\nOne of the great themes of the doctrinal section of Colossians is promise of union with Christ through the indwelling life of God the Holy Spirit. For example, Colossians 1:27, \"To them God has chosen to make known among the Gentiles the glorious riches of this mystery, which is Christ in you, the hope of glory.\" The Apostle Paul wrote to remind them of this promise and guard them against moving their on going trust from Christ to other philosophies and traditions which did not depend on Christ.\n\nConduct \n\nAs does 1 Corinthians 13, Colossians 1, in early verses, deals with faith, hope and love. While in the case of 1 Corinthians, the love \"does not\" statements, such as boasting, recall the criticisms of the Corinthians earlier in the book. Colossians is different. Paul looks at the faith, hope and love of the Colossian believers as evidence and validation of their faith experience. In introductory verses, 1:6–7, Paul states that the fruit seen in them started the day they understood the grace of God in truth. Conduct is a fruit of faith.\n\nColossians denounces ascetic practices or avoiding certain foods because Christ's death put an end to such distinctions. Believers are one in Christ, not divided between circumcised and uncircumcised, slave and free, and so on. He then calls on his audience to fulfill all domestic and social obligations. A striking image of religion by such rules used by Paul is his use of the word \"shadows\". Some practices in the past may be shadows of what is to come, but Christ is the one who cast the shadow.\n\nColossians does not state with precision what heresies were being faced by the church. There are approximately 44 different theories what the heresies encountered by the church at Colossae were, including a view there was no particular heresy at all but issues typical of those faced by believers. Some argue that it is not merely fasting or feasting or particular area of emotions, conduct or intellect that are denounced but doing them with an independent spirit, not connected to Christ, the head of the body or lack of appreciation of the gospel of grace.\n\nThe practical part of the Epistle, , enforces various duties naturally flowing from the doctrines expounded. They are exhorted to mind things that are above , to mortify every evil principle of their nature, and to put on the new man. Many special duties of the Christian life are also insisted upon as the fitting evidence of the Christian character. The letter ends with customary prayer, instruction, and greetings.Harris, Stephen L., Understanding the Bible. Palo Alto: Mayfield. 1985. \"Colossians\" pp. 337–38\n\nThe Prison Epistles \n\nColossians is often categorized as one of the \"prison epistles\" that include Ephesians, Colossians, Philippians, and Philemon. Colossians has some close parallels with the letter to Philemon—names of some of the same people (e.g., Timothy, Aristarchus, Archippus, Mark, Epaphras, Luke, Onesimus, and Demas) appear in both epistles, and both were written by Paul.[Survey of the New Testament: Ephesians, Philippians, Colossians and Philemon]\n\nTychicus is named as the bearer of the letter, just as he is in Ephesians and Philemon, and he is to tell the recipients of the state of the apostle. After friendly greetings, he bids them exchange this letter with the one he had sent to the neighbouring Laodicean Church. (The Epistle to the Laodiceans was a possible lost letter of Paul which some scholars identify with the canonical Epistle to the Ephesians, others dispute this view.) He then closes the letter with the usual salutation.\n\nColossians calls, in several places, for faithfulness to be recognized:\n* . \"to the faithful brethren\"\n* . \"Epaphras...our dear fellowservant...faithful minister\"\n* . \"Tychicus...faithful minister and fellowservant\"\n* . \"Onesimus, a faithful and beloved brother\"\n\nIt is striking that the apostle writes in Col 1:28 [ESV]: \"Him we proclaim, warning everyone and teaching everyone with all wisdom, that we may present everyone mature in Christ. For this I [Paul] toil, struggling with all his energy that he powerfully works within me.\" Then in Col 3:16, Paul's goal is that the Colossians themselves to in some manner continue in this ministry and admonish and test each other, \"one another\" as Paul did for them. Col 3:16: \"Let the word of Christ dwell in you [Colossian believers] richly, teaching and admonishing one another in all wisdom, singing psalms and hymns and spiritual songs, with thankfulness in your hearts to God.\" In some sense, Paul would have the teaching and admonishing ministry continue by members of the church in Colossae.\n\nColossians has some interesting interpersonal dynamics. Epaphras, who first shared the good news to Colossae, near the opening of the book is presented as a beloved fellow servant—\"one of us\" from Paul's ministry point of view. In contrast, towards the closing of the book he is called \"one of you\". Onesimus is also referred to as \"one of you\" and an important helper of Paul who was the run away slave in the book of Philemon who became a believer. His past is not brought up. Mark and Barnabus parted company with Paul over Mark leaving the mission after violent opposition in the book of Acts, but here is reconciled to Paul and spoken of as a comfort. Epharoditus, Paul refers to as a fellow prisoner, we recognize as the person in the book of Acts who was literally dragged through the streets into court on charges. Paul acknowledges that most never saw his face in Colossae or Laodicea, yet was concerned throughout the book they were aware of the events going on with himself, and appointed Tychicus to inform them so that they should understand how great Paul's suffering for them has been. Epistle to the Colossians. http://en.wikipedia.org/?curid=9951."
  }
}
