{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12007",
  "eid" : "ff705100-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778508304,
  "textBody" : "Johann Gottlieb Fichte (;[http://dictionary.reference.com/browse/fichte \"Fichte\"]. Random House Webster's Unabridged Dictionary.; May 19, 1762 – January 27, 1814), was a German philosopher who became a founding figure of the philosophical movement known as German idealism, which developed from the theoretical and ethical writings of Immanuel Kant.  Recently, philosophers and scholars have begun to appreciate Fichte as an important philosopher in his own right due to his original insights into the nature of self-consciousness or self-awareness. Fichte was also the originator of thesis–antithesis–synthesis,\"Review of Aenesidemus\" ([http://www.gleichsatz.de/b-u-t/trad/fichte/jgf-aenesidemus.html \"Rezension des Aenesidemus\"], ', February 11–12, 1794). Trans. Daniel Breazeale. In  (See also: FTP, p. 46; Breazeale 1980–81, pp. 545–68; Breazeale and Rockmore 1994, p. 19; Breazeale 2013, pp. 36–37; Waibel, Breazeale, Rockmore 2010, p. 157: \"Fichte believes that the I must be grasped as the unity of synthesis and analysis.\") an idea that is often erroneously attributed to Hegel.Robert C. Solomon, In the Spirit of Hegel, Oxford University Press, p. 23. Like Descartes and Kant before him, Fichte was motivated by the problem of subjectivity and consciousness. Fichte also wrote works of political philosophy; he has a reputation as one of the fathers of German nationalism.\n\nBiography\n\nOrigins\n\nFichte was born in Rammenau, Upper Lusatia. The son of a ribbon weaver, he came of peasant stock which had lived in the region for many generations. The family was noted in the neighborhood for its probity and piety. Christian Fichte, Johann Gottlieb's father, married somewhat above his station. It has been suggested that a certain impatience which Fichte himself displayed throughout his life was an inheritance from his mother.\n\nYoung Fichte received the rudiments of his education from his father. He showed remarkable ability from an early age, and it was owing to his reputation among the villagers that he gained the opportunity for a better education than he otherwise would have received. The story runs that the Freiherr von Militz, a country landowner, arrived too late to hear the local pastor preach. He was, however, informed that a lad in the neighborhood would be able to repeat the sermon practically verbatim. As a result, the baron took the lad into his protection, which meant that he paid his tuition.\n\nEarly schooling\n\nFichte was placed in the family of Pastor Krebel at Niederau near Meissen and there received thorough grounding in the classics. From this time onward, Fichte saw little of his parents. In October 1774, he was attending the celebrated foundation-school at Pforta near Naumburg. This school is associated with the names of Novalis, August Wilhelm Schlegel, Friedrich Schlegel and Nietzsche. The spirit of the institution was semi-monastic and, while the education given was excellent in its way, it is doubtful whether there was enough social life and contact with the world for a pupil of Fichte's temperament and antecedents. Perhaps his education strengthened a tendency toward introspection and independence, characteristics which appear strongly in his doctrines and writings.\n\nTheological studies and private tutoring\n\nIn 1780, he began study at the theology seminary of University of Jena. He was transferred a year later to study at the Leipzig University. Fichte seems to have supported himself at this period of bitter poverty and hard struggle. Freiherr von Militz continued to support him, but when he died in 1784, Fichte had to end his studies prematurely, without completing his degree.\n\nDuring the years 1784 to 1788, he supported himself in a precarious way as tutor in various Saxon families. In early 1788, he returned to Leipzig in the hope of finding a better employment, but eventually he had to settle for a much less promising position with the family of an innkeeper in Zurich.Anthony J. La Vopa, Fichte: The Self and the Calling of Philosophy, 1762-1799, Cambridge University Press, 2001, p. 26. He lived in Zurich for the next two years (1788–1790), which was a time of great contentment for him. There he met his future wife, Johanna Rahn,She happened to be the niece of the famous poet F. G. Klopstock. and Johann Heinrich Pestalozzi. There he also became in 1793 a member of the Freemasonry lodge \"Modestia cum Libertate\" with which Johann Wolfgang Goethe was also connected.Imhof, Gottlieb (1959). Kleine Werklehre der Freimaurerei. I. Das Buch des Lehrlings. 5th ed. Lausanne: Alpina, p. 42.Lawatsch, Hans-Helmut (1991). \"Fichte und die hermetische Demokratie der Freimaurer.\" In: Hammacher, Klaus, Schottky, Richard, Schrader, Wolfgang H. and Daniel Breazeale (eds.). Sozialphilosophie. Fichte-Studien, Vol. 3. Amsterdam-Atlanta: Editions Rodopi, p. 204, . In the spring of 1790, he became engaged to Johanna.Anthony J. La Vopa, Fichte: The Self and the Calling of Philosophy, 1762-1799, Cambridge University Press, 2001, p. 151. In the summer of 1790, Fichte began to study the works of Kant, but this occurred initially because one of his students wanted to know about them. They had a lasting effect on the trajectory of his life and thought. While he was assimilating the Kantian philosophy and preparing to develop it, fate dealt him a blow: the Rahn family had suffered financial reverses, and his impending marriage had to be postponed.\n\nKant\n\nFrom Zurich, Fichte returned to Leipzig in May 1790. In the spring of 1791, he obtained a tutorship at Warsaw in the house of a Polish nobleman. The situation, however, quickly proved disagreeable and he was released. He then got a chance to see Kant at Königsberg. After a disappointing interview on July 4 of the same year, he shut himself in his lodgings and threw all his energies into the composition of an essay which would compel Kant's attention and interest. This essay, completed in five weeks, was the Versuch einer Critik aller Offenbarung (Attempt at a Critique of All Revelation, 1792). In this book Fichte investigated the connections between divine revelation and Kant's critical philosophy. The first edition of the book was published without Kant or Fichte's knowledge, moreover without Fichte's name or signed preface.  It was thus mistakenly thought to be a new work by Kant himself.Traditionally, it has been assumed that either the omission was an accident or a deliberate attempt by the publisher to move copies. In either case, Fichte did not plan it and in fact only heard of the accident much later.  He writes to his fiancée: \"Why did I have to have such utterly strange, excellent, unheard-of good luck?\" See Garrett Green's Introduction to Attempt at a Critique of All Revelation. Cambridge: Cambridge University Press, 1978. Reviews were assuming Kant was the author when Kant cleared the confusion and openly praised the work and author. Fichte's reputation skyrocketed as many intellectuals of the day were of the opinion that it was \"the most shocking and astonishing news... [since] nobody but Kant could have written this book. This amazing news of a third sun in the philosophical heavens has set me into such confusion\".Letter from Jens Baggeson to Karl Reinhold. Quoted in Editor's Introduction to Fichte, Early Philosophical Writings. London: Cornell University Press, 1988.\n\nJena\n\nIn October 1793, he was married in Zurich, where he remained the rest of the year. Stirred by the events and principles of the French Revolution, he wrote and anonymously published two pamphlets which led to him being seen as a devoted defender of liberty of thought and action and an advocate of political changes. In December of the same year, he received an invitation to fill the position of extraordinary professor of philosophy at the University of Jena. He accepted and began his lectures in May of the next year. With extraordinary zeal, he expounded his system of \"transcendental idealism\". His success was immediate. He seems to have excelled as a lecturer because of the earnestness and force of his personality. These lectures were later published under the title The Vocation of the Scholar (Einige Vorlesungen über die Bestimmung des Gelehrten). He gave himself up to intense production, and a succession of works soon appeared.\n\nAtheism Dispute\n\nAfter weathering a couple of academic storms, he was finally dismissed from Jena in 1799 as a result of a charge of atheism. He was accused of atheism in 1798 after publishing his essay \"Ueber den Grund unsers Glaubens an eine göttliche Weltregierung\" (\"On the Ground of Our Belief in a Divine World-Governance\"), which he had written in response to Friedrich Karl Forberg's essay \"Development of the Concept of Religion,\" in his Philosophical Journal. For Fichte, God should be conceived primarily in moral terms: \"The living and efficaciously acting moral order is itself God. We require no other God, nor can we grasp any other\" (\"On the Ground of Our Belief in a Divine World-Governance\").\n\nFichte's intemperate \"Appeal to the Public\" (\"Appellation an das Publikum\", 1799) provoked F. H. Jacobi to publish an open letter to Fichte, in which he equated philosophy in general and Fichte's transcendental philosophy in particular with nihilism.\n\nBerlin\n\nSince all the German states except Prussia had joined in the cry against him, he was forced to go to Berlin. There he associated himself with the Schlegels, Schleiermacher, Schelling and Tieck.\n\nIn April 1800, through the introduction of Hungarian writer Ignaz Aurelius Fessler, he was initiated into Freemasonry in the Lodge Pythagoras of the Blazing Star where he was elected minor warden. At first Fichte was a warm admirer of Fessler, and was disposed to aid him in his proposed Masonic reform. But later he became Fessler's bitter opponent. Their controversy attracted much attention among Freemasons. Fichte presented two lectures on the philosophy of Masonry during the same period as part of his work on the development of various higher degrees for the lodge in Berlin.Glenn Alexander Magee, Hegel and the Hermetic Tradition, Cornell University Press, 2008, p. 55. A certain Johann Karl Christian Fischer, a high official of the Grand Orient, published those lectures in 1802/03 in two volumes under the title Philosophy of Freemasonry: Letters to Konstant (Philosophie der Maurerei. Briefe an Konstant), where Konstant referred to a fictitious non-Mason.\n\nIn November 1800, Fichte published The Closed Commercial State: A Philosophical Sketch as an Appendix to the Doctrine of Right and an Example of a Future Politics (Der geschlossene Handelsstaat. Ein philosophischer Entwurf als Anhang zur Rechtslehre und Probe einer künftig zu liefernden Politik), a philosophical statement of his property theory, a historical analysis of European economic relations, and a political proposal for reforming them.Isaac Nakhimovsky, The Closed Commercial State: Perpetual Peace and Commercial Society from Rousseau to Fichte, Princeton University Press, 2011, p. 6.\n\nIn 1805, he was appointed to a professorship in Erlangen. The disaster at Jena in 1806, in which Napoleon completely crushed the Prussian army, drove him to Königsberg for a time, but he returned to Berlin in 1807 and continued his literary activity.\n\nThe deplorable situation of Germany stirred him to the depths and led him to deliver the famous Addresses to the German Nation (Reden an die deutsche Nation, 1808) which guided the uprising against Napoleon. He became a professor of the new university at Berlin founded in 1810. By the votes of his colleagues Fichte was unanimously elected its rector in the succeeding year. But, once more, his impetuosity and reforming zeal led to friction, and he resigned in 1812. The campaign against Napoleon began, and the hospitals at Berlin were soon full of patients. Fichte's wife devoted herself to nursing and caught a virulent fever. Just as she was recovering, he himself was stricken down. He died of typhus at the age of 51.\n\nHis son, Immanuel Hermann Fichte (18 July 1796 – 8 August 1879), also made contributions to philosophy.\n\nFichte's philosophy\n\nIn mimicking Kant's difficult style, his critics argued that Fichte produced works that were barely intelligible. \"He made no hesitation in pluming himself on his great skill in the shadowy and obscure, by often remarking to his pupils, that 'there was only one man in the world who could fully understand his writings; and even he was often at a loss to seize upon his real meaning.'\"Robert Blakely, History of the Philosophy of Mind, Vol. IV, p. 114, London: Longmans, 1850 On the other hand, Fichte himself acknowledged the difficulty of his writings, but argued that his works were clear and transparent to those who made the effort to think without preconceptions and prejudices.\n\nFichte did not endorse Kant's argument for the existence of noumena, of \"things in themselves\", the supra-sensible reality beyond the categories of direct human perception. Fichte saw the rigorous and systematic separation of \"things in themselves\" (noumena) and things \"as they appear to us\" (phenomena) as an invitation to skepticism. Rather than invite such skepticism, Fichte made the radical suggestion that we should throw out the notion of a noumenal world and instead accept the fact that consciousness does not have a grounding in a so-called \"real world\". In fact, Fichte achieved fame for originating the argument that consciousness is not grounded in anything outside of itself. The phenomenal world as such, arises from self-consciousness; the activity of the ego; and moral awareness. His student (and critic), Arthur Schopenhauer, wrote:\n\nSøren Kierkegaard was also a student of the writings of Fichte: \n\nCentral theory\n\nIn his work Foundations of Natural Right (1797), Fichte argued that self-consciousness was a social phenomenon — an important step and perhaps the first clear step taken in this direction by modern philosophy. A necessary condition of every subject's self-awareness, for Fichte, is the existence of other rational subjects. These others call or summon (fordern auf) the subject or self out of its unconsciousness and into an awareness of itself as a free individual.\n\nFichte's account proceeds from the general principle that the I must set itself up as an individual in order to set itself up at all, and that in order to set itself up as an individual it must recognize itself as it were to a calling or summons (Aufforderung) by other free individual(s) — called, moreover, to limit its own freedom out of respect for the freedom of the other. The same condition applied and applies, of course, to the other(s) in its development. Hence, mutual recognition (gegenseitig anerkennen) of rational individuals turns out to be a condition necessary for the individual 'I' in general.Fichte, J. G. (2000), Foundations of Natural Right, according to the Principles of the Wissenschaftslehre, ed. F. Neuhouser, trans. M. Baur. Cambridge: Cambridge University Press, p. 42.Allen W. Wood, The Free Development of Each: Studies on Reason, Right, and Ethics in Classical German Philosophy, Oxford University Press, 2014, p. 207: \"The whole point of the summons, in fact, is that it is what first makes our individuality possible for us, through presenting us with the concept of our own individual free action in the form of an object of our consciousness.\" This argument for intersubjectivity is central to the conception of selfhood developed in the Foundations of the Science of KnowledgeAlso translated as Foundations of the Entire Science of Knowledge. (Grundlage der gesamten Wissenschaftslehre, 1794/1795). In Fichte's view consciousness of the self depends upon resistance or a check by something that is understood as not part of the self yet is not immediately ascribable to a particular sensory perception.  In his later 1796–1799 lectures (his Nova methodo), Fichte incorporated it into his revised presentation of the very foundations of his system, where the summons takes its place alongside original feeling, which takes the place of the earlier Anstoss (see below) as both a limit upon the absolute freedom of the I and a condition for the positing of the same.\n\nThe I (Das Ich) itself sets this situation up for itself (it posits itself). To 'set' (setzen) does not mean to 'create' the objects of consciousness. The principle in question simply states that the essence of an I lies in the assertion of one's own self-identity, i.e., that consciousness presupposes self-consciousness. Such immediate self-identity, however, cannot be understood as a psychological fact, nor as an act or accident of some previously existing substance or being. It is an action of the I, but one that is identical with the very existence of this same I. In Fichte's technical terminology, the original unity of self-consciousness is to be understood both as an action and as the product of the same I, as a \"fact and/or act\" (Thathandlung; Modern German: Tathandlung), a unity that is presupposed by and contained within every fact and every act of empirical consciousness, although it never appears as such therein.\n\nThe 'I' must posit (setzen) itself in order to be an 'I' at all; but it can posit itself only insofar as it posits itself (sets itself up) as limited. Moreover, it cannot even posit for itself its own limitations, in the sense of producing or creating these limits. The finite I cannot be the ground of its own passivity. Instead, for Fichte, if the 'I' is to posit itself off at all, it must simply discover itself to be limited, a discovery that Fichte characterizes as an \"impulse,\"Breazeale 2013, p. vii. \"repulse,\"Nicholas Adams, George Pattison, Graham Ward (eds.), The Oxford Handbook of Theology and Modern European Thought, Oxford University Press, 2013, p. 129. or \"resistance\"Jeffrey Reid, The Anti-Romantic: Hegel Against Ironic Romanticism, A&C Black, 2014, p. 26. (Anstoss; Modern German: Anstoß) to the free practical activity of the I. Such an original limitation of the I is, however, a limit for the I only insofar as the I posits it out as a limit. The I does this, according to Fichte's analysis, by positing its own limitation, first, as only a feeling, then as a sensation, then as an intuition of a thing, and finally as a summons of another person. The Anstoss thus provides the essential impetus that first posits in motion the entire complex train of activities that finally result in our conscious experience both of ourselves and others as empirical individuals and of the world around us.\n\nThough Anstoss plays a similar role as the thing in itself does in Kantian philosophy, unlike Kant, Fichte's Anstoss is not something foreign to the I. Instead, it denotes the I's original encounter with its own finitude. Rather than claim that the Not-I is the cause or ground of the Anstoss, Fichte argues that non-I is set up by the I precisely in order to explain to itself the Anstoss, that is, in order to become conscious of Anstoss.\n\nThough the Wissenschaftslehre demonstrates that such an Anstoss must occur if self-consciousness is to come about, it is quite unable to deduce or to explain the actual occurrence of such an Anstoss — except as a condition for the possibility of consciousness. Accordingly, there are strict limits to what can be expected from any a priori deduction of experience, and this limitation, for Fichte, equally applies to Kant's transcendental philosophy.\n\nAccording to Fichte, transcendental philosophy can explain that the world must have space, time, and causality, but it can never explain why objects have the particular sensible properties they happen to have or why I am this determinate individual rather than another. This is something that the I simply has to discover at the same time that it discovers its own freedom, and indeed, as a condition for the latter.\n\nDieter Henrich (1966) proposed that Fichte was able to move beyond a \"reflective theory of consciousness\". According to Fichte the self must already have some prior acquaintance with itself, independent of the act of reflection (\"no object comes to consciousness except under the condition that I am aware of myself, the conscious subject [jedes Object kommt zum Bewusstseyn lediglich unter der Bedingung, dass ich auch meiner selbst, des bewusstseyenden Subjects mir bewusst sey]\".Fichte, J. G., Versuch einer neuen Darstellung der Wissenschaftslehre (1797/1798): II.2; Gesamtausgabe I/4:274–275. This idea is what Henrich called Fichte's original insight.Dieter Henrich, \"Fichte's Original Insight\", Contemporary German Philosophy 1 (1982[1966]), ed. by Darrel E. Christensen et al., pp. 15–52 (translation of Henrich, Dieter (1966), \"Fichtes ursprüngliche Einsicht\", in: Subjektivität und Metaphysik. Festschrift für Wolfgang Cramer edited by D. Henrich und H. Wagner, Frankfurt/M., pp. 188–232). Henrich's article is an analysis of the following three presentations of the Wissenschaftslehre: Grundlage der gesamten Wissenschaftslehre (Foundations of the Science of Knowledge, 1794/1795), Versuch einer neuen Darstellung der Wissenschaftslehre (An Attempt a New Presentation of the Wissenschaftslehre, 1797/1798), and Darstellung der Wissenschaftslehre (Presentation of the Wissenschaftslehre, 1801).\n\nOther works\n\nFichte also developed a theory of the state based on the idea of self-sufficiency. In his mind, the state should control international relations, the value of money, and remain an autarky.  Because of this necessity to have relations with other rational beings in order to achieve consciousness, Fichte writes that there must be a 'relation of right', in which there is a mutual recognition of rationality by both parties.\n\nNationalism\n\nBetween December 1807 and March 1808, Fichte gave a series of lectures concerning the \"German nation\" and its culture and language, projecting the kind of national education he hoped would raise it from the humiliation of its defeat at the hands of the French.  Having been a supporter of Revolutionary France, Fichte became disenchanted by 1804 as Napoleon's armies advanced through Europe, occupying German territories, striping them of their raw materials and subjugating them to foreign rule. Consequently, Fichte came to believe Germany would be responsible to carry the virtues of the French Revolution into the future. Furthermore, his nationalism was not aroused by Prussia military defeat and humiliation, for these had not yet occurred, but resulted from devotion to his own humanitarian philosophy. Through disappointment in the French he turned to the German \"nation\" as the instrument of fulfilling it. These lectures, entitled the Addresses to the German Nation, coincided with a period of reform in the Prussian government, under the chancellorship of Baron vom Stein. The Addresses display Fichte's interest during that period in language and culture as vehicles of human spiritual development. Fichte built upon the earlier ideas of Herder and attempted to unite them with his more systematic approach. The aim of the German nation, according to Fichte, was to \"found an empire of spirit and reason, and to annihilate completely the crude physical force that rules of the world.\" Like Herder's German nationalism, Fichte's was wholly cultural, and grounded in the aesthetic, literary, and moral.\n\nThe nationalism propounded by Fichte in the Addresses would be appealed to over a century later by the Nazi Party in Germany, which sought in Fichte a forerunner to its own nationalist ideology. Like Nietzsche, the association of Fichte with the Nazi regime came to colour readings of Fichte's German nationalism in the post-war period. This reading of Fichte was often bolstered through reference to an unpublished letter from 1793, Contributions to the Correction of the Public's Judgment concerning the French Revolution, wherein Fichte expressed anti-semitic sentiments, such as arguing against extending civil rights to Jews and calling them a \"state within a state\" that could \"undermine\" the German nation.Gesamtausgabe, I/1, pp. 292–293 However, attached to the letter is a footnote in which Fichte provides an impassioned plea for permitting Jews to practice their religion without hindrance. Furthermore, the final act of Fichte's academic career was to resign as rector of Humboldt University in protest when his colleagues refused to punish the harassment of Jewish students. While recent scholarship has sought to dissociate Fichte's writings on nationalism with his adoption by the Nazi Party, the association continues to blight Fichte's legacy.\n\nWomen\n\nFichte argued that \"active citizenship, civic freedom and even property rights should be withheld from women, whose calling was to subject themselves utterly to the authority of their fathers and husbands.\"Christopher M. Clark, Iron Kingdom: The Rise and Downfall of Prussia, 1600-1947 (Harvard University Press, 2006: ), p. 377.\n\nFinal period in Berlin\n\nFichte gave a wide range of public and private lectures in Berlin from the last decade of his life. These form some of his best known work, and are the basis of a revived German-speaking scholarly interest in his work.Breazeale, Dan, \"Johann Gottlieb Fichte\", The Stanford Encyclopedia of Philosophy (Spring 2012 Edition), Edward N. Zalta (ed.), URL: .\n\nThe lectures include two works from 1806. In The Characteristics of the Present Age (Die Grundzüge des gegenwärtigen Zeitalters), Fichte outlines his theory of different historical and cultural epochs. His mystic work The Way Towards the Blessed Life (Die Anweisung zum seligen Leben oder auch die Religionslehre) gave his fullest thoughts on religion. In 1808 he gave a series of speeches in French-occupied Berlin, Addresses to the German Nation.\n\nIn 1810, the new University of Berlin was set up, designed along lines put forward by Wilhelm von Humboldt. Fichte was made its rector and also the first Chair of Philosophy. This was in part because of educational themes in the Addresses, and in part because of his earlier work at Jena University.\n\nFichte lectured on further versions of his Wissenschaftslehre. Of these, he only published a brief work from 1810, The Science of Knowledge in its General Outline (Die Wissenschaftslehre, in ihrem allgemeinen Umrisse dargestellt; also translated as Outline of the Doctrine of Knowledge). His son published some of these thirty years after his death.\n\nMost only became public in the last decades of the twentieth century, in his collected works.Gesamtausgabe der Bayerischen Akademie der Wissenschaften, approx. 40 volumes. Edited by Reinhard Lauth, Erich Fuchs, Hans Gliwitzky, Ives Radrizzani, Günter Zöller, et al., Stuttgart-Bad Cannstatt 1962. This included reworked versions of the Doctrine of Science (Wissenschaftslehre, 1810–1813), The Science of Rights (Das System der Rechtslehre, 1812), and The Science of Ethics as Based on the Science of Knowledge (Das System der Sittenlehre nach den Principien der Wissenschaftslehre, 1812; 1st ed. 1798).\n\nBibliography\n\nSelected works in German\n\nWissenschaftslehre\n\n* Ueber den Begriff der Wissenschaftslehre oder der sogenannten Philosophie (1794)\n* Grundlage der gesamten Wissenschaftslehre (1794/1795)\n* Wissenschaftslehre nova methodo (1796–1799: \"Halle Nachschrift,\" 1796/1797 and \"Krause Nachschrift,\" 1798/1799)\n* Versuch einer neuen Darstellung der Wissenschaftslehre (1797/1798)\n* Darstellung der Wissenschaftslehre (1801)\n* Die Wissenschaftslehre (1804, 1812, 1813)\n* Die Wissenschaftslehre, in ihrem allgemeinen Umrisse dargestellt (1810)\n\nOther works in German\n\n* Versuch einer Critik aller Offenbarung (1792)\n* Beitrag zur Berichtigung der Urteile des Publikums über die französische Revolution (1793)\n* Einige Vorlesungen über die Bestimmung des Gelehrten (1794)\n* Grundlage des Naturrechts (1796)\n* Das System der Sittenlehre nach den Principien der Wissenschaftslehre (1798)\n* \"Ueber den Grund unsers Glaubens an eine göttliche Weltregierung\" (1798)\n* \"Appellation an das Publikum über die durch Churf. Sächs. Confiscationsrescript ihm beigemessenen atheistischen Aeußerungen. Eine Schrift, die man zu lesen bittet, ehe man sie confsicirt\" (1799)\n* Der geschlossene Handelsstaat. Ein philosophischer Entwurf als Anhang zur Rechtslehre und Probe einer künftig zu liefernden Politik (1800)\n* Die Bestimmung des Menschen (1800)\n* Friedrich Nicolais Leben und sonderbare MeinungenEnglish translation: Friedrich Nicolai's Life and Strange Opinions. (1801)\n* Philosophie der Maurerei. Briefe an Konstant (1802/03)\n* Die Grundzüge des gegenwärtigen Zeitalters (1806)\n* Die Anweisung zum seligen Leben oder auch die Religionslehre (1806)\n* Reden an die deutsche Nation (1807/1808)\n* Das System der Rechtslehre (1812)\n\nCorrespondence\n\n* Jacobi an Fichte, German Text (1799/1816), with Introduction and Critical Apparatus by Marco Ivaldo and Ariberto Acerbi (Introduction, German Text, Italian Translation, 3 Appendices with Jacobi's and Fichte's complementary Texts, Philological Notes, Commentary, Bibliography, Index): Istituto Italiano per gli Studi Filosofici Press, Naples 2011, .\n\nCollected works in German\n\nThe new standard edition of Fichte's works in German, which supersedes all previous editions, is the Gesamtausgabe (\"Collected Works\" or \"Complete Edition\", commonly abbreviated as GA), prepared by the Bavarian Academy of Sciences: Gesamtausgabe der Bayerischen Akademie der Wissenschaften, 42 volumes, edited by Reinhard Lauth, Hans Gliwitzky, Erich Fuchs and Peter Schneider, Stuttgart-Bad Cannstatt: Frommann-Holzboog, 1962–2012.\n\nIt is organized into four parts:\n*Part I: Published Works\n*Part II: Unpublished Writings\n*Part III: Correspondence\n*Part IV: Lecture Transcripts\n\nFichte's works are quoted and cited from GA, followed by a combination of Roman and Arabic numbers, indicating the series and volume, respectively, and the page number(s).\n\nAnother edition is Johann Gottlieb Fichtes sämmtliche Werke (abbrev. SW), ed. I. H. Fichte. Berlin: de Gruyter, 1971.\n\nSelected works in English\n\n* Concerning the Conception of the Science of Knowledge Generally (Ueber den Begriff der Wissenschaftslehre oder der sogenannten Philosophie, 1794), translated by Adolph Ernst Kroeger. In The Science of Knowledge, pp. 331–336. Philadelphia: J.B. Lippincott & Co., 1868. Rpt., London: Trübner & Co., 1889.\n* Attempt at a Critique of All Revelation. Trans. Garrett Green. New York: Cambridge University Press, 1978. (Translation of Versuch einer Critik aller Offenbarung, 1st ed. 1792, 2nd ed. 1793.)\n* Early Philosophical Writings. Trans. and ed. Daniel Breazeale. Ithaca: Cornell University Press, 1988. (Contains Selections from Fichte's Writings and Correspondence from the Jena period, 1794–1799).\n* Foundations of the Entire Science of Knowledge. Translation of: Grundlage der gesammten Wissenschaftslehre (1794/95, 2nd ed. 1802), Fichte's first major exposition of the Wissenschaftlehre. In: The Science of Knowledge, trans. and ed. Peter Heath and John Lachs. Cambridge: Cambridge University Press, 1982.\n* Foundations of Natural Right. Trans. Michael Baur. Ed. Frederick Neuhouser. Cambridge: Cambridge University Press, 2000. (Translation of Grundlage des Naturrechts, 1796/97.)\n* Foundations of Transcendental Philosophy (Wissenschaftslehre) Nova Methodo [FTP]. Trans. and ed. Daniel Breazeale. Ithaca, NY: Cornell University Press, 1992. (Translation of Wissenschaftslehre nova methodo, 1796–1799.)\n* The System of Ethics according to the Principles of the Wissenschaftslehre (translation of Das System der Sittenlehre nach den Principien der Wissenschaftslehre, 1798). Ed. and trans. Daniel Breazeale and Günter Zöller. Cambridge University Press, 2005.\n* Introductions to the Wissenschaftslehre and Other Writings. Trans. and ed. Daniel Breazeale. Indianapolis, and Cambridge: Hackett, 1994. (Contains mostly writings from the late Jena period, 1797–1799.)\n* The Vocation of Man, 1848. Trans. Peter Preuss. Indianapolis. (Translation of Die Bestimmung des Menschen, 1800.)\n* [https://openlibrary.org/books/OL22896350M/The_vocation_of_the_scholar The Vocation of the Scholar], 1847. (Translation of Einige Vorlesungen über die Bestimmung des Gelehrten, 1794.)\n* A Crystal Clear Report to the General Public Concerning the Actual Essence of the Newest Philosophy: An Attempt to Force the Reader to Understand. Trans. John Botterman and William Rash. In: Philosophy of German Idealism, pp. 39–115. (Translation of Sonnenklarer Bericht an das grössere Publikum über das Wesen der neuesten Philosophie, 1801.)\n* The Science of Knowing: J. G. Fichte's 1804 Lectures on the Wissenschaftslehre. Ed. and trans. Walter W. Wright. Albany, NY: State University of New York Press. 2005.\n* Outline of the Doctrine of Knowledge, 1810 (Translation of Die Wissenschaftslehre, in ihrem allgemeinen Umrisse dargestellt published in From The Popular Works of Johann Gottlieb Fichte, Trubner and Co., 1889; trans. William Smith.)\n* [https://archive.org/details/onthenatureofthe00fichuoft On the Nature of the Scholar], 1845 (Translation of Ueber das Wesen des Gelehrten, 1806.)\n* Characteristics of the Present Age (Die Grundzüge des gegenwärtigen Zeitalters, 1806). In: The Popular Works of Johann Gottlieb Fichte, 2 vols., trans. and ed. William Smith. London: Chapman, 1848/49. Reprint, London: Thoemmes Press, 1999.\n* Addresses to the German Nation (Reden an die deutsche Nation, 1808), ed. and trans. Gregory Moore. Cambridge University Press, 2008.\n* The Philosophical Rupture Between Fichte and Schelling: Selected Texts and Correspondence (1800-1802). Trans. and eds. Michael G. Vater and David W. Wood. Albany, NY: State University of New York Press, 2012. Includes the following texts by Johann Gottlieb Fichte: Correspondence with F.W.J. Schelling (1800–1802); \"Announcement\" (1800); extract from \"New Version of the Wissenschaftslehre\" (1800); \"Commentaries on Schelling's System of Transcendental Idealism and Presentation of My System of Philosophy\" (1800–1801).\n\nWorks online in English\n\n* J.G. Fichte. \"The Wissenschaftslehre is Mathematics\" (\"Announcement\", 1800/1801). *  [https://www.academia.edu/12491872/J.G._Fichte._The_Wissenschaftslehre_is_Mathematics_1800_1801_]\n* Addresses to the German Nation (1922). (Trs. R. F. Jones and G. H. Turnbull.) [https://archive.org/details/addressestothege00fichuoft IA (UToronto)]\n* The Destination of Man (1846). Alternative translation of The Vocation of Man. (Tr. Mrs. Percy Sinnett.) [https://archive.org/details/thedestinationof00fichuoft IA (UToronto)]\n* Doctrine de la science (Paris, 1843). French translation of Foundations of the Entire Science of Knowledge. [https://archive.org/details/doctrinedelasci00grimgoog Google (Harvard)] [https://archive.org/details/doctrinedelasci01fichgoog Google (Oxford)] [https://archive.org/details/doctrinedelasci00fichgoog Google (UMich)] \n* Johann Gottlieb Fichte’s Popular Works (1873). (Tr. William Smith.) [https://archive.org/details/johanngottlieb00fichuoft IA (UToronto)]\n* New Exposition of the Science of Knowledge (1869). Translation of Versuch einer neuen Darstellung der Wissenschaftslehre. (Tr. A. E. Kroeger.) [https://books.google.com/books?id7C8RAAAAYAAJ Google (Harvard)] [https://books.google.com/books?id\nqfQNAAAAYAAJ Google (NYPL)] [https://archive.org/details/newexposition00fichuoft IA (UToronto)]\n* On the Nature of the Scholar (1845). Alternative translation of The Vocation of the Scholar. (Tr. William Smith.) [https://archive.org/details/onthenatureofthe00fichuoft IA (UToronto)]\n* The Popular Works of Johann Gottlieb Fichte (1848–49). (Tr. William Smith.)\n** Volume 1, 1848. [https://archive.org/details/popularworksjoh00fichgoog Google (Oxford)] [https://archive.org/details/popularfichte01fichuoft IA (UToronto)] 4th ed., 1889. [https://archive.org/details/popularworksofjo01fich IA (UIllinois)] [https://archive.org/details/popularworks01fichuoft IA (UToronto)]\n** Volume 2, 1849. [https://archive.org/details/thepopularworkso00fichuoft IA (UToronto)] 4th ed., 1889. [https://archive.org/details/popularworksjoh01fichgoog Google (Stanford)] [https://archive.org/details/popularworksofjo02fich IA (UIllinois)] [https://archive.org/details/popularworks02fichuoft IA (UToronto)]\n* The Science of Ethics as Based on the Science of Knowledge (1897). (Tr. A. E. Kroeger.) [https://archive.org/details/scienceethicsas00fichgoog Google (UMich)] [https://archive.org/details/scienceofethics00fichuoft IA (UToronto)]\n* The Science of Knowledge (1889). Alternative translation of Foundations of the Entire Science of Knowledge. (Tr. A. E. Kroeger.) [https://archive.org/details/thescienceofknow00fichuoft IA (UToronto)]\n* The Science of Rights (1889). (Tr. A. E. Kroeger.) [https://archive.org/details/scienceofrights00fichiala IA (UCal)]\n* (German) Versuch einer Critik aller Offenbarung (Königsberg, 1792; 2nd ed. 1793). [http://gallica.bnf.fr/ark:/12148/bpt6k64806f Gallica] [https://books.google.com/books?id=r78IAAAAQAAJ Google (Oxford)] [https://archive.org/details/versucheinerkri00fichgoog Google (Oxford)]\n* The Vocation of Man (1848). (Tr. William Smith.) [https://archive.org/details/vocationmantrby00fichgoog Google (Oxford)] 1910. [https://books.google.com/books?id=J2o_AAAAIAAJ Google (UCal)]\n* The Vocation of the Scholar (1847). (Tr. William Smith.) [https://archive.org/details/vocationofschola00fich IA (UCal)]\n* The Way Towards the Blessed Life (1849). (Tr. William Smith.) [https://archive.org/details/waytowardsbless00fichgoog Google (Oxford)]\n* [http://ecmd.nju.edu.cn/UploadFile/9/4176/ncp07sc.doc \"On the Foundation of Our Belief in a Divine Government of the Universe\"]; alternative translation of \"On the Ground of Our Belief in a Divine World-Governance\" (trans. anon. n.d.).\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Johann Gottlieb Fichte" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12007" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Johann Gottlieb Fichte (;[http://dictionary.reference.com/browse/fichte \"Fichte\"]. Random House Webster's Unabridged Dictionary.; May 19, 1762 – January 27, 1814), was a German philosopher who became a founding figure of the philosophical movement known as German idealism, which developed from the theoretical and ethical writings of Immanuel Kant.  Recently, philosophers and scholars have begun to appreciate Fichte as an important philosopher in his own right due to his original insights into the nature of self-consciousness or self-awareness. Fichte was also the originator of thesis–antithesis–synthesis,\"Review of Aenesidemus\" ([http://www.gleichsatz.de/b-u-t/trad/fichte/jgf-aenesidemus.html \"Rezension des Aenesidemus\"], ', February 11–12, 1794). Trans. Daniel Breazeale. In  (See also: FTP, p. 46; Breazeale 1980–81, pp. 545–68; Breazeale and Rockmore 1994, p. 19; Breazeale 2013, pp. 36–37; Waibel, Breazeale, Rockmore 2010, p. 157: \"Fichte believes that the I must be grasped as the unity of synthesis and analysis.\") an idea that is often erroneously attributed to Hegel.Robert C. Solomon, In the Spirit of Hegel, Oxford University Press, p. 23. Like Descartes and Kant before him, Fichte was motivated by the problem of subjectivity and consciousness. Fichte also wrote works of political philosophy; he has a reputation as one of the fathers of German nationalism.\n\nBiography\n\nOrigins\n\nFichte was born in Rammenau, Upper Lusatia. The son of a ribbon weaver, he came of peasant stock which had lived in the region for many generations. The family was noted in the neighborhood for its probity and piety. Christian Fichte, Johann Gottlieb's father, married somewhat above his station. It has been suggested that a certain impatience which Fichte himself displayed throughout his life was an inheritance from his mother.\n\nYoung Fichte received the rudiments of his education from his father. He showed remarkable ability from an early age, and it was owing to his reputation among the villagers that he gained the opportunity for a better education than he otherwise would have received. The story runs that the Freiherr von Militz, a country landowner, arrived too late to hear the local pastor preach. He was, however, informed that a lad in the neighborhood would be able to repeat the sermon practically verbatim. As a result, the baron took the lad into his protection, which meant that he paid his tuition.\n\nEarly schooling\n\nFichte was placed in the family of Pastor Krebel at Niederau near Meissen and there received thorough grounding in the classics. From this time onward, Fichte saw little of his parents. In October 1774, he was attending the celebrated foundation-school at Pforta near Naumburg. This school is associated with the names of Novalis, August Wilhelm Schlegel, Friedrich Schlegel and Nietzsche. The spirit of the institution was semi-monastic and, while the education given was excellent in its way, it is doubtful whether there was enough social life and contact with the world for a pupil of Fichte's temperament and antecedents. Perhaps his education strengthened a tendency toward introspection and independence, characteristics which appear strongly in his doctrines and writings.\n\nTheological studies and private tutoring\n\nIn 1780, he began study at the theology seminary of University of Jena. He was transferred a year later to study at the Leipzig University. Fichte seems to have supported himself at this period of bitter poverty and hard struggle. Freiherr von Militz continued to support him, but when he died in 1784, Fichte had to end his studies prematurely, without completing his degree.\n\nDuring the years 1784 to 1788, he supported himself in a precarious way as tutor in various Saxon families. In early 1788, he returned to Leipzig in the hope of finding a better employment, but eventually he had to settle for a much less promising position with the family of an innkeeper in Zurich.Anthony J. La Vopa, Fichte: The Self and the Calling of Philosophy, 1762-1799, Cambridge University Press, 2001, p. 26. He lived in Zurich for the next two years (1788–1790), which was a time of great contentment for him. There he met his future wife, Johanna Rahn,She happened to be the niece of the famous poet F. G. Klopstock. and Johann Heinrich Pestalozzi. There he also became in 1793 a member of the Freemasonry lodge \"Modestia cum Libertate\" with which Johann Wolfgang Goethe was also connected.Imhof, Gottlieb (1959). Kleine Werklehre der Freimaurerei. I. Das Buch des Lehrlings. 5th ed. Lausanne: Alpina, p. 42.Lawatsch, Hans-Helmut (1991). \"Fichte und die hermetische Demokratie der Freimaurer.\" In: Hammacher, Klaus, Schottky, Richard, Schrader, Wolfgang H. and Daniel Breazeale (eds.). Sozialphilosophie. Fichte-Studien, Vol. 3. Amsterdam-Atlanta: Editions Rodopi, p. 204, . In the spring of 1790, he became engaged to Johanna.Anthony J. La Vopa, Fichte: The Self and the Calling of Philosophy, 1762-1799, Cambridge University Press, 2001, p. 151. In the summer of 1790, Fichte began to study the works of Kant, but this occurred initially because one of his students wanted to know about them. They had a lasting effect on the trajectory of his life and thought. While he was assimilating the Kantian philosophy and preparing to develop it, fate dealt him a blow: the Rahn family had suffered financial reverses, and his impending marriage had to be postponed.\n\nKant\n\nFrom Zurich, Fichte returned to Leipzig in May 1790. In the spring of 1791, he obtained a tutorship at Warsaw in the house of a Polish nobleman. The situation, however, quickly proved disagreeable and he was released. He then got a chance to see Kant at Königsberg. After a disappointing interview on July 4 of the same year, he shut himself in his lodgings and threw all his energies into the composition of an essay which would compel Kant's attention and interest. This essay, completed in five weeks, was the Versuch einer Critik aller Offenbarung (Attempt at a Critique of All Revelation, 1792). In this book Fichte investigated the connections between divine revelation and Kant's critical philosophy. The first edition of the book was published without Kant or Fichte's knowledge, moreover without Fichte's name or signed preface.  It was thus mistakenly thought to be a new work by Kant himself.Traditionally, it has been assumed that either the omission was an accident or a deliberate attempt by the publisher to move copies. In either case, Fichte did not plan it and in fact only heard of the accident much later.  He writes to his fiancée: \"Why did I have to have such utterly strange, excellent, unheard-of good luck?\" See Garrett Green's Introduction to Attempt at a Critique of All Revelation. Cambridge: Cambridge University Press, 1978. Reviews were assuming Kant was the author when Kant cleared the confusion and openly praised the work and author. Fichte's reputation skyrocketed as many intellectuals of the day were of the opinion that it was \"the most shocking and astonishing news... [since] nobody but Kant could have written this book. This amazing news of a third sun in the philosophical heavens has set me into such confusion\".Letter from Jens Baggeson to Karl Reinhold. Quoted in Editor's Introduction to Fichte, Early Philosophical Writings. London: Cornell University Press, 1988.\n\nJena\n\nIn October 1793, he was married in Zurich, where he remained the rest of the year. Stirred by the events and principles of the French Revolution, he wrote and anonymously published two pamphlets which led to him being seen as a devoted defender of liberty of thought and action and an advocate of political changes. In December of the same year, he received an invitation to fill the position of extraordinary professor of philosophy at the University of Jena. He accepted and began his lectures in May of the next year. With extraordinary zeal, he expounded his system of \"transcendental idealism\". His success was immediate. He seems to have excelled as a lecturer because of the earnestness and force of his personality. These lectures were later published under the title The Vocation of the Scholar (Einige Vorlesungen über die Bestimmung des Gelehrten). He gave himself up to intense production, and a succession of works soon appeared.\n\nAtheism Dispute\n\nAfter weathering a couple of academic storms, he was finally dismissed from Jena in 1799 as a result of a charge of atheism. He was accused of atheism in 1798 after publishing his essay \"Ueber den Grund unsers Glaubens an eine göttliche Weltregierung\" (\"On the Ground of Our Belief in a Divine World-Governance\"), which he had written in response to Friedrich Karl Forberg's essay \"Development of the Concept of Religion,\" in his Philosophical Journal. For Fichte, God should be conceived primarily in moral terms: \"The living and efficaciously acting moral order is itself God. We require no other God, nor can we grasp any other\" (\"On the Ground of Our Belief in a Divine World-Governance\").\n\nFichte's intemperate \"Appeal to the Public\" (\"Appellation an das Publikum\", 1799) provoked F. H. Jacobi to publish an open letter to Fichte, in which he equated philosophy in general and Fichte's transcendental philosophy in particular with nihilism.\n\nBerlin\n\nSince all the German states except Prussia had joined in the cry against him, he was forced to go to Berlin. There he associated himself with the Schlegels, Schleiermacher, Schelling and Tieck.\n\nIn April 1800, through the introduction of Hungarian writer Ignaz Aurelius Fessler, he was initiated into Freemasonry in the Lodge Pythagoras of the Blazing Star where he was elected minor warden. At first Fichte was a warm admirer of Fessler, and was disposed to aid him in his proposed Masonic reform. But later he became Fessler's bitter opponent. Their controversy attracted much attention among Freemasons. Fichte presented two lectures on the philosophy of Masonry during the same period as part of his work on the development of various higher degrees for the lodge in Berlin.Glenn Alexander Magee, Hegel and the Hermetic Tradition, Cornell University Press, 2008, p. 55. A certain Johann Karl Christian Fischer, a high official of the Grand Orient, published those lectures in 1802/03 in two volumes under the title Philosophy of Freemasonry: Letters to Konstant (Philosophie der Maurerei. Briefe an Konstant), where Konstant referred to a fictitious non-Mason.\n\nIn November 1800, Fichte published The Closed Commercial State: A Philosophical Sketch as an Appendix to the Doctrine of Right and an Example of a Future Politics (Der geschlossene Handelsstaat. Ein philosophischer Entwurf als Anhang zur Rechtslehre und Probe einer künftig zu liefernden Politik), a philosophical statement of his property theory, a historical analysis of European economic relations, and a political proposal for reforming them.Isaac Nakhimovsky, The Closed Commercial State: Perpetual Peace and Commercial Society from Rousseau to Fichte, Princeton University Press, 2011, p. 6.\n\nIn 1805, he was appointed to a professorship in Erlangen. The disaster at Jena in 1806, in which Napoleon completely crushed the Prussian army, drove him to Königsberg for a time, but he returned to Berlin in 1807 and continued his literary activity.\n\nThe deplorable situation of Germany stirred him to the depths and led him to deliver the famous Addresses to the German Nation (Reden an die deutsche Nation, 1808) which guided the uprising against Napoleon. He became a professor of the new university at Berlin founded in 1810. By the votes of his colleagues Fichte was unanimously elected its rector in the succeeding year. But, once more, his impetuosity and reforming zeal led to friction, and he resigned in 1812. The campaign against Napoleon began, and the hospitals at Berlin were soon full of patients. Fichte's wife devoted herself to nursing and caught a virulent fever. Just as she was recovering, he himself was stricken down. He died of typhus at the age of 51.\n\nHis son, Immanuel Hermann Fichte (18 July 1796 – 8 August 1879), also made contributions to philosophy.\n\nFichte's philosophy\n\nIn mimicking Kant's difficult style, his critics argued that Fichte produced works that were barely intelligible. \"He made no hesitation in pluming himself on his great skill in the shadowy and obscure, by often remarking to his pupils, that 'there was only one man in the world who could fully understand his writings; and even he was often at a loss to seize upon his real meaning.'\"Robert Blakely, History of the Philosophy of Mind, Vol. IV, p. 114, London: Longmans, 1850 On the other hand, Fichte himself acknowledged the difficulty of his writings, but argued that his works were clear and transparent to those who made the effort to think without preconceptions and prejudices.\n\nFichte did not endorse Kant's argument for the existence of noumena, of \"things in themselves\", the supra-sensible reality beyond the categories of direct human perception. Fichte saw the rigorous and systematic separation of \"things in themselves\" (noumena) and things \"as they appear to us\" (phenomena) as an invitation to skepticism. Rather than invite such skepticism, Fichte made the radical suggestion that we should throw out the notion of a noumenal world and instead accept the fact that consciousness does not have a grounding in a so-called \"real world\". In fact, Fichte achieved fame for originating the argument that consciousness is not grounded in anything outside of itself. The phenomenal world as such, arises from self-consciousness; the activity of the ego; and moral awareness. His student (and critic), Arthur Schopenhauer, wrote:\n\nSøren Kierkegaard was also a student of the writings of Fichte: \n\nCentral theory\n\nIn his work Foundations of Natural Right (1797), Fichte argued that self-consciousness was a social phenomenon — an important step and perhaps the first clear step taken in this direction by modern philosophy. A necessary condition of every subject's self-awareness, for Fichte, is the existence of other rational subjects. These others call or summon (fordern auf) the subject or self out of its unconsciousness and into an awareness of itself as a free individual.\n\nFichte's account proceeds from the general principle that the I must set itself up as an individual in order to set itself up at all, and that in order to set itself up as an individual it must recognize itself as it were to a calling or summons (Aufforderung) by other free individual(s) — called, moreover, to limit its own freedom out of respect for the freedom of the other. The same condition applied and applies, of course, to the other(s) in its development. Hence, mutual recognition (gegenseitig anerkennen) of rational individuals turns out to be a condition necessary for the individual 'I' in general.Fichte, J. G. (2000), Foundations of Natural Right, according to the Principles of the Wissenschaftslehre, ed. F. Neuhouser, trans. M. Baur. Cambridge: Cambridge University Press, p. 42.Allen W. Wood, The Free Development of Each: Studies on Reason, Right, and Ethics in Classical German Philosophy, Oxford University Press, 2014, p. 207: \"The whole point of the summons, in fact, is that it is what first makes our individuality possible for us, through presenting us with the concept of our own individual free action in the form of an object of our consciousness.\" This argument for intersubjectivity is central to the conception of selfhood developed in the Foundations of the Science of KnowledgeAlso translated as Foundations of the Entire Science of Knowledge. (Grundlage der gesamten Wissenschaftslehre, 1794/1795). In Fichte's view consciousness of the self depends upon resistance or a check by something that is understood as not part of the self yet is not immediately ascribable to a particular sensory perception.  In his later 1796–1799 lectures (his Nova methodo), Fichte incorporated it into his revised presentation of the very foundations of his system, where the summons takes its place alongside original feeling, which takes the place of the earlier Anstoss (see below) as both a limit upon the absolute freedom of the I and a condition for the positing of the same.\n\nThe I (Das Ich) itself sets this situation up for itself (it posits itself). To 'set' (setzen) does not mean to 'create' the objects of consciousness. The principle in question simply states that the essence of an I lies in the assertion of one's own self-identity, i.e., that consciousness presupposes self-consciousness. Such immediate self-identity, however, cannot be understood as a psychological fact, nor as an act or accident of some previously existing substance or being. It is an action of the I, but one that is identical with the very existence of this same I. In Fichte's technical terminology, the original unity of self-consciousness is to be understood both as an action and as the product of the same I, as a \"fact and/or act\" (Thathandlung; Modern German: Tathandlung), a unity that is presupposed by and contained within every fact and every act of empirical consciousness, although it never appears as such therein.\n\nThe 'I' must posit (setzen) itself in order to be an 'I' at all; but it can posit itself only insofar as it posits itself (sets itself up) as limited. Moreover, it cannot even posit for itself its own limitations, in the sense of producing or creating these limits. The finite I cannot be the ground of its own passivity. Instead, for Fichte, if the 'I' is to posit itself off at all, it must simply discover itself to be limited, a discovery that Fichte characterizes as an \"impulse,\"Breazeale 2013, p. vii. \"repulse,\"Nicholas Adams, George Pattison, Graham Ward (eds.), The Oxford Handbook of Theology and Modern European Thought, Oxford University Press, 2013, p. 129. or \"resistance\"Jeffrey Reid, The Anti-Romantic: Hegel Against Ironic Romanticism, A&C Black, 2014, p. 26. (Anstoss; Modern German: Anstoß) to the free practical activity of the I. Such an original limitation of the I is, however, a limit for the I only insofar as the I posits it out as a limit. The I does this, according to Fichte's analysis, by positing its own limitation, first, as only a feeling, then as a sensation, then as an intuition of a thing, and finally as a summons of another person. The Anstoss thus provides the essential impetus that first posits in motion the entire complex train of activities that finally result in our conscious experience both of ourselves and others as empirical individuals and of the world around us.\n\nThough Anstoss plays a similar role as the thing in itself does in Kantian philosophy, unlike Kant, Fichte's Anstoss is not something foreign to the I. Instead, it denotes the I's original encounter with its own finitude. Rather than claim that the Not-I is the cause or ground of the Anstoss, Fichte argues that non-I is set up by the I precisely in order to explain to itself the Anstoss, that is, in order to become conscious of Anstoss.\n\nThough the Wissenschaftslehre demonstrates that such an Anstoss must occur if self-consciousness is to come about, it is quite unable to deduce or to explain the actual occurrence of such an Anstoss — except as a condition for the possibility of consciousness. Accordingly, there are strict limits to what can be expected from any a priori deduction of experience, and this limitation, for Fichte, equally applies to Kant's transcendental philosophy.\n\nAccording to Fichte, transcendental philosophy can explain that the world must have space, time, and causality, but it can never explain why objects have the particular sensible properties they happen to have or why I am this determinate individual rather than another. This is something that the I simply has to discover at the same time that it discovers its own freedom, and indeed, as a condition for the latter.\n\nDieter Henrich (1966) proposed that Fichte was able to move beyond a \"reflective theory of consciousness\". According to Fichte the self must already have some prior acquaintance with itself, independent of the act of reflection (\"no object comes to consciousness except under the condition that I am aware of myself, the conscious subject [jedes Object kommt zum Bewusstseyn lediglich unter der Bedingung, dass ich auch meiner selbst, des bewusstseyenden Subjects mir bewusst sey]\".Fichte, J. G., Versuch einer neuen Darstellung der Wissenschaftslehre (1797/1798): II.2; Gesamtausgabe I/4:274–275. This idea is what Henrich called Fichte's original insight.Dieter Henrich, \"Fichte's Original Insight\", Contemporary German Philosophy 1 (1982[1966]), ed. by Darrel E. Christensen et al., pp. 15–52 (translation of Henrich, Dieter (1966), \"Fichtes ursprüngliche Einsicht\", in: Subjektivität und Metaphysik. Festschrift für Wolfgang Cramer edited by D. Henrich und H. Wagner, Frankfurt/M., pp. 188–232). Henrich's article is an analysis of the following three presentations of the Wissenschaftslehre: Grundlage der gesamten Wissenschaftslehre (Foundations of the Science of Knowledge, 1794/1795), Versuch einer neuen Darstellung der Wissenschaftslehre (An Attempt a New Presentation of the Wissenschaftslehre, 1797/1798), and Darstellung der Wissenschaftslehre (Presentation of the Wissenschaftslehre, 1801).\n\nOther works\n\nFichte also developed a theory of the state based on the idea of self-sufficiency. In his mind, the state should control international relations, the value of money, and remain an autarky.  Because of this necessity to have relations with other rational beings in order to achieve consciousness, Fichte writes that there must be a 'relation of right', in which there is a mutual recognition of rationality by both parties.\n\nNationalism\n\nBetween December 1807 and March 1808, Fichte gave a series of lectures concerning the \"German nation\" and its culture and language, projecting the kind of national education he hoped would raise it from the humiliation of its defeat at the hands of the French.  Having been a supporter of Revolutionary France, Fichte became disenchanted by 1804 as Napoleon's armies advanced through Europe, occupying German territories, striping them of their raw materials and subjugating them to foreign rule. Consequently, Fichte came to believe Germany would be responsible to carry the virtues of the French Revolution into the future. Furthermore, his nationalism was not aroused by Prussia military defeat and humiliation, for these had not yet occurred, but resulted from devotion to his own humanitarian philosophy. Through disappointment in the French he turned to the German \"nation\" as the instrument of fulfilling it. These lectures, entitled the Addresses to the German Nation, coincided with a period of reform in the Prussian government, under the chancellorship of Baron vom Stein. The Addresses display Fichte's interest during that period in language and culture as vehicles of human spiritual development. Fichte built upon the earlier ideas of Herder and attempted to unite them with his more systematic approach. The aim of the German nation, according to Fichte, was to \"found an empire of spirit and reason, and to annihilate completely the crude physical force that rules of the world.\" Like Herder's German nationalism, Fichte's was wholly cultural, and grounded in the aesthetic, literary, and moral.\n\nThe nationalism propounded by Fichte in the Addresses would be appealed to over a century later by the Nazi Party in Germany, which sought in Fichte a forerunner to its own nationalist ideology. Like Nietzsche, the association of Fichte with the Nazi regime came to colour readings of Fichte's German nationalism in the post-war period. This reading of Fichte was often bolstered through reference to an unpublished letter from 1793, Contributions to the Correction of the Public's Judgment concerning the French Revolution, wherein Fichte expressed anti-semitic sentiments, such as arguing against extending civil rights to Jews and calling them a \"state within a state\" that could \"undermine\" the German nation.Gesamtausgabe, I/1, pp. 292–293 However, attached to the letter is a footnote in which Fichte provides an impassioned plea for permitting Jews to practice their religion without hindrance. Furthermore, the final act of Fichte's academic career was to resign as rector of Humboldt University in protest when his colleagues refused to punish the harassment of Jewish students. While recent scholarship has sought to dissociate Fichte's writings on nationalism with his adoption by the Nazi Party, the association continues to blight Fichte's legacy.\n\nWomen\n\nFichte argued that \"active citizenship, civic freedom and even property rights should be withheld from women, whose calling was to subject themselves utterly to the authority of their fathers and husbands.\"Christopher M. Clark, Iron Kingdom: The Rise and Downfall of Prussia, 1600-1947 (Harvard University Press, 2006: ), p. 377.\n\nFinal period in Berlin\n\nFichte gave a wide range of public and private lectures in Berlin from the last decade of his life. These form some of his best known work, and are the basis of a revived German-speaking scholarly interest in his work.Breazeale, Dan, \"Johann Gottlieb Fichte\", The Stanford Encyclopedia of Philosophy (Spring 2012 Edition), Edward N. Zalta (ed.), URL: .\n\nThe lectures include two works from 1806. In The Characteristics of the Present Age (Die Grundzüge des gegenwärtigen Zeitalters), Fichte outlines his theory of different historical and cultural epochs. His mystic work The Way Towards the Blessed Life (Die Anweisung zum seligen Leben oder auch die Religionslehre) gave his fullest thoughts on religion. In 1808 he gave a series of speeches in French-occupied Berlin, Addresses to the German Nation.\n\nIn 1810, the new University of Berlin was set up, designed along lines put forward by Wilhelm von Humboldt. Fichte was made its rector and also the first Chair of Philosophy. This was in part because of educational themes in the Addresses, and in part because of his earlier work at Jena University.\n\nFichte lectured on further versions of his Wissenschaftslehre. Of these, he only published a brief work from 1810, The Science of Knowledge in its General Outline (Die Wissenschaftslehre, in ihrem allgemeinen Umrisse dargestellt; also translated as Outline of the Doctrine of Knowledge). His son published some of these thirty years after his death.\n\nMost only became public in the last decades of the twentieth century, in his collected works.Gesamtausgabe der Bayerischen Akademie der Wissenschaften, approx. 40 volumes. Edited by Reinhard Lauth, Erich Fuchs, Hans Gliwitzky, Ives Radrizzani, Günter Zöller, et al., Stuttgart-Bad Cannstatt 1962. This included reworked versions of the Doctrine of Science (Wissenschaftslehre, 1810–1813), The Science of Rights (Das System der Rechtslehre, 1812), and The Science of Ethics as Based on the Science of Knowledge (Das System der Sittenlehre nach den Principien der Wissenschaftslehre, 1812; 1st ed. 1798).\n\nBibliography\n\nSelected works in German\n\nWissenschaftslehre\n\n* Ueber den Begriff der Wissenschaftslehre oder der sogenannten Philosophie (1794)\n* Grundlage der gesamten Wissenschaftslehre (1794/1795)\n* Wissenschaftslehre nova methodo (1796–1799: \"Halle Nachschrift,\" 1796/1797 and \"Krause Nachschrift,\" 1798/1799)\n* Versuch einer neuen Darstellung der Wissenschaftslehre (1797/1798)\n* Darstellung der Wissenschaftslehre (1801)\n* Die Wissenschaftslehre (1804, 1812, 1813)\n* Die Wissenschaftslehre, in ihrem allgemeinen Umrisse dargestellt (1810)\n\nOther works in German\n\n* Versuch einer Critik aller Offenbarung (1792)\n* Beitrag zur Berichtigung der Urteile des Publikums über die französische Revolution (1793)\n* Einige Vorlesungen über die Bestimmung des Gelehrten (1794)\n* Grundlage des Naturrechts (1796)\n* Das System der Sittenlehre nach den Principien der Wissenschaftslehre (1798)\n* \"Ueber den Grund unsers Glaubens an eine göttliche Weltregierung\" (1798)\n* \"Appellation an das Publikum über die durch Churf. Sächs. Confiscationsrescript ihm beigemessenen atheistischen Aeußerungen. Eine Schrift, die man zu lesen bittet, ehe man sie confsicirt\" (1799)\n* Der geschlossene Handelsstaat. Ein philosophischer Entwurf als Anhang zur Rechtslehre und Probe einer künftig zu liefernden Politik (1800)\n* Die Bestimmung des Menschen (1800)\n* Friedrich Nicolais Leben und sonderbare MeinungenEnglish translation: Friedrich Nicolai's Life and Strange Opinions. (1801)\n* Philosophie der Maurerei. Briefe an Konstant (1802/03)\n* Die Grundzüge des gegenwärtigen Zeitalters (1806)\n* Die Anweisung zum seligen Leben oder auch die Religionslehre (1806)\n* Reden an die deutsche Nation (1807/1808)\n* Das System der Rechtslehre (1812)\n\nCorrespondence\n\n* Jacobi an Fichte, German Text (1799/1816), with Introduction and Critical Apparatus by Marco Ivaldo and Ariberto Acerbi (Introduction, German Text, Italian Translation, 3 Appendices with Jacobi's and Fichte's complementary Texts, Philological Notes, Commentary, Bibliography, Index): Istituto Italiano per gli Studi Filosofici Press, Naples 2011, .\n\nCollected works in German\n\nThe new standard edition of Fichte's works in German, which supersedes all previous editions, is the Gesamtausgabe (\"Collected Works\" or \"Complete Edition\", commonly abbreviated as GA), prepared by the Bavarian Academy of Sciences: Gesamtausgabe der Bayerischen Akademie der Wissenschaften, 42 volumes, edited by Reinhard Lauth, Hans Gliwitzky, Erich Fuchs and Peter Schneider, Stuttgart-Bad Cannstatt: Frommann-Holzboog, 1962–2012.\n\nIt is organized into four parts:\n*Part I: Published Works\n*Part II: Unpublished Writings\n*Part III: Correspondence\n*Part IV: Lecture Transcripts\n\nFichte's works are quoted and cited from GA, followed by a combination of Roman and Arabic numbers, indicating the series and volume, respectively, and the page number(s).\n\nAnother edition is Johann Gottlieb Fichtes sämmtliche Werke (abbrev. SW), ed. I. H. Fichte. Berlin: de Gruyter, 1971.\n\nSelected works in English\n\n* Concerning the Conception of the Science of Knowledge Generally (Ueber den Begriff der Wissenschaftslehre oder der sogenannten Philosophie, 1794), translated by Adolph Ernst Kroeger. In The Science of Knowledge, pp. 331–336. Philadelphia: J.B. Lippincott & Co., 1868. Rpt., London: Trübner & Co., 1889.\n* Attempt at a Critique of All Revelation. Trans. Garrett Green. New York: Cambridge University Press, 1978. (Translation of Versuch einer Critik aller Offenbarung, 1st ed. 1792, 2nd ed. 1793.)\n* Early Philosophical Writings. Trans. and ed. Daniel Breazeale. Ithaca: Cornell University Press, 1988. (Contains Selections from Fichte's Writings and Correspondence from the Jena period, 1794–1799).\n* Foundations of the Entire Science of Knowledge. Translation of: Grundlage der gesammten Wissenschaftslehre (1794/95, 2nd ed. 1802), Fichte's first major exposition of the Wissenschaftlehre. In: The Science of Knowledge, trans. and ed. Peter Heath and John Lachs. Cambridge: Cambridge University Press, 1982.\n* Foundations of Natural Right. Trans. Michael Baur. Ed. Frederick Neuhouser. Cambridge: Cambridge University Press, 2000. (Translation of Grundlage des Naturrechts, 1796/97.)\n* Foundations of Transcendental Philosophy (Wissenschaftslehre) Nova Methodo [FTP]. Trans. and ed. Daniel Breazeale. Ithaca, NY: Cornell University Press, 1992. (Translation of Wissenschaftslehre nova methodo, 1796–1799.)\n* The System of Ethics according to the Principles of the Wissenschaftslehre (translation of Das System der Sittenlehre nach den Principien der Wissenschaftslehre, 1798). Ed. and trans. Daniel Breazeale and Günter Zöller. Cambridge University Press, 2005.\n* Introductions to the Wissenschaftslehre and Other Writings. Trans. and ed. Daniel Breazeale. Indianapolis, and Cambridge: Hackett, 1994. (Contains mostly writings from the late Jena period, 1797–1799.)\n* The Vocation of Man, 1848. Trans. Peter Preuss. Indianapolis. (Translation of Die Bestimmung des Menschen, 1800.)\n* [https://openlibrary.org/books/OL22896350M/The_vocation_of_the_scholar The Vocation of the Scholar], 1847. (Translation of Einige Vorlesungen über die Bestimmung des Gelehrten, 1794.)\n* A Crystal Clear Report to the General Public Concerning the Actual Essence of the Newest Philosophy: An Attempt to Force the Reader to Understand. Trans. John Botterman and William Rash. In: Philosophy of German Idealism, pp. 39–115. (Translation of Sonnenklarer Bericht an das grössere Publikum über das Wesen der neuesten Philosophie, 1801.)\n* The Science of Knowing: J. G. Fichte's 1804 Lectures on the Wissenschaftslehre. Ed. and trans. Walter W. Wright. Albany, NY: State University of New York Press. 2005.\n* Outline of the Doctrine of Knowledge, 1810 (Translation of Die Wissenschaftslehre, in ihrem allgemeinen Umrisse dargestellt published in From The Popular Works of Johann Gottlieb Fichte, Trubner and Co., 1889; trans. William Smith.)\n* [https://archive.org/details/onthenatureofthe00fichuoft On the Nature of the Scholar], 1845 (Translation of Ueber das Wesen des Gelehrten, 1806.)\n* Characteristics of the Present Age (Die Grundzüge des gegenwärtigen Zeitalters, 1806). In: The Popular Works of Johann Gottlieb Fichte, 2 vols., trans. and ed. William Smith. London: Chapman, 1848/49. Reprint, London: Thoemmes Press, 1999.\n* Addresses to the German Nation (Reden an die deutsche Nation, 1808), ed. and trans. Gregory Moore. Cambridge University Press, 2008.\n* The Philosophical Rupture Between Fichte and Schelling: Selected Texts and Correspondence (1800-1802). Trans. and eds. Michael G. Vater and David W. Wood. Albany, NY: State University of New York Press, 2012. Includes the following texts by Johann Gottlieb Fichte: Correspondence with F.W.J. Schelling (1800–1802); \"Announcement\" (1800); extract from \"New Version of the Wissenschaftslehre\" (1800); \"Commentaries on Schelling's System of Transcendental Idealism and Presentation of My System of Philosophy\" (1800–1801).\n\nWorks online in English\n\n* J.G. Fichte. \"The Wissenschaftslehre is Mathematics\" (\"Announcement\", 1800/1801). *  [https://www.academia.edu/12491872/J.G._Fichte._The_Wissenschaftslehre_is_Mathematics_1800_1801_]\n* Addresses to the German Nation (1922). (Trs. R. F. Jones and G. H. Turnbull.) [https://archive.org/details/addressestothege00fichuoft IA (UToronto)]\n* The Destination of Man (1846). Alternative translation of The Vocation of Man. (Tr. Mrs. Percy Sinnett.) [https://archive.org/details/thedestinationof00fichuoft IA (UToronto)]\n* Doctrine de la science (Paris, 1843). French translation of Foundations of the Entire Science of Knowledge. [https://archive.org/details/doctrinedelasci00grimgoog Google (Harvard)] [https://archive.org/details/doctrinedelasci01fichgoog Google (Oxford)] [https://archive.org/details/doctrinedelasci00fichgoog Google (UMich)] \n* Johann Gottlieb Fichte’s Popular Works (1873). (Tr. William Smith.) [https://archive.org/details/johanngottlieb00fichuoft IA (UToronto)]\n* New Exposition of the Science of Knowledge (1869). Translation of Versuch einer neuen Darstellung der Wissenschaftslehre. (Tr. A. E. Kroeger.) [https://books.google.com/books?id7C8RAAAAYAAJ Google (Harvard)] [https://books.google.com/books?id\nqfQNAAAAYAAJ Google (NYPL)] [https://archive.org/details/newexposition00fichuoft IA (UToronto)]\n* On the Nature of the Scholar (1845). Alternative translation of The Vocation of the Scholar. (Tr. William Smith.) [https://archive.org/details/onthenatureofthe00fichuoft IA (UToronto)]\n* The Popular Works of Johann Gottlieb Fichte (1848–49). (Tr. William Smith.)\n** Volume 1, 1848. [https://archive.org/details/popularworksjoh00fichgoog Google (Oxford)] [https://archive.org/details/popularfichte01fichuoft IA (UToronto)] 4th ed., 1889. [https://archive.org/details/popularworksofjo01fich IA (UIllinois)] [https://archive.org/details/popularworks01fichuoft IA (UToronto)]\n** Volume 2, 1849. [https://archive.org/details/thepopularworkso00fichuoft IA (UToronto)] 4th ed., 1889. [https://archive.org/details/popularworksjoh01fichgoog Google (Stanford)] [https://archive.org/details/popularworksofjo02fich IA (UIllinois)] [https://archive.org/details/popularworks02fichuoft IA (UToronto)]\n* The Science of Ethics as Based on the Science of Knowledge (1897). (Tr. A. E. Kroeger.) [https://archive.org/details/scienceethicsas00fichgoog Google (UMich)] [https://archive.org/details/scienceofethics00fichuoft IA (UToronto)]\n* The Science of Knowledge (1889). Alternative translation of Foundations of the Entire Science of Knowledge. (Tr. A. E. Kroeger.) [https://archive.org/details/thescienceofknow00fichuoft IA (UToronto)]\n* The Science of Rights (1889). (Tr. A. E. Kroeger.) [https://archive.org/details/scienceofrights00fichiala IA (UCal)]\n* (German) Versuch einer Critik aller Offenbarung (Königsberg, 1792; 2nd ed. 1793). [http://gallica.bnf.fr/ark:/12148/bpt6k64806f Gallica] [https://books.google.com/books?id=r78IAAAAQAAJ Google (Oxford)] [https://archive.org/details/versucheinerkri00fichgoog Google (Oxford)]\n* The Vocation of Man (1848). (Tr. William Smith.) [https://archive.org/details/vocationmantrby00fichgoog Google (Oxford)] 1910. [https://books.google.com/books?id=J2o_AAAAIAAJ Google (UCal)]\n* The Vocation of the Scholar (1847). (Tr. William Smith.) [https://archive.org/details/vocationofschola00fich IA (UCal)]\n* The Way Towards the Blessed Life (1849). (Tr. William Smith.) [https://archive.org/details/waytowardsbless00fichgoog Google (Oxford)]\n* [http://ecmd.nju.edu.cn/UploadFile/9/4176/ncp07sc.doc \"On the Foundation of Our Belief in a Divine Government of the Universe\"]; alternative translation of \"On the Ground of Our Belief in a Divine World-Governance\" (trans. anon. n.d.).\n\nNotes. Johann Gottlieb Fichte. http://en.wikipedia.org/?curid=12007."
  }
}
