{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7810",
  "eid" : "e37bf1c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778461404,
  "textBody" : "The Church of the Holy Sepulchre ( Kaneesatu al-Qeyaamah;  Naos tes Anastaseos;  Surb Harut'yan tač̣ar; ; also called the Church of the Resurrection or Church of the Anastasis by Orthodox Christians) is a church in the Christian Quarter of the Old City of Jerusalem. The church contains, according to traditions dating back to at least the fourth century, the two holiest sites in Christianity: the site where Jesus of Nazareth was crucified, at a place known as \"Calvary\" or \"Golgotha\", and Jesus's empty tomb, where he is said to have been buried and resurrected. The tomb is enclosed by the 19th-century shrine, called the Aedicule (Edicule). The Status Quo, a 150-year-old understanding between religious communities, applies to the site.\n\nWithin the church proper are the last four (or, by some definitions, five) Stations of the Via Dolorosa, representing the final episodes of Jesus' Passion. The church has been a major Christian pilgrimage destination since its creation in the fourth century, as the traditional site of the Resurrection of Christ, thus its original Greek name, Church of the Anastasis.\n\nToday, the wider complex accumulated during the centuries around the Church of the Holy Sepulchre also serves as the headquarters of the Greek Orthodox Patriarch of Jerusalem, while control of the church itself is shared between several Christian denominations and secular entities in complicated arrangements essentially unchanged for over 160 years, and some for much longer. The main denominations sharing property over parts of the church are the Greek Orthodox, Armenian Apostolic and Roman Catholic, and to a lesser degree the Coptic Orthodox, Syriac Orthodox and Ethiopian Tewahedo. Meanwhile, Protestants, including Anglicans, have no permanent presence in the Church. Some Protestants prefer The Garden Tomb, elsewhere in Jerusalem, as a more evocative site to commemorate Jesus' crucifixion and resurrection.\n\nHistory\n\nConstruction (4th century)\n\nAccording to Eusebius of Caesarea, the Roman emperor Hadrian in the 2nd century AD built a temple dedicated to the goddess Venus in order to bury the cave in which Jesus had been buried. The first Christian emperor, Constantine the Great, ordered in about 325/326 that the temple be replaced by a church.The Pilgrim of Bordeaux reports in 333: \"There, at present, by the command of the Emperor Constantine, has been built a basilica, that is to say, a church of wondrous beauty\". Itinerarium Burdigalense, page 594 During the building of the Church, Constantine's mother, Helena, is believed to have rediscovered the tomb (although there are some discrepancies among authors). Socrates Scholasticus (born c. 380), in his Ecclesiastical History, gives a full description of the discovery.\n\nConstantine's church was built as two connected churches over the two different holy sites, including a great basilica (the Martyrium visited by Egeria in the 380s), an enclosed colonnaded atrium (the Triportico) with the traditional site of Golgotha in one corner, and a rotunda, called the Anastasis (\"Resurrection\" in Greek), which contained the remains of a rock-cut room that Helena and Macarius identified as the burial site of Jesus.\n\nAccording to tradition, Constantine arranged for the rockface to be removed from around the tomb, without harming it, in order to isolate the tomb; in the centre of the rotunda is a small building called the Kouvouklion in GreekKουβούκλιον; Modern Greek for small compartment or the Aedicula in Latin, which encloses this tomb. The remains are completely enveloped by a marble sheath placed some 500 years before to protect the ledge from Ottoman attacks. However, there are several thick window wells extending through the marble sheath, from the interior to the exterior that are not marble clad. They appear to reveal an underlying limestone rock, which may be part of the original living rock of the tomb.\n\nThe church was built starting in 325/326, and was consecrated on 13 September 335. From pilgrim reports it seems that the chapel housing the tomb of Jesus was freestanding at first, and that the Rotunda was only erected around the chapel in the 380s.\n \nEach year, the Eastern Orthodox Church celebrates the anniversary of the consecration of the Church of the Resurrection (Holy Sepulchre) on 13 September.\n\nDamage and destruction (614–1009)\n\nThis building was damaged by fire in May of 614 when the Sassanid Empire, under Khosrau II, invaded Jerusalem and captured the True Cross. In 630, the Emperor Heraclius restored it and rebuilt the church after recapturing the city. After Jerusalem came under Arab rule, it remained a Christian church, with the early Muslim rulers protecting the city's Christian sites. A story reports that the Caliph Umar ibn al-Khattab visited the church and stopped to pray on the balcony; but at the time of prayer, he turned away from the church and prayed outside. He feared that future generations would misinterpret this gesture, taking it as a pretext to turn the church into a mosque. Eutychius added that Umar wrote a decree prohibiting Muslims from praying at this location. The building suffered severe damage due to an earthquake in 746.\n\nEarly in the ninth century, another earthquake damaged the dome of the Anastasis. The damage was repaired in 810 by Patriarch Thomas. In the year 841, the church suffered a fire. In 935, the Orthodox Christians prevented the construction of a Muslim mosque adjacent to the Church. In 938, a new fire damaged the inside of the basilica and came close to the rotunda. In 966, due to a defeat of Muslim armies in the region of Syria, a riot broke out, which was followed by reprisals. The basilica was burned again. The doors and roof were burnt, and the Patriarch John VII was murdered.\n\nOn 18 October 1009, Fatimid caliph Al-Hakim bi-Amr Allah ordered the complete destruction of the church as part of a more general campaign against Christian places of worship in Palestine and Egypt.Adémar de Chabannes recorded that the church of Saint George at Lydda 'with many other churches of the saints' had been attacked, and the 'basilica of the Lord's Sepulchre destroyed down to the ground'. ...The Christian writer Yahya ibn Sa'id reported that everything was razed 'except those parts which were impossible to destroy or would have been too difficult to carry away'.\"  The damage was extensive, with few parts of the early church remaining. Christian Europe reacted with shock and expulsions of Jews (for example, Cluniac monk Rodulfus Glaber blamed the Jews, with the result that Jews were expelled from Limoges and other French towns) and an impetus to later Crusades.\n\nReconstruction (11th century)\n\nIn wide-ranging negotiations between the Fatimids and the Byzantine Empire in 1027–8, an agreement was reached whereby the new Caliph Ali az-Zahir (Al-Hakim's son) agreed to allow the rebuilding and redecoration of the Church. The rebuilding was finally completed with the financing at a huge expense by Emperor Constantine IX Monomachos and Patriarch Nicephorus of Constantinople in 1048. As a concession, the mosque in Constantinople was re-opened and the khutba sermons were to be pronounced in az-Zahir's name. Muslim sources say a by-product of the agreement was the recanting of Islam by many Christians who had been forced to convert under Al-Hakim's persecutions. In addition, the Byzantines, while releasing 5,000 Muslim prisoners, made demands for the restoration of other churches destroyed by Al-Hakim and the re-establishment of a Patriarch in Jerusalem. Contemporary sources credit the emperor with spending vast sums in an effort to restore the Church of the Holy Sepulchre after this agreement was made. Despite the Byzantines spending vast sums on the project, \"a total replacement was far beyond available resources. The new construction was concentrated on the rotunda and its surrounding buildings: the great basilica remained in ruins.\" The rebuilt church site consisted of \"a court open to the sky, with five small chapels attached to it.\" The chapels were to the east of the court of resurrection, where the wall of the great church had been. They commemorated scenes from the passion, such as the location of the prison of Christ and of his flagellation, and presumably were so placed because of the difficulties of free movement among shrines in the streets of the city. The dedication of these chapels indicates the importance of the pilgrims' devotion to the suffering of Christ. They have been described as 'a sort of Via Dolorosa in miniature'... since little or no rebuilding took place on the site of the great basilica. Western pilgrims to Jerusalem during the eleventh century found much of the sacred site in ruins.\" Control of Jerusalem, and thereby the Church of the Holy Sepulchre, continued to change hands several times between the Fatimids and the Seljuk Turks (loyal to the Abbasid caliph in Baghdad) until the arrival of the Crusaders in 1099.\n\nCrusader period (1099–1244)\n\nMany historians maintain that the main concern of Pope Urban II, when calling for the First Crusade, was the threat to Constantinople from the Turkish invasion of Asia Minor in response to the appeal of Byzantine Emperor Alexios I Komnenos. Historians agree that the fate of Jerusalem and thereby the Church of the Holy Sepulchre was of concern if not the immediate goal of papal policy in 1095. The idea of taking Jerusalem gained more focus as the Crusade was underway. The rebuilt church site was taken from the Fatimids (who had recently taken it from the Abassids) by the knights of the First Crusade on 15 July 1099.\n \nThe First Crusade was envisioned as an armed pilgrimage, and no crusader could consider his journey complete unless he had prayed as a pilgrim at the Holy Sepulchre. Crusader Prince Godfrey of Bouillon, who became the first crusader monarch of Jerusalem, decided not to use the title \"king\" during his lifetime, and declared himself \"Advocatus Sancti Sepulchri\" (\"Protector [or Defender] of the Holy Sepulchre\"). By the crusader period, a cistern under the former basilica was rumoured to have been the location where Helena had found the True Cross, and began to be venerated as such; although the cistern later became the \"Chapel of the Invention of the Cross,\" there is no evidence of the rumour before the 11th century, and modern archaeological investigation has now dated the cistern to 11th century repairs by Monomachos.\n\nAccording to the German clergyman and orient pilgrim Ludolf von Sudheim, the keys of the Chapel of the Holy Sepulchre were in hands of the \"ancient Georgians\" and the food, alms, candles and oil for lamps were given them by the pilgrims in the south door of the church.Venetian Adventurer: The Life and Times of Marco Polo, p88\n\nWilliam of Tyre, chronicler of the Crusader Kingdom of Jerusalem, reports on the renovation of the Church in the mid-12th century. The crusaders investigated the eastern ruins on the site, occasionally excavating through the rubble, and while attempting to reach the cistern, they discovered part of the original ground level of Hadrian's temple enclosure; they decided to transform this space into a chapel dedicated to Helena (the Chapel of Saint Helena), widening their original excavation tunnel into a proper staircase. The crusaders began to refurnish the church in a Romanesque style and added a bell tower.Pilgrimages and Pilgrim shrines in Palestine and Syria after 1095, Henry L. Savage, A History of the Crusades: The Art and Architecture of the Crusader States, Volume IV, ed. Kenneth M. Setton and Harry W. Hazard, (University of Wisconsin Press, 1977), 37. These renovations unified the small chapels on the site and were completed during the reign of Queen Melisende in 1149, placing all the Holy places under one roof for the first time. The church became the seat of the first Latin Patriarchs, and was also the site of the kingdom's scriptorium. The church was lost to Saladin, along with the rest of the city, in 1187, although the treaty established after the Third Crusade allowed for Christian pilgrims to visit the site. Emperor Frederick II (r. 1220–50) regained the city and the church by treaty in the 13th century while he himself was under a ban of excommunication, with the curious consequence that the holiest church in Christianity was laid under interdict. The church seems to have been largely in Greek Orthodox Patriarch Athanasius II of Jerusalem's hands, ca. 1231–47, during the Latin control of Jerusalem. Both city and church were captured by the Khwarezmians in 1244.\n\nLater periods\n\nThe Franciscan friars renovated it further in 1555, as it had been neglected despite increased numbers of pilgrims. The Franciscans rebuilt the Aedicule, extending the structure to create an ante-chamber. After the renovation of 1555, control of the church oscillated between the Franciscans and the Orthodox, depending on which community could obtain a favorable \"firman\" from the \"Sublime Porte\" at a particular time, often through outright bribery, and violent clashes were not uncommon. There was no agreement about this question, although it was discussed at the negotiations to the Treaty of Karlowitz in 1699. In 1767, weary of the squabbling, the \"Porte\" issued a \"firman\" that divided the church among the claimants.\n\nA fire severely damaged the structure again in 1808, causing the dome of the Rotunda to collapse and smashing the Aedicule's exterior decoration. The Rotunda and the Aedicule's exterior were rebuilt in 1809–1810 by architect Nikolaos Ch. Komnenos of Mytilene in the then current Ottoman Baroque style. The fire did not reach the interior of the Aedicule, and the marble decoration of the Tomb dates mainly to the 1555 restoration, although the interior of the ante-chamber, now known as the \"Chapel of the Angel,\" was partly rebuilt to a square ground-plan, in place of the previously semi-circular western end. Another decree in 1853 from the sultan solidified the existing territorial division among the communities and set a \"status quo\" for arrangements to \"remain forever,\" causing differences of opinion about upkeep and even minor changes, including disagreement on the removal of the \"Immovable Ladder\", an exterior ladder under one of the windows; this ladder has remained in the same position since then.\n\nThe cladding of red marble applied to the Aedicule by Komnenos has deteriorated badly and is detaching from the underlying structure; since 1947 it has been held in place with an exterior scaffolding of iron girders installed by the British authorities. A careful renovation is undergoing, funded by a $4 million gift from King Abdullah II of Jordan and a $1.3-million gift from Mica Ertegun.\n\nThe current dome dates from 1870, although it was restored between 1994–1997, as part of extensive modern renovations to the church which have been ongoing since 1959. During the 1970–1978 restoration works and excavations inside the building, and under the nearby Muristan, it was found that the area was originally a quarry, from which white meleke limestone was struck. To the east of the Chapel of Saint Helena, the excavators discovered a void containing a 2nd-century drawing of a Roman ship, two low walls which supported the platform of Hadrian's 2nd-century temple, and a higher 4th-century wall built to support Constantine's basilica. After the excavations of the early 1970s, the Armenian authorities converted this archaeological space into the Chapel of Saint Vartan, and created an artificial walkway over the quarry on the north of the chapel, so that the new Chapel could be accessed (by permission) from the Chapel of Saint Helena.\n\nIn 2016, restoration works were performed in the Aedicule. For the first time since at least 1555, marble cladding which protected the estimated burial bed of Jesus from vandalism and souvenir takershttp://cnsnews.com/commentary/eric-metaxas/history-revealed-jesuss-tomb-discovered-church-holy-sepulchre-empty was removed. When the cladding was first removed on October 26, an initial inspection by the National Technical University of Athens team showed only a layer of fill material underneath. By the night of October 28, the original limestone burial bed was revealed intact. This suggested that the tomb location has not changed through time and confirmed the existence of the original limestone cave walls within the Aedicule. The tomb was resealed shortly thereafter.\n\nDescription\n\nParvis (courtyard)\n\nThe courtyard facing the entrance to the church is known as the parvis.\n\nLocated around the parvis are a few smaller structures.\n\nSouth of the parvis, opposite the church:\n* Broken columns—once forming part of an arcade—stand opposite the church, at the top of a short descending staircase stretching over the entire breadth of the parvis. In the 13th century, the tops of the columns were removed and sent to Mecca by the Khwarezmids.\n* The Gethsemane Metochion, a small Greek Orthodox monastery.\n\nOn the eastern side of the parvis, south to north:\n* The Monastery of St Abraham (Greek Orthodox)\n* The Chapel of St John (Armenian Orthodox)\n* The Chapel of St Michael (Coptic/Ethiopian Orthodox), giving access to the roof of the Chapel of St Helen and the Ethiopian monastery.\nNorth of the parvis, in front of the church facade or against it:* Chapel of the Franks—a blue-domed Roman Catholic Crusader chapel dedicated to Our Lady of Sorrows, which once provided exclusive access to Calvary. The chapel marks the 10th Station of the Cross (the stripping of Jesus' garments).\n* A Greek Orthodox oratory and chapel, just beneath the Chapel of the Franks, dedicated to St. Mary of Egypt.\n* The tomb of Philip d'Aubigny (Phillipe Daubeney, d. 1236)—a knight, tutor, and royal councilor to King Henry III of England and signer of the Magna Carta—is placed in front of, and between, the two original entrance doors of the church, of which the eastern one is walled-up. It is one of the few tombs of crusaders and other Europeans not removed from the Church after the Muslim recapture of Jerusalem in the 12th century. A stone marker was placed on his tomb in 1925, sheltered by a wooden trapdoor which hides it from view.\n\nA group of three chapels is bordering the parvis on its west side. They originally formed the baptistery complex of the Constantinian church. The southernmost chapel was the vestibule, the middle chapel the actual baptistery, and the north chapel the chamber in which the patriarch chrismated the newly baptized before leading them into the rotunda north of this complex. Now they are dedicated as (from south to north)\n* The Chapel of St. James the Just (Greek Orthodox),\n* The Chapel of St. John the Baptist (Greek Orthodox),\n* The Chapel of the Forty Martyrs of Sebaste (Greek Orthodox; at the base of the bell tower).\n\nBell tower\n\nThe church's bell tower is located to the left of the façade. It is currently almost half its original size.http://www.sepulchre.custodia.org/default.asp?id\n4100\n\nFacade and entrance\n\nThe entrance to the church, a single door in the south transept—through the crusader façade—is found past a group of streets winding through the outer Via Dolorosa, by way of a local souq in the Muristan. This narrow way of access to such a large structure has proven to be hazardous at times. For example, when a fire broke out in 1840, dozens of pilgrims were trampled to death.\n\nThe \"Immovable Ladder\", in its latest incarnation, stands beneath a window on the façade.\n\nHistorically, two large, arched doors allowed access to the church. However, only the left-hand entrance is currently accessible, as the right door has long since been bricked up. These entrances are located in the parvis of a larger courtyard, or plaza.\n\nCalvary (Golgotha)\n\nJust inside the church is a stairway climbing to Calvary (Golgotha), traditionally regarded as the site of Jesus' crucifixion and the most lavishly decorated part of the church. The exit is via another stairway opposite the first, leading down to the ambulatory. The Golgotha and its chapels are just south of the main altar of the Catholicon.\n\nOn the ground floor, underneath the Golgotha chapel proper, are the Chapel of Adam and the Treasury of the Greek Orthodox Patriarchate, holding many relics including an alleged fragment of the Holy Cross.\n\nThe raised Chapel of the Calvary, or Golgotha Chapel, contains the apex of the Rock of Calvary (12th Station of the Cross). It is split into two halves, one Greek Orthodox and one Catholic, each one with its own altar. The northern half with the main altar belongs to the Greek Orthodox. The rock can be seen under glass on both sides of the altar, and beneath the altar there is a hole in the rock, said to be the place where the cross was raised. Due to the significance of this, it is the most visited site in the Church of the Holy Sepulchre along with the Tomb of Jesus. The Roman Catholic (Franciscan) Chapel of the Nailing of the Cross (11th Station of the Cross) stretches south of it. Between the Catholic and the Orthodox altar, there is a statue of Mary, believed by some to be miraculous. It marks the 13th Station of the Cross, where Jesus' body was removed from the cross and given to his family and disciples.\n\nBeneath the Calvary and the two chapels there, on the main floor, there is the Chapel of Adam. According to tradition, Jesus was crucified over the place where Adam's skull was buried. According to some, at the crucifixion, the blood of Christ ran down the cross and through the rocks to fill the skull of Adam.William R. Cook of State University of New York, lecture series The Rock of Calvary appears cracked through a window on the altar wall, with the crack traditionally claimed to be caused by the earthquake that occurred when Jesus died on the cross, while some scholars claim it to be the result of quarrying against a natural flaw in the rock.\n\nStone of Anointing\n\nJust inside the entrance to the church is the Stone of Anointing (also Stone of the Anointing or Stone of Unction), which tradition believes to be the spot where Jesus' body was prepared for burial by Joseph of Arimathea. However, this tradition is only attested since the crusader era (notably by the Italian Dominican pilgrim Riccoldo da Monte di Croce in 1288), and the present stone was only added in the 1810 reconstruction.\n\nThe wall behind the stone is defined by its striking blue balconies and tau cross-bearing red banners (depicting the insignia of the Brotherhood of the Holy Sepulchre), and is decorated with lamps. The modern three-part mosaic along the wall depicts the anointing of Jesus' body, preceded on the right by the Descent from the Cross, and succeeded on the left by the Burial of Jesus.\n\nThe wall was a temporary addition to support the arch above it, which had been weakened after the damage in the 1808 fire; it blocks the view of the rotunda, separates the entrance from the Catholicon, sits on top of the now-empty and desecrated graves of four 12th-century crusader kings—including Godfrey of Bouillon and Baldwin I of Jerusalem—and is no longer structurally necessary. There is a difference of opinion as to whether it is to be seen as the 13th Station of the Cross, which others identify as the lowering of Jesus from the cross and locate between the 11th and 12th stations up on Calvary.\n\nThe lamps that hang over the Stone of Unction, adorned with cross-bearing chain links, are contributed by Armenians, Copts, Greeks and Latins.\n\nImmediately to the left of the entrance is a bench that has traditionally been used by the church's Muslim doorkeepers, along with some Christian clergy, as well as electrical wiring. To the right of the entrance is a wall along the ambulatory containing, to the very right, the staircase leading to Golgotha. Further along the same wall is the entrance to the Chapel of Adam.\n\nRotunda and Aedicule\n\nThe Rotunda is located in the centre of the Anastasis, beneath the larger of the church's two domes. In the center of the Rotunda is the chapel called the Aedicule, which contains the Holy Sepulchre itself. The Aedicule has two rooms, the first holding the Angel's Stone, which is believed to be a fragment of the large stone that sealed the tomb; the second is the tomb itself. Possibly due to the fact that pilgrims laid their hands on the tomb and/or to prevent eager pilgrims from removing bits of the original rock as souvenirs, a marble plaque was placed in the fourteenth century on the tomb to prevent further damage to the tomb.\n\nUnder the status quo, the Eastern Orthodox, Roman Catholic, and Armenian Apostolic Churches all have rights to the interior of the tomb, and all three communities celebrate the Divine Liturgy or Holy Mass there daily. It is also used for other ceremonies on special occasions, such as the Holy Saturday ceremony of the Holy Fire led by the Greek Orthodox Patriarch (with the participation of the Coptic and Armenian patriarchs). To its rear, in a chapel constructed of iron latticework upon a stone base semicircular in plan, lies the altar used by the Coptic Orthodox. Historically, the Georgians also retained the key to the Aedicule.\n\nFrom May 2016 to March 2017, the Aedicule underwent restoration and repairs after the Israel Antiquities Authority declared the structure unsafe. Much of the $3 million project was funded by the World Monuments Fund.\n\nWest of the Aedicule, to the rear of the Rotunda, is a chapel (see \"Syriac Chapel with Tomb of Joseph of Arimathea\") located in a Constantinian apse and containing an opening to a rock-cut ancient Jewish tomb. This chapel is where the Syriac Orthodox celebrate their Liturgy on Sundays.\n\nTo the right of the Sepulchre on the northwestern edge of the Rotunda is the Chapel of the Apparition, which is reserved for Roman Catholic use (see \"Franciscan area north of the Aedicule\").\n\nCatholicon\n\n* The Catholicon – On the east side opposite the Rotunda is the Crusader structure housing the main altar of the Church, today the Greek Orthodox catholicon. The second, smaller dome sits directly over the centre of the transept crossing of the choir where the compas, an omphalos once thought to be the center of the world (associated to the site of the Crucifixion and the Resurrection), is situated. Since 1996 this dome is topped by the monumental Golgotha Crucifix which the Greek Patriarch Diodoros I of Jerusalem consecrated. It was at the initiative of Gustav Kühnel to erect a new crucifix at the Church of the Holy Sepulchre in Jerusalem that would not only be worthy of the singularity of the site, but that would also become a symbol of the efforts of unity in the community of Christian faith.\n\nEast of this is a large iconostasis demarcating the Orthodox sanctuary before which is set the throne of the Greek Orthodox Patriarch of Jerusalem on the south side facing the throne of the Greek Orthodox Patriarch of Antioch on the north side.\n\nAmbulatory\n\n* Prison of Christ – In the north-east side of the complex there is The Prison of Christ, alleged by the Franciscans to be where Jesus was held. The Greek Orthodox allege that the real place that Jesus was held was the similarly named Prison of Christ, in their Monastery of the Praetorium, located near the Church of Ecce Homo, between the Second and Third Stations of the Via Dolorosa. The Armenians regard a recess in the Monastery of the Flagellation at the Second Station of the Via Dolorosa, as the Prison of Christ. A cistern among the ruins beneath the Church of St. Peter in Gallicantu on Mount Zion is also alleged to have been the Prison of Christ. To reconcile the traditions, some allege that Jesus was held in the Mount Zion cell in connection with his trial by the Jewish High Priest, at the Praetorium in connection with his trial by the Roman governor Pilate, and near the Golgotha before crucifixion.\n\nFurther to the east in the ambulatory are three chapels (from south to north):\n* Greek Chapel of Saint Longinus – The Orthodox Greek chapel is dedicated to Saint Longinus.\n* Armenian Chapel of Division of Robes\n* Greek Chapel of the Derision – the southernmost chapel in the ambulatory.\n\nChapel of Saint Helena\n\n* Chapel of Saint Helena – between the first two chapels are stairs descending to the Chapel of Saint Helena.\n* Chapel of Vartan (or Vardan) Mamikonian – on the north side of the Chapel of Saint Helena is an ornate wrought iron door, beyond which a raised artificial platform affords views of the quarry, and which leads to the Chapel of Saint Vartan. The latter chapel contains archaeological remains from Hadrian's temple and Constantine's basilica. These areas are open only on request.\n* Chapel of the Invention of the Holy Cross – another set of 22 stairs from the Chapel of Saint Helena leads down to the Roman Catholic Chapel of the Invention of the Holy Cross, believed to be the place where the True Cross was found.\n\nFranciscan area north of the Aedicule\n\n* The Franciscan Chapel of St. Mary Magdalene – The chapel indicates the place where Mary Magdalene met Jesus after his resurrection.\n* The Franciscan Chapel of the Blessed Sacrament (or Chapel of the Apparition) – in memory of Jesus' meeting with his mother after the Resurrection.\n\nSyriac Chapel with Tomb of Joseph of Arimathea\n\n*The Syriac Orthodox Chapel of Saint Joseph of Arimathea and Saint Nicodemus. On Sundays and feast days it is furnished for the celebration of Mass.\n\nIt is accessed from the Rotunda, by a door west of the Aedicule. On the far side of the chapel is the low entrance to an almost complete 1st-century Jewish tomb, initially holding six kokh-type funeral shafts radiating from a central chamber, of which two are still exposed. Although this space was discovered recently and contains no identifying marks, many Christians believe that Saints Joseph of Arimathea and Nicodemus were buried here.\n\nSince Jews always buried their dead outside the city, the presence of this tomb proves that the Holy Sepulchre site was outside the city walls at the time of the crucifixion.\n\nArmenian monastery south of the Aedicule\n\nSouth of the Aedicule is the \"Place of the Three Marys\", marked by a stone canopy and a large modern wall mosaic. From here one can enter the Armenian monastery which stretches over the ground and first upper floor of the church's southeastern part.\n\nStatus quo\n\nThe Sultan's firman (decree) of 1853, known as the \"status quo\", pinned down the now permanent statutes of property and the regulations concerning the roles of the different denominations and other custodians.\n\nThe primary custodians are the Greek Orthodox, Armenian Apostolic, and Roman Catholic Churches, with the Greek Orthodox Church having the lion's share. In the 19th century, the Coptic Orthodox, the Ethiopian Orthodox and the Syriac Orthodox acquired lesser responsibilities, which include shrines and other structures in and around the building. Times and places of worship for each community are strictly regulated in common areas. The Greek Orthodox act through the Greek Orthodox Patriarchate as well as through the Brotherhood of the Holy Sepulchre. The Roman Catholics act through the Franciscan Custody of the Holy Land.\n\nThe establishment of the 1853 status quo did not halt controversy and sometimes violence, which continues to break out occasionally. On a hot summer day in 2002, a Coptic monk moved his chair from its agreed spot into the shade. This was interpreted as a hostile move by the Ethiopians, and eleven were hospitalized after the resulting fracas.\n\nIn another incident in 2004, during Orthodox celebrations of the Exaltation of the Holy Cross, a door to the Franciscan chapel was left open. This was taken as a sign of disrespect by the Orthodox and a fistfight broke out. Some people were arrested, but no one was seriously injured.\n\nOn Palm Sunday, in April 2008, a brawl broke out when a Greek monk was ejected from the building by a rival faction. Police were called to the scene but were also attacked by the enraged brawlers. On Sunday, 9 November 2008, a clash erupted between Armenian and Greek monks during celebrations for the Feast of the Cross.\n\nA less grave sign of this state of affairs is located on a window ledge over the church's entrance. A wooden ladder was placed there at some time before 1852, when the status quo defined both the doors and the window ledges as common ground. This ladder, the \"Immovable Ladder\", in its latest incarnation, remains to this day, in almost exactly the same position it occupied in century-old photographs and engravings, as it must be replaced whenever it falls apart. An engraving by David Roberts in 1839 also shows the same ladder in the same position.\n\nNo one controls the main entrance. In 1192, Saladin assigned door-keeping responsibilities to the Muslim Nuseibeh family. The wooden doors that compose the main entrance are the original, highly carved doors.William R. Cook of University of New York, lecture series The Joudeh Al-Goudia family were entrusted as custodian to the keys of the Holy Sepulchre by Saladin in 1187.\n\nDespite occasional disagreements, the religious services take place in the Church with regularity and coexistence is generally peaceful. An example of concord between the Church custodians is the recent (2016–17) full restoration of the Aedicule.\n\nConnection to temple of Aphrodite\n\nThe site of the Church had been a temple of Aphrodite before Constantine's edifice was built. Hadrian's temple had actually been located there because it was the junction of the main north-south road with one of the two main east-west roads and directly adjacent to the forum (which is now the location of the (smaller) Muristan); the forum itself had been placed, as is traditional in Roman towns, at the junction of the main north-south road with the (other) main east-west road (which is now El-Bazar/David Street). The temple and forum together took up the entire space between the two main east-west roads (a few above-ground remains of the east end of the temple precinct still survive in the Alexander Nevsky Church complex of the Russian Mission in Exile).\n\nFrom the archaeological excavations in the 1970s, it is clear that construction took over most of the site of the earlier temple enclosure and that the Triportico and Rotunda roughly overlapped with the temple building itself; the excavations indicate that the temple extended at least as far back as the Aedicule, and the temple enclosure would have reached back slightly further. Virgilio Canio Corbo, a Franciscan priest and archaeologist, who was present at the excavations, estimated from the archaeological evidence that the western retaining wall, of the temple itself, would have passed extremely close to the east side of the supposed tomb; if the wall had been any further west any tomb would have been crushed under the weight of the wall (which would be immediately above it) if it had not already been destroyed when foundations for the wall were made.\n\nOther archaeologists have criticized Corbo's reconstructions. Dan Bahat, the former city archaeologist of Jerusalem, regards them as unsatisfactory, as there is no known temple of Aphrodite matching Corbo's design, and no archaeological evidence for Corbo's suggestion that the temple building was on a platform raised high enough to avoid including anything sited where the Aedicule is now; indeed Bahat notes that many temples to Aphrodite have a rotunda-like design, and argues that there is no archaeological reason to assume that the present rotunda was not based on a rotunda in the temple previously on the site.\n\nLocation\n\n \nThe Bible describes Jesus's tomb as being outside the city wall,for example,  as was normal for burials across the ancient world, which were regarded as unclean.Toynbee, Jocelyn M. C. [https://books.google.com/books?idrHd1MDlV-eUC&pg\nPA14&dqFunerary+art&lr\n&as_brr3&ei\nmfHeS-XqKYniywT0nb3_CA&cd21#v\nonepage&qFunerary%20art&f\nfalse Death and Burial in the Roman World], pp. 48–49, JHU Press. 1996. . An exception in the Classical World were the Lycians of Anatolia. There are also the Egyptian mortuary-temples, where the object of worship was the deified royal person entombed, but Egyptian temples to the major gods contained no burials. Today, the site of the Church is within the current walls of the old city of Jerusalem. It has been well documented by archaeologists that in the time of Jesus, the walled city was smaller and the wall then was to the east of the current site of the Church. In other words, the city had been much narrower in Jesus' time, with the site then having been outside the walls; since Herod Agrippa (41–44) is recorded by history as extending the city to the north (beyond the present northern walls), the required repositioning of the western wall is traditionally attributed to him as well.\n\nThe area immediately to the south and east of the sepulchre was a quarry and outside the city during the early 1st century as excavations under the Lutheran Church of the Redeemer across the street demonstrated.\n\nThe church is a part of the UNESCO World Heritage Site Old City of Jerusalem.\n\nThe Christian Quarter and the (also Christian) Armenian Quarter of the Old City of Jerusalem are both located in the northwestern and western part of the Old City, due to the fact that the Holy Sepulchre is located close to the northwestern corner of the walled city. The adjacent neighbourhood within the Christian  Quarter is called the Muristan, a term derived from the Persian word for hospital - Christian pilgrim hospices have been maintained in this area near the Holy Sepulchre since at least the time of Charlemagne.\n\nInfluence\n\nFrom the 9th century, the construction of churches inspired in the Anastasis was extended across Europe.[http://www.abbaziasantostefano.it/storia.htm Monastero di Santo Stefano: Basilica Santuario Santo Stefano: Storia], Bologna. One example is Santo Stefano in Bologna, Italy, an agglomeration of seven churches recreating shrines of Jerusalem.\n\nSeveral churches and monasteries in Europe, for instance, in Germany and Russia, and at least one church in the United States have been modeled on the Church of the Resurrection, some even reproducing other holy places for the benefit of pilgrims who could not travel to the Holy Land. They include the Heiliges Grab of Görlitz, constructed between 1481 and 1504, the New Jerusalem Monastery in Moscow Oblast, constructed by Patriarch Nikon between 1656 and 1666, and Mount St. Sepulchre Franciscan Monastery built by the Franciscans in Washington, DC in 1898.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Church of the Holy Sepulchre" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7810" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Church of the Holy Sepulchre ( Kaneesatu al-Qeyaamah;  Naos tes Anastaseos;  Surb Harut'yan tač̣ar; ; also called the Church of the Resurrection or Church of the Anastasis by Orthodox Christians) is a church in the Christian Quarter of the Old City of Jerusalem. The church contains, according to traditions dating back to at least the fourth century, the two holiest sites in Christianity: the site where Jesus of Nazareth was crucified, at a place known as \"Calvary\" or \"Golgotha\", and Jesus's empty tomb, where he is said to have been buried and resurrected. The tomb is enclosed by the 19th-century shrine, called the Aedicule (Edicule). The Status Quo, a 150-year-old understanding between religious communities, applies to the site.\n\nWithin the church proper are the last four (or, by some definitions, five) Stations of the Via Dolorosa, representing the final episodes of Jesus' Passion. The church has been a major Christian pilgrimage destination since its creation in the fourth century, as the traditional site of the Resurrection of Christ, thus its original Greek name, Church of the Anastasis.\n\nToday, the wider complex accumulated during the centuries around the Church of the Holy Sepulchre also serves as the headquarters of the Greek Orthodox Patriarch of Jerusalem, while control of the church itself is shared between several Christian denominations and secular entities in complicated arrangements essentially unchanged for over 160 years, and some for much longer. The main denominations sharing property over parts of the church are the Greek Orthodox, Armenian Apostolic and Roman Catholic, and to a lesser degree the Coptic Orthodox, Syriac Orthodox and Ethiopian Tewahedo. Meanwhile, Protestants, including Anglicans, have no permanent presence in the Church. Some Protestants prefer The Garden Tomb, elsewhere in Jerusalem, as a more evocative site to commemorate Jesus' crucifixion and resurrection.\n\nHistory\n\nConstruction (4th century)\n\nAccording to Eusebius of Caesarea, the Roman emperor Hadrian in the 2nd century AD built a temple dedicated to the goddess Venus in order to bury the cave in which Jesus had been buried. The first Christian emperor, Constantine the Great, ordered in about 325/326 that the temple be replaced by a church.The Pilgrim of Bordeaux reports in 333: \"There, at present, by the command of the Emperor Constantine, has been built a basilica, that is to say, a church of wondrous beauty\". Itinerarium Burdigalense, page 594 During the building of the Church, Constantine's mother, Helena, is believed to have rediscovered the tomb (although there are some discrepancies among authors). Socrates Scholasticus (born c. 380), in his Ecclesiastical History, gives a full description of the discovery.\n\nConstantine's church was built as two connected churches over the two different holy sites, including a great basilica (the Martyrium visited by Egeria in the 380s), an enclosed colonnaded atrium (the Triportico) with the traditional site of Golgotha in one corner, and a rotunda, called the Anastasis (\"Resurrection\" in Greek), which contained the remains of a rock-cut room that Helena and Macarius identified as the burial site of Jesus.\n\nAccording to tradition, Constantine arranged for the rockface to be removed from around the tomb, without harming it, in order to isolate the tomb; in the centre of the rotunda is a small building called the Kouvouklion in GreekKουβούκλιον; Modern Greek for small compartment or the Aedicula in Latin, which encloses this tomb. The remains are completely enveloped by a marble sheath placed some 500 years before to protect the ledge from Ottoman attacks. However, there are several thick window wells extending through the marble sheath, from the interior to the exterior that are not marble clad. They appear to reveal an underlying limestone rock, which may be part of the original living rock of the tomb.\n\nThe church was built starting in 325/326, and was consecrated on 13 September 335. From pilgrim reports it seems that the chapel housing the tomb of Jesus was freestanding at first, and that the Rotunda was only erected around the chapel in the 380s.\n \nEach year, the Eastern Orthodox Church celebrates the anniversary of the consecration of the Church of the Resurrection (Holy Sepulchre) on 13 September.\n\nDamage and destruction (614–1009)\n\nThis building was damaged by fire in May of 614 when the Sassanid Empire, under Khosrau II, invaded Jerusalem and captured the True Cross. In 630, the Emperor Heraclius restored it and rebuilt the church after recapturing the city. After Jerusalem came under Arab rule, it remained a Christian church, with the early Muslim rulers protecting the city's Christian sites. A story reports that the Caliph Umar ibn al-Khattab visited the church and stopped to pray on the balcony; but at the time of prayer, he turned away from the church and prayed outside. He feared that future generations would misinterpret this gesture, taking it as a pretext to turn the church into a mosque. Eutychius added that Umar wrote a decree prohibiting Muslims from praying at this location. The building suffered severe damage due to an earthquake in 746.\n\nEarly in the ninth century, another earthquake damaged the dome of the Anastasis. The damage was repaired in 810 by Patriarch Thomas. In the year 841, the church suffered a fire. In 935, the Orthodox Christians prevented the construction of a Muslim mosque adjacent to the Church. In 938, a new fire damaged the inside of the basilica and came close to the rotunda. In 966, due to a defeat of Muslim armies in the region of Syria, a riot broke out, which was followed by reprisals. The basilica was burned again. The doors and roof were burnt, and the Patriarch John VII was murdered.\n\nOn 18 October 1009, Fatimid caliph Al-Hakim bi-Amr Allah ordered the complete destruction of the church as part of a more general campaign against Christian places of worship in Palestine and Egypt.Adémar de Chabannes recorded that the church of Saint George at Lydda 'with many other churches of the saints' had been attacked, and the 'basilica of the Lord's Sepulchre destroyed down to the ground'. ...The Christian writer Yahya ibn Sa'id reported that everything was razed 'except those parts which were impossible to destroy or would have been too difficult to carry away'.\"  The damage was extensive, with few parts of the early church remaining. Christian Europe reacted with shock and expulsions of Jews (for example, Cluniac monk Rodulfus Glaber blamed the Jews, with the result that Jews were expelled from Limoges and other French towns) and an impetus to later Crusades.\n\nReconstruction (11th century)\n\nIn wide-ranging negotiations between the Fatimids and the Byzantine Empire in 1027–8, an agreement was reached whereby the new Caliph Ali az-Zahir (Al-Hakim's son) agreed to allow the rebuilding and redecoration of the Church. The rebuilding was finally completed with the financing at a huge expense by Emperor Constantine IX Monomachos and Patriarch Nicephorus of Constantinople in 1048. As a concession, the mosque in Constantinople was re-opened and the khutba sermons were to be pronounced in az-Zahir's name. Muslim sources say a by-product of the agreement was the recanting of Islam by many Christians who had been forced to convert under Al-Hakim's persecutions. In addition, the Byzantines, while releasing 5,000 Muslim prisoners, made demands for the restoration of other churches destroyed by Al-Hakim and the re-establishment of a Patriarch in Jerusalem. Contemporary sources credit the emperor with spending vast sums in an effort to restore the Church of the Holy Sepulchre after this agreement was made. Despite the Byzantines spending vast sums on the project, \"a total replacement was far beyond available resources. The new construction was concentrated on the rotunda and its surrounding buildings: the great basilica remained in ruins.\" The rebuilt church site consisted of \"a court open to the sky, with five small chapels attached to it.\" The chapels were to the east of the court of resurrection, where the wall of the great church had been. They commemorated scenes from the passion, such as the location of the prison of Christ and of his flagellation, and presumably were so placed because of the difficulties of free movement among shrines in the streets of the city. The dedication of these chapels indicates the importance of the pilgrims' devotion to the suffering of Christ. They have been described as 'a sort of Via Dolorosa in miniature'... since little or no rebuilding took place on the site of the great basilica. Western pilgrims to Jerusalem during the eleventh century found much of the sacred site in ruins.\" Control of Jerusalem, and thereby the Church of the Holy Sepulchre, continued to change hands several times between the Fatimids and the Seljuk Turks (loyal to the Abbasid caliph in Baghdad) until the arrival of the Crusaders in 1099.\n\nCrusader period (1099–1244)\n\nMany historians maintain that the main concern of Pope Urban II, when calling for the First Crusade, was the threat to Constantinople from the Turkish invasion of Asia Minor in response to the appeal of Byzantine Emperor Alexios I Komnenos. Historians agree that the fate of Jerusalem and thereby the Church of the Holy Sepulchre was of concern if not the immediate goal of papal policy in 1095. The idea of taking Jerusalem gained more focus as the Crusade was underway. The rebuilt church site was taken from the Fatimids (who had recently taken it from the Abassids) by the knights of the First Crusade on 15 July 1099.\n \nThe First Crusade was envisioned as an armed pilgrimage, and no crusader could consider his journey complete unless he had prayed as a pilgrim at the Holy Sepulchre. Crusader Prince Godfrey of Bouillon, who became the first crusader monarch of Jerusalem, decided not to use the title \"king\" during his lifetime, and declared himself \"Advocatus Sancti Sepulchri\" (\"Protector [or Defender] of the Holy Sepulchre\"). By the crusader period, a cistern under the former basilica was rumoured to have been the location where Helena had found the True Cross, and began to be venerated as such; although the cistern later became the \"Chapel of the Invention of the Cross,\" there is no evidence of the rumour before the 11th century, and modern archaeological investigation has now dated the cistern to 11th century repairs by Monomachos.\n\nAccording to the German clergyman and orient pilgrim Ludolf von Sudheim, the keys of the Chapel of the Holy Sepulchre were in hands of the \"ancient Georgians\" and the food, alms, candles and oil for lamps were given them by the pilgrims in the south door of the church.Venetian Adventurer: The Life and Times of Marco Polo, p88\n\nWilliam of Tyre, chronicler of the Crusader Kingdom of Jerusalem, reports on the renovation of the Church in the mid-12th century. The crusaders investigated the eastern ruins on the site, occasionally excavating through the rubble, and while attempting to reach the cistern, they discovered part of the original ground level of Hadrian's temple enclosure; they decided to transform this space into a chapel dedicated to Helena (the Chapel of Saint Helena), widening their original excavation tunnel into a proper staircase. The crusaders began to refurnish the church in a Romanesque style and added a bell tower.Pilgrimages and Pilgrim shrines in Palestine and Syria after 1095, Henry L. Savage, A History of the Crusades: The Art and Architecture of the Crusader States, Volume IV, ed. Kenneth M. Setton and Harry W. Hazard, (University of Wisconsin Press, 1977), 37. These renovations unified the small chapels on the site and were completed during the reign of Queen Melisende in 1149, placing all the Holy places under one roof for the first time. The church became the seat of the first Latin Patriarchs, and was also the site of the kingdom's scriptorium. The church was lost to Saladin, along with the rest of the city, in 1187, although the treaty established after the Third Crusade allowed for Christian pilgrims to visit the site. Emperor Frederick II (r. 1220–50) regained the city and the church by treaty in the 13th century while he himself was under a ban of excommunication, with the curious consequence that the holiest church in Christianity was laid under interdict. The church seems to have been largely in Greek Orthodox Patriarch Athanasius II of Jerusalem's hands, ca. 1231–47, during the Latin control of Jerusalem. Both city and church were captured by the Khwarezmians in 1244.\n\nLater periods\n\nThe Franciscan friars renovated it further in 1555, as it had been neglected despite increased numbers of pilgrims. The Franciscans rebuilt the Aedicule, extending the structure to create an ante-chamber. After the renovation of 1555, control of the church oscillated between the Franciscans and the Orthodox, depending on which community could obtain a favorable \"firman\" from the \"Sublime Porte\" at a particular time, often through outright bribery, and violent clashes were not uncommon. There was no agreement about this question, although it was discussed at the negotiations to the Treaty of Karlowitz in 1699. In 1767, weary of the squabbling, the \"Porte\" issued a \"firman\" that divided the church among the claimants.\n\nA fire severely damaged the structure again in 1808, causing the dome of the Rotunda to collapse and smashing the Aedicule's exterior decoration. The Rotunda and the Aedicule's exterior were rebuilt in 1809–1810 by architect Nikolaos Ch. Komnenos of Mytilene in the then current Ottoman Baroque style. The fire did not reach the interior of the Aedicule, and the marble decoration of the Tomb dates mainly to the 1555 restoration, although the interior of the ante-chamber, now known as the \"Chapel of the Angel,\" was partly rebuilt to a square ground-plan, in place of the previously semi-circular western end. Another decree in 1853 from the sultan solidified the existing territorial division among the communities and set a \"status quo\" for arrangements to \"remain forever,\" causing differences of opinion about upkeep and even minor changes, including disagreement on the removal of the \"Immovable Ladder\", an exterior ladder under one of the windows; this ladder has remained in the same position since then.\n\nThe cladding of red marble applied to the Aedicule by Komnenos has deteriorated badly and is detaching from the underlying structure; since 1947 it has been held in place with an exterior scaffolding of iron girders installed by the British authorities. A careful renovation is undergoing, funded by a $4 million gift from King Abdullah II of Jordan and a $1.3-million gift from Mica Ertegun.\n\nThe current dome dates from 1870, although it was restored between 1994–1997, as part of extensive modern renovations to the church which have been ongoing since 1959. During the 1970–1978 restoration works and excavations inside the building, and under the nearby Muristan, it was found that the area was originally a quarry, from which white meleke limestone was struck. To the east of the Chapel of Saint Helena, the excavators discovered a void containing a 2nd-century drawing of a Roman ship, two low walls which supported the platform of Hadrian's 2nd-century temple, and a higher 4th-century wall built to support Constantine's basilica. After the excavations of the early 1970s, the Armenian authorities converted this archaeological space into the Chapel of Saint Vartan, and created an artificial walkway over the quarry on the north of the chapel, so that the new Chapel could be accessed (by permission) from the Chapel of Saint Helena.\n\nIn 2016, restoration works were performed in the Aedicule. For the first time since at least 1555, marble cladding which protected the estimated burial bed of Jesus from vandalism and souvenir takershttp://cnsnews.com/commentary/eric-metaxas/history-revealed-jesuss-tomb-discovered-church-holy-sepulchre-empty was removed. When the cladding was first removed on October 26, an initial inspection by the National Technical University of Athens team showed only a layer of fill material underneath. By the night of October 28, the original limestone burial bed was revealed intact. This suggested that the tomb location has not changed through time and confirmed the existence of the original limestone cave walls within the Aedicule. The tomb was resealed shortly thereafter.\n\nDescription\n\nParvis (courtyard)\n\nThe courtyard facing the entrance to the church is known as the parvis.\n\nLocated around the parvis are a few smaller structures.\n\nSouth of the parvis, opposite the church:\n* Broken columns—once forming part of an arcade—stand opposite the church, at the top of a short descending staircase stretching over the entire breadth of the parvis. In the 13th century, the tops of the columns were removed and sent to Mecca by the Khwarezmids.\n* The Gethsemane Metochion, a small Greek Orthodox monastery.\n\nOn the eastern side of the parvis, south to north:\n* The Monastery of St Abraham (Greek Orthodox)\n* The Chapel of St John (Armenian Orthodox)\n* The Chapel of St Michael (Coptic/Ethiopian Orthodox), giving access to the roof of the Chapel of St Helen and the Ethiopian monastery.\nNorth of the parvis, in front of the church facade or against it:* Chapel of the Franks—a blue-domed Roman Catholic Crusader chapel dedicated to Our Lady of Sorrows, which once provided exclusive access to Calvary. The chapel marks the 10th Station of the Cross (the stripping of Jesus' garments).\n* A Greek Orthodox oratory and chapel, just beneath the Chapel of the Franks, dedicated to St. Mary of Egypt.\n* The tomb of Philip d'Aubigny (Phillipe Daubeney, d. 1236)—a knight, tutor, and royal councilor to King Henry III of England and signer of the Magna Carta—is placed in front of, and between, the two original entrance doors of the church, of which the eastern one is walled-up. It is one of the few tombs of crusaders and other Europeans not removed from the Church after the Muslim recapture of Jerusalem in the 12th century. A stone marker was placed on his tomb in 1925, sheltered by a wooden trapdoor which hides it from view.\n\nA group of three chapels is bordering the parvis on its west side. They originally formed the baptistery complex of the Constantinian church. The southernmost chapel was the vestibule, the middle chapel the actual baptistery, and the north chapel the chamber in which the patriarch chrismated the newly baptized before leading them into the rotunda north of this complex. Now they are dedicated as (from south to north)\n* The Chapel of St. James the Just (Greek Orthodox),\n* The Chapel of St. John the Baptist (Greek Orthodox),\n* The Chapel of the Forty Martyrs of Sebaste (Greek Orthodox; at the base of the bell tower).\n\nBell tower\n\nThe church's bell tower is located to the left of the façade. It is currently almost half its original size.http://www.sepulchre.custodia.org/default.asp?id\n4100\n\nFacade and entrance\n\nThe entrance to the church, a single door in the south transept—through the crusader façade—is found past a group of streets winding through the outer Via Dolorosa, by way of a local souq in the Muristan. This narrow way of access to such a large structure has proven to be hazardous at times. For example, when a fire broke out in 1840, dozens of pilgrims were trampled to death.\n\nThe \"Immovable Ladder\", in its latest incarnation, stands beneath a window on the façade.\n\nHistorically, two large, arched doors allowed access to the church. However, only the left-hand entrance is currently accessible, as the right door has long since been bricked up. These entrances are located in the parvis of a larger courtyard, or plaza.\n\nCalvary (Golgotha)\n\nJust inside the church is a stairway climbing to Calvary (Golgotha), traditionally regarded as the site of Jesus' crucifixion and the most lavishly decorated part of the church. The exit is via another stairway opposite the first, leading down to the ambulatory. The Golgotha and its chapels are just south of the main altar of the Catholicon.\n\nOn the ground floor, underneath the Golgotha chapel proper, are the Chapel of Adam and the Treasury of the Greek Orthodox Patriarchate, holding many relics including an alleged fragment of the Holy Cross.\n\nThe raised Chapel of the Calvary, or Golgotha Chapel, contains the apex of the Rock of Calvary (12th Station of the Cross). It is split into two halves, one Greek Orthodox and one Catholic, each one with its own altar. The northern half with the main altar belongs to the Greek Orthodox. The rock can be seen under glass on both sides of the altar, and beneath the altar there is a hole in the rock, said to be the place where the cross was raised. Due to the significance of this, it is the most visited site in the Church of the Holy Sepulchre along with the Tomb of Jesus. The Roman Catholic (Franciscan) Chapel of the Nailing of the Cross (11th Station of the Cross) stretches south of it. Between the Catholic and the Orthodox altar, there is a statue of Mary, believed by some to be miraculous. It marks the 13th Station of the Cross, where Jesus' body was removed from the cross and given to his family and disciples.\n\nBeneath the Calvary and the two chapels there, on the main floor, there is the Chapel of Adam. According to tradition, Jesus was crucified over the place where Adam's skull was buried. According to some, at the crucifixion, the blood of Christ ran down the cross and through the rocks to fill the skull of Adam.William R. Cook of State University of New York, lecture series The Rock of Calvary appears cracked through a window on the altar wall, with the crack traditionally claimed to be caused by the earthquake that occurred when Jesus died on the cross, while some scholars claim it to be the result of quarrying against a natural flaw in the rock.\n\nStone of Anointing\n\nJust inside the entrance to the church is the Stone of Anointing (also Stone of the Anointing or Stone of Unction), which tradition believes to be the spot where Jesus' body was prepared for burial by Joseph of Arimathea. However, this tradition is only attested since the crusader era (notably by the Italian Dominican pilgrim Riccoldo da Monte di Croce in 1288), and the present stone was only added in the 1810 reconstruction.\n\nThe wall behind the stone is defined by its striking blue balconies and tau cross-bearing red banners (depicting the insignia of the Brotherhood of the Holy Sepulchre), and is decorated with lamps. The modern three-part mosaic along the wall depicts the anointing of Jesus' body, preceded on the right by the Descent from the Cross, and succeeded on the left by the Burial of Jesus.\n\nThe wall was a temporary addition to support the arch above it, which had been weakened after the damage in the 1808 fire; it blocks the view of the rotunda, separates the entrance from the Catholicon, sits on top of the now-empty and desecrated graves of four 12th-century crusader kings—including Godfrey of Bouillon and Baldwin I of Jerusalem—and is no longer structurally necessary. There is a difference of opinion as to whether it is to be seen as the 13th Station of the Cross, which others identify as the lowering of Jesus from the cross and locate between the 11th and 12th stations up on Calvary.\n\nThe lamps that hang over the Stone of Unction, adorned with cross-bearing chain links, are contributed by Armenians, Copts, Greeks and Latins.\n\nImmediately to the left of the entrance is a bench that has traditionally been used by the church's Muslim doorkeepers, along with some Christian clergy, as well as electrical wiring. To the right of the entrance is a wall along the ambulatory containing, to the very right, the staircase leading to Golgotha. Further along the same wall is the entrance to the Chapel of Adam.\n\nRotunda and Aedicule\n\nThe Rotunda is located in the centre of the Anastasis, beneath the larger of the church's two domes. In the center of the Rotunda is the chapel called the Aedicule, which contains the Holy Sepulchre itself. The Aedicule has two rooms, the first holding the Angel's Stone, which is believed to be a fragment of the large stone that sealed the tomb; the second is the tomb itself. Possibly due to the fact that pilgrims laid their hands on the tomb and/or to prevent eager pilgrims from removing bits of the original rock as souvenirs, a marble plaque was placed in the fourteenth century on the tomb to prevent further damage to the tomb.\n\nUnder the status quo, the Eastern Orthodox, Roman Catholic, and Armenian Apostolic Churches all have rights to the interior of the tomb, and all three communities celebrate the Divine Liturgy or Holy Mass there daily. It is also used for other ceremonies on special occasions, such as the Holy Saturday ceremony of the Holy Fire led by the Greek Orthodox Patriarch (with the participation of the Coptic and Armenian patriarchs). To its rear, in a chapel constructed of iron latticework upon a stone base semicircular in plan, lies the altar used by the Coptic Orthodox. Historically, the Georgians also retained the key to the Aedicule.\n\nFrom May 2016 to March 2017, the Aedicule underwent restoration and repairs after the Israel Antiquities Authority declared the structure unsafe. Much of the $3 million project was funded by the World Monuments Fund.\n\nWest of the Aedicule, to the rear of the Rotunda, is a chapel (see \"Syriac Chapel with Tomb of Joseph of Arimathea\") located in a Constantinian apse and containing an opening to a rock-cut ancient Jewish tomb. This chapel is where the Syriac Orthodox celebrate their Liturgy on Sundays.\n\nTo the right of the Sepulchre on the northwestern edge of the Rotunda is the Chapel of the Apparition, which is reserved for Roman Catholic use (see \"Franciscan area north of the Aedicule\").\n\nCatholicon\n\n* The Catholicon – On the east side opposite the Rotunda is the Crusader structure housing the main altar of the Church, today the Greek Orthodox catholicon. The second, smaller dome sits directly over the centre of the transept crossing of the choir where the compas, an omphalos once thought to be the center of the world (associated to the site of the Crucifixion and the Resurrection), is situated. Since 1996 this dome is topped by the monumental Golgotha Crucifix which the Greek Patriarch Diodoros I of Jerusalem consecrated. It was at the initiative of Gustav Kühnel to erect a new crucifix at the Church of the Holy Sepulchre in Jerusalem that would not only be worthy of the singularity of the site, but that would also become a symbol of the efforts of unity in the community of Christian faith.\n\nEast of this is a large iconostasis demarcating the Orthodox sanctuary before which is set the throne of the Greek Orthodox Patriarch of Jerusalem on the south side facing the throne of the Greek Orthodox Patriarch of Antioch on the north side.\n\nAmbulatory\n\n* Prison of Christ – In the north-east side of the complex there is The Prison of Christ, alleged by the Franciscans to be where Jesus was held. The Greek Orthodox allege that the real place that Jesus was held was the similarly named Prison of Christ, in their Monastery of the Praetorium, located near the Church of Ecce Homo, between the Second and Third Stations of the Via Dolorosa. The Armenians regard a recess in the Monastery of the Flagellation at the Second Station of the Via Dolorosa, as the Prison of Christ. A cistern among the ruins beneath the Church of St. Peter in Gallicantu on Mount Zion is also alleged to have been the Prison of Christ. To reconcile the traditions, some allege that Jesus was held in the Mount Zion cell in connection with his trial by the Jewish High Priest, at the Praetorium in connection with his trial by the Roman governor Pilate, and near the Golgotha before crucifixion.\n\nFurther to the east in the ambulatory are three chapels (from south to north):\n* Greek Chapel of Saint Longinus – The Orthodox Greek chapel is dedicated to Saint Longinus.\n* Armenian Chapel of Division of Robes\n* Greek Chapel of the Derision – the southernmost chapel in the ambulatory.\n\nChapel of Saint Helena\n\n* Chapel of Saint Helena – between the first two chapels are stairs descending to the Chapel of Saint Helena.\n* Chapel of Vartan (or Vardan) Mamikonian – on the north side of the Chapel of Saint Helena is an ornate wrought iron door, beyond which a raised artificial platform affords views of the quarry, and which leads to the Chapel of Saint Vartan. The latter chapel contains archaeological remains from Hadrian's temple and Constantine's basilica. These areas are open only on request.\n* Chapel of the Invention of the Holy Cross – another set of 22 stairs from the Chapel of Saint Helena leads down to the Roman Catholic Chapel of the Invention of the Holy Cross, believed to be the place where the True Cross was found.\n\nFranciscan area north of the Aedicule\n\n* The Franciscan Chapel of St. Mary Magdalene – The chapel indicates the place where Mary Magdalene met Jesus after his resurrection.\n* The Franciscan Chapel of the Blessed Sacrament (or Chapel of the Apparition) – in memory of Jesus' meeting with his mother after the Resurrection.\n\nSyriac Chapel with Tomb of Joseph of Arimathea\n\n*The Syriac Orthodox Chapel of Saint Joseph of Arimathea and Saint Nicodemus. On Sundays and feast days it is furnished for the celebration of Mass.\n\nIt is accessed from the Rotunda, by a door west of the Aedicule. On the far side of the chapel is the low entrance to an almost complete 1st-century Jewish tomb, initially holding six kokh-type funeral shafts radiating from a central chamber, of which two are still exposed. Although this space was discovered recently and contains no identifying marks, many Christians believe that Saints Joseph of Arimathea and Nicodemus were buried here.\n\nSince Jews always buried their dead outside the city, the presence of this tomb proves that the Holy Sepulchre site was outside the city walls at the time of the crucifixion.\n\nArmenian monastery south of the Aedicule\n\nSouth of the Aedicule is the \"Place of the Three Marys\", marked by a stone canopy and a large modern wall mosaic. From here one can enter the Armenian monastery which stretches over the ground and first upper floor of the church's southeastern part.\n\nStatus quo\n\nThe Sultan's firman (decree) of 1853, known as the \"status quo\", pinned down the now permanent statutes of property and the regulations concerning the roles of the different denominations and other custodians.\n\nThe primary custodians are the Greek Orthodox, Armenian Apostolic, and Roman Catholic Churches, with the Greek Orthodox Church having the lion's share. In the 19th century, the Coptic Orthodox, the Ethiopian Orthodox and the Syriac Orthodox acquired lesser responsibilities, which include shrines and other structures in and around the building. Times and places of worship for each community are strictly regulated in common areas. The Greek Orthodox act through the Greek Orthodox Patriarchate as well as through the Brotherhood of the Holy Sepulchre. The Roman Catholics act through the Franciscan Custody of the Holy Land.\n\nThe establishment of the 1853 status quo did not halt controversy and sometimes violence, which continues to break out occasionally. On a hot summer day in 2002, a Coptic monk moved his chair from its agreed spot into the shade. This was interpreted as a hostile move by the Ethiopians, and eleven were hospitalized after the resulting fracas.\n\nIn another incident in 2004, during Orthodox celebrations of the Exaltation of the Holy Cross, a door to the Franciscan chapel was left open. This was taken as a sign of disrespect by the Orthodox and a fistfight broke out. Some people were arrested, but no one was seriously injured.\n\nOn Palm Sunday, in April 2008, a brawl broke out when a Greek monk was ejected from the building by a rival faction. Police were called to the scene but were also attacked by the enraged brawlers. On Sunday, 9 November 2008, a clash erupted between Armenian and Greek monks during celebrations for the Feast of the Cross.\n\nA less grave sign of this state of affairs is located on a window ledge over the church's entrance. A wooden ladder was placed there at some time before 1852, when the status quo defined both the doors and the window ledges as common ground. This ladder, the \"Immovable Ladder\", in its latest incarnation, remains to this day, in almost exactly the same position it occupied in century-old photographs and engravings, as it must be replaced whenever it falls apart. An engraving by David Roberts in 1839 also shows the same ladder in the same position.\n\nNo one controls the main entrance. In 1192, Saladin assigned door-keeping responsibilities to the Muslim Nuseibeh family. The wooden doors that compose the main entrance are the original, highly carved doors.William R. Cook of University of New York, lecture series The Joudeh Al-Goudia family were entrusted as custodian to the keys of the Holy Sepulchre by Saladin in 1187.\n\nDespite occasional disagreements, the religious services take place in the Church with regularity and coexistence is generally peaceful. An example of concord between the Church custodians is the recent (2016–17) full restoration of the Aedicule.\n\nConnection to temple of Aphrodite\n\nThe site of the Church had been a temple of Aphrodite before Constantine's edifice was built. Hadrian's temple had actually been located there because it was the junction of the main north-south road with one of the two main east-west roads and directly adjacent to the forum (which is now the location of the (smaller) Muristan); the forum itself had been placed, as is traditional in Roman towns, at the junction of the main north-south road with the (other) main east-west road (which is now El-Bazar/David Street). The temple and forum together took up the entire space between the two main east-west roads (a few above-ground remains of the east end of the temple precinct still survive in the Alexander Nevsky Church complex of the Russian Mission in Exile).\n\nFrom the archaeological excavations in the 1970s, it is clear that construction took over most of the site of the earlier temple enclosure and that the Triportico and Rotunda roughly overlapped with the temple building itself; the excavations indicate that the temple extended at least as far back as the Aedicule, and the temple enclosure would have reached back slightly further. Virgilio Canio Corbo, a Franciscan priest and archaeologist, who was present at the excavations, estimated from the archaeological evidence that the western retaining wall, of the temple itself, would have passed extremely close to the east side of the supposed tomb; if the wall had been any further west any tomb would have been crushed under the weight of the wall (which would be immediately above it) if it had not already been destroyed when foundations for the wall were made.\n\nOther archaeologists have criticized Corbo's reconstructions. Dan Bahat, the former city archaeologist of Jerusalem, regards them as unsatisfactory, as there is no known temple of Aphrodite matching Corbo's design, and no archaeological evidence for Corbo's suggestion that the temple building was on a platform raised high enough to avoid including anything sited where the Aedicule is now; indeed Bahat notes that many temples to Aphrodite have a rotunda-like design, and argues that there is no archaeological reason to assume that the present rotunda was not based on a rotunda in the temple previously on the site.\n\nLocation\n\n \nThe Bible describes Jesus's tomb as being outside the city wall,for example,  as was normal for burials across the ancient world, which were regarded as unclean.Toynbee, Jocelyn M. C. [https://books.google.com/books?idrHd1MDlV-eUC&pg\nPA14&dqFunerary+art&lr\n&as_brr3&ei\nmfHeS-XqKYniywT0nb3_CA&cd21#v\nonepage&qFunerary%20art&f\nfalse Death and Burial in the Roman World], pp. 48–49, JHU Press. 1996. . An exception in the Classical World were the Lycians of Anatolia. There are also the Egyptian mortuary-temples, where the object of worship was the deified royal person entombed, but Egyptian temples to the major gods contained no burials. Today, the site of the Church is within the current walls of the old city of Jerusalem. It has been well documented by archaeologists that in the time of Jesus, the walled city was smaller and the wall then was to the east of the current site of the Church. In other words, the city had been much narrower in Jesus' time, with the site then having been outside the walls; since Herod Agrippa (41–44) is recorded by history as extending the city to the north (beyond the present northern walls), the required repositioning of the western wall is traditionally attributed to him as well.\n\nThe area immediately to the south and east of the sepulchre was a quarry and outside the city during the early 1st century as excavations under the Lutheran Church of the Redeemer across the street demonstrated.\n\nThe church is a part of the UNESCO World Heritage Site Old City of Jerusalem.\n\nThe Christian Quarter and the (also Christian) Armenian Quarter of the Old City of Jerusalem are both located in the northwestern and western part of the Old City, due to the fact that the Holy Sepulchre is located close to the northwestern corner of the walled city. The adjacent neighbourhood within the Christian  Quarter is called the Muristan, a term derived from the Persian word for hospital - Christian pilgrim hospices have been maintained in this area near the Holy Sepulchre since at least the time of Charlemagne.\n\nInfluence\n\nFrom the 9th century, the construction of churches inspired in the Anastasis was extended across Europe.[http://www.abbaziasantostefano.it/storia.htm Monastero di Santo Stefano: Basilica Santuario Santo Stefano: Storia], Bologna. One example is Santo Stefano in Bologna, Italy, an agglomeration of seven churches recreating shrines of Jerusalem.\n\nSeveral churches and monasteries in Europe, for instance, in Germany and Russia, and at least one church in the United States have been modeled on the Church of the Resurrection, some even reproducing other holy places for the benefit of pilgrims who could not travel to the Holy Land. They include the Heiliges Grab of Görlitz, constructed between 1481 and 1504, the New Jerusalem Monastery in Moscow Oblast, constructed by Patriarch Nikon between 1656 and 1666, and Mount St. Sepulchre Franciscan Monastery built by the Franciscans in Washington, DC in 1898. Church of the Holy Sepulchre. http://en.wikipedia.org/?curid=7810."
  }
}
