{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6038",
  "eid" : "d98d1130-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778444739,
  "textBody" : "Chemical engineering is a branch of engineering that applies physical sciences (physics and chemistry), life sciences (microbiology and biochemistry), together with applied mathematics and economics to produce, transform, transport, and properly use chemicals, materials and energy. A chemical engineer designs large-scale processes that convert chemicals, raw materials, living cells, microorganisms and energy into useful forms and products.\n\nChemical engineers are involved in many aspects of plant design and operation, including safety and hazard assessments, process design and analysis, control engineering, chemical reaction engineering, construction specification and operating instructions.\nEtymology\n\nA 1996 British Journal for the History of Science article cites James F. Donnelly for mentioning an 1839 reference to chemical engineering in relation to the production of sulfuric acid. In the same paper however, George E. Davis, an English consultant, was credited for having coined the term. Davis also tried to found a Society of Chemical Engineering, but instead it was named the Society of Chemical Industry (1881), with Davis as its first Secretary. The History of Science in United States: An Encyclopedia puts the use of the term around 1890. \"Chemical engineering\", describing the use of mechanical equipment in the chemical industry, became common vocabulary in England after 1850. By 1910, the profession, \"chemical engineer,\" was already in common use in Britain and the United States.\n\nHistory\n\n \nChemical engineering emerged upon the development of unit operations, a fundamental concept of the discipline of chemical engineering. Most authors agree that Davis invented the concept of unit operations if not substantially developed it. He gave a series of lectures on unit operations at the Manchester Technical School (later part of the University of Manchester) in 1887, considered to be one of the earliest such about chemical engineering. Three years before Davis' lectures, Henry Edward Armstrong taught a degree course in chemical engineering at the City and Guilds of London Institute. Armstrong's course \"failed simply because its graduates ... were not especially attractive to employers.\" Employers of the time would have rather hired chemists and mechanical engineers. Courses in chemical engineering offered by Massachusetts Institute of Technology (MIT) in the United States, Owens College in Manchester, England, and University College London suffered under similar circumstances.\n\nStarting from 1888, Lewis M. Norton taught at MIT the first chemical engineering course in the United States. Norton's course was contemporaneous and essentially similar with Armstrong's course. Both courses, however, simply merged chemistry and engineering subjects. \"Its practitioners had difficulty convincing engineers that they were engineers and chemists that they were not simply chemists.\" Unit operations was introduced into the course by William Hultz Walker in 1905. By the early 1920s, unit operations became an important aspect of chemical engineering at MIT and other US universities, as well as at Imperial College London. The American Institute of Chemical Engineers (AIChE), established in 1908, played a key role in making chemical engineering considered an independent science, and unit operations central to chemical engineering. For instance, it defined chemical engineering to be a \"science of itself, the basis of which is ... unit operations\" in a 1922 report; and with which principle, it had published a list of academic institutions which offered \"satisfactory\" chemical engineering courses. Meanwhile, promoting chemical engineering as a distinct science in Britain lead to the establishment of the Institution of Chemical Engineers (IChemE) in 1922. IChemE likewise helped make unit operations considered essential to the discipline.\n\nNew concepts and innovations\n\nBy the 1940s, it became clear that unit operations alone were insufficient in developing chemical reactors. While the predominance of unit operations in chemical engineering courses in Britain and the United States continued until the 1960s, transport phenomena started to experience greater focus. Along with other novel concepts, such process systems engineering (PSE), a \"second paradigm\" was defined. Transport phenomena gave an analytical approach to chemical engineering while PSE focused on its synthetic elements, such as control system and process design. Developments in chemical engineering before and after World War II were mainly incited by the petrochemical industry, however, advances in other fields were made as well. Advancements in biochemical engineering in the 1940s, for example, found application in the pharmaceutical industry, and allowed for the mass production of various antibiotics, including penicillin and streptomycin. Meanwhile, progress in polymer science in the 1950s paved way for the \"age of plastics\".\n\nSafety and hazard developments\n\nConcerns regarding the safety and  environmental impact of large-scale chemical manufacturing facilities were also raised during this period. Silent Spring, published in 1962, alerted its readers to the harmful effects of DDT, a potent insecticide. The 1974 Flixborough disaster in the United Kingdom resulted in 28 deaths, as well as damage to a chemical plant and three nearby villages. The 1984 Bhopal disaster in India resulted in almost 4,000 deaths . These incidents, along with other incidents, affected the reputation of the trade as industrial safety and environmental protection were given more focus. In response, the IChemE required safety to be part of every degree course that it accredited after 1982. By the 1970s, legislation and monitoring agencies were instituted in various countries, such as France, Germany, and the United States.\n\nRecent progress\n\nAdvancements in computer science found applications designing and managing plants, simplifying calculations and drawings that previously had to be done manually. The completion of the Human Genome Project is also seen as a major development, not only advancing chemical engineering but genetic engineering and genomics as well. Chemical engineering principles were used to produce DNA sequences in large quantities.\n\nConcepts\n\nChemical engineering involves the application of several principles. Key concepts are presented below.\n\nChemical reaction engineering\n\nChemical engineering involves managing plant processes and conditions to ensure optimal plant operation. Chemical reaction engineers construct models for reactor analysis and design using laboratory data and physical parameters, such as chemical thermodynamics, to solve problems and predict reactor performance.\n\nPlant design and construction\n\nChemical engineering design concerns the creation of plans, specification, and economic analyses for pilot plants, new plants or plant modifications. Design engineers often work in a consulting role, designing plants to meet clients' needs. Design is limited by a number of factors, including funding, government regulations and safety standards. These constraints dictate a plant's choice of process, materials and equipment.\n\nPlant construction is coordinated by project engineers and project managers Herbst, Andrew; Hans Verwijs (Oct. 19-22). \"Project Engineering: Interdisciplinary Coordination and Overall Engineering Quality Control\". Proc. of the Annual IAC conference of the American Society for Engineering Management 1 (): 15–21 depending on the size of the investment. A chemical engineer may do the job of project engineer full-time or part of the time, which requires additional training and job skills, or act as a consultant to the project group. In USA the education of chemical engineering graduates from the Baccalaureate programs accredited by ABET do not usually stress project engineering education, which can be obtained by specialized training, as electives, or from graduate programs.  Project engineering jobs are some of the largest employers for chemical engineers.\n\nProcess design and analysis\n\nA unit operation is a physical step in an individual chemical engineering process. Unit operations (such as crystallization, filtration, drying and evaporation) are used to prepare reactants, purifying and separating its products, recycling unspent reactants, and controlling energy transfer in reactors. On the other hand, a unit process is the chemical equivalent of a unit operation. Along with unit operations, unit processes constitute a process operation. Unit processes (such as nitration and oxidation) involve the conversion of material by biochemical, thermochemical and other means. Chemical engineers responsible for these are called process engineers.\n\nProcess design requires the definition of equipment types and sizes as well as how they are connected together and the materials of construction. Details are often printed on a Process Flow Diagram which is used to control the capacity and reliability of a new or modified chemical factory.\n\nEducation for chemical engineers in the first college degree 3 or 4 years of study stresses the principles and practices of process design. The same skills are used in existing chemical plants to evaluate the efficiency and make recommendations for improvements.\n\nTransport phenomena\n\nModeling and analysis of transport phenomena is essential for many industrial applications. Transport phenomena involve fluid dynamics, heat transfer and mass transfer, which are governed mainly by momentum transfer, energy transfer and transport of chemical species respectively. Models often involve separate considerations for  macroscopic, microscopic and molecular level phenomena. Modeling of transport phenomena therefore requires an understanding of applied mathematics.\n\nApplications and practice\n\nChemical engineers \"develop economic ways of using materials and energy\". Chemical engineers use chemistry and engineering to turn raw materials into usable products, such as medicine, petrochemicals and plastics on a large-scale, industrial setting. They are also involved in waste management and research. Both applied and research facets could make extensive use of computers.\n\nChemical engineers may be involved in industry or university research where they are tasked with designing and performing experiments to create better and safer methods for production, pollution control, and resource conservation. They may be involved in designing and constructing plants as a project engineer. Chemical engineers serving as project engineers use their knowledge in selecting optimal production methods and plant equipment to minimize costs and maximize safety and profitability. After plant construction, chemical engineering project managers may be involved in equipment upgrades, process changes, troubleshooting, and daily operations in either full-time or consulting roles. \n\nRelated fields and topics\n\nToday, the field of chemical engineering is a diverse one, covering areas from biotechnology and nanotechnology  to mineral processing.\n\n*Biochemical engineering\n*Biological engineering\n*Bioprocess engineering\n*Bioinformatics\n*Biomedical engineering\n*Biomolecular engineering\n*Biotechnology\n*Biotechnology engineering\n*Catalysts\n*Ceramics\n*Chemical process modeling\n*Chemical Technologist\n*Chemical reactor\n*Chemical weapons\n*Cheminformatics\n*Computational fluid dynamics\n*Corrosion engineering\n*Cost estimation\n*Electrochemistry\n* Electrochemical engineering\n*Environmental engineering\n*Earthquake engineering\n*Fischer Tropsch synthesis\n\n*Fluid dynamics\n*Food engineering\n*Fuel cell\n*Gasification\n*Heat transfer\n*Industrial chemistry\n*Industrial gas\n*Industrial catalysts\n*Mass transfer\n*Materials science\n*Metallurgy\n*Microfluidics\n*Mineral processing\n*Molecular engineering\n*Nanotechnology\n*Natural environment\n*Natural gas processing\n*Nuclear reprocessing\n*Oil exploration\n*Oil refinery\n*Petroleum engineering\n*Pharmaceutical engineering\n\n*Plastics engineering\n*Polymers\n*Process control\n*Process design\n*Process development\n*Process engineering\n*Process miniaturization\n*Paper engineering\n*Safety engineering\n*Semiconductor device fabrication\n*Separation processes (see also: separation of mixture)\n**Crystallization processes\n**Distillation processes\n**Membrane processes\n*Syngas production\n*Textile engineering\n*Thermodynamics\n*Transport phenomena\n*Unit operations\n*Water technology",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Chemical engineering" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6038" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Chemical engineering is a branch of engineering that applies physical sciences (physics and chemistry), life sciences (microbiology and biochemistry), together with applied mathematics and economics to produce, transform, transport, and properly use chemicals, materials and energy. A chemical engineer designs large-scale processes that convert chemicals, raw materials, living cells, microorganisms and energy into useful forms and products.\n\nChemical engineers are involved in many aspects of plant design and operation, including safety and hazard assessments, process design and analysis, control engineering, chemical reaction engineering, construction specification and operating instructions.\nEtymology\n\nA 1996 British Journal for the History of Science article cites James F. Donnelly for mentioning an 1839 reference to chemical engineering in relation to the production of sulfuric acid. In the same paper however, George E. Davis, an English consultant, was credited for having coined the term. Davis also tried to found a Society of Chemical Engineering, but instead it was named the Society of Chemical Industry (1881), with Davis as its first Secretary. The History of Science in United States: An Encyclopedia puts the use of the term around 1890. \"Chemical engineering\", describing the use of mechanical equipment in the chemical industry, became common vocabulary in England after 1850. By 1910, the profession, \"chemical engineer,\" was already in common use in Britain and the United States.\n\nHistory\n\n \nChemical engineering emerged upon the development of unit operations, a fundamental concept of the discipline of chemical engineering. Most authors agree that Davis invented the concept of unit operations if not substantially developed it. He gave a series of lectures on unit operations at the Manchester Technical School (later part of the University of Manchester) in 1887, considered to be one of the earliest such about chemical engineering. Three years before Davis' lectures, Henry Edward Armstrong taught a degree course in chemical engineering at the City and Guilds of London Institute. Armstrong's course \"failed simply because its graduates ... were not especially attractive to employers.\" Employers of the time would have rather hired chemists and mechanical engineers. Courses in chemical engineering offered by Massachusetts Institute of Technology (MIT) in the United States, Owens College in Manchester, England, and University College London suffered under similar circumstances.\n\nStarting from 1888, Lewis M. Norton taught at MIT the first chemical engineering course in the United States. Norton's course was contemporaneous and essentially similar with Armstrong's course. Both courses, however, simply merged chemistry and engineering subjects. \"Its practitioners had difficulty convincing engineers that they were engineers and chemists that they were not simply chemists.\" Unit operations was introduced into the course by William Hultz Walker in 1905. By the early 1920s, unit operations became an important aspect of chemical engineering at MIT and other US universities, as well as at Imperial College London. The American Institute of Chemical Engineers (AIChE), established in 1908, played a key role in making chemical engineering considered an independent science, and unit operations central to chemical engineering. For instance, it defined chemical engineering to be a \"science of itself, the basis of which is ... unit operations\" in a 1922 report; and with which principle, it had published a list of academic institutions which offered \"satisfactory\" chemical engineering courses. Meanwhile, promoting chemical engineering as a distinct science in Britain lead to the establishment of the Institution of Chemical Engineers (IChemE) in 1922. IChemE likewise helped make unit operations considered essential to the discipline.\n\nNew concepts and innovations\n\nBy the 1940s, it became clear that unit operations alone were insufficient in developing chemical reactors. While the predominance of unit operations in chemical engineering courses in Britain and the United States continued until the 1960s, transport phenomena started to experience greater focus. Along with other novel concepts, such process systems engineering (PSE), a \"second paradigm\" was defined. Transport phenomena gave an analytical approach to chemical engineering while PSE focused on its synthetic elements, such as control system and process design. Developments in chemical engineering before and after World War II were mainly incited by the petrochemical industry, however, advances in other fields were made as well. Advancements in biochemical engineering in the 1940s, for example, found application in the pharmaceutical industry, and allowed for the mass production of various antibiotics, including penicillin and streptomycin. Meanwhile, progress in polymer science in the 1950s paved way for the \"age of plastics\".\n\nSafety and hazard developments\n\nConcerns regarding the safety and  environmental impact of large-scale chemical manufacturing facilities were also raised during this period. Silent Spring, published in 1962, alerted its readers to the harmful effects of DDT, a potent insecticide. The 1974 Flixborough disaster in the United Kingdom resulted in 28 deaths, as well as damage to a chemical plant and three nearby villages. The 1984 Bhopal disaster in India resulted in almost 4,000 deaths . These incidents, along with other incidents, affected the reputation of the trade as industrial safety and environmental protection were given more focus. In response, the IChemE required safety to be part of every degree course that it accredited after 1982. By the 1970s, legislation and monitoring agencies were instituted in various countries, such as France, Germany, and the United States.\n\nRecent progress\n\nAdvancements in computer science found applications designing and managing plants, simplifying calculations and drawings that previously had to be done manually. The completion of the Human Genome Project is also seen as a major development, not only advancing chemical engineering but genetic engineering and genomics as well. Chemical engineering principles were used to produce DNA sequences in large quantities.\n\nConcepts\n\nChemical engineering involves the application of several principles. Key concepts are presented below.\n\nChemical reaction engineering\n\nChemical engineering involves managing plant processes and conditions to ensure optimal plant operation. Chemical reaction engineers construct models for reactor analysis and design using laboratory data and physical parameters, such as chemical thermodynamics, to solve problems and predict reactor performance.\n\nPlant design and construction\n\nChemical engineering design concerns the creation of plans, specification, and economic analyses for pilot plants, new plants or plant modifications. Design engineers often work in a consulting role, designing plants to meet clients' needs. Design is limited by a number of factors, including funding, government regulations and safety standards. These constraints dictate a plant's choice of process, materials and equipment.\n\nPlant construction is coordinated by project engineers and project managers Herbst, Andrew; Hans Verwijs (Oct. 19-22). \"Project Engineering: Interdisciplinary Coordination and Overall Engineering Quality Control\". Proc. of the Annual IAC conference of the American Society for Engineering Management 1 (): 15–21 depending on the size of the investment. A chemical engineer may do the job of project engineer full-time or part of the time, which requires additional training and job skills, or act as a consultant to the project group. In USA the education of chemical engineering graduates from the Baccalaureate programs accredited by ABET do not usually stress project engineering education, which can be obtained by specialized training, as electives, or from graduate programs.  Project engineering jobs are some of the largest employers for chemical engineers.\n\nProcess design and analysis\n\nA unit operation is a physical step in an individual chemical engineering process. Unit operations (such as crystallization, filtration, drying and evaporation) are used to prepare reactants, purifying and separating its products, recycling unspent reactants, and controlling energy transfer in reactors. On the other hand, a unit process is the chemical equivalent of a unit operation. Along with unit operations, unit processes constitute a process operation. Unit processes (such as nitration and oxidation) involve the conversion of material by biochemical, thermochemical and other means. Chemical engineers responsible for these are called process engineers.\n\nProcess design requires the definition of equipment types and sizes as well as how they are connected together and the materials of construction. Details are often printed on a Process Flow Diagram which is used to control the capacity and reliability of a new or modified chemical factory.\n\nEducation for chemical engineers in the first college degree 3 or 4 years of study stresses the principles and practices of process design. The same skills are used in existing chemical plants to evaluate the efficiency and make recommendations for improvements.\n\nTransport phenomena\n\nModeling and analysis of transport phenomena is essential for many industrial applications. Transport phenomena involve fluid dynamics, heat transfer and mass transfer, which are governed mainly by momentum transfer, energy transfer and transport of chemical species respectively. Models often involve separate considerations for  macroscopic, microscopic and molecular level phenomena. Modeling of transport phenomena therefore requires an understanding of applied mathematics.\n\nApplications and practice\n\nChemical engineers \"develop economic ways of using materials and energy\". Chemical engineers use chemistry and engineering to turn raw materials into usable products, such as medicine, petrochemicals and plastics on a large-scale, industrial setting. They are also involved in waste management and research. Both applied and research facets could make extensive use of computers.\n\nChemical engineers may be involved in industry or university research where they are tasked with designing and performing experiments to create better and safer methods for production, pollution control, and resource conservation. They may be involved in designing and constructing plants as a project engineer. Chemical engineers serving as project engineers use their knowledge in selecting optimal production methods and plant equipment to minimize costs and maximize safety and profitability. After plant construction, chemical engineering project managers may be involved in equipment upgrades, process changes, troubleshooting, and daily operations in either full-time or consulting roles. \n\nRelated fields and topics\n\nToday, the field of chemical engineering is a diverse one, covering areas from biotechnology and nanotechnology  to mineral processing.\n\n*Biochemical engineering\n*Biological engineering\n*Bioprocess engineering\n*Bioinformatics\n*Biomedical engineering\n*Biomolecular engineering\n*Biotechnology\n*Biotechnology engineering\n*Catalysts\n*Ceramics\n*Chemical process modeling\n*Chemical Technologist\n*Chemical reactor\n*Chemical weapons\n*Cheminformatics\n*Computational fluid dynamics\n*Corrosion engineering\n*Cost estimation\n*Electrochemistry\n* Electrochemical engineering\n*Environmental engineering\n*Earthquake engineering\n*Fischer Tropsch synthesis\n\n*Fluid dynamics\n*Food engineering\n*Fuel cell\n*Gasification\n*Heat transfer\n*Industrial chemistry\n*Industrial gas\n*Industrial catalysts\n*Mass transfer\n*Materials science\n*Metallurgy\n*Microfluidics\n*Mineral processing\n*Molecular engineering\n*Nanotechnology\n*Natural environment\n*Natural gas processing\n*Nuclear reprocessing\n*Oil exploration\n*Oil refinery\n*Petroleum engineering\n*Pharmaceutical engineering\n\n*Plastics engineering\n*Polymers\n*Process control\n*Process design\n*Process development\n*Process engineering\n*Process miniaturization\n*Paper engineering\n*Safety engineering\n*Semiconductor device fabrication\n*Separation processes (see also: separation of mixture)\n**Crystallization processes\n**Distillation processes\n**Membrane processes\n*Syngas production\n*Textile engineering\n*Thermodynamics\n*Transport phenomena\n*Unit operations\n*Water technology. Chemical engineering. http://en.wikipedia.org/?curid=6038."
  }
}
