{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11685",
  "eid" : "fd30c140-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778504532,
  "textBody" : "Frasier is an American sitcom that was broadcast on NBC for 11 seasons, premiering on September 16, 1993, and concluding on May 13, 2004. The program was created and produced by David Angell, Peter Casey, and David Lee (as Grub Street Productions) in association with Grammnet (2004) and Paramount Network Television. The series was created as a spin-off of Cheers,  continuing the story of psychiatrist Frasier Crane as he returned to his hometown of Seattle and started building a new life. Frasier stars Kelsey Grammer, Jane Leeves, David Hyde Pierce, Peri Gilpin, and John Mahoney. The show was critically acclaimed, with the show itself and the cast winning thirty-seven Emmy Awards, a then-record for a scripted series. It also won the Emmy for Outstanding Comedy Series for five consecutive years.\n\nOverview\n\nPsychiatrist Dr. Frasier Crane (Grammer) returns to his home town of Seattle, Washington, following the end of his marriage and his life in Boston (as seen in Cheers). His plans for a new life as a bachelor are challenged when he is obliged to take in his father, Martin (Mahoney), a retired Seattle Police Department detective, who has mobility problems after being shot in the line of duty during a robbery.\n\nFrasier hires Daphne Moon (Leeves) as Martin's live-in physical therapist and caregiver, and tolerates Martin's dog Eddie. Frasier frequently spends time with his younger brother Niles (Pierce), a fellow psychiatrist. Niles becomes attracted to, and eventually falls in love with, Daphne (notwithstanding his own marriage), but does not confess his feelings to her until the final episode of the seventh season.\n\nFrasier hosts The Dr. Frasier Crane Show, a call-in psychiatry show on talk radio station KACL. His producer Roz Doyle (Gilpin) is very different from Frasier in many ways. She is working class, has cheap tastes and, at least early in the series, has superficial relationships with many men. However, Roz and Frasier share a professional respect, and over time, they become best friends. Frasier and the others often visit the local coffee shop, Café Nervosa.\n\nThe Crane sons, who possess expensive tastes, intellectual interests, and high opinions of themselves, frequently clash with their blue-collar, Average Joe father. The brothers' close relationship is often tense, and their sibling rivalry intermittently results in chaos. Other recurring themes include Niles' relationship with his never-seen wife (later ex-wife) Maris, Frasier's search for love, Martin's new life after retirement, and the various attempts by the two brothers to gain acceptance into Seattle's cultural elite.\n\nCharacters\n\nMain\n\n* Kelsey Grammer as Frasier Crane is a radio psychiatrist.\n* Jane Leeves as Daphne Moon is an English physiotherapist and live-in housekeeper, hired by Frasier to help take care of Martin, who lives with them in Frasier's apartment.\n* David Hyde Pierce as Niles Crane is Frasier's younger brother, also a psychiatrist, who works in private practice.\n* Peri Gilpin as Roz Doyle is the producer of Frasier's radio show, who becomes a close family friend.\n* John Mahoney as Martin Crane is Frasier and Niles' father, a Seattle police detective who was forced to retire due to a gunshot wound to his hip that led to his living with Frasier.\n*Dan Butler as Bob \"Bulldog\" Briscoe (seasons 4–6; recurring season 1; special appearance seasons 2–3; special guest seasons 7 & 9–11) is a male chauvinist, horny, boastful host of a sports radio talk show that followed Frasier's daily broadcast at KACL.\n\nRecurring\n\n* Edward Hibbert as Gil Chesterton (seasons 2–8 & 10–11; guest season 1), KACL's flamboyant, effeminate restaurant critic\n* Patrick Kerr as Noel Shempsky (seasons 6–11; guest seasons 1 & 3–5) KACL technical assistant and avid Star Trek aficionado who speaks Klingon and constantly hits on Roz\n* Tom McGowan as Kenny Daly (seasons 7–11; guest seasons 5–6), KACL's station manager\n* Millicent Martin as Mrs. Moon (seasons 9–10; guest season 7, 11), Daphne's mother\n* Brian Klugman as Kirby (season 9; guest season 8), Bob and Lana's son, and part-timer at KACL\n* Ashley Thomas as Alice (seasons 10–11; co-star season 9), Roz's daughter\n\nNotes\n\nThe main cast remained unchanged for all 11 years. When the series ended in 2004, Grammer had portrayed the character of Frasier Crane for a total of 20 years, including his nine seasons on Cheers; at the time, he tied James Arness' portrayal of Matt Dillon on Gunsmoke for the longest-running character on primetime television. The record has since been surpassed in animation by the voice cast of The Simpsons, and in live action by Richard Belzer's portrayal of John Munch on the series Homicide: Life on the Street and Law & Order: Special Victims Unit. Grammer was briefly the highest-paid television actor in the United States for his portrayal of Frasier, while Jane Leeves was the highest-paid British actress.\n\nIn addition to those of the ensemble, additional story lines included characters from Frasier's former incarnation on Cheers, such as his ex-wife Lilith Sternin, played by Bebe Neuwirth, and their son Frederick, played by Trevor Einhorn.\n\nReunions \n\nGrammer had been the voice of Sideshow Bob on The Simpsons since 1990. In a 1997 episode (while Frasier was still in production), the character's brother, Cecil Terwilliger, was introduced, played by Pierce, as referenced in the episode title, \"Brother from Another Series\". The episode contained numerous Frasier references, including a Frasier-style version of The Simpsons theme for a transition and its iconic title card for the same thing. Pierce returned as Cecil for the second time (the first since Frasier had concluded) alongside Grammer in the 2007 episode \"Funeral for a Fiend\". The episode introduced the brothers' father, Dr. Robert Terwilliger,  who was portrayed by Mahoney.\n\nCast-member reunions also occurred on four episodes of Hot in Cleveland, which featured Leeves in the main cast along with Wendie Malick (who played Martin's girlfriend towards the end of Frasier). In the season-two episode \"Unseparated at Birth\" and season-three episode \"Funeral Crashers\", Mahoney guest-stars as a waiter smitten with Betty White's character. Gilpin appears in the episode \"I Love Lucci (Part 1)\", and Tom McGowan (who played Kenny Daly) appears in \"Love Thy Neighbor\" as a casting director. Hot in Cleveland was produced by Suzanne Martin, who wrote multiple episodes of Frasier.\n\nProduction \n\nCreation \n\nDuring the eighth season of Cheers, Grammer made a deal with former Cheers producers David Angell, Peter Casey, and David Lee (who were moving on to produce Wings) that they would do a new series together once Cheers ended. Once it became clear during the 10th season that the 11th would be the last, the group began working on their next series together.\n\nGrammer did not originally want to continue playing Frasier Crane, and Angell, Casey, and Lee did not want the new show to be compared to Cheers, which they had worked on before Wings. The three proposed that the actor play a wealthy, Malcolm Forbes-like paraplegic publisher who operated his business from his apartment. The main show featured a \"street-smart\" Hispanic live-in nurse who would clash with the main character. While Grammer liked the concept, Paramount Television disliked it, and suggested that the best route would be to spin off the Frasier Crane character. Grammer ultimately agreed to star in a Cheers spin-off, but the producers set the new show as far from Boston as possible to prevent NBC from demanding that other characters from the old show make guest appearances on the new show during its first season. After first choosing Denver, Angell, Casey, and Lee ultimately chose Seattle as the setting.\n\nThe creators did not want Frasier in private practice, which would make the show resemble The Bob Newhart Show. Taking from an unused idea they had for a Cheers episode, they conceived the idea of the psychiatrist working in a radio station surrounded by \"wacky, yet loveable\" characters. After realizing that such a setting resembled WKRP in Cincinnati, the creators decided to emphasize Frasier's home life, which Cheers had rarely explored. Lee thought of his own experiences with \"the relationship between an aging father and the grown-up son he never understood\" and thought it would be a good theme for Frasier. Although Frasier had mentioned on Cheers that his father, a research scientist, had died, they decided to overlook the discrepancy (which they attempted to explain in a second-season episode). One element of the original concept that was carried over was the live-in health-care provider which would be for Frasier's father. Grammer points out that very little of the Frasier Crane of Cheers carried over to Frasier, as his family history was changed, the setting, his job, and even the character himself changed from the Cheers predecessor, having to be more grounded as the central character of the show so the other supporting characters could be more eccentric.\n\nCasting \n\nMartin Crane was based on creator Casey's father, who spent 34 years with the San Francisco Police Department. The creators suggested to NBC that they would like to cast someone like Mahoney, to which NBC told them if they could get Mahoney, they could hire him without auditions. Both Grammer and the producers contacted Mahoney, with the producers flying to Chicago to show Mahoney the pilot script over dinner. Upon reading the script, Mahoney accepted. Grammer, who lost his father as a child, and the childless Mahoney immediately built a close father-son relationship. In discussing Martin's nurse, Warren Littlefield of NBC suggested she be English instead of Hispanic and suggested Leeves for the role. Grammer was initially reluctant, as he thought the casting made the show resemble Nanny and the Professor, but approved Leeves after a meeting and read-through with her. Mahoney and Leeves quickly bonded over their shared English heritage; Mahoney is originally from Manchester where Leeves' character is from.\n\nThe character of Niles was not part of the original concept for the show. Frasier had told his bar friends on Cheers that he was an only child.\"Behind The Couch: The Making of Frasier\", DVD Extra, Season 1 However, Sheila Guthrie, the assistant casting director on Wings, brought the producers a photo of Pierce (whom she knew from his work on The Powers That Be) and noted his resemblance to Grammer when he first appeared on Cheers. She recommended him should they ever want Frasier to have a brother. The creators were \"blown away\" both by his resemblance to Grammer and by his acting ability. They decided to ignore Frasier's statement on Cheers and created the role for Pierce. Pierce accepted the role before realizing he had not read a script. Once he was given a script, he was initially concerned that his character was essentially a duplicate of Frasier, thinking that it would not work.\nThe first table reading of the pilot script was notable because the producers had never heard either Pierce or Mahoney read lines because they were cast without auditions.\n\nThe only main role that required an audition was Roz Doyle, who was named in memory of a producer of Wings. The producers auditioned around 300 actresses with no particular direction in mind. Women of all ethnicities were considered. Lisa Kudrow was originally cast in the role, but during rehearsals, the producers decided they needed someone who could appear more assertive in her job and take control over Frasier at KACL, and Kudrow did not fit that role. The creators quickly hired Gilpin, their second choice.\n\nThe original focus of the series was intended to be the relationship between Frasier and Martin, and it was the focus of most of the first-season episodes. Once the show began airing, Niles became a breakout character, and more focus was added to the brothers' relationship, and other plots centering on Niles, starting in the second season.\"Marching On to Season Two\", DVD Extra, Season 2 The producers initially did not want to make Niles' wife Maris an unseen character because they did not want to draw parallels to Vera, Norm's wife on Cheers. They originally intended that she would appear after several episodes, but were enjoying writing excuses for her absence that eventually they decided she would remain unseen, and after the increasingly eccentric characteristics ascribed to her, no real actress could portray her.\n\nSets and settings \n\nFrasier's apartment was designed to be ultra-modern in an eclectic style (as Frasier himself points out in the pilot). One of the show's signature elements that it became well known for was the apartment's design which included elements such as a slightly split-level design, doors with triangular wooden inlay features, numerous pieces of well-known high-end furniture pieces (such as a replica of Coco Chanel's sofa, and both Eames and Wassily chairs) and a notable view from the terrace which was frequently complimented by visitors. The main set consisted of the open-concept living area with a sitting/TV space and dining area on the lower level and a piano exit to the terrace on the rear upper level. The set also included the kitchen through an open archway. A small section of the building corridor and elevator doors was built, as was a powder room near the front entrance. Two corridors off the living area ostensibly led to the apartment's three bedrooms. Sets for each of these rooms were built as separate sets on an as-needed basis.\"A Conversation with Art Director Roy Christopher\", DVD Extra, Season 3\n\nNo building or apartment in Seattle really has the view from Frasier's residence. It was created so the Space Needle, the most iconic landmark of Seattle, would appear more prominently. According to the season-one DVD bonus features, the photograph used on the set was taken from atop a cliff, possibly the ledge at Kerry Park, a frequent photography location. Despite this, Frasier has been said to have contributed to the emergence of an upscale urban lifestyle in 1990s Seattle, with buyers seeking properties in locations resembling that depicted in the show, in search of \"that cosmopolitan feel of Frasier\".McFadden, Kay. \"[http://community.seattletimes.nwsource.com/archive/?date\n20040513&slug=frasier13 Condo by condo, Seattle has become a lot like 'Frasier']\". Seattle Times, May 13, 2004.\n\nAnother of the primary sets was the radio studio at KACL from which Frasier broadcasts his show. The studio itself consists of two rooms: the broadcast booth and the control room. A section of the corridor outside of the booth was also built (visible through the windows at the back of the studio) and could be shot from the side to view the corridor itself. The set was designed based on ABC's then-brand-new radio studios in Los Angeles which the production designer visited. Technical elements such as the microphones were regularly updated to conform with the latest technology. Although the studio set lacked a \"front\" wall (the fourth wall), one was built for occasional use in  episodes with certain moments shot from behind the broadcast desk, rather than in front of it as usual.\n\nThe producers wanted to have a gathering place outside of home and work where the characters could meet. After a trip to Seattle, and seeing the many burgeoning coffee shops, the production designer suggested to producers that they use a coffee shop. Unlike many of the relatively modern coffee shop designs prevalent in Seattle, the production designer opted for a more warm and inviting style which would appear more established and traditional. Stools were specifically omitted to avoid any similarity to the bar on Cheers. Several Los Angeles coffee shops were used for reference. A bookcase was added on the back wall, suggesting patrons could grab a book and read while they enjoyed their coffee. The show used three versions of the interior set depending on how much space other sets for each episode required. If space for the full set was not available, a smaller version that omitted the tables closest to the audience could be used. If space for that set was lacking, a small back section of the back of the cafe at the top of the steps could be set up under the audience bleachers. A set was also used on occasion for the exterior patio.\n\nFilming \n\nThe cast had an unusual amount of freedom to suggest changes to the script. Grammer used an acting method he called \"requisite disrespect\" and did not rehearse with the others, instead learning and rehearsing his lines once just before filming each scene in front of a live studio audience. Although effective, the system often caused panic among guest stars. In 1996, Grammer's recurrent alcoholism led to a car accident; the cast and crew performed an intervention that persuaded him to enter the Betty Ford Clinic, delaying production for a month.\n\nOnly one episode, \"The 1000th Show\", was filmed in Seattle. As with Cheers, most episodes were filmed on Stage 25, Paramount Studios, or at various locations in and around Los Angeles.\n\nThe KACL callers' lines were read by anonymous voice-over actors during filming in front of a live audience, and during postproduction, the lines were replaced by celebrities, who actually phoned in their parts without having to come into the studio. The end credits of season finales show greyscale headshots of celebrities who had \"called in\" that season. Numerous celebrities called in, including David Duchovny, Phil Donahue, Marlo Thomas, Linda Hamilton, Olympia Dukakis, Daryl Hannah, Christopher Reeve, Gary Sinise, Freddie Prinze, Jr., Laura Linney, and Estelle Parsons. Some \"callers\" also guest-starred, such as Parsons and Linney, who played Frasier's final love interest in the last season.\n\nCredits \n\nThe show's theme song, \"Tossed Salads and Scrambled Eggs\", is sung by Grammer and is played over the closing credits of each episode. Composer Bruce Miller, who had also composed for Wings, was asked to avoid explicitly mentioning any subjects related to the show such as radio or psychiatry. After Miller finished the music, lyricist Darryl Phinnesse suggested the title as they were things that were, like Frasier Crane's patients, \"mixed up\". The lyrics indirectly refer to Crane's radio show; \"I hear the blues a-callin\", for example, refers to troubled listeners who call the show. Grammer recorded several variations of the final spoken line of the theme which were rotated among for each of the episodes. Other than season finales, a short, silent scene, often revisiting a small subplot aside from the central story of the episode,  appears with the credits and song, which the actors performed without written dialogue based on the scriptwriter's suggestion.\n\nThe title card at the start of each episode shows a white line being drawn in the shape of the Seattle skyline on a black background above the show's title. In most episodes, once the skyline and title appear, the skyline is augmented in some way, such as windows lighting up or a helicopter lifting off. The color of the title text changed for each season (respectively: blue, red, green, purple, gold, orange, yellow, light green, light orange, silver, and metallic gold). Over the title card, one of about 25 brief musical cues evoking the closing theme is played.\n\nRelationship to Cheers \n\nWith the exception of Rebecca Howe (Kirstie Alley), all the surviving main regular cast members of Cheers made appearances on Frasier, but Lilith Sternin (Bebe Neuwirth) was the only one to become a recurring character.\n\nSome cast members of Frasier had appeared previously in minor roles on Cheers. In the episode \"Do Not Forsake Me, O' My Postman\" (1992), John Mahoney played Sy Flembeck, an over-the-hill advertising executive hired by Rebecca to write a jingle for the bar. In it, Grammer and Mahoney exchanged a few lines. Peri Gilpin appeared in a Cheers episode titled \"Woody Gets an Election\" playing a reporter who interviews Woody when he runs for office.\n\nIn the eighth-season Cheers episode \"Two Girls for Every Boyd\", Frasier tells Sam Malone (played by Ted Danson) that his father, a research scientist, had died. In the Frasier season-two episode \"The Show Where Sam Shows Up\", when Sam meets Martin, Frasier explains that at the time, he was angry after an argument with his father on the phone. However, in \"The Show Where Woody Shows Up\", when meeting Martin, Woody says he remembers hearing about him.\n\nIn the ninth-season episode, \"Cheerful Goodbyes\" in 2002, Frasier returns to Boston to give a speech and Niles, Daphne, and Martin come along to see the city. Frasier runs into Cliff Clavin (played by John Ratzenberger) at the airport and learns that Cliff is retiring and moving to Florida. Frasier and company attend Cliff's retirement party, where Frasier reunites with the rest of the gang from Cheers (minus Sam, Woody, and Rebecca), including bar regular Norm Peterson (played by George Wendt), waitress Carla Tortelli (played by Rhea Perlman), barflies Paul Krapence (played by Paul Willson) and Phil (played by Philip Perlman), and Cliff's old post-office nemesis Walt Twitchell (played by Raye Birk).\n\nIn the 11th-season episode of Frasier, \"Caught in the Act\", Frasier's married ex-wife, children's entertainer Nanny G, comes to town and invites him backstage for a rendezvous. Nanny G appeared on the Cheers episode \"One Hugs, The Other Doesn't\" (1992) and was portrayed by Emma Thompson. In this episode of Frasier, she is portrayed by Laurie Metcalf. She also appeared in the second episode of season 9 of Frasier, \"Don Juan in Hell: Part 2\" and was played by Dina Waters.\n\nThe set of Frasier  was built over the set of Cheers on the same stage after it had finished filming. The producers of Frasier made certain no stools were in the coffee shop to distance it visually from the Cheers bar.Special Features, Season One DVD\n\nReception \n\nCritical reaction \n\nCritics and commentators broadly held Frasier in high regard. Caroline Frost said that the series overall showed a high level of wit, but noted that many critics felt that the marriage of Daphne and Niles in season 10 had removed much of the show's comic tension. Ken Tucker felt that their marriage made the series seem desperate for storylines, while Robert Bianco felt that it was symptomatic of a show that had begun to dip in quality after so much time on the air. Kelsey Grammer acknowledged the creative lull, saying that over the course of two later seasons, the show \"took itself too seriously\". Commentators do, however, acknowledge that there was an improvement following the return of the writers Christopher Lloyd and Joe Keenan, although not necessarily to its earlier high standards.\n\nWriting about the first season, John O'Connor described Frasier as being a relatively unoriginal concept, but said that it was generally a \"splendid act\", while Tucker thought that the second season benefited greatly from a mix of \"high and low humor\". Tucker's comment is referring to what Grammer described as a rule of the series that the show should not play down to its audience. Kevin Cherry believes that Frasier was able to stay fresh by not making any contemporary commentary, therefore allowing the show to be politically and socially neutral. Other commentators, such as Haydn Bush disagree, believing the success of Frasier can be attributed to the comedic timing and the rapport between the characters. Joseph J. Darowski and Kate Darowski praise the overall message of the series, which across eleven seasons sees several lonely, broken individuals develop warm, caring relationships. While individual episodes vary in quality, the series as a whole carries with it a definitive theme and evolution from pilot to finale.\n\nIn spite of the criticisms of the later seasons, these critics were unanimous in praising at least the early seasons, with varied commentary on the series' demise ranging from believing, like Bianco, that the show had run its course to those like Dana Stevens, who bemoaned the end of Frasier as the \"end of situation comedy for adults\". Critics compared the farcical elements of the series, especially in later seasons, to the older sitcom Three's Company. NBC News contributor Wendell Wittler described the moments of misunderstanding as \"inspired by the classic comedies of manners as were the frequent deflations of Frasier’s pomposity.\"\n\nAwards \n\nFrasier is one of the most successful spin-off series in television history and one of the most critically acclaimed comedy series of all time. The series won a total of 37 Primetime Emmy Awards during its 11-year run, breaking the record long held by The Mary Tyler Moore Show (29). It held the record until 2016 when Game of Thrones won 38.  Grammer and Pierce each won four, including one each for the fifth and eleventh seasons. The series is tied with ABC's Modern Family for the most consecutive wins for Outstanding Comedy Series, winning five from 1994 to 1998.\n\nGrammer has been Emmy-nominated for playing Frasier Crane on Cheers and Frasier, as well as a 1992 crossover appearance on Wings, making him the only performer to be nominated for playing the same role on three different shows. The first year Grammer did not receive an Emmy nomination for Frasier was in 2003 for the 10th season. However, Pierce was nominated every year of the show's run, breaking the record for nominations in his category, with his eighth nomination in 2001; he was nominated a further three times after this.\n\nIn 1994, the episode \"The Matchmaker\" was ranked number 43 on TV Guides 100 Greatest Episodes of All Time.\n\nIn 2000, the series was named the greatest international programme of all time by a panel of 1,600 industry experts for the British Film Institute as part of BFI TV 100.\n\nIn 2002, Frasier was ranked number 34 on TV Guides 50 Greatest TV Shows of All Time.\n\nIn 2006, a poll taken by the British Channel 4 of the sitcom industry voted Frasier the best sitcom of all time.\n\nFandom and cultural impact\n\nFrasier began airing in off-network syndication on September 15, 1997.\n\nThe show's popularity has resulted in several fan sites, podcasts, and publications. Among the fansites are KACL780.net and Frasieronline.co.uk. Podcasts that look primarily at the television show Frasier include Frasierphiles and Talk Salad and Scrambled Eggs with Kevin Smith and Matt Myra. While the show was still in production, a cookbook, Cafe Nervosa: The Connoisseur's Cookbook, was published that claimed to be authored by Frasier and Niles Crane. Similarly, a book titled My Life as a Dog was published as an autobiography of Moose, the dog that played Eddie in the first several seasons of the series. In 2001, a soundtrack to the series was released. Jefferson Graham published a behind-the-scenes look at the series, and several collections of scripts were published. \n\nThe show was popular enough to be referenced with some frequency in other television shows, most notably on The Simpsons, where Kelsey Grammer and David Hyde Pierce sometimes provide guest voices.\n\nMerchandising \n\nHome media \n\nParamount Home Entertainment and (from 2006 onward) CBS DVD have released all 11 seasons of Frasier on DVD in Region 1, 2 and 4. A 44-disc package containing the entire 11 seasons has also been released.\n\nOn April 7, 2015, CBS DVD released Frasier: The Complete Series on DVD in Region 1.\n\nThe first four seasons were also released on VHS along with a series of 'Best Of' tapes. These tapes consisted of four episodes taken from seasons 1–4. No more video releases have been announced.\n\nOne Frasier CD has been released featuring a number of songs taken from the show.\n\nBooks \n\nSeveral books about Frasier have been released, including:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Frasier" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11685" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Frasier is an American sitcom that was broadcast on NBC for 11 seasons, premiering on September 16, 1993, and concluding on May 13, 2004. The program was created and produced by David Angell, Peter Casey, and David Lee (as Grub Street Productions) in association with Grammnet (2004) and Paramount Network Television. The series was created as a spin-off of Cheers,  continuing the story of psychiatrist Frasier Crane as he returned to his hometown of Seattle and started building a new life. Frasier stars Kelsey Grammer, Jane Leeves, David Hyde Pierce, Peri Gilpin, and John Mahoney. The show was critically acclaimed, with the show itself and the cast winning thirty-seven Emmy Awards, a then-record for a scripted series. It also won the Emmy for Outstanding Comedy Series for five consecutive years.\n\nOverview\n\nPsychiatrist Dr. Frasier Crane (Grammer) returns to his home town of Seattle, Washington, following the end of his marriage and his life in Boston (as seen in Cheers). His plans for a new life as a bachelor are challenged when he is obliged to take in his father, Martin (Mahoney), a retired Seattle Police Department detective, who has mobility problems after being shot in the line of duty during a robbery.\n\nFrasier hires Daphne Moon (Leeves) as Martin's live-in physical therapist and caregiver, and tolerates Martin's dog Eddie. Frasier frequently spends time with his younger brother Niles (Pierce), a fellow psychiatrist. Niles becomes attracted to, and eventually falls in love with, Daphne (notwithstanding his own marriage), but does not confess his feelings to her until the final episode of the seventh season.\n\nFrasier hosts The Dr. Frasier Crane Show, a call-in psychiatry show on talk radio station KACL. His producer Roz Doyle (Gilpin) is very different from Frasier in many ways. She is working class, has cheap tastes and, at least early in the series, has superficial relationships with many men. However, Roz and Frasier share a professional respect, and over time, they become best friends. Frasier and the others often visit the local coffee shop, Café Nervosa.\n\nThe Crane sons, who possess expensive tastes, intellectual interests, and high opinions of themselves, frequently clash with their blue-collar, Average Joe father. The brothers' close relationship is often tense, and their sibling rivalry intermittently results in chaos. Other recurring themes include Niles' relationship with his never-seen wife (later ex-wife) Maris, Frasier's search for love, Martin's new life after retirement, and the various attempts by the two brothers to gain acceptance into Seattle's cultural elite.\n\nCharacters\n\nMain\n\n* Kelsey Grammer as Frasier Crane is a radio psychiatrist.\n* Jane Leeves as Daphne Moon is an English physiotherapist and live-in housekeeper, hired by Frasier to help take care of Martin, who lives with them in Frasier's apartment.\n* David Hyde Pierce as Niles Crane is Frasier's younger brother, also a psychiatrist, who works in private practice.\n* Peri Gilpin as Roz Doyle is the producer of Frasier's radio show, who becomes a close family friend.\n* John Mahoney as Martin Crane is Frasier and Niles' father, a Seattle police detective who was forced to retire due to a gunshot wound to his hip that led to his living with Frasier.\n*Dan Butler as Bob \"Bulldog\" Briscoe (seasons 4–6; recurring season 1; special appearance seasons 2–3; special guest seasons 7 & 9–11) is a male chauvinist, horny, boastful host of a sports radio talk show that followed Frasier's daily broadcast at KACL.\n\nRecurring\n\n* Edward Hibbert as Gil Chesterton (seasons 2–8 & 10–11; guest season 1), KACL's flamboyant, effeminate restaurant critic\n* Patrick Kerr as Noel Shempsky (seasons 6–11; guest seasons 1 & 3–5) KACL technical assistant and avid Star Trek aficionado who speaks Klingon and constantly hits on Roz\n* Tom McGowan as Kenny Daly (seasons 7–11; guest seasons 5–6), KACL's station manager\n* Millicent Martin as Mrs. Moon (seasons 9–10; guest season 7, 11), Daphne's mother\n* Brian Klugman as Kirby (season 9; guest season 8), Bob and Lana's son, and part-timer at KACL\n* Ashley Thomas as Alice (seasons 10–11; co-star season 9), Roz's daughter\n\nNotes\n\nThe main cast remained unchanged for all 11 years. When the series ended in 2004, Grammer had portrayed the character of Frasier Crane for a total of 20 years, including his nine seasons on Cheers; at the time, he tied James Arness' portrayal of Matt Dillon on Gunsmoke for the longest-running character on primetime television. The record has since been surpassed in animation by the voice cast of The Simpsons, and in live action by Richard Belzer's portrayal of John Munch on the series Homicide: Life on the Street and Law & Order: Special Victims Unit. Grammer was briefly the highest-paid television actor in the United States for his portrayal of Frasier, while Jane Leeves was the highest-paid British actress.\n\nIn addition to those of the ensemble, additional story lines included characters from Frasier's former incarnation on Cheers, such as his ex-wife Lilith Sternin, played by Bebe Neuwirth, and their son Frederick, played by Trevor Einhorn.\n\nReunions \n\nGrammer had been the voice of Sideshow Bob on The Simpsons since 1990. In a 1997 episode (while Frasier was still in production), the character's brother, Cecil Terwilliger, was introduced, played by Pierce, as referenced in the episode title, \"Brother from Another Series\". The episode contained numerous Frasier references, including a Frasier-style version of The Simpsons theme for a transition and its iconic title card for the same thing. Pierce returned as Cecil for the second time (the first since Frasier had concluded) alongside Grammer in the 2007 episode \"Funeral for a Fiend\". The episode introduced the brothers' father, Dr. Robert Terwilliger,  who was portrayed by Mahoney.\n\nCast-member reunions also occurred on four episodes of Hot in Cleveland, which featured Leeves in the main cast along with Wendie Malick (who played Martin's girlfriend towards the end of Frasier). In the season-two episode \"Unseparated at Birth\" and season-three episode \"Funeral Crashers\", Mahoney guest-stars as a waiter smitten with Betty White's character. Gilpin appears in the episode \"I Love Lucci (Part 1)\", and Tom McGowan (who played Kenny Daly) appears in \"Love Thy Neighbor\" as a casting director. Hot in Cleveland was produced by Suzanne Martin, who wrote multiple episodes of Frasier.\n\nProduction \n\nCreation \n\nDuring the eighth season of Cheers, Grammer made a deal with former Cheers producers David Angell, Peter Casey, and David Lee (who were moving on to produce Wings) that they would do a new series together once Cheers ended. Once it became clear during the 10th season that the 11th would be the last, the group began working on their next series together.\n\nGrammer did not originally want to continue playing Frasier Crane, and Angell, Casey, and Lee did not want the new show to be compared to Cheers, which they had worked on before Wings. The three proposed that the actor play a wealthy, Malcolm Forbes-like paraplegic publisher who operated his business from his apartment. The main show featured a \"street-smart\" Hispanic live-in nurse who would clash with the main character. While Grammer liked the concept, Paramount Television disliked it, and suggested that the best route would be to spin off the Frasier Crane character. Grammer ultimately agreed to star in a Cheers spin-off, but the producers set the new show as far from Boston as possible to prevent NBC from demanding that other characters from the old show make guest appearances on the new show during its first season. After first choosing Denver, Angell, Casey, and Lee ultimately chose Seattle as the setting.\n\nThe creators did not want Frasier in private practice, which would make the show resemble The Bob Newhart Show. Taking from an unused idea they had for a Cheers episode, they conceived the idea of the psychiatrist working in a radio station surrounded by \"wacky, yet loveable\" characters. After realizing that such a setting resembled WKRP in Cincinnati, the creators decided to emphasize Frasier's home life, which Cheers had rarely explored. Lee thought of his own experiences with \"the relationship between an aging father and the grown-up son he never understood\" and thought it would be a good theme for Frasier. Although Frasier had mentioned on Cheers that his father, a research scientist, had died, they decided to overlook the discrepancy (which they attempted to explain in a second-season episode). One element of the original concept that was carried over was the live-in health-care provider which would be for Frasier's father. Grammer points out that very little of the Frasier Crane of Cheers carried over to Frasier, as his family history was changed, the setting, his job, and even the character himself changed from the Cheers predecessor, having to be more grounded as the central character of the show so the other supporting characters could be more eccentric.\n\nCasting \n\nMartin Crane was based on creator Casey's father, who spent 34 years with the San Francisco Police Department. The creators suggested to NBC that they would like to cast someone like Mahoney, to which NBC told them if they could get Mahoney, they could hire him without auditions. Both Grammer and the producers contacted Mahoney, with the producers flying to Chicago to show Mahoney the pilot script over dinner. Upon reading the script, Mahoney accepted. Grammer, who lost his father as a child, and the childless Mahoney immediately built a close father-son relationship. In discussing Martin's nurse, Warren Littlefield of NBC suggested she be English instead of Hispanic and suggested Leeves for the role. Grammer was initially reluctant, as he thought the casting made the show resemble Nanny and the Professor, but approved Leeves after a meeting and read-through with her. Mahoney and Leeves quickly bonded over their shared English heritage; Mahoney is originally from Manchester where Leeves' character is from.\n\nThe character of Niles was not part of the original concept for the show. Frasier had told his bar friends on Cheers that he was an only child.\"Behind The Couch: The Making of Frasier\", DVD Extra, Season 1 However, Sheila Guthrie, the assistant casting director on Wings, brought the producers a photo of Pierce (whom she knew from his work on The Powers That Be) and noted his resemblance to Grammer when he first appeared on Cheers. She recommended him should they ever want Frasier to have a brother. The creators were \"blown away\" both by his resemblance to Grammer and by his acting ability. They decided to ignore Frasier's statement on Cheers and created the role for Pierce. Pierce accepted the role before realizing he had not read a script. Once he was given a script, he was initially concerned that his character was essentially a duplicate of Frasier, thinking that it would not work.\nThe first table reading of the pilot script was notable because the producers had never heard either Pierce or Mahoney read lines because they were cast without auditions.\n\nThe only main role that required an audition was Roz Doyle, who was named in memory of a producer of Wings. The producers auditioned around 300 actresses with no particular direction in mind. Women of all ethnicities were considered. Lisa Kudrow was originally cast in the role, but during rehearsals, the producers decided they needed someone who could appear more assertive in her job and take control over Frasier at KACL, and Kudrow did not fit that role. The creators quickly hired Gilpin, their second choice.\n\nThe original focus of the series was intended to be the relationship between Frasier and Martin, and it was the focus of most of the first-season episodes. Once the show began airing, Niles became a breakout character, and more focus was added to the brothers' relationship, and other plots centering on Niles, starting in the second season.\"Marching On to Season Two\", DVD Extra, Season 2 The producers initially did not want to make Niles' wife Maris an unseen character because they did not want to draw parallels to Vera, Norm's wife on Cheers. They originally intended that she would appear after several episodes, but were enjoying writing excuses for her absence that eventually they decided she would remain unseen, and after the increasingly eccentric characteristics ascribed to her, no real actress could portray her.\n\nSets and settings \n\nFrasier's apartment was designed to be ultra-modern in an eclectic style (as Frasier himself points out in the pilot). One of the show's signature elements that it became well known for was the apartment's design which included elements such as a slightly split-level design, doors with triangular wooden inlay features, numerous pieces of well-known high-end furniture pieces (such as a replica of Coco Chanel's sofa, and both Eames and Wassily chairs) and a notable view from the terrace which was frequently complimented by visitors. The main set consisted of the open-concept living area with a sitting/TV space and dining area on the lower level and a piano exit to the terrace on the rear upper level. The set also included the kitchen through an open archway. A small section of the building corridor and elevator doors was built, as was a powder room near the front entrance. Two corridors off the living area ostensibly led to the apartment's three bedrooms. Sets for each of these rooms were built as separate sets on an as-needed basis.\"A Conversation with Art Director Roy Christopher\", DVD Extra, Season 3\n\nNo building or apartment in Seattle really has the view from Frasier's residence. It was created so the Space Needle, the most iconic landmark of Seattle, would appear more prominently. According to the season-one DVD bonus features, the photograph used on the set was taken from atop a cliff, possibly the ledge at Kerry Park, a frequent photography location. Despite this, Frasier has been said to have contributed to the emergence of an upscale urban lifestyle in 1990s Seattle, with buyers seeking properties in locations resembling that depicted in the show, in search of \"that cosmopolitan feel of Frasier\".McFadden, Kay. \"[http://community.seattletimes.nwsource.com/archive/?date\n20040513&slug=frasier13 Condo by condo, Seattle has become a lot like 'Frasier']\". Seattle Times, May 13, 2004.\n\nAnother of the primary sets was the radio studio at KACL from which Frasier broadcasts his show. The studio itself consists of two rooms: the broadcast booth and the control room. A section of the corridor outside of the booth was also built (visible through the windows at the back of the studio) and could be shot from the side to view the corridor itself. The set was designed based on ABC's then-brand-new radio studios in Los Angeles which the production designer visited. Technical elements such as the microphones were regularly updated to conform with the latest technology. Although the studio set lacked a \"front\" wall (the fourth wall), one was built for occasional use in  episodes with certain moments shot from behind the broadcast desk, rather than in front of it as usual.\n\nThe producers wanted to have a gathering place outside of home and work where the characters could meet. After a trip to Seattle, and seeing the many burgeoning coffee shops, the production designer suggested to producers that they use a coffee shop. Unlike many of the relatively modern coffee shop designs prevalent in Seattle, the production designer opted for a more warm and inviting style which would appear more established and traditional. Stools were specifically omitted to avoid any similarity to the bar on Cheers. Several Los Angeles coffee shops were used for reference. A bookcase was added on the back wall, suggesting patrons could grab a book and read while they enjoyed their coffee. The show used three versions of the interior set depending on how much space other sets for each episode required. If space for the full set was not available, a smaller version that omitted the tables closest to the audience could be used. If space for that set was lacking, a small back section of the back of the cafe at the top of the steps could be set up under the audience bleachers. A set was also used on occasion for the exterior patio.\n\nFilming \n\nThe cast had an unusual amount of freedom to suggest changes to the script. Grammer used an acting method he called \"requisite disrespect\" and did not rehearse with the others, instead learning and rehearsing his lines once just before filming each scene in front of a live studio audience. Although effective, the system often caused panic among guest stars. In 1996, Grammer's recurrent alcoholism led to a car accident; the cast and crew performed an intervention that persuaded him to enter the Betty Ford Clinic, delaying production for a month.\n\nOnly one episode, \"The 1000th Show\", was filmed in Seattle. As with Cheers, most episodes were filmed on Stage 25, Paramount Studios, or at various locations in and around Los Angeles.\n\nThe KACL callers' lines were read by anonymous voice-over actors during filming in front of a live audience, and during postproduction, the lines were replaced by celebrities, who actually phoned in their parts without having to come into the studio. The end credits of season finales show greyscale headshots of celebrities who had \"called in\" that season. Numerous celebrities called in, including David Duchovny, Phil Donahue, Marlo Thomas, Linda Hamilton, Olympia Dukakis, Daryl Hannah, Christopher Reeve, Gary Sinise, Freddie Prinze, Jr., Laura Linney, and Estelle Parsons. Some \"callers\" also guest-starred, such as Parsons and Linney, who played Frasier's final love interest in the last season.\n\nCredits \n\nThe show's theme song, \"Tossed Salads and Scrambled Eggs\", is sung by Grammer and is played over the closing credits of each episode. Composer Bruce Miller, who had also composed for Wings, was asked to avoid explicitly mentioning any subjects related to the show such as radio or psychiatry. After Miller finished the music, lyricist Darryl Phinnesse suggested the title as they were things that were, like Frasier Crane's patients, \"mixed up\". The lyrics indirectly refer to Crane's radio show; \"I hear the blues a-callin\", for example, refers to troubled listeners who call the show. Grammer recorded several variations of the final spoken line of the theme which were rotated among for each of the episodes. Other than season finales, a short, silent scene, often revisiting a small subplot aside from the central story of the episode,  appears with the credits and song, which the actors performed without written dialogue based on the scriptwriter's suggestion.\n\nThe title card at the start of each episode shows a white line being drawn in the shape of the Seattle skyline on a black background above the show's title. In most episodes, once the skyline and title appear, the skyline is augmented in some way, such as windows lighting up or a helicopter lifting off. The color of the title text changed for each season (respectively: blue, red, green, purple, gold, orange, yellow, light green, light orange, silver, and metallic gold). Over the title card, one of about 25 brief musical cues evoking the closing theme is played.\n\nRelationship to Cheers \n\nWith the exception of Rebecca Howe (Kirstie Alley), all the surviving main regular cast members of Cheers made appearances on Frasier, but Lilith Sternin (Bebe Neuwirth) was the only one to become a recurring character.\n\nSome cast members of Frasier had appeared previously in minor roles on Cheers. In the episode \"Do Not Forsake Me, O' My Postman\" (1992), John Mahoney played Sy Flembeck, an over-the-hill advertising executive hired by Rebecca to write a jingle for the bar. In it, Grammer and Mahoney exchanged a few lines. Peri Gilpin appeared in a Cheers episode titled \"Woody Gets an Election\" playing a reporter who interviews Woody when he runs for office.\n\nIn the eighth-season Cheers episode \"Two Girls for Every Boyd\", Frasier tells Sam Malone (played by Ted Danson) that his father, a research scientist, had died. In the Frasier season-two episode \"The Show Where Sam Shows Up\", when Sam meets Martin, Frasier explains that at the time, he was angry after an argument with his father on the phone. However, in \"The Show Where Woody Shows Up\", when meeting Martin, Woody says he remembers hearing about him.\n\nIn the ninth-season episode, \"Cheerful Goodbyes\" in 2002, Frasier returns to Boston to give a speech and Niles, Daphne, and Martin come along to see the city. Frasier runs into Cliff Clavin (played by John Ratzenberger) at the airport and learns that Cliff is retiring and moving to Florida. Frasier and company attend Cliff's retirement party, where Frasier reunites with the rest of the gang from Cheers (minus Sam, Woody, and Rebecca), including bar regular Norm Peterson (played by George Wendt), waitress Carla Tortelli (played by Rhea Perlman), barflies Paul Krapence (played by Paul Willson) and Phil (played by Philip Perlman), and Cliff's old post-office nemesis Walt Twitchell (played by Raye Birk).\n\nIn the 11th-season episode of Frasier, \"Caught in the Act\", Frasier's married ex-wife, children's entertainer Nanny G, comes to town and invites him backstage for a rendezvous. Nanny G appeared on the Cheers episode \"One Hugs, The Other Doesn't\" (1992) and was portrayed by Emma Thompson. In this episode of Frasier, she is portrayed by Laurie Metcalf. She also appeared in the second episode of season 9 of Frasier, \"Don Juan in Hell: Part 2\" and was played by Dina Waters.\n\nThe set of Frasier  was built over the set of Cheers on the same stage after it had finished filming. The producers of Frasier made certain no stools were in the coffee shop to distance it visually from the Cheers bar.Special Features, Season One DVD\n\nReception \n\nCritical reaction \n\nCritics and commentators broadly held Frasier in high regard. Caroline Frost said that the series overall showed a high level of wit, but noted that many critics felt that the marriage of Daphne and Niles in season 10 had removed much of the show's comic tension. Ken Tucker felt that their marriage made the series seem desperate for storylines, while Robert Bianco felt that it was symptomatic of a show that had begun to dip in quality after so much time on the air. Kelsey Grammer acknowledged the creative lull, saying that over the course of two later seasons, the show \"took itself too seriously\". Commentators do, however, acknowledge that there was an improvement following the return of the writers Christopher Lloyd and Joe Keenan, although not necessarily to its earlier high standards.\n\nWriting about the first season, John O'Connor described Frasier as being a relatively unoriginal concept, but said that it was generally a \"splendid act\", while Tucker thought that the second season benefited greatly from a mix of \"high and low humor\". Tucker's comment is referring to what Grammer described as a rule of the series that the show should not play down to its audience. Kevin Cherry believes that Frasier was able to stay fresh by not making any contemporary commentary, therefore allowing the show to be politically and socially neutral. Other commentators, such as Haydn Bush disagree, believing the success of Frasier can be attributed to the comedic timing and the rapport between the characters. Joseph J. Darowski and Kate Darowski praise the overall message of the series, which across eleven seasons sees several lonely, broken individuals develop warm, caring relationships. While individual episodes vary in quality, the series as a whole carries with it a definitive theme and evolution from pilot to finale.\n\nIn spite of the criticisms of the later seasons, these critics were unanimous in praising at least the early seasons, with varied commentary on the series' demise ranging from believing, like Bianco, that the show had run its course to those like Dana Stevens, who bemoaned the end of Frasier as the \"end of situation comedy for adults\". Critics compared the farcical elements of the series, especially in later seasons, to the older sitcom Three's Company. NBC News contributor Wendell Wittler described the moments of misunderstanding as \"inspired by the classic comedies of manners as were the frequent deflations of Frasier’s pomposity.\"\n\nAwards \n\nFrasier is one of the most successful spin-off series in television history and one of the most critically acclaimed comedy series of all time. The series won a total of 37 Primetime Emmy Awards during its 11-year run, breaking the record long held by The Mary Tyler Moore Show (29). It held the record until 2016 when Game of Thrones won 38.  Grammer and Pierce each won four, including one each for the fifth and eleventh seasons. The series is tied with ABC's Modern Family for the most consecutive wins for Outstanding Comedy Series, winning five from 1994 to 1998.\n\nGrammer has been Emmy-nominated for playing Frasier Crane on Cheers and Frasier, as well as a 1992 crossover appearance on Wings, making him the only performer to be nominated for playing the same role on three different shows. The first year Grammer did not receive an Emmy nomination for Frasier was in 2003 for the 10th season. However, Pierce was nominated every year of the show's run, breaking the record for nominations in his category, with his eighth nomination in 2001; he was nominated a further three times after this.\n\nIn 1994, the episode \"The Matchmaker\" was ranked number 43 on TV Guides 100 Greatest Episodes of All Time.\n\nIn 2000, the series was named the greatest international programme of all time by a panel of 1,600 industry experts for the British Film Institute as part of BFI TV 100.\n\nIn 2002, Frasier was ranked number 34 on TV Guides 50 Greatest TV Shows of All Time.\n\nIn 2006, a poll taken by the British Channel 4 of the sitcom industry voted Frasier the best sitcom of all time.\n\nFandom and cultural impact\n\nFrasier began airing in off-network syndication on September 15, 1997.\n\nThe show's popularity has resulted in several fan sites, podcasts, and publications. Among the fansites are KACL780.net and Frasieronline.co.uk. Podcasts that look primarily at the television show Frasier include Frasierphiles and Talk Salad and Scrambled Eggs with Kevin Smith and Matt Myra. While the show was still in production, a cookbook, Cafe Nervosa: The Connoisseur's Cookbook, was published that claimed to be authored by Frasier and Niles Crane. Similarly, a book titled My Life as a Dog was published as an autobiography of Moose, the dog that played Eddie in the first several seasons of the series. In 2001, a soundtrack to the series was released. Jefferson Graham published a behind-the-scenes look at the series, and several collections of scripts were published. \n\nThe show was popular enough to be referenced with some frequency in other television shows, most notably on The Simpsons, where Kelsey Grammer and David Hyde Pierce sometimes provide guest voices.\n\nMerchandising \n\nHome media \n\nParamount Home Entertainment and (from 2006 onward) CBS DVD have released all 11 seasons of Frasier on DVD in Region 1, 2 and 4. A 44-disc package containing the entire 11 seasons has also been released.\n\nOn April 7, 2015, CBS DVD released Frasier: The Complete Series on DVD in Region 1.\n\nThe first four seasons were also released on VHS along with a series of 'Best Of' tapes. These tapes consisted of four episodes taken from seasons 1–4. No more video releases have been announced.\n\nOne Frasier CD has been released featuring a number of songs taken from the show.\n\nBooks \n\nSeveral books about Frasier have been released, including:. Frasier. http://en.wikipedia.org/?curid=11685."
  }
}
