{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12469",
  "eid" : "02c40fe0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778513886,
  "textBody" : "The Goidelic or Gaelic languages (; ; ) form one of the two groups of Insular Celtic languages, the other being the Brittonic languages.\n\nGoidelic languages historically formed a dialect continuum stretching from Ireland through the Isle of Man to Scotland. There are three modern Goidelic languages: Irish ('), Scottish Gaelic (') and Manx ('), the last of which died out in the 20th century but has since been revived to some degree.\n\nNomenclature\n\nAlthough Irish and Manx are often referred to as Irish Gaelic and Manx Gaelic (as they are Goidelic or Gaelic languages), the use of the word Gaelic is unnecessary because the terms Irish and Manx, to refer to language (as in, \"to speak Irish\"), always refer to these languages, but Scots has come to refer to a Germanic language and so \"Scottish\" can refer to things that are not Gaelic at all. Gaelic, by itself, is sometimes used to refer to Scottish Gaelic, especially in Scotland, and so it is ambiguous.\n\nThe endonyms (' and ' in Irish, ' in Manx and ' in Scottish Gaelic) are derived from Old Irish Goídelc, which in turn is derived from Old Welsh ' meaning \"pirate, raider\".Koch, John. The Goddodin of Aneirin, Celtic Studies Publications, 1997, p. xcvii, note 2Koch, John (ed). Celtic Culture: a historical encyclopedia, ABC-CLIO, 2006, p. 739 The medieval mythology of the ' places its origin in an eponymous ancestor of the Gaels and the inventor of the language, .\n\nClassification\n\nThe family tree of the Goidelic languages is as follows:\n\n* Primitive Irish\n** Old Irish\n*** Middle Irish\n**** Modern Irish\n**** Scottish Gaelic\n**** Manx\n\nHistory and range\n\nGoidelic was once restricted to Ireland and, possibly, the west coast of Scotland. Medieval Gaelic literature tells us that the kingdom of Dál Riata emerged in western Scotland during the 6th century. The traditional view was that Dál Riata was founded by Irish migrants, but this is no longer universally accepted. Archaeologist Ewan Campbell says there is no archaeological evidence for a migration or invasion, and suggests strong sea links helped maintain a pre-existing Gaelic culture on both sides of the North Channel.Campbell, Ewan. \"[http://www.electricscotland.com/history/articles/scotsirish.htm Were the Scots Irish?]\" in Antiquity #75 (2001).\n\nDál Riata grew in size and influence, and Gaelic language and culture was eventually adopted by the neighbouring Picts (a group of peoples who may have spoken a Brythonic language) who lived throughout Scotland. Manx, the language of the Isle of Man, is closely akin to the Gaelic spoken in the Hebrides and the Irish spoken in northeast and eastern Ireland and the now extinct Galwegian Gaelic of Galloway (in southwest Scotland), with some influence from Old Norse through the Viking invasions and from the previous British inhabitants.\n\nThe oldest written Goidelic language is Primitive Irish, which is attested in Ogham inscriptions from about the 4th century. The forms of this speech are very close, and often identical, to the forms of Gaulish recorded before and during the Roman Empire. The next stage, Old Irish, is found in glosses (i.e. annotations) to Latin manuscripts—mainly religious and grammatical—from the 6th to the 10th century, as well as in archaic texts copied/recorded in Middle Irish texts. Middle Irish, the immediate predecessor of the modern Goidelic languages, is the term for the language as recorded from the 10th to the 12th century: a great deal of literature survives in it, including the early Irish law texts.\n\nClassical Gaelic, otherwise known as Early Modern Irish, covers the period from the 13th to the 18th century, during which time it was used as a literary language in Ireland and Scotland. This is often called Classical Irish, while Ethnologue gives the name \"Hiberno-Scottish Gaelic\" to this standardised written language. As long as this written language was the norm, Ireland was considered the Gaelic homeland to the Scottish literati.\n\nLater orthographic divergence has resulted in standardised pluricentristic orthographies. Manx orthography, which was introduced in the 16th and 17th centuries, was based on English and Welsh practice and so never formed part of this literary standard.\n\nIrish\n\nIrish is one of the Republic of Ireland's two official languages along with English. Historically the predominant language of the island, it is now mostly spoken in parts of the south, west, and northwest. The legally defined Irish-speaking areas are called the ; all government institutions of the Republic, in particular the parliament ('), its upper house (') and lower house ('), and the prime minister (') are officially named in this language, even in English. At present, the  are primarily found in Counties Cork, Donegal, Mayo, Galway, Kerry, and, to a lesser extent, in Waterford and Meath. In the Republic of Ireland 1,774,437 (41.4% of the population aged three years and over) regard themselves as able to speak Irish.[http://www.cso.ie/px/pxeirestat/Statire/SelectVarVal/Define.asp?maintable\nCDD31&PLanguage0 Central Statistics Office Ireland] Of these, 77,185 (1.8%) speak Irish on a daily basis outside school. Irish is also undergoing a revival in Northern Ireland and has been accorded some legal status there under the 1998 Good Friday Agreement but its official usage remains divisive among a predominantly British population.  The 2001 census in Northern Ireland showed that 167,487 (10.4%) people \"had some knowledge of Irish\". Combined, this means that around one in three people () on the island of Ireland can understand Irish to some extent, although a large percentage of these do not speak it fluently.  The census figures do not take into account those Irish who have emigrated, and it has been estimated (rightly or wrongly) that there are more native speakers of Irish in Britain, the US, Australia, and other parts of the world than there are in Ireland itself.\n\nDespite the ascent in Ireland of the English and Anglicised ruling classes following the 1607 Flight of the Earls (and the disappearance of much of the Gaelic nobility), Irish was spoken by the majority of the population until the Great Famine of the 1840s. Disproportionately affecting the classes among whom Irish was the primary spoken language, famine and emigration precipitated a steep decline in native speakers which only recently has begun to reverse.\n\nThe Irish language has been recognised as an official and working language of the European Union. Ireland's national language was the twenty-third to be given such recognition by the EU and previously had the status of a treaty language.\n\nScottish Gaelic\n\nSome people in the north and west of mainland Scotland and most people in the Hebrides still speak Scottish Gaelic, but  the language has been in decline.  There are now believed to be approximately 60,000 native speakers of Scottish Gaelic in Scotland, plus around 1,000 speakers of the Canadian Gaelic dialect in Nova Scotia.\n\nIts historical range was much larger. For example, it was the everyday language of most of the rest of the Scottish Highlands until little more than a century ago. Galloway was once also a Gaelic-speaking region, but the Galwegian dialect has been extinct there for approximately three centuries. It is believed to have been home to dialects that were transitional between Scottish Gaelic and the two other Goidelic languages. While Gaelic was spoken across the Scottish Borders and Lothian during the early High Middle Ages it does not seem to have been spoken by the majority and was likely the language of the ruling elite, land-owners and religious clerics. Some other parts of the Scottish Lowlands spoke Cumbric, and others Scots Inglis, the only exceptions being the Northern Isles of Orkney and Shetland where Norse was spoken.\n\nScotland takes its name from the Latin word for 'Gael', ', plural ' (of uncertain etymology).[http://dictionary.oed.com/cgi/entry/50216347 Oxford English Dictionary]: Scot, n.1. The source of the late Latin word is obscure. There is no evidence that it represents the native name of any Gaelic-speaking people (the Irish Scot, an Irishman, pl. Scuit, appears to be a learned word from Latin), nor does it exist in Welsh, though Welshmen in writing Latin have from the earliest times used Scoti as the rendering of ' (Gaels). [...]  Retrieved 11 October 2010  Scotland originally meant Land of the Gaels in a cultural and social sense. Until late in the 15th century, Scottis in Scottish English (or Scots Inglis) was used to refer only to Gaelic, and the speakers of this language who were identified  as Scots. As the ruling elite became Scots Inglis/English-speaking, Scottis was gradually associated with the land rather than the people, and the word Erse ('Irish') was gradually used more and more as an act of culturo-political disassociation with an overt implication that the language was not really Scottish, and therefore foreign. This was something of a propaganda label, as Gaelic has been in Scotland for at least as long as English, if not longer.\n\nIn the early 16th century the dialects of northern Middle English, also known as Early Scots, which had developed in Lothian and had come to be spoken elsewhere in the Kingdom of Scotland themselves later appropriated the name Scots. By the 17th century Gaelic speakers were restricted largely to the Highlands and the Hebrides. Furthermore, the culturally repressive measures taken against the rebellious Highland communities by The Crown following the second Jacobite Rebellion of 1746 caused still further decline in the language's use — to a large extent by enforced emigration (e.g. the Highland Clearances). Even more decline followed in the 19th and early 20th centuries.\n\nThe Scottish Parliament has afforded the language a secure statutory status and \"equal respect\" (but not full equality in legal status under Scots law) with English, sparking hopes that Scottish Gaelic can be saved from extinction and perhaps even revitalised.\n\nManx\n\nLong the everyday language of most of the Isle of Man, Manx began to decline sharply in the 19th century. The last monolingual Manx speakers are believed to have died around the middle of the 19th century; in 1874 around 30% of the population were estimated to speak Manx, decreasing to 9.1% in 1901 and 1.1% in 1921. The last native speaker of Manx, Ned Maddrell, died in 1974.\n\nAt the end of the 19th century a revival of Manx began, headed by the Manx Language Society ('). Both linguists and language enthusiasts searched out the last native speakers during the 20th century, recording their speech and learning from them. In the United Kingdom Census 2011, there were 1823 Manx speakers on Man, representing 2.27% of the population of 80,398, and a steady increase in the number of speakers.\n\nToday Manx is used as the sole medium for teaching at five of the island's pre-schools by a company named ', which also operates the sole Manx primary school, the '. Manx is taught as a second language at all of the Island's primary and secondary schools and also at the University College Isle of Man and Centre for Manx Studies.\n\nComparison\n\nNumbers\n\nCommon phrases\n\nInfluence on other languages\n\nThere are several languages that show Goidelic influence, although they are not Goidelic languages themselves.\n\nShelta language is sometimes thought to be a Goidelic language, but is in fact a cant based on Irish and English, with a primarily English-based syntax.\n\nThe Bungee language in Canada is an English dialect spoken by Métis that was influenced by Orkney English, Scots English, Cree, Ojibwe, and Scottish Gaelic.\n\nBeurla Reagaird is a cant spoken by Scottish traveling folk, which is to a large extent based on Scottish Gaelic.\n\nEnglish and especially Highland English have numerous words of both Scottish Gaelic and Irish origin.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Goidelic languages" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12469" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Goidelic or Gaelic languages (; ; ) form one of the two groups of Insular Celtic languages, the other being the Brittonic languages.\n\nGoidelic languages historically formed a dialect continuum stretching from Ireland through the Isle of Man to Scotland. There are three modern Goidelic languages: Irish ('), Scottish Gaelic (') and Manx ('), the last of which died out in the 20th century but has since been revived to some degree.\n\nNomenclature\n\nAlthough Irish and Manx are often referred to as Irish Gaelic and Manx Gaelic (as they are Goidelic or Gaelic languages), the use of the word Gaelic is unnecessary because the terms Irish and Manx, to refer to language (as in, \"to speak Irish\"), always refer to these languages, but Scots has come to refer to a Germanic language and so \"Scottish\" can refer to things that are not Gaelic at all. Gaelic, by itself, is sometimes used to refer to Scottish Gaelic, especially in Scotland, and so it is ambiguous.\n\nThe endonyms (' and ' in Irish, ' in Manx and ' in Scottish Gaelic) are derived from Old Irish Goídelc, which in turn is derived from Old Welsh ' meaning \"pirate, raider\".Koch, John. The Goddodin of Aneirin, Celtic Studies Publications, 1997, p. xcvii, note 2Koch, John (ed). Celtic Culture: a historical encyclopedia, ABC-CLIO, 2006, p. 739 The medieval mythology of the ' places its origin in an eponymous ancestor of the Gaels and the inventor of the language, .\n\nClassification\n\nThe family tree of the Goidelic languages is as follows:\n\n* Primitive Irish\n** Old Irish\n*** Middle Irish\n**** Modern Irish\n**** Scottish Gaelic\n**** Manx\n\nHistory and range\n\nGoidelic was once restricted to Ireland and, possibly, the west coast of Scotland. Medieval Gaelic literature tells us that the kingdom of Dál Riata emerged in western Scotland during the 6th century. The traditional view was that Dál Riata was founded by Irish migrants, but this is no longer universally accepted. Archaeologist Ewan Campbell says there is no archaeological evidence for a migration or invasion, and suggests strong sea links helped maintain a pre-existing Gaelic culture on both sides of the North Channel.Campbell, Ewan. \"[http://www.electricscotland.com/history/articles/scotsirish.htm Were the Scots Irish?]\" in Antiquity #75 (2001).\n\nDál Riata grew in size and influence, and Gaelic language and culture was eventually adopted by the neighbouring Picts (a group of peoples who may have spoken a Brythonic language) who lived throughout Scotland. Manx, the language of the Isle of Man, is closely akin to the Gaelic spoken in the Hebrides and the Irish spoken in northeast and eastern Ireland and the now extinct Galwegian Gaelic of Galloway (in southwest Scotland), with some influence from Old Norse through the Viking invasions and from the previous British inhabitants.\n\nThe oldest written Goidelic language is Primitive Irish, which is attested in Ogham inscriptions from about the 4th century. The forms of this speech are very close, and often identical, to the forms of Gaulish recorded before and during the Roman Empire. The next stage, Old Irish, is found in glosses (i.e. annotations) to Latin manuscripts—mainly religious and grammatical—from the 6th to the 10th century, as well as in archaic texts copied/recorded in Middle Irish texts. Middle Irish, the immediate predecessor of the modern Goidelic languages, is the term for the language as recorded from the 10th to the 12th century: a great deal of literature survives in it, including the early Irish law texts.\n\nClassical Gaelic, otherwise known as Early Modern Irish, covers the period from the 13th to the 18th century, during which time it was used as a literary language in Ireland and Scotland. This is often called Classical Irish, while Ethnologue gives the name \"Hiberno-Scottish Gaelic\" to this standardised written language. As long as this written language was the norm, Ireland was considered the Gaelic homeland to the Scottish literati.\n\nLater orthographic divergence has resulted in standardised pluricentristic orthographies. Manx orthography, which was introduced in the 16th and 17th centuries, was based on English and Welsh practice and so never formed part of this literary standard.\n\nIrish\n\nIrish is one of the Republic of Ireland's two official languages along with English. Historically the predominant language of the island, it is now mostly spoken in parts of the south, west, and northwest. The legally defined Irish-speaking areas are called the ; all government institutions of the Republic, in particular the parliament ('), its upper house (') and lower house ('), and the prime minister (') are officially named in this language, even in English. At present, the  are primarily found in Counties Cork, Donegal, Mayo, Galway, Kerry, and, to a lesser extent, in Waterford and Meath. In the Republic of Ireland 1,774,437 (41.4% of the population aged three years and over) regard themselves as able to speak Irish.[http://www.cso.ie/px/pxeirestat/Statire/SelectVarVal/Define.asp?maintable\nCDD31&PLanguage0 Central Statistics Office Ireland] Of these, 77,185 (1.8%) speak Irish on a daily basis outside school. Irish is also undergoing a revival in Northern Ireland and has been accorded some legal status there under the 1998 Good Friday Agreement but its official usage remains divisive among a predominantly British population.  The 2001 census in Northern Ireland showed that 167,487 (10.4%) people \"had some knowledge of Irish\". Combined, this means that around one in three people () on the island of Ireland can understand Irish to some extent, although a large percentage of these do not speak it fluently.  The census figures do not take into account those Irish who have emigrated, and it has been estimated (rightly or wrongly) that there are more native speakers of Irish in Britain, the US, Australia, and other parts of the world than there are in Ireland itself.\n\nDespite the ascent in Ireland of the English and Anglicised ruling classes following the 1607 Flight of the Earls (and the disappearance of much of the Gaelic nobility), Irish was spoken by the majority of the population until the Great Famine of the 1840s. Disproportionately affecting the classes among whom Irish was the primary spoken language, famine and emigration precipitated a steep decline in native speakers which only recently has begun to reverse.\n\nThe Irish language has been recognised as an official and working language of the European Union. Ireland's national language was the twenty-third to be given such recognition by the EU and previously had the status of a treaty language.\n\nScottish Gaelic\n\nSome people in the north and west of mainland Scotland and most people in the Hebrides still speak Scottish Gaelic, but  the language has been in decline.  There are now believed to be approximately 60,000 native speakers of Scottish Gaelic in Scotland, plus around 1,000 speakers of the Canadian Gaelic dialect in Nova Scotia.\n\nIts historical range was much larger. For example, it was the everyday language of most of the rest of the Scottish Highlands until little more than a century ago. Galloway was once also a Gaelic-speaking region, but the Galwegian dialect has been extinct there for approximately three centuries. It is believed to have been home to dialects that were transitional between Scottish Gaelic and the two other Goidelic languages. While Gaelic was spoken across the Scottish Borders and Lothian during the early High Middle Ages it does not seem to have been spoken by the majority and was likely the language of the ruling elite, land-owners and religious clerics. Some other parts of the Scottish Lowlands spoke Cumbric, and others Scots Inglis, the only exceptions being the Northern Isles of Orkney and Shetland where Norse was spoken.\n\nScotland takes its name from the Latin word for 'Gael', ', plural ' (of uncertain etymology).[http://dictionary.oed.com/cgi/entry/50216347 Oxford English Dictionary]: Scot, n.1. The source of the late Latin word is obscure. There is no evidence that it represents the native name of any Gaelic-speaking people (the Irish Scot, an Irishman, pl. Scuit, appears to be a learned word from Latin), nor does it exist in Welsh, though Welshmen in writing Latin have from the earliest times used Scoti as the rendering of ' (Gaels). [...]  Retrieved 11 October 2010  Scotland originally meant Land of the Gaels in a cultural and social sense. Until late in the 15th century, Scottis in Scottish English (or Scots Inglis) was used to refer only to Gaelic, and the speakers of this language who were identified  as Scots. As the ruling elite became Scots Inglis/English-speaking, Scottis was gradually associated with the land rather than the people, and the word Erse ('Irish') was gradually used more and more as an act of culturo-political disassociation with an overt implication that the language was not really Scottish, and therefore foreign. This was something of a propaganda label, as Gaelic has been in Scotland for at least as long as English, if not longer.\n\nIn the early 16th century the dialects of northern Middle English, also known as Early Scots, which had developed in Lothian and had come to be spoken elsewhere in the Kingdom of Scotland themselves later appropriated the name Scots. By the 17th century Gaelic speakers were restricted largely to the Highlands and the Hebrides. Furthermore, the culturally repressive measures taken against the rebellious Highland communities by The Crown following the second Jacobite Rebellion of 1746 caused still further decline in the language's use — to a large extent by enforced emigration (e.g. the Highland Clearances). Even more decline followed in the 19th and early 20th centuries.\n\nThe Scottish Parliament has afforded the language a secure statutory status and \"equal respect\" (but not full equality in legal status under Scots law) with English, sparking hopes that Scottish Gaelic can be saved from extinction and perhaps even revitalised.\n\nManx\n\nLong the everyday language of most of the Isle of Man, Manx began to decline sharply in the 19th century. The last monolingual Manx speakers are believed to have died around the middle of the 19th century; in 1874 around 30% of the population were estimated to speak Manx, decreasing to 9.1% in 1901 and 1.1% in 1921. The last native speaker of Manx, Ned Maddrell, died in 1974.\n\nAt the end of the 19th century a revival of Manx began, headed by the Manx Language Society ('). Both linguists and language enthusiasts searched out the last native speakers during the 20th century, recording their speech and learning from them. In the United Kingdom Census 2011, there were 1823 Manx speakers on Man, representing 2.27% of the population of 80,398, and a steady increase in the number of speakers.\n\nToday Manx is used as the sole medium for teaching at five of the island's pre-schools by a company named ', which also operates the sole Manx primary school, the '. Manx is taught as a second language at all of the Island's primary and secondary schools and also at the University College Isle of Man and Centre for Manx Studies.\n\nComparison\n\nNumbers\n\nCommon phrases\n\nInfluence on other languages\n\nThere are several languages that show Goidelic influence, although they are not Goidelic languages themselves.\n\nShelta language is sometimes thought to be a Goidelic language, but is in fact a cant based on Irish and English, with a primarily English-based syntax.\n\nThe Bungee language in Canada is an English dialect spoken by Métis that was influenced by Orkney English, Scots English, Cree, Ojibwe, and Scottish Gaelic.\n\nBeurla Reagaird is a cant spoken by Scottish traveling folk, which is to a large extent based on Scottish Gaelic.\n\nEnglish and especially Highland English have numerous words of both Scottish Gaelic and Irish origin. Goidelic languages. http://en.wikipedia.org/?curid=12469."
  }
}
