{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7471",
  "eid" : "e1bfe9e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778458494,
  "textBody" : "Saint Catherine of Siena  (March 25, 1347 in Siena – April 29, 1380 in Rome), was a tertiary of the Dominican Order and a Scholastic philosopher and theologian who had a great influence on the Catholic Church. She is declared a saint and a doctor of the Church.\n\nBorn in Siena, she grew up there and wanted very soon to devote herself to God, against the will of her parents. She joined the Sisters of the Penance of St. Dominic and made her vows. She made herself known very quickly by being marked by mystical phenomena such as stigmata and mystical marriage.\n\nShe accompanied the chaplain of the Dominicans to the pope in Avignon, as ambassador of Florence, then at war against the pope. Her influence with Pope Gregory XI played a role in his decision to leave Avignon for Rome. She was then sent by him to negotiate peace with Florence. After Gregory XI's death and peace concluded, she returned to Siena. She dictated to secretaries her set of spiritual treatises The Dialogue.\n\nThe Great Schism of the West lead Catherine of Siena to go to Rome with the pope. She sent numerous letters to princes and cardinals to promote obedience to Pope Urban VI and defend what she calls the \"vessel of the Church.\" She died on April 29, 1380, exhausted by her penances. Urban VI celebrated his funeral and burial in the Basilica of Santa Maria sopra Minerva in Rome.\n\nThe devotion around Catherine of Siena developed rapidly after her death. She was canonized in 1461, declared patron saint of Rome in 1866, and of Italy in 1939. First woman declared \"doctor of the Church\" on October 3, 19701 by Paul VI with Saint Thérèse d'Avila, she was proclaimed patron saint of Europe in 1999 by John Paul II2. She is also the patron saint of journalists, media, and all communication professions, because of her epistolary work for the papacy.\n\nCatherine of Siena is one of the outstanding figures of medieval Catholicism, by the strong influence she has had in the history of the papacy. She is behind the return of the Pope from Avignon to Rome, and then carried out many missions entrusted by the pope, something quite rare for a simple nun in the Middle Ages. \n\nHer writings - and especially The Dialogue, her major work which includes a set of treatises she would have dictated during ecstasies - mark theological thought. She is one of the most influential writers in Catholicism, to the point that she is one of only four women to be declared a doctor of the Church. This recognition by the Church consecrates the importance of her writings.\n\nSince 18 June 1939, Catherine of Siena has been one of the two patron saints of Italy, together with Francis of Assisi. Pope Pius XII, [http://www.vatican.va/holy_father/pius_xii/briefs/documents/hf_p-xii_brief_19390618_patroni-italia_it.html Pontifical Brief, 18 June 1939]. On 3 October 1970, she was proclaimed a Doctor of the Church by Pope Paul VI, [https://w2.vatican.va/content/paul-vi/it/homilies/1970/documents/hf_p-vi_hom_19701003.html Proclamation to Doctor of the Church, Homily, 3 October 1970]. and on 1 October 1999, Pope John Paul II named her as one of the six patron saints of Europe, together with Benedict of Nursia, Saints Cyril and Methodius, Bridget of Sweden and Edith Stein.[http://www.vatican.va/holy_father/john_paul_ii/motu_proprio/documents/hf_jp-ii_motu-proprio_01101999_co-patronesses-europe_en.html Proclamation of the Co-Patronesses of Europe, Apostolic Letter, 1 October 1999]. [https://webcache.googleusercontent.com/search?qcache:EQVninoe8UwJ:https://w2.vatican.va/content/john-paul-ii/en/homilies/1999/documents/hf_jp-ii_hom_13111999_st-bridget.html++%22Saint+Bridget,+whom+I+recently+chose+to+proclaim+a+Co-Patroness+of+Europe,+together+with+Saint+Catherine+of+Siena+and+Saint+Teresa+Benedicta+of+the+Cross%22&hl\nen Liturgical Feast of St. Bridget, Homily, 13 November 1999].\n\nLife \n\nCaterina di Giacomo di Benincasa was born on 25 March 1347 in Black Death-ravaged Siena, Italy, to Lapa Piagenti, the daughter of a local poet, and Giacomo di Benincasa, a cloth dyer who ran his enterprise with the help of his sons. The house where Catherine grew up is still in existence. Lapa was about forty years old when she gave premature birth to twin daughters Catherine and Giovanna. She had already borne 22 children, but half of them had died. Giovanna was handed over to a wet-nurse and died soon after.  Catherine was nursed by her mother and developed into a healthy child. She was two years old when Lapa had her 25th child, another daughter named Giovanna. As a child Catherine was so merry that the family gave her the pet name of \"Euphrosyne\", which is Greek for \"joy\" and the name of an early Christian saint.[http://www.ewtn.com/library/MARY/CATSIENA.HTM Lives of Saints], John J. Crawley & Co., Inc.\n\nCatherine is said by her confessor and biographer Raymond of Capua O.P.'s Life to have had her first vision of Christ when she was five or six years old: She and a brother were on the way home from visiting a married sister when she is said to have experienced a vision of Christ seated in glory with the Apostles Peter, Paul, and John. Raymond continues that at age seven, Catherine vowed to give her whole life to God.Raymond of Capua, Legenda Major I, iii.\n\nWhen Catherine was sixteen, her older sister Bonaventura died in childbirth; already anguished by this, Catherine soon learned that her parents wanted her to marry Bonaventura's widower. She was absolutely opposed and started a strict fast. She had learned this from Bonaventura, whose husband had been far from considerate but his wife had changed his attitude by refusing to eat until he showed better manners. Besides fasting, Catherine further disappointed her mother by cutting off her long hair as a protest against being overly encouraged to improve her appearance to attract a husband.[http://www.americancatholic.org/Features/Saints/saint.aspx?id\n1368 Foley O.F.M., Leonard. Saint of the Day, Lives, Lessons, and Feast], (revised by Pat McCloskey O.F.M.), Franciscan Media, \n \nCatherine would later advise Raymond of Capua to do during times of trouble what she did now as a teenager: \"Build a cell inside your mind, from which you can never flee.\" In this inner cell she made her father into a representation of Christ, her mother into the Blessed Virgin Mary, and her brothers into the apostles. Serving them humbly became an opportunity for spiritual growth. Catherine resisted the accepted course of marriage and motherhood on the one hand, or a nun's veil on the other. She chose to live an active and prayerful life outside a convent’s walls following the model of the Dominicans.[http://www.americancatholic.org/Messenger/Nov1999/feature2.asp#F5 Bellitto, Christopher M., \"10 Great Catholics of the Second Millennium\", St. Anthony Messenger] Eventually her father gave up and permitted her to live as she pleased.\n\nA vision of Saint Dominic gave strength to Catherine, but her wish to join his Order was no comfort to Lapa, who took her daughter with her to the baths in Bagno Vignoni to improve her health. Catherine fell seriously ill with a violent rash, fever and pain, which conveniently made her mother accept her wish to join the \"Mantellate\", the local association of Dominican tertiaries.Catherine of Siena. Available Means. Ed. Joy Ritchie and Kate Ronald. Pittsburgh, Pa.: University of Pittsburgh Press, 2001. Print. Lapa went to the Sisters of the Order and persuaded them to take in her daughter. Within days, Catherine seemed entirely restored, rose from bed and donned the black and white habit of the Third Order of Saint Dominic. Catherine received the habit of a Dominican tertiary from the friars of the order after vigorous protests from the tertiaries themselves, who up to that point had been only widows. As a tertiary, she lived outside the convent, at home with her family like before. The Mantellate taught Catherine how to read, and she lived in almost total silence and solitude in the family home.\n\nHer custom of giving away clothing and food without asking anyone's permission cost her family significantly, but she requested nothing for herself. By staying in their midst, she could live out her rejection of them more strongly. She did not want their food, referring to the table laid for her in Heaven with her real family. \n\nAccording to Raymond of Capua, at the age of twenty-one (c. 1368), Catherine experienced what she described in her letters as a \"Mystical Marriage\" with Jesus, later a popular subject in art as the Mystic marriage of Saint Catherine. Caroline Walker Bynum explains one surprising and controversial aspect of this marriage that occurs both in artistic representations of the event and in some early accounts of her life: \"Underlining the extent to which the marriage was a fusion with Christ's physicality [...] Catherine received, not the ring of gold and jewels that her biographer reports in his bowdlerized version, but the ring of Christ's foreskin.\" Catherine herself mentions the foreskin-as-wedding ring motif in one of her letters (#221), equating the wedding ring of a virgin with a foreskin; she typically claimed that her own wedding ring to Christ was simply invisible. Raymond of Capua also records that she was told by Christ to leave her withdrawn life and enter the public life of the world. Catherine rejoined her family and began helping the ill and the poor, where she took care of them in hospitals or homes. Her early pious activities in Siena attracted a group of followers, women and men, who gathered around her.\n\nAs social and political tensions mounted in Siena, Catherine found herself drawn to intervene in wider politics. She made her first journey to Florence in 1374, probably to be interviewed by the Dominican authorities at the General Chapter held in Florence in May 1374, though this is controverted (if she was interviewed, then the absence of later evidence suggests she was deemed sufficiently orthodox). It seems that at this time she acquired Raymond of Capua as her confessor and spiritual director.\n\nAfter this visit, she began travelling with her followers throughout northern and central Italy advocating reform of the clergy and advising people that repentance and renewal could be done through \"the total love for God.\" In Pisa, in 1375, she used what influence she had to sway that city and Lucca away from alliance with the anti-papal league whose force was gaining momentum and strength. She also lent her enthusiasm towards promoting the launch of a new crusade. It was in Pisa in 1375 that, according to Raymond of Capua's biography, she received the stigmata (visible, at Catherine's request, only to herself).\n\nPhysical travel was not the only way in which Catherine made her views known. From 1375 onwards, she began dictating letters to scribes. These letters were intended to reach men and women of her circle, increasingly widening her audience to include figures in authority as she begged for peace between the republics and principalities of Italy and for the return of the Papacy from Avignon to Rome. She carried on a long correspondence with Pope Gregory XI, asking him to reform the clergy and the administration of the Papal States.\n\nTowards the end of 1375, she returned to Siena, to assist a young political prisoner, Niccolò di Tuldo, at his execution.Letter T273, written by Catherine to Raymond, probably in June 1375, describes the event. In June 1376 Catherine went to Avignon as ambassador of the Republic of Florence to make peace with the Papal States (on 31 March 1376 Gregory XI had placed Florence under interdict). She was unsuccessful and was disowned by the Florentine leaders, who sent ambassadors to negotiate on their own terms as soon as Catherine's work had paved the way for them. Catherine sent an appropriately scorching letter back to Florence in response.Letter 234 in Tommaseo's numbering. While in Avignon, Catherine also tried to convince Pope Gregory XI, the last Avignon Pope, to return to Rome. Gregory did indeed return his administration to Rome in January 1377; to what extent this was due to Catherine’s influence is a topic of much modern debate.See Bernard McGinn, The Varieties of Vernacular Mysticism, (Herder & Herder, 2012), p561.\n\nCatherine returned to Siena and spent the early months of 1377 founding a women's monastery of strict observance outside the city in the old fortress of Belcaro. She spent the rest of 1377 at Rocca d'Orcia, about twenty miles from Siena, on a local mission of peace-making and preaching. During this period, in autumn 1377, she had the experience which led to the writing of her Dialogue and learned to write, although she still seems to have chiefly relied upon her secretaries for her correspondence.This experience is recorded in Letter 272, written to Raymond in October 1377.\n\nLate in 1377 or early in 1378 Catherine again travelled to Florence, at the order of Gregory XI, to seek peace between Florence and Rome. Following Gregory's death in March 1378 riots, the revolts of the Ciompi, broke out in Florence on 18 June, and in the ensuing violence she was nearly assassinated. Eventually, in July 1378, peace was agreed between Florence and Rome; Catherine returned quietly to Florence.\n\nIn late November 1378, with the outbreak of the Western Schism, the new Pope, Urban VI, summoned her to Rome. She stayed at Pope Urban VI's court and tried to convince nobles and cardinals of his legitimacy, both meeting with individuals at court and writing letters to persuade others.\n\nFor many years she had accustomed herself to a rigorous abstinence.[http://www.ewtn.com/library/MARY/CSIENA.HTM Butler, Alban. The Lives or the Fathers, Martyrs and Other Principal Saints, Vol. IV, D. & J. Sadlier, & Company, (1864)] She received the Holy Eucharist almost daily. This extreme fasting appeared unhealthy in the eyes of the clergy and her own sisterhood. Her confessor, Blessed Raymond, ordered her to eat properly. But Catherine claimed that she was unable to, describing her inability to eat as an infermità (illness). From the beginning of 1380, Catherine could neither eat nor swallow water. On February 26 she lost the use of her legs.\n\nCatherine died in Rome, on 29 April 1380, at the age of thirty-three, having eight days earlier suffered a massive stroke which paralyzed her from the waist down. Her last words were, “Father, into Your Hands I commend my soul and my spirit.”\n\nSources of her life\n\nThere is some internal evidence of Catherine's personality, teaching and work in her nearly four hundred letters, her Dialogue, and her prayers.\n\nMuch detail about her life has also, however, been drawn from the various sources written shortly after her death in order to promote her cult and canonisation. Though much of this material is heavily hagiographic, it has been an important source for historians seeking to reconstruct Catherine's life. Various sources are particularly important, especially the works of Raymond of Capua, who was Catherine's spiritual director and close friend from 1374 until her death, and himself became Master General of the Order in 1380. Raymond began writing what is known as the Legenda Major, his Life of Catherine, in 1384, and completed it in 1395.\n\nAnother important work written after Catherine's death was Libellus de Supplemento (Little Supplement Book), written between 1412 and 1418 by Tommaso d'Antonio Nacci da Siena (commonly called Thomas of Siena, or Tommaso Caffarini): the work is an expansion of Raymond's Legenda Major making heavy use of the notes of Catherine's first confessor, Tommaso della Fonte (notes that do not survive anywhere else). Caffarini later published a more compact account of Catherine's life, entitled the Legenda Minor.\n\nFrom 1411 onwards, Caffarini also co-ordinated the compiling of the Processus of Venice, the set of documents submitted as part of the process of canonisation of Catherine, which provides testimony from nearly all of Catherine's disciples. There is also an anonymous piece entitled \"Miracoli della Beata Caterina\" (Miracle of Blessed Catherine), written by an anonymous Florentine. A few other relevant pieces survive.\n\nWorks\n\nThree genres of work by Catherine survive:\n* Her major treatise is The Dialogue of Divine Providence. This was probably begun in October 1377, and was certainly finished by November 1378. Contemporaries of Catherine are united in asserting that much of the book was dictated while Catherine was in ecstasy, though it also seems possible that Catherine herself may then have re-edited many passages in the book. It is a dialogue between a soul who \"rises up\" to God and God himself.\n* Catherine's letters are considered one of the great works of early Tuscan literature. Many of these were dictated, although she herself learned to write in 1377; more than 300 have survived. In her letters to the Pope, she often referred to him affectionately simply as Papa (\"Pope\"), instead of the formal form of address as \"Holiness\". Other correspondents include her various confessors, among them Raymond of Capua, the kings of France and Hungary, the infamous mercenary John Hawkwood, the Queen of Naples, members of the Visconti family of Milan, and numerous religious figures. Approximately one third of her letters are to women.\n* 26 prayers of Catherine of Siena also survive, mostly composed in the last eighteen months of her life.\n\nTheology \n\nCatherine’s theology can be described as mystical, and was employed towards practical ends for her own spiritual life or those of others.Noffke, Suzanne. “Catherine of Siena.” In Medieval Holy Women in the Christian Tradition c. 1100-c. 1500. Alastair J. Minnis and Rosalynn Voaden, eds. Turnhout: Brepols, 2010. 613. She used the language of medieval scholastic philosophy to elaborate her experiential mysticism.Foster, Kenelm. \"St Catherine's Teaching on Christ.\" Life of the Spirit (1946-1964) 16, no. 187 (1962): 313. http://www.jstor.org/stable/43705923. Interested mainly with achieving an incorporeal union with God, Catherine practiced extreme fasting and asceticism, eventually to the extent of living solely off the Eucharist every day.Finnegan, Mary Jeremy. \"Catherine of Siena: The Two Hungers.\" Mystics Quarterly 17, no. 4 (1991): 173-80. For Catherine, this practice was the means to realize fully her love of Christ in her mystical experience, with a large proportion of her ecstatic visions relating to the consumption or rejection of food during her life.Noffke, Suzanne. “Catherine of Siena.” In Medieval Holy Women in the Christian Tradition c. 1100-c. 1500. Alastair J. Minnis and Rosalynn Voaden, eds. Turnhout: Brepols, 2010. She viewed Christ as a \"bridge\" between the soul and God and transmitted that idea, along with her other teachings, in her book The Dialogue.Catherine of Siena. The Dialogue. Translated by Suzanne Noffke. The Classics of Western Spirituality. Paulist Press, 1980. The Dialogue is highly systematic and explanatory in its presentation of her mystical ideas; however, these ideas themselves are not so much based in reason or logic as they are based in her ecstatic mystical experience.Noffke, Suzanne. “Catherine of Siena.” In Medieval Holy Women in the Christian Tradition c. 1100-c. 1500. Alastair J. Minnis and Rosalynn Voaden, eds. Turnhout: Brepols, 2010. 601-615.\n\nVeneration\n\nShe was buried in the (Roman) cemetery of Santa Maria sopra Minerva which lies near the Pantheon. After miracles were reported to take place at her grave, Raymond moved her inside the Basilica of Santa Maria sopra Minerva, where she lies to this day.\n\nHer head however, was parted from her body and inserted in a gilt bust of bronze. This bust was later taken to Siena, and carried through that city in a procession to the Dominican church. Behind the bust walked Lapa, Catherine's mother, who lived until she was 89 years old. By then she had seen the end of the wealth and the happiness of her family, and followed most of her children and several of her grandchildren to the grave. She helped Raymond of Capua write his biography of her daughter, and said, \"I think God has laid my soul athwart in my body, so that it can't get out.\" The incorrupt head and thumb were entombed in the Basilica of San Domenico at Siena, where they remain.\n\nPope Pius II, himself from Siena, canonized Catherine on 29 June 1461.[https://web.archive.org/web/20060422131354/http://www.americancatholic.org/Messenger/Apr2006/Feature1.asp Beckwith, Barbara. \"St. Catherine of Siena: A Feisty Role for Sister Nancy Murray\", St. Anthony Messenger]\n\nOn 3 October 1970, Pope Paul VI named Catherine a Doctor of the Church; this title was almost simultaneously given to Saint Teresa of Ávila (27 September 1970), [http://www.vatican.va/holy_father/paul_vi/homilies/1970/documents/hf_p-vi_hom_19700927_it.html Proclamation of Saint Teresa of Ávila to Doctor of the Church, Homily, 27 September 1970]. making them the first women to receive this honour.\n\nInitially however, her feast day was not included in the General Roman Calendar. When it was added in 1597, it was put on the day of her death, April 29; however, because this conflicted with the feast of Saint Peter of Verona which also fell on the 29th of April, Catherine's feast day was moved in 1628 to the new date of April 30.\"Calendarium Romanum\" (Libreria Editrice Vaticana, 1969), p. 91. In the 1969 revision of the calendar, it was decided to leave the celebration of the feast of St Peter of Verona to local calendars, because he was not as well known worldwide, and Catherine's feast was restored to April 29.\n\nPatronage\n\nIn his decree of 13 April 1866, Pope Pius IX declared Catherine of Siena to be a co-patroness of Rome. On 18 June 1939 Pope Pius XII named her a joint patron saint of Italy along with Saint Francis of Assisi.\n\nOn 1 October 1999, Pope John Paul II made her one of Europe's patron saints, along with Edith Stein and Bridget of Sweden. She is also the patroness of the historically Catholic American woman's fraternity, Theta Phi Alpha.\n\nIconography\n\nThe people of Siena wished to have Catherine's body. A story is told of a miracle whereby they were partially successful: knowing that they could not smuggle her whole body out of Rome, they decided to take only her head which they placed in a bag. When stopped by the Roman guards, they prayed to Catherine to help them, confident that she would rather have her body (or at least part thereof) in Siena. When they opened the bag to show the guards, it appeared no longer to hold her head but to be full of rose petals. Once back at Siena, as they reopened the bag her head was visible once more. Due to this story, Catherine is often seen holding a lily.\n\nLegacy\n\nCatherine ranks high among the mystics and spiritual writers of the Church. She remains a greatly respected figure for her spiritual writings, and political boldness to \"speak truth to power\"— it being exceptional for a woman, in her time period, to have had such influence in politics and on world history.\n\nMain sanctuaries\n\nThe main temples in honor of Catherine of Siena are:\n\n* Basilica of Santa Maria sopra Minerva in Rome: place where her body is preserved.\n* Basilica of San Domenico in Siena: in this temple the incorrupt head of Catherine of Siena is preserved.\n*  in Siena: complex of religious buildings built around the birthplace of Catherine.\n\nImages\n\nFile:CatherineSienaMeo.jpg|Michele de Meo, Catherine of Siena, Patroness of Europe, 2003, Chapel of St. James, Church of Santa Maria sopra Minerva\nFile:CatherineCommunionBeccafumi.jpg|Domenico Beccafumi, The Miraculous Communion of St. Catherine of Siena, circa 1513-1515, Getty Center, Los Angeles, California\nFile:CSienaStigmataBeccafumi.jpg|Domenico Beccafumi, St. Catherine of Siena Receiving the Stigmata, circa 1513-1515, Getty Center, Los Angeles, California\nFile:RosaryStaAgata.jpg|The Virgin Mary Giving the Rosary to St. Dominic and St. Catherine of Siena, Church of Santa Agata in Trastevere, Rome (Bottom of painting: the souls in Purgatory await the prayers of the faithful)\n\nFile:Franceschini, Baldassare - St Catherine of Siena - Google Art Project.jpg|Baldassare Franceschini, Saint Catherine of Siena, 17th century, Dulwich Picture Gallery\n\nFile:Giovanni di paolo, St Catherine of Siena.jpg|Giovanni di Paolo, St. Catherine of Siena, c. 1475, oil on tempera.  Fogg Art Museum, Cambridge, England.\n\nFile:Lesser Poland St. Catherine of Siena.jpg|St Catherine and the Demons by an unknown artist, c. 1500, tempera on panel. National Museum, Warsaw.\nFile:Anoniem - Het kantoor van de belastingsdienst (biccherna) van Siena.jpg|The office of the taxcollector (biccherna) of Siena by an unknown artist, 1451 - 1452, Rijksmuseum Amsterdam\nFile:Revelación del Santísimo Rosario a Santo Domingo de Guzmán.jpg|This painting depicts the Virgin giving the rosary to St. Dominic; in the scene also appear Fray Pedro de Santa María Ulloa, Saint Catherine of Siena and Servant of God, Mary of Jesus de León y Delgado. The fresco is located in the Church of Santo Domingo in San Cristóbal de La Laguna, Tenerife, Spain.\nFile:San Domenico74.jpg|St Catherine's mystic communion by Francesco Brizzi\nFile:Head of Saint Catherine of Siena.jpg|The head exposed in the Basilica of San Domenico, Siena\n\nSources\n\n* Blessed Raymond of Capua, The Life of St. Catherine of Siena, tr. George Lamb (Rockford, Illinois: TAN Books, 2003)\n* Catherine of Siena, The Dialogue, trans. Suzanne Noffke (Paulist Press, New York, 1980)  \n* Hollister, Warren C. and Bennett, Judith M. Medieval Europe: A Short History, 9th ed. (McGraw-Hill Companies Inc, Boston, 2002)\n* Skårderud, Finn. Holy anorexia: Catherine of Siena (Tidsskrift for norsk psykologforening, Oslo, 2008)\n\nModern editions and English translations\n\n*The Italian critical edition of the Dialogue is Catherine of Siena, Il Dialogo della divina Provvidenza: ovvero Libro della divina dottrina, 2nd ed., ed. Giuliana Cavallini (Siena: Cantagalli, 1995). [1st edn, 1968] [Cavallini demonstrated that the standard division of the Dialogue in into four treatises entitled the 'Treatise on Discretion', 'On Prayer', 'On Providence', and 'On Obedience', was in fact a result of a misreading of the text in the 1579 edition of the Dialogue. Modern editors and translators, including Noffke (1980), have followed Cavallini in rejecting this fourfold division.]\n*The Italian critical edition of the 26 Prayers is Catherine of Siena, Le Orazioni, ed. Giuliana Cavallini (Rome: Cateriniane, 1978)\n*The most recent Italian critical edition of the Letters is Antonio Volpato, ed, Le lettere di Santa Caterina da Siena: l'edizione di Eugenio Duprè Theseider e i nuovi problemi, (2002)\n\nEnglish translations of The Dialogue include:\n*[https://books.google.com/books?id=bsGXhNZyUSgC The Dialogue], trans. Suzanne Noffke, O.P. Paulist Press (Classics of Western Spirituality), 1980.\n*The Dialogue of St. Catherine of Siena, TAN Books, 2009.  \n*Phyllis Hodgson and Gabriel M Liegey, eds., The Orcherd of Syon, (London; New York: Oxford UP, 1966) [A Middle English translation of the Dialogo from the early fifteenth century, first printed in 1519].\n\nThe Letters are translated into English as:\n* (Republished as The letters of Catherine of Siena, 4 vols, trans Suzanne Noffke, (Tempe, AZ: Arizona Center for Medieval and Renaissance Studies, 2000–2008))\n\nThe Prayers are translated into English as:\n*The Prayers of Catherine of Siena, trans. Suzanne Noffke, 2nd edn 1983, (New York, 2001)\n\nRaymond of Capua's Life was translated into English in 1493 and 1609, and in Modern English is translated as:\n*",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Catherine of Siena" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7471" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Saint Catherine of Siena  (March 25, 1347 in Siena – April 29, 1380 in Rome), was a tertiary of the Dominican Order and a Scholastic philosopher and theologian who had a great influence on the Catholic Church. She is declared a saint and a doctor of the Church.\n\nBorn in Siena, she grew up there and wanted very soon to devote herself to God, against the will of her parents. She joined the Sisters of the Penance of St. Dominic and made her vows. She made herself known very quickly by being marked by mystical phenomena such as stigmata and mystical marriage.\n\nShe accompanied the chaplain of the Dominicans to the pope in Avignon, as ambassador of Florence, then at war against the pope. Her influence with Pope Gregory XI played a role in his decision to leave Avignon for Rome. She was then sent by him to negotiate peace with Florence. After Gregory XI's death and peace concluded, she returned to Siena. She dictated to secretaries her set of spiritual treatises The Dialogue.\n\nThe Great Schism of the West lead Catherine of Siena to go to Rome with the pope. She sent numerous letters to princes and cardinals to promote obedience to Pope Urban VI and defend what she calls the \"vessel of the Church.\" She died on April 29, 1380, exhausted by her penances. Urban VI celebrated his funeral and burial in the Basilica of Santa Maria sopra Minerva in Rome.\n\nThe devotion around Catherine of Siena developed rapidly after her death. She was canonized in 1461, declared patron saint of Rome in 1866, and of Italy in 1939. First woman declared \"doctor of the Church\" on October 3, 19701 by Paul VI with Saint Thérèse d'Avila, she was proclaimed patron saint of Europe in 1999 by John Paul II2. She is also the patron saint of journalists, media, and all communication professions, because of her epistolary work for the papacy.\n\nCatherine of Siena is one of the outstanding figures of medieval Catholicism, by the strong influence she has had in the history of the papacy. She is behind the return of the Pope from Avignon to Rome, and then carried out many missions entrusted by the pope, something quite rare for a simple nun in the Middle Ages. \n\nHer writings - and especially The Dialogue, her major work which includes a set of treatises she would have dictated during ecstasies - mark theological thought. She is one of the most influential writers in Catholicism, to the point that she is one of only four women to be declared a doctor of the Church. This recognition by the Church consecrates the importance of her writings.\n\nSince 18 June 1939, Catherine of Siena has been one of the two patron saints of Italy, together with Francis of Assisi. Pope Pius XII, [http://www.vatican.va/holy_father/pius_xii/briefs/documents/hf_p-xii_brief_19390618_patroni-italia_it.html Pontifical Brief, 18 June 1939]. On 3 October 1970, she was proclaimed a Doctor of the Church by Pope Paul VI, [https://w2.vatican.va/content/paul-vi/it/homilies/1970/documents/hf_p-vi_hom_19701003.html Proclamation to Doctor of the Church, Homily, 3 October 1970]. and on 1 October 1999, Pope John Paul II named her as one of the six patron saints of Europe, together with Benedict of Nursia, Saints Cyril and Methodius, Bridget of Sweden and Edith Stein.[http://www.vatican.va/holy_father/john_paul_ii/motu_proprio/documents/hf_jp-ii_motu-proprio_01101999_co-patronesses-europe_en.html Proclamation of the Co-Patronesses of Europe, Apostolic Letter, 1 October 1999]. [https://webcache.googleusercontent.com/search?qcache:EQVninoe8UwJ:https://w2.vatican.va/content/john-paul-ii/en/homilies/1999/documents/hf_jp-ii_hom_13111999_st-bridget.html++%22Saint+Bridget,+whom+I+recently+chose+to+proclaim+a+Co-Patroness+of+Europe,+together+with+Saint+Catherine+of+Siena+and+Saint+Teresa+Benedicta+of+the+Cross%22&hl\nen Liturgical Feast of St. Bridget, Homily, 13 November 1999].\n\nLife \n\nCaterina di Giacomo di Benincasa was born on 25 March 1347 in Black Death-ravaged Siena, Italy, to Lapa Piagenti, the daughter of a local poet, and Giacomo di Benincasa, a cloth dyer who ran his enterprise with the help of his sons. The house where Catherine grew up is still in existence. Lapa was about forty years old when she gave premature birth to twin daughters Catherine and Giovanna. She had already borne 22 children, but half of them had died. Giovanna was handed over to a wet-nurse and died soon after.  Catherine was nursed by her mother and developed into a healthy child. She was two years old when Lapa had her 25th child, another daughter named Giovanna. As a child Catherine was so merry that the family gave her the pet name of \"Euphrosyne\", which is Greek for \"joy\" and the name of an early Christian saint.[http://www.ewtn.com/library/MARY/CATSIENA.HTM Lives of Saints], John J. Crawley & Co., Inc.\n\nCatherine is said by her confessor and biographer Raymond of Capua O.P.'s Life to have had her first vision of Christ when she was five or six years old: She and a brother were on the way home from visiting a married sister when she is said to have experienced a vision of Christ seated in glory with the Apostles Peter, Paul, and John. Raymond continues that at age seven, Catherine vowed to give her whole life to God.Raymond of Capua, Legenda Major I, iii.\n\nWhen Catherine was sixteen, her older sister Bonaventura died in childbirth; already anguished by this, Catherine soon learned that her parents wanted her to marry Bonaventura's widower. She was absolutely opposed and started a strict fast. She had learned this from Bonaventura, whose husband had been far from considerate but his wife had changed his attitude by refusing to eat until he showed better manners. Besides fasting, Catherine further disappointed her mother by cutting off her long hair as a protest against being overly encouraged to improve her appearance to attract a husband.[http://www.americancatholic.org/Features/Saints/saint.aspx?id\n1368 Foley O.F.M., Leonard. Saint of the Day, Lives, Lessons, and Feast], (revised by Pat McCloskey O.F.M.), Franciscan Media, \n \nCatherine would later advise Raymond of Capua to do during times of trouble what she did now as a teenager: \"Build a cell inside your mind, from which you can never flee.\" In this inner cell she made her father into a representation of Christ, her mother into the Blessed Virgin Mary, and her brothers into the apostles. Serving them humbly became an opportunity for spiritual growth. Catherine resisted the accepted course of marriage and motherhood on the one hand, or a nun's veil on the other. She chose to live an active and prayerful life outside a convent’s walls following the model of the Dominicans.[http://www.americancatholic.org/Messenger/Nov1999/feature2.asp#F5 Bellitto, Christopher M., \"10 Great Catholics of the Second Millennium\", St. Anthony Messenger] Eventually her father gave up and permitted her to live as she pleased.\n\nA vision of Saint Dominic gave strength to Catherine, but her wish to join his Order was no comfort to Lapa, who took her daughter with her to the baths in Bagno Vignoni to improve her health. Catherine fell seriously ill with a violent rash, fever and pain, which conveniently made her mother accept her wish to join the \"Mantellate\", the local association of Dominican tertiaries.Catherine of Siena. Available Means. Ed. Joy Ritchie and Kate Ronald. Pittsburgh, Pa.: University of Pittsburgh Press, 2001. Print. Lapa went to the Sisters of the Order and persuaded them to take in her daughter. Within days, Catherine seemed entirely restored, rose from bed and donned the black and white habit of the Third Order of Saint Dominic. Catherine received the habit of a Dominican tertiary from the friars of the order after vigorous protests from the tertiaries themselves, who up to that point had been only widows. As a tertiary, she lived outside the convent, at home with her family like before. The Mantellate taught Catherine how to read, and she lived in almost total silence and solitude in the family home.\n\nHer custom of giving away clothing and food without asking anyone's permission cost her family significantly, but she requested nothing for herself. By staying in their midst, she could live out her rejection of them more strongly. She did not want their food, referring to the table laid for her in Heaven with her real family. \n\nAccording to Raymond of Capua, at the age of twenty-one (c. 1368), Catherine experienced what she described in her letters as a \"Mystical Marriage\" with Jesus, later a popular subject in art as the Mystic marriage of Saint Catherine. Caroline Walker Bynum explains one surprising and controversial aspect of this marriage that occurs both in artistic representations of the event and in some early accounts of her life: \"Underlining the extent to which the marriage was a fusion with Christ's physicality [...] Catherine received, not the ring of gold and jewels that her biographer reports in his bowdlerized version, but the ring of Christ's foreskin.\" Catherine herself mentions the foreskin-as-wedding ring motif in one of her letters (#221), equating the wedding ring of a virgin with a foreskin; she typically claimed that her own wedding ring to Christ was simply invisible. Raymond of Capua also records that she was told by Christ to leave her withdrawn life and enter the public life of the world. Catherine rejoined her family and began helping the ill and the poor, where she took care of them in hospitals or homes. Her early pious activities in Siena attracted a group of followers, women and men, who gathered around her.\n\nAs social and political tensions mounted in Siena, Catherine found herself drawn to intervene in wider politics. She made her first journey to Florence in 1374, probably to be interviewed by the Dominican authorities at the General Chapter held in Florence in May 1374, though this is controverted (if she was interviewed, then the absence of later evidence suggests she was deemed sufficiently orthodox). It seems that at this time she acquired Raymond of Capua as her confessor and spiritual director.\n\nAfter this visit, she began travelling with her followers throughout northern and central Italy advocating reform of the clergy and advising people that repentance and renewal could be done through \"the total love for God.\" In Pisa, in 1375, she used what influence she had to sway that city and Lucca away from alliance with the anti-papal league whose force was gaining momentum and strength. She also lent her enthusiasm towards promoting the launch of a new crusade. It was in Pisa in 1375 that, according to Raymond of Capua's biography, she received the stigmata (visible, at Catherine's request, only to herself).\n\nPhysical travel was not the only way in which Catherine made her views known. From 1375 onwards, she began dictating letters to scribes. These letters were intended to reach men and women of her circle, increasingly widening her audience to include figures in authority as she begged for peace between the republics and principalities of Italy and for the return of the Papacy from Avignon to Rome. She carried on a long correspondence with Pope Gregory XI, asking him to reform the clergy and the administration of the Papal States.\n\nTowards the end of 1375, she returned to Siena, to assist a young political prisoner, Niccolò di Tuldo, at his execution.Letter T273, written by Catherine to Raymond, probably in June 1375, describes the event. In June 1376 Catherine went to Avignon as ambassador of the Republic of Florence to make peace with the Papal States (on 31 March 1376 Gregory XI had placed Florence under interdict). She was unsuccessful and was disowned by the Florentine leaders, who sent ambassadors to negotiate on their own terms as soon as Catherine's work had paved the way for them. Catherine sent an appropriately scorching letter back to Florence in response.Letter 234 in Tommaseo's numbering. While in Avignon, Catherine also tried to convince Pope Gregory XI, the last Avignon Pope, to return to Rome. Gregory did indeed return his administration to Rome in January 1377; to what extent this was due to Catherine’s influence is a topic of much modern debate.See Bernard McGinn, The Varieties of Vernacular Mysticism, (Herder & Herder, 2012), p561.\n\nCatherine returned to Siena and spent the early months of 1377 founding a women's monastery of strict observance outside the city in the old fortress of Belcaro. She spent the rest of 1377 at Rocca d'Orcia, about twenty miles from Siena, on a local mission of peace-making and preaching. During this period, in autumn 1377, she had the experience which led to the writing of her Dialogue and learned to write, although she still seems to have chiefly relied upon her secretaries for her correspondence.This experience is recorded in Letter 272, written to Raymond in October 1377.\n\nLate in 1377 or early in 1378 Catherine again travelled to Florence, at the order of Gregory XI, to seek peace between Florence and Rome. Following Gregory's death in March 1378 riots, the revolts of the Ciompi, broke out in Florence on 18 June, and in the ensuing violence she was nearly assassinated. Eventually, in July 1378, peace was agreed between Florence and Rome; Catherine returned quietly to Florence.\n\nIn late November 1378, with the outbreak of the Western Schism, the new Pope, Urban VI, summoned her to Rome. She stayed at Pope Urban VI's court and tried to convince nobles and cardinals of his legitimacy, both meeting with individuals at court and writing letters to persuade others.\n\nFor many years she had accustomed herself to a rigorous abstinence.[http://www.ewtn.com/library/MARY/CSIENA.HTM Butler, Alban. The Lives or the Fathers, Martyrs and Other Principal Saints, Vol. IV, D. & J. Sadlier, & Company, (1864)] She received the Holy Eucharist almost daily. This extreme fasting appeared unhealthy in the eyes of the clergy and her own sisterhood. Her confessor, Blessed Raymond, ordered her to eat properly. But Catherine claimed that she was unable to, describing her inability to eat as an infermità (illness). From the beginning of 1380, Catherine could neither eat nor swallow water. On February 26 she lost the use of her legs.\n\nCatherine died in Rome, on 29 April 1380, at the age of thirty-three, having eight days earlier suffered a massive stroke which paralyzed her from the waist down. Her last words were, “Father, into Your Hands I commend my soul and my spirit.”\n\nSources of her life\n\nThere is some internal evidence of Catherine's personality, teaching and work in her nearly four hundred letters, her Dialogue, and her prayers.\n\nMuch detail about her life has also, however, been drawn from the various sources written shortly after her death in order to promote her cult and canonisation. Though much of this material is heavily hagiographic, it has been an important source for historians seeking to reconstruct Catherine's life. Various sources are particularly important, especially the works of Raymond of Capua, who was Catherine's spiritual director and close friend from 1374 until her death, and himself became Master General of the Order in 1380. Raymond began writing what is known as the Legenda Major, his Life of Catherine, in 1384, and completed it in 1395.\n\nAnother important work written after Catherine's death was Libellus de Supplemento (Little Supplement Book), written between 1412 and 1418 by Tommaso d'Antonio Nacci da Siena (commonly called Thomas of Siena, or Tommaso Caffarini): the work is an expansion of Raymond's Legenda Major making heavy use of the notes of Catherine's first confessor, Tommaso della Fonte (notes that do not survive anywhere else). Caffarini later published a more compact account of Catherine's life, entitled the Legenda Minor.\n\nFrom 1411 onwards, Caffarini also co-ordinated the compiling of the Processus of Venice, the set of documents submitted as part of the process of canonisation of Catherine, which provides testimony from nearly all of Catherine's disciples. There is also an anonymous piece entitled \"Miracoli della Beata Caterina\" (Miracle of Blessed Catherine), written by an anonymous Florentine. A few other relevant pieces survive.\n\nWorks\n\nThree genres of work by Catherine survive:\n* Her major treatise is The Dialogue of Divine Providence. This was probably begun in October 1377, and was certainly finished by November 1378. Contemporaries of Catherine are united in asserting that much of the book was dictated while Catherine was in ecstasy, though it also seems possible that Catherine herself may then have re-edited many passages in the book. It is a dialogue between a soul who \"rises up\" to God and God himself.\n* Catherine's letters are considered one of the great works of early Tuscan literature. Many of these were dictated, although she herself learned to write in 1377; more than 300 have survived. In her letters to the Pope, she often referred to him affectionately simply as Papa (\"Pope\"), instead of the formal form of address as \"Holiness\". Other correspondents include her various confessors, among them Raymond of Capua, the kings of France and Hungary, the infamous mercenary John Hawkwood, the Queen of Naples, members of the Visconti family of Milan, and numerous religious figures. Approximately one third of her letters are to women.\n* 26 prayers of Catherine of Siena also survive, mostly composed in the last eighteen months of her life.\n\nTheology \n\nCatherine’s theology can be described as mystical, and was employed towards practical ends for her own spiritual life or those of others.Noffke, Suzanne. “Catherine of Siena.” In Medieval Holy Women in the Christian Tradition c. 1100-c. 1500. Alastair J. Minnis and Rosalynn Voaden, eds. Turnhout: Brepols, 2010. 613. She used the language of medieval scholastic philosophy to elaborate her experiential mysticism.Foster, Kenelm. \"St Catherine's Teaching on Christ.\" Life of the Spirit (1946-1964) 16, no. 187 (1962): 313. http://www.jstor.org/stable/43705923. Interested mainly with achieving an incorporeal union with God, Catherine practiced extreme fasting and asceticism, eventually to the extent of living solely off the Eucharist every day.Finnegan, Mary Jeremy. \"Catherine of Siena: The Two Hungers.\" Mystics Quarterly 17, no. 4 (1991): 173-80. For Catherine, this practice was the means to realize fully her love of Christ in her mystical experience, with a large proportion of her ecstatic visions relating to the consumption or rejection of food during her life.Noffke, Suzanne. “Catherine of Siena.” In Medieval Holy Women in the Christian Tradition c. 1100-c. 1500. Alastair J. Minnis and Rosalynn Voaden, eds. Turnhout: Brepols, 2010. She viewed Christ as a \"bridge\" between the soul and God and transmitted that idea, along with her other teachings, in her book The Dialogue.Catherine of Siena. The Dialogue. Translated by Suzanne Noffke. The Classics of Western Spirituality. Paulist Press, 1980. The Dialogue is highly systematic and explanatory in its presentation of her mystical ideas; however, these ideas themselves are not so much based in reason or logic as they are based in her ecstatic mystical experience.Noffke, Suzanne. “Catherine of Siena.” In Medieval Holy Women in the Christian Tradition c. 1100-c. 1500. Alastair J. Minnis and Rosalynn Voaden, eds. Turnhout: Brepols, 2010. 601-615.\n\nVeneration\n\nShe was buried in the (Roman) cemetery of Santa Maria sopra Minerva which lies near the Pantheon. After miracles were reported to take place at her grave, Raymond moved her inside the Basilica of Santa Maria sopra Minerva, where she lies to this day.\n\nHer head however, was parted from her body and inserted in a gilt bust of bronze. This bust was later taken to Siena, and carried through that city in a procession to the Dominican church. Behind the bust walked Lapa, Catherine's mother, who lived until she was 89 years old. By then she had seen the end of the wealth and the happiness of her family, and followed most of her children and several of her grandchildren to the grave. She helped Raymond of Capua write his biography of her daughter, and said, \"I think God has laid my soul athwart in my body, so that it can't get out.\" The incorrupt head and thumb were entombed in the Basilica of San Domenico at Siena, where they remain.\n\nPope Pius II, himself from Siena, canonized Catherine on 29 June 1461.[https://web.archive.org/web/20060422131354/http://www.americancatholic.org/Messenger/Apr2006/Feature1.asp Beckwith, Barbara. \"St. Catherine of Siena: A Feisty Role for Sister Nancy Murray\", St. Anthony Messenger]\n\nOn 3 October 1970, Pope Paul VI named Catherine a Doctor of the Church; this title was almost simultaneously given to Saint Teresa of Ávila (27 September 1970), [http://www.vatican.va/holy_father/paul_vi/homilies/1970/documents/hf_p-vi_hom_19700927_it.html Proclamation of Saint Teresa of Ávila to Doctor of the Church, Homily, 27 September 1970]. making them the first women to receive this honour.\n\nInitially however, her feast day was not included in the General Roman Calendar. When it was added in 1597, it was put on the day of her death, April 29; however, because this conflicted with the feast of Saint Peter of Verona which also fell on the 29th of April, Catherine's feast day was moved in 1628 to the new date of April 30.\"Calendarium Romanum\" (Libreria Editrice Vaticana, 1969), p. 91. In the 1969 revision of the calendar, it was decided to leave the celebration of the feast of St Peter of Verona to local calendars, because he was not as well known worldwide, and Catherine's feast was restored to April 29.\n\nPatronage\n\nIn his decree of 13 April 1866, Pope Pius IX declared Catherine of Siena to be a co-patroness of Rome. On 18 June 1939 Pope Pius XII named her a joint patron saint of Italy along with Saint Francis of Assisi.\n\nOn 1 October 1999, Pope John Paul II made her one of Europe's patron saints, along with Edith Stein and Bridget of Sweden. She is also the patroness of the historically Catholic American woman's fraternity, Theta Phi Alpha.\n\nIconography\n\nThe people of Siena wished to have Catherine's body. A story is told of a miracle whereby they were partially successful: knowing that they could not smuggle her whole body out of Rome, they decided to take only her head which they placed in a bag. When stopped by the Roman guards, they prayed to Catherine to help them, confident that she would rather have her body (or at least part thereof) in Siena. When they opened the bag to show the guards, it appeared no longer to hold her head but to be full of rose petals. Once back at Siena, as they reopened the bag her head was visible once more. Due to this story, Catherine is often seen holding a lily.\n\nLegacy\n\nCatherine ranks high among the mystics and spiritual writers of the Church. She remains a greatly respected figure for her spiritual writings, and political boldness to \"speak truth to power\"— it being exceptional for a woman, in her time period, to have had such influence in politics and on world history.\n\nMain sanctuaries\n\nThe main temples in honor of Catherine of Siena are:\n\n* Basilica of Santa Maria sopra Minerva in Rome: place where her body is preserved.\n* Basilica of San Domenico in Siena: in this temple the incorrupt head of Catherine of Siena is preserved.\n*  in Siena: complex of religious buildings built around the birthplace of Catherine.\n\nImages\n\nFile:CatherineSienaMeo.jpg|Michele de Meo, Catherine of Siena, Patroness of Europe, 2003, Chapel of St. James, Church of Santa Maria sopra Minerva\nFile:CatherineCommunionBeccafumi.jpg|Domenico Beccafumi, The Miraculous Communion of St. Catherine of Siena, circa 1513-1515, Getty Center, Los Angeles, California\nFile:CSienaStigmataBeccafumi.jpg|Domenico Beccafumi, St. Catherine of Siena Receiving the Stigmata, circa 1513-1515, Getty Center, Los Angeles, California\nFile:RosaryStaAgata.jpg|The Virgin Mary Giving the Rosary to St. Dominic and St. Catherine of Siena, Church of Santa Agata in Trastevere, Rome (Bottom of painting: the souls in Purgatory await the prayers of the faithful)\n\nFile:Franceschini, Baldassare - St Catherine of Siena - Google Art Project.jpg|Baldassare Franceschini, Saint Catherine of Siena, 17th century, Dulwich Picture Gallery\n\nFile:Giovanni di paolo, St Catherine of Siena.jpg|Giovanni di Paolo, St. Catherine of Siena, c. 1475, oil on tempera.  Fogg Art Museum, Cambridge, England.\n\nFile:Lesser Poland St. Catherine of Siena.jpg|St Catherine and the Demons by an unknown artist, c. 1500, tempera on panel. National Museum, Warsaw.\nFile:Anoniem - Het kantoor van de belastingsdienst (biccherna) van Siena.jpg|The office of the taxcollector (biccherna) of Siena by an unknown artist, 1451 - 1452, Rijksmuseum Amsterdam\nFile:Revelación del Santísimo Rosario a Santo Domingo de Guzmán.jpg|This painting depicts the Virgin giving the rosary to St. Dominic; in the scene also appear Fray Pedro de Santa María Ulloa, Saint Catherine of Siena and Servant of God, Mary of Jesus de León y Delgado. The fresco is located in the Church of Santo Domingo in San Cristóbal de La Laguna, Tenerife, Spain.\nFile:San Domenico74.jpg|St Catherine's mystic communion by Francesco Brizzi\nFile:Head of Saint Catherine of Siena.jpg|The head exposed in the Basilica of San Domenico, Siena\n\nSources\n\n* Blessed Raymond of Capua, The Life of St. Catherine of Siena, tr. George Lamb (Rockford, Illinois: TAN Books, 2003)\n* Catherine of Siena, The Dialogue, trans. Suzanne Noffke (Paulist Press, New York, 1980)  \n* Hollister, Warren C. and Bennett, Judith M. Medieval Europe: A Short History, 9th ed. (McGraw-Hill Companies Inc, Boston, 2002)\n* Skårderud, Finn. Holy anorexia: Catherine of Siena (Tidsskrift for norsk psykologforening, Oslo, 2008)\n\nModern editions and English translations\n\n*The Italian critical edition of the Dialogue is Catherine of Siena, Il Dialogo della divina Provvidenza: ovvero Libro della divina dottrina, 2nd ed., ed. Giuliana Cavallini (Siena: Cantagalli, 1995). [1st edn, 1968] [Cavallini demonstrated that the standard division of the Dialogue in into four treatises entitled the 'Treatise on Discretion', 'On Prayer', 'On Providence', and 'On Obedience', was in fact a result of a misreading of the text in the 1579 edition of the Dialogue. Modern editors and translators, including Noffke (1980), have followed Cavallini in rejecting this fourfold division.]\n*The Italian critical edition of the 26 Prayers is Catherine of Siena, Le Orazioni, ed. Giuliana Cavallini (Rome: Cateriniane, 1978)\n*The most recent Italian critical edition of the Letters is Antonio Volpato, ed, Le lettere di Santa Caterina da Siena: l'edizione di Eugenio Duprè Theseider e i nuovi problemi, (2002)\n\nEnglish translations of The Dialogue include:\n*[https://books.google.com/books?id=bsGXhNZyUSgC The Dialogue], trans. Suzanne Noffke, O.P. Paulist Press (Classics of Western Spirituality), 1980.\n*The Dialogue of St. Catherine of Siena, TAN Books, 2009.  \n*Phyllis Hodgson and Gabriel M Liegey, eds., The Orcherd of Syon, (London; New York: Oxford UP, 1966) [A Middle English translation of the Dialogo from the early fifteenth century, first printed in 1519].\n\nThe Letters are translated into English as:\n* (Republished as The letters of Catherine of Siena, 4 vols, trans Suzanne Noffke, (Tempe, AZ: Arizona Center for Medieval and Renaissance Studies, 2000–2008))\n\nThe Prayers are translated into English as:\n*The Prayers of Catherine of Siena, trans. Suzanne Noffke, 2nd edn 1983, (New York, 2001)\n\nRaymond of Capua's Life was translated into English in 1493 and 1609, and in Modern English is translated as:\n*. Catherine of Siena. http://en.wikipedia.org/?curid=7471."
  }
}
