{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14880",
  "eid" : "18412920-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778549938,
  "textBody" : "The International Criminal Court (ICC or ICCt)International Criminal Court is sometimes abbreviated as ICCt to distinguish it from several other organisations abbreviated as ICC. However the more common abbreviation ICC is used in this article. is an intergovernmental organization and international tribunal that sits in The Hague in the Netherlands. The ICC has the jurisdiction to prosecute individuals for the international crimes of genocide, crimes against humanity, and war crimes. The ICC is intended to complement existing national judicial systems and it may therefore only exercise its jurisdiction when certain conditions are met, such as when national courts are unwilling or unable to prosecute criminals or when the United Nations Security Council or individual states refer situations to the Court. The ICC began functioning on 1 July 2002, the date that the Rome Statute entered into force. The Rome Statute is a multilateral treaty which serves as the ICC's foundational and governing document. States which become party to the Rome Statute, for example by ratifying it, become member states of the ICC. Currently, there are 123 states which are party to the Rome Statute and therefore members of the ICC.\n\nThe ICC has four principal organs: the Presidency, the Judicial Divisions, the Office of the Prosecutor, and the Registry. The President is the most senior judge chosen by his or her peers in the Judicial Division, which hears cases before the Court. The Office of the Prosecutor is headed by the Prosecutor who investigates crimes and initiates proceedings before the Judicial Division. The Registry is headed by the Registrar and is charged with managing all the administrative functions of the ICC, including the headquarters, detention unit, and public defense office.\n\nThe Office of the Prosecutor has opened ten official investigations and is also conducting an additional eleven preliminary examinations. Thus far, 39 individuals have been indicted in the ICC, including Ugandan rebel leader Joseph Kony, Sudanese president Omar al-Bashir, Kenyan president Uhuru Kenyatta, Libyan leader Muammar Gaddafi, Ivorian president Laurent Gbagbo, and Congolese vice-president Jean-Pierre Bemba.\n\nHistory \n\nThe establishment of an international tribunal to judge political leaders accused of international crimes was first proposed during the Paris Peace Conference in 1919 following the First World War by the Commission of Responsibilities. The issue was addressed again at a conference held in Geneva under the auspices of the League of Nations in 1937, which resulted in the conclusion of the first convention stipulating the establishment of a permanent international court to try acts of international terrorism. The convention was signed by 13 states, but none ratified it and the convention never entered into force.\n\nFollowing the Second World War, the allied powers established two ad hoc tribunals to prosecute axis power leaders accused of war crimes. The International Military Tribunal, which sat in Nuremberg, prosecuted German leaders while the International Military Tribunal for the Far East in Tokyo prosecuted Japanese leaders. In 1948 the United Nations General Assembly first recognised the need for a permanent international court to deal with atrocities of the kind prosecuted after the Second World War.United Nations Department of Public Information, December 2002. [https://www.un.org/News/facts/iccfact.htm The International Criminal Court] . Retrieved 5 December 2006. At the request of the General Assembly, the International Law Commission (ILC) drafted two statutes by the early 1950s but these were shelved during the Cold War, which made the establishment of an international criminal court politically unrealistic.Dempsey, Gary T. (16 July 1998). [http://www.cato.org/pubs/pas/pa-311es.html \"Reasonable Doubt: The Case Against the Proposed International Criminal Court\"]. Cato Institute. Retrieved 31 December 2006.\n\nBenjamin B. Ferencz, an investigator of Nazi war crimes after the Second World War, and the Chief Prosecutor for the United States Army at the Einsatzgruppen Trial, became a vocal advocate of the establishment of international rule of law and of an international criminal court. In his first book published in 1975, entitled Defining International Aggression: The Search for World Peace, he advocated for the establishment of such a court. A second major advocate was Robert Kurt Woetzel, who co-edited Toward a Feasible International Criminal Court in 1970 and created the Foundation for the Establishment of an International Criminal Court in 1971.\n\nIn June 1989 Prime Minister of Trinidad and Tobago A. N. R. Robinson revived the idea of a permanent international criminal court by proposing the creation of such a court to deal with the illegal drug trade.International Criminal Court (20 June 2006). . Retrieved 3 May 2007. Following Trinidad and Tobago's proposal, the General Assembly tasked the ILC with once again drafting a statute for a permanent court.[http://www.iccnow.org/?mod\nicchistory \"History of the ICC\"]. Retrieved 4 June 2012. While work began on the draft, the United Nations Security Council established two ad hoc tribunals in the early 1990s. The International Criminal Tribunal for the former Yugoslavia was created in 1993 in response to large-scale atrocities committed by armed forces during Yugoslav Wars, and the International Criminal Tribunal for Rwanda was created in 1994 following the Rwandan Genocide. The creation of these tribunals further highlighted the need for a permanent international criminal court.Coalition for the International Criminal Court. [http://www.iccnow.org/?mod=icchistory \"History of the ICC\"]. Retrieved 31 December 2006.\n\nIn 1994, the ILC presented its final draft statute for the International Criminal Court to the General Assembly and recommended that a conference be convened to negotiate a treaty that would serve as the Court's statute.[http://legal.un.org/ilc/texts/instruments/english/draft%20articles/7_4_1994.pdf \"Draft Statute for an International Criminal Court, 1994\"]. Retrieved 4 June 2012. To consider major substantive issues in the draft statute, the General Assembly established the Ad Hoc Committee on the Establishment of an International Criminal Court, which met twice in 1995. After considering the Committee's report, the General Assembly created the Preparatory Committee on the Establishment of the ICC to prepare a consolidated draft text. From 1996 to 1998, six sessions of the Preparatory Committee were held at the United Nations headquarters in New York City, during which NGOs provided input and attended meetings under the umbrella organisation of the Coalition for an ICC (CICC). In January 1998, the Bureau and coordinators of the Preparatory Committee convened for an Inter-Sessional meeting in Zutphen in the Netherlands to technically consolidate and restructure the draft articles into a draft.\n\nFinally the General Assembly convened a conference in Rome in June 1998, with the aim of finalizing the treaty to serve as the Court's statute. On 17 July 1998, the Rome Statute of the International Criminal Court was adopted by a vote of 120 to 7, with 21 countries abstaining. The seven countries that voted against the treaty were China, Iraq, Israel, Libya, Qatar, the United States, and Yemen.Scharf, Michael P. (August 1998). [http://www.asil.org/insights/insigh23.htm \"Results of the Rome Conference for an International Criminal Court\"]. American Society of International Law. Retrieved 4 December 2006. Following 60 ratifications, the Rome Statute entered into force on 1 July 2002 and the International Criminal Court was formally established.Amnesty International (11 April 2002). [https://www.amnesty.org/en/library/info/IOR40/008/2002 \"The International Criminal Court – A Historic Development in the Fight for Justice\"]. Retrieved 20 March 2008. The first bench of 18 judges was elected by the Assembly of States Parties in February 2003. They were sworn in at the inaugural session of the Court on 11 March 2003.Coalition for the International Criminal Court. [http://www2.icc-cpi.int/Menus/ICC/Press+and+Media/Press+Releases/2005/Warrant+of+Arrest+unsealed+against+five+LRA+Commanders.htm \"Judges and the Presidency\"]. [https://www.webcitation.org/6CnQbflxv?url\nhttp://www2.icc-cpi.int/Menus/ICC/Press%2Band%2BMedia/Press%2BReleases/2005/Warrant%2Bof%2BArrest%2Bunsealed%2Bagainst%2Bfive%2BLRA%2BCommanders.htm Archived] from the original on 9 December 2012. Retrieved 9 December 2012.\n\nThe Court issued its first arrest warrants on 8 July 2005,International Criminal Court (14 October 2005). [http://www.icc-cpi.int/en_menus/icc/situations%20and%20cases/situations/situation%20icc%200204/related%20cases/icc%200204%200105/press%20releases/Pages/warrant%20of%20arrest%20unsealed%20against%20five%20lra%20commanders.aspx \"Warrant of Arrest Unsealed Against Five LRA Commanders\"]. Retrieved 30 September 2014. and the first pre-trial hearings were held in 2006.International Criminal Court (9 November 2006). . Retrieved 5 December 2006. The Court issued its first judgment in 2012 when it found Congolese rebel leader Thomas Lubanga Dyilo guilty of war crimes related to using child soldiers.\n\nIn 2010 the states parties of the Rome Statute held the first Review Conference of the Rome Statute of the International Criminal Court in Kampala, Uganda. There they adopted two amendments to the Statute. The second amendment defined the crime of aggression and outlined the procedure by which the ICC could prosecute individuals. However, the conditions outlined in the amendment have not yet been met and the ICC can not yet exercise jurisdiction over crimes of aggression.\n\nIn October 2016, after repeated claims that the court was biased against African states, Burundi, South Africa and the Gambia announced their withdrawals from the Rome Statute. However, following Gambia's presidential election later that year, which ended the long rule of Yahya Jammeh, Gambia rescinded its withdrawal notification.Moore, Jina (27 October 2017). \"[https://www.nytimes.com/2017/10/27/world/africa/burundi-international-criminal-court.html Burundi Quits International Criminal Court]\". New York Times. nytimes.com. Retrieved 27 October 2017. Subsequent to a ruling of the High Court of South Africa, in early 2017, that the country's withdrawal would be unconstitutional, the  South African government informed the United Nations, on 7 March 2017, that it was revoking its decision to withdraw.Onishi, Norimitsu (8 March 2017). \"[https://www.nytimes.com/2017/03/08/world/africa/south-africa-icc-withdrawal.html South Africa Reverses Withdrawal From International Criminal Court]\". New York Times. nytimes.com. Retrieved 27 October 2017.\n\nExperts believe that Kenya, Namibia, and Uganda may soon follow in withdrawing from the court, while South Africa is still committed to withdrawing, leading to a mass African exodus.\n\nStructure\n\nThe ICC is governed by an Assembly of States Parties, which is made up of the states which are party to the Rome Statute.International Criminal Court. . Retrieved 2 January 2008. The Assembly elects officials of the Court, approves its budget, and adopts amendments to the Rome Statute. The Court itself, however, is composed of four organs: the Presidency, the Judicial Divisions, the Office of the Prosecutor, and the Registry.International Criminal Court. [http://www.icc-cpi.int/Menus/ICC/Structure+of+the+Court/ Structure of the Court], ICC website. Retrieved 16 June 2012\n\nState parties\n\nAssembly of States Parties\n\nThe Court's management oversight and legislative body, the Assembly of States Parties, consists of one representative from each state party.Article 112 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013. Each state party has one vote and \"every effort\" has to be made to reach decisions by consensus. If consensus cannot be reached, decisions are made by vote. The Assembly is presided over by a president and two vice-presidents, who are elected by the members to three-year terms.\n\nThe Assembly meets in full session once a year, alternating between New York and The Hague, and may also hold special sessions where circumstances require. Sessions are open to observer states and non-governmental organizations.Amnesty International, 11 November 2007. [https://www.amnesty.org/en/international-justice/issues/international-criminal-court/assembly-states-parties Assembly of States Parties of the International Criminal Court]. Retrieved 2 January 2008.\n\nThe Assembly elects the judges and prosecutors, decides the Court's budget, adopts important texts (such as the [http://www.icc-cpi.int/Menus/ICC/Legal+Texts+and+Tools/Official+Journal/Rules+of+Procedure+and+Evidence.htm Rules of Procedure and Evidence]), and provides management oversight to the other organs of the Court. Article 46 of the Rome Statute allows the Assembly to remove from office a judge or prosecutor who \"is found to have committed serious misconduct or a serious breach of his or her duties\" or \"is unable to exercise the functions required by this Statute\".Article 46 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013.\n\nThe states parties cannot interfere with the judicial functions of the Court.Coalition for the International Criminal Court. [http://www.iccnow.org/?mod\nasp Assembly of States Parties]. Retrieved 2 January 2008. Disputes concerning individual cases are settled by the Judicial Divisions.\n\nIn 2010, Kampala, Uganda hosted the Assembly's Rome Statute Review Conference.\n\nOrgans of the Court \n\nThe Court has four organs: the Presidency, the Judicial Division, the Office of the Prosecutor, and the Registry.\n\nPresidency\n\nThe Presidency is responsible for the proper administration of the Court (apart from the Office of the Prosecutor).[http://www.icc-cpi.int/en_menus/icc/structure%20of%20the%20court/presidency/Pages/the%20presidency.aspx The Presidency]. It comprises the President and the First and Second Vice-Presidents—three judges of the Court who are elected to the Presidency by their fellow judges for a maximum of two three-year terms.Article 38 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 18 October 2013. The current (and first female) president is Silvia Fernández de Gurmendi, who was elected on 11 March 2015.[http://www.icc-cpi.int/en_menus/icc/press%20and%20media/press%20releases/Pages/pr1096.aspx  Judge Fernández de Gurmendi elected ICC President for 2015-2018; Judges Aluoch and Ozaki elected First and Second Vice-President respectively]. ICC press release. 11 March 2015. Retrieved 28 March 2015.\n\nJudicial Divisions\n\nThe Judicial Divisions consist of the 18 judges of the Court, organized into three chambers—the Pre-Trial Chamber, Trial Chamber and Appeals Chamber—which carry out the judicial functions of the Court.International Criminal Court. . Retrieved 21 July 2007. Judges are elected to the Court by the Assembly of States Parties. They serve nine-year terms and are not generally eligible for re-election. All judges must be nationals of states parties to the Rome Statute, and no two judges may be nationals of the same state.Article 36 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013. They must be \"persons of high moral character, impartiality and integrity who possess the qualifications required in their respective States for appointment to the highest judicial offices\".\n\nThe Prosecutor or any person being investigated or prosecuted may request the disqualification of a judge from \"any case in which his or her impartiality might reasonably be doubted on any ground\".Article 41 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 18 October 2013. Any request for the disqualification of a judge from a particular case is decided by an absolute majority of the other judges. A judge may be removed from office if he or she \"is found to have committed serious misconduct or a serious breach of his or her duties\" or is unable to exercise his or her functions. The removal of a judge requires both a two-thirds majority of the other judges and a two-thirds majority of the states parties.\n\nOffice of the Prosecutor\n\nThe Office of the Prosecutor (OTP) is responsible for conducting investigations and prosecutions.International Criminal Court. . Retrieved 21 July 2007. It is headed by the Chief Prosecutor, who is assisted by one or more Deputy Prosecutors. The Rome Statute provides that the Office of the Prosecutor shall act independently;Article 42 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013. as such, no member of the Office may seek or act on instructions from any external source, such as states, international organisations, non-governmental organisations or individuals.\n\nThe Prosecutor may open an investigation under three circumstances:\n*when a situation is referred to him or her by a state party;\n*when a situation is referred to him or her by the United Nations Security Council, acting to address a threat to international peace and security; or\n*when the Pre-Trial Chamber authorises him or her to open an investigation on the basis of information received from other sources, such as individuals or non-governmental organisations.\n\nAny person being investigated or prosecuted may request the disqualification of a prosecutor from any case \"in which their impartiality might reasonably be doubted on any ground\". Requests for the disqualification of prosecutors are decided by the Appeals Chamber. A prosecutor may be removed from office by an absolute majority of the states parties if he or she \"is found to have committed serious misconduct or a serious breach of his or her duties\" or is unable to exercise his or her functions. However, critics of the Court argue that there are \"insufficient checks and balances on the authority of the ICC prosecutor and judges\" and \"insufficient protection against politicized prosecutions or other abuses\".US Department of State, 30 July 2003. . Retrieved 31 December 2006. Henry Kissinger says the checks and balances are so weak that the prosecutor \"has virtually unlimited discretion in practice\".Henry A. Kissinger. \"The Pitfalls of Universal Jurisdiction\". Foreign Affairs, July/August 2001, p. 95. Retrieved 31 December 2006. Some efforts have been made to hold Kissinger himself responsible for perceived injustices of American foreign policy during his tenure in government.[http://www.smh.com.au/articles/2002/04/29/1019441343996.html \"Why the law wants a word with Kissinger\"], Fairfax Digital, 30 April 2002\n\nAs of 16 June 2012, the Prosecutor has been Fatou Bensouda of Gambia, who had been elected as the new Prosecutor on 12 December 2011.[http://www.icc-cpi.int/NR/exeres/0E0A4EE7-6C79-4FA1-85CB-4752DEEC1488.htm The Assembly of States Parties to the Rome Statute opens its tenth session]. ICC. 14 December 2011. Retrieved 14 December 2011. She has been elected for nine years. Her predecessor, Luis Moreno Ocampo of Argentina, had been in office from 2003 to 2012.\n\nPolicy Paper\n\nA Policy Paper is a document published by the Office of the Prosecutor occasionally where the particular considerations given to the topics in focus of the Office and often criteria for case selection are stated. While a policy paper does not give the Court jurisdiction over a new category of crimes, it promises what the Office of Prosecutor will consider when selecting cases in the upcoming term of service. OTP's policy papers are subject to revision.\n The five following Policy Papers have been published since the start of the ICC:\n*1 September 2007: Policy Paper on the Interest of Justice\n*12 April 2010: Policy Paper on Victims' Participation\n*1 November 2013: Policy Paper on Preliminary Examinations\n*20 June 2014: Policy Paper on Sexual and Gender-Based Crimes\n*15 September 2016: Policy paper on case selection and prioritisation\n\nEnvironmental crimes\n\nOn the Policy Paper published in September 2016 it was announced that the International Criminal Court will focus on environmental crimes when selecting the cases. According to this document, the Office will give particular consideration to prosecuting Rome Statute crimes that are committed by means of, or that result in, \"inter alia, the destruction of the environment, the illegal exploitation of natural resources or the illegal dispossession of land\".\n\nThis has been interpreted as a major shift towards the environmental crimes and a move with significant effects.\n\nRegistry\n\nThe Registry is responsible for the non-judicial aspects of the administration and servicing of the Court.International Criminal Court. [http://www.icc-cpi.int/Menus/Go?id\n6a4167ac-ca17-403d-928b-b2c36bb85ab4&lanen-GB.html The Registry]. Retrieved 21 July 2007. This includes, among other things, \"the administration of legal aid matters, court management, victims and witnesses matters, defence counsel, detention unit, and the traditional services provided by administrations in international organisations, such as finance, translation, building management, procurement and personnel\". The Registry is headed by the Registrar, who is elected by the judges to a five-year term. The current Registrar is Herman von Hebel, who was elected on 8 March 2013.\n\nJurisdiction and admissibility \n\nThe Rome Statute requires that several criteria exist in a particular case before an individual can be prosecuted by the Court. The Statute contains three jurisdictional requirements and three admissibility requirements. All criteria must be met for a case to proceed.\n\nJurisdiction \n\nThere are three jurisdictional requirements in the Rome Statute that must be met before a case may begin against an individual. The requirements are (1) subject-matter jurisdiction (what acts constitute crimes), (2) territorial or personal jurisdiction (where the crimes were committed or who committed them), and (3) temporal jurisdiction (when the crimes were committed).\n\nSubject-matter jurisdiction \n\nThe Court's subject-matter jurisdiction means the crimes for which individuals can be prosecuted. Individuals can only be prosecuted for crimes that are listed in the Statute. The primary crimes are listed in article 5 of the Statute and defined in later articles: genocide (defined in article 6), crimes against humanity (defined in article 7), war crimes (defined in article 8), and crimes of aggression (defined in article 8 bis) (which is not yet within the jurisdiction of the Court; see below).Rome Statute, Article 5. In addition, article 70 defines offences against the administration of justice, which are also crimes for which individuals can be prosecuted.\n\nGenocide \n\nArticle 6 defines the crime of genocide as \"acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group\".Rome Statute, Article 6. There are five such acts which constitute crimes of genocide under article 6:Rome Statute, Articles 6(a)–6(e).\n# Killing members of a group\n# Causing serious bodily or mental harm to members of the group\n# Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction\n# Imposing measures intended to prevent births within the group\n# Forcibly transferring children of the group to another group\nThe definition of these crimes is identical to those contained within the Convention on the Prevention and Punishment of the Crime of Genocide of 1948.\n\nCrimes against humanity \n\nArticle 7 defines crimes against humanity as acts \"committed as part of a widespread or systematic attack directed against any civilian population, with knowledge of the attack\".Rome Statute, Article 7. The article lists 16 such as individual crimes:\n# Murder\n# Extermination\n# Enslavement\n# Deportation or forcible transfer of population\n# Imprisonment or other severe deprivation of physical liberty\n# Torture\n# Rape\n# Sexual slavery\n# Enforced prostitution\n# Forced pregnancy\n# Enforced sterilization\n# Sexual violence\n# Persecution\n# Enforced disappearance of persons\n# Apartheid\n# Other inhumane acts\n\nWar crimes \n\nArticle 8 defines war crimes depending on whether an armed conflict is either international (which generally means it is fought between states) or non-international (which generally means that it is fought between non-state actors, such as rebel groups, or between a state and such non-state actors). In total there are 74 war crimes listed in article 8. The most serious crimes, however, are those that constitute either grave breaches of the Geneva Conventions of 1949, which only apply to international conflicts, and serious violations of article 3 common to the Geneva Conventions of 1949, which apply to non-international conflicts.Rome Statute, Article 8(2)(c).\n\nThere are 11 crimes which constitute grave breaches of the Geneva Conventions and which are applicable only to international armed conflicts:\n# Willful killing\n# Torture\n# Inhumane treatment\n# Biological experiments\n# Willfully causing great suffering\n# Destruction and appropriation of property\n# Compelling service in hostile forces\n# Denying a fair trial\n# Unlawful deportation and transfer\n# Unlawful confinement\n# Taking hostages\n\nThere are seven crimes which constitute serious violations of article 3 common to the Geneva Conventions and which are applicable only to non-international armed conflicts:\n# Murder\n# Mutilation\n# Cruel treatment\n# Torture\n# Outrages upon personal dignity\n# Taking hostages\n# Sentencing or execution without due process\n\nAdditionally, there are 56 other crimes defined by article 8: 35 that apply to international armed conflicts and 21 that apply to non-international armed conflicts. Such crimes include attacking civilians or civilian objects, attacking peacekeepers, causing excessive incidental death or damage, transferring populations into occupied territories, treacherously killing or wounding, denying quarter, pillaging, employing poison, using expanding bullets, rape and other forms of sexual violence, and conscripting or using child soldiers.Rome Statute, Article 8.\n\nCrimes of aggression \n\nArticle 8 bis defines crimes of aggression; however, the Court is not yet able to prosecute individuals for these crimes. The Statute originally provided that the Court could not exercise its jurisdiction over the crime of aggression until such time as the states parties agreed on a definition of the crime and set out the conditions under which it could be prosecuted.Article 5 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 20 March 2008. Such an amendment was adopted at the first review conference of the ICC in Kampala, Uganda, in June 2010. However, this amendment specified that the ICC would not be allowed to exercise jurisdiction of the crime of aggression until two further conditions had been satisfied: (1) the amendment has entered into force for 30 states parties and (2) on or after 1 January 2017, the Assembly of States Parties has voted in favor of allowing the Court to exercise jurisdiction.\n\nThe Statute, as amended, defines the crime of aggression as \"the planning, preparation, initiation or execution, by a person in a position effectively to exercise control over or to direct the political or military action of a State, of an act of aggression which, by its character, gravity and scale, constitutes a manifest violation of the Charter of the United Nations.\"Rome Statute, Article 8 bis(1). The Statute defines an \"act of aggression\" as \"the use of armed force by a State against the sovereignty, territorial integrity or political independence of another State, or in any other manner inconsistent with the Charter of the United Nations.\"Rome Statute, Article 8 bis(2). The article also contains a list of seven acts of aggression, which are identical to those in United Nations General Assembly Resolution 3314 of 1974 and include the following acts when committed by one state against another state:Rome Statute, Articles 8 bis(2)(a)–8 bis(2)(g).\n\n# Invasion or attack by armed forces against territory\n# Military occupation of territory\n# Annexation of territory\n# Bombardment against territory\n# Use of any weapons against territory\n# Blockade of ports or coasts\n# Attack on the land, sea, or air forces or marine and air fleets\n# The use of armed forces which are within the territory of another state by agreement, but in contravention of the conditions of the agreement\n# Allowing territory to be used by another state to perpetrate an act of aggression against a third state\n# Sending armed bands, groups, irregulars, or mercenaries to carry out acts of armed force\n\nOffences against the administration of justice \n\nArticle 70 criminalizes certain intentional acts which interfere with investigations and proceedings before the Court, including giving false testimony, presenting false evidence, corruptly influencing a witness or official of the Court, retaliating against an official of the Court, and soliciting or accepting bribes as an official of the Court.Rome Statute, Article 70.\n\nTerritorial or personal jurisdiction \n\nFor an individual to be prosecuted by the Court either territorial jurisdiction or personal jurisdiction must exist. Therefore, an individual can only be prosecuted if he or she has either (1) committed a crime within the territorial jurisdiction of the Court or (2) committed a crime while a national of a state that is within the territorial jurisdiction of the Court.\n\nTerritorial jurisdiction \n\nThe territorial jurisdiction of the Court includes the territory, registered vessels, and registered aircraft of states which have either (1) become party to the Rome Statute or (2) accepted the Court's jurisdiction by filing a declaration with the Court.Rome Statute, Article 12.\n\nIn situations that are referred to the Court by the United Nations Security Council, the territorial jurisdiction is defined by the Security Council, which may be more expansive than the Court's normal territorial jurisdiction.Rome Statute, Article 13(b). For example, if the Security Council refers a situation that took place in the territory of a state that has both not become party to the Rome Statute and not lodged a declaration with the Court, the Court will still be able to prosecute crimes that occurred within that state.\n\nPersonal jurisdiction \n\nThe personal jurisdiction of the Court extends to all natural persons who commit crimes, regardless of where they are located or where the crimes were committed, as long as those individuals are nationals of either (1) states that are party to the Rome Statute or (2) states that have accepted the Court's jurisdiction by filing a declaration with the Court. As with territorial jurisdiction, the personal jurisdiction can be expanded by the Security Council if it refers a situation to the Court.\n\nTemporal jurisdiction \n\nTemporal jurisdiction is the time period over which the Court can exercise its powers. No statute of limitations applies to any of the crimes defined in the Statute.Rome Statute, Article 29. However, the Court's jurisdiction is not completely retroactive. Individuals can only be prosecuted for crimes that took place on or after 1 July 2002, which is the date that the Rome Statute entered into force.Rome Statute, Article 11(1). However, if a state became party to the Statute, and therefore a member of the Court, after 1 July 2002, then the Court cannot exercise jurisdiction prior to that date for certain cases.Rome Statute, Article 11(2). For example, if the Statute entered into force for a state on 1 January 2003, the Court could only exercise temporal jurisdiction over crimes that took place in that state or were committed by a national of that state on or after 1 January 2003.\n\nAdmissibility \n\nTo initiate an investigation, the Prosecutor must (1) have a \"reasonable basis to believe that a crime within the jurisdiction of the Court has been or is being committed\", (2) the investigation would be consistent with the principle of complementarity, and (3) the investigation serves the interests of justice.Rome Statute, Article 53(1).\n\nComplementarity \n\nThe principle of complementarity means that the Court will only prosecute an individual if states are unwilling or unable to prosecute. Therefore, if legitimate national investigations or proceedings into crimes have taken place or are ongoing, the Court will not initiate proceedings. This principle applies regardless of the outcome of national proceedings.Rome Statute, Articles 17(a)–17(c). Even if an investigation is closed without any criminal charges being filed or if an accused person is acquitted by a national court, the Court will not prosecute an individual for the crime in question so long as it is satisfied that the national proceedings were legitimate. However the actual application of the complementarity principle has recently come under theoretical scrutiny.\n\nGravity \n\nThe Court will only initiate proceedings if a crime is of \"sufficient gravity to justify further action by the Court\".Rome Statute, Articles 17(d).\n\nInterests of justice \n\nThe Prosecutor will initiate an investigation unless there are \"substantial reasons to believe that an investigation would not serve the interests of justice\" when \"[t]aking into account the gravity of the crime and the interests of victims\".Rome Statute, Article 53(1)(c). Furthermore, even if an investigation has been initiated and there are substantial facts to warrant a prosecution and no other admissibility issues, the Prosecutor must determine whether a prosecution would serve the interests of justice \"taking into account all the circumstances, including the gravity of the crime, the interests of victims and the age or infirmity of the alleged perpetrator, and his or her role in the alleged crime\".Rome Statute, Article 53(2)(c).\n\nProcedure\n\nTrial\n\nTrials are conducted under a hybrid common law and civil law judicial system, but it has been argued the procedural orientation and character of the court is still evolving. A majority of the three judges present, as triers of fact, may reach a decision, which must include a full and reasoned statement. Trials are supposed to be public, but proceedings are often closed, and such exceptions to a public trial have not been enumerated in detail. In camera proceedings are allowed for protection of witnesses or defendants as well as for confidential or sensitive evidence. Hearsay and other indirect evidence is not generally prohibited, but it has been argued the court is guided by hearsay exceptions which are prominent in common law systems. There is no subpoena or other means to compel witnesses to come before the court, although the court has some power to compel testimony of those who chose to come before it, such as fines.\n\nRights of the accused\n\nThe Rome Statute provides that all persons are presumed innocent until proven guilty beyond reasonable doubt,Article 66 of the [Rome Statute]. Retrieved 18 October 2013. and establishes certain rights of the accused and persons during investigations.The rights of persons during an investigation are provided in Article 55. Rights of the accused are provided in Part 6, especially Article 67. See also Amnesty International, 1 August 2000. [https://www.amnesty.org/en/library/info/IOR40/009/2000 The International Criminal Court: Fact sheet 9 – Fair trial guarantees]. Retrieved 20 March 2008. These include the right to be fully informed of the charges against him or her; the right to have a lawyer appointed, free of charge; the right to a speedy trial; and the right to examine the witnesses against him or her.\n\nTo ensure \"equality of arms\" between defence and prosecution teams, the ICC has established an independent Office of Public Counsel for the Defence (OPCD) to provide logistical support, advice and information to defendants and their counsel.Katy Glassborow (21 August 2006). . Global Policy Forum. Retrieved 3 May 2007.International Criminal Court. . Retrieved 3 May 2007. The OPCD also helps to safeguard the rights of the accused during the initial stages of an investigation.International Criminal Court, 2005. [http://www.derechos.org/nizkor/icc/iccreport.html Report of the International Criminal Court for 2004]. Retrieved 3 May 2007. However, Thomas Lubanga's defence team say they were given a smaller budget than the Prosecutor and that evidence and witness statements were slow to arrive.Stephanie Hanson (17 November 2006). [http://www.cfr.org/publication/12048/ Africa and the International Criminal Court]. Council on Foreign Relations. Retrieved 23 November 2006.\n\nVictim participation\n\nOne of the great innovations of the Statute of the International Criminal Court and its Rules of Procedure and Evidence is the series of rights granted to victims.International Criminal Court. . Accessed 22 June 2007.Ilaria Bottigliero (April 2003). [http://www.sgiquarterly.org/english/Features/quarterly/0304/perspective.htm \"The International Criminal Court – Hope for the Victims\"]. 32 SGI Quarterly. pp. 13–15. Accessed 24 July 2007. For the first time in the history of international criminal justice, victims have the possibility under the Statute to present their views and observations before the Court.\n\nParticipation before the Court may occur at various stages of proceedings and may take different forms, although it will be up to the judges to give directions as to the timing and manner of participation.\n\nParticipation in the Court's proceedings will in most cases take place through a legal representative and will be conducted \"in a manner which is not prejudicial or inconsistent with the rights of the accused and a fair and impartial trial\".\n\nThe victim-based provisions within the Rome Statute provide victims with the opportunity to have their voices heard and to obtain, where appropriate, some form of reparation for their suffering. It is the aim of this attempted balance between retributive and restorative justice that, it is hoped, will enable the ICC to not only bring criminals to justice but also help the victims themselves obtain some form of justice. Justice for victims before the ICC comprises both procedural and substantive justice, by allowing them to participate and present their views and interests, so that they can help to shape truth, justice and reparations outcomes of the Court.\n\nArticle 43(6) establishes a Victims and Witnesses Unit to provide \"protective measures and security arrangements, counseling and other appropriate assistance for witnesses, victims who appear before the Court, and others who are at risk on account of testimony given by such witnesses.\"Article 43(6) of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 18 October 2013. Article 68 sets out procedures for the \"Protection of the victims and witnesses and their participation in the proceedings.\"Article 68 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 18 October 2013. The Court has also established an Office of Public Counsel for Victims, to provide support and assistance to victims and their legal representatives.International Criminal Court, 17 October 2006.  . Accessed 18 June 2007.\n\nThe ICC does not have its own witness protection program, but rather must rely on national programs to keep witnesses safe.\n\nReparations \n\nVictims before the International Criminal Court can also claim reparations under Article 75 of the Rome Statute. Reparations can only be claimed when a defendant is convicted and at the discretion of the Court's judges. So far the Court has ordered reparations against Thomas Lubanga. Reparations can include compensation, restitution and rehabilitation, but other forms of reparations may be appropriate for individual, collective or community victims. Article 79 of the Rome Statute establishes a Trust Fund to provide assistance before a reparation order to victims in a situation or to support reparations to victims and their families if the convicted person has no money.International Criminal Court. . Accessed 22 June 2007.\n\nCo-operation by states not party to Rome Statute\n\nOne of the principles of international law is that a treaty does not create either obligations or rights for third states without their consent (pacta tertiis nec nocent nec prosunt), and this is also enshrined in the 1969 Vienna Convention on the Law of Treaties. The co-operation of the non-party states with the ICC is envisioned by the Rome Statute of the International Criminal Court to be of voluntary nature.Article 87 (5)(a) of the Rome Statute. Retrieved 30 October 2008. However, even states that have not acceded to the Rome Statute might still be subjects to an obligation to co-operate with ICC in certain cases. When a case is referred to the ICC by the UN Security Council all UN member states are obliged to co-operate, since its decisions are binding for all of them.Article 25 of the [https://www.un.org/aboutun/charter/ UN Charter] . Retrieved 30 October 2008. Also, there is an obligation to respect and ensure respect for international humanitarian law, which stems from the Geneva Conventions and Additional Protocol I,Article 89 of [http://www.icrc.org/ihl.nsf/7c4d08d9b287a42141256739003e636b/f6c8b9fee14a77fdc125641e0052b079 Additional Protocol I] from 1977. Accessed on 30 October 2008. which reflects the absolute nature of IHL.Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. the United States of America), Merits, Judgment, ICJ Reports 1986, p. 114, para. 220. Although the wording of the Conventions might not be precise as to what steps have to be taken, it has been argued that it at least requires non-party states to make an effort not to block actions of ICC in response to serious violations of those Conventions.\n\nIn relation to co-operation in investigation and evidence gathering, it is implied from the Rome StatuteArticle 99 of the Rome Statute. Retrieved 30 October 2008. that the consent of a non-party state is a prerequisite for ICC Prosecutor to conduct an investigation within its territory, and it seems that it is even more necessary for him to observe any reasonable conditions raised by that state, since such restrictions exist for states party to the Statute. Taking into account the experience of the ICTY (which worked with the principle of the primacy, instead of complementarity) in relation to co-operation, some scholars have expressed their pessimism as to the possibility of ICC to obtain co-operation of non-party states. As for the actions that ICC can take towards non-party states that do not co-operate, the Rome Statute stipulates that the Court may inform the Assembly of States Parties or Security Council, when the matter was referred by it, when non-party state refuses to co-operate after it has entered into an ad hoc arrangement or an agreement with the Court.Article 87(5) of the Rome Statute. Accessed on 30 October 2008.\n\nAmnesties and national reconciliation processes\n\nIt is unclear to what extent the ICC is compatible with reconciliation processes that grant amnesty to human rights abusers as part of agreements to end conflict.Anthony Dworkin (December 2003). [http://www.crimesofwar.org/icc_magazine/icc-intro.html \"Introduction\"] in The International Criminal Court: An End to Impunity?  Crimes of War Project. Accessed 18 September 2007. Article 16 of the Rome Statute allows the Security Council to prevent the Court from investigating or prosecuting a case, and Article 53 allows the Prosecutor the discretion not to initiate an investigation if he or she believes that \"an investigation would not serve the interests of justice\".Article 53 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 20 March 2008. Former ICC president Philippe Kirsch has said that \"some limited amnesties may be compatible\" with a country's obligations genuinely to investigate or prosecute under the Statute.\n\nIt is sometimes argued that amnesties are necessary to allow the peaceful transfer of power from abusive regimes. By denying states the right to offer amnesty to human rights abusers, the International Criminal Court may make it more difficult to negotiate an end to conflict and a transition to democracy. For example, the outstanding arrest warrants for four leaders of the Lord's Resistance Army are regarded by some as an obstacle to ending the insurgency in Uganda.Tim Cocks (30 May 2007). .  Reuters. Accessed 31 May 2007.Alasdair Palmer (14 January 2007). [http://www.telegraph.co.uk/opinion/main.jhtml?xml=/opinion/2007/01/14/do1409.xml \"When Victims Want Peace, Not Justice\"].  The Sunday Telegraph. Accessed 15 January 2007. Czech politician Marek Benda argues that \"the ICC as a deterrent will in our view only mean the worst dictators will try to retain power at all costs\".Alena Skodova (12 April 2002). [http://www.radio.cz/en/article/26826 \"Czech Parliament Against Ratifying International Criminal Court\"]. Radio Prague. Accessed 11 January 2007. However, the United NationsSee, for example, Kofi Annan (4 October 2000). [http://www.afrol.com/Countries/Sierra_Leone/documents/un_sil_court_041000.htm Report of the Secretary-General on the Establishment of a Special Court for Sierra Leone], para. 22. Accessed 31 December 2006. and the International Committee of the Red CrossJean-Marie Henckaerts & Louise Doswald-Beck, 2005. Customary International Humanitarian Law, Volume I: Rules, pp. 613–614. Cambridge: Cambridge University Press. . maintain that granting amnesty to those accused of war crimes and other serious crimes is a violation of international law.\n\nFacilities\n\nHeadquarters \n\nThe official seat of the Court is in The Hague, Netherlands, but its proceedings may take place anywhere.Article 3 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013.The legal relationship between the ICC and the Netherlands is governed by a headquarters agreement, which entered into force on 1 March 2008. (See International Criminal Court, 2008: . Retrieved 1 June 2008.)\n\nThe Court moved into its first permanent premises in The Hague, located at Oude Waalsdorperweg 10, on 14 December 2015. Part of The Hague's International Zone, which also contains the Peace Palace, Europol, ICTY, OPCW and The Hague World Forum, the court facilities are situated on the site of the Alexanderkazerne, a former military barracks, adjacent to the dune landscape on the northern edge of the city. The ICC's detention centre is a short distance away.\n\nDevelopment \n\nThe land and financing for the new construction were provided by the Netherlands.\n In addition, the host state organised and financed the architectural design competition which started at the end of 2008.\n\nThree architects were chosen by an international jury from a total of 171 applicants to enter into further negotiations. The Danish firm schmidt hammer lassen were ultimately selected to design the new premises since its design met all the ICC criteria, such as design quality, sustainability, functionality and costs.http://www.icc-cpi.int/menus/icc/press%20and%20media/press%20releases/press%20releases%20%282010%29/pr502\n\nDemolition of the barracks started in November 2011 and was completed in August 2012. In October 2012 the tendering procedure for the General Contractor was completed and the combination Visser & Smit Bouw and Boele & van Eesteren (“Courtys”) was selected.\n\nArchitecture \n\nThe building has a compact footprint and consists of six connected building volumes with a garden motif. The tallest volume with a green facade, placed in the middle of the design, is the Court Tower that accommodates 3 courtrooms. The rest of the building's volumes accommodate the offices of the different organs of the ICC.http://www.icc-cpi.int/NR/rdonlyres/075EA925-13F6-4C02-8FC7-2FB0C528EDB9/0/IccBuilding0110EngWeb.pdf\n\nProvisional headquarters, 2002–2015 \n\nUntil late 2015, the ICC was housed in interim premises in The Hague provided by the host state of the Netherlands.http://www.netherlandsmission.org/article.asp?articlerefAR00001283EN&categoryvalue\nstatements&subcategoryvalue= Formerly belonging to KPN, the provisional headquarters were located at Maanweg 174 in the east-central portion of the city. The building continues to serve as the seat of Eurojust.\n\nDetention centre \n\nThe ICC's detention centre accommodates both those convicted by the court and serving sentences as well as those suspects detained pending the outcome of their trial. It comprises twelve cells on the premises of the Scheveningen branch of the Haaglanden Penal Institution, The Hague, close to the ICC's new headquarters in the Alexanderkazerne.Emma Thomasson, 28 February 2006.  [http://www.publicinternationallaw.org/warcrimeswatch/archives/wcpw_vol01issue02.html#u2 ICC says cells ready for Uganda war crimes suspects]. Reuters. Retrieved 18 June 2007.International Criminal Court, 18 October 2005.   , p. 23. Retrieved 18 June 2007. Suspects held by the International Criminal Tribunal for the former Yugoslavia are held in the same prison and share some facilities, like the fitness room, but have no contact with suspects held by the ICC.\n\nOther offices \n\nThe ICC maintains a liaison office in New YorkInternational Criminal Court, January 2007.  . Retrieved 10 June 2008. and field offices in places where it conducts its activities. As of 18 October 2007, the Court had field offices in Kampala, Kinshasa, Bunia, Abéché and Bangui.International Criminal Court, 18 October 2007.  . Accessed 10 June 2008.\n\nFinance\n\nThe ICC is financed by contributions from the states parties. The amount payable by each state party is determined using the same method as the United Nations: each state's contribution is based on the country's capacity to pay, which reflects factors such as a national income and population. The maximum amount a single country can pay in any year is limited to 22% of the Court's budget; Japan paid this amount in 2008.\n\nThe Court spent €80.5 million in 2007. The Assembly of States Parties approved a budget of €90.4 million for 2008, €101.2 million for 2009,Programme budget for 2009, the Contingency Fund, the Working Capital Fund for 2009, scale of assessments for the apportionment of expenses of the International Criminal Court and financing appropriations for the year 2009:\n and €141.6 million for 2017. , the ICC’s staff consisted of 800 persons from approximately 100 states.\n\nTrial history to date\n\nTo date, the Prosecutor has \n\nThe Court's Pre-Trial Chambers have \n\nThe Lubanga and Katanga-Chui trials in the situation of the DR Congo are concluded. Mr Lubanga and Mr Katanga were convicted and sentenced to 14 and 12 years imprisonment, respectively, whereas Mr Chui was acquitted.\n\nThe Bemba trial in the Central African Republic situation is concluded. Mr Bemba was convicted on two counts of crimes against humanity and three counts of war crimes. This marked the first time the ICC convicted someone of sexual violence as they added rape to his conviction.\n\nTrials in the Ntaganda case (DR Congo), the Bemba et al.  case and the Laurent Gbagbo-Blé Goudé trial in the Côte d'Ivoire situation are ongoing. The Banda trial in the situation of Darfur, Sudan, was scheduled to begin in 2014 but the start date was vacated. Charges against Dominic Ongwen in the Uganda situation and Ahmed al-Faqi in the Mali situation have been confirmed; both are awaiting their trials.\n\nInvestigations and preliminary examinations\n\nCurrently, the Office of the Prosecutor has \n\nNotes\n\nRelationships\n\nUnited Nations\n\nUnlike the International Court of Justice, the ICC is legally independent from the United Nations. However, the Rome Statute grants certain powers to the United Nations Security Council, which limits its functional independence. Article 13 allows the Security Council to refer to the Court situations that would not otherwise fall under the Court's jurisdiction (as it did in relation to the situations in Darfur and Libya, which the Court could not otherwise have prosecuted as neither Sudan nor Libya are state parties). Article 16 allows the Security Council to require the Court to defer from investigating a case for a period of 12 months.Article 16 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 20 March 2008. Such a deferral may be renewed indefinitely by the Security Council. This sort of an arrangement gives the ICC some of the advantages inhering in the organs of the United Nations such as using the enforcement powers of the Security Council, but it also creates a risk of being tainted with the political controversies of the Security Council.\n\nThe Court cooperates with the UN in many different areas, including the exchange of information and logistical support.International Criminal Court, 1 February 2007.  . Accessed 1 February 2007. The Court reports to the UN each year on its activities,International Criminal Court, August 2006.  . Accessed 14 May 2007. and some meetings of the Assembly of States Parties are held at UN facilities. The relationship between the Court and the UN is governed by a \"Relationship Agreement between the International Criminal Court and the United Nations\".. Retrieved 23 November 2006.Coalition for the International Criminal Court, 12 November 2004.  . Accessed 23 November 2006.\n\nNongovernmental organizations\n\nDuring the 1970s and 1980s, international human rights and humanitarian Nongovernmental Organizations (or NGOs) began to proliferate at exponential rates. Concurrently, the quest to find a way to punish international crimes shifted from being the exclusive responsibility of legal experts to being shared with international human rights activism.\n\nNGOs helped birth the ICC through advocacy and championing for the prosecution of perpetrators of crimes against humanity. NGOs closely monitor the organization's declarations and actions, ensuring that the work that is being executed on behalf of the ICC is fulfilling its objectives and responsibilities to civil society. According to Benjamin Schiff, \"From the Statute Conference onward, the relationship between the ICC and the NGOs has probably been closer, more consistent, and more vital to the Court than have analogous relations between NGOs and any other international organization.\"\n\nThere are a number of NGOs working on a variety of issues related to the ICC. The NGO Coalition for the International Criminal Court has served as a sort of umbrella for NGOs to coordinate with each other on similar objectives related to the ICC. The CICC has 2,500 member organizations in 150 different countries. The original steering committee included representatives from the World Federalist Movement, the International Commission of Jurists, Amnesty International, the Lawyers Committee for Human Rights, Human Rights Watch, Parliamentarians for Global Action, and No Peace Without Justice. Today, many of the NGOs with which the ICC cooperates are members of the CICC. These organizations come from a range of backgrounds, spanning from major international NGOs such as Human Rights Watch and Amnesty International, to smaller, more local organizations focused on peace and justice missions. Many work closely with states, such as the International Criminal Law Network, founded and predominantly funded by the Hague municipality and the Dutch Ministries of Defense and Foreign Affairs. The CICC also claims organizations that are themselves federations, such as the International Federation of Human Rights Leagues (FIDH).\n\nCICC members ascribe to three principles that permit them to work under the umbrella of the CICC, so long as their objectives match them:\n*Promoting worldwide ratification and implementation of the Rome Statute of the ICC\n*Maintaining the integrity of the Rome Statute of the ICC, and\n*Ensuring the ICC will be as fair, effective and independent as possible\n\nThe NGOs that work under the CICC do not normally pursue agendas exclusive to the work of the Court, rather they may work for broader causes, such as general human rights issues, victims' rights, gender rights, rule of law, conflict mediation, and peace. The CICC coordinates their efforts to improve the efficiency of NGOs' contributions to the Court and to pool their influence on major common issues. From the ICC side, it has been useful to have the CICC channel NGO contacts with the Court so that its officials do not have to interact individually with thousands of separate organizations.\n\nNGOs have been crucial to the evolution of the ICC, as they assisted in the creation of the normative climate that urged states to seriously consider the Court's formation. Their legal experts helped shape the Statute, while their lobbying efforts built support for it. They advocate Statute ratification globally and work at expert and political levels within member states for passage of necessary domestic legislation. NGOs are greatly represented at meetings for the Assembly of States Parties, and they use the ASP meetings to press for decisions promoting their priorities. Many of these NGOs have reasonable access to important officials at the ICC because of their involvement during the Statute process. They are engaged in monitoring, commenting upon, and assisting in the ICC's activities.\n\nThe ICC often depends on NGOs to interact with local populations. The Registry Public Information Office personnel and Victims Participation and Reparations Section officials hold seminars for local leaders, professionals and the media to spread the word about the Court. These are the kinds of events that are often hosted or organized by local NGOs. Because there can be challenges with determining which of these NGOs are legitimate, CICC regional representatives often have the ability to help screen and identify trustworthy organizations.\n\nHowever, NGOs are also \"sources of criticism, exhortation and pressure upon\" the ICC. The ICC heavily depends on NGOs for its operations. Although NGOs and states cannot directly impact the judicial nucleus of the organization, they can impart information on crimes, can help locate victims and witnesses, and can promote and organize victim participation. NGOs outwardly comment on the Court's operations, \"push for expansion of its activities especially in the new justice areas of outreach in conflict areas, in victims' participation and reparations, and in upholding due-process standards and defense 'equality of arms' and so implicitly set an agenda for the future evolution of the ICC.\" The relatively uninterrupted progression of NGO involvement with the ICC may mean that NGOs have become repositories of more institutional historical knowledge about the ICC than its national representatives, and have greater expertise than some of the organization's employees themselves. While NGOs look to mold the ICC to satisfy the interests and priorities that they have worked for since the early 1990s, they unavoidably press against the limits imposed upon the ICC by the states that are members of the organization. NGOs can pursue their own mandates, irrespective of whether they are compatible with those of other NGOs, while the ICC must respond to the complexities of its own mandate as well as those of the states and NGOs.\n\nAnother issue has been that NGOs possess \"exaggerated senses of their ownership over the organization and, having been vital to and successful in promoting the Court, were not managing to redefine their roles to permit the Court its necessary independence.\" Additionally, because there does exist such a gap between the large human rights organizations and the smaller peace-oriented organizations, it is difficult for ICC officials to manage and gratify all of their NGOs. \"ICC officials recognize that the NGOs pursue their own agendas, and that they will seek to pressure the ICC in the direction of their own priorities rather than necessarily understanding or being fully sympathetic to the myriad constraints and pressures under which the Court operates.\" Both the ICC and the NGO community avoid criticizing each other publicly or vehemently, although NGOs have released advisory and cautionary messages regarding the ICC. They avoid taking stances that could potentially give the Court's adversaries, particularly the US, more motive to berate the organization.\n\nCriticisms\n\nAccusations of Western imperialism from Africa\n\nThe ICC has been accused of bias and as being a tool of Western imperialism, only punishing leaders from small, weak states while ignoring crimes committed by richer and more powerful states.https://www.reuters.com/article/2011/01/30/ozatp-africa-icc-idAFJOE70T01R20110130 African Union accuses ICC prosecutor of bias This sentiment has been expressed particularly by African leaders due to an alleged disproportionate focus of the Court on Africa, while it claims to have a global mandate; until January 2016, all nine situations which the ICC had been investigating were in African countries.Africa and the International Criminal Court: A drag net that catches only small fish?, Nehanda Radio, By William Muchayi, 24 September 2013, http://nehandaradio.com/2013/09/24/africa-and-the-international-criminal-court-a-drag-net-that-catches-only-small-fish/[http://www.france24.com/en/20120315-lubanga-kony-icc-africans-international-justice-hague-syria-congo Europe - From Lubanga to Kony, is the ICC only after Africans?]. France 24 (15 March 2012). Retrieved on 28 April 2014.\n\nThe prosecution of Kenyan Deputy President William Ruto and President Uhuru Kenyatta (both charged before coming into office) led to the Kenyan parliament passing a motion calling for Kenya's withdrawal from the ICC, and the country called on the other 33 African states party to the ICC to withdraw their support, an issue which was discussed at a special African Union (AU) summit in October 2013.\n\nThough the ICC has denied the charge of disproportionately targeting African leaders, and claims to stand up for victims wherever they may be, Kenya was not alone in criticising the ICC. Sudanese President Omar al-Bashir visited Kenya, South Africa, China, Nigeria, Saudi Arabia, United Arab Emirates, Egypt, Ethiopia, Qatar and several other countries despite an outstanding ICC warrant for his arrest but was not arrested; he said that the charges against him are \"exaggerated\" and that the ICC was a part of a \"Western plot\" against him. Ivory Coast’s government opted not to transfer former first lady Simone Gbagbo to the court but to instead try her at home. Rwanda’s ambassador to the African Union, Joseph Nsengimana, argued that \"It is not only the case of Kenya. We have seen international justice become more and more a political matter.\" Ugandan President Yoweri Museveni accused the ICC of \"mishandling complex African issues.\" Ethiopian Prime Minister Hailemariam Desalegn, at the time AU chairman, told the UN General Assembly at the General debate of the sixty-eighth session of the United Nations General Assembly: \"The manner in which the ICC has been operating has left a very bad impression in Africa. It is totally unacceptable.\"\n\nAU withdrawal proposal\n\nSouth African President Jacob Zuma said the perceptions of the ICC as \"unreasonable\" led to the calling of the special AU summit on 13 October 2015. Botswana is a notable supporter of the ICC in Africa. At the summit, the AU did not endorse the proposal for a mass withdrawal from the ICC due to lack of support for the idea.  However, the summit did conclude that serving heads of state should not be put on trial and that the Kenyan cases should be deferred. Ethiopian Foreign Minister Tedros Adhanom said: \"We have rejected the double standard that the ICC is applying in dispensing international justice.\"[http://www.aljazeera.com/news/africa/2013/10/africans-urge-icc-not-try-heads-state-201310125566632803.html Africans urge ICC not to try heads of state - Africa]. Al Jazeera English. Retrieved on 28 April 2014. Despite these calls, the ICC went ahead with requiring William Ruto to attend his trial.[http://www.aljazeera.com/news/africa/2013/10/icc-rules-kenya-vp-must-attend-his-trial-201310258280911718.html ICC rules Kenya VP must attend his trial - Africa]. Al Jazeera English. Retrieved on 28 April 2014. The UNSC was then asked to consider deferring the trials of Kenyatta and Ruto for a year,[http://www.aljazeera.com/indepth/features/2013/11/africans-push-un-call-off-racist-court-2013111451110131757.html Africans push UN to call off 'racist' court - Features]. Al Jazeera English. Retrieved on 28 April 2014. but this was rejected. In November, the ICC's Assembly of State Parties responded to Kenya's calls for an exemption for sitting heads of state by agreeing to consider amendments to the Rome Statute to address the concerns.\n\nOn 7 October 2016, Burundi announced that it would leave the ICC, after the court began investigating political violence in that nation. In the subsequent two weeks, South Africa and Gambia also announced their intention to leave the court, with Kenya and Namibia reportedly also considering departure. All three nations cited the fact that all 39 people indicted by the court over its history have been African and that the court has made no effort to investigate war crimes tied to the 2003 invasion of Iraq.  However, following Gambia's presidential election later that year, which ended the long rule of Yahya Jammeh, Gambia rescinded its withdrawal notification. The High Court of South Africa ruled on 2 February 2017 that the South African government's notice to withdraw was unconstitutional and invalid. On 7 March 2017 the South African government formally revoked its intention to withdraw; however, the ruling ANC revealed on 5 July 2017 that its intention to withdraw stands.\n\nChecks and balances\n\nThe United States Department of State argues that there are \"insufficient checks and balances on the authority of the ICC prosecutor and judges\" and \"insufficient protection against politicized prosecutions or other abuses\".  The current law in the United States on the ICC is the American Service-Members' Protection Act (ASPA), 116 Stat. 820, The ASPA authorizes the President of the United States to use \"all means necessary and appropriate to bring about the release of any U.S. or allied personnel being detained or imprisoned by, on behalf of, or at the request of the International Criminal Court.\" This authorization has led the act to be nicknamed the \"Hague Invasion Act\",Human Rights Watch, \"[https://www.hrw.org/en/news/2002/08/03/us-hague-invasion-act-becomes-law U.S.: 'Hague Invasion Act' Becomes Law]\". 3 August 2002. Accessed 8 January 2007.John Sutherland, \"[https://www.theguardian.com/Archive/Article/0,4273,4456801,00.html Who are America's real enemies?]\". The Guardian, 8 July 2002. Accessed 8 January 2007. because the freeing of U.S. citizens by force might be possible only through military action.\n\nConcerning the independent Office of Public Counsel for the Defence (OPCD), Thomas Lubanga's defence team say they were given a smaller budget than the Prosecutor and that evidence and witness statements were slow to arrive.\n\nLimitations\n\nLimitations exist for the ICC. The Human Rights Watch (HRW) reported that the ICC's prosecutor team takes no account of the roles played by the government in the conflict of Uganda, Rwanda or Congo. This led to a flawed investigation, because the ICC did not reach the conclusion of its verdict after considering the governments’ position and actions in the conflict.\n\nUnintentional consequences \n\nResearch suggests that prosecutions of leaders in the ICC makes dictators less likely to peacefully step down. It is also argued that justice is a means to peace: \"As a result, the ICC has been used as a means\nof intervention in ongoing conflicts with the expectation that the indictments, arrests, and\ntrials of elite perpetrators have deterrence and preventive effects for atrocity crimes.\nDespite these legitimate intentions and great expectations, there is little evidence of the\nefficacy of justice as a means to peace\".Alana Tiemessen, The International Criminal Court and the lawfare of judicial intervention, International Relations Vol. 30, No. 4, December 2016.\n\nState cooperation \n\nThat the ICC cannot mount successful cases without state cooperation is problematic for several reasons. It means that the ICC acts inconsistently in its selection of cases, is prevented from taking on hard cases and loses legitimacy. It also gives the ICC less deterrent value, as potential perpetrators of war crimes know that they can avoid ICC judgment by taking over government and refusing to cooperate.\n\nQuestioning the true application of the principle of complementarity \n\nThe fundamental principle of complementarity of the ICC Rome Statute is often taken for granted in the legal analysis of international criminal law and its jurisprudence. Initially the thorny issue of the actual application of the complementarity principle arose in 2008, when William Schabas published his monumental paper.Schabas, W.A., ‘Complementarity in Practice’: Some Uncomplimentary Thoughts, Crim Law Forum (2008) 19: 5. https://doi.org/10.1007/s10609-007-9054-5 However, despite Schabas' theoretical impact, no substantive research was made by other scholars on this issue for quite some time. In June 2017, Victor Tsilonis advanced the same criticism which is reinforced by events, practices of the Office of the Prosecutor and ICC cases in the [http://crime-in-crisis.com/en/ Essays] in Honour of Nestor Courakis. His paper essentially argues that the Αl‐Senussi case arguably is the first instance of the complementarity principle's actual implementation eleven whole years after the ratification of the Rome Statute of the International Criminal Court.[http://crime-in-crisis.com/en/?p=305 Victor Tsilonis, “The Awakening Hypothesis of the Complementarity Principle”, in C.D. Spinellis, Nikolaos Theodorakis, Emmanouil Billis, George Papadimitrakopoulos (eds.), EUROPE IN CRISIS: CRIME, CRIMINAL JUSTICE AND THE WAY FORWARD, ESSAYS IN HONOUR OF NESTOR COURAKIS, Volume II: Essays in English, French, German, and Italian, (Athens: Ant. N. Sakkoulas Publications), (2017), pp. 1257-1303.]\n\nOn the other hand, the Chief Prosecutor, Fatou Bensouda, has invoked recently the principle of complementarity in the situation between Russia and Georgia in\nOssetia region.Situation in Georgia, Public Document with Confidential, EX PARTE, Annexes A, B, C, D.2, E.3, E.7, E.9, F, H and Public Annexes 1, D.1, E.1, E.2, E.4, E.5, E.6, E.8, G, I, J, ICC‐01/15‐4 13‐10‐2015 1/160 EO PT, pp. 132‐133, 150‐151, , 10 April 2017. Moreover, following the threats of certain African states (initially Burundi, Gambia and South Africa) to withdraw their ratifications, Bensouda again referred to the principle of complementarity as a core principle of ICC’s jurisdiction and has more extensively focused on the principle’s application on the latest Office of The Prosecutor’s Report on Preliminary Examination Activities 2016.Statement of the Prosecutor of the International Criminal Court, Ms Fatou Bensouda, regarding the situation in the Kasaï provinces, Democratic Republic of theCongo, 31 March 2017, , 10 April 2017.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "International Criminal Court" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14880" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The International Criminal Court (ICC or ICCt)International Criminal Court is sometimes abbreviated as ICCt to distinguish it from several other organisations abbreviated as ICC. However the more common abbreviation ICC is used in this article. is an intergovernmental organization and international tribunal that sits in The Hague in the Netherlands. The ICC has the jurisdiction to prosecute individuals for the international crimes of genocide, crimes against humanity, and war crimes. The ICC is intended to complement existing national judicial systems and it may therefore only exercise its jurisdiction when certain conditions are met, such as when national courts are unwilling or unable to prosecute criminals or when the United Nations Security Council or individual states refer situations to the Court. The ICC began functioning on 1 July 2002, the date that the Rome Statute entered into force. The Rome Statute is a multilateral treaty which serves as the ICC's foundational and governing document. States which become party to the Rome Statute, for example by ratifying it, become member states of the ICC. Currently, there are 123 states which are party to the Rome Statute and therefore members of the ICC.\n\nThe ICC has four principal organs: the Presidency, the Judicial Divisions, the Office of the Prosecutor, and the Registry. The President is the most senior judge chosen by his or her peers in the Judicial Division, which hears cases before the Court. The Office of the Prosecutor is headed by the Prosecutor who investigates crimes and initiates proceedings before the Judicial Division. The Registry is headed by the Registrar and is charged with managing all the administrative functions of the ICC, including the headquarters, detention unit, and public defense office.\n\nThe Office of the Prosecutor has opened ten official investigations and is also conducting an additional eleven preliminary examinations. Thus far, 39 individuals have been indicted in the ICC, including Ugandan rebel leader Joseph Kony, Sudanese president Omar al-Bashir, Kenyan president Uhuru Kenyatta, Libyan leader Muammar Gaddafi, Ivorian president Laurent Gbagbo, and Congolese vice-president Jean-Pierre Bemba.\n\nHistory \n\nThe establishment of an international tribunal to judge political leaders accused of international crimes was first proposed during the Paris Peace Conference in 1919 following the First World War by the Commission of Responsibilities. The issue was addressed again at a conference held in Geneva under the auspices of the League of Nations in 1937, which resulted in the conclusion of the first convention stipulating the establishment of a permanent international court to try acts of international terrorism. The convention was signed by 13 states, but none ratified it and the convention never entered into force.\n\nFollowing the Second World War, the allied powers established two ad hoc tribunals to prosecute axis power leaders accused of war crimes. The International Military Tribunal, which sat in Nuremberg, prosecuted German leaders while the International Military Tribunal for the Far East in Tokyo prosecuted Japanese leaders. In 1948 the United Nations General Assembly first recognised the need for a permanent international court to deal with atrocities of the kind prosecuted after the Second World War.United Nations Department of Public Information, December 2002. [https://www.un.org/News/facts/iccfact.htm The International Criminal Court] . Retrieved 5 December 2006. At the request of the General Assembly, the International Law Commission (ILC) drafted two statutes by the early 1950s but these were shelved during the Cold War, which made the establishment of an international criminal court politically unrealistic.Dempsey, Gary T. (16 July 1998). [http://www.cato.org/pubs/pas/pa-311es.html \"Reasonable Doubt: The Case Against the Proposed International Criminal Court\"]. Cato Institute. Retrieved 31 December 2006.\n\nBenjamin B. Ferencz, an investigator of Nazi war crimes after the Second World War, and the Chief Prosecutor for the United States Army at the Einsatzgruppen Trial, became a vocal advocate of the establishment of international rule of law and of an international criminal court. In his first book published in 1975, entitled Defining International Aggression: The Search for World Peace, he advocated for the establishment of such a court. A second major advocate was Robert Kurt Woetzel, who co-edited Toward a Feasible International Criminal Court in 1970 and created the Foundation for the Establishment of an International Criminal Court in 1971.\n\nIn June 1989 Prime Minister of Trinidad and Tobago A. N. R. Robinson revived the idea of a permanent international criminal court by proposing the creation of such a court to deal with the illegal drug trade.International Criminal Court (20 June 2006). . Retrieved 3 May 2007. Following Trinidad and Tobago's proposal, the General Assembly tasked the ILC with once again drafting a statute for a permanent court.[http://www.iccnow.org/?mod\nicchistory \"History of the ICC\"]. Retrieved 4 June 2012. While work began on the draft, the United Nations Security Council established two ad hoc tribunals in the early 1990s. The International Criminal Tribunal for the former Yugoslavia was created in 1993 in response to large-scale atrocities committed by armed forces during Yugoslav Wars, and the International Criminal Tribunal for Rwanda was created in 1994 following the Rwandan Genocide. The creation of these tribunals further highlighted the need for a permanent international criminal court.Coalition for the International Criminal Court. [http://www.iccnow.org/?mod=icchistory \"History of the ICC\"]. Retrieved 31 December 2006.\n\nIn 1994, the ILC presented its final draft statute for the International Criminal Court to the General Assembly and recommended that a conference be convened to negotiate a treaty that would serve as the Court's statute.[http://legal.un.org/ilc/texts/instruments/english/draft%20articles/7_4_1994.pdf \"Draft Statute for an International Criminal Court, 1994\"]. Retrieved 4 June 2012. To consider major substantive issues in the draft statute, the General Assembly established the Ad Hoc Committee on the Establishment of an International Criminal Court, which met twice in 1995. After considering the Committee's report, the General Assembly created the Preparatory Committee on the Establishment of the ICC to prepare a consolidated draft text. From 1996 to 1998, six sessions of the Preparatory Committee were held at the United Nations headquarters in New York City, during which NGOs provided input and attended meetings under the umbrella organisation of the Coalition for an ICC (CICC). In January 1998, the Bureau and coordinators of the Preparatory Committee convened for an Inter-Sessional meeting in Zutphen in the Netherlands to technically consolidate and restructure the draft articles into a draft.\n\nFinally the General Assembly convened a conference in Rome in June 1998, with the aim of finalizing the treaty to serve as the Court's statute. On 17 July 1998, the Rome Statute of the International Criminal Court was adopted by a vote of 120 to 7, with 21 countries abstaining. The seven countries that voted against the treaty were China, Iraq, Israel, Libya, Qatar, the United States, and Yemen.Scharf, Michael P. (August 1998). [http://www.asil.org/insights/insigh23.htm \"Results of the Rome Conference for an International Criminal Court\"]. American Society of International Law. Retrieved 4 December 2006. Following 60 ratifications, the Rome Statute entered into force on 1 July 2002 and the International Criminal Court was formally established.Amnesty International (11 April 2002). [https://www.amnesty.org/en/library/info/IOR40/008/2002 \"The International Criminal Court – A Historic Development in the Fight for Justice\"]. Retrieved 20 March 2008. The first bench of 18 judges was elected by the Assembly of States Parties in February 2003. They were sworn in at the inaugural session of the Court on 11 March 2003.Coalition for the International Criminal Court. [http://www2.icc-cpi.int/Menus/ICC/Press+and+Media/Press+Releases/2005/Warrant+of+Arrest+unsealed+against+five+LRA+Commanders.htm \"Judges and the Presidency\"]. [https://www.webcitation.org/6CnQbflxv?url\nhttp://www2.icc-cpi.int/Menus/ICC/Press%2Band%2BMedia/Press%2BReleases/2005/Warrant%2Bof%2BArrest%2Bunsealed%2Bagainst%2Bfive%2BLRA%2BCommanders.htm Archived] from the original on 9 December 2012. Retrieved 9 December 2012.\n\nThe Court issued its first arrest warrants on 8 July 2005,International Criminal Court (14 October 2005). [http://www.icc-cpi.int/en_menus/icc/situations%20and%20cases/situations/situation%20icc%200204/related%20cases/icc%200204%200105/press%20releases/Pages/warrant%20of%20arrest%20unsealed%20against%20five%20lra%20commanders.aspx \"Warrant of Arrest Unsealed Against Five LRA Commanders\"]. Retrieved 30 September 2014. and the first pre-trial hearings were held in 2006.International Criminal Court (9 November 2006). . Retrieved 5 December 2006. The Court issued its first judgment in 2012 when it found Congolese rebel leader Thomas Lubanga Dyilo guilty of war crimes related to using child soldiers.\n\nIn 2010 the states parties of the Rome Statute held the first Review Conference of the Rome Statute of the International Criminal Court in Kampala, Uganda. There they adopted two amendments to the Statute. The second amendment defined the crime of aggression and outlined the procedure by which the ICC could prosecute individuals. However, the conditions outlined in the amendment have not yet been met and the ICC can not yet exercise jurisdiction over crimes of aggression.\n\nIn October 2016, after repeated claims that the court was biased against African states, Burundi, South Africa and the Gambia announced their withdrawals from the Rome Statute. However, following Gambia's presidential election later that year, which ended the long rule of Yahya Jammeh, Gambia rescinded its withdrawal notification.Moore, Jina (27 October 2017). \"[https://www.nytimes.com/2017/10/27/world/africa/burundi-international-criminal-court.html Burundi Quits International Criminal Court]\". New York Times. nytimes.com. Retrieved 27 October 2017. Subsequent to a ruling of the High Court of South Africa, in early 2017, that the country's withdrawal would be unconstitutional, the  South African government informed the United Nations, on 7 March 2017, that it was revoking its decision to withdraw.Onishi, Norimitsu (8 March 2017). \"[https://www.nytimes.com/2017/03/08/world/africa/south-africa-icc-withdrawal.html South Africa Reverses Withdrawal From International Criminal Court]\". New York Times. nytimes.com. Retrieved 27 October 2017.\n\nExperts believe that Kenya, Namibia, and Uganda may soon follow in withdrawing from the court, while South Africa is still committed to withdrawing, leading to a mass African exodus.\n\nStructure\n\nThe ICC is governed by an Assembly of States Parties, which is made up of the states which are party to the Rome Statute.International Criminal Court. . Retrieved 2 January 2008. The Assembly elects officials of the Court, approves its budget, and adopts amendments to the Rome Statute. The Court itself, however, is composed of four organs: the Presidency, the Judicial Divisions, the Office of the Prosecutor, and the Registry.International Criminal Court. [http://www.icc-cpi.int/Menus/ICC/Structure+of+the+Court/ Structure of the Court], ICC website. Retrieved 16 June 2012\n\nState parties\n\nAssembly of States Parties\n\nThe Court's management oversight and legislative body, the Assembly of States Parties, consists of one representative from each state party.Article 112 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013. Each state party has one vote and \"every effort\" has to be made to reach decisions by consensus. If consensus cannot be reached, decisions are made by vote. The Assembly is presided over by a president and two vice-presidents, who are elected by the members to three-year terms.\n\nThe Assembly meets in full session once a year, alternating between New York and The Hague, and may also hold special sessions where circumstances require. Sessions are open to observer states and non-governmental organizations.Amnesty International, 11 November 2007. [https://www.amnesty.org/en/international-justice/issues/international-criminal-court/assembly-states-parties Assembly of States Parties of the International Criminal Court]. Retrieved 2 January 2008.\n\nThe Assembly elects the judges and prosecutors, decides the Court's budget, adopts important texts (such as the [http://www.icc-cpi.int/Menus/ICC/Legal+Texts+and+Tools/Official+Journal/Rules+of+Procedure+and+Evidence.htm Rules of Procedure and Evidence]), and provides management oversight to the other organs of the Court. Article 46 of the Rome Statute allows the Assembly to remove from office a judge or prosecutor who \"is found to have committed serious misconduct or a serious breach of his or her duties\" or \"is unable to exercise the functions required by this Statute\".Article 46 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013.\n\nThe states parties cannot interfere with the judicial functions of the Court.Coalition for the International Criminal Court. [http://www.iccnow.org/?mod\nasp Assembly of States Parties]. Retrieved 2 January 2008. Disputes concerning individual cases are settled by the Judicial Divisions.\n\nIn 2010, Kampala, Uganda hosted the Assembly's Rome Statute Review Conference.\n\nOrgans of the Court \n\nThe Court has four organs: the Presidency, the Judicial Division, the Office of the Prosecutor, and the Registry.\n\nPresidency\n\nThe Presidency is responsible for the proper administration of the Court (apart from the Office of the Prosecutor).[http://www.icc-cpi.int/en_menus/icc/structure%20of%20the%20court/presidency/Pages/the%20presidency.aspx The Presidency]. It comprises the President and the First and Second Vice-Presidents—three judges of the Court who are elected to the Presidency by their fellow judges for a maximum of two three-year terms.Article 38 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 18 October 2013. The current (and first female) president is Silvia Fernández de Gurmendi, who was elected on 11 March 2015.[http://www.icc-cpi.int/en_menus/icc/press%20and%20media/press%20releases/Pages/pr1096.aspx  Judge Fernández de Gurmendi elected ICC President for 2015-2018; Judges Aluoch and Ozaki elected First and Second Vice-President respectively]. ICC press release. 11 March 2015. Retrieved 28 March 2015.\n\nJudicial Divisions\n\nThe Judicial Divisions consist of the 18 judges of the Court, organized into three chambers—the Pre-Trial Chamber, Trial Chamber and Appeals Chamber—which carry out the judicial functions of the Court.International Criminal Court. . Retrieved 21 July 2007. Judges are elected to the Court by the Assembly of States Parties. They serve nine-year terms and are not generally eligible for re-election. All judges must be nationals of states parties to the Rome Statute, and no two judges may be nationals of the same state.Article 36 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013. They must be \"persons of high moral character, impartiality and integrity who possess the qualifications required in their respective States for appointment to the highest judicial offices\".\n\nThe Prosecutor or any person being investigated or prosecuted may request the disqualification of a judge from \"any case in which his or her impartiality might reasonably be doubted on any ground\".Article 41 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 18 October 2013. Any request for the disqualification of a judge from a particular case is decided by an absolute majority of the other judges. A judge may be removed from office if he or she \"is found to have committed serious misconduct or a serious breach of his or her duties\" or is unable to exercise his or her functions. The removal of a judge requires both a two-thirds majority of the other judges and a two-thirds majority of the states parties.\n\nOffice of the Prosecutor\n\nThe Office of the Prosecutor (OTP) is responsible for conducting investigations and prosecutions.International Criminal Court. . Retrieved 21 July 2007. It is headed by the Chief Prosecutor, who is assisted by one or more Deputy Prosecutors. The Rome Statute provides that the Office of the Prosecutor shall act independently;Article 42 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013. as such, no member of the Office may seek or act on instructions from any external source, such as states, international organisations, non-governmental organisations or individuals.\n\nThe Prosecutor may open an investigation under three circumstances:\n*when a situation is referred to him or her by a state party;\n*when a situation is referred to him or her by the United Nations Security Council, acting to address a threat to international peace and security; or\n*when the Pre-Trial Chamber authorises him or her to open an investigation on the basis of information received from other sources, such as individuals or non-governmental organisations.\n\nAny person being investigated or prosecuted may request the disqualification of a prosecutor from any case \"in which their impartiality might reasonably be doubted on any ground\". Requests for the disqualification of prosecutors are decided by the Appeals Chamber. A prosecutor may be removed from office by an absolute majority of the states parties if he or she \"is found to have committed serious misconduct or a serious breach of his or her duties\" or is unable to exercise his or her functions. However, critics of the Court argue that there are \"insufficient checks and balances on the authority of the ICC prosecutor and judges\" and \"insufficient protection against politicized prosecutions or other abuses\".US Department of State, 30 July 2003. . Retrieved 31 December 2006. Henry Kissinger says the checks and balances are so weak that the prosecutor \"has virtually unlimited discretion in practice\".Henry A. Kissinger. \"The Pitfalls of Universal Jurisdiction\". Foreign Affairs, July/August 2001, p. 95. Retrieved 31 December 2006. Some efforts have been made to hold Kissinger himself responsible for perceived injustices of American foreign policy during his tenure in government.[http://www.smh.com.au/articles/2002/04/29/1019441343996.html \"Why the law wants a word with Kissinger\"], Fairfax Digital, 30 April 2002\n\nAs of 16 June 2012, the Prosecutor has been Fatou Bensouda of Gambia, who had been elected as the new Prosecutor on 12 December 2011.[http://www.icc-cpi.int/NR/exeres/0E0A4EE7-6C79-4FA1-85CB-4752DEEC1488.htm The Assembly of States Parties to the Rome Statute opens its tenth session]. ICC. 14 December 2011. Retrieved 14 December 2011. She has been elected for nine years. Her predecessor, Luis Moreno Ocampo of Argentina, had been in office from 2003 to 2012.\n\nPolicy Paper\n\nA Policy Paper is a document published by the Office of the Prosecutor occasionally where the particular considerations given to the topics in focus of the Office and often criteria for case selection are stated. While a policy paper does not give the Court jurisdiction over a new category of crimes, it promises what the Office of Prosecutor will consider when selecting cases in the upcoming term of service. OTP's policy papers are subject to revision.\n The five following Policy Papers have been published since the start of the ICC:\n*1 September 2007: Policy Paper on the Interest of Justice\n*12 April 2010: Policy Paper on Victims' Participation\n*1 November 2013: Policy Paper on Preliminary Examinations\n*20 June 2014: Policy Paper on Sexual and Gender-Based Crimes\n*15 September 2016: Policy paper on case selection and prioritisation\n\nEnvironmental crimes\n\nOn the Policy Paper published in September 2016 it was announced that the International Criminal Court will focus on environmental crimes when selecting the cases. According to this document, the Office will give particular consideration to prosecuting Rome Statute crimes that are committed by means of, or that result in, \"inter alia, the destruction of the environment, the illegal exploitation of natural resources or the illegal dispossession of land\".\n\nThis has been interpreted as a major shift towards the environmental crimes and a move with significant effects.\n\nRegistry\n\nThe Registry is responsible for the non-judicial aspects of the administration and servicing of the Court.International Criminal Court. [http://www.icc-cpi.int/Menus/Go?id\n6a4167ac-ca17-403d-928b-b2c36bb85ab4&lanen-GB.html The Registry]. Retrieved 21 July 2007. This includes, among other things, \"the administration of legal aid matters, court management, victims and witnesses matters, defence counsel, detention unit, and the traditional services provided by administrations in international organisations, such as finance, translation, building management, procurement and personnel\". The Registry is headed by the Registrar, who is elected by the judges to a five-year term. The current Registrar is Herman von Hebel, who was elected on 8 March 2013.\n\nJurisdiction and admissibility \n\nThe Rome Statute requires that several criteria exist in a particular case before an individual can be prosecuted by the Court. The Statute contains three jurisdictional requirements and three admissibility requirements. All criteria must be met for a case to proceed.\n\nJurisdiction \n\nThere are three jurisdictional requirements in the Rome Statute that must be met before a case may begin against an individual. The requirements are (1) subject-matter jurisdiction (what acts constitute crimes), (2) territorial or personal jurisdiction (where the crimes were committed or who committed them), and (3) temporal jurisdiction (when the crimes were committed).\n\nSubject-matter jurisdiction \n\nThe Court's subject-matter jurisdiction means the crimes for which individuals can be prosecuted. Individuals can only be prosecuted for crimes that are listed in the Statute. The primary crimes are listed in article 5 of the Statute and defined in later articles: genocide (defined in article 6), crimes against humanity (defined in article 7), war crimes (defined in article 8), and crimes of aggression (defined in article 8 bis) (which is not yet within the jurisdiction of the Court; see below).Rome Statute, Article 5. In addition, article 70 defines offences against the administration of justice, which are also crimes for which individuals can be prosecuted.\n\nGenocide \n\nArticle 6 defines the crime of genocide as \"acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group\".Rome Statute, Article 6. There are five such acts which constitute crimes of genocide under article 6:Rome Statute, Articles 6(a)–6(e).\n# Killing members of a group\n# Causing serious bodily or mental harm to members of the group\n# Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction\n# Imposing measures intended to prevent births within the group\n# Forcibly transferring children of the group to another group\nThe definition of these crimes is identical to those contained within the Convention on the Prevention and Punishment of the Crime of Genocide of 1948.\n\nCrimes against humanity \n\nArticle 7 defines crimes against humanity as acts \"committed as part of a widespread or systematic attack directed against any civilian population, with knowledge of the attack\".Rome Statute, Article 7. The article lists 16 such as individual crimes:\n# Murder\n# Extermination\n# Enslavement\n# Deportation or forcible transfer of population\n# Imprisonment or other severe deprivation of physical liberty\n# Torture\n# Rape\n# Sexual slavery\n# Enforced prostitution\n# Forced pregnancy\n# Enforced sterilization\n# Sexual violence\n# Persecution\n# Enforced disappearance of persons\n# Apartheid\n# Other inhumane acts\n\nWar crimes \n\nArticle 8 defines war crimes depending on whether an armed conflict is either international (which generally means it is fought between states) or non-international (which generally means that it is fought between non-state actors, such as rebel groups, or between a state and such non-state actors). In total there are 74 war crimes listed in article 8. The most serious crimes, however, are those that constitute either grave breaches of the Geneva Conventions of 1949, which only apply to international conflicts, and serious violations of article 3 common to the Geneva Conventions of 1949, which apply to non-international conflicts.Rome Statute, Article 8(2)(c).\n\nThere are 11 crimes which constitute grave breaches of the Geneva Conventions and which are applicable only to international armed conflicts:\n# Willful killing\n# Torture\n# Inhumane treatment\n# Biological experiments\n# Willfully causing great suffering\n# Destruction and appropriation of property\n# Compelling service in hostile forces\n# Denying a fair trial\n# Unlawful deportation and transfer\n# Unlawful confinement\n# Taking hostages\n\nThere are seven crimes which constitute serious violations of article 3 common to the Geneva Conventions and which are applicable only to non-international armed conflicts:\n# Murder\n# Mutilation\n# Cruel treatment\n# Torture\n# Outrages upon personal dignity\n# Taking hostages\n# Sentencing or execution without due process\n\nAdditionally, there are 56 other crimes defined by article 8: 35 that apply to international armed conflicts and 21 that apply to non-international armed conflicts. Such crimes include attacking civilians or civilian objects, attacking peacekeepers, causing excessive incidental death or damage, transferring populations into occupied territories, treacherously killing or wounding, denying quarter, pillaging, employing poison, using expanding bullets, rape and other forms of sexual violence, and conscripting or using child soldiers.Rome Statute, Article 8.\n\nCrimes of aggression \n\nArticle 8 bis defines crimes of aggression; however, the Court is not yet able to prosecute individuals for these crimes. The Statute originally provided that the Court could not exercise its jurisdiction over the crime of aggression until such time as the states parties agreed on a definition of the crime and set out the conditions under which it could be prosecuted.Article 5 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 20 March 2008. Such an amendment was adopted at the first review conference of the ICC in Kampala, Uganda, in June 2010. However, this amendment specified that the ICC would not be allowed to exercise jurisdiction of the crime of aggression until two further conditions had been satisfied: (1) the amendment has entered into force for 30 states parties and (2) on or after 1 January 2017, the Assembly of States Parties has voted in favor of allowing the Court to exercise jurisdiction.\n\nThe Statute, as amended, defines the crime of aggression as \"the planning, preparation, initiation or execution, by a person in a position effectively to exercise control over or to direct the political or military action of a State, of an act of aggression which, by its character, gravity and scale, constitutes a manifest violation of the Charter of the United Nations.\"Rome Statute, Article 8 bis(1). The Statute defines an \"act of aggression\" as \"the use of armed force by a State against the sovereignty, territorial integrity or political independence of another State, or in any other manner inconsistent with the Charter of the United Nations.\"Rome Statute, Article 8 bis(2). The article also contains a list of seven acts of aggression, which are identical to those in United Nations General Assembly Resolution 3314 of 1974 and include the following acts when committed by one state against another state:Rome Statute, Articles 8 bis(2)(a)–8 bis(2)(g).\n\n# Invasion or attack by armed forces against territory\n# Military occupation of territory\n# Annexation of territory\n# Bombardment against territory\n# Use of any weapons against territory\n# Blockade of ports or coasts\n# Attack on the land, sea, or air forces or marine and air fleets\n# The use of armed forces which are within the territory of another state by agreement, but in contravention of the conditions of the agreement\n# Allowing territory to be used by another state to perpetrate an act of aggression against a third state\n# Sending armed bands, groups, irregulars, or mercenaries to carry out acts of armed force\n\nOffences against the administration of justice \n\nArticle 70 criminalizes certain intentional acts which interfere with investigations and proceedings before the Court, including giving false testimony, presenting false evidence, corruptly influencing a witness or official of the Court, retaliating against an official of the Court, and soliciting or accepting bribes as an official of the Court.Rome Statute, Article 70.\n\nTerritorial or personal jurisdiction \n\nFor an individual to be prosecuted by the Court either territorial jurisdiction or personal jurisdiction must exist. Therefore, an individual can only be prosecuted if he or she has either (1) committed a crime within the territorial jurisdiction of the Court or (2) committed a crime while a national of a state that is within the territorial jurisdiction of the Court.\n\nTerritorial jurisdiction \n\nThe territorial jurisdiction of the Court includes the territory, registered vessels, and registered aircraft of states which have either (1) become party to the Rome Statute or (2) accepted the Court's jurisdiction by filing a declaration with the Court.Rome Statute, Article 12.\n\nIn situations that are referred to the Court by the United Nations Security Council, the territorial jurisdiction is defined by the Security Council, which may be more expansive than the Court's normal territorial jurisdiction.Rome Statute, Article 13(b). For example, if the Security Council refers a situation that took place in the territory of a state that has both not become party to the Rome Statute and not lodged a declaration with the Court, the Court will still be able to prosecute crimes that occurred within that state.\n\nPersonal jurisdiction \n\nThe personal jurisdiction of the Court extends to all natural persons who commit crimes, regardless of where they are located or where the crimes were committed, as long as those individuals are nationals of either (1) states that are party to the Rome Statute or (2) states that have accepted the Court's jurisdiction by filing a declaration with the Court. As with territorial jurisdiction, the personal jurisdiction can be expanded by the Security Council if it refers a situation to the Court.\n\nTemporal jurisdiction \n\nTemporal jurisdiction is the time period over which the Court can exercise its powers. No statute of limitations applies to any of the crimes defined in the Statute.Rome Statute, Article 29. However, the Court's jurisdiction is not completely retroactive. Individuals can only be prosecuted for crimes that took place on or after 1 July 2002, which is the date that the Rome Statute entered into force.Rome Statute, Article 11(1). However, if a state became party to the Statute, and therefore a member of the Court, after 1 July 2002, then the Court cannot exercise jurisdiction prior to that date for certain cases.Rome Statute, Article 11(2). For example, if the Statute entered into force for a state on 1 January 2003, the Court could only exercise temporal jurisdiction over crimes that took place in that state or were committed by a national of that state on or after 1 January 2003.\n\nAdmissibility \n\nTo initiate an investigation, the Prosecutor must (1) have a \"reasonable basis to believe that a crime within the jurisdiction of the Court has been or is being committed\", (2) the investigation would be consistent with the principle of complementarity, and (3) the investigation serves the interests of justice.Rome Statute, Article 53(1).\n\nComplementarity \n\nThe principle of complementarity means that the Court will only prosecute an individual if states are unwilling or unable to prosecute. Therefore, if legitimate national investigations or proceedings into crimes have taken place or are ongoing, the Court will not initiate proceedings. This principle applies regardless of the outcome of national proceedings.Rome Statute, Articles 17(a)–17(c). Even if an investigation is closed without any criminal charges being filed or if an accused person is acquitted by a national court, the Court will not prosecute an individual for the crime in question so long as it is satisfied that the national proceedings were legitimate. However the actual application of the complementarity principle has recently come under theoretical scrutiny.\n\nGravity \n\nThe Court will only initiate proceedings if a crime is of \"sufficient gravity to justify further action by the Court\".Rome Statute, Articles 17(d).\n\nInterests of justice \n\nThe Prosecutor will initiate an investigation unless there are \"substantial reasons to believe that an investigation would not serve the interests of justice\" when \"[t]aking into account the gravity of the crime and the interests of victims\".Rome Statute, Article 53(1)(c). Furthermore, even if an investigation has been initiated and there are substantial facts to warrant a prosecution and no other admissibility issues, the Prosecutor must determine whether a prosecution would serve the interests of justice \"taking into account all the circumstances, including the gravity of the crime, the interests of victims and the age or infirmity of the alleged perpetrator, and his or her role in the alleged crime\".Rome Statute, Article 53(2)(c).\n\nProcedure\n\nTrial\n\nTrials are conducted under a hybrid common law and civil law judicial system, but it has been argued the procedural orientation and character of the court is still evolving. A majority of the three judges present, as triers of fact, may reach a decision, which must include a full and reasoned statement. Trials are supposed to be public, but proceedings are often closed, and such exceptions to a public trial have not been enumerated in detail. In camera proceedings are allowed for protection of witnesses or defendants as well as for confidential or sensitive evidence. Hearsay and other indirect evidence is not generally prohibited, but it has been argued the court is guided by hearsay exceptions which are prominent in common law systems. There is no subpoena or other means to compel witnesses to come before the court, although the court has some power to compel testimony of those who chose to come before it, such as fines.\n\nRights of the accused\n\nThe Rome Statute provides that all persons are presumed innocent until proven guilty beyond reasonable doubt,Article 66 of the [Rome Statute]. Retrieved 18 October 2013. and establishes certain rights of the accused and persons during investigations.The rights of persons during an investigation are provided in Article 55. Rights of the accused are provided in Part 6, especially Article 67. See also Amnesty International, 1 August 2000. [https://www.amnesty.org/en/library/info/IOR40/009/2000 The International Criminal Court: Fact sheet 9 – Fair trial guarantees]. Retrieved 20 March 2008. These include the right to be fully informed of the charges against him or her; the right to have a lawyer appointed, free of charge; the right to a speedy trial; and the right to examine the witnesses against him or her.\n\nTo ensure \"equality of arms\" between defence and prosecution teams, the ICC has established an independent Office of Public Counsel for the Defence (OPCD) to provide logistical support, advice and information to defendants and their counsel.Katy Glassborow (21 August 2006). . Global Policy Forum. Retrieved 3 May 2007.International Criminal Court. . Retrieved 3 May 2007. The OPCD also helps to safeguard the rights of the accused during the initial stages of an investigation.International Criminal Court, 2005. [http://www.derechos.org/nizkor/icc/iccreport.html Report of the International Criminal Court for 2004]. Retrieved 3 May 2007. However, Thomas Lubanga's defence team say they were given a smaller budget than the Prosecutor and that evidence and witness statements were slow to arrive.Stephanie Hanson (17 November 2006). [http://www.cfr.org/publication/12048/ Africa and the International Criminal Court]. Council on Foreign Relations. Retrieved 23 November 2006.\n\nVictim participation\n\nOne of the great innovations of the Statute of the International Criminal Court and its Rules of Procedure and Evidence is the series of rights granted to victims.International Criminal Court. . Accessed 22 June 2007.Ilaria Bottigliero (April 2003). [http://www.sgiquarterly.org/english/Features/quarterly/0304/perspective.htm \"The International Criminal Court – Hope for the Victims\"]. 32 SGI Quarterly. pp. 13–15. Accessed 24 July 2007. For the first time in the history of international criminal justice, victims have the possibility under the Statute to present their views and observations before the Court.\n\nParticipation before the Court may occur at various stages of proceedings and may take different forms, although it will be up to the judges to give directions as to the timing and manner of participation.\n\nParticipation in the Court's proceedings will in most cases take place through a legal representative and will be conducted \"in a manner which is not prejudicial or inconsistent with the rights of the accused and a fair and impartial trial\".\n\nThe victim-based provisions within the Rome Statute provide victims with the opportunity to have their voices heard and to obtain, where appropriate, some form of reparation for their suffering. It is the aim of this attempted balance between retributive and restorative justice that, it is hoped, will enable the ICC to not only bring criminals to justice but also help the victims themselves obtain some form of justice. Justice for victims before the ICC comprises both procedural and substantive justice, by allowing them to participate and present their views and interests, so that they can help to shape truth, justice and reparations outcomes of the Court.\n\nArticle 43(6) establishes a Victims and Witnesses Unit to provide \"protective measures and security arrangements, counseling and other appropriate assistance for witnesses, victims who appear before the Court, and others who are at risk on account of testimony given by such witnesses.\"Article 43(6) of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 18 October 2013. Article 68 sets out procedures for the \"Protection of the victims and witnesses and their participation in the proceedings.\"Article 68 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 18 October 2013. The Court has also established an Office of Public Counsel for Victims, to provide support and assistance to victims and their legal representatives.International Criminal Court, 17 October 2006.  . Accessed 18 June 2007.\n\nThe ICC does not have its own witness protection program, but rather must rely on national programs to keep witnesses safe.\n\nReparations \n\nVictims before the International Criminal Court can also claim reparations under Article 75 of the Rome Statute. Reparations can only be claimed when a defendant is convicted and at the discretion of the Court's judges. So far the Court has ordered reparations against Thomas Lubanga. Reparations can include compensation, restitution and rehabilitation, but other forms of reparations may be appropriate for individual, collective or community victims. Article 79 of the Rome Statute establishes a Trust Fund to provide assistance before a reparation order to victims in a situation or to support reparations to victims and their families if the convicted person has no money.International Criminal Court. . Accessed 22 June 2007.\n\nCo-operation by states not party to Rome Statute\n\nOne of the principles of international law is that a treaty does not create either obligations or rights for third states without their consent (pacta tertiis nec nocent nec prosunt), and this is also enshrined in the 1969 Vienna Convention on the Law of Treaties. The co-operation of the non-party states with the ICC is envisioned by the Rome Statute of the International Criminal Court to be of voluntary nature.Article 87 (5)(a) of the Rome Statute. Retrieved 30 October 2008. However, even states that have not acceded to the Rome Statute might still be subjects to an obligation to co-operate with ICC in certain cases. When a case is referred to the ICC by the UN Security Council all UN member states are obliged to co-operate, since its decisions are binding for all of them.Article 25 of the [https://www.un.org/aboutun/charter/ UN Charter] . Retrieved 30 October 2008. Also, there is an obligation to respect and ensure respect for international humanitarian law, which stems from the Geneva Conventions and Additional Protocol I,Article 89 of [http://www.icrc.org/ihl.nsf/7c4d08d9b287a42141256739003e636b/f6c8b9fee14a77fdc125641e0052b079 Additional Protocol I] from 1977. Accessed on 30 October 2008. which reflects the absolute nature of IHL.Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. the United States of America), Merits, Judgment, ICJ Reports 1986, p. 114, para. 220. Although the wording of the Conventions might not be precise as to what steps have to be taken, it has been argued that it at least requires non-party states to make an effort not to block actions of ICC in response to serious violations of those Conventions.\n\nIn relation to co-operation in investigation and evidence gathering, it is implied from the Rome StatuteArticle 99 of the Rome Statute. Retrieved 30 October 2008. that the consent of a non-party state is a prerequisite for ICC Prosecutor to conduct an investigation within its territory, and it seems that it is even more necessary for him to observe any reasonable conditions raised by that state, since such restrictions exist for states party to the Statute. Taking into account the experience of the ICTY (which worked with the principle of the primacy, instead of complementarity) in relation to co-operation, some scholars have expressed their pessimism as to the possibility of ICC to obtain co-operation of non-party states. As for the actions that ICC can take towards non-party states that do not co-operate, the Rome Statute stipulates that the Court may inform the Assembly of States Parties or Security Council, when the matter was referred by it, when non-party state refuses to co-operate after it has entered into an ad hoc arrangement or an agreement with the Court.Article 87(5) of the Rome Statute. Accessed on 30 October 2008.\n\nAmnesties and national reconciliation processes\n\nIt is unclear to what extent the ICC is compatible with reconciliation processes that grant amnesty to human rights abusers as part of agreements to end conflict.Anthony Dworkin (December 2003). [http://www.crimesofwar.org/icc_magazine/icc-intro.html \"Introduction\"] in The International Criminal Court: An End to Impunity?  Crimes of War Project. Accessed 18 September 2007. Article 16 of the Rome Statute allows the Security Council to prevent the Court from investigating or prosecuting a case, and Article 53 allows the Prosecutor the discretion not to initiate an investigation if he or she believes that \"an investigation would not serve the interests of justice\".Article 53 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 20 March 2008. Former ICC president Philippe Kirsch has said that \"some limited amnesties may be compatible\" with a country's obligations genuinely to investigate or prosecute under the Statute.\n\nIt is sometimes argued that amnesties are necessary to allow the peaceful transfer of power from abusive regimes. By denying states the right to offer amnesty to human rights abusers, the International Criminal Court may make it more difficult to negotiate an end to conflict and a transition to democracy. For example, the outstanding arrest warrants for four leaders of the Lord's Resistance Army are regarded by some as an obstacle to ending the insurgency in Uganda.Tim Cocks (30 May 2007). .  Reuters. Accessed 31 May 2007.Alasdair Palmer (14 January 2007). [http://www.telegraph.co.uk/opinion/main.jhtml?xml=/opinion/2007/01/14/do1409.xml \"When Victims Want Peace, Not Justice\"].  The Sunday Telegraph. Accessed 15 January 2007. Czech politician Marek Benda argues that \"the ICC as a deterrent will in our view only mean the worst dictators will try to retain power at all costs\".Alena Skodova (12 April 2002). [http://www.radio.cz/en/article/26826 \"Czech Parliament Against Ratifying International Criminal Court\"]. Radio Prague. Accessed 11 January 2007. However, the United NationsSee, for example, Kofi Annan (4 October 2000). [http://www.afrol.com/Countries/Sierra_Leone/documents/un_sil_court_041000.htm Report of the Secretary-General on the Establishment of a Special Court for Sierra Leone], para. 22. Accessed 31 December 2006. and the International Committee of the Red CrossJean-Marie Henckaerts & Louise Doswald-Beck, 2005. Customary International Humanitarian Law, Volume I: Rules, pp. 613–614. Cambridge: Cambridge University Press. . maintain that granting amnesty to those accused of war crimes and other serious crimes is a violation of international law.\n\nFacilities\n\nHeadquarters \n\nThe official seat of the Court is in The Hague, Netherlands, but its proceedings may take place anywhere.Article 3 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Retrieved 18 October 2013.The legal relationship between the ICC and the Netherlands is governed by a headquarters agreement, which entered into force on 1 March 2008. (See International Criminal Court, 2008: . Retrieved 1 June 2008.)\n\nThe Court moved into its first permanent premises in The Hague, located at Oude Waalsdorperweg 10, on 14 December 2015. Part of The Hague's International Zone, which also contains the Peace Palace, Europol, ICTY, OPCW and The Hague World Forum, the court facilities are situated on the site of the Alexanderkazerne, a former military barracks, adjacent to the dune landscape on the northern edge of the city. The ICC's detention centre is a short distance away.\n\nDevelopment \n\nThe land and financing for the new construction were provided by the Netherlands.\n In addition, the host state organised and financed the architectural design competition which started at the end of 2008.\n\nThree architects were chosen by an international jury from a total of 171 applicants to enter into further negotiations. The Danish firm schmidt hammer lassen were ultimately selected to design the new premises since its design met all the ICC criteria, such as design quality, sustainability, functionality and costs.http://www.icc-cpi.int/menus/icc/press%20and%20media/press%20releases/press%20releases%20%282010%29/pr502\n\nDemolition of the barracks started in November 2011 and was completed in August 2012. In October 2012 the tendering procedure for the General Contractor was completed and the combination Visser & Smit Bouw and Boele & van Eesteren (“Courtys”) was selected.\n\nArchitecture \n\nThe building has a compact footprint and consists of six connected building volumes with a garden motif. The tallest volume with a green facade, placed in the middle of the design, is the Court Tower that accommodates 3 courtrooms. The rest of the building's volumes accommodate the offices of the different organs of the ICC.http://www.icc-cpi.int/NR/rdonlyres/075EA925-13F6-4C02-8FC7-2FB0C528EDB9/0/IccBuilding0110EngWeb.pdf\n\nProvisional headquarters, 2002–2015 \n\nUntil late 2015, the ICC was housed in interim premises in The Hague provided by the host state of the Netherlands.http://www.netherlandsmission.org/article.asp?articlerefAR00001283EN&categoryvalue\nstatements&subcategoryvalue= Formerly belonging to KPN, the provisional headquarters were located at Maanweg 174 in the east-central portion of the city. The building continues to serve as the seat of Eurojust.\n\nDetention centre \n\nThe ICC's detention centre accommodates both those convicted by the court and serving sentences as well as those suspects detained pending the outcome of their trial. It comprises twelve cells on the premises of the Scheveningen branch of the Haaglanden Penal Institution, The Hague, close to the ICC's new headquarters in the Alexanderkazerne.Emma Thomasson, 28 February 2006.  [http://www.publicinternationallaw.org/warcrimeswatch/archives/wcpw_vol01issue02.html#u2 ICC says cells ready for Uganda war crimes suspects]. Reuters. Retrieved 18 June 2007.International Criminal Court, 18 October 2005.   , p. 23. Retrieved 18 June 2007. Suspects held by the International Criminal Tribunal for the former Yugoslavia are held in the same prison and share some facilities, like the fitness room, but have no contact with suspects held by the ICC.\n\nOther offices \n\nThe ICC maintains a liaison office in New YorkInternational Criminal Court, January 2007.  . Retrieved 10 June 2008. and field offices in places where it conducts its activities. As of 18 October 2007, the Court had field offices in Kampala, Kinshasa, Bunia, Abéché and Bangui.International Criminal Court, 18 October 2007.  . Accessed 10 June 2008.\n\nFinance\n\nThe ICC is financed by contributions from the states parties. The amount payable by each state party is determined using the same method as the United Nations: each state's contribution is based on the country's capacity to pay, which reflects factors such as a national income and population. The maximum amount a single country can pay in any year is limited to 22% of the Court's budget; Japan paid this amount in 2008.\n\nThe Court spent €80.5 million in 2007. The Assembly of States Parties approved a budget of €90.4 million for 2008, €101.2 million for 2009,Programme budget for 2009, the Contingency Fund, the Working Capital Fund for 2009, scale of assessments for the apportionment of expenses of the International Criminal Court and financing appropriations for the year 2009:\n and €141.6 million for 2017. , the ICC’s staff consisted of 800 persons from approximately 100 states.\n\nTrial history to date\n\nTo date, the Prosecutor has \n\nThe Court's Pre-Trial Chambers have \n\nThe Lubanga and Katanga-Chui trials in the situation of the DR Congo are concluded. Mr Lubanga and Mr Katanga were convicted and sentenced to 14 and 12 years imprisonment, respectively, whereas Mr Chui was acquitted.\n\nThe Bemba trial in the Central African Republic situation is concluded. Mr Bemba was convicted on two counts of crimes against humanity and three counts of war crimes. This marked the first time the ICC convicted someone of sexual violence as they added rape to his conviction.\n\nTrials in the Ntaganda case (DR Congo), the Bemba et al.  case and the Laurent Gbagbo-Blé Goudé trial in the Côte d'Ivoire situation are ongoing. The Banda trial in the situation of Darfur, Sudan, was scheduled to begin in 2014 but the start date was vacated. Charges against Dominic Ongwen in the Uganda situation and Ahmed al-Faqi in the Mali situation have been confirmed; both are awaiting their trials.\n\nInvestigations and preliminary examinations\n\nCurrently, the Office of the Prosecutor has \n\nNotes\n\nRelationships\n\nUnited Nations\n\nUnlike the International Court of Justice, the ICC is legally independent from the United Nations. However, the Rome Statute grants certain powers to the United Nations Security Council, which limits its functional independence. Article 13 allows the Security Council to refer to the Court situations that would not otherwise fall under the Court's jurisdiction (as it did in relation to the situations in Darfur and Libya, which the Court could not otherwise have prosecuted as neither Sudan nor Libya are state parties). Article 16 allows the Security Council to require the Court to defer from investigating a case for a period of 12 months.Article 16 of the [http://legal.un.org/icc/statute/99_corr/cstatute.htm Rome Statute]. Accessed 20 March 2008. Such a deferral may be renewed indefinitely by the Security Council. This sort of an arrangement gives the ICC some of the advantages inhering in the organs of the United Nations such as using the enforcement powers of the Security Council, but it also creates a risk of being tainted with the political controversies of the Security Council.\n\nThe Court cooperates with the UN in many different areas, including the exchange of information and logistical support.International Criminal Court, 1 February 2007.  . Accessed 1 February 2007. The Court reports to the UN each year on its activities,International Criminal Court, August 2006.  . Accessed 14 May 2007. and some meetings of the Assembly of States Parties are held at UN facilities. The relationship between the Court and the UN is governed by a \"Relationship Agreement between the International Criminal Court and the United Nations\".. Retrieved 23 November 2006.Coalition for the International Criminal Court, 12 November 2004.  . Accessed 23 November 2006.\n\nNongovernmental organizations\n\nDuring the 1970s and 1980s, international human rights and humanitarian Nongovernmental Organizations (or NGOs) began to proliferate at exponential rates. Concurrently, the quest to find a way to punish international crimes shifted from being the exclusive responsibility of legal experts to being shared with international human rights activism.\n\nNGOs helped birth the ICC through advocacy and championing for the prosecution of perpetrators of crimes against humanity. NGOs closely monitor the organization's declarations and actions, ensuring that the work that is being executed on behalf of the ICC is fulfilling its objectives and responsibilities to civil society. According to Benjamin Schiff, \"From the Statute Conference onward, the relationship between the ICC and the NGOs has probably been closer, more consistent, and more vital to the Court than have analogous relations between NGOs and any other international organization.\"\n\nThere are a number of NGOs working on a variety of issues related to the ICC. The NGO Coalition for the International Criminal Court has served as a sort of umbrella for NGOs to coordinate with each other on similar objectives related to the ICC. The CICC has 2,500 member organizations in 150 different countries. The original steering committee included representatives from the World Federalist Movement, the International Commission of Jurists, Amnesty International, the Lawyers Committee for Human Rights, Human Rights Watch, Parliamentarians for Global Action, and No Peace Without Justice. Today, many of the NGOs with which the ICC cooperates are members of the CICC. These organizations come from a range of backgrounds, spanning from major international NGOs such as Human Rights Watch and Amnesty International, to smaller, more local organizations focused on peace and justice missions. Many work closely with states, such as the International Criminal Law Network, founded and predominantly funded by the Hague municipality and the Dutch Ministries of Defense and Foreign Affairs. The CICC also claims organizations that are themselves federations, such as the International Federation of Human Rights Leagues (FIDH).\n\nCICC members ascribe to three principles that permit them to work under the umbrella of the CICC, so long as their objectives match them:\n*Promoting worldwide ratification and implementation of the Rome Statute of the ICC\n*Maintaining the integrity of the Rome Statute of the ICC, and\n*Ensuring the ICC will be as fair, effective and independent as possible\n\nThe NGOs that work under the CICC do not normally pursue agendas exclusive to the work of the Court, rather they may work for broader causes, such as general human rights issues, victims' rights, gender rights, rule of law, conflict mediation, and peace. The CICC coordinates their efforts to improve the efficiency of NGOs' contributions to the Court and to pool their influence on major common issues. From the ICC side, it has been useful to have the CICC channel NGO contacts with the Court so that its officials do not have to interact individually with thousands of separate organizations.\n\nNGOs have been crucial to the evolution of the ICC, as they assisted in the creation of the normative climate that urged states to seriously consider the Court's formation. Their legal experts helped shape the Statute, while their lobbying efforts built support for it. They advocate Statute ratification globally and work at expert and political levels within member states for passage of necessary domestic legislation. NGOs are greatly represented at meetings for the Assembly of States Parties, and they use the ASP meetings to press for decisions promoting their priorities. Many of these NGOs have reasonable access to important officials at the ICC because of their involvement during the Statute process. They are engaged in monitoring, commenting upon, and assisting in the ICC's activities.\n\nThe ICC often depends on NGOs to interact with local populations. The Registry Public Information Office personnel and Victims Participation and Reparations Section officials hold seminars for local leaders, professionals and the media to spread the word about the Court. These are the kinds of events that are often hosted or organized by local NGOs. Because there can be challenges with determining which of these NGOs are legitimate, CICC regional representatives often have the ability to help screen and identify trustworthy organizations.\n\nHowever, NGOs are also \"sources of criticism, exhortation and pressure upon\" the ICC. The ICC heavily depends on NGOs for its operations. Although NGOs and states cannot directly impact the judicial nucleus of the organization, they can impart information on crimes, can help locate victims and witnesses, and can promote and organize victim participation. NGOs outwardly comment on the Court's operations, \"push for expansion of its activities especially in the new justice areas of outreach in conflict areas, in victims' participation and reparations, and in upholding due-process standards and defense 'equality of arms' and so implicitly set an agenda for the future evolution of the ICC.\" The relatively uninterrupted progression of NGO involvement with the ICC may mean that NGOs have become repositories of more institutional historical knowledge about the ICC than its national representatives, and have greater expertise than some of the organization's employees themselves. While NGOs look to mold the ICC to satisfy the interests and priorities that they have worked for since the early 1990s, they unavoidably press against the limits imposed upon the ICC by the states that are members of the organization. NGOs can pursue their own mandates, irrespective of whether they are compatible with those of other NGOs, while the ICC must respond to the complexities of its own mandate as well as those of the states and NGOs.\n\nAnother issue has been that NGOs possess \"exaggerated senses of their ownership over the organization and, having been vital to and successful in promoting the Court, were not managing to redefine their roles to permit the Court its necessary independence.\" Additionally, because there does exist such a gap between the large human rights organizations and the smaller peace-oriented organizations, it is difficult for ICC officials to manage and gratify all of their NGOs. \"ICC officials recognize that the NGOs pursue their own agendas, and that they will seek to pressure the ICC in the direction of their own priorities rather than necessarily understanding or being fully sympathetic to the myriad constraints and pressures under which the Court operates.\" Both the ICC and the NGO community avoid criticizing each other publicly or vehemently, although NGOs have released advisory and cautionary messages regarding the ICC. They avoid taking stances that could potentially give the Court's adversaries, particularly the US, more motive to berate the organization.\n\nCriticisms\n\nAccusations of Western imperialism from Africa\n\nThe ICC has been accused of bias and as being a tool of Western imperialism, only punishing leaders from small, weak states while ignoring crimes committed by richer and more powerful states.https://www.reuters.com/article/2011/01/30/ozatp-africa-icc-idAFJOE70T01R20110130 African Union accuses ICC prosecutor of bias This sentiment has been expressed particularly by African leaders due to an alleged disproportionate focus of the Court on Africa, while it claims to have a global mandate; until January 2016, all nine situations which the ICC had been investigating were in African countries.Africa and the International Criminal Court: A drag net that catches only small fish?, Nehanda Radio, By William Muchayi, 24 September 2013, http://nehandaradio.com/2013/09/24/africa-and-the-international-criminal-court-a-drag-net-that-catches-only-small-fish/[http://www.france24.com/en/20120315-lubanga-kony-icc-africans-international-justice-hague-syria-congo Europe - From Lubanga to Kony, is the ICC only after Africans?]. France 24 (15 March 2012). Retrieved on 28 April 2014.\n\nThe prosecution of Kenyan Deputy President William Ruto and President Uhuru Kenyatta (both charged before coming into office) led to the Kenyan parliament passing a motion calling for Kenya's withdrawal from the ICC, and the country called on the other 33 African states party to the ICC to withdraw their support, an issue which was discussed at a special African Union (AU) summit in October 2013.\n\nThough the ICC has denied the charge of disproportionately targeting African leaders, and claims to stand up for victims wherever they may be, Kenya was not alone in criticising the ICC. Sudanese President Omar al-Bashir visited Kenya, South Africa, China, Nigeria, Saudi Arabia, United Arab Emirates, Egypt, Ethiopia, Qatar and several other countries despite an outstanding ICC warrant for his arrest but was not arrested; he said that the charges against him are \"exaggerated\" and that the ICC was a part of a \"Western plot\" against him. Ivory Coast’s government opted not to transfer former first lady Simone Gbagbo to the court but to instead try her at home. Rwanda’s ambassador to the African Union, Joseph Nsengimana, argued that \"It is not only the case of Kenya. We have seen international justice become more and more a political matter.\" Ugandan President Yoweri Museveni accused the ICC of \"mishandling complex African issues.\" Ethiopian Prime Minister Hailemariam Desalegn, at the time AU chairman, told the UN General Assembly at the General debate of the sixty-eighth session of the United Nations General Assembly: \"The manner in which the ICC has been operating has left a very bad impression in Africa. It is totally unacceptable.\"\n\nAU withdrawal proposal\n\nSouth African President Jacob Zuma said the perceptions of the ICC as \"unreasonable\" led to the calling of the special AU summit on 13 October 2015. Botswana is a notable supporter of the ICC in Africa. At the summit, the AU did not endorse the proposal for a mass withdrawal from the ICC due to lack of support for the idea.  However, the summit did conclude that serving heads of state should not be put on trial and that the Kenyan cases should be deferred. Ethiopian Foreign Minister Tedros Adhanom said: \"We have rejected the double standard that the ICC is applying in dispensing international justice.\"[http://www.aljazeera.com/news/africa/2013/10/africans-urge-icc-not-try-heads-state-201310125566632803.html Africans urge ICC not to try heads of state - Africa]. Al Jazeera English. Retrieved on 28 April 2014. Despite these calls, the ICC went ahead with requiring William Ruto to attend his trial.[http://www.aljazeera.com/news/africa/2013/10/icc-rules-kenya-vp-must-attend-his-trial-201310258280911718.html ICC rules Kenya VP must attend his trial - Africa]. Al Jazeera English. Retrieved on 28 April 2014. The UNSC was then asked to consider deferring the trials of Kenyatta and Ruto for a year,[http://www.aljazeera.com/indepth/features/2013/11/africans-push-un-call-off-racist-court-2013111451110131757.html Africans push UN to call off 'racist' court - Features]. Al Jazeera English. Retrieved on 28 April 2014. but this was rejected. In November, the ICC's Assembly of State Parties responded to Kenya's calls for an exemption for sitting heads of state by agreeing to consider amendments to the Rome Statute to address the concerns.\n\nOn 7 October 2016, Burundi announced that it would leave the ICC, after the court began investigating political violence in that nation. In the subsequent two weeks, South Africa and Gambia also announced their intention to leave the court, with Kenya and Namibia reportedly also considering departure. All three nations cited the fact that all 39 people indicted by the court over its history have been African and that the court has made no effort to investigate war crimes tied to the 2003 invasion of Iraq.  However, following Gambia's presidential election later that year, which ended the long rule of Yahya Jammeh, Gambia rescinded its withdrawal notification. The High Court of South Africa ruled on 2 February 2017 that the South African government's notice to withdraw was unconstitutional and invalid. On 7 March 2017 the South African government formally revoked its intention to withdraw; however, the ruling ANC revealed on 5 July 2017 that its intention to withdraw stands.\n\nChecks and balances\n\nThe United States Department of State argues that there are \"insufficient checks and balances on the authority of the ICC prosecutor and judges\" and \"insufficient protection against politicized prosecutions or other abuses\".  The current law in the United States on the ICC is the American Service-Members' Protection Act (ASPA), 116 Stat. 820, The ASPA authorizes the President of the United States to use \"all means necessary and appropriate to bring about the release of any U.S. or allied personnel being detained or imprisoned by, on behalf of, or at the request of the International Criminal Court.\" This authorization has led the act to be nicknamed the \"Hague Invasion Act\",Human Rights Watch, \"[https://www.hrw.org/en/news/2002/08/03/us-hague-invasion-act-becomes-law U.S.: 'Hague Invasion Act' Becomes Law]\". 3 August 2002. Accessed 8 January 2007.John Sutherland, \"[https://www.theguardian.com/Archive/Article/0,4273,4456801,00.html Who are America's real enemies?]\". The Guardian, 8 July 2002. Accessed 8 January 2007. because the freeing of U.S. citizens by force might be possible only through military action.\n\nConcerning the independent Office of Public Counsel for the Defence (OPCD), Thomas Lubanga's defence team say they were given a smaller budget than the Prosecutor and that evidence and witness statements were slow to arrive.\n\nLimitations\n\nLimitations exist for the ICC. The Human Rights Watch (HRW) reported that the ICC's prosecutor team takes no account of the roles played by the government in the conflict of Uganda, Rwanda or Congo. This led to a flawed investigation, because the ICC did not reach the conclusion of its verdict after considering the governments’ position and actions in the conflict.\n\nUnintentional consequences \n\nResearch suggests that prosecutions of leaders in the ICC makes dictators less likely to peacefully step down. It is also argued that justice is a means to peace: \"As a result, the ICC has been used as a means\nof intervention in ongoing conflicts with the expectation that the indictments, arrests, and\ntrials of elite perpetrators have deterrence and preventive effects for atrocity crimes.\nDespite these legitimate intentions and great expectations, there is little evidence of the\nefficacy of justice as a means to peace\".Alana Tiemessen, The International Criminal Court and the lawfare of judicial intervention, International Relations Vol. 30, No. 4, December 2016.\n\nState cooperation \n\nThat the ICC cannot mount successful cases without state cooperation is problematic for several reasons. It means that the ICC acts inconsistently in its selection of cases, is prevented from taking on hard cases and loses legitimacy. It also gives the ICC less deterrent value, as potential perpetrators of war crimes know that they can avoid ICC judgment by taking over government and refusing to cooperate.\n\nQuestioning the true application of the principle of complementarity \n\nThe fundamental principle of complementarity of the ICC Rome Statute is often taken for granted in the legal analysis of international criminal law and its jurisprudence. Initially the thorny issue of the actual application of the complementarity principle arose in 2008, when William Schabas published his monumental paper.Schabas, W.A., ‘Complementarity in Practice’: Some Uncomplimentary Thoughts, Crim Law Forum (2008) 19: 5. https://doi.org/10.1007/s10609-007-9054-5 However, despite Schabas' theoretical impact, no substantive research was made by other scholars on this issue for quite some time. In June 2017, Victor Tsilonis advanced the same criticism which is reinforced by events, practices of the Office of the Prosecutor and ICC cases in the [http://crime-in-crisis.com/en/ Essays] in Honour of Nestor Courakis. His paper essentially argues that the Αl‐Senussi case arguably is the first instance of the complementarity principle's actual implementation eleven whole years after the ratification of the Rome Statute of the International Criminal Court.[http://crime-in-crisis.com/en/?p=305 Victor Tsilonis, “The Awakening Hypothesis of the Complementarity Principle”, in C.D. Spinellis, Nikolaos Theodorakis, Emmanouil Billis, George Papadimitrakopoulos (eds.), EUROPE IN CRISIS: CRIME, CRIMINAL JUSTICE AND THE WAY FORWARD, ESSAYS IN HONOUR OF NESTOR COURAKIS, Volume II: Essays in English, French, German, and Italian, (Athens: Ant. N. Sakkoulas Publications), (2017), pp. 1257-1303.]\n\nOn the other hand, the Chief Prosecutor, Fatou Bensouda, has invoked recently the principle of complementarity in the situation between Russia and Georgia in\nOssetia region.Situation in Georgia, Public Document with Confidential, EX PARTE, Annexes A, B, C, D.2, E.3, E.7, E.9, F, H and Public Annexes 1, D.1, E.1, E.2, E.4, E.5, E.6, E.8, G, I, J, ICC‐01/15‐4 13‐10‐2015 1/160 EO PT, pp. 132‐133, 150‐151, , 10 April 2017. Moreover, following the threats of certain African states (initially Burundi, Gambia and South Africa) to withdraw their ratifications, Bensouda again referred to the principle of complementarity as a core principle of ICC’s jurisdiction and has more extensively focused on the principle’s application on the latest Office of The Prosecutor’s Report on Preliminary Examination Activities 2016.Statement of the Prosecutor of the International Criminal Court, Ms Fatou Bensouda, regarding the situation in the Kasaï provinces, Democratic Republic of theCongo, 31 March 2017, , 10 April 2017. International Criminal Court. http://en.wikipedia.org/?curid=14880."
  }
}
