{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14858",
  "eid" : "18260000-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778549760,
  "textBody" : "Iain Banks (16 February 1954 – 9 June 2013) was a Scottish author. He wrote mainstream fiction under the name Iain Banks and science fiction as Iain M. Banks, including the initial of his adopted middle name Menzies.\n\nAfter the publication and success of The Wasp Factory (1984), Banks began to write on a full-time basis. His first science fiction book, Consider Phlebas, was released in 1987, marking the start of the Culture series. His books have been adapted for theatre, radio and television. In 2008, The Times named Banks in their list of \"The 50 greatest British writers since 1945\". In April 2013, Banks announced that he had inoperable cancer and was unlikely to live beyond a year. He died on 9 June 2013.\n\nEarly life\n\nBanks was born in Dunfermline, Fife, to a mother who was a professional ice skater and a father who was an officer in the Admiralty. An only child, Banks lived in North Queensferry until the age of nine, near the naval dockyards in Rosyth where his father was based. Banks's family then moved to Gourock due to the requirements of his father's work. When someone introduced him to science fiction by giving him Kemlo and the Zones of Silence, he continued reading the Kemlo series which made him want to write science fiction himself.[http://efanzines.com/Banksoniain/Banksoniain19.pdf The Banksoniain #19 - eFanzines.com] After attending Gourock and Greenock High Schools, Banks studied English, philosophy and psychology at the University of Stirling (1972–1975).\n\nAfter graduation Banks chose a succession of jobs that left him free to write in the evenings. These posts supported his writing throughout his twenties and allowed him to take long breaks between contracts, during which time he travelled through Europe and North America. He was an expediter analyser for IBM, a technician for the British Steel Corporation and a costing clerk for a Chancery Lane, London, law firm during this period of his life.\n\nCareer\n\nWriting career\n\nBanks decided to become a writer at the age of 11. He completed his first novel The Hungarian Lift-Jet at 16 and his second novel TTR (aka The Tashkent Rambler) during his first year at Stirling University in 1972.[https://books.google.com/books?id\nU9J7BwAAQBAJ&pgPA24&dq\n%22also+known+in+its+abbreviated+form,+TTR%22&hlno&sa\nX&ved0ahUKEwjf0_fcv63QAhWLCiwKHTSyCIQQ6AEIJjAA#v\nonepage&q%22also%20known%20in%20its%20abbreviated%20form%2C%20TTR%22&f\nfalse The Culture Series of Iain M. Banks: A Critical Introduction] Though he considered himself primarily a science fiction author, his lack of success at being published as such led him to pursue mainstream fiction, resulting in his first published novel The Wasp Factory, which was published in 1984 when he was thirty. After the publication and success of The Wasp Factory, Banks began to write full-time. His editor at Macmillan, James Hale, advised him to write one book a year and Banks agreed to this schedule.\n\nHis second novel Walking on Glass was published in 1985. The Bridge followed in 1986, and Espedair Street, published in 1987, was later broadcast as a series on BBC Radio 4. His first published science fiction book Consider Phlebas was released in 1987 and was the first of several novels of the acclaimed Culture series. Banks cited Robert A. Heinlein, Isaac Asimov, Arthur C. Clarke, Brian Aldiss, M. John Harrison and Dan Simmons as literary influences.  The Crow Road, published in 1992, was adapted as a BBC television series. Banks continued to write both science fiction and mainstream novels, with his final novel The Quarry published in June 2013, the month of his death.\n\nBanks published work under two names. His parents had intended to name him \"Iain Menzies Banks\", but his father made a mistake when registering the birth and \"Iain Banks\" became the officially registered name. Despite this error, Banks used the middle name and submitted The Wasp Factory for publication as \"Iain M. Banks\". Banks's editor inquired about the possibility of omitting the 'M' as it appeared \"too fussy\" and the potential existed for confusion with Rosie M. Banks, a romantic novelist in the Jeeves novels by P.G. Wodehouse; Banks agreed to the omission. After three mainstream novels, Banks's publishers agreed to publish his first science fiction (SF) novel Consider Phlebas. To create a distinction between the mainstream and SF novels, Banks suggested the return of the 'M' to his name, and it was used in all of his science fiction works.\n\nBy his death in June 2013 Banks had published 26 novels. His twenty-seventh novel The Quarry was published posthumously. His final work, a collection of poetry, was released in February 2015. In an interview January 2013, he also mentioned he had the plot idea for another novel in the Culture series, which would most likely be his next book and planned for publication in 2014.[https://www.theatlantic.com/entertainment/archive/2013/01/the-future-might-be-a-hoot-how-iain-m-banks-imagines-utopia/267211/ 'The Future Might Be a Hoot': How Iain M. Banks Imagines Utopia]\n\nHe wrote in different categories, but enjoyed writing science fiction the most.\n\nIn September 2012 Banks was revealed as one of the Guests of Honour at the 2014 World Science Fiction Convention, Loncon 3.\n\nRadio and television\n\nBanks was the subject of The Strange Worlds of Iain Banks South Bank Show (1997), a television documentary that examined his mainstream writing, and was also an in-studio guest for the final episode of Marc Riley's Rocket Science radio show, broadcast on BBC Radio 6 Music.\n\nAn audio version of The Business, set to contemporary music, arranged by Paul Oakenfold, was broadcast in October 1999 on Galaxy Fm as the tenth Urban Soundtracks. \n\nA radio adaptation of Banks's The State of the Art was broadcast on BBC Radio 4 in 2009; the adaptation was written by Paul Cornell and the production was directed/produced by Nadia Molinari. In 1998 Espedair Street was dramatised as a serial for Radio 4, presented by Paul Gambaccini in the style of a Radio 1 documentary.\n\nIn 2011 Banks was featured on the BBC Radio 4 programme Saturday Live. Banks reaffirmed his atheism during his Saturday Live appearance, whereby he explained that death is an important \"part of the totality of life\" and should be treated realistically, instead of feared.\n\nBanks appeared on the BBC television programme Question Time, a show that features political discussion. In 2006 Banks captained a team of writers to victory in a special series of BBC Two's University Challenge. Banks also won a 2006 edition of BBC One's Celebrity Mastermind; the author selected \"Malt whisky and the distilleries of Scotland\" as his specialist subject.\n\nHis final interview was with Kirsty Wark and was broadcast as Iain Banks: Raw Spirit on BBC2 Scotland on Wednesday 12 June 2013.BBC Website http://www.bbc.co.uk/programmes/b02xf70k>\n\nBBC One Scotland and BBC2 broadcast an adaptation of his novel Stonemouth in June 2015.\n\nTheatre\n\nBanks was involved in the theatre production The Curse of Iain Banks that was written by Maxton Walker and was performed at the Edinburgh Fringe festival in 1999.  Banks collaborated with the play's soundtrack composer Gary Lloyd frequently, including on a collection of songs they co-composed in tribute to the fictional band 'Frozen Gold' from Banks's novel 'Espedair Street'.  Lloyd also composed the score for a spoken word and musical production of the Banks novel The Bridge which Banks himself voiced and featured a cast of forty musicians (released on cd by Codex Records in 1996).  Lloyd recorded Banks for inclusion in the play as a disembodied voice appearing as himself in one of the cast member's dreams.  Lloyd explained his collaboration with Banks on their first versions of 'Espedair Street' (subsequent versions are dated from between 2005 and 2013) in a Guardian article prior to the opening of The Curse of Iain Banks:\n\nWhen he [Banks] first played them to me, I think he was worried that they might not be up to scratch (some of them dated back to 1973 and had never been heard). He needn't have worried. They're fantastic. We're slaving away to get the songs to the stage where we can go into the studio and make a demo. Iain bashes out melodies on his state-of-the-art Apple Mac in Edinburgh and sends them down to me in Chester where I put them onto my Atari.\n\nPolitics\n\nBanks's political position has been described as \"left of centre\", and he was an Honorary Associate of the National Secular Society and a Distinguished Supporter of the Humanist Society  Scotland. As a signatory to the Declaration of Calton Hill, he was an open supporter of Scottish independence. In November 2012, Banks supported the campaign group that emerged from the Radical Independence Conference that was held during that month. Banks explained that the Scottish independence movement was motivated by co-operation and \"just seem to be more communitarian than the consensus expressed by the UK population as a whole\".\n\nIn late 2004, Banks was a member of a group of British politicians and media figures who campaigned to have Prime Minister Tony Blair impeached following the 2003 invasion of Iraq. In protest he cut up his passport and posted it to 10 Downing Street—in a Socialist Review interview, Banks explained that his passport protest occurred after he \"abandoned the idea of crashing my Land Rover through the gates of Fife dockyard, after spotting the guys armed with machine guns.\" Banks relayed his concerns about the invasion of Iraq in his book Raw Spirit, and the principal protagonist (Alban McGill) in the novel The Steep Approach to Garbadale confronts another character with arguments of a similar nature.\n\nIn 2010 Banks called for a cultural and educational boycott of Israel after the Gaza flotilla raid incident. In a letter to The Guardian newspaper, Banks stated that he had instructed his agent to turn down any further book translation deals with Israeli publishers:\n\nAppeals to reason, international law, U.N. resolutions and simple human decency meanit is now obviousnothing to Israel ... I would urge all writers, artists and others in the creative arts, as well as those academics engaging in joint educational projects with Israeli institutions, to consider doing everything they can to convince Israel of its moral degradation and ethical isolation, preferably by simply having nothing more to do with this outlaw state.\n\nAn extract from Banks's contribution to the written collection Generation Palestine: Voices from the Boycott, Divestment and Sanctions Movement, entitled \"Our People\", was published in The Guardian in the wake of the author's cancer revelation. The extract relays the author's support for the Boycott, Divestment and Sanctions (BDS) campaign that was issued by a Palestinian civil society against Israel until the country complies with what they hold are international law and Palestinian rights, that commenced in 2005 and applies the lessons from Banks's experience with South Africa's apartheid era. The continuation of Banks's boycott of Israeli publishers for the sale of the rights to his novels was also confirmed in the extract and Banks further explained, \"I don't buy Israeli-sourced products or food, and my partner and I try to support Palestinian-sourced products wherever possible.\"\n\nIn 2002, Banks endorsed the Scottish Socialist Party.https://www.scottishsocialistparty.org/iain-banks-the-ssp-gets-my-vote-and-i-buy-the-scottish-socialist-voice/\n\nPersonal life\n\nBanks met his first wife, Annie, in London before the 1984 release of his first book. The couple lived in Faversham in the south of England, then split up in 1988. Banks returned to Edinburgh and dated another woman for two years until she left him. Iain and Annie reconciled a year later and moved to Fife. They got married in Hawaii in 1992. In 2007, after 15 years of marriage, they announced their separation.\n\nIn 1998 Banks had been in a near-fatal accident when his car rolled off the road. In February 2007, Banks sold his extensive car collection, including a 3.2-litre Porsche Boxster, a Porsche 911 Turbo, a 3.8-litre Jaguar Mark II, a 5-litre BMW M5 and a daily use diesel Land Rover Defender whose power he had boosted by about 50%. Banks exchanged all of the vehicles for a Lexus RX 400h hybrid – later replaced by a diesel Toyota Yaris – and said in the future he would fly only in emergencies.\n\nIn April 2012 Banks became the \"Acting Honorary Non-Executive Figurehead President Elect pro tem (trainee)\" of the Science Fiction Book Club based in London. The title was his own creation and on 3 October 2012 Banks accepted a T-shirt decorated with this title.\n\nBanks lived in North Queensferry, on the north side of the Firth of Forth, with the author and founder of the Dead by Dawn film festival Adele Hartley. Banks and Hartley commenced their relationship in 2006, and married on 29 March 2013 after he asked her to \"do me the honour of becoming my widow\".\n\nIllness and death\n\nOn 3 April 2013, Banks announced on his website, and one set up by him and some friends that he had been diagnosed with terminal cancer of the gallbladder and was unlikely to live beyond a year. In his announcement, Banks stated that he would be withdrawing from all public engagements and that The Quarry would be his last novel. The dates of publication of The Quarry were brought forward at Banks's request, to 20 June 2013 in the UK and 25 June 2013 in the US. Banks died on 9 June 2013.\n\nRemembrance and tribute\n\nBanks's publisher stated that the author was \"an irreplaceable part of the literary world\", a sentiment that was reaffirmed by fellow Scottish author and friend since secondary school Ken MacLeod, who observed that Banks's death \"left a large gap in the Scottish literary scene as well as the wider English-speaking world.\" British author Charles Stross wrote that \"One of the giants of 20th and 21st century Scottish literature has left the building.\" Authors, including Neil Gaiman, Ian Rankin, Alastair Reynolds, and David Brin also paid tribute to Banks, in their blogs and elsewhere.\n\nThe asteroid 5099 Iainbanks was named after him shortly after his death. On 23 January 2015, SpaceX's CEO and Chief Designer Elon Musk named two of the company's autonomous spaceport drone ships Just Read The Instructions and Of Course I Still Love You, after ships from Banks's novel The Player of Games.\n\nOn July 20, 2017, Jeph Jacques completed his Alice Grove series, and dedicated it to the memory of Iain Banks.\n\nAwards and nominations\n\nIain Banks received the following literary awards and nominations:\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\n* \n* \n* \n* \n\nBibliography\n\nNon-SF works \n\nBanks' non-SF work comprises fourteen novels and one non-fiction book. Many of his novels contain elements of autobiography, and feature various locations in his native Scotland. Raw Spirit (subtitled In Search of the Perfect Dram) is a travel book of Banks' visits to the distilleries of Scotland in search of the finest whisky, including his musings on other subjects such as cars and politics.\n\nFiction\n\n*The Wasp Factory (1984). London: Macmillan. \n*Walking on Glass (1985). London: Macmillan. \n*The Bridge (1986). London: Macmillan. \n*Espedair Street (1987). London: Macmillan. . Adapted for BBC radio in 1998 (directed by Dave Batchelor).\n*Canal Dreams (1989). London: Macmillan.   \n*The Crow Road (1992). London: Scribners. . Adapted for BBC TV in 1996 (directed by Gavin Millar).\n*Complicity (1993). London: Little, Brown Book Group. . Filmed in 2000 (directed by Gavin Millar); retitled Retribution for its US DVD/video release.\n*Whit (1995). London: Little, Brown Book Group.  \n*A Song of Stone (1997). London: Abacus. \n*The Business (1999). London: Little, Brown Book Group. .\n*Dead Air (2002). London: Little, Brown Book Group.  \n*The Steep Approach to Garbadale (2007). London: Little, Brown Book Group. \n*Stonemouth (2012). London: Little, Brown Book Group. . Adapted for BBC TV for broadcast in 2015 (directed by Charles Martin.)\n*The Quarry (2013). London: Little, Brown Book Group. \n\nNon-fiction\n\n*Raw Spirit (2003). London: Century.  – a travelogue of Scotland and its whisky distilleries.\n*Poems (with Ken MacLeod) (2015). London: Little, Brown Group. \n\nScience fiction\n\nBanks wrote thirteen SF novels, nine of which were part of the Culture series; and a short story collection called The State of the Art (1991) includes some stories set in the same universe. These works focus upon characters that are usually on the margins of the Culture, a post-scarcity anarchist utopia; Originally posted on rec.arts.sf newsgroup. in the same universe are other civilizations, with which the Culture sometimes enters into conflict, and sentient artificial intelligences.\n\nThe Culture novels\n\n#Consider Phlebas (1987). London: Macmillan.  \n#The Player of Games (1988). London: Macmillan. \n#Use of Weapons (1990). London: Orbit. \n#Excession (1996). London: Orbit. \n#Inversions (1998). London: Orbit. \n#Look to Windward (2000). London: Orbit. \n#Matter (2008). London: Orbit. \n#Surface Detail (2010). London: Orbit. \n#The Hydrogen Sonata (2012). London: Orbit. \n\nOther novels\n\n*Against a Dark Background (1993). London: Orbit. \n*Feersum Endjinn (1994). London: Orbit. \n*The Algebraist (2004). London: Orbit. \n*Transition (2009). London: Little, Brown Book Group. . (Published in the United States as Iain M. Banks.)\n\nShort fiction collections\n\n*The State of the Art (1991). London: Orbit. \n** Includes three short works set in the Culture universe. It also includes works of fiction more characteristic of Banks's writing published as Iain Banks. A radio version of the title story was transmitted by Radio 4 in 2009.\n* The Spheres (Birmingham Science Fiction Group, 2010)\n** Includes 'The Spheres', excised from the original draft of Transition; and 'The Secret Courtyard', excised from Matter. Limited edition of 500, to mark Novacon 40.\n\nIntroductions\n\nBanks wrote introductions for works by other writers including:\n* Viriconium (1988) by M. John Harrison, the Unwin edition, .\n* The Adventures of Luther Arkwright: Book 3, Götterdämmerung (1989) by Bryan Talbot from Proutt Publishing, .\n* The Orbit Science Fiction Yearbook Three (1990) edited by David S. Garnett, .\n* The Human Front (2001) by Ken MacLeod, the PS Publishing edition,  (hbk) and  (pbk).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Iain Banks" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14858" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Iain Banks (16 February 1954 – 9 June 2013) was a Scottish author. He wrote mainstream fiction under the name Iain Banks and science fiction as Iain M. Banks, including the initial of his adopted middle name Menzies.\n\nAfter the publication and success of The Wasp Factory (1984), Banks began to write on a full-time basis. His first science fiction book, Consider Phlebas, was released in 1987, marking the start of the Culture series. His books have been adapted for theatre, radio and television. In 2008, The Times named Banks in their list of \"The 50 greatest British writers since 1945\". In April 2013, Banks announced that he had inoperable cancer and was unlikely to live beyond a year. He died on 9 June 2013.\n\nEarly life\n\nBanks was born in Dunfermline, Fife, to a mother who was a professional ice skater and a father who was an officer in the Admiralty. An only child, Banks lived in North Queensferry until the age of nine, near the naval dockyards in Rosyth where his father was based. Banks's family then moved to Gourock due to the requirements of his father's work. When someone introduced him to science fiction by giving him Kemlo and the Zones of Silence, he continued reading the Kemlo series which made him want to write science fiction himself.[http://efanzines.com/Banksoniain/Banksoniain19.pdf The Banksoniain #19 - eFanzines.com] After attending Gourock and Greenock High Schools, Banks studied English, philosophy and psychology at the University of Stirling (1972–1975).\n\nAfter graduation Banks chose a succession of jobs that left him free to write in the evenings. These posts supported his writing throughout his twenties and allowed him to take long breaks between contracts, during which time he travelled through Europe and North America. He was an expediter analyser for IBM, a technician for the British Steel Corporation and a costing clerk for a Chancery Lane, London, law firm during this period of his life.\n\nCareer\n\nWriting career\n\nBanks decided to become a writer at the age of 11. He completed his first novel The Hungarian Lift-Jet at 16 and his second novel TTR (aka The Tashkent Rambler) during his first year at Stirling University in 1972.[https://books.google.com/books?id\nU9J7BwAAQBAJ&pgPA24&dq\n%22also+known+in+its+abbreviated+form,+TTR%22&hlno&sa\nX&ved0ahUKEwjf0_fcv63QAhWLCiwKHTSyCIQQ6AEIJjAA#v\nonepage&q%22also%20known%20in%20its%20abbreviated%20form%2C%20TTR%22&f\nfalse The Culture Series of Iain M. Banks: A Critical Introduction] Though he considered himself primarily a science fiction author, his lack of success at being published as such led him to pursue mainstream fiction, resulting in his first published novel The Wasp Factory, which was published in 1984 when he was thirty. After the publication and success of The Wasp Factory, Banks began to write full-time. His editor at Macmillan, James Hale, advised him to write one book a year and Banks agreed to this schedule.\n\nHis second novel Walking on Glass was published in 1985. The Bridge followed in 1986, and Espedair Street, published in 1987, was later broadcast as a series on BBC Radio 4. His first published science fiction book Consider Phlebas was released in 1987 and was the first of several novels of the acclaimed Culture series. Banks cited Robert A. Heinlein, Isaac Asimov, Arthur C. Clarke, Brian Aldiss, M. John Harrison and Dan Simmons as literary influences.  The Crow Road, published in 1992, was adapted as a BBC television series. Banks continued to write both science fiction and mainstream novels, with his final novel The Quarry published in June 2013, the month of his death.\n\nBanks published work under two names. His parents had intended to name him \"Iain Menzies Banks\", but his father made a mistake when registering the birth and \"Iain Banks\" became the officially registered name. Despite this error, Banks used the middle name and submitted The Wasp Factory for publication as \"Iain M. Banks\". Banks's editor inquired about the possibility of omitting the 'M' as it appeared \"too fussy\" and the potential existed for confusion with Rosie M. Banks, a romantic novelist in the Jeeves novels by P.G. Wodehouse; Banks agreed to the omission. After three mainstream novels, Banks's publishers agreed to publish his first science fiction (SF) novel Consider Phlebas. To create a distinction between the mainstream and SF novels, Banks suggested the return of the 'M' to his name, and it was used in all of his science fiction works.\n\nBy his death in June 2013 Banks had published 26 novels. His twenty-seventh novel The Quarry was published posthumously. His final work, a collection of poetry, was released in February 2015. In an interview January 2013, he also mentioned he had the plot idea for another novel in the Culture series, which would most likely be his next book and planned for publication in 2014.[https://www.theatlantic.com/entertainment/archive/2013/01/the-future-might-be-a-hoot-how-iain-m-banks-imagines-utopia/267211/ 'The Future Might Be a Hoot': How Iain M. Banks Imagines Utopia]\n\nHe wrote in different categories, but enjoyed writing science fiction the most.\n\nIn September 2012 Banks was revealed as one of the Guests of Honour at the 2014 World Science Fiction Convention, Loncon 3.\n\nRadio and television\n\nBanks was the subject of The Strange Worlds of Iain Banks South Bank Show (1997), a television documentary that examined his mainstream writing, and was also an in-studio guest for the final episode of Marc Riley's Rocket Science radio show, broadcast on BBC Radio 6 Music.\n\nAn audio version of The Business, set to contemporary music, arranged by Paul Oakenfold, was broadcast in October 1999 on Galaxy Fm as the tenth Urban Soundtracks. \n\nA radio adaptation of Banks's The State of the Art was broadcast on BBC Radio 4 in 2009; the adaptation was written by Paul Cornell and the production was directed/produced by Nadia Molinari. In 1998 Espedair Street was dramatised as a serial for Radio 4, presented by Paul Gambaccini in the style of a Radio 1 documentary.\n\nIn 2011 Banks was featured on the BBC Radio 4 programme Saturday Live. Banks reaffirmed his atheism during his Saturday Live appearance, whereby he explained that death is an important \"part of the totality of life\" and should be treated realistically, instead of feared.\n\nBanks appeared on the BBC television programme Question Time, a show that features political discussion. In 2006 Banks captained a team of writers to victory in a special series of BBC Two's University Challenge. Banks also won a 2006 edition of BBC One's Celebrity Mastermind; the author selected \"Malt whisky and the distilleries of Scotland\" as his specialist subject.\n\nHis final interview was with Kirsty Wark and was broadcast as Iain Banks: Raw Spirit on BBC2 Scotland on Wednesday 12 June 2013.BBC Website http://www.bbc.co.uk/programmes/b02xf70k>\n\nBBC One Scotland and BBC2 broadcast an adaptation of his novel Stonemouth in June 2015.\n\nTheatre\n\nBanks was involved in the theatre production The Curse of Iain Banks that was written by Maxton Walker and was performed at the Edinburgh Fringe festival in 1999.  Banks collaborated with the play's soundtrack composer Gary Lloyd frequently, including on a collection of songs they co-composed in tribute to the fictional band 'Frozen Gold' from Banks's novel 'Espedair Street'.  Lloyd also composed the score for a spoken word and musical production of the Banks novel The Bridge which Banks himself voiced and featured a cast of forty musicians (released on cd by Codex Records in 1996).  Lloyd recorded Banks for inclusion in the play as a disembodied voice appearing as himself in one of the cast member's dreams.  Lloyd explained his collaboration with Banks on their first versions of 'Espedair Street' (subsequent versions are dated from between 2005 and 2013) in a Guardian article prior to the opening of The Curse of Iain Banks:\n\nWhen he [Banks] first played them to me, I think he was worried that they might not be up to scratch (some of them dated back to 1973 and had never been heard). He needn't have worried. They're fantastic. We're slaving away to get the songs to the stage where we can go into the studio and make a demo. Iain bashes out melodies on his state-of-the-art Apple Mac in Edinburgh and sends them down to me in Chester where I put them onto my Atari.\n\nPolitics\n\nBanks's political position has been described as \"left of centre\", and he was an Honorary Associate of the National Secular Society and a Distinguished Supporter of the Humanist Society  Scotland. As a signatory to the Declaration of Calton Hill, he was an open supporter of Scottish independence. In November 2012, Banks supported the campaign group that emerged from the Radical Independence Conference that was held during that month. Banks explained that the Scottish independence movement was motivated by co-operation and \"just seem to be more communitarian than the consensus expressed by the UK population as a whole\".\n\nIn late 2004, Banks was a member of a group of British politicians and media figures who campaigned to have Prime Minister Tony Blair impeached following the 2003 invasion of Iraq. In protest he cut up his passport and posted it to 10 Downing Street—in a Socialist Review interview, Banks explained that his passport protest occurred after he \"abandoned the idea of crashing my Land Rover through the gates of Fife dockyard, after spotting the guys armed with machine guns.\" Banks relayed his concerns about the invasion of Iraq in his book Raw Spirit, and the principal protagonist (Alban McGill) in the novel The Steep Approach to Garbadale confronts another character with arguments of a similar nature.\n\nIn 2010 Banks called for a cultural and educational boycott of Israel after the Gaza flotilla raid incident. In a letter to The Guardian newspaper, Banks stated that he had instructed his agent to turn down any further book translation deals with Israeli publishers:\n\nAppeals to reason, international law, U.N. resolutions and simple human decency meanit is now obviousnothing to Israel ... I would urge all writers, artists and others in the creative arts, as well as those academics engaging in joint educational projects with Israeli institutions, to consider doing everything they can to convince Israel of its moral degradation and ethical isolation, preferably by simply having nothing more to do with this outlaw state.\n\nAn extract from Banks's contribution to the written collection Generation Palestine: Voices from the Boycott, Divestment and Sanctions Movement, entitled \"Our People\", was published in The Guardian in the wake of the author's cancer revelation. The extract relays the author's support for the Boycott, Divestment and Sanctions (BDS) campaign that was issued by a Palestinian civil society against Israel until the country complies with what they hold are international law and Palestinian rights, that commenced in 2005 and applies the lessons from Banks's experience with South Africa's apartheid era. The continuation of Banks's boycott of Israeli publishers for the sale of the rights to his novels was also confirmed in the extract and Banks further explained, \"I don't buy Israeli-sourced products or food, and my partner and I try to support Palestinian-sourced products wherever possible.\"\n\nIn 2002, Banks endorsed the Scottish Socialist Party.https://www.scottishsocialistparty.org/iain-banks-the-ssp-gets-my-vote-and-i-buy-the-scottish-socialist-voice/\n\nPersonal life\n\nBanks met his first wife, Annie, in London before the 1984 release of his first book. The couple lived in Faversham in the south of England, then split up in 1988. Banks returned to Edinburgh and dated another woman for two years until she left him. Iain and Annie reconciled a year later and moved to Fife. They got married in Hawaii in 1992. In 2007, after 15 years of marriage, they announced their separation.\n\nIn 1998 Banks had been in a near-fatal accident when his car rolled off the road. In February 2007, Banks sold his extensive car collection, including a 3.2-litre Porsche Boxster, a Porsche 911 Turbo, a 3.8-litre Jaguar Mark II, a 5-litre BMW M5 and a daily use diesel Land Rover Defender whose power he had boosted by about 50%. Banks exchanged all of the vehicles for a Lexus RX 400h hybrid – later replaced by a diesel Toyota Yaris – and said in the future he would fly only in emergencies.\n\nIn April 2012 Banks became the \"Acting Honorary Non-Executive Figurehead President Elect pro tem (trainee)\" of the Science Fiction Book Club based in London. The title was his own creation and on 3 October 2012 Banks accepted a T-shirt decorated with this title.\n\nBanks lived in North Queensferry, on the north side of the Firth of Forth, with the author and founder of the Dead by Dawn film festival Adele Hartley. Banks and Hartley commenced their relationship in 2006, and married on 29 March 2013 after he asked her to \"do me the honour of becoming my widow\".\n\nIllness and death\n\nOn 3 April 2013, Banks announced on his website, and one set up by him and some friends that he had been diagnosed with terminal cancer of the gallbladder and was unlikely to live beyond a year. In his announcement, Banks stated that he would be withdrawing from all public engagements and that The Quarry would be his last novel. The dates of publication of The Quarry were brought forward at Banks's request, to 20 June 2013 in the UK and 25 June 2013 in the US. Banks died on 9 June 2013.\n\nRemembrance and tribute\n\nBanks's publisher stated that the author was \"an irreplaceable part of the literary world\", a sentiment that was reaffirmed by fellow Scottish author and friend since secondary school Ken MacLeod, who observed that Banks's death \"left a large gap in the Scottish literary scene as well as the wider English-speaking world.\" British author Charles Stross wrote that \"One of the giants of 20th and 21st century Scottish literature has left the building.\" Authors, including Neil Gaiman, Ian Rankin, Alastair Reynolds, and David Brin also paid tribute to Banks, in their blogs and elsewhere.\n\nThe asteroid 5099 Iainbanks was named after him shortly after his death. On 23 January 2015, SpaceX's CEO and Chief Designer Elon Musk named two of the company's autonomous spaceport drone ships Just Read The Instructions and Of Course I Still Love You, after ships from Banks's novel The Player of Games.\n\nOn July 20, 2017, Jeph Jacques completed his Alice Grove series, and dedicated it to the memory of Iain Banks.\n\nAwards and nominations\n\nIain Banks received the following literary awards and nominations:\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\n* \n* \n* \n* \n\nBibliography\n\nNon-SF works \n\nBanks' non-SF work comprises fourteen novels and one non-fiction book. Many of his novels contain elements of autobiography, and feature various locations in his native Scotland. Raw Spirit (subtitled In Search of the Perfect Dram) is a travel book of Banks' visits to the distilleries of Scotland in search of the finest whisky, including his musings on other subjects such as cars and politics.\n\nFiction\n\n*The Wasp Factory (1984). London: Macmillan. \n*Walking on Glass (1985). London: Macmillan. \n*The Bridge (1986). London: Macmillan. \n*Espedair Street (1987). London: Macmillan. . Adapted for BBC radio in 1998 (directed by Dave Batchelor).\n*Canal Dreams (1989). London: Macmillan.   \n*The Crow Road (1992). London: Scribners. . Adapted for BBC TV in 1996 (directed by Gavin Millar).\n*Complicity (1993). London: Little, Brown Book Group. . Filmed in 2000 (directed by Gavin Millar); retitled Retribution for its US DVD/video release.\n*Whit (1995). London: Little, Brown Book Group.  \n*A Song of Stone (1997). London: Abacus. \n*The Business (1999). London: Little, Brown Book Group. .\n*Dead Air (2002). London: Little, Brown Book Group.  \n*The Steep Approach to Garbadale (2007). London: Little, Brown Book Group. \n*Stonemouth (2012). London: Little, Brown Book Group. . Adapted for BBC TV for broadcast in 2015 (directed by Charles Martin.)\n*The Quarry (2013). London: Little, Brown Book Group. \n\nNon-fiction\n\n*Raw Spirit (2003). London: Century.  – a travelogue of Scotland and its whisky distilleries.\n*Poems (with Ken MacLeod) (2015). London: Little, Brown Group. \n\nScience fiction\n\nBanks wrote thirteen SF novels, nine of which were part of the Culture series; and a short story collection called The State of the Art (1991) includes some stories set in the same universe. These works focus upon characters that are usually on the margins of the Culture, a post-scarcity anarchist utopia; Originally posted on rec.arts.sf newsgroup. in the same universe are other civilizations, with which the Culture sometimes enters into conflict, and sentient artificial intelligences.\n\nThe Culture novels\n\n#Consider Phlebas (1987). London: Macmillan.  \n#The Player of Games (1988). London: Macmillan. \n#Use of Weapons (1990). London: Orbit. \n#Excession (1996). London: Orbit. \n#Inversions (1998). London: Orbit. \n#Look to Windward (2000). London: Orbit. \n#Matter (2008). London: Orbit. \n#Surface Detail (2010). London: Orbit. \n#The Hydrogen Sonata (2012). London: Orbit. \n\nOther novels\n\n*Against a Dark Background (1993). London: Orbit. \n*Feersum Endjinn (1994). London: Orbit. \n*The Algebraist (2004). London: Orbit. \n*Transition (2009). London: Little, Brown Book Group. . (Published in the United States as Iain M. Banks.)\n\nShort fiction collections\n\n*The State of the Art (1991). London: Orbit. \n** Includes three short works set in the Culture universe. It also includes works of fiction more characteristic of Banks's writing published as Iain Banks. A radio version of the title story was transmitted by Radio 4 in 2009.\n* The Spheres (Birmingham Science Fiction Group, 2010)\n** Includes 'The Spheres', excised from the original draft of Transition; and 'The Secret Courtyard', excised from Matter. Limited edition of 500, to mark Novacon 40.\n\nIntroductions\n\nBanks wrote introductions for works by other writers including:\n* Viriconium (1988) by M. John Harrison, the Unwin edition, .\n* The Adventures of Luther Arkwright: Book 3, Götterdämmerung (1989) by Bryan Talbot from Proutt Publishing, .\n* The Orbit Science Fiction Yearbook Three (1990) edited by David S. Garnett, .\n* The Human Front (2001) by Ken MacLeod, the PS Publishing edition,  (hbk) and  (pbk). Iain Banks. http://en.wikipedia.org/?curid=14858."
  }
}
