{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4237",
  "eid" : "cc18b360-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778422166,
  "textBody" : "Barnard College is a private women's liberal arts college in New York City, New York, United States. Founded in 1889 by Annie Nathan Meyer, who named it after Columbia University's 10th president, Frederick Barnard, it is one of the oldest women's colleges in the world.\n\nThe college was founded as a response to Columbia's refusal to admit women into their institution. Since 1900, Barnard has been affiliated with Columbia University. However, Barnard is legally and financially separate from the university.\n\nBarnard confers the Bachelor of Arts degree in about 50 areas of study. Students may also pursue elements of their education at Columbia University, the Juilliard School and The Jewish Theological Seminary also based in New York City. Barnard students share clubs, sports teams, academic buildings and more with Columbia. Barnard graduates receive Columbia University diplomas signed by the presidents of both institutions. Its  campus is located in the Manhattan neighborhood  of Morningside Heights, stretching along Broadway between 116th and 120th Streets. It is directly across from Columbia's campus and near several other academic institutions. The college is a member of the Seven Sisters, an association of seven prominent women's liberal arts colleges.\n\nHistory \n\n19th century and founding \n\nFor its first 229 years Columbia College of Columbia University admitted only men for undergraduate study. Barnard College was founded in 1889 as a response to Columbia's refusal to admit women into its institution.\n\nThe college was named after Frederick Augustus Porter Barnard, a deaf American educator and mathematician who served as the tenth president of Columbia from 1864 to 1889. He advocated equal educational privileges for men and women, preferably in a coeducational setting, and began proposing in 1879 that Columbia admit women. The board of trustees repeatedly rejected Barnard's suggestion, but in 1883 agreed to create a detailed syllabus of study for women. While they could not attend Columbia classes, those who passed examinations based on the syllabus would receive a degree. The first such woman graduate received her bachelor's degree in 1887. A former student of the program, Annie Meyer, and other prominent New York women persuaded the board in 1889 to create a women's college connected to Columbia.\n\nBarnard College's original 1889 home was a rented brownstone at 343 Madison Avenue, where a faculty of six offered instruction to 14 students in the School of Arts, as well as to 22 \"specials\", who lacked the entrance requirements in Greek and so enrolled in science. When Columbia University announced in 1892 its impending move to Morningside Heights, Barnard built a new campus on 119th-120th Streets with gifts from Mary E. Brinckerhoff, Elizabeth Milbank Anderson and Martha Fiske. Milbank, Brinckerhoff, and Fiske Halls, built in 1897–1898, were listed on the National Register of Historic Places in 2003.\n\nElla Weed supervised the college in its first four years; Emily James Smith succeeded her as Barnard's first dean. As the college grew it needed additional space, and in 1903 it received the three blocks south of 119th Street from Anderson who had purchased a former portion of the Bloomingdale Asylum site from the New York Hospital.Plimpton Papers, Barnard College Archives By the mid-20th century Barnard had succeeded in its original goal of providing a top tier education to women. Between 1920 and 1974, only the much larger Hunter College and University of California, Berkeley produced more women graduates who later received doctorate degrees. Students' Hall, now known as Barnard Hall, was built in 1916. Brooks and Hewitt Halls were built in 1906–1907 and 1926–1927, respectively. They were listed on the National Register of Historic Places in 2003. Jessica Finch is credited with coining the phrase, \"current events,\" while teaching at Barnard College in the 1890s.\n\nAcademics \n\nBarnard confers the Bachelor of Arts degree in about 50 areas of study. Joint programs for the Bachelor of Science and other degrees exist with Columbia University, Juilliard School, and The Jewish Theological Seminary. The six most popular majors at the college are English, psychology, political science, economics, history, and biology.\n\nThe liberal arts requirements are called the Nine Ways of Knowing. Students must take one year of one laboratory science, study a single foreign language for four semesters, and complete one 3-credit course in each of the following categories: reason and value, social analysis, historical studies, cultures in comparison, quantitative and deductive reasoning, literature, and visual and performing arts. The use of AP or IB credit to fulfill these requirements is very limited, but Nine Ways of Knowing courses may overlap with major or minor requirements. In addition to the Nine Ways of Knowing, students must complete a first-year seminar, a first-year English course, and one semester of physical education.\nThe Nine Ways of Knowing was replaced with Foundations in 2016. Students must take the First Year Experience which includes two semesters of seminars, complete Distributional Requirements within many subjects, and six Modes of Thinking courses.\n\"Foundations is uniquely Barnard. It's a diverse and\nforward-looking curriculum that asks our students to think\ntheoretically, empirically, and technologically, to write\neffectively; and to speak persuasively — all while giving them\nthe freedom to shape their own educational experience.\"\n— Linda A. Bell, Provost\n\nAdmissions \n\nAdmissions to Barnard is considered very selective by U.S. News & World Report. It is the most selective women's college in the nation; in 2017, Barnard had the lowest acceptance rate of the five Seven Sisters that remain single-sex in admissions.\n\nThe class of 2021's admission rate was 14.8% of the 7,716 applicants, the lowest acceptance rate in the institution's history. The early-decision admission rate for the class of 2020 was 47.7%, out of 787 applications. The median SAT Combined was 2080, with median subscores of 700 in Math,  in 705 Critical Reading, and 720 in Writing. The Median ACT score was 32. Of the women in the class of 2012, 89.4% ranked in first or second decile at their high school (of the 41.3% ranked by their schools). The average GPA of the class of 2012 was 94.3 on a 100-point scale and 3.88 on a 4.0 scale. In 2015 Barnard announced that it would admit transgender women who \"consistently live and identify as women, regardless of the gender assigned to them at birth\", and would continue to support and enroll those students who transitioned to males after they had already been admitted.\n\nRankings \n\nIn the 2018 U.S. News & World Report rankings, Barnard was ranked as the 26th best liberal arts college in the country. The ranking came under widespread criticism, as it only accounted for institution-specific resources. Greg Brown, chief operating officer at Barnard, said, \"I believe that our ranking is lower than it should be, primarily because the methodology simply can't account for the Barnard-Columbia relationship. Because the Columbia relationship doesn't fit neatly into any of the survey categories, it is essentially ignored. Rankings are inherently limited in this way.\"\n\nIn 1998, then president Judith Shapiro compared the ranking service to the \"equivalent of Sport's Illustrated swimsuit issue.\" According to Shapiro's letter, \"Such a ranking system certainly does more harm than good in terms of educating the public.\" On June 19, 2007, following a meeting of the Annapolis Group, which represents over 100 liberal arts colleges, Barnard announced that it would no longer participate in the U.S. News annual survey, and that they would fashion their own way to collect and report common data.\n\nCampus \n\nLibrary \n\n  While students are allowed to use the libraries at Columbia University, Barnard has always maintained a library of its own. Lehman Hall was the site of Barnard's Wollman Library from its opening in 1959 until 2015. , the Lehman Hall building is being demolished to make way for a new library facility. Barnard's Teaching and Learning Center, the planned replacement for the earlier building, is scheduled to open in August 2018.\n\nIn 2016, portions of the Barnard Library were relocated to the former LeFrak Gymnasium as well as the first two floors of Barnard Hall. 18,000 volumes were also moved to the Milstein rooms in Columbia University's Butler Library. The relocation plans proved to be contentious among faculty at the college, who objected to sending a large portion of the library's holdings off site, as well as a \"lack of transparency surrounding the decision-making process\", according to Library Journal.\n\nThe LeFrak Center houses study space, librarians' offices, the zine collection, course reserves, and new books acquired since July 2015. The Barnard Library also houses the Archives and Special Collections, a repository of official and student publications, photographs, letters, alumnae scrapbooks and other material that documents Barnard's history from its founding in 1889 to the present day. Among the collections are the Ntozake Shange papers and various student publications.\n\nZine Collection \n\nBorne of a proposal by longtime zinester Jenna Freedman, Barnard collects zines in an effort to document third-wave feminism and Riot Grrrl culture. According to Freedman, zine collections such as Barnard's provide a home for the voices of young women otherwise not represented in library collections. The Zine Collection's website states: \n\n, the library had approximately 4,000 different zines available to library patrons, including zines about race, gender, sexuality, childbirth, motherhood, politics, and relationships. The library keeps a collection of zines for lending and another archived collection in the Barnard Archives. Both collections are catalogued in CLIO, the Columbia/Barnard Online public access catalog.\n\nStudent life \n\nStudent organizations \n\nEvery Barnard student is part of the Student Government Association (SGA), which elects a representative student government. SGA aims to facilitate the expression of opinions on matters that directly affect the Barnard community.\n\nStudent groups include theatre and vocal music groups, language clubs, literary magazines, a freeform radio station called WBAR, a biweekly magazine called the Barnard Bulletin, community service groups, and others.\n\nBarnard students can also join extracurricular activities or organizations at Columbia University, while Columbia University students are allowed in most, but not all, Barnard organizations. Barnard's McIntosh Activities Council (commonly known as McAC), named after the first President of Barnard, Millicent McIntosh, organizes various community focused events on campus, such as Big Sub and Midnight Breakfast. McAC is made up of five sub-committees which are the Mosaic committee (formerly known as Multicultural), the Wellness committee, the Network committee, the Community committee, and the Action committee. Each committee has a different focus, such as hosting and publicizing identity and cultural events (Mosaic), having health and wellness related events (Wellness), giving students opportunities to be involved with Alumnae and various professionals (Network), planning events that bring the entire student body together (Community), and planning community service events that give back to the surrounding community (Action).\n\nSocieties and clubs \n\nBarnard College officially banned sororities in 1913,[http://barnardarchives.wordpress.com/tag/sororities/ Sororities | Barnard College Archives]. Barnardarchives.wordpress.com (September 30, 2010). Retrieved on September 7, 2013. but Barnard students continue to participate in Columbia's six National Panhellenic Conference sororities—Alpha Chi Omega, Alpha Omicron Pi, Delta Gamma, Gamma Phi Beta, Kappa Alpha Theta, and Sigma Delta Tau—and the National Pan-Hellenic Council Sororities- Alpha Kappa Alpha (Lambda chapter) and Delta Sigma Theta (Rho chapter) as well as other sororities in the Multicultural Greek Council. Two National Panhellenic Conference organizations were founded at Barnard College. The Alpha Omicron Pi Fraternity, founded on January 2, 1897, left campus during the 1913 ban but returned to establish its Alpha chapter in 2013. The Alpha Epsilon Phi, founded on October 24, 1909, is no longer on campus.  As of 2010, Barnard does not fully recognize the National Panhellenic Conference sororities at Columbia, but it does provide some funding to account for Barnard students living in Columbia housing through these organizations.[http://www.columbiaspectator.com/2010/04/27/barnard-funding-sororities-not-recognition Barnard funding for sororities, but not recognition | Columbia Daily Spectator]. Columbiaspectator.com. Retrieved on September 7, 2013.\n\nTraditions \n\nTake Back the Night: Each April, Barnard and Columbia students participate in the Take Back the Night march and speak-out. This annual event grew out of a 1988 Seven Sisters conference. The march has grown from under 200 participants in 1988 to more than 2,500 in 2007.\n\nMidnight Breakfast marks the beginning of finals week. As a highly popular event and long-standing college tradition, Midnight Breakfast is hosted by the student-run activities council, McAC (McIntosh Activities Council). In addition to providing standard breakfast foods, each year's theme is also incorporated into the menu. Past themes have included \"I YUMM the 90s,\" \"Grease,\" and \"Take Me Out to the Ballgame.\" The event is a school-wide affair as college deans, trustees and the president serve food to about a thousand students. It takes place the night before finals begin every semester.\n\nNight Carnival: In the spring of each year, Barnard holds the Night Carnival, in which many of Barnard's student groups set up tables with games and prizes. The event is organized by the student-run activities council, McAC (McIntosh Activities Council).\n\nAcademic affiliations \n\nRelationship with Columbia University \n\nThe Barnard Bulletin in 1976 described the relationship between the college and Columbia University as \"intricate and ambiguous\". Barnard president Debora Spar said in 2012 that \"the relationship is admittedly a complicated one, a unique one and one that may take a few sentences to explain to the outside community\".\n\nOutside sources often describe Barnard as part of Columbia; The New York Times in 2013, for example, called Barnard \"an undergraduate women's college of Columbia University\". The college's front gates state Barnard College of Columbia University. Barnard describes itself as \"both an independently incorporated educational institution and an official college of Columbia University\", and advises students to state \"Barnard College, Columbia University\" or \"Barnard College of Columbia University\" on résumés. Facebook includes Barnard students and alumnae within the Columbia interest group.\n\nColumbia describes Barnard as an affiliated institution[http://www.columbia.edu/home/academic_programs/index.html] \"Undergraduate education at Columbia is offered through Columbia College, the Fu Foundation School of Engineering and Applied Science, and the School of General Studies. Undergraduate programs are offered by two affiliated institutions, Barnard College and Jewish Theological Seminary.\" that is a faculty of the university or is \"in partnership with\" it. Both the college and Columbia evaluate Barnard faculty for tenure,[http://www.columbia.edu/cu/vpaa/docs/tenframe.html Principles and Customs Governing the Procedures of Ad Hoc Committees and University-Wide Tenure Review]. Retrieved November 27, 2009. and Barnard graduates receive Columbia University diplomas signed by both the Barnard and Columbia presidents.[http://www.barnard.edu/about/columbia-partnership Partnership with Columbia]. Retrieved November 10, 2012.\n\nBefore coeducation at Columbia \n\nSmith and Columbia president Seth Low worked to open Columbia classes to Barnard students. By 1900 they could attend Columbia classes in philosophy, political science, and several scientific fields. That year Barnard formalized an affiliation with the university which made available to its students the instruction and facilities of Columbia. Franz Boas, who taught at both Columbia and Barnard in the early 1900s, was among those faculty members who reportedly found Barnard students superior to their male Columbia counterparts. From 1955 Columbia and Barnard students could register for the other school's classes with the permission of the instructor; from 1973 no permission was needed.\n\nExcept for Columbia College, by the 1940s other undergraduate and graduate divisions of Columbia University admitted women. Columbia president William J. McGill predicted in 1970 that Barnard College and Columbia College would merge within five years. In 1973 Columbia and Barnard signed a three-year agreement to increase sharing classrooms, facilities, and housing, and cooperation in faculty appointments, which they described as \"integration without assimilation\"; by the mid-1970s most Columbia dormitories were coed. The university's financial difficulties during the decade increased its desire to merge to end what Columbia described as the \"anachronism\" of single-sex education, but Barnard resisted doing so because of Columbia's large debt, rejecting in 1975 Columbia dean Peter Pouncey's proposal to merge Barnard and the three Columbia undergraduate schools. The 1973-1976 chairwoman of the board at Barnard, Eleanor Thomas Elliott, led the resistance to this takeover. The college's marketing emphasized the Columbia relationship, however, the Bulletin in 1976 stating that Barnard described it as identical to the one between Harvard College and Radcliffe College (\"who are merged in practically everything but name at this point\").\n\nAfter Barnard rejected subsequent merger proposals from Columbia and a one-year extension to the 1973 agreement expired, in 1977 the two schools began discussing their future relationship. By 1979 the relationship had so deteriorated that Barnard officials stopped attending meetings. Because of an expected decline in enrollment, In 1980 a Columbia committee recommended that Columbia College begin admitting women without Barnard's cooperation. A 1981 committee found that Columbia was no longer competitive with other Ivy League universities without women, and that admitting women would not affect Barnard's applicant pool. That year Columbia president Michael Sovern agreed for the two schools to cooperate in admitting women to Columbia, but Barnard faculty's opposition caused president Ellen Futter to reject the agreement.\n\nA decade of negotiations for a Columbia-Barnard merger akin to Harvard and Radcliffe had failed. In January 1982, the two schools instead announced that Columbia College would begin admitting women in 1983, and Barnard's control over tenure for its faculty would increase; previously, a committee on which Columbia faculty outnumbered Barnard's three to two controlled the latter's tenure. Applications to Columbia rose 56% that year, making admission more selective, and nine Barnard students transferred to Columbia. Eight students admitted to both Columbia and Barnard chose Barnard, while 78 chose Columbia. Within a few years, however, selectivity rose at both schools as they received more women applicants than expected.\n\nAfter coeducation \n\nThe Columbia-Barnard affiliation continued.  Barnard pays Columbia about $5 million a year under the terms of the \"interoperate relationship\", which the two schools renegotiate every 15 years. Despite the affiliation Barnard is legally and financially separate from Columbia, with an independent faculty and board of trustees. It is responsible for its own separate admissions, health, security, guidance and placement services, and has its own alumnae association. Nonetheless, Barnard students participate in the academic, social, athletic and extracurricular life of the broader University community on a reciprocal basis. The affiliation permits the two schools to share some academic resources; for example, only Barnard has an urban studies department, and only Columbia has a computer science department. Most Columbia classes are open to Barnard students and vice versa. Barnard students and faculty are represented in the University Senate, and student organizations such as the Columbia Daily Spectator are open to all students. Barnard students play on Columbia athletics teams, and Barnard uses Columbia email, telephone and network services.\n\nBarnard athletes compete in the Ivy League (NCAA Division I) through the Columbia/Barnard Athletic Consortium, which was established in 1983. Through this arrangement, Barnard is the only women's college offering Division I athletics.[http://www.barnard.edu/admissions/campus/athletics Athletics] There are 15 intercollegiate teams, and students also compete at the intramural and club levels. From 1975–1983, before the establishment of the Columbia/Barnard Athletic Consortium, Barnard students competed as the \"Barnard Bears\". Prior to 1975, students referred to themselves as the \"Barnard honeybears\".\n\nSeven Sisters \n\nEstablished within the Barnard Student Government Association (SGA), The Seven Sisters Governing Board represents Barnard College as part of the Seven Sisters Coalition, which is a group of representatives from student councils of the historic Seven Sisters colleges. The reps on the coordinating board of Seven Sisters Coalition are rotating every year to hold the annual Seven Sisters Conference in a serious but informal setting. The first Seven Sisters Conference was hosted by SGA student representatives at Barnard College in 2009.  In fall 2013, the conference was hosted by Vassar College during the first weekend of November. The major topic focused on inner college collaborations and differences in student government structures among Seven Sisters Colleges. The Seven Sisters Coordinating Board of Barnard brought six Barnard student representatives to attend the Fall Semester conference, which was hosted at Vassar College in the past fall semester. Based on the Coalition Coordinating Board Constitution established in February 2013, Students delegates were initiating projects in the aspects of public relations, alumni outreach and website management to promote the presence and development of the seven sisters culture. Meanwhile, The Barnard delegates engaged in discussions about the various structures of the student governments among the historic seven sisters colleges.\n\nSustainability \n\nBarnard College has issued a statement affirming its commitment to environmental sustainability, a major part of which is the goal of reducing its greenhouse gas emissions by 30% by 2017. Student EcoReps work as a resource on environmental issues for students in Barnard's residence halls, while the student-run Earth Coalition works on outreach initiatives such as local park clean-ups, tutoring elementary school students in environmental education, and sponsoring environmental forums. Barnard earned a \"C-\" for its sustainability efforts on the College Sustainability Report Card 2009 published by the Sustainable Endowments Institute. Its highest marks were in Student Involvement and Food and Recycling, receiving a \"B\" in both categories.\n\nControversies \n\nIn the spring of 1960, Columbia University president Grayson Kirk complained to the president of Barnard that Barnard students were wearing inappropriate clothing. The garments in question were pants and Bermuda shorts. The administration forced the student council to institute a dress code. Students would be allowed to wear shorts and pants only at Barnard and only if the shorts were no more than two inches above the knee and the pants were not tight. Barnard women crossing the street to enter the Columbia campus wearing shorts or pants were required to cover themselves with a long coat.\n\nIn March 1968, The New York Times ran an article on students who cohabited, identifying one of the persons they interviewed as a student at Barnard College from New Hampshire named \"Susan\". Barnard officials searched their records for women from New Hampshire and were able to determine that \"Susan\" was the pseudonym of a student (Linda LeClair) who was living with her boyfriend, a student at Columbia University. She was called before Barnard's student-faculty administration judicial committee, where she faced the possibility of expulsion. A student protest included a petition signed by 300 other Barnard women, admitting that they too had broken the regulations against cohabitating. The judicial committee reached a compromise and the student was allowed to remain in school, but was denied use of the college cafeteria and barred from all social activities. The student briefly became a focus of intense national attention. She eventually dropped out of Barnard.Newsweek, April 8, 1968, p. 85 and Newsweek, April 29, 1968, p. 79-80.\n\nAdministration \n\nThe following lists all of the Presidents and Deans of Barnard College from 1889 to present.[http://barnard.edu/about/leadership/past-presidents Past Presidents]\n* Ella Weed (1889–1894)\n* Emily James Smith (1894–1900)\n* Laura Drake Gill (1901–1907)\n* Virginia Gildersleeve (1911–1947)\n* Millicent McIntosh (1952–1962)\n* Rosemary Park (1962–1967)\n* Martha Peterson (1967–1975)\n* Jacquelyn Mattfield (1975–1981)\n* Ellen Futter (1981–1993)\n* Judith Shapiro (1994–2008)\n* Debora Spar (2008–2017)\n* Sian Beilock (2017–present)\n\nNotable people \n\nBarnard College has graduated many prominent leaders in science, religion, politics, the Peace Corps, medicine, law, education, communications, and business; and acclaimed actors, architects, artists, astronauts, engineers, human rights activists, inventors, musicians, philanthropists, and writers. Among these include:  United Nations Development Programme Representative of Japan, Akiko Yuge (1975), author Zora Neale Hurston, author and political activist Grace Lee Boggs (1935), television host Ronnie Eldridge (1952), U.S. Representative Helen Gahagan (1924), CEO of CARE USA and chair of the Presidential Advisory Council on HIV/AIDS Helene D. Gayle (1970), President of the American Civil Liberties Union Susan Herman (1968), Chief Judge of the New York Court of Appeals Judith Kaye (1958), Chair of the National Labor Relations Board Wilma B. Liebman (1971), author of The Sisterhood of the Traveling Pants Ann Brashares (1989), and writer and director Greta Gerwig (2004).\nFile:Millicent Carey McIntosh 1962.tiff| Millicent Carey McIntosh\nFile:Mirra Komarovsky.TIF| Mirra Komarovsky\nFile:Tama Janowitz.tif| Tama Janowitz\nFile:Elizabeth Hardwick.tif|Elizabeth Hardwick\nFile:Martha Stewart 2011 Shankbone.JPG|Martha Stewart\nFile:Lauren Graham August 2014.jpg|Lauren Graham\nFile:Joan Rivers 2010 - David Shankbone.jpg|Joan Rivers",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Barnard College" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4237" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Barnard College is a private women's liberal arts college in New York City, New York, United States. Founded in 1889 by Annie Nathan Meyer, who named it after Columbia University's 10th president, Frederick Barnard, it is one of the oldest women's colleges in the world.\n\nThe college was founded as a response to Columbia's refusal to admit women into their institution. Since 1900, Barnard has been affiliated with Columbia University. However, Barnard is legally and financially separate from the university.\n\nBarnard confers the Bachelor of Arts degree in about 50 areas of study. Students may also pursue elements of their education at Columbia University, the Juilliard School and The Jewish Theological Seminary also based in New York City. Barnard students share clubs, sports teams, academic buildings and more with Columbia. Barnard graduates receive Columbia University diplomas signed by the presidents of both institutions. Its  campus is located in the Manhattan neighborhood  of Morningside Heights, stretching along Broadway between 116th and 120th Streets. It is directly across from Columbia's campus and near several other academic institutions. The college is a member of the Seven Sisters, an association of seven prominent women's liberal arts colleges.\n\nHistory \n\n19th century and founding \n\nFor its first 229 years Columbia College of Columbia University admitted only men for undergraduate study. Barnard College was founded in 1889 as a response to Columbia's refusal to admit women into its institution.\n\nThe college was named after Frederick Augustus Porter Barnard, a deaf American educator and mathematician who served as the tenth president of Columbia from 1864 to 1889. He advocated equal educational privileges for men and women, preferably in a coeducational setting, and began proposing in 1879 that Columbia admit women. The board of trustees repeatedly rejected Barnard's suggestion, but in 1883 agreed to create a detailed syllabus of study for women. While they could not attend Columbia classes, those who passed examinations based on the syllabus would receive a degree. The first such woman graduate received her bachelor's degree in 1887. A former student of the program, Annie Meyer, and other prominent New York women persuaded the board in 1889 to create a women's college connected to Columbia.\n\nBarnard College's original 1889 home was a rented brownstone at 343 Madison Avenue, where a faculty of six offered instruction to 14 students in the School of Arts, as well as to 22 \"specials\", who lacked the entrance requirements in Greek and so enrolled in science. When Columbia University announced in 1892 its impending move to Morningside Heights, Barnard built a new campus on 119th-120th Streets with gifts from Mary E. Brinckerhoff, Elizabeth Milbank Anderson and Martha Fiske. Milbank, Brinckerhoff, and Fiske Halls, built in 1897–1898, were listed on the National Register of Historic Places in 2003.\n\nElla Weed supervised the college in its first four years; Emily James Smith succeeded her as Barnard's first dean. As the college grew it needed additional space, and in 1903 it received the three blocks south of 119th Street from Anderson who had purchased a former portion of the Bloomingdale Asylum site from the New York Hospital.Plimpton Papers, Barnard College Archives By the mid-20th century Barnard had succeeded in its original goal of providing a top tier education to women. Between 1920 and 1974, only the much larger Hunter College and University of California, Berkeley produced more women graduates who later received doctorate degrees. Students' Hall, now known as Barnard Hall, was built in 1916. Brooks and Hewitt Halls were built in 1906–1907 and 1926–1927, respectively. They were listed on the National Register of Historic Places in 2003. Jessica Finch is credited with coining the phrase, \"current events,\" while teaching at Barnard College in the 1890s.\n\nAcademics \n\nBarnard confers the Bachelor of Arts degree in about 50 areas of study. Joint programs for the Bachelor of Science and other degrees exist with Columbia University, Juilliard School, and The Jewish Theological Seminary. The six most popular majors at the college are English, psychology, political science, economics, history, and biology.\n\nThe liberal arts requirements are called the Nine Ways of Knowing. Students must take one year of one laboratory science, study a single foreign language for four semesters, and complete one 3-credit course in each of the following categories: reason and value, social analysis, historical studies, cultures in comparison, quantitative and deductive reasoning, literature, and visual and performing arts. The use of AP or IB credit to fulfill these requirements is very limited, but Nine Ways of Knowing courses may overlap with major or minor requirements. In addition to the Nine Ways of Knowing, students must complete a first-year seminar, a first-year English course, and one semester of physical education.\nThe Nine Ways of Knowing was replaced with Foundations in 2016. Students must take the First Year Experience which includes two semesters of seminars, complete Distributional Requirements within many subjects, and six Modes of Thinking courses.\n\"Foundations is uniquely Barnard. It's a diverse and\nforward-looking curriculum that asks our students to think\ntheoretically, empirically, and technologically, to write\neffectively; and to speak persuasively — all while giving them\nthe freedom to shape their own educational experience.\"\n— Linda A. Bell, Provost\n\nAdmissions \n\nAdmissions to Barnard is considered very selective by U.S. News & World Report. It is the most selective women's college in the nation; in 2017, Barnard had the lowest acceptance rate of the five Seven Sisters that remain single-sex in admissions.\n\nThe class of 2021's admission rate was 14.8% of the 7,716 applicants, the lowest acceptance rate in the institution's history. The early-decision admission rate for the class of 2020 was 47.7%, out of 787 applications. The median SAT Combined was 2080, with median subscores of 700 in Math,  in 705 Critical Reading, and 720 in Writing. The Median ACT score was 32. Of the women in the class of 2012, 89.4% ranked in first or second decile at their high school (of the 41.3% ranked by their schools). The average GPA of the class of 2012 was 94.3 on a 100-point scale and 3.88 on a 4.0 scale. In 2015 Barnard announced that it would admit transgender women who \"consistently live and identify as women, regardless of the gender assigned to them at birth\", and would continue to support and enroll those students who transitioned to males after they had already been admitted.\n\nRankings \n\nIn the 2018 U.S. News & World Report rankings, Barnard was ranked as the 26th best liberal arts college in the country. The ranking came under widespread criticism, as it only accounted for institution-specific resources. Greg Brown, chief operating officer at Barnard, said, \"I believe that our ranking is lower than it should be, primarily because the methodology simply can't account for the Barnard-Columbia relationship. Because the Columbia relationship doesn't fit neatly into any of the survey categories, it is essentially ignored. Rankings are inherently limited in this way.\"\n\nIn 1998, then president Judith Shapiro compared the ranking service to the \"equivalent of Sport's Illustrated swimsuit issue.\" According to Shapiro's letter, \"Such a ranking system certainly does more harm than good in terms of educating the public.\" On June 19, 2007, following a meeting of the Annapolis Group, which represents over 100 liberal arts colleges, Barnard announced that it would no longer participate in the U.S. News annual survey, and that they would fashion their own way to collect and report common data.\n\nCampus \n\nLibrary \n\n  While students are allowed to use the libraries at Columbia University, Barnard has always maintained a library of its own. Lehman Hall was the site of Barnard's Wollman Library from its opening in 1959 until 2015. , the Lehman Hall building is being demolished to make way for a new library facility. Barnard's Teaching and Learning Center, the planned replacement for the earlier building, is scheduled to open in August 2018.\n\nIn 2016, portions of the Barnard Library were relocated to the former LeFrak Gymnasium as well as the first two floors of Barnard Hall. 18,000 volumes were also moved to the Milstein rooms in Columbia University's Butler Library. The relocation plans proved to be contentious among faculty at the college, who objected to sending a large portion of the library's holdings off site, as well as a \"lack of transparency surrounding the decision-making process\", according to Library Journal.\n\nThe LeFrak Center houses study space, librarians' offices, the zine collection, course reserves, and new books acquired since July 2015. The Barnard Library also houses the Archives and Special Collections, a repository of official and student publications, photographs, letters, alumnae scrapbooks and other material that documents Barnard's history from its founding in 1889 to the present day. Among the collections are the Ntozake Shange papers and various student publications.\n\nZine Collection \n\nBorne of a proposal by longtime zinester Jenna Freedman, Barnard collects zines in an effort to document third-wave feminism and Riot Grrrl culture. According to Freedman, zine collections such as Barnard's provide a home for the voices of young women otherwise not represented in library collections. The Zine Collection's website states: \n\n, the library had approximately 4,000 different zines available to library patrons, including zines about race, gender, sexuality, childbirth, motherhood, politics, and relationships. The library keeps a collection of zines for lending and another archived collection in the Barnard Archives. Both collections are catalogued in CLIO, the Columbia/Barnard Online public access catalog.\n\nStudent life \n\nStudent organizations \n\nEvery Barnard student is part of the Student Government Association (SGA), which elects a representative student government. SGA aims to facilitate the expression of opinions on matters that directly affect the Barnard community.\n\nStudent groups include theatre and vocal music groups, language clubs, literary magazines, a freeform radio station called WBAR, a biweekly magazine called the Barnard Bulletin, community service groups, and others.\n\nBarnard students can also join extracurricular activities or organizations at Columbia University, while Columbia University students are allowed in most, but not all, Barnard organizations. Barnard's McIntosh Activities Council (commonly known as McAC), named after the first President of Barnard, Millicent McIntosh, organizes various community focused events on campus, such as Big Sub and Midnight Breakfast. McAC is made up of five sub-committees which are the Mosaic committee (formerly known as Multicultural), the Wellness committee, the Network committee, the Community committee, and the Action committee. Each committee has a different focus, such as hosting and publicizing identity and cultural events (Mosaic), having health and wellness related events (Wellness), giving students opportunities to be involved with Alumnae and various professionals (Network), planning events that bring the entire student body together (Community), and planning community service events that give back to the surrounding community (Action).\n\nSocieties and clubs \n\nBarnard College officially banned sororities in 1913,[http://barnardarchives.wordpress.com/tag/sororities/ Sororities | Barnard College Archives]. Barnardarchives.wordpress.com (September 30, 2010). Retrieved on September 7, 2013. but Barnard students continue to participate in Columbia's six National Panhellenic Conference sororities—Alpha Chi Omega, Alpha Omicron Pi, Delta Gamma, Gamma Phi Beta, Kappa Alpha Theta, and Sigma Delta Tau—and the National Pan-Hellenic Council Sororities- Alpha Kappa Alpha (Lambda chapter) and Delta Sigma Theta (Rho chapter) as well as other sororities in the Multicultural Greek Council. Two National Panhellenic Conference organizations were founded at Barnard College. The Alpha Omicron Pi Fraternity, founded on January 2, 1897, left campus during the 1913 ban but returned to establish its Alpha chapter in 2013. The Alpha Epsilon Phi, founded on October 24, 1909, is no longer on campus.  As of 2010, Barnard does not fully recognize the National Panhellenic Conference sororities at Columbia, but it does provide some funding to account for Barnard students living in Columbia housing through these organizations.[http://www.columbiaspectator.com/2010/04/27/barnard-funding-sororities-not-recognition Barnard funding for sororities, but not recognition | Columbia Daily Spectator]. Columbiaspectator.com. Retrieved on September 7, 2013.\n\nTraditions \n\nTake Back the Night: Each April, Barnard and Columbia students participate in the Take Back the Night march and speak-out. This annual event grew out of a 1988 Seven Sisters conference. The march has grown from under 200 participants in 1988 to more than 2,500 in 2007.\n\nMidnight Breakfast marks the beginning of finals week. As a highly popular event and long-standing college tradition, Midnight Breakfast is hosted by the student-run activities council, McAC (McIntosh Activities Council). In addition to providing standard breakfast foods, each year's theme is also incorporated into the menu. Past themes have included \"I YUMM the 90s,\" \"Grease,\" and \"Take Me Out to the Ballgame.\" The event is a school-wide affair as college deans, trustees and the president serve food to about a thousand students. It takes place the night before finals begin every semester.\n\nNight Carnival: In the spring of each year, Barnard holds the Night Carnival, in which many of Barnard's student groups set up tables with games and prizes. The event is organized by the student-run activities council, McAC (McIntosh Activities Council).\n\nAcademic affiliations \n\nRelationship with Columbia University \n\nThe Barnard Bulletin in 1976 described the relationship between the college and Columbia University as \"intricate and ambiguous\". Barnard president Debora Spar said in 2012 that \"the relationship is admittedly a complicated one, a unique one and one that may take a few sentences to explain to the outside community\".\n\nOutside sources often describe Barnard as part of Columbia; The New York Times in 2013, for example, called Barnard \"an undergraduate women's college of Columbia University\". The college's front gates state Barnard College of Columbia University. Barnard describes itself as \"both an independently incorporated educational institution and an official college of Columbia University\", and advises students to state \"Barnard College, Columbia University\" or \"Barnard College of Columbia University\" on résumés. Facebook includes Barnard students and alumnae within the Columbia interest group.\n\nColumbia describes Barnard as an affiliated institution[http://www.columbia.edu/home/academic_programs/index.html] \"Undergraduate education at Columbia is offered through Columbia College, the Fu Foundation School of Engineering and Applied Science, and the School of General Studies. Undergraduate programs are offered by two affiliated institutions, Barnard College and Jewish Theological Seminary.\" that is a faculty of the university or is \"in partnership with\" it. Both the college and Columbia evaluate Barnard faculty for tenure,[http://www.columbia.edu/cu/vpaa/docs/tenframe.html Principles and Customs Governing the Procedures of Ad Hoc Committees and University-Wide Tenure Review]. Retrieved November 27, 2009. and Barnard graduates receive Columbia University diplomas signed by both the Barnard and Columbia presidents.[http://www.barnard.edu/about/columbia-partnership Partnership with Columbia]. Retrieved November 10, 2012.\n\nBefore coeducation at Columbia \n\nSmith and Columbia president Seth Low worked to open Columbia classes to Barnard students. By 1900 they could attend Columbia classes in philosophy, political science, and several scientific fields. That year Barnard formalized an affiliation with the university which made available to its students the instruction and facilities of Columbia. Franz Boas, who taught at both Columbia and Barnard in the early 1900s, was among those faculty members who reportedly found Barnard students superior to their male Columbia counterparts. From 1955 Columbia and Barnard students could register for the other school's classes with the permission of the instructor; from 1973 no permission was needed.\n\nExcept for Columbia College, by the 1940s other undergraduate and graduate divisions of Columbia University admitted women. Columbia president William J. McGill predicted in 1970 that Barnard College and Columbia College would merge within five years. In 1973 Columbia and Barnard signed a three-year agreement to increase sharing classrooms, facilities, and housing, and cooperation in faculty appointments, which they described as \"integration without assimilation\"; by the mid-1970s most Columbia dormitories were coed. The university's financial difficulties during the decade increased its desire to merge to end what Columbia described as the \"anachronism\" of single-sex education, but Barnard resisted doing so because of Columbia's large debt, rejecting in 1975 Columbia dean Peter Pouncey's proposal to merge Barnard and the three Columbia undergraduate schools. The 1973-1976 chairwoman of the board at Barnard, Eleanor Thomas Elliott, led the resistance to this takeover. The college's marketing emphasized the Columbia relationship, however, the Bulletin in 1976 stating that Barnard described it as identical to the one between Harvard College and Radcliffe College (\"who are merged in practically everything but name at this point\").\n\nAfter Barnard rejected subsequent merger proposals from Columbia and a one-year extension to the 1973 agreement expired, in 1977 the two schools began discussing their future relationship. By 1979 the relationship had so deteriorated that Barnard officials stopped attending meetings. Because of an expected decline in enrollment, In 1980 a Columbia committee recommended that Columbia College begin admitting women without Barnard's cooperation. A 1981 committee found that Columbia was no longer competitive with other Ivy League universities without women, and that admitting women would not affect Barnard's applicant pool. That year Columbia president Michael Sovern agreed for the two schools to cooperate in admitting women to Columbia, but Barnard faculty's opposition caused president Ellen Futter to reject the agreement.\n\nA decade of negotiations for a Columbia-Barnard merger akin to Harvard and Radcliffe had failed. In January 1982, the two schools instead announced that Columbia College would begin admitting women in 1983, and Barnard's control over tenure for its faculty would increase; previously, a committee on which Columbia faculty outnumbered Barnard's three to two controlled the latter's tenure. Applications to Columbia rose 56% that year, making admission more selective, and nine Barnard students transferred to Columbia. Eight students admitted to both Columbia and Barnard chose Barnard, while 78 chose Columbia. Within a few years, however, selectivity rose at both schools as they received more women applicants than expected.\n\nAfter coeducation \n\nThe Columbia-Barnard affiliation continued.  Barnard pays Columbia about $5 million a year under the terms of the \"interoperate relationship\", which the two schools renegotiate every 15 years. Despite the affiliation Barnard is legally and financially separate from Columbia, with an independent faculty and board of trustees. It is responsible for its own separate admissions, health, security, guidance and placement services, and has its own alumnae association. Nonetheless, Barnard students participate in the academic, social, athletic and extracurricular life of the broader University community on a reciprocal basis. The affiliation permits the two schools to share some academic resources; for example, only Barnard has an urban studies department, and only Columbia has a computer science department. Most Columbia classes are open to Barnard students and vice versa. Barnard students and faculty are represented in the University Senate, and student organizations such as the Columbia Daily Spectator are open to all students. Barnard students play on Columbia athletics teams, and Barnard uses Columbia email, telephone and network services.\n\nBarnard athletes compete in the Ivy League (NCAA Division I) through the Columbia/Barnard Athletic Consortium, which was established in 1983. Through this arrangement, Barnard is the only women's college offering Division I athletics.[http://www.barnard.edu/admissions/campus/athletics Athletics] There are 15 intercollegiate teams, and students also compete at the intramural and club levels. From 1975–1983, before the establishment of the Columbia/Barnard Athletic Consortium, Barnard students competed as the \"Barnard Bears\". Prior to 1975, students referred to themselves as the \"Barnard honeybears\".\n\nSeven Sisters \n\nEstablished within the Barnard Student Government Association (SGA), The Seven Sisters Governing Board represents Barnard College as part of the Seven Sisters Coalition, which is a group of representatives from student councils of the historic Seven Sisters colleges. The reps on the coordinating board of Seven Sisters Coalition are rotating every year to hold the annual Seven Sisters Conference in a serious but informal setting. The first Seven Sisters Conference was hosted by SGA student representatives at Barnard College in 2009.  In fall 2013, the conference was hosted by Vassar College during the first weekend of November. The major topic focused on inner college collaborations and differences in student government structures among Seven Sisters Colleges. The Seven Sisters Coordinating Board of Barnard brought six Barnard student representatives to attend the Fall Semester conference, which was hosted at Vassar College in the past fall semester. Based on the Coalition Coordinating Board Constitution established in February 2013, Students delegates were initiating projects in the aspects of public relations, alumni outreach and website management to promote the presence and development of the seven sisters culture. Meanwhile, The Barnard delegates engaged in discussions about the various structures of the student governments among the historic seven sisters colleges.\n\nSustainability \n\nBarnard College has issued a statement affirming its commitment to environmental sustainability, a major part of which is the goal of reducing its greenhouse gas emissions by 30% by 2017. Student EcoReps work as a resource on environmental issues for students in Barnard's residence halls, while the student-run Earth Coalition works on outreach initiatives such as local park clean-ups, tutoring elementary school students in environmental education, and sponsoring environmental forums. Barnard earned a \"C-\" for its sustainability efforts on the College Sustainability Report Card 2009 published by the Sustainable Endowments Institute. Its highest marks were in Student Involvement and Food and Recycling, receiving a \"B\" in both categories.\n\nControversies \n\nIn the spring of 1960, Columbia University president Grayson Kirk complained to the president of Barnard that Barnard students were wearing inappropriate clothing. The garments in question were pants and Bermuda shorts. The administration forced the student council to institute a dress code. Students would be allowed to wear shorts and pants only at Barnard and only if the shorts were no more than two inches above the knee and the pants were not tight. Barnard women crossing the street to enter the Columbia campus wearing shorts or pants were required to cover themselves with a long coat.\n\nIn March 1968, The New York Times ran an article on students who cohabited, identifying one of the persons they interviewed as a student at Barnard College from New Hampshire named \"Susan\". Barnard officials searched their records for women from New Hampshire and were able to determine that \"Susan\" was the pseudonym of a student (Linda LeClair) who was living with her boyfriend, a student at Columbia University. She was called before Barnard's student-faculty administration judicial committee, where she faced the possibility of expulsion. A student protest included a petition signed by 300 other Barnard women, admitting that they too had broken the regulations against cohabitating. The judicial committee reached a compromise and the student was allowed to remain in school, but was denied use of the college cafeteria and barred from all social activities. The student briefly became a focus of intense national attention. She eventually dropped out of Barnard.Newsweek, April 8, 1968, p. 85 and Newsweek, April 29, 1968, p. 79-80.\n\nAdministration \n\nThe following lists all of the Presidents and Deans of Barnard College from 1889 to present.[http://barnard.edu/about/leadership/past-presidents Past Presidents]\n* Ella Weed (1889–1894)\n* Emily James Smith (1894–1900)\n* Laura Drake Gill (1901–1907)\n* Virginia Gildersleeve (1911–1947)\n* Millicent McIntosh (1952–1962)\n* Rosemary Park (1962–1967)\n* Martha Peterson (1967–1975)\n* Jacquelyn Mattfield (1975–1981)\n* Ellen Futter (1981–1993)\n* Judith Shapiro (1994–2008)\n* Debora Spar (2008–2017)\n* Sian Beilock (2017–present)\n\nNotable people \n\nBarnard College has graduated many prominent leaders in science, religion, politics, the Peace Corps, medicine, law, education, communications, and business; and acclaimed actors, architects, artists, astronauts, engineers, human rights activists, inventors, musicians, philanthropists, and writers. Among these include:  United Nations Development Programme Representative of Japan, Akiko Yuge (1975), author Zora Neale Hurston, author and political activist Grace Lee Boggs (1935), television host Ronnie Eldridge (1952), U.S. Representative Helen Gahagan (1924), CEO of CARE USA and chair of the Presidential Advisory Council on HIV/AIDS Helene D. Gayle (1970), President of the American Civil Liberties Union Susan Herman (1968), Chief Judge of the New York Court of Appeals Judith Kaye (1958), Chair of the National Labor Relations Board Wilma B. Liebman (1971), author of The Sisterhood of the Traveling Pants Ann Brashares (1989), and writer and director Greta Gerwig (2004).\nFile:Millicent Carey McIntosh 1962.tiff| Millicent Carey McIntosh\nFile:Mirra Komarovsky.TIF| Mirra Komarovsky\nFile:Tama Janowitz.tif| Tama Janowitz\nFile:Elizabeth Hardwick.tif|Elizabeth Hardwick\nFile:Martha Stewart 2011 Shankbone.JPG|Martha Stewart\nFile:Lauren Graham August 2014.jpg|Lauren Graham\nFile:Joan Rivers 2010 - David Shankbone.jpg|Joan Rivers. Barnard College. http://en.wikipedia.org/?curid=4237."
  }
}
