{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16053",
  "eid" : "23476d20-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778568434,
  "textBody" : "Jonathan Michael Richman[http://www.ascap.com/ACE/search.cfm?requesttimeout300&mode\nresults&searchstr7849275&search_in\nc&search_typeexact&search_det\nt,s,w,p,b,v&results_pp20&start\n1 ASCAP records for Jonathan Richman]   (born May 16, 1951) is an American singer, songwriter and guitarist. In 1970 he founded the Modern Lovers, an influential proto-punk band. Since the mid-1970s, Richman has worked either solo or with low-key, acoustic and electric, backing.  Currently, he plays only acoustic to protect his hearing.  He is known for his wide-eyed, unaffected and childlike outlook, and music that, while rooted in rock and roll, is influenced by music from around the world.\n\nBiography\n\nEarly life\n\nBorn in Natick, Massachusetts, into a Jewish family,[https://books.google.com/books?idtDk6FuQcxpoC&printsec\nfrontcover&dq%22jonathan+richman%22+jewish&hl\nen&saX&ei\nVNTEU6fzLMSg7AatuoH4Dg&ved0CB8Q6AEwAA#v\nonepage&q%22jonathan%20richman%22%20jewish&f\nfalse  Steven Lee Beeber, The Heebie-Jeebies at CBGB's: A Secret History of Jewish Punk, Chicago Review Press, 2008, pp.49-62] Richman began playing music and writing his own songs in the mid-1960s. He became infatuated with the Velvet Underground, and in 1969 he moved to New York City, lived on the couch of their manager, Steve Sesnick, worked odd jobs and tried to break in as a professional musician. Failing at this, he returned to Boston.\n\nThe Modern Lovers\n\nWhile in Boston, Richman formed the Modern Lovers, a proto-punk garage rock band. Other notable members of the group were keyboard player Jerry Harrison and drummer David Robinson, who later joined Talking Heads and the Cars, respectively.\n\nIn 1972 they recorded a series of demos with producer John Cale (formerly of the Velvet Underground). Among these songs were the seminal \"Roadrunner\" and \"Pablo Picasso\" which were eventually released on the group's post-breakup album, The Modern Lovers (August 1976). The album was strange for its time, featuring Velvets-influenced basic three-chord rock (\"Roadrunner\" — based on just two chords – is an homage to \"Sister Ray\") at a time when glam and progressive rock were the norm.\n\nLater in 1972, the group also recorded with producer Kim Fowley; these demos were eventually released in 1981 as The Original Modern Lovers. Despite playing live regularly, the Modern Lovers had a difficult time securing a recording contract. By late 1973, Richman wanted to scrap the recorded tracks and start again with a mellower, more lyrical sound, influenced by the laid-back local music he had heard when the band had a residency at the Inverurie Hotel in Bermuda earlier in the year.  This stymied efforts to complete a debut album, and led to the breakup of the original Modern Lovers in February 1974.\n\nJonathan Richman and the Modern Lovers\n\nIn 1975, Richman moved to California to record as a solo singer/songwriter with Beserkley Records. His first released recordings appeared on 1975's Beserkley Chartbusters compilation, where he was backed by members of Earth Quake and the Rubinoos; these four songs also appeared on singles on the independent Beserkley label.\n\nIn January 1976, Richman put together a new version of the Modern Lovers, which included original Modern Lovers drummer, David Robinson, along with former Rubinoos bassist Greg 'Curly' Keranen and Leroy Radcliffe on guitar. The albums produced by the new group found Richman turning away from electric rock music towards gentler acoustic textures, with a strong rooting in 1950s rock and roll (Chuck Berry's \"Back in the USA\" was part of his repertoire).\n\nThe album Jonathan Richman and the Modern Lovers was released in May 1976 (three months before the earlier The Modern Lovers sessions were finally released) but David Robinson left the group soon thereafter, due to frustration with Richman's quest for lower volume levels, and joined with Ric Ocasek in forming the band the Cars.\n\nAfter several months as a trio, Richman found a new drummer, D. Sharpe, an avant-garde jazz player on the Boston scene, who later went on to become a member of pianist Carla Bley's band.\n\nRock and Roll with the Modern Lovers was released in 1977 and, just as this record began to climb the charts in Europe, Keranen left the group (to attend college). A subsequent live album, Modern Lovers Live, was released in 1978, with Asa Brebner on bass.\n\nIn the United Kingdom, Richman was recognised as a progenitor of the punk rock scene, and several of his singles became hits. \"Roadrunner\" reached Number 11 in the UK Singles Chart, and its follow-up, the instrumental \"Egyptian Reggae\", made Number 5 in late 1977. \"Egyptian Reggae\" was a version of Jamaican musician Earl Zero's reggae song \"None Shall Escape the Judgment\"; Zero was credited as co-writer on Richman's later versions of the track.\n\nBack in Your Life was released in 1979 under the \"Jonathan Richman and the Modern Lovers\" moniker, but only about half the disc featured a backup band. The rest was solo work.\n\nSolo\n\nFollowing the Modern Lovers' final breakup, Richman went on sabbatical for a few years, staying in Appleton, Maine, and playing at local bars in Belfast, Maine.\n\nHe returned to recording in 1983 with Jonathan Sings!, followed by Rockin' and Romance (produced by Andy Paley and engineered by Daniel Levitin).  These were followed up with US tours and a brace of pop recordings (It's Time for Jonathan Richman and the Modern Lovers, and Modern Lovers 88 from 1986 and 1988 respectively). After the latter release, the \"Modern Lovers\" moniker was finally retired, and having begun a true solo career, he returned to a variety of musical genres: country music with 1990's Jonathan Goes Country, and Spanish translations of his earlier work (as well as traditional Spanish language songs) with Jonathan, Te Vas a Emocionar! (1993).\n\nIn 1993, he contributed the track \"Hot Nights\" to the AIDS-Benefit Album No Alternative produced by the Red Hot Organization.\n\nAlways possessing an ardent cult following, Richman has become better known in recent years thanks to a series of appearances on Late Night with Conan O'Brien.\n\nAnother major profile boost was a key part in the Farrelly Brothers' 1998 film There's Something About Mary, where he played half of a two-man Greek chorus with drummer Tommy Larkins, that commented on the plot while performing in the framed action itself. He also appeared briefly in a bar scene in a previous Farrelly Brothers film, Kingpin, and performed the song \"As We Walk to Fenway Park\" for their 2005 comedy, Fever Pitch.\n\nRichman has continued his release schedule all along, with You Must Ask the Heart (1995), Surrender to Jonathan (1996), I'm So Confused (1998), Her Mystery Not of High Heels and Eye Shadow (2001), and Not So Much to Be Loved as to Love (2004). In 1998 a live album of Modern Lovers recordings from the early 1970s was released, Live at the Long Branch & More. There is also a DVD of a live performance, Take me to the Plaza (2002).\n\nRichman's minimalist songwriting style has been described as whimsical and childlike. He himself has stated, \"I don’t write, really. I just make up songs.\"\n\nRichman frequently tours with drummer Tommy Larkins.\n\nPersonal life\n\nHis first marriage was to Gail Clook of Vermont, in 1983, with whom he has a daughter, Jenny Rae. This marriage ended in divorce sometime shortly before the release of Surrender to Jonathan (1996).\n\nIn 2003, Richman married Nicole Montalbano of Chico, California. She contributed backing vocals to the album Not So Much to Be Loved as to Love (2004).\n\nInfluence\n\nRichman's work with the first incarnation of Modern Lovers is a major influence on punk rock. One critic called him the \"Godfather of Punk\".[http://archive.salon.com/people/bc/2001/09/04/richman/index.html \"Brilliant Careers: Jonathan Richman\"] , Salon, September 4, 2001. Artists as diverse as the Sex Pistols and Joan Jett have covered \"Roadrunner\". Boston ska-punk band Big D and the Kids Table have covered \"New England\" live and on their Gypsy Hill EP. A version of \"Pablo Picasso\" performed by Burning Sensations was included in the 1984 cult film, Repo Man. David Bowie covered \"Pablo Picasso\" on his album Reality. Velvet Underground founding member John Cale has a version of the song on his 1975 album, Helen of Troy, and continues to include the song in his live shows. Iggy Pop has performed \"Pablo Picasso\" live and wrote an extra verse for it. Echo and the Bunnymen covered \"She Cracked\" in concert in 1984 and 1985 and Siouxsie and the Banshees have a version of the song on Downside Up.\n\nRichman's music has set the tone for many alternative rock bands, such as Violent Femmes, Galaxie 500, They Might Be Giants (\"Roadrunner\" reportedly inspired John Flansburgh to become a musician), Weezer, Tullycraft, Jens Lekman, singer Frank Black (who composed the tribute song \"The Man Who Was Too Loud\"), Brandon Flowers, Art Brut, Craig Finn of the Hold Steady & Lifter Puller, Mac DeMarco and Nerf Herder who composed a song about him, titled \"Jonathan\", which appeared on the band's second album How To Meet Girls.  British country rock band the Rockingbirds released the single \"Jonathan, Jonathan\" in tribute to Richman in 1992. The Silos also covered the Modern Lovers' \"I'm Straight\".\n\nAs a producer himself, Richman and drummer Tommy Larkins produced Vic Chesnutt's final album Skitter on Take-Off in 2009 which appeared on Vapor Records.  Chesnutt opened for Richman at concerts many times during his later years.\n\n\"Roadrunner\" is on the School of Rock soundtrack. In the commentary, director Richard Linklater mentions it is often called \"the first punk song\" and wanted to include it for that reason, along with all the other seminal rock songs in that film.\n\nA tribute album, If I Were a Richman: a Tribute to the Music of Jonathan Richman, was released by Wampus Multimedia in 2001.\n\nRapper M.I.A. featured the opening lyrics from \"Roadrunner\" in the song \"Bamboo Banga\" on her 2007 album, Kala.\n\nDiscography\n\nStudio albums\n\nThe Modern Lovers\n\n* The Modern Lovers (1976)\n* Modern Lovers 'Live' (1978)Modern Lovers ‘Live’, Modern Lovers, Beserkley “Home of the Hits”, Stereo, JBZ-0055,  1978\n* The Original Modern Lovers (1981)\n\nJonathan Richman and the Modern Lovers\n\n* Jonathan Richman and the Modern Lovers (1976)\n* Rock 'n' Roll with the Modern Lovers (1977) UK #50 http://www.officialcharts.com/artist/_/jonathan%20richman%20%26%20the%20modern%20lovers/\n* Back in Your Life (1979)\n* Jonathan Sings! (1983)\n* Rockin' and Romance (1985)\n* It's Time For (1986)\n* Modern Lovers 88 (1987)\n* The Best Of Jonathan Richman & the Modern Lovers (1999)\n\nJonathan Richman\n\n* Jonathan Richman (1989)\n* Jonathan Goes Country (1990)\n* Having a Party with Jonathan Richman (1991)\n* I, Jonathan (1992)\n* ¡Jonathan, Te Vas a Emocionar! (1994)\n* You Must Ask the Heart (1995)\n* Surrender to Jonathan (1996)\n* I'm So Confused (1998)\n* Radio On/Stop And Shop with the Modern Lovers (2 on 1) (1998)\n* Her Mystery Not of High Heels and Eye Shadow (2001)\n* Not So Much to Be Loved as to Love (2004)\n* Revolution Summer (2007)\n* Because Her Beauty Is Raw and Wild (2008)\n* ¿A qué venimos sino a caer? (2008)\n* O Moon, Queen of Night on Earth (2010)\n* Ishkode! Ishkode! (2016)\n\nLive albums\n\n* Modern Lovers 'Live (1977)\n* Live at the Longbranch Saloon (1992)\n* Precise Modern Lovers Order (1994)\n* Live at the Longbranch and More (1998)\n(These last three live albums are from the same three 1971-3 performances, but add and subtract a few different songs. The last two, combined, contain all the songs.)\n\nCompilations\n\n* Alternate versions of \"Roadrunner\" and \"Government Center\", along with \"The New Teller\", and \"It Will Stand\", first appeared on the Beserkley Chartbusters Vol. 1 compilation (1975)\n* \"I'm Straight\" and \"Government Center\", from the Modern Lovers' Kim Fowley-produced Beserkley sessions, first appeared on the Warner Bros. Records compilation Troublemakers (1980)\n* \"I Like Gumby\"; On the Gumby compilation album – Jonathan Richman\n* 1993, contributed \"Hot Nights\" (live) to the AIDS-Benefit Album No Alternative produced by the Red Hot Organization.\n* Performs \"Stop Your Sobbing\" on the 2002 Kinks tribute album This Is Where I Belong.\n* Action Packed: The Best Of Jonathan Richman (2002)\n* \"The Origin of Love\" on Wig in a Box (2003)\n* \"Our Dog Is Getting Older Now\" on the charity album Colours Are Brighter (October 2006)\n* Think About Mustapha (2 songs) (1994)\n* No Me Quejo De Mi Estrella  (2014)\n\nSingles\n\nUS issues except where stated\n* \"Roadrunner\" / \"It Will Stand\" (United Artists UP36006, 1975)\n* \"Roadrunner\" / (\"Friday on My Mind\" by Earth Quake) (Beserkley B-4701, 1976)\n* \"Roadrunner (Once)\" / \"Roadrunner (Twice)\"  (Beserkley BZZ 1, UK, 1976) UK #11\n* \"Roadrunner\" / \"Pablo Picasso\" (Beserkley PA-205, 1976)\n* \"New England\" / \"Here Come The Martian Martians\" (Beserkley B-5743, 1976)\n* \"Egyptian Reggae\" / \"Ice Cream Man\" \t(Beserkley 6.12 217, 1977)\n* \"Egyptian Reggae\" / \"Rollercoaster by the Sea\" (Beserkley BZZ 2, UK, 1977) UK #5\n* \"The Morning of Our Lives (Live)\" / \"Roadrunner (Thrice) (Live)\" (Beserkley BZZ 7, UK, 1977) UK #29\n* \"New England (Live)\" / \"Astral Plane (Live)\" (Beserkley BZZ 14, UK, 1978)\n* \"Abdul and Cleopatra\" / \"Astral Plane (Live)\" (Beserkley 11813, 1978)\n* \"Abdul and Cleopatra\" / \"Oh Carol\" (Beserkley BZZ 19, UK, 1978)\n* \"Buzz, Buzz, Buzz\" / \"Abdul and Cleopatra\" (Beserkley 6.12 311, 1978)\n* \"Buzz, Buzz, Buzz\" / \"Hospital (Live)\" (BZZ 25, UK, 1978)\n* \"My Little Kookenhaken\" / \"Roadrunner (Thrice) (Live)\" (Beserkley 11819, 1978)\n* \"South American Folk Song (Live)\" / \"Ice Cream Man (Live)\" (1978)\n* \"Lydia\" / \"Important in Your Life\" (BZZ 28, UK, 1979) \t \t\n* \"That Summer Feeling\" / \"This Kind of Music\" (1984)\n* \"That Summer Feeling\" / \"This Kind of Music\" / \"Tag Game\"  (Rough Trade RTT 152, UK, 1984)\n* \"I'm Just Beginning To Live\" / \"Circle I\" (1985)\n* \"I'm Just Beginning To Live\" / \"Circle I\" / \"Shirin and Fahrad\" (Rough Trade RTT 154, UK, 1985)\t\n* \"California Desert Party\" / \"When Harpo Played His Harp\" (DRD 1D474, Spain, 1988)\n* \"Egyptian Reggae\" / \"Roadrunner\" (1989)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jonathan Richman" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16053" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jonathan Michael Richman[http://www.ascap.com/ACE/search.cfm?requesttimeout300&mode\nresults&searchstr7849275&search_in\nc&search_typeexact&search_det\nt,s,w,p,b,v&results_pp20&start\n1 ASCAP records for Jonathan Richman]   (born May 16, 1951) is an American singer, songwriter and guitarist. In 1970 he founded the Modern Lovers, an influential proto-punk band. Since the mid-1970s, Richman has worked either solo or with low-key, acoustic and electric, backing.  Currently, he plays only acoustic to protect his hearing.  He is known for his wide-eyed, unaffected and childlike outlook, and music that, while rooted in rock and roll, is influenced by music from around the world.\n\nBiography\n\nEarly life\n\nBorn in Natick, Massachusetts, into a Jewish family,[https://books.google.com/books?idtDk6FuQcxpoC&printsec\nfrontcover&dq%22jonathan+richman%22+jewish&hl\nen&saX&ei\nVNTEU6fzLMSg7AatuoH4Dg&ved0CB8Q6AEwAA#v\nonepage&q%22jonathan%20richman%22%20jewish&f\nfalse  Steven Lee Beeber, The Heebie-Jeebies at CBGB's: A Secret History of Jewish Punk, Chicago Review Press, 2008, pp.49-62] Richman began playing music and writing his own songs in the mid-1960s. He became infatuated with the Velvet Underground, and in 1969 he moved to New York City, lived on the couch of their manager, Steve Sesnick, worked odd jobs and tried to break in as a professional musician. Failing at this, he returned to Boston.\n\nThe Modern Lovers\n\nWhile in Boston, Richman formed the Modern Lovers, a proto-punk garage rock band. Other notable members of the group were keyboard player Jerry Harrison and drummer David Robinson, who later joined Talking Heads and the Cars, respectively.\n\nIn 1972 they recorded a series of demos with producer John Cale (formerly of the Velvet Underground). Among these songs were the seminal \"Roadrunner\" and \"Pablo Picasso\" which were eventually released on the group's post-breakup album, The Modern Lovers (August 1976). The album was strange for its time, featuring Velvets-influenced basic three-chord rock (\"Roadrunner\" — based on just two chords – is an homage to \"Sister Ray\") at a time when glam and progressive rock were the norm.\n\nLater in 1972, the group also recorded with producer Kim Fowley; these demos were eventually released in 1981 as The Original Modern Lovers. Despite playing live regularly, the Modern Lovers had a difficult time securing a recording contract. By late 1973, Richman wanted to scrap the recorded tracks and start again with a mellower, more lyrical sound, influenced by the laid-back local music he had heard when the band had a residency at the Inverurie Hotel in Bermuda earlier in the year.  This stymied efforts to complete a debut album, and led to the breakup of the original Modern Lovers in February 1974.\n\nJonathan Richman and the Modern Lovers\n\nIn 1975, Richman moved to California to record as a solo singer/songwriter with Beserkley Records. His first released recordings appeared on 1975's Beserkley Chartbusters compilation, where he was backed by members of Earth Quake and the Rubinoos; these four songs also appeared on singles on the independent Beserkley label.\n\nIn January 1976, Richman put together a new version of the Modern Lovers, which included original Modern Lovers drummer, David Robinson, along with former Rubinoos bassist Greg 'Curly' Keranen and Leroy Radcliffe on guitar. The albums produced by the new group found Richman turning away from electric rock music towards gentler acoustic textures, with a strong rooting in 1950s rock and roll (Chuck Berry's \"Back in the USA\" was part of his repertoire).\n\nThe album Jonathan Richman and the Modern Lovers was released in May 1976 (three months before the earlier The Modern Lovers sessions were finally released) but David Robinson left the group soon thereafter, due to frustration with Richman's quest for lower volume levels, and joined with Ric Ocasek in forming the band the Cars.\n\nAfter several months as a trio, Richman found a new drummer, D. Sharpe, an avant-garde jazz player on the Boston scene, who later went on to become a member of pianist Carla Bley's band.\n\nRock and Roll with the Modern Lovers was released in 1977 and, just as this record began to climb the charts in Europe, Keranen left the group (to attend college). A subsequent live album, Modern Lovers Live, was released in 1978, with Asa Brebner on bass.\n\nIn the United Kingdom, Richman was recognised as a progenitor of the punk rock scene, and several of his singles became hits. \"Roadrunner\" reached Number 11 in the UK Singles Chart, and its follow-up, the instrumental \"Egyptian Reggae\", made Number 5 in late 1977. \"Egyptian Reggae\" was a version of Jamaican musician Earl Zero's reggae song \"None Shall Escape the Judgment\"; Zero was credited as co-writer on Richman's later versions of the track.\n\nBack in Your Life was released in 1979 under the \"Jonathan Richman and the Modern Lovers\" moniker, but only about half the disc featured a backup band. The rest was solo work.\n\nSolo\n\nFollowing the Modern Lovers' final breakup, Richman went on sabbatical for a few years, staying in Appleton, Maine, and playing at local bars in Belfast, Maine.\n\nHe returned to recording in 1983 with Jonathan Sings!, followed by Rockin' and Romance (produced by Andy Paley and engineered by Daniel Levitin).  These were followed up with US tours and a brace of pop recordings (It's Time for Jonathan Richman and the Modern Lovers, and Modern Lovers 88 from 1986 and 1988 respectively). After the latter release, the \"Modern Lovers\" moniker was finally retired, and having begun a true solo career, he returned to a variety of musical genres: country music with 1990's Jonathan Goes Country, and Spanish translations of his earlier work (as well as traditional Spanish language songs) with Jonathan, Te Vas a Emocionar! (1993).\n\nIn 1993, he contributed the track \"Hot Nights\" to the AIDS-Benefit Album No Alternative produced by the Red Hot Organization.\n\nAlways possessing an ardent cult following, Richman has become better known in recent years thanks to a series of appearances on Late Night with Conan O'Brien.\n\nAnother major profile boost was a key part in the Farrelly Brothers' 1998 film There's Something About Mary, where he played half of a two-man Greek chorus with drummer Tommy Larkins, that commented on the plot while performing in the framed action itself. He also appeared briefly in a bar scene in a previous Farrelly Brothers film, Kingpin, and performed the song \"As We Walk to Fenway Park\" for their 2005 comedy, Fever Pitch.\n\nRichman has continued his release schedule all along, with You Must Ask the Heart (1995), Surrender to Jonathan (1996), I'm So Confused (1998), Her Mystery Not of High Heels and Eye Shadow (2001), and Not So Much to Be Loved as to Love (2004). In 1998 a live album of Modern Lovers recordings from the early 1970s was released, Live at the Long Branch & More. There is also a DVD of a live performance, Take me to the Plaza (2002).\n\nRichman's minimalist songwriting style has been described as whimsical and childlike. He himself has stated, \"I don’t write, really. I just make up songs.\"\n\nRichman frequently tours with drummer Tommy Larkins.\n\nPersonal life\n\nHis first marriage was to Gail Clook of Vermont, in 1983, with whom he has a daughter, Jenny Rae. This marriage ended in divorce sometime shortly before the release of Surrender to Jonathan (1996).\n\nIn 2003, Richman married Nicole Montalbano of Chico, California. She contributed backing vocals to the album Not So Much to Be Loved as to Love (2004).\n\nInfluence\n\nRichman's work with the first incarnation of Modern Lovers is a major influence on punk rock. One critic called him the \"Godfather of Punk\".[http://archive.salon.com/people/bc/2001/09/04/richman/index.html \"Brilliant Careers: Jonathan Richman\"] , Salon, September 4, 2001. Artists as diverse as the Sex Pistols and Joan Jett have covered \"Roadrunner\". Boston ska-punk band Big D and the Kids Table have covered \"New England\" live and on their Gypsy Hill EP. A version of \"Pablo Picasso\" performed by Burning Sensations was included in the 1984 cult film, Repo Man. David Bowie covered \"Pablo Picasso\" on his album Reality. Velvet Underground founding member John Cale has a version of the song on his 1975 album, Helen of Troy, and continues to include the song in his live shows. Iggy Pop has performed \"Pablo Picasso\" live and wrote an extra verse for it. Echo and the Bunnymen covered \"She Cracked\" in concert in 1984 and 1985 and Siouxsie and the Banshees have a version of the song on Downside Up.\n\nRichman's music has set the tone for many alternative rock bands, such as Violent Femmes, Galaxie 500, They Might Be Giants (\"Roadrunner\" reportedly inspired John Flansburgh to become a musician), Weezer, Tullycraft, Jens Lekman, singer Frank Black (who composed the tribute song \"The Man Who Was Too Loud\"), Brandon Flowers, Art Brut, Craig Finn of the Hold Steady & Lifter Puller, Mac DeMarco and Nerf Herder who composed a song about him, titled \"Jonathan\", which appeared on the band's second album How To Meet Girls.  British country rock band the Rockingbirds released the single \"Jonathan, Jonathan\" in tribute to Richman in 1992. The Silos also covered the Modern Lovers' \"I'm Straight\".\n\nAs a producer himself, Richman and drummer Tommy Larkins produced Vic Chesnutt's final album Skitter on Take-Off in 2009 which appeared on Vapor Records.  Chesnutt opened for Richman at concerts many times during his later years.\n\n\"Roadrunner\" is on the School of Rock soundtrack. In the commentary, director Richard Linklater mentions it is often called \"the first punk song\" and wanted to include it for that reason, along with all the other seminal rock songs in that film.\n\nA tribute album, If I Were a Richman: a Tribute to the Music of Jonathan Richman, was released by Wampus Multimedia in 2001.\n\nRapper M.I.A. featured the opening lyrics from \"Roadrunner\" in the song \"Bamboo Banga\" on her 2007 album, Kala.\n\nDiscography\n\nStudio albums\n\nThe Modern Lovers\n\n* The Modern Lovers (1976)\n* Modern Lovers 'Live' (1978)Modern Lovers ‘Live’, Modern Lovers, Beserkley “Home of the Hits”, Stereo, JBZ-0055,  1978\n* The Original Modern Lovers (1981)\n\nJonathan Richman and the Modern Lovers\n\n* Jonathan Richman and the Modern Lovers (1976)\n* Rock 'n' Roll with the Modern Lovers (1977) UK #50 http://www.officialcharts.com/artist/_/jonathan%20richman%20%26%20the%20modern%20lovers/\n* Back in Your Life (1979)\n* Jonathan Sings! (1983)\n* Rockin' and Romance (1985)\n* It's Time For (1986)\n* Modern Lovers 88 (1987)\n* The Best Of Jonathan Richman & the Modern Lovers (1999)\n\nJonathan Richman\n\n* Jonathan Richman (1989)\n* Jonathan Goes Country (1990)\n* Having a Party with Jonathan Richman (1991)\n* I, Jonathan (1992)\n* ¡Jonathan, Te Vas a Emocionar! (1994)\n* You Must Ask the Heart (1995)\n* Surrender to Jonathan (1996)\n* I'm So Confused (1998)\n* Radio On/Stop And Shop with the Modern Lovers (2 on 1) (1998)\n* Her Mystery Not of High Heels and Eye Shadow (2001)\n* Not So Much to Be Loved as to Love (2004)\n* Revolution Summer (2007)\n* Because Her Beauty Is Raw and Wild (2008)\n* ¿A qué venimos sino a caer? (2008)\n* O Moon, Queen of Night on Earth (2010)\n* Ishkode! Ishkode! (2016)\n\nLive albums\n\n* Modern Lovers 'Live (1977)\n* Live at the Longbranch Saloon (1992)\n* Precise Modern Lovers Order (1994)\n* Live at the Longbranch and More (1998)\n(These last three live albums are from the same three 1971-3 performances, but add and subtract a few different songs. The last two, combined, contain all the songs.)\n\nCompilations\n\n* Alternate versions of \"Roadrunner\" and \"Government Center\", along with \"The New Teller\", and \"It Will Stand\", first appeared on the Beserkley Chartbusters Vol. 1 compilation (1975)\n* \"I'm Straight\" and \"Government Center\", from the Modern Lovers' Kim Fowley-produced Beserkley sessions, first appeared on the Warner Bros. Records compilation Troublemakers (1980)\n* \"I Like Gumby\"; On the Gumby compilation album – Jonathan Richman\n* 1993, contributed \"Hot Nights\" (live) to the AIDS-Benefit Album No Alternative produced by the Red Hot Organization.\n* Performs \"Stop Your Sobbing\" on the 2002 Kinks tribute album This Is Where I Belong.\n* Action Packed: The Best Of Jonathan Richman (2002)\n* \"The Origin of Love\" on Wig in a Box (2003)\n* \"Our Dog Is Getting Older Now\" on the charity album Colours Are Brighter (October 2006)\n* Think About Mustapha (2 songs) (1994)\n* No Me Quejo De Mi Estrella  (2014)\n\nSingles\n\nUS issues except where stated\n* \"Roadrunner\" / \"It Will Stand\" (United Artists UP36006, 1975)\n* \"Roadrunner\" / (\"Friday on My Mind\" by Earth Quake) (Beserkley B-4701, 1976)\n* \"Roadrunner (Once)\" / \"Roadrunner (Twice)\"  (Beserkley BZZ 1, UK, 1976) UK #11\n* \"Roadrunner\" / \"Pablo Picasso\" (Beserkley PA-205, 1976)\n* \"New England\" / \"Here Come The Martian Martians\" (Beserkley B-5743, 1976)\n* \"Egyptian Reggae\" / \"Ice Cream Man\" \t(Beserkley 6.12 217, 1977)\n* \"Egyptian Reggae\" / \"Rollercoaster by the Sea\" (Beserkley BZZ 2, UK, 1977) UK #5\n* \"The Morning of Our Lives (Live)\" / \"Roadrunner (Thrice) (Live)\" (Beserkley BZZ 7, UK, 1977) UK #29\n* \"New England (Live)\" / \"Astral Plane (Live)\" (Beserkley BZZ 14, UK, 1978)\n* \"Abdul and Cleopatra\" / \"Astral Plane (Live)\" (Beserkley 11813, 1978)\n* \"Abdul and Cleopatra\" / \"Oh Carol\" (Beserkley BZZ 19, UK, 1978)\n* \"Buzz, Buzz, Buzz\" / \"Abdul and Cleopatra\" (Beserkley 6.12 311, 1978)\n* \"Buzz, Buzz, Buzz\" / \"Hospital (Live)\" (BZZ 25, UK, 1978)\n* \"My Little Kookenhaken\" / \"Roadrunner (Thrice) (Live)\" (Beserkley 11819, 1978)\n* \"South American Folk Song (Live)\" / \"Ice Cream Man (Live)\" (1978)\n* \"Lydia\" / \"Important in Your Life\" (BZZ 28, UK, 1979) \t \t\n* \"That Summer Feeling\" / \"This Kind of Music\" (1984)\n* \"That Summer Feeling\" / \"This Kind of Music\" / \"Tag Game\"  (Rough Trade RTT 152, UK, 1984)\n* \"I'm Just Beginning To Live\" / \"Circle I\" (1985)\n* \"I'm Just Beginning To Live\" / \"Circle I\" / \"Shirin and Fahrad\" (Rough Trade RTT 154, UK, 1985)\t\n* \"California Desert Party\" / \"When Harpo Played His Harp\" (DRD 1D474, Spain, 1988)\n* \"Egyptian Reggae\" / \"Roadrunner\" (1989). Jonathan Richman. http://en.wikipedia.org/?curid=16053."
  }
}
