{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1372",
  "eid" : "b9a816d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778391229,
  "textBody" : "Amber is fossilized tree resin, which has been appreciated for its color and natural beauty since Neolithic times. Much valued from antiquity to the present as a gemstone, amber is made into a variety of decorative objects.\"Amber\" (2004). In Maxine N. Lurie and Marc Mappen (eds.) Encyclopedia of New Jersey, Rutgers University Press, . Amber is used in jewelry. It has also been used as a healing agent in folk medicine.\n\nThere are five classes of amber, defined on the basis of their chemical constituents. Because it originates as a soft, sticky tree resin, amber sometimes contains animal and plant material as inclusions. Amber occurring in coal seams is also called resinite, and the term ambrite is applied to that found specifically within New Zealand coal seams.Poinar GO, Poinar R. (1995) The quest for life in amber. Basic Books, , p. 133\n\nEtymology\n\nThe English word amber derives from Arabic   (cognate with Middle Persian ambar[http://www.rabbinics.org/pahlavi/MacKenzie-PahlDict.pdf A Concise Pahlavi Dictionary, D N MacKenzie, Oxford University Press, 1971], ) via Middle Latin ambar and Middle French ambre. The word was adopted in Middle English in the 14th century as referring to what is now known as ambergris (ambre gris or \"grey amber\"), a solid waxy substance derived from the sperm whale. \nIn the Romance languages, the sense of the word had come to be extended to Baltic amber (fossil resin) from as early as the late 13th century. At first called white or yellow amber (ambre jaune), this meaning was adopted in English by the early 15th century. As the use of ambergris waned, this became the main sense of the word. and \n\nThe two substances (\"yellow amber\" and \"grey amber\") conceivably became associated or confused because they both were found washed up on beaches. Ambergris is less dense than water and floats, whereas amber is too dense to float, though less dense than stone.see: Abu Zaid al Hassan from Siraf & Sulaiman the Merchant (851), Silsilat-al-Tawarikh (travels in Asia). \n \nThe classical names for amber, Latin electrum and Ancient Greek   (ēlektron), are connected to a term ἠλέκτωρ (ēlektōr) meaning \"beaming Sun\".\nHomeric (Iliad 6.513, 19.398). The feminine  being later used as a name of the Moon.\nThe derivation of the modern term  \"electric\"  from the Greek word for amber dates to the 1600 (Latin electricus \"amber-like\", in De Magnete by William Gilbert). .\nThe word  \"electron\"  (for the fundamental particle) was coined in 1891 by the Irish physicist George Stoney whilst analyzing elementary charges for the first time. .  According to myth, when Phaëton son of Helios (the Sun)  was killed, his mourning sisters became poplar trees, and their tears became  elektron, amber.Michael R. Collings, Gemlore: An Introduction to Precious and Semi-Precious Stones, 2009, p. 20\n\nHistory\n \nAmber is discussed by Theophrastus in the 4th century BC, and again by Pytheas (c. 330 BC) whose work \"On the Ocean\" is lost, but was referenced by Pliny the Elder, according to whose The Natural History  (in what is also the earliest known mention of the name Germania):Natural History [http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.02.0137%3Abook%3D37%3Achapter%3D11 37.11].\nPytheas says that the Gutones, a people of Germany, inhabit the shores of an estuary of the Ocean called Mentonomon, their territory extending a distance of six thousand stadia; that, at one day's sail from this territory, is the Isle of Abalus, upon the shores of which, amber is thrown up by the waves in spring, it being an excretion of the sea in a concrete form; as, also, that the inhabitants use this amber by way of fuel, and sell it to their neighbors, the Teutones.\nEarlierNatural History [http://www.perseus.tufts.edu/cgi-bin/ptext?docPerseus%3Atext%3A1999.02.0137;query\nchapter%3D%23172;layout;loc\n4.26 IV.27.13] or IV.13.95 in the Loeb edition. Pliny says that a large island of three days' sail from the Scythian coast called Balcia by Xenophon of Lampsacus, author of a fanciful travel book in Greek, is called Basilia by Pytheas. It is generally understood to be the same as Abalus. Based on the amber, the island could have been Heligoland, Zealand, the shores of Bay of Gdansk, the Sambia Peninsula or the Curonian Lagoon, which were historically the richest sources of amber in northern Europe.\nIt is assumed that there were well-established trade routes for amber connecting the Baltic with the Mediterranean (known as the \"Amber Road\"). Pliny states explicitly that the Germans export amber to Pannonia, from where it was traded further abroad by the Veneti.\nThe ancient Italic peoples of southern Italy were working amber, the most important examples are on display at the National Archaeological Museum of Siritide to Matera.\nAmber used in antiquity as at Mycenae and in the prehistory of the Mediterranean comes from deposits of Sicily.\n\nPliny also cites the opinion of Nicias, according to whom amber:is a liquid produced by the rays of the sun; and that these rays, at the moment of the sun's setting, striking with the greatest force upon the surface of the soil, leave upon it an unctuous sweat, which is carried off by the tides of the Ocean, and thrown up upon the shores of Germany. Besides the fanciful explanations according to which amber is \"produced by the Sun\", Pliny cites opinions that are well aware of its origin in tree resin, citing the native Latin name of succinum (sūcinum, from sucus \"juice\").succinic acid as well as succinite, a term given to a particular type of amber by James Dwight Dana He writes: Amber is produced from a marrow discharged by trees belonging to the pine genus, like gum from the cherry, and resin from the ordinary pine. It is a liquid at first, which issues forth in considerable quantities, and is gradually hardened [...] Our forefathers, too, were of opinion that it is the juice of a tree, and for this reason gave it the name of \"succinum\" and one great proof that it is the produce of a tree of the pine genus, is the fact that it emits a pine-like smell when rubbed, and that it burns, when ignited, with the odour and appearance of torch-pine wood.He also states that amber is also found in Egypt and in India, and he even refers to the electrostatic properties of amber, by saying that \"in Syria the women make the whorls of their spindles of this substance, and give it the name of harpax [from ἁρπάζω, \"to drag\"] from the circumstance that it attracts leaves towards it, chaff, and the light fringe of tissues.\"\n\nPliny says that the German name of amber was glæsum, \"for which reason the Romans, when Germanicus Cæsar commanded the fleet in those parts, gave to one of these islands the name of Glæsaria, which by the barbarians was known as Austeravia\". This is confirmed by the recorded Old High German glas  and Old English glær for \"amber\" (c.f. glass).\nIn Middle Low German, amber was known as berne-, barn-, börnstēn. The Low German term became dominant also in High German by the 18th century, thus modern German Bernstein besides Dutch Dutch barnsteen.\n\nThe Baltic Lithuanian term for amber is gintaras and Latvian dzintars. They, and the Slavic jantar or Hungarian gyanta ('resin'), are thought to originate from Phoenician jainitar (\"sea-resin\").\n\nEarly in the nineteenth century, the first reports of amber from North America came from discoveries in New Jersey along Crosswicks Creek near Trenton, at Camden, and near Woodbury.\n\nComposition and formation\n\nAmber is heterogeneous in composition, but consists of several resinous bodies more or less soluble in alcohol, ether and chloroform, associated with an insoluble bituminous substance. Amber is a macromolecule by free radical polymerization of several precursors in the labdane family, e.g. communic acid, cummunol, and biformene.Manuel Villanueva-García, Antonio Martínez-Richa, and Juvencio Robles [http://www.arkat-usa.org/ark/journal/2005/I06_Juaristi/1567/EJ-1567C.asp Assignment of vibrational spectra of labdatriene derivatives and ambers: A combined experimental and density functional theoretical study] Arkivoc (EJ-1567C) pp. 449–458 These labdanes are diterpenes (C20H32) and trienes, equipping the organic skeleton with three alkene groups for polymerization. As amber matures over the years, more polymerization takes place as well as isomerization reactions, crosslinking and cyclization.\n\nHeated above 200 C, amber decomposes, yielding an oil of amber, and leaves a black residue which is known as \"amber colophony\", or \"amber pitch\"; when dissolved in oil of turpentine or in linseed oil this forms \"amber varnish\" or \"amber lac\".\n\nFormation\n\nMolecular polymerization, resulting from high pressures and temperatures produced by overlying sediment, transforms the resin first into copal. Sustained heat and pressure drives off terpenes and results in the formation of amber.\n\nFor this to happen, the resin must be resistant to decay. Many trees produce resin, but in the majority of cases this deposit is broken down by physical and biological processes. Exposure to sunlight, rain, microorganisms (such as bacteria and fungi), and extreme temperatures tends to disintegrate resin. For resin to survive long enough to become amber, it must be resistant to such forces or be produced under conditions that exclude them.Poinar, George O. (1992) Life in amber. Stanford, Calif.: Stanford University Press, p. 12, \n\nBotanical origin\n\nFossil resins from Europe fall into two categories, the famous Baltic ambers and another that resembles the Agathis group.  Fossil resins from the Americas and Africa are closely related to the modern genus Hymenaea, while Baltic ambers are thought to be fossil resins from Sciadopityaceae family plants that used to live in north Europe.\n\nInclusions\n\nThe abnormal development of resin in living trees (succinosis) can result in the formation of amber. Impurities are quite often present, especially when the resin dropped onto the ground, so the material may be useless except for varnish-making. Such impure amber is called firniss.\n\nSuch inclusion of other substances can cause amber to have an unexpected color. Pyrites may give a bluish color.  Bony amber owes its cloudy opacity to numerous tiny bubbles inside the resin. However, so-called black amber is really only a kind of jet.\n\nIn darkly clouded and even opaque amber, inclusions can be imaged using high-energy, high-contrast, high-resolution X-rays.\n\nExtraction and processing\n\nDistribution and mining \n\nAmber is globally distributed, mainly in rocks of Cretaceous age or younger.\nHistorically, the Samland coast west of Königsberg in Prussia was the world's leading source of amber. The first mentions of amber deposits here date back to the 12th century.[https://ambery.net/blog/2016/07/history-of-russian-amber-1/ \"The History of Russian Amber, Part 1: The Beginning\"], Ambery.net About 90% of the world's extractable amber is still located in that area, which became the Kaliningrad Oblast of Russia in 1946.[http://gurukul.ucc.american.edu/ted/amber.htm Amber Trade and the Environment in the Kaliningrad Oblast] . Gurukul.ucc.american.edu. Retrieved on 19 September 2012.\n\nPieces of amber torn from the seafloor are cast up by the waves, and collected by hand, dredging, or diving. Elsewhere, amber is mined, both in open works and underground galleries. Then nodules of blue earth have to be removed and an opaque crust must be cleaned off, which can be done in revolving barrels containing sand and water. Erosion removes this crust from sea-worn amber.\n\nCaribbean amber, especially Dominican blue amber, is mined through bell pitting, which is dangerous due to the risk of tunnel collapse.Wichard, Wilfred and Weitschat, Wolfgang (2004) Im Bernsteinwald. – Gerstenberg Verlag, Hildesheim, \n\nTreatment\n\nThe Vienna amber factories, which use pale amber to manufacture pipes and other smoking tools, turn it on a lathe and polish it with whitening and water or with rotten stone and oil. The final luster is given by friction with flannel.\n\nWhen gradually heated in an oil-bath, amber becomes soft and flexible. Two pieces of amber may be united by smearing the surfaces with linseed oil, heating them, and then pressing them together while hot. Cloudy amber may be clarified in an oil-bath, as the oil fills the numerous pores to which the turbidity is due. Small fragments, formerly thrown away or used only for varnish, are now used on a large scale in the formation of \"ambroid\" or \"pressed amber\".\n\nThe pieces are carefully heated with exclusion of air and then compressed into a uniform mass by intense hydraulic pressure, the softened amber being forced through holes in a metal plate. The product is extensively used for the production of cheap jewelry and articles for smoking. This pressed amber yields brilliant interference colors in polarized light. Amber has often been imitated by other resins like copal and kauri gum, as well as by celluloid and even glass. Baltic amber is sometimes colored artificially, but also called \"true amber\".\n\nAppearance \n\nAmber occurs in a range of different colors. As well as the usual yellow-orange-brown that is associated with the color \"amber\", amber itself can range from a whitish color through a pale lemon yellow, to brown and almost black. Other uncommon colors include red amber (sometimes known as \"cherry amber\"), green amber, and even blue amber, which is rare and highly sought after.\n\nYellow amber is a hard fossil resin from evergreen trees, and despite the name it can be translucent, yellow, orange, or brown colored. Known to the Iranians by the Pahlavi compound word kah-ruba (from kah \"straw\" plus rubay \"attract, snatch\", referring to its electrical properties), which entered Arabic as kahraba' or kahraba (which later became the Arabic word for electricity, كهرباء kahrabā'), it too was called amber in Europe (Old French and Middle English ambre). Found along the southern shore of the Baltic Sea, yellow amber reached the Middle East and western Europe via trade. Its coastal acquisition may have been one reason yellow amber came to be designated by the same term as ambergris. Moreover, like ambergris, the resin could be burned as an incense. The resin's most popular use was, however, for ornamentation—easily cut and polished, it could be transformed into beautiful jewelry.\nMuch of the most highly prized amber is transparent, in contrast to the very common cloudy amber and opaque amber. Opaque amber contains numerous minute bubbles. This kind of amber is known as \"bony amber\".\"Amber\". (1999). In G. W. Bowersock, Peter Brown, Oleg Grabar (eds.) Late Antiquity: A Guide to the Postclassical World, Harvard University Press, .\n\nAlthough all Dominican amber is fluorescent, the rarest Dominican amber is blue amber. It turns blue in natural sunlight and any other partially or wholly ultraviolet light source. In long-wave UV light it has a very strong reflection, almost white. Only about 100 kg is found per year, which makes it valuable and expensive.\n\nSometimes amber retains the form of drops and stalactites, just as it exuded from the ducts and receptacles of the injured trees. It is thought that, in addition to exuding onto the surface of the tree, amber resin also originally flowed into hollow cavities or cracks within trees, thereby leading to the development of large lumps of amber of irregular form.\n\nClassification\n\nAmber can be classified into several forms. Most fundamentally, there are two types of plant resin with the potential for fossilization. Terpenoids, produced by conifers and angiosperms, consist of ring structures formed of isoprene (C5H8) units. Phenolic resins are today only produced by angiosperms, and tend to serve functional uses. The extinct medullosans produced a third type of resin, which is often found as amber within their veins. The composition of resins is highly variable; each species produces a unique blend of chemicals which can be identified by the use of pyrolysis–gas chromatography–mass spectrometry. The overall chemical and structural composition is used to divide ambers into five classes. There is also a separate classification of amber gemstones, according to the way of production.\n\nClass I\n\nThis class is by far the most abundant. It comprises labdatriene carboxylic acids such as communic or ozic acids. It is further split into three sub-classes. Classes Ia and Ib utilize regular labdanoid diterpenes (e.g. communic acid, communol, biformenes), while Ic uses enantio labdanoids (ozic acid, ozol, enantio biformenes).\n\nIa\n\nIncludes Succinite ('normal' Baltic amber) and Glessite. Have a communic acid base. They also include much succinic acid.\n\nBaltic amber yields on dry distillation succinic acid, the proportion varying from about 3% to 8%, and being greatest in the pale opaque or bony varieties. The aromatic and irritating fumes emitted by burning amber are mainly due to this acid. Baltic amber is distinguished by its yield of succinic acid, hence the name succinite. Succinite has a hardness between 2 and 3, which is rather greater than that of many other fossil resins. Its specific gravity varies from 1.05 to 1.10. It can be distinguished from other ambers via IR spectroscopy due to a specific carbonyl absorption peak. IR spectroscopy can detect the relative age of an amber sample. Succinic acid may not be an original component of amber, but rather a degradation product of abietic acid.\n\nIb\n\nLike class Ia ambers, these are based on communic acid; however, they lack succinic acid.\n\nIc\n\nThis class is mainly based on enantio-labdatrienonic acids, such as ozic and zanzibaric acids. Its most familiar representative is Dominican amber.\n\nDominican amber differentiates itself from Baltic amber by being mostly transparent and often containing a higher number of fossil inclusions. This has enabled the detailed reconstruction of the ecosystem of a long-vanished tropical forest.George Poinar, Jr. and Roberta Poinar, 1999. The Amber Forest: A Reconstruction of a Vanished World, (Princeton University Press)  Resin from the extinct species Hymenaea protera is the source of Dominican amber and probably of most amber found in the tropics. It is not \"succinite\" but \"retinite\".Grimaldi, D. A. (1996) Amber – Window to the Past. – American Museum of Natural History, New York, \n\nClass II\n\nThese ambers are formed from resins with a sesquiterpenoid base, such as cadinene.\n\nClass III\n\nThese ambers are polystyrenes.\n\nClass IV\n\nClass IV is something of a wastebasket; its ambers are not polymerized, but mainly consist of cedrene-based sesquiterpenoids.\n\nClass V\n\nClass V resins are considered to be produced by a pine or pine relative. They comprise a mixture of diterpinoid resins and n-alkyl compounds. Their main variety is Highgate copalite.\n\nGeological record\n\nThe oldest amber recovered dates to the Upper Carboniferous period (). Its chemical composition makes it difficult to match the amber to its producers – it is most similar to the resins produced by flowering plants; however, there are no flowering plant fossils until the Cretaceous, and they were not common until the Upper Cretaceous. Amber becomes abundant long after the Carboniferous, in the Early Cretaceous, , when it is found in association with insects. The oldest amber with arthropod inclusions comes from the Levant, from Lebanon and Jordan. This amber, roughly 125–135 million years old, is considered of high scientific value, providing evidence of some of the oldest sampled ecosystems.Poinar, P.O., Jr., and R.K. Milki (2001) Lebanese Amber: The Oldest Insect Ecosystem in Fossilized Resin. Oregon State University Press, Corvallis. .\n\nIn Lebanon, more than 450 outcrops of Lower Cretaceous amber were discovered by Dany Azar,  a Lebanese paleontologist and entomologist. Among these outcrops, 20 have yielded biological inclusions comprising the oldest representatives of several recent families of terrestrial arthropods. Even older, Jurassic amber has been found recently in Lebanon as well. Many remarkable insects and spiders were recently discovered in the amber of Jordan including the oldest zorapterans, clerid beetles, umenocoleid roaches, and achiliid planthoppers.\n\nBaltic amber or succinite (historically documented as Prussian amber) is found as irregular nodules in marine glauconitic sand, known as blue earth, occurring in the Lower Oligocene strata of Sambia in Prussia (in historical sources also referred to as Glaesaria). After 1945, this territory around Königsberg was turned into Kaliningrad Oblast, Russia, where amber is now systematically mined.\n\nIt appears, however, to have been partly derived from older Eocene deposits and it occurs also as a derivative phase in later formations, such as glacial drift. Relics of an abundant flora occur as inclusions trapped within the amber while the resin was yet fresh, suggesting relations with the flora of Eastern Asia and the southern part of North America. Heinrich Göppert named the common amber-yielding pine of the Baltic forests Pinites succiniter, but as the wood does not seem to differ from that of the existing genus it has been also called Pinus succinifera. It is improbable, however, that the production of amber was limited to a single species; and indeed a large number of conifers belonging to different genera are represented in the amber-flora.\n\nPaleontological significance\n\nAmber is a unique preservational mode, preserving otherwise unfossilizable parts of organisms; as such it is helpful in the reconstruction of ecosystems as well as organisms;[http://db.bbc.co.uk/radio4/science/amber.shtml BBC – Radio 4 – Amber] . Db.bbc.co.uk (16 February 2005). Retrieved on 23 April 2011. the chemical composition of the resin, however, is of limited utility in reconstructing the phylogenetic affinity of the resin producer.\n\nAmber sometimes contains animals or plant matter that became caught in the resin as it was secreted. Insects, spiders and even their webs, annelids, frogs, crustaceans, bacteria and amoebae, marine microfossils, wood, flowers and fruit, hair, feathers and other small organisms have been recovered in Cretaceous ambers (deposited c. ). The oldest amber to bear fossils (mites) is from the Carnian (Triassic, ) of north-eastern Italy.\n\nUse\n\n \nAmber has been used since prehistory (Solutrean) in the manufacture of jewelry and ornaments, and also in folk medicine.\n\nJewelry\n\nAmber has been used as jewelry since the Stone Age, from 13,000 years ago. Amber ornaments have been found in Mycenaean tombs and elsewhere across Europe.[http://journals.cambridge.org/action/displayAbstract?fromPage\nonline&aid=8456512 Curt W. Beck, Anthony Harding and Helen Hughes-Brock, \"Amber in the Mycenaean World\" The Annual of the British School at Athens, vol. 69 (November 1974), pp. 145-172. DOI:10.1017/S0068245400005505] To this day it is used in the manufacture of smoking and glassblowing mouthpieces. Amber's place in culture and tradition lends it a tourism value; Palanga Amber Museum is dedicated to the fossilized resin.\n\nHistoric medicinal uses\n\nAmber has long been used in folk medicine for its purported healing properties.  Amber and extracts were used from the time of Hippocrates in ancient Greece for a wide variety of treatments through the Middle Ages and up until the early twentieth century.\n\nScent of amber and amber perfumery\n\nIn ancient China, it was customary to burn amber during large festivities. If amber is heated under the right conditions, oil of amber is produced, and in past times this was combined carefully with nitric acid to create \"artificial musk\" – a resin with a peculiar musky odor.. Although when burned, amber does give off a characteristic \"pinewood\" fragrance, modern products, such as perfume, do not normally use actual amber due to the fact that fossilized amber produces very little scent. In perfumery, scents referred to as “amber” are often created and patentedThermer, Ernst T. \"Saturated indane derivatives and processes for producing same\" , , issue date 1972Perfume compositions and perfume articles containing one isomer of an octahydrotetramethyl acetonaphthone, John B. Hall, Rumson; James Milton Sanders, Eatontown , Publication Date: 30 December 1975\nto emulate the opulent golden warmth of the fossil.[http://sorceryofscent.blogspot.com/2008/07/amber-perfumery-myth.html Sorcery of Scent: Amber: A perfume myth]. Sorceryofscent.blogspot.com (30 July 2008). Retrieved on 23 April 2011.\n\nThe modern name for amber is thought to come from the Arabic word, ambar, meaning ambergris. Ambergris is the waxy aromatic substance created in the intestines of sperm whales and was used in making perfumes both in ancient times as well as modern.\n\nThe scent of amber was originally derived from emulating the scent of ambergris and/or labdanum but due to the endangered species status of the sperm whale the scent of amber is now largely derived from labdanum. The term “amber” is loosely used to describe a scent that is warm, musky, rich and honey-like, and also somewhat earthy. It can be synthetically created or derived from natural resins. When derived from natural resins it is most often created out of labdanum. Benzoin is usually part of the recipe. Vanilla and cloves are sometimes used to enhance the aroma.\n\n\"Amber\" perfumes may be created using combinations of labdanum, benzoin resin, copal (itself a type of tree resin used in incense manufacture), vanilla, Dammara resin and/or synthetic materials.\n\nImitation \n\nImitation made in natural resins \n\nYoung resins, these are used as imitations: \n* Kauri resin from Agathis australis trees in New Zealand.\n* The copals (subfossil resins). The African and American (Colombia) copals from Leguminosae trees family (genus Hymenaea). Amber of the Dominican or Mexican type (Class I of fossil resins). Copals from Manilia (Indonesia) and from New Zealand from trees of the genus Agathis (Araucariaceae family)\n* Other fossil resins: burmite in Burma, rumenite in Romania, simetite in Sicilia.\n* Other natural resins — cellulose or chitin, etc.\n\nImitations made of plastics \n\nPlastics, these are used as imitations: \n* Stained glass (inorganic material) and other ceramic materials\n* Celluloid\n* Cellulose nitrate (first obtained in 1833) — a product of treatment of cellulose with nitration mixture. \n* Acetylcellulose (not in the use at present)\n* Galalith or \"artificial horn\" (condensation product of casein and formaldehyde), other trade names: Alladinite, Erinoid, Lactoid.\n* Casein — a conjugated protein forming from the casein precursor – caseinogen.\n* Resolane (phenolic resins or phenoplasts, not in the use at present)\n* Bakelite resine (resol, phenolic resins), product from Africa are known under the misleading name \"African amber\".\n* Carbamide resins — melamine, formaldehyde and urea-formaldehyde resins.\n* Epoxy novolac (phenolic resins), unofficial name \"antique amber\", not in the use at present\n* Polyesters (Polish amber imitation) with styrene. Ex.: unsaturated polyester resins (polymals) are produced by Chemical Industrial Works \"Organika\" in Sarzyna, Poland; estomal are produced by Laminopol firm. Polybern or sticked amber is artificial resins the curled chips are obtained, whereas in the case of amber – small scraps. \"African amber\" (polyester, synacryl is then probably other name of the same resine) are produced by Reichhold firm; Styresol trade mark or alkid resin (used in Russia, Reichhold, Inc. patent, 1948.\n* Polyethylene\n* Epoxy resins\n* Polystyrene and polystyrene-like polymers (vinyl polymers).\n* The resins of acrylic type (vinyl polymers), especially polymethyl methacrylate PMMA (trade mark Plexiglass, metaplex).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Amber" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1372" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Amber is fossilized tree resin, which has been appreciated for its color and natural beauty since Neolithic times. Much valued from antiquity to the present as a gemstone, amber is made into a variety of decorative objects.\"Amber\" (2004). In Maxine N. Lurie and Marc Mappen (eds.) Encyclopedia of New Jersey, Rutgers University Press, . Amber is used in jewelry. It has also been used as a healing agent in folk medicine.\n\nThere are five classes of amber, defined on the basis of their chemical constituents. Because it originates as a soft, sticky tree resin, amber sometimes contains animal and plant material as inclusions. Amber occurring in coal seams is also called resinite, and the term ambrite is applied to that found specifically within New Zealand coal seams.Poinar GO, Poinar R. (1995) The quest for life in amber. Basic Books, , p. 133\n\nEtymology\n\nThe English word amber derives from Arabic   (cognate with Middle Persian ambar[http://www.rabbinics.org/pahlavi/MacKenzie-PahlDict.pdf A Concise Pahlavi Dictionary, D N MacKenzie, Oxford University Press, 1971], ) via Middle Latin ambar and Middle French ambre. The word was adopted in Middle English in the 14th century as referring to what is now known as ambergris (ambre gris or \"grey amber\"), a solid waxy substance derived from the sperm whale. \nIn the Romance languages, the sense of the word had come to be extended to Baltic amber (fossil resin) from as early as the late 13th century. At first called white or yellow amber (ambre jaune), this meaning was adopted in English by the early 15th century. As the use of ambergris waned, this became the main sense of the word. and \n\nThe two substances (\"yellow amber\" and \"grey amber\") conceivably became associated or confused because they both were found washed up on beaches. Ambergris is less dense than water and floats, whereas amber is too dense to float, though less dense than stone.see: Abu Zaid al Hassan from Siraf & Sulaiman the Merchant (851), Silsilat-al-Tawarikh (travels in Asia). \n \nThe classical names for amber, Latin electrum and Ancient Greek   (ēlektron), are connected to a term ἠλέκτωρ (ēlektōr) meaning \"beaming Sun\".\nHomeric (Iliad 6.513, 19.398). The feminine  being later used as a name of the Moon.\nThe derivation of the modern term  \"electric\"  from the Greek word for amber dates to the 1600 (Latin electricus \"amber-like\", in De Magnete by William Gilbert). .\nThe word  \"electron\"  (for the fundamental particle) was coined in 1891 by the Irish physicist George Stoney whilst analyzing elementary charges for the first time. .  According to myth, when Phaëton son of Helios (the Sun)  was killed, his mourning sisters became poplar trees, and their tears became  elektron, amber.Michael R. Collings, Gemlore: An Introduction to Precious and Semi-Precious Stones, 2009, p. 20\n\nHistory\n \nAmber is discussed by Theophrastus in the 4th century BC, and again by Pytheas (c. 330 BC) whose work \"On the Ocean\" is lost, but was referenced by Pliny the Elder, according to whose The Natural History  (in what is also the earliest known mention of the name Germania):Natural History [http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.02.0137%3Abook%3D37%3Achapter%3D11 37.11].\nPytheas says that the Gutones, a people of Germany, inhabit the shores of an estuary of the Ocean called Mentonomon, their territory extending a distance of six thousand stadia; that, at one day's sail from this territory, is the Isle of Abalus, upon the shores of which, amber is thrown up by the waves in spring, it being an excretion of the sea in a concrete form; as, also, that the inhabitants use this amber by way of fuel, and sell it to their neighbors, the Teutones.\nEarlierNatural History [http://www.perseus.tufts.edu/cgi-bin/ptext?docPerseus%3Atext%3A1999.02.0137;query\nchapter%3D%23172;layout;loc\n4.26 IV.27.13] or IV.13.95 in the Loeb edition. Pliny says that a large island of three days' sail from the Scythian coast called Balcia by Xenophon of Lampsacus, author of a fanciful travel book in Greek, is called Basilia by Pytheas. It is generally understood to be the same as Abalus. Based on the amber, the island could have been Heligoland, Zealand, the shores of Bay of Gdansk, the Sambia Peninsula or the Curonian Lagoon, which were historically the richest sources of amber in northern Europe.\nIt is assumed that there were well-established trade routes for amber connecting the Baltic with the Mediterranean (known as the \"Amber Road\"). Pliny states explicitly that the Germans export amber to Pannonia, from where it was traded further abroad by the Veneti.\nThe ancient Italic peoples of southern Italy were working amber, the most important examples are on display at the National Archaeological Museum of Siritide to Matera.\nAmber used in antiquity as at Mycenae and in the prehistory of the Mediterranean comes from deposits of Sicily.\n\nPliny also cites the opinion of Nicias, according to whom amber:is a liquid produced by the rays of the sun; and that these rays, at the moment of the sun's setting, striking with the greatest force upon the surface of the soil, leave upon it an unctuous sweat, which is carried off by the tides of the Ocean, and thrown up upon the shores of Germany. Besides the fanciful explanations according to which amber is \"produced by the Sun\", Pliny cites opinions that are well aware of its origin in tree resin, citing the native Latin name of succinum (sūcinum, from sucus \"juice\").succinic acid as well as succinite, a term given to a particular type of amber by James Dwight Dana He writes: Amber is produced from a marrow discharged by trees belonging to the pine genus, like gum from the cherry, and resin from the ordinary pine. It is a liquid at first, which issues forth in considerable quantities, and is gradually hardened [...] Our forefathers, too, were of opinion that it is the juice of a tree, and for this reason gave it the name of \"succinum\" and one great proof that it is the produce of a tree of the pine genus, is the fact that it emits a pine-like smell when rubbed, and that it burns, when ignited, with the odour and appearance of torch-pine wood.He also states that amber is also found in Egypt and in India, and he even refers to the electrostatic properties of amber, by saying that \"in Syria the women make the whorls of their spindles of this substance, and give it the name of harpax [from ἁρπάζω, \"to drag\"] from the circumstance that it attracts leaves towards it, chaff, and the light fringe of tissues.\"\n\nPliny says that the German name of amber was glæsum, \"for which reason the Romans, when Germanicus Cæsar commanded the fleet in those parts, gave to one of these islands the name of Glæsaria, which by the barbarians was known as Austeravia\". This is confirmed by the recorded Old High German glas  and Old English glær for \"amber\" (c.f. glass).\nIn Middle Low German, amber was known as berne-, barn-, börnstēn. The Low German term became dominant also in High German by the 18th century, thus modern German Bernstein besides Dutch Dutch barnsteen.\n\nThe Baltic Lithuanian term for amber is gintaras and Latvian dzintars. They, and the Slavic jantar or Hungarian gyanta ('resin'), are thought to originate from Phoenician jainitar (\"sea-resin\").\n\nEarly in the nineteenth century, the first reports of amber from North America came from discoveries in New Jersey along Crosswicks Creek near Trenton, at Camden, and near Woodbury.\n\nComposition and formation\n\nAmber is heterogeneous in composition, but consists of several resinous bodies more or less soluble in alcohol, ether and chloroform, associated with an insoluble bituminous substance. Amber is a macromolecule by free radical polymerization of several precursors in the labdane family, e.g. communic acid, cummunol, and biformene.Manuel Villanueva-García, Antonio Martínez-Richa, and Juvencio Robles [http://www.arkat-usa.org/ark/journal/2005/I06_Juaristi/1567/EJ-1567C.asp Assignment of vibrational spectra of labdatriene derivatives and ambers: A combined experimental and density functional theoretical study] Arkivoc (EJ-1567C) pp. 449–458 These labdanes are diterpenes (C20H32) and trienes, equipping the organic skeleton with three alkene groups for polymerization. As amber matures over the years, more polymerization takes place as well as isomerization reactions, crosslinking and cyclization.\n\nHeated above 200 C, amber decomposes, yielding an oil of amber, and leaves a black residue which is known as \"amber colophony\", or \"amber pitch\"; when dissolved in oil of turpentine or in linseed oil this forms \"amber varnish\" or \"amber lac\".\n\nFormation\n\nMolecular polymerization, resulting from high pressures and temperatures produced by overlying sediment, transforms the resin first into copal. Sustained heat and pressure drives off terpenes and results in the formation of amber.\n\nFor this to happen, the resin must be resistant to decay. Many trees produce resin, but in the majority of cases this deposit is broken down by physical and biological processes. Exposure to sunlight, rain, microorganisms (such as bacteria and fungi), and extreme temperatures tends to disintegrate resin. For resin to survive long enough to become amber, it must be resistant to such forces or be produced under conditions that exclude them.Poinar, George O. (1992) Life in amber. Stanford, Calif.: Stanford University Press, p. 12, \n\nBotanical origin\n\nFossil resins from Europe fall into two categories, the famous Baltic ambers and another that resembles the Agathis group.  Fossil resins from the Americas and Africa are closely related to the modern genus Hymenaea, while Baltic ambers are thought to be fossil resins from Sciadopityaceae family plants that used to live in north Europe.\n\nInclusions\n\nThe abnormal development of resin in living trees (succinosis) can result in the formation of amber. Impurities are quite often present, especially when the resin dropped onto the ground, so the material may be useless except for varnish-making. Such impure amber is called firniss.\n\nSuch inclusion of other substances can cause amber to have an unexpected color. Pyrites may give a bluish color.  Bony amber owes its cloudy opacity to numerous tiny bubbles inside the resin. However, so-called black amber is really only a kind of jet.\n\nIn darkly clouded and even opaque amber, inclusions can be imaged using high-energy, high-contrast, high-resolution X-rays.\n\nExtraction and processing\n\nDistribution and mining \n\nAmber is globally distributed, mainly in rocks of Cretaceous age or younger.\nHistorically, the Samland coast west of Königsberg in Prussia was the world's leading source of amber. The first mentions of amber deposits here date back to the 12th century.[https://ambery.net/blog/2016/07/history-of-russian-amber-1/ \"The History of Russian Amber, Part 1: The Beginning\"], Ambery.net About 90% of the world's extractable amber is still located in that area, which became the Kaliningrad Oblast of Russia in 1946.[http://gurukul.ucc.american.edu/ted/amber.htm Amber Trade and the Environment in the Kaliningrad Oblast] . Gurukul.ucc.american.edu. Retrieved on 19 September 2012.\n\nPieces of amber torn from the seafloor are cast up by the waves, and collected by hand, dredging, or diving. Elsewhere, amber is mined, both in open works and underground galleries. Then nodules of blue earth have to be removed and an opaque crust must be cleaned off, which can be done in revolving barrels containing sand and water. Erosion removes this crust from sea-worn amber.\n\nCaribbean amber, especially Dominican blue amber, is mined through bell pitting, which is dangerous due to the risk of tunnel collapse.Wichard, Wilfred and Weitschat, Wolfgang (2004) Im Bernsteinwald. – Gerstenberg Verlag, Hildesheim, \n\nTreatment\n\nThe Vienna amber factories, which use pale amber to manufacture pipes and other smoking tools, turn it on a lathe and polish it with whitening and water or with rotten stone and oil. The final luster is given by friction with flannel.\n\nWhen gradually heated in an oil-bath, amber becomes soft and flexible. Two pieces of amber may be united by smearing the surfaces with linseed oil, heating them, and then pressing them together while hot. Cloudy amber may be clarified in an oil-bath, as the oil fills the numerous pores to which the turbidity is due. Small fragments, formerly thrown away or used only for varnish, are now used on a large scale in the formation of \"ambroid\" or \"pressed amber\".\n\nThe pieces are carefully heated with exclusion of air and then compressed into a uniform mass by intense hydraulic pressure, the softened amber being forced through holes in a metal plate. The product is extensively used for the production of cheap jewelry and articles for smoking. This pressed amber yields brilliant interference colors in polarized light. Amber has often been imitated by other resins like copal and kauri gum, as well as by celluloid and even glass. Baltic amber is sometimes colored artificially, but also called \"true amber\".\n\nAppearance \n\nAmber occurs in a range of different colors. As well as the usual yellow-orange-brown that is associated with the color \"amber\", amber itself can range from a whitish color through a pale lemon yellow, to brown and almost black. Other uncommon colors include red amber (sometimes known as \"cherry amber\"), green amber, and even blue amber, which is rare and highly sought after.\n\nYellow amber is a hard fossil resin from evergreen trees, and despite the name it can be translucent, yellow, orange, or brown colored. Known to the Iranians by the Pahlavi compound word kah-ruba (from kah \"straw\" plus rubay \"attract, snatch\", referring to its electrical properties), which entered Arabic as kahraba' or kahraba (which later became the Arabic word for electricity, كهرباء kahrabā'), it too was called amber in Europe (Old French and Middle English ambre). Found along the southern shore of the Baltic Sea, yellow amber reached the Middle East and western Europe via trade. Its coastal acquisition may have been one reason yellow amber came to be designated by the same term as ambergris. Moreover, like ambergris, the resin could be burned as an incense. The resin's most popular use was, however, for ornamentation—easily cut and polished, it could be transformed into beautiful jewelry.\nMuch of the most highly prized amber is transparent, in contrast to the very common cloudy amber and opaque amber. Opaque amber contains numerous minute bubbles. This kind of amber is known as \"bony amber\".\"Amber\". (1999). In G. W. Bowersock, Peter Brown, Oleg Grabar (eds.) Late Antiquity: A Guide to the Postclassical World, Harvard University Press, .\n\nAlthough all Dominican amber is fluorescent, the rarest Dominican amber is blue amber. It turns blue in natural sunlight and any other partially or wholly ultraviolet light source. In long-wave UV light it has a very strong reflection, almost white. Only about 100 kg is found per year, which makes it valuable and expensive.\n\nSometimes amber retains the form of drops and stalactites, just as it exuded from the ducts and receptacles of the injured trees. It is thought that, in addition to exuding onto the surface of the tree, amber resin also originally flowed into hollow cavities or cracks within trees, thereby leading to the development of large lumps of amber of irregular form.\n\nClassification\n\nAmber can be classified into several forms. Most fundamentally, there are two types of plant resin with the potential for fossilization. Terpenoids, produced by conifers and angiosperms, consist of ring structures formed of isoprene (C5H8) units. Phenolic resins are today only produced by angiosperms, and tend to serve functional uses. The extinct medullosans produced a third type of resin, which is often found as amber within their veins. The composition of resins is highly variable; each species produces a unique blend of chemicals which can be identified by the use of pyrolysis–gas chromatography–mass spectrometry. The overall chemical and structural composition is used to divide ambers into five classes. There is also a separate classification of amber gemstones, according to the way of production.\n\nClass I\n\nThis class is by far the most abundant. It comprises labdatriene carboxylic acids such as communic or ozic acids. It is further split into three sub-classes. Classes Ia and Ib utilize regular labdanoid diterpenes (e.g. communic acid, communol, biformenes), while Ic uses enantio labdanoids (ozic acid, ozol, enantio biformenes).\n\nIa\n\nIncludes Succinite ('normal' Baltic amber) and Glessite. Have a communic acid base. They also include much succinic acid.\n\nBaltic amber yields on dry distillation succinic acid, the proportion varying from about 3% to 8%, and being greatest in the pale opaque or bony varieties. The aromatic and irritating fumes emitted by burning amber are mainly due to this acid. Baltic amber is distinguished by its yield of succinic acid, hence the name succinite. Succinite has a hardness between 2 and 3, which is rather greater than that of many other fossil resins. Its specific gravity varies from 1.05 to 1.10. It can be distinguished from other ambers via IR spectroscopy due to a specific carbonyl absorption peak. IR spectroscopy can detect the relative age of an amber sample. Succinic acid may not be an original component of amber, but rather a degradation product of abietic acid.\n\nIb\n\nLike class Ia ambers, these are based on communic acid; however, they lack succinic acid.\n\nIc\n\nThis class is mainly based on enantio-labdatrienonic acids, such as ozic and zanzibaric acids. Its most familiar representative is Dominican amber.\n\nDominican amber differentiates itself from Baltic amber by being mostly transparent and often containing a higher number of fossil inclusions. This has enabled the detailed reconstruction of the ecosystem of a long-vanished tropical forest.George Poinar, Jr. and Roberta Poinar, 1999. The Amber Forest: A Reconstruction of a Vanished World, (Princeton University Press)  Resin from the extinct species Hymenaea protera is the source of Dominican amber and probably of most amber found in the tropics. It is not \"succinite\" but \"retinite\".Grimaldi, D. A. (1996) Amber – Window to the Past. – American Museum of Natural History, New York, \n\nClass II\n\nThese ambers are formed from resins with a sesquiterpenoid base, such as cadinene.\n\nClass III\n\nThese ambers are polystyrenes.\n\nClass IV\n\nClass IV is something of a wastebasket; its ambers are not polymerized, but mainly consist of cedrene-based sesquiterpenoids.\n\nClass V\n\nClass V resins are considered to be produced by a pine or pine relative. They comprise a mixture of diterpinoid resins and n-alkyl compounds. Their main variety is Highgate copalite.\n\nGeological record\n\nThe oldest amber recovered dates to the Upper Carboniferous period (). Its chemical composition makes it difficult to match the amber to its producers – it is most similar to the resins produced by flowering plants; however, there are no flowering plant fossils until the Cretaceous, and they were not common until the Upper Cretaceous. Amber becomes abundant long after the Carboniferous, in the Early Cretaceous, , when it is found in association with insects. The oldest amber with arthropod inclusions comes from the Levant, from Lebanon and Jordan. This amber, roughly 125–135 million years old, is considered of high scientific value, providing evidence of some of the oldest sampled ecosystems.Poinar, P.O., Jr., and R.K. Milki (2001) Lebanese Amber: The Oldest Insect Ecosystem in Fossilized Resin. Oregon State University Press, Corvallis. .\n\nIn Lebanon, more than 450 outcrops of Lower Cretaceous amber were discovered by Dany Azar,  a Lebanese paleontologist and entomologist. Among these outcrops, 20 have yielded biological inclusions comprising the oldest representatives of several recent families of terrestrial arthropods. Even older, Jurassic amber has been found recently in Lebanon as well. Many remarkable insects and spiders were recently discovered in the amber of Jordan including the oldest zorapterans, clerid beetles, umenocoleid roaches, and achiliid planthoppers.\n\nBaltic amber or succinite (historically documented as Prussian amber) is found as irregular nodules in marine glauconitic sand, known as blue earth, occurring in the Lower Oligocene strata of Sambia in Prussia (in historical sources also referred to as Glaesaria). After 1945, this territory around Königsberg was turned into Kaliningrad Oblast, Russia, where amber is now systematically mined.\n\nIt appears, however, to have been partly derived from older Eocene deposits and it occurs also as a derivative phase in later formations, such as glacial drift. Relics of an abundant flora occur as inclusions trapped within the amber while the resin was yet fresh, suggesting relations with the flora of Eastern Asia and the southern part of North America. Heinrich Göppert named the common amber-yielding pine of the Baltic forests Pinites succiniter, but as the wood does not seem to differ from that of the existing genus it has been also called Pinus succinifera. It is improbable, however, that the production of amber was limited to a single species; and indeed a large number of conifers belonging to different genera are represented in the amber-flora.\n\nPaleontological significance\n\nAmber is a unique preservational mode, preserving otherwise unfossilizable parts of organisms; as such it is helpful in the reconstruction of ecosystems as well as organisms;[http://db.bbc.co.uk/radio4/science/amber.shtml BBC – Radio 4 – Amber] . Db.bbc.co.uk (16 February 2005). Retrieved on 23 April 2011. the chemical composition of the resin, however, is of limited utility in reconstructing the phylogenetic affinity of the resin producer.\n\nAmber sometimes contains animals or plant matter that became caught in the resin as it was secreted. Insects, spiders and even their webs, annelids, frogs, crustaceans, bacteria and amoebae, marine microfossils, wood, flowers and fruit, hair, feathers and other small organisms have been recovered in Cretaceous ambers (deposited c. ). The oldest amber to bear fossils (mites) is from the Carnian (Triassic, ) of north-eastern Italy.\n\nUse\n\n \nAmber has been used since prehistory (Solutrean) in the manufacture of jewelry and ornaments, and also in folk medicine.\n\nJewelry\n\nAmber has been used as jewelry since the Stone Age, from 13,000 years ago. Amber ornaments have been found in Mycenaean tombs and elsewhere across Europe.[http://journals.cambridge.org/action/displayAbstract?fromPage\nonline&aid=8456512 Curt W. Beck, Anthony Harding and Helen Hughes-Brock, \"Amber in the Mycenaean World\" The Annual of the British School at Athens, vol. 69 (November 1974), pp. 145-172. DOI:10.1017/S0068245400005505] To this day it is used in the manufacture of smoking and glassblowing mouthpieces. Amber's place in culture and tradition lends it a tourism value; Palanga Amber Museum is dedicated to the fossilized resin.\n\nHistoric medicinal uses\n\nAmber has long been used in folk medicine for its purported healing properties.  Amber and extracts were used from the time of Hippocrates in ancient Greece for a wide variety of treatments through the Middle Ages and up until the early twentieth century.\n\nScent of amber and amber perfumery\n\nIn ancient China, it was customary to burn amber during large festivities. If amber is heated under the right conditions, oil of amber is produced, and in past times this was combined carefully with nitric acid to create \"artificial musk\" – a resin with a peculiar musky odor.. Although when burned, amber does give off a characteristic \"pinewood\" fragrance, modern products, such as perfume, do not normally use actual amber due to the fact that fossilized amber produces very little scent. In perfumery, scents referred to as “amber” are often created and patentedThermer, Ernst T. \"Saturated indane derivatives and processes for producing same\" , , issue date 1972Perfume compositions and perfume articles containing one isomer of an octahydrotetramethyl acetonaphthone, John B. Hall, Rumson; James Milton Sanders, Eatontown , Publication Date: 30 December 1975\nto emulate the opulent golden warmth of the fossil.[http://sorceryofscent.blogspot.com/2008/07/amber-perfumery-myth.html Sorcery of Scent: Amber: A perfume myth]. Sorceryofscent.blogspot.com (30 July 2008). Retrieved on 23 April 2011.\n\nThe modern name for amber is thought to come from the Arabic word, ambar, meaning ambergris. Ambergris is the waxy aromatic substance created in the intestines of sperm whales and was used in making perfumes both in ancient times as well as modern.\n\nThe scent of amber was originally derived from emulating the scent of ambergris and/or labdanum but due to the endangered species status of the sperm whale the scent of amber is now largely derived from labdanum. The term “amber” is loosely used to describe a scent that is warm, musky, rich and honey-like, and also somewhat earthy. It can be synthetically created or derived from natural resins. When derived from natural resins it is most often created out of labdanum. Benzoin is usually part of the recipe. Vanilla and cloves are sometimes used to enhance the aroma.\n\n\"Amber\" perfumes may be created using combinations of labdanum, benzoin resin, copal (itself a type of tree resin used in incense manufacture), vanilla, Dammara resin and/or synthetic materials.\n\nImitation \n\nImitation made in natural resins \n\nYoung resins, these are used as imitations: \n* Kauri resin from Agathis australis trees in New Zealand.\n* The copals (subfossil resins). The African and American (Colombia) copals from Leguminosae trees family (genus Hymenaea). Amber of the Dominican or Mexican type (Class I of fossil resins). Copals from Manilia (Indonesia) and from New Zealand from trees of the genus Agathis (Araucariaceae family)\n* Other fossil resins: burmite in Burma, rumenite in Romania, simetite in Sicilia.\n* Other natural resins — cellulose or chitin, etc.\n\nImitations made of plastics \n\nPlastics, these are used as imitations: \n* Stained glass (inorganic material) and other ceramic materials\n* Celluloid\n* Cellulose nitrate (first obtained in 1833) — a product of treatment of cellulose with nitration mixture. \n* Acetylcellulose (not in the use at present)\n* Galalith or \"artificial horn\" (condensation product of casein and formaldehyde), other trade names: Alladinite, Erinoid, Lactoid.\n* Casein — a conjugated protein forming from the casein precursor – caseinogen.\n* Resolane (phenolic resins or phenoplasts, not in the use at present)\n* Bakelite resine (resol, phenolic resins), product from Africa are known under the misleading name \"African amber\".\n* Carbamide resins — melamine, formaldehyde and urea-formaldehyde resins.\n* Epoxy novolac (phenolic resins), unofficial name \"antique amber\", not in the use at present\n* Polyesters (Polish amber imitation) with styrene. Ex.: unsaturated polyester resins (polymals) are produced by Chemical Industrial Works \"Organika\" in Sarzyna, Poland; estomal are produced by Laminopol firm. Polybern or sticked amber is artificial resins the curled chips are obtained, whereas in the case of amber – small scraps. \"African amber\" (polyester, synacryl is then probably other name of the same resine) are produced by Reichhold firm; Styresol trade mark or alkid resin (used in Russia, Reichhold, Inc. patent, 1948.\n* Polyethylene\n* Epoxy resins\n* Polystyrene and polystyrene-like polymers (vinyl polymers).\n* The resins of acrylic type (vinyl polymers), especially polymethyl methacrylate PMMA (trade mark Plexiglass, metaplex). Amber. http://en.wikipedia.org/?curid=1372."
  }
}
