{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1209",
  "eid" : "b8d5f9c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778389852,
  "textBody" : "Area is the quantity that expresses the extent of a two-dimensional figure or shape, or planar lamina, in the plane. Surface area is its analog on the two-dimensional surface of a  three-dimensional object. Area can be understood as the amount of material with a given thickness that would be necessary to fashion a model of the shape, or the amount of paint necessary to cover the surface with a single coat. It is the two-dimensional analog of the length of a curve (a one-dimensional concept) or the volume of a solid (a three-dimensional concept).\n\nThe area of a shape can be measured by comparing the shape to squares of a fixed size. In the International System of Units (SI), the standard unit of area is the square metre (written as m2), which is the area of a square whose sides are one metre long.Bureau International des Poids et Mesures [http://www.bipm.org/en/CGPM/db/11/12/ Resolution 12 of the 11th meeting of the CGPM (1960)] , retrieved 15 July 2012  A shape with an area of three square metres would have the same area as three such squares.  In mathematics, the unit square is defined to have area one, and the area of any other shape or surface is a dimensionless real number.\n\nThere are several well-known formulas for the areas of simple shapes such as triangles, rectangles, and circles.  Using these formulas, the area of any polygon can be found by dividing the polygon into triangles.  For shapes with curved boundary, calculus is usually required to compute the area.  Indeed, the problem of determining the area of plane figures was a major motivation for the historical development of calculus.\n\nFor a solid shape such as a sphere, cone, or cylinder, the area of its boundary surface is called the surface area. Formulas for the surface areas of simple shapes were computed by the ancient Greeks, but computing the surface area of a more complicated shape usually requires multivariable calculus.\n\nArea plays an important role in modern mathematics.  In addition to its obvious importance in geometry and calculus, area is related to the definition of determinants in linear algebra, and is a basic property of surfaces in differential geometry.do Carmo, Manfredo. Differential Geometry of Curves and Surfaces. Prentice-Hall, 1976. Page 98,  In analysis, the area of a subset of the plane is defined using Lebesgue measure,Walter Rudin, Real and Complex Analysis, McGraw-Hill, 1966, . though not every subset is measurable.Gerald Folland, Real Analysis: modern techniques and their applications, John Wiley & Sons, Inc., 1999, Page 20,   In general, area in higher mathematics is seen as a special case of volume for two-dimensional regions.\n\nArea can be defined through the use of axioms, defining it as a function of a collection of certain plane figures to the set of real numbers. It can be proved that such a function exists.\n\nFormal definition\n\nAn approach to defining what is meant by \"area\" is through axioms. \"Area\" can be defined as a function from a collection M of special kind of plane figures (termed measurable sets) to the set of real numbers which satisfies the following properties:\n* For all S in M, a(S) ≥ 0.\n* If S and T are in M then so are S ∪ T and S ∩ T, and also a(S∪T) = a(S) + a(T) − a(S∩T).\n* If S and T are in M with S ⊆ T then T − S is in M and a(T−S) = a(T) − a(S).\n* If a set S is in M and S is congruent to T then T is also in M and a(S) = a(T).\n* Every rectangle R is in M. If the rectangle has length h and breadth k then a(R) = hk.\n* Let Q be a set enclosed between two step regions S and T. A step region is formed from a finite union of adjacent rectangles resting on a common base, i.e. S ⊆ Q ⊆ T. If there is a unique number c such that a(S) ≤ c ≤ a(T) for all such step regions S and T, then a(Q) = c.\n\nIt can be proved that such an area function actually exists.\n\nUnits\n\nEvery unit of length has a corresponding unit of area, namely the area of a square with the given side length.  Thus areas can be measured in square metres (m2), square centimetres (cm2), square millimetres (mm2), square kilometres (km2), square feet (ft2), square yards (yd2), square miles (mi2), and so forth.  Algebraically, these units can be thought of as the squares of the corresponding length units.\n\nThe SI unit of area is the square metre, which is considered an SI derived unit.\n\nConversions\n\nCalculation of the area of a square whose length and width are 1 metre would be:\n\n1 metre x 1 metre = 1 m2\n\nand so, a rectangle with different sides (say length of 3 metres and width of 2 metres) would have an area in square units that can be calculated as:\n\n3 metres x 2 metres = 6 m2. This is equivalent to 6 million square millimetres. Other useful conversions are:\n* 1 square kilometre = 1,000,000 square metres\n* 1 square metre 10,000 square centimetres \n 1,000,000 square millimetres\n* 1 square centimetre = 100 square millimetres.\n\nNon-metric units \n\nIn non-metric units, the conversion between two square units is the square of the conversion between the corresponding length units.\n1 foot = 12 inches,\nthe relationship between square feet and square inches is\n1 square foot = 144 square inches,\nwhere 144 122 \n 12 × 12.  Similarly:\n* 1 square yard = 9 square feet\n* 1 square mile 3,097,600 square yards \n 27,878,400 square feet\nIn addition, conversion factors include:\n* 1 square inch = 6.4516 square centimetres\n* 1 square foot =  square metres\n* 1 square yard =  square metres\n* 1 square mile =  square kilometres\n\nOther units including historical\n\nThere are several other common units for area.  The \"Are\" was the original unit of area in the metric system, with;\n* 1 are = 100 square metres\nThough the are has fallen out of use, the hectare is still commonly used to measure land: Chapter 5.\n* 1 hectare 100 ares \n 10,000 square metres = 0.01 square kilometres\nOther uncommon metric units of area include the tetrad, the hectad, and the myriad.\n\nThe acre is also commonly used to measure land areas, where\n* 1 acre 4,840 square yards \n 43,560 square feet.\nAn acre is approximately 40% of a hectare.\n\nOn the atomic scale, area is measured in units of barns, such that:\n* 1 barn = 10−28 square meters.\nThe barn is commonly used in describing the cross sectional area of interaction in nuclear physics.\n\nIn India,\n* 20 Dhurki = 1 Dhur\n* 20 Dhur = 1 Khatha\n* 20 Khata = 1 Bigha\n* 32 Khata = 1 Acre\n\nHistory\n\nCircle area\n\nIn the 5th century BCE, Hippocrates of Chios was the first to show that the area of a disk (the region enclosed by a circle) is proportional to the square of its diameter, as part of his quadrature of the lune of Hippocrates, but did not identify the constant of proportionality. Eudoxus of Cnidus, also in the 5th century BCE, also found that the area of a disk is proportional to its radius squared. \n\nSubsequently, Book I of Euclid's Elements dealt with equality of areas between two-dimensional figures. The mathematician Archimedes used the tools of Euclidean geometry to show that the area inside a circle is equal to that of a right triangle whose base has the length of the circle's circumference and whose height equals the circle's radius, in his book Measurement of a Circle. (The circumference is 2r, and the area of a triangle is half the base times the height, yielding the area r2 for the disk.) Archimedes approximated the value of π (and hence the area of a unit-radius circle) with his doubling method, in which he inscribed a regular triangle in a circle and noted its area, then doubled the number of sides to give a regular hexagon, then repeatedly doubled the number of sides as the polygon's area got closer and closer to that of the circle (and did the same with circumscribed polygons).\n\nSwiss scientist Johann Heinrich Lambert in 1761 proved that π, the ratio of a circle's area to its squared radius, is irrational, meaning it is not equal to the quotient of any two whole numbers. English translation by Catriona and David Lischka. In 1794 French mathematician Adrien-Marie Legendre proved that π2 is irrational; this also proves that π is irrational. In 1882, German mathematician Ferdinand von Lindemann proved that π is transcendental (not the solution of any polynomial equation with rational coefficients), confirming a conjecture made by both Legendre and Euler.\n\nTriangle area\n\nHeron (or Hero) of Alexandria found what is known as Heron's formula for the area of a triangle in terms of its sides, and a proof can be found in his book, Metrica, written around 60 CE. It has been suggested that Archimedes knew the formula over two centuries earlier, and since Metrica is a collection of the mathematical knowledge available in the ancient world, it is possible that the formula predates the reference given in that work.\n\nIn 499 Aryabhata, a great mathematician-astronomer from the classical age of Indian mathematics and Indian astronomy, expressed the area of a triangle as one-half the base times the height in the Aryabhatiya (section 2.6).\n\nA formula equivalent to Heron's was discovered by the Chinese independently of the Greeks. It was published in 1247 in Shushu Jiuzhang (\"Mathematical Treatise in Nine Sections\"), written by Qin Jiushao.\n\nQuadrilateral area\n\nIn the 7th century CE, Brahmagupta developed a formula, now known as Brahmagupta's formula, for the area of a cyclic quadrilateral (a quadrilateral inscribed in a circle) in terms of its sides. In 1842 the German mathematicians Carl Anton Bretschneider and Karl Georg Christian von Staudt independently found a formula, known as Bretschneider's formula, for the area of any quadrilateral.\n\nGeneral polygon area\n\nThe development of Cartesian coordinates by René Descartes in the 17th century allowed the development of the surveyor's formula for the area of any polygon with known vertex locations by Gauss in the 19th century.\n\nAreas determined using calculus\n\nThe development of integral calculus in the late 17th century provided tools that could subsequently be used for computing more complicated areas, such as the area of an ellipse and the surface areas of various curved three-dimensional objects.\n\nArea formulas\n\nPolygon formulas\n\nFor a non-self-intersecting (simple) polygon, the Cartesian coordinates (x_i,  y_i) (i=0, 1, ..., n-1) of whose n vertices are known, the area is given by the surveyor's formula:\n\nA \\frac{1}{2} | \\sum_{i \n 0}^{n - 1}( x_i y_{i + 1} - x_{i + 1} y_i) |\n\nwhere when i=n-1, then i+1 is expressed as modulus n and so refers to 0.\n\nRectangles\n\nThe most basic area formula is the formula for the area of a rectangle.  Given a rectangle with length  and width , the formula for the area is:\n\n (rectangle).\nThat is, the area of the rectangle is the length multiplied by the width.  As a special case, as  in the case of a square, the area of a square with side length  is given by the formula:\n (square).\n\nThe formula for the area of a rectangle follows directly from the basic properties of area, and is sometimes taken as a definition or axiom.  On the other hand, if geometry is developed before arithmetic, this formula can be used to define multiplication of real numbers.\n\nDissection, parallelograms, and triangles\n\nMost other simple formulas for area follow from the method of dissection.\nThis involves cutting a shape into pieces, whose areas must sum to the area of the original shape.\n\nFor an example, any parallelogram can be subdivided into a trapezoid and a right triangle, as shown in figure to the left.  If the triangle is moved to the other side of the trapezoid, then the resulting figure is a rectangle.  It follows that the area of the parallelogram is the same as the area of the rectangle:\n (parallelogram).\nHowever, the same parallelogram can also be cut along a diagonal into two congruent triangles, as shown in the figure to the right.  It follows that the area of each triangle is half the area of the parallelogram:\nA = \\frac{1}{2}bh  (triangle).\nSimilar arguments can be used to find area formulas for the trapezoid as well as more complicated polygons.\n\nArea of curved shapes\n\nCircles\n\nThe formula for the area of a circle (more properly called the area enclosed by a circle or the area of a disk) is based on a similar method.  Given a circle of radius , it is possible to partition the circle into sectors, as shown in the figure to the right.  Each sector is approximately triangular in shape, and the sectors can be rearranged to form an approximate parallelogram.  The height of this parallelogram is , and the width is half the circumference of the circle, or .  Thus, the total area of the circle is :\n (circle).\nThough the dissection used in this formula is only approximate, the error becomes smaller and smaller as the circle is partitioned into more and more sectors.  The limit of the areas of the approximate parallelograms is exactly , which is the area of the circle.\n\nThis argument is actually a simple application of the ideas of calculus.  In ancient times, the method of exhaustion was used in a similar way to find the area of the circle, and this method is now recognized as a precursor to integral calculus.  Using modern methods, the area of a circle can be computed using a definite integral:\nA \\;\\;2\\int_{-r}^r \\sqrt{r^2 - x^2}\\,dx \\;\n\\; \\pi r^2.\n\nEllipses\n\nThe formula for the area enclosed by an ellipse is related to the formula of a circle; for an ellipse with semi-major and semi-minor axes  and  the formula is:\nA = \\pi xy .\n\nSurface area\n\nMost basic formulas for surface area can be obtained by cutting surfaces and flattening them out.  For example, if the side surface of a cylinder (or any prism) is cut lengthwise, the surface can be flattened out into a rectangle.  Similarly, if a cut is made along the side of a cone, the side surface can be flattened out into a sector of a circle, and the resulting area computed.\n\nThe formula for the surface area of a sphere is more difficult to derive: because a sphere has nonzero Gaussian curvature, it cannot be flattened out.  The formula for the surface area of a sphere was first obtained by Archimedes in his work On the Sphere and Cylinder.  The formula is:\n (sphere),\nwhere  is the radius of the sphere.  As with the formula for the area of a circle, any derivation of this formula inherently uses methods similar to calculus.\n\nGeneral formulas\n\nAreas of 2-dimensional figures\n\n* A triangle: \\tfrac12Bh (where B is any side, and h is the distance from the line on which B lies to the other vertex of the triangle). This formula can be used if the height h is known. If the lengths of the three sides are known then Heron's formula can be used: \\sqrt{s(s-a)(s-b)(s-c)} where a, b, c are the sides of the triangle, and s \\tfrac12(a + b + c) is half of its perimeter. If an angle and its two included sides are given, the area is \\tfrac12 a b \\sin(C) where  is the given angle and  and  are its included sides. If the triangle is graphed on a coordinate plane, a matrix can be used and is simplified to the absolute value of \\tfrac12(x_1 y_2 + x_2 y_3 + x_3 y_1 - x_2 y_1 - x_3 y_2 - x_1 y_3). This formula is also known as the shoelace formula and is an easy way to solve for the area of a coordinate triangle by substituting the 3 points (x1,y1), (x2,y2), and (x3,y3). The shoelace formula can also be used to find the areas of other polygons when their vertices are known. Another approach for a coordinate triangle is to use calculus to find the area.\n* A simple polygon constructed on a grid of equal-distanced points (i.e., points with integer coordinates) such that all the polygon's vertices are grid points: i + \\frac{b}{2} - 1, where i is the number of grid points inside the polygon and b is the number of boundary points. This result is known as Pick's theorem.\n\nArea in calculus\n\n* The area between a positive-valued curve and the horizontal axis, measured between two values a and b (b is defined as the larger of the two values) on the horizontal axis, is given by the integral from a to b of the function that represents the curve:\n A = \\int_a^{b} f(x) \\, dx.\n* The area between the graphs of two functions is equal to the integral of one function, f(x), minus the integral of the other function, g(x):\n A = \\int_a^{b}  ( f(x) - g(x) ) \\, dx,  where  f(x)  is the curve with the greater y-value.\n* An area bounded by a function r r(θ) expressed in polar coordinates is:\nA = {1 \\over 2} \\int r^2 \\, d\\theta. \n* The area enclosed by a parametric curve \\vec u(t) (x(t), y(t))  with endpoints  \\vec u(t_0) \n \\vec u(t_1)  is given by the line integrals:\n: \\oint_{t_0}^{t_1} x \\dot y \\, dt  - \\oint_{t_0}^{t_1} y \\dot x \\, dt  \n  {1 \\over 2} \\oint_{t_0}^{t_1} (x \\dot y - y \\dot x) \\, dt \n(see Green's theorem) or the z-component of\n{1 \\over 2} \\oint_{t_0}^{t_1} \\vec u \\times \\dot{\\vec u} \\, dt.\n\nBounded area between two quadratic functions\n\nTo find the bounded area between two quadratic functions, we subtract one from the other to write the difference as\nf(x)-g(x)ax^2+bx+c\na(x-\\alpha)(x-\\beta)\nwhere f(x) is the quadratic upper bound and g(x) is the quadratic lower bound. Define the discriminant of f(x)-g(x) as\n\\Delta=b^2-4ac.\nBy simplifying the integral formula between the graphs of two functions (as given in the section above) and using Vieta's formula, we can obtain\nA\\frac{\\Delta\\sqrt{\\Delta}}{6a^2}\n\\frac{a}{6}(\\beta-\\alpha)^3,\\qquad a\\neq0.\nThe above remains valid if one of the bounding functions is linear instead of quadratic.\n\nSurface area of 3-dimensional figures\n\n* Cone: \\pi r\\left(r + \\sqrt{r^2 + h^2}\\right), where r is the radius of the circular base, and h is the height. That can also be rewritten as \\pi r^2 + \\pi r l  or \\pi r (r + l) \\,\\! where r is the radius and l is the slant height of the cone. \\pi r^2  is the base area while \\pi r l  is the lateral surface area of the cone.\n* cube: 6s^2, where s is the length of an edge.\n* cylinder: 2\\pi r(r + h), where r is the radius of a base and h is the height. The 2\\pir can also be rewritten as \\pi d, where d is the diameter.\n* prism: 2B + Ph, where B is the area of a base, P is the perimeter of a base, and h is the height of the prism.\n* pyramid: B + \\frac{PL}{2}, where B is the area of the base, P is the perimeter of the base, and L is the length of the slant.\n* rectangular prism: 2 (\\ell w + \\ell  h + w h), where \\ell is the length, w is the width, and h is the height.\n\nGeneral formula for surface area\n\nThe general formula for the surface area of the graph of a continuously differentiable function z=f(x,y), where (x,y)\\in D\\subset\\mathbb{R}^2 and D is a region in the xy-plane with the smooth boundary:\n A=\\iint_D\\sqrt{\\left(\\frac{\\partial f}{\\partial x}\\right)^2+\\left(\\frac{\\partial f}{\\partial y}\\right)^2+1}\\,dx\\,dy. \nAn even more general formula for the area of the graph of a parametric surface in the vector form \\mathbf{r}\\mathbf{r}(u,v), where \\mathbf{r} is a continuously differentiable vector function of (u,v)\\in D\\subset\\mathbb{R}^2 is:\n A=\\iint_D \\left|\\frac{\\partial\\mathbf{r}}{\\partial u}\\times\\frac{\\partial\\mathbf{r}}{\\partial v}\\right|\\,du\\,dv. \n\nList of formulas\n\nThe above calculations show how to find the areas of many common shapes.\n\nThe areas of irregular polygons can be calculated using the \"Surveyor's formula\".\n\nRelation of area to perimeter\n\nThe isoperimetric inequality states that, for a closed curve of length L (so the region it encloses has perimeter L) and for area A of the region that it encloses,\n\n4\\pi A \\le L^2,\n\nand  equality holds if and only if the curve is a circle. Thus a circle has the largest area of any closed figure with a given perimeter.\n\nAt the other extreme, a figure with given perimeter L could have an arbitrarily small area, as illustrated by a rhombus that is \"tipped over\" arbitrarily far so that two of its angles are arbitrarily close to 0° and the other two are arbitrarily close to 180°.\n\nFor a circle, the ratio of the area to the circumference (the term for the perimeter of a circle) equals half the radius r. This can be seen from the area formula πr2 and the circumference formula 2πr.\n\nThe area of a regular polygon is half its perimeter times the apothem (where the apothem is the distance from the center to the nearest point on any side).\n\nFractals\n\nDoubling the edge lengths of a polygon multiplies its area by four, which is two (the ratio of the new to the old side length) raised to the power of two (the dimension of the space the polygon resides in). But if the one-dimensional lengths of a  fractal drawn in two dimensions are all doubled, the spatial content of the fractal scales by a power of two that is not necessarily an integer. This power is called the fractal dimension of the fractal.\n\nArea bisectors\n\nThere are an infinitude of lines that bisect the area of a triangle. Three of them are the medians of the triangle (which connect the sides' midpoints with the opposite vertices), and these are concurrent at the triangle's centroid; indeed, they are the only area bisectors that go through the centroid. Any line through a triangle that splits both the triangle's area and its perimeter in half goes through the triangle's incenter (the center of its incircle). There are either one, two, or three of these for any given triangle.\n\nAny line through the midpoint of a parallelogram bisects the area.\n\nAll area bisectors of a circle or other ellipse go through the center, and any chords through the center bisect the area. In the case of a circle they are the diameters of the circle.\n\nOptimization\n\nGiven a wire contour, the surface of least area spanning (\"filling\") it is a minimal surface.  Familiar examples include soap bubbles.\n\nThe question of the filling area of the Riemannian circle remains open.\n\nThe circle has the largest area of any two-dimensional object having the same perimeter.\n\nA cyclic polygon (one inscribed in a circle) has the largest area of any polygon with a given number of sides of the same lengths.\n\nA version of the isoperimetric inequality for triangles states that the triangle of greatest area among all those with a given perimeter is equilateral.\n\nThe triangle of largest area of all those inscribed in a given circle is equilateral; and the triangle of smallest area of all those circumscribed around a given circle is equilateral.Dorrie, Heinrich (1965), 100 Great Problems of Elementary Mathematics, Dover Publ., pp. 379–380.\n\nThe ratio of the area of the incircle to the area of an equilateral triangle, \\frac{\\pi}{3\\sqrt{3}}, is larger than that of any non-equilateral triangle.\n\nThe ratio of the area to the square of the perimeter of an equilateral triangle, \\frac{1}{12\\sqrt{3}}, is larger than that for any other triangle.Chakerian, G. D. (1979) \"A Distorted View of Geometry.\" Ch. 7 in Mathematical Plums. R. Honsberger (ed.). Washington, DC: Mathematical Association of America, p. 147.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Area" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1209" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Area is the quantity that expresses the extent of a two-dimensional figure or shape, or planar lamina, in the plane. Surface area is its analog on the two-dimensional surface of a  three-dimensional object. Area can be understood as the amount of material with a given thickness that would be necessary to fashion a model of the shape, or the amount of paint necessary to cover the surface with a single coat. It is the two-dimensional analog of the length of a curve (a one-dimensional concept) or the volume of a solid (a three-dimensional concept).\n\nThe area of a shape can be measured by comparing the shape to squares of a fixed size. In the International System of Units (SI), the standard unit of area is the square metre (written as m2), which is the area of a square whose sides are one metre long.Bureau International des Poids et Mesures [http://www.bipm.org/en/CGPM/db/11/12/ Resolution 12 of the 11th meeting of the CGPM (1960)] , retrieved 15 July 2012  A shape with an area of three square metres would have the same area as three such squares.  In mathematics, the unit square is defined to have area one, and the area of any other shape or surface is a dimensionless real number.\n\nThere are several well-known formulas for the areas of simple shapes such as triangles, rectangles, and circles.  Using these formulas, the area of any polygon can be found by dividing the polygon into triangles.  For shapes with curved boundary, calculus is usually required to compute the area.  Indeed, the problem of determining the area of plane figures was a major motivation for the historical development of calculus.\n\nFor a solid shape such as a sphere, cone, or cylinder, the area of its boundary surface is called the surface area. Formulas for the surface areas of simple shapes were computed by the ancient Greeks, but computing the surface area of a more complicated shape usually requires multivariable calculus.\n\nArea plays an important role in modern mathematics.  In addition to its obvious importance in geometry and calculus, area is related to the definition of determinants in linear algebra, and is a basic property of surfaces in differential geometry.do Carmo, Manfredo. Differential Geometry of Curves and Surfaces. Prentice-Hall, 1976. Page 98,  In analysis, the area of a subset of the plane is defined using Lebesgue measure,Walter Rudin, Real and Complex Analysis, McGraw-Hill, 1966, . though not every subset is measurable.Gerald Folland, Real Analysis: modern techniques and their applications, John Wiley & Sons, Inc., 1999, Page 20,   In general, area in higher mathematics is seen as a special case of volume for two-dimensional regions.\n\nArea can be defined through the use of axioms, defining it as a function of a collection of certain plane figures to the set of real numbers. It can be proved that such a function exists.\n\nFormal definition\n\nAn approach to defining what is meant by \"area\" is through axioms. \"Area\" can be defined as a function from a collection M of special kind of plane figures (termed measurable sets) to the set of real numbers which satisfies the following properties:\n* For all S in M, a(S) ≥ 0.\n* If S and T are in M then so are S ∪ T and S ∩ T, and also a(S∪T) = a(S) + a(T) − a(S∩T).\n* If S and T are in M with S ⊆ T then T − S is in M and a(T−S) = a(T) − a(S).\n* If a set S is in M and S is congruent to T then T is also in M and a(S) = a(T).\n* Every rectangle R is in M. If the rectangle has length h and breadth k then a(R) = hk.\n* Let Q be a set enclosed between two step regions S and T. A step region is formed from a finite union of adjacent rectangles resting on a common base, i.e. S ⊆ Q ⊆ T. If there is a unique number c such that a(S) ≤ c ≤ a(T) for all such step regions S and T, then a(Q) = c.\n\nIt can be proved that such an area function actually exists.\n\nUnits\n\nEvery unit of length has a corresponding unit of area, namely the area of a square with the given side length.  Thus areas can be measured in square metres (m2), square centimetres (cm2), square millimetres (mm2), square kilometres (km2), square feet (ft2), square yards (yd2), square miles (mi2), and so forth.  Algebraically, these units can be thought of as the squares of the corresponding length units.\n\nThe SI unit of area is the square metre, which is considered an SI derived unit.\n\nConversions\n\nCalculation of the area of a square whose length and width are 1 metre would be:\n\n1 metre x 1 metre = 1 m2\n\nand so, a rectangle with different sides (say length of 3 metres and width of 2 metres) would have an area in square units that can be calculated as:\n\n3 metres x 2 metres = 6 m2. This is equivalent to 6 million square millimetres. Other useful conversions are:\n* 1 square kilometre = 1,000,000 square metres\n* 1 square metre 10,000 square centimetres \n 1,000,000 square millimetres\n* 1 square centimetre = 100 square millimetres.\n\nNon-metric units \n\nIn non-metric units, the conversion between two square units is the square of the conversion between the corresponding length units.\n1 foot = 12 inches,\nthe relationship between square feet and square inches is\n1 square foot = 144 square inches,\nwhere 144 122 \n 12 × 12.  Similarly:\n* 1 square yard = 9 square feet\n* 1 square mile 3,097,600 square yards \n 27,878,400 square feet\nIn addition, conversion factors include:\n* 1 square inch = 6.4516 square centimetres\n* 1 square foot =  square metres\n* 1 square yard =  square metres\n* 1 square mile =  square kilometres\n\nOther units including historical\n\nThere are several other common units for area.  The \"Are\" was the original unit of area in the metric system, with;\n* 1 are = 100 square metres\nThough the are has fallen out of use, the hectare is still commonly used to measure land: Chapter 5.\n* 1 hectare 100 ares \n 10,000 square metres = 0.01 square kilometres\nOther uncommon metric units of area include the tetrad, the hectad, and the myriad.\n\nThe acre is also commonly used to measure land areas, where\n* 1 acre 4,840 square yards \n 43,560 square feet.\nAn acre is approximately 40% of a hectare.\n\nOn the atomic scale, area is measured in units of barns, such that:\n* 1 barn = 10−28 square meters.\nThe barn is commonly used in describing the cross sectional area of interaction in nuclear physics.\n\nIn India,\n* 20 Dhurki = 1 Dhur\n* 20 Dhur = 1 Khatha\n* 20 Khata = 1 Bigha\n* 32 Khata = 1 Acre\n\nHistory\n\nCircle area\n\nIn the 5th century BCE, Hippocrates of Chios was the first to show that the area of a disk (the region enclosed by a circle) is proportional to the square of its diameter, as part of his quadrature of the lune of Hippocrates, but did not identify the constant of proportionality. Eudoxus of Cnidus, also in the 5th century BCE, also found that the area of a disk is proportional to its radius squared. \n\nSubsequently, Book I of Euclid's Elements dealt with equality of areas between two-dimensional figures. The mathematician Archimedes used the tools of Euclidean geometry to show that the area inside a circle is equal to that of a right triangle whose base has the length of the circle's circumference and whose height equals the circle's radius, in his book Measurement of a Circle. (The circumference is 2r, and the area of a triangle is half the base times the height, yielding the area r2 for the disk.) Archimedes approximated the value of π (and hence the area of a unit-radius circle) with his doubling method, in which he inscribed a regular triangle in a circle and noted its area, then doubled the number of sides to give a regular hexagon, then repeatedly doubled the number of sides as the polygon's area got closer and closer to that of the circle (and did the same with circumscribed polygons).\n\nSwiss scientist Johann Heinrich Lambert in 1761 proved that π, the ratio of a circle's area to its squared radius, is irrational, meaning it is not equal to the quotient of any two whole numbers. English translation by Catriona and David Lischka. In 1794 French mathematician Adrien-Marie Legendre proved that π2 is irrational; this also proves that π is irrational. In 1882, German mathematician Ferdinand von Lindemann proved that π is transcendental (not the solution of any polynomial equation with rational coefficients), confirming a conjecture made by both Legendre and Euler.\n\nTriangle area\n\nHeron (or Hero) of Alexandria found what is known as Heron's formula for the area of a triangle in terms of its sides, and a proof can be found in his book, Metrica, written around 60 CE. It has been suggested that Archimedes knew the formula over two centuries earlier, and since Metrica is a collection of the mathematical knowledge available in the ancient world, it is possible that the formula predates the reference given in that work.\n\nIn 499 Aryabhata, a great mathematician-astronomer from the classical age of Indian mathematics and Indian astronomy, expressed the area of a triangle as one-half the base times the height in the Aryabhatiya (section 2.6).\n\nA formula equivalent to Heron's was discovered by the Chinese independently of the Greeks. It was published in 1247 in Shushu Jiuzhang (\"Mathematical Treatise in Nine Sections\"), written by Qin Jiushao.\n\nQuadrilateral area\n\nIn the 7th century CE, Brahmagupta developed a formula, now known as Brahmagupta's formula, for the area of a cyclic quadrilateral (a quadrilateral inscribed in a circle) in terms of its sides. In 1842 the German mathematicians Carl Anton Bretschneider and Karl Georg Christian von Staudt independently found a formula, known as Bretschneider's formula, for the area of any quadrilateral.\n\nGeneral polygon area\n\nThe development of Cartesian coordinates by René Descartes in the 17th century allowed the development of the surveyor's formula for the area of any polygon with known vertex locations by Gauss in the 19th century.\n\nAreas determined using calculus\n\nThe development of integral calculus in the late 17th century provided tools that could subsequently be used for computing more complicated areas, such as the area of an ellipse and the surface areas of various curved three-dimensional objects.\n\nArea formulas\n\nPolygon formulas\n\nFor a non-self-intersecting (simple) polygon, the Cartesian coordinates (x_i,  y_i) (i=0, 1, ..., n-1) of whose n vertices are known, the area is given by the surveyor's formula:\n\nA \\frac{1}{2} | \\sum_{i \n 0}^{n - 1}( x_i y_{i + 1} - x_{i + 1} y_i) |\n\nwhere when i=n-1, then i+1 is expressed as modulus n and so refers to 0.\n\nRectangles\n\nThe most basic area formula is the formula for the area of a rectangle.  Given a rectangle with length  and width , the formula for the area is:\n\n (rectangle).\nThat is, the area of the rectangle is the length multiplied by the width.  As a special case, as  in the case of a square, the area of a square with side length  is given by the formula:\n (square).\n\nThe formula for the area of a rectangle follows directly from the basic properties of area, and is sometimes taken as a definition or axiom.  On the other hand, if geometry is developed before arithmetic, this formula can be used to define multiplication of real numbers.\n\nDissection, parallelograms, and triangles\n\nMost other simple formulas for area follow from the method of dissection.\nThis involves cutting a shape into pieces, whose areas must sum to the area of the original shape.\n\nFor an example, any parallelogram can be subdivided into a trapezoid and a right triangle, as shown in figure to the left.  If the triangle is moved to the other side of the trapezoid, then the resulting figure is a rectangle.  It follows that the area of the parallelogram is the same as the area of the rectangle:\n (parallelogram).\nHowever, the same parallelogram can also be cut along a diagonal into two congruent triangles, as shown in the figure to the right.  It follows that the area of each triangle is half the area of the parallelogram:\nA = \\frac{1}{2}bh  (triangle).\nSimilar arguments can be used to find area formulas for the trapezoid as well as more complicated polygons.\n\nArea of curved shapes\n\nCircles\n\nThe formula for the area of a circle (more properly called the area enclosed by a circle or the area of a disk) is based on a similar method.  Given a circle of radius , it is possible to partition the circle into sectors, as shown in the figure to the right.  Each sector is approximately triangular in shape, and the sectors can be rearranged to form an approximate parallelogram.  The height of this parallelogram is , and the width is half the circumference of the circle, or .  Thus, the total area of the circle is :\n (circle).\nThough the dissection used in this formula is only approximate, the error becomes smaller and smaller as the circle is partitioned into more and more sectors.  The limit of the areas of the approximate parallelograms is exactly , which is the area of the circle.\n\nThis argument is actually a simple application of the ideas of calculus.  In ancient times, the method of exhaustion was used in a similar way to find the area of the circle, and this method is now recognized as a precursor to integral calculus.  Using modern methods, the area of a circle can be computed using a definite integral:\nA \\;\\;2\\int_{-r}^r \\sqrt{r^2 - x^2}\\,dx \\;\n\\; \\pi r^2.\n\nEllipses\n\nThe formula for the area enclosed by an ellipse is related to the formula of a circle; for an ellipse with semi-major and semi-minor axes  and  the formula is:\nA = \\pi xy .\n\nSurface area\n\nMost basic formulas for surface area can be obtained by cutting surfaces and flattening them out.  For example, if the side surface of a cylinder (or any prism) is cut lengthwise, the surface can be flattened out into a rectangle.  Similarly, if a cut is made along the side of a cone, the side surface can be flattened out into a sector of a circle, and the resulting area computed.\n\nThe formula for the surface area of a sphere is more difficult to derive: because a sphere has nonzero Gaussian curvature, it cannot be flattened out.  The formula for the surface area of a sphere was first obtained by Archimedes in his work On the Sphere and Cylinder.  The formula is:\n (sphere),\nwhere  is the radius of the sphere.  As with the formula for the area of a circle, any derivation of this formula inherently uses methods similar to calculus.\n\nGeneral formulas\n\nAreas of 2-dimensional figures\n\n* A triangle: \\tfrac12Bh (where B is any side, and h is the distance from the line on which B lies to the other vertex of the triangle). This formula can be used if the height h is known. If the lengths of the three sides are known then Heron's formula can be used: \\sqrt{s(s-a)(s-b)(s-c)} where a, b, c are the sides of the triangle, and s \\tfrac12(a + b + c) is half of its perimeter. If an angle and its two included sides are given, the area is \\tfrac12 a b \\sin(C) where  is the given angle and  and  are its included sides. If the triangle is graphed on a coordinate plane, a matrix can be used and is simplified to the absolute value of \\tfrac12(x_1 y_2 + x_2 y_3 + x_3 y_1 - x_2 y_1 - x_3 y_2 - x_1 y_3). This formula is also known as the shoelace formula and is an easy way to solve for the area of a coordinate triangle by substituting the 3 points (x1,y1), (x2,y2), and (x3,y3). The shoelace formula can also be used to find the areas of other polygons when their vertices are known. Another approach for a coordinate triangle is to use calculus to find the area.\n* A simple polygon constructed on a grid of equal-distanced points (i.e., points with integer coordinates) such that all the polygon's vertices are grid points: i + \\frac{b}{2} - 1, where i is the number of grid points inside the polygon and b is the number of boundary points. This result is known as Pick's theorem.\n\nArea in calculus\n\n* The area between a positive-valued curve and the horizontal axis, measured between two values a and b (b is defined as the larger of the two values) on the horizontal axis, is given by the integral from a to b of the function that represents the curve:\n A = \\int_a^{b} f(x) \\, dx.\n* The area between the graphs of two functions is equal to the integral of one function, f(x), minus the integral of the other function, g(x):\n A = \\int_a^{b}  ( f(x) - g(x) ) \\, dx,  where  f(x)  is the curve with the greater y-value.\n* An area bounded by a function r r(θ) expressed in polar coordinates is:\nA = {1 \\over 2} \\int r^2 \\, d\\theta. \n* The area enclosed by a parametric curve \\vec u(t) (x(t), y(t))  with endpoints  \\vec u(t_0) \n \\vec u(t_1)  is given by the line integrals:\n: \\oint_{t_0}^{t_1} x \\dot y \\, dt  - \\oint_{t_0}^{t_1} y \\dot x \\, dt  \n  {1 \\over 2} \\oint_{t_0}^{t_1} (x \\dot y - y \\dot x) \\, dt \n(see Green's theorem) or the z-component of\n{1 \\over 2} \\oint_{t_0}^{t_1} \\vec u \\times \\dot{\\vec u} \\, dt.\n\nBounded area between two quadratic functions\n\nTo find the bounded area between two quadratic functions, we subtract one from the other to write the difference as\nf(x)-g(x)ax^2+bx+c\na(x-\\alpha)(x-\\beta)\nwhere f(x) is the quadratic upper bound and g(x) is the quadratic lower bound. Define the discriminant of f(x)-g(x) as\n\\Delta=b^2-4ac.\nBy simplifying the integral formula between the graphs of two functions (as given in the section above) and using Vieta's formula, we can obtain\nA\\frac{\\Delta\\sqrt{\\Delta}}{6a^2}\n\\frac{a}{6}(\\beta-\\alpha)^3,\\qquad a\\neq0.\nThe above remains valid if one of the bounding functions is linear instead of quadratic.\n\nSurface area of 3-dimensional figures\n\n* Cone: \\pi r\\left(r + \\sqrt{r^2 + h^2}\\right), where r is the radius of the circular base, and h is the height. That can also be rewritten as \\pi r^2 + \\pi r l  or \\pi r (r + l) \\,\\! where r is the radius and l is the slant height of the cone. \\pi r^2  is the base area while \\pi r l  is the lateral surface area of the cone.\n* cube: 6s^2, where s is the length of an edge.\n* cylinder: 2\\pi r(r + h), where r is the radius of a base and h is the height. The 2\\pir can also be rewritten as \\pi d, where d is the diameter.\n* prism: 2B + Ph, where B is the area of a base, P is the perimeter of a base, and h is the height of the prism.\n* pyramid: B + \\frac{PL}{2}, where B is the area of the base, P is the perimeter of the base, and L is the length of the slant.\n* rectangular prism: 2 (\\ell w + \\ell  h + w h), where \\ell is the length, w is the width, and h is the height.\n\nGeneral formula for surface area\n\nThe general formula for the surface area of the graph of a continuously differentiable function z=f(x,y), where (x,y)\\in D\\subset\\mathbb{R}^2 and D is a region in the xy-plane with the smooth boundary:\n A=\\iint_D\\sqrt{\\left(\\frac{\\partial f}{\\partial x}\\right)^2+\\left(\\frac{\\partial f}{\\partial y}\\right)^2+1}\\,dx\\,dy. \nAn even more general formula for the area of the graph of a parametric surface in the vector form \\mathbf{r}\\mathbf{r}(u,v), where \\mathbf{r} is a continuously differentiable vector function of (u,v)\\in D\\subset\\mathbb{R}^2 is:\n A=\\iint_D \\left|\\frac{\\partial\\mathbf{r}}{\\partial u}\\times\\frac{\\partial\\mathbf{r}}{\\partial v}\\right|\\,du\\,dv. \n\nList of formulas\n\nThe above calculations show how to find the areas of many common shapes.\n\nThe areas of irregular polygons can be calculated using the \"Surveyor's formula\".\n\nRelation of area to perimeter\n\nThe isoperimetric inequality states that, for a closed curve of length L (so the region it encloses has perimeter L) and for area A of the region that it encloses,\n\n4\\pi A \\le L^2,\n\nand  equality holds if and only if the curve is a circle. Thus a circle has the largest area of any closed figure with a given perimeter.\n\nAt the other extreme, a figure with given perimeter L could have an arbitrarily small area, as illustrated by a rhombus that is \"tipped over\" arbitrarily far so that two of its angles are arbitrarily close to 0° and the other two are arbitrarily close to 180°.\n\nFor a circle, the ratio of the area to the circumference (the term for the perimeter of a circle) equals half the radius r. This can be seen from the area formula πr2 and the circumference formula 2πr.\n\nThe area of a regular polygon is half its perimeter times the apothem (where the apothem is the distance from the center to the nearest point on any side).\n\nFractals\n\nDoubling the edge lengths of a polygon multiplies its area by four, which is two (the ratio of the new to the old side length) raised to the power of two (the dimension of the space the polygon resides in). But if the one-dimensional lengths of a  fractal drawn in two dimensions are all doubled, the spatial content of the fractal scales by a power of two that is not necessarily an integer. This power is called the fractal dimension of the fractal.\n\nArea bisectors\n\nThere are an infinitude of lines that bisect the area of a triangle. Three of them are the medians of the triangle (which connect the sides' midpoints with the opposite vertices), and these are concurrent at the triangle's centroid; indeed, they are the only area bisectors that go through the centroid. Any line through a triangle that splits both the triangle's area and its perimeter in half goes through the triangle's incenter (the center of its incircle). There are either one, two, or three of these for any given triangle.\n\nAny line through the midpoint of a parallelogram bisects the area.\n\nAll area bisectors of a circle or other ellipse go through the center, and any chords through the center bisect the area. In the case of a circle they are the diameters of the circle.\n\nOptimization\n\nGiven a wire contour, the surface of least area spanning (\"filling\") it is a minimal surface.  Familiar examples include soap bubbles.\n\nThe question of the filling area of the Riemannian circle remains open.\n\nThe circle has the largest area of any two-dimensional object having the same perimeter.\n\nA cyclic polygon (one inscribed in a circle) has the largest area of any polygon with a given number of sides of the same lengths.\n\nA version of the isoperimetric inequality for triangles states that the triangle of greatest area among all those with a given perimeter is equilateral.\n\nThe triangle of largest area of all those inscribed in a given circle is equilateral; and the triangle of smallest area of all those circumscribed around a given circle is equilateral.Dorrie, Heinrich (1965), 100 Great Problems of Elementary Mathematics, Dover Publ., pp. 379–380.\n\nThe ratio of the area of the incircle to the area of an equilateral triangle, \\frac{\\pi}{3\\sqrt{3}}, is larger than that of any non-equilateral triangle.\n\nThe ratio of the area to the square of the perimeter of an equilateral triangle, \\frac{1}{12\\sqrt{3}}, is larger than that for any other triangle.Chakerian, G. D. (1979) \"A Distorted View of Geometry.\" Ch. 7 in Mathematical Plums. R. Honsberger (ed.). Washington, DC: Mathematical Association of America, p. 147. Area. http://en.wikipedia.org/?curid=1209."
  }
}
