{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2162",
  "eid" : "be45e1e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778398974,
  "textBody" : "Afrikaans is a West Germanic language spoken in South Africa, Namibia and, to a lesser extent, Botswana and Zimbabwe. It evolved from the Dutch vernacularK. Pithouse, C. Mitchell, R. Moletsane, Making Connections: Self-Study & Social Action, p.91 of South Holland (Hollandic dialect)[http://www.dbnl.org/tekst/kloe004herk01_01/kloe004herk01_01.pdf Herkomst en groei van het Afrikaans - G.G. Kloeke (1950)] spoken by the mainly Dutch settlers of what is now South Africa, where it gradually began to develop distinguishing characteristics in the course of the 18th century. Hence, it is a daughter language of Dutch, and was previously referred to as \"Cape Dutch\" (a term also used to refer collectively to the early Cape settlers) or \"kitchen Dutch\" (a derogatory term used to refer to Afrikaans in its earlier days). However, it is also variously described as a creole or as a partially creolised language.Afrikaans is a daughter language of Dutch; see , , , , , .Afrikaans was historically called Cape Dutch; see , , , , , .Afrikaans is rooted in seventeenth century dialects of Dutch; see , , , .Afrikaans is variously described as a creole, a partially creolised language, or a deviant variety of Dutch; see . The term is ultimately derived from Dutch ' meaning \"African Dutch\". It is the first language of most of the Afrikaners and Coloureds of Southern Africa.\n\nAlthough Afrikaans has adopted words from other languages, including German and the Khoisan languages, an estimated 90 to 95% of the vocabulary of Afrikaans is of Dutch origin. Therefore, differences with Dutch often lie in the more analytic morphology and grammar of Afrikaans, and a spelling that expresses Afrikaans pronunciation rather than standard Dutch. There is a large degree of mutual intelligibility between the two languages—especially in written form.\n\nWith about 7 million native speakers in South Africa, or 13.5% of the population, it is the third-most-spoken language in the country. It has the widest geographical and racial distribution of all the eleven official languages of South Africa, and is widely spoken and understood as a second or third language. It is the majority language of the western half of South Africa—the provinces of the Northern Cape and Western Cape—and the first language of 75.8% of Coloured South Africans (4.8 million people), 60.8% of White South Africans (2.7 million); 4.6% of Asian South Africans (58,000 people), and 1.5% of black South Africans (600,000 people).\n\nIn addition, many native speakers of Bantu languages and English also speak Afrikaans as a second language. It is taught in schools, with about 10.3 million second-language students. One reason for the expansion of Afrikaans is its development in the public realm: it is used in newspapers, radio programs, TV, and several translations of the Bible have been published since the first one was completed in 1933.\n\nIn neighbouring Namibia, Afrikaans is widely spoken as a second language and used as a lingua franca, while as a native language it is spoken in 10.4% of households, mainly concentrated in the capital Windhoek, Walvis Bay, Swakopmund and the southern regions of Hardap and ǁKaras. It, along with German, was among the official languages of Namibia until the country became independent in 1990, 25% of the population of Windhoek spoke Afrikaans at home. Both Afrikaans and German are recognised regional languages in Namibia, although only English has official status within the government.\n\nEstimates of the total number of Afrikaans speakers range between 15 and 23 million.What follows are estimations. Afrikaans has 16.3 million speakers; see . Afrikaans has a total of 16 million speakers; see . About 9 million people speak Afrikaans as a second or third language; see , . Afrikaans has over 5 million native speakers and 15 million second-language speakers; see . Afrikaans has about 6 million native and 16 million second language speakers; see . In South Africa, over 23 million people speak Afrikaans, of which a third are first-language speakers; see . L2 \"Black Afrikaans\" is spoken, with different degrees of fluency, by an estimated 15 million; see .\n\nEtymology\n\nThe term is ultimately derived from the Dutch term ' meaning \"African Dutch\".\n\nHistory\n\nOrigin\n\nThe Afrikaans language arose in the Dutch Cape Colony, through a gradual divergence from European Dutch dialects, during the course of the 18th century. As early as the mid-18th century and as recently as the mid-20th century, Afrikaans was known in standard Dutch as a \"kitchen language\" (), lacking the prestige accorded, for example, even by the educational system in Africa, to languages spoken outside Africa. Other early epithets setting apart ' (\"Cape Dutch\", i.e. Afrikaans) as putatively beneath official Dutch standards included ', ' and ' (\"mutilated/broken/uncivilised Dutch\"), as well as ' (\"incorrect Dutch\").Alatis, Hamilton, Ai-Hui Tan (2002). Georgetown University Round Table on Languages and Linguistics 2000: Linguistics, Language and the Professions: Education, Journalism, Law, Medicine, and Technology. Washington, DC: University Press. , p. 132.Keith Brown and Sarah Ogilvie, eds. (2008). Concise Encyclopedia of Languages of the World. Oxford, UK: Elsevier. , p. 8.\n\nAn estimated 90 to 95% of Afrikaans vocabulary is ultimately of Dutch origin, and there are few lexical differences between the two languages. Afrikaans has a considerably more regular morphology, grammar, and spelling. There is a degree of mutual intelligibility between the two languages, particularly in written form.\n\nAfrikaans acquired some lexical and syntactical borrowings from other languages such as Malay, Khoisan languages, Portuguese, and of the Bantu languages, and Afrikaans has also been significantly influenced by South African English. Dutch speakers are confronted with fewer non-cognates when listening to Afrikaans than the other way round. Mutual intelligibility thus tends to be asymmetrical, as it is easier for Dutch speakers to understand Afrikaans than for Afrikaans speakers to understand Dutch.\n\nIn general, mutual intelligibility between Dutch and Afrikaans is better than between Dutch and Frisian or between Danish and Swedish. The South African poet writer Breyten Breytenbach, attempting to visualize the language distance for anglophones once remarked that the differences between (Standard) Dutch and Afrikaans are comparable to those between the Received Pronunciation and Southern American English.S. Linfield, interview in Salmagundi; 2000.\n\nDevelopment\n\nA relative majority of the first settlers whose descendants today are the Afrikaners were from the United Provinces (now Netherlands and Flanders), though up to one-sixth of the community was also of French Huguenot origin, and a seventh from Germany.\n\nAfrican and Asian workers and slaves contributed to the development of Afrikaans. The slave population was made up of people from East Africa, West Africa, India, Madagascar, and the Dutch East Indies (modern Indonesia). A number were also indigenous Khoisan people, who were valued as interpreters, domestic servants, and labourers. Many free and enslaved women married, cohabited with, or were victims of sexual violence from the male Dutch settlers. M. F. Valkhoff argued that 75% of children born to female slaves in the Dutch Cape Colony between 1652 and 1672 had a Dutch father. Some consider this the origin of the ethnic group, the Cape Coloureds, who adopted various forms of speech utilising a Dutch vocabulary. Sarah Grey Thomason and Terrence Kaufman argue that Afrikaans' development as a separate language was \"heavily conditioned by nonwhites who learned Dutch imperfectly as a second language.\"\n\nBeginning in about 1815, Afrikaans started to replace Malay as the language of instruction in Muslim schools in South Africa, written with the Arabic alphabet: see Arabic Afrikaans. Later, Afrikaans, now written with the Latin script, started to appear in newspapers and political and religious works in around 1850.\n\nIn 1875, a group of Afrikaans-speakers from the Cape formed the ' (\"Society for Real Afrikaners\"), and published a number of books in Afrikaans including grammars, dictionaries, religious materials and histories. In 1925, Afrikaans was recognised by the South African government as a real language, rather than simply a slang version of Dutch proper.\n\nRecognition\n\nAfrikaans was considered a Dutch dialect in South Africa until the early 20th century, when it became recognised as a distinct language under South African law, alongside Standard Dutch, which it eventually replaced as an official language.\n\nBefore the Boer Wars (1880–81 and 1899–1902), \"and indeed for some time afterwards, Afrikaans was regarded as inappropriate for educated discourse.  Rather, Afrikaans was described derogatorily as ‘a kitchen language’ or as ‘a bastard jargon', suitable for communication mainly between the Boers and their servants.\"  23 years after the Second Boer War ended in 1902, mostly due to the efforts of the Afrikans Language Movement  on 8 May 1925, the Official Languages of the Union Act No 8 of 1925 was passed at a joint sitting of the House of Assembly and the Senate, in which 'Dutch' was \"declared to include Afrikaans\".  The Constitution of 1961 reversed the position of Afrikaans and Dutch, so that English and Afrikaans were the official languages and Afrikaans was deemed to include Dutch. The Constitution of 1983 removed any mention of Dutch altogether.\n\nMonument\n\nThe Afrikaans Language Monument (') is located on a hill overlooking Paarl, Western Cape Province, South Africa. Officially opened on 10 October 1975, it commemorates the 50th anniversary of Afrikaans being declared an official language of South Africa in distinction to Dutch.  It was erected in Paarl on the 100th anniversary of the founding of the ' (Society of Real Afrikaners), an organisation which helped to strengthen Afrikaners' identity and pride in their language.\n\nStandardisation\n\nThe linguist Paul Roberge suggested the earliest 'truly Afrikaans' texts are doggerel verse from 1795 and a dialogue transcribed by a Dutch traveller in 1825. Printed material among the Afrikaners at first used only standard European Dutch. By the mid-19th century, more and more were appearing in Afrikaans, which was very much still regarded as a set of regional dialects.\n\nIn 1861, L.H. Meurant published his ' (\"Conversation between Claus Truthsayer and John Doubter\"), which is considered by some to be the first authoritative Afrikaans text.  Abu Bakr Effendi also compiled his Arabic Afrikaans Islamic instruction book between 1862 and 1869, although this was only published and printed in 1877. The first Afrikaans grammars and dictionaries were published in 1875 by the ' (\"Society for Real Afrikaners\") in Cape Town.\n\nThe main Afrikaans dictionary is the ' (WAT) (Dictionary of the Afrikaans Language), which is as yet incomplete owing to the scale of the project, but the one-volume dictionary in household use is the ' (HAT). The official orthography of Afrikaans is the ', compiled by .\n\nThe Afrikaans Bible\n\nThe Afrikaner religion had stemmed from the Protestant practices of the Reformed church of Holland during the 17th century, later on being influenced in South Africa by British ministries during the 1800s . A major landmark in the development of the language was the translation of the whole Bible into Afrikaans. Before this, most Cape Dutch-Afrikaans speakers had to rely on the Dutch . This  had its origins with the Synod of Dordrecht of 1618 and was thus in an archaic form of Dutch. This was hard for Dutch and Cape Dutch speakers to understand, and increasingly unintelligible for Afrikaans speakers.\n\nC. P. Hoogehout, Arnoldus Pannevis, and Stephanus Jacobus du Toit were the first Afrikaans Bible translators. Important landmarks in the translation of the Scriptures were in 1878 with C. P. Hoogehout's translation of the ' (Gospel of Mark, lit. Gospel according to Mark); however, this translation was never published. The manuscript is to be found in the South African National Library, Cape Town.\n\nThe first official translation of the entire Bible into Afrikaans was in 1933 by J. D. du Toit, E. E. van Rooyen, J. D. Kestell, H. C. M. Fourie, and BB Keet. This monumental work established Afrikaans as ', that is \"a pure and proper language\" for religious purposes, especially amongst the deeply Calvinist Afrikaans religious community that previously had been sceptical of a Bible translation that varied from the Dutch version that they were used to.\n\nIn 1983, a fresh translation marked the 50th anniversary of the 1933 version and provided a much-needed revision. The final editing of this edition was done by E. P. Groenewald, A. H. van Zyl, P. A. Verhoef, J. L. Helberg and W. Kempen.\n\nClassification\n\n* Indo-European languages\n** Germanic\n*** West Germanic\n**** Low Franconian\n***** Dutch\n****** Afrikaans, Dutch-based creoles\n\nAfrikaans belongs to its own West Germanic sub-group, the Low Franconian languages. Its closest relative is the mutually-intelligible mother language, Dutch language. Other West Germanic languages related to Afrikaans are German, English and the Frisian languages and the unstandardised languages Low German and Yiddish.\n\nGeographic distribution\n\nStatistics\n\nSociolinguistics\n\nSome state that instead of Afrikaners, which refers to an ethnic group, the terms ' or ' (lit. Afrikaans speakers) should be used for people of any ethnic origin who speak Afrikaans. Linguistic identity has not yet established which terms shall prevail, and all three are used in common parlance. The white Afrikaans-speaking community started being referred to colloquially as \"The Boere\".  The terms ' (farm boy) and ' (farm girl) became popular among young white Afrikaners for expressing national pride, regardless of whether or not they actually grew up on a farm.\n\nAfrikaans is also widely spoken in Namibia. Before independence, Afrikaans had equal status with German as an official language. Since independence in 1990, Afrikaans has had constitutional recognition as a national, but not official, language. There is a much smaller number of Afrikaans speakers among Zimbabwe's white minority, as most have left the country since 1980. Afrikaans was also a medium of instruction for schools in Bophuthatswana, an Apartheid-era Bantustan.\n\nMany South Africans living and working in Belgium, the Netherlands, the United Kingdom, Republic of Ireland, Australia, New Zealand, Canada, the United States, the UAE and Kuwait are also Afrikaans-speaking. They have access to Afrikaans websites, news sites such as [http://www.netwerk24.com/ Netwerk24.com] and [http://www.sake24.com/ Sake24], and radio broadcasts over the web, such as those from Radio Sonder Grense, Bokradio and Radio Pretoria.\n\nAfrikaans has been influential in the development of South African English. Many Afrikaans loanwords have found their way into South African English, such as ' (\"pickup truck\"), ' (\"barbecue\"), ' (\"tangerine\"), ' (American \"sneakers\", British \"trainers\", Canadian \"runners\"). A few words in standard English are derived from Afrikaans, such as aardvark (lit. \"earth pig\"), trek (\"pioneering journey\", in Afrikaans lit. \"pull\" but used also for \"migrate\"), spoor (\"animal track\"), ' (\"Southern African grassland\" in Afrikaans, lit. \"field\"), commando from Afrikaans ' meaning small fighting unit, ' (\"tree snake\") and ' (\"segregation\"; more accurately \"apartness\" or \"the state or condition of being apart\").\n\nIn 1976, secondary-school pupils in Soweto began a rebellion in response to the government's decision that Afrikaans be used as the language of instruction for half the subjects taught in non-White schools (with English continuing for the other half). Although English is the mother tongue of only 8.2% of the population, it is the language most widely understood, and the second language of a majority of South Africans.[http://www.sagoodnews.co.za/public_sector/govt_info_available_online_in_all_official_languages.html Govt info available online in all official languages – South Africa – The Good News] . Afrikaans is more widely spoken than English in the Northern and Western Cape provinces, several hundred kilometres from Soweto.Black Linguistics: Language, Society and Politics in Africa and the Americas, by Sinfree Makoni, p. 120S.\n\nThe Black community's opposition to Afrikaans and preference for continuing English instruction was underlined when the government rescinded the policy one month after the uprising: 96% of Black schools chose English (over Afrikaans or native languages) as the language of instruction. Also, due to Afrikaans being viewed as the language of the white oppressor by some, pressure has been increased to remove Afrikaans as a teaching language in South African universities, resulting in bloody student protests in 2015.\n\nUnder South Africa's Constitution of 1996, Afrikaans remains an official language, and has equal status to English and nine other languages. The new policy means that the use of Afrikaans is now often reduced in favour of English, or to accommodate the other official languages. In 1996, for example, the South African Broadcasting Corporation reduced the amount of television airtime in Afrikaans, while South African Airways dropped its Afrikaans name ' from its livery. Similarly, South Africa's diplomatic missions overseas now only display the name of the country in English and their host country's language, and not in Afrikaans.\n\nIn spite of these moves, the language has remained strong, and Afrikaans newspapers and magazines continue to have large circulation figures. Indeed, the Afrikaans-language general-interest family magazine ' has the largest readership of any magazine in the country. In addition, a pay-TV channel in Afrikaans called KykNet was launched in 1999, and an Afrikaans music channel, MK (') (lit. 'Music Channel'), in 2005. A large number of Afrikaans books are still published every year, mainly by the publishers Human & Rousseau, , , and . The Afrikaans film trilogy ' (first released in 2008) caused a reawakening of the Afrikaans film Industry (which has been dead since the mid to late 1990s) and Belgian-born singer Karen Zoid's debut single \"\" (released 2001) caused a resurgence in the Afrikaans music industry as well as gave rise to the Afrikaans Rock genre.\n\nAfrikaans has two monuments erected in its honour. The first was erected in , South Africa, in 1893, and the second, nowadays better-known Afrikaans Language Monument ('), was built in Paarl, South Africa, in 1975.\n\nWhen the British design magazine Wallpaper described Afrikaans as \"one of the world's ugliest languages\" in its September 2005 article about the monument,[https://web.archive.org/web/20060216042054/http://business.iafrica.com/news/657706.htm Rupert snubs mag over Afrikaans slur], Business Africa, 5 December 2005. South African billionaire Johann Rupert (chairman of the Richemont Group), responded by withdrawing advertising for brands such as Cartier, Van Cleef & Arpels, Montblanc and Alfred Dunhill from the magazine.[http://www.iol.co.za/news/south-africa/afrikaans-stars-join-row-over-ugly-language-1.261058 Afrikaans stars join row over 'ugly language'] Cape Argus, 10 December 2005. The author of the article, Bronwyn Davies, was an English-speaking South African.\n\nModern Dutch and Afrikaans share over 90 percent of their vocabulary. Afrikaans speakers are able to learn Dutch within a comparatively short time. Native Dutch speakers pick up written Afrikaans even more quickly, due to its simplified grammar, whereas understanding spoken Afrikaans might need more effort. Afrikaans speakers can learn Dutch pronunciation with little training. This has enabled Dutch and Belgian companies to outsource their call centre operations to South Africa.[http://www.eprop.co.za/news/item/4489-SA-holds-its-own-in-global-call-centre-industry.html \"SA holds its own in global call centre industry\"], eProp Commercial Property News in South Africa.\n\nCurrent status\n\nPost-apartheid South Africa has seen a loss of preferential treatment by the government for Afrikaans, in terms of education, social events, media (TV and radio), and general status throughout the country, given that it now shares its place as official language with ten other languages. Nevertheless, Afrikaans remains more prevalent in the media – radio, newspapers and televisionOranje FM, Radio Sonder Grense, Jacaranda FM, Radio Pretoria, Rapport, Beeld, Die Burger, Die Son, Afrikaans news is run everyday; the PRAAG website is a web-based news service. On pay channels it is provided as second language on all sports, Kyknet – than any of the other official languages, except English. More than 300 book titles in Afrikaans are published annually. South African census figures suggest a growing number of speakers in all nine provinces, a total of 6.85 million in 2011 compared to 5.98 million a decade earlier. The South African Institute of Race Relations (SAIRR) project that a growing majority will be Coloured Afrikaans speakers. Afrikaans speakers experience higher employment rates than other South African language groups, though half a million remain unemployed.\n\nDespite the challenges of demotion and emigration that it faces in South Africa, the Afrikaans vernacular remains competitive, being popular in DSTV pay channels and several internet sites, while generating high newspaper and music CD sales. A resurgence in Afrikaans popular music since the late 1990s has invigorated the language, especially among a younger generation of South Africans. A recent trend is the increased availability of pre-school educational CDs and DVDs. Such media also prove popular with the extensive Afrikaans-speaking expatriate communities who seek to retain language proficiency in a household context.\n\nAfter years of slumber, Afrikaans language cinema is showing signs of new vigour. The 2007 film ', the first full-length Afrikaans movie since Paljas in 1998, is seen as the dawn of a new era in Afrikaans cinema. Several short films have been created and more feature-length movies, such as ' and ' (both in 2008) have been produced, besides the 2011 Afrikaans-language film ', which was the first Afrikaans film to screen at the Cannes Film Festival. The film ' was also released in 2011. The Afrikaans Film industry started gaining international recognition via the likes of big Afrikaans Hollywood film stars, like Charlize Theron (Monster) and Sharlto Copley (District 9) promoting their mother tongue.\n\nAfrikaans seems to be returning to the SABC. SABC3 announced early in 2009 that it would increase Afrikaans programming due to the \"growing Afrikaans-language market and [their] need for working capital as Afrikaans advertising is the only advertising that sells in the current South African television market\". In April 2009, SABC3 started screening several Afrikaans-language programmes.[http://www.screenafrica.com/news/industry/997616.htm SABC3 \"tests\" Afrikaans programming], Screen Africa, 15 April 2009 Further latent support for the language derives from its de-politicised image in the eyes of younger-generation South Africans, who less and less often view it as \"the language of the oppressor\". Indeed, there is a groundswell movement within Afrikaans to be inclusive, and to promote itself along with the other indigenous official languages. In Namibia, the percentage of Afrikaans speakers declined from 11.4% (2001 Census) to 10.4% (2011 Census). The major concentrations are in Hardap (41.0%), ǁKaras (36.1%), Erongo (20.5%), Khomas (18.5%), Omaheke (10.0%), Otjozondjupa (9.4%), Kunene (4.2%), and Oshikoto (2.3%).[http://www.nsa.org.na/files/downloads/Namibia%202011%20Population%20and%20Housing%20Census%20Main%20Report.pdf Namibia 2011 Population & Housing Census Main Report] \n\nAfrikaans is offered at many universities outside of South Africa including in the Netherlands, Belgium, German, Poland, Russia and America.http://www.afrikaans.com/news-headlines/het-jy.../afrikaans-floreer-in-die-buiteland\n\nDialects\n\nFollowing early dialectal studies of Afrikaans, it was theorised that three main historical dialects probably existed after the Great Trek in the 1830s. These dialects are the Northern Cape, Western Cape, and Eastern Cape dialects.They were named before the establishment of the current Western Cape, Eastern Cape, and Northern Cape provinces, and are not dialects of those provinces '. Northern Cape dialect may have resulted from contact between Dutch settlers and the Khoi-Khoi people between the Great Karoo and the Kunene, and Eastern Cape dialect between the Dutch and the Xhosa. Remnants of these dialects still remain in present-day Afrikaans, although the standardising effect of Standard Afrikaans has contributed to a great levelling of differences in modern times.\n\nThere is also a prison cant, known as  or , which is based on Afrikaans, yet heavily influenced by Zulu. This language is used as a secret language in prison and is taught to initiates.\n\n \n\nThe term ' (\"Cape Afrikaans\") is sometimes erroneously used to refer to the entire Western Cape dialect; it is more commonly used for a particular sociolect spoken in the Cape Peninsula of South Africa.  was once spoken by all population groups. However, it became increasingly restricted to the Cape Coloured ethnic group in Cape Town and environs.\n\n preserves some features more similar to Dutch than to Afrikaans.\n* The 1st person singular pronoun ' as in Dutch as opposed to Afrikaans '\n* The diminutive endings ', pronounced as in Dutch and not as as in Afrikaans.\n* The use of the form ' (compare Dutch ') as opposed to Afrikaans '\n\n has some other features not typically found in Afrikaans.\n* The pronunciation of ', normally as in Dutch is often a. This is the strongest feature of .\n* The insertion of after, and when followed by, e.g. ' as opposed to Afrikaans '.\n\n is also characterised by much code-switching between English and Afrikaans, especially in the inner-city and lower socio-economic status areas of Cape Town.\n\nAn example of characteristic :\n\n: : | \n: English (direct): | And I say to you, what seek you here by me? I seek you not! No, go now away!\nEnglish: And I'm telling you, what are you looking for here? I don't want you here! No, go away now!\n\n' \n\nThe term ' (\"Afrikaans of the Orange River\") is sometimes erroneously used to refer to the Northern Cape dialect; it is more commonly used for the regional peculiarities of standard Afrikaans spoken in the Upington/Orange River wine district of South Africa.\n\nSome of the characteristics of  are the plural form ' (Ma-, '), variant pronunciation such as in ' (\"Church\") and ' (\"money\") and the ending ', which indicates possession.\n\nExpatriate geolect \n\nAlthough Afrikaans is mainly spoken in South Africa and Namibia, smaller Afrikaans-speaking populations live in Argentina, Australia, Botswana, Brazil, Canada, Lesotho, Malawi, the Netherlands, New Zealand, Swaziland, the UAE, the United Kingdom, Republic of Ireland, the USA, Zambia, and Zimbabwe. Most Afrikaans-speaking people living outside Africa are emigrants and their descendants. Because of emigration and migrant labour, more than 100,000 Afrikaans speakers may live in the United Kingdom.\n\nInfluences on Afrikaans from other languages \n\nMalay \n\nDue to the early settlement of a Cape Malay community in Cape Town, who are now known as Coloureds, numerous Malay words were brought into Afrikaans. Some of these words entered Dutch via the Indonesian language as part of the colonial heritage. Malay words in Afrikaans include:\n*, which means 'very'/'much'/'many' (from ') is a very commonly used Afrikaans word, different from its Dutch equivalent ' or '.\n*, Afrikaans for jacket, where Dutch would use ' or '. The word ' in Dutch is now considered archaic and only used in written, literary texts.\n*, which means banana. This is different from the common Dutch word '. The Indonesian word ' is also used in Dutch, though usage is less common.\n\nPortuguese \n\nSome words originally came from Portuguese such as ' (\"umbrella\") from the Portuguese ', ' (\"pen/cattle enclosure\") from the Portuguese ', and ' (\"corn\", from '). These words have become common in South Africa to an extent of being used in many other South African languages. Some of these words also exist in Dutch, like ' \"parasol\", though usage is less common and meanings can slightly differ.\n\nKhoisan languages \n\n*, meaning cannabis\n*, meaning lizard, diminutive adapted from Khoekhoe word\n*, meaning insect, from the Khoisan xo-xo\n* blanket of animal hides\n* walking stick from Khoekhoe[https://books.google.com/books?id\nQ3tAqIU0dPsC&pgPA97&dq\nbantu+loanwords+afrikaans&hlen&sa\nX&ved0ahUKEwim0MLErvnQAhVJJsAKHR5rCGIQ6AEIfTAT#v\nonepage&q&f=true One Thousand Languages: Living, Endangered, and Lost], Peter Austin\nUniversity of California Press, 2008, page 97\n\nSome of these words also exist in Dutch, though with a more specific meaning: ' for example means \"South-African tribal javelin\" and ' means \"South-African tribal blanket of animal hides\".\n\nBantu languages \n\nLoanwords from Bantu languages in Afrikaans include the names of indigenous birds, such as ' and ', and indigenous plants, such as ' and '.[https://books.google.com/books?id\nHTzjAAAAMAAJ&dqbantu+loanwords+afrikaans&focus\nsearchwithinvolume&q=%22Bantu+loan-words+in+Afrikaans%22 Standard encyclopaedia of Southern Africa], Volume 1, D.J.. Potgieter, NASOU, 1970, page 111\n*, from the Zulu word ' meaning \"scholar\" or \"student\",[https://books.google.com/books?idsIDFHOQrYgoC&dq\numfundi%20zulu&pgPA87#v\nonepage&q&f=true A Zulu-Kafir Dictionary, Etymologically Explained ... Preceded by an Introduction on the Zulu-Kafir Language], Pike, 1857, page 87 but used to mean someone who is a student/expert on a certain subject, i.e. He is a language .\n*, meaning bride price, from (and referring to) lobolo of the Nguni languages\n*, the grey crowned crane, known in Latin as Balearica regulorum\n*, medium-sized dioecious tree known in Latin as Sclerocarya birrea\n*, species of thatching grass known as Hyparrhenia\n*, deciduous tree also known by its Latin name, Spirostachys africana\n* / , an adaption of the word ', meaning \"to go home\" or \"to knock off\".\n\nGrammar\n\nIn Afrikaans grammar, there is no distinction between the infinitive and present forms of verbs, with the exception of the verbs 'to be' and 'to have':\n\nIn addition, verbs do not conjugate differently depending on the subject. For example,\n\nOnly a handful of Afrikaans verbs have a preterite, namely the auxiliary ' (\"to be\"), the modal verbs, and the verb ' (\"to think\"). The preterite of ' (\"may\") is rare in contemporary Afrikaans.\n\nAll other verbs use the perfect tense (hê + past participle) for the past. Therefore, there is no distinction in Afrikaans between I drank and I have drunk. (Also in colloquial German, the past tense is often replaced with the perfect.)\n\nWhen telling a longer story, Afrikaans speakers usually avoid the perfect and simply use the present tense, or historical present tense instead (as is possible, but less common, in English as well).\n\nA particular feature of Afrikaans is its use of the double negative; it is classified in Afrikaans as ' and is something that is absent from the other West Germanic standard languages. For example,\n\n:  / '\nEnglish: He speaks no Afrikaans. / He can not speak Afrikaans. / He can't speak Afrikaans.\n: \n\nBoth French and San origins have been suggested for double negation in Afrikaans. While double negation is still found in Low Franconian dialects in West-Flanders and in some \"isolated\" villages in the centre of the Netherlands (such as Garderen), it takes a different form, which is not found in Afrikaans. The following is an example:\n\n* (lit. I want this not do not.)\n: English: I do not want to do this.\n* Compare with ', which changes the meaning to \"I want not to do this.\" Whereas ' emphasizes a lack of desire to act, ' emphasizes the act itself.\n\nThe ' was the Middle Dutch way to negate but it has been suggested that since ' became highly non-voiced, ' or ' was needed to complement the '. With time the ' disappeared in most Dutch dialects.\n\nThe double negative construction has been fully grammaticalised in standard Afrikaans and its proper use follows a set of fairly complex rules as the examples below show:\n\nA notable exception to this is the use of the negating grammar form that coincides with negating the English present participle. In this case there is only a single negation.\n\n: \nEnglish: He is in [the] hospital, though he eats not.\nCertain words in Afrikaans arise due to grammar. For example, ', which literally means \"must not\", usually becomes '; although one does not have to write or say it like this, virtually all Afrikaans speakers will change the two words to ' in the same way as do not shifts to don't in English.\n\nThe Dutch word ' (\"it\" in English) does not correspond to ' in Afrikaans. The Dutch words corresponding to Afrikaans ' are ', ', ' and '.\n\nPhonology\n\nVowels\n\n* As phonemes, and occur only in the words ' 'mirror' and ' 'bullet', which used to be pronounced with sequences and, respectively. In other cases, and occur as allophones of, respectively, and before.\n* is phonetically long before.\n* is always stressed and occurs only in the word ' 'wedges'.\n* The closest unrounded counterparts of are central, rather than front.\n* occur only in a few words.\n* As a phoneme, occurs only in some loanwords from English, such as ' 'pal', as well as in some words such as ' 'departure'. As an allophone of before, occurs dialectally, most commonly in the former Transvaal and Free State provinces.\n* As a phoneme, occurs only in some loanwords from English (such as ' 'grand'), as well as before in some words. also occurs as an allophone of before and the sequences.\n\n* occur mainly in loanwords.\n\nConsonants\n\n* All obstruents at the ends of words are devoiced, so that e.g. a final is realized as.\n* occur only in loanwords. is also an allophone of in some environments.\n* is most often uvular ~]}}. Only this source mentions the trilled realization. Velar occurs only in some speakers.\n* is usually an alveolar trill or tap. In some parts of the former Cape Province, it is realized uvularly, either as a trill or a fricative.\n\nOrthography\n\nThere are many parallels to the Dutch orthography conventions and those used for Afrikaans. There are 26 letters.\n\nIn Afrikaans, many consonants are dropped from the earlier Dutch spelling. For example, ' ('only') in Dutch becomes ' in Afrikaans. Also, Afrikaans and some Dutch dialects make no distinction between and, having merged the latter into the former; while the word for \"south\" is written ' in Dutch, it is spelled ' in Afrikaans (as well as dialectal Dutch writings) to represent this merger. Similarly, the Dutch digraph ', normally pronounced as, is written as ', except where it replaces the Dutch suffix ' which is pronounced as or, as in  > .\n\nAnother difference is the indefinite article, ' in Afrikaans and  in Dutch. \"A book\" is ' in Afrikaans, whereas it is either ' or ' in Dutch. This ' is usually pronounced as just a weak vowel,.\n\nThe diminutive suffix in Afrikaans is ', whereas in Dutch it is ', hence a \"bit\" is  in Afrikaans and  in Dutch.\n\nThe letters c, q, x, and z occur almost exclusively in borrowings from French, English, Greek and Latin. This is usually because words that had c and ch in the original Dutch are spelled with k and g, respectively, in Afrikaans. Similarly original qu and x are spelt kw and ks, respectively. For example, ' instead of equatoriaal, and ' instead of excuus.\n\nThe vowels with diacritics in non-loanword Afrikaans are: á, é, è, ê, ë, í, î, ï, ó, ô, ú, û, ý. Diacritics are ignored when alphabetising, though they are still important, even when typing the diacritic forms may be difficult. For example, ' instead of the 3 e's alongside each other: *, which can never occur in Afrikaans, or ', which translates to \"say\", whereas ' is a possessive form.\n\nInitial apostrophes\n\nA few short words in Afrikaans take initial apostrophes. In modern Afrikaans, these words are always written in lower case (except if the entire line is uppercase), and if they occur at the beginning of a sentence, the next word is capitalised. Three examples of such apostrophed words are '. The last (the indefinite article) is the only apostrophed word that is common in modern written Afrikaans, since the other examples are shortened versions of other words (' and ', respectively) and are rarely found outside of a poetic context.\n\nHere are a few examples:\n\nThe apostrophe and the following letter are regarded as two separate characters, and are never written using a single glyph, although a single character variant of the indefinite article appears in Unicode, .\n\nTable of characters\n\nFor more on the pronunciation of the letters below, see Help:IPA/Afrikaans.\n\nAfrikaans phrases\n\nAlthough there are many different dialects and accents, the transcription would be fairly standard.\n\nIn the Dutch language the word ' means African, in the general sense. Consequently, Afrikaans is commonly denoted as '. This ambiguity also exists in Afrikaans itself and is either resolved in the context of its usage, or by using ' for an African person, and ' in the adjective sense.\n\nA handful of Afrikaans words are exactly the same as in English. The following Afrikaans sentences, for example, are exactly the same in the two languages, in terms of both their meaning and spelling; only their pronunciation differs.\n* \n* \n\nSample text\n\nPsalm 23 1983 translation:\n\nDie Here is my Herder, ek kom niks kort nie.\nHy laat my in groen weivelde rus. Hy bring my by waters waar daar vrede is.\nHy gee my nuwe krag. Hy lei my op die regte paaie tot eer van Sy naam.\nSelfs al gaan ek deur donker dieptes, sal ek nie bang wees nie, want U is by my. In U hande is ek veilig.\n\nPsalm 23 alternative translation:\n\nDie Here is my Herder, niks sal my ontbreek nie.\nHy laat my neerlê in groen weivelde; na waters waar rus is, lei Hy my heen.\nHy verkwik my siel; Hy lei my in die spore van geregtigheid, om sy Naam ontwil.\nAl gaan ek ook in 'n dal van doodskaduwee, ek sal geen onheil vrees nie; want U is met my: u stok en u staf die vertroos my.\n\nLord's Prayer (Afrikaans New Living translation)\n\nOns Vader in die hemel, laat U Naam geheilig word.\nLaat U koningsheerskappy spoedig kom.\nLaat U wil hier op aarde uitgevoer word soos in die hemel.\nGee ons die porsie brood wat ons vir vandag nodig het.\nEn vergeef ons ons sondeskuld soos ons ook óns skuldenaars vergewe het.\nBewaar ons sodat ons nie aan verleiding sal toegee nie; en bevry ons van die greep van die Bose.\nWant van U is die koninkryk,\nen die krag,\nen die heerlikheid,\ntot in ewigheid. Amen\n\nLord's Prayer (Original translation):\n\nOnse Vader wat in die hemel is,\nlaat U Naam geheilig word;\nlaat U koninkryk kom;\nlaat U wil geskied op die aarde,\nnet soos in die hemel.\nGee ons vandag ons daaglikse brood;\nen vergeef ons ons skulde\nsoos ons ons skuldenaars vergewe\nen laat ons nie in die versoeking nie\nmaar verlos ons van die Bose\nWant aan U behoort die koninkryk\nen die krag\nen die heerlikheid\ntot in ewigheid. Amen",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Afrikaans" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2162" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Afrikaans is a West Germanic language spoken in South Africa, Namibia and, to a lesser extent, Botswana and Zimbabwe. It evolved from the Dutch vernacularK. Pithouse, C. Mitchell, R. Moletsane, Making Connections: Self-Study & Social Action, p.91 of South Holland (Hollandic dialect)[http://www.dbnl.org/tekst/kloe004herk01_01/kloe004herk01_01.pdf Herkomst en groei van het Afrikaans - G.G. Kloeke (1950)] spoken by the mainly Dutch settlers of what is now South Africa, where it gradually began to develop distinguishing characteristics in the course of the 18th century. Hence, it is a daughter language of Dutch, and was previously referred to as \"Cape Dutch\" (a term also used to refer collectively to the early Cape settlers) or \"kitchen Dutch\" (a derogatory term used to refer to Afrikaans in its earlier days). However, it is also variously described as a creole or as a partially creolised language.Afrikaans is a daughter language of Dutch; see , , , , , .Afrikaans was historically called Cape Dutch; see , , , , , .Afrikaans is rooted in seventeenth century dialects of Dutch; see , , , .Afrikaans is variously described as a creole, a partially creolised language, or a deviant variety of Dutch; see . The term is ultimately derived from Dutch ' meaning \"African Dutch\". It is the first language of most of the Afrikaners and Coloureds of Southern Africa.\n\nAlthough Afrikaans has adopted words from other languages, including German and the Khoisan languages, an estimated 90 to 95% of the vocabulary of Afrikaans is of Dutch origin. Therefore, differences with Dutch often lie in the more analytic morphology and grammar of Afrikaans, and a spelling that expresses Afrikaans pronunciation rather than standard Dutch. There is a large degree of mutual intelligibility between the two languages—especially in written form.\n\nWith about 7 million native speakers in South Africa, or 13.5% of the population, it is the third-most-spoken language in the country. It has the widest geographical and racial distribution of all the eleven official languages of South Africa, and is widely spoken and understood as a second or third language. It is the majority language of the western half of South Africa—the provinces of the Northern Cape and Western Cape—and the first language of 75.8% of Coloured South Africans (4.8 million people), 60.8% of White South Africans (2.7 million); 4.6% of Asian South Africans (58,000 people), and 1.5% of black South Africans (600,000 people).\n\nIn addition, many native speakers of Bantu languages and English also speak Afrikaans as a second language. It is taught in schools, with about 10.3 million second-language students. One reason for the expansion of Afrikaans is its development in the public realm: it is used in newspapers, radio programs, TV, and several translations of the Bible have been published since the first one was completed in 1933.\n\nIn neighbouring Namibia, Afrikaans is widely spoken as a second language and used as a lingua franca, while as a native language it is spoken in 10.4% of households, mainly concentrated in the capital Windhoek, Walvis Bay, Swakopmund and the southern regions of Hardap and ǁKaras. It, along with German, was among the official languages of Namibia until the country became independent in 1990, 25% of the population of Windhoek spoke Afrikaans at home. Both Afrikaans and German are recognised regional languages in Namibia, although only English has official status within the government.\n\nEstimates of the total number of Afrikaans speakers range between 15 and 23 million.What follows are estimations. Afrikaans has 16.3 million speakers; see . Afrikaans has a total of 16 million speakers; see . About 9 million people speak Afrikaans as a second or third language; see , . Afrikaans has over 5 million native speakers and 15 million second-language speakers; see . Afrikaans has about 6 million native and 16 million second language speakers; see . In South Africa, over 23 million people speak Afrikaans, of which a third are first-language speakers; see . L2 \"Black Afrikaans\" is spoken, with different degrees of fluency, by an estimated 15 million; see .\n\nEtymology\n\nThe term is ultimately derived from the Dutch term ' meaning \"African Dutch\".\n\nHistory\n\nOrigin\n\nThe Afrikaans language arose in the Dutch Cape Colony, through a gradual divergence from European Dutch dialects, during the course of the 18th century. As early as the mid-18th century and as recently as the mid-20th century, Afrikaans was known in standard Dutch as a \"kitchen language\" (), lacking the prestige accorded, for example, even by the educational system in Africa, to languages spoken outside Africa. Other early epithets setting apart ' (\"Cape Dutch\", i.e. Afrikaans) as putatively beneath official Dutch standards included ', ' and ' (\"mutilated/broken/uncivilised Dutch\"), as well as ' (\"incorrect Dutch\").Alatis, Hamilton, Ai-Hui Tan (2002). Georgetown University Round Table on Languages and Linguistics 2000: Linguistics, Language and the Professions: Education, Journalism, Law, Medicine, and Technology. Washington, DC: University Press. , p. 132.Keith Brown and Sarah Ogilvie, eds. (2008). Concise Encyclopedia of Languages of the World. Oxford, UK: Elsevier. , p. 8.\n\nAn estimated 90 to 95% of Afrikaans vocabulary is ultimately of Dutch origin, and there are few lexical differences between the two languages. Afrikaans has a considerably more regular morphology, grammar, and spelling. There is a degree of mutual intelligibility between the two languages, particularly in written form.\n\nAfrikaans acquired some lexical and syntactical borrowings from other languages such as Malay, Khoisan languages, Portuguese, and of the Bantu languages, and Afrikaans has also been significantly influenced by South African English. Dutch speakers are confronted with fewer non-cognates when listening to Afrikaans than the other way round. Mutual intelligibility thus tends to be asymmetrical, as it is easier for Dutch speakers to understand Afrikaans than for Afrikaans speakers to understand Dutch.\n\nIn general, mutual intelligibility between Dutch and Afrikaans is better than between Dutch and Frisian or between Danish and Swedish. The South African poet writer Breyten Breytenbach, attempting to visualize the language distance for anglophones once remarked that the differences between (Standard) Dutch and Afrikaans are comparable to those between the Received Pronunciation and Southern American English.S. Linfield, interview in Salmagundi; 2000.\n\nDevelopment\n\nA relative majority of the first settlers whose descendants today are the Afrikaners were from the United Provinces (now Netherlands and Flanders), though up to one-sixth of the community was also of French Huguenot origin, and a seventh from Germany.\n\nAfrican and Asian workers and slaves contributed to the development of Afrikaans. The slave population was made up of people from East Africa, West Africa, India, Madagascar, and the Dutch East Indies (modern Indonesia). A number were also indigenous Khoisan people, who were valued as interpreters, domestic servants, and labourers. Many free and enslaved women married, cohabited with, or were victims of sexual violence from the male Dutch settlers. M. F. Valkhoff argued that 75% of children born to female slaves in the Dutch Cape Colony between 1652 and 1672 had a Dutch father. Some consider this the origin of the ethnic group, the Cape Coloureds, who adopted various forms of speech utilising a Dutch vocabulary. Sarah Grey Thomason and Terrence Kaufman argue that Afrikaans' development as a separate language was \"heavily conditioned by nonwhites who learned Dutch imperfectly as a second language.\"\n\nBeginning in about 1815, Afrikaans started to replace Malay as the language of instruction in Muslim schools in South Africa, written with the Arabic alphabet: see Arabic Afrikaans. Later, Afrikaans, now written with the Latin script, started to appear in newspapers and political and religious works in around 1850.\n\nIn 1875, a group of Afrikaans-speakers from the Cape formed the ' (\"Society for Real Afrikaners\"), and published a number of books in Afrikaans including grammars, dictionaries, religious materials and histories. In 1925, Afrikaans was recognised by the South African government as a real language, rather than simply a slang version of Dutch proper.\n\nRecognition\n\nAfrikaans was considered a Dutch dialect in South Africa until the early 20th century, when it became recognised as a distinct language under South African law, alongside Standard Dutch, which it eventually replaced as an official language.\n\nBefore the Boer Wars (1880–81 and 1899–1902), \"and indeed for some time afterwards, Afrikaans was regarded as inappropriate for educated discourse.  Rather, Afrikaans was described derogatorily as ‘a kitchen language’ or as ‘a bastard jargon', suitable for communication mainly between the Boers and their servants.\"  23 years after the Second Boer War ended in 1902, mostly due to the efforts of the Afrikans Language Movement  on 8 May 1925, the Official Languages of the Union Act No 8 of 1925 was passed at a joint sitting of the House of Assembly and the Senate, in which 'Dutch' was \"declared to include Afrikaans\".  The Constitution of 1961 reversed the position of Afrikaans and Dutch, so that English and Afrikaans were the official languages and Afrikaans was deemed to include Dutch. The Constitution of 1983 removed any mention of Dutch altogether.\n\nMonument\n\nThe Afrikaans Language Monument (') is located on a hill overlooking Paarl, Western Cape Province, South Africa. Officially opened on 10 October 1975, it commemorates the 50th anniversary of Afrikaans being declared an official language of South Africa in distinction to Dutch.  It was erected in Paarl on the 100th anniversary of the founding of the ' (Society of Real Afrikaners), an organisation which helped to strengthen Afrikaners' identity and pride in their language.\n\nStandardisation\n\nThe linguist Paul Roberge suggested the earliest 'truly Afrikaans' texts are doggerel verse from 1795 and a dialogue transcribed by a Dutch traveller in 1825. Printed material among the Afrikaners at first used only standard European Dutch. By the mid-19th century, more and more were appearing in Afrikaans, which was very much still regarded as a set of regional dialects.\n\nIn 1861, L.H. Meurant published his ' (\"Conversation between Claus Truthsayer and John Doubter\"), which is considered by some to be the first authoritative Afrikaans text.  Abu Bakr Effendi also compiled his Arabic Afrikaans Islamic instruction book between 1862 and 1869, although this was only published and printed in 1877. The first Afrikaans grammars and dictionaries were published in 1875 by the ' (\"Society for Real Afrikaners\") in Cape Town.\n\nThe main Afrikaans dictionary is the ' (WAT) (Dictionary of the Afrikaans Language), which is as yet incomplete owing to the scale of the project, but the one-volume dictionary in household use is the ' (HAT). The official orthography of Afrikaans is the ', compiled by .\n\nThe Afrikaans Bible\n\nThe Afrikaner religion had stemmed from the Protestant practices of the Reformed church of Holland during the 17th century, later on being influenced in South Africa by British ministries during the 1800s . A major landmark in the development of the language was the translation of the whole Bible into Afrikaans. Before this, most Cape Dutch-Afrikaans speakers had to rely on the Dutch . This  had its origins with the Synod of Dordrecht of 1618 and was thus in an archaic form of Dutch. This was hard for Dutch and Cape Dutch speakers to understand, and increasingly unintelligible for Afrikaans speakers.\n\nC. P. Hoogehout, Arnoldus Pannevis, and Stephanus Jacobus du Toit were the first Afrikaans Bible translators. Important landmarks in the translation of the Scriptures were in 1878 with C. P. Hoogehout's translation of the ' (Gospel of Mark, lit. Gospel according to Mark); however, this translation was never published. The manuscript is to be found in the South African National Library, Cape Town.\n\nThe first official translation of the entire Bible into Afrikaans was in 1933 by J. D. du Toit, E. E. van Rooyen, J. D. Kestell, H. C. M. Fourie, and BB Keet. This monumental work established Afrikaans as ', that is \"a pure and proper language\" for religious purposes, especially amongst the deeply Calvinist Afrikaans religious community that previously had been sceptical of a Bible translation that varied from the Dutch version that they were used to.\n\nIn 1983, a fresh translation marked the 50th anniversary of the 1933 version and provided a much-needed revision. The final editing of this edition was done by E. P. Groenewald, A. H. van Zyl, P. A. Verhoef, J. L. Helberg and W. Kempen.\n\nClassification\n\n* Indo-European languages\n** Germanic\n*** West Germanic\n**** Low Franconian\n***** Dutch\n****** Afrikaans, Dutch-based creoles\n\nAfrikaans belongs to its own West Germanic sub-group, the Low Franconian languages. Its closest relative is the mutually-intelligible mother language, Dutch language. Other West Germanic languages related to Afrikaans are German, English and the Frisian languages and the unstandardised languages Low German and Yiddish.\n\nGeographic distribution\n\nStatistics\n\nSociolinguistics\n\nSome state that instead of Afrikaners, which refers to an ethnic group, the terms ' or ' (lit. Afrikaans speakers) should be used for people of any ethnic origin who speak Afrikaans. Linguistic identity has not yet established which terms shall prevail, and all three are used in common parlance. The white Afrikaans-speaking community started being referred to colloquially as \"The Boere\".  The terms ' (farm boy) and ' (farm girl) became popular among young white Afrikaners for expressing national pride, regardless of whether or not they actually grew up on a farm.\n\nAfrikaans is also widely spoken in Namibia. Before independence, Afrikaans had equal status with German as an official language. Since independence in 1990, Afrikaans has had constitutional recognition as a national, but not official, language. There is a much smaller number of Afrikaans speakers among Zimbabwe's white minority, as most have left the country since 1980. Afrikaans was also a medium of instruction for schools in Bophuthatswana, an Apartheid-era Bantustan.\n\nMany South Africans living and working in Belgium, the Netherlands, the United Kingdom, Republic of Ireland, Australia, New Zealand, Canada, the United States, the UAE and Kuwait are also Afrikaans-speaking. They have access to Afrikaans websites, news sites such as [http://www.netwerk24.com/ Netwerk24.com] and [http://www.sake24.com/ Sake24], and radio broadcasts over the web, such as those from Radio Sonder Grense, Bokradio and Radio Pretoria.\n\nAfrikaans has been influential in the development of South African English. Many Afrikaans loanwords have found their way into South African English, such as ' (\"pickup truck\"), ' (\"barbecue\"), ' (\"tangerine\"), ' (American \"sneakers\", British \"trainers\", Canadian \"runners\"). A few words in standard English are derived from Afrikaans, such as aardvark (lit. \"earth pig\"), trek (\"pioneering journey\", in Afrikaans lit. \"pull\" but used also for \"migrate\"), spoor (\"animal track\"), ' (\"Southern African grassland\" in Afrikaans, lit. \"field\"), commando from Afrikaans ' meaning small fighting unit, ' (\"tree snake\") and ' (\"segregation\"; more accurately \"apartness\" or \"the state or condition of being apart\").\n\nIn 1976, secondary-school pupils in Soweto began a rebellion in response to the government's decision that Afrikaans be used as the language of instruction for half the subjects taught in non-White schools (with English continuing for the other half). Although English is the mother tongue of only 8.2% of the population, it is the language most widely understood, and the second language of a majority of South Africans.[http://www.sagoodnews.co.za/public_sector/govt_info_available_online_in_all_official_languages.html Govt info available online in all official languages – South Africa – The Good News] . Afrikaans is more widely spoken than English in the Northern and Western Cape provinces, several hundred kilometres from Soweto.Black Linguistics: Language, Society and Politics in Africa and the Americas, by Sinfree Makoni, p. 120S.\n\nThe Black community's opposition to Afrikaans and preference for continuing English instruction was underlined when the government rescinded the policy one month after the uprising: 96% of Black schools chose English (over Afrikaans or native languages) as the language of instruction. Also, due to Afrikaans being viewed as the language of the white oppressor by some, pressure has been increased to remove Afrikaans as a teaching language in South African universities, resulting in bloody student protests in 2015.\n\nUnder South Africa's Constitution of 1996, Afrikaans remains an official language, and has equal status to English and nine other languages. The new policy means that the use of Afrikaans is now often reduced in favour of English, or to accommodate the other official languages. In 1996, for example, the South African Broadcasting Corporation reduced the amount of television airtime in Afrikaans, while South African Airways dropped its Afrikaans name ' from its livery. Similarly, South Africa's diplomatic missions overseas now only display the name of the country in English and their host country's language, and not in Afrikaans.\n\nIn spite of these moves, the language has remained strong, and Afrikaans newspapers and magazines continue to have large circulation figures. Indeed, the Afrikaans-language general-interest family magazine ' has the largest readership of any magazine in the country. In addition, a pay-TV channel in Afrikaans called KykNet was launched in 1999, and an Afrikaans music channel, MK (') (lit. 'Music Channel'), in 2005. A large number of Afrikaans books are still published every year, mainly by the publishers Human & Rousseau, , , and . The Afrikaans film trilogy ' (first released in 2008) caused a reawakening of the Afrikaans film Industry (which has been dead since the mid to late 1990s) and Belgian-born singer Karen Zoid's debut single \"\" (released 2001) caused a resurgence in the Afrikaans music industry as well as gave rise to the Afrikaans Rock genre.\n\nAfrikaans has two monuments erected in its honour. The first was erected in , South Africa, in 1893, and the second, nowadays better-known Afrikaans Language Monument ('), was built in Paarl, South Africa, in 1975.\n\nWhen the British design magazine Wallpaper described Afrikaans as \"one of the world's ugliest languages\" in its September 2005 article about the monument,[https://web.archive.org/web/20060216042054/http://business.iafrica.com/news/657706.htm Rupert snubs mag over Afrikaans slur], Business Africa, 5 December 2005. South African billionaire Johann Rupert (chairman of the Richemont Group), responded by withdrawing advertising for brands such as Cartier, Van Cleef & Arpels, Montblanc and Alfred Dunhill from the magazine.[http://www.iol.co.za/news/south-africa/afrikaans-stars-join-row-over-ugly-language-1.261058 Afrikaans stars join row over 'ugly language'] Cape Argus, 10 December 2005. The author of the article, Bronwyn Davies, was an English-speaking South African.\n\nModern Dutch and Afrikaans share over 90 percent of their vocabulary. Afrikaans speakers are able to learn Dutch within a comparatively short time. Native Dutch speakers pick up written Afrikaans even more quickly, due to its simplified grammar, whereas understanding spoken Afrikaans might need more effort. Afrikaans speakers can learn Dutch pronunciation with little training. This has enabled Dutch and Belgian companies to outsource their call centre operations to South Africa.[http://www.eprop.co.za/news/item/4489-SA-holds-its-own-in-global-call-centre-industry.html \"SA holds its own in global call centre industry\"], eProp Commercial Property News in South Africa.\n\nCurrent status\n\nPost-apartheid South Africa has seen a loss of preferential treatment by the government for Afrikaans, in terms of education, social events, media (TV and radio), and general status throughout the country, given that it now shares its place as official language with ten other languages. Nevertheless, Afrikaans remains more prevalent in the media – radio, newspapers and televisionOranje FM, Radio Sonder Grense, Jacaranda FM, Radio Pretoria, Rapport, Beeld, Die Burger, Die Son, Afrikaans news is run everyday; the PRAAG website is a web-based news service. On pay channels it is provided as second language on all sports, Kyknet – than any of the other official languages, except English. More than 300 book titles in Afrikaans are published annually. South African census figures suggest a growing number of speakers in all nine provinces, a total of 6.85 million in 2011 compared to 5.98 million a decade earlier. The South African Institute of Race Relations (SAIRR) project that a growing majority will be Coloured Afrikaans speakers. Afrikaans speakers experience higher employment rates than other South African language groups, though half a million remain unemployed.\n\nDespite the challenges of demotion and emigration that it faces in South Africa, the Afrikaans vernacular remains competitive, being popular in DSTV pay channels and several internet sites, while generating high newspaper and music CD sales. A resurgence in Afrikaans popular music since the late 1990s has invigorated the language, especially among a younger generation of South Africans. A recent trend is the increased availability of pre-school educational CDs and DVDs. Such media also prove popular with the extensive Afrikaans-speaking expatriate communities who seek to retain language proficiency in a household context.\n\nAfter years of slumber, Afrikaans language cinema is showing signs of new vigour. The 2007 film ', the first full-length Afrikaans movie since Paljas in 1998, is seen as the dawn of a new era in Afrikaans cinema. Several short films have been created and more feature-length movies, such as ' and ' (both in 2008) have been produced, besides the 2011 Afrikaans-language film ', which was the first Afrikaans film to screen at the Cannes Film Festival. The film ' was also released in 2011. The Afrikaans Film industry started gaining international recognition via the likes of big Afrikaans Hollywood film stars, like Charlize Theron (Monster) and Sharlto Copley (District 9) promoting their mother tongue.\n\nAfrikaans seems to be returning to the SABC. SABC3 announced early in 2009 that it would increase Afrikaans programming due to the \"growing Afrikaans-language market and [their] need for working capital as Afrikaans advertising is the only advertising that sells in the current South African television market\". In April 2009, SABC3 started screening several Afrikaans-language programmes.[http://www.screenafrica.com/news/industry/997616.htm SABC3 \"tests\" Afrikaans programming], Screen Africa, 15 April 2009 Further latent support for the language derives from its de-politicised image in the eyes of younger-generation South Africans, who less and less often view it as \"the language of the oppressor\". Indeed, there is a groundswell movement within Afrikaans to be inclusive, and to promote itself along with the other indigenous official languages. In Namibia, the percentage of Afrikaans speakers declined from 11.4% (2001 Census) to 10.4% (2011 Census). The major concentrations are in Hardap (41.0%), ǁKaras (36.1%), Erongo (20.5%), Khomas (18.5%), Omaheke (10.0%), Otjozondjupa (9.4%), Kunene (4.2%), and Oshikoto (2.3%).[http://www.nsa.org.na/files/downloads/Namibia%202011%20Population%20and%20Housing%20Census%20Main%20Report.pdf Namibia 2011 Population & Housing Census Main Report] \n\nAfrikaans is offered at many universities outside of South Africa including in the Netherlands, Belgium, German, Poland, Russia and America.http://www.afrikaans.com/news-headlines/het-jy.../afrikaans-floreer-in-die-buiteland\n\nDialects\n\nFollowing early dialectal studies of Afrikaans, it was theorised that three main historical dialects probably existed after the Great Trek in the 1830s. These dialects are the Northern Cape, Western Cape, and Eastern Cape dialects.They were named before the establishment of the current Western Cape, Eastern Cape, and Northern Cape provinces, and are not dialects of those provinces '. Northern Cape dialect may have resulted from contact between Dutch settlers and the Khoi-Khoi people between the Great Karoo and the Kunene, and Eastern Cape dialect between the Dutch and the Xhosa. Remnants of these dialects still remain in present-day Afrikaans, although the standardising effect of Standard Afrikaans has contributed to a great levelling of differences in modern times.\n\nThere is also a prison cant, known as  or , which is based on Afrikaans, yet heavily influenced by Zulu. This language is used as a secret language in prison and is taught to initiates.\n\n \n\nThe term ' (\"Cape Afrikaans\") is sometimes erroneously used to refer to the entire Western Cape dialect; it is more commonly used for a particular sociolect spoken in the Cape Peninsula of South Africa.  was once spoken by all population groups. However, it became increasingly restricted to the Cape Coloured ethnic group in Cape Town and environs.\n\n preserves some features more similar to Dutch than to Afrikaans.\n* The 1st person singular pronoun ' as in Dutch as opposed to Afrikaans '\n* The diminutive endings ', pronounced as in Dutch and not as as in Afrikaans.\n* The use of the form ' (compare Dutch ') as opposed to Afrikaans '\n\n has some other features not typically found in Afrikaans.\n* The pronunciation of ', normally as in Dutch is often a. This is the strongest feature of .\n* The insertion of after, and when followed by, e.g. ' as opposed to Afrikaans '.\n\n is also characterised by much code-switching between English and Afrikaans, especially in the inner-city and lower socio-economic status areas of Cape Town.\n\nAn example of characteristic :\n\n: : | \n: English (direct): | And I say to you, what seek you here by me? I seek you not! No, go now away!\nEnglish: And I'm telling you, what are you looking for here? I don't want you here! No, go away now!\n\n' \n\nThe term ' (\"Afrikaans of the Orange River\") is sometimes erroneously used to refer to the Northern Cape dialect; it is more commonly used for the regional peculiarities of standard Afrikaans spoken in the Upington/Orange River wine district of South Africa.\n\nSome of the characteristics of  are the plural form ' (Ma-, '), variant pronunciation such as in ' (\"Church\") and ' (\"money\") and the ending ', which indicates possession.\n\nExpatriate geolect \n\nAlthough Afrikaans is mainly spoken in South Africa and Namibia, smaller Afrikaans-speaking populations live in Argentina, Australia, Botswana, Brazil, Canada, Lesotho, Malawi, the Netherlands, New Zealand, Swaziland, the UAE, the United Kingdom, Republic of Ireland, the USA, Zambia, and Zimbabwe. Most Afrikaans-speaking people living outside Africa are emigrants and their descendants. Because of emigration and migrant labour, more than 100,000 Afrikaans speakers may live in the United Kingdom.\n\nInfluences on Afrikaans from other languages \n\nMalay \n\nDue to the early settlement of a Cape Malay community in Cape Town, who are now known as Coloureds, numerous Malay words were brought into Afrikaans. Some of these words entered Dutch via the Indonesian language as part of the colonial heritage. Malay words in Afrikaans include:\n*, which means 'very'/'much'/'many' (from ') is a very commonly used Afrikaans word, different from its Dutch equivalent ' or '.\n*, Afrikaans for jacket, where Dutch would use ' or '. The word ' in Dutch is now considered archaic and only used in written, literary texts.\n*, which means banana. This is different from the common Dutch word '. The Indonesian word ' is also used in Dutch, though usage is less common.\n\nPortuguese \n\nSome words originally came from Portuguese such as ' (\"umbrella\") from the Portuguese ', ' (\"pen/cattle enclosure\") from the Portuguese ', and ' (\"corn\", from '). These words have become common in South Africa to an extent of being used in many other South African languages. Some of these words also exist in Dutch, like ' \"parasol\", though usage is less common and meanings can slightly differ.\n\nKhoisan languages \n\n*, meaning cannabis\n*, meaning lizard, diminutive adapted from Khoekhoe word\n*, meaning insect, from the Khoisan xo-xo\n* blanket of animal hides\n* walking stick from Khoekhoe[https://books.google.com/books?id\nQ3tAqIU0dPsC&pgPA97&dq\nbantu+loanwords+afrikaans&hlen&sa\nX&ved0ahUKEwim0MLErvnQAhVJJsAKHR5rCGIQ6AEIfTAT#v\nonepage&q&f=true One Thousand Languages: Living, Endangered, and Lost], Peter Austin\nUniversity of California Press, 2008, page 97\n\nSome of these words also exist in Dutch, though with a more specific meaning: ' for example means \"South-African tribal javelin\" and ' means \"South-African tribal blanket of animal hides\".\n\nBantu languages \n\nLoanwords from Bantu languages in Afrikaans include the names of indigenous birds, such as ' and ', and indigenous plants, such as ' and '.[https://books.google.com/books?id\nHTzjAAAAMAAJ&dqbantu+loanwords+afrikaans&focus\nsearchwithinvolume&q=%22Bantu+loan-words+in+Afrikaans%22 Standard encyclopaedia of Southern Africa], Volume 1, D.J.. Potgieter, NASOU, 1970, page 111\n*, from the Zulu word ' meaning \"scholar\" or \"student\",[https://books.google.com/books?idsIDFHOQrYgoC&dq\numfundi%20zulu&pgPA87#v\nonepage&q&f=true A Zulu-Kafir Dictionary, Etymologically Explained ... Preceded by an Introduction on the Zulu-Kafir Language], Pike, 1857, page 87 but used to mean someone who is a student/expert on a certain subject, i.e. He is a language .\n*, meaning bride price, from (and referring to) lobolo of the Nguni languages\n*, the grey crowned crane, known in Latin as Balearica regulorum\n*, medium-sized dioecious tree known in Latin as Sclerocarya birrea\n*, species of thatching grass known as Hyparrhenia\n*, deciduous tree also known by its Latin name, Spirostachys africana\n* / , an adaption of the word ', meaning \"to go home\" or \"to knock off\".\n\nGrammar\n\nIn Afrikaans grammar, there is no distinction between the infinitive and present forms of verbs, with the exception of the verbs 'to be' and 'to have':\n\nIn addition, verbs do not conjugate differently depending on the subject. For example,\n\nOnly a handful of Afrikaans verbs have a preterite, namely the auxiliary ' (\"to be\"), the modal verbs, and the verb ' (\"to think\"). The preterite of ' (\"may\") is rare in contemporary Afrikaans.\n\nAll other verbs use the perfect tense (hê + past participle) for the past. Therefore, there is no distinction in Afrikaans between I drank and I have drunk. (Also in colloquial German, the past tense is often replaced with the perfect.)\n\nWhen telling a longer story, Afrikaans speakers usually avoid the perfect and simply use the present tense, or historical present tense instead (as is possible, but less common, in English as well).\n\nA particular feature of Afrikaans is its use of the double negative; it is classified in Afrikaans as ' and is something that is absent from the other West Germanic standard languages. For example,\n\n:  / '\nEnglish: He speaks no Afrikaans. / He can not speak Afrikaans. / He can't speak Afrikaans.\n: \n\nBoth French and San origins have been suggested for double negation in Afrikaans. While double negation is still found in Low Franconian dialects in West-Flanders and in some \"isolated\" villages in the centre of the Netherlands (such as Garderen), it takes a different form, which is not found in Afrikaans. The following is an example:\n\n* (lit. I want this not do not.)\n: English: I do not want to do this.\n* Compare with ', which changes the meaning to \"I want not to do this.\" Whereas ' emphasizes a lack of desire to act, ' emphasizes the act itself.\n\nThe ' was the Middle Dutch way to negate but it has been suggested that since ' became highly non-voiced, ' or ' was needed to complement the '. With time the ' disappeared in most Dutch dialects.\n\nThe double negative construction has been fully grammaticalised in standard Afrikaans and its proper use follows a set of fairly complex rules as the examples below show:\n\nA notable exception to this is the use of the negating grammar form that coincides with negating the English present participle. In this case there is only a single negation.\n\n: \nEnglish: He is in [the] hospital, though he eats not.\nCertain words in Afrikaans arise due to grammar. For example, ', which literally means \"must not\", usually becomes '; although one does not have to write or say it like this, virtually all Afrikaans speakers will change the two words to ' in the same way as do not shifts to don't in English.\n\nThe Dutch word ' (\"it\" in English) does not correspond to ' in Afrikaans. The Dutch words corresponding to Afrikaans ' are ', ', ' and '.\n\nPhonology\n\nVowels\n\n* As phonemes, and occur only in the words ' 'mirror' and ' 'bullet', which used to be pronounced with sequences and, respectively. In other cases, and occur as allophones of, respectively, and before.\n* is phonetically long before.\n* is always stressed and occurs only in the word ' 'wedges'.\n* The closest unrounded counterparts of are central, rather than front.\n* occur only in a few words.\n* As a phoneme, occurs only in some loanwords from English, such as ' 'pal', as well as in some words such as ' 'departure'. As an allophone of before, occurs dialectally, most commonly in the former Transvaal and Free State provinces.\n* As a phoneme, occurs only in some loanwords from English (such as ' 'grand'), as well as before in some words. also occurs as an allophone of before and the sequences.\n\n* occur mainly in loanwords.\n\nConsonants\n\n* All obstruents at the ends of words are devoiced, so that e.g. a final is realized as.\n* occur only in loanwords. is also an allophone of in some environments.\n* is most often uvular ~]}}. Only this source mentions the trilled realization. Velar occurs only in some speakers.\n* is usually an alveolar trill or tap. In some parts of the former Cape Province, it is realized uvularly, either as a trill or a fricative.\n\nOrthography\n\nThere are many parallels to the Dutch orthography conventions and those used for Afrikaans. There are 26 letters.\n\nIn Afrikaans, many consonants are dropped from the earlier Dutch spelling. For example, ' ('only') in Dutch becomes ' in Afrikaans. Also, Afrikaans and some Dutch dialects make no distinction between and, having merged the latter into the former; while the word for \"south\" is written ' in Dutch, it is spelled ' in Afrikaans (as well as dialectal Dutch writings) to represent this merger. Similarly, the Dutch digraph ', normally pronounced as, is written as ', except where it replaces the Dutch suffix ' which is pronounced as or, as in  > .\n\nAnother difference is the indefinite article, ' in Afrikaans and  in Dutch. \"A book\" is ' in Afrikaans, whereas it is either ' or ' in Dutch. This ' is usually pronounced as just a weak vowel,.\n\nThe diminutive suffix in Afrikaans is ', whereas in Dutch it is ', hence a \"bit\" is  in Afrikaans and  in Dutch.\n\nThe letters c, q, x, and z occur almost exclusively in borrowings from French, English, Greek and Latin. This is usually because words that had c and ch in the original Dutch are spelled with k and g, respectively, in Afrikaans. Similarly original qu and x are spelt kw and ks, respectively. For example, ' instead of equatoriaal, and ' instead of excuus.\n\nThe vowels with diacritics in non-loanword Afrikaans are: á, é, è, ê, ë, í, î, ï, ó, ô, ú, û, ý. Diacritics are ignored when alphabetising, though they are still important, even when typing the diacritic forms may be difficult. For example, ' instead of the 3 e's alongside each other: *, which can never occur in Afrikaans, or ', which translates to \"say\", whereas ' is a possessive form.\n\nInitial apostrophes\n\nA few short words in Afrikaans take initial apostrophes. In modern Afrikaans, these words are always written in lower case (except if the entire line is uppercase), and if they occur at the beginning of a sentence, the next word is capitalised. Three examples of such apostrophed words are '. The last (the indefinite article) is the only apostrophed word that is common in modern written Afrikaans, since the other examples are shortened versions of other words (' and ', respectively) and are rarely found outside of a poetic context.\n\nHere are a few examples:\n\nThe apostrophe and the following letter are regarded as two separate characters, and are never written using a single glyph, although a single character variant of the indefinite article appears in Unicode, .\n\nTable of characters\n\nFor more on the pronunciation of the letters below, see Help:IPA/Afrikaans.\n\nAfrikaans phrases\n\nAlthough there are many different dialects and accents, the transcription would be fairly standard.\n\nIn the Dutch language the word ' means African, in the general sense. Consequently, Afrikaans is commonly denoted as '. This ambiguity also exists in Afrikaans itself and is either resolved in the context of its usage, or by using ' for an African person, and ' in the adjective sense.\n\nA handful of Afrikaans words are exactly the same as in English. The following Afrikaans sentences, for example, are exactly the same in the two languages, in terms of both their meaning and spelling; only their pronunciation differs.\n* \n* \n\nSample text\n\nPsalm 23 1983 translation:\n\nDie Here is my Herder, ek kom niks kort nie.\nHy laat my in groen weivelde rus. Hy bring my by waters waar daar vrede is.\nHy gee my nuwe krag. Hy lei my op die regte paaie tot eer van Sy naam.\nSelfs al gaan ek deur donker dieptes, sal ek nie bang wees nie, want U is by my. In U hande is ek veilig.\n\nPsalm 23 alternative translation:\n\nDie Here is my Herder, niks sal my ontbreek nie.\nHy laat my neerlê in groen weivelde; na waters waar rus is, lei Hy my heen.\nHy verkwik my siel; Hy lei my in die spore van geregtigheid, om sy Naam ontwil.\nAl gaan ek ook in 'n dal van doodskaduwee, ek sal geen onheil vrees nie; want U is met my: u stok en u staf die vertroos my.\n\nLord's Prayer (Afrikaans New Living translation)\n\nOns Vader in die hemel, laat U Naam geheilig word.\nLaat U koningsheerskappy spoedig kom.\nLaat U wil hier op aarde uitgevoer word soos in die hemel.\nGee ons die porsie brood wat ons vir vandag nodig het.\nEn vergeef ons ons sondeskuld soos ons ook óns skuldenaars vergewe het.\nBewaar ons sodat ons nie aan verleiding sal toegee nie; en bevry ons van die greep van die Bose.\nWant van U is die koninkryk,\nen die krag,\nen die heerlikheid,\ntot in ewigheid. Amen\n\nLord's Prayer (Original translation):\n\nOnse Vader wat in die hemel is,\nlaat U Naam geheilig word;\nlaat U koninkryk kom;\nlaat U wil geskied op die aarde,\nnet soos in die hemel.\nGee ons vandag ons daaglikse brood;\nen vergeef ons ons skulde\nsoos ons ons skuldenaars vergewe\nen laat ons nie in die versoeking nie\nmaar verlos ons van die Bose\nWant aan U behoort die koninkryk\nen die krag\nen die heerlikheid\ntot in ewigheid. Amen. Afrikaans. http://en.wikipedia.org/?curid=2162."
  }
}
