{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1438",
  "eid" : "b9e1c470-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778391607,
  "textBody" : "Absalom or Avshalom () according to the Hebrew Bible was the third son of David, King of Israel with Maacah, daughter of Talmai, King of Geshur., .\n\n describes him as the most handsome man in the kingdom. Absalom eventually rebelled against his father and was killed during the Battle of Ephraim's Wood.\n\nBackground\n\nAbsalom, David's third son, by Maacah, was born in Hebron. He moved at an early age along with the transfer of the capital to Jerusalem, where he spent most of his life. He was a great favorite of his father, and of the people. His charming manners, personal beauty, insinuating ways, love of pomp, and royal pretensions, captivated the hearts of the people from the beginning. He lived in great style, drove in a magnificent chariot, and had fifty men run before him.\n\nLittle is known of Absalom's family life; but the biblical narrative states that he had three sons and one daughter, whose name was also Tamar. From the language of , \"I have no son to keep my name in remembrance\", it is inferred that his sons died at an early age.[http://biblehub.com/commentaries/cambridge/2_samuel/18.htm Cambridge Bible for Schools and Colleges] on 2 Samuel 18, accessed 6 August 2017\n\n says that Absalom had another daughter or granddaughter named Maacah, who later became the favorite wife of Rehoboam.\n. A [https://www.biblegateway.com/passage/?search2%20Chronicles%2011:19-21&version\nNKJV#fen-NKJV-11435a footnote in the New King James Version] reads \"Literally daughter, but in the broader sense of granddaughter\"\n\nMurder of Amnon\n\nAbsalom's sister Tamar was raped by Amnon, who was their half-brother. Amnon was also David's eldest son. After the rape, Absalom waited two years, and then avenged Tamar by sending his servants to murder a drunken Amnon at a feast, to which Absalom had invited all the king's sons ().\n\nAfter this murder Absalom fled to Talmai, who was the king of Geshur and Absalom's maternal grandfather (see also  or ). It was not until three years later that Absalom was fully reinstated in his father's favour and finally returned to Jerusalem (see Joab).\n\nThe revolt at Hebron\n\nWhile at Jerusalem, Absalom built support for himself by speaking to those who came to King David for justice, saying, “See, your claims are good and right; but there is no one deputed by the king to hear you\", perhaps reflecting flaws in the judicial system of the United Monarchy. \"If only I were the judge of the land! Then all who had a suit or cause might come to me, and I would give them justice.\" He made gestures of humility by kissing those who bowed before him instead of accepting supplication. He \"stole the hearts of the people of Israel\".\n\nAfter four years he declared himself king, raised a revolt at Hebron, the former capital, and slept with his father's concubines. All Israel and Judah flocked to him, and David, attended only by the Cherethites and Pelethites and his former bodyguard, which had followed him from Gath, found it expedient to flee. The priests Zadok and Abiathar remained in Jerusalem, and their sons Jonathan and Ahimaaz served as David's spies. Absalom reached the capital and consulted with the renowned Ahithophel (sometimes spelled Achitophel).\n\nDavid took refuge from Absalom's forces beyond the Jordan River. However, he took the precaution of instructing a servant, Hushai, to infiltrate Absalom's court and subvert it. Hushai convinced Absalom to ignore Ahithophel's advice to attack his father while he was on the run, and instead to prepare his forces for a major attack. This gave David critical time to prepare his own troops for the coming battle.\n\nThe Battle of Ephraim's Wood\n\nA fateful battle was fought in the Wood of Ephraim (the name suggests a locality west of the Jordan) and Absalom's army was completely routed. Absalom's head was caught in the boughs of an oak tree as the mule he was riding ran beneath it. He was discovered there still alive by one of David's men, who reported this to Joab, the king's commander. Joab, accustomed to avenging himself, took this opportunity to even the score with Absalom. Absalom once had Joab's field set on fire  and then made Amasa Captain of the Host instead of Joab. Killing Absalom was against David's explicit command, \"Beware that none touch the young man Absalom\". Joab killed Absalom with three darts through the heart.\n\nWhen David heard that Absalom was killed, although not how he was killed, he greatly sorrowed.\nO my son Absalom, my son, my son Absalom! Would God I had died for thee, O Absalom, my son, my son! \nDavid withdrew to the city (Mahanaim) See  in mourning, until Joab roused him from \"the extravagance of his grief\" [http://biblehub.com/commentaries/cambridge/2_samuel/19.htm Cambridge Bible for Schools and Colleges] on 2 Samuel 19, accessed 12 August 2017 and called on him to fulfil his duty to his people.\n\nMemorial to Absalom\n\nAbsalom had erected a monument near Jerusalem to perpetuate his name:\n\nNow Absalom in his lifetime had taken and reared up for himself a pillar, which is in the king's dale: for he said, I have no son to keep my name in remembrance: and he called the pillar after his own name: and it is called unto this day, Absalom's place.\n\nAn ancient monument in the Kidron Valley near the Old City of Jerusalem, known as the Tomb of Absalom or Absalom's Pillar and traditionally identified as the monument of the biblical narrative, is now dated by modern archeologists to the first century AD.\n\nAbsalom in art\n\nPoetry\n\n* Absalom and Achitophel (1681) is a landmark poetic political satire by John Dryden, using the Biblical story as a metaphor for the politics of the poet's own time.\n* \"Absaloms Abfall\" by Rainer Maria Rilke (\"The Fall of Absalom\", trans. Stephen Cohn).\n* \"Absalom\" is a section in Muriel Rukeyser's long poem The Book of the Dead (1938), spoken by a mother who lost three sons to silicosis\n* \"Avshalom\" by Yona Wallach, published in her first poetry collection Devarim (1966).\n* \"Convito di Assalonne\" by Niccolo Tornioli, 17th Century.https://commons.wikimedia.org/wiki/File:Convito_di_Assalonne_-_Tornioli.png\n* Jon Silkin refers to \"My sons, my Absoloms\"—presumably a misspelling of Absalom—in \"The Poem\", from his 2002 (posthumous) collection Making a Republic.\n\nFiction\n\n* Georg Christian Lehms, Des israelitischen Printzens Absolons und seiner Prinzcessin Schwester Thamar Staats- Lebens- und Helden-Geschichte (The Heroic Life and History of the Israelite Prince Absolom and his Princess Sister Tamar), novel in German published in Nuremberg, 1710.\n* Absalom, Absalom! is a novel by William Faulkner, and refers to the return of Thomas Sutpen's son.\n* Oh Absalom! was the original title of Howard Spring's novel My Son, My Son!, later adapted for the film of the latter name.\n* Cry, the Beloved Country by Alan Paton. Absalom was the name of Stephen Kumalo's son in the novel. Like the historical Absalom, Absalom Kumalo was at odds with his father, the two fighting a moral and ethical battle of sorts over the course of some of the novel's most important events. Absalom kills and murders a man, and also meets an untimely death.\n* Ender's Shadow references the story of Absalom and King David's lament. Bean, as he sends his soldiers on a suicide mission to destroy the Buggers, says to them, \"O my son Absalom. My son, my son Absalom. Would God I could die for thee, O Absalom, my son. My sons!\"\n* The character of Absalom appears in Susanna Clarke's Jonathan Strange & Mr. Norrell.\n* Throughout Robertson Davies's The Manticore a comparison is repeatedly made between the protagonist's problematic relations with his father and those of between the Biblical Absalom and King David. Paradoxically, in the modern version, it is the rebellious son who has the first name \"David\". The book also introduces the term \"Absalonism\", as a generic term for a son's rebellion against his father.\n* The character of Absalom appears in Michael Cook's The Head Guts and Sound Bone Dance.\n* Absalom appears as a prominent character in Peter Shaffer's play Yonadab, which portrays Amnon's rape of Tamar and his murder at Absalom's hands.\n* Absalom is a character in Michael Crummey's Newfoundland-set Galore.\n* Absalom's attempted coup against his father David is explored in the novel Zoheleth by J Francis Hudson (Lion Publishing 1994).\n* In Death of a Hero by Richard Aldington, the narrator adapts the famous quote \"O my son Absalom. My son, my son Absalom.\" During a discussion on the nature of war as the protagonist rides the train towards the WWI front lines.\n* A scene in the Swedish writer Frans G. Bengtsson's historical novel \"The Long Ships\" depicts a 10th Century Christian missionary recounting the story of Absalom's rebellion to the assembled Danish court, including the aging King Harald Bluetooth and his son Sweyn Forkbeard; thereupon, King Harald exclaims \"Some people can learn a lesson from this story!\", casting a meaningful glance at his son Sweyn—whom the King (rightly) suspects of plotting a rebellion.\n\nMusic\n\n* Josquin des Prez composed the motet \"Absalon, fili mi\" on the occasion of the death of Juan Borgia.\n* Leonard Cohen's poem \"Prayer for Sunset\" compares the setting sun to the raving Absalom, and asks whether another Joab will arrive tomorrow night to kill Absalom again.\n* Heinrich Schütz (1585–1672) composed \"Fili mi, Absalon\" as part of his Sinfoniae Sacrae, op. 6.\n* The single verse, 2 Samuel 18:33, regarding David's grief at the loss of his son (\"And the king was much moved, and went up to the chamber over the gate, and wept: and as he went, thus he said, O my son Absalom, my son, my son Absalom! would God I had died for thee, O Absalom, my son, my son!\"), is the inspiration for the text of several pieces of choral music, usually entitled When David Heard (such as those by Renaissance composers Thomas Tomkins and Thomas Weelkes, or modern composers Eric Whitacre, Joshua Shank, and Norman Dinerstein). This verse is also used in \"David's Lamentation\" by William Billings, first published in 1778.\n* \"Absalom, Absalom\" is a song on the 1996 Compass CD Making Light of It by singer/songwriter Pierce Pettis, incorporating several elements of the biblical narrative.\n* The Australian composer Nigel Butterley set the verse in his 2008 choral work \"Beni Avshalom\", commissioned by the Sydney Chamber Choir\n* During the finale of the song \"Distant Early Warning\" by Canadian band Rush, Geddy Lee sings, \"Absalom Absalom Absalom\"; lyrics written by drummer Neil Peart.\n* David Olney's 2000 CD Omar's Blues includes the song \"Absalom.\" The song depicts David grieving over the death of his son.\n* The story of Absalom is referred to several places in folk singer Adam Arcuragi's song \"Always Almost Crying\".\n* The San Francisco-based band Om mentions Absalom in their song \"Kapila's Theme\" from their debut album Variations on a Theme.\n* The garage folk band David's Doldrums references Absalom in their song, \"My Name Is Absalom\". The song alludes to Absalom's feelings of solemnity and abandonment of love and hope.\n* In \"Every Kind Word\" by Lackthereof, Danny Seim's project parallel to Menomena, Seim sings \"...and your hair is long like Absalom.\"\n* \"Barach Hamelech\" an Israeli song by Amos Etinger and Yosef Hadar.\n* The grindcore band Discordance Axis references Absalom at the end of the track entitled \"Castration Rite\".\n* The Progressive Metal band from Barranquilla, Colombia, Absalom has his name.\n* In 2007 Ryland Angel released \"Absalom\" on Ryland Angel-Manhattan Records.\n* \"Hanging By His Hair\" from the 1998 WORMWOOD album by The Residents recounts Absalom's defiance and death. Also performed on Roadworms (The Berlin Sessions) and Wormwood Live.\n* \"Absalom\" is a song on Brand New Shadows's debut album, White Flags. It is a mournful lament from King David's perspective.\n* \"Absalom\" is an album by the Experimental/Progressive band \"Stick Men\" featuring Tony Levin, Markus Reuter and Pat Mastelotto.\n* The American Rock band Little Feat reference Absalom in their song \"Gimme a Stone\" on the album entitled Chinese Work Songs. This song is written from the perspective of King David—mainly focusing on the task of fighting Goliath—but contains a lament to Absalom.\n\nVideo games\n\n* In Darksiders II, Absalom was the leader of an Old Race known as the Nephilim. When Mankind was given the prize of Eden, Absalom led his armies against Heaven and Hell in an attempt to steal it back. He is the main antagonist of Darksiders 2.\n* One of Willie Trombone's letters in The Neverhood reads, \"Hang me from a tree by my hoop so I can play 'Absalom'\".\n* In Fallout 4, the player character can stumble upon a dangerous lone sniper named Absalom who will immediately attack on sight. On death, Absalom may say \"Well, that's never happened before.\"\n\nAs a name\n\n\"Avshalom\" (אבשלום) is commonly used as a male first name in contemporary Israel. Other variants, used either as a first name or a surname, include \"Absalom\", \"Absolon\", \"Avessalom\", \"Avesalom\", \"Absalon\", and \"Absolom\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Absalom" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1438" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Absalom or Avshalom () according to the Hebrew Bible was the third son of David, King of Israel with Maacah, daughter of Talmai, King of Geshur., .\n\n describes him as the most handsome man in the kingdom. Absalom eventually rebelled against his father and was killed during the Battle of Ephraim's Wood.\n\nBackground\n\nAbsalom, David's third son, by Maacah, was born in Hebron. He moved at an early age along with the transfer of the capital to Jerusalem, where he spent most of his life. He was a great favorite of his father, and of the people. His charming manners, personal beauty, insinuating ways, love of pomp, and royal pretensions, captivated the hearts of the people from the beginning. He lived in great style, drove in a magnificent chariot, and had fifty men run before him.\n\nLittle is known of Absalom's family life; but the biblical narrative states that he had three sons and one daughter, whose name was also Tamar. From the language of , \"I have no son to keep my name in remembrance\", it is inferred that his sons died at an early age.[http://biblehub.com/commentaries/cambridge/2_samuel/18.htm Cambridge Bible for Schools and Colleges] on 2 Samuel 18, accessed 6 August 2017\n\n says that Absalom had another daughter or granddaughter named Maacah, who later became the favorite wife of Rehoboam.\n. A [https://www.biblegateway.com/passage/?search2%20Chronicles%2011:19-21&version\nNKJV#fen-NKJV-11435a footnote in the New King James Version] reads \"Literally daughter, but in the broader sense of granddaughter\"\n\nMurder of Amnon\n\nAbsalom's sister Tamar was raped by Amnon, who was their half-brother. Amnon was also David's eldest son. After the rape, Absalom waited two years, and then avenged Tamar by sending his servants to murder a drunken Amnon at a feast, to which Absalom had invited all the king's sons ().\n\nAfter this murder Absalom fled to Talmai, who was the king of Geshur and Absalom's maternal grandfather (see also  or ). It was not until three years later that Absalom was fully reinstated in his father's favour and finally returned to Jerusalem (see Joab).\n\nThe revolt at Hebron\n\nWhile at Jerusalem, Absalom built support for himself by speaking to those who came to King David for justice, saying, “See, your claims are good and right; but there is no one deputed by the king to hear you\", perhaps reflecting flaws in the judicial system of the United Monarchy. \"If only I were the judge of the land! Then all who had a suit or cause might come to me, and I would give them justice.\" He made gestures of humility by kissing those who bowed before him instead of accepting supplication. He \"stole the hearts of the people of Israel\".\n\nAfter four years he declared himself king, raised a revolt at Hebron, the former capital, and slept with his father's concubines. All Israel and Judah flocked to him, and David, attended only by the Cherethites and Pelethites and his former bodyguard, which had followed him from Gath, found it expedient to flee. The priests Zadok and Abiathar remained in Jerusalem, and their sons Jonathan and Ahimaaz served as David's spies. Absalom reached the capital and consulted with the renowned Ahithophel (sometimes spelled Achitophel).\n\nDavid took refuge from Absalom's forces beyond the Jordan River. However, he took the precaution of instructing a servant, Hushai, to infiltrate Absalom's court and subvert it. Hushai convinced Absalom to ignore Ahithophel's advice to attack his father while he was on the run, and instead to prepare his forces for a major attack. This gave David critical time to prepare his own troops for the coming battle.\n\nThe Battle of Ephraim's Wood\n\nA fateful battle was fought in the Wood of Ephraim (the name suggests a locality west of the Jordan) and Absalom's army was completely routed. Absalom's head was caught in the boughs of an oak tree as the mule he was riding ran beneath it. He was discovered there still alive by one of David's men, who reported this to Joab, the king's commander. Joab, accustomed to avenging himself, took this opportunity to even the score with Absalom. Absalom once had Joab's field set on fire  and then made Amasa Captain of the Host instead of Joab. Killing Absalom was against David's explicit command, \"Beware that none touch the young man Absalom\". Joab killed Absalom with three darts through the heart.\n\nWhen David heard that Absalom was killed, although not how he was killed, he greatly sorrowed.\nO my son Absalom, my son, my son Absalom! Would God I had died for thee, O Absalom, my son, my son! \nDavid withdrew to the city (Mahanaim) See  in mourning, until Joab roused him from \"the extravagance of his grief\" [http://biblehub.com/commentaries/cambridge/2_samuel/19.htm Cambridge Bible for Schools and Colleges] on 2 Samuel 19, accessed 12 August 2017 and called on him to fulfil his duty to his people.\n\nMemorial to Absalom\n\nAbsalom had erected a monument near Jerusalem to perpetuate his name:\n\nNow Absalom in his lifetime had taken and reared up for himself a pillar, which is in the king's dale: for he said, I have no son to keep my name in remembrance: and he called the pillar after his own name: and it is called unto this day, Absalom's place.\n\nAn ancient monument in the Kidron Valley near the Old City of Jerusalem, known as the Tomb of Absalom or Absalom's Pillar and traditionally identified as the monument of the biblical narrative, is now dated by modern archeologists to the first century AD.\n\nAbsalom in art\n\nPoetry\n\n* Absalom and Achitophel (1681) is a landmark poetic political satire by John Dryden, using the Biblical story as a metaphor for the politics of the poet's own time.\n* \"Absaloms Abfall\" by Rainer Maria Rilke (\"The Fall of Absalom\", trans. Stephen Cohn).\n* \"Absalom\" is a section in Muriel Rukeyser's long poem The Book of the Dead (1938), spoken by a mother who lost three sons to silicosis\n* \"Avshalom\" by Yona Wallach, published in her first poetry collection Devarim (1966).\n* \"Convito di Assalonne\" by Niccolo Tornioli, 17th Century.https://commons.wikimedia.org/wiki/File:Convito_di_Assalonne_-_Tornioli.png\n* Jon Silkin refers to \"My sons, my Absoloms\"—presumably a misspelling of Absalom—in \"The Poem\", from his 2002 (posthumous) collection Making a Republic.\n\nFiction\n\n* Georg Christian Lehms, Des israelitischen Printzens Absolons und seiner Prinzcessin Schwester Thamar Staats- Lebens- und Helden-Geschichte (The Heroic Life and History of the Israelite Prince Absolom and his Princess Sister Tamar), novel in German published in Nuremberg, 1710.\n* Absalom, Absalom! is a novel by William Faulkner, and refers to the return of Thomas Sutpen's son.\n* Oh Absalom! was the original title of Howard Spring's novel My Son, My Son!, later adapted for the film of the latter name.\n* Cry, the Beloved Country by Alan Paton. Absalom was the name of Stephen Kumalo's son in the novel. Like the historical Absalom, Absalom Kumalo was at odds with his father, the two fighting a moral and ethical battle of sorts over the course of some of the novel's most important events. Absalom kills and murders a man, and also meets an untimely death.\n* Ender's Shadow references the story of Absalom and King David's lament. Bean, as he sends his soldiers on a suicide mission to destroy the Buggers, says to them, \"O my son Absalom. My son, my son Absalom. Would God I could die for thee, O Absalom, my son. My sons!\"\n* The character of Absalom appears in Susanna Clarke's Jonathan Strange & Mr. Norrell.\n* Throughout Robertson Davies's The Manticore a comparison is repeatedly made between the protagonist's problematic relations with his father and those of between the Biblical Absalom and King David. Paradoxically, in the modern version, it is the rebellious son who has the first name \"David\". The book also introduces the term \"Absalonism\", as a generic term for a son's rebellion against his father.\n* The character of Absalom appears in Michael Cook's The Head Guts and Sound Bone Dance.\n* Absalom appears as a prominent character in Peter Shaffer's play Yonadab, which portrays Amnon's rape of Tamar and his murder at Absalom's hands.\n* Absalom is a character in Michael Crummey's Newfoundland-set Galore.\n* Absalom's attempted coup against his father David is explored in the novel Zoheleth by J Francis Hudson (Lion Publishing 1994).\n* In Death of a Hero by Richard Aldington, the narrator adapts the famous quote \"O my son Absalom. My son, my son Absalom.\" During a discussion on the nature of war as the protagonist rides the train towards the WWI front lines.\n* A scene in the Swedish writer Frans G. Bengtsson's historical novel \"The Long Ships\" depicts a 10th Century Christian missionary recounting the story of Absalom's rebellion to the assembled Danish court, including the aging King Harald Bluetooth and his son Sweyn Forkbeard; thereupon, King Harald exclaims \"Some people can learn a lesson from this story!\", casting a meaningful glance at his son Sweyn—whom the King (rightly) suspects of plotting a rebellion.\n\nMusic\n\n* Josquin des Prez composed the motet \"Absalon, fili mi\" on the occasion of the death of Juan Borgia.\n* Leonard Cohen's poem \"Prayer for Sunset\" compares the setting sun to the raving Absalom, and asks whether another Joab will arrive tomorrow night to kill Absalom again.\n* Heinrich Schütz (1585–1672) composed \"Fili mi, Absalon\" as part of his Sinfoniae Sacrae, op. 6.\n* The single verse, 2 Samuel 18:33, regarding David's grief at the loss of his son (\"And the king was much moved, and went up to the chamber over the gate, and wept: and as he went, thus he said, O my son Absalom, my son, my son Absalom! would God I had died for thee, O Absalom, my son, my son!\"), is the inspiration for the text of several pieces of choral music, usually entitled When David Heard (such as those by Renaissance composers Thomas Tomkins and Thomas Weelkes, or modern composers Eric Whitacre, Joshua Shank, and Norman Dinerstein). This verse is also used in \"David's Lamentation\" by William Billings, first published in 1778.\n* \"Absalom, Absalom\" is a song on the 1996 Compass CD Making Light of It by singer/songwriter Pierce Pettis, incorporating several elements of the biblical narrative.\n* The Australian composer Nigel Butterley set the verse in his 2008 choral work \"Beni Avshalom\", commissioned by the Sydney Chamber Choir\n* During the finale of the song \"Distant Early Warning\" by Canadian band Rush, Geddy Lee sings, \"Absalom Absalom Absalom\"; lyrics written by drummer Neil Peart.\n* David Olney's 2000 CD Omar's Blues includes the song \"Absalom.\" The song depicts David grieving over the death of his son.\n* The story of Absalom is referred to several places in folk singer Adam Arcuragi's song \"Always Almost Crying\".\n* The San Francisco-based band Om mentions Absalom in their song \"Kapila's Theme\" from their debut album Variations on a Theme.\n* The garage folk band David's Doldrums references Absalom in their song, \"My Name Is Absalom\". The song alludes to Absalom's feelings of solemnity and abandonment of love and hope.\n* In \"Every Kind Word\" by Lackthereof, Danny Seim's project parallel to Menomena, Seim sings \"...and your hair is long like Absalom.\"\n* \"Barach Hamelech\" an Israeli song by Amos Etinger and Yosef Hadar.\n* The grindcore band Discordance Axis references Absalom at the end of the track entitled \"Castration Rite\".\n* The Progressive Metal band from Barranquilla, Colombia, Absalom has his name.\n* In 2007 Ryland Angel released \"Absalom\" on Ryland Angel-Manhattan Records.\n* \"Hanging By His Hair\" from the 1998 WORMWOOD album by The Residents recounts Absalom's defiance and death. Also performed on Roadworms (The Berlin Sessions) and Wormwood Live.\n* \"Absalom\" is a song on Brand New Shadows's debut album, White Flags. It is a mournful lament from King David's perspective.\n* \"Absalom\" is an album by the Experimental/Progressive band \"Stick Men\" featuring Tony Levin, Markus Reuter and Pat Mastelotto.\n* The American Rock band Little Feat reference Absalom in their song \"Gimme a Stone\" on the album entitled Chinese Work Songs. This song is written from the perspective of King David—mainly focusing on the task of fighting Goliath—but contains a lament to Absalom.\n\nVideo games\n\n* In Darksiders II, Absalom was the leader of an Old Race known as the Nephilim. When Mankind was given the prize of Eden, Absalom led his armies against Heaven and Hell in an attempt to steal it back. He is the main antagonist of Darksiders 2.\n* One of Willie Trombone's letters in The Neverhood reads, \"Hang me from a tree by my hoop so I can play 'Absalom'\".\n* In Fallout 4, the player character can stumble upon a dangerous lone sniper named Absalom who will immediately attack on sight. On death, Absalom may say \"Well, that's never happened before.\"\n\nAs a name\n\n\"Avshalom\" (אבשלום) is commonly used as a male first name in contemporary Israel. Other variants, used either as a first name or a surname, include \"Absalom\", \"Absolon\", \"Avessalom\", \"Avesalom\", \"Absalon\", and \"Absolom\". Absalom. http://en.wikipedia.org/?curid=1438."
  }
}
