{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11010",
  "eid" : "f9279510-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778497761,
  "textBody" : "Events\n\n* 362 – Athanasius returns to Alexandria.\n*1245 – Thomas, the first known Bishop of Finland, is granted resignation after confessing to torture and forgery.\n*1437 – James I of Scotland is assassinated.\n*1440 – The Prussian Confederation is formed.\n*1543 – Battle of Wayna Daga – A combined army of Ethiopian and Portuguese troops defeats a Muslim army led by Ahmed Gragn.\n*1613 – Mikhail I is unanimously elected Tsar by a national assembly, beginning the Romanov dynasty of Imperial Russia.\n*1797 – A force of 1,400 French soldiers invaded Britain at Fishguard in support of the Society of United Irishmen. They were defeated by 500 British reservists.\n*1804 – The first self-propelling steam locomotive makes its outing at the Pen-y-Darren Ironworks in Wales.\n*1808 – Without a previous declaration of war, Russian troops cross the border to Sweden at Abborfors in eastern Finland, thus beginning the Finnish War, in which Sweden will lose the eastern half of the country (i.e. Finland) to Russia.\n*1828 – Initial issue of the Cherokee Phoenix is the first periodical to use the Cherokee syllabary invented by Sequoyah.\n*1842 – John Greenough is granted the first U.S. patent for the sewing machine.\n*1848 – Karl Marx and Friedrich Engels publish The Communist Manifesto.\n*1862 – American Civil War: Battle of Valverde is fought near Fort Craig in New Mexico Territory.\n*1874 – The Oakland Daily Tribune publishes its first edition.\n*1878 – The first telephone directory is issued in New Haven, Connecticut.\n*1885 – The newly completed Washington Monument is dedicated.\n*1896 – An Englishman raised in Australia, Bob Fitzsimmons, fought an Irishman, Peter Maher, in an American promoted event which technically took place in Mexico, winning the 1896 World Heavyweight Championship in boxing.\n*1913 – Ioannina is incorporated into the Greek state after the Balkan Wars.\n*1916 – World War I: In France, the Battle of Verdun begins.\n*1918 – The last Carolina parakeet dies in captivity at the Cincinnati Zoo.\n*1919 – German socialist Kurt Eisner is assassinated. His death results in the establishment of the Bavarian Soviet Republic and parliament and government fleeing Munich, Germany.\n*1921 – Constituent Assembly of the Democratic Republic of Georgia adopts the country's first constitution.\n*  1921   – Rezā Shāh takes control of Tehran during a successful coup\n*1925 – The New Yorker publishes its first issue.\n*1937 – The League of Nations bans foreign national \"volunteers\" in the Spanish Civil War.\n*1945 – World War II: During the Battle of Iwo Jima, Japanese kamikaze planes sink the escort carrier  and damage the .\n*1947 – In New York City, Edwin Land demonstrates the first \"instant camera\", the Polaroid Land Camera, to a meeting of the Optical Society of America.\n*1948 – NASCAR is incorporated.\n*1952 – The British government, under Winston Churchill, abolishes identity cards in the UK to \"set the people free\".\n*  1952   – The Bengali Language Movement protests occur at the University of Dhaka in East Pakistan (now Bangladesh).\n*1958 – The CND symbol, aka peace symbol, commissioned by the Direct Action Committee in protest against the Atomic Weapons Research Establishment, is designed and completed by Gerald Holtom.\n*1965 – Malcolm X is assassinated at the Audubon Ballroom in New York City.\n*1971 – The Convention on Psychotropic Substances is signed at Vienna.\n*1972 – United States President Richard Nixon visits the People's Republic of China to normalize Sino-American relations.\n*  1972   – The Soviet unmanned spaceship Luna 20 lands on the Moon.\n*1973 – Over the Sinai Desert, Israeli fighter aircraft shoot down Libyan Arab Airlines Flight 114 jet killing 108 people.\n*1974 – The last Israeli soldiers leave the west bank of the Suez Canal pursuant to a truce with Egypt.\n*1975 – Watergate scandal: Former United States Attorney General John N. Mitchell and former White House aides H. R. Haldeman and John Ehrlichman are sentenced to prison.\n*1995 – Steve Fossett lands in Leader, Saskatchewan, Canada becoming the first person to make a solo flight across the Pacific Ocean in a balloon.\n*2013 – At least 17 people are killed and 119 injured following several bombings in the Indian city of Hyderabad.\n\nBirths\n\n* 921 – Abe no Seimei, Japanese astrologer (d. 1005)\n*1397 – Isabella of Portugal (d. 1471)\n*1462 – Joanna la Beltraneja, princess of Castile (d. 1530)\n*1484 – Joachim I Nestor, Elector of Brandenburg (d. 1535)\n*1498 – Ralph Neville, 4th Earl of Westmorland, English Earl (d. 1549)\n*1541 – Philipp V, Count of Hanau-Lichtenberg (d. 1599)\n*1556 – Sethus Calvisius, German astronomer, composer, and theorist (d. 1615)\n*1559 – Nurhaci, Chinese emperor (d. 1626)\n*1609 – Raimondo Montecuccoli, Italian military commander (d. 1680)\n*1621 – Rebecca Nurse, Massachusetts colonist, executed as a witch (d. 1692)\n*1705 – Edward Hawke, 1st Baron Hawke, English admiral and politician (d. 1781)\n*1728 – Peter III of Russia (d. 1762)\n*1783 – Catharina of Württemberg (d. 1835)\n*1788 – Francis Ronalds, British scientist, inventor and engineer who was knighted for developing the first working electric telegraph (d. 1873)\n*1791 – Carl Czerny, Austrian pianist and composer (d. 1857)\n*1794 – Antonio López de Santa Anna, Mexican general and politician, 8th President of Mexico (d. 1876)\n*1801 – John Henry Newman, English cardinal (d. 1890)\n*1817 – José Zorrilla, Spanish poet and playwright (d. 1893)\n*1821 – Charles Scribner I, American publisher, founded Charles Scribner's Sons (d. 1871)\n*1836 – Léo Delibes, French pianist and composer (d. 1891)\n*1844 – Charles-Marie Widor, French organist and composer (d. 1937)\n*1860 – Goscombe John, Welsh-English sculptor and academic (d. 1952)\n*1865 – John Haden Badley, English author and educator, founded the Bedales School (d. 1967)\n*1867 – Otto Hermann Kahn, German banker and philanthropist (d. 1934)\n*1875 – Jeanne Calment, French super-centenarian (d. 1997)\n*1878 – Mirra Alfassa, French-Indian spiritual leader (d. 1973)\n*1885 – Sacha Guitry, Russian-French actor, director, and playwright (d. 1957)\n*1887 – Korechika Anami, Japanese general and politician, 54th Japanese Minister of War (d. 1945)\n*1888 – Clemence Dane, English author and playwright (d. 1965)\n*1892 – Harry Stack Sullivan, American psychiatrist and psychoanalyst (d. 1949)\n*1893 – Celia Lovsky, Austrian-American actress (d. 1979)\n*  1893   – Andrés Segovia, Spanish guitarist (d. 1987)\n*1894 – Shanti Swaroop Bhatnagar, Indian chemist and academic (d. 1955)\n*1895 – Henrik Dam, Danish biochemist and physiologist, Nobel Prize laureate (d. 1976)\n*1896 – Nirala, Indian poet and author (d. 1961)\n*1900 – Jeanne Aubert, French singer and actress (d. 1988) \n*1902 – Arthur Nock, English theologian and academic (d. 1963)\n*1903 – Anaïs Nin, French-American essayist and memoirist (d. 1977)\n*  1903   – Raymond Queneau, French poet and author (d. 1976)\n*1907 – W. H. Auden, English-American poet, playwright, and composer (d. 1973)\n*1909 – Hans Erni, Swiss painter, sculptor, and illustrator (d. 2015)\n*1910 – Douglas Bader, English captain and pilot (d. 1982)\n*1912 – Arline Judge, American actress and singer (d. 1974)\n*1914 – Ilmari Juutilainen, Finnish soldier and pilot (d. 1999)\n*  1914   – Zachary Scott, American actor (d. 1965)\n*  1914   – Jean Tatlock, American psychiatrist and physician (d. 1944)\n*1915 – Claudia Jones, Trinidad-British journalist and activist (d. 1964)\n* 1915    – Ann Sheridan, American actress and singer (d. 1967)\n* 1915    – Anton Vratuša, Prime Minister of Slovenia (1978–1980) (d. 2017)\n*1917 – Lucille Bremer, American actress and dancer (d. 1996)\n*  1917   – Tadd Dameron, American pianist and composer (d. 1965)\n*1921 – John Rawls, American philosopher and academic (d. 2002)\n*  1921   – Richard T. Whitcomb, American aeronautical engineer (d. 2009)\n*1924 – Thelma Estrin, American computer scientist and engineer (d. 2014)\n*  1924   – Robert Mugabe, Zimbabwean educator and politician, 2nd President of Zimbabwe\n*  1924   – Dorothy Blum, American computer scientist and cryptanalyst (d. 1980)\n*1925 – Sam Peckinpah, American director and screenwriter (d. 1984)\n*  1925   – Jack Ramsay, American basketball player, coach, and sportscaster (d. 2014)\n*1927 – Erma Bombeck, American journalist and author (d. 1996)\n*  1927   – Hubert de Givenchy, French fashion designer, founded Givenchy\n*1929 – Chespirito, Mexican actor, director, producer, and screenwriter (d. 2014)\n*1933 – Nina Simone, American singer-songwriter and pianist (d. 2003)\n*1934 – Rue McClanahan, American actress (d. 2010)\n*1935 – Richard A. Lupoff, American author\n*1936 – Barbara Jordan, American lawyer and politician (d. 1996)\n*1937 – Ron Clarke, Australian runner and politician, Mayor of the Gold Coast (d. 2015)\n*  1937   – Harald V of Norway\n*1938 – Bobby Charles, American singer-songwriter (d. 2010)\n*  1938   – Kel Tremain, New Zealand rugby player (d. 1992)\n*1940 – Peter Gethin, English race car driver (d. 2011)\n*  1940   – John Lewis, American activist and politician\n*1942 – Tony Martin, Trinidadian-American historian and academic (d. 2013)\n*  1942   – Margarethe von Trotta, German actress, director, and screenwriter\n*1943 – David Geffen, American businessman, co-founded DreamWorks and Geffen Records\n*1945 – Maurice Bembridge, English golfer\n*1946 – Tyne Daly, American actress and singer\n*  1946   – Anthony Daniels, English actor and producer\n*  1946   – Alan Rickman, English actor and director (d. 2016)\n*  1946   – Bob Ryan, American journalist and author\n*1947 – Johnny Echols, American singer-songwriter and guitarist \n*  1947   – Olympia Snowe, American politician\n*1948 – Bill Slayback, American baseball player and singer (d. 2015)\n*1949 – Frank Brunner, American illustrator\n*  1949   – Larry Drake,  American actor (d. 2016)\n*  1949   – Jerry Harrison, American singer-songwriter, guitarist, and producer \n*  1949   – Ronnie Hellström, Swedish footballer\n*1951 – Vince Welnick, American keyboard player (d. 2006)\n*1952 – Jean-Jacques Burnel, English bass player, songwriter, and producer\n*  1952   – Vitaly Churkin, Russian diplomat, former Ambassador of Russia to the United Nations (d. 2017)\n*1953 – Christine Ebersole, American actress and singer\n*  1953   – William Petersen, American actor and producer \n*1954 – Christina Rees, British politician\n*1955 – Kelsey Grammer, American actor, singer, and producer\n*1958 – Jake Burns, Northern Irish singer-songwriter and guitarist \n*  1958   – Mary Chapin Carpenter, American singer-songwriter and guitarist\n*  1958   – Kim Coates, Canadian actor\n*  1958   – Alan Trammell, American baseball player, coach, and manager\n*1959 – José María Cano, Spanish singer-songwriter and painter \n*1960 – Plamen Oresharski, Bulgarian economist and politician, 52nd Prime Minister of Bulgaria\n*  1960   – Steve Wynn, American singer-songwriter\n*1961 – Christopher Atkins, American actor and businessman\n*1962 – Chuck Palahniuk, American novelist and journalist\n*  1962   – David Foster Wallace, American novelist, short story writer, and essayist (d. 2008)\n*1963 – William Baldwin, American actor\n*  1963   – Ranking Roger, English singer-songwriter and musician\n*  1963   – Greg Turner, New Zealand golfer\n*1964 – Mark Kelly, American captain, pilot, and astronaut\n*  1964   – Scott Kelly, American captain, pilot, and astronaut\n*1965 – Mark Ferguson, Australian journalist\n*1967 – Leroy Burrell, American runner and coach\n*  1967   – Sari Essayah, Finnish athlete and politician\n*1969 – James Dean Bradfield, Welsh singer-songwriter and guitarist (Manic Street Preachers)\n*  1969   – Aunjanue Ellis, American actress and producer\n*  1969   – Petra Kronberger, Austrian skier\n*  1969   – Tony Meola, American soccer player and manager\n*  1969   – Cathy Richardson, American singer-songwriter and guitarist \n*1970 – Michael Slater, Australian cricketer and sportscaster\n*  1970   – Eric Wilson, American bass player and drummer \n*1971 – Pierre Fulke, Swedish golfer\n*1972 – Seo Taiji, South Korean singer-songwriter \n*1973 – Heri Joensen, Faroese singer-songwriter and guitarist \n*  1973   – Brian Rolston, American ice hockey player and coach\n*1974 – Iván Campo, Spanish footballer\n*  1974   – Roberto Heras, Spanish cyclist\n*1975 – Scott Miller, Australian swimmer\n*1976 – Ryan Smyth, Canadian ice hockey player\n*  1976   – Michael McIntyre, English comedian, actor and television presenter\n*1977 – Jonathan Safran Foer, American novelist\n*  1977   – Steve Francis, American basketball player\n*  1977   – Owen King, American author\n*  1977   – Kevin Rose, American businessman and television host, founded Digg\n*1978 – Kumail Nanjiani, Pakistani-American stand-up comedian, actor, writer and podcast host\n*1979 – Pascal Chimbonda, Guadeloupean-French footballer\n*  1979   – Shane Gibson, American guitarist (stOrk and Jonathan Davis and the SFA) (d. 2014)\n*  1979   – Jennifer Love Hewitt, American actress and producer\n*  1979   – Carly Colón, Puerto Rican professional wrestler\n*  1979   – Jordan Peele, American actor, producer, and screenwriter\n*1980 – Brad Fast, Canadian ice hockey player \n*  1980   – Tiziano Ferro, Italian singer-songwriter and producer\n*  1980   – Jigme Khesar Namgyel Wangchuck, 5th King of Bhutan\n*  1980   – Justin Roiland, American animator, writer and voice actor\n*1982 – Andre Barrett, American basketball player\n*  1982   – Chantal Claret, American singer-songwriter\n*  1982   – Tebogo Jacko Magubane, South African DJ and producer \n*1983 – Braylon Edwards, American football player\n*  1983   – Franklin Gutiérrez, Venezuelan baseball player\n*  1983   – Mélanie Laurent, French actress\n*1984 – Andrew Ellis, New Zealand rugby player\n*  1984   – David Odonkor, German footballer\n*  1984   – Marco Paoloni, Italian footballer\n*  1984   – James Wisniewski, American ice hockey player\n*1985 – Georgios Samaras, Greek footballer\n*  1985   – Jamaal Westerman, American football player\n*1986 – Charlotte Church, Welsh singer-songwriter and actress\n*1987 – Ellen Page, Canadian actress \n*1990 – Mattias Tedenby, Swedish ice hockey player\n*1991 – Riyad Mahrez, Algerian footballer\n*  1991   – Ji So-yun, South Korean footballer\n*  1991   – Devon Travis, American baseball player\n*1993 – Steve Leo Beleck, Cameroonian footballer\n*  1993   – Davy Klaassen, Dutch footballer\n*1994 – Tang Haochen, Chinese tennis player\n*  1994   – Charalampos Mavrias, Greek footballer\n*1996 – Sophie Turner, English actress\n\nDeaths\n\n* 4 AD – Gaius Caesar, Roman consul and grandson of Augustus (b. 20 BC)\n* 675 – Randoald of Grandval, prior of the Benedictine monastery of Grandval\n*1184 – Minamoto no Yoshinaka, Japanese shogun (b. 1154)\n*1267 – Baldwin of Ibelin, Seneschal of Cyprus\n*1437 – James I of Scotland (b. 1394)\n*1471 – Jan Rokycana, Czech bishop and theologian (b. 1396)\n*1513 – Pope Julius II (b. 1443)\n*1543 – Ahmad ibn Ibrahim al-Ghazi, Somalian general (b. 1507)\n*1554 – Hieronymus Bock, German botanist and physician (b. 1498)\n*1572 – Cho Shik, Korean poet and scholar (d. 1501)\n*1590 – Ambrose Dudley, 3rd Earl of Warwick, English nobleman and general (b. 1528)\n*1595 – Robert Southwell, English priest and poet (b. 1561)\n*1677 – Baruch Spinoza, Dutch philosopher and scholar (b. 1632)\n*1715 – Charles Calvert, 3rd Baron Baltimore, English politician (b. 1637)\n*1730 – Pope Benedict XIII (b. 1649)\n*1821 – Georg Friedrich von Martens, German jurist and diplomat (b. 1756)\n*1824 – Eugène de Beauharnais, French general (b. 1781)\n*1846 – Emperor Ninkō of Japan (b. 1800)\n*1862 – Justinus Kerner, German poet and physician (b. 1786)\n*1888 – William Weston, English-Australian politician, 3rd Premier of Tasmania (b. 1804)\n*1891 – James Timberlake, American lieutenant and police officer (b. 1846)\n*1919 – Kurt Eisner, German journalist and politician, Minister-President of Bavaria (b. 1867)\n*1926 – Heike Kamerlingh Onnes, Dutch physicist and academic, Nobel Prize laureate (b. 1853)\n*1934 – Augusto César Sandino, Nicaraguan rebel leader (b. 1895)\n*1938 – George Ellery Hale, American astronomer and academic (b. 1868)\n*1941 – Frederick Banting, Canadian physician and academic, Nobel Prize laureate (b. 1891)\n*1944 – Ferenc Szisz, Hungarian-French race car driver (b. 1873)\n*1945 – Eric Liddell, Scottish rugby player and runner (b. 1902)\n*1946 – José Streel, Belgian journalist (b. 1911)\n*1958 – Duncan Edwards, English footballer (b. 1936)\n*1965 – Malcolm X, American minister and activist (b. 1925)\n*1967 – Charles Beaumont, American author and screenwriter (b. 1929)\n*1968 – Howard Florey, Australian pathologist and pharmacologist, Nobel Prize laureate (b. 1898)\n*1972 – Zhang Guohua, Chinese general and politician (b. 1914)\n*  1972   – Bronislava Nijinska, Russian-American dancer and choreographer (b. 1891)\n*  1972   – Eugène Tisserant, French cardinal (b. 1884)\n*1974 – Tim Horton, Canadian ice hockey player and businessman, co-founded Tim Hortons (b. 1930)\n*1980 – Alfred Andersch, German-Swiss author (b. 1914)\n*1982 – Gershom Scholem, German-Israeli historian and philosopher (b. 1897)\n*1984 – Mikhail Sholokhov, Russian novelist and short story writer, Nobel Prize laureate (b. 1905)\n*1985 – Louis Hayward, South African-American actor (b. 1909)\n*1986 – Helen Hooven Santmyer, American novelist (b. 1895)\n*1991 – Dorothy Auchterlonie Green, Australian poet, critic, and academic (b. 1915)\n*1993 – Inge Lehmann, Danish seismologist and geophysicist (b. 1888)\n*1994 – Johannes Steinhoff, German general and pilot (b. 1913)\n*1996 – Morton Gould, American pianist, composer, and conductor (b. 1913)\n*1999 – Gertrude B. Elion, American biochemist and pharmacologist, Nobel Prize laureate (b. 1918)\n*  1999   – Ilmari Juutilainen, Finnish soldier and pilot (b. 1914)\n*  1999   – Wilmer Mizell, American baseball player and politician (b. 1930)\n*2002 – John Thaw, English actor and producer (b. 1942)\n*2004 – John Charles, Welsh footballer and manager (b. 1931)\n*2005 – Guillermo Cabrera Infante, Cuban author, screenwriter, and critic (b. 1929)\n*  2005   – Zdzisław Beksiński, Polish painter, photographer, and sculptor (b. 1929)\n*2008 – Ben Chapman, American actor (b. 1928)\n*  2008   – Neil Chotem, Canadian conductor and composer (b. 1920)\n*2011 – Dwayne McDuffie, American author and screenwriter, co-founded Milestone Media (b. 1962)\n*  2011   – Bernard Nathanson, American physician and activist (b. 1926)\n*2012 – H. M. Darmstandler, American general (b. 1922)\n*  2012   – Barney Rosset, American publisher (b. 1922)\n*2013 – Hasse Jeppson, Swedish footballer (b. 1925)\n*2014 – Héctor Maestri, Cuban-American baseball player (b. 1935)\n*  2014   – Matthew Robinson, Australian snowboarder (b. 1985)\n*  2014   – Cornelius Schnauber, German–American historian, playwright, and academic (b. 1939)\n*  2014   – John Strawson, English general (b. 1921)\n*2015 – Aleksei Gubarev, Russian general, pilot, and astronaut (b. 1931)\n*  2015   – Robert O. Marshall, American businessman (b. 1939)\n*  2015   – Sadeq Tabatabaei, Iranian journalist and politician (b. 1943)\n*  2015   – Clark Terry, American trumpet player, composer, and educator (b. 1920)\n*2016 – Eric Brown, Scottish-English captain and pilot (b. 1919)\n*2017 – Jeanne Martin Cissé, Guinean teacher and politician (b. 1926)\n\nHolidays and observances\n\n*Armed Forces Day (South Africa)\n*Birthday of King Harald V (Norway)\n*Christian feast day:\n**Felix of Hadrumetum\n**Pepin of Landen\n**Peter Damian\n**Randoald of Grandval\n**February 21 (Eastern Orthodox liturgics)\n*Father Lini Day (Vanuatu)\n*Language Movement Day (Bangladesh)\n**International Mother Language Day (UNESCO)\n*The first day of the Birth Anniversary of Fifth Druk Gyalpo, celebrated until February 23. (Bhutan)\n*The first day of the Musikahan Festival, celebrated until February 27. (Tagum City, Philippines)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "February 21" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11010" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 362 – Athanasius returns to Alexandria.\n*1245 – Thomas, the first known Bishop of Finland, is granted resignation after confessing to torture and forgery.\n*1437 – James I of Scotland is assassinated.\n*1440 – The Prussian Confederation is formed.\n*1543 – Battle of Wayna Daga – A combined army of Ethiopian and Portuguese troops defeats a Muslim army led by Ahmed Gragn.\n*1613 – Mikhail I is unanimously elected Tsar by a national assembly, beginning the Romanov dynasty of Imperial Russia.\n*1797 – A force of 1,400 French soldiers invaded Britain at Fishguard in support of the Society of United Irishmen. They were defeated by 500 British reservists.\n*1804 – The first self-propelling steam locomotive makes its outing at the Pen-y-Darren Ironworks in Wales.\n*1808 – Without a previous declaration of war, Russian troops cross the border to Sweden at Abborfors in eastern Finland, thus beginning the Finnish War, in which Sweden will lose the eastern half of the country (i.e. Finland) to Russia.\n*1828 – Initial issue of the Cherokee Phoenix is the first periodical to use the Cherokee syllabary invented by Sequoyah.\n*1842 – John Greenough is granted the first U.S. patent for the sewing machine.\n*1848 – Karl Marx and Friedrich Engels publish The Communist Manifesto.\n*1862 – American Civil War: Battle of Valverde is fought near Fort Craig in New Mexico Territory.\n*1874 – The Oakland Daily Tribune publishes its first edition.\n*1878 – The first telephone directory is issued in New Haven, Connecticut.\n*1885 – The newly completed Washington Monument is dedicated.\n*1896 – An Englishman raised in Australia, Bob Fitzsimmons, fought an Irishman, Peter Maher, in an American promoted event which technically took place in Mexico, winning the 1896 World Heavyweight Championship in boxing.\n*1913 – Ioannina is incorporated into the Greek state after the Balkan Wars.\n*1916 – World War I: In France, the Battle of Verdun begins.\n*1918 – The last Carolina parakeet dies in captivity at the Cincinnati Zoo.\n*1919 – German socialist Kurt Eisner is assassinated. His death results in the establishment of the Bavarian Soviet Republic and parliament and government fleeing Munich, Germany.\n*1921 – Constituent Assembly of the Democratic Republic of Georgia adopts the country's first constitution.\n*  1921   – Rezā Shāh takes control of Tehran during a successful coup\n*1925 – The New Yorker publishes its first issue.\n*1937 – The League of Nations bans foreign national \"volunteers\" in the Spanish Civil War.\n*1945 – World War II: During the Battle of Iwo Jima, Japanese kamikaze planes sink the escort carrier  and damage the .\n*1947 – In New York City, Edwin Land demonstrates the first \"instant camera\", the Polaroid Land Camera, to a meeting of the Optical Society of America.\n*1948 – NASCAR is incorporated.\n*1952 – The British government, under Winston Churchill, abolishes identity cards in the UK to \"set the people free\".\n*  1952   – The Bengali Language Movement protests occur at the University of Dhaka in East Pakistan (now Bangladesh).\n*1958 – The CND symbol, aka peace symbol, commissioned by the Direct Action Committee in protest against the Atomic Weapons Research Establishment, is designed and completed by Gerald Holtom.\n*1965 – Malcolm X is assassinated at the Audubon Ballroom in New York City.\n*1971 – The Convention on Psychotropic Substances is signed at Vienna.\n*1972 – United States President Richard Nixon visits the People's Republic of China to normalize Sino-American relations.\n*  1972   – The Soviet unmanned spaceship Luna 20 lands on the Moon.\n*1973 – Over the Sinai Desert, Israeli fighter aircraft shoot down Libyan Arab Airlines Flight 114 jet killing 108 people.\n*1974 – The last Israeli soldiers leave the west bank of the Suez Canal pursuant to a truce with Egypt.\n*1975 – Watergate scandal: Former United States Attorney General John N. Mitchell and former White House aides H. R. Haldeman and John Ehrlichman are sentenced to prison.\n*1995 – Steve Fossett lands in Leader, Saskatchewan, Canada becoming the first person to make a solo flight across the Pacific Ocean in a balloon.\n*2013 – At least 17 people are killed and 119 injured following several bombings in the Indian city of Hyderabad.\n\nBirths\n\n* 921 – Abe no Seimei, Japanese astrologer (d. 1005)\n*1397 – Isabella of Portugal (d. 1471)\n*1462 – Joanna la Beltraneja, princess of Castile (d. 1530)\n*1484 – Joachim I Nestor, Elector of Brandenburg (d. 1535)\n*1498 – Ralph Neville, 4th Earl of Westmorland, English Earl (d. 1549)\n*1541 – Philipp V, Count of Hanau-Lichtenberg (d. 1599)\n*1556 – Sethus Calvisius, German astronomer, composer, and theorist (d. 1615)\n*1559 – Nurhaci, Chinese emperor (d. 1626)\n*1609 – Raimondo Montecuccoli, Italian military commander (d. 1680)\n*1621 – Rebecca Nurse, Massachusetts colonist, executed as a witch (d. 1692)\n*1705 – Edward Hawke, 1st Baron Hawke, English admiral and politician (d. 1781)\n*1728 – Peter III of Russia (d. 1762)\n*1783 – Catharina of Württemberg (d. 1835)\n*1788 – Francis Ronalds, British scientist, inventor and engineer who was knighted for developing the first working electric telegraph (d. 1873)\n*1791 – Carl Czerny, Austrian pianist and composer (d. 1857)\n*1794 – Antonio López de Santa Anna, Mexican general and politician, 8th President of Mexico (d. 1876)\n*1801 – John Henry Newman, English cardinal (d. 1890)\n*1817 – José Zorrilla, Spanish poet and playwright (d. 1893)\n*1821 – Charles Scribner I, American publisher, founded Charles Scribner's Sons (d. 1871)\n*1836 – Léo Delibes, French pianist and composer (d. 1891)\n*1844 – Charles-Marie Widor, French organist and composer (d. 1937)\n*1860 – Goscombe John, Welsh-English sculptor and academic (d. 1952)\n*1865 – John Haden Badley, English author and educator, founded the Bedales School (d. 1967)\n*1867 – Otto Hermann Kahn, German banker and philanthropist (d. 1934)\n*1875 – Jeanne Calment, French super-centenarian (d. 1997)\n*1878 – Mirra Alfassa, French-Indian spiritual leader (d. 1973)\n*1885 – Sacha Guitry, Russian-French actor, director, and playwright (d. 1957)\n*1887 – Korechika Anami, Japanese general and politician, 54th Japanese Minister of War (d. 1945)\n*1888 – Clemence Dane, English author and playwright (d. 1965)\n*1892 – Harry Stack Sullivan, American psychiatrist and psychoanalyst (d. 1949)\n*1893 – Celia Lovsky, Austrian-American actress (d. 1979)\n*  1893   – Andrés Segovia, Spanish guitarist (d. 1987)\n*1894 – Shanti Swaroop Bhatnagar, Indian chemist and academic (d. 1955)\n*1895 – Henrik Dam, Danish biochemist and physiologist, Nobel Prize laureate (d. 1976)\n*1896 – Nirala, Indian poet and author (d. 1961)\n*1900 – Jeanne Aubert, French singer and actress (d. 1988) \n*1902 – Arthur Nock, English theologian and academic (d. 1963)\n*1903 – Anaïs Nin, French-American essayist and memoirist (d. 1977)\n*  1903   – Raymond Queneau, French poet and author (d. 1976)\n*1907 – W. H. Auden, English-American poet, playwright, and composer (d. 1973)\n*1909 – Hans Erni, Swiss painter, sculptor, and illustrator (d. 2015)\n*1910 – Douglas Bader, English captain and pilot (d. 1982)\n*1912 – Arline Judge, American actress and singer (d. 1974)\n*1914 – Ilmari Juutilainen, Finnish soldier and pilot (d. 1999)\n*  1914   – Zachary Scott, American actor (d. 1965)\n*  1914   – Jean Tatlock, American psychiatrist and physician (d. 1944)\n*1915 – Claudia Jones, Trinidad-British journalist and activist (d. 1964)\n* 1915    – Ann Sheridan, American actress and singer (d. 1967)\n* 1915    – Anton Vratuša, Prime Minister of Slovenia (1978–1980) (d. 2017)\n*1917 – Lucille Bremer, American actress and dancer (d. 1996)\n*  1917   – Tadd Dameron, American pianist and composer (d. 1965)\n*1921 – John Rawls, American philosopher and academic (d. 2002)\n*  1921   – Richard T. Whitcomb, American aeronautical engineer (d. 2009)\n*1924 – Thelma Estrin, American computer scientist and engineer (d. 2014)\n*  1924   – Robert Mugabe, Zimbabwean educator and politician, 2nd President of Zimbabwe\n*  1924   – Dorothy Blum, American computer scientist and cryptanalyst (d. 1980)\n*1925 – Sam Peckinpah, American director and screenwriter (d. 1984)\n*  1925   – Jack Ramsay, American basketball player, coach, and sportscaster (d. 2014)\n*1927 – Erma Bombeck, American journalist and author (d. 1996)\n*  1927   – Hubert de Givenchy, French fashion designer, founded Givenchy\n*1929 – Chespirito, Mexican actor, director, producer, and screenwriter (d. 2014)\n*1933 – Nina Simone, American singer-songwriter and pianist (d. 2003)\n*1934 – Rue McClanahan, American actress (d. 2010)\n*1935 – Richard A. Lupoff, American author\n*1936 – Barbara Jordan, American lawyer and politician (d. 1996)\n*1937 – Ron Clarke, Australian runner and politician, Mayor of the Gold Coast (d. 2015)\n*  1937   – Harald V of Norway\n*1938 – Bobby Charles, American singer-songwriter (d. 2010)\n*  1938   – Kel Tremain, New Zealand rugby player (d. 1992)\n*1940 – Peter Gethin, English race car driver (d. 2011)\n*  1940   – John Lewis, American activist and politician\n*1942 – Tony Martin, Trinidadian-American historian and academic (d. 2013)\n*  1942   – Margarethe von Trotta, German actress, director, and screenwriter\n*1943 – David Geffen, American businessman, co-founded DreamWorks and Geffen Records\n*1945 – Maurice Bembridge, English golfer\n*1946 – Tyne Daly, American actress and singer\n*  1946   – Anthony Daniels, English actor and producer\n*  1946   – Alan Rickman, English actor and director (d. 2016)\n*  1946   – Bob Ryan, American journalist and author\n*1947 – Johnny Echols, American singer-songwriter and guitarist \n*  1947   – Olympia Snowe, American politician\n*1948 – Bill Slayback, American baseball player and singer (d. 2015)\n*1949 – Frank Brunner, American illustrator\n*  1949   – Larry Drake,  American actor (d. 2016)\n*  1949   – Jerry Harrison, American singer-songwriter, guitarist, and producer \n*  1949   – Ronnie Hellström, Swedish footballer\n*1951 – Vince Welnick, American keyboard player (d. 2006)\n*1952 – Jean-Jacques Burnel, English bass player, songwriter, and producer\n*  1952   – Vitaly Churkin, Russian diplomat, former Ambassador of Russia to the United Nations (d. 2017)\n*1953 – Christine Ebersole, American actress and singer\n*  1953   – William Petersen, American actor and producer \n*1954 – Christina Rees, British politician\n*1955 – Kelsey Grammer, American actor, singer, and producer\n*1958 – Jake Burns, Northern Irish singer-songwriter and guitarist \n*  1958   – Mary Chapin Carpenter, American singer-songwriter and guitarist\n*  1958   – Kim Coates, Canadian actor\n*  1958   – Alan Trammell, American baseball player, coach, and manager\n*1959 – José María Cano, Spanish singer-songwriter and painter \n*1960 – Plamen Oresharski, Bulgarian economist and politician, 52nd Prime Minister of Bulgaria\n*  1960   – Steve Wynn, American singer-songwriter\n*1961 – Christopher Atkins, American actor and businessman\n*1962 – Chuck Palahniuk, American novelist and journalist\n*  1962   – David Foster Wallace, American novelist, short story writer, and essayist (d. 2008)\n*1963 – William Baldwin, American actor\n*  1963   – Ranking Roger, English singer-songwriter and musician\n*  1963   – Greg Turner, New Zealand golfer\n*1964 – Mark Kelly, American captain, pilot, and astronaut\n*  1964   – Scott Kelly, American captain, pilot, and astronaut\n*1965 – Mark Ferguson, Australian journalist\n*1967 – Leroy Burrell, American runner and coach\n*  1967   – Sari Essayah, Finnish athlete and politician\n*1969 – James Dean Bradfield, Welsh singer-songwriter and guitarist (Manic Street Preachers)\n*  1969   – Aunjanue Ellis, American actress and producer\n*  1969   – Petra Kronberger, Austrian skier\n*  1969   – Tony Meola, American soccer player and manager\n*  1969   – Cathy Richardson, American singer-songwriter and guitarist \n*1970 – Michael Slater, Australian cricketer and sportscaster\n*  1970   – Eric Wilson, American bass player and drummer \n*1971 – Pierre Fulke, Swedish golfer\n*1972 – Seo Taiji, South Korean singer-songwriter \n*1973 – Heri Joensen, Faroese singer-songwriter and guitarist \n*  1973   – Brian Rolston, American ice hockey player and coach\n*1974 – Iván Campo, Spanish footballer\n*  1974   – Roberto Heras, Spanish cyclist\n*1975 – Scott Miller, Australian swimmer\n*1976 – Ryan Smyth, Canadian ice hockey player\n*  1976   – Michael McIntyre, English comedian, actor and television presenter\n*1977 – Jonathan Safran Foer, American novelist\n*  1977   – Steve Francis, American basketball player\n*  1977   – Owen King, American author\n*  1977   – Kevin Rose, American businessman and television host, founded Digg\n*1978 – Kumail Nanjiani, Pakistani-American stand-up comedian, actor, writer and podcast host\n*1979 – Pascal Chimbonda, Guadeloupean-French footballer\n*  1979   – Shane Gibson, American guitarist (stOrk and Jonathan Davis and the SFA) (d. 2014)\n*  1979   – Jennifer Love Hewitt, American actress and producer\n*  1979   – Carly Colón, Puerto Rican professional wrestler\n*  1979   – Jordan Peele, American actor, producer, and screenwriter\n*1980 – Brad Fast, Canadian ice hockey player \n*  1980   – Tiziano Ferro, Italian singer-songwriter and producer\n*  1980   – Jigme Khesar Namgyel Wangchuck, 5th King of Bhutan\n*  1980   – Justin Roiland, American animator, writer and voice actor\n*1982 – Andre Barrett, American basketball player\n*  1982   – Chantal Claret, American singer-songwriter\n*  1982   – Tebogo Jacko Magubane, South African DJ and producer \n*1983 – Braylon Edwards, American football player\n*  1983   – Franklin Gutiérrez, Venezuelan baseball player\n*  1983   – Mélanie Laurent, French actress\n*1984 – Andrew Ellis, New Zealand rugby player\n*  1984   – David Odonkor, German footballer\n*  1984   – Marco Paoloni, Italian footballer\n*  1984   – James Wisniewski, American ice hockey player\n*1985 – Georgios Samaras, Greek footballer\n*  1985   – Jamaal Westerman, American football player\n*1986 – Charlotte Church, Welsh singer-songwriter and actress\n*1987 – Ellen Page, Canadian actress \n*1990 – Mattias Tedenby, Swedish ice hockey player\n*1991 – Riyad Mahrez, Algerian footballer\n*  1991   – Ji So-yun, South Korean footballer\n*  1991   – Devon Travis, American baseball player\n*1993 – Steve Leo Beleck, Cameroonian footballer\n*  1993   – Davy Klaassen, Dutch footballer\n*1994 – Tang Haochen, Chinese tennis player\n*  1994   – Charalampos Mavrias, Greek footballer\n*1996 – Sophie Turner, English actress\n\nDeaths\n\n* 4 AD – Gaius Caesar, Roman consul and grandson of Augustus (b. 20 BC)\n* 675 – Randoald of Grandval, prior of the Benedictine monastery of Grandval\n*1184 – Minamoto no Yoshinaka, Japanese shogun (b. 1154)\n*1267 – Baldwin of Ibelin, Seneschal of Cyprus\n*1437 – James I of Scotland (b. 1394)\n*1471 – Jan Rokycana, Czech bishop and theologian (b. 1396)\n*1513 – Pope Julius II (b. 1443)\n*1543 – Ahmad ibn Ibrahim al-Ghazi, Somalian general (b. 1507)\n*1554 – Hieronymus Bock, German botanist and physician (b. 1498)\n*1572 – Cho Shik, Korean poet and scholar (d. 1501)\n*1590 – Ambrose Dudley, 3rd Earl of Warwick, English nobleman and general (b. 1528)\n*1595 – Robert Southwell, English priest and poet (b. 1561)\n*1677 – Baruch Spinoza, Dutch philosopher and scholar (b. 1632)\n*1715 – Charles Calvert, 3rd Baron Baltimore, English politician (b. 1637)\n*1730 – Pope Benedict XIII (b. 1649)\n*1821 – Georg Friedrich von Martens, German jurist and diplomat (b. 1756)\n*1824 – Eugène de Beauharnais, French general (b. 1781)\n*1846 – Emperor Ninkō of Japan (b. 1800)\n*1862 – Justinus Kerner, German poet and physician (b. 1786)\n*1888 – William Weston, English-Australian politician, 3rd Premier of Tasmania (b. 1804)\n*1891 – James Timberlake, American lieutenant and police officer (b. 1846)\n*1919 – Kurt Eisner, German journalist and politician, Minister-President of Bavaria (b. 1867)\n*1926 – Heike Kamerlingh Onnes, Dutch physicist and academic, Nobel Prize laureate (b. 1853)\n*1934 – Augusto César Sandino, Nicaraguan rebel leader (b. 1895)\n*1938 – George Ellery Hale, American astronomer and academic (b. 1868)\n*1941 – Frederick Banting, Canadian physician and academic, Nobel Prize laureate (b. 1891)\n*1944 – Ferenc Szisz, Hungarian-French race car driver (b. 1873)\n*1945 – Eric Liddell, Scottish rugby player and runner (b. 1902)\n*1946 – José Streel, Belgian journalist (b. 1911)\n*1958 – Duncan Edwards, English footballer (b. 1936)\n*1965 – Malcolm X, American minister and activist (b. 1925)\n*1967 – Charles Beaumont, American author and screenwriter (b. 1929)\n*1968 – Howard Florey, Australian pathologist and pharmacologist, Nobel Prize laureate (b. 1898)\n*1972 – Zhang Guohua, Chinese general and politician (b. 1914)\n*  1972   – Bronislava Nijinska, Russian-American dancer and choreographer (b. 1891)\n*  1972   – Eugène Tisserant, French cardinal (b. 1884)\n*1974 – Tim Horton, Canadian ice hockey player and businessman, co-founded Tim Hortons (b. 1930)\n*1980 – Alfred Andersch, German-Swiss author (b. 1914)\n*1982 – Gershom Scholem, German-Israeli historian and philosopher (b. 1897)\n*1984 – Mikhail Sholokhov, Russian novelist and short story writer, Nobel Prize laureate (b. 1905)\n*1985 – Louis Hayward, South African-American actor (b. 1909)\n*1986 – Helen Hooven Santmyer, American novelist (b. 1895)\n*1991 – Dorothy Auchterlonie Green, Australian poet, critic, and academic (b. 1915)\n*1993 – Inge Lehmann, Danish seismologist and geophysicist (b. 1888)\n*1994 – Johannes Steinhoff, German general and pilot (b. 1913)\n*1996 – Morton Gould, American pianist, composer, and conductor (b. 1913)\n*1999 – Gertrude B. Elion, American biochemist and pharmacologist, Nobel Prize laureate (b. 1918)\n*  1999   – Ilmari Juutilainen, Finnish soldier and pilot (b. 1914)\n*  1999   – Wilmer Mizell, American baseball player and politician (b. 1930)\n*2002 – John Thaw, English actor and producer (b. 1942)\n*2004 – John Charles, Welsh footballer and manager (b. 1931)\n*2005 – Guillermo Cabrera Infante, Cuban author, screenwriter, and critic (b. 1929)\n*  2005   – Zdzisław Beksiński, Polish painter, photographer, and sculptor (b. 1929)\n*2008 – Ben Chapman, American actor (b. 1928)\n*  2008   – Neil Chotem, Canadian conductor and composer (b. 1920)\n*2011 – Dwayne McDuffie, American author and screenwriter, co-founded Milestone Media (b. 1962)\n*  2011   – Bernard Nathanson, American physician and activist (b. 1926)\n*2012 – H. M. Darmstandler, American general (b. 1922)\n*  2012   – Barney Rosset, American publisher (b. 1922)\n*2013 – Hasse Jeppson, Swedish footballer (b. 1925)\n*2014 – Héctor Maestri, Cuban-American baseball player (b. 1935)\n*  2014   – Matthew Robinson, Australian snowboarder (b. 1985)\n*  2014   – Cornelius Schnauber, German–American historian, playwright, and academic (b. 1939)\n*  2014   – John Strawson, English general (b. 1921)\n*2015 – Aleksei Gubarev, Russian general, pilot, and astronaut (b. 1931)\n*  2015   – Robert O. Marshall, American businessman (b. 1939)\n*  2015   – Sadeq Tabatabaei, Iranian journalist and politician (b. 1943)\n*  2015   – Clark Terry, American trumpet player, composer, and educator (b. 1920)\n*2016 – Eric Brown, Scottish-English captain and pilot (b. 1919)\n*2017 – Jeanne Martin Cissé, Guinean teacher and politician (b. 1926)\n\nHolidays and observances\n\n*Armed Forces Day (South Africa)\n*Birthday of King Harald V (Norway)\n*Christian feast day:\n**Felix of Hadrumetum\n**Pepin of Landen\n**Peter Damian\n**Randoald of Grandval\n**February 21 (Eastern Orthodox liturgics)\n*Father Lini Day (Vanuatu)\n*Language Movement Day (Bangladesh)\n**International Mother Language Day (UNESCO)\n*The first day of the Birth Anniversary of Fifth Druk Gyalpo, celebrated until February 23. (Bhutan)\n*The first day of the Musikahan Festival, celebrated until February 27. (Tagum City, Philippines). February 21. http://en.wikipedia.org/?curid=11010."
  }
}
