{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18631",
  "eid" : "341703e0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778596638,
  "textBody" : "In physics (particularly in electromagnetism) the Lorentz force is the combination of electric and magnetic force on a point charge due to electromagnetic fields. A particle of charge q moving with velocity v in the presence of an electric field E and a magnetic field B experiences a force\n\\mathbf{F} = q\\mathbf{E} + q\\mathbf{v} \\times \\mathbf{B}\n(in SI unitsIn SI units,  is measured in teslas (symbol: T). In Gaussian-cgs units,  is measured in gauss (symbol: G). See e.g. )The -field is measured in amperes per metre (A/m) in SI units, and in oersteds (Oe) in cgs units. ). Variations on this basic formula describe the magnetic force on a current-carrying wire (sometimes called Laplace force), the electromotive force in a wire loop moving through a magnetic field (an aspect of Faraday's law of induction), and the force on a charged particle which might be traveling near the speed of light (relativistic form of the Lorentz force).\n\nThe first derivation of the Lorentz force is commonly attributed to Oliver Heaviside in 1889, although other historians suggest an earlier origin in an 1865 paper by James Clerk Maxwell. Hendrik Lorentz derived it in 1895, a few years after Heaviside.\n\nEquation\n\nCharged particle\n\nThe force F acting on a particle of electric charge q with instantaneous velocity v, due to an external electric field E and magnetic field B, is given by (in SI units):\n\nwhere × is the vector cross product. All boldface quantities are vectors. More explicitly stated:\n\n\\mathbf{F}(\\mathbf{r},\\mathbf{\\dot{r}},t,q) = q[\\mathbf{E}(\\mathbf{r},t) + \\mathbf{\\dot{r}} \\times \\mathbf{B}(\\mathbf{r},t)]\n\nin which r is the position vector of the charged particle, t is time, and the overdot is a time derivative.\n\nA positively charged particle will be accelerated in the same linear orientation as the E field, but will curve perpendicularly to both the instantaneous velocity vector v and the B field according to the right-hand rule (in detail, if the fingers of the right hand are extended to point in the direction of v and are then curled to point in the direction of B, then the extended thumb will point in the direction of F).\n\nThe term qE is called the electric force, while the term qv × B is called the magnetic force.See Griffiths, page 204. According to some definitions, the term \"Lorentz force\" refers specifically to the formula for the magnetic force,For example, see the [http://ilorentz.org/history/lorentz/lorentz.html website of the Lorentz Institute] or Griffiths. with the total electromagnetic force (including the electric force) given some other (nonstandard) name. This article will not follow this nomenclature: In what follows, the term \"Lorentz force\" will refer to the expression for the total force.\n\nThe magnetic force component of the Lorentz force manifests itself as the force that acts on a current-carrying wire in a magnetic field. In that context, it is also called the Laplace force.\n\nThe Lorentz force is a force exerted by the electromagnetic field on the charged particle, that is, it is the rate at which linear momentum is transferred from the electromagnetic field to the particle. Associated with it is the power which is the rate at which energy is transferred from the electromagnetic field to the particle. That power is\n\\mathbf{v} \\cdot \\mathbf{F} = q \\, \\mathbf{v} \\cdot \\mathbf{E}.\nNotice that the magnetic field does not contribute to the power because the magnetic force is always perpendicular to the velocity of the particle.\n\nContinuous charge distribution\n\nFor a continuous charge distribution in motion, the Lorentz force equation becomes:\n\n\\mathrm{d}\\mathbf{F} = \\mathrm{d}q\\left(\\mathbf{E} + \\mathbf{v} \\times \\mathbf{B}\\right)\\,\\!\n\nwhere dF is the force on a small piece of the charge distribution with charge dq. If both sides of this equation are divided by the volume of this small piece of the charge distribution dV, the result is:\n\n\\mathbf{f} = \\rho\\left(\\mathbf{E} + \\mathbf{v} \\times \\mathbf{B}\\right)\\,\\!\n\nwhere f is the force density (force per unit volume) and ρ is the charge density (charge per unit volume). Next, the current density corresponding to the motion of the charge continuum is\n\n\\mathbf{J} = \\rho \\mathbf{v} \\,\\!\n\nso the continuous analogue to the equation is\n\nThe total force is the volume integral over the charge distribution:\n\n \\mathbf{F} = \\iiint \\! ( \\rho \\mathbf{E} + \\mathbf{J} \\times \\mathbf{B} )\\,\\mathrm{d}V. \\,\\!\n\nBy eliminating ρ and J, using Maxwell's equations, and manipulating using the theorems of vector calculus, this form of the equation can be used to derive the Maxwell stress tensor σ, in turn this can be combined with the Poynting vector S to obtain the electromagnetic stress–energy tensor T used in general relativity.\n\nIn terms of σ and S, another way to write the Lorentz force (per unit volume) is\n\n \\mathbf{f} = \\nabla\\cdot\\boldsymbol{\\sigma} - \\dfrac{1}{c^2} \\dfrac{\\partial \\mathbf{S}}{\\partial t}  \\,\\!\n\nwhere c is the speed of light and ∇· denotes the divergence of a tensor field. Rather than the amount of charge and its velocity in electric and magnetic fields, this equation relates the energy flux (flow of energy per unit time per unit distance) in the fields to the force exerted on a charge distribution. See Covariant formulation of classical electromagnetism for more details.\n\nThe density of power associated with the Lorentz force in a material medium is\n\\mathbf{J} \\cdot \\mathbf{E}.\n\nIf we separate the total charge and total current into their free and bound parts, we get that the density of the Lorentz force is\n\\mathbf{f} = (\\rho_f - \\nabla \\cdot \\mathbf P) \\mathbf{E} + (\\mathbf{J}_f + \\nabla\\times\\mathbf{M} + \\frac{\\partial\\mathbf{P}}{\\partial t}) \\times \\mathbf{B}.\n\nwhere: ρf is the density of free charge; P is the polarization density; Jf is the density of free current; and M is the magnetization density. In this way, the Lorentz force can explain the torque applied to a permanent magnet by the magnetic field. The density of the associated power is\n(\\mathbf{J}_f + \\nabla\\times\\mathbf{M} + \\frac{\\partial\\mathbf{P}}{\\partial t}) \\cdot \\mathbf{E}.\n\nEquation in cgs units\n\nThe above-mentioned formulae use SI units which are the most common among experimentalists, technicians, and engineers. In cgs-Gaussian units, which are somewhat more common among theoretical physicists, one has instead\n\\mathbf{F} = q_\\mathrm{cgs} \\left(\\mathbf{E}_\\mathrm{cgs} + \\frac{\\mathbf{v}}{c} \\times \\mathbf{B}_\\mathrm{cgs}\\right).\nwhere c is the speed of light. \nAlthough this equation looks slightly different, it is completely equivalent, since\none has the following relations:\n\nq_\\mathrm{cgs}\\frac{q_\\mathrm{SI}}{\\sqrt{4\\pi \\epsilon_0}},\\quad \\mathbf E_\\mathrm{cgs} \n\\sqrt{4\\pi\\epsilon_0}\\,\\mathbf E_\\mathrm{SI},\\quad \\mathbf B_\\mathrm{cgs} {\\sqrt{4\\pi /\\mu_0}}\\,{\\mathbf B_\\mathrm{SI}},\\quad c\n\\frac{1}{\\sqrt{ \\epsilon_0\\mu_0}}.\n\nwhere ε0 is the vacuum permittivity and μ0 the vacuum permeability. In practice, the subscripts \"cgs\" and \"SI\" are always omitted, and the unit system has to be assessed from context.\n\nHistory\n\nEarly attempts to quantitatively describe the electromagnetic force were made in the mid-18th century. It was proposed that the force on magnetic poles, by Johann Tobias Mayer and others in 1760,\n and electrically charged objects, by Henry Cavendish in 1762,\n obeyed an inverse-square law. However, in both cases the experimental proof was neither complete nor conclusive. It was not until 1784 when Charles-Augustin de Coulomb, using a torsion balance, was able to definitively show through experiment that this was true.\n Soon after the discovery in 1820 by H. C. Ørsted that a magnetic needle is acted on by a voltaic current, André-Marie Ampère that same year was able to devise through experimentation the formula for the angular dependence of the force between two current elements.\n\n In all these descriptions, the force was always given in terms of the properties of the objects involved and the distances between them rather than in terms of electric and magnetic fields.\n\nThe modern concept of electric and magnetic fields first arose in the theories of Michael Faraday, particularly his idea of lines of force, later to be given full mathematical description by Lord Kelvin and James Clerk Maxwell.\n From a modern perspective it is possible to identify in Maxwell's 1865 formulation of his field equations a form of the Lorentz force equation in relation to electric currents,\n however, in the time of Maxwell it was not evident how his equations related to the forces on moving charged objects. J. J. Thomson was the first to attempt to derive from Maxwell's field equations the electromagnetic forces on a moving charged object in terms of the object's properties and external fields. Interested in determining the electromagnetic behavior of the charged particles in cathode rays, Thomson published a paper in 1881 wherein he gave the force on the particles due to an external magnetic field asPaul J. Nahin, [https://books.google.com/books?id\ne9wEntQmA0IC&source=gbs_navlinks_s Oliver Heaviside], JHU Press, 2002.\n\\mathbf{F} = \\frac{q}{2}\\mathbf{v} \\times \\mathbf{B}.\nThomson derived the correct basic form of the formula, but, because of some miscalculations and an incomplete description of the displacement current, included an incorrect scale-factor of a half in front of the formula.  Oliver Heaviside invented the modern vector notation and applied it to Maxwell's field equations; he also (in 1885 and 1889) had fixed the mistakes of Thomson's derivation and arrived at the correct form of the magnetic force on a moving charged object.\n Finally, in 1895,Per F. Dahl, Flash of the Cathode Rays: A History of J J Thomson's Electron, CRC Press, 1997, p. 10.Lorentz, Hendrik Antoon, Versuch einer Theorie der electrischen und optischen Erscheinungen in bewegten Körpern, 1895. Hendrik Lorentz derived the modern form of the formula for the electromagnetic force which includes the contributions to the total force from both the electric and the magnetic fields. Lorentz began by abandoning the Maxwellian descriptions of the ether and conduction. Instead, Lorentz made a distinction between matter and the luminiferous aether and sought to apply the Maxwell equations at a microscopic scale. Using Heaviside's version of the Maxwell equations for a stationary ether and applying Lagrangian mechanics (see below), Lorentz arrived at the correct and complete form of the force law that now bears his name.\n\nTrajectories of particles due to the Lorentz force\n\nIn many cases of practical interest, the motion in a magnetic field of an electrically charged particle (such as an electron or ion in a plasma) can be treated as the superposition of a relatively fast circular motion around a point called the guiding center and a relatively slow drift of this point. The drift speeds may differ for various species depending on their charge states, masses, or temperatures, possibly resulting in electric currents or chemical separation.\n\nSignificance of the Lorentz force\n\nWhile the modern Maxwell's equations describe how electrically charged particles and currents or moving charged particles give rise to electric and magnetic fields, the Lorentz force law completes that picture by describing the force acting on a moving point charge q in the presence of electromagnetic fields.See Jackson, page 2. The book lists the four modern Maxwell's equations, and then states, \"Also essential for consideration of charged particle motion is the Lorentz force equation, F \n q (E+ v × B), which gives the force acting on a point charge q in the presence of electromagnetic fields.\"See Griffiths, page 326, which states that Maxwell's equations, \"together with the [Lorentz] force law...summarize the entire theoretical content of classical electrodynamics\". The Lorentz force law describes the effect of E and B upon a point charge, but such electromagnetic forces are not the entire picture. Charged particles are possibly coupled to other forces, notably gravity and nuclear forces. Thus, Maxwell's equations do not stand separate from other physical laws, but are coupled to them via the charge and current densities. The response of a point charge to the Lorentz law is one aspect; the generation of E and B by currents and charges is another.\n\nIn real materials the Lorentz force is inadequate to describe the collective behavior of charged particles, both in principle and as a matter of computation. The charged particles in a material medium not only respond to the E and B fields but also generate these fields. Complex transport equations must be solved to determine the time and spatial response of charges, for example, the Boltzmann equation or the Fokker–Planck equation or the Navier–Stokes equations. For example, see magnetohydrodynamics, fluid dynamics, electrohydrodynamics, superconductivity, stellar evolution. An entire physical apparatus for dealing with these matters has developed. See for example, Green–Kubo relations and Green's function (many-body theory).\n\nLorentz force law as the definition of E and B\n\nIn many textbook treatments of classical electromagnetism, the Lorentz force Law is used as the definition of the electric and magnetic fields E and B.See, for example, Jackson, pp. 777–8.. These authors use the Lorentz force in tensor form as definer of the electromagnetic tensor F, in turn the fields E and B. To be specific, the Lorentz force is understood to be the following empirical statement:\n\nThe electromagnetic force F on a test charge at a given point and time is a certain function of its charge q and velocity v, which can be parameterized by exactly two vectors E and B, in the functional form:\n\n:\\mathbf{F}=q(\\mathbf{E}+\\mathbf{v}\\times\\mathbf{B})\n\nThis is valid, even for particles approaching the speed of light (that is, magnitude of v = |v| ≈ c). So the two vector fields E and B are thereby defined throughout space and time, and these are called the \"electric field\" and \"magnetic field\". The fields are defined everywhere in space and time with respect to what force a test charge would receive regardless of whether a charge is present to experience the force.\n\nAs a definition of E and B, the Lorentz force is only a definition in principle because a real particle (as opposed to the hypothetical \"test charge\" of infinitesimally-small mass and charge) would generate its own finite E and B fields, which would alter the electromagnetic force that it experiences. In addition, if the charge experiences acceleration, as if forced into a curved trajectory by some external agency, it emits radiation that causes braking of its motion. See for example Bremsstrahlung and synchrotron light. These effects occur through both a direct effect (called the radiation reaction force) and indirectly (by affecting the motion of nearby charges and currents). Moreover, net force must include gravity, electroweak, and any other forces aside from electromagnetic force.\n\nForce on a current-carrying wire\n\nWhen a wire carrying an electric current is placed in a magnetic field, each of the moving charges, which comprise the current, experiences the Lorentz force, and together they can create a macroscopic force on the wire (sometimes called the Laplace force). By combining the Lorentz force law above with the definition of electric current, the following equation results, in the case of a straight, stationary wire:\n\\mathbf{F} = I \\boldsymbol{\\ell} \\times \\mathbf{B}\n\nwhere ℓ is a vector whose magnitude is the length of wire, and whose direction is along the wire, aligned with the direction of conventional current flow I.\n\nIf the wire is not straight but curved, the force on it can be computed by applying this formula to each infinitesimal segment of wire dℓ, then adding up all these forces by integration. Formally, the net force on a stationary, rigid wire carrying a steady current I is\n\n\\mathbf{F} = I\\int \\mathrm{d}\\boldsymbol{\\ell}\\times \\mathbf{B}\n\nThis is the net force. In addition, there will usually be torque, plus other effects if the wire is not perfectly rigid.\n\nOne application of this is Ampère's force law, which describes how two current-carrying wires can attract or repel each other, since each experiences a Lorentz force from the other's magnetic field. For more information, see the article: Ampère's force law.\n\nEMF\n\nThe magnetic force () component of the Lorentz force is responsible for motional electromotive force (or motional EMF), the phenomenon underlying many electrical generators. When a conductor is moved through a magnetic field, the magnetic field exerts opposite forces on electrons and nuclei in the wire, and this creates the EMF. The term \"motional EMF\" is applied to this phenomenon, since the EMF is due to the motion of the wire.\n\nIn other electrical generators, the magnets move, while the conductors do not. In this case, the EMF is due to the electric force (qE) term in the Lorentz Force equation. The electric field in question is created by the changing magnetic field, resulting in an induced EMF, as described by the Maxwell–Faraday equation (one of the four modern Maxwell's equations).See Griffiths, pages 301–3.\n\nBoth of these EMFs, despite their apparently distinct origins, are described by the same equation, namely, the EMF is the rate of change of magnetic flux through the wire. (This is Faraday's law of induction, see below.) Einstein's special theory of relativity was partially motivated by the desire to better understand this link between the two effects. In fact, the electric and magnetic fields are different facets of the same electromagnetic field, and in moving from one inertial frame to another, the solenoidal vector field portion of the E-field can change in whole or in part to a B-field or vice versa.\n\nLorentz force and Faraday's law of induction\n\nGiven a loop of wire in a magnetic field, Faraday's law of induction states the induced electromotive force (EMF) in the wire is:\n\n\\mathcal{E} = -\\frac{\\mathrm{d}\\Phi_B}{\\mathrm{d}t}\n\nwhere\n\n \\Phi_B = \\iint_{\\Sigma(t)} \\mathrm{d} \\mathbf{A} \\cdot \\mathbf{B}(\\mathbf{r}, t)\n\nis the magnetic flux through the loop, B is the magnetic field, Σ(t) is a surface bounded by the closed contour ∂Σ(t), at all at time t, dA is an infinitesimal vector area element of Σ(t) (magnitude is the area of an infinitesimal patch of surface, direction is orthogonal to that surface patch).\n\nThe sign of the EMF is determined by Lenz's law. Note that this is valid for not only a stationary wirebut also for a moving wire.\n\nFrom Faraday's law of induction (that is valid for a moving wire, for instance in a motor) and the Maxwell Equations, the Lorentz Force can be deduced. The reverse is also true, the Lorentz force and the Maxwell Equations can be used to derive the Faraday Law.\n\nLet Σ(t) be the moving wire, moving together without rotation and with constant velocity v and Σ(t) be the internal surface of the wire. The EMF around the closed path ∂Σ(t) is given by:\n\n\\mathcal{E} =\\oint_{\\part \\Sigma (t)} \\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{F} / q\n\nwhere\n\n\\mathbf{E} = \\mathbf{F} / q\n\nis the electric field and dℓ is an infinitesimal vector element of the contour ∂Σ(t).\n\nNB: Both dℓ and dA have a sign ambiguity; to get the correct sign, the right-hand rule is used, as explained in the article Kelvin–Stokes theorem.\n\nThe above result can be compared with the version of Faraday's law of induction that appears in the modern Maxwell's equations, called here the Maxwell–Faraday equation:\n\n\\nabla \\times \\mathbf{E} = -\\frac{\\partial \\mathbf{B}}{\\partial t} \\ .\n\nThe Maxwell–Faraday equation also can be written in an integral form using the Kelvin–Stokes theorem.\n\nSo we have, the Maxwell Faraday equation:\n\n \\oint_{\\partial \\Sigma(t)}\\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{E}(\\mathbf{r},\\ t) = - \\  \\iint_{\\Sigma(t)}  \\mathrm{d} \\mathbf {A} \\cdot {\\mathrm{d}t}  \\iint_{\\Sigma(t)}  \\mathrm{d} \\mathbf {A} \\cdot \\mathbf{B}(\\mathbf{r},\\ t). \n\nThe two are equivalent if the wire is not moving. Using the Leibniz integral rule and that div B = 0, results in,\n\n \\oint_{\\partial \\Sigma(t)} \\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{F}/q(\\mathbf{r}, t) = \n- \\iint_{\\Sigma(t)}  \\mathrm{d} \\mathbf{A} \\cdot \\frac{\\partial}{\\partial t} \\mathbf{B}(\\mathbf{r}, t) +\n\\oint_{\\partial \\Sigma(t)} \\!\\!\\!\\!\\mathbf{v} \\times \\mathbf{B} \\,\\mathrm{d} \\boldsymbol{\\ell}\n\nand using the Maxwell Faraday equation,\n\n \\oint_{\\partial \\Sigma(t)} \\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{F}/q(\\mathbf{r},\\ t) = \n\\oint_{\\partial \\Sigma(t)} \\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{E}(\\mathbf{r},\\ t)  +\n\\oint_{\\partial \\Sigma(t)}\\!\\!\\!\\! \\mathbf{v} \\times \\mathbf{B}(\\mathbf{r},\\ t)\\, \\mathrm{d} \\boldsymbol{\\ell}\n\nsince this is valid for any wire position it implies that,\n\n \\mathbf{F}= q\\,\\mathbf{E}(\\mathbf{r},\\ t)  + q\\,\\mathbf{v} \\times \\mathbf{B}(\\mathbf{r},\\ t).\n\nFaraday's law of induction holds whether the loop of wire is rigid and stationary, or in motion or in process of deformation, and it holds whether the magnetic field is constant in time or changing. However, there are cases where Faraday's law is either inadequate or difficult to use, and application of the underlying Lorentz force law is necessary. See inapplicability of Faraday's law.\n\nIf the magnetic field is fixed in time and the conducting loop moves through the field, the magnetic flux ΦB linking the loop can change in several ways. For example, if the B-field varies with position, and the loop moves to a location with different B-field, ΦB will change. Alternatively, if the loop changes orientation with respect to the B-field, the  differential element will change because of the different angle between B and dA, also changing ΦB. As a third example, if a portion of the circuit is swept through a uniform, time-independent B-field, and another portion of the circuit is held stationary, the flux linking the entire closed circuit can change due to the shift in relative position of the circuit's component parts with time (surface ∂Σ(t) time-dependent). In all three cases, Faraday's law of induction then predicts the EMF generated by the change in ΦB.\n\nNote that the Maxwell Faraday's equation implies that the Electric Field E is non conservative when the Magnetic Field B varies in time, and is not expressible as the gradient of a scalar field, and not subject to the gradient theorem since its rotational is not zero.\n\nLorentz force in terms of potentials\n\nThe E and B fields can be replaced by the magnetic vector potential A and (scalar) electrostatic potential ϕ  by\n\n \\mathbf{E} = - \\nabla \\phi - \\frac { \\partial \\mathbf{A} } { \\partial t }\n\\mathbf{B} = \\nabla \\times \\mathbf{A}\n\nwhere ∇ is the gradient, ∇⋅ is the divergence, ∇× is the curl.\n\nThe force becomes\n\n\\mathbf{F} = q\\left[-\\nabla \\phi- \\frac{\\partial \\mathbf{A}}{\\partial t}+\\mathbf{v}\\times(\\nabla\\times\\mathbf{A})\\right]\n\nand using an identity for the triple product simplifies to\n\n{\\partial t}+ \\nabla(\\mathbf{v}\\cdot\\mathbf{A})-(\\mathbf{v}\\cdot\\nabla)\\mathbf{A} \\right]\n|cellpadding= 6\n|border\n|border colour = #0073CF\n|background colour=#F5FFFA}}\n\nusing the chain rule, the total derivative of A is:\n\n\\frac{\\mathrm{d}\\mathbf{A}}{\\mathrm{d}t} = \\frac{\\partial\\mathbf{A}}{\\partial t}+(\\mathbf{v}\\cdot\\nabla)\\mathbf{A} \n\nso the above expression can be rewritten as;\n\n\\mathbf{F} = q\\left[-\\nabla (\\phi-\\mathbf{v}\\cdot\\mathbf{A})- \\frac{d\\mathbf{A}}{\\mathrm{d}t}\\right]\n\nwhich can take the convenient Euler–Lagrange form\n\n(\\phi-\\dot{\\mathbf{x}}\\cdot\\mathbf{A})+ \\frac{\\mathrm{d}}{\\mathrm{d}t}\\nabla_{\\dot{\\mathbf{x}}}(\\phi-\\dot{\\mathbf{x}}\\cdot\\mathbf{A})\\right]\n|cellpadding= 6\n|border\n|border colour = #0073CF\n|background colour=#F5FFFA}}\n\nLorentz force and analytical mechanics\n\nThe Lagrangian for a charged particle of mass m and charge q in an electromagnetic field equivalently describes the dynamics of the particle in terms of its energy, rather than the force exerted on it. The classical expression is given by:Classical Mechanics (2nd Edition), T.W.B. Kibble, European Physics Series, McGraw Hill (UK), 1973, .\n\nL=\\frac{m}{2}\\mathbf{\\dot{r}}\\cdot\\mathbf{\\dot{r}}+q\\mathbf{A}\\cdot\\mathbf{\\dot{r}}-q\\phi\n\nwhere A and ϕ are the potential fields as above. Using Lagrange's equations, the equation for the Lorentz force can be obtained.\n\nThe potential energy depends on the velocity of the particle, so the force is velocity dependent, so it is not conservative.\n\nThe relativistic Lagrangian is\n\nL = -mc^2\\sqrt{1-\\left(\\frac{\\dot{\\mathbf{r}}}{c}\\right)^2} + q \\mathbf{A}(\\mathbf{r})\\cdot\\dot{\\mathbf{r}} - q \\phi(\\mathbf{r}) \\,\\!\n\nThe action is the relativistic arclength of the path of the particle in space time, minus the potential energy contribution, plus an extra contribution which quantum mechanically is an extra phase a charged particle gets when it is moving along a vector potential.\n\nRelativistic form of the Lorentz force\n\nCovariant form of the Lorentz force\n\nField tensor\n\nUsing the metric signature , the Lorentz force for a charge q can be written inJackson, J.D. Chapter 11 covariant form:\n\nwhere pα is the four-momentum, defined as\n\np^\\alpha \\left(p_0, p_1, p_2, p_3 \\right) \n \\left(\\gamma m c, p_x, p_y, p_z \\right) \\, ,\n\nτ the proper time of the particle, Fαβ the contravariant electromagnetic tensor\n\nF^{\\alpha \\beta} = \\begin{pmatrix}\n0 & -E_x/c & -E_y/c & -E_z/c \\\\\nE_x/c & 0 & -B_z & B_y \\\\\nE_y/c & B_z & 0 & -B_x \\\\\nE_z/c & -B_y & B_x & 0\n\\end{pmatrix}\n\nand U is the covariant 4-velocity of the particle, defined as:\n\nU_\\beta \\left(U_0, U_1, U_2, U_3 \\right) \n \\gamma \\left(c, -v_x, -v_y, -v_z \\right) \\, ,\n\nin which\n\n\\gamma(v)\\frac{1}{\\sqrt{1- \\frac{v^2}{c^2}}}\n\\frac{1}{\\sqrt{1- \\frac{v_x^2 + v_y^2+ v_z^2}{c^2}}}\n\nis the Lorentz factor.\n\nThe fields are transformed to a frame moving with constant relative velocity by:\n\n F'^{\\mu \\nu} = {\\Lambda^{\\mu}}_{\\alpha} {\\Lambda^{\\nu}}_{\\beta} F^{\\alpha \\beta} \\, ,\n\nwhere Λμα is the Lorentz transformation tensor.\n\nTranslation to vector notation\n\nThe  component (x-component) of the force is\n \\frac{\\mathrm{d} p^1}{\\mathrm{d} \\tau} q U_\\beta F^{1 \\beta} \n q\\left(U_0 F^{10} + U_1 F^{11} + U_2 F^{12} + U_3 F^{13} \\right) .\n\nSubstituting the components of the covariant electromagnetic tensor F yields\n\n \\frac{\\mathrm{d} p^1}{\\mathrm{d} \\tau} = q \\left[U_0 \\left(\\frac{E_x}{c} \\right) + U_2 (-B_z) + U_3 (B_y) \\right] .\n\nUsing the components of covariant four-velocity yields\n\n \\begin{align}\n \\frac{\\mathrm{d} p^1}{\\mathrm{d} \\tau} & = q \\gamma \\left[c \\left(\\frac{E_x}{c} \\right) + (-v_y) (-B_z) + (-v_z) (B_y) \\right] \\\\\n &= q \\gamma \\left(E_x + v_y B_z - v_z B_y \\right) \\\\\n & = q \\gamma \\left[ E_x + \\left( \\mathbf{v} \\times \\mathbf{B} \\right)_x \\right] \\, .\n\\end{align} \n\nThe calculation for , 3 (force components in the y and z directions) yields similar results, so collecting the 3 equations into one:\n\n \\frac{\\mathrm{d} \\mathbf{p} }{\\mathrm{d} \\tau} = q \\gamma\\left( \\mathbf{E} + \\mathbf{v} \\times \\mathbf{B} \\right) \\, , \n\nand since differentials in coordinate time dt and proper time dτ are related by the Lorentz factor,\n\ndt=\\gamma(v)d\\tau\\,,\n\nso we arrive at\n\n \\frac{\\mathrm{d} \\mathbf{p} }{\\mathrm{d} t} = q \\left( \\mathbf{E} + \\mathbf{v} \\times \\mathbf{B} \\right)\\, .\n\nThis is precisely the Lorentz force law, however, it is important to note that p is the relativistic expression,\n\n\\mathbf{p}=\\gamma(v) m_0 \\mathbf{v} \\,.\n\nLorentz force in spacetime algebra (STA)\n\nThe electric and magnetic fields are dependent on the velocity of an observer, so the relativistic form of the Lorentz force law can best be exhibited starting from a coordinate-independent expression for the electromagnetic and magnetic fields  \\mathcal{F}, and an arbitrary time-direction, \\gamma_0. This can be settled through Space-Time Algebra (or the geometric algebra of space-time), a type of Clifford's Algebra defined on a pseudo-Euclidean space, as\n\n\\mathbf{E} = (\\mathcal{F}\\cdot\\gamma_0)\\gamma_0\n\nand\n\ni\\mathbf{B} = (\\mathcal{F}\\wedge\\gamma_0)\\gamma_0\n\n\\mathcal F is a space-time bivector (an oriented plane segment, just like a vector is an oriented line segment), which has six degrees of freedom corresponding to boosts (rotations in space-time planes) and rotations (rotations in space-space planes).  The dot product with the vector \\gamma_0 pulls a vector (in the space algebra) from the translational part, while the wedge-product creates a trivector (in the space algebra) who is dual to a vector which is the usual magnetic field vector.\nThe relativistic velocity is given by the (time-like) changes in a time-position vector v=\\dot x, where\n\nv^2 = 1,\n\n(which shows our choice for the metric) and the velocity is\n\n\\mathbf{v} = cv \\wedge \\gamma_0 / (v \\cdot \\gamma_0).\n\nThe proper (invariant is an inadequate term because no transformation has been defined) form of the Lorentz force law is simply\n\nNote that the order is important because between a bivector and a vector the dot product is anti-symmetric. Upon a space time split like one can obtain the velocity, and fields as above yielding the usual expression.\n\nLorentz force in general relativity\n\nIn the general theory of relativity the equation of motion for a particle with mass m and charge e, moving in a space with metric tensor g_{ab} and electromagnetic field F_{ab}, is given as\n\nm\\frac{du_c}{ds}-m\\frac{1}{2}g_{ab,c}u^au^b=eF_{cb}u^b \\;,\n\nwhere u^adx^a/ds (dx^a is taken along the trajectory), g_{ab,c}\n \\partial g_{ab}/\\partial x^c, and ds^2=g_{ab}dx^adx^b.\n\nThe equation can also be written as\n\nm\\frac{du_c}{ds}-m\\Gamma_{abc}u^au^b=eF_{cb}u^b \\;,\n\nwhere \\Gamma_{abc} is the Christoffel symbol (of the torsion-free metric connection in general relativity), or as\n\nm\\frac{Du_c}{ds}=eF_{cb}u^b \\;,\n\nwhere D is the covariant differential in general relativity (metric, torsion-free).\n\nApplications\n\nThe Lorentz force occurs in many devices, including:\n*Cyclotrons and other circular path particle accelerators\n*Mass spectrometers\n*Velocity Filters\n*Magnetrons\n*Lorentz force velocimetry\n\nIn its manifestation as the Laplace force on an electric current in a conductor, this force occurs in many devices including:\n\n*Electric motors\n*Railguns\n*Linear motors\n*Loudspeakers\n*Magnetoplasmadynamic thrusters\n*Electrical generators\n*Homopolar generators\n*Linear alternators",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lorentz force" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18631" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In physics (particularly in electromagnetism) the Lorentz force is the combination of electric and magnetic force on a point charge due to electromagnetic fields. A particle of charge q moving with velocity v in the presence of an electric field E and a magnetic field B experiences a force\n\\mathbf{F} = q\\mathbf{E} + q\\mathbf{v} \\times \\mathbf{B}\n(in SI unitsIn SI units,  is measured in teslas (symbol: T). In Gaussian-cgs units,  is measured in gauss (symbol: G). See e.g. )The -field is measured in amperes per metre (A/m) in SI units, and in oersteds (Oe) in cgs units. ). Variations on this basic formula describe the magnetic force on a current-carrying wire (sometimes called Laplace force), the electromotive force in a wire loop moving through a magnetic field (an aspect of Faraday's law of induction), and the force on a charged particle which might be traveling near the speed of light (relativistic form of the Lorentz force).\n\nThe first derivation of the Lorentz force is commonly attributed to Oliver Heaviside in 1889, although other historians suggest an earlier origin in an 1865 paper by James Clerk Maxwell. Hendrik Lorentz derived it in 1895, a few years after Heaviside.\n\nEquation\n\nCharged particle\n\nThe force F acting on a particle of electric charge q with instantaneous velocity v, due to an external electric field E and magnetic field B, is given by (in SI units):\n\nwhere × is the vector cross product. All boldface quantities are vectors. More explicitly stated:\n\n\\mathbf{F}(\\mathbf{r},\\mathbf{\\dot{r}},t,q) = q[\\mathbf{E}(\\mathbf{r},t) + \\mathbf{\\dot{r}} \\times \\mathbf{B}(\\mathbf{r},t)]\n\nin which r is the position vector of the charged particle, t is time, and the overdot is a time derivative.\n\nA positively charged particle will be accelerated in the same linear orientation as the E field, but will curve perpendicularly to both the instantaneous velocity vector v and the B field according to the right-hand rule (in detail, if the fingers of the right hand are extended to point in the direction of v and are then curled to point in the direction of B, then the extended thumb will point in the direction of F).\n\nThe term qE is called the electric force, while the term qv × B is called the magnetic force.See Griffiths, page 204. According to some definitions, the term \"Lorentz force\" refers specifically to the formula for the magnetic force,For example, see the [http://ilorentz.org/history/lorentz/lorentz.html website of the Lorentz Institute] or Griffiths. with the total electromagnetic force (including the electric force) given some other (nonstandard) name. This article will not follow this nomenclature: In what follows, the term \"Lorentz force\" will refer to the expression for the total force.\n\nThe magnetic force component of the Lorentz force manifests itself as the force that acts on a current-carrying wire in a magnetic field. In that context, it is also called the Laplace force.\n\nThe Lorentz force is a force exerted by the electromagnetic field on the charged particle, that is, it is the rate at which linear momentum is transferred from the electromagnetic field to the particle. Associated with it is the power which is the rate at which energy is transferred from the electromagnetic field to the particle. That power is\n\\mathbf{v} \\cdot \\mathbf{F} = q \\, \\mathbf{v} \\cdot \\mathbf{E}.\nNotice that the magnetic field does not contribute to the power because the magnetic force is always perpendicular to the velocity of the particle.\n\nContinuous charge distribution\n\nFor a continuous charge distribution in motion, the Lorentz force equation becomes:\n\n\\mathrm{d}\\mathbf{F} = \\mathrm{d}q\\left(\\mathbf{E} + \\mathbf{v} \\times \\mathbf{B}\\right)\\,\\!\n\nwhere dF is the force on a small piece of the charge distribution with charge dq. If both sides of this equation are divided by the volume of this small piece of the charge distribution dV, the result is:\n\n\\mathbf{f} = \\rho\\left(\\mathbf{E} + \\mathbf{v} \\times \\mathbf{B}\\right)\\,\\!\n\nwhere f is the force density (force per unit volume) and ρ is the charge density (charge per unit volume). Next, the current density corresponding to the motion of the charge continuum is\n\n\\mathbf{J} = \\rho \\mathbf{v} \\,\\!\n\nso the continuous analogue to the equation is\n\nThe total force is the volume integral over the charge distribution:\n\n \\mathbf{F} = \\iiint \\! ( \\rho \\mathbf{E} + \\mathbf{J} \\times \\mathbf{B} )\\,\\mathrm{d}V. \\,\\!\n\nBy eliminating ρ and J, using Maxwell's equations, and manipulating using the theorems of vector calculus, this form of the equation can be used to derive the Maxwell stress tensor σ, in turn this can be combined with the Poynting vector S to obtain the electromagnetic stress–energy tensor T used in general relativity.\n\nIn terms of σ and S, another way to write the Lorentz force (per unit volume) is\n\n \\mathbf{f} = \\nabla\\cdot\\boldsymbol{\\sigma} - \\dfrac{1}{c^2} \\dfrac{\\partial \\mathbf{S}}{\\partial t}  \\,\\!\n\nwhere c is the speed of light and ∇· denotes the divergence of a tensor field. Rather than the amount of charge and its velocity in electric and magnetic fields, this equation relates the energy flux (flow of energy per unit time per unit distance) in the fields to the force exerted on a charge distribution. See Covariant formulation of classical electromagnetism for more details.\n\nThe density of power associated with the Lorentz force in a material medium is\n\\mathbf{J} \\cdot \\mathbf{E}.\n\nIf we separate the total charge and total current into their free and bound parts, we get that the density of the Lorentz force is\n\\mathbf{f} = (\\rho_f - \\nabla \\cdot \\mathbf P) \\mathbf{E} + (\\mathbf{J}_f + \\nabla\\times\\mathbf{M} + \\frac{\\partial\\mathbf{P}}{\\partial t}) \\times \\mathbf{B}.\n\nwhere: ρf is the density of free charge; P is the polarization density; Jf is the density of free current; and M is the magnetization density. In this way, the Lorentz force can explain the torque applied to a permanent magnet by the magnetic field. The density of the associated power is\n(\\mathbf{J}_f + \\nabla\\times\\mathbf{M} + \\frac{\\partial\\mathbf{P}}{\\partial t}) \\cdot \\mathbf{E}.\n\nEquation in cgs units\n\nThe above-mentioned formulae use SI units which are the most common among experimentalists, technicians, and engineers. In cgs-Gaussian units, which are somewhat more common among theoretical physicists, one has instead\n\\mathbf{F} = q_\\mathrm{cgs} \\left(\\mathbf{E}_\\mathrm{cgs} + \\frac{\\mathbf{v}}{c} \\times \\mathbf{B}_\\mathrm{cgs}\\right).\nwhere c is the speed of light. \nAlthough this equation looks slightly different, it is completely equivalent, since\none has the following relations:\n\nq_\\mathrm{cgs}\\frac{q_\\mathrm{SI}}{\\sqrt{4\\pi \\epsilon_0}},\\quad \\mathbf E_\\mathrm{cgs} \n\\sqrt{4\\pi\\epsilon_0}\\,\\mathbf E_\\mathrm{SI},\\quad \\mathbf B_\\mathrm{cgs} {\\sqrt{4\\pi /\\mu_0}}\\,{\\mathbf B_\\mathrm{SI}},\\quad c\n\\frac{1}{\\sqrt{ \\epsilon_0\\mu_0}}.\n\nwhere ε0 is the vacuum permittivity and μ0 the vacuum permeability. In practice, the subscripts \"cgs\" and \"SI\" are always omitted, and the unit system has to be assessed from context.\n\nHistory\n\nEarly attempts to quantitatively describe the electromagnetic force were made in the mid-18th century. It was proposed that the force on magnetic poles, by Johann Tobias Mayer and others in 1760,\n and electrically charged objects, by Henry Cavendish in 1762,\n obeyed an inverse-square law. However, in both cases the experimental proof was neither complete nor conclusive. It was not until 1784 when Charles-Augustin de Coulomb, using a torsion balance, was able to definitively show through experiment that this was true.\n Soon after the discovery in 1820 by H. C. Ørsted that a magnetic needle is acted on by a voltaic current, André-Marie Ampère that same year was able to devise through experimentation the formula for the angular dependence of the force between two current elements.\n\n In all these descriptions, the force was always given in terms of the properties of the objects involved and the distances between them rather than in terms of electric and magnetic fields.\n\nThe modern concept of electric and magnetic fields first arose in the theories of Michael Faraday, particularly his idea of lines of force, later to be given full mathematical description by Lord Kelvin and James Clerk Maxwell.\n From a modern perspective it is possible to identify in Maxwell's 1865 formulation of his field equations a form of the Lorentz force equation in relation to electric currents,\n however, in the time of Maxwell it was not evident how his equations related to the forces on moving charged objects. J. J. Thomson was the first to attempt to derive from Maxwell's field equations the electromagnetic forces on a moving charged object in terms of the object's properties and external fields. Interested in determining the electromagnetic behavior of the charged particles in cathode rays, Thomson published a paper in 1881 wherein he gave the force on the particles due to an external magnetic field asPaul J. Nahin, [https://books.google.com/books?id\ne9wEntQmA0IC&source=gbs_navlinks_s Oliver Heaviside], JHU Press, 2002.\n\\mathbf{F} = \\frac{q}{2}\\mathbf{v} \\times \\mathbf{B}.\nThomson derived the correct basic form of the formula, but, because of some miscalculations and an incomplete description of the displacement current, included an incorrect scale-factor of a half in front of the formula.  Oliver Heaviside invented the modern vector notation and applied it to Maxwell's field equations; he also (in 1885 and 1889) had fixed the mistakes of Thomson's derivation and arrived at the correct form of the magnetic force on a moving charged object.\n Finally, in 1895,Per F. Dahl, Flash of the Cathode Rays: A History of J J Thomson's Electron, CRC Press, 1997, p. 10.Lorentz, Hendrik Antoon, Versuch einer Theorie der electrischen und optischen Erscheinungen in bewegten Körpern, 1895. Hendrik Lorentz derived the modern form of the formula for the electromagnetic force which includes the contributions to the total force from both the electric and the magnetic fields. Lorentz began by abandoning the Maxwellian descriptions of the ether and conduction. Instead, Lorentz made a distinction between matter and the luminiferous aether and sought to apply the Maxwell equations at a microscopic scale. Using Heaviside's version of the Maxwell equations for a stationary ether and applying Lagrangian mechanics (see below), Lorentz arrived at the correct and complete form of the force law that now bears his name.\n\nTrajectories of particles due to the Lorentz force\n\nIn many cases of practical interest, the motion in a magnetic field of an electrically charged particle (such as an electron or ion in a plasma) can be treated as the superposition of a relatively fast circular motion around a point called the guiding center and a relatively slow drift of this point. The drift speeds may differ for various species depending on their charge states, masses, or temperatures, possibly resulting in electric currents or chemical separation.\n\nSignificance of the Lorentz force\n\nWhile the modern Maxwell's equations describe how electrically charged particles and currents or moving charged particles give rise to electric and magnetic fields, the Lorentz force law completes that picture by describing the force acting on a moving point charge q in the presence of electromagnetic fields.See Jackson, page 2. The book lists the four modern Maxwell's equations, and then states, \"Also essential for consideration of charged particle motion is the Lorentz force equation, F \n q (E+ v × B), which gives the force acting on a point charge q in the presence of electromagnetic fields.\"See Griffiths, page 326, which states that Maxwell's equations, \"together with the [Lorentz] force law...summarize the entire theoretical content of classical electrodynamics\". The Lorentz force law describes the effect of E and B upon a point charge, but such electromagnetic forces are not the entire picture. Charged particles are possibly coupled to other forces, notably gravity and nuclear forces. Thus, Maxwell's equations do not stand separate from other physical laws, but are coupled to them via the charge and current densities. The response of a point charge to the Lorentz law is one aspect; the generation of E and B by currents and charges is another.\n\nIn real materials the Lorentz force is inadequate to describe the collective behavior of charged particles, both in principle and as a matter of computation. The charged particles in a material medium not only respond to the E and B fields but also generate these fields. Complex transport equations must be solved to determine the time and spatial response of charges, for example, the Boltzmann equation or the Fokker–Planck equation or the Navier–Stokes equations. For example, see magnetohydrodynamics, fluid dynamics, electrohydrodynamics, superconductivity, stellar evolution. An entire physical apparatus for dealing with these matters has developed. See for example, Green–Kubo relations and Green's function (many-body theory).\n\nLorentz force law as the definition of E and B\n\nIn many textbook treatments of classical electromagnetism, the Lorentz force Law is used as the definition of the electric and magnetic fields E and B.See, for example, Jackson, pp. 777–8.. These authors use the Lorentz force in tensor form as definer of the electromagnetic tensor F, in turn the fields E and B. To be specific, the Lorentz force is understood to be the following empirical statement:\n\nThe electromagnetic force F on a test charge at a given point and time is a certain function of its charge q and velocity v, which can be parameterized by exactly two vectors E and B, in the functional form:\n\n:\\mathbf{F}=q(\\mathbf{E}+\\mathbf{v}\\times\\mathbf{B})\n\nThis is valid, even for particles approaching the speed of light (that is, magnitude of v = |v| ≈ c). So the two vector fields E and B are thereby defined throughout space and time, and these are called the \"electric field\" and \"magnetic field\". The fields are defined everywhere in space and time with respect to what force a test charge would receive regardless of whether a charge is present to experience the force.\n\nAs a definition of E and B, the Lorentz force is only a definition in principle because a real particle (as opposed to the hypothetical \"test charge\" of infinitesimally-small mass and charge) would generate its own finite E and B fields, which would alter the electromagnetic force that it experiences. In addition, if the charge experiences acceleration, as if forced into a curved trajectory by some external agency, it emits radiation that causes braking of its motion. See for example Bremsstrahlung and synchrotron light. These effects occur through both a direct effect (called the radiation reaction force) and indirectly (by affecting the motion of nearby charges and currents). Moreover, net force must include gravity, electroweak, and any other forces aside from electromagnetic force.\n\nForce on a current-carrying wire\n\nWhen a wire carrying an electric current is placed in a magnetic field, each of the moving charges, which comprise the current, experiences the Lorentz force, and together they can create a macroscopic force on the wire (sometimes called the Laplace force). By combining the Lorentz force law above with the definition of electric current, the following equation results, in the case of a straight, stationary wire:\n\\mathbf{F} = I \\boldsymbol{\\ell} \\times \\mathbf{B}\n\nwhere ℓ is a vector whose magnitude is the length of wire, and whose direction is along the wire, aligned with the direction of conventional current flow I.\n\nIf the wire is not straight but curved, the force on it can be computed by applying this formula to each infinitesimal segment of wire dℓ, then adding up all these forces by integration. Formally, the net force on a stationary, rigid wire carrying a steady current I is\n\n\\mathbf{F} = I\\int \\mathrm{d}\\boldsymbol{\\ell}\\times \\mathbf{B}\n\nThis is the net force. In addition, there will usually be torque, plus other effects if the wire is not perfectly rigid.\n\nOne application of this is Ampère's force law, which describes how two current-carrying wires can attract or repel each other, since each experiences a Lorentz force from the other's magnetic field. For more information, see the article: Ampère's force law.\n\nEMF\n\nThe magnetic force () component of the Lorentz force is responsible for motional electromotive force (or motional EMF), the phenomenon underlying many electrical generators. When a conductor is moved through a magnetic field, the magnetic field exerts opposite forces on electrons and nuclei in the wire, and this creates the EMF. The term \"motional EMF\" is applied to this phenomenon, since the EMF is due to the motion of the wire.\n\nIn other electrical generators, the magnets move, while the conductors do not. In this case, the EMF is due to the electric force (qE) term in the Lorentz Force equation. The electric field in question is created by the changing magnetic field, resulting in an induced EMF, as described by the Maxwell–Faraday equation (one of the four modern Maxwell's equations).See Griffiths, pages 301–3.\n\nBoth of these EMFs, despite their apparently distinct origins, are described by the same equation, namely, the EMF is the rate of change of magnetic flux through the wire. (This is Faraday's law of induction, see below.) Einstein's special theory of relativity was partially motivated by the desire to better understand this link between the two effects. In fact, the electric and magnetic fields are different facets of the same electromagnetic field, and in moving from one inertial frame to another, the solenoidal vector field portion of the E-field can change in whole or in part to a B-field or vice versa.\n\nLorentz force and Faraday's law of induction\n\nGiven a loop of wire in a magnetic field, Faraday's law of induction states the induced electromotive force (EMF) in the wire is:\n\n\\mathcal{E} = -\\frac{\\mathrm{d}\\Phi_B}{\\mathrm{d}t}\n\nwhere\n\n \\Phi_B = \\iint_{\\Sigma(t)} \\mathrm{d} \\mathbf{A} \\cdot \\mathbf{B}(\\mathbf{r}, t)\n\nis the magnetic flux through the loop, B is the magnetic field, Σ(t) is a surface bounded by the closed contour ∂Σ(t), at all at time t, dA is an infinitesimal vector area element of Σ(t) (magnitude is the area of an infinitesimal patch of surface, direction is orthogonal to that surface patch).\n\nThe sign of the EMF is determined by Lenz's law. Note that this is valid for not only a stationary wirebut also for a moving wire.\n\nFrom Faraday's law of induction (that is valid for a moving wire, for instance in a motor) and the Maxwell Equations, the Lorentz Force can be deduced. The reverse is also true, the Lorentz force and the Maxwell Equations can be used to derive the Faraday Law.\n\nLet Σ(t) be the moving wire, moving together without rotation and with constant velocity v and Σ(t) be the internal surface of the wire. The EMF around the closed path ∂Σ(t) is given by:\n\n\\mathcal{E} =\\oint_{\\part \\Sigma (t)} \\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{F} / q\n\nwhere\n\n\\mathbf{E} = \\mathbf{F} / q\n\nis the electric field and dℓ is an infinitesimal vector element of the contour ∂Σ(t).\n\nNB: Both dℓ and dA have a sign ambiguity; to get the correct sign, the right-hand rule is used, as explained in the article Kelvin–Stokes theorem.\n\nThe above result can be compared with the version of Faraday's law of induction that appears in the modern Maxwell's equations, called here the Maxwell–Faraday equation:\n\n\\nabla \\times \\mathbf{E} = -\\frac{\\partial \\mathbf{B}}{\\partial t} \\ .\n\nThe Maxwell–Faraday equation also can be written in an integral form using the Kelvin–Stokes theorem.\n\nSo we have, the Maxwell Faraday equation:\n\n \\oint_{\\partial \\Sigma(t)}\\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{E}(\\mathbf{r},\\ t) = - \\  \\iint_{\\Sigma(t)}  \\mathrm{d} \\mathbf {A} \\cdot {\\mathrm{d}t}  \\iint_{\\Sigma(t)}  \\mathrm{d} \\mathbf {A} \\cdot \\mathbf{B}(\\mathbf{r},\\ t). \n\nThe two are equivalent if the wire is not moving. Using the Leibniz integral rule and that div B = 0, results in,\n\n \\oint_{\\partial \\Sigma(t)} \\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{F}/q(\\mathbf{r}, t) = \n- \\iint_{\\Sigma(t)}  \\mathrm{d} \\mathbf{A} \\cdot \\frac{\\partial}{\\partial t} \\mathbf{B}(\\mathbf{r}, t) +\n\\oint_{\\partial \\Sigma(t)} \\!\\!\\!\\!\\mathbf{v} \\times \\mathbf{B} \\,\\mathrm{d} \\boldsymbol{\\ell}\n\nand using the Maxwell Faraday equation,\n\n \\oint_{\\partial \\Sigma(t)} \\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{F}/q(\\mathbf{r},\\ t) = \n\\oint_{\\partial \\Sigma(t)} \\mathrm{d} \\boldsymbol{\\ell} \\cdot \\mathbf{E}(\\mathbf{r},\\ t)  +\n\\oint_{\\partial \\Sigma(t)}\\!\\!\\!\\! \\mathbf{v} \\times \\mathbf{B}(\\mathbf{r},\\ t)\\, \\mathrm{d} \\boldsymbol{\\ell}\n\nsince this is valid for any wire position it implies that,\n\n \\mathbf{F}= q\\,\\mathbf{E}(\\mathbf{r},\\ t)  + q\\,\\mathbf{v} \\times \\mathbf{B}(\\mathbf{r},\\ t).\n\nFaraday's law of induction holds whether the loop of wire is rigid and stationary, or in motion or in process of deformation, and it holds whether the magnetic field is constant in time or changing. However, there are cases where Faraday's law is either inadequate or difficult to use, and application of the underlying Lorentz force law is necessary. See inapplicability of Faraday's law.\n\nIf the magnetic field is fixed in time and the conducting loop moves through the field, the magnetic flux ΦB linking the loop can change in several ways. For example, if the B-field varies with position, and the loop moves to a location with different B-field, ΦB will change. Alternatively, if the loop changes orientation with respect to the B-field, the  differential element will change because of the different angle between B and dA, also changing ΦB. As a third example, if a portion of the circuit is swept through a uniform, time-independent B-field, and another portion of the circuit is held stationary, the flux linking the entire closed circuit can change due to the shift in relative position of the circuit's component parts with time (surface ∂Σ(t) time-dependent). In all three cases, Faraday's law of induction then predicts the EMF generated by the change in ΦB.\n\nNote that the Maxwell Faraday's equation implies that the Electric Field E is non conservative when the Magnetic Field B varies in time, and is not expressible as the gradient of a scalar field, and not subject to the gradient theorem since its rotational is not zero.\n\nLorentz force in terms of potentials\n\nThe E and B fields can be replaced by the magnetic vector potential A and (scalar) electrostatic potential ϕ  by\n\n \\mathbf{E} = - \\nabla \\phi - \\frac { \\partial \\mathbf{A} } { \\partial t }\n\\mathbf{B} = \\nabla \\times \\mathbf{A}\n\nwhere ∇ is the gradient, ∇⋅ is the divergence, ∇× is the curl.\n\nThe force becomes\n\n\\mathbf{F} = q\\left[-\\nabla \\phi- \\frac{\\partial \\mathbf{A}}{\\partial t}+\\mathbf{v}\\times(\\nabla\\times\\mathbf{A})\\right]\n\nand using an identity for the triple product simplifies to\n\n{\\partial t}+ \\nabla(\\mathbf{v}\\cdot\\mathbf{A})-(\\mathbf{v}\\cdot\\nabla)\\mathbf{A} \\right]\n|cellpadding= 6\n|border\n|border colour = #0073CF\n|background colour=#F5FFFA}}\n\nusing the chain rule, the total derivative of A is:\n\n\\frac{\\mathrm{d}\\mathbf{A}}{\\mathrm{d}t} = \\frac{\\partial\\mathbf{A}}{\\partial t}+(\\mathbf{v}\\cdot\\nabla)\\mathbf{A} \n\nso the above expression can be rewritten as;\n\n\\mathbf{F} = q\\left[-\\nabla (\\phi-\\mathbf{v}\\cdot\\mathbf{A})- \\frac{d\\mathbf{A}}{\\mathrm{d}t}\\right]\n\nwhich can take the convenient Euler–Lagrange form\n\n(\\phi-\\dot{\\mathbf{x}}\\cdot\\mathbf{A})+ \\frac{\\mathrm{d}}{\\mathrm{d}t}\\nabla_{\\dot{\\mathbf{x}}}(\\phi-\\dot{\\mathbf{x}}\\cdot\\mathbf{A})\\right]\n|cellpadding= 6\n|border\n|border colour = #0073CF\n|background colour=#F5FFFA}}\n\nLorentz force and analytical mechanics\n\nThe Lagrangian for a charged particle of mass m and charge q in an electromagnetic field equivalently describes the dynamics of the particle in terms of its energy, rather than the force exerted on it. The classical expression is given by:Classical Mechanics (2nd Edition), T.W.B. Kibble, European Physics Series, McGraw Hill (UK), 1973, .\n\nL=\\frac{m}{2}\\mathbf{\\dot{r}}\\cdot\\mathbf{\\dot{r}}+q\\mathbf{A}\\cdot\\mathbf{\\dot{r}}-q\\phi\n\nwhere A and ϕ are the potential fields as above. Using Lagrange's equations, the equation for the Lorentz force can be obtained.\n\nThe potential energy depends on the velocity of the particle, so the force is velocity dependent, so it is not conservative.\n\nThe relativistic Lagrangian is\n\nL = -mc^2\\sqrt{1-\\left(\\frac{\\dot{\\mathbf{r}}}{c}\\right)^2} + q \\mathbf{A}(\\mathbf{r})\\cdot\\dot{\\mathbf{r}} - q \\phi(\\mathbf{r}) \\,\\!\n\nThe action is the relativistic arclength of the path of the particle in space time, minus the potential energy contribution, plus an extra contribution which quantum mechanically is an extra phase a charged particle gets when it is moving along a vector potential.\n\nRelativistic form of the Lorentz force\n\nCovariant form of the Lorentz force\n\nField tensor\n\nUsing the metric signature , the Lorentz force for a charge q can be written inJackson, J.D. Chapter 11 covariant form:\n\nwhere pα is the four-momentum, defined as\n\np^\\alpha \\left(p_0, p_1, p_2, p_3 \\right) \n \\left(\\gamma m c, p_x, p_y, p_z \\right) \\, ,\n\nτ the proper time of the particle, Fαβ the contravariant electromagnetic tensor\n\nF^{\\alpha \\beta} = \\begin{pmatrix}\n0 & -E_x/c & -E_y/c & -E_z/c \\\\\nE_x/c & 0 & -B_z & B_y \\\\\nE_y/c & B_z & 0 & -B_x \\\\\nE_z/c & -B_y & B_x & 0\n\\end{pmatrix}\n\nand U is the covariant 4-velocity of the particle, defined as:\n\nU_\\beta \\left(U_0, U_1, U_2, U_3 \\right) \n \\gamma \\left(c, -v_x, -v_y, -v_z \\right) \\, ,\n\nin which\n\n\\gamma(v)\\frac{1}{\\sqrt{1- \\frac{v^2}{c^2}}}\n\\frac{1}{\\sqrt{1- \\frac{v_x^2 + v_y^2+ v_z^2}{c^2}}}\n\nis the Lorentz factor.\n\nThe fields are transformed to a frame moving with constant relative velocity by:\n\n F'^{\\mu \\nu} = {\\Lambda^{\\mu}}_{\\alpha} {\\Lambda^{\\nu}}_{\\beta} F^{\\alpha \\beta} \\, ,\n\nwhere Λμα is the Lorentz transformation tensor.\n\nTranslation to vector notation\n\nThe  component (x-component) of the force is\n \\frac{\\mathrm{d} p^1}{\\mathrm{d} \\tau} q U_\\beta F^{1 \\beta} \n q\\left(U_0 F^{10} + U_1 F^{11} + U_2 F^{12} + U_3 F^{13} \\right) .\n\nSubstituting the components of the covariant electromagnetic tensor F yields\n\n \\frac{\\mathrm{d} p^1}{\\mathrm{d} \\tau} = q \\left[U_0 \\left(\\frac{E_x}{c} \\right) + U_2 (-B_z) + U_3 (B_y) \\right] .\n\nUsing the components of covariant four-velocity yields\n\n \\begin{align}\n \\frac{\\mathrm{d} p^1}{\\mathrm{d} \\tau} & = q \\gamma \\left[c \\left(\\frac{E_x}{c} \\right) + (-v_y) (-B_z) + (-v_z) (B_y) \\right] \\\\\n &= q \\gamma \\left(E_x + v_y B_z - v_z B_y \\right) \\\\\n & = q \\gamma \\left[ E_x + \\left( \\mathbf{v} \\times \\mathbf{B} \\right)_x \\right] \\, .\n\\end{align} \n\nThe calculation for , 3 (force components in the y and z directions) yields similar results, so collecting the 3 equations into one:\n\n \\frac{\\mathrm{d} \\mathbf{p} }{\\mathrm{d} \\tau} = q \\gamma\\left( \\mathbf{E} + \\mathbf{v} \\times \\mathbf{B} \\right) \\, , \n\nand since differentials in coordinate time dt and proper time dτ are related by the Lorentz factor,\n\ndt=\\gamma(v)d\\tau\\,,\n\nso we arrive at\n\n \\frac{\\mathrm{d} \\mathbf{p} }{\\mathrm{d} t} = q \\left( \\mathbf{E} + \\mathbf{v} \\times \\mathbf{B} \\right)\\, .\n\nThis is precisely the Lorentz force law, however, it is important to note that p is the relativistic expression,\n\n\\mathbf{p}=\\gamma(v) m_0 \\mathbf{v} \\,.\n\nLorentz force in spacetime algebra (STA)\n\nThe electric and magnetic fields are dependent on the velocity of an observer, so the relativistic form of the Lorentz force law can best be exhibited starting from a coordinate-independent expression for the electromagnetic and magnetic fields  \\mathcal{F}, and an arbitrary time-direction, \\gamma_0. This can be settled through Space-Time Algebra (or the geometric algebra of space-time), a type of Clifford's Algebra defined on a pseudo-Euclidean space, as\n\n\\mathbf{E} = (\\mathcal{F}\\cdot\\gamma_0)\\gamma_0\n\nand\n\ni\\mathbf{B} = (\\mathcal{F}\\wedge\\gamma_0)\\gamma_0\n\n\\mathcal F is a space-time bivector (an oriented plane segment, just like a vector is an oriented line segment), which has six degrees of freedom corresponding to boosts (rotations in space-time planes) and rotations (rotations in space-space planes).  The dot product with the vector \\gamma_0 pulls a vector (in the space algebra) from the translational part, while the wedge-product creates a trivector (in the space algebra) who is dual to a vector which is the usual magnetic field vector.\nThe relativistic velocity is given by the (time-like) changes in a time-position vector v=\\dot x, where\n\nv^2 = 1,\n\n(which shows our choice for the metric) and the velocity is\n\n\\mathbf{v} = cv \\wedge \\gamma_0 / (v \\cdot \\gamma_0).\n\nThe proper (invariant is an inadequate term because no transformation has been defined) form of the Lorentz force law is simply\n\nNote that the order is important because between a bivector and a vector the dot product is anti-symmetric. Upon a space time split like one can obtain the velocity, and fields as above yielding the usual expression.\n\nLorentz force in general relativity\n\nIn the general theory of relativity the equation of motion for a particle with mass m and charge e, moving in a space with metric tensor g_{ab} and electromagnetic field F_{ab}, is given as\n\nm\\frac{du_c}{ds}-m\\frac{1}{2}g_{ab,c}u^au^b=eF_{cb}u^b \\;,\n\nwhere u^adx^a/ds (dx^a is taken along the trajectory), g_{ab,c}\n \\partial g_{ab}/\\partial x^c, and ds^2=g_{ab}dx^adx^b.\n\nThe equation can also be written as\n\nm\\frac{du_c}{ds}-m\\Gamma_{abc}u^au^b=eF_{cb}u^b \\;,\n\nwhere \\Gamma_{abc} is the Christoffel symbol (of the torsion-free metric connection in general relativity), or as\n\nm\\frac{Du_c}{ds}=eF_{cb}u^b \\;,\n\nwhere D is the covariant differential in general relativity (metric, torsion-free).\n\nApplications\n\nThe Lorentz force occurs in many devices, including:\n*Cyclotrons and other circular path particle accelerators\n*Mass spectrometers\n*Velocity Filters\n*Magnetrons\n*Lorentz force velocimetry\n\nIn its manifestation as the Laplace force on an electric current in a conductor, this force occurs in many devices including:\n\n*Electric motors\n*Railguns\n*Linear motors\n*Loudspeakers\n*Magnetoplasmadynamic thrusters\n*Electrical generators\n*Homopolar generators\n*Linear alternators. Lorentz force. http://en.wikipedia.org/?curid=18631."
  }
}
