{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15805",
  "eid" : "1ec93800-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778560896,
  "textBody" : "Events\n\n* 671 – Emperor Tenji of Japan introduces a water clock (clepsydra) called Rokoku. The instrument, which measures time and indicates hours, is placed in the capital of Ōtsu.\n*1190 – Third Crusade: Frederick I Barbarossa drowns in the river Saleph while leading an army to Jerusalem.\n*1329 – The Battle of Pelekanon results in a Byzantine defeat by the Ottoman Empire.\n*1523 – Copenhagen is surrounded by the army of Frederick I of Denmark, as the city won't recognise him as the successor of Christian II of Denmark.\n*1539 – Council of Trent: Pope Paul III sends out letters to his bishops, delaying the Council due to war and the difficulty bishops had traveling to Venice.\n*1596 – Willem Barents and Jacob van Heemskerk discover Bear Island.\n*1619 – Thirty Years' War: Battle of Záblatí, a turning point in the Bohemian Revolt.\n*1624 – Signing of the Treaty of Compiègne between France and the Netherlands.\n*1692 – Salem witch trials: Bridget Bishop is hanged at Gallows Hill near Salem, Massachusetts, for \"certaine Detestable Arts called Witchcraft & Sorceries\".\n*1719 – Jacobite risings: Battle of Glen Shiel.\n*1782 – King Buddha Yodfa Chulaloke (Rama I) of Siam (modern day Thailand) is crowned.\n*1786 – A landslide dam on the Dadu River created by an earthquake ten days earlier collapses, killing 100,000 in the Sichuan province of China.\n*1793 – The Jardin des Plantes museum opens in Paris. A year later, it becomes the first public zoo.\n*  1793 – French Revolution: Following the arrests of Girondin leaders, the Jacobins gain control of the Committee of Public Safety installing the revolutionary dictatorship.\n*1805 – First Barbary War: Yusuf Karamanli signs a treaty ending the hostilities between Tripolitania and the United States.\n*1829 – The first Boat Race between the University of Oxford and the University of Cambridge takes place on the Thames in London.\n*1838 – Myall Creek massacre: Twenty-eight Aboriginal Australians are murdered.\n*1854 – The first class of United States Naval Academy students graduate.\n*1861 – American Civil War: Battle of Big Bethel: Confederate troops under John B. Magruder defeat a much larger Union force led by General Ebenezer W. Pierce in Virginia.\n*1864 – American Civil War: Battle of Brice's Crossroads: Confederate troops under Nathan Bedford Forrest defeat a much larger Union force led by General Samuel D. Sturgis in Mississippi.\n*1871 – Sinmiyangyo: Captain McLane Tilton leads 109 US Marines in a naval attack on Han River forts on Kanghwa Island, Korea.\n*1878 – League of Prizren is established, to oppose the decisions of the Congress of Berlin and the Treaty of San Stefano, as a consequence of which the Albanian lands in Balkans were being partitioned and given to the neighbor states of Serbia, Montenegro, Bulgaria and Greece.\n*1886 – Mount Tarawera in New Zealand erupts, killing 153 people and burying the famous Pink and White Terraces. Eruptions continue for three months creating a large, 17 km long fissure across the mountain peak.\n*1898 – Spanish–American War: U.S. Marines land on the island of Cuba.\n*1916 – The Arab Revolt against the Ottoman Empire was declared by Hussein bin Ali, Sharif of Mecca.\n*1918 – The Austro-Hungarian battleship  sinks off the Croatian coast after being torpedoed by an Italian MAS motorboat; the event is recorded by camera from a nearby vessel.\n*1924 – Fascists kidnap and kill Italian Socialist leader Giacomo Matteotti in Rome.\n*1935 – Dr. Robert Smith takes his last drink, and Alcoholics Anonymous is founded in Akron, Ohio, United States, by him and Bill Wilson.\n*  1935 – Chaco War ends: A truce is called between Bolivia and Paraguay who had been fighting since 1932.\n*1940 – World War II: The Kingdom of Italy declares war on France and the United Kingdom.\n*  1940 – World War II: U.S. President Franklin D. Roosevelt denounces Italy's actions in his \"Stab in the Back\" speech at the graduation ceremonies of the University of Virginia.\n*  1940 – World War II: Norway surrenders to German forces.\n*1942 – World War II: Nazis burn the Czech village of Lidice in reprisal for the killing of Reinhard Heydrich.\n*1944 – World War II: Six hundred forty-two men, women and children massacred at Oradour-sur-Glane, France. \n*  1944 – World War II: In Distomo, Boeotia, Greece, 218 men, women and children are massacred by German troops.\n*  1944 – In baseball, 15-year-old Joe Nuxhall of the Cincinnati Reds becomes the youngest player ever in a major-league game.\n*1945 – Australian Imperial Forces land in Brunei Bay to liberate Brunei.\n*1947 – Saab produces its first automobile.\n*1957 – John Diefenbaker leads the Progressive Conservative Party of Canada to a stunning upset in the Canadian federal election, 1957, ending 22 years of Liberal Party government.\n*1963 – The Equal Pay Act of 1963, aimed at abolishing wage disparity based on sex, was signed into law by John F. Kennedy as part of his New Frontier Program.\n*1964 – United States Senate breaks a 75-day filibuster against the Civil Rights Act of 1964, leading to the bill's passage.\n*1967 – The Six-Day War ends: Israel and Syria agree to a cease-fire.\n*1977 – James Earl Ray escapes from Brushy Mountain State Prison in Petros, Tennessee. He is recaptured three days later.\n*1980 – The African National Congress in South Africa publishes a call to fight from their imprisoned leader Nelson Mandela.\n*1990 – British Airways Flight 5390 lands safely at Southampton Airport after a blowout in the cockpit causes the captain to be partially sucked from the cockpit. There are no fatalities\n*1991 – Eleven-year-old Jaycee Lee Dugard is kidnapped in South Lake Tahoe, California; she would remain a captive until 2009.\n*1994 – China conducts a nuclear test for DF-31 warhead at Area C (Beishan), Lop Nur, its prominence being due to the Cox Report.\n*1996 – Peace talks begin in Northern Ireland without the participation of Sinn Féin.\n*1997 – Before fleeing his northern stronghold, Khmer Rouge leader Pol Pot orders the killing of his defense chief Son Sen and 11 of Sen's family members.\n*1999 – Kosovo War: NATO suspends its airstrikes after Slobodan Milošević agrees to withdraw Serbian forces from Kosovo.\n*2001 – Pope John Paul II canonizes Lebanon's first female saint, Saint Rafqa.\n*2002 – The first direct electronic communication experiment between the nervous systems of two humans is carried out by Kevin Warwick in the United Kingdom.\n*2003 – The Spirit rover is launched, beginning NASA's Mars Exploration Rover mission.\n*2016 – Former The Voice contestant Christina Grimmie is fatally shot in Orlando, Florida following a concert; she died from her injuries at the age of 22.\n*2017 - The 2017 World Expo is opened in Astana, Kazakhstan. \n\nBirths\n\n*867 – Emperor Uda of Japan (d. 931)\n*940 – Abu al-Wafa' Buzjani, Persian mathematician and astronomer (d. 998)\n*1213 – Fakhr-al-Din Iraqi, Persian poet and philosopher (d. 1289)\n*1465 – Mercurino Gattinara, Italian statesman and jurist (d. 1530)\n*1513 – Louis, Duke of Montpensier (1561–1582) (d. 1582)\n*1557 – Leandro Bassano, Italian painter (d. 1622)\n*1632 – Esprit Fléchier, French bishop and author (d. 1710)\n*1688 – James Francis Edward Stuart, claimant to the English and Scottish throne (d. 1766)\n*1713 – Princess Caroline of Great Britain (d. 1757)\n*1716 – Carl Gustaf Ekeberg, Swedish physician and explorer (d. 1784)\n*1753 – William Eustis, American physician and politician, 12th Governor of Massachusetts (d. 1825)\n*1804 – Hermann Schlegel, German ornithologist and herpetologist (d. 1884)\n*1819 – Gustave Courbet, French-Swiss painter and sculptor (d. 1877)\n*1825 – Sondre Norheim, Norwegian-American skier (d. 1897)\n*1832 – Edwin Arnold, English poet and journalist (d. 1904)\n*  1832 – Nikolaus Otto, German engineer (d. 1891)\n*  1832 – Stephen Mosher Wood, American lieutenant and politician (d. 1920)\n*1835 – Rebecca Latimer Felton, American educator and politician (d. 1930)\n*1839 – Ludvig Holstein-Ledreborg, Danish lawyer and politician, 19th Prime Minister of Denmark (d. 1912)\n*1840 – Theodor Philipsen, Danish painter (d. 1920)\n*1843 – Heinrich von Herzogenberg, Austrian composer and conductor (d. 1900)\n*1854 – Sarah Grand, Irish feminist writer (d. 1943)\n*1859 – Emanuel Nobel, Swedish-Russian businessman (d. 1932)\n*1862 – Mrs. Leslie Carter, American actress (d. 1937)\n*1863 – Louis Couperus, Dutch author and poet (d. 1923)\n*1864 – Ninian Comper, Scottish architect (d. 1960)\n*1865 – Frederick Cook, American physician and explorer (d. 1940)\n*1880 – André Derain, French painter and sculptor (d. 1954)\n*1882 – Nils Økland, Norwegian Esperantist and teacher (d. 1969)\n*1884 – Leone Sextus Tollemache, English captain (d. 1917)\n*1889 – Sessue Hayakawa, Japanese actor and producer (d. 1973)\n*1891 – Al Dubin, Swiss-American songwriter (d. 1945)\n*1895 – Hattie McDaniel, American actress (d. 1952)\n*1897 – Grand Duchess Tatiana Nikolaevna of Russia (d. 1918)\n*1898 – Princess Marie-Auguste of Anhalt (d. 1983)\n*1899 – Stanisław Czaykowski, Polish race car driver (d. 1933)\n*1901 – Frederick Loewe, Austrian-American composer (d. 1988)\n*1904 – Lin Huiyin, Chinese architect and poet (d. 1955)\n*1907 – Fairfield Porter, American painter and critic (d. 1975)\n*1909 – Lang Hancock, Australian soldier and businessman (d. 1992)\n*1910 – Frank Demaree, American baseball player and manager (d. 1958)\n*  1910 – Robert Still, English composer and educator (d. 1971)\n*  1910 – Howlin' Wolf, American singer-songwriter and guitarist (d. 1976)\n*1911 – Ralph Kirkpatrick, American harpsichord player and musicologist (d. 1984)\n*  1911 – Terence Rattigan, English playwright and screenwriter (d. 1977)\n*1912 – Jean Lesage, Canadian lawyer and politician, 11th Premier of Quebec (d. 1980)\n*1913 – Tikhon Khrennikov, Russian pianist and composer (d. 2007)\n*  1913 – Benjamin Shapira, German-Israeli biochemist and academic (d. 1993)\n*1914 – Oktay Rıfat Horozcu, Turkish poet and playwright (d. 1988)\n*1915 – Saul Bellow, Canadian-American novelist, essayist and short story writer, Nobel Prize laureate (d. 2005)\n*1916 – Peride Celal, Turkish author (d. 2013)\n*  1916 – William Rosenberg, American entrepreneur, founded Dunkin' Donuts (d. 2002)\n*1918 – Patachou, French singer and actress (d. 2015)\n*  1918 – Barry Morse, English-Canadian actor and director (d. 2008)\n*1919 – Haidar Abdel-Shafi, Palestinian physician and politician (d. 2007)\n*  1919 – Kevin O'Flanagan, Irish footballer, rugby player, and physician (d. 2006)\n*1921 – Prince Philip, Duke of Edinburgh\n*  1921 – Jean Robic, French cyclist (d. 1980)\n*1922 – Judy Garland, American singer, actress, and vaudevillian (d. 1969)\n*  1922 – Bill Kerr, South African-Australian actor (d. 2014)\n*1923 – Paul Brunelle, Canadian singer-songwriter and guitarist (d. 1994)\n*  1923 – Robert Maxwell, Czech-English captain, publisher, and politician (d. 1991)\n*1924 – Friedrich L. Bauer, German mathematician, computer scientist, and academic (d. 2015)\n*1925 – Leo Gravelle, Canadian ice hockey player (d. 2013)\n*  1925 – Nat Hentoff, American historian, author, and journalist (d. 2017)\n*  1925 – James Salter, American novelist and short-story writer (d. 2015)\n*1926 – Bruno Bartoletti, Italian conductor (d. 2013)\n*  1926 – Lionel Jeffries, English actor, screenwriter and film director (d. 2010)\n*1927 – Claudio Gilberto Froehlich, Brazilian zoologist\n*  1927 – László Kubala, Hungarian footballer, coach, and manager (d. 2002)\n*  1927 – Johnny Orr, American basketball player and coach (d. 2013)\n*  1927 – Eugene Parker, American astrophysicist and academic\n*1928 – Lin Yang-kang, Chinese politician, 29th Vice Premier of the Republic of China (d. 2013)\n*  1928 – Maurice Sendak, American author and illustrator (d. 2012)\n*1929 – James McDivitt, American general, pilot, and astronaut\n*  1929 – Ian Sinclair, Australian farmer and politician, 42nd Australian Minister for Defence\n*  1929 – E. O. Wilson, American biologist, author, and academic\n*1930 – Aranka Siegal, Czech-American author and Holocaust survivor\n*  1930 – Carmen Cozza, American baseball and football player (d. 2018)\n\n*  1930 – Chen Xitong, Chinese politician, 8th Mayor of Beijing (d. 2013)\n*1931 – Bryan Cartledge, English academic and diplomat, British Ambassador to Russia\n*  1931 – João Gilberto, Brazilian singer-songwriter and guitarist\n*1932 – Pierre Cartier, French mathematician and academic\n*1934 – Peter Gibson, English lawyer and judge\n*  1934 – Tom Pendry, Baron Pendry, English politician\n*1935 – Vic Elford, English race car driver\n*  1935 – Yoshihiro Tatsumi, Japanese author and illustrator (d. 2015)\n*1938 – Rahul Bajaj, Indian businessman and politician\n*  1938 – Violetta Villas, Belgian-Polish singer-songwriter and actress (d. 2011)\n*  1938 – Vasanti N. Bhat-Nayak, Indian mathematician and academic (d. 2009)\n*1940 – Augie Auer, American-New Zealand meteorologist (d. 2007)\n*  1940 – John Stevens, English drummer (d. 1994)\n*1941 – Mickey Jones, American drummer \n*  1941 – Shirley Owens, American singer\n*  1941 – Jürgen Prochnow, German actor\n*  1941 – David Walker, Australian race car driver\n*1942 – Gordon Burns, Northern Irish journalist\n*  1942 – Chantal Goya, French singer and actress\n*  1942 – Arthur Hamilton, Lord Hamilton, Scottish lawyer and judge\n*  1942 – Preston Manning, Canadian politician\n*1943 – Simon Jenkins, English journalist and author\n*1944 – Ze'ev Friedman, Polish-Israeli weightlifter (d. 1972)\n*  1944 – Rick Price, English rock bass player\n*1947 – Michel Bastarache, Canadian businessman, lawyer, and jurist\n*  1947 – Ken Singleton, American baseball player and sportscaster\n*  1947 – Robert Wright, English air marshal\n*1950 – Elías Sosa, Dominican-American baseball player\n*1951 – Dan Fouts, American football player and sportscaster\n*  1951 – Tony Mundine, Australian boxer\n*  1951 – Burglinde Pollak, German pentathlete\n*1952 – Kage Baker, American author (d. 2010)\n*1953 – Eileen Cooper, English painter and academic\n*  1953 – John Edwards, American lawyer and politician\n*  1953 – Garry Hynes, Irish director and producer\n*  1953 – Christine St-Pierre, Canadian journalist and politician\n*1954 – Moya Greene, Canadian businesswoman\n*  1954 – Rich Hall, American actor, producer, and screenwriter\n*1955 – Annette Schavan, German theologian and politician\n*  1955 – Andrew Stevens, American actor and producer\n*1958 – Yu Suzuki, Japanese game designer and producer\n*1959 – Carlo Ancelotti, Italian footballer and manager\n*  1959 – Ernie C, American heavy metal guitarist, songwriter, and producer (Body Count) \n*  1959 – Eliot Spitzer, American lawyer and politician, 54th Governor of New York\n*1961 – Kelley Deal, American singer-songwriter and musician \n*  1961 – Kim Deal, American singer-songwriter and musician \n*  1961 – Maxi Priest, English singer-songwriter\n*1962 – Gina Gershon, American actress, singer and author\n*  1962 – Anderson Bigode Herzer, Brazilian poet and author (d. 1982)\n*  1962 – Wong Ka Kui, Hong Kong singer-songwriter and guitarist (d. 1993)\n*  1962 – Brent Sutter, Canadian ice hockey player and coach\n*1963 – Brad Henry, American lawyer and politician, 26th Governor of Oklahoma\n*  1963 – Jeanne Tripplehorn, American actress\n*1965 – Susanne Albers, German computer scientist and academic\n*  1965 – Elizabeth Hurley, English model, actress, and producer\n*  1965 – Joey Santiago, American alternative rock musician (The Pixies) \n*1966 – David Platt, English footballer and manager\n*1967 – Emma Anderson, English singer-songwriter and guitarist \n*  1967 – Darren Robinson, American rapper (d. 1995)\n*1968 – Bill Burr, American comedian and actor\n*  1968 – Derek Dooley, American football player and coach\n*1969 – Craig Hancock, Australian rugby league player\n*  1969 – Ronny Johnsen, Norwegian footballer\n*  1969 – Kate Snow, American journalist\n*1970 – Mike Doughty, American singer-songwriter and guitarist \n*  1970 – Alex Santos, Filipino journalist\n*  1970 – Katsuhiro Harada, Japanese game designer, director, and producer\n*1971 – Bobby Jindal, American journalist and politician, 55th Governor of Louisiana\n*  1971 – Bruno N'Gotty, French footballer\n*  1971 – Erik Rutan, American singer-songwriter, guitarist, and producer\n*1972 – Steven Fischer, American director and producer\n*  1972 – Joel \"JoJo\" Hailey, American R&B singer, half of K-Ci & JoJo and Jodeci\n*  1972 – Radmila Šekerinska, Macedonian politician, Prime Minister of the Republic of Macedonia\n*  1972 – Eric Upashantha, Sri Lankan cricketer\n*1973 – Faith Evans, American singer-songwriter, producer, and actress\n*  1973 – Flesh-n-Bone, American rapper and actor\n*  1973 – Pokey Reese, American baseball player\n*1974 – Dustin Lance Black, American director, producer, and screenwriter\n*  1974 – Robert Rave, American author \n*1975 – Henrik Pedersen, Danish footballer\n*1976 – Alari Lell, Estonian footballer\n*  1976 – James Moore, Canadian journalist and politician, 22nd Canadian Minister of Aboriginal Affairs\n*  1976 – Esther Ouwehand, Dutch politician\n*  1976 – Stefan Postma, Dutch footballer and coach\n*  1976 – Hadi Saei, Iranian martial artist\n*1977 – Adam Darski, Polish singer-songwriter and guitarist \n*  1977 – Mike Rosenthal, American football player and coach\n*1978 – Raheem Brock, American football player\n*  1978 – Shane West, American singer-songwriter and guitarist\n*1979 – Evgeni Borounov, Russian ice dancer and coach\n*  1979 – Kostas Louboutis, Greek footballer\n*  1979 – Svetlana Zakharova, Russian ballerina\n*1980 – Jessica DiCicco, American actress\n*  1980 – Matuzalém, Brazilian footballer\n*  1980 – Ovie Mughelli, American football player\n*  1980 – Dmitri Uchaykin, Russian ice hockey player (d. 2013)\n*  1980 – Daniele Seccarecci, Italian bodybuilder (d. 2013)\n*  1980 – James Walsh, English singer-songwriter, guitarist, and pianist \n*1981 – Mat Jackson, English race car driver\n*  1981 – Albie Morkel, South African cricketer\n*  1981 – Andrey Yepishin, Russian sprinter\n*1982 – Tara Lipinski, American figure skater\n*  1982 – Princess Madeleine, Duchess of Hälsingland and Gästrikland\n*  1982 – Ana Lúcia Souza, Brazilian ballerina and journalist\n*1983 – Marion Barber III, American football player\n*  1983 – Aaron Davey, Australian footballer\n*  1983 – Leelee Sobieski, American actress and producer\n*  1983 – Steve von Bergen, Swiss footballer\n*1984 – Johanna Kedzierski, German sprinter\n*  1984 – Dirk Van Tichelt, Belgian martial artist\n*1985 – Richard Chambers, Irish rower\n*  1985 – Gert Dorbek, Estonian basketball player\n*  1985 – Kaia Kanepi, Estonian tennis player\n*  1985 – Kristina Lundberg, Swedish ice hockey player\n*  1985 – Dane Nielsen, Australian rugby league player\n*  1985 – Andy Schleck, Luxembourger cyclist\n*  1985 – Vasilis Torosidis, Greek footballer\n*  1985 – Kreesha Turner, Canadian singer-songwriter and dancer\n*1986 – Al Alburquerque, Dominican baseball player\n*  1986 – Marco Andreolli, Italian footballer\n*1987 – Martin Harnik, German-Austrian footballer\n*  1987 – Amobi Okoye, Nigerian-American football player\n*1988 – Jeff Teague, American basketball player\n*1989 – DeAndre Kane, American basketball player\n*  1989 – David Miller, South African cricketer\n*  1989 – Mustapha Carayol, Gambian footballer\n*  1989 – Alexandra Stan, Romanian singer-songwriter, dancer, and model\n*1991 – Alexa Scimeca Knierim, American figure skater\n*1992 – Saulius Ambrulevičius, Lithuanian figure skater\n*  1992 – Kate Upton, American model and actress\n\nDeaths\n\n* 323 BC – Alexander the Great, Macedonian king (b. 356 BC)\n* AD 38 – Julia Drusilla, Roman sister of Caligula (b. 16 AD) \n* 223 – Liu Bei, Chinese emperor (b. 161)\n* 779 – Emperor Daizong of Tang (b. 727)\n* 754 – Abul Abbas al-Saffah, Muslim caliph (b. 721)\n* 871 – Odo I, Frankish nobleman\n* 903 – Cheng Rui, Chinese warlord\n* 932 – Dong Zhang, Chinese general\n* 942 – Liu Yan, emperor of Southern Han (b. 889)\n*1075 – Ernest, Margrave of Austria (b. 1027)\n*1141 – Richenza of Northeim (b. 1087)\n*1190 – Frederick I, Holy Roman Emperor (b. 1122)\n*1261 – Matilda of Brandenburg, Duchess of Brunswick-Lüneburg (b. 1210)\n*1338 – Kitabatake Akiie, Japanese governor (b. 1318)\n*1364 – Agnes of Austria (b. 1281)\n*1424 – Ernest, Duke of Austria (b. 1377)\n*1437 – Joan of Navarre, Queen of England (b. 1370)\n*1552 – Alexander Barclay, English poet and author (b. 1476)\n*1556 – Martin Agricola, German composer and theorist (b. 1486)\n*1580 – Luís de Camões, Portuguese poet (b. 1524-25)\n*1604 – Isabella Andreini, Italian actress (b. 1562)\n*1607 – John Popham, English politician, Attorney General for England and Wales (b. 1531)\n*1654 – Alessandro Algardi, Italian sculptor (b. 1598)\n*1680 – Johan Göransson Gyllenstierna, Swedish lawyer and politician (b. 1635)\n*1692 – Bridget Bishop, Colonial Massachusetts woman hanged as a witch during the Salem witch trials (b. 1632)\n*1735 – Thomas Hearne, English historian and author (b. 1678)\n*1753 – Joachim Ludwig Schultheiss von Unfriedt, German architect (b. 1678)\n*1776 – Hsinbyushin, Burmese king (b. 1736)\n*  1776 – Leopold Widhalm, Austrian instrument maker (b. 1722)\n*1791 – Toussaint-Guillaume Picquet de la Motte, French admiral (b. 1720)\n*1799 – Chevalier de Saint-Georges, Caribbean-French violinist, composer, and conductor (b. 1745)\n*1811 – Charles Frederick, Grand Duke of Baden (b. 1728)\n*1831 – Hans Karl von Diebitsch, German-Russian field marshal (b. 1785)\n*1836 – André-Marie Ampère, French physicist and mathematician (b. 1775)\n*1849 – Thomas Robert Bugeaud, French general and politician (b. 1784)\n*  1849 – Robert Brown, Scottish botanist (b. 1773)\n*1868 – Mihailo Obrenović III, Prince of Serbia (b. 1823)\n*1899 – Ernest Chausson, French composer (b. 1855)\n*1901 – Robert Williams Buchanan, Scottish poet, author, and playwright (b. 1841)\n*1902 – Jacint Verdaguer, Catalan priest and poet (b. 1845)\n*1906 – Richard Seddon, English-New Zealand politician, 15th Prime Minister of New Zealand (b. 1845)\n*1909 – Edward Everett Hale, American minister, historian, and author (b. 1822)\n*1914 – Ödön Lechner, Hungarian architect (b. 1845)\n*1918 – Arrigo Boito, Italian author, poet, and composer (b. 1842)\n*1923 – Pierre Loti, French soldier and author (b. 1850)\n*1924 – Giacomo Matteotti, Italian lawyer and politician (b. 1885)\n*1926 – Antoni Gaudí, Spanish architect, designed the Park Güell (b. 1852)\n*1930 – Adolf von Harnack, German historian and theologian (b. 1851)\n*1934 – Frederick Delius, English composer and educator (b. 1862)\n*1936 – John Bowser, English-Australian politician, 26th Premier of Victoria (b. 1856)\n*1937 – Robert Borden, Canadian lawyer and politician, 8th Prime Minister of Canada (b. 1854)\n*1939 – Albert Ogilvie, Australian politician, 28th Premier of Tasmania (b. 1890)\n*1940 – Marcus Garvey, Jamaican journalist and activist, founded the Black Star Line (b. 1887)\n*1944 – Willem Jacob van Stockum, Dutch mathematician and academic (b. 1910)\n*1946 – Jack Johnson, American boxer (b. 1878)\n*1947 – Alexander Bethune, Canadian businessman and politician, 12th Mayor of Vancouver (b. 1852)\n*1949 – Sigrid Undset, Danish-Norwegian novelist, essayist, and translator, Nobel Prize laureate (b. 1882)\n*1955 – Margaret Abbott, Indian-American golfer (b. 1876)\n*1958 – Angelina Weld Grimké, American journalist, poet, and playwright (b. 1880)\n*1959 – Zoltán Meskó, Hungarian politician (b. 1883)\n*1963 – Timothy Birdsall, English cartoonist (b. 1936)\n*1965 – Vahap Özaltay, Turkish footballer and manager (b. 1908)\n*1967 – Spencer Tracy, American actor (b. 1900)\n*1971 – Michael Rennie, English actor (b. 1909)\n*1973 – William Inge, American playwright and novelist (b. 1913)\n*1974 – Prince Henry, Duke of Gloucester (b. 1900)\n*1976 – Adolph Zukor, American film producer, co-founded Paramount Pictures (b. 1873)\n*1982 – Rainer Werner Fassbinder, German actor, director, and screenwriter (b. 1945)\n*1984 – Halide Nusret Zorlutuna, Turkish author and poet (b. 1901)\n*1986 – Merle Miller, American author and playwright (b. 1919)\n*1987 – Elizabeth Hartman, American actress (b. 1943)\n*1988 – Louis L'Amour, American novelist and short story writer (b. 1908)\n*1991 – Jean Bruller, French author and illustrator, co-founded Les Éditions de Minuit (b. 1902)\n*1992 – Hachidai Nakamura, Chinese-Japanese pianist and composer (b. 1931)\n*1993 – Les Dawson, English comedian, actor, writer and presenter (b. 1931)\n*1996 – George Hees, Canadian soldier, football player, and politician (b. 1910)\n*  1996 – Jo Van Fleet, American actress (b. 1915) \n*1998 – Jim Hearn, American baseball player (b. 1921)\n*  1998 – Hammond Innes, English soldier and author (b. 1914)\n*2000 – Hafez al-Assad, Syrian general and politician, 18th President of Syria (b. 1930)\n*  2000 – Brian Statham, English cricketer (b. 1930)\n*  2001 – Leila Pahlavi, Princess of Iran (b. 1970)\n*2002 – John Gotti, American mobster (b. 1940)\n*2003 – Donald Regan, American colonel and politician, 11th White House Chief of Staff (b. 1918)\n*  2003 – Bernard Williams, English philosopher and academic (b. 1929)\n*  2003 – Phil Williams, Welsh academic and politician (b. 1939)\n*2004 – Ray Charles, American singer-songwriter, pianist, and actor (b. 1930)\n*  2004 – Odette Laure, French actress and singer (b. 1917)\n*  2004 – Xenophon Zolotas, Greek economist and politician, 177th Prime Minister of Greece (b. 1904)\n*2005 – Curtis Pitts, American aircraft designer, designed the Pitts Special (b. 1915)\n*2007 – Augie Auer, American-New Zealand meteorologist (b. 1940)\n*2008 – Chinghiz Aitmatov, Kyrgyzstani author and diplomat (b. 1928)\n*2009 – Stelios Skevofilakas, Greek footballer (b. 1940)\n*2010 – Basil Schott, American archbishop (b. 1939)\n*  2010 – Sigmar Polke, German painter and photographer (b. 1941)\n*2011 – Brian Lenihan, Jnr, Irish lawyer and politician, 25th Irish Minister for Finance (b. 1959)\n*2012 – Piero Bellugi, Italian conductor (b. 1924)\n*  2012 – Warner Fusselle, American sportscaster (b. 1944)\n*  2012 – Will Hoebee, Dutch songwriter and producer (b. 1947)\n*  2012 – Georges Mathieu, French painter and academic (b. 1921)\n*  2012 – Joshua Orwa Ojode, Kenyan politician (b. 1958)\n*  2012 – George Saitoti, Kenyan economist and politician, 6th Vice-President of Kenya (b. 1945)\n*  2012 – Sudono Salim, Chinese-Indonesian businessman, founded Bank Central Asia (b. 1916)\n*  2012 – Gordon West, English footballer (b. 1943)\n*2013 – Doug Bailey, American political consultant (b. 1933)\n*  2013 – Enrique Orizaola, Spanish footballer and coach (b. 1922)\n*  2013 – Barbara Vucanovich, American lawyer and politician (b. 1921)\n*2014 – Marcello Alencar, Brazilian lawyer and politician, 57th Governor of Rio de Janeiro (b. 1925)\n*  2014 – George A. Burton, American soldier, accountant, and politician (b. 1926)\n*  2014 – Gary Gilmour, Australian cricketer and manager (b. 1951)\n*  2014 – Robert M. Grant, American theologian and academic (b. 1917)\n*  2014 – Jack Lee, American radio host and politician (b. 1920)\n*2015 – Robert Chartoff, American film producer and philanthropist (b. 1933)\n*  2015 – Wolfgang Jeschke, German author and publisher (b. 1936)\n*2016 – Christina Grimmie, American singer-songwriter (b. 1994)\n*  2016 – Gordie Howe, Canadian ice hockey player (b. 1928)\n*2017 – Julia Perez, Indonesian singer and actress (b. 1980)\n\nHolidays and observances\n\n*Abolition Day (French Guiana)\n*Army Day (Jordan)\n*Christian feast day:\n**Bardo\n**Getulius, Amancius and Cerealus\n**John of Tobolsk (Russian Orthodox Church)\n**Landry of Paris  \n**Maximus of Aveia (or of Aquila)\n**Maximus of Naples\n**Olivia\n**June 10 (Eastern Orthodox liturgics)\n*Navy Day (Italy)\n*Portugal Day, also Day of Camões (Portugal and the Portuguese communities) \n*Reconciliation Day (Republic of the Congo)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "June 10" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15805" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 671 – Emperor Tenji of Japan introduces a water clock (clepsydra) called Rokoku. The instrument, which measures time and indicates hours, is placed in the capital of Ōtsu.\n*1190 – Third Crusade: Frederick I Barbarossa drowns in the river Saleph while leading an army to Jerusalem.\n*1329 – The Battle of Pelekanon results in a Byzantine defeat by the Ottoman Empire.\n*1523 – Copenhagen is surrounded by the army of Frederick I of Denmark, as the city won't recognise him as the successor of Christian II of Denmark.\n*1539 – Council of Trent: Pope Paul III sends out letters to his bishops, delaying the Council due to war and the difficulty bishops had traveling to Venice.\n*1596 – Willem Barents and Jacob van Heemskerk discover Bear Island.\n*1619 – Thirty Years' War: Battle of Záblatí, a turning point in the Bohemian Revolt.\n*1624 – Signing of the Treaty of Compiègne between France and the Netherlands.\n*1692 – Salem witch trials: Bridget Bishop is hanged at Gallows Hill near Salem, Massachusetts, for \"certaine Detestable Arts called Witchcraft & Sorceries\".\n*1719 – Jacobite risings: Battle of Glen Shiel.\n*1782 – King Buddha Yodfa Chulaloke (Rama I) of Siam (modern day Thailand) is crowned.\n*1786 – A landslide dam on the Dadu River created by an earthquake ten days earlier collapses, killing 100,000 in the Sichuan province of China.\n*1793 – The Jardin des Plantes museum opens in Paris. A year later, it becomes the first public zoo.\n*  1793 – French Revolution: Following the arrests of Girondin leaders, the Jacobins gain control of the Committee of Public Safety installing the revolutionary dictatorship.\n*1805 – First Barbary War: Yusuf Karamanli signs a treaty ending the hostilities between Tripolitania and the United States.\n*1829 – The first Boat Race between the University of Oxford and the University of Cambridge takes place on the Thames in London.\n*1838 – Myall Creek massacre: Twenty-eight Aboriginal Australians are murdered.\n*1854 – The first class of United States Naval Academy students graduate.\n*1861 – American Civil War: Battle of Big Bethel: Confederate troops under John B. Magruder defeat a much larger Union force led by General Ebenezer W. Pierce in Virginia.\n*1864 – American Civil War: Battle of Brice's Crossroads: Confederate troops under Nathan Bedford Forrest defeat a much larger Union force led by General Samuel D. Sturgis in Mississippi.\n*1871 – Sinmiyangyo: Captain McLane Tilton leads 109 US Marines in a naval attack on Han River forts on Kanghwa Island, Korea.\n*1878 – League of Prizren is established, to oppose the decisions of the Congress of Berlin and the Treaty of San Stefano, as a consequence of which the Albanian lands in Balkans were being partitioned and given to the neighbor states of Serbia, Montenegro, Bulgaria and Greece.\n*1886 – Mount Tarawera in New Zealand erupts, killing 153 people and burying the famous Pink and White Terraces. Eruptions continue for three months creating a large, 17 km long fissure across the mountain peak.\n*1898 – Spanish–American War: U.S. Marines land on the island of Cuba.\n*1916 – The Arab Revolt against the Ottoman Empire was declared by Hussein bin Ali, Sharif of Mecca.\n*1918 – The Austro-Hungarian battleship  sinks off the Croatian coast after being torpedoed by an Italian MAS motorboat; the event is recorded by camera from a nearby vessel.\n*1924 – Fascists kidnap and kill Italian Socialist leader Giacomo Matteotti in Rome.\n*1935 – Dr. Robert Smith takes his last drink, and Alcoholics Anonymous is founded in Akron, Ohio, United States, by him and Bill Wilson.\n*  1935 – Chaco War ends: A truce is called between Bolivia and Paraguay who had been fighting since 1932.\n*1940 – World War II: The Kingdom of Italy declares war on France and the United Kingdom.\n*  1940 – World War II: U.S. President Franklin D. Roosevelt denounces Italy's actions in his \"Stab in the Back\" speech at the graduation ceremonies of the University of Virginia.\n*  1940 – World War II: Norway surrenders to German forces.\n*1942 – World War II: Nazis burn the Czech village of Lidice in reprisal for the killing of Reinhard Heydrich.\n*1944 – World War II: Six hundred forty-two men, women and children massacred at Oradour-sur-Glane, France. \n*  1944 – World War II: In Distomo, Boeotia, Greece, 218 men, women and children are massacred by German troops.\n*  1944 – In baseball, 15-year-old Joe Nuxhall of the Cincinnati Reds becomes the youngest player ever in a major-league game.\n*1945 – Australian Imperial Forces land in Brunei Bay to liberate Brunei.\n*1947 – Saab produces its first automobile.\n*1957 – John Diefenbaker leads the Progressive Conservative Party of Canada to a stunning upset in the Canadian federal election, 1957, ending 22 years of Liberal Party government.\n*1963 – The Equal Pay Act of 1963, aimed at abolishing wage disparity based on sex, was signed into law by John F. Kennedy as part of his New Frontier Program.\n*1964 – United States Senate breaks a 75-day filibuster against the Civil Rights Act of 1964, leading to the bill's passage.\n*1967 – The Six-Day War ends: Israel and Syria agree to a cease-fire.\n*1977 – James Earl Ray escapes from Brushy Mountain State Prison in Petros, Tennessee. He is recaptured three days later.\n*1980 – The African National Congress in South Africa publishes a call to fight from their imprisoned leader Nelson Mandela.\n*1990 – British Airways Flight 5390 lands safely at Southampton Airport after a blowout in the cockpit causes the captain to be partially sucked from the cockpit. There are no fatalities\n*1991 – Eleven-year-old Jaycee Lee Dugard is kidnapped in South Lake Tahoe, California; she would remain a captive until 2009.\n*1994 – China conducts a nuclear test for DF-31 warhead at Area C (Beishan), Lop Nur, its prominence being due to the Cox Report.\n*1996 – Peace talks begin in Northern Ireland without the participation of Sinn Féin.\n*1997 – Before fleeing his northern stronghold, Khmer Rouge leader Pol Pot orders the killing of his defense chief Son Sen and 11 of Sen's family members.\n*1999 – Kosovo War: NATO suspends its airstrikes after Slobodan Milošević agrees to withdraw Serbian forces from Kosovo.\n*2001 – Pope John Paul II canonizes Lebanon's first female saint, Saint Rafqa.\n*2002 – The first direct electronic communication experiment between the nervous systems of two humans is carried out by Kevin Warwick in the United Kingdom.\n*2003 – The Spirit rover is launched, beginning NASA's Mars Exploration Rover mission.\n*2016 – Former The Voice contestant Christina Grimmie is fatally shot in Orlando, Florida following a concert; she died from her injuries at the age of 22.\n*2017 - The 2017 World Expo is opened in Astana, Kazakhstan. \n\nBirths\n\n*867 – Emperor Uda of Japan (d. 931)\n*940 – Abu al-Wafa' Buzjani, Persian mathematician and astronomer (d. 998)\n*1213 – Fakhr-al-Din Iraqi, Persian poet and philosopher (d. 1289)\n*1465 – Mercurino Gattinara, Italian statesman and jurist (d. 1530)\n*1513 – Louis, Duke of Montpensier (1561–1582) (d. 1582)\n*1557 – Leandro Bassano, Italian painter (d. 1622)\n*1632 – Esprit Fléchier, French bishop and author (d. 1710)\n*1688 – James Francis Edward Stuart, claimant to the English and Scottish throne (d. 1766)\n*1713 – Princess Caroline of Great Britain (d. 1757)\n*1716 – Carl Gustaf Ekeberg, Swedish physician and explorer (d. 1784)\n*1753 – William Eustis, American physician and politician, 12th Governor of Massachusetts (d. 1825)\n*1804 – Hermann Schlegel, German ornithologist and herpetologist (d. 1884)\n*1819 – Gustave Courbet, French-Swiss painter and sculptor (d. 1877)\n*1825 – Sondre Norheim, Norwegian-American skier (d. 1897)\n*1832 – Edwin Arnold, English poet and journalist (d. 1904)\n*  1832 – Nikolaus Otto, German engineer (d. 1891)\n*  1832 – Stephen Mosher Wood, American lieutenant and politician (d. 1920)\n*1835 – Rebecca Latimer Felton, American educator and politician (d. 1930)\n*1839 – Ludvig Holstein-Ledreborg, Danish lawyer and politician, 19th Prime Minister of Denmark (d. 1912)\n*1840 – Theodor Philipsen, Danish painter (d. 1920)\n*1843 – Heinrich von Herzogenberg, Austrian composer and conductor (d. 1900)\n*1854 – Sarah Grand, Irish feminist writer (d. 1943)\n*1859 – Emanuel Nobel, Swedish-Russian businessman (d. 1932)\n*1862 – Mrs. Leslie Carter, American actress (d. 1937)\n*1863 – Louis Couperus, Dutch author and poet (d. 1923)\n*1864 – Ninian Comper, Scottish architect (d. 1960)\n*1865 – Frederick Cook, American physician and explorer (d. 1940)\n*1880 – André Derain, French painter and sculptor (d. 1954)\n*1882 – Nils Økland, Norwegian Esperantist and teacher (d. 1969)\n*1884 – Leone Sextus Tollemache, English captain (d. 1917)\n*1889 – Sessue Hayakawa, Japanese actor and producer (d. 1973)\n*1891 – Al Dubin, Swiss-American songwriter (d. 1945)\n*1895 – Hattie McDaniel, American actress (d. 1952)\n*1897 – Grand Duchess Tatiana Nikolaevna of Russia (d. 1918)\n*1898 – Princess Marie-Auguste of Anhalt (d. 1983)\n*1899 – Stanisław Czaykowski, Polish race car driver (d. 1933)\n*1901 – Frederick Loewe, Austrian-American composer (d. 1988)\n*1904 – Lin Huiyin, Chinese architect and poet (d. 1955)\n*1907 – Fairfield Porter, American painter and critic (d. 1975)\n*1909 – Lang Hancock, Australian soldier and businessman (d. 1992)\n*1910 – Frank Demaree, American baseball player and manager (d. 1958)\n*  1910 – Robert Still, English composer and educator (d. 1971)\n*  1910 – Howlin' Wolf, American singer-songwriter and guitarist (d. 1976)\n*1911 – Ralph Kirkpatrick, American harpsichord player and musicologist (d. 1984)\n*  1911 – Terence Rattigan, English playwright and screenwriter (d. 1977)\n*1912 – Jean Lesage, Canadian lawyer and politician, 11th Premier of Quebec (d. 1980)\n*1913 – Tikhon Khrennikov, Russian pianist and composer (d. 2007)\n*  1913 – Benjamin Shapira, German-Israeli biochemist and academic (d. 1993)\n*1914 – Oktay Rıfat Horozcu, Turkish poet and playwright (d. 1988)\n*1915 – Saul Bellow, Canadian-American novelist, essayist and short story writer, Nobel Prize laureate (d. 2005)\n*1916 – Peride Celal, Turkish author (d. 2013)\n*  1916 – William Rosenberg, American entrepreneur, founded Dunkin' Donuts (d. 2002)\n*1918 – Patachou, French singer and actress (d. 2015)\n*  1918 – Barry Morse, English-Canadian actor and director (d. 2008)\n*1919 – Haidar Abdel-Shafi, Palestinian physician and politician (d. 2007)\n*  1919 – Kevin O'Flanagan, Irish footballer, rugby player, and physician (d. 2006)\n*1921 – Prince Philip, Duke of Edinburgh\n*  1921 – Jean Robic, French cyclist (d. 1980)\n*1922 – Judy Garland, American singer, actress, and vaudevillian (d. 1969)\n*  1922 – Bill Kerr, South African-Australian actor (d. 2014)\n*1923 – Paul Brunelle, Canadian singer-songwriter and guitarist (d. 1994)\n*  1923 – Robert Maxwell, Czech-English captain, publisher, and politician (d. 1991)\n*1924 – Friedrich L. Bauer, German mathematician, computer scientist, and academic (d. 2015)\n*1925 – Leo Gravelle, Canadian ice hockey player (d. 2013)\n*  1925 – Nat Hentoff, American historian, author, and journalist (d. 2017)\n*  1925 – James Salter, American novelist and short-story writer (d. 2015)\n*1926 – Bruno Bartoletti, Italian conductor (d. 2013)\n*  1926 – Lionel Jeffries, English actor, screenwriter and film director (d. 2010)\n*1927 – Claudio Gilberto Froehlich, Brazilian zoologist\n*  1927 – László Kubala, Hungarian footballer, coach, and manager (d. 2002)\n*  1927 – Johnny Orr, American basketball player and coach (d. 2013)\n*  1927 – Eugene Parker, American astrophysicist and academic\n*1928 – Lin Yang-kang, Chinese politician, 29th Vice Premier of the Republic of China (d. 2013)\n*  1928 – Maurice Sendak, American author and illustrator (d. 2012)\n*1929 – James McDivitt, American general, pilot, and astronaut\n*  1929 – Ian Sinclair, Australian farmer and politician, 42nd Australian Minister for Defence\n*  1929 – E. O. Wilson, American biologist, author, and academic\n*1930 – Aranka Siegal, Czech-American author and Holocaust survivor\n*  1930 – Carmen Cozza, American baseball and football player (d. 2018)\n\n*  1930 – Chen Xitong, Chinese politician, 8th Mayor of Beijing (d. 2013)\n*1931 – Bryan Cartledge, English academic and diplomat, British Ambassador to Russia\n*  1931 – João Gilberto, Brazilian singer-songwriter and guitarist\n*1932 – Pierre Cartier, French mathematician and academic\n*1934 – Peter Gibson, English lawyer and judge\n*  1934 – Tom Pendry, Baron Pendry, English politician\n*1935 – Vic Elford, English race car driver\n*  1935 – Yoshihiro Tatsumi, Japanese author and illustrator (d. 2015)\n*1938 – Rahul Bajaj, Indian businessman and politician\n*  1938 – Violetta Villas, Belgian-Polish singer-songwriter and actress (d. 2011)\n*  1938 – Vasanti N. Bhat-Nayak, Indian mathematician and academic (d. 2009)\n*1940 – Augie Auer, American-New Zealand meteorologist (d. 2007)\n*  1940 – John Stevens, English drummer (d. 1994)\n*1941 – Mickey Jones, American drummer \n*  1941 – Shirley Owens, American singer\n*  1941 – Jürgen Prochnow, German actor\n*  1941 – David Walker, Australian race car driver\n*1942 – Gordon Burns, Northern Irish journalist\n*  1942 – Chantal Goya, French singer and actress\n*  1942 – Arthur Hamilton, Lord Hamilton, Scottish lawyer and judge\n*  1942 – Preston Manning, Canadian politician\n*1943 – Simon Jenkins, English journalist and author\n*1944 – Ze'ev Friedman, Polish-Israeli weightlifter (d. 1972)\n*  1944 – Rick Price, English rock bass player\n*1947 – Michel Bastarache, Canadian businessman, lawyer, and jurist\n*  1947 – Ken Singleton, American baseball player and sportscaster\n*  1947 – Robert Wright, English air marshal\n*1950 – Elías Sosa, Dominican-American baseball player\n*1951 – Dan Fouts, American football player and sportscaster\n*  1951 – Tony Mundine, Australian boxer\n*  1951 – Burglinde Pollak, German pentathlete\n*1952 – Kage Baker, American author (d. 2010)\n*1953 – Eileen Cooper, English painter and academic\n*  1953 – John Edwards, American lawyer and politician\n*  1953 – Garry Hynes, Irish director and producer\n*  1953 – Christine St-Pierre, Canadian journalist and politician\n*1954 – Moya Greene, Canadian businesswoman\n*  1954 – Rich Hall, American actor, producer, and screenwriter\n*1955 – Annette Schavan, German theologian and politician\n*  1955 – Andrew Stevens, American actor and producer\n*1958 – Yu Suzuki, Japanese game designer and producer\n*1959 – Carlo Ancelotti, Italian footballer and manager\n*  1959 – Ernie C, American heavy metal guitarist, songwriter, and producer (Body Count) \n*  1959 – Eliot Spitzer, American lawyer and politician, 54th Governor of New York\n*1961 – Kelley Deal, American singer-songwriter and musician \n*  1961 – Kim Deal, American singer-songwriter and musician \n*  1961 – Maxi Priest, English singer-songwriter\n*1962 – Gina Gershon, American actress, singer and author\n*  1962 – Anderson Bigode Herzer, Brazilian poet and author (d. 1982)\n*  1962 – Wong Ka Kui, Hong Kong singer-songwriter and guitarist (d. 1993)\n*  1962 – Brent Sutter, Canadian ice hockey player and coach\n*1963 – Brad Henry, American lawyer and politician, 26th Governor of Oklahoma\n*  1963 – Jeanne Tripplehorn, American actress\n*1965 – Susanne Albers, German computer scientist and academic\n*  1965 – Elizabeth Hurley, English model, actress, and producer\n*  1965 – Joey Santiago, American alternative rock musician (The Pixies) \n*1966 – David Platt, English footballer and manager\n*1967 – Emma Anderson, English singer-songwriter and guitarist \n*  1967 – Darren Robinson, American rapper (d. 1995)\n*1968 – Bill Burr, American comedian and actor\n*  1968 – Derek Dooley, American football player and coach\n*1969 – Craig Hancock, Australian rugby league player\n*  1969 – Ronny Johnsen, Norwegian footballer\n*  1969 – Kate Snow, American journalist\n*1970 – Mike Doughty, American singer-songwriter and guitarist \n*  1970 – Alex Santos, Filipino journalist\n*  1970 – Katsuhiro Harada, Japanese game designer, director, and producer\n*1971 – Bobby Jindal, American journalist and politician, 55th Governor of Louisiana\n*  1971 – Bruno N'Gotty, French footballer\n*  1971 – Erik Rutan, American singer-songwriter, guitarist, and producer\n*1972 – Steven Fischer, American director and producer\n*  1972 – Joel \"JoJo\" Hailey, American R&B singer, half of K-Ci & JoJo and Jodeci\n*  1972 – Radmila Šekerinska, Macedonian politician, Prime Minister of the Republic of Macedonia\n*  1972 – Eric Upashantha, Sri Lankan cricketer\n*1973 – Faith Evans, American singer-songwriter, producer, and actress\n*  1973 – Flesh-n-Bone, American rapper and actor\n*  1973 – Pokey Reese, American baseball player\n*1974 – Dustin Lance Black, American director, producer, and screenwriter\n*  1974 – Robert Rave, American author \n*1975 – Henrik Pedersen, Danish footballer\n*1976 – Alari Lell, Estonian footballer\n*  1976 – James Moore, Canadian journalist and politician, 22nd Canadian Minister of Aboriginal Affairs\n*  1976 – Esther Ouwehand, Dutch politician\n*  1976 – Stefan Postma, Dutch footballer and coach\n*  1976 – Hadi Saei, Iranian martial artist\n*1977 – Adam Darski, Polish singer-songwriter and guitarist \n*  1977 – Mike Rosenthal, American football player and coach\n*1978 – Raheem Brock, American football player\n*  1978 – Shane West, American singer-songwriter and guitarist\n*1979 – Evgeni Borounov, Russian ice dancer and coach\n*  1979 – Kostas Louboutis, Greek footballer\n*  1979 – Svetlana Zakharova, Russian ballerina\n*1980 – Jessica DiCicco, American actress\n*  1980 – Matuzalém, Brazilian footballer\n*  1980 – Ovie Mughelli, American football player\n*  1980 – Dmitri Uchaykin, Russian ice hockey player (d. 2013)\n*  1980 – Daniele Seccarecci, Italian bodybuilder (d. 2013)\n*  1980 – James Walsh, English singer-songwriter, guitarist, and pianist \n*1981 – Mat Jackson, English race car driver\n*  1981 – Albie Morkel, South African cricketer\n*  1981 – Andrey Yepishin, Russian sprinter\n*1982 – Tara Lipinski, American figure skater\n*  1982 – Princess Madeleine, Duchess of Hälsingland and Gästrikland\n*  1982 – Ana Lúcia Souza, Brazilian ballerina and journalist\n*1983 – Marion Barber III, American football player\n*  1983 – Aaron Davey, Australian footballer\n*  1983 – Leelee Sobieski, American actress and producer\n*  1983 – Steve von Bergen, Swiss footballer\n*1984 – Johanna Kedzierski, German sprinter\n*  1984 – Dirk Van Tichelt, Belgian martial artist\n*1985 – Richard Chambers, Irish rower\n*  1985 – Gert Dorbek, Estonian basketball player\n*  1985 – Kaia Kanepi, Estonian tennis player\n*  1985 – Kristina Lundberg, Swedish ice hockey player\n*  1985 – Dane Nielsen, Australian rugby league player\n*  1985 – Andy Schleck, Luxembourger cyclist\n*  1985 – Vasilis Torosidis, Greek footballer\n*  1985 – Kreesha Turner, Canadian singer-songwriter and dancer\n*1986 – Al Alburquerque, Dominican baseball player\n*  1986 – Marco Andreolli, Italian footballer\n*1987 – Martin Harnik, German-Austrian footballer\n*  1987 – Amobi Okoye, Nigerian-American football player\n*1988 – Jeff Teague, American basketball player\n*1989 – DeAndre Kane, American basketball player\n*  1989 – David Miller, South African cricketer\n*  1989 – Mustapha Carayol, Gambian footballer\n*  1989 – Alexandra Stan, Romanian singer-songwriter, dancer, and model\n*1991 – Alexa Scimeca Knierim, American figure skater\n*1992 – Saulius Ambrulevičius, Lithuanian figure skater\n*  1992 – Kate Upton, American model and actress\n\nDeaths\n\n* 323 BC – Alexander the Great, Macedonian king (b. 356 BC)\n* AD 38 – Julia Drusilla, Roman sister of Caligula (b. 16 AD) \n* 223 – Liu Bei, Chinese emperor (b. 161)\n* 779 – Emperor Daizong of Tang (b. 727)\n* 754 – Abul Abbas al-Saffah, Muslim caliph (b. 721)\n* 871 – Odo I, Frankish nobleman\n* 903 – Cheng Rui, Chinese warlord\n* 932 – Dong Zhang, Chinese general\n* 942 – Liu Yan, emperor of Southern Han (b. 889)\n*1075 – Ernest, Margrave of Austria (b. 1027)\n*1141 – Richenza of Northeim (b. 1087)\n*1190 – Frederick I, Holy Roman Emperor (b. 1122)\n*1261 – Matilda of Brandenburg, Duchess of Brunswick-Lüneburg (b. 1210)\n*1338 – Kitabatake Akiie, Japanese governor (b. 1318)\n*1364 – Agnes of Austria (b. 1281)\n*1424 – Ernest, Duke of Austria (b. 1377)\n*1437 – Joan of Navarre, Queen of England (b. 1370)\n*1552 – Alexander Barclay, English poet and author (b. 1476)\n*1556 – Martin Agricola, German composer and theorist (b. 1486)\n*1580 – Luís de Camões, Portuguese poet (b. 1524-25)\n*1604 – Isabella Andreini, Italian actress (b. 1562)\n*1607 – John Popham, English politician, Attorney General for England and Wales (b. 1531)\n*1654 – Alessandro Algardi, Italian sculptor (b. 1598)\n*1680 – Johan Göransson Gyllenstierna, Swedish lawyer and politician (b. 1635)\n*1692 – Bridget Bishop, Colonial Massachusetts woman hanged as a witch during the Salem witch trials (b. 1632)\n*1735 – Thomas Hearne, English historian and author (b. 1678)\n*1753 – Joachim Ludwig Schultheiss von Unfriedt, German architect (b. 1678)\n*1776 – Hsinbyushin, Burmese king (b. 1736)\n*  1776 – Leopold Widhalm, Austrian instrument maker (b. 1722)\n*1791 – Toussaint-Guillaume Picquet de la Motte, French admiral (b. 1720)\n*1799 – Chevalier de Saint-Georges, Caribbean-French violinist, composer, and conductor (b. 1745)\n*1811 – Charles Frederick, Grand Duke of Baden (b. 1728)\n*1831 – Hans Karl von Diebitsch, German-Russian field marshal (b. 1785)\n*1836 – André-Marie Ampère, French physicist and mathematician (b. 1775)\n*1849 – Thomas Robert Bugeaud, French general and politician (b. 1784)\n*  1849 – Robert Brown, Scottish botanist (b. 1773)\n*1868 – Mihailo Obrenović III, Prince of Serbia (b. 1823)\n*1899 – Ernest Chausson, French composer (b. 1855)\n*1901 – Robert Williams Buchanan, Scottish poet, author, and playwright (b. 1841)\n*1902 – Jacint Verdaguer, Catalan priest and poet (b. 1845)\n*1906 – Richard Seddon, English-New Zealand politician, 15th Prime Minister of New Zealand (b. 1845)\n*1909 – Edward Everett Hale, American minister, historian, and author (b. 1822)\n*1914 – Ödön Lechner, Hungarian architect (b. 1845)\n*1918 – Arrigo Boito, Italian author, poet, and composer (b. 1842)\n*1923 – Pierre Loti, French soldier and author (b. 1850)\n*1924 – Giacomo Matteotti, Italian lawyer and politician (b. 1885)\n*1926 – Antoni Gaudí, Spanish architect, designed the Park Güell (b. 1852)\n*1930 – Adolf von Harnack, German historian and theologian (b. 1851)\n*1934 – Frederick Delius, English composer and educator (b. 1862)\n*1936 – John Bowser, English-Australian politician, 26th Premier of Victoria (b. 1856)\n*1937 – Robert Borden, Canadian lawyer and politician, 8th Prime Minister of Canada (b. 1854)\n*1939 – Albert Ogilvie, Australian politician, 28th Premier of Tasmania (b. 1890)\n*1940 – Marcus Garvey, Jamaican journalist and activist, founded the Black Star Line (b. 1887)\n*1944 – Willem Jacob van Stockum, Dutch mathematician and academic (b. 1910)\n*1946 – Jack Johnson, American boxer (b. 1878)\n*1947 – Alexander Bethune, Canadian businessman and politician, 12th Mayor of Vancouver (b. 1852)\n*1949 – Sigrid Undset, Danish-Norwegian novelist, essayist, and translator, Nobel Prize laureate (b. 1882)\n*1955 – Margaret Abbott, Indian-American golfer (b. 1876)\n*1958 – Angelina Weld Grimké, American journalist, poet, and playwright (b. 1880)\n*1959 – Zoltán Meskó, Hungarian politician (b. 1883)\n*1963 – Timothy Birdsall, English cartoonist (b. 1936)\n*1965 – Vahap Özaltay, Turkish footballer and manager (b. 1908)\n*1967 – Spencer Tracy, American actor (b. 1900)\n*1971 – Michael Rennie, English actor (b. 1909)\n*1973 – William Inge, American playwright and novelist (b. 1913)\n*1974 – Prince Henry, Duke of Gloucester (b. 1900)\n*1976 – Adolph Zukor, American film producer, co-founded Paramount Pictures (b. 1873)\n*1982 – Rainer Werner Fassbinder, German actor, director, and screenwriter (b. 1945)\n*1984 – Halide Nusret Zorlutuna, Turkish author and poet (b. 1901)\n*1986 – Merle Miller, American author and playwright (b. 1919)\n*1987 – Elizabeth Hartman, American actress (b. 1943)\n*1988 – Louis L'Amour, American novelist and short story writer (b. 1908)\n*1991 – Jean Bruller, French author and illustrator, co-founded Les Éditions de Minuit (b. 1902)\n*1992 – Hachidai Nakamura, Chinese-Japanese pianist and composer (b. 1931)\n*1993 – Les Dawson, English comedian, actor, writer and presenter (b. 1931)\n*1996 – George Hees, Canadian soldier, football player, and politician (b. 1910)\n*  1996 – Jo Van Fleet, American actress (b. 1915) \n*1998 – Jim Hearn, American baseball player (b. 1921)\n*  1998 – Hammond Innes, English soldier and author (b. 1914)\n*2000 – Hafez al-Assad, Syrian general and politician, 18th President of Syria (b. 1930)\n*  2000 – Brian Statham, English cricketer (b. 1930)\n*  2001 – Leila Pahlavi, Princess of Iran (b. 1970)\n*2002 – John Gotti, American mobster (b. 1940)\n*2003 – Donald Regan, American colonel and politician, 11th White House Chief of Staff (b. 1918)\n*  2003 – Bernard Williams, English philosopher and academic (b. 1929)\n*  2003 – Phil Williams, Welsh academic and politician (b. 1939)\n*2004 – Ray Charles, American singer-songwriter, pianist, and actor (b. 1930)\n*  2004 – Odette Laure, French actress and singer (b. 1917)\n*  2004 – Xenophon Zolotas, Greek economist and politician, 177th Prime Minister of Greece (b. 1904)\n*2005 – Curtis Pitts, American aircraft designer, designed the Pitts Special (b. 1915)\n*2007 – Augie Auer, American-New Zealand meteorologist (b. 1940)\n*2008 – Chinghiz Aitmatov, Kyrgyzstani author and diplomat (b. 1928)\n*2009 – Stelios Skevofilakas, Greek footballer (b. 1940)\n*2010 – Basil Schott, American archbishop (b. 1939)\n*  2010 – Sigmar Polke, German painter and photographer (b. 1941)\n*2011 – Brian Lenihan, Jnr, Irish lawyer and politician, 25th Irish Minister for Finance (b. 1959)\n*2012 – Piero Bellugi, Italian conductor (b. 1924)\n*  2012 – Warner Fusselle, American sportscaster (b. 1944)\n*  2012 – Will Hoebee, Dutch songwriter and producer (b. 1947)\n*  2012 – Georges Mathieu, French painter and academic (b. 1921)\n*  2012 – Joshua Orwa Ojode, Kenyan politician (b. 1958)\n*  2012 – George Saitoti, Kenyan economist and politician, 6th Vice-President of Kenya (b. 1945)\n*  2012 – Sudono Salim, Chinese-Indonesian businessman, founded Bank Central Asia (b. 1916)\n*  2012 – Gordon West, English footballer (b. 1943)\n*2013 – Doug Bailey, American political consultant (b. 1933)\n*  2013 – Enrique Orizaola, Spanish footballer and coach (b. 1922)\n*  2013 – Barbara Vucanovich, American lawyer and politician (b. 1921)\n*2014 – Marcello Alencar, Brazilian lawyer and politician, 57th Governor of Rio de Janeiro (b. 1925)\n*  2014 – George A. Burton, American soldier, accountant, and politician (b. 1926)\n*  2014 – Gary Gilmour, Australian cricketer and manager (b. 1951)\n*  2014 – Robert M. Grant, American theologian and academic (b. 1917)\n*  2014 – Jack Lee, American radio host and politician (b. 1920)\n*2015 – Robert Chartoff, American film producer and philanthropist (b. 1933)\n*  2015 – Wolfgang Jeschke, German author and publisher (b. 1936)\n*2016 – Christina Grimmie, American singer-songwriter (b. 1994)\n*  2016 – Gordie Howe, Canadian ice hockey player (b. 1928)\n*2017 – Julia Perez, Indonesian singer and actress (b. 1980)\n\nHolidays and observances\n\n*Abolition Day (French Guiana)\n*Army Day (Jordan)\n*Christian feast day:\n**Bardo\n**Getulius, Amancius and Cerealus\n**John of Tobolsk (Russian Orthodox Church)\n**Landry of Paris  \n**Maximus of Aveia (or of Aquila)\n**Maximus of Naples\n**Olivia\n**June 10 (Eastern Orthodox liturgics)\n*Navy Day (Italy)\n*Portugal Day, also Day of Camões (Portugal and the Portuguese communities) \n*Reconciliation Day (Republic of the Congo). June 10. http://en.wikipedia.org/?curid=15805."
  }
}
