{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7592",
  "eid" : "e2777a10-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778459697,
  "textBody" : "A caldera is a large cauldron-like depression that forms following the evacuation of a magma chamber/reservoir. When large volumes of magma are erupted over a short time, structural support for the crust above the magma chamber is lost. The ground surface then collapses downward into the partially emptied magma chamber, leaving a massive depression at the surface (from one to dozens of kilometers in diameter). Although sometimes described as a crater, the feature is actually a type of sinkhole, as it is formed through subsidence and collapse rather than an explosion or impact. Only seven known caldera-forming collapses have occurred since the start of the 20th century, most recently at Bárðarbunga volcano in Iceland.Gudmundsson, M.T. et al. (2014) Graduale caldera collapse at Bárðarbunga volcano Iceland, regulated by lateral magma outflow, Science, 15.\n\nEtymology \n\nThe word comes from Spanish ', and Latin ', meaning \"cooking pot\".  In some texts the English term cauldron is also used. The term caldera was introduced into the geological vocabulary by the German geologist Leopold von Buch when he published his memoirs of his 1815 visit to the Canary Islands, where he first saw the Las Cañadas caldera on Tenerife, with Montaña Teide dominating the landscape, and then the Caldera de Taburiente on La Palma.\n\nCaldera formation\n\nA collapse is triggered by the emptying of the magma chamber beneath the volcano, sometimes as the result of a large explosive volcanic eruption  (see Tambora  in 1815), but also during effusive eruptions on the flanks of a volcano (see Piton de la Fournaise in 2007) or in a connected fissure system (see Bárðarbunga in 2014–2015). If enough magma is ejected, the emptied chamber is unable to support the weight of the volcanic edifice above it. A roughly circular fracture, the \"ring fault\", develops around the edge of the chamber. Ring fractures serve as feeders for fault intrusions which are also known as ring dykes. Secondary volcanic vents may form above the ring fracture. As the magma chamber empties, the center of the volcano within the ring fracture begins to collapse. The collapse may occur as the result of a single cataclysmic eruption, or it may occur in stages as the result of a series of eruptions. The total area that collapses may be hundreds or thousands of square kilometers.\n\nMineralization\n\nSome calderas are known to host rich ore deposits. One of the world's best-preserved mineralized calderas is the Sturgeon Lake Caldera in northwestern Ontario, Canada, which formed during the Neoarchean era about 2,700 million years ago.\n\nExplosive caldera eruptions\n\nIf the magma is rich in silica, the caldera is often filled in with ignimbrite, tuff, rhyolite, and other igneous rocks. Silica-rich magma has a high viscosity, and therefore does not flow easily like basalt. As a result, gases tend to become trapped at high pressure within the magma. When the magma approaches the surface of the Earth, the rapid off-loading of overlying material causes the trapped gases to decompress rapidly, thus triggering explosive destruction of the magma and spreading volcanic ash over wide areas. Further lava flows may be erupted.\n\nIf volcanic activity continues, the center of the caldera may be uplifted in the form of a resurgent dome such as is seen at Cerro Galán, Lake Toba, Yellowstone, etc., by subsequent intrusion of magma. A silicic or rhyolitic caldera may erupt hundreds or even thousands of cubic kilometers of material in a single event. Even small caldera-forming eruptions, such as Krakatoa in 1883 or Mount Pinatubo in 1991, may result in significant local destruction and a noticeable drop in temperature around the world. Large calderas may have even greater effects.\n\nWhen Yellowstone Caldera last erupted some 650,000 years ago, it released about 1,000 km3 of material (as measured in dense rock equivalent (DRE)), covering a substantial part of North America in up to two metres of debris. By comparison, when Mount St. Helens erupted in 1980, it released ~1.2 km3 (DRE) of ejecta. The ecological effects of the eruption of a large caldera can be seen in the record of the Lake Toba eruption in Indonesia.\n\nToba\n\nAbout 74,000 years ago, this Indonesian volcano released about 2,800 km3 DRE of ejecta, the largest known eruption within the Quaternary Period (last 1.8 million years) and the largest known explosive eruption within the last 25 million years. In the late 1990s, anthropologist Stanley Ambrose proposed that a volcanic winter induced by this eruption reduced the human population to about 2,000–20,000 individuals, resulting in a population bottleneck (see Toba catastrophe theory). More recently several geneticists, including Lynn Jorde and Henry Harpending have proposed that the human species was reduced to approximately five to ten thousand people.[http://www.bbc.co.uk/science/horizon/1999/supervolcanoes_script.shtml Supervolcanoes], BBC2, 3 February 2000 However, there is no direct evidence that the theory is correct. And there is no evidence for any other animal decline or extinction, even in environmentally sensitive species. There is evidence that human habitation continued in India after the eruption. The theory in its strongest form may be incorrect.\n\nEruptions forming even larger calderas are known, especially La Garita Caldera in the San Juan Mountains of Colorado, where the 5,000-km3 Fish Canyon Tuff was blasted out in a single major eruption about 27.8 million years ago.\n\nAt some points in geological time, rhyolitic calderas have appeared in distinct clusters. The remnants of such clusters may be found in places such as the San Juan Mountains of Colorado (formed during the Oligocene, Miocene, and Pliocene periods) or the Saint Francois Mountain Range of Missouri (erupted during the Proterozoic).\n\nNon-explosive calderas\n\nSome volcanoes, such as shield volcanoes Kīlauea and Mauna Loa (respectively the most active and second largest on Earth, are both on the island of Hawaii), form calderas in a different fashion. The magma feeding these volcanoes is basalt which is silica poor. As a result, the magma is much less viscous than the magma of a rhyolitic volcano, and the magma chamber is drained by large lava flows rather than by explosive events. The resulting calderas are also known as subsidence calderas, and can form more gradually than explosive calderas. For instance, the caldera atop Fernandina Island underwent a collapse in 1968, when parts of the caldera floor dropped 350 meters. Kilauea Caldera has an inner crater known as Halema‘uma‘u, which has often been filled by a lava lake.\n\nDuring the April 2007 eruption of the Piton de la Fournaise on the island of Réunion, the floor of the main crater suddenly dropped about 300 m. This was attributed to the withdrawal of magma which was being erupted through a vent lower down on the southern flank of the volcano.\n\nAnother process that may allow a caldera to form can occur if molten lava can escape through a breach on the caldera's rim.\n\nExtraterrestrial calderas\n\nSince the early 1960s, it has been known that volcanism has occurred on other planets and moons in the Solar System. Through the use of manned and unmanned spacecraft, volcanism has been discovered on Venus, Mars, the Moon, and Io, a satellite of Jupiter. None of these worlds have plate tectonics, which contributes approximately 60% of the Earth's volcanic activity (the other 40% is attributed to hotspot volcanism). Caldera structure is similar on all of these planetary bodies, though the size varies considerably. The average caldera diameter on Venus is 68 km. The average caldera diameter on Io is close to 40 km, and the mode is 6 km; Tvashtar Paterae is likely the largest caldera with a diameter of 290 km. The average caldera diameter on Mars is 48 km, smaller than Venus. Calderas on Earth are the smallest of all planetary bodies and vary from 1.6 to 80 km as a maximum.Gudmundsson, A. (2008) Magma chamber geometry, fluid transport, local stresses and rock behaviour during collapse caldera formation in Gottsmann, J. and Marti, J. (editors) (2008) Caldera Volcanism: Analysis, Modelling and Response, Amsterdam, Elsevier. p. 319, citing Lipman, P. (2000).\n\nThe Moon\n\nThe Moon has an outer shell of low-density crystalline rock that is a few hundred kilometers thick, which formed due to a rapid creation. The craters of the moon have been well preserved through time and were once thought to have been the result of extreme volcanic activity, but actually were formed by meteorites, nearly all of which took place in the first few hundred million years after the Moon formed. Around 500 million years afterward, the Moon's mantle was able to be extensively melted due to the decay of radioactive elements. Massive basaltic eruptions took place generally at the base of large impact craters. Also, eruptions may have taken place due to a magma reservoir at the base of the crust. This forms a dome, possibly the same morphology of a shield volcano where calderas universally are known to form. Although caldera-like structures are rare on the Moon, they are not completely absent. The Compton-Belkovich Volcanic Complex on the far side of the Moon is thought to be a caldera, possibly an ash-flow caldera.\n\nMars\n\nThe volcanic activity of Mars is concentrated in two major provinces: Tharsis and Elysium. Each province contains a series of giant shield volcanoes that are similar to what we see on Earth and likely are the result of mantle hot spots. The surfaces are dominated by lava flows, and all have one or more collapse calderas. Mars has the largest volcano in the Solar System, Olympus Mons, which is more than three times the height of Mount Everest, with a diameter of 520 km (323 miles). The summit of the mountain has six nested calderas.Philip's World Reference Atlas including Stars and Planets  Publishing House Octopus publishing Group Ltd p. 9\n\nVenus\n\nBecause there is no plate tectonics on Venus, heat is mainly lost by conduction through the lithosphere. This causes enormous lava flows, accounting for 80% of Venus' surface area. Many of the mountains are large shield volcanoes that range in size from 150–400 km in diameter and 2–4 km high. More than 80 of these large shield volcanoes have summit calderas averaging 60 km across.\n\nIo\n\nIo, unusually, is heated by solid flexing due to the tidal influence of Jupiter and Io's orbital resonance with neighboring large moons Europa and Ganymede, which keeps its orbit slightly eccentric. Unlike any of the planets mentioned, Io is continuously volcanically active. For example, the NASA Voyager 1 and Voyager 2 spacecraft detected nine erupting volcanoes while passing Io in 1979. Io has many calderas with diameters tens of kilometers across.\n\nList of volcanic calderas\n\n* Africa\n** Ngorongoro Crater (Tanzania)\n** Menengai Crater (Kenya)\n** Mount Elgon (Uganda/Kenya)\n** Mount Fogo (Cape Verde)\n** Mount Longonot (Kenya)\n** Mount Meru (Tanzania)\n** Erta Ale (Ethiopia)\n** Nabro Volcano (Eritrea)\n** Mallahle (Eritrea)\n** See Europe for calderas in the Canary Islands\n* Asia\n** East Asia\n*** Dakantou Caldera (大墈头) (Shanhuyan Village, Taozhu Town, Linhai, Zhejiang, China)\n*** Ma'anshan Caldera (马鞍山) (Shishan Town (石山镇), Xiuying, Hainan, China)\n*** Yiyang Caldera (宜洋) (Shuangxi Town (双溪镇宜洋村), Pingnan County, Fujian, China)\n*** Aira Caldera (Kagoshima Prefecture, Japan)\n*** Kussharo (Hokkaido, Japan)\n*** Kuttara (Hokkaido, Japan)\n*** Mashū (Hokkaido, Japan)\n*** Aso (Kumamoto Prefecture, Japan)\n*** Kikai Caldera (Kagoshima Prefecture, Japan)\n*** Towada (Aomori Prefecture, Japan)\n*** Tazawa (Akita Prefecture, Japan)\n*** Hakone (Kanagawa Prefecture, Japan)\n*** Mount Halla (Jeju-do, South Korea)\n*** Heaven Lake (Baekdu Mountain, North Korea)\n** Southeast Asia \n*** Mount Pinatubo (Luzon, Philippines)\n*** Taal Volcano (Luzon, Philippines)\n*** Laguna de Bay (Luzon, Philippines)\n*** Batur (Bali, Indonesia)\n*** Krakatoa (Sunda Strait, Indonesia)\n*** Lake Maninjau (Sumatra, Indonesia)\n*** Lake Toba (Sumatra, Indonesia)\n*** Mount Tondano (Sulawesi, Indonesia)\n*** Mount Tambora (Sumbawa, Indonesia)\n*** Tengger Caldera (Java, Indonesia)\n** Southwest Asia\n*** Derik (Mardin, Turkey)\n*** Nemrut (volcano) (Turkey)\n** Russia \n*** Akademia Nauk (Kamchatka Peninsula)\n*** Golovnin (Kuril Islands)\n*** Karymsky Caldera (Kamchatka Peninsula)\n*** Khangar (Kamchatka Peninsula)\n*** Ksudach (Kamchatka Peninsula)\n*** Kurile Lake (Kamchatka Peninsula)\n*** Lvinaya Past (Kuril Islands)\n*** Tao-Rusyr Caldera (Kuril Islands)\n*** Uzon (Kamchatka Peninsula)\n*** Zavaritski Caldera (Kuril Islands)\n*** Yankicha/Ushishir (Kuril Islands)\n*** Chegem Caldera (Kabardino-Balkarian Republic, Northern Caucasus Region)\n* Americas\n** Argentina\n*** Aguas Calientes, Salta Province\n*** Caldera del Atuel, Mendoza Province\n*** Galán, Catamarca Province\n** United States   \n*** Mount Aniakchak (Aniakchak National Monument and Preserve) (Alaska)\n*** Crater Lake on Mount Mazama (Crater Lake National Park, Oregon)\n*** Mt. St. Helens (Washington)\n*** Mount Katmai (Alaska)\n*** La Garita Caldera (Colorado)\n*** Long Valley (California)\n*** Henry's Fork Caldera (Idaho)\n*** Island Park Caldera (Idaho, Wyoming)\n*** Newberry Volcano (Oregon)\n*** McDermitt Caldera (Oregon)\n*** Mount Okmok (Alaska)\n*** Valles Caldera (New Mexico)\n*** Yellowstone Caldera (Wyoming)\n** Canada\n*** Silverthrone Caldera (British Columbia)\n*** Mount Edziza (British Columbia)\n*** Bennett Lake Volcanic Complex (British Columbia/Yukon)\n*** Mount Pleasant Caldera (New Brunswick)\n*** Sturgeon Lake Caldera (Ontario)\n*** Mount Skukum Volcanic Complex (Yukon, Canada)\n*** Blake River Megacaldera Complex (Quebec/Ontario)\n**** New Senator Caldera (Quebec)\n**** Misema Caldera (Ontario/Quebec)\n**** Noranda Caldera (Quebec)\n** Colombia\n*** Arenas crater caldera, Nevado del Ruiz volcano, Caldas Department\n*** Laguna Verde caldera, Azufral volcano, Narino Department\n** Mexico\n*** Amealco Caldera (Querétaro)\n*** Las Cumbres Caldera (Veracruz-Puebla)\n*** Los Azufres Caldera (Michoacán)\n*** Los Humeros Caldera (Veracruz-Puebla)\n*** Mazahua Caldera (Mexico State)\n** Chile\n*** Chaitén\n*** Cordillera Nevada Caldera\n*** Laguna del Maule\n*** Pacana Caldera\n*** Sollipulli\n** Ecuador\n*** Pululahua Geobotanical Reserve\n*** Cuicocha\n*** Quilotoa\n*** Fernandina Island, Galápagos Islands\n*** Sierra Negra (Galápagos)\n** El Salvador \n*** Lake Ilopango\n*** Lake Coatepeque\n** Other\n*** Masaya (Nicaragua)\n*** Lake Atitlan (Guatemala)\n* Europe \n** Banská Štiavnica (Slovakia)\n** Bakuriani/Didveli Caldera (Georgia)\n** Samsari (Georgia)\n** Santorini (Greece)\n** Nisyros (Greece)\n** Askja (Iceland)\n** Grímsvötn (Iceland)\n** Bárðarbunga (Iceland)\n** Katla (Iceland)\n** Krafla (Iceland)\n** Campi Flegrei (Italy)\n** Lake Bracciano (Italy)\n** Lake Bolsena (Italy)\n** Mount Somma which contains Mount Vesuvius (Italy)\n** Las Cañadas (Tenerife, Spain)\n** Glen Coe (Scotland)\n** Laacher See (Germany)\n** Lagoa das Sete Cidades & Furnas  (São Miguel, the Azores, Portugal)\n* Oceania \n** Lake Rotorua (New Zealand)\n** Okataina (New Zealand)\n** Kapenga (New Zealand)\n** Ohakuri (New Zealand)\n** Maroa (New Zealand)\n** Mount Warning (Australia)\n** Reporoa caldera (New Zealand)\n** Lake Taupo (New Zealand)\n** Kilauea (Hawaii, US)\n** Moku‘āweoweo Caldera on Mauna Loa (Hawaii, US)\n** Rano Kau (Easter Island, Chile)\n* Antarctica\n** Deception Island\n* Indian Ocean\n** Cirque de Mafate, Cirque de Salazie, Enclos Fouqué, and Cirque de Cilaos on Réunion\n* Mars\n** Olympus Mons caldera\n* Venus\n** Maat Mons caldera\n\nErosion calderas\n\n* Americas\n** Guaichane-Mamuta (Chile)\n** Mount Tehama (California, US)\n* Europe\n** Caldera de Taburiente (Spain)\n** Scafell Caldera (Lake District, Great Britain)\n* Oceania\n** Tweed Valley (New South Wales, Queensland, Australia)\n* Asia\n** Chegem Caldera (Kabardino-Balkarian Republic, Northern Caucasus Region, Russia)\n** Taal volcano (Philippines) Batangas Province",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Caldera" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7592" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A caldera is a large cauldron-like depression that forms following the evacuation of a magma chamber/reservoir. When large volumes of magma are erupted over a short time, structural support for the crust above the magma chamber is lost. The ground surface then collapses downward into the partially emptied magma chamber, leaving a massive depression at the surface (from one to dozens of kilometers in diameter). Although sometimes described as a crater, the feature is actually a type of sinkhole, as it is formed through subsidence and collapse rather than an explosion or impact. Only seven known caldera-forming collapses have occurred since the start of the 20th century, most recently at Bárðarbunga volcano in Iceland.Gudmundsson, M.T. et al. (2014) Graduale caldera collapse at Bárðarbunga volcano Iceland, regulated by lateral magma outflow, Science, 15.\n\nEtymology \n\nThe word comes from Spanish ', and Latin ', meaning \"cooking pot\".  In some texts the English term cauldron is also used. The term caldera was introduced into the geological vocabulary by the German geologist Leopold von Buch when he published his memoirs of his 1815 visit to the Canary Islands, where he first saw the Las Cañadas caldera on Tenerife, with Montaña Teide dominating the landscape, and then the Caldera de Taburiente on La Palma.\n\nCaldera formation\n\nA collapse is triggered by the emptying of the magma chamber beneath the volcano, sometimes as the result of a large explosive volcanic eruption  (see Tambora  in 1815), but also during effusive eruptions on the flanks of a volcano (see Piton de la Fournaise in 2007) or in a connected fissure system (see Bárðarbunga in 2014–2015). If enough magma is ejected, the emptied chamber is unable to support the weight of the volcanic edifice above it. A roughly circular fracture, the \"ring fault\", develops around the edge of the chamber. Ring fractures serve as feeders for fault intrusions which are also known as ring dykes. Secondary volcanic vents may form above the ring fracture. As the magma chamber empties, the center of the volcano within the ring fracture begins to collapse. The collapse may occur as the result of a single cataclysmic eruption, or it may occur in stages as the result of a series of eruptions. The total area that collapses may be hundreds or thousands of square kilometers.\n\nMineralization\n\nSome calderas are known to host rich ore deposits. One of the world's best-preserved mineralized calderas is the Sturgeon Lake Caldera in northwestern Ontario, Canada, which formed during the Neoarchean era about 2,700 million years ago.\n\nExplosive caldera eruptions\n\nIf the magma is rich in silica, the caldera is often filled in with ignimbrite, tuff, rhyolite, and other igneous rocks. Silica-rich magma has a high viscosity, and therefore does not flow easily like basalt. As a result, gases tend to become trapped at high pressure within the magma. When the magma approaches the surface of the Earth, the rapid off-loading of overlying material causes the trapped gases to decompress rapidly, thus triggering explosive destruction of the magma and spreading volcanic ash over wide areas. Further lava flows may be erupted.\n\nIf volcanic activity continues, the center of the caldera may be uplifted in the form of a resurgent dome such as is seen at Cerro Galán, Lake Toba, Yellowstone, etc., by subsequent intrusion of magma. A silicic or rhyolitic caldera may erupt hundreds or even thousands of cubic kilometers of material in a single event. Even small caldera-forming eruptions, such as Krakatoa in 1883 or Mount Pinatubo in 1991, may result in significant local destruction and a noticeable drop in temperature around the world. Large calderas may have even greater effects.\n\nWhen Yellowstone Caldera last erupted some 650,000 years ago, it released about 1,000 km3 of material (as measured in dense rock equivalent (DRE)), covering a substantial part of North America in up to two metres of debris. By comparison, when Mount St. Helens erupted in 1980, it released ~1.2 km3 (DRE) of ejecta. The ecological effects of the eruption of a large caldera can be seen in the record of the Lake Toba eruption in Indonesia.\n\nToba\n\nAbout 74,000 years ago, this Indonesian volcano released about 2,800 km3 DRE of ejecta, the largest known eruption within the Quaternary Period (last 1.8 million years) and the largest known explosive eruption within the last 25 million years. In the late 1990s, anthropologist Stanley Ambrose proposed that a volcanic winter induced by this eruption reduced the human population to about 2,000–20,000 individuals, resulting in a population bottleneck (see Toba catastrophe theory). More recently several geneticists, including Lynn Jorde and Henry Harpending have proposed that the human species was reduced to approximately five to ten thousand people.[http://www.bbc.co.uk/science/horizon/1999/supervolcanoes_script.shtml Supervolcanoes], BBC2, 3 February 2000 However, there is no direct evidence that the theory is correct. And there is no evidence for any other animal decline or extinction, even in environmentally sensitive species. There is evidence that human habitation continued in India after the eruption. The theory in its strongest form may be incorrect.\n\nEruptions forming even larger calderas are known, especially La Garita Caldera in the San Juan Mountains of Colorado, where the 5,000-km3 Fish Canyon Tuff was blasted out in a single major eruption about 27.8 million years ago.\n\nAt some points in geological time, rhyolitic calderas have appeared in distinct clusters. The remnants of such clusters may be found in places such as the San Juan Mountains of Colorado (formed during the Oligocene, Miocene, and Pliocene periods) or the Saint Francois Mountain Range of Missouri (erupted during the Proterozoic).\n\nNon-explosive calderas\n\nSome volcanoes, such as shield volcanoes Kīlauea and Mauna Loa (respectively the most active and second largest on Earth, are both on the island of Hawaii), form calderas in a different fashion. The magma feeding these volcanoes is basalt which is silica poor. As a result, the magma is much less viscous than the magma of a rhyolitic volcano, and the magma chamber is drained by large lava flows rather than by explosive events. The resulting calderas are also known as subsidence calderas, and can form more gradually than explosive calderas. For instance, the caldera atop Fernandina Island underwent a collapse in 1968, when parts of the caldera floor dropped 350 meters. Kilauea Caldera has an inner crater known as Halema‘uma‘u, which has often been filled by a lava lake.\n\nDuring the April 2007 eruption of the Piton de la Fournaise on the island of Réunion, the floor of the main crater suddenly dropped about 300 m. This was attributed to the withdrawal of magma which was being erupted through a vent lower down on the southern flank of the volcano.\n\nAnother process that may allow a caldera to form can occur if molten lava can escape through a breach on the caldera's rim.\n\nExtraterrestrial calderas\n\nSince the early 1960s, it has been known that volcanism has occurred on other planets and moons in the Solar System. Through the use of manned and unmanned spacecraft, volcanism has been discovered on Venus, Mars, the Moon, and Io, a satellite of Jupiter. None of these worlds have plate tectonics, which contributes approximately 60% of the Earth's volcanic activity (the other 40% is attributed to hotspot volcanism). Caldera structure is similar on all of these planetary bodies, though the size varies considerably. The average caldera diameter on Venus is 68 km. The average caldera diameter on Io is close to 40 km, and the mode is 6 km; Tvashtar Paterae is likely the largest caldera with a diameter of 290 km. The average caldera diameter on Mars is 48 km, smaller than Venus. Calderas on Earth are the smallest of all planetary bodies and vary from 1.6 to 80 km as a maximum.Gudmundsson, A. (2008) Magma chamber geometry, fluid transport, local stresses and rock behaviour during collapse caldera formation in Gottsmann, J. and Marti, J. (editors) (2008) Caldera Volcanism: Analysis, Modelling and Response, Amsterdam, Elsevier. p. 319, citing Lipman, P. (2000).\n\nThe Moon\n\nThe Moon has an outer shell of low-density crystalline rock that is a few hundred kilometers thick, which formed due to a rapid creation. The craters of the moon have been well preserved through time and were once thought to have been the result of extreme volcanic activity, but actually were formed by meteorites, nearly all of which took place in the first few hundred million years after the Moon formed. Around 500 million years afterward, the Moon's mantle was able to be extensively melted due to the decay of radioactive elements. Massive basaltic eruptions took place generally at the base of large impact craters. Also, eruptions may have taken place due to a magma reservoir at the base of the crust. This forms a dome, possibly the same morphology of a shield volcano where calderas universally are known to form. Although caldera-like structures are rare on the Moon, they are not completely absent. The Compton-Belkovich Volcanic Complex on the far side of the Moon is thought to be a caldera, possibly an ash-flow caldera.\n\nMars\n\nThe volcanic activity of Mars is concentrated in two major provinces: Tharsis and Elysium. Each province contains a series of giant shield volcanoes that are similar to what we see on Earth and likely are the result of mantle hot spots. The surfaces are dominated by lava flows, and all have one or more collapse calderas. Mars has the largest volcano in the Solar System, Olympus Mons, which is more than three times the height of Mount Everest, with a diameter of 520 km (323 miles). The summit of the mountain has six nested calderas.Philip's World Reference Atlas including Stars and Planets  Publishing House Octopus publishing Group Ltd p. 9\n\nVenus\n\nBecause there is no plate tectonics on Venus, heat is mainly lost by conduction through the lithosphere. This causes enormous lava flows, accounting for 80% of Venus' surface area. Many of the mountains are large shield volcanoes that range in size from 150–400 km in diameter and 2–4 km high. More than 80 of these large shield volcanoes have summit calderas averaging 60 km across.\n\nIo\n\nIo, unusually, is heated by solid flexing due to the tidal influence of Jupiter and Io's orbital resonance with neighboring large moons Europa and Ganymede, which keeps its orbit slightly eccentric. Unlike any of the planets mentioned, Io is continuously volcanically active. For example, the NASA Voyager 1 and Voyager 2 spacecraft detected nine erupting volcanoes while passing Io in 1979. Io has many calderas with diameters tens of kilometers across.\n\nList of volcanic calderas\n\n* Africa\n** Ngorongoro Crater (Tanzania)\n** Menengai Crater (Kenya)\n** Mount Elgon (Uganda/Kenya)\n** Mount Fogo (Cape Verde)\n** Mount Longonot (Kenya)\n** Mount Meru (Tanzania)\n** Erta Ale (Ethiopia)\n** Nabro Volcano (Eritrea)\n** Mallahle (Eritrea)\n** See Europe for calderas in the Canary Islands\n* Asia\n** East Asia\n*** Dakantou Caldera (大墈头) (Shanhuyan Village, Taozhu Town, Linhai, Zhejiang, China)\n*** Ma'anshan Caldera (马鞍山) (Shishan Town (石山镇), Xiuying, Hainan, China)\n*** Yiyang Caldera (宜洋) (Shuangxi Town (双溪镇宜洋村), Pingnan County, Fujian, China)\n*** Aira Caldera (Kagoshima Prefecture, Japan)\n*** Kussharo (Hokkaido, Japan)\n*** Kuttara (Hokkaido, Japan)\n*** Mashū (Hokkaido, Japan)\n*** Aso (Kumamoto Prefecture, Japan)\n*** Kikai Caldera (Kagoshima Prefecture, Japan)\n*** Towada (Aomori Prefecture, Japan)\n*** Tazawa (Akita Prefecture, Japan)\n*** Hakone (Kanagawa Prefecture, Japan)\n*** Mount Halla (Jeju-do, South Korea)\n*** Heaven Lake (Baekdu Mountain, North Korea)\n** Southeast Asia \n*** Mount Pinatubo (Luzon, Philippines)\n*** Taal Volcano (Luzon, Philippines)\n*** Laguna de Bay (Luzon, Philippines)\n*** Batur (Bali, Indonesia)\n*** Krakatoa (Sunda Strait, Indonesia)\n*** Lake Maninjau (Sumatra, Indonesia)\n*** Lake Toba (Sumatra, Indonesia)\n*** Mount Tondano (Sulawesi, Indonesia)\n*** Mount Tambora (Sumbawa, Indonesia)\n*** Tengger Caldera (Java, Indonesia)\n** Southwest Asia\n*** Derik (Mardin, Turkey)\n*** Nemrut (volcano) (Turkey)\n** Russia \n*** Akademia Nauk (Kamchatka Peninsula)\n*** Golovnin (Kuril Islands)\n*** Karymsky Caldera (Kamchatka Peninsula)\n*** Khangar (Kamchatka Peninsula)\n*** Ksudach (Kamchatka Peninsula)\n*** Kurile Lake (Kamchatka Peninsula)\n*** Lvinaya Past (Kuril Islands)\n*** Tao-Rusyr Caldera (Kuril Islands)\n*** Uzon (Kamchatka Peninsula)\n*** Zavaritski Caldera (Kuril Islands)\n*** Yankicha/Ushishir (Kuril Islands)\n*** Chegem Caldera (Kabardino-Balkarian Republic, Northern Caucasus Region)\n* Americas\n** Argentina\n*** Aguas Calientes, Salta Province\n*** Caldera del Atuel, Mendoza Province\n*** Galán, Catamarca Province\n** United States   \n*** Mount Aniakchak (Aniakchak National Monument and Preserve) (Alaska)\n*** Crater Lake on Mount Mazama (Crater Lake National Park, Oregon)\n*** Mt. St. Helens (Washington)\n*** Mount Katmai (Alaska)\n*** La Garita Caldera (Colorado)\n*** Long Valley (California)\n*** Henry's Fork Caldera (Idaho)\n*** Island Park Caldera (Idaho, Wyoming)\n*** Newberry Volcano (Oregon)\n*** McDermitt Caldera (Oregon)\n*** Mount Okmok (Alaska)\n*** Valles Caldera (New Mexico)\n*** Yellowstone Caldera (Wyoming)\n** Canada\n*** Silverthrone Caldera (British Columbia)\n*** Mount Edziza (British Columbia)\n*** Bennett Lake Volcanic Complex (British Columbia/Yukon)\n*** Mount Pleasant Caldera (New Brunswick)\n*** Sturgeon Lake Caldera (Ontario)\n*** Mount Skukum Volcanic Complex (Yukon, Canada)\n*** Blake River Megacaldera Complex (Quebec/Ontario)\n**** New Senator Caldera (Quebec)\n**** Misema Caldera (Ontario/Quebec)\n**** Noranda Caldera (Quebec)\n** Colombia\n*** Arenas crater caldera, Nevado del Ruiz volcano, Caldas Department\n*** Laguna Verde caldera, Azufral volcano, Narino Department\n** Mexico\n*** Amealco Caldera (Querétaro)\n*** Las Cumbres Caldera (Veracruz-Puebla)\n*** Los Azufres Caldera (Michoacán)\n*** Los Humeros Caldera (Veracruz-Puebla)\n*** Mazahua Caldera (Mexico State)\n** Chile\n*** Chaitén\n*** Cordillera Nevada Caldera\n*** Laguna del Maule\n*** Pacana Caldera\n*** Sollipulli\n** Ecuador\n*** Pululahua Geobotanical Reserve\n*** Cuicocha\n*** Quilotoa\n*** Fernandina Island, Galápagos Islands\n*** Sierra Negra (Galápagos)\n** El Salvador \n*** Lake Ilopango\n*** Lake Coatepeque\n** Other\n*** Masaya (Nicaragua)\n*** Lake Atitlan (Guatemala)\n* Europe \n** Banská Štiavnica (Slovakia)\n** Bakuriani/Didveli Caldera (Georgia)\n** Samsari (Georgia)\n** Santorini (Greece)\n** Nisyros (Greece)\n** Askja (Iceland)\n** Grímsvötn (Iceland)\n** Bárðarbunga (Iceland)\n** Katla (Iceland)\n** Krafla (Iceland)\n** Campi Flegrei (Italy)\n** Lake Bracciano (Italy)\n** Lake Bolsena (Italy)\n** Mount Somma which contains Mount Vesuvius (Italy)\n** Las Cañadas (Tenerife, Spain)\n** Glen Coe (Scotland)\n** Laacher See (Germany)\n** Lagoa das Sete Cidades & Furnas  (São Miguel, the Azores, Portugal)\n* Oceania \n** Lake Rotorua (New Zealand)\n** Okataina (New Zealand)\n** Kapenga (New Zealand)\n** Ohakuri (New Zealand)\n** Maroa (New Zealand)\n** Mount Warning (Australia)\n** Reporoa caldera (New Zealand)\n** Lake Taupo (New Zealand)\n** Kilauea (Hawaii, US)\n** Moku‘āweoweo Caldera on Mauna Loa (Hawaii, US)\n** Rano Kau (Easter Island, Chile)\n* Antarctica\n** Deception Island\n* Indian Ocean\n** Cirque de Mafate, Cirque de Salazie, Enclos Fouqué, and Cirque de Cilaos on Réunion\n* Mars\n** Olympus Mons caldera\n* Venus\n** Maat Mons caldera\n\nErosion calderas\n\n* Americas\n** Guaichane-Mamuta (Chile)\n** Mount Tehama (California, US)\n* Europe\n** Caldera de Taburiente (Spain)\n** Scafell Caldera (Lake District, Great Britain)\n* Oceania\n** Tweed Valley (New South Wales, Queensland, Australia)\n* Asia\n** Chegem Caldera (Kabardino-Balkarian Republic, Northern Caucasus Region, Russia)\n** Taal volcano (Philippines) Batangas Province. Caldera. http://en.wikipedia.org/?curid=7592."
  }
}
