{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7088",
  "eid" : "dfecb080-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778455432,
  "textBody" : "List of cryptographers.\n\nPre twentieth century\n\n* Al-Khalil ibn Ahmad al-Farahidi: wrote a (now lost) book on cryptography titled the \"Book of Cryptographic Messages\".\n* Al-Kindi, 9th century Arabic polymath and originator of frequency analysis.\n* Athanasius Kircher, attempts to decipher crypted messages\n* Augustus the Younger, Duke of Brunswick-Lüneburg, wrote a standard book on cryptography\n* Ibn Wahshiyya: published several cipher alphabets that were used to encrypt magic formulas. \n* John Dee, wrote an occult book, which in fact was a cover for crypted text\n* Ibn 'Adlan: 13th-century cryptographer who made important contributions on the sample size of the frequency analysis.\n* Duke of Mantua Francesco I Gonzaga is the one who used the earliest example of homophonic Substitution cipher in early 1400s.David Salomon. [https://books.google.com.tr/books?idA88kvYwIVu0C&pg\nPA224&lpgPA224&dq\nhomophonic+cipher+mantua+1400s&sourcebl&ots\nyFuWwRbqiG&sigSUYa0tmxxaeZhkBMkk84p1Nb4m8&hl\ntr&saX&ved\n0ahUKEwiokPLgyvTKAhULCywKHegKDYEQ6AEIGjAA#vonepage&q\nhomophonic%20cipher%20mantua%201400s&f=false Coding for Data and Computer Communications]. Springer, 2005.Fred A. Stahl. \"[http://www.computer.org/csdl/proceedings/afips/1973/5081/00/50810565.pdf A homophonic cipher for computational cryptography]\" Proceedings of the national computer conference and exposition (AFIPS '73), pp. 123–126, New York, USA, 1973.\n* Ibn al-Durayhim: gave detailed descriptions of eight cipher systems that discussed substitution ciphers, leading to the earliest suggestion of a \"tableau\" of the kind that two centuries later became known as the \"Vigenère table\".\n* Ahmad al-Qalqashandi: Author of Subh al-a 'sha, a fourteen volume encyclopedia in Arabic, which included a section on cryptology. The list of ciphers in this work included both substitution and transposition, and for the first time, a cipher with multiple substitutions for each plaintext letter.\n* Charles Babbage, UK, 19th century mathematician who, about the time of the Crimean War, secretly developed an effective attack against polyalphabetic substitution ciphers.\n* Leone Battista Alberti, polymath/universal genius, inventor of polyalphabetic substitution (more specifically, the Alberti cipher), and what may have been the first mechanical encryption aid.\n* Giovanni Battista della Porta, author of a seminal work on cryptanalysis.\n* Étienne Bazeries, French, military, considered one of the greatest natural cryptanalysts. Best known for developing the \"Bazeries Cylinder\" and his influential 1901 text Les Chiffres secrets dévoilés (\"Secret ciphers unveiled\").\n* Giovan Battista Bellaso, Italian cryptologist\n* Giovanni Fontana (engineer), wrote two encrypted books\n* Hildegard of Bingen used her own alphabet to write letters.\n* Julius Caesar, Roman general/politician, has the Caesar cipher named after him, and a lost work on cryptography by Probus (probably Valerius Probus) is claimed to have covered his use of military cryptography in some detail. It is likely that he did not invent the cipher named after him, as other substitution ciphers were in use well before his time.\n* Friedrich Kasiski, author of the first published attack on the Vigenère cipher, now known as the Kasiski test.\n* Auguste Kerckhoffs, known for contributing cipher design principles.\n* Johannes Trithemius, mystic and first to describe tableaux (tables) for use in polyalphabetic substitution. Wrote an early work on steganography and cryptography generally.\n* Philips van Marnix, lord of Sint-Aldegonde, deciphered Spanish messages for William the Silent during the Dutch revolt against the Spanish.\n* John Wallis codebreaker for Cromwell and Charles II\n* Sir Charles Wheatstone, inventor of the so-called Playfair cipher and general polymath.\n\nWorld War I and World War II wartime cryptographers\n\n* Lambros D. Callimahos, US, NSA, worked with William F. Friedman, taught NSA cryptanalysts.\n* Alec Naylor Dakin, UK, Hut 4, Bletchley park during World War II.\n* Ludomir Danilewicz, Poland, Biuro Szyfrow, helped to construct the Enigma machine copies to break the ciphers.\n* Alastair Denniston, UK, director of GC&CS at Bletchley Park during World War II.\n* Agnes Meyer Driscoll, US, broke several Japanese ciphers.\n* William F. Friedman, US, SIS, introduced statistical methods into cryptography.\n* Jack Good UK, GC&CS, Bletchley Park worked with Alan Turing on the statistical approach to cryptanalysis.\n* Nigel de Grey, UK, Room 40, played an important role in the decryption of the Zimmermann Telegram during World War I.\n* Dillwyn Knox, UK, Room 40 and GC&CS, broke commercial Enigma cipher as used by the Abwehr (German military intelligence).\n* Solomon Kullback US, SIS\n* Frank W. Lewis US, worked with William F. Friedman, puzzle master\n* William Hamilton Martin and Bernon F. Mitchell, U.S. National Security Agency cryptologists who defected to the Soviet Union in 1960\n* Leo Marks UK, SOE cryptography director, author and playwright.\n* Donald Michie UK, GC&CS, Bletchley Park worked on Cryptanalysis of the Lorenz cipher and the Colossus computer.\n* Max Newman, UK, GC&CS, Bletchley Park headed the section that developed the Colossus computer for Cryptanalysis of the Lorenz cipher. \n* Georges Painvin French, broke the ADFGVX cipher during the First World War.\n* Marian Rejewski, Poland, Biuro Szyfrów, a Polish mathematician and cryptologist who, in 1932, solved the Enigma machine with plugboard, the main cipher device then in use by Germany.\n* John Joseph Rochefort US, made major contributions to the break into JN-25 after the attack on Pearl Harbor.\n* Frank Rowlett US, SIS, leader of the team that broke Purple.\n* Jerzy Różycki, Poland, Biuro Szyfrów, helped break German Enigma ciphers.\n* Luigi Sacco, Italy, Italian General and author of the Manual of Cryptography.\n* Laurance Safford US, chief cryptographer for the US Navy for 2 decades+, including World War II.\n* Abraham Sinkov US, SIS.\n* John Tiltman UK, Brigadier, Room 40, GC&CS, Bletchley Park, GCHQ, NSA. Extraordinary length and range of cryptographic service\n* Alan Mathison Turing UK,  GC&CS, Bletchley Park where he was chief cryptographer, inventor of the Bombe that was used in decrypting Enigma, mathematician, logician, and renowned pioneer of Computer Science. \n* William Thomas Tutte UK, GC&CS, Bletchley Park, with John Tiltman, broke Lorenz SZ 40/42 encryption machine (codenamed Tunny) leading to the development of the Colossus computer.\n* William Stone Weedon, US, \n* Gordon Welchman UK, GC&CS, Bletchley Park where he was head of Hut Six (German Army and Air Force Enigma cipher. decryption), made an important contribution to the design of the Bombe.\n* Herbert Yardley US, MI8 (US), author \"The American Black Chamber\", worked in China as a cryptographer and briefly in Canada.\n* Henryk Zygalski, Poland, Biuro Szyfrów, helped break German Enigma ciphers.\n* Karl Stein German, Head of the Division IVa (security of own processes) at Cipher Department of the High Command of the Wehrmacht. Discoverer of Stein manifold.\n* Gisbert Hasenjaeger German, Tester of the Enigma. Discovered new proof of the completeness theorem of Kurt Gödel for predicate logic.\n* Heinrich Scholz German, Worked in Division IVa at OKW. Logician and pen friend of Alan Turning.\n* Gottfried Köthe German, Cryptanalyst at OKW. Mathematician created  theory of Topological Vector Spaces.\n* Ernst Witt German, Mathematician at OKW. Mathematical Discoveries Named After Ernst Witt.\n* Helmut Grunsky German, worked in complex analysis and geometric function theory. He introduced Grunsky's theorem and the Grunsky inequalities.\n* Georg Hamel.\n* Oswald Teichmüller German, Temporarily employed at OKW as cryptanalyst. Introduced quasiconformal mappings and differential geometric methods into complex analysis. Described by Friedrich L. Bauer as an extreme Nazi and a true genius. \n* Hans Rohrbach German, Mathematician at AA/Pers Z, the German department of state, civilian diplomatic cryptological agency.\n* Wolfgang Franz German, Mathematician who worked at OKW. Later significant discoveries in Topology. \n* Werner Weber German, Mathematician  at OKW.\n* Georg Aumann German, Mathematician at OKW. His doctoral student was Friedrich L. Bauer.\n* Otto Leiberich German, Mathematician who worked as a linguist at the Cipher Department of the High Command of the Wehrmacht.\n* Alexander Aigner German, Mathematician who worked at OKW.\n* Erich Hüttenhain German, Chief cryptanalyst of and led Chi IV (section 4) of the Cipher Department of the High Command of the Wehrmacht. A German mathematician and cryptanalyst who tested a number of German cipher machines and found them to be breakable.  \n* Wilhelm Fenner German, Chief Cryptologist and Director of Cipher Department of the High Command of the Wehrmacht. \n* Walther Fricke German, Worked alongside Dr Erich Hüttenhain at Cipher Department of the High Command of the Wehrmacht. Mathematician, logician, cryptanalyst and linguist.\n* Fritz Menzer German. Inventor of SG39 and SG41.\n* William David Rogers  Deciphered coded messages in Africa WW 2.\n\nOther pre-computer\n\n* Rosario Candela, US, Architect and notable amateur cryptologist who authored books and taught classes on the subject to civilians at Hunter College.\n* Elizebeth Friedman, US, Coast Guard and US Treasury Department cryptographer.\n* Claude Elwood Shannon, US, founder of information theory, proved the one-time pad to be unbreakable.\n* Bill Wlikinson, American Ku Klux Klan leader, served as a Navy submarine cryptographer in the 1960s\n\nModern\n\nSee also: Category:Modern cryptographers for an exhaustive list.\n\nSymmetric-key algorithm inventors\n\n* Ross Anderson, UK, University of Cambridge, co-inventor of the Serpent cipher.\n* Paulo S. L. M. Barreto, Brazilian, University of São Paulo, co-inventor of the Whirlpool hash function.\n* George Blakley, US, independent inventor of secret sharing.\n* Eli Biham, Israel, co-inventor of the Serpent cipher.\n* Don Coppersmith, co-inventor of DES and MARS ciphers.\n* Joan Daemen, Belgian, co-developer of Rijndael which became the Advanced Encryption Standard (AES), and Keccak which became SHA-3.\n* Horst Feistel, German, IBM, namesake of Feistel networks and Lucifer cipher.\n* Lars Knudsen, Denmark, co-inventor of the Serpent cipher.\n* Ralph Merkle, US, inventor of Merkle trees.\n* Bart Preneel, Belgian, co-inventor of RIPEMD-160.\n* Vincent Rijmen, Belgian, co-developer of Rijndael which became the Advanced Encryption Standard (AES).\n* Ronald L. Rivest, US, MIT, inventor of RC cipher series and MD algorithm series.\n* Bruce Schneier, US, inventor of Blowfish and co-inventor of Twofish and Threefish.\n* Xuejia Lai, CH, co-inventor of International Data Encryption Algorithm (IDEA).\n* Adi Shamir, Israel, Weizmann Institute, inventor of secret sharing.\n* Arnaldo Rivera Pérez, US, independent inventor of Full Symmetric-key_algorithm on Cryptographic Service Provider.\n\nAsymmetric-key algorithm inventors\n\n* Leonard Adleman, US, USC, the 'A' in RSA.\n* David Chaum, US, inventor of blind signatures.\n* Clifford Cocks, UK GCHQ first inventor of RSA, a fact that remained secret until 1997 and so was unknown to Rivest, Shamir, and Adleman.\n* Whitfield Diffie, US, (public) co-inventor of the Diffie-Hellman key-exchange protocol.\n* Taher Elgamal, US (born Egyptian), inventor of the Elgamal discrete log cryptosystem.\n* Shafi Goldwasser, US and Israel, MIT and Weizmann Institute, co-discoverer of zero-knowledge proofs.\n* Martin Hellman, US, (public) co-inventor of the Diffie-Hellman key-exchange protocol.\n* Neal Koblitz, independent co-creator of elliptic curve cryptography.\n* Alfred Menezes, co-inventor of MQV, an elliptic curve technique.\n* Silvio Micali, US (born Italian), MIT, co-discoverer of zero-knowledge proofs.\n* Victor Miller, independent co-creator of elliptic curve cryptography.\n* David Naccache, inventor of the Naccache–Stern cryptosystem and of the Naccache–Stern knapsack cryptosystem.\n* Moni Naor, co-inventor the Naor-Yung encryption paradigm for CCA security.\n* Tatsuaki Okamoto, co-creator of :de:Okamoto-Uchiyama-Kryptosystem\n* Pascal Paillier, inventor of Paillier encryption.\n* Michael O. Rabin, Israel, inventor of Rabin encryption.\n* Ronald L. Rivest, US, MIT, the 'R' in RSA.\n* Adi Shamir, Israel, Weizmann Institute, the 'S' in RSA.\n* Shigenori Uchiyama, co-creator of :de:Okamoto-Uchiyama-Kryptosystem.\n* Moti Yung, co-inventor the Naor-Yung encryption paradigm for CCA security.\n* David W.Kravitz, inventor of the Digital Signature Algorithm (DSA).\n\nCryptanalysts\n\n* Ross Anderson, UK.\n* Eli Biham, Israel, co-discoverer of differential cryptanalysis and Related-key attack.\n* Matt Blaze, US.\n* Dan Boneh, US, Stanford University.\n* Niels Ferguson, Netherlands, co-inventor of Twofish and Fortuna.\n* Ian Goldberg, Canada, University of Waterloo.\n* Jovan Dj. Golić, Serbia, known for correlation attacks on clock-controlled systems, linear cryptanalysis of stream ciphers, inversion attack\n* Lars Knudsen, Denmark, DTU, discovered integral cryptanalysis.\n* Paul Kocher, US, discovered differential power analysis.\n* Mitsuru Matsui, Japan, discoverer of linear cryptanalysis.\n* David Wagner, US, UC Berkeley,  co-discoverer of the slide and boomerang attacks.\n* Xiaoyun Wang, the People's Republic of China, known for MD5 and SHA-1 hash function attacks.\n* Willi Meier, Switzerland, known for correlation attack, algebraic attack stream cipher and hash function.\n* Alex Biryukov, University of Luxembourg, known for impossible differential cryptanalysis and slide attack.\n*Moti Yung, Kleptography.\n\nAlgorithmic number theorists\n\n* Daniel J. Bernstein, US, known for battle with US government in Bernstein v. United States.\n* Don Coppersmith, US\n* Dag Arne Osvik, Norway\n\nTheoreticians\n\n* Mihir Bellare, US, UCSD, co-proposer of the Random oracle model.\n* Dan Boneh, US, Stanford.\n* Gilles Brassard, Canada, Université de Montréal. Co-inventor of quantum cryptography.\n* Claude Crépeau, Canada, McGill University.\n* Oded Goldreich, Israel, Weizmann Institute, author of Foundations of Cryptography.\n* Shafi Goldwasser, US and Israel.\n* Silvio Micali, US.\n* Rafail Ostrovsky, US, UCLA.\n* Charles Rackoff, co-discoverer of zero-knowledge proofs.\n* Phillip Rogaway, US, UC Davis, co-proposer of the Random oracle model.\n* Amit Sahai, US, UCLA.\n* Gustavus Simmons, US, Sandia, authentication theory.\n* Moti Yung, US, Google.\n\nGovernment cryptographers\n\n* Clifford Cocks, UK, GCHQ, secret inventor of the algorithm later known as RSA.\n* James H. Ellis, UK, GCHQ, secretly proved the possibility of asymmetric encryption.\n* Malcolm Williamson, UK, GCHQ, secret inventor of the protocol later known as the Diffie–Hellman key exchange.\n\nCryptographer businesspeople\n\n* Bruce Schneier, US, CTO and founder of Counterpane Internet Security, Inc. and cryptography author.\n* Scott Vanstone, Canada, founder of Certicom and elliptic curve cryptography proponent.\n* Colin Percival, Canada, founder of Tarsnap and developer of scrypt.\n* Dag Arne Osvik, Norway, founder and CEO of AlpCode AS.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "List of cryptographers" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7088" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "List of cryptographers.\n\nPre twentieth century\n\n* Al-Khalil ibn Ahmad al-Farahidi: wrote a (now lost) book on cryptography titled the \"Book of Cryptographic Messages\".\n* Al-Kindi, 9th century Arabic polymath and originator of frequency analysis.\n* Athanasius Kircher, attempts to decipher crypted messages\n* Augustus the Younger, Duke of Brunswick-Lüneburg, wrote a standard book on cryptography\n* Ibn Wahshiyya: published several cipher alphabets that were used to encrypt magic formulas. \n* John Dee, wrote an occult book, which in fact was a cover for crypted text\n* Ibn 'Adlan: 13th-century cryptographer who made important contributions on the sample size of the frequency analysis.\n* Duke of Mantua Francesco I Gonzaga is the one who used the earliest example of homophonic Substitution cipher in early 1400s.David Salomon. [https://books.google.com.tr/books?idA88kvYwIVu0C&pg\nPA224&lpgPA224&dq\nhomophonic+cipher+mantua+1400s&sourcebl&ots\nyFuWwRbqiG&sigSUYa0tmxxaeZhkBMkk84p1Nb4m8&hl\ntr&saX&ved\n0ahUKEwiokPLgyvTKAhULCywKHegKDYEQ6AEIGjAA#vonepage&q\nhomophonic%20cipher%20mantua%201400s&f=false Coding for Data and Computer Communications]. Springer, 2005.Fred A. Stahl. \"[http://www.computer.org/csdl/proceedings/afips/1973/5081/00/50810565.pdf A homophonic cipher for computational cryptography]\" Proceedings of the national computer conference and exposition (AFIPS '73), pp. 123–126, New York, USA, 1973.\n* Ibn al-Durayhim: gave detailed descriptions of eight cipher systems that discussed substitution ciphers, leading to the earliest suggestion of a \"tableau\" of the kind that two centuries later became known as the \"Vigenère table\".\n* Ahmad al-Qalqashandi: Author of Subh al-a 'sha, a fourteen volume encyclopedia in Arabic, which included a section on cryptology. The list of ciphers in this work included both substitution and transposition, and for the first time, a cipher with multiple substitutions for each plaintext letter.\n* Charles Babbage, UK, 19th century mathematician who, about the time of the Crimean War, secretly developed an effective attack against polyalphabetic substitution ciphers.\n* Leone Battista Alberti, polymath/universal genius, inventor of polyalphabetic substitution (more specifically, the Alberti cipher), and what may have been the first mechanical encryption aid.\n* Giovanni Battista della Porta, author of a seminal work on cryptanalysis.\n* Étienne Bazeries, French, military, considered one of the greatest natural cryptanalysts. Best known for developing the \"Bazeries Cylinder\" and his influential 1901 text Les Chiffres secrets dévoilés (\"Secret ciphers unveiled\").\n* Giovan Battista Bellaso, Italian cryptologist\n* Giovanni Fontana (engineer), wrote two encrypted books\n* Hildegard of Bingen used her own alphabet to write letters.\n* Julius Caesar, Roman general/politician, has the Caesar cipher named after him, and a lost work on cryptography by Probus (probably Valerius Probus) is claimed to have covered his use of military cryptography in some detail. It is likely that he did not invent the cipher named after him, as other substitution ciphers were in use well before his time.\n* Friedrich Kasiski, author of the first published attack on the Vigenère cipher, now known as the Kasiski test.\n* Auguste Kerckhoffs, known for contributing cipher design principles.\n* Johannes Trithemius, mystic and first to describe tableaux (tables) for use in polyalphabetic substitution. Wrote an early work on steganography and cryptography generally.\n* Philips van Marnix, lord of Sint-Aldegonde, deciphered Spanish messages for William the Silent during the Dutch revolt against the Spanish.\n* John Wallis codebreaker for Cromwell and Charles II\n* Sir Charles Wheatstone, inventor of the so-called Playfair cipher and general polymath.\n\nWorld War I and World War II wartime cryptographers\n\n* Lambros D. Callimahos, US, NSA, worked with William F. Friedman, taught NSA cryptanalysts.\n* Alec Naylor Dakin, UK, Hut 4, Bletchley park during World War II.\n* Ludomir Danilewicz, Poland, Biuro Szyfrow, helped to construct the Enigma machine copies to break the ciphers.\n* Alastair Denniston, UK, director of GC&CS at Bletchley Park during World War II.\n* Agnes Meyer Driscoll, US, broke several Japanese ciphers.\n* William F. Friedman, US, SIS, introduced statistical methods into cryptography.\n* Jack Good UK, GC&CS, Bletchley Park worked with Alan Turing on the statistical approach to cryptanalysis.\n* Nigel de Grey, UK, Room 40, played an important role in the decryption of the Zimmermann Telegram during World War I.\n* Dillwyn Knox, UK, Room 40 and GC&CS, broke commercial Enigma cipher as used by the Abwehr (German military intelligence).\n* Solomon Kullback US, SIS\n* Frank W. Lewis US, worked with William F. Friedman, puzzle master\n* William Hamilton Martin and Bernon F. Mitchell, U.S. National Security Agency cryptologists who defected to the Soviet Union in 1960\n* Leo Marks UK, SOE cryptography director, author and playwright.\n* Donald Michie UK, GC&CS, Bletchley Park worked on Cryptanalysis of the Lorenz cipher and the Colossus computer.\n* Max Newman, UK, GC&CS, Bletchley Park headed the section that developed the Colossus computer for Cryptanalysis of the Lorenz cipher. \n* Georges Painvin French, broke the ADFGVX cipher during the First World War.\n* Marian Rejewski, Poland, Biuro Szyfrów, a Polish mathematician and cryptologist who, in 1932, solved the Enigma machine with plugboard, the main cipher device then in use by Germany.\n* John Joseph Rochefort US, made major contributions to the break into JN-25 after the attack on Pearl Harbor.\n* Frank Rowlett US, SIS, leader of the team that broke Purple.\n* Jerzy Różycki, Poland, Biuro Szyfrów, helped break German Enigma ciphers.\n* Luigi Sacco, Italy, Italian General and author of the Manual of Cryptography.\n* Laurance Safford US, chief cryptographer for the US Navy for 2 decades+, including World War II.\n* Abraham Sinkov US, SIS.\n* John Tiltman UK, Brigadier, Room 40, GC&CS, Bletchley Park, GCHQ, NSA. Extraordinary length and range of cryptographic service\n* Alan Mathison Turing UK,  GC&CS, Bletchley Park where he was chief cryptographer, inventor of the Bombe that was used in decrypting Enigma, mathematician, logician, and renowned pioneer of Computer Science. \n* William Thomas Tutte UK, GC&CS, Bletchley Park, with John Tiltman, broke Lorenz SZ 40/42 encryption machine (codenamed Tunny) leading to the development of the Colossus computer.\n* William Stone Weedon, US, \n* Gordon Welchman UK, GC&CS, Bletchley Park where he was head of Hut Six (German Army and Air Force Enigma cipher. decryption), made an important contribution to the design of the Bombe.\n* Herbert Yardley US, MI8 (US), author \"The American Black Chamber\", worked in China as a cryptographer and briefly in Canada.\n* Henryk Zygalski, Poland, Biuro Szyfrów, helped break German Enigma ciphers.\n* Karl Stein German, Head of the Division IVa (security of own processes) at Cipher Department of the High Command of the Wehrmacht. Discoverer of Stein manifold.\n* Gisbert Hasenjaeger German, Tester of the Enigma. Discovered new proof of the completeness theorem of Kurt Gödel for predicate logic.\n* Heinrich Scholz German, Worked in Division IVa at OKW. Logician and pen friend of Alan Turning.\n* Gottfried Köthe German, Cryptanalyst at OKW. Mathematician created  theory of Topological Vector Spaces.\n* Ernst Witt German, Mathematician at OKW. Mathematical Discoveries Named After Ernst Witt.\n* Helmut Grunsky German, worked in complex analysis and geometric function theory. He introduced Grunsky's theorem and the Grunsky inequalities.\n* Georg Hamel.\n* Oswald Teichmüller German, Temporarily employed at OKW as cryptanalyst. Introduced quasiconformal mappings and differential geometric methods into complex analysis. Described by Friedrich L. Bauer as an extreme Nazi and a true genius. \n* Hans Rohrbach German, Mathematician at AA/Pers Z, the German department of state, civilian diplomatic cryptological agency.\n* Wolfgang Franz German, Mathematician who worked at OKW. Later significant discoveries in Topology. \n* Werner Weber German, Mathematician  at OKW.\n* Georg Aumann German, Mathematician at OKW. His doctoral student was Friedrich L. Bauer.\n* Otto Leiberich German, Mathematician who worked as a linguist at the Cipher Department of the High Command of the Wehrmacht.\n* Alexander Aigner German, Mathematician who worked at OKW.\n* Erich Hüttenhain German, Chief cryptanalyst of and led Chi IV (section 4) of the Cipher Department of the High Command of the Wehrmacht. A German mathematician and cryptanalyst who tested a number of German cipher machines and found them to be breakable.  \n* Wilhelm Fenner German, Chief Cryptologist and Director of Cipher Department of the High Command of the Wehrmacht. \n* Walther Fricke German, Worked alongside Dr Erich Hüttenhain at Cipher Department of the High Command of the Wehrmacht. Mathematician, logician, cryptanalyst and linguist.\n* Fritz Menzer German. Inventor of SG39 and SG41.\n* William David Rogers  Deciphered coded messages in Africa WW 2.\n\nOther pre-computer\n\n* Rosario Candela, US, Architect and notable amateur cryptologist who authored books and taught classes on the subject to civilians at Hunter College.\n* Elizebeth Friedman, US, Coast Guard and US Treasury Department cryptographer.\n* Claude Elwood Shannon, US, founder of information theory, proved the one-time pad to be unbreakable.\n* Bill Wlikinson, American Ku Klux Klan leader, served as a Navy submarine cryptographer in the 1960s\n\nModern\n\nSee also: Category:Modern cryptographers for an exhaustive list.\n\nSymmetric-key algorithm inventors\n\n* Ross Anderson, UK, University of Cambridge, co-inventor of the Serpent cipher.\n* Paulo S. L. M. Barreto, Brazilian, University of São Paulo, co-inventor of the Whirlpool hash function.\n* George Blakley, US, independent inventor of secret sharing.\n* Eli Biham, Israel, co-inventor of the Serpent cipher.\n* Don Coppersmith, co-inventor of DES and MARS ciphers.\n* Joan Daemen, Belgian, co-developer of Rijndael which became the Advanced Encryption Standard (AES), and Keccak which became SHA-3.\n* Horst Feistel, German, IBM, namesake of Feistel networks and Lucifer cipher.\n* Lars Knudsen, Denmark, co-inventor of the Serpent cipher.\n* Ralph Merkle, US, inventor of Merkle trees.\n* Bart Preneel, Belgian, co-inventor of RIPEMD-160.\n* Vincent Rijmen, Belgian, co-developer of Rijndael which became the Advanced Encryption Standard (AES).\n* Ronald L. Rivest, US, MIT, inventor of RC cipher series and MD algorithm series.\n* Bruce Schneier, US, inventor of Blowfish and co-inventor of Twofish and Threefish.\n* Xuejia Lai, CH, co-inventor of International Data Encryption Algorithm (IDEA).\n* Adi Shamir, Israel, Weizmann Institute, inventor of secret sharing.\n* Arnaldo Rivera Pérez, US, independent inventor of Full Symmetric-key_algorithm on Cryptographic Service Provider.\n\nAsymmetric-key algorithm inventors\n\n* Leonard Adleman, US, USC, the 'A' in RSA.\n* David Chaum, US, inventor of blind signatures.\n* Clifford Cocks, UK GCHQ first inventor of RSA, a fact that remained secret until 1997 and so was unknown to Rivest, Shamir, and Adleman.\n* Whitfield Diffie, US, (public) co-inventor of the Diffie-Hellman key-exchange protocol.\n* Taher Elgamal, US (born Egyptian), inventor of the Elgamal discrete log cryptosystem.\n* Shafi Goldwasser, US and Israel, MIT and Weizmann Institute, co-discoverer of zero-knowledge proofs.\n* Martin Hellman, US, (public) co-inventor of the Diffie-Hellman key-exchange protocol.\n* Neal Koblitz, independent co-creator of elliptic curve cryptography.\n* Alfred Menezes, co-inventor of MQV, an elliptic curve technique.\n* Silvio Micali, US (born Italian), MIT, co-discoverer of zero-knowledge proofs.\n* Victor Miller, independent co-creator of elliptic curve cryptography.\n* David Naccache, inventor of the Naccache–Stern cryptosystem and of the Naccache–Stern knapsack cryptosystem.\n* Moni Naor, co-inventor the Naor-Yung encryption paradigm for CCA security.\n* Tatsuaki Okamoto, co-creator of :de:Okamoto-Uchiyama-Kryptosystem\n* Pascal Paillier, inventor of Paillier encryption.\n* Michael O. Rabin, Israel, inventor of Rabin encryption.\n* Ronald L. Rivest, US, MIT, the 'R' in RSA.\n* Adi Shamir, Israel, Weizmann Institute, the 'S' in RSA.\n* Shigenori Uchiyama, co-creator of :de:Okamoto-Uchiyama-Kryptosystem.\n* Moti Yung, co-inventor the Naor-Yung encryption paradigm for CCA security.\n* David W.Kravitz, inventor of the Digital Signature Algorithm (DSA).\n\nCryptanalysts\n\n* Ross Anderson, UK.\n* Eli Biham, Israel, co-discoverer of differential cryptanalysis and Related-key attack.\n* Matt Blaze, US.\n* Dan Boneh, US, Stanford University.\n* Niels Ferguson, Netherlands, co-inventor of Twofish and Fortuna.\n* Ian Goldberg, Canada, University of Waterloo.\n* Jovan Dj. Golić, Serbia, known for correlation attacks on clock-controlled systems, linear cryptanalysis of stream ciphers, inversion attack\n* Lars Knudsen, Denmark, DTU, discovered integral cryptanalysis.\n* Paul Kocher, US, discovered differential power analysis.\n* Mitsuru Matsui, Japan, discoverer of linear cryptanalysis.\n* David Wagner, US, UC Berkeley,  co-discoverer of the slide and boomerang attacks.\n* Xiaoyun Wang, the People's Republic of China, known for MD5 and SHA-1 hash function attacks.\n* Willi Meier, Switzerland, known for correlation attack, algebraic attack stream cipher and hash function.\n* Alex Biryukov, University of Luxembourg, known for impossible differential cryptanalysis and slide attack.\n*Moti Yung, Kleptography.\n\nAlgorithmic number theorists\n\n* Daniel J. Bernstein, US, known for battle with US government in Bernstein v. United States.\n* Don Coppersmith, US\n* Dag Arne Osvik, Norway\n\nTheoreticians\n\n* Mihir Bellare, US, UCSD, co-proposer of the Random oracle model.\n* Dan Boneh, US, Stanford.\n* Gilles Brassard, Canada, Université de Montréal. Co-inventor of quantum cryptography.\n* Claude Crépeau, Canada, McGill University.\n* Oded Goldreich, Israel, Weizmann Institute, author of Foundations of Cryptography.\n* Shafi Goldwasser, US and Israel.\n* Silvio Micali, US.\n* Rafail Ostrovsky, US, UCLA.\n* Charles Rackoff, co-discoverer of zero-knowledge proofs.\n* Phillip Rogaway, US, UC Davis, co-proposer of the Random oracle model.\n* Amit Sahai, US, UCLA.\n* Gustavus Simmons, US, Sandia, authentication theory.\n* Moti Yung, US, Google.\n\nGovernment cryptographers\n\n* Clifford Cocks, UK, GCHQ, secret inventor of the algorithm later known as RSA.\n* James H. Ellis, UK, GCHQ, secretly proved the possibility of asymmetric encryption.\n* Malcolm Williamson, UK, GCHQ, secret inventor of the protocol later known as the Diffie–Hellman key exchange.\n\nCryptographer businesspeople\n\n* Bruce Schneier, US, CTO and founder of Counterpane Internet Security, Inc. and cryptography author.\n* Scott Vanstone, Canada, founder of Certicom and elliptic curve cryptography proponent.\n* Colin Percival, Canada, founder of Tarsnap and developer of scrypt.\n* Dag Arne Osvik, Norway, founder and CEO of AlpCode AS. List of cryptographers. http://en.wikipedia.org/?curid=7088."
  }
}
