{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12246",
  "eid" : "014a6830-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778511411,
  "textBody" : "Alliance 90/The Greens, often simply Greens ( or '), is a green political party in Germany, formed from the merger of the German Green Party (founded in West Germany in 1980 and merged with the East Greens in 1990) and Alliance 90 (founded during the Revolution of 1989–1990 in East Germany) in 1993. The focus of the party is on ecological, economic, and social sustainability. Its leaders are Annalena Baerbock and Robert Habeck. In the 2017 federal elections, the party came sixth with 8.9% of the votes and 67 out of 709 seats in the Bundestag.\n\nFormer names and variants in the states\n\nThe Green Party was initially founded in West Germany as Die Grünen (the Greens) in January 1980. It rose out of the anti-nuclear energy, environmental, peace, new left, and new social movements of the late 20th century.\n\nGrüne Liste Umweltschutz (green list for environmental protection) were the names of some branches in Lower Saxony and other states in the Federal Republic of Germany. These groups were founded in 1977 and took part in several elections. Most of them merged with The Greens in 1980.\n\nThe West Berlin state branch of The Greens was founded as Alternative Liste, or precisely, Alternative Liste für Demokratie und Umweltschutz (AL; alternative list for democracy and environmental protection) in 1978 and became the official West Berlin branch of The Greens in 1980. In 1993 it renamed to Alliance 90/The Greens Berlin after the merger with East Berlin's Greens and Alliance 90.\n\nThe Hamburg state branch of the Green Party was called Grün-Alternative Liste Hamburg (GAL; green-alternative list) from its foundation in 1982 until 2012. In 1984 it became the official Hamburg branch of The Greens.\n\nHistory\n\n12–13 January 1980: Foundation congress\n\nIn the 1970s, environmentalists and peace activists politically organised amongst thousands of action groups. The political party The Greens () was founded January 13, 1980 in Karlsruhe to give this movement political and parliamentary representation. Opposition to pollution, use of nuclear power, NATO military action, and certain aspects of industrialised society were principal campaign issues. The Greens originated from civil initiatives, new social movements of the protests of 1968, but also from the conservative spectrum. Important figures in the first years were – among others – Petra Kelly, Gert Bastian, Lukas Beckmann, Rudolf Bahro, Joseph Beuys, Antje Vollmer, Joschka Fischer, Herbert Gruhl, August Haußleiter and Baldur Springmann.\n\nIt was at this congress, that the Greens lay their ideological foundations, proclaiming the famous Four Pillars of the Green Party:\n* Social justice\n* Ecological wisdom\n* Grassroots democracy\n* Nonviolence.\n\n1980s: Parliamentary representation on the federal level\n\nIn 1982, the conservative factions of the Greens broke away to form the Ecological Democratic Party (ÖDP). Those who remained in the Green party were more strongly pacifist and against restrictions on immigration and reproductive rights, while supporting the legalisation of cannabis use, placing a higher priority on working for LGBT rights, and tending to advocate what they described as \"anti-authoritarian\" concepts of education and child-rearing. They also tended to identify more closely with a culture of protest and civil disobedience, frequently clashing with police at demonstrations against nuclear weapons, nuclear energy, and the construction of a new runway (Startbahn West) at Frankfurt airport. Those who left the party at the time might have felt similarly about some of these issues, but did not identify with the forms of protest that Green party members took part in.\n\nAfter some success at state-level elections, the party won 27 seats with 5.7% of the vote in the Bundestag, the lower house of the German parliament, in the 1983 federal election. Among the important political issues at the time was the deployment of Pershing II IRBMs and nuclear-tipped cruise missiles by the U.S. and NATO on West German soil, generating strong opposition in the general population that found an outlet in mass demonstrations. The newly formed party was able to draw on this popular movement to recruit support. Partly due to the impact of the Chernobyl disaster in 1986, and to growing awareness of the threat of air pollution and acid rain to German forests (\"Waldsterben\"), the Greens increased their share of the vote to 8.3% in the 1987 federal election. Around this time, Joschka Fischer emerged as the unofficial leader of the party, which he remained until resigning all leadership posts following the 2005 federal election.\n\nUntil 1987, the Greens included a faction involved in pedophile activism, the SchwuP short for Arbeitsgemeinschaft \"Schwule, Päderasten und Transsexuelle\" (approx. working group \"Gays, Pederasts and Transsexuals\"). This faction campaigned for repealing  § 176 of the German penal code, dealing with child sexual abuse. This group was controversial within the party itself, and was seen as partly responsible for the poor election result of 1985.[http://www.spiegel.de/spiegel/print/d-13513384.html Torso von SchwuP] Der Spiegel 13/1985. This controversy re-surfaced in 2013 and chairwoman Claudia Roth stated she welcomed an independent scientific investigation on the extent of influence pedophile activists had on the party in the mid 1980s.[http://www.faz.net/aktuell/politik/inland/gruene-roth-will-paedophilie-aufarbeitung-unterstuetzen-12168499.html Roth will Pädophilie-Aufarbeitung unterstützen], Frankfurter Allgemeine Zeitung 1 May 2013. In November 2014 the political scientist Franz Walter presented the final report about his research on a press conference.\n\n1990s: German reunification, fall out of parliament\n\nIn the 1990 federal elections, taking place post-reunified Germany, the Greens in the West did not pass the 5% limit required to win seats in the Bundestag. It was only due to a temporary modification of German election law, applying the five-percent \"hurdle\" separately in East and West Germany, that the Greens acquired any parliamentary seats at all. This happened because in the new states of Germany, the Greens, in a joint effort with Alliance 90, a heterogeneous grouping of civil rights activists, were able to gain more than 5% of the vote. Some critics attribute this poor performance to the reluctance of the campaign to cater to the prevalent mood of nationalism, instead focusing on subjects such as global warming. A campaign poster at the time proudly stated, \"Everyone is talking about Germany; we're talking about the weather!\", paraphrasing a popular slogan of Deutsche Bundesbahn, the German national railway. The party also opposed immitent reunification that was in process, instead wanting to initiate debates on ecology and nuclear issues before reunification causing a drop in support in Western Germany. After the 1994 federal election, however, the merged party returned to the Bundestag, and the Greens received 7.3% of the vote nationwide and 49 seats.\n\n1998–2002: Greens as governing party, first term\n\nIn the 1998 federal election, despite a slight fall in their percentage of the vote (6.7%), the Greens retained 47 seats and joined the federal government for the first time in 'Red-Green' coalition government with the Social Democratic Party of Germany (SPD). Joschka Fischer became Vice-Chancellor of Germany and foreign minister in the new government, which had two other Green ministers (Andrea Fischer, later Renate Künast, and Jürgen Trittin).\nAlmost immediately the party was plunged into a crisis by the question of German participation in the NATO actions in Kosovo. Numerous anti-war party members resigned their party membership when the first post-war deployment of German troops in a military conflict abroad occurred under a Red-Green government, and the party began to experience a long string of defeats in local and state-level elections. Disappointment with the Green participation in government increased when anti-nuclear power activists realised that shutting down the nation's nuclear power stations would not happen as quickly as they wished, and numerous pro-business SPD members of the federal cabinet opposed the environmentalist agenda of the Greens, calling for tacit compromises.\n\nIn 2001, the party experienced a further crisis as some Green Members of Parliament refused to back the government's plan of sending military personnel to help with the 2001 invasion of Afghanistan. Chancellor Gerhard Schröder called a vote of confidence, tying it to his strategy on the war. Four Green MPs and one Social Democrat voted against the government, but Schröder was still able to command a majority.\n\nOn the other hand, the Greens achieved a major success as a governing party through the 2000 decision to phase out the use of nuclear energy. Minister of Environment, Nature Conservation and Nuclear Safety Jürgen Trittin reached an agreement with energy companies on the gradual phasing out of the country's nineteen nuclear power plants and a cessation of civil usage of nuclear power by 2020. This was authorised through the Nuclear Exit Law. Based on an estimate of 32 years as the normal period of operation for a nuclear power plant, the agreement defines precisely how much energy a power plant is allowed to produce before being shut down. This law has since been overturned.\n\n2002–2005: Greens as governing party, second term\n\nDespite the crises of the preceding electoral period, in the 2002 federal election, the Greens increased their total to 55 seats (in a smaller parliament) and 8.6%. This was partly due to the perception that the internal debate over the war in Afghanistan had been more honest and open than in other parties, and one of the MPs who had voted against the Afghanistan deployment, Hans-Christian Ströbele, was directly elected to the Bundestag as a district representative for the Friedrichshain-Kreuzberg - Prenzlauer Berg East constituency in Berlin, becoming the first Green to ever gain a first-past-the-post seat in Germany. The Greens benefited from increased inroads among traditionally left-wing demographics which had benefited from Green-initiated legislation in the 1998–2002 term, such as environmentalists (Renewable Energies Act) and LGBT groups (Registered Partnership Law). Perhaps most important for determining the success of both the Greens and the SPD was the increasing threat of war in Iraq, which was highly unpopular with the German public, and helped gather votes for the parties which had taken a stand against participation in this war. Despite losses for the SPD, the Red-Green coalition government commanded a very slight majority in the Bundestag and was renewed, with Joschka Fischer as foreign minister, Renate Künast as minister for consumer protection, nutrition and agriculture, and Jürgen Trittin as minister for the environment.\n\nOne internal issue in 2002 was the failed attempt to settle a long-standing discussion about the question of whether members of parliament should be allowed to become members of the party executive. Two party conventions declined to change the party statute. The necessary majority of two thirds was missed by a small margin. As a result, former party chairpersons Fritz Kuhn and Claudia Roth (who had been elected to parliament that year) were no longer able to continue in their executive function and were replaced by former party secretary general Reinhard Bütikofer and former Bundestag member Angelika Beer. The party then held a member referendum on this question in the spring of 2003 which changed the party statute. Now members of parliament may be elected for two of the six seats of the party executive, as long as they are not ministers or caucus leaders. 57% of all party members voted in the member referendum, with 67% voting in favor of the change. The referendum was only the second in the history of Alliance 90/The Greens, the first having been held about the merger of the Greens and Alliance 90. In 2004, after Angelika Beer was elected to the European parliament, Claudia Roth was elected to replace her as party chair.\n\nThe only party convention in 2003 was planned for November 2003, but about 20% of the local organisations forced the federal party to hold a special party convention in Cottbus early to discuss the party position regarding Agenda 2010, a major reform of the German welfare programmes planned by Chancellor Schröder.\n\nThe November 2003 party convention was held in Dresden and decided the election platform for the 2004 European Parliament elections. The German Green list for these elections was headed by Rebecca Harms (then leader of the Green party in Lower Saxony) and Daniel Cohn-Bendit, previously Member of the European Parliament for The Greens of France. The November 2003 convention is also noteworthy because it was the first convention of a German political party ever to use an electronic voting system.\n\nThe Greens gained a record 13 of Germany's 99 seats in these elections, mainly due to the perceived competence of Green ministers in the federal government and the unpopularity of the Social Democratic Party.\n\nIn early 2005, the Greens were the target of the German Visa Affair 2005, instigated in the media by the Christian Democratic Union (CDU). At the end of April 2005, they celebrated the decommissioning of the Obrigheim nuclear power station. They also continue to support a bill for an Anti-Discrimination Law (:de: Allgemeines Gleichbehandlungsgesetz) in the Bundestag.\n\nIn May 2005, the only remaining state-level red-green coalition government lost the vote in the North Rhine-Westphalia state election, leaving only the federal government with participation of the Greens (apart from local governments). In the early 2005 federal election the party incurred very small losses and achieved 8.1% of the vote and 51 seats. However, due to larger losses of the SPD, the previous coalition no longer had a majority in the Bundestag.\n\n2005–present: Greens back in opposition\n\nFor almost two years after the federal election in 2005, the Greens were not part of any government at the state or federal level. In June 2007, the Greens in Bremen entered into a coalition with the Social Democratic Party (SPD) following the 2007 Bremen state election.\n\nIn April 2008, following the 2008 Hamburg state election, the Green-Alternative List (GAL) in Hamburg entered into a coalition with the Christian Democratic Union (CDU), the first such state-level coalition in Germany. Although the GAL had to agree to the deepening of the Elbe River, the construction of a new coal-fired power station and two road projects they had opposed, they also received some significant concessions from the CDU. These included reforming state schools by increasing the number of primary school educational stages, the restoration of trams as public transportation in the city-state, and more pedestrian-friendly real estate development. On 29 November 2010, the coalition collapsed, resulting in an election that was won by SPD.\n\nFollowing the Saarland state election of August 2009, The Greens held the balance of power after a close election where no two-party coalitions could create a stable majority government. After negotiations, the Saarland Greens rejected the option of a left-wing 'red-red-green' coalition with the SPD and The Left (Die Linke) in order to form a centre-right state government with the CDU and Free Democratic Party (FDP), a historical first time that a Jamaica coalition has formed in German politics.\n\nIn June 2010, in the first state election following the victory of the CDU/CSU and FDP in the 2009 federal election, the \"black-yellow\" CDU-FDP coalition in North Rhine-Westphalia under Jürgen Rüttgers lost its majority. The Greens and the SPD came one seat short of a governing majority, but after multiple negotiations about coalitions of SPD and Greens with either the FDP or The Left, the SPD and Greens decided to form a minority government, which was possible because under the constitution of North Rhine-Westphalia a plurality of seats is sufficient to elect a minister-president.  So a red-green government in a state where it was defeated under Peer Steinbrück in 2005 came into office again on 14 June 2010 with the election of Hannelore Kraft as minister-president (Cabinet Kraft I).\n\nThe Greens founded the first international chapter of a German political party in the U.S. on 13 April 2008 at the Goethe-Institut in Washington D.C. Its main goal is \"to provide a platform for politically active and green-oriented German citizens, in and beyond Washington D.C., to discuss and actively participate in German Green politics. [...] to foster professional and personal exchange, channeling the outcomes towards the political discourse in Germany.\"[http://gruene-washington.de/about-us/ Grüner Ortsverband Washington: About us] \n\nIn March 2011 (two weeks after the Fukushima nuclear disaster had begun), the Greens made large gains in Rhineland-Palatinate and in Baden-Württemberg. In Baden-Württemberg they became the senior partner in a governing coalition for the first time.  Winfried Kretschmann is now the first Green to serve as Minister-President of a German State (Cabinet Kretschmann I and II). Polling data from August 2011 indicated that one in five Germans supported the Greens. From 4 October 2011 to 4 September 2016, the party was represented in all state parliaments.\n\nLike the Social Democrats, the Greens backed Chancellor Angela Merkel on most bailout votes in the German parliament during her second term, saying their pro-European stances overrode party politics.Tony Czuczka and Patrick Donahue (24 September 2013), [Merkel's Cold Embrace Leaves SPD Wary of Coalition Talks] Bloomberg News. Shortly before the elections, the party plummeted to a four-year low in the polls, undermining efforts by Peer Steinbrück's Social Democrats to unseat Merkel.Patrick Donahue (11 September 2013), [https://www.bloomberg.com/news/2013-09-11/germany-s-greens-slump-dimming-spd-chances-of-unseating-merkel.html Germany's Greens Slump, Dimming SPD Chances of Unseating Merkel] Bloomberg News.\n\nElection results\n\nFederal Parliament (Bundestag)\n\nBelow are charts of the results that Alliance90/The Greens have secured in each election to the federal Bundestag. Timelines showing the number of seats and percentage of party list votes won are on the right.\n\nEuropean Parliament\n\nState Parliaments (Länder)\n\nStates (Länder)\n\nPolicy\n\nEnergy and nuclear power\n\nFrom the inception of the party, they have been concerned with the immediate halt of construction or operation of all nuclear power stations. As an alternative, they promote a shift to alternative energy and a comprehensive program of energy conservation.\n\nIn 1986, large parts of Germany were covered with radioactive contamination from the Chernobyl disaster and Germans went to great lengths to deal with the contamination. Germany's anti-nuclear stance was strengthened. From the mid-1990s onwards, anti-nuclear protests were primarily directed against transports of radioactive waste in \"CASTOR\" containers.\n\nAfter the Chernobyl disaster, the Greens became more radicalised and resisted compromise on the nuclear issue. During the 1990s, a re-orientation towards a moderate program occurred, with concern about global warming and ozone depletion taking a more prominent role. During the federal red-green government (1998–2005) many people became disappointed with what they saw as excessive compromise on key Greens policies.\n\nEnergy policy is still the most important cross-cutting issue in climate and economic policies. Implementation of Green Policy would see electricity generation from 100 percent renewable sources as early as 2040. The development of renewable energy and combined heat and power is also a great opportunity for technical and economic innovation. Solar industry and environmental technologies are already a significant part of key industries providing jobs which need to be developed and promoted vigorously. In addition, a priority of green energy policy is increasing the thermal insulation and energy efficiency of homes, the phaseout of all nuclear energy generation with possible high-efficiency gas-fired power plants operational during the transition phase.\n\nEnvironment and climate policy\n\nThe central idea of green politics is sustainable development. The concept of environmental protection is the cornerstone of Alliance 90/The Greens policy. In particular, the economic, energy and transport policy claims are in close interaction with environmental considerations. The Greens acknowledge the natural environment as a high priority and animal protection should be enshrined as a national objective in constitutional law. An effective environmental policy would be based on a common environmental code, with the urgent integration of a climate change bill. During the red-green coalition (1998–2005) a policy of agricultural change was launched labeled as a paradigm shift in agricultural policy towards a more ecological friendly agriculture, which needs to continue.\n\nClimate change is at the center of all policy considerations. This includes environmental policy and safety and social aspects. The plans of the Alliance 90/The Greens provide a climate change bill laying down binding reductions to greenhouse gas emissions in Germany by 2020 restricting emissions to minus 40 percent compared to 1990.\n\nTransport\n\nA similarly high priority is given to transport policy. The switch from a traveling allowance to a mobility allowance, which is paid regardless of income to all employees, replacing company car privileges. The truck toll will act as a climate protection instrument internalizing the external costs of transport. Railway should be promoted in order to achieve the desired environmental objectives and the comprehensive care of customers. The railway infrastructure is to remain permanently in the public sector, allowing a reduction in expenditure on road construction infrastructure. The Greens want to control privileges on kerosene and for international flights, introduce an air ticket levy. Restrict speeds nationwide on the highways to 120 km/h and country roads to 80 km/h. The Greens want to create a market incentive and research program of  €500 million annually to ensure that by 2020 there are at least two million electric cars on German roads.\n\nWelfare, health, family and education\n\nFor many years, the Green Party has advocated against the \"Ehegattensplitting\" policy, under which the incomes of married couples are split for taxation purposes. Furthermore, the Party advocates for a massive increase in spending for places in preschools on the federal level. Investment in education should also be increased on the higher levels: 1 billion Euros more for vocational schools and 200 million Euros more BAföG (Bundesausbildungsförderungsgesetz in German, approximately translated to \"the Federal Law for the Advancement of Education\") for adults.\n\nIn its platform in 2013, the Green Party advocated for a minimum wage of 8.50 Euro per hour, which was implemented on 1 January 2015. It continues to press for higher minimum wages.\n\nThe Greens want to continue having the age of 67 be the start of retirement,Pieter Vanhuysse, Achim Goerres, Ageing Populations in Post-Industrial Democracies: Comparative Studies of Policies and Politics, Routledge, [https://books.google.com/books?idEVNB8B2bZIUC&pg\nPA94&dqGreen+Party+germany+retirement#v\nonepage&qGreen%20Party%20germany%20retirement&f\nfalse 94], 2013 though they want to include some provisions, for example considering partial retirement.\n\nWhen it comes to drug usage, the Greens want to decriminalize marijuana usage and allow for private growing of plants. Furthermore, the Greens support research on the drug and the use of marijuana for medicinal purposes.\n\nWomen and LGBT rights\n\nThe Green Party has always been at the forefront of fighting for women's and gay rights. For example, it supports the implementation of quotas in executive boards, the policy of equal pay for equal work, and continuing the fight against domestic violence. According to its website, the Green Party \"fights for the acceptance and against the exclusion of homosexuals, bisexuals, transsexuals, intersexuals, and transgender people\".\n\nIn order to recognize the political persecution that LGBT+ people face abroad, the Green Party wants to extend asylum to LGBT people abroad. The policy change was sponsored primarily by Volker Beck, one of the Party's most prominent gay members. Because of the extensive support the Green Party has given the LGBT community since its conception, many gays and lesbians vote for the Green Party even if their political ideology does not quite align otherwise.\n\nElectorate\n\nThe Infratest Dimap political research company has suggested the Green voter demographic includes those on higher incomes (e.g. above €2000/month) and the party's support is less among households with lower incomes. The same polling research also concluded that the Greens received fewer votes from the unemployed and general working population, with business people favouring the party as well as the centre-right liberal Free Democratic Party. According to Infratest Dimap the Greens received more voters from the age group 34–42 than any other age group and that the young were generally more supportive of the party than the old. (Source: Intrafest Dimap political research company for the ARD.)\n\nThe Greens have a higher voter demographic in urban areas than rural areas, except for a small number of rural areas with pressing local environmental concerns, such as strip mining or radioactive waste deposits. The cities of Bonn, Cologne, Stuttgart, Berlin, Hamburg, Frankfurt and Munich have among the highest per cent Green voters in the country. The smaller towns of Freiburg im Breisgau, Tübingen, Konstanz, Oldenburg, Darmstadt, Heidelberg and Göttingen, have a strong share of Green votes, with Freiburg, Darmstadt, Tübingen and Konstanz even having Green mayors. The party has a lower level of support in the states of the former German Democratic Republic (East Germany). However, in 2011, the Greens were represented in the parliament of all German states.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Alliance 90/The Greens" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12246" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Alliance 90/The Greens, often simply Greens ( or '), is a green political party in Germany, formed from the merger of the German Green Party (founded in West Germany in 1980 and merged with the East Greens in 1990) and Alliance 90 (founded during the Revolution of 1989–1990 in East Germany) in 1993. The focus of the party is on ecological, economic, and social sustainability. Its leaders are Annalena Baerbock and Robert Habeck. In the 2017 federal elections, the party came sixth with 8.9% of the votes and 67 out of 709 seats in the Bundestag.\n\nFormer names and variants in the states\n\nThe Green Party was initially founded in West Germany as Die Grünen (the Greens) in January 1980. It rose out of the anti-nuclear energy, environmental, peace, new left, and new social movements of the late 20th century.\n\nGrüne Liste Umweltschutz (green list for environmental protection) were the names of some branches in Lower Saxony and other states in the Federal Republic of Germany. These groups were founded in 1977 and took part in several elections. Most of them merged with The Greens in 1980.\n\nThe West Berlin state branch of The Greens was founded as Alternative Liste, or precisely, Alternative Liste für Demokratie und Umweltschutz (AL; alternative list for democracy and environmental protection) in 1978 and became the official West Berlin branch of The Greens in 1980. In 1993 it renamed to Alliance 90/The Greens Berlin after the merger with East Berlin's Greens and Alliance 90.\n\nThe Hamburg state branch of the Green Party was called Grün-Alternative Liste Hamburg (GAL; green-alternative list) from its foundation in 1982 until 2012. In 1984 it became the official Hamburg branch of The Greens.\n\nHistory\n\n12–13 January 1980: Foundation congress\n\nIn the 1970s, environmentalists and peace activists politically organised amongst thousands of action groups. The political party The Greens () was founded January 13, 1980 in Karlsruhe to give this movement political and parliamentary representation. Opposition to pollution, use of nuclear power, NATO military action, and certain aspects of industrialised society were principal campaign issues. The Greens originated from civil initiatives, new social movements of the protests of 1968, but also from the conservative spectrum. Important figures in the first years were – among others – Petra Kelly, Gert Bastian, Lukas Beckmann, Rudolf Bahro, Joseph Beuys, Antje Vollmer, Joschka Fischer, Herbert Gruhl, August Haußleiter and Baldur Springmann.\n\nIt was at this congress, that the Greens lay their ideological foundations, proclaiming the famous Four Pillars of the Green Party:\n* Social justice\n* Ecological wisdom\n* Grassroots democracy\n* Nonviolence.\n\n1980s: Parliamentary representation on the federal level\n\nIn 1982, the conservative factions of the Greens broke away to form the Ecological Democratic Party (ÖDP). Those who remained in the Green party were more strongly pacifist and against restrictions on immigration and reproductive rights, while supporting the legalisation of cannabis use, placing a higher priority on working for LGBT rights, and tending to advocate what they described as \"anti-authoritarian\" concepts of education and child-rearing. They also tended to identify more closely with a culture of protest and civil disobedience, frequently clashing with police at demonstrations against nuclear weapons, nuclear energy, and the construction of a new runway (Startbahn West) at Frankfurt airport. Those who left the party at the time might have felt similarly about some of these issues, but did not identify with the forms of protest that Green party members took part in.\n\nAfter some success at state-level elections, the party won 27 seats with 5.7% of the vote in the Bundestag, the lower house of the German parliament, in the 1983 federal election. Among the important political issues at the time was the deployment of Pershing II IRBMs and nuclear-tipped cruise missiles by the U.S. and NATO on West German soil, generating strong opposition in the general population that found an outlet in mass demonstrations. The newly formed party was able to draw on this popular movement to recruit support. Partly due to the impact of the Chernobyl disaster in 1986, and to growing awareness of the threat of air pollution and acid rain to German forests (\"Waldsterben\"), the Greens increased their share of the vote to 8.3% in the 1987 federal election. Around this time, Joschka Fischer emerged as the unofficial leader of the party, which he remained until resigning all leadership posts following the 2005 federal election.\n\nUntil 1987, the Greens included a faction involved in pedophile activism, the SchwuP short for Arbeitsgemeinschaft \"Schwule, Päderasten und Transsexuelle\" (approx. working group \"Gays, Pederasts and Transsexuals\"). This faction campaigned for repealing  § 176 of the German penal code, dealing with child sexual abuse. This group was controversial within the party itself, and was seen as partly responsible for the poor election result of 1985.[http://www.spiegel.de/spiegel/print/d-13513384.html Torso von SchwuP] Der Spiegel 13/1985. This controversy re-surfaced in 2013 and chairwoman Claudia Roth stated she welcomed an independent scientific investigation on the extent of influence pedophile activists had on the party in the mid 1980s.[http://www.faz.net/aktuell/politik/inland/gruene-roth-will-paedophilie-aufarbeitung-unterstuetzen-12168499.html Roth will Pädophilie-Aufarbeitung unterstützen], Frankfurter Allgemeine Zeitung 1 May 2013. In November 2014 the political scientist Franz Walter presented the final report about his research on a press conference.\n\n1990s: German reunification, fall out of parliament\n\nIn the 1990 federal elections, taking place post-reunified Germany, the Greens in the West did not pass the 5% limit required to win seats in the Bundestag. It was only due to a temporary modification of German election law, applying the five-percent \"hurdle\" separately in East and West Germany, that the Greens acquired any parliamentary seats at all. This happened because in the new states of Germany, the Greens, in a joint effort with Alliance 90, a heterogeneous grouping of civil rights activists, were able to gain more than 5% of the vote. Some critics attribute this poor performance to the reluctance of the campaign to cater to the prevalent mood of nationalism, instead focusing on subjects such as global warming. A campaign poster at the time proudly stated, \"Everyone is talking about Germany; we're talking about the weather!\", paraphrasing a popular slogan of Deutsche Bundesbahn, the German national railway. The party also opposed immitent reunification that was in process, instead wanting to initiate debates on ecology and nuclear issues before reunification causing a drop in support in Western Germany. After the 1994 federal election, however, the merged party returned to the Bundestag, and the Greens received 7.3% of the vote nationwide and 49 seats.\n\n1998–2002: Greens as governing party, first term\n\nIn the 1998 federal election, despite a slight fall in their percentage of the vote (6.7%), the Greens retained 47 seats and joined the federal government for the first time in 'Red-Green' coalition government with the Social Democratic Party of Germany (SPD). Joschka Fischer became Vice-Chancellor of Germany and foreign minister in the new government, which had two other Green ministers (Andrea Fischer, later Renate Künast, and Jürgen Trittin).\nAlmost immediately the party was plunged into a crisis by the question of German participation in the NATO actions in Kosovo. Numerous anti-war party members resigned their party membership when the first post-war deployment of German troops in a military conflict abroad occurred under a Red-Green government, and the party began to experience a long string of defeats in local and state-level elections. Disappointment with the Green participation in government increased when anti-nuclear power activists realised that shutting down the nation's nuclear power stations would not happen as quickly as they wished, and numerous pro-business SPD members of the federal cabinet opposed the environmentalist agenda of the Greens, calling for tacit compromises.\n\nIn 2001, the party experienced a further crisis as some Green Members of Parliament refused to back the government's plan of sending military personnel to help with the 2001 invasion of Afghanistan. Chancellor Gerhard Schröder called a vote of confidence, tying it to his strategy on the war. Four Green MPs and one Social Democrat voted against the government, but Schröder was still able to command a majority.\n\nOn the other hand, the Greens achieved a major success as a governing party through the 2000 decision to phase out the use of nuclear energy. Minister of Environment, Nature Conservation and Nuclear Safety Jürgen Trittin reached an agreement with energy companies on the gradual phasing out of the country's nineteen nuclear power plants and a cessation of civil usage of nuclear power by 2020. This was authorised through the Nuclear Exit Law. Based on an estimate of 32 years as the normal period of operation for a nuclear power plant, the agreement defines precisely how much energy a power plant is allowed to produce before being shut down. This law has since been overturned.\n\n2002–2005: Greens as governing party, second term\n\nDespite the crises of the preceding electoral period, in the 2002 federal election, the Greens increased their total to 55 seats (in a smaller parliament) and 8.6%. This was partly due to the perception that the internal debate over the war in Afghanistan had been more honest and open than in other parties, and one of the MPs who had voted against the Afghanistan deployment, Hans-Christian Ströbele, was directly elected to the Bundestag as a district representative for the Friedrichshain-Kreuzberg - Prenzlauer Berg East constituency in Berlin, becoming the first Green to ever gain a first-past-the-post seat in Germany. The Greens benefited from increased inroads among traditionally left-wing demographics which had benefited from Green-initiated legislation in the 1998–2002 term, such as environmentalists (Renewable Energies Act) and LGBT groups (Registered Partnership Law). Perhaps most important for determining the success of both the Greens and the SPD was the increasing threat of war in Iraq, which was highly unpopular with the German public, and helped gather votes for the parties which had taken a stand against participation in this war. Despite losses for the SPD, the Red-Green coalition government commanded a very slight majority in the Bundestag and was renewed, with Joschka Fischer as foreign minister, Renate Künast as minister for consumer protection, nutrition and agriculture, and Jürgen Trittin as minister for the environment.\n\nOne internal issue in 2002 was the failed attempt to settle a long-standing discussion about the question of whether members of parliament should be allowed to become members of the party executive. Two party conventions declined to change the party statute. The necessary majority of two thirds was missed by a small margin. As a result, former party chairpersons Fritz Kuhn and Claudia Roth (who had been elected to parliament that year) were no longer able to continue in their executive function and were replaced by former party secretary general Reinhard Bütikofer and former Bundestag member Angelika Beer. The party then held a member referendum on this question in the spring of 2003 which changed the party statute. Now members of parliament may be elected for two of the six seats of the party executive, as long as they are not ministers or caucus leaders. 57% of all party members voted in the member referendum, with 67% voting in favor of the change. The referendum was only the second in the history of Alliance 90/The Greens, the first having been held about the merger of the Greens and Alliance 90. In 2004, after Angelika Beer was elected to the European parliament, Claudia Roth was elected to replace her as party chair.\n\nThe only party convention in 2003 was planned for November 2003, but about 20% of the local organisations forced the federal party to hold a special party convention in Cottbus early to discuss the party position regarding Agenda 2010, a major reform of the German welfare programmes planned by Chancellor Schröder.\n\nThe November 2003 party convention was held in Dresden and decided the election platform for the 2004 European Parliament elections. The German Green list for these elections was headed by Rebecca Harms (then leader of the Green party in Lower Saxony) and Daniel Cohn-Bendit, previously Member of the European Parliament for The Greens of France. The November 2003 convention is also noteworthy because it was the first convention of a German political party ever to use an electronic voting system.\n\nThe Greens gained a record 13 of Germany's 99 seats in these elections, mainly due to the perceived competence of Green ministers in the federal government and the unpopularity of the Social Democratic Party.\n\nIn early 2005, the Greens were the target of the German Visa Affair 2005, instigated in the media by the Christian Democratic Union (CDU). At the end of April 2005, they celebrated the decommissioning of the Obrigheim nuclear power station. They also continue to support a bill for an Anti-Discrimination Law (:de: Allgemeines Gleichbehandlungsgesetz) in the Bundestag.\n\nIn May 2005, the only remaining state-level red-green coalition government lost the vote in the North Rhine-Westphalia state election, leaving only the federal government with participation of the Greens (apart from local governments). In the early 2005 federal election the party incurred very small losses and achieved 8.1% of the vote and 51 seats. However, due to larger losses of the SPD, the previous coalition no longer had a majority in the Bundestag.\n\n2005–present: Greens back in opposition\n\nFor almost two years after the federal election in 2005, the Greens were not part of any government at the state or federal level. In June 2007, the Greens in Bremen entered into a coalition with the Social Democratic Party (SPD) following the 2007 Bremen state election.\n\nIn April 2008, following the 2008 Hamburg state election, the Green-Alternative List (GAL) in Hamburg entered into a coalition with the Christian Democratic Union (CDU), the first such state-level coalition in Germany. Although the GAL had to agree to the deepening of the Elbe River, the construction of a new coal-fired power station and two road projects they had opposed, they also received some significant concessions from the CDU. These included reforming state schools by increasing the number of primary school educational stages, the restoration of trams as public transportation in the city-state, and more pedestrian-friendly real estate development. On 29 November 2010, the coalition collapsed, resulting in an election that was won by SPD.\n\nFollowing the Saarland state election of August 2009, The Greens held the balance of power after a close election where no two-party coalitions could create a stable majority government. After negotiations, the Saarland Greens rejected the option of a left-wing 'red-red-green' coalition with the SPD and The Left (Die Linke) in order to form a centre-right state government with the CDU and Free Democratic Party (FDP), a historical first time that a Jamaica coalition has formed in German politics.\n\nIn June 2010, in the first state election following the victory of the CDU/CSU and FDP in the 2009 federal election, the \"black-yellow\" CDU-FDP coalition in North Rhine-Westphalia under Jürgen Rüttgers lost its majority. The Greens and the SPD came one seat short of a governing majority, but after multiple negotiations about coalitions of SPD and Greens with either the FDP or The Left, the SPD and Greens decided to form a minority government, which was possible because under the constitution of North Rhine-Westphalia a plurality of seats is sufficient to elect a minister-president.  So a red-green government in a state where it was defeated under Peer Steinbrück in 2005 came into office again on 14 June 2010 with the election of Hannelore Kraft as minister-president (Cabinet Kraft I).\n\nThe Greens founded the first international chapter of a German political party in the U.S. on 13 April 2008 at the Goethe-Institut in Washington D.C. Its main goal is \"to provide a platform for politically active and green-oriented German citizens, in and beyond Washington D.C., to discuss and actively participate in German Green politics. [...] to foster professional and personal exchange, channeling the outcomes towards the political discourse in Germany.\"[http://gruene-washington.de/about-us/ Grüner Ortsverband Washington: About us] \n\nIn March 2011 (two weeks after the Fukushima nuclear disaster had begun), the Greens made large gains in Rhineland-Palatinate and in Baden-Württemberg. In Baden-Württemberg they became the senior partner in a governing coalition for the first time.  Winfried Kretschmann is now the first Green to serve as Minister-President of a German State (Cabinet Kretschmann I and II). Polling data from August 2011 indicated that one in five Germans supported the Greens. From 4 October 2011 to 4 September 2016, the party was represented in all state parliaments.\n\nLike the Social Democrats, the Greens backed Chancellor Angela Merkel on most bailout votes in the German parliament during her second term, saying their pro-European stances overrode party politics.Tony Czuczka and Patrick Donahue (24 September 2013), [Merkel's Cold Embrace Leaves SPD Wary of Coalition Talks] Bloomberg News. Shortly before the elections, the party plummeted to a four-year low in the polls, undermining efforts by Peer Steinbrück's Social Democrats to unseat Merkel.Patrick Donahue (11 September 2013), [https://www.bloomberg.com/news/2013-09-11/germany-s-greens-slump-dimming-spd-chances-of-unseating-merkel.html Germany's Greens Slump, Dimming SPD Chances of Unseating Merkel] Bloomberg News.\n\nElection results\n\nFederal Parliament (Bundestag)\n\nBelow are charts of the results that Alliance90/The Greens have secured in each election to the federal Bundestag. Timelines showing the number of seats and percentage of party list votes won are on the right.\n\nEuropean Parliament\n\nState Parliaments (Länder)\n\nStates (Länder)\n\nPolicy\n\nEnergy and nuclear power\n\nFrom the inception of the party, they have been concerned with the immediate halt of construction or operation of all nuclear power stations. As an alternative, they promote a shift to alternative energy and a comprehensive program of energy conservation.\n\nIn 1986, large parts of Germany were covered with radioactive contamination from the Chernobyl disaster and Germans went to great lengths to deal with the contamination. Germany's anti-nuclear stance was strengthened. From the mid-1990s onwards, anti-nuclear protests were primarily directed against transports of radioactive waste in \"CASTOR\" containers.\n\nAfter the Chernobyl disaster, the Greens became more radicalised and resisted compromise on the nuclear issue. During the 1990s, a re-orientation towards a moderate program occurred, with concern about global warming and ozone depletion taking a more prominent role. During the federal red-green government (1998–2005) many people became disappointed with what they saw as excessive compromise on key Greens policies.\n\nEnergy policy is still the most important cross-cutting issue in climate and economic policies. Implementation of Green Policy would see electricity generation from 100 percent renewable sources as early as 2040. The development of renewable energy and combined heat and power is also a great opportunity for technical and economic innovation. Solar industry and environmental technologies are already a significant part of key industries providing jobs which need to be developed and promoted vigorously. In addition, a priority of green energy policy is increasing the thermal insulation and energy efficiency of homes, the phaseout of all nuclear energy generation with possible high-efficiency gas-fired power plants operational during the transition phase.\n\nEnvironment and climate policy\n\nThe central idea of green politics is sustainable development. The concept of environmental protection is the cornerstone of Alliance 90/The Greens policy. In particular, the economic, energy and transport policy claims are in close interaction with environmental considerations. The Greens acknowledge the natural environment as a high priority and animal protection should be enshrined as a national objective in constitutional law. An effective environmental policy would be based on a common environmental code, with the urgent integration of a climate change bill. During the red-green coalition (1998–2005) a policy of agricultural change was launched labeled as a paradigm shift in agricultural policy towards a more ecological friendly agriculture, which needs to continue.\n\nClimate change is at the center of all policy considerations. This includes environmental policy and safety and social aspects. The plans of the Alliance 90/The Greens provide a climate change bill laying down binding reductions to greenhouse gas emissions in Germany by 2020 restricting emissions to minus 40 percent compared to 1990.\n\nTransport\n\nA similarly high priority is given to transport policy. The switch from a traveling allowance to a mobility allowance, which is paid regardless of income to all employees, replacing company car privileges. The truck toll will act as a climate protection instrument internalizing the external costs of transport. Railway should be promoted in order to achieve the desired environmental objectives and the comprehensive care of customers. The railway infrastructure is to remain permanently in the public sector, allowing a reduction in expenditure on road construction infrastructure. The Greens want to control privileges on kerosene and for international flights, introduce an air ticket levy. Restrict speeds nationwide on the highways to 120 km/h and country roads to 80 km/h. The Greens want to create a market incentive and research program of  €500 million annually to ensure that by 2020 there are at least two million electric cars on German roads.\n\nWelfare, health, family and education\n\nFor many years, the Green Party has advocated against the \"Ehegattensplitting\" policy, under which the incomes of married couples are split for taxation purposes. Furthermore, the Party advocates for a massive increase in spending for places in preschools on the federal level. Investment in education should also be increased on the higher levels: 1 billion Euros more for vocational schools and 200 million Euros more BAföG (Bundesausbildungsförderungsgesetz in German, approximately translated to \"the Federal Law for the Advancement of Education\") for adults.\n\nIn its platform in 2013, the Green Party advocated for a minimum wage of 8.50 Euro per hour, which was implemented on 1 January 2015. It continues to press for higher minimum wages.\n\nThe Greens want to continue having the age of 67 be the start of retirement,Pieter Vanhuysse, Achim Goerres, Ageing Populations in Post-Industrial Democracies: Comparative Studies of Policies and Politics, Routledge, [https://books.google.com/books?idEVNB8B2bZIUC&pg\nPA94&dqGreen+Party+germany+retirement#v\nonepage&qGreen%20Party%20germany%20retirement&f\nfalse 94], 2013 though they want to include some provisions, for example considering partial retirement.\n\nWhen it comes to drug usage, the Greens want to decriminalize marijuana usage and allow for private growing of plants. Furthermore, the Greens support research on the drug and the use of marijuana for medicinal purposes.\n\nWomen and LGBT rights\n\nThe Green Party has always been at the forefront of fighting for women's and gay rights. For example, it supports the implementation of quotas in executive boards, the policy of equal pay for equal work, and continuing the fight against domestic violence. According to its website, the Green Party \"fights for the acceptance and against the exclusion of homosexuals, bisexuals, transsexuals, intersexuals, and transgender people\".\n\nIn order to recognize the political persecution that LGBT+ people face abroad, the Green Party wants to extend asylum to LGBT people abroad. The policy change was sponsored primarily by Volker Beck, one of the Party's most prominent gay members. Because of the extensive support the Green Party has given the LGBT community since its conception, many gays and lesbians vote for the Green Party even if their political ideology does not quite align otherwise.\n\nElectorate\n\nThe Infratest Dimap political research company has suggested the Green voter demographic includes those on higher incomes (e.g. above €2000/month) and the party's support is less among households with lower incomes. The same polling research also concluded that the Greens received fewer votes from the unemployed and general working population, with business people favouring the party as well as the centre-right liberal Free Democratic Party. According to Infratest Dimap the Greens received more voters from the age group 34–42 than any other age group and that the young were generally more supportive of the party than the old. (Source: Intrafest Dimap political research company for the ARD.)\n\nThe Greens have a higher voter demographic in urban areas than rural areas, except for a small number of rural areas with pressing local environmental concerns, such as strip mining or radioactive waste deposits. The cities of Bonn, Cologne, Stuttgart, Berlin, Hamburg, Frankfurt and Munich have among the highest per cent Green voters in the country. The smaller towns of Freiburg im Breisgau, Tübingen, Konstanz, Oldenburg, Darmstadt, Heidelberg and Göttingen, have a strong share of Green votes, with Freiburg, Darmstadt, Tübingen and Konstanz even having Green mayors. The party has a lower level of support in the states of the former German Democratic Republic (East Germany). However, in 2011, the Greens were represented in the parliament of all German states. Alliance 90/The Greens. http://en.wikipedia.org/?curid=12246."
  }
}
