{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8953",
  "eid" : "eb84d440-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778474884,
  "textBody" : "Dana Tyrone Rohrabacher (born June 21, 1947) is a member of the U.S House of Representatives representing . A Republican, he served as a speechwriter and Special Assistant to President Ronald Reagan from 1981 to 1988.\n\nRohrabacher voted to repeal Obamacare, is a staunch opponent of illegal immigration, has been described as an \"aggressive skeptic\" of global warming, and favors the legalization of marijuana. In foreign policy, he supported withdrawing U.S. troops from Afghanistan, called for Trump to punish Turkish President Erdoğan on embassy violence, sided with Russia in the Russia–Georgia war, gave a qualified defense of the annexation of Crimea in 2014Elias Isquith, March 25, 2014, Salon magazine, [http://www.salon.com/2014/03/25/gop_rep_dana_rohrabacher_half_defends_russias_annexation_of_crimea/ GOP Rep. Dana Rohrabacher half-defends Russia’s annexation of Crimea: The California congressman isn't saying it was right of Russia to seize the former Ukrainian territory, but ...], Retrieved August 1, 2017, \"...Rohrabacher went off-script for a moment and offered a qualified defense of Russia’s annexation of Crimea....\"Jonathan Weisman, March 28, 2014, The New York Times, [https://www.nytimes.com/2014/03/29/us/politics/kremlin-finds-a-defender-in-congress.html Kremlin Finds a Defender in Congress], Retrieved August 1, 2017, \"...There is some logic to Mr. Rohrabacher’s stalwart defense of the Kremlin’s actions. The people of Crimea...\" and supports cooperating with Russia in Syria and in other areas. He is notable for his strong pro-Russia and pro-Putin views,Byron Tau, Peter Nicholas and  Siobhan Hughes, September 15, 2017, Wall Street Journal, [https://www.wsj.com/articles/gop-congressman-sought-trump-deal-on-wikileaks-russia-1505509918 GOP Congressman Sought Trump Deal on WikiLeaks, Russia], Retrieved September 23, 2017 which have raised questions about his relation with Putin and the Russian government, with the FBI reporting that the Kremlin had given Rohrabacher a code name, signifying that he was viewed as a valuable potential asset for Russian intelligence.Damien Sharkov, May 19, 2017, Newsweek, [http://www.newsweek.com/republican-congressman-russian-spy-recruit-612381 FBI WARNED REPUBLICAN CONGRESSMAN WHO ARM-WRESTLED PUTIN OF RUSSIAN SPY RECRUITMENT], Retrieved May 20, 2017Rosie Gray, July 18, 2017, The Atlantic, [https://www.theatlantic.com/politics/archive/2017/07/russian-anti-sanctions-campaign-turned-to-california-congressman/534102/ Russian Anti-Sanctions Campaign Turned to California Congressman: U.S. diplomats were concerned about Russian outreach to House Republican Dana Rohrabacher while on a trip to Moscow last year.], Retrieved July 18, 2017, \"...Rohrabacher’s 2016 Moscow trip raised eyebrows among U.S. officials, particularly at the State Department....\"\n\nPrior to working in the Reagan Administration, Rohrabacher served as assistant press secretary to Ronald Reagan during his 1976 and 1980 presidential campaigns. During his tenure at the White House, Rohrabacher played a leading role in the formulation of the Reagan Doctrine. He also helped formulate President Reagan's Economic Bill of Rights, which was a series of policy proposals that Reagan introduced in a speech at the Jefferson Memorial.\n\nFollowing the election of President Trump in 2016, Rohrabacher was on the shortlist for Secretary of State along with Mitt Romney and eventual pick Rex Tillerson.\n\nEarly life\n\nRohrabacher, who is of German and English descent, was born June 21, 1947, in Coronado, California, the son of Doris M. (née Haring) and Donald Tyler Rohrabacher. He attended elementary school locally, and during his college years, he lived in Sunset Beach.\n\nRohrabacher graduated from Palos Verdes High School in Palos Verdes Estates, California, attended Los Angeles Harbor College, and earned a bachelor's degree in history at California State University, Long Beach in 1969. He received his master's degree in American Studies at the University of Southern California.\n\nWhile in graduate school and during the early 1970s, he had a side activity as a folk singer. He was also a writer for the Orange County Register. During this time he was considered a free-market anarchist and libertarian activist after his previous membership in Young Americans for Freedom. Libertarian author Samuel Konkin recalled Rohrabacher as \"a charismatic campus activist, radicalized by Robert LeFevre who provided him with small funding to travel the country with his instrument and folk songs from campus to campus, converting YAF chapters into Libertarian Alliances and SIL chapters.\"\n\nU.S. House of Representatives\n\nElections\n\nRohrabacher left the Reagan administration in 1988 to pursue the open House seat recently vacated by Dan Lungren. With the fundraising help of friend Oliver North, Rohrabacher was able to win the Republican primary with a plurality of 35%. He won the general election with 64%. He only had serious primary competition twice, in 1992 and 1998. After redistricting, he won a three candidate primary election in 1992 with a plurality of 48%. In 1998, he won an open primary with 54% of the vote. As far as general elections, he only dipped below 55% of the vote one time, in 2008.\n\n;2008\n\nHe defeated Democratic nominee Debbie Cook, Mayor of Huntington Beach, 53%–43%, the lowest winning percentage of Rohrabacher's career.\n\n;2010\n\nHe defeated Democratic nominee Ken Arnold 62%–38%.\n\n;2012\n\nAfter redistricting, he announced that he would run in the newly redrawn California's 48th congressional district. He said \"The new 48th District is a good fit and something that will enable me to serve my constituents and the country well.\" He won re-election in this Orange County district with 61% of the vote.\n\n;2014\n\nRohrabacher won reelection with 64.1% of the vote.\n\n;2016\n\nRohrabacher won reelection with 58.3% of the vote.\n\nTenure\n\nIn 2011, Rohrabacher voted against the National Defense Authorization Act for Fiscal Year 2012.\n\n;2011 visit to Iraq\nDuring a trip to Iraq in June 2011, he said that Iraq should pay back the U.S. for all the money it had spent since the invasion, when it becomes a wealthy country. Rohrabacher also commented he would be holding a hearing with the Sub-Committee on Oversight and Investigations into whether Iraq committed \"crimes against humanity\" during an attack on Camp Ashraf in April 2011. The incident left 34 residents killed and over 300 wounded. The delegation was denied access to the camp by Iraqi government, citing their sovereignty. Rohrabacher's delegation was subsequently asked to leave the country.\n\n;Payment for 30-year-old screenplay\nOn November 4, 2005, the Los Angeles Times reported that Rohrabacher was paid 23,000 dollars for a thirty-year-old screen play of his. At issue was whether the producer paid him for the screenplay or for the introductions to congressional and federal officials. Rohrabacher said that the introductions were made in good faith, were nothing that was not done regularly for legitimate causes, and that the introductions have only become an issue because of Joseph Medawar's alleged misdeeds.\n\nIn May 2006, Rohrabacher announced through his press secretary that he would return the $23,000. The decision was made public shortly before Medawar took responsibility in a United States District Court for bilking $3.4 million from about 50 investors.\n\nIn February 2017, Rohrabacher faced criticism for refusing to meet with constituents that showed up at his local Huntington Beach office. The constituents were upset with his support of President Donald Trump. Police were called to remove the constituents.\n\nCommittee assignments\n\n* Committee on Foreign Affairs\n** Subcommittee on the Middle East and South Asia\n** Subcommittee on Oversight and Investigations (Chairman)\n* Committee on Science, Space and Technology\n** Subcommittee on Space and Aeronautics\n** Subcommittee on Energy and Environment\n\nRohrabacher chaired the Space and Aeronautics Subcommittee of the House Science Committee from 1997 until January 2005; he received a two-year waiver to serve beyond the six-year term limit.\n\nAs a senior member of the International Relations Committee, Rohrabacher led the effort to deny Most Favored Nation trading status to the People's Republic of China, citing that nation's dismal human rights record and opposition to democracy. His subcommittee assignments are East Asia and Pacific, and Middle East and South Asia.\n\nCaucus memberships\n\n* Congressional Cannabis Caucus\n* Congressional Human Rights Caucus\n* International Conservation Caucus\n* Congressional Taiwan Caucus\n* Sportsmen's Caucus\n* Freedom Caucus\n\nPolitical positions\n\nIn terms of his positions, Rohrabacher voted to repeal Obamacare, disputes evidence of man-made global warming, is a staunch opponent of illegal immigration, and favors the legalization of marijuana. In foreign policy, he supported withdrawing U.S. troops from Afghanistan, called for Trump to punish Turkish President Erdoğan on embassy violence, sided with Russia in the Russia–Georgia war, gave a qualified defense of the annexation of Crimea in 2014 and supports cooperating with Russia in Syria.\n\nOn May 17, 2017, the Washington Post reported that a month before Donald Trump clinched the Republican nomination, House Majority Leader Kevin McCarthy stated \"There's two people I think Putin pays: Rohrabacher and Trump. Swear to God.\" Brendan Buck, counselor to Paul Ryan, initially denied these reports but later, after being informed that the Post would cite a recording as evidence, said that McCarthy had been joking.\n\nHe was warned in 2012 by the FBI that Russian spies may have been trying to recruit him to act on Russia's behalf, after he met with a member of the Russian foreign ministry privately in Moscow. Following the ISIS terrorist attacks in Tehran on June 7, 2017, in which 17 innocent civilians were killed, he suggested that the attack could be viewed as ‘a good thing', and surmised that President Trump might have been behind the coordination of this terrorist attack.Rep. Dana Rohrabacher suggested that the #ISIS attacks on #Iran could be viewed as ‘a good thing.’, [https://www.facebook.com/NIACouncil/videos/10155549174868938/?hc_refNEWSFEED], Retrieved June 9, 2017 An article in The Atlantic suggested that there was serious concern in the State Department of ties between Rohrabacher and the Russian government.\n\nOn November 21, 2017, the New York Times reported that Rohrabacher had come under scrutiny from special counsel Robert Mueller and the Senate Intelligence Committee for his close ties to the Kremlin.\n\nRohrabacher has drawn public criticism for some of his positions. His controversial statements include the conspiracy theory claims, first promoted by the politically-biased conspiracy theory website Infowars, that Democrats secretly organized the Unite the Right Rally in Charlottesville to provoke the violence by the alt-right (which led to the murder of one anti-Nazi protester) in order to discredit President Trump. Rochabacher has also consistently supported Russian interests in Congress and has defended Trump's controversial remarks regarding Russia.\n\nGlobal warming\n\nRohrabacher doubts that global warming is caused by humans. During a congressional hearing on climate change on February 8, 2007, Rohrabacher mused that previous warming cycles may have been caused by carbon dioxide released into the atmosphere by \"dinosaur flatulence\": \"In fact, it is assumed at best to be unproven and at worst a liberal claptrap, trendy, but soon to go out of style in our new Congress.\"  Politico and the New York Times reported that on May 25, 2011, Rohrabacher expressed further skepticism regarding the existence of man-made global warming and suggested that, if global warming is an issue, a possible solution could be clear-cutting rain forests, and replanting.  These reports sparked strong criticism by some scientists, including Oliver Phillips, a geography professor at the University of Leeds.  They noted the consensus that intact forests act as net absorbers of carbon, reducing global warming. In response, Rohrabacher stated,\n\nRohrabacher does not believe that global warming is a problem. At a town hall meeting with the Newport Mesa Tea Party in August 2013, Rohrabacher said \"global warming is a total fraud\" and part of a \"game plan\" by liberals to \"create global government\".\n\nHealthcare\n\nOn May 4, 2017, Rohrabacher voted in favor of repealing the Patient Protection and Affordable Care Act (Obamacare) and passing the American Health Care Act.\n\nImmigration\n\nRohrabacher was an advocate for the state of California's Proposition 187, which prohibited illegal immigrants from acquiring government services. In 2004, he sponsored an amendment that would have prohibited federal reimbursement of hospital-provided emergency care and certain transportation services to undocumented aliens unless the hospital provided information about the aliens' citizenship, immigration status, financial data, and employer to the Secretary of Homeland Security. Aliens who were in the country illegally would receive reimbursement only after they were deported. The proposed bill was defeated, 331–88.\n\nIn early 2008, Rohrabacher endorsed Mitt Romney in the Republican presidential primary, citing his positions on stemming illegal immigration and criticizing John McCain. About McCain, he said: \"He's been the enemy of those of us who have stemmed the flow of illegals into our country, whereas Romney has made some very tough commitments.\"\n\nIn 2011, Rohrabacher proposed the bill H.R. 787 known as the \"No Social Security for Illegal Immigrants Act of 2011\". The bill: \"Amends title II of the Social Security Act to exclude from creditable wages and self-employment income any wages earned for services by aliens performed in the United States, and self-employment income derived from a trade or business conducted in the United States, while the alien was not authorized to be so employed or to perform a function or service in such a trade or business.\"\n\nIn 2013, an 18-year-old student visited Rohrabacher's office to discuss immigration reform. At some point their conversation became disagreeable, and the student said the congressman yelled at her: \"I hate illegals!\" He also allegedly threatened to deport her family. Rohrabacher's spokesperson has disputed both statements, averring that it was actually the student who started the confrontation by yelling at her and telling her to \"butt out\".\n\nNumbersUSA has given Rep. Rohrabacher an A+ rating in accordance to his stance on illegal immigration.\n\nLGBT\n\nIn a debate at Orange Coast College, he voiced his support for Proposition 8, which defines marriage in California as only between a man and a woman, and said that he \"would suggest not changing the definition of marriage in our society to make a small number of people feel more comfortable.\"\n\nRohrabacher opposes the legal recognition of same-sex marriage. In both 2004 and 2006, Rohrabacher voted in favor of the Federal Marriage Amendment, a proposed amendment to the United States Constitution defining marriage as only being a legal union defined between a man and a woman. In 2013, Rohrabacher proclaimed that the Hollingsworth v. Perry  Supreme Court decision overturning Proposition 8 was \". . . not based on the merits of the issue but on a technicality\". Recently, however, Rohrabacher has appeared to endorse the idea of getting the government out of marriage, saying that churches should conduct marriages, while the government allows legal contractual partnerships between couples.\n\nMarijuana\n\nRohrabacher supports the legalization of marijuana for both medical and recreational purposes. He has spoken against the policy of cannabis prohibition as early as May 2013, calling it a \"colossal failure\" in an op-ed penned for the Orange County Register.  He further outlined his views in a May 2014 op-ed in National Review, arguing that the prohibition of cannabis has incurred a number of undesirable costs upon free society, such as an increase in gang violence, soaring incarceration rates, unconstitutional seizure of private property through civil forfeiture, corruption and militarization of police forces, and negative impacts on minority communities and relationships with Latin-American countries. Rohrabacher has called on fellow Republicans to reconsider their stance towards cannabis, citing core conservative principles such as limited government, individual liberty, respect for the Tenth Amendment, and respect for the doctor–patient relationship that Rohrabacher says lend support to loosening current laws.  He also notes conservative leaders such as Milton Friedman, William F. Buckley, and Grover Norquist that have espoused similar drug policy views.  In April 2016, Rohrabacher announced his endorsement of California's Proposition 64, the Adult Use of Marijuana Act.\n\nRohrabacher is a strong proponent of states' rights when it comes to cannabis policy. He has introduced the Rohrabacher–Farr amendment for a number of years beginning in 2003, to prohibit the Justice Department from spending funds to interfere with the implementation of state medical cannabis laws. The amendment passed the House for the first time in May 2014, becoming law in December 2014 as part of an omnibus spending bill. Additional legislation that Rohrabacher has introduced includes the Respect State Marijuana Laws Act and the Veterans Equal Access Act. Rohrabacher has called on the DEA / DOJ to remove cannabis from the list of Schedule I drugs.  In February 2017, Rohrabacher co-founded the Congressional Cannabis Caucus – along with Reps. Don Young (R–AK), Jared Polis (D–CO), and Earl Blumenauer (D–OR) – to help advance policy change regarding cannabis at the federal level.  Rohrabacher has an \"A+\" rating from NORML for his voting record regarding cannabis-related matters.\n\nPatent reform\n\nRohrabacher is an opponent of the America Invents Act, a bill that is attempting to change the current Patent System. Rohrabacher opposes changing from a \"first to invent system\" to a \"first to file system\" saying it \"hurts the little guy\". Rohrabacher commented: \"Make no mistake, 'first to file' weakens patent protection. It is likely to make vulnerable individual and small inventors, who don't have an army of lawyers on retainer. These 'little guys' have been the lifeblood of American progress and competitiveness for more than 200 years. Our system was designed to protect individual rights, and it has worked for all – not just the corporate elite.\" Rohrabacher went on to comment in a Politico op-ed: \"We're told this is necessary to harmonize with Japanese and European patent law. But those systems were established by elitists and economic shoguns interested in corporate power, not individual rights.\"\n\nSpace\n\nRohrabacher was chairman of the Subcommittee on Space and Aeronautics from 1997 to January 2005 and has been active on space-related issues. In 2000, Space.com described Rohrabacher as \"a strident advocate for supremacy in space, a philosophy shaped along a winding road from libertarian activist to White House speech writer in the Reagan administration.\" In 2007, Rohrabacher introduced a bill that would direct NASA to develop a strategy \"for deflecting and mitigating potentially hazardous near-Earth objects.\" Rohrabacher has applauded the Apollo astronauts, calling them unofficial ambassadors. Rohrabacher stated \"I applaud their efforts and accomplishments over the past fifty years. And I encourage all Americans to join with me in thanking them for their accomplishments and for the international role they have played in serving as unofficial Ambassadors to the world on our behalf.\"\n\nOn July 18, 2017, Rohrabacher asked a panel of space experts testifying before the House Committee on Science, Space, and Technology if civilizations could have existed on Mars in the past. Kenneth Farley, a project scientist on NASA’s Mars Rover 2020 Project, said: \"I would say that is extremely unlikely.\"\n\nTax reform\n\nRohrabacher voted against the Tax Cuts and Jobs Act of 2017. Despite efforts made by Republicans to change the bill to be more generous regarding cap deductions on new home mortgages, Rohrabacher remained staunch at voting nay on the bill, as the majority of half of the new mortgages in his district are above the $750,000 cap. He stated on his Facebook page that “Due to the pressure of several members like me, the bill was improved, but not enough for my constituents.\"\n\nForeign and security policy positions\n\nForeign policy\n\nIn February 2013, Rohrabacher gave a speech urging the right to self-determination for the Baloch people in Pakistan at a UNPO conference in London.\n\nIn March 2005, Rohrabacher introduced HR 1061, the American Property Claims Against Ethiopia Act, which would \"prohibit United States assistance to the Federal Democratic Republic of Ethiopia until the Ethiopian government returns all property of United States citizens.\" The bill was introduced by Rohrabacher at the behest of Gebremedhin Berhane, a former Eritrean national and friend of the Rohrabacher family, after his business was expropriated by the Ethiopian government.\n\nOn March 7, 2006, Rohrabacher introduced HR 4895, an amendment to the Foreign Assistance Act of 1961, \"to limit the provision of the United States military assistance and the sale, transfer, or licensing of United States military equipment or technology to Ethiopia.\"\n\nDuring an appearance on MSNBC's The Ed Show, Rohrabacher accused Barack Obama of allowing violence in Iran to get out of hand because he did not speak forcefully enough against the country's leadership. He also said that Gorbachev tore down the Berlin Wall because Reagan told him to (\"Tear down this wall\").[https://www.votesmart.org/speech_detail.php?sc_id476422&keyword\n&phrase&contain\n MSNBC \"The Ed Show\" Interview – Transcript] 2009-06-23\n\nIn early 2010, he went to Honduras to commend the election of the new president. His entourage included a group of Californian property investors and businessmen, a dealer in rare coins, and CEOs from San Diego biofuels corporation (which is headed by a family friend).\n\nTerrorism\n\nIn 2006, Rohrabacher chaired the Subcommittee on Oversight and Investigations of the U.S. House Committee on International Relations, which investigated whether the Oklahoma City bombers had assistance from foreign sources and determined there was no conclusive evidence of a foreign connection. In the 113th Congress, Rohrabacher is chair of the House Foreign Affairs Subcommittee on Europe, Eurasia and Emerging Threats.\n\nRohrabacher has stated that he sees Islam as the source of a major terrorist threat to the U.S. Speaking about Islam he said during a hearing in April 2013, \"I hope we all work together against a religion that will motivate people to murder children and other threats to us as a civilization.\"\n\nIn 2014, Rohrabacher suggested that Iraq's borders be redrawn in response to the establishment of the Islamic State of Iraq and the Levant.\n\nIn the wake of the 2016 Orlando nightclub shooting, Rohrabacher put out a press release stating he felt \"outrage\" and a \"renewed commitment to defeat and destroy the radical Islamic movement that fosters such mayhem.\" He stressed that Americans must \"be sure not to label all Muslims as terrorist murderers.\" Rohrabacher met Seddique Mateen, the father of the shooter, in 2014 during routine meetings with constituents. He called Mateen an \"estranged individual.\"\n\nOn June 10, 2017, during a House Foreign Affairs Committee hearing on Lebanon's Hezbollah, a day after two ISIL attacks in Tehran were carried out, Rohrabacher stated that: \n\nRohrabacher's statement was criticised in social media by British political journalist Mehdi Hasan, Human Rights Watch Deputy Director Jim Murphy, journalist Negar Mortazavi and the National Iranian American Council, among others.\n\nIn a further statement to clarify his position, he stated that he opposes \"the use of force against unarmed civilians no matter who is the victim or who is doing the killing\" but he is also against \"Iran’s vicious Mullah monarchy\" and \"when it comes to Sunni terrorists or Shiite terrorists, I prefer them to target each other rather than any other victims, especially innocent civilians and Americans.\" He added that it will \"require support for those proud Iranians who want to win their freedom and heritage from Mullahs and are willing to fight for it. That does not include Isis, but it may include a lot of Iranians who see blowing up Khomeini’s mausoleum as an expression of freedom from the yolk [sic] of Islamic terror.\"\n\nDefense of interrogation techniques and extraordinary rendition\n\nOn April 17, 2007, while defending the Bush administration's program of extraordinary rendition. During a House hearing on trans-atlantic relations, Rohrabacher stated that the unfair treatment of one innocent suspect is an acceptable \"unfortunate consequence\" of holding others who would otherwise be free to commit terror acts. After he received boos and groans from the gallery, Rohrabacher responded, \"Well, I hope it's your families, I hope it's your families that suffer the consequences\", and \"I hope it's your family members that die\". Rohrabacher was subsequently interrupted by protesters wearing orange jumpsuits who were removed from the gallery. For his comment that imprisoning and torturing one innocent person was a fair price to pay for locking up 50 terrorists who would \"go out and plant a bomb and kill 20,000 people,\" Rohrabacher was named Countdown with Keith Olbermann's \"Worst Person in the World\" on April 25.\n\nAfghanistan\n\nRohrabacher's interest in Afghanistan extends back at least to the late 1980s, before his time in office, when he entered the country in the company of mujahedin fighters who were intent on confronting Soviet occupation forces. Reportedly, these fighters \"actually engaged Soviet troops in combat near the city of Jalalabad during the two months Rohrabacher was with them.\"  In the years after the Soviet–Afghan War (1979–1989), Rohrabacher said his \"passion\" was to bring back the country's exiled king, Muhammad Zahir Shah.\n\nIn 2003, he defended the new Afghan constitution against those who saw in it mainly empowerment of warlords, saying:\n\nRohrabacher has since become a proponent of withdrawing from Afghanistan. He protested against the troop build up to Afghanistan by President Obama saying \"If the Taliban is going is be defeated, it's got to be by the Afghan people themselves, not by sending more U.S. troops, which could actually be counterproductive.\" When Congressman Jim McGovern offered an amendment earlier this year requiring the Pentagon to draw up an exit plan from Afghanistan, Rohrabacher was just one of six Republicans to sign on. Rohrabacher further voted for McGovern's Amendment to the National Defense Authorization Act, requiring an exit plan from Afghanistan. The bill failed by 204–215 margin.http://clerk.house.gov/evs/2011/roll373.xml\n\nRohrabacher is against President Obama's gradual draw down of troops supporting a full withdrawal. Saying \"If we're going to leave, we should leave.\" Rohrabacher has gone on to state \"The centralized system of government foisted upon the Afghan people is not going to hold after we leave,\" continued Rohrabacher. \"So let's quit prolonging the agony and inevitable. Karzai's regime is corrupt and non representative of Afghanistan's tribal culture. This failed strategy is not worth one more drop of American blood. Under the current strategy, our military presence alienates more Afghans that it pacifies. So if you're going to pull the plug, then we need to get the hell out now.\" Rohrabacher has repeatedly raised high-level concerns in the US Congress and Washington, D.C., about the significant corruption in Afghanistan, including the Kabul Bank scandal where hundreds of millions of U.S. taxpayers' dollars allegedly disappeared in a short period of time at the apparent hands of close Karzai family members, including brothers Mahmoud Karzai (a.k.a. Mahmood Karzai), Ahmed Wali Karzai and others.  Rohrabacher worked to bring attention to the systemic corruption in the Karzai government and cut U.S. taxpayers' funding for these wasteful projects and programs, involving corruption within the Hamid Karzai government.\n\nIn April 2012, CNN reported that \"A top Republican on the House Foreign Affairs committee was asked by the State Department not to go to Afghanistan because President Hamid Karzai objected to the visit. ... Dana Rohrabacher, R-California, told Security Clearance he was readying to travel with five other Republicans from Dubai to Afghanistan's capital, Kabul, when the State Department requested he stay behind.\"\n\nBosnia and Kosovo independence\n\nRohrabacher was opposed to American ground troops in the Yugoslav Wars. He advocated for the direct bombing of the military on Yugoslav soil, criticizing the ineffectiveness of western forces against the Bosnian Serbs, NATO was limited to small fixed attacks, as these Serbs penetrated UN safe areas and attacked Bosniak forces. Rohrabacher said they \"should bomb Serbia's military infrastructure, in Serbia – get that, in Serbia – rather than dropping a couple of duds on tents, which only proves the West's gutlessness, and emboldens Serbian cutthroats.\" Rohrabacher considered the events in Bosnia to constitute genocide. In 1995, Rohrabacher personally visited Sarajevo in Bosnia, criticizing the devastation Serb forces inflicted on the city, saying \"This is a loss to all mankind, not just to the people of Sarajevo,\". He also encountered vagabond children asking for money.\n\nThe leader of the Albanian American Civic League ethnic lobby group, Joseph J. DioGuardi, praised Rohrabacher for his support to the Kosovo Liberation Army (KLA), saying \"He was the first member of Congress to insist that the United States arm the Kosova Liberation Army, and one of the few members who to this day publicly supports the independence of Kosova.\" Rohrabacher gave a speech in support of American equipping the KLA with weaponry, comparing it to French support of America in the Revolutionary War, saying \"Based on our own experience, the Kosova Liberation Army should have been armed. ... If the U.S. had armed the KLA in 1998, we would not be where we are today. The 'freedom fighters' would have secured their freedom and Kosova would be independent.\"\n\nOrgan harvesting in China\n\nIn 2012 Rohrabacher stated,\nand \n\nIraq War\n\nRohrabacher voted in support of the Authorization for the Use of Military Force Against Iraq in 2002, a position that he later admitted was \"a mistake.\"\n\nIran\n\nIn August 2012, Rohrabacher noted on his official website that he had written a letter addressed to the U.S. State Department, noting his support of U.S. sponsorship of separatist movements in Iran. This elicited criticism from the Iranian-American community, which included challenging Rohrabacher's understanding of the historical background alluded to in his letter to the Department of State.http://iranianfacebook.com/2012/08/27/congressman-dana-rohrabacher-embarrasses-himself-by-calling-for-a-separatist-movement-in-iran-based-on-a-flawed-historical-understaning/\n\nIn June 2017, a day after ISIL attack in Tehran, during a House Foreign Affairs Committee hearing, Rohrabacher stated: \"Isn’t it a good thing for us to have the United States finally backing up Sunnis who will attack Hezbollah and the Shiite threat to us, isn’t that a good thing?\" This comment was strongly criticized by the National Iranian American Council, which wrote, \"Rohrabacher has a long history of bizarre and offensive statements on Iran, but his callousness toward the Iranian victims of ISIS terror might be his most callous and extreme thus far.\"\n\nAid to Pakistan\n\nIn May 2011, in the wake of Osama Bin Laden's death, Rohrabacher introduced a bill to stop aid to Pakistan, stating that members of the government and of Pakistan's security force, the ISI, were either sheltering Bin Laden or completely incompetent. \"We can no longer afford this foolishness. ... The time has come for us to stop subsidizing those who actively oppose us. Pakistan has shown itself not to be America's ally.\" Rohrabacher also demanded the return of the US helicopter that crashed in the operation to kill Bin Laden, stating \"If this is not done immediately, it is probable, given Pakistan’s history, that our technology has already found its way into the hands of the Communist Chinese military that is buying, building, and stealing the necessary military technology to challenge the United States.\" \n\nSupport for Mohiuddin Ahmed\n\nIn 2007, Rohrabacher supported Mohiuddin Ahmed, a detainee in the U.S., who was said to be involved in an attempted coup in Bangladesh, during which several people were murdered. He was convicted of the assassination of Sheikh Mujibur Rahman, the first President of Bangladesh. Bangladesh's extradition request was halted as Rohrabacher voiced concern about his legal rights, saying that he should be sent somewhere with no death penalty. His support was applauded by both Amnesty International and the U.S. Conference of Catholic Bishops.[https://news.google.com/archivesearch?qBut+time+is+running+out.+Ahmed+was+to+have+left+the+country+Monday+night%2C+but+Rep.+Dana+Rohrabacher+%28R-Huntington+Beach%29+called+Homeland+Security+Secretary+Michael+Chertoff%E2%80%99s+office+and+requested+a+delay+%22And+because+of+that%2C+Dana+felt+as+though+there+would+be+no+harm+in+trying+to+buy+some+time+for+his+legal+counsel+to+find+a+country%22+where+he+would+not+be+put+to+death.&ie\nUTF-8&oeUTF-8&scoring\na] [https://news.google.com/archivesearch?q%22Amnesty+International+and+our+State+Department+has+questioned+the+integrity+of+the+Bangladeshi+judicial+system%2C%22+said+Tara+Setmayer%2C+a+spokeswoman+for+Rohrabacher&btnG\nSearch+Archives&ieUTF-8&oe\nUTF-8&scoringa] [https://news.google.com/archivesearch?q\n%22And+because+of+that%2C+Dana+felt+as+though+there+would+be+no+harm+in+trying+to+buy+some+time+for+his+legal+counsel+to+find+a+country%22+where+he+would+not+be+put+to+death.&btnGSearch+Archives&ie\nUTF-8&oeUTF-8&scoring\na] [https://news.google.com/archivesearch?q%22Given+the+circumstances%2C+he+said+he%E2%80%99d+be+willing+to+place+a+phone+call+or+two+to+buy+some+time+and+figure+things+out%2C%22+she+said.&btnG\nSearch+Archives&ieUTF-8&oe\nUTF-8&scoring=a] [http://www.docstrangelove.com/2007/04/03/dana-rohrabachers-hypocrisy-of-terror/]\n\nRussia\n\nOn September 8, 2008, at a House of Representatives Foreign Affairs Committee meeting, Rohrabacher argued that the Georgians had initiated the recent military confrontation in the ongoing Russia–Georgia war.\n\nIn April 2014, he supported the idea of Alaskans rejoining Russia if a majority voters in Alaska wanted to.\n\nAccording to a 2015 article by Politico reporter Luke O'Brien, Rohrabacher is known for his long-time friendship with Russia's Vladimir Putin and his defense of \"the Russian point of view.\"See Luke O'Brien, \"Putin's Washington\" [http://www.politico.com/magazine/story/2015/01/putins-washington-113894.html#ixzz3O6keOMJp Politico Jan–Feb. 2015] On June 15, 2016, Republican congressman Kevin McCarthy told a group of Republicans, \"There's two people I think Putin pays: Rohrabacher and Trump. Swear to God.\" Paul Ryan ended the conversation, saying \"No leaks. This is how we know we're a real family here.\"\n\nIt was not reported for another year that around that time, Rohrabacher had planned, in his capacity as chair of the Europe subcommittee, to hold a hearing on the Magnitsky Act, which bars certain Russian officials from entering the United States or holding any financial assets in American banks. At the hearing Bill Browder, the American-born investor who had lobbied for the act's passage after what he claims was the illegal appropriation of his hedge fund's assets and the subsequent murder of his Russian lawyer Sergei Magnitsky after he discovered this, was to testify. Rohrabacher planned to subject him to what was described as a \"show trial\", where in addition to questioning Browder closely and skeptically about his claims, a feature-length documentary film critical of the Magnitsky claims directed by Andrei Nekrasov was to be shown in its entirety. Among the other witnesses scheduled to testify were Russian lawyer Natalia Veselnitskaya, a longtime lobbyist against the Magnitsky Act who had around the same time attended a meeting with Donald Trump Jr, Jared Kushner and Trump's then-campaign manager Paul Manafort at which the Russians purportedly offered to share negative information about Hillary Clinton, Trump's opponent in that year's election.\n\nWhen Foreign Affairs Committee chairman Ed Royce learned of the plans, he canceled the hearing and forbade Rohrabacher from showing the film. In its stead, he held a full committee hearing on U.S.-Russia relations at which Rohrabacher was allowed to submit some of the pro-Russian claims into evidence. The film was ultimately shown at the Newseum, and an intern in Rohrabacher's office who later worked for the Trump transition team sent emails promoting the film from the subcommittee offices.\n\nAfter Donald Trump won the 2016 presidential election, Rohrabacher defends his approach to improve Russian–American relations. He had previously met at least twice to discuss Russian sanctions with Rinat Akhmetshin, a former Soviet spy, who was later revealed to be present at the June 2016 meeting.\n\nIn a May 2017 interview with CNN, Rohrabacher said, \"We have a huge double standard with Russia when it comes to prisoners and other things,\" and further stated that interference by the Russian intelligence services' in the 2016 U.S. election was the same as the NSA bugging German Chancellor Angela Merkel's phone.\n\nIn October 2017, the House Committee on Foreign Affairs placed restrictions on Rohrabacher's ability to use committee money to pay for foreign travel due to concerns over his interest in Russia.\n\nTaiwan\n\nAfter President-elect Donald Trump answered a congratulatory phone call from democratically elected President of Taiwan Tsai Ing-wen on December 2, 2016,[https://www.wsj.com/articles/donald-trump-spoke-with-taiwan-president-tsai-ing-wen-1480718423 Trump Spoke With Taiwan President in Break With Decades of U.S. Policy: Leaders ‘noted close’ economic, political and security ties, Trump transition team said], The Wall Street Journal, 2016-12-2[http://www.nydailynews.com/opinion/trump-phone-call-taiwan-president-major-breakthrough-article-1.2896742 President-elect Donald Trump's phone call to Taiwan's leader is a major breakthrough for U.S. relations with the nation], New York Daily News, 2016-12-2[http://www.foxnews.com/opinion/2016/12/04/why-trump-was-right-to-talk-with-taiwans-president.html Why Trump was right to talk with Taiwan's president], Fox news, 2016-12-4[http://www.chicagotribune.com/news/opinion/commentary/ct-trump-taiwan-call-china-20161205-story.html Trump's Taiwan call wasn't a mistake. It was brilliant.], Chicago Tribune, 2016-12-5 Rohrabacher said Trump's phone call with Taiwan's president was \"terrific\" because of the diplomatic warning it sent to China. \"He showed the dictators in Beijing that he's not a pushover.\" He emphasized, \"China has had an enormously aggressive foreign policy and by him actually going to Taiwan, he's showing the people in Beijing that they cannot have this aggressive foreign policy and expect to be treated just the same by an American president.\"[http://www.politico.com/story/2016/12/dana-rohrabacher-trump-taiwan-232188 Rohrabacher: Trump's Taiwan call shows China he's not a pushover], Politico, 2016-12-5\n\nUkraine\n\nRohrabacher gave a \"qualified defense\" of the annexation of Crimea by Russia in 2014. On March 6, 2014, he was one of 23 members of the House of Representatives to vote against a $1 billion loan guarantee to support the new government of Ukraine. In the March 11, 2014, House of Representatives vote (402 voting yes; 7 opposed) to condemn Russia for violating Ukraine's sovereignty, Rohrabacher voted \"present.\" Commenting on the issue, he stated, \"Starting with our own American Revolution, groups of people have declared themselves, rightfully, to be under a different government or a government of their choosing. People forget that’s what our Declaration of Independence is all about.\" He also said, \"The sanctions are an abomination of hypocrisy. This is ridiculous: What we were doing with the violence and military action we took to secure the Kosovars' right to self-determination was far more destructive and had far more loss of life than what Putin's done trying to ensure the people of Crimea are not cut off from what they would choose as their destiny with Russia.\"\n\nUzbekistan\n\nDuring a US Congressional delegation's visit to Uzbekistan in February 2013, Rohrabacher made several controversial statements. The chief among those statements was that the United States should treat Uzbekistan like Saudi Arabia by disregarding the former's human rights abuses in achieving America's national interests, particularly in selling armaments and drones to Uzbekistan.\n\nMacedonia\n\nIn 2017, in an interview for an Albanian TV channel Vizion Plus Rohrabacher suggested that the Republic of Macedonia \"is not a country\" and that the \"Kosovars and Albanians from Macedonia should be part of Kosovo and the rest of Macedonia should be part of Bulgaria or any other country to which they believe they are related\", which provoked a response from the Macedonian foreign ministry which accused him of inflaming \"nationalistic rhetoric\".\n\nTurkey \n\nIn the wake of the clashes at the Turkish Ambassador's Residence in May 2017,  Rohrabacher called Donald Trump to never invite Turkish President Recep Tayyip Erdoğan again to the United States, and to bar Americans from purchasing Turkish government debt.\n\nEritrea \n\nIn August 2017, Rohrabacher proposed amending the Department of Defense budget whereby the United States would establish military ties with Eritrea. Rohrabacher suggested that the two countries should cooperate in fighting the War on Terror, curbing Iranian influence in the Yemeni Civil War, and securing the Red Sea region. At the time of Rohrabacher's proposal, Eritrea was subject to international sanctions due to its alleged support of Al-Shabaab in Somalia, and to U.S. sanctions against the Eritrean Navy following an alleged shipment of North Korean military hardware to Eritrea.\n\nPersonal life\n\nRohrabacher has been married to his wife, Rhonda, since 1997. In 2004, they became parents of triplets.\n\nRohrabacher said he paid his wife about $50,000 a year from donation money to operate his 2012 reelection campaign.\n\nRohrabacher was described by the Los Angeles Times as \"an avid surfer.\"\nHe also sings, plays guitar, and has written his own song about freedom and America.\n\nRohrabacher revealed in May 2016 that he uses a cannabis-infused topical rub to treat the arthritis pain that he suffers from, allowing him to sleep through the night. The product is legal under California state law but remains a banned substance under U.S. federal law.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dana Rohrabacher" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8953" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dana Tyrone Rohrabacher (born June 21, 1947) is a member of the U.S House of Representatives representing . A Republican, he served as a speechwriter and Special Assistant to President Ronald Reagan from 1981 to 1988.\n\nRohrabacher voted to repeal Obamacare, is a staunch opponent of illegal immigration, has been described as an \"aggressive skeptic\" of global warming, and favors the legalization of marijuana. In foreign policy, he supported withdrawing U.S. troops from Afghanistan, called for Trump to punish Turkish President Erdoğan on embassy violence, sided with Russia in the Russia–Georgia war, gave a qualified defense of the annexation of Crimea in 2014Elias Isquith, March 25, 2014, Salon magazine, [http://www.salon.com/2014/03/25/gop_rep_dana_rohrabacher_half_defends_russias_annexation_of_crimea/ GOP Rep. Dana Rohrabacher half-defends Russia’s annexation of Crimea: The California congressman isn't saying it was right of Russia to seize the former Ukrainian territory, but ...], Retrieved August 1, 2017, \"...Rohrabacher went off-script for a moment and offered a qualified defense of Russia’s annexation of Crimea....\"Jonathan Weisman, March 28, 2014, The New York Times, [https://www.nytimes.com/2014/03/29/us/politics/kremlin-finds-a-defender-in-congress.html Kremlin Finds a Defender in Congress], Retrieved August 1, 2017, \"...There is some logic to Mr. Rohrabacher’s stalwart defense of the Kremlin’s actions. The people of Crimea...\" and supports cooperating with Russia in Syria and in other areas. He is notable for his strong pro-Russia and pro-Putin views,Byron Tau, Peter Nicholas and  Siobhan Hughes, September 15, 2017, Wall Street Journal, [https://www.wsj.com/articles/gop-congressman-sought-trump-deal-on-wikileaks-russia-1505509918 GOP Congressman Sought Trump Deal on WikiLeaks, Russia], Retrieved September 23, 2017 which have raised questions about his relation with Putin and the Russian government, with the FBI reporting that the Kremlin had given Rohrabacher a code name, signifying that he was viewed as a valuable potential asset for Russian intelligence.Damien Sharkov, May 19, 2017, Newsweek, [http://www.newsweek.com/republican-congressman-russian-spy-recruit-612381 FBI WARNED REPUBLICAN CONGRESSMAN WHO ARM-WRESTLED PUTIN OF RUSSIAN SPY RECRUITMENT], Retrieved May 20, 2017Rosie Gray, July 18, 2017, The Atlantic, [https://www.theatlantic.com/politics/archive/2017/07/russian-anti-sanctions-campaign-turned-to-california-congressman/534102/ Russian Anti-Sanctions Campaign Turned to California Congressman: U.S. diplomats were concerned about Russian outreach to House Republican Dana Rohrabacher while on a trip to Moscow last year.], Retrieved July 18, 2017, \"...Rohrabacher’s 2016 Moscow trip raised eyebrows among U.S. officials, particularly at the State Department....\"\n\nPrior to working in the Reagan Administration, Rohrabacher served as assistant press secretary to Ronald Reagan during his 1976 and 1980 presidential campaigns. During his tenure at the White House, Rohrabacher played a leading role in the formulation of the Reagan Doctrine. He also helped formulate President Reagan's Economic Bill of Rights, which was a series of policy proposals that Reagan introduced in a speech at the Jefferson Memorial.\n\nFollowing the election of President Trump in 2016, Rohrabacher was on the shortlist for Secretary of State along with Mitt Romney and eventual pick Rex Tillerson.\n\nEarly life\n\nRohrabacher, who is of German and English descent, was born June 21, 1947, in Coronado, California, the son of Doris M. (née Haring) and Donald Tyler Rohrabacher. He attended elementary school locally, and during his college years, he lived in Sunset Beach.\n\nRohrabacher graduated from Palos Verdes High School in Palos Verdes Estates, California, attended Los Angeles Harbor College, and earned a bachelor's degree in history at California State University, Long Beach in 1969. He received his master's degree in American Studies at the University of Southern California.\n\nWhile in graduate school and during the early 1970s, he had a side activity as a folk singer. He was also a writer for the Orange County Register. During this time he was considered a free-market anarchist and libertarian activist after his previous membership in Young Americans for Freedom. Libertarian author Samuel Konkin recalled Rohrabacher as \"a charismatic campus activist, radicalized by Robert LeFevre who provided him with small funding to travel the country with his instrument and folk songs from campus to campus, converting YAF chapters into Libertarian Alliances and SIL chapters.\"\n\nU.S. House of Representatives\n\nElections\n\nRohrabacher left the Reagan administration in 1988 to pursue the open House seat recently vacated by Dan Lungren. With the fundraising help of friend Oliver North, Rohrabacher was able to win the Republican primary with a plurality of 35%. He won the general election with 64%. He only had serious primary competition twice, in 1992 and 1998. After redistricting, he won a three candidate primary election in 1992 with a plurality of 48%. In 1998, he won an open primary with 54% of the vote. As far as general elections, he only dipped below 55% of the vote one time, in 2008.\n\n;2008\n\nHe defeated Democratic nominee Debbie Cook, Mayor of Huntington Beach, 53%–43%, the lowest winning percentage of Rohrabacher's career.\n\n;2010\n\nHe defeated Democratic nominee Ken Arnold 62%–38%.\n\n;2012\n\nAfter redistricting, he announced that he would run in the newly redrawn California's 48th congressional district. He said \"The new 48th District is a good fit and something that will enable me to serve my constituents and the country well.\" He won re-election in this Orange County district with 61% of the vote.\n\n;2014\n\nRohrabacher won reelection with 64.1% of the vote.\n\n;2016\n\nRohrabacher won reelection with 58.3% of the vote.\n\nTenure\n\nIn 2011, Rohrabacher voted against the National Defense Authorization Act for Fiscal Year 2012.\n\n;2011 visit to Iraq\nDuring a trip to Iraq in June 2011, he said that Iraq should pay back the U.S. for all the money it had spent since the invasion, when it becomes a wealthy country. Rohrabacher also commented he would be holding a hearing with the Sub-Committee on Oversight and Investigations into whether Iraq committed \"crimes against humanity\" during an attack on Camp Ashraf in April 2011. The incident left 34 residents killed and over 300 wounded. The delegation was denied access to the camp by Iraqi government, citing their sovereignty. Rohrabacher's delegation was subsequently asked to leave the country.\n\n;Payment for 30-year-old screenplay\nOn November 4, 2005, the Los Angeles Times reported that Rohrabacher was paid 23,000 dollars for a thirty-year-old screen play of his. At issue was whether the producer paid him for the screenplay or for the introductions to congressional and federal officials. Rohrabacher said that the introductions were made in good faith, were nothing that was not done regularly for legitimate causes, and that the introductions have only become an issue because of Joseph Medawar's alleged misdeeds.\n\nIn May 2006, Rohrabacher announced through his press secretary that he would return the $23,000. The decision was made public shortly before Medawar took responsibility in a United States District Court for bilking $3.4 million from about 50 investors.\n\nIn February 2017, Rohrabacher faced criticism for refusing to meet with constituents that showed up at his local Huntington Beach office. The constituents were upset with his support of President Donald Trump. Police were called to remove the constituents.\n\nCommittee assignments\n\n* Committee on Foreign Affairs\n** Subcommittee on the Middle East and South Asia\n** Subcommittee on Oversight and Investigations (Chairman)\n* Committee on Science, Space and Technology\n** Subcommittee on Space and Aeronautics\n** Subcommittee on Energy and Environment\n\nRohrabacher chaired the Space and Aeronautics Subcommittee of the House Science Committee from 1997 until January 2005; he received a two-year waiver to serve beyond the six-year term limit.\n\nAs a senior member of the International Relations Committee, Rohrabacher led the effort to deny Most Favored Nation trading status to the People's Republic of China, citing that nation's dismal human rights record and opposition to democracy. His subcommittee assignments are East Asia and Pacific, and Middle East and South Asia.\n\nCaucus memberships\n\n* Congressional Cannabis Caucus\n* Congressional Human Rights Caucus\n* International Conservation Caucus\n* Congressional Taiwan Caucus\n* Sportsmen's Caucus\n* Freedom Caucus\n\nPolitical positions\n\nIn terms of his positions, Rohrabacher voted to repeal Obamacare, disputes evidence of man-made global warming, is a staunch opponent of illegal immigration, and favors the legalization of marijuana. In foreign policy, he supported withdrawing U.S. troops from Afghanistan, called for Trump to punish Turkish President Erdoğan on embassy violence, sided with Russia in the Russia–Georgia war, gave a qualified defense of the annexation of Crimea in 2014 and supports cooperating with Russia in Syria.\n\nOn May 17, 2017, the Washington Post reported that a month before Donald Trump clinched the Republican nomination, House Majority Leader Kevin McCarthy stated \"There's two people I think Putin pays: Rohrabacher and Trump. Swear to God.\" Brendan Buck, counselor to Paul Ryan, initially denied these reports but later, after being informed that the Post would cite a recording as evidence, said that McCarthy had been joking.\n\nHe was warned in 2012 by the FBI that Russian spies may have been trying to recruit him to act on Russia's behalf, after he met with a member of the Russian foreign ministry privately in Moscow. Following the ISIS terrorist attacks in Tehran on June 7, 2017, in which 17 innocent civilians were killed, he suggested that the attack could be viewed as ‘a good thing', and surmised that President Trump might have been behind the coordination of this terrorist attack.Rep. Dana Rohrabacher suggested that the #ISIS attacks on #Iran could be viewed as ‘a good thing.’, [https://www.facebook.com/NIACouncil/videos/10155549174868938/?hc_refNEWSFEED], Retrieved June 9, 2017 An article in The Atlantic suggested that there was serious concern in the State Department of ties between Rohrabacher and the Russian government.\n\nOn November 21, 2017, the New York Times reported that Rohrabacher had come under scrutiny from special counsel Robert Mueller and the Senate Intelligence Committee for his close ties to the Kremlin.\n\nRohrabacher has drawn public criticism for some of his positions. His controversial statements include the conspiracy theory claims, first promoted by the politically-biased conspiracy theory website Infowars, that Democrats secretly organized the Unite the Right Rally in Charlottesville to provoke the violence by the alt-right (which led to the murder of one anti-Nazi protester) in order to discredit President Trump. Rochabacher has also consistently supported Russian interests in Congress and has defended Trump's controversial remarks regarding Russia.\n\nGlobal warming\n\nRohrabacher doubts that global warming is caused by humans. During a congressional hearing on climate change on February 8, 2007, Rohrabacher mused that previous warming cycles may have been caused by carbon dioxide released into the atmosphere by \"dinosaur flatulence\": \"In fact, it is assumed at best to be unproven and at worst a liberal claptrap, trendy, but soon to go out of style in our new Congress.\"  Politico and the New York Times reported that on May 25, 2011, Rohrabacher expressed further skepticism regarding the existence of man-made global warming and suggested that, if global warming is an issue, a possible solution could be clear-cutting rain forests, and replanting.  These reports sparked strong criticism by some scientists, including Oliver Phillips, a geography professor at the University of Leeds.  They noted the consensus that intact forests act as net absorbers of carbon, reducing global warming. In response, Rohrabacher stated,\n\nRohrabacher does not believe that global warming is a problem. At a town hall meeting with the Newport Mesa Tea Party in August 2013, Rohrabacher said \"global warming is a total fraud\" and part of a \"game plan\" by liberals to \"create global government\".\n\nHealthcare\n\nOn May 4, 2017, Rohrabacher voted in favor of repealing the Patient Protection and Affordable Care Act (Obamacare) and passing the American Health Care Act.\n\nImmigration\n\nRohrabacher was an advocate for the state of California's Proposition 187, which prohibited illegal immigrants from acquiring government services. In 2004, he sponsored an amendment that would have prohibited federal reimbursement of hospital-provided emergency care and certain transportation services to undocumented aliens unless the hospital provided information about the aliens' citizenship, immigration status, financial data, and employer to the Secretary of Homeland Security. Aliens who were in the country illegally would receive reimbursement only after they were deported. The proposed bill was defeated, 331–88.\n\nIn early 2008, Rohrabacher endorsed Mitt Romney in the Republican presidential primary, citing his positions on stemming illegal immigration and criticizing John McCain. About McCain, he said: \"He's been the enemy of those of us who have stemmed the flow of illegals into our country, whereas Romney has made some very tough commitments.\"\n\nIn 2011, Rohrabacher proposed the bill H.R. 787 known as the \"No Social Security for Illegal Immigrants Act of 2011\". The bill: \"Amends title II of the Social Security Act to exclude from creditable wages and self-employment income any wages earned for services by aliens performed in the United States, and self-employment income derived from a trade or business conducted in the United States, while the alien was not authorized to be so employed or to perform a function or service in such a trade or business.\"\n\nIn 2013, an 18-year-old student visited Rohrabacher's office to discuss immigration reform. At some point their conversation became disagreeable, and the student said the congressman yelled at her: \"I hate illegals!\" He also allegedly threatened to deport her family. Rohrabacher's spokesperson has disputed both statements, averring that it was actually the student who started the confrontation by yelling at her and telling her to \"butt out\".\n\nNumbersUSA has given Rep. Rohrabacher an A+ rating in accordance to his stance on illegal immigration.\n\nLGBT\n\nIn a debate at Orange Coast College, he voiced his support for Proposition 8, which defines marriage in California as only between a man and a woman, and said that he \"would suggest not changing the definition of marriage in our society to make a small number of people feel more comfortable.\"\n\nRohrabacher opposes the legal recognition of same-sex marriage. In both 2004 and 2006, Rohrabacher voted in favor of the Federal Marriage Amendment, a proposed amendment to the United States Constitution defining marriage as only being a legal union defined between a man and a woman. In 2013, Rohrabacher proclaimed that the Hollingsworth v. Perry  Supreme Court decision overturning Proposition 8 was \". . . not based on the merits of the issue but on a technicality\". Recently, however, Rohrabacher has appeared to endorse the idea of getting the government out of marriage, saying that churches should conduct marriages, while the government allows legal contractual partnerships between couples.\n\nMarijuana\n\nRohrabacher supports the legalization of marijuana for both medical and recreational purposes. He has spoken against the policy of cannabis prohibition as early as May 2013, calling it a \"colossal failure\" in an op-ed penned for the Orange County Register.  He further outlined his views in a May 2014 op-ed in National Review, arguing that the prohibition of cannabis has incurred a number of undesirable costs upon free society, such as an increase in gang violence, soaring incarceration rates, unconstitutional seizure of private property through civil forfeiture, corruption and militarization of police forces, and negative impacts on minority communities and relationships with Latin-American countries. Rohrabacher has called on fellow Republicans to reconsider their stance towards cannabis, citing core conservative principles such as limited government, individual liberty, respect for the Tenth Amendment, and respect for the doctor–patient relationship that Rohrabacher says lend support to loosening current laws.  He also notes conservative leaders such as Milton Friedman, William F. Buckley, and Grover Norquist that have espoused similar drug policy views.  In April 2016, Rohrabacher announced his endorsement of California's Proposition 64, the Adult Use of Marijuana Act.\n\nRohrabacher is a strong proponent of states' rights when it comes to cannabis policy. He has introduced the Rohrabacher–Farr amendment for a number of years beginning in 2003, to prohibit the Justice Department from spending funds to interfere with the implementation of state medical cannabis laws. The amendment passed the House for the first time in May 2014, becoming law in December 2014 as part of an omnibus spending bill. Additional legislation that Rohrabacher has introduced includes the Respect State Marijuana Laws Act and the Veterans Equal Access Act. Rohrabacher has called on the DEA / DOJ to remove cannabis from the list of Schedule I drugs.  In February 2017, Rohrabacher co-founded the Congressional Cannabis Caucus – along with Reps. Don Young (R–AK), Jared Polis (D–CO), and Earl Blumenauer (D–OR) – to help advance policy change regarding cannabis at the federal level.  Rohrabacher has an \"A+\" rating from NORML for his voting record regarding cannabis-related matters.\n\nPatent reform\n\nRohrabacher is an opponent of the America Invents Act, a bill that is attempting to change the current Patent System. Rohrabacher opposes changing from a \"first to invent system\" to a \"first to file system\" saying it \"hurts the little guy\". Rohrabacher commented: \"Make no mistake, 'first to file' weakens patent protection. It is likely to make vulnerable individual and small inventors, who don't have an army of lawyers on retainer. These 'little guys' have been the lifeblood of American progress and competitiveness for more than 200 years. Our system was designed to protect individual rights, and it has worked for all – not just the corporate elite.\" Rohrabacher went on to comment in a Politico op-ed: \"We're told this is necessary to harmonize with Japanese and European patent law. But those systems were established by elitists and economic shoguns interested in corporate power, not individual rights.\"\n\nSpace\n\nRohrabacher was chairman of the Subcommittee on Space and Aeronautics from 1997 to January 2005 and has been active on space-related issues. In 2000, Space.com described Rohrabacher as \"a strident advocate for supremacy in space, a philosophy shaped along a winding road from libertarian activist to White House speech writer in the Reagan administration.\" In 2007, Rohrabacher introduced a bill that would direct NASA to develop a strategy \"for deflecting and mitigating potentially hazardous near-Earth objects.\" Rohrabacher has applauded the Apollo astronauts, calling them unofficial ambassadors. Rohrabacher stated \"I applaud their efforts and accomplishments over the past fifty years. And I encourage all Americans to join with me in thanking them for their accomplishments and for the international role they have played in serving as unofficial Ambassadors to the world on our behalf.\"\n\nOn July 18, 2017, Rohrabacher asked a panel of space experts testifying before the House Committee on Science, Space, and Technology if civilizations could have existed on Mars in the past. Kenneth Farley, a project scientist on NASA’s Mars Rover 2020 Project, said: \"I would say that is extremely unlikely.\"\n\nTax reform\n\nRohrabacher voted against the Tax Cuts and Jobs Act of 2017. Despite efforts made by Republicans to change the bill to be more generous regarding cap deductions on new home mortgages, Rohrabacher remained staunch at voting nay on the bill, as the majority of half of the new mortgages in his district are above the $750,000 cap. He stated on his Facebook page that “Due to the pressure of several members like me, the bill was improved, but not enough for my constituents.\"\n\nForeign and security policy positions\n\nForeign policy\n\nIn February 2013, Rohrabacher gave a speech urging the right to self-determination for the Baloch people in Pakistan at a UNPO conference in London.\n\nIn March 2005, Rohrabacher introduced HR 1061, the American Property Claims Against Ethiopia Act, which would \"prohibit United States assistance to the Federal Democratic Republic of Ethiopia until the Ethiopian government returns all property of United States citizens.\" The bill was introduced by Rohrabacher at the behest of Gebremedhin Berhane, a former Eritrean national and friend of the Rohrabacher family, after his business was expropriated by the Ethiopian government.\n\nOn March 7, 2006, Rohrabacher introduced HR 4895, an amendment to the Foreign Assistance Act of 1961, \"to limit the provision of the United States military assistance and the sale, transfer, or licensing of United States military equipment or technology to Ethiopia.\"\n\nDuring an appearance on MSNBC's The Ed Show, Rohrabacher accused Barack Obama of allowing violence in Iran to get out of hand because he did not speak forcefully enough against the country's leadership. He also said that Gorbachev tore down the Berlin Wall because Reagan told him to (\"Tear down this wall\").[https://www.votesmart.org/speech_detail.php?sc_id476422&keyword\n&phrase&contain\n MSNBC \"The Ed Show\" Interview – Transcript] 2009-06-23\n\nIn early 2010, he went to Honduras to commend the election of the new president. His entourage included a group of Californian property investors and businessmen, a dealer in rare coins, and CEOs from San Diego biofuels corporation (which is headed by a family friend).\n\nTerrorism\n\nIn 2006, Rohrabacher chaired the Subcommittee on Oversight and Investigations of the U.S. House Committee on International Relations, which investigated whether the Oklahoma City bombers had assistance from foreign sources and determined there was no conclusive evidence of a foreign connection. In the 113th Congress, Rohrabacher is chair of the House Foreign Affairs Subcommittee on Europe, Eurasia and Emerging Threats.\n\nRohrabacher has stated that he sees Islam as the source of a major terrorist threat to the U.S. Speaking about Islam he said during a hearing in April 2013, \"I hope we all work together against a religion that will motivate people to murder children and other threats to us as a civilization.\"\n\nIn 2014, Rohrabacher suggested that Iraq's borders be redrawn in response to the establishment of the Islamic State of Iraq and the Levant.\n\nIn the wake of the 2016 Orlando nightclub shooting, Rohrabacher put out a press release stating he felt \"outrage\" and a \"renewed commitment to defeat and destroy the radical Islamic movement that fosters such mayhem.\" He stressed that Americans must \"be sure not to label all Muslims as terrorist murderers.\" Rohrabacher met Seddique Mateen, the father of the shooter, in 2014 during routine meetings with constituents. He called Mateen an \"estranged individual.\"\n\nOn June 10, 2017, during a House Foreign Affairs Committee hearing on Lebanon's Hezbollah, a day after two ISIL attacks in Tehran were carried out, Rohrabacher stated that: \n\nRohrabacher's statement was criticised in social media by British political journalist Mehdi Hasan, Human Rights Watch Deputy Director Jim Murphy, journalist Negar Mortazavi and the National Iranian American Council, among others.\n\nIn a further statement to clarify his position, he stated that he opposes \"the use of force against unarmed civilians no matter who is the victim or who is doing the killing\" but he is also against \"Iran’s vicious Mullah monarchy\" and \"when it comes to Sunni terrorists or Shiite terrorists, I prefer them to target each other rather than any other victims, especially innocent civilians and Americans.\" He added that it will \"require support for those proud Iranians who want to win their freedom and heritage from Mullahs and are willing to fight for it. That does not include Isis, but it may include a lot of Iranians who see blowing up Khomeini’s mausoleum as an expression of freedom from the yolk [sic] of Islamic terror.\"\n\nDefense of interrogation techniques and extraordinary rendition\n\nOn April 17, 2007, while defending the Bush administration's program of extraordinary rendition. During a House hearing on trans-atlantic relations, Rohrabacher stated that the unfair treatment of one innocent suspect is an acceptable \"unfortunate consequence\" of holding others who would otherwise be free to commit terror acts. After he received boos and groans from the gallery, Rohrabacher responded, \"Well, I hope it's your families, I hope it's your families that suffer the consequences\", and \"I hope it's your family members that die\". Rohrabacher was subsequently interrupted by protesters wearing orange jumpsuits who were removed from the gallery. For his comment that imprisoning and torturing one innocent person was a fair price to pay for locking up 50 terrorists who would \"go out and plant a bomb and kill 20,000 people,\" Rohrabacher was named Countdown with Keith Olbermann's \"Worst Person in the World\" on April 25.\n\nAfghanistan\n\nRohrabacher's interest in Afghanistan extends back at least to the late 1980s, before his time in office, when he entered the country in the company of mujahedin fighters who were intent on confronting Soviet occupation forces. Reportedly, these fighters \"actually engaged Soviet troops in combat near the city of Jalalabad during the two months Rohrabacher was with them.\"  In the years after the Soviet–Afghan War (1979–1989), Rohrabacher said his \"passion\" was to bring back the country's exiled king, Muhammad Zahir Shah.\n\nIn 2003, he defended the new Afghan constitution against those who saw in it mainly empowerment of warlords, saying:\n\nRohrabacher has since become a proponent of withdrawing from Afghanistan. He protested against the troop build up to Afghanistan by President Obama saying \"If the Taliban is going is be defeated, it's got to be by the Afghan people themselves, not by sending more U.S. troops, which could actually be counterproductive.\" When Congressman Jim McGovern offered an amendment earlier this year requiring the Pentagon to draw up an exit plan from Afghanistan, Rohrabacher was just one of six Republicans to sign on. Rohrabacher further voted for McGovern's Amendment to the National Defense Authorization Act, requiring an exit plan from Afghanistan. The bill failed by 204–215 margin.http://clerk.house.gov/evs/2011/roll373.xml\n\nRohrabacher is against President Obama's gradual draw down of troops supporting a full withdrawal. Saying \"If we're going to leave, we should leave.\" Rohrabacher has gone on to state \"The centralized system of government foisted upon the Afghan people is not going to hold after we leave,\" continued Rohrabacher. \"So let's quit prolonging the agony and inevitable. Karzai's regime is corrupt and non representative of Afghanistan's tribal culture. This failed strategy is not worth one more drop of American blood. Under the current strategy, our military presence alienates more Afghans that it pacifies. So if you're going to pull the plug, then we need to get the hell out now.\" Rohrabacher has repeatedly raised high-level concerns in the US Congress and Washington, D.C., about the significant corruption in Afghanistan, including the Kabul Bank scandal where hundreds of millions of U.S. taxpayers' dollars allegedly disappeared in a short period of time at the apparent hands of close Karzai family members, including brothers Mahmoud Karzai (a.k.a. Mahmood Karzai), Ahmed Wali Karzai and others.  Rohrabacher worked to bring attention to the systemic corruption in the Karzai government and cut U.S. taxpayers' funding for these wasteful projects and programs, involving corruption within the Hamid Karzai government.\n\nIn April 2012, CNN reported that \"A top Republican on the House Foreign Affairs committee was asked by the State Department not to go to Afghanistan because President Hamid Karzai objected to the visit. ... Dana Rohrabacher, R-California, told Security Clearance he was readying to travel with five other Republicans from Dubai to Afghanistan's capital, Kabul, when the State Department requested he stay behind.\"\n\nBosnia and Kosovo independence\n\nRohrabacher was opposed to American ground troops in the Yugoslav Wars. He advocated for the direct bombing of the military on Yugoslav soil, criticizing the ineffectiveness of western forces against the Bosnian Serbs, NATO was limited to small fixed attacks, as these Serbs penetrated UN safe areas and attacked Bosniak forces. Rohrabacher said they \"should bomb Serbia's military infrastructure, in Serbia – get that, in Serbia – rather than dropping a couple of duds on tents, which only proves the West's gutlessness, and emboldens Serbian cutthroats.\" Rohrabacher considered the events in Bosnia to constitute genocide. In 1995, Rohrabacher personally visited Sarajevo in Bosnia, criticizing the devastation Serb forces inflicted on the city, saying \"This is a loss to all mankind, not just to the people of Sarajevo,\". He also encountered vagabond children asking for money.\n\nThe leader of the Albanian American Civic League ethnic lobby group, Joseph J. DioGuardi, praised Rohrabacher for his support to the Kosovo Liberation Army (KLA), saying \"He was the first member of Congress to insist that the United States arm the Kosova Liberation Army, and one of the few members who to this day publicly supports the independence of Kosova.\" Rohrabacher gave a speech in support of American equipping the KLA with weaponry, comparing it to French support of America in the Revolutionary War, saying \"Based on our own experience, the Kosova Liberation Army should have been armed. ... If the U.S. had armed the KLA in 1998, we would not be where we are today. The 'freedom fighters' would have secured their freedom and Kosova would be independent.\"\n\nOrgan harvesting in China\n\nIn 2012 Rohrabacher stated,\nand \n\nIraq War\n\nRohrabacher voted in support of the Authorization for the Use of Military Force Against Iraq in 2002, a position that he later admitted was \"a mistake.\"\n\nIran\n\nIn August 2012, Rohrabacher noted on his official website that he had written a letter addressed to the U.S. State Department, noting his support of U.S. sponsorship of separatist movements in Iran. This elicited criticism from the Iranian-American community, which included challenging Rohrabacher's understanding of the historical background alluded to in his letter to the Department of State.http://iranianfacebook.com/2012/08/27/congressman-dana-rohrabacher-embarrasses-himself-by-calling-for-a-separatist-movement-in-iran-based-on-a-flawed-historical-understaning/\n\nIn June 2017, a day after ISIL attack in Tehran, during a House Foreign Affairs Committee hearing, Rohrabacher stated: \"Isn’t it a good thing for us to have the United States finally backing up Sunnis who will attack Hezbollah and the Shiite threat to us, isn’t that a good thing?\" This comment was strongly criticized by the National Iranian American Council, which wrote, \"Rohrabacher has a long history of bizarre and offensive statements on Iran, but his callousness toward the Iranian victims of ISIS terror might be his most callous and extreme thus far.\"\n\nAid to Pakistan\n\nIn May 2011, in the wake of Osama Bin Laden's death, Rohrabacher introduced a bill to stop aid to Pakistan, stating that members of the government and of Pakistan's security force, the ISI, were either sheltering Bin Laden or completely incompetent. \"We can no longer afford this foolishness. ... The time has come for us to stop subsidizing those who actively oppose us. Pakistan has shown itself not to be America's ally.\" Rohrabacher also demanded the return of the US helicopter that crashed in the operation to kill Bin Laden, stating \"If this is not done immediately, it is probable, given Pakistan’s history, that our technology has already found its way into the hands of the Communist Chinese military that is buying, building, and stealing the necessary military technology to challenge the United States.\" \n\nSupport for Mohiuddin Ahmed\n\nIn 2007, Rohrabacher supported Mohiuddin Ahmed, a detainee in the U.S., who was said to be involved in an attempted coup in Bangladesh, during which several people were murdered. He was convicted of the assassination of Sheikh Mujibur Rahman, the first President of Bangladesh. Bangladesh's extradition request was halted as Rohrabacher voiced concern about his legal rights, saying that he should be sent somewhere with no death penalty. His support was applauded by both Amnesty International and the U.S. Conference of Catholic Bishops.[https://news.google.com/archivesearch?qBut+time+is+running+out.+Ahmed+was+to+have+left+the+country+Monday+night%2C+but+Rep.+Dana+Rohrabacher+%28R-Huntington+Beach%29+called+Homeland+Security+Secretary+Michael+Chertoff%E2%80%99s+office+and+requested+a+delay+%22And+because+of+that%2C+Dana+felt+as+though+there+would+be+no+harm+in+trying+to+buy+some+time+for+his+legal+counsel+to+find+a+country%22+where+he+would+not+be+put+to+death.&ie\nUTF-8&oeUTF-8&scoring\na] [https://news.google.com/archivesearch?q%22Amnesty+International+and+our+State+Department+has+questioned+the+integrity+of+the+Bangladeshi+judicial+system%2C%22+said+Tara+Setmayer%2C+a+spokeswoman+for+Rohrabacher&btnG\nSearch+Archives&ieUTF-8&oe\nUTF-8&scoringa] [https://news.google.com/archivesearch?q\n%22And+because+of+that%2C+Dana+felt+as+though+there+would+be+no+harm+in+trying+to+buy+some+time+for+his+legal+counsel+to+find+a+country%22+where+he+would+not+be+put+to+death.&btnGSearch+Archives&ie\nUTF-8&oeUTF-8&scoring\na] [https://news.google.com/archivesearch?q%22Given+the+circumstances%2C+he+said+he%E2%80%99d+be+willing+to+place+a+phone+call+or+two+to+buy+some+time+and+figure+things+out%2C%22+she+said.&btnG\nSearch+Archives&ieUTF-8&oe\nUTF-8&scoring=a] [http://www.docstrangelove.com/2007/04/03/dana-rohrabachers-hypocrisy-of-terror/]\n\nRussia\n\nOn September 8, 2008, at a House of Representatives Foreign Affairs Committee meeting, Rohrabacher argued that the Georgians had initiated the recent military confrontation in the ongoing Russia–Georgia war.\n\nIn April 2014, he supported the idea of Alaskans rejoining Russia if a majority voters in Alaska wanted to.\n\nAccording to a 2015 article by Politico reporter Luke O'Brien, Rohrabacher is known for his long-time friendship with Russia's Vladimir Putin and his defense of \"the Russian point of view.\"See Luke O'Brien, \"Putin's Washington\" [http://www.politico.com/magazine/story/2015/01/putins-washington-113894.html#ixzz3O6keOMJp Politico Jan–Feb. 2015] On June 15, 2016, Republican congressman Kevin McCarthy told a group of Republicans, \"There's two people I think Putin pays: Rohrabacher and Trump. Swear to God.\" Paul Ryan ended the conversation, saying \"No leaks. This is how we know we're a real family here.\"\n\nIt was not reported for another year that around that time, Rohrabacher had planned, in his capacity as chair of the Europe subcommittee, to hold a hearing on the Magnitsky Act, which bars certain Russian officials from entering the United States or holding any financial assets in American banks. At the hearing Bill Browder, the American-born investor who had lobbied for the act's passage after what he claims was the illegal appropriation of his hedge fund's assets and the subsequent murder of his Russian lawyer Sergei Magnitsky after he discovered this, was to testify. Rohrabacher planned to subject him to what was described as a \"show trial\", where in addition to questioning Browder closely and skeptically about his claims, a feature-length documentary film critical of the Magnitsky claims directed by Andrei Nekrasov was to be shown in its entirety. Among the other witnesses scheduled to testify were Russian lawyer Natalia Veselnitskaya, a longtime lobbyist against the Magnitsky Act who had around the same time attended a meeting with Donald Trump Jr, Jared Kushner and Trump's then-campaign manager Paul Manafort at which the Russians purportedly offered to share negative information about Hillary Clinton, Trump's opponent in that year's election.\n\nWhen Foreign Affairs Committee chairman Ed Royce learned of the plans, he canceled the hearing and forbade Rohrabacher from showing the film. In its stead, he held a full committee hearing on U.S.-Russia relations at which Rohrabacher was allowed to submit some of the pro-Russian claims into evidence. The film was ultimately shown at the Newseum, and an intern in Rohrabacher's office who later worked for the Trump transition team sent emails promoting the film from the subcommittee offices.\n\nAfter Donald Trump won the 2016 presidential election, Rohrabacher defends his approach to improve Russian–American relations. He had previously met at least twice to discuss Russian sanctions with Rinat Akhmetshin, a former Soviet spy, who was later revealed to be present at the June 2016 meeting.\n\nIn a May 2017 interview with CNN, Rohrabacher said, \"We have a huge double standard with Russia when it comes to prisoners and other things,\" and further stated that interference by the Russian intelligence services' in the 2016 U.S. election was the same as the NSA bugging German Chancellor Angela Merkel's phone.\n\nIn October 2017, the House Committee on Foreign Affairs placed restrictions on Rohrabacher's ability to use committee money to pay for foreign travel due to concerns over his interest in Russia.\n\nTaiwan\n\nAfter President-elect Donald Trump answered a congratulatory phone call from democratically elected President of Taiwan Tsai Ing-wen on December 2, 2016,[https://www.wsj.com/articles/donald-trump-spoke-with-taiwan-president-tsai-ing-wen-1480718423 Trump Spoke With Taiwan President in Break With Decades of U.S. Policy: Leaders ‘noted close’ economic, political and security ties, Trump transition team said], The Wall Street Journal, 2016-12-2[http://www.nydailynews.com/opinion/trump-phone-call-taiwan-president-major-breakthrough-article-1.2896742 President-elect Donald Trump's phone call to Taiwan's leader is a major breakthrough for U.S. relations with the nation], New York Daily News, 2016-12-2[http://www.foxnews.com/opinion/2016/12/04/why-trump-was-right-to-talk-with-taiwans-president.html Why Trump was right to talk with Taiwan's president], Fox news, 2016-12-4[http://www.chicagotribune.com/news/opinion/commentary/ct-trump-taiwan-call-china-20161205-story.html Trump's Taiwan call wasn't a mistake. It was brilliant.], Chicago Tribune, 2016-12-5 Rohrabacher said Trump's phone call with Taiwan's president was \"terrific\" because of the diplomatic warning it sent to China. \"He showed the dictators in Beijing that he's not a pushover.\" He emphasized, \"China has had an enormously aggressive foreign policy and by him actually going to Taiwan, he's showing the people in Beijing that they cannot have this aggressive foreign policy and expect to be treated just the same by an American president.\"[http://www.politico.com/story/2016/12/dana-rohrabacher-trump-taiwan-232188 Rohrabacher: Trump's Taiwan call shows China he's not a pushover], Politico, 2016-12-5\n\nUkraine\n\nRohrabacher gave a \"qualified defense\" of the annexation of Crimea by Russia in 2014. On March 6, 2014, he was one of 23 members of the House of Representatives to vote against a $1 billion loan guarantee to support the new government of Ukraine. In the March 11, 2014, House of Representatives vote (402 voting yes; 7 opposed) to condemn Russia for violating Ukraine's sovereignty, Rohrabacher voted \"present.\" Commenting on the issue, he stated, \"Starting with our own American Revolution, groups of people have declared themselves, rightfully, to be under a different government or a government of their choosing. People forget that’s what our Declaration of Independence is all about.\" He also said, \"The sanctions are an abomination of hypocrisy. This is ridiculous: What we were doing with the violence and military action we took to secure the Kosovars' right to self-determination was far more destructive and had far more loss of life than what Putin's done trying to ensure the people of Crimea are not cut off from what they would choose as their destiny with Russia.\"\n\nUzbekistan\n\nDuring a US Congressional delegation's visit to Uzbekistan in February 2013, Rohrabacher made several controversial statements. The chief among those statements was that the United States should treat Uzbekistan like Saudi Arabia by disregarding the former's human rights abuses in achieving America's national interests, particularly in selling armaments and drones to Uzbekistan.\n\nMacedonia\n\nIn 2017, in an interview for an Albanian TV channel Vizion Plus Rohrabacher suggested that the Republic of Macedonia \"is not a country\" and that the \"Kosovars and Albanians from Macedonia should be part of Kosovo and the rest of Macedonia should be part of Bulgaria or any other country to which they believe they are related\", which provoked a response from the Macedonian foreign ministry which accused him of inflaming \"nationalistic rhetoric\".\n\nTurkey \n\nIn the wake of the clashes at the Turkish Ambassador's Residence in May 2017,  Rohrabacher called Donald Trump to never invite Turkish President Recep Tayyip Erdoğan again to the United States, and to bar Americans from purchasing Turkish government debt.\n\nEritrea \n\nIn August 2017, Rohrabacher proposed amending the Department of Defense budget whereby the United States would establish military ties with Eritrea. Rohrabacher suggested that the two countries should cooperate in fighting the War on Terror, curbing Iranian influence in the Yemeni Civil War, and securing the Red Sea region. At the time of Rohrabacher's proposal, Eritrea was subject to international sanctions due to its alleged support of Al-Shabaab in Somalia, and to U.S. sanctions against the Eritrean Navy following an alleged shipment of North Korean military hardware to Eritrea.\n\nPersonal life\n\nRohrabacher has been married to his wife, Rhonda, since 1997. In 2004, they became parents of triplets.\n\nRohrabacher said he paid his wife about $50,000 a year from donation money to operate his 2012 reelection campaign.\n\nRohrabacher was described by the Los Angeles Times as \"an avid surfer.\"\nHe also sings, plays guitar, and has written his own song about freedom and America.\n\nRohrabacher revealed in May 2016 that he uses a cannabis-infused topical rub to treat the arthritis pain that he suffers from, allowing him to sleep through the night. The product is legal under California state law but remains a banned substance under U.S. federal law. Dana Rohrabacher. http://en.wikipedia.org/?curid=8953."
  }
}
