{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1417",
  "eid" : "b9cd2b00-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778391472,
  "textBody" : "Events\n\n*29 BC – Octavian holds the second of three consecutive triumphs in Rome to celebrate the victory over the Dalmatian tribes.\n*1040 – King Duncan I is killed in battle against his first cousin and rival Macbeth. The latter succeeds him as King of Scotland.\n*1183 – Taira no Munemori and the Taira clan take the young Emperor Antoku and the three sacred treasures and flee to western Japan to escape pursuit by the Minamoto clan (traditional Japanese date: Twenty-fifth Day of the Seventh Month of the Second Year of Juei).\n*1288 – Count Adolf VIII of Berg grants town privileges to Düsseldorf, the village on the banks of the Düssel.\n*1352 – War of the Breton Succession: Anglo-Bretons defeat the French in the Battle of Mauron.\n*1370 – Charles IV, Holy Roman Emperor, grants city privileges to Carlsbad which is subsequently named after him.\n*1385 – Portuguese Crisis of 1383–85: Battle of Aljubarrota: Portuguese forces commanded by King John I and his general Nuno Álvares Pereira defeat the Castilian army of King John I.\n*1457 – Publication of the Mainz Psalter, the first book to feature a printed date of publication and printed colophon\n*1480 – Battle of Otranto: Ottoman troops behead 800 Christians for refusing to convert to Islam; they are later honored in the Church.\n*1592 – The first sighting of the Falkland Islands by John Davis.\n*1598 – Nine Years' War: Battle of the Yellow Ford: Irish forces under Hugh O'Neill, Earl of Tyrone, defeats an English expeditionary force under Henry Bagenal.\n*1720 – The Spanish military Villasur expedition is wiped out by Pawnee and Otoe warriors near present-day Columbus, Nebraska.\n*1791 – Slaves from plantations in Saint-Domingue hold a Vodou ceremony lead by houngan Dutty Boukman at Bois Caïman, marking the start of the Haitian Revolution.\n*1814 –  A cease fire agreement, called the Convention of Moss, ended the Swedish–Norwegian War.\n*1816 – The United Kingdom formally annexes the Tristan da Cunha archipelago, administering the islands from the Cape Colony in South Africa.\n*1842 – American Indian Wars: Second Seminole War ends, with the Seminoles forced from Florida to Oklahoma.\n*1848 – Oregon Territory is organized by act of Congress.\n*1880 – Construction of Cologne Cathedral, the most famous landmark in Cologne, Germany, is completed.\n*1885 – Japan's first patent is issued to the inventor of a rust-proof paint.\n*1888 – An audio recording of English composer Arthur Sullivan's \"The Lost Chord\", one of the first recordings of music ever made, is played during a press conference introducing Thomas Edison's phonograph in London, England.\n*1893 – France becomes the first country to introduce motor vehicle registration.\n*1900 – The Eight-Nation Alliance occupies Beijing, China, in a campaign to end the bloody Boxer Rebellion in China.\n*1901 – The first claimed powered flight, by Gustave Whitehead in his Number 21.\n*1911 – United States Senate leaders agree to rotate the office of President pro tempore of the Senate among leading candidates to fill the vacancy left by William P. Frye's death.\n*1912 – U.S. Marines invade Nicaragua to support the U.S.-backed government installed there after José Santos Zelaya had resigned three years earlier.\n*1914 – World War I: Start of the Battle of Lorraine, an unsuccessful French offensive designed to recover the lost province of Moselle from Germany.\n*1916 – Romania declares war on Austria-Hungary.\n*1921 – Tannu Uriankhai, later Tuvan People's Republic is established as a completely independent country (which is supported by Soviet Russia).\n*1933 – Loggers cause a forest fire in the Coast Range of Oregon, later known as the first forest fire of the Tillamook Burn; it is not fully extinguished until September 5, after destroying .\n*1935 – Franklin D. Roosevelt signs the Social Security Act, creating a government pension system for the retired.\n*1936 – Rainey Bethea is hanged in Owensboro, Kentucky in the last known public execution in the United States.\n*1937 – The beginning of air-to-air combat of the Second Sino-Japanese War and World War II in general, when six Japanese bombers are shot down by Chinese fighters while raiding Chinese air bases.\n*1941 – World War II: Winston Churchill and Franklin D. Roosevelt sign the Atlantic Charter of war stating postwar aims.\n*1945 – Japan accepts the Allied terms of surrender in World War II and the Emperor records the Imperial Rescript on Surrender (August 15 in Japan Standard Time).\n*  1945   – The Viet Minh launches August Revolution amid the political confusion and power vacuum engulfing Vietnam.\n*1947 – Pakistan gains Independence from the British Empire and joins the Commonwealth of Nations.\n*1959 – Founding and first official meeting of the American Football League.\n*1967 – UK Marine Broadcasting Offences Act declares participation in offshore pirate radio illegal.\n*1969 – Operation Banner: British troops are deployed in Northern Ireland.\n*1971 – Bahrain declares independence as the State of Bahrain.\n*1972 – An Ilyushin Il-62 airliner crashes near Königs Wusterhausen, East Germany, due to an in-flight fire, killing 156.\n*1973 – The Pakistan Constitution of 1973 comes into effect.\n*1975 – The Rocky Horror Picture Show, the longest-running release in film history, opens in London.\n*1980 – Lech Wałęsa leads strikes at the Gdańsk, Poland shipyards.\n*1994 – Ilich Ramírez Sánchez, also known as \"Carlos the Jackal\", is captured.\n*1996 – Greek Cypriot refugee Solomos Solomou is murdered by Turkish forces while trying to climb a flagpole in order to remove a Turkish flag from its mast in the United Nations Buffer Zone in Cyprus.\n*2003 – A widescale power blackout affects the northeast United States and Canada.\n*2003– Project Thread, an operation launched by CSIS and other Canadian law enforcement agencies, saw the arrest and incarceration of 24 innocent Muslim men, most of them young Pakistani students.\n*2005 – Helios Airways Flight 522, en route from Larnaca, Cyprus to Prague, Czech Republic via Athens, crashes in the hills near Grammatiko, Greece, killing 121 passengers and crew.\n*2006 – Sixty-one schoolgirls killed in Chencholai bombing by Sri Lankan Air Force air strike.\n*2007 – The Kahtaniya bombings kills at least 334 people.\n*2013 – Egypt declares a state of emergency as security forces kill hundreds of demonstrators supporting former president Mohamed Morsi.\n*2015 – The US Embassy in Havana, Cuba re-opens after 54 years of being closed when Cuba–United States relations were broken off.\n\nBirths\n\n* 928 – Qian Hongzuo, king of Wuyue (d. 947)\n*1297 – Emperor Hanazono of Japan (d. 1348)\n*1473 – Margaret Pole, Countess of Salisbury (d. 1541)\n*1479 – Catherine of York (d. 1527)\n*1499 – John de Vere, 14th Earl of Oxford, English politician, Lord Great Chamberlain (d. 1526)\n*1502 – Pieter Coecke van Aelst, Flemish painter (d. 1550)\n*1530 – Giambattista Benedetti, Italian mathematician and physicist (d. 1590)\n*1552 – Paolo Sarpi, Italian writer (d. 1623)\n*1561 – Christopher Heydon, English politician (d. 1623)\n*1575 – Robert Hayman, English-Canadian poet and politician (d. 1629)\n*1586 – William Hutchinson, founder of Rhode Island (d. 1642)\n*1599 – Méric Casaubon, Swiss-English scholar and author (d. 1671)\n*1625 – François de Harlay de Champvallon, French archbishop (d. 1695)\n*1642 – Cosimo III de' Medici, Grand Duke of Tuscany (d. 1723)\n*1645 – Carlos de Sigüenza y Góngora, Mexican secular priest, scientist, and savant (d. 1700)\n*1653 – Christopher Monck, 2nd Duke of Albemarle, English colonel and politician, Lieutenant Governor of Jamaica (d. 1688)\n*1688 – Frederick William I of Prussia (d. 1740)\n*1714 – Claude Joseph Vernet, French painter (d. 1789)\n*1738 – Leopold Hofmann, Austrian composer and conductor (d. 1793)\n*1740 – Pope Pius VII (d. 1823)\n*1758 – Carle Vernet, French painter and lithographer (d. 1835)\n*1777 – Hans Christian Ørsted, Danish physicist and chemist (d. 1851)\n*1817 – Alexander H. Bailey, American lawyer, judge, and politician (d. 1874)\n*1840 – Richard von Krafft-Ebing, German-Austrian psychologist and author (d. 1902)\n*1847 – Robert Comtesse, Swiss lawyer and politician, President of the Swiss National Council (d. 1922)\n*1848 – Margaret Lindsay Huggins, Anglo-Irish astronomer and author (d. 1915)\n*1851 – Yannoulis Chalepas, Greek sculptor (d. 1938)\n*  1851   – Doc Holliday, American dentist and gambler (d. 1887)\n*1857 – Max Wagenknecht, German organist, composer, and educator (d. 1922)\n*1863 – Ernest Thayer, American poet and author (d. 1940)\n*1865 – Guido Castelnuovo, Italian mathematician and academic (d. 1952)\n*1866 – Charles Jean de la Vallée-Poussin, Belgian mathematician and academic (d. 1962)\n*1867 – Cupid Childs, American baseball player (d. 1912)\n*1867 – John Galsworthy,  English novelist and playwright, Nobel Prize laureate (d. 1933)\n*1870 – Nelson McDowell, American actor (d. 1947)\n*1871 – Guangxu Emperor of China (d. 1908)\n*1875 – Mstislav Dobuzhinsky, Russian-Lithuanian-American painter and illustrator (d. 1957)\n*1876 – Alexander I of Serbia (d. 1903)\n*1880 – Fred Alexander, American tennis player (d. 1969)\n*1881 – Francis Ford, American actor, director, producer, and screenwriter (d. 1953)\n*1886 – Arthur Jeffrey Dempster, Canadian-American physicist and academic (d. 1950)\n*1887 – Marija Leiko, Latvian actress (d. 1937)\n*1889 – Otto Tief, Estonian lawyer and politician, Prime Minister of Estoria (d. 1976)\n*1890 – Bruno Tesch, German chemist and businessman (d. 1946)\n*1892 – Kaikhosru Shapurji Sorabji, English pianist, composer, and critic (d. 1988)\n*1893 – Francis Dvornik, Czech priest and academic (d. 1975)\n*1895 – Jack Gregory, Australian cricketer (d. 1973)\n*1896 – Albert Ball, English fighter pilot (d. 1917)\n*  1896   – Theodor Luts, Estonian director and cinematographer (d. 1980)\n*1900 – Margret Boveri, German journalist, recipient of the Order of Merit of the Federal Republic of Germany (d. 1975)\n*1901 – Alice Rivaz, Swiss pianist and author (d. 1998)\n*1903 – Lodewijk Bruckman, Dutch painter and illustrator (d. 1995)\n*1907 – Skinnay Ennis, American bandleader and singer (d. 1963) \n*1910 – Willy Ronis, French photographer (d. 2009)\n*  1910   – Pierre Schaeffer, French composer and producer (d. 1995)\n*1911 – Jan Koetsier, Dutch composer and conductor (d. 2006)\n*  1911   – Vethathiri Maharishi, Indian spiritual leader, philosopher, and author (d. 2006)\n*1912 – Frank Oppenheimer, American physicist and academic (d. 1985)\n*1913 – Hector Crawford, Australian director and producer (d. 1991)\n*  1913   – Paul Dean, American baseball player (d. 1981)\n*1914 – Herman Branson, African-American physicist, chemist, and academic (d. 1995)\n*1915 – B. A. Santamaria, Australian political activist and publisher (d. 1998)\n*1916 – Frank and John Craighead, American naturalists (twins, Frank d. 2001, John d. 2016)\n*  1916   – Fumio Fujimura, Japanese baseball player and manager (d. 1992)\n*  1916   – Wellington Mara, American businessman (d. 2005)\n*1918 – Patsy Smart, English actress (d. 1996)\n*1922 – Leslie Marr, English race car driver\n*1923 – Patriarch Diodoros of Jerusalem (d. 2000)\n*  1923   – Alice Ghostley, American actress (d. 2007)\n*1924 – Sverre Fehn, Norwegian architect, designed the Hedmark Museum (d. 2009)\n*  1924   – Holger Juul Hansen, Danish actor (d. 2013)\n*  1924   – Georges Prêtre, French conductor (d. 2017)\n*  1924   – Rangjung Rigpe Dorje, 16th Karmapa, Tibetan spiritual leader (d. 1981)\n*1925 – Russell Baker, American critic and essayist\n*1926 – René Goscinny, French author and illustrator (d. 1977)\n*  1926   – Buddy Greco, American singer and pianist (d. 2017)\n*1928 – Lina Wertmüller, Italian director and screenwriter\n*1929 – Kinnaird R. McKee, American admiral (d. 2013)\n*  1929   – Gene Scott, American pastor and broadcaster (d. 2005)\n*  1929   – Dick Tiger, Nigerian boxer (d. 1971)\n*1930 – Earl Weaver, American baseball player and manager (d. 2013)\n*1931 – Frederic Raphael, American journalist, author, and screenwriter\n*1932 – Lee Hoffman, American author (d. 2007)\n*1933 – Richard R. Ernst, Swiss chemist and academic, Nobel Prize laureate\n*1935 – John Brodie, American football player and golfer\n*1940 – Darrell \"Dash\" Crofts, American singer-songwriter and musician \n*  1940   – Galen Hall, American football player and coach\n*1941 – David Crosby, American singer-songwriter and guitarist \n*  1941   – Connie Smith, American country music singer-songwriter and guitarist\n*  1941   – Ernest Everett Just, African-American biologist and academic (d. 1941)\n*1942 – Willie Dunn, Canadian singer-songwriter and producer (d. 2013)\n*  1942   – Lionel Morton, English singer-songwriter, guitarist and television presenter\n*1943 – Ronnie Campbell, English miner and politician\n*  1943   – Ben Sidran, American jazz and rock keyboardist, producer, label owner, and music writer\n*1944 – John Dunt, English admiral\n*1945 – Steve Martin, American actor, comedian, musician, producer, and screenwriter\n*  1945   – Wim Wenders, German director, producer, and screenwriter\n*1946 – Larry Graham, American soul/funk bass player and singer-songwriter\n*  1946   – Susan Saint James, American actress \n*  1946   – Tom Walkinshaw, Scottish race car driver and businessman (d. 2010)\n*1947 – Bruce Nash, American director, producer, and screenwriter\n*  1947   – Maddy Prior, English folk singer \n*  1947   – Danielle Steel, American author\n*  1947   – Jiro Taniguchi, Japanese author and illustrator\n*  1947   – Joop van Daele, Dutch footballer and manager\n*1948 – Terry Adams, American pianist and composer \n*  1948   – Bruce Thomas, English bass player and author\n*1949 – Morten Olsen, Danish footballer and coach\n*1950 – Gary Larson, American cartoonist\n*1951 – Slim Dunlap, American singer-songwriter and guitarist \n*  1951   – Norbert Hofmann, German footballer and manager\n*1952 – Debbie Meyer, American swimmer\n*1953 – James Horner, American composer and conductor (d. 2015)\n*1954 – Mark Fidrych, American baseball player and sportscaster (d. 2009)\n*  1954   – Stanley A. McChrystal, American general\n*1956 – Sharon Bryant, American R&B singer \n*  1956   – Jackée Harry, American actress and television personality\n*  1956   – Andy King, English footballer and manager (d. 2015)\n*  1956   – Rusty Wallace, American race car driver and sportscaster\n*  1956   – Erica Flapan, American mathematician\n*1957 – Peter Costello, Australian lawyer and politician, 35th Treasurer of Australia\n*1958 – Philip Dunne, English farmer and politician, Minister for Defence Equipment, Support and Technology\n*  1958   – Bobby Eaton, American wrestler and trainer\n*1959 – Frank Brickowski, American basketball player\n*  1959   – Marcia Gay Harden, American actress\n*  1959   – Magic Johnson, American basketball player and coach\n*1960 – Sarah Brightman, English singer-songwriter and actress\n*  1960   – Fred Roberts, American basketball player and educator\n*1961 – Eddie Gilbert, American wrestler and manager (d. 1995)\n*1962 – Mark Gubicza, American baseball player and sportscaster\n*  1962   – Kevin Harris, Canadian skateboarder \n*  1962   – Andres Herkel, Estonian academic and politician\n*  1962   – Rameez Raja, Pakistani cricketer and sportscaster\n*1963 – Emmanuelle Béart, French actress \n*  1963   – José Cóceres, Argentinian golfer\n*1964 – Neal Anderson, American football player and coach\n*  1964   – Jason Dunstall, Australian footballer and sportscaster\n*1965 – Brannon Braga, American producer, director, and screenwriter\n*  1965   – Paul Broadhurst, English golfer\n*  1965   – Terry Richardson, American photographer and director\n*1966 – Halle Berry, American model, actress, and producer, Miss World United States 1986\n*  1966   – Karl Petter Løken, Swedish-Norwegian footballer and sportscaster\n*  1966   – Tuncay Özkan, Turkish journalist and politician\n*1967 – Erik Gandini, Italian-Swedish director, producer, and screenwriter\n*1968 – Pravin Amre, Indian cricketer and coach\n*  1968   – Catherine Bell, English-American actress and producer\n*  1968   – Darren Clarke, Northern Irish golfer\n*  1968   – Jason Leonard, English rugby player\n*  1968   – Medy van der Laan, Dutch politician\n*1969 – Tracy Caldwell Dyson, American chemist and astronaut\n*  1969   – Stig Tøfting, Danish footballer and manager\n*1970 – Kevin Cadogan, American rock singer-songwriter, guitarist, and producer  (Third Eye Blind)\n*1971 – Raoul Bova, Italian actor, producer, and screenwriter\n*  1971   – Mark Loretta, American baseball player and coach\n*  1971   – Pramodya Wickramasinghe, Sri Lankan cricketer\n*1972 – Tamer El Said, Egyptian director, producer, and screenwriter\n*  1972   – Laurent Lamothe, Haitian businessman and politician, 15th Prime Minister of Haiti\n*1973 – Jared Borgetti, Mexican footballer\n*  1973   – Jay-Jay Okocha, Nigerian footballer\n*  1973   – Kieren Perkins, Australian swimmer and sportscaster\n*  1973   – Paddy McGuinness, English comedian and television presenter\n*1974 – Chucky Atkins, American basketball player and coach\n*1975 – Mike Vrabel, American football player and coach\n*1976 – Fabrizio Donato, Italian triple jumper\n*1977 – Ed Harcourt, English singer-songwriter and producer\n*  1977   – Juan Pierre, American baseball player\n*1978 – Randika Galhenage, Sri Lankan cricketer\n*  1978   – Anastasios Kyriakos, Greek footballer\n*  1978   – Greg Rawlinson, South African-New Zealand rugby player\n*1979 – Jérémie Bréchet, French footballer\n*  1979   – Paul Burgess, Australian pole vaulter\n*  1979   – Yōichirō Morikawa, Japanese actor, director, and screenwriter\n*1980 – Aydın Toscalı, Turkish footballer\n*  1980   – Roy Williams, American football player\n*1981 – Earl Barron, American basketball player\n*  1981   – Matthew Etherington, English footballer\n*  1981   – Paul Gallen, Australian rugby league player\n*  1981   – Julius Jones, American football player\n*  1981   – Kofi Kingston, Ghanaian-American wrestler\n*1982 – Simon Andrews, English motorcycle racer (d. 2014)\n*1983 – Elena Baltacha, Ukrainian-Scottish tennis player (d. 2014)\n*  1983   – Mila Kunis, Ukrainian-born American actress\n*  1983   – Juan Oviedo, Dominican baseball player\n*  1983   – Spencer Pratt, American television personality\n*  1984   – Eva Birnerová, Czech tennis player\n*  1984   – Clay Buchholz, American baseball player\n*  1984   – Giorgio Chiellini, Italian footballer\n*  1984   – Josh Gorges, Canadian ice hockey player\n*  1984   – Nick Grimshaw, English radio and television host\n*  1984   – Nicola Slater, Scottish tennis player\n*  1984   – Robin Söderling, Swedish tennis player\n*1985 – Christian Gentner, German footballer\n*  1985   – Shea Weber, Canadian ice hockey player\n*1986 – Cameron Jerome, English footballer\n*  1986   – Sam Moa, Tongan-New Zealand rugby league player\n*  1986   – Braian Rodríguez, Uruguayan footballer\n*1987 – Tim Tebow, American football and baseball player, television personality and sportscaster\n*1989 – Florian Abel, German footballer\n*  1989   – Ander Herrera, Spanish footballer \n*  1989   – Kyle Turris, Canadian ice hockey player\n*1991 – Richard Freitag, German ski jumper\n\nDeaths\n\n* 582 – Tiberius II Constantine, Byzantine emperor (b. 535)\n* 902 – Badr al-Mu'tadidi, commander-in-chief of the Abbasid Caliphate under al-Mu'tadid\n*1040 – Duncan I of Scotland (b. 1001)\n*1167 – Rainald of Dassel, Italian archbishop (b. 1120)\n*1204 – Minamoto no Yoriie, Japanese shogun (b. 1182)\n*1297 – Frederick III, Burgrave of Nuremberg (b. c. 1220)\n*1319 – Waldemar, Margrave of Brandenburg-Stendal (b. c. 1280)\n*1388 – James Douglas, 2nd Earl of Douglas \n*1390 – John FitzAlan, 2nd Baron Arundel, English soldier (b. 1364)\n*1433 – John I of Portugal (b. 1357)\n*1464 – Pope Pius II (b. 1405)\n*1573 – Saitō Tatsuoki, Japanese daimyo (b. 1548)\n*1657 – Giovanni Paolo Lascaris, 57th Grandmaster of the Knights Hospitaller (b. 1560)\n*1691 – Richard Talbot, 1st Earl of Tyrconnell, Irish soldier and politician, Lord Lieutenant of Ireland (b. 1630)\n*1727 – William Croft, English organist and composer (b. 1678)\n*1774 – Johann Jakob Reiske, German physician and scholar (b. 1716)\n*1784 – Nathaniel Hone the Elder, Irish-born English painter and academic (b. 1718)\n*1856 – Constant Prévost, French geologist and academic (b. 1787)\n*1860 – André Marie Constant Duméril, French zoologist and entomologist (b. 1774)\n*1870 – David Farragut, American admiral (b. 1801)\n*1874 – Jonathan Clarkson Gibbs, American minister and politician (b. 1821)\n*1890 – Michael J. McGivney, American priest, founded the Knights of Columbus (b. 1852)\n*1905 – Simeon Solomon, English soldier and painter (b. 1840)\n*1909 – William Stanley, American engineer and philanthropist (b. 1829)\n*1926 – John H. Moffitt, American sergeant and politician, Medal of Honor recipient (b. 1843)\n*1928 – Klabund, German author and poet (b. 1890)\n*1938 – Hugh Trumble, Australian cricketer and accountant (b. 1876)\n*1941 – Maximilian Kolbe, Polish martyr and saint (b. 1894)\n*  1941   – Paul Sabatier, French chemist and academic, Nobel Prize laureate (b. 1854)\n*1943 – Lore Berger, Swiss author and translator (b. 1921)\n*  1943   – Joe Kelley, American baseball player and manager (b. 1871)\n*1951 – William Randolph Hearst, American publisher and politician, founded the Hearst Corporation (b. 1863)\n*1954 – Hugo Eckener, German pilot and designer (b. 1868)\n*  1954   – Nikos Ploumpidis, Greek activist (b. 1901)\n*1955 – Herbert Putnam, American lawyer and publisher, Librarian of Congress (b. 1861)\n*1956 – Bertolt Brecht, German poet, playwright, and director (b. 1898)\n*1958 – Frédéric Joliot-Curie, French physicist and chemist, Nobel Prize laureate (b. 1900)\n*  1958   – Konstantin von Neurath, German lawyer and politician, Reich Minister of Foreign Affairs (b. 1873)\n*1963 – Clifford Odets, American director, playwright, and screenwriter (b. 1906)\n*1964 – Johnny Burnette, American singer-songwriter (b. 1934)\n*1965 – Vello Kaaristo, Estonian skier (b. 1911)\n*1966 – Tip Snooke, South African cricketer (b. 1881)\n*1967 – Bob Anderson, English motorcycle racer and race car driver (b. 1931)\n*1972 – Oscar Levant, American actor, pianist, and composer (b. 1906)\n*  1972   – Jules Romains, French author and poet (b. 1885)\n*1973 – Fred Gipson, American journalist and author (b. 1908)\n*1978 – Nicolas Bentley, English author and illustrator (b. 1907)\n*1980 – Dorothy Stratten, Canadian-American model and actress (b. 1960)\n*1981 – Karl Böhm, Austrian conductor and director (b. 1894)\n*  1981   – Dudley Nourse, South African cricketer (b. 1910)\n*1982 – Mahasi Sayadaw, Burmese monk and philosopher (b. 1904)\n*1984 – Spud Davis, American baseball player, coach, and manager (b. 1904)\n*  1984   – J. B. Priestley, English novelist and playwright (b. 1894)\n*1985 – Gale Sondergaard, American actress (b. 1899)\n*1988 – Roy Buchanan, American singer-songwriter and guitarist (b. 1939)\n*  1988   – Robert Calvert, South African-English singer-songwriter and playwright (b. 1945)\n*  1988   – Enzo Ferrari, Italian race car driver and businessman, founded Ferrari (b. 1898)\n*1989 – Ricky Berry, American basketball player (b. 1964)\n*1991 – Alberto Crespo, Argentinian race car driver (b. 1920)\n*1992 – John Sirica, American lawyer and judge (b. 1904)\n*1994 – Elias Canetti, Bulgarian-Swiss novelist, playwright, memoirist, Nobel Prize laureate (b. 1905)\n*  1994   – Alice Childress, American actress, playwright, and author (b. 1912)\n*1996 – Sergiu Celibidache, Romanian conductor and composer (b. 1912)\n*1999 – Pee Wee Reese, American baseball player and sportscaster (b. 1918)\n*2000 – Alain Fournier, French-Canadian computer scientist and academic (b. 1943)\n*2002 – Larry Rivers, American painter and sculptor (b. 1923)\n*2003 – Helmut Rahn, German footballer (b. 1929)\n*2004 – Czesław Miłosz, Polish-born American novelist, essayist, and poet, Nobel Prize laureate (b. 1911)\n*  2004   – Trevor Skeet, New Zealand-English lawyer and politician (b. 1918)\n*2006 – Adriaan de Groot, Dutch psychologist and chess player (b. 1914)\n*  2006   – Bruno Kirby, American actor (b. 1949)\n*2007 – Pinchas Goldstein, Israeli politician (b. 1939)\n*  2007   – Tikhon Khrennikov, Russian pianist and composer (b. 1913)\n*  2007   – Kotozakura Masakatsu, Japanese sumo wrestler, the 53rd Yokozuna (b. 1940)\n*2010 – Rallis Kopsidis, Greek painter and author (b. 1929)\n*  2010   – Herman Leonard, American soldier and photographer (b. 1923)\n*2011 – Fritz Korbach, German footballer and manager (b. 1945)\n*2012 – Maja Bošković-Stulli, Croatian historian and academic (b. 1922)\n*  2012   – Vilasrao Deshmukh, Indian lawyer and politician, 14th Chief Minister of Maharashtra (b. 1945)\n*  2012   – Svetozar Gligorić, Serbian chess player and theoretician (b. 1923)\n*  2012   – Sergey Kapitsa, English-Russian physicist and demographer (b. 1928)\n*  2012   – Phyllis Thaxter, American actress (b. 1919)\n*2013 – Jack Garfinkel, American basketball player and coach (b. 1918)\n*  2013   – Jack Germond, American journalist and author (b. 1928)\n*  2013   – Paddy Power, Irish educator and politician, 22nd Irish Minister for Defence (b. 1928)\n*2014 – Leonard Fein, American journalist and academic, co-founded Moment Magazine (b. 1934)\n*  2014   – George V. Hansen, American soldier and politician (b. 1930)\n*2015 – Agustín Cejas,  Argentinian footballer (b. 1945)\n*  2015   – Bob Farrell, American businessman, founded Farrell's Ice Cream Parlour (b. 1927)\n*  2015   – Bob Johnston, American songwriter and producer (b. 1932)\n*2016 – Philip \"Fyuvsh\" Finkel, American actor (b. 1922)\n\nHolidays and observances\n\n*Christian feast day:\n**Domingo Ibáñez de Erquicia\n**Eusebius of Rome\n**Jonathan Myrick Daniels (Episcopal Church)\n**Kaj Munk (with Kolbe, Lutheran Church)\n**Martyrs of Otranto \n**Maximilian Kolbe\n**August 14 (Eastern Orthodox liturgics)\n*Anniversary Day (Tristan da Cunha)\n*Commemoration of Wadi al-Dahab (Morocco)\n*Engineer's Day (Dominican Republic)\n*Day of the Defenders of the Fatherland (Abkhazia) (state is not fully recognized)\n*Independence Day, celebrates the day when Pakistan was declared a sovereign nation following the end of the British Raj in 1947.\n*Pramuka Day (Indonesia)\n*Falklands Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "August 14" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1417" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*29 BC – Octavian holds the second of three consecutive triumphs in Rome to celebrate the victory over the Dalmatian tribes.\n*1040 – King Duncan I is killed in battle against his first cousin and rival Macbeth. The latter succeeds him as King of Scotland.\n*1183 – Taira no Munemori and the Taira clan take the young Emperor Antoku and the three sacred treasures and flee to western Japan to escape pursuit by the Minamoto clan (traditional Japanese date: Twenty-fifth Day of the Seventh Month of the Second Year of Juei).\n*1288 – Count Adolf VIII of Berg grants town privileges to Düsseldorf, the village on the banks of the Düssel.\n*1352 – War of the Breton Succession: Anglo-Bretons defeat the French in the Battle of Mauron.\n*1370 – Charles IV, Holy Roman Emperor, grants city privileges to Carlsbad which is subsequently named after him.\n*1385 – Portuguese Crisis of 1383–85: Battle of Aljubarrota: Portuguese forces commanded by King John I and his general Nuno Álvares Pereira defeat the Castilian army of King John I.\n*1457 – Publication of the Mainz Psalter, the first book to feature a printed date of publication and printed colophon\n*1480 – Battle of Otranto: Ottoman troops behead 800 Christians for refusing to convert to Islam; they are later honored in the Church.\n*1592 – The first sighting of the Falkland Islands by John Davis.\n*1598 – Nine Years' War: Battle of the Yellow Ford: Irish forces under Hugh O'Neill, Earl of Tyrone, defeats an English expeditionary force under Henry Bagenal.\n*1720 – The Spanish military Villasur expedition is wiped out by Pawnee and Otoe warriors near present-day Columbus, Nebraska.\n*1791 – Slaves from plantations in Saint-Domingue hold a Vodou ceremony lead by houngan Dutty Boukman at Bois Caïman, marking the start of the Haitian Revolution.\n*1814 –  A cease fire agreement, called the Convention of Moss, ended the Swedish–Norwegian War.\n*1816 – The United Kingdom formally annexes the Tristan da Cunha archipelago, administering the islands from the Cape Colony in South Africa.\n*1842 – American Indian Wars: Second Seminole War ends, with the Seminoles forced from Florida to Oklahoma.\n*1848 – Oregon Territory is organized by act of Congress.\n*1880 – Construction of Cologne Cathedral, the most famous landmark in Cologne, Germany, is completed.\n*1885 – Japan's first patent is issued to the inventor of a rust-proof paint.\n*1888 – An audio recording of English composer Arthur Sullivan's \"The Lost Chord\", one of the first recordings of music ever made, is played during a press conference introducing Thomas Edison's phonograph in London, England.\n*1893 – France becomes the first country to introduce motor vehicle registration.\n*1900 – The Eight-Nation Alliance occupies Beijing, China, in a campaign to end the bloody Boxer Rebellion in China.\n*1901 – The first claimed powered flight, by Gustave Whitehead in his Number 21.\n*1911 – United States Senate leaders agree to rotate the office of President pro tempore of the Senate among leading candidates to fill the vacancy left by William P. Frye's death.\n*1912 – U.S. Marines invade Nicaragua to support the U.S.-backed government installed there after José Santos Zelaya had resigned three years earlier.\n*1914 – World War I: Start of the Battle of Lorraine, an unsuccessful French offensive designed to recover the lost province of Moselle from Germany.\n*1916 – Romania declares war on Austria-Hungary.\n*1921 – Tannu Uriankhai, later Tuvan People's Republic is established as a completely independent country (which is supported by Soviet Russia).\n*1933 – Loggers cause a forest fire in the Coast Range of Oregon, later known as the first forest fire of the Tillamook Burn; it is not fully extinguished until September 5, after destroying .\n*1935 – Franklin D. Roosevelt signs the Social Security Act, creating a government pension system for the retired.\n*1936 – Rainey Bethea is hanged in Owensboro, Kentucky in the last known public execution in the United States.\n*1937 – The beginning of air-to-air combat of the Second Sino-Japanese War and World War II in general, when six Japanese bombers are shot down by Chinese fighters while raiding Chinese air bases.\n*1941 – World War II: Winston Churchill and Franklin D. Roosevelt sign the Atlantic Charter of war stating postwar aims.\n*1945 – Japan accepts the Allied terms of surrender in World War II and the Emperor records the Imperial Rescript on Surrender (August 15 in Japan Standard Time).\n*  1945   – The Viet Minh launches August Revolution amid the political confusion and power vacuum engulfing Vietnam.\n*1947 – Pakistan gains Independence from the British Empire and joins the Commonwealth of Nations.\n*1959 – Founding and first official meeting of the American Football League.\n*1967 – UK Marine Broadcasting Offences Act declares participation in offshore pirate radio illegal.\n*1969 – Operation Banner: British troops are deployed in Northern Ireland.\n*1971 – Bahrain declares independence as the State of Bahrain.\n*1972 – An Ilyushin Il-62 airliner crashes near Königs Wusterhausen, East Germany, due to an in-flight fire, killing 156.\n*1973 – The Pakistan Constitution of 1973 comes into effect.\n*1975 – The Rocky Horror Picture Show, the longest-running release in film history, opens in London.\n*1980 – Lech Wałęsa leads strikes at the Gdańsk, Poland shipyards.\n*1994 – Ilich Ramírez Sánchez, also known as \"Carlos the Jackal\", is captured.\n*1996 – Greek Cypriot refugee Solomos Solomou is murdered by Turkish forces while trying to climb a flagpole in order to remove a Turkish flag from its mast in the United Nations Buffer Zone in Cyprus.\n*2003 – A widescale power blackout affects the northeast United States and Canada.\n*2003– Project Thread, an operation launched by CSIS and other Canadian law enforcement agencies, saw the arrest and incarceration of 24 innocent Muslim men, most of them young Pakistani students.\n*2005 – Helios Airways Flight 522, en route from Larnaca, Cyprus to Prague, Czech Republic via Athens, crashes in the hills near Grammatiko, Greece, killing 121 passengers and crew.\n*2006 – Sixty-one schoolgirls killed in Chencholai bombing by Sri Lankan Air Force air strike.\n*2007 – The Kahtaniya bombings kills at least 334 people.\n*2013 – Egypt declares a state of emergency as security forces kill hundreds of demonstrators supporting former president Mohamed Morsi.\n*2015 – The US Embassy in Havana, Cuba re-opens after 54 years of being closed when Cuba–United States relations were broken off.\n\nBirths\n\n* 928 – Qian Hongzuo, king of Wuyue (d. 947)\n*1297 – Emperor Hanazono of Japan (d. 1348)\n*1473 – Margaret Pole, Countess of Salisbury (d. 1541)\n*1479 – Catherine of York (d. 1527)\n*1499 – John de Vere, 14th Earl of Oxford, English politician, Lord Great Chamberlain (d. 1526)\n*1502 – Pieter Coecke van Aelst, Flemish painter (d. 1550)\n*1530 – Giambattista Benedetti, Italian mathematician and physicist (d. 1590)\n*1552 – Paolo Sarpi, Italian writer (d. 1623)\n*1561 – Christopher Heydon, English politician (d. 1623)\n*1575 – Robert Hayman, English-Canadian poet and politician (d. 1629)\n*1586 – William Hutchinson, founder of Rhode Island (d. 1642)\n*1599 – Méric Casaubon, Swiss-English scholar and author (d. 1671)\n*1625 – François de Harlay de Champvallon, French archbishop (d. 1695)\n*1642 – Cosimo III de' Medici, Grand Duke of Tuscany (d. 1723)\n*1645 – Carlos de Sigüenza y Góngora, Mexican secular priest, scientist, and savant (d. 1700)\n*1653 – Christopher Monck, 2nd Duke of Albemarle, English colonel and politician, Lieutenant Governor of Jamaica (d. 1688)\n*1688 – Frederick William I of Prussia (d. 1740)\n*1714 – Claude Joseph Vernet, French painter (d. 1789)\n*1738 – Leopold Hofmann, Austrian composer and conductor (d. 1793)\n*1740 – Pope Pius VII (d. 1823)\n*1758 – Carle Vernet, French painter and lithographer (d. 1835)\n*1777 – Hans Christian Ørsted, Danish physicist and chemist (d. 1851)\n*1817 – Alexander H. Bailey, American lawyer, judge, and politician (d. 1874)\n*1840 – Richard von Krafft-Ebing, German-Austrian psychologist and author (d. 1902)\n*1847 – Robert Comtesse, Swiss lawyer and politician, President of the Swiss National Council (d. 1922)\n*1848 – Margaret Lindsay Huggins, Anglo-Irish astronomer and author (d. 1915)\n*1851 – Yannoulis Chalepas, Greek sculptor (d. 1938)\n*  1851   – Doc Holliday, American dentist and gambler (d. 1887)\n*1857 – Max Wagenknecht, German organist, composer, and educator (d. 1922)\n*1863 – Ernest Thayer, American poet and author (d. 1940)\n*1865 – Guido Castelnuovo, Italian mathematician and academic (d. 1952)\n*1866 – Charles Jean de la Vallée-Poussin, Belgian mathematician and academic (d. 1962)\n*1867 – Cupid Childs, American baseball player (d. 1912)\n*1867 – John Galsworthy,  English novelist and playwright, Nobel Prize laureate (d. 1933)\n*1870 – Nelson McDowell, American actor (d. 1947)\n*1871 – Guangxu Emperor of China (d. 1908)\n*1875 – Mstislav Dobuzhinsky, Russian-Lithuanian-American painter and illustrator (d. 1957)\n*1876 – Alexander I of Serbia (d. 1903)\n*1880 – Fred Alexander, American tennis player (d. 1969)\n*1881 – Francis Ford, American actor, director, producer, and screenwriter (d. 1953)\n*1886 – Arthur Jeffrey Dempster, Canadian-American physicist and academic (d. 1950)\n*1887 – Marija Leiko, Latvian actress (d. 1937)\n*1889 – Otto Tief, Estonian lawyer and politician, Prime Minister of Estoria (d. 1976)\n*1890 – Bruno Tesch, German chemist and businessman (d. 1946)\n*1892 – Kaikhosru Shapurji Sorabji, English pianist, composer, and critic (d. 1988)\n*1893 – Francis Dvornik, Czech priest and academic (d. 1975)\n*1895 – Jack Gregory, Australian cricketer (d. 1973)\n*1896 – Albert Ball, English fighter pilot (d. 1917)\n*  1896   – Theodor Luts, Estonian director and cinematographer (d. 1980)\n*1900 – Margret Boveri, German journalist, recipient of the Order of Merit of the Federal Republic of Germany (d. 1975)\n*1901 – Alice Rivaz, Swiss pianist and author (d. 1998)\n*1903 – Lodewijk Bruckman, Dutch painter and illustrator (d. 1995)\n*1907 – Skinnay Ennis, American bandleader and singer (d. 1963) \n*1910 – Willy Ronis, French photographer (d. 2009)\n*  1910   – Pierre Schaeffer, French composer and producer (d. 1995)\n*1911 – Jan Koetsier, Dutch composer and conductor (d. 2006)\n*  1911   – Vethathiri Maharishi, Indian spiritual leader, philosopher, and author (d. 2006)\n*1912 – Frank Oppenheimer, American physicist and academic (d. 1985)\n*1913 – Hector Crawford, Australian director and producer (d. 1991)\n*  1913   – Paul Dean, American baseball player (d. 1981)\n*1914 – Herman Branson, African-American physicist, chemist, and academic (d. 1995)\n*1915 – B. A. Santamaria, Australian political activist and publisher (d. 1998)\n*1916 – Frank and John Craighead, American naturalists (twins, Frank d. 2001, John d. 2016)\n*  1916   – Fumio Fujimura, Japanese baseball player and manager (d. 1992)\n*  1916   – Wellington Mara, American businessman (d. 2005)\n*1918 – Patsy Smart, English actress (d. 1996)\n*1922 – Leslie Marr, English race car driver\n*1923 – Patriarch Diodoros of Jerusalem (d. 2000)\n*  1923   – Alice Ghostley, American actress (d. 2007)\n*1924 – Sverre Fehn, Norwegian architect, designed the Hedmark Museum (d. 2009)\n*  1924   – Holger Juul Hansen, Danish actor (d. 2013)\n*  1924   – Georges Prêtre, French conductor (d. 2017)\n*  1924   – Rangjung Rigpe Dorje, 16th Karmapa, Tibetan spiritual leader (d. 1981)\n*1925 – Russell Baker, American critic and essayist\n*1926 – René Goscinny, French author and illustrator (d. 1977)\n*  1926   – Buddy Greco, American singer and pianist (d. 2017)\n*1928 – Lina Wertmüller, Italian director and screenwriter\n*1929 – Kinnaird R. McKee, American admiral (d. 2013)\n*  1929   – Gene Scott, American pastor and broadcaster (d. 2005)\n*  1929   – Dick Tiger, Nigerian boxer (d. 1971)\n*1930 – Earl Weaver, American baseball player and manager (d. 2013)\n*1931 – Frederic Raphael, American journalist, author, and screenwriter\n*1932 – Lee Hoffman, American author (d. 2007)\n*1933 – Richard R. Ernst, Swiss chemist and academic, Nobel Prize laureate\n*1935 – John Brodie, American football player and golfer\n*1940 – Darrell \"Dash\" Crofts, American singer-songwriter and musician \n*  1940   – Galen Hall, American football player and coach\n*1941 – David Crosby, American singer-songwriter and guitarist \n*  1941   – Connie Smith, American country music singer-songwriter and guitarist\n*  1941   – Ernest Everett Just, African-American biologist and academic (d. 1941)\n*1942 – Willie Dunn, Canadian singer-songwriter and producer (d. 2013)\n*  1942   – Lionel Morton, English singer-songwriter, guitarist and television presenter\n*1943 – Ronnie Campbell, English miner and politician\n*  1943   – Ben Sidran, American jazz and rock keyboardist, producer, label owner, and music writer\n*1944 – John Dunt, English admiral\n*1945 – Steve Martin, American actor, comedian, musician, producer, and screenwriter\n*  1945   – Wim Wenders, German director, producer, and screenwriter\n*1946 – Larry Graham, American soul/funk bass player and singer-songwriter\n*  1946   – Susan Saint James, American actress \n*  1946   – Tom Walkinshaw, Scottish race car driver and businessman (d. 2010)\n*1947 – Bruce Nash, American director, producer, and screenwriter\n*  1947   – Maddy Prior, English folk singer \n*  1947   – Danielle Steel, American author\n*  1947   – Jiro Taniguchi, Japanese author and illustrator\n*  1947   – Joop van Daele, Dutch footballer and manager\n*1948 – Terry Adams, American pianist and composer \n*  1948   – Bruce Thomas, English bass player and author\n*1949 – Morten Olsen, Danish footballer and coach\n*1950 – Gary Larson, American cartoonist\n*1951 – Slim Dunlap, American singer-songwriter and guitarist \n*  1951   – Norbert Hofmann, German footballer and manager\n*1952 – Debbie Meyer, American swimmer\n*1953 – James Horner, American composer and conductor (d. 2015)\n*1954 – Mark Fidrych, American baseball player and sportscaster (d. 2009)\n*  1954   – Stanley A. McChrystal, American general\n*1956 – Sharon Bryant, American R&B singer \n*  1956   – Jackée Harry, American actress and television personality\n*  1956   – Andy King, English footballer and manager (d. 2015)\n*  1956   – Rusty Wallace, American race car driver and sportscaster\n*  1956   – Erica Flapan, American mathematician\n*1957 – Peter Costello, Australian lawyer and politician, 35th Treasurer of Australia\n*1958 – Philip Dunne, English farmer and politician, Minister for Defence Equipment, Support and Technology\n*  1958   – Bobby Eaton, American wrestler and trainer\n*1959 – Frank Brickowski, American basketball player\n*  1959   – Marcia Gay Harden, American actress\n*  1959   – Magic Johnson, American basketball player and coach\n*1960 – Sarah Brightman, English singer-songwriter and actress\n*  1960   – Fred Roberts, American basketball player and educator\n*1961 – Eddie Gilbert, American wrestler and manager (d. 1995)\n*1962 – Mark Gubicza, American baseball player and sportscaster\n*  1962   – Kevin Harris, Canadian skateboarder \n*  1962   – Andres Herkel, Estonian academic and politician\n*  1962   – Rameez Raja, Pakistani cricketer and sportscaster\n*1963 – Emmanuelle Béart, French actress \n*  1963   – José Cóceres, Argentinian golfer\n*1964 – Neal Anderson, American football player and coach\n*  1964   – Jason Dunstall, Australian footballer and sportscaster\n*1965 – Brannon Braga, American producer, director, and screenwriter\n*  1965   – Paul Broadhurst, English golfer\n*  1965   – Terry Richardson, American photographer and director\n*1966 – Halle Berry, American model, actress, and producer, Miss World United States 1986\n*  1966   – Karl Petter Løken, Swedish-Norwegian footballer and sportscaster\n*  1966   – Tuncay Özkan, Turkish journalist and politician\n*1967 – Erik Gandini, Italian-Swedish director, producer, and screenwriter\n*1968 – Pravin Amre, Indian cricketer and coach\n*  1968   – Catherine Bell, English-American actress and producer\n*  1968   – Darren Clarke, Northern Irish golfer\n*  1968   – Jason Leonard, English rugby player\n*  1968   – Medy van der Laan, Dutch politician\n*1969 – Tracy Caldwell Dyson, American chemist and astronaut\n*  1969   – Stig Tøfting, Danish footballer and manager\n*1970 – Kevin Cadogan, American rock singer-songwriter, guitarist, and producer  (Third Eye Blind)\n*1971 – Raoul Bova, Italian actor, producer, and screenwriter\n*  1971   – Mark Loretta, American baseball player and coach\n*  1971   – Pramodya Wickramasinghe, Sri Lankan cricketer\n*1972 – Tamer El Said, Egyptian director, producer, and screenwriter\n*  1972   – Laurent Lamothe, Haitian businessman and politician, 15th Prime Minister of Haiti\n*1973 – Jared Borgetti, Mexican footballer\n*  1973   – Jay-Jay Okocha, Nigerian footballer\n*  1973   – Kieren Perkins, Australian swimmer and sportscaster\n*  1973   – Paddy McGuinness, English comedian and television presenter\n*1974 – Chucky Atkins, American basketball player and coach\n*1975 – Mike Vrabel, American football player and coach\n*1976 – Fabrizio Donato, Italian triple jumper\n*1977 – Ed Harcourt, English singer-songwriter and producer\n*  1977   – Juan Pierre, American baseball player\n*1978 – Randika Galhenage, Sri Lankan cricketer\n*  1978   – Anastasios Kyriakos, Greek footballer\n*  1978   – Greg Rawlinson, South African-New Zealand rugby player\n*1979 – Jérémie Bréchet, French footballer\n*  1979   – Paul Burgess, Australian pole vaulter\n*  1979   – Yōichirō Morikawa, Japanese actor, director, and screenwriter\n*1980 – Aydın Toscalı, Turkish footballer\n*  1980   – Roy Williams, American football player\n*1981 – Earl Barron, American basketball player\n*  1981   – Matthew Etherington, English footballer\n*  1981   – Paul Gallen, Australian rugby league player\n*  1981   – Julius Jones, American football player\n*  1981   – Kofi Kingston, Ghanaian-American wrestler\n*1982 – Simon Andrews, English motorcycle racer (d. 2014)\n*1983 – Elena Baltacha, Ukrainian-Scottish tennis player (d. 2014)\n*  1983   – Mila Kunis, Ukrainian-born American actress\n*  1983   – Juan Oviedo, Dominican baseball player\n*  1983   – Spencer Pratt, American television personality\n*  1984   – Eva Birnerová, Czech tennis player\n*  1984   – Clay Buchholz, American baseball player\n*  1984   – Giorgio Chiellini, Italian footballer\n*  1984   – Josh Gorges, Canadian ice hockey player\n*  1984   – Nick Grimshaw, English radio and television host\n*  1984   – Nicola Slater, Scottish tennis player\n*  1984   – Robin Söderling, Swedish tennis player\n*1985 – Christian Gentner, German footballer\n*  1985   – Shea Weber, Canadian ice hockey player\n*1986 – Cameron Jerome, English footballer\n*  1986   – Sam Moa, Tongan-New Zealand rugby league player\n*  1986   – Braian Rodríguez, Uruguayan footballer\n*1987 – Tim Tebow, American football and baseball player, television personality and sportscaster\n*1989 – Florian Abel, German footballer\n*  1989   – Ander Herrera, Spanish footballer \n*  1989   – Kyle Turris, Canadian ice hockey player\n*1991 – Richard Freitag, German ski jumper\n\nDeaths\n\n* 582 – Tiberius II Constantine, Byzantine emperor (b. 535)\n* 902 – Badr al-Mu'tadidi, commander-in-chief of the Abbasid Caliphate under al-Mu'tadid\n*1040 – Duncan I of Scotland (b. 1001)\n*1167 – Rainald of Dassel, Italian archbishop (b. 1120)\n*1204 – Minamoto no Yoriie, Japanese shogun (b. 1182)\n*1297 – Frederick III, Burgrave of Nuremberg (b. c. 1220)\n*1319 – Waldemar, Margrave of Brandenburg-Stendal (b. c. 1280)\n*1388 – James Douglas, 2nd Earl of Douglas \n*1390 – John FitzAlan, 2nd Baron Arundel, English soldier (b. 1364)\n*1433 – John I of Portugal (b. 1357)\n*1464 – Pope Pius II (b. 1405)\n*1573 – Saitō Tatsuoki, Japanese daimyo (b. 1548)\n*1657 – Giovanni Paolo Lascaris, 57th Grandmaster of the Knights Hospitaller (b. 1560)\n*1691 – Richard Talbot, 1st Earl of Tyrconnell, Irish soldier and politician, Lord Lieutenant of Ireland (b. 1630)\n*1727 – William Croft, English organist and composer (b. 1678)\n*1774 – Johann Jakob Reiske, German physician and scholar (b. 1716)\n*1784 – Nathaniel Hone the Elder, Irish-born English painter and academic (b. 1718)\n*1856 – Constant Prévost, French geologist and academic (b. 1787)\n*1860 – André Marie Constant Duméril, French zoologist and entomologist (b. 1774)\n*1870 – David Farragut, American admiral (b. 1801)\n*1874 – Jonathan Clarkson Gibbs, American minister and politician (b. 1821)\n*1890 – Michael J. McGivney, American priest, founded the Knights of Columbus (b. 1852)\n*1905 – Simeon Solomon, English soldier and painter (b. 1840)\n*1909 – William Stanley, American engineer and philanthropist (b. 1829)\n*1926 – John H. Moffitt, American sergeant and politician, Medal of Honor recipient (b. 1843)\n*1928 – Klabund, German author and poet (b. 1890)\n*1938 – Hugh Trumble, Australian cricketer and accountant (b. 1876)\n*1941 – Maximilian Kolbe, Polish martyr and saint (b. 1894)\n*  1941   – Paul Sabatier, French chemist and academic, Nobel Prize laureate (b. 1854)\n*1943 – Lore Berger, Swiss author and translator (b. 1921)\n*  1943   – Joe Kelley, American baseball player and manager (b. 1871)\n*1951 – William Randolph Hearst, American publisher and politician, founded the Hearst Corporation (b. 1863)\n*1954 – Hugo Eckener, German pilot and designer (b. 1868)\n*  1954   – Nikos Ploumpidis, Greek activist (b. 1901)\n*1955 – Herbert Putnam, American lawyer and publisher, Librarian of Congress (b. 1861)\n*1956 – Bertolt Brecht, German poet, playwright, and director (b. 1898)\n*1958 – Frédéric Joliot-Curie, French physicist and chemist, Nobel Prize laureate (b. 1900)\n*  1958   – Konstantin von Neurath, German lawyer and politician, Reich Minister of Foreign Affairs (b. 1873)\n*1963 – Clifford Odets, American director, playwright, and screenwriter (b. 1906)\n*1964 – Johnny Burnette, American singer-songwriter (b. 1934)\n*1965 – Vello Kaaristo, Estonian skier (b. 1911)\n*1966 – Tip Snooke, South African cricketer (b. 1881)\n*1967 – Bob Anderson, English motorcycle racer and race car driver (b. 1931)\n*1972 – Oscar Levant, American actor, pianist, and composer (b. 1906)\n*  1972   – Jules Romains, French author and poet (b. 1885)\n*1973 – Fred Gipson, American journalist and author (b. 1908)\n*1978 – Nicolas Bentley, English author and illustrator (b. 1907)\n*1980 – Dorothy Stratten, Canadian-American model and actress (b. 1960)\n*1981 – Karl Böhm, Austrian conductor and director (b. 1894)\n*  1981   – Dudley Nourse, South African cricketer (b. 1910)\n*1982 – Mahasi Sayadaw, Burmese monk and philosopher (b. 1904)\n*1984 – Spud Davis, American baseball player, coach, and manager (b. 1904)\n*  1984   – J. B. Priestley, English novelist and playwright (b. 1894)\n*1985 – Gale Sondergaard, American actress (b. 1899)\n*1988 – Roy Buchanan, American singer-songwriter and guitarist (b. 1939)\n*  1988   – Robert Calvert, South African-English singer-songwriter and playwright (b. 1945)\n*  1988   – Enzo Ferrari, Italian race car driver and businessman, founded Ferrari (b. 1898)\n*1989 – Ricky Berry, American basketball player (b. 1964)\n*1991 – Alberto Crespo, Argentinian race car driver (b. 1920)\n*1992 – John Sirica, American lawyer and judge (b. 1904)\n*1994 – Elias Canetti, Bulgarian-Swiss novelist, playwright, memoirist, Nobel Prize laureate (b. 1905)\n*  1994   – Alice Childress, American actress, playwright, and author (b. 1912)\n*1996 – Sergiu Celibidache, Romanian conductor and composer (b. 1912)\n*1999 – Pee Wee Reese, American baseball player and sportscaster (b. 1918)\n*2000 – Alain Fournier, French-Canadian computer scientist and academic (b. 1943)\n*2002 – Larry Rivers, American painter and sculptor (b. 1923)\n*2003 – Helmut Rahn, German footballer (b. 1929)\n*2004 – Czesław Miłosz, Polish-born American novelist, essayist, and poet, Nobel Prize laureate (b. 1911)\n*  2004   – Trevor Skeet, New Zealand-English lawyer and politician (b. 1918)\n*2006 – Adriaan de Groot, Dutch psychologist and chess player (b. 1914)\n*  2006   – Bruno Kirby, American actor (b. 1949)\n*2007 – Pinchas Goldstein, Israeli politician (b. 1939)\n*  2007   – Tikhon Khrennikov, Russian pianist and composer (b. 1913)\n*  2007   – Kotozakura Masakatsu, Japanese sumo wrestler, the 53rd Yokozuna (b. 1940)\n*2010 – Rallis Kopsidis, Greek painter and author (b. 1929)\n*  2010   – Herman Leonard, American soldier and photographer (b. 1923)\n*2011 – Fritz Korbach, German footballer and manager (b. 1945)\n*2012 – Maja Bošković-Stulli, Croatian historian and academic (b. 1922)\n*  2012   – Vilasrao Deshmukh, Indian lawyer and politician, 14th Chief Minister of Maharashtra (b. 1945)\n*  2012   – Svetozar Gligorić, Serbian chess player and theoretician (b. 1923)\n*  2012   – Sergey Kapitsa, English-Russian physicist and demographer (b. 1928)\n*  2012   – Phyllis Thaxter, American actress (b. 1919)\n*2013 – Jack Garfinkel, American basketball player and coach (b. 1918)\n*  2013   – Jack Germond, American journalist and author (b. 1928)\n*  2013   – Paddy Power, Irish educator and politician, 22nd Irish Minister for Defence (b. 1928)\n*2014 – Leonard Fein, American journalist and academic, co-founded Moment Magazine (b. 1934)\n*  2014   – George V. Hansen, American soldier and politician (b. 1930)\n*2015 – Agustín Cejas,  Argentinian footballer (b. 1945)\n*  2015   – Bob Farrell, American businessman, founded Farrell's Ice Cream Parlour (b. 1927)\n*  2015   – Bob Johnston, American songwriter and producer (b. 1932)\n*2016 – Philip \"Fyuvsh\" Finkel, American actor (b. 1922)\n\nHolidays and observances\n\n*Christian feast day:\n**Domingo Ibáñez de Erquicia\n**Eusebius of Rome\n**Jonathan Myrick Daniels (Episcopal Church)\n**Kaj Munk (with Kolbe, Lutheran Church)\n**Martyrs of Otranto \n**Maximilian Kolbe\n**August 14 (Eastern Orthodox liturgics)\n*Anniversary Day (Tristan da Cunha)\n*Commemoration of Wadi al-Dahab (Morocco)\n*Engineer's Day (Dominican Republic)\n*Day of the Defenders of the Fatherland (Abkhazia) (state is not fully recognized)\n*Independence Day, celebrates the day when Pakistan was declared a sovereign nation following the end of the British Raj in 1947.\n*Pramuka Day (Indonesia)\n*Falklands Day. August 14. http://en.wikipedia.org/?curid=1417."
  }
}
