{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7976",
  "eid" : "e478c850-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778463061,
  "textBody" : "Dessert is a confectionery course that concludes a main meal. The course usually consists of sweet foods, and possibly a beverage such as dessert wine or liqueur, but may include coffee, cheeses, nuts, or other savory items. In some parts of the world, such as much of central and western Africa, and most parts of China, there is no tradition of a dessert course to conclude a meal.\n\nThe term \"dessert\" can apply to many confections, such as cakes, tarts, cookies, biscuits, gelatins, pastries, ice creams, pies, puddings, custards, and sweet soups. Fruit is also commonly found in dessert courses because of its naturally occurring sweetness.  Some cultures sweeten foods that are more commonly savory to create desserts.\n\nEtymology \n\nThe word \"dessert\" originated from the French word desservir, meaning \"to clear the table.\" Its first known use was in 1600, in a health education manual entitled Naturall and artificial Directions for Health, which was written by William Vaughan.  In his A History of Dessert (2013), Michael Krondl explains it refers to the fact dessert was served after the table had been cleared of other dishes. The term dates from the 14th century but attained its current meaning around the beginning of the 20th century when \"service à la française\" (setting a variety of dishes on the table at the same time) was replaced with \"service à la russe\" (presenting a meal in courses.)\"\n\nUsage \n\nThe word \"dessert\" is most commonly used for this course in the United States, Canada, Australia, New Zealand and Ireland while \"pudding\" is more commonly used in the United Kingdom. Alternatives such as \"sweets\" or \"afters\" are also used in the United Kingdom and some other Commonwealth countries, including Hong Kong, and India.\n\nHistory \n\nSweets were fed to the gods in ancient Mesopotamia and India and other ancient civilizations. Dried fruit and honey were probably the first sweeteners used in most of the world, but the spread of sugarcane around the world was essential to the development of dessert.\n\nSugarcane was grown and refined in India before 500 BCE and was crystallized, making it easy to transport, by 500 CE. Sugar and sugarcane were traded, making sugar available to Macedonia by 300 BCE and China by 600 CE.  In South Asia, the Middle East and China, sugar has been a staple of cooking and desserts for over a thousand years. Sugarcane and sugar were little known and rare in Europe until the twelfth century or later, when the Crusades and then colonialization spread its use.\n\nHerodotus mentions that, as opposed to the Greeks, the main Persian meal was simple, but they would eat many desserts afterwards.\n\nEuropeans began to manufacture sugar in the Middle Ages, and more sweet desserts became available.Adamson (2004), p. 89.  Even then sugar was so expensive usually only the wealthy could indulge on special occasions.  The first apple pie recipe was published in 1381. The earliest documentation of the term cupcake was in \"Seventy-five Receipts for Pastry, Cakes, and Sweetmeats\" in 1828 in Eliza Leslie's Receipts cookbook.\n\nThe Industrial Revolution in America and Europe caused desserts (and food in general) to be mass-produced, processed, preserved, canned, and packaged.  Frozen foods, including desserts, became very popular starting in the 1920s when freezing emerged.  These processed foods became a large part of diets in many industrialized nations.  Many countries have desserts and foods distinctive to their nations or region.\n\nIngredients \n\nSweet desserts usually contain cane sugar, palm sugar, honey or some types of syrup such as molasses, maple syrup, treacle, or corn syrup. Other common ingredients in Western-style desserts are flour or other starches, Cooking fats such as butter or lard, dairy, eggs, salt, acidic ingredients such as lemon juice, and spices and other flavoring agents such as chocolate, peanut butter, fruits, and nuts. The proportions of these ingredients, along with the preparation methods, play a major part in the consistency, texture, and flavor of the end product.\n\nSugars contribute moisture and tenderness to baked goods. Flour or starch components serves as a protein and gives the dessert structure. Fats contribute moisture and can enable the development of flaky layers in pastries and pie crusts.  The dairy products in baked goods keep the desserts moist. Many desserts also contain eggs, in order to form custard or to aid in the rising and thickening of a cake-like substance. Egg yolks specifically contribute to the richness of desserts.  Egg whites can act as a leavening agent or provide structure.  Further innovation in the healthy eating movement has led to more information being available about vegan and gluten-free substitutes for the standard ingredients, as well as replacements for refined sugar. Desserts can contain many spices and extracts to add a variety of flavors. Salt and acids are added to desserts to balance sweet flavors and create a contrast in flavors.\n\nSome desserts are made with coffee,a coffee-flavoured version of a dessert can be made, for example an iced coffee soufflé or coffee biscuits. Alcohol can also be used as an ingredient, to make alcoholic desserts.\n\nVarieties \n\nDessert consist of variations of flavors, textures, and appearances.  Desserts can be defined as a usually sweeter course that concludes a meal.  This definition includes a range of courses ranging from fruits or dried nuts to multi-ingredient cakes and pies.  Many cultures have different variations of dessert. In modern times the variations of desserts have usually been passed down or come from geographical regions.  This is one cause for the variation of desserts.  These are some major categories in which desserts can be placed.\n\nBiscuits or cookies \n\nBiscuits, (from the Old French word bescuit originally meaning twice-baked in Latin,See, for example, Shakespeare's use of \"Twice-sod simplicity! Bis coctus!\" in Love's Labour's Lost. () also known as \"cookies\" in North America, are flattish bite-sized or larger short pastries generally intended to be eaten out of the hand. Biscuits can have a texture that is crispy, chewy, or soft.  Examples include layered bars, crispy meringues, and soft chocolate chip cookies.\n\nCakes \n\nCakes are sweet tender breads made with sugar and delicate flour.  Cakes can vary from light, airy sponge cakes to dense cakes with less flour. Common flavourings include dried, candied or fresh fruit, nuts, cocoa or extracts. They may be filled with fruit preserves or dessert sauces (like pastry cream), iced with buttercream or other icings, and decorated with marzipan, piped borders, or candied fruit. Cake is often served as a celebratory dish on ceremonial occasions, for example weddings, anniversaries, and birthdays. Small-sized cakes have become popular, in the form of cupcakes and petits fours.\n\nChocolates and candies \n\nChocolate is a typically sweet, usually brown, food preparation of Theobroma cacao seeds, roasted, ground, and often flavored. Pure, unsweetened chocolate contains primarily cocoa solids and cocoa butter in varying proportions. Much of the chocolate currently consumed is in the form of sweet chocolate, combining chocolate with sugar. Milk chocolate is sweet chocolate that additionally contains milk powder or condensed milk. White chocolate contains cocoa butter, sugar, and milk, but no cocoa solids. Dark chocolate is produced by adding fat and sugar to the cacao mixture, with no milk or much less than milk chocolate.\n\nCandy, also called sweets or lollies, is a confection that features sugar as a principal ingredient. Many candies involve the crystallization of sugar which varies the texture of sugar crystals.  Candies comprise many forms including caramel, marshmallows, and taffy.\n\nCustards and puddings \n\nThese kinds of desserts usually include a thickened dairy base.  Custards are cooked and thickened with eggs.  Baked custards include crème brûlée and flan. Puddings are thickened with starches such as cornstarch or tapioca.  Custards and puddings are often used as ingredients in other desserts, for instance as a filling for pastries or pies.\n\nDeep-fried desserts \n\nMany cuisines include a dessert made of deep-fried starch-based batter or dough.  In many countries a doughnut is a flour-based batter that has been deep-fried. It is sometimes filled with custard or jelly. Fritters are fruit pieces in a thick batter that have been deep fried. Gulab jamun is an Indian dessert made of milk solids kneaded into a dough, deep-fried, and soaked in honey. Churros are a deep-fried and sugared dough that is eaten as dessert or a snack in many countries. Doughnuts are most famous for being a trademark favorite of fictional character Homer Simpson from the animated television series The Simpsons.\n\nFrozen desserts \n\nIce cream, gelato, sorbet and shaved-ice desserts fit into this category.  Ice cream is a cream base that is churned as it is frozen to create a creamy consistency.  Gelato uses a milk base and has less air whipped in than ice cream, making it denser. Sorbet is made from churned fruit and is not dairy based. Shaved-ice desserts are made by shaving a block of ice and adding flavored syrup or juice to the ice shavings.\n\nJellied desserts \n\nJellied desserts are made with a sweetened liquid thickened with gelatin or another thickening agent.  They are traditional in many cultures. Grass jelly and annin tofu are Chinese jellied desserts. Yōkan is a Japanese jellied dessert.  In English-speaking countries, many dessert recipes are based on gelatin with fruit or whipped cream added.\n\nPastries \n\n Pastries are sweet baked pastry products. Pastries can either take the form of light and flaky bread with an airy texture, such as a croissant or unleavened dough with a high fat content and crispy texture, such as shortbread.  Pastries are often flavored or filled with fruits, chocolate, nuts, and spices. Pastries are sometimes eaten with tea or coffee as a breakfast food.\n\nPies, cobblers, and clafoutis \n\nPies and cobblers are a crust with a filling.  The crust can be either made from either a pastry or crumbs.  Pie fillings range from fruits to puddings; cobbler fillings are generally fruit-based.  Clafoutis are a batter with fruit-based filling poured over the top before baking.\n\nSweet soups \n\nTong sui, literally translated as \"sugar water\" and also known as tim tong, is a collective term for any sweet, warm soup or custard served as a dessert at the end of a meal in Cantonese cuisine. Tong sui are a Cantonese specialty and are rarely found in other regional cuisines of China.  Outside of Cantonese-speaking communities, soupy desserts generally are not recognized as a distinct category, and the term tong sui is not used.\n\nDessert wines \n\nDessert wines are sweet wines typically served with dessert. There is no simple definition of a dessert wine. In the UK, a dessert wine is considered to be any sweet wine drunk with a meal, as opposed to the white fortified wines (fino and amontillado sherry) drunk before the meal, and the red fortified wines (port and madeira) drunk after it. Thus, most fortified wines are regarded as distinct from dessert wines, but some of the less strong fortified white wines, such as Pedro Ximénez sherry and Muscat de Beaumes-de-Venise, are regarded as honorary dessert wines. In the United States, by contrast, a dessert wine is legally defined as any wine over 14% alcohol by volume, which includes all fortified wines - and is taxed at higher rates as a result. Examples include Sauternes and Tokaji Aszú.\n\nGallery \n\nFile:Baked Alaska (5097717743).jpg|Baked Alaska, ice cream and cake topped with browned meringue\nFile:Baklava - Turkish special, 80-ply.JPEG|Baklava, a pastry comprising layers of filo with chopped nuts, sweetened and held together with syrup or honey\nFile:Brennan's Bananas Foster.jpg|Bananas Foster, made from bananas and vanilla ice cream with a sauce made from butter, brown sugar, cinnamon, dark rum and banana liqueur\nFile:Plain cheesecake.jpg|Cheesecake, a type of dessert with a layer of a mixture of soft, fresh cheese, eggs and sugar\nFile:Cannoli siciliani (7472226896).jpg|Cannolis with Pistachio Grain, Candied  and Chocolate Drops\nFile:Chocolate mousse.jpg|Chocolate mousse, a chocolate variety of a dessert incorporating air bubbles to give it a light and airy texture\nFile:Coconutbar.jpg|Coconut bar, made with coconut milk and set with either tang flour and corn starch, or agar agar and gelatin\nFile:Creme brulee.jpg|Preparation of crème brûlée, a rich custard base topped with a contrasting layer of hard caramel\nFile:Egg custard tart by Stu Spivack.jpg|Egg custard tarts, a pastry originating from Guangzhou, China.\nFile:Hwangnam bread (cropped).JPG|Gyeongju bread, a small pastry with a filling of red bean paste\nFile:씨앗호떡.jpg|Hotteok (a variety of filled Korean pancake) with edible seeds, sugar, and cinnamon\nFile:Kkultarae, Korean court cake.jpg|Kkultarae, fine strands of honey and maltose, often with a sweet nut filling\nFile:Jell-o cream cheese square.jpg|Jell-o cream cheese square\nFile:Besan laddu photo.JPG|Gulab jamun decorated with silver foil and almond chips.\nFile:Lemon tart (cropped).jpg|Lemon tart, a pastry shell with a lemon-flavored filling\nFile:Pastry assortment.jpg|An assortment of pastries\nFile:Rum cake.jpg|Rum cake, a type of cake containing rum\nFile:King of Spotted Dicks.jpg|Spotted Dick\nFile:Tiramisu with blueberries and raspberries, July 2011.jpg|Tiramisu\nFile:Banana pudding, homemade.jpg|Homemade banana pudding\n\nBy continent \n\nAfrica \n\nThroughout much of central and western Africa, there is no tradition of a dessert course following a meal. Fruit or fruit salad would be eaten instead, which may be spiced, or sweetened with a sauce. In some former colonies in the region, the colonial power has influenced desserts – for example, the Angolan cocada amarela (yellow coconut) resembles baked desserts in Portugal.\n\nAsia \n\nIn Asia, desserts are often eaten between meals as snacks rather than as a concluding course. There is widespread use of rice flour in East Asian desserts, which often include local ingredients such as coconut milk, palm sugar, and tropical fruit. In India, where sugarcane has been grown and refined since before 500 BCE, desserts have been an important part of the diet for thousands of years; types of desserts include burfis, halvahs, jalebis, and laddus.\n\nDessert nowadays are made into drinks as well, such as Bubble Tea. It is originated in Taiwan, which locates in East Asia. Bubble tea is a kind of dessert made with flavor tea or milk with tapioca. It is well-known across the world.\n\nEurasia \n\nIn Ukraine and Russia, breakfast foods such as nalysnyky or blintz or oladi (pancakes), and syrniki are served with honey and jam as desserts.\n\nNorth America \n\nEuropean colonization of the Americas yielded the introduction of a number of ingredients and cooking styles. The various styles continued expanding well into the 19th and 20th centuries, proportional to the influx of immigrants.\n\nSouth America \n\nDulce de leche is a very common confection in Argentina. In Bolivia, sugarcane, honey and coconut are traditionally used in desserts. Tawa tawa is a Bolivian sweet fritter prepared using sugar cane, and helado de canela is a dessert that is similar to sherbet which is prepared with cane sugar and cinnamon. Coconut tarts, puddings cookies and candies are also consumed in Bolivia. Brazil has a variety of candies such as brigadeiros (chocolate fudge balls), cocada (a coconut sweet), beijinhos (coconut truffles and clove) and romeu e julieta (cheese with a guava jam known as goiabada). Peanuts are used to make paçoca, rapadura and pé-de-moleque. Local common fruits are turned in juices and used to make chocolates, popsicles and ice cream.Freyre, Gilberto. Açúcar. Uma Sociologia do Doce, com Receitas de Bolos e Doces do Nordeste do Brasil. São Paulo, Companhia das Letras, 1997. In Chile, kuchen has been described as a \"trademark dessert.\" Several desserts in Chile are prepared with manjar, (caramelized milk), including alfajor, flan, cuchufli and arroz con leche. Desserts consumed in Colombia include dulce de leche, waffle cookies, puddings, nougat, coconut with syrup and thickened milk with sugarcane syrup. Desserts in Ecuador tend to be simple, and desserts are a moderate part of the cuisine. Desserts consumed in Ecuador include tres leches cake, flan, candies and various sweets.\n\nOceania \n\nDesserts are typically eaten in Australia,  and most daily meals \"end with simple desserts,\" which can include various fruits. More complex desserts include cakes, pies and cookies, which are sometimes served during special occasions.\n\nMarket \n\nThe market for desserts has grown over the last few decades, which was greatly increased by the commercialism of baking desserts and the rise of food productions. Desserts are present in most restaurants as the popularity has increased.  Many commercial stores have been established as solely desserts stores. Ice cream parlors have been around since before 1800. Many businesses started advertising campaigns focusing solely on desserts.  The tactics used to market desserts are very different depending on the audience for example desserts can be advertised with popular movie characters to target children.  The rise of companies like Food Network has marketed many shows which feature dessert and their creation. Shows like these have displayed extreme desserts and made a game show atmosphere which made desserts a more competitive field.\n\nDesserts are a standard staple in restaurant menus, with different degrees of variety. Pie and cheesecake were among the most popular dessert courses ordered in U.S. restaurants in 2012.[http://www.statista.com/statistics/244042/preferred-desserts-ordered-in-restaurants/ Top desserts ordered in restaurants 2012]. Technomic, Inc. September 2012. Retrieved 3 December 2013.\n\nNutrition \n\nDessert foods often contain relatively high amounts of sugar and fats and, as a result, higher calorie counts per gram than other foods. Fresh or cooked fruit with minimal added sugar or fat is an exception.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dessert" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7976" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dessert is a confectionery course that concludes a main meal. The course usually consists of sweet foods, and possibly a beverage such as dessert wine or liqueur, but may include coffee, cheeses, nuts, or other savory items. In some parts of the world, such as much of central and western Africa, and most parts of China, there is no tradition of a dessert course to conclude a meal.\n\nThe term \"dessert\" can apply to many confections, such as cakes, tarts, cookies, biscuits, gelatins, pastries, ice creams, pies, puddings, custards, and sweet soups. Fruit is also commonly found in dessert courses because of its naturally occurring sweetness.  Some cultures sweeten foods that are more commonly savory to create desserts.\n\nEtymology \n\nThe word \"dessert\" originated from the French word desservir, meaning \"to clear the table.\" Its first known use was in 1600, in a health education manual entitled Naturall and artificial Directions for Health, which was written by William Vaughan.  In his A History of Dessert (2013), Michael Krondl explains it refers to the fact dessert was served after the table had been cleared of other dishes. The term dates from the 14th century but attained its current meaning around the beginning of the 20th century when \"service à la française\" (setting a variety of dishes on the table at the same time) was replaced with \"service à la russe\" (presenting a meal in courses.)\"\n\nUsage \n\nThe word \"dessert\" is most commonly used for this course in the United States, Canada, Australia, New Zealand and Ireland while \"pudding\" is more commonly used in the United Kingdom. Alternatives such as \"sweets\" or \"afters\" are also used in the United Kingdom and some other Commonwealth countries, including Hong Kong, and India.\n\nHistory \n\nSweets were fed to the gods in ancient Mesopotamia and India and other ancient civilizations. Dried fruit and honey were probably the first sweeteners used in most of the world, but the spread of sugarcane around the world was essential to the development of dessert.\n\nSugarcane was grown and refined in India before 500 BCE and was crystallized, making it easy to transport, by 500 CE. Sugar and sugarcane were traded, making sugar available to Macedonia by 300 BCE and China by 600 CE.  In South Asia, the Middle East and China, sugar has been a staple of cooking and desserts for over a thousand years. Sugarcane and sugar were little known and rare in Europe until the twelfth century or later, when the Crusades and then colonialization spread its use.\n\nHerodotus mentions that, as opposed to the Greeks, the main Persian meal was simple, but they would eat many desserts afterwards.\n\nEuropeans began to manufacture sugar in the Middle Ages, and more sweet desserts became available.Adamson (2004), p. 89.  Even then sugar was so expensive usually only the wealthy could indulge on special occasions.  The first apple pie recipe was published in 1381. The earliest documentation of the term cupcake was in \"Seventy-five Receipts for Pastry, Cakes, and Sweetmeats\" in 1828 in Eliza Leslie's Receipts cookbook.\n\nThe Industrial Revolution in America and Europe caused desserts (and food in general) to be mass-produced, processed, preserved, canned, and packaged.  Frozen foods, including desserts, became very popular starting in the 1920s when freezing emerged.  These processed foods became a large part of diets in many industrialized nations.  Many countries have desserts and foods distinctive to their nations or region.\n\nIngredients \n\nSweet desserts usually contain cane sugar, palm sugar, honey or some types of syrup such as molasses, maple syrup, treacle, or corn syrup. Other common ingredients in Western-style desserts are flour or other starches, Cooking fats such as butter or lard, dairy, eggs, salt, acidic ingredients such as lemon juice, and spices and other flavoring agents such as chocolate, peanut butter, fruits, and nuts. The proportions of these ingredients, along with the preparation methods, play a major part in the consistency, texture, and flavor of the end product.\n\nSugars contribute moisture and tenderness to baked goods. Flour or starch components serves as a protein and gives the dessert structure. Fats contribute moisture and can enable the development of flaky layers in pastries and pie crusts.  The dairy products in baked goods keep the desserts moist. Many desserts also contain eggs, in order to form custard or to aid in the rising and thickening of a cake-like substance. Egg yolks specifically contribute to the richness of desserts.  Egg whites can act as a leavening agent or provide structure.  Further innovation in the healthy eating movement has led to more information being available about vegan and gluten-free substitutes for the standard ingredients, as well as replacements for refined sugar. Desserts can contain many spices and extracts to add a variety of flavors. Salt and acids are added to desserts to balance sweet flavors and create a contrast in flavors.\n\nSome desserts are made with coffee,a coffee-flavoured version of a dessert can be made, for example an iced coffee soufflé or coffee biscuits. Alcohol can also be used as an ingredient, to make alcoholic desserts.\n\nVarieties \n\nDessert consist of variations of flavors, textures, and appearances.  Desserts can be defined as a usually sweeter course that concludes a meal.  This definition includes a range of courses ranging from fruits or dried nuts to multi-ingredient cakes and pies.  Many cultures have different variations of dessert. In modern times the variations of desserts have usually been passed down or come from geographical regions.  This is one cause for the variation of desserts.  These are some major categories in which desserts can be placed.\n\nBiscuits or cookies \n\nBiscuits, (from the Old French word bescuit originally meaning twice-baked in Latin,See, for example, Shakespeare's use of \"Twice-sod simplicity! Bis coctus!\" in Love's Labour's Lost. () also known as \"cookies\" in North America, are flattish bite-sized or larger short pastries generally intended to be eaten out of the hand. Biscuits can have a texture that is crispy, chewy, or soft.  Examples include layered bars, crispy meringues, and soft chocolate chip cookies.\n\nCakes \n\nCakes are sweet tender breads made with sugar and delicate flour.  Cakes can vary from light, airy sponge cakes to dense cakes with less flour. Common flavourings include dried, candied or fresh fruit, nuts, cocoa or extracts. They may be filled with fruit preserves or dessert sauces (like pastry cream), iced with buttercream or other icings, and decorated with marzipan, piped borders, or candied fruit. Cake is often served as a celebratory dish on ceremonial occasions, for example weddings, anniversaries, and birthdays. Small-sized cakes have become popular, in the form of cupcakes and petits fours.\n\nChocolates and candies \n\nChocolate is a typically sweet, usually brown, food preparation of Theobroma cacao seeds, roasted, ground, and often flavored. Pure, unsweetened chocolate contains primarily cocoa solids and cocoa butter in varying proportions. Much of the chocolate currently consumed is in the form of sweet chocolate, combining chocolate with sugar. Milk chocolate is sweet chocolate that additionally contains milk powder or condensed milk. White chocolate contains cocoa butter, sugar, and milk, but no cocoa solids. Dark chocolate is produced by adding fat and sugar to the cacao mixture, with no milk or much less than milk chocolate.\n\nCandy, also called sweets or lollies, is a confection that features sugar as a principal ingredient. Many candies involve the crystallization of sugar which varies the texture of sugar crystals.  Candies comprise many forms including caramel, marshmallows, and taffy.\n\nCustards and puddings \n\nThese kinds of desserts usually include a thickened dairy base.  Custards are cooked and thickened with eggs.  Baked custards include crème brûlée and flan. Puddings are thickened with starches such as cornstarch or tapioca.  Custards and puddings are often used as ingredients in other desserts, for instance as a filling for pastries or pies.\n\nDeep-fried desserts \n\nMany cuisines include a dessert made of deep-fried starch-based batter or dough.  In many countries a doughnut is a flour-based batter that has been deep-fried. It is sometimes filled with custard or jelly. Fritters are fruit pieces in a thick batter that have been deep fried. Gulab jamun is an Indian dessert made of milk solids kneaded into a dough, deep-fried, and soaked in honey. Churros are a deep-fried and sugared dough that is eaten as dessert or a snack in many countries. Doughnuts are most famous for being a trademark favorite of fictional character Homer Simpson from the animated television series The Simpsons.\n\nFrozen desserts \n\nIce cream, gelato, sorbet and shaved-ice desserts fit into this category.  Ice cream is a cream base that is churned as it is frozen to create a creamy consistency.  Gelato uses a milk base and has less air whipped in than ice cream, making it denser. Sorbet is made from churned fruit and is not dairy based. Shaved-ice desserts are made by shaving a block of ice and adding flavored syrup or juice to the ice shavings.\n\nJellied desserts \n\nJellied desserts are made with a sweetened liquid thickened with gelatin or another thickening agent.  They are traditional in many cultures. Grass jelly and annin tofu are Chinese jellied desserts. Yōkan is a Japanese jellied dessert.  In English-speaking countries, many dessert recipes are based on gelatin with fruit or whipped cream added.\n\nPastries \n\n Pastries are sweet baked pastry products. Pastries can either take the form of light and flaky bread with an airy texture, such as a croissant or unleavened dough with a high fat content and crispy texture, such as shortbread.  Pastries are often flavored or filled with fruits, chocolate, nuts, and spices. Pastries are sometimes eaten with tea or coffee as a breakfast food.\n\nPies, cobblers, and clafoutis \n\nPies and cobblers are a crust with a filling.  The crust can be either made from either a pastry or crumbs.  Pie fillings range from fruits to puddings; cobbler fillings are generally fruit-based.  Clafoutis are a batter with fruit-based filling poured over the top before baking.\n\nSweet soups \n\nTong sui, literally translated as \"sugar water\" and also known as tim tong, is a collective term for any sweet, warm soup or custard served as a dessert at the end of a meal in Cantonese cuisine. Tong sui are a Cantonese specialty and are rarely found in other regional cuisines of China.  Outside of Cantonese-speaking communities, soupy desserts generally are not recognized as a distinct category, and the term tong sui is not used.\n\nDessert wines \n\nDessert wines are sweet wines typically served with dessert. There is no simple definition of a dessert wine. In the UK, a dessert wine is considered to be any sweet wine drunk with a meal, as opposed to the white fortified wines (fino and amontillado sherry) drunk before the meal, and the red fortified wines (port and madeira) drunk after it. Thus, most fortified wines are regarded as distinct from dessert wines, but some of the less strong fortified white wines, such as Pedro Ximénez sherry and Muscat de Beaumes-de-Venise, are regarded as honorary dessert wines. In the United States, by contrast, a dessert wine is legally defined as any wine over 14% alcohol by volume, which includes all fortified wines - and is taxed at higher rates as a result. Examples include Sauternes and Tokaji Aszú.\n\nGallery \n\nFile:Baked Alaska (5097717743).jpg|Baked Alaska, ice cream and cake topped with browned meringue\nFile:Baklava - Turkish special, 80-ply.JPEG|Baklava, a pastry comprising layers of filo with chopped nuts, sweetened and held together with syrup or honey\nFile:Brennan's Bananas Foster.jpg|Bananas Foster, made from bananas and vanilla ice cream with a sauce made from butter, brown sugar, cinnamon, dark rum and banana liqueur\nFile:Plain cheesecake.jpg|Cheesecake, a type of dessert with a layer of a mixture of soft, fresh cheese, eggs and sugar\nFile:Cannoli siciliani (7472226896).jpg|Cannolis with Pistachio Grain, Candied  and Chocolate Drops\nFile:Chocolate mousse.jpg|Chocolate mousse, a chocolate variety of a dessert incorporating air bubbles to give it a light and airy texture\nFile:Coconutbar.jpg|Coconut bar, made with coconut milk and set with either tang flour and corn starch, or agar agar and gelatin\nFile:Creme brulee.jpg|Preparation of crème brûlée, a rich custard base topped with a contrasting layer of hard caramel\nFile:Egg custard tart by Stu Spivack.jpg|Egg custard tarts, a pastry originating from Guangzhou, China.\nFile:Hwangnam bread (cropped).JPG|Gyeongju bread, a small pastry with a filling of red bean paste\nFile:씨앗호떡.jpg|Hotteok (a variety of filled Korean pancake) with edible seeds, sugar, and cinnamon\nFile:Kkultarae, Korean court cake.jpg|Kkultarae, fine strands of honey and maltose, often with a sweet nut filling\nFile:Jell-o cream cheese square.jpg|Jell-o cream cheese square\nFile:Besan laddu photo.JPG|Gulab jamun decorated with silver foil and almond chips.\nFile:Lemon tart (cropped).jpg|Lemon tart, a pastry shell with a lemon-flavored filling\nFile:Pastry assortment.jpg|An assortment of pastries\nFile:Rum cake.jpg|Rum cake, a type of cake containing rum\nFile:King of Spotted Dicks.jpg|Spotted Dick\nFile:Tiramisu with blueberries and raspberries, July 2011.jpg|Tiramisu\nFile:Banana pudding, homemade.jpg|Homemade banana pudding\n\nBy continent \n\nAfrica \n\nThroughout much of central and western Africa, there is no tradition of a dessert course following a meal. Fruit or fruit salad would be eaten instead, which may be spiced, or sweetened with a sauce. In some former colonies in the region, the colonial power has influenced desserts – for example, the Angolan cocada amarela (yellow coconut) resembles baked desserts in Portugal.\n\nAsia \n\nIn Asia, desserts are often eaten between meals as snacks rather than as a concluding course. There is widespread use of rice flour in East Asian desserts, which often include local ingredients such as coconut milk, palm sugar, and tropical fruit. In India, where sugarcane has been grown and refined since before 500 BCE, desserts have been an important part of the diet for thousands of years; types of desserts include burfis, halvahs, jalebis, and laddus.\n\nDessert nowadays are made into drinks as well, such as Bubble Tea. It is originated in Taiwan, which locates in East Asia. Bubble tea is a kind of dessert made with flavor tea or milk with tapioca. It is well-known across the world.\n\nEurasia \n\nIn Ukraine and Russia, breakfast foods such as nalysnyky or blintz or oladi (pancakes), and syrniki are served with honey and jam as desserts.\n\nNorth America \n\nEuropean colonization of the Americas yielded the introduction of a number of ingredients and cooking styles. The various styles continued expanding well into the 19th and 20th centuries, proportional to the influx of immigrants.\n\nSouth America \n\nDulce de leche is a very common confection in Argentina. In Bolivia, sugarcane, honey and coconut are traditionally used in desserts. Tawa tawa is a Bolivian sweet fritter prepared using sugar cane, and helado de canela is a dessert that is similar to sherbet which is prepared with cane sugar and cinnamon. Coconut tarts, puddings cookies and candies are also consumed in Bolivia. Brazil has a variety of candies such as brigadeiros (chocolate fudge balls), cocada (a coconut sweet), beijinhos (coconut truffles and clove) and romeu e julieta (cheese with a guava jam known as goiabada). Peanuts are used to make paçoca, rapadura and pé-de-moleque. Local common fruits are turned in juices and used to make chocolates, popsicles and ice cream.Freyre, Gilberto. Açúcar. Uma Sociologia do Doce, com Receitas de Bolos e Doces do Nordeste do Brasil. São Paulo, Companhia das Letras, 1997. In Chile, kuchen has been described as a \"trademark dessert.\" Several desserts in Chile are prepared with manjar, (caramelized milk), including alfajor, flan, cuchufli and arroz con leche. Desserts consumed in Colombia include dulce de leche, waffle cookies, puddings, nougat, coconut with syrup and thickened milk with sugarcane syrup. Desserts in Ecuador tend to be simple, and desserts are a moderate part of the cuisine. Desserts consumed in Ecuador include tres leches cake, flan, candies and various sweets.\n\nOceania \n\nDesserts are typically eaten in Australia,  and most daily meals \"end with simple desserts,\" which can include various fruits. More complex desserts include cakes, pies and cookies, which are sometimes served during special occasions.\n\nMarket \n\nThe market for desserts has grown over the last few decades, which was greatly increased by the commercialism of baking desserts and the rise of food productions. Desserts are present in most restaurants as the popularity has increased.  Many commercial stores have been established as solely desserts stores. Ice cream parlors have been around since before 1800. Many businesses started advertising campaigns focusing solely on desserts.  The tactics used to market desserts are very different depending on the audience for example desserts can be advertised with popular movie characters to target children.  The rise of companies like Food Network has marketed many shows which feature dessert and their creation. Shows like these have displayed extreme desserts and made a game show atmosphere which made desserts a more competitive field.\n\nDesserts are a standard staple in restaurant menus, with different degrees of variety. Pie and cheesecake were among the most popular dessert courses ordered in U.S. restaurants in 2012.[http://www.statista.com/statistics/244042/preferred-desserts-ordered-in-restaurants/ Top desserts ordered in restaurants 2012]. Technomic, Inc. September 2012. Retrieved 3 December 2013.\n\nNutrition \n\nDessert foods often contain relatively high amounts of sugar and fats and, as a result, higher calorie counts per gram than other foods. Fresh or cooked fruit with minimal added sugar or fat is an exception. Dessert. http://en.wikipedia.org/?curid=7976."
  }
}
