{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18137",
  "eid" : "3120a740-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778591668,
  "textBody" : "The logistic map is a polynomial mapping (equivalently, recurrence relation) of degree 2, often cited as an archetypal example of how complex, chaotic behaviour can arise from very simple non-linear dynamical equations. The map was popularized in a seminal 1976 paper by the biologist Robert May, in part as a discrete-time demographic model analogous to the logistic equation first created by Pierre François Verhulst.\"\nMathematically, the logistic map is written\n\nwhere x_n is a number between zero and one that represents the ratio of existing population to the maximum possible population. The values of interest for the parameter   (sometimes also denoted ) are those in the interval [0, 4].\nThis nonlinear difference equation is intended to capture two effects:\n* reproduction where the population will increase at a rate proportional to the current population when the population size is small.\n* starvation (density-dependent mortality) where the growth rate will decrease at a rate proportional to the value obtained by taking the theoretical \"carrying capacity\" of the environment less the current population.\n\nHowever, as a demographic model the logistic map has the pathological problem that some initial conditions and parameter values lead to negative population sizes.  This problem does not appear in the older Ricker model, which also exhibits chaotic dynamics.\n\nThe r4 case of the logistic map is a nonlinear transformation of both the bit-shift map and the \\mu \n2 case of the tent map.\n\nBehavior dependent on \n\nThe image below shows the amplitude and frequency content of some logistic map iterates for parameter values ranging from 2 to 4.\n\nBy varying the parameter , the following behavior is observed:\n* With  between 0 and 1, the population will eventually die, independent of the initial population.\n* With  between 1 and 2, the population will quickly approach the value \\frac{r-1}{r}, independent of the initial population.\n* With  between 2 and 3, the population will also eventually approach the same value \\frac{r-1}{r}, but first will fluctuate around that value for some time. The rate of convergence is linear, except for r=3, when it is dramatically slow, less than linear (see Bifurcation memory).\n* With  between 3 and 1+\\sqrt{6}\\simeq 3.44949, from almost all initial conditions the population will approach  permanent oscillations between two values. These two values are dependent on .\n* With  between 3.44949 and 3.54409 (approximately), from almost all initial conditions the population will approach permanent oscillations among four values. The latter number is a root of a 12th degree polynomial .\n* With  increasing beyond 3.54409, from almost all initial conditions the population will approach oscillations among 8 values, then 16, 32, etc. The lengths of the parameter intervals that yield oscillations of a given length decrease rapidly;  the ratio between the lengths of two successive bifurcation intervals approaches the Feigenbaum constant \\delta \\simeq 4.66920.... This behavior is an example of a period-doubling cascade.\n* At r\\simeq 3.56995  is the onset of chaos, at the end of the period-doubling cascade. From almost all initial conditions, we no longer see oscillations of finite period.  Slight variations in the initial population yield dramatically different results over time, a prime characteristic of chaos.\n* Most values of  beyond 3.56995 exhibit chaotic behaviour, but there are still certain isolated ranges of  that show non-chaotic behavior; these are sometimes called islands of stability. For instance, beginning at 1+\\sqrt{8}Zhang, Cheng, \"Period three begins\", Mathematics Magazine 83, October 2010, 295-297. (approximately 3.82843) there is a range of parameters  that show oscillation among three values, and for slightly higher values of  oscillation among 6 values, then 12 etc.\n* The development of the chaotic behavior of the logistic sequence as the parameter  varies from approximately 3.56995 to approximately 3.82843 is sometimes called the Pomeau–Manneville scenario, characterized by a periodic (laminar) phase interrupted by bursts of aperiodic behavior. Such a scenario has an application in semiconductor devices.\n There are other ranges that yield oscillation among 5 values etc.; all oscillation periods occur for some values of .  A period-doubling window with parameter  is a range of -values consisting of a succession of sub-ranges.  The th sub-range contains the values of  for which there is a stable cycle (a cycle that attracts a set of initial points of unit measure) of period c2^{k}.  This sequence of sub-ranges is called a cascade of harmonics. In a sub-range with a stable cycle of period c2^{k^{*}}, there are unstable cycles of period c2^{k} for all k.  The  value at the end of the infinite sequence of sub-ranges is called the point of accumulation of the cascade of harmonics.  As  rises there is a succession of new windows with different  values.  The first one is for c \n 1; all subsequent windows involving odd  occur in decreasing order of  starting with arbitrarily large .  \n* Beyond r = 4, almost all initial values eventually leave the interval [0,1] and diverge.\nFor any value of  there is at most one stable cycle.  If a stable cycle exists, it is globally stable,  attracting almost all points.  Some values of  with a stable cycle of some period have infinitely many unstable cycles of various periods.\n\nThe  bifurcation diagram at right summarizes this. The horizontal axis shows the possible values of the parameter  while the vertical axis shows the set of values of  visited asymptotically from almost all initial conditions by the iterates of the logistic equation with that  value.\n\nThe bifurcation diagram is a self-similar: if you zoom in on the above-mentioned value r \\simeq 3.82843 and focus on one arm of the three, the situation nearby looks like a shrunk and slightly distorted version of the whole diagram. The same is true for all other non-chaotic points. This is an example of the deep and ubiquitous connection between chaos and fractals.\n\nChaos and the logistic map\n\nThe relative simplicity of the logistic map makes it a widely used point of entry into a consideration of the concept of chaos.  A rough description of chaos is that chaotic systems exhibit a great sensitivity to initial conditions—a property of the logistic map for most values of  between about 3.57 and 4 (as noted above).  A common source of such sensitivity to initial conditions is that the map represents a repeated folding and stretching of the space on which it is defined.  In the case of the logistic map, the quadratic difference equation describing it may be thought of as a stretching-and-folding operation on the interval (0,1).\n\nThe following figure illustrates the stretching and folding over a sequence of iterates of the map.  Figure (a), left, shows a two-dimensional Poincaré plot of the logistic map's state space for r=4, and clearly shows the quadratic curve of the difference equation ().  However, we can embed the same sequence in a three-dimensional state space, in order to investigate the deeper structure of the map.  Figure (b), right, demonstrates this, showing how initially nearby points begin to diverge, particularly in those regions of x_t corresponding to the steeper sections of the plot.\n\nThis stretching-and-folding does not just produce a gradual divergence of the sequences of iterates, but an exponential divergence (see Lyapunov exponents), evidenced also by the complexity and unpredictability of the chaotic logistic map.  In fact, exponential divergence of sequences of iterates explains the connection between chaos and unpredictability: a small error in the supposed initial state of the system will tend to correspond to a large error later in its evolution.  Hence, predictions about future states become progressively (indeed, exponentially) worse when there are even very small errors in our knowledge of the initial state. This quality of unpredictability and apparent randomness led the logistic map equation to be used as a pseudo-random number generator in early computers.\n\nSince the map is confined to an interval on the real number line, its dimension is less than or equal to unity. Numerical estimates yield a correlation dimension of 0.500 ± 0.005 (Grassberger, 1983), a Hausdorff dimension of about 0.538  (Grassberger 1981), and an information dimension of 0.5170976... (Grassberger 1983) for r\\simeq 3.5699456... (onset of chaos). Note: It can be shown that the correlation dimension is certainly between 0.4926 and 0.5024.\n\nIt is often possible, however, to make precise and accurate statements about the likelihood of a future state in a chaotic system.  If a (possibly chaotic) dynamical system has an attractor, then there exists a probability measure that gives the long-run proportion of time spent by the system in the various regions of the attractor.  In the case of the logistic map with parameter r 4 and an initial state in (0,1), the attractor is also the interval (0,1) and the probability measure corresponds to the beta distribution with parameters a \n 0.5 and b = 0.5. Specifically, the invariant measure is  \\pi ^{-1}x^{-1/2}(1-x)^{-1/2}.  Unpredictability is not randomness, but in some circumstances looks very much like it.  Hence, and fortunately, even if we know very little about the initial state of the logistic map (or some other chaotic system), we can still say something about the distribution of states arbitrarily far into the future, and use this knowledge to inform decisions based on the state of the system.\n\nSolution when  \n\nThe special case of  can in fact be solved exactly, as can the case with ; however, the general case can only be predicted statistically.  \nThe solution when  is,\nLorenz, Edward (1964), \"The problem of deducing the climate from the governing equations,\" Tellus 16 (February): 1-11.\n\nx_{n}=\\sin^{2}(2^{n} \\theta \\pi)\n\nwhere the initial condition parameter  is given by \\theta = \\tfrac{1}{\\pi}\\sin^{-1}(x_0^{1/2}).  For rational , after a finite number of iterations x_n maps into a periodic sequence.  But almost all  are irrational, and, for irrational , x_n never repeats itself – it is non-periodic.  This solution equation clearly demonstrates the two key features of chaos – stretching and folding: the factor 2^n shows the exponential growth of stretching, which results in sensitive dependence on initial conditions, while the squared sine function keeps x_n folded within the range .\n\nFor  an equivalent solution in terms of complex numbers instead of trigonometric functions is\n\nx_n=\\frac{-\\alpha^{2^n} -\\alpha^{-2^n} +2}{4}\n\nwhere  is either of the complex numbers\n\n\\alpha = \\frac{-8x_0 + 4 \\pm \\sqrt{(-8x_0 + 4)^2 - 16}}{4}\n\nwith modulus equal to 1. Just as the squared sine function in the trigonometric solution leads to neither shrinkage nor expansion of the set of points visited, in the latter solution this effect is accomplished by the unit modulus of .\n\nBy contrast, the solution when  is\n\nx_n = \\frac{1}{2} - \\frac{1}{2}(1-2x_0)^{2^{n}}\n\nfor x_0 \\in [0,1).  Since (1-2x_0)\\in (-1,1) for any value of x_0 other than the unstable fixed point 0, the term (1-2x_0)^{2^{n}} goes to 0 as  goes to infinity, so x_n goes to the stable fixed point .\n\nFinding cycles of any length when r \n 4For the r \n 4 case, from almost all initial conditions the iterate sequence is chaotic.  Nevertheless, there exist an infinite number of initial conditions that lead to cycles, and indeed there exist cycles of length  for all integers k\\geq 1.  We can exploit the relationship of the logistic map to the dyadic transformation (also known as the bit-shift map) to find cycles of any length.  If  follows the logistic map x_{n+1} = 4 x_n(1-x_n) and  follows the dyadic transformation\n\ny_{n+1}=\\begin{cases}2y_n & 0 \\le y_n \n\nthen the two are related by a homeomorphism\n\nx_{n}=\\sin^{2}(2 \\pi y_{n}).\n\nThe reason that the dyadic transformation is also called the bit-shift map is that when  is written in binary notation, the map moves the binary point one place to the right (and if the bit to the left of the binary point has become a \"1\", this \"1\" is changed to a \"0\").  A cycle of length 3, for example, occurs if an iterate has a 3-bit repeating sequence in its binary expansion (which is not also a one-bit repeating sequence): 001, 010, 100, 110, 101, or 011. The iterate 001001001... maps into 010010010..., which maps into 100100100..., which in turn maps into the original 001001001...; so this is a 3-cycle of the bit shift map.  And the other three binary-expansion repeating sequences give the 3-cycle 110110110... → 101101101... → 011011011... → 110110110....  Either of these 3-cycles can be converted to fraction form: for example, the first-given 3-cycle can be written as 1/7 → 2/7 → 4/7 → 1/7.  Using the above translation from the bit-shift map to the r = 4 logistic map gives the corresponding logistic cycle .611260467... → .950484434... → .188255099... → .611260467... .  We could similarly translate the other bit-shift 3-cycle into its corresponding logistic cycle.  Likewise, cycles of any length  can be found in the bit-shift map and then translated into the corresponding logistic cycles.\n\nHowever, since almost all numbers in [0, 1) are irrational, almost all initial conditions of the bit-shift map lead to the non-periodicity of chaos.  This is one way to see that the logistic r = 4 map is chaotic for almost all initial conditions.\n\nThe number of cycles of (minimal) length k1, 2, 3, \\ldots for the logistic map with r \n 4 (tent map with \\mu 2) is a known integer sequence : 2, 1, 2, 3, 6, 9, 18, 30, 56, 99, 186, 335, 630, 1161 ... This tells us that the logistic map with r \n 4 has 2 fixed points, 1 cycle of length 2, 2 cycles of length 3 and so on. This sequence takes a particularly simple form for prime : 2 (2^{k-1}-1)/k . For example: 2 (2^{13-1}-1)/13 = 630 is the number of cycles of length 13. Since this case of the logistic map is chaotic for almost all initial conditions, all of these finite-length cycles are unstable.\n\nUpper bound when  0 \\le r \\le 1\n\nAlthough exact solutions to the recurrence relation are only available in a small number of cases, a closed-form upper bound on the logistic map is known when  0 \\le r \\le 1. There are two aspects of the behavior of the logistic map that should be captured by an upper bound in this regime: the asymptotic geometric decay with constant r, and the fast initial decay when x_0 is close to 1, driven by the (1-x_n) term in the recurrence relation. The following bound captures both of these effects:\n\n \\forall n \\in \\{0, 1, \\dots \\} \\quad \\text{and} \\quad x_0, r \\in [0, 1], \\quad x_n \\le \\frac{x_0}{r^{-n} + x_0n}",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Logistic map" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18137" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The logistic map is a polynomial mapping (equivalently, recurrence relation) of degree 2, often cited as an archetypal example of how complex, chaotic behaviour can arise from very simple non-linear dynamical equations. The map was popularized in a seminal 1976 paper by the biologist Robert May, in part as a discrete-time demographic model analogous to the logistic equation first created by Pierre François Verhulst.\"\nMathematically, the logistic map is written\n\nwhere x_n is a number between zero and one that represents the ratio of existing population to the maximum possible population. The values of interest for the parameter   (sometimes also denoted ) are those in the interval [0, 4].\nThis nonlinear difference equation is intended to capture two effects:\n* reproduction where the population will increase at a rate proportional to the current population when the population size is small.\n* starvation (density-dependent mortality) where the growth rate will decrease at a rate proportional to the value obtained by taking the theoretical \"carrying capacity\" of the environment less the current population.\n\nHowever, as a demographic model the logistic map has the pathological problem that some initial conditions and parameter values lead to negative population sizes.  This problem does not appear in the older Ricker model, which also exhibits chaotic dynamics.\n\nThe r4 case of the logistic map is a nonlinear transformation of both the bit-shift map and the \\mu \n2 case of the tent map.\n\nBehavior dependent on \n\nThe image below shows the amplitude and frequency content of some logistic map iterates for parameter values ranging from 2 to 4.\n\nBy varying the parameter , the following behavior is observed:\n* With  between 0 and 1, the population will eventually die, independent of the initial population.\n* With  between 1 and 2, the population will quickly approach the value \\frac{r-1}{r}, independent of the initial population.\n* With  between 2 and 3, the population will also eventually approach the same value \\frac{r-1}{r}, but first will fluctuate around that value for some time. The rate of convergence is linear, except for r=3, when it is dramatically slow, less than linear (see Bifurcation memory).\n* With  between 3 and 1+\\sqrt{6}\\simeq 3.44949, from almost all initial conditions the population will approach  permanent oscillations between two values. These two values are dependent on .\n* With  between 3.44949 and 3.54409 (approximately), from almost all initial conditions the population will approach permanent oscillations among four values. The latter number is a root of a 12th degree polynomial .\n* With  increasing beyond 3.54409, from almost all initial conditions the population will approach oscillations among 8 values, then 16, 32, etc. The lengths of the parameter intervals that yield oscillations of a given length decrease rapidly;  the ratio between the lengths of two successive bifurcation intervals approaches the Feigenbaum constant \\delta \\simeq 4.66920.... This behavior is an example of a period-doubling cascade.\n* At r\\simeq 3.56995  is the onset of chaos, at the end of the period-doubling cascade. From almost all initial conditions, we no longer see oscillations of finite period.  Slight variations in the initial population yield dramatically different results over time, a prime characteristic of chaos.\n* Most values of  beyond 3.56995 exhibit chaotic behaviour, but there are still certain isolated ranges of  that show non-chaotic behavior; these are sometimes called islands of stability. For instance, beginning at 1+\\sqrt{8}Zhang, Cheng, \"Period three begins\", Mathematics Magazine 83, October 2010, 295-297. (approximately 3.82843) there is a range of parameters  that show oscillation among three values, and for slightly higher values of  oscillation among 6 values, then 12 etc.\n* The development of the chaotic behavior of the logistic sequence as the parameter  varies from approximately 3.56995 to approximately 3.82843 is sometimes called the Pomeau–Manneville scenario, characterized by a periodic (laminar) phase interrupted by bursts of aperiodic behavior. Such a scenario has an application in semiconductor devices.\n There are other ranges that yield oscillation among 5 values etc.; all oscillation periods occur for some values of .  A period-doubling window with parameter  is a range of -values consisting of a succession of sub-ranges.  The th sub-range contains the values of  for which there is a stable cycle (a cycle that attracts a set of initial points of unit measure) of period c2^{k}.  This sequence of sub-ranges is called a cascade of harmonics. In a sub-range with a stable cycle of period c2^{k^{*}}, there are unstable cycles of period c2^{k} for all k.  The  value at the end of the infinite sequence of sub-ranges is called the point of accumulation of the cascade of harmonics.  As  rises there is a succession of new windows with different  values.  The first one is for c \n 1; all subsequent windows involving odd  occur in decreasing order of  starting with arbitrarily large .  \n* Beyond r = 4, almost all initial values eventually leave the interval [0,1] and diverge.\nFor any value of  there is at most one stable cycle.  If a stable cycle exists, it is globally stable,  attracting almost all points.  Some values of  with a stable cycle of some period have infinitely many unstable cycles of various periods.\n\nThe  bifurcation diagram at right summarizes this. The horizontal axis shows the possible values of the parameter  while the vertical axis shows the set of values of  visited asymptotically from almost all initial conditions by the iterates of the logistic equation with that  value.\n\nThe bifurcation diagram is a self-similar: if you zoom in on the above-mentioned value r \\simeq 3.82843 and focus on one arm of the three, the situation nearby looks like a shrunk and slightly distorted version of the whole diagram. The same is true for all other non-chaotic points. This is an example of the deep and ubiquitous connection between chaos and fractals.\n\nChaos and the logistic map\n\nThe relative simplicity of the logistic map makes it a widely used point of entry into a consideration of the concept of chaos.  A rough description of chaos is that chaotic systems exhibit a great sensitivity to initial conditions—a property of the logistic map for most values of  between about 3.57 and 4 (as noted above).  A common source of such sensitivity to initial conditions is that the map represents a repeated folding and stretching of the space on which it is defined.  In the case of the logistic map, the quadratic difference equation describing it may be thought of as a stretching-and-folding operation on the interval (0,1).\n\nThe following figure illustrates the stretching and folding over a sequence of iterates of the map.  Figure (a), left, shows a two-dimensional Poincaré plot of the logistic map's state space for r=4, and clearly shows the quadratic curve of the difference equation ().  However, we can embed the same sequence in a three-dimensional state space, in order to investigate the deeper structure of the map.  Figure (b), right, demonstrates this, showing how initially nearby points begin to diverge, particularly in those regions of x_t corresponding to the steeper sections of the plot.\n\nThis stretching-and-folding does not just produce a gradual divergence of the sequences of iterates, but an exponential divergence (see Lyapunov exponents), evidenced also by the complexity and unpredictability of the chaotic logistic map.  In fact, exponential divergence of sequences of iterates explains the connection between chaos and unpredictability: a small error in the supposed initial state of the system will tend to correspond to a large error later in its evolution.  Hence, predictions about future states become progressively (indeed, exponentially) worse when there are even very small errors in our knowledge of the initial state. This quality of unpredictability and apparent randomness led the logistic map equation to be used as a pseudo-random number generator in early computers.\n\nSince the map is confined to an interval on the real number line, its dimension is less than or equal to unity. Numerical estimates yield a correlation dimension of 0.500 ± 0.005 (Grassberger, 1983), a Hausdorff dimension of about 0.538  (Grassberger 1981), and an information dimension of 0.5170976... (Grassberger 1983) for r\\simeq 3.5699456... (onset of chaos). Note: It can be shown that the correlation dimension is certainly between 0.4926 and 0.5024.\n\nIt is often possible, however, to make precise and accurate statements about the likelihood of a future state in a chaotic system.  If a (possibly chaotic) dynamical system has an attractor, then there exists a probability measure that gives the long-run proportion of time spent by the system in the various regions of the attractor.  In the case of the logistic map with parameter r 4 and an initial state in (0,1), the attractor is also the interval (0,1) and the probability measure corresponds to the beta distribution with parameters a \n 0.5 and b = 0.5. Specifically, the invariant measure is  \\pi ^{-1}x^{-1/2}(1-x)^{-1/2}.  Unpredictability is not randomness, but in some circumstances looks very much like it.  Hence, and fortunately, even if we know very little about the initial state of the logistic map (or some other chaotic system), we can still say something about the distribution of states arbitrarily far into the future, and use this knowledge to inform decisions based on the state of the system.\n\nSolution when  \n\nThe special case of  can in fact be solved exactly, as can the case with ; however, the general case can only be predicted statistically.  \nThe solution when  is,\nLorenz, Edward (1964), \"The problem of deducing the climate from the governing equations,\" Tellus 16 (February): 1-11.\n\nx_{n}=\\sin^{2}(2^{n} \\theta \\pi)\n\nwhere the initial condition parameter  is given by \\theta = \\tfrac{1}{\\pi}\\sin^{-1}(x_0^{1/2}).  For rational , after a finite number of iterations x_n maps into a periodic sequence.  But almost all  are irrational, and, for irrational , x_n never repeats itself – it is non-periodic.  This solution equation clearly demonstrates the two key features of chaos – stretching and folding: the factor 2^n shows the exponential growth of stretching, which results in sensitive dependence on initial conditions, while the squared sine function keeps x_n folded within the range .\n\nFor  an equivalent solution in terms of complex numbers instead of trigonometric functions is\n\nx_n=\\frac{-\\alpha^{2^n} -\\alpha^{-2^n} +2}{4}\n\nwhere  is either of the complex numbers\n\n\\alpha = \\frac{-8x_0 + 4 \\pm \\sqrt{(-8x_0 + 4)^2 - 16}}{4}\n\nwith modulus equal to 1. Just as the squared sine function in the trigonometric solution leads to neither shrinkage nor expansion of the set of points visited, in the latter solution this effect is accomplished by the unit modulus of .\n\nBy contrast, the solution when  is\n\nx_n = \\frac{1}{2} - \\frac{1}{2}(1-2x_0)^{2^{n}}\n\nfor x_0 \\in [0,1).  Since (1-2x_0)\\in (-1,1) for any value of x_0 other than the unstable fixed point 0, the term (1-2x_0)^{2^{n}} goes to 0 as  goes to infinity, so x_n goes to the stable fixed point .\n\nFinding cycles of any length when r \n 4For the r \n 4 case, from almost all initial conditions the iterate sequence is chaotic.  Nevertheless, there exist an infinite number of initial conditions that lead to cycles, and indeed there exist cycles of length  for all integers k\\geq 1.  We can exploit the relationship of the logistic map to the dyadic transformation (also known as the bit-shift map) to find cycles of any length.  If  follows the logistic map x_{n+1} = 4 x_n(1-x_n) and  follows the dyadic transformation\n\ny_{n+1}=\\begin{cases}2y_n & 0 \\le y_n \n\nthen the two are related by a homeomorphism\n\nx_{n}=\\sin^{2}(2 \\pi y_{n}).\n\nThe reason that the dyadic transformation is also called the bit-shift map is that when  is written in binary notation, the map moves the binary point one place to the right (and if the bit to the left of the binary point has become a \"1\", this \"1\" is changed to a \"0\").  A cycle of length 3, for example, occurs if an iterate has a 3-bit repeating sequence in its binary expansion (which is not also a one-bit repeating sequence): 001, 010, 100, 110, 101, or 011. The iterate 001001001... maps into 010010010..., which maps into 100100100..., which in turn maps into the original 001001001...; so this is a 3-cycle of the bit shift map.  And the other three binary-expansion repeating sequences give the 3-cycle 110110110... → 101101101... → 011011011... → 110110110....  Either of these 3-cycles can be converted to fraction form: for example, the first-given 3-cycle can be written as 1/7 → 2/7 → 4/7 → 1/7.  Using the above translation from the bit-shift map to the r = 4 logistic map gives the corresponding logistic cycle .611260467... → .950484434... → .188255099... → .611260467... .  We could similarly translate the other bit-shift 3-cycle into its corresponding logistic cycle.  Likewise, cycles of any length  can be found in the bit-shift map and then translated into the corresponding logistic cycles.\n\nHowever, since almost all numbers in [0, 1) are irrational, almost all initial conditions of the bit-shift map lead to the non-periodicity of chaos.  This is one way to see that the logistic r = 4 map is chaotic for almost all initial conditions.\n\nThe number of cycles of (minimal) length k1, 2, 3, \\ldots for the logistic map with r \n 4 (tent map with \\mu 2) is a known integer sequence : 2, 1, 2, 3, 6, 9, 18, 30, 56, 99, 186, 335, 630, 1161 ... This tells us that the logistic map with r \n 4 has 2 fixed points, 1 cycle of length 2, 2 cycles of length 3 and so on. This sequence takes a particularly simple form for prime : 2 (2^{k-1}-1)/k . For example: 2 (2^{13-1}-1)/13 = 630 is the number of cycles of length 13. Since this case of the logistic map is chaotic for almost all initial conditions, all of these finite-length cycles are unstable.\n\nUpper bound when  0 \\le r \\le 1\n\nAlthough exact solutions to the recurrence relation are only available in a small number of cases, a closed-form upper bound on the logistic map is known when  0 \\le r \\le 1. There are two aspects of the behavior of the logistic map that should be captured by an upper bound in this regime: the asymptotic geometric decay with constant r, and the fast initial decay when x_0 is close to 1, driven by the (1-x_n) term in the recurrence relation. The following bound captures both of these effects:\n\n \\forall n \\in \\{0, 1, \\dots \\} \\quad \\text{and} \\quad x_0, r \\in [0, 1], \\quad x_n \\le \\frac{x_0}{r^{-n} + x_0n}. Logistic map. http://en.wikipedia.org/?curid=18137."
  }
}
