{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7712",
  "eid" : "e2f7cda0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778460538,
  "textBody" : "The Continuation War (; ; 25 June 1941 – 19 September 1944) consisted of hostilities between Finland and the Soviet Union from 1941 to 1944. The Continuation War began 15 months after the end of the Winter War, which was also fought between Finland and the Soviet Union. In the Soviet Union, the war was considered part of the Great Patriotic War.Great Soviet Encyclopedia, Finland, Moscow, 1974.  Germany regarded its operations in the region as part of its overall war efforts on the Eastern Front, and it provided Finland with critical material support and military cooperation.\n\nActs of war between the Soviet Union and Finland recommenced on 22 June 1941, the day Germany launched its invasion of the Soviet Union. Open warfare began with a Soviet air offensive to Finland on 25 June. Subsequent Finnish operations undid its post-Winter War concessions to the Soviet Union on the Karelian Isthmus and Ladoga Karelia, and captured East Karelia by September 1941. On the Karelian Isthmus, the Finns halted their offensive 30 km from Leningrad, at the pre-World War II border between the Soviet Union and Finland. In 1944, Soviet air forces conducted air raids on Helsinki and other major Finnish cities. \n\nEventually, in mid-1944, the Soviet strategic offensive drove the Finns from most of the territories they had gained during the war, but the Finnish Army later brought the offensive to a standstill in July 1944. A ceasefire ended hostilities on 5 September and was followed by the Moscow Armistice on 19 September. The 1947 Paris peace treaty concluded the war formally. Finland ceded Pechengsky District to the Soviets, leased Porkkala peninsula to them and paid reparations, while retaining its independence.\n\nBackground\n\nWinter War\n\nOn 23 August 1939, the Soviet Union (USSR) and Germany signed the Molotov–Ribbentrop Pact, whereby the parties divided the independent countries of Finland, Estonia, Latvia, Lithuania, Poland, and Romania into spheres of interest, with Finland falling to the Soviet sphere of interest.Vehviläinen 2002, p. 30 Shortly afterward, Germany invaded Poland and, as a result, the United Kingdom and France declared war against Germany. The Soviet Union invaded eastern Poland on 17 September.Vehviläinen 2002, p. 31 Next, Moscow demanded that the Baltic states allow the establishment of Soviet military bases and the stationing of troops on their soil. The Baltic governments accepted these ultimatums, signing corresponding agreements in September and October.Vehviläinen 2002, p. 33\n\nIn October 1939, the Soviet Union attempted to negotiate with Finland for the cessation of Finnish territory on the Karelian Isthmus and the islands of the Gulf of Finland  and for the establishment of a Soviet military base near the Finnish capital of Helsinki.Vehviläinen 2002, p. 39 The Finnish government refused, and the Red Army invaded Finland on 30 November 1939.Vehviläinen 2002, p. 44 The USSR was expelled from the League of Nations and condemned by the international community for the illegal attack.Vehviläinen 2002, p. 49 Foreign support for Finland was planned, but very little actual help materialized, except from Sweden.Vehviläinen 2002, p. 65 The Moscow Peace Treaty concluded the 105-day Winter War on 13 March 1940 and started the Interim Peace.Vehviläinen 2002, p. 69 By the terms of the treaty, Finland ceded 11 per cent of its national territory and 13 percent of its economic capacity to the Soviet Union.Kirby 2006, p. 215 Finland avoided total conquest of the country by the Soviet Union and kept its sovereignty.Vehviläinen 2002, p. 70Before the war, Finland's foreign policy had been based on multilateral guarantees for support from the League of Nations and Nordic countries and was considered a failure.Vehviläinen 2002, p. 74 After the war, Finnish public opinion favored the reconquest of Finnish Karelia, the government declared national defence to be its first priority, and military expenditures rose to nearly half of public spending. Finland purchased and received donations of war materiel during and immediately after the Winter War. The Soviet Union had received a military base, which employed over 30,000 Soviet military personnel, in Hanko on Finland's southern coast near the capital Helsinki.Vehviläinen 2002, p. 75\n\nFinland resettled some 420,000 evacuees from the lost territories. To ensure food supply, it was necessary to clear new land for the evacuees to cultivate, facilitated by the Rapid Settlement Act. Finnish leadership wanted to preserve the spirit of unanimity that was commonly felt throughout the country during the Winter War. The divisive White Guard tradition of the Finnish Civil War's 16 May victory day celebration was therefore discontinued.Vehviläinen 2002, p. 76 Relations between Finland and the Soviet Union remained strained after the signing of the one-sided peace treaty, and there were disputes regarding the implementation of the treaty. Finland sought security against further territorial depredations by the USSR and proposed mutual defence agreements with Norway and Sweden, but these initiatives were quashed by Moscow.Vehviläinen 2002, p. 77Kirby 2006, p. 216\n\nGerman and Soviet expansion in Europe\n\nAfter the Winter War, Germany was not popular in Finland as it was considered an ally of the Soviet Union. However, the Finnish government began to restore diplomatic relations with Germany. Finland continued its Western-oriented policy and negotiated a war trade agreement with the United Kingdom. The agreement was renounced after the German invasion of Denmark and Norway on 9 April 1940, when Britain cut all trade and traffic communications with the Nordic countries. With the fall of France, a Western orientation was no longer considered an option in Finnish foreign policy.Vehviläinen 2002, p. 78 On 15 and 16 June, the Soviet Union occupied the Baltic states without resistance. Soviet puppet regimes were installed, and within two months Estonia, Latvia and Lithuania were incorporated as Soviet republics within the USSR. By mid-1940, the two remaining northern democracies, Finland and Sweden, were encircled by the hostile states of Germany and the Soviet Union.Vehviläinen 2002, p. 79\n\nOn 23 June, shortly after the Soviet occupation of the Baltic states began, Soviet Foreign Minister Vyacheslav Molotov contacted the Finns and demanded a mining licence for the Soviet Union at the nickel mines in Petsamo or, alternatively, establishing a joint Soviet-Finnish company to operate there. The licence to mine the deposit had earlier been granted to a British-Canadian company, and the proposition was rejected by Finland. The next month, the Soviets demanded that Finland destroy the fortifications built on the Åland islands and grant the USSR the right to use Finnish railways to transport Soviet troops to the newly-acquired Soviet base at Hanko. The Finns very reluctantly agreed to these demands.Vehviläinen 2002, p. 80 On 24 July, Molotov accused the Finnish government of persecuting the Finland–Soviet Union Peace and Friendship Society, a pro-communist group, and soon afterwards he publicly supported the group. The society organized demonstrations in Finland, some of which turned into riots.Vehviläinen 2002, p. 81Kirby 2006, p. 218\n\nSoviet sources maintain that Soviet policies up to the Continuation War were best explained as defensive measures by offensive means: The Soviet division of occupied Poland with Germany, the Soviet occupations of Lithuania, Latvia and Estonia, and the Soviet invasion of Finland in the Winter War are described as elements in the Soviets' construction of a security zone or buffer region between the perceived threat from the capitalist powers of Western Europe. The Soviet sources see the post-World War II establishment of Soviet satellite states in the Warsaw Pact countries and the Finnish-Soviet Agreement of Friendship, Cooperation, and Mutual Assistance as the conclusion of this Soviet defence plan.[http://www.aroundspb.ru/finnish/baryshnikov/pvp1932.php The problem of ensuring the security of Leningrad from the north in light of Soviet war planning of 1932–1941] by V. N. Baryshnikov: The actual war with Finland began first of all due to unresolved issues in Leningrad's security from the north and Moscow's concerns for the perspective of Finland's politics. At the same time, a desire to claim better strategic positions in case of a war with Germany had surfaced within the Soviet leadership.[http://www.aroundspb.ru/finnish/kozlov/part_01.php Финская война. Взгляд \"с той стороны\"] (\"The Finnish war. A look from the 'other side'\") by A. I. Kozlov: \"After the rise of National Socialism to power in Germany, the geopolitical importance of the former 'buffer states' had drastically changed. Both the Soviet Union and Germany vied for the inclusion of these states into their spheres of influence. Soviet politicians and military considered it likely, that in case of an aggression against the USSR, German armed forces will use the territory of the Baltic states and Finland as staging areas for invasion—by either conquering or coercing these countries. None of the states of the Baltic region, excluding Poland, had sufficient military power to resist a German invasion\". Stalin's Missed Chance, by Mikhail Meltyukhov: \"The English–French influence in the Baltics, characteristic for the '20s–early '30s was increasingly limited by the growth of German influence. Due to the strategic importance of the region, the Soviet leadership also aimed to increase its influence there, using both diplomatic means as well as active social propaganda. By the end of the '30s, the main contenders for influence in the Baltics were Germany and the Soviet Union. Being a buffer zone between Germany and the USSR, the Baltic states were bound to them by a system of economic and non-aggression treaties of 1926, 1932 and 1939\". Western historians, such as Norman Davies and John Lukacs, dispute this view and describe the pre-war Soviet policy as an attempt to stay out of the war and regain land lost after the fall of the Russian Empire.Norman Davies, Europe at War 1939–1945: No Simple Victory, 2007, \n\nRelations between Finland, Germany and the USSR\n\nOn 31 July 1940, German leader Adolf Hitler gave the order to start planning an assault on the Soviet Union. This meant that Germany had to reassess its position regarding both Finland and Romania. Until then, Germany had rejected Finnish appeals to purchase arms, but in August, Germans allowed the secret sale of weapons to Finland. Military authorities made an agreement on 12 September, and an official exchange of diplomatic notes was sent on 22 September. At the same time, German troops were allowed transit through Sweden and Finland.Kirby 2006, p. 220 In practice, this meant Germany had redrawn the border of German and Soviet spheres of influence.Vehviläinen 2002, p. 83\n\nDue to the new situation, Molotov visited Berlin on 12–13 November.Kirby 2006, p. 219 He wanted Germany to withdraw its troops from Finland and stop enabling Finnish anti-Soviet sentiments. He also reminded the Germans of the 1939 Soviet–German non-aggression pact. Hitler asked how the USSR planned to settle the \"Finnish question\". Molotov answered that it would happen in the same manner as in Bessarabia and the Baltic states. Hitler rejected this.Vehviläinen 2002, p. 84 In December, the Soviet Union, Germany and the United Kingdom all voiced opinions concerning suitable Finnish presidential candidates. Risto Ryti was the only candidate none of the three powers objected to and he was elected on 19 December.Vehviläinen 2002, p. 85\n\nIn January 1941, the USSR demanded control of the Petsamo mining area. Finland rejected the proposition as it had a rebuilt defence force and was encouraged by Germany to reject the Soviet demand. On 18 December 1940, Hitler officially approved Operation Barbarossa, the German invasion of the Soviet Union.Kirby 2006, p. 221 He expected both Finland and Romania to join the German campaign.Vehviläinen 2002, p. 86 Two days earlier, Finnish Major General Paavo Talvela had met German Colonel General Franz Halder and, a couple of days later, Reichsmarschall Hermann Göring, in Berlin. This was the first time the Germans advised the Finns, in carefully couched diplomatic terms, that they were preparing for a war with the Soviet Union. Outlines of the actual plan were revealed in January 1941 and regular contacts between Finnish and German military leaders started in February.\n\nIn the late spring of 1941, the USSR made a number of goodwill gestures to prevent Finland from completely falling under German influence. Ambassador Ivan Zotov was replaced with the more flexible Pavel Orlov. Furthermore, the Soviet government announced that it no longer opposed a rapprochement between Finland and Sweden. These conciliatory measures, however, did not have any effect on Finnish policy.Vehviläinen 2002, p. 87 Finland wished to re-enter World War II mainly because of the Soviet invasion of Finland during the Winter War, which had taken place after Finnish intentions of relying on the League of Nations and Nordic neutrality to avoid conflicts had failed from lack of outside support.Lunde 2011, p. 9 Finland primarily aimed to reverse its territorial losses from the March 1940 Moscow Peace Treaty and, depending on the success of the German invasion of the Soviet Union, to possibly expand its borders, especially into East Karelia. Some right-wing groups, such as the Academic Karelia Society, supported a Greater Finland ideology.Jokipii 1999, pp. 145–16\n\nOn 20 May, the Germans invited some Finnish officers to discuss the coordination of Operation Barbarossa. The participants met on 25–28 May in Salzburg and Berlin, and continued their meeting in Helsinki from 3 to 6 June. They agreed upon the arrival of German troops, Finnish mobilization, and a general division of operations. They also agreed that the Finnish Army would start mobilization on 15 June, but the Germans did not reveal the final date for the assault. The Finnish decisions were made by a small group of political and military leaders; the rest of the government was largely kept in the dark. The government was not informed until 9 June that the country would start mobilization of reservists due to tensions between Germany and the Soviet Union. Finland never signed the Tripartite Pact, which was signed by all de jure Axis powers. The Finns and Mannerheim, in particular, clearly stated they would fight against the Soviets only to the extent necessary to redress the balance of the 1940 treaty. For Hitler the matter was irrelevant; he saw Finland as an ally.Vehviläinen 2002, p. 102\n\nOpposing forces\n\nSoviet order of battle \n\nThe Northern Front of the Leningrad Military District had 18 divisions in the Finnish region. Furthermore, the USSR required its best units and latest materiel on the central European fronts.Vehviläinen 2002, p. 91 The 23rd Army was positioned on the Karealian Isthmus, Ladoga Karelia was defended by the 7th Army and the 14th Army was deployed at the Murmansk–Salla area of Lapland. The bulk of the Soviet forces was reinforced with around 40 separate battalions. As the initial devastating German strike against the Soviet Air Forces did not affect air units located near Finland, it could deploy around 700 aircraft supported by some Soviet Navy wings.Jokipii 1999, p. 301\n\nFinnish and German order of battle \n\nThe Finnish Army mobilised 500,000 men in 14 divisions and 3 brigades for the invasion, commanded by Field Marshal Mannerheim independently of . The army was organised as follows:\n\n* II Corps and IV Corps were deployed to the Karelian Isthmus and comprised seven infantry divisions.\n* Army of Karelia was positioned in north of Lake Ladoga and led by General Erik Heinrichs. It comprised VI Corps, VII Corps and Group Oinonen; a total of seven divisions, including the German 163rd Infantry Division, and three brigades.\n* 14th Division in the Kainuu region, commanded directly by Finnish Headquarters.\n\nFrom a German perspective, the Finnish Army was to attack south on both sides of Lake Ladoga to pressure Leningrad and thus support Army Group North. The army, especially its artillery, was stronger than it had been during the Winter War but included only one armoured battalion and had a general lack of motorised transportation.Vehviläinen 2002, p. 90\n\nThe 67,000 German soldiers in 4 divisions deployed under the Army of Norway took responsibility for an approximately 500 km-long stretch of the Arctic front in Finnish Lapland with the mission of striking Murmansk and the Kirov Railway. The Army of Norway, under  control, was organised into Mountain Corps Norway and XXXVI Mountain Corps with the Finnish Finnish III Corps and 14th Division attached to it.Vehviläinen 2002, p. 90 Oberkommando der Luftwaffe () assigned Luftflotte 5 (Air Fleet 5) to provide modest support to the Army of Norway and the Finnish Army in addition to its main task of Norway's air defence.\n\nFinnish offensive phase in 1941 \n\nInitial operations\n\nIn the late hours of 21 June 1941, German minelayers hiding in the Archipelago Sea laid two large minefields across the Gulf of Finland. Nordberg, Erkki, Arvio ja ennuste Venäjän sotilaspolitiikasta Suomen suunnalla, 2003, Encyclopædia Britannica Premium, 2006, [http://www.britannica.com/EBchecked/topic/207424/Finland Finland] Later the same night, German bombers flew along the Gulf of Finland to Leningrad and mined the harbour and the river Neva. On the return trip, these bombers landed for refueling in Utti, Finland. In the early hours of 22 June, Finnish forces launched Operation Kilpapurjehdus, which deployed troops to the demilitarized Åland Islands. An international treaty on the status of the islands called for Finland to defend them in case of the threat of an attack. However, the operation was coordinated with the German invasion, and the personnel of the Soviet consulate there were arrested. According to Finnish historian Mauno Jokipii, Finland knew that it had violated international protocol.Jokipii 1999, p. 282\n\nAfter Axis powers launched Operation Barbarossa around 3:15 a.m. on 22 June 1941, the Soviet Union commenced an airstrike on Finland with 7 bombers, as reported at 6:06 a.m. by coastal defence ship Väinämöinen. On the morning of 25 June, the Soviet Union launched another air offensive with 460 fighters and bombers targeting 19 airfields in Finland. Inaccurate intelligence and poor bombing accuracy caused several raids to hit Finnish cities or municipalities with considerable damage. 23 Soviet bombers were lost while the Finns did not lose aircraft. The USSR stated that the airstrikes were directed against German targets, especially airfields, in Finland. The bombings offered the Finnish government a ground for claiming that the country had become the target of a new assault, and the Finnish Parliament approved a \"defensive war\" as a fait accompli.Vehviläinen 2002, p. 88 According to historian David Kirby, the message was intended more for public opinion in Finland than abroad, where it was seen that the country was in the Axis camp.Kirby 2006, p. 222\n\nFinnish advance in Karelia\n\nThe Finnish plans for the offensive in Ladoga Karelia were completed on 28 June.Lunde (2011) pp. 154–59 On 10 July, the Finnish Army began its invasion and by 16 July, the VI Corps reached the northern shore of Lake Ladoga and cut the defending Soviet 7th Army in two, hindering the defence of the area. The USSR struggled to contain the German invasion, and soon the Soviet high command Stavka had to call all available units stationed along the Finnish border to the rapidly deteriorating front line. Moreover, the 237th Infantry Division and, excluding the 198th Motorized Division, the Soviet 10th Mechanized Corps were withdrawn from Ladoga Karelia, thus stripping most of the reserves from the remaining defending Soviet units.The Finnish II Corps started its offensive at the northern region of the Karelian Isthmus on 31 July.Lunde (2011) pp. 167–72 Finnish troops reached the shores of Lake Ladoga on 9 August, surrounding most of three defending Soviet divisions on the northwestern coast of the lake; the divisions were evacuated across the lake. On 22 August, the Finnish IV Corps started its offensive south of the II Corps and advanced towards Vyborg (). By 23 August, the II Corps had reached the Vuoksi River from the east and continued to surround the Soviet forces defending Vyborg. The Soviet order to withdraw came too late, and the Soviet divisions lost much of their equipment, although a sizable portion of their manpower was later evacuated via the Koivisto Islands. The mauled Soviet 23rd Army was unable to halt the offensive, and by 2 September the Finnish Army had reached the old 1939 border along its whole length. The Soviet Northern Front was split into the Leningrad Front and the Karelian Front. On 31 August, Finnish Headquarters ordered the II and IV Corps, which had advanced the furthest, to halt their offensive and form up for defence after reaching a line, that ran from the Gulf of Finland via Beloostrov–Sestra River–Okhta River–Lembolovo to Ladoga, just past the former border  from central Leningrad. On 1 September, the IV Corps defeated the Soviet 23rd Army at the Battle of Porlampi. Sporadic fighting continued around Beloostrov until the Soviets managed to force the Finns out from it on 20 September. The front on the Isthmus stabilized and the Siege of Leningrad began.Luknitsky 1988, p. 72Salisbury 2003, p. 246Werth 1999, pp. 360–61\n\nThe Finnish Army of Karelia started its attack in East Karelia towards Petrozavodsk, Lake Onega, and the Svir River on 9 September. The German Army Group North advanced from the south of Leningrad towards the Svir River and managed to capture Tikhvin before Soviet counterattacks forced the Germans to withdraw to the Volkhov River. Soviet forces also made several attempts to force the Finns out from their bridgehead south of the Svir during October and December, but the efforts were blocked by the Finns. Soviet units attacked the German 163rd Infantry Division In October 1941, which was operating under Finnish command across the Svir in October 1941, but the attacking force was pushed back soon after. The Finnish advance in East Karelia was halted on 6 December 1940. During the campaign from June to December, the Finns had suffered 75,000 casualties, of whom 26,355 had died, while the Soviets had 230,000 casualties, of whom 50,000 became prisoners of war.\n\nOperation Silver Fox in Lapland\n\nThe German objective in Finnish Lapland was to take Murmansk and cut the Kirov Railway running from Murmansk to Leningrad by capturing Salla and Kandalaksha. Murmansk was the only year-round ice-free port in the north and a threat to the nickel mine at Petsamo. The joint Finnish–German Operation Silver Fox (; ) was started on 29 June 1940 by the German Army of Norway, which had the Finnish 3rd and 6th Divisions under its command, against the defending Soviet 14th Army and 54th Rifle Division. By November, the operation had stalled 30 km away from the Kirov Railway due to ill-suited German troops, heavy Soviet resistance, poor terrain and arctic weather as well as diplomatic pressure by the United States (US) on the Finns warning about disrupting the lend-lease deliveries to Murmansk. The offensive and its three sub-operations failed to achieve their objectives. Both sides dug in and the Arctic theatre remained stable, excluding minor skirmishes, until the Soviet Petsamo–Kirkenes Offensive in October 1944. The crucial lend-lease shipments from the US via Murmansk and Kirol Railway to the bulk of the Soviet forces continued throughout World War II.Vehviläinen 2002, p. 95\n\nPolitics and international relations\n\nThe Wehrmacht advanced rapidly deep into Soviet territory during the first weeks of the Operation Barbarossa campaign. The Finns believed Germany would defeat the Soviet Union quickly. President Ryti envisioned a Greater Finland, where Finland and other Finnic people would live inside a \"natural defence borderline\" by incorporating the Kola Peninsula, East Karelia, and perhaps even northern Ingria. In public, the proposed frontier was introduced with the slogan \"short border, long peace.\"Vehviläinen 2002, p. 92 Some members of the Finnish Parliament, such as the Social Democratic Party and the Swedish People's Party, opposed the idea, arguing that maintaining the 1939 frontier would be enough. On 10 July, Finnish Commander-in-Chief, Field Marshal C. G. E. Mannerheim, drafted his order of the day, the Sword Scabbard Declaration, in which he pledged to liberate Karelia. The Finnish government assured the United States that it was unaware of the order.Kirby 2006, p. 224 According to Finnish historian Olli Vehviläinen, most Finns thought that the scope of the new offensive was only to regain what had been wrongly taken in the Winter War.Vehviläinen 2002, p. 89  \n\nBy the autumn of 1941 it was clear that Barbarossa would not accomplish its goals, and Finnish military leadership started to doubt Germany's capability to finish the war quickly. The Finnish Defence Forces suffered relatively severe losses during their advance, and, overall, German victory became uncertain as German troops were halted near Moscow. German troops in northern Finland faced circumstances they were not properly prepared for, and likewise failed to reach their targets. As the front lines stabilized, Finland sent out feelers for peace to the USSR several times.Jutikkala 1988, p. 248  The Finnish economy suffered from lack of labour, food shortages and increased price ratios. The Finnish government had to demobilize a part of the army to prevent the industrial and agricultural production from collapsing.Vehviläinen 2002, p. 96 In October, Finland informed Germany that it would need 175000 ST of grain to manage until next year's harvest. The German authorities would have rejected the request, but Hitler himself agreed. Annual grain deliveries of 200000 ST equaled almost half of the Finnish domestic crop. In November, Finland joined the Anti-Comintern Pact.Vehviläinen 2002, p. 101\n\nFinland maintained good relations with the Western powers. Foreign volunteers from Sweden and Estonia were among the internationals who joined Finnish ranks. The Finnish government stressed that Finland was fighting as a co-belligerent with Germany against the USSR only to protect itself. Furthermore, Finland stressed that it was still the same democratic country as it had been in the Winter War. However, on 12 July 1941, the United Kingdom signed an agreement of joint action with the Soviet Union. Under German pressure, Finland had to close the British legation in Helsinki. As a result, diplomatic relations between Finland and the United Kingdom were broken on 1 August.Vehviläinen 2002, p. 97 On 28 November, Britain presented Finland an ultimatum demanding that Finland cease military operations by 3 December. Unofficially, Finland informed the Western powers that Finnish troops would halt their advance in the next few days. The reply did not satisfy the United Kingdom, declaring war on Finland on 6 December. The Commonwealth states of Canada, Australia, British Raj and New Zealand followed suit.Vehviläinen 2002, p. 100 The most sizeable British action on Finnish soil was the Raid on Kirkenes and Petsamo, an aircraft carrier strike on German and Finnish ships on 31 July 1941.FAA archive: [http://www.fleetairarmarchive.net/RollofHonour/Battlehonour_crewlists/Petsamo_Kirkenes_1941.html Raid on Petsamo]  The attack achieved little, except the loss of three British aircraft, but it was intended to demonstrate British support for its Soviet ally. Later in 1941, Hawker Hurricanes of No. 151 Wing RAF, based at Murmansk, provided local air cover for Soviet troops and fighter escorts for Soviet bombers.The Royal Air Force in Russia :[http://ww2airfronts.org/Theaters/eto/rinr/pages/rinr-1.html Hurricanes at Murmansk]  \n\nRelations between Finland and the United States were more complex; the US public was sympathetic to the \"brave little democracy\" and had anti-communist sentiments. At first, the United States empathised with the Finnish cause, but the situation became problematic after the Finnish Army crossed the 1939 border.Vehvilainen 2002, p. 98 Finnish and German troops were a threat to the Kirov Railway and the northern supply line between the Western Allies and the Soviet Union.Vehviläinen 2002, p. 98 On 25 October 1941, the US demanded that Finland cease all hostilities against the USSR and withdraw behind the 1939 border. In public, President Ryti rejected the demands, but in private, he wrote to Mannerheim on 5 November asking him to halt the offensive. Mannerheim agreed and secretly instructed General Hjalmar Siilasvuo to break off the assault against the Kirov Railway.Vehviläinen 2002, p. 99\n\nTrench warfare phase during 1942–43 \n\nUnconventional warfare and military operations \n\nUnconventional warfare was fought in both the Finnish and Soviet wilderness. Finnish long-range reconnaissance patrols, organized both by the Intelligence Division's Detached Battalion 4 and by local units, patrolled beyond Soviet lines.  Soviet partisans, both resistance-bred and regular long-range patrol formations, conducted a number of operations in Finland and in Eastern Karelia from 1941 to 1944. In summer 1942, the USSR formed the 1st Partisan Brigade. The unit was 'partisan' in name only, as it was essentially 600 men and women on long-range patrol intended to disturb Finnish operations. The 1st Partisan Brigade was able to infiltrate beyond Finnish patrol lines, but was intercepted and rendered ineffective in August 1942 at Lake Segozero. Irregular partisans distributed propaganda newspapers, such as Pravda in Finnish. Yuri Andropov, later Soviet politician, took part in the partisan guerrilla actions.[http://www.hrono.ru/biograf/andropov.html Andropov Yuri Vladimirovich]. Biography. Finnish sources state that the Soviet partisan activity in East Karelia disrupted Finnish military supply and communication assets, but that almost two thirds of the attacks targeted civilians, killing 200 and injuring 50, including children and elderly. Eino Viheriävaara, Partisaanien jäljet 1941–1944. Oulun Kirjateollisuus Oy, 1982. Erkkilä, Veikko, Vaiettu sota (\"The Silenced War\"). Arator Oy. Lauri Hannikainen, (1992). Implementing Humanitarian Law Applicable in Armed Conflicts: The Case of Finland, Martinuss Nijoff Publishers, Dordrecht. . Tyyne Martikainen, (2002). Partisaanisodan siviiliuhrit, PS-Paino Värisuora Oy. .\n\nAlthough military operations during 1942 and 1943 were limited, the front did see some action. In early 1942, the Soviet Karelian Front attempted to retake Medvezhyegorsk, which had been lost to the Finns in late 1941. As spring came, the Soviet forces also went on the offensive on the Svir River front as well as in the Kestenga region further north. All Soviet offensives started promisingly, but due either to the Soviets overextending their lines or stubborn defensive resistance, the Soviet offensives were halted and repulsed. After Finnish and German counterattacks in Kestenga, the front lines had moved very little from their stabilized states. In September 1942, the Soviets attacked again at Kriv near Medvezhyegorsk, but despite five days of fighting, the Soviets managed to push the Finnish lines back only 500 m on a roughly 1 km-long stretch of the front.\n\nOn the Baltic Sea, the Soviet Baltic Fleet still operated from the besieged city of Leningrad. In early 1942, Soviet forces recaptured the island of Gogland, but lost both Gogland and Bolshoy Tyuters islands to the Finns later in spring 1942. During the winter between 1941 and 1942, the Soviet Baltic Fleet decided to use their large submarine fleet to carry the fight to the enemy. Though initial submarine operations in the summer of 1942 were successful, the German Kriegsmarine and Finnish Navy soon stepped up their anti-submarine efforts, making Soviet submarine operations later in 1942 costly. The underwater offensive carried out by the Soviets convinced the Germans to lay anti-submarine nets as well as supporting minefields between Porkkala and Naissaar, which proved to be an insurmountable obstacle for Soviet submarines. On the Arctic Ocean, Finnish radio intelligence intercepted Allied messages on supply convoys to Murmansk, such as PQ-17 and PQ-18, and relayed the information to Abwehr, German intelligence, for counter-action.Ahtokari, Reijo and Pale, Erkki: Suomen Radiotiedustelu 1927–1944 (Finnish radio intelligence 1927–1944), Helsinki, Hakapaino Oy, pp. 191–98, \n\nFinnish military administration and concentration camps\n\nOn 19 July 1941, the Finns set up military administration in occupied East Karelia. The goal of the administration was to prepare the region for eventual incorporation into Finland. In the early stages, the Finns aimed at ethnic cleansing where the Russian population would be expelled from the area once the war was over. They would be replaced with Finnic peoples, such as Karelians, Finns, Estonians, Ingrians and Vepsians. The Russian population was deemed \"non-national\".Kirby 2006, p. 225 Most of the East Karelian population had been evacuated before the Finnish forces arrived, but about 85,000 people—mostly elderly, women, and children—were left behind, and less than half of them were Karelians. A significant number of civilians, almost 30 per cent of the remaining Russians, were interned at concentration camps.\n\nThe winter between 1941 and 1942 was an ordeal for the Finnish urban population, due to poor harvests and a shortage of agricultural labourers. For the Russians in Finnish concentration camps, it was disastrous. More than 3,500 people died, mostly from starvation, amounting to 13.8 per cent of the detained, while the corresponding figure for the free population of the occupied territories was 2.6 per cent, and 1.4 per cent for Finland.Vehviläinen 2002, p. 107 Conditions gradually improved, ethnic discrimination in wage levels and food rations was terminated, and new schools were established for the Russian-speaking population the following year after Commander-in-Chief Mannerheim called for the International Committee of the Red Cross from Geneva to inspect the camps.Kirby 2006, p. 226 By the end of the occupation, mortality rates dropped to the same levels as in Finland.\n\nJews in Finland\n\nFinland had a small Jewish population of approximately 2,300 people. They had full civil rights and fought with other Finns in the ranks of the Finnish Army. The field synagogue in East Karelia was one of the very few functioning synagogues on the Axis side during the war. There were several cases of Jewish officers of the Finnish Army being awarded the German Iron Cross, which they declined. German soldiers were treated by Jewish medical officers—who sometimes saved the soldiers' lives. Rautkallio, Hannu, Suomen juutalaisten aseveljeys (Finnish Jews as German Brothers in Arms), Tammi, 1989Tuulikki Vuonokari (2003), Jews in Finland During the Second World War, Finnish Institutions Student Paper: FAST Area Studies Program Department of Translation Studies, University of Tampere, Autumn 2003 . Retrieved 2009-02-06.Poljakoff in Torvinen, Kadimah: Suomen juutalaisten historia 35 Smolar 155–57Torvinen, Taimi, Kadimah: Suomen juutalaisten historia Helsinki: Otava, 1989 [http://www.uta.fi/FAST/FIN/HIST/tv-jews.html pp. 117–67] . Retrieved 2009-02-06. German command mentioned Finnish Jews at the Wannsee Conference in January 1942, wishing to transport them to the Majdanek concentration camp in occupied Poland. SS leader Heinrich Himmler also raised the topic of Finnish Jews during his visit in Finland in the summer of 1942; Finnish Prime Minister Jukka Rangell replied that Finland did not have a \"Jewish question.\" In November 1942, however, the Finns handed eight Jewish refugees over to the Gestapo, raising protests among the Finnish Social Democrat Party ministers. No more refugees were transferred to the German detainmentVehviläinen 2002, p. 103 while over 500 Jewish refugees were granted asylum. The Finnish government did not take any anti-Jewish measures beyond the aforementioned despite repeated requests from Germany.[https://query.nytimes.com/gst/fullpage.html?res=9B0DE6DA1038F93BA35756C0A961948260 Letter to the New York Times by Mark Cohen, Executive Director of Holocaust Publications in New York, 28 April, 1987]\n\nSoviet offensive phase in 1944 \n\nAir raids and political development\n\nFinland began to actively seek a way out of the war after the disastrous German defeat at the Battle of Stalingrad in February 1943. Prime Minister Edwin Linkomies formed a new cabinet in March 1943 with peace as the top priority. Negotiations were conducted intermittently during 1943–1944 between Finland, the Western Allies and the USSR, but no agreement was reached. Stalin decided to force Finland to surrender with a bombing campaign on Helsinki starting in February 1944. It included three major air attacks with a total of over 6,000 sorties. Finnish anti-aircraft defence managed to repel the raids as only five per cent of the dropped bombs hit their planned targets. For example in Helsinki, searchlights and fires were placed as decoys outside the city to lure Soviet bombers to drop their payloads in what were actually unpopulated areas. Major air attacks also hit Oulu and Kotka, but pre-emptive radio intelligence and effective defence kept the number of casualties small. Meanwhile, the persistent German and Estonian defence in Narva from February to August eliminated Soviet-occupied Estonia as a favourable base for amphibious invasions and air attacks against Helsinki and other Finnish coastal cities tu support a land offensive. Field Marshal Mannerheim had repeatedly reminded the German command that in case their troops in Estonia retreated, Finland would be forced to make peace even on extremely unfavourable terms.Howard D. Grier. Hitler, Dönitz, and the Baltic Sea, Naval Institute Press, 2007, . [https://books.google.com/books?idu4IbqxEQeBMC&sig\nACfU3U1y5qvHJPiPkpX74WKLzPbPX7KK5g&pgPA121#PPA121,M1 p. 121] Thus, Finland terminated peace negotiations in April 1944 because the terms of the USSR were deemed impossible to fulfill.Gebhardt 1989, p. 1\n\nVyborg–Petrozavodsk Offensive \n\nOn 9 June 1944, the Soviet Leningrad Front launched a strategic offensive against Finnish positions on the Karelian Isthmus and in the area of Lake Ladoga, timed to accompany the Allied Operation Overlord in Normandy, France.Declaration of the Three Powers, December 1, 1943, Tehran Conference On the -wide breakthrough segment, the Red Army concentrated 3,000 guns and mortars. In some places, the concentration of artillery pieces exceeded 200 guns for every kilometre of the front or one for every 5 m. Soviet artillery fired over 80,000 rounds along the front on the Karelian Isthmus. On the second day of the offensive, the artillery barrages and superior number of Soviet forces crushed the main Finnish defence line. The Red Army penetrated the second line of defence, Vammelsuu–Taipale line (VT line), by the sixth day and recaptured Vyborg almost without a fight by 20 June. The Soviet breakthrough on the Karelian Isthmus forced the Finns to reinforce the area. This allowed the parallel Soviet offensive in East Karelia by the Karelian Front to meet less resistance and to recapture Petrozavodsk by 28 June 1944. The main objective of the Soviet strategic offensive was to force Finland out from the war.Erickson 1993, p. 197Gebhardt 1989, p. 2Glantz 1998, p. 202\n\nOn 25 June, the Red Army reached the third line of defence, the Viipuri–Kuparsaari–Taipale line (VKT line), and the decisive Battle of Tali-Ihantala began, described as the largest battle in Nordic military history. At this point, the Finnish Army had retreated around  to approximately the same line of defence they had held at the end of the Winter War. Finland especially lacked modern anti-tank weaponry that could stop Soviet heavy armour, such as the KV-1 or IS-2. Thus, German Foreign Minister Joachim von Ribbentrop offered German hand-held Panzerfaust and Panzerschreck antitank weapons in exchange for a guarantee that Finland would not seek a separate peace with the USSR. On 26 June, President Risto Ryti gave the guarantee as a personal undertaking, which he, Field Marshal Mannerheim and Prime Minister Edwin Linkomies intended to legally last only for the remainder of Ryti's presidency. In addition to delivering thousands of anti-tank weaponry, Hitler sent Wehrmacht's 122nd Infantry Division and the half-strength 303rd Assault Gun Brigade armed with Sturmgeschütz III tank destroyers as well as Luftwaffe's Detachment Kuhlmey to provide temporary support in the most vulnerable sectors. With the new supplies and assistance from Germany, the Finnish Army halted the numerically and materially superior Soviet advance in Tali-Ihantala on 9 July 1944 and the front stabilized once again.[https://books.google.com/books?id\nBg8drRyDGhEC&pgPA184 500 Days: The War in Eastern Europe ... – Google Books][https://books.google.com/books?idp58vtOKyVy8C&pg\nPA14 Finland at War 1939–45 – Google Books][https://books.google.com/books?id\nDh6jydKXikoC&pg=PA467 Dictionary of Battles and Sieges: F–O – Google Books]\n\nA few battles were fought in the latter stages of the war. The last of them was the Battle of Ilomantsi, a Finnish victory, from 26 July to 13 August 1944.Moisala 1988Lunde 2011, p. 299 The struggle to contain the Soviet offensive was exhausting Finnish resources. The German support under the Ryti-Ribbentrop Agreement had prevented a disaster, but it was asserted that the country would not be able to hold off against another major offensive.Grier 2007, p. 31 Soviet victories against German Army Groups Center and North during Operation Bagration made the situation even more dire for Finland. With no imminent threat of Soviet assaults, Finland decided to seek a way out of the war.Erickson 1993, pp. 329–30Glantz 1998, p. 229 On 4 August, President Ryti resigned and Field Marshal Mannerheim was chose as the new president. He annulled the agreement between Ryti and Ribbentrop in mid-August to allow Finland to sue for peace with the USSR again. The peace terms from Moscow arrived in late August.Glantz 1998, pp. 201–03\n\nPeace \n\nSeveral Western historians state that Soviet designs for Finland were no different from their designs for the Baltic countries. American political scientist Dan Reiter asserts that for Moscow the control of Finland was necessary. Reiter and British historian Victor Rothwell both quote Molotov telling his Lithuanian counterpart, at the time when Lithuania was effectively absorbed into the USSR, that minor countries, such as Finland, \"will be included within the honourable family of Soviet peoples.\"Dan Reiter, How Wars End, Princeton University Press, Princeton, New Jersey USA (2009), p. 131. Russian historian Nikolai Baryshnikov disputes the view that the Soviet Union wanted to deprive Finland of its independence. He argues that there is no documentary evidence for such claims and that the Soviet government was always open for negotiations. Baryshnikov cites, for example, the former public information chief of Finnish Headquarters, Major Kalle Lehmus, to show that Finland's leadership learned of the limited Soviet plans for Finland at least by July 1944 after intelligence indicated that some Soviet divisions were to be transferred to reserve in Leningrad.Baryshnikov (2002), pp. 222–23 (Section heading \"Стремительный прорыв,\" paragraph #48 et seq., after cit. 409)Baryshnikov (2006) Reiter states that the fear of severe losses pushed Stalin to accept a limited outcome in the war rather than pursue annexation although some Soviet documentation called for military occupation of Finland.Dan Reiter, How Wars End, Princeton University Press, Princeton, NJ (2009), pp. 138, 135. He argues that the Finnish victory at the Battle of Ilomantsi persuaded the USSR to give up their plan for an unconditional surrender of the Finns.Dan Reiter, How Wars End, Princeton University Press, Princeton, NJ (2009), p. 136.\n\nAftermath and casualties\n\nA sizeable number of civilians who had been displaced after the Winter War had moved back into Karelia during the Continuation War. They had to be evacuated again; of the 260,000 civilians who had moved back into the Karelia, only 19 chose to remain and become Soviet citizens. Most of the Ingrian Finns together with Votes and Izhorians living in German-occupied Ingria had been evacuated to Finland in 1943–1944. After armistice, Finland was forced to return the evacuees.Taagepera (2013), p. 144 Soviet authorities did not allow the 55,733 returnees to settle back in Ingria and instead deported them to central regions of the USSR.Scott and Liikanen (2013), pp. 59–60\n\nThe number of Soviet prisoners of war in Finland was estimated to be around 64,000. Of these, 56,000 were captured in 1941.Juutilainen & Leskinen (ed.); Kujansuu, Juha (2005), p. 1036 Around 2,600 to 2,800 Soviet prisoners of war (POWs) were handed over to the Germans in exchange for roughly 2,200 Finnic prisoners of war.Helsingin Sanomat: [http://www2.hs.fi/english/archive/news.asp?id20031118IE7 \"Wartime refugees made pawns in cruel diplomatic game.\"]  8 November 2003 Out of 64,188 Soviet POWs, at least 18,318 were documented to have died in Finnish prisoner of war camps. Ylikangas, Heikki, [http://www2.vnk.fi/julkaisukansio/2004/j05-heikki-ylikankaan/pdf/fi.pdf Heikki Ylikankaan selvitys Valtioneuvoston kanslialle], Government of Finland \n\nAccording to Finnish historians, the casualties of the Finnish Defence Forces amounted to 63,204 dead or missing and around 158,000 wounded. A detailed list of Finnish dead is as follows:\n\n*Dead, buried 33,565;\n*Wounded, died of wounds 12,820;\n*Dead, not buried, declared as dead 4,251;\n*Missing, declared as dead 3,552;\n*Died as prisoners of war 473;\n*Other reasons (diseases, accidents, suicides) 7,932;\n*Unknown 611.\n\nThe official Soviet number of captured Finns was 2,377, but Finnish researchers have estimated the amount around 3,500 prisoners. 939 Finnish civilians died in air raids and 190 civilians were killed by Soviet partisans.\n\nThe Soviet demand for $600 million in reparations made in the spring was reduced to $300 million, most likely due to pressure from the United States and the United Kingdom.Ziemke (2002), p. 390 After the ceasefire, the USSR, however, insisted that the payments should be based on 1938 prices, which doubled the amount. Henrik Lunde notes that Finland survived World War II without losing its independence—unlike many of Germany's allies.Lunde 2011, p. 379 Peter Provis concludes that by following self-censorship and limited appeasement policies as well as by fulfilling the USSR's reparation demands, Finland avoided the same fate as other nations that were annexed by the Soviets.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Continuation War" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7712" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Continuation War (; ; 25 June 1941 – 19 September 1944) consisted of hostilities between Finland and the Soviet Union from 1941 to 1944. The Continuation War began 15 months after the end of the Winter War, which was also fought between Finland and the Soviet Union. In the Soviet Union, the war was considered part of the Great Patriotic War.Great Soviet Encyclopedia, Finland, Moscow, 1974.  Germany regarded its operations in the region as part of its overall war efforts on the Eastern Front, and it provided Finland with critical material support and military cooperation.\n\nActs of war between the Soviet Union and Finland recommenced on 22 June 1941, the day Germany launched its invasion of the Soviet Union. Open warfare began with a Soviet air offensive to Finland on 25 June. Subsequent Finnish operations undid its post-Winter War concessions to the Soviet Union on the Karelian Isthmus and Ladoga Karelia, and captured East Karelia by September 1941. On the Karelian Isthmus, the Finns halted their offensive 30 km from Leningrad, at the pre-World War II border between the Soviet Union and Finland. In 1944, Soviet air forces conducted air raids on Helsinki and other major Finnish cities. \n\nEventually, in mid-1944, the Soviet strategic offensive drove the Finns from most of the territories they had gained during the war, but the Finnish Army later brought the offensive to a standstill in July 1944. A ceasefire ended hostilities on 5 September and was followed by the Moscow Armistice on 19 September. The 1947 Paris peace treaty concluded the war formally. Finland ceded Pechengsky District to the Soviets, leased Porkkala peninsula to them and paid reparations, while retaining its independence.\n\nBackground\n\nWinter War\n\nOn 23 August 1939, the Soviet Union (USSR) and Germany signed the Molotov–Ribbentrop Pact, whereby the parties divided the independent countries of Finland, Estonia, Latvia, Lithuania, Poland, and Romania into spheres of interest, with Finland falling to the Soviet sphere of interest.Vehviläinen 2002, p. 30 Shortly afterward, Germany invaded Poland and, as a result, the United Kingdom and France declared war against Germany. The Soviet Union invaded eastern Poland on 17 September.Vehviläinen 2002, p. 31 Next, Moscow demanded that the Baltic states allow the establishment of Soviet military bases and the stationing of troops on their soil. The Baltic governments accepted these ultimatums, signing corresponding agreements in September and October.Vehviläinen 2002, p. 33\n\nIn October 1939, the Soviet Union attempted to negotiate with Finland for the cessation of Finnish territory on the Karelian Isthmus and the islands of the Gulf of Finland  and for the establishment of a Soviet military base near the Finnish capital of Helsinki.Vehviläinen 2002, p. 39 The Finnish government refused, and the Red Army invaded Finland on 30 November 1939.Vehviläinen 2002, p. 44 The USSR was expelled from the League of Nations and condemned by the international community for the illegal attack.Vehviläinen 2002, p. 49 Foreign support for Finland was planned, but very little actual help materialized, except from Sweden.Vehviläinen 2002, p. 65 The Moscow Peace Treaty concluded the 105-day Winter War on 13 March 1940 and started the Interim Peace.Vehviläinen 2002, p. 69 By the terms of the treaty, Finland ceded 11 per cent of its national territory and 13 percent of its economic capacity to the Soviet Union.Kirby 2006, p. 215 Finland avoided total conquest of the country by the Soviet Union and kept its sovereignty.Vehviläinen 2002, p. 70Before the war, Finland's foreign policy had been based on multilateral guarantees for support from the League of Nations and Nordic countries and was considered a failure.Vehviläinen 2002, p. 74 After the war, Finnish public opinion favored the reconquest of Finnish Karelia, the government declared national defence to be its first priority, and military expenditures rose to nearly half of public spending. Finland purchased and received donations of war materiel during and immediately after the Winter War. The Soviet Union had received a military base, which employed over 30,000 Soviet military personnel, in Hanko on Finland's southern coast near the capital Helsinki.Vehviläinen 2002, p. 75\n\nFinland resettled some 420,000 evacuees from the lost territories. To ensure food supply, it was necessary to clear new land for the evacuees to cultivate, facilitated by the Rapid Settlement Act. Finnish leadership wanted to preserve the spirit of unanimity that was commonly felt throughout the country during the Winter War. The divisive White Guard tradition of the Finnish Civil War's 16 May victory day celebration was therefore discontinued.Vehviläinen 2002, p. 76 Relations between Finland and the Soviet Union remained strained after the signing of the one-sided peace treaty, and there were disputes regarding the implementation of the treaty. Finland sought security against further territorial depredations by the USSR and proposed mutual defence agreements with Norway and Sweden, but these initiatives were quashed by Moscow.Vehviläinen 2002, p. 77Kirby 2006, p. 216\n\nGerman and Soviet expansion in Europe\n\nAfter the Winter War, Germany was not popular in Finland as it was considered an ally of the Soviet Union. However, the Finnish government began to restore diplomatic relations with Germany. Finland continued its Western-oriented policy and negotiated a war trade agreement with the United Kingdom. The agreement was renounced after the German invasion of Denmark and Norway on 9 April 1940, when Britain cut all trade and traffic communications with the Nordic countries. With the fall of France, a Western orientation was no longer considered an option in Finnish foreign policy.Vehviläinen 2002, p. 78 On 15 and 16 June, the Soviet Union occupied the Baltic states without resistance. Soviet puppet regimes were installed, and within two months Estonia, Latvia and Lithuania were incorporated as Soviet republics within the USSR. By mid-1940, the two remaining northern democracies, Finland and Sweden, were encircled by the hostile states of Germany and the Soviet Union.Vehviläinen 2002, p. 79\n\nOn 23 June, shortly after the Soviet occupation of the Baltic states began, Soviet Foreign Minister Vyacheslav Molotov contacted the Finns and demanded a mining licence for the Soviet Union at the nickel mines in Petsamo or, alternatively, establishing a joint Soviet-Finnish company to operate there. The licence to mine the deposit had earlier been granted to a British-Canadian company, and the proposition was rejected by Finland. The next month, the Soviets demanded that Finland destroy the fortifications built on the Åland islands and grant the USSR the right to use Finnish railways to transport Soviet troops to the newly-acquired Soviet base at Hanko. The Finns very reluctantly agreed to these demands.Vehviläinen 2002, p. 80 On 24 July, Molotov accused the Finnish government of persecuting the Finland–Soviet Union Peace and Friendship Society, a pro-communist group, and soon afterwards he publicly supported the group. The society organized demonstrations in Finland, some of which turned into riots.Vehviläinen 2002, p. 81Kirby 2006, p. 218\n\nSoviet sources maintain that Soviet policies up to the Continuation War were best explained as defensive measures by offensive means: The Soviet division of occupied Poland with Germany, the Soviet occupations of Lithuania, Latvia and Estonia, and the Soviet invasion of Finland in the Winter War are described as elements in the Soviets' construction of a security zone or buffer region between the perceived threat from the capitalist powers of Western Europe. The Soviet sources see the post-World War II establishment of Soviet satellite states in the Warsaw Pact countries and the Finnish-Soviet Agreement of Friendship, Cooperation, and Mutual Assistance as the conclusion of this Soviet defence plan.[http://www.aroundspb.ru/finnish/baryshnikov/pvp1932.php The problem of ensuring the security of Leningrad from the north in light of Soviet war planning of 1932–1941] by V. N. Baryshnikov: The actual war with Finland began first of all due to unresolved issues in Leningrad's security from the north and Moscow's concerns for the perspective of Finland's politics. At the same time, a desire to claim better strategic positions in case of a war with Germany had surfaced within the Soviet leadership.[http://www.aroundspb.ru/finnish/kozlov/part_01.php Финская война. Взгляд \"с той стороны\"] (\"The Finnish war. A look from the 'other side'\") by A. I. Kozlov: \"After the rise of National Socialism to power in Germany, the geopolitical importance of the former 'buffer states' had drastically changed. Both the Soviet Union and Germany vied for the inclusion of these states into their spheres of influence. Soviet politicians and military considered it likely, that in case of an aggression against the USSR, German armed forces will use the territory of the Baltic states and Finland as staging areas for invasion—by either conquering or coercing these countries. None of the states of the Baltic region, excluding Poland, had sufficient military power to resist a German invasion\". Stalin's Missed Chance, by Mikhail Meltyukhov: \"The English–French influence in the Baltics, characteristic for the '20s–early '30s was increasingly limited by the growth of German influence. Due to the strategic importance of the region, the Soviet leadership also aimed to increase its influence there, using both diplomatic means as well as active social propaganda. By the end of the '30s, the main contenders for influence in the Baltics were Germany and the Soviet Union. Being a buffer zone between Germany and the USSR, the Baltic states were bound to them by a system of economic and non-aggression treaties of 1926, 1932 and 1939\". Western historians, such as Norman Davies and John Lukacs, dispute this view and describe the pre-war Soviet policy as an attempt to stay out of the war and regain land lost after the fall of the Russian Empire.Norman Davies, Europe at War 1939–1945: No Simple Victory, 2007, \n\nRelations between Finland, Germany and the USSR\n\nOn 31 July 1940, German leader Adolf Hitler gave the order to start planning an assault on the Soviet Union. This meant that Germany had to reassess its position regarding both Finland and Romania. Until then, Germany had rejected Finnish appeals to purchase arms, but in August, Germans allowed the secret sale of weapons to Finland. Military authorities made an agreement on 12 September, and an official exchange of diplomatic notes was sent on 22 September. At the same time, German troops were allowed transit through Sweden and Finland.Kirby 2006, p. 220 In practice, this meant Germany had redrawn the border of German and Soviet spheres of influence.Vehviläinen 2002, p. 83\n\nDue to the new situation, Molotov visited Berlin on 12–13 November.Kirby 2006, p. 219 He wanted Germany to withdraw its troops from Finland and stop enabling Finnish anti-Soviet sentiments. He also reminded the Germans of the 1939 Soviet–German non-aggression pact. Hitler asked how the USSR planned to settle the \"Finnish question\". Molotov answered that it would happen in the same manner as in Bessarabia and the Baltic states. Hitler rejected this.Vehviläinen 2002, p. 84 In December, the Soviet Union, Germany and the United Kingdom all voiced opinions concerning suitable Finnish presidential candidates. Risto Ryti was the only candidate none of the three powers objected to and he was elected on 19 December.Vehviläinen 2002, p. 85\n\nIn January 1941, the USSR demanded control of the Petsamo mining area. Finland rejected the proposition as it had a rebuilt defence force and was encouraged by Germany to reject the Soviet demand. On 18 December 1940, Hitler officially approved Operation Barbarossa, the German invasion of the Soviet Union.Kirby 2006, p. 221 He expected both Finland and Romania to join the German campaign.Vehviläinen 2002, p. 86 Two days earlier, Finnish Major General Paavo Talvela had met German Colonel General Franz Halder and, a couple of days later, Reichsmarschall Hermann Göring, in Berlin. This was the first time the Germans advised the Finns, in carefully couched diplomatic terms, that they were preparing for a war with the Soviet Union. Outlines of the actual plan were revealed in January 1941 and regular contacts between Finnish and German military leaders started in February.\n\nIn the late spring of 1941, the USSR made a number of goodwill gestures to prevent Finland from completely falling under German influence. Ambassador Ivan Zotov was replaced with the more flexible Pavel Orlov. Furthermore, the Soviet government announced that it no longer opposed a rapprochement between Finland and Sweden. These conciliatory measures, however, did not have any effect on Finnish policy.Vehviläinen 2002, p. 87 Finland wished to re-enter World War II mainly because of the Soviet invasion of Finland during the Winter War, which had taken place after Finnish intentions of relying on the League of Nations and Nordic neutrality to avoid conflicts had failed from lack of outside support.Lunde 2011, p. 9 Finland primarily aimed to reverse its territorial losses from the March 1940 Moscow Peace Treaty and, depending on the success of the German invasion of the Soviet Union, to possibly expand its borders, especially into East Karelia. Some right-wing groups, such as the Academic Karelia Society, supported a Greater Finland ideology.Jokipii 1999, pp. 145–16\n\nOn 20 May, the Germans invited some Finnish officers to discuss the coordination of Operation Barbarossa. The participants met on 25–28 May in Salzburg and Berlin, and continued their meeting in Helsinki from 3 to 6 June. They agreed upon the arrival of German troops, Finnish mobilization, and a general division of operations. They also agreed that the Finnish Army would start mobilization on 15 June, but the Germans did not reveal the final date for the assault. The Finnish decisions were made by a small group of political and military leaders; the rest of the government was largely kept in the dark. The government was not informed until 9 June that the country would start mobilization of reservists due to tensions between Germany and the Soviet Union. Finland never signed the Tripartite Pact, which was signed by all de jure Axis powers. The Finns and Mannerheim, in particular, clearly stated they would fight against the Soviets only to the extent necessary to redress the balance of the 1940 treaty. For Hitler the matter was irrelevant; he saw Finland as an ally.Vehviläinen 2002, p. 102\n\nOpposing forces\n\nSoviet order of battle \n\nThe Northern Front of the Leningrad Military District had 18 divisions in the Finnish region. Furthermore, the USSR required its best units and latest materiel on the central European fronts.Vehviläinen 2002, p. 91 The 23rd Army was positioned on the Karealian Isthmus, Ladoga Karelia was defended by the 7th Army and the 14th Army was deployed at the Murmansk–Salla area of Lapland. The bulk of the Soviet forces was reinforced with around 40 separate battalions. As the initial devastating German strike against the Soviet Air Forces did not affect air units located near Finland, it could deploy around 700 aircraft supported by some Soviet Navy wings.Jokipii 1999, p. 301\n\nFinnish and German order of battle \n\nThe Finnish Army mobilised 500,000 men in 14 divisions and 3 brigades for the invasion, commanded by Field Marshal Mannerheim independently of . The army was organised as follows:\n\n* II Corps and IV Corps were deployed to the Karelian Isthmus and comprised seven infantry divisions.\n* Army of Karelia was positioned in north of Lake Ladoga and led by General Erik Heinrichs. It comprised VI Corps, VII Corps and Group Oinonen; a total of seven divisions, including the German 163rd Infantry Division, and three brigades.\n* 14th Division in the Kainuu region, commanded directly by Finnish Headquarters.\n\nFrom a German perspective, the Finnish Army was to attack south on both sides of Lake Ladoga to pressure Leningrad and thus support Army Group North. The army, especially its artillery, was stronger than it had been during the Winter War but included only one armoured battalion and had a general lack of motorised transportation.Vehviläinen 2002, p. 90\n\nThe 67,000 German soldiers in 4 divisions deployed under the Army of Norway took responsibility for an approximately 500 km-long stretch of the Arctic front in Finnish Lapland with the mission of striking Murmansk and the Kirov Railway. The Army of Norway, under  control, was organised into Mountain Corps Norway and XXXVI Mountain Corps with the Finnish Finnish III Corps and 14th Division attached to it.Vehviläinen 2002, p. 90 Oberkommando der Luftwaffe () assigned Luftflotte 5 (Air Fleet 5) to provide modest support to the Army of Norway and the Finnish Army in addition to its main task of Norway's air defence.\n\nFinnish offensive phase in 1941 \n\nInitial operations\n\nIn the late hours of 21 June 1941, German minelayers hiding in the Archipelago Sea laid two large minefields across the Gulf of Finland. Nordberg, Erkki, Arvio ja ennuste Venäjän sotilaspolitiikasta Suomen suunnalla, 2003, Encyclopædia Britannica Premium, 2006, [http://www.britannica.com/EBchecked/topic/207424/Finland Finland] Later the same night, German bombers flew along the Gulf of Finland to Leningrad and mined the harbour and the river Neva. On the return trip, these bombers landed for refueling in Utti, Finland. In the early hours of 22 June, Finnish forces launched Operation Kilpapurjehdus, which deployed troops to the demilitarized Åland Islands. An international treaty on the status of the islands called for Finland to defend them in case of the threat of an attack. However, the operation was coordinated with the German invasion, and the personnel of the Soviet consulate there were arrested. According to Finnish historian Mauno Jokipii, Finland knew that it had violated international protocol.Jokipii 1999, p. 282\n\nAfter Axis powers launched Operation Barbarossa around 3:15 a.m. on 22 June 1941, the Soviet Union commenced an airstrike on Finland with 7 bombers, as reported at 6:06 a.m. by coastal defence ship Väinämöinen. On the morning of 25 June, the Soviet Union launched another air offensive with 460 fighters and bombers targeting 19 airfields in Finland. Inaccurate intelligence and poor bombing accuracy caused several raids to hit Finnish cities or municipalities with considerable damage. 23 Soviet bombers were lost while the Finns did not lose aircraft. The USSR stated that the airstrikes were directed against German targets, especially airfields, in Finland. The bombings offered the Finnish government a ground for claiming that the country had become the target of a new assault, and the Finnish Parliament approved a \"defensive war\" as a fait accompli.Vehviläinen 2002, p. 88 According to historian David Kirby, the message was intended more for public opinion in Finland than abroad, where it was seen that the country was in the Axis camp.Kirby 2006, p. 222\n\nFinnish advance in Karelia\n\nThe Finnish plans for the offensive in Ladoga Karelia were completed on 28 June.Lunde (2011) pp. 154–59 On 10 July, the Finnish Army began its invasion and by 16 July, the VI Corps reached the northern shore of Lake Ladoga and cut the defending Soviet 7th Army in two, hindering the defence of the area. The USSR struggled to contain the German invasion, and soon the Soviet high command Stavka had to call all available units stationed along the Finnish border to the rapidly deteriorating front line. Moreover, the 237th Infantry Division and, excluding the 198th Motorized Division, the Soviet 10th Mechanized Corps were withdrawn from Ladoga Karelia, thus stripping most of the reserves from the remaining defending Soviet units.The Finnish II Corps started its offensive at the northern region of the Karelian Isthmus on 31 July.Lunde (2011) pp. 167–72 Finnish troops reached the shores of Lake Ladoga on 9 August, surrounding most of three defending Soviet divisions on the northwestern coast of the lake; the divisions were evacuated across the lake. On 22 August, the Finnish IV Corps started its offensive south of the II Corps and advanced towards Vyborg (). By 23 August, the II Corps had reached the Vuoksi River from the east and continued to surround the Soviet forces defending Vyborg. The Soviet order to withdraw came too late, and the Soviet divisions lost much of their equipment, although a sizable portion of their manpower was later evacuated via the Koivisto Islands. The mauled Soviet 23rd Army was unable to halt the offensive, and by 2 September the Finnish Army had reached the old 1939 border along its whole length. The Soviet Northern Front was split into the Leningrad Front and the Karelian Front. On 31 August, Finnish Headquarters ordered the II and IV Corps, which had advanced the furthest, to halt their offensive and form up for defence after reaching a line, that ran from the Gulf of Finland via Beloostrov–Sestra River–Okhta River–Lembolovo to Ladoga, just past the former border  from central Leningrad. On 1 September, the IV Corps defeated the Soviet 23rd Army at the Battle of Porlampi. Sporadic fighting continued around Beloostrov until the Soviets managed to force the Finns out from it on 20 September. The front on the Isthmus stabilized and the Siege of Leningrad began.Luknitsky 1988, p. 72Salisbury 2003, p. 246Werth 1999, pp. 360–61\n\nThe Finnish Army of Karelia started its attack in East Karelia towards Petrozavodsk, Lake Onega, and the Svir River on 9 September. The German Army Group North advanced from the south of Leningrad towards the Svir River and managed to capture Tikhvin before Soviet counterattacks forced the Germans to withdraw to the Volkhov River. Soviet forces also made several attempts to force the Finns out from their bridgehead south of the Svir during October and December, but the efforts were blocked by the Finns. Soviet units attacked the German 163rd Infantry Division In October 1941, which was operating under Finnish command across the Svir in October 1941, but the attacking force was pushed back soon after. The Finnish advance in East Karelia was halted on 6 December 1940. During the campaign from June to December, the Finns had suffered 75,000 casualties, of whom 26,355 had died, while the Soviets had 230,000 casualties, of whom 50,000 became prisoners of war.\n\nOperation Silver Fox in Lapland\n\nThe German objective in Finnish Lapland was to take Murmansk and cut the Kirov Railway running from Murmansk to Leningrad by capturing Salla and Kandalaksha. Murmansk was the only year-round ice-free port in the north and a threat to the nickel mine at Petsamo. The joint Finnish–German Operation Silver Fox (; ) was started on 29 June 1940 by the German Army of Norway, which had the Finnish 3rd and 6th Divisions under its command, against the defending Soviet 14th Army and 54th Rifle Division. By November, the operation had stalled 30 km away from the Kirov Railway due to ill-suited German troops, heavy Soviet resistance, poor terrain and arctic weather as well as diplomatic pressure by the United States (US) on the Finns warning about disrupting the lend-lease deliveries to Murmansk. The offensive and its three sub-operations failed to achieve their objectives. Both sides dug in and the Arctic theatre remained stable, excluding minor skirmishes, until the Soviet Petsamo–Kirkenes Offensive in October 1944. The crucial lend-lease shipments from the US via Murmansk and Kirol Railway to the bulk of the Soviet forces continued throughout World War II.Vehviläinen 2002, p. 95\n\nPolitics and international relations\n\nThe Wehrmacht advanced rapidly deep into Soviet territory during the first weeks of the Operation Barbarossa campaign. The Finns believed Germany would defeat the Soviet Union quickly. President Ryti envisioned a Greater Finland, where Finland and other Finnic people would live inside a \"natural defence borderline\" by incorporating the Kola Peninsula, East Karelia, and perhaps even northern Ingria. In public, the proposed frontier was introduced with the slogan \"short border, long peace.\"Vehviläinen 2002, p. 92 Some members of the Finnish Parliament, such as the Social Democratic Party and the Swedish People's Party, opposed the idea, arguing that maintaining the 1939 frontier would be enough. On 10 July, Finnish Commander-in-Chief, Field Marshal C. G. E. Mannerheim, drafted his order of the day, the Sword Scabbard Declaration, in which he pledged to liberate Karelia. The Finnish government assured the United States that it was unaware of the order.Kirby 2006, p. 224 According to Finnish historian Olli Vehviläinen, most Finns thought that the scope of the new offensive was only to regain what had been wrongly taken in the Winter War.Vehviläinen 2002, p. 89  \n\nBy the autumn of 1941 it was clear that Barbarossa would not accomplish its goals, and Finnish military leadership started to doubt Germany's capability to finish the war quickly. The Finnish Defence Forces suffered relatively severe losses during their advance, and, overall, German victory became uncertain as German troops were halted near Moscow. German troops in northern Finland faced circumstances they were not properly prepared for, and likewise failed to reach their targets. As the front lines stabilized, Finland sent out feelers for peace to the USSR several times.Jutikkala 1988, p. 248  The Finnish economy suffered from lack of labour, food shortages and increased price ratios. The Finnish government had to demobilize a part of the army to prevent the industrial and agricultural production from collapsing.Vehviläinen 2002, p. 96 In October, Finland informed Germany that it would need 175000 ST of grain to manage until next year's harvest. The German authorities would have rejected the request, but Hitler himself agreed. Annual grain deliveries of 200000 ST equaled almost half of the Finnish domestic crop. In November, Finland joined the Anti-Comintern Pact.Vehviläinen 2002, p. 101\n\nFinland maintained good relations with the Western powers. Foreign volunteers from Sweden and Estonia were among the internationals who joined Finnish ranks. The Finnish government stressed that Finland was fighting as a co-belligerent with Germany against the USSR only to protect itself. Furthermore, Finland stressed that it was still the same democratic country as it had been in the Winter War. However, on 12 July 1941, the United Kingdom signed an agreement of joint action with the Soviet Union. Under German pressure, Finland had to close the British legation in Helsinki. As a result, diplomatic relations between Finland and the United Kingdom were broken on 1 August.Vehviläinen 2002, p. 97 On 28 November, Britain presented Finland an ultimatum demanding that Finland cease military operations by 3 December. Unofficially, Finland informed the Western powers that Finnish troops would halt their advance in the next few days. The reply did not satisfy the United Kingdom, declaring war on Finland on 6 December. The Commonwealth states of Canada, Australia, British Raj and New Zealand followed suit.Vehviläinen 2002, p. 100 The most sizeable British action on Finnish soil was the Raid on Kirkenes and Petsamo, an aircraft carrier strike on German and Finnish ships on 31 July 1941.FAA archive: [http://www.fleetairarmarchive.net/RollofHonour/Battlehonour_crewlists/Petsamo_Kirkenes_1941.html Raid on Petsamo]  The attack achieved little, except the loss of three British aircraft, but it was intended to demonstrate British support for its Soviet ally. Later in 1941, Hawker Hurricanes of No. 151 Wing RAF, based at Murmansk, provided local air cover for Soviet troops and fighter escorts for Soviet bombers.The Royal Air Force in Russia :[http://ww2airfronts.org/Theaters/eto/rinr/pages/rinr-1.html Hurricanes at Murmansk]  \n\nRelations between Finland and the United States were more complex; the US public was sympathetic to the \"brave little democracy\" and had anti-communist sentiments. At first, the United States empathised with the Finnish cause, but the situation became problematic after the Finnish Army crossed the 1939 border.Vehvilainen 2002, p. 98 Finnish and German troops were a threat to the Kirov Railway and the northern supply line between the Western Allies and the Soviet Union.Vehviläinen 2002, p. 98 On 25 October 1941, the US demanded that Finland cease all hostilities against the USSR and withdraw behind the 1939 border. In public, President Ryti rejected the demands, but in private, he wrote to Mannerheim on 5 November asking him to halt the offensive. Mannerheim agreed and secretly instructed General Hjalmar Siilasvuo to break off the assault against the Kirov Railway.Vehviläinen 2002, p. 99\n\nTrench warfare phase during 1942–43 \n\nUnconventional warfare and military operations \n\nUnconventional warfare was fought in both the Finnish and Soviet wilderness. Finnish long-range reconnaissance patrols, organized both by the Intelligence Division's Detached Battalion 4 and by local units, patrolled beyond Soviet lines.  Soviet partisans, both resistance-bred and regular long-range patrol formations, conducted a number of operations in Finland and in Eastern Karelia from 1941 to 1944. In summer 1942, the USSR formed the 1st Partisan Brigade. The unit was 'partisan' in name only, as it was essentially 600 men and women on long-range patrol intended to disturb Finnish operations. The 1st Partisan Brigade was able to infiltrate beyond Finnish patrol lines, but was intercepted and rendered ineffective in August 1942 at Lake Segozero. Irregular partisans distributed propaganda newspapers, such as Pravda in Finnish. Yuri Andropov, later Soviet politician, took part in the partisan guerrilla actions.[http://www.hrono.ru/biograf/andropov.html Andropov Yuri Vladimirovich]. Biography. Finnish sources state that the Soviet partisan activity in East Karelia disrupted Finnish military supply and communication assets, but that almost two thirds of the attacks targeted civilians, killing 200 and injuring 50, including children and elderly. Eino Viheriävaara, Partisaanien jäljet 1941–1944. Oulun Kirjateollisuus Oy, 1982. Erkkilä, Veikko, Vaiettu sota (\"The Silenced War\"). Arator Oy. Lauri Hannikainen, (1992). Implementing Humanitarian Law Applicable in Armed Conflicts: The Case of Finland, Martinuss Nijoff Publishers, Dordrecht. . Tyyne Martikainen, (2002). Partisaanisodan siviiliuhrit, PS-Paino Värisuora Oy. .\n\nAlthough military operations during 1942 and 1943 were limited, the front did see some action. In early 1942, the Soviet Karelian Front attempted to retake Medvezhyegorsk, which had been lost to the Finns in late 1941. As spring came, the Soviet forces also went on the offensive on the Svir River front as well as in the Kestenga region further north. All Soviet offensives started promisingly, but due either to the Soviets overextending their lines or stubborn defensive resistance, the Soviet offensives were halted and repulsed. After Finnish and German counterattacks in Kestenga, the front lines had moved very little from their stabilized states. In September 1942, the Soviets attacked again at Kriv near Medvezhyegorsk, but despite five days of fighting, the Soviets managed to push the Finnish lines back only 500 m on a roughly 1 km-long stretch of the front.\n\nOn the Baltic Sea, the Soviet Baltic Fleet still operated from the besieged city of Leningrad. In early 1942, Soviet forces recaptured the island of Gogland, but lost both Gogland and Bolshoy Tyuters islands to the Finns later in spring 1942. During the winter between 1941 and 1942, the Soviet Baltic Fleet decided to use their large submarine fleet to carry the fight to the enemy. Though initial submarine operations in the summer of 1942 were successful, the German Kriegsmarine and Finnish Navy soon stepped up their anti-submarine efforts, making Soviet submarine operations later in 1942 costly. The underwater offensive carried out by the Soviets convinced the Germans to lay anti-submarine nets as well as supporting minefields between Porkkala and Naissaar, which proved to be an insurmountable obstacle for Soviet submarines. On the Arctic Ocean, Finnish radio intelligence intercepted Allied messages on supply convoys to Murmansk, such as PQ-17 and PQ-18, and relayed the information to Abwehr, German intelligence, for counter-action.Ahtokari, Reijo and Pale, Erkki: Suomen Radiotiedustelu 1927–1944 (Finnish radio intelligence 1927–1944), Helsinki, Hakapaino Oy, pp. 191–98, \n\nFinnish military administration and concentration camps\n\nOn 19 July 1941, the Finns set up military administration in occupied East Karelia. The goal of the administration was to prepare the region for eventual incorporation into Finland. In the early stages, the Finns aimed at ethnic cleansing where the Russian population would be expelled from the area once the war was over. They would be replaced with Finnic peoples, such as Karelians, Finns, Estonians, Ingrians and Vepsians. The Russian population was deemed \"non-national\".Kirby 2006, p. 225 Most of the East Karelian population had been evacuated before the Finnish forces arrived, but about 85,000 people—mostly elderly, women, and children—were left behind, and less than half of them were Karelians. A significant number of civilians, almost 30 per cent of the remaining Russians, were interned at concentration camps.\n\nThe winter between 1941 and 1942 was an ordeal for the Finnish urban population, due to poor harvests and a shortage of agricultural labourers. For the Russians in Finnish concentration camps, it was disastrous. More than 3,500 people died, mostly from starvation, amounting to 13.8 per cent of the detained, while the corresponding figure for the free population of the occupied territories was 2.6 per cent, and 1.4 per cent for Finland.Vehviläinen 2002, p. 107 Conditions gradually improved, ethnic discrimination in wage levels and food rations was terminated, and new schools were established for the Russian-speaking population the following year after Commander-in-Chief Mannerheim called for the International Committee of the Red Cross from Geneva to inspect the camps.Kirby 2006, p. 226 By the end of the occupation, mortality rates dropped to the same levels as in Finland.\n\nJews in Finland\n\nFinland had a small Jewish population of approximately 2,300 people. They had full civil rights and fought with other Finns in the ranks of the Finnish Army. The field synagogue in East Karelia was one of the very few functioning synagogues on the Axis side during the war. There were several cases of Jewish officers of the Finnish Army being awarded the German Iron Cross, which they declined. German soldiers were treated by Jewish medical officers—who sometimes saved the soldiers' lives. Rautkallio, Hannu, Suomen juutalaisten aseveljeys (Finnish Jews as German Brothers in Arms), Tammi, 1989Tuulikki Vuonokari (2003), Jews in Finland During the Second World War, Finnish Institutions Student Paper: FAST Area Studies Program Department of Translation Studies, University of Tampere, Autumn 2003 . Retrieved 2009-02-06.Poljakoff in Torvinen, Kadimah: Suomen juutalaisten historia 35 Smolar 155–57Torvinen, Taimi, Kadimah: Suomen juutalaisten historia Helsinki: Otava, 1989 [http://www.uta.fi/FAST/FIN/HIST/tv-jews.html pp. 117–67] . Retrieved 2009-02-06. German command mentioned Finnish Jews at the Wannsee Conference in January 1942, wishing to transport them to the Majdanek concentration camp in occupied Poland. SS leader Heinrich Himmler also raised the topic of Finnish Jews during his visit in Finland in the summer of 1942; Finnish Prime Minister Jukka Rangell replied that Finland did not have a \"Jewish question.\" In November 1942, however, the Finns handed eight Jewish refugees over to the Gestapo, raising protests among the Finnish Social Democrat Party ministers. No more refugees were transferred to the German detainmentVehviläinen 2002, p. 103 while over 500 Jewish refugees were granted asylum. The Finnish government did not take any anti-Jewish measures beyond the aforementioned despite repeated requests from Germany.[https://query.nytimes.com/gst/fullpage.html?res=9B0DE6DA1038F93BA35756C0A961948260 Letter to the New York Times by Mark Cohen, Executive Director of Holocaust Publications in New York, 28 April, 1987]\n\nSoviet offensive phase in 1944 \n\nAir raids and political development\n\nFinland began to actively seek a way out of the war after the disastrous German defeat at the Battle of Stalingrad in February 1943. Prime Minister Edwin Linkomies formed a new cabinet in March 1943 with peace as the top priority. Negotiations were conducted intermittently during 1943–1944 between Finland, the Western Allies and the USSR, but no agreement was reached. Stalin decided to force Finland to surrender with a bombing campaign on Helsinki starting in February 1944. It included three major air attacks with a total of over 6,000 sorties. Finnish anti-aircraft defence managed to repel the raids as only five per cent of the dropped bombs hit their planned targets. For example in Helsinki, searchlights and fires were placed as decoys outside the city to lure Soviet bombers to drop their payloads in what were actually unpopulated areas. Major air attacks also hit Oulu and Kotka, but pre-emptive radio intelligence and effective defence kept the number of casualties small. Meanwhile, the persistent German and Estonian defence in Narva from February to August eliminated Soviet-occupied Estonia as a favourable base for amphibious invasions and air attacks against Helsinki and other Finnish coastal cities tu support a land offensive. Field Marshal Mannerheim had repeatedly reminded the German command that in case their troops in Estonia retreated, Finland would be forced to make peace even on extremely unfavourable terms.Howard D. Grier. Hitler, Dönitz, and the Baltic Sea, Naval Institute Press, 2007, . [https://books.google.com/books?idu4IbqxEQeBMC&sig\nACfU3U1y5qvHJPiPkpX74WKLzPbPX7KK5g&pgPA121#PPA121,M1 p. 121] Thus, Finland terminated peace negotiations in April 1944 because the terms of the USSR were deemed impossible to fulfill.Gebhardt 1989, p. 1\n\nVyborg–Petrozavodsk Offensive \n\nOn 9 June 1944, the Soviet Leningrad Front launched a strategic offensive against Finnish positions on the Karelian Isthmus and in the area of Lake Ladoga, timed to accompany the Allied Operation Overlord in Normandy, France.Declaration of the Three Powers, December 1, 1943, Tehran Conference On the -wide breakthrough segment, the Red Army concentrated 3,000 guns and mortars. In some places, the concentration of artillery pieces exceeded 200 guns for every kilometre of the front or one for every 5 m. Soviet artillery fired over 80,000 rounds along the front on the Karelian Isthmus. On the second day of the offensive, the artillery barrages and superior number of Soviet forces crushed the main Finnish defence line. The Red Army penetrated the second line of defence, Vammelsuu–Taipale line (VT line), by the sixth day and recaptured Vyborg almost without a fight by 20 June. The Soviet breakthrough on the Karelian Isthmus forced the Finns to reinforce the area. This allowed the parallel Soviet offensive in East Karelia by the Karelian Front to meet less resistance and to recapture Petrozavodsk by 28 June 1944. The main objective of the Soviet strategic offensive was to force Finland out from the war.Erickson 1993, p. 197Gebhardt 1989, p. 2Glantz 1998, p. 202\n\nOn 25 June, the Red Army reached the third line of defence, the Viipuri–Kuparsaari–Taipale line (VKT line), and the decisive Battle of Tali-Ihantala began, described as the largest battle in Nordic military history. At this point, the Finnish Army had retreated around  to approximately the same line of defence they had held at the end of the Winter War. Finland especially lacked modern anti-tank weaponry that could stop Soviet heavy armour, such as the KV-1 or IS-2. Thus, German Foreign Minister Joachim von Ribbentrop offered German hand-held Panzerfaust and Panzerschreck antitank weapons in exchange for a guarantee that Finland would not seek a separate peace with the USSR. On 26 June, President Risto Ryti gave the guarantee as a personal undertaking, which he, Field Marshal Mannerheim and Prime Minister Edwin Linkomies intended to legally last only for the remainder of Ryti's presidency. In addition to delivering thousands of anti-tank weaponry, Hitler sent Wehrmacht's 122nd Infantry Division and the half-strength 303rd Assault Gun Brigade armed with Sturmgeschütz III tank destroyers as well as Luftwaffe's Detachment Kuhlmey to provide temporary support in the most vulnerable sectors. With the new supplies and assistance from Germany, the Finnish Army halted the numerically and materially superior Soviet advance in Tali-Ihantala on 9 July 1944 and the front stabilized once again.[https://books.google.com/books?id\nBg8drRyDGhEC&pgPA184 500 Days: The War in Eastern Europe ... – Google Books][https://books.google.com/books?idp58vtOKyVy8C&pg\nPA14 Finland at War 1939–45 – Google Books][https://books.google.com/books?id\nDh6jydKXikoC&pg=PA467 Dictionary of Battles and Sieges: F–O – Google Books]\n\nA few battles were fought in the latter stages of the war. The last of them was the Battle of Ilomantsi, a Finnish victory, from 26 July to 13 August 1944.Moisala 1988Lunde 2011, p. 299 The struggle to contain the Soviet offensive was exhausting Finnish resources. The German support under the Ryti-Ribbentrop Agreement had prevented a disaster, but it was asserted that the country would not be able to hold off against another major offensive.Grier 2007, p. 31 Soviet victories against German Army Groups Center and North during Operation Bagration made the situation even more dire for Finland. With no imminent threat of Soviet assaults, Finland decided to seek a way out of the war.Erickson 1993, pp. 329–30Glantz 1998, p. 229 On 4 August, President Ryti resigned and Field Marshal Mannerheim was chose as the new president. He annulled the agreement between Ryti and Ribbentrop in mid-August to allow Finland to sue for peace with the USSR again. The peace terms from Moscow arrived in late August.Glantz 1998, pp. 201–03\n\nPeace \n\nSeveral Western historians state that Soviet designs for Finland were no different from their designs for the Baltic countries. American political scientist Dan Reiter asserts that for Moscow the control of Finland was necessary. Reiter and British historian Victor Rothwell both quote Molotov telling his Lithuanian counterpart, at the time when Lithuania was effectively absorbed into the USSR, that minor countries, such as Finland, \"will be included within the honourable family of Soviet peoples.\"Dan Reiter, How Wars End, Princeton University Press, Princeton, New Jersey USA (2009), p. 131. Russian historian Nikolai Baryshnikov disputes the view that the Soviet Union wanted to deprive Finland of its independence. He argues that there is no documentary evidence for such claims and that the Soviet government was always open for negotiations. Baryshnikov cites, for example, the former public information chief of Finnish Headquarters, Major Kalle Lehmus, to show that Finland's leadership learned of the limited Soviet plans for Finland at least by July 1944 after intelligence indicated that some Soviet divisions were to be transferred to reserve in Leningrad.Baryshnikov (2002), pp. 222–23 (Section heading \"Стремительный прорыв,\" paragraph #48 et seq., after cit. 409)Baryshnikov (2006) Reiter states that the fear of severe losses pushed Stalin to accept a limited outcome in the war rather than pursue annexation although some Soviet documentation called for military occupation of Finland.Dan Reiter, How Wars End, Princeton University Press, Princeton, NJ (2009), pp. 138, 135. He argues that the Finnish victory at the Battle of Ilomantsi persuaded the USSR to give up their plan for an unconditional surrender of the Finns.Dan Reiter, How Wars End, Princeton University Press, Princeton, NJ (2009), p. 136.\n\nAftermath and casualties\n\nA sizeable number of civilians who had been displaced after the Winter War had moved back into Karelia during the Continuation War. They had to be evacuated again; of the 260,000 civilians who had moved back into the Karelia, only 19 chose to remain and become Soviet citizens. Most of the Ingrian Finns together with Votes and Izhorians living in German-occupied Ingria had been evacuated to Finland in 1943–1944. After armistice, Finland was forced to return the evacuees.Taagepera (2013), p. 144 Soviet authorities did not allow the 55,733 returnees to settle back in Ingria and instead deported them to central regions of the USSR.Scott and Liikanen (2013), pp. 59–60\n\nThe number of Soviet prisoners of war in Finland was estimated to be around 64,000. Of these, 56,000 were captured in 1941.Juutilainen & Leskinen (ed.); Kujansuu, Juha (2005), p. 1036 Around 2,600 to 2,800 Soviet prisoners of war (POWs) were handed over to the Germans in exchange for roughly 2,200 Finnic prisoners of war.Helsingin Sanomat: [http://www2.hs.fi/english/archive/news.asp?id20031118IE7 \"Wartime refugees made pawns in cruel diplomatic game.\"]  8 November 2003 Out of 64,188 Soviet POWs, at least 18,318 were documented to have died in Finnish prisoner of war camps. Ylikangas, Heikki, [http://www2.vnk.fi/julkaisukansio/2004/j05-heikki-ylikankaan/pdf/fi.pdf Heikki Ylikankaan selvitys Valtioneuvoston kanslialle], Government of Finland \n\nAccording to Finnish historians, the casualties of the Finnish Defence Forces amounted to 63,204 dead or missing and around 158,000 wounded. A detailed list of Finnish dead is as follows:\n\n*Dead, buried 33,565;\n*Wounded, died of wounds 12,820;\n*Dead, not buried, declared as dead 4,251;\n*Missing, declared as dead 3,552;\n*Died as prisoners of war 473;\n*Other reasons (diseases, accidents, suicides) 7,932;\n*Unknown 611.\n\nThe official Soviet number of captured Finns was 2,377, but Finnish researchers have estimated the amount around 3,500 prisoners. 939 Finnish civilians died in air raids and 190 civilians were killed by Soviet partisans.\n\nThe Soviet demand for $600 million in reparations made in the spring was reduced to $300 million, most likely due to pressure from the United States and the United Kingdom.Ziemke (2002), p. 390 After the ceasefire, the USSR, however, insisted that the payments should be based on 1938 prices, which doubled the amount. Henrik Lunde notes that Finland survived World War II without losing its independence—unlike many of Germany's allies.Lunde 2011, p. 379 Peter Provis concludes that by following self-censorship and limited appeasement policies as well as by fulfilling the USSR's reparation demands, Finland avoided the same fate as other nations that were annexed by the Soviets. Continuation War. http://en.wikipedia.org/?curid=7712."
  }
}
