{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17944",
  "eid" : "2f9943f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778589103,
  "textBody" : "In mathematics, a Lie algebra (pronounced \"Lee\") is a vector space \\mathfrak g together with a non-associative, alternating bilinear map \\mathfrak g \\times \\mathfrak g \\rightarrow \\mathfrak g; (x, y) \\mapsto [x, y], called the Lie bracket, satisfying the Jacobi identity.\n\nLie algebras are closely related to Lie groups, which are groups that are also smooth manifolds, with the property that the group operations of multiplication and inversion are smooth maps. Any Lie group gives rise to a Lie algebra. Conversely, to any finite-dimensional Lie algebra over real or complex numbers, there is a corresponding connected Lie group unique up to covering (Lie's third theorem). This correspondence between Lie groups and Lie algebras allows one to study Lie groups in terms of Lie algebras.\n\nLie algebras and their representations are used extensively in physics, notably in quantum mechanics and particle physics.\n\nLie algebras were so termed by Hermann Weyl after Sophus Lie in the 1930s. In older texts, the name infinitesimal group is used.\n\nHistory \n\nLie algebras were introduced to study the concept of infinitesimal transformations by Marius Sophus Lie in the 1870s, and independently discovered by Wilhelm Killing in the 1880s.\n\nDefinitions \n\nDefinition of a Lie algebra\n\nA Lie algebra is a vector space \\,\\mathfrak{g} over some field F allows more generally for a module over a commutative ring with unit element. together with a binary operation [\\cdot,\\cdot]: \\mathfrak{g}\\times\\mathfrak{g}\\to\\mathfrak{g} called the Lie bracket that satisfies the following axioms:\n\n* Bilinearity,\n: [a x + b y, z] a [x, z] + b [y, z], \\quad  [z, a x + b y] \n a[z, x] + b [z, y] \nfor all scalars a, b in F and all elements x, y, z in \\mathfrak{g}.\n\n* Alternativity,\n: [x,x]=0\\ \nfor all x  in \\mathfrak{g}.\n\n* The Jacobi identity,\n:  [x,[y,z + [z,[x,y + [y,[z,x = 0 \\ \nfor all x, y, z in \\mathfrak{g}.\n\nUsing bilinearity to expand the Lie bracket  [x+y,x+y]  and using alternativity shows that  [x,y] + [y,x]=0\\  for all elements x, y in \\mathfrak{g}, showing that bilinearity and alternativity together imply \n* Anticommutativity,\n:  [x,y] = -[y,x],\\  \nfor all elements x, y in \\mathfrak{g}. If the field's characteristic is not 2 then anticommutativity implies alternativity.\n\nIt is customary to express a Lie algebra in lower-case fraktur, like \\mathfrak{g}. If a Lie algebra is associated with a Lie group, then the spelling of the Lie algebra is the same as that Lie group. For example, the Lie algebra of SU(n) is written as \\mathfrak{su}(n).\n\nFirst example\n\nConsider \\mathfrak{g}=\\mathbb{R}^3, with the bracket defined by \n[x,y]=x\\times y\nwhere \\times is the cross product. The bilinearity, skew-symmetry, and Jacobi identity are all known properties of the cross product. Concretely, if \\{ e_1,e_2,e_3\\}  is the standard basis, then the bracket operation is completely determined by the relations:\n[e_1,e_2]e_3,\\quad [e_2,e_3]\ne_1,\\quad [e_3,e_1]=e_2.\n(E.g., the relation [e_2,e_1]=-e_3 follows from the above by the skew-symmetry of the bracket.)\n\nGenerators and dimension \n\nElements of a Lie algebra \\mathfrak{g} are said to be generators of the Lie algebra if the smallest subalgebra of \\mathfrak{g} containing them is \\mathfrak{g} itself. The dimension of a Lie algebra is its dimension as a vector space over F. The cardinality of a minimal generating set of a Lie algebra is always less than or equal to its dimension.\n\nSubalgebras, ideals and homomorphisms \n\nThe Lie bracket is not associative in general, meaning that x,y],z] need not equal [x,[y,z. (However, it is flexible.) Nonetheless, much of the terminology that was developed in the theory of associative rings or associative algebras is commonly applied to Lie algebras. A subspace \\mathfrak{h} \\subseteq \\mathfrak{g} that is closed under the Lie bracket is called a Lie subalgebra. If a subspace \\mathfrak i\\subseteq\\mathfrak{g} satisfies a stronger condition that\n\n[\\mathfrak{g},\\mathfrak i]\\subseteq \\mathfrak i,\n\nthen \\mathfrak i is called an ideal in the Lie algebra \\mathfrak{g}.Due to the anticommutativity of the commutator, the notions of a left and right ideal in a Lie algebra coincide. A homomorphism between two Lie algebras (over the same base field) is a linear map that is compatible with the respective Lie brackets:\n\n f: \\mathfrak{g}\\to\\mathfrak{g'}, \\quad f([x,y])=[f(x),f(y)], \n\nfor all elements x and y in \\mathfrak{g}. As in the theory of associative rings, ideals are precisely the kernels of homomorphisms; given a Lie algebra \\mathfrak{g} and an ideal \\mathfrak i in it, one constructs the factor algebra or quotient algebra \\mathfrak{g}/\\mathfrak i, and the first isomorphism theorem holds for Lie algebras.\n\nLet S be a subset of \\mathfrak{g}. The set of elements x such that [x, s] = 0 for all s in S forms a subalgebra called the centralizer of S. The centralizer of \\mathfrak{g} itself is called the center of \\mathfrak{g}. Similar to centralizers, if S is a subspace, then the set of x such that [x, s] is in S for all s in S forms a subalgebra called the normalizer of S.\n\nDirect sum and semidirect product \n\nGiven two Lie algebras \\mathfrak{g^{}} and \\mathfrak{g'}, their direct sum is the Lie algebra consisting of the vector space\n\\mathfrak{g}\\oplus\\mathfrak{g'}, of the pairs \\mathfrak{}(x,x'), \\,x\\in\\mathfrak{g}, x'\\in\\mathfrak{g'}, with the operation\n\n [(x,x'),(y,y')]=([x,y],[x',y']), \\quad x,y\\in\\mathfrak{g},\\, x',y'\\in\\mathfrak{g'}.\n\nLet \\mathfrak{g} be a Lie algebra and \\mathfrak{i} an ideal of \\mathfrak{g}. If the canonical map \\mathfrak{g} \\to \\mathfrak{g}/\\mathfrak{i} splits (i.e., admits a section), then \\mathfrak{g} is said to be a semidirect product of \\mathfrak{i} and \\mathfrak{g}/\\mathfrak{i}, \\mathfrak{g}=\\mathfrak{g}/\\mathfrak{i}\\ltimes\\mathfrak{i}. See also semidirect sum of Lie algebras.\n\nLevi's theorem says that a finite-dimensional Lie algebra is a semidirect product of its radical and the complementary subalgebra (Levi subalgebra).\n\nEnveloping algebra \n\nFor any associative algebra A with multiplication *,  one can construct a Lie algebra L(A). As a vector space, L(A) is the same as A. The Lie bracket of two elements of L(A) is defined to be their commutator in A:\n\n [a,b]=a * b-b * a.\\ \n\nThe associativity of the multiplication * in A implies the Jacobi identity of the commutator in L(A). For example, the associative algebra of n × n matrices over a field F gives rise to the general linear Lie algebra \\mathfrak{gl}_n(F). The associative algebra A is called an enveloping algebra of the Lie algebra L(A). Every Lie algebra can be embedded into one that arises from an associative algebra in this fashion; see universal enveloping algebra.\n\nDerivations \n\nA derivation on the Lie algebra \\mathfrak{g} (in fact on any non-associative algebra) is a linear map \\delta:\\mathfrak{g}\\rightarrow \\mathfrak{g} that obeys the Leibniz law, that is,\n\\delta ([x,y]) = [\\delta(x),y] + [x, \\delta(y)]\nfor all x and y in the algebra. For any x, \\operatorname{ad}(x) is a derivation; a consequence of the Jacobi identity. Thus, the image of \\operatorname{ad} lies in the subalgebra of \\mathfrak{gl}(\\mathfrak{g}) consisting of derivations on \\mathfrak{g}. A derivation that happens to be in the image of \\operatorname{ad} is called an inner derivation. If \\mathfrak{g} is semisimple, every derivation on \\mathfrak{g} is inner.\n\nExamples \n\nVector spaces \n\nAny vector space V endowed with the identically zero Lie bracket becomes a Lie algebra. Such Lie algebras are called abelian, cf. below. Any one-dimensional Lie algebra over a field is abelian, by the antisymmetry of the Lie bracket.\n* The real vector space of all n × n skew-hermitian matrices is closed under the commutator and forms a real Lie algebra denoted \\mathfrak{u}(n). This is the Lie algebra of the unitary group U(n).\n\nAssociative algebra \n\n* On an associative algebra A over a field F with multiplication (x, y) \\mapsto xy, a Lie bracket may be defined by the commutator [x,y] = xy - yx. With this bracket, A is a Lie algebra.\n* The associative algebra of endomorphisms of a F-vector space E with the above Lie bracket is denoted \\mathfrak{gl}(E). If E = F^n, the notation is \\mathfrak{gl}(n, F) or \\mathfrak{gl}_n(F).\n\nSubspaces \n\nEvery subalgebra  (subspace closed under the Lie bracket) of a Lie algebra is a Lie algebra in its own right.\n* The subspace of the general linear Lie algebra \\mathfrak{gl}_n(F) consisting of matrices of trace zero is a subalgebra,Humphreys p.2 the special linear Lie algebra, denoted \\mathfrak{sl}_n(F).\n\nMatrix Lie groups \n\nAny Lie group  defines an associated real Lie algebra \\mathfrak{g}=\\mathrm{Lie}(G). The definition in general is somewhat technical, but in the case of a real matrix group G, it can be formulated via the exponential map, or the matrix exponential. The Lie algebra \\mathfrak{g} of G may be computed as\n\\mathfrak{g} = \\{ X \\in M(n,C) | \\operatorname{exp}(tX) \\in G \\text{ for all } t \\text{ in } \\mathbb{\\mathbb{R}} \\}. Section 3.3\nThe Lie bracket of \\mathfrak{g} is given by the commutator of matrices, [X,Y]=XY-YX. The following are examples of Lie algebras of matrix Lie groups: Section 3.4\n* The special linear group SL(n,R), consisting of all n × n matrices with real entries and determinant 1. Its Lie algebra consists of all n × n matrices with real entries and trace 0.\n* The unitary group U(n) consists of n × n unitary matrices (those satisfying U^*U^{-1}). Its Lie algebra consists of skew-self-adjoint matrices (those satisfying X^*\n-X).\n* The orthogonal and special orthogonal groups O(n) and SO(n) have the same Lie algebra, consisting of real, skew-symmetric matrices (those satisfying X^{tr}=-X).\n\nTwo Dimensions \n\n* On any field \\mathbf{F} there is, up to isomorphism, a single two-dimensional nonabelian Lie algebra with generators (x, y) and bracket defined as  \\left [x, y\\right ] = y. It generates the affine group in one dimension. So, for \n x\\left( \\begin{array}{cc} 1 & 0\\\\ 0 & 0 \\end{array}\\right), \\qquad y\n   \\left( \\begin{array}{cc} 0 & 1\\\\ 0 & 0 \\end{array}\\right),   \nthe resulting group elements are upper triangular 2×2 matrices with unit lower diagonal,\n e^{ax+by}= \\left( \\begin{array}{cc} e^a & \\tfrac{b}{a}(e^a-1)\\\\ 0 & 1 \\end{array}\\right) . \n\nThree dimensions \n\n* The three-dimensional Euclidean space R3  with the Lie bracket given by the cross product of vectors becomes a three-dimensional Lie algebra.\n* The Heisenberg algebra H3(R) is a three-dimensional Lie algebra generated by elements ,    and   with Lie brackets\n: [x,y]z,\\quad [x,z]\n0, \\quad [y,z]=0 .\nIt is explicitly realized as the space of 3×3 strictly upper-triangular matrices, with the Lie bracket given by the matrix commutator,\n:\nx = \\left( \\begin{array}{ccc}\n0&1&0\\\\\n0&0&0\\\\\n0&0&0\n\\end{array}\\right),\\quad\ny = \\left( \\begin{array}{ccc}\n0&0&0\\\\\n0&0&1\\\\\n0&0&0\n\\end{array}\\right),\\quad\nz = \\left( \\begin{array}{ccc}\n0&0&1\\\\\n0&0&0\\\\\n0&0&0\n\\end{array}\\right)~.\\quad\n\nAny element of the Heisenberg group is thus representable as a product of group generators, i.e., matrix exponentials of these Lie algebra generators, \n:\\left( \\begin{array}{ccc}\n1&a&c\\\\\n0&1&b\\\\\n0&0&1\n\\end{array}\\right)= e^{by} e^{cz} e^{ax}~.\n\n* The Lie algebra so(3) of the group SO(3) is spanned by the three matrices Example 3.27\n:\nF_1 = \\left( \\begin{array}{ccc}\n0&0&0\\\\\n0&0&-1\\\\\n0&1&0\n\\end{array}\\right),\\quad\nF_2 = \\left( \\begin{array}{ccc}\n0&0&1\\\\\n0&0&0\\\\\n-1&0&0\n\\end{array}\\right),\\quad\nF_3 = \\left( \\begin{array}{ccc}\n0&-1&0\\\\\n1&0&0\\\\\n0&0&0\n\\end{array}\\right)~.\\quad\n\nThe commutation relations among these generators are\n: [F_1, F_2] = F_3\n: [F_2, F_3] = F_1\n: [F_3, F_1] = F_2  .\nThese commutation relations are essentially the same as those among the x, y, and z components of the angular momentum operator in quantum mechanics.\n\nInfinite dimensions \n\n* An important class of infinite-dimensional real Lie algebras arises in differential topology. The space of smooth vector fields on a differentiable manifold M forms a Lie algebra, where the Lie bracket is defined to be the commutator of vector fields. One way of expressing the Lie bracket is through the formalism of Lie derivatives, which identifies a vector field X with a first order partial differential operator LX acting on smooth functions by letting LX(f) be the directional derivative of the function f in the direction of X. The Lie bracket [X,Y] of two vector fields is the vector field defined through its action on functions by the formula:\n \t\n:  L_{[X,Y]}f=L_X(L_Y f)-L_Y(L_X f).\\,\n\n* A Kac–Moody algebra is an example of an infinite-dimensional Lie algebra.\n* The Moyal algebra is an infinite-dimensional Lie algebra that contains all classical Lie algebras as subalgebras.\n* The Virasoro algebra is of paramount importance in string theory.\n\nRepresentations \n\nDefinitions\n\nGiven a vector space V, let \\mathfrak{gl}(V) denote the Lie algebra consisting of all linear endomorphisms of V, with bracket given by [X,Y]=XY-YX. A representation of a Lie algebra \\mathfrak{g} on V is a Lie algebra homomorphism\n\\pi: \\mathfrak g \\to \\mathfrak{gl}(V).\n\nA representation is said to be faithful if its kernel is zero. Ado's theorem states that every finite-dimensional Lie algebra has a faithful representation on a finite-dimensional vector space.\n\nAdjoint representation\n\nFor any Lie algebra \\mathfrak{g}, we can define a representation\n\\operatorname{ad}: \\mathfrak{g} \\to \\mathfrak{gl}(\\mathfrak{g})\ngiven by \\operatorname{ad}(x)(y) = [x, y] is a representation of \\mathfrak{g} on the vector space \\mathfrak{g} called the adjoint representation.\n\nGoals of representation theory\n\nOne important aspect of the study of Lie algebras (especially semisimple Lie algebras) is the study of their representations. (Indeed, most of the books listed in the references section devote a substantial fraction of their pages to representation theory.) Although Ado's theorem is an important result, the primary goal of representation theory is not to find a faithful representation of a given Lie algebra \\mathfrak{g}. Indeed, in the semisimple case, the adjoint representation is already faithful. Rather the goal is to understand all possible representation of \\mathfrak{g}, up to the natural notion of equivalence. In the semisimple case, Weyl's theorem says that every finite-dimensional representation is a direct sum of irreducible representations (those with no nontrivial invariant subspaces). The irreducible representations, in turn, are classified by a theorem of the highest weight.\n\nRepresentation theory in physics\n\nThe representation theory of Lie algebras plays an important role in various parts of theoretical physics. There, one considers operators on the space of states that satisfy certain natural commutation relations. These commutation relations typically come from a symmetry of the problem—specifically, they are the relations of the Lie algebra of the relevant symmetry group. An example would be the angular momentum operators, whose commutation relations are those of the Lie algebra so(3) of the rotation group SO(3). Typically, the space of states is very far from being irreducible under the pertinent operators, but one can attempt to decompose it into irreducible pieces. In doing so, one needs to know what the irreducible representations of the given Lie algebra are. In the study of the quantum hydrogen atom, for example, quantum mechanics textbooks give (without calling it that) a classification of the irreducible representations of the Lie algebra so(3).\n\nStructure theory and classification \n\nLie algebras can be classified to some extent. In particular, this has an application to the classification of Lie groups.\n\nAbelian, nilpotent, and solvable \n\nAnalogously to abelian, nilpotent, and solvable groups, defined in terms of the derived subgroups, one can define abelian, nilpotent, and solvable Lie algebras.\n\nA Lie algebra \\mathfrak{g} is abelian if the Lie bracket vanishes, i.e. [x,y] = 0, for all x and y in \\mathfrak{g}. Abelian Lie algebras correspond to commutative (or abelian) connected Lie groups such as vector spaces K^n or tori T^n, and are all of the form \\mathfrak{k}^n, meaning an n-dimensional vector space with the trivial Lie bracket.\n\nA more general class of Lie algebras is defined by the vanishing of all commutators of given length. A Lie algebra \\mathfrak{g} is nilpotent if the lower central series\n\n \\mathfrak{g} > [\\mathfrak{g},\\mathfrak{g}] > \\mathfrak{g},\\mathfrak{g}],\\mathfrak{g}] > [\\mathfrak{g},\\mathfrak{g}],\\mathfrak{g}],\\mathfrak{g}] > \\cdots\n\nbecomes zero eventually. By Engel's theorem, a Lie algebra is nilpotent if and only if for every u in \\mathfrak{g} the adjoint endomorphism\n\n\\operatorname{ad}(u):\\mathfrak{g} \\to \\mathfrak{g}, \\quad \\operatorname{ad}(u)v=[u,v]\n\nis nilpotent.\n\nMore generally still, a Lie algebra \\mathfrak{g} is said to be solvable if the derived series:\n\n \\mathfrak{g} > [\\mathfrak{g},\\mathfrak{g}] > \\mathfrak{g},\\mathfrak{g}],[\\mathfrak{g},\\mathfrak{g} > [\\mathfrak{g},\\mathfrak{g}],[\\mathfrak{g},\\mathfrak{g},\\mathfrak{g},\\mathfrak{g}],[\\mathfrak{g},\\mathfrak{g}]  > \\cdots\n\nbecomes zero eventually.\n\nEvery finite-dimensional Lie algebra has a unique maximal solvable ideal, called its radical. Under the Lie correspondence, nilpotent (respectively, solvable) connected Lie groups correspond to nilpotent (respectively, solvable) Lie algebras.\n\nSimple and semisimple \n\nA Lie algebra is \"simple\" if it has no non-trivial ideals and is not abelian. (That is to say, a one-dimensional—necessarily abelian—Lie algebra is by definition not simple, even though it has no nontrivial ideals.) A Lie algebra \\mathfrak{g} is called semisimple if it is isomorphic to a direct sum of simple algebras. There are several equivalent characterizations of semisimple algebras, such as having no nonzero solvable ideals. \n\nThe concept of semisimplicity for Lie algebras is closely related with the complete reducibility (semisimplicity) of their representations. When the ground field F has characteristic zero, any finite-dimensional representation of a semisimple Lie algebra is semisimple (i.e., direct sum of irreducible representations.) In general, a Lie algebra is called reductive if the adjoint representation is semisimple. Thus, a semisimple Lie algebra is reductive.\n\nCartan's criterion \n\nCartan's criterion gives conditions for a Lie algebra to be nilpotent, solvable, or semisimple. It is based on the notion of the Killing form, a symmetric bilinear form on \\mathfrak{g} defined by the formula\nK(u,v)=\\operatorname{tr}(\\operatorname{ad}(u)\\operatorname{ad}(v)),\nwhere tr denotes the trace of a linear operator. A Lie algebra \\mathfrak{g} is semisimple if and only if the Killing form is nondegenerate. A Lie algebra \\mathfrak{g} is solvable if and only if K(\\mathfrak{g},[\\mathfrak{g},\\mathfrak{g}])=0.\n\nClassification \n\nThe Levi decomposition expresses an arbitrary Lie algebra as a semidirect sum of its solvable radical and a semisimple Lie algebra, almost in a canonical way. Furthermore, semisimple Lie algebras over an algebraically closed field have been completely classified through their root systems. However, the classification of solvable Lie algebras is a 'wild' problem, and cannot be accomplished in general.\n\nRelation to Lie groups \n\nAlthough Lie algebras are often studied in their own right, historically they arose as a means to study Lie groups.\n\nWe now briefly outline the relationship between Lie groups and Lie algebras. Any Lie group gives rise to a canonically determined Lie algebra (concretely, the tangent space at the identity). Conversely, for any finite-dimensional Lie algebra \\mathfrak g, there exists a corresponding connected Lie group G with Lie algebra \\mathfrak g. This is Lie's third theorem; see the Baker–Campbell–Hausdorff formula. This Lie group is not determined uniquely; however, any two Lie groups with the same Lie algebra are locally isomorphic, and in particular, have the same universal cover. For instance, the special orthogonal group SO(3) and the special unitary group SU(2) give rise to the same Lie algebra, which is isomorphic to R3 with the cross-product, but SU(2) is a simply-connected twofold cover of SO(3).\n\nIf we consider simply connected Lie groups, however, we have a one-to-one correspondence: For each (finite-dimensional real) Lie algebra \\mathfrak g, there is a unique simply connected Lie group G with Lie algebra \\mathfrak g.\n\nThe correspondence between Lie algebras and Lie groups is used in several ways, including in the classification of Lie groups and the related matter of the representation theory of Lie groups.  Every representation of a Lie algebra lifts uniquely to a representation of the corresponding connected, simply connected Lie group, and conversely every representation of any Lie group induces a representation of the group's Lie algebra; the representations are in one-to-one correspondence.  Therefore, knowing the representations of a Lie algebra settles the question of representations of the group.\n\nAs for classification, it can be shown that any connected Lie group with a given Lie algebra is isomorphic to the universal cover mod a discrete central subgroup.  So classifying Lie groups becomes simply a matter of counting the discrete subgroups of the center, once the classification of Lie algebras is known (solved by Cartan et al. in the semisimple case).\n\nIf the Lie algebra is infinite-dimensional, the issue is more subtle.  In many instances, the exponential map is not even locally a homeomorphism (for example, in Diff(S1), one may find diffeomorphisms arbitrarily close to the identity that are not in the image of exp).  Furthermore, some infinite-dimensional Lie algebras are not the Lie algebra of any group.\n\nLie ring \n\nA Lie ring arises as a generalisation of Lie algebras, or through the study of the lower central series of groups. A Lie ring is defined as a nonassociative ring with multiplication that is anticommutative and satisfies the Jacobi identity. More specifically we can define a Lie ring L to be an abelian group with an operation [\\cdot,\\cdot] that has the following properties:\n\n* Bilinearity:\n\n: [x + y, z] [x, z] + [y, z], \\quad  [z, x + y] \n [z, x] + [z, y] \n\nfor all x, y, z ∈ L.\n\n* The Jacobi identity:\n\n:  [x,[y,z + [y,[z,x + [z,[x,y = 0 \\quad \n\nfor all x, y, z in L.\n\n* For all x in L:\n\n: [x,x]=0 \\quad \n\nLie rings need not be Lie groups under addition.  Any Lie algebra is an example of a Lie ring.  Any associative ring can be made into a Lie ring by defining a bracket operator [x,y] = xy - yx.  Conversely to any Lie algebra there is a corresponding ring, called the universal enveloping algebra.\n\nLie rings are used in the study of finite p-groups through the Lazard correspondence.  The lower central factors of a p-group are finite abelian p-groups, so modules over Z/pZ.  The direct sum of the lower central factors is given the structure of a Lie ring by defining the bracket to be the commutator of two coset representatives.  The Lie ring structure is enriched with another module homomorphism, the pth power map, making the associated Lie ring a so-called restricted Lie ring.\n\nLie rings are also useful in the definition of a p-adic analytic groups and their endomorphisms by studying Lie algebras over rings of integers such as the p-adic integers.  The definition of finite groups of Lie type due to Chevalley involves restricting from a Lie algebra over the complex numbers to a Lie algebra over the integers, and the reducing modulo p to get a Lie algebra over a finite field.\n\nExamples \n\n* Any Lie algebra over a general ring instead of a field is an example of a Lie ring.  Lie rings are not Lie groups under addition, despite the name.\n* Any associative ring can be made into a Lie ring by defining a bracket operator [x,y] = xy - yx.\n* For an example of a Lie ring arising from the study of groups, let G be a group with (x,y) x^{-1}y^{-1}xy the commutator operation, and let G \n G_0 \\supseteq G_1 \\supseteq G_2 \\supseteq \\cdots \\supseteq G_n \\supseteq \\cdots be a central series  in G — that is the commutator subgroup (G_i,G_j) is contained in G_{i+j} for any i,j. Then\n\n: L = \\bigoplus G_i/G_{i+1}\n\nis a Lie ring with addition supplied by the group operation (which will be commutative in each homogeneous part), and the bracket operation given by\n\n: [xG_i, yG_j] = (x,y)G_{i+j}\\ \n\nextended linearly. Note that the centrality of the series ensures the commutator (x,y) gives the bracket operation the appropriate Lie theoretic properties.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lie algebra" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17944" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In mathematics, a Lie algebra (pronounced \"Lee\") is a vector space \\mathfrak g together with a non-associative, alternating bilinear map \\mathfrak g \\times \\mathfrak g \\rightarrow \\mathfrak g; (x, y) \\mapsto [x, y], called the Lie bracket, satisfying the Jacobi identity.\n\nLie algebras are closely related to Lie groups, which are groups that are also smooth manifolds, with the property that the group operations of multiplication and inversion are smooth maps. Any Lie group gives rise to a Lie algebra. Conversely, to any finite-dimensional Lie algebra over real or complex numbers, there is a corresponding connected Lie group unique up to covering (Lie's third theorem). This correspondence between Lie groups and Lie algebras allows one to study Lie groups in terms of Lie algebras.\n\nLie algebras and their representations are used extensively in physics, notably in quantum mechanics and particle physics.\n\nLie algebras were so termed by Hermann Weyl after Sophus Lie in the 1930s. In older texts, the name infinitesimal group is used.\n\nHistory \n\nLie algebras were introduced to study the concept of infinitesimal transformations by Marius Sophus Lie in the 1870s, and independently discovered by Wilhelm Killing in the 1880s.\n\nDefinitions \n\nDefinition of a Lie algebra\n\nA Lie algebra is a vector space \\,\\mathfrak{g} over some field F allows more generally for a module over a commutative ring with unit element. together with a binary operation [\\cdot,\\cdot]: \\mathfrak{g}\\times\\mathfrak{g}\\to\\mathfrak{g} called the Lie bracket that satisfies the following axioms:\n\n* Bilinearity,\n: [a x + b y, z] a [x, z] + b [y, z], \\quad  [z, a x + b y] \n a[z, x] + b [z, y] \nfor all scalars a, b in F and all elements x, y, z in \\mathfrak{g}.\n\n* Alternativity,\n: [x,x]=0\\ \nfor all x  in \\mathfrak{g}.\n\n* The Jacobi identity,\n:  [x,[y,z + [z,[x,y + [y,[z,x = 0 \\ \nfor all x, y, z in \\mathfrak{g}.\n\nUsing bilinearity to expand the Lie bracket  [x+y,x+y]  and using alternativity shows that  [x,y] + [y,x]=0\\  for all elements x, y in \\mathfrak{g}, showing that bilinearity and alternativity together imply \n* Anticommutativity,\n:  [x,y] = -[y,x],\\  \nfor all elements x, y in \\mathfrak{g}. If the field's characteristic is not 2 then anticommutativity implies alternativity.\n\nIt is customary to express a Lie algebra in lower-case fraktur, like \\mathfrak{g}. If a Lie algebra is associated with a Lie group, then the spelling of the Lie algebra is the same as that Lie group. For example, the Lie algebra of SU(n) is written as \\mathfrak{su}(n).\n\nFirst example\n\nConsider \\mathfrak{g}=\\mathbb{R}^3, with the bracket defined by \n[x,y]=x\\times y\nwhere \\times is the cross product. The bilinearity, skew-symmetry, and Jacobi identity are all known properties of the cross product. Concretely, if \\{ e_1,e_2,e_3\\}  is the standard basis, then the bracket operation is completely determined by the relations:\n[e_1,e_2]e_3,\\quad [e_2,e_3]\ne_1,\\quad [e_3,e_1]=e_2.\n(E.g., the relation [e_2,e_1]=-e_3 follows from the above by the skew-symmetry of the bracket.)\n\nGenerators and dimension \n\nElements of a Lie algebra \\mathfrak{g} are said to be generators of the Lie algebra if the smallest subalgebra of \\mathfrak{g} containing them is \\mathfrak{g} itself. The dimension of a Lie algebra is its dimension as a vector space over F. The cardinality of a minimal generating set of a Lie algebra is always less than or equal to its dimension.\n\nSubalgebras, ideals and homomorphisms \n\nThe Lie bracket is not associative in general, meaning that x,y],z] need not equal [x,[y,z. (However, it is flexible.) Nonetheless, much of the terminology that was developed in the theory of associative rings or associative algebras is commonly applied to Lie algebras. A subspace \\mathfrak{h} \\subseteq \\mathfrak{g} that is closed under the Lie bracket is called a Lie subalgebra. If a subspace \\mathfrak i\\subseteq\\mathfrak{g} satisfies a stronger condition that\n\n[\\mathfrak{g},\\mathfrak i]\\subseteq \\mathfrak i,\n\nthen \\mathfrak i is called an ideal in the Lie algebra \\mathfrak{g}.Due to the anticommutativity of the commutator, the notions of a left and right ideal in a Lie algebra coincide. A homomorphism between two Lie algebras (over the same base field) is a linear map that is compatible with the respective Lie brackets:\n\n f: \\mathfrak{g}\\to\\mathfrak{g'}, \\quad f([x,y])=[f(x),f(y)], \n\nfor all elements x and y in \\mathfrak{g}. As in the theory of associative rings, ideals are precisely the kernels of homomorphisms; given a Lie algebra \\mathfrak{g} and an ideal \\mathfrak i in it, one constructs the factor algebra or quotient algebra \\mathfrak{g}/\\mathfrak i, and the first isomorphism theorem holds for Lie algebras.\n\nLet S be a subset of \\mathfrak{g}. The set of elements x such that [x, s] = 0 for all s in S forms a subalgebra called the centralizer of S. The centralizer of \\mathfrak{g} itself is called the center of \\mathfrak{g}. Similar to centralizers, if S is a subspace, then the set of x such that [x, s] is in S for all s in S forms a subalgebra called the normalizer of S.\n\nDirect sum and semidirect product \n\nGiven two Lie algebras \\mathfrak{g^{}} and \\mathfrak{g'}, their direct sum is the Lie algebra consisting of the vector space\n\\mathfrak{g}\\oplus\\mathfrak{g'}, of the pairs \\mathfrak{}(x,x'), \\,x\\in\\mathfrak{g}, x'\\in\\mathfrak{g'}, with the operation\n\n [(x,x'),(y,y')]=([x,y],[x',y']), \\quad x,y\\in\\mathfrak{g},\\, x',y'\\in\\mathfrak{g'}.\n\nLet \\mathfrak{g} be a Lie algebra and \\mathfrak{i} an ideal of \\mathfrak{g}. If the canonical map \\mathfrak{g} \\to \\mathfrak{g}/\\mathfrak{i} splits (i.e., admits a section), then \\mathfrak{g} is said to be a semidirect product of \\mathfrak{i} and \\mathfrak{g}/\\mathfrak{i}, \\mathfrak{g}=\\mathfrak{g}/\\mathfrak{i}\\ltimes\\mathfrak{i}. See also semidirect sum of Lie algebras.\n\nLevi's theorem says that a finite-dimensional Lie algebra is a semidirect product of its radical and the complementary subalgebra (Levi subalgebra).\n\nEnveloping algebra \n\nFor any associative algebra A with multiplication *,  one can construct a Lie algebra L(A). As a vector space, L(A) is the same as A. The Lie bracket of two elements of L(A) is defined to be their commutator in A:\n\n [a,b]=a * b-b * a.\\ \n\nThe associativity of the multiplication * in A implies the Jacobi identity of the commutator in L(A). For example, the associative algebra of n × n matrices over a field F gives rise to the general linear Lie algebra \\mathfrak{gl}_n(F). The associative algebra A is called an enveloping algebra of the Lie algebra L(A). Every Lie algebra can be embedded into one that arises from an associative algebra in this fashion; see universal enveloping algebra.\n\nDerivations \n\nA derivation on the Lie algebra \\mathfrak{g} (in fact on any non-associative algebra) is a linear map \\delta:\\mathfrak{g}\\rightarrow \\mathfrak{g} that obeys the Leibniz law, that is,\n\\delta ([x,y]) = [\\delta(x),y] + [x, \\delta(y)]\nfor all x and y in the algebra. For any x, \\operatorname{ad}(x) is a derivation; a consequence of the Jacobi identity. Thus, the image of \\operatorname{ad} lies in the subalgebra of \\mathfrak{gl}(\\mathfrak{g}) consisting of derivations on \\mathfrak{g}. A derivation that happens to be in the image of \\operatorname{ad} is called an inner derivation. If \\mathfrak{g} is semisimple, every derivation on \\mathfrak{g} is inner.\n\nExamples \n\nVector spaces \n\nAny vector space V endowed with the identically zero Lie bracket becomes a Lie algebra. Such Lie algebras are called abelian, cf. below. Any one-dimensional Lie algebra over a field is abelian, by the antisymmetry of the Lie bracket.\n* The real vector space of all n × n skew-hermitian matrices is closed under the commutator and forms a real Lie algebra denoted \\mathfrak{u}(n). This is the Lie algebra of the unitary group U(n).\n\nAssociative algebra \n\n* On an associative algebra A over a field F with multiplication (x, y) \\mapsto xy, a Lie bracket may be defined by the commutator [x,y] = xy - yx. With this bracket, A is a Lie algebra.\n* The associative algebra of endomorphisms of a F-vector space E with the above Lie bracket is denoted \\mathfrak{gl}(E). If E = F^n, the notation is \\mathfrak{gl}(n, F) or \\mathfrak{gl}_n(F).\n\nSubspaces \n\nEvery subalgebra  (subspace closed under the Lie bracket) of a Lie algebra is a Lie algebra in its own right.\n* The subspace of the general linear Lie algebra \\mathfrak{gl}_n(F) consisting of matrices of trace zero is a subalgebra,Humphreys p.2 the special linear Lie algebra, denoted \\mathfrak{sl}_n(F).\n\nMatrix Lie groups \n\nAny Lie group  defines an associated real Lie algebra \\mathfrak{g}=\\mathrm{Lie}(G). The definition in general is somewhat technical, but in the case of a real matrix group G, it can be formulated via the exponential map, or the matrix exponential. The Lie algebra \\mathfrak{g} of G may be computed as\n\\mathfrak{g} = \\{ X \\in M(n,C) | \\operatorname{exp}(tX) \\in G \\text{ for all } t \\text{ in } \\mathbb{\\mathbb{R}} \\}. Section 3.3\nThe Lie bracket of \\mathfrak{g} is given by the commutator of matrices, [X,Y]=XY-YX. The following are examples of Lie algebras of matrix Lie groups: Section 3.4\n* The special linear group SL(n,R), consisting of all n × n matrices with real entries and determinant 1. Its Lie algebra consists of all n × n matrices with real entries and trace 0.\n* The unitary group U(n) consists of n × n unitary matrices (those satisfying U^*U^{-1}). Its Lie algebra consists of skew-self-adjoint matrices (those satisfying X^*\n-X).\n* The orthogonal and special orthogonal groups O(n) and SO(n) have the same Lie algebra, consisting of real, skew-symmetric matrices (those satisfying X^{tr}=-X).\n\nTwo Dimensions \n\n* On any field \\mathbf{F} there is, up to isomorphism, a single two-dimensional nonabelian Lie algebra with generators (x, y) and bracket defined as  \\left [x, y\\right ] = y. It generates the affine group in one dimension. So, for \n x\\left( \\begin{array}{cc} 1 & 0\\\\ 0 & 0 \\end{array}\\right), \\qquad y\n   \\left( \\begin{array}{cc} 0 & 1\\\\ 0 & 0 \\end{array}\\right),   \nthe resulting group elements are upper triangular 2×2 matrices with unit lower diagonal,\n e^{ax+by}= \\left( \\begin{array}{cc} e^a & \\tfrac{b}{a}(e^a-1)\\\\ 0 & 1 \\end{array}\\right) . \n\nThree dimensions \n\n* The three-dimensional Euclidean space R3  with the Lie bracket given by the cross product of vectors becomes a three-dimensional Lie algebra.\n* The Heisenberg algebra H3(R) is a three-dimensional Lie algebra generated by elements ,    and   with Lie brackets\n: [x,y]z,\\quad [x,z]\n0, \\quad [y,z]=0 .\nIt is explicitly realized as the space of 3×3 strictly upper-triangular matrices, with the Lie bracket given by the matrix commutator,\n:\nx = \\left( \\begin{array}{ccc}\n0&1&0\\\\\n0&0&0\\\\\n0&0&0\n\\end{array}\\right),\\quad\ny = \\left( \\begin{array}{ccc}\n0&0&0\\\\\n0&0&1\\\\\n0&0&0\n\\end{array}\\right),\\quad\nz = \\left( \\begin{array}{ccc}\n0&0&1\\\\\n0&0&0\\\\\n0&0&0\n\\end{array}\\right)~.\\quad\n\nAny element of the Heisenberg group is thus representable as a product of group generators, i.e., matrix exponentials of these Lie algebra generators, \n:\\left( \\begin{array}{ccc}\n1&a&c\\\\\n0&1&b\\\\\n0&0&1\n\\end{array}\\right)= e^{by} e^{cz} e^{ax}~.\n\n* The Lie algebra so(3) of the group SO(3) is spanned by the three matrices Example 3.27\n:\nF_1 = \\left( \\begin{array}{ccc}\n0&0&0\\\\\n0&0&-1\\\\\n0&1&0\n\\end{array}\\right),\\quad\nF_2 = \\left( \\begin{array}{ccc}\n0&0&1\\\\\n0&0&0\\\\\n-1&0&0\n\\end{array}\\right),\\quad\nF_3 = \\left( \\begin{array}{ccc}\n0&-1&0\\\\\n1&0&0\\\\\n0&0&0\n\\end{array}\\right)~.\\quad\n\nThe commutation relations among these generators are\n: [F_1, F_2] = F_3\n: [F_2, F_3] = F_1\n: [F_3, F_1] = F_2  .\nThese commutation relations are essentially the same as those among the x, y, and z components of the angular momentum operator in quantum mechanics.\n\nInfinite dimensions \n\n* An important class of infinite-dimensional real Lie algebras arises in differential topology. The space of smooth vector fields on a differentiable manifold M forms a Lie algebra, where the Lie bracket is defined to be the commutator of vector fields. One way of expressing the Lie bracket is through the formalism of Lie derivatives, which identifies a vector field X with a first order partial differential operator LX acting on smooth functions by letting LX(f) be the directional derivative of the function f in the direction of X. The Lie bracket [X,Y] of two vector fields is the vector field defined through its action on functions by the formula:\n \t\n:  L_{[X,Y]}f=L_X(L_Y f)-L_Y(L_X f).\\,\n\n* A Kac–Moody algebra is an example of an infinite-dimensional Lie algebra.\n* The Moyal algebra is an infinite-dimensional Lie algebra that contains all classical Lie algebras as subalgebras.\n* The Virasoro algebra is of paramount importance in string theory.\n\nRepresentations \n\nDefinitions\n\nGiven a vector space V, let \\mathfrak{gl}(V) denote the Lie algebra consisting of all linear endomorphisms of V, with bracket given by [X,Y]=XY-YX. A representation of a Lie algebra \\mathfrak{g} on V is a Lie algebra homomorphism\n\\pi: \\mathfrak g \\to \\mathfrak{gl}(V).\n\nA representation is said to be faithful if its kernel is zero. Ado's theorem states that every finite-dimensional Lie algebra has a faithful representation on a finite-dimensional vector space.\n\nAdjoint representation\n\nFor any Lie algebra \\mathfrak{g}, we can define a representation\n\\operatorname{ad}: \\mathfrak{g} \\to \\mathfrak{gl}(\\mathfrak{g})\ngiven by \\operatorname{ad}(x)(y) = [x, y] is a representation of \\mathfrak{g} on the vector space \\mathfrak{g} called the adjoint representation.\n\nGoals of representation theory\n\nOne important aspect of the study of Lie algebras (especially semisimple Lie algebras) is the study of their representations. (Indeed, most of the books listed in the references section devote a substantial fraction of their pages to representation theory.) Although Ado's theorem is an important result, the primary goal of representation theory is not to find a faithful representation of a given Lie algebra \\mathfrak{g}. Indeed, in the semisimple case, the adjoint representation is already faithful. Rather the goal is to understand all possible representation of \\mathfrak{g}, up to the natural notion of equivalence. In the semisimple case, Weyl's theorem says that every finite-dimensional representation is a direct sum of irreducible representations (those with no nontrivial invariant subspaces). The irreducible representations, in turn, are classified by a theorem of the highest weight.\n\nRepresentation theory in physics\n\nThe representation theory of Lie algebras plays an important role in various parts of theoretical physics. There, one considers operators on the space of states that satisfy certain natural commutation relations. These commutation relations typically come from a symmetry of the problem—specifically, they are the relations of the Lie algebra of the relevant symmetry group. An example would be the angular momentum operators, whose commutation relations are those of the Lie algebra so(3) of the rotation group SO(3). Typically, the space of states is very far from being irreducible under the pertinent operators, but one can attempt to decompose it into irreducible pieces. In doing so, one needs to know what the irreducible representations of the given Lie algebra are. In the study of the quantum hydrogen atom, for example, quantum mechanics textbooks give (without calling it that) a classification of the irreducible representations of the Lie algebra so(3).\n\nStructure theory and classification \n\nLie algebras can be classified to some extent. In particular, this has an application to the classification of Lie groups.\n\nAbelian, nilpotent, and solvable \n\nAnalogously to abelian, nilpotent, and solvable groups, defined in terms of the derived subgroups, one can define abelian, nilpotent, and solvable Lie algebras.\n\nA Lie algebra \\mathfrak{g} is abelian if the Lie bracket vanishes, i.e. [x,y] = 0, for all x and y in \\mathfrak{g}. Abelian Lie algebras correspond to commutative (or abelian) connected Lie groups such as vector spaces K^n or tori T^n, and are all of the form \\mathfrak{k}^n, meaning an n-dimensional vector space with the trivial Lie bracket.\n\nA more general class of Lie algebras is defined by the vanishing of all commutators of given length. A Lie algebra \\mathfrak{g} is nilpotent if the lower central series\n\n \\mathfrak{g} > [\\mathfrak{g},\\mathfrak{g}] > \\mathfrak{g},\\mathfrak{g}],\\mathfrak{g}] > [\\mathfrak{g},\\mathfrak{g}],\\mathfrak{g}],\\mathfrak{g}] > \\cdots\n\nbecomes zero eventually. By Engel's theorem, a Lie algebra is nilpotent if and only if for every u in \\mathfrak{g} the adjoint endomorphism\n\n\\operatorname{ad}(u):\\mathfrak{g} \\to \\mathfrak{g}, \\quad \\operatorname{ad}(u)v=[u,v]\n\nis nilpotent.\n\nMore generally still, a Lie algebra \\mathfrak{g} is said to be solvable if the derived series:\n\n \\mathfrak{g} > [\\mathfrak{g},\\mathfrak{g}] > \\mathfrak{g},\\mathfrak{g}],[\\mathfrak{g},\\mathfrak{g} > [\\mathfrak{g},\\mathfrak{g}],[\\mathfrak{g},\\mathfrak{g},\\mathfrak{g},\\mathfrak{g}],[\\mathfrak{g},\\mathfrak{g}]  > \\cdots\n\nbecomes zero eventually.\n\nEvery finite-dimensional Lie algebra has a unique maximal solvable ideal, called its radical. Under the Lie correspondence, nilpotent (respectively, solvable) connected Lie groups correspond to nilpotent (respectively, solvable) Lie algebras.\n\nSimple and semisimple \n\nA Lie algebra is \"simple\" if it has no non-trivial ideals and is not abelian. (That is to say, a one-dimensional—necessarily abelian—Lie algebra is by definition not simple, even though it has no nontrivial ideals.) A Lie algebra \\mathfrak{g} is called semisimple if it is isomorphic to a direct sum of simple algebras. There are several equivalent characterizations of semisimple algebras, such as having no nonzero solvable ideals. \n\nThe concept of semisimplicity for Lie algebras is closely related with the complete reducibility (semisimplicity) of their representations. When the ground field F has characteristic zero, any finite-dimensional representation of a semisimple Lie algebra is semisimple (i.e., direct sum of irreducible representations.) In general, a Lie algebra is called reductive if the adjoint representation is semisimple. Thus, a semisimple Lie algebra is reductive.\n\nCartan's criterion \n\nCartan's criterion gives conditions for a Lie algebra to be nilpotent, solvable, or semisimple. It is based on the notion of the Killing form, a symmetric bilinear form on \\mathfrak{g} defined by the formula\nK(u,v)=\\operatorname{tr}(\\operatorname{ad}(u)\\operatorname{ad}(v)),\nwhere tr denotes the trace of a linear operator. A Lie algebra \\mathfrak{g} is semisimple if and only if the Killing form is nondegenerate. A Lie algebra \\mathfrak{g} is solvable if and only if K(\\mathfrak{g},[\\mathfrak{g},\\mathfrak{g}])=0.\n\nClassification \n\nThe Levi decomposition expresses an arbitrary Lie algebra as a semidirect sum of its solvable radical and a semisimple Lie algebra, almost in a canonical way. Furthermore, semisimple Lie algebras over an algebraically closed field have been completely classified through their root systems. However, the classification of solvable Lie algebras is a 'wild' problem, and cannot be accomplished in general.\n\nRelation to Lie groups \n\nAlthough Lie algebras are often studied in their own right, historically they arose as a means to study Lie groups.\n\nWe now briefly outline the relationship between Lie groups and Lie algebras. Any Lie group gives rise to a canonically determined Lie algebra (concretely, the tangent space at the identity). Conversely, for any finite-dimensional Lie algebra \\mathfrak g, there exists a corresponding connected Lie group G with Lie algebra \\mathfrak g. This is Lie's third theorem; see the Baker–Campbell–Hausdorff formula. This Lie group is not determined uniquely; however, any two Lie groups with the same Lie algebra are locally isomorphic, and in particular, have the same universal cover. For instance, the special orthogonal group SO(3) and the special unitary group SU(2) give rise to the same Lie algebra, which is isomorphic to R3 with the cross-product, but SU(2) is a simply-connected twofold cover of SO(3).\n\nIf we consider simply connected Lie groups, however, we have a one-to-one correspondence: For each (finite-dimensional real) Lie algebra \\mathfrak g, there is a unique simply connected Lie group G with Lie algebra \\mathfrak g.\n\nThe correspondence between Lie algebras and Lie groups is used in several ways, including in the classification of Lie groups and the related matter of the representation theory of Lie groups.  Every representation of a Lie algebra lifts uniquely to a representation of the corresponding connected, simply connected Lie group, and conversely every representation of any Lie group induces a representation of the group's Lie algebra; the representations are in one-to-one correspondence.  Therefore, knowing the representations of a Lie algebra settles the question of representations of the group.\n\nAs for classification, it can be shown that any connected Lie group with a given Lie algebra is isomorphic to the universal cover mod a discrete central subgroup.  So classifying Lie groups becomes simply a matter of counting the discrete subgroups of the center, once the classification of Lie algebras is known (solved by Cartan et al. in the semisimple case).\n\nIf the Lie algebra is infinite-dimensional, the issue is more subtle.  In many instances, the exponential map is not even locally a homeomorphism (for example, in Diff(S1), one may find diffeomorphisms arbitrarily close to the identity that are not in the image of exp).  Furthermore, some infinite-dimensional Lie algebras are not the Lie algebra of any group.\n\nLie ring \n\nA Lie ring arises as a generalisation of Lie algebras, or through the study of the lower central series of groups. A Lie ring is defined as a nonassociative ring with multiplication that is anticommutative and satisfies the Jacobi identity. More specifically we can define a Lie ring L to be an abelian group with an operation [\\cdot,\\cdot] that has the following properties:\n\n* Bilinearity:\n\n: [x + y, z] [x, z] + [y, z], \\quad  [z, x + y] \n [z, x] + [z, y] \n\nfor all x, y, z ∈ L.\n\n* The Jacobi identity:\n\n:  [x,[y,z + [y,[z,x + [z,[x,y = 0 \\quad \n\nfor all x, y, z in L.\n\n* For all x in L:\n\n: [x,x]=0 \\quad \n\nLie rings need not be Lie groups under addition.  Any Lie algebra is an example of a Lie ring.  Any associative ring can be made into a Lie ring by defining a bracket operator [x,y] = xy - yx.  Conversely to any Lie algebra there is a corresponding ring, called the universal enveloping algebra.\n\nLie rings are used in the study of finite p-groups through the Lazard correspondence.  The lower central factors of a p-group are finite abelian p-groups, so modules over Z/pZ.  The direct sum of the lower central factors is given the structure of a Lie ring by defining the bracket to be the commutator of two coset representatives.  The Lie ring structure is enriched with another module homomorphism, the pth power map, making the associated Lie ring a so-called restricted Lie ring.\n\nLie rings are also useful in the definition of a p-adic analytic groups and their endomorphisms by studying Lie algebras over rings of integers such as the p-adic integers.  The definition of finite groups of Lie type due to Chevalley involves restricting from a Lie algebra over the complex numbers to a Lie algebra over the integers, and the reducing modulo p to get a Lie algebra over a finite field.\n\nExamples \n\n* Any Lie algebra over a general ring instead of a field is an example of a Lie ring.  Lie rings are not Lie groups under addition, despite the name.\n* Any associative ring can be made into a Lie ring by defining a bracket operator [x,y] = xy - yx.\n* For an example of a Lie ring arising from the study of groups, let G be a group with (x,y) x^{-1}y^{-1}xy the commutator operation, and let G \n G_0 \\supseteq G_1 \\supseteq G_2 \\supseteq \\cdots \\supseteq G_n \\supseteq \\cdots be a central series  in G — that is the commutator subgroup (G_i,G_j) is contained in G_{i+j} for any i,j. Then\n\n: L = \\bigoplus G_i/G_{i+1}\n\nis a Lie ring with addition supplied by the group operation (which will be commutative in each homogeneous part), and the bracket operation given by\n\n: [xG_i, yG_j] = (x,y)G_{i+j}\\ \n\nextended linearly. Note that the centrality of the series ensures the commutator (x,y) gives the bracket operation the appropriate Lie theoretic properties. Lie algebra. http://en.wikipedia.org/?curid=17944."
  }
}
