{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19712",
  "eid" : "3d3d6450-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778611989,
  "textBody" : "Methanol, also known as methyl alcohol among others, is a chemical with the formula CH3OH (often abbreviated MeOH). Methanol acquired the name wood alcohol because it was once produced chiefly as a byproduct of the destructive distillation of wood.  Today, industrial methanol is produced in a catalytic process directly from carbon monoxide, carbon dioxide, and hydrogen.\n\nMethanol is the simplest alcohol, being only a methyl group linked to a hydroxyl group. It is a light, volatile, colorless, flammable liquid with a distinctive odor very similar to that of ethanol (drinking alcohol).\n However, unlike ethanol, methanol is highly toxic and unfit for consumption. At room temperature, it is a polar liquid. It is used as an antifreeze, solvent, fuel, and as a denaturant for ethanol. It is also used for producing biodiesel by transesterification reaction.\n\nMethanol is produced naturally in the anaerobic metabolism of many varieties of bacteria and is commonly present in small amounts in the environment. As a result, the atmosphere contains a small amount of methanol vapor. However, in only a few days, atmospheric methanol is oxidized by sunlight to produce carbon dioxide and water.\n\nMethanol is also found in abundant quantities in star-forming regions of space and is used in astronomy as a marker for such regions. It is detected through its spectral emission lines.\n\nMethanol when drunk is metabolized first to formaldehyde and then to formic acid or formate salts. These are poisonous to the central nervous system and may result in blindness, coma, and death. Because of these toxic properties, methanol is frequently used as a denaturant additive for ethanol manufactured for industrial uses. This addition of methanol exempts industrial ethanol (commonly known as \"denatured alcohol\" or \"methylated spirit\") from liquor excise taxation in the US and some other countries.\n\nOccurrence\n\nHuman metabolite\n\nMethanol is poisonous to the central nervous system and may cause blindness, coma, and death. However, in small amounts, methanol is a natural endogenous compound found in normal, healthy human individuals, concluded by one study which found a mean of 4.5 ppm in the exhaled breath of subjects. The mean endogenous methanol in humans of 0.45 g/d may be metabolized from pectin found in fruit; one kilogram of apple produces up to 1.4 g methanol.\n\nToxicity\n\nMethanol has a high toxicity in humans. As little as 10 mL of pure methanol, ingested, is metabolized into formic acid, which can cause permanent blindness by destruction of the optic nerve.  30 mL is potentially fatal, although the median lethal dose is typically 100 mL (3.4 fl oz) (i.e. 1–2 mL/kg body weight of pure methanol). The reference dose for methanol is 2 mg/kg in a day. Toxic effects begin hours after ingestion, and antidotes can often prevent permanent damage. Because of its similarities in both appearance and odor to ethanol (the alcohol in beverages), it is difficult to differentiate between the two (such is also the case with denatured alcohol, adulterated liquors or very low quality alcoholic beverages). However, there are cases of methanol resistance, such as that of Mike Malloy who was the victim of a failed murder attempt by methanol in the early 1930s.\n\nMethanol is toxic by two mechanisms. First, methanol (whether it enters the body by ingestion, inhalation, or absorption through the skin) can be fatal due to its CNS depressant properties in the same manner as ethanol poisoning. Second, in a process of toxication, it is metabolized to formic acid (which is present as the formate ion) via formaldehyde in a process initiated by the enzyme alcohol dehydrogenase in the liver. Methanol is converted to formaldehyde via alcohol dehydrogenase (ADH) and formaldehyde is converted to formic acid (formate) via aldehyde dehydrogenase (ALDH).  The conversion to formate via ALDH proceeds completely, with no detectable formaldehyde remaining. Formate is toxic because it inhibits mitochondrial cytochrome c oxidase, causing hypoxia at the cellular level, and metabolic acidosis, among a variety of other metabolic disturbances.\n\nOutbreaks of methanol poisoning have occurred due to contamination of drinking alcohol. This is more common in the developing world. In 2013 more than 1700 cases occurred in the United States. Those affected are often adult males. Outcomes may be good with early treatment. Toxicity to methanol was described as early as 1856.\n\nApplications\n\nMethanol is used primarily as a feedstock for the manufacture of chemicals, and as a fuel for specialized vehicles. As mentioned above, it is a common denaturing agent. As a common laboratory solvent, methanol is especially useful for HPLC, UV/VIS spectroscopy, and LCMS due to its low UV cutoff.\n\nChemical industry\n\nMethanol is primarily used in making other chemicals. About 40% of methanol is converted to formaldehyde, and from there into products as diverse as plastics, plywood, paints, explosives, and permanent press textiles.\n\nCondensation of methanol molecules to produce hydrocarbon chains and even aromatic systems has been demonstrated with loss of water, carbon monoxide, and/or carbon dioxide (loss of oxygen is prohibited on thermodynamic grounds).  As early as 1880, an aromatisation reaction which generated hexamethylbenzene as a minor product with a mixture of mostly aliphatic hydrocarbons directly from methanol, using zinc chloride as catalyst, had been demonstrated.  At 283 °C, the melting point of ZnCl2, the idealised reaction for the production of hexamethylbenzene has a ΔG of −261 kcal mol−1.\n\n15  →  + 3  + 15 \n\nIn the early 1970s, a process was developed by Mobil for producing gasoline fuel for vehicles. One such industrial facility was built at Motunui in New Zealand in the 1980s. In the 1990s, large amounts of methanol were used in the United States to produce the gasoline additive methyl tert-butyl ether (MTBE). While MTBE is no longer marketed in the U.S., it is still widely used in other parts of the world.  Methanol (or less commonly, ethanol) is a component in the transesterification of triglycerides for production of biodiesel.\n\nOther chemical derivatives of methanol include acetic acid and dimethyl ether (DME), the latter of which has replaced chlorofluorocarbons as an aerosol spray propellant. Dimethyl ether can also be blended with liquified petroleum gas (LPG) for home heating and cooking, and can be used as a replacement for transportation diesel fuel.\n\nOf high interest to the petrochemical marketplace, methanol is an important ingredient in new and lower-cost methods for producing propylene, which is much in demand.  Such methods include methanol-to-olefins (MTO), methanol-to-propylene (MTO/MTP), metathesis, propane dehydrogenation (PDH), high severity FCC, and olefins cracking.\n\nThe market for propynyl became tight when the ethane prices fell in the US with the exploration of shale gas reserves. The low priced ethylene produced from this raw material has given chemical producers in North America a feedstock advantage.  Such change has put naphtha-fed steam crackers at a disadvantageous position, with many of them shutting down or revamping to use ethane as feedstock.  Nevertheless, the propylene output rates from ethane-fed crackers are negligible.\n\nFuel for vehicles\n\nMethanol is occasionally used to fuel internal combustion engines. Pure methanol is required by rule to be used in Champcars, Monster Trucks, USAC sprint cars (as well as midgets, modifieds, etc.), and other dirt track series, such as World of Outlaws, and Motorcycle Speedway, mainly because, in the event of an accident, methanol does not produce an opaque cloud of smoke. Since the late 1940s, Methanol is also used as the primary fuel ingredient in the powerplants for radio control, control line, free flight airplanes, cars and trucks; such engines use a platinum filament glow plug that ignites the methanol vapor through a catalytic reaction. Drag racers, mud racers, and heavily modified tractor pullers also use methanol as the primary fuel source. Methanol is required with a supercharged engine in a Top Alcohol Dragster and, until the end of the 2006 season, all vehicles in the Indianapolis 500 had to run on methanol. As a fuel for mud racers, methanol mixed with gasoline and nitrous oxide produces more power than gasoline and nitrous oxide alone.\n\nMethanol burns in oxygen, including open air, forming carbon dioxide and water:\n\n2 CH3OH + 3 O2 → 2 CO2 + 4 H2O\n\nOne problem with high concentrations of methanol in fuel is that alcohols corrode some metals, particularly aluminium.  An acid, albeit weak, methanol attacks the oxide coating that normally protects the aluminium from corrosion:\n\n6 CH3OH + Al2O3 → 2 Al(OCH3)3 + 3 H2O\n\nThe resulting methoxide salts are soluble in methanol, resulting in a clean aluminium surface, which is readily oxidized by dissolved oxygen.  Also, the methanol can act as an oxidizer:\n\n6 CH3OH + 2 Al → 2 Al(OCH3)3 + 3 H2\n\nThis reciprocal process effectively fuels corrosion until either the metal is eaten away or the concentration of CH3OH is negligible. Methanol's corrosivity has been addressed with methanol-compatible materials and fuel additives that serve as corrosion inhibitors.\n\nOrganic methanol, produced from wood or other organic materials (bioalcohol), has been suggested as a renewable alternative to petroleum-based hydrocarbons. Low levels of methanol can be used in existing vehicles with the addition of cosolvents and corrosion inhibitors.\n\nMethanol fuel has been proposed for ground transportation. The chief advantage of a methanol economy is that it could be adapted to gasoline internal combustion engines with minimum modification to the engines and to the infrastructure that delivers and stores liquid fuel.\n\nSafety in automotive fuels\n\nPure methanol has been used in open wheel auto racing since the mid-1960s. Unlike petroleum fires, methanol fires can be extinguished with plain water. A methanol-based fire burns invisibly, unlike gasoline, which burns with a visible flame. If a fire occurs on the track, there is no flame or smoke to obstruct the view of fast approaching drivers, but this can also delay visual detection of the fire and the initiation of fire suppression. The decision to permanently switch to methanol in American IndyCar racing was a result of the devastating crash and explosion at the 1964 Indianapolis 500, which killed drivers Eddie Sachs and Dave MacDonald. In 2007 IndyCars switched from methanol to ethanol.\n\nGovernment policy\n\nThe European Fuel Quality Directive allows up to 3% methanol with an equal amount of cosolvent to be blended with gasoline sold in Europe. China uses more than one billion gallons of methanol per year as a transportation fuel in low level blends for conventional vehicles and high level blends in vehicles designed for methanol fuels.\n\nIn the US, the Open Fuel Standard Act of 2011 was introduced in the US Congress to encourage car manufacturers to build cars capable of using methanol, gasoline, or ethanol fuels. The bill is being championed by the [http://www.openfuelstandard.org/ Open Fuel Standard Coalition].\n\nProduction of synthesis gas\n\nStoichiometry for methanol production of syngas requires the ratio of H2 / CO to equal 2.  The partial oxidation process yields a ratio of 2, and the steam reforming process yields a ratio of 3.\nThe H2 / CO ratio can be lowered to some extent by the reverse water-gas shift reaction,\n\nCO2 + H2 → CO + H2O,\n\nto provide the appropriate stoichiometry for methanol synthesis.\n\nEnergy carrier\n\nMethanol is useful as an energy carrier because it is easier to store than hydrogen and burns cleaner than fossil fuels.\n\nMethanol is readily biodegradable in both aerobic (oxygen present) and anaerobic (oxygen absent) environments. Methanol will not persist in the environment. The half-life for methanol in groundwater is just one to seven days, while many common gasoline components have half-lives in the hundreds of days (such as benzene at 10–730 days). Since methanol is miscible with water and biodegradable, it is unlikely to accumulate in groundwater, surface water, air or soil.[http://www.methanol.org/Environment/Resources/Environment/MP-Methanol-Fate.aspx Evaluation of the Fate and Transport of Methanol in the Environment] , Malcolm Pirnie, Inc., January 1999.\n\nOther applications\n\nMethanol is a traditional denaturant for ethanol, the product being known as \"denatured alcohol\" or \"methylated spirit\". This was commonly used during the Prohibition to discourage consumption of bootlegged liquor, and ended up causing several deaths.\n\nMethanol is used as a solvent and as an antifreeze in pipelines and windshield washer fluid.\n\nIn some wastewater treatment plants, a small amount of methanol is added to wastewater to provide a carbon food source for the denitrifying bacteria, which convert nitrates to nitrogen gas and reduce the nitrification of sensitive aquifers.\n\nDuring World War II, methanol was used as a fuel in several German military rocket designs, under the name M-Stoff, and in a roughly 50/50 mixture with hydrazine, known as C-Stoff.\n\nMethanol was used as an automobile coolant antifreeze in the early 1900s.\n\nMethanol is used as a destaining agent in polyacrylamide gel electrophoresis.\n\nDirect-methanol fuel cells are unique in their low temperature, atmospheric pressure operation, allowing them to be miniaturized to an unprecedented degree. This, combined with the relatively easy and safe storage and handling of methanol, may open the possibility of fuel cell-powered consumer electronics, such as laptop computers and mobile phones.\n\nMethanol is also a widely used fuel in camping and boating stoves. Methanol burns well in an unpressurized burner, so alcohol stoves are often very simple, sometimes little more than a cup to hold fuel. This lack of complexity makes them a favorite of hikers who spend extended time in the wilderness.  Similarly, the alcohol can be gelled to reduce risk of leaking or spilling, as with the brand \"Sterno\".\n\nMethanol is mixed with water and injected into high performance diesel and gasoline engines for an increase of power and a decrease in intake air temperature in a process known as water methanol injection.\n\nProduction\n\nFrom synthesis gas\n\nCarbon monoxide and hydrogen react over a catalyst to produce methanol. Today, the most widely used catalyst is a mixture of copper and zinc oxides, supported on alumina, as first used by ICI in 1966. At 5–10 MPa (50–100 atm) and 250 C, the reaction is characterized by high selectivity (>99.8%):\n\nCO + 2 H2 → CH3OH\n\nThe production of synthesis gas from methane produces three moles of hydrogen for every mole of carbon monoxide, whereas the synthesis consumes only two moles of hydrogen gas per mole of carbon monoxide. One way of dealing with the excess hydrogen is to inject carbon dioxide into the methanol synthesis reactor, where it, too, reacts to form methanol according to the equation:\n\nCO2  +  3 H2   →   CH3OH  +  H2O\n\nIn terms of mechanism, the process occurs via initial conversion of CO into CO2, which is then hydrogenated:Olaf Deutschmann, Helmut Knözinger, Karl Kochloefl, Thomas Turek \"Heterogeneous Catalysis and Solid Catalysts, 3. Industrial Applications\" in Ullmann's Encyclopedia of Industrial Chemistry\" 2012, Wiley-VCH, Weinheim. \nCO2 + 3 H2 → CH3OH + H2O\nwhere the H2O byproduct is recycled via the water-gas shift reaction\nCO + H2O → CO2 + H2,\nThis gives an overall reaction, which is the same as listed above.\nCO + 2 H2 → CH3OH\n\nOther\n\nThe catalytic conversion of methane to methanol has long been sought as a route to methanol.  This route is effected by enzymes such as methane monooxygenases but commercial routes remain elusive because of the tendency for over-oxidation, i.e., methanol is more readily oxidized than methane.\n\nQuality specifications and analysis\n\nLaboratory use\n\nMethanol is available commercially in various purity grades for fine chemicals:\n* \"Synthesis\" quality (corresponding to normal commercial methanol)\n* Certified analytical quality\n* Extremely pure qualities for semiconductor manufacture\n\nCommercial methanol\n\nIn addition to laboratory grades, commercial methanol is generally classified according to ASTM purity grades A and AA. Methanol for chemical use normally corresponds to Grade AA. In addition to water, typical impurities include acetone and ethanol (which are very difficult to separate by distillation). When methanol is delivered by ships or tankers used to transport\nother substances, contamination by the previous cargo must be expected. Comparative ultraviolet spectroscopy has proved a convenient, quick test method for deciding whether a batch can be accepted and loaded. Traces of all chemicals derived from aromatic parent substances, as well as a large number of other compounds, can be detected. Further tests for establishing the quality of methanol include measurements of boiling point range, density, permanganate number, turbidity, color index, and acid number. More comprehensive tests include water determination according to the Karl Fischer method and gas chromatographic determination of byproducts. However, the latter is relatively expensive and time-consuming because several injections using different columns and detectors must be made due to the variety of byproducts present.\nHistory\n\nIn their embalming process, the ancient Egyptians used a mixture of substances, including methanol, which they obtained from the pyrolysis of wood. Pure methanol, however, was first isolated in 1661 by Robert Boyle, when he produced it via the distillation of buxus (boxwood).Boyle discusses the distillation of liquids from the wood of the box shrub in:  Robert Boyle, The Sceptical Chymist (London, England:  J. Cadwell, 1661), [https://archive.org/stream/scepticalchymis00BoylA#page/192/mode/2up/ pp. 192–195]. It later became known as \"pyroxylic spirit\". In 1834, the French chemists Jean-Baptiste Dumas and Eugene Peligot determined its elemental composition.A report on methanol to the French Academy of Sciences by J. Dumas and E. Péligot began during the Academy's meeting of October 27, 1834 and finished during the meeting of November 3, 1834.  See:  Procès-verbaux des séances de l'Académie, 10 :  600–601.  Available on:  [http://gallica.bnf.fr/ark:/12148/bpt6k33037/f606.image Gallica].  The complete report appears in:  J. Dumas and E. Péligot (1835) [ \"Mémoire sur l'espirit de bois et sur les divers composés ethérés qui en proviennent\"] (Memoir on spirit of wood and on the various ethereal compounds that derive therefrom), Annales de chimie et de physique, 58 : 5–74; from [ page 9]:  Nous donnerons le nom de méthylène (1) à un radical …  (1) Μεθυ, vin, et υλη, bois; c'est-à-dire vin ou liqueur spiritueuse du bois. (We will give the name methylene (1) to a radical …  (1) methy, wine, and hulē, wood; that is, wine or spirit of wood.)\n\nThey also introduced the word \"methylène\" to organic chemistry, forming it from Greek methy \"alcoholic liquid\" + hȳlē \n \"woodland, forest\", with a Greek language error: xylon \"wood as a material\" would have been more suitable. \"Methylène\" designated a \"radical\" that was about 14% hydrogen by weight and contained one carbon atom. This would be CH2, but at the time carbon was thought to have an atomic weight only six times that of hydrogen, so they gave the formula as CH. They then called wood alcohol (l'esprit de bois) \"bihydrate de méthylène\" (bihydrate because they thought the formula was C4H8O4 = (CH)4(H2O)2!). The term \"methyl\" was derived in about 1840 by back-formation from \"methylene\", and was then applied to describe \"methyl alcohol\". This was shortened to \"methanol\" in 1892 by the International Conference on Chemical Nomenclature.For a report on the International Conference on Chemical Nomenclature that was held in April 1892 in Geneva, Switzerland, see:\n*  \n*  Armstrong's report is reprinted with the resolutions in English in:   The suffix -yl used in organic chemistry to form names of carbon groups, was extracted from the word \"methyl\".\n\nIn 1923, the German chemists Alwin Mittasch and Mathias Pier, working for Badische-Anilin & Soda-Fabrik (BASF), developed a means to convert synthesis gas (a mixture of carbon monoxide, carbon dioxide, and hydrogen) into methanol. US patent 1,569,775 was applied for on 4 Sep 1924 and issued on 12 January 1926; the process used a chromium and manganese oxide catalyst with extremely vigorous conditions—pressures ranging from 50 to 220 atm, and temperatures up to 450 °C. Modern methanol production has been made more efficient through use of catalysts (commonly copper) capable of operating at lower pressures. The modern low pressure methanol (LPM) was developed by ICI in the late 1960s  with the technology now owned by Johnson Matthey, which is a leading licensor of methanol technology.\n\nMethanol is one of the most heavily traded chemical commodities in the world, with an estimated global demand of around 27 to 29 million metric tons. In recent years, production capacity has expanded considerably, with new plants coming on-stream in South America, China and the Middle East, the latter based on access to abundant supplies of methane gas. Even though nameplate production capacity (coal-based) in China has grown significantly, operating rates are estimated to be as low as 50 to 60%. No new production capacity is scheduled to come on-stream until 2015.\n\nThe main applications for methanol are the production of formaldehyde (used in construction and wooden boarding), acetic acid (basis for a.o. PET-bottles), MTBE (fuel component and replacement for the very volatile diethyl ether) and more recently for the formation of methyl esters in the production of bio-diesel. In China, demand is expected to grow exponentially, not only caused by a growing internal market of the traditional applications, but accelerated by new applications, such as direct blending (with gasoline), Methanol-To-Olefins (e.g. propylene) and DME. Methanol can also be used to produce gasoline.\n\nThe use of methanol as a motor fuel received attention during the oil crises of the 1970s due to its availability, low cost, and environmental benefits. By the mid-1990s, over 20,000 methanol \"flexible fuel vehicles\" capable of operating on methanol or gasoline were introduced in the U.S. In addition, low levels of methanol were blended in gasoline fuels sold in Europe during much of the 1980s and early-1990s. Automakers stopped building methanol FFVs by the late-1990s, switching their attention to ethanol-fueled vehicles. While the methanol FFV program was a technical success, rising methanol pricing in the mid- to late-1990s during a period of slumping gasoline pump prices diminished the interest in methanol fuels.\n\nIn 2006, astronomers using the MERLIN array of radio telescopes at Jodrell Bank Observatory discovered a large cloud of methanol in space, 288 billion miles across. In 2016, astronomers detected methyl alcohol in a planet-forming disc around the young star TW Hydrae using ALMA radio telescope.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Methanol" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19712" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Methanol, also known as methyl alcohol among others, is a chemical with the formula CH3OH (often abbreviated MeOH). Methanol acquired the name wood alcohol because it was once produced chiefly as a byproduct of the destructive distillation of wood.  Today, industrial methanol is produced in a catalytic process directly from carbon monoxide, carbon dioxide, and hydrogen.\n\nMethanol is the simplest alcohol, being only a methyl group linked to a hydroxyl group. It is a light, volatile, colorless, flammable liquid with a distinctive odor very similar to that of ethanol (drinking alcohol).\n However, unlike ethanol, methanol is highly toxic and unfit for consumption. At room temperature, it is a polar liquid. It is used as an antifreeze, solvent, fuel, and as a denaturant for ethanol. It is also used for producing biodiesel by transesterification reaction.\n\nMethanol is produced naturally in the anaerobic metabolism of many varieties of bacteria and is commonly present in small amounts in the environment. As a result, the atmosphere contains a small amount of methanol vapor. However, in only a few days, atmospheric methanol is oxidized by sunlight to produce carbon dioxide and water.\n\nMethanol is also found in abundant quantities in star-forming regions of space and is used in astronomy as a marker for such regions. It is detected through its spectral emission lines.\n\nMethanol when drunk is metabolized first to formaldehyde and then to formic acid or formate salts. These are poisonous to the central nervous system and may result in blindness, coma, and death. Because of these toxic properties, methanol is frequently used as a denaturant additive for ethanol manufactured for industrial uses. This addition of methanol exempts industrial ethanol (commonly known as \"denatured alcohol\" or \"methylated spirit\") from liquor excise taxation in the US and some other countries.\n\nOccurrence\n\nHuman metabolite\n\nMethanol is poisonous to the central nervous system and may cause blindness, coma, and death. However, in small amounts, methanol is a natural endogenous compound found in normal, healthy human individuals, concluded by one study which found a mean of 4.5 ppm in the exhaled breath of subjects. The mean endogenous methanol in humans of 0.45 g/d may be metabolized from pectin found in fruit; one kilogram of apple produces up to 1.4 g methanol.\n\nToxicity\n\nMethanol has a high toxicity in humans. As little as 10 mL of pure methanol, ingested, is metabolized into formic acid, which can cause permanent blindness by destruction of the optic nerve.  30 mL is potentially fatal, although the median lethal dose is typically 100 mL (3.4 fl oz) (i.e. 1–2 mL/kg body weight of pure methanol). The reference dose for methanol is 2 mg/kg in a day. Toxic effects begin hours after ingestion, and antidotes can often prevent permanent damage. Because of its similarities in both appearance and odor to ethanol (the alcohol in beverages), it is difficult to differentiate between the two (such is also the case with denatured alcohol, adulterated liquors or very low quality alcoholic beverages). However, there are cases of methanol resistance, such as that of Mike Malloy who was the victim of a failed murder attempt by methanol in the early 1930s.\n\nMethanol is toxic by two mechanisms. First, methanol (whether it enters the body by ingestion, inhalation, or absorption through the skin) can be fatal due to its CNS depressant properties in the same manner as ethanol poisoning. Second, in a process of toxication, it is metabolized to formic acid (which is present as the formate ion) via formaldehyde in a process initiated by the enzyme alcohol dehydrogenase in the liver. Methanol is converted to formaldehyde via alcohol dehydrogenase (ADH) and formaldehyde is converted to formic acid (formate) via aldehyde dehydrogenase (ALDH).  The conversion to formate via ALDH proceeds completely, with no detectable formaldehyde remaining. Formate is toxic because it inhibits mitochondrial cytochrome c oxidase, causing hypoxia at the cellular level, and metabolic acidosis, among a variety of other metabolic disturbances.\n\nOutbreaks of methanol poisoning have occurred due to contamination of drinking alcohol. This is more common in the developing world. In 2013 more than 1700 cases occurred in the United States. Those affected are often adult males. Outcomes may be good with early treatment. Toxicity to methanol was described as early as 1856.\n\nApplications\n\nMethanol is used primarily as a feedstock for the manufacture of chemicals, and as a fuel for specialized vehicles. As mentioned above, it is a common denaturing agent. As a common laboratory solvent, methanol is especially useful for HPLC, UV/VIS spectroscopy, and LCMS due to its low UV cutoff.\n\nChemical industry\n\nMethanol is primarily used in making other chemicals. About 40% of methanol is converted to formaldehyde, and from there into products as diverse as plastics, plywood, paints, explosives, and permanent press textiles.\n\nCondensation of methanol molecules to produce hydrocarbon chains and even aromatic systems has been demonstrated with loss of water, carbon monoxide, and/or carbon dioxide (loss of oxygen is prohibited on thermodynamic grounds).  As early as 1880, an aromatisation reaction which generated hexamethylbenzene as a minor product with a mixture of mostly aliphatic hydrocarbons directly from methanol, using zinc chloride as catalyst, had been demonstrated.  At 283 °C, the melting point of ZnCl2, the idealised reaction for the production of hexamethylbenzene has a ΔG of −261 kcal mol−1.\n\n15  →  + 3  + 15 \n\nIn the early 1970s, a process was developed by Mobil for producing gasoline fuel for vehicles. One such industrial facility was built at Motunui in New Zealand in the 1980s. In the 1990s, large amounts of methanol were used in the United States to produce the gasoline additive methyl tert-butyl ether (MTBE). While MTBE is no longer marketed in the U.S., it is still widely used in other parts of the world.  Methanol (or less commonly, ethanol) is a component in the transesterification of triglycerides for production of biodiesel.\n\nOther chemical derivatives of methanol include acetic acid and dimethyl ether (DME), the latter of which has replaced chlorofluorocarbons as an aerosol spray propellant. Dimethyl ether can also be blended with liquified petroleum gas (LPG) for home heating and cooking, and can be used as a replacement for transportation diesel fuel.\n\nOf high interest to the petrochemical marketplace, methanol is an important ingredient in new and lower-cost methods for producing propylene, which is much in demand.  Such methods include methanol-to-olefins (MTO), methanol-to-propylene (MTO/MTP), metathesis, propane dehydrogenation (PDH), high severity FCC, and olefins cracking.\n\nThe market for propynyl became tight when the ethane prices fell in the US with the exploration of shale gas reserves. The low priced ethylene produced from this raw material has given chemical producers in North America a feedstock advantage.  Such change has put naphtha-fed steam crackers at a disadvantageous position, with many of them shutting down or revamping to use ethane as feedstock.  Nevertheless, the propylene output rates from ethane-fed crackers are negligible.\n\nFuel for vehicles\n\nMethanol is occasionally used to fuel internal combustion engines. Pure methanol is required by rule to be used in Champcars, Monster Trucks, USAC sprint cars (as well as midgets, modifieds, etc.), and other dirt track series, such as World of Outlaws, and Motorcycle Speedway, mainly because, in the event of an accident, methanol does not produce an opaque cloud of smoke. Since the late 1940s, Methanol is also used as the primary fuel ingredient in the powerplants for radio control, control line, free flight airplanes, cars and trucks; such engines use a platinum filament glow plug that ignites the methanol vapor through a catalytic reaction. Drag racers, mud racers, and heavily modified tractor pullers also use methanol as the primary fuel source. Methanol is required with a supercharged engine in a Top Alcohol Dragster and, until the end of the 2006 season, all vehicles in the Indianapolis 500 had to run on methanol. As a fuel for mud racers, methanol mixed with gasoline and nitrous oxide produces more power than gasoline and nitrous oxide alone.\n\nMethanol burns in oxygen, including open air, forming carbon dioxide and water:\n\n2 CH3OH + 3 O2 → 2 CO2 + 4 H2O\n\nOne problem with high concentrations of methanol in fuel is that alcohols corrode some metals, particularly aluminium.  An acid, albeit weak, methanol attacks the oxide coating that normally protects the aluminium from corrosion:\n\n6 CH3OH + Al2O3 → 2 Al(OCH3)3 + 3 H2O\n\nThe resulting methoxide salts are soluble in methanol, resulting in a clean aluminium surface, which is readily oxidized by dissolved oxygen.  Also, the methanol can act as an oxidizer:\n\n6 CH3OH + 2 Al → 2 Al(OCH3)3 + 3 H2\n\nThis reciprocal process effectively fuels corrosion until either the metal is eaten away or the concentration of CH3OH is negligible. Methanol's corrosivity has been addressed with methanol-compatible materials and fuel additives that serve as corrosion inhibitors.\n\nOrganic methanol, produced from wood or other organic materials (bioalcohol), has been suggested as a renewable alternative to petroleum-based hydrocarbons. Low levels of methanol can be used in existing vehicles with the addition of cosolvents and corrosion inhibitors.\n\nMethanol fuel has been proposed for ground transportation. The chief advantage of a methanol economy is that it could be adapted to gasoline internal combustion engines with minimum modification to the engines and to the infrastructure that delivers and stores liquid fuel.\n\nSafety in automotive fuels\n\nPure methanol has been used in open wheel auto racing since the mid-1960s. Unlike petroleum fires, methanol fires can be extinguished with plain water. A methanol-based fire burns invisibly, unlike gasoline, which burns with a visible flame. If a fire occurs on the track, there is no flame or smoke to obstruct the view of fast approaching drivers, but this can also delay visual detection of the fire and the initiation of fire suppression. The decision to permanently switch to methanol in American IndyCar racing was a result of the devastating crash and explosion at the 1964 Indianapolis 500, which killed drivers Eddie Sachs and Dave MacDonald. In 2007 IndyCars switched from methanol to ethanol.\n\nGovernment policy\n\nThe European Fuel Quality Directive allows up to 3% methanol with an equal amount of cosolvent to be blended with gasoline sold in Europe. China uses more than one billion gallons of methanol per year as a transportation fuel in low level blends for conventional vehicles and high level blends in vehicles designed for methanol fuels.\n\nIn the US, the Open Fuel Standard Act of 2011 was introduced in the US Congress to encourage car manufacturers to build cars capable of using methanol, gasoline, or ethanol fuels. The bill is being championed by the [http://www.openfuelstandard.org/ Open Fuel Standard Coalition].\n\nProduction of synthesis gas\n\nStoichiometry for methanol production of syngas requires the ratio of H2 / CO to equal 2.  The partial oxidation process yields a ratio of 2, and the steam reforming process yields a ratio of 3.\nThe H2 / CO ratio can be lowered to some extent by the reverse water-gas shift reaction,\n\nCO2 + H2 → CO + H2O,\n\nto provide the appropriate stoichiometry for methanol synthesis.\n\nEnergy carrier\n\nMethanol is useful as an energy carrier because it is easier to store than hydrogen and burns cleaner than fossil fuels.\n\nMethanol is readily biodegradable in both aerobic (oxygen present) and anaerobic (oxygen absent) environments. Methanol will not persist in the environment. The half-life for methanol in groundwater is just one to seven days, while many common gasoline components have half-lives in the hundreds of days (such as benzene at 10–730 days). Since methanol is miscible with water and biodegradable, it is unlikely to accumulate in groundwater, surface water, air or soil.[http://www.methanol.org/Environment/Resources/Environment/MP-Methanol-Fate.aspx Evaluation of the Fate and Transport of Methanol in the Environment] , Malcolm Pirnie, Inc., January 1999.\n\nOther applications\n\nMethanol is a traditional denaturant for ethanol, the product being known as \"denatured alcohol\" or \"methylated spirit\". This was commonly used during the Prohibition to discourage consumption of bootlegged liquor, and ended up causing several deaths.\n\nMethanol is used as a solvent and as an antifreeze in pipelines and windshield washer fluid.\n\nIn some wastewater treatment plants, a small amount of methanol is added to wastewater to provide a carbon food source for the denitrifying bacteria, which convert nitrates to nitrogen gas and reduce the nitrification of sensitive aquifers.\n\nDuring World War II, methanol was used as a fuel in several German military rocket designs, under the name M-Stoff, and in a roughly 50/50 mixture with hydrazine, known as C-Stoff.\n\nMethanol was used as an automobile coolant antifreeze in the early 1900s.\n\nMethanol is used as a destaining agent in polyacrylamide gel electrophoresis.\n\nDirect-methanol fuel cells are unique in their low temperature, atmospheric pressure operation, allowing them to be miniaturized to an unprecedented degree. This, combined with the relatively easy and safe storage and handling of methanol, may open the possibility of fuel cell-powered consumer electronics, such as laptop computers and mobile phones.\n\nMethanol is also a widely used fuel in camping and boating stoves. Methanol burns well in an unpressurized burner, so alcohol stoves are often very simple, sometimes little more than a cup to hold fuel. This lack of complexity makes them a favorite of hikers who spend extended time in the wilderness.  Similarly, the alcohol can be gelled to reduce risk of leaking or spilling, as with the brand \"Sterno\".\n\nMethanol is mixed with water and injected into high performance diesel and gasoline engines for an increase of power and a decrease in intake air temperature in a process known as water methanol injection.\n\nProduction\n\nFrom synthesis gas\n\nCarbon monoxide and hydrogen react over a catalyst to produce methanol. Today, the most widely used catalyst is a mixture of copper and zinc oxides, supported on alumina, as first used by ICI in 1966. At 5–10 MPa (50–100 atm) and 250 C, the reaction is characterized by high selectivity (>99.8%):\n\nCO + 2 H2 → CH3OH\n\nThe production of synthesis gas from methane produces three moles of hydrogen for every mole of carbon monoxide, whereas the synthesis consumes only two moles of hydrogen gas per mole of carbon monoxide. One way of dealing with the excess hydrogen is to inject carbon dioxide into the methanol synthesis reactor, where it, too, reacts to form methanol according to the equation:\n\nCO2  +  3 H2   →   CH3OH  +  H2O\n\nIn terms of mechanism, the process occurs via initial conversion of CO into CO2, which is then hydrogenated:Olaf Deutschmann, Helmut Knözinger, Karl Kochloefl, Thomas Turek \"Heterogeneous Catalysis and Solid Catalysts, 3. Industrial Applications\" in Ullmann's Encyclopedia of Industrial Chemistry\" 2012, Wiley-VCH, Weinheim. \nCO2 + 3 H2 → CH3OH + H2O\nwhere the H2O byproduct is recycled via the water-gas shift reaction\nCO + H2O → CO2 + H2,\nThis gives an overall reaction, which is the same as listed above.\nCO + 2 H2 → CH3OH\n\nOther\n\nThe catalytic conversion of methane to methanol has long been sought as a route to methanol.  This route is effected by enzymes such as methane monooxygenases but commercial routes remain elusive because of the tendency for over-oxidation, i.e., methanol is more readily oxidized than methane.\n\nQuality specifications and analysis\n\nLaboratory use\n\nMethanol is available commercially in various purity grades for fine chemicals:\n* \"Synthesis\" quality (corresponding to normal commercial methanol)\n* Certified analytical quality\n* Extremely pure qualities for semiconductor manufacture\n\nCommercial methanol\n\nIn addition to laboratory grades, commercial methanol is generally classified according to ASTM purity grades A and AA. Methanol for chemical use normally corresponds to Grade AA. In addition to water, typical impurities include acetone and ethanol (which are very difficult to separate by distillation). When methanol is delivered by ships or tankers used to transport\nother substances, contamination by the previous cargo must be expected. Comparative ultraviolet spectroscopy has proved a convenient, quick test method for deciding whether a batch can be accepted and loaded. Traces of all chemicals derived from aromatic parent substances, as well as a large number of other compounds, can be detected. Further tests for establishing the quality of methanol include measurements of boiling point range, density, permanganate number, turbidity, color index, and acid number. More comprehensive tests include water determination according to the Karl Fischer method and gas chromatographic determination of byproducts. However, the latter is relatively expensive and time-consuming because several injections using different columns and detectors must be made due to the variety of byproducts present.\nHistory\n\nIn their embalming process, the ancient Egyptians used a mixture of substances, including methanol, which they obtained from the pyrolysis of wood. Pure methanol, however, was first isolated in 1661 by Robert Boyle, when he produced it via the distillation of buxus (boxwood).Boyle discusses the distillation of liquids from the wood of the box shrub in:  Robert Boyle, The Sceptical Chymist (London, England:  J. Cadwell, 1661), [https://archive.org/stream/scepticalchymis00BoylA#page/192/mode/2up/ pp. 192–195]. It later became known as \"pyroxylic spirit\". In 1834, the French chemists Jean-Baptiste Dumas and Eugene Peligot determined its elemental composition.A report on methanol to the French Academy of Sciences by J. Dumas and E. Péligot began during the Academy's meeting of October 27, 1834 and finished during the meeting of November 3, 1834.  See:  Procès-verbaux des séances de l'Académie, 10 :  600–601.  Available on:  [http://gallica.bnf.fr/ark:/12148/bpt6k33037/f606.image Gallica].  The complete report appears in:  J. Dumas and E. Péligot (1835) [ \"Mémoire sur l'espirit de bois et sur les divers composés ethérés qui en proviennent\"] (Memoir on spirit of wood and on the various ethereal compounds that derive therefrom), Annales de chimie et de physique, 58 : 5–74; from [ page 9]:  Nous donnerons le nom de méthylène (1) à un radical …  (1) Μεθυ, vin, et υλη, bois; c'est-à-dire vin ou liqueur spiritueuse du bois. (We will give the name methylene (1) to a radical …  (1) methy, wine, and hulē, wood; that is, wine or spirit of wood.)\n\nThey also introduced the word \"methylène\" to organic chemistry, forming it from Greek methy \"alcoholic liquid\" + hȳlē \n \"woodland, forest\", with a Greek language error: xylon \"wood as a material\" would have been more suitable. \"Methylène\" designated a \"radical\" that was about 14% hydrogen by weight and contained one carbon atom. This would be CH2, but at the time carbon was thought to have an atomic weight only six times that of hydrogen, so they gave the formula as CH. They then called wood alcohol (l'esprit de bois) \"bihydrate de méthylène\" (bihydrate because they thought the formula was C4H8O4 = (CH)4(H2O)2!). The term \"methyl\" was derived in about 1840 by back-formation from \"methylene\", and was then applied to describe \"methyl alcohol\". This was shortened to \"methanol\" in 1892 by the International Conference on Chemical Nomenclature.For a report on the International Conference on Chemical Nomenclature that was held in April 1892 in Geneva, Switzerland, see:\n*  \n*  Armstrong's report is reprinted with the resolutions in English in:   The suffix -yl used in organic chemistry to form names of carbon groups, was extracted from the word \"methyl\".\n\nIn 1923, the German chemists Alwin Mittasch and Mathias Pier, working for Badische-Anilin & Soda-Fabrik (BASF), developed a means to convert synthesis gas (a mixture of carbon monoxide, carbon dioxide, and hydrogen) into methanol. US patent 1,569,775 was applied for on 4 Sep 1924 and issued on 12 January 1926; the process used a chromium and manganese oxide catalyst with extremely vigorous conditions—pressures ranging from 50 to 220 atm, and temperatures up to 450 °C. Modern methanol production has been made more efficient through use of catalysts (commonly copper) capable of operating at lower pressures. The modern low pressure methanol (LPM) was developed by ICI in the late 1960s  with the technology now owned by Johnson Matthey, which is a leading licensor of methanol technology.\n\nMethanol is one of the most heavily traded chemical commodities in the world, with an estimated global demand of around 27 to 29 million metric tons. In recent years, production capacity has expanded considerably, with new plants coming on-stream in South America, China and the Middle East, the latter based on access to abundant supplies of methane gas. Even though nameplate production capacity (coal-based) in China has grown significantly, operating rates are estimated to be as low as 50 to 60%. No new production capacity is scheduled to come on-stream until 2015.\n\nThe main applications for methanol are the production of formaldehyde (used in construction and wooden boarding), acetic acid (basis for a.o. PET-bottles), MTBE (fuel component and replacement for the very volatile diethyl ether) and more recently for the formation of methyl esters in the production of bio-diesel. In China, demand is expected to grow exponentially, not only caused by a growing internal market of the traditional applications, but accelerated by new applications, such as direct blending (with gasoline), Methanol-To-Olefins (e.g. propylene) and DME. Methanol can also be used to produce gasoline.\n\nThe use of methanol as a motor fuel received attention during the oil crises of the 1970s due to its availability, low cost, and environmental benefits. By the mid-1990s, over 20,000 methanol \"flexible fuel vehicles\" capable of operating on methanol or gasoline were introduced in the U.S. In addition, low levels of methanol were blended in gasoline fuels sold in Europe during much of the 1980s and early-1990s. Automakers stopped building methanol FFVs by the late-1990s, switching their attention to ethanol-fueled vehicles. While the methanol FFV program was a technical success, rising methanol pricing in the mid- to late-1990s during a period of slumping gasoline pump prices diminished the interest in methanol fuels.\n\nIn 2006, astronomers using the MERLIN array of radio telescopes at Jodrell Bank Observatory discovered a large cloud of methanol in space, 288 billion miles across. In 2016, astronomers detected methyl alcohol in a planet-forming disc around the young star TW Hydrae using ALMA radio telescope. Methanol. http://en.wikipedia.org/?curid=19712."
  }
}
