{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12099",
  "eid" : "000bf4c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778509324,
  "textBody" : "Gdańsk (,; German: ',) is a Polish city on the Baltic coast. It is the capital of the Pomeranian Voivodeship, Poland's principal seaport and the centre of the country's fourth-largest metropolitan area.\n\nThe city lies on the southern edge of Gdańsk Bay (of the Baltic Sea), in a conurbation with the city of Gdynia, spa town of Sopot, and suburban communities, which together form a metropolitan area called the Tricity (Trójmiasto), with a population approaching 1.4 million. Gdańsk itself has a population of 460,427 (December 2012), making it the largest city in the Pomerania region of Northern Poland.\n\nGdańsk is the capital of Gdańsk Pomerania and the largest city of Kashubia. With its origins as a Polish stronghold erected in the 980s by Mieszko I of Poland, the city's history is complex, with periods of Polish rule, periods of Prussian or German rule, and periods of autonomy or self-rule as a \"free city\". In the early-modern age Gdańsk was a royal city of Poland. It was considered the wealthiest and the largest city of Poland, prior to the 18th century rapid growth of Warsaw. Between the world wars, the Free City of Danzig was in a customs union with Poland and was located between German East Prussia and the so-called Polish Corridor.\n\nGdańsk lies at the mouth of the Motława River, connected to the Leniwka, a branch in the delta of the nearby Vistula River, which drains 60 percent of Poland and connects Gdańsk with the Polish capital, Warsaw. Together with the nearby port of Gdynia, Gdańsk is also an important industrial center. In the late Middle Ages it was an important seaport and shipbuilding town, and in the 14th and 15th centuries a member of the Hanseatic League.\n\nIn the interwar period, owing to its multi ethnic make-up and history, Danzig lay in a disputed region between Poland and the Weimar Republic, and later Nazi Germany. The city's ambiguous political status was exploited, furthering tension between the two countries, which would ultimately culminate in the Invasion of Poland and the first clash of the Second World War just outside the city limits. In the 1980s it would become the birthplace of the Solidarity movement, which played a major role in bringing an end to Communist rule in Poland and helped precipitate the collapse of the Eastern Bloc, the fall of the Berlin Wall and the dissolution of the Soviet Union.\n\nGdańsk is home to the University of Gdańsk, Gdańsk University of Technology, the National Museum, the Gdańsk Shakespeare Theatre, the Museum of the Second World War, Polish Baltic Philharmonic and the European Solidarity Centre. The city also hosts St. Dominic's Fair, which dates back to 1260, and is regarded as one of the biggest trade and cultural events in Europe.\n\nNames\n\nThe city's name is thought to originate from the Gdania River,[http://google.com/search?qcache:CricehQx6TwJ:www.directferries.co.uk/gdansk_guide.htm+Gdania+river&hl\nen&ctclnk&cd\n3&glca From the history of Gdańsk city name, as explained at Gdańsk Guide] the original name of the Motława branch on which the city is situated. The name of a settlement was recorded after St. Adalbert's death in AD 997 as urbs Gyddanyzc and later was written as Kdanzk in 1148, Gdanzc in 1188, Danceke in 1228, Gdansk in 1236,Also in 1454, 1468, 1484, and 1590 Danzc in 1263, Danczk in 1311,Also in 1399, 1410, and 1414–1438 Danczik in 1399,Also in 1410, 1414 Danczig  in 1414, Gdąnsk in 1656. In Polish the modern name of the city is pronounced. In English (where the diacritic over the \"n\" is frequently omitted) the usual pronunciation is or. The German name, \"Danzig\", is pronounced as.\n\nThe city's Latin name may be given as either Gedania, Gedanum or Dantiscum; the variety of Latin names reflects the mixed influence of the city's Polish, German and Kashubian heritage. Other former spellings of the name include Dantzig, Dantsic and Dantzic.\n\nCeremonial names\n\nOn special occasions the city is also referred to as \"The Royal Polish City of Gdańsk\" (Polish Królewskie Polskie Miasto Gdańsk, Latin Regia Civitas Polonica Gedanensis, Kashubian Królewsczi Polsczi Gard Gduńsk).Gdańsk, in: Kazimierz Rymut, Nazwy Miast Polski, Ossolineum, Wrocław 1987Hubert Gurnowicz, Gdańsk, in: Nazwy miast Pomorza Gdańskiego, Ossolineum, Wrocław 1978Baedeker's Northern Germany, Karl Baedeker Publishing, Leipzig 1904 In the Kashubian language the city is called Gduńsk. Kashubians also use the name \"Our Capital City Gduńsk\" (Nasz Stoleczny Gard Gduńsk) or \"The Kashubian Capital City Gduńsk\" (Stoleczny Kaszëbsczi Gard Gduńsk).\n\nHistory\n\nEarly Poland\n\nThe first written record thought to refer to Gdańsk is the vita of Saint Adalbert. Written in 999, it describes how in 997 Saint Adalbert of Prague baptised the inhabitants of urbs Gyddannyzc, \"which separated the great realm of the duke [i.e. Boleslaw the Brave of Poland] from the sea.\"Loew, Peter Oliver: Danzig. Biographie einer Stadt, Munich 2011, p. 24. No further written sources exist for the 10th and 11th centuries. Based on the date in Adalbert's vita, the city celebrated its millennial anniversary in 1997.Wazny, Tomasz; Paner, Henryk; Golebiewski, Andrzej; Koscinski, Bogdan: Early medieval Gdansk/Danzig revisited (EuroDendro 2004), Rendsburg 2004, [http://www.bfafh.de/eurodendro2004/abstracts_inet.pdf pdf-abstract] .\n\nArchaeological evidence for the origins of the town was retrieved mostly after World War II had laid 90 percent of the city center in ruins, enabling excavations.Loew (2011), p. 24; Wazny et al. (2004), [http://www.bfafh.de/eurodendro2004/abstracts_inet.pdf abstract] . The oldest seventeen settlement levels were dated to between 980 and 1308. It is generally thought that Mieszko I of Poland erected a stronghold on the site in the 980s, thereby connecting the Polish state ruled by the Piast dynasty with the trade routes of the Baltic Sea. Traces of buildings and housing from 10th century have been found in archaeological excavations of the city.\n\nPomeranian Poland\n\nThe site was ruled on behalf of Poland by the Samborides' duchy and consisted of a settlement at the modern Long Market, craftsmen settlements along the Old Ditch, German merchant settlements around the St Nicolas church and the old Piast stronghold. In 1186, a Cistercian monastery was set up in nearby Oliwa, which is now within the city limits. In 1215, the ducal stronghold became the centre of a Pomerelian splinter duchy. At that time the area of the later city comprised different villages. At least since 1224/25 a German market settlement with merchants from Lübeck existed in the area of today's Long Market.name\"harlander\"> In 1224/25, merchants from Lübeck were invited as \"hospites\" (immigrants with specific privileges) but were soon forced to leave by Swantopolk II of the Samborides in 1238 during a war between Swantopolk and the Teutonic Knights, during which Lübeck supported the latter. Migration of merchants to the town resumed in 1257. Significant German influence did not appear until the 14th century, after the takeover of the city by the Teutonic Knights.\nAt latest in 1263 Pomerelian duke, Swantopolk II. granted city rights under Lübeck law to the emerging market settlement. It was an autonomy charter similar to that of Lübeck, which was also the primary origin of many settlers. In a document of 1271 the Pomerelian duke Mestwin II. addressed the inhabitants of the city as \"„burgensibus Theuthonicis fidelibus\", loyal German citizens, and mentions them separately from the Prussians and Pomeranians, who lived outside the city in an older settlement, the later known Old Town.name=\"lingenberg\">‘The Slippery Memory of Men’: The Place of Pomerania in the Medieval Kingdom of Poland\nby Paul Milliman page 73, 2013\n\nIn 1300, the town had an estimated population of 2,000. While overall the town was not a very important trade centre at that time, it had some relevance in the trade with Eastern Europe. Low on funds, the Samborides lent the settlement to Brandenburg, although they planned to take the city back and give it to Poland. Poland threatened to intervene, and Brandenburg left the town. Subsequently, the city was taken by Danish princes in 1301. The Teutonic Knights were hired by the Polish nobles to clear out the Danes.\n\nTeutonic Knights\n\nIn 1308, the town was taken by Brandenburg and the Teutonic Knights restored order. Subsequently, the Knights took over control of the town. Primary sources record a massacre carried out by the Teutonic Knights on the local population, of 10,000 people, but the exact number killed is subject of dispute in modern scholarship.Hartmut Boockmann, Ostpreussen und Westpreussen, Siedler, 2002, p.158,  Some authors accept the number given in the original sources,James Minahan, One Europe, Many Nations: A Historical Dictionary of European National Groups, Greenwood Publishing Group, 2000, , [https://books.google.com/books?id\nNwvoM-ZFoAgC&pgPA376&dq\n1308+Gdansk+massacre&as_brr3&ei\ncilQSPHSMom2iwGE8JU0&sigOR_a7-g10jIZsYOJGkmBe5ZwfSY p.376 Google Books] while others consider 10,000 to have been a medieval exaggeration, although scholarly consensus is that a massacre of some magnitude did take place. The events were used by the Polish crown to condemn the Teutonic Knights in a subsequent papal lawsuit.Thomas Urban: \"[http://www.thomas-urban.pl/gdansk.php Rezydencja książąt Pomorskich]\".  \n\nThe knights colonised the area, replacing local Kashubians and Poles with German settlers. In 1308, they founded Osiek Hakelwerk near the town, initially as a Slavic fishing settlement. In 1340, the Teutonic Knights built a large fortress, which became the seat of the knights' Komtur. In 1346 they changed the Town Law of the city, which then consisted only of the Rechtstadt, to Kulm law. In 1358, Danzig joined the Hanseatic League, and became an active member in 1361. It maintained relations with the trade centers Bruges, Novgorod, Lisboa and Sevilla. Around 1377, the Old Town was equipped with city rights as well. In 1380, the New Town was founded as the third, independent settlement.\n\nAfter a series of Polish-Teutonic Wars, in the Treaty of Kalisz (1343) the Order had to acknowledge that it would hold Pomerelia as an alm from the Polish Crown. Although it left the legal basis of the Order's possession of the province in some doubt, the city thrived as a result of increased exports of grain (especially wheat), timber, potash, tar, and other goods of forestry from Prussia and Poland via the Vistula River trading routes, although after its capture, the Teutonic Knights tried to actively reduce the economic significance of the town. While under the control of the Teutonic Order German migration increased. The Order's religious networks helped to develop Danzig's literary culture. A new war broke out in 1409, ending with the Battle of Grunwald (1410), and the city came under the control of the Kingdom of Poland. A year later, with the First Peace of Thorn, it returned to the Teutonic Order.\n\nKingdom of Poland\n\nIn 1440, the city participated in the foundation of the Prussian Confederation which was an organisation opposed to the rule of the Teutonic Knights. This led to the Thirteen Years' War of independence from the Teutonic Monastic State of Prussia (1454–1466). On May 25, 1457, the city gained its rights and independence as an autonomous city.[http://www.geocities.com/CapitolHill/Rotunda/2209/Gdańsk.html Danzig – Gdańsk until 1920] \n\nOn 15 May 1457, Casimir IV of Poland granted the town the Great Privilege, after he had been invited by the town's council and had already stayed in town for five weeks. With the Great Privilege, the town was granted füll autonomy and protection by the King of Poland.: \"Geben wir und verlehen unnsir Stadt Danczk das sie zcu ewigen geczeiten nymands for eynem herrn halden noc gehorsam zcu weszen seyn sullen in weltlichen sachen.\" It clearly states that Danzig is free and no citizen is subject to any king. The privilege removed tariffs and taxes on trade within Poland, Lithuania and Ruthenia (present day Belarus and Ukraine) and conferred on the town independent jurisdiction, legislation and administration of her territory, as well as the right to mint its own coin. Furthermore, the privilege united Old Town, Osiek and Main Town, and legalised the demolition of New Town, which had sided with the Teutonic Knights. By 1457, New Town was demolished completely, no buildings remained.\n\nGaining free and privileged access to Polish markets, the seaport prospered while simultaneously trading with the other Hanseatic cities. After the Second Peace of Thorn (1466) with the Teutonic Monastic State of Prussia the warfare between the latter and the Polish crown ended permanently. After the Union of Lublin between Poland and Lithuania in 1569 the city continued to enjoy a large degree of internal autonomy (cf. Danzig Law). Being the largest and one of the most influential cities of Poland, it enjoyed voting rights during the royal election period in Poland.\n\nIn 1569 a Mennonite Church was founded here.\n\nIn the 1575 election of a king to the Polish throne, Danzig supported Maximilian II against Stephen Báthory. It was the latter who eventually became monarch but the city, encouraged by the secret support of Denmark and Emperor Maximilian, shut its gates against Stephen. After the Siege of Danzig (1577), lasting six months, the city's army of 5,000 mercenaries was utterly defeated in a field battle on 16 December 1577. However, since Stephen's armies were unable to take the city by force, a compromise was reached: Stephen Báthory confirmed the city's special status and her Danzig Law privileges granted by earlier Polish kings. The city recognised him as ruler of Poland and paid the enormous sum of 200,000 guldens in gold as payoff (\"apology\").\n\nAround 1640, Johannes Hevelius established his astronomical observatory in the Old Town. Polish King John III Sobieski regularly visited Hevelius numerous times.\n\nBeside the large numbers of German-speakers, whose elites sometimes distinguished their German dialect as Pomerelian,Bömelburg, Hans-Jürgen, Zwischen polnischer Ständegesellschaft und preußischem Obrigkeitsstaat: vom Königlichen Preußen zu Westpreußen (1756–1806), München: Oldenbourg, 1995, (Schriften des Bundesinstituts für Ostdeutsche Kultur und Geschichte (Oldenburg); 5), zugl.: Mainz, Johannes Gutenberg-Univ., Diss., 1993, 549 pp. the city was home to a large number of Polish-speaking Poles, Jewish Poles, Latvian speaking Kursenieki, Flemings and Dutch. In addition, a number of Scots took refuge or migrated to and received citizenship in the city. During the Protestant Reformation, most German-speaking inhabitants adopted Lutheranism. Due to the special status of the city and significance within the Polish–Lithuanian Commonwealth, the city inhabitants largely became bi-cultural sharing both Polish and German culture and were strongly attached to the traditions of the Polish–Lithuanian Commonwealth.Historia Polski 1795–1815 Andrzej Chwalba Kraków 2000, page 441\n\nThe city suffered a last great plague and a slow economic decline due to the wars of the 18th century. As a stronghold of Stanisław Leszczyński's supporters during the War of the Polish Succession, it was taken by the Russians after the Siege of Danzig in 1734.\n\nThe Danzig Research Society founded in 1743 was one of the first of its kind.\n\nPrussia and Germany\n\nDanzig was annexed by the Kingdom of Prussia in 1793, in the Second Partition of Poland. An attempt of student uprising against Prussia led by Gottfried Benjamin Bartholdi was crushed quickly by the authorities in 1797.Dzieje Gdańska Edmund Cieślak, Czesław Biernat Wydawn. Morskie, 1969 page 370Dzieje Polski w datach Jerzy Borowiec, Halina Niemiec page 161Polska, losy państwa i narodu Henryk Samsonowicz 1992 Iskry page 282 During the era of Napoleon the city became a free city in the period extending from 1807 to 1814.\n\nIn 1815, after France's defeat in the Napoleonic Wars, it again became part of Prussia and became the capital of Regierungsbezirk Danzig within the province of West Prussia. The city's longest serving president was Robert von Blumenthal, who held office from 1841, through the revolutions of 1848, until 1863. With the unification of Germany under Prussian hegemony, the city became part of Imperial Germany (the German Empire) in 1871, and remained so until 1919, after Germany's defeat in World War I.\n\nInter-war years and World War II\n\nWhen Poland regained its independence after World War I with access to the sea as promised by the Allies on the basis of Woodrow Wilson's \"Fourteen Points\" (point 13 called for \"an independent Polish state\", \"which should be assured a free and secure access to the sea\"), the Poles hoped the city's harbour would also become part of Poland. However, since Germans formed a majority in the city, with Poles being a minority,In the 1923 census 7,896 people out of 335,921 gave Polish, Kashubian or Masurian as their native language. . Polish estimates of the Polish minority during the interwar era, however, range from 37,000 to 100,000 (9%–34%). Studia historica Slavo-Germanica, Tomy 18–20page 220 Uniwersytet Adama Mickiewicza w Poznaniu. Instytut Historii Wydawnictwo Naukowe imienia. Adama Mickiewicza, 1994. the city was not placed under Polish sovereignty. Instead, in accordance with the terms of the Versailles Treaty, it became the Free City of Danzig (German: Freie Stadt Danzig), an independent quasi-state under the auspices of the League of Nations with its external affairs largely under Polish control. Poland's rights also included free use of the harbour, a Polish post office, a Polish garrison in Westerplatte district, and customs union with Poland. This led to a considerable tension between the city and the Republic of Poland. The Free City had its own constitution, national anthem, parliament (Volkstag), and government (Senat). It issued its own stamps as well as its currency, the Danzig gulden.\n\nIn the early 1930s the local Nazi Party capitalised on pro-German sentiments and in 1933 garnered 50% of vote in the parliament. Thereafter, the Nazis under Gauleiter Albert Forster achieved dominance in the city government, which was still nominally overseen by the League of Nations' High Commissioner. The German government officially demanded the return of Danzig to Germany along with an extraterritorial (meaning under German jurisdiction) highway through the area of the Polish Corridor for land-based access from the rest of Germany. Hitler used the issue of the status of the city as a pretext for attacking Poland and on May 1939, during a high level meeting of German military officials explained to them: \"It is not Danzig that is at stake. For us it is a matter of expanding our Lebensraum in the east\", adding that there will be no repeat of the Czech situation, and Germany will attack Poland at first opportunity, after isolating the country from its Western Allies.The history of the German resistance, 1933–1945 Peter Hoffmann page 37 McGill-Queen's University Press 1996Hitler Joachim C. Fest page 586 Houghton Mifflin Harcourt, 2002Blitzkrieg w Polsce wrzesien 1939 Richard Hargreaves page 84 Bellona, 2009A military history of Germany, from the eighteenth century to the present dayMartin Kitchen page 305 Weidenfeld and Nicolson, 1975International history of the twentieth century and beyond Antony Best page 181 Routledge; 2 edition (July 30, 2008) As Nazi demands increased, German-Polish relations rapidly deteriorated. Germany invaded Poland on September 1 after having signed a non-aggression pact with the Soviet Union in late August.\n\nThe German attack began in Danzig, with a bombardment of Polish positions at Westerplatte by the German battleship , and the landing of German infantry on the peninsula. Outnumbered Polish defenders at Westerplatte resisted for seven days before running out of ammunition. Meanwhile, after a fierce day-long fight (1 September 1939), defenders of the Polish Post office were tried and executed then buried on the spot in the Danzig quarter of Zaspa in October 1939. In 1998 a German court overturned their conviction and sentence.\n\nThe city was officially annexed by Nazi Germany and incorporated into the Reichsgau Danzig-West Prussia. About 50 percent of members of the Jewish Community of Danzig had left the city within a year after a Pogrom in October 1937, after the Kristallnacht riots in November 1938 the community decided to organize its emigration and in March 1939 a first transport to Palestine started. By September 1939 barely 1,700 mostly elderly Jews remained. In early 1941, just 600 Jews were still living in Danzig, most of whom were later murdered in the Holocaust.\nOut of the 2,938 Jewish community in the city 1,227 were able to escape from the Nazis before the outbreak of war.Żydzi na terenie Wolnego Miasta Gdańska w latach 1920–1945:działalność kulturalna, polityczna i socjalnaGrzegorz Berendt Gdańskie Tow. Nauk., Wydz. I Nauk Społecznych i Humanistycznych, 1997 page 245 Nazi secret police had been observing Polish minority communities in the city since 1936, compiling information, which in 1939 served to prepare lists of Poles to be captured in Operation Tannenberg. On the first day of the war, approximately 1,500 ethnic Poles were arrested, some because of their participation in social and economic life, others because they were activists and members of various Polish organisations. On 2 September 1939, 150 of them were deported to the Sicherheitsdienst camp Stutthof some 30 mi from Danzig, and murdered.[http://www.kki.net.pl/~museum/museums.htm Museums Stutthof in Sztutowo]. Retrieved January 31, 2007.  Many Poles living in Danzig were deported to Stutthof or executed in the Piaśnica forest.\n\nIn 1941, Hitler ordered the invasion of the Soviet Union, eventually causing the fortunes of war to turn against Germany. As the Soviet Army advanced in 1944, German populations in Central and Eastern Europe took flight, resulting in the beginning of a great population shift. After the final Soviet offensives began in January 1945, hundreds of thousands of German refugees converged on Danzig, many of whom had fled on foot from East Prussia, some tried to escape through the city's port in a large-scale evacuation involving hundreds of German cargo and passenger ships. Some of the ships were sunk by the Soviets, including the  after an evacuation was attempted at neighbouring Gdynia. In the process, tens of thousands of refugees were killed.\n\nThe city also endured heavy Allied and Soviet air raids. Those who survived and could not escape had to face the Soviet Army, which captured the heavily damaged city on 30 March 1945, followed by large-scale rape[http://www.dailymail.co.uk/news/article-2458778/Komm-Frau-Gdansk-tears-statue-marking-rape-millions-German-women-Russian-soldiers.html Brady, Tara. 2013. Polish town tears down statue marking the rape of millions of German women by Russian soldiers. Mail Online (October 14).] and looting.Biskupski, Mieczysław B. The History of Poland. Westport, CT: Greenwood Press, p. 97.Tighe, Carl. Gdańsk: National Identity in the Polish-German Borderlands. London: Palgrave Macmillan, p. 199. In line with the decisions made by the Allies at the Yalta and Potsdam conferences, the city was annexed by Poland. The remaining German residents of the city who had survived the war fled or were forcibly expelled to postwar Germany, and the city was repopulated by ethnic Poles; up to 18 percent (1948) of them had been deported by the Soviets in two major waves from Polish areas annexed by the Soviet Union, i.e. from the eastern portion of pre-war Poland.\n\nContemporary times\n\nParts of the historic old city of Gdańsk, which had suffered large-scale destruction during the war, were rebuilt during the 1950s and 1960s. The reconstruction was not tied to the city's pre-war appearance, but instead was politically motivated as a means of culturally cleansing and destroying all traces of German influence from the city. Any traces of German tradition were ignored, suppressed, or regarded as \"Prussian barbarism\" only worthy of demolition, while Flemish/Dutch, Italian and French influences were used to replace the historically accurate Germanic architecture which the city was built upon since the 14th century.\n\nBoosted by heavy investment in the development of its port and three major shipyards for Soviet ambitions in the Baltic region, Gdańsk became the major shipping and industrial center of the Communist People's Republic of Poland.\n\nIn December 1970, Gdańsk was the scene of anti-regime demonstrations, which led to the downfall of Poland's communist leader Władysław Gomułka. During the demonstrations in Gdańsk and Gdynia, military as well as the police opened fire on the demonstrators causing several dozen deaths. Ten years later, in August, 1980, Gdańsk Shipyard was the birthplace of the Solidarity trade union movement, whose opposition to the Communist regime led to the end of Communist Party rule in 1989, and sparked a series of protests that successfully overturned the Communist regimes of the former Soviet bloc. Solidarity's leader, Lech Wałęsa, became President of Poland in 1990. In 2014 the European Solidarity Centre, a museum and library devoted to the history of the movement, opened in Gdańsk.\n\nGdańsk native Donald Tusk became Prime Minister of Poland in 2007, and President of the European Council in 2014. Today Gdańsk is a major shipping port and tourist destination.\n\nClimate\n\nGdańsk has a climate with both oceanic and continental influences. According to some categorizations, it has an oceanic climate (Cfb)[http://www.weatherbase.com/weather/weather-summary.php3?s5121&cityname\nGdansk%2C+Pomeranian+Voivodeship%2C+Poland&units= Weatherbase.com - Gdansk] Retrieved 14.02.2018, while others classify it as belonging to the continental climate zone (Dfb)[https://www.britannica.com/media/full/276210/206711 Britannica - Köppen climate classification] Retrieved 14.02.2018. It actually depends on whether the mean reference temperature for the coldest winter month is set at -3 °C (26.6 °F) or 0 °C (32 °F). Gdańsk's dry winters and the precipitation maximum in summer are indicators of continentality. However seasonal extremes are less pronounced than those in inland Poland.\n\nThe city has moderately cold and cloudy winters with temperature means in January and February staying below 0°C, and mild summers with frequent showers and thunderstorms. Average temperatures range from  and average rainfall varies from 17.9 mm/month to 66.7 mm/month with a rather low annual total of 507.3 mm. In general it is damp, variable and mild. The seasons are clearly differentiated. Spring starts in March and is initially cold and windy, later becoming pleasantly warm and often very sunny. Summer, which begins in June, is predominantly warm but hot at times (with temperature reaching as high as 30-35C at least\nonce per year) with plenty of sunshine interspersed with heavy rain. The average annual hours of sunshine for Gdańsk are 1700. July and August are the hottest months. Autumn comes in September and is at first warm and usually sunny, turning cold, damp and foggy in November. Winter lasts from December to March and includes periods of snow. January and February are the coldest months with the temperature sometimes dropping as low as .\n\nEconomy\n\nThe industrial sections of the city are dominated by shipbuilding, petrochemical & chemical industries, and food processing. The share of high-tech sectors such as electronics, telecommunications, IT engineering, cosmetics and pharmaceuticals is on the rise. Amber processing is also an important part of the local economy, as the majority of the world's amber deposits lie along the Baltic coast. The Pomeranian Voivodeship, including Gdańsk, is also a major tourist destination in the summer, as millions of Poles and other European tourists flock to the beaches of the Baltic coastline.\nMajor companies in Gdańsk:\n\n* Acxiom – IT\n* Arla Foods – food processing\n* Bayer Shared Service Centre – finance & accounting\n* Cognor – steel, engineering, capital goods\n* Coleman Research – knowledge broker\n* Crist – shipbuilding\n* Delphi – automotive parts\n* Dr. Oetker – food processing\n* Grupa Lotos – energy, petrol refinery\n* Energa Trading – electrical and heat energy\n* Bank BPH – finance\n* Gdańska Stocznia Remontowa – shipbuilding\n* Elektrociepłownie Wybrzeże – energy\n* LPP – retail\n* Polnord Energobudowa – construction company\n* Petrobaltic – energy, oil drilling\n* Intel – IT\n* IBM – IT\n* IVONA – IT\n* FINEOS – IT [https://archive.is/20130124034524/http://www.fineos.com/about/locations/ FINEOS Locations]\n* Wirtualna Polska – internet service\n* Kainos – IT\n* Lufthansa Systems – IT\n* Jeppesen – IT\n* Compuware – IT\n* Thomson Reuters – media\n* ThyssenKrupp – steel, engineering, capital goods\n* Maersk Line – services & pick-up\n* Transcom WorldWide – business processing outsourcing\n* Jysk – retail\n* Meritum Bank – finance\n* Glencore – raw materials\n* Orlen Morena – energy\n* Fosfory Ciech – chemical company\n* Hydrobudowa – construction company\n* Llentabhallen – steel constructions\n* Ziaja – cosmetics and beauty company\n* Stabilator – construction company\n* Skanska – construction company\n* Flügger – paints manufacturing\n* HD heavy duty – retail\n* Dresser Wayne – retail fueling systems\n* First Data – finance\n* Masterlease – finance\n* Transcom WorldWide – business processing outsourcing\n* Weyerhaeuser Cellulose Fibres – cellulose fibre manufacturing\n* Gdańsk Shipyard – shipbuilding\n* Remontowa Shipbuilding – shipbuilding\n* OIE Support – education services (part of Laureate International Universities)\n* PricewaterhouseCoopers LLP – professional services\n* Kemira – chemical industry group\n* BreakThru Films – animated film studio\n* Schibsted – IT\n* Regus – business support services\n* Mango Media – home shopping channel\n* MOL Europe – shipping\n* VB Leasing – finance\n* Metsä Group – forest industry\n* Competence Call Centre – call centre\n* EPAM Systems – IT\n* Esotiq&Henderson – retail\n* Bayer – chemical and pharmaceutical company\n* Playsoft – IT\n* Staples Advantage – office products\n* Deloitte – professional services\n* KPMG – professional services\n* Comarch – IT\n* ESO Audit – professional services\n* TF Bank – finance\n\nMain sights \n\nArchitecture\n\nThe city has some buildings surviving from the time of the Hanseatic League. Most tourist attractions are located along or near Ulica Długa (Long Street) and Długi Targ (Long Market), a pedestrian thoroughfare surrounded by buildings reconstructed in historical (primarily during the 17th century) style and flanked at both ends by elaborate city gates. This part of the city is sometimes referred to as the Royal Route, since it was once the former path of processions for visiting Kings of Poland.\n\nWalking from end to end, sites encountered on or near the Royal Route include:\n* Highland Gate (Brama Wyżynna)\n* Torture House (Katownia)\n* Prison Tower (Wieża więzienna)\n* Mansion of the Society of Saint George (Dwór Bractwa św. Jerzego)\n* Golden Gate (Złota Brama)\n* Long Street (Ulica Długa)\n** Uphagen's House (Dom Uphagena)\n** Lion's Castle (Lwi Zamek)\n** Main Town Hall (Ratusz Głównego Miasta)\n* Long Market (Długi Targ)\n** Artus' Court (Dwór Artusa)\n** Neptune's Fountain (Fontanna Neptuna)\n** Golden House (Złota Kamienica)\n* Green Gate (Zielona Brama)\n\nGdańsk has a number of historical churches:\n* St. Bridget\n* St. Catherine\n* St. John\n* St. Mary (Bazylika Mariacka), a municipal church built during the 15th century, is the largest brick church in the world.\n* St. Nicholas\n* St. James\n* St. Joseph\n* St. Peter and Paul\n* St. Barbara\n* Corpus Christi\n\nThe city's 17th-century fortifications represent one of Poland's official national Historic Monuments (Pomnik historii), as designated September 16, 1994 and tracked by the National Heritage Board of Poland.\n\nOther main sights in the historical city centre include:\n* Royal Chapel of the Polish King John III Sobieski\n* Żuraw – medieval port crane\n* Gradowa Hill\n* Granaries on the Ołowianka and Granary Islands\n* Great Armoury\n* John III Sobieski Monument\n* Old Town Hall\n* Jan Heweliusz Monument\n* Great Mill\n* Small Mill\n* House of Research Society\n* Polish Post Office, site of the 1939 battle\n* brick gothic town gates, i.e. Mariacka Gate, Straganiarska Gate, Cow Gate\n\nMain sights outside the historical city centre include:\n* Abbot's Palace in the Oliwa Park\n* Lighthouse in Nowy Port\n* Oliwa Cathedral\n* Pachołek Hill – an observation point in Oliwa\n* Pier in Brzeźno\n* Westerplatte\n* Wisłoujście Fortress\n* Zoo in Oliwa\n\nMuseums\n\n*National Museum (Muzeum Narodowe)\n**Department of Ancient Art - contains a number of important artworks, including Hans Memling's Last Judgement\n**Green Gate\n**Department of Modern Art - in the Abbot's Palace in Oliwa\n**Ethnography Department - in the Abbot's Granary in Oliwa\n**Gdańsk Photography Gallery\n*Historical Museum (Muzeum Historyczne Miasta Gdańska):\n**Main Town Hall\n**Artus' Court\n**Uphagen's House\n**Amber Museum (Muzeum Bursztynu)\n**Museum of the Polish Post (Muzeum Poczty Polskiej)\n**Wartownia nr 1 na Westerplatte\n**Museum of Tower Clocks (Muzeum Zegarów Wieżowych)\n**Wisłoujście Fortress\n*National Maritime Museum, Gdańsk (Narodowe Muzeum Morskie):\n**Żuraw Crane\n**Granaries in Ołowianka\n**museum ship SS Soldek is anchored on the Motława River and was the first ship built in post-war Poland.\n*Archeological Museum (Muzeum Archeologiczne)\n*Gdańsk Nowy Port Lighthouse (Latarnia Morska Gdańsk Nowy Port)\n*Izba Pamięci Wincentego Pola w Gdańsku-Sobieszewie\n*Archdiocese Museum (Muzeum Archidiecezjalne)\n*Museum of the Second World War\n\nEntertainment\n\n*Polish Baltic Philharmonic\n*Baltic Opera\n*Teatr Wybrzeże\n*Gdańsk Shakespeare Theatre is a Shakespearean theatre built on the historical site of a 17th-century playhouse where English travelling players came to perform. The new theatre, completed in 2014, hosts the annual Gdańsk Shakespeare Festival.\n\nTransport\n\n* Gdańsk Lech Wałęsa Airport – an international airport located in Gdańsk;\n* The Szybka Kolej Miejska, (SKM) the Fast Urban Railway, functions as a Metro system for the Tricity area including Gdańsk, Sopot and Gdynia, operating frequent trains to 27 stations covering the Tricity.SKM Passenger Information, Map http://www.skm.pkp.pl/ The service is operated by electric multiple unit trains at a frequency of 6 minutes to 30 minutes between trains (depending on the time of day) on the central section between Gdańsk and Gdynia, and less frequently on outlying sections. The SKM system has been extended northwest of the Tricity, to Wejherowo, Lębork and Słupsk, 110 km west of Gdynia, and to the south it has been extended to Tczew, 31 km south of Gdańsk.\n* Railways: The principal station in Gdańsk is Gdańsk Główny railway station, served by both SKM local trains and PKP long distance trains. In addition, long distance trains also stop at Gdańsk Oliwa railway station, Gdańsk Wrzeszcz railway station, Sopot and Gdynia. Gdańsk also has nine (9) other railway stations, served by local SKM trains;\n* Long distance trains are operated by PKP Intercity which provides connections with all major Polish cities, including Warsaw, Kraków, Łódź, Poznań, Katowice and Szczecin, and with the neighbouring Kashubian Lakes region.\n\nIn 2011–2015 the Warsaw-Gdańsk-Gdynia railway route underwent a major upgrading costing $3 billion, partly funded by the European Investment Bank, including track replacement, realignment of curves and relocation of sections of track to allow speeds up to 200 km/h, modernization of stations, and installation of the most modern ETCS signalling system, which was completed in June 2015. In December 2014 new Alstom Pendolino high-speed trains were put into service between Gdańsk, Warsaw and Kraków reducing the rail travel time from Gdańsk to Warsaw to 2 hours 58 minutes,[http://www.railwaygazette.com/news/passenger/single-view/view/polish-pendolino-launches-200-kmh-operation.html Polish Pendolino launches 200 km/h operation, Railway Gazette International], 15 December 2014 further reduced in December 2015 to 2 hours 39 minutes.';Jeszcze szybciej z Warszawy do Gdańska,' Kurier Kolejowy 9 01 2015 http://www.kurierkolejowy.eu/aktualnosci/22716/Jeszcze-szybciej-z-Warszawy-do-Gdanska.html\n\n* A new railway, Pomorska Kolej Metropolitalna (PKM, the 'Pomeranian Metropolitan Railway'), commenced service on 1 September 2015, connecting Gdańsk Lech Wałęsa Airport with Wrzeszcz and downtown Gdańsk. It connects to the Szybka Kolej Miejska (Tricity) (SKM) which provides further connections to the entire area served by SKM.\n* City buses and trams are operated by [http://www.ztm.gda.pl/ ZTM Gdańsk] (Zarząd Transportu Miejskiego w Gdańsku).\n* Port of Gdańsk – a seaport located on the southern coast of Gdańsk Bay within the city;\n* Obwodnica Trojmiejska – part of expressway S6 that bypasses the cities of Gdańsk, Sopot and Gdynia.\n* The A1 motorway connects the port and city of Gdańsk with the southern border of the country. , some fragments of the A1 motorway are still incomplete.\n\nGdańsk is the starting point of the EuroVelo 9 cycling route which continues southward through Poland, then into the Czech Republic, Austria and Slovenia before ending at the Adriatic Sea in Pula, Croatia.\n\nSports\n\nThere are many popular professional sports teams in the Gdańsk and Tricity area. Amateur sports are played by thousands of Gdańsk citizens and also in schools of all levels (elementary, secondary, university).\n\nThe city's professional football club is Lechia Gdańsk. Founded in 1945, they play in the Ekstraklasa, Poland's top division. Their home stadium, Stadion Energa Gdańsk, was one of the four Polish stadiums to host the UEFA Euro 2012 competition. Other notable clubs include rugby club Lechia Gdańsk (12 times Polish Champion) and motorcycle speedway club Wybrzeże Gdańsk.\n\nThe city's Hala Olivia was a venue for the official 2009 EuroBasket.[http://www.fiba.com/pages/eng/fa/event/p/sid/6328/_/index.html 2009 EuroBasket], ARCHIVE.FIBA.com, Retrieved 5 June 2016.\n\nPolitics and local government\n\nContemporary Gdańsk is the capital of the province called Pomeranian Voivodeship and is one of the major centers of economic and administrative life in Poland. Many important agencies of the state and local government levels have their main offices here: the Provincial Administration Office, the Provincial Government, the Ministerial Agency of the State Treasury, the Agency for Consumer and Competition Protection, the National Insurance regional office, the Court of Appeals, and the High Administrative Court.\n\nRegional centre\n\nGdańsk Voivodeship was extended in 1999 to include most of former Słupsk Voivodeship, the western part of Elbląg Voivodeship and Chojnice County from Bydgoszcz Voivodeship to form the new Pomeranian Voivodeship.\nThe area of the region was thus extended from 7394 to and the population rose from 1,333,800 (1980) to 2,198,000 (2000). By 1998, Tricity constituted an absolute majority of the population; almost half of the inhabitants of the new region live in the centre.\n\nMunicipal government\n\nLegislative power in Gdańsk is vested in a unicameral Gdańsk City Council (Rada Miasta), which comprises 34 members. Council members are elected directly every four years. Like most legislative bodies, the City Council divides itself into committees which have the oversight of various functions of the city government.\n\n; City Council in 2002–2006:\n* Platforma Obywatelska – 15 seats\n* Sojusz Lewicy Demokratycznej-Unia Pracy – 6 seats\n* KW Wyborców i Sympatyków Lecha Kaczyńskiego Prawo i Samorządność – 6 seats\n* Liga Polskich Rodzin – 5 seats\n* Samoobrona – 1 seat\n* Obywatelski Komitet Bogdana Borusewicza – 1 seat\n\n; City Council in 2006–2010:\n* Platforma Obywatelska – 21 seats\n* Prawo i Sprawiedliwość – 13 seats\n\n; City Council in 2010–2014:\n* Platforma Obywatelska – 26 seats\n* Prawo i Sprawiedliwość – 7 seats\n* Sojusz Lewicy Demokratycznej – 1 seat\n\n; City Council in 2014–2018:\n* Platforma Obywatelska – 22 seats\n* Prawo i Sprawiedliwość – 12 seats\n\nDistricts\n\nGdańsk is divided into 34 administrative divisions: 6 dzielnicas and 28 osiedles. Gdańsk dzielnicas include: Chełm, Piecki-Migowo, Przymorze Wielkie, Śródmieście, Wrzeszcz Dolny, Wrzeszcz Górny.\n\nOsiedles: Aniołki, Brętowo, Brzeźno, Jasień, Kokoszki, Krakowiec-Górki Zachodnie, Letnica, Matarnia, Młyniska, Nowy Port, Oliwa, Olszynka, Orunia-Św. Wojciech-Lipce, Osowa, Przeróbka, Przymorze Małe, Rudniki, Siedlce, Sobieszewo Island, Stogi, Strzyża, Suchanino, Ujeścisko-Łostowice, VII Dwór, Wzgórze Mickiewicza, Zaspa-Młyniec, Zaspa-Rozstaje, Żabianka-Wejhera-Jelitkowo-Tysiąclecia.\n\nEducation and science\n\nThere are 15 higher schools including 3 universities. In 2001 there were 60,436 students, including 10,439 graduates.\n* Gdańsk University (Uniwersytet Gdański)\n* Gdańsk University of Technology (Politechnika Gdańska)\n* Gdańsk Medical University (Gdański Uniwersytet Medyczny)\n* Academy of Physical Education and Sport of Gdańsk (Akademia Wychowania Fizycznego i Sportu im. Jędrzeja Śniadeckiego)\n* Musical Academy (Akademia Muzyczna im. Stanisława Moniuszki)\n* Arts Academy (Akademia Sztuk Pięknych)\n* [https://www.imp.gda.pl/en/ Institute of Fluid Flow Machinery of the Polish Academy of Sciences] - Instytut Maszyn Przepływowych im. Roberta Szewalskiego PAN\n* Instytut Budownictwa Wodnego PAN\n* AteneumSzkoła Wyższa\n* Gdańska Wyższa Szkoła Humanistyczna\n* Gdańska Wyższa Szkoła Administracji\n* Wyższa Szkoła Społeczno-Ekonomiczna\n* Wyższa Szkoła Turystyki i Hotelarstwa w Gdańsku\n* Wyższa Szkoła Zarządzania\n* WSB Universities – WSB University in Gdańsk[http://www.wsb.pl/english/about-wsb-group/wsb-gdansk WSB University in Gdańsk] – WSB Universities\n\nScientific and regional organizations\n\n* Gdańsk Scientific Society\n* Baltic Institute (Instytut Bałtycki), established 1925 in Toruń, since 1946 (?) in Gdańsk\n* TNOiK – Towarzystwo Naukowe Organizacji i Kierowania (Scientific Society for Organization and Management) O/Gdańsk\n* IBNGR – Instytut Badań nad Gospodarką Rynkową (The Gdańsk Institute for Market Economics)\n\nInternational relations\n\nTwin towns and sister cities\n\nGdańsk is twinned with:[in chronological order]\n\n*  Bremen, Germany (since 1976)\n*  Turku, Finland (since 1987)\n*  Cleveland, Ohio, United States (since 1990)\n*  Kalmar, Sweden (since 1991)\n*  Helsingør, Denmark (since 1992)\n*  Marseille, Bouches-du-Rhône, Provence-Alpes-Côte d'Azur, France (since 1992)\n*  Rouen, Seine-Maritime, Normandy, France (since 1992)\n*  Kaliningrad, Russia (since 1993)\n*  Sefton, Merseyside, England, United Kingdom (since 1993)\n*  St. Petersburg, Russia (since 1993)\n*  Astana, Kazakhstan (since 1996)\n*  Odessa, Ukraine (since 1996)\n*  Rotterdam, South Holland, Netherlands (since 1998)\n*  Vilnius, Lithuania (since 1998)\n*  Nice, Alpes-Maritimes, Provence-Alpes-Côte d'Azur, France (since 1999)\n*  Shanghai, China (since 2004)\n*  Palermo, Palermo, Sicily, Italy (since 2005)\n*  Šilutė, Lithuania (since 2004)\n\nPartnerships and cooperation\n\n*  Le Havre, Seine-Maritime, Normandy, France\n\nGallery\n\nFile:Ayuntamiento Principal, Gdansk, Polonia, 2013-05-20, DD 07.jpg|Gdańsk Town Hall\nFile:Gdańsk hotel Hilton.jpg|Gdańsk Hilton Hotel\nFile:Gdańsk, ul. Długi Targ 2.jpg|Green Gate\nFile:Gdansk tourist pictures 2009 0034.JPG|Długi Targ Street, Old Town\nFile:2010-07-08-gdansk-by-RalfR-067.jpg|Mariacka Street\nFile:Gdańsk Główne Miasto - Długa Street (131).jpg|Długa Street\nFile:Gdańsk, Długa 35.JPG|Lion's Castle Tenement House\nFile:John III Sobieski Monument in Gdańsk 2669.JPG|John III Sobieski Monument in Gdańsk\nFile:Gdańsk - Neptune's Fountain.JPG|Gdańsk – Neptune's Fountain\nFile:Puerta Dorada, Gdansk, Polonia, 2013-05-20, DD 01.jpg|Golden Gate Złota Brama\nFile:Gdańsk - Townhouses.JPG|Gdańsk – Townhouses\nFile:Gdańsk-Oliwa, bazylika archikatedralna(Aw58).JPG|Oliwa Cathedral\nFile:Westerplatte-Denkmal Danzig 2010.jpg|Westerplatte – Monument nearby Gdańsk\nFile:SM Gdańsk Ratusz Staromiejski (0) ID 635538.jpg|Old Town Hall\nFile:Gdansk Wielki Mlyn2014.jpg|Great Mill (left) and Millers' Guild House (right)\nFile:Gdansk Wisłoujście Fortress 1.jpg|Wisłoujście Fortress\nFile:Danzig Johanniskirche.jpg|Church of St. John\nFile:2010-07-11-gdansk-by-RaBoe-039.JPG|Rybackie Pobrzeże\nFile:Danzig-Werftarbeiterdenkmal.jpg|Monument to the Fallen Shipyard Workers of 1970 in Gdańsk\nFile:Danzig, Altes Müllergewerkshaus.jpg|Millers' Guild House\nFile:SM Gdańsk Kościół św Barbary (1) ID 635439.jpg|Saint Barbara church\nFile:Pl-gdansk-baszta-labedz-zamek2006.jpg|Swan Tower\nFile:635495 Gdańsk Wieża Więzienna 03.JPG|Gaol Tower\nFile:Danziger Bibliothek der Polnischen Akademie.JPG|Gdańsk Library of Polish Academy of Sciences\nFile:Gdańsk, pomnik Jana Heweliusza.jpg|Jan Heweliusz Monument\nFile:Park Oliwski (maj 2014).JPG|Oliwa Park\nFile:Port of Gdansk from mainmast of Fryderyk Chopin.jpg|Port of Gdańsk from mainmast of Fryderyk Chopin\nFile:UG - WPiA ubt.jpeg|Gdańsk University – Faculty of Law and Administration\nFile:Przymorze-obroncow wybrzeza nowe bloki.jpg|Modern blocks in Obrońców Wybrzeża Street\n\nPopulation",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gdańsk" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12099" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Gdańsk (,; German: ',) is a Polish city on the Baltic coast. It is the capital of the Pomeranian Voivodeship, Poland's principal seaport and the centre of the country's fourth-largest metropolitan area.\n\nThe city lies on the southern edge of Gdańsk Bay (of the Baltic Sea), in a conurbation with the city of Gdynia, spa town of Sopot, and suburban communities, which together form a metropolitan area called the Tricity (Trójmiasto), with a population approaching 1.4 million. Gdańsk itself has a population of 460,427 (December 2012), making it the largest city in the Pomerania region of Northern Poland.\n\nGdańsk is the capital of Gdańsk Pomerania and the largest city of Kashubia. With its origins as a Polish stronghold erected in the 980s by Mieszko I of Poland, the city's history is complex, with periods of Polish rule, periods of Prussian or German rule, and periods of autonomy or self-rule as a \"free city\". In the early-modern age Gdańsk was a royal city of Poland. It was considered the wealthiest and the largest city of Poland, prior to the 18th century rapid growth of Warsaw. Between the world wars, the Free City of Danzig was in a customs union with Poland and was located between German East Prussia and the so-called Polish Corridor.\n\nGdańsk lies at the mouth of the Motława River, connected to the Leniwka, a branch in the delta of the nearby Vistula River, which drains 60 percent of Poland and connects Gdańsk with the Polish capital, Warsaw. Together with the nearby port of Gdynia, Gdańsk is also an important industrial center. In the late Middle Ages it was an important seaport and shipbuilding town, and in the 14th and 15th centuries a member of the Hanseatic League.\n\nIn the interwar period, owing to its multi ethnic make-up and history, Danzig lay in a disputed region between Poland and the Weimar Republic, and later Nazi Germany. The city's ambiguous political status was exploited, furthering tension between the two countries, which would ultimately culminate in the Invasion of Poland and the first clash of the Second World War just outside the city limits. In the 1980s it would become the birthplace of the Solidarity movement, which played a major role in bringing an end to Communist rule in Poland and helped precipitate the collapse of the Eastern Bloc, the fall of the Berlin Wall and the dissolution of the Soviet Union.\n\nGdańsk is home to the University of Gdańsk, Gdańsk University of Technology, the National Museum, the Gdańsk Shakespeare Theatre, the Museum of the Second World War, Polish Baltic Philharmonic and the European Solidarity Centre. The city also hosts St. Dominic's Fair, which dates back to 1260, and is regarded as one of the biggest trade and cultural events in Europe.\n\nNames\n\nThe city's name is thought to originate from the Gdania River,[http://google.com/search?qcache:CricehQx6TwJ:www.directferries.co.uk/gdansk_guide.htm+Gdania+river&hl\nen&ctclnk&cd\n3&glca From the history of Gdańsk city name, as explained at Gdańsk Guide] the original name of the Motława branch on which the city is situated. The name of a settlement was recorded after St. Adalbert's death in AD 997 as urbs Gyddanyzc and later was written as Kdanzk in 1148, Gdanzc in 1188, Danceke in 1228, Gdansk in 1236,Also in 1454, 1468, 1484, and 1590 Danzc in 1263, Danczk in 1311,Also in 1399, 1410, and 1414–1438 Danczik in 1399,Also in 1410, 1414 Danczig  in 1414, Gdąnsk in 1656. In Polish the modern name of the city is pronounced. In English (where the diacritic over the \"n\" is frequently omitted) the usual pronunciation is or. The German name, \"Danzig\", is pronounced as.\n\nThe city's Latin name may be given as either Gedania, Gedanum or Dantiscum; the variety of Latin names reflects the mixed influence of the city's Polish, German and Kashubian heritage. Other former spellings of the name include Dantzig, Dantsic and Dantzic.\n\nCeremonial names\n\nOn special occasions the city is also referred to as \"The Royal Polish City of Gdańsk\" (Polish Królewskie Polskie Miasto Gdańsk, Latin Regia Civitas Polonica Gedanensis, Kashubian Królewsczi Polsczi Gard Gduńsk).Gdańsk, in: Kazimierz Rymut, Nazwy Miast Polski, Ossolineum, Wrocław 1987Hubert Gurnowicz, Gdańsk, in: Nazwy miast Pomorza Gdańskiego, Ossolineum, Wrocław 1978Baedeker's Northern Germany, Karl Baedeker Publishing, Leipzig 1904 In the Kashubian language the city is called Gduńsk. Kashubians also use the name \"Our Capital City Gduńsk\" (Nasz Stoleczny Gard Gduńsk) or \"The Kashubian Capital City Gduńsk\" (Stoleczny Kaszëbsczi Gard Gduńsk).\n\nHistory\n\nEarly Poland\n\nThe first written record thought to refer to Gdańsk is the vita of Saint Adalbert. Written in 999, it describes how in 997 Saint Adalbert of Prague baptised the inhabitants of urbs Gyddannyzc, \"which separated the great realm of the duke [i.e. Boleslaw the Brave of Poland] from the sea.\"Loew, Peter Oliver: Danzig. Biographie einer Stadt, Munich 2011, p. 24. No further written sources exist for the 10th and 11th centuries. Based on the date in Adalbert's vita, the city celebrated its millennial anniversary in 1997.Wazny, Tomasz; Paner, Henryk; Golebiewski, Andrzej; Koscinski, Bogdan: Early medieval Gdansk/Danzig revisited (EuroDendro 2004), Rendsburg 2004, [http://www.bfafh.de/eurodendro2004/abstracts_inet.pdf pdf-abstract] .\n\nArchaeological evidence for the origins of the town was retrieved mostly after World War II had laid 90 percent of the city center in ruins, enabling excavations.Loew (2011), p. 24; Wazny et al. (2004), [http://www.bfafh.de/eurodendro2004/abstracts_inet.pdf abstract] . The oldest seventeen settlement levels were dated to between 980 and 1308. It is generally thought that Mieszko I of Poland erected a stronghold on the site in the 980s, thereby connecting the Polish state ruled by the Piast dynasty with the trade routes of the Baltic Sea. Traces of buildings and housing from 10th century have been found in archaeological excavations of the city.\n\nPomeranian Poland\n\nThe site was ruled on behalf of Poland by the Samborides' duchy and consisted of a settlement at the modern Long Market, craftsmen settlements along the Old Ditch, German merchant settlements around the St Nicolas church and the old Piast stronghold. In 1186, a Cistercian monastery was set up in nearby Oliwa, which is now within the city limits. In 1215, the ducal stronghold became the centre of a Pomerelian splinter duchy. At that time the area of the later city comprised different villages. At least since 1224/25 a German market settlement with merchants from Lübeck existed in the area of today's Long Market.name\"harlander\"> In 1224/25, merchants from Lübeck were invited as \"hospites\" (immigrants with specific privileges) but were soon forced to leave by Swantopolk II of the Samborides in 1238 during a war between Swantopolk and the Teutonic Knights, during which Lübeck supported the latter. Migration of merchants to the town resumed in 1257. Significant German influence did not appear until the 14th century, after the takeover of the city by the Teutonic Knights.\nAt latest in 1263 Pomerelian duke, Swantopolk II. granted city rights under Lübeck law to the emerging market settlement. It was an autonomy charter similar to that of Lübeck, which was also the primary origin of many settlers. In a document of 1271 the Pomerelian duke Mestwin II. addressed the inhabitants of the city as \"„burgensibus Theuthonicis fidelibus\", loyal German citizens, and mentions them separately from the Prussians and Pomeranians, who lived outside the city in an older settlement, the later known Old Town.name=\"lingenberg\">‘The Slippery Memory of Men’: The Place of Pomerania in the Medieval Kingdom of Poland\nby Paul Milliman page 73, 2013\n\nIn 1300, the town had an estimated population of 2,000. While overall the town was not a very important trade centre at that time, it had some relevance in the trade with Eastern Europe. Low on funds, the Samborides lent the settlement to Brandenburg, although they planned to take the city back and give it to Poland. Poland threatened to intervene, and Brandenburg left the town. Subsequently, the city was taken by Danish princes in 1301. The Teutonic Knights were hired by the Polish nobles to clear out the Danes.\n\nTeutonic Knights\n\nIn 1308, the town was taken by Brandenburg and the Teutonic Knights restored order. Subsequently, the Knights took over control of the town. Primary sources record a massacre carried out by the Teutonic Knights on the local population, of 10,000 people, but the exact number killed is subject of dispute in modern scholarship.Hartmut Boockmann, Ostpreussen und Westpreussen, Siedler, 2002, p.158,  Some authors accept the number given in the original sources,James Minahan, One Europe, Many Nations: A Historical Dictionary of European National Groups, Greenwood Publishing Group, 2000, , [https://books.google.com/books?id\nNwvoM-ZFoAgC&pgPA376&dq\n1308+Gdansk+massacre&as_brr3&ei\ncilQSPHSMom2iwGE8JU0&sigOR_a7-g10jIZsYOJGkmBe5ZwfSY p.376 Google Books] while others consider 10,000 to have been a medieval exaggeration, although scholarly consensus is that a massacre of some magnitude did take place. The events were used by the Polish crown to condemn the Teutonic Knights in a subsequent papal lawsuit.Thomas Urban: \"[http://www.thomas-urban.pl/gdansk.php Rezydencja książąt Pomorskich]\".  \n\nThe knights colonised the area, replacing local Kashubians and Poles with German settlers. In 1308, they founded Osiek Hakelwerk near the town, initially as a Slavic fishing settlement. In 1340, the Teutonic Knights built a large fortress, which became the seat of the knights' Komtur. In 1346 they changed the Town Law of the city, which then consisted only of the Rechtstadt, to Kulm law. In 1358, Danzig joined the Hanseatic League, and became an active member in 1361. It maintained relations with the trade centers Bruges, Novgorod, Lisboa and Sevilla. Around 1377, the Old Town was equipped with city rights as well. In 1380, the New Town was founded as the third, independent settlement.\n\nAfter a series of Polish-Teutonic Wars, in the Treaty of Kalisz (1343) the Order had to acknowledge that it would hold Pomerelia as an alm from the Polish Crown. Although it left the legal basis of the Order's possession of the province in some doubt, the city thrived as a result of increased exports of grain (especially wheat), timber, potash, tar, and other goods of forestry from Prussia and Poland via the Vistula River trading routes, although after its capture, the Teutonic Knights tried to actively reduce the economic significance of the town. While under the control of the Teutonic Order German migration increased. The Order's religious networks helped to develop Danzig's literary culture. A new war broke out in 1409, ending with the Battle of Grunwald (1410), and the city came under the control of the Kingdom of Poland. A year later, with the First Peace of Thorn, it returned to the Teutonic Order.\n\nKingdom of Poland\n\nIn 1440, the city participated in the foundation of the Prussian Confederation which was an organisation opposed to the rule of the Teutonic Knights. This led to the Thirteen Years' War of independence from the Teutonic Monastic State of Prussia (1454–1466). On May 25, 1457, the city gained its rights and independence as an autonomous city.[http://www.geocities.com/CapitolHill/Rotunda/2209/Gdańsk.html Danzig – Gdańsk until 1920] \n\nOn 15 May 1457, Casimir IV of Poland granted the town the Great Privilege, after he had been invited by the town's council and had already stayed in town for five weeks. With the Great Privilege, the town was granted füll autonomy and protection by the King of Poland.: \"Geben wir und verlehen unnsir Stadt Danczk das sie zcu ewigen geczeiten nymands for eynem herrn halden noc gehorsam zcu weszen seyn sullen in weltlichen sachen.\" It clearly states that Danzig is free and no citizen is subject to any king. The privilege removed tariffs and taxes on trade within Poland, Lithuania and Ruthenia (present day Belarus and Ukraine) and conferred on the town independent jurisdiction, legislation and administration of her territory, as well as the right to mint its own coin. Furthermore, the privilege united Old Town, Osiek and Main Town, and legalised the demolition of New Town, which had sided with the Teutonic Knights. By 1457, New Town was demolished completely, no buildings remained.\n\nGaining free and privileged access to Polish markets, the seaport prospered while simultaneously trading with the other Hanseatic cities. After the Second Peace of Thorn (1466) with the Teutonic Monastic State of Prussia the warfare between the latter and the Polish crown ended permanently. After the Union of Lublin between Poland and Lithuania in 1569 the city continued to enjoy a large degree of internal autonomy (cf. Danzig Law). Being the largest and one of the most influential cities of Poland, it enjoyed voting rights during the royal election period in Poland.\n\nIn 1569 a Mennonite Church was founded here.\n\nIn the 1575 election of a king to the Polish throne, Danzig supported Maximilian II against Stephen Báthory. It was the latter who eventually became monarch but the city, encouraged by the secret support of Denmark and Emperor Maximilian, shut its gates against Stephen. After the Siege of Danzig (1577), lasting six months, the city's army of 5,000 mercenaries was utterly defeated in a field battle on 16 December 1577. However, since Stephen's armies were unable to take the city by force, a compromise was reached: Stephen Báthory confirmed the city's special status and her Danzig Law privileges granted by earlier Polish kings. The city recognised him as ruler of Poland and paid the enormous sum of 200,000 guldens in gold as payoff (\"apology\").\n\nAround 1640, Johannes Hevelius established his astronomical observatory in the Old Town. Polish King John III Sobieski regularly visited Hevelius numerous times.\n\nBeside the large numbers of German-speakers, whose elites sometimes distinguished their German dialect as Pomerelian,Bömelburg, Hans-Jürgen, Zwischen polnischer Ständegesellschaft und preußischem Obrigkeitsstaat: vom Königlichen Preußen zu Westpreußen (1756–1806), München: Oldenbourg, 1995, (Schriften des Bundesinstituts für Ostdeutsche Kultur und Geschichte (Oldenburg); 5), zugl.: Mainz, Johannes Gutenberg-Univ., Diss., 1993, 549 pp. the city was home to a large number of Polish-speaking Poles, Jewish Poles, Latvian speaking Kursenieki, Flemings and Dutch. In addition, a number of Scots took refuge or migrated to and received citizenship in the city. During the Protestant Reformation, most German-speaking inhabitants adopted Lutheranism. Due to the special status of the city and significance within the Polish–Lithuanian Commonwealth, the city inhabitants largely became bi-cultural sharing both Polish and German culture and were strongly attached to the traditions of the Polish–Lithuanian Commonwealth.Historia Polski 1795–1815 Andrzej Chwalba Kraków 2000, page 441\n\nThe city suffered a last great plague and a slow economic decline due to the wars of the 18th century. As a stronghold of Stanisław Leszczyński's supporters during the War of the Polish Succession, it was taken by the Russians after the Siege of Danzig in 1734.\n\nThe Danzig Research Society founded in 1743 was one of the first of its kind.\n\nPrussia and Germany\n\nDanzig was annexed by the Kingdom of Prussia in 1793, in the Second Partition of Poland. An attempt of student uprising against Prussia led by Gottfried Benjamin Bartholdi was crushed quickly by the authorities in 1797.Dzieje Gdańska Edmund Cieślak, Czesław Biernat Wydawn. Morskie, 1969 page 370Dzieje Polski w datach Jerzy Borowiec, Halina Niemiec page 161Polska, losy państwa i narodu Henryk Samsonowicz 1992 Iskry page 282 During the era of Napoleon the city became a free city in the period extending from 1807 to 1814.\n\nIn 1815, after France's defeat in the Napoleonic Wars, it again became part of Prussia and became the capital of Regierungsbezirk Danzig within the province of West Prussia. The city's longest serving president was Robert von Blumenthal, who held office from 1841, through the revolutions of 1848, until 1863. With the unification of Germany under Prussian hegemony, the city became part of Imperial Germany (the German Empire) in 1871, and remained so until 1919, after Germany's defeat in World War I.\n\nInter-war years and World War II\n\nWhen Poland regained its independence after World War I with access to the sea as promised by the Allies on the basis of Woodrow Wilson's \"Fourteen Points\" (point 13 called for \"an independent Polish state\", \"which should be assured a free and secure access to the sea\"), the Poles hoped the city's harbour would also become part of Poland. However, since Germans formed a majority in the city, with Poles being a minority,In the 1923 census 7,896 people out of 335,921 gave Polish, Kashubian or Masurian as their native language. . Polish estimates of the Polish minority during the interwar era, however, range from 37,000 to 100,000 (9%–34%). Studia historica Slavo-Germanica, Tomy 18–20page 220 Uniwersytet Adama Mickiewicza w Poznaniu. Instytut Historii Wydawnictwo Naukowe imienia. Adama Mickiewicza, 1994. the city was not placed under Polish sovereignty. Instead, in accordance with the terms of the Versailles Treaty, it became the Free City of Danzig (German: Freie Stadt Danzig), an independent quasi-state under the auspices of the League of Nations with its external affairs largely under Polish control. Poland's rights also included free use of the harbour, a Polish post office, a Polish garrison in Westerplatte district, and customs union with Poland. This led to a considerable tension between the city and the Republic of Poland. The Free City had its own constitution, national anthem, parliament (Volkstag), and government (Senat). It issued its own stamps as well as its currency, the Danzig gulden.\n\nIn the early 1930s the local Nazi Party capitalised on pro-German sentiments and in 1933 garnered 50% of vote in the parliament. Thereafter, the Nazis under Gauleiter Albert Forster achieved dominance in the city government, which was still nominally overseen by the League of Nations' High Commissioner. The German government officially demanded the return of Danzig to Germany along with an extraterritorial (meaning under German jurisdiction) highway through the area of the Polish Corridor for land-based access from the rest of Germany. Hitler used the issue of the status of the city as a pretext for attacking Poland and on May 1939, during a high level meeting of German military officials explained to them: \"It is not Danzig that is at stake. For us it is a matter of expanding our Lebensraum in the east\", adding that there will be no repeat of the Czech situation, and Germany will attack Poland at first opportunity, after isolating the country from its Western Allies.The history of the German resistance, 1933–1945 Peter Hoffmann page 37 McGill-Queen's University Press 1996Hitler Joachim C. Fest page 586 Houghton Mifflin Harcourt, 2002Blitzkrieg w Polsce wrzesien 1939 Richard Hargreaves page 84 Bellona, 2009A military history of Germany, from the eighteenth century to the present dayMartin Kitchen page 305 Weidenfeld and Nicolson, 1975International history of the twentieth century and beyond Antony Best page 181 Routledge; 2 edition (July 30, 2008) As Nazi demands increased, German-Polish relations rapidly deteriorated. Germany invaded Poland on September 1 after having signed a non-aggression pact with the Soviet Union in late August.\n\nThe German attack began in Danzig, with a bombardment of Polish positions at Westerplatte by the German battleship , and the landing of German infantry on the peninsula. Outnumbered Polish defenders at Westerplatte resisted for seven days before running out of ammunition. Meanwhile, after a fierce day-long fight (1 September 1939), defenders of the Polish Post office were tried and executed then buried on the spot in the Danzig quarter of Zaspa in October 1939. In 1998 a German court overturned their conviction and sentence.\n\nThe city was officially annexed by Nazi Germany and incorporated into the Reichsgau Danzig-West Prussia. About 50 percent of members of the Jewish Community of Danzig had left the city within a year after a Pogrom in October 1937, after the Kristallnacht riots in November 1938 the community decided to organize its emigration and in March 1939 a first transport to Palestine started. By September 1939 barely 1,700 mostly elderly Jews remained. In early 1941, just 600 Jews were still living in Danzig, most of whom were later murdered in the Holocaust.\nOut of the 2,938 Jewish community in the city 1,227 were able to escape from the Nazis before the outbreak of war.Żydzi na terenie Wolnego Miasta Gdańska w latach 1920–1945:działalność kulturalna, polityczna i socjalnaGrzegorz Berendt Gdańskie Tow. Nauk., Wydz. I Nauk Społecznych i Humanistycznych, 1997 page 245 Nazi secret police had been observing Polish minority communities in the city since 1936, compiling information, which in 1939 served to prepare lists of Poles to be captured in Operation Tannenberg. On the first day of the war, approximately 1,500 ethnic Poles were arrested, some because of their participation in social and economic life, others because they were activists and members of various Polish organisations. On 2 September 1939, 150 of them were deported to the Sicherheitsdienst camp Stutthof some 30 mi from Danzig, and murdered.[http://www.kki.net.pl/~museum/museums.htm Museums Stutthof in Sztutowo]. Retrieved January 31, 2007.  Many Poles living in Danzig were deported to Stutthof or executed in the Piaśnica forest.\n\nIn 1941, Hitler ordered the invasion of the Soviet Union, eventually causing the fortunes of war to turn against Germany. As the Soviet Army advanced in 1944, German populations in Central and Eastern Europe took flight, resulting in the beginning of a great population shift. After the final Soviet offensives began in January 1945, hundreds of thousands of German refugees converged on Danzig, many of whom had fled on foot from East Prussia, some tried to escape through the city's port in a large-scale evacuation involving hundreds of German cargo and passenger ships. Some of the ships were sunk by the Soviets, including the  after an evacuation was attempted at neighbouring Gdynia. In the process, tens of thousands of refugees were killed.\n\nThe city also endured heavy Allied and Soviet air raids. Those who survived and could not escape had to face the Soviet Army, which captured the heavily damaged city on 30 March 1945, followed by large-scale rape[http://www.dailymail.co.uk/news/article-2458778/Komm-Frau-Gdansk-tears-statue-marking-rape-millions-German-women-Russian-soldiers.html Brady, Tara. 2013. Polish town tears down statue marking the rape of millions of German women by Russian soldiers. Mail Online (October 14).] and looting.Biskupski, Mieczysław B. The History of Poland. Westport, CT: Greenwood Press, p. 97.Tighe, Carl. Gdańsk: National Identity in the Polish-German Borderlands. London: Palgrave Macmillan, p. 199. In line with the decisions made by the Allies at the Yalta and Potsdam conferences, the city was annexed by Poland. The remaining German residents of the city who had survived the war fled or were forcibly expelled to postwar Germany, and the city was repopulated by ethnic Poles; up to 18 percent (1948) of them had been deported by the Soviets in two major waves from Polish areas annexed by the Soviet Union, i.e. from the eastern portion of pre-war Poland.\n\nContemporary times\n\nParts of the historic old city of Gdańsk, which had suffered large-scale destruction during the war, were rebuilt during the 1950s and 1960s. The reconstruction was not tied to the city's pre-war appearance, but instead was politically motivated as a means of culturally cleansing and destroying all traces of German influence from the city. Any traces of German tradition were ignored, suppressed, or regarded as \"Prussian barbarism\" only worthy of demolition, while Flemish/Dutch, Italian and French influences were used to replace the historically accurate Germanic architecture which the city was built upon since the 14th century.\n\nBoosted by heavy investment in the development of its port and three major shipyards for Soviet ambitions in the Baltic region, Gdańsk became the major shipping and industrial center of the Communist People's Republic of Poland.\n\nIn December 1970, Gdańsk was the scene of anti-regime demonstrations, which led to the downfall of Poland's communist leader Władysław Gomułka. During the demonstrations in Gdańsk and Gdynia, military as well as the police opened fire on the demonstrators causing several dozen deaths. Ten years later, in August, 1980, Gdańsk Shipyard was the birthplace of the Solidarity trade union movement, whose opposition to the Communist regime led to the end of Communist Party rule in 1989, and sparked a series of protests that successfully overturned the Communist regimes of the former Soviet bloc. Solidarity's leader, Lech Wałęsa, became President of Poland in 1990. In 2014 the European Solidarity Centre, a museum and library devoted to the history of the movement, opened in Gdańsk.\n\nGdańsk native Donald Tusk became Prime Minister of Poland in 2007, and President of the European Council in 2014. Today Gdańsk is a major shipping port and tourist destination.\n\nClimate\n\nGdańsk has a climate with both oceanic and continental influences. According to some categorizations, it has an oceanic climate (Cfb)[http://www.weatherbase.com/weather/weather-summary.php3?s5121&cityname\nGdansk%2C+Pomeranian+Voivodeship%2C+Poland&units= Weatherbase.com - Gdansk] Retrieved 14.02.2018, while others classify it as belonging to the continental climate zone (Dfb)[https://www.britannica.com/media/full/276210/206711 Britannica - Köppen climate classification] Retrieved 14.02.2018. It actually depends on whether the mean reference temperature for the coldest winter month is set at -3 °C (26.6 °F) or 0 °C (32 °F). Gdańsk's dry winters and the precipitation maximum in summer are indicators of continentality. However seasonal extremes are less pronounced than those in inland Poland.\n\nThe city has moderately cold and cloudy winters with temperature means in January and February staying below 0°C, and mild summers with frequent showers and thunderstorms. Average temperatures range from  and average rainfall varies from 17.9 mm/month to 66.7 mm/month with a rather low annual total of 507.3 mm. In general it is damp, variable and mild. The seasons are clearly differentiated. Spring starts in March and is initially cold and windy, later becoming pleasantly warm and often very sunny. Summer, which begins in June, is predominantly warm but hot at times (with temperature reaching as high as 30-35C at least\nonce per year) with plenty of sunshine interspersed with heavy rain. The average annual hours of sunshine for Gdańsk are 1700. July and August are the hottest months. Autumn comes in September and is at first warm and usually sunny, turning cold, damp and foggy in November. Winter lasts from December to March and includes periods of snow. January and February are the coldest months with the temperature sometimes dropping as low as .\n\nEconomy\n\nThe industrial sections of the city are dominated by shipbuilding, petrochemical & chemical industries, and food processing. The share of high-tech sectors such as electronics, telecommunications, IT engineering, cosmetics and pharmaceuticals is on the rise. Amber processing is also an important part of the local economy, as the majority of the world's amber deposits lie along the Baltic coast. The Pomeranian Voivodeship, including Gdańsk, is also a major tourist destination in the summer, as millions of Poles and other European tourists flock to the beaches of the Baltic coastline.\nMajor companies in Gdańsk:\n\n* Acxiom – IT\n* Arla Foods – food processing\n* Bayer Shared Service Centre – finance & accounting\n* Cognor – steel, engineering, capital goods\n* Coleman Research – knowledge broker\n* Crist – shipbuilding\n* Delphi – automotive parts\n* Dr. Oetker – food processing\n* Grupa Lotos – energy, petrol refinery\n* Energa Trading – electrical and heat energy\n* Bank BPH – finance\n* Gdańska Stocznia Remontowa – shipbuilding\n* Elektrociepłownie Wybrzeże – energy\n* LPP – retail\n* Polnord Energobudowa – construction company\n* Petrobaltic – energy, oil drilling\n* Intel – IT\n* IBM – IT\n* IVONA – IT\n* FINEOS – IT [https://archive.is/20130124034524/http://www.fineos.com/about/locations/ FINEOS Locations]\n* Wirtualna Polska – internet service\n* Kainos – IT\n* Lufthansa Systems – IT\n* Jeppesen – IT\n* Compuware – IT\n* Thomson Reuters – media\n* ThyssenKrupp – steel, engineering, capital goods\n* Maersk Line – services & pick-up\n* Transcom WorldWide – business processing outsourcing\n* Jysk – retail\n* Meritum Bank – finance\n* Glencore – raw materials\n* Orlen Morena – energy\n* Fosfory Ciech – chemical company\n* Hydrobudowa – construction company\n* Llentabhallen – steel constructions\n* Ziaja – cosmetics and beauty company\n* Stabilator – construction company\n* Skanska – construction company\n* Flügger – paints manufacturing\n* HD heavy duty – retail\n* Dresser Wayne – retail fueling systems\n* First Data – finance\n* Masterlease – finance\n* Transcom WorldWide – business processing outsourcing\n* Weyerhaeuser Cellulose Fibres – cellulose fibre manufacturing\n* Gdańsk Shipyard – shipbuilding\n* Remontowa Shipbuilding – shipbuilding\n* OIE Support – education services (part of Laureate International Universities)\n* PricewaterhouseCoopers LLP – professional services\n* Kemira – chemical industry group\n* BreakThru Films – animated film studio\n* Schibsted – IT\n* Regus – business support services\n* Mango Media – home shopping channel\n* MOL Europe – shipping\n* VB Leasing – finance\n* Metsä Group – forest industry\n* Competence Call Centre – call centre\n* EPAM Systems – IT\n* Esotiq&Henderson – retail\n* Bayer – chemical and pharmaceutical company\n* Playsoft – IT\n* Staples Advantage – office products\n* Deloitte – professional services\n* KPMG – professional services\n* Comarch – IT\n* ESO Audit – professional services\n* TF Bank – finance\n\nMain sights \n\nArchitecture\n\nThe city has some buildings surviving from the time of the Hanseatic League. Most tourist attractions are located along or near Ulica Długa (Long Street) and Długi Targ (Long Market), a pedestrian thoroughfare surrounded by buildings reconstructed in historical (primarily during the 17th century) style and flanked at both ends by elaborate city gates. This part of the city is sometimes referred to as the Royal Route, since it was once the former path of processions for visiting Kings of Poland.\n\nWalking from end to end, sites encountered on or near the Royal Route include:\n* Highland Gate (Brama Wyżynna)\n* Torture House (Katownia)\n* Prison Tower (Wieża więzienna)\n* Mansion of the Society of Saint George (Dwór Bractwa św. Jerzego)\n* Golden Gate (Złota Brama)\n* Long Street (Ulica Długa)\n** Uphagen's House (Dom Uphagena)\n** Lion's Castle (Lwi Zamek)\n** Main Town Hall (Ratusz Głównego Miasta)\n* Long Market (Długi Targ)\n** Artus' Court (Dwór Artusa)\n** Neptune's Fountain (Fontanna Neptuna)\n** Golden House (Złota Kamienica)\n* Green Gate (Zielona Brama)\n\nGdańsk has a number of historical churches:\n* St. Bridget\n* St. Catherine\n* St. John\n* St. Mary (Bazylika Mariacka), a municipal church built during the 15th century, is the largest brick church in the world.\n* St. Nicholas\n* St. James\n* St. Joseph\n* St. Peter and Paul\n* St. Barbara\n* Corpus Christi\n\nThe city's 17th-century fortifications represent one of Poland's official national Historic Monuments (Pomnik historii), as designated September 16, 1994 and tracked by the National Heritage Board of Poland.\n\nOther main sights in the historical city centre include:\n* Royal Chapel of the Polish King John III Sobieski\n* Żuraw – medieval port crane\n* Gradowa Hill\n* Granaries on the Ołowianka and Granary Islands\n* Great Armoury\n* John III Sobieski Monument\n* Old Town Hall\n* Jan Heweliusz Monument\n* Great Mill\n* Small Mill\n* House of Research Society\n* Polish Post Office, site of the 1939 battle\n* brick gothic town gates, i.e. Mariacka Gate, Straganiarska Gate, Cow Gate\n\nMain sights outside the historical city centre include:\n* Abbot's Palace in the Oliwa Park\n* Lighthouse in Nowy Port\n* Oliwa Cathedral\n* Pachołek Hill – an observation point in Oliwa\n* Pier in Brzeźno\n* Westerplatte\n* Wisłoujście Fortress\n* Zoo in Oliwa\n\nMuseums\n\n*National Museum (Muzeum Narodowe)\n**Department of Ancient Art - contains a number of important artworks, including Hans Memling's Last Judgement\n**Green Gate\n**Department of Modern Art - in the Abbot's Palace in Oliwa\n**Ethnography Department - in the Abbot's Granary in Oliwa\n**Gdańsk Photography Gallery\n*Historical Museum (Muzeum Historyczne Miasta Gdańska):\n**Main Town Hall\n**Artus' Court\n**Uphagen's House\n**Amber Museum (Muzeum Bursztynu)\n**Museum of the Polish Post (Muzeum Poczty Polskiej)\n**Wartownia nr 1 na Westerplatte\n**Museum of Tower Clocks (Muzeum Zegarów Wieżowych)\n**Wisłoujście Fortress\n*National Maritime Museum, Gdańsk (Narodowe Muzeum Morskie):\n**Żuraw Crane\n**Granaries in Ołowianka\n**museum ship SS Soldek is anchored on the Motława River and was the first ship built in post-war Poland.\n*Archeological Museum (Muzeum Archeologiczne)\n*Gdańsk Nowy Port Lighthouse (Latarnia Morska Gdańsk Nowy Port)\n*Izba Pamięci Wincentego Pola w Gdańsku-Sobieszewie\n*Archdiocese Museum (Muzeum Archidiecezjalne)\n*Museum of the Second World War\n\nEntertainment\n\n*Polish Baltic Philharmonic\n*Baltic Opera\n*Teatr Wybrzeże\n*Gdańsk Shakespeare Theatre is a Shakespearean theatre built on the historical site of a 17th-century playhouse where English travelling players came to perform. The new theatre, completed in 2014, hosts the annual Gdańsk Shakespeare Festival.\n\nTransport\n\n* Gdańsk Lech Wałęsa Airport – an international airport located in Gdańsk;\n* The Szybka Kolej Miejska, (SKM) the Fast Urban Railway, functions as a Metro system for the Tricity area including Gdańsk, Sopot and Gdynia, operating frequent trains to 27 stations covering the Tricity.SKM Passenger Information, Map http://www.skm.pkp.pl/ The service is operated by electric multiple unit trains at a frequency of 6 minutes to 30 minutes between trains (depending on the time of day) on the central section between Gdańsk and Gdynia, and less frequently on outlying sections. The SKM system has been extended northwest of the Tricity, to Wejherowo, Lębork and Słupsk, 110 km west of Gdynia, and to the south it has been extended to Tczew, 31 km south of Gdańsk.\n* Railways: The principal station in Gdańsk is Gdańsk Główny railway station, served by both SKM local trains and PKP long distance trains. In addition, long distance trains also stop at Gdańsk Oliwa railway station, Gdańsk Wrzeszcz railway station, Sopot and Gdynia. Gdańsk also has nine (9) other railway stations, served by local SKM trains;\n* Long distance trains are operated by PKP Intercity which provides connections with all major Polish cities, including Warsaw, Kraków, Łódź, Poznań, Katowice and Szczecin, and with the neighbouring Kashubian Lakes region.\n\nIn 2011–2015 the Warsaw-Gdańsk-Gdynia railway route underwent a major upgrading costing $3 billion, partly funded by the European Investment Bank, including track replacement, realignment of curves and relocation of sections of track to allow speeds up to 200 km/h, modernization of stations, and installation of the most modern ETCS signalling system, which was completed in June 2015. In December 2014 new Alstom Pendolino high-speed trains were put into service between Gdańsk, Warsaw and Kraków reducing the rail travel time from Gdańsk to Warsaw to 2 hours 58 minutes,[http://www.railwaygazette.com/news/passenger/single-view/view/polish-pendolino-launches-200-kmh-operation.html Polish Pendolino launches 200 km/h operation, Railway Gazette International], 15 December 2014 further reduced in December 2015 to 2 hours 39 minutes.';Jeszcze szybciej z Warszawy do Gdańska,' Kurier Kolejowy 9 01 2015 http://www.kurierkolejowy.eu/aktualnosci/22716/Jeszcze-szybciej-z-Warszawy-do-Gdanska.html\n\n* A new railway, Pomorska Kolej Metropolitalna (PKM, the 'Pomeranian Metropolitan Railway'), commenced service on 1 September 2015, connecting Gdańsk Lech Wałęsa Airport with Wrzeszcz and downtown Gdańsk. It connects to the Szybka Kolej Miejska (Tricity) (SKM) which provides further connections to the entire area served by SKM.\n* City buses and trams are operated by [http://www.ztm.gda.pl/ ZTM Gdańsk] (Zarząd Transportu Miejskiego w Gdańsku).\n* Port of Gdańsk – a seaport located on the southern coast of Gdańsk Bay within the city;\n* Obwodnica Trojmiejska – part of expressway S6 that bypasses the cities of Gdańsk, Sopot and Gdynia.\n* The A1 motorway connects the port and city of Gdańsk with the southern border of the country. , some fragments of the A1 motorway are still incomplete.\n\nGdańsk is the starting point of the EuroVelo 9 cycling route which continues southward through Poland, then into the Czech Republic, Austria and Slovenia before ending at the Adriatic Sea in Pula, Croatia.\n\nSports\n\nThere are many popular professional sports teams in the Gdańsk and Tricity area. Amateur sports are played by thousands of Gdańsk citizens and also in schools of all levels (elementary, secondary, university).\n\nThe city's professional football club is Lechia Gdańsk. Founded in 1945, they play in the Ekstraklasa, Poland's top division. Their home stadium, Stadion Energa Gdańsk, was one of the four Polish stadiums to host the UEFA Euro 2012 competition. Other notable clubs include rugby club Lechia Gdańsk (12 times Polish Champion) and motorcycle speedway club Wybrzeże Gdańsk.\n\nThe city's Hala Olivia was a venue for the official 2009 EuroBasket.[http://www.fiba.com/pages/eng/fa/event/p/sid/6328/_/index.html 2009 EuroBasket], ARCHIVE.FIBA.com, Retrieved 5 June 2016.\n\nPolitics and local government\n\nContemporary Gdańsk is the capital of the province called Pomeranian Voivodeship and is one of the major centers of economic and administrative life in Poland. Many important agencies of the state and local government levels have their main offices here: the Provincial Administration Office, the Provincial Government, the Ministerial Agency of the State Treasury, the Agency for Consumer and Competition Protection, the National Insurance regional office, the Court of Appeals, and the High Administrative Court.\n\nRegional centre\n\nGdańsk Voivodeship was extended in 1999 to include most of former Słupsk Voivodeship, the western part of Elbląg Voivodeship and Chojnice County from Bydgoszcz Voivodeship to form the new Pomeranian Voivodeship.\nThe area of the region was thus extended from 7394 to and the population rose from 1,333,800 (1980) to 2,198,000 (2000). By 1998, Tricity constituted an absolute majority of the population; almost half of the inhabitants of the new region live in the centre.\n\nMunicipal government\n\nLegislative power in Gdańsk is vested in a unicameral Gdańsk City Council (Rada Miasta), which comprises 34 members. Council members are elected directly every four years. Like most legislative bodies, the City Council divides itself into committees which have the oversight of various functions of the city government.\n\n; City Council in 2002–2006:\n* Platforma Obywatelska – 15 seats\n* Sojusz Lewicy Demokratycznej-Unia Pracy – 6 seats\n* KW Wyborców i Sympatyków Lecha Kaczyńskiego Prawo i Samorządność – 6 seats\n* Liga Polskich Rodzin – 5 seats\n* Samoobrona – 1 seat\n* Obywatelski Komitet Bogdana Borusewicza – 1 seat\n\n; City Council in 2006–2010:\n* Platforma Obywatelska – 21 seats\n* Prawo i Sprawiedliwość – 13 seats\n\n; City Council in 2010–2014:\n* Platforma Obywatelska – 26 seats\n* Prawo i Sprawiedliwość – 7 seats\n* Sojusz Lewicy Demokratycznej – 1 seat\n\n; City Council in 2014–2018:\n* Platforma Obywatelska – 22 seats\n* Prawo i Sprawiedliwość – 12 seats\n\nDistricts\n\nGdańsk is divided into 34 administrative divisions: 6 dzielnicas and 28 osiedles. Gdańsk dzielnicas include: Chełm, Piecki-Migowo, Przymorze Wielkie, Śródmieście, Wrzeszcz Dolny, Wrzeszcz Górny.\n\nOsiedles: Aniołki, Brętowo, Brzeźno, Jasień, Kokoszki, Krakowiec-Górki Zachodnie, Letnica, Matarnia, Młyniska, Nowy Port, Oliwa, Olszynka, Orunia-Św. Wojciech-Lipce, Osowa, Przeróbka, Przymorze Małe, Rudniki, Siedlce, Sobieszewo Island, Stogi, Strzyża, Suchanino, Ujeścisko-Łostowice, VII Dwór, Wzgórze Mickiewicza, Zaspa-Młyniec, Zaspa-Rozstaje, Żabianka-Wejhera-Jelitkowo-Tysiąclecia.\n\nEducation and science\n\nThere are 15 higher schools including 3 universities. In 2001 there were 60,436 students, including 10,439 graduates.\n* Gdańsk University (Uniwersytet Gdański)\n* Gdańsk University of Technology (Politechnika Gdańska)\n* Gdańsk Medical University (Gdański Uniwersytet Medyczny)\n* Academy of Physical Education and Sport of Gdańsk (Akademia Wychowania Fizycznego i Sportu im. Jędrzeja Śniadeckiego)\n* Musical Academy (Akademia Muzyczna im. Stanisława Moniuszki)\n* Arts Academy (Akademia Sztuk Pięknych)\n* [https://www.imp.gda.pl/en/ Institute of Fluid Flow Machinery of the Polish Academy of Sciences] - Instytut Maszyn Przepływowych im. Roberta Szewalskiego PAN\n* Instytut Budownictwa Wodnego PAN\n* AteneumSzkoła Wyższa\n* Gdańska Wyższa Szkoła Humanistyczna\n* Gdańska Wyższa Szkoła Administracji\n* Wyższa Szkoła Społeczno-Ekonomiczna\n* Wyższa Szkoła Turystyki i Hotelarstwa w Gdańsku\n* Wyższa Szkoła Zarządzania\n* WSB Universities – WSB University in Gdańsk[http://www.wsb.pl/english/about-wsb-group/wsb-gdansk WSB University in Gdańsk] – WSB Universities\n\nScientific and regional organizations\n\n* Gdańsk Scientific Society\n* Baltic Institute (Instytut Bałtycki), established 1925 in Toruń, since 1946 (?) in Gdańsk\n* TNOiK – Towarzystwo Naukowe Organizacji i Kierowania (Scientific Society for Organization and Management) O/Gdańsk\n* IBNGR – Instytut Badań nad Gospodarką Rynkową (The Gdańsk Institute for Market Economics)\n\nInternational relations\n\nTwin towns and sister cities\n\nGdańsk is twinned with:[in chronological order]\n\n*  Bremen, Germany (since 1976)\n*  Turku, Finland (since 1987)\n*  Cleveland, Ohio, United States (since 1990)\n*  Kalmar, Sweden (since 1991)\n*  Helsingør, Denmark (since 1992)\n*  Marseille, Bouches-du-Rhône, Provence-Alpes-Côte d'Azur, France (since 1992)\n*  Rouen, Seine-Maritime, Normandy, France (since 1992)\n*  Kaliningrad, Russia (since 1993)\n*  Sefton, Merseyside, England, United Kingdom (since 1993)\n*  St. Petersburg, Russia (since 1993)\n*  Astana, Kazakhstan (since 1996)\n*  Odessa, Ukraine (since 1996)\n*  Rotterdam, South Holland, Netherlands (since 1998)\n*  Vilnius, Lithuania (since 1998)\n*  Nice, Alpes-Maritimes, Provence-Alpes-Côte d'Azur, France (since 1999)\n*  Shanghai, China (since 2004)\n*  Palermo, Palermo, Sicily, Italy (since 2005)\n*  Šilutė, Lithuania (since 2004)\n\nPartnerships and cooperation\n\n*  Le Havre, Seine-Maritime, Normandy, France\n\nGallery\n\nFile:Ayuntamiento Principal, Gdansk, Polonia, 2013-05-20, DD 07.jpg|Gdańsk Town Hall\nFile:Gdańsk hotel Hilton.jpg|Gdańsk Hilton Hotel\nFile:Gdańsk, ul. Długi Targ 2.jpg|Green Gate\nFile:Gdansk tourist pictures 2009 0034.JPG|Długi Targ Street, Old Town\nFile:2010-07-08-gdansk-by-RalfR-067.jpg|Mariacka Street\nFile:Gdańsk Główne Miasto - Długa Street (131).jpg|Długa Street\nFile:Gdańsk, Długa 35.JPG|Lion's Castle Tenement House\nFile:John III Sobieski Monument in Gdańsk 2669.JPG|John III Sobieski Monument in Gdańsk\nFile:Gdańsk - Neptune's Fountain.JPG|Gdańsk – Neptune's Fountain\nFile:Puerta Dorada, Gdansk, Polonia, 2013-05-20, DD 01.jpg|Golden Gate Złota Brama\nFile:Gdańsk - Townhouses.JPG|Gdańsk – Townhouses\nFile:Gdańsk-Oliwa, bazylika archikatedralna(Aw58).JPG|Oliwa Cathedral\nFile:Westerplatte-Denkmal Danzig 2010.jpg|Westerplatte – Monument nearby Gdańsk\nFile:SM Gdańsk Ratusz Staromiejski (0) ID 635538.jpg|Old Town Hall\nFile:Gdansk Wielki Mlyn2014.jpg|Great Mill (left) and Millers' Guild House (right)\nFile:Gdansk Wisłoujście Fortress 1.jpg|Wisłoujście Fortress\nFile:Danzig Johanniskirche.jpg|Church of St. John\nFile:2010-07-11-gdansk-by-RaBoe-039.JPG|Rybackie Pobrzeże\nFile:Danzig-Werftarbeiterdenkmal.jpg|Monument to the Fallen Shipyard Workers of 1970 in Gdańsk\nFile:Danzig, Altes Müllergewerkshaus.jpg|Millers' Guild House\nFile:SM Gdańsk Kościół św Barbary (1) ID 635439.jpg|Saint Barbara church\nFile:Pl-gdansk-baszta-labedz-zamek2006.jpg|Swan Tower\nFile:635495 Gdańsk Wieża Więzienna 03.JPG|Gaol Tower\nFile:Danziger Bibliothek der Polnischen Akademie.JPG|Gdańsk Library of Polish Academy of Sciences\nFile:Gdańsk, pomnik Jana Heweliusza.jpg|Jan Heweliusz Monument\nFile:Park Oliwski (maj 2014).JPG|Oliwa Park\nFile:Port of Gdansk from mainmast of Fryderyk Chopin.jpg|Port of Gdańsk from mainmast of Fryderyk Chopin\nFile:UG - WPiA ubt.jpeg|Gdańsk University – Faculty of Law and Administration\nFile:Przymorze-obroncow wybrzeza nowe bloki.jpg|Modern blocks in Obrońców Wybrzeża Street\n\nPopulation. Gdańsk. http://en.wikipedia.org/?curid=12099."
  }
}
