{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3992",
  "eid" : "caa155a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778419706,
  "textBody" : "Abraham \"Bram\" Stoker (8 November 1847 – 20 April 1912) was an Irish author, best known today for his 1897 Gothic novel Dracula. During his lifetime, he was better known as the personal assistant of actor Henry Irving and business manager of the Lyceum Theatre in London, which Irving owned.\n\nEarly life\n\nStoker was born on 8 November 1847 at 15 Marino Crescent, Clontarf, on the northside of Dublin, Ireland. His parents were Abraham Stoker (1799–1876) from Dublin and Charlotte Mathilda Blake Thornley (1818–1901), who was raised in County Sligo. Stoker was the third of seven children, the eldest of whom was Sir Thornley Stoker, 1st Bt.His siblings were: Sir (William) Thornley Stoker, born in 1845; Mathilda, born 1846; Thomas, born 1850; Richard, born 1852; Margaret, born 1854; and George, born 1855 Abraham and Charlotte were members of the Church of Ireland Parish of Clontarf and attended the parish church with their children, who were baptised there,http://www.eneclann.ie/wp-content/uploads/2012/04/Stoker-family-tree.pdf and Abraham was a senior civil servant.\n\nStoker was bedridden with an unknown illness until he started school at the age of seven, when he made a complete recovery. Of this time, Stoker wrote, \"I was naturally thoughtful, and the leisure of long illness gave opportunity for many thoughts which were fruitful according to their kind in later years.\" He was educated in a private school run by the Rev. William Woods.Obituary, Irish Times, 23 April 1912\n\nAfter his recovery, he grew up without further serious illnesses, even excelling as an athlete (he was named University Athlete, participating in multiple sports) at Trinity College, Dublin, which he attended from 1864 to 1870.  He graduated with a BA in 1870, and purchased his MA in 1875. Though he later in life recalled graduating \"with honours in mathematics,\" this appears to have been a mistake.[https://www.tcd.ie/trinitywriters/writers/bram-stoker/ Bram Stoker (1847-1912)] Trinity College Dublin Writers by Jarlath Killeen He was auditor of the College Historical Society (the Hist) and president of the University Philosophical Society, where his first paper was on Sensationalism in Fiction and Society.\n\nEarly career\n\nStoker became interested in the theatre while a student through his friend Dr. Maunsell. He became the theatre critic for the Dublin Evening Mail, which was co-owned by Sheridan Le Fanu, an author of Gothic tales. Theatre critics were held in low esteem, but he attracted notice by the quality of his reviews. In December 1876, he gave a favourable review of Henry Irving's Hamlet at the Theatre Royal in Dublin. Irving invited Stoker for dinner at the Shelbourne Hotel where he was staying, and they became friends. Stoker also wrote stories, and \"The Crystal Cup\" was published by the London Society in 1872, followed by \"[http://bramstoker.org/pdf/stories/04other/destinyts.pdf The Chain of Destiny]\" in four parts in The Shamrock. In 1876 while a civil servant in Dublin, Stoker wrote the non-fiction book The Duties of Clerks of Petty Sessions in Ireland (published 1879) which remained a standard work. Furthermore, he possessed an interest in art, and was a founder of the Dublin Sketching Club in 1879.\n\nLyceum Theatre\n\nIn 1878 Stoker married Florence Balcombe, daughter of Lieutenant-Colonel James Balcombe of 1 Marino Crescent.  She was a celebrated beauty whose former suitor was Oscar Wilde.Irish Times, 8 March 1882, page 5 Stoker had known Wilde from his student days, having proposed him for membership of the university’s Philosophical Society while he was president. Wilde was upset at Florence's decision, but Stoker later resumed the acquaintanceship, and after Wilde's fall visited him on the Continent.\n\nThe Stokers moved to London, where Stoker became acting manager and then business manager of Irving's Lyceum Theatre, London, a post he held for 27 years. On 31 December 1879, Bram and Florence's only child was born, a son whom they christened Irving Noel Thornley Stoker. The collaboration with Henry Irving was important for Stoker and through him he became involved in London's high society, where he met James Abbott McNeill Whistler and Sir Arthur Conan Doyle (to whom he was distantly related). Working for Irving, the most famous actor of his time, and managing one of the most successful theatres in London made Stoker a notable if busy man. He was dedicated to Irving and his memoirs show he idolised him. In London Stoker also met Hall Caine, who became one of his closest friends – he dedicated Dracula to him.\n\nIn the course of Irving's tours, Stoker travelled the world, although he never visited Eastern Europe, a setting for his most famous novel. Stoker enjoyed the United States, where Irving was popular. With Irving he was invited twice to the White House, and knew William McKinley and Theodore Roosevelt. Stoker set two of his novels there, using Americans as characters, the most notable being Quincey Morris. He also met one of his literary idols, Walt Whitman.\n\nWritings\n\nStoker visited the English coastal town of Whitby in 1890, and that visit is said to be part of the inspiration for Dracula. He began writing novels while working as manager for Henry Irving and secretary and director of London's Lyceum Theatre, beginning with The Snake's Pass in 1890 and Dracula in 1897. During this period, Stoker was part of the literary staff of The Daily Telegraph in London, and he wrote other fiction, including the horror novels The Lady of the Shroud (1909) and The Lair of the White Worm (1911).  He published his Personal Reminiscences of Henry Irving in 1906, after Irving's death, which proved successful, and managed productions at the Prince of Wales Theatre.\n\nBefore writing Dracula, Stoker met Ármin Vámbéry, a Hungarian writer and traveller. Dracula likely emerged from Vámbéry's dark stories of the Carpathian mountains. Stoker then spent several years researching European folklore and mythological stories of vampires. \n\nThe 1972 book In Search of Dracula by Radu Florescu and Raymond McNally claimed that the Count in Stoker's novel was based on Vlad III Dracula.https://www.independent.co.uk/news/people/radu-florescu-dead-legacy-of-the-romanian-dracula-professor-remembered-9401744.html At most however, Stoker borrowed only the name and \"scraps of miscellaneous information\" about Romanian history, according to one expert, Elizabeth Miller; as well, and there are no comments about Vlad III in the author's working notes.https://books.google.com/books?idVomtVOkkPDwC&pg\nPA182&dqDracula+bram+stoker+vlad+the+impaler&hl\nen&saX&ved\n0ahUKEwiT2ouhjJbVAhVl1oMKHTtMChA4ChDoAQhGMAU#vonepage&q\nDracula%20bram%20stoker%20vlad%20the%20impaler&ffalse, p\n182https://books.google.com/books?idCMRfXDFrBuUC&printsec\nfrontcover&dqElizabeth+Miller+Bram+Stoker+Vlad+III&hl\nen&saX&ved\n0ahUKEwiBz5vInJbVAhWCy4MKHRUAAi4Q6AEIKDAA#vonepage&q\nBram%20Stoker%20Vlad%20III&ffalse, p\n112-113https://books.google.com/books?idv-3OCwAAQBAJ&pg\nPT73&lpgPT73&dq\nElizabeth+Miller+stoker%27s+working+notes+No+mention+of+Vlad&sourcebl&ots\nTanP_0VLG_&sigb1NeXqByWATpO6GCpKTwHwjfkUc&hl\nen&saX&ved\n0ahUKEwji8PHYppbVAhUn4oMKHToaBT8Q6AEITjAJ#vonepage&q\nElizabeth%20Miller%20stoker's%20working%20notes%20No%20mention%20of%20Vlad&f=false\n\nDracula is an epistolary novel, written as a collection of realistic but completely fictional diary entries, telegrams, letters, ship's logs, and newspaper clippings, all of which added a level of detailed realism to the story, a skill which Stoker had developed as a newspaper writer. At the time of its publication, Dracula was considered a \"straightforward horror novel\" based on imaginary creations of supernatural life. \"It gave form to a universal fantasy . . . and became a part of popular culture.\" \n\nStoker was a deeply private man, but his almost sexless marriage, intense adoration of Walt Whitman, Henry Irving and Hall Caine, and shared interests with Oscar Wilde, as well as the homoerotic aspects of Dracula have led to scholarly speculation that he was a repressed homosexual who used his fiction as an outlet for his sexual frustrations.Skal, David J Something in the Blood: The Untold Story of Bram Stoker, Liveright, 2016, p564; [https://thenewinquiry.com/coming-out-of-the-coffin/] \"Coming Out Of The Coffin\", The New Inquiry, 24 August 2012 In 1912, he demanded imprisonment of all homosexual authors in Britain: it has been suggested that this was due to self-loathing and to disguise his own vulnerability.[https://thenewinquiry.com/coming-out-of-the-coffin/] \"Coming Out Of The Coffin\", The New Inquiry, 24 August 2012 A friend of Wilde, Stoker commenced writing Dracula only weeks after his conviction, possibly fearful and inspired by the monstrous image and threat of otherness that the press coverage of the Wilde trials generated.[https://thenewinquiry.com/coming-out-of-the-coffin/] \"Coming Out Of The Coffin\", The New Inquiry, 24 August 2012Schaffer, Talia \"A Wilde Desire Took Me: The Homoerotic History of Dracula\", ELH, Vol. 61, No. 2 (Summer, 1994), pp. 381-425 \n\nAccording to the Encyclopedia of World Biography, Stoker's stories are today included in the categories of \"horror fiction\", \"romanticized Gothic\" stories, and \"melodrama.\"Encyclopedia of World Biography, Gale Research (1998) vol 8. pgs. 461–464 They are classified alongside other \"works of popular fiction\" such as Mary Shelley's Frankenstein, which also used the \"myth-making\" and story-telling method of having multiple narrators telling the same tale from different perspectives, according to historian Jules Zanger. \"'They can't all be lying,' thinks the reader.\"Zanger, Jules. Blood Read: The Vampire as Metaphor in Contemporary Culture ed. Joan Gordon. Univ. of Pennsylvania Press (1997), pgs. 17–24\n\nThe original 541-page typescript of Dracula was believed to have been lost until it was found in a barn in northwestern Pennsylvania in the early 1980s. It consisted of typed sheets with many emendations, plus handwritten on the title page was \"THE UN-DEAD.\" The author's name was shown at the bottom as Bram Stoker. Author Robert Latham remarked: \"the most famous horror novel ever published, its title changed at the last minute.\"Latham, Robert. Science Fiction & Fantasy Book Review Annual, Greenwood Publishing (1988) p. 67 The typescript was purchased by Microsoft co-founder Paul Allen.\n\nStoker's inspirations for the story, in addition to Whitby, may have included a visit to Slains Castle in Aberdeenshire, a visit to the crypts of St. Michan's Church in Dublin, and the novella Carmilla by Sheridan Le Fanu.\n\nStoker's original research notes for the novel are kept by the Rosenbach Museum and Library in Philadelphia. A facsimile edition of the notes was created by Elizabeth Miller and Robert Eighteen-Bisang in 1998.\n\nDeath\n\nAfter suffering a number of strokes, Stoker died at No. 26 St George's Square, London on 20 April 1912. Some biographers attribute the cause of death to tertiary syphilis, others to overwork. He was cremated, and his ashes were placed in a display urn at Golders Green Crematorium in north London. The ashes of Irving Noel Stoker, the author's son, were added to his father's urn following his death in 1961. The original plan had been to keep his parents' ashes together, but after Florence Stoker's death, her ashes were scattered at the Gardens of Rest.\n\nBeliefs and philosophy\n\nStoker was raised a Protestant in the Church of Ireland. He was a strong supporter of the Liberal Party and took a keen interest in Irish affairs. As a \"philosophical home ruler,\" he supported Home Rule for Ireland brought about by peaceful means. He remained an ardent monarchist who believed that Ireland should remain within the British Empire, an entity that he saw as a force for good. He was an admirer of Prime Minister William Ewart Gladstone, whom he knew personally, and supported his plans for Ireland.Murray, Paul. From the Shadow of Dracula: A Life of Bram Stoker. 2004.\n\nStoker believed in progress and took a keen interest in science and science-based medicine. Some Stoker novels represent early examples of science fiction, such as The Lady of the Shroud (1909). He had a writer's interest in the occult, notably mesmerism, but despised fraud and believed in the superiority of the scientific method over superstition. Stoker counted among his friends J. W. Brodie-Innis, a member of the Hermetic Order of the Golden Dawn, and hired member Pamela Colman Smith as an artist for the Lyceum Theatre, but no evidence suggests that Stoker ever joined the Order himself.\n\nPosthumous\n\nThe short story collection Dracula's Guest and Other Weird Stories was published in 1914 by Stoker's widow, Florence Stoker, who was also his literary executrix. The first film adaptation of Dracula was F. W. Murnau's Nosferatu, released in 1922, with Max Schreck starring as Count Orlok. Florence Stoker eventually sued the filmmakers, and was represented by the attorneys of the British Incorporated Society of Authors. Her chief legal complaint was that she had neither been asked for permission for the adaptation nor paid any royalty. The case dragged on for some years, with Mrs. Stoker demanding the destruction of the negative and all prints of the film. The suit was finally resolved in the widow's favour in July 1925. A single print of the film survived, however, and it has become well known. The first authorised film version of Dracula did not come about until almost a decade later when Universal Studios released Tod Browning's Dracula starring Bela Lugosi.\n\nDacre Stoker\n\nCanadian writer Dacre Stoker, a great-grandnephew of Bram Stoker, decided to write \"a sequel that bore the Stoker name\" to \"reestablish creative control over\" the original novel, with encouragement from screenwriter Ian Holt, because of the Stokers' frustrating history with Dracula's copyright. In 2009, Dracula: The Un-Dead was released, written by Dacre Stoker and Ian Holt. Both writers \"based [their work] on Bram Stoker's own handwritten notes for characters and plot threads excised from the original edition\" along with their own research for the sequel. This also marked Dacre Stoker's writing debut.Dracula: The Un-Dead by Dacre Stoker and Ian Holt[http://www.draculatheundead.com/stoker-book-overview.htm Dracula: The Undeads overview]\n\nIn Spring 2012, Dacre Stoker (in collaboration with Prof. Elizabeth Miller) presented the \"lost\" Dublin Journal written by Bram Stoker, which had been kept by his great-grandson Noel Dobbs. Stoker's diary entries shed a light on the issues that concerned him before his London years. A remark about a boy who caught flies in a bottle might be a clue for the later development of the Renfield character in Dracula.Stoker, Bram. Bram Stoker’s Lost Dublin Journal, ed. by Stoker, Dacre and Miller, Elizabeth. London: Biteback Press, 2012\n\nCommemorations\n\nOn 8 November 2012, Stoker was honoured with a Google Doodle on Google's homepage commemorating what would have been his 165th birthday.\n\nAn annual festival takes place in Dublin, the birthplace of Bram Stoker, in honour of his literary achievements. The 2014 Bram Stoker Festival encompassed literary, film, family, street, and outdoor events, and ran from 24–27 October in and around Dublin City. The festival is supported by the Bram Stoker Estate and funded by Dublin City Council and Fáilte Ireland.\n\nBibliography\n\nNovels\n\n* The Snake's Pass (1890)\n* Seven Golden Buttons (1891)\n* The Watter's Mou'  (1895)\n* The Shoulder of Shasta (1895)\n* Dracula (1897)\n* Miss Betty (1898)\n* The Mystery of the Sea (1902)\n* The Jewel of Seven Stars (1903)\n* The Man (a.k.a. The Gates of Life) (1905)\n* Lady Athlyne (1908)\n* The Lady of the Shroud (1909)\n* The Lair of the White Worm (a.k.a. The Garden of Evil) (1911)\n\nShort story collections\n\n* Under the Sunset (1881), comprising eight fairy tales for children.\n* Snowbound: The Record of a Theatrical Touring Party (1908)\n* Dracula's Guest and Other Weird Stories (1914)\n\nUncollected stories\n\nNon-fiction\n\n* The Duties of Clerks of Petty Sessions in Ireland (1879)\n* A Glimpse of America (1886)\n* Personal Reminiscences of Henry Irving (1906)\n* Famous Impostors (1910)\n* Great Ghost Stories (1998) (Compiled by Peter Glassman, Illustrated by Barry Moser)\n* Bram Stoker's Notes for Dracula: A Facsimile Edition (2008) Bram Stoker Annotated and Transcribed by Robert Eighteen-Bisang and Elizabeth Miller, Foreword by Michael Barsanti. Jefferson, NC & London: McFarland. \n\nArticles\n\n*[https://archive.org/stream/twentiethcentury63londuoft#page/734/mode/2up \"The Question of a National Theatre\"] The Nineteenth Century and After, Vol. LXIII, January/June 1908.\n*[https://archive.org/stream/worldswork01pagegoog#page/n188/mode/2up \"Mr. De Morgan's Habits of Work\"] The World's Work, Vol. XVI, May/October 1908.\n*[https://archive.org/stream/twentiethcentury64londuoft#page/478/mode/2up \"The Censorship of Fiction\"] The Nineteenth Century and After, Vol. LXIV, July/December 1908.\n*[https://archive.org/stream/twentiethcentury66londuoft#page/974/mode/2up \"The Censorship of Stage Plays\"] The Nineteenth Century and After, Vol. LXVI, July/December 1909.\n*[https://archive.org/stream/twentiethcentury69londuoft#page/902/mode/2up \"Irving and Stage Lightning\"] The Nineteenth Century and After, Vol. LXIX, January/June 1911.\n\nCritical works on Stoker\n\n*William Hughes, Beyond Dracula (Palgrave, 2000) http://muse.jhu.edu/login?uri=/journals/victorian_studies/v044/44.2glover.html\n*Belford, Barbara. Bram Stoker: A Biography of the Author of Dracula. London: Weidenfeld and Nicolson, 1996.\n*Senf, Carol. Science and Social Science in Bram Stoker's Fiction (Greenwood, 2002).\n*Senf, Carol. Dracula: Between Tradition and Modernism (Twayne, 1998).\n*Senf, Carol A. Bram Stoker (University of Wales Press, 2010).\n*Skal, David J. Something in the Blood: The Untold Story of Bram Stoker (Liveright, 2016)\n\nBibliographies\n\n*William Hughes [http://www.victoriansecrets.co.uk/victorian-fiction-research-guides/bram-stoker/ Bram Stoker – Victorian Fiction Research Guide]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bram Stoker" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3992" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Abraham \"Bram\" Stoker (8 November 1847 – 20 April 1912) was an Irish author, best known today for his 1897 Gothic novel Dracula. During his lifetime, he was better known as the personal assistant of actor Henry Irving and business manager of the Lyceum Theatre in London, which Irving owned.\n\nEarly life\n\nStoker was born on 8 November 1847 at 15 Marino Crescent, Clontarf, on the northside of Dublin, Ireland. His parents were Abraham Stoker (1799–1876) from Dublin and Charlotte Mathilda Blake Thornley (1818–1901), who was raised in County Sligo. Stoker was the third of seven children, the eldest of whom was Sir Thornley Stoker, 1st Bt.His siblings were: Sir (William) Thornley Stoker, born in 1845; Mathilda, born 1846; Thomas, born 1850; Richard, born 1852; Margaret, born 1854; and George, born 1855 Abraham and Charlotte were members of the Church of Ireland Parish of Clontarf and attended the parish church with their children, who were baptised there,http://www.eneclann.ie/wp-content/uploads/2012/04/Stoker-family-tree.pdf and Abraham was a senior civil servant.\n\nStoker was bedridden with an unknown illness until he started school at the age of seven, when he made a complete recovery. Of this time, Stoker wrote, \"I was naturally thoughtful, and the leisure of long illness gave opportunity for many thoughts which were fruitful according to their kind in later years.\" He was educated in a private school run by the Rev. William Woods.Obituary, Irish Times, 23 April 1912\n\nAfter his recovery, he grew up without further serious illnesses, even excelling as an athlete (he was named University Athlete, participating in multiple sports) at Trinity College, Dublin, which he attended from 1864 to 1870.  He graduated with a BA in 1870, and purchased his MA in 1875. Though he later in life recalled graduating \"with honours in mathematics,\" this appears to have been a mistake.[https://www.tcd.ie/trinitywriters/writers/bram-stoker/ Bram Stoker (1847-1912)] Trinity College Dublin Writers by Jarlath Killeen He was auditor of the College Historical Society (the Hist) and president of the University Philosophical Society, where his first paper was on Sensationalism in Fiction and Society.\n\nEarly career\n\nStoker became interested in the theatre while a student through his friend Dr. Maunsell. He became the theatre critic for the Dublin Evening Mail, which was co-owned by Sheridan Le Fanu, an author of Gothic tales. Theatre critics were held in low esteem, but he attracted notice by the quality of his reviews. In December 1876, he gave a favourable review of Henry Irving's Hamlet at the Theatre Royal in Dublin. Irving invited Stoker for dinner at the Shelbourne Hotel where he was staying, and they became friends. Stoker also wrote stories, and \"The Crystal Cup\" was published by the London Society in 1872, followed by \"[http://bramstoker.org/pdf/stories/04other/destinyts.pdf The Chain of Destiny]\" in four parts in The Shamrock. In 1876 while a civil servant in Dublin, Stoker wrote the non-fiction book The Duties of Clerks of Petty Sessions in Ireland (published 1879) which remained a standard work. Furthermore, he possessed an interest in art, and was a founder of the Dublin Sketching Club in 1879.\n\nLyceum Theatre\n\nIn 1878 Stoker married Florence Balcombe, daughter of Lieutenant-Colonel James Balcombe of 1 Marino Crescent.  She was a celebrated beauty whose former suitor was Oscar Wilde.Irish Times, 8 March 1882, page 5 Stoker had known Wilde from his student days, having proposed him for membership of the university’s Philosophical Society while he was president. Wilde was upset at Florence's decision, but Stoker later resumed the acquaintanceship, and after Wilde's fall visited him on the Continent.\n\nThe Stokers moved to London, where Stoker became acting manager and then business manager of Irving's Lyceum Theatre, London, a post he held for 27 years. On 31 December 1879, Bram and Florence's only child was born, a son whom they christened Irving Noel Thornley Stoker. The collaboration with Henry Irving was important for Stoker and through him he became involved in London's high society, where he met James Abbott McNeill Whistler and Sir Arthur Conan Doyle (to whom he was distantly related). Working for Irving, the most famous actor of his time, and managing one of the most successful theatres in London made Stoker a notable if busy man. He was dedicated to Irving and his memoirs show he idolised him. In London Stoker also met Hall Caine, who became one of his closest friends – he dedicated Dracula to him.\n\nIn the course of Irving's tours, Stoker travelled the world, although he never visited Eastern Europe, a setting for his most famous novel. Stoker enjoyed the United States, where Irving was popular. With Irving he was invited twice to the White House, and knew William McKinley and Theodore Roosevelt. Stoker set two of his novels there, using Americans as characters, the most notable being Quincey Morris. He also met one of his literary idols, Walt Whitman.\n\nWritings\n\nStoker visited the English coastal town of Whitby in 1890, and that visit is said to be part of the inspiration for Dracula. He began writing novels while working as manager for Henry Irving and secretary and director of London's Lyceum Theatre, beginning with The Snake's Pass in 1890 and Dracula in 1897. During this period, Stoker was part of the literary staff of The Daily Telegraph in London, and he wrote other fiction, including the horror novels The Lady of the Shroud (1909) and The Lair of the White Worm (1911).  He published his Personal Reminiscences of Henry Irving in 1906, after Irving's death, which proved successful, and managed productions at the Prince of Wales Theatre.\n\nBefore writing Dracula, Stoker met Ármin Vámbéry, a Hungarian writer and traveller. Dracula likely emerged from Vámbéry's dark stories of the Carpathian mountains. Stoker then spent several years researching European folklore and mythological stories of vampires. \n\nThe 1972 book In Search of Dracula by Radu Florescu and Raymond McNally claimed that the Count in Stoker's novel was based on Vlad III Dracula.https://www.independent.co.uk/news/people/radu-florescu-dead-legacy-of-the-romanian-dracula-professor-remembered-9401744.html At most however, Stoker borrowed only the name and \"scraps of miscellaneous information\" about Romanian history, according to one expert, Elizabeth Miller; as well, and there are no comments about Vlad III in the author's working notes.https://books.google.com/books?idVomtVOkkPDwC&pg\nPA182&dqDracula+bram+stoker+vlad+the+impaler&hl\nen&saX&ved\n0ahUKEwiT2ouhjJbVAhVl1oMKHTtMChA4ChDoAQhGMAU#vonepage&q\nDracula%20bram%20stoker%20vlad%20the%20impaler&ffalse, p\n182https://books.google.com/books?idCMRfXDFrBuUC&printsec\nfrontcover&dqElizabeth+Miller+Bram+Stoker+Vlad+III&hl\nen&saX&ved\n0ahUKEwiBz5vInJbVAhWCy4MKHRUAAi4Q6AEIKDAA#vonepage&q\nBram%20Stoker%20Vlad%20III&ffalse, p\n112-113https://books.google.com/books?idv-3OCwAAQBAJ&pg\nPT73&lpgPT73&dq\nElizabeth+Miller+stoker%27s+working+notes+No+mention+of+Vlad&sourcebl&ots\nTanP_0VLG_&sigb1NeXqByWATpO6GCpKTwHwjfkUc&hl\nen&saX&ved\n0ahUKEwji8PHYppbVAhUn4oMKHToaBT8Q6AEITjAJ#vonepage&q\nElizabeth%20Miller%20stoker's%20working%20notes%20No%20mention%20of%20Vlad&f=false\n\nDracula is an epistolary novel, written as a collection of realistic but completely fictional diary entries, telegrams, letters, ship's logs, and newspaper clippings, all of which added a level of detailed realism to the story, a skill which Stoker had developed as a newspaper writer. At the time of its publication, Dracula was considered a \"straightforward horror novel\" based on imaginary creations of supernatural life. \"It gave form to a universal fantasy . . . and became a part of popular culture.\" \n\nStoker was a deeply private man, but his almost sexless marriage, intense adoration of Walt Whitman, Henry Irving and Hall Caine, and shared interests with Oscar Wilde, as well as the homoerotic aspects of Dracula have led to scholarly speculation that he was a repressed homosexual who used his fiction as an outlet for his sexual frustrations.Skal, David J Something in the Blood: The Untold Story of Bram Stoker, Liveright, 2016, p564; [https://thenewinquiry.com/coming-out-of-the-coffin/] \"Coming Out Of The Coffin\", The New Inquiry, 24 August 2012 In 1912, he demanded imprisonment of all homosexual authors in Britain: it has been suggested that this was due to self-loathing and to disguise his own vulnerability.[https://thenewinquiry.com/coming-out-of-the-coffin/] \"Coming Out Of The Coffin\", The New Inquiry, 24 August 2012 A friend of Wilde, Stoker commenced writing Dracula only weeks after his conviction, possibly fearful and inspired by the monstrous image and threat of otherness that the press coverage of the Wilde trials generated.[https://thenewinquiry.com/coming-out-of-the-coffin/] \"Coming Out Of The Coffin\", The New Inquiry, 24 August 2012Schaffer, Talia \"A Wilde Desire Took Me: The Homoerotic History of Dracula\", ELH, Vol. 61, No. 2 (Summer, 1994), pp. 381-425 \n\nAccording to the Encyclopedia of World Biography, Stoker's stories are today included in the categories of \"horror fiction\", \"romanticized Gothic\" stories, and \"melodrama.\"Encyclopedia of World Biography, Gale Research (1998) vol 8. pgs. 461–464 They are classified alongside other \"works of popular fiction\" such as Mary Shelley's Frankenstein, which also used the \"myth-making\" and story-telling method of having multiple narrators telling the same tale from different perspectives, according to historian Jules Zanger. \"'They can't all be lying,' thinks the reader.\"Zanger, Jules. Blood Read: The Vampire as Metaphor in Contemporary Culture ed. Joan Gordon. Univ. of Pennsylvania Press (1997), pgs. 17–24\n\nThe original 541-page typescript of Dracula was believed to have been lost until it was found in a barn in northwestern Pennsylvania in the early 1980s. It consisted of typed sheets with many emendations, plus handwritten on the title page was \"THE UN-DEAD.\" The author's name was shown at the bottom as Bram Stoker. Author Robert Latham remarked: \"the most famous horror novel ever published, its title changed at the last minute.\"Latham, Robert. Science Fiction & Fantasy Book Review Annual, Greenwood Publishing (1988) p. 67 The typescript was purchased by Microsoft co-founder Paul Allen.\n\nStoker's inspirations for the story, in addition to Whitby, may have included a visit to Slains Castle in Aberdeenshire, a visit to the crypts of St. Michan's Church in Dublin, and the novella Carmilla by Sheridan Le Fanu.\n\nStoker's original research notes for the novel are kept by the Rosenbach Museum and Library in Philadelphia. A facsimile edition of the notes was created by Elizabeth Miller and Robert Eighteen-Bisang in 1998.\n\nDeath\n\nAfter suffering a number of strokes, Stoker died at No. 26 St George's Square, London on 20 April 1912. Some biographers attribute the cause of death to tertiary syphilis, others to overwork. He was cremated, and his ashes were placed in a display urn at Golders Green Crematorium in north London. The ashes of Irving Noel Stoker, the author's son, were added to his father's urn following his death in 1961. The original plan had been to keep his parents' ashes together, but after Florence Stoker's death, her ashes were scattered at the Gardens of Rest.\n\nBeliefs and philosophy\n\nStoker was raised a Protestant in the Church of Ireland. He was a strong supporter of the Liberal Party and took a keen interest in Irish affairs. As a \"philosophical home ruler,\" he supported Home Rule for Ireland brought about by peaceful means. He remained an ardent monarchist who believed that Ireland should remain within the British Empire, an entity that he saw as a force for good. He was an admirer of Prime Minister William Ewart Gladstone, whom he knew personally, and supported his plans for Ireland.Murray, Paul. From the Shadow of Dracula: A Life of Bram Stoker. 2004.\n\nStoker believed in progress and took a keen interest in science and science-based medicine. Some Stoker novels represent early examples of science fiction, such as The Lady of the Shroud (1909). He had a writer's interest in the occult, notably mesmerism, but despised fraud and believed in the superiority of the scientific method over superstition. Stoker counted among his friends J. W. Brodie-Innis, a member of the Hermetic Order of the Golden Dawn, and hired member Pamela Colman Smith as an artist for the Lyceum Theatre, but no evidence suggests that Stoker ever joined the Order himself.\n\nPosthumous\n\nThe short story collection Dracula's Guest and Other Weird Stories was published in 1914 by Stoker's widow, Florence Stoker, who was also his literary executrix. The first film adaptation of Dracula was F. W. Murnau's Nosferatu, released in 1922, with Max Schreck starring as Count Orlok. Florence Stoker eventually sued the filmmakers, and was represented by the attorneys of the British Incorporated Society of Authors. Her chief legal complaint was that she had neither been asked for permission for the adaptation nor paid any royalty. The case dragged on for some years, with Mrs. Stoker demanding the destruction of the negative and all prints of the film. The suit was finally resolved in the widow's favour in July 1925. A single print of the film survived, however, and it has become well known. The first authorised film version of Dracula did not come about until almost a decade later when Universal Studios released Tod Browning's Dracula starring Bela Lugosi.\n\nDacre Stoker\n\nCanadian writer Dacre Stoker, a great-grandnephew of Bram Stoker, decided to write \"a sequel that bore the Stoker name\" to \"reestablish creative control over\" the original novel, with encouragement from screenwriter Ian Holt, because of the Stokers' frustrating history with Dracula's copyright. In 2009, Dracula: The Un-Dead was released, written by Dacre Stoker and Ian Holt. Both writers \"based [their work] on Bram Stoker's own handwritten notes for characters and plot threads excised from the original edition\" along with their own research for the sequel. This also marked Dacre Stoker's writing debut.Dracula: The Un-Dead by Dacre Stoker and Ian Holt[http://www.draculatheundead.com/stoker-book-overview.htm Dracula: The Undeads overview]\n\nIn Spring 2012, Dacre Stoker (in collaboration with Prof. Elizabeth Miller) presented the \"lost\" Dublin Journal written by Bram Stoker, which had been kept by his great-grandson Noel Dobbs. Stoker's diary entries shed a light on the issues that concerned him before his London years. A remark about a boy who caught flies in a bottle might be a clue for the later development of the Renfield character in Dracula.Stoker, Bram. Bram Stoker’s Lost Dublin Journal, ed. by Stoker, Dacre and Miller, Elizabeth. London: Biteback Press, 2012\n\nCommemorations\n\nOn 8 November 2012, Stoker was honoured with a Google Doodle on Google's homepage commemorating what would have been his 165th birthday.\n\nAn annual festival takes place in Dublin, the birthplace of Bram Stoker, in honour of his literary achievements. The 2014 Bram Stoker Festival encompassed literary, film, family, street, and outdoor events, and ran from 24–27 October in and around Dublin City. The festival is supported by the Bram Stoker Estate and funded by Dublin City Council and Fáilte Ireland.\n\nBibliography\n\nNovels\n\n* The Snake's Pass (1890)\n* Seven Golden Buttons (1891)\n* The Watter's Mou'  (1895)\n* The Shoulder of Shasta (1895)\n* Dracula (1897)\n* Miss Betty (1898)\n* The Mystery of the Sea (1902)\n* The Jewel of Seven Stars (1903)\n* The Man (a.k.a. The Gates of Life) (1905)\n* Lady Athlyne (1908)\n* The Lady of the Shroud (1909)\n* The Lair of the White Worm (a.k.a. The Garden of Evil) (1911)\n\nShort story collections\n\n* Under the Sunset (1881), comprising eight fairy tales for children.\n* Snowbound: The Record of a Theatrical Touring Party (1908)\n* Dracula's Guest and Other Weird Stories (1914)\n\nUncollected stories\n\nNon-fiction\n\n* The Duties of Clerks of Petty Sessions in Ireland (1879)\n* A Glimpse of America (1886)\n* Personal Reminiscences of Henry Irving (1906)\n* Famous Impostors (1910)\n* Great Ghost Stories (1998) (Compiled by Peter Glassman, Illustrated by Barry Moser)\n* Bram Stoker's Notes for Dracula: A Facsimile Edition (2008) Bram Stoker Annotated and Transcribed by Robert Eighteen-Bisang and Elizabeth Miller, Foreword by Michael Barsanti. Jefferson, NC & London: McFarland. \n\nArticles\n\n*[https://archive.org/stream/twentiethcentury63londuoft#page/734/mode/2up \"The Question of a National Theatre\"] The Nineteenth Century and After, Vol. LXIII, January/June 1908.\n*[https://archive.org/stream/worldswork01pagegoog#page/n188/mode/2up \"Mr. De Morgan's Habits of Work\"] The World's Work, Vol. XVI, May/October 1908.\n*[https://archive.org/stream/twentiethcentury64londuoft#page/478/mode/2up \"The Censorship of Fiction\"] The Nineteenth Century and After, Vol. LXIV, July/December 1908.\n*[https://archive.org/stream/twentiethcentury66londuoft#page/974/mode/2up \"The Censorship of Stage Plays\"] The Nineteenth Century and After, Vol. LXVI, July/December 1909.\n*[https://archive.org/stream/twentiethcentury69londuoft#page/902/mode/2up \"Irving and Stage Lightning\"] The Nineteenth Century and After, Vol. LXIX, January/June 1911.\n\nCritical works on Stoker\n\n*William Hughes, Beyond Dracula (Palgrave, 2000) http://muse.jhu.edu/login?uri=/journals/victorian_studies/v044/44.2glover.html\n*Belford, Barbara. Bram Stoker: A Biography of the Author of Dracula. London: Weidenfeld and Nicolson, 1996.\n*Senf, Carol. Science and Social Science in Bram Stoker's Fiction (Greenwood, 2002).\n*Senf, Carol. Dracula: Between Tradition and Modernism (Twayne, 1998).\n*Senf, Carol A. Bram Stoker (University of Wales Press, 2010).\n*Skal, David J. Something in the Blood: The Untold Story of Bram Stoker (Liveright, 2016)\n\nBibliographies\n\n*William Hughes [http://www.victoriansecrets.co.uk/victorian-fiction-research-guides/bram-stoker/ Bram Stoker – Victorian Fiction Research Guide]. Bram Stoker. http://en.wikipedia.org/?curid=3992."
  }
}
