{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4493",
  "eid" : "ce693310-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778426049,
  "textBody" : "Branches of biology\n\nBranch of biology – subdiscipline of biology, also referred to as a biological science. Note that biology and all of its branches are also life sciences.\n\n* Anatomy – study of form in animals, plants and other organisms, or specifically in humans.\n* Astrobiology – study of evolution, distribution, and future of life in the universe. Also known as exobiology, exopaleontology, and bioastronomy.\n* Bioengineering – study of biology through the means of engineering with an emphasis on applied knowledge and especially related to biotechnology.\n* Bioinformatics use of information technology for the study, collection, and storage of genomic and other biological data.\n* Biomechanics – the study of the mechanics of living beings.\n* Biochemistry – study of the chemical reactions required for life to exist and function, usually a focus on the cellular level.\n* Biogeography – study of the distribution of species spatially and temporally.\n* Biophysics – study of biological processes through the methods traditionally used in the physical sciences.\n* Biotechnology – new and sometimes controversial branch of biology that studies the manipulation of living matter, including genetic modification and synthetic biology.\n** Synthetic biology – research integrating biology and engineering; construction of biological functions not found in nature.\n* Botany – study of plants.\n** Phycology – scientific study of algae.\n** Plant physiology – subdiscipline of botany concerned with the functioning, or physiology, of plants.\n* Cell biology – study of the cell as a complete unit, and the molecular and chemical interactions that occur within a living cell.\n* Cognitive biology – study of cognition.\n* Comparative anatomy –  the study of evolution of species through similarities and differences in their anatomy.\n* Chronobiology – field of biology that examines periodic (cyclic) phenomena in living organisms and their adaptation to solar- and lunar-related rhythms.\n* Cryobiology – study of the effects of lower than normally preferred temperatures on living beings.\n* Developmental biology – study of the processes through which an organism forms, from zygote to full structure\n** Embryology – study of the development of embryo (from fecundation to birth).\n** Gerontology – study of aging processes.\n* Ecology – study of the interactions of living organisms with one another and with the non-living elements of their environment.\n* Epidemiology – major component of public health research, studying factors affecting the health of populations.\n* Evolutionary biology – study of the origin and descent of species over time.\n** Evolutionary developmental biology – field of biology that compares the developmental processes of different organisms to determine the ancestral relationship between them, and to discover how developmental processes evolved.\n** Paleobiology – discipline which combines the methods and findings of the natural science biology with the methods and findings of the earth science paleontology.\n*** Paleontology – study of fossils and sometimes geographic evidence of prehistoric life.\n* Genetics – study of genes and heredity.\n* Marine biology – study of ocean ecosystems, plants, animals, and other living beings.\n* Mathematical and theoretical biology – theoretical biology focuses more on the development of theoretical principles for biology while mathematical biology focuses on the use of mathematical tools to study biological systems, even though the two terms are sometimes interchanged.\n* Microbiology – study of microscopic organisms (microorganisms) and their interactions with other living things.\n** Bacteriology – study of bacteria\n** Mycology – study of fungi\n** Virology – study of viruses\n* Molecular biology – study of biology and biological functions at the molecular level, with some cross over from biochemistry.\n* Neuroscience – study of the nervous system, including anatomy, physiology and emergent proprieties.\n* Oncology – study of cancer processes, including virus or mutation, oncogenesis, angiogenesis and tissues remoldings.\n* Photobiology – scientific study of the interactions of light (technically, non-ionizing radiation) and living organisms. The field includes the study of photosynthesis, photomorphogenesis, visual processing, circadian rhythms, bioluminescence, and ultraviolet radiation effects.\n* Physiology – study of the internal workings of organisms.\n* Population biology – study of groups of conspecific organisms.\n* Parasitology – study of parasites and parasitism.\n* Psychobiology – study of the biological bases of psychology.\n* Radiobiology – study of the action of ionizing radiation on living things.\n* Sociobiology – study of the biological bases of sociology.\n* Structural biology – a branch of molecular biology, biochemistry, and biophysics concerned with the molecular structure of biological macromolecules.\n* Systems biology – computational modeling of biological systems.\n* Theoretical Biology – the mathematical modeling of biological phenomena.\n* Zoology| – study of animals, including classification, physiology, development, and behavior. Subbranches include:\n** Arthropodology – biological discipline concerned with the study of arthropods, a phylum of animals that include the insects, arachnids, crustaceans and others that are characterized by the possession of jointed limbs.\n*** Acarology – study of the taxon of arachnids that contains mites and ticks.\n*** Arachnology – scientific study of spiders and related animals such as scorpions, pseudoscorpions, harvestmen, collectively called arachnids.\n*** Entomology – study of insects.\n**** Coleopterology – study of beetles.\n**** Lepidopterology – study of a large order of insects that includes moths and butterflies (called lepidopterans).\n**** Myrmecology – scientific study of ants.\n*** Carcinology – study of crustaceans.\n*** Myriapodology – study of centipedes, millipedes, and other myriapods.\n** Ethology| – scientific and objective study of animal behaviour, usually with a focus on behaviour under natural conditions.\n** Helminthology – study of worms, especially parasitic worms.\n** Herpetology – study of amphibians (including frogs, toads, salamanders, newts, and gymnophiona) and reptiles (including snakes, lizards, amphisbaenids, turtles, terrapins, tortoises, crocodilians, and the tuataras).\n*** Batrachology – subdiscipline of herpetology concerned with the study of amphibians alone.\n** Ichthyology – study of fishes. This includes bony fishes (Osteichthyes), cartilaginous fishes (Chondrichthyes), and jawless fishes (Agnatha).\n** Malacology – branch of invertebrate zoology which deals with the study of the Mollusca (mollusks or molluscs), the second-largest phylum of animals in terms of described species after the arthropods.\n***Teuthology – branch of Malacology which deals with the study of cephalopods.\n** Mammalogy – study of mammals, a class of vertebrates with characteristics such as homeothermic metabolism, fur, four-chambered hearts, and complex nervous systems. Mammalogy has also been known as \"mastology,\" \"theriology,\" and \"therology.\" There are about 4,200 different species of animals which are considered mammals.\n*** Cetology – branch of marine mammal science that studies the approximately eighty species of whales, dolphins, and porpoise in the scientific order Cetacea.\n*** Physical anthropology – studies the physical development of the human species.\n*** Primatology – scientific study of primates\n** Nematology – scientific discipline concerned with the study of nematodes, or roundworms.\n** Ornithology – scientific study of birds.\n\nHistory of biology\n\n*History of anatomy\n*History of biochemistry\n*History of biotechnology\n*History of ecology\n*History of genetics\n*History of evolutionary thought:\n**The eclipse of Darwinism – Catastrophism – Lamarckism – Orthogenesis – Mutationism – Structuralism – Vitalism\n**Modern (evolutionary) synthesis\n**History of molecular evolution\n*History of medicine\n*History of model organisms\n*History of molecular biology\n*Natural history\n*History of plant systematics\n\nEcology\n\nOutline of ecology\n*Ecology:\n**Autecology: autotroph – heterotroph – acclimatization – endotherm – ectotherm – hibernation – homeostasis – behavior – circadian rhythm\n**Population ecology: population – competition – mating – biological dispersal – endemism – niche – growth curve (biology) – carrying capacity\n**Community ecology: community – keystone species – mimicry – symbiosis – pollination – mutualism – commensalism – parasitism – predation – invasive species – environmental heterogeneity – edge effect\n**Ecosystems: biodiversity – biome – habitat – plankton – thermocline – carbon cycle – water cycle – nitrogen cycle – food web – trophic level – saprobe – decomposition\n\nEvolution\n\nOutline of evolution\n*Life: origin of life – hierarchy of life – Miller–Urey experiment\n*Evolutionary biology (evolution):\n**Microevolution: species – speciation – adaptation – selection – natural selection – directional selection – sexual selection – genetic drift – sexual reproduction – asexual reproduction – colony – allele frequency – neutral theory of molecular evolution – population genetics – Hardy-Weinberg principle\n**Macroevolution: adaptive radiation – convergent evolution – extinction – mass extinction – fossil – taphonomy – geologic time – plate tectonics – continental drift – vicariance – Gondwana – Pangaea – endosymbiosis\n**Systematics: taxon – taxonomy – scientific classification – phylogeny – evolutionary tree – cladistics – synapomorphy – homology – molecular clock\n\nOrganismal Biology\n\n(also known as Functional biology)\n\n*Nonliving organisms\n**Viruses : DNA viruses – RNA viruses – retroviruses\n*Groups of living organisms\n** Prokaryota\n*** Domains Bacteria and Archaea\n** Domain Eukaryotas:\n**** Kingdom Animalia\n***** Vertebrates —Molluscs – Annelids – Arthropods – Sponges – Jellyfish\n**** Kingdom Plantae\n**** Kingdom Fungi\n**** Kingdom Protista\n*Developmental biology : gamete – spermatid – ovum – zygote – embryo – cellular differentiation – morphogenesis —homeobox\n**Animal development: stem cell – blastula – gastrula – egg (biology) – fetus – placenta\n**Plant development: seed – cotyledon – meristem – apical meristem – vascular cambium – cork cambium\n\n*Morphology, anatomy and physiology:\n**Techniques: electrophysiology – electron microscopy\n**Tissues – Organs\n**Plant systems: root – shoot – stem – leaf – flower\n***vascular tissue – Casparian strip – turgor pressure – xylem – phloem – transpiration – wood\n***alternation of generations – gametophyte – antheridium – archegonium – sporophyte – spore – sporangium\n***tropism – taxis\n\n**Animal systems: skin cell\n***Skeletal system – bone – cartilage – joint – muscle – tendon – actin – myosin – reflex\n***Circulatory system – respiration – lung – heart – artery – vein – capillary – blood – blood cell\n***Digestive system – stomach – intestine – liver – nutrition – primary nutritional groups metabolism – kidney – excretion\n***Nervous system: limbic system – vestibular system – neuron – axon – dendrite – brain – eye – vision – audition – proprioception – olfaction – memory\n***nerve signaling: action potential – signal transduction – synapse – receptor\n***Endocrine system – hormone\n***Reproductive system – testes – ovary – pregnancy\n****Fish#Reproductive system\n****Mammalian reproductive system\n*****Human reproductive system\n*****Mammalian penis\n******Os penis\n******Penile spines\n*****Genitalia of bottlenose dolphins\n*****Genitalia of marsupials\n*****Equine reproductive system\n*****Even-toed ungulate#Genitourinary system\n******Bull#Reproductive system\n*****Carnivora#Reproductive system\n******Fossa (animal)#External genitalia\n******Female genitalia of spotted hyenas\n******Cat anatomy#Genitalia\n******Genitalia of dogs\n*******Canine penis\n********Bulbus glandis\n***Lymphatic system – lymph node\n***Immune system: antibody – host – vaccine – immune cell – AIDS – T cell – leucocyte\n*Medicine:\n**Diseases: Cancer — Diabetes – Heart disease\n**Drugs: antibiotic – barbiturate – SSRI\n**Techniques: MRI – Computed axial tomography – blood test\n\nCellular and molecular biology\n\nOutline of cell biology\n*Cell biology: the cell coined by Robert Hooke\n**Techniques: cell culture – microscope – SEM – TEM\n**Cell Components:\n*** Organelles: Cytoplasm – Vacuole – Peroxisome – Plastid\n**** Cell nucleus\n***** Nucleoplasm – Nucleolus – Chromatin – Chromosome\n**** Endomembrane system\n***** Nuclear envelope – Endoplasmic reticulum – Golgi apparatus – Vesicles – Lysosome\n**** Energy creators: Mitochondrion and Chloroplast\n***Biological membranes:\n**** Plasma membrane – Mitochondrial membrane – Chloroplast membrane\n***Other subcellular features: Cell wall – pseudopod – cytoskeleton – mitotic spindle – flagellum – cilium\n**Cell processes:\n*** Cell transport: Diffusion – Osmosis – isotonic – active transport – phagocytosis\n***Energy pathways: fermentation\n**** Cellular respiration\n***** Glycolysis – Pyruvate dehydrogenase complex – Citric acid cycle\n**** Photosynthesis\n***** Light-dependent reactions – Calvin cycle\n***Protein biosynthesis – ribosomes\n***Cellular reproduction: cytokinesis – centromere – meiosis\n***Nuclear reproduction: mitosis – interphase – prophase – metaphase – anaphase – telophase\n***programmed cell death – apoptosis – cell senescence\n\nOutline of biochemistry\n*Biochemistry:\n**Biomolecules:\n***Small: amino acids – Adenosine triphosphate (ATP) – fats – lipids – oil – phospholipid – prion – sugar – vitamins – neurotransmitter – wax\n***Medium-sized:\n****pigments: chlorophyll – carotenoid – xanthophyll – melanin\n***Biopolymers/macromolecules\n****proteins: primary structure – secondary structure – tertiary structure – conformation – native state – protein folding – enzyme – receptor – transmembrane receptor – ion channel – membrane transporter— collagen – silk\n****DNA – RNA\n****polysaccharide: cellulose – carbohydrate – chitin – glycogen – starch\n**Biochemical mechanisms: proteolysis – cooperativity\n**Techniques: electrophoresis – protein tag —affinity chromatography – x-ray diffraction – Proteomics – mass spectrometry\n*Molecular biology:\n**genetic structure: DNA – DNA replication – nucleosome – genetic code – codon – transcription factor – transcription – translation – RNA – histone – telomere\n**gene expression – heterochromatin – promoter – enhancer – operon\n**mutation – point mutation – crossover – recombination —plasmid – transposon\n**molecular genetics: DNA fingerprinting – genetic fingerprint – microsatellite – gene knockout— imprinting – RNA interference\n**Genomics: computational biology – bioinformatics\n**Molecular Techniques: gel electrophoresis – transformation – PCR – PCR mutagenesis – primer – chromosome walking – RFLP – restriction enzyme – sequencing – shotgun sequencing – cloning – culture – DNA microarray\n\nOutline of genetics\n*Genetics (classical genetics) :\n**heredity – Mendelian inheritance – gene – locus – trait – allele – polymorphism – homozygote – heterozygote – hybrid – hybridization – dihybrid cross – Punnett square\n**genotype–phenotype distinction – genotype – phenotype – dominant gene – recessive gene\n**genetic interactions – Mendel's law of segregation – genetic mosaic – maternal effect – penetrance – complementation – suppression – epistasis – genetic linkage\n**chromosomal effects: chromosome – haploid – diploid – polyploidy – dosage effect – inbreeding\n**Model organisms: Drosophila – Arabidopsis – Caenorhabditis elegans – mouse – Saccharomyces cerevisiae – Escherichia coli – Lambda phage – Xenopus – chicken – zebrafish – Ciona intestinalis – amphioxus\n**Techniques: genetic screen – DNA paternity testing – linkage map – genetic map\n\nBiologists\n\nLists \n\n* List of biologists\n**List of biochemists\n**List of ecologists\n**List of neuroscientists\n**List of physiologists\n**List of zoologists by author abbreviation\n**List of Nobel Prize winners in physiology or medicine",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Outline of biology" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4493" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Branches of biology\n\nBranch of biology – subdiscipline of biology, also referred to as a biological science. Note that biology and all of its branches are also life sciences.\n\n* Anatomy – study of form in animals, plants and other organisms, or specifically in humans.\n* Astrobiology – study of evolution, distribution, and future of life in the universe. Also known as exobiology, exopaleontology, and bioastronomy.\n* Bioengineering – study of biology through the means of engineering with an emphasis on applied knowledge and especially related to biotechnology.\n* Bioinformatics use of information technology for the study, collection, and storage of genomic and other biological data.\n* Biomechanics – the study of the mechanics of living beings.\n* Biochemistry – study of the chemical reactions required for life to exist and function, usually a focus on the cellular level.\n* Biogeography – study of the distribution of species spatially and temporally.\n* Biophysics – study of biological processes through the methods traditionally used in the physical sciences.\n* Biotechnology – new and sometimes controversial branch of biology that studies the manipulation of living matter, including genetic modification and synthetic biology.\n** Synthetic biology – research integrating biology and engineering; construction of biological functions not found in nature.\n* Botany – study of plants.\n** Phycology – scientific study of algae.\n** Plant physiology – subdiscipline of botany concerned with the functioning, or physiology, of plants.\n* Cell biology – study of the cell as a complete unit, and the molecular and chemical interactions that occur within a living cell.\n* Cognitive biology – study of cognition.\n* Comparative anatomy –  the study of evolution of species through similarities and differences in their anatomy.\n* Chronobiology – field of biology that examines periodic (cyclic) phenomena in living organisms and their adaptation to solar- and lunar-related rhythms.\n* Cryobiology – study of the effects of lower than normally preferred temperatures on living beings.\n* Developmental biology – study of the processes through which an organism forms, from zygote to full structure\n** Embryology – study of the development of embryo (from fecundation to birth).\n** Gerontology – study of aging processes.\n* Ecology – study of the interactions of living organisms with one another and with the non-living elements of their environment.\n* Epidemiology – major component of public health research, studying factors affecting the health of populations.\n* Evolutionary biology – study of the origin and descent of species over time.\n** Evolutionary developmental biology – field of biology that compares the developmental processes of different organisms to determine the ancestral relationship between them, and to discover how developmental processes evolved.\n** Paleobiology – discipline which combines the methods and findings of the natural science biology with the methods and findings of the earth science paleontology.\n*** Paleontology – study of fossils and sometimes geographic evidence of prehistoric life.\n* Genetics – study of genes and heredity.\n* Marine biology – study of ocean ecosystems, plants, animals, and other living beings.\n* Mathematical and theoretical biology – theoretical biology focuses more on the development of theoretical principles for biology while mathematical biology focuses on the use of mathematical tools to study biological systems, even though the two terms are sometimes interchanged.\n* Microbiology – study of microscopic organisms (microorganisms) and their interactions with other living things.\n** Bacteriology – study of bacteria\n** Mycology – study of fungi\n** Virology – study of viruses\n* Molecular biology – study of biology and biological functions at the molecular level, with some cross over from biochemistry.\n* Neuroscience – study of the nervous system, including anatomy, physiology and emergent proprieties.\n* Oncology – study of cancer processes, including virus or mutation, oncogenesis, angiogenesis and tissues remoldings.\n* Photobiology – scientific study of the interactions of light (technically, non-ionizing radiation) and living organisms. The field includes the study of photosynthesis, photomorphogenesis, visual processing, circadian rhythms, bioluminescence, and ultraviolet radiation effects.\n* Physiology – study of the internal workings of organisms.\n* Population biology – study of groups of conspecific organisms.\n* Parasitology – study of parasites and parasitism.\n* Psychobiology – study of the biological bases of psychology.\n* Radiobiology – study of the action of ionizing radiation on living things.\n* Sociobiology – study of the biological bases of sociology.\n* Structural biology – a branch of molecular biology, biochemistry, and biophysics concerned with the molecular structure of biological macromolecules.\n* Systems biology – computational modeling of biological systems.\n* Theoretical Biology – the mathematical modeling of biological phenomena.\n* Zoology| – study of animals, including classification, physiology, development, and behavior. Subbranches include:\n** Arthropodology – biological discipline concerned with the study of arthropods, a phylum of animals that include the insects, arachnids, crustaceans and others that are characterized by the possession of jointed limbs.\n*** Acarology – study of the taxon of arachnids that contains mites and ticks.\n*** Arachnology – scientific study of spiders and related animals such as scorpions, pseudoscorpions, harvestmen, collectively called arachnids.\n*** Entomology – study of insects.\n**** Coleopterology – study of beetles.\n**** Lepidopterology – study of a large order of insects that includes moths and butterflies (called lepidopterans).\n**** Myrmecology – scientific study of ants.\n*** Carcinology – study of crustaceans.\n*** Myriapodology – study of centipedes, millipedes, and other myriapods.\n** Ethology| – scientific and objective study of animal behaviour, usually with a focus on behaviour under natural conditions.\n** Helminthology – study of worms, especially parasitic worms.\n** Herpetology – study of amphibians (including frogs, toads, salamanders, newts, and gymnophiona) and reptiles (including snakes, lizards, amphisbaenids, turtles, terrapins, tortoises, crocodilians, and the tuataras).\n*** Batrachology – subdiscipline of herpetology concerned with the study of amphibians alone.\n** Ichthyology – study of fishes. This includes bony fishes (Osteichthyes), cartilaginous fishes (Chondrichthyes), and jawless fishes (Agnatha).\n** Malacology – branch of invertebrate zoology which deals with the study of the Mollusca (mollusks or molluscs), the second-largest phylum of animals in terms of described species after the arthropods.\n***Teuthology – branch of Malacology which deals with the study of cephalopods.\n** Mammalogy – study of mammals, a class of vertebrates with characteristics such as homeothermic metabolism, fur, four-chambered hearts, and complex nervous systems. Mammalogy has also been known as \"mastology,\" \"theriology,\" and \"therology.\" There are about 4,200 different species of animals which are considered mammals.\n*** Cetology – branch of marine mammal science that studies the approximately eighty species of whales, dolphins, and porpoise in the scientific order Cetacea.\n*** Physical anthropology – studies the physical development of the human species.\n*** Primatology – scientific study of primates\n** Nematology – scientific discipline concerned with the study of nematodes, or roundworms.\n** Ornithology – scientific study of birds.\n\nHistory of biology\n\n*History of anatomy\n*History of biochemistry\n*History of biotechnology\n*History of ecology\n*History of genetics\n*History of evolutionary thought:\n**The eclipse of Darwinism – Catastrophism – Lamarckism – Orthogenesis – Mutationism – Structuralism – Vitalism\n**Modern (evolutionary) synthesis\n**History of molecular evolution\n*History of medicine\n*History of model organisms\n*History of molecular biology\n*Natural history\n*History of plant systematics\n\nEcology\n\nOutline of ecology\n*Ecology:\n**Autecology: autotroph – heterotroph – acclimatization – endotherm – ectotherm – hibernation – homeostasis – behavior – circadian rhythm\n**Population ecology: population – competition – mating – biological dispersal – endemism – niche – growth curve (biology) – carrying capacity\n**Community ecology: community – keystone species – mimicry – symbiosis – pollination – mutualism – commensalism – parasitism – predation – invasive species – environmental heterogeneity – edge effect\n**Ecosystems: biodiversity – biome – habitat – plankton – thermocline – carbon cycle – water cycle – nitrogen cycle – food web – trophic level – saprobe – decomposition\n\nEvolution\n\nOutline of evolution\n*Life: origin of life – hierarchy of life – Miller–Urey experiment\n*Evolutionary biology (evolution):\n**Microevolution: species – speciation – adaptation – selection – natural selection – directional selection – sexual selection – genetic drift – sexual reproduction – asexual reproduction – colony – allele frequency – neutral theory of molecular evolution – population genetics – Hardy-Weinberg principle\n**Macroevolution: adaptive radiation – convergent evolution – extinction – mass extinction – fossil – taphonomy – geologic time – plate tectonics – continental drift – vicariance – Gondwana – Pangaea – endosymbiosis\n**Systematics: taxon – taxonomy – scientific classification – phylogeny – evolutionary tree – cladistics – synapomorphy – homology – molecular clock\n\nOrganismal Biology\n\n(also known as Functional biology)\n\n*Nonliving organisms\n**Viruses : DNA viruses – RNA viruses – retroviruses\n*Groups of living organisms\n** Prokaryota\n*** Domains Bacteria and Archaea\n** Domain Eukaryotas:\n**** Kingdom Animalia\n***** Vertebrates —Molluscs – Annelids – Arthropods – Sponges – Jellyfish\n**** Kingdom Plantae\n**** Kingdom Fungi\n**** Kingdom Protista\n*Developmental biology : gamete – spermatid – ovum – zygote – embryo – cellular differentiation – morphogenesis —homeobox\n**Animal development: stem cell – blastula – gastrula – egg (biology) – fetus – placenta\n**Plant development: seed – cotyledon – meristem – apical meristem – vascular cambium – cork cambium\n\n*Morphology, anatomy and physiology:\n**Techniques: electrophysiology – electron microscopy\n**Tissues – Organs\n**Plant systems: root – shoot – stem – leaf – flower\n***vascular tissue – Casparian strip – turgor pressure – xylem – phloem – transpiration – wood\n***alternation of generations – gametophyte – antheridium – archegonium – sporophyte – spore – sporangium\n***tropism – taxis\n\n**Animal systems: skin cell\n***Skeletal system – bone – cartilage – joint – muscle – tendon – actin – myosin – reflex\n***Circulatory system – respiration – lung – heart – artery – vein – capillary – blood – blood cell\n***Digestive system – stomach – intestine – liver – nutrition – primary nutritional groups metabolism – kidney – excretion\n***Nervous system: limbic system – vestibular system – neuron – axon – dendrite – brain – eye – vision – audition – proprioception – olfaction – memory\n***nerve signaling: action potential – signal transduction – synapse – receptor\n***Endocrine system – hormone\n***Reproductive system – testes – ovary – pregnancy\n****Fish#Reproductive system\n****Mammalian reproductive system\n*****Human reproductive system\n*****Mammalian penis\n******Os penis\n******Penile spines\n*****Genitalia of bottlenose dolphins\n*****Genitalia of marsupials\n*****Equine reproductive system\n*****Even-toed ungulate#Genitourinary system\n******Bull#Reproductive system\n*****Carnivora#Reproductive system\n******Fossa (animal)#External genitalia\n******Female genitalia of spotted hyenas\n******Cat anatomy#Genitalia\n******Genitalia of dogs\n*******Canine penis\n********Bulbus glandis\n***Lymphatic system – lymph node\n***Immune system: antibody – host – vaccine – immune cell – AIDS – T cell – leucocyte\n*Medicine:\n**Diseases: Cancer — Diabetes – Heart disease\n**Drugs: antibiotic – barbiturate – SSRI\n**Techniques: MRI – Computed axial tomography – blood test\n\nCellular and molecular biology\n\nOutline of cell biology\n*Cell biology: the cell coined by Robert Hooke\n**Techniques: cell culture – microscope – SEM – TEM\n**Cell Components:\n*** Organelles: Cytoplasm – Vacuole – Peroxisome – Plastid\n**** Cell nucleus\n***** Nucleoplasm – Nucleolus – Chromatin – Chromosome\n**** Endomembrane system\n***** Nuclear envelope – Endoplasmic reticulum – Golgi apparatus – Vesicles – Lysosome\n**** Energy creators: Mitochondrion and Chloroplast\n***Biological membranes:\n**** Plasma membrane – Mitochondrial membrane – Chloroplast membrane\n***Other subcellular features: Cell wall – pseudopod – cytoskeleton – mitotic spindle – flagellum – cilium\n**Cell processes:\n*** Cell transport: Diffusion – Osmosis – isotonic – active transport – phagocytosis\n***Energy pathways: fermentation\n**** Cellular respiration\n***** Glycolysis – Pyruvate dehydrogenase complex – Citric acid cycle\n**** Photosynthesis\n***** Light-dependent reactions – Calvin cycle\n***Protein biosynthesis – ribosomes\n***Cellular reproduction: cytokinesis – centromere – meiosis\n***Nuclear reproduction: mitosis – interphase – prophase – metaphase – anaphase – telophase\n***programmed cell death – apoptosis – cell senescence\n\nOutline of biochemistry\n*Biochemistry:\n**Biomolecules:\n***Small: amino acids – Adenosine triphosphate (ATP) – fats – lipids – oil – phospholipid – prion – sugar – vitamins – neurotransmitter – wax\n***Medium-sized:\n****pigments: chlorophyll – carotenoid – xanthophyll – melanin\n***Biopolymers/macromolecules\n****proteins: primary structure – secondary structure – tertiary structure – conformation – native state – protein folding – enzyme – receptor – transmembrane receptor – ion channel – membrane transporter— collagen – silk\n****DNA – RNA\n****polysaccharide: cellulose – carbohydrate – chitin – glycogen – starch\n**Biochemical mechanisms: proteolysis – cooperativity\n**Techniques: electrophoresis – protein tag —affinity chromatography – x-ray diffraction – Proteomics – mass spectrometry\n*Molecular biology:\n**genetic structure: DNA – DNA replication – nucleosome – genetic code – codon – transcription factor – transcription – translation – RNA – histone – telomere\n**gene expression – heterochromatin – promoter – enhancer – operon\n**mutation – point mutation – crossover – recombination —plasmid – transposon\n**molecular genetics: DNA fingerprinting – genetic fingerprint – microsatellite – gene knockout— imprinting – RNA interference\n**Genomics: computational biology – bioinformatics\n**Molecular Techniques: gel electrophoresis – transformation – PCR – PCR mutagenesis – primer – chromosome walking – RFLP – restriction enzyme – sequencing – shotgun sequencing – cloning – culture – DNA microarray\n\nOutline of genetics\n*Genetics (classical genetics) :\n**heredity – Mendelian inheritance – gene – locus – trait – allele – polymorphism – homozygote – heterozygote – hybrid – hybridization – dihybrid cross – Punnett square\n**genotype–phenotype distinction – genotype – phenotype – dominant gene – recessive gene\n**genetic interactions – Mendel's law of segregation – genetic mosaic – maternal effect – penetrance – complementation – suppression – epistasis – genetic linkage\n**chromosomal effects: chromosome – haploid – diploid – polyploidy – dosage effect – inbreeding\n**Model organisms: Drosophila – Arabidopsis – Caenorhabditis elegans – mouse – Saccharomyces cerevisiae – Escherichia coli – Lambda phage – Xenopus – chicken – zebrafish – Ciona intestinalis – amphioxus\n**Techniques: genetic screen – DNA paternity testing – linkage map – genetic map\n\nBiologists\n\nLists \n\n* List of biologists\n**List of biochemists\n**List of ecologists\n**List of neuroscientists\n**List of physiologists\n**List of zoologists by author abbreviation\n**List of Nobel Prize winners in physiology or medicine. Outline of biology. http://en.wikipedia.org/?curid=4493."
  }
}
