{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13509",
  "eid" : "0a463630-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778526483,
  "textBody" : "Howard Phillips Lovecraft (August 20, 1890 – March 15, 1937) was an American writer who achieved posthumous fame through his influential works of horror fiction. He was virtually unknown and published only in pulp magazines before he died in poverty, but he is now regarded as one of the most significant 20th-century authors in his genre.\n\nLovecraft was born in Providence, Rhode Island, where he spent most of his life. Among his most celebrated tales are \"The Rats in the Walls\", \"The Call of Cthulhu\", At the Mountains of Madness and The Shadow Out of Time, all canonical to the Cthulhu Mythos. Lovecraft was never able to support himself from earnings as author and editor. He saw commercial success increasingly elude him in this latter period, partly because he lacked the confidence and drive to promote himself. He subsisted in progressively strained circumstances in his last years; an inheritance was completely spent by the time he died, at age 46.\n\nBiography\n\nEarly life (1890–1908)\n\nLovecraft was born in his family home on August 20, 1890, in Providence, Rhode Island. He was the only child of Winfield Scott Lovecraft (1853–1898) and Sarah Susan (Susie) Phillips Lovecraft (1857–1921). Though his employment is hard to discern, Lovecraft's future wife, Sonia Greene, stated that Winfield was employed by Gorham Manufacturing Company as a traveling salesman. Susie's family was of substantial means at the time of their marriage; her father, Whipple Van Buren Phillips, being involved in many significant business ventures. In April 1893, after a psychotic episode in a Chicago hotel, Winfield was committed to Butler Hospital in Providence. Though it is not clear who reported Winfield's prior behavior to Butler, medical records indicate that he had been \"doing and saying strange things at times\" for a year before his commitment. Winfield spent five years in Butler before dying in 1898. His death certificate listed the cause of death as general paresis, a term synonymous with late-stage syphilis. Susie never exhibited symptoms of the disease, leading to questions regarding the intimacy of their relationship. In 1969 Sonia Greene ventured that Susie was a \"touch-me-not\" wife and that Winfield, being a traveling salesmen, \"took his sexual pleasures wherever he could find them\". How Greene came to this opinion is unknown, as she never met Lovecraft's parents, though Lovecraft himself termed his mother a \"touch-me-not\" in a 1937 letter noting that, after his early childhood, she avoided all physical contact with him. This is contrary to Susie's treatment of a young Lovecraft soon after his father's breakdown. According to the accounts of family friends Susie doted over the young Lovecraft to a fault, pampering him and never letting him out of her sight. Throughout his life Lovecraft maintained that his father fell into a paralytic state, due to insomnia and being overworked, and remained that way until his death. It is unknown if Lovecraft was simply kept ignorant of his father's illness or if his later remarks were intentionally misleading.\n\nAfter his father's hospitalization, Lovecraft resided in the family home with his mother, his maternal aunts Lillian and Annie, and his maternal grandparents Whipple and Robie. Lovecraft later recollected that after his father's illness his mother was \"permanently stricken with grief.\" Whipple became a father figure to Lovecraft in this time, Lovecraft noting that his grandfather became the \"centre of my entire universe.\" Whipple, who traveled often on business, maintained correspondence with the young Lovecraft by letter who, by the age of three, was already proficient at reading and writing. When home Whipple would share weird tales of his own invention and show Lovecraft objects of art he had acquired in his European travels. Lovecraft also credits Whipple with being instrumental in overcoming his fear of the dark when Whipple forced Lovecraft, at five years old, to walk through several darkened rooms in the family home. It was in this period that Lovecraft was introduced to some of his earliest literary influences such as The Rime of the Ancient Mariner illustrated by Doré, One Thousand and One Nights, a gift from his mother, Thomas Bulfinch's Age of Fable and Ovid's Metamorphoses.\n\nWhile there is no indication that Lovecraft was particularly close to his grandmother Robie, her death in 1896 had a profound effect. By his own account, it sent his family into \"a gloom from which it never fully recovered.\" His mother and aunts' wearing of black mourning dresses \"terrified\" him, and it is at this time that Lovecraft, approximately five and half years old, started having nightmares that would inform his later writing. Specifically, he began to have recurring nightmares of beings he termed \"night-gaunts\"; their appearance he credited to the influence of Doré's illustrations, which would \"whirl me through space at a sickening rate of speed, the while fretting & impelling me with their detestable tridents.\" Thirty years later night gaunts would appear in Lovecraft's writing.\n\nLovecraft's earliest known literary works began at age seven with poems restyling the Odyssey and other mythological stories. Lovecraft has said that as a child he was enamored with the Roman pantheon of gods, accepting them as genuine expressions of divinity and foregoing his Christian upbringing. He recalls, at five years old, being told Santa Claus didn't exist and retorting by asking why \"God is not equally a myth?\" At the age of eight he took a keen interest in the sciences, particularly astronomy and chemistry. He also examined the anatomy books available to him in the family library, learning the specifics of human reproduction that had yet to be explained to him, and found that it \"virtually killed my interest in the subject.\" In 1902, according to Lovecraft's own correspondence, astronomy became a guiding influence on his world view. He began producing the periodical Rhode Island Journal of Astronomy, of which 69 issues survive, using the hectograph printing method. Lovecraft went in and out of elementary school repeatedly, oftentimes with home tutors making up for those lost school years, missing time due to health concerns that are not entirely clear. The written recollections of his peers described him as both withdrawn yet openly welcoming to anyone who shared his current fascination with astronomy, inviting anyone to look through the telescope he prized.\n\nBy 1900 Whipple's various business concerns were suffering a downturn and slowly reducing his family's wealth. He was forced to let the family's hired servants go, leaving Lovecraft, Whipple and Susie, being the only unmarried sister, alone in the family home. In the spring of 1904 Whipple's largest business venture suffered a catastrophic failure. Within months he died due to a stroke at age 70. After Whipple's death Susie was unable to support the upkeep of the expansive family home on what remained of the Phillips' estate. Later that year she was forced to move herself and her son to a small duplex. Lovecraft has called this time one of the darkest of his life, remarking in a 1934 letter that he saw no point in living anymore. In fall of the same year he started high school. Much like his earlier school years, Lovecraft was at times removed from school for long periods for what he termed \"near breakdowns\". He did say, though, that while having some conflicts with teachers, he enjoyed high school, becoming close with a small circle of friends. Aside from a pause in 1904 he also resumed publishing the Rhode Island Journal of Astronomy as well as starting the Scientific Gazette, which dealt mostly with chemistry. It was also during this period that Lovecraft produced the first of the types of fiction he would later be known for, namely \"The Beast in the Cave\" and \"The Alchemist\".\n\nIt was in 1908, prior to his high school graduation, when Lovecraft suffered another health crisis of some sort, though this instance was seemingly more severe than any prior. The exact circumstances and causes remain unknown. The only direct records are Lovecraft's own later correspondence wherein he described it variously as a \"nervous collapse\" and \"a sort of breakdown\", in one letter blaming it on the stress of high school despite his enjoying it. In another letter concerning the events of 1908 he notes, \"I was and am prey to intense headaches, insomnia, and general nervous weakness which prevents my continuous application to any thing.\" Though Lovecraft maintained that he was to attend Brown University after high school, he never graduated and never attended school again. Whether Lovecraft suffered from a physical ailment, a mental one, or some combination thereof has never been determined. An account from a high school classmate described Lovecraft as exhibiting \"terrible tics\" and that at times \"he'd be sitting in his seat and he'd suddenly up and jump.\" Harry Brobst, who recorded the account and had a Ph.D. in psychology, claimed that chorea minor was the most likely cause of Lovecraft's childhood symptoms while noting that instances of chorea minor after adolescence are very rare. Lovecraft himself acknowledged in letters that he suffered from bouts of chorea as a child. Brobst further ventured that Lovecraft's 1908 breakdown was attributed to a \"hysteroid seizure\", a term that today usually denotes atypical depression. In another letter concerning the events of 1908, Lovecraft stated that he \"could hardly bear to see or speak to anyone, & liked to shut out the world by pulling down dark shades & using artificial light.\"\n\nEarliest recognition (1908–1914)\n\nNot much of Lovecraft and Susie's activities from late 1908 to 1913 are recorded. Lovecraft mentions a steady continuation of their financial decline highlighted by a failed business venture of his uncle that cost Susie a large portion of their dwindling wealth. Accounts differ on how reclusive Susie and Lovecraft were during this time. A friend of Susie, Clara Hess, recalled a visit during which Susie spoke continuously about Lovecraft being \"so hideous that he hid from everyone and did not like to walk upon the streets where people could gaze on him.\" Despite Hess' protest that this wasn't the case, Susie maintained this stance. In the same account though, Hess said she regularly saw Susie out and about riding streetcars.\n\nFor his part, Lovecraft said he found his mother to be \"a positive marvel of consideration.\" A next-door neighbor later pointed out that what others in the neighborhood often supposed were loud, nocturnal quarrels between mother and son, she recognized as being recitations of Shakespeare; an activity that seemed to delight mother and son. Susie had an adoration for French literature, having studied French in boarding school. Lovecraft, though he never matched his mother's admiration of French literature, admired her knowledge and devotion to it. Lovecraft recalls Susie also had a passion for painting landscapes of the surrounding countryside, though none of her work survives today. One of Lovecraft's later friends, C. M. Eddy Jr., became aware of Lovecraft due to his wife Muriel, whose mother-in-law attended a women's suffrage meeting where she met Susie.\n\nDuring this period Lovecraft revived his earlier scientific periodicals. He endeavored to commit himself to the study of organic chemistry, Susie buying the expensive glass chemistry assemblage he wanted. Lovecraft found his studies were hobbled by the mathematics involved, which he found boring and would cause headaches that would incapacitate him for a day. Lovecraft's first poem that wasn't self-published appeared in a local newspaper in 1912. Called \"Providence in 2000 A.D.\", the poem envisioned a future where proper people of English heritage were displaced by immigrants. Surviving unpublished poems from this period, most notoriously \"On the Creation of Niggers\", were also emblematic of the xenophobia and racism inherent in much of Lovecraft's later work.\n\nIn 1911 Lovecraft's letters to editors began appearing in pulp and weird fiction magazines, most notably Argosy. A 1913 letter critical of Fred Jackson, a prominent writer for Argosy, started Lovecraft down a path that would greatly affect his life. Lovecraft described Jackson's stories as \"trivial, effeminate, and, in places, coarse.\" Continuing, Lovecraft said that Jackson's characters exhibit the \"delicate passions and emotions proper to negroes and anthropoid apes.\" This sparked a nearly year-long feud in the letters section of Argosy between Lovecraft, along with his occasional supporters, and the majority of readers critical of his view of Jackson. Lovecraft's biggest critic was John Russell, who often replied in verse, and to whom Lovecraft felt compelled to reply to because he respected Russell's writing skills. The most immediate effect of the feud was the recognition garnered from Edward F. Daas, then head editor of the United Amateur Press Association. Daas invited Russell and Lovecraft to the organization and both accepted, Lovecraft in April 1914.\n\nRejuvenation and tragedy (1914–1921)\n\nLovecraft immersed himself in the world of amateur journalism for most of the following decade. During this period he was an advocate for amateurism versus commercialism. Lovecraft's definition of commercialism, though, was specific to writing for, what he considered, low-brow publications for pay. He contrasted this with his view of \"professional publication\", which he termed as writing for journals and publishers he considered respectable. He thought of amateur journalism as training and practice for a professional career. Lovecraft was appointed to chairman of the Department of Public Criticism of the UAPA in late 1914. He used this position to advocate for his, what many considered peculiar, insistence on the superiority of English language usage that most writers already considered archaic. Emblematic of the Anglophile opinions he maintained throughout his life, he openly criticized other UAPA contributors for their \"Americanisms\" and \"slang\". Often these criticisms were couched in xenophobic and racist arguments bemoaning the \"bastardization\" of the \"national language\" by immigrants. In mid-1915 Lovecraft was elected to the position of first vice-president of the UAPA. Two years later he was elected president and appointed other board members that mostly shared his view on the supremacy of classical English over modern American English. Another significant event of this time was the beginning of World War I. Lovecraft published multiple criticisms of the US government's, and the American public's reluctance to join the war to protect England, which he viewed as the America's homeland.\n\nIn 1916 Lovecraft published his early short story \"The Alchemist\" in the main UAPA journal, a departure from his usual verse. Due in no small part to the encouragement of W. Paul Cook, another UAPA member and future life-long friend, Lovecraft began writing and publishing more fiction. Soon to follow were \"The Tomb\" and \"Dagon\". \"The Tomb\", by Lovecraft's own admission, follows closely the style and construction of the writings of one of his largest influences, Edgar Allan Poe. \"Dagon\" though, is considered Lovecraft's first work that embraced the concepts and themes that his writing would later be known for. In 1918 Lovecraft's term as president of the UAPA elapsed, and he took his former post as chairman of the Department of Public Criticism. In 1919 Lovecraft published another short story, \"Beyond the Wall of Sleep\".\n\nIn 1917 came two first hand accounts suggesting that, despite his climb in the ranks of the UAPA, Lovecraft still lived a fairly hermetical life. One comes from Cook himself, the other Rheinhart Kleiner, a Brooklyn-based UAPA writer. Both recalled that during their visits Lovecraft's mother regularly checked in on Lovecraft. Kleiner mentioned that \"at every hour or so his mother appeared in the doorway with a glass of milk, and Lovecraft forthwith drank it.\" In the same account Kleiner described Susie as \"very cordial and even vivacious.\" Cook recounts an almost comical delay of his meeting with Lovecraft wherein Susie and Lillian wouldn't let Cook in because Lovecraft had been up all night writing and couldn't be disturbed. Eventually Lovecraft appeared at the door in his \"dressing gown and slippers.\" Lovecraft later attributed his mother and aunt's reticence to allow Cook in being due to his unkempt appearance and their general dislike of Lovecraft's involvement with amateur journalism.  Also in 1917, as Lovecraft related to Kleiner, was Lovecraft's aborted attempt to enlist in the army. Though he passed the physical exam, he told Kleiner that his mother \"has threatened to go to any lengths, legal or otherwise, if I do not reveal all the ills which unfit me for the army.\"\n\nIn the winter of 1918–1919, Susie, exhibiting symptoms of a \"nervous breakdown\" of some sort, went to live with her elder sister Lillian. It is unclear what Susie may have been suffering from. Clara Hess, interviewed decades later, recalled instances of Susie describing \"weird and fantastic creatures that rushed out from behind buildings and from corners at dark.\" In the same account Hess describes a time when they crossed paths in downtown Providence and Susie \"was excited and apparently did not know where she was.\" Whatever the causes, in March 1919 they resulted in Susie being committed to Butler Hospital, like her husband before her. Lovecraft's immediate reaction to Susie's commitment was visceral, writing to Kleiner that, \"existence seems of little value,\" and that he wished \"it might terminate.\" Speaking to Susie's doctors, a month after she entered Butler, Lovecraft came to the realization that she was never going to be released.\n\nThe nature of Susie's illness is impossible to ascertain. Her medical records were lost in a fire, and the only Lovecraft researcher to have seen them prior was Winfield Townley Scott. His account describes Susie weeping often and speaking regularly about both her family's financial collapse and her son, whom she described as \"a poet of the highest order.\" Her psychiatrist claimed she had Oedipus complex. The psychiatric views of the day, still beholden to archaic Victorian assumptions, make any contemporary diagnosis of Susie questionable. No matter their symptoms or situations, women were predominately diagnosed (as Susie was) with hysteria, a concept that women are inherently mentally frail due to having \"thinner blood\" as result of menstruation and having a uterus. Lovecraft visited Susie often, walking the large grounds with her, and sent her letters on a regular basis.\n\nLate 1919 saw Lovecraft become more outgoing. After a period of isolation, he began joining friends in trips to writer gatherings, the first being a talk in Boston presented by Lord Dunsany, whom Lovecraft recently discovered and idolized. In early 1920, at an amateur writer convention, he met Frank Belknap Long, who would end up being Lovecraft's most influential and closest confidant for the rest of his life. This period also proved to be the most prolific of Lovecraft's short-story career. The influence of Dunsany is readily apparent in his 1919 output, later be to coined Lovecraft's Dream Cycle, with stories like \"The White Ship\", \"The Doom that Came to Sarnath\", and \"The Statement of Randolph Carter\". In early 1920 followed \"Celephais\" and \"The Cats of Ulthar\". It was later in 1920 that Lovecraft began publishing the earliest stories that fit into the Cthulhu Mythos. The Cthulhu Mythos, a term coined by August Derleth, encompasses Lovecraft's stories that share a commonality in fictional locations and Lovecraft's invented pantheon of god-like beings known as The Great Old Ones. The poem \"Nyarlathotep\" and short story \"The Crawling Chaos\", in collaboration with Winifred Virginia Jackson, were written in late 1920. Following in early 1921 came \"The Nameless City\", the first story that falls definitively within the Cthulhu Mythos. In it is found one of Lovecraft's most enduring bits of writing, a couplet recited by his creation Abdul Alhazred, \"That is not dead which can eternal lie; And with strange aeons even death may die.\"\n\nOn May 24, 1921, Sarah Susan (Susie) Phillips Lovecraft died in Butler Hospital, due to complications from a gall bladder surgery five days earlier. Lovecraft's initial reaction, expressed in a letter nine days after Susie's death, was that of an \"extreme nervous shock\" that crippled him physically and emotionally, again remarking that he found no reason he should continue living. Despite Lovecraft's immediate reaction to his mother's death, he continued to attend amateur journalist conventions. It was at one such convention in July that Lovecraft met Sonia Greene.\n\nMarriage and New York\n\nLovecraft's aunts disapproved of this relationship with Sonia. Lovecraft and Greene married on March 3, 1924, and relocated to her Brooklyn apartment at 793 Flatbush Avenue; she thought he needed to get out of Providence in order to flourish and was willing to support him financially. Greene, who had been married before, later said Lovecraft had performed satisfactorily as a lover, though she had to take the initiative in all aspects of the relationship. She attributed Lovecraft's passive nature to a stultifying upbringing by his mother. Lovecraft's weight increased to 90 kg on his wife's home cooking.\n\nHe was enthralled by New York, and, in what was informally dubbed the Kalem Club, he acquired a group of encouraging intellectual and literary friends who urged him to submit stories to Weird Tales; editor Edwin Baird accepted many otherworldly 'Dream Cycle' Lovecraft stories for the ailing publication, though they were heavily criticized by a section of the readership. Established informally some years before Lovecraft arrived in New York, the core Kalem Club members were boys' adventure novelist Henry Everett McNeil; the lawyer and anarchist writer James Ferdinand Morton, Jr.; and the poet Reinhardt Kleiner.\n\nOn New Year's Day of 1925, Sonia moved to Cleveland for a job opportunity, and Lovecraft left Flatbush for a small first-floor apartment on 169 Clinton Street \"at the edge of Red Hook\"—a location which came to discomfort him greatly. Later that year the Kalem Club's four regular attendees were joined by Lovecraft along with his protégé Frank Belknap Long, bookseller George Willard Kirk, and Lovecraft's close friend Samuel Loveman. Loveman was Jewish, but was unaware of Lovecraft's nativist attitudes. Conversely, it has been suggested that Lovecraft, who disliked mention of sexual matters, was unaware that Loveman and some of his other friends were homosexual.The Dream World of H. P. Lovecraft: His Life, His Demons, His Universe (2010) – Donald Tyson \n\nFinancial difficulties\n\nNot long after the marriage, Greene lost her business and her assets disappeared in a bank failure; she also became ill. Lovecraft made efforts to support his wife through regular jobs, but his lack of previous work experience meant he lacked proven marketable skills. After a few unsuccessful spells as a low-level clerk, his job-seeking became desultory. The publisher of Weird Tales attempted to put the loss-making magazine on a business footing and offered the job of editor to Lovecraft, who declined, citing his reluctance to relocate to Chicago; \"think of the tragedy of such a move for an aged antiquarian,\" the 34-year-old writer declared. Baird was replaced with Farnsworth Wright, whose writing Lovecraft had criticized. Lovecraft's submissions were often rejected by Wright. (This may have been partially due to censorship guidelines imposed in the aftermath of a Weird Tales story that hinted at necrophilia, although after Lovecraft's death Wright accepted many of the stories he had originally rejected.)\n\nBrooklyn\n\nGreene, moving where the work was, relocated to Cincinnati, and then to Cleveland; her employment required constant travel. Added to the daunting reality of failure in a city with a large immigrant population, Lovecraft's single-room apartment at 169 Clinton Street in Brooklyn Heights, not far from the working-class waterfront neighborhood Red Hook, was burgled, leaving him with only the clothes he was wearing. In August 1925 he wrote \"The Horror at Red Hook\" and \"He\", in the latter of which the narrator says \"My coming to New York had been a mistake; for whereas I had looked for poignant wonder and inspiration …  I had found instead only a sense of horror and oppression which threatened to master, paralyze, and annihilate me\". It was at around this time he wrote the outline for \"The Call of Cthulhu\", with its theme of the insignificance of all humanity. In the bibliographical study H. P. Lovecraft: Against the World, Against Life, Michel Houellebecq suggested that the misfortunes fed Lovecraft's central motivation as a writer, which he said was racial resentment.. With a weekly allowance Greene sent, Lovecraft moved to a working-class area of Brooklyn Heights, where he subsisted in a tiny apartment. He had lost 40 lb of body weight by 1926, when he left for Providence.\n\nReturn to Providence\n\nBack in Providence, Lovecraft lived in a \"spacious brown Victorian wooden house\" at 10 Barnes Street until 1933. The same address is given as the home of Dr. Willett in Lovecraft's The Case of Charles Dexter Ward. The period beginning after his return to Providence—the last decade of his life—was Lovecraft's most prolific; in that time he produced short stories, as well as his longest work of fiction The Case of Charles Dexter Ward and At the Mountains of Madness. He frequently revised work for other authors and did a large amount of ghost-writing, including \"The Mound\", \"Winged Death\", and \"The Diary of Alonzo Typer\". Client Harry Houdini was laudatory, and attempted to help Lovecraft by introducing him to the head of a newspaper syndicate. Plans for a further project were ended by Houdini's death.An H.P. Lovecraft Encyclopedia, edited by S. T. Joshi, David E. Schultz, page 117\n\nAlthough he was able to combine his distinctive style (allusive and amorphous description by horrified though passive narrators) with the kind of stock content and action that the editor of Weird Tales wanted—Wright paid handsomely to snap up \"The Dunwich Horror\" which proved very popular with readers—Lovecraft increasingly produced work that brought him no remuneration. Affecting a calm indifference to the reception of his works, Lovecraft was in reality extremely sensitive to criticism and easily precipitated into withdrawal. He was known to give up trying to sell a story after it had been once rejected. Sometimes, as with The Shadow Over Innsmouth (which included a rousing chase that supplied action) he wrote a story that might have been commercially viable, but did not try to sell it. Lovecraft even ignored interested publishers. He failed to reply when one inquired about any novel Lovecraft might have ready: although he had completed such a work, The Case of Charles Dexter Ward, it was never typed up.\n\nA few years after Lovecraft had moved to Providence, he and his wife Sonia Greene, having been living separately for so long, agreed to an amicable divorce. Greene moved to California in 1933 and remarried in 1936, unaware that Lovecraft, despite his assurances to the contrary, had never officially signed the final decree.S. T. Joshi, H.P. Lovecraft: A Life, p.455\n\nLast years\n\nLovecraft was never able to provide even basic expenses by selling stories and doing paid literary work for others. He lived frugally, subsisting on an inheritance that was nearly depleted by the time he died. He sometimes went without food to be able to pay the cost of mailing letters.Ronan, Margaret, Forward to The Shadow Over Innsmouth and Other Stories of Horror, Scholastic Book Services, 1971 Eventually, he was forced to move to meager lodgings with his surviving aunt. He was also deeply affected by the suicide of his correspondent Robert E. Howard. In early 1937, he was diagnosed with cancer of the small intestine and suffered from malnutrition as a result. He lived in constant pain until his death on March 15, 1937 in Providence. In accordance with his lifelong scientific curiosity, he kept a diary of his illness until close to the moment of his death.\n\nLovecraft was listed along with his parents on the Phillips family monument (). In 1977, fans erected a headstone in Swan Point Cemetery on which they inscribed his name, the dates of his birth and death, and the phrase \"I AM PROVIDENCE\"—a line from one of his personal letters.\n\nGroups of enthusiasts annually observe the anniversaries of Lovecraft's death at Ladd Observatory and of his birth at his grave site. In July 2013, the Providence City Council designated \"H. P. Lovecraft Memorial Square\" and installed a commemorative sign at the intersection of Angell and Prospect streets, near the author's former residences.\n\nAppreciation\n\nWithin genre\n\nBy 1957 Floyd C. Gale of Galaxy Science Fiction said that \"like R. E. Howard, Lovecraft seemingly goes on forever; the two decades since their death are as nothing. In any event, they appear more prolific than ever. What with de Camp, Nyberg and Derleth avidly rooting out every scrap of their writings and expanding them into novels, there may never be an end to their posthumous careers\". According to Joyce Carol Oates, Lovecraft (and Edgar Allan Poe in the 19th century) has exerted \"an incalculable influence on succeeding generations of writers of horror fiction\". Horror, fantasy, and science fiction author Stephen King called Lovecraft \"the twentieth century's greatest practitioner of the classic horror tale.\"The Best of H. P. Lovecraft: Bloodcurdling Tales of Horror and the Macabre, Del Rey Books, 1982, front cover. King has made it clear in his semi-autobiographical non-fiction book Danse Macabre that Lovecraft was responsible for his own fascination with horror and the macabre and was the largest figure to influence his fiction writing.\n\nLiterary\n\nEarly efforts to revise an established literary view of Lovecraft as an author of 'pulp' were resisted by some eminent critics; in 1945 Edmund Wilson expressed the opinion that \"the only real horror in most of these fictions is the horror of bad taste and bad art\". But \"Mystery and Adventure\" columnist Will Cuppy of the New York Herald Tribune recommended to readers a volume of Lovecraft's stories, asserting that \"the literature of horror and macabre fantasy belongs with mystery in its broader sense.\", note no. 66 Gale said that \"Lovecraft at his best could build a mood of horror unsurpassed; at his worst, he was laughable\". In 1962 Colin Wilson, in his survey of anti-realist trends in fiction The Strength to Dream, cited Lovecraft as one of the pioneers of the \"assault on rationality\" and included him with M.R. James, H.G. Wells, Aldous Huxley, Tolkien and others as one of the builders of mythicised realities over against the failing project of literary realism. Subsequently Lovecraft began to acquire the status of a cult writer in the counterculture of the 1960s, and reprints of his work proliferated. \nIn 2005 the status of classic American writer conferred by a Library of America edition was accorded to Lovecraft with the publication of Tales, a collection of his weird fiction stories.LA Review of Books, April 6, 2013 [http://lareviewofbooks.org/review/lets-get-weird-on-graham-harmans-h-p-lovecraft Let's Get Weird]\n\nPhilosophical\n\nPhilosopher Graham Harman, seeing Lovecraft as having a unique—though implicit—anti-reductionalist ontology, writes: \"No other writer is so perplexed by the gap between objects and the power of language to describe them, or between objects and the qualities they possess.\"Weird Realism: Lovecraft and Philosophy (2013) Graham Harman\nHarman said of leading figures at the initial speculative realism conference (which included philosophers Quentin Meillassoux, Ray Brassier, and Iain Hamilton Grant) that, though they shared no philosophical heroes, all were enthusiastic readers of Lovecraft.ASK/TELL, October 23, 2011 [http://eeevee2.blogspot.co.uk/2011/10/interview-with-graham-harman.html Interview with Graham Harman] Speculative realists, Mark Fisher and other contemporary philosophers, took Lovecraft seriously, mainly because Lovecraft's weird reality as presented in his novels, had nothing to do with the Gothic's insistence in the supernatural, but presented another reality incomprehensible to the human mind, but nonetheless real. According to scholar S. T. Joshi: \"There is never an entity in Lovecraft that is not in some fashion material\".New Critical Essays on H.P. Lovecraft,(2013)Chapter nine\n\nThemes\n\nSeveral themes recur in Lovecraft's stories:\n\nForbidden knowledge\n\nForbidden, dark, esoterically veiled knowledge is a central theme in many of Lovecraft's works. Many of his characters are driven by curiosity or scientific endeavor, and in many of his stories the knowledge they uncover proves Promethean in nature, either filling the seeker with regret for what they have learned, destroying them psychologically, or completely destroying the person who holds the knowledge.\n\nSome critics argue that this theme is a reflection of Lovecraft's contempt of the world around him, causing him to search inwardly for knowledge and inspiration.\n\nNon-human influences on humanity\n\nThe beings of Lovecraft's mythos often have human servants; Cthulhu, for instance, is worshiped under various names by cults among both the Greenlandic Inuit and voodoo circles of Louisiana, and in many other parts of the world.\n\nThese worshippers served a useful narrative purpose for Lovecraft. Many beings of the Mythos were too powerful to be defeated by human opponents, and so horrific that direct knowledge of them meant insanity for the victim. When dealing with such beings, Lovecraft needed a way to provide exposition and build tension without bringing the story to a premature end. Human followers gave him a way to reveal information about their \"gods\" in a diluted form, and also made it possible for his protagonists to win paltry victories. Lovecraft, like his contemporaries, envisioned \"savages\" as closer to supernatural knowledge unknown to civilized man.\n\nInherited guilt\n\nAnother recurring theme in Lovecraft's stories is the idea that descendants in a bloodline can never escape the stain of crimes committed by their forebears, at least if the crimes are atrocious enough. Descendants may be very far removed, both in place and in time (and, indeed, in culpability), from the act itself, and yet, they may be haunted by the revenant past, e.g. \"The Rats in the Walls\", \"The Lurking Fear\", \"Arthur Jermyn\", \"The Alchemist\", The Shadow over Innsmouth, \"The Doom that Came to Sarnath\" and The Case of Charles Dexter Ward.\n\nFate\n\nOften in Lovecraft's works the protagonist is not in control of his own actions, or finds it impossible to change course. Many of his characters would be free from danger if they simply managed to run away; however, this possibility either never arises or is somehow curtailed by some outside force, such as in \"The Colour Out of Space\" and \"The Dreams in the Witch House\". Often his characters are subject to a compulsive influence from powerful malevolent or indifferent beings. As with the inevitability of one's ancestry, eventually even running away, or death itself, provides no safety (\"The Thing on the Doorstep\", \"The Outsider\", The Case of Charles Dexter Ward, etc.). In some cases, this doom is manifest in the entirety of humanity, and no escape is possible (The Shadow Out of Time).\n\nCivilization under threat\n\nLovecraft was familiar with the work of the German conservative-revolutionary theorist Oswald Spengler, whose pessimistic thesis of the decadence of the modern West formed a crucial element in Lovecraft's overall anti-modern worldview. Spenglerian imagery of cyclical decay is present in particular in At the Mountains of Madness. S. T. Joshi, in H. P. Lovecraft: The Decline of the West, places Spengler at the center of his discussion of Lovecraft's political and philosophical ideas.S. T. Joshi, H. P. Lovecraft: Decline of the West, (Starmont Studies in Literary Criticism, No. 37), Borgo Pr, 1991, .\n\nLovecraft wrote to Clark Ashton Smith in 1927: \"It is my belief, and was so long before Spengler put his seal of scholarly proof on it, that our mechanical and industrial age is one of frank decadence\".China Miéville's introduction to \"At the Mountains of Madness\", Modern Library Classics, 2005 Lovecraft was also acquainted with the writings of another German philosopher of decadence: Friedrich Nietzsche.\n\nLovecraft frequently dealt with the idea of civilization struggling against dark, primitive barbarism. In some stories this struggle is at an individual level; many of his protagonists are cultured, highly educated men who are gradually corrupted by some obscure and feared influence.\n\nIn such stories, the curse is often a hereditary one, either because of interbreeding with non-humans (e.g., \"Facts Concerning the Late Arthur Jermyn and His Family\" (1920), The Shadow over Innsmouth (1931)) or through direct magical influence (The Case of Charles Dexter Ward). Physical and mental degradation often come together; this theme of 'tainted blood' may represent concerns relating to Lovecraft's own family history, particularly the death of his father due to what Lovecraft must have suspected to be a syphilitic disorder.\n\nIn other tales, an entire society is threatened by barbarism. Sometimes the barbarism comes as an external threat, with a civilized race destroyed in war (e.g., \"Polaris\"). Sometimes, an isolated pocket of humanity falls into decadence and atavism of its own accord (e.g., \"The Lurking Fear\"). But most often, such stories involve a civilized culture being gradually undermined by a malevolent underclass influenced by inhuman forces.\n\nIt is likely that the \"Roaring Twenties\" left Lovecraft disillusioned as he was still obscure and struggling with the basic necessities of daily life, combined with seeing non-Western European immigrants in New York City.\n\nRace, ethnicity, and class\n\nRace is the most controversial aspect of Lovecraft's legacy, expressed in many disparaging remarks against the various non-Anglo-Saxon races and cultures in his work. As he grew older, his original Anglo-Saxon racial worldview softened into a classism or elitism which regarded the superior race to include all those self-ennobled through high culture. From the start, Lovecraft did not hold all white people in uniform high regard, but rather esteemed the English people and those of English descent. He praised non-WASP groups such as Hispanics and Jews; however his private writings on groups such as Irish Catholics, German immigrants and African-Americans were consistently negative.H. P. Lovecraft, four decades of criticism by S. T. Joshi - Ohio University Press, 1980 H.P. Lovecraft: A Life by S. T. Joshi Necronomicon Press, 1996  In an early doggerel poem, the 1912 On the Creation of Niggers, Lovecraft describes black people not as human but \"beasts... in semi-human figure, filled it with vice\". In his early published essays, private letters and personal utterances, he argued for a strong color line to preserve race and culture.David Punter, (1996), The Literature of Terror: A History of Gothic Fictions from 1765 to the Present Day, Vol. I, 'Modern Gothic\", p. 40. He made these arguments by direct disparagement of various races in his journalism and letters, and perhaps allegorically in his fiction concerning non-human races. Some have interpreted his racial attitude as being more cultural than brutally biological: Lovecraft showed sympathy to those who adopted Western culture, even to the extent of marrying a Jewish woman whom he viewed as \"well assimilated\". While Lovecraft's racial attitude has been seen as directly influenced by the society of his day, especially the New England society he grew up in, his racism appeared stronger than the general popular viewpoint.\n\nRisks of a scientific era\n\nAt the turn of the 20th century, humanity's increased reliance upon science was both opening new worlds and solidifying understanding of ours. Lovecraft portrays this potential for a growing gap of man's understanding of the universe as a potential for horror, most notably in \"The Colour Out of Space\", where the inability of science to comprehend a contaminated meteorite leads to horror.\n\nIn a letter to James F. Morton in 1923, Lovecraft specifically pointed to Einstein's theory on relativity as throwing the world into chaos and making the cosmos a jest; in a letter to Woodburn Harris in 1929, he speculated that technological comforts risk the collapse of science. Indeed, at a time when men viewed science as limitless and powerful, Lovecraft imagined alternative potential and fearful outcomes. In \"The Call of Cthulhu\", Lovecraft's characters encounter architecture which is \"abnormal, non-Euclidean, and loathsomely redolent of spheres and dimensions apart from ours\".Lovecraft, \"The Call of Cthulhu\", p. 151. Non-Euclidean geometry is the mathematical language and background of Einstein's general theory of relativity, and Lovecraft references it repeatedly in exploring alien archaeology.\n\nReligion\n\nLovecraft's works are ruled by several distinct pantheons of deities (actually aliens worshiped as such by humans) who are either indifferent or actively hostile to humanity. Lovecraft's actual philosophy has been termed \"cosmic indifference\" and this is expressed in his fiction.Mosig, Yozan Dirk W. \"Lovecraft: The Dissonance Factor in imaginary Literature\" (1979). Several of Lovecraft's stories of the Old Ones (alien beings of the Cthulhu Mythos) propose alternate mythic human origins in contrast to those found in the creation stories of existing religions, expanding on a natural world view. For instance, in Lovecraft's At the Mountains of Madness it is proposed that humankind was actually created as a slave race by the Old Ones, and that life on Earth as we know it evolved from scientific experiments abandoned by the Elder Things. Protagonist characters in Lovecraft are usually educated men, citing scientific and rational evidence to support their non-faith. \"Herbert West – Reanimator\" reflects on the atheism common in academic circles. In \"The Silver Key\", the character Randolph Carter loses the ability to dream and seeks solace in religion, specifically Congregationalism, but does not find it and ultimately loses faith.\n\nLovecraft himself adopted the stance of atheism early in life. In 1932, he wrote in a letter to Robert E. Howard: All I say is that I think it is damned unlikely that anything like a central cosmic will, a spirit world, or an eternal survival of personality exist. They are the most preposterous and unjustified of all the guesses which can be made about the universe, and I am not enough of a hairsplitter to pretend that I don't regard them as arrant and negligible moonshine. In theory, I am an agnostic, but pending the appearance of radical evidence I must be classed, practically and provisionally, as an atheist.H. P. Lovecraft Letter to Robert E. Howard (August 16, 1932), in Selected Letters 1932–1934 (Sauk City, Wisconsin: Arkham House, 1976), p. 57.\"\n\nSuperstition\n\nIn 1926, famed magician and escapist Harry Houdini asked Lovecraft to ghostwrite a treatise exploring the topic of superstition. Houdini's unexpected death later that year halted the project, but The Cancer of Superstition was partially completed by Lovecraft along with collaborator C. M. Eddy, Jr. A previously unknown manuscript of the work was discovered in 2016 in a collection owned by a magic shop. The book states \"all superstitious beliefs are relics of a common 'prehistoric ignorance' in humans,\" and goes on to explore various superstitious beliefs in different cultures and times.\"Alison Flood, [https://www.theguardian.com/books/2016/mar/16/hp-lovecraft-harry-houdini-manuscript-cancer-superstition-memorabilia Lost HP Lovecraft work commissioned by Houdini escapes shackles of history], The Guardian 16 March 2016.\n\nInfluences on Lovecraft \n\nSome of Lovecraft's work was inspired by his own nightmares.FRANCH, J., & MACROBERT, A. (2015). Cosmic Dread: THE ASTRONOMY OF H. P. LOVECRAFT. Sky & Telescope, 129(2), 34-39. His interest started from his childhood days when his grandfather would tell him Gothic horror stories.\n\nLovecraft's most significant literary influence was Edgar Allan Poe. He had a British writing style due to his love of British literature. Like Lovecraft, Poe's work was out of step with the prevailing literary trends of his era. Both authors created distinctive, singular worlds of fantasy and employed archaisms in their writings. This influence can be found in such works as his novella The Shadow Over Innsmouth where Lovecraft references Poe's story The Imp of the Perverse by name in Chapter 3, and in his poem \"Nemesis\", where the \"... ghoul-guarded gateways of slumber\" suggest the \"... ghoul-haunted woodland of Weir\" found in Poe's \"Ulalume\". A direct quote from the poem and a reference to Poe's only novel The Narrative of Arthur Gordon Pym of Nantucket is alluded to in Lovecraft's magnum opus At the Mountains of Madness. Both authors shared many biographical similarities as well, such as the loss of their fathers at young ages and an early interest in poetry.\n\nHe was influenced by Arthur Machen's carefully constructed tales concerning the survival of ancient evil into modern times in an otherwise realistic world and his beliefs in hidden mysteries which lay behind reality. Lovecraft was also influenced by authors such as Oswald Spengler and Robert W. Chambers. Chambers was the writer of The King in Yellow, of whom Lovecraft wrote in a letter to Clark Ashton Smith: \"Chambers is like Rupert Hughes and a few other fallen Titans – equipped with the right brains and education but wholly out of the habit of using them\". Lovecraft's discovery of the stories of Lord Dunsany, with their pantheon of mighty gods existing in dreamlike outer realms, moved his writing in a new direction, resulting in a series of imitative fantasies in a \"Dreamlands\" setting.\n\nLovecraft also cited Algernon Blackwood as an influence, quoting The Centaur in the head paragraph of \"The Call of Cthulhu\". He declared Blackwood's story \"The Willows\" to be the single best piece of weird fiction ever written.\n\nAnother inspiration came from a completely different source: scientific progress in biology, astronomy, geology, and physics.Rottensteiner, F. (1992). Lovecraft as Philosopher. Science Fiction Studies, (1). 117. His study of science contributed to Lovecraft's view of the human race as insignificant, powerless, and doomed in a materialistic and mechanistic universe. Lovecraft was a keen amateur astronomer from his youth, often visiting the Ladd Observatory in Providence, and penning numerous astronomical articles for local newspapers. His astronomical telescope is now housed in the rooms of the August Derleth Society.\n\nLovecraft's materialist views led him to espouse his philosophical views through his fiction; these philosophical views came to be called cosmicism. Cosmicism took on a dark tone with his creation of what is today often called the Cthulhu Mythos, a pantheon of alien extra-dimensional deities and horrors which predate humanity, and which are hinted at in eons-old myths and legends. The term \"Cthulhu Mythos\" was coined by Lovecraft's correspondent and fellow author, August Derleth, after Lovecraft's death; Lovecraft jocularly referred to his artificial mythology as \"Yog-Sothothery\".\n\nLovecraft considered himself a man best suited to the early 18th century. His writing style, especially in his many letters, owes much to Augustan British writers of the Enlightenment like Joseph Addison and Jonathan Swift.\n\nAmong the books found in his library (as evidenced in Lovecraft's Library by S. T. Joshi) was The Seven Who Were Hanged by Leonid Andreyev and A Strange Manuscript Found in a Copper Cylinder by James De Mille.\n\nLovecraft's style has often been subject to criticism, yet scholars such as S. T. Joshi have shown that Lovecraft consciously utilized a variety of literary devices to form a unique style of his own – these include conscious archaism, prose-poetic techniques combined with essay-form techniques, alliteration, anaphora, crescendo, transferred epithet, metaphor, symbolism, and colloquialism.\n\nInfluence on culture \n\nLovecraft was relatively unknown during his own time. While his stories appeared in the pages of prominent pulp magazines such as Weird Tales (eliciting letters of outrage as often as letters of praise from regular readers), not many people knew his name. He did, however, correspond regularly with other contemporary writers such as Clark Ashton Smith and August Derleth,H.P. Lovecraft: Master of Weird Fiction. (2004). H.P. Lovecraft: Master of Weird Fiction, 8-40. who became good friends of his, even though they never met in person. This group of writers became known as the \"Lovecraft Circle\", since their writing freely borrowed elements of Lovecraft's stories, with his encouragement: the mysterious books with disturbing names, the pantheon of ancient alien entities such as Cthulhu and Azathoth, and eldritch places such as the New England town of Arkham and its Miskatonic University.\n\nAfter Lovecraft's death, the Lovecraft Circle carried on. August Derleth in particular added to and expanded on Lovecraft's vision, not without controversy. While Lovecraft considered his pantheon of alien gods a mere plot device, Derleth created an entire cosmology, complete with a war between the good Elder Gods and the evil Outer Gods, such as Cthulhu and his ilk. The forces of good were supposed to have won, locking Cthulhu and others up beneath the earth, in the ocean, and so forth. Derleth's Cthulhu Mythos stories went on to associate different gods with the traditional four elements of fire, air, earth and water — an artificial constraint which required rationalizations on Derleth's part as Lovecraft himself never envisioned such a scheme.\n\nLovecraft's fiction has been grouped into three categories by some critics. While Lovecraft did not refer to these categories himself, he did once write: \"There are my 'Poe' pieces and my 'Dunsany pieces' — but alas — where are any Lovecraft pieces?\"Letter to Elizabeth Toldridge, March 8, 1929, quoted in Lovecraft: A Look Behind the Cthulhu Mythos\n* Macabre stories ( 1905–1920);\n* Dream Cycle stories ( 1920–1927);\n* CthulhuLovecraft Mythos stories ( 1925–1935).\n\nLovecraft's writing, particularly the so-called Cthulhu Mythos, has influenced fiction authors including modern horror and fantasy writers. Stephen King, Ramsey Campbell, Bentley Little, Joe R. Lansdale, Alan Moore, Junji Ito, F. Paul Wilson, Brian Lumley, Caitlín R. Kiernan, William S. Burroughs, and Neil Gaiman, have cited Lovecraft as one of their primary influences. Beyond direct adaptation, Lovecraft and his stories have had a profound impact on popular culture. Some influence was direct, as he was a friend, inspiration, and correspondent to many of his contemporaries, such as August Derleth, Robert E. Howard, Robert Bloch and Fritz Leiber. Many later figures were influenced by Lovecraft's works, including author and artist Clive Barker, prolific horror writer Stephen King, Brian Keene has several novels based on the Old Gods, comics writers Alan Moore, Neil Gaiman and Mike Mignola, English author Colin Wilson, film directors John Carpenter, Stuart Gordon, Guillermo Del Toro and artist H. R. Giger.Giger, Hansruedi (2005): Necronomicon I & II. Erftstadt: Area. Japan has also been significantly inspired and terrified by Lovecraft's creations and thus even entered the manga and anime media. Chiaki J. Konaka is an acknowledged disciple and has participated in Cthulhu Mythos, expanding several Japanese versions. He is an anime scriptwriter who tends to add elements of cosmicism, and is credited for spreading the influence of Lovecraft among anime base. Along with Junji Ito, other influential manga artists have also been inspired by Lovecraft. Novelist and manga author, Hideyuki Kikuchi, incorporated a number of locations, beings and events from the works of Lovecraft into the manga Taimashin.\n\nArgentine writer Jorge Luis Borges wrote his short story \"There Are More Things\" in memory of Lovecraft. Contemporary French writer Michel Houellebecq wrote a literary biography of Lovecraft called H. P. Lovecraft: Against the World, Against Life. Prolific American writer Joyce Carol Oates wrote an introduction for a collection of Lovecraft stories. The Library of America published a volume of Lovecraft's work in 2005, a reversal of traditional judgment that \"has been nothing so far from the accepted canon as Lovecraft\". French philosophers Gilles Deleuze and Félix Guattari refer to Lovecraft in A Thousand Plateaus, calling the short story \"Through the Gates of the Silver Key\" one of his masterpieces.Deleuze, Gilles & Guattari, Félix (translated by Brian Massumi). A Thousand Plateaus. Minneapolis: University of Minnesota Press, 1993, p. 240, 539\n\nMusic\n\nLovecraft's fictional Mythos has influenced a number of musicians.\n* The psychedelic rock band H. P. Lovecraft (who shortened their name to Lovecraft and then Love Craft in the 1970s) released the albums H. P. Lovecraft and H. P. Lovecraft II in 1967 and 1968 respectively; their titles included \"The White Ship\" and \"At the Mountains of Madness\", both titled after Lovecraft stories. The founders of their record company, Bill Traut and George Badonsky, were fans of the author and gained August Derleth's permission to use Lovecraft's name for the band. \n* Metallica recorded a song inspired by \"The Call of Cthulhu\", an instrumental titled \"The Call of Ktulu\", and another song based on The Shadow Over Innsmouth titled \"The Thing That Should Not Be\", and another based on Frank Belknap Long's \"The Hounds of Tindalos\", titled \"All Nightmare Long\".\n* The Darkest of the Hillside Thickets' entire repertoire is Lovecraft-based.\n* German metal group Mekong Delta made an album called The Music of Erich Zann.\n* \"You're So Dark\", B-side from AM's \"One For The Road\", by Arctic Monkeys, mentions Lovecraft as one of the authors of the \"dark\" culture along with Edgar Allan Poe.\n* Heavy metal band Mercyful Fate produced \"The Mad Arab (Part 1)\" and \"Kutulu (The Mad Arab Part 2)\" on their albums Time and Into The Unknown based on Abdul Alhazred, the \"Mad Arab\" who created the Necronomicon in the Lovecraft universe.\n* \"Lovecraft in Brooklyn\" is the eighth track on the Mountain Goats' 2000 album Heretic Pride.\n* Deathrock band Rudimentary Peni's Cacophony (album) from 1988 was inspired by Lovecraft's work, as many of the song titles and lyrics are derived from his writing. Lead vocalist and guitarist Nick Blinko has cited his fascination with the Lovecraft mythos is what influenced him to create the album.\n*Cradle of Filth's song Mother of Abomibations begins with the chant, \"Ia Ia Chtulhu Ftagn\"\n\nGames\n\nLovecraft has also influenced gaming. Chaosium's role-playing game Call of Cthulhu (currently in its seventh major edition) has been in print for 30 years. The tabletop games Arkham Horror, Eldritch Horror, Mansions of Madness and Elder Sign include some themes derived from the Call of Cthulhu RPG. Three collectible card games are Mythos, Call of Cthulhu: The Living Card Game, and Arkham Horror: The Card Game.[https://www.fantasyflightgames.com/en/products/arkham-horror-the-card-game/ Arkham Horror: The Card Game | Fantasy Flight Games]. www.fantasyflightgames.com. With the rise in popularity of tabletop gaming, many other Lovecraft-themed games have been produced, for example (note that this is not an exhaustive list; it is a small selection from better-known designers and publishers):\n* Cthulhu Fluxx (Looney Labs) by Keith Baker with art by Derek Ring. This is a Lovecraft-themed version of the Fluxx series of games.\n* Cthulhu Gloom (Atlas Games) by Keith Baker with art by Todd Remick. This is a Lovecraft-themed version of the Gloom series of games.\n* Cthulhu Realms (Tasty Minstrel Games) by Darwin Kastle.\n* Cthulhu Wars (Green Eye Games/Petersen Games) by Sandy Petersen, original writer of the Call of Cthulhu RPG, and art by Richard Luong.\n* The Doom that Came to Atlantic City (Cryptozoic Entertainment) by Lee Moyer and Keith Baker, with miniatures by sculptor Paul Komoda.[https://www.cryptozoic.com/articles/cryptozoic-saves-doom-came-atlantic-city-board-game The Doom That Came to Atlantic City | Cryptozoic Entertainment]. Cryptozoic.com.\n* Kingsport Festival (Passport Game Studios) by Andrea Chiarvesio and Gianluca Santopietro. Based thematically on Lovecraft's The Festival and his fictional town of Kingsport from The Terrible Old Man.\n* Munchkin Cthulhu (Steve Jackson Games) by J. H. G. Hendricks and Steve Jackson. This is a Lovecraft-themed version of the Munchkin series of games.\n* The Stars are Right (Steve Jackson Games) by Klaus Westerhoff, with art by François Launet.\n* The Arkham Horror Files, a collection of games published by Fantasy Flight Games\nSeveral video games are based on or influenced heavily by Lovecraft such as Call of Cthulhu: Dark Corners of the Earth, Quest for Glory IV: Shadows of Darkness, Shadow of the Comet, The Lurking Horror, Prisoner of Ice, Shadowman, Alone in the Dark, Chzo Mythos, Eternal Darkness: Sanity's Requiem, Cthulhu Saves the World, Sherlock Holmes: The Awakened, Bloodborne, Darkest Dungeon, Dead Space, Splatterhouse, Darkness Within: In Pursuit of Loath Nolder, Darkness Within 2: The Dark Lineage, Blood, The Last Door, They Bleed Pixels, Sundered, the Megami Tensei franchise, Shadow Hearts, and Quake. The MMORPG The Secret World is heavily based on Lovecraftian lore. In The Elder Scrolls series, the Daedric Prince Hermaeus Mora and his realm of Oblivion, Apocrypha, are both heavily influenced by Lovecraft. The Old Gods featured in Blizzard Entertainment's Warcraft franchise are heavily influenced by Lovecraft's works. For example, the Old Gods C'Thun and Yogg-Saron have names that are very similar to Cthulhu and Yog-Sothoth, respectively.\nThe Evil Within 2 also has many references to Lovecraft's work, such as the names Dagon and Cthulhu.\n\nLovecraft as a character in fiction\n\nAside from his thinly veiled appearance in Robert Bloch's \"The Shambler from the Stars\", Lovecraft continues to be used as a character in supernatural fiction. An early version of Ray Bradbury's \"The Exiles\"Published in The Magazine of Fantasy & Science Fiction, Volume 1 No. 2 (Winter-Spring 1950), and later to become part of Bradbury's Martian Chronicles uses Lovecraft as a character, who makes a brief, 600-word appearance eating ice cream in front of a fire and complaining about how cold he is. Lovecraft and some associates are included at length in Robert Anton Wilson and Robert Shea's The Illuminatus! Trilogy (1975). Lovecraft makes an appearance as a rotting corpse in The Chinatown Death Cloud Peril by Paul Malmont, a novel with fictionalized versions of a number of period writers. John Shirley's story When Death Wakes Me To Myself offers a tale of a therapy patient slowly remembering a former incarnation when he was H.P. Lovecraft.\n\nOther notable works with Lovecraft as a character include Richard Lupoff's Lovecraft's Book (1985), Cast a Deadly Spell (1991), H.P. Lovecraft's: Necronomicon (1993), Witch Hunt (1994), Out of Mind: The Stories of H. P. Lovecraft (1998), Stargate SG-1: Roswell (2007), and Alan Moore's comic Providence (2015–17). Lovecraft also appears in the Season 6, Episode 21 episode \"Let it Bleed\" of the TV show Supernatural. A satirical version of Lovecraft named \"H. P. Hatecraft\" appeared as a recurring character on the Cartoon Network television series Scooby-Doo! Mystery Incorporated. A character based on Lovecraft also appears in the visual novel Shikkoku no Sharnoth: What a Beautiful Tomorrow, under the name \"Howard Phillips\" (or \"Mr. Howard\" to most of the main characters).. Another character based on Lovecraft appears in Afterlife with Archie.  He appears as a minor character in Brian Clevinger's comic book series Atomic Robo, as an acquaintance and fellow-scientist of Nikola Tesla, having been driven insane by his involvement in the Tunguska Event which exposed him to the hidden horrors of the wider universe. He is eventually killed when his body becomes host to an extradimensional being infecting the timestream.. Lovecraft is a central plot element, as well as a character in Paul La Farge's 2017 novel, The Night Ocean.\nIn the Japanese manga and anime Bungo Stray Dogs there is a character known as Howard Phillips Lovecraft who, like other characters in the series, is named after great literates. Even his power, “The Great Old Ones” pays homage to his classic book, The Call of Cthulhu, which grants him the ability of transforming himself into an octopus like monster resembling Cthulhu.\n\nThe short story \"The Invention of H. P. Lovecraft\" by S. K. Azoulay suggests that Lovecraft was a fictional creation invented by Jorge Luis Borges.[https://flapperhouse.com/2016/12/05/the-invention-of-h-p-lovecraft-fiction-by-shay-k-azoulay/ The Invention of H. P. Lovecraft] - by S. K. Azoulay. Flapperhouse Magazine, Fall 2016.\n\nEditions and collections of Lovecraft's work \n\nFor most of the 20th century, the definitive editions (specifically At the Mountains of Madness and Other Novels, Dagon and Other Macabre Tales, The Dunwich Horror and Others, and The Horror in the Museum and Other Revisions) of his prose fiction were published by Arkham House, a publisher originally started with the intent of publishing the work of Lovecraft, but which has since published a considerable amount of other literature as well. Penguin Classics has at present issued three volumes of Lovecraft's works: The Call of Cthulhu and Other Weird Stories, The Thing on the Doorstep and Other Weird Stories, and most recently The Dreams in the Witch House and Other Weird Stories. They collect the standard texts as edited by S. T. Joshi, most of which were available in the Arkham House editions, with the exception of the restored text of \"The Shadow Out of Time\" from The Dreams in the Witch House, which had been previously released by small-press publisher Hippocampus Press. In 2005 the prestigious Library of America canonized Lovecraft with a volume of his stories edited by Peter Straub, and Random House's Modern Library line have issued the \"definitive edition\" of Lovecraft's At the Mountains of Madness (also including \"Supernatural Horror in Literature\").\n\nLovecraft's poetry is collected in The Ancient Track: The Complete Poetical Works of H. P. Lovecraft (Night Shade Books, 2001), while much of his juvenilia, various essays on philosophical, political and literary topics, antiquarian travelogues, and other things, can be found in Miscellaneous Writings (Arkham House, 1989). Lovecraft's essay \"Supernatural Horror in Literature\", first published in 1927, is a historical survey of horror literature available with endnotes as The Annotated Supernatural Horror in Literature.\n\nLetters\n\nAlthough Lovecraft is known mostly for his works of weird fiction, the bulk of his writing consists of voluminous letters about a variety of topics, from weird fiction and art criticism to politics and history. Lovecraft's biographer L. Sprague de Camp estimates that Lovecraft wrote 100,000 letters in his lifetime, a fifth of which are believed to survive.\n\nHe sometimes dated his letters 200 years before the current date, which would have put the writing back in US colonial times, before the American Revolution (a war that offended his Anglophilia). He explained that he thought that the 18th and 20th centuries were the \"best\", the former being a period of noble grace, and the latter a century of science.\n\nLovecraft was not an active letter-writer in youth. In 1931 he admitted: \"In youth I scarcely did any letter-writing — thanking anybody for a present was so much of an ordeal that I would rather have written a two hundred fifty-line pastoral or a twenty-page treatise on the rings of Saturn.\" (SL 3.369–70). The initial interest in letters stemmed from his correspondence with his cousin Phillips Gamwell but even more important was his involvement in the amateur journalism movement, which was initially responsible for the enormous number of letters Lovecraft produced.\n\nDespite his light letter-writing in youth, in later life his correspondence was so voluminous that it has been estimated that he may have written around 30,000 letters to various correspondents, a figure which places him second only to Voltaire as an epistolarian. Lovecraft's later correspondence is primarily to fellow weird fiction writers, rather than to the amateur journalist friends of his earlier years.\n\nLovecraft clearly states that his contact to numerous different people through letter-writing was one of the main factors in broadening his view of the world: \"I found myself opened up to dozens of points of view which would otherwise never have occurred to me. My understanding and sympathies were enlarged, and many of my social, political, and economic views were modified as a consequence of increased knowledge.\" (SL 4.389).\n\nToday there are five publishing houses that have released letters from Lovecraft, most prominently Arkham House with its five-volume edition Selected Letters (these volumes severely abridge the letters they contain). Other publishers are Hippocampus Press (Letters to Alfred Galpin et al.), Night Shade Books (Mysteries of Time and Spirit: The Letters of H. P. Lovecraft and Donald Wandrei et al..), Necronomicon Press (Letters to Samuel Loveman and Vincent Starrett et al.), and University of Tampa Press (O Fortunate Floridian: H. P. Lovecraft's Letters to R. H. Barlow). S.T. Joshi is supervising an ongoing series of volumes collecting Lovecraft's unabridged letters to particular correspondents.\n\nLord of a Visible World: An Autobiography in Letters was published in 2000, in which Lovecraft's letters are arranged according to themes, such as adolescence and travel.\n\nCopyright\n\nDespite several claims to the contrary, there is currently no evidence that any company or individual owns the copyright to any of Lovecraft's work, and it is generally accepted that it has passed into the public domain.\n\nThere has been controversy over the copyright status of many of Lovecraft's works, especially his later works. Lovecraft had specified that the young R. H. Barlow would serve as executor of his literary estate, but these instructions had not been incorporated into his will. Nevertheless his surviving aunt carried out his expressed wishes, and Barlow was given charge of the massive and complex literary estate upon Lovecraft's death.\n\nBarlow deposited the bulk of the papers, including the voluminous correspondence, with the John Hay Library, and attempted to organize and maintain Lovecraft's other writing. August Derleth, an older and more established writer than Barlow, vied for control of the literary estate. One result of these conflicts was the legal confusion over who owned what copyrights.\n\nAll works published before 1923 are public domain in the US. With respect to works published later, ownership of the copyrights is disputed. Before the United States Copyright Act of 1976, copyright lasted for 28 years from publication and a work that did not have its copyright renewed passed into the public domain. The Copyright Act of 1976 retroactively extended this renewal period for all works to a period of 47 years[ftp://rtfm.mit.edu/pub/usenet/news.answers/law/copyright/faq/part2 Copyright Basics by Terry Carroll 1994] and the Sonny Bono Copyright Term Extension Act of 1998 added another 20 years to that, for a total of 95 years from publication. But everything turned on the renewal or expiration of copyright at the end of the first 28-year term.\n\nThe European Union Copyright Duration Directive of 1993 extended the copyrights to 70 years after the author's death. All of Lovecraft's works published during his lifetime became public domain in all 27 European Union countries on January 1, 2008. In those Berne Convention countries that have implemented only the minimum copyright period, copyright expires 50 years after the author's death.\n\nLovecraft protégés and part owners of Arkham House, August Derleth and Donald Wandrei, often claimed copyrights over Lovecraft's works. On October 9, 1947, Derleth purchased all rights to Weird Tales. However, since April 1926 at the latest, Lovecraft had reserved to himself all second printing rights to stories published in Weird Tales. Weird Tales may only have owned the rights to at most six of Lovecraft's tales. Again, even if Derleth did obtain the copyrights to Lovecraft's tales, there is no evidence that the copyrights were renewed. Following Derleth's death in 1971, his attorney proclaimed that all of Lovecraft's literary material was part of the Derleth estate and that it would be \"protected to the fullest extent possible.\"\n\nS. T. Joshi concludes in his biography of Lovecraft that Derleth's claims are \"almost certainly fictitious\" and that most of Lovecraft's works published in the amateur press are most likely now in the public domain. The copyright for Lovecraft's works would have been inherited by the only surviving heir named in his 1912 will, his aunt Annie Gamwell. When Gamwell died in 1941, the copyrights passed to her remaining descendants, Ethel Phillips Morrish and Edna Lewis, who then signed a document, sometimes referred to as the Morrish-Lewis gift, permitting Arkham House to republish Lovecraft's works while retaining the copyrights for themselves. Searches of the Library of Congress have failed to find any evidence that these copyrights were renewed after the 28-year period, making it likely that these works are now in the public domain.\n\nChaosium, publishers of the Call of Cthulhu role-playing game, have a trademark on the phrase \"The Call of Cthulhu\" for use in game products. TSR, Inc., original publisher of the Advanced Dungeons & Dragons role-playing game, included a section on the Cthulhu Mythos in one of the game's earlier supplements, Deities & Demigods (originally published in 1980 and later renamed to \"Legends & Lore\"). TSR later agreed to remove this section at Chaosium's request.\n\nIn 2009, Lovecraft Holdings, LLC, a company based out of Providence, filed trademark claims for clothing graphics of Lovecraft's name and silhouette.\n\nRegardless of the legal disagreements surrounding Lovecraft's works, Lovecraft himself was extremely generous with his own works and encouraged others to borrow ideas from his stories and build on them, particularly with regard to his Cthulhu Mythos. He encouraged other writers to reference his creations, such as the Necronomicon, Cthulhu and Yog-Sothoth. After his death, many writers have contributed stories and enriched the shared mythology of the Cthulhu Mythos, as well as making numerous references to his work.\n\nWorld Fantasy Award and H. P. Lovecraft controversy\n\nIn 1984, writer Donald Wandrei caused some controversy after he was offered a World Fantasy Award for Life Achievement but refused to accept it because the award was a bust of H. P. Lovecraft that he felt looked more like a caricature of Lovecraft than an actual representation.\n\nIn August 2014, author Daniel José Older started a petition to change the World Fantasy Award statuette from a bust of Lovecraft to one of African-American author Octavia Butler. Kevin J. Maroney, editor of The New York Review of Science Fiction, also supported the call for the WFA to be changed from Lovecraft's face, suggesting it be replaced with a symbol representing the fantasy genre. Maroney argued this should be done \"not out of disrespect for Lovecraft as a writer or as a central figure in fantasy, but as a courtesy to generations of writers whom the WFA hopes to honor.\" In response to the campaign, the board of the World Fantasy Awards announced in September 2014 that it was \"in discussion\" about the future of the award statuette, and in November 2015 it was announced that the World Fantasy Award trophy would no longer be modeled on H. P. Lovecraft.\n\nLocations featured in Lovecraft stories \n\nLovecraft drew extensively from his native New England for settings in his fiction. Numerous real historical locations are mentioned, and several fictional New England locations make frequent appearances.\n\nBibliography \n\nDocumentary biographies and movies portrayals \n\n* Howard Lovecraft and the Frozen Kingdom (2016 Canadian animated fictional movie inspired by the writings of H. P. Lovecraft). \n* Lovecraft: Fear of the Unknown (2008).\n* Weird Tales: The Strange Life of H. P. Lovecraft (2006).\n* La Herencia Valdemar II: La Sombra Prohibida (2010 Spanish movie inspired by Lovecraft where he was also portrayed in a small role)\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "H. P. Lovecraft" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13509" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Howard Phillips Lovecraft (August 20, 1890 – March 15, 1937) was an American writer who achieved posthumous fame through his influential works of horror fiction. He was virtually unknown and published only in pulp magazines before he died in poverty, but he is now regarded as one of the most significant 20th-century authors in his genre.\n\nLovecraft was born in Providence, Rhode Island, where he spent most of his life. Among his most celebrated tales are \"The Rats in the Walls\", \"The Call of Cthulhu\", At the Mountains of Madness and The Shadow Out of Time, all canonical to the Cthulhu Mythos. Lovecraft was never able to support himself from earnings as author and editor. He saw commercial success increasingly elude him in this latter period, partly because he lacked the confidence and drive to promote himself. He subsisted in progressively strained circumstances in his last years; an inheritance was completely spent by the time he died, at age 46.\n\nBiography\n\nEarly life (1890–1908)\n\nLovecraft was born in his family home on August 20, 1890, in Providence, Rhode Island. He was the only child of Winfield Scott Lovecraft (1853–1898) and Sarah Susan (Susie) Phillips Lovecraft (1857–1921). Though his employment is hard to discern, Lovecraft's future wife, Sonia Greene, stated that Winfield was employed by Gorham Manufacturing Company as a traveling salesman. Susie's family was of substantial means at the time of their marriage; her father, Whipple Van Buren Phillips, being involved in many significant business ventures. In April 1893, after a psychotic episode in a Chicago hotel, Winfield was committed to Butler Hospital in Providence. Though it is not clear who reported Winfield's prior behavior to Butler, medical records indicate that he had been \"doing and saying strange things at times\" for a year before his commitment. Winfield spent five years in Butler before dying in 1898. His death certificate listed the cause of death as general paresis, a term synonymous with late-stage syphilis. Susie never exhibited symptoms of the disease, leading to questions regarding the intimacy of their relationship. In 1969 Sonia Greene ventured that Susie was a \"touch-me-not\" wife and that Winfield, being a traveling salesmen, \"took his sexual pleasures wherever he could find them\". How Greene came to this opinion is unknown, as she never met Lovecraft's parents, though Lovecraft himself termed his mother a \"touch-me-not\" in a 1937 letter noting that, after his early childhood, she avoided all physical contact with him. This is contrary to Susie's treatment of a young Lovecraft soon after his father's breakdown. According to the accounts of family friends Susie doted over the young Lovecraft to a fault, pampering him and never letting him out of her sight. Throughout his life Lovecraft maintained that his father fell into a paralytic state, due to insomnia and being overworked, and remained that way until his death. It is unknown if Lovecraft was simply kept ignorant of his father's illness or if his later remarks were intentionally misleading.\n\nAfter his father's hospitalization, Lovecraft resided in the family home with his mother, his maternal aunts Lillian and Annie, and his maternal grandparents Whipple and Robie. Lovecraft later recollected that after his father's illness his mother was \"permanently stricken with grief.\" Whipple became a father figure to Lovecraft in this time, Lovecraft noting that his grandfather became the \"centre of my entire universe.\" Whipple, who traveled often on business, maintained correspondence with the young Lovecraft by letter who, by the age of three, was already proficient at reading and writing. When home Whipple would share weird tales of his own invention and show Lovecraft objects of art he had acquired in his European travels. Lovecraft also credits Whipple with being instrumental in overcoming his fear of the dark when Whipple forced Lovecraft, at five years old, to walk through several darkened rooms in the family home. It was in this period that Lovecraft was introduced to some of his earliest literary influences such as The Rime of the Ancient Mariner illustrated by Doré, One Thousand and One Nights, a gift from his mother, Thomas Bulfinch's Age of Fable and Ovid's Metamorphoses.\n\nWhile there is no indication that Lovecraft was particularly close to his grandmother Robie, her death in 1896 had a profound effect. By his own account, it sent his family into \"a gloom from which it never fully recovered.\" His mother and aunts' wearing of black mourning dresses \"terrified\" him, and it is at this time that Lovecraft, approximately five and half years old, started having nightmares that would inform his later writing. Specifically, he began to have recurring nightmares of beings he termed \"night-gaunts\"; their appearance he credited to the influence of Doré's illustrations, which would \"whirl me through space at a sickening rate of speed, the while fretting & impelling me with their detestable tridents.\" Thirty years later night gaunts would appear in Lovecraft's writing.\n\nLovecraft's earliest known literary works began at age seven with poems restyling the Odyssey and other mythological stories. Lovecraft has said that as a child he was enamored with the Roman pantheon of gods, accepting them as genuine expressions of divinity and foregoing his Christian upbringing. He recalls, at five years old, being told Santa Claus didn't exist and retorting by asking why \"God is not equally a myth?\" At the age of eight he took a keen interest in the sciences, particularly astronomy and chemistry. He also examined the anatomy books available to him in the family library, learning the specifics of human reproduction that had yet to be explained to him, and found that it \"virtually killed my interest in the subject.\" In 1902, according to Lovecraft's own correspondence, astronomy became a guiding influence on his world view. He began producing the periodical Rhode Island Journal of Astronomy, of which 69 issues survive, using the hectograph printing method. Lovecraft went in and out of elementary school repeatedly, oftentimes with home tutors making up for those lost school years, missing time due to health concerns that are not entirely clear. The written recollections of his peers described him as both withdrawn yet openly welcoming to anyone who shared his current fascination with astronomy, inviting anyone to look through the telescope he prized.\n\nBy 1900 Whipple's various business concerns were suffering a downturn and slowly reducing his family's wealth. He was forced to let the family's hired servants go, leaving Lovecraft, Whipple and Susie, being the only unmarried sister, alone in the family home. In the spring of 1904 Whipple's largest business venture suffered a catastrophic failure. Within months he died due to a stroke at age 70. After Whipple's death Susie was unable to support the upkeep of the expansive family home on what remained of the Phillips' estate. Later that year she was forced to move herself and her son to a small duplex. Lovecraft has called this time one of the darkest of his life, remarking in a 1934 letter that he saw no point in living anymore. In fall of the same year he started high school. Much like his earlier school years, Lovecraft was at times removed from school for long periods for what he termed \"near breakdowns\". He did say, though, that while having some conflicts with teachers, he enjoyed high school, becoming close with a small circle of friends. Aside from a pause in 1904 he also resumed publishing the Rhode Island Journal of Astronomy as well as starting the Scientific Gazette, which dealt mostly with chemistry. It was also during this period that Lovecraft produced the first of the types of fiction he would later be known for, namely \"The Beast in the Cave\" and \"The Alchemist\".\n\nIt was in 1908, prior to his high school graduation, when Lovecraft suffered another health crisis of some sort, though this instance was seemingly more severe than any prior. The exact circumstances and causes remain unknown. The only direct records are Lovecraft's own later correspondence wherein he described it variously as a \"nervous collapse\" and \"a sort of breakdown\", in one letter blaming it on the stress of high school despite his enjoying it. In another letter concerning the events of 1908 he notes, \"I was and am prey to intense headaches, insomnia, and general nervous weakness which prevents my continuous application to any thing.\" Though Lovecraft maintained that he was to attend Brown University after high school, he never graduated and never attended school again. Whether Lovecraft suffered from a physical ailment, a mental one, or some combination thereof has never been determined. An account from a high school classmate described Lovecraft as exhibiting \"terrible tics\" and that at times \"he'd be sitting in his seat and he'd suddenly up and jump.\" Harry Brobst, who recorded the account and had a Ph.D. in psychology, claimed that chorea minor was the most likely cause of Lovecraft's childhood symptoms while noting that instances of chorea minor after adolescence are very rare. Lovecraft himself acknowledged in letters that he suffered from bouts of chorea as a child. Brobst further ventured that Lovecraft's 1908 breakdown was attributed to a \"hysteroid seizure\", a term that today usually denotes atypical depression. In another letter concerning the events of 1908, Lovecraft stated that he \"could hardly bear to see or speak to anyone, & liked to shut out the world by pulling down dark shades & using artificial light.\"\n\nEarliest recognition (1908–1914)\n\nNot much of Lovecraft and Susie's activities from late 1908 to 1913 are recorded. Lovecraft mentions a steady continuation of their financial decline highlighted by a failed business venture of his uncle that cost Susie a large portion of their dwindling wealth. Accounts differ on how reclusive Susie and Lovecraft were during this time. A friend of Susie, Clara Hess, recalled a visit during which Susie spoke continuously about Lovecraft being \"so hideous that he hid from everyone and did not like to walk upon the streets where people could gaze on him.\" Despite Hess' protest that this wasn't the case, Susie maintained this stance. In the same account though, Hess said she regularly saw Susie out and about riding streetcars.\n\nFor his part, Lovecraft said he found his mother to be \"a positive marvel of consideration.\" A next-door neighbor later pointed out that what others in the neighborhood often supposed were loud, nocturnal quarrels between mother and son, she recognized as being recitations of Shakespeare; an activity that seemed to delight mother and son. Susie had an adoration for French literature, having studied French in boarding school. Lovecraft, though he never matched his mother's admiration of French literature, admired her knowledge and devotion to it. Lovecraft recalls Susie also had a passion for painting landscapes of the surrounding countryside, though none of her work survives today. One of Lovecraft's later friends, C. M. Eddy Jr., became aware of Lovecraft due to his wife Muriel, whose mother-in-law attended a women's suffrage meeting where she met Susie.\n\nDuring this period Lovecraft revived his earlier scientific periodicals. He endeavored to commit himself to the study of organic chemistry, Susie buying the expensive glass chemistry assemblage he wanted. Lovecraft found his studies were hobbled by the mathematics involved, which he found boring and would cause headaches that would incapacitate him for a day. Lovecraft's first poem that wasn't self-published appeared in a local newspaper in 1912. Called \"Providence in 2000 A.D.\", the poem envisioned a future where proper people of English heritage were displaced by immigrants. Surviving unpublished poems from this period, most notoriously \"On the Creation of Niggers\", were also emblematic of the xenophobia and racism inherent in much of Lovecraft's later work.\n\nIn 1911 Lovecraft's letters to editors began appearing in pulp and weird fiction magazines, most notably Argosy. A 1913 letter critical of Fred Jackson, a prominent writer for Argosy, started Lovecraft down a path that would greatly affect his life. Lovecraft described Jackson's stories as \"trivial, effeminate, and, in places, coarse.\" Continuing, Lovecraft said that Jackson's characters exhibit the \"delicate passions and emotions proper to negroes and anthropoid apes.\" This sparked a nearly year-long feud in the letters section of Argosy between Lovecraft, along with his occasional supporters, and the majority of readers critical of his view of Jackson. Lovecraft's biggest critic was John Russell, who often replied in verse, and to whom Lovecraft felt compelled to reply to because he respected Russell's writing skills. The most immediate effect of the feud was the recognition garnered from Edward F. Daas, then head editor of the United Amateur Press Association. Daas invited Russell and Lovecraft to the organization and both accepted, Lovecraft in April 1914.\n\nRejuvenation and tragedy (1914–1921)\n\nLovecraft immersed himself in the world of amateur journalism for most of the following decade. During this period he was an advocate for amateurism versus commercialism. Lovecraft's definition of commercialism, though, was specific to writing for, what he considered, low-brow publications for pay. He contrasted this with his view of \"professional publication\", which he termed as writing for journals and publishers he considered respectable. He thought of amateur journalism as training and practice for a professional career. Lovecraft was appointed to chairman of the Department of Public Criticism of the UAPA in late 1914. He used this position to advocate for his, what many considered peculiar, insistence on the superiority of English language usage that most writers already considered archaic. Emblematic of the Anglophile opinions he maintained throughout his life, he openly criticized other UAPA contributors for their \"Americanisms\" and \"slang\". Often these criticisms were couched in xenophobic and racist arguments bemoaning the \"bastardization\" of the \"national language\" by immigrants. In mid-1915 Lovecraft was elected to the position of first vice-president of the UAPA. Two years later he was elected president and appointed other board members that mostly shared his view on the supremacy of classical English over modern American English. Another significant event of this time was the beginning of World War I. Lovecraft published multiple criticisms of the US government's, and the American public's reluctance to join the war to protect England, which he viewed as the America's homeland.\n\nIn 1916 Lovecraft published his early short story \"The Alchemist\" in the main UAPA journal, a departure from his usual verse. Due in no small part to the encouragement of W. Paul Cook, another UAPA member and future life-long friend, Lovecraft began writing and publishing more fiction. Soon to follow were \"The Tomb\" and \"Dagon\". \"The Tomb\", by Lovecraft's own admission, follows closely the style and construction of the writings of one of his largest influences, Edgar Allan Poe. \"Dagon\" though, is considered Lovecraft's first work that embraced the concepts and themes that his writing would later be known for. In 1918 Lovecraft's term as president of the UAPA elapsed, and he took his former post as chairman of the Department of Public Criticism. In 1919 Lovecraft published another short story, \"Beyond the Wall of Sleep\".\n\nIn 1917 came two first hand accounts suggesting that, despite his climb in the ranks of the UAPA, Lovecraft still lived a fairly hermetical life. One comes from Cook himself, the other Rheinhart Kleiner, a Brooklyn-based UAPA writer. Both recalled that during their visits Lovecraft's mother regularly checked in on Lovecraft. Kleiner mentioned that \"at every hour or so his mother appeared in the doorway with a glass of milk, and Lovecraft forthwith drank it.\" In the same account Kleiner described Susie as \"very cordial and even vivacious.\" Cook recounts an almost comical delay of his meeting with Lovecraft wherein Susie and Lillian wouldn't let Cook in because Lovecraft had been up all night writing and couldn't be disturbed. Eventually Lovecraft appeared at the door in his \"dressing gown and slippers.\" Lovecraft later attributed his mother and aunt's reticence to allow Cook in being due to his unkempt appearance and their general dislike of Lovecraft's involvement with amateur journalism.  Also in 1917, as Lovecraft related to Kleiner, was Lovecraft's aborted attempt to enlist in the army. Though he passed the physical exam, he told Kleiner that his mother \"has threatened to go to any lengths, legal or otherwise, if I do not reveal all the ills which unfit me for the army.\"\n\nIn the winter of 1918–1919, Susie, exhibiting symptoms of a \"nervous breakdown\" of some sort, went to live with her elder sister Lillian. It is unclear what Susie may have been suffering from. Clara Hess, interviewed decades later, recalled instances of Susie describing \"weird and fantastic creatures that rushed out from behind buildings and from corners at dark.\" In the same account Hess describes a time when they crossed paths in downtown Providence and Susie \"was excited and apparently did not know where she was.\" Whatever the causes, in March 1919 they resulted in Susie being committed to Butler Hospital, like her husband before her. Lovecraft's immediate reaction to Susie's commitment was visceral, writing to Kleiner that, \"existence seems of little value,\" and that he wished \"it might terminate.\" Speaking to Susie's doctors, a month after she entered Butler, Lovecraft came to the realization that she was never going to be released.\n\nThe nature of Susie's illness is impossible to ascertain. Her medical records were lost in a fire, and the only Lovecraft researcher to have seen them prior was Winfield Townley Scott. His account describes Susie weeping often and speaking regularly about both her family's financial collapse and her son, whom she described as \"a poet of the highest order.\" Her psychiatrist claimed she had Oedipus complex. The psychiatric views of the day, still beholden to archaic Victorian assumptions, make any contemporary diagnosis of Susie questionable. No matter their symptoms or situations, women were predominately diagnosed (as Susie was) with hysteria, a concept that women are inherently mentally frail due to having \"thinner blood\" as result of menstruation and having a uterus. Lovecraft visited Susie often, walking the large grounds with her, and sent her letters on a regular basis.\n\nLate 1919 saw Lovecraft become more outgoing. After a period of isolation, he began joining friends in trips to writer gatherings, the first being a talk in Boston presented by Lord Dunsany, whom Lovecraft recently discovered and idolized. In early 1920, at an amateur writer convention, he met Frank Belknap Long, who would end up being Lovecraft's most influential and closest confidant for the rest of his life. This period also proved to be the most prolific of Lovecraft's short-story career. The influence of Dunsany is readily apparent in his 1919 output, later be to coined Lovecraft's Dream Cycle, with stories like \"The White Ship\", \"The Doom that Came to Sarnath\", and \"The Statement of Randolph Carter\". In early 1920 followed \"Celephais\" and \"The Cats of Ulthar\". It was later in 1920 that Lovecraft began publishing the earliest stories that fit into the Cthulhu Mythos. The Cthulhu Mythos, a term coined by August Derleth, encompasses Lovecraft's stories that share a commonality in fictional locations and Lovecraft's invented pantheon of god-like beings known as The Great Old Ones. The poem \"Nyarlathotep\" and short story \"The Crawling Chaos\", in collaboration with Winifred Virginia Jackson, were written in late 1920. Following in early 1921 came \"The Nameless City\", the first story that falls definitively within the Cthulhu Mythos. In it is found one of Lovecraft's most enduring bits of writing, a couplet recited by his creation Abdul Alhazred, \"That is not dead which can eternal lie; And with strange aeons even death may die.\"\n\nOn May 24, 1921, Sarah Susan (Susie) Phillips Lovecraft died in Butler Hospital, due to complications from a gall bladder surgery five days earlier. Lovecraft's initial reaction, expressed in a letter nine days after Susie's death, was that of an \"extreme nervous shock\" that crippled him physically and emotionally, again remarking that he found no reason he should continue living. Despite Lovecraft's immediate reaction to his mother's death, he continued to attend amateur journalist conventions. It was at one such convention in July that Lovecraft met Sonia Greene.\n\nMarriage and New York\n\nLovecraft's aunts disapproved of this relationship with Sonia. Lovecraft and Greene married on March 3, 1924, and relocated to her Brooklyn apartment at 793 Flatbush Avenue; she thought he needed to get out of Providence in order to flourish and was willing to support him financially. Greene, who had been married before, later said Lovecraft had performed satisfactorily as a lover, though she had to take the initiative in all aspects of the relationship. She attributed Lovecraft's passive nature to a stultifying upbringing by his mother. Lovecraft's weight increased to 90 kg on his wife's home cooking.\n\nHe was enthralled by New York, and, in what was informally dubbed the Kalem Club, he acquired a group of encouraging intellectual and literary friends who urged him to submit stories to Weird Tales; editor Edwin Baird accepted many otherworldly 'Dream Cycle' Lovecraft stories for the ailing publication, though they were heavily criticized by a section of the readership. Established informally some years before Lovecraft arrived in New York, the core Kalem Club members were boys' adventure novelist Henry Everett McNeil; the lawyer and anarchist writer James Ferdinand Morton, Jr.; and the poet Reinhardt Kleiner.\n\nOn New Year's Day of 1925, Sonia moved to Cleveland for a job opportunity, and Lovecraft left Flatbush for a small first-floor apartment on 169 Clinton Street \"at the edge of Red Hook\"—a location which came to discomfort him greatly. Later that year the Kalem Club's four regular attendees were joined by Lovecraft along with his protégé Frank Belknap Long, bookseller George Willard Kirk, and Lovecraft's close friend Samuel Loveman. Loveman was Jewish, but was unaware of Lovecraft's nativist attitudes. Conversely, it has been suggested that Lovecraft, who disliked mention of sexual matters, was unaware that Loveman and some of his other friends were homosexual.The Dream World of H. P. Lovecraft: His Life, His Demons, His Universe (2010) – Donald Tyson \n\nFinancial difficulties\n\nNot long after the marriage, Greene lost her business and her assets disappeared in a bank failure; she also became ill. Lovecraft made efforts to support his wife through regular jobs, but his lack of previous work experience meant he lacked proven marketable skills. After a few unsuccessful spells as a low-level clerk, his job-seeking became desultory. The publisher of Weird Tales attempted to put the loss-making magazine on a business footing and offered the job of editor to Lovecraft, who declined, citing his reluctance to relocate to Chicago; \"think of the tragedy of such a move for an aged antiquarian,\" the 34-year-old writer declared. Baird was replaced with Farnsworth Wright, whose writing Lovecraft had criticized. Lovecraft's submissions were often rejected by Wright. (This may have been partially due to censorship guidelines imposed in the aftermath of a Weird Tales story that hinted at necrophilia, although after Lovecraft's death Wright accepted many of the stories he had originally rejected.)\n\nBrooklyn\n\nGreene, moving where the work was, relocated to Cincinnati, and then to Cleveland; her employment required constant travel. Added to the daunting reality of failure in a city with a large immigrant population, Lovecraft's single-room apartment at 169 Clinton Street in Brooklyn Heights, not far from the working-class waterfront neighborhood Red Hook, was burgled, leaving him with only the clothes he was wearing. In August 1925 he wrote \"The Horror at Red Hook\" and \"He\", in the latter of which the narrator says \"My coming to New York had been a mistake; for whereas I had looked for poignant wonder and inspiration …  I had found instead only a sense of horror and oppression which threatened to master, paralyze, and annihilate me\". It was at around this time he wrote the outline for \"The Call of Cthulhu\", with its theme of the insignificance of all humanity. In the bibliographical study H. P. Lovecraft: Against the World, Against Life, Michel Houellebecq suggested that the misfortunes fed Lovecraft's central motivation as a writer, which he said was racial resentment.. With a weekly allowance Greene sent, Lovecraft moved to a working-class area of Brooklyn Heights, where he subsisted in a tiny apartment. He had lost 40 lb of body weight by 1926, when he left for Providence.\n\nReturn to Providence\n\nBack in Providence, Lovecraft lived in a \"spacious brown Victorian wooden house\" at 10 Barnes Street until 1933. The same address is given as the home of Dr. Willett in Lovecraft's The Case of Charles Dexter Ward. The period beginning after his return to Providence—the last decade of his life—was Lovecraft's most prolific; in that time he produced short stories, as well as his longest work of fiction The Case of Charles Dexter Ward and At the Mountains of Madness. He frequently revised work for other authors and did a large amount of ghost-writing, including \"The Mound\", \"Winged Death\", and \"The Diary of Alonzo Typer\". Client Harry Houdini was laudatory, and attempted to help Lovecraft by introducing him to the head of a newspaper syndicate. Plans for a further project were ended by Houdini's death.An H.P. Lovecraft Encyclopedia, edited by S. T. Joshi, David E. Schultz, page 117\n\nAlthough he was able to combine his distinctive style (allusive and amorphous description by horrified though passive narrators) with the kind of stock content and action that the editor of Weird Tales wanted—Wright paid handsomely to snap up \"The Dunwich Horror\" which proved very popular with readers—Lovecraft increasingly produced work that brought him no remuneration. Affecting a calm indifference to the reception of his works, Lovecraft was in reality extremely sensitive to criticism and easily precipitated into withdrawal. He was known to give up trying to sell a story after it had been once rejected. Sometimes, as with The Shadow Over Innsmouth (which included a rousing chase that supplied action) he wrote a story that might have been commercially viable, but did not try to sell it. Lovecraft even ignored interested publishers. He failed to reply when one inquired about any novel Lovecraft might have ready: although he had completed such a work, The Case of Charles Dexter Ward, it was never typed up.\n\nA few years after Lovecraft had moved to Providence, he and his wife Sonia Greene, having been living separately for so long, agreed to an amicable divorce. Greene moved to California in 1933 and remarried in 1936, unaware that Lovecraft, despite his assurances to the contrary, had never officially signed the final decree.S. T. Joshi, H.P. Lovecraft: A Life, p.455\n\nLast years\n\nLovecraft was never able to provide even basic expenses by selling stories and doing paid literary work for others. He lived frugally, subsisting on an inheritance that was nearly depleted by the time he died. He sometimes went without food to be able to pay the cost of mailing letters.Ronan, Margaret, Forward to The Shadow Over Innsmouth and Other Stories of Horror, Scholastic Book Services, 1971 Eventually, he was forced to move to meager lodgings with his surviving aunt. He was also deeply affected by the suicide of his correspondent Robert E. Howard. In early 1937, he was diagnosed with cancer of the small intestine and suffered from malnutrition as a result. He lived in constant pain until his death on March 15, 1937 in Providence. In accordance with his lifelong scientific curiosity, he kept a diary of his illness until close to the moment of his death.\n\nLovecraft was listed along with his parents on the Phillips family monument (). In 1977, fans erected a headstone in Swan Point Cemetery on which they inscribed his name, the dates of his birth and death, and the phrase \"I AM PROVIDENCE\"—a line from one of his personal letters.\n\nGroups of enthusiasts annually observe the anniversaries of Lovecraft's death at Ladd Observatory and of his birth at his grave site. In July 2013, the Providence City Council designated \"H. P. Lovecraft Memorial Square\" and installed a commemorative sign at the intersection of Angell and Prospect streets, near the author's former residences.\n\nAppreciation\n\nWithin genre\n\nBy 1957 Floyd C. Gale of Galaxy Science Fiction said that \"like R. E. Howard, Lovecraft seemingly goes on forever; the two decades since their death are as nothing. In any event, they appear more prolific than ever. What with de Camp, Nyberg and Derleth avidly rooting out every scrap of their writings and expanding them into novels, there may never be an end to their posthumous careers\". According to Joyce Carol Oates, Lovecraft (and Edgar Allan Poe in the 19th century) has exerted \"an incalculable influence on succeeding generations of writers of horror fiction\". Horror, fantasy, and science fiction author Stephen King called Lovecraft \"the twentieth century's greatest practitioner of the classic horror tale.\"The Best of H. P. Lovecraft: Bloodcurdling Tales of Horror and the Macabre, Del Rey Books, 1982, front cover. King has made it clear in his semi-autobiographical non-fiction book Danse Macabre that Lovecraft was responsible for his own fascination with horror and the macabre and was the largest figure to influence his fiction writing.\n\nLiterary\n\nEarly efforts to revise an established literary view of Lovecraft as an author of 'pulp' were resisted by some eminent critics; in 1945 Edmund Wilson expressed the opinion that \"the only real horror in most of these fictions is the horror of bad taste and bad art\". But \"Mystery and Adventure\" columnist Will Cuppy of the New York Herald Tribune recommended to readers a volume of Lovecraft's stories, asserting that \"the literature of horror and macabre fantasy belongs with mystery in its broader sense.\", note no. 66 Gale said that \"Lovecraft at his best could build a mood of horror unsurpassed; at his worst, he was laughable\". In 1962 Colin Wilson, in his survey of anti-realist trends in fiction The Strength to Dream, cited Lovecraft as one of the pioneers of the \"assault on rationality\" and included him with M.R. James, H.G. Wells, Aldous Huxley, Tolkien and others as one of the builders of mythicised realities over against the failing project of literary realism. Subsequently Lovecraft began to acquire the status of a cult writer in the counterculture of the 1960s, and reprints of his work proliferated. \nIn 2005 the status of classic American writer conferred by a Library of America edition was accorded to Lovecraft with the publication of Tales, a collection of his weird fiction stories.LA Review of Books, April 6, 2013 [http://lareviewofbooks.org/review/lets-get-weird-on-graham-harmans-h-p-lovecraft Let's Get Weird]\n\nPhilosophical\n\nPhilosopher Graham Harman, seeing Lovecraft as having a unique—though implicit—anti-reductionalist ontology, writes: \"No other writer is so perplexed by the gap between objects and the power of language to describe them, or between objects and the qualities they possess.\"Weird Realism: Lovecraft and Philosophy (2013) Graham Harman\nHarman said of leading figures at the initial speculative realism conference (which included philosophers Quentin Meillassoux, Ray Brassier, and Iain Hamilton Grant) that, though they shared no philosophical heroes, all were enthusiastic readers of Lovecraft.ASK/TELL, October 23, 2011 [http://eeevee2.blogspot.co.uk/2011/10/interview-with-graham-harman.html Interview with Graham Harman] Speculative realists, Mark Fisher and other contemporary philosophers, took Lovecraft seriously, mainly because Lovecraft's weird reality as presented in his novels, had nothing to do with the Gothic's insistence in the supernatural, but presented another reality incomprehensible to the human mind, but nonetheless real. According to scholar S. T. Joshi: \"There is never an entity in Lovecraft that is not in some fashion material\".New Critical Essays on H.P. Lovecraft,(2013)Chapter nine\n\nThemes\n\nSeveral themes recur in Lovecraft's stories:\n\nForbidden knowledge\n\nForbidden, dark, esoterically veiled knowledge is a central theme in many of Lovecraft's works. Many of his characters are driven by curiosity or scientific endeavor, and in many of his stories the knowledge they uncover proves Promethean in nature, either filling the seeker with regret for what they have learned, destroying them psychologically, or completely destroying the person who holds the knowledge.\n\nSome critics argue that this theme is a reflection of Lovecraft's contempt of the world around him, causing him to search inwardly for knowledge and inspiration.\n\nNon-human influences on humanity\n\nThe beings of Lovecraft's mythos often have human servants; Cthulhu, for instance, is worshiped under various names by cults among both the Greenlandic Inuit and voodoo circles of Louisiana, and in many other parts of the world.\n\nThese worshippers served a useful narrative purpose for Lovecraft. Many beings of the Mythos were too powerful to be defeated by human opponents, and so horrific that direct knowledge of them meant insanity for the victim. When dealing with such beings, Lovecraft needed a way to provide exposition and build tension without bringing the story to a premature end. Human followers gave him a way to reveal information about their \"gods\" in a diluted form, and also made it possible for his protagonists to win paltry victories. Lovecraft, like his contemporaries, envisioned \"savages\" as closer to supernatural knowledge unknown to civilized man.\n\nInherited guilt\n\nAnother recurring theme in Lovecraft's stories is the idea that descendants in a bloodline can never escape the stain of crimes committed by their forebears, at least if the crimes are atrocious enough. Descendants may be very far removed, both in place and in time (and, indeed, in culpability), from the act itself, and yet, they may be haunted by the revenant past, e.g. \"The Rats in the Walls\", \"The Lurking Fear\", \"Arthur Jermyn\", \"The Alchemist\", The Shadow over Innsmouth, \"The Doom that Came to Sarnath\" and The Case of Charles Dexter Ward.\n\nFate\n\nOften in Lovecraft's works the protagonist is not in control of his own actions, or finds it impossible to change course. Many of his characters would be free from danger if they simply managed to run away; however, this possibility either never arises or is somehow curtailed by some outside force, such as in \"The Colour Out of Space\" and \"The Dreams in the Witch House\". Often his characters are subject to a compulsive influence from powerful malevolent or indifferent beings. As with the inevitability of one's ancestry, eventually even running away, or death itself, provides no safety (\"The Thing on the Doorstep\", \"The Outsider\", The Case of Charles Dexter Ward, etc.). In some cases, this doom is manifest in the entirety of humanity, and no escape is possible (The Shadow Out of Time).\n\nCivilization under threat\n\nLovecraft was familiar with the work of the German conservative-revolutionary theorist Oswald Spengler, whose pessimistic thesis of the decadence of the modern West formed a crucial element in Lovecraft's overall anti-modern worldview. Spenglerian imagery of cyclical decay is present in particular in At the Mountains of Madness. S. T. Joshi, in H. P. Lovecraft: The Decline of the West, places Spengler at the center of his discussion of Lovecraft's political and philosophical ideas.S. T. Joshi, H. P. Lovecraft: Decline of the West, (Starmont Studies in Literary Criticism, No. 37), Borgo Pr, 1991, .\n\nLovecraft wrote to Clark Ashton Smith in 1927: \"It is my belief, and was so long before Spengler put his seal of scholarly proof on it, that our mechanical and industrial age is one of frank decadence\".China Miéville's introduction to \"At the Mountains of Madness\", Modern Library Classics, 2005 Lovecraft was also acquainted with the writings of another German philosopher of decadence: Friedrich Nietzsche.\n\nLovecraft frequently dealt with the idea of civilization struggling against dark, primitive barbarism. In some stories this struggle is at an individual level; many of his protagonists are cultured, highly educated men who are gradually corrupted by some obscure and feared influence.\n\nIn such stories, the curse is often a hereditary one, either because of interbreeding with non-humans (e.g., \"Facts Concerning the Late Arthur Jermyn and His Family\" (1920), The Shadow over Innsmouth (1931)) or through direct magical influence (The Case of Charles Dexter Ward). Physical and mental degradation often come together; this theme of 'tainted blood' may represent concerns relating to Lovecraft's own family history, particularly the death of his father due to what Lovecraft must have suspected to be a syphilitic disorder.\n\nIn other tales, an entire society is threatened by barbarism. Sometimes the barbarism comes as an external threat, with a civilized race destroyed in war (e.g., \"Polaris\"). Sometimes, an isolated pocket of humanity falls into decadence and atavism of its own accord (e.g., \"The Lurking Fear\"). But most often, such stories involve a civilized culture being gradually undermined by a malevolent underclass influenced by inhuman forces.\n\nIt is likely that the \"Roaring Twenties\" left Lovecraft disillusioned as he was still obscure and struggling with the basic necessities of daily life, combined with seeing non-Western European immigrants in New York City.\n\nRace, ethnicity, and class\n\nRace is the most controversial aspect of Lovecraft's legacy, expressed in many disparaging remarks against the various non-Anglo-Saxon races and cultures in his work. As he grew older, his original Anglo-Saxon racial worldview softened into a classism or elitism which regarded the superior race to include all those self-ennobled through high culture. From the start, Lovecraft did not hold all white people in uniform high regard, but rather esteemed the English people and those of English descent. He praised non-WASP groups such as Hispanics and Jews; however his private writings on groups such as Irish Catholics, German immigrants and African-Americans were consistently negative.H. P. Lovecraft, four decades of criticism by S. T. Joshi - Ohio University Press, 1980 H.P. Lovecraft: A Life by S. T. Joshi Necronomicon Press, 1996  In an early doggerel poem, the 1912 On the Creation of Niggers, Lovecraft describes black people not as human but \"beasts... in semi-human figure, filled it with vice\". In his early published essays, private letters and personal utterances, he argued for a strong color line to preserve race and culture.David Punter, (1996), The Literature of Terror: A History of Gothic Fictions from 1765 to the Present Day, Vol. I, 'Modern Gothic\", p. 40. He made these arguments by direct disparagement of various races in his journalism and letters, and perhaps allegorically in his fiction concerning non-human races. Some have interpreted his racial attitude as being more cultural than brutally biological: Lovecraft showed sympathy to those who adopted Western culture, even to the extent of marrying a Jewish woman whom he viewed as \"well assimilated\". While Lovecraft's racial attitude has been seen as directly influenced by the society of his day, especially the New England society he grew up in, his racism appeared stronger than the general popular viewpoint.\n\nRisks of a scientific era\n\nAt the turn of the 20th century, humanity's increased reliance upon science was both opening new worlds and solidifying understanding of ours. Lovecraft portrays this potential for a growing gap of man's understanding of the universe as a potential for horror, most notably in \"The Colour Out of Space\", where the inability of science to comprehend a contaminated meteorite leads to horror.\n\nIn a letter to James F. Morton in 1923, Lovecraft specifically pointed to Einstein's theory on relativity as throwing the world into chaos and making the cosmos a jest; in a letter to Woodburn Harris in 1929, he speculated that technological comforts risk the collapse of science. Indeed, at a time when men viewed science as limitless and powerful, Lovecraft imagined alternative potential and fearful outcomes. In \"The Call of Cthulhu\", Lovecraft's characters encounter architecture which is \"abnormal, non-Euclidean, and loathsomely redolent of spheres and dimensions apart from ours\".Lovecraft, \"The Call of Cthulhu\", p. 151. Non-Euclidean geometry is the mathematical language and background of Einstein's general theory of relativity, and Lovecraft references it repeatedly in exploring alien archaeology.\n\nReligion\n\nLovecraft's works are ruled by several distinct pantheons of deities (actually aliens worshiped as such by humans) who are either indifferent or actively hostile to humanity. Lovecraft's actual philosophy has been termed \"cosmic indifference\" and this is expressed in his fiction.Mosig, Yozan Dirk W. \"Lovecraft: The Dissonance Factor in imaginary Literature\" (1979). Several of Lovecraft's stories of the Old Ones (alien beings of the Cthulhu Mythos) propose alternate mythic human origins in contrast to those found in the creation stories of existing religions, expanding on a natural world view. For instance, in Lovecraft's At the Mountains of Madness it is proposed that humankind was actually created as a slave race by the Old Ones, and that life on Earth as we know it evolved from scientific experiments abandoned by the Elder Things. Protagonist characters in Lovecraft are usually educated men, citing scientific and rational evidence to support their non-faith. \"Herbert West – Reanimator\" reflects on the atheism common in academic circles. In \"The Silver Key\", the character Randolph Carter loses the ability to dream and seeks solace in religion, specifically Congregationalism, but does not find it and ultimately loses faith.\n\nLovecraft himself adopted the stance of atheism early in life. In 1932, he wrote in a letter to Robert E. Howard: All I say is that I think it is damned unlikely that anything like a central cosmic will, a spirit world, or an eternal survival of personality exist. They are the most preposterous and unjustified of all the guesses which can be made about the universe, and I am not enough of a hairsplitter to pretend that I don't regard them as arrant and negligible moonshine. In theory, I am an agnostic, but pending the appearance of radical evidence I must be classed, practically and provisionally, as an atheist.H. P. Lovecraft Letter to Robert E. Howard (August 16, 1932), in Selected Letters 1932–1934 (Sauk City, Wisconsin: Arkham House, 1976), p. 57.\"\n\nSuperstition\n\nIn 1926, famed magician and escapist Harry Houdini asked Lovecraft to ghostwrite a treatise exploring the topic of superstition. Houdini's unexpected death later that year halted the project, but The Cancer of Superstition was partially completed by Lovecraft along with collaborator C. M. Eddy, Jr. A previously unknown manuscript of the work was discovered in 2016 in a collection owned by a magic shop. The book states \"all superstitious beliefs are relics of a common 'prehistoric ignorance' in humans,\" and goes on to explore various superstitious beliefs in different cultures and times.\"Alison Flood, [https://www.theguardian.com/books/2016/mar/16/hp-lovecraft-harry-houdini-manuscript-cancer-superstition-memorabilia Lost HP Lovecraft work commissioned by Houdini escapes shackles of history], The Guardian 16 March 2016.\n\nInfluences on Lovecraft \n\nSome of Lovecraft's work was inspired by his own nightmares.FRANCH, J., & MACROBERT, A. (2015). Cosmic Dread: THE ASTRONOMY OF H. P. LOVECRAFT. Sky & Telescope, 129(2), 34-39. His interest started from his childhood days when his grandfather would tell him Gothic horror stories.\n\nLovecraft's most significant literary influence was Edgar Allan Poe. He had a British writing style due to his love of British literature. Like Lovecraft, Poe's work was out of step with the prevailing literary trends of his era. Both authors created distinctive, singular worlds of fantasy and employed archaisms in their writings. This influence can be found in such works as his novella The Shadow Over Innsmouth where Lovecraft references Poe's story The Imp of the Perverse by name in Chapter 3, and in his poem \"Nemesis\", where the \"... ghoul-guarded gateways of slumber\" suggest the \"... ghoul-haunted woodland of Weir\" found in Poe's \"Ulalume\". A direct quote from the poem and a reference to Poe's only novel The Narrative of Arthur Gordon Pym of Nantucket is alluded to in Lovecraft's magnum opus At the Mountains of Madness. Both authors shared many biographical similarities as well, such as the loss of their fathers at young ages and an early interest in poetry.\n\nHe was influenced by Arthur Machen's carefully constructed tales concerning the survival of ancient evil into modern times in an otherwise realistic world and his beliefs in hidden mysteries which lay behind reality. Lovecraft was also influenced by authors such as Oswald Spengler and Robert W. Chambers. Chambers was the writer of The King in Yellow, of whom Lovecraft wrote in a letter to Clark Ashton Smith: \"Chambers is like Rupert Hughes and a few other fallen Titans – equipped with the right brains and education but wholly out of the habit of using them\". Lovecraft's discovery of the stories of Lord Dunsany, with their pantheon of mighty gods existing in dreamlike outer realms, moved his writing in a new direction, resulting in a series of imitative fantasies in a \"Dreamlands\" setting.\n\nLovecraft also cited Algernon Blackwood as an influence, quoting The Centaur in the head paragraph of \"The Call of Cthulhu\". He declared Blackwood's story \"The Willows\" to be the single best piece of weird fiction ever written.\n\nAnother inspiration came from a completely different source: scientific progress in biology, astronomy, geology, and physics.Rottensteiner, F. (1992). Lovecraft as Philosopher. Science Fiction Studies, (1). 117. His study of science contributed to Lovecraft's view of the human race as insignificant, powerless, and doomed in a materialistic and mechanistic universe. Lovecraft was a keen amateur astronomer from his youth, often visiting the Ladd Observatory in Providence, and penning numerous astronomical articles for local newspapers. His astronomical telescope is now housed in the rooms of the August Derleth Society.\n\nLovecraft's materialist views led him to espouse his philosophical views through his fiction; these philosophical views came to be called cosmicism. Cosmicism took on a dark tone with his creation of what is today often called the Cthulhu Mythos, a pantheon of alien extra-dimensional deities and horrors which predate humanity, and which are hinted at in eons-old myths and legends. The term \"Cthulhu Mythos\" was coined by Lovecraft's correspondent and fellow author, August Derleth, after Lovecraft's death; Lovecraft jocularly referred to his artificial mythology as \"Yog-Sothothery\".\n\nLovecraft considered himself a man best suited to the early 18th century. His writing style, especially in his many letters, owes much to Augustan British writers of the Enlightenment like Joseph Addison and Jonathan Swift.\n\nAmong the books found in his library (as evidenced in Lovecraft's Library by S. T. Joshi) was The Seven Who Were Hanged by Leonid Andreyev and A Strange Manuscript Found in a Copper Cylinder by James De Mille.\n\nLovecraft's style has often been subject to criticism, yet scholars such as S. T. Joshi have shown that Lovecraft consciously utilized a variety of literary devices to form a unique style of his own – these include conscious archaism, prose-poetic techniques combined with essay-form techniques, alliteration, anaphora, crescendo, transferred epithet, metaphor, symbolism, and colloquialism.\n\nInfluence on culture \n\nLovecraft was relatively unknown during his own time. While his stories appeared in the pages of prominent pulp magazines such as Weird Tales (eliciting letters of outrage as often as letters of praise from regular readers), not many people knew his name. He did, however, correspond regularly with other contemporary writers such as Clark Ashton Smith and August Derleth,H.P. Lovecraft: Master of Weird Fiction. (2004). H.P. Lovecraft: Master of Weird Fiction, 8-40. who became good friends of his, even though they never met in person. This group of writers became known as the \"Lovecraft Circle\", since their writing freely borrowed elements of Lovecraft's stories, with his encouragement: the mysterious books with disturbing names, the pantheon of ancient alien entities such as Cthulhu and Azathoth, and eldritch places such as the New England town of Arkham and its Miskatonic University.\n\nAfter Lovecraft's death, the Lovecraft Circle carried on. August Derleth in particular added to and expanded on Lovecraft's vision, not without controversy. While Lovecraft considered his pantheon of alien gods a mere plot device, Derleth created an entire cosmology, complete with a war between the good Elder Gods and the evil Outer Gods, such as Cthulhu and his ilk. The forces of good were supposed to have won, locking Cthulhu and others up beneath the earth, in the ocean, and so forth. Derleth's Cthulhu Mythos stories went on to associate different gods with the traditional four elements of fire, air, earth and water — an artificial constraint which required rationalizations on Derleth's part as Lovecraft himself never envisioned such a scheme.\n\nLovecraft's fiction has been grouped into three categories by some critics. While Lovecraft did not refer to these categories himself, he did once write: \"There are my 'Poe' pieces and my 'Dunsany pieces' — but alas — where are any Lovecraft pieces?\"Letter to Elizabeth Toldridge, March 8, 1929, quoted in Lovecraft: A Look Behind the Cthulhu Mythos\n* Macabre stories ( 1905–1920);\n* Dream Cycle stories ( 1920–1927);\n* CthulhuLovecraft Mythos stories ( 1925–1935).\n\nLovecraft's writing, particularly the so-called Cthulhu Mythos, has influenced fiction authors including modern horror and fantasy writers. Stephen King, Ramsey Campbell, Bentley Little, Joe R. Lansdale, Alan Moore, Junji Ito, F. Paul Wilson, Brian Lumley, Caitlín R. Kiernan, William S. Burroughs, and Neil Gaiman, have cited Lovecraft as one of their primary influences. Beyond direct adaptation, Lovecraft and his stories have had a profound impact on popular culture. Some influence was direct, as he was a friend, inspiration, and correspondent to many of his contemporaries, such as August Derleth, Robert E. Howard, Robert Bloch and Fritz Leiber. Many later figures were influenced by Lovecraft's works, including author and artist Clive Barker, prolific horror writer Stephen King, Brian Keene has several novels based on the Old Gods, comics writers Alan Moore, Neil Gaiman and Mike Mignola, English author Colin Wilson, film directors John Carpenter, Stuart Gordon, Guillermo Del Toro and artist H. R. Giger.Giger, Hansruedi (2005): Necronomicon I & II. Erftstadt: Area. Japan has also been significantly inspired and terrified by Lovecraft's creations and thus even entered the manga and anime media. Chiaki J. Konaka is an acknowledged disciple and has participated in Cthulhu Mythos, expanding several Japanese versions. He is an anime scriptwriter who tends to add elements of cosmicism, and is credited for spreading the influence of Lovecraft among anime base. Along with Junji Ito, other influential manga artists have also been inspired by Lovecraft. Novelist and manga author, Hideyuki Kikuchi, incorporated a number of locations, beings and events from the works of Lovecraft into the manga Taimashin.\n\nArgentine writer Jorge Luis Borges wrote his short story \"There Are More Things\" in memory of Lovecraft. Contemporary French writer Michel Houellebecq wrote a literary biography of Lovecraft called H. P. Lovecraft: Against the World, Against Life. Prolific American writer Joyce Carol Oates wrote an introduction for a collection of Lovecraft stories. The Library of America published a volume of Lovecraft's work in 2005, a reversal of traditional judgment that \"has been nothing so far from the accepted canon as Lovecraft\". French philosophers Gilles Deleuze and Félix Guattari refer to Lovecraft in A Thousand Plateaus, calling the short story \"Through the Gates of the Silver Key\" one of his masterpieces.Deleuze, Gilles & Guattari, Félix (translated by Brian Massumi). A Thousand Plateaus. Minneapolis: University of Minnesota Press, 1993, p. 240, 539\n\nMusic\n\nLovecraft's fictional Mythos has influenced a number of musicians.\n* The psychedelic rock band H. P. Lovecraft (who shortened their name to Lovecraft and then Love Craft in the 1970s) released the albums H. P. Lovecraft and H. P. Lovecraft II in 1967 and 1968 respectively; their titles included \"The White Ship\" and \"At the Mountains of Madness\", both titled after Lovecraft stories. The founders of their record company, Bill Traut and George Badonsky, were fans of the author and gained August Derleth's permission to use Lovecraft's name for the band. \n* Metallica recorded a song inspired by \"The Call of Cthulhu\", an instrumental titled \"The Call of Ktulu\", and another song based on The Shadow Over Innsmouth titled \"The Thing That Should Not Be\", and another based on Frank Belknap Long's \"The Hounds of Tindalos\", titled \"All Nightmare Long\".\n* The Darkest of the Hillside Thickets' entire repertoire is Lovecraft-based.\n* German metal group Mekong Delta made an album called The Music of Erich Zann.\n* \"You're So Dark\", B-side from AM's \"One For The Road\", by Arctic Monkeys, mentions Lovecraft as one of the authors of the \"dark\" culture along with Edgar Allan Poe.\n* Heavy metal band Mercyful Fate produced \"The Mad Arab (Part 1)\" and \"Kutulu (The Mad Arab Part 2)\" on their albums Time and Into The Unknown based on Abdul Alhazred, the \"Mad Arab\" who created the Necronomicon in the Lovecraft universe.\n* \"Lovecraft in Brooklyn\" is the eighth track on the Mountain Goats' 2000 album Heretic Pride.\n* Deathrock band Rudimentary Peni's Cacophony (album) from 1988 was inspired by Lovecraft's work, as many of the song titles and lyrics are derived from his writing. Lead vocalist and guitarist Nick Blinko has cited his fascination with the Lovecraft mythos is what influenced him to create the album.\n*Cradle of Filth's song Mother of Abomibations begins with the chant, \"Ia Ia Chtulhu Ftagn\"\n\nGames\n\nLovecraft has also influenced gaming. Chaosium's role-playing game Call of Cthulhu (currently in its seventh major edition) has been in print for 30 years. The tabletop games Arkham Horror, Eldritch Horror, Mansions of Madness and Elder Sign include some themes derived from the Call of Cthulhu RPG. Three collectible card games are Mythos, Call of Cthulhu: The Living Card Game, and Arkham Horror: The Card Game.[https://www.fantasyflightgames.com/en/products/arkham-horror-the-card-game/ Arkham Horror: The Card Game | Fantasy Flight Games]. www.fantasyflightgames.com. With the rise in popularity of tabletop gaming, many other Lovecraft-themed games have been produced, for example (note that this is not an exhaustive list; it is a small selection from better-known designers and publishers):\n* Cthulhu Fluxx (Looney Labs) by Keith Baker with art by Derek Ring. This is a Lovecraft-themed version of the Fluxx series of games.\n* Cthulhu Gloom (Atlas Games) by Keith Baker with art by Todd Remick. This is a Lovecraft-themed version of the Gloom series of games.\n* Cthulhu Realms (Tasty Minstrel Games) by Darwin Kastle.\n* Cthulhu Wars (Green Eye Games/Petersen Games) by Sandy Petersen, original writer of the Call of Cthulhu RPG, and art by Richard Luong.\n* The Doom that Came to Atlantic City (Cryptozoic Entertainment) by Lee Moyer and Keith Baker, with miniatures by sculptor Paul Komoda.[https://www.cryptozoic.com/articles/cryptozoic-saves-doom-came-atlantic-city-board-game The Doom That Came to Atlantic City | Cryptozoic Entertainment]. Cryptozoic.com.\n* Kingsport Festival (Passport Game Studios) by Andrea Chiarvesio and Gianluca Santopietro. Based thematically on Lovecraft's The Festival and his fictional town of Kingsport from The Terrible Old Man.\n* Munchkin Cthulhu (Steve Jackson Games) by J. H. G. Hendricks and Steve Jackson. This is a Lovecraft-themed version of the Munchkin series of games.\n* The Stars are Right (Steve Jackson Games) by Klaus Westerhoff, with art by François Launet.\n* The Arkham Horror Files, a collection of games published by Fantasy Flight Games\nSeveral video games are based on or influenced heavily by Lovecraft such as Call of Cthulhu: Dark Corners of the Earth, Quest for Glory IV: Shadows of Darkness, Shadow of the Comet, The Lurking Horror, Prisoner of Ice, Shadowman, Alone in the Dark, Chzo Mythos, Eternal Darkness: Sanity's Requiem, Cthulhu Saves the World, Sherlock Holmes: The Awakened, Bloodborne, Darkest Dungeon, Dead Space, Splatterhouse, Darkness Within: In Pursuit of Loath Nolder, Darkness Within 2: The Dark Lineage, Blood, The Last Door, They Bleed Pixels, Sundered, the Megami Tensei franchise, Shadow Hearts, and Quake. The MMORPG The Secret World is heavily based on Lovecraftian lore. In The Elder Scrolls series, the Daedric Prince Hermaeus Mora and his realm of Oblivion, Apocrypha, are both heavily influenced by Lovecraft. The Old Gods featured in Blizzard Entertainment's Warcraft franchise are heavily influenced by Lovecraft's works. For example, the Old Gods C'Thun and Yogg-Saron have names that are very similar to Cthulhu and Yog-Sothoth, respectively.\nThe Evil Within 2 also has many references to Lovecraft's work, such as the names Dagon and Cthulhu.\n\nLovecraft as a character in fiction\n\nAside from his thinly veiled appearance in Robert Bloch's \"The Shambler from the Stars\", Lovecraft continues to be used as a character in supernatural fiction. An early version of Ray Bradbury's \"The Exiles\"Published in The Magazine of Fantasy & Science Fiction, Volume 1 No. 2 (Winter-Spring 1950), and later to become part of Bradbury's Martian Chronicles uses Lovecraft as a character, who makes a brief, 600-word appearance eating ice cream in front of a fire and complaining about how cold he is. Lovecraft and some associates are included at length in Robert Anton Wilson and Robert Shea's The Illuminatus! Trilogy (1975). Lovecraft makes an appearance as a rotting corpse in The Chinatown Death Cloud Peril by Paul Malmont, a novel with fictionalized versions of a number of period writers. John Shirley's story When Death Wakes Me To Myself offers a tale of a therapy patient slowly remembering a former incarnation when he was H.P. Lovecraft.\n\nOther notable works with Lovecraft as a character include Richard Lupoff's Lovecraft's Book (1985), Cast a Deadly Spell (1991), H.P. Lovecraft's: Necronomicon (1993), Witch Hunt (1994), Out of Mind: The Stories of H. P. Lovecraft (1998), Stargate SG-1: Roswell (2007), and Alan Moore's comic Providence (2015–17). Lovecraft also appears in the Season 6, Episode 21 episode \"Let it Bleed\" of the TV show Supernatural. A satirical version of Lovecraft named \"H. P. Hatecraft\" appeared as a recurring character on the Cartoon Network television series Scooby-Doo! Mystery Incorporated. A character based on Lovecraft also appears in the visual novel Shikkoku no Sharnoth: What a Beautiful Tomorrow, under the name \"Howard Phillips\" (or \"Mr. Howard\" to most of the main characters).. Another character based on Lovecraft appears in Afterlife with Archie.  He appears as a minor character in Brian Clevinger's comic book series Atomic Robo, as an acquaintance and fellow-scientist of Nikola Tesla, having been driven insane by his involvement in the Tunguska Event which exposed him to the hidden horrors of the wider universe. He is eventually killed when his body becomes host to an extradimensional being infecting the timestream.. Lovecraft is a central plot element, as well as a character in Paul La Farge's 2017 novel, The Night Ocean.\nIn the Japanese manga and anime Bungo Stray Dogs there is a character known as Howard Phillips Lovecraft who, like other characters in the series, is named after great literates. Even his power, “The Great Old Ones” pays homage to his classic book, The Call of Cthulhu, which grants him the ability of transforming himself into an octopus like monster resembling Cthulhu.\n\nThe short story \"The Invention of H. P. Lovecraft\" by S. K. Azoulay suggests that Lovecraft was a fictional creation invented by Jorge Luis Borges.[https://flapperhouse.com/2016/12/05/the-invention-of-h-p-lovecraft-fiction-by-shay-k-azoulay/ The Invention of H. P. Lovecraft] - by S. K. Azoulay. Flapperhouse Magazine, Fall 2016.\n\nEditions and collections of Lovecraft's work \n\nFor most of the 20th century, the definitive editions (specifically At the Mountains of Madness and Other Novels, Dagon and Other Macabre Tales, The Dunwich Horror and Others, and The Horror in the Museum and Other Revisions) of his prose fiction were published by Arkham House, a publisher originally started with the intent of publishing the work of Lovecraft, but which has since published a considerable amount of other literature as well. Penguin Classics has at present issued three volumes of Lovecraft's works: The Call of Cthulhu and Other Weird Stories, The Thing on the Doorstep and Other Weird Stories, and most recently The Dreams in the Witch House and Other Weird Stories. They collect the standard texts as edited by S. T. Joshi, most of which were available in the Arkham House editions, with the exception of the restored text of \"The Shadow Out of Time\" from The Dreams in the Witch House, which had been previously released by small-press publisher Hippocampus Press. In 2005 the prestigious Library of America canonized Lovecraft with a volume of his stories edited by Peter Straub, and Random House's Modern Library line have issued the \"definitive edition\" of Lovecraft's At the Mountains of Madness (also including \"Supernatural Horror in Literature\").\n\nLovecraft's poetry is collected in The Ancient Track: The Complete Poetical Works of H. P. Lovecraft (Night Shade Books, 2001), while much of his juvenilia, various essays on philosophical, political and literary topics, antiquarian travelogues, and other things, can be found in Miscellaneous Writings (Arkham House, 1989). Lovecraft's essay \"Supernatural Horror in Literature\", first published in 1927, is a historical survey of horror literature available with endnotes as The Annotated Supernatural Horror in Literature.\n\nLetters\n\nAlthough Lovecraft is known mostly for his works of weird fiction, the bulk of his writing consists of voluminous letters about a variety of topics, from weird fiction and art criticism to politics and history. Lovecraft's biographer L. Sprague de Camp estimates that Lovecraft wrote 100,000 letters in his lifetime, a fifth of which are believed to survive.\n\nHe sometimes dated his letters 200 years before the current date, which would have put the writing back in US colonial times, before the American Revolution (a war that offended his Anglophilia). He explained that he thought that the 18th and 20th centuries were the \"best\", the former being a period of noble grace, and the latter a century of science.\n\nLovecraft was not an active letter-writer in youth. In 1931 he admitted: \"In youth I scarcely did any letter-writing — thanking anybody for a present was so much of an ordeal that I would rather have written a two hundred fifty-line pastoral or a twenty-page treatise on the rings of Saturn.\" (SL 3.369–70). The initial interest in letters stemmed from his correspondence with his cousin Phillips Gamwell but even more important was his involvement in the amateur journalism movement, which was initially responsible for the enormous number of letters Lovecraft produced.\n\nDespite his light letter-writing in youth, in later life his correspondence was so voluminous that it has been estimated that he may have written around 30,000 letters to various correspondents, a figure which places him second only to Voltaire as an epistolarian. Lovecraft's later correspondence is primarily to fellow weird fiction writers, rather than to the amateur journalist friends of his earlier years.\n\nLovecraft clearly states that his contact to numerous different people through letter-writing was one of the main factors in broadening his view of the world: \"I found myself opened up to dozens of points of view which would otherwise never have occurred to me. My understanding and sympathies were enlarged, and many of my social, political, and economic views were modified as a consequence of increased knowledge.\" (SL 4.389).\n\nToday there are five publishing houses that have released letters from Lovecraft, most prominently Arkham House with its five-volume edition Selected Letters (these volumes severely abridge the letters they contain). Other publishers are Hippocampus Press (Letters to Alfred Galpin et al.), Night Shade Books (Mysteries of Time and Spirit: The Letters of H. P. Lovecraft and Donald Wandrei et al..), Necronomicon Press (Letters to Samuel Loveman and Vincent Starrett et al.), and University of Tampa Press (O Fortunate Floridian: H. P. Lovecraft's Letters to R. H. Barlow). S.T. Joshi is supervising an ongoing series of volumes collecting Lovecraft's unabridged letters to particular correspondents.\n\nLord of a Visible World: An Autobiography in Letters was published in 2000, in which Lovecraft's letters are arranged according to themes, such as adolescence and travel.\n\nCopyright\n\nDespite several claims to the contrary, there is currently no evidence that any company or individual owns the copyright to any of Lovecraft's work, and it is generally accepted that it has passed into the public domain.\n\nThere has been controversy over the copyright status of many of Lovecraft's works, especially his later works. Lovecraft had specified that the young R. H. Barlow would serve as executor of his literary estate, but these instructions had not been incorporated into his will. Nevertheless his surviving aunt carried out his expressed wishes, and Barlow was given charge of the massive and complex literary estate upon Lovecraft's death.\n\nBarlow deposited the bulk of the papers, including the voluminous correspondence, with the John Hay Library, and attempted to organize and maintain Lovecraft's other writing. August Derleth, an older and more established writer than Barlow, vied for control of the literary estate. One result of these conflicts was the legal confusion over who owned what copyrights.\n\nAll works published before 1923 are public domain in the US. With respect to works published later, ownership of the copyrights is disputed. Before the United States Copyright Act of 1976, copyright lasted for 28 years from publication and a work that did not have its copyright renewed passed into the public domain. The Copyright Act of 1976 retroactively extended this renewal period for all works to a period of 47 years[ftp://rtfm.mit.edu/pub/usenet/news.answers/law/copyright/faq/part2 Copyright Basics by Terry Carroll 1994] and the Sonny Bono Copyright Term Extension Act of 1998 added another 20 years to that, for a total of 95 years from publication. But everything turned on the renewal or expiration of copyright at the end of the first 28-year term.\n\nThe European Union Copyright Duration Directive of 1993 extended the copyrights to 70 years after the author's death. All of Lovecraft's works published during his lifetime became public domain in all 27 European Union countries on January 1, 2008. In those Berne Convention countries that have implemented only the minimum copyright period, copyright expires 50 years after the author's death.\n\nLovecraft protégés and part owners of Arkham House, August Derleth and Donald Wandrei, often claimed copyrights over Lovecraft's works. On October 9, 1947, Derleth purchased all rights to Weird Tales. However, since April 1926 at the latest, Lovecraft had reserved to himself all second printing rights to stories published in Weird Tales. Weird Tales may only have owned the rights to at most six of Lovecraft's tales. Again, even if Derleth did obtain the copyrights to Lovecraft's tales, there is no evidence that the copyrights were renewed. Following Derleth's death in 1971, his attorney proclaimed that all of Lovecraft's literary material was part of the Derleth estate and that it would be \"protected to the fullest extent possible.\"\n\nS. T. Joshi concludes in his biography of Lovecraft that Derleth's claims are \"almost certainly fictitious\" and that most of Lovecraft's works published in the amateur press are most likely now in the public domain. The copyright for Lovecraft's works would have been inherited by the only surviving heir named in his 1912 will, his aunt Annie Gamwell. When Gamwell died in 1941, the copyrights passed to her remaining descendants, Ethel Phillips Morrish and Edna Lewis, who then signed a document, sometimes referred to as the Morrish-Lewis gift, permitting Arkham House to republish Lovecraft's works while retaining the copyrights for themselves. Searches of the Library of Congress have failed to find any evidence that these copyrights were renewed after the 28-year period, making it likely that these works are now in the public domain.\n\nChaosium, publishers of the Call of Cthulhu role-playing game, have a trademark on the phrase \"The Call of Cthulhu\" for use in game products. TSR, Inc., original publisher of the Advanced Dungeons & Dragons role-playing game, included a section on the Cthulhu Mythos in one of the game's earlier supplements, Deities & Demigods (originally published in 1980 and later renamed to \"Legends & Lore\"). TSR later agreed to remove this section at Chaosium's request.\n\nIn 2009, Lovecraft Holdings, LLC, a company based out of Providence, filed trademark claims for clothing graphics of Lovecraft's name and silhouette.\n\nRegardless of the legal disagreements surrounding Lovecraft's works, Lovecraft himself was extremely generous with his own works and encouraged others to borrow ideas from his stories and build on them, particularly with regard to his Cthulhu Mythos. He encouraged other writers to reference his creations, such as the Necronomicon, Cthulhu and Yog-Sothoth. After his death, many writers have contributed stories and enriched the shared mythology of the Cthulhu Mythos, as well as making numerous references to his work.\n\nWorld Fantasy Award and H. P. Lovecraft controversy\n\nIn 1984, writer Donald Wandrei caused some controversy after he was offered a World Fantasy Award for Life Achievement but refused to accept it because the award was a bust of H. P. Lovecraft that he felt looked more like a caricature of Lovecraft than an actual representation.\n\nIn August 2014, author Daniel José Older started a petition to change the World Fantasy Award statuette from a bust of Lovecraft to one of African-American author Octavia Butler. Kevin J. Maroney, editor of The New York Review of Science Fiction, also supported the call for the WFA to be changed from Lovecraft's face, suggesting it be replaced with a symbol representing the fantasy genre. Maroney argued this should be done \"not out of disrespect for Lovecraft as a writer or as a central figure in fantasy, but as a courtesy to generations of writers whom the WFA hopes to honor.\" In response to the campaign, the board of the World Fantasy Awards announced in September 2014 that it was \"in discussion\" about the future of the award statuette, and in November 2015 it was announced that the World Fantasy Award trophy would no longer be modeled on H. P. Lovecraft.\n\nLocations featured in Lovecraft stories \n\nLovecraft drew extensively from his native New England for settings in his fiction. Numerous real historical locations are mentioned, and several fictional New England locations make frequent appearances.\n\nBibliography \n\nDocumentary biographies and movies portrayals \n\n* Howard Lovecraft and the Frozen Kingdom (2016 Canadian animated fictional movie inspired by the writings of H. P. Lovecraft). \n* Lovecraft: Fear of the Unknown (2008).\n* Weird Tales: The Strange Life of H. P. Lovecraft (2006).\n* La Herencia Valdemar II: La Sombra Prohibida (2010 Spanish movie inspired by Lovecraft where he was also portrayed in a small role)\n\nNotes. H. P. Lovecraft. http://en.wikipedia.org/?curid=13509."
  }
}
