{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17063",
  "eid" : "2a548a80-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778580264,
  "textBody" : "An East Asian bodhisattva Guanyin or Guan Yin[http://www.dictionary.com/browse/guanyin \"Guanyin\"]. Random House Webster's Unabridged Dictionary.  known for compassion and venerated by Mahayana Buddhists and followers of Chinese folk religions. Also  known as the \"Goddess of Mercy\" in English. The Chinese name Guanyin, short for Guanshiyin, means \"[The One Who] Perceives the Sounds of the World\". Vol I p. 2 \n\nSome Buddhists believe that when one of their adherents departs from this world, they are placed by Guanyin in the heart of a lotus, and then sent to the western Pure Land of Sukhāvatī. Guanyin is often referred to as the \"most widely beloved Buddhist Divinity\" with miraculous powers to assist all those who pray to her, as is said in the Lotus Sutra and Karandavyuha Sutra. \n\nSeveral large temples in East Asia are dedicated to Guanyin including Shitennō-ji, Sensō-ji, Kiyomizu-dera and Sanjūsangen-dō as well as Shaolin. Guanyin is beloved by all Buddhist traditions in a non-denominational way and found in most Tibetan temples under the name Chenrezig, and found in some influential Theravada temples such as Gangaramaya and Kelaniya of Sri Lanka. Statues are a widely depicted subject of Asian art and found in the Asian art sections of most museums in the world.\n\nGenerally accepted among East Asian adherents, Guanyin originated as the Bodhisattva Avalokiteśvara, but in Chinese folk religion, the mythical accounts about Guanyin's origins do not associate with the Avalokiteśvara described in Buddhist sutras.  Commonly known in English as the Mercy Goddess or Goddess of Mercy,  often depicted as both male and female to show this figure's limitless transcendence beyond gender[http://fathom.lse.ac.uk/seminars/21701773/21701773_session4.html Fathom.lse.ac.uk] , and revered by Taoists as an immortal.\n\nEtymology\n\nAvalokitasvara\n\nGuānyīn is a translation from the Sanskrit Avalokitasvara or Avalokiteśvara, referring to the Mahāyāna bodhisattva of the same name. Another later name for this bodhisattva is Guānzìzài (). It was initially thought that the Chinese mis-transliterated the word Avalokiteśvara as Avalokitasvara which explained why Xuanzang translated it as Guānzìzài instead of Guānyīn. However, the original form was indeed Avalokitasvara with the ending svara (\"sound, noise\"), which means \"sound perceiver\", literally \"he who looks down upon sound\" (i.e., the cries of sentient beings who need his help).Pine, Red. The Heart Sutra: The Womb of the Buddhas (2004) Shoemaker 7 Hoard.  pg 44–45 This is the exact equivalent of the Chinese translation Guānyīn. This etymology was furthered in the Chinese by the tendency of some Chinese translators, notably Kumarajiva, to use the variant Guānshìyīn, literally \"he who perceives the world's lamentations\"—wherein lok was read as simultaneously meaning both \"to look\" and \"world\" (Skt. loka; Ch. 世, shì).\n\nDirect translations from the Sanskrit name Avalokitasvara include:\n* Chinese: Guanyin (觀音), Guanshiyin (觀世音)[http://news.guoxue.com/article.php?articleid=26872 国学资讯 – 是“观世音”还是“观音”？——兼谈中国古典学的重要性]\n\nAvalokiteśvara\n\nThe name Avalokitasvara was later supplanted by the Avalokiteśvara form containing the ending -īśvara, which does not occur in Sanskrit before the seventh century. The original form Avalokitasvara appears in Sanskrit fragments of the fifth century. The original meaning of the name \"Avalokitasvara\" fits the Buddhist understanding of the role of a bodhisattva. The reinterpretation presenting him as an īśvara shows a strong influence of Śaivism, as the term īśvara was usually connected to the Hindu notion of Śiva as a creator god and ruler of the world.\n\nWhile some of those who revered Avalokiteśvara upheld the Buddhist rejection of the doctrine of any creator god, Encyclopædia Britannica does cite Avalokiteśvara as the creator god of the world. This position is taken in the widely used Karandavyuha Sutra with its well-known mantra Oṃ maṇi padme hūṃ. In addition, the Lotus Sutra is the first time the Avalokiteśvara is mentioned. Chapter 25 refers to him as Lokeśvara (Lord God of all beings) and Lokenath (Lord and Protector of all beings) and ascribes extreme attributes of divinity to him. \n\nDirect translations from the Sanskrit name Avalokiteśvara include:\n* \n* , THL Chenrézik\n\nNames in other Asian languages\n\nDue to the devotional popularity of Guanyin in Asia, she is known by many names, most of which are simply the localised pronunciations of \"Guanyin\" or \"Guanshiyin\":\n* The name is pronounced Gwun Yam or Gun Yam in Cantonese Chinese, also written as Kwun Yam in Hong Kong or Kun Iam in Macau.\n* In Hokkien, she is called Kuan Im (POJ: Koan-im) or Kuan Se Im (POJ: Koan-sè-im)\n* In Japanese, Guanyin is pronounced Kannon (), occasionally Kan'on, or more formally Kanzeon (, the same characters as Guanshiyin); the spelling Kwannon, based on a premodern pronunciation, is sometimes seen. This rendition was used for an earlier spelling of the well-known camera manufacturer Canon Inc., which was named for Guanyin.  When iconography of Kannon depicts her with the Nyoihōju (如意宝珠) wishing gem she is known as Nyoirin Kannon (如意輪 観音), which is the Japanese adaptation of the Hindu deity Cintamanicakra.\n* In Korean, Guanyin is called Gwan-eum () or Gwanse-eum ().\n* In Thai's pronunciation duplicate from Hokkien Kuan Im (), Phra Mae Kuan Im () or Chao Mae Kuan Im ().\n* In Burmese, the name of Guanyin is Kwan Yin Medaw, literally meaning Mother Kwan Yin (Goddess Guanyin) ().\n* In Vietnamese, the name is Quan Âm or Quán Thế Âm.\n* In Indonesian, the name is Kwan Im or Dewi Kwan Im. She is also called Mak Kwan Im \"Mother Guanyin\".\n* In Malaysian Mandarin, the name is GuanYin Pusa (GuanYin Bodhisattva), Guan Shi Yin Pusa (GuanYin Bodhisattva).\n* In Khmer, the name is Preah Mae Kun Ci Iem.\n* In Sinhalese, the name is Natha Deviyo ().\n* In Tibetan, the name is Chenrézik ().\n* In Hmong, the name is Kab Yeeb.\n\nIn these same countries, the variant Guanzizai \"Lord of Contemplation\" and its equivalents are also used, such as in the Heart Sutra, among other sources.\n\nDepiction\n\nLotus Sūtra\n\nThe Lotus Sūtra (Sanskrit Saddharma Puṇḍarīka Sūtra) is generally accepted to be the earliest literature teaching about the doctrines of Avalokiteśvara.Huntington, John (2003). The Circle of Bliss: Buddhist Meditational Art: p. 188 These are found in the twenty fifth chapter of the Lotus Sūtra. This chapter is devoted to Avalokitesvara, describing him as a compassionate bodhisattva who hears the cries of sentient beings, and who works tirelessly to help those who call upon his name. This Chapter also places Avalokiteshwara as Higher than any other being in the Buddhist Cosmology stating that \"if one were to pray with true devotion to Avalokiteshwara for one second, they would generate more blessings than if one worshiped with all types of offerings as many Gods as there are in the grains of sand of 62 Ganges Rivers for an entire lifetime\". As a result, Avalokiteshwara is often considered the most beloved Buddhist Divinity and is venerated in many important temples including Shitennoji, the first official temple of Japan, Sensoji, the oldest temple of Tokyo, Kiyomizu-dera and Sanjusangendo which are the two most visited temples in Kyoto.\n\nThe Lotus Sutra describes Avalokiteśvara as a bodhisattva who can take the form of any type of God including Indra or Brahma; any type of Buddha, any type of King or Chakravartin or even any kind of Heavenly Guardian including Vajrapani and Vaisravana as well as any gender male or female, adult or child, human or non-human being, in order to teach the Dharma to sentient beings.Kubo Tsugunari, Yuyama Akira (tr.). [https://web.archive.org/web/20150521183528/http://www.bdkamerica.org/digital/dBET_T0262_LotusSutra_2007.pdf The Lotus Sutra]. Revised 2nd ed. Berkeley, Calif.: Numata Center for Buddhist Translation and Research, 2007. , pp. 311–312 Folk traditions in China and other East Asian countries have added many distinctive characteristics and legends to Guanyin c.q. Avalokiteśvara. Avalokiteśvara was originally depicted as a male bodhisattva, and therefore wears chest-revealing clothing and may even sport a light moustache. Although this depiction still exists in the Far East, Guanyin is more often depicted as a woman in modern times. Additionally, some people believe that Guanyin is androgynous or perhaps without gender. P. 26\n\nA total of 33 different manifestations of Avalokitasvara are described, including female manifestations, all to suit the minds of various beings. Chapter 25 consists of both a prose and a verse section. This earliest source often circulates separately as its own sūtra, called the Avalokitasvara Sūtra (Ch. 觀世音經), and is commonly recited or chanted at Buddhist temples in East Asia.Baroni, Helen (2002). The Illustrated Encyclopedia of Zen Buddhism: p. 15 The Lotus Sutra and its thirty-three manifestations of Guanyin, of which seven are female manifestations, is known to have been very popular in Chinese Buddhism as early as in the Sui and Tang dynasties.Tan Chung. Across the Himalayan Gap: An Indian Quest for Understanding China. 1998. p. 222 Additionally, Tan Chung notes that according to the doctrines of the Mahāyāna sūtras themselves, it does not matter whether Guanyin is male, female, or genderless, as the ultimate reality is in emptiness (Skt. śūnyatā).\n\nIconography\n\nRepresentations of the bodhisattva in China prior to the Song dynasty (960–1279) were masculine in appearance. Images which later displayed attributes of both genders are believed to be in accordance with the Lotus Sutra, where Avalokitesvara has the supernatural power of assuming any form required to relieve suffering, and also has the power to grant children. Because this bodhisattva is considered the personification of compassion and kindness, a mother goddess and patron of mothers and seamen, the representation in China was further interpreted in an all-female form around the 12th century. In the modern period, Guanyin is most often represented as a beautiful, white-robed woman, a depiction which derives from the earlier Pandaravasini form.\n\nIn some Buddhist temples and monasteries, Guanyin's image is occasionally that of a young man dressed in Northern Song Buddhist robes and seated gracefully. He is usually depicted looking or glancing down, symbolising that Guanyin continues to watch over the world.\n\nIn China, Guanyin is generally portrayed as a young woman donned in a flowing white robe and usually wearing necklaces symbolic of Indian or Chinese royalty. In her left hand is a jar containing pure water, and the right holds a willow branch. The crown usually depicts the image of Amitābha.\n\nThere are also regional variations of Guanyin depictions. In Fujian, for example, a popular depiction of Guanyin is as a maiden dressed in Tang hanfu carrying a fish basket. A popular image of Guanyin as both Guanyin of the South Sea and Guanyin with a Fish Basket can be seen in late 16th-century Chinese encyclopedias and in prints that accompany the novel Golden Lotus.\n\nIn Chinese art, Guanyin is often depicted either alone, standing atop a dragon, accompanied by a white cockatoo and flanked by two children or two warriors. The two children are her acolytes who came to her when she was meditating at Mount Putuo. The girl is called Longnü and the boy Shancai. The two warriors are the historical general Guan Yu from the late Han dynasty and the bodhisattva Skanda, who appears in the Chinese classical novel Fengshen Yanyi. The Buddhist tradition also displays Guanyin, or other buddhas and bodhisattvas, flanked with the above-mentioned warriors, but as bodhisattvas who protect the temple and the faith itself.\n\nLegends\n\nGuanyin and the Thousand Arms\n\nIn the Karandavyuha Sutra, Avalokiteshwara is called \"The One With A Thousand Arms and Thousand eyes\" and is described as superior to all Gods and Buddhas of the Indian pantheon. The Sutra also states that \"it is easier to count all the leaves of every tree of every forest and all the grains of sand in the universe than to count the blessings and power of Avalokiteshwara\". This version of Avalokiteshwara with a thousand arms depicting the power of all Gods also shows various Buddhas in the crown depicting the wisdom of all Buddhas. It is called Senju Kannon in Japan and 1000 statues of this nature can be found at the popular Sanjusangendo temple of Kyoto.\n\nOne Buddhist legend from the Complete Tale of Guanyin and the Southern Seas () presents Guanyin as vowing to never rest until she had freed all sentient beings from saṃsāra or cycle of rebirth. Despite strenuous effort, she realised that there were still many unhappy beings yet to be saved. After struggling to comprehend the needs of so many, her head split into eleven pieces. The buddha Amitābha, upon seeing her plight, gave her eleven heads to help her hear the cries of those who are suffering. Upon hearing these cries and comprehending them, Avalokiteśvara attempted to reach out to all those who needed aid, but found that her two arms shattered into pieces. Once more, Amitābha came to her aid and appointed her a thousand arms to let her reach out to those in need.\n\nMany Himalayan versions of the tale include eight arms with which Avalokitesvara skillfully upholds the dharma, each possessing its own particular implement, while more Chinese-specific versions give varying accounts of this number.\n\nIn China, it is said that fishermen used to pray to her to ensure safe voyages. The titles Guanyin of the Southern Ocean (南海觀音) and \"Guanyin (of/on) the Island\" stem from this tradition.\n\nLegend of Miaoshan\n\nAnother story from the Precious Scroll of Fragrant Mountain (香山寶卷) describes an incarnation of Guanyin as the daughter of a cruel king who wanted her to marry a wealthy but uncaring man. The story is usually ascribed to the research of the Buddhist monk Jiang Zhiqi during the 11th century. The story is likely to have its origin in Taoism. When Chiang penned the work, he believed that the Guanyin we know today was actually a princess called Miaoshan (妙善), who had a religious following on Fragrant Mountain. Despite this there are many variants of the story in Chinese mythology.[http://blog.sina.com.cn/s/blog_6d02fe8d0101b2xr.html 香山寶卷（1）_蒋建达_新浪博客]\n\nAccording to the story, after the king asked his daughter Miaoshan to marry the wealthy man, she told him that she would obey his command, so long as the marriage eased three misfortunes.\n\nThe king asked his daughter what were the three misfortunes that the marriage should ease. Miaoshan explained that the first misfortune the marriage should ease was the suffering people endure as they age. The second misfortune it should ease was the suffering people endure when they fall ill. The third misfortune it should ease was the suffering caused by death. If the marriage could not ease any of the above, then she would rather retire to a life of religion forever.\n\nWhen her father asked who could ease all the above, Miaoshan pointed out that a doctor was able to do all of these. Her father grew angry as he wanted her to marry a person of power and wealth, not a healer. He forced her into hard labour and reduced her food and drink but this did not cause her to yield.\n\nEvery day she begged to be able to enter a temple and become a nun instead of marrying. Her father eventually allowed her to work in the temple, but asked the monks to give her the toughest chores in order to discourage her. The monks forced Miaoshan to work all day and all night while others slept in order to finish her work. However, she was such a good person that the animals living around the temple began to help her with her chores. Her father, seeing this, became so frustrated that he attempted to burn down the temple. Miaoshan put out the fire with her bare hands and suffered no burns. Now struck with fear, her father ordered her to be put to death.\n\nIn one version of this legend, when Guanyin was executed, a supernatural tiger took her to one of the more hell-like realms of the dead.  However, instead of being punished like the other spirits of the dead, Guanyin played music, and flowers blossomed around her. This completely surprised the hell guardian. The story says that Guanyin, by merely being in that Naraka (hell), turned it into a paradise.\n\nA variant of the legend says that Miaoshan allowed herself to die at the hand of the executioner. According to this legend, as the executioner tried to carry out her father's orders, his axe shattered into a thousand pieces. He then tried a sword which likewise shattered. He tried to shoot Miaoshan down with arrows but they all veered off.\n\nFinally in desperation he used his hands. Miaoshan, realising the fate that the executioner would meet at her father's hand should she fail to let herself die, forgave the executioner for attempting to kill her. It is said that she voluntarily took on the massive karmic guilt the executioner generated for killing her, thus leaving him guiltless. It is because of this that she descended into the Hell-like realms. While there, she witnessed first-hand the suffering and horrors that the beings there must endure, and was overwhelmed with grief. Filled with compassion, she released all the good karma she had accumulated through her many lifetimes, thus freeing many suffering souls back into Heaven and Earth. In the process, that Hell-like realm became a paradise. It is said that Yama, the ruler of hell, sent her back to Earth to prevent the utter destruction of his realm, and that upon her return she appeared on Fragrant Mountain.\n\nAnother tale says that Miaoshan never died, but was in fact transported by a supernatural tiger, believed to be the Deity of the Place, to Fragrant Mountain.\n\nThe legend of Miaoshan usually ends with Miaozhuangyan, Miaoshan's father, falling ill with jaundice. No physician was able to cure him. Then a monk appeared saying that the jaundice could be cured by making a medicine out of the arm and eye of one without anger. The monk further suggested that such a person could be found on Fragrant Mountain. When asked, Miaoshan willingly offered up her eyes and arms. Miaozhuangyan was cured of his illness and went to the Fragrant Mountain to give thanks to the person. When he discovered that his own daughter had made the sacrifice, he begged for forgiveness. The story concludes with Miaoshan being transformed into the Thousand Armed Guanyin, and the king, queen and her two sisters building a temple on the mountain for her.  She began her journey to a pure land and was about to cross over into heaven when she heard a cry of suffering from the world below.  She turned around and saw the massive suffering endured by the people of the world. Filled with compassion, she returned to Earth, vowing never to leave till such time as all suffering has ended.\n\nAfter her return to Earth, Guanyin was said to have stayed for a few years on the island of Mount Putuo where she practised meditation and helped the sailors and fishermen who got stranded. Guanyin is frequently worshipped as patron of sailors and fishermen due to this. She is said to frequently becalm the sea when boats are threatened with rocks. After some decades Guanyin returned to Fragrant Mountain to continue her meditation.\n\nGuanyin and Shancai\n\nLegend has it that Shancai (also called Sudhana in Sanskrit) was a disabled boy from India who was very interested in studying the dharma. When he heard that there was a Buddhist teacher on the rocky island of Putuo he quickly journeyed there to learn. Upon arriving at the island, he managed to find Guanyin despite his severe disability.\n\nGuanyin, after having a discussion with Shancai, decided to test the boy's resolve to fully study the Buddhist teachings. She conjured the illusion of three sword-wielding pirates running up the hill to attack her. Guanyin took off and dashed to the edge of a cliff, the three illusions still chasing her.\n\nShancai, seeing that his teacher was in danger, hobbled uphill. Guanyin then jumped over the edge of the cliff, and soon after this the three bandits followed. Shancai, still wanting to save his teacher, managed to crawl his way over the cliff edge.\n\nShancai fell down the cliff but was halted in midair by Guanyin, who now asked him to walk. Shancai found that he could walk normally and that he was no longer crippled. When he looked into a pool of water he also discovered that he now had a very handsome face. From that day forth, Guanyin taught Shancai the entire dharma.\n\nGuanyin and Longnü\n\nMany years after Shancai became a disciple of Guanyin, a distressing event happened in the South China Sea. The third son of one of the Dragon Kings was caught by a fisherman while swimming in the form of a fish. Being stuck on land, he was unable to transform back into his dragon form. His father, despite being a mighty Dragon King, was unable to do anything while his son was on land. Distressed, the son called out to all of Heaven and Earth.\n\nHearing this cry, Guanyin quickly sent Shancai to recover the fish and gave him all the money she had. The fish at this point was about to be sold in the market. It was causing quite a stir as it was alive hours after being caught. This drew a much larger crowd than usual at the market. Many people decided that this prodigious situation meant that eating the fish would grant them immortality, and so all present wanted to buy the fish. Soon a bidding war started, and Shancai was easily outbid.\n\nShancai begged the fish seller to spare the life of the fish. The crowd, now angry at someone so daring, was about to pry him away from the fish when Guanyin projected her voice from far away, saying \"A life should definitely belong to one who tries to save it, not one who tries to take it.\"\n\nThe crowd, realising their shameful actions and desire, dispersed. Shancai brought the fish back to Guanyin, who promptly returned it to the sea. There the fish transformed back to a dragon and returned home. Paintings of Guanyin today sometimes portray her holding a fish basket, which represents the aforementioned tale.\n\nBut the story does not end there.  As a reward for Guanyin saving his son, the Dragon King sent his granddaughter, a girl called Longnü (\"dragon girl\"), to present Guanyin with the Pearl of Light. The Pearl of Light was a precious jewel owned by the Dragon King that constantly shone. Longnü, overwhelmed by the presence of Guanyin, asked to be her disciple so that she might study the dharma. Guanyin accepted her offer with just one request: that Longnü be the new owner of the Pearl of Light.\n\nIn popular iconography, Longnü and Shancai are often seen alongside Guanyin as two children. Longnü is seen either holding a bowl or an ingot, which represents the Pearl of Light, whereas Shancai is seen with palms joined and knees slightly bent to show that he was once crippled.\n\nGuanyin and the Filial Parrot\n\nThe Precious Scroll of the Parrot () tells the story of a parrot who becomes a disciple of Guanyin.  During the Tang Dynasty a small parrot ventures out to search for its mother's favourite food upon which it is captured by a poacher (parrots were quite popular during the Tang Dynasty).  When it managed to escape it found out that its mother had already died.  The parrot grieved for its mother and provides her with a proper funeral.  It then sets out to become a disciple of Guanyin.\n\nIn popular iconography, the parrot is coloured white and usually seen hovering to the right side of Guanyin with either a pearl or a prayer bead clasped in its beak.  The parrot becomes a symbol of filial piety.\n\nGuanyin and Chen Jinggu\n\nWhen the people of Quanzhou, Fujian could not raise enough money to build a bridge, Guanyin changed into a beautiful maiden. Getting on a boat, she offered to marry any man who could hit her with a piece of silver from the edge of the water. Due to many people missing, she collected a large sum of money in her boat. However, Lü Dongbin, one of the Eight Immortals, helped a merchant hit Guanyin in the hair with silver powder, which floated away in the water. Guanyin bit her finger and a drop of blood fell into the water, but she vanished. This blood was swallowed by a washer woman, who gave birth to Chen Jinggu (陳靖姑) or Lady Linshui (臨水夫人); the hair was turned into a female white snake and sexually used men and killed rival women. The snake and Chen were to be mortal enemies. The merchant was sent to be reborn as Liu Qi (劉杞).\n\nChen was a beautiful and talented girl, but did not wish to marry Liu Qi. Instead, she fled to Mount Lu in Jiangxi, where she learned many Taoist skills. Destiny eventually caused her to marry Liu and she became pregnant. A drought in Fujian caused many people to ask her to call for rain, which was a ritual that could not be performed while pregnant. She temporarily aborted her child, which was killed by the white snake. Chen managed to kill the snake with a sword, but died either of a miscarriage or hemorrhage; she was able to complete the ritual, and ended drought.\n\nThis story is popular in Zhejiang, Taiwan, and especially Fujian.\n\nQuan Am Thi Kinh\n\nQuan Am Thi Kinh (觀音氏敬) is a Vietnamese verse recounting the life of a woman, Thi Kinh. She was accused falsely of having intended to kill her husband, and when she disguised herself as a man to lead a religious life in a Buddhist temple, she was again falsely blamed for having committed sexual intercourse with a girl named Thi Mau. She was accused of impregnating her, which was strictly forbidden by Buddhist law. However, thanks to her endurance of all indignities and her spirit of self-sacrifice, she could enter into Nirvana and became Goddess of Mercy (Phat Ba Quan Am) P. Q. Phan's 2014 opera ' is based on this story.[http://music.indiana.edu/events/program.php?eid=57594 The Tale of Lady Thị Kính], program booklet, February 2014\n\nJourney To The West\n\nNext to Sun Wu Kong, the monkey king himself, there is no supernatural entity more important to the famous myths from China about a strange mystical monkey, a couple of exiled gods, a dragon, and a priest trying to bring sacred scrolls back to China than her. She delivered the ring that let the priest control the monkey king. She informed all those involved of their great place in the quest which allowed most of them to reach enlightenment. When a demon was too powerful or tricky even for the monkey king she came to their rescue. And when the monkey king was feeling like abandoning the quest she managed to talk him into returning.\n\nAssociation with vegetarianism\n\nDue to her symbolization of compassion, in East Asia, Guanyin is associated with vegetarianism. Buddhist cuisine is generally decorated with her image and she appears in most Buddhist vegetarian pamphlets and magazines.\n\nRole in East Asian Buddhism\n\nIn East Asian Buddhism, Guanyin is the bodhisattva Avalokiteśvara. Among the Chinese, Avalokiteśvara is almost exclusively called Guanshiyin Pusa (觀世音菩薩). The Chinese translation of many Buddhist sutras has in fact replaced the Chinese transliteration of Avalokitesvara with Guanshiyin (觀世音). Some Taoist scriptures give her the title of Guanyin Dashi, sometimes informally Guanyin Fozu.\n\nIn Chinese culture, the popular belief and worship of Guanyin as a goddess by the populace is generally not viewed to be in conflict with the bodhisattva Avalokitesvara's nature. In fact the widespread worship of Guanyin as a \"Goddess of Mercy and Compassion\" is seen by Buddhists as the boundless salvific nature of bodhisattva Avalokiteśvara at work (in Buddhism, this is referred to as Guanyin's \"skillful means\", or upaya). The Buddhist canon states that bodhisattvas can assume whatsoever gender and form is needed to liberate beings from ignorance and dukkha. With specific reference to Avalokitesvara, he is stated both in the Lotus Sutra (Chapter 25 \"Perceiver of the World's Sounds\" or \"Universal Gateway\"),  and the Śūraṅgama Sūtra to have appeared before as a woman or a goddess to save beings from suffering and ignorance. Some Buddhist schools refer to Guanyin both as male and female interchangeably.\n\nIn Mahayana Buddhism, gender is no obstacle to attaining enlightenment (or nirvana). The Buddhist concept of non-duality applies here. The Vimalakirti Sutras \"Goddess\" chapter clearly illustrates an enlightened being who is also a female and deity. In the Lotus Sutra, a maiden became enlightened in a very short time span. The view that Avalokiteśvara is also the goddess Guanyin does not seem contradictory to Buddhist beliefs. Guanyin has been a buddha called the \"Tathāgata of Brightness of Correct Dharma\" (正法明如來).[http://www.cbeta.org/result/normal/T20/1060_001.htm 《千手千眼觀世音菩薩廣大圓滿無礙大悲心陀羅尼經》 卷1] \n\nGiven that bodhisattvas are known to incarnate at will as living people according to the sutras, the princess Miaoshan is generally viewed by Buddhists as an incarnation of Guanyin.\n\nGuanyin is immensely popular among Chinese Buddhists, especially those from devotional schools. She is generally seen as a source of unconditional love and, more importantly, as a saviour. In her bodhisattva vow, Guanyin promises to answer the cries and pleas of all sentient beings and to liberate them from their own karmic woes. Based on the Lotus Sutra and the Shurangama sutra, Avalokitesvara is generally seen as a saviour, both spiritually and physically. The sutras state that through his saving grace even those who have no chance of being enlightened can be enlightened, and those deep in negative karma can still find salvation through his compassion.\n\nIn Pure Land Buddhism, Guanyin is described as the \"Barque of Salvation\". Along with Amitābha and the bodhisattva Mahasthamaprapta, she temporarily liberates beings out of the Wheel of Samsara into the Pure Land, where they will have the chance to accrue the necessary merit so as to be a Buddha in one lifetime. In Chinese Buddhist iconography, Guanyin is often depicted as meditating or sitting alongside one of the Buddhas and usually accompanied by another bodhisattva. The buddha and bodhisattva that are portrayed together with Guanyin usually follow whichever school of Buddhism they represent. In Pure Land Buddhism, for example, Guanyin is frequently depicted on the left of Amitābha, while on the buddha's right is Mahasthamaprapta. Temples that revere the bodhisattva Ksitigarbha usually depict him meditating beside Amitābha and Guanyin.\n\nEven among Chinese Buddhist schools that are non-devotional, Guanyin is still highly venerated. Instead of being seen as an active external force of unconditional love and salvation, the personage of Guanyin is highly revered as the principle of compassion, mercy and love. The act, thought and feeling of compassion and love is viewed as Guanyin. A merciful, compassionate, loving individual is said to be Guanyin. A meditative or contemplative state of being at peace with oneself and others is seen as Guanyin.\n\nIn the Mahayana canon, the Heart Sutra is ascribed entirely to Guanyin. This is unique, since most Mahayana Sutras are usually ascribed to Gautama Buddha and the teachings, deeds or vows of the bodhisattvas are described by Shakyamuni Buddha. In the Heart Sutra, Guanyin describes to the arhat Sariputta the nature of reality and the essence of the Buddhist teachings. The famous Buddhist saying \"Form is emptiness, emptiness is form\" (色即是空，空即是色) comes from this sutra.\n\nRole in other religions\n\nGuanyin is an extremely popular goddess in Chinese folk religion and is worshiped in many Chinese communities throughout East and South East Asia.[http://www.fjdh.com/wumin/HTML/82218.html 於君方：《偽經》與觀音信仰][http://www.gywh.net/guanyin/xingxiang.shtml 中國觀音文化促进會 观音形象] [http://bzzz.china84000.com/Article/sjyj/200807/Article_10.html 中国观音信仰的基本体系-宝藏杂志][http://www.fjnet.com/fjlw/200811/t20081117_92282.htm 信仰研究现状评析—李利安-学术论文-佛教在线] In Taoism, records claim Guanyin was a Chinese woman who became an immortal, Cihang Zhenren in Shang Dynasty or Xingyin (姓音).[http://hi.baidu.com/axblog/blog/item/c7381508163b6530e924887f.html 太上碧落洞天慈航灵感度世宝忏起赞_仙道贵生。无量度人_百度空间]\n\nGuanyin is revered in the general Chinese population due to her unconditional love and compassion. She is generally regarded by many as the protector of women and children. By this association, she is also seen as a fertility goddess capable of granting children to couples. An old Chinese superstition involves a woman who, wishing to have a child, offers a shoe to Guanyin. In Chinese culture, a borrowed shoe sometimes is used when a child is expected. After the child is born, the shoe is returned to its owner along with a new pair as a thank you gift.\n\nGuanyin is also seen as the champion of the unfortunate, the sick, the disabled, the poor, and those in trouble. Some coastal and river areas of China regard her as the protector of fishermen, sailors, and generally people who are out at sea, thus many have also come to believe that Mazu, the goddess of the sea, is a manifestation of Guanyin. Due to her association with the legend of the Great Flood, where she sent down a dog holding rice grains in its tail after the flood, she is worshiped as an agrarian and agriculture goddess. In some quarters, especially among business people and traders, she is looked upon as a goddess of fortune. In recent years there have been claims of her being the protector of air travelers.\n\nGuanyin is also a ubiquitous figure found within the new religious movements of Asia:\n* Within the Taiwan-based Yiguandao sect, Guanyin is called the \"Ancient Buddha of the South Sea\" (南海古佛) and frequently appears in their fuji. Guanyin is sometimes confused with Yue Hui Bodhisattva due to their similar appearance.[http://www.gaya.org.tw/magazine/v1/2005/64/64hk1.htm 香光莊嚴第六十四期/歷史/觀音老母]\n* Guanyin is called the \"Ancient Buddha of the Holy Religion\" (聖宗古佛) in Zailiism and in the teachings of the Lord of Universe Church. In Zailiism she is the main deity worshipped.\n* Ching Hai initiates her followers a meditation method called the \"Quan Yin Method\" to achieve enlightenment; followers also revere Ching Hai as an incarnation of Guanyin.\n* Guanyin, known as \"Quan Am Tathagata\" (Quan Âm Như Lai) in the Cao Dai religion, is considered a Buddha and a teacher. She represents Buddhist doctrines and traditions as one of the three major lines of Cao Dai doctrines (Buddhism, Taoism, and Confucianism). She also symbolizes utmost patience, harmony, and compassion. According to her Divine messages via seances, her main role is to teach the Tao to female disciples, and guide them towards divinity. Another of her well-known role is to save people from extreme sufferings, e.g. fire, drowning, wrong accusation/ imprisonment, etc. There is even a prayer named \"Salvation from sufferings\" for followers to cite in dire conditions.\n\nSimilarity to the Virgin Mary\n\nSome Buddhist and Christian observers have commented on the similarity between Guanyin and the Blessed Virgin Mary. This can be attributed to the representation of Guanyin holding a child in Chinese art and sculpture; it is believed that Guanyin is the patron saint of mothers and grants parents filial children, this apparition is popularly known as the \"Child-Sending Guanyin\" (送子觀音). One example of this comparison can be found in the Tzu Chi Foundation, a Taiwanese Buddhist humanitarian organisation, which noticed the similarity between this form of Guanyin and the Virgin Mary. The organisation commissioned a portrait of Guanyin holding a baby, closely resembling the typical Roman Catholic Madonna and Child painting. Copies of this portrait are now displayed prominently in Tzu Chi affiliated medical centres, especially since Tzu Chi's founder is a Buddhist master but her supporters come from all walks of religious life. \n\nDuring the Edo Period in Japan, when Christianity was banned and punishable by death, some underground Christian groups venerated Jesus and the Virgin Mary by disguising them as statues of Kannon holding a child; such statues are known as Maria Kannon. Many had a cross hidden in an inconspicuous location.\n\nIt is suggested the similarity comes from the conquest and colonization of the Philippines by Spain during the 16th century, when Asian cultures influenced engravings of the Virgin Mary, as evidenced, for example, in an ivory carving of the Virgin Mary by a Chinese carver. (mp4 audio, requires Apple QuickTime).\n\nThe statue of Guanyin (Gwanse-eum) in Gilsangsa Temple in Seoul, South Korea was sculpted by Catholic sculptor Choi Jong-tae, who modeled the statue after the Virgin Mary in hopes of fostering religious reconciliation in Korean society.\n\nIn popular culture\n\nIn the 1946 film Three Strangers the titular characters wish for a shared sweepstakes ticket to win before a statue of Guanyin, referred to in the film as Kwan Yin.\n\nFor a 2005 Fo Guang Shan TV series, Andy Lau performed the song Kwun Sai Yam, which emphasizes the idea that everyone can be like Guanyin.:zh:观世音 (2005年电视剧)[http://www.bdcitta.net/kanwu/fubao/zhuanti/2010-07-20/565.html 观音老人悟明长老 毕生弘扬大悲忏] \n\nFantasy author Richard Parks has frequently utilized Guanyin as a character in his fiction, most notably in the short story \"The White Bone Fan\" (2009), the novella The Heavenly Fox (2011), and the novel All the Gates of Hell (2013).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Guanyin" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17063" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "An East Asian bodhisattva Guanyin or Guan Yin[http://www.dictionary.com/browse/guanyin \"Guanyin\"]. Random House Webster's Unabridged Dictionary.  known for compassion and venerated by Mahayana Buddhists and followers of Chinese folk religions. Also  known as the \"Goddess of Mercy\" in English. The Chinese name Guanyin, short for Guanshiyin, means \"[The One Who] Perceives the Sounds of the World\". Vol I p. 2 \n\nSome Buddhists believe that when one of their adherents departs from this world, they are placed by Guanyin in the heart of a lotus, and then sent to the western Pure Land of Sukhāvatī. Guanyin is often referred to as the \"most widely beloved Buddhist Divinity\" with miraculous powers to assist all those who pray to her, as is said in the Lotus Sutra and Karandavyuha Sutra. \n\nSeveral large temples in East Asia are dedicated to Guanyin including Shitennō-ji, Sensō-ji, Kiyomizu-dera and Sanjūsangen-dō as well as Shaolin. Guanyin is beloved by all Buddhist traditions in a non-denominational way and found in most Tibetan temples under the name Chenrezig, and found in some influential Theravada temples such as Gangaramaya and Kelaniya of Sri Lanka. Statues are a widely depicted subject of Asian art and found in the Asian art sections of most museums in the world.\n\nGenerally accepted among East Asian adherents, Guanyin originated as the Bodhisattva Avalokiteśvara, but in Chinese folk religion, the mythical accounts about Guanyin's origins do not associate with the Avalokiteśvara described in Buddhist sutras.  Commonly known in English as the Mercy Goddess or Goddess of Mercy,  often depicted as both male and female to show this figure's limitless transcendence beyond gender[http://fathom.lse.ac.uk/seminars/21701773/21701773_session4.html Fathom.lse.ac.uk] , and revered by Taoists as an immortal.\n\nEtymology\n\nAvalokitasvara\n\nGuānyīn is a translation from the Sanskrit Avalokitasvara or Avalokiteśvara, referring to the Mahāyāna bodhisattva of the same name. Another later name for this bodhisattva is Guānzìzài (). It was initially thought that the Chinese mis-transliterated the word Avalokiteśvara as Avalokitasvara which explained why Xuanzang translated it as Guānzìzài instead of Guānyīn. However, the original form was indeed Avalokitasvara with the ending svara (\"sound, noise\"), which means \"sound perceiver\", literally \"he who looks down upon sound\" (i.e., the cries of sentient beings who need his help).Pine, Red. The Heart Sutra: The Womb of the Buddhas (2004) Shoemaker 7 Hoard.  pg 44–45 This is the exact equivalent of the Chinese translation Guānyīn. This etymology was furthered in the Chinese by the tendency of some Chinese translators, notably Kumarajiva, to use the variant Guānshìyīn, literally \"he who perceives the world's lamentations\"—wherein lok was read as simultaneously meaning both \"to look\" and \"world\" (Skt. loka; Ch. 世, shì).\n\nDirect translations from the Sanskrit name Avalokitasvara include:\n* Chinese: Guanyin (觀音), Guanshiyin (觀世音)[http://news.guoxue.com/article.php?articleid=26872 国学资讯 – 是“观世音”还是“观音”？——兼谈中国古典学的重要性]\n\nAvalokiteśvara\n\nThe name Avalokitasvara was later supplanted by the Avalokiteśvara form containing the ending -īśvara, which does not occur in Sanskrit before the seventh century. The original form Avalokitasvara appears in Sanskrit fragments of the fifth century. The original meaning of the name \"Avalokitasvara\" fits the Buddhist understanding of the role of a bodhisattva. The reinterpretation presenting him as an īśvara shows a strong influence of Śaivism, as the term īśvara was usually connected to the Hindu notion of Śiva as a creator god and ruler of the world.\n\nWhile some of those who revered Avalokiteśvara upheld the Buddhist rejection of the doctrine of any creator god, Encyclopædia Britannica does cite Avalokiteśvara as the creator god of the world. This position is taken in the widely used Karandavyuha Sutra with its well-known mantra Oṃ maṇi padme hūṃ. In addition, the Lotus Sutra is the first time the Avalokiteśvara is mentioned. Chapter 25 refers to him as Lokeśvara (Lord God of all beings) and Lokenath (Lord and Protector of all beings) and ascribes extreme attributes of divinity to him. \n\nDirect translations from the Sanskrit name Avalokiteśvara include:\n* \n* , THL Chenrézik\n\nNames in other Asian languages\n\nDue to the devotional popularity of Guanyin in Asia, she is known by many names, most of which are simply the localised pronunciations of \"Guanyin\" or \"Guanshiyin\":\n* The name is pronounced Gwun Yam or Gun Yam in Cantonese Chinese, also written as Kwun Yam in Hong Kong or Kun Iam in Macau.\n* In Hokkien, she is called Kuan Im (POJ: Koan-im) or Kuan Se Im (POJ: Koan-sè-im)\n* In Japanese, Guanyin is pronounced Kannon (), occasionally Kan'on, or more formally Kanzeon (, the same characters as Guanshiyin); the spelling Kwannon, based on a premodern pronunciation, is sometimes seen. This rendition was used for an earlier spelling of the well-known camera manufacturer Canon Inc., which was named for Guanyin.  When iconography of Kannon depicts her with the Nyoihōju (如意宝珠) wishing gem she is known as Nyoirin Kannon (如意輪 観音), which is the Japanese adaptation of the Hindu deity Cintamanicakra.\n* In Korean, Guanyin is called Gwan-eum () or Gwanse-eum ().\n* In Thai's pronunciation duplicate from Hokkien Kuan Im (), Phra Mae Kuan Im () or Chao Mae Kuan Im ().\n* In Burmese, the name of Guanyin is Kwan Yin Medaw, literally meaning Mother Kwan Yin (Goddess Guanyin) ().\n* In Vietnamese, the name is Quan Âm or Quán Thế Âm.\n* In Indonesian, the name is Kwan Im or Dewi Kwan Im. She is also called Mak Kwan Im \"Mother Guanyin\".\n* In Malaysian Mandarin, the name is GuanYin Pusa (GuanYin Bodhisattva), Guan Shi Yin Pusa (GuanYin Bodhisattva).\n* In Khmer, the name is Preah Mae Kun Ci Iem.\n* In Sinhalese, the name is Natha Deviyo ().\n* In Tibetan, the name is Chenrézik ().\n* In Hmong, the name is Kab Yeeb.\n\nIn these same countries, the variant Guanzizai \"Lord of Contemplation\" and its equivalents are also used, such as in the Heart Sutra, among other sources.\n\nDepiction\n\nLotus Sūtra\n\nThe Lotus Sūtra (Sanskrit Saddharma Puṇḍarīka Sūtra) is generally accepted to be the earliest literature teaching about the doctrines of Avalokiteśvara.Huntington, John (2003). The Circle of Bliss: Buddhist Meditational Art: p. 188 These are found in the twenty fifth chapter of the Lotus Sūtra. This chapter is devoted to Avalokitesvara, describing him as a compassionate bodhisattva who hears the cries of sentient beings, and who works tirelessly to help those who call upon his name. This Chapter also places Avalokiteshwara as Higher than any other being in the Buddhist Cosmology stating that \"if one were to pray with true devotion to Avalokiteshwara for one second, they would generate more blessings than if one worshiped with all types of offerings as many Gods as there are in the grains of sand of 62 Ganges Rivers for an entire lifetime\". As a result, Avalokiteshwara is often considered the most beloved Buddhist Divinity and is venerated in many important temples including Shitennoji, the first official temple of Japan, Sensoji, the oldest temple of Tokyo, Kiyomizu-dera and Sanjusangendo which are the two most visited temples in Kyoto.\n\nThe Lotus Sutra describes Avalokiteśvara as a bodhisattva who can take the form of any type of God including Indra or Brahma; any type of Buddha, any type of King or Chakravartin or even any kind of Heavenly Guardian including Vajrapani and Vaisravana as well as any gender male or female, adult or child, human or non-human being, in order to teach the Dharma to sentient beings.Kubo Tsugunari, Yuyama Akira (tr.). [https://web.archive.org/web/20150521183528/http://www.bdkamerica.org/digital/dBET_T0262_LotusSutra_2007.pdf The Lotus Sutra]. Revised 2nd ed. Berkeley, Calif.: Numata Center for Buddhist Translation and Research, 2007. , pp. 311–312 Folk traditions in China and other East Asian countries have added many distinctive characteristics and legends to Guanyin c.q. Avalokiteśvara. Avalokiteśvara was originally depicted as a male bodhisattva, and therefore wears chest-revealing clothing and may even sport a light moustache. Although this depiction still exists in the Far East, Guanyin is more often depicted as a woman in modern times. Additionally, some people believe that Guanyin is androgynous or perhaps without gender. P. 26\n\nA total of 33 different manifestations of Avalokitasvara are described, including female manifestations, all to suit the minds of various beings. Chapter 25 consists of both a prose and a verse section. This earliest source often circulates separately as its own sūtra, called the Avalokitasvara Sūtra (Ch. 觀世音經), and is commonly recited or chanted at Buddhist temples in East Asia.Baroni, Helen (2002). The Illustrated Encyclopedia of Zen Buddhism: p. 15 The Lotus Sutra and its thirty-three manifestations of Guanyin, of which seven are female manifestations, is known to have been very popular in Chinese Buddhism as early as in the Sui and Tang dynasties.Tan Chung. Across the Himalayan Gap: An Indian Quest for Understanding China. 1998. p. 222 Additionally, Tan Chung notes that according to the doctrines of the Mahāyāna sūtras themselves, it does not matter whether Guanyin is male, female, or genderless, as the ultimate reality is in emptiness (Skt. śūnyatā).\n\nIconography\n\nRepresentations of the bodhisattva in China prior to the Song dynasty (960–1279) were masculine in appearance. Images which later displayed attributes of both genders are believed to be in accordance with the Lotus Sutra, where Avalokitesvara has the supernatural power of assuming any form required to relieve suffering, and also has the power to grant children. Because this bodhisattva is considered the personification of compassion and kindness, a mother goddess and patron of mothers and seamen, the representation in China was further interpreted in an all-female form around the 12th century. In the modern period, Guanyin is most often represented as a beautiful, white-robed woman, a depiction which derives from the earlier Pandaravasini form.\n\nIn some Buddhist temples and monasteries, Guanyin's image is occasionally that of a young man dressed in Northern Song Buddhist robes and seated gracefully. He is usually depicted looking or glancing down, symbolising that Guanyin continues to watch over the world.\n\nIn China, Guanyin is generally portrayed as a young woman donned in a flowing white robe and usually wearing necklaces symbolic of Indian or Chinese royalty. In her left hand is a jar containing pure water, and the right holds a willow branch. The crown usually depicts the image of Amitābha.\n\nThere are also regional variations of Guanyin depictions. In Fujian, for example, a popular depiction of Guanyin is as a maiden dressed in Tang hanfu carrying a fish basket. A popular image of Guanyin as both Guanyin of the South Sea and Guanyin with a Fish Basket can be seen in late 16th-century Chinese encyclopedias and in prints that accompany the novel Golden Lotus.\n\nIn Chinese art, Guanyin is often depicted either alone, standing atop a dragon, accompanied by a white cockatoo and flanked by two children or two warriors. The two children are her acolytes who came to her when she was meditating at Mount Putuo. The girl is called Longnü and the boy Shancai. The two warriors are the historical general Guan Yu from the late Han dynasty and the bodhisattva Skanda, who appears in the Chinese classical novel Fengshen Yanyi. The Buddhist tradition also displays Guanyin, or other buddhas and bodhisattvas, flanked with the above-mentioned warriors, but as bodhisattvas who protect the temple and the faith itself.\n\nLegends\n\nGuanyin and the Thousand Arms\n\nIn the Karandavyuha Sutra, Avalokiteshwara is called \"The One With A Thousand Arms and Thousand eyes\" and is described as superior to all Gods and Buddhas of the Indian pantheon. The Sutra also states that \"it is easier to count all the leaves of every tree of every forest and all the grains of sand in the universe than to count the blessings and power of Avalokiteshwara\". This version of Avalokiteshwara with a thousand arms depicting the power of all Gods also shows various Buddhas in the crown depicting the wisdom of all Buddhas. It is called Senju Kannon in Japan and 1000 statues of this nature can be found at the popular Sanjusangendo temple of Kyoto.\n\nOne Buddhist legend from the Complete Tale of Guanyin and the Southern Seas () presents Guanyin as vowing to never rest until she had freed all sentient beings from saṃsāra or cycle of rebirth. Despite strenuous effort, she realised that there were still many unhappy beings yet to be saved. After struggling to comprehend the needs of so many, her head split into eleven pieces. The buddha Amitābha, upon seeing her plight, gave her eleven heads to help her hear the cries of those who are suffering. Upon hearing these cries and comprehending them, Avalokiteśvara attempted to reach out to all those who needed aid, but found that her two arms shattered into pieces. Once more, Amitābha came to her aid and appointed her a thousand arms to let her reach out to those in need.\n\nMany Himalayan versions of the tale include eight arms with which Avalokitesvara skillfully upholds the dharma, each possessing its own particular implement, while more Chinese-specific versions give varying accounts of this number.\n\nIn China, it is said that fishermen used to pray to her to ensure safe voyages. The titles Guanyin of the Southern Ocean (南海觀音) and \"Guanyin (of/on) the Island\" stem from this tradition.\n\nLegend of Miaoshan\n\nAnother story from the Precious Scroll of Fragrant Mountain (香山寶卷) describes an incarnation of Guanyin as the daughter of a cruel king who wanted her to marry a wealthy but uncaring man. The story is usually ascribed to the research of the Buddhist monk Jiang Zhiqi during the 11th century. The story is likely to have its origin in Taoism. When Chiang penned the work, he believed that the Guanyin we know today was actually a princess called Miaoshan (妙善), who had a religious following on Fragrant Mountain. Despite this there are many variants of the story in Chinese mythology.[http://blog.sina.com.cn/s/blog_6d02fe8d0101b2xr.html 香山寶卷（1）_蒋建达_新浪博客]\n\nAccording to the story, after the king asked his daughter Miaoshan to marry the wealthy man, she told him that she would obey his command, so long as the marriage eased three misfortunes.\n\nThe king asked his daughter what were the three misfortunes that the marriage should ease. Miaoshan explained that the first misfortune the marriage should ease was the suffering people endure as they age. The second misfortune it should ease was the suffering people endure when they fall ill. The third misfortune it should ease was the suffering caused by death. If the marriage could not ease any of the above, then she would rather retire to a life of religion forever.\n\nWhen her father asked who could ease all the above, Miaoshan pointed out that a doctor was able to do all of these. Her father grew angry as he wanted her to marry a person of power and wealth, not a healer. He forced her into hard labour and reduced her food and drink but this did not cause her to yield.\n\nEvery day she begged to be able to enter a temple and become a nun instead of marrying. Her father eventually allowed her to work in the temple, but asked the monks to give her the toughest chores in order to discourage her. The monks forced Miaoshan to work all day and all night while others slept in order to finish her work. However, she was such a good person that the animals living around the temple began to help her with her chores. Her father, seeing this, became so frustrated that he attempted to burn down the temple. Miaoshan put out the fire with her bare hands and suffered no burns. Now struck with fear, her father ordered her to be put to death.\n\nIn one version of this legend, when Guanyin was executed, a supernatural tiger took her to one of the more hell-like realms of the dead.  However, instead of being punished like the other spirits of the dead, Guanyin played music, and flowers blossomed around her. This completely surprised the hell guardian. The story says that Guanyin, by merely being in that Naraka (hell), turned it into a paradise.\n\nA variant of the legend says that Miaoshan allowed herself to die at the hand of the executioner. According to this legend, as the executioner tried to carry out her father's orders, his axe shattered into a thousand pieces. He then tried a sword which likewise shattered. He tried to shoot Miaoshan down with arrows but they all veered off.\n\nFinally in desperation he used his hands. Miaoshan, realising the fate that the executioner would meet at her father's hand should she fail to let herself die, forgave the executioner for attempting to kill her. It is said that she voluntarily took on the massive karmic guilt the executioner generated for killing her, thus leaving him guiltless. It is because of this that she descended into the Hell-like realms. While there, she witnessed first-hand the suffering and horrors that the beings there must endure, and was overwhelmed with grief. Filled with compassion, she released all the good karma she had accumulated through her many lifetimes, thus freeing many suffering souls back into Heaven and Earth. In the process, that Hell-like realm became a paradise. It is said that Yama, the ruler of hell, sent her back to Earth to prevent the utter destruction of his realm, and that upon her return she appeared on Fragrant Mountain.\n\nAnother tale says that Miaoshan never died, but was in fact transported by a supernatural tiger, believed to be the Deity of the Place, to Fragrant Mountain.\n\nThe legend of Miaoshan usually ends with Miaozhuangyan, Miaoshan's father, falling ill with jaundice. No physician was able to cure him. Then a monk appeared saying that the jaundice could be cured by making a medicine out of the arm and eye of one without anger. The monk further suggested that such a person could be found on Fragrant Mountain. When asked, Miaoshan willingly offered up her eyes and arms. Miaozhuangyan was cured of his illness and went to the Fragrant Mountain to give thanks to the person. When he discovered that his own daughter had made the sacrifice, he begged for forgiveness. The story concludes with Miaoshan being transformed into the Thousand Armed Guanyin, and the king, queen and her two sisters building a temple on the mountain for her.  She began her journey to a pure land and was about to cross over into heaven when she heard a cry of suffering from the world below.  She turned around and saw the massive suffering endured by the people of the world. Filled with compassion, she returned to Earth, vowing never to leave till such time as all suffering has ended.\n\nAfter her return to Earth, Guanyin was said to have stayed for a few years on the island of Mount Putuo where she practised meditation and helped the sailors and fishermen who got stranded. Guanyin is frequently worshipped as patron of sailors and fishermen due to this. She is said to frequently becalm the sea when boats are threatened with rocks. After some decades Guanyin returned to Fragrant Mountain to continue her meditation.\n\nGuanyin and Shancai\n\nLegend has it that Shancai (also called Sudhana in Sanskrit) was a disabled boy from India who was very interested in studying the dharma. When he heard that there was a Buddhist teacher on the rocky island of Putuo he quickly journeyed there to learn. Upon arriving at the island, he managed to find Guanyin despite his severe disability.\n\nGuanyin, after having a discussion with Shancai, decided to test the boy's resolve to fully study the Buddhist teachings. She conjured the illusion of three sword-wielding pirates running up the hill to attack her. Guanyin took off and dashed to the edge of a cliff, the three illusions still chasing her.\n\nShancai, seeing that his teacher was in danger, hobbled uphill. Guanyin then jumped over the edge of the cliff, and soon after this the three bandits followed. Shancai, still wanting to save his teacher, managed to crawl his way over the cliff edge.\n\nShancai fell down the cliff but was halted in midair by Guanyin, who now asked him to walk. Shancai found that he could walk normally and that he was no longer crippled. When he looked into a pool of water he also discovered that he now had a very handsome face. From that day forth, Guanyin taught Shancai the entire dharma.\n\nGuanyin and Longnü\n\nMany years after Shancai became a disciple of Guanyin, a distressing event happened in the South China Sea. The third son of one of the Dragon Kings was caught by a fisherman while swimming in the form of a fish. Being stuck on land, he was unable to transform back into his dragon form. His father, despite being a mighty Dragon King, was unable to do anything while his son was on land. Distressed, the son called out to all of Heaven and Earth.\n\nHearing this cry, Guanyin quickly sent Shancai to recover the fish and gave him all the money she had. The fish at this point was about to be sold in the market. It was causing quite a stir as it was alive hours after being caught. This drew a much larger crowd than usual at the market. Many people decided that this prodigious situation meant that eating the fish would grant them immortality, and so all present wanted to buy the fish. Soon a bidding war started, and Shancai was easily outbid.\n\nShancai begged the fish seller to spare the life of the fish. The crowd, now angry at someone so daring, was about to pry him away from the fish when Guanyin projected her voice from far away, saying \"A life should definitely belong to one who tries to save it, not one who tries to take it.\"\n\nThe crowd, realising their shameful actions and desire, dispersed. Shancai brought the fish back to Guanyin, who promptly returned it to the sea. There the fish transformed back to a dragon and returned home. Paintings of Guanyin today sometimes portray her holding a fish basket, which represents the aforementioned tale.\n\nBut the story does not end there.  As a reward for Guanyin saving his son, the Dragon King sent his granddaughter, a girl called Longnü (\"dragon girl\"), to present Guanyin with the Pearl of Light. The Pearl of Light was a precious jewel owned by the Dragon King that constantly shone. Longnü, overwhelmed by the presence of Guanyin, asked to be her disciple so that she might study the dharma. Guanyin accepted her offer with just one request: that Longnü be the new owner of the Pearl of Light.\n\nIn popular iconography, Longnü and Shancai are often seen alongside Guanyin as two children. Longnü is seen either holding a bowl or an ingot, which represents the Pearl of Light, whereas Shancai is seen with palms joined and knees slightly bent to show that he was once crippled.\n\nGuanyin and the Filial Parrot\n\nThe Precious Scroll of the Parrot () tells the story of a parrot who becomes a disciple of Guanyin.  During the Tang Dynasty a small parrot ventures out to search for its mother's favourite food upon which it is captured by a poacher (parrots were quite popular during the Tang Dynasty).  When it managed to escape it found out that its mother had already died.  The parrot grieved for its mother and provides her with a proper funeral.  It then sets out to become a disciple of Guanyin.\n\nIn popular iconography, the parrot is coloured white and usually seen hovering to the right side of Guanyin with either a pearl or a prayer bead clasped in its beak.  The parrot becomes a symbol of filial piety.\n\nGuanyin and Chen Jinggu\n\nWhen the people of Quanzhou, Fujian could not raise enough money to build a bridge, Guanyin changed into a beautiful maiden. Getting on a boat, she offered to marry any man who could hit her with a piece of silver from the edge of the water. Due to many people missing, she collected a large sum of money in her boat. However, Lü Dongbin, one of the Eight Immortals, helped a merchant hit Guanyin in the hair with silver powder, which floated away in the water. Guanyin bit her finger and a drop of blood fell into the water, but she vanished. This blood was swallowed by a washer woman, who gave birth to Chen Jinggu (陳靖姑) or Lady Linshui (臨水夫人); the hair was turned into a female white snake and sexually used men and killed rival women. The snake and Chen were to be mortal enemies. The merchant was sent to be reborn as Liu Qi (劉杞).\n\nChen was a beautiful and talented girl, but did not wish to marry Liu Qi. Instead, she fled to Mount Lu in Jiangxi, where she learned many Taoist skills. Destiny eventually caused her to marry Liu and she became pregnant. A drought in Fujian caused many people to ask her to call for rain, which was a ritual that could not be performed while pregnant. She temporarily aborted her child, which was killed by the white snake. Chen managed to kill the snake with a sword, but died either of a miscarriage or hemorrhage; she was able to complete the ritual, and ended drought.\n\nThis story is popular in Zhejiang, Taiwan, and especially Fujian.\n\nQuan Am Thi Kinh\n\nQuan Am Thi Kinh (觀音氏敬) is a Vietnamese verse recounting the life of a woman, Thi Kinh. She was accused falsely of having intended to kill her husband, and when she disguised herself as a man to lead a religious life in a Buddhist temple, she was again falsely blamed for having committed sexual intercourse with a girl named Thi Mau. She was accused of impregnating her, which was strictly forbidden by Buddhist law. However, thanks to her endurance of all indignities and her spirit of self-sacrifice, she could enter into Nirvana and became Goddess of Mercy (Phat Ba Quan Am) P. Q. Phan's 2014 opera ' is based on this story.[http://music.indiana.edu/events/program.php?eid=57594 The Tale of Lady Thị Kính], program booklet, February 2014\n\nJourney To The West\n\nNext to Sun Wu Kong, the monkey king himself, there is no supernatural entity more important to the famous myths from China about a strange mystical monkey, a couple of exiled gods, a dragon, and a priest trying to bring sacred scrolls back to China than her. She delivered the ring that let the priest control the monkey king. She informed all those involved of their great place in the quest which allowed most of them to reach enlightenment. When a demon was too powerful or tricky even for the monkey king she came to their rescue. And when the monkey king was feeling like abandoning the quest she managed to talk him into returning.\n\nAssociation with vegetarianism\n\nDue to her symbolization of compassion, in East Asia, Guanyin is associated with vegetarianism. Buddhist cuisine is generally decorated with her image and she appears in most Buddhist vegetarian pamphlets and magazines.\n\nRole in East Asian Buddhism\n\nIn East Asian Buddhism, Guanyin is the bodhisattva Avalokiteśvara. Among the Chinese, Avalokiteśvara is almost exclusively called Guanshiyin Pusa (觀世音菩薩). The Chinese translation of many Buddhist sutras has in fact replaced the Chinese transliteration of Avalokitesvara with Guanshiyin (觀世音). Some Taoist scriptures give her the title of Guanyin Dashi, sometimes informally Guanyin Fozu.\n\nIn Chinese culture, the popular belief and worship of Guanyin as a goddess by the populace is generally not viewed to be in conflict with the bodhisattva Avalokitesvara's nature. In fact the widespread worship of Guanyin as a \"Goddess of Mercy and Compassion\" is seen by Buddhists as the boundless salvific nature of bodhisattva Avalokiteśvara at work (in Buddhism, this is referred to as Guanyin's \"skillful means\", or upaya). The Buddhist canon states that bodhisattvas can assume whatsoever gender and form is needed to liberate beings from ignorance and dukkha. With specific reference to Avalokitesvara, he is stated both in the Lotus Sutra (Chapter 25 \"Perceiver of the World's Sounds\" or \"Universal Gateway\"),  and the Śūraṅgama Sūtra to have appeared before as a woman or a goddess to save beings from suffering and ignorance. Some Buddhist schools refer to Guanyin both as male and female interchangeably.\n\nIn Mahayana Buddhism, gender is no obstacle to attaining enlightenment (or nirvana). The Buddhist concept of non-duality applies here. The Vimalakirti Sutras \"Goddess\" chapter clearly illustrates an enlightened being who is also a female and deity. In the Lotus Sutra, a maiden became enlightened in a very short time span. The view that Avalokiteśvara is also the goddess Guanyin does not seem contradictory to Buddhist beliefs. Guanyin has been a buddha called the \"Tathāgata of Brightness of Correct Dharma\" (正法明如來).[http://www.cbeta.org/result/normal/T20/1060_001.htm 《千手千眼觀世音菩薩廣大圓滿無礙大悲心陀羅尼經》 卷1] \n\nGiven that bodhisattvas are known to incarnate at will as living people according to the sutras, the princess Miaoshan is generally viewed by Buddhists as an incarnation of Guanyin.\n\nGuanyin is immensely popular among Chinese Buddhists, especially those from devotional schools. She is generally seen as a source of unconditional love and, more importantly, as a saviour. In her bodhisattva vow, Guanyin promises to answer the cries and pleas of all sentient beings and to liberate them from their own karmic woes. Based on the Lotus Sutra and the Shurangama sutra, Avalokitesvara is generally seen as a saviour, both spiritually and physically. The sutras state that through his saving grace even those who have no chance of being enlightened can be enlightened, and those deep in negative karma can still find salvation through his compassion.\n\nIn Pure Land Buddhism, Guanyin is described as the \"Barque of Salvation\". Along with Amitābha and the bodhisattva Mahasthamaprapta, she temporarily liberates beings out of the Wheel of Samsara into the Pure Land, where they will have the chance to accrue the necessary merit so as to be a Buddha in one lifetime. In Chinese Buddhist iconography, Guanyin is often depicted as meditating or sitting alongside one of the Buddhas and usually accompanied by another bodhisattva. The buddha and bodhisattva that are portrayed together with Guanyin usually follow whichever school of Buddhism they represent. In Pure Land Buddhism, for example, Guanyin is frequently depicted on the left of Amitābha, while on the buddha's right is Mahasthamaprapta. Temples that revere the bodhisattva Ksitigarbha usually depict him meditating beside Amitābha and Guanyin.\n\nEven among Chinese Buddhist schools that are non-devotional, Guanyin is still highly venerated. Instead of being seen as an active external force of unconditional love and salvation, the personage of Guanyin is highly revered as the principle of compassion, mercy and love. The act, thought and feeling of compassion and love is viewed as Guanyin. A merciful, compassionate, loving individual is said to be Guanyin. A meditative or contemplative state of being at peace with oneself and others is seen as Guanyin.\n\nIn the Mahayana canon, the Heart Sutra is ascribed entirely to Guanyin. This is unique, since most Mahayana Sutras are usually ascribed to Gautama Buddha and the teachings, deeds or vows of the bodhisattvas are described by Shakyamuni Buddha. In the Heart Sutra, Guanyin describes to the arhat Sariputta the nature of reality and the essence of the Buddhist teachings. The famous Buddhist saying \"Form is emptiness, emptiness is form\" (色即是空，空即是色) comes from this sutra.\n\nRole in other religions\n\nGuanyin is an extremely popular goddess in Chinese folk religion and is worshiped in many Chinese communities throughout East and South East Asia.[http://www.fjdh.com/wumin/HTML/82218.html 於君方：《偽經》與觀音信仰][http://www.gywh.net/guanyin/xingxiang.shtml 中國觀音文化促进會 观音形象] [http://bzzz.china84000.com/Article/sjyj/200807/Article_10.html 中国观音信仰的基本体系-宝藏杂志][http://www.fjnet.com/fjlw/200811/t20081117_92282.htm 信仰研究现状评析—李利安-学术论文-佛教在线] In Taoism, records claim Guanyin was a Chinese woman who became an immortal, Cihang Zhenren in Shang Dynasty or Xingyin (姓音).[http://hi.baidu.com/axblog/blog/item/c7381508163b6530e924887f.html 太上碧落洞天慈航灵感度世宝忏起赞_仙道贵生。无量度人_百度空间]\n\nGuanyin is revered in the general Chinese population due to her unconditional love and compassion. She is generally regarded by many as the protector of women and children. By this association, she is also seen as a fertility goddess capable of granting children to couples. An old Chinese superstition involves a woman who, wishing to have a child, offers a shoe to Guanyin. In Chinese culture, a borrowed shoe sometimes is used when a child is expected. After the child is born, the shoe is returned to its owner along with a new pair as a thank you gift.\n\nGuanyin is also seen as the champion of the unfortunate, the sick, the disabled, the poor, and those in trouble. Some coastal and river areas of China regard her as the protector of fishermen, sailors, and generally people who are out at sea, thus many have also come to believe that Mazu, the goddess of the sea, is a manifestation of Guanyin. Due to her association with the legend of the Great Flood, where she sent down a dog holding rice grains in its tail after the flood, she is worshiped as an agrarian and agriculture goddess. In some quarters, especially among business people and traders, she is looked upon as a goddess of fortune. In recent years there have been claims of her being the protector of air travelers.\n\nGuanyin is also a ubiquitous figure found within the new religious movements of Asia:\n* Within the Taiwan-based Yiguandao sect, Guanyin is called the \"Ancient Buddha of the South Sea\" (南海古佛) and frequently appears in their fuji. Guanyin is sometimes confused with Yue Hui Bodhisattva due to their similar appearance.[http://www.gaya.org.tw/magazine/v1/2005/64/64hk1.htm 香光莊嚴第六十四期/歷史/觀音老母]\n* Guanyin is called the \"Ancient Buddha of the Holy Religion\" (聖宗古佛) in Zailiism and in the teachings of the Lord of Universe Church. In Zailiism she is the main deity worshipped.\n* Ching Hai initiates her followers a meditation method called the \"Quan Yin Method\" to achieve enlightenment; followers also revere Ching Hai as an incarnation of Guanyin.\n* Guanyin, known as \"Quan Am Tathagata\" (Quan Âm Như Lai) in the Cao Dai religion, is considered a Buddha and a teacher. She represents Buddhist doctrines and traditions as one of the three major lines of Cao Dai doctrines (Buddhism, Taoism, and Confucianism). She also symbolizes utmost patience, harmony, and compassion. According to her Divine messages via seances, her main role is to teach the Tao to female disciples, and guide them towards divinity. Another of her well-known role is to save people from extreme sufferings, e.g. fire, drowning, wrong accusation/ imprisonment, etc. There is even a prayer named \"Salvation from sufferings\" for followers to cite in dire conditions.\n\nSimilarity to the Virgin Mary\n\nSome Buddhist and Christian observers have commented on the similarity between Guanyin and the Blessed Virgin Mary. This can be attributed to the representation of Guanyin holding a child in Chinese art and sculpture; it is believed that Guanyin is the patron saint of mothers and grants parents filial children, this apparition is popularly known as the \"Child-Sending Guanyin\" (送子觀音). One example of this comparison can be found in the Tzu Chi Foundation, a Taiwanese Buddhist humanitarian organisation, which noticed the similarity between this form of Guanyin and the Virgin Mary. The organisation commissioned a portrait of Guanyin holding a baby, closely resembling the typical Roman Catholic Madonna and Child painting. Copies of this portrait are now displayed prominently in Tzu Chi affiliated medical centres, especially since Tzu Chi's founder is a Buddhist master but her supporters come from all walks of religious life. \n\nDuring the Edo Period in Japan, when Christianity was banned and punishable by death, some underground Christian groups venerated Jesus and the Virgin Mary by disguising them as statues of Kannon holding a child; such statues are known as Maria Kannon. Many had a cross hidden in an inconspicuous location.\n\nIt is suggested the similarity comes from the conquest and colonization of the Philippines by Spain during the 16th century, when Asian cultures influenced engravings of the Virgin Mary, as evidenced, for example, in an ivory carving of the Virgin Mary by a Chinese carver. (mp4 audio, requires Apple QuickTime).\n\nThe statue of Guanyin (Gwanse-eum) in Gilsangsa Temple in Seoul, South Korea was sculpted by Catholic sculptor Choi Jong-tae, who modeled the statue after the Virgin Mary in hopes of fostering religious reconciliation in Korean society.\n\nIn popular culture\n\nIn the 1946 film Three Strangers the titular characters wish for a shared sweepstakes ticket to win before a statue of Guanyin, referred to in the film as Kwan Yin.\n\nFor a 2005 Fo Guang Shan TV series, Andy Lau performed the song Kwun Sai Yam, which emphasizes the idea that everyone can be like Guanyin.:zh:观世音 (2005年电视剧)[http://www.bdcitta.net/kanwu/fubao/zhuanti/2010-07-20/565.html 观音老人悟明长老 毕生弘扬大悲忏] \n\nFantasy author Richard Parks has frequently utilized Guanyin as a character in his fiction, most notably in the short story \"The White Bone Fan\" (2009), the novella The Heavenly Fox (2011), and the novel All the Gates of Hell (2013). Guanyin. http://en.wikipedia.org/?curid=17063."
  }
}
