{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11725",
  "eid" : "fd6fed20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778504946,
  "textBody" : "Flunitrazepam, also known as Rohypnol among other names, is an intermediate acting benzodiazepine used in some countries to treat severe insomnia and in fewer, early in anesthesia.\n\nJust as with other hypnotics, flunitrazepam should be strictly used only on a short-term basis or by those with chronic insomnia on an occasional basis. Flunitrazepam has been referred to as a date rape drug even though its incidence is very rare in reported rape cases.European Monitoring Centre for Drugs and Drug Addiction [http://www.emcdda.europa.eu/publications/drug-profiles/benzodiazepine Benzodiazepines drug profile]. Page last updated January 8, 2015\n\nUse\n\nIn countries where the drug is still used, it is used for treatment of insomnia, and in some countries to begin anesthesia as well; these were also the indications in which it was originally studied.Mattila MA, Larni HM. Flunitrazepam: a review of its pharmacological properties and therapeutic use. Drugs. 1980 Nov;20(5):353-74. \n\nAdverse effects\n\nAdverse effects of flunitrazepam include dependence, both physical and psychological; reduced sleep quality resulting in somnolence; and overdose, resulting in excessive sedation, impairment of balance and speech, respiratory depression or coma, and possibly death. Because of the latter, flunitrazepam is commonly used in suicide. When used in pregnancy, it might cause hypotonia.\n\nDependence\n\nFlunitrazepam as with other benzodiazepines can lead to drug dependence and benzodiazepine withdrawal syndrome. Discontinuation may result in the appearance of withdrawal symptoms when the drug is discontinued. Abrupt withdrawal may lead to a benzodiazepine withdrawal syndrome characterised by seizures, psychosis, insomnia, and anxiety. Rebound insomnia, worse than baseline insomnia, typically occurs after discontinuation of flunitrazepam even after short-term single nightly dose therapy.\n\nSleep depth\n\nFlunitrazepam produces a decrease in delta wave activity. The effect of benzodiazepine drugs on delta waves, however, may not be mediated via benzodiazepine receptors. Delta activity is an indicator of depth of sleep within non-REM sleep; increased levels of delta sleep reflects better quality of sleep. Thus, flunitrazepam and other benzodiazepines cause a deterioration in sleep quality. Cyproheptadine may be superior to benzodiazepines in the treatment of insomnia as it enhances sleep quality based on EEG studies.\n\nParadoxical effects\n\nFlunitrazepam may cause a paradoxical reaction in some individuals causing symptoms including anxiety, aggressiveness, agitation, confusion, disinhibition, loss of impulse control, talkativeness, violent behavior, and even convulsions. Paradoxical adverse effects may even lead to criminal behaviour.\n\nHypotonia\n\nBenzodiazepines such as flunitrazepam are lipophilic and rapidly penetrate membranes and, therefore, rapidly cross over into the placenta with significant uptake of the drug. Use of benzodiazepines including flunitrazepam in late pregnancy, especially high doses, may result in hypotonia, also known as floppy baby syndrome.\n\nOther\n\nFlunitrazepam impairs cognitive functions. This may appear as lack of concentration, confusion and anterograde amnesia. It can be described as a hangover-like effect which can persist to the next day. It also impairs psychomotor functions similar to other benzodiazepines and nonbenzodiazepine hypnotic drugs; falls and hip fractures were frequently reported. The combination with alcohol increases these impairments. Partial, but incomplete tolerance develops to these impairments.\n\nOther adverse effects include:\n* Slurred speech\n* Gastrointestinal disturbances, lasting 12 or more hours\n* Vomiting\n* Respiratory depression in higher doses\n;Special precautions\nBenzodiazepines require special precaution if used in the elderly, during pregnancy, in children, in alcohol- or drug-dependent individuals, and in individuals with comorbid psychiatric disorders.\n\nImpairment of driving skills with a resultant increased risk of road traffic accidents is probably the most important adverse effect. This side-effect is not unique to flunitrazepam but also occurs with other hypnotic drugs. Flunitrazepam seems to have a particularly high risk of road traffic accidents compared to other hypnotic drugs. Extreme caution should be exercised by drivers after taking flunitrazepam.UK Dept. of Transport. July 2014. [https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/325275/healthcare-profs-drug-driving.pdf Guidance for healthcare professionals on drug driving]\n\nInteractions\n\nThe use of flunitrazepam in combination with alcoholic beverages synergizes the adverse effects, and can lead to toxicity and death.\n\nOverdose\n\nFlunitrazepam is a drug that is frequently involved in drug intoxication, including overdose. Overdose of flunitrazepam may result in excessive sedation, or impairment of balance or speech. This may progress in severe overdoses to respiratory depression or coma and possibly death. The risk of overdose is increased if flunitrazepam is taken in combination with CNS depressants such as ethanol (alcohol) and opioids. Flunitrazepam overdose responds to the benzodiazepine receptor antagonist flumazenil, which thus can be used as a treatment.\n\nDetection\n\nAs of 2016, blood tests can identify flunitrazepam at concentrations of as low as 4 ng/ml; the elimination half life of the drug is 11–25 hours. For urine samples, metabolites can be identified 60 hours to 28 days, depending on the dose and analytical method used. Hair and saliva can also be analyzed; hair is useful when a long time has transpired since ingestion, and saliva for workplace drug tests.\n\nFlunitrazepam can be measured in blood or plasma to confirm a diagnosis of poisoning in hospitalized patients, provide evidence in an impaired driving arrest, or assist in a medicolegal death investigation. Blood or plasma flunitrazepam concentrations are usually in a range of 5–20 μg/L in persons receiving the drug therapeutically as a nighttime hypnotic, 10–50 μg/L in those arrested for impaired driving and 100–1000 μg/L in victims of acute fatal overdosage. Urine is often the preferred specimen for routine drug abuse monitoring purposes. The presence of 7-aminoflunitrazepam, a pharmacologically-active metabolite and in vitro degradation product, is useful for confirmation of flunitrazepam ingestion. In postmortem specimens, the parent drug may have been entirely degraded over time to 7-aminoflunitrazepam.Jones AW, Holmgren A, Kugelberg FC. Concentrations of scheduled prescription drugs in blood of impaired drivers: considerations for interpreting the results. Ther. Drug Monit. 29: 248–260, 2007.Robertson MD, Drummer OH. Stability of nitrobenzodiazepines in postmortem blood. J. For. Sci. 43: 5–8, 1998.R. Baselt, Disposition of Toxic Drugs and Chemicals in Man, 8th edition, Biomedical Publications, Foster City, CA, 2008, pp. 633–635. Other metabolites include desmethylflunitrazepam and 3-hydroxydesmethylflunitrazepam.\n\nPharmacology\n\nThe main pharmacological effects of flunitrazepam are the enhancement of GABA at various GABA receptors.\n\nWhile 80% of flunitrazepam that is taken orally is absorbed, bioavailability in suppository form is closer to 50%.\n\nFlunitrazepam has a long half-life of 18–26 hours, which means that flunitrazepam's effects after nighttime administration persist throughout the next day.\n\nFlunitrazepam is lipophilic and is metabolised hepatically via oxidative pathways. The enzyme CYP3A4 is the main enzyme in its phase 1 metabolism in human liver microsomes.\n\nChemistry\n\nFlunitrazepam is classed as a nitro-benzodiazepine. It is the fluorinated N-methyl derivative of nitrazepam. Other nitro-benzodiazepines include nitrazepam (the parent compound), nimetazepam (methylamino derivative) and clonazepam (2ʹ-chlorinated derivative).\n\nHistory\n\nFlunitrazepam was discovered at Roche as part of the benzodiazepine work led by Leo Sternbach; the patent application was filed in 1962 and it was first marketed in 1974.Erika M Alapi and Janos Fischer. Table of Selected Analogue Classes. Part III of Analogue-based Drug Discovery Eds Janos Fischer, C. Robin Ganellin. John Wiley & Sons, 2006  [https://books.google.com/books?idFjKfqkaKkAAC&pg\nPA537 Pg 537] which refers to [http://www.google.com/patents/US3116203 US patent 3,116,203] Oleaginous systemsJenny Bryan for The Pharmaceutical Journal. Sept 18 2009 [http://www.pharmaceutical-journal.com/opinion/comment/landmark-drugs-the-discovery-of-benzodiazepines-and-the-adverse-publicity-that-followed/10978453.article Landmark drugs: The discovery of benzodiazepines and the adverse publicity that followed]\n\nDue to abuse of the drug for date rape and recreation, in 1998 Roche modified the formulation to give lower doses, make it less soluble, and add a blue dye for easier detection in drinks.Kiss, B et al. Assays for Flunitrazepam. Chapter 48 in Neuropathology of Drug Addictions and Substance Misuse Volume 2: Stimulants, Club and Dissociative Drugs, Hallucinogens, Steroids, Inhalants and International Aspects. Editor, Victor R. Preedy. Academic Press, 2016  [https://books.google.com/books?id\nzu5eBwAAQBAJ&pgPA513 Page 513ff] It was never marketed in the US, and by 2016 had been withdrawn from the markets in Spain, France, Germany, and the UK.\n\nSociety and culture\n\nRecreational and illegal uses\n\nRecreational use\n\nA 1989 journal on Clinical Pharmacology reports that benzodiazepines accounted for 52% of prescription forgeries, suggesting that benzodiazepines was a major prescription drug class of abuse. Nitrazepam accounted for 13% of forged prescriptions.\n\nFlunitrazepam and other sedative hypnotic drugs are detected frequently in cases of people suspected of driving under the influence of drugs. Other benzodiazepines and nonbenzodiazepines (anxiolytic or hypnotic) such as zolpidem and zopiclone (as well as cyclopyrrolones, imidazopyridines, and pyrazolopyrimidines) are also found in high numbers of suspected drugged drivers. Many drivers have blood levels far exceeding the therapeutic dose range suggesting a high degree of abuse potential for benzodiazepines and similar drugs.\n\nSuicide\n\nIn studies in Sweden, flunitrazepam was the second most common drug used in suicides, being found in about 16% of cases. In a retrospective Swedish study of 1587 deaths, in 159 cases benzodiazepines were found. In suicides when benzodiazepines were implicated, the benzodiazepines flunitrazepam and nitrazepam were occurring in significantly higher concentrations, compared to natural deaths. In 4 of the 159 cases, where benzodiazepines were found, benzodiazepines alone were the only cause of death. It was concluded that flunitrazepam and nitrazepam might be more toxic than other benzodiazepines.\n\nDrug-facilitated sexual assault\n\nFlunitrazepam is known to induce anterograde amnesia in sufficient doses; individuals are unable to remember certain events that they experienced while under the influence of the drug, which complicates investigations.  This effect could be particularly dangerous if flunitrazepam is used to aid in the commission of sexual assault; victims may be unable to clearly recall the assault, the assailant, or the events surrounding the assault.\n\nWhile use of flunitrazepam in sexual assault has been prominent in the media, as of 2015 appears to be fairly rare, and use of alcohol and other benzodiazepine drugs in date rape appears to be a larger but underreported problem.\n\nDrug-facilitated robbery\n\nIn the United Kingdom, the use of flunitrazepam and other \"date rape\" drugs have also been connected to stealing from sedated victims. An activist quoted by a British newspaper estimated that up to 2,000 individuals are robbed each year after being spiked with powerful sedatives, making drug-assisted robbery a more commonly reported problem than drug-assisted rape.\n\nRegional use\n\nFlunitrazepam is a Schedule III drug under the international Convention on Psychotropic Substances of 1971.International Narcotics Control Board [http://www.incb.org/documents/Psychotropics/greenlist/Green_list_ENG_2015_new.pdf List of Psychotropic Substances under International Control] Green List 26th edition, 2015\n* In Australia, as of 2013 the drug was authorized for prescribing for severe cases of insomnia but was restricted as a Schedule 8 medicine.\n* In France, as of 2016 flunitrazepam was not marketed.\n* In Germany, as of 2016 flunitrazepam is an Anlage III Betäubungsmittel (controlled substance which is allowed to be marketed and prescribed by physicians under specific provisions) and is available on a special narcotic drug prescription as the Rohypnol 1 mg film-coated tablets and several generic preparations (November 2016). [https://www.gelbe-liste.de/wirkstoffe/flunitrazepam_2624]\n* In Ireland, flunitrazepam is a Schedule 3 controlled substance with strict restrictions.[http://www.irishstatutebook.ie/1993/en/si/0342.html Irish Statute Book, Statutory Instruments, S.I. No. 342/1993 — Misuse of Drugs (Amendment) Regulations, 1993]\n* In Japan, flunitrazepam is marketed by Japanese pharmaceutical company Chugai under the tradename Rohypnol and is indicated for the treatment of insomnia as well as used for preanesthetic medication.\n* In Mexico, Rohypnol is approved for medical use.\n* In Norway, on January 1, 2003, flunitrazepam was moved up one level in the schedule of controlled drugs and, on August 1, 2004, the manufacturer Roche removed Rohypnol from the market there altogether.\n* In South Africa, Rohypnol is classified as a schedule 6 drug. It is available by prescription only, and restricted to 1 mg doses. Travelers from South Africa to the United States are limited to a 30-day supply. The drug must be declared to US Customs upon arrival. If a valid prescription cannot be produced, the drug may be subject to Customs search and seizure, and the traveler may face criminal charges or deportation.\n* In Sweden, flunitrazepam is available from Mylan.http://www.fass.se/LIF/produktfakta/substance_products.jsp?substanceId=IDE4POCOU9OKGVERT1 It is listed as a List IV (Schedule IV) under the Narcotics Control Act (1968).\n* In the United Kingdom, flunitrazepam is not licensed for medical use and is a controlled drug under Schedule 3 and Class C[https://www.gov.uk/government/publications/controlled-drugs-list--2/list-of-most-commonly-encountered-drugs-currently-controlled-under-the-misuse-of-drugs-legislation List of most commonly encountered drugs currently controlled under the misuse of drugs legislation] Published 26 May 2016\n* In the United States, the drug has not been approved by the Food and Drug Administration and is considered to be an illegal drug; as of 2016 it is Schedule IV.DEA [Lists of Scheduling Actions Controlled Substances Regulated Chemicals May 2016]  and  provide for punishment for the importation and distribution of up to 20 years in prison and a fine; possession is punishable by three years and a fine.Center for Substance Abuse Research at the University of Maryland [http://www.cesar.umd.edu/cesar/drugs/rohypnol.asp Flunitrazepam (Rohypnol)] Last Updated on Tuesday, October 29, 2013\n\nNames\n\nFlunitrazepam is marketed under many brand names in the countries where it is legal.Drugs.com [https://www.drugs.com/international/flunitrazepam.html International brands for Flunitrazepam] Page accessed April 13, 2016 It also has many street names, including \"roofies\" or \"ruffies\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Flunitrazepam" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11725" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Flunitrazepam, also known as Rohypnol among other names, is an intermediate acting benzodiazepine used in some countries to treat severe insomnia and in fewer, early in anesthesia.\n\nJust as with other hypnotics, flunitrazepam should be strictly used only on a short-term basis or by those with chronic insomnia on an occasional basis. Flunitrazepam has been referred to as a date rape drug even though its incidence is very rare in reported rape cases.European Monitoring Centre for Drugs and Drug Addiction [http://www.emcdda.europa.eu/publications/drug-profiles/benzodiazepine Benzodiazepines drug profile]. Page last updated January 8, 2015\n\nUse\n\nIn countries where the drug is still used, it is used for treatment of insomnia, and in some countries to begin anesthesia as well; these were also the indications in which it was originally studied.Mattila MA, Larni HM. Flunitrazepam: a review of its pharmacological properties and therapeutic use. Drugs. 1980 Nov;20(5):353-74. \n\nAdverse effects\n\nAdverse effects of flunitrazepam include dependence, both physical and psychological; reduced sleep quality resulting in somnolence; and overdose, resulting in excessive sedation, impairment of balance and speech, respiratory depression or coma, and possibly death. Because of the latter, flunitrazepam is commonly used in suicide. When used in pregnancy, it might cause hypotonia.\n\nDependence\n\nFlunitrazepam as with other benzodiazepines can lead to drug dependence and benzodiazepine withdrawal syndrome. Discontinuation may result in the appearance of withdrawal symptoms when the drug is discontinued. Abrupt withdrawal may lead to a benzodiazepine withdrawal syndrome characterised by seizures, psychosis, insomnia, and anxiety. Rebound insomnia, worse than baseline insomnia, typically occurs after discontinuation of flunitrazepam even after short-term single nightly dose therapy.\n\nSleep depth\n\nFlunitrazepam produces a decrease in delta wave activity. The effect of benzodiazepine drugs on delta waves, however, may not be mediated via benzodiazepine receptors. Delta activity is an indicator of depth of sleep within non-REM sleep; increased levels of delta sleep reflects better quality of sleep. Thus, flunitrazepam and other benzodiazepines cause a deterioration in sleep quality. Cyproheptadine may be superior to benzodiazepines in the treatment of insomnia as it enhances sleep quality based on EEG studies.\n\nParadoxical effects\n\nFlunitrazepam may cause a paradoxical reaction in some individuals causing symptoms including anxiety, aggressiveness, agitation, confusion, disinhibition, loss of impulse control, talkativeness, violent behavior, and even convulsions. Paradoxical adverse effects may even lead to criminal behaviour.\n\nHypotonia\n\nBenzodiazepines such as flunitrazepam are lipophilic and rapidly penetrate membranes and, therefore, rapidly cross over into the placenta with significant uptake of the drug. Use of benzodiazepines including flunitrazepam in late pregnancy, especially high doses, may result in hypotonia, also known as floppy baby syndrome.\n\nOther\n\nFlunitrazepam impairs cognitive functions. This may appear as lack of concentration, confusion and anterograde amnesia. It can be described as a hangover-like effect which can persist to the next day. It also impairs psychomotor functions similar to other benzodiazepines and nonbenzodiazepine hypnotic drugs; falls and hip fractures were frequently reported. The combination with alcohol increases these impairments. Partial, but incomplete tolerance develops to these impairments.\n\nOther adverse effects include:\n* Slurred speech\n* Gastrointestinal disturbances, lasting 12 or more hours\n* Vomiting\n* Respiratory depression in higher doses\n;Special precautions\nBenzodiazepines require special precaution if used in the elderly, during pregnancy, in children, in alcohol- or drug-dependent individuals, and in individuals with comorbid psychiatric disorders.\n\nImpairment of driving skills with a resultant increased risk of road traffic accidents is probably the most important adverse effect. This side-effect is not unique to flunitrazepam but also occurs with other hypnotic drugs. Flunitrazepam seems to have a particularly high risk of road traffic accidents compared to other hypnotic drugs. Extreme caution should be exercised by drivers after taking flunitrazepam.UK Dept. of Transport. July 2014. [https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/325275/healthcare-profs-drug-driving.pdf Guidance for healthcare professionals on drug driving]\n\nInteractions\n\nThe use of flunitrazepam in combination with alcoholic beverages synergizes the adverse effects, and can lead to toxicity and death.\n\nOverdose\n\nFlunitrazepam is a drug that is frequently involved in drug intoxication, including overdose. Overdose of flunitrazepam may result in excessive sedation, or impairment of balance or speech. This may progress in severe overdoses to respiratory depression or coma and possibly death. The risk of overdose is increased if flunitrazepam is taken in combination with CNS depressants such as ethanol (alcohol) and opioids. Flunitrazepam overdose responds to the benzodiazepine receptor antagonist flumazenil, which thus can be used as a treatment.\n\nDetection\n\nAs of 2016, blood tests can identify flunitrazepam at concentrations of as low as 4 ng/ml; the elimination half life of the drug is 11–25 hours. For urine samples, metabolites can be identified 60 hours to 28 days, depending on the dose and analytical method used. Hair and saliva can also be analyzed; hair is useful when a long time has transpired since ingestion, and saliva for workplace drug tests.\n\nFlunitrazepam can be measured in blood or plasma to confirm a diagnosis of poisoning in hospitalized patients, provide evidence in an impaired driving arrest, or assist in a medicolegal death investigation. Blood or plasma flunitrazepam concentrations are usually in a range of 5–20 μg/L in persons receiving the drug therapeutically as a nighttime hypnotic, 10–50 μg/L in those arrested for impaired driving and 100–1000 μg/L in victims of acute fatal overdosage. Urine is often the preferred specimen for routine drug abuse monitoring purposes. The presence of 7-aminoflunitrazepam, a pharmacologically-active metabolite and in vitro degradation product, is useful for confirmation of flunitrazepam ingestion. In postmortem specimens, the parent drug may have been entirely degraded over time to 7-aminoflunitrazepam.Jones AW, Holmgren A, Kugelberg FC. Concentrations of scheduled prescription drugs in blood of impaired drivers: considerations for interpreting the results. Ther. Drug Monit. 29: 248–260, 2007.Robertson MD, Drummer OH. Stability of nitrobenzodiazepines in postmortem blood. J. For. Sci. 43: 5–8, 1998.R. Baselt, Disposition of Toxic Drugs and Chemicals in Man, 8th edition, Biomedical Publications, Foster City, CA, 2008, pp. 633–635. Other metabolites include desmethylflunitrazepam and 3-hydroxydesmethylflunitrazepam.\n\nPharmacology\n\nThe main pharmacological effects of flunitrazepam are the enhancement of GABA at various GABA receptors.\n\nWhile 80% of flunitrazepam that is taken orally is absorbed, bioavailability in suppository form is closer to 50%.\n\nFlunitrazepam has a long half-life of 18–26 hours, which means that flunitrazepam's effects after nighttime administration persist throughout the next day.\n\nFlunitrazepam is lipophilic and is metabolised hepatically via oxidative pathways. The enzyme CYP3A4 is the main enzyme in its phase 1 metabolism in human liver microsomes.\n\nChemistry\n\nFlunitrazepam is classed as a nitro-benzodiazepine. It is the fluorinated N-methyl derivative of nitrazepam. Other nitro-benzodiazepines include nitrazepam (the parent compound), nimetazepam (methylamino derivative) and clonazepam (2ʹ-chlorinated derivative).\n\nHistory\n\nFlunitrazepam was discovered at Roche as part of the benzodiazepine work led by Leo Sternbach; the patent application was filed in 1962 and it was first marketed in 1974.Erika M Alapi and Janos Fischer. Table of Selected Analogue Classes. Part III of Analogue-based Drug Discovery Eds Janos Fischer, C. Robin Ganellin. John Wiley & Sons, 2006  [https://books.google.com/books?idFjKfqkaKkAAC&pg\nPA537 Pg 537] which refers to [http://www.google.com/patents/US3116203 US patent 3,116,203] Oleaginous systemsJenny Bryan for The Pharmaceutical Journal. Sept 18 2009 [http://www.pharmaceutical-journal.com/opinion/comment/landmark-drugs-the-discovery-of-benzodiazepines-and-the-adverse-publicity-that-followed/10978453.article Landmark drugs: The discovery of benzodiazepines and the adverse publicity that followed]\n\nDue to abuse of the drug for date rape and recreation, in 1998 Roche modified the formulation to give lower doses, make it less soluble, and add a blue dye for easier detection in drinks.Kiss, B et al. Assays for Flunitrazepam. Chapter 48 in Neuropathology of Drug Addictions and Substance Misuse Volume 2: Stimulants, Club and Dissociative Drugs, Hallucinogens, Steroids, Inhalants and International Aspects. Editor, Victor R. Preedy. Academic Press, 2016  [https://books.google.com/books?id\nzu5eBwAAQBAJ&pgPA513 Page 513ff] It was never marketed in the US, and by 2016 had been withdrawn from the markets in Spain, France, Germany, and the UK.\n\nSociety and culture\n\nRecreational and illegal uses\n\nRecreational use\n\nA 1989 journal on Clinical Pharmacology reports that benzodiazepines accounted for 52% of prescription forgeries, suggesting that benzodiazepines was a major prescription drug class of abuse. Nitrazepam accounted for 13% of forged prescriptions.\n\nFlunitrazepam and other sedative hypnotic drugs are detected frequently in cases of people suspected of driving under the influence of drugs. Other benzodiazepines and nonbenzodiazepines (anxiolytic or hypnotic) such as zolpidem and zopiclone (as well as cyclopyrrolones, imidazopyridines, and pyrazolopyrimidines) are also found in high numbers of suspected drugged drivers. Many drivers have blood levels far exceeding the therapeutic dose range suggesting a high degree of abuse potential for benzodiazepines and similar drugs.\n\nSuicide\n\nIn studies in Sweden, flunitrazepam was the second most common drug used in suicides, being found in about 16% of cases. In a retrospective Swedish study of 1587 deaths, in 159 cases benzodiazepines were found. In suicides when benzodiazepines were implicated, the benzodiazepines flunitrazepam and nitrazepam were occurring in significantly higher concentrations, compared to natural deaths. In 4 of the 159 cases, where benzodiazepines were found, benzodiazepines alone were the only cause of death. It was concluded that flunitrazepam and nitrazepam might be more toxic than other benzodiazepines.\n\nDrug-facilitated sexual assault\n\nFlunitrazepam is known to induce anterograde amnesia in sufficient doses; individuals are unable to remember certain events that they experienced while under the influence of the drug, which complicates investigations.  This effect could be particularly dangerous if flunitrazepam is used to aid in the commission of sexual assault; victims may be unable to clearly recall the assault, the assailant, or the events surrounding the assault.\n\nWhile use of flunitrazepam in sexual assault has been prominent in the media, as of 2015 appears to be fairly rare, and use of alcohol and other benzodiazepine drugs in date rape appears to be a larger but underreported problem.\n\nDrug-facilitated robbery\n\nIn the United Kingdom, the use of flunitrazepam and other \"date rape\" drugs have also been connected to stealing from sedated victims. An activist quoted by a British newspaper estimated that up to 2,000 individuals are robbed each year after being spiked with powerful sedatives, making drug-assisted robbery a more commonly reported problem than drug-assisted rape.\n\nRegional use\n\nFlunitrazepam is a Schedule III drug under the international Convention on Psychotropic Substances of 1971.International Narcotics Control Board [http://www.incb.org/documents/Psychotropics/greenlist/Green_list_ENG_2015_new.pdf List of Psychotropic Substances under International Control] Green List 26th edition, 2015\n* In Australia, as of 2013 the drug was authorized for prescribing for severe cases of insomnia but was restricted as a Schedule 8 medicine.\n* In France, as of 2016 flunitrazepam was not marketed.\n* In Germany, as of 2016 flunitrazepam is an Anlage III Betäubungsmittel (controlled substance which is allowed to be marketed and prescribed by physicians under specific provisions) and is available on a special narcotic drug prescription as the Rohypnol 1 mg film-coated tablets and several generic preparations (November 2016). [https://www.gelbe-liste.de/wirkstoffe/flunitrazepam_2624]\n* In Ireland, flunitrazepam is a Schedule 3 controlled substance with strict restrictions.[http://www.irishstatutebook.ie/1993/en/si/0342.html Irish Statute Book, Statutory Instruments, S.I. No. 342/1993 — Misuse of Drugs (Amendment) Regulations, 1993]\n* In Japan, flunitrazepam is marketed by Japanese pharmaceutical company Chugai under the tradename Rohypnol and is indicated for the treatment of insomnia as well as used for preanesthetic medication.\n* In Mexico, Rohypnol is approved for medical use.\n* In Norway, on January 1, 2003, flunitrazepam was moved up one level in the schedule of controlled drugs and, on August 1, 2004, the manufacturer Roche removed Rohypnol from the market there altogether.\n* In South Africa, Rohypnol is classified as a schedule 6 drug. It is available by prescription only, and restricted to 1 mg doses. Travelers from South Africa to the United States are limited to a 30-day supply. The drug must be declared to US Customs upon arrival. If a valid prescription cannot be produced, the drug may be subject to Customs search and seizure, and the traveler may face criminal charges or deportation.\n* In Sweden, flunitrazepam is available from Mylan.http://www.fass.se/LIF/produktfakta/substance_products.jsp?substanceId=IDE4POCOU9OKGVERT1 It is listed as a List IV (Schedule IV) under the Narcotics Control Act (1968).\n* In the United Kingdom, flunitrazepam is not licensed for medical use and is a controlled drug under Schedule 3 and Class C[https://www.gov.uk/government/publications/controlled-drugs-list--2/list-of-most-commonly-encountered-drugs-currently-controlled-under-the-misuse-of-drugs-legislation List of most commonly encountered drugs currently controlled under the misuse of drugs legislation] Published 26 May 2016\n* In the United States, the drug has not been approved by the Food and Drug Administration and is considered to be an illegal drug; as of 2016 it is Schedule IV.DEA [Lists of Scheduling Actions Controlled Substances Regulated Chemicals May 2016]  and  provide for punishment for the importation and distribution of up to 20 years in prison and a fine; possession is punishable by three years and a fine.Center for Substance Abuse Research at the University of Maryland [http://www.cesar.umd.edu/cesar/drugs/rohypnol.asp Flunitrazepam (Rohypnol)] Last Updated on Tuesday, October 29, 2013\n\nNames\n\nFlunitrazepam is marketed under many brand names in the countries where it is legal.Drugs.com [https://www.drugs.com/international/flunitrazepam.html International brands for Flunitrazepam] Page accessed April 13, 2016 It also has many street names, including \"roofies\" or \"ruffies\". Flunitrazepam. http://en.wikipedia.org/?curid=11725."
  }
}
