{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1948",
  "eid" : "bcbafc20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778396386,
  "textBody" : "Ally McBeal is an American legal comedy-drama television series, originally aired on Fox from September 8, 1997 to May 20, 2002. Created by David E. Kelley, the series stars Calista Flockhart in the title role as a lawyer working in the fictional Boston law firm Cage and Fish, with other lawyers whose lives and loves were eccentric, humorous, and dramatic. The series received critical acclaim in its early seasons, winning the Golden Globe Award for Best Television Series – Musical or Comedy in 1997 and 1998, and also winning the Emmy Award for Outstanding Comedy Series in 1999.\n\nOverview\n\nThe series, set in the fictional Boston law firm Cage and Fish, begins with main character Allison Marie \"Ally\" McBeal joining the firm (co-owned by her law school classmate Richard Fish, played by Greg Germann) after leaving her previous job due to sexual harassment. On her first day, Ally is horrified to find that she will be working alongside her ex-boyfriend Billy Thomas (Gil Bellows)—who she has never gotten over. To make things worse, Billy is now married to fellow lawyer Georgia (Courtney Thorne-Smith), who also and later joins Cage and Fish. The triangle among the three forms the basis for the main plot for the show's first three seasons.\n\nAlthough ostensibly a legal drama, the main focus of the series was the romantic and personal lives of the main characters, often using legal proceedings as plot devices to contrast or reinforce a character's drama. For example, bitter divorce litigation of a client might provide a backdrop for Ally's decision to break up with a boyfriend. Legal arguments were also frequently used to explore multiple sides of various social issues.\n\nCage & Fish (which becomes Cage/Fish & McBeal or Cage, Fish, & Associates towards the end of the series), the fictional law firm where most of the characters work, is depicted as a highly sexualized environment symbolized by its unisex restroom. Lawyers and secretaries in the firm routinely date, flirt with, or have a romantic history with each other and frequently run into former or potential romantic interests in the courtroom or on the street outside.\n\nThe series had many offbeat and frequently surreal running gags and themes, such as Ally's tendency to immediately fall over whenever she met somebody she found attractive, or Richard Fish's wattle fetish and humorous mottos (\"Fishisms\" & \"Bygones\"), or John's gymnastic dismounts out of the office's unisex bathroom stalls, or the dancing twins (played by Eric & Steve Cohen) at the bar, that ran through the series. The show used vivid, dramatic fantasy sequences for Ally's and other characters' wishful thinking; particularly notable is the dancing baby.\n\nThe series also featured regular visits to a local bar where singer Vonda Shepard regularly performed (though occasionally handing over the microphone to the characters). The series also took place in the same continuity as David E. Kelley's legal drama The Practice (which aired on ABC), as the two shows crossed over with one another on occasion, a very rare occurrence for two shows that aired on different networks.\n\nUltimately, in the last installment of the fifth and final season, \"Bygones,\" Ally decided to resign from Cage & Fish, leave Boston, and return to New York City.\n\nMain cast\n\nEpisodes\n\nIn Australia, Ally McBeal was aired by the Seven Network from 1997 to 2002. In 2010, it was aired repeatedly by Network Ten.\n\nCrossovers with The Practice\n\nSeymore Walsh, a stern judge often exasperated by the eccentricities of the Cage & Fish lawyers and played by actor Albert Hall, was also a recurring character on The Practice. In addition, Judge Jennifer (Whipper) Cone appears on The Practice episode \"Line of Duty\" (S02 E15), while Judge Roberta Kittelson, a recurring character on The Practice, has a featured guest role in the Ally McBeal episode \"Do you Wanna Dance?\"\n\nMost of the primary Practice cast members guest starred in the Ally McBeal episode \"The Inmates\" (S01 E20), in a storyline that concluded with the Practice episode \"Axe Murderer\" (S02 E26), featuring Calista Flockhart and Gil Bellows reprising their Ally characters. What's unusual about this continuing storyline is that Ally McBeal and The Practice aired on different networks.  Bobby Donnell, the main character of The Practice played by Dylan McDermott, was featured heavily in both this crossover and another Ally McBeal episode, \"These are the Days\".\n\nRegular Practice cast members Lara Flynn Boyle and Michael Badalucco each had a cameo in Ally McBeal (Boyle as a woman who trades insults with Ally in the episode \"Making Spirits Bright\" and Badalucco as one of Ally's dates in the episode \"I Know him by Heart\") but it is unclear whether they were playing the same characters they play on The Practice.\n\nReception\n\nUpon premiering in 1997, the show was an instant hit, averaging around 11 million viewers per episode. The show's second season saw an increase in ratings and soon became a top 20 show, averaging around 13 million viewers per episode. The show's ratings began to decline in the third season, but stabilized in the fourth season after Robert Downey Jr. joined the regular cast as Ally's boyfriend Larry Paul, and a fresher aesthetic was created by new art director Matthew DeCoste. However, Downey's character was written out after the end of the season due to the actor's troubles with drug addiction.\n\nThe first two seasons, as well as the fourth, remain the most critically acclaimed and saw the most awards success at the Emmys, SAG Awards and the Golden Globes. In 2007 Ally McBeal placed #48 on Entertainment Weekly 2007 \"New TV Classics\" list.\n\nRatings\n\nFeminist criticism\n\nAlly McBeal received some criticism from TV critics and feminists who found the title character annoying and demeaning to women (specifically regarding professional womenMichelle L. Hammers, \"Cautionary Tales of Liberation and Female Professionalism: The Case Against Ally McBeal\" Western Journal of Communication 69 2, April (2005): 168. \"The ease with which McBeals depictions of women are reincorporated into dominant masculinist discourses ... is particularly problematic for professional women. The increased danger that co-optation poses for professional women is due to the complex ways in which the discursive sedimentation that surrounds the female body, particularly as it has been traditionally sexualized and linked to emotionality, operates as a barrier to women's full and effective participation in professional spheres. Thus, McBeal operates as a cautionary tale about the dangers presented by the co-optation of postfeminist and third-wave feminist discourses as they relate to current professional discourses surrounding the female body.) because of her perceived flightiness, lack of demonstrated legal knowledge, short skirts, and emotional instability. Perhaps the most notorious example of the debate sparked by the show was the June 29, 1998 cover story of Time magazine, which juxtaposed McBeal with three pioneering feminists (Susan B. Anthony, Betty Friedan, Gloria Steinem) and asked \"Is Feminism Dead?\"http://content.time.com/time/covers/0,16641,19980629,00.html In episode 12 of the second season of the show, Ally talks to her co-worker John Cage about a dream she had, saying \"You know, I had a dream that they put my face on the cover of Time magazine as 'the face of feminism'.\":File:Is Feminism Dead - Time cover.jpg\n\nMusic\n\nAlly McBeal was a heavily music-oriented show. Vonda Shepard, a virtually unknown musician at the time, was featured continually on the show. Her song \"Searchin' My Soul\" became the show's theme song. Many of the songs Shepard performed were established hits with lyrics that paralleled the events of the episode, including \"Both Sides Now\", \"Hooked on a Feeling\" and \"Tell Him\". Besides recording background music for the show, Shepard frequently appeared at the ends of episodes as a musician performing at a local piano bar frequented by the main characters. On rare occasions, her character would have conventional dialogue. A portion of \"Searchin' My Soul\" was played at the beginning of each episode, but remarkably the song was never played in its entirety.\n\nSeveral of the characters had a musical leitmotif that played when they appeared. John Cage's was \"You're the First, the Last, My Everything\", Ling Woo's was the Wicked Witch of the West theme from The Wizard of Oz, and Ally McBeal herself picked \"Tell Him\", when told by a psychiatrist that she needed a theme.\n\nDue to the popularity of the show and Shepard's music, a soundtrack titled Songs from Ally McBeal was released in 1998, as well as a successor soundtrack titled Heart and Soul: New Songs From Ally McBeal in 1999. Two compilation albums from the show featuring Shepard were also released in 2000 and 2001. A Christmas album was also released under the title Ally McBeal: A Very Ally Christmas.[https://www.amazon.com/The-Man-With-Bag/dp/B00138A8P0 Ally McBeal: A Very Ally Christmas (2000) Sony Music] The album received positive reviews, and Shephard’s version of Kay Starr’s Christmas song \"(Everybody's Waitin' For) The Man with the Bag\", received considerable airplay during the holiday season.Atkinson, Terry (December 3, 2000) \"TV Shows Breed Christmas Albums\" The Post-Tribune (Gary, Indiana) (Entertainment News Service), page D-5.[http://0-search.proquest.com.libsys.arlingtonva.us/newsstand/docview/343646798/13B3F42545B27DF2559/7?accountid=46215]\n\nOther artists featured on the show include Michael Jackson, Barry White, Al Green, Tina Turner, Macy Gray, Gloria Gaynor, Chayanne, Barry Manilow, Anastacia, Elton John, Sting and Mariah Carey.  Josh Groban played the role of Malcolm Wyatt in the May 2001 season finale, performing \"You're Still You\". The series creator, David E. Kelley, was impressed with Groban's performance at The Family Celebration event and based on the audience reaction to Groban's singing, Kelley created a character for him in that finale. The background score for the show was composed by Danny Lux.\n\nDVD releases\n\nDue to music licensing issues, none of the seasons of Ally McBeal were available on DVD in the United States (only 6 random episodes could be found on the R1 edition) until 2009, though the show had been available in Italy, Belgium, the Netherlands, Japan, Hong Kong, Portugal, Spain, France, Germany, the United Kingdom, Mexico, Taiwan, Australia, Brazil, and the Czech Republic with all the show's music intact since 2005. In the UK, Ireland, and Spain all seasons are available in a complete box set.\n\n20th Century Fox released the complete first season on DVD in Region 1 on October 6, 2009. They also released a special complete series edition on the same day. Season 1 does not contain any special features, but the complete series set contains several bonus features, including featurettes, an all-new retrospective, the episode of The Practice in which Calista Flockhart guest starred, and a bonus disc entitled \"The Best of Ally McBeal Soundtrack.\" In addition, both releases contain all of the original music. Season 2 was released on April 6, 2010. Seasons 3, 4, and 5 were all released on October 5, 2010.\n\nAlly (1999)\n\nIn 1999, at the height of the show's popularity, a half-hour version entitled Ally[http://www.imdb.com/title/tt0210403/ \"Ally\" (1999) at IMDB] began airing in parallel with the main program. This version, designed in a sitcom format, used re-edited scenes from the main program, along with previously unseen footage. The intention was to further develop the plots in the comedy-drama in a sitcom style. It also focused only on Ally's personal life, cutting all the courtroom plots. The repackaged show was cancelled partway through its initial run. While 13 episodes of Ally were produced, only ten aired.\n\nIn popular culture\n\nMcBeal and 1990s young affluent professional women were parodied in the song Ally McBeal (tune of \"Like a Rolling Stone\" by Bob Dylan) by a cappella group Da Vinci's Notebook on their album The Life and Times of Mike Fanning, released in 2000.\n\nIn episode 2, season 3 of the British comedy The Adam and Joe Show, the show was parodied as \"Ally McSqeal\" using soft toys.[https://www.youtube.com/watch?vgLjdlq21c5M&feature\nsh_e_se&list=SL The Adam and Joe Show]. YouTube. Retrieved on 2012-04-23.\n\nEpisode 12 of the first season of Futurama, \"When Aliens Attack\", centers on an invasion of Earth by the Omicronians precipitated by a signal loss during the climax of an episode of \"Single Female Lawyer\", whose main character is Jenny McNeal.\n\nAwards and nominations",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ally McBeal" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1948" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ally McBeal is an American legal comedy-drama television series, originally aired on Fox from September 8, 1997 to May 20, 2002. Created by David E. Kelley, the series stars Calista Flockhart in the title role as a lawyer working in the fictional Boston law firm Cage and Fish, with other lawyers whose lives and loves were eccentric, humorous, and dramatic. The series received critical acclaim in its early seasons, winning the Golden Globe Award for Best Television Series – Musical or Comedy in 1997 and 1998, and also winning the Emmy Award for Outstanding Comedy Series in 1999.\n\nOverview\n\nThe series, set in the fictional Boston law firm Cage and Fish, begins with main character Allison Marie \"Ally\" McBeal joining the firm (co-owned by her law school classmate Richard Fish, played by Greg Germann) after leaving her previous job due to sexual harassment. On her first day, Ally is horrified to find that she will be working alongside her ex-boyfriend Billy Thomas (Gil Bellows)—who she has never gotten over. To make things worse, Billy is now married to fellow lawyer Georgia (Courtney Thorne-Smith), who also and later joins Cage and Fish. The triangle among the three forms the basis for the main plot for the show's first three seasons.\n\nAlthough ostensibly a legal drama, the main focus of the series was the romantic and personal lives of the main characters, often using legal proceedings as plot devices to contrast or reinforce a character's drama. For example, bitter divorce litigation of a client might provide a backdrop for Ally's decision to break up with a boyfriend. Legal arguments were also frequently used to explore multiple sides of various social issues.\n\nCage & Fish (which becomes Cage/Fish & McBeal or Cage, Fish, & Associates towards the end of the series), the fictional law firm where most of the characters work, is depicted as a highly sexualized environment symbolized by its unisex restroom. Lawyers and secretaries in the firm routinely date, flirt with, or have a romantic history with each other and frequently run into former or potential romantic interests in the courtroom or on the street outside.\n\nThe series had many offbeat and frequently surreal running gags and themes, such as Ally's tendency to immediately fall over whenever she met somebody she found attractive, or Richard Fish's wattle fetish and humorous mottos (\"Fishisms\" & \"Bygones\"), or John's gymnastic dismounts out of the office's unisex bathroom stalls, or the dancing twins (played by Eric & Steve Cohen) at the bar, that ran through the series. The show used vivid, dramatic fantasy sequences for Ally's and other characters' wishful thinking; particularly notable is the dancing baby.\n\nThe series also featured regular visits to a local bar where singer Vonda Shepard regularly performed (though occasionally handing over the microphone to the characters). The series also took place in the same continuity as David E. Kelley's legal drama The Practice (which aired on ABC), as the two shows crossed over with one another on occasion, a very rare occurrence for two shows that aired on different networks.\n\nUltimately, in the last installment of the fifth and final season, \"Bygones,\" Ally decided to resign from Cage & Fish, leave Boston, and return to New York City.\n\nMain cast\n\nEpisodes\n\nIn Australia, Ally McBeal was aired by the Seven Network from 1997 to 2002. In 2010, it was aired repeatedly by Network Ten.\n\nCrossovers with The Practice\n\nSeymore Walsh, a stern judge often exasperated by the eccentricities of the Cage & Fish lawyers and played by actor Albert Hall, was also a recurring character on The Practice. In addition, Judge Jennifer (Whipper) Cone appears on The Practice episode \"Line of Duty\" (S02 E15), while Judge Roberta Kittelson, a recurring character on The Practice, has a featured guest role in the Ally McBeal episode \"Do you Wanna Dance?\"\n\nMost of the primary Practice cast members guest starred in the Ally McBeal episode \"The Inmates\" (S01 E20), in a storyline that concluded with the Practice episode \"Axe Murderer\" (S02 E26), featuring Calista Flockhart and Gil Bellows reprising their Ally characters. What's unusual about this continuing storyline is that Ally McBeal and The Practice aired on different networks.  Bobby Donnell, the main character of The Practice played by Dylan McDermott, was featured heavily in both this crossover and another Ally McBeal episode, \"These are the Days\".\n\nRegular Practice cast members Lara Flynn Boyle and Michael Badalucco each had a cameo in Ally McBeal (Boyle as a woman who trades insults with Ally in the episode \"Making Spirits Bright\" and Badalucco as one of Ally's dates in the episode \"I Know him by Heart\") but it is unclear whether they were playing the same characters they play on The Practice.\n\nReception\n\nUpon premiering in 1997, the show was an instant hit, averaging around 11 million viewers per episode. The show's second season saw an increase in ratings and soon became a top 20 show, averaging around 13 million viewers per episode. The show's ratings began to decline in the third season, but stabilized in the fourth season after Robert Downey Jr. joined the regular cast as Ally's boyfriend Larry Paul, and a fresher aesthetic was created by new art director Matthew DeCoste. However, Downey's character was written out after the end of the season due to the actor's troubles with drug addiction.\n\nThe first two seasons, as well as the fourth, remain the most critically acclaimed and saw the most awards success at the Emmys, SAG Awards and the Golden Globes. In 2007 Ally McBeal placed #48 on Entertainment Weekly 2007 \"New TV Classics\" list.\n\nRatings\n\nFeminist criticism\n\nAlly McBeal received some criticism from TV critics and feminists who found the title character annoying and demeaning to women (specifically regarding professional womenMichelle L. Hammers, \"Cautionary Tales of Liberation and Female Professionalism: The Case Against Ally McBeal\" Western Journal of Communication 69 2, April (2005): 168. \"The ease with which McBeals depictions of women are reincorporated into dominant masculinist discourses ... is particularly problematic for professional women. The increased danger that co-optation poses for professional women is due to the complex ways in which the discursive sedimentation that surrounds the female body, particularly as it has been traditionally sexualized and linked to emotionality, operates as a barrier to women's full and effective participation in professional spheres. Thus, McBeal operates as a cautionary tale about the dangers presented by the co-optation of postfeminist and third-wave feminist discourses as they relate to current professional discourses surrounding the female body.) because of her perceived flightiness, lack of demonstrated legal knowledge, short skirts, and emotional instability. Perhaps the most notorious example of the debate sparked by the show was the June 29, 1998 cover story of Time magazine, which juxtaposed McBeal with three pioneering feminists (Susan B. Anthony, Betty Friedan, Gloria Steinem) and asked \"Is Feminism Dead?\"http://content.time.com/time/covers/0,16641,19980629,00.html In episode 12 of the second season of the show, Ally talks to her co-worker John Cage about a dream she had, saying \"You know, I had a dream that they put my face on the cover of Time magazine as 'the face of feminism'.\":File:Is Feminism Dead - Time cover.jpg\n\nMusic\n\nAlly McBeal was a heavily music-oriented show. Vonda Shepard, a virtually unknown musician at the time, was featured continually on the show. Her song \"Searchin' My Soul\" became the show's theme song. Many of the songs Shepard performed were established hits with lyrics that paralleled the events of the episode, including \"Both Sides Now\", \"Hooked on a Feeling\" and \"Tell Him\". Besides recording background music for the show, Shepard frequently appeared at the ends of episodes as a musician performing at a local piano bar frequented by the main characters. On rare occasions, her character would have conventional dialogue. A portion of \"Searchin' My Soul\" was played at the beginning of each episode, but remarkably the song was never played in its entirety.\n\nSeveral of the characters had a musical leitmotif that played when they appeared. John Cage's was \"You're the First, the Last, My Everything\", Ling Woo's was the Wicked Witch of the West theme from The Wizard of Oz, and Ally McBeal herself picked \"Tell Him\", when told by a psychiatrist that she needed a theme.\n\nDue to the popularity of the show and Shepard's music, a soundtrack titled Songs from Ally McBeal was released in 1998, as well as a successor soundtrack titled Heart and Soul: New Songs From Ally McBeal in 1999. Two compilation albums from the show featuring Shepard were also released in 2000 and 2001. A Christmas album was also released under the title Ally McBeal: A Very Ally Christmas.[https://www.amazon.com/The-Man-With-Bag/dp/B00138A8P0 Ally McBeal: A Very Ally Christmas (2000) Sony Music] The album received positive reviews, and Shephard’s version of Kay Starr’s Christmas song \"(Everybody's Waitin' For) The Man with the Bag\", received considerable airplay during the holiday season.Atkinson, Terry (December 3, 2000) \"TV Shows Breed Christmas Albums\" The Post-Tribune (Gary, Indiana) (Entertainment News Service), page D-5.[http://0-search.proquest.com.libsys.arlingtonva.us/newsstand/docview/343646798/13B3F42545B27DF2559/7?accountid=46215]\n\nOther artists featured on the show include Michael Jackson, Barry White, Al Green, Tina Turner, Macy Gray, Gloria Gaynor, Chayanne, Barry Manilow, Anastacia, Elton John, Sting and Mariah Carey.  Josh Groban played the role of Malcolm Wyatt in the May 2001 season finale, performing \"You're Still You\". The series creator, David E. Kelley, was impressed with Groban's performance at The Family Celebration event and based on the audience reaction to Groban's singing, Kelley created a character for him in that finale. The background score for the show was composed by Danny Lux.\n\nDVD releases\n\nDue to music licensing issues, none of the seasons of Ally McBeal were available on DVD in the United States (only 6 random episodes could be found on the R1 edition) until 2009, though the show had been available in Italy, Belgium, the Netherlands, Japan, Hong Kong, Portugal, Spain, France, Germany, the United Kingdom, Mexico, Taiwan, Australia, Brazil, and the Czech Republic with all the show's music intact since 2005. In the UK, Ireland, and Spain all seasons are available in a complete box set.\n\n20th Century Fox released the complete first season on DVD in Region 1 on October 6, 2009. They also released a special complete series edition on the same day. Season 1 does not contain any special features, but the complete series set contains several bonus features, including featurettes, an all-new retrospective, the episode of The Practice in which Calista Flockhart guest starred, and a bonus disc entitled \"The Best of Ally McBeal Soundtrack.\" In addition, both releases contain all of the original music. Season 2 was released on April 6, 2010. Seasons 3, 4, and 5 were all released on October 5, 2010.\n\nAlly (1999)\n\nIn 1999, at the height of the show's popularity, a half-hour version entitled Ally[http://www.imdb.com/title/tt0210403/ \"Ally\" (1999) at IMDB] began airing in parallel with the main program. This version, designed in a sitcom format, used re-edited scenes from the main program, along with previously unseen footage. The intention was to further develop the plots in the comedy-drama in a sitcom style. It also focused only on Ally's personal life, cutting all the courtroom plots. The repackaged show was cancelled partway through its initial run. While 13 episodes of Ally were produced, only ten aired.\n\nIn popular culture\n\nMcBeal and 1990s young affluent professional women were parodied in the song Ally McBeal (tune of \"Like a Rolling Stone\" by Bob Dylan) by a cappella group Da Vinci's Notebook on their album The Life and Times of Mike Fanning, released in 2000.\n\nIn episode 2, season 3 of the British comedy The Adam and Joe Show, the show was parodied as \"Ally McSqeal\" using soft toys.[https://www.youtube.com/watch?vgLjdlq21c5M&feature\nsh_e_se&list=SL The Adam and Joe Show]. YouTube. Retrieved on 2012-04-23.\n\nEpisode 12 of the first season of Futurama, \"When Aliens Attack\", centers on an invasion of Earth by the Omicronians precipitated by a signal loss during the climax of an episode of \"Single Female Lawyer\", whose main character is Jenny McNeal.\n\nAwards and nominations. Ally McBeal. http://en.wikipedia.org/?curid=1948."
  }
}
