{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15287",
  "eid" : "1b0726f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778554591,
  "textBody" : "In mathematics, a series is, roughly speaking, a description of the operation of adding infinitely many quantities, one after the other, to a given starting quantity.  The study of series is a major part of calculus and its generalization, mathematical analysis. Series are used in most areas of mathematics, even for studying finite structures (such as in combinatorics), through generating functions. In addition to their ubiquity in mathematics, infinite series are also widely used in other quantitative disciplines such as physics, computer science, statistics and finance.\n\nFor a long time, the idea that such a potentially infinite summation could produce a finite result was considered paradoxical by mathematicians and philosophers. This paradox was resolved using the concept of a limit during the 19th century. Zeno's paradox of Achilles and the tortoise illustrates this counterintuitive property of infinite sums: Achilles runs after a tortoise, but when he reaches the position of the tortoise at the beginning of the race, the tortoise has reached a second position; when he reaches this second position, the tortoise is at a third position, and so on. Zeno concluded that Achilles could never reach the tortoise, and thus that movement does not exist. Zeno divided the race into infinitely many sub-races, each requiring a finite amount of time, so that the total time for Achilles to catch the tortoise is given by a series.  The resolution of the paradox is that, although the series has an infinite number of terms, it has a finite sum, which gives the time necessary for Achilles to catch the tortoise. \n\nIn modern terminology, any (ordered) infinite sequence (a_1,a_2,a_3,\\ldots) of terms (that is numbers, functions, or anything that can be added) defines a series, which is the operation of adding the a_i one after the other. To emphasize that there are an infinite number of terms, a series may be called an infinite series. Such a series is represented (or denoted) by an expression like \na_1+a_2+a_3+\\cdots,\nor, using the summation sign,\n\\sum_{i=1}^\\infty a_i.\n\nThe infinite sequence of additions implied by a series cannot be effectively carried on (at least in a finite amount of time). However, if the set to which the terms and their finite sums belong has a notion of limit, it is sometimes possible to assign a value to a series, called the sum of the series. This value is the limit as   tends to infinity (if the limit exists) of the finite sums of the  first terms of the series, which are called the th partial sums of the series. That is, \n\\sum_{i1}^\\infty a_i  \n \\lim_{n\\to\\infty} \\sum_{i=1}^n a_i.\nWhen this limit exists, one says that the series is convergent or summable, or that the sequence (a_1,a_2,a_3,\\ldots) is summable. In this case, the limit is called the sum of the series. Otherwise, the series is said to be divergent.\n\nGenerally, the terms of a series come from a ring, often the field \\Bbb R of the real numbers or the field \\Bbb C of the complex numbers. In this case, the set of all series is itself a ring (and even an associative algebra), in which the addition consists of adding the series term by term, and the multiplication is the Cauchy product.\n\nBasic properties\n\nAn infinite series or simply a series is an infinite sum, represented by an infinite expression of the form\na_0 + a_1 + a_2 + \\cdots, \nwhere (a_n) is any ordered sequence of terms, such as numbers, functions, or anything else that can be added (an abelian group).  This is an expression that is obtained from the list of terms a_0,a_1,\\dots by laying them side by side, and conjoining them with the symbol \"+\".  A series may also be represented by using summation notation, such as\n\\sum_{n=0}^{\\infty}a_n  .\n\nIf an abelian group A of terms has a concept of limit (for example, if it is a metric space), then some series, the convergent series, can be interpreted as having a value in A, called the sum of the series. This includes the common cases from calculus in which the group is the field of real numbers or the field of complex numbers. Given a series s\\sum_{n\n0}^\\infty a_n, its kth partial sum is\ns_k \\sum_{n\n0}^{k}a_n = a_0 + a_1 + \\cdots + a_k.\nBy definition, the series \\sum_{n0}^{\\infty} a_n converges to the limit  (or simply sums to ), if the sequence of its partial sums has a limit . In this case, one usually writes \nL \\sum_{n\n0}^{\\infty}a_n.\nA series is said to be convergent if it converges to some limit or divergent when it does not.  The value of this limit, if it exists, is then the value of the series.\n\nConvergent series\n\nA series  is said to converge or to be convergent when the sequence  of partial sums has a finite limit. If the limit of  is infinite or does not exist, the series is said to diverge. When the limit of partial sums exists, it is called the value (or sum) of the series\n\n\\sum_{n0}^\\infty a_n \n \\lim_{k\\to\\infty} s_k \\lim_{k\\to\\infty} \\sum_{n\n0}^k a_n.\n\nAn easy way that an infinite series can converge is if all the an are zero for n sufficiently large.  Such a series can be identified with a finite sum, so it is only infinite in a trivial sense.\n\nWorking out the properties of the series that converge even if infinitely many terms are non-zero is the essence of the study of series. Consider the example\n\n 1 + \\frac{1}{2}+ \\frac{1}{4}+ \\frac{1}{8}+\\cdots+ \\frac{1}{2^n}+\\cdots.\n\nIt is possible to \"visualize\" its convergence on the real number line: we can imagine a line of length 2, with successive segments marked off of lengths 1, ½, ¼, etc. There is always room to mark the next segment, because the amount of line remaining is always the same as the last segment marked: when we have marked off ½, we still have a piece of length ½ unmarked, so we can certainly mark the next ¼.  This argument does not prove that the sum is equal to 2 (although it is), but it does prove that it is at most 2.  In other words, the series has an upper bound. Given that the series converges, proving that it is equal to 2 requires only elementary algebra. If the series is denoted , it can be seen that\n\nS/2 \\frac{1+ \\frac{1}{2}+ \\frac{1}{4}+ \\frac{1}{8}+\\cdots}{2} \n \\frac{1}{2}+ \\frac{1}{4}+ \\frac{1}{8}+ \\frac{1}{16} +\\cdots.\n\nTherefore,\n\nS-S/2 1 \\Rightarrow S \n 2.\n\nMathematicians extend the idiom discussed earlier to other, equivalent notions of series. For instance, when we talk about a recurring decimal, as in\n\nx = 0.111\\dots \n\nwe are talking, in fact, just about the series\n\n\\sum_{n=1}^\\infty \\frac{1}{10^n}.\n\nBut since these series always converge to real numbers (because of what is called the completeness property of the real numbers), to talk about the series in this way is the same as to talk about the numbers for which they stand.  In particular, the decimal expansion 0.111… can be identified with 1/9.  This leads to an argument that , which only relies on the fact that the limit laws for series preserve the arithmetic operations; this argument is presented in the article 0.999....\n\nExamples of numerical series\n\n* A geometric series is one where each successive term is produced by multiplying the previous term by a constant number (called the common ratio in this context).  Example:\n:1 + {1 \\over 2} + {1 \\over 4} + {1 \\over 8} + {1 \\over 16} + \\cdots\\sum_{n\n0}^\\infty{1 \\over 2^n}.\nIn general, the geometric series\n:\\sum_{n=0}^\\infty z^n\nconverges if and only if |z| .\n\n* An arithmetico-geometric series is a generalization of the geometric series, which has coefficients of the common ratio equal to the terms in an arithmetic sequence.  Example:\n:3 + {5 \\over 2} + {7 \\over 4} + {9 \\over 8} + {11 \\over 16} + \\cdots\\sum_{n\n0}^\\infty{(3+2n) \\over 2^n}.\n\n* The harmonic series is the series\n:1 + {1 \\over 2} + {1 \\over 3} + {1 \\over 4} + {1 \\over 5} + \\cdots \\sum_{n\n1}^\\infty {1 \\over n}.\nThe harmonic series is divergent.\n\n* An alternating series is a series where terms alternate signs.  Examples:\n:1 - {1 \\over 2} + {1 \\over 3} - {1 \\over 4} + {1 \\over 5} - \\cdots \\sum_{n\n1}^\\infty {\\left(-1\\right)^{n-1} \\over n}=\\ln(2) \\quad  (alternating harmonic series)\n\nand\n\n:-1+\\frac{1}{3} - \\frac{1}{5} + \\frac{1}{7} - \\frac{1}{9} + \\cdots \\sum_{n\n1}^\\infty \\frac{\\left(-1\\right)^n}{2n-1} = -\\frac{\\pi}{4}\n\n*The p-series\n:\\sum_{n=1}^\\infty\\frac{1}{n^r}\nconverges if r > 1 and diverges for r ≤ 1, which can be shown with the integral criterion described below in convergence tests. As a function of r, the sum of this series is Riemann's zeta function.\n\n*A telescoping series\n:\\sum_{n=1}^\\infty (b_n-b_{n+1})\nconverges if the sequence bn converges to a limit L as n goes to infinity. The value of the series is then b1 − L.\n\n*There are some elementary series whose convergence is not yet known/proven. For example, it is unknown whether the Flint Hills series \n:\\sum_{n=1}^\\infty \\frac{\\csc^{2} n}{n^{3}}\nconverges or not. The convergence depends on how well \\pi can be approximated with rational numbers (which is unknown as of yet). More specifically, the values of n with large numerical contributions to the sum are the numerators of the continued fraction convergents of \\pi, a sequence beginning with 1, 3, 22, 333, 355, 103993, ... . These are integers that are close to n\\pi for some integer n, so that \\sin n\\pi is close to 0 and its reciprocal is large. Alekseyev (2011) proved that if the series converges, then the irrationality measure of \\pi is smaller than 2.5, which is much smaller than the current known bound of 7.6063....Max A. Alekseyev, [https://arxiv.org/abs/1104.5100 On convergence of the Flint Hills series],  \tarXiv:1104.5100, 2011.\n\nπ\n\n \\sum_{i1}^{\\infty} \\frac{1}{i^2} \n \\frac{1}{1^2} + \\frac{1}{2^2} + \\frac{1}{3^2} + \\frac{1}{4^2} + \\cdots = \\frac{\\pi^2}{6}\n\n \\sum_{i1}^\\infty \\frac{(-1)^{i+1}(4)}{2i-1} \n \\frac{4}{1} - \\frac{4}{3} + \\frac{4}{5} - \\frac{4}{7} + \\frac{4}{9} - \\frac{4}{11} + \\frac{4}{13} - \\cdots = \\pi\n\nNatural logarithm of 2\n\t\n\n\\sum_{i1}^\\infty \\frac{(-1)^{i+1}}{i} \n \\ln 2\n\n\\sum_{i0}^\\infty \\frac{1}{(2i+1)(2i+2)} \n \\ln 2\n\n\\sum_{i0}^\\infty \\frac{(-1)^i}{(i+1)(i+2)} \n 2\\ln(2) -1\n\n\\sum_{i1}^\\infty \\frac{1}{i(4i^2-1)} \n 2\\ln(2) -1\n\n \\sum_{i1}^\\infty \\frac{1}{2^{i}i} \n \\ln 2\n\n \\sum_{i1}^\\infty \\left(\\frac{1}{3^i}+\\frac{1}{4^i}\\right)\\frac{1}{i} \n \\ln 2\n\n \\sum_{i1}^\\infty \\frac{1}{2i(2i-1)} \n \\ln 2\n\nNatural logarithm base e\n\n\\sum_{i 0}^\\infty \\frac{(-1)^i}{i!} \n  1-\\frac{1}{1!}+\\frac{1}{2!}-\\frac{1}{3!}+\\cdots = \\frac{1}{e}\n\n \\sum_{i 0}^\\infty \\frac{1}{i!} \n \\frac{1}{0!} + \\frac{1}{1!} + \\frac{1}{2!} + \\frac{1}{3!} + \\frac{1}{4!} + \\cdots = e \n\nCalculus and partial summation as an operation on sequences\n\nPartial summation takes as input a sequence, { an }, and gives as output another sequence, { SN }. It is thus a unary operation on sequences. Further, this function is linear, and thus is a linear operator on the vector space of sequences, denoted Σ. The inverse operator is the finite difference operator, Δ. These behave as discrete analogs of integration and differentiation, only for series (functions of a natural number) instead of functions of a real variable. For example, the sequence {1, 1, 1, ...} has series {1, 2, 3, 4, ...} as its partial summation, which is analogous to the fact that \\int_0^x 1\\,dt = x.\n\nIn computer science it is known as prefix sum.\n\nProperties of series\n\nSeries are classified not only by whether they converge or diverge, but also by the properties of the terms an (absolute or conditional convergence); type of convergence of the series (pointwise, uniform); the class of the term an (whether it is a real number, arithmetic progression, trigonometric function); etc.\n\nNon-negative terms\n\nWhen an is a non-negative real number for every n, the sequence SN of partial sums is non-decreasing. It follows that a series ∑an with non-negative terms converges if and only if the sequence SN of partial sums is bounded.\n\nFor example, the series\n\n\\sum_{n = 1}^\\infty \\frac{1}{n^2}\n\nis convergent, because the inequality\n\n\\frac1 {n^2} \\le \\frac{1}{n-1} - \\frac{1}{n}, \\quad n \\ge 2,\n\nand a telescopic sum argument implies that the partial sums are bounded by 2. The exact value of the original series is the Basel problem.\n\nAbsolute convergence\n\nA series\n\\sum_{n=0}^\\infty a_n\nis said to converge absolutely if the series of absolute values\n\\sum_{n=0}^\\infty \\left|a_n\\right|\nconverges. This is sufficient to guarantee not only that the original series converges to a limit, but also that any reordering of it converges to the same limit.\n\nConditional convergence\n\nA series of real or complex numbers is said to be conditionally convergent (or semi-convergent) if it is convergent but not absolutely convergent. A famous example is the alternating series\n\n\\sum\\limits_{n1}^\\infty {(-1)^{n+1}  \\over n} \n 1 - {1 \\over 2} + {1 \\over 3} - {1 \\over 4} + {1 \\over 5} - \\cdots\n\nwhich is convergent (and its sum is equal to ln 2), but the series formed by taking the absolute value of each term is the divergent harmonic series. The Riemann series theorem says that any conditionally convergent series can be reordered to make a divergent series, and moreover, if the an are real and S is any real number, that one can find a reordering so that the reordered series converges with sum equal to S.\n\nAbel's test is an important tool for handling semi-convergent series. If a series has the form\n\n\\sum a_n = \\sum \\lambda_n b_n\n\nwhere the partial sums BN =  are bounded, λn has bounded variation, and  exists:\n\n\\sup_N \\Bigl| \\sum_{n=0}^N b_n \\Bigr| \n\nthen the series  is convergent.  This applies to the pointwise convergence of many trigonometric series, as in\n\n\\sum_{n=2}^\\infty \\frac{\\sin(n x)}{\\ln n}\n\nwith 0 n+1 = Bn+1 − Bn, and in performing a transformation similar to integration by parts (called summation by parts), that relates the given series  to the absolutely convergent series\n\n \\sum (\\lambda_n - \\lambda_{n+1}) \\, B_n.\n\nConvergence tests\n\n* n-th term test: If limn→∞ an ≠ 0 then the series diverges.\n*Comparison test 1 (see Direct comparison test): If ∑bn  is an absolutely convergent series such that |an | ≤ C |bn | for some number C  and for sufficiently large n , then ∑an  converges absolutely as well. If ∑|bn | diverges, and |an | ≥ |bn | for all sufficiently large n , then ∑an  also fails to converge absolutely (though it could still be conditionally convergent, e.g. if the an  alternate in sign).\n*Comparison test 2 (see Limit comparison test): If ∑bn  is an absolutely convergent series such that |an+1 /an | ≤ |bn+1 /bn | for sufficiently large n , then ∑an  converges absolutely as well. If ∑|bn | diverges, and |an+1 /an | ≥ |bn+1 /bn | for all sufficiently large n , then ∑an  also fails to converge absolutely (though it could still be conditionally convergent, e.g. if the an  alternate in sign).\n*Ratio test: If there exists a constant C n+1/an|n converges absolutely. When the ratio is less than 1, but not less than a constant less than 1, convergence is possible but this test does not establish it.\n*Root test: If there exists a constant C n|1/n ≤ C for all sufficiently large n, then ∑an converges absolutely.\n*Integral test: if ƒ(x) is a positive monotone decreasing function defined on the interval [1, ∞) with ƒ(n) = an for all n, then ∑an converges if and only if the integral  ∫1∞ ƒ(x) dx is finite.\n*Cauchy's condensation test: If an is non-negative and non-increasing, then the two series  ∑an  and  ∑2ka(2k) are of the same nature: both convergent, or both divergent.\n*Alternating series test: A series of the form ∑(−1)n an (with an > 0) is called alternating. Such a series converges if the sequence an is monotone decreasing and converges to 0. The converse is in general not true.\n*For some specific types of series there are more specialized convergence tests, for instance for Fourier series there is the Dini test.\n\nSeries of functions\n\nA series of real- or complex-valued functions\n\n\\sum_{n=0}^\\infty f_n(x)\n\nconverges pointwise on a set E, if the series converges for each x in E as an ordinary series of real or complex numbers.  Equivalently, the partial sums\ns_N(x) \\sum_{n\n0}^N f_n(x)\nconverge to ƒ(x) as N → ∞ for each x ∈ E.\n\nA stronger notion of convergence of a series of functions is called uniform convergence.  The series converges uniformly if it converges pointwise to the function ƒ(x), and the error in approximating the limit by the Nth partial sum,\n|s_N(x) - f(x)|\ncan be made minimal independently of x by choosing a sufficiently large N.\n\nUniform convergence is desirable for a series because many properties of the terms of the series are then retained by the limit.  For example, if a series of continuous functions converges uniformly, then the limit function is also continuous.  Similarly, if the ƒn are integrable on a closed and bounded interval I and converge uniformly, then the series is also integrable on I and can be integrated term-by-term. Tests for uniform convergence include the Weierstrass' M-test, Abel's uniform convergence test, Dini's test, and the Cauchy criterion.\n\nMore sophisticated types of convergence of a series of functions can also be defined.  In measure theory, for instance, a series of functions converges almost everywhere if it converges pointwise except on a certain set of measure zero.  Other modes of convergence depend on a different metric space structure on the space of functions under consideration.  For instance, a series of functions converges in mean on a set E to a limit function ƒ provided\n\\int_E \\left|s_N(x)-f(x)\\right|^2\\,dx \\to 0\nas N → ∞.\n\nPower series\n\nA power series is a series of the form\n\\sum_{n=0}^\\infty a_n(x-c)^n.\n\nThe Taylor series at a point c of a function is a power series that, in many cases, converges to the function in a neighborhood of c. For example, the series\n\\sum_{n=0}^{\\infty} \\frac{x^n}{n!}\nis the Taylor series of e^x at the origin and converges to it for every x.\n\nUnless it converges only at x=c, such a series converges on a certain open disc of convergence centered at the point c in the complex plane, and may also converge at some of the points of the boundary of the disc.  The radius of this disc is known as the radius of convergence, and can in principle be determined from the asymptotics of the coefficients an.  The convergence is uniform on closed and bounded (that is, compact) subsets of the interior of the disc of convergence: to wit, it is uniformly convergent on compact sets.\n\nHistorically, mathematicians such as Leonhard Euler operated liberally with infinite series, even if they were not convergent. When calculus was put on a sound and correct foundation in the nineteenth century, rigorous proofs of the convergence of series were always required. \n\nFormal power series \n\nWhile many uses of power series refer to their sums, it is also possible to treat power series as formal sums, meaning that no addition operations are actually performed, and the symbol \"+\" is an abstract symbol of conjunction which is not necessarily interpreted as corresponding to addition. In this setting, the sequence of coefficients itself is of interest, rather than the convergence of the series. Formal power series are used in combinatorics to describe and study sequences that are otherwise difficult to handle, for example using the method of generating functions.  The Hilbert–Poincaré series is a formal power series used to study graded algebras.\n\nEven if the limit of the power series is not considered, if the terms support appropriate structure then it is possible to define operations such as addition, multiplication, derivative, antiderivative for power series \"formally\", treating the symbol \"+\" as if it corresponded to addition. In the most common setting, the terms come from a commutative ring, so that the formal power series can be added term-by-term and multiplied via the Cauchy product. In this case the algebra of formal power series is the total algebra of the monoid of natural numbers over the underlying term ring.: §III.2.11.  If the underlying term ring is a differential algebra, then the algebra of formal power series is also a differential algebra, with differentiation performed term-by-term.\n\nLaurent series\n\nLaurent series generalize power series by admitting terms into the series with negative as well as positive exponents.  A Laurent series is thus any series of the form\n\\sum_{n=-\\infty}^\\infty a_n x^n.\nIf such a series converges, then in general it does so in an annulus rather than a disc, and possibly some boundary points.  The series converges uniformly on compact subsets of the interior of the annulus of convergence.\n\nDirichlet series\n\nA Dirichlet series is one of the form\n\n\\sum_{n=1}^\\infty {a_n \\over n^s},\n\nwhere s is a complex number.  For example, if all an are equal to 1, then the Dirichlet series is the Riemann zeta function\n\n\\zeta(s) \\sum_{n\n1}^\\infty \\frac{1}{n^s}.\n\nLike the zeta function, Dirichlet series in general play an important role in analytic number theory.  Generally a Dirichlet series converges if the real part of s is greater than a number called the abscissa of convergence.  In many cases, a Dirichlet series can be extended to an analytic function outside the domain of convergence by analytic continuation.  For example, the Dirichlet series for the zeta function converges absolutely when Re s > 1, but the zeta function can be extended to a holomorphic function defined on \\mathbf{C}\\setminus\\{1\\}  with a simple pole at 1.\n\nThis series can be directly generalized to general Dirichlet series.\n\nTrigonometric series\n\nA series of functions in which the terms are trigonometric functions is called a trigonometric series:\n\\tfrac12 A_0 + \\sum_{n=1}^\\infty \\left(A_n\\cos nx + B_n \\sin nx\\right).\nThe most important example of a trigonometric series is the Fourier series of a function.\n\nHistory of the theory of infinite series\n\nDevelopment of infinite series\n\nGreek mathematician Archimedes produced the first known summation of an infinite series with a\nmethod that is still used in the area of calculus today. He used the method of exhaustion to calculate the area under the arc of a parabola with the summation of an infinite series, and gave a remarkably accurate approximation of π.[http://eric.ed.gov/ERICWebPortal/custom/portlets/recordDetails/detailmini.jsp?_nfpbtrue&_&ERICExtSearch_SearchValue_0\nEJ502088&ERICExtSearch_SearchType_0no&accno\nEJ502088 Archimedes and Pi-Revisited.]\n\nMathematicians from Kerala, India studied infinite series around 1350 CE.http://www.manchester.ac.uk/discover/news/article/?id=2962\n\nIn the 17th century, James Gregory worked in the new decimal system on infinite series and published several Maclaurin series. In 1715, a general method for constructing the Taylor series for all functions for which they exist was provided by Brook Taylor. Leonhard Euler in the 18th century, developed the theory of hypergeometric series and q-series.\n\nConvergence criteria\n\nThe investigation of the validity of infinite series is considered to begin with Gauss in the 19th century. Euler had already considered the hypergeometric series\n\n1 + \\frac{\\alpha\\beta}{1\\cdot\\gamma}x + \\frac{\\alpha(\\alpha+1)\\beta(\\beta+1)}{1 \\cdot 2 \\cdot \\gamma(\\gamma+1)}x^2 + \\cdots\non which Gauss published a memoir in 1812. It established simpler criteria of convergence, and the questions of remainders and the range of convergence.\n\nCauchy (1821) insisted on strict tests of convergence; he showed that if two series are convergent their product is not necessarily so, and with him begins the discovery of effective criteria. The terms convergence and divergence had been introduced long before by Gregory (1668). Leonhard Euler and Gauss had given various criteria, and Colin Maclaurin had anticipated some of Cauchy's discoveries. Cauchy advanced the theory of power series by his expansion of a complex function in such a form.\n\nAbel (1826) in his memoir on the binomial series\n1 + \\frac{m}{1!}x + \\frac{m(m-1)}{2!}x^2 + \\cdots\n\ncorrected certain of Cauchy's conclusions, and gave a completely\nscientific summation of the series for complex values of m and x. He showed the necessity of considering the subject of continuity in questions of convergence.\n\nCauchy's methods led to special rather than general criteria, and\nthe same may be said of Raabe (1832), who made the first elaborate\ninvestigation of the subject, of De Morgan (from 1842), whose\nlogarithmic test DuBois-Reymond (1873) and Pringsheim (1889) have\nshown to fail within a certain region; of Bertrand (1842), Bonnet\n(1843), Malmsten (1846, 1847, the latter without integration);\nStokes (1847), Paucker (1852), Chebyshev (1852), and Arndt\n(1853).\n\nGeneral criteria began with Kummer (1835), and have been\nstudied by Eisenstein (1847), Weierstrass in his various\ncontributions to the theory of functions, Dini (1867),\nDuBois-Reymond (1873), and many others. Pringsheim's memoirs (1889) present the most complete general theory.\n\nUniform convergence\n\nThe theory of uniform convergence was treated by Cauchy (1821), his\nlimitations being pointed out by Abel, but the first to attack it\nsuccessfully were Seidel and Stokes (1847–48). Cauchy took up the\nproblem again (1853), acknowledging Abel's criticism, and reaching\nthe same conclusions which Stokes had already found. Thomae used the\ndoctrine (1866), but there was great delay in recognizing the\nimportance of distinguishing between uniform and non-uniform\nconvergence, in spite of the demands of the theory of functions.\n\nSemi-convergence\n\nA series is said to be semi-convergent (or conditionally convergent) if it is convergent but not absolutely convergent.\n\nSemi-convergent series were studied by Poisson (1823), who also gave a general form for the remainder of the Maclaurin formula. The most important solution of the problem is due, however, to Jacobi (1834),\nwho attacked the question of the remainder from a different standpoint and reached a different formula. This expression was also worked out, and another one given, by Malmsten (1847).  Schlömilch (Zeitschrift, Vol.I, p. 192, 1856) also improved Jacobi's remainder, and showed the relation between the remainder and Bernoulli's function\n\nF(x) = 1^n + 2^n + \\cdots + (x - 1)^n.\n\nGenocchi (1852) has further contributed to the theory.\n\nAmong the early writers was Wronski, whose \"loi suprême\" (1815) was hardly recognized until Cayley (1873) brought it into\nprominence.\n\nFourier series\n\nFourier series were being investigated\nas the result of physical considerations at the same time that\nGauss, Abel, and Cauchy were working out the theory of infinite\nseries. Series for the expansion of sines and cosines, of multiple\narcs in powers of the sine and cosine of the arc had been treated by\nJacob Bernoulli (1702) and his brother Johann Bernoulli (1701) and still\nearlier by Vieta. Euler and Lagrange simplified the subject,\nas did Poinsot, Schröter, Glaisher, and Kummer.\n\nFourier (1807) set for himself a different problem, to\nexpand a given function of x in terms of the sines or cosines of\nmultiples of x, a problem which he embodied in his Théorie analytique de la chaleur (1822). Euler had already given the\nformulas for determining the coefficients in the series;\nFourier was the first to assert and attempt to prove the general\ntheorem. Poisson (1820–23) also attacked the problem from a\ndifferent standpoint. Fourier did not, however, settle the question\nof convergence of his series, a matter left for Cauchy (1826) to\nattempt and for Dirichlet (1829) to handle in a thoroughly\nscientific manner (see convergence of Fourier series). Dirichlet's treatment (Crelle, 1829), of trigonometric series was the subject of criticism and improvement by\nRiemann (1854), Heine, Lipschitz, Schläfli, and\ndu Bois-Reymond. Among other prominent contributors to the theory of\ntrigonometric and Fourier series were Dini, Hermite, Halphen,\nKrause, Byerly and Appell.\n\nGeneralizations\n\nAsymptotic series\n\nAsymptotic series, otherwise asymptotic expansions, are infinite series whose partial sums become good approximations in the limit of some point of the domain.  In general they do not converge. But they are useful as sequences of approximations, each of which provides a value close to the desired answer for a finite number of terms. The difference is that an asymptotic series cannot be made to produce an answer as exact as desired, the way that convergent series can. In fact, after a certain number of terms, a typical asymptotic series reaches its best approximation; if more terms are included, most such series will produce worse answers.\n\nDivergent series\n\nUnder many circumstances, it is desirable to assign a limit to a series which fails to converge in the usual sense.  A summability method is such an assignment of a limit to a subset of the set of divergent series which properly extends the classical notion of convergence.  Summability methods include Cesàro summation, (C,k) summation, Abel summation, and Borel summation, in increasing order of generality (and hence applicable to increasingly divergent series).\n\nA variety of general results concerning possible summability methods are known.  The Silverman–Toeplitz theorem characterizes matrix summability methods, which are methods for summing a divergent series by applying an infinite matrix to the vector of coefficients.  The most general method for summing a divergent series is non-constructive, and concerns Banach limits.\n\nSeries in Banach spaces\n\nThe notion of series can be easily extended to the case of a Banach space.  If xn is a sequence of elements of a Banach space X, then the series Σxn converges to x ∈ X if the sequence of partial sums of the series tends to x; to wit,\n\\biggl\\|x - \\sum_{n=0}^N x_n\\biggr\\|\\to 0\nas N → ∞.\n\nMore generally, convergence of series can be defined in any abelian Hausdorff topological group.  Specifically, in this case, Σxn converges to x if the sequence of partial sums converges to x.\n\nSummations over arbitrary index sets\n\nDefinitions may be given for sums over an arbitrary index set .  There are two main differences with the usual notion of series: first, there is no specific order given on the set ; second, this set  may be uncountable.  The notion of convergence needs to be strengthened, because the concept of conditional convergence depends on the ordering of the index set.\n\nIf a:I \\mapsto G is a function from an index set  to a set , then the \"series\" associated to a is the formal sum of the elements a(x) \\in G  over the index elements x \\in I denoted by the\n\\sum_{x \\in I} a(x).\n\nWhen the index set is the natural numbers I\\mathbb{N}, the function a:\\mathbb{N} \\mapsto G is a sequence denoted by a(n)\na_n. A series indexed on the natural numbers is an ordered formal sum and so we rewrite \\sum_{n \\in \\mathbb{N}} as \\sum_{n=0}^{\\infty} in order to emphasize the ordering induced by the natural numbers. Thus, we obtain the common notation for a series indexed by the natural numbers\n\\sum_{n0}^{\\infty} a_n \n a_0 + a_1 + a_2 + \\cdots.\n\nFamilies of non-negative numbers\n\nWhen summing a family {ai}, i ∈ I, of non-negative numbers, one may define\n\n\\sum_{i\\in I}a_i = \\sup \\Bigl\\{ \\sum_{i\\in A}a_i\\,\\big| A \\text{ finite, } A \\subset I\\Bigr\\} \\in [0, +\\infty].\n\nWhen the supremum is finite, the set of i ∈ I such that ai > 0 is countable.  Indeed, for every n ≥ 1, the set  A_n = \\{ i \\in I \\,:\\, a_i > 1/n \\} is finite, because\n\n \\frac 1 n \\, \\textrm{card}(A_n) \\le \\sum_{i\\in A_n} a_i  \\le \\sum_{i\\in I}a_i \n\nIf I  is countably infinite and enumerated as I = {i0, i1,...} then the above defined sum satisfies\n\n\\sum_{i \\in I} a_i \\sum_{k\n0}^{+\\infty} a_{i_k},\n\nprovided the value ∞ is allowed for the sum of the series.\n\nAny sum over non-negative reals can be understood as the integral of a non-negative function with respect to the counting measure, which accounts for the many similarities between the two constructions.\n\nAbelian topological groups\n\nLet a : I → X, where I  is any set and X  is an abelian Hausdorff topological group.  Let F  be the collection of all finite subsets of I.  Note that F  is a directed set ordered under inclusion with union as join.  Define the sum S  of the family a as the limit\n\n S \\sum_{i\\in I}a_i \n \\lim \\Bigl\\{\\sum_{i\\in A}a_i\\,\\big| A\\in F\\Bigr\\}\n\nif it exists and say that the family a is unconditionally summable.  Saying that the sum S  is the limit of finite partial sums means that for every neighborhood V  of 0 in X, there is a finite subset A0 of I  such that\n\nS - \\sum_{i \\in A} a_i \\in V, \\quad A \\supset A_0.\n\nBecause F  is not totally ordered, this is not a limit of a sequence of partial sums, but rather of a net.\n\nFor every W, neighborhood of 0 in X, there is a smaller neighborhood V  such that V − V ⊂ W. It follows that the finite partial sums of an unconditionally summable family ai, i ∈ I, form a Cauchy net, that is: for every W, neighborhood of 0 in X, there is a finite subset A0 of I  such that\n\n\\sum_{i \\in A_1} a_i - \\sum_{i \\in A_2} a_i \\in W, \\quad A_1, A_2 \\supset A_0.\n\nWhen X  is complete, a family a is unconditionally summable in X  if and only if the finite sums satisfy the latter Cauchy net condition. When X  is complete and ai, i ∈ I, is unconditionally summable in X, then for every subset J ⊂ I, the corresponding subfamily aj, j ∈ J, is also unconditionally summable in X.\n\nWhen the sum of a family of non-negative numbers, in the extended sense defined before, is finite, then it coincides with the sum in the topological group X = R.\n\nIf a family a in X  is unconditionally summable, then for every W, neighborhood of 0 in X, there is a finite subset A0 of I  such that ai ∈ W  for every i not in A0.  If X  is first-countable, it follows that the set of i ∈ I  such that ai ≠ 0 is countable.  This need not be true in a general abelian topological group (see examples below).\n\nUnconditionally convergent series\n\nSuppose that I = N.  If a family an, n ∈ N, is unconditionally summable in an abelian Hausdorff topological group X, then the series in the usual sense converges and has the same sum,\n\n\\sum_{n0}^\\infty a_n \n \\sum_{n \\in \\mathbf{N}} a_n.\n\nBy nature, the definition of unconditional summability is insensitive to the order of the summation.  When ∑an is unconditionally summable, then the series remains convergent after any permutation σ of the set N of indices, with the same sum,\n\n\\sum_{n0}^\\infty a_{\\sigma(n)} \n \\sum_{n=0}^\\infty a_n.\n\nConversely, if every permutation of a series ∑an converges, then the series is unconditionally convergent.  When X  is complete, then unconditional convergence is also equivalent to the fact that all subseries are convergent; if X  is a Banach space, this is equivalent to say that for every sequence of signs εn = ±1, the series\n\n\\sum_{n=0}^\\infty \\varepsilon_n a_n\n\nconverges in X.  If X  is a Banach space, then one may define the notion of absolute convergence.  A series ∑an of vectors in X  converges absolutely if\n\n \\sum_{n \\in \\mathbf{N}} \\|a_n\\| \n\nIf a series of vectors in a Banach space converges absolutely then it converges unconditionally, but the converse only holds in finite-dimensional Banach spaces (theorem of ).\n\nWell-ordered sums\n\nConditionally convergent series can be considered if I is a well-ordered set, for example an ordinal number α0.  One may define by transfinite recursion:\n\n\\sum_{\\beta \n\nand for a limit ordinal α,\n\n\\sum_{\\beta \n\nif this limit exists.  If all limits exist up to α0, then the series converges.\n\nExamples",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Series (mathematics)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15287" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In mathematics, a series is, roughly speaking, a description of the operation of adding infinitely many quantities, one after the other, to a given starting quantity.  The study of series is a major part of calculus and its generalization, mathematical analysis. Series are used in most areas of mathematics, even for studying finite structures (such as in combinatorics), through generating functions. In addition to their ubiquity in mathematics, infinite series are also widely used in other quantitative disciplines such as physics, computer science, statistics and finance.\n\nFor a long time, the idea that such a potentially infinite summation could produce a finite result was considered paradoxical by mathematicians and philosophers. This paradox was resolved using the concept of a limit during the 19th century. Zeno's paradox of Achilles and the tortoise illustrates this counterintuitive property of infinite sums: Achilles runs after a tortoise, but when he reaches the position of the tortoise at the beginning of the race, the tortoise has reached a second position; when he reaches this second position, the tortoise is at a third position, and so on. Zeno concluded that Achilles could never reach the tortoise, and thus that movement does not exist. Zeno divided the race into infinitely many sub-races, each requiring a finite amount of time, so that the total time for Achilles to catch the tortoise is given by a series.  The resolution of the paradox is that, although the series has an infinite number of terms, it has a finite sum, which gives the time necessary for Achilles to catch the tortoise. \n\nIn modern terminology, any (ordered) infinite sequence (a_1,a_2,a_3,\\ldots) of terms (that is numbers, functions, or anything that can be added) defines a series, which is the operation of adding the a_i one after the other. To emphasize that there are an infinite number of terms, a series may be called an infinite series. Such a series is represented (or denoted) by an expression like \na_1+a_2+a_3+\\cdots,\nor, using the summation sign,\n\\sum_{i=1}^\\infty a_i.\n\nThe infinite sequence of additions implied by a series cannot be effectively carried on (at least in a finite amount of time). However, if the set to which the terms and their finite sums belong has a notion of limit, it is sometimes possible to assign a value to a series, called the sum of the series. This value is the limit as   tends to infinity (if the limit exists) of the finite sums of the  first terms of the series, which are called the th partial sums of the series. That is, \n\\sum_{i1}^\\infty a_i  \n \\lim_{n\\to\\infty} \\sum_{i=1}^n a_i.\nWhen this limit exists, one says that the series is convergent or summable, or that the sequence (a_1,a_2,a_3,\\ldots) is summable. In this case, the limit is called the sum of the series. Otherwise, the series is said to be divergent.\n\nGenerally, the terms of a series come from a ring, often the field \\Bbb R of the real numbers or the field \\Bbb C of the complex numbers. In this case, the set of all series is itself a ring (and even an associative algebra), in which the addition consists of adding the series term by term, and the multiplication is the Cauchy product.\n\nBasic properties\n\nAn infinite series or simply a series is an infinite sum, represented by an infinite expression of the form\na_0 + a_1 + a_2 + \\cdots, \nwhere (a_n) is any ordered sequence of terms, such as numbers, functions, or anything else that can be added (an abelian group).  This is an expression that is obtained from the list of terms a_0,a_1,\\dots by laying them side by side, and conjoining them with the symbol \"+\".  A series may also be represented by using summation notation, such as\n\\sum_{n=0}^{\\infty}a_n  .\n\nIf an abelian group A of terms has a concept of limit (for example, if it is a metric space), then some series, the convergent series, can be interpreted as having a value in A, called the sum of the series. This includes the common cases from calculus in which the group is the field of real numbers or the field of complex numbers. Given a series s\\sum_{n\n0}^\\infty a_n, its kth partial sum is\ns_k \\sum_{n\n0}^{k}a_n = a_0 + a_1 + \\cdots + a_k.\nBy definition, the series \\sum_{n0}^{\\infty} a_n converges to the limit  (or simply sums to ), if the sequence of its partial sums has a limit . In this case, one usually writes \nL \\sum_{n\n0}^{\\infty}a_n.\nA series is said to be convergent if it converges to some limit or divergent when it does not.  The value of this limit, if it exists, is then the value of the series.\n\nConvergent series\n\nA series  is said to converge or to be convergent when the sequence  of partial sums has a finite limit. If the limit of  is infinite or does not exist, the series is said to diverge. When the limit of partial sums exists, it is called the value (or sum) of the series\n\n\\sum_{n0}^\\infty a_n \n \\lim_{k\\to\\infty} s_k \\lim_{k\\to\\infty} \\sum_{n\n0}^k a_n.\n\nAn easy way that an infinite series can converge is if all the an are zero for n sufficiently large.  Such a series can be identified with a finite sum, so it is only infinite in a trivial sense.\n\nWorking out the properties of the series that converge even if infinitely many terms are non-zero is the essence of the study of series. Consider the example\n\n 1 + \\frac{1}{2}+ \\frac{1}{4}+ \\frac{1}{8}+\\cdots+ \\frac{1}{2^n}+\\cdots.\n\nIt is possible to \"visualize\" its convergence on the real number line: we can imagine a line of length 2, with successive segments marked off of lengths 1, ½, ¼, etc. There is always room to mark the next segment, because the amount of line remaining is always the same as the last segment marked: when we have marked off ½, we still have a piece of length ½ unmarked, so we can certainly mark the next ¼.  This argument does not prove that the sum is equal to 2 (although it is), but it does prove that it is at most 2.  In other words, the series has an upper bound. Given that the series converges, proving that it is equal to 2 requires only elementary algebra. If the series is denoted , it can be seen that\n\nS/2 \\frac{1+ \\frac{1}{2}+ \\frac{1}{4}+ \\frac{1}{8}+\\cdots}{2} \n \\frac{1}{2}+ \\frac{1}{4}+ \\frac{1}{8}+ \\frac{1}{16} +\\cdots.\n\nTherefore,\n\nS-S/2 1 \\Rightarrow S \n 2.\n\nMathematicians extend the idiom discussed earlier to other, equivalent notions of series. For instance, when we talk about a recurring decimal, as in\n\nx = 0.111\\dots \n\nwe are talking, in fact, just about the series\n\n\\sum_{n=1}^\\infty \\frac{1}{10^n}.\n\nBut since these series always converge to real numbers (because of what is called the completeness property of the real numbers), to talk about the series in this way is the same as to talk about the numbers for which they stand.  In particular, the decimal expansion 0.111… can be identified with 1/9.  This leads to an argument that , which only relies on the fact that the limit laws for series preserve the arithmetic operations; this argument is presented in the article 0.999....\n\nExamples of numerical series\n\n* A geometric series is one where each successive term is produced by multiplying the previous term by a constant number (called the common ratio in this context).  Example:\n:1 + {1 \\over 2} + {1 \\over 4} + {1 \\over 8} + {1 \\over 16} + \\cdots\\sum_{n\n0}^\\infty{1 \\over 2^n}.\nIn general, the geometric series\n:\\sum_{n=0}^\\infty z^n\nconverges if and only if |z| .\n\n* An arithmetico-geometric series is a generalization of the geometric series, which has coefficients of the common ratio equal to the terms in an arithmetic sequence.  Example:\n:3 + {5 \\over 2} + {7 \\over 4} + {9 \\over 8} + {11 \\over 16} + \\cdots\\sum_{n\n0}^\\infty{(3+2n) \\over 2^n}.\n\n* The harmonic series is the series\n:1 + {1 \\over 2} + {1 \\over 3} + {1 \\over 4} + {1 \\over 5} + \\cdots \\sum_{n\n1}^\\infty {1 \\over n}.\nThe harmonic series is divergent.\n\n* An alternating series is a series where terms alternate signs.  Examples:\n:1 - {1 \\over 2} + {1 \\over 3} - {1 \\over 4} + {1 \\over 5} - \\cdots \\sum_{n\n1}^\\infty {\\left(-1\\right)^{n-1} \\over n}=\\ln(2) \\quad  (alternating harmonic series)\n\nand\n\n:-1+\\frac{1}{3} - \\frac{1}{5} + \\frac{1}{7} - \\frac{1}{9} + \\cdots \\sum_{n\n1}^\\infty \\frac{\\left(-1\\right)^n}{2n-1} = -\\frac{\\pi}{4}\n\n*The p-series\n:\\sum_{n=1}^\\infty\\frac{1}{n^r}\nconverges if r > 1 and diverges for r ≤ 1, which can be shown with the integral criterion described below in convergence tests. As a function of r, the sum of this series is Riemann's zeta function.\n\n*A telescoping series\n:\\sum_{n=1}^\\infty (b_n-b_{n+1})\nconverges if the sequence bn converges to a limit L as n goes to infinity. The value of the series is then b1 − L.\n\n*There are some elementary series whose convergence is not yet known/proven. For example, it is unknown whether the Flint Hills series \n:\\sum_{n=1}^\\infty \\frac{\\csc^{2} n}{n^{3}}\nconverges or not. The convergence depends on how well \\pi can be approximated with rational numbers (which is unknown as of yet). More specifically, the values of n with large numerical contributions to the sum are the numerators of the continued fraction convergents of \\pi, a sequence beginning with 1, 3, 22, 333, 355, 103993, ... . These are integers that are close to n\\pi for some integer n, so that \\sin n\\pi is close to 0 and its reciprocal is large. Alekseyev (2011) proved that if the series converges, then the irrationality measure of \\pi is smaller than 2.5, which is much smaller than the current known bound of 7.6063....Max A. Alekseyev, [https://arxiv.org/abs/1104.5100 On convergence of the Flint Hills series],  \tarXiv:1104.5100, 2011.\n\nπ\n\n \\sum_{i1}^{\\infty} \\frac{1}{i^2} \n \\frac{1}{1^2} + \\frac{1}{2^2} + \\frac{1}{3^2} + \\frac{1}{4^2} + \\cdots = \\frac{\\pi^2}{6}\n\n \\sum_{i1}^\\infty \\frac{(-1)^{i+1}(4)}{2i-1} \n \\frac{4}{1} - \\frac{4}{3} + \\frac{4}{5} - \\frac{4}{7} + \\frac{4}{9} - \\frac{4}{11} + \\frac{4}{13} - \\cdots = \\pi\n\nNatural logarithm of 2\n\t\n\n\\sum_{i1}^\\infty \\frac{(-1)^{i+1}}{i} \n \\ln 2\n\n\\sum_{i0}^\\infty \\frac{1}{(2i+1)(2i+2)} \n \\ln 2\n\n\\sum_{i0}^\\infty \\frac{(-1)^i}{(i+1)(i+2)} \n 2\\ln(2) -1\n\n\\sum_{i1}^\\infty \\frac{1}{i(4i^2-1)} \n 2\\ln(2) -1\n\n \\sum_{i1}^\\infty \\frac{1}{2^{i}i} \n \\ln 2\n\n \\sum_{i1}^\\infty \\left(\\frac{1}{3^i}+\\frac{1}{4^i}\\right)\\frac{1}{i} \n \\ln 2\n\n \\sum_{i1}^\\infty \\frac{1}{2i(2i-1)} \n \\ln 2\n\nNatural logarithm base e\n\n\\sum_{i 0}^\\infty \\frac{(-1)^i}{i!} \n  1-\\frac{1}{1!}+\\frac{1}{2!}-\\frac{1}{3!}+\\cdots = \\frac{1}{e}\n\n \\sum_{i 0}^\\infty \\frac{1}{i!} \n \\frac{1}{0!} + \\frac{1}{1!} + \\frac{1}{2!} + \\frac{1}{3!} + \\frac{1}{4!} + \\cdots = e \n\nCalculus and partial summation as an operation on sequences\n\nPartial summation takes as input a sequence, { an }, and gives as output another sequence, { SN }. It is thus a unary operation on sequences. Further, this function is linear, and thus is a linear operator on the vector space of sequences, denoted Σ. The inverse operator is the finite difference operator, Δ. These behave as discrete analogs of integration and differentiation, only for series (functions of a natural number) instead of functions of a real variable. For example, the sequence {1, 1, 1, ...} has series {1, 2, 3, 4, ...} as its partial summation, which is analogous to the fact that \\int_0^x 1\\,dt = x.\n\nIn computer science it is known as prefix sum.\n\nProperties of series\n\nSeries are classified not only by whether they converge or diverge, but also by the properties of the terms an (absolute or conditional convergence); type of convergence of the series (pointwise, uniform); the class of the term an (whether it is a real number, arithmetic progression, trigonometric function); etc.\n\nNon-negative terms\n\nWhen an is a non-negative real number for every n, the sequence SN of partial sums is non-decreasing. It follows that a series ∑an with non-negative terms converges if and only if the sequence SN of partial sums is bounded.\n\nFor example, the series\n\n\\sum_{n = 1}^\\infty \\frac{1}{n^2}\n\nis convergent, because the inequality\n\n\\frac1 {n^2} \\le \\frac{1}{n-1} - \\frac{1}{n}, \\quad n \\ge 2,\n\nand a telescopic sum argument implies that the partial sums are bounded by 2. The exact value of the original series is the Basel problem.\n\nAbsolute convergence\n\nA series\n\\sum_{n=0}^\\infty a_n\nis said to converge absolutely if the series of absolute values\n\\sum_{n=0}^\\infty \\left|a_n\\right|\nconverges. This is sufficient to guarantee not only that the original series converges to a limit, but also that any reordering of it converges to the same limit.\n\nConditional convergence\n\nA series of real or complex numbers is said to be conditionally convergent (or semi-convergent) if it is convergent but not absolutely convergent. A famous example is the alternating series\n\n\\sum\\limits_{n1}^\\infty {(-1)^{n+1}  \\over n} \n 1 - {1 \\over 2} + {1 \\over 3} - {1 \\over 4} + {1 \\over 5} - \\cdots\n\nwhich is convergent (and its sum is equal to ln 2), but the series formed by taking the absolute value of each term is the divergent harmonic series. The Riemann series theorem says that any conditionally convergent series can be reordered to make a divergent series, and moreover, if the an are real and S is any real number, that one can find a reordering so that the reordered series converges with sum equal to S.\n\nAbel's test is an important tool for handling semi-convergent series. If a series has the form\n\n\\sum a_n = \\sum \\lambda_n b_n\n\nwhere the partial sums BN =  are bounded, λn has bounded variation, and  exists:\n\n\\sup_N \\Bigl| \\sum_{n=0}^N b_n \\Bigr| \n\nthen the series  is convergent.  This applies to the pointwise convergence of many trigonometric series, as in\n\n\\sum_{n=2}^\\infty \\frac{\\sin(n x)}{\\ln n}\n\nwith 0 n+1 = Bn+1 − Bn, and in performing a transformation similar to integration by parts (called summation by parts), that relates the given series  to the absolutely convergent series\n\n \\sum (\\lambda_n - \\lambda_{n+1}) \\, B_n.\n\nConvergence tests\n\n* n-th term test: If limn→∞ an ≠ 0 then the series diverges.\n*Comparison test 1 (see Direct comparison test): If ∑bn  is an absolutely convergent series such that |an | ≤ C |bn | for some number C  and for sufficiently large n , then ∑an  converges absolutely as well. If ∑|bn | diverges, and |an | ≥ |bn | for all sufficiently large n , then ∑an  also fails to converge absolutely (though it could still be conditionally convergent, e.g. if the an  alternate in sign).\n*Comparison test 2 (see Limit comparison test): If ∑bn  is an absolutely convergent series such that |an+1 /an | ≤ |bn+1 /bn | for sufficiently large n , then ∑an  converges absolutely as well. If ∑|bn | diverges, and |an+1 /an | ≥ |bn+1 /bn | for all sufficiently large n , then ∑an  also fails to converge absolutely (though it could still be conditionally convergent, e.g. if the an  alternate in sign).\n*Ratio test: If there exists a constant C n+1/an|n converges absolutely. When the ratio is less than 1, but not less than a constant less than 1, convergence is possible but this test does not establish it.\n*Root test: If there exists a constant C n|1/n ≤ C for all sufficiently large n, then ∑an converges absolutely.\n*Integral test: if ƒ(x) is a positive monotone decreasing function defined on the interval [1, ∞) with ƒ(n) = an for all n, then ∑an converges if and only if the integral  ∫1∞ ƒ(x) dx is finite.\n*Cauchy's condensation test: If an is non-negative and non-increasing, then the two series  ∑an  and  ∑2ka(2k) are of the same nature: both convergent, or both divergent.\n*Alternating series test: A series of the form ∑(−1)n an (with an > 0) is called alternating. Such a series converges if the sequence an is monotone decreasing and converges to 0. The converse is in general not true.\n*For some specific types of series there are more specialized convergence tests, for instance for Fourier series there is the Dini test.\n\nSeries of functions\n\nA series of real- or complex-valued functions\n\n\\sum_{n=0}^\\infty f_n(x)\n\nconverges pointwise on a set E, if the series converges for each x in E as an ordinary series of real or complex numbers.  Equivalently, the partial sums\ns_N(x) \\sum_{n\n0}^N f_n(x)\nconverge to ƒ(x) as N → ∞ for each x ∈ E.\n\nA stronger notion of convergence of a series of functions is called uniform convergence.  The series converges uniformly if it converges pointwise to the function ƒ(x), and the error in approximating the limit by the Nth partial sum,\n|s_N(x) - f(x)|\ncan be made minimal independently of x by choosing a sufficiently large N.\n\nUniform convergence is desirable for a series because many properties of the terms of the series are then retained by the limit.  For example, if a series of continuous functions converges uniformly, then the limit function is also continuous.  Similarly, if the ƒn are integrable on a closed and bounded interval I and converge uniformly, then the series is also integrable on I and can be integrated term-by-term. Tests for uniform convergence include the Weierstrass' M-test, Abel's uniform convergence test, Dini's test, and the Cauchy criterion.\n\nMore sophisticated types of convergence of a series of functions can also be defined.  In measure theory, for instance, a series of functions converges almost everywhere if it converges pointwise except on a certain set of measure zero.  Other modes of convergence depend on a different metric space structure on the space of functions under consideration.  For instance, a series of functions converges in mean on a set E to a limit function ƒ provided\n\\int_E \\left|s_N(x)-f(x)\\right|^2\\,dx \\to 0\nas N → ∞.\n\nPower series\n\nA power series is a series of the form\n\\sum_{n=0}^\\infty a_n(x-c)^n.\n\nThe Taylor series at a point c of a function is a power series that, in many cases, converges to the function in a neighborhood of c. For example, the series\n\\sum_{n=0}^{\\infty} \\frac{x^n}{n!}\nis the Taylor series of e^x at the origin and converges to it for every x.\n\nUnless it converges only at x=c, such a series converges on a certain open disc of convergence centered at the point c in the complex plane, and may also converge at some of the points of the boundary of the disc.  The radius of this disc is known as the radius of convergence, and can in principle be determined from the asymptotics of the coefficients an.  The convergence is uniform on closed and bounded (that is, compact) subsets of the interior of the disc of convergence: to wit, it is uniformly convergent on compact sets.\n\nHistorically, mathematicians such as Leonhard Euler operated liberally with infinite series, even if they were not convergent. When calculus was put on a sound and correct foundation in the nineteenth century, rigorous proofs of the convergence of series were always required. \n\nFormal power series \n\nWhile many uses of power series refer to their sums, it is also possible to treat power series as formal sums, meaning that no addition operations are actually performed, and the symbol \"+\" is an abstract symbol of conjunction which is not necessarily interpreted as corresponding to addition. In this setting, the sequence of coefficients itself is of interest, rather than the convergence of the series. Formal power series are used in combinatorics to describe and study sequences that are otherwise difficult to handle, for example using the method of generating functions.  The Hilbert–Poincaré series is a formal power series used to study graded algebras.\n\nEven if the limit of the power series is not considered, if the terms support appropriate structure then it is possible to define operations such as addition, multiplication, derivative, antiderivative for power series \"formally\", treating the symbol \"+\" as if it corresponded to addition. In the most common setting, the terms come from a commutative ring, so that the formal power series can be added term-by-term and multiplied via the Cauchy product. In this case the algebra of formal power series is the total algebra of the monoid of natural numbers over the underlying term ring.: §III.2.11.  If the underlying term ring is a differential algebra, then the algebra of formal power series is also a differential algebra, with differentiation performed term-by-term.\n\nLaurent series\n\nLaurent series generalize power series by admitting terms into the series with negative as well as positive exponents.  A Laurent series is thus any series of the form\n\\sum_{n=-\\infty}^\\infty a_n x^n.\nIf such a series converges, then in general it does so in an annulus rather than a disc, and possibly some boundary points.  The series converges uniformly on compact subsets of the interior of the annulus of convergence.\n\nDirichlet series\n\nA Dirichlet series is one of the form\n\n\\sum_{n=1}^\\infty {a_n \\over n^s},\n\nwhere s is a complex number.  For example, if all an are equal to 1, then the Dirichlet series is the Riemann zeta function\n\n\\zeta(s) \\sum_{n\n1}^\\infty \\frac{1}{n^s}.\n\nLike the zeta function, Dirichlet series in general play an important role in analytic number theory.  Generally a Dirichlet series converges if the real part of s is greater than a number called the abscissa of convergence.  In many cases, a Dirichlet series can be extended to an analytic function outside the domain of convergence by analytic continuation.  For example, the Dirichlet series for the zeta function converges absolutely when Re s > 1, but the zeta function can be extended to a holomorphic function defined on \\mathbf{C}\\setminus\\{1\\}  with a simple pole at 1.\n\nThis series can be directly generalized to general Dirichlet series.\n\nTrigonometric series\n\nA series of functions in which the terms are trigonometric functions is called a trigonometric series:\n\\tfrac12 A_0 + \\sum_{n=1}^\\infty \\left(A_n\\cos nx + B_n \\sin nx\\right).\nThe most important example of a trigonometric series is the Fourier series of a function.\n\nHistory of the theory of infinite series\n\nDevelopment of infinite series\n\nGreek mathematician Archimedes produced the first known summation of an infinite series with a\nmethod that is still used in the area of calculus today. He used the method of exhaustion to calculate the area under the arc of a parabola with the summation of an infinite series, and gave a remarkably accurate approximation of π.[http://eric.ed.gov/ERICWebPortal/custom/portlets/recordDetails/detailmini.jsp?_nfpbtrue&_&ERICExtSearch_SearchValue_0\nEJ502088&ERICExtSearch_SearchType_0no&accno\nEJ502088 Archimedes and Pi-Revisited.]\n\nMathematicians from Kerala, India studied infinite series around 1350 CE.http://www.manchester.ac.uk/discover/news/article/?id=2962\n\nIn the 17th century, James Gregory worked in the new decimal system on infinite series and published several Maclaurin series. In 1715, a general method for constructing the Taylor series for all functions for which they exist was provided by Brook Taylor. Leonhard Euler in the 18th century, developed the theory of hypergeometric series and q-series.\n\nConvergence criteria\n\nThe investigation of the validity of infinite series is considered to begin with Gauss in the 19th century. Euler had already considered the hypergeometric series\n\n1 + \\frac{\\alpha\\beta}{1\\cdot\\gamma}x + \\frac{\\alpha(\\alpha+1)\\beta(\\beta+1)}{1 \\cdot 2 \\cdot \\gamma(\\gamma+1)}x^2 + \\cdots\non which Gauss published a memoir in 1812. It established simpler criteria of convergence, and the questions of remainders and the range of convergence.\n\nCauchy (1821) insisted on strict tests of convergence; he showed that if two series are convergent their product is not necessarily so, and with him begins the discovery of effective criteria. The terms convergence and divergence had been introduced long before by Gregory (1668). Leonhard Euler and Gauss had given various criteria, and Colin Maclaurin had anticipated some of Cauchy's discoveries. Cauchy advanced the theory of power series by his expansion of a complex function in such a form.\n\nAbel (1826) in his memoir on the binomial series\n1 + \\frac{m}{1!}x + \\frac{m(m-1)}{2!}x^2 + \\cdots\n\ncorrected certain of Cauchy's conclusions, and gave a completely\nscientific summation of the series for complex values of m and x. He showed the necessity of considering the subject of continuity in questions of convergence.\n\nCauchy's methods led to special rather than general criteria, and\nthe same may be said of Raabe (1832), who made the first elaborate\ninvestigation of the subject, of De Morgan (from 1842), whose\nlogarithmic test DuBois-Reymond (1873) and Pringsheim (1889) have\nshown to fail within a certain region; of Bertrand (1842), Bonnet\n(1843), Malmsten (1846, 1847, the latter without integration);\nStokes (1847), Paucker (1852), Chebyshev (1852), and Arndt\n(1853).\n\nGeneral criteria began with Kummer (1835), and have been\nstudied by Eisenstein (1847), Weierstrass in his various\ncontributions to the theory of functions, Dini (1867),\nDuBois-Reymond (1873), and many others. Pringsheim's memoirs (1889) present the most complete general theory.\n\nUniform convergence\n\nThe theory of uniform convergence was treated by Cauchy (1821), his\nlimitations being pointed out by Abel, but the first to attack it\nsuccessfully were Seidel and Stokes (1847–48). Cauchy took up the\nproblem again (1853), acknowledging Abel's criticism, and reaching\nthe same conclusions which Stokes had already found. Thomae used the\ndoctrine (1866), but there was great delay in recognizing the\nimportance of distinguishing between uniform and non-uniform\nconvergence, in spite of the demands of the theory of functions.\n\nSemi-convergence\n\nA series is said to be semi-convergent (or conditionally convergent) if it is convergent but not absolutely convergent.\n\nSemi-convergent series were studied by Poisson (1823), who also gave a general form for the remainder of the Maclaurin formula. The most important solution of the problem is due, however, to Jacobi (1834),\nwho attacked the question of the remainder from a different standpoint and reached a different formula. This expression was also worked out, and another one given, by Malmsten (1847).  Schlömilch (Zeitschrift, Vol.I, p. 192, 1856) also improved Jacobi's remainder, and showed the relation between the remainder and Bernoulli's function\n\nF(x) = 1^n + 2^n + \\cdots + (x - 1)^n.\n\nGenocchi (1852) has further contributed to the theory.\n\nAmong the early writers was Wronski, whose \"loi suprême\" (1815) was hardly recognized until Cayley (1873) brought it into\nprominence.\n\nFourier series\n\nFourier series were being investigated\nas the result of physical considerations at the same time that\nGauss, Abel, and Cauchy were working out the theory of infinite\nseries. Series for the expansion of sines and cosines, of multiple\narcs in powers of the sine and cosine of the arc had been treated by\nJacob Bernoulli (1702) and his brother Johann Bernoulli (1701) and still\nearlier by Vieta. Euler and Lagrange simplified the subject,\nas did Poinsot, Schröter, Glaisher, and Kummer.\n\nFourier (1807) set for himself a different problem, to\nexpand a given function of x in terms of the sines or cosines of\nmultiples of x, a problem which he embodied in his Théorie analytique de la chaleur (1822). Euler had already given the\nformulas for determining the coefficients in the series;\nFourier was the first to assert and attempt to prove the general\ntheorem. Poisson (1820–23) also attacked the problem from a\ndifferent standpoint. Fourier did not, however, settle the question\nof convergence of his series, a matter left for Cauchy (1826) to\nattempt and for Dirichlet (1829) to handle in a thoroughly\nscientific manner (see convergence of Fourier series). Dirichlet's treatment (Crelle, 1829), of trigonometric series was the subject of criticism and improvement by\nRiemann (1854), Heine, Lipschitz, Schläfli, and\ndu Bois-Reymond. Among other prominent contributors to the theory of\ntrigonometric and Fourier series were Dini, Hermite, Halphen,\nKrause, Byerly and Appell.\n\nGeneralizations\n\nAsymptotic series\n\nAsymptotic series, otherwise asymptotic expansions, are infinite series whose partial sums become good approximations in the limit of some point of the domain.  In general they do not converge. But they are useful as sequences of approximations, each of which provides a value close to the desired answer for a finite number of terms. The difference is that an asymptotic series cannot be made to produce an answer as exact as desired, the way that convergent series can. In fact, after a certain number of terms, a typical asymptotic series reaches its best approximation; if more terms are included, most such series will produce worse answers.\n\nDivergent series\n\nUnder many circumstances, it is desirable to assign a limit to a series which fails to converge in the usual sense.  A summability method is such an assignment of a limit to a subset of the set of divergent series which properly extends the classical notion of convergence.  Summability methods include Cesàro summation, (C,k) summation, Abel summation, and Borel summation, in increasing order of generality (and hence applicable to increasingly divergent series).\n\nA variety of general results concerning possible summability methods are known.  The Silverman–Toeplitz theorem characterizes matrix summability methods, which are methods for summing a divergent series by applying an infinite matrix to the vector of coefficients.  The most general method for summing a divergent series is non-constructive, and concerns Banach limits.\n\nSeries in Banach spaces\n\nThe notion of series can be easily extended to the case of a Banach space.  If xn is a sequence of elements of a Banach space X, then the series Σxn converges to x ∈ X if the sequence of partial sums of the series tends to x; to wit,\n\\biggl\\|x - \\sum_{n=0}^N x_n\\biggr\\|\\to 0\nas N → ∞.\n\nMore generally, convergence of series can be defined in any abelian Hausdorff topological group.  Specifically, in this case, Σxn converges to x if the sequence of partial sums converges to x.\n\nSummations over arbitrary index sets\n\nDefinitions may be given for sums over an arbitrary index set .  There are two main differences with the usual notion of series: first, there is no specific order given on the set ; second, this set  may be uncountable.  The notion of convergence needs to be strengthened, because the concept of conditional convergence depends on the ordering of the index set.\n\nIf a:I \\mapsto G is a function from an index set  to a set , then the \"series\" associated to a is the formal sum of the elements a(x) \\in G  over the index elements x \\in I denoted by the\n\\sum_{x \\in I} a(x).\n\nWhen the index set is the natural numbers I\\mathbb{N}, the function a:\\mathbb{N} \\mapsto G is a sequence denoted by a(n)\na_n. A series indexed on the natural numbers is an ordered formal sum and so we rewrite \\sum_{n \\in \\mathbb{N}} as \\sum_{n=0}^{\\infty} in order to emphasize the ordering induced by the natural numbers. Thus, we obtain the common notation for a series indexed by the natural numbers\n\\sum_{n0}^{\\infty} a_n \n a_0 + a_1 + a_2 + \\cdots.\n\nFamilies of non-negative numbers\n\nWhen summing a family {ai}, i ∈ I, of non-negative numbers, one may define\n\n\\sum_{i\\in I}a_i = \\sup \\Bigl\\{ \\sum_{i\\in A}a_i\\,\\big| A \\text{ finite, } A \\subset I\\Bigr\\} \\in [0, +\\infty].\n\nWhen the supremum is finite, the set of i ∈ I such that ai > 0 is countable.  Indeed, for every n ≥ 1, the set  A_n = \\{ i \\in I \\,:\\, a_i > 1/n \\} is finite, because\n\n \\frac 1 n \\, \\textrm{card}(A_n) \\le \\sum_{i\\in A_n} a_i  \\le \\sum_{i\\in I}a_i \n\nIf I  is countably infinite and enumerated as I = {i0, i1,...} then the above defined sum satisfies\n\n\\sum_{i \\in I} a_i \\sum_{k\n0}^{+\\infty} a_{i_k},\n\nprovided the value ∞ is allowed for the sum of the series.\n\nAny sum over non-negative reals can be understood as the integral of a non-negative function with respect to the counting measure, which accounts for the many similarities between the two constructions.\n\nAbelian topological groups\n\nLet a : I → X, where I  is any set and X  is an abelian Hausdorff topological group.  Let F  be the collection of all finite subsets of I.  Note that F  is a directed set ordered under inclusion with union as join.  Define the sum S  of the family a as the limit\n\n S \\sum_{i\\in I}a_i \n \\lim \\Bigl\\{\\sum_{i\\in A}a_i\\,\\big| A\\in F\\Bigr\\}\n\nif it exists and say that the family a is unconditionally summable.  Saying that the sum S  is the limit of finite partial sums means that for every neighborhood V  of 0 in X, there is a finite subset A0 of I  such that\n\nS - \\sum_{i \\in A} a_i \\in V, \\quad A \\supset A_0.\n\nBecause F  is not totally ordered, this is not a limit of a sequence of partial sums, but rather of a net.\n\nFor every W, neighborhood of 0 in X, there is a smaller neighborhood V  such that V − V ⊂ W. It follows that the finite partial sums of an unconditionally summable family ai, i ∈ I, form a Cauchy net, that is: for every W, neighborhood of 0 in X, there is a finite subset A0 of I  such that\n\n\\sum_{i \\in A_1} a_i - \\sum_{i \\in A_2} a_i \\in W, \\quad A_1, A_2 \\supset A_0.\n\nWhen X  is complete, a family a is unconditionally summable in X  if and only if the finite sums satisfy the latter Cauchy net condition. When X  is complete and ai, i ∈ I, is unconditionally summable in X, then for every subset J ⊂ I, the corresponding subfamily aj, j ∈ J, is also unconditionally summable in X.\n\nWhen the sum of a family of non-negative numbers, in the extended sense defined before, is finite, then it coincides with the sum in the topological group X = R.\n\nIf a family a in X  is unconditionally summable, then for every W, neighborhood of 0 in X, there is a finite subset A0 of I  such that ai ∈ W  for every i not in A0.  If X  is first-countable, it follows that the set of i ∈ I  such that ai ≠ 0 is countable.  This need not be true in a general abelian topological group (see examples below).\n\nUnconditionally convergent series\n\nSuppose that I = N.  If a family an, n ∈ N, is unconditionally summable in an abelian Hausdorff topological group X, then the series in the usual sense converges and has the same sum,\n\n\\sum_{n0}^\\infty a_n \n \\sum_{n \\in \\mathbf{N}} a_n.\n\nBy nature, the definition of unconditional summability is insensitive to the order of the summation.  When ∑an is unconditionally summable, then the series remains convergent after any permutation σ of the set N of indices, with the same sum,\n\n\\sum_{n0}^\\infty a_{\\sigma(n)} \n \\sum_{n=0}^\\infty a_n.\n\nConversely, if every permutation of a series ∑an converges, then the series is unconditionally convergent.  When X  is complete, then unconditional convergence is also equivalent to the fact that all subseries are convergent; if X  is a Banach space, this is equivalent to say that for every sequence of signs εn = ±1, the series\n\n\\sum_{n=0}^\\infty \\varepsilon_n a_n\n\nconverges in X.  If X  is a Banach space, then one may define the notion of absolute convergence.  A series ∑an of vectors in X  converges absolutely if\n\n \\sum_{n \\in \\mathbf{N}} \\|a_n\\| \n\nIf a series of vectors in a Banach space converges absolutely then it converges unconditionally, but the converse only holds in finite-dimensional Banach spaces (theorem of ).\n\nWell-ordered sums\n\nConditionally convergent series can be considered if I is a well-ordered set, for example an ordinal number α0.  One may define by transfinite recursion:\n\n\\sum_{\\beta \n\nand for a limit ordinal α,\n\n\\sum_{\\beta \n\nif this limit exists.  If all limits exist up to α0, then the series converges.\n\nExamples. Series (mathematics). http://en.wikipedia.org/?curid=15287."
  }
}
