{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16472",
  "eid" : "263b7fd0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778573389,
  "textBody" : "Jet streams are fast flowing, narrow, meandering air currents in the atmospheres of some planets, including Earth. On Earth, the main jet streams are located near the altitude of the tropopause and are westerly winds (flowing west to east). Their paths typically have a meandering shape. Jet streams may start, stop, split into two or more parts, combine into one stream, or flow in various directions including opposite to the direction of the remainder of the jet.\n\nThe strongest jet streams are the polar jets, at 9 - above sea level, and the higher altitude and somewhat weaker subtropical jets at 10 -. The Northern Hemisphere and the Southern Hemisphere  each have a polar jet and a subtropical jet. The northern hemisphere polar jet flows over the middle to northern latitudes of North America, Europe, and Asia and their intervening oceans, while the southern hemisphere polar jet mostly circles Antarctica all year round.\n\nJet streams are the product of two factors: the atmospheric heating by solar radiation that produces the large scale Polar, Ferrel, and Hadley circulation cells, and the action of the Coriolis force acting on those moving masses. The Coriolis force is caused by the planet's rotation on its axis. On other planets, internal heat rather than solar heating drives their jet streams. The Polar jet stream forms near the interface of the Polar and Ferrel circulation cells; the subtropical jet forms near the boundary of the Ferrel and Hadley circulation cells.\n\nOther jet streams also exist. During the Northern Hemisphere summer, easterly jets can form in tropical regions, typically where dry air encounters more humid air at high altitudes. Low-level jets also are typical of various regions such as the central United States.  There are also jetstreams in the thermosphere.\n\nMeteorologists use the location of some of the jet streams as an aid in weather forecasting. The main commercial relevance of the jet streams is in air travel, as flight time can be dramatically affected by either flying with the flow or against, which results in significant fuel and time cost savings for airlines. Often, the airlines work to fly 'with' the jet stream for this reason. Dynamic North Atlantic Tracks are one example of how airlines and air traffic control work together to accommodate the jet stream and winds aloft that results in the maximum benefit for airlines and other users. Clear-air turbulence, a potential hazard to aircraft passenger safety, is often found in a jet stream's vicinity, but it does not create a substantial alteration on flight times. These are a narrow belt.\n\nDiscovery\n\nAfter the 1883 eruption of the Krakatoa volcano, weather watchers tracked and mapped the effects on the sky over several years. They labelled the phenomenon the \"equatorial smoke stream\".See:\n# Bishop, Sereno E. (17 January 1884) \"Letters to the Editor: The remarkable sunsets,\" Nature, 29: 259–260; on [https://books.google.com/books?idIscKAAAAYAAJ&pg\nPA260#vonepage&q&f\nfalse page 260], Bishop speculates that a rapid current in the upper atmosphere was carrying the dust from the eruption of Krakatau westward around the equator.\n# Bishop, S.E. (May 1884) [https://books.google.com/books?idvLYx_8gCXq0C&pg\nPA106#vonepage&q&f\nfalse \"The equatorial smoke-stream from Krakatoa,\"] The Hawaiian Monthly, vol. 1, no. 5, pages 106–110.\n# Bishop, S.E. (29 January 1885) [https://books.google.com/books?id9OLp4UZFtqYC&pg\nPA288#vonepage&q&f\nfalse \"Letters to the Editor: Krakatoa,\"] Nature, vol. 31, pages 288–289.\n# Rev. Sereno E. Bishop (1886) \"The origin of the red glows,\" American Meteorological Journal, vol. 3, pages [https://books.google.com/books?idUcowAQAAMAAJ&pg\nPA127#vonepage&q&f\nfalse 127–136], [https://books.google.com/books?idUcowAQAAMAAJ&pg\nPA193#vonepage&q&f\nfalse 193–196]; on pages 133–136, Bishop discusses the \"equatorial smoke stream\" that was produced by the eruption of Krakatau.\n# Hamilton, Kevin (2012) [http://iprc.soest.hawaii.edu/users/kph/K.pdf \"Sereno Bishop, Rollo Russell, Bishop's Ring and the discovery of the \"Krakatoa easterlies\",\"]  Atmosphere-Ocean, vol. 50, no. 2, pages 169–175.\n# Krakatoa Committee of the Royal Society [of London], The Eruption of Krakatoa and Subsequent Phenomena (London, England: Harrison and Sons, 1888). Evidence of an equatorial high-speed, high-altitude current (actually, the quasi-biennial oscillation) is presented in the following sections:\n:* Part IV., Section II. General list of dates of first appearance of all the optical phenomena. By the Hon. Rollo Russell., [https://books.google.com/books?idVk8PAAAAYAAJ&pg\nPA263#vonepage&q&f\nfalse pages 263–312].\n:* Part IV., Section III. (A). General geographic distribution of all the optical phenomena in space and time; including also velocity of translation of smoke stream. By the Hon. Rollo Russell., [https://books.google.com/books?idVk8PAAAAYAAJ&pg\nPA312#vonepage&q&f\nfalse pages 312–326].\n:* Part IV., Section III. (B). The connection between the propagation of the sky haze with its accompanying optical phenomena, and the general circulation of the atmosphere. By Mr. E. Douglas Archibald., [https://books.google.com/books?idVk8PAAAAYAAJ&pg\nPA326#vonepage&q&f\nfalse pages 326–334]; that Rev. S.E. Bishop of Honolulu first noticed a westward circulation of dust from Krakatau is acknowledged on page 333.\n:* Part IV., Section III. (C). Spread of the phenomena round the world, with maps illustrative thereof. By the Hon. Rollo Russell., [https://books.google.com/books?idVk8PAAAAYAAJ&pg\nPA334#vonepage&q&f\nfalse pages 334–339]; after page 334 there are map inserts, showing the progressive spread, along the equator, of the dust from Krakatau. In the 1920s, a Japanese meteorologist, Wasaburo Oishi, detected the jet stream from a site near Mount Fuji.Ooishi, W. (1926) Raporto de la Aerologia Observatorio de Tateno (in Esperanto). Aerological Observatory Report 1, Central Meteorological Observatory, Japan, 213 pages.  He tracked pilot balloons, also known as pibals (balloons used to determine upper level winds),Martin Brenner. [http://www.csulb.edu/~mbrenner/balloon.htm Pilot Balloon Resources.] Retrieved on 13 May 2008. as they rose into the atmosphere. Oishi's work largely went unnoticed outside Japan because it was published in Esperanto. American pilot Wiley Post, the first man to fly around the world solo in 1933, is often given some credit for discovery of jet streams. Post invented a pressurized suit that let him fly above 6200 m. In the year before his death, Post made several attempts at a high-altitude transcontinental flight, and noticed that at times his ground speed greatly exceeded his air speed.Acepilots.com. [http://www.acepilots.com/post.html Wiley Post.] Retrieved on 8 May 2008.\nGerman meteorologist Heinrich Seilkopf is credited with coining a special term, Strahlströmung (literally \"jet current\"), for the phenomenon in 1939.Seilkopf, H., Maritime meteorologie, which is volume II of: R. Habermehl, ed., Handbuch der Fliegenwetterkunde [Handbook of Aeronautical Meteorology] (Berlin, Germany: Gebrüder Radetzke [Radetzke Brothers], 1939); Seilkopf coins the word \"Strahlströmung\" on page 142 and discusses the jet stream on pages 142–150.Arbeiten zur allgemeinen Klimatologie By Hermann Flohn [https://books.google.com/books?idOlwLAQAAIAAJ&q\nseilkopf+Strahlstr%C3%B6mung&dqseilkopf+Strahlstr%C3%B6mung&lr\n&eiSyXXS-K9JaailASGnszQCA&cd\n7 p. 47] (Modern German usage is \"Strahlstrom\".) Many sources credit real understanding of the nature of jet streams to regular and repeated flight-path traversals during World War II. Flyers consistently noticed westerly tailwinds in excess of 100 mph in flights, for example, from the US to the UK.  Similarly in 1944 a team of American meteorologists in Guam, including Reid Bryson, had enough observations to forecast very high west winds that would slow bombers going to Japan.[http://www.statesman.com/news/news/opinion/when-the-jet-stream-was-the-wind-of-war/nRxPD/ When the jet stream was the wind of war]\n\nDescription\n\nPolar jet streams are typically located near the 250 hPa (about 1/4 atmosphere) pressure level, or 7 to above sea level, while the weaker subtropical jet streams are much higher, between 10 and. Jet streams wander laterally dramatically, and have large changes in their altitude. The jet streams form near breaks in the tropopause, at the transitions between the Polar, Ferrel and Hadley circulation cells, and whose circulation, with the Coriolis force acting on those masses, drives the jet streams. The Polar jets, at lower altitude, and often intruding into mid-latitudes, strongly affects weather and aviation.David R. Cook [http://www.newton.dep.anl.gov/askasci/wea00/wea00067.htm Jet Stream Behavior.] Retrieved on 8 May 2008.B. Geerts and E. Linacre. [http://www-das.uwyo.edu/~geerts/cwx/notes/chap01/tropo.html The Height of the Tropopause.] Retrieved on 8 May 2008. The polar jet stream is most commonly found between latitudes 30° and 60° (closer to 60°), while the subtropical jet streams are located close to latitude 30°. The northern Polar jet stream is said to \"follow the sun\" as it slowly migrates northward as that hemisphere warms, and southward again as it cools.National Weather Service JetStream. [http://www.srh.noaa.gov/jetstream//global/jet.htm The Jet Stream.] Retrieved on 8 May 2008.McDougal Littell. [http://www.classzone.com/books/earth_science/terc/content/investigations/es1908/es1908page04.cfm Paths of Polar and Subtropical Jet Streams.] Retrieved on 13 May 2008.\n\nThe width of a jet stream is typically a few hundred kilometres or miles and its vertical thickness often less than 5 km.\n\nJet streams are typically continuous over long distances, but discontinuities are common.Glossary of Meteorology. [http://amsglossary.allenpress.com/glossary/search?id\njet-stream1 Jet Stream.]  Retrieved on 8 May 2008. The path of the jet typically has a meandering shape, and these meanders themselves propagate eastward, at lower speeds than that of the actual wind within the flow. Each large meander, or wave, within the jet stream is known as a Rossby wave (planetary wave). Rossby waves are caused by changes in the Coriolis effect with latitude. Shortwave troughs, are smaller scale waves superimposed on the Rossby waves, with a scale of 1000 to(-) long,Glossary of Meteorology. [http://amsglossary.allenpress.com/glossary/search?idcyclone-wave1 Cyclone wave.]  Retrieved on 13 May 2008. that move along through the flow pattern around large scale, or longwave, \"ridges\" and \"troughs\" within Rossby waves.Glossary of Meteorology. [http://amsglossary.allenpress.com/glossary/search?p\n1&queryshort+wave&submit\nSearch Short wave.]  Retrieved on 13 May 2008. Jet streams can split into two when it encounters an upper-level low, that diverts a portion of the jet stream under its base, while the remainder of the jet moves by to its north.\n\nThe wind speeds are greatest where temperature differences (gradient) between air masses are greatest, and often exceed 92 km/h. Speeds over 398 km/h have been measured.\n\nThe jet stream moves from West to East bringing changes of weather.[http://www.space.com/scienceastronomy/solarsystem/jupiter_sidebar_000209.html Jet Streams On Earth and Jupiter.]  Retrieved on 4 May 2008. Meteorologists now understand that the path of jet streams affects cyclonic storm systems at lower levels in the atmosphere, and so knowledge of their course has become an important part of weather forecasting. For example, in 2007 and 2012, Britain experienced severe flooding as a result of the polar jet staying south for the summer.Blackburn, Mike; Hoskins, Brian; Slingo, Julia: \n\nThe polar and subtropical jets merge at some locations and times, while at other times they are well separated.\n\nCause\n\nIn general, winds are strongest immediately under the tropopause (except locally, during tornadoes, tropical cyclones or other anomalous situations). If two air masses of different temperatures or densities meet, the resulting pressure difference caused by the density difference (which ultimately causes wind) is highest within the transition zone. The wind does not flow directly from the hot to the cold area, but is deflected by the Coriolis effect and flows along the boundary of the two air masses.John P. Stimac. [http://www.ux1.eiu.edu/~cfjps/1400/pressure_wind.html Air pressure and wind.] Retrieved on 8 May 2008.\n\nAll these facts are consequences of the thermal wind relation. The balance of forces acting on an atmospheric air parcel in the vertical direction is primarily between the gravitational force acting on the mass of the parcel and the buoyancy force, or the difference in pressure between the top and bottom surfaces of the parcel. Any imbalance between these forces results in the acceleration of the parcel in the imbalance direction: upward if the buoyant force exceeds the weight, and downward if the weight exceeds the buoyancy force. The balance in the vertical direction is referred to as hydrostatic. Beyond the tropics, the dominant forces act in the horizontal direction, and the primary struggle is between the Coriolis force and the pressure gradient force. Balance between these two forces is referred to as geostrophic. Given both hydrostatic and geostrophic balance, one can derive the thermal wind relation: the vertical gradient of the horizontal wind is proportional to the horizontal temperature gradient. If two air masses, one cold and dense to the North and the other hot and less dense to the South, are separated by a vertical boundary and that boundary should be removed, the difference in densities will result in the cold air mass slipping under the hotter and less dense air mass. The Coriolis effect will then cause poleward-moving mass to deviate to the East, while equatorward-moving mass will deviate toward the west. The general trend in the atmosphere is for temperatures to decrease in the poleward direction. As a result, winds develop an eastward component and that component grows with altitude. Therefore, the strong eastward moving jet streams are in part a simple consequence of the fact that the Equator is warmer than the North and South poles.\n\nPolar jet stream\n\nThe thermal wind relation does not explain why the winds are organized into tight jets, rather than distributed more broadly over the hemisphere. One factor that contributes to the creation of a concentrated polar jet is the undercutting of sub-tropical air masses by the more dense polar air masses at the polar front. This causes surface low pressure and higher pressure at altitude. At high latitudes, lack of friction allows air to respond freely to the steep pressure gradient with low pressure at high altitude over the pole. This results in the formation of planetary wind circulations that experience a strong Coriolis deflection and thus can be considered 'quasi-geostrophic'. The polar front jet stream is closely linked to the frontogenesis process in midlatitudes, as the acceleration/deceleration of the air flow induces areas of low/high pressure respectively, which link to the formation of cyclones and anticyclones along the polar front in a relatively narrow region.\n\nSubtropical jet\n\nA second factor which contributes to a concentrated jet, that is more applicable to the subtropical jet, which forms at the poleward limit of the tropical Hadley cell and to first order this circulation is symmetric with respect to longitude. Tropical air rises to the tropopause, and moves poleward before sinking; this is the Hadley cell circulation. As it does so it tends to conserve angular momentum, since friction with the ground is significant. Air masses that begin moving poleward are deflected eastward by the Coriolis force (true for either hemisphere), which for poleward moving air implies an increased eastward component of the windsLyndon State College Meteorology. [http://apollo.lsc.vsc.edu/classes/met130/notes/chapter10/subt_jet_form.html Jet Stream Formation – Subtropical Jet.] Retrieved on 8 May 2008. (note that leftward deflection in the southern hemisphere).\n\nOther planets\n\nJupiter's atmosphere has multiple jet streams, caused by the convection cells that form the familiar banded color structure; on Jupiter, these convection cells are driven by internal heating.Robert Roy Britt. [http://www.space.com/scienceastronomy/solarsystem/jupiter_sidebar_000209.html et Streams On Earth and Jupiter.]  Retrieved on 4 May 2008. The factors that control the number of jet streams in a planetary atmosphere is an active area of research in dynamical meteorology. In models, as one increases the planetary radius, holding all other parameters fixed, the number of jet streams decreases.\n\nSome effects\n\nHurricane protection\n\nThe subtropical jet stream rounding the base of the mid-oceanic upper trough is thought  to be one of the reasons most of the Hawaiian Islands have been resistant to the long list of Hawaii hurricanes that have approached. For example, when Hurricane Flossie (2007) approached and dissipated just before reaching landfall, the U.S. National Oceanic and Atmospheric Administration (NOAA) cited vertical wind shear as evidenced in the photo.[http://www.prh.noaa.gov/cphc/summaries/2007.php NOAA Overview of Hurricane Flossie]\n\nUses\n\nOn Earth, the northern polar jet stream is the most important one for aviation and weather forecasting, as it is much stronger and at a much lower altitude than the subtropical jet streams and also covers many countries in the Northern Hemisphere, while the southern polar jet stream mostly circles Antarctica and sometimes the southern tip of South America. The term jet stream in these contexts thus usually implies the northern polar jet stream.\n\nAviation\n\nThe location of the jet stream is extremely important for aviation. Commercial use of the jet stream began on 18 November 1952, when Pan Am flew from Tokyo to Honolulu at an altitude of 7600 m. It cut the trip time by over one-third, from 18 to 11.5 hours. Not only does it cut time off the flight, it also nets fuel savings for the airline industry.Ned Rozell. [http://www.gi.alaska.edu/ScienceForum/ASF17/1727.html Amazing flying machines allow time travel.] Retrieved on 8 May 2008. Within North America, the time needed to fly east across the continent can be decreased by about 30 minutes if an airplane can fly with the jet stream, or increased by more than that amount if it must fly west against it.\n\nAssociated with jet streams is a phenomenon known as clear-air turbulence (CAT), caused by vertical and horizontal wind shear caused by jet streams.BBC. [http://www.bbc.co.uk/weather/features/understanding/jetstreams_uk.shtml Jet Streams in the UK.]  Retrieved on 8 May 2008. The CAT is strongest on the cold air side of the jet,M. P. de Villiers and J. van Heerden. [http://journals.cambridge.org/action/displayAbstract?fromPageonline&aid\n73339 Clear air turbulence over South Africa.] Retrieved on 8 May 2008. next to and just under the axis of the jet.Clark T. L., Hall W. D., Kerr R. M., Middleton D., Radke L., Ralph F. M., Neiman P. J., Levinson D. [http://cat.inist.fr/?aModeleafficheN&cpsidt\n1345004 Origins of aircraft-damaging clear-air turbulence during the 9 December 1992 Colorado downslope windstorm : Numerical simulations and comparison with observations.] Retrieved on 8 May 2008. Clear-air turbulence can cause aircraft to plunge and so present a passenger safety hazard that has caused fatal accidents, such as the death of one passenger on United Airlines Flight 826.National Transportation Safety Board. [http://www.ntsb.gov/Pressrel/1997/971230.htm Aircraft Accident Investigation United Airlines flight 826, Pacific Ocean 28 December 1997.] Retrieved on 13 May 2008.\n\nPossible future power generation\n\nScientists are investigating ways to harness the wind energy within the jet stream. According to one estimate, of the potential wind energy in the jet stream, only 1 percent would be needed to meet the world's current energy needs. The required technology would reportedly take 10–20 years to develop.Keay Davidson. [http://www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2007/05/07/MNGNEPMD801.DTL Scientists look high in the sky for power.] Retrieved on 8 May 2008.\nThere are two major but divergent scientific articles about jet stream power. Archer & CaldeiraArcher, C. L. and Caldeira, K. [http://www.awec2010.com/public/img/media/archer_caldeira.pdf Global assessment of high-altitude wind power, IEEE T. Energy Conver., 2, 307–319, 2009.]  Retrieved on 24 October 2012. claim that the Earth's jet streams could generate a total power of 1700 terawatts (TW) and that the climatic impact of harnessing this amount would be negligible. However, Miller, Gans, & KleidonL.M. Miller, F. Gans, & A. Kleidon [http://www.earth-syst-dynam.net/2/201/2011/esd-2-201-2011.pdf Jet stream wind power as a renewable energy resource: little power, big impacts. Earth Syst. Dynam. Discuss. 2. 201–212. 2011.] Retrieved on 16 January 201208. claim that the jet streams could generate a total power of only 7.5 TW and that the climatic impact would be catastrophic.\n\nUnpowered aerial attack\n\nNear the end of World War II the Japanese fire balloon was designed as a cheap weapon intended to make use of the jet stream over the Pacific Ocean to reach the west coast of Canada and the United States. They were relatively ineffective as weapons, but they were used in one of the few attacks on North America during World War II, causing six deaths and a small amount of damage.[http://www.faqs.org/docs/air/avfusen.html The Fire Balloons]\n\nChanges due to climate cycles\n\nEffects of ENSO\n\nEl Niño-Southern Oscillation (ENSO) influences the average location of upper-level jet streams, and leads to cyclical variations in precipitation and temperature across North America, as well as affecting tropical cyclone development across the eastern Pacific and Atlantic basins. Combined with the Pacific Decadal Oscillation, ENSO can also impact cold season rainfall in Europe.Davide Zanchettin, Stewart W. Franks, Pietro Traverso, and Mario Tomasino. [http://www3.interscience.wiley.com/journal/114802316/abstract On ENSO impacts on European wintertime rainfalls and their modulation by the NAO and the Pacific multi-decadal variability described through the PDO index.] Retrieved on 13 May 2008. Changes in ENSO also change the location of the jet stream over South America, which partially affects precipitation distribution over the continent.Caio Augusto dos Santos Coelho and Térico Ambrizzi. [http://www.cptec.inpe.br/~caio/chile2000.pdf 5A.4. Climatological Studies of the Influences of El Niño Southern Oscillation Events in the Precipitation Pattern Over South America During Austral Summer.] Retrieved on 13 May 2008.\n\nEl Niño\n\nDuring El Niño events, increased precipitation is expected in California due to a more southerly, zonal, storm track.John Monteverdi and Jan Null. [http://tornado.sfsu.edu/geosciences/elnino/elnino.html WESTERN REGION TECHNICAL ATTACHMENT NO. 97-37 November 21, 1997: El Niño and California Precipitation.] Retrieved on 28 February 2008. During the Niño portion of ENSO, increased precipitation falls along the Gulf coast and Southeast due to a stronger than normal, and more southerly, polar jet stream.Climate Prediction Center. [http://www.cpc.noaa.gov/products/analysis_monitoring/ensocycle/ensorain.shtml El Niño (ENSO) Related Rainfall Patterns Over the Tropical Pacific.] Retrieved on 28 February 2008. Snowfall is greater than average across the southern Rockies and Sierra Nevada mountain range, and is well below normal across the Upper Midwest and Great Lakes states.Climate Prediction Center. [http://www.cpc.ncep.noaa.gov/products/analysis_monitoring/lanina/us_impacts/ustp_impacts.shtml ENSO Impacts on United States Winter Precipitation and Temperature.] Retrieved on 16 April 2008. The northern tier of the lower 48 exhibits above normal temperatures during the fall and winter, while the Gulf coast experiences below normal temperatures during the winter season.Climate Prediction Center. [http://www.cpc.ncep.noaa.gov/products/predictions/threats2/enso/elnino/UStrank/ond.gif Average October–December (3-month) Temperature Rankings During ENSO Events.] Retrieved on 16 April 2008.Climate Prediction Center. [http://www.cpc.ncep.noaa.gov/products/predictions/threats2/enso/elnino/UStrank/djf.gif Average December–February (3-month) Temperature Rankings During ENSO Events.] Retrieved on 16 April 2008. The subtropical jet stream across the deep tropics of the Northern Hemisphere is enhanced due to increased convection in the equatorial Pacific, which decreases tropical cyclogenesis within the Atlantic tropics below what is normal, and increases tropical cyclone activity across the eastern Pacific. In the Southern Hemisphere, the subtropical jet stream is displaced equatorward, or north, of its normal position, which diverts frontal systems and thunderstorm complexes from reaching central portions of the continent.\n\nLa Niña\n\nAcross North America during La Niña, increased precipitation is diverted into the Pacific Northwest due to a more northerly storm track and jet stream.Nathan Mantua. [http://www.ccb.ucar.edu/lanina/report/mantua.html La Niña Impacts in the Pacific Northwest.]  Retrieved on 29 February 2008. The storm track shifts far enough northward to bring wetter than normal conditions (in the form of increased snowfall) to the Midwestern states, as well as hot and dry summers.Southeast Climate Consortium. [http://www.agclimate.org/Development/apps/agClimate/controller/perl/agClimate.pl/agClimate.pl?functionclimforecast/outlook.html&location\nlocal&type SECC Winter Climate Outlook.]  Retrieved on 29 February 2008.Reuters. [https://www.reuters.com/article/domesticNews/idUSN1619766420070216 La Nina could mean dry summer in Midwest and Plains.] Retrieved on 29 February 2008. Snowfall is above normal across the Pacific Northwest and western Great Lakes. Across the North Atlantic, the jet stream is stronger than normal, which directs stronger systems with increased precipitation towards Europe.Paul Simons and Simon de Bruxelles. [http://www.timesonline.co.uk/tol/news/environment/article3200801.ece More rain and more floods as La Niña sweeps across the globe.] Retrieved on 13 May 2008.\n\nDust Bowl\n\nEvidence suggests the jet stream was at least partly responsible for the widespread drought conditions during the 1930s Dust Bowl in the Midwest United States. Normally, the jet stream flows east over the Gulf of Mexico and turns northward pulling up moisture and dumping rain onto the Great Plains. During the Dust Bowl, the jet stream weakened and changed course traveling farther south than normal. This starved the Great Plains and other areas of the Midwest of rainfall, causing extraordinary drought conditions.Weather at About.com. [http://weather.about.com/od/weatherfaqs/f/dustbowl.html Causes of the Dust Bowl in the United States.] Retrieved on 10 June 2008.\n\nLonger-term climatic changes\n\nClimate scientists have hypothesized that the jet stream will gradually weaken as a result of global warming. Trends such as Arctic sea ice decline, reduced snow cover, evapotranspiration patterns, and other weather anomalies are expected to make the Arctic heat up faster than other parts of the globe. This in turn reduces the temperature gradient that drives jet stream winds, causing the jet stream to become weaker and more variable in its course.\n*\n*\n*\n*\n\nSince 2007, and particularly in 2012 and early 2013, the jet stream has been at an abnormally low latitude across the UK, lying closer to the English Channel, around 50°N rather than its more usual north of Scotland latitude of around 60°N. However, between 1979 and 2001, it has been found that the average position of the jet stream has been moving northward at a rate of  per year across the Northern Hemisphere. Across North America, this type of change could lead to drier conditions across the southern tier of the United States and more frequent and more intense tropical cyclones in the tropics. A similar slow poleward drift was found when studying the Southern Hemisphere jet stream over the same time frame.Associated Press. [http://komonews.com/news/local/jet-stream-found-to-be-permanently-drifting-north Jet stream found to be permanently drifting north.] Retrieved on 14 June 2016.\n\nOther upper-level jets\n\nPolar night jet\n\nThe polar-night jet stream forms only during the winter months when the nights are much longer, hence polar nights, in their respective hemispheres at around 60° latitude. The polar night jet moves at a greater height of about 80000 ft than it does during the summer. During these dark months the air high over the poles becomes much colder than the air over the equator. This difference in temperature gives rise to extreme air pressure differences in the stratosphere, which, when combined with the Coriolis effect, create the polar night jets, that race eastward at an altitude of about 30 mi.  The polar vortex is circled by the polar night jet. The warmer air can only move along the edge of the polar vortex, but not enter it. Within the vortex, the cold polar air becomes increasingly cold with neither warmer air from lower latitudes nor energy from the Sun during the polar night.\n\nLow level jets\n\nThere are wind maxima at lower levels of the atmosphere that are also referred to as jets.\n\nBarrier jet\n\nA barrier jet in the low levels forms just upstream of mountain chains, with the mountains forcing the jet to be oriented parallel to the mountains. The mountain barrier increases the strength of the low level wind by 45 percent.J. D. Doyle. [http://cat.inist.fr/?aModeleafficheN&cpsidt\n2721180 The influence of mesoscale orography on a coastal jet and rainband.] Retrieved on 25 December 2008. In the North American Great Plains a southerly low-level jet helps fuel overnight thunderstorm activity during the warm season, normally in the form of mesoscale convective systems which form during the overnight hours.Matt Kumijan, Jeffry Evans, and Jared Guyer. [http://www.spc.noaa.gov/publications/evans/kumjian.pdf The Relationship of the Great Plains Low-Level Jet to Nocturnal MCS Development.] Retrieved on 8 May 2008. A similar phenomenon develops across Australia, which pulls moisture poleward from the Coral Sea towards cut-off lows which form mainly across southwestern portions of the continent.L. Qi, L.M. Leslie, and S.X. Zhao. [http://www3.interscience.wiley.com/journal/68500464/abstract?CRETRY1&SRETRY\n0 Cut-off low pressure systems over southern Australia: climatology and case study.] Retrieved on 8 May 2008.\n\nValley exit jet\n\nA valley exit jet is a strong, down-valley, elevated air current that emerges above the intersection of the valley and its adjacent plain. These winds frequently reach a maximum of 20 m/s (45 mph or 72 km/h) at a height of 40–200 m above the ground. Surface winds below the jet may sway vegetation, but are significantly weaker.\n\nThey are likely to be found in valley regions that exhibit diurnal mountain wind systems, such as those of the dry mountain ranges of the US. Deep valleys that terminate abruptly at a plain are more impacted by these factors than are those that gradually become shallower as downvalley distance increases.Whiteman, C. David (2000). Mountain Meteorology, p. 193. Oxford University Press, New York. , pp. 191–193.\n\nAfrica\n\nThe mid-level African easterly jet occurs during the Northern Hemisphere summer between 10°N and 20°N above West Africa, and the nocturnal poleward low-level jet occurs in the Great Plains of east and South Africa.Dr. Alex DeCaria. [http://snowball.millersville.edu/~adecaria/ESCI344/esci344_lesson04_seasonal_mean_wind_fields.pdf Lesson 4 – Seasonal-mean Wind Fields.] Retrieved on 3 May 2008. The low-level easterly African jet stream is considered to play a crucial role in the southwest monsoon of Africa,Kerry H. Cook. [http://ams.allenpress.com/perlserv/?requestget-abstract&doi\n10.1175%2F1520-0442(1999)012%3C1165%3AGOTAEJ%3E2.0.CO%3B2 Generation of the African Easterly Jet and Its Role in Determining West African Precipitation.] Retrieved on 8 May 2008. and helps form the tropical waves which move across the tropical Atlantic and eastern Pacific oceans during the warm season.Chris Landsea. AOML Frequently Asked Questions. [http://www.aoml.noaa.gov/hrd/tcfaq/A4.html Subject: A4) What is an easterly wave ?]  Retrieved on 8 May 2008. The formation of the thermal low over northern Africa leads to a low-level westerly jet stream from June into October.B. Pu and K. H. Cook (2008). [http://adsabs.harvard.edu/abs/2008AGUFM.A13A0229P Dynamics of the Low-Level Westerly Jet Over West Africa.] American Geophysical Union, Fall Meeting 2008, abstract #A13A-0229. Retrieved on 8 March 2009.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jet stream" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16472" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jet streams are fast flowing, narrow, meandering air currents in the atmospheres of some planets, including Earth. On Earth, the main jet streams are located near the altitude of the tropopause and are westerly winds (flowing west to east). Their paths typically have a meandering shape. Jet streams may start, stop, split into two or more parts, combine into one stream, or flow in various directions including opposite to the direction of the remainder of the jet.\n\nThe strongest jet streams are the polar jets, at 9 - above sea level, and the higher altitude and somewhat weaker subtropical jets at 10 -. The Northern Hemisphere and the Southern Hemisphere  each have a polar jet and a subtropical jet. The northern hemisphere polar jet flows over the middle to northern latitudes of North America, Europe, and Asia and their intervening oceans, while the southern hemisphere polar jet mostly circles Antarctica all year round.\n\nJet streams are the product of two factors: the atmospheric heating by solar radiation that produces the large scale Polar, Ferrel, and Hadley circulation cells, and the action of the Coriolis force acting on those moving masses. The Coriolis force is caused by the planet's rotation on its axis. On other planets, internal heat rather than solar heating drives their jet streams. The Polar jet stream forms near the interface of the Polar and Ferrel circulation cells; the subtropical jet forms near the boundary of the Ferrel and Hadley circulation cells.\n\nOther jet streams also exist. During the Northern Hemisphere summer, easterly jets can form in tropical regions, typically where dry air encounters more humid air at high altitudes. Low-level jets also are typical of various regions such as the central United States.  There are also jetstreams in the thermosphere.\n\nMeteorologists use the location of some of the jet streams as an aid in weather forecasting. The main commercial relevance of the jet streams is in air travel, as flight time can be dramatically affected by either flying with the flow or against, which results in significant fuel and time cost savings for airlines. Often, the airlines work to fly 'with' the jet stream for this reason. Dynamic North Atlantic Tracks are one example of how airlines and air traffic control work together to accommodate the jet stream and winds aloft that results in the maximum benefit for airlines and other users. Clear-air turbulence, a potential hazard to aircraft passenger safety, is often found in a jet stream's vicinity, but it does not create a substantial alteration on flight times. These are a narrow belt.\n\nDiscovery\n\nAfter the 1883 eruption of the Krakatoa volcano, weather watchers tracked and mapped the effects on the sky over several years. They labelled the phenomenon the \"equatorial smoke stream\".See:\n# Bishop, Sereno E. (17 January 1884) \"Letters to the Editor: The remarkable sunsets,\" Nature, 29: 259–260; on [https://books.google.com/books?idIscKAAAAYAAJ&pg\nPA260#vonepage&q&f\nfalse page 260], Bishop speculates that a rapid current in the upper atmosphere was carrying the dust from the eruption of Krakatau westward around the equator.\n# Bishop, S.E. (May 1884) [https://books.google.com/books?idvLYx_8gCXq0C&pg\nPA106#vonepage&q&f\nfalse \"The equatorial smoke-stream from Krakatoa,\"] The Hawaiian Monthly, vol. 1, no. 5, pages 106–110.\n# Bishop, S.E. (29 January 1885) [https://books.google.com/books?id9OLp4UZFtqYC&pg\nPA288#vonepage&q&f\nfalse \"Letters to the Editor: Krakatoa,\"] Nature, vol. 31, pages 288–289.\n# Rev. Sereno E. Bishop (1886) \"The origin of the red glows,\" American Meteorological Journal, vol. 3, pages [https://books.google.com/books?idUcowAQAAMAAJ&pg\nPA127#vonepage&q&f\nfalse 127–136], [https://books.google.com/books?idUcowAQAAMAAJ&pg\nPA193#vonepage&q&f\nfalse 193–196]; on pages 133–136, Bishop discusses the \"equatorial smoke stream\" that was produced by the eruption of Krakatau.\n# Hamilton, Kevin (2012) [http://iprc.soest.hawaii.edu/users/kph/K.pdf \"Sereno Bishop, Rollo Russell, Bishop's Ring and the discovery of the \"Krakatoa easterlies\",\"]  Atmosphere-Ocean, vol. 50, no. 2, pages 169–175.\n# Krakatoa Committee of the Royal Society [of London], The Eruption of Krakatoa and Subsequent Phenomena (London, England: Harrison and Sons, 1888). Evidence of an equatorial high-speed, high-altitude current (actually, the quasi-biennial oscillation) is presented in the following sections:\n:* Part IV., Section II. General list of dates of first appearance of all the optical phenomena. By the Hon. Rollo Russell., [https://books.google.com/books?idVk8PAAAAYAAJ&pg\nPA263#vonepage&q&f\nfalse pages 263–312].\n:* Part IV., Section III. (A). General geographic distribution of all the optical phenomena in space and time; including also velocity of translation of smoke stream. By the Hon. Rollo Russell., [https://books.google.com/books?idVk8PAAAAYAAJ&pg\nPA312#vonepage&q&f\nfalse pages 312–326].\n:* Part IV., Section III. (B). The connection between the propagation of the sky haze with its accompanying optical phenomena, and the general circulation of the atmosphere. By Mr. E. Douglas Archibald., [https://books.google.com/books?idVk8PAAAAYAAJ&pg\nPA326#vonepage&q&f\nfalse pages 326–334]; that Rev. S.E. Bishop of Honolulu first noticed a westward circulation of dust from Krakatau is acknowledged on page 333.\n:* Part IV., Section III. (C). Spread of the phenomena round the world, with maps illustrative thereof. By the Hon. Rollo Russell., [https://books.google.com/books?idVk8PAAAAYAAJ&pg\nPA334#vonepage&q&f\nfalse pages 334–339]; after page 334 there are map inserts, showing the progressive spread, along the equator, of the dust from Krakatau. In the 1920s, a Japanese meteorologist, Wasaburo Oishi, detected the jet stream from a site near Mount Fuji.Ooishi, W. (1926) Raporto de la Aerologia Observatorio de Tateno (in Esperanto). Aerological Observatory Report 1, Central Meteorological Observatory, Japan, 213 pages.  He tracked pilot balloons, also known as pibals (balloons used to determine upper level winds),Martin Brenner. [http://www.csulb.edu/~mbrenner/balloon.htm Pilot Balloon Resources.] Retrieved on 13 May 2008. as they rose into the atmosphere. Oishi's work largely went unnoticed outside Japan because it was published in Esperanto. American pilot Wiley Post, the first man to fly around the world solo in 1933, is often given some credit for discovery of jet streams. Post invented a pressurized suit that let him fly above 6200 m. In the year before his death, Post made several attempts at a high-altitude transcontinental flight, and noticed that at times his ground speed greatly exceeded his air speed.Acepilots.com. [http://www.acepilots.com/post.html Wiley Post.] Retrieved on 8 May 2008.\nGerman meteorologist Heinrich Seilkopf is credited with coining a special term, Strahlströmung (literally \"jet current\"), for the phenomenon in 1939.Seilkopf, H., Maritime meteorologie, which is volume II of: R. Habermehl, ed., Handbuch der Fliegenwetterkunde [Handbook of Aeronautical Meteorology] (Berlin, Germany: Gebrüder Radetzke [Radetzke Brothers], 1939); Seilkopf coins the word \"Strahlströmung\" on page 142 and discusses the jet stream on pages 142–150.Arbeiten zur allgemeinen Klimatologie By Hermann Flohn [https://books.google.com/books?idOlwLAQAAIAAJ&q\nseilkopf+Strahlstr%C3%B6mung&dqseilkopf+Strahlstr%C3%B6mung&lr\n&eiSyXXS-K9JaailASGnszQCA&cd\n7 p. 47] (Modern German usage is \"Strahlstrom\".) Many sources credit real understanding of the nature of jet streams to regular and repeated flight-path traversals during World War II. Flyers consistently noticed westerly tailwinds in excess of 100 mph in flights, for example, from the US to the UK.  Similarly in 1944 a team of American meteorologists in Guam, including Reid Bryson, had enough observations to forecast very high west winds that would slow bombers going to Japan.[http://www.statesman.com/news/news/opinion/when-the-jet-stream-was-the-wind-of-war/nRxPD/ When the jet stream was the wind of war]\n\nDescription\n\nPolar jet streams are typically located near the 250 hPa (about 1/4 atmosphere) pressure level, or 7 to above sea level, while the weaker subtropical jet streams are much higher, between 10 and. Jet streams wander laterally dramatically, and have large changes in their altitude. The jet streams form near breaks in the tropopause, at the transitions between the Polar, Ferrel and Hadley circulation cells, and whose circulation, with the Coriolis force acting on those masses, drives the jet streams. The Polar jets, at lower altitude, and often intruding into mid-latitudes, strongly affects weather and aviation.David R. Cook [http://www.newton.dep.anl.gov/askasci/wea00/wea00067.htm Jet Stream Behavior.] Retrieved on 8 May 2008.B. Geerts and E. Linacre. [http://www-das.uwyo.edu/~geerts/cwx/notes/chap01/tropo.html The Height of the Tropopause.] Retrieved on 8 May 2008. The polar jet stream is most commonly found between latitudes 30° and 60° (closer to 60°), while the subtropical jet streams are located close to latitude 30°. The northern Polar jet stream is said to \"follow the sun\" as it slowly migrates northward as that hemisphere warms, and southward again as it cools.National Weather Service JetStream. [http://www.srh.noaa.gov/jetstream//global/jet.htm The Jet Stream.] Retrieved on 8 May 2008.McDougal Littell. [http://www.classzone.com/books/earth_science/terc/content/investigations/es1908/es1908page04.cfm Paths of Polar and Subtropical Jet Streams.] Retrieved on 13 May 2008.\n\nThe width of a jet stream is typically a few hundred kilometres or miles and its vertical thickness often less than 5 km.\n\nJet streams are typically continuous over long distances, but discontinuities are common.Glossary of Meteorology. [http://amsglossary.allenpress.com/glossary/search?id\njet-stream1 Jet Stream.]  Retrieved on 8 May 2008. The path of the jet typically has a meandering shape, and these meanders themselves propagate eastward, at lower speeds than that of the actual wind within the flow. Each large meander, or wave, within the jet stream is known as a Rossby wave (planetary wave). Rossby waves are caused by changes in the Coriolis effect with latitude. Shortwave troughs, are smaller scale waves superimposed on the Rossby waves, with a scale of 1000 to(-) long,Glossary of Meteorology. [http://amsglossary.allenpress.com/glossary/search?idcyclone-wave1 Cyclone wave.]  Retrieved on 13 May 2008. that move along through the flow pattern around large scale, or longwave, \"ridges\" and \"troughs\" within Rossby waves.Glossary of Meteorology. [http://amsglossary.allenpress.com/glossary/search?p\n1&queryshort+wave&submit\nSearch Short wave.]  Retrieved on 13 May 2008. Jet streams can split into two when it encounters an upper-level low, that diverts a portion of the jet stream under its base, while the remainder of the jet moves by to its north.\n\nThe wind speeds are greatest where temperature differences (gradient) between air masses are greatest, and often exceed 92 km/h. Speeds over 398 km/h have been measured.\n\nThe jet stream moves from West to East bringing changes of weather.[http://www.space.com/scienceastronomy/solarsystem/jupiter_sidebar_000209.html Jet Streams On Earth and Jupiter.]  Retrieved on 4 May 2008. Meteorologists now understand that the path of jet streams affects cyclonic storm systems at lower levels in the atmosphere, and so knowledge of their course has become an important part of weather forecasting. For example, in 2007 and 2012, Britain experienced severe flooding as a result of the polar jet staying south for the summer.Blackburn, Mike; Hoskins, Brian; Slingo, Julia: \n\nThe polar and subtropical jets merge at some locations and times, while at other times they are well separated.\n\nCause\n\nIn general, winds are strongest immediately under the tropopause (except locally, during tornadoes, tropical cyclones or other anomalous situations). If two air masses of different temperatures or densities meet, the resulting pressure difference caused by the density difference (which ultimately causes wind) is highest within the transition zone. The wind does not flow directly from the hot to the cold area, but is deflected by the Coriolis effect and flows along the boundary of the two air masses.John P. Stimac. [http://www.ux1.eiu.edu/~cfjps/1400/pressure_wind.html Air pressure and wind.] Retrieved on 8 May 2008.\n\nAll these facts are consequences of the thermal wind relation. The balance of forces acting on an atmospheric air parcel in the vertical direction is primarily between the gravitational force acting on the mass of the parcel and the buoyancy force, or the difference in pressure between the top and bottom surfaces of the parcel. Any imbalance between these forces results in the acceleration of the parcel in the imbalance direction: upward if the buoyant force exceeds the weight, and downward if the weight exceeds the buoyancy force. The balance in the vertical direction is referred to as hydrostatic. Beyond the tropics, the dominant forces act in the horizontal direction, and the primary struggle is between the Coriolis force and the pressure gradient force. Balance between these two forces is referred to as geostrophic. Given both hydrostatic and geostrophic balance, one can derive the thermal wind relation: the vertical gradient of the horizontal wind is proportional to the horizontal temperature gradient. If two air masses, one cold and dense to the North and the other hot and less dense to the South, are separated by a vertical boundary and that boundary should be removed, the difference in densities will result in the cold air mass slipping under the hotter and less dense air mass. The Coriolis effect will then cause poleward-moving mass to deviate to the East, while equatorward-moving mass will deviate toward the west. The general trend in the atmosphere is for temperatures to decrease in the poleward direction. As a result, winds develop an eastward component and that component grows with altitude. Therefore, the strong eastward moving jet streams are in part a simple consequence of the fact that the Equator is warmer than the North and South poles.\n\nPolar jet stream\n\nThe thermal wind relation does not explain why the winds are organized into tight jets, rather than distributed more broadly over the hemisphere. One factor that contributes to the creation of a concentrated polar jet is the undercutting of sub-tropical air masses by the more dense polar air masses at the polar front. This causes surface low pressure and higher pressure at altitude. At high latitudes, lack of friction allows air to respond freely to the steep pressure gradient with low pressure at high altitude over the pole. This results in the formation of planetary wind circulations that experience a strong Coriolis deflection and thus can be considered 'quasi-geostrophic'. The polar front jet stream is closely linked to the frontogenesis process in midlatitudes, as the acceleration/deceleration of the air flow induces areas of low/high pressure respectively, which link to the formation of cyclones and anticyclones along the polar front in a relatively narrow region.\n\nSubtropical jet\n\nA second factor which contributes to a concentrated jet, that is more applicable to the subtropical jet, which forms at the poleward limit of the tropical Hadley cell and to first order this circulation is symmetric with respect to longitude. Tropical air rises to the tropopause, and moves poleward before sinking; this is the Hadley cell circulation. As it does so it tends to conserve angular momentum, since friction with the ground is significant. Air masses that begin moving poleward are deflected eastward by the Coriolis force (true for either hemisphere), which for poleward moving air implies an increased eastward component of the windsLyndon State College Meteorology. [http://apollo.lsc.vsc.edu/classes/met130/notes/chapter10/subt_jet_form.html Jet Stream Formation – Subtropical Jet.] Retrieved on 8 May 2008. (note that leftward deflection in the southern hemisphere).\n\nOther planets\n\nJupiter's atmosphere has multiple jet streams, caused by the convection cells that form the familiar banded color structure; on Jupiter, these convection cells are driven by internal heating.Robert Roy Britt. [http://www.space.com/scienceastronomy/solarsystem/jupiter_sidebar_000209.html et Streams On Earth and Jupiter.]  Retrieved on 4 May 2008. The factors that control the number of jet streams in a planetary atmosphere is an active area of research in dynamical meteorology. In models, as one increases the planetary radius, holding all other parameters fixed, the number of jet streams decreases.\n\nSome effects\n\nHurricane protection\n\nThe subtropical jet stream rounding the base of the mid-oceanic upper trough is thought  to be one of the reasons most of the Hawaiian Islands have been resistant to the long list of Hawaii hurricanes that have approached. For example, when Hurricane Flossie (2007) approached and dissipated just before reaching landfall, the U.S. National Oceanic and Atmospheric Administration (NOAA) cited vertical wind shear as evidenced in the photo.[http://www.prh.noaa.gov/cphc/summaries/2007.php NOAA Overview of Hurricane Flossie]\n\nUses\n\nOn Earth, the northern polar jet stream is the most important one for aviation and weather forecasting, as it is much stronger and at a much lower altitude than the subtropical jet streams and also covers many countries in the Northern Hemisphere, while the southern polar jet stream mostly circles Antarctica and sometimes the southern tip of South America. The term jet stream in these contexts thus usually implies the northern polar jet stream.\n\nAviation\n\nThe location of the jet stream is extremely important for aviation. Commercial use of the jet stream began on 18 November 1952, when Pan Am flew from Tokyo to Honolulu at an altitude of 7600 m. It cut the trip time by over one-third, from 18 to 11.5 hours. Not only does it cut time off the flight, it also nets fuel savings for the airline industry.Ned Rozell. [http://www.gi.alaska.edu/ScienceForum/ASF17/1727.html Amazing flying machines allow time travel.] Retrieved on 8 May 2008. Within North America, the time needed to fly east across the continent can be decreased by about 30 minutes if an airplane can fly with the jet stream, or increased by more than that amount if it must fly west against it.\n\nAssociated with jet streams is a phenomenon known as clear-air turbulence (CAT), caused by vertical and horizontal wind shear caused by jet streams.BBC. [http://www.bbc.co.uk/weather/features/understanding/jetstreams_uk.shtml Jet Streams in the UK.]  Retrieved on 8 May 2008. The CAT is strongest on the cold air side of the jet,M. P. de Villiers and J. van Heerden. [http://journals.cambridge.org/action/displayAbstract?fromPageonline&aid\n73339 Clear air turbulence over South Africa.] Retrieved on 8 May 2008. next to and just under the axis of the jet.Clark T. L., Hall W. D., Kerr R. M., Middleton D., Radke L., Ralph F. M., Neiman P. J., Levinson D. [http://cat.inist.fr/?aModeleafficheN&cpsidt\n1345004 Origins of aircraft-damaging clear-air turbulence during the 9 December 1992 Colorado downslope windstorm : Numerical simulations and comparison with observations.] Retrieved on 8 May 2008. Clear-air turbulence can cause aircraft to plunge and so present a passenger safety hazard that has caused fatal accidents, such as the death of one passenger on United Airlines Flight 826.National Transportation Safety Board. [http://www.ntsb.gov/Pressrel/1997/971230.htm Aircraft Accident Investigation United Airlines flight 826, Pacific Ocean 28 December 1997.] Retrieved on 13 May 2008.\n\nPossible future power generation\n\nScientists are investigating ways to harness the wind energy within the jet stream. According to one estimate, of the potential wind energy in the jet stream, only 1 percent would be needed to meet the world's current energy needs. The required technology would reportedly take 10–20 years to develop.Keay Davidson. [http://www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2007/05/07/MNGNEPMD801.DTL Scientists look high in the sky for power.] Retrieved on 8 May 2008.\nThere are two major but divergent scientific articles about jet stream power. Archer & CaldeiraArcher, C. L. and Caldeira, K. [http://www.awec2010.com/public/img/media/archer_caldeira.pdf Global assessment of high-altitude wind power, IEEE T. Energy Conver., 2, 307–319, 2009.]  Retrieved on 24 October 2012. claim that the Earth's jet streams could generate a total power of 1700 terawatts (TW) and that the climatic impact of harnessing this amount would be negligible. However, Miller, Gans, & KleidonL.M. Miller, F. Gans, & A. Kleidon [http://www.earth-syst-dynam.net/2/201/2011/esd-2-201-2011.pdf Jet stream wind power as a renewable energy resource: little power, big impacts. Earth Syst. Dynam. Discuss. 2. 201–212. 2011.] Retrieved on 16 January 201208. claim that the jet streams could generate a total power of only 7.5 TW and that the climatic impact would be catastrophic.\n\nUnpowered aerial attack\n\nNear the end of World War II the Japanese fire balloon was designed as a cheap weapon intended to make use of the jet stream over the Pacific Ocean to reach the west coast of Canada and the United States. They were relatively ineffective as weapons, but they were used in one of the few attacks on North America during World War II, causing six deaths and a small amount of damage.[http://www.faqs.org/docs/air/avfusen.html The Fire Balloons]\n\nChanges due to climate cycles\n\nEffects of ENSO\n\nEl Niño-Southern Oscillation (ENSO) influences the average location of upper-level jet streams, and leads to cyclical variations in precipitation and temperature across North America, as well as affecting tropical cyclone development across the eastern Pacific and Atlantic basins. Combined with the Pacific Decadal Oscillation, ENSO can also impact cold season rainfall in Europe.Davide Zanchettin, Stewart W. Franks, Pietro Traverso, and Mario Tomasino. [http://www3.interscience.wiley.com/journal/114802316/abstract On ENSO impacts on European wintertime rainfalls and their modulation by the NAO and the Pacific multi-decadal variability described through the PDO index.] Retrieved on 13 May 2008. Changes in ENSO also change the location of the jet stream over South America, which partially affects precipitation distribution over the continent.Caio Augusto dos Santos Coelho and Térico Ambrizzi. [http://www.cptec.inpe.br/~caio/chile2000.pdf 5A.4. Climatological Studies of the Influences of El Niño Southern Oscillation Events in the Precipitation Pattern Over South America During Austral Summer.] Retrieved on 13 May 2008.\n\nEl Niño\n\nDuring El Niño events, increased precipitation is expected in California due to a more southerly, zonal, storm track.John Monteverdi and Jan Null. [http://tornado.sfsu.edu/geosciences/elnino/elnino.html WESTERN REGION TECHNICAL ATTACHMENT NO. 97-37 November 21, 1997: El Niño and California Precipitation.] Retrieved on 28 February 2008. During the Niño portion of ENSO, increased precipitation falls along the Gulf coast and Southeast due to a stronger than normal, and more southerly, polar jet stream.Climate Prediction Center. [http://www.cpc.noaa.gov/products/analysis_monitoring/ensocycle/ensorain.shtml El Niño (ENSO) Related Rainfall Patterns Over the Tropical Pacific.] Retrieved on 28 February 2008. Snowfall is greater than average across the southern Rockies and Sierra Nevada mountain range, and is well below normal across the Upper Midwest and Great Lakes states.Climate Prediction Center. [http://www.cpc.ncep.noaa.gov/products/analysis_monitoring/lanina/us_impacts/ustp_impacts.shtml ENSO Impacts on United States Winter Precipitation and Temperature.] Retrieved on 16 April 2008. The northern tier of the lower 48 exhibits above normal temperatures during the fall and winter, while the Gulf coast experiences below normal temperatures during the winter season.Climate Prediction Center. [http://www.cpc.ncep.noaa.gov/products/predictions/threats2/enso/elnino/UStrank/ond.gif Average October–December (3-month) Temperature Rankings During ENSO Events.] Retrieved on 16 April 2008.Climate Prediction Center. [http://www.cpc.ncep.noaa.gov/products/predictions/threats2/enso/elnino/UStrank/djf.gif Average December–February (3-month) Temperature Rankings During ENSO Events.] Retrieved on 16 April 2008. The subtropical jet stream across the deep tropics of the Northern Hemisphere is enhanced due to increased convection in the equatorial Pacific, which decreases tropical cyclogenesis within the Atlantic tropics below what is normal, and increases tropical cyclone activity across the eastern Pacific. In the Southern Hemisphere, the subtropical jet stream is displaced equatorward, or north, of its normal position, which diverts frontal systems and thunderstorm complexes from reaching central portions of the continent.\n\nLa Niña\n\nAcross North America during La Niña, increased precipitation is diverted into the Pacific Northwest due to a more northerly storm track and jet stream.Nathan Mantua. [http://www.ccb.ucar.edu/lanina/report/mantua.html La Niña Impacts in the Pacific Northwest.]  Retrieved on 29 February 2008. The storm track shifts far enough northward to bring wetter than normal conditions (in the form of increased snowfall) to the Midwestern states, as well as hot and dry summers.Southeast Climate Consortium. [http://www.agclimate.org/Development/apps/agClimate/controller/perl/agClimate.pl/agClimate.pl?functionclimforecast/outlook.html&location\nlocal&type SECC Winter Climate Outlook.]  Retrieved on 29 February 2008.Reuters. [https://www.reuters.com/article/domesticNews/idUSN1619766420070216 La Nina could mean dry summer in Midwest and Plains.] Retrieved on 29 February 2008. Snowfall is above normal across the Pacific Northwest and western Great Lakes. Across the North Atlantic, the jet stream is stronger than normal, which directs stronger systems with increased precipitation towards Europe.Paul Simons and Simon de Bruxelles. [http://www.timesonline.co.uk/tol/news/environment/article3200801.ece More rain and more floods as La Niña sweeps across the globe.] Retrieved on 13 May 2008.\n\nDust Bowl\n\nEvidence suggests the jet stream was at least partly responsible for the widespread drought conditions during the 1930s Dust Bowl in the Midwest United States. Normally, the jet stream flows east over the Gulf of Mexico and turns northward pulling up moisture and dumping rain onto the Great Plains. During the Dust Bowl, the jet stream weakened and changed course traveling farther south than normal. This starved the Great Plains and other areas of the Midwest of rainfall, causing extraordinary drought conditions.Weather at About.com. [http://weather.about.com/od/weatherfaqs/f/dustbowl.html Causes of the Dust Bowl in the United States.] Retrieved on 10 June 2008.\n\nLonger-term climatic changes\n\nClimate scientists have hypothesized that the jet stream will gradually weaken as a result of global warming. Trends such as Arctic sea ice decline, reduced snow cover, evapotranspiration patterns, and other weather anomalies are expected to make the Arctic heat up faster than other parts of the globe. This in turn reduces the temperature gradient that drives jet stream winds, causing the jet stream to become weaker and more variable in its course.\n*\n*\n*\n*\n\nSince 2007, and particularly in 2012 and early 2013, the jet stream has been at an abnormally low latitude across the UK, lying closer to the English Channel, around 50°N rather than its more usual north of Scotland latitude of around 60°N. However, between 1979 and 2001, it has been found that the average position of the jet stream has been moving northward at a rate of  per year across the Northern Hemisphere. Across North America, this type of change could lead to drier conditions across the southern tier of the United States and more frequent and more intense tropical cyclones in the tropics. A similar slow poleward drift was found when studying the Southern Hemisphere jet stream over the same time frame.Associated Press. [http://komonews.com/news/local/jet-stream-found-to-be-permanently-drifting-north Jet stream found to be permanently drifting north.] Retrieved on 14 June 2016.\n\nOther upper-level jets\n\nPolar night jet\n\nThe polar-night jet stream forms only during the winter months when the nights are much longer, hence polar nights, in their respective hemispheres at around 60° latitude. The polar night jet moves at a greater height of about 80000 ft than it does during the summer. During these dark months the air high over the poles becomes much colder than the air over the equator. This difference in temperature gives rise to extreme air pressure differences in the stratosphere, which, when combined with the Coriolis effect, create the polar night jets, that race eastward at an altitude of about 30 mi.  The polar vortex is circled by the polar night jet. The warmer air can only move along the edge of the polar vortex, but not enter it. Within the vortex, the cold polar air becomes increasingly cold with neither warmer air from lower latitudes nor energy from the Sun during the polar night.\n\nLow level jets\n\nThere are wind maxima at lower levels of the atmosphere that are also referred to as jets.\n\nBarrier jet\n\nA barrier jet in the low levels forms just upstream of mountain chains, with the mountains forcing the jet to be oriented parallel to the mountains. The mountain barrier increases the strength of the low level wind by 45 percent.J. D. Doyle. [http://cat.inist.fr/?aModeleafficheN&cpsidt\n2721180 The influence of mesoscale orography on a coastal jet and rainband.] Retrieved on 25 December 2008. In the North American Great Plains a southerly low-level jet helps fuel overnight thunderstorm activity during the warm season, normally in the form of mesoscale convective systems which form during the overnight hours.Matt Kumijan, Jeffry Evans, and Jared Guyer. [http://www.spc.noaa.gov/publications/evans/kumjian.pdf The Relationship of the Great Plains Low-Level Jet to Nocturnal MCS Development.] Retrieved on 8 May 2008. A similar phenomenon develops across Australia, which pulls moisture poleward from the Coral Sea towards cut-off lows which form mainly across southwestern portions of the continent.L. Qi, L.M. Leslie, and S.X. Zhao. [http://www3.interscience.wiley.com/journal/68500464/abstract?CRETRY1&SRETRY\n0 Cut-off low pressure systems over southern Australia: climatology and case study.] Retrieved on 8 May 2008.\n\nValley exit jet\n\nA valley exit jet is a strong, down-valley, elevated air current that emerges above the intersection of the valley and its adjacent plain. These winds frequently reach a maximum of 20 m/s (45 mph or 72 km/h) at a height of 40–200 m above the ground. Surface winds below the jet may sway vegetation, but are significantly weaker.\n\nThey are likely to be found in valley regions that exhibit diurnal mountain wind systems, such as those of the dry mountain ranges of the US. Deep valleys that terminate abruptly at a plain are more impacted by these factors than are those that gradually become shallower as downvalley distance increases.Whiteman, C. David (2000). Mountain Meteorology, p. 193. Oxford University Press, New York. , pp. 191–193.\n\nAfrica\n\nThe mid-level African easterly jet occurs during the Northern Hemisphere summer between 10°N and 20°N above West Africa, and the nocturnal poleward low-level jet occurs in the Great Plains of east and South Africa.Dr. Alex DeCaria. [http://snowball.millersville.edu/~adecaria/ESCI344/esci344_lesson04_seasonal_mean_wind_fields.pdf Lesson 4 – Seasonal-mean Wind Fields.] Retrieved on 3 May 2008. The low-level easterly African jet stream is considered to play a crucial role in the southwest monsoon of Africa,Kerry H. Cook. [http://ams.allenpress.com/perlserv/?requestget-abstract&doi\n10.1175%2F1520-0442(1999)012%3C1165%3AGOTAEJ%3E2.0.CO%3B2 Generation of the African Easterly Jet and Its Role in Determining West African Precipitation.] Retrieved on 8 May 2008. and helps form the tropical waves which move across the tropical Atlantic and eastern Pacific oceans during the warm season.Chris Landsea. AOML Frequently Asked Questions. [http://www.aoml.noaa.gov/hrd/tcfaq/A4.html Subject: A4) What is an easterly wave ?]  Retrieved on 8 May 2008. The formation of the thermal low over northern Africa leads to a low-level westerly jet stream from June into October.B. Pu and K. H. Cook (2008). [http://adsabs.harvard.edu/abs/2008AGUFM.A13A0229P Dynamics of the Low-Level Westerly Jet Over West Africa.] American Geophysical Union, Fall Meeting 2008, abstract #A13A-0229. Retrieved on 8 March 2009. Jet stream. http://en.wikipedia.org/?curid=16472."
  }
}
