{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19891",
  "eid" : "3e909840-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778614212,
  "textBody" : "A macron is a diacritical mark: it is a straight bar  placed above a letter, usually a vowel. Its name derives , since it was originally used to mark long or heavy syllables in Greco-Roman metrics. It now more often marks a long vowel. In the International Phonetic Alphabet, the macron is used to indicate a mid-tone; the sign for a long vowel is instead a modified triangular colon .\n\nThe opposite is the breve , which marks a short or light syllable or a short vowel.\n\nUses\n\nSyllable weight\n\nIn Greco-Roman metrics and in the description of the metrics of other literatures, the macron was introduced and is still widely used to mark a long (heavy) syllable. Even relatively recent classical Greek and Latin dictionariesP.G.W. Glare (ed.), Oxford Latin Dictionary (Oxford at the Clarendon Press 1990), p. xxiii: Vowel quantities. Normally, only long vowels in a metrically indeterminate position are marked. are still concerned with indicating only the length (weight) of syllables; that is why most still do not indicate the length of vowels in syllables that are otherwise metrically determined. Many textbooks about Ancient Rome and Greece use the macron even if it was not actually used at that time.\n\nVowel length\n\nThe following languages or transliteration systems use the macron to mark long vowels:\n\n* Slavicists use the macron to indicate a non-tonic long vowel, or a non-tonic syllabic liquid, such as on l, lj, m, n, nj, and r. Languages with this feature include standard and dialect varieties of Serbo-Croatian, Slovene, and Bulgarian.Годечкият Говор от Михаил Виденов,Издателство на българската академия на науките,София, 1978, p. 19: ...характерни за всички селища от годечкия говор....Подобни случай са характерни и за книжовния език-Ст.Стойков, Увод във фонетиката на българския език , стр. 151.. \n* Transcriptions of Arabic typically use macrons to indicate long vowels –  (alif when pronounced),  (waw, when pronounced or), and  (ya', when pronounced or). Thus the Arabic word  (three) is transliterated ṯalāṯah.\n* Some modern dictionaries and coursebooks of classical Greek and Latin, where the macron is sometimes used in conjunction with the breve. However, many such dictionaries still have ambiguities in their treatment and distinction of long vowels or heavy syllables. In romanization of Greek, the letters η (eta) and ω (omega) are transliterated, respectively, as ē and ō. This corresponds to vowel length, by contrast with the short vowels ε (epsilon) and ο (omicron), which are transliterated as plain e and o. In Latin long vowels may be marked, which at times was done also by the Romans (see apex).\n* The Hepburn romanization system of Japanese, for example, kōtsū (, ) \"traffic\" as opposed to kotsu (, ) \"bone\" or \"knack\".\n* The Syriac language uses macrons to indicate long vowels in its romanized transliteration: ā for /aː/, ē for /eː/, ū for /uː/ and ō for /ɔː/.\n* Baltic languages and Baltic-Finnic languages:\n** Latvian. Ā, ē, ī, ū are separate letters but are given the same position in collation as a, e, i, u respectively. Ō was also used in Latvian, but it was discarded as of 1946.\n** Lithuanian. Ū is a separate letter but is given the same position in collation as the unaccented u. It marks a long vowel; other long vowels are indicated with an ogonek (which used to indicate nasalization, but it no longer does): ą, ę, į, ų and o being always long in Lithuanian except for some recent loanwords. For the long counterpart of i, y is used.\n** Livonian. Ā, ǟ, ē, ī, ō, ȱ, ȭ and ū are separate letters that sort in alphabetical order immediately after a, ä, e, i, o, ȯ, õ and u respectively.\n** Samogitian. Ā, ē, ī, ū and ō are separate letters that sort in alphabetical order immediately after a, e, i, u and o respectively.\n* Transcriptions of Nahuatl, the Aztecs' language, spoken in Mexico. When the Spanish conquistadors arrived, they wrote the language in their own alphabet without distinguishing long vowels. Over a century later, in 1645, Horacio Carochi defined macrons to mark long vowels ā, ē, ī and ō, and short vowels with grave (`) accents. This is rare nowadays since many people write Nahuatl without any orthographic sign and with the letters k, s and w, not present in the original alphabet.\n* Modern transcriptions of Old English.\n* Latin transliteration of Pali and Sanskrit, and in the IAST and ISO 15919 transcriptions of Indo-Aryan and Dravidian languages.\n* Polynesian languages:\n** Cook Islands Māori. In Cook Islands Māori, the macron or mākarōna is not commonly used in writing, but is used in references and teaching materials for those learning the language.Buse, Jasper with Taringa, Raututi (Bruce Biggs and Rangi Moeka‘a, eds.). (1996). Cook Islands Maori Dictionary with English-Cook Islands Maori Finder List. Avarua, Rarotonga: The Ministry of Education, Government of the Cook Islands; The School of Oriental and African Studies, The University of London; The Institute of Pacific Studies, The University of the South Pacific; The Centre for Pacific Studies, The University of Auckland; Pacific Linguistics, The Research School of Pacific and Asian Studies, The Australian National University.Carpentier, Tai Tepuaoterā Turepu and Beaumont, Clive. (1995). Kai kōrero: A Cook Islands Maori Language Coursebook. Auckland, New Zealand: Pasifika Press.\n** Hawaiian. The macron is called kahakō, and it indicates vowel length, which changes meaning and the placement of stress.\n** Māori. In modern written Māori, the macron is used to designate long vowels, with the trema mark sometimes used if the macron is unavailable (e.g. \"Mäori\"). The Māori word for macron is tohutō. The term pōtae (\"hat\") is also used. In the past, writing in Māori either did not distinguish vowel length, or doubled long vowels (e.g. \"Maaori\").\n** Niuean. In Niuean, \"popular spelling\" does not worry too much about vowel quality’ (length), so the macron is primarily used in scholarly study of the language.Sperlich, Wolfgang B. (ed.) (1997). Tohi vagahau Niue – Niue language dictionary: Niuen-English with English-Niuean finderlist. Honolulu: University of Hawaii at Manoa Department of Linguistics.\n** Tahitian. The use of the macron is comparatively recent in Tahitian. The Fare Vānaʻa or Académie Tahitienne (Tahitian Academy) recommends using the macron, called the tārava, to represent long vowels in written text, especially for scientific or teaching textsAcadémie Tahitienne. (1986). Grammaire de la langue tahitienne. Papeete, Tahiti: Fare Vāna’a.Académie Tahitienne. (1999). Dictionnaire tahitien-français: Faʻatoro parau tahiti-farāni. Papeete, Tahiti: Fare Vānaʻa. and it has widespread acceptance.LeMaître, Yves. (1995). Lexique du tahitien contemporain: tahitien-français français-tahitien. Paris: Éditions de l’IRD (ex-Orstom).Montillier, Pierre. (1999). Te reo tahiti ’āpi: Dictionnaire du tahitien nouveau et biblique. Papeete, Tahiti: STP Multipress.Jaussen, Mgr Tepano. (2001). Dictionnaire de la langue Tahitienne (10ème édition, revue et augmentée). Papeete, Tahiti: Société des Études Océaniennes. (In the past, written Tahitian either did not distinguish vowel length, or used multiple other ways).Académie Tahitienne (6 January 2003). [http://www.farevanaa.pf/theme_detail.php?id=5 Graphie et graphies de la langue tahitienne].\n** Tongan and Samoan. The macron is called the toloi/fakamamafa or fa'amamafa, respectively. Its usage is similar to that in Māori, including its substitution by a trema. Its usage is not universal in Samoan, but recent academic publications and advanced study textbooks promote its use.Simanu, Aumua Mata'itusi. 'O si Manu a Ali'i: A Text for the Advanced Study of Samoan Language and Culture\n* Both Cyrillic and Latin transcriptions of Udege.\n* The Latin and Cyrillic alphabet transcriptions of the Tsebari dialect of Tsez.\n\nTone\n\nThe following languages or alphabets use the macron to mark tones:\n\n* In the International Phonetic Alphabet, a macron over a vowel indicates a mid-level tone.\n* In Pinyin, the official Romanization of Mandarin Chinese, macrons over a, e, i, o, u, ü (ā, ē, ī, ō, ū, ǖ) indicate the high level tone of Mandarin Chinese. The alternative to the macron is the number 1 after the syllable (for example, tā = ta1).\n* Similarly in the Yale romanization of Cantonese, macrons over a, e, i, o, u, m, n (ā, ē, ī, ō, ū, m̄, n̄) indicate the high level tone of Cantonese. Like Mandarin, the alternative to the macron is the number 1 after the syllable (for example, tā = ta1).\n* In Pe̍h-ōe-jī romanization of Hokkien, macrons over a, e, i, m, n, o, o͘ , u,  (ā, ē, ī, m̄, n̄, ō, ō͘ , ū) indicate the mid level tone (\"light departing\" or 7th tone) of Hokkien.\n\nOmission\n\nSometimes the macron marks an omitted n or m, like the tilde:\n* In Old English texts a macron above a letter indicates the omission of an m or n that would normally follow that letter.\n* In older handwriting such as the German Kurrentschrift, the macron over an a-e-i-o-u or ä-ö-ü stood for an n, or over an m or an n meant that the letter was doubled. This continued into print in English in the sixteenth century, and to some extent in German. Over a u at the end of a word, the macron indicated um as a form of scribal abbreviation.\n\nLetter extension\n\nThe macron is used in the orthography of a number of vernacular languages of the Solomon Islands and Vanuatu, particularly those first transcribed by Anglican missionaries. The macron has no unique value, and is simply used to distinguish between two different phonemes.\n\nThus, in several languages of the Banks Islands, including Mwotlap, the simple m stands for, but an m with a macron (m̄) is a rounded labial-velar nasal; while the simple n stands for the common alveolar nasal, an n with macron (n̄) represents the velar nasal; the vowel ē stands for a (short) higher by contrast with plain e; likewise ō contrasts with plain o.\n\nIn Hiw orthography, the consonant r̄ stands for the prestopped velar lateral approximant., p.421.\nIn Araki, the same symbol r̄ encodes the alveolar trill – by contrast with r, which encodes the alveolar flap.\n\nIn Bislama (orthography before 1995), Lamenu and Lewo, a macron is used on two letters '.[https://www.research.manchester.ac.uk/portal/files/54584756/FULL_TEXT.PDF] m̄ represents, and p̄ represents. The orthography after 1995 (which has no diacritics) has these written as mw and pw.\n\nIn Kokota, ḡ is used for the velar stop, but g without macron is the voiced velar fricative.Palmer, Bill. [http://www.surrey.ac.uk/lcts/bill.palmer/NWS_site/Kok/PhD/Ch2.pdf A grammar of the Kokota language, Santa Isabel, Solomon Islands]. PhD dissertation.\n\nIn Marshallese, a macron is used on four letters – ' – whose pronunciations differ from the unmarked '.  Marshallese uses a vertical vowel system with three to four vowel phonemes, but traditionally their allophones have been written out, so vowel letters with macron are used for some of these allophones.  Though the standard diacritic involved is a macron, there are no other diacritics used above letters, so in practice other diacritics can and have been used in less polished writing or print, yielding nonstandard letters like ', depending on displayability of letters in computer fonts.\n* The letter ' is pronounced, the palatalized allophone of the phoneme.\n* The letter ' represents the velar nasal phoneme and the labialized velar nasal phoneme, depending on context.  The standard letter does not exist as a precombined glyph in Unicode, so the nonstandard variant ' is often used in its place.\n* The letter ' is pronounced or, which are the unrounded velarized allophones of the phonemes and respectively.\n* The letter ' is pronounced, the unrounded velarized allophone of the phoneme.\n\nOther uses\n\n* In older German and in the German Kurrent handwriting, a macron is used on some consonants, especially n and m, as a short form for a double consonant (for example, n̄ instead of nn).\n* In modernized Hepburn romanization of Japanese, an n with macron represents a syllabic n.\n* In Russian cursive, as well as in some others based on the Cyrillic script (for example, Bulgarian), a lowercase Т looks like a lowercase m, and a macron is often used to distinguish it from Ш, which looks like a lowercase w (see Т). Some writers also underline the letter ш to reduce ambiguity further.\n\nAlso, in some instances, a diacritic will be written like a macron, although it represents another diacritic whose standard form is different:\n\n* In some Finnish, Estonian and Swedish comic books that are hand-lettered, or in handwriting, a macron-style umlaut is used for ä or ö (also õ and ü in Estonian), sometimes known colloquially as a \"lazy man's umlaut\". This can also be seen in some modern handwritten German.\n* In informal Hungarian handwriting, a macron is often a substitute for either a double acute accent or an umlaut (e.g., ö or ő).  Because of this ambiguity, using it is often regarded as bad practice.\n* In informal handwriting, the Spanish ñ is sometimes written with a macron-shaped tilde: (n̄).\n\nMedicine\n\nIn medical prescriptions and other handwritten notes, macrons mean:\n* ā, before, abbreviating Latin ante\n* c̄, with, abbreviating Latin cum\n* p̄, after, abbreviating Latin post \n* q̄, every, abbreviating Latin quisque (and its inflected forms)\n* s̄, without, abbreviating Latin sine\n* x̄, except\n\nMathematics and science\n\nThe overline is a typographical symbol similar to the macron, used in a number of ways in mathematics and science.\n\nMusic\n\nIn music, the tenuto marking resembles the macron.\n\nThe macron is also used in German lute tablature to distinguish repeating alphabetic characters.\n\nTechnical notes\n\nThe Unicode Standard encodes combining and precomposed macron characters:\n\nMacron-related Unicode characters not included in the table above:\n* CJK fullwidth variety:\n** \n* Overlines\n* Characters using a macron below instead of above\n* Tone contour transcription characters incorporating a macron:\n** \n** \n** \n** \n* Two intonation marks historically used by Antanas Baranauskas for Lithuanian dialectology:\n** \n** \n\nIn LaTeX a macron is created with the command \"\\\", for example: M\\\naori for Māori.\nIn OpenOffice, if the extension [http://extensions.openoffice.org/en/project/compose-special-characters Compose Special Characters] is installed, a macron may be added by following the letter with a hyphen and pressing the user’s predefined shortcut key for composing special characters. A macron may also be added by following the letter with the character’s four-digit hex-code, and pressing the user’s predefined shortcut key for adding unicode characters.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Macron (diacritic)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19891" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A macron is a diacritical mark: it is a straight bar  placed above a letter, usually a vowel. Its name derives , since it was originally used to mark long or heavy syllables in Greco-Roman metrics. It now more often marks a long vowel. In the International Phonetic Alphabet, the macron is used to indicate a mid-tone; the sign for a long vowel is instead a modified triangular colon .\n\nThe opposite is the breve , which marks a short or light syllable or a short vowel.\n\nUses\n\nSyllable weight\n\nIn Greco-Roman metrics and in the description of the metrics of other literatures, the macron was introduced and is still widely used to mark a long (heavy) syllable. Even relatively recent classical Greek and Latin dictionariesP.G.W. Glare (ed.), Oxford Latin Dictionary (Oxford at the Clarendon Press 1990), p. xxiii: Vowel quantities. Normally, only long vowels in a metrically indeterminate position are marked. are still concerned with indicating only the length (weight) of syllables; that is why most still do not indicate the length of vowels in syllables that are otherwise metrically determined. Many textbooks about Ancient Rome and Greece use the macron even if it was not actually used at that time.\n\nVowel length\n\nThe following languages or transliteration systems use the macron to mark long vowels:\n\n* Slavicists use the macron to indicate a non-tonic long vowel, or a non-tonic syllabic liquid, such as on l, lj, m, n, nj, and r. Languages with this feature include standard and dialect varieties of Serbo-Croatian, Slovene, and Bulgarian.Годечкият Говор от Михаил Виденов,Издателство на българската академия на науките,София, 1978, p. 19: ...характерни за всички селища от годечкия говор....Подобни случай са характерни и за книжовния език-Ст.Стойков, Увод във фонетиката на българския език , стр. 151.. \n* Transcriptions of Arabic typically use macrons to indicate long vowels –  (alif when pronounced),  (waw, when pronounced or), and  (ya', when pronounced or). Thus the Arabic word  (three) is transliterated ṯalāṯah.\n* Some modern dictionaries and coursebooks of classical Greek and Latin, where the macron is sometimes used in conjunction with the breve. However, many such dictionaries still have ambiguities in their treatment and distinction of long vowels or heavy syllables. In romanization of Greek, the letters η (eta) and ω (omega) are transliterated, respectively, as ē and ō. This corresponds to vowel length, by contrast with the short vowels ε (epsilon) and ο (omicron), which are transliterated as plain e and o. In Latin long vowels may be marked, which at times was done also by the Romans (see apex).\n* The Hepburn romanization system of Japanese, for example, kōtsū (, ) \"traffic\" as opposed to kotsu (, ) \"bone\" or \"knack\".\n* The Syriac language uses macrons to indicate long vowels in its romanized transliteration: ā for /aː/, ē for /eː/, ū for /uː/ and ō for /ɔː/.\n* Baltic languages and Baltic-Finnic languages:\n** Latvian. Ā, ē, ī, ū are separate letters but are given the same position in collation as a, e, i, u respectively. Ō was also used in Latvian, but it was discarded as of 1946.\n** Lithuanian. Ū is a separate letter but is given the same position in collation as the unaccented u. It marks a long vowel; other long vowels are indicated with an ogonek (which used to indicate nasalization, but it no longer does): ą, ę, į, ų and o being always long in Lithuanian except for some recent loanwords. For the long counterpart of i, y is used.\n** Livonian. Ā, ǟ, ē, ī, ō, ȱ, ȭ and ū are separate letters that sort in alphabetical order immediately after a, ä, e, i, o, ȯ, õ and u respectively.\n** Samogitian. Ā, ē, ī, ū and ō are separate letters that sort in alphabetical order immediately after a, e, i, u and o respectively.\n* Transcriptions of Nahuatl, the Aztecs' language, spoken in Mexico. When the Spanish conquistadors arrived, they wrote the language in their own alphabet without distinguishing long vowels. Over a century later, in 1645, Horacio Carochi defined macrons to mark long vowels ā, ē, ī and ō, and short vowels with grave (`) accents. This is rare nowadays since many people write Nahuatl without any orthographic sign and with the letters k, s and w, not present in the original alphabet.\n* Modern transcriptions of Old English.\n* Latin transliteration of Pali and Sanskrit, and in the IAST and ISO 15919 transcriptions of Indo-Aryan and Dravidian languages.\n* Polynesian languages:\n** Cook Islands Māori. In Cook Islands Māori, the macron or mākarōna is not commonly used in writing, but is used in references and teaching materials for those learning the language.Buse, Jasper with Taringa, Raututi (Bruce Biggs and Rangi Moeka‘a, eds.). (1996). Cook Islands Maori Dictionary with English-Cook Islands Maori Finder List. Avarua, Rarotonga: The Ministry of Education, Government of the Cook Islands; The School of Oriental and African Studies, The University of London; The Institute of Pacific Studies, The University of the South Pacific; The Centre for Pacific Studies, The University of Auckland; Pacific Linguistics, The Research School of Pacific and Asian Studies, The Australian National University.Carpentier, Tai Tepuaoterā Turepu and Beaumont, Clive. (1995). Kai kōrero: A Cook Islands Maori Language Coursebook. Auckland, New Zealand: Pasifika Press.\n** Hawaiian. The macron is called kahakō, and it indicates vowel length, which changes meaning and the placement of stress.\n** Māori. In modern written Māori, the macron is used to designate long vowels, with the trema mark sometimes used if the macron is unavailable (e.g. \"Mäori\"). The Māori word for macron is tohutō. The term pōtae (\"hat\") is also used. In the past, writing in Māori either did not distinguish vowel length, or doubled long vowels (e.g. \"Maaori\").\n** Niuean. In Niuean, \"popular spelling\" does not worry too much about vowel quality’ (length), so the macron is primarily used in scholarly study of the language.Sperlich, Wolfgang B. (ed.) (1997). Tohi vagahau Niue – Niue language dictionary: Niuen-English with English-Niuean finderlist. Honolulu: University of Hawaii at Manoa Department of Linguistics.\n** Tahitian. The use of the macron is comparatively recent in Tahitian. The Fare Vānaʻa or Académie Tahitienne (Tahitian Academy) recommends using the macron, called the tārava, to represent long vowels in written text, especially for scientific or teaching textsAcadémie Tahitienne. (1986). Grammaire de la langue tahitienne. Papeete, Tahiti: Fare Vāna’a.Académie Tahitienne. (1999). Dictionnaire tahitien-français: Faʻatoro parau tahiti-farāni. Papeete, Tahiti: Fare Vānaʻa. and it has widespread acceptance.LeMaître, Yves. (1995). Lexique du tahitien contemporain: tahitien-français français-tahitien. Paris: Éditions de l’IRD (ex-Orstom).Montillier, Pierre. (1999). Te reo tahiti ’āpi: Dictionnaire du tahitien nouveau et biblique. Papeete, Tahiti: STP Multipress.Jaussen, Mgr Tepano. (2001). Dictionnaire de la langue Tahitienne (10ème édition, revue et augmentée). Papeete, Tahiti: Société des Études Océaniennes. (In the past, written Tahitian either did not distinguish vowel length, or used multiple other ways).Académie Tahitienne (6 January 2003). [http://www.farevanaa.pf/theme_detail.php?id=5 Graphie et graphies de la langue tahitienne].\n** Tongan and Samoan. The macron is called the toloi/fakamamafa or fa'amamafa, respectively. Its usage is similar to that in Māori, including its substitution by a trema. Its usage is not universal in Samoan, but recent academic publications and advanced study textbooks promote its use.Simanu, Aumua Mata'itusi. 'O si Manu a Ali'i: A Text for the Advanced Study of Samoan Language and Culture\n* Both Cyrillic and Latin transcriptions of Udege.\n* The Latin and Cyrillic alphabet transcriptions of the Tsebari dialect of Tsez.\n\nTone\n\nThe following languages or alphabets use the macron to mark tones:\n\n* In the International Phonetic Alphabet, a macron over a vowel indicates a mid-level tone.\n* In Pinyin, the official Romanization of Mandarin Chinese, macrons over a, e, i, o, u, ü (ā, ē, ī, ō, ū, ǖ) indicate the high level tone of Mandarin Chinese. The alternative to the macron is the number 1 after the syllable (for example, tā = ta1).\n* Similarly in the Yale romanization of Cantonese, macrons over a, e, i, o, u, m, n (ā, ē, ī, ō, ū, m̄, n̄) indicate the high level tone of Cantonese. Like Mandarin, the alternative to the macron is the number 1 after the syllable (for example, tā = ta1).\n* In Pe̍h-ōe-jī romanization of Hokkien, macrons over a, e, i, m, n, o, o͘ , u,  (ā, ē, ī, m̄, n̄, ō, ō͘ , ū) indicate the mid level tone (\"light departing\" or 7th tone) of Hokkien.\n\nOmission\n\nSometimes the macron marks an omitted n or m, like the tilde:\n* In Old English texts a macron above a letter indicates the omission of an m or n that would normally follow that letter.\n* In older handwriting such as the German Kurrentschrift, the macron over an a-e-i-o-u or ä-ö-ü stood for an n, or over an m or an n meant that the letter was doubled. This continued into print in English in the sixteenth century, and to some extent in German. Over a u at the end of a word, the macron indicated um as a form of scribal abbreviation.\n\nLetter extension\n\nThe macron is used in the orthography of a number of vernacular languages of the Solomon Islands and Vanuatu, particularly those first transcribed by Anglican missionaries. The macron has no unique value, and is simply used to distinguish between two different phonemes.\n\nThus, in several languages of the Banks Islands, including Mwotlap, the simple m stands for, but an m with a macron (m̄) is a rounded labial-velar nasal; while the simple n stands for the common alveolar nasal, an n with macron (n̄) represents the velar nasal; the vowel ē stands for a (short) higher by contrast with plain e; likewise ō contrasts with plain o.\n\nIn Hiw orthography, the consonant r̄ stands for the prestopped velar lateral approximant., p.421.\nIn Araki, the same symbol r̄ encodes the alveolar trill – by contrast with r, which encodes the alveolar flap.\n\nIn Bislama (orthography before 1995), Lamenu and Lewo, a macron is used on two letters '.[https://www.research.manchester.ac.uk/portal/files/54584756/FULL_TEXT.PDF] m̄ represents, and p̄ represents. The orthography after 1995 (which has no diacritics) has these written as mw and pw.\n\nIn Kokota, ḡ is used for the velar stop, but g without macron is the voiced velar fricative.Palmer, Bill. [http://www.surrey.ac.uk/lcts/bill.palmer/NWS_site/Kok/PhD/Ch2.pdf A grammar of the Kokota language, Santa Isabel, Solomon Islands]. PhD dissertation.\n\nIn Marshallese, a macron is used on four letters – ' – whose pronunciations differ from the unmarked '.  Marshallese uses a vertical vowel system with three to four vowel phonemes, but traditionally their allophones have been written out, so vowel letters with macron are used for some of these allophones.  Though the standard diacritic involved is a macron, there are no other diacritics used above letters, so in practice other diacritics can and have been used in less polished writing or print, yielding nonstandard letters like ', depending on displayability of letters in computer fonts.\n* The letter ' is pronounced, the palatalized allophone of the phoneme.\n* The letter ' represents the velar nasal phoneme and the labialized velar nasal phoneme, depending on context.  The standard letter does not exist as a precombined glyph in Unicode, so the nonstandard variant ' is often used in its place.\n* The letter ' is pronounced or, which are the unrounded velarized allophones of the phonemes and respectively.\n* The letter ' is pronounced, the unrounded velarized allophone of the phoneme.\n\nOther uses\n\n* In older German and in the German Kurrent handwriting, a macron is used on some consonants, especially n and m, as a short form for a double consonant (for example, n̄ instead of nn).\n* In modernized Hepburn romanization of Japanese, an n with macron represents a syllabic n.\n* In Russian cursive, as well as in some others based on the Cyrillic script (for example, Bulgarian), a lowercase Т looks like a lowercase m, and a macron is often used to distinguish it from Ш, which looks like a lowercase w (see Т). Some writers also underline the letter ш to reduce ambiguity further.\n\nAlso, in some instances, a diacritic will be written like a macron, although it represents another diacritic whose standard form is different:\n\n* In some Finnish, Estonian and Swedish comic books that are hand-lettered, or in handwriting, a macron-style umlaut is used for ä or ö (also õ and ü in Estonian), sometimes known colloquially as a \"lazy man's umlaut\". This can also be seen in some modern handwritten German.\n* In informal Hungarian handwriting, a macron is often a substitute for either a double acute accent or an umlaut (e.g., ö or ő).  Because of this ambiguity, using it is often regarded as bad practice.\n* In informal handwriting, the Spanish ñ is sometimes written with a macron-shaped tilde: (n̄).\n\nMedicine\n\nIn medical prescriptions and other handwritten notes, macrons mean:\n* ā, before, abbreviating Latin ante\n* c̄, with, abbreviating Latin cum\n* p̄, after, abbreviating Latin post \n* q̄, every, abbreviating Latin quisque (and its inflected forms)\n* s̄, without, abbreviating Latin sine\n* x̄, except\n\nMathematics and science\n\nThe overline is a typographical symbol similar to the macron, used in a number of ways in mathematics and science.\n\nMusic\n\nIn music, the tenuto marking resembles the macron.\n\nThe macron is also used in German lute tablature to distinguish repeating alphabetic characters.\n\nTechnical notes\n\nThe Unicode Standard encodes combining and precomposed macron characters:\n\nMacron-related Unicode characters not included in the table above:\n* CJK fullwidth variety:\n** \n* Overlines\n* Characters using a macron below instead of above\n* Tone contour transcription characters incorporating a macron:\n** \n** \n** \n** \n* Two intonation marks historically used by Antanas Baranauskas for Lithuanian dialectology:\n** \n** \n\nIn LaTeX a macron is created with the command \"\\\", for example: M\\\naori for Māori.\nIn OpenOffice, if the extension [http://extensions.openoffice.org/en/project/compose-special-characters Compose Special Characters] is installed, a macron may be added by following the letter with a hyphen and pressing the user’s predefined shortcut key for composing special characters. A macron may also be added by following the letter with the character’s four-digit hex-code, and pressing the user’s predefined shortcut key for adding unicode characters. Macron (diacritic). http://en.wikipedia.org/?curid=19891."
  }
}
