{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=984",
  "eid" : "a8c71af0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778362911,
  "textBody" : "Dame Agatha Mary Clarissa Christie, Lady Mallowan, DBE (née Miller; 15 September 1890 – 12 January 1976) was an English writer. She is known for her 66 detective novels and 14 short story collections, particularly those revolving around her fictional detectives Hercule Poirot and Miss Marple. Christie also wrote the world's longest-running play, a murder mystery, The Mousetrap, and six romances under the name Mary Westmacott. In 1971 she was elevated to Dame Commander of the Order of the British Empire (DBE) for her contribution to literature.\n\nChristie was born into a wealthy upper-middle-class family in Torquay, Devon. She served in a Devon hospital during the First World War, tending to troops coming back from the trenches, before marrying and starting a family in London. She was initially an unsuccessful writer with six rejections, but this changed when The Mysterious Affair at Styles, featuring Hercule Poirot, was published in 1920. During the Second World War she worked as a pharmacy assistant at University College Hospital, London, during the Blitz and acquired a good knowledge of poisons which featured in many of her subsequent novels.\n\nGuinness World Records lists Christie as the best-selling novelist of all time. Her novels have sold roughly 2 billion copies, and her estate claims that her works come third in the rankings of the world's most-widely published books, behind only Shakespeare's works and the Bible. According to Index Translationum, she remains the most-translated individual author – having been translated into at least 103 languages. And Then There Were None is Christie's best-selling novel, with 100 million sales to date, making it the world's best-selling mystery ever, and one of the best-selling books of all time. \nChristie's stage play The Mousetrap holds the world record for longest initial run.\n\nIt opened at the Ambassadors Theatre in the West End on 25 November 1952, and  is still running after more than 25,000 performances.[https://www.the-mousetrap.co.uk/Online The Mousetrap website], the-mousetrap.co.uk; accessed 2 June 2015.\n\nIn 1955, Christie was the first recipient of the Mystery Writers of America's highest honour, the Grand Master Award. Later the same year, Witness for the Prosecution received an Edgar Award by the MWA for Best Play.\nIn 2013, The Murder of Roger Ackroyd was voted the best crime novel ever by 600 fellow writers of the Crime Writers' Association. \n\nOn 15 September 2015, coinciding with her 125th birthday, And Then There Were None was named the \"World's Favourite Christie\" in a vote sponsored by the author's estate. Most of her books and short stories have been adapted for television, radio, video games and comics, and more than thirty feature films have been based on her work.\n\nLife and career\n\nChildhood and adolescence: 1890–1910\n\nAgatha Mary Clarissa Miller was born on 15 September 1890, into a wealthy upper middle-class family in Ashfield, Torquay, Devon. Her mother, Clara (Boehmer), was an Englishwoman who was born in Belfast in 1854 to Captain Frederick Boehmer and Mary Ann West, the couple's only daughter. Clara Boehmer had four brothers, one of whom died young. Captain Boehmer was killed in a riding accident while stationed on Jersey in April 1863, leaving Mary Ann (Christie's grandmother) to raise her children alone on a meagre income. Mary Ann's sister Margaret West had married a wealthy American, Nathaniel Frary Miller, in 1863, and the couple lived in Prinsted, West Sussex. Margaret had no children of her own, and so the two sisters arranged that Clara should be raised by her aunt and uncle. It was here she met her future husband, an American stockbroker named Frederick Alvah Miller, who was the son of Nathaniel's first marriage.\n\nA member of the American upper class, Frederick had been sent to Switzerland for his education. He was considered personable and friendly by those who knew him. He soon developed a romantic relationship with Clara, and they were married in April 1878. Their first child, Margaret Frary Miller (1879–1950), was born in Torquay, where the couple were renting lodgings, while their second, Louis \"Monty\" Montant (1880–1929), was born in the U.S. state of New York, where Frederick was on a business trip. When Frederick's father Nathaniel died, he left Clara £2000 in her own right; she used this money to purchase a villa in Torquay named \"Ashfield\" in which to raise her family. It was here that her third and final child, Agatha, was born.\n\nChristie described her childhood as \"very happy\". She was surrounded by a series of strong and independent women from an early age. Her time was spent alternating between her home in Devon, her step-grandmother and aunt's house in Ealing, West London, and parts of Southern Europe, where her family would holiday during the winter. \n\nAgatha was raised in a household with various esoteric beliefs and, like her siblings, believed that her mother Clara was a psychic with the ability of second sight. Agatha's sister Margaret had been sent to Roedean in Sussex for her education, but their mother insisted that Agatha receive a home education, and so her parents were responsible for teaching her to read and write and to be able to perform basic arithmetic, a subject that she particularly enjoyed. They also taught her about music, and she learned to play both the piano and the mandolin. According to biographer Laura Thomson, Clara believed that Agatha should not learn to read till she was eight. However, due to her curiosity, Agatha taught herself to read much earlier. One of the earliest known photographs of Christie (now a part of the Christie family's heirlooms) depicts her as a little girl with her first dog, whom she called George Washington.\n\nChristie was a voracious reader from an early age. Among her earliest memories were those of reading the children's books written by Mrs Molesworth, including The Adventures of Herr Baby (1881), Christmas Tree Land (1897), and The Magic Nuts (1898). She also read the work of Edith Nesbit, including The Story of the Treasure Seekers (1899), The Phoenix and the Carpet (1903), and The Railway Children (1906). When a little older, she moved on to reading the surreal verse of Edward Lear and Lewis Carroll. In April 1901, at age 10, she wrote her first poem, \"The cowslip\".\n\nShe spent much of her childhood apart from other children, although she devoted much time to her pets, whom she adored. She eventually made friends with a group of other girls in Torquay, and she noted that \"one of the highlights of my existence\" was her appearance with them in a youth production of Gilbert and Sullivan's The Yeomen of the Guard, in which she played the hero, Colonel Fairfax. This was her last operatic role for, as she later wrote, \"an experience that you really enjoyed should never be repeated.\"\n\nHer father was often ill, suffering from a series of heart attacks, and he died in November 1901, aged 55. His death left the family devastated and in an uncertain economic situation. Clara and Agatha continued to live together in their Torquay home, Madge had moved to Abney Hall in Cheadle, Cheshire, with her new husband, and Monty had joined the army and been sent to South Africa to fight in the Boer War. Agatha later claimed that her father's death, occurring when she was eleven years old, marked the end of her childhood. In 1902, Agatha was sent to receive a formal education at Miss Guyer's Girls School in Torquay, but found it difficult to adjust to the disciplined atmosphere. In 1905, she was sent to Paris where she was educated in three pensions – Mademoiselle Cabernet's, Les Marroniers, and then Miss Dryden's – the last of which served primarily as a finishing school.\n\nEarly literary attempts and the First World War: 1910–19\n\nAgatha returned to England in 1910 and found that her mother Clara was ill. They decided to spend time together in the warmer climate of Cairo, then a regular tourist destination for wealthy Britons; they stayed for three months at the Gezirah Palace Hotel. Agatha, always chaperoned by her mother, attended many social functions in search of a husband. She visited ancient Egyptian monuments such as the Great Pyramid of Giza, but did not exhibit the great interest in archaeology and Egyptology that became prominent in her later years.,\nReturning to Britain, she continued her social activities, writing and performing in amateur theatricals. She also helped put on a play called The BlueBeard of Unhappiness with female friends. Her writing extended to both poetry and music. Some early works saw publication, but she decided against focusing on either of these as future professions.\n\nChristie wrote her first short story, The House of Beauty (an early version of her later-published story The House of Dreams[http://www.agathachristie.com/christies-work/stories/the-house-of-dreams/377 The House of Dreams: Details], agathachristie.com; accessed 7 August 2015.), while recovering in bed from an undisclosed illness. This was about 6,000 words on the topic of \"madness and dreams\", a subject of fascination for her. Biographer Janet Morgan commented that, despite \"infelicities of style\", the story was nevertheless \"compelling\".\n\nOther stories followed, most of them illustrating her interest in spiritualism and the paranormal. These included \"The Call of Wings\" and \"The Little Lonely God\". Magazines rejected all her early submissions, made under pseudonyms, although some were revised and published later, often with new titles.\n\nChristie then set her first novel, Snow Upon the Desert, in Cairo, and drew from her recent experiences in that city, written under the pseudonym Monosyllaba. She was perturbed when various publishers all declined. Clara suggested that her daughter ask for advice from a family friend and neighbour, writer Eden Philpotts, who obliged her enquiry, encouraged her writing, and sent her an introduction to his own literary agent, Hughes Massie, who rejected Snow Upon the Desert, and suggested a second novel.\n\nChristie continued searching for a husband, and entered into short-lived relationships with four separate men and an engagement with another. She then met Archibald Christie (1889–1962) at a dance given by Lord and Lady Clifford at Ugbrooke, about 12 mi from Torquay. Archie was born in India, the son of a judge in the Indian Civil Service. He was an army officer who was seconded to the Royal Flying Corps in April 1913. The couple quickly fell in love. Upon learning that he would be stationed in Farnborough, Archie proposed marriage, and Agatha accepted.\n\nWith the outbreak of World War I in August 1914, Archie was sent to France to fight the German forces. They married on the afternoon of Christmas Eve 1914 at Emmanuel Church, Clifton, Bristol, which was close to the home of his parents, while Archie was on home leave. Rising through the ranks, he was eventually stationed back to Britain in September 1918 as a colonel in the Air Ministry.\n\nAgatha involved herself in the war effort. She joined the Voluntary Aid Detachment (VAD) in 1914, and attended to wounded soldiers at a hospital in Torquay as an unpaid VAD nurse. Responsible for aiding the doctors and maintaining morale, she performed 3,400 hours of unpaid work between October 1914 and December 1916. After qualifying as an \"apothecaries' assistant\" (or dispenser) in 1917 and working as a dispenser, she earned £16 a year until the end of her service in September 1918. After the war, Agatha and Archie Christie settled into a flat at 5 Northwick Terrace in St. John's Wood, northwest London.\n\nFirst novels and Poirot: 1919–23\n\nChristie had long been a fan of detective novels, having enjoyed  Wilkie Collins's The Woman in White and The Moonstone, as well as Sir Arthur Conan Doyle's early Sherlock Holmes stories. She wrote her own detective novel, The Mysterious Affair at Styles, featuring Hercule Poirot, a former Belgian police officer noted for his twirly large \"magnificent moustaches\" and egg-shaped head. Poirot had taken refuge in Britain after Germany invaded Belgium. Christie's inspiration for the character stemmed from real Belgian refugees who were living in Torquay and the Belgian soldiers whom she helped treat as a volunteer nurse in Torquay during the First World War.\n\nAgatha began working on The Mysterious Affair at Styles in 1916, writing most of it at Dartmoor. Her original  manuscript was rejected by such publishing companies as Hodder and Stoughton and Methuen. After keeping the submission for several months, John Lane at The Bodley Head offered to accept it, provided that Christie change the ending. She did so, and signed a contract which she later felt was exploitative. It was finally published in 1920. \n\nChristie, meanwhile, settled into married life, giving birth to her only child, daughter Rosalind Margaret Hicks, in August 1919 at Ashfield, where the couple spent much of their time, having few friends in London. Archie left the Air Force at the end of the war and started working in the City financial sector at a relatively low salary, though they still employed a maid.\n\nChristie's second novel, The Secret Adversary (1922), featured a new detective couple Tommy and Tuppence, again published by The Bodley Head. It earned her £50. A third novel again featured Poirot, Murder on the Links (1923), as did short stories commissioned by Bruce Ingram, editor of The Sketch magazine. In order to tour the world promoting the British Empire Exhibition, the couple left their daughter Rosalind with Agatha's mother and sister. They travelled to South Africa, Australia, New Zealand, and Hawaii.  They learned to surf prone in South Africa; then, in Waikiki, they were among the first Britons to surf standing up.\n\nDisappearance\n\nIn late 1926, Archie asked Agatha for a divorce. He was in love with Nancy Neele, who had been a friend of Major Belcher, director of the British Empire Mission, on the promotional tour a few years earlier. On 3 December 1926, the Christies quarrelled, and Archie left their house, Styles, in Sunningdale, Berkshire, to spend the weekend with his mistress at Godalming, Surrey. That same evening, around 9:45 pm, Christie disappeared from her home, leaving behind a letter for her secretary saying that she was going to Yorkshire. Her car, a Morris Cowley, was later found at Newlands Corner, perched above a chalk quarry, with an expired driving licence and clothes.\n\nHer disappearance caused an outcry from the public. The Home Secretary, William Joynson-Hicks, pressured police, and a newspaper offered a £100 reward. Over a thousand police officers, 15,000 volunteers, and several aeroplanes scoured the rural landscape. Sir Arthur Conan Doyle even gave a spirit medium one of Christie's gloves to find the missing woman. Dorothy L. Sayers visited the house in Surrey, later using the scenario in her book Unnatural Death.\n\nChristie's disappearance was featured on the front page of The New York Times. Despite the extensive manhunt, she was not found for 10 days. On 14 December 1926, she was found at the Swan Hydropathic Hotel (now the Old Swan Hotel) in Harrogate, Yorkshire, registered as Mrs Teresa Neele (the surname of her husband's lover) from Cape Town.\n\nChristie's autobiography makes no reference to her disappearance. Two doctors diagnosed her as suffering from amnesia (see fugue state), yet opinion remains divided as to why she disappeared. Biographer Laura Thompson suggested that Christie let this out in the six novels that she wrote between 1930 and 1956 under the nom de plume Mary Westmacott, in a style quite different from her regular detective stories. She was known to be in a depressed state from literary overwork, her mother's death earlier that year, and her husband's infidelity. Public reaction at the time was largely negative, supposing a publicity stunt or an attempt to frame her husband for murder.\n\nThe 1979 Michael Apted film Agatha features a disclaimer in the opening credits stating that what follows is an imaginary solution to an authentic mystery. The film starred Vanessa Redgrave and Timothy Dalton as Agatha and Archie, and depicts Christie planning suicide in such a way as to frame her husband's mistress for her \"murder\". An American reporter, played by Dustin Hoffman, follows her closely and stops the plan. Christie's heirs unsuccessfully sued to prevent the film's distribution.\n\nAuthor Jared Cade interviewed numerous witnesses and relatives for his sympathetic biography Agatha Christie and the Eleven Missing Days, revised 2011. He provided substantial evidence to suggest that she planned the event to embarrass her husband, never anticipating the resulting escalated melodrama.\n\nThe Christies divorced in 1928, and Archie married Nancy Neele. Agatha retained custody of daughter Rosalind and the Christie name for her writing. During their marriage, she published six novels, a collection of short stories, and a number of short stories in magazines. \n\nSecond marriage and later life\n\nIn 1928, Christie left England for Istanbul and subsequently for Baghdad on the Orient Express. During this trip, she encountered her first archaeological dig and met a young archaeologist, Max Mallowan, whom she married in September 1930. Their marriage was happy and lasted until Christie's death in 1976. In a 1977 interview, Mallowan recounted his first meeting with Christie, when he took her and a group of tourists on a tour of his expedition site in Iraq.\n\nChristie frequently used settings that were familiar to her for her stories. She often accompanied Mallowan on his archaeological expeditions, and her travels with him contributed background to several of her novels set in the Middle East. Other novels (such as And Then There Were None) were set in and around Torquay, where she was raised. Christie's 1934 novel Murder on the Orient Express was written in the Pera Palace Hotel in Istanbul, Turkey, the southern terminus of the railway. The hotel maintains Christie's room as a memorial to the author. \n\nThe Greenway Estate in Devon, acquired by the couple as a summer residence in 1938, is now in the care of the National Trust. Christie often stayed at Abney Hall, Cheshire, owned by her brother-in-law, James Watts, basing at least two stories there: a short story \"The Adventure of the Christmas Pudding\" in the story collection of the same name, and the novel After the Funeral. \"Abney became Agatha's greatest inspiration for country-house life, with all its servants and grandeur being woven into her plots. The descriptions of the fictional Chimneys, Stoneygates, and other houses in her stories are mostly Abney in various forms.\"\n\nDuring the Second World War, Christie worked in the pharmacy at University College Hospital, London, where she acquired a knowledge of poisons that she put to good use in her post-war crime novels. For example, the use of thallium as a poison was suggested to her by UCH Chief Pharmacist Harold Davis (later appointed Chief Pharmacist at the UK Ministry of Health), and in The Pale Horse, published in 1961, she employed it to dispatch a series of victims, the first clue to the murder method coming from the victims' loss of hair. So accurate was her description of thallium poisoning that on at least one occasion it helped solve a case that was baffling doctors.John Emsley, [https://www.independent.co.uk/news/science/the-poison-prescribed-by-agatha-christie-thanks-to-the-mystery-writer-the-deadly-properties-of-thallium-sulphate-have-become-common-knowledge-corrected-1534450.html \"The poison prescribed by Agatha Christie\"], The Independent, 20 July 1992.\n\nChristie lived in Chelsea, first in Cresswell Place and later in Sheffield Terrace. Both properties are now marked by blue plaques. In 1934, she and Max Mallowan purchased Winterbrook House in Winterbrook, a hamlet adjoining the small market town of Wallingford, then within the bounds of Cholsey and in Berkshire.[http://www.oxfordshireblueplaques.org.uk/plaques/christie.html Oxfordshire Blue Plaques], oxfordshireblueplaques.org.uk; accessed 21 September 2015. \n\nThis was their main residence for the rest of their lives and the place where Christie did most of her writing. This house, too, bears a blue plaque. Christie led a quiet life despite being known in the town of Wallingford, where she was for many years President of the local amateur dramatic society.\n\nAround 1941–42, the British intelligence agency MI5 investigated Christie after a character called Major Bletchley appeared in her 1941 thriller N or M?, which was about a hunt for a pair of deadly fifth columnists in wartime England. MI5 was afraid that Christie had a spy in Britain's top-secret codebreaking centre, Bletchley Park. The agency's fears were allayed when Christie told friend (and codebreaker) Dilly Knox, \"I was stuck there on my way by train from Oxford to London and took revenge by giving the name to one of my least lovable characters.\"\n\nTo honour her many literary works, she was appointed Commander of the Order of the British Empire (CBE) in the 1956 New Year Honours. The next year, she became the President of the Detection Club. In the 1971 New Year Honours, she was promoted to Dame Commander of the Order of the British Empire (DBE). three years after her husband had been knighted for his archaeological work in 1968. They were one of the few married couples where both partners were honoured in their own right. From 1968, owing to her husband's knighthood, Christie could also be styled Lady Mallowan.\n\nFrom 1971-74, Christie's health began to fail, although she continued to write. Recently, using experimental tools of textual analysis, Canadian researchers have suggested that Christie may have begun to suffer from Alzheimer's disease or other dementia.\n\nDeath\n\nDame Agatha Christie died on 12 January 1976 at age 85 from natural causes at her home in Winterbrook, Cholsey, Oxfordshire. She is buried in the nearby churchyard of St Mary's, Cholsey, having chosen the plot for their final resting place with her husband Sir Max some ten years before she died. The simple funeral service was attended by about 20 newspaper and TV reporters, some having travelled from as far away as South America. Thirty wreaths adorned Dame Agatha's grave, including one from the cast of her long-running play The Mousetrap and one sent 'on behalf of the multitude of grateful readers' by the Ulverscroft Large Print Book Publishers.Marilyn Yurdan – Oxfordshire Graves and Gravestones. The History Press 2010\n\nShe was survived by her only child, Rosalind Hicks, and only grandson, Mathew Prichard. Her husband, Max, died in 1978, aged 74.\n\nAgatha Christie's estate and subsequent ownership of works\n\nChristie had set up a private company, Agatha Christie Limited, to hold the rights to her works, and around 1959 she had transferred her 278-acre home, Greenway Estate, to her daughter Rosalind.[http://www.telegraph.co.uk/news/obituaries/1476488/Rosalind-Hicks.html Obituary: Rosalind Hicks], telegraph.co.uk, 13 November 2004; accessed 25 January 2015. In 1968, when Christie was almost 80 years old, she sold a 51% stake in Agatha Christie Limited (and therefore the works it owned) to Booker Books (better known as Booker Author's Division), a subsidiary of the British food and transport conglomerate Booker-McConnell (now Booker Group), the founder of the Booker Prize for literature, which later increased its stake to 64%. Agatha Christie Limited remains the owner of the worldwide rights for over 80 of Christie's novels and short stories, 19 plays, and nearly 40 TV films.\n\nAfter Christie's death in 1976, her remaining 36% share of the company was inherited by her daughter, Rosalind Hicks, who passionately preserved her mother's works, image, and legacy until her own death 28 years later. The family's share of the company allowed them to appoint 50% of the board and the chairman, and thereby to retain a veto over new treatments, updated versions, and republications of her works.[http://www.thefreelibrary.com/Agatha+Christie+begins+new+chapter+after+pounds+10m+selff.-a060775079 Agatha Christie begins new chapter after £10m selloff], TheFreeLibrary.com, 4 June 1998.\n\nIn 1993, Hicks founded the Agatha Christie Society and became its first president. In 2004 her obituary in The Telegraph commented that Hicks had been \"determined to remain true to her mother's vision and to protect the integrity of her creations\" and disapproved of \"merchandising\" activities. Upon Hicks's death on 28 October 2004, both the Society and the Greenway Estate passed to Christie's grandson, Mathew Prichard.  After his parents' deaths, Prichard donated Greenway and its contents to the National Trust. The Society is now chaired and managed by Agatha Christie’s great-grandson James Prichard.The Agatha Christie Society. Online. Access 2017-10-22. [http://agathachristiesociety.com/ web site].\n\nChristie's family and family trusts, including James Prichard, continue to own the remaining 36% stake in Agatha Christie Limited,[https://www.theguardian.com/media/2012/feb/29/acorn-media-bys-stake-agatha-christie Acorn Media buys stake in Agatha Christie estate], The Guardian, 29 December 2012. and remain associated with the company. James Prichard became the company's chairman in October 2015James Prichard, LinkedIn [https://uk.linkedin.com/in/james-prichard-b33b707 web site]. The development of Christie's work continues apace.Agatha Christie: Why we still love her 'cosy crime' novels. The Independent, 2017-9-14. [Online. https://www.independent.co.uk/news/long_reads/agatha-christie-cosy-crime-novels-murder-mystery-writer-why-we-love-a7942901.html Online]. Mathew Prichard in his own right holds the copyright to some of his grandmother's later literary works (including The Mousetrap).Thompson, Laura. Agatha Christie, An English Mystery (p. 473). Headline, 2007; \n\nIn 1998, Booker sold a number of its non-food assets to focus on its core business. As part of that, its shares in Agatha Christie Limited (at the time earning £2.1m annual revenue) were sold for £10m to Chorion, a major international media company whose portfolio of well-known authors' works also included the literary estates of Enid Blyton and Dennis Wheatley. In February 2012, some years after a management buyout, Chorion found itself in financial difficulties, and began to sell off its literary assets on the market. The process included the sale of Chorion's 64% stake in Agatha Christie Limited to Acorn Media U.K. In 2014, RLJ Entertainment Inc. acquired Acorn Media U.K., renamed it Acorn Media Enterprises, and incorporated it as the RLJE UK development arm.RLJ Entertainment Inc. web site [http://www.rljentertainment.com/ RLJE web site] RLJ Entertainment Inc. was founded by American entrepreneur Robert L. Johnson.\n \n, media reports stated that the BBC had acquired exclusive TV rights to Christie's works in the UK (previously associated with ITV) and plans with Acorn's co-operation to air new productions for the 125th anniversary of Christie's birth in 2015.[http://www.radiotimes.com/news/2014-02-28/david-walliams-heralds-new-era-for-bbc-as-the-new-home-of-agatha-christie-adaptations \"New era for BBC as the new home of Agatha Christie adaptations\"], radiotimes.com, 28 February 2014; accessed 25 January 2015. The BBC broadcast Partners In Crime and And Then There Were None in 2015 as part of the deal. Subsequent productions have included The Witness for the Prosecution but plans to televise Ordeal by Innocence at Christmas 2017 had to be delayed due to controversy surrounding one of the cast members.\n\nWritings\n\nWorks of fiction\n\nHercule Poirot and Miss Marple\n\nChristie's first book, The Mysterious Affair at Styles, was published in 1920 and introduced the detective Hercule Poirot, who became a long-running character in Christie's works, appearing in 33 novels and 54 short stories.\n\nMiss Jane Marple, introduced in the short-story collection The Thirteen Problems in 1927, was based on Christie's grandmother and her \"Ealing cronies\". Both Jane and Gran \"always expected the worst of everyone and everything, and were, with almost frightening accuracy, usually proved right.\" Marple appeared in 12 novels and 20 stories.\n\nDuring the Second World War, Christie wrote two novels, Curtain and Sleeping Murder, intended as the last cases of these two great detectives, Hercule Poirot and Miss Marple. Both books were sealed in a bank vault for over thirty years and were released for publication by Christie only at the end of her life, when she realised that she could not write any more novels. These publications came on the heels of the success of the film version of Murder on the Orient Express in 1974.\n\nChristie became increasingly tired of Poirot, much as Sir Arthur Conan Doyle had grown weary of his character Sherlock Holmes. By the end of the 1930s, Christie wrote in her diary that she was finding Poirot \"insufferable\", and by the 1960s she felt that he was \"an egocentric creep\".\n\nHowever, unlike Conan Doyle, Christie resisted the temptation to kill her detective off while he was still popular. She saw herself as an entertainer whose job was to produce what the public liked, and the public liked Poirot.\n\nShe did marry off Poirot's companion Captain Hastings in an attempt to trim her cast commitments. In contrast, Christie was fond of Miss Marple. However, the Belgian detective's titles outnumber the Marple titles more than two to one. This is largely because Christie wrote numerous Poirot novels early in her career, while The Murder at the Vicarage remained the sole Marple novel until the 1940s. Christie never wrote a novel or short story featuring both Poirot and Miss Marple. In a recording discovered and released in 2008, Christie revealed the reason for this: \"Hercule Poirot, a complete egoist, would not like being taught his business or having suggestions made to him by an elderly spinster lady. Hercule Poirot - a professional sleuth - would not be at home at all in Miss Marple's world.\".\n\nPoirot is the only fictional character to date to be given an obituary in The New York Times, following the publication of Curtain. It appeared on the front page of the paper on 6 August 1975.\n\nFollowing the great success of Curtain, Christie gave permission for the release of Sleeping Murder sometime in 1976 but died in January 1976 before the book could be released. This may explain some of the inconsistencies compared to the rest of the Marple series—for example, Colonel Arthur Bantry, husband of Miss Marple's friend Dolly, is still alive and well in Sleeping Murder although he is noted as having died in books published earlier. It may be that Christie simply did not have time to revise the manuscript before she died.\n\nIn 2013, the Christie family gave their \"full backing\" to the release of a new Poirot story, The Monogram Murders, which was written by British author Sophie Hannah.  Hannah later released a second Poirot mystery, Closed Casket, in 2016.\n\nFormula and plot devices\n\nChristie's reputation as \"The Queen of Crime\" was built upon the large number of classic motifs that she introduced, or for which she provided the most famous example. Christie built these tropes into what is now considered classic mystery structure: a murder is committed, there are multiple suspects who are all concealing secrets, and the detective gradually uncovers these secrets over the course of the story, discovering the most shocking twists towards the end. Culprits in Christie's mysteries have included children, policemen, narrators, already deceased individuals, and sometimes comprise no known suspects (And Then There Were None) or all of the suspects (Murder on the Orient Express).\n\nAt the end, in a Christie hallmark, the detective usually gathers the surviving suspects into one room, explains the course of his deductive reasoning, and reveals the guilty party, although there are exceptions in which it is left to the guilty party to explain all (such as And Then There Were None and Endless Night).Mezei, Kathy. [https://www.jstor.org/stable/4619330 \"Spinsters, Surveillance, and Speech: The Case of Miss Marple, Miss Mole, and Miss Jekyll\"], The Journal of Modern Literature 30.2 (2007): 103–120Beehler, Sharon A. [https://www.jstor.org/stable/818612 \"Close vs. Closed Reading: Interpreting the Clues\"], The English Journal 77.6 (1998): 39–43\n\nChristie allows some culprits to escape earthly justice for a variety of reasons, such as the passage of time (retrospective cases), in which the most important characters have already died, or by active prescription. Such cases include The Witness for the Prosecution, Murder on the Orient Express, The Man in the Brown Suit, Elephants Can Remember, and The Unexpected Guest. There are instances in which a killer is not brought to justice in the legal sense but does die as a direct result of his plot, sometimes by his own hand at the direction or with the collusion of the detective (usually Hercule Poirot). This occurs in The Murder of Roger Ackroyd, Death on the Nile, Dumb Witness, Crooked House, The Hollow, The Mirror Crack'd from Side to Side, Cat Among the Pigeons, Peril at End House, Nemesis, Appointment with Death, The Secret Adversary, and Curtain. In the last of these (Curtain), no fewer than three culprits die during the course of the story.\n\nIn The A.B.C. Murders, the murderer has killed four innocent people and attempted to frame an unstable man for the crimes. Hercule Poirot, however, prevents this easy way out, ensuring a trial and hanging. In And Then There Were None, the killer's own death is intrinsic to the plot; the red herring is when and how the killer actually died. However, stage, film, and television productions of some of these mysteries were traditionally sanitized with the culprits not evading some form of justice, for a variety of reasons – e.g., censors, plot clarity, and Christie's own changing tastes. (When Christie adapted Witness for the Prosecution into a stage play, she lengthened the ending so that the murderer was also killed; this format was followed in screen versions, including the Billy Wilder film from 1957.) In Death Comes as the End, set in ancient Egypt, the culprit is killed by one of the few surviving characters before he can claim another victim .\n\nIn some stories, the question remains unresolved of whether formal justice will ever be delivered, such as Five Little Pigs and Endless Night. According to P. D. James, Christie often, but not always, made the unlikeliest character the guilty party. Savvy readers could sometimes identify the culprit by simply identifying the least likely suspect.\n\nOn an edition of Desert Island Discs in 2007, Brian Aldiss claimed that Christie had told him that she wrote her books up to the last chapter, then decided who the most unlikely suspect was, after which she would go back and make the necessary changes to \"frame\" that person. However, John Curran's Agatha Christie: The Secret Notebooks describes different working methods for every book in Christie's bibliography, contradicting the claim by Aldiss. \n\nTitles\n\nChristie's mature novels, from 1940 onwards, often have titles drawn from literature.\n\nFour are from Shakespeare: \n* Sad Cypress from a song in Twelfth Night: \"Come away, come away, death / And in sad cypress let me be laid\".\n* By the Pricking of My Thumbs from Act 4, Scene 1 of Macbeth : \"By the pricking of my thumbs / Something wicked this way comes\".\n* There is a Tide... (later Taken at the Flood) from Brutus' speech in Julius Caesar: \"There is a tide in the affairs of men / Which, taken at the flood, leads on to fortune\".\n* Absent in the Spring from Sonnet 98: \"From you have I been absent in the spring ...\"\n\nThree are from the Bible: \n* Evil Under the Sun from Ecclesiastes 5:13 (and restated in 6:1): \"There is a sore evil which I have seen under the sun, namely, riches kept for the owners thereof to their hurt\".\n* The Burden from Jesus' words: \"Take my yoke upon you, and learn of me ... For my yoke is easy, and my burden is light.\" (Matthew: 11: 29–30).\n* The Pale Horse from the Revelation of St John (6:8): \"I looked, and there before me was a pale horse! Its rider was named Death  ...\".\n\nAnother six are from other works of literature:\n* The Mirror Crack'd from Side to Side from Tennyson's \"The Lady of Shallot\": \"Out flew the web, and floated wide/The mirror cracked from side to side/'The curse is come upon me,\" cried/The Lady of Shalott\"\n* The Moving Finger from verse 51 of Edward FitzGerald's translation of the Rubáiyát of Omar Khayyám: \"The Moving Finger writes; and, having writ/Moves on ...\" This, in turn, refers to the Biblical account of Belshazzar's feast (Daniel, chapter 5), which is the origin of the expression \"the writing on the wall\".\n* The Rose and the Yew Tree from Section V of \"Little Gidding\" from T. S. Eliot's Four Quartets: \"The moment of the rose and the moment of the yew-tree/Are of equal duration\".\n* Postern of Fate from the poem \"Gates of Damascus\" by James Elroy Flecker: \"Postern of Fate, the Desert Gate, Disaster's Cavern, Fort of Fear/The Portal of Bagdad am I ...\"\n* Endless Night from William Blake's Auguries of Innocence: \"Some are born to sweet delight / Some are born to endless night\".\n* N or M? from the Catechism in the Book of Common Prayer which asks, \"What is your Christian name? Answer N. or M.\"[http://www.stlukesrec.org/bcp1963/catechism63.pdf A Catechism from the Book of Common Prayer, 1549, enlarged, 1637, revised in the Bishop White Book, 1785, now again revised and enlarged]  The \"N. or M.\" stands for the Latin, \"nomen vel nomina\", meaning \"name or names\". It is an accident of typography that \"nomina\" came to be represented by \"m\".\n\nIn such cases, the original context of the title is usually printed as an epigraph.Hopkins, Lisa. 2016. Who Owns the Wood? Appropriating A Midsummer Night's Dream. In Shakespearean Allusion in Crime Fiction, ed. L. Hopkins, pp. 63–103. Cham, Switzerland: Springer.\n Similarly, the title of Christie's autobiographical travel book Come, Tell Me How You Live is a quote from verse three of the White Knight's poem, \"Haddocks' Eyes\" from chapter eight of Through the Looking-Glass by Lewis Carroll, and is a play on the word \"tell\", an archaeological mound. \n\nThe title of The Mousetrap is purportedly an allusion to Shakespeare's play Hamlet, in which \"The Mousetrap\" is Hamlet's answer to Claudius's inquiry about the name of the play whose prologue and first scene he and his court have just watched (III, ii).Morgan, Janet. Agatha Christie, A Biography (p. 291) Collins, 1984; \n\nSeven stories are built around words from well known children's nursery rhymes: And Then There Were None (from \"Ten Little Indians\"), One, Two, Buckle My Shoe (from \"One, Two, Buckle My Shoe\"), Five Little Pigs (from \"This Little Piggy\"), Crooked House (from \"There Was a Crooked Man\"), A Pocket Full of Rye (from \"Sing a Song of Sixpence\"), Hickory Dickory Dock (from \"Hickory Dickory Dock\"), and Three Blind Mice (from \"Three Blind Mice\"). Similarly, the novel Mrs McGinty's Dead is named after a children's game that is explained in the course of the novel.\n\nCharacter stereotypes\n\nChristie occasionally inserted stereotyped descriptions of characters into her work, particularly before the end of the Second World War (when such attitudes were more commonly expressed publicly), and particularly in regard to Italians, Jews, non-Europeans, and sometimes Americans, the last usually as impossibly naïve or uninformed. For example, she described \"Hebraic men with hook-noses wearing rather flamboyant jewellery\" in the first editions of the collection The Mysterious Mr Quin (1930), in the short story \"The Soul of the Croupier\"; in later editions, the passage was edited to describe \"sallow men\" wearing same. \n\nIn The Hollow, published as late as 1946, one of the more unsympathetic characters is \"a Whitechapel Jewess with dyed hair and a voice like a corncrake ... a small woman with a thick nose, henna red and a disagreeable voice\". To contrast with the more stereotyped descriptions, Christie sometimes showed \"foreigners\" as victims or potential victims at the hands of English malefactors, such as, respectively, Olga Seminoff (Hallowe'en Party) and Katrina Reiger (in the short story \"How Does Your Garden Grow?\"). Jewish characters are often seen as un-English (such as Oliver Manders in Three Act Tragedy), but they are rarely the culprits.\n\nOften, she is affectionate or teasing with her prejudices. After four years of war-torn London, Christie hoped to return some day to Syria, which she described as \"gentle fertile country and its simple people, who know how to laugh and how to enjoy life; who are idle and gay, and who have dignity, good manners, and a great sense of humour, and to whom death is not terrible.\"\n\nShe had trouble with an incompetent Swiss French nursery helper (Marcelle) for toddler Rosalind, and as a result she decided, \"Scottish preferred ... good with the young. The French were hopeless disciplinarians ... Germans good and methodical, but it was not German that I really wanted Rosalind to learn. The Irish were gay but made trouble in the house; the English were of all kinds\".\n\nNon-fiction writings\n\nChristie published relatively few nonfiction works:\n*Come, Tell Me How You Live, about working on an archaeological dig, drawn from her life with second husband Max Mallowan\n*The Grand Tour: Around the World with the Queen of Mystery, a collection of correspondence from her 1922 Grand Tour of the British empire, including South Africa, Australia, New Zealand, and Canada\n*Agatha Christie: An Autobiography, published posthumously in 1977\n\nCritical reception and legacy\n\nOften referred to as the \"Queen of Crime\" or \"Queen of Mystery\", Agatha Christie is the world's best-selling mystery writer and is considered a master of suspense, plotting, and characterisation. Some critics, however, have regarded Christie's plotting as superior to her skill with other literary elements. Novelist Raymond Chandler criticised her in his essay \"The Simple Art of Murder\", and American literary critic Edmund Wilson was dismissive of Christie and the detective fiction genre generally in his New Yorker essay, \"Who Cares Who Killed Roger Ackroyd?\"\n\nIn honour of the 125th anniversary of her birth, 25 contemporary mystery writers and one publisher revealed their views on Christie's works. Many of the authors read Christie's novels first, before other mystery writers, in English or in their native language, influencing their own writing, and nearly all still view her as the \"Queen of Crime\", and creator of the plot twists used by mystery authors. Nearly all had one or more favourites among Christie's mysteries, and find her books good to read now, nearly 100 years after her first novel was published. Several of the authors would be very pleased to have their own novels in print in 100 years. Just one of the 25 authors held with Edmund Wilson's views. Harper Collins also published a souvenir magazine Shocking Real Murders: Behind Her Classic Mysteries.[http://www.vowelor.com/book/shocking-real-murders-agatha-christie-review/ \"Shocking Real Murders\"] by Agatha Christie, Harper Collins\n\nThe Guinness Book of World Records lists Christie as the best-selling novelist of all time. Her novels have sold roughly 2 billion copies, and her estate claims that her works come third in the rankings of the world's most-widely published books, behind only Shakespeare's works and the Bible. Half of the sales are of English language editions, and the other half in translation. According to Index Translationum, she remains the most-translated individual author – having been translated into at least 103 languages. And Then There Were None is Christie's best-selling novel, with 100 million sales to date, making it the world's best-selling mystery ever, and one of the best-selling books of all time.\n\nIn 2012, Christie was among the British cultural icons selected by artist Sir Peter Blake to appear in a new version of his most famous artwork – the Beatles' Sgt. Pepper's Lonely Hearts Club Band album cover – to celebrate the British cultural figures of his life that he most admires.\n\nInterests and influences\n\nArchaeology\n\nChristie had a lifelong interest in archaeology. She met her second husband, Sir Max Mallowan, a distinguished archaeologist, on a trip to the excavation site at Ur in 1930. But her fame as an author far surpassed his fame in archaeology. Prior to meeting Mallowan, Christie had not had any extensive brushes with archaeology, but once the two married, they made sure to only go to sites where they could work together. Christie accompanied Mallowan on countless archaeological trips, spending 3–4 months at a time in Syria and Iraq at excavation sites at Ur, Nineveh, Tell Arpachiyah, Chagar Bazar, Tell Brak, and Nimrud. She wrote novels and short stories, but also contributed work to the archaeological sites, more specifically to the archaeological restoration and labelling of ancient exhibits, including tasks such as cleaning and conserving delicate ivory pieces, reconstructing pottery, developing photos from early excavations which later led to taking photographs of the site and its findings, and taking field notes.\n\nChristie would always pay for her own board and lodging and her travel expenses so as to not influence the funding of the archaeological excavations, and she also supported excavations as an anonymous sponsor. During their time in the Middle East, there was also a large amount of time spent travelling to and from Mallowan's sites. Their extensive travelling had a strong influence on her writing, as some type of transportation often plays a part in her murderer's schemes. The large amount of travel was reused in novels such as Murder on the Orient Express, as well as suggesting the idea of archaeology as an adventure itself.\n\nAfter the Second World War, she chronicled her time in Syria with fondness in Come Tell Me How You Live. Anecdotes, memories, funny episodes are strung in a rough timeline, with more emphasis on eccentric characters and lovely scenery than on factual accuracy. From 8 November 2001 to 24 March 2002, The British Museum had an exhibit named Agatha Christie and Archaeology: Mystery in Mesopotamia, which presented the life of Agatha Christie and the influences of archaeology in her life and works.\n\nUse of archaeology in her writing\n\nMany of the settings for Christie's books were directly inspired by the many archaeological field seasons spent in the Middle East on the sites managed by her husband Max. The extent of her time spent at the many locations featured in her books is apparent from the extreme detail in which she describes them. One such site featured in her work is the temple site of Abu Simbel, depicted in Death on the Nile. Also there is the great detail in which she describes life at the dig site in Murder in Mesopotamia. Among the characters in her books, Christie has often given prominence to the archaeologists and experts in Middle Eastern cultures and artifacts. Most notable are the characters of Dr. Eric Leidner in Murder in Mesopotamia and Signor Richetti in Death on the Nile, while many minor characters were archaeologists in They Came to Baghdad.\n\nSome of Christie's best known novels with heavy archaeological influences are:\n* Murder in Mesopotamia (1936) – the most archaeologically influenced of all her novels, as it is set in the Middle East at an archaeological dig site and associated expedition house. The main characters include archaeologist Dr. Eric Leidner, his wife, many specialists and assistants, and the men working on the site. The novel is noted most for its careful description of the dig site and house, which showed that the author had spent much of her time in very similar situations. The characters in this book in particular are also based on archaeologists whom Christie knew from her personal experiences on excavation sites.\n* Death on the Nile (1937) – takes place on a tour boat on the Nile. Many archaeological sites are visited along the way and one of the main characters, Signor Richetti, is an archaeologist.\n* Appointment with Death (1938) – set in Jerusalem and its surrounding area. The death itself occurs at an old cave site in Petra and offers some very descriptive details of sites which Christie herself could have visited in order to write the book.\n* They Came to Baghdad (1951) – inspired by Christie's own trips to Baghdad with Mallowan, and involves an archaeologist as the heroine's love interest.\n\nPortrayals in fiction\n\nChristie has been portrayed on a number of occasions in film and television. Several biographical programmes have been made, such as BBC television's Agatha Christie: A Life in Pictures (2004; in which she was portrayed by Olivia Williams, Anna Massey, and Bonnie Wright, at different stages in her life), and in Season 3, Episode 1 of ITV Perspectives: \"The Mystery of Agatha Christie\" (2013), hosted by David Suchet, who plays Hercule Poirot on television.\n\nChristie has also been portrayed fictionally. Some of these portrayals have explored and offered accounts of Christie's disappearance in 1926, including the film Agatha (1979) (with Vanessa Redgrave, in which she sneaks away to plan revenge against her husband), and the Doctor Who episode \"The Unicorn and the Wasp\" (17 May 2008), with Fenella Woolgar, in which her disappearance is the result of her suffering a temporary breakdown owing to a brief psychic link being formed between her and an alien wasp called the Vespiform. Others, such as Hungarian film, Kojak Budapesten (1980; not to be confused with the 1986 comedy by the same name) create their own scenarios involving Christie's criminal skill. In the TV play, Murder by the Book (1986), Christie herself (Dame Peggy Ashcroft) murdered one of her fictional-turned-real characters, Poirot. The heroine of Liar-Soft's visual novel Shikkoku no Sharnoth: What a Beautiful Tomorrow (2008), Mary Clarissa Christie, is based on the real-life Christie. Christie features as a character in Gaylord Larsen's Dorothy and Agatha and The London Blitz Murders by Max Allan Collins. A fictionalized account of Christie's disappearance is the central theme of a Korean musical, Agatha. A young Agatha Christie is depicted in the Spanish historical television series Grand Hotel (2011). Aiding the local detectives, Agatha finds inspiration to write her new novel.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Agatha Christie" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=984" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dame Agatha Mary Clarissa Christie, Lady Mallowan, DBE (née Miller; 15 September 1890 – 12 January 1976) was an English writer. She is known for her 66 detective novels and 14 short story collections, particularly those revolving around her fictional detectives Hercule Poirot and Miss Marple. Christie also wrote the world's longest-running play, a murder mystery, The Mousetrap, and six romances under the name Mary Westmacott. In 1971 she was elevated to Dame Commander of the Order of the British Empire (DBE) for her contribution to literature.\n\nChristie was born into a wealthy upper-middle-class family in Torquay, Devon. She served in a Devon hospital during the First World War, tending to troops coming back from the trenches, before marrying and starting a family in London. She was initially an unsuccessful writer with six rejections, but this changed when The Mysterious Affair at Styles, featuring Hercule Poirot, was published in 1920. During the Second World War she worked as a pharmacy assistant at University College Hospital, London, during the Blitz and acquired a good knowledge of poisons which featured in many of her subsequent novels.\n\nGuinness World Records lists Christie as the best-selling novelist of all time. Her novels have sold roughly 2 billion copies, and her estate claims that her works come third in the rankings of the world's most-widely published books, behind only Shakespeare's works and the Bible. According to Index Translationum, she remains the most-translated individual author – having been translated into at least 103 languages. And Then There Were None is Christie's best-selling novel, with 100 million sales to date, making it the world's best-selling mystery ever, and one of the best-selling books of all time. \nChristie's stage play The Mousetrap holds the world record for longest initial run.\n\nIt opened at the Ambassadors Theatre in the West End on 25 November 1952, and  is still running after more than 25,000 performances.[https://www.the-mousetrap.co.uk/Online The Mousetrap website], the-mousetrap.co.uk; accessed 2 June 2015.\n\nIn 1955, Christie was the first recipient of the Mystery Writers of America's highest honour, the Grand Master Award. Later the same year, Witness for the Prosecution received an Edgar Award by the MWA for Best Play.\nIn 2013, The Murder of Roger Ackroyd was voted the best crime novel ever by 600 fellow writers of the Crime Writers' Association. \n\nOn 15 September 2015, coinciding with her 125th birthday, And Then There Were None was named the \"World's Favourite Christie\" in a vote sponsored by the author's estate. Most of her books and short stories have been adapted for television, radio, video games and comics, and more than thirty feature films have been based on her work.\n\nLife and career\n\nChildhood and adolescence: 1890–1910\n\nAgatha Mary Clarissa Miller was born on 15 September 1890, into a wealthy upper middle-class family in Ashfield, Torquay, Devon. Her mother, Clara (Boehmer), was an Englishwoman who was born in Belfast in 1854 to Captain Frederick Boehmer and Mary Ann West, the couple's only daughter. Clara Boehmer had four brothers, one of whom died young. Captain Boehmer was killed in a riding accident while stationed on Jersey in April 1863, leaving Mary Ann (Christie's grandmother) to raise her children alone on a meagre income. Mary Ann's sister Margaret West had married a wealthy American, Nathaniel Frary Miller, in 1863, and the couple lived in Prinsted, West Sussex. Margaret had no children of her own, and so the two sisters arranged that Clara should be raised by her aunt and uncle. It was here she met her future husband, an American stockbroker named Frederick Alvah Miller, who was the son of Nathaniel's first marriage.\n\nA member of the American upper class, Frederick had been sent to Switzerland for his education. He was considered personable and friendly by those who knew him. He soon developed a romantic relationship with Clara, and they were married in April 1878. Their first child, Margaret Frary Miller (1879–1950), was born in Torquay, where the couple were renting lodgings, while their second, Louis \"Monty\" Montant (1880–1929), was born in the U.S. state of New York, where Frederick was on a business trip. When Frederick's father Nathaniel died, he left Clara £2000 in her own right; she used this money to purchase a villa in Torquay named \"Ashfield\" in which to raise her family. It was here that her third and final child, Agatha, was born.\n\nChristie described her childhood as \"very happy\". She was surrounded by a series of strong and independent women from an early age. Her time was spent alternating between her home in Devon, her step-grandmother and aunt's house in Ealing, West London, and parts of Southern Europe, where her family would holiday during the winter. \n\nAgatha was raised in a household with various esoteric beliefs and, like her siblings, believed that her mother Clara was a psychic with the ability of second sight. Agatha's sister Margaret had been sent to Roedean in Sussex for her education, but their mother insisted that Agatha receive a home education, and so her parents were responsible for teaching her to read and write and to be able to perform basic arithmetic, a subject that she particularly enjoyed. They also taught her about music, and she learned to play both the piano and the mandolin. According to biographer Laura Thomson, Clara believed that Agatha should not learn to read till she was eight. However, due to her curiosity, Agatha taught herself to read much earlier. One of the earliest known photographs of Christie (now a part of the Christie family's heirlooms) depicts her as a little girl with her first dog, whom she called George Washington.\n\nChristie was a voracious reader from an early age. Among her earliest memories were those of reading the children's books written by Mrs Molesworth, including The Adventures of Herr Baby (1881), Christmas Tree Land (1897), and The Magic Nuts (1898). She also read the work of Edith Nesbit, including The Story of the Treasure Seekers (1899), The Phoenix and the Carpet (1903), and The Railway Children (1906). When a little older, she moved on to reading the surreal verse of Edward Lear and Lewis Carroll. In April 1901, at age 10, she wrote her first poem, \"The cowslip\".\n\nShe spent much of her childhood apart from other children, although she devoted much time to her pets, whom she adored. She eventually made friends with a group of other girls in Torquay, and she noted that \"one of the highlights of my existence\" was her appearance with them in a youth production of Gilbert and Sullivan's The Yeomen of the Guard, in which she played the hero, Colonel Fairfax. This was her last operatic role for, as she later wrote, \"an experience that you really enjoyed should never be repeated.\"\n\nHer father was often ill, suffering from a series of heart attacks, and he died in November 1901, aged 55. His death left the family devastated and in an uncertain economic situation. Clara and Agatha continued to live together in their Torquay home, Madge had moved to Abney Hall in Cheadle, Cheshire, with her new husband, and Monty had joined the army and been sent to South Africa to fight in the Boer War. Agatha later claimed that her father's death, occurring when she was eleven years old, marked the end of her childhood. In 1902, Agatha was sent to receive a formal education at Miss Guyer's Girls School in Torquay, but found it difficult to adjust to the disciplined atmosphere. In 1905, she was sent to Paris where she was educated in three pensions – Mademoiselle Cabernet's, Les Marroniers, and then Miss Dryden's – the last of which served primarily as a finishing school.\n\nEarly literary attempts and the First World War: 1910–19\n\nAgatha returned to England in 1910 and found that her mother Clara was ill. They decided to spend time together in the warmer climate of Cairo, then a regular tourist destination for wealthy Britons; they stayed for three months at the Gezirah Palace Hotel. Agatha, always chaperoned by her mother, attended many social functions in search of a husband. She visited ancient Egyptian monuments such as the Great Pyramid of Giza, but did not exhibit the great interest in archaeology and Egyptology that became prominent in her later years.,\nReturning to Britain, she continued her social activities, writing and performing in amateur theatricals. She also helped put on a play called The BlueBeard of Unhappiness with female friends. Her writing extended to both poetry and music. Some early works saw publication, but she decided against focusing on either of these as future professions.\n\nChristie wrote her first short story, The House of Beauty (an early version of her later-published story The House of Dreams[http://www.agathachristie.com/christies-work/stories/the-house-of-dreams/377 The House of Dreams: Details], agathachristie.com; accessed 7 August 2015.), while recovering in bed from an undisclosed illness. This was about 6,000 words on the topic of \"madness and dreams\", a subject of fascination for her. Biographer Janet Morgan commented that, despite \"infelicities of style\", the story was nevertheless \"compelling\".\n\nOther stories followed, most of them illustrating her interest in spiritualism and the paranormal. These included \"The Call of Wings\" and \"The Little Lonely God\". Magazines rejected all her early submissions, made under pseudonyms, although some were revised and published later, often with new titles.\n\nChristie then set her first novel, Snow Upon the Desert, in Cairo, and drew from her recent experiences in that city, written under the pseudonym Monosyllaba. She was perturbed when various publishers all declined. Clara suggested that her daughter ask for advice from a family friend and neighbour, writer Eden Philpotts, who obliged her enquiry, encouraged her writing, and sent her an introduction to his own literary agent, Hughes Massie, who rejected Snow Upon the Desert, and suggested a second novel.\n\nChristie continued searching for a husband, and entered into short-lived relationships with four separate men and an engagement with another. She then met Archibald Christie (1889–1962) at a dance given by Lord and Lady Clifford at Ugbrooke, about 12 mi from Torquay. Archie was born in India, the son of a judge in the Indian Civil Service. He was an army officer who was seconded to the Royal Flying Corps in April 1913. The couple quickly fell in love. Upon learning that he would be stationed in Farnborough, Archie proposed marriage, and Agatha accepted.\n\nWith the outbreak of World War I in August 1914, Archie was sent to France to fight the German forces. They married on the afternoon of Christmas Eve 1914 at Emmanuel Church, Clifton, Bristol, which was close to the home of his parents, while Archie was on home leave. Rising through the ranks, he was eventually stationed back to Britain in September 1918 as a colonel in the Air Ministry.\n\nAgatha involved herself in the war effort. She joined the Voluntary Aid Detachment (VAD) in 1914, and attended to wounded soldiers at a hospital in Torquay as an unpaid VAD nurse. Responsible for aiding the doctors and maintaining morale, she performed 3,400 hours of unpaid work between October 1914 and December 1916. After qualifying as an \"apothecaries' assistant\" (or dispenser) in 1917 and working as a dispenser, she earned £16 a year until the end of her service in September 1918. After the war, Agatha and Archie Christie settled into a flat at 5 Northwick Terrace in St. John's Wood, northwest London.\n\nFirst novels and Poirot: 1919–23\n\nChristie had long been a fan of detective novels, having enjoyed  Wilkie Collins's The Woman in White and The Moonstone, as well as Sir Arthur Conan Doyle's early Sherlock Holmes stories. She wrote her own detective novel, The Mysterious Affair at Styles, featuring Hercule Poirot, a former Belgian police officer noted for his twirly large \"magnificent moustaches\" and egg-shaped head. Poirot had taken refuge in Britain after Germany invaded Belgium. Christie's inspiration for the character stemmed from real Belgian refugees who were living in Torquay and the Belgian soldiers whom she helped treat as a volunteer nurse in Torquay during the First World War.\n\nAgatha began working on The Mysterious Affair at Styles in 1916, writing most of it at Dartmoor. Her original  manuscript was rejected by such publishing companies as Hodder and Stoughton and Methuen. After keeping the submission for several months, John Lane at The Bodley Head offered to accept it, provided that Christie change the ending. She did so, and signed a contract which she later felt was exploitative. It was finally published in 1920. \n\nChristie, meanwhile, settled into married life, giving birth to her only child, daughter Rosalind Margaret Hicks, in August 1919 at Ashfield, where the couple spent much of their time, having few friends in London. Archie left the Air Force at the end of the war and started working in the City financial sector at a relatively low salary, though they still employed a maid.\n\nChristie's second novel, The Secret Adversary (1922), featured a new detective couple Tommy and Tuppence, again published by The Bodley Head. It earned her £50. A third novel again featured Poirot, Murder on the Links (1923), as did short stories commissioned by Bruce Ingram, editor of The Sketch magazine. In order to tour the world promoting the British Empire Exhibition, the couple left their daughter Rosalind with Agatha's mother and sister. They travelled to South Africa, Australia, New Zealand, and Hawaii.  They learned to surf prone in South Africa; then, in Waikiki, they were among the first Britons to surf standing up.\n\nDisappearance\n\nIn late 1926, Archie asked Agatha for a divorce. He was in love with Nancy Neele, who had been a friend of Major Belcher, director of the British Empire Mission, on the promotional tour a few years earlier. On 3 December 1926, the Christies quarrelled, and Archie left their house, Styles, in Sunningdale, Berkshire, to spend the weekend with his mistress at Godalming, Surrey. That same evening, around 9:45 pm, Christie disappeared from her home, leaving behind a letter for her secretary saying that she was going to Yorkshire. Her car, a Morris Cowley, was later found at Newlands Corner, perched above a chalk quarry, with an expired driving licence and clothes.\n\nHer disappearance caused an outcry from the public. The Home Secretary, William Joynson-Hicks, pressured police, and a newspaper offered a £100 reward. Over a thousand police officers, 15,000 volunteers, and several aeroplanes scoured the rural landscape. Sir Arthur Conan Doyle even gave a spirit medium one of Christie's gloves to find the missing woman. Dorothy L. Sayers visited the house in Surrey, later using the scenario in her book Unnatural Death.\n\nChristie's disappearance was featured on the front page of The New York Times. Despite the extensive manhunt, she was not found for 10 days. On 14 December 1926, she was found at the Swan Hydropathic Hotel (now the Old Swan Hotel) in Harrogate, Yorkshire, registered as Mrs Teresa Neele (the surname of her husband's lover) from Cape Town.\n\nChristie's autobiography makes no reference to her disappearance. Two doctors diagnosed her as suffering from amnesia (see fugue state), yet opinion remains divided as to why she disappeared. Biographer Laura Thompson suggested that Christie let this out in the six novels that she wrote between 1930 and 1956 under the nom de plume Mary Westmacott, in a style quite different from her regular detective stories. She was known to be in a depressed state from literary overwork, her mother's death earlier that year, and her husband's infidelity. Public reaction at the time was largely negative, supposing a publicity stunt or an attempt to frame her husband for murder.\n\nThe 1979 Michael Apted film Agatha features a disclaimer in the opening credits stating that what follows is an imaginary solution to an authentic mystery. The film starred Vanessa Redgrave and Timothy Dalton as Agatha and Archie, and depicts Christie planning suicide in such a way as to frame her husband's mistress for her \"murder\". An American reporter, played by Dustin Hoffman, follows her closely and stops the plan. Christie's heirs unsuccessfully sued to prevent the film's distribution.\n\nAuthor Jared Cade interviewed numerous witnesses and relatives for his sympathetic biography Agatha Christie and the Eleven Missing Days, revised 2011. He provided substantial evidence to suggest that she planned the event to embarrass her husband, never anticipating the resulting escalated melodrama.\n\nThe Christies divorced in 1928, and Archie married Nancy Neele. Agatha retained custody of daughter Rosalind and the Christie name for her writing. During their marriage, she published six novels, a collection of short stories, and a number of short stories in magazines. \n\nSecond marriage and later life\n\nIn 1928, Christie left England for Istanbul and subsequently for Baghdad on the Orient Express. During this trip, she encountered her first archaeological dig and met a young archaeologist, Max Mallowan, whom she married in September 1930. Their marriage was happy and lasted until Christie's death in 1976. In a 1977 interview, Mallowan recounted his first meeting with Christie, when he took her and a group of tourists on a tour of his expedition site in Iraq.\n\nChristie frequently used settings that were familiar to her for her stories. She often accompanied Mallowan on his archaeological expeditions, and her travels with him contributed background to several of her novels set in the Middle East. Other novels (such as And Then There Were None) were set in and around Torquay, where she was raised. Christie's 1934 novel Murder on the Orient Express was written in the Pera Palace Hotel in Istanbul, Turkey, the southern terminus of the railway. The hotel maintains Christie's room as a memorial to the author. \n\nThe Greenway Estate in Devon, acquired by the couple as a summer residence in 1938, is now in the care of the National Trust. Christie often stayed at Abney Hall, Cheshire, owned by her brother-in-law, James Watts, basing at least two stories there: a short story \"The Adventure of the Christmas Pudding\" in the story collection of the same name, and the novel After the Funeral. \"Abney became Agatha's greatest inspiration for country-house life, with all its servants and grandeur being woven into her plots. The descriptions of the fictional Chimneys, Stoneygates, and other houses in her stories are mostly Abney in various forms.\"\n\nDuring the Second World War, Christie worked in the pharmacy at University College Hospital, London, where she acquired a knowledge of poisons that she put to good use in her post-war crime novels. For example, the use of thallium as a poison was suggested to her by UCH Chief Pharmacist Harold Davis (later appointed Chief Pharmacist at the UK Ministry of Health), and in The Pale Horse, published in 1961, she employed it to dispatch a series of victims, the first clue to the murder method coming from the victims' loss of hair. So accurate was her description of thallium poisoning that on at least one occasion it helped solve a case that was baffling doctors.John Emsley, [https://www.independent.co.uk/news/science/the-poison-prescribed-by-agatha-christie-thanks-to-the-mystery-writer-the-deadly-properties-of-thallium-sulphate-have-become-common-knowledge-corrected-1534450.html \"The poison prescribed by Agatha Christie\"], The Independent, 20 July 1992.\n\nChristie lived in Chelsea, first in Cresswell Place and later in Sheffield Terrace. Both properties are now marked by blue plaques. In 1934, she and Max Mallowan purchased Winterbrook House in Winterbrook, a hamlet adjoining the small market town of Wallingford, then within the bounds of Cholsey and in Berkshire.[http://www.oxfordshireblueplaques.org.uk/plaques/christie.html Oxfordshire Blue Plaques], oxfordshireblueplaques.org.uk; accessed 21 September 2015. \n\nThis was their main residence for the rest of their lives and the place where Christie did most of her writing. This house, too, bears a blue plaque. Christie led a quiet life despite being known in the town of Wallingford, where she was for many years President of the local amateur dramatic society.\n\nAround 1941–42, the British intelligence agency MI5 investigated Christie after a character called Major Bletchley appeared in her 1941 thriller N or M?, which was about a hunt for a pair of deadly fifth columnists in wartime England. MI5 was afraid that Christie had a spy in Britain's top-secret codebreaking centre, Bletchley Park. The agency's fears were allayed when Christie told friend (and codebreaker) Dilly Knox, \"I was stuck there on my way by train from Oxford to London and took revenge by giving the name to one of my least lovable characters.\"\n\nTo honour her many literary works, she was appointed Commander of the Order of the British Empire (CBE) in the 1956 New Year Honours. The next year, she became the President of the Detection Club. In the 1971 New Year Honours, she was promoted to Dame Commander of the Order of the British Empire (DBE). three years after her husband had been knighted for his archaeological work in 1968. They were one of the few married couples where both partners were honoured in their own right. From 1968, owing to her husband's knighthood, Christie could also be styled Lady Mallowan.\n\nFrom 1971-74, Christie's health began to fail, although she continued to write. Recently, using experimental tools of textual analysis, Canadian researchers have suggested that Christie may have begun to suffer from Alzheimer's disease or other dementia.\n\nDeath\n\nDame Agatha Christie died on 12 January 1976 at age 85 from natural causes at her home in Winterbrook, Cholsey, Oxfordshire. She is buried in the nearby churchyard of St Mary's, Cholsey, having chosen the plot for their final resting place with her husband Sir Max some ten years before she died. The simple funeral service was attended by about 20 newspaper and TV reporters, some having travelled from as far away as South America. Thirty wreaths adorned Dame Agatha's grave, including one from the cast of her long-running play The Mousetrap and one sent 'on behalf of the multitude of grateful readers' by the Ulverscroft Large Print Book Publishers.Marilyn Yurdan – Oxfordshire Graves and Gravestones. The History Press 2010\n\nShe was survived by her only child, Rosalind Hicks, and only grandson, Mathew Prichard. Her husband, Max, died in 1978, aged 74.\n\nAgatha Christie's estate and subsequent ownership of works\n\nChristie had set up a private company, Agatha Christie Limited, to hold the rights to her works, and around 1959 she had transferred her 278-acre home, Greenway Estate, to her daughter Rosalind.[http://www.telegraph.co.uk/news/obituaries/1476488/Rosalind-Hicks.html Obituary: Rosalind Hicks], telegraph.co.uk, 13 November 2004; accessed 25 January 2015. In 1968, when Christie was almost 80 years old, she sold a 51% stake in Agatha Christie Limited (and therefore the works it owned) to Booker Books (better known as Booker Author's Division), a subsidiary of the British food and transport conglomerate Booker-McConnell (now Booker Group), the founder of the Booker Prize for literature, which later increased its stake to 64%. Agatha Christie Limited remains the owner of the worldwide rights for over 80 of Christie's novels and short stories, 19 plays, and nearly 40 TV films.\n\nAfter Christie's death in 1976, her remaining 36% share of the company was inherited by her daughter, Rosalind Hicks, who passionately preserved her mother's works, image, and legacy until her own death 28 years later. The family's share of the company allowed them to appoint 50% of the board and the chairman, and thereby to retain a veto over new treatments, updated versions, and republications of her works.[http://www.thefreelibrary.com/Agatha+Christie+begins+new+chapter+after+pounds+10m+selff.-a060775079 Agatha Christie begins new chapter after £10m selloff], TheFreeLibrary.com, 4 June 1998.\n\nIn 1993, Hicks founded the Agatha Christie Society and became its first president. In 2004 her obituary in The Telegraph commented that Hicks had been \"determined to remain true to her mother's vision and to protect the integrity of her creations\" and disapproved of \"merchandising\" activities. Upon Hicks's death on 28 October 2004, both the Society and the Greenway Estate passed to Christie's grandson, Mathew Prichard.  After his parents' deaths, Prichard donated Greenway and its contents to the National Trust. The Society is now chaired and managed by Agatha Christie’s great-grandson James Prichard.The Agatha Christie Society. Online. Access 2017-10-22. [http://agathachristiesociety.com/ web site].\n\nChristie's family and family trusts, including James Prichard, continue to own the remaining 36% stake in Agatha Christie Limited,[https://www.theguardian.com/media/2012/feb/29/acorn-media-bys-stake-agatha-christie Acorn Media buys stake in Agatha Christie estate], The Guardian, 29 December 2012. and remain associated with the company. James Prichard became the company's chairman in October 2015James Prichard, LinkedIn [https://uk.linkedin.com/in/james-prichard-b33b707 web site]. The development of Christie's work continues apace.Agatha Christie: Why we still love her 'cosy crime' novels. The Independent, 2017-9-14. [Online. https://www.independent.co.uk/news/long_reads/agatha-christie-cosy-crime-novels-murder-mystery-writer-why-we-love-a7942901.html Online]. Mathew Prichard in his own right holds the copyright to some of his grandmother's later literary works (including The Mousetrap).Thompson, Laura. Agatha Christie, An English Mystery (p. 473). Headline, 2007; \n\nIn 1998, Booker sold a number of its non-food assets to focus on its core business. As part of that, its shares in Agatha Christie Limited (at the time earning £2.1m annual revenue) were sold for £10m to Chorion, a major international media company whose portfolio of well-known authors' works also included the literary estates of Enid Blyton and Dennis Wheatley. In February 2012, some years after a management buyout, Chorion found itself in financial difficulties, and began to sell off its literary assets on the market. The process included the sale of Chorion's 64% stake in Agatha Christie Limited to Acorn Media U.K. In 2014, RLJ Entertainment Inc. acquired Acorn Media U.K., renamed it Acorn Media Enterprises, and incorporated it as the RLJE UK development arm.RLJ Entertainment Inc. web site [http://www.rljentertainment.com/ RLJE web site] RLJ Entertainment Inc. was founded by American entrepreneur Robert L. Johnson.\n \n, media reports stated that the BBC had acquired exclusive TV rights to Christie's works in the UK (previously associated with ITV) and plans with Acorn's co-operation to air new productions for the 125th anniversary of Christie's birth in 2015.[http://www.radiotimes.com/news/2014-02-28/david-walliams-heralds-new-era-for-bbc-as-the-new-home-of-agatha-christie-adaptations \"New era for BBC as the new home of Agatha Christie adaptations\"], radiotimes.com, 28 February 2014; accessed 25 January 2015. The BBC broadcast Partners In Crime and And Then There Were None in 2015 as part of the deal. Subsequent productions have included The Witness for the Prosecution but plans to televise Ordeal by Innocence at Christmas 2017 had to be delayed due to controversy surrounding one of the cast members.\n\nWritings\n\nWorks of fiction\n\nHercule Poirot and Miss Marple\n\nChristie's first book, The Mysterious Affair at Styles, was published in 1920 and introduced the detective Hercule Poirot, who became a long-running character in Christie's works, appearing in 33 novels and 54 short stories.\n\nMiss Jane Marple, introduced in the short-story collection The Thirteen Problems in 1927, was based on Christie's grandmother and her \"Ealing cronies\". Both Jane and Gran \"always expected the worst of everyone and everything, and were, with almost frightening accuracy, usually proved right.\" Marple appeared in 12 novels and 20 stories.\n\nDuring the Second World War, Christie wrote two novels, Curtain and Sleeping Murder, intended as the last cases of these two great detectives, Hercule Poirot and Miss Marple. Both books were sealed in a bank vault for over thirty years and were released for publication by Christie only at the end of her life, when she realised that she could not write any more novels. These publications came on the heels of the success of the film version of Murder on the Orient Express in 1974.\n\nChristie became increasingly tired of Poirot, much as Sir Arthur Conan Doyle had grown weary of his character Sherlock Holmes. By the end of the 1930s, Christie wrote in her diary that she was finding Poirot \"insufferable\", and by the 1960s she felt that he was \"an egocentric creep\".\n\nHowever, unlike Conan Doyle, Christie resisted the temptation to kill her detective off while he was still popular. She saw herself as an entertainer whose job was to produce what the public liked, and the public liked Poirot.\n\nShe did marry off Poirot's companion Captain Hastings in an attempt to trim her cast commitments. In contrast, Christie was fond of Miss Marple. However, the Belgian detective's titles outnumber the Marple titles more than two to one. This is largely because Christie wrote numerous Poirot novels early in her career, while The Murder at the Vicarage remained the sole Marple novel until the 1940s. Christie never wrote a novel or short story featuring both Poirot and Miss Marple. In a recording discovered and released in 2008, Christie revealed the reason for this: \"Hercule Poirot, a complete egoist, would not like being taught his business or having suggestions made to him by an elderly spinster lady. Hercule Poirot - a professional sleuth - would not be at home at all in Miss Marple's world.\".\n\nPoirot is the only fictional character to date to be given an obituary in The New York Times, following the publication of Curtain. It appeared on the front page of the paper on 6 August 1975.\n\nFollowing the great success of Curtain, Christie gave permission for the release of Sleeping Murder sometime in 1976 but died in January 1976 before the book could be released. This may explain some of the inconsistencies compared to the rest of the Marple series—for example, Colonel Arthur Bantry, husband of Miss Marple's friend Dolly, is still alive and well in Sleeping Murder although he is noted as having died in books published earlier. It may be that Christie simply did not have time to revise the manuscript before she died.\n\nIn 2013, the Christie family gave their \"full backing\" to the release of a new Poirot story, The Monogram Murders, which was written by British author Sophie Hannah.  Hannah later released a second Poirot mystery, Closed Casket, in 2016.\n\nFormula and plot devices\n\nChristie's reputation as \"The Queen of Crime\" was built upon the large number of classic motifs that she introduced, or for which she provided the most famous example. Christie built these tropes into what is now considered classic mystery structure: a murder is committed, there are multiple suspects who are all concealing secrets, and the detective gradually uncovers these secrets over the course of the story, discovering the most shocking twists towards the end. Culprits in Christie's mysteries have included children, policemen, narrators, already deceased individuals, and sometimes comprise no known suspects (And Then There Were None) or all of the suspects (Murder on the Orient Express).\n\nAt the end, in a Christie hallmark, the detective usually gathers the surviving suspects into one room, explains the course of his deductive reasoning, and reveals the guilty party, although there are exceptions in which it is left to the guilty party to explain all (such as And Then There Were None and Endless Night).Mezei, Kathy. [https://www.jstor.org/stable/4619330 \"Spinsters, Surveillance, and Speech: The Case of Miss Marple, Miss Mole, and Miss Jekyll\"], The Journal of Modern Literature 30.2 (2007): 103–120Beehler, Sharon A. [https://www.jstor.org/stable/818612 \"Close vs. Closed Reading: Interpreting the Clues\"], The English Journal 77.6 (1998): 39–43\n\nChristie allows some culprits to escape earthly justice for a variety of reasons, such as the passage of time (retrospective cases), in which the most important characters have already died, or by active prescription. Such cases include The Witness for the Prosecution, Murder on the Orient Express, The Man in the Brown Suit, Elephants Can Remember, and The Unexpected Guest. There are instances in which a killer is not brought to justice in the legal sense but does die as a direct result of his plot, sometimes by his own hand at the direction or with the collusion of the detective (usually Hercule Poirot). This occurs in The Murder of Roger Ackroyd, Death on the Nile, Dumb Witness, Crooked House, The Hollow, The Mirror Crack'd from Side to Side, Cat Among the Pigeons, Peril at End House, Nemesis, Appointment with Death, The Secret Adversary, and Curtain. In the last of these (Curtain), no fewer than three culprits die during the course of the story.\n\nIn The A.B.C. Murders, the murderer has killed four innocent people and attempted to frame an unstable man for the crimes. Hercule Poirot, however, prevents this easy way out, ensuring a trial and hanging. In And Then There Were None, the killer's own death is intrinsic to the plot; the red herring is when and how the killer actually died. However, stage, film, and television productions of some of these mysteries were traditionally sanitized with the culprits not evading some form of justice, for a variety of reasons – e.g., censors, plot clarity, and Christie's own changing tastes. (When Christie adapted Witness for the Prosecution into a stage play, she lengthened the ending so that the murderer was also killed; this format was followed in screen versions, including the Billy Wilder film from 1957.) In Death Comes as the End, set in ancient Egypt, the culprit is killed by one of the few surviving characters before he can claim another victim .\n\nIn some stories, the question remains unresolved of whether formal justice will ever be delivered, such as Five Little Pigs and Endless Night. According to P. D. James, Christie often, but not always, made the unlikeliest character the guilty party. Savvy readers could sometimes identify the culprit by simply identifying the least likely suspect.\n\nOn an edition of Desert Island Discs in 2007, Brian Aldiss claimed that Christie had told him that she wrote her books up to the last chapter, then decided who the most unlikely suspect was, after which she would go back and make the necessary changes to \"frame\" that person. However, John Curran's Agatha Christie: The Secret Notebooks describes different working methods for every book in Christie's bibliography, contradicting the claim by Aldiss. \n\nTitles\n\nChristie's mature novels, from 1940 onwards, often have titles drawn from literature.\n\nFour are from Shakespeare: \n* Sad Cypress from a song in Twelfth Night: \"Come away, come away, death / And in sad cypress let me be laid\".\n* By the Pricking of My Thumbs from Act 4, Scene 1 of Macbeth : \"By the pricking of my thumbs / Something wicked this way comes\".\n* There is a Tide... (later Taken at the Flood) from Brutus' speech in Julius Caesar: \"There is a tide in the affairs of men / Which, taken at the flood, leads on to fortune\".\n* Absent in the Spring from Sonnet 98: \"From you have I been absent in the spring ...\"\n\nThree are from the Bible: \n* Evil Under the Sun from Ecclesiastes 5:13 (and restated in 6:1): \"There is a sore evil which I have seen under the sun, namely, riches kept for the owners thereof to their hurt\".\n* The Burden from Jesus' words: \"Take my yoke upon you, and learn of me ... For my yoke is easy, and my burden is light.\" (Matthew: 11: 29–30).\n* The Pale Horse from the Revelation of St John (6:8): \"I looked, and there before me was a pale horse! Its rider was named Death  ...\".\n\nAnother six are from other works of literature:\n* The Mirror Crack'd from Side to Side from Tennyson's \"The Lady of Shallot\": \"Out flew the web, and floated wide/The mirror cracked from side to side/'The curse is come upon me,\" cried/The Lady of Shalott\"\n* The Moving Finger from verse 51 of Edward FitzGerald's translation of the Rubáiyát of Omar Khayyám: \"The Moving Finger writes; and, having writ/Moves on ...\" This, in turn, refers to the Biblical account of Belshazzar's feast (Daniel, chapter 5), which is the origin of the expression \"the writing on the wall\".\n* The Rose and the Yew Tree from Section V of \"Little Gidding\" from T. S. Eliot's Four Quartets: \"The moment of the rose and the moment of the yew-tree/Are of equal duration\".\n* Postern of Fate from the poem \"Gates of Damascus\" by James Elroy Flecker: \"Postern of Fate, the Desert Gate, Disaster's Cavern, Fort of Fear/The Portal of Bagdad am I ...\"\n* Endless Night from William Blake's Auguries of Innocence: \"Some are born to sweet delight / Some are born to endless night\".\n* N or M? from the Catechism in the Book of Common Prayer which asks, \"What is your Christian name? Answer N. or M.\"[http://www.stlukesrec.org/bcp1963/catechism63.pdf A Catechism from the Book of Common Prayer, 1549, enlarged, 1637, revised in the Bishop White Book, 1785, now again revised and enlarged]  The \"N. or M.\" stands for the Latin, \"nomen vel nomina\", meaning \"name or names\". It is an accident of typography that \"nomina\" came to be represented by \"m\".\n\nIn such cases, the original context of the title is usually printed as an epigraph.Hopkins, Lisa. 2016. Who Owns the Wood? Appropriating A Midsummer Night's Dream. In Shakespearean Allusion in Crime Fiction, ed. L. Hopkins, pp. 63–103. Cham, Switzerland: Springer.\n Similarly, the title of Christie's autobiographical travel book Come, Tell Me How You Live is a quote from verse three of the White Knight's poem, \"Haddocks' Eyes\" from chapter eight of Through the Looking-Glass by Lewis Carroll, and is a play on the word \"tell\", an archaeological mound. \n\nThe title of The Mousetrap is purportedly an allusion to Shakespeare's play Hamlet, in which \"The Mousetrap\" is Hamlet's answer to Claudius's inquiry about the name of the play whose prologue and first scene he and his court have just watched (III, ii).Morgan, Janet. Agatha Christie, A Biography (p. 291) Collins, 1984; \n\nSeven stories are built around words from well known children's nursery rhymes: And Then There Were None (from \"Ten Little Indians\"), One, Two, Buckle My Shoe (from \"One, Two, Buckle My Shoe\"), Five Little Pigs (from \"This Little Piggy\"), Crooked House (from \"There Was a Crooked Man\"), A Pocket Full of Rye (from \"Sing a Song of Sixpence\"), Hickory Dickory Dock (from \"Hickory Dickory Dock\"), and Three Blind Mice (from \"Three Blind Mice\"). Similarly, the novel Mrs McGinty's Dead is named after a children's game that is explained in the course of the novel.\n\nCharacter stereotypes\n\nChristie occasionally inserted stereotyped descriptions of characters into her work, particularly before the end of the Second World War (when such attitudes were more commonly expressed publicly), and particularly in regard to Italians, Jews, non-Europeans, and sometimes Americans, the last usually as impossibly naïve or uninformed. For example, she described \"Hebraic men with hook-noses wearing rather flamboyant jewellery\" in the first editions of the collection The Mysterious Mr Quin (1930), in the short story \"The Soul of the Croupier\"; in later editions, the passage was edited to describe \"sallow men\" wearing same. \n\nIn The Hollow, published as late as 1946, one of the more unsympathetic characters is \"a Whitechapel Jewess with dyed hair and a voice like a corncrake ... a small woman with a thick nose, henna red and a disagreeable voice\". To contrast with the more stereotyped descriptions, Christie sometimes showed \"foreigners\" as victims or potential victims at the hands of English malefactors, such as, respectively, Olga Seminoff (Hallowe'en Party) and Katrina Reiger (in the short story \"How Does Your Garden Grow?\"). Jewish characters are often seen as un-English (such as Oliver Manders in Three Act Tragedy), but they are rarely the culprits.\n\nOften, she is affectionate or teasing with her prejudices. After four years of war-torn London, Christie hoped to return some day to Syria, which she described as \"gentle fertile country and its simple people, who know how to laugh and how to enjoy life; who are idle and gay, and who have dignity, good manners, and a great sense of humour, and to whom death is not terrible.\"\n\nShe had trouble with an incompetent Swiss French nursery helper (Marcelle) for toddler Rosalind, and as a result she decided, \"Scottish preferred ... good with the young. The French were hopeless disciplinarians ... Germans good and methodical, but it was not German that I really wanted Rosalind to learn. The Irish were gay but made trouble in the house; the English were of all kinds\".\n\nNon-fiction writings\n\nChristie published relatively few nonfiction works:\n*Come, Tell Me How You Live, about working on an archaeological dig, drawn from her life with second husband Max Mallowan\n*The Grand Tour: Around the World with the Queen of Mystery, a collection of correspondence from her 1922 Grand Tour of the British empire, including South Africa, Australia, New Zealand, and Canada\n*Agatha Christie: An Autobiography, published posthumously in 1977\n\nCritical reception and legacy\n\nOften referred to as the \"Queen of Crime\" or \"Queen of Mystery\", Agatha Christie is the world's best-selling mystery writer and is considered a master of suspense, plotting, and characterisation. Some critics, however, have regarded Christie's plotting as superior to her skill with other literary elements. Novelist Raymond Chandler criticised her in his essay \"The Simple Art of Murder\", and American literary critic Edmund Wilson was dismissive of Christie and the detective fiction genre generally in his New Yorker essay, \"Who Cares Who Killed Roger Ackroyd?\"\n\nIn honour of the 125th anniversary of her birth, 25 contemporary mystery writers and one publisher revealed their views on Christie's works. Many of the authors read Christie's novels first, before other mystery writers, in English or in their native language, influencing their own writing, and nearly all still view her as the \"Queen of Crime\", and creator of the plot twists used by mystery authors. Nearly all had one or more favourites among Christie's mysteries, and find her books good to read now, nearly 100 years after her first novel was published. Several of the authors would be very pleased to have their own novels in print in 100 years. Just one of the 25 authors held with Edmund Wilson's views. Harper Collins also published a souvenir magazine Shocking Real Murders: Behind Her Classic Mysteries.[http://www.vowelor.com/book/shocking-real-murders-agatha-christie-review/ \"Shocking Real Murders\"] by Agatha Christie, Harper Collins\n\nThe Guinness Book of World Records lists Christie as the best-selling novelist of all time. Her novels have sold roughly 2 billion copies, and her estate claims that her works come third in the rankings of the world's most-widely published books, behind only Shakespeare's works and the Bible. Half of the sales are of English language editions, and the other half in translation. According to Index Translationum, she remains the most-translated individual author – having been translated into at least 103 languages. And Then There Were None is Christie's best-selling novel, with 100 million sales to date, making it the world's best-selling mystery ever, and one of the best-selling books of all time.\n\nIn 2012, Christie was among the British cultural icons selected by artist Sir Peter Blake to appear in a new version of his most famous artwork – the Beatles' Sgt. Pepper's Lonely Hearts Club Band album cover – to celebrate the British cultural figures of his life that he most admires.\n\nInterests and influences\n\nArchaeology\n\nChristie had a lifelong interest in archaeology. She met her second husband, Sir Max Mallowan, a distinguished archaeologist, on a trip to the excavation site at Ur in 1930. But her fame as an author far surpassed his fame in archaeology. Prior to meeting Mallowan, Christie had not had any extensive brushes with archaeology, but once the two married, they made sure to only go to sites where they could work together. Christie accompanied Mallowan on countless archaeological trips, spending 3–4 months at a time in Syria and Iraq at excavation sites at Ur, Nineveh, Tell Arpachiyah, Chagar Bazar, Tell Brak, and Nimrud. She wrote novels and short stories, but also contributed work to the archaeological sites, more specifically to the archaeological restoration and labelling of ancient exhibits, including tasks such as cleaning and conserving delicate ivory pieces, reconstructing pottery, developing photos from early excavations which later led to taking photographs of the site and its findings, and taking field notes.\n\nChristie would always pay for her own board and lodging and her travel expenses so as to not influence the funding of the archaeological excavations, and she also supported excavations as an anonymous sponsor. During their time in the Middle East, there was also a large amount of time spent travelling to and from Mallowan's sites. Their extensive travelling had a strong influence on her writing, as some type of transportation often plays a part in her murderer's schemes. The large amount of travel was reused in novels such as Murder on the Orient Express, as well as suggesting the idea of archaeology as an adventure itself.\n\nAfter the Second World War, she chronicled her time in Syria with fondness in Come Tell Me How You Live. Anecdotes, memories, funny episodes are strung in a rough timeline, with more emphasis on eccentric characters and lovely scenery than on factual accuracy. From 8 November 2001 to 24 March 2002, The British Museum had an exhibit named Agatha Christie and Archaeology: Mystery in Mesopotamia, which presented the life of Agatha Christie and the influences of archaeology in her life and works.\n\nUse of archaeology in her writing\n\nMany of the settings for Christie's books were directly inspired by the many archaeological field seasons spent in the Middle East on the sites managed by her husband Max. The extent of her time spent at the many locations featured in her books is apparent from the extreme detail in which she describes them. One such site featured in her work is the temple site of Abu Simbel, depicted in Death on the Nile. Also there is the great detail in which she describes life at the dig site in Murder in Mesopotamia. Among the characters in her books, Christie has often given prominence to the archaeologists and experts in Middle Eastern cultures and artifacts. Most notable are the characters of Dr. Eric Leidner in Murder in Mesopotamia and Signor Richetti in Death on the Nile, while many minor characters were archaeologists in They Came to Baghdad.\n\nSome of Christie's best known novels with heavy archaeological influences are:\n* Murder in Mesopotamia (1936) – the most archaeologically influenced of all her novels, as it is set in the Middle East at an archaeological dig site and associated expedition house. The main characters include archaeologist Dr. Eric Leidner, his wife, many specialists and assistants, and the men working on the site. The novel is noted most for its careful description of the dig site and house, which showed that the author had spent much of her time in very similar situations. The characters in this book in particular are also based on archaeologists whom Christie knew from her personal experiences on excavation sites.\n* Death on the Nile (1937) – takes place on a tour boat on the Nile. Many archaeological sites are visited along the way and one of the main characters, Signor Richetti, is an archaeologist.\n* Appointment with Death (1938) – set in Jerusalem and its surrounding area. The death itself occurs at an old cave site in Petra and offers some very descriptive details of sites which Christie herself could have visited in order to write the book.\n* They Came to Baghdad (1951) – inspired by Christie's own trips to Baghdad with Mallowan, and involves an archaeologist as the heroine's love interest.\n\nPortrayals in fiction\n\nChristie has been portrayed on a number of occasions in film and television. Several biographical programmes have been made, such as BBC television's Agatha Christie: A Life in Pictures (2004; in which she was portrayed by Olivia Williams, Anna Massey, and Bonnie Wright, at different stages in her life), and in Season 3, Episode 1 of ITV Perspectives: \"The Mystery of Agatha Christie\" (2013), hosted by David Suchet, who plays Hercule Poirot on television.\n\nChristie has also been portrayed fictionally. Some of these portrayals have explored and offered accounts of Christie's disappearance in 1926, including the film Agatha (1979) (with Vanessa Redgrave, in which she sneaks away to plan revenge against her husband), and the Doctor Who episode \"The Unicorn and the Wasp\" (17 May 2008), with Fenella Woolgar, in which her disappearance is the result of her suffering a temporary breakdown owing to a brief psychic link being formed between her and an alien wasp called the Vespiform. Others, such as Hungarian film, Kojak Budapesten (1980; not to be confused with the 1986 comedy by the same name) create their own scenarios involving Christie's criminal skill. In the TV play, Murder by the Book (1986), Christie herself (Dame Peggy Ashcroft) murdered one of her fictional-turned-real characters, Poirot. The heroine of Liar-Soft's visual novel Shikkoku no Sharnoth: What a Beautiful Tomorrow (2008), Mary Clarissa Christie, is based on the real-life Christie. Christie features as a character in Gaylord Larsen's Dorothy and Agatha and The London Blitz Murders by Max Allan Collins. A fictionalized account of Christie's disappearance is the central theme of a Korean musical, Agatha. A young Agatha Christie is depicted in the Spanish historical television series Grand Hotel (2011). Aiding the local detectives, Agatha finds inspiration to write her new novel. Agatha Christie. http://en.wikipedia.org/?curid=984."
  }
}
