{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2103",
  "eid" : "bdb38cf0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778398015,
  "textBody" : "The Atlanta Falcons are a professional American football team based in Atlanta. The Falcons compete in the National Football League (NFL) as a member club of the league's National Football Conference (NFC) South division.  The Falcons joined the NFL in 1965 as an expansion team, after the NFL offered then-owner Rankin Smith a franchise to keep him from joining the rival American Football League (AFL).\n\nIn their 51 years of existence, the Falcons have compiled a record of 350–450–6 (341–437–6 in the regular season and 9–13 in the playoffs), winning division championships in 1980, 1998, 2004, 2010, 2012, and 2016. The Falcons have appeared in two Super Bowls, the first being during the 1998 season in Super Bowl XXXIII, where they lost to the Denver Broncos 34–19, and the second being a 34–28 overtime defeat by the New England Patriots in Super Bowl LI.\n\nThe Falcons' current home field is Mercedes-Benz Stadium, which opened in time for the 2017 season; the team's headquarters and practice facilities are located at a 50-acre site in Flowery Branch, Georgia.\n\nFranchise history\n\nProfessional football comes to Atlanta\n\nProfessional football first came to Atlanta in 1962, when the American Football League staged two preseason contests, with one featuring the Denver Broncos vs. the Houston Oilers and the second pitting the Dallas Texans against the Oakland Raiders. Two years later, the AFL held another exhibition, this time with the New York Jets taking on the San Diego Chargers.\n\nIn 1965, after the Atlanta–Fulton County Stadium (then known simply as Atlanta Stadium) was built, the city of Atlanta felt the time was right to start pursuing professional football. One independent group which had been active in NFL exhibition promotions in Atlanta applied for franchises in both the American Football League and the National Football League, acting entirely on its own with no guarantee of stadium rights. Another group reported it had deposited earnest money for a team in the AFL.\n\nWith everyone running in different directions, some local businessmen worked out a deal and were awarded an AFL franchise on June 7, 1965, contingent upon acquiring exclusive stadium rights from city officials. NFL Commissioner Pete Rozelle, who had been moving slowly in Atlanta matters, was spurred by the AFL interest and headed on the next plane down to Atlanta to block the rival league's claim on the city of Atlanta. He forced the city to make a choice between the two leagues. By June 30, the city picked Rankin Smith and the NFL.\n\nThe Atlanta Falcons franchise began on June 30, 1965, when NFL Commissioner Pete Rozelle granted ownership to 41-year-old Rankin Smith Sr. Smith, an Executive Vice President of Life Insurance Company of Georgia at the time, paid $8.5 million the highest price in NFL history at the time for a franchise. Former commissioner Pete Rozelle and Smith made the deal in about five minutes and the Atlanta Falcons brought the largest and most popular sport to the city of Atlanta. The Atlanta expansion franchise became the 15th NFL franchise, and they were awarded the first pick in the 1966 NFL draft as well as the final pick in each of the first five rounds. The Falcons drafted All-American linebacker Tommy Nobis from the University of Texas with the first pick of the draft, making him the first-ever Falcon. The league also held the 1966 NFL Expansion Draft six weeks later in which the Falcons selected unprotected players from existing franchises. Although the Falcons selected many good players in those drafts, they still were not able to win right away.\n\nThe Atlanta Falcons Football Club received its nickname on August 29, 1965. Miss Julia Elliott, a school teacher from Griffin, Georgia, was singled out from many people who suggested \"Falcons\" as the nickname for the new franchise. Elliott wrote: \"the Falcon is proud and dignified, with great courage and fight. It never drops its prey. It is deadly and has a great sporting tradition.\"\n\n1966–1977: Early struggles\n\nThe Falcons had their first season in , and their first preseason game on August 1, 1966, losing to the Philadelphia Eagles. Under head coach Norb Hecker they lost their first nine regular-season games in 1966 and secured their first victory on the road against the New York Giants. The team finished the 1960s with only 12 wins. The Falcons had their first Monday Night Football game in Atlanta during the  season, losing 20–7 to the Miami Dolphins. The only two winning seasons in this twelve-year period were 1971 and 1973.\n\n1978–1989\n\nIn the 1978 season, the Falcons qualified for the playoffs for the first time and won the Wild Card game against the Eagles 14–13. The following week, they lost to the Dallas Cowboys 27–20 in the Divisional Playoffs.\n\nIn the 1980 season, after a nine-game winning streak, the Falcons posted a franchise then-best record of 12–4 and captured their first NFC West division title. The next week, their dream season ended at home with a loss to the Cowboys 30–27 in the divisional playoffs. In the strike-shortened 1982 season, the Falcons made the playoffs but lost to the Minnesota Vikings, 30–24. Falcons coach Leeman Bennett was fired after the loss. The team would then have losing seasons for the next eight years.\n\n1989–1996\n\nIn 1989, the Falcons drafted cornerback Deion Sanders in the first round, who helped them for the next four years, setting many records for the franchise. \"Neon Deion\" (a.k.a. \"Prime Time\") had a flashy appeal and helped bring media attention to one of the league's most anonymous franchises. Sanders was also famous for playing on major league baseball teams (the New York Yankees and the Atlanta Braves) while simultaneously playing in the NFL.\n\nAfter defeating the New Orleans Saints in the NFC Wild Card game, the Falcons' 1991 season ended in a divisional playoff loss to the Washington Redskins. In 1991, the Falcons drafted Brett Favre as the thirty-third overall pick. During his rookie season, he played in two games where he amassed a record of 4 passing attempts with 0 receptions and 2 interceptions. The following February, Favre was traded to the Green Bay Packers.\n\nIn 1992, the Atlanta Falcons opened a new chapter in their history moving into the newly constructed Georgia Dome, where the team has defeated all 31 other NFL teams at least during its time there.\n\n1997–2000: The Dan Reeves era\n\nIn 1998, under recently acquired head coach Dan Reeves, quarterback Chris Chandler and running back Jamal Anderson the \"Dirty Bird\" Falcons had their greatest season to date. On November 8, they beat the New England Patriots 41–10, ending a streak of 22 losses at cold-weather sites. The team finished with a franchise-best 14–2 regular season record and the NFC West division championship. On January 17, 1999, the Falcons upset the top-seeded Vikings at the Hubert H. Humphrey Metrodome in the NFC Championship Game 30–27, in an exciting overtime victory. However, in their first-ever Super Bowl appearance, they lost 34–19 to the defending champion Denver Broncos in Super Bowl XXXIII.\n\nIn the second game of the Falcons 1999 season, running back Jamal Anderson, who had been a key player in the Falcons' 1998 success, suffered a season-ending knee injury. The Falcons finished the season with a very disappointing 5–11 regular season record. In 2000, the Falcons suffered through another horrendous season finishing 4–12 and once again missing the playoffs.\n\n2001–2006\n\nIn the 2001 NFL draft, the Falcons orchestrated a trade with the San Diego Chargers, acquiring the first overall pick (which was used on quarterback Michael Vick) in exchange for wide receiver-return specialist Tim Dwight and the fifth overall pick (used on running back LaDainian Tomlinson).\n\nThe Falcons finished the 2001 season with a record of 7–9 and missed the playoffs. Jessie Tuggle retired following 14 seasons in Atlanta. On December 6, 2001, Arthur M. Blank reached a preliminary agreement with the Falcons' Taylor Smith to purchase the team. In a special meeting prior to Super Bowl XXXVI in New Orleans on February 2, 2002, NFL owners voted unanimously to approve the purchase.\n\nThe 2002 season saw the Falcons return to the playoffs with a regular season record of 9–6–1, tying the Pittsburgh Steelers. It was Vick's first year as the starter, and the team, with newly acquired running back Warrick Dunn, delivered the Green Bay Packers their first home playoff loss ever. A 20-6 loss to the Donovan McNabb-led Philadelphia Eagles the following week, however, ended the Falcons' season.\n\nOn March 19, 2003, the Falcons presented their new logo. During the 2003 preseason Vick broke his leg and missed the first twelve games of the season. After losing 7 straight games, the decision was made to release head coach Dan Reeves. Wade Phillips acted as interim coach for the final 3 games. Although the Falcons won 3 of their last 4 games after the return of Vick, they ended up with a 5–11 record that year. In 2004, a new head coach, Jim L. Mora, was hired and Vick returned for the full season. The Falcons went 11–5, winning their third division title and earning a first-round bye into the playoffs. In the divisional playoffs, the Falcons defeated the St. Louis Rams, 47–17, in the Georgia Dome, advancing to the NFC Championship Game, which they lost to the Eagles, 27–10.\n\nThe Falcons again fell short of achieving back-to-back winning seasons in , going 8–8. In , Michael Vick became the first quarterback in league history to rush for more than 1,000 yards in a season, with 1,039. After finishing the season 7–9, however, coach Jim Mora was dismissed and Bobby Petrino, the University of Louisville's football coach, replaced him. Before the 2007 season began, Vick was suspended indefinitely by the NFL after pleading guilty to charges involving dog fighting in the state of Virginia. On December 10, 2007, Vick received a 23-month prison sentence and was officially cut from the Atlanta roster.\n\n2007\n\nFor the 2007 season, the Falcons were forced to start Joey Harrington at quarterback. On December 11, 13 games into his first NFL season as head coach, Bobby Petrino resigned without notice to coach at the University of Arkansas, leaving the beleaguered players only a note in the locker room. Secondary Coach Emmitt Thomas was named interim coach for the final three games of the season on December 12. The Falcons ended the year with a dismal 4–12 record.\n\n2008–2014: The Mike Smith era\n\nAfter the tumultuous and disappointing 2007 season, the Falcons made a number of moves, hiring a new General Manager and head coach, drafting a new starting quarterback, and signing a starting running back.\n\nOn January 13, 2008, the Falcons named former Patriots director of college football scouting Thomas Dimitroff General Manager. On January 23, Jacksonville Jaguars defensive coach and former linebackers coach for the 2000 Super Bowl champion Baltimore Ravens Mike Smith was named the Falcons' new head coach. Chargers back-up RB Michael Turner agreed to a 6-year deal, $30 million deal on March 2. On April 26, Matt Ryan (quarterback from Boston College) was drafted third overall in the 2008 NFL draft by the Falcons.\n\n2008\n\nThe Falcons finished the 2008 regular season with a record of 11–5, and the #5 seed in the playoffs. On December 21, 2008, Atlanta beat the Minnesota Vikings 24–17 to clinch a wild card spot, earning a trip to the playoffs for the first time since 2004. The Falcons would go on to lose in the wild-card round of the 2008 NFL playoffs to the eventual NFC champion Arizona Cardinals, 30–24.\n\nMatt Ryan started all 16 games in his rookie season and was named the Associated Press Offensive Rookie of the Year. First-year head coach Mike Smith was named 2008 NFL Coach of the Year.\n\n2009\n\nAlthough they failed to make the playoffs in 2009 the team rallied to win their final three regular season games to record back-to-back winning seasons for the first time in franchise history. The Falcons defeated the Tampa Bay Buccaneers 20–10 in the final game of the season to improve their record to 9–7.\n\n2010\n\nIn 2010, with a regular season record of 13–3, the Falcons secured a third straight winning season, their fourth overall divisional title, and the top overall seed in the NFC playoffs; however, the Falcons were overpowered by the eventual Super Bowl XLV champion Green Bay Packers in the NFC Divisional Playoffs 48–21. The Falcons scored 414 points – the fifth-most in franchise history. The team sent an NFL-high and franchise-best nine players to the 2011 Pro Bowl.\n\n2011\n\nThe Falcons made a surprise trade up with the Cleveland Browns in the 2011 NFL draft to select Alabama wide receiver Julio Jones sixth overall. In exchange, the Falcons gave up their first-, second- and fourth-round draft picks in 2011, and their first and fourth draft picks in 2012. Jones, along with teammates Tony Gonzalez and Roddy White, have since been dubbed Atlanta's \"Big Three\" (based on their total number of reception yards). On August 30, 2011, Sports Illustrated senior writer Peter King, who correctly predicted the 2011 Super Bowl, made his predictions for the 2011 season and picked the Falcons to defeat the San Diego Chargers in the 2012 Super Bowl. The Falcons finished the season at 10–6, securing the fifth seed after a Week 17 beatdown of Tampa Bay in which the Falcons pulled their starters after leading 42–0 just 23 minutes into the game.\n\nThe Falcons then went on to play the New York Giants in a 2011 NFC Wild Card Game at MetLife Stadium in East Rutherford, New Jersey. The first half was a defensive struggle, with the first points coming off of a safety by the Falcons, giving Atlanta a 2–0 lead. In the 2nd quarter, though, Eli Manning connected with Hakeem Nicks for a short touchdown pass to make it 7–2 Giants heading into the 2nd half. Then the Giants took control, as Manning threw for two more TD passes to Mario Manningham and Nicks and the defense completed its shutout of the Falcons to give the New York Giants the win, 24–2, and the Falcons their third straight playoff loss with Matt Ryan and Mike Smith. After the season Defense Coordinator Brian VanGorder accepted a coaching job at Auburn University, and the offensive coordinator Mike Mularkey took the head coaching job in Jacksonville.\n\n2012\n\nAtlanta exploded out of the gate, going a franchise best 8–0 and remaining the last unbeaten team in the NFL that year. Their hopes to get an undefeated season came to an end with a 27–31 loss to the division rival Saints. Julio Jones had a remarkable second year, grabbing 10 touchdowns and 1,198 yards. The Falcons finished the season 13–3, and clinched the number one seed in the NFC playoffs.\n\nThe Falcons played the Seattle Seahawks in their first playoff game. Although they went down 28–27 with only 31 seconds left on the clock, Matt Ryan led the team to their first playoff victory, 30–28. It was the only playoff victory in the Mike Smith era.\n\nThe Atlanta Falcons then advanced to face the San Francisco 49ers. The Falcons seized control of the game early with a Matt Bryant field goal, a trio of Matt Ryan touchdown passes caught by Julio Jones and Tony Gonzalez coupled with outstanding defensive play. By the end of the half, the score was 24–14. The tides of the game began to shift in the second half as the 49ers rallied back with a pair of Frank Gore touchdown runs. Atlanta's offense attempted to reply but were ultimately shut down by the 49er defense. A few series later, late in the 4th quarter with little time remaining, Atlanta found themselves in a 4th and 4 situation at the 10-yard line. The Falcons needed just 10 more yards to secure victory and advance to their first Super Bowl berth in 14 years. Matt Ryan fired a pass to Roddy White which was ultimately broken up by inside linebacker NaVorro Bowman, resulting in a 28–24 defeat.\n\n2013\n\nFollowing the success of the previous season, the Falcons were an expected Super Bowl contender. However, injuries hampered the team's performance and the team finished the season 4–12. With that, the streak of consecutive winning seasons came to an end and Mike Smith had his first losing season as a head coach. Tony Gonzalez, in his final season in the NFL, was selected to the 2014 Pro Bowl as a starter representing Team Rice. Following the conclusion of the 2012 season, director of player personnel Les Snead departed the team to join the St. Louis Rams and Dave Caldwell, assistant to general manager Thomas Dimitroff, left the team to join the Jacksonville Jaguars. Scott Pioli, former GM of the New England Patriots, was announced as the Falcons' new assistant GM. Mike Smith was given a one-year extension on his contract as head coach. The Falcons had the 6th overall pick in the 2014 NFL draft with which they selected Jake Matthews, who played as offensive tackle for Texas A&M.\n\n2014\n\nDespite having another rough season, the Falcons still had an opportunity to qualify for the playoffs at the end of the regular season. The Falcons hosted the Carolina Panthers in their regular season finale, with the winners clinching the NFC South division. Unfortunately, the Falcons lost in a 34–3 blowout as Matt Ryan threw two interceptions that were returned for touchdowns and got sacked six times. The Falcons finished the season 6–10, marking the second consecutive losing season for the team. The following day, Mike Smith was fired after seven seasons as head coach. The Falcons would soon hire Seattle Seahawks defensive coordinator Dan Quinn as the team's 16th head coach. The Falcons had the 8th overall pick in the 2015 NFL draft with which they selected Vic Beasley, a defensive end from Clemson University.\n\n2015–present: The Dan Quinn era\n\n2015\n\nIn February 2015, the team was investigated by the NFL for alleged use of artificial crowd noise in the Georgia Dome. The Falcons lost a 2016 NFL Draft selection as a result of the league's investigation.\n\nDan Quinn's first season saw a 5–0 start, the team's best start in four years. They would then struggle throughout the rest of the season by losing 8 of their last 11 games, resulting in an 8–8 record. They did, however, give the Panthers their only regular season loss. The Falcons used their first-round pick in the 2016 NFL Draft on safety Keanu Neal from the University of Florida.\n\n2016\n\nIn the Falcons' 25th and final season in the Georgia Dome, Atlanta lost their Week 1 game to the Buccaneers 24–31. The Falcons would then win their next four including one over the Panthers, when the franchise set new records. Matt Ryan threw for 503 yards, and Julio Jones caught twelve passes for 300 yards. With a 41–13 thrashing of the San Francisco 49ers in Week 15, the Falcons improved to 9–5 and secured their first winning season since 2012. One week later, the Falcons defeated the Panthers in Charlotte, North Carolina and clinched their first NFC South division title since 2012. In their last regular season game at the Georgia Dome, the Falcons defeated the New Orleans Saints, and secured an 11–5 record and a first round bye.\n\nIn the divisional round of the playoffs, Atlanta defeated the Seahawks 36–20 in the Georgia Dome, and hosted their last game at the Dome against the Green Bay Packers in the NFC Championship Game on January 22, 2017. The Falcons defeated the Packers 44–21 to advance to Super Bowl LI as the NFC champions. Atlanta was up 28–3 late in the third quarter, and the New England Patriots scored 31 unanswered points, with the last 6 in the first-ever overtime in the Super Bowl. The Patriots' 25-point comeback was the largest in Super Bowl history.\n\nIn 2016, the Falcons scored 540 points in the regular season, the seventh-most in NFL history, tied with the Greatest Show on Turf (the 2000 St. Louis Rams). However, the Falcons defense gave up 406 points, 27th in the league.\n\n2017\n\nThe Falcons moved into their new home, the Mercedes-Benz Stadium, this season. Their first game ever played at the new stadium was a preseason loss to the Arizona Cardinals. The first regular season game at the new stadium was a rematch of the 2016–17 NFC Championship, with Atlanta defeating Green Bay 34–23. Their first loss of the season was a 23–17 home defeat to the Buffalo Bills in week 4. The team returned to the playoffs with a 10-6 record (albeit with a third-place finish in the NFC South). The Falcons defeated the Los Angeles Rams 26-13 in the Wild Card round, but their 2017 season came to an end a week later in the Divisional Playoff round at the hands of the eventual Super Bowl champion Philadelphia Eagles 15-10.\n\nStadiums\n\nThe Falcons have called three stadiums home in their 51 years of existence, and its third home in their history opened in the late summer of 2017. The first was the Atlanta–Fulton County Stadium, sharing with the Atlanta Braves Major League Baseball team until 1991. In 1992, the Georgia Dome was built, and the Falcons played there from its opening to the 2016 season. The Dome has been frequently used for college football, including Georgia State football and college bowl games such as the Peach Bowl.\n\nIn an effort to replace the aging Georgia Dome and potentially host a future Super Bowl, team owner Arthur Blank proposed a deal with the city of Atlanta to build a new state-of-the-art stadium not far from where the Georgia Dome is located. Blank will contribute $800 million and the city of Atlanta will contribute an additional $200 million via bonds backed by the city's hotel/motel tax towards the construction of a retractable roof stadium. Blank will contribute additional money for cost overruns if it is needed. The team will provide up to $50 million towards infrastructure costs that weren't included in the construction budget and to retire the remaining debt on the Georgia Dome. In addition, Blank's foundation and the city will each provide $15 million for development in surrounding neighborhoods. Though the total cost of the stadium was initially estimated to be around $1 billion, the total cost was revised to $1.5 billion according to Blank. In March 2013, the Atlanta City Council voted 11–4 in favor of building the stadium. The retractable roof Mercedes-Benz Stadium broke ground in May 2014, and became the third home stadium for the Falcons and the first for the new Atlanta United FC Major League Soccer club upon opening in 2017.\n\nLogo and uniforms\n\nThe Atlanta Falcons' colors are red, black, silver and white.  When the team debuted in 1966, the Falcons wore red helmets with a black falcon crest logo. In the center of the helmet was a center black stripe surrounded by two gold stripes and two white stripes. These colors represented the two college rival schools in the state of Georgia; rival schools Georgia Tech Yellow Jackets (White and Gold) and the Georgia Bulldogs (Red and Black). Although the gold was later taken out, the white remains to this day. They wore white pants and either black or white jerseys. At first, the falcon crest logo was also put on the jersey sleeves, but it was replaced by a red and white stripe pattern four years later. They switched from black to red jerseys in 1971, and the club began to wear silver pants in 1978.\n\nA prototype white helmet was developed for the team prior to the 1974 season but was never worn.\n\nIn 1990, the uniform design changed to black helmets, silver pants, and either black or white jerseys. The numbers on the white jerseys were black, but were changed to red in 1997. (The red numerals could be seen on the away jerseys briefly in 1990.)\n\nBoth the logo and uniforms changed in 2003. The logo was redesigned with red and silver accents to depict a more powerful, aggressive falcon, which now more closely resembles the capital letter F.\n\nAlthough the Falcons still wore black helmets, the new uniforms featured jerseys and pants with red trim down the sides. The uniform design consisted of either black or white jerseys, and either black or white pants. During that same year, a red alternate jersey with black trim was also introduced. The Falcons also started wearing black cleats with these uniforms.\n\nIn 2004, the red jerseys became the primary jerseys, and the black ones became the alternate, both worn with white pants. In select road games, the Falcons wear black pants with white jerseys. The Falcons wore an all-black combination for home games against their archrivals, the New Orleans Saints, winning the first two contests (24–21 in  and 36–17 in ), but losing 31–13 in . The Falcons wore the all black combination against the New Orleans Saints for four straight seasons starting in 2004, With the last time being in 2007, losing 34–14. They wore the combination again in 2006, against the Tampa Bay Buccaneers in Week 2. The Falcons won that game, 14–3. The Falcons also wore their all-black uniform in 2007 against the New York Giants, and in 2008 against the Carolina Panthers and against the Tampa Bay Buccaneers (for the second time).\n\nIn the 1980s, the Falcons wore their white uniforms at home most of the time because of the heat. When the Falcons started playing in a dome, the team switched to their dark uniforms for home games but have worn their white uniforms at home a few times since switching to the dome. It was announced at the 2009 state of the franchise meeting that the Falcons would wear 1966 throwback uniforms for a couple games during the 2009 season. The Atlanta Falcons wore 1966 throwback jerseys for two home games in 2009 – against the Carolina Panthers on September 20 and against the Tampa Bay Buccaneers on November 29. The Falcons won both of those games. They donned the throwbacks again for 2 games in 2010, against Baltimore and San Francisco, winning both of those games as well.\n\nRivalries\n\nNew Orleans Saints\n\nIn every season except for their debut season, the Falcons have shared a division with the New Orleans Saints (first the NFC West, and now the NFC South). Over this time, a heated rivalry has developed between the two cities' franchises. Atlanta leads the series 51–45.\n\nCarolina Panthers\n\nIn addition, the Falcons share a similar, yet smaller, rivalry with the Carolina Panthers, with both teams having been in the NFC West from the Panthers' founding in 1995 to the NFL realignment in 2002, where they have been in the NFC South since then. The Falcons lead the series 27–17.\n\nStatistics\n\nSeason-by-season records\n\nRecord vs. opponents\n\nIncludes postseason records\n\nSource:\n \n|-\n| St. Louis/Phoenix/Arizona Cardinals || 14 || 15 || 0 ||  || W 38–19 || November 27, 2016 || Georgia Dome || 0–1 postseason\n|-\n| Baltimore Ravens || 2 || 3 || 0 ||  || L 7–29 || October 19, 2014 || Baltimore, Maryland ||\n|-\n| Buffalo Bills || 7 || 5 || 0 ||  || L 17–23 || October 1, 2017 || Mercedes-Benz Stadium ||\n|-\n| Carolina Panthers || 28 || 18 || 0 ||  || W 22-10 || December 31, 2017 || Mercedes-Benz Stadium ||\n|-\n| Chicago Bears || 13 || 14 || 0 ||  || W 23–17 || September 10, 2017 || Chicago, Illinois ||\n|-\n| Cincinnati Bengals || 5 || 8 || 0 ||  || L 10–24 || September 14, 2014 || Cincinnati, Ohio ||\n|-\n| Cleveland Browns || 3 || 11 || 0 ||  || L 24–26 || November 23, 2014 || Georgia Dome ||\n|-\n| Dallas Cowboys || 11 || 14 || 0 ||  || W 27-7 || November 12, 2017 || Mercedes-Benz Stadium || 0–2 postseason\n|-\n| Denver Broncos || 6 || 8 || 0 ||  || W 23–16 || October 9, 2016 || Denver, Colorado || 0–1 postseason\n|-\n| Detroit Lions || 13 || 24 || 0 ||  || W 30-26 || September 24, 2017 || Detroit, Michigan ||\n|-\n| Green Bay Packers || 14 || 15 || 0 ||  || W 34–23 || September 17, 2017 || Mercedes-Benz Stadium || 2–2 postseason\n|-\n| Houston Texans || 2 || 2 || 0 ||  || W 48–21 || October 4, 2015 || Georgia Dome || \n|-\n| Baltimore/Indianapolis Colts || 2 || 14 || 0 ||  || L 21–24 || November 22, 2015 || Georgia Dome ||\n|-\n| Jacksonville Jaguars || 3 || 3 || 0 ||  || W 23–17 || December 20, 2015 || Jacksonville, Florida ||\n|-\n| Kansas City Chiefs || 3 || 6 || 0 ||  || L 28–29 || December 4, 2016 || Georgia Dome ||\n|-\n| San Diego/Los Angeles Chargers || 8 || 2 || 0 ||  || L 30–33 (OT) || October 23, 2016 || Georgia Dome ||\n|-\n| St. Louis/Los Angeles Rams || 29 || 47 || 2 ||  || W 26–13 || January 6, 2018 || Los Angeles, California || 2–0 postseason\n|-\n| Miami Dolphins || 4 || 9 || 0 ||  || L 17–20 || October 15, 2017 || Mercedes-Benz Stadium ||\n|-\n| Minnesota Vikings || 10 || 18 || 0 ||  || L 9–14 || December 3, 2017 || Mercedes-Benz Stadium || 1–1 postseason\n|-\n| New England Patriots || 6 || 9 || 0 ||  || L 7–23 || October 22, 2017 || Foxborough, Massachusetts || 0–1 postseason\n |-\n| New Orleans Saints || 51 || 46 || 0 ||  || L 13–23 || December 24, 2017 ||  Mercedes-Benz Superdome || 1–0 postseason\n|-\n| New York Giants || 12 || 11 || 0 ||  || W 24–20 || September 20, 2015 || East Rutherford, New Jersey || 0–1 postseason\n|-\n| New York Jets || 7 || 5 || 0 ||  || W 25–20 || October 29, 2017 || MetLife Stadium|East Rutherford, New Jersey ||\n|-\n| Los Angeles/Oakland Raiders || 7 || 7 || 0 ||  || W 35–28 || September 18, 2016 || Oakland, California ||\n|-\n| Philadelphia Eagles || 13 || 16 || 1 ||   || L 10–15 || January 13, 2018 || Philadelphia, Pennsylvania || 1–2 postseason\n|-\n| Pittsburgh Steelers || 2 || 13 || 1 ||  || L 20–27 || December 14, 2014 || Georgia Dome ||\n|-\n| San Francisco 49ers || 30 || 46 || 1 ||  || W 41–13 || December 18, 2016 || Georgia Dome || 1–1 postseason\n|-\n| Seattle Seahawks || 7 || 10 || 0 ||  || W 34–31 || November 20, 2017 || CenturyLink Field || 2–0 postseason\n|-\n| Tampa Bay Buccaneers || 25 || 24 || 0 ||  || W 24-21 || December 18, 2017 || Raymond James Stadium ||\n|-\n| Houston Oilers/Tennessee Titans || 7 || 7 || 0 ||  || W 10–7 || October 25, 2015 || Nashville, Tennessee ||\n|-\n| Washington Redskins || 9 || 14 || 1 ||  || W 25–19 (OT) || October 11, 2015 || Georgia Dome || 0–1 postseason\n|-\n! Total || 353 || 449 || 6 ||  || || || || 10–12 ()\n\n* *Notes International Series\n\nSingle game records\n\n*Rushing: Michael Turner, 220 (September 7, 2008)\n*Passing: Matt Ryan, 503 (October 2, 2016)\n*Passing touchdowns: Wade Wilson, 5 (December 13, 1992)\n*Receptions: William Andrews, 15 (September 15, 1981)\n*Receiving yards: Julio Jones, 300 (October 2, 2016)\n*Interceptions: Several Falcons, 2, most recently Robert Alford, 2 (October 2, 2016)\n*Field goals: Norm Johnson, 6 (November 13, 1994)\n*Total touchdowns: T. J. Duckett, 4 (December 12, 2004) and Michael Turner 4 (November 23, 2008)\n*Points scored: T. J. Duckett, 24 (December 12, 2004) and Michael Turner, 24 (November 23, 2008)\n*Sacks: Adrian Clayborn, 6 (November 13, 2017)\n\nSingle season records\n\n* Passing attempts: 651 Matt Ryan (2013)\n* Passing completions: 439 Matt Ryan (2013)\n* Passing yards: 4,944 Matt Ryan (2016)\n* Passing touchdowns: 38 Matt Ryan (2016)\n* Passing interceptions: 25 Bobby Hebert (1996)\n* Completion percentage: 69.9 Matt Ryan (2016)\n* Passing rating: 117.1 Matt Ryan (2016)\n* Rushing attempts: 410 Jamal Anderson (1998)\n* Rushing yards: 1,846 Jamal Anderson (1998)\n* Rushing touchdowns: 17 Michael Turner (2008)\n* Receiving catches: 136 Julio Jones (2015)\n* Receiving yards: 1,871 Julio Jones (2015)\n* Receiving touchdowns: 15 Andre Rison (1993)\n* Quarterback sacks: 16.5 John Abraham (2008)\n* Pass interceptions: 10 Scott Case (1988)\n* Field goal attempts: 40 Jay Feely (2002)\n* Field goals made: 34 Matt Bryant (2016)\n* Points: 158 Matt Bryant (2016)\n* Total touchdowns: 17 Michael Turner (2008)\n\nCareer records\n\n* Passing attempts: 5,064 Matt Ryan (2008–present)\n* Passing completions: 3,288 Matt Ryan (2008–present)\n* Passing yards: 37,701 Matt Ryan (2008–present)\n* Passing touchdowns: 240 Matt Ryan (2008–present)\n* Passing interceptions: 141 Steve Bartkowski (1975–85)\n* Passing rating: 93.6 Matt Ryan (2008–present)\n* Rushing attempts: 1,587 Gerald Riggs (1982–88)\n* Rushing yards: 6,631 Gerald Riggs (1982–88)\n* Rushing yards by a QB: 3,859 Michael Vick (2001–2006)\n* Rushing touchdowns: 60 Michael Turner (2008–2012)\n* Receiving catches: 808 Roddy White (2005–2015)\n* Receiving yards: 10,863 Roddy White (2005–2015)\n* Receiving touchdowns: 63 Roddy White (2005–2015)\n* Quarterback sacks: 68.5 John Abraham (2006–2012)\n* Pass interceptions: 39 Rolland Lawrence (1973–80)\n* Field goal attempts: 224 Morten Andersen (1995–2000, 2006–2007)\n* Field goals made: 196  Matt Bryant (2009–present)\n* Points: 892 Matt Bryant (2009–present)\n* Total touchdowns: 63 Roddy White (2005–2015)\n* Pass interception return yards: 658 Rolland Lawrence (1973–80)\n* Pass interception returned for touchdowns: 3 Deion Sanders (1989–1993) and Kevin Mathis (2002–2006)\n* Punt return yards: 1,723 Allen Rossum (2002–2006)\n* Kickoff return yards: 5,489 Allen Rossum (2002–2006)\n* Longest punt: 75 John James (1972–1981) and Harold Alexander (1993–1994)\n* Longest field goal: 59 Morten Andersen (1995–2000, 2006–2007) and Matt Bryant (2009–present)\n\nPlayers\n\nCurrent roster\n\nPro Football Hall of Famers\n\nSanders and Humphrey are the only two players in the Hall of Fame that have been inducted based substantially on their service with the Falcons. Andersen spent eight of his 25 NFL seasons with the Falcons, and remains the team's all-time scoring leader, but he also played his first 13 NFL seasons with the New Orleans Saints, also leading that team's career scoring list.\n\nRetired numbers\n\nRing of Honor\n\nThe Atlanta Falcons organization does not officially retire jersey numbers, but considers certain players' jerseys worthy of being honored. The Falcons Ring of Honor, which is featured in the rafters of the Georgia Dome, honors individual players.\n\nGeorgia Sports Hall of Fame\n\nStarting quarterbacks\n\nDraft history\n\nCoaching staff\n\nHead coaches\n\nIn their history, the Atlanta Falcons have had 15 head coaches.\n\nCurrent staff\n\nRadio and television\n\nFalcons' flagship radio station is WZGC 92.9 The Game. Wes Durham, son of longtime North Carolina Tar Heels voice Woody Durham, is the Falcons' play-by-play announcer, with former Atlanta Falcons QB and pro football veteran, Dave Archer serving as color commentator.\n\nIn 2014, The CW owned-and-operated station WUPA became the official television station of the Falcons, gaining rights to its preseason games, which are produced by CBS Sports.\n\nIn the regular season, the team's games are seen on Fox's O&O affiliate WAGA. When the Falcons challenge an AFC team, CBS affiliate WGCL will air those games while Sunday night games are televised on WXIA, the local NBC affiliate.\n\nRadio affiliates\n\nSource:\n\nGeorgia\n\nAlabama\n\nMississippi\n\nSouth Carolina\n\nTennessee",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Atlanta Falcons" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2103" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Atlanta Falcons are a professional American football team based in Atlanta. The Falcons compete in the National Football League (NFL) as a member club of the league's National Football Conference (NFC) South division.  The Falcons joined the NFL in 1965 as an expansion team, after the NFL offered then-owner Rankin Smith a franchise to keep him from joining the rival American Football League (AFL).\n\nIn their 51 years of existence, the Falcons have compiled a record of 350–450–6 (341–437–6 in the regular season and 9–13 in the playoffs), winning division championships in 1980, 1998, 2004, 2010, 2012, and 2016. The Falcons have appeared in two Super Bowls, the first being during the 1998 season in Super Bowl XXXIII, where they lost to the Denver Broncos 34–19, and the second being a 34–28 overtime defeat by the New England Patriots in Super Bowl LI.\n\nThe Falcons' current home field is Mercedes-Benz Stadium, which opened in time for the 2017 season; the team's headquarters and practice facilities are located at a 50-acre site in Flowery Branch, Georgia.\n\nFranchise history\n\nProfessional football comes to Atlanta\n\nProfessional football first came to Atlanta in 1962, when the American Football League staged two preseason contests, with one featuring the Denver Broncos vs. the Houston Oilers and the second pitting the Dallas Texans against the Oakland Raiders. Two years later, the AFL held another exhibition, this time with the New York Jets taking on the San Diego Chargers.\n\nIn 1965, after the Atlanta–Fulton County Stadium (then known simply as Atlanta Stadium) was built, the city of Atlanta felt the time was right to start pursuing professional football. One independent group which had been active in NFL exhibition promotions in Atlanta applied for franchises in both the American Football League and the National Football League, acting entirely on its own with no guarantee of stadium rights. Another group reported it had deposited earnest money for a team in the AFL.\n\nWith everyone running in different directions, some local businessmen worked out a deal and were awarded an AFL franchise on June 7, 1965, contingent upon acquiring exclusive stadium rights from city officials. NFL Commissioner Pete Rozelle, who had been moving slowly in Atlanta matters, was spurred by the AFL interest and headed on the next plane down to Atlanta to block the rival league's claim on the city of Atlanta. He forced the city to make a choice between the two leagues. By June 30, the city picked Rankin Smith and the NFL.\n\nThe Atlanta Falcons franchise began on June 30, 1965, when NFL Commissioner Pete Rozelle granted ownership to 41-year-old Rankin Smith Sr. Smith, an Executive Vice President of Life Insurance Company of Georgia at the time, paid $8.5 million the highest price in NFL history at the time for a franchise. Former commissioner Pete Rozelle and Smith made the deal in about five minutes and the Atlanta Falcons brought the largest and most popular sport to the city of Atlanta. The Atlanta expansion franchise became the 15th NFL franchise, and they were awarded the first pick in the 1966 NFL draft as well as the final pick in each of the first five rounds. The Falcons drafted All-American linebacker Tommy Nobis from the University of Texas with the first pick of the draft, making him the first-ever Falcon. The league also held the 1966 NFL Expansion Draft six weeks later in which the Falcons selected unprotected players from existing franchises. Although the Falcons selected many good players in those drafts, they still were not able to win right away.\n\nThe Atlanta Falcons Football Club received its nickname on August 29, 1965. Miss Julia Elliott, a school teacher from Griffin, Georgia, was singled out from many people who suggested \"Falcons\" as the nickname for the new franchise. Elliott wrote: \"the Falcon is proud and dignified, with great courage and fight. It never drops its prey. It is deadly and has a great sporting tradition.\"\n\n1966–1977: Early struggles\n\nThe Falcons had their first season in , and their first preseason game on August 1, 1966, losing to the Philadelphia Eagles. Under head coach Norb Hecker they lost their first nine regular-season games in 1966 and secured their first victory on the road against the New York Giants. The team finished the 1960s with only 12 wins. The Falcons had their first Monday Night Football game in Atlanta during the  season, losing 20–7 to the Miami Dolphins. The only two winning seasons in this twelve-year period were 1971 and 1973.\n\n1978–1989\n\nIn the 1978 season, the Falcons qualified for the playoffs for the first time and won the Wild Card game against the Eagles 14–13. The following week, they lost to the Dallas Cowboys 27–20 in the Divisional Playoffs.\n\nIn the 1980 season, after a nine-game winning streak, the Falcons posted a franchise then-best record of 12–4 and captured their first NFC West division title. The next week, their dream season ended at home with a loss to the Cowboys 30–27 in the divisional playoffs. In the strike-shortened 1982 season, the Falcons made the playoffs but lost to the Minnesota Vikings, 30–24. Falcons coach Leeman Bennett was fired after the loss. The team would then have losing seasons for the next eight years.\n\n1989–1996\n\nIn 1989, the Falcons drafted cornerback Deion Sanders in the first round, who helped them for the next four years, setting many records for the franchise. \"Neon Deion\" (a.k.a. \"Prime Time\") had a flashy appeal and helped bring media attention to one of the league's most anonymous franchises. Sanders was also famous for playing on major league baseball teams (the New York Yankees and the Atlanta Braves) while simultaneously playing in the NFL.\n\nAfter defeating the New Orleans Saints in the NFC Wild Card game, the Falcons' 1991 season ended in a divisional playoff loss to the Washington Redskins. In 1991, the Falcons drafted Brett Favre as the thirty-third overall pick. During his rookie season, he played in two games where he amassed a record of 4 passing attempts with 0 receptions and 2 interceptions. The following February, Favre was traded to the Green Bay Packers.\n\nIn 1992, the Atlanta Falcons opened a new chapter in their history moving into the newly constructed Georgia Dome, where the team has defeated all 31 other NFL teams at least during its time there.\n\n1997–2000: The Dan Reeves era\n\nIn 1998, under recently acquired head coach Dan Reeves, quarterback Chris Chandler and running back Jamal Anderson the \"Dirty Bird\" Falcons had their greatest season to date. On November 8, they beat the New England Patriots 41–10, ending a streak of 22 losses at cold-weather sites. The team finished with a franchise-best 14–2 regular season record and the NFC West division championship. On January 17, 1999, the Falcons upset the top-seeded Vikings at the Hubert H. Humphrey Metrodome in the NFC Championship Game 30–27, in an exciting overtime victory. However, in their first-ever Super Bowl appearance, they lost 34–19 to the defending champion Denver Broncos in Super Bowl XXXIII.\n\nIn the second game of the Falcons 1999 season, running back Jamal Anderson, who had been a key player in the Falcons' 1998 success, suffered a season-ending knee injury. The Falcons finished the season with a very disappointing 5–11 regular season record. In 2000, the Falcons suffered through another horrendous season finishing 4–12 and once again missing the playoffs.\n\n2001–2006\n\nIn the 2001 NFL draft, the Falcons orchestrated a trade with the San Diego Chargers, acquiring the first overall pick (which was used on quarterback Michael Vick) in exchange for wide receiver-return specialist Tim Dwight and the fifth overall pick (used on running back LaDainian Tomlinson).\n\nThe Falcons finished the 2001 season with a record of 7–9 and missed the playoffs. Jessie Tuggle retired following 14 seasons in Atlanta. On December 6, 2001, Arthur M. Blank reached a preliminary agreement with the Falcons' Taylor Smith to purchase the team. In a special meeting prior to Super Bowl XXXVI in New Orleans on February 2, 2002, NFL owners voted unanimously to approve the purchase.\n\nThe 2002 season saw the Falcons return to the playoffs with a regular season record of 9–6–1, tying the Pittsburgh Steelers. It was Vick's first year as the starter, and the team, with newly acquired running back Warrick Dunn, delivered the Green Bay Packers their first home playoff loss ever. A 20-6 loss to the Donovan McNabb-led Philadelphia Eagles the following week, however, ended the Falcons' season.\n\nOn March 19, 2003, the Falcons presented their new logo. During the 2003 preseason Vick broke his leg and missed the first twelve games of the season. After losing 7 straight games, the decision was made to release head coach Dan Reeves. Wade Phillips acted as interim coach for the final 3 games. Although the Falcons won 3 of their last 4 games after the return of Vick, they ended up with a 5–11 record that year. In 2004, a new head coach, Jim L. Mora, was hired and Vick returned for the full season. The Falcons went 11–5, winning their third division title and earning a first-round bye into the playoffs. In the divisional playoffs, the Falcons defeated the St. Louis Rams, 47–17, in the Georgia Dome, advancing to the NFC Championship Game, which they lost to the Eagles, 27–10.\n\nThe Falcons again fell short of achieving back-to-back winning seasons in , going 8–8. In , Michael Vick became the first quarterback in league history to rush for more than 1,000 yards in a season, with 1,039. After finishing the season 7–9, however, coach Jim Mora was dismissed and Bobby Petrino, the University of Louisville's football coach, replaced him. Before the 2007 season began, Vick was suspended indefinitely by the NFL after pleading guilty to charges involving dog fighting in the state of Virginia. On December 10, 2007, Vick received a 23-month prison sentence and was officially cut from the Atlanta roster.\n\n2007\n\nFor the 2007 season, the Falcons were forced to start Joey Harrington at quarterback. On December 11, 13 games into his first NFL season as head coach, Bobby Petrino resigned without notice to coach at the University of Arkansas, leaving the beleaguered players only a note in the locker room. Secondary Coach Emmitt Thomas was named interim coach for the final three games of the season on December 12. The Falcons ended the year with a dismal 4–12 record.\n\n2008–2014: The Mike Smith era\n\nAfter the tumultuous and disappointing 2007 season, the Falcons made a number of moves, hiring a new General Manager and head coach, drafting a new starting quarterback, and signing a starting running back.\n\nOn January 13, 2008, the Falcons named former Patriots director of college football scouting Thomas Dimitroff General Manager. On January 23, Jacksonville Jaguars defensive coach and former linebackers coach for the 2000 Super Bowl champion Baltimore Ravens Mike Smith was named the Falcons' new head coach. Chargers back-up RB Michael Turner agreed to a 6-year deal, $30 million deal on March 2. On April 26, Matt Ryan (quarterback from Boston College) was drafted third overall in the 2008 NFL draft by the Falcons.\n\n2008\n\nThe Falcons finished the 2008 regular season with a record of 11–5, and the #5 seed in the playoffs. On December 21, 2008, Atlanta beat the Minnesota Vikings 24–17 to clinch a wild card spot, earning a trip to the playoffs for the first time since 2004. The Falcons would go on to lose in the wild-card round of the 2008 NFL playoffs to the eventual NFC champion Arizona Cardinals, 30–24.\n\nMatt Ryan started all 16 games in his rookie season and was named the Associated Press Offensive Rookie of the Year. First-year head coach Mike Smith was named 2008 NFL Coach of the Year.\n\n2009\n\nAlthough they failed to make the playoffs in 2009 the team rallied to win their final three regular season games to record back-to-back winning seasons for the first time in franchise history. The Falcons defeated the Tampa Bay Buccaneers 20–10 in the final game of the season to improve their record to 9–7.\n\n2010\n\nIn 2010, with a regular season record of 13–3, the Falcons secured a third straight winning season, their fourth overall divisional title, and the top overall seed in the NFC playoffs; however, the Falcons were overpowered by the eventual Super Bowl XLV champion Green Bay Packers in the NFC Divisional Playoffs 48–21. The Falcons scored 414 points – the fifth-most in franchise history. The team sent an NFL-high and franchise-best nine players to the 2011 Pro Bowl.\n\n2011\n\nThe Falcons made a surprise trade up with the Cleveland Browns in the 2011 NFL draft to select Alabama wide receiver Julio Jones sixth overall. In exchange, the Falcons gave up their first-, second- and fourth-round draft picks in 2011, and their first and fourth draft picks in 2012. Jones, along with teammates Tony Gonzalez and Roddy White, have since been dubbed Atlanta's \"Big Three\" (based on their total number of reception yards). On August 30, 2011, Sports Illustrated senior writer Peter King, who correctly predicted the 2011 Super Bowl, made his predictions for the 2011 season and picked the Falcons to defeat the San Diego Chargers in the 2012 Super Bowl. The Falcons finished the season at 10–6, securing the fifth seed after a Week 17 beatdown of Tampa Bay in which the Falcons pulled their starters after leading 42–0 just 23 minutes into the game.\n\nThe Falcons then went on to play the New York Giants in a 2011 NFC Wild Card Game at MetLife Stadium in East Rutherford, New Jersey. The first half was a defensive struggle, with the first points coming off of a safety by the Falcons, giving Atlanta a 2–0 lead. In the 2nd quarter, though, Eli Manning connected with Hakeem Nicks for a short touchdown pass to make it 7–2 Giants heading into the 2nd half. Then the Giants took control, as Manning threw for two more TD passes to Mario Manningham and Nicks and the defense completed its shutout of the Falcons to give the New York Giants the win, 24–2, and the Falcons their third straight playoff loss with Matt Ryan and Mike Smith. After the season Defense Coordinator Brian VanGorder accepted a coaching job at Auburn University, and the offensive coordinator Mike Mularkey took the head coaching job in Jacksonville.\n\n2012\n\nAtlanta exploded out of the gate, going a franchise best 8–0 and remaining the last unbeaten team in the NFL that year. Their hopes to get an undefeated season came to an end with a 27–31 loss to the division rival Saints. Julio Jones had a remarkable second year, grabbing 10 touchdowns and 1,198 yards. The Falcons finished the season 13–3, and clinched the number one seed in the NFC playoffs.\n\nThe Falcons played the Seattle Seahawks in their first playoff game. Although they went down 28–27 with only 31 seconds left on the clock, Matt Ryan led the team to their first playoff victory, 30–28. It was the only playoff victory in the Mike Smith era.\n\nThe Atlanta Falcons then advanced to face the San Francisco 49ers. The Falcons seized control of the game early with a Matt Bryant field goal, a trio of Matt Ryan touchdown passes caught by Julio Jones and Tony Gonzalez coupled with outstanding defensive play. By the end of the half, the score was 24–14. The tides of the game began to shift in the second half as the 49ers rallied back with a pair of Frank Gore touchdown runs. Atlanta's offense attempted to reply but were ultimately shut down by the 49er defense. A few series later, late in the 4th quarter with little time remaining, Atlanta found themselves in a 4th and 4 situation at the 10-yard line. The Falcons needed just 10 more yards to secure victory and advance to their first Super Bowl berth in 14 years. Matt Ryan fired a pass to Roddy White which was ultimately broken up by inside linebacker NaVorro Bowman, resulting in a 28–24 defeat.\n\n2013\n\nFollowing the success of the previous season, the Falcons were an expected Super Bowl contender. However, injuries hampered the team's performance and the team finished the season 4–12. With that, the streak of consecutive winning seasons came to an end and Mike Smith had his first losing season as a head coach. Tony Gonzalez, in his final season in the NFL, was selected to the 2014 Pro Bowl as a starter representing Team Rice. Following the conclusion of the 2012 season, director of player personnel Les Snead departed the team to join the St. Louis Rams and Dave Caldwell, assistant to general manager Thomas Dimitroff, left the team to join the Jacksonville Jaguars. Scott Pioli, former GM of the New England Patriots, was announced as the Falcons' new assistant GM. Mike Smith was given a one-year extension on his contract as head coach. The Falcons had the 6th overall pick in the 2014 NFL draft with which they selected Jake Matthews, who played as offensive tackle for Texas A&M.\n\n2014\n\nDespite having another rough season, the Falcons still had an opportunity to qualify for the playoffs at the end of the regular season. The Falcons hosted the Carolina Panthers in their regular season finale, with the winners clinching the NFC South division. Unfortunately, the Falcons lost in a 34–3 blowout as Matt Ryan threw two interceptions that were returned for touchdowns and got sacked six times. The Falcons finished the season 6–10, marking the second consecutive losing season for the team. The following day, Mike Smith was fired after seven seasons as head coach. The Falcons would soon hire Seattle Seahawks defensive coordinator Dan Quinn as the team's 16th head coach. The Falcons had the 8th overall pick in the 2015 NFL draft with which they selected Vic Beasley, a defensive end from Clemson University.\n\n2015–present: The Dan Quinn era\n\n2015\n\nIn February 2015, the team was investigated by the NFL for alleged use of artificial crowd noise in the Georgia Dome. The Falcons lost a 2016 NFL Draft selection as a result of the league's investigation.\n\nDan Quinn's first season saw a 5–0 start, the team's best start in four years. They would then struggle throughout the rest of the season by losing 8 of their last 11 games, resulting in an 8–8 record. They did, however, give the Panthers their only regular season loss. The Falcons used their first-round pick in the 2016 NFL Draft on safety Keanu Neal from the University of Florida.\n\n2016\n\nIn the Falcons' 25th and final season in the Georgia Dome, Atlanta lost their Week 1 game to the Buccaneers 24–31. The Falcons would then win their next four including one over the Panthers, when the franchise set new records. Matt Ryan threw for 503 yards, and Julio Jones caught twelve passes for 300 yards. With a 41–13 thrashing of the San Francisco 49ers in Week 15, the Falcons improved to 9–5 and secured their first winning season since 2012. One week later, the Falcons defeated the Panthers in Charlotte, North Carolina and clinched their first NFC South division title since 2012. In their last regular season game at the Georgia Dome, the Falcons defeated the New Orleans Saints, and secured an 11–5 record and a first round bye.\n\nIn the divisional round of the playoffs, Atlanta defeated the Seahawks 36–20 in the Georgia Dome, and hosted their last game at the Dome against the Green Bay Packers in the NFC Championship Game on January 22, 2017. The Falcons defeated the Packers 44–21 to advance to Super Bowl LI as the NFC champions. Atlanta was up 28–3 late in the third quarter, and the New England Patriots scored 31 unanswered points, with the last 6 in the first-ever overtime in the Super Bowl. The Patriots' 25-point comeback was the largest in Super Bowl history.\n\nIn 2016, the Falcons scored 540 points in the regular season, the seventh-most in NFL history, tied with the Greatest Show on Turf (the 2000 St. Louis Rams). However, the Falcons defense gave up 406 points, 27th in the league.\n\n2017\n\nThe Falcons moved into their new home, the Mercedes-Benz Stadium, this season. Their first game ever played at the new stadium was a preseason loss to the Arizona Cardinals. The first regular season game at the new stadium was a rematch of the 2016–17 NFC Championship, with Atlanta defeating Green Bay 34–23. Their first loss of the season was a 23–17 home defeat to the Buffalo Bills in week 4. The team returned to the playoffs with a 10-6 record (albeit with a third-place finish in the NFC South). The Falcons defeated the Los Angeles Rams 26-13 in the Wild Card round, but their 2017 season came to an end a week later in the Divisional Playoff round at the hands of the eventual Super Bowl champion Philadelphia Eagles 15-10.\n\nStadiums\n\nThe Falcons have called three stadiums home in their 51 years of existence, and its third home in their history opened in the late summer of 2017. The first was the Atlanta–Fulton County Stadium, sharing with the Atlanta Braves Major League Baseball team until 1991. In 1992, the Georgia Dome was built, and the Falcons played there from its opening to the 2016 season. The Dome has been frequently used for college football, including Georgia State football and college bowl games such as the Peach Bowl.\n\nIn an effort to replace the aging Georgia Dome and potentially host a future Super Bowl, team owner Arthur Blank proposed a deal with the city of Atlanta to build a new state-of-the-art stadium not far from where the Georgia Dome is located. Blank will contribute $800 million and the city of Atlanta will contribute an additional $200 million via bonds backed by the city's hotel/motel tax towards the construction of a retractable roof stadium. Blank will contribute additional money for cost overruns if it is needed. The team will provide up to $50 million towards infrastructure costs that weren't included in the construction budget and to retire the remaining debt on the Georgia Dome. In addition, Blank's foundation and the city will each provide $15 million for development in surrounding neighborhoods. Though the total cost of the stadium was initially estimated to be around $1 billion, the total cost was revised to $1.5 billion according to Blank. In March 2013, the Atlanta City Council voted 11–4 in favor of building the stadium. The retractable roof Mercedes-Benz Stadium broke ground in May 2014, and became the third home stadium for the Falcons and the first for the new Atlanta United FC Major League Soccer club upon opening in 2017.\n\nLogo and uniforms\n\nThe Atlanta Falcons' colors are red, black, silver and white.  When the team debuted in 1966, the Falcons wore red helmets with a black falcon crest logo. In the center of the helmet was a center black stripe surrounded by two gold stripes and two white stripes. These colors represented the two college rival schools in the state of Georgia; rival schools Georgia Tech Yellow Jackets (White and Gold) and the Georgia Bulldogs (Red and Black). Although the gold was later taken out, the white remains to this day. They wore white pants and either black or white jerseys. At first, the falcon crest logo was also put on the jersey sleeves, but it was replaced by a red and white stripe pattern four years later. They switched from black to red jerseys in 1971, and the club began to wear silver pants in 1978.\n\nA prototype white helmet was developed for the team prior to the 1974 season but was never worn.\n\nIn 1990, the uniform design changed to black helmets, silver pants, and either black or white jerseys. The numbers on the white jerseys were black, but were changed to red in 1997. (The red numerals could be seen on the away jerseys briefly in 1990.)\n\nBoth the logo and uniforms changed in 2003. The logo was redesigned with red and silver accents to depict a more powerful, aggressive falcon, which now more closely resembles the capital letter F.\n\nAlthough the Falcons still wore black helmets, the new uniforms featured jerseys and pants with red trim down the sides. The uniform design consisted of either black or white jerseys, and either black or white pants. During that same year, a red alternate jersey with black trim was also introduced. The Falcons also started wearing black cleats with these uniforms.\n\nIn 2004, the red jerseys became the primary jerseys, and the black ones became the alternate, both worn with white pants. In select road games, the Falcons wear black pants with white jerseys. The Falcons wore an all-black combination for home games against their archrivals, the New Orleans Saints, winning the first two contests (24–21 in  and 36–17 in ), but losing 31–13 in . The Falcons wore the all black combination against the New Orleans Saints for four straight seasons starting in 2004, With the last time being in 2007, losing 34–14. They wore the combination again in 2006, against the Tampa Bay Buccaneers in Week 2. The Falcons won that game, 14–3. The Falcons also wore their all-black uniform in 2007 against the New York Giants, and in 2008 against the Carolina Panthers and against the Tampa Bay Buccaneers (for the second time).\n\nIn the 1980s, the Falcons wore their white uniforms at home most of the time because of the heat. When the Falcons started playing in a dome, the team switched to their dark uniforms for home games but have worn their white uniforms at home a few times since switching to the dome. It was announced at the 2009 state of the franchise meeting that the Falcons would wear 1966 throwback uniforms for a couple games during the 2009 season. The Atlanta Falcons wore 1966 throwback jerseys for two home games in 2009 – against the Carolina Panthers on September 20 and against the Tampa Bay Buccaneers on November 29. The Falcons won both of those games. They donned the throwbacks again for 2 games in 2010, against Baltimore and San Francisco, winning both of those games as well.\n\nRivalries\n\nNew Orleans Saints\n\nIn every season except for their debut season, the Falcons have shared a division with the New Orleans Saints (first the NFC West, and now the NFC South). Over this time, a heated rivalry has developed between the two cities' franchises. Atlanta leads the series 51–45.\n\nCarolina Panthers\n\nIn addition, the Falcons share a similar, yet smaller, rivalry with the Carolina Panthers, with both teams having been in the NFC West from the Panthers' founding in 1995 to the NFL realignment in 2002, where they have been in the NFC South since then. The Falcons lead the series 27–17.\n\nStatistics\n\nSeason-by-season records\n\nRecord vs. opponents\n\nIncludes postseason records\n\nSource:\n \n|-\n| St. Louis/Phoenix/Arizona Cardinals || 14 || 15 || 0 ||  || W 38–19 || November 27, 2016 || Georgia Dome || 0–1 postseason\n|-\n| Baltimore Ravens || 2 || 3 || 0 ||  || L 7–29 || October 19, 2014 || Baltimore, Maryland ||\n|-\n| Buffalo Bills || 7 || 5 || 0 ||  || L 17–23 || October 1, 2017 || Mercedes-Benz Stadium ||\n|-\n| Carolina Panthers || 28 || 18 || 0 ||  || W 22-10 || December 31, 2017 || Mercedes-Benz Stadium ||\n|-\n| Chicago Bears || 13 || 14 || 0 ||  || W 23–17 || September 10, 2017 || Chicago, Illinois ||\n|-\n| Cincinnati Bengals || 5 || 8 || 0 ||  || L 10–24 || September 14, 2014 || Cincinnati, Ohio ||\n|-\n| Cleveland Browns || 3 || 11 || 0 ||  || L 24–26 || November 23, 2014 || Georgia Dome ||\n|-\n| Dallas Cowboys || 11 || 14 || 0 ||  || W 27-7 || November 12, 2017 || Mercedes-Benz Stadium || 0–2 postseason\n|-\n| Denver Broncos || 6 || 8 || 0 ||  || W 23–16 || October 9, 2016 || Denver, Colorado || 0–1 postseason\n|-\n| Detroit Lions || 13 || 24 || 0 ||  || W 30-26 || September 24, 2017 || Detroit, Michigan ||\n|-\n| Green Bay Packers || 14 || 15 || 0 ||  || W 34–23 || September 17, 2017 || Mercedes-Benz Stadium || 2–2 postseason\n|-\n| Houston Texans || 2 || 2 || 0 ||  || W 48–21 || October 4, 2015 || Georgia Dome || \n|-\n| Baltimore/Indianapolis Colts || 2 || 14 || 0 ||  || L 21–24 || November 22, 2015 || Georgia Dome ||\n|-\n| Jacksonville Jaguars || 3 || 3 || 0 ||  || W 23–17 || December 20, 2015 || Jacksonville, Florida ||\n|-\n| Kansas City Chiefs || 3 || 6 || 0 ||  || L 28–29 || December 4, 2016 || Georgia Dome ||\n|-\n| San Diego/Los Angeles Chargers || 8 || 2 || 0 ||  || L 30–33 (OT) || October 23, 2016 || Georgia Dome ||\n|-\n| St. Louis/Los Angeles Rams || 29 || 47 || 2 ||  || W 26–13 || January 6, 2018 || Los Angeles, California || 2–0 postseason\n|-\n| Miami Dolphins || 4 || 9 || 0 ||  || L 17–20 || October 15, 2017 || Mercedes-Benz Stadium ||\n|-\n| Minnesota Vikings || 10 || 18 || 0 ||  || L 9–14 || December 3, 2017 || Mercedes-Benz Stadium || 1–1 postseason\n|-\n| New England Patriots || 6 || 9 || 0 ||  || L 7–23 || October 22, 2017 || Foxborough, Massachusetts || 0–1 postseason\n |-\n| New Orleans Saints || 51 || 46 || 0 ||  || L 13–23 || December 24, 2017 ||  Mercedes-Benz Superdome || 1–0 postseason\n|-\n| New York Giants || 12 || 11 || 0 ||  || W 24–20 || September 20, 2015 || East Rutherford, New Jersey || 0–1 postseason\n|-\n| New York Jets || 7 || 5 || 0 ||  || W 25–20 || October 29, 2017 || MetLife Stadium|East Rutherford, New Jersey ||\n|-\n| Los Angeles/Oakland Raiders || 7 || 7 || 0 ||  || W 35–28 || September 18, 2016 || Oakland, California ||\n|-\n| Philadelphia Eagles || 13 || 16 || 1 ||   || L 10–15 || January 13, 2018 || Philadelphia, Pennsylvania || 1–2 postseason\n|-\n| Pittsburgh Steelers || 2 || 13 || 1 ||  || L 20–27 || December 14, 2014 || Georgia Dome ||\n|-\n| San Francisco 49ers || 30 || 46 || 1 ||  || W 41–13 || December 18, 2016 || Georgia Dome || 1–1 postseason\n|-\n| Seattle Seahawks || 7 || 10 || 0 ||  || W 34–31 || November 20, 2017 || CenturyLink Field || 2–0 postseason\n|-\n| Tampa Bay Buccaneers || 25 || 24 || 0 ||  || W 24-21 || December 18, 2017 || Raymond James Stadium ||\n|-\n| Houston Oilers/Tennessee Titans || 7 || 7 || 0 ||  || W 10–7 || October 25, 2015 || Nashville, Tennessee ||\n|-\n| Washington Redskins || 9 || 14 || 1 ||  || W 25–19 (OT) || October 11, 2015 || Georgia Dome || 0–1 postseason\n|-\n! Total || 353 || 449 || 6 ||  || || || || 10–12 ()\n\n* *Notes International Series\n\nSingle game records\n\n*Rushing: Michael Turner, 220 (September 7, 2008)\n*Passing: Matt Ryan, 503 (October 2, 2016)\n*Passing touchdowns: Wade Wilson, 5 (December 13, 1992)\n*Receptions: William Andrews, 15 (September 15, 1981)\n*Receiving yards: Julio Jones, 300 (October 2, 2016)\n*Interceptions: Several Falcons, 2, most recently Robert Alford, 2 (October 2, 2016)\n*Field goals: Norm Johnson, 6 (November 13, 1994)\n*Total touchdowns: T. J. Duckett, 4 (December 12, 2004) and Michael Turner 4 (November 23, 2008)\n*Points scored: T. J. Duckett, 24 (December 12, 2004) and Michael Turner, 24 (November 23, 2008)\n*Sacks: Adrian Clayborn, 6 (November 13, 2017)\n\nSingle season records\n\n* Passing attempts: 651 Matt Ryan (2013)\n* Passing completions: 439 Matt Ryan (2013)\n* Passing yards: 4,944 Matt Ryan (2016)\n* Passing touchdowns: 38 Matt Ryan (2016)\n* Passing interceptions: 25 Bobby Hebert (1996)\n* Completion percentage: 69.9 Matt Ryan (2016)\n* Passing rating: 117.1 Matt Ryan (2016)\n* Rushing attempts: 410 Jamal Anderson (1998)\n* Rushing yards: 1,846 Jamal Anderson (1998)\n* Rushing touchdowns: 17 Michael Turner (2008)\n* Receiving catches: 136 Julio Jones (2015)\n* Receiving yards: 1,871 Julio Jones (2015)\n* Receiving touchdowns: 15 Andre Rison (1993)\n* Quarterback sacks: 16.5 John Abraham (2008)\n* Pass interceptions: 10 Scott Case (1988)\n* Field goal attempts: 40 Jay Feely (2002)\n* Field goals made: 34 Matt Bryant (2016)\n* Points: 158 Matt Bryant (2016)\n* Total touchdowns: 17 Michael Turner (2008)\n\nCareer records\n\n* Passing attempts: 5,064 Matt Ryan (2008–present)\n* Passing completions: 3,288 Matt Ryan (2008–present)\n* Passing yards: 37,701 Matt Ryan (2008–present)\n* Passing touchdowns: 240 Matt Ryan (2008–present)\n* Passing interceptions: 141 Steve Bartkowski (1975–85)\n* Passing rating: 93.6 Matt Ryan (2008–present)\n* Rushing attempts: 1,587 Gerald Riggs (1982–88)\n* Rushing yards: 6,631 Gerald Riggs (1982–88)\n* Rushing yards by a QB: 3,859 Michael Vick (2001–2006)\n* Rushing touchdowns: 60 Michael Turner (2008–2012)\n* Receiving catches: 808 Roddy White (2005–2015)\n* Receiving yards: 10,863 Roddy White (2005–2015)\n* Receiving touchdowns: 63 Roddy White (2005–2015)\n* Quarterback sacks: 68.5 John Abraham (2006–2012)\n* Pass interceptions: 39 Rolland Lawrence (1973–80)\n* Field goal attempts: 224 Morten Andersen (1995–2000, 2006–2007)\n* Field goals made: 196  Matt Bryant (2009–present)\n* Points: 892 Matt Bryant (2009–present)\n* Total touchdowns: 63 Roddy White (2005–2015)\n* Pass interception return yards: 658 Rolland Lawrence (1973–80)\n* Pass interception returned for touchdowns: 3 Deion Sanders (1989–1993) and Kevin Mathis (2002–2006)\n* Punt return yards: 1,723 Allen Rossum (2002–2006)\n* Kickoff return yards: 5,489 Allen Rossum (2002–2006)\n* Longest punt: 75 John James (1972–1981) and Harold Alexander (1993–1994)\n* Longest field goal: 59 Morten Andersen (1995–2000, 2006–2007) and Matt Bryant (2009–present)\n\nPlayers\n\nCurrent roster\n\nPro Football Hall of Famers\n\nSanders and Humphrey are the only two players in the Hall of Fame that have been inducted based substantially on their service with the Falcons. Andersen spent eight of his 25 NFL seasons with the Falcons, and remains the team's all-time scoring leader, but he also played his first 13 NFL seasons with the New Orleans Saints, also leading that team's career scoring list.\n\nRetired numbers\n\nRing of Honor\n\nThe Atlanta Falcons organization does not officially retire jersey numbers, but considers certain players' jerseys worthy of being honored. The Falcons Ring of Honor, which is featured in the rafters of the Georgia Dome, honors individual players.\n\nGeorgia Sports Hall of Fame\n\nStarting quarterbacks\n\nDraft history\n\nCoaching staff\n\nHead coaches\n\nIn their history, the Atlanta Falcons have had 15 head coaches.\n\nCurrent staff\n\nRadio and television\n\nFalcons' flagship radio station is WZGC 92.9 The Game. Wes Durham, son of longtime North Carolina Tar Heels voice Woody Durham, is the Falcons' play-by-play announcer, with former Atlanta Falcons QB and pro football veteran, Dave Archer serving as color commentator.\n\nIn 2014, The CW owned-and-operated station WUPA became the official television station of the Falcons, gaining rights to its preseason games, which are produced by CBS Sports.\n\nIn the regular season, the team's games are seen on Fox's O&O affiliate WAGA. When the Falcons challenge an AFC team, CBS affiliate WGCL will air those games while Sunday night games are televised on WXIA, the local NBC affiliate.\n\nRadio affiliates\n\nSource:\n\nGeorgia\n\nAlabama\n\nMississippi\n\nSouth Carolina\n\nTennessee. Atlanta Falcons. http://en.wikipedia.org/?curid=2103."
  }
}
