{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16518",
  "eid" : "266994b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778573691,
  "textBody" : "John Coolidge Adams (born February 15, 1947) is an American composer of classical music and opera, with strong roots in minimalism.\n\nHis works include Harmonielehre (1985), Short Ride in a Fast Machine (1986), On the Transmigration of Souls (2002), a choral piece commemorating the victims of the September 11, 2001 attacks (for which he won the Pulitzer Prize for Music in 2003), and Shaker Loops (1978), a minimalist four-movement work for strings.\n\nHis operas include Nixon in China (1987), which recounts Richard Nixon's 1972 visit to China, and Doctor Atomic (2005), which covers Robert Oppenheimer, the Manhattan Project, and the building of the first atomic bomb.\n\nThe Death of Klinghoffer is an opera for which he wrote the music, based on the hijacking of the passenger liner Achille Lauro by the Palestine Liberation Front in 1985, and the hijackers' murder of wheelchair-bound 69-year-old Jewish-American passenger Leon Klinghoffer. The opera has drawn controversy, including allegations by some (including Klinghoffer's two daughters) that the opera is antisemitic and glorifies terrorism. The work's creators and others have disputed these criticisms.\n\nLife and career\n\nBefore 1977\n\nJohn Coolidge Adams was born in Worcester, Massachusetts, in 1947.Warrack and West, \"Adams, John\" The Oxford Dictionary of Opera, 782 pages,  p.4 He was raised in various New England states, where he was greatly influenced by New England's musical culture. He graduated from Concord High School in Concord, New Hampshire.\n\nAdams began composing at the age of ten and first heard his music performed around the age of 13 or 14. After he matriculated at Harvard University in 1965 he studied composition under Leon Kirchner, Roger Sessions, Earl Kim, and David Del Tredici. He studied at Harvard University (BA 1969, MA 1972). His piece \"American Standard\" was recorded and released on Obscure Records in 1975. He taught at the San Francisco Conservatory of Music from 1972 until 1984. He served as musical producer for a number of series for the Public Broadcasting System including the award-winning series, The Adams Chronicles in 1976 and 1977.\n\n1977 to Nixon in China\n\nSome works composed during this period include China Gates (1977), Phrygian Gates for solo piano (1977), Shaker Loops (1978), Common Tones in Simple Time (1979), Harmonium (1980–81), Grand Pianola Music (1982), Light Over Water (1983), Harmonielehre (1984–85), The Chairman Dances (1985), Short Ride in a Fast Machine (1986), and Nixon in China (1985–87).\n\nShaker Loops (for string septet) (1978): A \"modular\" composition for three violins, one viola, two cellos, and one bass, with a conductor. It is divided into four movements.\n\nHarmonium for large orchestra and chorus (1980–81): The piece starts with quietly insistent repetitions of one note – D – and one syllable – \"no\".\n\nGrand Pianola Music (1982): Adams commented, \"Dueling pianos, cooing sirens, Valhalla brass, thwacking bass drums, gospel triads, and a Niagara of cascading flat keys all learned to cohabit as I wrote the piece.\"Adams, John. Program Note, Grand Pianola Music Full Score, Associated Music Publishers, 1982.\n\nLight Over Water: The Genesis of Music (1983): This work was commissioned by the Museum of Contemporary Art in Los Angeles as the score for the collaborative work Available Light, which was choreographed by Lucinda Childs and had a set design by architect Frank Gehry.\n\nHarmonielehre (1984–85): Inspired by a dream of an oil tanker taking flight out of San Francisco Bay and also by Arnold Schoenberg's book, Harmonielehre (Theory of Harmony). This piece is also about harmony of the mind.\n\nThe Chairman Dances (Foxtrot for Orchestra) (1985): This is a by-product of Nixon in China, set in the three days of President Nixon's visit to Beijing in February 1972.\n\nShort Ride in a Fast Machine (Fanfare for Great Woods) (1986): This piece is joyfully exuberant, brilliantly scored for a large orchestra. It begins with a marking of half-notes (woodblock, soon joined by the four trumpets) and eighths (clarinets and synthesizers); the (amplified) woodblock is fortissimo and the other instruments play forte.\n\nNixon in China (1987): The opera, in three acts, is based on Richard Nixon's visit to China on February 21–25, 1972. Main characters in the opera are: the Nixons, Mao Tse-tung, Chou En-lai, Chiang Ch'ing (Madame Mao) and Henry Kissinger. It was directed by Peter Sellars. This piece is John Adams's second major composition on a text, after Harmonium (1981) for chorus and orchestra.\n\nAfter Nixon in China\n\nIn October 2008, Adams told BBC Radio 3 that he had been blacklisted by the U.S. Homeland Security department and immigration services.Thorpe, Vanessa. [https://www.theguardian.com/music/2008/oct/19/classicalmusicandopera-usnationalsecurity \"I'm Blacklisted, says Opera Maestro: Composer John Adams Accuses US of Paranoia and Says its Security Forces are Following Him.\"] The Observer. October 19, 2008. . Retrieved February 10, 2009.\n\nThe Wound-Dresser (1988): John Adams's setting of Walt Whitman's 1865 poem of the same title, which Whitman wrote after visiting wounded soldiers during the American Civil War. The piece is scored for baritone voice, two flutes (or two piccolos), two oboes, clarinet, bass clarinet, two bassoons, two horns, trumpet (or piccolo tpt), timpani, synthesizer, and strings.\n\nThe Death of Klinghoffer (1991): The opera's story begins with the 1985 hijacking of the Italian cruise ship Achille Lauro by Palestinian terrorists and details the murder of a passenger named Leon Klinghoffer, a retired, physically disabled American Jew.\n\nChamber Symphony (1992): This piece was commissioned by the Gerbode Foundation of San Francisco for the San Francisco Contemporary Chamber Players.\n\nI Was Looking at the Ceiling and Then I Saw the Sky (1995): A stage piece with libretto by June Jordan and staging by Peter Sellars. The main characters are seven young Americans from different social and ethnic backgrounds, all living in Los Angeles. The story takes place in the aftermath of the earthquake in Los Angeles in 1994.\n\nHallelujah Junction (1996): This piece for two pianos employs variations of a repeated two note rhythm. The intervals between the notes remain the same through much of the piece.\n\nOn the Transmigration of Souls (2002): This piece commemorates those who lost their lives in the September 11, 2001 attacks on the World Trade Center in New York. It won the 2003 Pulitzer Prize for Music as well as the 2005 Grammy Award for Best Contemporary Composition.\n\nMy Father Knew Charles Ives (2003): A semi-autobiographical orchestral triptych. It was commissioned by the San Francisco Symphony.\n\nThe Dharma at Big Sur (2003): A piece for solo electric six-string violin and orchestra. The piece calls for some instruments (harp, piano, samplers) to use just intonation, a tuning system in which intervals sound pure, rather than equal temperament, the common Western tuning system in which all intervals except the octave are impure.\n\nDoctor Atomic (2005): An opera in two acts, about Robert Oppenheimer, the Manhattan Project, and the creation and testing of the first atomic bomb. The libretto of Doctor Atomic by Peter Sellars draws on original source material, including personal memoirs, recorded interviews, technical manuals of nuclear physics, declassified government documents, and the poetry of the Bhagavad Gita, John Donne, Charles Baudelaire, and Muriel Rukeyser. The opera takes place in June and July 1945, mainly over the last few hours before the first atomic bomb explodes at the test site in New Mexico. Characters include Dr. J. Robert Oppenheimer and his wife Kitty, Edward Teller, General Leslie Groves, and Robert Wilson.\n\nA Flowering Tree (2006): An opera in two acts, based on a folktale from the Kannada language of southern India as translated by A.K. Ramanujan. it was commissioned as part of the Vienna New Crowned Hope Festival to celebrate the 250th anniversary of Mozart’s birth.\n\nDoctor Atomic Symphony (2007): Based on music from the opera.\n\nFellow Traveler (2007): This piece was commissioned for the Kronos Quartet by Greg G. Minshall, and was dedicated to opera and theater director Peter Sellars for his 50th birthday.\n\nThe Gospel According to the Other Mary (2011–13): An oratorio in two acts for orchestra, soloists and chorus, it premiered in May 2012 with the Los Angeles Philharmonic and the Los Angeles Master Chorale conducted by Gustavo Dudamel. The revised version, in the work's staged premiere, occurred in February 2013 again with the Los Angeles Philharmonic, the Los Angeles Master Chorale, conducted by Gustavo Dudamel and directed by Peter Sellars.\n\nScheherazade.2 (2014): A dramatic symphony for violin and orchestra. The World Premiere for this work took place on March 26, 2015 at Avery Fisher Hall, Lincoln Center, New York City and was performed by the New York Philharmonic, conducted by Alan Gilbert, and violinist Leila Josefowicz.\n\nOn March 26, 2015, before the premier of Scheherazade.2 by the New York Philharmonic, Adams introduced the setting of the piece as related to One Thousand and One Nights, in which Scheherazade, after being forced into marriage, by recounting tales to her husband, delays her death. He associated modern examples of suffering and injustice towards women around the world, with acts in Tahrir Square during the Egyptian Revolution of 2011, Kabul, and comments from The Rush Limbaugh Show.\n\nIn January 2017 he was appointed visiting professor of composition at the Royal Academy of Music in London.\n\nMusical style\n\nThe music of John Adams is usually categorized as minimalist or post-minimalist, although in interview he has categorized himself as a 'post-style' composer. While Adams employs minimalist techniques, such as repeating patterns, he is not a strict follower of the movement. Adams was born ten years after Steve Reich and Philip Glass, and his writing is more developmental and directionalized, containing climaxes and other elements of Romanticism. Comparing Shaker Loops to the minimalist composer Terry Riley's piece In C, Adams remarked:\n\nMany of Adams's ideas in composition are a reaction to the philosophy of serialism and its depictions of \"the composer as scientist.\"Thomas May, pp. 7–10. The Darmstadt school of twelve tone composition was dominant during the time that Adams was receiving his college education, and he compared class to a \"mausoleum where we would sit and count tone-rows in Webern.\"Michael Broyles, [https://books.google.com/books?id=D9-xeF0QYhgC Mavericks and other traditions in American music], Yale University Press, 2004; ,  pp. 169–170\n\nAdams experienced a musical epiphany after reading John Cage's book Silence (1973), which he claimed \"dropped into [his] psyche like a time bomb.\"K. Robert Schwarz, Minimalists, p. 175. Cage posed fundamental questions about what music was, and regarded all types of sounds as viable sources of music. This perspective offered to Adams a liberating alternative to the rule-based techniques of serialism. At this point Adams began to experiment with electronic music, and his experiences are reflected in the writing of Phrygian Gates (1977–78), in which the constant shifting between modules in Lydian mode and Phrygian mode refers to activating electronic gates rather than architectural ones. Adams explained that working with synthesizers caused a \"diatonic conversion,\" a reversion to the belief that tonality was a force of nature.Elliott Schwartz, Daniel Godfrey [https://books.google.com/books?id=uGQXAQAAIAAJ Music since 1945: issues, materials, and literature], Schirmer Books, 1993, pp. 336; , \n\nSome of Adams's compositions are an amalgamation of different styles. One example is Grand Pianola Music (1981–82), a humorous piece that purposely draws its content from musical cliches. In The Dharma at Big Sur, Adams draws from literary texts such as Jack Kerouac, Gary Snyder and Henry Miller to illustrate the California landscape. Adams professes his love of other genres other than classical music; his parents were jazz musicians, and he has also listened to rock music, albeit only passively. Adams once claimed that originality wasn't an urgent concern for him the way it was necessary for the minimalists, and compared his position to that of Gustav Mahler, J. S. Bach, and Johannes Brahms, who \"were standing at the end of an era and were embracing all of the evolutions that occurred over the previous thirty to fifty years.\"\n\nStyle and analysis\n\nAdams, like other minimalists of his time (e.g. Philip Glass), used a steady pulse that defines and controls the music. The pulse was best known from Terry Riley's early composition In C, and slowly more and more composers used it as a common practice. Jonathan Bernard highlighted this adoption by comparing Phrygian Gates, written in 1977, and Fearful Symmetries written eleven years later in 1988.Jonathan W. Bernard, \"Minimalism, Postminimalism, and the Resurgence of Tonality in Recent American Music\" Journal of American Music, Spring 2003, Vol. 21, No. 1, pp. 112–33.\n\nViolin Concerto, Mvt. III \"Toccare\"\n\nIn the late 1980s and early 1990s, Adams started to add a new character to his music, something he called \"the Trickster.\" The Trickster allowed Adams to use the repetitive style and rhythmic drive of minimalism, yet poke fun at it at the same time. When Adams commented on his own characterization of particular minimalist music, he stated that he went joyriding on \"those Great Prairies of non-event.\"Heisinger, Brent. [https://www.jstor.org/stable/3051914 \"American Minimalism in the 1980s.\"] American Music. Winter 1989. . Retrieved February 10, 2009.\n\nCritical reception\n\nAdams won the annual American Pulitzer Prize for Music in 2003 for his 9/11 memorial piece, On the Transmigration of Souls. Response to his output as a whole has been more divided, and Adams's works have been described as both brilliant and boring in reviews that stretch across both ends of the rating spectrum. Shaker Loops has been described as \"hauntingly ethereal,\" while 1999's \"Naïve and Sentimental Music\" has been called \"an exploration of a marvelously extended spinning melody.\" The New York Times called 1996's Hallelujah Junction \"a two-piano work played with appealingly sharp edges,\" and 2001's \"American Berserk\" \"a short, volatile solo piano work.\"Kozinn, Allan. [https://www.nytimes.com/2005/03/23/arts/music/23adam.html \"Beyond Minimalism: The Later Works of John Adams.\"] New York Times. March 23, 2005 . Retrieved February 11, 2009.\n\nThe most critically divisive pieces in Adams's collection are his historical operas. While it is now easy to say that Nixon in Chinas influential score spawned a new interest in opera, it was not always met with such laudatory and generous reviews. At first release, Nixon in China received mostly mixed if not negative press feedback. Donal Henahan, special to the New York Times, called the Houston Grand Opera world premiere of the work \"worth a few giggles but hardly a strong candidate for the standard repertory\" and \"visually striking but coy and insubstantial.\"Henahan, Donal. [https://query.nytimes.com/gst/fullpage.html?res9B0DE7DC173AF937A15753C1A961948260 \"Opera: Nixon in China.\"] The New York Times. October 24, 1987 . Retrieved February 11, 2009. James Wierzbicki for the St. Louis Post-Dispatch described Adams's score as the weak point in an otherwise well-staged performance, noting the music as \"inappropriately placid,\" \"cliché-ridden in the abstract\" and \"[trafficked] heavily in Adams's worn-out Minimalist clichés.\"Wierzbicki, James. [http://pages.sbcglobal.net/jameswierzbicki/adams.htm \"John Adams: Nixon in China.\"] St. Louis Post-Dispatch. December 6, 1992 With time, however, the opera has come to be revered as a great and influential production. Robert Hugill for Music and Vision called the production \"astonishing ... nearly twenty years after its premier,\"Hugill, Robert. [http://www.mvdaily.com/articles/2006/07/nixon1.htm \"Ensemble: A Mythic Story: Nixon in China.\"] Music & Vision. July 2, 2006. while City Beats Tom McElfresh called Nixon's score \"a character in the drama\" and \"too intricate, too detailed to qualify as minimalist.\"McElfresh, Tom. [http://citybeat.com/gyrobase/Content?oid\noid%3A140254 \"Nixon in China: John Adams' Score Highlights Marvelous Production.\"] City Beat (Cincinnati). July 14, 2007. . Retrieved February 11, 2009.\n\n2003's The Dharma at Big Sur/ My Father Knew Charles Ives was well-received, particularly at Adams's alma mater's publication, the Harvard Crimson. In a four-star review, Harvard's newspaper called the electric violin and orchestral concerto \"Adams's best composition of the past ten years.\"Lin, Eric W. [http://www.thecrimson.com/article.aspx?ref515088 \"CD Review: John Adams, The Dharma at Big Sur/ My Father Knew Charles Ives.] The Harvard Crimson. October 19, 2006. . Retrieved February 11, 2009. Most recently, New York Times writer Anthony Tommasini commended Adams for his work conducting the American Composers Orchestra. The concert, which took place in April 2007 at Carnegie Hall, was a celebratory performance of Adams's work on his sixtieth birthday. Tommasini called Adams a \"skilled and dynamic conductor,\" and noted that the music \"was gravely beautiful yet restless.\"Tommasini, Anthony. [https://www.nytimes.com/2007/04/30/arts/music/30adam.html?_r\n1&oref=slogin \"Doing Everything but Playing the Music.\"] The New York Times. April 30, 2007 . Retrieved February 11, 2009.\n\nKlinghoffer controversy\n\nThe opera The Death of Klinghoffer has been criticized as antisemitic by some, including by the Klinghoffer family. Leon Klinghoffer's daughters, Lisa and Ilsa, after attending the opera, released a statement saying: \"We are outraged at the exploitation of our parents and the coldblooded murder of our father as the centerpiece of a production that appears to us to be anti-Semitic.\" In response to these accusations of antisemitism, composer and Oberlin College professor Conrad Cummings wrote a letter to the editor defending Klinghoffer as \"the closest analogue to the experience of Bach's audience attending his most demanding works,\" and noted that, as someone of half-Jewish heritage, he \"found nothing anti-Semitic about the work.\"\n\nAfter the September 11 attacks in 2001, performances by the Boston Symphony Orchestra of excerpts from Klinghoffer were canceled. BSO Managing Director Mark Volpe remarked of the decision: \"We originally programmed the choruses from John Adams’ The Death of Klinghoffer because we believe in it as a work of art, and we still hold that conviction. ... [Tanglewood Festival Chorus members] explained that it was a purely human reason, and that it wasn’t in the least bit a criticism of the work.\"Sheldon, Molly. [http://www.newmusicbox.org/articles/Music-America-Needs-Now/ Music America Needs Now] NewMusicBox. December 1, 2001. Adams and Klinghoffer librettist Alice Goodman criticized the decision,[https://www.nytimes.com/2001/11/14/arts/klinghoffer-composer-fights-his-cancellation.html \"'Klinghoffer' Composer Fights His Cancellation\"] The New York Times. November 14, 2001 and Adams rejected a request to substitute a performance of Harmonium, saying: \"The reason that I asked them not to do 'Harmonium' was that I felt that 'Klinghoffer' is a serious and humane work, and it's also a work about which many people have made prejudicial judgments without even hearing it. I felt that if I said, 'OK, \"Klinghoffer\" is too hot to handle, do \"Harmonium,\"' that in a sense I would be agreeing with the judgment about 'Klinghoffer.'\" Swed, Mark. [http://articles.latimes.com/2001/nov/20/entertainment/ca-6212 'Klinghoffer': Too Hot to Handle?] Los Angeles Times. November 20, 2001 In response to an article by San Francisco Chronicle David WiegandWiegand, David. [http://www.sfgate.com/entertainment/article/Boston-Symphony-missed-the-point-on-art-and-2860361.php Boston Symphony missed the point on art and grieving] San Francisco Chronicle. November 7, 2001 denouncing the BSO decision, musicologist and critic Richard Taruskin accused the work of catering to \"anti-American, anti-Semitic and anti-bourgeois\" prejudices.Taruskin, Richard. [https://www.nytimes.com/2001/12/09/arts/music-music-s-dangers-and-the-case-for-control.html?pagewanted=1] The New York Times. December 9, 2001\n\nA 2014 revival by the Metropolitan Opera reignited debate. Former New York City mayor Rudy Giuliani, who marched in protest against the production, wrote: \"this work is both a distortion of history and helped, in some ways, to foster a three decade long feckless policy of creating a moral equivalency between the Palestinian Authority, a corrupt terrorist organization, and the state of Israel, a democracy ruled by law.\" Current mayor Bill de Blasio criticized Giuliani's participation in the protests, and Oskar Eustis, the artistic director of the Public Theater, said in support of the production: \"It is not only permissible for the Met to do this piece – it's required for the Met to do the piece. It is a powerful and important opera.\" A week after watching a Met performance of the opera, Supreme Court Justice Ruth Bader Ginsburg said \"There was nothing anti-Semitic about the opera,\" and characterized the portrayal of the Klinghoffers as \"very strong, very brave\", and the terrorists as \"bullies and irrational\".Bravin, Jess. [https://blogs.wsj.com/speakeasy/2014/10/28/on-the-death-of-klinghoffer-justice-ginsburg-finds-for-the-defense/ On ‘The Death of Klinghoffer,’ Justice Ginsburg Finds for the Defense] Wall Street Journal. October 28, 2014.\n\nList of works\n\nOperas\n\n* (1987) Nixon in China\n* (1991) The Death of Klinghoffer\n* (1995) I Was Looking at the Ceiling and Then I Saw the Sky (song play)\n* (2000) El Niño (opera-oratorio)\n* (2005) Doctor Atomic\n* (2006) A Flowering Tree\n* (2013) The Gospel According to the Other Mary (opera-oratorio)\n* (2017) Girls of the Golden West (premiered by San Francisco Opera, November 2017).Press release, [http://sfopera.com/about-us/press-room/press-releases/girls-west/#sthash.QSpSe8x5.dpuf San Francisco Opera to Present World Premiere of \"Girls of the Golden West\"], San Francisco Opera, 14 June 2016, accessed 15 June 2016\n\nOrchestral\n\n* (1979) Common Tones in Simple Time\n* (1983) Shaker Loops (for string orchestra)\n* (1985) Harmonielehre\n* (1985) The Chairman Dances\n* (1986) Tromba Lontana\n* (1986) Short Ride in a Fast Machine\n* (1988) Fearful Symmetries\n* (1989) Eros Piano (for piano and orchestra)\n* (1991) El Dorado\n* (1993) Violin Concerto (1995 Grawemeyer Award for Music composition)\n* (1995) Lollapalooza\n* (1996) Slonimsky's Earbox\n* (1997) Century Rolls (for piano and orchestra)\n* (1998) Naive and Sentimental Music\n* (2001) Guide to Strange Places\n* (2003) My Father Knew Charles Ives\n* (2003) The Dharma at Big Sur (for solo electric violin and orchestra)\n* (2007) Doctor Atomic Symphony\n* (2009) City Noir\n* (2012) Absolute Jest (for string quartet and orchestra)\n* (2013) Saxophone Concerto\n* (2014) Scheherazade.2 (dramatic symphony for violin and orchestra)\n\nVoice and orchestra\n\n* (1987) The Nixon Tapes (three suites from Nixon in China)\n* (1989) The Wound-Dresser\n\nChamber music\n\n* (1970) Piano Quintet\n* (1978) Shaker Loops (for string septet)\n* (1992) Chamber Symphony\n* (1994) John's Book of Alleged Dances (for string quartet)\n* (1995) Road Movies (for violin and piano)\n* (1996) Gnarly Buttons (for clarinet and chamber ensemble)\n* (2007) Son of Chamber Symphony\n* (2007) Fellow Traveler (for string quartet)\n* (2008) First Quartet\n* (2014) Second Quartet\n\nOther ensemble works\n\n* (1973) American Standard, including Christian Zeal and Activity\n* (1975) Grounding\n* (1982) Grand Pianola Music\n* (1996) Scratchband\n* (2001) Nancy's Fancy\n\nChoral works\n\n* (1973) Ktaadn\n* (1980) Harmonium\n* (1991) Choruses from The Death of Klinghoffer\n* (2002) On the Transmigration of Souls\n\nTape and electronic compositions\n\n* (1970) Heavy Metal\n* (1976) Studebaker Love Music\n* (1976) Onyx\n* (1983) Light Over Water\n* (1993) Hoodoo Zephyr\n\nPiano\n\n* (1977) Phrygian Gates\n* (1977) China Gates\n* (1996) Hallelujah Junction\n* (2001) American Berserk\n\nFilm scores\n\n* (1982) Matter of Heart\n* (1999) American Tapestry\n* (2010) I Am Love (Io sono l'amore) – all existing pieces, no original compositions\n* (2017) Call Me By Your Name, contributions\n\nOrchestrations\n\n* (1989) The Black Gondola (Liszt's La lugubre gondola II (1882))\n* (1989) Berceuse Élégiaque (Busoni's Berceuse Élégiaque (1907))\n* (1989) Wiegenlied (Liszt's Wiegenlied (1881))\n* (1994) Le Livre de Baudelaire (Debussy's Cinq poèmes de Charles Baudelaire)\n* (1995) La Mufa (Piazzolla's tango)\n* (1996) Todo Buenos Aires (Piazzolla's tango)\n\nArrangements\n\n* (1989–93) Six Songs by Charles Ives (Ives' songs)\n\nAwards and recognition\n\n* Grammy Award for Best Contemporary Composition for Nixon in China (1989)\n* Royal Philharmonic Society Music Award for Best Chamber Composition for Chamber Symphony (1994)\n* University of Louisville Grawemeyer Award for Music Composition for Violin Concerto (1995)\n* Fellow of the American Academy of Arts and Sciences (1997)\n* Member of the American Academy of Arts and Letters (1997)\n* Grammy Award for Best Contemporary Composition for El Dorado (1998)\n* Pulitzer Prize for Music for On the Transmigration of Souls (2003)\n* Grammy Award for Best Classical Album for On the Transmigration of Souls (2005)\n* Grammy Award for Best Orchestral Performance for On the Transmigration of Souls (2005)\n* Grammy Award for Best Classical Contemporary Composition for On the Transmigration of Souls (2005)\n* Harvard Arts Medal (2007)\n*Creative Chair of the Los Angeles Philharmonic (2009–present)\n* Honorary Doctorate of Arts from Northwestern University (2008)\n* Honorary Doctorate of Music from Duquesne University (2009)\n* Honorary Doctorate of Music from Harvard University (2012)\n* Honorary Doctorate of Music from Yale University (2013)\n* Honorary Doctorate of Music from Royal Academy of Music (2015)\n* California Governor's Award for Lifetime Achievement in the Arts\n* Cyril Magnin Award for Outstanding Achievement in the Arts\n* Chevalier dans l'Ordre des Arts et des Lettres (Knight of the Order of Arts and Letters)\n\nPersonal life\n\nAdams' son is the composer Samuel Carl Adams.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "John Adams (composer)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16518" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "John Coolidge Adams (born February 15, 1947) is an American composer of classical music and opera, with strong roots in minimalism.\n\nHis works include Harmonielehre (1985), Short Ride in a Fast Machine (1986), On the Transmigration of Souls (2002), a choral piece commemorating the victims of the September 11, 2001 attacks (for which he won the Pulitzer Prize for Music in 2003), and Shaker Loops (1978), a minimalist four-movement work for strings.\n\nHis operas include Nixon in China (1987), which recounts Richard Nixon's 1972 visit to China, and Doctor Atomic (2005), which covers Robert Oppenheimer, the Manhattan Project, and the building of the first atomic bomb.\n\nThe Death of Klinghoffer is an opera for which he wrote the music, based on the hijacking of the passenger liner Achille Lauro by the Palestine Liberation Front in 1985, and the hijackers' murder of wheelchair-bound 69-year-old Jewish-American passenger Leon Klinghoffer. The opera has drawn controversy, including allegations by some (including Klinghoffer's two daughters) that the opera is antisemitic and glorifies terrorism. The work's creators and others have disputed these criticisms.\n\nLife and career\n\nBefore 1977\n\nJohn Coolidge Adams was born in Worcester, Massachusetts, in 1947.Warrack and West, \"Adams, John\" The Oxford Dictionary of Opera, 782 pages,  p.4 He was raised in various New England states, where he was greatly influenced by New England's musical culture. He graduated from Concord High School in Concord, New Hampshire.\n\nAdams began composing at the age of ten and first heard his music performed around the age of 13 or 14. After he matriculated at Harvard University in 1965 he studied composition under Leon Kirchner, Roger Sessions, Earl Kim, and David Del Tredici. He studied at Harvard University (BA 1969, MA 1972). His piece \"American Standard\" was recorded and released on Obscure Records in 1975. He taught at the San Francisco Conservatory of Music from 1972 until 1984. He served as musical producer for a number of series for the Public Broadcasting System including the award-winning series, The Adams Chronicles in 1976 and 1977.\n\n1977 to Nixon in China\n\nSome works composed during this period include China Gates (1977), Phrygian Gates for solo piano (1977), Shaker Loops (1978), Common Tones in Simple Time (1979), Harmonium (1980–81), Grand Pianola Music (1982), Light Over Water (1983), Harmonielehre (1984–85), The Chairman Dances (1985), Short Ride in a Fast Machine (1986), and Nixon in China (1985–87).\n\nShaker Loops (for string septet) (1978): A \"modular\" composition for three violins, one viola, two cellos, and one bass, with a conductor. It is divided into four movements.\n\nHarmonium for large orchestra and chorus (1980–81): The piece starts with quietly insistent repetitions of one note – D – and one syllable – \"no\".\n\nGrand Pianola Music (1982): Adams commented, \"Dueling pianos, cooing sirens, Valhalla brass, thwacking bass drums, gospel triads, and a Niagara of cascading flat keys all learned to cohabit as I wrote the piece.\"Adams, John. Program Note, Grand Pianola Music Full Score, Associated Music Publishers, 1982.\n\nLight Over Water: The Genesis of Music (1983): This work was commissioned by the Museum of Contemporary Art in Los Angeles as the score for the collaborative work Available Light, which was choreographed by Lucinda Childs and had a set design by architect Frank Gehry.\n\nHarmonielehre (1984–85): Inspired by a dream of an oil tanker taking flight out of San Francisco Bay and also by Arnold Schoenberg's book, Harmonielehre (Theory of Harmony). This piece is also about harmony of the mind.\n\nThe Chairman Dances (Foxtrot for Orchestra) (1985): This is a by-product of Nixon in China, set in the three days of President Nixon's visit to Beijing in February 1972.\n\nShort Ride in a Fast Machine (Fanfare for Great Woods) (1986): This piece is joyfully exuberant, brilliantly scored for a large orchestra. It begins with a marking of half-notes (woodblock, soon joined by the four trumpets) and eighths (clarinets and synthesizers); the (amplified) woodblock is fortissimo and the other instruments play forte.\n\nNixon in China (1987): The opera, in three acts, is based on Richard Nixon's visit to China on February 21–25, 1972. Main characters in the opera are: the Nixons, Mao Tse-tung, Chou En-lai, Chiang Ch'ing (Madame Mao) and Henry Kissinger. It was directed by Peter Sellars. This piece is John Adams's second major composition on a text, after Harmonium (1981) for chorus and orchestra.\n\nAfter Nixon in China\n\nIn October 2008, Adams told BBC Radio 3 that he had been blacklisted by the U.S. Homeland Security department and immigration services.Thorpe, Vanessa. [https://www.theguardian.com/music/2008/oct/19/classicalmusicandopera-usnationalsecurity \"I'm Blacklisted, says Opera Maestro: Composer John Adams Accuses US of Paranoia and Says its Security Forces are Following Him.\"] The Observer. October 19, 2008. . Retrieved February 10, 2009.\n\nThe Wound-Dresser (1988): John Adams's setting of Walt Whitman's 1865 poem of the same title, which Whitman wrote after visiting wounded soldiers during the American Civil War. The piece is scored for baritone voice, two flutes (or two piccolos), two oboes, clarinet, bass clarinet, two bassoons, two horns, trumpet (or piccolo tpt), timpani, synthesizer, and strings.\n\nThe Death of Klinghoffer (1991): The opera's story begins with the 1985 hijacking of the Italian cruise ship Achille Lauro by Palestinian terrorists and details the murder of a passenger named Leon Klinghoffer, a retired, physically disabled American Jew.\n\nChamber Symphony (1992): This piece was commissioned by the Gerbode Foundation of San Francisco for the San Francisco Contemporary Chamber Players.\n\nI Was Looking at the Ceiling and Then I Saw the Sky (1995): A stage piece with libretto by June Jordan and staging by Peter Sellars. The main characters are seven young Americans from different social and ethnic backgrounds, all living in Los Angeles. The story takes place in the aftermath of the earthquake in Los Angeles in 1994.\n\nHallelujah Junction (1996): This piece for two pianos employs variations of a repeated two note rhythm. The intervals between the notes remain the same through much of the piece.\n\nOn the Transmigration of Souls (2002): This piece commemorates those who lost their lives in the September 11, 2001 attacks on the World Trade Center in New York. It won the 2003 Pulitzer Prize for Music as well as the 2005 Grammy Award for Best Contemporary Composition.\n\nMy Father Knew Charles Ives (2003): A semi-autobiographical orchestral triptych. It was commissioned by the San Francisco Symphony.\n\nThe Dharma at Big Sur (2003): A piece for solo electric six-string violin and orchestra. The piece calls for some instruments (harp, piano, samplers) to use just intonation, a tuning system in which intervals sound pure, rather than equal temperament, the common Western tuning system in which all intervals except the octave are impure.\n\nDoctor Atomic (2005): An opera in two acts, about Robert Oppenheimer, the Manhattan Project, and the creation and testing of the first atomic bomb. The libretto of Doctor Atomic by Peter Sellars draws on original source material, including personal memoirs, recorded interviews, technical manuals of nuclear physics, declassified government documents, and the poetry of the Bhagavad Gita, John Donne, Charles Baudelaire, and Muriel Rukeyser. The opera takes place in June and July 1945, mainly over the last few hours before the first atomic bomb explodes at the test site in New Mexico. Characters include Dr. J. Robert Oppenheimer and his wife Kitty, Edward Teller, General Leslie Groves, and Robert Wilson.\n\nA Flowering Tree (2006): An opera in two acts, based on a folktale from the Kannada language of southern India as translated by A.K. Ramanujan. it was commissioned as part of the Vienna New Crowned Hope Festival to celebrate the 250th anniversary of Mozart’s birth.\n\nDoctor Atomic Symphony (2007): Based on music from the opera.\n\nFellow Traveler (2007): This piece was commissioned for the Kronos Quartet by Greg G. Minshall, and was dedicated to opera and theater director Peter Sellars for his 50th birthday.\n\nThe Gospel According to the Other Mary (2011–13): An oratorio in two acts for orchestra, soloists and chorus, it premiered in May 2012 with the Los Angeles Philharmonic and the Los Angeles Master Chorale conducted by Gustavo Dudamel. The revised version, in the work's staged premiere, occurred in February 2013 again with the Los Angeles Philharmonic, the Los Angeles Master Chorale, conducted by Gustavo Dudamel and directed by Peter Sellars.\n\nScheherazade.2 (2014): A dramatic symphony for violin and orchestra. The World Premiere for this work took place on March 26, 2015 at Avery Fisher Hall, Lincoln Center, New York City and was performed by the New York Philharmonic, conducted by Alan Gilbert, and violinist Leila Josefowicz.\n\nOn March 26, 2015, before the premier of Scheherazade.2 by the New York Philharmonic, Adams introduced the setting of the piece as related to One Thousand and One Nights, in which Scheherazade, after being forced into marriage, by recounting tales to her husband, delays her death. He associated modern examples of suffering and injustice towards women around the world, with acts in Tahrir Square during the Egyptian Revolution of 2011, Kabul, and comments from The Rush Limbaugh Show.\n\nIn January 2017 he was appointed visiting professor of composition at the Royal Academy of Music in London.\n\nMusical style\n\nThe music of John Adams is usually categorized as minimalist or post-minimalist, although in interview he has categorized himself as a 'post-style' composer. While Adams employs minimalist techniques, such as repeating patterns, he is not a strict follower of the movement. Adams was born ten years after Steve Reich and Philip Glass, and his writing is more developmental and directionalized, containing climaxes and other elements of Romanticism. Comparing Shaker Loops to the minimalist composer Terry Riley's piece In C, Adams remarked:\n\nMany of Adams's ideas in composition are a reaction to the philosophy of serialism and its depictions of \"the composer as scientist.\"Thomas May, pp. 7–10. The Darmstadt school of twelve tone composition was dominant during the time that Adams was receiving his college education, and he compared class to a \"mausoleum where we would sit and count tone-rows in Webern.\"Michael Broyles, [https://books.google.com/books?id=D9-xeF0QYhgC Mavericks and other traditions in American music], Yale University Press, 2004; ,  pp. 169–170\n\nAdams experienced a musical epiphany after reading John Cage's book Silence (1973), which he claimed \"dropped into [his] psyche like a time bomb.\"K. Robert Schwarz, Minimalists, p. 175. Cage posed fundamental questions about what music was, and regarded all types of sounds as viable sources of music. This perspective offered to Adams a liberating alternative to the rule-based techniques of serialism. At this point Adams began to experiment with electronic music, and his experiences are reflected in the writing of Phrygian Gates (1977–78), in which the constant shifting between modules in Lydian mode and Phrygian mode refers to activating electronic gates rather than architectural ones. Adams explained that working with synthesizers caused a \"diatonic conversion,\" a reversion to the belief that tonality was a force of nature.Elliott Schwartz, Daniel Godfrey [https://books.google.com/books?id=uGQXAQAAIAAJ Music since 1945: issues, materials, and literature], Schirmer Books, 1993, pp. 336; , \n\nSome of Adams's compositions are an amalgamation of different styles. One example is Grand Pianola Music (1981–82), a humorous piece that purposely draws its content from musical cliches. In The Dharma at Big Sur, Adams draws from literary texts such as Jack Kerouac, Gary Snyder and Henry Miller to illustrate the California landscape. Adams professes his love of other genres other than classical music; his parents were jazz musicians, and he has also listened to rock music, albeit only passively. Adams once claimed that originality wasn't an urgent concern for him the way it was necessary for the minimalists, and compared his position to that of Gustav Mahler, J. S. Bach, and Johannes Brahms, who \"were standing at the end of an era and were embracing all of the evolutions that occurred over the previous thirty to fifty years.\"\n\nStyle and analysis\n\nAdams, like other minimalists of his time (e.g. Philip Glass), used a steady pulse that defines and controls the music. The pulse was best known from Terry Riley's early composition In C, and slowly more and more composers used it as a common practice. Jonathan Bernard highlighted this adoption by comparing Phrygian Gates, written in 1977, and Fearful Symmetries written eleven years later in 1988.Jonathan W. Bernard, \"Minimalism, Postminimalism, and the Resurgence of Tonality in Recent American Music\" Journal of American Music, Spring 2003, Vol. 21, No. 1, pp. 112–33.\n\nViolin Concerto, Mvt. III \"Toccare\"\n\nIn the late 1980s and early 1990s, Adams started to add a new character to his music, something he called \"the Trickster.\" The Trickster allowed Adams to use the repetitive style and rhythmic drive of minimalism, yet poke fun at it at the same time. When Adams commented on his own characterization of particular minimalist music, he stated that he went joyriding on \"those Great Prairies of non-event.\"Heisinger, Brent. [https://www.jstor.org/stable/3051914 \"American Minimalism in the 1980s.\"] American Music. Winter 1989. . Retrieved February 10, 2009.\n\nCritical reception\n\nAdams won the annual American Pulitzer Prize for Music in 2003 for his 9/11 memorial piece, On the Transmigration of Souls. Response to his output as a whole has been more divided, and Adams's works have been described as both brilliant and boring in reviews that stretch across both ends of the rating spectrum. Shaker Loops has been described as \"hauntingly ethereal,\" while 1999's \"Naïve and Sentimental Music\" has been called \"an exploration of a marvelously extended spinning melody.\" The New York Times called 1996's Hallelujah Junction \"a two-piano work played with appealingly sharp edges,\" and 2001's \"American Berserk\" \"a short, volatile solo piano work.\"Kozinn, Allan. [https://www.nytimes.com/2005/03/23/arts/music/23adam.html \"Beyond Minimalism: The Later Works of John Adams.\"] New York Times. March 23, 2005 . Retrieved February 11, 2009.\n\nThe most critically divisive pieces in Adams's collection are his historical operas. While it is now easy to say that Nixon in Chinas influential score spawned a new interest in opera, it was not always met with such laudatory and generous reviews. At first release, Nixon in China received mostly mixed if not negative press feedback. Donal Henahan, special to the New York Times, called the Houston Grand Opera world premiere of the work \"worth a few giggles but hardly a strong candidate for the standard repertory\" and \"visually striking but coy and insubstantial.\"Henahan, Donal. [https://query.nytimes.com/gst/fullpage.html?res9B0DE7DC173AF937A15753C1A961948260 \"Opera: Nixon in China.\"] The New York Times. October 24, 1987 . Retrieved February 11, 2009. James Wierzbicki for the St. Louis Post-Dispatch described Adams's score as the weak point in an otherwise well-staged performance, noting the music as \"inappropriately placid,\" \"cliché-ridden in the abstract\" and \"[trafficked] heavily in Adams's worn-out Minimalist clichés.\"Wierzbicki, James. [http://pages.sbcglobal.net/jameswierzbicki/adams.htm \"John Adams: Nixon in China.\"] St. Louis Post-Dispatch. December 6, 1992 With time, however, the opera has come to be revered as a great and influential production. Robert Hugill for Music and Vision called the production \"astonishing ... nearly twenty years after its premier,\"Hugill, Robert. [http://www.mvdaily.com/articles/2006/07/nixon1.htm \"Ensemble: A Mythic Story: Nixon in China.\"] Music & Vision. July 2, 2006. while City Beats Tom McElfresh called Nixon's score \"a character in the drama\" and \"too intricate, too detailed to qualify as minimalist.\"McElfresh, Tom. [http://citybeat.com/gyrobase/Content?oid\noid%3A140254 \"Nixon in China: John Adams' Score Highlights Marvelous Production.\"] City Beat (Cincinnati). July 14, 2007. . Retrieved February 11, 2009.\n\n2003's The Dharma at Big Sur/ My Father Knew Charles Ives was well-received, particularly at Adams's alma mater's publication, the Harvard Crimson. In a four-star review, Harvard's newspaper called the electric violin and orchestral concerto \"Adams's best composition of the past ten years.\"Lin, Eric W. [http://www.thecrimson.com/article.aspx?ref515088 \"CD Review: John Adams, The Dharma at Big Sur/ My Father Knew Charles Ives.] The Harvard Crimson. October 19, 2006. . Retrieved February 11, 2009. Most recently, New York Times writer Anthony Tommasini commended Adams for his work conducting the American Composers Orchestra. The concert, which took place in April 2007 at Carnegie Hall, was a celebratory performance of Adams's work on his sixtieth birthday. Tommasini called Adams a \"skilled and dynamic conductor,\" and noted that the music \"was gravely beautiful yet restless.\"Tommasini, Anthony. [https://www.nytimes.com/2007/04/30/arts/music/30adam.html?_r\n1&oref=slogin \"Doing Everything but Playing the Music.\"] The New York Times. April 30, 2007 . Retrieved February 11, 2009.\n\nKlinghoffer controversy\n\nThe opera The Death of Klinghoffer has been criticized as antisemitic by some, including by the Klinghoffer family. Leon Klinghoffer's daughters, Lisa and Ilsa, after attending the opera, released a statement saying: \"We are outraged at the exploitation of our parents and the coldblooded murder of our father as the centerpiece of a production that appears to us to be anti-Semitic.\" In response to these accusations of antisemitism, composer and Oberlin College professor Conrad Cummings wrote a letter to the editor defending Klinghoffer as \"the closest analogue to the experience of Bach's audience attending his most demanding works,\" and noted that, as someone of half-Jewish heritage, he \"found nothing anti-Semitic about the work.\"\n\nAfter the September 11 attacks in 2001, performances by the Boston Symphony Orchestra of excerpts from Klinghoffer were canceled. BSO Managing Director Mark Volpe remarked of the decision: \"We originally programmed the choruses from John Adams’ The Death of Klinghoffer because we believe in it as a work of art, and we still hold that conviction. ... [Tanglewood Festival Chorus members] explained that it was a purely human reason, and that it wasn’t in the least bit a criticism of the work.\"Sheldon, Molly. [http://www.newmusicbox.org/articles/Music-America-Needs-Now/ Music America Needs Now] NewMusicBox. December 1, 2001. Adams and Klinghoffer librettist Alice Goodman criticized the decision,[https://www.nytimes.com/2001/11/14/arts/klinghoffer-composer-fights-his-cancellation.html \"'Klinghoffer' Composer Fights His Cancellation\"] The New York Times. November 14, 2001 and Adams rejected a request to substitute a performance of Harmonium, saying: \"The reason that I asked them not to do 'Harmonium' was that I felt that 'Klinghoffer' is a serious and humane work, and it's also a work about which many people have made prejudicial judgments without even hearing it. I felt that if I said, 'OK, \"Klinghoffer\" is too hot to handle, do \"Harmonium,\"' that in a sense I would be agreeing with the judgment about 'Klinghoffer.'\" Swed, Mark. [http://articles.latimes.com/2001/nov/20/entertainment/ca-6212 'Klinghoffer': Too Hot to Handle?] Los Angeles Times. November 20, 2001 In response to an article by San Francisco Chronicle David WiegandWiegand, David. [http://www.sfgate.com/entertainment/article/Boston-Symphony-missed-the-point-on-art-and-2860361.php Boston Symphony missed the point on art and grieving] San Francisco Chronicle. November 7, 2001 denouncing the BSO decision, musicologist and critic Richard Taruskin accused the work of catering to \"anti-American, anti-Semitic and anti-bourgeois\" prejudices.Taruskin, Richard. [https://www.nytimes.com/2001/12/09/arts/music-music-s-dangers-and-the-case-for-control.html?pagewanted=1] The New York Times. December 9, 2001\n\nA 2014 revival by the Metropolitan Opera reignited debate. Former New York City mayor Rudy Giuliani, who marched in protest against the production, wrote: \"this work is both a distortion of history and helped, in some ways, to foster a three decade long feckless policy of creating a moral equivalency between the Palestinian Authority, a corrupt terrorist organization, and the state of Israel, a democracy ruled by law.\" Current mayor Bill de Blasio criticized Giuliani's participation in the protests, and Oskar Eustis, the artistic director of the Public Theater, said in support of the production: \"It is not only permissible for the Met to do this piece – it's required for the Met to do the piece. It is a powerful and important opera.\" A week after watching a Met performance of the opera, Supreme Court Justice Ruth Bader Ginsburg said \"There was nothing anti-Semitic about the opera,\" and characterized the portrayal of the Klinghoffers as \"very strong, very brave\", and the terrorists as \"bullies and irrational\".Bravin, Jess. [https://blogs.wsj.com/speakeasy/2014/10/28/on-the-death-of-klinghoffer-justice-ginsburg-finds-for-the-defense/ On ‘The Death of Klinghoffer,’ Justice Ginsburg Finds for the Defense] Wall Street Journal. October 28, 2014.\n\nList of works\n\nOperas\n\n* (1987) Nixon in China\n* (1991) The Death of Klinghoffer\n* (1995) I Was Looking at the Ceiling and Then I Saw the Sky (song play)\n* (2000) El Niño (opera-oratorio)\n* (2005) Doctor Atomic\n* (2006) A Flowering Tree\n* (2013) The Gospel According to the Other Mary (opera-oratorio)\n* (2017) Girls of the Golden West (premiered by San Francisco Opera, November 2017).Press release, [http://sfopera.com/about-us/press-room/press-releases/girls-west/#sthash.QSpSe8x5.dpuf San Francisco Opera to Present World Premiere of \"Girls of the Golden West\"], San Francisco Opera, 14 June 2016, accessed 15 June 2016\n\nOrchestral\n\n* (1979) Common Tones in Simple Time\n* (1983) Shaker Loops (for string orchestra)\n* (1985) Harmonielehre\n* (1985) The Chairman Dances\n* (1986) Tromba Lontana\n* (1986) Short Ride in a Fast Machine\n* (1988) Fearful Symmetries\n* (1989) Eros Piano (for piano and orchestra)\n* (1991) El Dorado\n* (1993) Violin Concerto (1995 Grawemeyer Award for Music composition)\n* (1995) Lollapalooza\n* (1996) Slonimsky's Earbox\n* (1997) Century Rolls (for piano and orchestra)\n* (1998) Naive and Sentimental Music\n* (2001) Guide to Strange Places\n* (2003) My Father Knew Charles Ives\n* (2003) The Dharma at Big Sur (for solo electric violin and orchestra)\n* (2007) Doctor Atomic Symphony\n* (2009) City Noir\n* (2012) Absolute Jest (for string quartet and orchestra)\n* (2013) Saxophone Concerto\n* (2014) Scheherazade.2 (dramatic symphony for violin and orchestra)\n\nVoice and orchestra\n\n* (1987) The Nixon Tapes (three suites from Nixon in China)\n* (1989) The Wound-Dresser\n\nChamber music\n\n* (1970) Piano Quintet\n* (1978) Shaker Loops (for string septet)\n* (1992) Chamber Symphony\n* (1994) John's Book of Alleged Dances (for string quartet)\n* (1995) Road Movies (for violin and piano)\n* (1996) Gnarly Buttons (for clarinet and chamber ensemble)\n* (2007) Son of Chamber Symphony\n* (2007) Fellow Traveler (for string quartet)\n* (2008) First Quartet\n* (2014) Second Quartet\n\nOther ensemble works\n\n* (1973) American Standard, including Christian Zeal and Activity\n* (1975) Grounding\n* (1982) Grand Pianola Music\n* (1996) Scratchband\n* (2001) Nancy's Fancy\n\nChoral works\n\n* (1973) Ktaadn\n* (1980) Harmonium\n* (1991) Choruses from The Death of Klinghoffer\n* (2002) On the Transmigration of Souls\n\nTape and electronic compositions\n\n* (1970) Heavy Metal\n* (1976) Studebaker Love Music\n* (1976) Onyx\n* (1983) Light Over Water\n* (1993) Hoodoo Zephyr\n\nPiano\n\n* (1977) Phrygian Gates\n* (1977) China Gates\n* (1996) Hallelujah Junction\n* (2001) American Berserk\n\nFilm scores\n\n* (1982) Matter of Heart\n* (1999) American Tapestry\n* (2010) I Am Love (Io sono l'amore) – all existing pieces, no original compositions\n* (2017) Call Me By Your Name, contributions\n\nOrchestrations\n\n* (1989) The Black Gondola (Liszt's La lugubre gondola II (1882))\n* (1989) Berceuse Élégiaque (Busoni's Berceuse Élégiaque (1907))\n* (1989) Wiegenlied (Liszt's Wiegenlied (1881))\n* (1994) Le Livre de Baudelaire (Debussy's Cinq poèmes de Charles Baudelaire)\n* (1995) La Mufa (Piazzolla's tango)\n* (1996) Todo Buenos Aires (Piazzolla's tango)\n\nArrangements\n\n* (1989–93) Six Songs by Charles Ives (Ives' songs)\n\nAwards and recognition\n\n* Grammy Award for Best Contemporary Composition for Nixon in China (1989)\n* Royal Philharmonic Society Music Award for Best Chamber Composition for Chamber Symphony (1994)\n* University of Louisville Grawemeyer Award for Music Composition for Violin Concerto (1995)\n* Fellow of the American Academy of Arts and Sciences (1997)\n* Member of the American Academy of Arts and Letters (1997)\n* Grammy Award for Best Contemporary Composition for El Dorado (1998)\n* Pulitzer Prize for Music for On the Transmigration of Souls (2003)\n* Grammy Award for Best Classical Album for On the Transmigration of Souls (2005)\n* Grammy Award for Best Orchestral Performance for On the Transmigration of Souls (2005)\n* Grammy Award for Best Classical Contemporary Composition for On the Transmigration of Souls (2005)\n* Harvard Arts Medal (2007)\n*Creative Chair of the Los Angeles Philharmonic (2009–present)\n* Honorary Doctorate of Arts from Northwestern University (2008)\n* Honorary Doctorate of Music from Duquesne University (2009)\n* Honorary Doctorate of Music from Harvard University (2012)\n* Honorary Doctorate of Music from Yale University (2013)\n* Honorary Doctorate of Music from Royal Academy of Music (2015)\n* California Governor's Award for Lifetime Achievement in the Arts\n* Cyril Magnin Award for Outstanding Achievement in the Arts\n* Chevalier dans l'Ordre des Arts et des Lettres (Knight of the Order of Arts and Letters)\n\nPersonal life\n\nAdams' son is the composer Samuel Carl Adams. John Adams (composer). http://en.wikipedia.org/?curid=16518."
  }
}
