{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1957",
  "eid" : "bcd4c5b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778396555,
  "textBody" : "The Alexander Technique (A.T.), named after its creator Frederick Matthias Alexander, is an educational process that attempts to develop the ability to avoid unnecessary muscular tension by retraining physical movement. Alexander believed that poor habits in posture and movement damaged spatial self-awareness; he believed the technique was a mental training technique as well.\n\nAlexander developed his technique's principles in the 1890s in an attempt to address voice loss during public speaking-a probable result of unintentionally retaining childhood asthma breathing problems. He credited his method with allowing him to pursue his passion for reciting in Shakespearean theater.\n\nSome proponents of the Alexander Technique observe that it addresses a variety of health conditions related to cumulative physical behaviors. However, , the sparse supporting medical evidence was of moderate quality and overall, the effectiveness of the Alexander Technique on clinical conditions is uncertain because of insufficient evidence and  because it relies on education and sustained use by the patient. There is evidence suggesting the Alexander Technique is, so far, helpful for long-term back pain, long-term neck pain, and may help people cope with Parkinson's disease.\n\nHistory\n\nFrederick Matthias Alexander (1869–1955) was a Shakespearean orator who developed voice loss during his unamplified performances. After doctors found no physical cause, Alexander reasoned that he was inadvertently damaging himself while speaking. He observed himself in multiple mirrors and saw that he was contracting his posture prior to in preparation for any phonation. He hypothesized that a habitual conditioned pattern (of pulling his head backwards and downwards) needlessly was disrupting the normal working of his total postural, breathing, and vocal processes.\n\nWith experimentation, Alexander developed the ability to stop the unnecessary and habitual contracting in his neck, displacement of his head, and shortening of his stature. As he solved issues about how to do what he imagined was possible, he found that his problem with recurrent voice loss were resolved. While on a recital tour in New Zealand (1895) he began to understand the wider significance of improved carriage for overall physical functioning.  Further, Alexander observed that many individuals commonly tightened their musculature in the similar pattern as he had done, in anticipation of many other activities besides speech.\n\nAlexander believed his work could be applied to improve talent. He further refined his method of self-observation and re-training to teach his discoveries to others. As part of his teaching method, he also developed a form of guided modeling, that imparted the improved kinesthetic and proprioceptive experience to his students. This approach to showing the student what he meant also allowed him to re-arrange the working of a person's entire supportive musculature as it functions in relation to gravity from moment to moment. He explained his reasoning and answers in four books published in 1918, 1923, 1931 (1932 in the UK) and 1942.\n\nHe also trained teachers to teach his work and to use their hands in this unique way from 1930 until his death in 1955. Teacher training was continued during World War II between 1941 and 1943, when Alexander accompanied children and teachers of the Little School to Stow, Massachusetts to join his brother, A. R. Alexander. The American teacher training course included Frank Pierce Jones, who went on to conduct scientific research work to explore aspects of the Alexander Technique at the Tufts Institute for Psychological Research. Jones published many of his studies in professional journals.\n\nSince the 1960s, training schools for teachers of the Alexander Technique were begun in the United States and worldwide. Most were based upon the standards of training laid down by the Society of Teachers of the Alexander Technique that was established in England after Alexander's death in 1955. Quality of training time usually requires 1600 hours of daily teaching experience, because of the challenges of surpassing conditioning. All \"Alexander teachers\" who have the support of their peers are deemed equally qualified, despite differing training methods, because they all agree on F.M. Alexander's principles.\n\nInfluence\n\nThe American philosopher and educator John Dewey became impressed with the Alexander Technique after his headaches, neck pains, blurred vision, and stress symptoms largely improved during the time he used Alexander's advice to change his posture. In 1923, Dewey wrote the introduction to Alexander's Constructive Conscious Control of the Individual.F. M. Alexander, Constructive Conscious Control of the Individual, E. P. Dutton & Co., 1923, \n\nAldous Huxley had transformative lessons with Alexander, and continued doing so with other teachers after moving to the US. He rated Alexander's work highly enough to base the character of the doctor who saves the protagonist in 'Eyeless in Gaza' (an experimental form of autobiographical work) on F.M. Alexander, putting many of his phrases into the character's mouth.Aldous Huxley, Eyeless in Gaza, Chatto & Windus, 1936  F. M. Alexander is named in the last section of Chapter 2.  Miller, the character whose description immediately resembles Alexander, appears at the beginning of Chapter 49. Huxley's work 'The Art of Seeing' also discusses his views on the technique.\n\nSir Stafford Cripps, George Bernard Shaw, Henry Irving and other stage grandees, Lord Lytton and other eminent people of the era also wrote positive appreciations of his work after taking lessons with Alexander.\n\nSince Alexander's work in the field came at the start of the 20th century, his ideas influenced many originators in the field of mind-body improvement. Fritz Perls, who originated Gestalt therapy, credited Alexander as an inspiration for his psychological work.\n The Mitzvah Technique was influenced by the Alexander Technique; as was the Feldenkrais Method - who expanded on the one exercise in Alexander Technique called \"The Whispered Ah.\"\n\nProcess\n\nAlexander's approach emphasizes awareness strategies applied to conducting oneself while in action, (which could be now called 'mindful' action, though in his four books he did not use that term.)\n\nActions such as sitting, squatting, lunging or walking are often selected by the teacher. Other actions may be selected by the student that is tailored to their interests or work activities: hobbies, computer use, lifting, driving or artistic performance or practice, sports, speech or horseback riding. Alexander teachers often use themselves as examples. They demonstrate, explain, and analyze a student's moment-to-moment responses as well as using mirrors, video feedback or classmate observations. Guided modelling with a highly skilled light hand contact is the primary tool for detecting and guiding the student into a more coordinated state in movement and at rest during in-person lessons. Suggestions for improvements are often student-specific, as everyone starts out with slightly different habits.\n\nExercise as a teaching tool is deliberately omitted because of a common mistaken assumption that there exists a \"correct\" position. There are only two specific procedures that are practiced by the student; the first is lying semi-supine. Resting in this way uses \"mechanical advantage\" as a means of redirecting long-term and short-term accumulated muscular tension into a more integrated and balanced state. This position is sometimes referred to as \"constructive rest\", or \"the balanced resting state\". It's also a specific time to practice Alexander's principle of conscious \"directing\" without \"doing\". The second exercise is the \"Whispered Ah\", which is used to co-ordinate freer breathing and vocal production.\n\nFreedom, efficiency and patience are the prescribed values. Proscribed are unnecessary effort, self-limiting habits as well as mistaken perceptual conclusions about the nature of training and experimentation. Students are led to change their largely automatic routines that are interpreted by the teacher to currently or cumulatively be physically limiting, inefficient, or not in keeping with best \"use\" of themselves as a whole. The Alexander teacher provides verbal coaching while monitoring, guiding and preventing unnecessary habits at their source with a specialized hands-on assistance.\n\nThis specialized hands-on skill also allows Alexander teachers to bring about a balanced working of the student's supportive musculature as it relates to gravity's downward pull from moment to moment. Often, students require a great deal of hands-on work in order to first gain an experience of a fully poised relation to gravity and themselves. The hands-on skill requires Alexander teachers to maintain in themselves from moment-to-moment their own improved psycho-physical co-ordination that the teacher is communicating to the student.\n\nAlexander developed terminology to describe his methods, outlined in his four books that explain the experience of learning and substituting new improvements.\n\n;Constructive Conscious Control\nAlexander insisted on the need for strategic reasoning because kinesthetic and proprioceptive sensory awareness are relative senses, not truthful indicators of a person's factual relationships within him/herself or within the environment. A person's habitual neuro-muscular relation to gravity is habitually sensed internally as \"normal,\" despite being inefficient. Alexander's term, \"debauched sensory appreciation\" describes how the repetition of an action or response encourages the formation of habits as a person adapts to various circumstances or builds skills. Once trained and forgotten, completed habits may be used without feedback sensations that these habits are in effect, (even when only thinking about the situations that elicit them.)Body_Learning – An_Introduction to the Alexander Technique, Macmillan, 1996 , quote p. 74, an article in New Scientist by Professor John Basmajian entitled \"Conscious Control of Single Nerve Cells\" Short-sighted habits are capable of becoming harmfully exaggerated over time, such as restricted breathing or other habitually assumed adaptations to past circumstances. Even exaggerated habits will stop after learning to perceive and prevent them.\n\n;End-gaining\nAnother example is the term \"end-gaining\". This term means to focus on a goal so as to lose sight of the \"means-whereby\"The subject of \"Means whereby, rather than the end, to be considered\" is discussed many times in Man's Supreme Inheritance, typically Chapter VI, p. 263 the goal could be most appropriately achieved. According to Alexander teachers, \"end-gaining\" increases the likelihood of automatically selecting older or multiple conflicting coping strategies. End-gaining is usually carried out because an imperative priority of impatience or frustration justifies it. Excessive speed in thinking and acting often facilitates end-gaining. Going slowly is a strategy to undo \"end-gaining.\"\n\n;Inhibition\nIn the Alexander Technique lexicon, the principle of \"inhibition\" is considered by teachers to be the most important to gaining improved \"use.\" F.M. Alexander's selection of this word predates the meaning of the word originated by Sigmund Freud. Inhibition, or 'intentional inhibition'. It is the act of refraining from responding in one's habitual manner - in particular, imposed tension in neck muscles (see Primary Control). Inhibition describes a moment of conscious awareness of a choice to interrupt, stop or entirely prevent an unnecessary habitual \"misuse\". As unnecessary habits are prevented or interrupted, a freer capacity and range of motion resumes and a more spontaneous choice of action or behavior can be discovered, which is experienced by the student as a state of \"non-doing\" or \"allowing.\"\n\n;Primary control\nHow the eyes and head initiate movement governs the training of ourselves in relationship to gravity. Our responses are influenced for good or ill by the qualities of head and eye direction at the inception of any reaction. The qualities and direction of our \"primary control\" occur in every waking moment in response to the stimulus to 'do\" - everything. A person can learn to influence their primary control, improving effortlessness. This influence involves the education of a particular quality of head, neck, torso, and limb relationship that works as we move and respond. A student learns to pay attention during action, without imposing expectations.\n\n;Directions\nTo continue to select and reinforce the often less dominant new ways, it is recommended to repeatedly suggest, by thinking to oneself, a particular series of \"Orders\" or \"Directions.\" \"Giving Directions\" is the expression used for thinking and projecting the positive aspect of how one's self might be used in the most unified psycho-physical way as conveyed by the teacher's hands during a lesson. \n\"Directing\" serves to counteract the common backward and downward pull and shortening in stature that can be detected at the beginning of every movement - particularly addressing a startle pattern of \"fight, flight or freeze.\" A mere thought, as a projection of intention, shapes preparatory movement below the level of sensing it. Alexander used these words for reshaping these subliminal preparations: \"The neck to be free, the head to go forward and up, the back to lengthen and widen.\"  Some teachers have shortened this to a suggestion of, \"Freer?\" Negative directions (that use Alexander's other preventive principle of \"inhibition\") have also been found to be effective, because negative directions leave the positive response open-ended.\nWhichever is used, all \"Directing\" is suggestively thought, (rather than willfully accomplished.) This is because the neuro-muscular responses to \"Directing\" often occur underneath one's ability to perceive how they are actually carried out neuro-physiologically and neuro-cognitively. As freedom of expression or movement is the objective, the most appropriate responses cannot be anticipated or expected, only observed and chosen in the moment. \nTeacher trainees gradually learn to include a constant attending to their lengthening in stature in every movement. It becomes a basis for initiating and continuing every action, every response to stimuli or while remaining constructively at rest.\n\n;Psycho-physical unity\nGlobal concepts such as \"Psycho-physical Unity\" and \"Use\" describe how thinking strategies and attention work together during preparation for an action or for withholding one. They connote the general sequence of how intention joins together with execution to directly affect the perception of events and the outcome of intended results.\n\nUses\n\nThe Alexander Technique is used and taught by classically trained vocal coaches and musicians in schools and private lessons. Its advocates state that it allows for a balanced use of all aspects of the vocal tract by consciously increasing air-flow, allowing improved vocal skill and tone.  The method is said by actors to reduce stage fright and to increase spontaneity.\n\nThe Alexander Technique is a frequent component in acting training, because it can assist the actor in being more natural in performance.\n\nAccording to Alexander Technique instructor Michael J. Gelb, people tend to study the Alexander Technique for reasons of personal development.\n\nMethod \n\nThe Alexander Technique is most commonly taught privately in a series of 10 to 40 private lessons which may last from 30 minutes to an hour. Students are often performers, such as actors, dancers, musicians, athletes and public speakers, people who work on computers, or  those who are in frequent pain for other reasons. Instructors observe their students, then show them how to move with better poise and less strain. Sessions include chair work - often in front of a mirror, during which the instructor and the student will stand, sit and lie down, moving efficiently while maintaining a comfortable relationship between the head, neck and spine, and table work or physical manipulation.\n\nTo qualify as a teacher of Alexander Technique, instructors are required to complete 1,600 hours, spanning three years, of supervised teacher training. The result must be satisfactory to qualified peers to gain membership in professional societies.\n\nHealth effects\n\nSome advocates for the Alexander technique have claimed it can help people with many kinds of health conditions.\n\nOne example is a claim that it can benefit people with asthma. A 2012 Cochrane systematic review found that there is no conclusive evidence that the Alexander technique is effective for treating asthma, and randomized clinical trials are needed in order to assess the effectiveness of this type of treatment approach.\n\nA review by Aetna last updated in 2016 stated: \"Aetna considers the following alternative medicine interventions experimental and investigational, because there is inadequate evidence in the peer-reviewed published medical literature of their effectiveness.\" Included is Alexander technique in that list.\n\nA review published in 2015 and conducted for the Australia Department of Health in order to determine what services the Australian government should pay for, reviewed clinical trials published to date and found that: \"Overall, the evidence was limited by the small number of participants in the intervention arms, wide confidence intervals or a lack of replication of results.\"   It concluded that: \"The Alexander technique may improve short-term pain and disability in people with low back pain, but the longer-term effects remain uncertain. For all other clinical conditions, the effectiveness of Alexander technique was deemed to be uncertain, due to insufficient evidence.\"  It also noted that: \"Evidence for the safety of\nAlexander technique was lacking, with most trials not reporting on this outcome.\n\nA review of evidence for Alexander Technique for various health conditions provided by UK NHS Choices last updated in July 2015 found that:\nThere's evidence suggesting the Alexander technique can help people with:\n* long-term back pain – lessons in the technique may lead to reduced back pain-associated disability and reduce how often you feel pain for up to a year or more\n* long-term neck pain – lessons in the technique may lead to reduced neck pain and associated disability for up to a year or more\n* Parkinson's disease – lessons in the technique may help you carry out everyday tasks more easily and improve how you feel about your condition\n\nNHS Choices also states that \"some research has also suggested the Alexander technique may improve general long-term pain, stammering and balance skills in elderly people to help them avoid falls. But the evidence in these areas is limited and more studies are needed.  There's currently little evidence to suggest the Alexander technique can help improve other health conditions, including asthma, headaches, osteoarthritis, difficulty sleeping (insomnia) and stress.\"\n\nA review published in BMC Complementary and Alternative Medicine in 2014 focused on \"the evidence for the effectiveness of AT sessions on musicians' performance, anxiety, respiratory function and posture\" concluded that: \"Evidence from RCTs and CTs suggests that AT sessions may improve performance anxiety in musicians. Effects on music performance, respiratory function and posture yet remain inconclusive.\"\n\nA review published in the International Journal of Clinical Practice in 2012 found: \"Strong evidence exists for the effectiveness of Alexander Technique lessons for chronic back pain and moderate evidence in Parkinson’s-associated disability. Preliminary evidence suggests that Alexander Technique lessons may lead to improvements in balance skills in the elderly, in general chronic pain, posture, respiratory function and stuttering, but there is insufficient evidence to support recommendations in these areas.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Alexander Technique" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1957" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Alexander Technique (A.T.), named after its creator Frederick Matthias Alexander, is an educational process that attempts to develop the ability to avoid unnecessary muscular tension by retraining physical movement. Alexander believed that poor habits in posture and movement damaged spatial self-awareness; he believed the technique was a mental training technique as well.\n\nAlexander developed his technique's principles in the 1890s in an attempt to address voice loss during public speaking-a probable result of unintentionally retaining childhood asthma breathing problems. He credited his method with allowing him to pursue his passion for reciting in Shakespearean theater.\n\nSome proponents of the Alexander Technique observe that it addresses a variety of health conditions related to cumulative physical behaviors. However, , the sparse supporting medical evidence was of moderate quality and overall, the effectiveness of the Alexander Technique on clinical conditions is uncertain because of insufficient evidence and  because it relies on education and sustained use by the patient. There is evidence suggesting the Alexander Technique is, so far, helpful for long-term back pain, long-term neck pain, and may help people cope with Parkinson's disease.\n\nHistory\n\nFrederick Matthias Alexander (1869–1955) was a Shakespearean orator who developed voice loss during his unamplified performances. After doctors found no physical cause, Alexander reasoned that he was inadvertently damaging himself while speaking. He observed himself in multiple mirrors and saw that he was contracting his posture prior to in preparation for any phonation. He hypothesized that a habitual conditioned pattern (of pulling his head backwards and downwards) needlessly was disrupting the normal working of his total postural, breathing, and vocal processes.\n\nWith experimentation, Alexander developed the ability to stop the unnecessary and habitual contracting in his neck, displacement of his head, and shortening of his stature. As he solved issues about how to do what he imagined was possible, he found that his problem with recurrent voice loss were resolved. While on a recital tour in New Zealand (1895) he began to understand the wider significance of improved carriage for overall physical functioning.  Further, Alexander observed that many individuals commonly tightened their musculature in the similar pattern as he had done, in anticipation of many other activities besides speech.\n\nAlexander believed his work could be applied to improve talent. He further refined his method of self-observation and re-training to teach his discoveries to others. As part of his teaching method, he also developed a form of guided modeling, that imparted the improved kinesthetic and proprioceptive experience to his students. This approach to showing the student what he meant also allowed him to re-arrange the working of a person's entire supportive musculature as it functions in relation to gravity from moment to moment. He explained his reasoning and answers in four books published in 1918, 1923, 1931 (1932 in the UK) and 1942.\n\nHe also trained teachers to teach his work and to use their hands in this unique way from 1930 until his death in 1955. Teacher training was continued during World War II between 1941 and 1943, when Alexander accompanied children and teachers of the Little School to Stow, Massachusetts to join his brother, A. R. Alexander. The American teacher training course included Frank Pierce Jones, who went on to conduct scientific research work to explore aspects of the Alexander Technique at the Tufts Institute for Psychological Research. Jones published many of his studies in professional journals.\n\nSince the 1960s, training schools for teachers of the Alexander Technique were begun in the United States and worldwide. Most were based upon the standards of training laid down by the Society of Teachers of the Alexander Technique that was established in England after Alexander's death in 1955. Quality of training time usually requires 1600 hours of daily teaching experience, because of the challenges of surpassing conditioning. All \"Alexander teachers\" who have the support of their peers are deemed equally qualified, despite differing training methods, because they all agree on F.M. Alexander's principles.\n\nInfluence\n\nThe American philosopher and educator John Dewey became impressed with the Alexander Technique after his headaches, neck pains, blurred vision, and stress symptoms largely improved during the time he used Alexander's advice to change his posture. In 1923, Dewey wrote the introduction to Alexander's Constructive Conscious Control of the Individual.F. M. Alexander, Constructive Conscious Control of the Individual, E. P. Dutton & Co., 1923, \n\nAldous Huxley had transformative lessons with Alexander, and continued doing so with other teachers after moving to the US. He rated Alexander's work highly enough to base the character of the doctor who saves the protagonist in 'Eyeless in Gaza' (an experimental form of autobiographical work) on F.M. Alexander, putting many of his phrases into the character's mouth.Aldous Huxley, Eyeless in Gaza, Chatto & Windus, 1936  F. M. Alexander is named in the last section of Chapter 2.  Miller, the character whose description immediately resembles Alexander, appears at the beginning of Chapter 49. Huxley's work 'The Art of Seeing' also discusses his views on the technique.\n\nSir Stafford Cripps, George Bernard Shaw, Henry Irving and other stage grandees, Lord Lytton and other eminent people of the era also wrote positive appreciations of his work after taking lessons with Alexander.\n\nSince Alexander's work in the field came at the start of the 20th century, his ideas influenced many originators in the field of mind-body improvement. Fritz Perls, who originated Gestalt therapy, credited Alexander as an inspiration for his psychological work.\n The Mitzvah Technique was influenced by the Alexander Technique; as was the Feldenkrais Method - who expanded on the one exercise in Alexander Technique called \"The Whispered Ah.\"\n\nProcess\n\nAlexander's approach emphasizes awareness strategies applied to conducting oneself while in action, (which could be now called 'mindful' action, though in his four books he did not use that term.)\n\nActions such as sitting, squatting, lunging or walking are often selected by the teacher. Other actions may be selected by the student that is tailored to their interests or work activities: hobbies, computer use, lifting, driving or artistic performance or practice, sports, speech or horseback riding. Alexander teachers often use themselves as examples. They demonstrate, explain, and analyze a student's moment-to-moment responses as well as using mirrors, video feedback or classmate observations. Guided modelling with a highly skilled light hand contact is the primary tool for detecting and guiding the student into a more coordinated state in movement and at rest during in-person lessons. Suggestions for improvements are often student-specific, as everyone starts out with slightly different habits.\n\nExercise as a teaching tool is deliberately omitted because of a common mistaken assumption that there exists a \"correct\" position. There are only two specific procedures that are practiced by the student; the first is lying semi-supine. Resting in this way uses \"mechanical advantage\" as a means of redirecting long-term and short-term accumulated muscular tension into a more integrated and balanced state. This position is sometimes referred to as \"constructive rest\", or \"the balanced resting state\". It's also a specific time to practice Alexander's principle of conscious \"directing\" without \"doing\". The second exercise is the \"Whispered Ah\", which is used to co-ordinate freer breathing and vocal production.\n\nFreedom, efficiency and patience are the prescribed values. Proscribed are unnecessary effort, self-limiting habits as well as mistaken perceptual conclusions about the nature of training and experimentation. Students are led to change their largely automatic routines that are interpreted by the teacher to currently or cumulatively be physically limiting, inefficient, or not in keeping with best \"use\" of themselves as a whole. The Alexander teacher provides verbal coaching while monitoring, guiding and preventing unnecessary habits at their source with a specialized hands-on assistance.\n\nThis specialized hands-on skill also allows Alexander teachers to bring about a balanced working of the student's supportive musculature as it relates to gravity's downward pull from moment to moment. Often, students require a great deal of hands-on work in order to first gain an experience of a fully poised relation to gravity and themselves. The hands-on skill requires Alexander teachers to maintain in themselves from moment-to-moment their own improved psycho-physical co-ordination that the teacher is communicating to the student.\n\nAlexander developed terminology to describe his methods, outlined in his four books that explain the experience of learning and substituting new improvements.\n\n;Constructive Conscious Control\nAlexander insisted on the need for strategic reasoning because kinesthetic and proprioceptive sensory awareness are relative senses, not truthful indicators of a person's factual relationships within him/herself or within the environment. A person's habitual neuro-muscular relation to gravity is habitually sensed internally as \"normal,\" despite being inefficient. Alexander's term, \"debauched sensory appreciation\" describes how the repetition of an action or response encourages the formation of habits as a person adapts to various circumstances or builds skills. Once trained and forgotten, completed habits may be used without feedback sensations that these habits are in effect, (even when only thinking about the situations that elicit them.)Body_Learning – An_Introduction to the Alexander Technique, Macmillan, 1996 , quote p. 74, an article in New Scientist by Professor John Basmajian entitled \"Conscious Control of Single Nerve Cells\" Short-sighted habits are capable of becoming harmfully exaggerated over time, such as restricted breathing or other habitually assumed adaptations to past circumstances. Even exaggerated habits will stop after learning to perceive and prevent them.\n\n;End-gaining\nAnother example is the term \"end-gaining\". This term means to focus on a goal so as to lose sight of the \"means-whereby\"The subject of \"Means whereby, rather than the end, to be considered\" is discussed many times in Man's Supreme Inheritance, typically Chapter VI, p. 263 the goal could be most appropriately achieved. According to Alexander teachers, \"end-gaining\" increases the likelihood of automatically selecting older or multiple conflicting coping strategies. End-gaining is usually carried out because an imperative priority of impatience or frustration justifies it. Excessive speed in thinking and acting often facilitates end-gaining. Going slowly is a strategy to undo \"end-gaining.\"\n\n;Inhibition\nIn the Alexander Technique lexicon, the principle of \"inhibition\" is considered by teachers to be the most important to gaining improved \"use.\" F.M. Alexander's selection of this word predates the meaning of the word originated by Sigmund Freud. Inhibition, or 'intentional inhibition'. It is the act of refraining from responding in one's habitual manner - in particular, imposed tension in neck muscles (see Primary Control). Inhibition describes a moment of conscious awareness of a choice to interrupt, stop or entirely prevent an unnecessary habitual \"misuse\". As unnecessary habits are prevented or interrupted, a freer capacity and range of motion resumes and a more spontaneous choice of action or behavior can be discovered, which is experienced by the student as a state of \"non-doing\" or \"allowing.\"\n\n;Primary control\nHow the eyes and head initiate movement governs the training of ourselves in relationship to gravity. Our responses are influenced for good or ill by the qualities of head and eye direction at the inception of any reaction. The qualities and direction of our \"primary control\" occur in every waking moment in response to the stimulus to 'do\" - everything. A person can learn to influence their primary control, improving effortlessness. This influence involves the education of a particular quality of head, neck, torso, and limb relationship that works as we move and respond. A student learns to pay attention during action, without imposing expectations.\n\n;Directions\nTo continue to select and reinforce the often less dominant new ways, it is recommended to repeatedly suggest, by thinking to oneself, a particular series of \"Orders\" or \"Directions.\" \"Giving Directions\" is the expression used for thinking and projecting the positive aspect of how one's self might be used in the most unified psycho-physical way as conveyed by the teacher's hands during a lesson. \n\"Directing\" serves to counteract the common backward and downward pull and shortening in stature that can be detected at the beginning of every movement - particularly addressing a startle pattern of \"fight, flight or freeze.\" A mere thought, as a projection of intention, shapes preparatory movement below the level of sensing it. Alexander used these words for reshaping these subliminal preparations: \"The neck to be free, the head to go forward and up, the back to lengthen and widen.\"  Some teachers have shortened this to a suggestion of, \"Freer?\" Negative directions (that use Alexander's other preventive principle of \"inhibition\") have also been found to be effective, because negative directions leave the positive response open-ended.\nWhichever is used, all \"Directing\" is suggestively thought, (rather than willfully accomplished.) This is because the neuro-muscular responses to \"Directing\" often occur underneath one's ability to perceive how they are actually carried out neuro-physiologically and neuro-cognitively. As freedom of expression or movement is the objective, the most appropriate responses cannot be anticipated or expected, only observed and chosen in the moment. \nTeacher trainees gradually learn to include a constant attending to their lengthening in stature in every movement. It becomes a basis for initiating and continuing every action, every response to stimuli or while remaining constructively at rest.\n\n;Psycho-physical unity\nGlobal concepts such as \"Psycho-physical Unity\" and \"Use\" describe how thinking strategies and attention work together during preparation for an action or for withholding one. They connote the general sequence of how intention joins together with execution to directly affect the perception of events and the outcome of intended results.\n\nUses\n\nThe Alexander Technique is used and taught by classically trained vocal coaches and musicians in schools and private lessons. Its advocates state that it allows for a balanced use of all aspects of the vocal tract by consciously increasing air-flow, allowing improved vocal skill and tone.  The method is said by actors to reduce stage fright and to increase spontaneity.\n\nThe Alexander Technique is a frequent component in acting training, because it can assist the actor in being more natural in performance.\n\nAccording to Alexander Technique instructor Michael J. Gelb, people tend to study the Alexander Technique for reasons of personal development.\n\nMethod \n\nThe Alexander Technique is most commonly taught privately in a series of 10 to 40 private lessons which may last from 30 minutes to an hour. Students are often performers, such as actors, dancers, musicians, athletes and public speakers, people who work on computers, or  those who are in frequent pain for other reasons. Instructors observe their students, then show them how to move with better poise and less strain. Sessions include chair work - often in front of a mirror, during which the instructor and the student will stand, sit and lie down, moving efficiently while maintaining a comfortable relationship between the head, neck and spine, and table work or physical manipulation.\n\nTo qualify as a teacher of Alexander Technique, instructors are required to complete 1,600 hours, spanning three years, of supervised teacher training. The result must be satisfactory to qualified peers to gain membership in professional societies.\n\nHealth effects\n\nSome advocates for the Alexander technique have claimed it can help people with many kinds of health conditions.\n\nOne example is a claim that it can benefit people with asthma. A 2012 Cochrane systematic review found that there is no conclusive evidence that the Alexander technique is effective for treating asthma, and randomized clinical trials are needed in order to assess the effectiveness of this type of treatment approach.\n\nA review by Aetna last updated in 2016 stated: \"Aetna considers the following alternative medicine interventions experimental and investigational, because there is inadequate evidence in the peer-reviewed published medical literature of their effectiveness.\" Included is Alexander technique in that list.\n\nA review published in 2015 and conducted for the Australia Department of Health in order to determine what services the Australian government should pay for, reviewed clinical trials published to date and found that: \"Overall, the evidence was limited by the small number of participants in the intervention arms, wide confidence intervals or a lack of replication of results.\"   It concluded that: \"The Alexander technique may improve short-term pain and disability in people with low back pain, but the longer-term effects remain uncertain. For all other clinical conditions, the effectiveness of Alexander technique was deemed to be uncertain, due to insufficient evidence.\"  It also noted that: \"Evidence for the safety of\nAlexander technique was lacking, with most trials not reporting on this outcome.\n\nA review of evidence for Alexander Technique for various health conditions provided by UK NHS Choices last updated in July 2015 found that:\nThere's evidence suggesting the Alexander technique can help people with:\n* long-term back pain – lessons in the technique may lead to reduced back pain-associated disability and reduce how often you feel pain for up to a year or more\n* long-term neck pain – lessons in the technique may lead to reduced neck pain and associated disability for up to a year or more\n* Parkinson's disease – lessons in the technique may help you carry out everyday tasks more easily and improve how you feel about your condition\n\nNHS Choices also states that \"some research has also suggested the Alexander technique may improve general long-term pain, stammering and balance skills in elderly people to help them avoid falls. But the evidence in these areas is limited and more studies are needed.  There's currently little evidence to suggest the Alexander technique can help improve other health conditions, including asthma, headaches, osteoarthritis, difficulty sleeping (insomnia) and stress.\"\n\nA review published in BMC Complementary and Alternative Medicine in 2014 focused on \"the evidence for the effectiveness of AT sessions on musicians' performance, anxiety, respiratory function and posture\" concluded that: \"Evidence from RCTs and CTs suggests that AT sessions may improve performance anxiety in musicians. Effects on music performance, respiratory function and posture yet remain inconclusive.\"\n\nA review published in the International Journal of Clinical Practice in 2012 found: \"Strong evidence exists for the effectiveness of Alexander Technique lessons for chronic back pain and moderate evidence in Parkinson’s-associated disability. Preliminary evidence suggests that Alexander Technique lessons may lead to improvements in balance skills in the elderly, in general chronic pain, posture, respiratory function and stuttering, but there is insufficient evidence to support recommendations in these areas.\". Alexander Technique. http://en.wikipedia.org/?curid=1957."
  }
}
