{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19603",
  "eid" : "3c5463e0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778610462,
  "textBody" : "The Manhattan Project was a research and development undertaking during World War II that produced the first nuclear weapons. It was led by the United States with the support of the United Kingdom and Canada. From 1942 to 1946, the project was under the direction of Major General Leslie Groves of the U.S. Army Corps of Engineers. Nuclear physicist Robert Oppenheimer was the director of the Los Alamos Laboratory that designed the actual bombs. The Army component of the project was designated the Manhattan District; \"Manhattan\" gradually superseded the official codename, Development of Substitute Materials, for the entire project. Along the way, the project absorbed its earlier British counterpart, Tube Alloys. The Manhattan Project began modestly in 1939, but grew to employ more than 130,000 people and cost nearly US $2 billion (about $ in  dollars). Over 90% of the cost was for building factories and to produce fissile material, with less than 10% for development and production of the weapons. Research and production took place at more than 30 sites across the United States, the United Kingdom, and Canada.\n\nTwo types of atomic bombs were developed concurrently during the war: a relatively simple gun-type fission weapon and a more complex implosion-type nuclear weapon. The Thin Man gun-type design proved impractical to use with plutonium so a simpler gun-type called Little Boy was developed that used uranium-235, an isotope that makes up only 0.7 percent of natural uranium. Chemically identical to the most common isotope, uranium-238, and with almost the same mass, it proved difficult to separate the two. Three methods were employed for uranium enrichment: electromagnetic, gaseous and thermal. Most of this work was performed at the Clinton Engineer Works at Oak Ridge, Tennessee.\n\nIn parallel with the work on uranium was an effort to produce plutonium. After the feasibility of the world's first artificial nuclear reactor was demonstrated in Chicago at the Metallurgical Laboratory, it designed the X-10 Graphite Reactor at Oak Ridge and the production reactors in Hanford, Washington, in which uranium was irradiated and transmuted into plutonium. The plutonium was then chemically separated from the uranium. The Fat Man implosion-type weapon was developed in a concerted design and development effort by the Los Alamos Laboratory.\n\nThe project was also charged with gathering intelligence on the German nuclear weapon project. Through Operation Alsos, Manhattan Project personnel served in Europe, sometimes behind enemy lines, where they gathered nuclear materials and documents, and rounded up German scientists. Despite the Manhattan Project's tight security, Soviet atomic spies successfully penetrated the program.\n\nThe first nuclear device ever detonated was an implosion-type bomb at the Trinity test, conducted at New Mexico's Alamogordo Bombing and Gunnery Range on 16 July 1945. Little Boy and Fat Man bombs were used a month later in the atomic bombings of Hiroshima and Nagasaki, respectively. In the immediate postwar years, the Manhattan Project conducted weapons testing at Bikini Atoll as part of Operation Crossroads, developed new weapons, promoted the development of the network of national laboratories, supported medical research into radiology and laid the foundations for the nuclear navy. It maintained control over American atomic weapons research and production until the formation of the United States Atomic Energy Commission in January 1947.\n\nOrigins\n\nThe discovery of nuclear fission by German chemists Otto Hahn and Fritz Strassmann in 1938, and its theoretical explanation by Lise Meitner and Otto Frisch, made the development of an atomic bomb a theoretical possibility. There were fears that a German atomic bomb project would develop one first, especially among scientists who were refugees from Nazi Germany and other fascist countries. In August 1939, Hungarian-born physicists Leó Szilárd and Eugene Wigner drafted the Einstein–Szilárd letter, which warned of the potential development of \"extremely powerful bombs of a new type\". It urged the United States to take steps to acquire stockpiles of uranium ore and accelerate the research of Enrico Fermi and others into nuclear chain reactions. They had it signed by Albert Einstein and delivered to President Franklin D. Roosevelt. Roosevelt called on Lyman Briggs of the National Bureau of Standards to head the Advisory Committee on Uranium to investigate the issues raised by the letter. Briggs held a meeting on 21 October 1939, which was attended by Szilárd, Wigner and Edward Teller. The committee reported back to Roosevelt in November that uranium \"would provide a possible source of bombs with a destructiveness vastly greater than anything now known.\".\n\nThe Advisory Committee on Uranium became the National Defense Research Committee (NDRC) Committee on Uranium when that organization was formed on 27 June 1940.. Briggs proposed spending $167,000 on research into uranium, particularly the uranium-235 isotope, and the recently discovered plutonium. On 28 June 1941, Roosevelt signed Executive Order 8807, which created the Office of Scientific Research and Development (OSRD), with Vannevar Bush as its director. The office was empowered to engage in large engineering projects in addition to research.. The NDRC Committee on Uranium became the S-1 Section of the OSRD; the word \"uranium\" was dropped for security reasons..\n\nIn Britain, Frisch and Rudolf Peierls at the University of Birmingham had made a breakthrough investigating the critical mass of uranium-235 in June 1939.. Their calculations indicated that it was within an order of magnitude of 10 kg, which was small enough to be carried by a bomber of the day.. Their March 1940 Frisch–Peierls memorandum initiated the British atomic bomb project and its Maud Committee,. which unanimously recommended pursuing the development of an atomic bomb. In July 1940, Britain had offered to give the United States access to its scientific research, and the Tizard Mission's John Cockcroft briefed American scientists on British developments. He discovered that the American project was smaller than the British, and not as far advanced.\n\nAs part of the scientific exchange, the Maud Committee's findings were conveyed to the United States. One of its members, the Australian physicist Mark Oliphant, flew to the United States in late August 1941 and discovered that data provided by the Maud Committee had not reached key American physicists. Oliphant then set out to find out why the committee's findings were apparently being ignored. He met with the Uranium Committee and visited Berkeley, California, where he spoke persuasively to Ernest O. Lawrence. Lawrence was sufficiently impressed to commence his own research into uranium. He in turn spoke to James B. Conant, Arthur H. Compton and George B. Pegram. Oliphant's mission was therefore a success; key American physicists were now aware of the potential power of an atomic bomb...\n\nOn 9 October 1941, President Roosevelt approved the atomic program after he convened a meeting with Vannevar Bush and Vice President Henry A. Wallace. To control the program, he created a Top Policy Group consisting of himself—although he never attended a meeting—Wallace, Bush, Conant, Secretary of War Henry L. Stimson, and the Chief of Staff of the Army, General George C. Marshall. Roosevelt chose the Army to run the project rather than the Navy, because the Army had more experience with management of large-scale construction projects. He also agreed to coordinate the effort with that of the British, and on 11 October he sent a message to Prime Minister Winston Churchill, suggesting that they correspond on atomic matters..\n\nFeasibility\n\nProposals\n\nThe S-1 Committee held its meeting on 18 December 1941 \"pervaded by an atmosphere of enthusiasm and urgency\". in the wake of the attack on Pearl Harbor and the subsequent United States declaration of war upon Japan and then on Germany.. Work was proceeding on three different techniques for isotope separation to separate uranium-235 from the more abundant uranium-238. Lawrence and his team at the University of California, Berkeley, investigated electromagnetic separation, while Eger Murphree and Jesse Wakefield Beams's team looked into gaseous diffusion at Columbia University, and Philip Abelson directed research into thermal diffusion at the Carnegie Institution of Washington and later the Naval Research Laboratory. Murphree was also the head of an unsuccessful separation project using gas centrifuges..\n\nMeanwhile, there were two lines of research into nuclear reactor technology, with Harold Urey continuing research into heavy water at Columbia, while Arthur Compton brought the scientists working under his supervision from Columbia, California and Princeton University to join his team at the University of Chicago, where he organized the Metallurgical Laboratory in early 1942 to study plutonium and reactors using graphite as a neutron moderator.. Briggs, Compton, Lawrence, Murphree, and Urey met on 23 May 1942 to finalize the S-1 Committee recommendations, which called for all five technologies to be pursued. This was approved by Bush, Conant, and Brigadier General Wilhelm D. Styer, the chief of staff of Major General Brehon B. Somervell's Services of Supply, who had been designated the Army's representative on nuclear matters. Bush and Conant then took the recommendation to the Top Policy Group with a budget proposal for $54 million for construction by the United States Army Corps of Engineers, $31 million for research and development by OSRD and $5 million for contingencies in fiscal year 1943. The Top Policy Group in turn sent it to the President on 17 June 1942 and he approved it by writing \"OK FDR\" on the document..\n\nBomb design concepts\n\nCompton asked theoretical physicist J. Robert Oppenheimer of the University of California, Berkeley, to take over research into fast neutron calculations—the key to calculations of critical mass and weapon detonation—from Gregory Breit, who had quit on 18 May 1942 because of concerns over lax operational security.. John H. Manley, a physicist at the Metallurgical Laboratory, was assigned to assist Oppenheimer by contacting and coordinating experimental physics groups scattered across the country.. Oppenheimer and Robert Serber of the University of Illinois examined the problems of neutron diffusion—how neutrons moved in a nuclear chain reaction—and hydrodynamics—how the explosion produced by a chain reaction might behave. To review this work and the general theory of fission reactions, Oppenheimer and Fermi convened meetings at the University of Chicago in June and at the University of California, Berkeley, in July 1942 with theoretical physicists Hans Bethe, John Van Vleck, Edward Teller, Emil Konopinski, Robert Serber, Stan Frankel, and Eldred C. Nelson, the latter three former students of Oppenheimer, and experimental physicists Emilio Segrè, Felix Bloch, Franco Rasetti, John Henry Manley, and Edwin McMillan. They tentatively confirmed that a fission bomb was theoretically possible.\n\nThere were still many unknown factors. The properties of pure uranium-235 were relatively unknown, as were those of plutonium, an element that had only been discovered in February 1941 by Glenn Seaborg and his team. The scientists at the Berkeley conference envisioned creating plutonium in nuclear reactors where uranium-238 atoms absorbed neutrons that had been emitted from fissioning uranium-235 atoms. At this point no reactor had been built, and only tiny quantities of plutonium were available from cyclotrons.. Even by December 1943, only two milligrams had been produced.. There were many ways of arranging the fissile material into a critical mass. The simplest was shooting a \"cylindrical plug\" into a sphere of \"active material\" with a \"tamper\"—dense material that would focus neutrons inward and keep the reacting mass together to increase its efficiency.. They also explored designs involving spheroids, a primitive form of \"implosion\" suggested by Richard C. Tolman, and the possibility of autocatalytic methods, which would increase the efficiency of the bomb as it exploded.\n\nConsidering the idea of the fission bomb theoretically settled—at least until more experimental data was available—the Berkeley conference then turned in a different direction. Edward Teller pushed for discussion of a more powerful bomb: the \"super\", now usually referred to as a \"hydrogen bomb\", which would use the explosive force of a detonating fission bomb to ignite a nuclear fusion reaction in deuterium and tritium.. Teller proposed scheme after scheme, but Bethe refused each one. The fusion idea was put aside to concentrate on producing fission bombs. Teller also raised the speculative possibility that an atomic bomb might \"ignite\" the atmosphere because of a hypothetical fusion reaction of nitrogen nuclei. Bethe calculated that it could not happen,. and a report co-authored by Teller showed that \"no self-propagating chain of nuclear reactions is likely to be started.\" In Serber's account, Oppenheimer mentioned it to Arthur Compton, who \"didn't have enough sense to shut up about it. It somehow got into a document that went to Washington\" and was \"never laid to rest\".\n\nOrganization\n\nManhattan District\n\nThe Chief of Engineers, Major General Eugene Reybold, selected Colonel James C. Marshall to head the Army's part of the project in June 1942. Marshall created a liaison office in Washington, D.C., but established his temporary headquarters on the 18th floor of 270 Broadway in New York, where he could draw on administrative support from the Corps of Engineers' North Atlantic Division. It was close to the Manhattan office of Stone & Webster, the principal project contractor, and to Columbia University. He had permission to draw on his former command, the Syracuse District, for staff, and he started with Lieutenant Colonel Kenneth Nichols, who became his deputy..\n\nBecause most of his task involved construction, Marshall worked in cooperation with the head of the Corps of Engineers Construction Division, Major General Thomas M. Robbins, and his deputy, Colonel Leslie Groves. Reybold, Somervell and Styer decided to call the project \"Development of Substitute Materials\", but Groves felt that this would draw attention. Since engineer districts normally carried the name of the city where they were located, Marshall and Groves agreed to name the Army's component of the project the Manhattan District. This became official on 13 August, when Reybold issued the order creating the new district. Informally, it was known as the Manhattan Engineer District, or MED. Unlike other districts, it had no geographic boundaries, and Marshall had the authority of a division engineer. Development of Substitute Materials remained as the official codename of the project as a whole, but was supplanted over time by \"Manhattan\".\n\nMarshall later conceded that, \"I had never heard of atomic fission but I did know that you could not build much of a plant, much less four of them for $90 million.\". A single TNT plant that Nichols had recently built in Pennsylvania had cost $128 million.. Nor were they impressed with estimates to the nearest order of magnitude, which Groves compared with telling a caterer to prepare for between ten and a thousand guests.. A survey team from Stone & Webster had already scouted a site for the production plants. The War Production Board recommended sites around Knoxville, Tennessee, an isolated area where the Tennessee Valley Authority could supply ample electric power and the rivers could provide cooling water for the reactors. After examining several sites, the survey team selected one near Elza, Tennessee. Conant advised that it be acquired at once and Styer agreed but Marshall temporized, awaiting the results of Conant's reactor experiments before taking action.. Of the prospective processes, only Lawrence's electromagnetic separation appeared sufficiently advanced for construction to commence..\n\nMarshall and Nichols began assembling the resources they would need. The first step was to obtain a high priority rating for the project. The top ratings were AA-1 through AA-4 in descending order, although there was also a special AAA rating reserved for emergencies. Ratings AA-1 and AA-2 were for essential weapons and equipment, so Colonel Lucius D. Clay, the deputy chief of staff at Services and Supply for requirements and resources, felt that the highest rating he could assign was AA-3, although he was willing to provide a AAA rating on request for critical materials if the need arose.. Nichols and Marshall were disappointed; AA-3 was the same priority as Nichols' TNT plant in Pennsylvania..\n\nMilitary Policy Committee\n\nBush became dissatisfied with Colonel Marshall's failure to get the project moving forward expeditiously, specifically the failure to acquire the Tennessee site, the low priority allocated to the project by the Army and the location of his headquarters in New York City.. Bush felt that more aggressive leadership was required, and spoke to Harvey Bundy and Generals Marshall, Somervell, and Styer about his concerns. He wanted the project placed under a senior policy committee, with a prestigious officer, preferably Styer, as overall director.\n\nSomervell and Styer selected Groves for the post, informing him on 17 September of this decision, and that General Marshall ordered that he be promoted to brigadier general,. as it was felt that the title \"general\" would hold more sway with the academic scientists working on the Manhattan Project.. Groves' orders placed him directly under Somervell rather than Reybold, with Colonel Marshall now answerable to Groves.. Groves established his headquarters in Washington, D.C., on the fifth floor of the New War Department Building, where Colonel Marshall had his liaison office.. He assumed command of the Manhattan Project on 23 September. Later that day, he attended a meeting called by Stimson, which established a Military Policy Committee, responsible to the Top Policy Group, consisting of Bush (with Conant as an alternate), Styer and Rear Admiral William R. Purnell. Tolman and Conant were later appointed as Groves' scientific advisers..\n\nOn 19 September, Groves went to Donald Nelson, the chairman of the War Production Board, and asked for broad authority to issue a AAA rating whenever it was required. Nelson initially balked but quickly caved in when Groves threatened to go to the President.. Groves promised not to use the AAA rating unless it was necessary. It soon transpired that for the routine requirements of the project the AAA rating was too high but the AA-3 rating was too low. After a long campaign, Groves finally received AA-1 authority on 1 July 1944.. According to Groves, \"In Washington you became aware of the importance of top priority. Most everything proposed in the Roosevelt administration would have top priority. That would last for about a week or two and then something else would get top priority\".\n\nOne of Groves' early problems was to find a director for Project Y, the group that would design and build the bomb. The obvious choice was one of the three laboratory heads, Urey, Lawrence, or Compton, but they could not be spared. Compton recommended Oppenheimer, who was already intimately familiar with the bomb design concepts. However, Oppenheimer had little administrative experience, and, unlike Urey, Lawrence, and Compton, had not won a Nobel Prize, which many scientists felt that the head of such an important laboratory should have. There were also concerns about Oppenheimer's security status, as many of his associates were Communists, including his brother, Frank Oppenheimer; his wife, Kitty; and his girlfriend, Jean Tatlock. A long conversation on a train in October 1942 convinced Groves and Nichols that Oppenheimer thoroughly understood the issues involved in setting up a laboratory in a remote area and should be appointed as its director. Groves personally waived the security requirements and issued Oppenheimer a clearance on 20 July 1943...\n\nCollaboration with the United Kingdom\n\nThe British and Americans exchanged nuclear information but did not initially combine their efforts. Britain rebuffed attempts by Bush and Conant in 1941 to strengthen cooperation with its own project, codenamed Tube Alloys, because it was reluctant to share its technological lead and help the United States develop its own atomic bomb.. An American scientist who brought a personal letter from Roosevelt to Churchill offering to pay for all research and development in an Anglo-American project was poorly treated, and Churchill did not reply to the letter. The United States as a result decided as early as April 1942 that if its offer was rejected, they should proceed alone. The British, who had made significant contributions early in the war, did not have the resources to carry through such a research program while fighting for their survival. As a result, Tube Alloys soon fell behind its American counterpart.. and on 30 July 1942, Sir John Anderson, the minister responsible for Tube Alloys, advised Churchill that: \"We must face the fact that ... [our] pioneering work ... is a dwindling asset and that, unless we capitalise it quickly, we shall be outstripped. We now have a real contribution to make to a 'merger.' Soon we shall have little or none.\". That month Churchill and Roosevelt made an informal, unwritten agreement for atomic collaboration.\n\nThe opportunity for an equal partnership no longer existed, however, as shown in August 1942 when the British unsuccessfully demanded substantial control over the project while paying none of the costs. By 1943 the roles of the two countries had reversed from late 1941; in January Conant notified the British that they would no longer receive atomic information except in certain areas. While the British were shocked by the abrogation of the Churchill-Roosevelt agreement, head of the Canadian National Research Council C. J. Mackenzie was less surprised, writing \"I can't help feeling that the United Kingdom group [over] emphasizes the importance of their contribution as compared with the Americans.\" As Conant and Bush told the British, the order came \"from the top\"..\n\nThe British bargaining position had worsened; the American scientists had decided that the United States no longer needed outside help, and they wanted to prevent Britain exploiting post-war commercial applications of atomic energy. The committee supported, and Roosevelt agreed to, restricting the flow of information to what Britain could use during the war—especially not bomb design—even if doing so slowed down the American project. By early 1943 the British stopped sending research and scientists to America, and as a result the Americans stopped all information sharing. The British considered ending the supply of Canadian uranium and heavy water to force the Americans to again share, but Canada needed American supplies to produce them.. They investigated the possibility of an independent nuclear program, but determined that it could not be ready in time to affect the outcome of the war in Europe.\n\nBy March 1943 Conant decided that British help would benefit some areas of the project. James Chadwick and one or two other British scientists were important enough that the bomb design team at Los Alamos needed them, despite the risk of revealing weapon design secrets.. In August 1943 Churchill and Roosevelt negotiated the Quebec Agreement, which resulted in a resumption of cooperation. between scientists working on the same problem. Britain, however, agreed to restrictions on data on the building of large-scale production plants necessary for the bomb.. The subsequent Hyde Park Agreement in September 1944 extended this cooperation to the postwar period.. The Quebec Agreement established the Combined Policy Committee to coordinate the efforts of the United States, United Kingdom and Canada. Stimson, Bush and Conant served as the American members of the Combined Policy Committee, Field Marshal Sir John Dill and Colonel J. J. Llewellin were the British members, and C. D. Howe was the Canadian member.. Llewellin returned to the United Kingdom at the end of 1943 and was replaced on the committee by Sir Ronald Ian Campbell, who in turn was replaced by the British Ambassador to the United States, Lord Halifax, in early 1945. Sir John Dill died in Washington, D.C., in November 1944 and was replaced both as Chief of the British Joint Staff Mission and as a member of the Combined Policy Committee by Field Marshal Sir Henry Maitland Wilson..\n\nWhen cooperation resumed after the Quebec agreement, the Americans' progress and expenditures amazed the British. The United States had already spent more than $1 billion ($ today), while in 1943, the United Kingdom had spent about £0.5 million. Chadwick thus pressed for British involvement in the Manhattan Project to the fullest extent and abandon any hopes of a British project during the war. With Churchill's backing, he attempted to ensure that every request from Groves for assistance was honored.. The British Mission that arrived in the United States in December 1943 included Niels Bohr, Otto Frisch, Klaus Fuchs, Rudolf Peierls, and Ernest Titterton.. More scientists arrived in early 1944. While those assigned to gaseous diffusion left by the fall of 1944, the 35 working with Lawrence at Berkeley were assigned to existing laboratory groups and stayed until the end of the war. The 19 sent to Los Alamos also joined existing groups, primarily related to implosion and bomb assembly, but not the plutonium-related ones. Part of the Quebec Agreement specified that nuclear weapons would not be used against another country without mutual consent. In June 1945, Wilson agreed that the use of nuclear weapons against Japan would be recorded as a decision of the Combined Policy Committee..\n\nThe Combined Policy Committee created the Combined Development Trust in June 1944, with Groves as its chairman, to procure uranium and thorium ores on international markets. The Belgian Congo and Canada held much of the world's uranium outside Eastern Europe, and the Belgian government in exile was in London. Britain agreed to give the United States most of the Belgian ore, as it could not use most of the supply without restricted American research.. In 1944, the Trust purchased 3440000 lb of uranium oxide ore from companies operating mines in the Belgian Congo. In order to avoid briefing US Secretary of the Treasury Henry Morgenthau Jr. on the project, a special account not subject to the usual auditing and controls was used to hold Trust monies. Between 1944 and the time he resigned from the Trust in 1947, Groves deposited a total of $37.5 million into the Trust's account..\n\nGroves appreciated the early British atomic research and the British scientists' contributions to the Manhattan Project, but stated that the United States would have succeeded without them. He also said that Churchill was \"the best friend the atomic bomb project had [as] he kept Roosevelt's interest up ... He just stirred him up all the time by telling him how important he thought the project was.\"\n\nThe British wartime participation was crucial to the success of the United Kingdom's independent nuclear weapons program after the war when the McMahon Act of 1946 temporarily ended American nuclear cooperation.\n\nProject sites\n\nFile:Manhattan Project US Canada Map 2.svg|thumb|700px|center|A selection of US and Canadian sites important to the Manhattan Project. Click on the location for more information.|alt=Map of the United States and southern Canada with major project sites marked\ncircle  50 280 20 Berkeley, California\ncircle 140 400 20 Inyokern, California\ncircle 170 100 20 Richland, Washington\ncircle 220  20 20 Trail, British Columbia\ncircle 230 270 20 Wendover, Utah\ncircle 290 360 20 Monticello, Utah\ncircle 320 360 20 Uravan, Colorado\ncircle 340 440 20 Los Alamos, New Mexico\ncircle 340 500 20 Alamogordo, New Mexico\ncircle 610 290 20 Ames, Iowa\ncircle 660 400 20 St Louis, Missouri\ncircle 710 310 20 Chicago, Illinois\ncircle 730 370 20 Dana, Indiana\ncircle 800 350 20 Dayton, Ohio\ncircle 760 540 20 Sylacauga, Alabama\ncircle 890 390 20 Morgantown, West Virginia\ncircle 800 460 20 Oak Ridge, Tennessee\ncircle 910 160 20 Chalk River Laboratories\ncircle 920 260 20 Rochester, New York\ncircle 950 360 20 Washington, D.C.\ndesc none\n\nOak Ridge\n\nThe day after he took over the project, Groves took a train to Tennessee with Colonel Marshall to inspect the proposed site there, and Groves was impressed... On 29 September 1942, United States Under Secretary of War Robert P. Patterson authorized the Corps of Engineers to acquire 56000 acre of land by eminent domain at a cost of $3.5 million. An additional 3000 acre was subsequently acquired. About 1,000 families were affected by the condemnation order, which came into effect on 7 October.. Protests, legal appeals, and a 1943 Congressional inquiry were to no avail.. By mid-November U.S. Marshals were tacking notices to vacate on farmhouse doors, and construction contractors were moving in.. Some families were given two weeks' notice to vacate farms that had been their homes for generations; others had settled there after being evicted to make way for the Great Smoky Mountains National Park in the 1920s or the Norris Dam in the 1930s. The ultimate cost of land acquisition in the area, which was not completed until March 1945, was only about $2.6 million, which worked out to around $47 an acre.. When presented with Public Proclamation Number Two, which declared Oak Ridge a total exclusion area that no one could enter without military permission, the Governor of Tennessee, Prentice Cooper, angrily tore it up..\n\nInitially known as the Kingston Demolition Range, the site was officially renamed the Clinton Engineer Works (CEW) in early 1943.. While Stone & Webster concentrated on the production facilities, the architectural and engineering firm Skidmore, Owings & Merrill designed and built a residential community for 13,000. The community was located on the slopes of Black Oak Ridge, from which the new town of Oak Ridge got its name.. The Army presence at Oak Ridge increased in August 1943 when Nichols replaced Marshall as head of the Manhattan Engineer District. One of his first tasks was to move the district headquarters to Oak Ridge although the name of the district did not change.. In September 1943 the administration of community facilities was outsourced to Turner Construction Company through a subsidiary, the Roane-Anderson Company (for Roane and Anderson Counties, in which Oak Ridge was located).. Chemical engineers, including William J. Wilcox Jr. and Warren Fuchs, were part of \"frantic efforts\" to make 10% to 12% enriched uranium 235, known as the code name \"tuballoy tetroxide\", with tight security and fast approvals for supplies and materials.William J. (Bill) Wilcox Jr., Oak Ridge City Historian, Retired Technical Director for the Oak Ridge Y-12 & K-25 Plants, 11 November 2007, [https://web.archive.org/web/20141129042228/http://www.oakridgeheritage.com/images/Early_Days_of_Oak_Ridge_and_Wartime_Y-12.pdf EARLY DAYS OF OAK RIDGE AND WARTIME Y-12], Retrieved 22 November 2014 The population of Oak Ridge soon expanded well beyond the initial plans, and peaked at 75,000 in May 1945, by which time 82,000 people were employed at the Clinton Engineer Works,. and 10,000 by Roane-Anderson.\n\nFine-arts photographer, Josephine Herrick, and her colleague, Mary Steers, helped document the work at Oak Ridge.\n\nLos Alamos\n\nThe idea of locating Project Y at Oak Ridge was considered, but in the end it was decided that it should be in a remote location. On Oppenheimer's recommendation, the search for a suitable site was narrowed to the vicinity of Albuquerque, New Mexico, where Oppenheimer owned a ranch. In October 1942, Major John H. Dudley of the Manhattan Project was sent to survey the area, and he recommended a site near Jemez Springs, New Mexico.. On 16 November, Oppenheimer, Groves, Dudley and others toured the site. Oppenheimer feared that the high cliffs surrounding the site would make his people feel claustrophobic, while the engineers were concerned with the possibility of flooding. The party then moved on to the vicinity of the Los Alamos Ranch School. Oppenheimer was impressed and expressed a strong preference for the site, citing its natural beauty and views of the Sangre de Cristo Mountains, which, it was hoped, would inspire those who would work on the project.. The engineers were concerned about the poor access road, and whether the water supply would be adequate, but otherwise felt that it was ideal..\n\nPatterson approved the acquisition of the site on 25 November 1942, authorizing $440,000 for the purchase of the site of 54000 acre, all but 8900 acre of which were already owned by the Federal Government. Secretary of Agriculture Claude R. Wickard granted use of some 45100 acre of United States Forest Service land to the War Department \"for so long as the military necessity continues\". The need for land, for a new road, and later for a right of way for a 25 mi power line, eventually brought wartime land purchases to 45737 acre, but only $414,971 was spent.. Construction was contracted to the M. M. Sundt Company of Tucson, Arizona, with Willard C. Kruger and Associates of Santa Fe, New Mexico, as architect and engineer. Work commenced in December 1942. Groves initially allocated $300,000 for construction, three times Oppenheimer's estimate, with a planned completion date of 15 March 1943. It soon became clear that the scope of Project Y was greater than expected, and by the time Sundt finished on 30 November 1943, over $7 million had been spent..\n\nBecause it was secret, Los Alamos was referred to as \"Site Y\" or \"the Hill\".. Birth certificates of babies born in Los Alamos during the war listed their place of birth as PO Box 1663 in Santa Fe.. Initially Los Alamos was to have been a military laboratory with Oppenheimer and other researchers commissioned into the Army. Oppenheimer went so far as to order himself a lieutenant colonel's uniform, but two key physicists, Robert Bacher and Isidor Rabi, balked at the idea. Conant, Groves and Oppenheimer then devised a compromise whereby the laboratory was operated by the University of California under contract to the War Department..\n\nChicago\n\nAn Army-OSRD council on 25 June 1942 decided to build a pilot plant for plutonium production in Red Gate Woods southwest of Chicago. In July, Nichols arranged for a lease of 1025 acre from the Cook County Forest Preserve District, and Captain James F. Grafton was appointed Chicago area engineer. It soon became apparent that the scale of operations was too great for the area, and it was decided to build the plant at Oak Ridge, and keep a research and testing facility in Chicago..\n\nDelays in establishing the plant in Red Gate Woods led Compton to authorize the Metallurgical Laboratory to construct the first nuclear reactor beneath the bleachers of Stagg Field at the University of Chicago. The reactor required an enormous amount of graphite blocks and uranium pellets. At the time, there was a limited source of pure uranium. Frank Spedding of Iowa State University were able to produce only two short tons of pure uranium. Additional three short tons of uranium metal was supplied by Westinghouse Lamp Plant which was produced in a rush with makeshift process. A large square balloon was constructed by Goodyear Tire to encase the reactor. On 2 December 1942, a team led by Enrico Fermi initiated the first artificial self-sustaining nuclear chain reaction in an experimental reactor known as Chicago Pile-1. The point at which a reaction becomes self-sustaining became known as \"going critical\". Compton reported the success to Conant in Washington, D.C., by a coded phone call, saying, \"The Italian navigator [Fermi] has just landed in the new world.\".\n\nIn January 1943, Grafton's successor, Major Arthur V. Peterson, ordered Chicago Pile-1 dismantled and reassembled at Red Gate Woods, as he regarded the operation of a reactor as too hazardous for a densely populated area.. At the Argonne site, Chicago Pile-3, the first heavy water reactor, went critical on 15 May 1944. After the war, the operations that remained at Red Gate moved to the new site of the Argonne National Laboratory about 6 mi away.\n\nHanford\n\nBy December 1942 there were concerns that even Oak Ridge was too close to a major population center (Knoxville) in the unlikely event of a major nuclear accident. Groves recruited DuPont in November 1942 to be the prime contractor for the construction of the plutonium production complex. DuPont was offered a standard cost plus fixed-fee contract, but the President of the company, Walter S. Carpenter, Jr., wanted no profit of any kind, and asked for the proposed contract to be amended to explicitly exclude the company from acquiring any patent rights. This was accepted, but for legal reasons a nominal fee of one dollar was agreed upon. After the war, DuPont asked to be released from the contract early, and had to return 33 cents..\n\nDuPont recommended that the site be located far from the existing uranium production facility at Oak Ridge.. In December 1942, Groves dispatched Colonel Franklin Matthias and DuPont engineers to scout potential sites. Matthias reported that Hanford Site near Richland, Washington, was \"ideal in virtually all respects\". It was isolated and near the Columbia River, which could supply sufficient water to cool the reactors that would produce the plutonium. Groves visited the site in January and established the Hanford Engineer Works (HEW), codenamed \"Site W\".\n\nUnder Secretary Patterson gave his approval on 9 February, allocating $5 million for the acquisition of 40000 acre of land in the area. The federal government relocated some 1,500 residents of White Bluffs and Hanford, and nearby settlements, as well as the Wanapum and other tribes using the area. A dispute arose with farmers over compensation for crops, which had already been planted before the land was acquired. Where schedules allowed, the Army allowed the crops to be harvested, but this was not always possible.. The land acquisition process dragged on and was not completed before the end of the Manhattan Project in December 1946..\n\nThe dispute did not delay work. Although progress on the reactor design at Metallurgical Laboratory and DuPont was not sufficiently advanced to accurately predict the scope of the project, a start was made in April 1943 on facilities for an estimated 25,000 workers, half of whom were expected to live on-site. By July 1944, some 1,200 buildings had been erected and nearly 51,000 people were living in the construction camp. As area engineer, Matthias exercised overall control of the site.. At its peak, the construction camp was the third most populous town in Washington state.. Hanford operated a fleet of over 900 buses, more than the city of Chicago.. Like Los Alamos and Oak Ridge, Richland was a gated community with restricted access, but it looked more like a typical wartime American boomtown: the military profile was lower, and physical security elements like high fences, towers, and guard dogs were less evident..\n\nCanadian sites\n\nBritish Columbia\n\nCominco had produced electrolytic hydrogen at Trail, British Columbia, since 1930. Urey suggested in 1941 that it could produce heavy water. To the existing $10 million plant consisting of 3,215 cells consuming 75 MW of hydroelectric power, secondary electrolysis cells were added to increase the deuterium concentration in the water from 2.3% to 99.8%. For this process, Hugh Taylor of Princeton developed a platinum-on-carbon catalyst for the first three stages while Urey developed a nickel-chromia one for the fourth stage tower. The final cost was $2.8 million. The Canadian Government did not officially learn of the project until August 1942. Trail's heavy water production started in January 1944 and continued until 1956. Heavy water from Trail was used for Chicago Pile 3, the first reactor using heavy water and natural uranium, which went critical on 15 May 1944..\n\nOntario\n\nThe Chalk River, Ontario, site was established to rehouse the Allied effort at the Montreal Laboratory away from an urban area. A new community was built at Deep River, Ontario, to provide residences and facilities for the team members. The site was chosen for its proximity to the industrial manufacturing area of Ontario and Quebec, and proximity to a rail head adjacent to a large military base, Camp Petawawa. Located on the Ottawa River, it had access to abundant water. The first director of the new laboratory was Hans von Halban. He was replaced by John Cockcroft in May 1944, who in turn was succeeded by Bennett Lewis in September 1946. A pilot reactor known as ZEEP (zero-energy experimental pile) became the first Canadian reactor, and the first to be completed outside the United States, when it went critical in September 1945, ZEEP remained in use by researchers until 1970. A larger 10 MW NRX reactor, which was designed during the war, was completed and went critical in July 1947.\n\nNorthwest Territories\n\nThe Eldorado Mine at Port Radium was a source of uranium ore..\n\nHeavy water sites\n\nAlthough DuPont's preferred designs for the nuclear reactors were helium cooled and used graphite as a moderator, DuPont still expressed an interest in using heavy water as a backup, in case the graphite reactor design proved infeasible for some reason. For this purpose, it was estimated that 3 LT of heavy water would be required per month. The P-9 Project was the government's code name for the heavy water production program. As the plant at Trail, which was then under construction, could produce  per month, additional capacity was required. Groves therefore authorized DuPont to establish heavy water facilities at the Morgantown Ordnance Works, near Morgantown, West Virginia; at the Wabash River Ordnance Works, near Dana and Newport, Indiana; and at the Alabama Ordnance Works, near Childersburg and Sylacauga, Alabama. Although known as Ordnance Works and paid for under Ordnance Department contracts, they were built and operated by the Army Corps of Engineers. The American plants used a process different from Trail's; heavy water was extracted by distillation, taking advantage of the slightly higher boiling point of heavy water...\n\nUranium\n\nOre\n\nThe key raw material for the project was uranium, which was used as fuel for the reactors, as feed that was transformed into plutonium, and, in its enriched form, in the atomic bomb itself. There were four known major deposits of uranium in 1940: in Colorado, in northern Canada, in Joachimsthal in Czechoslovakia, and in the Belgian Congo.. All but Joachimstal were in allied hands. A November 1942 survey determined that sufficient quantities of uranium were available to satisfy the project's requirements.. Nichols arranged with the State Department for export controls to be placed on uranium oxide and negotiated for the purchase of 1200 LT of uranium ore from the Belgian Congo that was being stored in a warehouse on Staten Island and the remaining stocks of mined ore stored in the Congo. He negotiated with Eldorado Gold Mines for the purchase of ore from its refinery in Port Hope, Ontario, and its shipment in 100-ton lots. The Canadian government subsequently bought up the company's stock until it acquired a controlling interest..\n\nWhile these purchases assured a sufficient supply to meet wartime needs, the American and British leaders concluded that it was in their countries' interest to gain control of as much of the world's uranium deposits as possible. The richest source of ore was the Shinkolobwe mine in the Belgian Congo, but it was flooded and closed. Nichols unsuccessfully attempted to negotiate its reopening and the sale of the entire future output to the United States with Edgar Sengier, the director of the company that owned the mine, Union Minière du Haut Katanga.. The matter was then taken up by the Combined Policy Committee. As 30 percent of Union Minière's stock was controlled by British interests, the British took the lead in negotiations. Sir John Anderson and Ambassador John Winant hammered out a deal with Sengier and the Belgian government in May 1944 for the mine to be reopened and 1720 LT of ore to be purchased at $1.45 a pound.. To avoid dependence on the British and Canadians for ore, Groves also arranged for the purchase of US Vanadium Corporation's stockpile in Uravan, Colorado. Uranium mining in Colorado yielded about 800 LT of ore..\n\nMallinckrodt Incorporated in St. Louis, Missouri, took the raw ore and dissolved it in nitric acid to produce uranyl nitrate. Ether was then added in a liquid–liquid extraction process to separate the impurities from the uranyl nitrate. This was then heated to form uranium trioxide, which was reduced to highly pure uranium dioxide.. By July 1942, Mallinckrodt was producing a ton of highly pure oxide a day, but turning this into uranium metal initially proved more difficult for contractors Westinghouse and Metal Hydrides. Production was too slow and quality was unacceptably low. A special branch of the Metallurgical Laboratory was established at Iowa State College in Ames, Iowa, under Frank Spedding to investigate alternatives. This became known as the Ames Project, and its Ames process became available in 1943..\n\nIsotope separation\n\nNatural uranium consists of 99.3% uranium-238 and 0.7% uranium-235, but only the latter is fissile. The chemically identical uranium-235 has to be physically separated from the more plentiful isotope. Various methods were considered for uranium enrichment, most of which was carried out at Oak Ridge..\n\nThe most obvious technology, the centrifuge, failed, but electromagnetic separation, gaseous diffusion, and thermal diffusion technologies were all successful and contributed to the project. In February 1943, Groves came up with the idea of using the output of some plants as the input for others..\n\nCentrifuges\n\nThe centrifuge process was regarded as the only promising separation method in April 1942.. Jesse Beams had developed such a process at the University of Virginia during the 1930s, but had encountered technical difficulties. The process required high rotational speeds, but at certain speeds harmonic vibrations developed that threatened to tear the machinery apart. It was therefore necessary to accelerate quickly through these speeds. In 1941 he began working with uranium hexafluoride, the only known gaseous compound of uranium, and was able to separate uranium-235. At Columbia, Urey had Karl Cohen investigate the process, and he produced a body of mathematical theory making it possible to design a centrifugal separation unit, which Westinghouse undertook to construct..\n\nScaling this up to a production plant presented a formidable technical challenge. Urey and Cohen estimated that producing a kilogram (2.2 lb) of uranium-235 per day would require up to 50,000 centrifuges with 1 m rotors, or 10,000 centrifuges with 4 m rotors, assuming that 4-meter rotors could be built. The prospect of keeping so many rotors operating continuously at high speed appeared daunting,. and when Beams ran his experimental apparatus, he obtained only 60% of the predicted yield, indicating that more centrifuges would be required. Beams, Urey and Cohen then began work on a series of improvements which promised to increase the efficiency of the process. However, frequent failures of motors, shafts and bearings at high speeds delayed work on the pilot plant.. In November 1942 the centrifuge process was abandoned by the Military Policy Committee following a recommendation by Conant, Nichols and August C. Klein of Stone & Webster..\n\nElectromagnetic separation\n\nElectromagnetic isotope separation was developed by Lawrence at the University of California Radiation Laboratory. This method employed devices known as calutrons, a hybrid of the standard laboratory mass spectrometer and cyclotron. The name was derived from the words California, university and cyclotron.. In the electromagnetic process, a magnetic field deflected charged particles according to mass.. The process was neither scientifically elegant nor industrially efficient.. Compared with a gaseous diffusion plant or a nuclear reactor, an electromagnetic separation plant would consume more scarce materials, require more manpower to operate, and cost more to build. Nonetheless, the process was approved because it was based on proven technology and therefore represented less risk. Moreover, it could be built in stages, and rapidly reach industrial capacity.\n\nMarshall and Nichols discovered that the electromagnetic isotope separation process would require 5000 ST of copper, which was in desperately short supply. However, silver could be substituted, in an 11:10 ratio. On 3 August 1942, Nichols met with Under Secretary of the Treasury Daniel W. Bell and asked for the transfer of 6,000 tons of silver bullion from the West Point Bullion Depository. \"Young man,\" Bell told him, \"you may think of silver in tons but the Treasury will always think of silver in troy ounces!\". Eventually, 14700 ST were used.\n\nThe 1000 ozt silver bars were cast into cylindrical billets and taken to Phelps Dodge in Bayway, New Jersey, where they were extruded into strips  thick, 3 in wide and 40 ft long. These were wound onto magnetic coils by Allis-Chalmers in Milwaukee, Wisconsin. After the war, all the machinery was dismantled and cleaned and the floorboards beneath the machinery were ripped up and burned to recover minute amounts of silver. In the end, only 1/3,600,000th was lost... The last silver was returned in May 1970..\n\nResponsibility for the design and construction of the electromagnetic separation plant, which came to be called Y-12, was assigned to Stone & Webster by the S-1 Committee in June 1942. The design called for five first-stage processing units, known as Alpha racetracks, and two units for final processing, known as Beta racetracks. In September 1943 Groves authorized construction of four more racetracks, known as Alpha II. Construction began in February 1943..\n\nWhen the plant was started up for testing on schedule in October, the 14-ton vacuum tanks crept out of alignment because of the power of the magnets, and had to be fastened more securely. A more serious problem arose when the magnetic coils started shorting out. In December Groves ordered a magnet to be broken open, and handfuls of rust were found inside. Groves then ordered the racetracks to be torn down and the magnets sent back to the factory to be cleaned. A pickling plant was established on-site to clean the pipes and fittings. The second Alpha I was not operational until the end of January 1944, the first Beta and first and third Alpha I's came online in March, and the fourth Alpha I was operational in April. The four Alpha II racetracks were completed between July and October 1944..\n\nTennessee Eastman was contracted to manage Y-12 on the usual cost plus fixed-fee basis, with a fee of $22,500 per month plus $7,500 per racetrack for the first seven racetracks and $4,000 per additional racetrack.. The calutrons were initially operated by scientists from Berkeley to remove bugs and achieve a reasonable operating rate. They were then turned over to trained Tennessee Eastman operators who had only a high school education. Nichols compared unit production data, and pointed out to Lawrence that the young \"hillbilly\" girl operators were outperforming his PhDs. They agreed to a production race and Lawrence lost, a morale boost for the Tennessee Eastman workers and supervisors. The girls were \"trained like soldiers not to reason why\", while \"the scientists could not refrain from time-consuming investigation of the cause of even minor fluctuations of the dials.\".\n\nY-12 initially enriched the uranium-235 content to between 13% and 15%, and shipped the first few hundred grams of this to Los Alamos in March 1944. Only 1 part in 5,825 of the uranium feed emerged as final product. Much of the rest was splattered over equipment in the process. Strenuous recovery efforts helped raise production to 10% of the uranium-235 feed by January 1945. In February the Alpha racetracks began receiving slightly enriched (1.4%) feed from the new S-50 thermal diffusion plant. The next month it received enhanced (5%) feed from the K-25 gaseous diffusion plant. By August K-25 was producing uranium sufficiently enriched to feed directly into the Beta tracks..\n\nGaseous diffusion\n\nThe most promising but also the most challenging method of isotope separation was gaseous diffusion. Graham's law states that the rate of effusion of a gas is inversely proportional to the square root of its molecular mass, so in a box containing a semi-permeable membrane and a mixture of two gases, the lighter molecules will pass out of the container more rapidly than the heavier molecules. The gas leaving the container is somewhat enriched in the lighter molecules, while the residual gas is somewhat depleted. The idea was that such boxes could be formed into a cascade of pumps and membranes, with each successive stage containing a slightly more enriched mixture. Research into the process was carried out at Columbia University by a group that included Harold Urey, Karl P. Cohen, and John R. Dunning.\n\nIn November 1942 the Military Policy Committee approved the construction of a 600-stage gaseous diffusion plant.. On 14 December, M. W. Kellogg accepted an offer to construct the plant, which was codenamed K-25. A cost plus fixed-fee contract was negotiated, eventually totaling $2.5 million. A separate corporate entity called Kellex was created for the project, headed by Percival C. Keith, one of Kellogg's vice presidents.. The process faced formidable technical difficulties. The highly corrosive gas uranium hexafluoride would have to be used, as no substitute could be found, and the motors and pumps would have to be vacuum tight and enclosed in inert gas. The biggest problem was the design of the barrier, which would have to be strong, porous and resistant to corrosion by uranium hexafluoride. The best choice for this seemed to be nickel. Edward Adler and Edward Norris created a mesh barrier from electroplated nickel. A six-stage pilot plant was built at Columbia to test the process, but the Norris-Adler prototype proved to be too brittle. A rival barrier was developed from powdered nickel by Kellex, the Bell Telephone Laboratories and the Bakelite Corporation. In January 1944, Groves ordered the Kellex barrier into production...\n\nKellex's design for K-25 called for a four-story  long U-shaped structure containing 54 contiguous buildings. These were divided into nine sections. Within these were cells of six stages. The cells could be operated independently, or consecutively within a section. Similarly, the sections could be operated separately or as part of a single cascade. A survey party began construction by marking out the 500 acre site in May 1943. Work on the main building began in October 1943, and the six-stage pilot plant was ready for operation on 17 April 1944. In 1945 Groves canceled the upper stages of the plant, directing Kellex to instead design and build a 540-stage side feed unit, which became known as K-27. Kellex transferred the last unit to the operating contractor, Union Carbide and Carbon, on 11 September 1945. The total cost, including the K-27 plant completed after the war, came to $480 million..\n\nThe production plant commenced operation in February 1945, and as cascade after cascade came online, the quality of the product increased. By April 1945, K-25 had attained a 1.1% enrichment and the output of the S-50 thermal diffusion plant began being used as feed. Some product produced the next month reached nearly 7% enrichment. In August, the last of the 2,892 stages commenced operation. K-25 and K-27 achieved their full potential in the early postwar period, when they eclipsed the other production plants and became the prototypes for a new generation of plants..\n\nThermal diffusion\n\nThe thermal diffusion process was based on Sydney Chapman and David Enskog's theory, which explained that when a mixed gas passes through a temperature gradient, the heavier one tends to concentrate at the cold end and the lighter one at the warm end. Since hot gases tend to rise and cool ones tend to fall, this can be used as a means of isotope separation. This process was first demonstrated by Klaus Clusius and Gerhard Dickel in Germany in 1938.. It was developed by US Navy scientists, but was not one of the enrichment technologies initially selected for use in the Manhattan Project. This was primarily due to doubts about its technical feasibility, but the inter-service rivalry between the Army and Navy also played a part..\n\nThe Naval Research Laboratory continued the research under Philip Abelson's direction, but there was little contact with the Manhattan Project until April 1944, when Captain William S. Parsons, the naval officer in charge of ordnance development at Los Alamos, brought Oppenheimer news of encouraging progress in the Navy's experiments on thermal diffusion. Oppenheimer wrote to Groves suggesting that the output of a thermal diffusion plant could be fed into Y-12. Groves set up a committee consisting of Warren K. Lewis, Eger Murphree and Richard Tolman to investigate the idea, and they estimated that a thermal diffusion plant costing $3.5 million could enrich 50 kg of uranium per week to nearly 0.9% uranium-235. Groves approved its construction on 24 June 1944..\n\nGroves contracted with the H. K. Ferguson Company of Cleveland, Ohio, to build the thermal diffusion plant, which was designated S-50. Groves's advisers, Karl Cohen and W. I. Thompson from Standard Oil,. estimated that it would take six months to build. Groves gave Ferguson just four. Plans called for the installation of 2,142 48 ft diffusion columns arranged in 21 racks. Inside each column were three concentric tubes. Steam, obtained from the nearby K-25 powerhouse at a pressure of 1000 psi and temperature of 545 F, flowed downward through the innermost  nickel pipe, while water at 155 F flowed upward through the outermost iron pipe. Isotope separation occurred in the uranium hexafluoride gas between the nickel and copper pipes..\n\nWork commenced on 9 July 1944, and S-50 began partial operation in September. Ferguson operated the plant through a subsidiary known as Fercleve. The plant produced just  of 0.852% uranium-235 in October. Leaks limited production and forced shutdowns over the next few months, but in June 1945 it produced 12730 lb.. By March 1945, all 21 production racks were operating. Initially the output of S-50 was fed into Y-12, but starting in March 1945 all three enrichment processes were run in series. S-50 became the first stage, enriching from 0.71% to 0.89%. This material was fed into the gaseous diffusion process in the K-25 plant, which produced a product enriched to about 23%. This was, in turn, fed into Y-12,. which boosted it to about 89%, sufficient for nuclear weapons..\n\nAggregate U-235 production\n\nAbout 50 kg}} of uranium enriched to 89% uranium-235 was delivered to Los Alamos by July 1945. The entire 50 kg, along with some 50%-enriched, averaging out to about 85% enriched, were used in Little Boy.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Manhattan Project" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19603" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Manhattan Project was a research and development undertaking during World War II that produced the first nuclear weapons. It was led by the United States with the support of the United Kingdom and Canada. From 1942 to 1946, the project was under the direction of Major General Leslie Groves of the U.S. Army Corps of Engineers. Nuclear physicist Robert Oppenheimer was the director of the Los Alamos Laboratory that designed the actual bombs. The Army component of the project was designated the Manhattan District; \"Manhattan\" gradually superseded the official codename, Development of Substitute Materials, for the entire project. Along the way, the project absorbed its earlier British counterpart, Tube Alloys. The Manhattan Project began modestly in 1939, but grew to employ more than 130,000 people and cost nearly US $2 billion (about $ in  dollars). Over 90% of the cost was for building factories and to produce fissile material, with less than 10% for development and production of the weapons. Research and production took place at more than 30 sites across the United States, the United Kingdom, and Canada.\n\nTwo types of atomic bombs were developed concurrently during the war: a relatively simple gun-type fission weapon and a more complex implosion-type nuclear weapon. The Thin Man gun-type design proved impractical to use with plutonium so a simpler gun-type called Little Boy was developed that used uranium-235, an isotope that makes up only 0.7 percent of natural uranium. Chemically identical to the most common isotope, uranium-238, and with almost the same mass, it proved difficult to separate the two. Three methods were employed for uranium enrichment: electromagnetic, gaseous and thermal. Most of this work was performed at the Clinton Engineer Works at Oak Ridge, Tennessee.\n\nIn parallel with the work on uranium was an effort to produce plutonium. After the feasibility of the world's first artificial nuclear reactor was demonstrated in Chicago at the Metallurgical Laboratory, it designed the X-10 Graphite Reactor at Oak Ridge and the production reactors in Hanford, Washington, in which uranium was irradiated and transmuted into plutonium. The plutonium was then chemically separated from the uranium. The Fat Man implosion-type weapon was developed in a concerted design and development effort by the Los Alamos Laboratory.\n\nThe project was also charged with gathering intelligence on the German nuclear weapon project. Through Operation Alsos, Manhattan Project personnel served in Europe, sometimes behind enemy lines, where they gathered nuclear materials and documents, and rounded up German scientists. Despite the Manhattan Project's tight security, Soviet atomic spies successfully penetrated the program.\n\nThe first nuclear device ever detonated was an implosion-type bomb at the Trinity test, conducted at New Mexico's Alamogordo Bombing and Gunnery Range on 16 July 1945. Little Boy and Fat Man bombs were used a month later in the atomic bombings of Hiroshima and Nagasaki, respectively. In the immediate postwar years, the Manhattan Project conducted weapons testing at Bikini Atoll as part of Operation Crossroads, developed new weapons, promoted the development of the network of national laboratories, supported medical research into radiology and laid the foundations for the nuclear navy. It maintained control over American atomic weapons research and production until the formation of the United States Atomic Energy Commission in January 1947.\n\nOrigins\n\nThe discovery of nuclear fission by German chemists Otto Hahn and Fritz Strassmann in 1938, and its theoretical explanation by Lise Meitner and Otto Frisch, made the development of an atomic bomb a theoretical possibility. There were fears that a German atomic bomb project would develop one first, especially among scientists who were refugees from Nazi Germany and other fascist countries. In August 1939, Hungarian-born physicists Leó Szilárd and Eugene Wigner drafted the Einstein–Szilárd letter, which warned of the potential development of \"extremely powerful bombs of a new type\". It urged the United States to take steps to acquire stockpiles of uranium ore and accelerate the research of Enrico Fermi and others into nuclear chain reactions. They had it signed by Albert Einstein and delivered to President Franklin D. Roosevelt. Roosevelt called on Lyman Briggs of the National Bureau of Standards to head the Advisory Committee on Uranium to investigate the issues raised by the letter. Briggs held a meeting on 21 October 1939, which was attended by Szilárd, Wigner and Edward Teller. The committee reported back to Roosevelt in November that uranium \"would provide a possible source of bombs with a destructiveness vastly greater than anything now known.\".\n\nThe Advisory Committee on Uranium became the National Defense Research Committee (NDRC) Committee on Uranium when that organization was formed on 27 June 1940.. Briggs proposed spending $167,000 on research into uranium, particularly the uranium-235 isotope, and the recently discovered plutonium. On 28 June 1941, Roosevelt signed Executive Order 8807, which created the Office of Scientific Research and Development (OSRD), with Vannevar Bush as its director. The office was empowered to engage in large engineering projects in addition to research.. The NDRC Committee on Uranium became the S-1 Section of the OSRD; the word \"uranium\" was dropped for security reasons..\n\nIn Britain, Frisch and Rudolf Peierls at the University of Birmingham had made a breakthrough investigating the critical mass of uranium-235 in June 1939.. Their calculations indicated that it was within an order of magnitude of 10 kg, which was small enough to be carried by a bomber of the day.. Their March 1940 Frisch–Peierls memorandum initiated the British atomic bomb project and its Maud Committee,. which unanimously recommended pursuing the development of an atomic bomb. In July 1940, Britain had offered to give the United States access to its scientific research, and the Tizard Mission's John Cockcroft briefed American scientists on British developments. He discovered that the American project was smaller than the British, and not as far advanced.\n\nAs part of the scientific exchange, the Maud Committee's findings were conveyed to the United States. One of its members, the Australian physicist Mark Oliphant, flew to the United States in late August 1941 and discovered that data provided by the Maud Committee had not reached key American physicists. Oliphant then set out to find out why the committee's findings were apparently being ignored. He met with the Uranium Committee and visited Berkeley, California, where he spoke persuasively to Ernest O. Lawrence. Lawrence was sufficiently impressed to commence his own research into uranium. He in turn spoke to James B. Conant, Arthur H. Compton and George B. Pegram. Oliphant's mission was therefore a success; key American physicists were now aware of the potential power of an atomic bomb...\n\nOn 9 October 1941, President Roosevelt approved the atomic program after he convened a meeting with Vannevar Bush and Vice President Henry A. Wallace. To control the program, he created a Top Policy Group consisting of himself—although he never attended a meeting—Wallace, Bush, Conant, Secretary of War Henry L. Stimson, and the Chief of Staff of the Army, General George C. Marshall. Roosevelt chose the Army to run the project rather than the Navy, because the Army had more experience with management of large-scale construction projects. He also agreed to coordinate the effort with that of the British, and on 11 October he sent a message to Prime Minister Winston Churchill, suggesting that they correspond on atomic matters..\n\nFeasibility\n\nProposals\n\nThe S-1 Committee held its meeting on 18 December 1941 \"pervaded by an atmosphere of enthusiasm and urgency\". in the wake of the attack on Pearl Harbor and the subsequent United States declaration of war upon Japan and then on Germany.. Work was proceeding on three different techniques for isotope separation to separate uranium-235 from the more abundant uranium-238. Lawrence and his team at the University of California, Berkeley, investigated electromagnetic separation, while Eger Murphree and Jesse Wakefield Beams's team looked into gaseous diffusion at Columbia University, and Philip Abelson directed research into thermal diffusion at the Carnegie Institution of Washington and later the Naval Research Laboratory. Murphree was also the head of an unsuccessful separation project using gas centrifuges..\n\nMeanwhile, there were two lines of research into nuclear reactor technology, with Harold Urey continuing research into heavy water at Columbia, while Arthur Compton brought the scientists working under his supervision from Columbia, California and Princeton University to join his team at the University of Chicago, where he organized the Metallurgical Laboratory in early 1942 to study plutonium and reactors using graphite as a neutron moderator.. Briggs, Compton, Lawrence, Murphree, and Urey met on 23 May 1942 to finalize the S-1 Committee recommendations, which called for all five technologies to be pursued. This was approved by Bush, Conant, and Brigadier General Wilhelm D. Styer, the chief of staff of Major General Brehon B. Somervell's Services of Supply, who had been designated the Army's representative on nuclear matters. Bush and Conant then took the recommendation to the Top Policy Group with a budget proposal for $54 million for construction by the United States Army Corps of Engineers, $31 million for research and development by OSRD and $5 million for contingencies in fiscal year 1943. The Top Policy Group in turn sent it to the President on 17 June 1942 and he approved it by writing \"OK FDR\" on the document..\n\nBomb design concepts\n\nCompton asked theoretical physicist J. Robert Oppenheimer of the University of California, Berkeley, to take over research into fast neutron calculations—the key to calculations of critical mass and weapon detonation—from Gregory Breit, who had quit on 18 May 1942 because of concerns over lax operational security.. John H. Manley, a physicist at the Metallurgical Laboratory, was assigned to assist Oppenheimer by contacting and coordinating experimental physics groups scattered across the country.. Oppenheimer and Robert Serber of the University of Illinois examined the problems of neutron diffusion—how neutrons moved in a nuclear chain reaction—and hydrodynamics—how the explosion produced by a chain reaction might behave. To review this work and the general theory of fission reactions, Oppenheimer and Fermi convened meetings at the University of Chicago in June and at the University of California, Berkeley, in July 1942 with theoretical physicists Hans Bethe, John Van Vleck, Edward Teller, Emil Konopinski, Robert Serber, Stan Frankel, and Eldred C. Nelson, the latter three former students of Oppenheimer, and experimental physicists Emilio Segrè, Felix Bloch, Franco Rasetti, John Henry Manley, and Edwin McMillan. They tentatively confirmed that a fission bomb was theoretically possible.\n\nThere were still many unknown factors. The properties of pure uranium-235 were relatively unknown, as were those of plutonium, an element that had only been discovered in February 1941 by Glenn Seaborg and his team. The scientists at the Berkeley conference envisioned creating plutonium in nuclear reactors where uranium-238 atoms absorbed neutrons that had been emitted from fissioning uranium-235 atoms. At this point no reactor had been built, and only tiny quantities of plutonium were available from cyclotrons.. Even by December 1943, only two milligrams had been produced.. There were many ways of arranging the fissile material into a critical mass. The simplest was shooting a \"cylindrical plug\" into a sphere of \"active material\" with a \"tamper\"—dense material that would focus neutrons inward and keep the reacting mass together to increase its efficiency.. They also explored designs involving spheroids, a primitive form of \"implosion\" suggested by Richard C. Tolman, and the possibility of autocatalytic methods, which would increase the efficiency of the bomb as it exploded.\n\nConsidering the idea of the fission bomb theoretically settled—at least until more experimental data was available—the Berkeley conference then turned in a different direction. Edward Teller pushed for discussion of a more powerful bomb: the \"super\", now usually referred to as a \"hydrogen bomb\", which would use the explosive force of a detonating fission bomb to ignite a nuclear fusion reaction in deuterium and tritium.. Teller proposed scheme after scheme, but Bethe refused each one. The fusion idea was put aside to concentrate on producing fission bombs. Teller also raised the speculative possibility that an atomic bomb might \"ignite\" the atmosphere because of a hypothetical fusion reaction of nitrogen nuclei. Bethe calculated that it could not happen,. and a report co-authored by Teller showed that \"no self-propagating chain of nuclear reactions is likely to be started.\" In Serber's account, Oppenheimer mentioned it to Arthur Compton, who \"didn't have enough sense to shut up about it. It somehow got into a document that went to Washington\" and was \"never laid to rest\".\n\nOrganization\n\nManhattan District\n\nThe Chief of Engineers, Major General Eugene Reybold, selected Colonel James C. Marshall to head the Army's part of the project in June 1942. Marshall created a liaison office in Washington, D.C., but established his temporary headquarters on the 18th floor of 270 Broadway in New York, where he could draw on administrative support from the Corps of Engineers' North Atlantic Division. It was close to the Manhattan office of Stone & Webster, the principal project contractor, and to Columbia University. He had permission to draw on his former command, the Syracuse District, for staff, and he started with Lieutenant Colonel Kenneth Nichols, who became his deputy..\n\nBecause most of his task involved construction, Marshall worked in cooperation with the head of the Corps of Engineers Construction Division, Major General Thomas M. Robbins, and his deputy, Colonel Leslie Groves. Reybold, Somervell and Styer decided to call the project \"Development of Substitute Materials\", but Groves felt that this would draw attention. Since engineer districts normally carried the name of the city where they were located, Marshall and Groves agreed to name the Army's component of the project the Manhattan District. This became official on 13 August, when Reybold issued the order creating the new district. Informally, it was known as the Manhattan Engineer District, or MED. Unlike other districts, it had no geographic boundaries, and Marshall had the authority of a division engineer. Development of Substitute Materials remained as the official codename of the project as a whole, but was supplanted over time by \"Manhattan\".\n\nMarshall later conceded that, \"I had never heard of atomic fission but I did know that you could not build much of a plant, much less four of them for $90 million.\". A single TNT plant that Nichols had recently built in Pennsylvania had cost $128 million.. Nor were they impressed with estimates to the nearest order of magnitude, which Groves compared with telling a caterer to prepare for between ten and a thousand guests.. A survey team from Stone & Webster had already scouted a site for the production plants. The War Production Board recommended sites around Knoxville, Tennessee, an isolated area where the Tennessee Valley Authority could supply ample electric power and the rivers could provide cooling water for the reactors. After examining several sites, the survey team selected one near Elza, Tennessee. Conant advised that it be acquired at once and Styer agreed but Marshall temporized, awaiting the results of Conant's reactor experiments before taking action.. Of the prospective processes, only Lawrence's electromagnetic separation appeared sufficiently advanced for construction to commence..\n\nMarshall and Nichols began assembling the resources they would need. The first step was to obtain a high priority rating for the project. The top ratings were AA-1 through AA-4 in descending order, although there was also a special AAA rating reserved for emergencies. Ratings AA-1 and AA-2 were for essential weapons and equipment, so Colonel Lucius D. Clay, the deputy chief of staff at Services and Supply for requirements and resources, felt that the highest rating he could assign was AA-3, although he was willing to provide a AAA rating on request for critical materials if the need arose.. Nichols and Marshall were disappointed; AA-3 was the same priority as Nichols' TNT plant in Pennsylvania..\n\nMilitary Policy Committee\n\nBush became dissatisfied with Colonel Marshall's failure to get the project moving forward expeditiously, specifically the failure to acquire the Tennessee site, the low priority allocated to the project by the Army and the location of his headquarters in New York City.. Bush felt that more aggressive leadership was required, and spoke to Harvey Bundy and Generals Marshall, Somervell, and Styer about his concerns. He wanted the project placed under a senior policy committee, with a prestigious officer, preferably Styer, as overall director.\n\nSomervell and Styer selected Groves for the post, informing him on 17 September of this decision, and that General Marshall ordered that he be promoted to brigadier general,. as it was felt that the title \"general\" would hold more sway with the academic scientists working on the Manhattan Project.. Groves' orders placed him directly under Somervell rather than Reybold, with Colonel Marshall now answerable to Groves.. Groves established his headquarters in Washington, D.C., on the fifth floor of the New War Department Building, where Colonel Marshall had his liaison office.. He assumed command of the Manhattan Project on 23 September. Later that day, he attended a meeting called by Stimson, which established a Military Policy Committee, responsible to the Top Policy Group, consisting of Bush (with Conant as an alternate), Styer and Rear Admiral William R. Purnell. Tolman and Conant were later appointed as Groves' scientific advisers..\n\nOn 19 September, Groves went to Donald Nelson, the chairman of the War Production Board, and asked for broad authority to issue a AAA rating whenever it was required. Nelson initially balked but quickly caved in when Groves threatened to go to the President.. Groves promised not to use the AAA rating unless it was necessary. It soon transpired that for the routine requirements of the project the AAA rating was too high but the AA-3 rating was too low. After a long campaign, Groves finally received AA-1 authority on 1 July 1944.. According to Groves, \"In Washington you became aware of the importance of top priority. Most everything proposed in the Roosevelt administration would have top priority. That would last for about a week or two and then something else would get top priority\".\n\nOne of Groves' early problems was to find a director for Project Y, the group that would design and build the bomb. The obvious choice was one of the three laboratory heads, Urey, Lawrence, or Compton, but they could not be spared. Compton recommended Oppenheimer, who was already intimately familiar with the bomb design concepts. However, Oppenheimer had little administrative experience, and, unlike Urey, Lawrence, and Compton, had not won a Nobel Prize, which many scientists felt that the head of such an important laboratory should have. There were also concerns about Oppenheimer's security status, as many of his associates were Communists, including his brother, Frank Oppenheimer; his wife, Kitty; and his girlfriend, Jean Tatlock. A long conversation on a train in October 1942 convinced Groves and Nichols that Oppenheimer thoroughly understood the issues involved in setting up a laboratory in a remote area and should be appointed as its director. Groves personally waived the security requirements and issued Oppenheimer a clearance on 20 July 1943...\n\nCollaboration with the United Kingdom\n\nThe British and Americans exchanged nuclear information but did not initially combine their efforts. Britain rebuffed attempts by Bush and Conant in 1941 to strengthen cooperation with its own project, codenamed Tube Alloys, because it was reluctant to share its technological lead and help the United States develop its own atomic bomb.. An American scientist who brought a personal letter from Roosevelt to Churchill offering to pay for all research and development in an Anglo-American project was poorly treated, and Churchill did not reply to the letter. The United States as a result decided as early as April 1942 that if its offer was rejected, they should proceed alone. The British, who had made significant contributions early in the war, did not have the resources to carry through such a research program while fighting for their survival. As a result, Tube Alloys soon fell behind its American counterpart.. and on 30 July 1942, Sir John Anderson, the minister responsible for Tube Alloys, advised Churchill that: \"We must face the fact that ... [our] pioneering work ... is a dwindling asset and that, unless we capitalise it quickly, we shall be outstripped. We now have a real contribution to make to a 'merger.' Soon we shall have little or none.\". That month Churchill and Roosevelt made an informal, unwritten agreement for atomic collaboration.\n\nThe opportunity for an equal partnership no longer existed, however, as shown in August 1942 when the British unsuccessfully demanded substantial control over the project while paying none of the costs. By 1943 the roles of the two countries had reversed from late 1941; in January Conant notified the British that they would no longer receive atomic information except in certain areas. While the British were shocked by the abrogation of the Churchill-Roosevelt agreement, head of the Canadian National Research Council C. J. Mackenzie was less surprised, writing \"I can't help feeling that the United Kingdom group [over] emphasizes the importance of their contribution as compared with the Americans.\" As Conant and Bush told the British, the order came \"from the top\"..\n\nThe British bargaining position had worsened; the American scientists had decided that the United States no longer needed outside help, and they wanted to prevent Britain exploiting post-war commercial applications of atomic energy. The committee supported, and Roosevelt agreed to, restricting the flow of information to what Britain could use during the war—especially not bomb design—even if doing so slowed down the American project. By early 1943 the British stopped sending research and scientists to America, and as a result the Americans stopped all information sharing. The British considered ending the supply of Canadian uranium and heavy water to force the Americans to again share, but Canada needed American supplies to produce them.. They investigated the possibility of an independent nuclear program, but determined that it could not be ready in time to affect the outcome of the war in Europe.\n\nBy March 1943 Conant decided that British help would benefit some areas of the project. James Chadwick and one or two other British scientists were important enough that the bomb design team at Los Alamos needed them, despite the risk of revealing weapon design secrets.. In August 1943 Churchill and Roosevelt negotiated the Quebec Agreement, which resulted in a resumption of cooperation. between scientists working on the same problem. Britain, however, agreed to restrictions on data on the building of large-scale production plants necessary for the bomb.. The subsequent Hyde Park Agreement in September 1944 extended this cooperation to the postwar period.. The Quebec Agreement established the Combined Policy Committee to coordinate the efforts of the United States, United Kingdom and Canada. Stimson, Bush and Conant served as the American members of the Combined Policy Committee, Field Marshal Sir John Dill and Colonel J. J. Llewellin were the British members, and C. D. Howe was the Canadian member.. Llewellin returned to the United Kingdom at the end of 1943 and was replaced on the committee by Sir Ronald Ian Campbell, who in turn was replaced by the British Ambassador to the United States, Lord Halifax, in early 1945. Sir John Dill died in Washington, D.C., in November 1944 and was replaced both as Chief of the British Joint Staff Mission and as a member of the Combined Policy Committee by Field Marshal Sir Henry Maitland Wilson..\n\nWhen cooperation resumed after the Quebec agreement, the Americans' progress and expenditures amazed the British. The United States had already spent more than $1 billion ($ today), while in 1943, the United Kingdom had spent about £0.5 million. Chadwick thus pressed for British involvement in the Manhattan Project to the fullest extent and abandon any hopes of a British project during the war. With Churchill's backing, he attempted to ensure that every request from Groves for assistance was honored.. The British Mission that arrived in the United States in December 1943 included Niels Bohr, Otto Frisch, Klaus Fuchs, Rudolf Peierls, and Ernest Titterton.. More scientists arrived in early 1944. While those assigned to gaseous diffusion left by the fall of 1944, the 35 working with Lawrence at Berkeley were assigned to existing laboratory groups and stayed until the end of the war. The 19 sent to Los Alamos also joined existing groups, primarily related to implosion and bomb assembly, but not the plutonium-related ones. Part of the Quebec Agreement specified that nuclear weapons would not be used against another country without mutual consent. In June 1945, Wilson agreed that the use of nuclear weapons against Japan would be recorded as a decision of the Combined Policy Committee..\n\nThe Combined Policy Committee created the Combined Development Trust in June 1944, with Groves as its chairman, to procure uranium and thorium ores on international markets. The Belgian Congo and Canada held much of the world's uranium outside Eastern Europe, and the Belgian government in exile was in London. Britain agreed to give the United States most of the Belgian ore, as it could not use most of the supply without restricted American research.. In 1944, the Trust purchased 3440000 lb of uranium oxide ore from companies operating mines in the Belgian Congo. In order to avoid briefing US Secretary of the Treasury Henry Morgenthau Jr. on the project, a special account not subject to the usual auditing and controls was used to hold Trust monies. Between 1944 and the time he resigned from the Trust in 1947, Groves deposited a total of $37.5 million into the Trust's account..\n\nGroves appreciated the early British atomic research and the British scientists' contributions to the Manhattan Project, but stated that the United States would have succeeded without them. He also said that Churchill was \"the best friend the atomic bomb project had [as] he kept Roosevelt's interest up ... He just stirred him up all the time by telling him how important he thought the project was.\"\n\nThe British wartime participation was crucial to the success of the United Kingdom's independent nuclear weapons program after the war when the McMahon Act of 1946 temporarily ended American nuclear cooperation.\n\nProject sites\n\nFile:Manhattan Project US Canada Map 2.svg|thumb|700px|center|A selection of US and Canadian sites important to the Manhattan Project. Click on the location for more information.|alt=Map of the United States and southern Canada with major project sites marked\ncircle  50 280 20 Berkeley, California\ncircle 140 400 20 Inyokern, California\ncircle 170 100 20 Richland, Washington\ncircle 220  20 20 Trail, British Columbia\ncircle 230 270 20 Wendover, Utah\ncircle 290 360 20 Monticello, Utah\ncircle 320 360 20 Uravan, Colorado\ncircle 340 440 20 Los Alamos, New Mexico\ncircle 340 500 20 Alamogordo, New Mexico\ncircle 610 290 20 Ames, Iowa\ncircle 660 400 20 St Louis, Missouri\ncircle 710 310 20 Chicago, Illinois\ncircle 730 370 20 Dana, Indiana\ncircle 800 350 20 Dayton, Ohio\ncircle 760 540 20 Sylacauga, Alabama\ncircle 890 390 20 Morgantown, West Virginia\ncircle 800 460 20 Oak Ridge, Tennessee\ncircle 910 160 20 Chalk River Laboratories\ncircle 920 260 20 Rochester, New York\ncircle 950 360 20 Washington, D.C.\ndesc none\n\nOak Ridge\n\nThe day after he took over the project, Groves took a train to Tennessee with Colonel Marshall to inspect the proposed site there, and Groves was impressed... On 29 September 1942, United States Under Secretary of War Robert P. Patterson authorized the Corps of Engineers to acquire 56000 acre of land by eminent domain at a cost of $3.5 million. An additional 3000 acre was subsequently acquired. About 1,000 families were affected by the condemnation order, which came into effect on 7 October.. Protests, legal appeals, and a 1943 Congressional inquiry were to no avail.. By mid-November U.S. Marshals were tacking notices to vacate on farmhouse doors, and construction contractors were moving in.. Some families were given two weeks' notice to vacate farms that had been their homes for generations; others had settled there after being evicted to make way for the Great Smoky Mountains National Park in the 1920s or the Norris Dam in the 1930s. The ultimate cost of land acquisition in the area, which was not completed until March 1945, was only about $2.6 million, which worked out to around $47 an acre.. When presented with Public Proclamation Number Two, which declared Oak Ridge a total exclusion area that no one could enter without military permission, the Governor of Tennessee, Prentice Cooper, angrily tore it up..\n\nInitially known as the Kingston Demolition Range, the site was officially renamed the Clinton Engineer Works (CEW) in early 1943.. While Stone & Webster concentrated on the production facilities, the architectural and engineering firm Skidmore, Owings & Merrill designed and built a residential community for 13,000. The community was located on the slopes of Black Oak Ridge, from which the new town of Oak Ridge got its name.. The Army presence at Oak Ridge increased in August 1943 when Nichols replaced Marshall as head of the Manhattan Engineer District. One of his first tasks was to move the district headquarters to Oak Ridge although the name of the district did not change.. In September 1943 the administration of community facilities was outsourced to Turner Construction Company through a subsidiary, the Roane-Anderson Company (for Roane and Anderson Counties, in which Oak Ridge was located).. Chemical engineers, including William J. Wilcox Jr. and Warren Fuchs, were part of \"frantic efforts\" to make 10% to 12% enriched uranium 235, known as the code name \"tuballoy tetroxide\", with tight security and fast approvals for supplies and materials.William J. (Bill) Wilcox Jr., Oak Ridge City Historian, Retired Technical Director for the Oak Ridge Y-12 & K-25 Plants, 11 November 2007, [https://web.archive.org/web/20141129042228/http://www.oakridgeheritage.com/images/Early_Days_of_Oak_Ridge_and_Wartime_Y-12.pdf EARLY DAYS OF OAK RIDGE AND WARTIME Y-12], Retrieved 22 November 2014 The population of Oak Ridge soon expanded well beyond the initial plans, and peaked at 75,000 in May 1945, by which time 82,000 people were employed at the Clinton Engineer Works,. and 10,000 by Roane-Anderson.\n\nFine-arts photographer, Josephine Herrick, and her colleague, Mary Steers, helped document the work at Oak Ridge.\n\nLos Alamos\n\nThe idea of locating Project Y at Oak Ridge was considered, but in the end it was decided that it should be in a remote location. On Oppenheimer's recommendation, the search for a suitable site was narrowed to the vicinity of Albuquerque, New Mexico, where Oppenheimer owned a ranch. In October 1942, Major John H. Dudley of the Manhattan Project was sent to survey the area, and he recommended a site near Jemez Springs, New Mexico.. On 16 November, Oppenheimer, Groves, Dudley and others toured the site. Oppenheimer feared that the high cliffs surrounding the site would make his people feel claustrophobic, while the engineers were concerned with the possibility of flooding. The party then moved on to the vicinity of the Los Alamos Ranch School. Oppenheimer was impressed and expressed a strong preference for the site, citing its natural beauty and views of the Sangre de Cristo Mountains, which, it was hoped, would inspire those who would work on the project.. The engineers were concerned about the poor access road, and whether the water supply would be adequate, but otherwise felt that it was ideal..\n\nPatterson approved the acquisition of the site on 25 November 1942, authorizing $440,000 for the purchase of the site of 54000 acre, all but 8900 acre of which were already owned by the Federal Government. Secretary of Agriculture Claude R. Wickard granted use of some 45100 acre of United States Forest Service land to the War Department \"for so long as the military necessity continues\". The need for land, for a new road, and later for a right of way for a 25 mi power line, eventually brought wartime land purchases to 45737 acre, but only $414,971 was spent.. Construction was contracted to the M. M. Sundt Company of Tucson, Arizona, with Willard C. Kruger and Associates of Santa Fe, New Mexico, as architect and engineer. Work commenced in December 1942. Groves initially allocated $300,000 for construction, three times Oppenheimer's estimate, with a planned completion date of 15 March 1943. It soon became clear that the scope of Project Y was greater than expected, and by the time Sundt finished on 30 November 1943, over $7 million had been spent..\n\nBecause it was secret, Los Alamos was referred to as \"Site Y\" or \"the Hill\".. Birth certificates of babies born in Los Alamos during the war listed their place of birth as PO Box 1663 in Santa Fe.. Initially Los Alamos was to have been a military laboratory with Oppenheimer and other researchers commissioned into the Army. Oppenheimer went so far as to order himself a lieutenant colonel's uniform, but two key physicists, Robert Bacher and Isidor Rabi, balked at the idea. Conant, Groves and Oppenheimer then devised a compromise whereby the laboratory was operated by the University of California under contract to the War Department..\n\nChicago\n\nAn Army-OSRD council on 25 June 1942 decided to build a pilot plant for plutonium production in Red Gate Woods southwest of Chicago. In July, Nichols arranged for a lease of 1025 acre from the Cook County Forest Preserve District, and Captain James F. Grafton was appointed Chicago area engineer. It soon became apparent that the scale of operations was too great for the area, and it was decided to build the plant at Oak Ridge, and keep a research and testing facility in Chicago..\n\nDelays in establishing the plant in Red Gate Woods led Compton to authorize the Metallurgical Laboratory to construct the first nuclear reactor beneath the bleachers of Stagg Field at the University of Chicago. The reactor required an enormous amount of graphite blocks and uranium pellets. At the time, there was a limited source of pure uranium. Frank Spedding of Iowa State University were able to produce only two short tons of pure uranium. Additional three short tons of uranium metal was supplied by Westinghouse Lamp Plant which was produced in a rush with makeshift process. A large square balloon was constructed by Goodyear Tire to encase the reactor. On 2 December 1942, a team led by Enrico Fermi initiated the first artificial self-sustaining nuclear chain reaction in an experimental reactor known as Chicago Pile-1. The point at which a reaction becomes self-sustaining became known as \"going critical\". Compton reported the success to Conant in Washington, D.C., by a coded phone call, saying, \"The Italian navigator [Fermi] has just landed in the new world.\".\n\nIn January 1943, Grafton's successor, Major Arthur V. Peterson, ordered Chicago Pile-1 dismantled and reassembled at Red Gate Woods, as he regarded the operation of a reactor as too hazardous for a densely populated area.. At the Argonne site, Chicago Pile-3, the first heavy water reactor, went critical on 15 May 1944. After the war, the operations that remained at Red Gate moved to the new site of the Argonne National Laboratory about 6 mi away.\n\nHanford\n\nBy December 1942 there were concerns that even Oak Ridge was too close to a major population center (Knoxville) in the unlikely event of a major nuclear accident. Groves recruited DuPont in November 1942 to be the prime contractor for the construction of the plutonium production complex. DuPont was offered a standard cost plus fixed-fee contract, but the President of the company, Walter S. Carpenter, Jr., wanted no profit of any kind, and asked for the proposed contract to be amended to explicitly exclude the company from acquiring any patent rights. This was accepted, but for legal reasons a nominal fee of one dollar was agreed upon. After the war, DuPont asked to be released from the contract early, and had to return 33 cents..\n\nDuPont recommended that the site be located far from the existing uranium production facility at Oak Ridge.. In December 1942, Groves dispatched Colonel Franklin Matthias and DuPont engineers to scout potential sites. Matthias reported that Hanford Site near Richland, Washington, was \"ideal in virtually all respects\". It was isolated and near the Columbia River, which could supply sufficient water to cool the reactors that would produce the plutonium. Groves visited the site in January and established the Hanford Engineer Works (HEW), codenamed \"Site W\".\n\nUnder Secretary Patterson gave his approval on 9 February, allocating $5 million for the acquisition of 40000 acre of land in the area. The federal government relocated some 1,500 residents of White Bluffs and Hanford, and nearby settlements, as well as the Wanapum and other tribes using the area. A dispute arose with farmers over compensation for crops, which had already been planted before the land was acquired. Where schedules allowed, the Army allowed the crops to be harvested, but this was not always possible.. The land acquisition process dragged on and was not completed before the end of the Manhattan Project in December 1946..\n\nThe dispute did not delay work. Although progress on the reactor design at Metallurgical Laboratory and DuPont was not sufficiently advanced to accurately predict the scope of the project, a start was made in April 1943 on facilities for an estimated 25,000 workers, half of whom were expected to live on-site. By July 1944, some 1,200 buildings had been erected and nearly 51,000 people were living in the construction camp. As area engineer, Matthias exercised overall control of the site.. At its peak, the construction camp was the third most populous town in Washington state.. Hanford operated a fleet of over 900 buses, more than the city of Chicago.. Like Los Alamos and Oak Ridge, Richland was a gated community with restricted access, but it looked more like a typical wartime American boomtown: the military profile was lower, and physical security elements like high fences, towers, and guard dogs were less evident..\n\nCanadian sites\n\nBritish Columbia\n\nCominco had produced electrolytic hydrogen at Trail, British Columbia, since 1930. Urey suggested in 1941 that it could produce heavy water. To the existing $10 million plant consisting of 3,215 cells consuming 75 MW of hydroelectric power, secondary electrolysis cells were added to increase the deuterium concentration in the water from 2.3% to 99.8%. For this process, Hugh Taylor of Princeton developed a platinum-on-carbon catalyst for the first three stages while Urey developed a nickel-chromia one for the fourth stage tower. The final cost was $2.8 million. The Canadian Government did not officially learn of the project until August 1942. Trail's heavy water production started in January 1944 and continued until 1956. Heavy water from Trail was used for Chicago Pile 3, the first reactor using heavy water and natural uranium, which went critical on 15 May 1944..\n\nOntario\n\nThe Chalk River, Ontario, site was established to rehouse the Allied effort at the Montreal Laboratory away from an urban area. A new community was built at Deep River, Ontario, to provide residences and facilities for the team members. The site was chosen for its proximity to the industrial manufacturing area of Ontario and Quebec, and proximity to a rail head adjacent to a large military base, Camp Petawawa. Located on the Ottawa River, it had access to abundant water. The first director of the new laboratory was Hans von Halban. He was replaced by John Cockcroft in May 1944, who in turn was succeeded by Bennett Lewis in September 1946. A pilot reactor known as ZEEP (zero-energy experimental pile) became the first Canadian reactor, and the first to be completed outside the United States, when it went critical in September 1945, ZEEP remained in use by researchers until 1970. A larger 10 MW NRX reactor, which was designed during the war, was completed and went critical in July 1947.\n\nNorthwest Territories\n\nThe Eldorado Mine at Port Radium was a source of uranium ore..\n\nHeavy water sites\n\nAlthough DuPont's preferred designs for the nuclear reactors were helium cooled and used graphite as a moderator, DuPont still expressed an interest in using heavy water as a backup, in case the graphite reactor design proved infeasible for some reason. For this purpose, it was estimated that 3 LT of heavy water would be required per month. The P-9 Project was the government's code name for the heavy water production program. As the plant at Trail, which was then under construction, could produce  per month, additional capacity was required. Groves therefore authorized DuPont to establish heavy water facilities at the Morgantown Ordnance Works, near Morgantown, West Virginia; at the Wabash River Ordnance Works, near Dana and Newport, Indiana; and at the Alabama Ordnance Works, near Childersburg and Sylacauga, Alabama. Although known as Ordnance Works and paid for under Ordnance Department contracts, they were built and operated by the Army Corps of Engineers. The American plants used a process different from Trail's; heavy water was extracted by distillation, taking advantage of the slightly higher boiling point of heavy water...\n\nUranium\n\nOre\n\nThe key raw material for the project was uranium, which was used as fuel for the reactors, as feed that was transformed into plutonium, and, in its enriched form, in the atomic bomb itself. There were four known major deposits of uranium in 1940: in Colorado, in northern Canada, in Joachimsthal in Czechoslovakia, and in the Belgian Congo.. All but Joachimstal were in allied hands. A November 1942 survey determined that sufficient quantities of uranium were available to satisfy the project's requirements.. Nichols arranged with the State Department for export controls to be placed on uranium oxide and negotiated for the purchase of 1200 LT of uranium ore from the Belgian Congo that was being stored in a warehouse on Staten Island and the remaining stocks of mined ore stored in the Congo. He negotiated with Eldorado Gold Mines for the purchase of ore from its refinery in Port Hope, Ontario, and its shipment in 100-ton lots. The Canadian government subsequently bought up the company's stock until it acquired a controlling interest..\n\nWhile these purchases assured a sufficient supply to meet wartime needs, the American and British leaders concluded that it was in their countries' interest to gain control of as much of the world's uranium deposits as possible. The richest source of ore was the Shinkolobwe mine in the Belgian Congo, but it was flooded and closed. Nichols unsuccessfully attempted to negotiate its reopening and the sale of the entire future output to the United States with Edgar Sengier, the director of the company that owned the mine, Union Minière du Haut Katanga.. The matter was then taken up by the Combined Policy Committee. As 30 percent of Union Minière's stock was controlled by British interests, the British took the lead in negotiations. Sir John Anderson and Ambassador John Winant hammered out a deal with Sengier and the Belgian government in May 1944 for the mine to be reopened and 1720 LT of ore to be purchased at $1.45 a pound.. To avoid dependence on the British and Canadians for ore, Groves also arranged for the purchase of US Vanadium Corporation's stockpile in Uravan, Colorado. Uranium mining in Colorado yielded about 800 LT of ore..\n\nMallinckrodt Incorporated in St. Louis, Missouri, took the raw ore and dissolved it in nitric acid to produce uranyl nitrate. Ether was then added in a liquid–liquid extraction process to separate the impurities from the uranyl nitrate. This was then heated to form uranium trioxide, which was reduced to highly pure uranium dioxide.. By July 1942, Mallinckrodt was producing a ton of highly pure oxide a day, but turning this into uranium metal initially proved more difficult for contractors Westinghouse and Metal Hydrides. Production was too slow and quality was unacceptably low. A special branch of the Metallurgical Laboratory was established at Iowa State College in Ames, Iowa, under Frank Spedding to investigate alternatives. This became known as the Ames Project, and its Ames process became available in 1943..\n\nIsotope separation\n\nNatural uranium consists of 99.3% uranium-238 and 0.7% uranium-235, but only the latter is fissile. The chemically identical uranium-235 has to be physically separated from the more plentiful isotope. Various methods were considered for uranium enrichment, most of which was carried out at Oak Ridge..\n\nThe most obvious technology, the centrifuge, failed, but electromagnetic separation, gaseous diffusion, and thermal diffusion technologies were all successful and contributed to the project. In February 1943, Groves came up with the idea of using the output of some plants as the input for others..\n\nCentrifuges\n\nThe centrifuge process was regarded as the only promising separation method in April 1942.. Jesse Beams had developed such a process at the University of Virginia during the 1930s, but had encountered technical difficulties. The process required high rotational speeds, but at certain speeds harmonic vibrations developed that threatened to tear the machinery apart. It was therefore necessary to accelerate quickly through these speeds. In 1941 he began working with uranium hexafluoride, the only known gaseous compound of uranium, and was able to separate uranium-235. At Columbia, Urey had Karl Cohen investigate the process, and he produced a body of mathematical theory making it possible to design a centrifugal separation unit, which Westinghouse undertook to construct..\n\nScaling this up to a production plant presented a formidable technical challenge. Urey and Cohen estimated that producing a kilogram (2.2 lb) of uranium-235 per day would require up to 50,000 centrifuges with 1 m rotors, or 10,000 centrifuges with 4 m rotors, assuming that 4-meter rotors could be built. The prospect of keeping so many rotors operating continuously at high speed appeared daunting,. and when Beams ran his experimental apparatus, he obtained only 60% of the predicted yield, indicating that more centrifuges would be required. Beams, Urey and Cohen then began work on a series of improvements which promised to increase the efficiency of the process. However, frequent failures of motors, shafts and bearings at high speeds delayed work on the pilot plant.. In November 1942 the centrifuge process was abandoned by the Military Policy Committee following a recommendation by Conant, Nichols and August C. Klein of Stone & Webster..\n\nElectromagnetic separation\n\nElectromagnetic isotope separation was developed by Lawrence at the University of California Radiation Laboratory. This method employed devices known as calutrons, a hybrid of the standard laboratory mass spectrometer and cyclotron. The name was derived from the words California, university and cyclotron.. In the electromagnetic process, a magnetic field deflected charged particles according to mass.. The process was neither scientifically elegant nor industrially efficient.. Compared with a gaseous diffusion plant or a nuclear reactor, an electromagnetic separation plant would consume more scarce materials, require more manpower to operate, and cost more to build. Nonetheless, the process was approved because it was based on proven technology and therefore represented less risk. Moreover, it could be built in stages, and rapidly reach industrial capacity.\n\nMarshall and Nichols discovered that the electromagnetic isotope separation process would require 5000 ST of copper, which was in desperately short supply. However, silver could be substituted, in an 11:10 ratio. On 3 August 1942, Nichols met with Under Secretary of the Treasury Daniel W. Bell and asked for the transfer of 6,000 tons of silver bullion from the West Point Bullion Depository. \"Young man,\" Bell told him, \"you may think of silver in tons but the Treasury will always think of silver in troy ounces!\". Eventually, 14700 ST were used.\n\nThe 1000 ozt silver bars were cast into cylindrical billets and taken to Phelps Dodge in Bayway, New Jersey, where they were extruded into strips  thick, 3 in wide and 40 ft long. These were wound onto magnetic coils by Allis-Chalmers in Milwaukee, Wisconsin. After the war, all the machinery was dismantled and cleaned and the floorboards beneath the machinery were ripped up and burned to recover minute amounts of silver. In the end, only 1/3,600,000th was lost... The last silver was returned in May 1970..\n\nResponsibility for the design and construction of the electromagnetic separation plant, which came to be called Y-12, was assigned to Stone & Webster by the S-1 Committee in June 1942. The design called for five first-stage processing units, known as Alpha racetracks, and two units for final processing, known as Beta racetracks. In September 1943 Groves authorized construction of four more racetracks, known as Alpha II. Construction began in February 1943..\n\nWhen the plant was started up for testing on schedule in October, the 14-ton vacuum tanks crept out of alignment because of the power of the magnets, and had to be fastened more securely. A more serious problem arose when the magnetic coils started shorting out. In December Groves ordered a magnet to be broken open, and handfuls of rust were found inside. Groves then ordered the racetracks to be torn down and the magnets sent back to the factory to be cleaned. A pickling plant was established on-site to clean the pipes and fittings. The second Alpha I was not operational until the end of January 1944, the first Beta and first and third Alpha I's came online in March, and the fourth Alpha I was operational in April. The four Alpha II racetracks were completed between July and October 1944..\n\nTennessee Eastman was contracted to manage Y-12 on the usual cost plus fixed-fee basis, with a fee of $22,500 per month plus $7,500 per racetrack for the first seven racetracks and $4,000 per additional racetrack.. The calutrons were initially operated by scientists from Berkeley to remove bugs and achieve a reasonable operating rate. They were then turned over to trained Tennessee Eastman operators who had only a high school education. Nichols compared unit production data, and pointed out to Lawrence that the young \"hillbilly\" girl operators were outperforming his PhDs. They agreed to a production race and Lawrence lost, a morale boost for the Tennessee Eastman workers and supervisors. The girls were \"trained like soldiers not to reason why\", while \"the scientists could not refrain from time-consuming investigation of the cause of even minor fluctuations of the dials.\".\n\nY-12 initially enriched the uranium-235 content to between 13% and 15%, and shipped the first few hundred grams of this to Los Alamos in March 1944. Only 1 part in 5,825 of the uranium feed emerged as final product. Much of the rest was splattered over equipment in the process. Strenuous recovery efforts helped raise production to 10% of the uranium-235 feed by January 1945. In February the Alpha racetracks began receiving slightly enriched (1.4%) feed from the new S-50 thermal diffusion plant. The next month it received enhanced (5%) feed from the K-25 gaseous diffusion plant. By August K-25 was producing uranium sufficiently enriched to feed directly into the Beta tracks..\n\nGaseous diffusion\n\nThe most promising but also the most challenging method of isotope separation was gaseous diffusion. Graham's law states that the rate of effusion of a gas is inversely proportional to the square root of its molecular mass, so in a box containing a semi-permeable membrane and a mixture of two gases, the lighter molecules will pass out of the container more rapidly than the heavier molecules. The gas leaving the container is somewhat enriched in the lighter molecules, while the residual gas is somewhat depleted. The idea was that such boxes could be formed into a cascade of pumps and membranes, with each successive stage containing a slightly more enriched mixture. Research into the process was carried out at Columbia University by a group that included Harold Urey, Karl P. Cohen, and John R. Dunning.\n\nIn November 1942 the Military Policy Committee approved the construction of a 600-stage gaseous diffusion plant.. On 14 December, M. W. Kellogg accepted an offer to construct the plant, which was codenamed K-25. A cost plus fixed-fee contract was negotiated, eventually totaling $2.5 million. A separate corporate entity called Kellex was created for the project, headed by Percival C. Keith, one of Kellogg's vice presidents.. The process faced formidable technical difficulties. The highly corrosive gas uranium hexafluoride would have to be used, as no substitute could be found, and the motors and pumps would have to be vacuum tight and enclosed in inert gas. The biggest problem was the design of the barrier, which would have to be strong, porous and resistant to corrosion by uranium hexafluoride. The best choice for this seemed to be nickel. Edward Adler and Edward Norris created a mesh barrier from electroplated nickel. A six-stage pilot plant was built at Columbia to test the process, but the Norris-Adler prototype proved to be too brittle. A rival barrier was developed from powdered nickel by Kellex, the Bell Telephone Laboratories and the Bakelite Corporation. In January 1944, Groves ordered the Kellex barrier into production...\n\nKellex's design for K-25 called for a four-story  long U-shaped structure containing 54 contiguous buildings. These were divided into nine sections. Within these were cells of six stages. The cells could be operated independently, or consecutively within a section. Similarly, the sections could be operated separately or as part of a single cascade. A survey party began construction by marking out the 500 acre site in May 1943. Work on the main building began in October 1943, and the six-stage pilot plant was ready for operation on 17 April 1944. In 1945 Groves canceled the upper stages of the plant, directing Kellex to instead design and build a 540-stage side feed unit, which became known as K-27. Kellex transferred the last unit to the operating contractor, Union Carbide and Carbon, on 11 September 1945. The total cost, including the K-27 plant completed after the war, came to $480 million..\n\nThe production plant commenced operation in February 1945, and as cascade after cascade came online, the quality of the product increased. By April 1945, K-25 had attained a 1.1% enrichment and the output of the S-50 thermal diffusion plant began being used as feed. Some product produced the next month reached nearly 7% enrichment. In August, the last of the 2,892 stages commenced operation. K-25 and K-27 achieved their full potential in the early postwar period, when they eclipsed the other production plants and became the prototypes for a new generation of plants..\n\nThermal diffusion\n\nThe thermal diffusion process was based on Sydney Chapman and David Enskog's theory, which explained that when a mixed gas passes through a temperature gradient, the heavier one tends to concentrate at the cold end and the lighter one at the warm end. Since hot gases tend to rise and cool ones tend to fall, this can be used as a means of isotope separation. This process was first demonstrated by Klaus Clusius and Gerhard Dickel in Germany in 1938.. It was developed by US Navy scientists, but was not one of the enrichment technologies initially selected for use in the Manhattan Project. This was primarily due to doubts about its technical feasibility, but the inter-service rivalry between the Army and Navy also played a part..\n\nThe Naval Research Laboratory continued the research under Philip Abelson's direction, but there was little contact with the Manhattan Project until April 1944, when Captain William S. Parsons, the naval officer in charge of ordnance development at Los Alamos, brought Oppenheimer news of encouraging progress in the Navy's experiments on thermal diffusion. Oppenheimer wrote to Groves suggesting that the output of a thermal diffusion plant could be fed into Y-12. Groves set up a committee consisting of Warren K. Lewis, Eger Murphree and Richard Tolman to investigate the idea, and they estimated that a thermal diffusion plant costing $3.5 million could enrich 50 kg of uranium per week to nearly 0.9% uranium-235. Groves approved its construction on 24 June 1944..\n\nGroves contracted with the H. K. Ferguson Company of Cleveland, Ohio, to build the thermal diffusion plant, which was designated S-50. Groves's advisers, Karl Cohen and W. I. Thompson from Standard Oil,. estimated that it would take six months to build. Groves gave Ferguson just four. Plans called for the installation of 2,142 48 ft diffusion columns arranged in 21 racks. Inside each column were three concentric tubes. Steam, obtained from the nearby K-25 powerhouse at a pressure of 1000 psi and temperature of 545 F, flowed downward through the innermost  nickel pipe, while water at 155 F flowed upward through the outermost iron pipe. Isotope separation occurred in the uranium hexafluoride gas between the nickel and copper pipes..\n\nWork commenced on 9 July 1944, and S-50 began partial operation in September. Ferguson operated the plant through a subsidiary known as Fercleve. The plant produced just  of 0.852% uranium-235 in October. Leaks limited production and forced shutdowns over the next few months, but in June 1945 it produced 12730 lb.. By March 1945, all 21 production racks were operating. Initially the output of S-50 was fed into Y-12, but starting in March 1945 all three enrichment processes were run in series. S-50 became the first stage, enriching from 0.71% to 0.89%. This material was fed into the gaseous diffusion process in the K-25 plant, which produced a product enriched to about 23%. This was, in turn, fed into Y-12,. which boosted it to about 89%, sufficient for nuclear weapons..\n\nAggregate U-235 production\n\nAbout 50 kg}} of uranium enriched to 89% uranium-235 was delivered to Los Alamos by July 1945. The entire 50 kg, along with some 50%-enriched, averaging out to about 85% enriched, were used in Little Boy. Manhattan Project. http://en.wikipedia.org/?curid=19603."
  }
}
