{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3975",
  "eid" : "ca44b6b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778419099,
  "textBody" : "The 2001 United Kingdom general election was held on Thursday 7 June 2001, four years after the previous election on 1 May 1997,  to elect 659 members to the British House of Commons. Under the leadership of Tony Blair, the governing Labour Party was re-elected to serve a second term in government with another landslide victory, returning 413 of the 418 seats won by the party in the previous general election, a net loss of 5 seats, though with significantly lower turnout than before - 59.4%, compared to 71.3% in the previous election. Tony Blair went on to become the first Labour Prime Minister to serve a consecutive full term in office. It was dubbed \"the quiet landslide\" by the media.\n\nThere was little change outside Northern Ireland, with 620 out of the 641 seats electing candidates from the same party as they did in 1997. Factors contributing to the Labour victory were a strong economy and falling unemployment, as well as that Labour was seen as having delivered on many key election pledges that it had made in 1997.\n\nThe Conservative Party, under William Hague's leadership, was still deeply divided on the issue of Europe and the party's policy platform was considered to have shifted to a right wing focus. Hague was also hindered by a series of embarrassing publicity stunts, and resigned as party leader three months later, becoming the first Conservative leader since Austen Chamberlain to leave office without becoming Prime Minister.\n\nThe election was essentially a repeat of the 1997 election, with Labour losing only 6 seats overall and the Conservatives making a net gain of one seat (gaining nine seats, but losing eight). The Conservatives did manage to gain a seat in Scotland, which ended the party's status as an 'England-only' party in the prior parliament. Although they did not gain many seats, one of the new MPs elected was future Conservative Prime Minister David Cameron. The Liberal Democrats gained six seats.\n\nChange was seen in Northern Ireland, with the moderately unionist Ulster Unionist Party losing four seats to the more hardline Democratic Unionist Party.  This transition was mirrored in the nationalist community with the moderate SDLP losing votes to the more staunchly republican and abstentionist Sinn Féin.\n\nThe election was also marked with exceptionally low voter turnout, falling below 60% for the first time since 1918. The election was broadcast live on the BBC, and presented by Jeremy Paxman, Andrew Marr, Peter Snow and David Dimbleby.https://www.youtube.com/watch?v6weF6Q37F2w&feature\nmfu_in_order&playnext1&videos\nUsHbCo8smUk| BBC Vote 2001 Coverage\n\nOverview \n\nThe election had been expected on 3 May, to coincide with local elections, but both were postponed because of rural movement restrictions imposed in response to the foot and mouth outbreak.\n\nThe elections were marked by voter apathy, with turnout falling to 59.4%, the lowest since the Coupon Election of 1918. Throughout the election the Labour Party had maintained a significant lead in the opinion polls and the result was deemed to be so certain that some bookmakers paid out for a Labour majority before the election day.\n\nHowever, the opinion polls the previous autumn had shown the first Tory lead (though only by a narrow margin) in the opinion polls for eight years as they benefited from the public anger towards the government over the fuel protests which had led to a severe shortage of motor fuel.\n\nBy the end of 2000, however, the dispute had been solved and Labour were firmly back in the lead of the opinion polls. In total, a mere 29 parliamentary seats changed hands at the 2001 Election.\n\nOne of the more noted events of a quiet campaign was when countryside protester Craig Evans threw an egg at Deputy Prime Minister John Prescott in Rhyl; Prescott then punched him and a struggle ensued, in front of television cameras.\n\n2001 also saw the rare election of an independent. Dr. Richard Taylor of Independent Kidderminster Hospital and Health Concern (usually now known simply as \"Health Concern\") unseated a government minister. There was also a high vote for British National Party leader Nick Griffin in Oldham, in the wake of recent race riots in the town.\n\nIn Northern Ireland, the election was far more dramatic and marked a move by unionists away from support for the Good Friday Agreement, with the moderate unionist Ulster Unionist Party (UUP) losing to the more hardline Democratic Unionist Party (DUP). This polarisation was also seen in the nationalist community, with the Social Democratic and Labour Party (SDLP) vote losing out to more left-wing and republican Sinn Féin. It also saw a tightening of the parties as the small UK Unionist Party lost its only seat.\n\nCampaign \n\nFor Labour, the last four years had run relatively smoothly. The party had successfully defended all their by election seats, and many suspected a Labour win was inevitable from the start.\n\nMany in the party however were afraid of voter apathy, which was epitomised in the \"Hague with Lady Thatcher's hair\" poster. Despite recessions in mainland Europe and the United States, due to the bursting of global tech bubbles, Britain was notably unaffected and Labour however could rely on a strong economy as unemployment continued to decline toward election day, putting to rest any fears of a Labour government putting the economic situation at risk.\n\nFor William Hague, however, the Conservative Party had still not fully recovered from the loss in 1997. The party was still divided over Europe, and talk of a referendum on joining the Eurozone was rife. As Labour remained at the political centre, the Tories moved to the right. A policy gaffe by Oliver Letwin over public spending cuts left the party with an own goal that Labour soon took advantage of.\n\nMargaret Thatcher also added to Hague's troubles when speaking out strongly against the Euro to applause. Hague himself, although a witty performer at PMQs, was dogged in the press and reminded of his speech at Conservative conference at the age of 16. The Sun newspaper only added to the Conservatives woes by backing Labour once again, calling Hague a \"dead parrot\".http://4.bp.blogspot.com/_ThhguC97EdA/STaU-tJdVzI/AAAAAAAAASA/GVBGsJaLKAI/s400/PARROT-HAGUE.jpg\n\nThe Tories campaigned on a strongly right-wing platform, emphasising the issues of Europe, immigration and tax, the fabled \"Tebbit Trinity\". However, Labour countered by asking where the proposed tax cuts were going to come from, and decried the Tory policy as \"cut here, cut there, cut everywhere\", in reference to the widespread belief that the Conservatives would make major cuts to public services in order to fund tax cuts.\n\nFor the Liberal Democrats, this was the first election for leader Charles Kennedy.\n\nControversy \n\nDuring the election Sharron Storer, a resident of Birmingham, criticised Prime Minister Tony Blair in front of television cameras about conditions in the National Health Service. The widely televised incident happened on 16 May during a campaign visit by Blair to the Queen Elizabeth Hospital in Birmingham. Sharron Storer's partner, Keith Sedgewick, a cancer patient with non-Hodgkin's lymphoma and therefore highly susceptible to infection, was being treated at the time in the bone marrow unit, but no bed could be found for him and he was transferred to the casualty unit for his first 24 hours.\n\nOpinion polling \n\nResults \n\nThe election result was effectively a repeat of 1997, as the Labour Party retained an overwhelming majority with BBC announcing the victory at 02:58 on the early morning of the 6th June. Having presided over relatively serene political, economic and social conditions, the feeling of prosperity in the United Kingdom had been maintained into the new millennium, and Labour would have a free hand to assert its ideals in the subsequent parliament. Despite the victory, voter apathy was a major issue, as turnout fell below 60%, 12% down on 1997. All of the 3 main parties saw their total votes fall, with Labour's total vote dropping by 2.8 million on 1997, the Conservatives 1.3 million, and the Liberal Democrats 428,000. Some suggested this dramatic fall was a sign of the general acceptance of the status quo and the likelihood of Labour's majority remaining unassailable.\n\nFor the Conservatives, this huge loss they had sustained in 1997 was repeated. Despite gaining 9 seats the Tories lost 7 to the Liberal Democrats, and one even to Labour. The inevitable result was the speedy resignation of William Hague in the election aftermath resigning at 07:44 outside the Conservative Party headquarters. Some believed that Hague had been unlucky, although most considered him to be a talented orator and an intelligent statesman, he had come up against the charismatic Tony Blair in the peak of his political career, and it was no surprise that little progress was made in reducing Labour's majority after a relatively smooth parliament.\n\nStaying at what they considered rock bottom however showed that the Conservatives had failed to improve their negative public image, had remained somewhat disunited over Europe and had not regained the trust that they had lost in the 1990s. But in Scotland, despite gaining one seat from the SNP, their vote collapse continued. They failed to retake former strongholds in Scotland as the Nationalists consolidated their grip on the Northeastern portion of the country.\n\nThe Liberal Democrats could point to steady progress under Charles Kennedy, gaining more seats than the main two parties – albeit only six overall – and maintaining the performance of a pleasing 1997 election, where the party had doubled its number of seats from 20 to 46. While they had yet to become electable as a government, they underlined their growing reputation as a worthwhile alternative to Labour and Conservative, offering plenty of debate in parliament and not just representing a protest vote.\n\nThe SNP failed to gain any seats and lost a seat to the Conservatives by just 79 votes. Plaid Cymru both gained a seat from Labour and lost one to them.\n\nIn Northern Ireland the Ulster Unionists, despite gaining North Down, lost 5 other seats.\n\n|}\n\nAll parties with more than 500 votes shown.\n\nThe seat gains reflect changes on the 1997 general election result. Two seats had changed hands in by-elections in the intervening period. These were as follows:\n* Romsey from Conservative to Liberal Democrats.  This seat stayed Liberal Democrat in 2001.\n* South Antrim from Ulster Unionists to Democratic Unionists.  This seat reverted to the Ulster Unionists in 2001.\n\nThe results of the election give a Gallagher index of dis-proportionality of 17.74.\n\nResults by constituent country \n\nSeats changing hands \n\nMPs that lost their seats",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "United Kingdom general election, 2001" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3975" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The 2001 United Kingdom general election was held on Thursday 7 June 2001, four years after the previous election on 1 May 1997,  to elect 659 members to the British House of Commons. Under the leadership of Tony Blair, the governing Labour Party was re-elected to serve a second term in government with another landslide victory, returning 413 of the 418 seats won by the party in the previous general election, a net loss of 5 seats, though with significantly lower turnout than before - 59.4%, compared to 71.3% in the previous election. Tony Blair went on to become the first Labour Prime Minister to serve a consecutive full term in office. It was dubbed \"the quiet landslide\" by the media.\n\nThere was little change outside Northern Ireland, with 620 out of the 641 seats electing candidates from the same party as they did in 1997. Factors contributing to the Labour victory were a strong economy and falling unemployment, as well as that Labour was seen as having delivered on many key election pledges that it had made in 1997.\n\nThe Conservative Party, under William Hague's leadership, was still deeply divided on the issue of Europe and the party's policy platform was considered to have shifted to a right wing focus. Hague was also hindered by a series of embarrassing publicity stunts, and resigned as party leader three months later, becoming the first Conservative leader since Austen Chamberlain to leave office without becoming Prime Minister.\n\nThe election was essentially a repeat of the 1997 election, with Labour losing only 6 seats overall and the Conservatives making a net gain of one seat (gaining nine seats, but losing eight). The Conservatives did manage to gain a seat in Scotland, which ended the party's status as an 'England-only' party in the prior parliament. Although they did not gain many seats, one of the new MPs elected was future Conservative Prime Minister David Cameron. The Liberal Democrats gained six seats.\n\nChange was seen in Northern Ireland, with the moderately unionist Ulster Unionist Party losing four seats to the more hardline Democratic Unionist Party.  This transition was mirrored in the nationalist community with the moderate SDLP losing votes to the more staunchly republican and abstentionist Sinn Féin.\n\nThe election was also marked with exceptionally low voter turnout, falling below 60% for the first time since 1918. The election was broadcast live on the BBC, and presented by Jeremy Paxman, Andrew Marr, Peter Snow and David Dimbleby.https://www.youtube.com/watch?v6weF6Q37F2w&feature\nmfu_in_order&playnext1&videos\nUsHbCo8smUk| BBC Vote 2001 Coverage\n\nOverview \n\nThe election had been expected on 3 May, to coincide with local elections, but both were postponed because of rural movement restrictions imposed in response to the foot and mouth outbreak.\n\nThe elections were marked by voter apathy, with turnout falling to 59.4%, the lowest since the Coupon Election of 1918. Throughout the election the Labour Party had maintained a significant lead in the opinion polls and the result was deemed to be so certain that some bookmakers paid out for a Labour majority before the election day.\n\nHowever, the opinion polls the previous autumn had shown the first Tory lead (though only by a narrow margin) in the opinion polls for eight years as they benefited from the public anger towards the government over the fuel protests which had led to a severe shortage of motor fuel.\n\nBy the end of 2000, however, the dispute had been solved and Labour were firmly back in the lead of the opinion polls. In total, a mere 29 parliamentary seats changed hands at the 2001 Election.\n\nOne of the more noted events of a quiet campaign was when countryside protester Craig Evans threw an egg at Deputy Prime Minister John Prescott in Rhyl; Prescott then punched him and a struggle ensued, in front of television cameras.\n\n2001 also saw the rare election of an independent. Dr. Richard Taylor of Independent Kidderminster Hospital and Health Concern (usually now known simply as \"Health Concern\") unseated a government minister. There was also a high vote for British National Party leader Nick Griffin in Oldham, in the wake of recent race riots in the town.\n\nIn Northern Ireland, the election was far more dramatic and marked a move by unionists away from support for the Good Friday Agreement, with the moderate unionist Ulster Unionist Party (UUP) losing to the more hardline Democratic Unionist Party (DUP). This polarisation was also seen in the nationalist community, with the Social Democratic and Labour Party (SDLP) vote losing out to more left-wing and republican Sinn Féin. It also saw a tightening of the parties as the small UK Unionist Party lost its only seat.\n\nCampaign \n\nFor Labour, the last four years had run relatively smoothly. The party had successfully defended all their by election seats, and many suspected a Labour win was inevitable from the start.\n\nMany in the party however were afraid of voter apathy, which was epitomised in the \"Hague with Lady Thatcher's hair\" poster. Despite recessions in mainland Europe and the United States, due to the bursting of global tech bubbles, Britain was notably unaffected and Labour however could rely on a strong economy as unemployment continued to decline toward election day, putting to rest any fears of a Labour government putting the economic situation at risk.\n\nFor William Hague, however, the Conservative Party had still not fully recovered from the loss in 1997. The party was still divided over Europe, and talk of a referendum on joining the Eurozone was rife. As Labour remained at the political centre, the Tories moved to the right. A policy gaffe by Oliver Letwin over public spending cuts left the party with an own goal that Labour soon took advantage of.\n\nMargaret Thatcher also added to Hague's troubles when speaking out strongly against the Euro to applause. Hague himself, although a witty performer at PMQs, was dogged in the press and reminded of his speech at Conservative conference at the age of 16. The Sun newspaper only added to the Conservatives woes by backing Labour once again, calling Hague a \"dead parrot\".http://4.bp.blogspot.com/_ThhguC97EdA/STaU-tJdVzI/AAAAAAAAASA/GVBGsJaLKAI/s400/PARROT-HAGUE.jpg\n\nThe Tories campaigned on a strongly right-wing platform, emphasising the issues of Europe, immigration and tax, the fabled \"Tebbit Trinity\". However, Labour countered by asking where the proposed tax cuts were going to come from, and decried the Tory policy as \"cut here, cut there, cut everywhere\", in reference to the widespread belief that the Conservatives would make major cuts to public services in order to fund tax cuts.\n\nFor the Liberal Democrats, this was the first election for leader Charles Kennedy.\n\nControversy \n\nDuring the election Sharron Storer, a resident of Birmingham, criticised Prime Minister Tony Blair in front of television cameras about conditions in the National Health Service. The widely televised incident happened on 16 May during a campaign visit by Blair to the Queen Elizabeth Hospital in Birmingham. Sharron Storer's partner, Keith Sedgewick, a cancer patient with non-Hodgkin's lymphoma and therefore highly susceptible to infection, was being treated at the time in the bone marrow unit, but no bed could be found for him and he was transferred to the casualty unit for his first 24 hours.\n\nOpinion polling \n\nResults \n\nThe election result was effectively a repeat of 1997, as the Labour Party retained an overwhelming majority with BBC announcing the victory at 02:58 on the early morning of the 6th June. Having presided over relatively serene political, economic and social conditions, the feeling of prosperity in the United Kingdom had been maintained into the new millennium, and Labour would have a free hand to assert its ideals in the subsequent parliament. Despite the victory, voter apathy was a major issue, as turnout fell below 60%, 12% down on 1997. All of the 3 main parties saw their total votes fall, with Labour's total vote dropping by 2.8 million on 1997, the Conservatives 1.3 million, and the Liberal Democrats 428,000. Some suggested this dramatic fall was a sign of the general acceptance of the status quo and the likelihood of Labour's majority remaining unassailable.\n\nFor the Conservatives, this huge loss they had sustained in 1997 was repeated. Despite gaining 9 seats the Tories lost 7 to the Liberal Democrats, and one even to Labour. The inevitable result was the speedy resignation of William Hague in the election aftermath resigning at 07:44 outside the Conservative Party headquarters. Some believed that Hague had been unlucky, although most considered him to be a talented orator and an intelligent statesman, he had come up against the charismatic Tony Blair in the peak of his political career, and it was no surprise that little progress was made in reducing Labour's majority after a relatively smooth parliament.\n\nStaying at what they considered rock bottom however showed that the Conservatives had failed to improve their negative public image, had remained somewhat disunited over Europe and had not regained the trust that they had lost in the 1990s. But in Scotland, despite gaining one seat from the SNP, their vote collapse continued. They failed to retake former strongholds in Scotland as the Nationalists consolidated their grip on the Northeastern portion of the country.\n\nThe Liberal Democrats could point to steady progress under Charles Kennedy, gaining more seats than the main two parties – albeit only six overall – and maintaining the performance of a pleasing 1997 election, where the party had doubled its number of seats from 20 to 46. While they had yet to become electable as a government, they underlined their growing reputation as a worthwhile alternative to Labour and Conservative, offering plenty of debate in parliament and not just representing a protest vote.\n\nThe SNP failed to gain any seats and lost a seat to the Conservatives by just 79 votes. Plaid Cymru both gained a seat from Labour and lost one to them.\n\nIn Northern Ireland the Ulster Unionists, despite gaining North Down, lost 5 other seats.\n\n|}\n\nAll parties with more than 500 votes shown.\n\nThe seat gains reflect changes on the 1997 general election result. Two seats had changed hands in by-elections in the intervening period. These were as follows:\n* Romsey from Conservative to Liberal Democrats.  This seat stayed Liberal Democrat in 2001.\n* South Antrim from Ulster Unionists to Democratic Unionists.  This seat reverted to the Ulster Unionists in 2001.\n\nThe results of the election give a Gallagher index of dis-proportionality of 17.74.\n\nResults by constituent country \n\nSeats changing hands \n\nMPs that lost their seats. United Kingdom general election, 2001. http://en.wikipedia.org/?curid=3975."
  }
}
