{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8728",
  "eid" : "ea0f9960-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778472438,
  "textBody" : "Events\n\n* AD 69 – Emperor Vitellius is captured and murdered at the Gemonian stairs in Rome.\n* 401 – Pope Innocent I is elected.\n* 609 – Muhammad claims to receive his first revelation. \n* 856 – Damghan earthquake: An earthquake near the Persian city of Damghan kills an estimated 200,000 people, the sixth deadliest earthquake in recorded history.\n* 880 – Luoyang, eastern capital of the Tang dynasty, is captured by rebel leader Huang Chao during the reign of Emperor Xizong. \n*1135 – Stephen of Blois becomes King of England\n*1216 – Pope Honorius III approves the Dominican Order through the papal bull of confirmation Religiosam vitam.\n*1622 – Bucaramanga, Colombia is founded.\n*1769 – Sino-Burmese War: The war ends with an uneasy truce.\n*1788 – Nguyễn Huệ proclaims himself Emperor Quang Trung, in effect abolishing on his own the Lê dynasty.\n*1790 – The Turkish fortress of Izmail is stormed and captured by Alexander Suvorov and his Russian armies.\n*1807 – The Embargo Act, forbidding trade with all foreign countries, is passed by the U.S. Congress, at the urging of President Thomas Jefferson.\n*1808 – Ludwig van Beethoven conducts and performs in concert at the Theater an der Wien, Vienna, with the premiere of his Fifth Symphony, Sixth Symphony, Fourth Piano Concerto (performed by Beethoven himself) and Choral Fantasy (with Beethoven at the piano).\n*1851 – India's first freight train is operated in Roorkee, India.\n*1864 – Savannah, Georgia falls to the forces of General Sherman.\n*1885 – Itō Hirobumi, a samurai, became the first Prime Minister of Japan.\n*1888 –  The Christmas Meeting of 1888, considered to be the official start of the Faroese independence movement.\n*1890 – Cornwallis Valley Railway begins operation between Kentville and Kingsport, Nova Scotia.\n*1891 – Asteroid 323 Brucia becomes the first asteroid discovered using photography.\n*1894 – The Dreyfus affair begins in France, when Alfred Dreyfus is wrongly convicted of treason.\n*1920 – The GOELRO economic development plan is adopted by the 8th Congress of Soviets of the Russian SFSR.\n*1921 – Opening of Visva-Bharati College, also known as Santiniketan College, now Visva Bharati University, India.\n*1937 – The Lincoln Tunnel opens to traffic in New York City.\n*1939 – Indian Muslims observe a \"Day of Deliverance\" to celebrate the resignations of members of the Indian National Congress over their not having been consulted over the decision to enter World War II with the United Kingdom.\n*1940 – World War II: Himara is captured by the Greek army.\n*1942 – World War II: Adolf Hitler signs the order to develop the V-2 rocket as a weapon.\n*1944 – World War II: Battle of the Bulge: German troops demand the surrender of United States troops at Bastogne, Belgium, prompting the famous one word reply by General Anthony McAuliffe: \"Nuts!\"\n*  1944   – World War II: The Vietnam People's Army is formed to resist Japanese occupation of Indochina, now Vietnam.\n*1948 – Sjafruddin Prawiranegara established the Emergency Government of the Republic of Indonesia (Pemerintah Darurat Republik Indonesia, PDRI) in West Sumatra.\n*1951 – The Selangor Labour Party is founded in Selangor, Malaya.\n*1963 – The cruise ship Lakonia burns 180 mi north of Madeira, Portugal with the loss of 128 lives.\n*1964 – The first test flight of the SR-71 (Blackbird) took place at Air Force Plant 42 in Palmdale, California.\n*1965 – In the United Kingdom, a 70 mph speed limit is applied to all rural roads including motorways for the first time.\n*1968 – Cultural Revolution: People's Daily posted the instructions of Mao Zedong that \"The intellectual youth must go to the country, and will be educated from living in rural poverty.\"\n*1974 – Grande Comore, Anjouan and Mohéli vote to become the independent nation of Comoros. Mayotte remains under French administration.\n*  1974   – The house of former British Prime Minister Edward Heath is attacked by members of the Provisional IRA.\n*1978 – The pivotal Third Plenum of the 11th National Congress of the Communist Party of China is held in Beijing, with Deng Xiaoping reversing Mao-era policies to pursue a program for Chinese economic reform.\n*1984 – Bernhard Goetz shoots four would-be muggers on an express train in Manhattan section of New York, New York.\n*1987 – In Zimbabwe, the political parties ZANU and ZAPU reach an agreement that ends the violence in the Matabeleland region known as the Gukurahundi.\n*1989 – Communist President of Romania Nicolae Ceaușescu is overthrown by Ion Iliescu after days of bloody confrontations. The deposed dictator and his wife flee Bucharest in a helicopter as protesters erupt in cheers.\n*  1989   – Berlin's Brandenburg Gate re-opens after nearly 30 years, effectively ending the division of East and West Germany.\n*1990 – Lech Wałęsa is elected President of Poland.\n*  1990   – Final independence of Marshall Islands and Federated States of Micronesia after termination of trusteeship.\n*1997 – Acteal massacre: Attendees at a prayer meeting of Roman Catholic activists for indigenous causes in the small village of Acteal in the Mexican state of Chiapas are massacred by paramilitary forces.\n*  1997   – Hussein Farrah Aidid relinquishes the disputed title of President of Somalia by signing the Cairo Declaration, in Cairo, Egypt. It is the first major step towards reconciliation in Somalia since 1991.\n*2001 – Burhanuddin Rabbani, political leader of the Northern Alliance, hands over power in Afghanistan to the interim government headed by President Hamid Karzai.\n*  2001   – Richard Reid attempts to destroy a passenger airliner by igniting explosives hidden in his shoes aboard American Airlines Flight 63.\n*2008 – An ash dike ruptured at a solid waste containment area in Roane County, Tennessee, releasing  of coal fly ash slurry.\n*2010 – The repeal of the Don't ask, don't tell policy, the 17-year-old policy banning homosexuals serving openly in the United States military, is signed into law by President Barack Obama.\n*2016 -  A study finds the VSV-EBOV vaccine against the Ebola virus between 70-100% effective, and thus making it the first proven vaccine against the disease.\n*2017 - The UN Security Council votes 15–0 in favor of additional sanctions on North Korea, including measures to slash the country's petroleum imports by up to 90%.\n\nBirths\n\n*244 – Diocletian, Roman emperor (d. 311)\n* 948 – Gang Gam-chan, Korean official and general (d. 1031)\n*1095 – Roger II of Sicily (d. 1154)\n*1178 – Emperor Antoku of Japan (d. 1185)\n*1183 – Chagatai Khan, Mongol ruler (d. 1242)\n*1300 – Khutughtu Khan Kusala, Mongolian emperor (d. 1329)\n*1459 – Sultan Cem, Ottoman politician (d. 1495)\n*1546 – Kuroda Yoshitaka, Japanese daimyo (d. 1604)\n*1550 – Cesare Cremonini, Italian philosopher and author (d. 1631)\n*1569 – Étienne Martellange, French architect (d. 1641)\n*1591 – Tommaso Dingli, Maltese architect and sculptor (d. 1666)\n*1639 – Jean Racine, French poet and playwright (d. 1699)\n*1666 – Guru Gobind Singh, Indian guru and poet (d. 1708)\n*1694 – Hermann Samuel Reimarus, German philosopher and academic (d. 1768)\n*1696 – James Oglethorpe, English general and politician, 1st Colonial Governor of Georgia (d. 1785)\n*1723 – Carl Friedrich Abel, German viol player and composer (d. 1787)\n*1765 – Johann Friedrich Pfaff, German mathematician and academic (d. 1825)\n*1799 – Nicholas Callan, Irish priest and physicist (d. 1864)\n*1805 – John Obadiah Westwood, English entomologist and archaeologist (d. 1893)\n*1807 – Johan Sebastian Welhaven, Norwegian author, poet, and critic (d. 1873)\n*1819 – Franz Abt, German composer and conductor (d. 1870)\n*  1819   – Pierre Ossian Bonnet, French mathematician and academic (d. 1892)\n*1839 – John Nevil Maskelyne, English magician (d. 1917) \n*1850 – Victoriano Huerta, Mexican general and politician, 35th President of Mexico (d. 1916)\n*1853 – Teresa Carreño, Venezuelan-American singer-songwriter and pianist (d. 1917)\n*  1853   – Evgraf Fedorov, Russian mathematician, crystallographer, and mineralogist (d. 1919)\n*1853 – Sarada Devi, Indian mystic and philosopher (d. 1920)\n*1856 – Frank B. Kellogg, American lawyer and politician, 45th United States Secretary of State, Nobel Prize laureate (d. 1937)\n*1858 – Giacomo Puccini, Italian composer and educator (d. 1924)\n*1862 – Connie Mack, American baseball player and manager (d. 1956)\n*1865 – Charles Sands, American golfer and tennis player (d. 1945)\n*1868 – Jaan Tõnisson, Estonian journalist, lawyer, and politician, 2nd Prime Minister of Estonia (d. 1941?)\n*1869 – Dmitri Egorov, Russian mathematician and academic (d. 1931)\n*  1869   – Edwin Arlington Robinson, American poet and playwright (d. 1935)\n*1872 – Camille Guérin, French veterinarian and bacteriologist (d. 1961)\n*1874 – Franz Schmidt, Austrian cellist, pianist, and composer (d. 1939)\n*1876 – Filippo Tommaso Marinetti, Egyptian-Italian poet and composer (d. 1944)\n*1878 – Myer Prinstein, Polish-American jumper (d. 1925)\n*1883 – Marcus Hurley, American cyclist (d. 1941)\n*  1883   – Edgard Varèse, French-American composer (d. 1965)\n*1884 – St. Elmo Brady, African American chemist and educator (d. 1966)\n*1885 – Deems Taylor, American conductor and critic (d. 1966)\n*1887 – Srinivasa Ramanujan, Indian mathematician and theorist (d. 1920)\n*1888 – J. Arthur Rank, 1st Baron Rank, English businessman, founded Rank Organisation (d. 1972)\n*1889 – George Hutson, English runner and soldier (d. 1914)\n*1892 – Herman Potočnik, Croatian-Austrian engineer (d. 1929)\n*1898 – Vladimir Fock, Russian physicist and mathematician (d. 1974)\n*1899 – Gustaf Gründgens, German actor and director (d. 1963)\n*1900 – Marc Allégret, French director and screenwriter (d. 1973)\n*1901 – Andre Kostelanetz, Russian-American conductor and composer (d. 1980)\n*1903 – Haldan Keffer Hartline, American physiologist and academic, Nobel Prize laureate (d. 1983)\n*1905 – Pierre Brasseur, French-Italian actor and screenwriter (d. 1972)\n*  1905   – Pierre Levegh, French ice hockey player and race car driver (d. 1955)\n*  1905   – Kenneth Rexroth, American poet, translator, and academic (d. 1982)\n*1907 – Peggy Ashcroft, English actress (d. 1991)\n*1908 – Giacomo Manzù, Italian sculptor and academic (d. 1991)\n*1909 – Patricia Hayes, English actress (d. 1998)\n*1911 – Danny O'Dea, English actor (d. 2003)\n*1912 – Elias Degiannis, Greek commander (d. 1943)\n*  1912   – Lady Bird Johnson, American beautification activist;  38th First Lady of the United States (d. 2007)\n*1913 – Giorgio Oberweger, Italian discus thrower and hurdler (d. 1998)\n*1915 – Barbara Billingsley, American actress (d. 2010)\n*  1915   – Phillip Glasier, English author and academic (d. 2000)\n*1917 – Gene Rayburn, American game show host and actor (d. 1999)\n*1921 – Dimitri Fampas, Greek guitarist and composer (d. 1996)\n*  1921   – Hawkshaw Hawkins, American singer-songwriter and guitarist (d. 1963)\n*1922 – Ruth Roman, American actress (d. 1999)\n*  1922   – Jim Wright, American soldier, lawyer, and politician, 56th Speaker of the United States House of Representatives (d. 2015)\n*1923 – Peregrine Worsthorne, English journalist and author\n*1924 – Frank Corsaro, American actor and director (d. 2017)\n*1925 – Lewis Glucksman, American businessman and philanthropist (d. 2006)\n*  1925   – Lefter Küçükandonyadis, Turkish footballer and manager (d. 2012)\n*1926 – Alcides Ghiggia, Italian-Uruguayan footballer and manager (d. 2015)\n*  1926   – Roberta Leigh (Rita Shulman Lewin), British writer, artist and TV producer (d. 2014)\n*1928 – Fredrik Barth, German-Norwegian anthropologist and academic (d. 2016)\n*1929 – Wazir Mohammad, Indian-Pakistani cricketer\n*1930 – Ardalion Ignatyev, Russian sprinter and educator (d. 1998)\n*1931 – Gisela Birkemeyer, German hurdler and coach\n*  1931   – Carlos Graça, São Toméan lawyer and politician, Prime Minister of São Tomé and Príncipe (d. 2013)\n*1932 – Phil Woosnam, Welsh soccer player and manager (d. 2013)\n*1933 – John Hartle, English motorcycle racer (d. 1968)\n*1934 – David Pearson, American race car driver\n*1935 – Paulo Rocha, Portuguese director and screenwriter (d. 2012)\n*1936 – James Burke, Irish historian and author\n*  1936   – Héctor Elizondo, American actor and director\n*1937 – Charlotte Lamb, English author (d. 2000)\n*  1937   – Eduard Uspensky, Russian author, poet, and playwright\n*  1937   – Ken Whitmore, English author and playwright\n*1938 – Matty Alou, Dominican-American baseball player and scout (d. 2011)\n*  1938   – Lucien Bouchard, Canadian lawyer and politician, 27th Premier of Quebec\n*  1938   – Red Steagall, American singer-songwriter, guitarist, actor, and poet\n*1940 – Luis Francisco Cuéllar, Colombian rancher and politician (d. 2009)\n*  1940   – Mike Molloy, English journalist, author, and illustrator\n*1942 – Jerry Koosman, American baseball player\n*  1942   – Dick Parry, English saxophonist \n*1943 – Stefan Janos, Slovak-Swiss physicist and academic\n*  1943   – Paul Wolfowitz, American banker and politician, 25th United States Deputy Secretary of Defense\n*1944 – Mary Archer, English chemist and academic\n*  1944   – Steve Carlton, American baseball player\n*  1944   – Barry Jenkins, English drummer \n*1945 – Frances Lannon, English historian and academic\n*  1945   – Sam Newman, Australian footballer and sportscaster\n*  1945   – Diane Sawyer, American journalist\n*1946 – Roger Carr, English businessman\n*  1946   – C. Eugene Steuerle, American economist and author\n*1947 – Brian Daley, American author and screenwriter (d. 1996)\n*  1947   – Dilip Doshi, Indian cricketer\n*1948 – Steve Garvey, American baseball player and sportscaster\n*  1948   – Don Kardong, American runner, journalist, and author\n*  1948   – Rick Nielsen, American singer-songwriter and guitarist \n*  1948   – Chris Old, English cricketer and coach\n*  1948   – Lynne Thigpen, American actress and singer (d. 2003)\n*1949 – Maurice Gibb, Manx-English singer-songwriter and producer (d. 2003)\n*  1949   – Robin Gibb, Manx-English singer-songwriter and producer (d. 2012)\n*  1949   – Ray Guy, American football player\n*1951 – Lasse Bengtsson, Swedish journalist\n*  1951   – Charles de Lint, Dutch-Canadian author and critic\n*  1951   – Gerald Grosvenor, 6th Duke of Westminster, Anglo-Irish Territorial Army general, landowner, businessman, philanthropist, and hereditary peer (d. 2016)\n*  1951   – Jan Stephenson, Australian golfer\n*1952 – Sandra Kalniete, Russian-Latvian politician and diplomat, Latvian Minister of Foreign Affairs\n*1953 – Ian Turnbull, Canadian ice hockey player\n*  1953   – Tom Underwood, American baseball player (d. 2010)\n*1954 – Hideshi Matsuda, Japanese race car driver\n*  1954   – Derick Parry, Nevisian cricketer\n*1955 – Galina Murašova, Lithuanian discus thrower\n*  1955   – Lonnie Smith, American baseball player\n*  1955   – Thomas C. Südhof, German-American biochemist and academic, Nobel Prize laureate  \n*1956 – Jane Lighting, English businesswoman\n*1957 – Stephen Conway, English bishop\n*  1957   – Carole James, English-Canadian educator and politician\n*  1957   – Peter Mortimer, Australian rugby league player\n*1958 – Frank Gambale, Australian guitarist, songwriter, and producer\n*  1958   – David Heavener, American singer-songwriter, producer, actor, and director\n*1959 – Bernd Schuster, German footballer and manager\n*1960 – Jean-Michel Basquiat, American painter and poet (d. 1988)\n*  1960   – Mark Brydon, English guitarist, songwriter, and producer\n*  1960   – Luther Campbell, American rapper and actor \n*1961 – Andrew Fastow, American businessman\n*  1961   – Yuri Malenchenko, Russian colonel, pilot, and astronaut\n*1962 – Ralph Fiennes, English actor \n*1963 – Giuseppe Bergomi, Italian footballer and coach\n*  1963   – Russell Lewis, British television writer and former child actor\n*  1963   – Brian McMillan, South African cricketer and educator\n*  1963   – Luna H. Mitani, Japanese-American painter and illustrator\n*1964 – Simon Kirby, English businessman and politician\n*  1964   – Mike Jackson, American baseball player\n*  1965   – David S. Goyer, American screenwriter\n*1965 – Urszula Włodarczyk, Polish heptathlete and triple jumper\n*1966 – Dmitry Bilozerchev, Russian gymnast and coach\n*  1966   – Marcel Schirmer, German singer-songwriter and bass player \n*  1966   – David Wright, English lawyer and politician\n*1967 – Richey Edwards, Welsh singer-songwriter and guitarist (d. 1995)\n*  1967   – Stéphane Gendron, Canadian lawyer and politician\n*  1967   – Rebecca Harris, English businesswoman and politician\n*  1967   – Paul Morris, Australian race car driver and businessman\n*  1967   – Dan Petrescu, Romanian footballer and manager\n*1968 – Emre Aracı, Turkish composer, conductor, and historian\n*  1968   – Luis Hernández, Mexican footballer \n*  1968   – Dina Meyer, American actress\n*1969 – Myriam Bédard, Canadian biathlete\n*  1969   – Mark Robins, English footballer and manager\n*1970 – Ted Cruz, American lawyer and politician\n*1971 – Ajeenkya Patil, Indian economist and academic\n*1972 – Kirk Maltby, Canadian ice hockey player and scout\n*  1972   – Vanessa Paradis, French singer-songwriter and actress\n*  1972   – Mark Hill, English musician, producer and songwriter\n*1974 – Michael Barron, English footballer, coach, and manager\n*  1974   – Dani García, Spanish footballer \n*1975 – Sergei Aschwanden, Swiss martial artist\n*  1975   – Dmitri Khokhlov, Russian footballer and manager\n*  1975   – Marcin Mięciel, Polish footballer\n*  1975   – Stanislav Neckář, Czech ice hockey player\n*1976 – Katleen De Caluwé, Belgian sprinter\n*  1976   – Jason Lane, American baseball player and coach\n*  1976   – Aya Takano, Japanese author and illustrator\n*1977 – Steve Kariya, Canadian ice hockey player and coach\n*1978 – Danny Ahn, South Korean singer\n*  1978   – Joy Ali, Fijian boxer (d. 2015)\n*  1978   – Emmanuel Olisadebe, Nigerian-Polish footballer\n*1979 – Jamie Langfield, Scottish footballer and coach\n*1981 – Marina Kuptsova, Russian high jumper\n*1982 – Britta Heidemann, German fencer\n*  1982   – Rodney Martin, American sprinter\n*1983 – Ryan Eversley, American racing driver\n*  1983   – Drew Hankinson, American wrestler\n*  1983   – Viola Kibiwot, Kenyan runner\n*1984 – Basshunter, Swedish singer-songwriter and producer\n*1986 – Dennis Armfield, Australian footballer\n*  1986   – Fatih Öztürk, Turkish footballer\n*1987 – Éder, Bissau-Portuguese footballer\n*  1987   – Johannes Ahun, Estonian windsurfer\n*  1987   – Garfield Darien, French hurdler\n*1988 – Leigh Halfpenny, Welsh rugby player\n*1989 – Jordin Sparks, American singer-songwriter and actress\n*  1989   – Jharal Yow Yeh, Australian rugby league player\n*1990 – Jean-Baptiste Maunier, French actor and singer\n*  1990   – Josef Newgarden, American race car driver\n*1991 – Paul Alo-Emile, New Zealand-Australian rugby league player\n*1992 – Michaela Hončová, Slovak tennis player\n*1993 – David Klemmer, Australian rugby league player\n*  1993   – Meghan Trainor, American singer-songwriter and producer\n*1994 – Rúben Lameiras, Portuguese footballer\n*1998 – G Hannelius, American actress and singer\n\nDeaths\n\n* AD 69 – Vitellius, Roman emperor (b. 15)\n* 731 – Yuan Qianyao, official of the Chinese Tang Dynasty\n*1012 – Baha' al-Dawla, Buyid amir of Iraq\n*1060 – Cynesige, Archbishop of York\n*1100 – Bretislav II of Bohemia (b. 1060)\n*1115 – Olaf Magnusson, King of Norway (b. 1099)\n*1419 – Antipope John XXIII\n*1530 – Willibald Pirckheimer, German lawyer and author (b. 1470) \n*1554 – Alessandro Bonvicino, Italian painter (b. 1498)\n*1572 – François Clouet, French miniaturist (b. c. 1510)\n*1603 – Mehmed III, Ottoman sultan (b. 1566)\n*1641 – Maximilien de Béthune, Duke of Sully, 2nd Prime Minister of France (b. 1560)\n*1646 – Peter Mogila, Moldavian metropolitan and saint (b. 1596)\n*1660 – André Tacquet, Flemish priest and mathematician (b. 1612)\n*1666 – Guercino, Italian painter (b. 1591)\n*1681 – Richard Alleine, English minister and author (b. 1611)\n*1767 – John Newbery, English publisher (b. 1713)\n*1788 – Percivall Pott, English physician and surgeon (b. 1714)\n*1806 – William Vernon, English-American merchant (b. 1719)\n*1828 – William Hyde Wollaston, English chemist and physicist (b. 1766)\n*1867 – Jean-Victor Poncelet, French mathematician and engineer (b. 1788)\n*1870 – Gustavo Adolfo Bécquer, Spanish journalist, poet, and playwright (b. 1836)\n*1880 – George Eliot, English novelist and poet (b. 1819)\n*1891 – Paul de Lagarde, German biblical scholar and orientalist (b. 1827)\n*1899 – Dwight L. Moody, American evangelist and publisher, founded Moody Publishers (b. 1837)\n*1902 – Richard von Krafft-Ebing, German-Austrian psychiatrist and author (b. 1840)\n*1915 – Rose Talbot Bullard, American medical doctor and professor (b. 1864)\n*1917 – Frances Xavier Cabrini, Italian-American nun and saint (b. 1850)\n*1918 – Aristeidis Moraitinis, Greek lieutenant and pilot (b. 1891)\n*1919 – Hermann Weingärtner, German gymnast (b. 1864)\n*1925 – Amelie Beese, German pilot and engineer (b. 1886)\n*1939 – Ma Rainey, American singer (b. 1886)\n*1940 – Nathanael West, American author and screenwriter (b. 1903)\n*1941 – Karel Hašler, Czech actor, director, composer, and screenwriter (b. 1879)\n*1942 – Franz Boas, German-American anthropologist and linguist (b. 1858)\n*1943 – Beatrix Potter, English children's book writer and illustrator (b. 1866)\n*1944 – Harry Langdon, American actor, comedian, and vaudevillian (b. 1884)\n*1950 – Frederick Freake, English polo player (b. 1876)\n*1957 – Frank George Woollard, English engineer (b. 1883)\n*1959 – Gilda Gray, Polish-American actress and dancer (b. 1901)\n*1960 – Ninian Comper, Scottish-English architect (b. 1864)\n*1962 – Ross McLarty, Australian politician, 17th Premier of Western Australia (b. 1891)\n*1965 – Richard Dimbleby, English journalist (b. 1913)\n*1968 – Raymond Gram Swing, American journalist (b. 1887)\n*1969 – Enrique Peñaranda, 45th President of Bolivia (b. 1892)\n*1971 – Godfried Bomans, Dutch journalist and author (b. 1913)\n*1974 – Sterling North, American author and critic (b. 1906)\n*1979 – Darryl F. Zanuck, American director and producer (b. 1902)\n*1985 – D. Boon, American singer and musician (b. 1958)\n*1986 – Mary Burchell, English author and activist (b. 1904)\n*  1986   – David Penhaligon, Cornish Liberal Politician (b. 1944), MP for Truro (1974-1986)\n*1987 – Luca Prodan, Italian-Scottish singer-songwriter and guitarist (b. 1953)\n*1988 – Chico Mendes, Brazilian trade union leader and activist (b. 1944)\n*1989 – Samuel Beckett, Irish author, poet, and playwright, Nobel Prize laureate (b. 1906)\n*1992 – Harry Bluestone, English violinist and composer (b. 1907)\n*  1992   – Frederick William Franz, American religious leader (b. 1893)\n*1993 – Don DeFore, American actor (b. 1913)\n*1995 – Butterfly McQueen, American actress and dancer (b. 1911)\n*  1995   – James Meade, English economist and academic, Nobel Prize laureate (b. 1907)\n*1996 – Jack Hamm, American cartoonist and television host (b. 1916)\n*1997 – Sebastian Arcos Bergnes, Cuban-American dentist and activist (b. 1931)\n*2001 – Ovidiu Iacov, Romanian footballer (b. 1981)\n*  2001   – Walter Newton Read, American lawyer and second chairman of the New Jersey Casino Control Commission (b. 1918)\n*2002 – Desmond Hoyte, Guyanese lawyer and politician, 3rd President of Guyana (b. 1929)\n*  2002   – Joe Strummer, English singer-songwriter (b. 1952)\n*2004 – Doug Ault, American baseball player and manager (b. 1950)\n*2006 – Elena Mukhina, Russian gymnast (b. 1960)\n*  2006   – Galina Ustvolskaya, Russian composer (b. 1919)\n*2007 – Charles Court, Australian politician, 21st Premier of Western Australia (b. 1911)\n*  2007   – Adrian Cristobal, Filipino journalist and playwright (b. 1932)\n*2009 – Luis Francisco Cuéllar, Colombian rancher and politician (b. 1940)\n*  2009   – Albert Scanlon, English footballer (b. 1935)\n*2010 – Fred Foy, American soldier and announcer (b. 1921)\n*2012 – Chuck Cherundolo, American football player and coach (b. 1916)\n*  2012   – Ryan Freel, American baseball player (b. 1976)\n*  2012   – Cliff Osmond, American actor, director, producer, and screenwriter (b. 1937)\n*  2012   – Lim Keng Yaik, Malaysian physician and politician (b. 1939)\n*2013 – Diomedes Díaz, Colombian singer-songwriter (b. 1956)\n*  2013   – Hans Hækkerup, Danish lawyer and politician (b. 1945)\n*  2013   – Ed Herrmann, American baseball player, coach, and manager (b. 1946)\n*  2013   – Oscar Peer, Swiss author, playwright, and philologist (b. 1928)\n*2014 – John Robert Beyster, American physicist and academic (b. 1924)\n*  2014   – Christine Cavanaugh, American actress (b. 1963)\n*  2014   – Joe Cocker, English singer-songwriter (b. 1944)\n*  2014   – Bernard Stone, American lawyer and politician (b. 1927)\n*2015 – Peter Lundblad, Swedish singer-songwriter (b. 1950)\n*  2015   – Freda Meissner-Blau, Australian activist and politician (b. 1927)\n*2016 – Chad Robinson, Australian rugby league player (b. 1980)\n*2017 – Gonzalo Morales Sáurez, Costa Rican Painter (b. 1945)\n\nHolidays and observances\n\n*Armed Forces Day (Vietnam)\n*Christian feast day:\n**Anastasia of Sirmium (Orthodox Church)\n**O Rex\n**Henry Budd (Episcopal Church (USA))\n**Lottie Moon (Episcopal Church (USA))\n**December 22 (Eastern Orthodox liturgics)\n*Mother's Day (Indonesia)\n*National Mathematics Day (India)\n*Teachers' Day (Cuba)\n*Unity Day (Zimbabwe)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "December 22" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8728" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* AD 69 – Emperor Vitellius is captured and murdered at the Gemonian stairs in Rome.\n* 401 – Pope Innocent I is elected.\n* 609 – Muhammad claims to receive his first revelation. \n* 856 – Damghan earthquake: An earthquake near the Persian city of Damghan kills an estimated 200,000 people, the sixth deadliest earthquake in recorded history.\n* 880 – Luoyang, eastern capital of the Tang dynasty, is captured by rebel leader Huang Chao during the reign of Emperor Xizong. \n*1135 – Stephen of Blois becomes King of England\n*1216 – Pope Honorius III approves the Dominican Order through the papal bull of confirmation Religiosam vitam.\n*1622 – Bucaramanga, Colombia is founded.\n*1769 – Sino-Burmese War: The war ends with an uneasy truce.\n*1788 – Nguyễn Huệ proclaims himself Emperor Quang Trung, in effect abolishing on his own the Lê dynasty.\n*1790 – The Turkish fortress of Izmail is stormed and captured by Alexander Suvorov and his Russian armies.\n*1807 – The Embargo Act, forbidding trade with all foreign countries, is passed by the U.S. Congress, at the urging of President Thomas Jefferson.\n*1808 – Ludwig van Beethoven conducts and performs in concert at the Theater an der Wien, Vienna, with the premiere of his Fifth Symphony, Sixth Symphony, Fourth Piano Concerto (performed by Beethoven himself) and Choral Fantasy (with Beethoven at the piano).\n*1851 – India's first freight train is operated in Roorkee, India.\n*1864 – Savannah, Georgia falls to the forces of General Sherman.\n*1885 – Itō Hirobumi, a samurai, became the first Prime Minister of Japan.\n*1888 –  The Christmas Meeting of 1888, considered to be the official start of the Faroese independence movement.\n*1890 – Cornwallis Valley Railway begins operation between Kentville and Kingsport, Nova Scotia.\n*1891 – Asteroid 323 Brucia becomes the first asteroid discovered using photography.\n*1894 – The Dreyfus affair begins in France, when Alfred Dreyfus is wrongly convicted of treason.\n*1920 – The GOELRO economic development plan is adopted by the 8th Congress of Soviets of the Russian SFSR.\n*1921 – Opening of Visva-Bharati College, also known as Santiniketan College, now Visva Bharati University, India.\n*1937 – The Lincoln Tunnel opens to traffic in New York City.\n*1939 – Indian Muslims observe a \"Day of Deliverance\" to celebrate the resignations of members of the Indian National Congress over their not having been consulted over the decision to enter World War II with the United Kingdom.\n*1940 – World War II: Himara is captured by the Greek army.\n*1942 – World War II: Adolf Hitler signs the order to develop the V-2 rocket as a weapon.\n*1944 – World War II: Battle of the Bulge: German troops demand the surrender of United States troops at Bastogne, Belgium, prompting the famous one word reply by General Anthony McAuliffe: \"Nuts!\"\n*  1944   – World War II: The Vietnam People's Army is formed to resist Japanese occupation of Indochina, now Vietnam.\n*1948 – Sjafruddin Prawiranegara established the Emergency Government of the Republic of Indonesia (Pemerintah Darurat Republik Indonesia, PDRI) in West Sumatra.\n*1951 – The Selangor Labour Party is founded in Selangor, Malaya.\n*1963 – The cruise ship Lakonia burns 180 mi north of Madeira, Portugal with the loss of 128 lives.\n*1964 – The first test flight of the SR-71 (Blackbird) took place at Air Force Plant 42 in Palmdale, California.\n*1965 – In the United Kingdom, a 70 mph speed limit is applied to all rural roads including motorways for the first time.\n*1968 – Cultural Revolution: People's Daily posted the instructions of Mao Zedong that \"The intellectual youth must go to the country, and will be educated from living in rural poverty.\"\n*1974 – Grande Comore, Anjouan and Mohéli vote to become the independent nation of Comoros. Mayotte remains under French administration.\n*  1974   – The house of former British Prime Minister Edward Heath is attacked by members of the Provisional IRA.\n*1978 – The pivotal Third Plenum of the 11th National Congress of the Communist Party of China is held in Beijing, with Deng Xiaoping reversing Mao-era policies to pursue a program for Chinese economic reform.\n*1984 – Bernhard Goetz shoots four would-be muggers on an express train in Manhattan section of New York, New York.\n*1987 – In Zimbabwe, the political parties ZANU and ZAPU reach an agreement that ends the violence in the Matabeleland region known as the Gukurahundi.\n*1989 – Communist President of Romania Nicolae Ceaușescu is overthrown by Ion Iliescu after days of bloody confrontations. The deposed dictator and his wife flee Bucharest in a helicopter as protesters erupt in cheers.\n*  1989   – Berlin's Brandenburg Gate re-opens after nearly 30 years, effectively ending the division of East and West Germany.\n*1990 – Lech Wałęsa is elected President of Poland.\n*  1990   – Final independence of Marshall Islands and Federated States of Micronesia after termination of trusteeship.\n*1997 – Acteal massacre: Attendees at a prayer meeting of Roman Catholic activists for indigenous causes in the small village of Acteal in the Mexican state of Chiapas are massacred by paramilitary forces.\n*  1997   – Hussein Farrah Aidid relinquishes the disputed title of President of Somalia by signing the Cairo Declaration, in Cairo, Egypt. It is the first major step towards reconciliation in Somalia since 1991.\n*2001 – Burhanuddin Rabbani, political leader of the Northern Alliance, hands over power in Afghanistan to the interim government headed by President Hamid Karzai.\n*  2001   – Richard Reid attempts to destroy a passenger airliner by igniting explosives hidden in his shoes aboard American Airlines Flight 63.\n*2008 – An ash dike ruptured at a solid waste containment area in Roane County, Tennessee, releasing  of coal fly ash slurry.\n*2010 – The repeal of the Don't ask, don't tell policy, the 17-year-old policy banning homosexuals serving openly in the United States military, is signed into law by President Barack Obama.\n*2016 -  A study finds the VSV-EBOV vaccine against the Ebola virus between 70-100% effective, and thus making it the first proven vaccine against the disease.\n*2017 - The UN Security Council votes 15–0 in favor of additional sanctions on North Korea, including measures to slash the country's petroleum imports by up to 90%.\n\nBirths\n\n*244 – Diocletian, Roman emperor (d. 311)\n* 948 – Gang Gam-chan, Korean official and general (d. 1031)\n*1095 – Roger II of Sicily (d. 1154)\n*1178 – Emperor Antoku of Japan (d. 1185)\n*1183 – Chagatai Khan, Mongol ruler (d. 1242)\n*1300 – Khutughtu Khan Kusala, Mongolian emperor (d. 1329)\n*1459 – Sultan Cem, Ottoman politician (d. 1495)\n*1546 – Kuroda Yoshitaka, Japanese daimyo (d. 1604)\n*1550 – Cesare Cremonini, Italian philosopher and author (d. 1631)\n*1569 – Étienne Martellange, French architect (d. 1641)\n*1591 – Tommaso Dingli, Maltese architect and sculptor (d. 1666)\n*1639 – Jean Racine, French poet and playwright (d. 1699)\n*1666 – Guru Gobind Singh, Indian guru and poet (d. 1708)\n*1694 – Hermann Samuel Reimarus, German philosopher and academic (d. 1768)\n*1696 – James Oglethorpe, English general and politician, 1st Colonial Governor of Georgia (d. 1785)\n*1723 – Carl Friedrich Abel, German viol player and composer (d. 1787)\n*1765 – Johann Friedrich Pfaff, German mathematician and academic (d. 1825)\n*1799 – Nicholas Callan, Irish priest and physicist (d. 1864)\n*1805 – John Obadiah Westwood, English entomologist and archaeologist (d. 1893)\n*1807 – Johan Sebastian Welhaven, Norwegian author, poet, and critic (d. 1873)\n*1819 – Franz Abt, German composer and conductor (d. 1870)\n*  1819   – Pierre Ossian Bonnet, French mathematician and academic (d. 1892)\n*1839 – John Nevil Maskelyne, English magician (d. 1917) \n*1850 – Victoriano Huerta, Mexican general and politician, 35th President of Mexico (d. 1916)\n*1853 – Teresa Carreño, Venezuelan-American singer-songwriter and pianist (d. 1917)\n*  1853   – Evgraf Fedorov, Russian mathematician, crystallographer, and mineralogist (d. 1919)\n*1853 – Sarada Devi, Indian mystic and philosopher (d. 1920)\n*1856 – Frank B. Kellogg, American lawyer and politician, 45th United States Secretary of State, Nobel Prize laureate (d. 1937)\n*1858 – Giacomo Puccini, Italian composer and educator (d. 1924)\n*1862 – Connie Mack, American baseball player and manager (d. 1956)\n*1865 – Charles Sands, American golfer and tennis player (d. 1945)\n*1868 – Jaan Tõnisson, Estonian journalist, lawyer, and politician, 2nd Prime Minister of Estonia (d. 1941?)\n*1869 – Dmitri Egorov, Russian mathematician and academic (d. 1931)\n*  1869   – Edwin Arlington Robinson, American poet and playwright (d. 1935)\n*1872 – Camille Guérin, French veterinarian and bacteriologist (d. 1961)\n*1874 – Franz Schmidt, Austrian cellist, pianist, and composer (d. 1939)\n*1876 – Filippo Tommaso Marinetti, Egyptian-Italian poet and composer (d. 1944)\n*1878 – Myer Prinstein, Polish-American jumper (d. 1925)\n*1883 – Marcus Hurley, American cyclist (d. 1941)\n*  1883   – Edgard Varèse, French-American composer (d. 1965)\n*1884 – St. Elmo Brady, African American chemist and educator (d. 1966)\n*1885 – Deems Taylor, American conductor and critic (d. 1966)\n*1887 – Srinivasa Ramanujan, Indian mathematician and theorist (d. 1920)\n*1888 – J. Arthur Rank, 1st Baron Rank, English businessman, founded Rank Organisation (d. 1972)\n*1889 – George Hutson, English runner and soldier (d. 1914)\n*1892 – Herman Potočnik, Croatian-Austrian engineer (d. 1929)\n*1898 – Vladimir Fock, Russian physicist and mathematician (d. 1974)\n*1899 – Gustaf Gründgens, German actor and director (d. 1963)\n*1900 – Marc Allégret, French director and screenwriter (d. 1973)\n*1901 – Andre Kostelanetz, Russian-American conductor and composer (d. 1980)\n*1903 – Haldan Keffer Hartline, American physiologist and academic, Nobel Prize laureate (d. 1983)\n*1905 – Pierre Brasseur, French-Italian actor and screenwriter (d. 1972)\n*  1905   – Pierre Levegh, French ice hockey player and race car driver (d. 1955)\n*  1905   – Kenneth Rexroth, American poet, translator, and academic (d. 1982)\n*1907 – Peggy Ashcroft, English actress (d. 1991)\n*1908 – Giacomo Manzù, Italian sculptor and academic (d. 1991)\n*1909 – Patricia Hayes, English actress (d. 1998)\n*1911 – Danny O'Dea, English actor (d. 2003)\n*1912 – Elias Degiannis, Greek commander (d. 1943)\n*  1912   – Lady Bird Johnson, American beautification activist;  38th First Lady of the United States (d. 2007)\n*1913 – Giorgio Oberweger, Italian discus thrower and hurdler (d. 1998)\n*1915 – Barbara Billingsley, American actress (d. 2010)\n*  1915   – Phillip Glasier, English author and academic (d. 2000)\n*1917 – Gene Rayburn, American game show host and actor (d. 1999)\n*1921 – Dimitri Fampas, Greek guitarist and composer (d. 1996)\n*  1921   – Hawkshaw Hawkins, American singer-songwriter and guitarist (d. 1963)\n*1922 – Ruth Roman, American actress (d. 1999)\n*  1922   – Jim Wright, American soldier, lawyer, and politician, 56th Speaker of the United States House of Representatives (d. 2015)\n*1923 – Peregrine Worsthorne, English journalist and author\n*1924 – Frank Corsaro, American actor and director (d. 2017)\n*1925 – Lewis Glucksman, American businessman and philanthropist (d. 2006)\n*  1925   – Lefter Küçükandonyadis, Turkish footballer and manager (d. 2012)\n*1926 – Alcides Ghiggia, Italian-Uruguayan footballer and manager (d. 2015)\n*  1926   – Roberta Leigh (Rita Shulman Lewin), British writer, artist and TV producer (d. 2014)\n*1928 – Fredrik Barth, German-Norwegian anthropologist and academic (d. 2016)\n*1929 – Wazir Mohammad, Indian-Pakistani cricketer\n*1930 – Ardalion Ignatyev, Russian sprinter and educator (d. 1998)\n*1931 – Gisela Birkemeyer, German hurdler and coach\n*  1931   – Carlos Graça, São Toméan lawyer and politician, Prime Minister of São Tomé and Príncipe (d. 2013)\n*1932 – Phil Woosnam, Welsh soccer player and manager (d. 2013)\n*1933 – John Hartle, English motorcycle racer (d. 1968)\n*1934 – David Pearson, American race car driver\n*1935 – Paulo Rocha, Portuguese director and screenwriter (d. 2012)\n*1936 – James Burke, Irish historian and author\n*  1936   – Héctor Elizondo, American actor and director\n*1937 – Charlotte Lamb, English author (d. 2000)\n*  1937   – Eduard Uspensky, Russian author, poet, and playwright\n*  1937   – Ken Whitmore, English author and playwright\n*1938 – Matty Alou, Dominican-American baseball player and scout (d. 2011)\n*  1938   – Lucien Bouchard, Canadian lawyer and politician, 27th Premier of Quebec\n*  1938   – Red Steagall, American singer-songwriter, guitarist, actor, and poet\n*1940 – Luis Francisco Cuéllar, Colombian rancher and politician (d. 2009)\n*  1940   – Mike Molloy, English journalist, author, and illustrator\n*1942 – Jerry Koosman, American baseball player\n*  1942   – Dick Parry, English saxophonist \n*1943 – Stefan Janos, Slovak-Swiss physicist and academic\n*  1943   – Paul Wolfowitz, American banker and politician, 25th United States Deputy Secretary of Defense\n*1944 – Mary Archer, English chemist and academic\n*  1944   – Steve Carlton, American baseball player\n*  1944   – Barry Jenkins, English drummer \n*1945 – Frances Lannon, English historian and academic\n*  1945   – Sam Newman, Australian footballer and sportscaster\n*  1945   – Diane Sawyer, American journalist\n*1946 – Roger Carr, English businessman\n*  1946   – C. Eugene Steuerle, American economist and author\n*1947 – Brian Daley, American author and screenwriter (d. 1996)\n*  1947   – Dilip Doshi, Indian cricketer\n*1948 – Steve Garvey, American baseball player and sportscaster\n*  1948   – Don Kardong, American runner, journalist, and author\n*  1948   – Rick Nielsen, American singer-songwriter and guitarist \n*  1948   – Chris Old, English cricketer and coach\n*  1948   – Lynne Thigpen, American actress and singer (d. 2003)\n*1949 – Maurice Gibb, Manx-English singer-songwriter and producer (d. 2003)\n*  1949   – Robin Gibb, Manx-English singer-songwriter and producer (d. 2012)\n*  1949   – Ray Guy, American football player\n*1951 – Lasse Bengtsson, Swedish journalist\n*  1951   – Charles de Lint, Dutch-Canadian author and critic\n*  1951   – Gerald Grosvenor, 6th Duke of Westminster, Anglo-Irish Territorial Army general, landowner, businessman, philanthropist, and hereditary peer (d. 2016)\n*  1951   – Jan Stephenson, Australian golfer\n*1952 – Sandra Kalniete, Russian-Latvian politician and diplomat, Latvian Minister of Foreign Affairs\n*1953 – Ian Turnbull, Canadian ice hockey player\n*  1953   – Tom Underwood, American baseball player (d. 2010)\n*1954 – Hideshi Matsuda, Japanese race car driver\n*  1954   – Derick Parry, Nevisian cricketer\n*1955 – Galina Murašova, Lithuanian discus thrower\n*  1955   – Lonnie Smith, American baseball player\n*  1955   – Thomas C. Südhof, German-American biochemist and academic, Nobel Prize laureate  \n*1956 – Jane Lighting, English businesswoman\n*1957 – Stephen Conway, English bishop\n*  1957   – Carole James, English-Canadian educator and politician\n*  1957   – Peter Mortimer, Australian rugby league player\n*1958 – Frank Gambale, Australian guitarist, songwriter, and producer\n*  1958   – David Heavener, American singer-songwriter, producer, actor, and director\n*1959 – Bernd Schuster, German footballer and manager\n*1960 – Jean-Michel Basquiat, American painter and poet (d. 1988)\n*  1960   – Mark Brydon, English guitarist, songwriter, and producer\n*  1960   – Luther Campbell, American rapper and actor \n*1961 – Andrew Fastow, American businessman\n*  1961   – Yuri Malenchenko, Russian colonel, pilot, and astronaut\n*1962 – Ralph Fiennes, English actor \n*1963 – Giuseppe Bergomi, Italian footballer and coach\n*  1963   – Russell Lewis, British television writer and former child actor\n*  1963   – Brian McMillan, South African cricketer and educator\n*  1963   – Luna H. Mitani, Japanese-American painter and illustrator\n*1964 – Simon Kirby, English businessman and politician\n*  1964   – Mike Jackson, American baseball player\n*  1965   – David S. Goyer, American screenwriter\n*1965 – Urszula Włodarczyk, Polish heptathlete and triple jumper\n*1966 – Dmitry Bilozerchev, Russian gymnast and coach\n*  1966   – Marcel Schirmer, German singer-songwriter and bass player \n*  1966   – David Wright, English lawyer and politician\n*1967 – Richey Edwards, Welsh singer-songwriter and guitarist (d. 1995)\n*  1967   – Stéphane Gendron, Canadian lawyer and politician\n*  1967   – Rebecca Harris, English businesswoman and politician\n*  1967   – Paul Morris, Australian race car driver and businessman\n*  1967   – Dan Petrescu, Romanian footballer and manager\n*1968 – Emre Aracı, Turkish composer, conductor, and historian\n*  1968   – Luis Hernández, Mexican footballer \n*  1968   – Dina Meyer, American actress\n*1969 – Myriam Bédard, Canadian biathlete\n*  1969   – Mark Robins, English footballer and manager\n*1970 – Ted Cruz, American lawyer and politician\n*1971 – Ajeenkya Patil, Indian economist and academic\n*1972 – Kirk Maltby, Canadian ice hockey player and scout\n*  1972   – Vanessa Paradis, French singer-songwriter and actress\n*  1972   – Mark Hill, English musician, producer and songwriter\n*1974 – Michael Barron, English footballer, coach, and manager\n*  1974   – Dani García, Spanish footballer \n*1975 – Sergei Aschwanden, Swiss martial artist\n*  1975   – Dmitri Khokhlov, Russian footballer and manager\n*  1975   – Marcin Mięciel, Polish footballer\n*  1975   – Stanislav Neckář, Czech ice hockey player\n*1976 – Katleen De Caluwé, Belgian sprinter\n*  1976   – Jason Lane, American baseball player and coach\n*  1976   – Aya Takano, Japanese author and illustrator\n*1977 – Steve Kariya, Canadian ice hockey player and coach\n*1978 – Danny Ahn, South Korean singer\n*  1978   – Joy Ali, Fijian boxer (d. 2015)\n*  1978   – Emmanuel Olisadebe, Nigerian-Polish footballer\n*1979 – Jamie Langfield, Scottish footballer and coach\n*1981 – Marina Kuptsova, Russian high jumper\n*1982 – Britta Heidemann, German fencer\n*  1982   – Rodney Martin, American sprinter\n*1983 – Ryan Eversley, American racing driver\n*  1983   – Drew Hankinson, American wrestler\n*  1983   – Viola Kibiwot, Kenyan runner\n*1984 – Basshunter, Swedish singer-songwriter and producer\n*1986 – Dennis Armfield, Australian footballer\n*  1986   – Fatih Öztürk, Turkish footballer\n*1987 – Éder, Bissau-Portuguese footballer\n*  1987   – Johannes Ahun, Estonian windsurfer\n*  1987   – Garfield Darien, French hurdler\n*1988 – Leigh Halfpenny, Welsh rugby player\n*1989 – Jordin Sparks, American singer-songwriter and actress\n*  1989   – Jharal Yow Yeh, Australian rugby league player\n*1990 – Jean-Baptiste Maunier, French actor and singer\n*  1990   – Josef Newgarden, American race car driver\n*1991 – Paul Alo-Emile, New Zealand-Australian rugby league player\n*1992 – Michaela Hončová, Slovak tennis player\n*1993 – David Klemmer, Australian rugby league player\n*  1993   – Meghan Trainor, American singer-songwriter and producer\n*1994 – Rúben Lameiras, Portuguese footballer\n*1998 – G Hannelius, American actress and singer\n\nDeaths\n\n* AD 69 – Vitellius, Roman emperor (b. 15)\n* 731 – Yuan Qianyao, official of the Chinese Tang Dynasty\n*1012 – Baha' al-Dawla, Buyid amir of Iraq\n*1060 – Cynesige, Archbishop of York\n*1100 – Bretislav II of Bohemia (b. 1060)\n*1115 – Olaf Magnusson, King of Norway (b. 1099)\n*1419 – Antipope John XXIII\n*1530 – Willibald Pirckheimer, German lawyer and author (b. 1470) \n*1554 – Alessandro Bonvicino, Italian painter (b. 1498)\n*1572 – François Clouet, French miniaturist (b. c. 1510)\n*1603 – Mehmed III, Ottoman sultan (b. 1566)\n*1641 – Maximilien de Béthune, Duke of Sully, 2nd Prime Minister of France (b. 1560)\n*1646 – Peter Mogila, Moldavian metropolitan and saint (b. 1596)\n*1660 – André Tacquet, Flemish priest and mathematician (b. 1612)\n*1666 – Guercino, Italian painter (b. 1591)\n*1681 – Richard Alleine, English minister and author (b. 1611)\n*1767 – John Newbery, English publisher (b. 1713)\n*1788 – Percivall Pott, English physician and surgeon (b. 1714)\n*1806 – William Vernon, English-American merchant (b. 1719)\n*1828 – William Hyde Wollaston, English chemist and physicist (b. 1766)\n*1867 – Jean-Victor Poncelet, French mathematician and engineer (b. 1788)\n*1870 – Gustavo Adolfo Bécquer, Spanish journalist, poet, and playwright (b. 1836)\n*1880 – George Eliot, English novelist and poet (b. 1819)\n*1891 – Paul de Lagarde, German biblical scholar and orientalist (b. 1827)\n*1899 – Dwight L. Moody, American evangelist and publisher, founded Moody Publishers (b. 1837)\n*1902 – Richard von Krafft-Ebing, German-Austrian psychiatrist and author (b. 1840)\n*1915 – Rose Talbot Bullard, American medical doctor and professor (b. 1864)\n*1917 – Frances Xavier Cabrini, Italian-American nun and saint (b. 1850)\n*1918 – Aristeidis Moraitinis, Greek lieutenant and pilot (b. 1891)\n*1919 – Hermann Weingärtner, German gymnast (b. 1864)\n*1925 – Amelie Beese, German pilot and engineer (b. 1886)\n*1939 – Ma Rainey, American singer (b. 1886)\n*1940 – Nathanael West, American author and screenwriter (b. 1903)\n*1941 – Karel Hašler, Czech actor, director, composer, and screenwriter (b. 1879)\n*1942 – Franz Boas, German-American anthropologist and linguist (b. 1858)\n*1943 – Beatrix Potter, English children's book writer and illustrator (b. 1866)\n*1944 – Harry Langdon, American actor, comedian, and vaudevillian (b. 1884)\n*1950 – Frederick Freake, English polo player (b. 1876)\n*1957 – Frank George Woollard, English engineer (b. 1883)\n*1959 – Gilda Gray, Polish-American actress and dancer (b. 1901)\n*1960 – Ninian Comper, Scottish-English architect (b. 1864)\n*1962 – Ross McLarty, Australian politician, 17th Premier of Western Australia (b. 1891)\n*1965 – Richard Dimbleby, English journalist (b. 1913)\n*1968 – Raymond Gram Swing, American journalist (b. 1887)\n*1969 – Enrique Peñaranda, 45th President of Bolivia (b. 1892)\n*1971 – Godfried Bomans, Dutch journalist and author (b. 1913)\n*1974 – Sterling North, American author and critic (b. 1906)\n*1979 – Darryl F. Zanuck, American director and producer (b. 1902)\n*1985 – D. Boon, American singer and musician (b. 1958)\n*1986 – Mary Burchell, English author and activist (b. 1904)\n*  1986   – David Penhaligon, Cornish Liberal Politician (b. 1944), MP for Truro (1974-1986)\n*1987 – Luca Prodan, Italian-Scottish singer-songwriter and guitarist (b. 1953)\n*1988 – Chico Mendes, Brazilian trade union leader and activist (b. 1944)\n*1989 – Samuel Beckett, Irish author, poet, and playwright, Nobel Prize laureate (b. 1906)\n*1992 – Harry Bluestone, English violinist and composer (b. 1907)\n*  1992   – Frederick William Franz, American religious leader (b. 1893)\n*1993 – Don DeFore, American actor (b. 1913)\n*1995 – Butterfly McQueen, American actress and dancer (b. 1911)\n*  1995   – James Meade, English economist and academic, Nobel Prize laureate (b. 1907)\n*1996 – Jack Hamm, American cartoonist and television host (b. 1916)\n*1997 – Sebastian Arcos Bergnes, Cuban-American dentist and activist (b. 1931)\n*2001 – Ovidiu Iacov, Romanian footballer (b. 1981)\n*  2001   – Walter Newton Read, American lawyer and second chairman of the New Jersey Casino Control Commission (b. 1918)\n*2002 – Desmond Hoyte, Guyanese lawyer and politician, 3rd President of Guyana (b. 1929)\n*  2002   – Joe Strummer, English singer-songwriter (b. 1952)\n*2004 – Doug Ault, American baseball player and manager (b. 1950)\n*2006 – Elena Mukhina, Russian gymnast (b. 1960)\n*  2006   – Galina Ustvolskaya, Russian composer (b. 1919)\n*2007 – Charles Court, Australian politician, 21st Premier of Western Australia (b. 1911)\n*  2007   – Adrian Cristobal, Filipino journalist and playwright (b. 1932)\n*2009 – Luis Francisco Cuéllar, Colombian rancher and politician (b. 1940)\n*  2009   – Albert Scanlon, English footballer (b. 1935)\n*2010 – Fred Foy, American soldier and announcer (b. 1921)\n*2012 – Chuck Cherundolo, American football player and coach (b. 1916)\n*  2012   – Ryan Freel, American baseball player (b. 1976)\n*  2012   – Cliff Osmond, American actor, director, producer, and screenwriter (b. 1937)\n*  2012   – Lim Keng Yaik, Malaysian physician and politician (b. 1939)\n*2013 – Diomedes Díaz, Colombian singer-songwriter (b. 1956)\n*  2013   – Hans Hækkerup, Danish lawyer and politician (b. 1945)\n*  2013   – Ed Herrmann, American baseball player, coach, and manager (b. 1946)\n*  2013   – Oscar Peer, Swiss author, playwright, and philologist (b. 1928)\n*2014 – John Robert Beyster, American physicist and academic (b. 1924)\n*  2014   – Christine Cavanaugh, American actress (b. 1963)\n*  2014   – Joe Cocker, English singer-songwriter (b. 1944)\n*  2014   – Bernard Stone, American lawyer and politician (b. 1927)\n*2015 – Peter Lundblad, Swedish singer-songwriter (b. 1950)\n*  2015   – Freda Meissner-Blau, Australian activist and politician (b. 1927)\n*2016 – Chad Robinson, Australian rugby league player (b. 1980)\n*2017 – Gonzalo Morales Sáurez, Costa Rican Painter (b. 1945)\n\nHolidays and observances\n\n*Armed Forces Day (Vietnam)\n*Christian feast day:\n**Anastasia of Sirmium (Orthodox Church)\n**O Rex\n**Henry Budd (Episcopal Church (USA))\n**Lottie Moon (Episcopal Church (USA))\n**December 22 (Eastern Orthodox liturgics)\n*Mother's Day (Indonesia)\n*National Mathematics Day (India)\n*Teachers' Day (Cuba)\n*Unity Day (Zimbabwe). December 22. http://en.wikipedia.org/?curid=8728."
  }
}
