{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7978",
  "eid" : "e47c98e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778463086,
  "textBody" : "The Data Encryption Standard (DES,) is a symmetric-key algorithm for the encryption of electronic data. Although now considered insecure, it was highly influential in the advancement of modern cryptography.\n\nDeveloped in the early 1970s at IBM and based on an earlier design by Horst Feistel, the algorithm was submitted to the National Bureau of Standards (NBS) following the agency's invitation to propose a candidate for the protection of sensitive, unclassified electronic government data. In 1976, after consultation with the National Security Agency (NSA), the NBS eventually selected a slightly modified version (strengthened against differential cryptanalysis, but weakened against brute-force attacks), which was published as an official Federal Information Processing Standard (FIPS) for the United States in 1977.\n\nThe publication of an NSA-approved encryption standard simultaneously resulted in its quick international adoption and widespread academic scrutiny. Controversies arose out of classified design elements, a relatively short key length of the symmetric-key block cipher design, and the involvement of the NSA, nourishing suspicions about a backdoor. The intense academic scrutiny the algorithm received over time led to the modern understanding of block ciphers and their cryptanalysis.\n\nDES is now considered to be insecure for many applications. This is mainly due to the 56-bit key size being too small. In January 1999, distributed.net and the Electronic Frontier Foundation collaborated to publicly break a DES key in 22 hours and 15 minutes (see chronology). There are also some analytical results which demonstrate theoretical weaknesses in the cipher, although they are infeasible to mount in practice. The algorithm is believed to be practically secure in the form of Triple DES, although there are theoretical attacks. This cipher has been superseded by the Advanced Encryption Standard (AES). Furthermore, DES has been withdrawn as a standard by the National Institute of Standards and Technology.\n\nSome documentation makes a distinction between DES as a standard and as an algorithm, referring to the algorithm as the DEA (Data Encryption Algorithm).\n\nHistory of DES \n\nThe origins of DES go back to the early 1970s. In 1972, after concluding a study on the US government's computer security needs, the US standards body NBS (National Bureau of Standards)—now named NIST (National Institute of Standards and Technology)—identified a need for a government-wide standard for encrypting unclassified, sensitive information.It was created by IBM's (International Business Machines)  Accordingly, on 15 May 1973, after consulting with the NSA, NBS solicited proposals for a cipher that would meet rigorous design criteria. None of the submissions, however, turned out to be suitable. A second request was issued on 27 August 1974. This time, IBM submitted a candidate which was deemed acceptable—a cipher developed during the period 1973–1974 based on an earlier algorithm, Horst Feistel's Lucifer cipher. The team at IBM involved in cipher design and analysis included Feistel, Walter Tuchman, Don Coppersmith, Alan Konheim, Carl Meyer, Mike Matyas, Roy Adler, Edna Grossman, Bill Notz, Lynn Smith, and Bryant Tuckerman.\n\nNSA's involvement in the design \n\nOn 17 March 1975, the proposed DES was published in the Federal Register. Public comments were requested, and in the following year two open workshops were held to discuss the proposed standard. There was some criticism from various parties, including from public-key cryptography pioneers Martin Hellman and Whitfield Diffie, citing a shortened key length and the mysterious \"S-boxes\" as evidence of improper interference from the NSA. The suspicion was that the algorithm had been covertly weakened by the intelligence agency so that they—but no-one else—could easily read encrypted messages. Alan Konheim (one of the designers of DES) commented, \"We sent the S-boxes off to Washington. They came back and were all different.\" The United States Senate Select Committee on Intelligence reviewed the NSA's actions to determine whether there had been any improper involvement. In the unclassified summary of their findings, published in 1978, the Committee wrote:\n\nHowever, it also found that\n\nAnother member of the DES team, Walter Tuchman, stated \"We developed the DES algorithm entirely within IBM using IBMers. The NSA did not dictate a single wire!\"\nIn contrast, a declassified NSA book on cryptologic history states:\n\nand\n\nSome of the suspicions about hidden weaknesses in the S-boxes were allayed in 1990, with the independent discovery and open publication by Eli Biham and Adi Shamir of differential cryptanalysis, a general method for breaking block ciphers. The S-boxes of DES were much more resistant to the attack than if they had been chosen at random, strongly suggesting that IBM knew about the technique in the 1970s. This was indeed the case; in 1994, Don Coppersmith published some of the original design criteria for the S-boxes. According to Steven Levy, IBM Watson researchers discovered differential cryptanalytic attacks in 1974 and were asked by the NSA to keep the technique secret.Levy, Crypto, p. 55 Coppersmith explains IBM's secrecy decision by saying, \"that was because [differential cryptanalysis] can be a very powerful tool, used against many schemes, and there was concern that such information in the public domain could adversely affect national security.\" Levy quotes Walter Tuchman: \"[t]hey asked us to stamp all our documents confidential... We actually put a number on each one and locked them up in safes, because they were considered U.S. government classified. They said do it. So I did it\". Bruce Schneier observed that \"It took the academic community two decades to figure out that the NSA 'tweaks' actually improved the security of DES.\"\n\nThe algorithm as a standard \n\nDespite the criticisms, DES was approved as a federal standard in November 1976, and published on 15 January 1977 as FIPS PUB 46, authorized for use on all unclassified data. It was subsequently reaffirmed as the standard in 1983, 1988 (revised as FIPS-46-1), 1993 (FIPS-46-2), and again in 1999 (FIPS-46-3), the latter prescribing \"Triple DES\" (see below). On 26 May 2002, DES was finally superseded by the Advanced Encryption Standard (AES), following a public competition. On 19 May 2005, FIPS 46-3 was officially withdrawn, but NIST has approved Triple DES through the year 2030 for sensitive government information.National Institute of Standards and Technology, [http://csrc.nist.gov/publications/nistpubs/800-67-Rev1/SP-800-67-Rev1.pdf NIST Special Publication 800-67 Recommendation for the Triple Data Encryption Algorithm (TDEA) Block Cipher, Version 1.1]\n\nThe algorithm is also specified in ANSI X3.92 (Now, X3 is now known as INCITS and ANSI X3.92 as ANSI INCITS 92),American National Standards Institute, ANSI X3.92-1981 (Now, known as ANSI INCITS 92-1981)American National Standard, Data Encryption Algorithm NIST SP 800-67 and ISO/IEC 18033-3 (as a component of TDEA).\n\nAnother theoretical attack, linear cryptanalysis, was published in 1994, but it was the Electronic Frontier Foundation's DES cracker in 1998 that demonstrated that DES could be attacked very practically, and highlighted the need for a replacement algorithm. These and other methods of cryptanalysis are discussed in more detail later in this article.\n\nThe introduction of DES is considered to have been a catalyst for the academic study of cryptography, particularly of methods to crack block ciphers. According to a NIST retrospective about DES,\nThe DES can be said to have \"jump-started\" the nonmilitary study and development of encryption algorithms. In the 1970s there were very few cryptographers, except for those in military or intelligence organizations, and little academic study of cryptography. There are now many active academic cryptologists, mathematics departments with strong programs in cryptography, and commercial information security companies and consultants. A generation of cryptanalysts has cut its teeth analyzing (that is, trying to \"crack\") the DES algorithm. In the words of cryptographer Bruce Schneier,Bruce Schneier, Applied Cryptography, Protocols, Algorithms, and Source Code in C, Second edition, John Wiley and Sons, New York (1996) p. 267 \"DES did more to galvanize the field of cryptanalysis than anything else. Now there was an algorithm to study.\" An astonishing share of the open literature in cryptography in the 1970s and 1980s dealt with the DES, and the DES is the standard against which every symmetric key algorithm since has been compared.William E. Burr, \"Data Encryption Standard\", in NIST's anthology \"A Century of Excellence in Measurements, Standards, and Technology: A Chronicle of Selected NBS/NIST Publications, 1901–2000.  [http://nvl.nist.gov/pub/nistpubs/sp958-lide/html/250-253.html HTML] [http://nvl.nist.gov/pub/nistpubs/sp958-lide/250-253.pdf PDF]\n\nChronology \n\nDescription\n\nFile:DES-main-network.png|thumb|250px|Figure 1— The overall Feistel structure of DES\nrect 0 130 639 229 Initial permutation\nrect 220 300 421 405 Feistel function\nrect 220 594 421 701 Feistel function\nrect 220 1037 421 1144 Feistel function\nrect 220 1330 421 1437 Feistel function\nrect 0 1478 639 1577 Final permutation\ncircle 50 351 26 XOR\ncircle 50 647 26 XOR\ncircle 50 1090 26 XOR\ncircle 50 1383 26 XOR\n\nFor brevity, the following description omits the exact transformations and permutations which specify the algorithm; for reference, the details can be found in DES supplementary material.\nDES is the archetypal block cipher—an algorithm that takes a fixed-length string of plaintext bits and transforms it through a series of complicated operations into another ciphertext bitstring of the same length. In the case of DES, the block size is 64 bits. DES also uses a key to customize the transformation, so that decryption can supposedly only be performed by those who know the particular key used to encrypt. The key ostensibly consists of 64 bits; however, only 56 of these are actually used by the algorithm. Eight bits are used solely for checking parity, and are thereafter discarded. Hence the effective key length is 56 bits.\n\nThe key is nominally stored or transmitted as 8 bytes, each with odd parity. According to ANSI X3.92-1981 (Now, known as ANSI INCITS 92-1981), section 3.5:\n\nLike other block ciphers, DES by itself is not a secure means of encryption, but must instead be used in a mode of operation. FIPS-81 specifies several modes for use with DES. Further comments on the usage of DES are contained in FIPS-74.\n\nDecryption uses the same structure as encryption, but with the keys used in reverse order. (This has the advantage that the same hardware or software can be used in both directions.)\n\nOverall structure \n\nThe algorithm's overall structure is shown in Figure 1: there are 16 identical stages of processing, termed rounds. There is also an initial and final permutation, termed IP and FP, which are inverses (IP \"undoes\" the action of FP, and vice versa). IP and FP have no cryptographic significance, but were included in order to facilitate loading blocks in and out of mid-1970s 8-bit based hardware.\n\nBefore the main rounds, the block is divided into two 32-bit halves and processed alternately; this criss-crossing is known as the Feistel scheme. The Feistel structure ensures that decryption and encryption are very similar processes—the only difference is that the subkeys are applied in the reverse order when decrypting. The rest of the algorithm is identical. This greatly simplifies implementation, particularly in hardware, as there is no need for separate encryption and decryption algorithms.\n\nThe ⊕ symbol denotes the \nexclusive-OR (XOR) operation. The F-function scrambles half a block together with some of the key. The output from the F-function is then combined with the other half of the block, and the halves are swapped before the next round. After the final round, the halves are swapped; this is a feature of the Feistel structure which makes encryption and decryption similar processes.\n\nThe Feistel (F) function \n\nThe F-function, depicted in Figure 2, operates on half a block (32 bits) at a time and consists of four stages:\n\nFile:Data_Encription_Standard_Flow_Diagram.svg|thumb|250px|Figure 2—The Feistel function (F-function) of DES\nrect 10 88 322 170 Expansion function\nrect 9 340 77 395 Substitution box 1\nrect 89 340 157 395 Substitution box 2\nrect 169 340 237 395 Substitution box 3\nrect 247 340 315 395 Substitution box 4\nrect 327 340 395 395 Substitution box 5\nrect 405 340 473 395 Substitution box 6\nrect 485 340 553 395 Substitution box 7\nrect 565 340 633 395 Substitution box 8\nrect 9 482 630 565 Permutation\ncircle 319 232 21 XOR\n\n# Expansion: the 32-bit half-block is expanded to 48 bits using the expansion permutation, denoted E in the diagram, by duplicating half of the bits. The output consists of eight 6-bit (8 * 6 = 48 bits) pieces, each containing a copy of 4 corresponding input bits, plus a copy of the immediately adjacent bit from each of the input pieces to either side.\n# Key mixing: the result is combined with a subkey using an XOR operation. Sixteen 48-bit subkeys—one for each round—are derived from the main key using the key schedule (described below).\n# Substitution: after mixing in the subkey, the block is divided into eight 6-bit pieces before processing by the S-boxes, or substitution boxes. Each of the eight S-boxes replaces its six input bits with four output bits according to a non-linear transformation, provided in the form of a lookup table. The S-boxes provide the core of the security of DES—without them, the cipher would be linear, and trivially breakable.\n# Permutation: finally, the 32 outputs from the S-boxes are rearranged according to a fixed permutation, the P-box. This is designed so that, after permutation, the bits from the output of each S-box in this round are spread across four different S-boxes in the next round.\n\nThe alternation of substitution from the S-boxes, and permutation of bits from the P-box and E-expansion provides so-called \"confusion and diffusion\" respectively, a concept identified by Claude Shannon in the 1940s as a necessary condition for a secure yet practical cipher.\n\nKey schedule \n\nFile:DES-key-schedule.png|thumb|250px|Figure 3— The key-schedule of DES\nrect 96 28 298 58 Permuted choice 1\nrect 127 122 268 155 Permuted choice 2\nrect 127 216 268 249 Permuted choice 2\nrect 127 357 268 390 Permuted choice 2\nrect 127 451 268 484 Permuted choice 2\nrect 96 91 127 116 Left shift by 1\nrect 268 91 299 116 Left shift by 1\nrect 96 185 127 210 Left shift by 1\nrect 268 185 299 210 Left shift by 1\nrect 96 326 127 351 Left shift by 2\nrect 268 326 299 351 Left shift by 2\nrect 96 419 127 444 Left shift by 1\nrect 268 419 299 444 Left shift by 1\n\nFigure 3 illustrates the key schedule for encryption—the algorithm which generates the subkeys. Initially, 56 bits of the key are selected from the initial 64 by Permuted Choice 1 (PC-1)—the remaining eight bits are either discarded or used as parity check bits. The 56 bits are then divided into two 28-bit halves; each half is thereafter treated separately. In successive rounds, both halves are rotated left by one or two bits (specified for each round), and then 48 subkey bits are selected by Permuted Choice 2 (PC-2)—24 bits from the left half, and 24 from the right. The rotations (denoted by \"Stallings, W. Cryptography and network security: principles and practice. Prentice Hall, 2006. p. 73\n\nIn academia, various proposals for a DES-cracking machine were advanced. In 1977, Diffie and Hellman proposed a machine costing an estimated US$20 million which could find a DES key in a single dayhttp://hamburgsteak.sandwich.net/writ/bruting_des.html. By 1993, Wiener had proposed a key-search machine costing US$1 million which would find a key within 7 hours. However, none of these early proposals were ever implemented—or, at least, no implementations were publicly acknowledged. The vulnerability of DES was practically demonstrated in the late 1990s. In 1997, RSA Security sponsored a series of contests, offering a $10,000 prize to the first team that broke a message encrypted with DES for the contest. That contest was won by the DESCHALL Project, led by Rocke Verser, Matt Curtin, and Justin Dolske, using idle cycles of thousands of computers across the Internet. The feasibility of cracking DES quickly was demonstrated in 1998 when a custom DES-cracker was built by the Electronic Frontier Foundation (EFF), a cyberspace civil rights group, at the cost of approximately US$250,000 (see EFF DES cracker). Their motivation was to show that DES was breakable in practice as well as in theory: \"There are many people who will not believe a truth until they can see it with their own eyes. Showing them a physical machine that can crack DES in a few days is the only way to convince some people that they really cannot trust their security to DES.\" The machine brute-forced a key in a little more than 2 days' worth of searching.\n\nThe next confirmed DES cracker was the COPACOBANA machine built in 2006 by teams of the Universities of Bochum and Kiel, both in Germany. Unlike the EFF machine, COPACOBANA consists of commercially available, reconfigurable integrated circuits. 120 of these field-programmable gate arrays (FPGAs) of type XILINX Spartan-3 1000 run in parallel. They are grouped in 20 DIMM modules, each containing 6 FPGAs. The use of reconfigurable hardware makes the machine applicable to other code breaking tasks as well.  One of the more interesting aspects of COPACOBANA is its cost factor. One machine can be built for approximately $10,000. The cost decrease by roughly a factor of 25 over the EFF machine is an example of the continuous improvement of digital hardware—see Moore's law. Adjusting for inflation over 8 years yields an even higher improvement of about 30x. Since 2007, SciEngines GmbH, a spin-off company of the two project partners of COPACOBANA has enhanced and developed successors of COPACOBANA. In 2008 their COPACOBANA RIVYERA reduced the time to break DES to less than one day, using 128 Spartan-3 5000's. SciEngines RIVYERA held the record in brute-force breaking DES, having utilized 128 Spartan-3 5000 FPGAs.[http://www.sciengines.com/company/news-a-events/74-des-in-1-day.html Break DES in less than a single day] [Press release of Firm, demonstrated on 2009 Workshop] Their 256 Spartan-6 LX150 model has further lowered this time.\n\nIn 2012, David Hutton and Moxie Marlinspike announced a system with 48 Xilinx Virtex-6 LX240T FPGAs, each FPGA containing 40 fully pipelined DES cores running at 400MHz, for a total capacity of  768 gigakeys/sec. The system can exhaustively search the entire 56-bit DES key space in about 26 hours and this service is offered for a fee online.[http://crack.sh The World's fastest DES cracker]Think Complex Passwords Will Save You?, David Hulton, Ian Foster, BSidesLV 2017\n\nAttacks faster than brute force \n\nThere are three attacks known that can break the full 16 rounds of DES with less complexity than a brute-force search: differential cryptanalysis (DC), linear cryptanalysis (LC), and Davies' attack. However, the attacks are theoretical and are unfeasible to mount in practice; these types of attack are sometimes termed certificational weaknesses.\n\n* Differential cryptanalysis was rediscovered in the late 1980s by Eli Biham and Adi Shamir; it was known earlier to both IBM and the NSA and kept secret. To break the full 16 rounds, differential cryptanalysis requires 247 chosen plaintexts.Biham, E. and Shamir, A. Differential Cryptanalysis of the Data Encryption Standard - Advances in Cryptology - CRYPTO '92, 12th Annual International Cryptology Conference, Santa Barbara, California, USA, August 16–20, 1992, Proceedings. 1992. pp. 487–496. DES was designed to be resistant to DC.\n* Linear cryptanalysis was discovered by Mitsuru Matsui, and needs 243 known plaintexts (Matsui, 1993); the method was implemented (Matsui, 1994), and was the first experimental cryptanalysis of DES to be reported. There is no evidence that DES was tailored to be resistant to this type of attack. A generalization of LC—multiple linear cryptanalysis—was suggested in 1994 (Kaliski and Robshaw), and was further refined by Biryukov and others. (2004); their analysis suggests that multiple linear approximations could be used to reduce the data requirements of the attack by at least a factor of 4 (that is, 241 instead of 243). A similar reduction in data complexity can be obtained in a chosen-plaintext variant of linear cryptanalysis (Knudsen and Mathiassen, 2000). Junod (2001) performed several experiments to determine the actual time complexity of linear cryptanalysis, and reported that it was somewhat faster than predicted, requiring time equivalent to 239–241 DES evaluations.\n* Improved Davies' attack: while linear and differential cryptanalysis are general techniques and can be applied to a number of schemes, Davies' attack is a specialized technique for DES, first suggested by Donald Davies in the eighties, and improved by Biham and Biryukov (1997). The most powerful form of the attack requires 250 known plaintexts, has a computational complexity of 250, and has a 51% success rate.\n\nThere have also been attacks proposed against reduced-round versions of the cipher, that is, versions of DES with fewer than 16 rounds. Such analysis gives an insight into how many rounds are needed for safety, and how much of a \"security margin\" the full version retains. Differential-linear cryptanalysis was proposed by Langford and Hellman in 1994, and combines differential and linear cryptanalysis into a single attack. An enhanced version of the attack can break 9-round DES with 215.8 chosen plaintexts and has a 229.2 time complexity (Biham and others, 2002).\n\nMinor cryptanalytic properties \n\nDES exhibits the complementation property, namely that\nE_K(P)C \\Leftrightarrow E_{\\overline{K}}(\\overline{P})\n\\overline{C}\nwhere \\overline{x} is the bitwise complement of x. E_K denotes encryption with key K. P and C denote plaintext and ciphertext blocks respectively. The complementation property means that the work for a brute-force attack could be reduced by a factor of 2 (or a single bit) under a chosen-plaintext assumption. By definition, this property also applies to TDES cipher.\n\nDES also has four so-called weak keys. Encryption (E) and decryption (D) under a weak key have the same effect (see involution):\nE_K(E_K(P)) P or equivalently, E_K \n D_K.\nThere are also six pairs of semi-weak keys. Encryption with one of the pair of semiweak keys, K_1, operates identically to decryption with the other, K_2:\nE_{K_1}(E_{K_2}(P)) P or equivalently, E_{K_2} \n D_{K_1}.\nIt is easy enough to avoid the weak and semiweak keys in an implementation, either by testing for them explicitly, or simply by choosing keys randomly; the odds of picking a weak or semiweak key by chance are negligible. The keys are not really any weaker than any other keys anyway, as they do not give an attack any advantage.\n\nDES has also been proved not to be a group, or more precisely, the set \\{E_K\\} (for all possible keys K) under functional composition is not a group, nor \"close\" to being a group.[http://dl.acm.org/citation.cfm?id=705523 Campbell and Wiener, 1992] This was an open question for some time, and if it had been the case, it would have been possible to break DES, and multiple encryption modes such as Triple DES would not increase the security, because encryption under one key would be equivalent to decryption under another key.\n\nSimplified DES \n\nSimplified DES (SDES) was designed for educational purposes only, to help students learn about modern cryptanalytic techniques.\nSDES has similar properties and structure as DES, but has been simplified to make it much easier to perform encryption and decryption by hand with pencil and paper.\nSome people feel that learning SDES gives insight into DES and other block ciphers, and insight into various cryptanalytic attacks against them.\nSanjay Kumar; Sandeep Srivastava.\n[http://research.ijcaonline.org/volume104/number2/pxc3899070.pdf \"Image Encryption using Simplified Data Encryption Standard (S-DES)\"].\n2014.\n\nAlasdair McAndrew.\n[https://books.google.com/books?id=9lTRBQAAQBAJ \"Introduction to Cryptography with Open-Source Software\"].\n2012.\nSection \"8.8 Simplified DES: sDES\".\np. 183 to 190.\n\nWilliam Stallings.\n[http://mercury.webster.edu/aleshunas/COSC%205130/G-SDES.pdf \"Appendix G: Simplified DES\"].\n2010.\n\nNalini N; G Raghavendra Rao.\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi10.1.1.521.9332&rep\nrep1&type=pdf \"Cryptanalysis of Simplified Data Encryption Standard via Optimisation Heuristics\"].\n2006.\n\nMinh Van Nguyen.\n[http://doc.sagemath.org/html/en/reference/cryptography/sage/crypto/block_cipher/sdes.html \"Simplified DES\"].\n2009.\n\nDr. Manoj Kumar.\n[https://books.google.com/books?id=jdo6eUKdrVkC \"Cryptography and Network Security\"].\nSection 3.4: The Simplified Version of DES (S-DES).\np. 96.\n\nEdward F. Schaefer.\n\"A Simplified Data Encryption Standard Algorithm\".\n\n1996.\n\nLavkush Sharma; Bhupendra Kumar Pathak; and Nidhi Sharma.\n[http://ijcsi.org/papers/IJCSI-9-3-1-307-313.pdf \"Breaking of Simplified Data Encryption Standard Using Binary Particle Swarm Optimization\"].\n2012.\n\n[https://web.archive.org/web/20110829213229/http://www.scu.edu/cas/research/cryptography.cfm \"Cryptography Research: Devising a Better Way to Teach and Learn the Advanced Encryption Standard\"].\n\nReplacement algorithms \n\nConcerns about security and the relatively slow operation of DES in software motivated researchers to propose a variety of alternative block cipher designs, which started to appear in the late 1980s and early 1990s: examples include RC5, Blowfish, IDEA, NewDES, SAFER, CAST5 and FEAL. Most of these designs kept the 64-bit block size of DES, and could act as a \"drop-in\" replacement, although they typically used a 64-bit or 128-bit key. In the Soviet Union the GOST 28147-89 algorithm was introduced, with a 64-bit block size and a 256-bit key, which was also used in Russia later.\n\nDES itself can be adapted and reused in a more secure scheme. Many former DES users now use Triple DES (TDES) which was described and analysed by one of DES's patentees (see FIPS Pub 46-3); it involves applying DES three times with two (2TDES) or three (3TDES) different keys. TDES is regarded as adequately secure, although it is quite slow. A less computationally expensive alternative is DES-X, which increases the key size by XORing extra key material before and after DES. GDES was a DES variant proposed as a way to speed up encryption, but it was shown to be susceptible to differential cryptanalysis.\n\nOn January 2, 1997, NIST announced that they wished to choose a successor to DES.http://csrc.nist.gov/archive/aes/pre-round1/aes_9701.txt In 2001, after an international competition, NIST selected a new cipher, the Advanced Encryption Standard (AES), as a replacement.http://csrc.nist.gov/publications/fips/fips197/fips-197.pdf November 26, 2001. The algorithm which was selected as the AES was submitted by its designers under the name Rijndael. Other finalists in the NIST AES competition included RC6, Serpent, MARS, and Twofish.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Data Encryption Standard" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7978" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Data Encryption Standard (DES,) is a symmetric-key algorithm for the encryption of electronic data. Although now considered insecure, it was highly influential in the advancement of modern cryptography.\n\nDeveloped in the early 1970s at IBM and based on an earlier design by Horst Feistel, the algorithm was submitted to the National Bureau of Standards (NBS) following the agency's invitation to propose a candidate for the protection of sensitive, unclassified electronic government data. In 1976, after consultation with the National Security Agency (NSA), the NBS eventually selected a slightly modified version (strengthened against differential cryptanalysis, but weakened against brute-force attacks), which was published as an official Federal Information Processing Standard (FIPS) for the United States in 1977.\n\nThe publication of an NSA-approved encryption standard simultaneously resulted in its quick international adoption and widespread academic scrutiny. Controversies arose out of classified design elements, a relatively short key length of the symmetric-key block cipher design, and the involvement of the NSA, nourishing suspicions about a backdoor. The intense academic scrutiny the algorithm received over time led to the modern understanding of block ciphers and their cryptanalysis.\n\nDES is now considered to be insecure for many applications. This is mainly due to the 56-bit key size being too small. In January 1999, distributed.net and the Electronic Frontier Foundation collaborated to publicly break a DES key in 22 hours and 15 minutes (see chronology). There are also some analytical results which demonstrate theoretical weaknesses in the cipher, although they are infeasible to mount in practice. The algorithm is believed to be practically secure in the form of Triple DES, although there are theoretical attacks. This cipher has been superseded by the Advanced Encryption Standard (AES). Furthermore, DES has been withdrawn as a standard by the National Institute of Standards and Technology.\n\nSome documentation makes a distinction between DES as a standard and as an algorithm, referring to the algorithm as the DEA (Data Encryption Algorithm).\n\nHistory of DES \n\nThe origins of DES go back to the early 1970s. In 1972, after concluding a study on the US government's computer security needs, the US standards body NBS (National Bureau of Standards)—now named NIST (National Institute of Standards and Technology)—identified a need for a government-wide standard for encrypting unclassified, sensitive information.It was created by IBM's (International Business Machines)  Accordingly, on 15 May 1973, after consulting with the NSA, NBS solicited proposals for a cipher that would meet rigorous design criteria. None of the submissions, however, turned out to be suitable. A second request was issued on 27 August 1974. This time, IBM submitted a candidate which was deemed acceptable—a cipher developed during the period 1973–1974 based on an earlier algorithm, Horst Feistel's Lucifer cipher. The team at IBM involved in cipher design and analysis included Feistel, Walter Tuchman, Don Coppersmith, Alan Konheim, Carl Meyer, Mike Matyas, Roy Adler, Edna Grossman, Bill Notz, Lynn Smith, and Bryant Tuckerman.\n\nNSA's involvement in the design \n\nOn 17 March 1975, the proposed DES was published in the Federal Register. Public comments were requested, and in the following year two open workshops were held to discuss the proposed standard. There was some criticism from various parties, including from public-key cryptography pioneers Martin Hellman and Whitfield Diffie, citing a shortened key length and the mysterious \"S-boxes\" as evidence of improper interference from the NSA. The suspicion was that the algorithm had been covertly weakened by the intelligence agency so that they—but no-one else—could easily read encrypted messages. Alan Konheim (one of the designers of DES) commented, \"We sent the S-boxes off to Washington. They came back and were all different.\" The United States Senate Select Committee on Intelligence reviewed the NSA's actions to determine whether there had been any improper involvement. In the unclassified summary of their findings, published in 1978, the Committee wrote:\n\nHowever, it also found that\n\nAnother member of the DES team, Walter Tuchman, stated \"We developed the DES algorithm entirely within IBM using IBMers. The NSA did not dictate a single wire!\"\nIn contrast, a declassified NSA book on cryptologic history states:\n\nand\n\nSome of the suspicions about hidden weaknesses in the S-boxes were allayed in 1990, with the independent discovery and open publication by Eli Biham and Adi Shamir of differential cryptanalysis, a general method for breaking block ciphers. The S-boxes of DES were much more resistant to the attack than if they had been chosen at random, strongly suggesting that IBM knew about the technique in the 1970s. This was indeed the case; in 1994, Don Coppersmith published some of the original design criteria for the S-boxes. According to Steven Levy, IBM Watson researchers discovered differential cryptanalytic attacks in 1974 and were asked by the NSA to keep the technique secret.Levy, Crypto, p. 55 Coppersmith explains IBM's secrecy decision by saying, \"that was because [differential cryptanalysis] can be a very powerful tool, used against many schemes, and there was concern that such information in the public domain could adversely affect national security.\" Levy quotes Walter Tuchman: \"[t]hey asked us to stamp all our documents confidential... We actually put a number on each one and locked them up in safes, because they were considered U.S. government classified. They said do it. So I did it\". Bruce Schneier observed that \"It took the academic community two decades to figure out that the NSA 'tweaks' actually improved the security of DES.\"\n\nThe algorithm as a standard \n\nDespite the criticisms, DES was approved as a federal standard in November 1976, and published on 15 January 1977 as FIPS PUB 46, authorized for use on all unclassified data. It was subsequently reaffirmed as the standard in 1983, 1988 (revised as FIPS-46-1), 1993 (FIPS-46-2), and again in 1999 (FIPS-46-3), the latter prescribing \"Triple DES\" (see below). On 26 May 2002, DES was finally superseded by the Advanced Encryption Standard (AES), following a public competition. On 19 May 2005, FIPS 46-3 was officially withdrawn, but NIST has approved Triple DES through the year 2030 for sensitive government information.National Institute of Standards and Technology, [http://csrc.nist.gov/publications/nistpubs/800-67-Rev1/SP-800-67-Rev1.pdf NIST Special Publication 800-67 Recommendation for the Triple Data Encryption Algorithm (TDEA) Block Cipher, Version 1.1]\n\nThe algorithm is also specified in ANSI X3.92 (Now, X3 is now known as INCITS and ANSI X3.92 as ANSI INCITS 92),American National Standards Institute, ANSI X3.92-1981 (Now, known as ANSI INCITS 92-1981)American National Standard, Data Encryption Algorithm NIST SP 800-67 and ISO/IEC 18033-3 (as a component of TDEA).\n\nAnother theoretical attack, linear cryptanalysis, was published in 1994, but it was the Electronic Frontier Foundation's DES cracker in 1998 that demonstrated that DES could be attacked very practically, and highlighted the need for a replacement algorithm. These and other methods of cryptanalysis are discussed in more detail later in this article.\n\nThe introduction of DES is considered to have been a catalyst for the academic study of cryptography, particularly of methods to crack block ciphers. According to a NIST retrospective about DES,\nThe DES can be said to have \"jump-started\" the nonmilitary study and development of encryption algorithms. In the 1970s there were very few cryptographers, except for those in military or intelligence organizations, and little academic study of cryptography. There are now many active academic cryptologists, mathematics departments with strong programs in cryptography, and commercial information security companies and consultants. A generation of cryptanalysts has cut its teeth analyzing (that is, trying to \"crack\") the DES algorithm. In the words of cryptographer Bruce Schneier,Bruce Schneier, Applied Cryptography, Protocols, Algorithms, and Source Code in C, Second edition, John Wiley and Sons, New York (1996) p. 267 \"DES did more to galvanize the field of cryptanalysis than anything else. Now there was an algorithm to study.\" An astonishing share of the open literature in cryptography in the 1970s and 1980s dealt with the DES, and the DES is the standard against which every symmetric key algorithm since has been compared.William E. Burr, \"Data Encryption Standard\", in NIST's anthology \"A Century of Excellence in Measurements, Standards, and Technology: A Chronicle of Selected NBS/NIST Publications, 1901–2000.  [http://nvl.nist.gov/pub/nistpubs/sp958-lide/html/250-253.html HTML] [http://nvl.nist.gov/pub/nistpubs/sp958-lide/250-253.pdf PDF]\n\nChronology \n\nDescription\n\nFile:DES-main-network.png|thumb|250px|Figure 1— The overall Feistel structure of DES\nrect 0 130 639 229 Initial permutation\nrect 220 300 421 405 Feistel function\nrect 220 594 421 701 Feistel function\nrect 220 1037 421 1144 Feistel function\nrect 220 1330 421 1437 Feistel function\nrect 0 1478 639 1577 Final permutation\ncircle 50 351 26 XOR\ncircle 50 647 26 XOR\ncircle 50 1090 26 XOR\ncircle 50 1383 26 XOR\n\nFor brevity, the following description omits the exact transformations and permutations which specify the algorithm; for reference, the details can be found in DES supplementary material.\nDES is the archetypal block cipher—an algorithm that takes a fixed-length string of plaintext bits and transforms it through a series of complicated operations into another ciphertext bitstring of the same length. In the case of DES, the block size is 64 bits. DES also uses a key to customize the transformation, so that decryption can supposedly only be performed by those who know the particular key used to encrypt. The key ostensibly consists of 64 bits; however, only 56 of these are actually used by the algorithm. Eight bits are used solely for checking parity, and are thereafter discarded. Hence the effective key length is 56 bits.\n\nThe key is nominally stored or transmitted as 8 bytes, each with odd parity. According to ANSI X3.92-1981 (Now, known as ANSI INCITS 92-1981), section 3.5:\n\nLike other block ciphers, DES by itself is not a secure means of encryption, but must instead be used in a mode of operation. FIPS-81 specifies several modes for use with DES. Further comments on the usage of DES are contained in FIPS-74.\n\nDecryption uses the same structure as encryption, but with the keys used in reverse order. (This has the advantage that the same hardware or software can be used in both directions.)\n\nOverall structure \n\nThe algorithm's overall structure is shown in Figure 1: there are 16 identical stages of processing, termed rounds. There is also an initial and final permutation, termed IP and FP, which are inverses (IP \"undoes\" the action of FP, and vice versa). IP and FP have no cryptographic significance, but were included in order to facilitate loading blocks in and out of mid-1970s 8-bit based hardware.\n\nBefore the main rounds, the block is divided into two 32-bit halves and processed alternately; this criss-crossing is known as the Feistel scheme. The Feistel structure ensures that decryption and encryption are very similar processes—the only difference is that the subkeys are applied in the reverse order when decrypting. The rest of the algorithm is identical. This greatly simplifies implementation, particularly in hardware, as there is no need for separate encryption and decryption algorithms.\n\nThe ⊕ symbol denotes the \nexclusive-OR (XOR) operation. The F-function scrambles half a block together with some of the key. The output from the F-function is then combined with the other half of the block, and the halves are swapped before the next round. After the final round, the halves are swapped; this is a feature of the Feistel structure which makes encryption and decryption similar processes.\n\nThe Feistel (F) function \n\nThe F-function, depicted in Figure 2, operates on half a block (32 bits) at a time and consists of four stages:\n\nFile:Data_Encription_Standard_Flow_Diagram.svg|thumb|250px|Figure 2—The Feistel function (F-function) of DES\nrect 10 88 322 170 Expansion function\nrect 9 340 77 395 Substitution box 1\nrect 89 340 157 395 Substitution box 2\nrect 169 340 237 395 Substitution box 3\nrect 247 340 315 395 Substitution box 4\nrect 327 340 395 395 Substitution box 5\nrect 405 340 473 395 Substitution box 6\nrect 485 340 553 395 Substitution box 7\nrect 565 340 633 395 Substitution box 8\nrect 9 482 630 565 Permutation\ncircle 319 232 21 XOR\n\n# Expansion: the 32-bit half-block is expanded to 48 bits using the expansion permutation, denoted E in the diagram, by duplicating half of the bits. The output consists of eight 6-bit (8 * 6 = 48 bits) pieces, each containing a copy of 4 corresponding input bits, plus a copy of the immediately adjacent bit from each of the input pieces to either side.\n# Key mixing: the result is combined with a subkey using an XOR operation. Sixteen 48-bit subkeys—one for each round—are derived from the main key using the key schedule (described below).\n# Substitution: after mixing in the subkey, the block is divided into eight 6-bit pieces before processing by the S-boxes, or substitution boxes. Each of the eight S-boxes replaces its six input bits with four output bits according to a non-linear transformation, provided in the form of a lookup table. The S-boxes provide the core of the security of DES—without them, the cipher would be linear, and trivially breakable.\n# Permutation: finally, the 32 outputs from the S-boxes are rearranged according to a fixed permutation, the P-box. This is designed so that, after permutation, the bits from the output of each S-box in this round are spread across four different S-boxes in the next round.\n\nThe alternation of substitution from the S-boxes, and permutation of bits from the P-box and E-expansion provides so-called \"confusion and diffusion\" respectively, a concept identified by Claude Shannon in the 1940s as a necessary condition for a secure yet practical cipher.\n\nKey schedule \n\nFile:DES-key-schedule.png|thumb|250px|Figure 3— The key-schedule of DES\nrect 96 28 298 58 Permuted choice 1\nrect 127 122 268 155 Permuted choice 2\nrect 127 216 268 249 Permuted choice 2\nrect 127 357 268 390 Permuted choice 2\nrect 127 451 268 484 Permuted choice 2\nrect 96 91 127 116 Left shift by 1\nrect 268 91 299 116 Left shift by 1\nrect 96 185 127 210 Left shift by 1\nrect 268 185 299 210 Left shift by 1\nrect 96 326 127 351 Left shift by 2\nrect 268 326 299 351 Left shift by 2\nrect 96 419 127 444 Left shift by 1\nrect 268 419 299 444 Left shift by 1\n\nFigure 3 illustrates the key schedule for encryption—the algorithm which generates the subkeys. Initially, 56 bits of the key are selected from the initial 64 by Permuted Choice 1 (PC-1)—the remaining eight bits are either discarded or used as parity check bits. The 56 bits are then divided into two 28-bit halves; each half is thereafter treated separately. In successive rounds, both halves are rotated left by one or two bits (specified for each round), and then 48 subkey bits are selected by Permuted Choice 2 (PC-2)—24 bits from the left half, and 24 from the right. The rotations (denoted by \"Stallings, W. Cryptography and network security: principles and practice. Prentice Hall, 2006. p. 73\n\nIn academia, various proposals for a DES-cracking machine were advanced. In 1977, Diffie and Hellman proposed a machine costing an estimated US$20 million which could find a DES key in a single dayhttp://hamburgsteak.sandwich.net/writ/bruting_des.html. By 1993, Wiener had proposed a key-search machine costing US$1 million which would find a key within 7 hours. However, none of these early proposals were ever implemented—or, at least, no implementations were publicly acknowledged. The vulnerability of DES was practically demonstrated in the late 1990s. In 1997, RSA Security sponsored a series of contests, offering a $10,000 prize to the first team that broke a message encrypted with DES for the contest. That contest was won by the DESCHALL Project, led by Rocke Verser, Matt Curtin, and Justin Dolske, using idle cycles of thousands of computers across the Internet. The feasibility of cracking DES quickly was demonstrated in 1998 when a custom DES-cracker was built by the Electronic Frontier Foundation (EFF), a cyberspace civil rights group, at the cost of approximately US$250,000 (see EFF DES cracker). Their motivation was to show that DES was breakable in practice as well as in theory: \"There are many people who will not believe a truth until they can see it with their own eyes. Showing them a physical machine that can crack DES in a few days is the only way to convince some people that they really cannot trust their security to DES.\" The machine brute-forced a key in a little more than 2 days' worth of searching.\n\nThe next confirmed DES cracker was the COPACOBANA machine built in 2006 by teams of the Universities of Bochum and Kiel, both in Germany. Unlike the EFF machine, COPACOBANA consists of commercially available, reconfigurable integrated circuits. 120 of these field-programmable gate arrays (FPGAs) of type XILINX Spartan-3 1000 run in parallel. They are grouped in 20 DIMM modules, each containing 6 FPGAs. The use of reconfigurable hardware makes the machine applicable to other code breaking tasks as well.  One of the more interesting aspects of COPACOBANA is its cost factor. One machine can be built for approximately $10,000. The cost decrease by roughly a factor of 25 over the EFF machine is an example of the continuous improvement of digital hardware—see Moore's law. Adjusting for inflation over 8 years yields an even higher improvement of about 30x. Since 2007, SciEngines GmbH, a spin-off company of the two project partners of COPACOBANA has enhanced and developed successors of COPACOBANA. In 2008 their COPACOBANA RIVYERA reduced the time to break DES to less than one day, using 128 Spartan-3 5000's. SciEngines RIVYERA held the record in brute-force breaking DES, having utilized 128 Spartan-3 5000 FPGAs.[http://www.sciengines.com/company/news-a-events/74-des-in-1-day.html Break DES in less than a single day] [Press release of Firm, demonstrated on 2009 Workshop] Their 256 Spartan-6 LX150 model has further lowered this time.\n\nIn 2012, David Hutton and Moxie Marlinspike announced a system with 48 Xilinx Virtex-6 LX240T FPGAs, each FPGA containing 40 fully pipelined DES cores running at 400MHz, for a total capacity of  768 gigakeys/sec. The system can exhaustively search the entire 56-bit DES key space in about 26 hours and this service is offered for a fee online.[http://crack.sh The World's fastest DES cracker]Think Complex Passwords Will Save You?, David Hulton, Ian Foster, BSidesLV 2017\n\nAttacks faster than brute force \n\nThere are three attacks known that can break the full 16 rounds of DES with less complexity than a brute-force search: differential cryptanalysis (DC), linear cryptanalysis (LC), and Davies' attack. However, the attacks are theoretical and are unfeasible to mount in practice; these types of attack are sometimes termed certificational weaknesses.\n\n* Differential cryptanalysis was rediscovered in the late 1980s by Eli Biham and Adi Shamir; it was known earlier to both IBM and the NSA and kept secret. To break the full 16 rounds, differential cryptanalysis requires 247 chosen plaintexts.Biham, E. and Shamir, A. Differential Cryptanalysis of the Data Encryption Standard - Advances in Cryptology - CRYPTO '92, 12th Annual International Cryptology Conference, Santa Barbara, California, USA, August 16–20, 1992, Proceedings. 1992. pp. 487–496. DES was designed to be resistant to DC.\n* Linear cryptanalysis was discovered by Mitsuru Matsui, and needs 243 known plaintexts (Matsui, 1993); the method was implemented (Matsui, 1994), and was the first experimental cryptanalysis of DES to be reported. There is no evidence that DES was tailored to be resistant to this type of attack. A generalization of LC—multiple linear cryptanalysis—was suggested in 1994 (Kaliski and Robshaw), and was further refined by Biryukov and others. (2004); their analysis suggests that multiple linear approximations could be used to reduce the data requirements of the attack by at least a factor of 4 (that is, 241 instead of 243). A similar reduction in data complexity can be obtained in a chosen-plaintext variant of linear cryptanalysis (Knudsen and Mathiassen, 2000). Junod (2001) performed several experiments to determine the actual time complexity of linear cryptanalysis, and reported that it was somewhat faster than predicted, requiring time equivalent to 239–241 DES evaluations.\n* Improved Davies' attack: while linear and differential cryptanalysis are general techniques and can be applied to a number of schemes, Davies' attack is a specialized technique for DES, first suggested by Donald Davies in the eighties, and improved by Biham and Biryukov (1997). The most powerful form of the attack requires 250 known plaintexts, has a computational complexity of 250, and has a 51% success rate.\n\nThere have also been attacks proposed against reduced-round versions of the cipher, that is, versions of DES with fewer than 16 rounds. Such analysis gives an insight into how many rounds are needed for safety, and how much of a \"security margin\" the full version retains. Differential-linear cryptanalysis was proposed by Langford and Hellman in 1994, and combines differential and linear cryptanalysis into a single attack. An enhanced version of the attack can break 9-round DES with 215.8 chosen plaintexts and has a 229.2 time complexity (Biham and others, 2002).\n\nMinor cryptanalytic properties \n\nDES exhibits the complementation property, namely that\nE_K(P)C \\Leftrightarrow E_{\\overline{K}}(\\overline{P})\n\\overline{C}\nwhere \\overline{x} is the bitwise complement of x. E_K denotes encryption with key K. P and C denote plaintext and ciphertext blocks respectively. The complementation property means that the work for a brute-force attack could be reduced by a factor of 2 (or a single bit) under a chosen-plaintext assumption. By definition, this property also applies to TDES cipher.\n\nDES also has four so-called weak keys. Encryption (E) and decryption (D) under a weak key have the same effect (see involution):\nE_K(E_K(P)) P or equivalently, E_K \n D_K.\nThere are also six pairs of semi-weak keys. Encryption with one of the pair of semiweak keys, K_1, operates identically to decryption with the other, K_2:\nE_{K_1}(E_{K_2}(P)) P or equivalently, E_{K_2} \n D_{K_1}.\nIt is easy enough to avoid the weak and semiweak keys in an implementation, either by testing for them explicitly, or simply by choosing keys randomly; the odds of picking a weak or semiweak key by chance are negligible. The keys are not really any weaker than any other keys anyway, as they do not give an attack any advantage.\n\nDES has also been proved not to be a group, or more precisely, the set \\{E_K\\} (for all possible keys K) under functional composition is not a group, nor \"close\" to being a group.[http://dl.acm.org/citation.cfm?id=705523 Campbell and Wiener, 1992] This was an open question for some time, and if it had been the case, it would have been possible to break DES, and multiple encryption modes such as Triple DES would not increase the security, because encryption under one key would be equivalent to decryption under another key.\n\nSimplified DES \n\nSimplified DES (SDES) was designed for educational purposes only, to help students learn about modern cryptanalytic techniques.\nSDES has similar properties and structure as DES, but has been simplified to make it much easier to perform encryption and decryption by hand with pencil and paper.\nSome people feel that learning SDES gives insight into DES and other block ciphers, and insight into various cryptanalytic attacks against them.\nSanjay Kumar; Sandeep Srivastava.\n[http://research.ijcaonline.org/volume104/number2/pxc3899070.pdf \"Image Encryption using Simplified Data Encryption Standard (S-DES)\"].\n2014.\n\nAlasdair McAndrew.\n[https://books.google.com/books?id=9lTRBQAAQBAJ \"Introduction to Cryptography with Open-Source Software\"].\n2012.\nSection \"8.8 Simplified DES: sDES\".\np. 183 to 190.\n\nWilliam Stallings.\n[http://mercury.webster.edu/aleshunas/COSC%205130/G-SDES.pdf \"Appendix G: Simplified DES\"].\n2010.\n\nNalini N; G Raghavendra Rao.\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi10.1.1.521.9332&rep\nrep1&type=pdf \"Cryptanalysis of Simplified Data Encryption Standard via Optimisation Heuristics\"].\n2006.\n\nMinh Van Nguyen.\n[http://doc.sagemath.org/html/en/reference/cryptography/sage/crypto/block_cipher/sdes.html \"Simplified DES\"].\n2009.\n\nDr. Manoj Kumar.\n[https://books.google.com/books?id=jdo6eUKdrVkC \"Cryptography and Network Security\"].\nSection 3.4: The Simplified Version of DES (S-DES).\np. 96.\n\nEdward F. Schaefer.\n\"A Simplified Data Encryption Standard Algorithm\".\n\n1996.\n\nLavkush Sharma; Bhupendra Kumar Pathak; and Nidhi Sharma.\n[http://ijcsi.org/papers/IJCSI-9-3-1-307-313.pdf \"Breaking of Simplified Data Encryption Standard Using Binary Particle Swarm Optimization\"].\n2012.\n\n[https://web.archive.org/web/20110829213229/http://www.scu.edu/cas/research/cryptography.cfm \"Cryptography Research: Devising a Better Way to Teach and Learn the Advanced Encryption Standard\"].\n\nReplacement algorithms \n\nConcerns about security and the relatively slow operation of DES in software motivated researchers to propose a variety of alternative block cipher designs, which started to appear in the late 1980s and early 1990s: examples include RC5, Blowfish, IDEA, NewDES, SAFER, CAST5 and FEAL. Most of these designs kept the 64-bit block size of DES, and could act as a \"drop-in\" replacement, although they typically used a 64-bit or 128-bit key. In the Soviet Union the GOST 28147-89 algorithm was introduced, with a 64-bit block size and a 256-bit key, which was also used in Russia later.\n\nDES itself can be adapted and reused in a more secure scheme. Many former DES users now use Triple DES (TDES) which was described and analysed by one of DES's patentees (see FIPS Pub 46-3); it involves applying DES three times with two (2TDES) or three (3TDES) different keys. TDES is regarded as adequately secure, although it is quite slow. A less computationally expensive alternative is DES-X, which increases the key size by XORing extra key material before and after DES. GDES was a DES variant proposed as a way to speed up encryption, but it was shown to be susceptible to differential cryptanalysis.\n\nOn January 2, 1997, NIST announced that they wished to choose a successor to DES.http://csrc.nist.gov/archive/aes/pre-round1/aes_9701.txt In 2001, after an international competition, NIST selected a new cipher, the Advanced Encryption Standard (AES), as a replacement.http://csrc.nist.gov/publications/fips/fips197/fips-197.pdf November 26, 2001. The algorithm which was selected as the AES was submitted by its designers under the name Rijndael. Other finalists in the NIST AES competition included RC6, Serpent, MARS, and Twofish. Data Encryption Standard. http://en.wikipedia.org/?curid=7978."
  }
}
