{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14602",
  "eid" : "15e20370-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778545959,
  "textBody" : "Transport in India consists of transport by land, water, and air. Public transport remains the primary mode of transport for most Indian citizens, and India's public transport systems are among the most heavily used in the world.\n\nMotor vehicle population in India is low as per international standards, with only 24.85 million cars on the nation's roads as of 2013. In total, about 21 per cent households have two wheelers whereas only 4.7 per cent of households in India have cars/jeeps/vans as per the 2011 Census. Despite this, the number of deaths caused by traffic is amongst the highest in the world and increasing. The automobile industry in India is currently rapidly growing with an annual production of over 4.6 million vehicles, with an annual growth rate of 10.5% and vehicle volume is expected to rise greatly in the future.\n\nIndia's rail network is the 3rd longest and the most heavily used system in the world, transporting 8.225 billion passengers and over 970 million tonnes of freight annually, as of 2015. The railways transport about 18 million citizens daily.\n\nIn 2015–16, Government of India, declared 106 National Waterways (NW) under Inland Waterways Authority of India to reduce the cost of transportation and lower the carbon footprint by moving the traffic from surface roads and railroads to waterways.\n\nDespite ongoing improvements in the transport sector, several aspects of transportation are still riddled with problems due to outdated infrastructure and lack of investment in less economically active parts of the country. The demand for transport infrastructure and services has been rising by around 10% a year with the current infrastructure being unable to meet these growing demands. According to Goldman Sachs, India will need to spend 1.7 trillion on infrastructure projects over the next decade to boost economic growth.\n\nHuman/Animal powered \n\nWalking \n\nWalking constituted major form of transport in ancient times. People used to cover long distances on foot or bullock carts. For instance, Adi Sankaracharya travelled all over India from Kalady near Kochi. Walking still constitutes an important mode of transport in urban areas. In the city of Mumbai, to further improve the transit conditions for pedestrians, the Mumbai Metropolitan Region Development Authority, has commenced the construction of more than 50 skywalks, as part of the Mumbai Skywalk project, which is very helpful as walk enthusiasts take part in reducing traffic.\n\nPalanquins \n\nPalanquins, also known as palkis or pallakiis, was one of the luxurious methods primarily used by the rich and noblemen for travelling and also to carry a deity (idol) of a God. Many temples have sculptures of God being carried in a palki. Modern use of the palanquin is limited to Indian weddings, pilgrimage and carrying idol of God.\n\nBicycles \n\nBicycles (simply called cycles in India) have ownership rates ranging from around 30% to 75% at the state level. Along with walking, cycling accounts for 50 to 80% of the commuter trips for those in the informal sector in urban areas. However, recent developments suggest that bicycle riding is fast becoming popular in the metro cities of India. Today, government development authorities all over India encourages the setup and use of separate bicycle lanes alongside the roads to combat pollution and ease traffic congestion.\n\nHuman-pulled rickshaws \n\nHuman-pulled rickshaw are still available in various cities and villages in the country. Many local governments have proposed a ban on these rickshaws describing them as \"inhuman\". The Government of West Bengal proposed a ban on these rickshaws in 2005. Though a bill aiming to address this issue, termed as Calcutta Hackney Carriage Bill, was passed by the West Bengal Assembly in 2006, it has not been implemented yet. The Government of West Bengal is working on an amendment to this bill to avoid the loopholes that got exposed when the Hand-pulled Rickshaw Owner's Association filed a petition against the bill.\n\nCycle rickshaws \n\nCycle rickshaws were introduced in India in the 1940s. They are bigger than a tricycle where two people sit on an elevated seat at the back and a person pedals from the front. In the late 2000s, they were banned in several cities for causing traffic congestion. The Delhi Police recently submitted an affidavit against plying of cycle rickshaws to ease traffic congestion in the city but it was dismissed by the Delhi High Court. In addition, environmentalists have supported the retention of cycle rickshaws as a non-polluting and inexpensive mode of transport.\n\nBullock carts/Horse carriages \n\nBullock carts have been traditionally used for transport, especially in rural India. The arrival of the British saw drastic improvements in the horse carriages which were used for transport since early days. Today, they are used in smaller towns and are referred as Tanga or buggies. Victorias of Mumbai are still used for tourist purposes, but horse carriages are now rarely found in the cities of India. In recent years cities have banned the movement of slow moving vehicles on the main roads.\n\nRoad \n\nAs per 2013 estimates, the total road length in India is ; making the Indian road network the second largest road network in the world after the United States. At 0.66 km of highway per square kilometre of land the density of India's highway network is higher than that of the United States (0.65) and far higher than that of China's (0.16) or Brazil's (0.20).\n\nIndia has a network of National Highways connecting all the major cities and state capitals, forming the economic backbone of the country. As of 2013, India has a total of 70934 km of National Highways, of which 1208 km are classified as expressways.\n\nAs per the National Highways Authority of India, about 65% of freight and 80% passenger traffic is carried by the roads. The National Highways carry about 40% of total road traffic, though only about 2% of the road network is covered by these roads. Average growth of the number of vehicles has been around 10.16% per annum over recent years.\n\nUnder National Highways Development Project (NHDP), work is under progress to equip national highways with four lanes; also there is a plan to convert some stretches of these roads to six lanes. All national highways are metalled, but very few are constructed of concrete, the most notable being the Mumbai-Pune Expressway. In recent years construction has commenced on a nationwide system of multi-lane highways, including the Golden Quadrilateral and North-South and East-West Corridors which link the largest cities in India.\n\nIn 2000, around 40% of villages in India lacked access to all-weather roads and remained isolated during the monsoon season. To improve rural connectivity, Pradhan Mantri Gram Sadak Yojana (Prime Minister's Rural Road Program), a project funded by the Central Government with the help of World Bank, was launched in 2000 to build all-weather roads to connect all habitations with a population of 500 or above (250 or above for hilly areas).\n\nGenerally, traffic in most of the cities in India moves slowly, where traffic jams and accidents are very common, but in some cities like Chandigarh, wide roads and less vehicles contribute to lesser traffic.[http://chandigarh.gov.in/cmp2031/traffic.pdf \"Chandigarh Roads\"] India has very poor records on road safely—around 90,000 people die from road accidents every year. At least 13 people die every hour in road accidents in the country, also in the year 2007 road accidents claimed more than 130,000 lives, overtaking China. A Reader's Digest study of traffic congestion in Asian cities ranked several Indian cities within the Top Ten for worst traffic.\n\nBus \n\nBuses are an important means of public transport in India. Due to this social significance, urban bus transport is often owned and operated by public agencies, and most state governments operate bus services through a State Road Transport Corporation. These corporations have proven extremely useful in connecting villages and towns across the country. Alongside the public companies are many private bus fleets: 2012, there were 131,800 publicly owned buses in India, but 1,544,700 buses owned by private companies. \n\nHowever, the share of buses is negligible in most Indian cities as compared to personalised vehicles, and two-wheelers and cars account for more than 80 percent of the vehicle population in most large cities. Many Indian states government have their own fleet of buses which are run under their State Transport Department. Some of the top bus fleet are as follows:\n\nBus Rapid Transit System \n\nBus rapid transit systems (BRTS), exist in several cities of the country. Buses take up over 90% of public transport in Indian cities, and serve as an important mode of transport. Services are mostly run by state government owned Transport Corporations. In 1990s all government State Transport Corporations have introduced various facilities like low-floor buses for the disabled and air-conditioned buses to attract private car owners to help decongest roads. \n\nRainbow BRTS in Pune is the first BRTS system in the country. Mumbai introduced air conditioned buses in 1998. Bangalore was the first city in India to introduce Volvo B7RLE intra-city buses in India in January 2005 .\nApsrtc is the first transport corporation to introduce night services and online reservation.\nBangalore is the first Indian city to have an air-conditioned bus stop, located near Cubbon Park. It was built by Airtel. The city of Chennai houses one of Asia's largest bus terminus, the Chennai Mofussil Bus Terminus.\n\nMotor vehicles \n\nTwo-wheelers \n\nMotorised two-wheeler vehicles like scooters, motorcycles and mopeds are very popular mode of transport due to their fuel efficiency and ease of use in congested roads or streets. The number of two-wheelers sold is several times that of cars. There were 47.5 million powered two-wheelers in India in 2003 compared with just 8.6 million cars.\n\nManufacture of motorcycles in India started when Royal Enfield began assembly in its plant in Chennai in 1948. Royal Enfield, an iconic brand name in the country, manufactures different variants of the British Bullet motorcycle which is a classic motorcycle that is still in production. Hero MotoCorp (formerly Hero Honda), Honda, Bajaj Auto, Yamaha, TVS Motors and Mahindra 2 Wheelers are the largest two-wheeler companies in terms of market-share.\n\nManufacture of scooters in India started when Automobile Products of India (API), set up at Mumbai and incorporated in 1949, began assembling Innocenti-built Lambretta scooters in India. They eventually acquired licence for the Li150 series model, of which they began full-fledged production from the early sixties onwards. In 1972, Scooters India Ltd (SIL), a state-run enterprise based in Lucknow, Uttar Pradesh, bought the entire manufacturing rights of the last Innocenti Lambretta model. API has infrastructural facilities at Mumbai, Aurangabad, and Chennai but has been non-operational since 2002. SIL stopped producing scooters in 1998.\n\nMotorcycles and scooters can be rented in many cities, Wicked Ride, Metro bikes and many other companies are working with state governments to solve last mile connectivity problems with mass transit solutions. Wearing protective headgear is mandatory for both the rider and the pillion-rider in most cities.\n\nAutomobiles \n\nPrivate automobiles account for 30% of the total transport demand in urban areas of India. An average of 963 new private vehicles are registered every day in Delhi alone. The number of automobiles produced in India rose from 6.3 million in 2002–03 to 11 million (11.2 million) in 2008–09. However, India still has a very low rate of car ownership. When comparing car ownership between BRIC developing countries, it is on a par with China, and exceeded by Brazil and Russia.\n\nCompact cars, especially hatchbacks predominate due to affordability, fuel efficiency, congestion, and lack of parking space in most cities. Chennai is known as the \"Detroit of India\" for its automobile industry. Maruti, Hyundai and Tata Motors are the most popular brands in the order of their market share. The Ambassador once had a monopoly but is now an icon of pre-liberalisation India, and is still used by taxi companies. Maruti 800 launched in 1984 created the first revolution in the Indian auto sector because of its low pricing. It had the highest market share until 2004, when it was overtaken by other low-cost models from Maruti such as the Alto and the Wagon R, the Indica from Tata Motors and the Santro from Hyundai. Over the 20-year period since its introduction, about 2.4 million units of the Maruti 800 have been sold. However, with the launch of the Tata Nano, the least expensive production car in the world, Maruti 800 lost its popularity.\n\nIndia is also known for a variety of indigenous vehicles made in villages out of simple motors and vehicle spare-parts. A few of these innovations are the Jugaad, Maruta, Chhakda, Peter Rehda and the Fame.\n\nIn the city of Bangalore, Radio One and the Bangalore Traffic Police, launched a carpooling drive which has involved celebrities such as Robin Uthappa, and Rahul Dravid encouraging the public to carpool. The initiative got a good response, and by the end of May 2009, 10,000 people are said to have carpooled in the city.\n\nUtility vehicles \n\nThe first utility vehicle in India was manufactured by Mahindra. It was a copy of the original Jeep and was manufactured under licence. The vehicle was an instant hit and made Mahindra one of the top companies in India. The Indian Army and police extensively use Mahindra vehicles along with Maruti Gypsys for transporting personnel and equipment.\n\nTata Motors, the automobile manufacturing arm of the Tata Group, launched its first utility vehicle, the Tata Sumo, in 1994. The Sumo, owing to its then-modern design, captured a 31% share of the market within two years. The Tempo Trax from Force Motors till recently was ruling the rural areas. Sports utility vehicles now form a sizeable part of the passenger vehicle market. Models from Tata, Honda, Hyundai, Ford, Chevrolet and other brands are available.\n\nTaxis \n\nMost of the taxicabs in India are either Premier Padmini or Hindustan Ambassador cars. Depending on the city/state, taxis can either be hailed or hired from taxi-stands. In cities such as Bangalore, Hyderabad and Ahmedabad, taxis need to be hired over phone, whereas in cities like Kolkata and Mumbai, taxis can be hailed on the street. According to government of India regulations, all taxis are required to have a fare-meter installed.Motor Vehicles Act, 1988 : s. 74(2)(viii) There are additional surcharges for luggage, late-night rides and toll taxes are to be paid by the passenger. Since 2006, radio taxis have become increasingly popular with the public due to reasons of safety and convenience.\n\nIn cities and localities where taxis are expensive or do not ply as per the government or municipal regulated fares, people use share taxis. These are normal taxis which carry one or more passengers travelling to destinations either on one route to the final destination, or near the final destination. The passengers are charged according to the number of people with different destinations. The city of Mumbai will soon be the first city in India, to have an \"in-taxi\" magazine, titled MumBaee, which will be issued to taxis which are part of the Mumbai Taximen's Union. The magazine debuted on 13 July 2009. In Kolkata, there are many no refusal taxi available with white and blue in colour.\n\nAuto Rickshaws \n\nAn auto rickshaw is a three-wheeler vehicle for hire that does not have doors and is generally characterised by a small cabin for the driver in the front and a seat for passengers in the rear. Generally it is painted in yellow, green or black color and has a black, yellow or green canopy on the top, but designs vary considerably from place to place. The color of the autorickshaw is also determined by the fuel that it is powered by, for example Agartala, Ahmedabad, Mumbai and Delhi have green or black autos indicating the use of compressed natural gas, whereas the autos of Kolkata, Bangalore, Hyderabad have green autos indicating the use of LPG.\n\nIn Mumbai and other metropolitan cities, 'autos' or 'rickshaws' as they are popularly known have regulated metered fares. A recent law prohibits auto rickshaw drivers from charging more than the specified fare, or charging night-fare before midnight, and also prohibits the driver from refusing to go to a particular location. Mumbai and Kolkata are also the only two cities which prohibit auto rickshaws from entering a certain part of the city, in these cases being South Mumbai and certain parts of Downtown Kolkata. However, in cities like Chennai, it is common to see autorickshaw drivers demand more than the specified fare and refuse to use fare meter.\n\nAirports and railway stations at many cities such as Howrah, Chennai and Bangalore provide a facility of prepaid auto booths, where the passenger pays a fixed fare as set by the authorities for various locations.\n\nElectric rickshaw is new popular means of transport, rapidly growing in number in India, due to low running and initial cost, other economic and environment benefits, these vehicles are becoming popular in India. E-Rickshaws are made in fiberglass or metal body, powered by a BLDC Electric Motor with max power 2000W and speed 25 km/h.\n\nRail \n\nCountry-wide rail services in India, are provided by the state-run Indian Railways under the supervision of the Ministry of Railways. IR is divided into seventeen zones including the Kolkata Metro Railway. The IR are further sub-divided into sixty seven divisions, each having a divisional headquarters.\n\nThe railway network traverses through the length and breadth of the country, covering more than 7,000 stations over a total route length of more than 65000 km and track length of about 115000 km. About 22224 km or 34% of the route-kilometre was electrified as on 31 March 2012. IR provides an important mode of transport in India, transporting over 18 million passengers and more than 2 million tonnes of freight daily across one of the largest and busiest rail networks in the world. IR is the world's largest commercial or utility employer, with more than 1.4 million employees. As to rolling stock, IR owns over 200,000 (freight) wagons, 50,000 coaches and 8,000 locomotives. It also owns locomotive and coach production facilities. It operates both long distance and suburban rail systems on a network of broad gauge\n\nThe IR runs a number of special types of services which are given higher priority. The Rajdhani trains introduced in 1969 provides connectivity between the national capital, Delhi and capitals of the states. On the other hand, Shatabdi Express provides connectivity between centres of tourism, pilgrimage or business. The Shatabdi Express trains run over short to medium distances and do not have sleepers while the Rajdhani Expresses run over longer distances and have only sleeping accommodation. Both series of trains have a maximum permissible speed of 110 to 140 km/h (81 to 87 mph) but average speed of less than 100 km/h.. The Duronto Express (without any commercial stop between the origin and the destination but with a few technical stops for crew change and food intake) and Garib Raths express that provide cheap no-frill airconditioned rail travel.\n\nBesides, the IR also operates a number of luxury trains which cater to various tourist circuits. For instance, the Palace on Wheels serves the Rajasthan circuit and The Golden Chariot serves the Karnataka and Goa circuits. There are two UNESCO World Heritage Sites on IR, the Chhatrapati Shivaji Maharaj Terminus and the Mountain railways of India. The latter consists of three separate railway lines located in different parts of India, the Darjeeling Himalayan Railway, a  narrow gauge railway in Lesser Himalayas in West Bengal, the Nilgiri Mountain Railway, a  rack railway in the Nilgiri Hills in Tamil Nadu and the Kalka-Shimla Railway, a  narrow gauge railway in the Siwalik Hills in Himachal Pradesh.\n\nIn India, freight (goods) trains can carry standard containers double-stacked on flat-bed wagons with normal axle load of about 22 tonnes and do not require special low-bed wagons unlike in other countries that have (relatively narrow)  standard gauge. They carry almost 4000 tonnes per rake which is almost twice the load a normal goods train can haul. Some double-stacked container freight trains on the route through Rewari station also carry \"high cube\" containers that are 2896 mm (9 ft 6-inch) high (higher than standard containers that are generally 8 ft or 2.438 mm high) on special low-well wagons owned by private clients. Some private logistics operators have built container storage yards north of Rewari near Garhi Harsaru for this purpose.\n\nIn 1999, the Konkan Railway Corporation introduced the Roll on Roll off (RORO) service, a unique road-rail synergy system, on the section between Kolad in Maharashtra and Verna in Goa, which was extended up to Surathkal in Karnataka in 2004. The RORO service, the first of its kind in India, allowed trucks to be transported on flatbed trailers. It was highly popular, carrying about  trucks and bringing in about  740 million worth of earnings to the corporation till 2007.\n\nHigh-speed rail \n\nIndia does not have any railways classified as high-speed rail (HSR), which have operational speeds in excess of 200 km/h. The fastest train in India is the Gatimaan Express with a top speed of 160 km/h, which runs between Delhi and Agra.\n\nPrior to the 2014 general election, the two major national parties (Bharatiya Janata Party and Indian National Congress) pledged to introduce high-speed rail. The INC pledged to connect all of India's million-plus cities by high-speed rail,[http://inc.in/manifesto/issues/infrastructure-11-54.aspx INC Manifesto – infrastructure]  whereas BJP, which won the election, promised to build the Diamond Quadrilateral project, which would connect the cities of Chennai, Delhi, Kolkata, and Mumbai via high-speed rail. This project was approved as a priority for the new government in the incoming prime minister's speech. Construction of one kilometer of high speed railway track will cost  –  which is 10-14 times higher than the construction of standard railway.\n\nIndian government approved the choice of Japan to build India's first high-speed railway. The planned rail would run some 500 km between Mumbai and the western city of Ahmedabad, at a top speed of 320 km/h. Under the proposal, construction is expected to begin in 2017 and be completed in 2023. It would cost about  and be financed by a low-interest loan from Japan. India will use the wheel-based 300 km/hr HSR technology, instead of new maglev 600 km/hr technology of the Japan used in Chūō Shinkansen. India is expected to have its HSR line operational from 2025 onwards, once the safety checks are completed.\n\nIndia's Frontier Railways \n\nRail links between India and neighbouring countries are not well-developed. Two trains operate to Pakistan—the Samjhauta Express between Delhi and Lahore, and the Thar Express between Jodhpur and Karachi. Bangladesh is connected by a biweekly train, the Maitree Express that runs from Kolkata to Dhaka. Two rail links to Nepal exist—passenger services between Jaynagar and Bijalpura, and freight services between Raxaul and Birganj.\n\nIndian and Bangladeshi governments will start work late by December or early by January 2015 on a new rail link to ease surface transport. India will build a 15-km railway tracks linking Tripura's capital Agartala with Bangladesh's southeastern city of Akhaura, an important railway junction connected to Chittagong port, resource-rich Sylhet and Dhaka. An agreement to implement the railway project was signed between India and Bangladesh in January 2010. Total cost of the proposed project is estimated at Rs.252 crore. The Indian Railway Construction Company (IRCON) would lay the new railway tracks on both sides of the border. Of the 15 km rail line, five km of tracks fall in the Indian territory.\nThe NFR is now laying tracks to connect Tripura's southern most border town Sabroom, 135 km south of here. From Sabroom, the Chittagong international sea port is just 72 km.\n\nNo rail link exists with Myanmar but a railway line is to be built through from Jiribam (in Manipur) to Tamu through Imphal and Moreh. The construction of this missing link, as per the feasibility study conducted by the Ministry of External Affairs through RITES Ltd, is estimated to cost . An 18 km railway link with Bhutan is being constructed from Hashimara in West Bengal to Toribari in Bhutan. No rail link exists with either China  or Sri Lanka.\n\nSuburban rail \n\nThe Mumbai Suburban Railway is the first rail system in India which began services in Mumbai in 1853, transports 6.3 million passengers daily and has the highest passenger density in the world. The Kolkata Suburban Railway, was established in Kolkata in 1854.\n\nThe operational suburban rail systems in India are in Mumbai Suburban Railway, Kolkata Suburban Railway, Lucknow-Kanpur Suburban Railway, Chennai Suburban Railway, Delhi Suburban Railway, Pune Suburban Railway, Hyderabad Multi-Modal Transport System, Barabanki-Lucknow Suburban Railway and Pernem-Karwar Suburban Railway.\n\nOther planned systems are Bengaluru Commuter Rail, Ahmedabad Suburban Railway and Coimbatore Suburban Railway.\n\nMetro \n\nThe first modern rapid transit in India is the Kolkata Metro and started its operations in 1984, this is also the 17th Zone of the IR. The Delhi Metro in New Delhi is India's second conventional metro and began operations in 2002. The Namma Metro in Bangalore is India's third operational rapid transit and began operations in 2011.\n\nThe operational systems are Kolkata Metro, Delhi Metro, Hyderabad Metro, Namma Metro, Rapid Metro, Mumbai Metro, Jaipur Metro, Chennai Metro, Kochi Metro and Lucknow Metro.\n\nThe planned systems are Noida Metro, Ghaziabad Metro, Navi Mumbai Metro, Nagpur Metro, Metro-Link Express for Gandhinagar and Ahmedabad, Varanasi Metro, Kanpur Metro, Bareilly Metro, Pune Metro, Vijayawada Metro, Patna Metro, Meerut Metro, Guwahati Metro, Chandigarh Metro, Bhopal Metro, Kozhikode Light Metro, Indore Metro, Thiruvananthapuram Light Metro, Agra Metro, Coimbatore Metro, Visakhapatnam Metro, Dehradun Metro, Surat Metro, Srinagar Metro, Greater Gwalior Metro, Jabalpur Metro and Greater Nashik Metro.\n\nCurrently, rapid transit are under construction or in planning in several major cities of India and will be opened shortly.\n\nMonorail \n\nMonorail is generally considered as feeder system for the Metro trains in India. The Mumbai Monorail, which started in 2014, is the first operational monorail network in India (excluding the Skybus Metro) since the Patiala State Monorail Trainways closed in 1927.\n\nOther planned systems are Chennai Monorail, Kolkata Monorail, Allahabad Monorail, Bengaluru Monorail, Delhi Monorail, Indore Monorail, Kanpur Monorail, Navi Mumbai Monorail, Patna Monorail, Pune Monorail, Ahmedabad Monorail, Aizawl Monorail, Bhubaneswar Monorail, Jodhpur Monorail, Kota Monorail, Nagpur Monorail and Nashik Monorail.\n\nLight rail \n\nLike monorail, light rail is also considered as a feeder system for the Metro systems. \nThe planned systems are Kolkata Light Rail Transit and Delhi Light Rail Transit.\n\nTram \n\nIn addition to trains, trams were introduced in many cities in late 19th century, though almost all of these were phased out. The trams in Kolkata is currently the only tram system in the country and provides an emission-free means of transport in Kolkata while the other tram systems in India were phased out. The nationalised Calcutta Tramways Company is in the process of upgrading the existing tramway network at a cost of .\n\nAir \n\n Directorate General of Civil Aviation is the national regulatory body for the aviation industry. It is controlled by the Ministry of Civil Aviation. The ministry also controls aviation related autonomous organisations like the Airports Authority of India (AAI), Bureau of Civil Aviation Security (BCAS), Indira Gandhi Rashtriya Uran Akademi and Public Sector Undertakings including Air India, Pawan Hans Helicopters Limited and Hindustan Aeronautics Limited.[http://www.civilaviation.gov.in/MocaEx/faces/orgsetup.jspx] \n\nAir India is India's national flag carrier after merging with Indian (airline) in 2011[http://www.airindia.com/SBCMS/Webpages/Fleet-Details1.aspx?MID196#]  and plays a major role in connecting India with the rest of the world. IndiGo, Jet Airways, Air India, Spicejet and GoAir are the major carriers in order of their market share. These airlines connect more than 80 cities across India and also operate overseas routes after the liberalisation of Indian aviation. Several other foreign airlines connect Indian cities with other major cities across the globe. However, a large section of country's air transport potential remains untapped, even though the Mumbai-Delhi air corridor was ranked 10th by Amadeus in 2012 among the world's busiest routes.\n\nAirports \n\nWhile there are 346 civilian airfields in India – 253 with paved runways and 93 with unpaved runways, only 132 were classified as \"airports\" as of November 2014.[http://civilaviation.gov.in/cs/groups/public/documents/newsandupdates/moca_003368.pdf]  Of these, Indira Gandhi International Airport in Delhi is the busiest in the country. The operations of the major airports in India have been privatised over the past 5 years and this has resulted in better equipped and cleaner airports. The terminals have either been refurbished or expanded.\n\nIndia also has 33 \"ghost airports,\" which were built in an effort to make air travel more accessible for those in remote regions but are now non-operational due to a lack of demand. The Jaisalmer Airport in Rajasthan, for example, was completed in 2013 and was expected to host 300,000 passengers a year but has yet to see any commercial flights take off. Despite the number of non-operational airports, India is currently planning on constructing another 200 \"low-cost\" airports over the next 20 years.\n\nHeliports \n\nAs of 2013, there are 45 heliports in India. India also has the world's highest helipad at the Siachen Glacier at a height of 6400 m (21,000 ft) above mean sea level.\n\nEstablished in\n\nPawan Hans Helicopters Limited is a public sector company that provides helicopter services to ONGC to its off-shore locations, and also to various State Governments in India, particularly in North-east India.\n\nWater \n\nIndia has a coastline of 7517 km, and thus ports are the main centres of trade.\n\nIndia also has an extensive network of inland waterways.\n\nPorts and shipping \n\nIn India about 95% of the foreign trade by quantity and 70% by value takes place through the ports. Mumbai Port & JNPT(Navi Mumbai) handles 70% of maritime trade in India. There are twelve major ports: Navi Mumbai, Mumbai, Kochi, Kolkata (including Haldia), Paradip, Visakhapatnam, Ennore, Chennai, Tuticorin, New Mangaluru, Mormugao and Kandla. Other than these, there are 187 minor and intermediate ports, 43 of which handle cargo.\n\nMaritime transportation in India is managed by the Shipping Corporation of India, a government-owned company that also manages offshore and other marine transport infrastructure in the country. It owns and operates about 35% of Indian tonnage and operates in practically all areas of shipping business servicing both national and international trades.The only state which carries three ports in India is Tamil Nadu, they are Ennore, Chennai and Tuticorin.\n\nIt has a fleet of 79 ships of 2750,000 GT (4.8 million DWT) and also manages 53 research, survey and support vessels of 120,000 GT (060,000 DWT) on behalf of various government departments and other organisations. Personnel are trained at the Maritime Training Institute in Mumbai, a branch of the World Maritime University, which was set up in 1987. The Corporation also operates in Malta and Iran through joint ventures.\n\nThe distinction between major and minor ports is not based on the amount of cargo handled. The major ports are managed by port trusts which are regulated by the central government. They come under the purview of the Major Port Trusts Act, 1963.Chandnani, Lajpat Ray. General Insurance, Reinsurance and Risk Management Glossary. Notion Press (2017). The minor ports are regulated by the respective state governments and many of these ports are private ports or captive ports. The total amount of traffic handled at the major ports in 2005–2006 was 382.33 Mt.\n\nWaterways \n\nIndia has an extensive network of inland waterways in the form of rivers, canals, backwaters and creeks. The total navigable length is 14500 km, out of which about 5200 km of river and 485 km of canals can be used by mechanised crafts. Freight transport by waterways is highly underutilised in India compared to other large countries. The total cargo moved by inland waterways is just 0.15% of the total inland traffic in India, compared to the corresponding figures of 20% for Germany and 32% for Bangladesh.\n\nCargo that is transported in an organised manner is confined to a few waterways in Goa, West Bengal, Assam and Kerala. The Inland Waterways Authority of India (IWAI) is the statutory authority in charge of the waterways in India. It does the function of building the necessary infrastructure in these waterways, surveying the economic feasibility of new projects and also administration and regulation. The following waterways have been declared as National Waterways:\n\n* National Waterway 1: Allahabad–Haldia stretch of the Ganga – Bhagirathi – Hooghly river system with a total length of 1620 km in October 1986.\n* National Waterway 2: Saidiya–Dhubri stretch of the Brahmaputra river system with a total length of 891 km in 1988.\n* National Waterway 3: Kollam–Kottapuram stretch of the West Coast Canal along with Champakara and Udyogmandal canals, with a total length of 205 km in 1993.\n* National Waterway 4: Bhadrachalam–Rajahmundry and Wazirabad–Vijaywada stretch of the Krishna–Godavari river system along with the Kakinada–Pondicherry canal network, with a total length of 1095 km in 2007.\n* National Waterway 5: Mangalgadi–Paradeep and Talcher–Dhamara stretch of the Mahanadi–Brahmani river system along with the East Coast Canal, with a total length of 623 km in 2007.\n\nPipelines \n\nOil and gas industry in India imports 82% of its oil needs and aims to bring that down to 67% by 2022 by replacing it with local exploration, renewable energy and indigenous ethanol fuel (c. Jan 2018).[http://economictimes.indiatimes.com/articleshow/62557212.cms?utm_source\ncontentofinterest&utm_mediumtext&utm_campaign\ncppst India launches first auction of exploration blocks under new licensing policy], Economic Times, 18 Jan 2018. \n\n* Length of pipelines for crude oil is 20000 km.\n* Length of Petroleum products pipeline is 15000 km.\n\nLogistics\n\nLogistics in India ranking moved up to 35th place in 2016 from 54th in 2014 on World Bank's Global Logistics Performance Index. Government strategy aims to raise the share of global trade in India's GDP (US$2.7 trillion in FY 2017-18)[http://economictimes.indiatimes.com/articleshow/62551522.cms?utm_sourcecontentofinterest&utm_medium\ntext&utm_campaigncppst If I were FM: Raamdeo proposes asset-light strategy for infra boost], Economic Times, 18 Jan 2018. to 40%, including half of it (20% of GDP) from exports (c. Jan 2018). Cost of logistics in India is 14% of GDP, which is higher than the developed nations, and government reforms aim to bring it down to 10% of GDP by 2022 (c. Jan 2018). Ministry of Commerce and Industry has created a new dedicated centralised Logistics division in collaboration with Singapore and Japan to handle the logistics which was earlier handled by several different ministries, such railways, roads, shipping and aviation.[https://economictimes.indiatimes.com/industry/transportation/shipping-/-transport/we-are-creating-a-digital-logistics-platform-suresh-prabhu/articleshow/62395534.cmsWe are creating a digital logistics platform: Suresh Prabhu], Economic Times, 6 Jan 2018. To boot exports, each state will have exports and logistic policy and Nodal officers will be appointed at district level (c. Jan 2018).[https://m.dailyhunt.in/news/india/english/investment+guru+india-epaper-invgur/districts+to+be+export+units+looking+at+logistics+ministry+suresh+prabhu-newsid-79500101 Districts to be export units, looking at logistics ministry: Suresh Prabhu ], Daily Hunt, 8 Jan 2018. There are 64 transactions and 37 government agencies in the end-to-end production-to-export process. To further improve the ranking, improve speed of logistics, ease of doing business and reduce the cost of logistics, India is creating a \"common online integrated logistics e-marketplace portal\" that will cover all transactions in production and export, connect buyers with logistics service providers and government agencies such as the customs department Icegate system, Port Community Systems, Sea and Air Port terminals, Shipping lines, Railways, etc. (c. Jan 2018).[http://economictimes.indiatimes.com/articleshow/62530347.cms?utm_sourcecontentofinterest&utm_medium\ntext&utm_campaign=cppst India plans common logistics portal to ease movement of goods, reduce logistics cost], Economic Times, 17 Jan 2018. \n\nAs part of the US$125 billion port-led development project Sagarmala, government will define the regulatory framework for the Indian logistics operational standards by benchmarking India's 300 dry ports logistics parks (inland container depots or ICDs) to the top 10 logistics international best practices nations to boost exports, remove supply chain bottle necks, reduce transaction costs, optimise logistics mix, set up new hub-and-spoke dry ports (c. Jan 2018).[http://economictimes.indiatimes.com/articleshow/62435028.cms?utm_source\ncontentofinterest&utm_mediumtext&utm_campaign\ncppst Government plans to overhaul 300 dry ports], Economic Times, 9 Jan 2018. To reduce the logistics costs by 10% and C02 emissions by 12%, the government is also developing 35 new \"Multimodal Logistics Parks\" (MMLPs) on 36 ring roads, which will facilitate 50% of the freight moved in India. Land has been earmarked and pre-feasibility study is underway for 6 of these MMLPs (c. May 2017).[http://www.business-standard.com/article/news-ians/government-to-construct-35-multimodal-logistics-parks-gadkari-117050300905_1.html Government to construct 35 multimodal logistics parks: Gadkari], Business Standards, 3 May 2017.\n\nConfederation of Indian Industry (CII) and government will organise an annual National Logistics convention. Major supply chain solution providers include Container Corporation of India and Transport Corporation of India, and magazine Logistics Management India magazine is one of the industry publication.\n\nEnvironmental issues and impact \n\nThe National capital New Delhi has one of the largest CNG based transport systems as a part of the drive to bring down pollution. In spite of these efforts it remains the largest contributor to the greenhouse gas emissions in the city. The CNG Bus manufacturers in India are Ashok Leyland, Tata Motors, Swaraj Mazda and Hindustan Motors.\n\nIn 1998, the Supreme Court of India published a Directive that specified the date of April 2001 as deadline to replace or convert all buses, three-wheelers and taxis in Delhi to compressed natural gas.\n\nThe Karnataka State Road Transport Corporation was the first State Transport Undertaking in India to utilise bio-fuels and ethanol-blended fuels. KSRTC took an initiative to do research in alternative fuel forms by experimenting with various alternatives— blending diesel with biofuels such as honge, palm, sunflower, groundnut, coconut and sesame. In 2009, the corporation decided to promote the use of biofuel buses.\n\nIn 2017, the government announced that by 2030, only electric vehicles would be sold in the country. It also announced that by 2022 all trains would be electric trains.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Transport in India" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14602" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Transport in India consists of transport by land, water, and air. Public transport remains the primary mode of transport for most Indian citizens, and India's public transport systems are among the most heavily used in the world.\n\nMotor vehicle population in India is low as per international standards, with only 24.85 million cars on the nation's roads as of 2013. In total, about 21 per cent households have two wheelers whereas only 4.7 per cent of households in India have cars/jeeps/vans as per the 2011 Census. Despite this, the number of deaths caused by traffic is amongst the highest in the world and increasing. The automobile industry in India is currently rapidly growing with an annual production of over 4.6 million vehicles, with an annual growth rate of 10.5% and vehicle volume is expected to rise greatly in the future.\n\nIndia's rail network is the 3rd longest and the most heavily used system in the world, transporting 8.225 billion passengers and over 970 million tonnes of freight annually, as of 2015. The railways transport about 18 million citizens daily.\n\nIn 2015–16, Government of India, declared 106 National Waterways (NW) under Inland Waterways Authority of India to reduce the cost of transportation and lower the carbon footprint by moving the traffic from surface roads and railroads to waterways.\n\nDespite ongoing improvements in the transport sector, several aspects of transportation are still riddled with problems due to outdated infrastructure and lack of investment in less economically active parts of the country. The demand for transport infrastructure and services has been rising by around 10% a year with the current infrastructure being unable to meet these growing demands. According to Goldman Sachs, India will need to spend 1.7 trillion on infrastructure projects over the next decade to boost economic growth.\n\nHuman/Animal powered \n\nWalking \n\nWalking constituted major form of transport in ancient times. People used to cover long distances on foot or bullock carts. For instance, Adi Sankaracharya travelled all over India from Kalady near Kochi. Walking still constitutes an important mode of transport in urban areas. In the city of Mumbai, to further improve the transit conditions for pedestrians, the Mumbai Metropolitan Region Development Authority, has commenced the construction of more than 50 skywalks, as part of the Mumbai Skywalk project, which is very helpful as walk enthusiasts take part in reducing traffic.\n\nPalanquins \n\nPalanquins, also known as palkis or pallakiis, was one of the luxurious methods primarily used by the rich and noblemen for travelling and also to carry a deity (idol) of a God. Many temples have sculptures of God being carried in a palki. Modern use of the palanquin is limited to Indian weddings, pilgrimage and carrying idol of God.\n\nBicycles \n\nBicycles (simply called cycles in India) have ownership rates ranging from around 30% to 75% at the state level. Along with walking, cycling accounts for 50 to 80% of the commuter trips for those in the informal sector in urban areas. However, recent developments suggest that bicycle riding is fast becoming popular in the metro cities of India. Today, government development authorities all over India encourages the setup and use of separate bicycle lanes alongside the roads to combat pollution and ease traffic congestion.\n\nHuman-pulled rickshaws \n\nHuman-pulled rickshaw are still available in various cities and villages in the country. Many local governments have proposed a ban on these rickshaws describing them as \"inhuman\". The Government of West Bengal proposed a ban on these rickshaws in 2005. Though a bill aiming to address this issue, termed as Calcutta Hackney Carriage Bill, was passed by the West Bengal Assembly in 2006, it has not been implemented yet. The Government of West Bengal is working on an amendment to this bill to avoid the loopholes that got exposed when the Hand-pulled Rickshaw Owner's Association filed a petition against the bill.\n\nCycle rickshaws \n\nCycle rickshaws were introduced in India in the 1940s. They are bigger than a tricycle where two people sit on an elevated seat at the back and a person pedals from the front. In the late 2000s, they were banned in several cities for causing traffic congestion. The Delhi Police recently submitted an affidavit against plying of cycle rickshaws to ease traffic congestion in the city but it was dismissed by the Delhi High Court. In addition, environmentalists have supported the retention of cycle rickshaws as a non-polluting and inexpensive mode of transport.\n\nBullock carts/Horse carriages \n\nBullock carts have been traditionally used for transport, especially in rural India. The arrival of the British saw drastic improvements in the horse carriages which were used for transport since early days. Today, they are used in smaller towns and are referred as Tanga or buggies. Victorias of Mumbai are still used for tourist purposes, but horse carriages are now rarely found in the cities of India. In recent years cities have banned the movement of slow moving vehicles on the main roads.\n\nRoad \n\nAs per 2013 estimates, the total road length in India is ; making the Indian road network the second largest road network in the world after the United States. At 0.66 km of highway per square kilometre of land the density of India's highway network is higher than that of the United States (0.65) and far higher than that of China's (0.16) or Brazil's (0.20).\n\nIndia has a network of National Highways connecting all the major cities and state capitals, forming the economic backbone of the country. As of 2013, India has a total of 70934 km of National Highways, of which 1208 km are classified as expressways.\n\nAs per the National Highways Authority of India, about 65% of freight and 80% passenger traffic is carried by the roads. The National Highways carry about 40% of total road traffic, though only about 2% of the road network is covered by these roads. Average growth of the number of vehicles has been around 10.16% per annum over recent years.\n\nUnder National Highways Development Project (NHDP), work is under progress to equip national highways with four lanes; also there is a plan to convert some stretches of these roads to six lanes. All national highways are metalled, but very few are constructed of concrete, the most notable being the Mumbai-Pune Expressway. In recent years construction has commenced on a nationwide system of multi-lane highways, including the Golden Quadrilateral and North-South and East-West Corridors which link the largest cities in India.\n\nIn 2000, around 40% of villages in India lacked access to all-weather roads and remained isolated during the monsoon season. To improve rural connectivity, Pradhan Mantri Gram Sadak Yojana (Prime Minister's Rural Road Program), a project funded by the Central Government with the help of World Bank, was launched in 2000 to build all-weather roads to connect all habitations with a population of 500 or above (250 or above for hilly areas).\n\nGenerally, traffic in most of the cities in India moves slowly, where traffic jams and accidents are very common, but in some cities like Chandigarh, wide roads and less vehicles contribute to lesser traffic.[http://chandigarh.gov.in/cmp2031/traffic.pdf \"Chandigarh Roads\"] India has very poor records on road safely—around 90,000 people die from road accidents every year. At least 13 people die every hour in road accidents in the country, also in the year 2007 road accidents claimed more than 130,000 lives, overtaking China. A Reader's Digest study of traffic congestion in Asian cities ranked several Indian cities within the Top Ten for worst traffic.\n\nBus \n\nBuses are an important means of public transport in India. Due to this social significance, urban bus transport is often owned and operated by public agencies, and most state governments operate bus services through a State Road Transport Corporation. These corporations have proven extremely useful in connecting villages and towns across the country. Alongside the public companies are many private bus fleets: 2012, there were 131,800 publicly owned buses in India, but 1,544,700 buses owned by private companies. \n\nHowever, the share of buses is negligible in most Indian cities as compared to personalised vehicles, and two-wheelers and cars account for more than 80 percent of the vehicle population in most large cities. Many Indian states government have their own fleet of buses which are run under their State Transport Department. Some of the top bus fleet are as follows:\n\nBus Rapid Transit System \n\nBus rapid transit systems (BRTS), exist in several cities of the country. Buses take up over 90% of public transport in Indian cities, and serve as an important mode of transport. Services are mostly run by state government owned Transport Corporations. In 1990s all government State Transport Corporations have introduced various facilities like low-floor buses for the disabled and air-conditioned buses to attract private car owners to help decongest roads. \n\nRainbow BRTS in Pune is the first BRTS system in the country. Mumbai introduced air conditioned buses in 1998. Bangalore was the first city in India to introduce Volvo B7RLE intra-city buses in India in January 2005 .\nApsrtc is the first transport corporation to introduce night services and online reservation.\nBangalore is the first Indian city to have an air-conditioned bus stop, located near Cubbon Park. It was built by Airtel. The city of Chennai houses one of Asia's largest bus terminus, the Chennai Mofussil Bus Terminus.\n\nMotor vehicles \n\nTwo-wheelers \n\nMotorised two-wheeler vehicles like scooters, motorcycles and mopeds are very popular mode of transport due to their fuel efficiency and ease of use in congested roads or streets. The number of two-wheelers sold is several times that of cars. There were 47.5 million powered two-wheelers in India in 2003 compared with just 8.6 million cars.\n\nManufacture of motorcycles in India started when Royal Enfield began assembly in its plant in Chennai in 1948. Royal Enfield, an iconic brand name in the country, manufactures different variants of the British Bullet motorcycle which is a classic motorcycle that is still in production. Hero MotoCorp (formerly Hero Honda), Honda, Bajaj Auto, Yamaha, TVS Motors and Mahindra 2 Wheelers are the largest two-wheeler companies in terms of market-share.\n\nManufacture of scooters in India started when Automobile Products of India (API), set up at Mumbai and incorporated in 1949, began assembling Innocenti-built Lambretta scooters in India. They eventually acquired licence for the Li150 series model, of which they began full-fledged production from the early sixties onwards. In 1972, Scooters India Ltd (SIL), a state-run enterprise based in Lucknow, Uttar Pradesh, bought the entire manufacturing rights of the last Innocenti Lambretta model. API has infrastructural facilities at Mumbai, Aurangabad, and Chennai but has been non-operational since 2002. SIL stopped producing scooters in 1998.\n\nMotorcycles and scooters can be rented in many cities, Wicked Ride, Metro bikes and many other companies are working with state governments to solve last mile connectivity problems with mass transit solutions. Wearing protective headgear is mandatory for both the rider and the pillion-rider in most cities.\n\nAutomobiles \n\nPrivate automobiles account for 30% of the total transport demand in urban areas of India. An average of 963 new private vehicles are registered every day in Delhi alone. The number of automobiles produced in India rose from 6.3 million in 2002–03 to 11 million (11.2 million) in 2008–09. However, India still has a very low rate of car ownership. When comparing car ownership between BRIC developing countries, it is on a par with China, and exceeded by Brazil and Russia.\n\nCompact cars, especially hatchbacks predominate due to affordability, fuel efficiency, congestion, and lack of parking space in most cities. Chennai is known as the \"Detroit of India\" for its automobile industry. Maruti, Hyundai and Tata Motors are the most popular brands in the order of their market share. The Ambassador once had a monopoly but is now an icon of pre-liberalisation India, and is still used by taxi companies. Maruti 800 launched in 1984 created the first revolution in the Indian auto sector because of its low pricing. It had the highest market share until 2004, when it was overtaken by other low-cost models from Maruti such as the Alto and the Wagon R, the Indica from Tata Motors and the Santro from Hyundai. Over the 20-year period since its introduction, about 2.4 million units of the Maruti 800 have been sold. However, with the launch of the Tata Nano, the least expensive production car in the world, Maruti 800 lost its popularity.\n\nIndia is also known for a variety of indigenous vehicles made in villages out of simple motors and vehicle spare-parts. A few of these innovations are the Jugaad, Maruta, Chhakda, Peter Rehda and the Fame.\n\nIn the city of Bangalore, Radio One and the Bangalore Traffic Police, launched a carpooling drive which has involved celebrities such as Robin Uthappa, and Rahul Dravid encouraging the public to carpool. The initiative got a good response, and by the end of May 2009, 10,000 people are said to have carpooled in the city.\n\nUtility vehicles \n\nThe first utility vehicle in India was manufactured by Mahindra. It was a copy of the original Jeep and was manufactured under licence. The vehicle was an instant hit and made Mahindra one of the top companies in India. The Indian Army and police extensively use Mahindra vehicles along with Maruti Gypsys for transporting personnel and equipment.\n\nTata Motors, the automobile manufacturing arm of the Tata Group, launched its first utility vehicle, the Tata Sumo, in 1994. The Sumo, owing to its then-modern design, captured a 31% share of the market within two years. The Tempo Trax from Force Motors till recently was ruling the rural areas. Sports utility vehicles now form a sizeable part of the passenger vehicle market. Models from Tata, Honda, Hyundai, Ford, Chevrolet and other brands are available.\n\nTaxis \n\nMost of the taxicabs in India are either Premier Padmini or Hindustan Ambassador cars. Depending on the city/state, taxis can either be hailed or hired from taxi-stands. In cities such as Bangalore, Hyderabad and Ahmedabad, taxis need to be hired over phone, whereas in cities like Kolkata and Mumbai, taxis can be hailed on the street. According to government of India regulations, all taxis are required to have a fare-meter installed.Motor Vehicles Act, 1988 : s. 74(2)(viii) There are additional surcharges for luggage, late-night rides and toll taxes are to be paid by the passenger. Since 2006, radio taxis have become increasingly popular with the public due to reasons of safety and convenience.\n\nIn cities and localities where taxis are expensive or do not ply as per the government or municipal regulated fares, people use share taxis. These are normal taxis which carry one or more passengers travelling to destinations either on one route to the final destination, or near the final destination. The passengers are charged according to the number of people with different destinations. The city of Mumbai will soon be the first city in India, to have an \"in-taxi\" magazine, titled MumBaee, which will be issued to taxis which are part of the Mumbai Taximen's Union. The magazine debuted on 13 July 2009. In Kolkata, there are many no refusal taxi available with white and blue in colour.\n\nAuto Rickshaws \n\nAn auto rickshaw is a three-wheeler vehicle for hire that does not have doors and is generally characterised by a small cabin for the driver in the front and a seat for passengers in the rear. Generally it is painted in yellow, green or black color and has a black, yellow or green canopy on the top, but designs vary considerably from place to place. The color of the autorickshaw is also determined by the fuel that it is powered by, for example Agartala, Ahmedabad, Mumbai and Delhi have green or black autos indicating the use of compressed natural gas, whereas the autos of Kolkata, Bangalore, Hyderabad have green autos indicating the use of LPG.\n\nIn Mumbai and other metropolitan cities, 'autos' or 'rickshaws' as they are popularly known have regulated metered fares. A recent law prohibits auto rickshaw drivers from charging more than the specified fare, or charging night-fare before midnight, and also prohibits the driver from refusing to go to a particular location. Mumbai and Kolkata are also the only two cities which prohibit auto rickshaws from entering a certain part of the city, in these cases being South Mumbai and certain parts of Downtown Kolkata. However, in cities like Chennai, it is common to see autorickshaw drivers demand more than the specified fare and refuse to use fare meter.\n\nAirports and railway stations at many cities such as Howrah, Chennai and Bangalore provide a facility of prepaid auto booths, where the passenger pays a fixed fare as set by the authorities for various locations.\n\nElectric rickshaw is new popular means of transport, rapidly growing in number in India, due to low running and initial cost, other economic and environment benefits, these vehicles are becoming popular in India. E-Rickshaws are made in fiberglass or metal body, powered by a BLDC Electric Motor with max power 2000W and speed 25 km/h.\n\nRail \n\nCountry-wide rail services in India, are provided by the state-run Indian Railways under the supervision of the Ministry of Railways. IR is divided into seventeen zones including the Kolkata Metro Railway. The IR are further sub-divided into sixty seven divisions, each having a divisional headquarters.\n\nThe railway network traverses through the length and breadth of the country, covering more than 7,000 stations over a total route length of more than 65000 km and track length of about 115000 km. About 22224 km or 34% of the route-kilometre was electrified as on 31 March 2012. IR provides an important mode of transport in India, transporting over 18 million passengers and more than 2 million tonnes of freight daily across one of the largest and busiest rail networks in the world. IR is the world's largest commercial or utility employer, with more than 1.4 million employees. As to rolling stock, IR owns over 200,000 (freight) wagons, 50,000 coaches and 8,000 locomotives. It also owns locomotive and coach production facilities. It operates both long distance and suburban rail systems on a network of broad gauge\n\nThe IR runs a number of special types of services which are given higher priority. The Rajdhani trains introduced in 1969 provides connectivity between the national capital, Delhi and capitals of the states. On the other hand, Shatabdi Express provides connectivity between centres of tourism, pilgrimage or business. The Shatabdi Express trains run over short to medium distances and do not have sleepers while the Rajdhani Expresses run over longer distances and have only sleeping accommodation. Both series of trains have a maximum permissible speed of 110 to 140 km/h (81 to 87 mph) but average speed of less than 100 km/h.. The Duronto Express (without any commercial stop between the origin and the destination but with a few technical stops for crew change and food intake) and Garib Raths express that provide cheap no-frill airconditioned rail travel.\n\nBesides, the IR also operates a number of luxury trains which cater to various tourist circuits. For instance, the Palace on Wheels serves the Rajasthan circuit and The Golden Chariot serves the Karnataka and Goa circuits. There are two UNESCO World Heritage Sites on IR, the Chhatrapati Shivaji Maharaj Terminus and the Mountain railways of India. The latter consists of three separate railway lines located in different parts of India, the Darjeeling Himalayan Railway, a  narrow gauge railway in Lesser Himalayas in West Bengal, the Nilgiri Mountain Railway, a  rack railway in the Nilgiri Hills in Tamil Nadu and the Kalka-Shimla Railway, a  narrow gauge railway in the Siwalik Hills in Himachal Pradesh.\n\nIn India, freight (goods) trains can carry standard containers double-stacked on flat-bed wagons with normal axle load of about 22 tonnes and do not require special low-bed wagons unlike in other countries that have (relatively narrow)  standard gauge. They carry almost 4000 tonnes per rake which is almost twice the load a normal goods train can haul. Some double-stacked container freight trains on the route through Rewari station also carry \"high cube\" containers that are 2896 mm (9 ft 6-inch) high (higher than standard containers that are generally 8 ft or 2.438 mm high) on special low-well wagons owned by private clients. Some private logistics operators have built container storage yards north of Rewari near Garhi Harsaru for this purpose.\n\nIn 1999, the Konkan Railway Corporation introduced the Roll on Roll off (RORO) service, a unique road-rail synergy system, on the section between Kolad in Maharashtra and Verna in Goa, which was extended up to Surathkal in Karnataka in 2004. The RORO service, the first of its kind in India, allowed trucks to be transported on flatbed trailers. It was highly popular, carrying about  trucks and bringing in about  740 million worth of earnings to the corporation till 2007.\n\nHigh-speed rail \n\nIndia does not have any railways classified as high-speed rail (HSR), which have operational speeds in excess of 200 km/h. The fastest train in India is the Gatimaan Express with a top speed of 160 km/h, which runs between Delhi and Agra.\n\nPrior to the 2014 general election, the two major national parties (Bharatiya Janata Party and Indian National Congress) pledged to introduce high-speed rail. The INC pledged to connect all of India's million-plus cities by high-speed rail,[http://inc.in/manifesto/issues/infrastructure-11-54.aspx INC Manifesto – infrastructure]  whereas BJP, which won the election, promised to build the Diamond Quadrilateral project, which would connect the cities of Chennai, Delhi, Kolkata, and Mumbai via high-speed rail. This project was approved as a priority for the new government in the incoming prime minister's speech. Construction of one kilometer of high speed railway track will cost  –  which is 10-14 times higher than the construction of standard railway.\n\nIndian government approved the choice of Japan to build India's first high-speed railway. The planned rail would run some 500 km between Mumbai and the western city of Ahmedabad, at a top speed of 320 km/h. Under the proposal, construction is expected to begin in 2017 and be completed in 2023. It would cost about  and be financed by a low-interest loan from Japan. India will use the wheel-based 300 km/hr HSR technology, instead of new maglev 600 km/hr technology of the Japan used in Chūō Shinkansen. India is expected to have its HSR line operational from 2025 onwards, once the safety checks are completed.\n\nIndia's Frontier Railways \n\nRail links between India and neighbouring countries are not well-developed. Two trains operate to Pakistan—the Samjhauta Express between Delhi and Lahore, and the Thar Express between Jodhpur and Karachi. Bangladesh is connected by a biweekly train, the Maitree Express that runs from Kolkata to Dhaka. Two rail links to Nepal exist—passenger services between Jaynagar and Bijalpura, and freight services between Raxaul and Birganj.\n\nIndian and Bangladeshi governments will start work late by December or early by January 2015 on a new rail link to ease surface transport. India will build a 15-km railway tracks linking Tripura's capital Agartala with Bangladesh's southeastern city of Akhaura, an important railway junction connected to Chittagong port, resource-rich Sylhet and Dhaka. An agreement to implement the railway project was signed between India and Bangladesh in January 2010. Total cost of the proposed project is estimated at Rs.252 crore. The Indian Railway Construction Company (IRCON) would lay the new railway tracks on both sides of the border. Of the 15 km rail line, five km of tracks fall in the Indian territory.\nThe NFR is now laying tracks to connect Tripura's southern most border town Sabroom, 135 km south of here. From Sabroom, the Chittagong international sea port is just 72 km.\n\nNo rail link exists with Myanmar but a railway line is to be built through from Jiribam (in Manipur) to Tamu through Imphal and Moreh. The construction of this missing link, as per the feasibility study conducted by the Ministry of External Affairs through RITES Ltd, is estimated to cost . An 18 km railway link with Bhutan is being constructed from Hashimara in West Bengal to Toribari in Bhutan. No rail link exists with either China  or Sri Lanka.\n\nSuburban rail \n\nThe Mumbai Suburban Railway is the first rail system in India which began services in Mumbai in 1853, transports 6.3 million passengers daily and has the highest passenger density in the world. The Kolkata Suburban Railway, was established in Kolkata in 1854.\n\nThe operational suburban rail systems in India are in Mumbai Suburban Railway, Kolkata Suburban Railway, Lucknow-Kanpur Suburban Railway, Chennai Suburban Railway, Delhi Suburban Railway, Pune Suburban Railway, Hyderabad Multi-Modal Transport System, Barabanki-Lucknow Suburban Railway and Pernem-Karwar Suburban Railway.\n\nOther planned systems are Bengaluru Commuter Rail, Ahmedabad Suburban Railway and Coimbatore Suburban Railway.\n\nMetro \n\nThe first modern rapid transit in India is the Kolkata Metro and started its operations in 1984, this is also the 17th Zone of the IR. The Delhi Metro in New Delhi is India's second conventional metro and began operations in 2002. The Namma Metro in Bangalore is India's third operational rapid transit and began operations in 2011.\n\nThe operational systems are Kolkata Metro, Delhi Metro, Hyderabad Metro, Namma Metro, Rapid Metro, Mumbai Metro, Jaipur Metro, Chennai Metro, Kochi Metro and Lucknow Metro.\n\nThe planned systems are Noida Metro, Ghaziabad Metro, Navi Mumbai Metro, Nagpur Metro, Metro-Link Express for Gandhinagar and Ahmedabad, Varanasi Metro, Kanpur Metro, Bareilly Metro, Pune Metro, Vijayawada Metro, Patna Metro, Meerut Metro, Guwahati Metro, Chandigarh Metro, Bhopal Metro, Kozhikode Light Metro, Indore Metro, Thiruvananthapuram Light Metro, Agra Metro, Coimbatore Metro, Visakhapatnam Metro, Dehradun Metro, Surat Metro, Srinagar Metro, Greater Gwalior Metro, Jabalpur Metro and Greater Nashik Metro.\n\nCurrently, rapid transit are under construction or in planning in several major cities of India and will be opened shortly.\n\nMonorail \n\nMonorail is generally considered as feeder system for the Metro trains in India. The Mumbai Monorail, which started in 2014, is the first operational monorail network in India (excluding the Skybus Metro) since the Patiala State Monorail Trainways closed in 1927.\n\nOther planned systems are Chennai Monorail, Kolkata Monorail, Allahabad Monorail, Bengaluru Monorail, Delhi Monorail, Indore Monorail, Kanpur Monorail, Navi Mumbai Monorail, Patna Monorail, Pune Monorail, Ahmedabad Monorail, Aizawl Monorail, Bhubaneswar Monorail, Jodhpur Monorail, Kota Monorail, Nagpur Monorail and Nashik Monorail.\n\nLight rail \n\nLike monorail, light rail is also considered as a feeder system for the Metro systems. \nThe planned systems are Kolkata Light Rail Transit and Delhi Light Rail Transit.\n\nTram \n\nIn addition to trains, trams were introduced in many cities in late 19th century, though almost all of these were phased out. The trams in Kolkata is currently the only tram system in the country and provides an emission-free means of transport in Kolkata while the other tram systems in India were phased out. The nationalised Calcutta Tramways Company is in the process of upgrading the existing tramway network at a cost of .\n\nAir \n\n Directorate General of Civil Aviation is the national regulatory body for the aviation industry. It is controlled by the Ministry of Civil Aviation. The ministry also controls aviation related autonomous organisations like the Airports Authority of India (AAI), Bureau of Civil Aviation Security (BCAS), Indira Gandhi Rashtriya Uran Akademi and Public Sector Undertakings including Air India, Pawan Hans Helicopters Limited and Hindustan Aeronautics Limited.[http://www.civilaviation.gov.in/MocaEx/faces/orgsetup.jspx] \n\nAir India is India's national flag carrier after merging with Indian (airline) in 2011[http://www.airindia.com/SBCMS/Webpages/Fleet-Details1.aspx?MID196#]  and plays a major role in connecting India with the rest of the world. IndiGo, Jet Airways, Air India, Spicejet and GoAir are the major carriers in order of their market share. These airlines connect more than 80 cities across India and also operate overseas routes after the liberalisation of Indian aviation. Several other foreign airlines connect Indian cities with other major cities across the globe. However, a large section of country's air transport potential remains untapped, even though the Mumbai-Delhi air corridor was ranked 10th by Amadeus in 2012 among the world's busiest routes.\n\nAirports \n\nWhile there are 346 civilian airfields in India – 253 with paved runways and 93 with unpaved runways, only 132 were classified as \"airports\" as of November 2014.[http://civilaviation.gov.in/cs/groups/public/documents/newsandupdates/moca_003368.pdf]  Of these, Indira Gandhi International Airport in Delhi is the busiest in the country. The operations of the major airports in India have been privatised over the past 5 years and this has resulted in better equipped and cleaner airports. The terminals have either been refurbished or expanded.\n\nIndia also has 33 \"ghost airports,\" which were built in an effort to make air travel more accessible for those in remote regions but are now non-operational due to a lack of demand. The Jaisalmer Airport in Rajasthan, for example, was completed in 2013 and was expected to host 300,000 passengers a year but has yet to see any commercial flights take off. Despite the number of non-operational airports, India is currently planning on constructing another 200 \"low-cost\" airports over the next 20 years.\n\nHeliports \n\nAs of 2013, there are 45 heliports in India. India also has the world's highest helipad at the Siachen Glacier at a height of 6400 m (21,000 ft) above mean sea level.\n\nEstablished in\n\nPawan Hans Helicopters Limited is a public sector company that provides helicopter services to ONGC to its off-shore locations, and also to various State Governments in India, particularly in North-east India.\n\nWater \n\nIndia has a coastline of 7517 km, and thus ports are the main centres of trade.\n\nIndia also has an extensive network of inland waterways.\n\nPorts and shipping \n\nIn India about 95% of the foreign trade by quantity and 70% by value takes place through the ports. Mumbai Port & JNPT(Navi Mumbai) handles 70% of maritime trade in India. There are twelve major ports: Navi Mumbai, Mumbai, Kochi, Kolkata (including Haldia), Paradip, Visakhapatnam, Ennore, Chennai, Tuticorin, New Mangaluru, Mormugao and Kandla. Other than these, there are 187 minor and intermediate ports, 43 of which handle cargo.\n\nMaritime transportation in India is managed by the Shipping Corporation of India, a government-owned company that also manages offshore and other marine transport infrastructure in the country. It owns and operates about 35% of Indian tonnage and operates in practically all areas of shipping business servicing both national and international trades.The only state which carries three ports in India is Tamil Nadu, they are Ennore, Chennai and Tuticorin.\n\nIt has a fleet of 79 ships of 2750,000 GT (4.8 million DWT) and also manages 53 research, survey and support vessels of 120,000 GT (060,000 DWT) on behalf of various government departments and other organisations. Personnel are trained at the Maritime Training Institute in Mumbai, a branch of the World Maritime University, which was set up in 1987. The Corporation also operates in Malta and Iran through joint ventures.\n\nThe distinction between major and minor ports is not based on the amount of cargo handled. The major ports are managed by port trusts which are regulated by the central government. They come under the purview of the Major Port Trusts Act, 1963.Chandnani, Lajpat Ray. General Insurance, Reinsurance and Risk Management Glossary. Notion Press (2017). The minor ports are regulated by the respective state governments and many of these ports are private ports or captive ports. The total amount of traffic handled at the major ports in 2005–2006 was 382.33 Mt.\n\nWaterways \n\nIndia has an extensive network of inland waterways in the form of rivers, canals, backwaters and creeks. The total navigable length is 14500 km, out of which about 5200 km of river and 485 km of canals can be used by mechanised crafts. Freight transport by waterways is highly underutilised in India compared to other large countries. The total cargo moved by inland waterways is just 0.15% of the total inland traffic in India, compared to the corresponding figures of 20% for Germany and 32% for Bangladesh.\n\nCargo that is transported in an organised manner is confined to a few waterways in Goa, West Bengal, Assam and Kerala. The Inland Waterways Authority of India (IWAI) is the statutory authority in charge of the waterways in India. It does the function of building the necessary infrastructure in these waterways, surveying the economic feasibility of new projects and also administration and regulation. The following waterways have been declared as National Waterways:\n\n* National Waterway 1: Allahabad–Haldia stretch of the Ganga – Bhagirathi – Hooghly river system with a total length of 1620 km in October 1986.\n* National Waterway 2: Saidiya–Dhubri stretch of the Brahmaputra river system with a total length of 891 km in 1988.\n* National Waterway 3: Kollam–Kottapuram stretch of the West Coast Canal along with Champakara and Udyogmandal canals, with a total length of 205 km in 1993.\n* National Waterway 4: Bhadrachalam–Rajahmundry and Wazirabad–Vijaywada stretch of the Krishna–Godavari river system along with the Kakinada–Pondicherry canal network, with a total length of 1095 km in 2007.\n* National Waterway 5: Mangalgadi–Paradeep and Talcher–Dhamara stretch of the Mahanadi–Brahmani river system along with the East Coast Canal, with a total length of 623 km in 2007.\n\nPipelines \n\nOil and gas industry in India imports 82% of its oil needs and aims to bring that down to 67% by 2022 by replacing it with local exploration, renewable energy and indigenous ethanol fuel (c. Jan 2018).[http://economictimes.indiatimes.com/articleshow/62557212.cms?utm_source\ncontentofinterest&utm_mediumtext&utm_campaign\ncppst India launches first auction of exploration blocks under new licensing policy], Economic Times, 18 Jan 2018. \n\n* Length of pipelines for crude oil is 20000 km.\n* Length of Petroleum products pipeline is 15000 km.\n\nLogistics\n\nLogistics in India ranking moved up to 35th place in 2016 from 54th in 2014 on World Bank's Global Logistics Performance Index. Government strategy aims to raise the share of global trade in India's GDP (US$2.7 trillion in FY 2017-18)[http://economictimes.indiatimes.com/articleshow/62551522.cms?utm_sourcecontentofinterest&utm_medium\ntext&utm_campaigncppst If I were FM: Raamdeo proposes asset-light strategy for infra boost], Economic Times, 18 Jan 2018. to 40%, including half of it (20% of GDP) from exports (c. Jan 2018). Cost of logistics in India is 14% of GDP, which is higher than the developed nations, and government reforms aim to bring it down to 10% of GDP by 2022 (c. Jan 2018). Ministry of Commerce and Industry has created a new dedicated centralised Logistics division in collaboration with Singapore and Japan to handle the logistics which was earlier handled by several different ministries, such railways, roads, shipping and aviation.[https://economictimes.indiatimes.com/industry/transportation/shipping-/-transport/we-are-creating-a-digital-logistics-platform-suresh-prabhu/articleshow/62395534.cmsWe are creating a digital logistics platform: Suresh Prabhu], Economic Times, 6 Jan 2018. To boot exports, each state will have exports and logistic policy and Nodal officers will be appointed at district level (c. Jan 2018).[https://m.dailyhunt.in/news/india/english/investment+guru+india-epaper-invgur/districts+to+be+export+units+looking+at+logistics+ministry+suresh+prabhu-newsid-79500101 Districts to be export units, looking at logistics ministry: Suresh Prabhu ], Daily Hunt, 8 Jan 2018. There are 64 transactions and 37 government agencies in the end-to-end production-to-export process. To further improve the ranking, improve speed of logistics, ease of doing business and reduce the cost of logistics, India is creating a \"common online integrated logistics e-marketplace portal\" that will cover all transactions in production and export, connect buyers with logistics service providers and government agencies such as the customs department Icegate system, Port Community Systems, Sea and Air Port terminals, Shipping lines, Railways, etc. (c. Jan 2018).[http://economictimes.indiatimes.com/articleshow/62530347.cms?utm_sourcecontentofinterest&utm_medium\ntext&utm_campaign=cppst India plans common logistics portal to ease movement of goods, reduce logistics cost], Economic Times, 17 Jan 2018. \n\nAs part of the US$125 billion port-led development project Sagarmala, government will define the regulatory framework for the Indian logistics operational standards by benchmarking India's 300 dry ports logistics parks (inland container depots or ICDs) to the top 10 logistics international best practices nations to boost exports, remove supply chain bottle necks, reduce transaction costs, optimise logistics mix, set up new hub-and-spoke dry ports (c. Jan 2018).[http://economictimes.indiatimes.com/articleshow/62435028.cms?utm_source\ncontentofinterest&utm_mediumtext&utm_campaign\ncppst Government plans to overhaul 300 dry ports], Economic Times, 9 Jan 2018. To reduce the logistics costs by 10% and C02 emissions by 12%, the government is also developing 35 new \"Multimodal Logistics Parks\" (MMLPs) on 36 ring roads, which will facilitate 50% of the freight moved in India. Land has been earmarked and pre-feasibility study is underway for 6 of these MMLPs (c. May 2017).[http://www.business-standard.com/article/news-ians/government-to-construct-35-multimodal-logistics-parks-gadkari-117050300905_1.html Government to construct 35 multimodal logistics parks: Gadkari], Business Standards, 3 May 2017.\n\nConfederation of Indian Industry (CII) and government will organise an annual National Logistics convention. Major supply chain solution providers include Container Corporation of India and Transport Corporation of India, and magazine Logistics Management India magazine is one of the industry publication.\n\nEnvironmental issues and impact \n\nThe National capital New Delhi has one of the largest CNG based transport systems as a part of the drive to bring down pollution. In spite of these efforts it remains the largest contributor to the greenhouse gas emissions in the city. The CNG Bus manufacturers in India are Ashok Leyland, Tata Motors, Swaraj Mazda and Hindustan Motors.\n\nIn 1998, the Supreme Court of India published a Directive that specified the date of April 2001 as deadline to replace or convert all buses, three-wheelers and taxis in Delhi to compressed natural gas.\n\nThe Karnataka State Road Transport Corporation was the first State Transport Undertaking in India to utilise bio-fuels and ethanol-blended fuels. KSRTC took an initiative to do research in alternative fuel forms by experimenting with various alternatives— blending diesel with biofuels such as honge, palm, sunflower, groundnut, coconut and sesame. In 2009, the corporation decided to promote the use of biofuel buses.\n\nIn 2017, the government announced that by 2030, only electric vehicles would be sold in the country. It also announced that by 2022 all trains would be electric trains. Transport in India. http://en.wikipedia.org/?curid=14602."
  }
}
