{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8824",
  "eid" : "eab21af0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778473503,
  "textBody" : "The division of labour is the separation of tasks in any  system so that participants may specialize.  Individuals, organisations, and nations are endowed with or acquire specialized capabilities and either form combinations or trade to take advantage of the capabilities of others in addition to their own. Specialized capabilities may include equipment or natural resources in addition to skills and training and complex combinations of such assets are often important, as when multiple items of specialized equipment and skilled operators are used to produce a single product. The division of labour is the motive for trade and the source of economic interdependence.\n\nBecause of the large amount of labour saved by giving workers specialized tasks in Industrial Revolution-era factories, some classical economists as well as some mechanical engineers such as Charles Babbage were proponents of division of labour. Also, having workers perform single or limited tasks eliminated the long training period required to train craftsmen, who were replaced with lesser paid but more productive unskilled workers.\n\n Historically, an increasing division of labour is associated with the growth of total output and trade, the rise of capitalism, and the increasing complexity of industrialised processes. The concept and implementation of division of labour has been observed in ancient Sumerian (Mesopotamian) culture, where assignment of jobs in some cities coincided with an increase in trade and economic interdependence. Division of labour generally also increases both producer and individual worker productivity.\n\nIn contrast to division of labour, division of work refers to the division of a large task, contract, or project into smaller tasks—each with a separate schedule within the overall project schedule. Division of labour, instead, refers to the allocation of tasks to individuals or organizations according to the skills and/or equipment those people or organizations possess. Often division of labour and division of work are both part of the economic activity within an industrial nation or organization.\n\nTheorists \n\nPlato \n\nIn Plato's Republic, the origin of the state lies in the natural inequality of humanity, which is embodied in the division of labour.\n\nSilvermintz notes that, \"Historians of economic thought credit Plato, primarily on account of arguments advanced in his Republic, as an early proponent of the division of labour.\" Notwithstanding this, Silvermintz argues that, \"While Plato recognizes both the economic and political benefits of the division of labour, he ultimately critiques this form of economic arrangement insofar as it hinders the individual from ordering his own soul by cultivating acquisitive motives over prudence and reason.\"\n\nXenophon \n\nXenophon, in the fourth century BC, makes a passing reference to division of labour in his 'Cyropaedia' (a.k.a. Education of Cyrus).\n\nIbn Khaldun\n\nThe 14th-century scholar Ibn Khaldun emphasised the importance of the division of labour in the production process. In his Muqaddimah, he states:\n\nWilliam Petty \n\nSir William Petty was the first modern writer to take note of division of labour, showing its existence and usefulness in Dutch shipyards. Classically the workers in a shipyard would build ships as units, finishing one before starting another. But the Dutch had it organized with several teams each doing the same tasks for successive ships. People with a particular task to do must have discovered new methods that were only later observed and justified by writers on political economy.\n\nPetty also applied the principle to his survey of Ireland. His breakthrough was to divide up the work so that large parts of it could be done by people with no extensive training.\n\nBernard de Mandeville \n\nBernard de Mandeville discusses the matter in the second volume of The Fable of the Bees (1714).  This elaborates many matters raised by the original poem about a 'Grumbling Hive'. He says:\n\nDavid Hume \n\nHenri-Louis Duhamel du Monceau \n\nIn his introduction to Art de l'Épinglier [The Art of the Pin-Maker] (1761),R. Réaumur and A. de Ferchault. Art de l'Épinglier avec des additions de M. Duhamel du Monceau et des remarques extraites des mémoires de M. Perronet, inspecteur général des Ponts et Chaussées. Paris, Saillant et Nyon, 1761. Henri-Louis Duhamel du Monceau writes about the \"division of this work\":Scan of the text of \"l'Art de l'Épinglier\", with the expression \"division de ce travail\".\n\nBy \"division of this work\", Duhamel du Monceau is referring to the subdivisions of the text describing the various trades involved in the pin making activity; this can also be described as division of labour.\n\nAdam Smith \n\nIn the first sentence of An Inquiry into the Nature and Causes of the Wealth of Nations (1776), Adam Smith foresaw the essence of industrialism by determining that division of labour represents a quantitative increase in productivity. Like du Monceau, his example was the making of pins. Unlike Plato, Smith famously argued that the difference between a street porter and a philosopher was as much a consequence of the division of labour as its cause. Therefore, while for Plato the level of specialization determined by the division of labour was externally determined, for Smith it was the dynamic engine of economic progress.  However, in a further chapter of the same book Smith criticizes the division of labour saying it can lead to \"the almost entire corruption and degeneracy of the great body of the people. … unless government takes some pains to prevent it.\"\"The man whose whole life is spent in performing a few simple operations, of which the effects are perhaps always the same, or very nearly the same, has no occasion to exert his understanding or to exercise his invention in finding out expedients for removing difficulties which never occur. He naturally loses, therefore, the habit of such exertion, and generally becomes as stupid and ignorant as it is possible for a human creature to become. The torpor of his mind renders him not only incapable of relishing or bearing a part in any rational conversation, but of conceiving any generous, noble, or tender sentiment, and consequently of forming any just judgement concerning many even of the ordinary duties of private life... But in every improved and civilized society this is the state into which the labouring poor, that is, the great body of the people, must necessarily fall, unless government takes some pains to prevent it.\", An Inquiry into the Nature and Causes of the Wealth of Nations (1776), Adam Smith The contradiction has led to some debate over Smith's opinion of the division of labour. Alexis de Tocqueville agreed with Smith: \"Nothing tends to materialize man, and to deprive his work of the faintest trace of mind, more than extreme division of labor.\" Adam Ferguson shared similar views to Smith, though was generally more negative.\n\nThe specialization and concentration of the workers on their single subtasks often leads to greater skill and greater productivity on their particular subtasks than would be achieved by the same number of workers each carrying out the original broad task.\n\nSmith saw the importance of matching skills with equipment – usually in the context of an organization.  For example, pin makers were organized with one making the head, another the body, each using different equipment.  Similarly he emphasised a large number of skills, used in cooperation and with suitable equipment, were required to build a ship.\n\nIn modern economic discussion, the term human capital would be used.  Smith's insight suggests that the huge increases in productivity obtainable from technology or technological progress are possible because human and physical capital are matched, usually in an organization. See also a short discussion of Adam Smith's theory in the context of business processes.\n\nBabbage wrote a seminal work \"On the Economy of Machinery and Manufactures\" analyzing perhaps for the first time the division of labour in factories.\n\nImmanuel Kant \n\nIn the Groundwork of the Metaphysics of morals 1785, Kant notes the value of the division of labour:All crafts, trades and arts have profited from the division of labour; for when each worker sticks to one particular kind of work that needs to be handled differently from all the others, he can do it better and more easily than when one person does everything. Where work is not thus differentiated and divided, where everyone is a jack-of-all-trades, the crafts remain at an utterly primitive level.\n\nKarl Marx \n\nMarx argued that increasing the specialization may also lead to workers with poorer overall skills and a lack of enthusiasm for their work. He described the process as alienation: workers become more and more specialized and work becomes repetitive, eventually leading to complete alienation from the process of production. The worker then becomes \"depressed spiritually and physically to the condition of a machine\".Economic and Philosophical Manuscripts, 1844, First Manuscript, in T.B. Bottomore, Karl Marx Early Writings, C.A. Watts and Co. Ltd., London, 1963, p. 72\n\nAdditionally, Marx argued that division of labour creates less-skilled workers. As the work becomes more specialized, less training is needed for each specific job, and the workforce, overall, is less skilled than if one worker did one job entirely.Wage Labor & Capital\n\nAmong Marx's theoretical contributions is his sharp distinction between the economic and the social division of labor.Marx, K. (1977). Capital: A Critique of Political Economy, Volume 1. New York: Vintage Books, pp. 781–94. That is, some forms of labour co-operation are purely due to \"technical necessity\", but others are a result of a \"social control\" function related to a class and status hierarchy. If these two divisions are conflated, it might appear as though the existing division of labour is technically inevitable and immutable, rather than (in good part) socially constructed and influenced by power relationships. He also argues that in a communist society, the division of labour is transcended, meaning that balanced human development occurs where people fully express their nature in the variety of creative work that they do.Ali Rattansi: Marx and the Division of Labor (Macmillan, 1982)\n\nHenry David Thoreau \n\nHenry David Thoreau criticized the division of labour in Walden (published in 1854), on the basis that it removes people from a sense of connectedness with society and with the world at large, including nature. He claimed that the average man in a civilized society is less wealthy, in practice, than one in a \"savage\" society. The answer he gave was that self-sufficiency was enough to cover one's basic needs.\n\nThoreau's friend and mentor, Ralph Waldo Emerson, criticized the division of labour in \"The American Scholar\"; a widely informed, holistic citizenry is vital for the spiritual and physical health of the country.\n\nÉmile Durkheim \n\nIn his seminal work, The Division of Labor in Society, Émile Durkheim observes that the division of labour appears in all societies and positively correlates with societal advancement because it increases as a society progresses. Durkheim arrived at the same conclusion regarding the positive effects of the division of labour as his theoretical predecessor, Adam Smith.  In The Wealth of the Nations, Smith observes the division of labour results in \"a proportionable [sic] increase of the productive powers of labor.\"Smith, Adam. The Wealth of Nations.  Baltimore: Penguin Books, 1970.  While they shared this belief, Durkheim believed the division of labour applied to all \"biological organisms generally\" while Smith believed this law applied \"only to human societies.\"Jones, Robert. Emile Durkheim: An Introduction to Four Major Works. Beverly Hills, CA: Sage Publications, Inc., 1986. Print.  This difference may result from the influence of Charles Darwin’s On the Origin of Species on Durkheim’s writings.  For example, Durkheim observed an apparent relationship between \"the functional specialization of the parts of an organism\" and \"the extent of that organism's evolutionary development,\" which he believed \"extended the scope of the division of labour so as to make its origins contemporaneous with the origins of life itself…implying that its conditions must be found in the essential properties of all organized matter.\"\n\nSince Durkheim’s division of labour applied to all organisms, he considered it a \"natural law\" and worked to determine whether it should be embraced or resisted by first analysing its functions.  Durkheim hypothesized that the division of labour fosters social solidarity, yielding \"a wholly moral phenomenon\" that ensures \"mutual relationships\" among individuals.Durkheim, Emile. The Division of Labor in Society.  New York: The Free Press, 1997. Print.\n\nAs social solidarity cannot be directly quantified, Durkheim indirectly studies solidarity by \"classify[ing] the different types of law to find...the different types of social solidarity which correspond to it.\" Durkheim categorizes: criminal laws and their respective punishments as promoting mechanical solidarity, a sense of unity resulting from individuals engaging in similar work who hold shared backgrounds, traditions, and values;Anderson, Margaret L. and Taylor, Howard F. Sociology: Understanding a Diverse Society. Belmont, CA: Thomson Wadsworth, 2008. Print. and civil laws as promoting organic solidarity, a society in which individuals engage in different kinds of work that benefit society and other individuals.  Durkheim believes that organic solidarity prevails in more advanced societies, while mechanical solidarity typifies less developed societies.Moody, James.  Sociology 138: Theory and Society. Department of Sociology, Duke University, n.d. Web. 16 November 2012.  He explains that, in societies with more mechanical solidarity, the diversity and division of labour is much less, so individuals have a similar worldview.  Similarly, Durkheim opines that in societies with more organic solidarity, the diversity of occupations is greater, and individuals depend on each other more, resulting in greater benefits to society as a whole.\n\nDurkheim’s work enabled social science to progress more efficiently \"in … the understanding of human social behavior.\"\n\nLudwig von Mises \n\nMarx's theories, including the negative claims regarding the division of labour have been criticized by the Austrian economists such as Ludwig von Mises.\n\nThe main argument here is the economic gains accruing from the division of labour far outweigh the costs. It is argued that it is fully possible to achieve balanced human development within capitalism, and alienation is downplayed as mere romantic fiction.\n\nFriedrich A. Hayek \n\nIn The Use of Knowledge in Society, Friedrich A. Hayek states:\n\nGlobalization and global division of labour \n\nThe issue reaches its broadest scope in the controversies about globalization, which is often interpreted as a euphemism for the expansion of world trade based on comparative advantage.\nThis would mean that countries specialize in the work they can do at the lowest relative cost measured in terms of the opportunity cost of not using resources for other work, compared to the opportunity costs experienced by other countries. Critics, however, allege that international specialization cannot be explained sufficiently in terms of \"the work nations do best\", rather this specialization is guided more by commercial criteria, which favour some countries over others.\n\nThe OECD recently advised (28 June 2005) that:\n\nFew studies have taken place regarding the global division of labour.  Information can be drawn from ILO and national statistical offices.\n\nIn one study, Deon Filmer estimated that 2.474 billion people participated in the global non-domestic labour force in the mid-1990s. Of these,\n* around 15%, or 379 million people, worked in industry,\n* a third, or 800 million worked in services, and\n* over 40%, or 1,074 million, in agriculture.\n\nThe majority of workers in industry and services were wage and salary earners – 58 percent of the industrial workforce and 65 percent of the services workforce. But a big portion were self-employed or involved in family labour. Filmer suggests the total of employees worldwide in the 1990s was about 880 million, compared with around a billion working on own account on the land (mainly peasants), and some 480 million working on own account in industry and services. The 2007 ILO Global Employment Trends Report indicated that services have surpassed agriculture for the first time in human history: \"In 2006 the service sector’s share of global employment overtook agriculture for the first time, increasing from 39.5 per cent to 40 per cent. Agriculture decreased from 39.7 per cent to 38.7 per cent. The industry sector accounted for 21.3 per cent of total employment.\"\n\nModern debates \n\nIn the modern world, those specialists most preoccupied in their work with theorizing about the division of labour are those involved in management and organization. In view of the global extremities of the division of labour, the question is often raised about what division of labour would be most ideal, beautiful, efficient and just.\n\nTwo styles of management that are seen in modern organizations are control and commitment, control being the division of labour style of the past and commitment being the style of the future. Control management is based on the principles of job specialization and the division of labour. This is the assembly line style of job specialization where employees are given a very narrow set of tasks or one specific task. Commitment division of labour is oriented on including the employee and building a level of internal commitment towards accomplishing tasks. Tasks include more responsibility and are coordinated based on expertise rather than formal position.McAlister-Kizzier, Donna. \"Division of Labor.\"  Encyclopedia of Business and Finance, 2nd ed.. 2007. Encyclopedia.com. 1 Dec. 2014 http://www.encyclopedia.com\n\nJob specialization is advantageous in developing employee expertise in a field and boosting organizational production. However, disadvantages of job specialization included limited employee skill, a dependence on entire department fluency, and employee discontent with repetitious tasks.\n\nIt is widely accepted that the division of labour is to a great extent inevitable, simply because no one can do all tasks at once. Labour hierarchy is a very common feature of the modern workplace structure, but of course the way these hierarchies are structured can be influenced by a variety of different factors.\n\nSize, cost, and the development of new technology are factors that have influenced job specialization structures in the modern workplace. The cost of job specialization is what limits small organizations from dividing their labour responsibilities, but as organizations increase in size there is a correlation in the rise of division of labour. Technological developments have led to a decrease in the amount of job specialization in organizations as new technology makes it easier for fewer employees to accomplish a variety of tasks and still enhance production. New technology has also been supportive in the flow of information between departments helping to reduce the feeling of department isolation.\n\nIt is often agreed that the most equitable principle in allocating people within hierarchies is that of true (or proven) competency or ability. This important concept of meritocracy could be read as an explanation or as a justification of why a division of labour is the way it is.\n\nIn general, in capitalist economies, such things are not decided consciously.  Different people try different things, and that which is most effective cost-wise (produces the most and best output with the least input) will generally be adopted.  Often techniques that work in one place or time do not work as well in another.  This does not present a problem, as the only requirement of a capitalist system is that you turn a profit.\n\nLimitations\n\nAdam Smith famously said in The Wealth of Nations that the division of labour is limited by the extent of the market. This is because it is by exchange that each person can be specialized in their work and yet still have access to a wide range of goods and services. Hence, reductions in barriers to exchange lead to increases in the division of labour and so help to drive economic growth. Limitations to the division of labour have also been related to coordination and transportation costs.\n\nThere can be motivational advantages to a reduced division of labour (which has been termed ‘job enlargement’ and 'job enrichment'). Jobs that are too specialized in a narrow range of tasks are said to result in demotivation due to boredom and alienation. Hence, a Taylorist approach to work design contributed to worsened industrial relations.\n\nThere are also limitations to the division of labour (and the division of work) that result from work-flow variations and uncertainties.[http://nrs.harvard.edu/urn-3:HUL.InstRepos:12274210], Barrera, Catherine Grace (2014). Skill, Job Design, and the Labor Market under Uncertainty. Doctoral dissertation, Harvard University These help to explain issues in modern work organization, such as task consolidations in business process reengineering and the use of multi-skilled work teams. For instance, one stage of a production process may temporarily work at a slower pace, forcing other stages to slow down. One answer to this is to make some portion of resources mobile between stages, so that those resources must be capable of undertaking a wider range of tasks. Another is to consolidate tasks so that they are undertaken one after another by the same workers and other resources. Stocks between stages can also help to reduce the problem to some extent but are costly and can hamper quality control. Note also that modern flexible manufacturing systems require both flexible machines and flexible workers.\n\nIn project-based work, the coordination of resources is a difficult issue for the project manager as project schedules and resulting resource bookings are based on estimates of task durations and so are subject to subsequent revisions. Again, consolidating tasks so that they are undertaken consecutively by the same resources and having resources available that can be called on at short-notice from other tasks can help to reduce such problems, though at the cost of reduced specialisation.\n\nThere are also advantages in a reduced division of labour where knowledge would otherwise have to be transferred between stages. For example, having a single person deal with a customer query means that only that one person has to be familiarised with the customer’s details. It is also likely to result in the query being handled faster due to the elimination of delays in passing the query between different people.\n\nGendered division of labour \n\nThe clearest exposition of the principles of sexual division of labour across the full range of human societies can be summarized by a large number of logically complementary implicational constraints of the following form: if women of childbearing ages in a given community tend to do X (e.g., preparing soil for planting) they will also do Y (e.g., the planting) while for men the logical reversal in this example would be that if men plant they will prepare the soil. \"Entailment Theory and Method: A Cross-Cultural Analysis of the Sexual Division of Labor\"[http://eclectic.ss.uci.edu/~drwhite/pub/Entail77.pdf eclectic.ss.uci.edu] by White, Brudner and Burton (1977, public domain), using statistical entailment analysis, shows that tasks more frequently chosen by women in these order relations are those more convenient in relation to childrearing. This type of finding has been replicated in a variety of studies, including modern industrial economies. These entailments do not restrict how much work for any given task could be done by men (e.g., in cooking) or by women (e.g., in clearing forests) but are only least-effort or role-consistent tendencies. To the extent that women clear forests for agriculture, for example, they tend to do the entire agricultural sequence of tasks on those clearings. In theory, these types of constraints could be removed by provisions of child care, but ethnographic examples are lacking.\n\nIndustrial organizational psychology \n\nJob satisfaction has been shown to improve as an employee is given the task of a specific job. Students who have received PhDs in a chosen field later report increased satisfaction compared to their previous jobs. This can be attributed to their high levels of specialization. The higher the training needed for the specialized job position, the higher is the level of job satisfaction as well, although many highly specialized jobs can be monotonous and produce high rates of burn out periodically.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Division of labour" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8824" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The division of labour is the separation of tasks in any  system so that participants may specialize.  Individuals, organisations, and nations are endowed with or acquire specialized capabilities and either form combinations or trade to take advantage of the capabilities of others in addition to their own. Specialized capabilities may include equipment or natural resources in addition to skills and training and complex combinations of such assets are often important, as when multiple items of specialized equipment and skilled operators are used to produce a single product. The division of labour is the motive for trade and the source of economic interdependence.\n\nBecause of the large amount of labour saved by giving workers specialized tasks in Industrial Revolution-era factories, some classical economists as well as some mechanical engineers such as Charles Babbage were proponents of division of labour. Also, having workers perform single or limited tasks eliminated the long training period required to train craftsmen, who were replaced with lesser paid but more productive unskilled workers.\n\n Historically, an increasing division of labour is associated with the growth of total output and trade, the rise of capitalism, and the increasing complexity of industrialised processes. The concept and implementation of division of labour has been observed in ancient Sumerian (Mesopotamian) culture, where assignment of jobs in some cities coincided with an increase in trade and economic interdependence. Division of labour generally also increases both producer and individual worker productivity.\n\nIn contrast to division of labour, division of work refers to the division of a large task, contract, or project into smaller tasks—each with a separate schedule within the overall project schedule. Division of labour, instead, refers to the allocation of tasks to individuals or organizations according to the skills and/or equipment those people or organizations possess. Often division of labour and division of work are both part of the economic activity within an industrial nation or organization.\n\nTheorists \n\nPlato \n\nIn Plato's Republic, the origin of the state lies in the natural inequality of humanity, which is embodied in the division of labour.\n\nSilvermintz notes that, \"Historians of economic thought credit Plato, primarily on account of arguments advanced in his Republic, as an early proponent of the division of labour.\" Notwithstanding this, Silvermintz argues that, \"While Plato recognizes both the economic and political benefits of the division of labour, he ultimately critiques this form of economic arrangement insofar as it hinders the individual from ordering his own soul by cultivating acquisitive motives over prudence and reason.\"\n\nXenophon \n\nXenophon, in the fourth century BC, makes a passing reference to division of labour in his 'Cyropaedia' (a.k.a. Education of Cyrus).\n\nIbn Khaldun\n\nThe 14th-century scholar Ibn Khaldun emphasised the importance of the division of labour in the production process. In his Muqaddimah, he states:\n\nWilliam Petty \n\nSir William Petty was the first modern writer to take note of division of labour, showing its existence and usefulness in Dutch shipyards. Classically the workers in a shipyard would build ships as units, finishing one before starting another. But the Dutch had it organized with several teams each doing the same tasks for successive ships. People with a particular task to do must have discovered new methods that were only later observed and justified by writers on political economy.\n\nPetty also applied the principle to his survey of Ireland. His breakthrough was to divide up the work so that large parts of it could be done by people with no extensive training.\n\nBernard de Mandeville \n\nBernard de Mandeville discusses the matter in the second volume of The Fable of the Bees (1714).  This elaborates many matters raised by the original poem about a 'Grumbling Hive'. He says:\n\nDavid Hume \n\nHenri-Louis Duhamel du Monceau \n\nIn his introduction to Art de l'Épinglier [The Art of the Pin-Maker] (1761),R. Réaumur and A. de Ferchault. Art de l'Épinglier avec des additions de M. Duhamel du Monceau et des remarques extraites des mémoires de M. Perronet, inspecteur général des Ponts et Chaussées. Paris, Saillant et Nyon, 1761. Henri-Louis Duhamel du Monceau writes about the \"division of this work\":Scan of the text of \"l'Art de l'Épinglier\", with the expression \"division de ce travail\".\n\nBy \"division of this work\", Duhamel du Monceau is referring to the subdivisions of the text describing the various trades involved in the pin making activity; this can also be described as division of labour.\n\nAdam Smith \n\nIn the first sentence of An Inquiry into the Nature and Causes of the Wealth of Nations (1776), Adam Smith foresaw the essence of industrialism by determining that division of labour represents a quantitative increase in productivity. Like du Monceau, his example was the making of pins. Unlike Plato, Smith famously argued that the difference between a street porter and a philosopher was as much a consequence of the division of labour as its cause. Therefore, while for Plato the level of specialization determined by the division of labour was externally determined, for Smith it was the dynamic engine of economic progress.  However, in a further chapter of the same book Smith criticizes the division of labour saying it can lead to \"the almost entire corruption and degeneracy of the great body of the people. … unless government takes some pains to prevent it.\"\"The man whose whole life is spent in performing a few simple operations, of which the effects are perhaps always the same, or very nearly the same, has no occasion to exert his understanding or to exercise his invention in finding out expedients for removing difficulties which never occur. He naturally loses, therefore, the habit of such exertion, and generally becomes as stupid and ignorant as it is possible for a human creature to become. The torpor of his mind renders him not only incapable of relishing or bearing a part in any rational conversation, but of conceiving any generous, noble, or tender sentiment, and consequently of forming any just judgement concerning many even of the ordinary duties of private life... But in every improved and civilized society this is the state into which the labouring poor, that is, the great body of the people, must necessarily fall, unless government takes some pains to prevent it.\", An Inquiry into the Nature and Causes of the Wealth of Nations (1776), Adam Smith The contradiction has led to some debate over Smith's opinion of the division of labour. Alexis de Tocqueville agreed with Smith: \"Nothing tends to materialize man, and to deprive his work of the faintest trace of mind, more than extreme division of labor.\" Adam Ferguson shared similar views to Smith, though was generally more negative.\n\nThe specialization and concentration of the workers on their single subtasks often leads to greater skill and greater productivity on their particular subtasks than would be achieved by the same number of workers each carrying out the original broad task.\n\nSmith saw the importance of matching skills with equipment – usually in the context of an organization.  For example, pin makers were organized with one making the head, another the body, each using different equipment.  Similarly he emphasised a large number of skills, used in cooperation and with suitable equipment, were required to build a ship.\n\nIn modern economic discussion, the term human capital would be used.  Smith's insight suggests that the huge increases in productivity obtainable from technology or technological progress are possible because human and physical capital are matched, usually in an organization. See also a short discussion of Adam Smith's theory in the context of business processes.\n\nBabbage wrote a seminal work \"On the Economy of Machinery and Manufactures\" analyzing perhaps for the first time the division of labour in factories.\n\nImmanuel Kant \n\nIn the Groundwork of the Metaphysics of morals 1785, Kant notes the value of the division of labour:All crafts, trades and arts have profited from the division of labour; for when each worker sticks to one particular kind of work that needs to be handled differently from all the others, he can do it better and more easily than when one person does everything. Where work is not thus differentiated and divided, where everyone is a jack-of-all-trades, the crafts remain at an utterly primitive level.\n\nKarl Marx \n\nMarx argued that increasing the specialization may also lead to workers with poorer overall skills and a lack of enthusiasm for their work. He described the process as alienation: workers become more and more specialized and work becomes repetitive, eventually leading to complete alienation from the process of production. The worker then becomes \"depressed spiritually and physically to the condition of a machine\".Economic and Philosophical Manuscripts, 1844, First Manuscript, in T.B. Bottomore, Karl Marx Early Writings, C.A. Watts and Co. Ltd., London, 1963, p. 72\n\nAdditionally, Marx argued that division of labour creates less-skilled workers. As the work becomes more specialized, less training is needed for each specific job, and the workforce, overall, is less skilled than if one worker did one job entirely.Wage Labor & Capital\n\nAmong Marx's theoretical contributions is his sharp distinction between the economic and the social division of labor.Marx, K. (1977). Capital: A Critique of Political Economy, Volume 1. New York: Vintage Books, pp. 781–94. That is, some forms of labour co-operation are purely due to \"technical necessity\", but others are a result of a \"social control\" function related to a class and status hierarchy. If these two divisions are conflated, it might appear as though the existing division of labour is technically inevitable and immutable, rather than (in good part) socially constructed and influenced by power relationships. He also argues that in a communist society, the division of labour is transcended, meaning that balanced human development occurs where people fully express their nature in the variety of creative work that they do.Ali Rattansi: Marx and the Division of Labor (Macmillan, 1982)\n\nHenry David Thoreau \n\nHenry David Thoreau criticized the division of labour in Walden (published in 1854), on the basis that it removes people from a sense of connectedness with society and with the world at large, including nature. He claimed that the average man in a civilized society is less wealthy, in practice, than one in a \"savage\" society. The answer he gave was that self-sufficiency was enough to cover one's basic needs.\n\nThoreau's friend and mentor, Ralph Waldo Emerson, criticized the division of labour in \"The American Scholar\"; a widely informed, holistic citizenry is vital for the spiritual and physical health of the country.\n\nÉmile Durkheim \n\nIn his seminal work, The Division of Labor in Society, Émile Durkheim observes that the division of labour appears in all societies and positively correlates with societal advancement because it increases as a society progresses. Durkheim arrived at the same conclusion regarding the positive effects of the division of labour as his theoretical predecessor, Adam Smith.  In The Wealth of the Nations, Smith observes the division of labour results in \"a proportionable [sic] increase of the productive powers of labor.\"Smith, Adam. The Wealth of Nations.  Baltimore: Penguin Books, 1970.  While they shared this belief, Durkheim believed the division of labour applied to all \"biological organisms generally\" while Smith believed this law applied \"only to human societies.\"Jones, Robert. Emile Durkheim: An Introduction to Four Major Works. Beverly Hills, CA: Sage Publications, Inc., 1986. Print.  This difference may result from the influence of Charles Darwin’s On the Origin of Species on Durkheim’s writings.  For example, Durkheim observed an apparent relationship between \"the functional specialization of the parts of an organism\" and \"the extent of that organism's evolutionary development,\" which he believed \"extended the scope of the division of labour so as to make its origins contemporaneous with the origins of life itself…implying that its conditions must be found in the essential properties of all organized matter.\"\n\nSince Durkheim’s division of labour applied to all organisms, he considered it a \"natural law\" and worked to determine whether it should be embraced or resisted by first analysing its functions.  Durkheim hypothesized that the division of labour fosters social solidarity, yielding \"a wholly moral phenomenon\" that ensures \"mutual relationships\" among individuals.Durkheim, Emile. The Division of Labor in Society.  New York: The Free Press, 1997. Print.\n\nAs social solidarity cannot be directly quantified, Durkheim indirectly studies solidarity by \"classify[ing] the different types of law to find...the different types of social solidarity which correspond to it.\" Durkheim categorizes: criminal laws and their respective punishments as promoting mechanical solidarity, a sense of unity resulting from individuals engaging in similar work who hold shared backgrounds, traditions, and values;Anderson, Margaret L. and Taylor, Howard F. Sociology: Understanding a Diverse Society. Belmont, CA: Thomson Wadsworth, 2008. Print. and civil laws as promoting organic solidarity, a society in which individuals engage in different kinds of work that benefit society and other individuals.  Durkheim believes that organic solidarity prevails in more advanced societies, while mechanical solidarity typifies less developed societies.Moody, James.  Sociology 138: Theory and Society. Department of Sociology, Duke University, n.d. Web. 16 November 2012.  He explains that, in societies with more mechanical solidarity, the diversity and division of labour is much less, so individuals have a similar worldview.  Similarly, Durkheim opines that in societies with more organic solidarity, the diversity of occupations is greater, and individuals depend on each other more, resulting in greater benefits to society as a whole.\n\nDurkheim’s work enabled social science to progress more efficiently \"in … the understanding of human social behavior.\"\n\nLudwig von Mises \n\nMarx's theories, including the negative claims regarding the division of labour have been criticized by the Austrian economists such as Ludwig von Mises.\n\nThe main argument here is the economic gains accruing from the division of labour far outweigh the costs. It is argued that it is fully possible to achieve balanced human development within capitalism, and alienation is downplayed as mere romantic fiction.\n\nFriedrich A. Hayek \n\nIn The Use of Knowledge in Society, Friedrich A. Hayek states:\n\nGlobalization and global division of labour \n\nThe issue reaches its broadest scope in the controversies about globalization, which is often interpreted as a euphemism for the expansion of world trade based on comparative advantage.\nThis would mean that countries specialize in the work they can do at the lowest relative cost measured in terms of the opportunity cost of not using resources for other work, compared to the opportunity costs experienced by other countries. Critics, however, allege that international specialization cannot be explained sufficiently in terms of \"the work nations do best\", rather this specialization is guided more by commercial criteria, which favour some countries over others.\n\nThe OECD recently advised (28 June 2005) that:\n\nFew studies have taken place regarding the global division of labour.  Information can be drawn from ILO and national statistical offices.\n\nIn one study, Deon Filmer estimated that 2.474 billion people participated in the global non-domestic labour force in the mid-1990s. Of these,\n* around 15%, or 379 million people, worked in industry,\n* a third, or 800 million worked in services, and\n* over 40%, or 1,074 million, in agriculture.\n\nThe majority of workers in industry and services were wage and salary earners – 58 percent of the industrial workforce and 65 percent of the services workforce. But a big portion were self-employed or involved in family labour. Filmer suggests the total of employees worldwide in the 1990s was about 880 million, compared with around a billion working on own account on the land (mainly peasants), and some 480 million working on own account in industry and services. The 2007 ILO Global Employment Trends Report indicated that services have surpassed agriculture for the first time in human history: \"In 2006 the service sector’s share of global employment overtook agriculture for the first time, increasing from 39.5 per cent to 40 per cent. Agriculture decreased from 39.7 per cent to 38.7 per cent. The industry sector accounted for 21.3 per cent of total employment.\"\n\nModern debates \n\nIn the modern world, those specialists most preoccupied in their work with theorizing about the division of labour are those involved in management and organization. In view of the global extremities of the division of labour, the question is often raised about what division of labour would be most ideal, beautiful, efficient and just.\n\nTwo styles of management that are seen in modern organizations are control and commitment, control being the division of labour style of the past and commitment being the style of the future. Control management is based on the principles of job specialization and the division of labour. This is the assembly line style of job specialization where employees are given a very narrow set of tasks or one specific task. Commitment division of labour is oriented on including the employee and building a level of internal commitment towards accomplishing tasks. Tasks include more responsibility and are coordinated based on expertise rather than formal position.McAlister-Kizzier, Donna. \"Division of Labor.\"  Encyclopedia of Business and Finance, 2nd ed.. 2007. Encyclopedia.com. 1 Dec. 2014 http://www.encyclopedia.com\n\nJob specialization is advantageous in developing employee expertise in a field and boosting organizational production. However, disadvantages of job specialization included limited employee skill, a dependence on entire department fluency, and employee discontent with repetitious tasks.\n\nIt is widely accepted that the division of labour is to a great extent inevitable, simply because no one can do all tasks at once. Labour hierarchy is a very common feature of the modern workplace structure, but of course the way these hierarchies are structured can be influenced by a variety of different factors.\n\nSize, cost, and the development of new technology are factors that have influenced job specialization structures in the modern workplace. The cost of job specialization is what limits small organizations from dividing their labour responsibilities, but as organizations increase in size there is a correlation in the rise of division of labour. Technological developments have led to a decrease in the amount of job specialization in organizations as new technology makes it easier for fewer employees to accomplish a variety of tasks and still enhance production. New technology has also been supportive in the flow of information between departments helping to reduce the feeling of department isolation.\n\nIt is often agreed that the most equitable principle in allocating people within hierarchies is that of true (or proven) competency or ability. This important concept of meritocracy could be read as an explanation or as a justification of why a division of labour is the way it is.\n\nIn general, in capitalist economies, such things are not decided consciously.  Different people try different things, and that which is most effective cost-wise (produces the most and best output with the least input) will generally be adopted.  Often techniques that work in one place or time do not work as well in another.  This does not present a problem, as the only requirement of a capitalist system is that you turn a profit.\n\nLimitations\n\nAdam Smith famously said in The Wealth of Nations that the division of labour is limited by the extent of the market. This is because it is by exchange that each person can be specialized in their work and yet still have access to a wide range of goods and services. Hence, reductions in barriers to exchange lead to increases in the division of labour and so help to drive economic growth. Limitations to the division of labour have also been related to coordination and transportation costs.\n\nThere can be motivational advantages to a reduced division of labour (which has been termed ‘job enlargement’ and 'job enrichment'). Jobs that are too specialized in a narrow range of tasks are said to result in demotivation due to boredom and alienation. Hence, a Taylorist approach to work design contributed to worsened industrial relations.\n\nThere are also limitations to the division of labour (and the division of work) that result from work-flow variations and uncertainties.[http://nrs.harvard.edu/urn-3:HUL.InstRepos:12274210], Barrera, Catherine Grace (2014). Skill, Job Design, and the Labor Market under Uncertainty. Doctoral dissertation, Harvard University These help to explain issues in modern work organization, such as task consolidations in business process reengineering and the use of multi-skilled work teams. For instance, one stage of a production process may temporarily work at a slower pace, forcing other stages to slow down. One answer to this is to make some portion of resources mobile between stages, so that those resources must be capable of undertaking a wider range of tasks. Another is to consolidate tasks so that they are undertaken one after another by the same workers and other resources. Stocks between stages can also help to reduce the problem to some extent but are costly and can hamper quality control. Note also that modern flexible manufacturing systems require both flexible machines and flexible workers.\n\nIn project-based work, the coordination of resources is a difficult issue for the project manager as project schedules and resulting resource bookings are based on estimates of task durations and so are subject to subsequent revisions. Again, consolidating tasks so that they are undertaken consecutively by the same resources and having resources available that can be called on at short-notice from other tasks can help to reduce such problems, though at the cost of reduced specialisation.\n\nThere are also advantages in a reduced division of labour where knowledge would otherwise have to be transferred between stages. For example, having a single person deal with a customer query means that only that one person has to be familiarised with the customer’s details. It is also likely to result in the query being handled faster due to the elimination of delays in passing the query between different people.\n\nGendered division of labour \n\nThe clearest exposition of the principles of sexual division of labour across the full range of human societies can be summarized by a large number of logically complementary implicational constraints of the following form: if women of childbearing ages in a given community tend to do X (e.g., preparing soil for planting) they will also do Y (e.g., the planting) while for men the logical reversal in this example would be that if men plant they will prepare the soil. \"Entailment Theory and Method: A Cross-Cultural Analysis of the Sexual Division of Labor\"[http://eclectic.ss.uci.edu/~drwhite/pub/Entail77.pdf eclectic.ss.uci.edu] by White, Brudner and Burton (1977, public domain), using statistical entailment analysis, shows that tasks more frequently chosen by women in these order relations are those more convenient in relation to childrearing. This type of finding has been replicated in a variety of studies, including modern industrial economies. These entailments do not restrict how much work for any given task could be done by men (e.g., in cooking) or by women (e.g., in clearing forests) but are only least-effort or role-consistent tendencies. To the extent that women clear forests for agriculture, for example, they tend to do the entire agricultural sequence of tasks on those clearings. In theory, these types of constraints could be removed by provisions of child care, but ethnographic examples are lacking.\n\nIndustrial organizational psychology \n\nJob satisfaction has been shown to improve as an employee is given the task of a specific job. Students who have received PhDs in a chosen field later report increased satisfaction compared to their previous jobs. This can be attributed to their high levels of specialization. The higher the training needed for the specialized job position, the higher is the level of job satisfaction as well, although many highly specialized jobs can be monotonous and produce high rates of burn out periodically. Division of labour. http://en.wikipedia.org/?curid=8824."
  }
}
