{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5448",
  "eid" : "d52d87a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778437402,
  "textBody" : "Early history\n\nThe earliest inhabitants of Cameroon were probably the Baka (Pygmies). They still inhabit the forests of the south and east provinces.  Bantu speakers originating in the Cameroonian highlands were among the first groups to move out before other invaders. The Mandara kingdom in the Mandara Mountains was founded around 1500 and erected fortified structures, the purpose and exact history of which are still unresolved. The Aro Confederacy of Nigeria had a presence in western (later called British) Cameroon due to trade and migration in the 18th and 19th centuries.\n\nDuring the late 1770s and the early 19th century, the Fulani, a pastoral Islamic people of the western Sahel, conquered most of what is now northern Cameroon, subjugating or displacing its largely non-Muslim inhabitants.\n\nAlthough the Portuguese arrived on Cameroon's doorstep in the 16th century, malaria prevented significant European settlement and conquest of the interior until the late 1870s, when large supplies of the malaria suppressant quinine became available. The early European presence in Cameroon was primarily devoted to coastal trade and the acquisition of slaves. The northern part of Cameroon was an important part of the Muslim slave trade network. The slave trade was largely suppressed by the mid-19th century. Christian missionaries established a presence in the late 19th century and continue to play a role in Cameroonian life.\n\nColonization\n\nFurther information: German Kamerun, French Cameroun, British Cameroons\n\nBeginning on July 5, 1884, all of present-day Cameroon and parts of several of its neighbours became a German colony, Kamerun, with a capital first at Buea and later at Yaoundé.\n\nThe imperial German government made substantial investments in the infrastructure of Cameroon, including the extensive railways, such as the 160-metre single-span railway bridge on the South Sanaga River branch. Hospitals were opened all over the colony, including two major hospitals at Douala, one of which specialised in tropical diseases. However, the indigenous peoples proved reluctant to work on these projects, so the Germans instigated a harsh and unpopular system of forced labour.DeLancey and DeLancey 125. In fact, Jesko von Puttkamer was relieved of duty as governor of the colony due to his untoward actions toward the native Cameroonians.DeLancey and DeLancey 226. In 1911 at the Treaty of Fez after the Agadir Crisis, France ceded a nearly 300,000 km² portion of the territory of French Equatorial Africa to Kamerun which became Neukamerun, while Germany ceded a smaller area in the north in present-day Chad to France.\n\nIn World War I, the British invaded Cameroon from Nigeria in 1914 in the Kamerun campaign, with the last German fort in the country surrendering in February 1916.  After the war, this colony was partitioned between the United Kingdom and France under June 28, 1919 League of Nations mandates (Class B). France gained the larger geographical share, transferred Neukamerun back to neighboring French colonies, and ruled the rest from Yaoundé as Cameroun (French Cameroons). Britain's territory, a strip bordering Nigeria from the sea to Lake Chad, with an equal population was ruled from Lagos as Cameroons (British Cameroons). German administrators were allowed to once again run the plantations of the southwestern coastal area. A British parliamentary publication, Report on the British Sphere of the Cameroons (May 1922, p. 62-8), reports that the German plantations there were \"as a whole . . . wonderful examples of industry, based on solid scientific knowledge. The natives have been taught discipline and have come to realize what can be achieved by industry. Large numbers who return to their villages take up cocoa or other cultivation on their own account, thus increasing the general prosperity of the country.\"        \n\nTowards Independence (1955-1960)\n\nOn 18 December 1956, the outlawed Union of the Peoples of Cameroon (UPC), based largely among the Bamileke and Bassa ethnic groups, began an armed struggle for independence in French Cameroon. This rebellion continued, with diminishing intensity, even after independence until 1961. Some tens of thousands died during this conflict.Eckhardt, William, in World Military and Social Expenditures 1987-88 (12th ed., 1987) by Ruth Leger Sivard.The Cambridge History of Africa (1986), ed. J. D. Fage and R. Oliver\n\nLegislative elections were held on 23 December 1956 and the resulting Assembly passed a decree on 16 April 1957 which made French Cameroon a State. It took back its former status of associated territory as a member of the French Union. Its inhabitants became Cameroonian citizens, Cameroonian institutions were created under the sign of parliamentary democracy.  On 12 June 1958 the Legislative Assembly of French Cameroon asked the French government to: 'Accord independence to the State of Cameroon at the ends of their trusteeship. Transfer every competence related to the running of internal affairs of Cameroon to Cameroonians`. On 19 October 1958 France recognized the right of her United Nations trust territory of the Cameroons to choose independence. On 24 October 1958 the Legislative Assembly of French Cameroon solemnly proclaimed the desire of Cameroonians to see their country accede full independence on 1 January 1960. It enjoined the government of French Cameroon to ask France to inform the General Assembly of the United Nations, to abrogate the trusteeship accord concomitant with the independence of French Cameroon. On 12 November 1958 having accorded French Cameroon total internal autonomy and thinking that this transfer no longer permitted it to assume its responsibilities over the trust territory for an unspecified period, the government of France asked the United Nations to grant the wish of French Cameroonians. On 5 December 1958 the United Nations’ General Assembly took note of the French government’s declaration according to which French Cameroon, which was under French administration, would gain independence on 1 January 1960, thus marking an end to the trusteeship period. On 13 March 1959 the United Nations’ General Assembly resolved that the UN Trusteeship Agreement with France for French Cameroon would end when French Cameroon became independent on 1 January 1960.\n\nCameroon after independence\n\nFrench Cameroon achieved independence on January 1, 1960 as La Republique du Cameroun. After Guinea, it was the second of France's colonies in Sub-Saharan Africa to be granted independence. On 21 February 1960, the new nation held a constitutional referendum. On 5 May 1960, Ahmadou Ahidjo became president. On 11 February 1961, a plebiscite organised by the United Nations was held in the British controlled part of Cameroon (British Northern and British Southern Cameroons). The pleibiscite was to choose between free association with an independent Nigerian state or re-unification with the independent Republic of Cameroun. On 12 February 1961,the results of the plebiscite were released and British Northern Cameroons attached itself to Nigeria, while the southern part voted for reunification with the Republic Of Cameroon. To negotiate the terms of this union, the Foumban Conference was held on 16–21 July 1961. John Ngu Foncha, the leader of the Kamerun National Democratic Party, accepted a federation while thinking of a confederation. The British Southern Cameroons was to be referred to as West Cameroon and the French part as East Cameroon. Buea became the capital of the now West Cameroon while Yaounde doubled as the federal capital and East Cameroon. Ahidjo accepted the federation, thinking it was a step towards a unitary state. On 14 August 1961, the federal constitution was adopted, with Ahidjo as president. Foncha became the prime minister of west Cameroon and vice president of the Federal Republic of Cameroon. On 1 September 1966 the Cameroon National Union(CNU) was created by the union of political parties of East and West Cameroon. Most decisions about West Cameroon were taken without consultation, which led to widespread feelings  amongst the West Cameroonian public that although they voted for reunification, what they were getting is absorption or domination\".The Untold Story of Reunification: (1955-1961)\n\nOn October 1, 1961, the largely Muslim northern two-thirds of British Cameroons voted to join Nigeria; the largely Christian southern third, Southern Cameroons, voted, in a referendum, to join with the Republic of Cameroon to form the Federal Republic of Cameroon. The formerly French and British regions each maintained substantial autonomy. Ahidjo, a French-educated Fulani, was chosen president of the federation in 1961. In 1962, the Francs CFA became the official currency in Cameroon. \n\nAhidjo, relying on a pervasive internal security apparatus, outlawed all political parties but his own in 1966. He successfully suppressed the continuing UPC rebellion, capturing the last important rebel leader in 1970. On 28 March 1970 Ahidjo renewed his mandate as the supreme magistracy; Solomon Tandeng Muna  became Vice President. In 1972, a new constitution replaced the federation with a unitary state called the United Republic of Cameroon. This is the major cause of tension between the French and English speaking areas of Cameroon. Southern Cameroonians feel the agreement at the Foumban constitution conference is not respected.\n\nAlthough Ahidjo's rule was characterised as authoritarian, he was seen as noticeably lacking in charisma in comparison to many post-colonial African leaders. He didn't follow the anti-western policies pursued by many of these leaders, which helped Cameroon achieve a degree of comparative political stability and economic growth.\n\nOn 30 June 1975 Paul Biya was appointed vice president. Ahidjo resigned as president in 1982 and was constitutionally succeeded by his Prime Minister, Paul Biya, a career official from the Beti-Pahuin ethnic group. Ahidjo later regretted his choice of successors, but his supporters failed to overthrow Biya in a 1984 coup. Biya won single-candidate elections in 1983 and 1984 when the country was again named the Republic of Cameroon.  Biya has remained in power, winning flawed multiparty elections in 1992, 1997, 2004 and 2011. His Cameroon People's Democratic Movement (CPDM) party holds a sizeable majority in the legislature.\n\nBy April 6, 1984, the country witnessed its first coup d'état headed by col. Issa Adoum.\nAt about 3 am rebel forces mostly of the Republican guard under the orders of colonel Ibrahim Saleh, attempted to unseat Biya's government. The rebels took charge of the Yaounde airport, national radio station and announced the takeover of government. They attacked the presidency. The civilian northerner who was manager of FONADER Issa Adoum was expected to become the new interim president. Unfortunately, many reasons led to its failure.\nThe principal coup plotters had been arrested by April 10, 1984 and President Biya addressed the nation that calm had been restored.\n\nOn August 15, 1984, Lake Monoun exploded in a limnic eruption that released carbon dioxide, suffocating 37 people to death. On August 21, 1986, another limnic eruption at Lake Nyos killed as many as 1,800 people and 3,500 livestock.  The two disasters are the only recorded instances of limnic eruptions.\n\nIn May 2014, in the wake of the Chibok schoolgirl kidnapping, Presidents Paul Biya of Cameroon and Idriss Déby of Chad announced they were waging war on Boko Haram, and deployed troops to the Nigerian border.\n\nIn early 2006 a final resolution to the dispute between Cameroon and Nigeria over the oil-rich Bakassi peninsula was expected. In October 2002, the International Court of Justice had ruled in favour of Cameroon. Nonetheless, a lasting solution would require agreement by both countries’ presidents, parliaments, and by the United Nations. The peninsula was the site of fighting between the two countries in 1994 and again in June 2005, which led to the death of a Cameroonian soldier.\n\nFootball\n\nCameroon has received some international attention following the relative success of its football team. It has qualified for the FIFA World Cup on a number of occasions. Its most notable performance was at Italia 90, when the team beat Argentina, the then reigning Champions in the opening game; Cameroon eventually lost in extra time in the Semi Finals to England.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "History of Cameroon" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5448" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Early history\n\nThe earliest inhabitants of Cameroon were probably the Baka (Pygmies). They still inhabit the forests of the south and east provinces.  Bantu speakers originating in the Cameroonian highlands were among the first groups to move out before other invaders. The Mandara kingdom in the Mandara Mountains was founded around 1500 and erected fortified structures, the purpose and exact history of which are still unresolved. The Aro Confederacy of Nigeria had a presence in western (later called British) Cameroon due to trade and migration in the 18th and 19th centuries.\n\nDuring the late 1770s and the early 19th century, the Fulani, a pastoral Islamic people of the western Sahel, conquered most of what is now northern Cameroon, subjugating or displacing its largely non-Muslim inhabitants.\n\nAlthough the Portuguese arrived on Cameroon's doorstep in the 16th century, malaria prevented significant European settlement and conquest of the interior until the late 1870s, when large supplies of the malaria suppressant quinine became available. The early European presence in Cameroon was primarily devoted to coastal trade and the acquisition of slaves. The northern part of Cameroon was an important part of the Muslim slave trade network. The slave trade was largely suppressed by the mid-19th century. Christian missionaries established a presence in the late 19th century and continue to play a role in Cameroonian life.\n\nColonization\n\nFurther information: German Kamerun, French Cameroun, British Cameroons\n\nBeginning on July 5, 1884, all of present-day Cameroon and parts of several of its neighbours became a German colony, Kamerun, with a capital first at Buea and later at Yaoundé.\n\nThe imperial German government made substantial investments in the infrastructure of Cameroon, including the extensive railways, such as the 160-metre single-span railway bridge on the South Sanaga River branch. Hospitals were opened all over the colony, including two major hospitals at Douala, one of which specialised in tropical diseases. However, the indigenous peoples proved reluctant to work on these projects, so the Germans instigated a harsh and unpopular system of forced labour.DeLancey and DeLancey 125. In fact, Jesko von Puttkamer was relieved of duty as governor of the colony due to his untoward actions toward the native Cameroonians.DeLancey and DeLancey 226. In 1911 at the Treaty of Fez after the Agadir Crisis, France ceded a nearly 300,000 km² portion of the territory of French Equatorial Africa to Kamerun which became Neukamerun, while Germany ceded a smaller area in the north in present-day Chad to France.\n\nIn World War I, the British invaded Cameroon from Nigeria in 1914 in the Kamerun campaign, with the last German fort in the country surrendering in February 1916.  After the war, this colony was partitioned between the United Kingdom and France under June 28, 1919 League of Nations mandates (Class B). France gained the larger geographical share, transferred Neukamerun back to neighboring French colonies, and ruled the rest from Yaoundé as Cameroun (French Cameroons). Britain's territory, a strip bordering Nigeria from the sea to Lake Chad, with an equal population was ruled from Lagos as Cameroons (British Cameroons). German administrators were allowed to once again run the plantations of the southwestern coastal area. A British parliamentary publication, Report on the British Sphere of the Cameroons (May 1922, p. 62-8), reports that the German plantations there were \"as a whole . . . wonderful examples of industry, based on solid scientific knowledge. The natives have been taught discipline and have come to realize what can be achieved by industry. Large numbers who return to their villages take up cocoa or other cultivation on their own account, thus increasing the general prosperity of the country.\"        \n\nTowards Independence (1955-1960)\n\nOn 18 December 1956, the outlawed Union of the Peoples of Cameroon (UPC), based largely among the Bamileke and Bassa ethnic groups, began an armed struggle for independence in French Cameroon. This rebellion continued, with diminishing intensity, even after independence until 1961. Some tens of thousands died during this conflict.Eckhardt, William, in World Military and Social Expenditures 1987-88 (12th ed., 1987) by Ruth Leger Sivard.The Cambridge History of Africa (1986), ed. J. D. Fage and R. Oliver\n\nLegislative elections were held on 23 December 1956 and the resulting Assembly passed a decree on 16 April 1957 which made French Cameroon a State. It took back its former status of associated territory as a member of the French Union. Its inhabitants became Cameroonian citizens, Cameroonian institutions were created under the sign of parliamentary democracy.  On 12 June 1958 the Legislative Assembly of French Cameroon asked the French government to: 'Accord independence to the State of Cameroon at the ends of their trusteeship. Transfer every competence related to the running of internal affairs of Cameroon to Cameroonians`. On 19 October 1958 France recognized the right of her United Nations trust territory of the Cameroons to choose independence. On 24 October 1958 the Legislative Assembly of French Cameroon solemnly proclaimed the desire of Cameroonians to see their country accede full independence on 1 January 1960. It enjoined the government of French Cameroon to ask France to inform the General Assembly of the United Nations, to abrogate the trusteeship accord concomitant with the independence of French Cameroon. On 12 November 1958 having accorded French Cameroon total internal autonomy and thinking that this transfer no longer permitted it to assume its responsibilities over the trust territory for an unspecified period, the government of France asked the United Nations to grant the wish of French Cameroonians. On 5 December 1958 the United Nations’ General Assembly took note of the French government’s declaration according to which French Cameroon, which was under French administration, would gain independence on 1 January 1960, thus marking an end to the trusteeship period. On 13 March 1959 the United Nations’ General Assembly resolved that the UN Trusteeship Agreement with France for French Cameroon would end when French Cameroon became independent on 1 January 1960.\n\nCameroon after independence\n\nFrench Cameroon achieved independence on January 1, 1960 as La Republique du Cameroun. After Guinea, it was the second of France's colonies in Sub-Saharan Africa to be granted independence. On 21 February 1960, the new nation held a constitutional referendum. On 5 May 1960, Ahmadou Ahidjo became president. On 11 February 1961, a plebiscite organised by the United Nations was held in the British controlled part of Cameroon (British Northern and British Southern Cameroons). The pleibiscite was to choose between free association with an independent Nigerian state or re-unification with the independent Republic of Cameroun. On 12 February 1961,the results of the plebiscite were released and British Northern Cameroons attached itself to Nigeria, while the southern part voted for reunification with the Republic Of Cameroon. To negotiate the terms of this union, the Foumban Conference was held on 16–21 July 1961. John Ngu Foncha, the leader of the Kamerun National Democratic Party, accepted a federation while thinking of a confederation. The British Southern Cameroons was to be referred to as West Cameroon and the French part as East Cameroon. Buea became the capital of the now West Cameroon while Yaounde doubled as the federal capital and East Cameroon. Ahidjo accepted the federation, thinking it was a step towards a unitary state. On 14 August 1961, the federal constitution was adopted, with Ahidjo as president. Foncha became the prime minister of west Cameroon and vice president of the Federal Republic of Cameroon. On 1 September 1966 the Cameroon National Union(CNU) was created by the union of political parties of East and West Cameroon. Most decisions about West Cameroon were taken without consultation, which led to widespread feelings  amongst the West Cameroonian public that although they voted for reunification, what they were getting is absorption or domination\".The Untold Story of Reunification: (1955-1961)\n\nOn October 1, 1961, the largely Muslim northern two-thirds of British Cameroons voted to join Nigeria; the largely Christian southern third, Southern Cameroons, voted, in a referendum, to join with the Republic of Cameroon to form the Federal Republic of Cameroon. The formerly French and British regions each maintained substantial autonomy. Ahidjo, a French-educated Fulani, was chosen president of the federation in 1961. In 1962, the Francs CFA became the official currency in Cameroon. \n\nAhidjo, relying on a pervasive internal security apparatus, outlawed all political parties but his own in 1966. He successfully suppressed the continuing UPC rebellion, capturing the last important rebel leader in 1970. On 28 March 1970 Ahidjo renewed his mandate as the supreme magistracy; Solomon Tandeng Muna  became Vice President. In 1972, a new constitution replaced the federation with a unitary state called the United Republic of Cameroon. This is the major cause of tension between the French and English speaking areas of Cameroon. Southern Cameroonians feel the agreement at the Foumban constitution conference is not respected.\n\nAlthough Ahidjo's rule was characterised as authoritarian, he was seen as noticeably lacking in charisma in comparison to many post-colonial African leaders. He didn't follow the anti-western policies pursued by many of these leaders, which helped Cameroon achieve a degree of comparative political stability and economic growth.\n\nOn 30 June 1975 Paul Biya was appointed vice president. Ahidjo resigned as president in 1982 and was constitutionally succeeded by his Prime Minister, Paul Biya, a career official from the Beti-Pahuin ethnic group. Ahidjo later regretted his choice of successors, but his supporters failed to overthrow Biya in a 1984 coup. Biya won single-candidate elections in 1983 and 1984 when the country was again named the Republic of Cameroon.  Biya has remained in power, winning flawed multiparty elections in 1992, 1997, 2004 and 2011. His Cameroon People's Democratic Movement (CPDM) party holds a sizeable majority in the legislature.\n\nBy April 6, 1984, the country witnessed its first coup d'état headed by col. Issa Adoum.\nAt about 3 am rebel forces mostly of the Republican guard under the orders of colonel Ibrahim Saleh, attempted to unseat Biya's government. The rebels took charge of the Yaounde airport, national radio station and announced the takeover of government. They attacked the presidency. The civilian northerner who was manager of FONADER Issa Adoum was expected to become the new interim president. Unfortunately, many reasons led to its failure.\nThe principal coup plotters had been arrested by April 10, 1984 and President Biya addressed the nation that calm had been restored.\n\nOn August 15, 1984, Lake Monoun exploded in a limnic eruption that released carbon dioxide, suffocating 37 people to death. On August 21, 1986, another limnic eruption at Lake Nyos killed as many as 1,800 people and 3,500 livestock.  The two disasters are the only recorded instances of limnic eruptions.\n\nIn May 2014, in the wake of the Chibok schoolgirl kidnapping, Presidents Paul Biya of Cameroon and Idriss Déby of Chad announced they were waging war on Boko Haram, and deployed troops to the Nigerian border.\n\nIn early 2006 a final resolution to the dispute between Cameroon and Nigeria over the oil-rich Bakassi peninsula was expected. In October 2002, the International Court of Justice had ruled in favour of Cameroon. Nonetheless, a lasting solution would require agreement by both countries’ presidents, parliaments, and by the United Nations. The peninsula was the site of fighting between the two countries in 1994 and again in June 2005, which led to the death of a Cameroonian soldier.\n\nFootball\n\nCameroon has received some international attention following the relative success of its football team. It has qualified for the FIFA World Cup on a number of occasions. Its most notable performance was at Italia 90, when the team beat Argentina, the then reigning Champions in the opening game; Cameroon eventually lost in extra time in the Semi Finals to England. History of Cameroon. http://en.wikipedia.org/?curid=5448."
  }
}
