{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5853",
  "eid" : "d83cc370-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778442535,
  "textBody" : "The Army of the Czech Republic (, AČR), also known as the Czech Army or Czech Armed Forces, is the military service responsible for the defence of the Czech Republic in compliance with international obligations and treaties on collective defence. It is also set to support peacekeeping, rescue and humanitarian operations both within the national territory and abroad. Armed Forces consist of the General Staff, the Land Forces, the Air Force and support units.\n\nFrom the late 1940s to 1989, the extensive Czechoslovak People's Army (about 200,000) formed one of the pillars of the Warsaw Pact military alliance. After the dissolution of Czechoslovakia, the Czech Republic is completing a major reorganisation and reduction of the armed forces, which intensified after the Czech Republic joined NATO on 12 March 1999.[http://www.tandfonline.com/doi/pdf/10.1080/04597222.2011.559835\"Military Balance in Europe 2011\".], March 07, 2011.\n\nAs defined by the Czech Law No. 219/1999 Coll., the Armed Forces of the Czech Republic () are the military forces of the Czech Republic. They consist of the Army of the Czech Republic, the Military Office of President of the Republic and the Castle Guard.\n\nHistory\n\nCzech lands \n\nMilitary history of the Czech people dates back to the Middle Ages and the creation of Duchy of Bohemia and Kingdom of Bohemia. During the Hussite Wars, Jan Žižka became a military leader of such skill and eminence that the Hussite legacy became an important and lasting part of the Czech military traditions. European wars of religion once again wrecked the Czech lands, and at the Battle of White Mountain in 1620, Czech freedom was lost to the Habsburg Monarchy. Throughout the centuries of foreign rule, the Czechs were subjected, at times, to intense Germanization. Nevertheless, Czechs maintained their ethnic identity and seized the opportunity for independence during World War I. Czechs and Slovaks deserted the armies of Austria-Hungary in large numbers to form the Czechoslovak Legion.\n\nCzechoslovakia \n\nThe Czechoslovak Armed Forces were originally formed on 30 June 1918 when 6,000 members of the Czechoslovak Legion in France, which had been established in 1914, took oath and received a battle banner in Darney, France, thus preceding the official declaration of Czechoslovak independence by four months. The military achievements of the Czechoslovak legions on the French, Italian and especially Russian front became one of the main arguments that the Czechoslovak pro-independence leaders could use to gain the support for the country's independence by the Allies of World War I.\n\nIn 1938, servicemen of the Czechoslovak Army and the State Defense Guard fought in an undeclared border war against the German-backed Sudetendeutsches Freikorps as well as Polish and Hungarian paramilitary forces. As a result of the Munich Agreement, areas heavily populated by ethnic German speaking people were incorporated into the Third Reich and military aged men living there were subject to being drafted into the Wehrmacht. Following the Czechoslovakia's complete annexation in 1939 and creation of the Protectorate of Bohemia and Moravia, the Protectorate's government possessed its own armed force, the Government Army (6,500 men), tasked with public security and rearguard duties. On the other side of the conflict, a number of Czechoslovak units and formations served with the Polish Army (Czechoslovak Legion), the French Army, the Royal Air Force, the British Army (the 1st Czechoslovak Armoured Brigade), and the Red Army (I Corps). Four Czech and Slovak-manned RAF squadrons were transferred to Czechoslovak control in late 1945.\n\nFrom 1954 until 1990, the Army was known as the Czechoslovak People's Army (ČSLA).For more information on the Czechoslovak Army during the Cold War, see Gordon L. Rottman, Warsaw Pact Ground Forces, Osprey Publishing, 1987 Although the ČSLA, as formed in 1945, included both Soviet- and British-equipped/trained expatriate troops, the \"Western\" soldiers had been purged from the ČSLA after 1948 when the communists took power. The ČSLA offered no resistance to the invasion mounted by the Soviets in 1968 in reaction to the \"Prague Spring\", and was extensively reorganized by the Soviets following the re-imposition of communist rule in Prague.\n\nOf the approximately 201,000 personnel on active duty in the ČSLA in 1987, about 145,000, or about 72 percent, served in the ground forces (commonly referred to as the army). About 100,000 of these were conscripts.Library of Congress Country Study: Czechoslovakia, [http://lcweb2.loc.gov/cgi-bin/query2/r?frd/cstdy:@field(DOCID+cs0133) Ground Forces], 1987 There were two military districts, Western and Eastern. A 1989 listing of forces shows two Czechoslovak armies in the west, the 1st at Příbram with one tank division and three motor rifle divisions, the 4th at Písek with two tank divisions and two motor rifle divisions. In the Eastern Military District, there were two tank divisions, the 13th and 14th, with a supervisory headquarters at Trenčín in the Slovak part of the country.Orbat.com, [http://www.orbat.com/site/history/historical/nato/warsawpact.html Warsaw Pact Order of Battle 1989] , accessed 2 June 2010\n\nDuring the Cold War, the ČSLA was equipped primarily with Soviet arms, although certain arms like the OT-64 SKOT armored personnel carrier, the L-29 Delfín and L-39 Albatros aircraft, the P-27 Pancéřovka antitank rocket launcher, the vz. 58 assault rifle or the Uk vz. 59 machine gun were of Czechoslovak design.\n\nAfter 1992 (dissolution of Czechoslovakia)\n\nThe Army of the Czech Republic was formed after the Czechoslovak Armed Forces split after the 1 January 1993 dissolution of Czechoslovakia. Czech forces stood at 90,000 in 1993. They were reduced to around 65,000 in 11 combat brigades and the Air Force in 1997, to 63,601 in 1999, and to 35,000 in 2005. At the same time, the forces were modernized and reoriented towards a defensive posture. In 2004, the army transformed itself into a fully professional organization and compulsory military service was abolished. The Army maintains an active reserve.\n\nThe Czech Republic is a member of the United Nations and the Organization for Security and Co-operation in Europe.  At the 1999 Washington summit, the Czech Republic joined NATO. Since 1990, the ACR and the Czech Armed Forces have contributed to numerous peacekeeping and humanitarian operations, including IFOR, SFOR, and EUFOR Althea in Bosnia, Desert Shield/Desert Storm, Afghanistan, Kosovo, Albania, Turkey, Pakistan and with the Coalition forces in Iraq.\n\nCurrent deployments (2018):\n\n*Lithuania: NATO Operation (NATO Enhanced Forward Presence) - 250 soldiers\n*Latvia: NATO Operation (NATO Enhanced Forward Presence) - 40 soldiers\n*Afghanistan: NATO Operation (Resolute Support Mission) - 230 soldiers\n*Kosovo: NATO Operation (KFOR) - 10 soldiers\n*Mali: EU military training mission (EUTM Mali) - 41 soldiers\n*Mali: UN peacekeeping mission (MINUSMA) - 3 soldiers\n*Somalia: EU Operation Atalanta (NAVFOR) - 3 soldiers\n*Sinai:  International peacekeeping force (MFO) - 18 soldiers\n*Iraq:  Military intervention against the Islamic State of Iraq and Syria (OIR) - 30 soldiers (air advisory team), 12 soldiers (chemical unit)\n*Mediterranean Sea: EU military operation (EU Navfor Med) - 4 soldiers\n*Bosnia and Herzegovina: Military deployment to oversee the military implementation of the Dayton Agreement (European Union Force Althea) - 2 soldiers\n*Golan Heights: UN peacekeeping mission (UNDOF) - 3 soldiers\n*DR Congo: UN peacekeeping mission (MONUC) - 2 military observers\n*Mali: UN peacekeeping mission (MINUSMA) - 2 military observers\n*Kosovo: UN peacekeeping mission (UNMIK) - 2 military observers\n*Central African Republic: UN peacekeeping mission (MINUSCA) - 3 military observers\n\nStructure\n\nStructure of the Czech Armed Forces consists of two parts:\n\n* General Staff of Czech Armed Forces (Praha)\n**  Czech Land Forces (Praha)\n**  Czech Air Force (Praha)\n\nThe 153rd Engineer Battalion based in Olomouc was created on 15 October 2008 and is subordinated to the 15th Engineer Regiment. The unit is stationed in the outskirts of the city of Olomouc, in place of the canceled 156th Rescue Battalion.http://www.153zpr.army.cz - webové stránky praporu www.153zpr.army.cz\n\nActive reserves\n\nActive Reserve (in Czech Aktivní záloha) is a part of the otherwise professional Army of the Czech Republic. This service was created to allow the participation of citizens with a positive attitude to the military.\n\nA volunteer needs either to have completed the compulsory military service (which ended in 2004) or to attend 8 week training. Then the reservists have to serve up to three weeks a year and can be called up to serve two weeks during a non-military crisis. They are not intended to serve abroad. The Reserve presents itself on events like BAHNA, a military show.\n\nEquipment\n\nThe Army of the Czech Republic is, to a large extent, using inventory dating back to the times of the Warsaw Pact. During the Cold War, Czechoslovakia was a major supplier of tanks, armoured personnel carriers, military trucks and trainer aircraft – the bulk of military exports went to its Comecon partners. Replacement of the obsolescent equipment, or making it at least compliant with the NATO standards, is urgently required. Modernization plans include acquisition of new multi-role helicopters, transport aircraft, infantry fighting vehicles or air defence radars and missiles. If possible, the Czech Ministry of Defence selects products that are manufactured or co-produced in the Czech Republic. This includes firearms of the Česká zbrojovka Uherský Brod, namely the CZ 75 pistols, CZ Scorpion Evo 3 submachine guns, CZ 805 BREN and BREN 2 assault rifles. Moreover, the Czech Army is equipped with about 3000 T810 and T815 vehicles of various modifications produced by the Czech Tatra Trucks company. Tatra Defence Vehicle factory ensures licensed production of Pandur II and Titus armoured vehicles. Aircraft such as the Aero L-39 Albatros, Aero L-159 Alca and Let L-410 Turbolet have been produced domestically as well.\n\nImage:Střelecká příprava.jpg|Soldiers with CZ-805 BREN assault rifles \nImage:Areál čs. opevnění v Darkovičkách - akce.jpg|Czech modernizedT-72M4 CZ\nImage:BVP-2 military parade Prague.jpg|Czech BVP-2 at 2008 Prague military parade\nImage:KBV-PZLOK.JPG|Czech Pandur II 8x8 wheeled IFV\nImage:Tatra T-810 Czech Army 01.jpg|Tatra 810 medium truck\nImage:131121-A-KH850-004_(11045794563).jpg|ShKH-77 Dana: 152mm Self-propelled cannon howitzer\nImage:Czech Mi-24 CIAF.JPG|Czech Air Force modernized Mi-24V helicopter gunship\nImage:1-3cc-area-51.JPG|Czech Air Force W-3A\nImage:Saab.jas39c.gripen.taxi.arp.jpg|Czech Air Force JAS 39 Gripen\nImage:L-159 ALCA Czech Air Force.jpg|Czech Air Force L-159 light combat aircraft\n\nUniforms\n\nDifferent types of Czech Army uniforms:\n\nImage:Czech ISAF (6).jpg|Commando soldier from ÚSO VP SOG in desert camouflage uniform in Afghanistan\nImage:Czech KFOR (1).jpg|Standard woodland pattern camouflage uniform\nImage:Aktivni_zalohy_ACR.jpg|Members of the Active Reserve during exercise\nImage:Posadkova hudba Olomouc.jpg|Czech military band in Olomouc\nImage:Posadkova hudba Olomouc 2.jpg|Czech military band in Olomouc\nImage:Czechguards.jpg|Soldier of Prague Castle guard holding ceremonial Vz. 52 rifle\n\nCommanding officers\n\n*Chief of the General Staff: Army General Josef Bečvář\n*First Deputy Chief of the General Staff: Major General Miroslav Žižka\n*Deputy Chief of the General Staff of the AČR-Chief of Staff: Major General Bohuslav Dvořák\n*Deputy Chief of the General Staff - Director of Joint Operation Centre: Major General Aleš Opata\n*Deputy Chief of the General Staff - Inspector of the AČR: Major General František Malenínský\n**Immediately Subordinated Offices:\n**Military Regional Office, Boletice\n**Military Regional Office, Brdy\n**Military Regional Office, Březina\n**Military Regional Office, Hradiště\n**Military Regional Office, Libavá\n*Support Policy Division: Director Major General Pavel Jevula\n**Immediately Subordinated Institutions:\n**Central Military Hospital, Prague\n**Military Hospital, Brno\n**Military Hospital, Olomouc\n**Institute of Aviation Medicine, Prague\n*Communication and Information Systems Division:Director - Chief of the Signal Corps of AČR: Colonel Jan Kaše\n**Immediately Subordinated Institutions:\n**6th Communication Centre\n**Research and Communication Centre 080\n**Information Technology Development Agency\n*Force Planning Division: Acting Director Colonel František Mičánek\n*Reconnaissance and Electronic Warfare Department: Director Colonel Miroslav Žižka\n**Immediately Subordinated Office:\n**Military Geography and Hydrometeorology Office\n*Military Aviation Authority: Director Colonel Josef Otta\n\nCurrent and historic military ranks \n\nThese are the military ranks, historic and present-day, of the Armed Forces of the Czech Republic and its predecessor force, the Czechoslovak Armed Forces, later known as the People's Army.\n\nEnlisted and non-commissioned officers \n\n* Vojín - Private, Airman\n* Svobodník - Private First Class, Airman first class\n* Desátník - Corporal, Senior Airman\n* Četař - Sergeant\n* Četař jednoroční dobrovolník - Volunteer Sergeant (used 1919-1920)\n* Rotný - Staff Sergeant (formerly Sikovatel from 1919-20)\n* Štábní šikovatel - Company Sergeant Major (used 1918-1920)\n* Staršina - Platoon Sergeant, Flight sergeant (part of the rank system 1948-1959)\n* Rotmistr - Sergeant First Class, Technical Sergeant\n* Nadrotmistr - Master Sergeant\n* Štábní rotmistr - First Sergeant (abolished 2011)\n\nWarrant officers \n\n* Důstojnický zástupce - Cadet Warrant officer (used 1919-1920)\n* Podpraporčík - First Warrant Officer (abolished 2011)\n* Praporčík - Warrant officer\n* Nadpraporčík - Senior Warrant Officer\n* Štábní praporčík - Chief Warrant Officer (abolished 1949, reinstated 1999)\n\nOfficer cadets and military school cadets \n\n* Kadet Aspirant - Officer cadet (used 1919-1920)\n* Gážista mimo hodnostní třídu - Reserve Officer Candidate (used 1919-1920)\n\nOfficers \n\n* Podporučík OF-1c - Sub-lieutenant (abolished 2011)\n* Poručík OF-1b - Second lieutenant, Lieutenant\n* Nadporučík OF-1a - First lieutenant \n* Kapitán - Captain (formerly Setník in the Home Army)\n* Štábní kapitán - Senior Captain (abolished 1952)\n* Major\n* Podplukovník - Lieutenant colonel\n* Plukovník - Colonel\n* Brigádní generál - Brigade General (Jun 12th, 1953 to generálmajor, 1999 reinstated to Brigádní generál)\n* Divizní generál - Divisional General (Jun 12th, 1953 to generálporučík)\n* Generálmajor - Major General (exists Jun 12th, 1953 to present)\n* Generálporučík - Lieutenant General (exists Jun 12th, 1953 to present)\n* Polní podmaršálek - Lieutenant Field Marshal (used 1918-1920)\n* Sborový generál - Corps General (Jun 12th, 1953 to generálplukovník)\n* Generálplukovník - Colonel General (abolished 1998)\n* Generál  - General (created in 1920 and abolished 1930, today highest rank in Slovakia)\n* Armádní generál - General of the Army, General of the Air Force\n* Polní zbrojmistr - Field marshal (used 1918-1920)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Army of the Czech Republic" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5853" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Army of the Czech Republic (, AČR), also known as the Czech Army or Czech Armed Forces, is the military service responsible for the defence of the Czech Republic in compliance with international obligations and treaties on collective defence. It is also set to support peacekeeping, rescue and humanitarian operations both within the national territory and abroad. Armed Forces consist of the General Staff, the Land Forces, the Air Force and support units.\n\nFrom the late 1940s to 1989, the extensive Czechoslovak People's Army (about 200,000) formed one of the pillars of the Warsaw Pact military alliance. After the dissolution of Czechoslovakia, the Czech Republic is completing a major reorganisation and reduction of the armed forces, which intensified after the Czech Republic joined NATO on 12 March 1999.[http://www.tandfonline.com/doi/pdf/10.1080/04597222.2011.559835\"Military Balance in Europe 2011\".], March 07, 2011.\n\nAs defined by the Czech Law No. 219/1999 Coll., the Armed Forces of the Czech Republic () are the military forces of the Czech Republic. They consist of the Army of the Czech Republic, the Military Office of President of the Republic and the Castle Guard.\n\nHistory\n\nCzech lands \n\nMilitary history of the Czech people dates back to the Middle Ages and the creation of Duchy of Bohemia and Kingdom of Bohemia. During the Hussite Wars, Jan Žižka became a military leader of such skill and eminence that the Hussite legacy became an important and lasting part of the Czech military traditions. European wars of religion once again wrecked the Czech lands, and at the Battle of White Mountain in 1620, Czech freedom was lost to the Habsburg Monarchy. Throughout the centuries of foreign rule, the Czechs were subjected, at times, to intense Germanization. Nevertheless, Czechs maintained their ethnic identity and seized the opportunity for independence during World War I. Czechs and Slovaks deserted the armies of Austria-Hungary in large numbers to form the Czechoslovak Legion.\n\nCzechoslovakia \n\nThe Czechoslovak Armed Forces were originally formed on 30 June 1918 when 6,000 members of the Czechoslovak Legion in France, which had been established in 1914, took oath and received a battle banner in Darney, France, thus preceding the official declaration of Czechoslovak independence by four months. The military achievements of the Czechoslovak legions on the French, Italian and especially Russian front became one of the main arguments that the Czechoslovak pro-independence leaders could use to gain the support for the country's independence by the Allies of World War I.\n\nIn 1938, servicemen of the Czechoslovak Army and the State Defense Guard fought in an undeclared border war against the German-backed Sudetendeutsches Freikorps as well as Polish and Hungarian paramilitary forces. As a result of the Munich Agreement, areas heavily populated by ethnic German speaking people were incorporated into the Third Reich and military aged men living there were subject to being drafted into the Wehrmacht. Following the Czechoslovakia's complete annexation in 1939 and creation of the Protectorate of Bohemia and Moravia, the Protectorate's government possessed its own armed force, the Government Army (6,500 men), tasked with public security and rearguard duties. On the other side of the conflict, a number of Czechoslovak units and formations served with the Polish Army (Czechoslovak Legion), the French Army, the Royal Air Force, the British Army (the 1st Czechoslovak Armoured Brigade), and the Red Army (I Corps). Four Czech and Slovak-manned RAF squadrons were transferred to Czechoslovak control in late 1945.\n\nFrom 1954 until 1990, the Army was known as the Czechoslovak People's Army (ČSLA).For more information on the Czechoslovak Army during the Cold War, see Gordon L. Rottman, Warsaw Pact Ground Forces, Osprey Publishing, 1987 Although the ČSLA, as formed in 1945, included both Soviet- and British-equipped/trained expatriate troops, the \"Western\" soldiers had been purged from the ČSLA after 1948 when the communists took power. The ČSLA offered no resistance to the invasion mounted by the Soviets in 1968 in reaction to the \"Prague Spring\", and was extensively reorganized by the Soviets following the re-imposition of communist rule in Prague.\n\nOf the approximately 201,000 personnel on active duty in the ČSLA in 1987, about 145,000, or about 72 percent, served in the ground forces (commonly referred to as the army). About 100,000 of these were conscripts.Library of Congress Country Study: Czechoslovakia, [http://lcweb2.loc.gov/cgi-bin/query2/r?frd/cstdy:@field(DOCID+cs0133) Ground Forces], 1987 There were two military districts, Western and Eastern. A 1989 listing of forces shows two Czechoslovak armies in the west, the 1st at Příbram with one tank division and three motor rifle divisions, the 4th at Písek with two tank divisions and two motor rifle divisions. In the Eastern Military District, there were two tank divisions, the 13th and 14th, with a supervisory headquarters at Trenčín in the Slovak part of the country.Orbat.com, [http://www.orbat.com/site/history/historical/nato/warsawpact.html Warsaw Pact Order of Battle 1989] , accessed 2 June 2010\n\nDuring the Cold War, the ČSLA was equipped primarily with Soviet arms, although certain arms like the OT-64 SKOT armored personnel carrier, the L-29 Delfín and L-39 Albatros aircraft, the P-27 Pancéřovka antitank rocket launcher, the vz. 58 assault rifle or the Uk vz. 59 machine gun were of Czechoslovak design.\n\nAfter 1992 (dissolution of Czechoslovakia)\n\nThe Army of the Czech Republic was formed after the Czechoslovak Armed Forces split after the 1 January 1993 dissolution of Czechoslovakia. Czech forces stood at 90,000 in 1993. They were reduced to around 65,000 in 11 combat brigades and the Air Force in 1997, to 63,601 in 1999, and to 35,000 in 2005. At the same time, the forces were modernized and reoriented towards a defensive posture. In 2004, the army transformed itself into a fully professional organization and compulsory military service was abolished. The Army maintains an active reserve.\n\nThe Czech Republic is a member of the United Nations and the Organization for Security and Co-operation in Europe.  At the 1999 Washington summit, the Czech Republic joined NATO. Since 1990, the ACR and the Czech Armed Forces have contributed to numerous peacekeeping and humanitarian operations, including IFOR, SFOR, and EUFOR Althea in Bosnia, Desert Shield/Desert Storm, Afghanistan, Kosovo, Albania, Turkey, Pakistan and with the Coalition forces in Iraq.\n\nCurrent deployments (2018):\n\n*Lithuania: NATO Operation (NATO Enhanced Forward Presence) - 250 soldiers\n*Latvia: NATO Operation (NATO Enhanced Forward Presence) - 40 soldiers\n*Afghanistan: NATO Operation (Resolute Support Mission) - 230 soldiers\n*Kosovo: NATO Operation (KFOR) - 10 soldiers\n*Mali: EU military training mission (EUTM Mali) - 41 soldiers\n*Mali: UN peacekeeping mission (MINUSMA) - 3 soldiers\n*Somalia: EU Operation Atalanta (NAVFOR) - 3 soldiers\n*Sinai:  International peacekeeping force (MFO) - 18 soldiers\n*Iraq:  Military intervention against the Islamic State of Iraq and Syria (OIR) - 30 soldiers (air advisory team), 12 soldiers (chemical unit)\n*Mediterranean Sea: EU military operation (EU Navfor Med) - 4 soldiers\n*Bosnia and Herzegovina: Military deployment to oversee the military implementation of the Dayton Agreement (European Union Force Althea) - 2 soldiers\n*Golan Heights: UN peacekeeping mission (UNDOF) - 3 soldiers\n*DR Congo: UN peacekeeping mission (MONUC) - 2 military observers\n*Mali: UN peacekeeping mission (MINUSMA) - 2 military observers\n*Kosovo: UN peacekeeping mission (UNMIK) - 2 military observers\n*Central African Republic: UN peacekeeping mission (MINUSCA) - 3 military observers\n\nStructure\n\nStructure of the Czech Armed Forces consists of two parts:\n\n* General Staff of Czech Armed Forces (Praha)\n**  Czech Land Forces (Praha)\n**  Czech Air Force (Praha)\n\nThe 153rd Engineer Battalion based in Olomouc was created on 15 October 2008 and is subordinated to the 15th Engineer Regiment. The unit is stationed in the outskirts of the city of Olomouc, in place of the canceled 156th Rescue Battalion.http://www.153zpr.army.cz - webové stránky praporu www.153zpr.army.cz\n\nActive reserves\n\nActive Reserve (in Czech Aktivní záloha) is a part of the otherwise professional Army of the Czech Republic. This service was created to allow the participation of citizens with a positive attitude to the military.\n\nA volunteer needs either to have completed the compulsory military service (which ended in 2004) or to attend 8 week training. Then the reservists have to serve up to three weeks a year and can be called up to serve two weeks during a non-military crisis. They are not intended to serve abroad. The Reserve presents itself on events like BAHNA, a military show.\n\nEquipment\n\nThe Army of the Czech Republic is, to a large extent, using inventory dating back to the times of the Warsaw Pact. During the Cold War, Czechoslovakia was a major supplier of tanks, armoured personnel carriers, military trucks and trainer aircraft – the bulk of military exports went to its Comecon partners. Replacement of the obsolescent equipment, or making it at least compliant with the NATO standards, is urgently required. Modernization plans include acquisition of new multi-role helicopters, transport aircraft, infantry fighting vehicles or air defence radars and missiles. If possible, the Czech Ministry of Defence selects products that are manufactured or co-produced in the Czech Republic. This includes firearms of the Česká zbrojovka Uherský Brod, namely the CZ 75 pistols, CZ Scorpion Evo 3 submachine guns, CZ 805 BREN and BREN 2 assault rifles. Moreover, the Czech Army is equipped with about 3000 T810 and T815 vehicles of various modifications produced by the Czech Tatra Trucks company. Tatra Defence Vehicle factory ensures licensed production of Pandur II and Titus armoured vehicles. Aircraft such as the Aero L-39 Albatros, Aero L-159 Alca and Let L-410 Turbolet have been produced domestically as well.\n\nImage:Střelecká příprava.jpg|Soldiers with CZ-805 BREN assault rifles \nImage:Areál čs. opevnění v Darkovičkách - akce.jpg|Czech modernizedT-72M4 CZ\nImage:BVP-2 military parade Prague.jpg|Czech BVP-2 at 2008 Prague military parade\nImage:KBV-PZLOK.JPG|Czech Pandur II 8x8 wheeled IFV\nImage:Tatra T-810 Czech Army 01.jpg|Tatra 810 medium truck\nImage:131121-A-KH850-004_(11045794563).jpg|ShKH-77 Dana: 152mm Self-propelled cannon howitzer\nImage:Czech Mi-24 CIAF.JPG|Czech Air Force modernized Mi-24V helicopter gunship\nImage:1-3cc-area-51.JPG|Czech Air Force W-3A\nImage:Saab.jas39c.gripen.taxi.arp.jpg|Czech Air Force JAS 39 Gripen\nImage:L-159 ALCA Czech Air Force.jpg|Czech Air Force L-159 light combat aircraft\n\nUniforms\n\nDifferent types of Czech Army uniforms:\n\nImage:Czech ISAF (6).jpg|Commando soldier from ÚSO VP SOG in desert camouflage uniform in Afghanistan\nImage:Czech KFOR (1).jpg|Standard woodland pattern camouflage uniform\nImage:Aktivni_zalohy_ACR.jpg|Members of the Active Reserve during exercise\nImage:Posadkova hudba Olomouc.jpg|Czech military band in Olomouc\nImage:Posadkova hudba Olomouc 2.jpg|Czech military band in Olomouc\nImage:Czechguards.jpg|Soldier of Prague Castle guard holding ceremonial Vz. 52 rifle\n\nCommanding officers\n\n*Chief of the General Staff: Army General Josef Bečvář\n*First Deputy Chief of the General Staff: Major General Miroslav Žižka\n*Deputy Chief of the General Staff of the AČR-Chief of Staff: Major General Bohuslav Dvořák\n*Deputy Chief of the General Staff - Director of Joint Operation Centre: Major General Aleš Opata\n*Deputy Chief of the General Staff - Inspector of the AČR: Major General František Malenínský\n**Immediately Subordinated Offices:\n**Military Regional Office, Boletice\n**Military Regional Office, Brdy\n**Military Regional Office, Březina\n**Military Regional Office, Hradiště\n**Military Regional Office, Libavá\n*Support Policy Division: Director Major General Pavel Jevula\n**Immediately Subordinated Institutions:\n**Central Military Hospital, Prague\n**Military Hospital, Brno\n**Military Hospital, Olomouc\n**Institute of Aviation Medicine, Prague\n*Communication and Information Systems Division:Director - Chief of the Signal Corps of AČR: Colonel Jan Kaše\n**Immediately Subordinated Institutions:\n**6th Communication Centre\n**Research and Communication Centre 080\n**Information Technology Development Agency\n*Force Planning Division: Acting Director Colonel František Mičánek\n*Reconnaissance and Electronic Warfare Department: Director Colonel Miroslav Žižka\n**Immediately Subordinated Office:\n**Military Geography and Hydrometeorology Office\n*Military Aviation Authority: Director Colonel Josef Otta\n\nCurrent and historic military ranks \n\nThese are the military ranks, historic and present-day, of the Armed Forces of the Czech Republic and its predecessor force, the Czechoslovak Armed Forces, later known as the People's Army.\n\nEnlisted and non-commissioned officers \n\n* Vojín - Private, Airman\n* Svobodník - Private First Class, Airman first class\n* Desátník - Corporal, Senior Airman\n* Četař - Sergeant\n* Četař jednoroční dobrovolník - Volunteer Sergeant (used 1919-1920)\n* Rotný - Staff Sergeant (formerly Sikovatel from 1919-20)\n* Štábní šikovatel - Company Sergeant Major (used 1918-1920)\n* Staršina - Platoon Sergeant, Flight sergeant (part of the rank system 1948-1959)\n* Rotmistr - Sergeant First Class, Technical Sergeant\n* Nadrotmistr - Master Sergeant\n* Štábní rotmistr - First Sergeant (abolished 2011)\n\nWarrant officers \n\n* Důstojnický zástupce - Cadet Warrant officer (used 1919-1920)\n* Podpraporčík - First Warrant Officer (abolished 2011)\n* Praporčík - Warrant officer\n* Nadpraporčík - Senior Warrant Officer\n* Štábní praporčík - Chief Warrant Officer (abolished 1949, reinstated 1999)\n\nOfficer cadets and military school cadets \n\n* Kadet Aspirant - Officer cadet (used 1919-1920)\n* Gážista mimo hodnostní třídu - Reserve Officer Candidate (used 1919-1920)\n\nOfficers \n\n* Podporučík OF-1c - Sub-lieutenant (abolished 2011)\n* Poručík OF-1b - Second lieutenant, Lieutenant\n* Nadporučík OF-1a - First lieutenant \n* Kapitán - Captain (formerly Setník in the Home Army)\n* Štábní kapitán - Senior Captain (abolished 1952)\n* Major\n* Podplukovník - Lieutenant colonel\n* Plukovník - Colonel\n* Brigádní generál - Brigade General (Jun 12th, 1953 to generálmajor, 1999 reinstated to Brigádní generál)\n* Divizní generál - Divisional General (Jun 12th, 1953 to generálporučík)\n* Generálmajor - Major General (exists Jun 12th, 1953 to present)\n* Generálporučík - Lieutenant General (exists Jun 12th, 1953 to present)\n* Polní podmaršálek - Lieutenant Field Marshal (used 1918-1920)\n* Sborový generál - Corps General (Jun 12th, 1953 to generálplukovník)\n* Generálplukovník - Colonel General (abolished 1998)\n* Generál  - General (created in 1920 and abolished 1930, today highest rank in Slovakia)\n* Armádní generál - General of the Army, General of the Air Force\n* Polní zbrojmistr - Field marshal (used 1918-1920). Army of the Czech Republic. http://en.wikipedia.org/?curid=5853."
  }
}
