{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2870",
  "eid" : "c2e09fb0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778406699,
  "textBody" : "Antipsychotics, also known as neuroleptics or major tranquilizers, are a class of medication primarily used to manage psychosis (including delusions, hallucinations, paranoia or disordered thought), principally in schizophrenia and bipolar disorder. They are increasingly being used in the management of non-psychotic disorders. Antipsychotics are usually effective in relieving symptoms of psychosis in the short term.\n\nThe long-term use of antipsychotics is associated with side effects such as involuntary movement disorders, gynecomastia, and metabolic syndrome. They are also associated with increased mortality in elderly people with dementia.\n\nFirst-generation antipsychotics, known as typical antipsychotics, were discovered in the 1950s. Most second-generation drugs, known as atypical antipsychotics, have been developed more recently, although the first atypical antipsychotic, clozapine, was discovered in the 1960s and introduced clinically in the 1970s. Both generations of medication tend to block receptors in the brain's dopamine pathways, but atypicals tend to act on serotonin receptors as well. Neuroleptic, originating from  (neuron) and \"λαμβάνω\"  (take hold of) - thus meaning \"which takes the nerve\" - refers to both common neurological effects and side effects.\n\nMedical uses\n\nAntipsychotics are most frequently used for the following conditions:\n* Schizophrenia\n* Schizoaffective disorder most commonly in conjunction with either an antidepressant (in the case of the depressive subtype) or a mood stabiliser (in the case of the bipolar subtype). \n* Bipolar disorder (acute mania and mixed episodes) may be treated with either typical or atypical antipsychotics, although atypical antipsychotics are usually preferred because they tend to have more favourable adverse effect profiles and, according to a recent meta-analysis, they tend to have a lower liability for causing conversion from mania to depression.\n* Psychotic depression. In this indication it is a common practice for the psychiatrist to prescribe a combination of an atypical antipsychotic and an antidepressant as this practice is best supported by the evidence.\n* Treatment-resistant (and not necessarily psychotic) major depression as an adjunct to standard antidepressant therapy.\n\nThey are not recommended for dementia or insomnia unless other treatments have not worked. They are not recommended in children unless other treatments are not effective or unless the child has psychosis.\n\nThe World Health Organisation provides a description of recommendations for the prescription of anti-psychotics for the purposes of the treatment of psychosis.[http://www.who.int/mental_health/mhgap/evidence/psychosis/q1/en/ Antipsychotic medications for psychotic disorders]  World Health Organisation 2012 Accessed October 12th, 2017\n\nSchizophrenia\n\nAntipsychotic drug treatment is a key component of schizophrenia treatment algorithms recommended by the National Institute of Health and Care Excellence (NICE), the American Psychiatric Association, and the British Society for Psychopharmacology. The main effect of treatment with antipsychotics is to reduce the so-called \"positive\" symptoms, including delusions and hallucinations.  There is mixed evidence to support a significant impact of antipsychotic use on negative symptoms (such as apathy, lack of emotional affect, and lack of interest in social interactions) or on the cognitive symptoms (disordered thinking, reduced ability to plan and execute tasks) of schizophrenia. In general, the efficacy of antipsychotic treatment in reducing both positive and negative symptoms appears to increase with increasing severity of baseline symptoms.\n\nApplications of antipsychotic drugs in the treatment of schizophrenia include prophylaxis in those showing symptoms that suggest that they are at high risk of developing psychosis, treatment of first episode psychosis, maintenance therapy, and treatment of recurrent episodes of acute psychosis.\n\nPrevention of psychosis and symptom improvement\n\nTest batteries such as the PACE (Personal Assessment and Crisis Evaluation Clinic) and COPS (Criteria of Prodromal Syndromes), which measure low level psychotic symptoms, and others focused on cognitive disturbances (Basic symptoms\"), are used to evaluate people with early, low level symptoms of psychosis.  Used in combination with family history information, these tests can identify a \"high risk\" group having a 20–40% risk of progression to frank psychosis within 2 years. These patients are often treated with low doses of antipsychotic drugs with the goal of reducing their symptoms and preventing progression to frank psychosis.  While generally useful for reducing symptoms, the clinical trials performed to date provide little evidence that early use of antipsychotics, alone or in combination with cognitive-behavioral therapy, provides improved long term outcomes in those with prodromal symptoms.\n\nFirst episode psychosis\n\nNICE recommends that all persons presenting with a first episode of frank psychosis be treated with both an antipsychotic drug and cognitive-behavioral therapy (CBT).  NICE further recommends that those expressing a preference for CBT alone be informed that combination treatment is more efficacious.  A diagnosis of schizophrenia is not normally made at this time, as up to 25% of those presenting with first episode psychosis are eventually found to suffer from bipolar disorder instead. The goals of treatment of these patients include reducing symptoms and potentially improving long-term treatment outcomes. Randomized clinical trials have provided evidence for the efficacy of antipsychotic drugs in achieving the former goal, with first-generation and second generation antipsychotics showing about equal efficacy. Evidence that early treatment has a favorable effect on long term outcomes is equivocal.\n\nRecurrent psychotic episodes\n\nPlacebo-controlled trials of both first and second generation antipsychotic drugs consistently demonstrate the superiority of active drug to placebo in suppressing psychotic symptoms. A large meta-analysis of 38 trials of antipsychotic drugs in schizophrenia acute psychotic episodes showed an effect size of about 0.5.  There is little or no difference in efficacy among approved antipsychotic drugs, including both first- and second-generation agents.  The efficacy of such drugs is suboptimal. Few patients achieve complete resolution of symptoms. Response rates, calculated using various cutoff values for symptom reduction, are low and their interpretation is complicated by high placebo response rates and selective publication of clinical trial results.\n\nMaintenance therapy\n\nThe majority of patients treated with an antipsychotic drug will experience a response within 4 weeks.  The goals of continuing treatment are to maintain suppression of symptoms, prevent relapse, improve quality of life, and support engagement in psychosocial therapy.\n\nMaintenance therapy with antipsychotic drugs is clearly superior to placebo in preventing relapse, but is associated with weight gain, movement disorders, and high dropout rates. A 3-year trial following persons receiving maintenance therapy after an acute psychotic episode found that 33% obtained long-lasting symptom reduction, 13% achieved remission, and only 27% experienced satisfactory quality of life. The effect of relapse prevention on long term outcomes is uncertain, as historical studies show little difference in long term outcomes before and after the introduction of antipsychotic drugs.\n\nA significant challenge in the use of antipsychotic drugs for the prevention of relapse is the poor rate of compliance. In spite of the relatively high rates of adverse effects associated with these drugs, some evidence, including higher dropout rates in placebo arms compared to treatment arms in randomized clinical trials, suggest that most patients who discontinue treatment do so because of suboptimal efficacy.\n\nBipolar disorder\n\nAntipsychotics are routinely used, often in conjunction with mood stabilisers such as lithium/valproate, as a first-line treatment for manic and mixed episodes associated with bipolar disorder. The reason for this combination is the therapeutic delay of the aforementioned mood stabilisers (for valproate therapeutic effects are usually seen around five days after treatment is commenced whereas lithium usually takes at least a week before the full therapeutic effects are seen) and the comparatively rapid antimanic effects of antipsychotic drugs. The antipsychotics have a documented efficacy when used alone in acute mania/mixed episodes.\n\nThree atypical antipsychotics (lurasidone, olanzapine and quetiapine) have also been found to possess efficacy in the treatment of bipolar depression as a monotherapy. Whereas only olanzapine and quetiapine have been proven to be effective broad-spectrum (i.e. against all three types of relapse— manic, mixed and depressive) prophylactic (or maintenance) treatments in patients with bipolar disorder. A recent Cochrane review also found that olanzapine had a less favourable risk/benefit ratio than lithium as a maintenance treatment for bipolar disorder.\n\nThe American Psychiatric Association and the UK National Institute for Health and Care Excellence recommend antipsychotics for managing acute psychotic episodes in schizophrenia or bipolar disorder, and as a longer-term maintenance treatment for reducing the likelihood of further episodes.The Royal College of Psychiatrists & The British Psychological Society (2003).[http://www.nice.org.uk/download.aspx?o\n289559 Schizophrenia. Full national clinical guideline on core interventions in primary and secondary care] (PDF). London: Gaskell and the British Psychological Society.  They state that response to any given antipsychotic can be variable so that trials may be necessary, and that lower doses are to be preferred where possible. A number of studies have looked at levels of \"compliance\" or \"adherence\" with antipsychotic regimes and found that discontinuation (stopping taking them) by patients is associated with higher rates of relapse, including hospitalization.\n\nDementia\n\nAn assessment for an underlying cause of behavior is needed before prescribing antipsychotic medication for symptoms of dementia.. Antipsychotics in old age dementia showed a modest benefit compared to placebo in managing aggression or psychosis, but this is combined with a fairly large increase in serious adverse events. Thus, antipsychotics should not be used routinely to treat dementia with aggression or psychosis, but may be an option in a few cases where there is severe distress or risk of physical harm to others. Psychosocial interventions may reduce the need for antipsychotics.\n\nUnipolar depression\n\nA number of atypical antipsychotics have some benefits when used in addition to other treatments in major depressive disorder. Aripiprazole, quetiapine, and olanzapine (when used in conjunction with fluoxetine) have received the Food and Drug Administration (FDA) labelling for this indication.Truven Health Analytics, Inc. DrugPoint® System (Internet) [cited 2013 Oct 2]. Greenwood Village, CO: Thomsen Healthcare; 2013. There is, however, a greater risk of side effects with their use.\n\nOther\n\nBesides the above uses antipsychotics may be used for obsessive-compulsive disorder, posttraumatic stress disorder, personality disorders, Tourette syndrome, autism and agitation in those with dementia. Evidence however does not support the use of atypical antipsychotics in eating disorders or personality disorder. Risperidone may be useful for obsessive compulsive disorder. The use of low doses of antipsychotics for insomnia, while common, is not recommended as there is little evidence of benefit and concerns regarding adverse effects. Low dose antipsychotics may also be used in treatment of impulse-behavioural and cognitive-perceptual symptoms of borderline personality disorder.\n\nIn children they may be used in those with disruptive behavior disorders, mood disorders and pervasive developmental disorders or intellectual disability. Antipsychotics are only weakly recommended for Tourette syndrome, because although they are effective, side effects are common. The situation is similar for those on the autism spectrum.\nMuch of the evidence for the off-label use of antipsychotics (for example, for dementia, OCD, PTSD, Personality Disorders, Tourette's) was of insufficient scientific quality to support such use, especially as there was strong evidence of increased risks of stroke, tremors, significant weight gain, sedation, and gastrointestinal problems. A UK review of unlicensed usage in children and adolescents reported a similar mixture of findings and concerns. A survey of children with pervasive developmental disorder found that 16.5% were taking an antipsychotic drug, most commonly for irritability, aggression, and agitation. Risperidone has been approved by the US FDA for the treatment of irritability in autistic children and adolescents.\n\nAggressive challenging behavior in adults with intellectual disability is often treated with antipsychotic drugs despite lack of an evidence base. A recent randomized controlled trial, however, found no benefit over placebo and recommended that the use of antipsychotics in this way should no longer be regarded as an acceptable routine treatment.\n\nTypicals versus atypicals\n\nIt is unclear whether the atypical (second-generation) antipsychotics offer advantages over older, first generation antipsychotics. Amisulpride, olanzapine, risperidone and clozapine may be more effective but are associated with greater side effects. Typical antipsychotics have equal drop-out and symptom relapse rates to atypicals when used at low to moderate dosages.\n\nClozapine is an effective treatment for those who respond poorly to other drugs (\"treatment-resistant\" or \"refractory\" schizophrenia), but it has the potentially serious side effect of agranulocytosis (lowered white blood cell count) in less than 4% of people.\n\nDue to bias in the research the accuracy of comparisons of atypical antipsychotics is a concern.\n\nIn 2005, a US government body, the National Institute of Mental Health published the results of a major independent study (the CATIE project). No other atypical studied (risperidone, quetiapine, and ziprasidone) did better than the typical perphenazine on the measures used, nor did they produce fewer adverse effects than the typical antipsychotic perphenazine, although more patients discontinued perphenazine owing to extrapyramidal effects compared to the atypical agents (8% vs. 2% to 4%).\n\nCompliance has not been shown to be different between the two types.\n\nMany researchers question the first-line prescribing of atypicals over typicals, and some even question the distinction between the two classes. In contrast, other researchers point to the significantly higher risk of tardive dyskinesia and other extrapyramidal symptoms with the typicals and for this reason alone recommend first-line treatment with the atypicals, notwithstanding a greater propensity for metabolic adverse effects in the latter. The UK government organization NICE recently revised its recommendation favoring atypicals, to advise that the choice should be an individual one based on the particular profiles of the individual drug and on the patient's preferences.\n\nThe re-evaluation of the evidence has not necessarily slowed the bias toward prescribing the atypicals.\n\nAdverse effects\n\nGenerally, more than one antipsychotic drug should not be used at a time because of increased adverse effects., which cites\n* \n* \n* \n\nVery rarely antipsychotics may cause tardive psychosis.\n\nBy rate\n\n;Common (≥ 1% and up to 50% incidence for most antipsychotic drugs) adverse effects of antipsychotics include:\n* Sedation (particularly common with asenapine, clozapine, olanzapine, quetiapine, chlorpromazine and zotepine)\n* Headaches\n* Dizziness\n* Diarrhea\n* Anxiety\n* Extrapyramidal side effects (particularly common with first-generation antipsychotics), which include:\n- Akathisia — an often distressing sense of inner restlessness.\n- Dystonia\n- Parkinsonism\n- Tremor\n* Hyperprolactinaemia (rare for those treated with clozapine, quetiapine and aripiprazole), which can cause:\n- Galactorrhoea — unusual secretion of breast milk.\n- Gynaecomastia\n- Sexual dysfunction (in both sexes)\n- Osteoporosis\n* Orthostatic hypotension\n* Weight gain (particularly prominent with clozapine, olanzapine, quetiapine and zotepine)\n* Anticholinergic side-effects (common for olanzapine, clozapine; less likely on risperidone ) such as:\n- Blurred vision\n- Constipation\n- Dry mouth (although hypersalivation may also occur)\n- Reduced perspiration\n* Tardive dyskinesia appears to be more frequent with high-potency first-generation antipsychotics, such as haloperidol, and tends to appear after chronic and not acute treatment. It is characterised by slow (hence the tardive) repetitive, involuntary and purposeless movements, most often of the face, lips, legs, or torso, which tend to resist treatment and are frequently irreversible. The rate of appearance of TD is about 5% per year of use of antipsychotic drug (whatever the drug used).\n\n;Rare/Uncommon ( Evidence suggests that females are more sensitive to the metabolic side effects of first-generation antipsychotic drugs than males. Metabolic adverse effects appears to be mediated by the following mechanisms:\n- Causing weight gain by antagonising the histamine H1 and serotonin 5-HT2Creceptors and perhaps by interacting with other neurochemical pathways in the central nervous system.\n* Neuroleptic malignant syndrome a potentially fatal condition characterised by:\n- Autonomic instability, which can manifest with tachycardia, nausea, vomiting, diaphoresis, etc.\n- Hyperthermia — elevated body temperature.\n- Mental status change (confusion, hallucinations, coma, etc.)\n- Muscle rigidity\n- Laboratory abnormalities (e.g., elevated creatine kinase, reduced iron plasma levels, electrolyte abnormalities, etc.)\n* Pancreatitis\n* QT interval prolongation — more prominent in those treated with amisulpride, pimozide, sertindole, thioridazine and ziprasidone.\n* Torsades de Pointes\n* Seizures, particularly in people treated with chlorpromazine and clozapine. \n* Thromboembolism\n* Myocardial infarction\n* Stroke\n\nLong term effects\n\nSome studies have found decreased life expectancy associated with the use of antipsychotics, and argued that more studies are needed. Antipsychotics may also increase the risk of early death in individuals with dementia.  Antipsychotics typically worsen symptoms in people who suffer from depersonalisation disorder. Antipsychotic polypharmacy (prescribing two or more antipsychotics at the same time for an individual) is a common practice but not evidence-based or recommended, and there are initiatives to curtail it. Similarly, the use of excessively high doses (often the result of polypharmacy) continues despite clinical guidelines and evidence indicating that it is usually no more effective but is usually more harmful.\n\nLoss of grey matter and other brain structural changes over time are observed in schizophrenia. Meta-analyses of the effects of antipsychotic treatment on the course of grey matter loss and structural changes have reached conflicting conclusions.  A 2012 meta-analysis concluded that grey matter loss is greater in patients treated with first generation antipsychotics relative to those treated with atypicals, and hypothesized a protective effect of atypicals as one possible explanation. A second meta-analysis suggested that treatment with antipsychotics was associated with increased grey matter loss.\n\nSubtle, long-lasting forms of akathisia are often overlooked or confused with post-psychotic depression, in particular when they lack the extra pyramidal aspect that psychiatrists have been taught to expect when looking for signs of akathisia.\n\nWithdrawal\n\nWithdrawal symptoms from antipsychotics may emerge during dosage reduction and discontinuation. Withdrawal symptoms can include nausea, emesis, anorexia, diarrhea, rhinorrhea, diaphoresis, myalgia, paresthesia, anxiety, dysphoria or depression, cognitive dysfunction, worsening of negative symptoms, agitation, restlessness, and insomnia. The psychological withdrawal symptoms can be mistaken for a relapse of the underlying disorder. Better management of the withdrawal syndrome may improve the ability of individuals to discontinue antipsychotics.\n\nUnexpected psychotic episodes have been observed in patients withdrawing from clozapine. This is referred to as supersensitivity psychosis, not to be equated with tardive psychosis.\n\nTardive dyskinesia may abate during withdrawal from the antispsychotic agent, or it may persist.\n\nWithdrawal effects may also occur when switching a person from one antipsychotic to another, (it is presumed due to variations of potency and receptor activity). Such withdrawal effects can include cholinergic rebound, an activation syndrome, and motor syndromes including dyskinesias. These adverse effects are more likely during rapid changes between antipsychotic agents, so making a gradual change between antipsychotics minimises these withdrawal effects. The British National Formulary recommends a gradual withdrawal when discontinuing antipsychotic treatment to avoid acute withdrawal syndrome or rapid relapse. The process of cross-titration involves gradually increasing the dose of the new medication while gradually decreasing the dose of the old medication.\n\nList of agents \n\nClinically used antipsychotic medications are listed below by drug group. Trade names appear in parentheses. A 2013 review has stated that the division of antipsychotics into first and second generation is perhaps not accurate.\n\nNotes:\n\n† indicates drugs that are no longer (or were never) marketed in English-speaking countries. \n\n‡ denotes drugs that are no longer (or were never to begin with) marketed in the United States. Some antipsychotics are not firmly placed in either first-generation or second-generation classes.\n\n# denotes drugs that have been withdrawn worldwide.\n\nFirst-generation (typical)\n\nButyrophenones\n\n* Benperidol‡\n* Bromperidol†\n* Droperidol‡\n* Haloperidol\n* Moperone (discontinued)†\n* Pipamperone (discontinued)†\n* Timiperone †\n\nDiphenylbutylpiperidines\n\n* Fluspirilene ‡ \n* Penfluridol ‡ \n* Pimozide\n\nPhenothiazines\n\n* Acepromazine † — although it is mostly used in veterinary medicine. \n* Chlorpromazine\n* Cyamemazine †\n* Dixyrazine †\n* Fluphenazine\n* Levomepromazine‡\n* Mesoridazine (discontinued))†\n* Perazine \n* Pericyazine‡\n* Perphenazine \n* Pipotiazine ‡\n* Prochlorperazine \n* Promazine (discontinued))\n* Promethazine \n* Prothipendyl †\n* Thioproperazine‡ (only English-speaking country it is available in is Canada)\n* Thioridazine (discontinued)\n* Trifluoperazine \n* Triflupromazine  (discontinued))†\n\nThioxanthenes\n\n* Chlorprothixene †\n* Clopenthixol \n* Flupentixol ‡\n* Thiothixene \n* Zuclopenthixol ‡\n\nDisputed/unknown\n\nThis category is for drugs that have been called both first and second-generation, depending on the literature being used.\n\nBenzamides\n\n* Sulpiride ‡\n* Sultopride †\n* Veralipride †\n\nTricyclics\n\n* Carpipramine †\n* Clocapramine †\n* Clorotepine †\n* Clotiapine ‡\n* Loxapine \n* Mosapramine †\n\nOthers\n\n* Molindone #\n\nSecond-generation (atypical)\n\nBenzamides\n\n* Amisulpride ‡ – Selective dopamine antagonist. Higher doses (greater than 400 mg) act upon post-synaptic dopamine receptors resulting in a reduction in the positive symptoms of schizophrenia, such as psychosis. Lower doses, however, act upon dopamine autoreceptors, resulting in increased dopamine transmission, improving the negative symptoms of schizophrenia. Lower doses of amisulpride have also been shown to have antidepressant and anxiolytic effects in non-schizophrenic patients, leading to its use in dysthymia and social phobias.\n* Nemonapride † – Used in Japan.\n* Remoxipride # – Has a risk of causing aplastic anaemia and, hence, has been withdrawn from the market worldwide. It has also been found to possess relatively low (virtually absent) potential to induce hyperprolactinaemia and extrapyramidal symptoms, likely attributable to its comparatively weak binding to (and, hence, rapid dissociation from) the D2 receptor.\n* Sultopride – An atypical antipsychotic of the benzamide chemical class used in Europe, Japan, and Hong Kong for the treatment of schizophrenia. It was launched by Sanofi-Aventis in 1976. Sultopride acts as a selective D2 and D3 receptor antagonist.\n\nBenzisoxazoles/benzisothiazoles\n\n* Iloperidone – Approved by the US FDA in 2009, it is fairly well tolerated, although hypotension, dizziness, and somnolence were very common side effects. Has not received regulatory approval in other countries, however.\n* Lurasidone – Approved by the US FDA for schizophrenia and bipolar depression. Given once daily, it has shown mixed Phase III efficacy results but has a relatively well-tolerated side effect profile. It is also licensed for use as schizophrenia treatment in Canada. Not yet licensed elsewhere, however. Has procognitive effects via its antagonism of the 5-HT7 receptor.\n* Paliperidone – Primary Metabolite of risperidone that was approved in 2006.\n* Paliperidone palmitate – Long-acting version of paliperidone for once-monthly injection.\n* Perospirone † – Has a higher incidence of extrapyramidal side effects than other atypical antipsychotics.\n* Risperidone – Divided dosing is recommended until initial titration is completed, at which time the drug can be administered once daily. Used off-label to treat Tourette syndrome and anxiety disorder.\n* Ziprasidone – Approved in 2004 to treat bipolar disorder. Side-effects include a prolonged QT interval in the heart, which can be dangerous for patients with heart disease or those taking other drugs that prolong the QT interval.\n\nButyrophenones\n\n* Melperone † – Only used in a few European countries. No English-speaking country has licensed it to date.\n\nPhenylpiperazines/quinolinones\n\n* Aripiprazole – Partial agonist at the D2 receptor unlike almost all other clinically-utilized antipsychotics.\n* Aripiprazole lauroxil – Long-acting version of aripiprazole for injection.\n* Brexpiprazole – Partial agonist of the D2 receptor. Successor of aripiprazole.\n* Cariprazine – A D3-preferring D2/D3 partial agonist.\n\nTricyclics\n\n* Asenapine – Used for the treatment of schizophrenia and acute mania associated with bipolar disorder.\n* Clozapine – Requires complete blood counts every one to four weeks due to the risk of agranulocytosis. It has unparalleled efficacy in the treatment of treatment-resistant schizophrenia.\n* Olanzapine – Used to treat psychotic disorders including schizophrenia, acute manic episodes, and maintenance of bipolar disorder. Used as an adjunct to antidepressant therapy, especially to fluoxetine treatment in the form of Symbyax. \n* Quetiapine – Used primarily to treat bipolar disorder and schizophrenia. Also used and licensed in a few countries (including Australia, the United Kingdom and the United States) as an adjunct to antidepressant therapy in patients with major depressive disorder. It's the only antipsychotic that's demonstrated efficacy as a monotherapy for the treatment of major depressive disorder. It indirectly serves as a norepinephrine reuptake inhibitor by means of its active metabolite, norquetiapine.\n* Zotepine – An atypical antipsychotic indicated for acute and chronic schizophrenia. It is still used in Japan and was once used in Germany but it was discontinued.†\n\nOthers\n\n* Blonanserin – Approved by the PMDA in 2008. Used in Japan and South Korea.\n* Pimavanserin – A selective 5-HT2A receptor antagonist approved for the treatment of Parkinson's disease psychosis in 2016.\n* Sertindole ‡ – Developed by the Danish pharmaceutical company H. Lundbeck. Like the other atypical antipsychotics, it is believed to have antagonist activity at dopamine and serotonin receptors in the brain.\n\nMechanism of action\n\nAntipsychotic drugs such as haloperidol and chlorpromazine tend to block dopamine D2 receptors in the dopaminergic pathways of the brain. This means that dopamine released in these pathways has less effect. Excess release of dopamine in the mesolimbic pathway has been linked to psychotic experiences. Decreased dopamine release in the prefrontal cortex, and excess dopamine release in other pathways, are associated with psychotic episodes in schizophrenia and bipolar disorder.\nIn addition to the antagonistic effects of dopamine, antipsychotics (in particular atypical neuroleptics) also antagonize 5-HT2A receptors. Different alleles of the 5-HT2A receptor have been associated with schizophrenia and other psychoses, including depression. Higher concentrations of 5-HT2A receptors in cortical and subcortical areas, in particular in the right caudate nucleus have been historically recorded. This is the same receptor that psychedelic drugs agonize to various degrees,\nwhich explains the correlation between psychedelic drugs and schizophrenia.\n\nTypical antipsychotics are not particularly selective and also block dopamine receptors in the mesocortical pathway, tuberoinfundibular pathway, and the nigrostriatal pathway. Blocking D2 receptors in these other pathways is thought to produce some unwanted side effects that the typical antipsychotics can produce (see above). They were commonly classified on a spectrum of low potency to high potency, where potency referred to the ability of the drug to bind to dopamine receptors, and not to the effectiveness of the drug. High-potency antipsychotics such as haloperidol, in general, have doses of a few milligrams and cause less sleepiness and calming effects than low-potency antipsychotics such as chlorpromazine and thioridazine, which have dosages of several hundred milligrams. The latter have a greater degree of anticholinergic and antihistaminergic activity, which can counteract dopamine-related side-effects.\n\nAtypical antipsychotic drugs have a similar blocking effect on D2 receptors, however, most also act on serotonin receptors, especially 5-HT2A and 5-HT2C receptors. Both clozapine and quetiapine appear to bind just long enough to elicit antipsychotic effects but not long enough to induce extrapyramidal side effects and prolactin hypersecretion. 5-HT2A antagonism increases dopaminergic activity in the nigrostriatal pathway, leading to a lowered extrapyramidal side effect liability among the atypical antipsychotics.\n\nComparison of medications\n\nHistory\n\nThe original antipsychotic drugs were happened upon largely by chance and then tested for their effectiveness. The first, chlorpromazine, was developed as a surgical anesthetic. It was first used on psychiatric patients because of its powerful calming effect; at the time it was regarded as a non-permanent \"pharmacological lobotomy\". Lobotomy at the time was used to treat many behavioral disorders, including psychosis, although its effect was to markedly reduce behavior and mental functioning of all types. However, chlorpromazine proved to reduce the effects of psychosis in a more effective and specific manner than lobotomy, even though it was known to be capable of causing severe sedation. The underlying neurochemistry involved has since been studied in detail, and subsequent antipsychotic drugs have been discovered by an approach that incorporates this sort of information.\n\nThe discovery of chlorpromazine's psychoactive effects in 1952 led to greatly reduced use of restraint, seclusion, and sedation in the management of agitated patients, and also led to further research that resulted in the development of antidepressants, anxiolytics, and the majority of other drugs now used in the management of psychiatric conditions. In 1952, Henri Laborit described chlorpromazine only as inducing indifference towards what was happening around them in nonpsychotic, nonmanic patients, and Jean Delay and Pierre Deniker described it as controlling manic or psychotic agitation. The former claimed to have discovered a treatment for agitation in anyone, and the latter team claimed to have discovered a treatment for psychotic illness.Healy, D. 2005. Psychiatric Drugs Explained. 4th Ed. Britain:Elsevier Limited. P. 8, 17.\n\nUntil the 1970s there was considerable debate within psychiatry on the most appropriate term to use to describe the new drugs. In the late 1950s the most widely used term was \"neuroleptic\", followed by \"major tranquilizer\" and then \"ataraxic\". The first recorded use of the term tranquilizer dates from the early nineteenth century. In 1953 Frederik F. Yonkman, a chemist at the Swiss-based Cibapharmaceutical company, first used the term tranquilizer to differentiate reserpine from the older sedatives. The word neuroleptic was coined in 1955 by Delay and Deniker after their discovery (1952) of the antipsychotic effects of chlorpromazine. It is derived from the (neuron, originally meaning \"sinew\" but today referring to the nerves) and \"λαμβάνω\" (lambanō, meaning \"take hold of\"). Thus, the word means taking hold of one's nerves. It was often taken to refer also to common side effects such as reduced activity in general, as well as lethargy and impaired motor control. Although these effects are unpleasant and in some cases harmful, they were at one time, along with akathisia, considered a reliable sign that the drug was working. The term \"ataraxy\" was coined by the neurologist Howard Fabing and the classicist Alister Cameron to describe the observed effect of psychic indifference and detachment in patients treated with chlorpromazine. This term derived from the Greek adjective \"ἀτάρακτος\" (ataraktos), which means \"not disturbed, not excited, without confusion, steady, calm\". In the use of the terms \"tranquilizer\" and \"ataractic\", medical practitioners distinguished between the \"major tranquilizers\" or \"major ataractics\", which referred to drugs used to treat psychoses, and the \"minor tranquilizers\" or \"minor ataractics\", which referred to drugs used to treat neuroses. While popular during the 1950s, these terms are infrequently used today. They are being abandoned in favor of \"antipsychotic\", which refers to the drug's desired effects. Today, \"minor tranquilizer\" can refer to anxiolytic and/or hypnotic drugs such as the benzodiazepines and nonbenzodiazepines, which have some antipsychotic properties and are recommended for concurrent use with antipsychotics, and are useful for insomnia or drug-induced psychosis. They are powerful (and potentially addictive) sedatives.\n\nAntipsychotics are broadly divided into two groups, the typical or first-generation antipsychotics and the atypical or second-generation antipsychotics. The typical antipsychotics are classified according to their chemical structure while the atypical antipsychotics are classified according to their pharmacological properties. These include serotonin-dopamine antagonists (see dopamine antagonist and serotonin antagonist), multi-acting receptor-targeted antipsychotics (MARTA, those targeting several systems), and dopamine partial agonists, which are often categorized as atypicals.\n\nSociety and culture\n\nTerminology\n\nThe term major tranquilizer was used for older antipsychotic drugs. The term neuroleptic is often used as a synonym for antipsychotic, even though - strictly speaking - the two terms are not interchangeable. Antipsychotic drugs are a subgroup of neuroleptic drugs, because the latter have a wider range of effects.R. Elliott Ingersoll, Carl F. Rak (2015): Psychopharmacology for Mental Health Professionals: An Integrative Approach, Cengage Learning, Boston, pp. 150-186 and 342-349, .\n\nAntipsychotics are a type of psychoactive or psychotropic medication.\n\nSales\n\nAntipsychotics were once among the biggest selling and most profitable of all drugs, generating $22 billion in global sales in 2008.[https://web.archive.org/web/20120218005726/http://www.healthcarefinancenews.com/press-release/pipeline-antipsychotic-drugs-drive-next-market-evolution Pipelineantipsychotic drugs to drive next market evolution (2009)]. Healthcarefinancenews.com (7 August 2009). By 2003 in the US, an estimated 3.21 million patients received antipsychotics, worth an estimated $2.82 billion. Over 2/3 of prescriptions were for the newer, more expensive atypicals, each costing on average $164 per year, compared to $40 for the older types. By 2008, sales in the US reached $14.6 billion, the biggest selling drugs in the US by therapeutic class.[http://www.imshealth.com/portal/site/imshealth/menuitem.a46c6d4df3db4b3d88f611019418c22a/?vgnextoid85f4a56216a10210VgnVCM100000ed152ca2RCRD&cpsextcurrchannel\n1 2008 U.S. Sales and Prescription Information: Top Therapeutic Classes by U.S. Sales (PDF)] . Imshealth.com.\n\nFormulations\n\nAntipsychotics are sometimes administered as part of compulsory psychiatric treatment via inpatient (hospital) commitment or outpatient commitment. They may be administered orally or, in some cases, through long-acting (depot) injections administered in the dorsgluteal, ventrogluteal or deltoid muscle.\n\nControversy\n\nJoanna Moncrieff has argued that antipsychotic drug treatment is often undertaken as a means of control rather than to treat specific symptoms experienced by the patient. Moncreiff has further argued that the evidence for antipsychotics from discontinuation-relapse studies may be flawed, because they do not take into account that antipsychotics may sensitize the brain and provoke psychosis if discontinued, which may then be wrongly interpreted as a relapse of the original condition.\n\nUse of this class of drugs has a history of criticism in residential care. As the drugs used can make patients calmer and more compliant, critics claim that the drugs can be overused. Outside doctors can feel under pressure from care home staff.GPs under 'pressure' to issue neuroleptics, claims professor, Chemist + Druggist, 15 January 2009 In an official review commissioned by UK government ministers it was reported that the needless use of antipsychotic medication in dementia care was widespread and was linked to 1800 deaths per year. In the US, the government has initiated legal action against the pharmaceutical company Johnson & Johnson for allegedly paying kickbacks to Omnicare to promote its antipsychotic risperidone (Risperdal) in nursing homes.\n\nThere has also been controversy about the role of pharmaceutical companies in marketing and promoting antipsychotics, including allegations of downplaying or covering up adverse effects, expanding the number of conditions or illegally promoting off-label usage; influencing drug trials (or their publication) to try to show that the expensive and profitable newer atypicals were superior to the older cheaper typicals that were out of patent. Following charges of illegal marketing, settlements by two large pharmaceutical companies in the US set records for the largest criminal fines ever imposed on corporations. One case involved Eli Lilly and Company's antipsychotic Zyprexa, and the other involved  Bextra. In the Bextra case, the government also charged Pfizer with illegally marketing another antipsychotic, Geodon. In addition, Astrazeneca faces numerous personal-injury lawsuits from former users of Seroquel (quetiapine), amidst federal investigations of its marketing practices. By expanding the conditions for which they were indicated, Astrazeneca's Seroquel and Eli Lilly's Zyprexa had become the biggest selling antipsychotics in 2008 with global sales of $5.5 billion and $5.4 billion respectively.\n\nHarvard medical professor Joseph Biederman conducted research on bipolar disorder in children that led to an increase in such diagnoses. A 2008 Senate investigation found that Biederman also received $1.6 million in speaking and consulting fees between 2000 and 2007 — some of them undisclosed to Harvard — from companies including makers of antipsychotic drugs prescribed for children with bipolar disorder. Johnson & Johnson gave more than $700,000 to a research center that was headed by Biederman from 2002 to 2005, where research was conducted, in part, on Risperdal, the company's antipsychotic drug. Biederman has responded saying that the money did not influence him and that he did not promote a specific diagnosis or treatment.\n\nPharmaceutical companies have also been accused of attempting to set the mental health agenda through activities such as funding consumer advocacy groups.\n\nSpecial populations\n\nIt is recommended that persons with dementia who exhibit behavioral and psychological symptoms should not be given antipsychotics before trying other treatments., which cites\n* \n* \n* \n* \n*  When taking antipsychotics this population has increased risk of cerebrovascular effects, parkinsonism or extrapyramidal symptoms, sedation, confusion and other cognitive adverse effects, weight gain, and increased mortality. Physicians and caretakers of persons with dementia should try to address symptoms including agitation, aggression, apathy, anxiety, depression, irritability, and psychosis with alternative treatments whenever antipsychotic use can be replaced or reduced. Elderly persons often have their dementia treated first with antipsychotics and this is not the best management strategy., which cites\n* \n*\n* \n*",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Antipsychotic" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2870" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Antipsychotics, also known as neuroleptics or major tranquilizers, are a class of medication primarily used to manage psychosis (including delusions, hallucinations, paranoia or disordered thought), principally in schizophrenia and bipolar disorder. They are increasingly being used in the management of non-psychotic disorders. Antipsychotics are usually effective in relieving symptoms of psychosis in the short term.\n\nThe long-term use of antipsychotics is associated with side effects such as involuntary movement disorders, gynecomastia, and metabolic syndrome. They are also associated with increased mortality in elderly people with dementia.\n\nFirst-generation antipsychotics, known as typical antipsychotics, were discovered in the 1950s. Most second-generation drugs, known as atypical antipsychotics, have been developed more recently, although the first atypical antipsychotic, clozapine, was discovered in the 1960s and introduced clinically in the 1970s. Both generations of medication tend to block receptors in the brain's dopamine pathways, but atypicals tend to act on serotonin receptors as well. Neuroleptic, originating from  (neuron) and \"λαμβάνω\"  (take hold of) - thus meaning \"which takes the nerve\" - refers to both common neurological effects and side effects.\n\nMedical uses\n\nAntipsychotics are most frequently used for the following conditions:\n* Schizophrenia\n* Schizoaffective disorder most commonly in conjunction with either an antidepressant (in the case of the depressive subtype) or a mood stabiliser (in the case of the bipolar subtype). \n* Bipolar disorder (acute mania and mixed episodes) may be treated with either typical or atypical antipsychotics, although atypical antipsychotics are usually preferred because they tend to have more favourable adverse effect profiles and, according to a recent meta-analysis, they tend to have a lower liability for causing conversion from mania to depression.\n* Psychotic depression. In this indication it is a common practice for the psychiatrist to prescribe a combination of an atypical antipsychotic and an antidepressant as this practice is best supported by the evidence.\n* Treatment-resistant (and not necessarily psychotic) major depression as an adjunct to standard antidepressant therapy.\n\nThey are not recommended for dementia or insomnia unless other treatments have not worked. They are not recommended in children unless other treatments are not effective or unless the child has psychosis.\n\nThe World Health Organisation provides a description of recommendations for the prescription of anti-psychotics for the purposes of the treatment of psychosis.[http://www.who.int/mental_health/mhgap/evidence/psychosis/q1/en/ Antipsychotic medications for psychotic disorders]  World Health Organisation 2012 Accessed October 12th, 2017\n\nSchizophrenia\n\nAntipsychotic drug treatment is a key component of schizophrenia treatment algorithms recommended by the National Institute of Health and Care Excellence (NICE), the American Psychiatric Association, and the British Society for Psychopharmacology. The main effect of treatment with antipsychotics is to reduce the so-called \"positive\" symptoms, including delusions and hallucinations.  There is mixed evidence to support a significant impact of antipsychotic use on negative symptoms (such as apathy, lack of emotional affect, and lack of interest in social interactions) or on the cognitive symptoms (disordered thinking, reduced ability to plan and execute tasks) of schizophrenia. In general, the efficacy of antipsychotic treatment in reducing both positive and negative symptoms appears to increase with increasing severity of baseline symptoms.\n\nApplications of antipsychotic drugs in the treatment of schizophrenia include prophylaxis in those showing symptoms that suggest that they are at high risk of developing psychosis, treatment of first episode psychosis, maintenance therapy, and treatment of recurrent episodes of acute psychosis.\n\nPrevention of psychosis and symptom improvement\n\nTest batteries such as the PACE (Personal Assessment and Crisis Evaluation Clinic) and COPS (Criteria of Prodromal Syndromes), which measure low level psychotic symptoms, and others focused on cognitive disturbances (Basic symptoms\"), are used to evaluate people with early, low level symptoms of psychosis.  Used in combination with family history information, these tests can identify a \"high risk\" group having a 20–40% risk of progression to frank psychosis within 2 years. These patients are often treated with low doses of antipsychotic drugs with the goal of reducing their symptoms and preventing progression to frank psychosis.  While generally useful for reducing symptoms, the clinical trials performed to date provide little evidence that early use of antipsychotics, alone or in combination with cognitive-behavioral therapy, provides improved long term outcomes in those with prodromal symptoms.\n\nFirst episode psychosis\n\nNICE recommends that all persons presenting with a first episode of frank psychosis be treated with both an antipsychotic drug and cognitive-behavioral therapy (CBT).  NICE further recommends that those expressing a preference for CBT alone be informed that combination treatment is more efficacious.  A diagnosis of schizophrenia is not normally made at this time, as up to 25% of those presenting with first episode psychosis are eventually found to suffer from bipolar disorder instead. The goals of treatment of these patients include reducing symptoms and potentially improving long-term treatment outcomes. Randomized clinical trials have provided evidence for the efficacy of antipsychotic drugs in achieving the former goal, with first-generation and second generation antipsychotics showing about equal efficacy. Evidence that early treatment has a favorable effect on long term outcomes is equivocal.\n\nRecurrent psychotic episodes\n\nPlacebo-controlled trials of both first and second generation antipsychotic drugs consistently demonstrate the superiority of active drug to placebo in suppressing psychotic symptoms. A large meta-analysis of 38 trials of antipsychotic drugs in schizophrenia acute psychotic episodes showed an effect size of about 0.5.  There is little or no difference in efficacy among approved antipsychotic drugs, including both first- and second-generation agents.  The efficacy of such drugs is suboptimal. Few patients achieve complete resolution of symptoms. Response rates, calculated using various cutoff values for symptom reduction, are low and their interpretation is complicated by high placebo response rates and selective publication of clinical trial results.\n\nMaintenance therapy\n\nThe majority of patients treated with an antipsychotic drug will experience a response within 4 weeks.  The goals of continuing treatment are to maintain suppression of symptoms, prevent relapse, improve quality of life, and support engagement in psychosocial therapy.\n\nMaintenance therapy with antipsychotic drugs is clearly superior to placebo in preventing relapse, but is associated with weight gain, movement disorders, and high dropout rates. A 3-year trial following persons receiving maintenance therapy after an acute psychotic episode found that 33% obtained long-lasting symptom reduction, 13% achieved remission, and only 27% experienced satisfactory quality of life. The effect of relapse prevention on long term outcomes is uncertain, as historical studies show little difference in long term outcomes before and after the introduction of antipsychotic drugs.\n\nA significant challenge in the use of antipsychotic drugs for the prevention of relapse is the poor rate of compliance. In spite of the relatively high rates of adverse effects associated with these drugs, some evidence, including higher dropout rates in placebo arms compared to treatment arms in randomized clinical trials, suggest that most patients who discontinue treatment do so because of suboptimal efficacy.\n\nBipolar disorder\n\nAntipsychotics are routinely used, often in conjunction with mood stabilisers such as lithium/valproate, as a first-line treatment for manic and mixed episodes associated with bipolar disorder. The reason for this combination is the therapeutic delay of the aforementioned mood stabilisers (for valproate therapeutic effects are usually seen around five days after treatment is commenced whereas lithium usually takes at least a week before the full therapeutic effects are seen) and the comparatively rapid antimanic effects of antipsychotic drugs. The antipsychotics have a documented efficacy when used alone in acute mania/mixed episodes.\n\nThree atypical antipsychotics (lurasidone, olanzapine and quetiapine) have also been found to possess efficacy in the treatment of bipolar depression as a monotherapy. Whereas only olanzapine and quetiapine have been proven to be effective broad-spectrum (i.e. against all three types of relapse— manic, mixed and depressive) prophylactic (or maintenance) treatments in patients with bipolar disorder. A recent Cochrane review also found that olanzapine had a less favourable risk/benefit ratio than lithium as a maintenance treatment for bipolar disorder.\n\nThe American Psychiatric Association and the UK National Institute for Health and Care Excellence recommend antipsychotics for managing acute psychotic episodes in schizophrenia or bipolar disorder, and as a longer-term maintenance treatment for reducing the likelihood of further episodes.The Royal College of Psychiatrists & The British Psychological Society (2003).[http://www.nice.org.uk/download.aspx?o\n289559 Schizophrenia. Full national clinical guideline on core interventions in primary and secondary care] (PDF). London: Gaskell and the British Psychological Society.  They state that response to any given antipsychotic can be variable so that trials may be necessary, and that lower doses are to be preferred where possible. A number of studies have looked at levels of \"compliance\" or \"adherence\" with antipsychotic regimes and found that discontinuation (stopping taking them) by patients is associated with higher rates of relapse, including hospitalization.\n\nDementia\n\nAn assessment for an underlying cause of behavior is needed before prescribing antipsychotic medication for symptoms of dementia.. Antipsychotics in old age dementia showed a modest benefit compared to placebo in managing aggression or psychosis, but this is combined with a fairly large increase in serious adverse events. Thus, antipsychotics should not be used routinely to treat dementia with aggression or psychosis, but may be an option in a few cases where there is severe distress or risk of physical harm to others. Psychosocial interventions may reduce the need for antipsychotics.\n\nUnipolar depression\n\nA number of atypical antipsychotics have some benefits when used in addition to other treatments in major depressive disorder. Aripiprazole, quetiapine, and olanzapine (when used in conjunction with fluoxetine) have received the Food and Drug Administration (FDA) labelling for this indication.Truven Health Analytics, Inc. DrugPoint® System (Internet) [cited 2013 Oct 2]. Greenwood Village, CO: Thomsen Healthcare; 2013. There is, however, a greater risk of side effects with their use.\n\nOther\n\nBesides the above uses antipsychotics may be used for obsessive-compulsive disorder, posttraumatic stress disorder, personality disorders, Tourette syndrome, autism and agitation in those with dementia. Evidence however does not support the use of atypical antipsychotics in eating disorders or personality disorder. Risperidone may be useful for obsessive compulsive disorder. The use of low doses of antipsychotics for insomnia, while common, is not recommended as there is little evidence of benefit and concerns regarding adverse effects. Low dose antipsychotics may also be used in treatment of impulse-behavioural and cognitive-perceptual symptoms of borderline personality disorder.\n\nIn children they may be used in those with disruptive behavior disorders, mood disorders and pervasive developmental disorders or intellectual disability. Antipsychotics are only weakly recommended for Tourette syndrome, because although they are effective, side effects are common. The situation is similar for those on the autism spectrum.\nMuch of the evidence for the off-label use of antipsychotics (for example, for dementia, OCD, PTSD, Personality Disorders, Tourette's) was of insufficient scientific quality to support such use, especially as there was strong evidence of increased risks of stroke, tremors, significant weight gain, sedation, and gastrointestinal problems. A UK review of unlicensed usage in children and adolescents reported a similar mixture of findings and concerns. A survey of children with pervasive developmental disorder found that 16.5% were taking an antipsychotic drug, most commonly for irritability, aggression, and agitation. Risperidone has been approved by the US FDA for the treatment of irritability in autistic children and adolescents.\n\nAggressive challenging behavior in adults with intellectual disability is often treated with antipsychotic drugs despite lack of an evidence base. A recent randomized controlled trial, however, found no benefit over placebo and recommended that the use of antipsychotics in this way should no longer be regarded as an acceptable routine treatment.\n\nTypicals versus atypicals\n\nIt is unclear whether the atypical (second-generation) antipsychotics offer advantages over older, first generation antipsychotics. Amisulpride, olanzapine, risperidone and clozapine may be more effective but are associated with greater side effects. Typical antipsychotics have equal drop-out and symptom relapse rates to atypicals when used at low to moderate dosages.\n\nClozapine is an effective treatment for those who respond poorly to other drugs (\"treatment-resistant\" or \"refractory\" schizophrenia), but it has the potentially serious side effect of agranulocytosis (lowered white blood cell count) in less than 4% of people.\n\nDue to bias in the research the accuracy of comparisons of atypical antipsychotics is a concern.\n\nIn 2005, a US government body, the National Institute of Mental Health published the results of a major independent study (the CATIE project). No other atypical studied (risperidone, quetiapine, and ziprasidone) did better than the typical perphenazine on the measures used, nor did they produce fewer adverse effects than the typical antipsychotic perphenazine, although more patients discontinued perphenazine owing to extrapyramidal effects compared to the atypical agents (8% vs. 2% to 4%).\n\nCompliance has not been shown to be different between the two types.\n\nMany researchers question the first-line prescribing of atypicals over typicals, and some even question the distinction between the two classes. In contrast, other researchers point to the significantly higher risk of tardive dyskinesia and other extrapyramidal symptoms with the typicals and for this reason alone recommend first-line treatment with the atypicals, notwithstanding a greater propensity for metabolic adverse effects in the latter. The UK government organization NICE recently revised its recommendation favoring atypicals, to advise that the choice should be an individual one based on the particular profiles of the individual drug and on the patient's preferences.\n\nThe re-evaluation of the evidence has not necessarily slowed the bias toward prescribing the atypicals.\n\nAdverse effects\n\nGenerally, more than one antipsychotic drug should not be used at a time because of increased adverse effects., which cites\n* \n* \n* \n\nVery rarely antipsychotics may cause tardive psychosis.\n\nBy rate\n\n;Common (≥ 1% and up to 50% incidence for most antipsychotic drugs) adverse effects of antipsychotics include:\n* Sedation (particularly common with asenapine, clozapine, olanzapine, quetiapine, chlorpromazine and zotepine)\n* Headaches\n* Dizziness\n* Diarrhea\n* Anxiety\n* Extrapyramidal side effects (particularly common with first-generation antipsychotics), which include:\n- Akathisia — an often distressing sense of inner restlessness.\n- Dystonia\n- Parkinsonism\n- Tremor\n* Hyperprolactinaemia (rare for those treated with clozapine, quetiapine and aripiprazole), which can cause:\n- Galactorrhoea — unusual secretion of breast milk.\n- Gynaecomastia\n- Sexual dysfunction (in both sexes)\n- Osteoporosis\n* Orthostatic hypotension\n* Weight gain (particularly prominent with clozapine, olanzapine, quetiapine and zotepine)\n* Anticholinergic side-effects (common for olanzapine, clozapine; less likely on risperidone ) such as:\n- Blurred vision\n- Constipation\n- Dry mouth (although hypersalivation may also occur)\n- Reduced perspiration\n* Tardive dyskinesia appears to be more frequent with high-potency first-generation antipsychotics, such as haloperidol, and tends to appear after chronic and not acute treatment. It is characterised by slow (hence the tardive) repetitive, involuntary and purposeless movements, most often of the face, lips, legs, or torso, which tend to resist treatment and are frequently irreversible. The rate of appearance of TD is about 5% per year of use of antipsychotic drug (whatever the drug used).\n\n;Rare/Uncommon ( Evidence suggests that females are more sensitive to the metabolic side effects of first-generation antipsychotic drugs than males. Metabolic adverse effects appears to be mediated by the following mechanisms:\n- Causing weight gain by antagonising the histamine H1 and serotonin 5-HT2Creceptors and perhaps by interacting with other neurochemical pathways in the central nervous system.\n* Neuroleptic malignant syndrome a potentially fatal condition characterised by:\n- Autonomic instability, which can manifest with tachycardia, nausea, vomiting, diaphoresis, etc.\n- Hyperthermia — elevated body temperature.\n- Mental status change (confusion, hallucinations, coma, etc.)\n- Muscle rigidity\n- Laboratory abnormalities (e.g., elevated creatine kinase, reduced iron plasma levels, electrolyte abnormalities, etc.)\n* Pancreatitis\n* QT interval prolongation — more prominent in those treated with amisulpride, pimozide, sertindole, thioridazine and ziprasidone.\n* Torsades de Pointes\n* Seizures, particularly in people treated with chlorpromazine and clozapine. \n* Thromboembolism\n* Myocardial infarction\n* Stroke\n\nLong term effects\n\nSome studies have found decreased life expectancy associated with the use of antipsychotics, and argued that more studies are needed. Antipsychotics may also increase the risk of early death in individuals with dementia.  Antipsychotics typically worsen symptoms in people who suffer from depersonalisation disorder. Antipsychotic polypharmacy (prescribing two or more antipsychotics at the same time for an individual) is a common practice but not evidence-based or recommended, and there are initiatives to curtail it. Similarly, the use of excessively high doses (often the result of polypharmacy) continues despite clinical guidelines and evidence indicating that it is usually no more effective but is usually more harmful.\n\nLoss of grey matter and other brain structural changes over time are observed in schizophrenia. Meta-analyses of the effects of antipsychotic treatment on the course of grey matter loss and structural changes have reached conflicting conclusions.  A 2012 meta-analysis concluded that grey matter loss is greater in patients treated with first generation antipsychotics relative to those treated with atypicals, and hypothesized a protective effect of atypicals as one possible explanation. A second meta-analysis suggested that treatment with antipsychotics was associated with increased grey matter loss.\n\nSubtle, long-lasting forms of akathisia are often overlooked or confused with post-psychotic depression, in particular when they lack the extra pyramidal aspect that psychiatrists have been taught to expect when looking for signs of akathisia.\n\nWithdrawal\n\nWithdrawal symptoms from antipsychotics may emerge during dosage reduction and discontinuation. Withdrawal symptoms can include nausea, emesis, anorexia, diarrhea, rhinorrhea, diaphoresis, myalgia, paresthesia, anxiety, dysphoria or depression, cognitive dysfunction, worsening of negative symptoms, agitation, restlessness, and insomnia. The psychological withdrawal symptoms can be mistaken for a relapse of the underlying disorder. Better management of the withdrawal syndrome may improve the ability of individuals to discontinue antipsychotics.\n\nUnexpected psychotic episodes have been observed in patients withdrawing from clozapine. This is referred to as supersensitivity psychosis, not to be equated with tardive psychosis.\n\nTardive dyskinesia may abate during withdrawal from the antispsychotic agent, or it may persist.\n\nWithdrawal effects may also occur when switching a person from one antipsychotic to another, (it is presumed due to variations of potency and receptor activity). Such withdrawal effects can include cholinergic rebound, an activation syndrome, and motor syndromes including dyskinesias. These adverse effects are more likely during rapid changes between antipsychotic agents, so making a gradual change between antipsychotics minimises these withdrawal effects. The British National Formulary recommends a gradual withdrawal when discontinuing antipsychotic treatment to avoid acute withdrawal syndrome or rapid relapse. The process of cross-titration involves gradually increasing the dose of the new medication while gradually decreasing the dose of the old medication.\n\nList of agents \n\nClinically used antipsychotic medications are listed below by drug group. Trade names appear in parentheses. A 2013 review has stated that the division of antipsychotics into first and second generation is perhaps not accurate.\n\nNotes:\n\n† indicates drugs that are no longer (or were never) marketed in English-speaking countries. \n\n‡ denotes drugs that are no longer (or were never to begin with) marketed in the United States. Some antipsychotics are not firmly placed in either first-generation or second-generation classes.\n\n# denotes drugs that have been withdrawn worldwide.\n\nFirst-generation (typical)\n\nButyrophenones\n\n* Benperidol‡\n* Bromperidol†\n* Droperidol‡\n* Haloperidol\n* Moperone (discontinued)†\n* Pipamperone (discontinued)†\n* Timiperone †\n\nDiphenylbutylpiperidines\n\n* Fluspirilene ‡ \n* Penfluridol ‡ \n* Pimozide\n\nPhenothiazines\n\n* Acepromazine † — although it is mostly used in veterinary medicine. \n* Chlorpromazine\n* Cyamemazine †\n* Dixyrazine †\n* Fluphenazine\n* Levomepromazine‡\n* Mesoridazine (discontinued))†\n* Perazine \n* Pericyazine‡\n* Perphenazine \n* Pipotiazine ‡\n* Prochlorperazine \n* Promazine (discontinued))\n* Promethazine \n* Prothipendyl †\n* Thioproperazine‡ (only English-speaking country it is available in is Canada)\n* Thioridazine (discontinued)\n* Trifluoperazine \n* Triflupromazine  (discontinued))†\n\nThioxanthenes\n\n* Chlorprothixene †\n* Clopenthixol \n* Flupentixol ‡\n* Thiothixene \n* Zuclopenthixol ‡\n\nDisputed/unknown\n\nThis category is for drugs that have been called both first and second-generation, depending on the literature being used.\n\nBenzamides\n\n* Sulpiride ‡\n* Sultopride †\n* Veralipride †\n\nTricyclics\n\n* Carpipramine †\n* Clocapramine †\n* Clorotepine †\n* Clotiapine ‡\n* Loxapine \n* Mosapramine †\n\nOthers\n\n* Molindone #\n\nSecond-generation (atypical)\n\nBenzamides\n\n* Amisulpride ‡ – Selective dopamine antagonist. Higher doses (greater than 400 mg) act upon post-synaptic dopamine receptors resulting in a reduction in the positive symptoms of schizophrenia, such as psychosis. Lower doses, however, act upon dopamine autoreceptors, resulting in increased dopamine transmission, improving the negative symptoms of schizophrenia. Lower doses of amisulpride have also been shown to have antidepressant and anxiolytic effects in non-schizophrenic patients, leading to its use in dysthymia and social phobias.\n* Nemonapride † – Used in Japan.\n* Remoxipride # – Has a risk of causing aplastic anaemia and, hence, has been withdrawn from the market worldwide. It has also been found to possess relatively low (virtually absent) potential to induce hyperprolactinaemia and extrapyramidal symptoms, likely attributable to its comparatively weak binding to (and, hence, rapid dissociation from) the D2 receptor.\n* Sultopride – An atypical antipsychotic of the benzamide chemical class used in Europe, Japan, and Hong Kong for the treatment of schizophrenia. It was launched by Sanofi-Aventis in 1976. Sultopride acts as a selective D2 and D3 receptor antagonist.\n\nBenzisoxazoles/benzisothiazoles\n\n* Iloperidone – Approved by the US FDA in 2009, it is fairly well tolerated, although hypotension, dizziness, and somnolence were very common side effects. Has not received regulatory approval in other countries, however.\n* Lurasidone – Approved by the US FDA for schizophrenia and bipolar depression. Given once daily, it has shown mixed Phase III efficacy results but has a relatively well-tolerated side effect profile. It is also licensed for use as schizophrenia treatment in Canada. Not yet licensed elsewhere, however. Has procognitive effects via its antagonism of the 5-HT7 receptor.\n* Paliperidone – Primary Metabolite of risperidone that was approved in 2006.\n* Paliperidone palmitate – Long-acting version of paliperidone for once-monthly injection.\n* Perospirone † – Has a higher incidence of extrapyramidal side effects than other atypical antipsychotics.\n* Risperidone – Divided dosing is recommended until initial titration is completed, at which time the drug can be administered once daily. Used off-label to treat Tourette syndrome and anxiety disorder.\n* Ziprasidone – Approved in 2004 to treat bipolar disorder. Side-effects include a prolonged QT interval in the heart, which can be dangerous for patients with heart disease or those taking other drugs that prolong the QT interval.\n\nButyrophenones\n\n* Melperone † – Only used in a few European countries. No English-speaking country has licensed it to date.\n\nPhenylpiperazines/quinolinones\n\n* Aripiprazole – Partial agonist at the D2 receptor unlike almost all other clinically-utilized antipsychotics.\n* Aripiprazole lauroxil – Long-acting version of aripiprazole for injection.\n* Brexpiprazole – Partial agonist of the D2 receptor. Successor of aripiprazole.\n* Cariprazine – A D3-preferring D2/D3 partial agonist.\n\nTricyclics\n\n* Asenapine – Used for the treatment of schizophrenia and acute mania associated with bipolar disorder.\n* Clozapine – Requires complete blood counts every one to four weeks due to the risk of agranulocytosis. It has unparalleled efficacy in the treatment of treatment-resistant schizophrenia.\n* Olanzapine – Used to treat psychotic disorders including schizophrenia, acute manic episodes, and maintenance of bipolar disorder. Used as an adjunct to antidepressant therapy, especially to fluoxetine treatment in the form of Symbyax. \n* Quetiapine – Used primarily to treat bipolar disorder and schizophrenia. Also used and licensed in a few countries (including Australia, the United Kingdom and the United States) as an adjunct to antidepressant therapy in patients with major depressive disorder. It's the only antipsychotic that's demonstrated efficacy as a monotherapy for the treatment of major depressive disorder. It indirectly serves as a norepinephrine reuptake inhibitor by means of its active metabolite, norquetiapine.\n* Zotepine – An atypical antipsychotic indicated for acute and chronic schizophrenia. It is still used in Japan and was once used in Germany but it was discontinued.†\n\nOthers\n\n* Blonanserin – Approved by the PMDA in 2008. Used in Japan and South Korea.\n* Pimavanserin – A selective 5-HT2A receptor antagonist approved for the treatment of Parkinson's disease psychosis in 2016.\n* Sertindole ‡ – Developed by the Danish pharmaceutical company H. Lundbeck. Like the other atypical antipsychotics, it is believed to have antagonist activity at dopamine and serotonin receptors in the brain.\n\nMechanism of action\n\nAntipsychotic drugs such as haloperidol and chlorpromazine tend to block dopamine D2 receptors in the dopaminergic pathways of the brain. This means that dopamine released in these pathways has less effect. Excess release of dopamine in the mesolimbic pathway has been linked to psychotic experiences. Decreased dopamine release in the prefrontal cortex, and excess dopamine release in other pathways, are associated with psychotic episodes in schizophrenia and bipolar disorder.\nIn addition to the antagonistic effects of dopamine, antipsychotics (in particular atypical neuroleptics) also antagonize 5-HT2A receptors. Different alleles of the 5-HT2A receptor have been associated with schizophrenia and other psychoses, including depression. Higher concentrations of 5-HT2A receptors in cortical and subcortical areas, in particular in the right caudate nucleus have been historically recorded. This is the same receptor that psychedelic drugs agonize to various degrees,\nwhich explains the correlation between psychedelic drugs and schizophrenia.\n\nTypical antipsychotics are not particularly selective and also block dopamine receptors in the mesocortical pathway, tuberoinfundibular pathway, and the nigrostriatal pathway. Blocking D2 receptors in these other pathways is thought to produce some unwanted side effects that the typical antipsychotics can produce (see above). They were commonly classified on a spectrum of low potency to high potency, where potency referred to the ability of the drug to bind to dopamine receptors, and not to the effectiveness of the drug. High-potency antipsychotics such as haloperidol, in general, have doses of a few milligrams and cause less sleepiness and calming effects than low-potency antipsychotics such as chlorpromazine and thioridazine, which have dosages of several hundred milligrams. The latter have a greater degree of anticholinergic and antihistaminergic activity, which can counteract dopamine-related side-effects.\n\nAtypical antipsychotic drugs have a similar blocking effect on D2 receptors, however, most also act on serotonin receptors, especially 5-HT2A and 5-HT2C receptors. Both clozapine and quetiapine appear to bind just long enough to elicit antipsychotic effects but not long enough to induce extrapyramidal side effects and prolactin hypersecretion. 5-HT2A antagonism increases dopaminergic activity in the nigrostriatal pathway, leading to a lowered extrapyramidal side effect liability among the atypical antipsychotics.\n\nComparison of medications\n\nHistory\n\nThe original antipsychotic drugs were happened upon largely by chance and then tested for their effectiveness. The first, chlorpromazine, was developed as a surgical anesthetic. It was first used on psychiatric patients because of its powerful calming effect; at the time it was regarded as a non-permanent \"pharmacological lobotomy\". Lobotomy at the time was used to treat many behavioral disorders, including psychosis, although its effect was to markedly reduce behavior and mental functioning of all types. However, chlorpromazine proved to reduce the effects of psychosis in a more effective and specific manner than lobotomy, even though it was known to be capable of causing severe sedation. The underlying neurochemistry involved has since been studied in detail, and subsequent antipsychotic drugs have been discovered by an approach that incorporates this sort of information.\n\nThe discovery of chlorpromazine's psychoactive effects in 1952 led to greatly reduced use of restraint, seclusion, and sedation in the management of agitated patients, and also led to further research that resulted in the development of antidepressants, anxiolytics, and the majority of other drugs now used in the management of psychiatric conditions. In 1952, Henri Laborit described chlorpromazine only as inducing indifference towards what was happening around them in nonpsychotic, nonmanic patients, and Jean Delay and Pierre Deniker described it as controlling manic or psychotic agitation. The former claimed to have discovered a treatment for agitation in anyone, and the latter team claimed to have discovered a treatment for psychotic illness.Healy, D. 2005. Psychiatric Drugs Explained. 4th Ed. Britain:Elsevier Limited. P. 8, 17.\n\nUntil the 1970s there was considerable debate within psychiatry on the most appropriate term to use to describe the new drugs. In the late 1950s the most widely used term was \"neuroleptic\", followed by \"major tranquilizer\" and then \"ataraxic\". The first recorded use of the term tranquilizer dates from the early nineteenth century. In 1953 Frederik F. Yonkman, a chemist at the Swiss-based Cibapharmaceutical company, first used the term tranquilizer to differentiate reserpine from the older sedatives. The word neuroleptic was coined in 1955 by Delay and Deniker after their discovery (1952) of the antipsychotic effects of chlorpromazine. It is derived from the (neuron, originally meaning \"sinew\" but today referring to the nerves) and \"λαμβάνω\" (lambanō, meaning \"take hold of\"). Thus, the word means taking hold of one's nerves. It was often taken to refer also to common side effects such as reduced activity in general, as well as lethargy and impaired motor control. Although these effects are unpleasant and in some cases harmful, they were at one time, along with akathisia, considered a reliable sign that the drug was working. The term \"ataraxy\" was coined by the neurologist Howard Fabing and the classicist Alister Cameron to describe the observed effect of psychic indifference and detachment in patients treated with chlorpromazine. This term derived from the Greek adjective \"ἀτάρακτος\" (ataraktos), which means \"not disturbed, not excited, without confusion, steady, calm\". In the use of the terms \"tranquilizer\" and \"ataractic\", medical practitioners distinguished between the \"major tranquilizers\" or \"major ataractics\", which referred to drugs used to treat psychoses, and the \"minor tranquilizers\" or \"minor ataractics\", which referred to drugs used to treat neuroses. While popular during the 1950s, these terms are infrequently used today. They are being abandoned in favor of \"antipsychotic\", which refers to the drug's desired effects. Today, \"minor tranquilizer\" can refer to anxiolytic and/or hypnotic drugs such as the benzodiazepines and nonbenzodiazepines, which have some antipsychotic properties and are recommended for concurrent use with antipsychotics, and are useful for insomnia or drug-induced psychosis. They are powerful (and potentially addictive) sedatives.\n\nAntipsychotics are broadly divided into two groups, the typical or first-generation antipsychotics and the atypical or second-generation antipsychotics. The typical antipsychotics are classified according to their chemical structure while the atypical antipsychotics are classified according to their pharmacological properties. These include serotonin-dopamine antagonists (see dopamine antagonist and serotonin antagonist), multi-acting receptor-targeted antipsychotics (MARTA, those targeting several systems), and dopamine partial agonists, which are often categorized as atypicals.\n\nSociety and culture\n\nTerminology\n\nThe term major tranquilizer was used for older antipsychotic drugs. The term neuroleptic is often used as a synonym for antipsychotic, even though - strictly speaking - the two terms are not interchangeable. Antipsychotic drugs are a subgroup of neuroleptic drugs, because the latter have a wider range of effects.R. Elliott Ingersoll, Carl F. Rak (2015): Psychopharmacology for Mental Health Professionals: An Integrative Approach, Cengage Learning, Boston, pp. 150-186 and 342-349, .\n\nAntipsychotics are a type of psychoactive or psychotropic medication.\n\nSales\n\nAntipsychotics were once among the biggest selling and most profitable of all drugs, generating $22 billion in global sales in 2008.[https://web.archive.org/web/20120218005726/http://www.healthcarefinancenews.com/press-release/pipeline-antipsychotic-drugs-drive-next-market-evolution Pipelineantipsychotic drugs to drive next market evolution (2009)]. Healthcarefinancenews.com (7 August 2009). By 2003 in the US, an estimated 3.21 million patients received antipsychotics, worth an estimated $2.82 billion. Over 2/3 of prescriptions were for the newer, more expensive atypicals, each costing on average $164 per year, compared to $40 for the older types. By 2008, sales in the US reached $14.6 billion, the biggest selling drugs in the US by therapeutic class.[http://www.imshealth.com/portal/site/imshealth/menuitem.a46c6d4df3db4b3d88f611019418c22a/?vgnextoid85f4a56216a10210VgnVCM100000ed152ca2RCRD&cpsextcurrchannel\n1 2008 U.S. Sales and Prescription Information: Top Therapeutic Classes by U.S. Sales (PDF)] . Imshealth.com.\n\nFormulations\n\nAntipsychotics are sometimes administered as part of compulsory psychiatric treatment via inpatient (hospital) commitment or outpatient commitment. They may be administered orally or, in some cases, through long-acting (depot) injections administered in the dorsgluteal, ventrogluteal or deltoid muscle.\n\nControversy\n\nJoanna Moncrieff has argued that antipsychotic drug treatment is often undertaken as a means of control rather than to treat specific symptoms experienced by the patient. Moncreiff has further argued that the evidence for antipsychotics from discontinuation-relapse studies may be flawed, because they do not take into account that antipsychotics may sensitize the brain and provoke psychosis if discontinued, which may then be wrongly interpreted as a relapse of the original condition.\n\nUse of this class of drugs has a history of criticism in residential care. As the drugs used can make patients calmer and more compliant, critics claim that the drugs can be overused. Outside doctors can feel under pressure from care home staff.GPs under 'pressure' to issue neuroleptics, claims professor, Chemist + Druggist, 15 January 2009 In an official review commissioned by UK government ministers it was reported that the needless use of antipsychotic medication in dementia care was widespread and was linked to 1800 deaths per year. In the US, the government has initiated legal action against the pharmaceutical company Johnson & Johnson for allegedly paying kickbacks to Omnicare to promote its antipsychotic risperidone (Risperdal) in nursing homes.\n\nThere has also been controversy about the role of pharmaceutical companies in marketing and promoting antipsychotics, including allegations of downplaying or covering up adverse effects, expanding the number of conditions or illegally promoting off-label usage; influencing drug trials (or their publication) to try to show that the expensive and profitable newer atypicals were superior to the older cheaper typicals that were out of patent. Following charges of illegal marketing, settlements by two large pharmaceutical companies in the US set records for the largest criminal fines ever imposed on corporations. One case involved Eli Lilly and Company's antipsychotic Zyprexa, and the other involved  Bextra. In the Bextra case, the government also charged Pfizer with illegally marketing another antipsychotic, Geodon. In addition, Astrazeneca faces numerous personal-injury lawsuits from former users of Seroquel (quetiapine), amidst federal investigations of its marketing practices. By expanding the conditions for which they were indicated, Astrazeneca's Seroquel and Eli Lilly's Zyprexa had become the biggest selling antipsychotics in 2008 with global sales of $5.5 billion and $5.4 billion respectively.\n\nHarvard medical professor Joseph Biederman conducted research on bipolar disorder in children that led to an increase in such diagnoses. A 2008 Senate investigation found that Biederman also received $1.6 million in speaking and consulting fees between 2000 and 2007 — some of them undisclosed to Harvard — from companies including makers of antipsychotic drugs prescribed for children with bipolar disorder. Johnson & Johnson gave more than $700,000 to a research center that was headed by Biederman from 2002 to 2005, where research was conducted, in part, on Risperdal, the company's antipsychotic drug. Biederman has responded saying that the money did not influence him and that he did not promote a specific diagnosis or treatment.\n\nPharmaceutical companies have also been accused of attempting to set the mental health agenda through activities such as funding consumer advocacy groups.\n\nSpecial populations\n\nIt is recommended that persons with dementia who exhibit behavioral and psychological symptoms should not be given antipsychotics before trying other treatments., which cites\n* \n* \n* \n* \n*  When taking antipsychotics this population has increased risk of cerebrovascular effects, parkinsonism or extrapyramidal symptoms, sedation, confusion and other cognitive adverse effects, weight gain, and increased mortality. Physicians and caretakers of persons with dementia should try to address symptoms including agitation, aggression, apathy, anxiety, depression, irritability, and psychosis with alternative treatments whenever antipsychotic use can be replaced or reduced. Elderly persons often have their dementia treated first with antipsychotics and this is not the best management strategy., which cites\n* \n*\n* \n*. Antipsychotic. http://en.wikipedia.org/?curid=2870."
  }
}
