{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11359",
  "eid" : "fb26e780-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778501112,
  "textBody" : "This day marks the approximate midpoint of winter in the Northern Hemisphere and of summer in the Southern Hemisphere (starting the season at the December solstice).\n\nEvents\n\n* 211 – Roman Emperor Septimius Severus dies at Eboracum (modern York, England) while preparing to lead a campaign against the Caledonians. He leaves the empire in the control of his two quarrelling sons.\n* 634 – Battle of Dathin: Rashidun forces under Yazid ibn Abi Sufyan defeat an outnumbered Byzantine force near Gaza in Palestine.\n* 960 – The coronation of Zhao Kuangyin as Emperor Taizu of Song, initiating the Song dynasty period of China that would last more than three centuries.\n*1169 – A strong earthquake struck the Ionian coast of Sicily, causing tens of thousands of injuries and deaths, especially in Catania.\n*1454 – In the Thirteen Years' War, the Secret Council of the Prussian Confederation sends a formal act of disobedience to the Grand Master.\n*1555 – John Rogers is burned at the stake, becoming the first English Protestant martyr under Mary I of England.\n*1703 – In Edo (now Tokyo), 46 of the Forty-seven Ronin commit seppuku (ritual suicide) as recompense for avenging their master's death.\n*1758 – Macapá, Brazil is founded.\n*1789 – George Washington is unanimously elected as the first President of the United States by the U.S. Electoral College.\n*1794 – The French legislature abolishes slavery throughout all territories of the French First Republic. It will be reestablished in the French West Indies in 1802.\n*1797 – The Riobamba earthquake strikes Ecuador, causing up to 40,000 casualties.\n*1801 – John Marshall is sworn in as Chief Justice of the United States.\n*1810 – The Royal Navy seizes Guadeloupe.\n*1820 – The Chilean Navy under the command of Lord Cochrane completes the 2-day long Capture of Valdivia with just 300 men and 2 ships.\n*1825 – The Ohio Legislature authorizes the construction of the Ohio and Erie Canal and the Miami and Erie Canal.\n*1846 – The first Mormon pioneers make their exodus from Nauvoo, Illinois, westward towards Salt Lake Valley.\n*1859 – The Codex Sinaiticus is discovered in Egypt.\n*1861 – American Civil War: In Montgomery, Alabama, delegates from six break-away U.S. states meet and form the Confederate States of America.\n*1899 – The Philippine–American War begins with the Battle of Manila.\n*1932 – Second Sino-Japanese War: Harbin, Manchuria, falls to Japan.\n*1941 – The United Service Organization (USO) is created to entertain American troops.\n*1945 – World War II: Santo Tomas Internment Camp is liberated from Japanese authority.\n*  1945   – World War II: The Yalta Conference between the \"Big Three\" (Churchill, Roosevelt, and Stalin) opens at the Livadia Palace in the Crimea.\n*  1945   – World War II: The British Indian Army and Imperial Japanese Army begin a series of battles known as the Battle of Pokoku and Irrawaddy River operations.\n*1948 – Ceylon (later renamed Sri Lanka) becomes independent within the British Commonwealth.\n*1961 – The Angolan War of Independence and the greater Portuguese Colonial War begin.\n*1966 – All Nippon Airways Flight 60 plunges into Tokyo Bay, killing 133.\n*1967 – Lunar Orbiter program: Lunar Orbiter 3 lifts off from Cape Canaveral's Launch Complex 13 on its mission to identify possible landing sites for the Surveyor and Apollo spacecraft.\n*1969 – Yasser Arafat takes over as chairman of the Palestine Liberation Organization.\n*1974 – The Symbionese Liberation Army kidnaps Patty Hearst in Berkeley, California.\n*  1974   – M62 coach bombing: The Provisional Irish Republican Army (IRA) explodes a bomb on a bus carrying off-duty British Armed Forces personnel in Yorkshire, England. Nine soldiers and three civilians are killed.\n*1975 – Haicheng earthquake (magnitude 7.3 on the Richter scale) occurs in Haicheng, Liaoning, China.\n*1976 – In Guatemala and Honduras an earthquake kills more than 22,000.\n*1977 – A Chicago Transit Authority elevated train rear-ends another and derails, killing 11 and injuring 180, the worst accident in the agency's history.\n*1992 – A coup d'état is led by Hugo Chávez against Venezuelan President Carlos Andrés Pérez.\n*1997 – En route to Lebanon, two Israeli Sikorsky CH-53 troop-transport helicopters collide in mid-air over northern Galilee, Israel killing 73.\n*1998 – The 5.9  Afghanistan earthquake shakes the Takhar Province with a maximum Mercalli intensity of VII (Very strong). With 2,323 killed, and 818 injured, damage is considered extreme.\n*1999 – Unarmed West African immigrant Amadou Diallo is shot 41 times by four plainclothes New York City police officers on an unrelated stake-out, inflaming race relations in the city.\n*2003 – The Federal Republic of Yugoslavia is officially renamed Serbia and Montenegro and adopts a new constitution.\n*2004 – Facebook, a mainstream online social networking site, is founded by Mark Zuckerberg.\n*2015 – TransAsia Airways Flight 235 with 58 people on board, en route from the Taiwanese capital Taipei to Kinmen, crashes into the Keelung River just after take-off, killing 43 people.\n\nBirths\n\n*1447 – Lodovico Lazzarelli, Italian poet (d. 1500)\n*1465 – Frans van Brederode, Dutch rebel (d. 1490)\n*1495 – Francesco II Sforza, Duke of Milan (d. 1535)\n*  1495   – Jean Parisot de Valette, Grand Master of the Knights Hospitaller (d. 1568)\n*1505 – Mikołaj Rej, Polish poet and author (d. 1580)\n*1575 – Pierre de Bérulle, French cardinal and theologian, founded the French school of spirituality (d. 1629)\n*1646 – Hans Erasmus Aßmann, German poet and politician (d. 1699)\n*1676 – Giacomo Facco, Italian violinist and composer (d. 1753)\n*1677 – Johann Ludwig Bach, German violinist and composer (d. 1731)\n*1688 – Pierre de Marivaux, French author and playwright (d. 1763)\n*1725 – Dru Drury, English entomologist and author (d. 1804)\n*1740 – Carl Michael Bellman, Swedish poet and composer (d. 1795)\n*1778 – Augustin Pyramus de Candolle, Swiss botanist, mycologist, and academic (d. 1841)\n*1799 – Almeida Garrett, Portuguese journalist and author (d. 1854)\n*1818 – Emperor Norton, San Francisco eccentric and visionary (d. 1880) \n*1831 – Oliver Ames, American financier and politician, 35th Governor of Massachusetts (d. 1895)\n*1848 – Jean Aicard, French poet, author, and playwright (d. 1921)\n*1849 – Jean Richepin, French poet, author, and playwright (d. 1926)\n*1862 – Édouard Estaunié, French novelist (d. 1942)\n*1865 – Abe Isoo, Japanese minister and politician (d. 1949)\n*1868 – Constance Markievicz, Irish revolutionary and first woman elected to the UK House of Commons (d. 1927)\n*1871 – Friedrich Ebert, German lawyer and politician, 1st President of Germany (d. 1925)\n*1872 – Gotse Delchev, Bulgarian and Macedonian revolutionary activist (d. 1903)\n*1873 – Étienne Desmarteau, Canadian shot putter and discus thrower (d. 1905)\n*1875 – Ludwig Prandtl, German physicist and engineer (d. 1953)\n*1877 – Eddie Cochems, American football player and coach (d. 1953)\n*1881 – Eulalio Gutiérrez, Mexican general and politician, President of Mexico (d. 1939)\n*  1881   – Fernand Léger, French painter and sculptor (d. 1955)\n*1883 – Reinhold Rudenberg, German-American inventor and a pioneer of electron microscopy (d. 1961)\n*1891 – M. A. Ayyangar, Indian lawyer and politician, 2nd Speaker of the Lok Sabha (d. 1978)\n*1892 – E. J. Pratt, Canadian poet and academic (d. 1964)\n*1895 – Nigel Bruce, English actor (d. 1953)\n*1896 – Friedrich Glauser, Austrian-Swiss author (d. 1938)\n*  1896   – Friedrich Hund, German physicist and academic (d. 1997)\n*1897 – Ludwig Erhard, German soldier and politician, 2nd Chancellor of West Germany (d. 1977)\n*1899 – Virginia M. Alexander, American physician and founder of the Aspiranto Health Home(d. 1949)\n*1900 – Jacques Prévert, French poet and screenwriter (d. 1977)\n*1902 – Charles Lindbergh, American pilot and explorer (d. 1974)\n*  1902   – Hartley Shawcross, Baron Shawcross, German-English lawyer and politician, Attorney General for England and Wales (d. 2003)\n*1903 – Alexander Imich, Polish-American chemist, parapsychologist, and academic (d. 2014)\n*1904 – MacKinlay Kantor, American author and screenwriter (d. 1977)\n*1906 – Dietrich Bonhoeffer, German pastor and theologian (d. 1945)\n*  1906   – Clyde Tombaugh, American astronomer and academic, discovered Pluto (d. 1997)\n*1908 – Julian Bell, English poet and academic (d. 1937)\n*1912 – Ola Skjåk Bræk, Norwegian banker and politician, Norwegian Minister of Industry (d. 1999)\n*  1912   – Erich Leinsdorf, Austrian-American conductor (d. 1993)\n*  1912   – Byron Nelson, American golfer and sportscaster (d. 2006)\n*1913 – Rosa Parks, American civil rights activist (d. 2005)\n*  1913   – Richard Seaman, English race car driver (d. 1939)\n*1914 – Alfred Andersch, German-Swiss author and publisher (d. 1980)\n*1915 – William Talman, American actor and screenwriter (d. 1968)\n*  1915   – Norman Wisdom, English singer-songwriter and actor (d. 2010)\n*1917 – Yahya Khan, Pakistan general and politician, 3rd President of Pakistan (d. 1980)\n*1918 – Ida Lupino, English-American actress and director (d. 1995)\n*  1918   – Luigi Pareyson, Italian philosopher and author (d. 1991)\n*1920 – Janet Waldo, American actress and voice artist (d. 2016)\n*1921 – Betty Friedan, American author and feminist (d. 2006)\n*  1921 – Lotfi Zadeh, Iranian-American mathematician and computer scientist and founder of fuzzy logic (d. 2017)\n*1923 – Conrad Bain, Canadian-American actor (d. 2013)\n*  1923   – James Dibble, Australian journalist (d. 2010)\n*1925 – Russell Hoban, American author and illustrator (d. 2011)\n*  1925   – Stanley Karnow, American journalist and historian (d. 2013)\n*  1925   – Christopher Zeeman, English mathematician and academic (d. 2016)\n*1926 – Gyula Grosics, Hungarian footballer and manager (d. 2014)\n*  1926   – Dave Sands, Australian boxer (d. 1952)\n*1927 – Rolf Landauer, German-American physicist and academic (d. 1999)\n*1928 – Oscar Cabalén, Argentinian race car driver (d. 1967)\n*  1928   – Osmo Antero Wiio, Finnish journalist, academic, and politician (d. 2013)\n*1929 – Paul Burlison, American rockabilly guitarist (d. 2003)\n*1930 – Tibor Antalpéter, Hungarian volleyball player and diplomat, Hungarian Ambassador to the United Kingdom (d. 2012)\n*  1930   – Arthur E. Chase, American businessman and politician (d. 2015)\n*  1930   – Jim Loscutoff, American basketball player (d. 2015)\n*1931 – Isabel Martínez de Perón, Argentinian dancer and politician, 41st President of Argentina\n*1935 – Wallis Mathias, Pakistani cricketer (d. 1994)\n*  1935   – Martti Talvela, Finnish opera singer (d. 1989)\n*  1935   – Collin Wilcox, American actress (d. 2009)\n*1936 – David Brenner, American comedian, actor, and author (d. 2014)\n*  1936   – Claude Nobs, Swiss businessman, founded the Montreux Jazz Festival (d. 2013)\n*1937 – David Newman, American director and screenwriter (d. 2003)\n*1938 – Frank J. Dodd, American businessman and politician, president of the New Jersey Senate (d. 2010)\n*1939 – Stan Lundine, American lawyer and politician, Lieutenant Governor of New York\n*1940 – George A. Romero, American director and producer (d. 2017)\n*1941 – Russell Cooper, Australian politician, 33rd Premier of Queensland\n*  1941   – Ron Rangi, New Zealand rugby player (d. 1988)\n*  1941   – Jiří Raška, Czech skier and coach (d. 2012)\n*  1941   – John Steel, English drummer\n*1943 – Alberto João Jardim, Portuguese journalist and politician, 2nd President of the Regional Government of Madeira\n*  1943   – Wanda Rutkiewicz, Lithuanian-Polish mountaineer (d. 1992)\n*  1943   – Ken Thompson, American computer scientist and programmer, co-developed the B programming language\n*1944 – Florence LaRue, American singer and actress\n*1947 – Dennis C. Blair, American admiral and politician, 3rd Director of National Intelligence\n*  1947   – Dan Quayle, American sergeant, lawyer, and politician, 44th Vice President of the United States\n*1948 – Alice Cooper, American singer-songwriter \n*  1948   – Rod Grams, American journalist and politician (d. 2013)\n*  1948   – Mienoumi Tsuyoshi, Japanese sumo wrestler\n*1949 – Michael Beck, American actor\n*  1949   – Rasim Delić, Bosnian general (d. 2010)\n*1951 – Patrick Bergin, Irish actor \n*  1951   – Phil Ehart, American rock drummer and songwriter\n*1952 – Jenny Shipley, New Zealand educator and politician, 36th Prime Minister of New Zealand\n*  1952 – Thomas Silverstein, American prisoner, founder and former leader of the Aryan Brotherhood prison gang\n*1955 – Mikuláš Dzurinda, Slovak politician, Prime Minister of Slovakia\n*1957 – Don Davis, American composer and conductor\n*1958 – Tomasz Pacyński, Polish journalist and author (d. 2005)\n*1959 – Christian Schreier, German footballer and manager\n*  1959   – Lawrence Taylor, American football player and sportscaster\n*1960 – Siobhan Dowd, English author and activist (d. 2007)\n*  1960   – Adrienne King, American actress, dancer, and painter\n*  1960   – Jonathan Larson, American composer and playwright (d. 1996)\n*1961 – Stewart O'Nan, American novelist \n*  1961   – Denis Savard, Canadian ice hockey player and coach\n*1962 – Clint Black, American singer-songwriter, guitarist, and producer\n*  1962   – Stephen Hammond, English banker and politician\n*1963 – Pirmin Zurbriggen, Swiss skier\n*1966 – Tony Butterfield, Australian rugby league player\n*  1966   – Viatcheslav Ekimov, Russian cyclist\n*1967 – Sergei Grinkov, Russian figure skater (d. 1995)\n*1970 – Gabrielle Anwar, English actress \n*1971 – Rob Corddry, American actor, producer, and screenwriter\n*  1971   – Eric Garcetti, American lieutenant and politician, 42nd Mayor of Los Angeles\n*1972 – Dara Ó Briain, Irish comedian and television host\n*  1972   – Giovanni Silva de Oliveira, Brazilian footballer and manager\n*1973 – Oscar De La Hoya, American boxer \n*  1973   – James Hird, Australian footballer and coach\n*  1973   – Manny Legace, Canadian ice hockey player and sportscaster\n*1975 – Natalie Imbruglia, Australian singer-songwriter and actress\n*1977 – Gavin DeGraw, American singer-songwriter \n*1979 – Giorgio Pantano, Italian race car driver\n*1980 – Raimonds Vaikulis, Latvian basketball player\n*1981 – Jason Kapono, American basketball player\n*  1981   – Johan Vansummeren, Belgian cyclist\n*1982 – Chris Sabin, American wrestler\n*  1982   – Ivars Timermanis, Latvian basketball player\n*  1982   – Tomas Vaitkus, Lithuanian cyclist\n*1983 – Lee Stempniak, American ice hockey player\n*  1983   – Rebecca White, Australian politician\n*1984 – Sandeep Acharya, Indian singer (d. 2013)\n*  1984   – Mauricio Pinilla, Chilean footballer\n*1986 – Maximilian Götz, German race car driver\n*  1986   – Mahmudullah Riyad, Bangladeshi cricketer\n*1987 – Darren O'Dea, Irish footballer\n*  1987   – Lucie Šafářová, Czech tennis player\n*1988 – Carly Patterson, American gymnast and singer\n*1993 – Bae Noo-ri, South Korean actress\n\nDeaths\n\n* 211 – Septimius Severus, Roman emperor (b. 145)\n* 708 – Pope Sisinnius (b. 650)\n* 856 – Rabanus Maurus, Frankish archbishop and theologian (b. 780)\n* 870 – Ceolnoth, archbishop of Canterbury\n*1169 – John of Ajello, Bishop of Catania \n*1498 – Antonio del Pollaiolo, Italian artist (b. 1429/1433)\n*1505 – Jeanne de Valois, daughter of Louis XI of France (b. 1464)\n*1508 – Conrad Celtes, German poet and scholar (b. 1459)\n*1555 – John Rogers, English clergyman and translator (b. 1505)\n*1590 – Gioseffo Zarlino, Italian composer and theorist (b. 1517)\n*1615 – Giambattista della Porta, Italian playwright and scholar (b. 1535)\n*1617 – Lodewijk Elzevir, Dutch publisher, co-founded the House of Elzevir (b. 1546)\n*1713 – Anthony Ashley-Cooper, 3rd Earl of Shaftesbury, English philosopher and politician (b. 1671)\n*1774 – Charles Marie de La Condamine, French mathematician and geographer (b. 1701)\n*1799 – Étienne-Louis Boullée, French architect and educator (b. 1728)\n*1781 – Josef Mysliveček, Czech composer (b. 1737)\n*1843 – Theodoros Kolokotronis, Greek general (b. 1770)\n*1905 – Louis-Ernest Barrias, French sculptor and academic (b. 1841)\n*1926 – İskilipli Mehmed Atıf Hoca, Turkish author and scholar (b. 1875)\n*1928 – Hendrik Lorentz, Dutch physicist and academic, Nobel Prize laureate (b. 1853)\n*1933 – Archibald Sayce, English linguist and educator (b. 1846)\n*1940 – Nikolai Yezhov, Russian police officer and politician (b. 1895)\n*1943 – Frank Calder, English-Canadian ice hockey player and journalist (b. 1877)\n*1944 – Arsen Kotsoyev, Russian author and translator (b. 1872)\n*1956 – Savielly Tartakower, Russian-French chess player, journalist, and author (b. 1887)\n*1958 – Henry Kuttner, American author and screenwriter (b. 1915)\n*1959 – Una O'Connor, Irish-American actress (b. 1880)\n*1968 – Neal Cassady, American novelist and poet (b. 1926)\n*1970 – Louise Bogan, American poet and critic (b. 1897)\n*1974 – Satyendra Nath Bose, Indian physicist, mathematician, and academic (b. 1894)\n*1975 – Louis Jordan, American singer-songwriter and saxophonist (b. 1908)\n*1982 – Alex Harvey, Scottish singer-songwriter and guitarist (b. 1935)\n*  1982   – Georg Konrad Morgen, German lawyer and judge (b. 1909)\n*1983 – Karen Carpenter, American singer (b. 1950)\n*1987 – Liberace, American singer-songwriter and pianist, (b. 1919)\n*  1987   – Meena Keshwar Kamal, Afghan activist, founded the Revolutionary Association of the Women of Afghanistan (b. 1956)\n*  1987   – Carl Rogers, American psychologist and academic (b. 1902)\n*1990 – Whipper Billy Watson, Canadian-American wrestler and trainer (b. 1915)\n*1992 – John Dehner, American actor (b. 1915)\n*1995 – Patricia Highsmith, American novelist and short story writer (b. 1921)\n*2000 – Carl Albert, American lawyer and politician, 54th Speaker of the United States House of Representatives (b. 1908)\n*2002 – Count Sigvard Bernadotte of Wisborg (b. 1907)\n*2003 – Benyoucef Benkhedda, Algerian pharmacist and politician (b. 1920)\n*2005 – Ossie Davis, American actor, director, and playwright (b. 1917)\n*2006 – Betty Friedan, American author and activist (b. 1921)\n*2007 – José Carlos Bauer, Brazilian footballer and manager (b. 1925)\n*  2007   – Ilya Kormiltsev, Russian-English poet and translator (b. 1959)\n*  2007   – Barbara McNair, American singer and actress (b. 1934)\n*  2007   – Jules Olitski, Ukrainian-American painter and sculptor (b. 1922)\n*2008 – Augusta Dabney, American actress (b. 1918)\n*  2008   – Stefan Meller, Polish academic and politician, Minister of Foreign Affairs of Poland (b. 1942)\n*2010 – Kostas Axelos, Greek-French philosopher and author (b. 1924)\n*  2010   – Helen Tobias-Duesberg, Estonian-American composer (b. 1919) \n*2011 – Martial Célestin, Haitian lawyer and politician, 1st Prime Minister of Haiti (b. 1913)\n*2012 – István Csurka, Hungarian journalist and politician (b. 1934)\n*  2012   – Florence Green, English soldier (b. 1901)\n*  2012   – Robert Daniel, American farmer, soldier, and politician (b. 1936)\n*  2012   – Mike deGruy, American director, producer, and cinematographer (b. 1951)\n*2013 – Donald Byrd, American trumpet player (b. 1932)\n*  2013   – Reg Presley, English singer-songwriter (b. 1941)\n*2014 – Keith Allen, Canadian-American ice hockey player, coach, and manager (b. 1923)\n*  2014   – Eugenio Corti, Italian soldier, author, and playwright (b. 1921)\n*  2014   – Dennis Lota, Zambian footballer (b. 1973)\n*2015 – Wes Cooley, American soldier and politician (b. 1932) \t\n*  2015   – Fitzhugh L. Fulton, American colonel and pilot (b. 1925) \t\n*2016 – Edgar Mitchell, American captain, pilot, and astronaut (b. 1930)\n*2017 – Steve Lang, Canadian bass player (b. 1949)\n*  2017   – Bano Qudsia, Pakistani writer (b. 1928)\n*2018 – John Mahoney, English-American actor, voice artist, and comedian (b. 1940)\n\nHolidays and observances\n\n*Christian feast day:\n**Andrew Corsini\n**Gilbert of Sempringham\n**John de Brito\n**Rabanus Maurus\n**Rimbert\n**Veronica\n**February 4 (Eastern Orthodox liturgics)\n\n*Day of the Armed Struggle (Angola)\n*Independence Day (Sri Lanka)\n*Rosa Parks Day (California and Missouri, United States)\n*World Cancer Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "February 4" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11359" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "This day marks the approximate midpoint of winter in the Northern Hemisphere and of summer in the Southern Hemisphere (starting the season at the December solstice).\n\nEvents\n\n* 211 – Roman Emperor Septimius Severus dies at Eboracum (modern York, England) while preparing to lead a campaign against the Caledonians. He leaves the empire in the control of his two quarrelling sons.\n* 634 – Battle of Dathin: Rashidun forces under Yazid ibn Abi Sufyan defeat an outnumbered Byzantine force near Gaza in Palestine.\n* 960 – The coronation of Zhao Kuangyin as Emperor Taizu of Song, initiating the Song dynasty period of China that would last more than three centuries.\n*1169 – A strong earthquake struck the Ionian coast of Sicily, causing tens of thousands of injuries and deaths, especially in Catania.\n*1454 – In the Thirteen Years' War, the Secret Council of the Prussian Confederation sends a formal act of disobedience to the Grand Master.\n*1555 – John Rogers is burned at the stake, becoming the first English Protestant martyr under Mary I of England.\n*1703 – In Edo (now Tokyo), 46 of the Forty-seven Ronin commit seppuku (ritual suicide) as recompense for avenging their master's death.\n*1758 – Macapá, Brazil is founded.\n*1789 – George Washington is unanimously elected as the first President of the United States by the U.S. Electoral College.\n*1794 – The French legislature abolishes slavery throughout all territories of the French First Republic. It will be reestablished in the French West Indies in 1802.\n*1797 – The Riobamba earthquake strikes Ecuador, causing up to 40,000 casualties.\n*1801 – John Marshall is sworn in as Chief Justice of the United States.\n*1810 – The Royal Navy seizes Guadeloupe.\n*1820 – The Chilean Navy under the command of Lord Cochrane completes the 2-day long Capture of Valdivia with just 300 men and 2 ships.\n*1825 – The Ohio Legislature authorizes the construction of the Ohio and Erie Canal and the Miami and Erie Canal.\n*1846 – The first Mormon pioneers make their exodus from Nauvoo, Illinois, westward towards Salt Lake Valley.\n*1859 – The Codex Sinaiticus is discovered in Egypt.\n*1861 – American Civil War: In Montgomery, Alabama, delegates from six break-away U.S. states meet and form the Confederate States of America.\n*1899 – The Philippine–American War begins with the Battle of Manila.\n*1932 – Second Sino-Japanese War: Harbin, Manchuria, falls to Japan.\n*1941 – The United Service Organization (USO) is created to entertain American troops.\n*1945 – World War II: Santo Tomas Internment Camp is liberated from Japanese authority.\n*  1945   – World War II: The Yalta Conference between the \"Big Three\" (Churchill, Roosevelt, and Stalin) opens at the Livadia Palace in the Crimea.\n*  1945   – World War II: The British Indian Army and Imperial Japanese Army begin a series of battles known as the Battle of Pokoku and Irrawaddy River operations.\n*1948 – Ceylon (later renamed Sri Lanka) becomes independent within the British Commonwealth.\n*1961 – The Angolan War of Independence and the greater Portuguese Colonial War begin.\n*1966 – All Nippon Airways Flight 60 plunges into Tokyo Bay, killing 133.\n*1967 – Lunar Orbiter program: Lunar Orbiter 3 lifts off from Cape Canaveral's Launch Complex 13 on its mission to identify possible landing sites for the Surveyor and Apollo spacecraft.\n*1969 – Yasser Arafat takes over as chairman of the Palestine Liberation Organization.\n*1974 – The Symbionese Liberation Army kidnaps Patty Hearst in Berkeley, California.\n*  1974   – M62 coach bombing: The Provisional Irish Republican Army (IRA) explodes a bomb on a bus carrying off-duty British Armed Forces personnel in Yorkshire, England. Nine soldiers and three civilians are killed.\n*1975 – Haicheng earthquake (magnitude 7.3 on the Richter scale) occurs in Haicheng, Liaoning, China.\n*1976 – In Guatemala and Honduras an earthquake kills more than 22,000.\n*1977 – A Chicago Transit Authority elevated train rear-ends another and derails, killing 11 and injuring 180, the worst accident in the agency's history.\n*1992 – A coup d'état is led by Hugo Chávez against Venezuelan President Carlos Andrés Pérez.\n*1997 – En route to Lebanon, two Israeli Sikorsky CH-53 troop-transport helicopters collide in mid-air over northern Galilee, Israel killing 73.\n*1998 – The 5.9  Afghanistan earthquake shakes the Takhar Province with a maximum Mercalli intensity of VII (Very strong). With 2,323 killed, and 818 injured, damage is considered extreme.\n*1999 – Unarmed West African immigrant Amadou Diallo is shot 41 times by four plainclothes New York City police officers on an unrelated stake-out, inflaming race relations in the city.\n*2003 – The Federal Republic of Yugoslavia is officially renamed Serbia and Montenegro and adopts a new constitution.\n*2004 – Facebook, a mainstream online social networking site, is founded by Mark Zuckerberg.\n*2015 – TransAsia Airways Flight 235 with 58 people on board, en route from the Taiwanese capital Taipei to Kinmen, crashes into the Keelung River just after take-off, killing 43 people.\n\nBirths\n\n*1447 – Lodovico Lazzarelli, Italian poet (d. 1500)\n*1465 – Frans van Brederode, Dutch rebel (d. 1490)\n*1495 – Francesco II Sforza, Duke of Milan (d. 1535)\n*  1495   – Jean Parisot de Valette, Grand Master of the Knights Hospitaller (d. 1568)\n*1505 – Mikołaj Rej, Polish poet and author (d. 1580)\n*1575 – Pierre de Bérulle, French cardinal and theologian, founded the French school of spirituality (d. 1629)\n*1646 – Hans Erasmus Aßmann, German poet and politician (d. 1699)\n*1676 – Giacomo Facco, Italian violinist and composer (d. 1753)\n*1677 – Johann Ludwig Bach, German violinist and composer (d. 1731)\n*1688 – Pierre de Marivaux, French author and playwright (d. 1763)\n*1725 – Dru Drury, English entomologist and author (d. 1804)\n*1740 – Carl Michael Bellman, Swedish poet and composer (d. 1795)\n*1778 – Augustin Pyramus de Candolle, Swiss botanist, mycologist, and academic (d. 1841)\n*1799 – Almeida Garrett, Portuguese journalist and author (d. 1854)\n*1818 – Emperor Norton, San Francisco eccentric and visionary (d. 1880) \n*1831 – Oliver Ames, American financier and politician, 35th Governor of Massachusetts (d. 1895)\n*1848 – Jean Aicard, French poet, author, and playwright (d. 1921)\n*1849 – Jean Richepin, French poet, author, and playwright (d. 1926)\n*1862 – Édouard Estaunié, French novelist (d. 1942)\n*1865 – Abe Isoo, Japanese minister and politician (d. 1949)\n*1868 – Constance Markievicz, Irish revolutionary and first woman elected to the UK House of Commons (d. 1927)\n*1871 – Friedrich Ebert, German lawyer and politician, 1st President of Germany (d. 1925)\n*1872 – Gotse Delchev, Bulgarian and Macedonian revolutionary activist (d. 1903)\n*1873 – Étienne Desmarteau, Canadian shot putter and discus thrower (d. 1905)\n*1875 – Ludwig Prandtl, German physicist and engineer (d. 1953)\n*1877 – Eddie Cochems, American football player and coach (d. 1953)\n*1881 – Eulalio Gutiérrez, Mexican general and politician, President of Mexico (d. 1939)\n*  1881   – Fernand Léger, French painter and sculptor (d. 1955)\n*1883 – Reinhold Rudenberg, German-American inventor and a pioneer of electron microscopy (d. 1961)\n*1891 – M. A. Ayyangar, Indian lawyer and politician, 2nd Speaker of the Lok Sabha (d. 1978)\n*1892 – E. J. Pratt, Canadian poet and academic (d. 1964)\n*1895 – Nigel Bruce, English actor (d. 1953)\n*1896 – Friedrich Glauser, Austrian-Swiss author (d. 1938)\n*  1896   – Friedrich Hund, German physicist and academic (d. 1997)\n*1897 – Ludwig Erhard, German soldier and politician, 2nd Chancellor of West Germany (d. 1977)\n*1899 – Virginia M. Alexander, American physician and founder of the Aspiranto Health Home(d. 1949)\n*1900 – Jacques Prévert, French poet and screenwriter (d. 1977)\n*1902 – Charles Lindbergh, American pilot and explorer (d. 1974)\n*  1902   – Hartley Shawcross, Baron Shawcross, German-English lawyer and politician, Attorney General for England and Wales (d. 2003)\n*1903 – Alexander Imich, Polish-American chemist, parapsychologist, and academic (d. 2014)\n*1904 – MacKinlay Kantor, American author and screenwriter (d. 1977)\n*1906 – Dietrich Bonhoeffer, German pastor and theologian (d. 1945)\n*  1906   – Clyde Tombaugh, American astronomer and academic, discovered Pluto (d. 1997)\n*1908 – Julian Bell, English poet and academic (d. 1937)\n*1912 – Ola Skjåk Bræk, Norwegian banker and politician, Norwegian Minister of Industry (d. 1999)\n*  1912   – Erich Leinsdorf, Austrian-American conductor (d. 1993)\n*  1912   – Byron Nelson, American golfer and sportscaster (d. 2006)\n*1913 – Rosa Parks, American civil rights activist (d. 2005)\n*  1913   – Richard Seaman, English race car driver (d. 1939)\n*1914 – Alfred Andersch, German-Swiss author and publisher (d. 1980)\n*1915 – William Talman, American actor and screenwriter (d. 1968)\n*  1915   – Norman Wisdom, English singer-songwriter and actor (d. 2010)\n*1917 – Yahya Khan, Pakistan general and politician, 3rd President of Pakistan (d. 1980)\n*1918 – Ida Lupino, English-American actress and director (d. 1995)\n*  1918   – Luigi Pareyson, Italian philosopher and author (d. 1991)\n*1920 – Janet Waldo, American actress and voice artist (d. 2016)\n*1921 – Betty Friedan, American author and feminist (d. 2006)\n*  1921 – Lotfi Zadeh, Iranian-American mathematician and computer scientist and founder of fuzzy logic (d. 2017)\n*1923 – Conrad Bain, Canadian-American actor (d. 2013)\n*  1923   – James Dibble, Australian journalist (d. 2010)\n*1925 – Russell Hoban, American author and illustrator (d. 2011)\n*  1925   – Stanley Karnow, American journalist and historian (d. 2013)\n*  1925   – Christopher Zeeman, English mathematician and academic (d. 2016)\n*1926 – Gyula Grosics, Hungarian footballer and manager (d. 2014)\n*  1926   – Dave Sands, Australian boxer (d. 1952)\n*1927 – Rolf Landauer, German-American physicist and academic (d. 1999)\n*1928 – Oscar Cabalén, Argentinian race car driver (d. 1967)\n*  1928   – Osmo Antero Wiio, Finnish journalist, academic, and politician (d. 2013)\n*1929 – Paul Burlison, American rockabilly guitarist (d. 2003)\n*1930 – Tibor Antalpéter, Hungarian volleyball player and diplomat, Hungarian Ambassador to the United Kingdom (d. 2012)\n*  1930   – Arthur E. Chase, American businessman and politician (d. 2015)\n*  1930   – Jim Loscutoff, American basketball player (d. 2015)\n*1931 – Isabel Martínez de Perón, Argentinian dancer and politician, 41st President of Argentina\n*1935 – Wallis Mathias, Pakistani cricketer (d. 1994)\n*  1935   – Martti Talvela, Finnish opera singer (d. 1989)\n*  1935   – Collin Wilcox, American actress (d. 2009)\n*1936 – David Brenner, American comedian, actor, and author (d. 2014)\n*  1936   – Claude Nobs, Swiss businessman, founded the Montreux Jazz Festival (d. 2013)\n*1937 – David Newman, American director and screenwriter (d. 2003)\n*1938 – Frank J. Dodd, American businessman and politician, president of the New Jersey Senate (d. 2010)\n*1939 – Stan Lundine, American lawyer and politician, Lieutenant Governor of New York\n*1940 – George A. Romero, American director and producer (d. 2017)\n*1941 – Russell Cooper, Australian politician, 33rd Premier of Queensland\n*  1941   – Ron Rangi, New Zealand rugby player (d. 1988)\n*  1941   – Jiří Raška, Czech skier and coach (d. 2012)\n*  1941   – John Steel, English drummer\n*1943 – Alberto João Jardim, Portuguese journalist and politician, 2nd President of the Regional Government of Madeira\n*  1943   – Wanda Rutkiewicz, Lithuanian-Polish mountaineer (d. 1992)\n*  1943   – Ken Thompson, American computer scientist and programmer, co-developed the B programming language\n*1944 – Florence LaRue, American singer and actress\n*1947 – Dennis C. Blair, American admiral and politician, 3rd Director of National Intelligence\n*  1947   – Dan Quayle, American sergeant, lawyer, and politician, 44th Vice President of the United States\n*1948 – Alice Cooper, American singer-songwriter \n*  1948   – Rod Grams, American journalist and politician (d. 2013)\n*  1948   – Mienoumi Tsuyoshi, Japanese sumo wrestler\n*1949 – Michael Beck, American actor\n*  1949   – Rasim Delić, Bosnian general (d. 2010)\n*1951 – Patrick Bergin, Irish actor \n*  1951   – Phil Ehart, American rock drummer and songwriter\n*1952 – Jenny Shipley, New Zealand educator and politician, 36th Prime Minister of New Zealand\n*  1952 – Thomas Silverstein, American prisoner, founder and former leader of the Aryan Brotherhood prison gang\n*1955 – Mikuláš Dzurinda, Slovak politician, Prime Minister of Slovakia\n*1957 – Don Davis, American composer and conductor\n*1958 – Tomasz Pacyński, Polish journalist and author (d. 2005)\n*1959 – Christian Schreier, German footballer and manager\n*  1959   – Lawrence Taylor, American football player and sportscaster\n*1960 – Siobhan Dowd, English author and activist (d. 2007)\n*  1960   – Adrienne King, American actress, dancer, and painter\n*  1960   – Jonathan Larson, American composer and playwright (d. 1996)\n*1961 – Stewart O'Nan, American novelist \n*  1961   – Denis Savard, Canadian ice hockey player and coach\n*1962 – Clint Black, American singer-songwriter, guitarist, and producer\n*  1962   – Stephen Hammond, English banker and politician\n*1963 – Pirmin Zurbriggen, Swiss skier\n*1966 – Tony Butterfield, Australian rugby league player\n*  1966   – Viatcheslav Ekimov, Russian cyclist\n*1967 – Sergei Grinkov, Russian figure skater (d. 1995)\n*1970 – Gabrielle Anwar, English actress \n*1971 – Rob Corddry, American actor, producer, and screenwriter\n*  1971   – Eric Garcetti, American lieutenant and politician, 42nd Mayor of Los Angeles\n*1972 – Dara Ó Briain, Irish comedian and television host\n*  1972   – Giovanni Silva de Oliveira, Brazilian footballer and manager\n*1973 – Oscar De La Hoya, American boxer \n*  1973   – James Hird, Australian footballer and coach\n*  1973   – Manny Legace, Canadian ice hockey player and sportscaster\n*1975 – Natalie Imbruglia, Australian singer-songwriter and actress\n*1977 – Gavin DeGraw, American singer-songwriter \n*1979 – Giorgio Pantano, Italian race car driver\n*1980 – Raimonds Vaikulis, Latvian basketball player\n*1981 – Jason Kapono, American basketball player\n*  1981   – Johan Vansummeren, Belgian cyclist\n*1982 – Chris Sabin, American wrestler\n*  1982   – Ivars Timermanis, Latvian basketball player\n*  1982   – Tomas Vaitkus, Lithuanian cyclist\n*1983 – Lee Stempniak, American ice hockey player\n*  1983   – Rebecca White, Australian politician\n*1984 – Sandeep Acharya, Indian singer (d. 2013)\n*  1984   – Mauricio Pinilla, Chilean footballer\n*1986 – Maximilian Götz, German race car driver\n*  1986   – Mahmudullah Riyad, Bangladeshi cricketer\n*1987 – Darren O'Dea, Irish footballer\n*  1987   – Lucie Šafářová, Czech tennis player\n*1988 – Carly Patterson, American gymnast and singer\n*1993 – Bae Noo-ri, South Korean actress\n\nDeaths\n\n* 211 – Septimius Severus, Roman emperor (b. 145)\n* 708 – Pope Sisinnius (b. 650)\n* 856 – Rabanus Maurus, Frankish archbishop and theologian (b. 780)\n* 870 – Ceolnoth, archbishop of Canterbury\n*1169 – John of Ajello, Bishop of Catania \n*1498 – Antonio del Pollaiolo, Italian artist (b. 1429/1433)\n*1505 – Jeanne de Valois, daughter of Louis XI of France (b. 1464)\n*1508 – Conrad Celtes, German poet and scholar (b. 1459)\n*1555 – John Rogers, English clergyman and translator (b. 1505)\n*1590 – Gioseffo Zarlino, Italian composer and theorist (b. 1517)\n*1615 – Giambattista della Porta, Italian playwright and scholar (b. 1535)\n*1617 – Lodewijk Elzevir, Dutch publisher, co-founded the House of Elzevir (b. 1546)\n*1713 – Anthony Ashley-Cooper, 3rd Earl of Shaftesbury, English philosopher and politician (b. 1671)\n*1774 – Charles Marie de La Condamine, French mathematician and geographer (b. 1701)\n*1799 – Étienne-Louis Boullée, French architect and educator (b. 1728)\n*1781 – Josef Mysliveček, Czech composer (b. 1737)\n*1843 – Theodoros Kolokotronis, Greek general (b. 1770)\n*1905 – Louis-Ernest Barrias, French sculptor and academic (b. 1841)\n*1926 – İskilipli Mehmed Atıf Hoca, Turkish author and scholar (b. 1875)\n*1928 – Hendrik Lorentz, Dutch physicist and academic, Nobel Prize laureate (b. 1853)\n*1933 – Archibald Sayce, English linguist and educator (b. 1846)\n*1940 – Nikolai Yezhov, Russian police officer and politician (b. 1895)\n*1943 – Frank Calder, English-Canadian ice hockey player and journalist (b. 1877)\n*1944 – Arsen Kotsoyev, Russian author and translator (b. 1872)\n*1956 – Savielly Tartakower, Russian-French chess player, journalist, and author (b. 1887)\n*1958 – Henry Kuttner, American author and screenwriter (b. 1915)\n*1959 – Una O'Connor, Irish-American actress (b. 1880)\n*1968 – Neal Cassady, American novelist and poet (b. 1926)\n*1970 – Louise Bogan, American poet and critic (b. 1897)\n*1974 – Satyendra Nath Bose, Indian physicist, mathematician, and academic (b. 1894)\n*1975 – Louis Jordan, American singer-songwriter and saxophonist (b. 1908)\n*1982 – Alex Harvey, Scottish singer-songwriter and guitarist (b. 1935)\n*  1982   – Georg Konrad Morgen, German lawyer and judge (b. 1909)\n*1983 – Karen Carpenter, American singer (b. 1950)\n*1987 – Liberace, American singer-songwriter and pianist, (b. 1919)\n*  1987   – Meena Keshwar Kamal, Afghan activist, founded the Revolutionary Association of the Women of Afghanistan (b. 1956)\n*  1987   – Carl Rogers, American psychologist and academic (b. 1902)\n*1990 – Whipper Billy Watson, Canadian-American wrestler and trainer (b. 1915)\n*1992 – John Dehner, American actor (b. 1915)\n*1995 – Patricia Highsmith, American novelist and short story writer (b. 1921)\n*2000 – Carl Albert, American lawyer and politician, 54th Speaker of the United States House of Representatives (b. 1908)\n*2002 – Count Sigvard Bernadotte of Wisborg (b. 1907)\n*2003 – Benyoucef Benkhedda, Algerian pharmacist and politician (b. 1920)\n*2005 – Ossie Davis, American actor, director, and playwright (b. 1917)\n*2006 – Betty Friedan, American author and activist (b. 1921)\n*2007 – José Carlos Bauer, Brazilian footballer and manager (b. 1925)\n*  2007   – Ilya Kormiltsev, Russian-English poet and translator (b. 1959)\n*  2007   – Barbara McNair, American singer and actress (b. 1934)\n*  2007   – Jules Olitski, Ukrainian-American painter and sculptor (b. 1922)\n*2008 – Augusta Dabney, American actress (b. 1918)\n*  2008   – Stefan Meller, Polish academic and politician, Minister of Foreign Affairs of Poland (b. 1942)\n*2010 – Kostas Axelos, Greek-French philosopher and author (b. 1924)\n*  2010   – Helen Tobias-Duesberg, Estonian-American composer (b. 1919) \n*2011 – Martial Célestin, Haitian lawyer and politician, 1st Prime Minister of Haiti (b. 1913)\n*2012 – István Csurka, Hungarian journalist and politician (b. 1934)\n*  2012   – Florence Green, English soldier (b. 1901)\n*  2012   – Robert Daniel, American farmer, soldier, and politician (b. 1936)\n*  2012   – Mike deGruy, American director, producer, and cinematographer (b. 1951)\n*2013 – Donald Byrd, American trumpet player (b. 1932)\n*  2013   – Reg Presley, English singer-songwriter (b. 1941)\n*2014 – Keith Allen, Canadian-American ice hockey player, coach, and manager (b. 1923)\n*  2014   – Eugenio Corti, Italian soldier, author, and playwright (b. 1921)\n*  2014   – Dennis Lota, Zambian footballer (b. 1973)\n*2015 – Wes Cooley, American soldier and politician (b. 1932) \t\n*  2015   – Fitzhugh L. Fulton, American colonel and pilot (b. 1925) \t\n*2016 – Edgar Mitchell, American captain, pilot, and astronaut (b. 1930)\n*2017 – Steve Lang, Canadian bass player (b. 1949)\n*  2017   – Bano Qudsia, Pakistani writer (b. 1928)\n*2018 – John Mahoney, English-American actor, voice artist, and comedian (b. 1940)\n\nHolidays and observances\n\n*Christian feast day:\n**Andrew Corsini\n**Gilbert of Sempringham\n**John de Brito\n**Rabanus Maurus\n**Rimbert\n**Veronica\n**February 4 (Eastern Orthodox liturgics)\n\n*Day of the Armed Struggle (Angola)\n*Independence Day (Sri Lanka)\n*Rosa Parks Day (California and Missouri, United States)\n*World Cancer Day. February 4. http://en.wikipedia.org/?curid=11359."
  }
}
