{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12888",
  "eid" : "05503900-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778518160,
  "textBody" : "Francis Gary Powers (August 17, 1929 – August 1, 1977) – often referred to as simply Gary Powers – was an American pilot whose Central Intelligence Agency (CIA) U-2 spy plane was shot down while flying a reconnaissance mission in Soviet Union airspace, causing the 1960 U-2 incident.\n\nEarly life\n\nPowers was born August 17, 1929, in Jenkins, Kentucky, the son of Oliver Winfield Powers (1904–1970), a coal miner, and his wife Ida Melinda Powers (; 1905–1991).  His family eventually moved to Pound, Virginia, just across the state border. He was the second born and only male of six children. \n\nHis family lived in a mining town, and because of the hardships associated with the life in such a town, his father wanted Powers to become a doctor. He hoped his son would achieve the higher earnings of such a profession and felt the life of a doctor would involve less hardship than any job in his hometown.\n\nEducation and service\n\nGraduating with a bachelor's degree from Milligan College in Tennessee in June 1950, he enlisted in the Air Force in October. He was commissioned as a Second Lieutenant in the United States Air Force in December 1952 after completing his advanced training with USAF Pilot Training Class 52-H[http://www.52g-52hpilots.org/rosters/52-h.htm] at Williams Air Force Base, Arizona. Powers was then assigned to the 468th Strategic Fighter Squadron at Turner Air Force Base, Georgia, as an F-84 Thunderjet pilot. \n\nIn January 1956 he was recruited by the CIA. He married Barbara Gay Moore in April 1956. In May 1956 he began U-2 training at Watertown Strip, Nevada. His training was complete by August 1956 and his unit, the Second Weather Observational Squadron (Provisional) or Detachment 10-10, was deployed to Incirlik Air Base, Turkey. By 1960, Powers was already a veteran of many covert aerial reconnaissance missions.\n\nThe U-2 incident\n\nPowers was discharged from the Air Force in 1956 with the rank of captain. He then joined the CIA's U-2 program at the civilian grade of GS-12. U-2 pilots flew espionage missions at altitudes above , above the reach of Soviet air defenses. The U-2 was equipped with a state-of-the-art camera designed to take high-resolution photos from the edge of the stratosphere over hostile countries, including the Soviet Union. U-2 missions systematically photographed military installations and other important sites.\n\nSpy mission\n\nThe primary mission of the U-2s was overflying the Soviet Union. The border surveillance and atomic sampling, though vital, were secondary. Additionally, the U-2 flew special missions. If there was a trouble spot in the Middle East, the U-2s observed it.  Beginning on September 27, 1956 and continuing until 1960, the United States was spying not only on most of the countries in the Middle East but also on her own allies.\n\nSoviet intelligence had been aware of encroaching U-2 flights at least since 1958 if not sooner but lacked effective countermeasures until 1960. On May 1, 1960, Powers' U-2A, 56-6693, departed from a military airbase in Peshawar, Pakistan, with support from the U.S. Air Station at Badaber (Peshawar Air Station). This was to be the first attempt \"to fly all the way across the Soviet Union...but it was considered worth the gamble. The planned route would take us deeper into Russia than we had ever gone, while traversing important targets never before photographed.\"\n\nShot down\n\nPowers was shot down by an S-75 Dvina (SA-2 Guideline) surface-to-air missile over Sverdlovsk. A total of fourteen were launched,Polmar, Norman (2001). Spyplane: The U-2 History Declassified. Zenith Press. p. 137  one of which hit a MiG-19 jet fighter which was sent to intercept the U-2 but could not reach a high enough altitude. Its pilot, Sergei Safronov, ejected but died of his injuries. Another Soviet aircraft, a newly manufactured Su-9 in transit flight, also attempted to intercept Powers' U-2. The unarmed Su-9 was directed to ram the U-2 but missed because of the large differences in speed (the Su-9 flew above Mach 1.1, while the U-2 flew at approximately Mach 0.6).\n\nThe first of three SA-2 Guideline (S-75 Dvina) surface-to-air missiles launched at the U-2 near Kosulino in the Ural Region impacted the aircraft. \"What was left of the plane began spinning, only upside down, the nose pointing upward toward the sky, the tail down toward the ground.\"  Powers was unable to activate the plane's self-destruct mechanism before he was thrown out of the plane after releasing the canopy and his seat belt. While descending under his parachute, Powers had time to scatter his escape map, and rid himself of part of his suicide device, a silver dollar coin suspended around his neck containing a poison-laced injection pin, though he kept the poison pin.http://www.smithsonianmag.com/smithsonian-institution/gary-powers-secret-diary-soviet-capture-180956939/#yilEojcaVQvIj9qc.99 \"Yet I was still hopeful of escape.\"  He hit the ground hard, was immediately captured, and taken to Lubyanka Prison in Moscow. Powers did note a second chute after landing on the ground, \"some distance away and very high, a lone red and white parachute\".\n\nCover story\n\nWhen the U.S. government learned of Powers' disappearance over the Soviet Union, they issued a cover statement claiming a \"weather plane\" had strayed off course after its pilot had \"difficulties with his oxygen equipment\". What CIA officials did not realize was that the plane crashed almost fully intact, and the Soviets recovered its equipment. Powers was interrogated extensively by the KGB for months before he made a confession and a public apology for his part in espionage.\n\nCompromised by newspaper reports\n\nPowers tried to limit the information he shared with the KGB to that which could be determined from the remains of his plane's wreckage. He was hampered by information appearing in the western press. A KGB major stated \"there's no reason for you to withhold information. We'll find it out anyway. Your press will give it to us.\"  However, he limited his divulging of CIA contacts to one individual, with a pseudonym of \"Collins\".  At the same time, he repeatedly stated the maximum altitude for the U-2 was , significantly lower than its actual flight ceiling.\n\nPolitical impact\n\nThe incident set back talks between Khrushchev and Eisenhower. Powers' interrogations ended on June 30, and his solitary confinement on July 9. On August 17, 1960, his trial for espionage began before the military division of the Supreme Court of the USSR. Three generals, Lieutenant General Borisoglebsky, Major General Vorobyev, and Major General Zakharov presided. Roman Rudenko acted as prosecutor in his capacity of Procurator General of the Soviet Union.  Mikhail I. Grinev served as Powers' defense counsel. In attendance were Gary's parents and sister, as well as Barbara and her mother. Gary's father brought along his local attorney, Carl McAfee, while the CIA provided two additional attorneys.\n\nConviction\n\nOn August 19, 1960, Powers was convicted of espionage, \"a grave crime covered by Article 2 of the Soviet Union's law 'On Criminality Responsibility for State Crimes'\".  His sentence consisted of ten years confinement, three of which were to be in a prison, with the remainder in a labor camp. The US Embassy \"News Bulletin\" stated, according to Powers, \"as far as the government was concerned, I had acted in accordance with the instructions given me and would receive my full salary while imprisoned\".\n\nHe was held in Vladimir Central Prison, about 150 mi east of Moscow, in building number 2 from September 9, 1960 until February 8, 1962. His cell mate was Zigurd Kruminsh, a Latvian political prisoner. Gary kept a diary and a journal while confined. Additionally he took up carpet weaving from his cell mate to pass the time. He could send and receive a limited number of letters from his family. The prison now contains a small museum with an exhibit on Powers, who allegedly developed a good rapport with Russian prisoners there. Some pieces of the plane and Powers' uniform are on display at the Monino Airbase museum near Moscow.\n\nPrisoner exchange\n\nOn February 10, 1962, Powers was exchanged, along with American student Frederic Pryor, in a well-publicized spy swap at the Glienicke Bridge in Berlin. The exchange was for Soviet KGB Colonel Vilyam Fisher, known as \"Rudolf Abel\", who had been caught by the FBI and tried and jailed for espionage.[https://www.fbi.gov/about-us/history/famous-cases/hollow-nickel/rudolph-ivanovich-abel-hollow-nickel-case/ Famous Cases: Rudolph Ivanovich Abel (Hollow Nickel Case)] . Federal Bureau of Investigation.  Powers credited his father with the swap idea. When released, Powers' total time in captivity was 1 year, 9 months and 10 days.\n\nIn 2010, CIA documents were released indicating that American officials did not believe Powers' account of the incident at the time, because it was contradicted by a classified National Security Agency (NSA) report which alleged that the U-2 had descended from  before changing course and disappearing from radar. However, newly released declassified CIA documents confirm the accuracy of Powers' report. The NSA report remains classified.\n\nAftermath\n\nPowers initially received a cold reception on his return home. He was criticized for having failed to activate his aircraft's self-destruct charge to destroy the camera, photographic film, and related classified parts of his aircraft before his capture. He was also criticized for not using an optional CIA-issued \"suicide pill\" (later revealed, during CIA testimony to the Church Committee in 1975 to be a coin with shellfish toxin embedded in its grooves) to kill himself.\n\nAfter being debriefed extensively by the CIA, Lockheed, and the Air Force, a statement was issued stating, \"Mr. Powers lived up to the terms of his employment and instructions in connection with his mission and in his obligations as an American.\" On March 6, 1962, Powers appeared before a Senate Armed Services Select Committee hearing chaired by Senator Richard Russell and including Senators Prescott Bush, Leverett Saltonstall, Robert Byrd, Margaret Chase Smith, John Stennis, Strom Thurmond, and Barry Goldwater, Sr. During the hearing, Senator Saltonstall stated, \"I commend you as a courageous, fine young American citizen who lived up to your instructions and who did the best you could under very difficult circumstances.\"  While Senator Bush declared, \"I am satisfied he has conducted himself in exemplary fashion and in accordance with the highest traditions of service to one's country, and I congratulate him upon his conduct in captivity...\"  Finally, Senator Goldwater sent Powers a handwritten note stating, \"You did a good job for your country.\"\n\nDivorce\n\nIn January 1963, he divorced his wife Barbara. He started a relationship with Claudia Edwards \"Sue\" Downey, whom he had met while working briefly at CIA Headquarters. They were married on October 26, 1963VA Marriage Records 1936-2014, Certificate #32518. Their son Francis Gary Powers, II, was born on June 5, 1965.\n\nPraise\n\nDuring a speech in March 1964, former CIA Director Allen Dulles said of Powers, \"He performed his duty in a very dangerous mission and he performed it well, and I think I know more about that than some of his detractors and critics know, and I am glad to say that to him tonight.\"\n\nLater career\n\nPowers worked for Lockheed as a test pilot from 1962 to 1970, though the CIA paid his salary. In 1970, he published Operation Overflight. Lockheed fired him, because\n\"the book's publication had ruffled some feathers at Langley.\" Powers became a helicopter traffic pilot reporter for KNBC News Channel 4.\n\nDeath\n\nOn August 1, 1977, while conducting a traffic report over Los Angeles, his helicopter crashed, killing him and George Spears, his cameraman. Powers had been covering brush fires in Santa Barbara County in the KNBC helicopter and was heading back from flying over them. \n\nAs he returned, his Bell 206 Jet Ranger helicopter, registered N4TV, ran out of fuel and crashed at the Sepulveda Dam recreational area in nearby Encino, several miles short of its intended landing site at Burbank Airport, killing Powers instantly. The National Transportation Safety Board report attributed the probable cause of the crash to pilot error (poor fuel management). According to Powers' son, an aviation mechanic had repaired a faulty fuel gauge without informing Powers, who subsequently misread it. \n\nAt the last moment he noticed children playing in the area, and directed the helicopter elsewhere to avoid landing on them. If not for the last-second deviation, which compromised his autorotative descent, he might have landed safely.\n \nPowers was survived by his wife, two children, Claudia Dee and Francis Gary Powers Jr., and five sisters. Powers is buried in Arlington National Cemetery as an Air Force veteran.\n\nHonors\n\nPowers received the CIA's Intelligence Star in 1965 after his return from the Soviet Union. Powers was originally scheduled to receive it in 1963 along with other pilots involved in the CIA's U-2 program, but the award was postponed for political reasons. In 1970, Powers published his first – and only – book review, on a work about aerial reconnaissance, Unarmed and Unafraid by Glenn Infield, in the monthly magazine Business & Commercial Aviation. \"The subject has great interest to me,\" he said, in submitting his review.Letter to G. Haber, Managing Editor, Business & Commercial Aviation\n\nIn 1998, newly declassified information revealed that Powers's mission had been a joint USAF/CIA operation. In 2000, on the 40th anniversary of the U-2 Incident, his family was presented with his posthumously awarded Prisoner of War Medal, Distinguished Flying Cross, and National Defense Service Medal. In addition, CIA Director George Tenet authorized Powers to posthumously receive the CIA's coveted Director's Medal for extreme fidelity and extraordinary courage in the line of duty.[https://web.archive.org/web/20090226191939/http://www.spymuseum.org/programs/educate/pdfs/AIRSHO2007_Powers.pdf Traitor or Patriot?] Boghardt, Thomas. International Spy Museum. Retrieved May 1, 2015.\n\nOn June 15, 2012, Powers was posthumously awarded the Silver Star medal for \"demonstrating 'exceptional loyalty' while enduring harsh interrogation in the Lubyanka Prison in Moscow for almost two years.\" Air Force Chief of Staff General Norton Schwartz presented the decoration to Powers's grandchildren, Trey Powers, 9, and Lindsey Berry, 29, in a Pentagon ceremony.\n\nLegacy\n\nPowers' son, Francis Gary Powers Jr., founded the Cold War Museum in 1996. Affiliated with the Smithsonian Institution, it was essentially a traveling exhibit until it found a permanent home in 2011 on a former Army communications base outside Washington.\n\nIn popular culture\n\n*In the 1976 telemovie Francis Gary Powers: The True Story of the U-2 Spy Incident, Powers was played by Lee Majors.\n*In 1999, the History Channel aired Mystery of the U2, hosted by Arthur Kent as part of their History Undercover series.  The program was produced by Indigo Films.\n*In the 2015 movie Bridge of Spies, dramatizing the negotiations to repatriate Powers, he is portrayed by Austin Stowell, with Tom Hanks starring as negotiator James Donovan.[https://variety.com/2014/film/news/tom-hanks-steven-spielberg-cold-war-thriller-set-for-oct-16-2015-1201221269/ \"Tom Hanks-Steven Spielberg Cold War Thriller Set for Oct. 16, 2015\"], Variety, accessed June 5, 2014",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Francis Gary Powers" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12888" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Francis Gary Powers (August 17, 1929 – August 1, 1977) – often referred to as simply Gary Powers – was an American pilot whose Central Intelligence Agency (CIA) U-2 spy plane was shot down while flying a reconnaissance mission in Soviet Union airspace, causing the 1960 U-2 incident.\n\nEarly life\n\nPowers was born August 17, 1929, in Jenkins, Kentucky, the son of Oliver Winfield Powers (1904–1970), a coal miner, and his wife Ida Melinda Powers (; 1905–1991).  His family eventually moved to Pound, Virginia, just across the state border. He was the second born and only male of six children. \n\nHis family lived in a mining town, and because of the hardships associated with the life in such a town, his father wanted Powers to become a doctor. He hoped his son would achieve the higher earnings of such a profession and felt the life of a doctor would involve less hardship than any job in his hometown.\n\nEducation and service\n\nGraduating with a bachelor's degree from Milligan College in Tennessee in June 1950, he enlisted in the Air Force in October. He was commissioned as a Second Lieutenant in the United States Air Force in December 1952 after completing his advanced training with USAF Pilot Training Class 52-H[http://www.52g-52hpilots.org/rosters/52-h.htm] at Williams Air Force Base, Arizona. Powers was then assigned to the 468th Strategic Fighter Squadron at Turner Air Force Base, Georgia, as an F-84 Thunderjet pilot. \n\nIn January 1956 he was recruited by the CIA. He married Barbara Gay Moore in April 1956. In May 1956 he began U-2 training at Watertown Strip, Nevada. His training was complete by August 1956 and his unit, the Second Weather Observational Squadron (Provisional) or Detachment 10-10, was deployed to Incirlik Air Base, Turkey. By 1960, Powers was already a veteran of many covert aerial reconnaissance missions.\n\nThe U-2 incident\n\nPowers was discharged from the Air Force in 1956 with the rank of captain. He then joined the CIA's U-2 program at the civilian grade of GS-12. U-2 pilots flew espionage missions at altitudes above , above the reach of Soviet air defenses. The U-2 was equipped with a state-of-the-art camera designed to take high-resolution photos from the edge of the stratosphere over hostile countries, including the Soviet Union. U-2 missions systematically photographed military installations and other important sites.\n\nSpy mission\n\nThe primary mission of the U-2s was overflying the Soviet Union. The border surveillance and atomic sampling, though vital, were secondary. Additionally, the U-2 flew special missions. If there was a trouble spot in the Middle East, the U-2s observed it.  Beginning on September 27, 1956 and continuing until 1960, the United States was spying not only on most of the countries in the Middle East but also on her own allies.\n\nSoviet intelligence had been aware of encroaching U-2 flights at least since 1958 if not sooner but lacked effective countermeasures until 1960. On May 1, 1960, Powers' U-2A, 56-6693, departed from a military airbase in Peshawar, Pakistan, with support from the U.S. Air Station at Badaber (Peshawar Air Station). This was to be the first attempt \"to fly all the way across the Soviet Union...but it was considered worth the gamble. The planned route would take us deeper into Russia than we had ever gone, while traversing important targets never before photographed.\"\n\nShot down\n\nPowers was shot down by an S-75 Dvina (SA-2 Guideline) surface-to-air missile over Sverdlovsk. A total of fourteen were launched,Polmar, Norman (2001). Spyplane: The U-2 History Declassified. Zenith Press. p. 137  one of which hit a MiG-19 jet fighter which was sent to intercept the U-2 but could not reach a high enough altitude. Its pilot, Sergei Safronov, ejected but died of his injuries. Another Soviet aircraft, a newly manufactured Su-9 in transit flight, also attempted to intercept Powers' U-2. The unarmed Su-9 was directed to ram the U-2 but missed because of the large differences in speed (the Su-9 flew above Mach 1.1, while the U-2 flew at approximately Mach 0.6).\n\nThe first of three SA-2 Guideline (S-75 Dvina) surface-to-air missiles launched at the U-2 near Kosulino in the Ural Region impacted the aircraft. \"What was left of the plane began spinning, only upside down, the nose pointing upward toward the sky, the tail down toward the ground.\"  Powers was unable to activate the plane's self-destruct mechanism before he was thrown out of the plane after releasing the canopy and his seat belt. While descending under his parachute, Powers had time to scatter his escape map, and rid himself of part of his suicide device, a silver dollar coin suspended around his neck containing a poison-laced injection pin, though he kept the poison pin.http://www.smithsonianmag.com/smithsonian-institution/gary-powers-secret-diary-soviet-capture-180956939/#yilEojcaVQvIj9qc.99 \"Yet I was still hopeful of escape.\"  He hit the ground hard, was immediately captured, and taken to Lubyanka Prison in Moscow. Powers did note a second chute after landing on the ground, \"some distance away and very high, a lone red and white parachute\".\n\nCover story\n\nWhen the U.S. government learned of Powers' disappearance over the Soviet Union, they issued a cover statement claiming a \"weather plane\" had strayed off course after its pilot had \"difficulties with his oxygen equipment\". What CIA officials did not realize was that the plane crashed almost fully intact, and the Soviets recovered its equipment. Powers was interrogated extensively by the KGB for months before he made a confession and a public apology for his part in espionage.\n\nCompromised by newspaper reports\n\nPowers tried to limit the information he shared with the KGB to that which could be determined from the remains of his plane's wreckage. He was hampered by information appearing in the western press. A KGB major stated \"there's no reason for you to withhold information. We'll find it out anyway. Your press will give it to us.\"  However, he limited his divulging of CIA contacts to one individual, with a pseudonym of \"Collins\".  At the same time, he repeatedly stated the maximum altitude for the U-2 was , significantly lower than its actual flight ceiling.\n\nPolitical impact\n\nThe incident set back talks between Khrushchev and Eisenhower. Powers' interrogations ended on June 30, and his solitary confinement on July 9. On August 17, 1960, his trial for espionage began before the military division of the Supreme Court of the USSR. Three generals, Lieutenant General Borisoglebsky, Major General Vorobyev, and Major General Zakharov presided. Roman Rudenko acted as prosecutor in his capacity of Procurator General of the Soviet Union.  Mikhail I. Grinev served as Powers' defense counsel. In attendance were Gary's parents and sister, as well as Barbara and her mother. Gary's father brought along his local attorney, Carl McAfee, while the CIA provided two additional attorneys.\n\nConviction\n\nOn August 19, 1960, Powers was convicted of espionage, \"a grave crime covered by Article 2 of the Soviet Union's law 'On Criminality Responsibility for State Crimes'\".  His sentence consisted of ten years confinement, three of which were to be in a prison, with the remainder in a labor camp. The US Embassy \"News Bulletin\" stated, according to Powers, \"as far as the government was concerned, I had acted in accordance with the instructions given me and would receive my full salary while imprisoned\".\n\nHe was held in Vladimir Central Prison, about 150 mi east of Moscow, in building number 2 from September 9, 1960 until February 8, 1962. His cell mate was Zigurd Kruminsh, a Latvian political prisoner. Gary kept a diary and a journal while confined. Additionally he took up carpet weaving from his cell mate to pass the time. He could send and receive a limited number of letters from his family. The prison now contains a small museum with an exhibit on Powers, who allegedly developed a good rapport with Russian prisoners there. Some pieces of the plane and Powers' uniform are on display at the Monino Airbase museum near Moscow.\n\nPrisoner exchange\n\nOn February 10, 1962, Powers was exchanged, along with American student Frederic Pryor, in a well-publicized spy swap at the Glienicke Bridge in Berlin. The exchange was for Soviet KGB Colonel Vilyam Fisher, known as \"Rudolf Abel\", who had been caught by the FBI and tried and jailed for espionage.[https://www.fbi.gov/about-us/history/famous-cases/hollow-nickel/rudolph-ivanovich-abel-hollow-nickel-case/ Famous Cases: Rudolph Ivanovich Abel (Hollow Nickel Case)] . Federal Bureau of Investigation.  Powers credited his father with the swap idea. When released, Powers' total time in captivity was 1 year, 9 months and 10 days.\n\nIn 2010, CIA documents were released indicating that American officials did not believe Powers' account of the incident at the time, because it was contradicted by a classified National Security Agency (NSA) report which alleged that the U-2 had descended from  before changing course and disappearing from radar. However, newly released declassified CIA documents confirm the accuracy of Powers' report. The NSA report remains classified.\n\nAftermath\n\nPowers initially received a cold reception on his return home. He was criticized for having failed to activate his aircraft's self-destruct charge to destroy the camera, photographic film, and related classified parts of his aircraft before his capture. He was also criticized for not using an optional CIA-issued \"suicide pill\" (later revealed, during CIA testimony to the Church Committee in 1975 to be a coin with shellfish toxin embedded in its grooves) to kill himself.\n\nAfter being debriefed extensively by the CIA, Lockheed, and the Air Force, a statement was issued stating, \"Mr. Powers lived up to the terms of his employment and instructions in connection with his mission and in his obligations as an American.\" On March 6, 1962, Powers appeared before a Senate Armed Services Select Committee hearing chaired by Senator Richard Russell and including Senators Prescott Bush, Leverett Saltonstall, Robert Byrd, Margaret Chase Smith, John Stennis, Strom Thurmond, and Barry Goldwater, Sr. During the hearing, Senator Saltonstall stated, \"I commend you as a courageous, fine young American citizen who lived up to your instructions and who did the best you could under very difficult circumstances.\"  While Senator Bush declared, \"I am satisfied he has conducted himself in exemplary fashion and in accordance with the highest traditions of service to one's country, and I congratulate him upon his conduct in captivity...\"  Finally, Senator Goldwater sent Powers a handwritten note stating, \"You did a good job for your country.\"\n\nDivorce\n\nIn January 1963, he divorced his wife Barbara. He started a relationship with Claudia Edwards \"Sue\" Downey, whom he had met while working briefly at CIA Headquarters. They were married on October 26, 1963VA Marriage Records 1936-2014, Certificate #32518. Their son Francis Gary Powers, II, was born on June 5, 1965.\n\nPraise\n\nDuring a speech in March 1964, former CIA Director Allen Dulles said of Powers, \"He performed his duty in a very dangerous mission and he performed it well, and I think I know more about that than some of his detractors and critics know, and I am glad to say that to him tonight.\"\n\nLater career\n\nPowers worked for Lockheed as a test pilot from 1962 to 1970, though the CIA paid his salary. In 1970, he published Operation Overflight. Lockheed fired him, because\n\"the book's publication had ruffled some feathers at Langley.\" Powers became a helicopter traffic pilot reporter for KNBC News Channel 4.\n\nDeath\n\nOn August 1, 1977, while conducting a traffic report over Los Angeles, his helicopter crashed, killing him and George Spears, his cameraman. Powers had been covering brush fires in Santa Barbara County in the KNBC helicopter and was heading back from flying over them. \n\nAs he returned, his Bell 206 Jet Ranger helicopter, registered N4TV, ran out of fuel and crashed at the Sepulveda Dam recreational area in nearby Encino, several miles short of its intended landing site at Burbank Airport, killing Powers instantly. The National Transportation Safety Board report attributed the probable cause of the crash to pilot error (poor fuel management). According to Powers' son, an aviation mechanic had repaired a faulty fuel gauge without informing Powers, who subsequently misread it. \n\nAt the last moment he noticed children playing in the area, and directed the helicopter elsewhere to avoid landing on them. If not for the last-second deviation, which compromised his autorotative descent, he might have landed safely.\n \nPowers was survived by his wife, two children, Claudia Dee and Francis Gary Powers Jr., and five sisters. Powers is buried in Arlington National Cemetery as an Air Force veteran.\n\nHonors\n\nPowers received the CIA's Intelligence Star in 1965 after his return from the Soviet Union. Powers was originally scheduled to receive it in 1963 along with other pilots involved in the CIA's U-2 program, but the award was postponed for political reasons. In 1970, Powers published his first – and only – book review, on a work about aerial reconnaissance, Unarmed and Unafraid by Glenn Infield, in the monthly magazine Business & Commercial Aviation. \"The subject has great interest to me,\" he said, in submitting his review.Letter to G. Haber, Managing Editor, Business & Commercial Aviation\n\nIn 1998, newly declassified information revealed that Powers's mission had been a joint USAF/CIA operation. In 2000, on the 40th anniversary of the U-2 Incident, his family was presented with his posthumously awarded Prisoner of War Medal, Distinguished Flying Cross, and National Defense Service Medal. In addition, CIA Director George Tenet authorized Powers to posthumously receive the CIA's coveted Director's Medal for extreme fidelity and extraordinary courage in the line of duty.[https://web.archive.org/web/20090226191939/http://www.spymuseum.org/programs/educate/pdfs/AIRSHO2007_Powers.pdf Traitor or Patriot?] Boghardt, Thomas. International Spy Museum. Retrieved May 1, 2015.\n\nOn June 15, 2012, Powers was posthumously awarded the Silver Star medal for \"demonstrating 'exceptional loyalty' while enduring harsh interrogation in the Lubyanka Prison in Moscow for almost two years.\" Air Force Chief of Staff General Norton Schwartz presented the decoration to Powers's grandchildren, Trey Powers, 9, and Lindsey Berry, 29, in a Pentagon ceremony.\n\nLegacy\n\nPowers' son, Francis Gary Powers Jr., founded the Cold War Museum in 1996. Affiliated with the Smithsonian Institution, it was essentially a traveling exhibit until it found a permanent home in 2011 on a former Army communications base outside Washington.\n\nIn popular culture\n\n*In the 1976 telemovie Francis Gary Powers: The True Story of the U-2 Spy Incident, Powers was played by Lee Majors.\n*In 1999, the History Channel aired Mystery of the U2, hosted by Arthur Kent as part of their History Undercover series.  The program was produced by Indigo Films.\n*In the 2015 movie Bridge of Spies, dramatizing the negotiations to repatriate Powers, he is portrayed by Austin Stowell, with Tom Hanks starring as negotiator James Donovan.[https://variety.com/2014/film/news/tom-hanks-steven-spielberg-cold-war-thriller-set-for-oct-16-2015-1201221269/ \"Tom Hanks-Steven Spielberg Cold War Thriller Set for Oct. 16, 2015\"], Variety, accessed June 5, 2014. Francis Gary Powers. http://en.wikipedia.org/?curid=12888."
  }
}
