{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7299",
  "eid" : "e0e9fc40-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778457092,
  "textBody" : "Colonialism is the policy of a nation seeking to extend or retain its authority over other people or territories, generally with the aim of exploiting them to the benefit of the colonizing country and helping the colonies modernize in terms defined by the colonizers, especially in economics, religion and health.\n\nThe European colonial period was the era from the 15th century to 1914 when Spain, Portugal, Britain, Russia, France, the Netherlands, Germany and several smaller European countries established colonies outside Europe. It has been estimated that by 1914, Europeans \"had gained control of 84% of the globe\", and by 1800, before the Industrial Revolution had taken hold, they already controlled at least 35% (excluding Antarctica). The system practically ended 1945-1975 when nearly all colonies became independent. At first, the countries followed a policy of mercantilism, designed to strengthen the home economy at the expense of rivals, so the colonies were usually allowed to trade only with the mother country. By the mid-19th century, however, the powerful British Empire gave up mercantilism and trade restrictions and introduced the principle of free trade, with few restrictions or tariffs. Christian missionaries were active in practically all the colonies. 15th century also saw the emergence of the West Asian Ottoman Empire which would go on to be the last colonizer of Europe. Asian colonization of Europe came to an end with the end of the Ottomans. By the late 19th century Japan was an active colonizer.\n\nDefinitions\n\nCollins English Dictionary defines colonialism as \"the policy and practice of a power in extending control over weaker peoples or areas.\" Webster's Encyclopedic Dictionary defines colonialism as \"the system or policy of a nation seeking to extend or retain its authority over other people or territories.\"Webster's Encyclopedic Unabridged Dictionary of the English Language, 1989, p. 291. The Merriam-Webster Dictionary offers four definitions, including \"something characteristic of a colony\" and \"control by one power over a dependent area or people.\"\n\nThe 2006 Stanford Encyclopedia of Philosophy \"uses the term 'colonialism' to describe the process of European settlement and political control over the rest of the world, including the Americas, Australia, and parts of Africa and Asia.\" It discusses the distinction between colonialism and imperialism and states that \"given the difficulty of consistently distinguishing between the two terms, this entry will use colonialism as a broad concept that refers to the project of European political domination from the sixteenth to the twentieth centuries that ended with the national liberation movements of the 1960s.\"\n\nIn his preface to Jürgen Osterhammel's Colonialism: A Theoretical Overview, Roger Tignor says, \"For Osterhammel, the essence of colonialism is the existence of colonies, which are by definition governed differently from other territories such as protectorates or informal spheres of influence.\" In the book, Osterhammel asks, \"How can 'colonialism' be defined independently from 'colony?'\" He settles on a three-sentence definition:\n\nTypes of colonialism\n\nHistorians often distinguish between various overlapping forms of colonialism:\n\n*Settler colonialism involves large-scale immigration, often motivated by religious, political, or economic reasons. It pursues to replace the original population.\n*Exploitation colonialism involves fewer colonists and focuses on the exploitation of natural resources or population as labour, typically to the benefit of the metropole. This category includes trading posts as well as larger colonies where colonists would constitute much of the political and economic administration. Prior to the end of the slave trade and widespread abolition, when indigenous labour was unavailable, slaves were often imported to the Americas, first by the Portuguese Empire, and later by the Spanish, Dutch, French and British.\n*Surrogate colonialism involves a settlement project supported by a colonial power, in which most of the settlers do not come from same ethnic group as the ruling power.\n*Internal colonialism is a notion of uneven structural power between areas of a state. The source of exploitation comes from within the state.\n\nSocio-cultural evolution\n\nAs colonialism often played out in pre-populated areas, sociocultural evolution included the formation of various ethnically hybrid populations. Colonialism gave rise to culturally and ethnically mixed populations such as the mestizos of the Americas, as well as racially divided populations such as those found in French Algeria or in Southern Rhodesia. In fact, everywhere where colonial powers established a consistent and continued presence, hybrid communities existed.\n\nNotable examples in Asia include the Anglo-Burmese,  Anglo-Indian, Burgher, Eurasian Singaporean, Filipino mestizo, Kristang and Macanese peoples. In the Dutch East Indies (later Indonesia) the vast majority of \"Dutch\" settlers were in fact Eurasians known as Indo-Europeans, formally belonging to the European legal class in the colony (see also Indos in pre-colonial history and Indos in colonial history).\nBosma U., Raben R. Being \"Dutch\" in the Indies: a history of creolisation and empire, 1500–1920 (University of Michigan, NUS Press, 2008) p. 223.  [https://books.google.com/books?id47wCTCJX9X4C&dq\nCarel+Pieter+Brest+van+Kempen&source=gbs_navlinks_s Googlebook]\n\nGouda, Frances Dutch Culture Overseas: Colonial Practice in the Netherlands Indies 1900–1942. (Publisher: Equinox, 2008) . Chapter 5, p. 163. [https://books.google.com/books?idnN6G-lMk_DEC&source\ngbs_navlinks_s]\n\nThe Other \n\n\"The Other,\" or \"othering\" is the process of creating a separate entity to persons or groups who are labelled as different or non-normal due to the repetition of characteristics. Othering is the creation of those who discriminate, to distinguish, label, categorize those who do not fit in the societal norm. Several scholars in recent decades developed the notion of the \"other\" as an epistemological concept in social theory. For example, postcolonial scholars, believed that colonizing powers explained an ‘other’ who were there to dominate, civilize, and extract resources through colonization of land.\n\nPolitical geographers explain how colonial/ imperial powers (countries, groups of people etc.) \"othered\" places they wanted to dominate to legalize their exploitation of the land. During and after the rise of colonialism the Western powers perceived the East as the \"other,\" being different and separate from their societal norm. This viewpoint and separation of culture had divided the Eastern and Western culture creating a dominant/ subordinate dynamic, both being the \"other\" towards themselves.\n\nHistory\n\nActivity that could be called colonialism has a long history starting with the pre-colonial African empires which led to the Egyptians, Phoenicians, Greeks and Romans who all built colonies in antiquity. The word \"metropole\" comes from the Greek metropolis [Greek: \"μητρόπολις\"]—\"mother city\". The word \"colony\" comes from the Latin colonia—\"a place for agriculture\". Between the 11th and 18th centuries, the Vietnamese established military colonies south of their original territory and absorbed the territory, in a process known as nam tiến.[http://countrystudies.us/vietnam/11.htm The Le Dynasty and Southward Expansion]\n\nModern colonialism started with the Age of Discovery. Portugal and Spain (initially the Crown of Castile) encountered Central and South America through sea travel and built trading posts or conquered large extensions of land. For some people, it is this building of colonies across oceans that differentiates colonialism from other types of expansionism. These new lands were divided between the Portuguese and Spanish Empires (then still between Portugal and Castile—the Crown of Castile had a dynastic but not state union with the Crown of Aragon through the Catholic Monarchs), first by the papal bull Inter caetera and then by the treaties of Tordesillas and Zaragoza.\n\nThis period is also associated with the Commercial Revolution. The late Middle Ages saw reforms in accountancy and banking in Italy and the eastern Mediterranean. These ideas were adopted and adapted in western Europe to the high risks and rewards associated with colonial ventures.\n\nThe 17th century saw the creation of the French colonial empire and the Dutch Empire, as well as the English overseas possessions, which later became the British Empire. It also saw the establishment of a Danish colonial empire and some Swedish overseas colonies.\n\nThe spread of colonial empires was reduced in the late 18th and early 19th centuries by the American Revolutionary War and the Latin American wars of independence. However, many new colonies were established after this time, including the German colonial empire and Belgian colonial empire. In the late 19th century, many European powers were involved in the Scramble for Africa.\n\nThe Russian Empire, Ottoman Empire and Austrian Empire existed at the same time as the above empires, but did not expand over oceans. Rather, these empires expanded through the more traditional route of conquest of neighbouring territories. There was, though, some Russian colonization of the Americas across the Bering Strait. The Empire of Japan modelled itself on European colonial empires. The United States of America gained overseas territories after the Spanish–American War for which the term \"American Empire\" was coined.\n\nAfter the First World War, the victorious allies divided up the German colonial empire and much of the Ottoman Empire between themselves as League of Nations mandates. These territories were divided into three classes according to how quickly it was deemed that they would be ready for independence.\n\nAfter World War II decolonization progressed rapidly. This was caused by a number of reasons. First, the Japanese victories in the Pacific War showed Indians, Chinese, and other subject peoples that the colonial powers were not invincible. Second, many colonial powers were significantly weakened by World War II.\n\nDozens of independence movements and global political solidarity projects such as the Non-Aligned Movement were instrumental in the decolonization efforts of former colonies. These included significant wars of independence fought in Indonesia, Vietnam, Algeria, and Kenya. Eventually, the European powers—pressured by the United States and Soviets—resigned themselves to decolonization.\n\nIn 1962 the United Nations set up a Special Committee on Decolonization, often called the Committee of 24, to encourage this process.\n\nEuropean empires in 1914\n\nThe major European empires consisted of the following colonies at the start of World War I (former colonies of the Spanish Empire became independent before 1914 and are not listed; former colonies of other European empires that previously became independent, such as the former French colony Haiti, are not listed).\n\nThe world's colonial population at the time of the First World War totaled about 560 million people, of whom 70.0% were in British domains, 10.0% in French, 8.6% in Dutch, 3.9% in Japanese, 2.2% in German, 2.1% in American, 1.6% in Portuguese, 1.2%  in Belgian and 1/2 of 1% in Italian possessions.  The home domains of the colonial powers had a total population of about 370 million people.The Russian Empire, Austria-Hungry, Ottoman Empire, Spain and Denmark are not included.  U.S. Tariff Commission. Colonial tariff policies (1922),  p. 5 [https://archive.org/details/colonialtariffpo00unit  online]\n\nAsking whether colonies paid, economic historian Grover Clark argues and an emphatic No!  He reports that in every case the support cost, especially the military system necessary to support and defend the colonies outran the total trade they produced.  Apart from the British Empire, they were not favored destinations for the immigration of surplus populations.Raymond Leslie Buell,  \"Do Colonies Pay?\"   [http://www.unz.org/Pub/SaturdayRev-1936aug01-00006?View=PDF The Saturday Review, August 1, 1936 p 6 ]\n\nBritish colonies and protectorates\n\n* Aden\n* Anglo-Egyptian Sudan\n* Ascension Island\n* Bahamas\n* Barbados\n* Basutoland\n* Bechuanaland\n* British Borneo\n** Brunei\n** Labuan\n** North Borneo\n** Sarawak\n* British East Africa\n* British Guiana\n* British Honduras\n* British Hong Kong\n* British Leeward Islands\n** Anguilla\n** Antigua\n** Barbuda\n** British Virgin Islands\n** Dominica\n** Montserrat\n** Nevis\n** Saint Kitts\n* British Malaya\n** Federated Malay States\n** Straits Settlements\n** Unfederated Malay States\n* British Somaliland\n* British Western Pacific Territories\n** British Solomon Islands\n** Fiji\n** Gilbert and Ellice Islands\n** Phoenix Islands\n** Pitcairn Islands\n** New Hebrides (condominium with France)\n** Tonga\n** Union Islands\n* British Windward Islands\n** Barbados\n** Dominica\n** Grenada\n** Saint Lucia\n** Saint Vincent and the Grenadines\n* Burma\n* Canada\n* Ceylon\n* Christmas Island\n* Cocos (Keeling) Islands\n* Cyprus (including Akrotiri and Dhekelia)\n* Egypt\n* Falkland Islands\n* Falkland Islands Dependencies\n**Graham's Land\n**South Georgia \n**South Orkneys\n**South Shetlands\n**South Sandwich Islands\n**Victoria Land\n* Gambia\n* Gibraltar\n* Gold Coast\n* India (including what is today Pakistan and Bangladesh)\n* Heard Island and McDonald Islands\n* Ireland\n* Jamaica\n* Kenya\n* Maldives\n* Malta\n* Mauritius\n* Muscat and Oman\n* Norfolk Island\n* Nigeria\n* Northern Rhodesia\n* Nyasaland \n* Seychelles\n* Sierra Leone\n* Southern Rhodesia\n* St. Helena\n* Swaziland\n* Trinidad and Tobago\n* Trucial States\n* Uganda\n* Tonga\n\nFrench colonies\n\n* Algeria\n* Clipperton Island\n* Comoros Islands (including Mayotte)\n* Corsica\n* French Guiana\n* French Equatorial Africa\n** Chad\n** Oubangui-Chari\n** French Congo\n** Gabon\n* French India (Pondichéry, Chandernagor, Karikal, Mahé and Yanaon)\n* French Indochina\n** Annam\n**  Tonkin\n** Cochinchina\n**  Cambodia\n** Laos\n* French Polynesia\n* French Somaliland\n* French Southern and Antarctic Lands\n* French West Africa\n** Ivory Coast\n** Dahomey\n** Guinea\n** French Sudan\n** Mauritania\n** Niger\n** Senegal\n** Upper Volta\n* Guadeloupe\n** Saint Barthélemy\n** Saint Martin\n* La Réunion\n* Madagascar\n* Martinique\n* French Morocco\n* Lebanon\n* New Caledonia\n* Saint-Pierre-et-Miquelon\n* Shanghai French Concession (similar concessions in Kouang-Tchéou-Wan, Tientsin, Hankéou)\n* Tunisia\n* New Hebrides(Condominium with Britain)\n* Wallis-et-Futuna\n\nRussian colonies and protectorates\n\n* European Russia\n** Åland Islands\n** Baltic provinces\n*** Governorate of Courland\n*** Governorate of Livland\n*** Governorate of Estland \n** Bashkortostan\n** Bessarabia\n** Grand Principality of Finland\n** Chechnya\n** Chuvashia\n** Dagestan\n** Dnieper Ukraine\n** East Karelia\n** Ingushetia\n** Kabardino-Balkaria\n** Kalmykia\n** Karachay–Cherkessia\n** Komi\n** Lithuania Governorate\n** Mari El\n** Mordovia\n** Russian Poland\n** Tatarstan\n** Udmurtia\n* Asiatic Russia\n** Adygea\n** Altai\n** Armenia\n** Azerbaijan\n** Buryatia\n** Chukotka\n** Emirate of Bukhara\n** Georgia\n** Khakassia\n** Khanate of Khiva\n** Koryak\n** Ossetia\n** Outer Manchuria\n** Russian Turkestan\n*** Kazakhstan\n*** Kyrgyzstan\n*** Tajikistan\n*** Turkmenistan\n** Tannu Uriankhai\n** Yakutia\n** Yamalia\n\nGerman colonies\n\n* Bismarck Archipelago\n* Cameroon\n* Caroline Islands\n* German New Guinea\n* German Solomon Islands\n* German East Africa\n* German South-West Africa\n* Gilbert Islands\n* Mariana Islands\n* Marshall Islands\n* Togo\n\nItalian colonies and protectorates\n\n* Italian Libya\n* Italian Eritrea\n* Italian Somaliland\n* Italian Aegean Islands\n* Italian Concession of Tientsin\n* Pantelleria\n* Pelagie Islands\n\nDutch colonies\n\n* Dutch Ceylon\n* Aruba \n* Bonaire\n* Curaçao \n* Saba \n* Sint Eustatius\n* Sint Maarten \n* Suriname\n* Dutch East Indies\n* Dutch New Guinea\n\nPortuguese colonies\n\n* Azores\n* Portuguese Africa\n** Cabinda\n** Madeira\n** Portuguese Angola\n** Portuguese Cape Verde\n** Portuguese Guinea\n** Portuguese Mozambique\n** Portuguese São Tomé and Príncipe\n** Fort of São João Baptista de Ajudá\n*Portuguese Asia\n** Portuguese India\n*** Goa\n*** Daman\n*** Diu\n** Portuguese Macau\n** Portuguese Timor\n*Portuguese America\n** Colonial Brazil\n\nSpanish colonies\n\n* Balearic Islands\n* Canary Islands\n* Cape Juby\n* Ifni\n* Rio de Oro\n* Saguia el-Hamra\n* Spanish Guinea\n** Annobón\n** Fernando Pó\n** Rio Muni\n* Spanish Morocco\n\nAustro-Hungarian colonies\n\n \n* Bosnia and Herzegovina\n* Tianjin\n\nDanish colonies\n\n* Danish Gold Coast (now part of Ghana)\n* Danish India (Tharangambadi, Serampore and the Nicobar Islands)\n* Danish West Indies (now United States Virgin Islands)\n* Faroe islands\n* Greenland\n* Iceland\n\nBelgian colonies\n\n* Belgian Congo\n* Tianjin\n\nNumbers of European settlers in the colonies (1500–1914)\n\nBy 1914, Europeans had migrated to the colonies in the millions. Some intended to remain in the colonies as temporary settlers, mainly as military personnel or on business. Others went to the colonies as immigrants. British people were by far the most numerous population to migrate to the colonies: 2.5 million settled in Canada; 1.5 million in Australia; 750,000 in New Zealand; 450,000 in the Union of South Africa; and 200,000 in India. French citizens also migrated in large numbers, mainly to the colonies in the north African Maghreb region: 1.3 million settled in Algeria; 200,000 in Morocco; 100,000 in Tunisia; while only 20,000 migrated to French Indochina. Dutch and German colonies saw relatively scarce European migration, since Dutch and German colonial expansion focused on commercial goals rather than settlement. Portugal sent 150,000 settlers to Angola, 80,000 to Mozambique, and 20,000 to Goa. During the Spanish Empire, approximately 550,000 Spanish settlers migrated to Latin America.\n\nOther non-European colonialist countries in 1914\n\nAustralian protectorate\n\n* Papua\n\nNew Zealand dependencies\n\n* Cook Islands\n* Niue\n\nUnited States colonies and protectorates\n\n* Alaska\n* American Samoa\n* Cuba (Platt Amendment turned Cuba into a protectorate)\n* Guantánamo Bay\n* Guam\n* Hawaii\n* Midway\n* Nicaragua\n* Palmyra Atoll\n* Panama (Hay–Bunau-Varilla Treaty turned Panama into a protectorate)\n* Panama Canal Zone\n* Philippines\n* Puerto Rico\n* Sultanate of Sulu\n* Swan Islands, Honduras\n* Wake Island\n\nTurkish (Ottoman) colonies\n\n* Baghdad Vilayet\n* Basra\n* Edirne\n* Ha'il\n* Hejaz\n* Lebanon\n* Nejd\n* Palestine\n* Syria\n* Yemen\n\nJapanese colonies\n\n* Bonin Islands\n* Karafuto\n* Korea\n* Taiwán\n* Kuril Islands\n* Kwantung Leased Territory\n* Ryukyu Domain  \n** Senkaku Islands\n* Volcano Islands\n* Caroline Islands\n* Penghu Islands\n\nChinese colonies\n\n* Chinese Turkestan in Qing Dynasty\n\nNeocolonialism\n\nThe term neocolonialism has been used to refer to a variety of contexts since decolonization that took place after World War II. Generally it does not refer to a type of direct colonization, rather, colonialism by other means. Specifically, neocolonialism refers to the theory that former or existing economic relationships, such as the General Agreement on Tariffs and Trade and the Central American Free Trade Agreement, created by former colonial powers were or are used to maintain control of their former colonies and dependencies after the colonial independence movements of the post–World War II period.\n\nImpact of colonialism and colonization\n\nThe impacts of colonization are immense and pervasive.[http://www.time.com/time/world/article/0,8599,1713275,00.html Come Back, Colonialism, All is Forgiven] Various effects, both immediate and protracted, include the spread of virulent diseases, unequal social relations, exploitation, enslavement, medical advances, the creation of new institutions, abolitionism,Lovejoy, Paul E. (2012). Transformations of Slavery: A History of Slavery in Africa. London: Cambridge University Press. improved infrastructure,Ferguson, Niall (2003). Empire: How Britain Made the Modern World. London: Allen Lane. and technological progress.[Thong, Tezenlo. Civilized Colonizers and Barbaric Colonized: Reclaiming Naga Identity by Demythologizing Colonial Portraits, History and Anthropology 23, no. 3 (2012): 375-397] Colonial practices also spur the spread of colonist languages, literature and cultural institutions, while endangering or obliterating those of native peoples. The native cultures of the colonized peoples can also have a powerful influence on the imperial country.\n\nEconomy, trade and commerce\n\nEconomic expansion has accompanied imperial expansion since ancient times. Greek trade networks spread throughout the Mediterranean region while Roman trade expanded with the primary goal of directing tribute from the colonized areas towards the Roman metropole. According to Strabo, by the time of emperor Augustus, up to 120 Roman ships would set sail every year from Myos Hormos in Roman Egypt to India.\"[http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Strabo/2E1*.html Strabo's Geography Book II Chapter 5 ]\" With the development of trade routes under the Ottoman Empire,\n\nAztec civilization developed into an extensive empire that, much like the Roman Empire, had the goal of exacting tribute from the conquered colonial areas. For the Aztecs, a significant tribute was the acquisition of sacrificial victims for their religious rituals.\n\nOn the other hand, European colonial empires sometimes attempted to channel, restrict and impede trade involving their colonies, funneling activity through the metropole and taxing accordingly.\n\nDespite the general trend of economic expansion, the economic performance of former European colonies varies significantly. In \"Institutions as a Fundamental Cause of Long-run Growth,\" economists Daron Acemoglu, Simon Johnson and James A. Robinson compare the economic influences of the European colonists on different colonies and study what could explain the huge discrepancies in previous European colonies, for example, between West African colonies like Sierra Leone and Hong Kong and Singapore.\n\nAccording to the paper, economic institutions are the determinant of the colonial success because they determine their financial performance and order for the distribution of resources. At the same time, these institutions are also consequences of political institutions - especially how de facto and de jure political power is allocated. To explain the different colonial cases, we thus need to look first into the political institutions that shaped the economic institutions.\n\nFor example, one interesting observation is \"the Reversal of Fortune\" - the less developed civilizations in 1500, like North America, Australia, and New Zealand, are now much richer than those countries who used to be in the prosperous civilizations in 1500 before the colonists came, like the Mughals in India and the Incas in the Americas. One explanation offered by the paper focuses on the political institutions of the various colonies: it was less likely for European colonists to introduce economic institutions where they could benefit quickly from the extraction of resources in the area. Therefore, given a more developed civilization and denser population, European colonists would rather keep the existing economic systems than introduce an entirely new system; while in places with little to extract, European colonists would rather establish new economic institutions to protect their interests. Political institutions thus gave rise to different types of economic systems, which determined the colonial economic performance.\n\nEuropean colonization and development also changed gendered systems of power already in place around the world. In many pre-colonialist areas, women maintained power, prestige, or authority through reproductive or agricultural control. For example, in certain parts of sub-Saharan Africa women maintained farmland in which they had usage rights. While men would make political and communal decisions for a community, the women would control the village’s food supply or their individual family’s land. This allowed women to achieve power and autonomy, even in patrilineal and patriarchal societies.\n\nThrough the rise of European colonialism came a large push for development and industrialization of most economic systems. However, when working to improve productivity, Europeans focused mostly on male workers. Foreign aid arrived in the form of loans, land, credit, and tools to speed up development, but were only allocated to men. In a more European fashion, women were expected to serve on a more domestic level. The result was a technologic, economic, and class-based gender gap that widened over time.\n\nSlavery and indentured servitude\n\nEuropean nations entered their imperial projects with the goal of enriching the European metropole. Exploitation of non-Europeans and other Europeans to support imperial goals was acceptable to the colonizers. Two outgrowths of this imperial agenda were slavery and indentured servitude. In the 17th century, nearly two-thirds of English settlers came to North America as indentured servants.\"[http://www.montgomerycollege.edu/Departments/hpolscrv/whiteser.html White Servitude]\", by Richard Hofstadter, Montgomery College\n\nEuropean slave traders brought large numbers of African slaves to the Americas by sail. Spain and Portugal had brought African slaves to work at African colonies such as Cape Verde and the Azores, and then Latin America, by the 16th century. The British, French and Dutch joined in the slave trade in subsequent centuries. Ultimately, around 11 million Africans were taken to the Caribbean and North and South America as slaves by European colonizers.\n\nAbolitionists in Europe and Americas protested the inhumane treatment of African slaves, which led to the elimination of the slave trade by the late 18th century. The labour shortage that resulted inspired European colonizers to develop a new source of labour, using a system of indentured servitude. Indentured servants consented to a contract with the European colonizers. Under their contract, the servant would work for an employer for a term of at least a year, while the employer agreed to pay for the servant's voyage to the colony, possibly pay for the return to the country of origin, and pay the employee a wage as well. The employee was \"indentured\" to the employer because they owed a debt back to the employer for their travel expense to the colony, which they were expected to pay through their wages. In practice, indentured servants were exploited through terrible working conditions and burdensome debts created by the employers, with whom the servants had no means of negotiating the debt once they arrived in the colony.\n\nIndia and China were the largest source of indentured servants during the colonial era. Indentured servants from India travelled to British colonies in Asia, Africa and the Caribbean, and also to French and Portuguese colonies, while Chinese servants travelled to British and Dutch colonies. Between 1830 and 1930, around 30 million indentured servants migrated from India, and 24 million returned to India. China sent more indentured servants to European colonies, and around the same proportion returned to China.\n\nFollowing the Scramble for Africa, an early but secondary focus for most colonial regimes was the suppression of slavery and the slave trade. By the end of the colonial period they were mostly successful in this aim, though slavery is still very active in Africa and the world at large with much the same practices of de facto servility despite legislative prohibition.\n\nMilitary innovation\n\nImperial expansion follows military conquest in most instances. Imperial armies therefore have a long history of military innovation in order to gain an advantage over the armies of the people they aim to conquer. Greeks developed the phalanx system, which enabled their military units to present themselves to their enemies as a wall, with foot soldiers using shields to cover one another during their advance on the battlefield. Under Philip II of Macedon, they were able to organize thousands of soldiers into a formidable battle force, bringing together carefully trained infantry and cavalry regiments. Alexander the Great exploited this military foundation further during his conquests.\n\nThe Spanish Empire held a major advantage over Mesoamerican warriors through the use of weapons made of stronger metal, predominantly iron, which was able to shatter the blades of axes used by the Aztec civilization and others. The European development of firearms using gunpowder cemented their military advantage over the peoples they sought to subjugate in the Americas and elsewhere.\n\nThe end of empire\n\nThe populations of some colonial territories, such as Canada, enjoyed relative peace and prosperity as part of a European power, at least among the majority; however, minority populations such as First Nations peoples and French-Canadians experienced marginalization and resented colonial practises. Francophone residents of Quebec, for example, were vocal in opposing conscription into the armed services to fight on behalf of Britain during World War I, resulting in the Conscription crisis of 1917. Other European colonies had much more pronounced conflict between European settlers and the local population. Rebellions broke out in the later decades of the imperial era, such as India's Sepoy Rebellion.\n\nThe territorial boundaries imposed by European colonizers, notably in central Africa and South Asia, defied the existing boundaries of native populations that had previously interacted little with one another. European colonizers disregarded native political and cultural animosities, imposing peace upon people under their military control. Native populations were often relocated at the will of the colonial administrators. Once independence from European control was achieved, civil war erupted in some former colonies, as native populations fought to capture territory for their own ethnic, cultural or political group. The Partition of India, a 1947 civil war that came in the aftermath of India's independence from Britain, became a conflict with 500,000 killed. Fighting erupted between Hindu, Sikh and Muslim communities as they fought for territorial dominance. Muslims fought for an independent country to be partitioned where they would not be a religious minority, resulting in the creation of Pakistan.\n\nPost-independence population movement\n\nIn a reversal of the migration patterns experienced during the modern colonial era, post-independence era migration followed a route back towards the imperial country. In some cases, this was a movement of settlers of European origin returning to the land of their birth, or to an ancestral birthplace. 900,000 French colonists (known as the Pied-Noirs) resettled in France following Algeria's independence in 1962. A significant number of these migrants were also of Algerian descent. 800,000 people of Portuguese origin migrated to Portugal after the independence of former colonies in Africa between 1974 and 1979; 300,000 settlers of Dutch origin migrated to the Netherlands from the Dutch West Indies after Dutch military control of the colony ended.\n\nAfter WWII 300,000 Dutchmen from the Dutch East Indies, of which the majority were people of Eurasian descent called Indo Europeans, repatriated to the Netherlands. A significant number later migrated to the US, Canada, Australia and New Zealand.Willems, Wim \"De uittocht uit Indie (1945–1995), De geschiedenis van Indische Nederlanders\" (Publisher: Bert Bakker, Amsterdam, 2001). Crul, Lindo and Lin Pang. Culture, Structure and Beyond, Changing identities and social positions of immigrants and their children (Het Spinhuis Publishers, 1999). \n\nGlobal travel and migration in general developed at an increasingly brisk pace throughout the era of European colonial expansion. Citizens of the former colonies of European countries may have a privileged status in some respects with regard to immigration rights when settling in the former European imperial nation. For example, rights to dual citizenship may be generous, or larger immigrant quotas may be extended to former colonies.\n\nIn some cases, the former European imperial nations continue to foster close political and economic ties with former colonies. The Commonwealth of Nations is an organization that promotes cooperation between and among Britain and its former colonies, the Commonwealth members. A similar organization exists for former colonies of France, the Francophonie; the Community of Portuguese Language Countries plays a similar role for former Portuguese colonies, and the Dutch Language Union is the equivalent for former colonies of the Netherlands.\n\nMigration from former colonies has proven to be problematic for European countries, where the majority population may express hostility to ethnic minorities who have immigrated from former colonies. Cultural and religious conflict have often erupted in France in recent decades, between immigrants from the Maghreb countries of north Africa and the majority population of France. Nonetheless, immigration has changed the ethnic composition of France; by the 1980s, 25% of the total population of \"inner Paris\" and 14% of the metropolitan region were of foreign origin, mainly Algerian.\n\nIntroduced diseases\n\nEncounters between explorers and populations in the rest of the world often introduced new diseases, which sometimes caused local epidemics of extraordinary virulence.Kenneth F. Kiple, ed. The Cambridge Historical Dictionary of Disease (2003). For example, smallpox, measles, malaria, yellow fever, and others were unknown in pre-Columbian America.Alfred W. Crosby, Jr., The Columbian Exchange: Biological and Cultural Consequences of 1492 (1974)\n\nDisease killed the entire native (Guanches) population of the Canary Islands in the 16th century. Half the native population of Hispaniola in 1518 was killed by smallpox. Smallpox also ravaged Mexico in the 1520s, killing 150,000 in Tenochtitlan alone, including the emperor, and Peru in the 1530s, aiding the European conquerors. Measles killed a further two million Mexican natives in the 17th century. In 1618–1619, smallpox wiped out 90% of the Massachusetts Bay Native Americans.[http://www.ucpress.edu/books/pages/9968/9968.ch01.html Smallpox - The Fight to Eradicate a Global Scourge], David A. Koplow. Smallpox epidemics in 1780–1782 and 1837–1838 brought devastation and drastic depopulation among the Plains Indians.[http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=2094753 \"The first smallpox epidemic on the Canadian Plains: In the fur-traders' words\"], National Institutes of Health. Some believe that the death of up to 95% of the Native American population of the New World was caused by Old World diseases.[https://www.pbs.org/gunsgermssteel/variables/smallpox.html The Story Of ... Smallpox – and other Deadly Eurasian Germs.] Over the centuries, the Europeans had developed high degrees of immunity to these diseases, while the indigenous peoples had no time to build such immunity.[http://www.millersville.edu/~columbus/papers/goodling.html Stacy Goodling, \"Effects of European Diseases on the Inhabitants of the New World\"] \n\nSmallpox decimated the native population of Australia, killing around 50% of indigenous Australians in the early years of British colonisation. It also killed many New Zealand Māori.[http://www.canr.msu.edu/overseas/nzenvironsci/infopart2.htm New Zealand Historical Perspective]  As late as 1848–49, as many as 40,000 out of 150,000 Hawaiians are estimated to have died of measles, whooping cough and influenza. Introduced diseases, notably smallpox, nearly wiped out the native population of Easter Island.[https://www.independent.co.uk/news/science/how-did-easter-islands-ancient-statues-lead-to-the-destruction-of-an-entire-ecosystem-455877.html How did Easter Island's ancient statues lead to the destruction of an entire ecosystem?], The Independent. In 1875, measles killed over 40,000 Fijians, approximately one-third of the population.[http://www.fsm.ac.fj/aboutfsm.html Fiji School of Medicine]  The Ainu population decreased drastically in the 19th century, due in large part\nto infectious diseases brought by Japanese settlers pouring into Hokkaido.[http://www.time.com/time/asia/features/ontheroad/japan.sapporo.ainu.html Meeting the First Inhabitants] , TIMEasia.com, 21 August 2000.\n\nConversely, researchers have hypothesized that a precursor to syphilis may have been carried from the New World to Europe after Columbus's voyages. The findings suggested Europeans could have carried the nonvenereal tropical bacteria home, where the organisms may have mutated into a more deadly form in the different conditions of Europe.[https://www.nytimes.com/2008/01/15/science/15syph.html?_r1 Genetic Study Bolsters Columbus Link to Syphilis], New York Times, January 15, 2008. The disease was more frequently fatal than it is today; syphilis was a major killer in Europe during the Renaissance.[http://www.livescience.com/history/080114-syphilis-columbus.html Columbus May Have Brought Syphilis to Europe], LiveScience The first cholera pandemic began in Bengal, then spread across India by 1820. Ten thousand British troops and countless Indians died during this pandemic.[http://www.cbc.ca/health/story/2008/05/09/f-cholera-outbreaks.html Cholera's seven pandemics]. CBC News. December 2, 2008. Between 1736 and 1834 only some 10% of East India Company's officers survived to take the final voyage home.[http://www.asianreviewofbooks.com/arb/article.php?article\n610 Sahib: The British Soldier in India, 1750–1914 by Richard Holmes.] Waldemar Haffkine, who mainly worked in India, who developed and used vaccines against cholera and bubonic plague in the 1890s, is considered the first microbiologist.\n\nCountering disease\n\nAs early as 1803, the Spanish Crown organised a mission (the Balmis expedition) to transport the smallpox vaccine to the Spanish colonies, and establish mass vaccination programs there.[http://www.doh.gov.ph/sphh/balmis.htm Dr. Francisco de Balmis and his Mission of Mercy, Society of Philippine Health History.]  By 1832, the federal government of the United States established a smallpox vaccination program for Native Americans.[http://muse.jhu.edu/login?uri/journals/wicazo_sa_review/v018/18.2pearson01.html Lewis Cass and the Politics of Disease: The Indian Vaccination Act of 1832.] Under the direction of Mountstuart Elphinstone a program was launched to propagate smallpox vaccination in India.[http://www.smallpoxhistory.ucl.ac.uk/Other%20Asia/ongoingwork.htm Smallpox History - Other histories of smallpox in South Asia.]  From the beginning of the 20th century onwards, the elimination or control of disease in tropical countries became a driving force for all colonial powers.[http://www.gresham.ac.uk/event.asp?PageId\n45&EventId=696 Conquest and Disease or Colonialism and Health?] , Gresham College | Lectures and Events. The sleeping sickness epidemic in Africa was arrested due to mobile teams systematically screening millions of people at risk. In the 20th century, the world saw the biggest increase in its population in human history due to lessening of the mortality rate in many countries due to medical advances.[https://www.jstor.org/pss/182701 The Origins of African Population Growth, by John Iliffe], The Journal of African History, Vol. 30, No. 1 (1989), pp. 165–169. The world population has grown from 1.6 billion in 1900 to over seven billion today.\n\nColonialism and the history of thought\n\nUniversalism\n\nThe conquest of vast territories brings multitudes of diverse cultures under the central control of the imperial authorities. From the time of Ancient Greece and Ancient Rome, this fact has been addressed by empires adopting the concept of universalism, and applying it to their imperial policies towards their subjects far from the imperial capitol. The capitol, the metropole, was the source of ostensibly enlightened policies imposed throughout the distant colonies.\n\nThe empire that grew from Greek conquest, particularly by Alexander the Great, spurred the spread of Greek language, religion, science and philosophy throughout the colonies. While most Greeks considered their own culture superior to all others (the word barbarian is derived from mutterings that sounded to Greek ears like \"bar-bar\"), Alexander was unique in promoting a campaign to win the hearts and minds of the Persians. He [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Plutarch/Lives/Alexander*/6-7.html adopted Persian customs of clothing] and otherwise encouraged his men to go native by adopting local wives and learning their mannerisms. Of note is that he radically departed from earlier Greek attempts at colonization, characterized by the murder and enslavement of the local inhabitants and the settling of Greek citizens from the polis.\n\nRoman universalism was characterized by cultural and religious tolerance and a focus on civil efficiency and the rule of law.  Roman law was imposed on both Roman citizens and colonial subjects. Although Imperial Rome had no public education, Latin spread through its use in government and trade. Roman law prohibited local leaders to wage war between themselves, which was responsible for the 200 year long Pax Romana, at the time the longest period of peace in history. The Roman Empire was tolerant of diverse cultures and religious practises, even allowing them on a few occasions to threaten Roman authority.\n\nColonialism and geography\n\nSettlers acted as the link between indigenous populations and the imperial hegemony, thus bridging the geographical, ideological and commercial gap between the colonizers and colonized. While the extent in which geography as an academic study is implicated in colonialism is contentious, geographical tools such as cartography, shipbuilding, navigation, mining and agricultural productivity were instrumental in European colonial expansion. Colonizer's awareness of the Earth's surface and abundance of practical skills provided colonizers with a knowledge that, in turn, created power.\"Painter, J. & Jeffrey, A., 2009. Political Geography, 2nd ed., Sage. \"Imperialism\" p. 23 (GIC).\n\nAnne Godlewska and Neil Smith argue that \"empire was 'quintessentially a geographical project.'\" Historical geographical theories such as environmental determinism legitimized colonialism by positing the view that some parts of the world were underdeveloped, which created notions of skewed evolution. Geographers such as Ellen Churchill Semple and Ellsworth Huntington put forward the notion that northern climates bred vigour and intelligence as opposed to those indigenous to tropical climates (See The Tropics) viz a viz a combination of environmental determinism and Social Darwinism in their approach.\n\nPolitical geographers also maintain that colonial behavior was reinforced by the physical mapping of the world, therefore creating a visual separation between \"them\" and \"us\".  Geographers are primarily focused on the spaces of colonialism and imperialism; more specifically, the material and symbolic appropriation of space enabling colonialism.\n\nMaps played an extensive role in colonialism, as Bassett would put it \"by providing geographical information in a convenient and standardized format, cartographers helped open West Africa to European conquest, commerce, and colonization\". However, because the relationship between colonialism and geography was not scientifically objective, cartography was often manipulated during the colonial era. Social norms and values had an effect on the constructing of maps. During colonialism map-makers used rhetoric in their formation of boundaries and in their art. The rhetoric favored the view of the conquering Europeans; this is evident in the fact that any map created by a non-European was instantly regarded as inaccurate. Furthermore, European cartographers were required to follow a set of rules which led to ethnocentrism; portraying one's own ethnicity in the center of the map. As Harley would put it \"The steps in making a map - selection, omission, simplification, classification, the creation of hierarchies, and 'symbolization' - are all inherently rhetorical.\"\n\nA common practice by the European cartographers of the time was to map unexplored areas as \"blank spaces\". This influenced the colonial powers as it sparked competition amongst them to explore and colonize these regions. Imperialists aggressively and passionately looked forward to filling these spaces for the glory of their respective countries. The Dictionary of Human Geography notes that cartography was used to empty 'undiscovered' lands of their Indigenous meaning and bring them into spatial existence via the imposition of \"Western place-names and borders, [therefore] priming ‘virgin’ (putatively empty land, ‘wilderness’) for colonization (thus sexualizing colonial landscapes as domains of male penetration), reconfiguring alien space as absolute, quantifiable and separable (as property).\"\n\nDavid Livingstone stresses \"that geography has meant different things at different times and in different places\" and that we should keep an open mind in regards to the relationship between geography and colonialism instead of identifying boundaries. Geography as a discipline was not and is not an objective science, Painter and Jeffrey argue, rather it is based on assumptions about the physical world.\n\nColonialism and imperialism\n\nA colony is a part of an empire and so colonialism is closely related to imperialism. Assumptions are that colonialism and imperialism are interchangeable, however Robert J. C. Young suggests that imperialism is the concept while colonialism is the practice. Colonialism is based on an imperial outlook, thereby creating a consequential relationship. Through an empire, colonialism is established and capitalism is expanded, on the other hand a capitalist economy naturally enforces an empire. In the next section Marxists make a case for this mutually reinforcing relationship.\n\nMarxist view of colonialism\n\nMarxism views colonialism as a form of capitalism, enforcing exploitation and social change. Marx thought that working within the global capitalist system, colonialism is closely associated with uneven development. It is an \"instrument of wholesale destruction, dependency and systematic exploitation producing distorted economies, socio-psychological disorientation, massive poverty and neocolonial dependency.\"Dictionary of Human Geography, \"Colonialism\" Colonies are constructed into modes of production. The search for raw materials and the current search for new investment opportunities is a result of inter-capitalist rivalry for capital accumulation. Lenin regarded colonialism as the root cause of imperialism, as imperialism was distinguished by monopoly capitalism via colonialism and as Lyal S. Sunga explains: \"Vladimir Lenin advocated forcefully the principle of self-determination of peoples in his \"Theses on the Socialist Revolution and the Right of Nations to Self-Determination\" as an integral plank in the programme of socialist internationalism\" and he quotes Lenin who contended that \"The right of nations to self-determination implies exclusively the right to independence in the political sense, the right to free political separation from the oppressor nation.  Specifically, this demand for political democracy implies complete freedom to agitate for secession and for a referendum on secession by the seceding nation.\"In the Emerging System of International Criminal Law: Developments and Codification, Brill Publishers (1997) at page 90, Sunga traces the origin of the international movement against colonialism, and relates it to the rise of the right to self-determination in international law. Non Russian marxists within the RSFSR and later the USSR, like Sultan Galiev and Vasyl Shakhrai,  meanwhile, between 1918 and 1923 and then after 1929, considered the Soviet Regime a renewed version of the Russian imperialism and colonialism.\n\nIn his critique of colonialism in Africa, the Guyanese historian and political activist Walter Rodney states:\n\"The decisiveness of the short period of colonialism and its negative consequences for Africa spring mainly from the fact that Africa lost power. Power is the ultimate determinant in human society, being basic to the relations within any group and between groups. It implies the ability to defend one's interests and if necessary to impose one's will by any means available.... When one society finds itself forced to relinquish power entirely to another society that in itself is a form of underdevelopment ... During the centuries of pre-colonial trade, some control over social political and economic life was retained in Africa, in spite of the disadvantageous commerce with Europeans. That little control over internal matters disappeared under colonialism. Colonialism went much further than trade. It meant a tendency towards direct appropriation by Europeans of the social institutions within Africa. Africans ceased to set indigenous cultural goals and standards, and lost full command of training young members of the society. Those were undoubtedly major steps backwards ... Colonialism was not merely a system of exploitation, but one whose essential purpose was to repatriate the profits to the so-called 'mother country'. From an African view-point, that amounted to consistent expatriation of surplus produced by African labour out of African resources. It meant the development of Europe as part of the same dialectical process in which Africa was underdeveloped.\"\n\n\"Colonial Africa fell within that part of the international capitalist economy from which surplus was drawn to feed the metropolitan sector. As seen earlier, exploitation of land and labour is essential for human social advance, but only on the assumption that the product is made available within the area where the exploitation takes place.\"\n\nAccording to Lenin, the new imperialism emphasized the transition of capitalism from free trade to a stage of monopoly capitalism to finance capital. He states it is, \"connected with the intensification of the struggle for the partition of the world\".  As free trade thrives on exports of commodities, monopoly capitalism thrived on the export of capital amassed by profits from banks and industry. This, to Lenin, was the highest stage of capitalism. He goes on to state that this form of capitalism was doomed for war between the capitalists and the exploited nations with the former inevitably losing. War is stated to be the consequence of imperialism. As a continuation of this thought G.N. Uzoigwe states, \"But it is now clear from more serious investigations of African history in this period that imperialism was essentially economic in its fundamental impulses.\"\nBoahen, A. Adu. Africa under Colonial Domination 1880-1935. London: Heinemann, 1985. 11. Print.\n\nLiberalism, capitalism and colonialism\n\nClassical liberals were generally in abstract opposition to colonialism (as opposed to colonization) and imperialism, including Adam Smith, Frédéric Bastiat, Richard Cobden, John Bright, Henry Richard, Herbert Spencer, H. R. Fox Bourne, Edward Morel, Josephine Butler, W. J. Fox and William Ewart Gladstone.[http://www.setav.org/ups/dosya/24514.pdf Liberal Anti-Imperialism] , professor Daniel Klein, 1.7.2004 Their philosophies found the colonial enterprise, particularly mercantilism, in opposition to the principles of free trade and liberal policies. Adam Smith wrote in Wealth of Nations that Britain should grant independence to all of its colonies and also argued that it would be economically beneficial for British people in the average, although the merchants having mercantilist privileges would lose out.\n\nScientific thought in colonialism, race and gender\n\nDuring the colonial era, the global process of colonization served to spread and synthesize the social and political belief systems of the \"mother-countries\" which often included a belief in a certain natural racial superiority of the race of the mother-country.  Colonialism also acted to reinforce these same racial belief systems within the \"mother-countries\" themselves. Usually also included within the colonial belief systems was a certain belief in the inherent superiority of male over female, however this particular belief was often pre-existing amongst the pre-colonial societies, prior to their colonization.\n\nPopular political practices of the time reinforced colonial rule by legitimizing European (and/ or Japanese) male authority, and also legitimizing female and non-mother-country race inferiority through studies of Craniology, Comparative Anatomy, and Phrenology. Biologists, naturalists, anthropologists, and ethnologists of the 19th century were focused on the study of colonized indigenous women, as in the case of Georges Cuvier's study of Sarah Baartman. Such cases embraced a natural superiority and inferiority relationship between the races based on the observations of naturalists' from the mother-countries.  European studies along these lines gave rise to the perception that African women's anatomy, and especially genitalia, resembled those of mandrills, baboons, and monkeys, thus differentiating colonized Africans from what were viewed as the features of the evolutionarily superior, and thus rightfully authoritarian, European woman.\n\nIn addition to what would now be viewed as pseudo-scientific studies of race, which tended to reinforce a belief in an inherent mother-country racial superiority, a new supposedly \"science-based\" ideology concerning gender roles also then emerged as an adjunct to the general body of beliefs of inherent superiority of the colonial era. Female inferiority across all cultures was emerging as an idea supposedly supported by craniology that led scientists to argue that the typical brain size of the female human was, on the average, slightly smaller than that of the male, thus inferring that therefore female humans must be less developed and less evolutionarily advanced than males.  This finding of relative cranial size difference was later simply attributed to the general typical size difference of the human male body versus that of the typical human female body.[https://www.theguardian.com/science/brain-flapping/2013/dec/04/male-female-brains-real-differences Male and female brains: the REAL differences] 10 February 2016, by Dean Burnett, The Guardian\n\nWithin the former European colonies, non-Europeans and women sometimes faced invasive studies by the colonial powers in the interest of the then prevailing pro-colonial scientific ideology of the day. Such seemingly flawed studies of race and gender coincided with the era of colonialism and the initial introduction of foreign cultures, appearances, and gender roles into the now gradually widening world-views of the scholars of the mother-countries.\n\nPost-colonialism\n\nPost-colonialism (or post-colonial theory) can refer to a set of theories in philosophy and literature that grapple with the legacy of colonial rule. In this sense, postcolonial literature may be considered a branch of postmodern literature concerned with the political and cultural independence of peoples formerly subjugated in colonial empires. Many practitioners take Edward Saïd's book Orientalism (1978) as the theory's founding work (although French theorists such as Aimé Césaire and Frantz Fanon made similar claims decades before Said).\n\nSaïd analyzed the works of Balzac, Baudelaire and Lautréamont arguing that they helped to shape a societal fantasy of European racial superiority. Writers of post-colonial fiction interact with the traditional colonial discourse, but modify or subvert it; for instance by retelling a familiar story from the perspective of an oppressed minor character in the story. Gayatri Chakravorty Spivak's Can the Subaltern Speak? (1998) gave its name to Subaltern Studies.\n\nIn A Critique of Postcolonial Reason (1999), Spivak argued that major works of European metaphysics (such as those of Kant and Hegel) not only tend to exclude the subaltern from their discussions, but actively prevent non-Europeans from occupying positions as fully human subjects. Hegel's Phenomenology of Spirit (1807), famous for its explicit ethnocentrism, considers Western civilization as the most accomplished of all, while Kant also had some traces of racialism in his work.\n\nColonial migrations\n\nNations and regions outside Europe with significant populations of European ancestry[https://www.cia.gov/library/publications/the-world-factbook/fields/2075.html Ethnic groups by country.] Statistics (where available) from CIA Factbook.\n\n*Africa (see Europeans in Africa)\n** South Africa (European South African): 9.6% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/sf.html#People South Africa: People: Ethnic Groups.] World Factbook of CIA\n** Namibia (European Namibians): 6% of the population, of which most are Afrikaans-speaking, in addition to a German-speaking minority.[https://www.cia.gov/library/publications/the-world-factbook/geos/wa.html#People Namibia: People: Ethnic Groups.] World Factbook of CIA\n\n** Réunion estimated to be approx. 25% of the population\n** Zimbabwe (Europeans in Zimbabwe)\n** Algeria (Pied-noir)\"[http://news.bbc.co.uk/2/hi/programmes/from_our_own_correspondent/5224244.stm Former settlers return to Algeria]\". BBC News. July 29, 2006.\n** Botswana[https://www.cia.gov/library/publications/the-world-factbook/geos/bc.html#People Botswana: People: Ethnic Groups.] World Factbook of CIA\n** Kenya (Europeans in Kenya)\n** Mauritius (Franco-Mauritian)\n** (European Moroccans)De Azevedo, Raimondo Cagiano (1994) [https://books.google.com/books?idN8VHizsqaH0C&pg\nPA25 Migration and development co-operation.]. Council of Europe. p. 25. .\n** Ivory Coast (French people)\"[http://countrystudies.us/ivory-coast/41.htm Ivory Coast - The Economy]\". Library of Congress Country Studies.\n** Senegal[https://www.state.gov/r/pa/ei/bgn/2862.htm Senegal], About 50,000 Europeans (mostly French) and Lebanese reside in Senegal, mainly in the cities.\n** Canary Islands (Spaniards), known as Canarians.\n** Seychelles (Franco-Seychellois)\n** Somalia (Italian Somalis)\n** Eritrea (Italian Eritreans)\n** Saint Helena (UK) including  Tristan da Cunha (UK): predominantly European.\n** Swaziland: 3% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/wz.html#People Swaziland: People: Ethnic Groups.] World Factbook of CIA\n** (European Tunisians)[http://www.encyclopedia.com/doc/1G2-2586700129.html Tunisia], Worldmark Encyclopedia of the Nations. Thomson Gale. 2007. Encyclopedia.com.\n\n*Asia\n** Siberia (Russians, Germans and Ukrainians)Fiona Hill, [http://www.theglobalist.com/printStoryId.aspx?StoryId=3727 Russia — Coming In From the Cold?] , The Globalist, 23 February 2004\"[http://www.everyculture.com/Russia-Eurasia-China/Siberian-Germans-Orientation.html Siberian Germans]\".\n** Kazakhstan (Russians in Kazakhstan, Germans of Kazakhstan): 30% of the population\"[https://books.google.com/books?idYLeAxHLmgR8C&pg\nPA15&dq&hlen#v\nonepage&q&f\nfalse Migrant resettlement in the Russian federation: reconstructing 'homes' and 'homelands']\". Moya Flynn. (1994). p.15.\n\n** Uzbekistan (Russians and other Slavs): 5.5% of the populationRobert Greenall, [http://news.bbc.co.uk/2/hi/asia-pacific/4420922.stm \"Russians left behind in Central Asia\"], BBC News, 23 November 2005.\n** Kyrgyzstan (Russians and other Slavs): 13.5% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/kg.html#People Kyrgyzstan: People: Ethnic Groups.] World Factbook of CIA\"[https://books.google.com/books?id\nXRXVbGwPgqIC&pgPA125&dq&hl\nen#vonepage&q\n&f=false The Kyrgyz – Children of Manas.]\". Petr Kokaisl, Pavla Kokaislova (2009). p. 125. .\n** Turkmenistan (Russians and other Slavs): 4% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/tx.html#People Turkmenistan: People: Ethnic Groups.] World Factbook of CIA\n** Tajikistan (Russians and other Slavs)[http://countrystudies.us/tajikistan/23.htm Tajikistan - Ethnic Groups]. Source: U.S. Library of Congress.\n** Hong KongHK Census. \"\n[http://www.censtatd.gov.hk/hong_kong_statistics/statistical_tables/index.jsp?htmlTableID139&excelID\n&chartID&tableID\n139&ID&subjectID\n1 HK Census].\" Statistical Table. Retrieved on 2007-03-08.\n** Philippines (Spanish Ancestry) 3% of the population\n** People's Republic of China (Russians in China)\n** Indian subcontinent (Anglo-Indians)\n*Latin America (see White Latin American) \n** Argentina (European Immigration to Argentina): 97% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/ar.html#People Argentina: People: Ethnic Groups.] World Factbook of CIA\n** Bolivia: 15% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/bl.html#People Bolivia: People: Ethnic Groups.] World Factbook of CIA\n** Brazil (White Brazilian): 47.3% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/br.html#People Brazil: People: Ethnic Groups.] World Factbook of CIA\n** Chile (White Chilean): 60%-70% of the population.[http://www.infoamerica.org/primera/lb_2011.pdf Informe Latinobarómetro 2011], Latinobarómetro (p. 58).[http://ukpmc.ac.uk/articles/PMC1050080 Genetic epidemiology of single gene defects in Chile.]\n** Colombia (White Colombian): 20% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/co.html#People Colombia: People: Ethnic Groups.] World Factbook of CIA\n** Costa Rica = 3.9 million whites and mestizos\n** Cuba (White Cuban): 65% of the population\n** Dominican Republic: 16% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/dr.html#People Dominican Republic: People: Ethnic groups.] World Factbook of CIA\n** Ecuador: 7% of the population\n** El Salvador: 12% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/es.html#People El Salvador: People: Ethnic Groups.] World Factbook of CIA\n** Mexico (White Mexican): 9% or ~17% of the population. and 70-80% more as Mestizos.\n[https://www.cia.gov/library/publications/the-world-factbook/geos/mx.html#People Mexico: People: Ethnic Groups.] World Factbook of CIA[http://www.britannica.com/EBchecked/topic/379167/Mexico Mexico - Britannica Online Encyclopedia]\n** Nicaragua: 17% of the population\n** Panama 10% of the population\n** Puerto Rico approx. 80% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/pm.html#People Puerto Rico: People: Ethnic Groups] World Factbook of CIA\n** Peru (European Peruvian): 15% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/pe.html#People Peru: People: Ethnic Groups.] World Factbook of CIA\n** Paraguay approx. 20% of the population[http://convergencia.uaemex.mx/rev38/38pdf/LIZCANO.pdf 8 LIZCANO] \n** Venezuela (White Venezuelan): 42.2% of the population[http://www.ine.gov.ve/CENSO2011/documentos/pdf/ResultadosBasicosCenso2011.pdf Resultado Basico del XIV Censo Nacional de Población y Vivienda 2011] (p. 14).\n** Uruguay: 88% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/uy.html#People Uruguay: People: Ethnic Groups.] World Factbook of CIA\n*Rest of the Americas\n** Bahamas: 12% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/bf.html#People Bahamas: People: Ethnic Groups.] World Factbook of CIA\n** Barbados (White Barbadian): 4% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/bb.html#People Barbados: People: Ethnic Groups.] World Factbook of CIA\n** Bermuda: 34.1% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/bd.html#People Bermuda: People: Ethnic Groups.] World Factbook of CIA\n** Canada: 80% of the population[http://www12.statcan.ca/census-recensement/2006/dp-pd/tbt/Rp-eng.cfm?LANGE&APATH\n3&DETAIL0&DIM\n0&FLA&FREE\n0&GC0&GID\n837928&GK0&GRP\n1&PID92334&PRID\n0&PTYPE88971,97154&S\n0&SHOWALL0&SUB\n0&Temporal2006&THEME\n80&VID0&VNAMEE\n&VNAMEF= Canadian Census 2006]\n** Falkland Islands, mostly of British descent.\n** French Guiana: 12% of the population[http://www.umsl.edu/services/govdocs/wofact2006/geos/fg.html#People French Guiana: People: Ethnic Groups.] World Factbook of CIA\n** Greenland: 12% of the population[http://www.stalvik.com/Engelska/laegreenland.htm Greenland]\n** Martinique: 5% of the population[http://www.umsl.edu/services/govdocs/wofact2003/geos/mb.html#People Martinique: People: Ethnic Groups.] World Factbook of CIA\n** Saint Barthélemy[http://www.cieux.com/stbarth/stbfact.html Fact Sheet on St. Barthélemy]\n** Trinidad and Tobago:[http://www.hawaii.edu/satocenter/langnet/definitions/trinidad.html Trinidad French Creole] 0.6% of the population\n** United States (European American): 72.4% of the population, including Hispanic and Non-Hispanic Whites.\n*Oceania (see Europeans in Oceania)\n** Australia: 89.3% of the population\n** New Zealand (New Zealand European): 78% of the population\n** New Caledonia (Caldoche): 34.5% of the population\n** French Polynesia: 10% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/fp.html#People French Polynesia: People: Ethnic Groups.] World Factbook of CIA\n** Hawaii: 24.7% of the population[http://factfinder2.census.gov/faces/tableservices/jsf/pages/productview.xhtml?pidDEC_10_DP_DPDP1&prodType\ntable American FactFinder - Results] \n** Christmas Island: approx. 20% of the population.\n** Guam: 6.9% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/gq.html#People Brazil: People: Ethnic Groups.] World Factbook of CIA\n** Norfolk Island: 50% of the population",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Colonialism" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7299" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Colonialism is the policy of a nation seeking to extend or retain its authority over other people or territories, generally with the aim of exploiting them to the benefit of the colonizing country and helping the colonies modernize in terms defined by the colonizers, especially in economics, religion and health.\n\nThe European colonial period was the era from the 15th century to 1914 when Spain, Portugal, Britain, Russia, France, the Netherlands, Germany and several smaller European countries established colonies outside Europe. It has been estimated that by 1914, Europeans \"had gained control of 84% of the globe\", and by 1800, before the Industrial Revolution had taken hold, they already controlled at least 35% (excluding Antarctica). The system practically ended 1945-1975 when nearly all colonies became independent. At first, the countries followed a policy of mercantilism, designed to strengthen the home economy at the expense of rivals, so the colonies were usually allowed to trade only with the mother country. By the mid-19th century, however, the powerful British Empire gave up mercantilism and trade restrictions and introduced the principle of free trade, with few restrictions or tariffs. Christian missionaries were active in practically all the colonies. 15th century also saw the emergence of the West Asian Ottoman Empire which would go on to be the last colonizer of Europe. Asian colonization of Europe came to an end with the end of the Ottomans. By the late 19th century Japan was an active colonizer.\n\nDefinitions\n\nCollins English Dictionary defines colonialism as \"the policy and practice of a power in extending control over weaker peoples or areas.\" Webster's Encyclopedic Dictionary defines colonialism as \"the system or policy of a nation seeking to extend or retain its authority over other people or territories.\"Webster's Encyclopedic Unabridged Dictionary of the English Language, 1989, p. 291. The Merriam-Webster Dictionary offers four definitions, including \"something characteristic of a colony\" and \"control by one power over a dependent area or people.\"\n\nThe 2006 Stanford Encyclopedia of Philosophy \"uses the term 'colonialism' to describe the process of European settlement and political control over the rest of the world, including the Americas, Australia, and parts of Africa and Asia.\" It discusses the distinction between colonialism and imperialism and states that \"given the difficulty of consistently distinguishing between the two terms, this entry will use colonialism as a broad concept that refers to the project of European political domination from the sixteenth to the twentieth centuries that ended with the national liberation movements of the 1960s.\"\n\nIn his preface to Jürgen Osterhammel's Colonialism: A Theoretical Overview, Roger Tignor says, \"For Osterhammel, the essence of colonialism is the existence of colonies, which are by definition governed differently from other territories such as protectorates or informal spheres of influence.\" In the book, Osterhammel asks, \"How can 'colonialism' be defined independently from 'colony?'\" He settles on a three-sentence definition:\n\nTypes of colonialism\n\nHistorians often distinguish between various overlapping forms of colonialism:\n\n*Settler colonialism involves large-scale immigration, often motivated by religious, political, or economic reasons. It pursues to replace the original population.\n*Exploitation colonialism involves fewer colonists and focuses on the exploitation of natural resources or population as labour, typically to the benefit of the metropole. This category includes trading posts as well as larger colonies where colonists would constitute much of the political and economic administration. Prior to the end of the slave trade and widespread abolition, when indigenous labour was unavailable, slaves were often imported to the Americas, first by the Portuguese Empire, and later by the Spanish, Dutch, French and British.\n*Surrogate colonialism involves a settlement project supported by a colonial power, in which most of the settlers do not come from same ethnic group as the ruling power.\n*Internal colonialism is a notion of uneven structural power between areas of a state. The source of exploitation comes from within the state.\n\nSocio-cultural evolution\n\nAs colonialism often played out in pre-populated areas, sociocultural evolution included the formation of various ethnically hybrid populations. Colonialism gave rise to culturally and ethnically mixed populations such as the mestizos of the Americas, as well as racially divided populations such as those found in French Algeria or in Southern Rhodesia. In fact, everywhere where colonial powers established a consistent and continued presence, hybrid communities existed.\n\nNotable examples in Asia include the Anglo-Burmese,  Anglo-Indian, Burgher, Eurasian Singaporean, Filipino mestizo, Kristang and Macanese peoples. In the Dutch East Indies (later Indonesia) the vast majority of \"Dutch\" settlers were in fact Eurasians known as Indo-Europeans, formally belonging to the European legal class in the colony (see also Indos in pre-colonial history and Indos in colonial history).\nBosma U., Raben R. Being \"Dutch\" in the Indies: a history of creolisation and empire, 1500–1920 (University of Michigan, NUS Press, 2008) p. 223.  [https://books.google.com/books?id47wCTCJX9X4C&dq\nCarel+Pieter+Brest+van+Kempen&source=gbs_navlinks_s Googlebook]\n\nGouda, Frances Dutch Culture Overseas: Colonial Practice in the Netherlands Indies 1900–1942. (Publisher: Equinox, 2008) . Chapter 5, p. 163. [https://books.google.com/books?idnN6G-lMk_DEC&source\ngbs_navlinks_s]\n\nThe Other \n\n\"The Other,\" or \"othering\" is the process of creating a separate entity to persons or groups who are labelled as different or non-normal due to the repetition of characteristics. Othering is the creation of those who discriminate, to distinguish, label, categorize those who do not fit in the societal norm. Several scholars in recent decades developed the notion of the \"other\" as an epistemological concept in social theory. For example, postcolonial scholars, believed that colonizing powers explained an ‘other’ who were there to dominate, civilize, and extract resources through colonization of land.\n\nPolitical geographers explain how colonial/ imperial powers (countries, groups of people etc.) \"othered\" places they wanted to dominate to legalize their exploitation of the land. During and after the rise of colonialism the Western powers perceived the East as the \"other,\" being different and separate from their societal norm. This viewpoint and separation of culture had divided the Eastern and Western culture creating a dominant/ subordinate dynamic, both being the \"other\" towards themselves.\n\nHistory\n\nActivity that could be called colonialism has a long history starting with the pre-colonial African empires which led to the Egyptians, Phoenicians, Greeks and Romans who all built colonies in antiquity. The word \"metropole\" comes from the Greek metropolis [Greek: \"μητρόπολις\"]—\"mother city\". The word \"colony\" comes from the Latin colonia—\"a place for agriculture\". Between the 11th and 18th centuries, the Vietnamese established military colonies south of their original territory and absorbed the territory, in a process known as nam tiến.[http://countrystudies.us/vietnam/11.htm The Le Dynasty and Southward Expansion]\n\nModern colonialism started with the Age of Discovery. Portugal and Spain (initially the Crown of Castile) encountered Central and South America through sea travel and built trading posts or conquered large extensions of land. For some people, it is this building of colonies across oceans that differentiates colonialism from other types of expansionism. These new lands were divided between the Portuguese and Spanish Empires (then still between Portugal and Castile—the Crown of Castile had a dynastic but not state union with the Crown of Aragon through the Catholic Monarchs), first by the papal bull Inter caetera and then by the treaties of Tordesillas and Zaragoza.\n\nThis period is also associated with the Commercial Revolution. The late Middle Ages saw reforms in accountancy and banking in Italy and the eastern Mediterranean. These ideas were adopted and adapted in western Europe to the high risks and rewards associated with colonial ventures.\n\nThe 17th century saw the creation of the French colonial empire and the Dutch Empire, as well as the English overseas possessions, which later became the British Empire. It also saw the establishment of a Danish colonial empire and some Swedish overseas colonies.\n\nThe spread of colonial empires was reduced in the late 18th and early 19th centuries by the American Revolutionary War and the Latin American wars of independence. However, many new colonies were established after this time, including the German colonial empire and Belgian colonial empire. In the late 19th century, many European powers were involved in the Scramble for Africa.\n\nThe Russian Empire, Ottoman Empire and Austrian Empire existed at the same time as the above empires, but did not expand over oceans. Rather, these empires expanded through the more traditional route of conquest of neighbouring territories. There was, though, some Russian colonization of the Americas across the Bering Strait. The Empire of Japan modelled itself on European colonial empires. The United States of America gained overseas territories after the Spanish–American War for which the term \"American Empire\" was coined.\n\nAfter the First World War, the victorious allies divided up the German colonial empire and much of the Ottoman Empire between themselves as League of Nations mandates. These territories were divided into three classes according to how quickly it was deemed that they would be ready for independence.\n\nAfter World War II decolonization progressed rapidly. This was caused by a number of reasons. First, the Japanese victories in the Pacific War showed Indians, Chinese, and other subject peoples that the colonial powers were not invincible. Second, many colonial powers were significantly weakened by World War II.\n\nDozens of independence movements and global political solidarity projects such as the Non-Aligned Movement were instrumental in the decolonization efforts of former colonies. These included significant wars of independence fought in Indonesia, Vietnam, Algeria, and Kenya. Eventually, the European powers—pressured by the United States and Soviets—resigned themselves to decolonization.\n\nIn 1962 the United Nations set up a Special Committee on Decolonization, often called the Committee of 24, to encourage this process.\n\nEuropean empires in 1914\n\nThe major European empires consisted of the following colonies at the start of World War I (former colonies of the Spanish Empire became independent before 1914 and are not listed; former colonies of other European empires that previously became independent, such as the former French colony Haiti, are not listed).\n\nThe world's colonial population at the time of the First World War totaled about 560 million people, of whom 70.0% were in British domains, 10.0% in French, 8.6% in Dutch, 3.9% in Japanese, 2.2% in German, 2.1% in American, 1.6% in Portuguese, 1.2%  in Belgian and 1/2 of 1% in Italian possessions.  The home domains of the colonial powers had a total population of about 370 million people.The Russian Empire, Austria-Hungry, Ottoman Empire, Spain and Denmark are not included.  U.S. Tariff Commission. Colonial tariff policies (1922),  p. 5 [https://archive.org/details/colonialtariffpo00unit  online]\n\nAsking whether colonies paid, economic historian Grover Clark argues and an emphatic No!  He reports that in every case the support cost, especially the military system necessary to support and defend the colonies outran the total trade they produced.  Apart from the British Empire, they were not favored destinations for the immigration of surplus populations.Raymond Leslie Buell,  \"Do Colonies Pay?\"   [http://www.unz.org/Pub/SaturdayRev-1936aug01-00006?View=PDF The Saturday Review, August 1, 1936 p 6 ]\n\nBritish colonies and protectorates\n\n* Aden\n* Anglo-Egyptian Sudan\n* Ascension Island\n* Bahamas\n* Barbados\n* Basutoland\n* Bechuanaland\n* British Borneo\n** Brunei\n** Labuan\n** North Borneo\n** Sarawak\n* British East Africa\n* British Guiana\n* British Honduras\n* British Hong Kong\n* British Leeward Islands\n** Anguilla\n** Antigua\n** Barbuda\n** British Virgin Islands\n** Dominica\n** Montserrat\n** Nevis\n** Saint Kitts\n* British Malaya\n** Federated Malay States\n** Straits Settlements\n** Unfederated Malay States\n* British Somaliland\n* British Western Pacific Territories\n** British Solomon Islands\n** Fiji\n** Gilbert and Ellice Islands\n** Phoenix Islands\n** Pitcairn Islands\n** New Hebrides (condominium with France)\n** Tonga\n** Union Islands\n* British Windward Islands\n** Barbados\n** Dominica\n** Grenada\n** Saint Lucia\n** Saint Vincent and the Grenadines\n* Burma\n* Canada\n* Ceylon\n* Christmas Island\n* Cocos (Keeling) Islands\n* Cyprus (including Akrotiri and Dhekelia)\n* Egypt\n* Falkland Islands\n* Falkland Islands Dependencies\n**Graham's Land\n**South Georgia \n**South Orkneys\n**South Shetlands\n**South Sandwich Islands\n**Victoria Land\n* Gambia\n* Gibraltar\n* Gold Coast\n* India (including what is today Pakistan and Bangladesh)\n* Heard Island and McDonald Islands\n* Ireland\n* Jamaica\n* Kenya\n* Maldives\n* Malta\n* Mauritius\n* Muscat and Oman\n* Norfolk Island\n* Nigeria\n* Northern Rhodesia\n* Nyasaland \n* Seychelles\n* Sierra Leone\n* Southern Rhodesia\n* St. Helena\n* Swaziland\n* Trinidad and Tobago\n* Trucial States\n* Uganda\n* Tonga\n\nFrench colonies\n\n* Algeria\n* Clipperton Island\n* Comoros Islands (including Mayotte)\n* Corsica\n* French Guiana\n* French Equatorial Africa\n** Chad\n** Oubangui-Chari\n** French Congo\n** Gabon\n* French India (Pondichéry, Chandernagor, Karikal, Mahé and Yanaon)\n* French Indochina\n** Annam\n**  Tonkin\n** Cochinchina\n**  Cambodia\n** Laos\n* French Polynesia\n* French Somaliland\n* French Southern and Antarctic Lands\n* French West Africa\n** Ivory Coast\n** Dahomey\n** Guinea\n** French Sudan\n** Mauritania\n** Niger\n** Senegal\n** Upper Volta\n* Guadeloupe\n** Saint Barthélemy\n** Saint Martin\n* La Réunion\n* Madagascar\n* Martinique\n* French Morocco\n* Lebanon\n* New Caledonia\n* Saint-Pierre-et-Miquelon\n* Shanghai French Concession (similar concessions in Kouang-Tchéou-Wan, Tientsin, Hankéou)\n* Tunisia\n* New Hebrides(Condominium with Britain)\n* Wallis-et-Futuna\n\nRussian colonies and protectorates\n\n* European Russia\n** Åland Islands\n** Baltic provinces\n*** Governorate of Courland\n*** Governorate of Livland\n*** Governorate of Estland \n** Bashkortostan\n** Bessarabia\n** Grand Principality of Finland\n** Chechnya\n** Chuvashia\n** Dagestan\n** Dnieper Ukraine\n** East Karelia\n** Ingushetia\n** Kabardino-Balkaria\n** Kalmykia\n** Karachay–Cherkessia\n** Komi\n** Lithuania Governorate\n** Mari El\n** Mordovia\n** Russian Poland\n** Tatarstan\n** Udmurtia\n* Asiatic Russia\n** Adygea\n** Altai\n** Armenia\n** Azerbaijan\n** Buryatia\n** Chukotka\n** Emirate of Bukhara\n** Georgia\n** Khakassia\n** Khanate of Khiva\n** Koryak\n** Ossetia\n** Outer Manchuria\n** Russian Turkestan\n*** Kazakhstan\n*** Kyrgyzstan\n*** Tajikistan\n*** Turkmenistan\n** Tannu Uriankhai\n** Yakutia\n** Yamalia\n\nGerman colonies\n\n* Bismarck Archipelago\n* Cameroon\n* Caroline Islands\n* German New Guinea\n* German Solomon Islands\n* German East Africa\n* German South-West Africa\n* Gilbert Islands\n* Mariana Islands\n* Marshall Islands\n* Togo\n\nItalian colonies and protectorates\n\n* Italian Libya\n* Italian Eritrea\n* Italian Somaliland\n* Italian Aegean Islands\n* Italian Concession of Tientsin\n* Pantelleria\n* Pelagie Islands\n\nDutch colonies\n\n* Dutch Ceylon\n* Aruba \n* Bonaire\n* Curaçao \n* Saba \n* Sint Eustatius\n* Sint Maarten \n* Suriname\n* Dutch East Indies\n* Dutch New Guinea\n\nPortuguese colonies\n\n* Azores\n* Portuguese Africa\n** Cabinda\n** Madeira\n** Portuguese Angola\n** Portuguese Cape Verde\n** Portuguese Guinea\n** Portuguese Mozambique\n** Portuguese São Tomé and Príncipe\n** Fort of São João Baptista de Ajudá\n*Portuguese Asia\n** Portuguese India\n*** Goa\n*** Daman\n*** Diu\n** Portuguese Macau\n** Portuguese Timor\n*Portuguese America\n** Colonial Brazil\n\nSpanish colonies\n\n* Balearic Islands\n* Canary Islands\n* Cape Juby\n* Ifni\n* Rio de Oro\n* Saguia el-Hamra\n* Spanish Guinea\n** Annobón\n** Fernando Pó\n** Rio Muni\n* Spanish Morocco\n\nAustro-Hungarian colonies\n\n \n* Bosnia and Herzegovina\n* Tianjin\n\nDanish colonies\n\n* Danish Gold Coast (now part of Ghana)\n* Danish India (Tharangambadi, Serampore and the Nicobar Islands)\n* Danish West Indies (now United States Virgin Islands)\n* Faroe islands\n* Greenland\n* Iceland\n\nBelgian colonies\n\n* Belgian Congo\n* Tianjin\n\nNumbers of European settlers in the colonies (1500–1914)\n\nBy 1914, Europeans had migrated to the colonies in the millions. Some intended to remain in the colonies as temporary settlers, mainly as military personnel or on business. Others went to the colonies as immigrants. British people were by far the most numerous population to migrate to the colonies: 2.5 million settled in Canada; 1.5 million in Australia; 750,000 in New Zealand; 450,000 in the Union of South Africa; and 200,000 in India. French citizens also migrated in large numbers, mainly to the colonies in the north African Maghreb region: 1.3 million settled in Algeria; 200,000 in Morocco; 100,000 in Tunisia; while only 20,000 migrated to French Indochina. Dutch and German colonies saw relatively scarce European migration, since Dutch and German colonial expansion focused on commercial goals rather than settlement. Portugal sent 150,000 settlers to Angola, 80,000 to Mozambique, and 20,000 to Goa. During the Spanish Empire, approximately 550,000 Spanish settlers migrated to Latin America.\n\nOther non-European colonialist countries in 1914\n\nAustralian protectorate\n\n* Papua\n\nNew Zealand dependencies\n\n* Cook Islands\n* Niue\n\nUnited States colonies and protectorates\n\n* Alaska\n* American Samoa\n* Cuba (Platt Amendment turned Cuba into a protectorate)\n* Guantánamo Bay\n* Guam\n* Hawaii\n* Midway\n* Nicaragua\n* Palmyra Atoll\n* Panama (Hay–Bunau-Varilla Treaty turned Panama into a protectorate)\n* Panama Canal Zone\n* Philippines\n* Puerto Rico\n* Sultanate of Sulu\n* Swan Islands, Honduras\n* Wake Island\n\nTurkish (Ottoman) colonies\n\n* Baghdad Vilayet\n* Basra\n* Edirne\n* Ha'il\n* Hejaz\n* Lebanon\n* Nejd\n* Palestine\n* Syria\n* Yemen\n\nJapanese colonies\n\n* Bonin Islands\n* Karafuto\n* Korea\n* Taiwán\n* Kuril Islands\n* Kwantung Leased Territory\n* Ryukyu Domain  \n** Senkaku Islands\n* Volcano Islands\n* Caroline Islands\n* Penghu Islands\n\nChinese colonies\n\n* Chinese Turkestan in Qing Dynasty\n\nNeocolonialism\n\nThe term neocolonialism has been used to refer to a variety of contexts since decolonization that took place after World War II. Generally it does not refer to a type of direct colonization, rather, colonialism by other means. Specifically, neocolonialism refers to the theory that former or existing economic relationships, such as the General Agreement on Tariffs and Trade and the Central American Free Trade Agreement, created by former colonial powers were or are used to maintain control of their former colonies and dependencies after the colonial independence movements of the post–World War II period.\n\nImpact of colonialism and colonization\n\nThe impacts of colonization are immense and pervasive.[http://www.time.com/time/world/article/0,8599,1713275,00.html Come Back, Colonialism, All is Forgiven] Various effects, both immediate and protracted, include the spread of virulent diseases, unequal social relations, exploitation, enslavement, medical advances, the creation of new institutions, abolitionism,Lovejoy, Paul E. (2012). Transformations of Slavery: A History of Slavery in Africa. London: Cambridge University Press. improved infrastructure,Ferguson, Niall (2003). Empire: How Britain Made the Modern World. London: Allen Lane. and technological progress.[Thong, Tezenlo. Civilized Colonizers and Barbaric Colonized: Reclaiming Naga Identity by Demythologizing Colonial Portraits, History and Anthropology 23, no. 3 (2012): 375-397] Colonial practices also spur the spread of colonist languages, literature and cultural institutions, while endangering or obliterating those of native peoples. The native cultures of the colonized peoples can also have a powerful influence on the imperial country.\n\nEconomy, trade and commerce\n\nEconomic expansion has accompanied imperial expansion since ancient times. Greek trade networks spread throughout the Mediterranean region while Roman trade expanded with the primary goal of directing tribute from the colonized areas towards the Roman metropole. According to Strabo, by the time of emperor Augustus, up to 120 Roman ships would set sail every year from Myos Hormos in Roman Egypt to India.\"[http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Strabo/2E1*.html Strabo's Geography Book II Chapter 5 ]\" With the development of trade routes under the Ottoman Empire,\n\nAztec civilization developed into an extensive empire that, much like the Roman Empire, had the goal of exacting tribute from the conquered colonial areas. For the Aztecs, a significant tribute was the acquisition of sacrificial victims for their religious rituals.\n\nOn the other hand, European colonial empires sometimes attempted to channel, restrict and impede trade involving their colonies, funneling activity through the metropole and taxing accordingly.\n\nDespite the general trend of economic expansion, the economic performance of former European colonies varies significantly. In \"Institutions as a Fundamental Cause of Long-run Growth,\" economists Daron Acemoglu, Simon Johnson and James A. Robinson compare the economic influences of the European colonists on different colonies and study what could explain the huge discrepancies in previous European colonies, for example, between West African colonies like Sierra Leone and Hong Kong and Singapore.\n\nAccording to the paper, economic institutions are the determinant of the colonial success because they determine their financial performance and order for the distribution of resources. At the same time, these institutions are also consequences of political institutions - especially how de facto and de jure political power is allocated. To explain the different colonial cases, we thus need to look first into the political institutions that shaped the economic institutions.\n\nFor example, one interesting observation is \"the Reversal of Fortune\" - the less developed civilizations in 1500, like North America, Australia, and New Zealand, are now much richer than those countries who used to be in the prosperous civilizations in 1500 before the colonists came, like the Mughals in India and the Incas in the Americas. One explanation offered by the paper focuses on the political institutions of the various colonies: it was less likely for European colonists to introduce economic institutions where they could benefit quickly from the extraction of resources in the area. Therefore, given a more developed civilization and denser population, European colonists would rather keep the existing economic systems than introduce an entirely new system; while in places with little to extract, European colonists would rather establish new economic institutions to protect their interests. Political institutions thus gave rise to different types of economic systems, which determined the colonial economic performance.\n\nEuropean colonization and development also changed gendered systems of power already in place around the world. In many pre-colonialist areas, women maintained power, prestige, or authority through reproductive or agricultural control. For example, in certain parts of sub-Saharan Africa women maintained farmland in which they had usage rights. While men would make political and communal decisions for a community, the women would control the village’s food supply or their individual family’s land. This allowed women to achieve power and autonomy, even in patrilineal and patriarchal societies.\n\nThrough the rise of European colonialism came a large push for development and industrialization of most economic systems. However, when working to improve productivity, Europeans focused mostly on male workers. Foreign aid arrived in the form of loans, land, credit, and tools to speed up development, but were only allocated to men. In a more European fashion, women were expected to serve on a more domestic level. The result was a technologic, economic, and class-based gender gap that widened over time.\n\nSlavery and indentured servitude\n\nEuropean nations entered their imperial projects with the goal of enriching the European metropole. Exploitation of non-Europeans and other Europeans to support imperial goals was acceptable to the colonizers. Two outgrowths of this imperial agenda were slavery and indentured servitude. In the 17th century, nearly two-thirds of English settlers came to North America as indentured servants.\"[http://www.montgomerycollege.edu/Departments/hpolscrv/whiteser.html White Servitude]\", by Richard Hofstadter, Montgomery College\n\nEuropean slave traders brought large numbers of African slaves to the Americas by sail. Spain and Portugal had brought African slaves to work at African colonies such as Cape Verde and the Azores, and then Latin America, by the 16th century. The British, French and Dutch joined in the slave trade in subsequent centuries. Ultimately, around 11 million Africans were taken to the Caribbean and North and South America as slaves by European colonizers.\n\nAbolitionists in Europe and Americas protested the inhumane treatment of African slaves, which led to the elimination of the slave trade by the late 18th century. The labour shortage that resulted inspired European colonizers to develop a new source of labour, using a system of indentured servitude. Indentured servants consented to a contract with the European colonizers. Under their contract, the servant would work for an employer for a term of at least a year, while the employer agreed to pay for the servant's voyage to the colony, possibly pay for the return to the country of origin, and pay the employee a wage as well. The employee was \"indentured\" to the employer because they owed a debt back to the employer for their travel expense to the colony, which they were expected to pay through their wages. In practice, indentured servants were exploited through terrible working conditions and burdensome debts created by the employers, with whom the servants had no means of negotiating the debt once they arrived in the colony.\n\nIndia and China were the largest source of indentured servants during the colonial era. Indentured servants from India travelled to British colonies in Asia, Africa and the Caribbean, and also to French and Portuguese colonies, while Chinese servants travelled to British and Dutch colonies. Between 1830 and 1930, around 30 million indentured servants migrated from India, and 24 million returned to India. China sent more indentured servants to European colonies, and around the same proportion returned to China.\n\nFollowing the Scramble for Africa, an early but secondary focus for most colonial regimes was the suppression of slavery and the slave trade. By the end of the colonial period they were mostly successful in this aim, though slavery is still very active in Africa and the world at large with much the same practices of de facto servility despite legislative prohibition.\n\nMilitary innovation\n\nImperial expansion follows military conquest in most instances. Imperial armies therefore have a long history of military innovation in order to gain an advantage over the armies of the people they aim to conquer. Greeks developed the phalanx system, which enabled their military units to present themselves to their enemies as a wall, with foot soldiers using shields to cover one another during their advance on the battlefield. Under Philip II of Macedon, they were able to organize thousands of soldiers into a formidable battle force, bringing together carefully trained infantry and cavalry regiments. Alexander the Great exploited this military foundation further during his conquests.\n\nThe Spanish Empire held a major advantage over Mesoamerican warriors through the use of weapons made of stronger metal, predominantly iron, which was able to shatter the blades of axes used by the Aztec civilization and others. The European development of firearms using gunpowder cemented their military advantage over the peoples they sought to subjugate in the Americas and elsewhere.\n\nThe end of empire\n\nThe populations of some colonial territories, such as Canada, enjoyed relative peace and prosperity as part of a European power, at least among the majority; however, minority populations such as First Nations peoples and French-Canadians experienced marginalization and resented colonial practises. Francophone residents of Quebec, for example, were vocal in opposing conscription into the armed services to fight on behalf of Britain during World War I, resulting in the Conscription crisis of 1917. Other European colonies had much more pronounced conflict between European settlers and the local population. Rebellions broke out in the later decades of the imperial era, such as India's Sepoy Rebellion.\n\nThe territorial boundaries imposed by European colonizers, notably in central Africa and South Asia, defied the existing boundaries of native populations that had previously interacted little with one another. European colonizers disregarded native political and cultural animosities, imposing peace upon people under their military control. Native populations were often relocated at the will of the colonial administrators. Once independence from European control was achieved, civil war erupted in some former colonies, as native populations fought to capture territory for their own ethnic, cultural or political group. The Partition of India, a 1947 civil war that came in the aftermath of India's independence from Britain, became a conflict with 500,000 killed. Fighting erupted between Hindu, Sikh and Muslim communities as they fought for territorial dominance. Muslims fought for an independent country to be partitioned where they would not be a religious minority, resulting in the creation of Pakistan.\n\nPost-independence population movement\n\nIn a reversal of the migration patterns experienced during the modern colonial era, post-independence era migration followed a route back towards the imperial country. In some cases, this was a movement of settlers of European origin returning to the land of their birth, or to an ancestral birthplace. 900,000 French colonists (known as the Pied-Noirs) resettled in France following Algeria's independence in 1962. A significant number of these migrants were also of Algerian descent. 800,000 people of Portuguese origin migrated to Portugal after the independence of former colonies in Africa between 1974 and 1979; 300,000 settlers of Dutch origin migrated to the Netherlands from the Dutch West Indies after Dutch military control of the colony ended.\n\nAfter WWII 300,000 Dutchmen from the Dutch East Indies, of which the majority were people of Eurasian descent called Indo Europeans, repatriated to the Netherlands. A significant number later migrated to the US, Canada, Australia and New Zealand.Willems, Wim \"De uittocht uit Indie (1945–1995), De geschiedenis van Indische Nederlanders\" (Publisher: Bert Bakker, Amsterdam, 2001). Crul, Lindo and Lin Pang. Culture, Structure and Beyond, Changing identities and social positions of immigrants and their children (Het Spinhuis Publishers, 1999). \n\nGlobal travel and migration in general developed at an increasingly brisk pace throughout the era of European colonial expansion. Citizens of the former colonies of European countries may have a privileged status in some respects with regard to immigration rights when settling in the former European imperial nation. For example, rights to dual citizenship may be generous, or larger immigrant quotas may be extended to former colonies.\n\nIn some cases, the former European imperial nations continue to foster close political and economic ties with former colonies. The Commonwealth of Nations is an organization that promotes cooperation between and among Britain and its former colonies, the Commonwealth members. A similar organization exists for former colonies of France, the Francophonie; the Community of Portuguese Language Countries plays a similar role for former Portuguese colonies, and the Dutch Language Union is the equivalent for former colonies of the Netherlands.\n\nMigration from former colonies has proven to be problematic for European countries, where the majority population may express hostility to ethnic minorities who have immigrated from former colonies. Cultural and religious conflict have often erupted in France in recent decades, between immigrants from the Maghreb countries of north Africa and the majority population of France. Nonetheless, immigration has changed the ethnic composition of France; by the 1980s, 25% of the total population of \"inner Paris\" and 14% of the metropolitan region were of foreign origin, mainly Algerian.\n\nIntroduced diseases\n\nEncounters between explorers and populations in the rest of the world often introduced new diseases, which sometimes caused local epidemics of extraordinary virulence.Kenneth F. Kiple, ed. The Cambridge Historical Dictionary of Disease (2003). For example, smallpox, measles, malaria, yellow fever, and others were unknown in pre-Columbian America.Alfred W. Crosby, Jr., The Columbian Exchange: Biological and Cultural Consequences of 1492 (1974)\n\nDisease killed the entire native (Guanches) population of the Canary Islands in the 16th century. Half the native population of Hispaniola in 1518 was killed by smallpox. Smallpox also ravaged Mexico in the 1520s, killing 150,000 in Tenochtitlan alone, including the emperor, and Peru in the 1530s, aiding the European conquerors. Measles killed a further two million Mexican natives in the 17th century. In 1618–1619, smallpox wiped out 90% of the Massachusetts Bay Native Americans.[http://www.ucpress.edu/books/pages/9968/9968.ch01.html Smallpox - The Fight to Eradicate a Global Scourge], David A. Koplow. Smallpox epidemics in 1780–1782 and 1837–1838 brought devastation and drastic depopulation among the Plains Indians.[http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=2094753 \"The first smallpox epidemic on the Canadian Plains: In the fur-traders' words\"], National Institutes of Health. Some believe that the death of up to 95% of the Native American population of the New World was caused by Old World diseases.[https://www.pbs.org/gunsgermssteel/variables/smallpox.html The Story Of ... Smallpox – and other Deadly Eurasian Germs.] Over the centuries, the Europeans had developed high degrees of immunity to these diseases, while the indigenous peoples had no time to build such immunity.[http://www.millersville.edu/~columbus/papers/goodling.html Stacy Goodling, \"Effects of European Diseases on the Inhabitants of the New World\"] \n\nSmallpox decimated the native population of Australia, killing around 50% of indigenous Australians in the early years of British colonisation. It also killed many New Zealand Māori.[http://www.canr.msu.edu/overseas/nzenvironsci/infopart2.htm New Zealand Historical Perspective]  As late as 1848–49, as many as 40,000 out of 150,000 Hawaiians are estimated to have died of measles, whooping cough and influenza. Introduced diseases, notably smallpox, nearly wiped out the native population of Easter Island.[https://www.independent.co.uk/news/science/how-did-easter-islands-ancient-statues-lead-to-the-destruction-of-an-entire-ecosystem-455877.html How did Easter Island's ancient statues lead to the destruction of an entire ecosystem?], The Independent. In 1875, measles killed over 40,000 Fijians, approximately one-third of the population.[http://www.fsm.ac.fj/aboutfsm.html Fiji School of Medicine]  The Ainu population decreased drastically in the 19th century, due in large part\nto infectious diseases brought by Japanese settlers pouring into Hokkaido.[http://www.time.com/time/asia/features/ontheroad/japan.sapporo.ainu.html Meeting the First Inhabitants] , TIMEasia.com, 21 August 2000.\n\nConversely, researchers have hypothesized that a precursor to syphilis may have been carried from the New World to Europe after Columbus's voyages. The findings suggested Europeans could have carried the nonvenereal tropical bacteria home, where the organisms may have mutated into a more deadly form in the different conditions of Europe.[https://www.nytimes.com/2008/01/15/science/15syph.html?_r1 Genetic Study Bolsters Columbus Link to Syphilis], New York Times, January 15, 2008. The disease was more frequently fatal than it is today; syphilis was a major killer in Europe during the Renaissance.[http://www.livescience.com/history/080114-syphilis-columbus.html Columbus May Have Brought Syphilis to Europe], LiveScience The first cholera pandemic began in Bengal, then spread across India by 1820. Ten thousand British troops and countless Indians died during this pandemic.[http://www.cbc.ca/health/story/2008/05/09/f-cholera-outbreaks.html Cholera's seven pandemics]. CBC News. December 2, 2008. Between 1736 and 1834 only some 10% of East India Company's officers survived to take the final voyage home.[http://www.asianreviewofbooks.com/arb/article.php?article\n610 Sahib: The British Soldier in India, 1750–1914 by Richard Holmes.] Waldemar Haffkine, who mainly worked in India, who developed and used vaccines against cholera and bubonic plague in the 1890s, is considered the first microbiologist.\n\nCountering disease\n\nAs early as 1803, the Spanish Crown organised a mission (the Balmis expedition) to transport the smallpox vaccine to the Spanish colonies, and establish mass vaccination programs there.[http://www.doh.gov.ph/sphh/balmis.htm Dr. Francisco de Balmis and his Mission of Mercy, Society of Philippine Health History.]  By 1832, the federal government of the United States established a smallpox vaccination program for Native Americans.[http://muse.jhu.edu/login?uri/journals/wicazo_sa_review/v018/18.2pearson01.html Lewis Cass and the Politics of Disease: The Indian Vaccination Act of 1832.] Under the direction of Mountstuart Elphinstone a program was launched to propagate smallpox vaccination in India.[http://www.smallpoxhistory.ucl.ac.uk/Other%20Asia/ongoingwork.htm Smallpox History - Other histories of smallpox in South Asia.]  From the beginning of the 20th century onwards, the elimination or control of disease in tropical countries became a driving force for all colonial powers.[http://www.gresham.ac.uk/event.asp?PageId\n45&EventId=696 Conquest and Disease or Colonialism and Health?] , Gresham College | Lectures and Events. The sleeping sickness epidemic in Africa was arrested due to mobile teams systematically screening millions of people at risk. In the 20th century, the world saw the biggest increase in its population in human history due to lessening of the mortality rate in many countries due to medical advances.[https://www.jstor.org/pss/182701 The Origins of African Population Growth, by John Iliffe], The Journal of African History, Vol. 30, No. 1 (1989), pp. 165–169. The world population has grown from 1.6 billion in 1900 to over seven billion today.\n\nColonialism and the history of thought\n\nUniversalism\n\nThe conquest of vast territories brings multitudes of diverse cultures under the central control of the imperial authorities. From the time of Ancient Greece and Ancient Rome, this fact has been addressed by empires adopting the concept of universalism, and applying it to their imperial policies towards their subjects far from the imperial capitol. The capitol, the metropole, was the source of ostensibly enlightened policies imposed throughout the distant colonies.\n\nThe empire that grew from Greek conquest, particularly by Alexander the Great, spurred the spread of Greek language, religion, science and philosophy throughout the colonies. While most Greeks considered their own culture superior to all others (the word barbarian is derived from mutterings that sounded to Greek ears like \"bar-bar\"), Alexander was unique in promoting a campaign to win the hearts and minds of the Persians. He [http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Plutarch/Lives/Alexander*/6-7.html adopted Persian customs of clothing] and otherwise encouraged his men to go native by adopting local wives and learning their mannerisms. Of note is that he radically departed from earlier Greek attempts at colonization, characterized by the murder and enslavement of the local inhabitants and the settling of Greek citizens from the polis.\n\nRoman universalism was characterized by cultural and religious tolerance and a focus on civil efficiency and the rule of law.  Roman law was imposed on both Roman citizens and colonial subjects. Although Imperial Rome had no public education, Latin spread through its use in government and trade. Roman law prohibited local leaders to wage war between themselves, which was responsible for the 200 year long Pax Romana, at the time the longest period of peace in history. The Roman Empire was tolerant of diverse cultures and religious practises, even allowing them on a few occasions to threaten Roman authority.\n\nColonialism and geography\n\nSettlers acted as the link between indigenous populations and the imperial hegemony, thus bridging the geographical, ideological and commercial gap between the colonizers and colonized. While the extent in which geography as an academic study is implicated in colonialism is contentious, geographical tools such as cartography, shipbuilding, navigation, mining and agricultural productivity were instrumental in European colonial expansion. Colonizer's awareness of the Earth's surface and abundance of practical skills provided colonizers with a knowledge that, in turn, created power.\"Painter, J. & Jeffrey, A., 2009. Political Geography, 2nd ed., Sage. \"Imperialism\" p. 23 (GIC).\n\nAnne Godlewska and Neil Smith argue that \"empire was 'quintessentially a geographical project.'\" Historical geographical theories such as environmental determinism legitimized colonialism by positing the view that some parts of the world were underdeveloped, which created notions of skewed evolution. Geographers such as Ellen Churchill Semple and Ellsworth Huntington put forward the notion that northern climates bred vigour and intelligence as opposed to those indigenous to tropical climates (See The Tropics) viz a viz a combination of environmental determinism and Social Darwinism in their approach.\n\nPolitical geographers also maintain that colonial behavior was reinforced by the physical mapping of the world, therefore creating a visual separation between \"them\" and \"us\".  Geographers are primarily focused on the spaces of colonialism and imperialism; more specifically, the material and symbolic appropriation of space enabling colonialism.\n\nMaps played an extensive role in colonialism, as Bassett would put it \"by providing geographical information in a convenient and standardized format, cartographers helped open West Africa to European conquest, commerce, and colonization\". However, because the relationship between colonialism and geography was not scientifically objective, cartography was often manipulated during the colonial era. Social norms and values had an effect on the constructing of maps. During colonialism map-makers used rhetoric in their formation of boundaries and in their art. The rhetoric favored the view of the conquering Europeans; this is evident in the fact that any map created by a non-European was instantly regarded as inaccurate. Furthermore, European cartographers were required to follow a set of rules which led to ethnocentrism; portraying one's own ethnicity in the center of the map. As Harley would put it \"The steps in making a map - selection, omission, simplification, classification, the creation of hierarchies, and 'symbolization' - are all inherently rhetorical.\"\n\nA common practice by the European cartographers of the time was to map unexplored areas as \"blank spaces\". This influenced the colonial powers as it sparked competition amongst them to explore and colonize these regions. Imperialists aggressively and passionately looked forward to filling these spaces for the glory of their respective countries. The Dictionary of Human Geography notes that cartography was used to empty 'undiscovered' lands of their Indigenous meaning and bring them into spatial existence via the imposition of \"Western place-names and borders, [therefore] priming ‘virgin’ (putatively empty land, ‘wilderness’) for colonization (thus sexualizing colonial landscapes as domains of male penetration), reconfiguring alien space as absolute, quantifiable and separable (as property).\"\n\nDavid Livingstone stresses \"that geography has meant different things at different times and in different places\" and that we should keep an open mind in regards to the relationship between geography and colonialism instead of identifying boundaries. Geography as a discipline was not and is not an objective science, Painter and Jeffrey argue, rather it is based on assumptions about the physical world.\n\nColonialism and imperialism\n\nA colony is a part of an empire and so colonialism is closely related to imperialism. Assumptions are that colonialism and imperialism are interchangeable, however Robert J. C. Young suggests that imperialism is the concept while colonialism is the practice. Colonialism is based on an imperial outlook, thereby creating a consequential relationship. Through an empire, colonialism is established and capitalism is expanded, on the other hand a capitalist economy naturally enforces an empire. In the next section Marxists make a case for this mutually reinforcing relationship.\n\nMarxist view of colonialism\n\nMarxism views colonialism as a form of capitalism, enforcing exploitation and social change. Marx thought that working within the global capitalist system, colonialism is closely associated with uneven development. It is an \"instrument of wholesale destruction, dependency and systematic exploitation producing distorted economies, socio-psychological disorientation, massive poverty and neocolonial dependency.\"Dictionary of Human Geography, \"Colonialism\" Colonies are constructed into modes of production. The search for raw materials and the current search for new investment opportunities is a result of inter-capitalist rivalry for capital accumulation. Lenin regarded colonialism as the root cause of imperialism, as imperialism was distinguished by monopoly capitalism via colonialism and as Lyal S. Sunga explains: \"Vladimir Lenin advocated forcefully the principle of self-determination of peoples in his \"Theses on the Socialist Revolution and the Right of Nations to Self-Determination\" as an integral plank in the programme of socialist internationalism\" and he quotes Lenin who contended that \"The right of nations to self-determination implies exclusively the right to independence in the political sense, the right to free political separation from the oppressor nation.  Specifically, this demand for political democracy implies complete freedom to agitate for secession and for a referendum on secession by the seceding nation.\"In the Emerging System of International Criminal Law: Developments and Codification, Brill Publishers (1997) at page 90, Sunga traces the origin of the international movement against colonialism, and relates it to the rise of the right to self-determination in international law. Non Russian marxists within the RSFSR and later the USSR, like Sultan Galiev and Vasyl Shakhrai,  meanwhile, between 1918 and 1923 and then after 1929, considered the Soviet Regime a renewed version of the Russian imperialism and colonialism.\n\nIn his critique of colonialism in Africa, the Guyanese historian and political activist Walter Rodney states:\n\"The decisiveness of the short period of colonialism and its negative consequences for Africa spring mainly from the fact that Africa lost power. Power is the ultimate determinant in human society, being basic to the relations within any group and between groups. It implies the ability to defend one's interests and if necessary to impose one's will by any means available.... When one society finds itself forced to relinquish power entirely to another society that in itself is a form of underdevelopment ... During the centuries of pre-colonial trade, some control over social political and economic life was retained in Africa, in spite of the disadvantageous commerce with Europeans. That little control over internal matters disappeared under colonialism. Colonialism went much further than trade. It meant a tendency towards direct appropriation by Europeans of the social institutions within Africa. Africans ceased to set indigenous cultural goals and standards, and lost full command of training young members of the society. Those were undoubtedly major steps backwards ... Colonialism was not merely a system of exploitation, but one whose essential purpose was to repatriate the profits to the so-called 'mother country'. From an African view-point, that amounted to consistent expatriation of surplus produced by African labour out of African resources. It meant the development of Europe as part of the same dialectical process in which Africa was underdeveloped.\"\n\n\"Colonial Africa fell within that part of the international capitalist economy from which surplus was drawn to feed the metropolitan sector. As seen earlier, exploitation of land and labour is essential for human social advance, but only on the assumption that the product is made available within the area where the exploitation takes place.\"\n\nAccording to Lenin, the new imperialism emphasized the transition of capitalism from free trade to a stage of monopoly capitalism to finance capital. He states it is, \"connected with the intensification of the struggle for the partition of the world\".  As free trade thrives on exports of commodities, monopoly capitalism thrived on the export of capital amassed by profits from banks and industry. This, to Lenin, was the highest stage of capitalism. He goes on to state that this form of capitalism was doomed for war between the capitalists and the exploited nations with the former inevitably losing. War is stated to be the consequence of imperialism. As a continuation of this thought G.N. Uzoigwe states, \"But it is now clear from more serious investigations of African history in this period that imperialism was essentially economic in its fundamental impulses.\"\nBoahen, A. Adu. Africa under Colonial Domination 1880-1935. London: Heinemann, 1985. 11. Print.\n\nLiberalism, capitalism and colonialism\n\nClassical liberals were generally in abstract opposition to colonialism (as opposed to colonization) and imperialism, including Adam Smith, Frédéric Bastiat, Richard Cobden, John Bright, Henry Richard, Herbert Spencer, H. R. Fox Bourne, Edward Morel, Josephine Butler, W. J. Fox and William Ewart Gladstone.[http://www.setav.org/ups/dosya/24514.pdf Liberal Anti-Imperialism] , professor Daniel Klein, 1.7.2004 Their philosophies found the colonial enterprise, particularly mercantilism, in opposition to the principles of free trade and liberal policies. Adam Smith wrote in Wealth of Nations that Britain should grant independence to all of its colonies and also argued that it would be economically beneficial for British people in the average, although the merchants having mercantilist privileges would lose out.\n\nScientific thought in colonialism, race and gender\n\nDuring the colonial era, the global process of colonization served to spread and synthesize the social and political belief systems of the \"mother-countries\" which often included a belief in a certain natural racial superiority of the race of the mother-country.  Colonialism also acted to reinforce these same racial belief systems within the \"mother-countries\" themselves. Usually also included within the colonial belief systems was a certain belief in the inherent superiority of male over female, however this particular belief was often pre-existing amongst the pre-colonial societies, prior to their colonization.\n\nPopular political practices of the time reinforced colonial rule by legitimizing European (and/ or Japanese) male authority, and also legitimizing female and non-mother-country race inferiority through studies of Craniology, Comparative Anatomy, and Phrenology. Biologists, naturalists, anthropologists, and ethnologists of the 19th century were focused on the study of colonized indigenous women, as in the case of Georges Cuvier's study of Sarah Baartman. Such cases embraced a natural superiority and inferiority relationship between the races based on the observations of naturalists' from the mother-countries.  European studies along these lines gave rise to the perception that African women's anatomy, and especially genitalia, resembled those of mandrills, baboons, and monkeys, thus differentiating colonized Africans from what were viewed as the features of the evolutionarily superior, and thus rightfully authoritarian, European woman.\n\nIn addition to what would now be viewed as pseudo-scientific studies of race, which tended to reinforce a belief in an inherent mother-country racial superiority, a new supposedly \"science-based\" ideology concerning gender roles also then emerged as an adjunct to the general body of beliefs of inherent superiority of the colonial era. Female inferiority across all cultures was emerging as an idea supposedly supported by craniology that led scientists to argue that the typical brain size of the female human was, on the average, slightly smaller than that of the male, thus inferring that therefore female humans must be less developed and less evolutionarily advanced than males.  This finding of relative cranial size difference was later simply attributed to the general typical size difference of the human male body versus that of the typical human female body.[https://www.theguardian.com/science/brain-flapping/2013/dec/04/male-female-brains-real-differences Male and female brains: the REAL differences] 10 February 2016, by Dean Burnett, The Guardian\n\nWithin the former European colonies, non-Europeans and women sometimes faced invasive studies by the colonial powers in the interest of the then prevailing pro-colonial scientific ideology of the day. Such seemingly flawed studies of race and gender coincided with the era of colonialism and the initial introduction of foreign cultures, appearances, and gender roles into the now gradually widening world-views of the scholars of the mother-countries.\n\nPost-colonialism\n\nPost-colonialism (or post-colonial theory) can refer to a set of theories in philosophy and literature that grapple with the legacy of colonial rule. In this sense, postcolonial literature may be considered a branch of postmodern literature concerned with the political and cultural independence of peoples formerly subjugated in colonial empires. Many practitioners take Edward Saïd's book Orientalism (1978) as the theory's founding work (although French theorists such as Aimé Césaire and Frantz Fanon made similar claims decades before Said).\n\nSaïd analyzed the works of Balzac, Baudelaire and Lautréamont arguing that they helped to shape a societal fantasy of European racial superiority. Writers of post-colonial fiction interact with the traditional colonial discourse, but modify or subvert it; for instance by retelling a familiar story from the perspective of an oppressed minor character in the story. Gayatri Chakravorty Spivak's Can the Subaltern Speak? (1998) gave its name to Subaltern Studies.\n\nIn A Critique of Postcolonial Reason (1999), Spivak argued that major works of European metaphysics (such as those of Kant and Hegel) not only tend to exclude the subaltern from their discussions, but actively prevent non-Europeans from occupying positions as fully human subjects. Hegel's Phenomenology of Spirit (1807), famous for its explicit ethnocentrism, considers Western civilization as the most accomplished of all, while Kant also had some traces of racialism in his work.\n\nColonial migrations\n\nNations and regions outside Europe with significant populations of European ancestry[https://www.cia.gov/library/publications/the-world-factbook/fields/2075.html Ethnic groups by country.] Statistics (where available) from CIA Factbook.\n\n*Africa (see Europeans in Africa)\n** South Africa (European South African): 9.6% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/sf.html#People South Africa: People: Ethnic Groups.] World Factbook of CIA\n** Namibia (European Namibians): 6% of the population, of which most are Afrikaans-speaking, in addition to a German-speaking minority.[https://www.cia.gov/library/publications/the-world-factbook/geos/wa.html#People Namibia: People: Ethnic Groups.] World Factbook of CIA\n\n** Réunion estimated to be approx. 25% of the population\n** Zimbabwe (Europeans in Zimbabwe)\n** Algeria (Pied-noir)\"[http://news.bbc.co.uk/2/hi/programmes/from_our_own_correspondent/5224244.stm Former settlers return to Algeria]\". BBC News. July 29, 2006.\n** Botswana[https://www.cia.gov/library/publications/the-world-factbook/geos/bc.html#People Botswana: People: Ethnic Groups.] World Factbook of CIA\n** Kenya (Europeans in Kenya)\n** Mauritius (Franco-Mauritian)\n** (European Moroccans)De Azevedo, Raimondo Cagiano (1994) [https://books.google.com/books?idN8VHizsqaH0C&pg\nPA25 Migration and development co-operation.]. Council of Europe. p. 25. .\n** Ivory Coast (French people)\"[http://countrystudies.us/ivory-coast/41.htm Ivory Coast - The Economy]\". Library of Congress Country Studies.\n** Senegal[https://www.state.gov/r/pa/ei/bgn/2862.htm Senegal], About 50,000 Europeans (mostly French) and Lebanese reside in Senegal, mainly in the cities.\n** Canary Islands (Spaniards), known as Canarians.\n** Seychelles (Franco-Seychellois)\n** Somalia (Italian Somalis)\n** Eritrea (Italian Eritreans)\n** Saint Helena (UK) including  Tristan da Cunha (UK): predominantly European.\n** Swaziland: 3% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/wz.html#People Swaziland: People: Ethnic Groups.] World Factbook of CIA\n** (European Tunisians)[http://www.encyclopedia.com/doc/1G2-2586700129.html Tunisia], Worldmark Encyclopedia of the Nations. Thomson Gale. 2007. Encyclopedia.com.\n\n*Asia\n** Siberia (Russians, Germans and Ukrainians)Fiona Hill, [http://www.theglobalist.com/printStoryId.aspx?StoryId=3727 Russia — Coming In From the Cold?] , The Globalist, 23 February 2004\"[http://www.everyculture.com/Russia-Eurasia-China/Siberian-Germans-Orientation.html Siberian Germans]\".\n** Kazakhstan (Russians in Kazakhstan, Germans of Kazakhstan): 30% of the population\"[https://books.google.com/books?idYLeAxHLmgR8C&pg\nPA15&dq&hlen#v\nonepage&q&f\nfalse Migrant resettlement in the Russian federation: reconstructing 'homes' and 'homelands']\". Moya Flynn. (1994). p.15.\n\n** Uzbekistan (Russians and other Slavs): 5.5% of the populationRobert Greenall, [http://news.bbc.co.uk/2/hi/asia-pacific/4420922.stm \"Russians left behind in Central Asia\"], BBC News, 23 November 2005.\n** Kyrgyzstan (Russians and other Slavs): 13.5% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/kg.html#People Kyrgyzstan: People: Ethnic Groups.] World Factbook of CIA\"[https://books.google.com/books?id\nXRXVbGwPgqIC&pgPA125&dq&hl\nen#vonepage&q\n&f=false The Kyrgyz – Children of Manas.]\". Petr Kokaisl, Pavla Kokaislova (2009). p. 125. .\n** Turkmenistan (Russians and other Slavs): 4% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/tx.html#People Turkmenistan: People: Ethnic Groups.] World Factbook of CIA\n** Tajikistan (Russians and other Slavs)[http://countrystudies.us/tajikistan/23.htm Tajikistan - Ethnic Groups]. Source: U.S. Library of Congress.\n** Hong KongHK Census. \"\n[http://www.censtatd.gov.hk/hong_kong_statistics/statistical_tables/index.jsp?htmlTableID139&excelID\n&chartID&tableID\n139&ID&subjectID\n1 HK Census].\" Statistical Table. Retrieved on 2007-03-08.\n** Philippines (Spanish Ancestry) 3% of the population\n** People's Republic of China (Russians in China)\n** Indian subcontinent (Anglo-Indians)\n*Latin America (see White Latin American) \n** Argentina (European Immigration to Argentina): 97% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/ar.html#People Argentina: People: Ethnic Groups.] World Factbook of CIA\n** Bolivia: 15% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/bl.html#People Bolivia: People: Ethnic Groups.] World Factbook of CIA\n** Brazil (White Brazilian): 47.3% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/br.html#People Brazil: People: Ethnic Groups.] World Factbook of CIA\n** Chile (White Chilean): 60%-70% of the population.[http://www.infoamerica.org/primera/lb_2011.pdf Informe Latinobarómetro 2011], Latinobarómetro (p. 58).[http://ukpmc.ac.uk/articles/PMC1050080 Genetic epidemiology of single gene defects in Chile.]\n** Colombia (White Colombian): 20% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/co.html#People Colombia: People: Ethnic Groups.] World Factbook of CIA\n** Costa Rica = 3.9 million whites and mestizos\n** Cuba (White Cuban): 65% of the population\n** Dominican Republic: 16% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/dr.html#People Dominican Republic: People: Ethnic groups.] World Factbook of CIA\n** Ecuador: 7% of the population\n** El Salvador: 12% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/es.html#People El Salvador: People: Ethnic Groups.] World Factbook of CIA\n** Mexico (White Mexican): 9% or ~17% of the population. and 70-80% more as Mestizos.\n[https://www.cia.gov/library/publications/the-world-factbook/geos/mx.html#People Mexico: People: Ethnic Groups.] World Factbook of CIA[http://www.britannica.com/EBchecked/topic/379167/Mexico Mexico - Britannica Online Encyclopedia]\n** Nicaragua: 17% of the population\n** Panama 10% of the population\n** Puerto Rico approx. 80% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/pm.html#People Puerto Rico: People: Ethnic Groups] World Factbook of CIA\n** Peru (European Peruvian): 15% of the population\n[https://www.cia.gov/library/publications/the-world-factbook/geos/pe.html#People Peru: People: Ethnic Groups.] World Factbook of CIA\n** Paraguay approx. 20% of the population[http://convergencia.uaemex.mx/rev38/38pdf/LIZCANO.pdf 8 LIZCANO] \n** Venezuela (White Venezuelan): 42.2% of the population[http://www.ine.gov.ve/CENSO2011/documentos/pdf/ResultadosBasicosCenso2011.pdf Resultado Basico del XIV Censo Nacional de Población y Vivienda 2011] (p. 14).\n** Uruguay: 88% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/uy.html#People Uruguay: People: Ethnic Groups.] World Factbook of CIA\n*Rest of the Americas\n** Bahamas: 12% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/bf.html#People Bahamas: People: Ethnic Groups.] World Factbook of CIA\n** Barbados (White Barbadian): 4% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/bb.html#People Barbados: People: Ethnic Groups.] World Factbook of CIA\n** Bermuda: 34.1% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/bd.html#People Bermuda: People: Ethnic Groups.] World Factbook of CIA\n** Canada: 80% of the population[http://www12.statcan.ca/census-recensement/2006/dp-pd/tbt/Rp-eng.cfm?LANGE&APATH\n3&DETAIL0&DIM\n0&FLA&FREE\n0&GC0&GID\n837928&GK0&GRP\n1&PID92334&PRID\n0&PTYPE88971,97154&S\n0&SHOWALL0&SUB\n0&Temporal2006&THEME\n80&VID0&VNAMEE\n&VNAMEF= Canadian Census 2006]\n** Falkland Islands, mostly of British descent.\n** French Guiana: 12% of the population[http://www.umsl.edu/services/govdocs/wofact2006/geos/fg.html#People French Guiana: People: Ethnic Groups.] World Factbook of CIA\n** Greenland: 12% of the population[http://www.stalvik.com/Engelska/laegreenland.htm Greenland]\n** Martinique: 5% of the population[http://www.umsl.edu/services/govdocs/wofact2003/geos/mb.html#People Martinique: People: Ethnic Groups.] World Factbook of CIA\n** Saint Barthélemy[http://www.cieux.com/stbarth/stbfact.html Fact Sheet on St. Barthélemy]\n** Trinidad and Tobago:[http://www.hawaii.edu/satocenter/langnet/definitions/trinidad.html Trinidad French Creole] 0.6% of the population\n** United States (European American): 72.4% of the population, including Hispanic and Non-Hispanic Whites.\n*Oceania (see Europeans in Oceania)\n** Australia: 89.3% of the population\n** New Zealand (New Zealand European): 78% of the population\n** New Caledonia (Caldoche): 34.5% of the population\n** French Polynesia: 10% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/fp.html#People French Polynesia: People: Ethnic Groups.] World Factbook of CIA\n** Hawaii: 24.7% of the population[http://factfinder2.census.gov/faces/tableservices/jsf/pages/productview.xhtml?pidDEC_10_DP_DPDP1&prodType\ntable American FactFinder - Results] \n** Christmas Island: approx. 20% of the population.\n** Guam: 6.9% of the population[https://www.cia.gov/library/publications/the-world-factbook/geos/gq.html#People Brazil: People: Ethnic Groups.] World Factbook of CIA\n** Norfolk Island: 50% of the population. Colonialism. http://en.wikipedia.org/?curid=7299."
  }
}
