{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14395",
  "eid" : "1442d260-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778543238,
  "textBody" : "Hummer was a brand of trucks and SUVs, first marketed in 1992 when AM General began selling a civilian version of the M998 Humvee. In 1998, General Motors (GM) purchased the brand name from AM General and marketed three vehicles: the original Hummer H1, based on the military Humvee, as well as the new H2 and H3 models that were based on smaller, civilian-market GM platforms.\n\nBy 2008, Hummer's viability in the economic downturn was being questioned, and it was placed under review by GM management. Rather than being transferred to the Motors Liquidation Company as part of the GM bankruptcy in 2009, the brand was retained by GM, in order to investigate its sale.\n\nIn 2009, a Chinese manufacturer, Sichuan Tengzhong Heavy Industrial Machinery Company, announced that it would acquire Hummer, pending government approvals, but later withdrew its bid. On February 24, 2010, Reuters reported that the Chinese ministry of commerce had prevented the deal, although a ministry spokesperson denied rejecting the application, which had been stalled for eight months. At the end of February, General Motors announced it would begin dismantling the Hummer brand.\n\nAlthough the automaker announced two days later that it had been approached with new offers, by April 2010, any sale became unlikely, as inventory was depleted and Hummer dealerships began shutting down. After filling a rental-car fleet order, the last Hummer H3 rolled off the line at Shreveport on May 24, 2010.\n\nThe original maker of Hummer, AM General, lost their bid to build the HMMWV's replacement for the U.S. military in 2015.\n\nHistory\n\nOrigin\n\nThe original Hummers were designed by AM General Corporation, a wholly owned subsidiary American Motors Corporation (AMC), and they were built in its Mishawaka, Indiana, assembly plant. The Humvee replaced the military Jeeps that were produced by AMC until 1982.\n\nIn 1979, the United States Army was seeking contractors for a new \"High Mobility Multi-Purpose Wheeled Vehicle\" which could follow the tracks and ruts of full size army trucks (HMMWV). At that time, General Dynamics, Teledyne, and Chrysler Defense had HMMWV designs under development. Among the four competitors for the contract, AM General designed an entirely new vehicle to meet the Army's requirements. In less than one year, it was the first to deliver a prototype vehicle. Initial production versions were delivered to the Army's proving grounds in April 1982.\n\nAfter testing was completed AM General was awarded the contract to supply its HMMWV to the United States armed forces. The first models were built in a variety of military-based equipment and versions. The first contract was in 1983, worth US$1.2 billion to produce 55,000 \"Humvees\" by 1985. The first production vehicle was assembled by AM General on January 2, 1985. The contract was later increased for an additional 15,000 units.\n\nAM General had planned to sell a civilian version of the Humvee as far back as the late 1980s. Having the same structure and most mechanical components, the civilian Hummers were finished in automotive gloss paint, adding passenger car enhancements such as air conditioning, sound insulation, upgraded upholstery, stereo systems, wood trim, and convenience packages. The civilian model began in part because of the persistence of Arnold Schwarzenegger, who saw an Army convoy while filming a movie.\n\nIn 1992, AM General began selling a civilian version of the M998 Humvee vehicle to the public under the brand name \"Hummer\".\n\nGM purchase\n\nIn December 1999, AM General sold the brand name to General Motors, but continued to manufacture the vehicles. GM was responsible for the marketing and distribution of all Hummers produced by AM General. Shortly thereafter, GM introduced two of its own design models, the H2 and H3, and renamed the original vehicle H1. AM General continued to build the H1 until it was discontinued in 2006, and was contracted by GM to produce the H2. The H3 was built in Shreveport, LA alongside the Chevrolet Colorado and GMC Canyon pickups, with which it shared the GMT-355 platform (modified and designated GMT-345). Hummer dealership buildings featured an oversized half Quonset Hut style roof, themed to the Hummer brand's military origins.\n\nBy 2006, the Hummer began to be exported and sold through importers and distributors in 33 countries. On October 10, 2006, GM began producing the Hummer H3 at its Port Elizabeth plant in South Africa for international markets. The Hummers built there at first were only left-hand drive, but right-hand drive versions were added and exported to Australia and other markets.\n\nThe H2 was also assembled in Kaliningrad, Russia, by Avtotor, starting in 2006 and ending in 2009. The plant produced a few hundred vehicles annually, and its output was limited to local consumption with five dealers in Russia.\n\nOn June 3, 2008, one day prior to GM's annual shareholder meeting, Rick Wagoner, GM's CEO at that time, said the brand was being reviewed, and had the possibility of either being sold, having the production line completely redesigned, or being discontinued. This was due to the decreasing demand for large SUVs as a result of higher oil prices. Almost immediately after the announcement, a pair of Indian automakers, including Mahindra & Mahindra, expressed interest in purchasing all or part of Hummer.\n\nIn April 2009, GM President Fritz Henderson stated several interested parties had approached GM regarding the Hummer business.\n\nFailed sale\n\nOn June 1, 2009, as a part of the General Motors bankruptcy announcement, the company revealed that the Hummer brand would be discontinued. However, the following day GM announced that instead it had reached a deal to sell the brand to an undisclosed buyer. After GM announced that same day that the sale was to an undisclosed Chinese company, CNN and the New York Times identified the buyer of the Hummer truck unit as China-based Sichuan Tengzhong Heavy Industrial Machinery Company Ltd. Later that day, Sichuan Tengzhong itself announced the deal on their own website.\n\nOn January 6, 2010, GM CEO Ed Whitacre said he hoped to close the deal with Tengzhong by the end of that month. On February 1, 2010, it was announced that Sichuan and General Motors had agreed to extend the deadline until the end of February as Sichuan tried to get approval by the Chinese government. It was also revealed that the price tag of the Hummer brand was $150 million.\n\nLater, on February 24, 2010, GM announced the Tengzhong deal had collapsed and the Hummer brand would soon shut down. There were reports that Sichuan Tengzhong might pursue the purchase of the Hummer brand from GM by purchasing it privately through the company's new J&A Tengzhong Fund SPC, a private equity investment fund owned by an offshore entity that was recruiting private investors to buy into its acquisition plan. The financial markets posed problems for established borrowers and even more for Tengzhong, a little-known company from western China, at the same time as the potential value of the Hummer brand continued to decline given high fuel prices and weak consumer demand.\n\nThe company announced it was willing to consider offers for all or part of the assets. American company Raser Technologies along with several others expressed interest in buying the company. However, on April 7, 2010, this attempt failed as well, and General Motors officially said it was shutting down the Hummer SUV brand and offering rich rebates in a bid to move the remaining 2,200 vehicles.\n\nModels\n\nHummer H1\n\nThe first vehicle in the Hummer range was the Hummer H1, based on the Humvee. Originally released in 1992, this vehicle was designed by American Motors' AM General subsidiary for the U.S. Military. Five years previously, AMC had been bought by Chrysler.\n\nHummer H2\n\nThe Hummer H2 was the second vehicle in the Hummer range. There were two variations: The H2 SUV and H2 SUT.\n\nHummer H3\n\nThe H3 and H3T truck were the smallest of the Hummer models and were based on the GMT355 platform shared with the Chevrolet Colorado and GMC Canyon compact pickup trucks.\n\nConcept vehicles\n\nHummer HX\n\nThe Hummer HX was developed in 2008 as an open-air, two-door off-road concept car, smaller than other Hummer models.\n\nPlug-in hybrid\n\nRaser Technologies (formerly of Utah) was to use technology similar to that in the Chevrolet Volt. The company unveiled the prototype to the 2009 Society of Automotive Engineers World Congress in Detroit. The E-REV (Extended-Range Electric Vehicle) powertrain technology, was claimed to power the vehicle for up to 40 mi on its battery, and then a small 4-cylinder internal combustion engine would start to generate more electricity.\n\nRacing\n\nTeam Hummer Racing was created in 1993. Led by off-road racer Rod Hall, Team Hummer competed in the stock classes of both BitD and SCORE, with specialized racing shock absorbers, tires, and other modifications, along with mandatory safety equipment. Team Hummer stock-class H3 driven by Hall finished first in class with the H3 in the 2005 Baja 1000. Team Hummer earned 11 production-class wins at the Baja 1000.\n\nA highly modified, two-wheel drive Hummer was raced by Robby Gordon in the 2006 (did not finish), 2007 (8th place), 2009 (3rd place), 2010 (8th place), 2011 (did not finish), 2012 (disqualified), and 2013 (14th place) Dakar Rally.\n\nStretch limousines \n\nThe popularity of the H2 Hummer with the general public created a demand for a large scale production of a stretched limousine version.  The H2 Hummer was cut behind the cab and the chassis extended to create a passenger section for 14, 16 or even 22 passengers.  The demand initially was for clients in the United States but quickly became popular in the UK and especially Australia. The limousine hire industry have adapted the all terrain vehicle to become a social vehicle to celebrate events. Although not in mass production since 2010, these vehicles are still modified and engineered by private manufacturers worldwide. \n\nProduction\n\n*AM General Hummer H1 Assembly Plant, Mishawaka, Indiana – 500000 sqft opened 1984 to build HMMWV (HUMVEE) and began production of the H1 in 1992. Production ceased 2006.\n*AM General Hummer H2 Assembly Plant, Mishawaka, Indiana – 673000 sqft opened 2002. H2 production ended 2009.\n*General Motors South Africa Struandale Assembly Plant, Port Elizabeth, Eastern Cape, South Africa – built in 1996, expanded to 75625 sqm to build H3 models. H3 production ended 2009.\n*General Motors Shreveport Operations, Shreveport, Louisiana – in 2005, to accommodate the production of the H3, an additional 296000 sqft was added to plant built by GM in 1981. In July 2009, GM had shut down Hummer production of the H3, but the automaker had a special fleet order from Avis Rent a Car System.\n*Avtotor Kaliningrad, Russia – licensed version of H2 starting from 2006 and production ended in 2009.\n\nCriticisms\n\nCriticism of Hummers mirrors the criticism of SUVs in general, but to a higher degree. Specific criticisms of Hummers include:\n\n;Size: Hummers (specifically the H1 and H2) are significantly bigger than other SUVs; this can cause problems parking, driving and fitting in a garage. Their large size may also pose a serious threat to smaller vehicles.\n\n;Poor fuel economy: Even compared to other heavy passenger vehicles, Hummers without the diesel engine options have very poor fuel economy. Because the H2 is built to the over-8500-lb GVW class, its fuel economy is neither published by the U.S. EPA nor counted toward Corporate Average Fuel Economy. For example, H2 in one engine configuration averages an estimated 14 mpgus on the highway and 10 mpgus in the city. It has a curb weight of around 6400 lb.\n\n;Safety: Crash data for Hummers is less complete than for other SUVs. As a Class 3 truck, the Hummer is exempt from many DOT safety regulations. The H1 lacks standard safety features, including child safety locks, child seat tethers, side air bags, and stability control. Large blind spots make parking difficult and possibly dangerous.\n\n;Drivers: A one-year study, conducted by a firm that provides statistical information to insurance companies, found that drivers of H2 and H3 Hummers receive about five times as many traffic tickets as the national average for all vehicles (standardized based on the number of violations per 100,000 miles driven).\n\nLicensing\n\nGM is active in licensing the Hummer. Various companies have licensed the Hummer trademarks for use on colognes, flashlights, bicycles, shoes, coats, hats, laptops, toys, clothing, CD players, and other items. An electric quadricycle badged as a Hummer is  produced in the UK.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hummer" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14395" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hummer was a brand of trucks and SUVs, first marketed in 1992 when AM General began selling a civilian version of the M998 Humvee. In 1998, General Motors (GM) purchased the brand name from AM General and marketed three vehicles: the original Hummer H1, based on the military Humvee, as well as the new H2 and H3 models that were based on smaller, civilian-market GM platforms.\n\nBy 2008, Hummer's viability in the economic downturn was being questioned, and it was placed under review by GM management. Rather than being transferred to the Motors Liquidation Company as part of the GM bankruptcy in 2009, the brand was retained by GM, in order to investigate its sale.\n\nIn 2009, a Chinese manufacturer, Sichuan Tengzhong Heavy Industrial Machinery Company, announced that it would acquire Hummer, pending government approvals, but later withdrew its bid. On February 24, 2010, Reuters reported that the Chinese ministry of commerce had prevented the deal, although a ministry spokesperson denied rejecting the application, which had been stalled for eight months. At the end of February, General Motors announced it would begin dismantling the Hummer brand.\n\nAlthough the automaker announced two days later that it had been approached with new offers, by April 2010, any sale became unlikely, as inventory was depleted and Hummer dealerships began shutting down. After filling a rental-car fleet order, the last Hummer H3 rolled off the line at Shreveport on May 24, 2010.\n\nThe original maker of Hummer, AM General, lost their bid to build the HMMWV's replacement for the U.S. military in 2015.\n\nHistory\n\nOrigin\n\nThe original Hummers were designed by AM General Corporation, a wholly owned subsidiary American Motors Corporation (AMC), and they were built in its Mishawaka, Indiana, assembly plant. The Humvee replaced the military Jeeps that were produced by AMC until 1982.\n\nIn 1979, the United States Army was seeking contractors for a new \"High Mobility Multi-Purpose Wheeled Vehicle\" which could follow the tracks and ruts of full size army trucks (HMMWV). At that time, General Dynamics, Teledyne, and Chrysler Defense had HMMWV designs under development. Among the four competitors for the contract, AM General designed an entirely new vehicle to meet the Army's requirements. In less than one year, it was the first to deliver a prototype vehicle. Initial production versions were delivered to the Army's proving grounds in April 1982.\n\nAfter testing was completed AM General was awarded the contract to supply its HMMWV to the United States armed forces. The first models were built in a variety of military-based equipment and versions. The first contract was in 1983, worth US$1.2 billion to produce 55,000 \"Humvees\" by 1985. The first production vehicle was assembled by AM General on January 2, 1985. The contract was later increased for an additional 15,000 units.\n\nAM General had planned to sell a civilian version of the Humvee as far back as the late 1980s. Having the same structure and most mechanical components, the civilian Hummers were finished in automotive gloss paint, adding passenger car enhancements such as air conditioning, sound insulation, upgraded upholstery, stereo systems, wood trim, and convenience packages. The civilian model began in part because of the persistence of Arnold Schwarzenegger, who saw an Army convoy while filming a movie.\n\nIn 1992, AM General began selling a civilian version of the M998 Humvee vehicle to the public under the brand name \"Hummer\".\n\nGM purchase\n\nIn December 1999, AM General sold the brand name to General Motors, but continued to manufacture the vehicles. GM was responsible for the marketing and distribution of all Hummers produced by AM General. Shortly thereafter, GM introduced two of its own design models, the H2 and H3, and renamed the original vehicle H1. AM General continued to build the H1 until it was discontinued in 2006, and was contracted by GM to produce the H2. The H3 was built in Shreveport, LA alongside the Chevrolet Colorado and GMC Canyon pickups, with which it shared the GMT-355 platform (modified and designated GMT-345). Hummer dealership buildings featured an oversized half Quonset Hut style roof, themed to the Hummer brand's military origins.\n\nBy 2006, the Hummer began to be exported and sold through importers and distributors in 33 countries. On October 10, 2006, GM began producing the Hummer H3 at its Port Elizabeth plant in South Africa for international markets. The Hummers built there at first were only left-hand drive, but right-hand drive versions were added and exported to Australia and other markets.\n\nThe H2 was also assembled in Kaliningrad, Russia, by Avtotor, starting in 2006 and ending in 2009. The plant produced a few hundred vehicles annually, and its output was limited to local consumption with five dealers in Russia.\n\nOn June 3, 2008, one day prior to GM's annual shareholder meeting, Rick Wagoner, GM's CEO at that time, said the brand was being reviewed, and had the possibility of either being sold, having the production line completely redesigned, or being discontinued. This was due to the decreasing demand for large SUVs as a result of higher oil prices. Almost immediately after the announcement, a pair of Indian automakers, including Mahindra & Mahindra, expressed interest in purchasing all or part of Hummer.\n\nIn April 2009, GM President Fritz Henderson stated several interested parties had approached GM regarding the Hummer business.\n\nFailed sale\n\nOn June 1, 2009, as a part of the General Motors bankruptcy announcement, the company revealed that the Hummer brand would be discontinued. However, the following day GM announced that instead it had reached a deal to sell the brand to an undisclosed buyer. After GM announced that same day that the sale was to an undisclosed Chinese company, CNN and the New York Times identified the buyer of the Hummer truck unit as China-based Sichuan Tengzhong Heavy Industrial Machinery Company Ltd. Later that day, Sichuan Tengzhong itself announced the deal on their own website.\n\nOn January 6, 2010, GM CEO Ed Whitacre said he hoped to close the deal with Tengzhong by the end of that month. On February 1, 2010, it was announced that Sichuan and General Motors had agreed to extend the deadline until the end of February as Sichuan tried to get approval by the Chinese government. It was also revealed that the price tag of the Hummer brand was $150 million.\n\nLater, on February 24, 2010, GM announced the Tengzhong deal had collapsed and the Hummer brand would soon shut down. There were reports that Sichuan Tengzhong might pursue the purchase of the Hummer brand from GM by purchasing it privately through the company's new J&A Tengzhong Fund SPC, a private equity investment fund owned by an offshore entity that was recruiting private investors to buy into its acquisition plan. The financial markets posed problems for established borrowers and even more for Tengzhong, a little-known company from western China, at the same time as the potential value of the Hummer brand continued to decline given high fuel prices and weak consumer demand.\n\nThe company announced it was willing to consider offers for all or part of the assets. American company Raser Technologies along with several others expressed interest in buying the company. However, on April 7, 2010, this attempt failed as well, and General Motors officially said it was shutting down the Hummer SUV brand and offering rich rebates in a bid to move the remaining 2,200 vehicles.\n\nModels\n\nHummer H1\n\nThe first vehicle in the Hummer range was the Hummer H1, based on the Humvee. Originally released in 1992, this vehicle was designed by American Motors' AM General subsidiary for the U.S. Military. Five years previously, AMC had been bought by Chrysler.\n\nHummer H2\n\nThe Hummer H2 was the second vehicle in the Hummer range. There were two variations: The H2 SUV and H2 SUT.\n\nHummer H3\n\nThe H3 and H3T truck were the smallest of the Hummer models and were based on the GMT355 platform shared with the Chevrolet Colorado and GMC Canyon compact pickup trucks.\n\nConcept vehicles\n\nHummer HX\n\nThe Hummer HX was developed in 2008 as an open-air, two-door off-road concept car, smaller than other Hummer models.\n\nPlug-in hybrid\n\nRaser Technologies (formerly of Utah) was to use technology similar to that in the Chevrolet Volt. The company unveiled the prototype to the 2009 Society of Automotive Engineers World Congress in Detroit. The E-REV (Extended-Range Electric Vehicle) powertrain technology, was claimed to power the vehicle for up to 40 mi on its battery, and then a small 4-cylinder internal combustion engine would start to generate more electricity.\n\nRacing\n\nTeam Hummer Racing was created in 1993. Led by off-road racer Rod Hall, Team Hummer competed in the stock classes of both BitD and SCORE, with specialized racing shock absorbers, tires, and other modifications, along with mandatory safety equipment. Team Hummer stock-class H3 driven by Hall finished first in class with the H3 in the 2005 Baja 1000. Team Hummer earned 11 production-class wins at the Baja 1000.\n\nA highly modified, two-wheel drive Hummer was raced by Robby Gordon in the 2006 (did not finish), 2007 (8th place), 2009 (3rd place), 2010 (8th place), 2011 (did not finish), 2012 (disqualified), and 2013 (14th place) Dakar Rally.\n\nStretch limousines \n\nThe popularity of the H2 Hummer with the general public created a demand for a large scale production of a stretched limousine version.  The H2 Hummer was cut behind the cab and the chassis extended to create a passenger section for 14, 16 or even 22 passengers.  The demand initially was for clients in the United States but quickly became popular in the UK and especially Australia. The limousine hire industry have adapted the all terrain vehicle to become a social vehicle to celebrate events. Although not in mass production since 2010, these vehicles are still modified and engineered by private manufacturers worldwide. \n\nProduction\n\n*AM General Hummer H1 Assembly Plant, Mishawaka, Indiana – 500000 sqft opened 1984 to build HMMWV (HUMVEE) and began production of the H1 in 1992. Production ceased 2006.\n*AM General Hummer H2 Assembly Plant, Mishawaka, Indiana – 673000 sqft opened 2002. H2 production ended 2009.\n*General Motors South Africa Struandale Assembly Plant, Port Elizabeth, Eastern Cape, South Africa – built in 1996, expanded to 75625 sqm to build H3 models. H3 production ended 2009.\n*General Motors Shreveport Operations, Shreveport, Louisiana – in 2005, to accommodate the production of the H3, an additional 296000 sqft was added to plant built by GM in 1981. In July 2009, GM had shut down Hummer production of the H3, but the automaker had a special fleet order from Avis Rent a Car System.\n*Avtotor Kaliningrad, Russia – licensed version of H2 starting from 2006 and production ended in 2009.\n\nCriticisms\n\nCriticism of Hummers mirrors the criticism of SUVs in general, but to a higher degree. Specific criticisms of Hummers include:\n\n;Size: Hummers (specifically the H1 and H2) are significantly bigger than other SUVs; this can cause problems parking, driving and fitting in a garage. Their large size may also pose a serious threat to smaller vehicles.\n\n;Poor fuel economy: Even compared to other heavy passenger vehicles, Hummers without the diesel engine options have very poor fuel economy. Because the H2 is built to the over-8500-lb GVW class, its fuel economy is neither published by the U.S. EPA nor counted toward Corporate Average Fuel Economy. For example, H2 in one engine configuration averages an estimated 14 mpgus on the highway and 10 mpgus in the city. It has a curb weight of around 6400 lb.\n\n;Safety: Crash data for Hummers is less complete than for other SUVs. As a Class 3 truck, the Hummer is exempt from many DOT safety regulations. The H1 lacks standard safety features, including child safety locks, child seat tethers, side air bags, and stability control. Large blind spots make parking difficult and possibly dangerous.\n\n;Drivers: A one-year study, conducted by a firm that provides statistical information to insurance companies, found that drivers of H2 and H3 Hummers receive about five times as many traffic tickets as the national average for all vehicles (standardized based on the number of violations per 100,000 miles driven).\n\nLicensing\n\nGM is active in licensing the Hummer. Various companies have licensed the Hummer trademarks for use on colognes, flashlights, bicycles, shoes, coats, hats, laptops, toys, clothing, CD players, and other items. An electric quadricycle badged as a Hummer is  produced in the UK. Hummer. http://en.wikipedia.org/?curid=14395."
  }
}
