{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16853",
  "eid" : "2915c8f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778578175,
  "textBody" : "The Kitáb-i-Aqdas or Aqdas is the central book of the Bahá'í Faith written by Bahá'u'lláh, the founder of the religion, in 1873.Saiedi, 2000, pp. 224-235. The work was written in Arabic under the Arabic title ' (), but it is commonly referred to by its Persian title, Kitáb-i-Aqdas (), which was given to the work by Bahá'u'lláh himself. It is sometimes also referred to as  \"the Most Holy Book\", \"the Book of Laws\" or the Book of Aqdas. The word Aqdas has a significance in many languages as the superlative form of a word with its primary letters Q-D-Š.\n\nBahá'u'lláh had manuscript copies sent to Bahá'ís in Iran some years after the revelation of the Kitáb-i-Aqdas in 1873, and in 1890–91 (1308 AH, 47 BE) he arranged for the publication of the original Arabic text of the book in Bombay, India.\n\nThe Aqdas is referred to as \"the Mother-Book\" of the Bahá'í teachings, and the \"Charter of the future world civilization\". It is not, however, only a 'book of laws': much of the content deals with other matters, notably ethical exhortations and addresses to various individuals, groups, and places. The Aqdas also discusses the establishment of Bahá'í administrative institutions, Bahá'í religious practices, mysticism, laws of personal status, criminal law, spiritual and ethical exhortations, social principles, miscellaneous laws and abrogations, and prophecies.\n\nGradual implementation \n\nBahá'u'lláh stated that the observance of the laws that he prescribed should be subject to \"tact and wisdom\", and that they do not cause \"disturbance and dissension.\" Bahá'u'lláh thus provided for the progressive application of his laws; for example certain Bahá'í laws are only applicable to Middle Eastern Bahá'ís such as the limit to the period of engagement, while any Bahá'í may practice the laws if they so decide. Shoghi Effendi also stated that certain other laws, such as criminal laws, that are dependent upon the existence of a predominantly Bahá'í society would only be applicable in a possible future Bahá'í society. He also stated that if the laws were in conflict with the civil law of the country where a Bahá'í  lives the laws could not be practiced. Furthermore, some laws and teachings are, according to Bahá'í teaching, not meant to be applied at the present time and their application depends on decisions by the Universal House of Justice. Baha'is believe the Aqdas supersedes and succeeds previous revelations such as the Quran and the Bible.[http://www.sacred-texts.com/bhi/aqdas.htm The Aqdas; Universal House of Justice] A DESCRIPTION OF THE AQDAS BY SHOGHI EFFENDI\n\nForm and style \n\nThe text of the Kitáb-i-Aqdas consists of several hundred verses, which have been grouped in 189 numbered paragraphs in the English translation most of which are just a few sentences. The style combines elements of both poetry (shi'r) and rhymed prose (saj) and the text contains instances of literary devices like alliteration, assonance, repetition, onomatopoeia, juxtaposition and antithesis, metaphors, alternation of person and personification. Many of these can be only imperfectly reproduced in English.\n\nRegardless, the delivery results in brief and clear statements even if the meanings can be complex. Rules and principles are interspersed and guide interpretation, and authority and limits for authorized interpretation are also specified. It defines a Bahá'í Administration as part of the Covenant of Bahá'u'lláh, and also speaks to the individual reader, as there are no clergy in the religion to rely on for guidance. The text also moves between statements said to be plain and statements suggesting the key to understanding the book is to look at the text for clues to itself. Some statements reflect on the teachings in the religion on various themes and underscore a relationship of the Aqdas as a 'motherhood' in relation to all the other scriptural works and they to it. It also relates to scriptures of other religions by abrogation, explanation, affirmation or reformation — an example of progressive revelation as a principle of the religion. While it is the core text on laws of the religion, it is not the exclusive source of laws in the religion, nor of Bahá'u'lláh's own writings, and complementarily the reader is told explicitly to not view the text as a \"mere code of laws\".\n\nTranslations \n\nThe Kitáb-i-Aqdas was completed by Bahá'u'lláh in 1873. It was published in the Arabic for circulation among Bahá'ís speaking the language circa 1890. A Russian translation was undertaken by Alexander Tumansky in 1899 and was his most important contribution to Bahá'í studies. Around 1900 an informal English translation was made by Bahá'í Anton Haddad, which circulated among the early American Bahá'í community in a typewritten form. In 1961, an English scholar of Arabic, Dr. Earl E. Elder, and William McElwee Miller, an openly hostile Christian minister, published an English translation, \"Al-Kitab Al-Aqdas\", through the Royal Asiatic Society, however its translation of the notes section was problematic and overall lacked \"poetic sensibility, and skill in Arabic translation\". Indeed, Miller only ever used it to further his polemical agenda. In 1973 a \"Synopsis and Codification\" of the book was published in English by the Universal House of Justice,[http://bahai-library.com/bahaullah_synopsis_codification Synopsis and Codification of the Laws and Ordinances of the Kitáb-i-Aqdas by Bahá'u'lláh and Shoghi Effendi], Baha'i World Center, 1973 with 21 passages of the Aqdas that had already been translated into English by Shoghi Effendi with additional terse lists of laws and ordinances contained in the book outside of any contextual prose. Finally, in 1992, a full and authorized Bahá'í translation in English was published.See also the [http://bahai-library.com/bahaullah_kitab_aqdas_multilinear Kitab-i-Aqdas Multilinear Translation project]. This version is used as the basis of translation into many other languages highlighting the practice of an indirect translation and how the purpose of the translation affects the act of translation.  The Bahá'í Library Online provides a side-by-side comparison of the authorized translation with earlier translations of Anton Haddad and Earl Elder.\n\nContent \n\nThe Kitáb-i-Aqdas is supplemented by the \n*\"Questions and Answers\"', which consists of 107 questions submitted to Bahá'u'lláh by Zaynu'l-Muqarrabin concerning the application of the laws and Bahá'u'lláh's replies to those questions\n*\"Some Texts Revealed by Bahá'u'lláh\"\n*Synopsis and Codification of the Laws and Ordinances, prepared by Shoghi Effendi\n*explanatory notes prepared by the Universal House of Justice\n\nThe book was divided into six main themes in the Synopsis and Codification by Shoghi Effendi:\n#The appointment of `Abdu'l-Bahá as the successor of Bahá'u'lláh\n#Anticipation of the Institution of the Guardianship\n#The Institution of the Universal House of Justice\n#Laws, Ordinances and exhortations\n#Specific admonitions, reproofs and warnings\n#Miscellaneous subjects\n\nFurther, the laws were divided into four categories:\nA. Prayer\nB. Fasting\nC. Laws of personal status\nD. Miscellaneous laws, ordinances and exhortations\n\nThemes\n\nScholarly review finds the Aqdas has themes of laws of worship, societal relations and administrative organization, or governance, of the religion. It also has strong themes of internationalism and addresses a need of humanity to mature - criticizing religious hierarchies, emphasizing inter-religious dialogue and unity, and international standards; things others at the time thought lacked practical application and seemed only utopian in the era it was published. The basics of the rules of successorship are set forth with enough clarity that the religion has avoided significant schism. Through the authority vested in `Abdu'l-Bahá in the Aqdas there is an expanse of internationalism related to the law in works like The Secret of Divine Civilization and through his extended authority to Shoghi Effendi works like his World Order of Bahá'u'lláh further elaborates on the internationalism theme. This stands in some distinction from other scriptures by not using triumphal tones as the voice of God is given to be viewed but rather one of progressive development, social context, and outright delay in application until another day. Indeed, it insists that divine law is applicable only in situations with requisite conditions, where it is likely to have certain social effects. The goal of application of the law and its methods are not to cause disturbance and dissension and requires an appreciation for context and intention. Additionally one is to eschew emphasis in the development of textualist and intentionalist arguments about the law though some of this is visible in scholarship on the Aqdas. Such methods of application of law in a religious context are common in Islam and Judaism.\n\nThe Aqdas is understood by Bahá'ís to be a factor in the process of ongoing developments in world order. This can be seen comparing the Bahá'í approach to history and the future to that of the theory of The Clash of Civilizations on the one hand and the development of a posthegemony system on the other (compared with work of Robert Cox, for example, in Approaches to World Order, (Robert Cox & Timonthy Sinclair eds, Cambridge University Press, 1996).)\n\nCertain possible sources of law are specifically abrogated: laws of the Bábí religion, notably in the Persian Bayán, oral traditions (linked with pilgrim notes, and natural law, (that is to say God's sovereign will through revelation is the independent authority.) Divine revelation's law-making is both unconditioned in terms of the divine right to choose, and conditioned in the sense of the progress of history from one revelation to the next.\n\nLaws\n\nSome laws and teachings of the Kitáb-i-Aqdas are, according to Bahá'í teaching, not meant to be applied at the present time; their application depends on decisions by the Universal House of Justice. See also Bahá'í laws for laws in practice in Bahá'í communities.  In reference to the laws of his revelation Baha'u'llah writes in paragraph 3 the following, \"O ye peoples of the World! Know assuredly that My commandments are the lamps of my loving providence among My servants, and the keys of My mercy for My creatures. Thus hath it been sent down from the heaven of the Will of your Lord, the Lord of Revelation. Were any man to taste the sweetness of the words which the lips of the All-Merciful have willed to utter, he would, though the treasures of the earth be in his possession, renounce them one and all, that he might vindicate the truth of even one of His commandments, shining above the Dayspring of His bountiful care and loving-kindness.\"\n\nAdministration\n\nThe institutional status of the authority of `Abdu'l-Bahá and a House of Justice are specifically delineated. On the basis of the authority granted `Abdu'l-Bahá he extended forms of the authority vested in him to the Guardianship, whose sole member was Shoghi Effendi, and the Universal, or International, House of Justice through his Will and Testament. This was confirmed and amplified in other texts, notably the Kitáb-i-`Ahd. The Universal House of Justice is specifically empowered to write and rescind any laws it is felt necessary aside from those of the text of scripture and actual application of the laws of the Aqdas among Bahá'ís are dependent on the choice of the Universal House of Justice.\n\nPrayer\n\nBahá'ís between 15 and 70 years of age are to perform a daily obligatory prayer, and can choose daily from among three, all of which are accompanied by specific rites, and preceded by ablutions. During the obligatory prayer Bahá'ís face the Qiblih, which is the Shrine of Bahá'u'lláh in Bahjí, Israel. People are exempt from the obligatory prayers when ill, in danger, or women during their menstrual cycles.\n\nCongregational prayer is forbidden, except for the case of the Prayer for the Dead.\n\nFasting\n\nThe Bahá'í fast is observed from sunrise to sunset in the Bahá'í month of `Alá' from 2 March through 20 March. During this time Bahá'ís in good health between the ages of 15 and 70 abstain from eating and drinking.  Exemptions to the fast are given to people who are travelling, ill, pregnant, nursing, menstruating, or engaged in heavy labour.  Vowing to fast outside of the prescribed fasting period is permissible, and encouraged when done for the benefit of mankind.\n\nLaws of personal status\n\nMarriage and divorce\n\nBaha'u'llah's statements about marriage in the Kitáb-i-Aqdas are brief. Marriage is highly recommended but is stated to not be obligatory. Bahá'u'lláh states that the maximum number of wives is two, but also states that having only one wife would add more tranquility to both partners. These statements were later interpreted by `Abdu'l-Bahá that having a second wife is conditional upon treating both wives with justice and equality and was not possible in practice, thus establishing monogamy.\n\nThat Bahá'u'lláh had three wives, while his religion teaches monogamy, which has been the subject of criticism. The writing of the Kitáb-i-Aqdas and Bahá'í teachings on gender equality and monogamy post-date Bahá'u'lláh's marriages and are understood to be evolutionary in nature, slowly leading Bahá'ís away from what had been a deeply rooted cultural practice.\n\nBahá'ís need to be at least 15 years of age to get married, and the consent of all living biological parents is needed to get married. Marriage is also conditioned a payment of dowry by the husband to the wife of approximately  of gold or silver dependent on the permanent residence of the husband. The Kitáb-i-Aqdas allows a man to marry two wives under the condition that they be treated equally. Later, `Abdu'l-Bahá and Shoghi Effendi clarified that monogamy was the intent of the paragraph.\n\nDivorce is permitted, although discouraged, and is granted after a year of separation if the couple is unable to reconcile their differences.\n\nThe Baha'i Universal House of Justice is to levy fines against men and women for adultery, payable in gold.\n\nInheritance\n\nIn the Kitáb-i-Aqdas it is stated that all Bahá'ís must write a will. The other Bahá’í laws of inheritance in the Kitáb-i-Aqdas apply only in case of intestacy, that is, when the individual dies without leaving a will. The system of inheritance provides for distribution of the deceased's estate among seven categories of heirs: children, spouse, father, mother, brothers, sisters, and teachers with higher categories obtaining a larger share. In cases where some of the categories of heirs does not exist the share falls partly to the children and the Local Spiritual Assembly.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kitáb-i-Aqdas" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16853" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Kitáb-i-Aqdas or Aqdas is the central book of the Bahá'í Faith written by Bahá'u'lláh, the founder of the religion, in 1873.Saiedi, 2000, pp. 224-235. The work was written in Arabic under the Arabic title ' (), but it is commonly referred to by its Persian title, Kitáb-i-Aqdas (), which was given to the work by Bahá'u'lláh himself. It is sometimes also referred to as  \"the Most Holy Book\", \"the Book of Laws\" or the Book of Aqdas. The word Aqdas has a significance in many languages as the superlative form of a word with its primary letters Q-D-Š.\n\nBahá'u'lláh had manuscript copies sent to Bahá'ís in Iran some years after the revelation of the Kitáb-i-Aqdas in 1873, and in 1890–91 (1308 AH, 47 BE) he arranged for the publication of the original Arabic text of the book in Bombay, India.\n\nThe Aqdas is referred to as \"the Mother-Book\" of the Bahá'í teachings, and the \"Charter of the future world civilization\". It is not, however, only a 'book of laws': much of the content deals with other matters, notably ethical exhortations and addresses to various individuals, groups, and places. The Aqdas also discusses the establishment of Bahá'í administrative institutions, Bahá'í religious practices, mysticism, laws of personal status, criminal law, spiritual and ethical exhortations, social principles, miscellaneous laws and abrogations, and prophecies.\n\nGradual implementation \n\nBahá'u'lláh stated that the observance of the laws that he prescribed should be subject to \"tact and wisdom\", and that they do not cause \"disturbance and dissension.\" Bahá'u'lláh thus provided for the progressive application of his laws; for example certain Bahá'í laws are only applicable to Middle Eastern Bahá'ís such as the limit to the period of engagement, while any Bahá'í may practice the laws if they so decide. Shoghi Effendi also stated that certain other laws, such as criminal laws, that are dependent upon the existence of a predominantly Bahá'í society would only be applicable in a possible future Bahá'í society. He also stated that if the laws were in conflict with the civil law of the country where a Bahá'í  lives the laws could not be practiced. Furthermore, some laws and teachings are, according to Bahá'í teaching, not meant to be applied at the present time and their application depends on decisions by the Universal House of Justice. Baha'is believe the Aqdas supersedes and succeeds previous revelations such as the Quran and the Bible.[http://www.sacred-texts.com/bhi/aqdas.htm The Aqdas; Universal House of Justice] A DESCRIPTION OF THE AQDAS BY SHOGHI EFFENDI\n\nForm and style \n\nThe text of the Kitáb-i-Aqdas consists of several hundred verses, which have been grouped in 189 numbered paragraphs in the English translation most of which are just a few sentences. The style combines elements of both poetry (shi'r) and rhymed prose (saj) and the text contains instances of literary devices like alliteration, assonance, repetition, onomatopoeia, juxtaposition and antithesis, metaphors, alternation of person and personification. Many of these can be only imperfectly reproduced in English.\n\nRegardless, the delivery results in brief and clear statements even if the meanings can be complex. Rules and principles are interspersed and guide interpretation, and authority and limits for authorized interpretation are also specified. It defines a Bahá'í Administration as part of the Covenant of Bahá'u'lláh, and also speaks to the individual reader, as there are no clergy in the religion to rely on for guidance. The text also moves between statements said to be plain and statements suggesting the key to understanding the book is to look at the text for clues to itself. Some statements reflect on the teachings in the religion on various themes and underscore a relationship of the Aqdas as a 'motherhood' in relation to all the other scriptural works and they to it. It also relates to scriptures of other religions by abrogation, explanation, affirmation or reformation — an example of progressive revelation as a principle of the religion. While it is the core text on laws of the religion, it is not the exclusive source of laws in the religion, nor of Bahá'u'lláh's own writings, and complementarily the reader is told explicitly to not view the text as a \"mere code of laws\".\n\nTranslations \n\nThe Kitáb-i-Aqdas was completed by Bahá'u'lláh in 1873. It was published in the Arabic for circulation among Bahá'ís speaking the language circa 1890. A Russian translation was undertaken by Alexander Tumansky in 1899 and was his most important contribution to Bahá'í studies. Around 1900 an informal English translation was made by Bahá'í Anton Haddad, which circulated among the early American Bahá'í community in a typewritten form. In 1961, an English scholar of Arabic, Dr. Earl E. Elder, and William McElwee Miller, an openly hostile Christian minister, published an English translation, \"Al-Kitab Al-Aqdas\", through the Royal Asiatic Society, however its translation of the notes section was problematic and overall lacked \"poetic sensibility, and skill in Arabic translation\". Indeed, Miller only ever used it to further his polemical agenda. In 1973 a \"Synopsis and Codification\" of the book was published in English by the Universal House of Justice,[http://bahai-library.com/bahaullah_synopsis_codification Synopsis and Codification of the Laws and Ordinances of the Kitáb-i-Aqdas by Bahá'u'lláh and Shoghi Effendi], Baha'i World Center, 1973 with 21 passages of the Aqdas that had already been translated into English by Shoghi Effendi with additional terse lists of laws and ordinances contained in the book outside of any contextual prose. Finally, in 1992, a full and authorized Bahá'í translation in English was published.See also the [http://bahai-library.com/bahaullah_kitab_aqdas_multilinear Kitab-i-Aqdas Multilinear Translation project]. This version is used as the basis of translation into many other languages highlighting the practice of an indirect translation and how the purpose of the translation affects the act of translation.  The Bahá'í Library Online provides a side-by-side comparison of the authorized translation with earlier translations of Anton Haddad and Earl Elder.\n\nContent \n\nThe Kitáb-i-Aqdas is supplemented by the \n*\"Questions and Answers\"', which consists of 107 questions submitted to Bahá'u'lláh by Zaynu'l-Muqarrabin concerning the application of the laws and Bahá'u'lláh's replies to those questions\n*\"Some Texts Revealed by Bahá'u'lláh\"\n*Synopsis and Codification of the Laws and Ordinances, prepared by Shoghi Effendi\n*explanatory notes prepared by the Universal House of Justice\n\nThe book was divided into six main themes in the Synopsis and Codification by Shoghi Effendi:\n#The appointment of `Abdu'l-Bahá as the successor of Bahá'u'lláh\n#Anticipation of the Institution of the Guardianship\n#The Institution of the Universal House of Justice\n#Laws, Ordinances and exhortations\n#Specific admonitions, reproofs and warnings\n#Miscellaneous subjects\n\nFurther, the laws were divided into four categories:\nA. Prayer\nB. Fasting\nC. Laws of personal status\nD. Miscellaneous laws, ordinances and exhortations\n\nThemes\n\nScholarly review finds the Aqdas has themes of laws of worship, societal relations and administrative organization, or governance, of the religion. It also has strong themes of internationalism and addresses a need of humanity to mature - criticizing religious hierarchies, emphasizing inter-religious dialogue and unity, and international standards; things others at the time thought lacked practical application and seemed only utopian in the era it was published. The basics of the rules of successorship are set forth with enough clarity that the religion has avoided significant schism. Through the authority vested in `Abdu'l-Bahá in the Aqdas there is an expanse of internationalism related to the law in works like The Secret of Divine Civilization and through his extended authority to Shoghi Effendi works like his World Order of Bahá'u'lláh further elaborates on the internationalism theme. This stands in some distinction from other scriptures by not using triumphal tones as the voice of God is given to be viewed but rather one of progressive development, social context, and outright delay in application until another day. Indeed, it insists that divine law is applicable only in situations with requisite conditions, where it is likely to have certain social effects. The goal of application of the law and its methods are not to cause disturbance and dissension and requires an appreciation for context and intention. Additionally one is to eschew emphasis in the development of textualist and intentionalist arguments about the law though some of this is visible in scholarship on the Aqdas. Such methods of application of law in a religious context are common in Islam and Judaism.\n\nThe Aqdas is understood by Bahá'ís to be a factor in the process of ongoing developments in world order. This can be seen comparing the Bahá'í approach to history and the future to that of the theory of The Clash of Civilizations on the one hand and the development of a posthegemony system on the other (compared with work of Robert Cox, for example, in Approaches to World Order, (Robert Cox & Timonthy Sinclair eds, Cambridge University Press, 1996).)\n\nCertain possible sources of law are specifically abrogated: laws of the Bábí religion, notably in the Persian Bayán, oral traditions (linked with pilgrim notes, and natural law, (that is to say God's sovereign will through revelation is the independent authority.) Divine revelation's law-making is both unconditioned in terms of the divine right to choose, and conditioned in the sense of the progress of history from one revelation to the next.\n\nLaws\n\nSome laws and teachings of the Kitáb-i-Aqdas are, according to Bahá'í teaching, not meant to be applied at the present time; their application depends on decisions by the Universal House of Justice. See also Bahá'í laws for laws in practice in Bahá'í communities.  In reference to the laws of his revelation Baha'u'llah writes in paragraph 3 the following, \"O ye peoples of the World! Know assuredly that My commandments are the lamps of my loving providence among My servants, and the keys of My mercy for My creatures. Thus hath it been sent down from the heaven of the Will of your Lord, the Lord of Revelation. Were any man to taste the sweetness of the words which the lips of the All-Merciful have willed to utter, he would, though the treasures of the earth be in his possession, renounce them one and all, that he might vindicate the truth of even one of His commandments, shining above the Dayspring of His bountiful care and loving-kindness.\"\n\nAdministration\n\nThe institutional status of the authority of `Abdu'l-Bahá and a House of Justice are specifically delineated. On the basis of the authority granted `Abdu'l-Bahá he extended forms of the authority vested in him to the Guardianship, whose sole member was Shoghi Effendi, and the Universal, or International, House of Justice through his Will and Testament. This was confirmed and amplified in other texts, notably the Kitáb-i-`Ahd. The Universal House of Justice is specifically empowered to write and rescind any laws it is felt necessary aside from those of the text of scripture and actual application of the laws of the Aqdas among Bahá'ís are dependent on the choice of the Universal House of Justice.\n\nPrayer\n\nBahá'ís between 15 and 70 years of age are to perform a daily obligatory prayer, and can choose daily from among three, all of which are accompanied by specific rites, and preceded by ablutions. During the obligatory prayer Bahá'ís face the Qiblih, which is the Shrine of Bahá'u'lláh in Bahjí, Israel. People are exempt from the obligatory prayers when ill, in danger, or women during their menstrual cycles.\n\nCongregational prayer is forbidden, except for the case of the Prayer for the Dead.\n\nFasting\n\nThe Bahá'í fast is observed from sunrise to sunset in the Bahá'í month of `Alá' from 2 March through 20 March. During this time Bahá'ís in good health between the ages of 15 and 70 abstain from eating and drinking.  Exemptions to the fast are given to people who are travelling, ill, pregnant, nursing, menstruating, or engaged in heavy labour.  Vowing to fast outside of the prescribed fasting period is permissible, and encouraged when done for the benefit of mankind.\n\nLaws of personal status\n\nMarriage and divorce\n\nBaha'u'llah's statements about marriage in the Kitáb-i-Aqdas are brief. Marriage is highly recommended but is stated to not be obligatory. Bahá'u'lláh states that the maximum number of wives is two, but also states that having only one wife would add more tranquility to both partners. These statements were later interpreted by `Abdu'l-Bahá that having a second wife is conditional upon treating both wives with justice and equality and was not possible in practice, thus establishing monogamy.\n\nThat Bahá'u'lláh had three wives, while his religion teaches monogamy, which has been the subject of criticism. The writing of the Kitáb-i-Aqdas and Bahá'í teachings on gender equality and monogamy post-date Bahá'u'lláh's marriages and are understood to be evolutionary in nature, slowly leading Bahá'ís away from what had been a deeply rooted cultural practice.\n\nBahá'ís need to be at least 15 years of age to get married, and the consent of all living biological parents is needed to get married. Marriage is also conditioned a payment of dowry by the husband to the wife of approximately  of gold or silver dependent on the permanent residence of the husband. The Kitáb-i-Aqdas allows a man to marry two wives under the condition that they be treated equally. Later, `Abdu'l-Bahá and Shoghi Effendi clarified that monogamy was the intent of the paragraph.\n\nDivorce is permitted, although discouraged, and is granted after a year of separation if the couple is unable to reconcile their differences.\n\nThe Baha'i Universal House of Justice is to levy fines against men and women for adultery, payable in gold.\n\nInheritance\n\nIn the Kitáb-i-Aqdas it is stated that all Bahá'ís must write a will. The other Bahá’í laws of inheritance in the Kitáb-i-Aqdas apply only in case of intestacy, that is, when the individual dies without leaving a will. The system of inheritance provides for distribution of the deceased's estate among seven categories of heirs: children, spouse, father, mother, brothers, sisters, and teachers with higher categories obtaining a larger share. In cases where some of the categories of heirs does not exist the share falls partly to the children and the Local Spiritual Assembly. Kitáb-i-Aqdas. http://en.wikipedia.org/?curid=16853."
  }
}
