{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20287",
  "eid" : "412748b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778618555,
  "textBody" : "Microsoft Word is  a word processor developed by Microsoft. It was first released on October 25, 1983 under the name Multi-Tool Word for Xenix systems. Subsequent versions were later written for several other platforms including IBM PCs running DOS (1983), Apple Macintosh running the Classic Mac OS (1985), AT&T Unix PC (1985), Atari ST (1988), OS/2 (1989), Microsoft Windows (1989), SCO Unix (1994), and macOS (2001). Commercial versions of Word are licensed as a standalone product or as a component of Microsoft Office, Windows RT or the discontinued Microsoft Works suite. Microsoft Word Viewer and Office Online are freeware editions of Word with limited features.\n\nHistory\n\nOrigins\n\nIn 1981, Microsoft hired Charles Simonyi, the primary developer of Bravo, the first GUI word processor, which was developed at Xerox PARC. Simonyi started work on a word processor called Multi-Tool Word and soon hired Richard Brodie, a former Xerox intern, who became the primary software engineer.\n\nMicrosoft announced Multi-Tool Word for Xenix and MS-DOS in 1983. Its name was soon simplified to Microsoft Word. Free demonstration copies of the application were bundled with the November 1983 issue of PC World, making it the first to be distributed on-disk with a magazine. That year Microsoft demonstrated Word running on Windows.\n\nUnlike most MS-DOS programs at the time, Microsoft Word was designed to be used with a mouse. Advertisements depicted the Microsoft Mouse, and described Word as a WYSIWYG, windowed word processor with the ability to undo and display bold, italic, and underlined text, although it could not render fonts. It was not initially popular, since its user interface was different from the leading word processor at the time, WordStar.  However, Microsoft steadily improved the product, releasing versions 2.0 through 5.0 over the next six years. In 1985, Microsoft ported Word to the classic Mac OS (known as Macintosh System Software at the time). This was made easier by Word for DOS having been designed for use with high-resolution displays and laser printers, even though none were yet available to the general public. Following the precedents of LisaWrite and MacWrite, Word for Mac OS added true WYSIWYG features. It fulfilled a need for a word processor that was more capable than MacWrite. After its release, Word for Mac OS's sales were higher than its MS-DOS counterpart for at least four years.\n\nThe second release of Word for Mac OS, shipped in 1987, was named Word 3.0 to synchronize its version number with Word for DOS; this was Microsoft's first attempt to synchronize version numbers across platforms. Word 3.0 included numerous internal enhancements and new features, including the first implementation of the Rich Text Format (RTF) specification, but was plagued with bugs. Within a few months, Word 3.0 was superseded by a more stable Word 3.01, which was mailed free to all registered users of 3.0. After MacWrite Pro was discontinued in the mid-1990s, Word for Mac OS never had any serious rivals. Word 5.1 for Mac OS, released in 1992, was a very popular word processor owing to its elegance, relative ease of use and feature set. Many users say it is the best version of Word for Mac OS ever created.\n\nIn 1986, an agreement between Atari and Microsoft brought Word to the Atari ST under the name Microsoft Write. The Atari ST version was a port of Word 1.05 for the Mac OS and was never updated due to the outstanding degree of software piracy on the Atari platform.\n\nThe first version of Word for Windows was released in 1989. With the release of Windows 3.0 the following year, sales began to pick up and Microsoft soon became the market leader for word processors for IBM PC-compatible computers. In 1991, Microsoft capitalized on Word for Windows' increasing popularity by releasing a version of Word for DOS, version 5.5, that replaced its unique user interface with an interface similar to a Windows application. When Microsoft became aware of the Year 2000 problem, it made Microsoft Word 5.5 for DOS available for download free. , it is still available for download from Microsoft's web site.\nIn 1991, Microsoft embarked on a project code-named Pyramid to completely rewrite Microsoft Word from the ground up. Both the Windows and Mac OS versions would start from the same code base. It was abandoned when it was determined that it would take the development team too long to rewrite and then catch up with all the new capabilities that could have been added in the same time without a rewrite. Instead, the next versions of Word for Windows and Mac OS, dubbed version 6.0, both started from the code base of Word for Windows 2.0.\n\nWith the release of Word 6.0 in 1993, Microsoft again attempted to synchronize the version numbers and coordinate product naming across platforms, this time across DOS, Mac OS, and Windows (this was the last version of Word for DOS). It introduced AutoCorrect, which automatically fixed certain typing errors, and AutoFormat, which could reformat many parts of a document at once. While the Windows version received favorable reviews (e.g., from InfoWorld), the Mac OS version was widely derided. Many accused it of being slow, clumsy and memory intensive, and its user interface differed significantly from Word 5.1. In response to user requests, Microsoft offered Word 5 again, after it had been discontinued. Subsequent versions of Word for macOS are no longer direct ports of Word for Windows, instead featuring a mixture of ported code and native code.\n\nWord for Windows\n\nWord for Windows is available stand-alone or as part of the Microsoft Office suite. Word contains rudimentary desktop publishing capabilities and is the most widely used word processing program on the market. Word files are commonly used as the format for sending text documents via e-mail because almost every user with a computer can read a Word document by using the Word application, a Word viewer or a word processor that imports the Word format (see Microsoft Word Viewer). Word 6 for Windows NT was the first 32-bit version of the product,http://www.danielsays.com/ss-gallery-winnt2k-ms-office-nt.html released with Microsoft Office for Windows NT around the same time as Windows 95. It was a straightforward port of Word 6.0. Starting with Word 95, releases of Word were named after the year of its release, instead of its version number.\n\nWord 2010 allows more customization of the Ribbon, adds a Backstage view for file management, has improved document navigation, allows creation and embedding of screenshots, and integrates with Word Web App.\n\nWord for Mac\n\nIn 1997, Microsoft formed the Macintosh Business Unit as an independent group within Microsoft focused on writing software for Mac OS. Its first version of Word, Word 98, was released with Office 98 Macintosh Edition. Document compatibility reached parity with Word 97, and it included features from Word 97 for Windows, including spell and grammar checking with squiggles. Users could choose the menus and keyboard shortcuts to be similar to either Word 97 for Windows or Word 5 for Mac OS.\n\nWord 2001, released in 2000, added a few new features, including the Office Clipboard, which allowed users to copy and paste multiple items. It was the last version to run on classic Mac OS and, on Mac OS X, it could only run within the Classic Environment. Word X, released in 2001, was the first version to run natively on, and required, Mac OS X, and introduced non-contiguous text selection.\n\nWord 2004 was released in May 2004. It included a new Notebook Layout view for taking notes either by typing or by voice. Other features, such as tracking changes, were made more similar with Office for Windows.\n\nWord 2008, released on January 15, 2008, included a Ribbon-like feature, called the Elements Gallery, that can be used to select page layouts and insert custom diagrams and images. It also included a new view focused on publishing layout, integrated bibliography management, and native support for the new Office Open XML format. It was the first version to run natively on Intel-based Macs.\n\nWord 2011, released in October 2010, replaced the Elements Gallery in favor of a Ribbon user interface that is much more similar to Office for Windows, and includes a full-screen mode that allows users to focus on reading and writing documents, and support for Office Web Apps.\n\nFile formats\n\nFile extensions\n\nMicrosoft Word's native file formats are denoted either by a .doc or .docx filename extension.\n\nAlthough the .doc extension has been used in many different versions of Word, it actually encompasses four distinct file formats:\n# Word for DOS\n# Word for Windows 1 and 2; Word 3 and 4 for Mac OS\n# Word 6 and Word 95 for Windows; Word 6 for Mac OS\n# Word 97 and later for Windows; Word 98 and later for Mac OS\n\nThe newer .docx extension signifies the Office Open XML international standard for Office documents and is used by Word 2007 and later for Windows, Word 2008 and later for macOS, as well as by a growing number of applications from other vendors, including OpenOffice.org Writer, an open source word processing program.\n\nBinary formats (Word 97–2007)\n\nDuring the late 1990s and early 2000s, the default Word document format (.DOC) became a de facto standard of document file formats for Microsoft Office users. There are different versions of \"Word Document Format\" used by default in Word 97–2007. Each binary word file is an OLE Compound File, a hierarchical file system within a file. According to Joel Spolsky, Word Binary File Format is extremely complex mainly because its developers had to accommodate an overwhelming number of features and prioritize performance over anything else.\n\nAs with all OLE Compound Files, Word Binary Format consists of \"storages\", which are analogous to computer folders, and \"streams\", which are similar to computer files. Each storage may contain streams or other storages. Each Word Binary File must contain a stream called \"WordDocument\" stream and this stream must start with a File Information Block (FIB). FIB serves as the first point of reference for locating everything else, such as where the text in a Word document starts, ends, what version of Word created the document and other attributes.\n \nWord 2007 and later continue to support the DOC file format, although it is no longer the default.\n\nXML Document (Word 2003)\n\nThe XML  format introduced in Word 2003 was a simple, XML-based format called WordprocessingML.\n\nCross-version compatibility\n\nOpening a Word Document file in a version of Word other than the one with which it was created can cause incorrect display of the document. The document formats of the various versions change in subtle and not so subtle ways (such as changing the font, or the handling of more complex tasks like footnotes). Formatting created in newer versions does not always survive when viewed in older versions of the program, nearly always because that capability does not exist in the previous version. Rich Text Format (RTF), an early effort to create a format for interchanging formatted text between applications, is an optional format for Word that retains most formatting and all content of the original document.\n\nThird-party formats\n\nPlugins permitting the Windows versions of Word to read and write formats it does not natively support, such as international standard OpenDocument format (ODF) (ISO/IEC 26300:2006), are available. Up until the release of Service Pack 2 (SP2) for Office 2007, Word did not natively support reading or writing ODF documents without a plugin, namely the [http://www.sun.com/software/star/odf_plugin/get.jsp SUN ODF Plugin] or the [http://odf-converter.sourceforge.net/download.html OpenXML/ODF Translator]. With SP2 installed, ODF format 1.1 documents can be read and saved like any other supported format in addition to those already available in Word 2007. The implementation faces substantial criticism, and the ODF Alliance and others have claimed that the third-party plugins provide better support. Microsoft later declared that the ODF support has some limitations.\n\nIn October 2005, one year before the Microsoft Office 2007 suite was released, Microsoft declared that there was insufficient demand from Microsoft customers for the international standard OpenDocument format support, and that therefore it would not be included in Microsoft Office 2007. This statement was repeated in the following months.March 23, 2006, Gates: Office 2007 will enable a new class of application [http://news.zdnet.com/2100-3513_22-148675.html Mass. holding tight to OpenDocument – ZDNet]  As an answer, on October 20, 2005 an online petition was created to demand ODF support from Microsoft.\n\nIn May 2006, the ODF plugin for Microsoft Office was released by the OpenDocument Foundation. Microsoft declared that it had no relationship with the developers of the plugin.\n\nIn July 2006, Microsoft announced the creation of the Open XML Translator project – tools to build a technical bridge between the Microsoft Office Open XML Formats and the OpenDocument Format (ODF). This work was started in response to government requests for interoperability with ODF. The goal of project was not to add ODF support to Microsoft Office, but only to create a plugin and an external toolset. In February 2007, this project released a first version of the ODF plugin for Microsoft Word.\n\nIn February 2007, Sun released an initial version of its ODF plugin for Microsoft Office. Version 1.0 was released in July 2007.\n\nMicrosoft Word 2007 (Service Pack 1) supports (for output only) PDF and XPS formats, but only after manual installation of the Microsoft 'Save as PDF or XPS' add-on.Microsoft to remove PDF support from Office 2007 in wake of Adobe dispute, Friday, June 2, 2006 [http://www.tgdaily.com/content/view/26786/118/ Microsoft to remove PDF support from Office 2007 in wake of Adobe dispute | TG Daily]  On later releases, this was offered by default.\n\nImage formats\n\nWord can import and display images in common bitmap formats such as JPG and GIF. It can also be used to create and display simple line-art. No version of Microsoft Word has support for the common SVG vector image format.\n\nFeatures and flaws\n\nAmong its features, Word includes a built-in spell checker, a thesaurus, a dictionary, and utilities for manipulating and editing text. The following are some aspects of its feature set.\n\nTemplates \n\nSeveral later versions of Word include the ability for users to create their own formatting templates, allowing them to define a file in which the title, heading, paragraph, and other element designs that are unique from the standard Word templates. Users can find how to do this under the Help section located near the top right corner (Word 2013 on Windows 8).\n\nFor example, Normal.dot is the master template from which all Word documents are created. It determines the margin defaults as well as the layout of the text and font defaults. Although normal.dot is already set with certain defaults, the user can change normal.dot to new defaults. This will change other documents which were created using the template, usually in unexpected ways.[http://pubs.logicalexpressions.com/Pub0009/LPMArticle.asp?ID=151 in depth explanation of Normal.dot] \n\nWordArt\n\nWordArt enables drawing text in a Microsoft Word document such as a title, watermark, or other text, with graphical effects such as skewing, shadowing, rotating, stretching in a variety of shapes and colors and even including three-dimensional effects. Users can apply formatting effects such as shadow, bevel, glow, and reflection to their document text as easily as applying bold or underline. Users can also spell-check text that uses visual effects, and add text effects to paragraph styles.\n\nMacros\n\nA Macro is a rule of pattern that specifies how a certain input sequence (often a sequence of characters) should be mapped to an output sequence according to defined process. Frequently used or repetitive sequences of keystrokes and mouse movements can be automated.\nLike other Microsoft Office documents, Word files can include advanced macros and even embedded programs. The language was originally WordBasic, but changed to Visual Basic for Applications as of Word 97.\n\nThis extensive functionality can also be used to run and propagate viruses in documents. The tendency for people to exchange Word documents via email, USB flash drives, and floppy disks made this an especially attractive vector in 1999. A prominent example was the Melissa virus, but countless others have existed.\n\nThese macro viruses were the only known cross-platform threats between Windows and Macintosh computers and they were the only infection vectors to affect any macOS system up until the advent of video codec trojans in 2007. Microsoft released patches for Word X and Word 2004 that effectively eliminated the macro problem on the Mac by 2006.\n\nWord's macro security setting, which regulates when macros may execute, can be adjusted by the user, but in the most recent versions of Word, is set to HIGH by default, generally reducing the risk from macro-based viruses, which have become uncommon.\n\nLayout issues\n\nBefore Word 2010 (Word 14) for Windows, the program was unable to correctly handle ligatures defined in TrueType fonts.[http://office.microsoft.com/en-us/word-help/what-s-new-in-word-2010-HA010372687.aspx What's new in Word 2010]. Retrieved July 1, 2010. Those ligature glyphs with Unicode codepoints may be inserted manually, but are not recognized by Word for what they are, breaking spell checking, while custom ligatures present in the font are not accessible at all. Since Word 2010, the program now has advanced typesetting features which can be enabled:[http://jeffhuang.com/better_word_papers.html Improving the look of papers written in Microsoft Word], Retrieved May 30, 2010. OpenType ligatures,[http://www.orzeszek.org/blog/2009/05/17/how-to-enable-opentype-ligatures-in-word-2010/ How to Enable OpenType Ligatures in Word 2010], Oreszek Blog, May 17, 2009. kerning, and hyphenation. Other layout deficiencies of Word include the inability to set crop marks or thin spaces. Various third-party workaround utilities have been developed.Such as \n\nIn Word 2004 for Mac OS X, support of complex scripts was inferior even to Word 97, and Word 2004 does not support Apple Advanced Typography features like ligatures or glyph variants.\n\nBullets and numbering\n\nMicrosoft Word supports bullet lists and numbered lists. It also features a numbering system that helps add correct numbers to pages, chapters, headers, footnotes, and entries of tables of content; these numbers automatically change to correct ones as new items are added or existing items are deleted. Bullets and numbering can be applied directly to paragraphs and convert them to lists. Word 97 through 2003, however, had problems adding correct numbers to numbered lists. In particular, a second irrelevant numbered list might have not started with number one, but instead resumed numbering after the last numbered list. Although Word 97 supported a hidden marker that said the list numbering must restart afterwards, the command to insert this marker (Restart Numbering command) was only added in Word 2003. However, if one cut the first item of the listed and pasted it as another item, e.g. fifth, the restart marker would have moved with it and the list would have restarted in the middle instead of at the top.\n\nUsers can also create tables in Word. Depending on the version, Word can perform simple calculations. Formulae are supported as well.\n\nAutoSummarize\n\nAutoSummarize highlights passages or phrases that it considers valuable. The amount of text to be retained can be specified by the user as a percentage of the current amount of text.\n\nAccording to Ron Fein of the Word 97 team, AutoSummarize cuts wordy copy to the bone by counting words and ranking sentences. First, AutoSummarize identifies the most common words in the document (barring \"a\" and \"the\" and the like) and assigns a \"score\" to each word – the more frequently a word is used, the higher the score. Then, it \"averages\" each sentence by adding the scores of its words and dividing the sum by the number of words in the sentence – the higher the average, the higher the rank of the sentence. \"It's like the ratio of wheat to chaff,\" explains Fein.\n\nAutoSummarize was removed from Microsoft Word for Mac OS X 2011, although it was present in Word for Mac 2008. AutoSummarize was removed from the Office 2010 release version (14) as well.[https://technet.microsoft.com/en-us/library/cc179199 Changes in Word 2010 (for IT pros)]. Technet.microsoft.com (May 16, 2012). Retrieved on July 17, 2013.\n\nPassword protection \n\nThere are three password types that can be set in Microsoft Word:\n\n* Password to open a document \n* Password to modify a document\n* Password restricting formatting and editing \n\nThe second and the third type of passwords were developed by Microsoft for convenient shared use of documents rather than for their protection. There is no encryption of documents that are protected by such passwords, and Microsoft Office protection system saves a hash sum of a password in a document's header where it can be easily accessed and removed by the specialized software.\nPassword to open a document offers much tougher protection that had been steadily enhanced in the subsequent editions of Microsoft Office.\n\nWord 95 and all the preceding editions had the weakest protection that utilized a conversion of a password to a 16-bit key.\n\nKey length in Word 97 and 2000 was strengthened up to 40 bit. However, modern cracking software allows removing such a password very quickly – a persistent cracking process takes one week at most. Use of rainbow tables reduces password removal time to several seconds. Some password recovery software can not only remove a password, but also find an actual password that was used by a user to encrypt the document using brute-force attack approach. Statistically, the possibility of recovering the password depends on the password strength.\n\nWord's 2003/XP version default protection remained the same but an option that allowed advanced users choosing a Cryptographic Service Provider was added. If a strong CSP is chosen, guaranteed document decryption becomes unavailable, and therefore a password can't be removed from the document. Nonetheless, a password can be fairly quickly picked with brute-force attack, because its speed is still high regardless of the CSP selected. Moreover, since the CSPs are not active by the default, their use is limited to advanced users only.\n\nWord 2007 offers a significantly more secure document protection which utilizes the modern Advanced Encryption Standard (AES) that converts a password to a 128-bit key using a SHA-1 hash function 50000 times. It makes password removal impossible (as of today, no computer that can pick the key in reasonable amount of time exists), and drastically slows the brute-force attack speed down to several hundreds of passwords per second.\n\nWord's 2010 protection algorithm was not changed apart from increasing number of SHA-1 conversions up to 100000 times, and consequently, the brute-force attack speed decreased two times more.\n\nReception\n\nBYTE in 1984 criticized the documentation for Word 1.1 and 2.0 for DOS, calling it \"a complete farce\". It called the software \"clever, put together well, and performs some extraordinary feats\", but concluded that \"especially when operated with the mouse, has many more limitations than benefits ... extremely frustrating to learn and operate efficiently\". PC Magazine review was very mixed, stating \"I've run into weird word processors before, but this is the first time one's nearly knocked me down for the count\" but acknowledging that Word's innovations were the first that caused the reviewer to consider abandoning WordStar. While the review cited an excellent WYSIWYG display, sophisticated print formatting, windows, and footnoting as merits, it criticized many small flaws, very slow performance, and \"documentation apparently produced by Madame Sadie's Pain Palace\". It concluded that Word was \"two releases away from potential greatness\".\n\nCompute!'s Apple Applications in 1987 stated that \"despite a certain awkwardness\", Word 3.01 \"will likely become the major Macintosh word processor\" with \"far too many features to list here\". While criticizing the lack of true WYSIWYG, the magazine concluded that \"Word is marvelous. It's like a Mozart or Edison, whose occasional gaucherie we excuse because of his great gifts\".\n\nCompute! in 1989 stated that Word 5.0's integration of text and graphics made it \"a solid engine for basic desktop publishing\". The magazine approved of improvements to text mode, described the $75 price for upgrading from an earlier version as \"the deal of the decade\", and concluded that \"as a high-octane word processor, Word is definitely worth a look\".\n\nDuring the first quarter of 1996, Microsoft Word accounted for 80% of the worldwide word processing market.\n\nRelease history",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Microsoft Word" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20287" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Microsoft Word is  a word processor developed by Microsoft. It was first released on October 25, 1983 under the name Multi-Tool Word for Xenix systems. Subsequent versions were later written for several other platforms including IBM PCs running DOS (1983), Apple Macintosh running the Classic Mac OS (1985), AT&T Unix PC (1985), Atari ST (1988), OS/2 (1989), Microsoft Windows (1989), SCO Unix (1994), and macOS (2001). Commercial versions of Word are licensed as a standalone product or as a component of Microsoft Office, Windows RT or the discontinued Microsoft Works suite. Microsoft Word Viewer and Office Online are freeware editions of Word with limited features.\n\nHistory\n\nOrigins\n\nIn 1981, Microsoft hired Charles Simonyi, the primary developer of Bravo, the first GUI word processor, which was developed at Xerox PARC. Simonyi started work on a word processor called Multi-Tool Word and soon hired Richard Brodie, a former Xerox intern, who became the primary software engineer.\n\nMicrosoft announced Multi-Tool Word for Xenix and MS-DOS in 1983. Its name was soon simplified to Microsoft Word. Free demonstration copies of the application were bundled with the November 1983 issue of PC World, making it the first to be distributed on-disk with a magazine. That year Microsoft demonstrated Word running on Windows.\n\nUnlike most MS-DOS programs at the time, Microsoft Word was designed to be used with a mouse. Advertisements depicted the Microsoft Mouse, and described Word as a WYSIWYG, windowed word processor with the ability to undo and display bold, italic, and underlined text, although it could not render fonts. It was not initially popular, since its user interface was different from the leading word processor at the time, WordStar.  However, Microsoft steadily improved the product, releasing versions 2.0 through 5.0 over the next six years. In 1985, Microsoft ported Word to the classic Mac OS (known as Macintosh System Software at the time). This was made easier by Word for DOS having been designed for use with high-resolution displays and laser printers, even though none were yet available to the general public. Following the precedents of LisaWrite and MacWrite, Word for Mac OS added true WYSIWYG features. It fulfilled a need for a word processor that was more capable than MacWrite. After its release, Word for Mac OS's sales were higher than its MS-DOS counterpart for at least four years.\n\nThe second release of Word for Mac OS, shipped in 1987, was named Word 3.0 to synchronize its version number with Word for DOS; this was Microsoft's first attempt to synchronize version numbers across platforms. Word 3.0 included numerous internal enhancements and new features, including the first implementation of the Rich Text Format (RTF) specification, but was plagued with bugs. Within a few months, Word 3.0 was superseded by a more stable Word 3.01, which was mailed free to all registered users of 3.0. After MacWrite Pro was discontinued in the mid-1990s, Word for Mac OS never had any serious rivals. Word 5.1 for Mac OS, released in 1992, was a very popular word processor owing to its elegance, relative ease of use and feature set. Many users say it is the best version of Word for Mac OS ever created.\n\nIn 1986, an agreement between Atari and Microsoft brought Word to the Atari ST under the name Microsoft Write. The Atari ST version was a port of Word 1.05 for the Mac OS and was never updated due to the outstanding degree of software piracy on the Atari platform.\n\nThe first version of Word for Windows was released in 1989. With the release of Windows 3.0 the following year, sales began to pick up and Microsoft soon became the market leader for word processors for IBM PC-compatible computers. In 1991, Microsoft capitalized on Word for Windows' increasing popularity by releasing a version of Word for DOS, version 5.5, that replaced its unique user interface with an interface similar to a Windows application. When Microsoft became aware of the Year 2000 problem, it made Microsoft Word 5.5 for DOS available for download free. , it is still available for download from Microsoft's web site.\nIn 1991, Microsoft embarked on a project code-named Pyramid to completely rewrite Microsoft Word from the ground up. Both the Windows and Mac OS versions would start from the same code base. It was abandoned when it was determined that it would take the development team too long to rewrite and then catch up with all the new capabilities that could have been added in the same time without a rewrite. Instead, the next versions of Word for Windows and Mac OS, dubbed version 6.0, both started from the code base of Word for Windows 2.0.\n\nWith the release of Word 6.0 in 1993, Microsoft again attempted to synchronize the version numbers and coordinate product naming across platforms, this time across DOS, Mac OS, and Windows (this was the last version of Word for DOS). It introduced AutoCorrect, which automatically fixed certain typing errors, and AutoFormat, which could reformat many parts of a document at once. While the Windows version received favorable reviews (e.g., from InfoWorld), the Mac OS version was widely derided. Many accused it of being slow, clumsy and memory intensive, and its user interface differed significantly from Word 5.1. In response to user requests, Microsoft offered Word 5 again, after it had been discontinued. Subsequent versions of Word for macOS are no longer direct ports of Word for Windows, instead featuring a mixture of ported code and native code.\n\nWord for Windows\n\nWord for Windows is available stand-alone or as part of the Microsoft Office suite. Word contains rudimentary desktop publishing capabilities and is the most widely used word processing program on the market. Word files are commonly used as the format for sending text documents via e-mail because almost every user with a computer can read a Word document by using the Word application, a Word viewer or a word processor that imports the Word format (see Microsoft Word Viewer). Word 6 for Windows NT was the first 32-bit version of the product,http://www.danielsays.com/ss-gallery-winnt2k-ms-office-nt.html released with Microsoft Office for Windows NT around the same time as Windows 95. It was a straightforward port of Word 6.0. Starting with Word 95, releases of Word were named after the year of its release, instead of its version number.\n\nWord 2010 allows more customization of the Ribbon, adds a Backstage view for file management, has improved document navigation, allows creation and embedding of screenshots, and integrates with Word Web App.\n\nWord for Mac\n\nIn 1997, Microsoft formed the Macintosh Business Unit as an independent group within Microsoft focused on writing software for Mac OS. Its first version of Word, Word 98, was released with Office 98 Macintosh Edition. Document compatibility reached parity with Word 97, and it included features from Word 97 for Windows, including spell and grammar checking with squiggles. Users could choose the menus and keyboard shortcuts to be similar to either Word 97 for Windows or Word 5 for Mac OS.\n\nWord 2001, released in 2000, added a few new features, including the Office Clipboard, which allowed users to copy and paste multiple items. It was the last version to run on classic Mac OS and, on Mac OS X, it could only run within the Classic Environment. Word X, released in 2001, was the first version to run natively on, and required, Mac OS X, and introduced non-contiguous text selection.\n\nWord 2004 was released in May 2004. It included a new Notebook Layout view for taking notes either by typing or by voice. Other features, such as tracking changes, were made more similar with Office for Windows.\n\nWord 2008, released on January 15, 2008, included a Ribbon-like feature, called the Elements Gallery, that can be used to select page layouts and insert custom diagrams and images. It also included a new view focused on publishing layout, integrated bibliography management, and native support for the new Office Open XML format. It was the first version to run natively on Intel-based Macs.\n\nWord 2011, released in October 2010, replaced the Elements Gallery in favor of a Ribbon user interface that is much more similar to Office for Windows, and includes a full-screen mode that allows users to focus on reading and writing documents, and support for Office Web Apps.\n\nFile formats\n\nFile extensions\n\nMicrosoft Word's native file formats are denoted either by a .doc or .docx filename extension.\n\nAlthough the .doc extension has been used in many different versions of Word, it actually encompasses four distinct file formats:\n# Word for DOS\n# Word for Windows 1 and 2; Word 3 and 4 for Mac OS\n# Word 6 and Word 95 for Windows; Word 6 for Mac OS\n# Word 97 and later for Windows; Word 98 and later for Mac OS\n\nThe newer .docx extension signifies the Office Open XML international standard for Office documents and is used by Word 2007 and later for Windows, Word 2008 and later for macOS, as well as by a growing number of applications from other vendors, including OpenOffice.org Writer, an open source word processing program.\n\nBinary formats (Word 97–2007)\n\nDuring the late 1990s and early 2000s, the default Word document format (.DOC) became a de facto standard of document file formats for Microsoft Office users. There are different versions of \"Word Document Format\" used by default in Word 97–2007. Each binary word file is an OLE Compound File, a hierarchical file system within a file. According to Joel Spolsky, Word Binary File Format is extremely complex mainly because its developers had to accommodate an overwhelming number of features and prioritize performance over anything else.\n\nAs with all OLE Compound Files, Word Binary Format consists of \"storages\", which are analogous to computer folders, and \"streams\", which are similar to computer files. Each storage may contain streams or other storages. Each Word Binary File must contain a stream called \"WordDocument\" stream and this stream must start with a File Information Block (FIB). FIB serves as the first point of reference for locating everything else, such as where the text in a Word document starts, ends, what version of Word created the document and other attributes.\n \nWord 2007 and later continue to support the DOC file format, although it is no longer the default.\n\nXML Document (Word 2003)\n\nThe XML  format introduced in Word 2003 was a simple, XML-based format called WordprocessingML.\n\nCross-version compatibility\n\nOpening a Word Document file in a version of Word other than the one with which it was created can cause incorrect display of the document. The document formats of the various versions change in subtle and not so subtle ways (such as changing the font, or the handling of more complex tasks like footnotes). Formatting created in newer versions does not always survive when viewed in older versions of the program, nearly always because that capability does not exist in the previous version. Rich Text Format (RTF), an early effort to create a format for interchanging formatted text between applications, is an optional format for Word that retains most formatting and all content of the original document.\n\nThird-party formats\n\nPlugins permitting the Windows versions of Word to read and write formats it does not natively support, such as international standard OpenDocument format (ODF) (ISO/IEC 26300:2006), are available. Up until the release of Service Pack 2 (SP2) for Office 2007, Word did not natively support reading or writing ODF documents without a plugin, namely the [http://www.sun.com/software/star/odf_plugin/get.jsp SUN ODF Plugin] or the [http://odf-converter.sourceforge.net/download.html OpenXML/ODF Translator]. With SP2 installed, ODF format 1.1 documents can be read and saved like any other supported format in addition to those already available in Word 2007. The implementation faces substantial criticism, and the ODF Alliance and others have claimed that the third-party plugins provide better support. Microsoft later declared that the ODF support has some limitations.\n\nIn October 2005, one year before the Microsoft Office 2007 suite was released, Microsoft declared that there was insufficient demand from Microsoft customers for the international standard OpenDocument format support, and that therefore it would not be included in Microsoft Office 2007. This statement was repeated in the following months.March 23, 2006, Gates: Office 2007 will enable a new class of application [http://news.zdnet.com/2100-3513_22-148675.html Mass. holding tight to OpenDocument – ZDNet]  As an answer, on October 20, 2005 an online petition was created to demand ODF support from Microsoft.\n\nIn May 2006, the ODF plugin for Microsoft Office was released by the OpenDocument Foundation. Microsoft declared that it had no relationship with the developers of the plugin.\n\nIn July 2006, Microsoft announced the creation of the Open XML Translator project – tools to build a technical bridge between the Microsoft Office Open XML Formats and the OpenDocument Format (ODF). This work was started in response to government requests for interoperability with ODF. The goal of project was not to add ODF support to Microsoft Office, but only to create a plugin and an external toolset. In February 2007, this project released a first version of the ODF plugin for Microsoft Word.\n\nIn February 2007, Sun released an initial version of its ODF plugin for Microsoft Office. Version 1.0 was released in July 2007.\n\nMicrosoft Word 2007 (Service Pack 1) supports (for output only) PDF and XPS formats, but only after manual installation of the Microsoft 'Save as PDF or XPS' add-on.Microsoft to remove PDF support from Office 2007 in wake of Adobe dispute, Friday, June 2, 2006 [http://www.tgdaily.com/content/view/26786/118/ Microsoft to remove PDF support from Office 2007 in wake of Adobe dispute | TG Daily]  On later releases, this was offered by default.\n\nImage formats\n\nWord can import and display images in common bitmap formats such as JPG and GIF. It can also be used to create and display simple line-art. No version of Microsoft Word has support for the common SVG vector image format.\n\nFeatures and flaws\n\nAmong its features, Word includes a built-in spell checker, a thesaurus, a dictionary, and utilities for manipulating and editing text. The following are some aspects of its feature set.\n\nTemplates \n\nSeveral later versions of Word include the ability for users to create their own formatting templates, allowing them to define a file in which the title, heading, paragraph, and other element designs that are unique from the standard Word templates. Users can find how to do this under the Help section located near the top right corner (Word 2013 on Windows 8).\n\nFor example, Normal.dot is the master template from which all Word documents are created. It determines the margin defaults as well as the layout of the text and font defaults. Although normal.dot is already set with certain defaults, the user can change normal.dot to new defaults. This will change other documents which were created using the template, usually in unexpected ways.[http://pubs.logicalexpressions.com/Pub0009/LPMArticle.asp?ID=151 in depth explanation of Normal.dot] \n\nWordArt\n\nWordArt enables drawing text in a Microsoft Word document such as a title, watermark, or other text, with graphical effects such as skewing, shadowing, rotating, stretching in a variety of shapes and colors and even including three-dimensional effects. Users can apply formatting effects such as shadow, bevel, glow, and reflection to their document text as easily as applying bold or underline. Users can also spell-check text that uses visual effects, and add text effects to paragraph styles.\n\nMacros\n\nA Macro is a rule of pattern that specifies how a certain input sequence (often a sequence of characters) should be mapped to an output sequence according to defined process. Frequently used or repetitive sequences of keystrokes and mouse movements can be automated.\nLike other Microsoft Office documents, Word files can include advanced macros and even embedded programs. The language was originally WordBasic, but changed to Visual Basic for Applications as of Word 97.\n\nThis extensive functionality can also be used to run and propagate viruses in documents. The tendency for people to exchange Word documents via email, USB flash drives, and floppy disks made this an especially attractive vector in 1999. A prominent example was the Melissa virus, but countless others have existed.\n\nThese macro viruses were the only known cross-platform threats between Windows and Macintosh computers and they were the only infection vectors to affect any macOS system up until the advent of video codec trojans in 2007. Microsoft released patches for Word X and Word 2004 that effectively eliminated the macro problem on the Mac by 2006.\n\nWord's macro security setting, which regulates when macros may execute, can be adjusted by the user, but in the most recent versions of Word, is set to HIGH by default, generally reducing the risk from macro-based viruses, which have become uncommon.\n\nLayout issues\n\nBefore Word 2010 (Word 14) for Windows, the program was unable to correctly handle ligatures defined in TrueType fonts.[http://office.microsoft.com/en-us/word-help/what-s-new-in-word-2010-HA010372687.aspx What's new in Word 2010]. Retrieved July 1, 2010. Those ligature glyphs with Unicode codepoints may be inserted manually, but are not recognized by Word for what they are, breaking spell checking, while custom ligatures present in the font are not accessible at all. Since Word 2010, the program now has advanced typesetting features which can be enabled:[http://jeffhuang.com/better_word_papers.html Improving the look of papers written in Microsoft Word], Retrieved May 30, 2010. OpenType ligatures,[http://www.orzeszek.org/blog/2009/05/17/how-to-enable-opentype-ligatures-in-word-2010/ How to Enable OpenType Ligatures in Word 2010], Oreszek Blog, May 17, 2009. kerning, and hyphenation. Other layout deficiencies of Word include the inability to set crop marks or thin spaces. Various third-party workaround utilities have been developed.Such as \n\nIn Word 2004 for Mac OS X, support of complex scripts was inferior even to Word 97, and Word 2004 does not support Apple Advanced Typography features like ligatures or glyph variants.\n\nBullets and numbering\n\nMicrosoft Word supports bullet lists and numbered lists. It also features a numbering system that helps add correct numbers to pages, chapters, headers, footnotes, and entries of tables of content; these numbers automatically change to correct ones as new items are added or existing items are deleted. Bullets and numbering can be applied directly to paragraphs and convert them to lists. Word 97 through 2003, however, had problems adding correct numbers to numbered lists. In particular, a second irrelevant numbered list might have not started with number one, but instead resumed numbering after the last numbered list. Although Word 97 supported a hidden marker that said the list numbering must restart afterwards, the command to insert this marker (Restart Numbering command) was only added in Word 2003. However, if one cut the first item of the listed and pasted it as another item, e.g. fifth, the restart marker would have moved with it and the list would have restarted in the middle instead of at the top.\n\nUsers can also create tables in Word. Depending on the version, Word can perform simple calculations. Formulae are supported as well.\n\nAutoSummarize\n\nAutoSummarize highlights passages or phrases that it considers valuable. The amount of text to be retained can be specified by the user as a percentage of the current amount of text.\n\nAccording to Ron Fein of the Word 97 team, AutoSummarize cuts wordy copy to the bone by counting words and ranking sentences. First, AutoSummarize identifies the most common words in the document (barring \"a\" and \"the\" and the like) and assigns a \"score\" to each word – the more frequently a word is used, the higher the score. Then, it \"averages\" each sentence by adding the scores of its words and dividing the sum by the number of words in the sentence – the higher the average, the higher the rank of the sentence. \"It's like the ratio of wheat to chaff,\" explains Fein.\n\nAutoSummarize was removed from Microsoft Word for Mac OS X 2011, although it was present in Word for Mac 2008. AutoSummarize was removed from the Office 2010 release version (14) as well.[https://technet.microsoft.com/en-us/library/cc179199 Changes in Word 2010 (for IT pros)]. Technet.microsoft.com (May 16, 2012). Retrieved on July 17, 2013.\n\nPassword protection \n\nThere are three password types that can be set in Microsoft Word:\n\n* Password to open a document \n* Password to modify a document\n* Password restricting formatting and editing \n\nThe second and the third type of passwords were developed by Microsoft for convenient shared use of documents rather than for their protection. There is no encryption of documents that are protected by such passwords, and Microsoft Office protection system saves a hash sum of a password in a document's header where it can be easily accessed and removed by the specialized software.\nPassword to open a document offers much tougher protection that had been steadily enhanced in the subsequent editions of Microsoft Office.\n\nWord 95 and all the preceding editions had the weakest protection that utilized a conversion of a password to a 16-bit key.\n\nKey length in Word 97 and 2000 was strengthened up to 40 bit. However, modern cracking software allows removing such a password very quickly – a persistent cracking process takes one week at most. Use of rainbow tables reduces password removal time to several seconds. Some password recovery software can not only remove a password, but also find an actual password that was used by a user to encrypt the document using brute-force attack approach. Statistically, the possibility of recovering the password depends on the password strength.\n\nWord's 2003/XP version default protection remained the same but an option that allowed advanced users choosing a Cryptographic Service Provider was added. If a strong CSP is chosen, guaranteed document decryption becomes unavailable, and therefore a password can't be removed from the document. Nonetheless, a password can be fairly quickly picked with brute-force attack, because its speed is still high regardless of the CSP selected. Moreover, since the CSPs are not active by the default, their use is limited to advanced users only.\n\nWord 2007 offers a significantly more secure document protection which utilizes the modern Advanced Encryption Standard (AES) that converts a password to a 128-bit key using a SHA-1 hash function 50000 times. It makes password removal impossible (as of today, no computer that can pick the key in reasonable amount of time exists), and drastically slows the brute-force attack speed down to several hundreds of passwords per second.\n\nWord's 2010 protection algorithm was not changed apart from increasing number of SHA-1 conversions up to 100000 times, and consequently, the brute-force attack speed decreased two times more.\n\nReception\n\nBYTE in 1984 criticized the documentation for Word 1.1 and 2.0 for DOS, calling it \"a complete farce\". It called the software \"clever, put together well, and performs some extraordinary feats\", but concluded that \"especially when operated with the mouse, has many more limitations than benefits ... extremely frustrating to learn and operate efficiently\". PC Magazine review was very mixed, stating \"I've run into weird word processors before, but this is the first time one's nearly knocked me down for the count\" but acknowledging that Word's innovations were the first that caused the reviewer to consider abandoning WordStar. While the review cited an excellent WYSIWYG display, sophisticated print formatting, windows, and footnoting as merits, it criticized many small flaws, very slow performance, and \"documentation apparently produced by Madame Sadie's Pain Palace\". It concluded that Word was \"two releases away from potential greatness\".\n\nCompute!'s Apple Applications in 1987 stated that \"despite a certain awkwardness\", Word 3.01 \"will likely become the major Macintosh word processor\" with \"far too many features to list here\". While criticizing the lack of true WYSIWYG, the magazine concluded that \"Word is marvelous. It's like a Mozart or Edison, whose occasional gaucherie we excuse because of his great gifts\".\n\nCompute! in 1989 stated that Word 5.0's integration of text and graphics made it \"a solid engine for basic desktop publishing\". The magazine approved of improvements to text mode, described the $75 price for upgrading from an earlier version as \"the deal of the decade\", and concluded that \"as a high-octane word processor, Word is definitely worth a look\".\n\nDuring the first quarter of 1996, Microsoft Word accounted for 80% of the worldwide word processing market.\n\nRelease history. Microsoft Word. http://en.wikipedia.org/?curid=20287."
  }
}
