{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1787",
  "eid" : "bba916f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778394591,
  "textBody" : "Events\n\n* 190 – Dong Zhuo has his troops evacuate the capital Luoyang and burn it to the ground.\n* 475 – Byzantine Emperor Basiliscus issues a circular letter (Enkyklikon) to the bishops of his empire, supporting the Monophysite christological position.\n* 537 – Siege of Rome: The Byzantine general Belisarius receives his promised reinforcements, 1,600 cavalry, mostly of Hunnic or Slavic origin and expert bowmen. He starts, despite shortages, raids against the Gothic camps and Vitiges is forced into a stalemate.\n*1241 – Battle of Liegnitz: Mongol forces defeat the Polish and German armies.\n*1288 – Mongol invasions of Vietnam: Yuan forces are defeated by Trần forces in the Battle of Bach Dang in present-day northern Vietnam.\n*1388 – Despite being outnumbered 16 to 1, forces of the Old Swiss Confederacy are victorious over the Archduchy of Austria in the Battle of Näfels.\n*1413 – Henry V is crowned King of England.\n*1440 – Christopher of Bavaria is appointed King of Denmark.\n*1454 – The Treaty of Lodi is signed, establishing a balance of power among northern Italian city-states for almost 50 years.\n*1511 – St John's College, Cambridge, England, founded by Lady Margaret Beaufort, receives its charter.\n*1585 – The expedition organised by Sir Walter Raleigh departs England for Roanoke Island (now in North Carolina) to establish the Roanoke Colony.\n*1609 – Eighty Years' War: Spain and the Dutch Republic sign the Treaty of Antwerp to initiate twelve years of truce.\n*  1609   – Philip III of Spain issues the decree of the \"Expulsion of the Moriscos\". \n*1682 – Robert Cavelier de La Salle discovers the mouth of the Mississippi River, claims it for France and names it Louisiana.\n*1782 – American Revolutionary War: Battle of the Saintes begins.\n*1860 – On his phonautograph machine, Édouard-Léon Scott de Martinville makes the oldest known recording of an audible human voice.\n*1865 – American Civil War: Robert E. Lee surrenders the Army of Northern Virginia (26,765 troops) to Ulysses S. Grant at Appomattox Courthouse, Virginia, effectively ending the war.\n*1909 – The U.S. Congress passes the Payne–Aldrich Tariff Act.\n*1914 – Mexican Revolution: One of the world's first naval/air skirmishes takes place off the coast of western Mexico.\n*1916 – World War I: The Battle of Verdun: German forces launch their third offensive of the battle.\n*1917 – World War I: The Battle of Arras: The battle begins with Canadian Corps executing a massive assault on Vimy Ridge.\n*1918 – World War I: The Battle of the Lys: The Portuguese Expeditionary Corps is crushed by the German forces during what is called the Spring Offensive on the Belgian region of Flanders.\n*  1918   – The National Council of Bessarabia proclaims union with the Kingdom of Romania.\n*1937 – The Kamikaze arrives at Croydon Airport in London. It is the first Japanese-built aircraft to fly to Europe.\n*1939 – Marian Anderson sings at the Lincoln Memorial, after being denied the right to sing at the Daughters of the American Revolution's Constitution Hall.\n*1940 – World War II: Operation Weserübung: Germany invades Denmark and Norway.\n*  1940   – Vidkun Quisling seizes power in Norway.\n*1942 – World War II: The Battle of Bataan/Bataan Death March: United States forces surrender on the Bataan Peninsula. The Japanese Navy launches an air raid on Trincomalee in Ceylon (Sri Lanka); Royal Navy aircraft carrier  and Royal Australian Navy Destroyer  are sunk off the island's east coast.\n*1945 – Execution of Dietrich Bonhoeffer, anti-Nazi dissident and spy, by the Nazi regime.\n* 1945    – World War II: The German pocket battleship Admiral Scheer is sunk by the Royal Air Force\n*  1945   – World War II: The Battle of Königsberg, in East Prussia, ends.\n*  1945   – The United States Atomic Energy Commission is formed.\n*1947 – The Glazier–Higgins–Woodward tornadoes kill 181 and injure 970 in Texas, Oklahoma, and Kansas.\n*  1947   – The Journey of Reconciliation, the first interracial Freedom Ride begins through the upper South in violation of Jim Crow laws. The riders wanted enforcement of the United States Supreme Court's 1946 Irene Morgan decision that banned racial segregation in interstate travel.\n*1948 – Jorge Eliécer Gaitán's assassination provokes a violent riot in Bogotá (the Bogotazo), and a further ten years of violence in Colombia.\n*  1948   – Fighters from the Irgun and Lehi Zionist paramilitary groups attacked Deir Yassin near Jerusalem, killing over 100.\n*1952 – Hugo Ballivián's government is overthrown by the Bolivian National Revolution, starting a period of agrarian reform, universal suffrage and the nationalization of tin mines\n*1957 – The Suez Canal in Egypt is cleared and opens to shipping.\n*1959 – Project Mercury: NASA announces the selection of the United States' first seven astronauts, whom the news media quickly dub the \"Mercury Seven\".\n*1960 – Dr Hendrik Verwoerd, Prime Minister of South Africa and architect of apartheid, narrowly survives an assassination attempt by a white farmer, David Pratt in Johannesburg.\n*1961 – The Pacific Electric Railway in Los Angeles, once the largest electric railway in the world, ends operations.\n*1965 – Astrodome opens. First indoor baseball game is played.\n*1967 – The first Boeing 737 (a 100 series) makes its maiden flight.\n*1969 – The first British-built Concorde 002 makes its maiden flight from Filton to RAF Fairford.\n*1975 – The first game of the Philippine Basketball Association, the second oldest professional basketball league in the world.\n*1976 – The EMD F40PH diesel locomotive enters revenue service with Amtrak.\n*1980 – The Iraqi regime of Saddam Hussein kills philosopher Muhammad Baqir al-Sadr and his sister Bint al-Huda after three days of torture.\n*1981 – The U.S. Navy nuclear submarine  accidentally collides with the Nissho Maru, a Japanese cargo ship, sinking it.\n*1989 – Tbilisi massacre: an anti-Soviet peaceful demonstration and hunger strike in Tbilisi, demanding restoration of Georgian independence, is dispersed by the Soviet Army, resulting in 20 deaths and hundreds of injuries.\n*1991 – Georgia declares independence from the Soviet Union\n*1992 – A U.S. Federal Court finds former Panamanian dictator Manuel Noriega guilty of drug and racketeering charges. He is sentenced to 30 years in prison.\n*1999 – Kosovo War: The Battle of Košare begins.\n*2003 – Iraq War: Baghdad falls to American forces; Iraqis turn on symbols of their former leader Saddam Hussein, pulling down a grand statue of him and tearing it to pieces.\n*2005 – Charles, Prince of Wales marries Camilla Parker Bowles in a civil ceremony at Windsor's Guildhall.\n*2009 – In Tbilisi, Georgia, up to 60,000 people protest against the government of Mikheil Saakashvili.\n*2013 – A 6.1–magnitude earthquake strikes Iran killing 32 people and injuring over 850 people.\n*  2013   – At least 13 people are killed and another three injured after a man goes on a spree shooting in the Serbian village of Velika Ivanča.\n*2014 – A student stabs 20 people at Franklin Regional High School in Murrysville, Pennsylvania.\n*2017 – Palm Sunday church bombings at Coptic Churches in Tanta and Alexandria take place.\n\nBirths\n\n*1283 – Margaret, Maid of Norway, Queen of Scotland (d. 1290)\n*1285 – Ayurbarwada Buyantu Khan, Emperor Renzong of Yuan (d. 1320)\n*1458 – Camilla Battista da Varano, Italian saint (d. 1524)\n*1498 – Jean, Cardinal of Lorraine (d. 1550)\n*1586 – Julius Henry, Duke of Saxe-Lauenburg (d. 1665)\n*1597 – John Davenport, English minister, co-founded the New Haven Colony (d. 1670)\n*1598 – Johann Crüger, Sorbian-German composer and theorist (d. 1662)\n*1624 – Henrik Rysensteen, Dutch military engineer (d. 1679)\n*1627 – Johann Caspar Kerll, German organist and composer (d. 1693)\n*1634 – Countess Albertine Agnes of Nassau (d. 1696)\n*1648 – Henri de Massue, Earl of Galway, French soldier and diplomat (d. 1720)\n*1649 – James Scott, 1st Duke of Monmouth, Dutch-English general and politician, Lord Lieutenant of Staffordshire (d. 1685)\n*1654 – Samuel Fritz, Czech Jesuit missionary to South America (d. 1725?)\n*1680 – Philippe Néricault Destouches, French playwright (d. 1754)\n*1686 – James Craggs the Younger, English politician, Secretary of State for the Southern Department (d. 1721)\n*1691 – Johann Matthias Gesner, German scholar and academic (d. 1761)\n*1717 – Georg Matthias Monn, Austrian organist, composer, and educator (d. 1750)\n*1770 – Thomas Johann Seebeck, German physicist and academic (d. 1831)\n*1773 – Étienne Aignan, French author and academic (d. 1824)\n*1794 – Theobald Boehm, German flute player and composer (d. 1881)\n*1802 – Elias Lönnrot, Finnish physician and philologist (d. 1884)\n*1806 – Isambard Kingdom Brunel, English engineer, designed the Clifton Suspension Bridge (d. 1859)\n*1807 – James Bannerman, Scottish theologian and academic (d. 1868)\n*1821 – Charles Baudelaire, French poet and critic (d. 1867)\n*1830 – Eadweard Muybridge, English photographer and cinematographer (d. 1904)\n*1835 – Leopold II of Belgium (d. 1909)\n*  1835   – Somerset Lowry-Corry, 4th Earl Belmore (d. 1913)\n*1846 – Paolo Tosti, Italian-English composer and educator (d. 1916)\n*1848 – Ezequiél Moreno y Díaz, Spanish Augustinian Recollect priest and saint (d. 1906)\n*1865 – Erich Ludendorff, German general and politician (d. 1937)\n*  1865   – Charles Proteus Steinmetz, Polish-American mathematician and engineer (d. 1923)\n*1867 – Chris Watson, Chilean-Australian journalist and politician, 3rd Prime Minister of Australia (d. 1941)\n*  1867   – Charles Winckler, Danish tug of war competitor, discus thrower, and shot putter (d. 1932)\n*1872 – Léon Blum, Jewish-French lawyer and politician, Prime Minister of France (d. 1950)\n*1875 – Jacques Futrelle, American journalist and author (d. 1912)\n*1880 – Jan Letzel, Czech architect (d. 1925)\n*1882 – Frederick Francis IV, Grand Duke of Mecklenburg-Schwerin (d. 1946)\n*  1882   – Otz Tollen, German actor (d. 1965)\n*1883 – Frank King, American cartoonist (d. 1969)\n*1887 – Konrad Tom, Polish actor, writer, singer, and director (d. 1957)\n*1888 – Sol Hurok, Ukrainian-American talent manager (d. 1974)\n*1893 – Charles E. Burchfield, American painter (d.1967)\n*  1893   – Victor Gollancz, English publisher, founded Victor Gollancz Ltd (d. 1967)\n*  1893   – Rahul Sankrityayan, Indian linguist, author, and scholar (d. 1963)\n*1895 – Mance Lipscomb, American singer-songwriter and guitarist (d. 1976)\n*  1895   – Michel Simon, Swiss-French actor (d. 1975)\n*1897 – John B. Gambling, American radio host (d. 1974)\n*1898 – Curly Lambeau, American football player and coach (d. 1965)\n*  1898   – Paul Robeson, American singer, actor, and activist (d. 1976)\n*1900 – Allen Jenkins, American actor and singer (d. 1974)\n*1901 – Jean Bruchési, Canadian historian and author (d. 1979)\n*  1901   – Paul Willis, American actor and director (d. 1960)\n*1902 – Théodore Monod, French explorer and scholar (d. 2000)\n*1903 – Ward Bond, American actor (d. 1960)\n*1904 – Sharkey Bonano, American singer, trumpet player, and bandleader (d. 1972)\n*1905 – J. William Fulbright, American lawyer and politician (d. 1995)\n*1906 – Rafaela Aparicio, Spanish actress (d. 1996)\n*  1906   – Antal Doráti, Hungarian-American conductor and composer (d. 1988)\n*1908 – Joseph Krumgold, American author and screenwriter (d. 1980)\n*  1908   – Victor Vasarely, Hungarian-French painter (d. 1997)\n*1909 – Robert Helpmann, Australian dancer, actor, and choreographer (d. 1986)\n*1910 – Abraham A. Ribicoff, American lawyer and politician, 4th United States Secretary of Health and Human Services (d. 1998)\n*1912 – Lev Kopelev, Ukrainian-German author and academic (d. 1997)\n*1915 – Daniel Johnson, Sr., Canadian lawyer and politician, 20th Premier of Quebec (d. 1968)\n*1916 – Julian Dash, American swing music jazz tenor saxophonist (d. 1974)\n*  1916   – Heinz Meyer, German Fallschirmjäger during World War II (d. 1987)\n*  1916   – Bill Leonard, American journalist (d. 1994)\n*1917 – Johannes Bobrowski, German songwriter and poet (d. 1965)\n*  1917   – Ronnie Burgess, Welsh footballer and manager (d. 2005)\n*  1917   – Brad Dexter, American actor (d. 2002)\n*1918 – Jørn Utzon, Danish architect, designed the Sydney Opera House (d. 2008)\n*1919 – J. Presper Eckert, American engineer, invented the ENIAC (d. 1995)\n*1921 – Jean-Marie Balestre, French businessman (d. 2008)\n*  1921   – Yitzhak Navon, Israeli politician (d. 2015)\n*  1921   – Frankie Thomas, American actor (d. 2006)\n*  1921   – Mary Jackson, African American mathematician and aerospace engineer (d. 2005)\n*1922 – Carl Amery, German author and activist (d. 2005)\n*1923 – Leonard Levy, American historian and author (d. 2006)\n*1924 – Arthur Shaw, English professional footballer (d. 2015)\n*1925 – Virginia Gibson, American actress, singer, and dancer (d. 2013)\n*  1925   – Art Kane, American photographer (d. 1995)\n*1926 – Gerry Fitt, Northern Irish soldier and politician; British life peer (d. 2005)\n*  1926   – Hugh Hefner, American publisher, founded Playboy Enterprises (d. 2017)\n*1927 – Tiny Hill, New Zealand rugby player\n*1928 – Paul Arizin, American basketball player (d. 2006)\n*  1928   – Tom Lehrer, American singer-songwriter, pianist, and mathematician\n*1929 – Sharan Rani Backliwal, Indian sarod player and scholar (d. 2008)\n*  1929   – Fred Hollows, New Zealand-Australian ophthalmologist (d. 1993)\n*  1929   – Paule Marshall, American author and academic\n*1930 – Nathaniel Branden, Canadian-American psychotherapist and author (d. 2014)\n*  1930   – F. Albert Cotton, American chemist and academic (d. 2007)\n*  1930   – Wallace McCain, Canadian businessman, founded McCain Foods (d. 2011)\n*1931 – Richard Hatfield, Canadian lawyer and politician, 26th Premier of New Brunswick (d. 1991)\n*1932 – Jim Fowler, American zoologist and television host\n*  1932   – Armin Jordan, Swiss conductor (d. 2006)\n*  1932   – Peter Moores, English businessman and philanthropist (d. 2016)\n*  1932   – Carl Perkins, American singer-songwriter and guitarist (d. 1998)\n*1933 – Jean-Paul Belmondo, French actor and producer\n*  1933   – René Burri, Swiss photographer and journalist (d. 2014)\n*  1933   – Fern Michaels, American author\n*  1933   – Richard Rose, American political scientist and academic\n*  1933   – Gian Maria Volontè, Italian actor (d. 1994)\n*1934 – Bill Birch, New Zealand surveyor and politician, 38th New Zealand Minister of Finance\n*  1934   – Tom Phillis, Australian motorcycle racer (d. 1962)\n*  1934   – Mariya Pisareva, Russian high jumper\n*1935 – Aulis Sallinen, Finnish composer and academic\n*  1935   – Avery Schreiber, American actor and comedian (d. 2002)\n*1936 – Jerzy Maksymiuk, Polish pianist, composer, and conductor\n*  1936   – Valerie Solanas, American radical feminist author, attempted murderer (d. 1988)\n*1937 – Simon Brown, Baron Brown of Eaton-under-Heywood, English lieutenant, lawyer, and judge\n*  1937   – Marty Krofft, Canadian screenwriter and producer\n*  1937   – Valerie Singleton, English television and radio host\n*1938 – Viktor Chernomyrdin, Russian businessman and politician, 30th Prime Minister of Russia (d. 2010)\n*1939 – Michael Learned, American actress \n*1940 – Hans-Joachim Reske, German sprinter\n*  1940   – Jim Roberts, Canadian-American ice hockey player and coach (d. 2015)\n*1941 – Kay Adams, American singer-songwriter\n*1942 – Brandon deWilde, American actor (d. 1972)\n*  1942   – Margo Smith, American singer-songwriter\n*1943 – Terry Knight, American singer-songwriter and producer (d. 2004)\n*1944 – Joe Brinkman, American baseball player and umpire\n*  1944   – Heinz-Joachim Rothenburg, German shot putter\n*1945 – Steve Gadd, American drummer and percussionist\n*  1945   – Peter Gammons, American journalist\n*1946 – Nate Colbert, American baseball player\n*  1946   – Mike Hancock, English politician\n*  1946   – Alan Knott, English cricketer\n*  1946   – Sara Parkin, Scottish activist and politician\n*  1946   – David Webb, English footballer, coach, and manager\n*1947 – Giovanni Andrea Cornia, Italian economist and academic\n*1948 – Jaya Bachchan, Indian actress and politician\n*  1948   – Michel Parizeau, Canadian ice hockey player and coach\n*  1948   – Patty Pravo, Italian singer\n*1949 – Tony Cragg, English sculptor\n*1950 – Nathan Cook, American actor (d. 1998)\n*1952 – Robert Clark, American author\n*  1952   – Bruce Robertson, New Zealand rugby player\n*  1952   – Tania Tsanaklidou, Greek singer and actress\n*1953 – John Howard, English singer-songwriter and pianist\n*  1953   – Hal Ketchum, American singer-songwriter and guitarist\n*1954 – Ken Kalfus, American journalist and author\n*  1954   – Dennis Quaid, American actor \n*  1954   – Iain Duncan Smith, British soldier and politician, Secretary of State for Work and Pensions\n*1955 – Yamina Benguigui, Algerian-French director and politician\n*  1955   – Joolz Denby, English poet and author\n*1956 – Miguel Ángel Russo, Argentinian footballer and coach\n*  1956   – Nigel Shadbolt, English computer scientist and academic\n*  1956   – Vahur Sova, Estonian architect\n*  1956   – Marina Zueva, Russian ice dancer and coach\n*1957 – Seve Ballesteros, Spanish golfer and architect (d. 2011)\n*  1957   – Martin Margiela, Belgian fashion designer\n* 1957 – Jamie Redfern  English-born Australian television presenter and pop singer\n*1958 – Tony Sibson, English boxer\n*  1958   – Nigel Slater, English journalist and author\n*1959 – Bernard Jenkin, English businessman and politician, Shadow Secretary of State for Defence\n*1960 – Jaak Aab, Estonian educator and politician, Minister of Social Affairs of Estonia\n*1961 – Mark Kelly, Irish keyboard player \n*  1961   – Kirk McCaskill, Canadian-American baseball and hockey player\n*1962 – John Eaves, American production designer and illustrator\n*  1962   – Ihor Podolchak, Ukrainian director, producer, and screenwriter\n*  1962   – Imran Sherwani, English field hockey player\n*  1962   – Jeff Turner, American basketball player, coach, and sportscaster\n*1963 – Marc Jacobs, American-French fashion designer\n*  1963   – Joe Scarborough, American journalist, lawyer, and politician\n*1964 – Rob Awalt, German-American football player\n*  1964   – Juliet Cuthbert, Jamaican sprinter\n*  1964   – Peter Penashue, Canadian businessman and politician, 9th Canadian Minister of Intergovernmental Affairs\n*  1964   – Margaret Peterson Haddix, American author\n*  1964   – Rick Tocchet, Canadian-American ice hockey player and coach\n*1965 – Helen Alfredsson, Swedish golfer\n*  1965   – Paulina Porizkova, Czech-born Swedish-American model and actress\n*  1965   – Jeff Zucker, American businessman\n*1966 – John Hammond, English weather forecaster\n*  1966   – Cynthia Nixon, American actress \n*1967 – Natascha Engel, German-English translator and politician\n*  1967   – Sam Harris, American author, philosopher, and neuroscientist\n*1968 – Jay Chandrasekhar, American actor, comedian, writer and director\n*1969 – Barnaby Kay, English actor\n*  1969   – Linda Kisabaka, German runner\n*1970 – Chorão, Brazilian singer-songwriter (d. 2013)\n*1971 – Peter Canavan, Irish footballer and manager\n*  1971   – Leo Fortune-West, English footballer and manager\n*  1971   – Austin Peck, American actor\n*  1971   – Jacques Villeneuve, Canadian race car driver\n*1972 – Bernard Ackah, German-Japanese martial artist and kick-boxer\n*  1972   – Siiri Vallner, Estonian architect\n*1973 – Spencer Rice, Canadian actor, director, producer, and screenwriter\n*1974 – Megan Connolly, Australian actress (d. 2001)\n*  1974   – Jenna Jameson, American actress and pornographic performer\n*1975 – Robbie Fowler, English footballer and manager\n*  1975   – David Gordon Green, American director and screenwriter\n*1976 – Kyle Peterson, American baseball player and sportscaster\n*1977   – Gerard Way, American singer-songwriter and comic book writer\n*1978 – Kousei Amano, Japanese actor\n*  1978   – Jorge Andrade, Portuguese footballer\n*  1978   – Rachel Stevens, Jewish-English singer-songwriter, dancer, and actress \n*1979 – Albert Hammond, Jr., American singer-songwriter and guitarist \n*  1979   – Jeff Reed, American football player\n*1980 – Sarah Ayton, English sailor\n*  1980   – Luciano Galletti, Argentinian footballer\n*1981 – Milan Bartovič, Czech ice hockey player\n*  1981   – A. J. Ellis, American baseball player\n*  1981   – Ireneusz Jeleń, Polish footballer\n*  1981   – Dennis Sarfate, American baseball player\n*1982 – Jay Baruchel, Canadian actor\n*  1982   – Carlos Hernández, Costa Rican footballer\n*  1982   – Kathleen Munroe, Canadian-American actress\n*1983 – Ryan Clark, Australian actor\n*  1983   – Willie Colon, American football player\n*1984 – Habiba Ghribi, Tunisian runner\n*  1984   – Adam Loewen, Canadian baseball player\n*  1984   – Óscar Razo, Mexican footballer\n*1985 – Antonio Nocerino, Italian footballer\n*  1985   – David Robertson, American baseball player\n*1986 – Mike Hart, American football player\n*  1986   – Leighton Meester, American actress \n*1987 – Kassim Abdallah, French-Comorian footballer\n*  1987   – Graham Gano, American football player\n*  1987   – Craig Mabbitt, American singer\n*  1987   – Jesse McCartney, American singer-songwriter and actor \n*  1987   – Jarrod Mullen, Australian rugby league player\n*  1987   – Jazmine Sullivan, American singer-songwriter\n*1988 – Michel Alves Baroni, Brazilian footballer\n*  1988   – Jeremy Metcalfe, English race car driver\n*1989 – Danielle Kahle, American figure skater\n*1990 – Kristen Stewart, American actress\n*  1990   – Ryan Williams, American football player\n*1991 – Ryan Kelly, American basketball player\n*  1991   – Mary Killman, American synchronized swimmer\n*1992 – Joshua Ledet, American singer\n*1994 – Joey Pollari, American actor\n*1995 – Domagoj Bošnjak, Croatian basketball player\n*  1995   – Robert Bauer, German-Kazakhstani footballer\n*1996 – Jayden Brailey, Australian rugby league player\n*  1996   – Emerson Hyndman, American soccer player\n*1998 – Elle Fanning, American actress\n*2000 – Jackie Evancho, American singer \n\nDeaths\n\n* 585 BC – Emperor Jimmu, the first Emperor of Japan (b. 711 BC)\n* AD 93 – Yuan An, Chinese scholar and politician\n* 436 – Tan Daoji, Chinese general and politician\n* 491 – Zeno, Byzantine emperor (b. 425)\n* 682 – Maslama ibn Mukhallad al-Ansari, Egyptian politician, Governor of Egypt (b. 616)\n* 715 – Pope Constantine (b. 664)\n*1024 – Pope Benedict VIII (b. 980)\n*1137 – William X, Duke of Aquitaine (b. 1099)\n*1241 – Duke Henry II of Poland\n*1283 – Margaret of Scotland, Queen of Norway (b. 1261; childbirth)\n*1327 – Walter Stewart, 6th High Steward of Scotland (ca. 1296)\n*1483 – Edward IV of England (b. 1442)\n*1484 – Edward of Middleham, Prince of Wales (b. 1473)\n*1553 – François Rabelais, French monk and scholar (b. 1494)\n*1557 – Mikael Agricola, Finnish priest and scholar (b. 1510)\n*1626 – Francis Bacon, English jurist and politician, Attorney General for England and Wales (b. 1561)\n*1654 – Matei Basarab, Romanian prince (b. 1588)\n*1693 – Roger de Rabutin, Comte de Bussy, French author (b. 1618)\n*1747 – Simon Fraser, 11th Lord Lovat, Scottish soldier and politician (b. 1667)\n*1754 – Christian Wolff, German philosopher and academic (b. 1679)\n*1761 – William Law, English priest and theologian (b. 1686)\n*1768 – Sarah Fielding, English author (b. 1710)\n*1804 – Jacques Necker, Swiss-French politician, Chief Minister to the French Monarch (b. 1732)\n*1806 – William V, Prince of Orange (b. 1748)\n*1872 – Erastus Corning, American businessman and politician (b. 1794)\n*1876 – Charles Goodyear, American lawyer, judge, and politician (b. 1804)\n*1882 – Dante Gabriel Rossetti, English poet and painter (b. 1828)\n*1889 – Michel Eugène Chevreul, French chemist and academic (b. 1786)\n*1909 – Helena Modjeska, Polish-American actress (b. 1840)\n*1915 – Raymond Whittindale, English rugby player (b. 1883)\n*1917 – James Hope Moulton, English philologist and scholar (b. 1863)\n*1922 – Hans Fruhstorfer, German entomologist and explorer (b. 1866)\n*1926 – Zip the Pinhead, American freak show performer (b. 1857)\n*1936 – Ferdinand Tönnies, German sociologist and philosopher (b. 1855)\n*1940 – Mrs. Patrick Campbell, English actress (b. 1865)\n*1944 – Yevgeniya Rudneva, Ukrainian lieutenant and pilot (b. 1920)\n*1945 – Dietrich Bonhoeffer, German pastor and theologian (b. 1906)\n*  1945   – Wilhelm Canaris, German admiral (b. 1887)\n*  1945   – Johann Georg Elser, German carpenter (b. 1903)\n*  1945   – Hans Oster, German general (b. 1887)\n*  1945   – Karl Sack, German lawyer and jurist (b. 1896)\n*  1945   – Hans von Dohnányi, Austrian-German lawyer and jurist (b. 1902)\n*1948 – George Carpenter, Australian 5th General of The Salvation Army (b. 1872)\n*  1948   – Jorge Eliécer Gaitán, Colombian lawyer and politician, 16th Colombian Minister of National Education (b. 1903)\n*1951 – Vilhelm Bjerknes, Norwegian physicist and meteorologist (b. 1862)\n*1953 – Eddie Cochems, American football player and coach (b. 1877)\n*  1953   – C. E. M. Joad, English philosopher and television host (b. 1891)\n*  1953   – Hans Reichenbach, German philosopher from the Vienna Circle (b. 1891)\n*1959 – Frank Lloyd Wright, American architect, designed the Price Tower and Fallingwater (b. 1867)\n*1961 – Zog I of Albania (b. 1895)\n*1963 – Eddie Edwards, American trombonist (b. 1891)\n*  1963   – Xul Solar, Argentinian painter and sculptor (b. 1887)\n*1970 – Gustaf Tenggren, Swedish-American illustrator and animator (b. 1896)\n*1976 – Dagmar Nordstrom, American singer-songwriter and pianist (b. 1903)\n*  1976   – Phil Ochs, American singer-songwriter and guitarist (b. 1940)\n*  1976   – Renato Petronio, Italian rower (b. 1891)\n*1978 – Clough Williams-Ellis, English-Welsh architect, designed Portmeirion (b. 1883)\n*1980 – Muhammad Baqir al-Sadr, Iraqi cleric and philosopher (b. 1935)\n*1982 – Wilfrid Pelletier, Canadian pianist, composer, and conductor (b. 1896)\n*1988 – Brook Benton, American singer-songwriter and actor (b. 1931)\n*  1988   – Hans Berndt, German footballer (b. 1913)\n*  1988   – Dave Prater, American singer (b. 1937)\n*1991 – Forrest Towns, American hurdler and coach (b. 1914)\n*1993 – Joseph B. Soloveitchik, American rabbi and philosopher (b. 1903)\n*1996 – Richard Condon, American author and publicist (b. 1915)\n*1997 – Mae Boren Axton, American singer-songwriter (b. 1914)\n*  1997   – Helene Hanff, American author and screenwriter (b. 1916)\n*1998 – Tom Cora, American cellist and composer (b. 1953)\n*1999 – Ibrahim Baré Maïnassara, Nigerien general and politician, President of Niger (b. 1949)\n*2001 – Willie Stargell, American baseball player and coach (b. 1940)\n*2002 – Pat Flaherty, American race car driver (b. 1926)\n*  2002   – Leopold Vietoris, Austrian soldier, mathematician, and academic (b. 1891)\n*2003 – Jerry Bittle, American cartoonist (b. 1949)\n*2006 – Billy Hitchcock, American baseball player, coach, manager (b. 1916)\n*  2006   – Vilgot Sjöman, Swedish director and screenwriter (b. 1924)\n*2007 – Egon Bondy, Czech philosopher and poet (b. 1930)\n*  2007   – Dorrit Hoffleit, American astronomer and academic (b. 1907)\n*2009 – Nick Adenhart, American baseball player (b. 1986)\n*2010 – Zoltán Varga, Hungarian footballer and manager (b. 1945)\n*2011 – Zakariya Rashid Hassan al-Ashiri, Bahraini journalist (b. 1971)\n*  2011   – Sidney Lumet, American director, producer, and screenwriter (b. 1924)\n*2012 – Malcolm Thomas, Welsh rugby player and cricketer (b. 1929)\n*2013 – David Hayes, American sculptor and painter (b. 1931)\n*  2013   – Greg McCrary, American football player (b. 1952)\n*  2013   – Mordechai Mishani, Israeli lawyer and politician (b. 1945)\n*  2013   – McCandlish Phillips, American journalist and author (b. 1927)\n*  2013   – Paolo Soleri, Italian-American architect, designed the Cosanti (b. 1919)\n*2014 – Gil Askey, American trumpet player, composer, and producer (b. 1925)\n*  2014   – Chris Banks, American football player (b. 1973)\n*  2014   – Rory Ellinger, American lawyer and politician (b. 1941)\n*  2014   – Norman Girvan, Jamaican economist, academic, and politician (b. 1941)\n*  2014   – Aelay Narendra, Indian politician (b. 1946)\n*  2014   – A. N. R. Robinson, Trinbagonian politician, 3rd President of Trinidad and Tobago (b. 1926)\n*  2014   – Svetlana Velmar-Janković, Serbian author (b. 1933)\n*2015 – Paul Almond, Canadian-American director, producer, and screenwriter (b. 1931)\n*  2015   – Margaret Rule, British marine archaeologist (b. 1928)\n*  2015   – Nina Companeez, French director and screenwriter (b. 1937)\n*  2015   – Alexander Dalgarno, English physicist and academic (b. 1928)\n*  2015   – Ivan Doig, American journalist and author (b. 1939)\n*  2015   – Tsien Tsuen-hsuin, Chinese-American academic (b. 1909)\n*2016 – Duane Clarridge, American spy (b. 1932)\n*  2016   – Will Smith, American football player (b. 1981)\n*2017 – John Clarke, comedian, writer, and satirist (b. 1948)\n\nHolidays and observances\n\n*Christian feast day:\n**Dietrich Bonhoeffer (Anglicanism, Lutheranism)\n**Gaucherius\n**Materiana\n**Waltrude\n**April 9 (Eastern Orthodox liturgics)\n*Anniversary of the German Invasion of Denmark (Denmark)\n*Baghdad Liberation Day (Iraqi Kurdistan)\n*Bataan Day or Araw ng Kagitingan (Philippines)\n*Constitution Day (Kosovo)\n*Day of National Unity (Georgia)\n*Day of the Finnish Language (Finland)\n*Feast of the Second Day of the Writing of the Book of the Law (Thelema)\n*Martyr's Day (Tunisia)\n*National Former Prisoner of War Recognition Day (United States) \n*Remembrance for Haakon Sigurdsson (The Troth)\n*Vimy Ridge Day (Canada)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "April 9" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1787" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 190 – Dong Zhuo has his troops evacuate the capital Luoyang and burn it to the ground.\n* 475 – Byzantine Emperor Basiliscus issues a circular letter (Enkyklikon) to the bishops of his empire, supporting the Monophysite christological position.\n* 537 – Siege of Rome: The Byzantine general Belisarius receives his promised reinforcements, 1,600 cavalry, mostly of Hunnic or Slavic origin and expert bowmen. He starts, despite shortages, raids against the Gothic camps and Vitiges is forced into a stalemate.\n*1241 – Battle of Liegnitz: Mongol forces defeat the Polish and German armies.\n*1288 – Mongol invasions of Vietnam: Yuan forces are defeated by Trần forces in the Battle of Bach Dang in present-day northern Vietnam.\n*1388 – Despite being outnumbered 16 to 1, forces of the Old Swiss Confederacy are victorious over the Archduchy of Austria in the Battle of Näfels.\n*1413 – Henry V is crowned King of England.\n*1440 – Christopher of Bavaria is appointed King of Denmark.\n*1454 – The Treaty of Lodi is signed, establishing a balance of power among northern Italian city-states for almost 50 years.\n*1511 – St John's College, Cambridge, England, founded by Lady Margaret Beaufort, receives its charter.\n*1585 – The expedition organised by Sir Walter Raleigh departs England for Roanoke Island (now in North Carolina) to establish the Roanoke Colony.\n*1609 – Eighty Years' War: Spain and the Dutch Republic sign the Treaty of Antwerp to initiate twelve years of truce.\n*  1609   – Philip III of Spain issues the decree of the \"Expulsion of the Moriscos\". \n*1682 – Robert Cavelier de La Salle discovers the mouth of the Mississippi River, claims it for France and names it Louisiana.\n*1782 – American Revolutionary War: Battle of the Saintes begins.\n*1860 – On his phonautograph machine, Édouard-Léon Scott de Martinville makes the oldest known recording of an audible human voice.\n*1865 – American Civil War: Robert E. Lee surrenders the Army of Northern Virginia (26,765 troops) to Ulysses S. Grant at Appomattox Courthouse, Virginia, effectively ending the war.\n*1909 – The U.S. Congress passes the Payne–Aldrich Tariff Act.\n*1914 – Mexican Revolution: One of the world's first naval/air skirmishes takes place off the coast of western Mexico.\n*1916 – World War I: The Battle of Verdun: German forces launch their third offensive of the battle.\n*1917 – World War I: The Battle of Arras: The battle begins with Canadian Corps executing a massive assault on Vimy Ridge.\n*1918 – World War I: The Battle of the Lys: The Portuguese Expeditionary Corps is crushed by the German forces during what is called the Spring Offensive on the Belgian region of Flanders.\n*  1918   – The National Council of Bessarabia proclaims union with the Kingdom of Romania.\n*1937 – The Kamikaze arrives at Croydon Airport in London. It is the first Japanese-built aircraft to fly to Europe.\n*1939 – Marian Anderson sings at the Lincoln Memorial, after being denied the right to sing at the Daughters of the American Revolution's Constitution Hall.\n*1940 – World War II: Operation Weserübung: Germany invades Denmark and Norway.\n*  1940   – Vidkun Quisling seizes power in Norway.\n*1942 – World War II: The Battle of Bataan/Bataan Death March: United States forces surrender on the Bataan Peninsula. The Japanese Navy launches an air raid on Trincomalee in Ceylon (Sri Lanka); Royal Navy aircraft carrier  and Royal Australian Navy Destroyer  are sunk off the island's east coast.\n*1945 – Execution of Dietrich Bonhoeffer, anti-Nazi dissident and spy, by the Nazi regime.\n* 1945    – World War II: The German pocket battleship Admiral Scheer is sunk by the Royal Air Force\n*  1945   – World War II: The Battle of Königsberg, in East Prussia, ends.\n*  1945   – The United States Atomic Energy Commission is formed.\n*1947 – The Glazier–Higgins–Woodward tornadoes kill 181 and injure 970 in Texas, Oklahoma, and Kansas.\n*  1947   – The Journey of Reconciliation, the first interracial Freedom Ride begins through the upper South in violation of Jim Crow laws. The riders wanted enforcement of the United States Supreme Court's 1946 Irene Morgan decision that banned racial segregation in interstate travel.\n*1948 – Jorge Eliécer Gaitán's assassination provokes a violent riot in Bogotá (the Bogotazo), and a further ten years of violence in Colombia.\n*  1948   – Fighters from the Irgun and Lehi Zionist paramilitary groups attacked Deir Yassin near Jerusalem, killing over 100.\n*1952 – Hugo Ballivián's government is overthrown by the Bolivian National Revolution, starting a period of agrarian reform, universal suffrage and the nationalization of tin mines\n*1957 – The Suez Canal in Egypt is cleared and opens to shipping.\n*1959 – Project Mercury: NASA announces the selection of the United States' first seven astronauts, whom the news media quickly dub the \"Mercury Seven\".\n*1960 – Dr Hendrik Verwoerd, Prime Minister of South Africa and architect of apartheid, narrowly survives an assassination attempt by a white farmer, David Pratt in Johannesburg.\n*1961 – The Pacific Electric Railway in Los Angeles, once the largest electric railway in the world, ends operations.\n*1965 – Astrodome opens. First indoor baseball game is played.\n*1967 – The first Boeing 737 (a 100 series) makes its maiden flight.\n*1969 – The first British-built Concorde 002 makes its maiden flight from Filton to RAF Fairford.\n*1975 – The first game of the Philippine Basketball Association, the second oldest professional basketball league in the world.\n*1976 – The EMD F40PH diesel locomotive enters revenue service with Amtrak.\n*1980 – The Iraqi regime of Saddam Hussein kills philosopher Muhammad Baqir al-Sadr and his sister Bint al-Huda after three days of torture.\n*1981 – The U.S. Navy nuclear submarine  accidentally collides with the Nissho Maru, a Japanese cargo ship, sinking it.\n*1989 – Tbilisi massacre: an anti-Soviet peaceful demonstration and hunger strike in Tbilisi, demanding restoration of Georgian independence, is dispersed by the Soviet Army, resulting in 20 deaths and hundreds of injuries.\n*1991 – Georgia declares independence from the Soviet Union\n*1992 – A U.S. Federal Court finds former Panamanian dictator Manuel Noriega guilty of drug and racketeering charges. He is sentenced to 30 years in prison.\n*1999 – Kosovo War: The Battle of Košare begins.\n*2003 – Iraq War: Baghdad falls to American forces; Iraqis turn on symbols of their former leader Saddam Hussein, pulling down a grand statue of him and tearing it to pieces.\n*2005 – Charles, Prince of Wales marries Camilla Parker Bowles in a civil ceremony at Windsor's Guildhall.\n*2009 – In Tbilisi, Georgia, up to 60,000 people protest against the government of Mikheil Saakashvili.\n*2013 – A 6.1–magnitude earthquake strikes Iran killing 32 people and injuring over 850 people.\n*  2013   – At least 13 people are killed and another three injured after a man goes on a spree shooting in the Serbian village of Velika Ivanča.\n*2014 – A student stabs 20 people at Franklin Regional High School in Murrysville, Pennsylvania.\n*2017 – Palm Sunday church bombings at Coptic Churches in Tanta and Alexandria take place.\n\nBirths\n\n*1283 – Margaret, Maid of Norway, Queen of Scotland (d. 1290)\n*1285 – Ayurbarwada Buyantu Khan, Emperor Renzong of Yuan (d. 1320)\n*1458 – Camilla Battista da Varano, Italian saint (d. 1524)\n*1498 – Jean, Cardinal of Lorraine (d. 1550)\n*1586 – Julius Henry, Duke of Saxe-Lauenburg (d. 1665)\n*1597 – John Davenport, English minister, co-founded the New Haven Colony (d. 1670)\n*1598 – Johann Crüger, Sorbian-German composer and theorist (d. 1662)\n*1624 – Henrik Rysensteen, Dutch military engineer (d. 1679)\n*1627 – Johann Caspar Kerll, German organist and composer (d. 1693)\n*1634 – Countess Albertine Agnes of Nassau (d. 1696)\n*1648 – Henri de Massue, Earl of Galway, French soldier and diplomat (d. 1720)\n*1649 – James Scott, 1st Duke of Monmouth, Dutch-English general and politician, Lord Lieutenant of Staffordshire (d. 1685)\n*1654 – Samuel Fritz, Czech Jesuit missionary to South America (d. 1725?)\n*1680 – Philippe Néricault Destouches, French playwright (d. 1754)\n*1686 – James Craggs the Younger, English politician, Secretary of State for the Southern Department (d. 1721)\n*1691 – Johann Matthias Gesner, German scholar and academic (d. 1761)\n*1717 – Georg Matthias Monn, Austrian organist, composer, and educator (d. 1750)\n*1770 – Thomas Johann Seebeck, German physicist and academic (d. 1831)\n*1773 – Étienne Aignan, French author and academic (d. 1824)\n*1794 – Theobald Boehm, German flute player and composer (d. 1881)\n*1802 – Elias Lönnrot, Finnish physician and philologist (d. 1884)\n*1806 – Isambard Kingdom Brunel, English engineer, designed the Clifton Suspension Bridge (d. 1859)\n*1807 – James Bannerman, Scottish theologian and academic (d. 1868)\n*1821 – Charles Baudelaire, French poet and critic (d. 1867)\n*1830 – Eadweard Muybridge, English photographer and cinematographer (d. 1904)\n*1835 – Leopold II of Belgium (d. 1909)\n*  1835   – Somerset Lowry-Corry, 4th Earl Belmore (d. 1913)\n*1846 – Paolo Tosti, Italian-English composer and educator (d. 1916)\n*1848 – Ezequiél Moreno y Díaz, Spanish Augustinian Recollect priest and saint (d. 1906)\n*1865 – Erich Ludendorff, German general and politician (d. 1937)\n*  1865   – Charles Proteus Steinmetz, Polish-American mathematician and engineer (d. 1923)\n*1867 – Chris Watson, Chilean-Australian journalist and politician, 3rd Prime Minister of Australia (d. 1941)\n*  1867   – Charles Winckler, Danish tug of war competitor, discus thrower, and shot putter (d. 1932)\n*1872 – Léon Blum, Jewish-French lawyer and politician, Prime Minister of France (d. 1950)\n*1875 – Jacques Futrelle, American journalist and author (d. 1912)\n*1880 – Jan Letzel, Czech architect (d. 1925)\n*1882 – Frederick Francis IV, Grand Duke of Mecklenburg-Schwerin (d. 1946)\n*  1882   – Otz Tollen, German actor (d. 1965)\n*1883 – Frank King, American cartoonist (d. 1969)\n*1887 – Konrad Tom, Polish actor, writer, singer, and director (d. 1957)\n*1888 – Sol Hurok, Ukrainian-American talent manager (d. 1974)\n*1893 – Charles E. Burchfield, American painter (d.1967)\n*  1893   – Victor Gollancz, English publisher, founded Victor Gollancz Ltd (d. 1967)\n*  1893   – Rahul Sankrityayan, Indian linguist, author, and scholar (d. 1963)\n*1895 – Mance Lipscomb, American singer-songwriter and guitarist (d. 1976)\n*  1895   – Michel Simon, Swiss-French actor (d. 1975)\n*1897 – John B. Gambling, American radio host (d. 1974)\n*1898 – Curly Lambeau, American football player and coach (d. 1965)\n*  1898   – Paul Robeson, American singer, actor, and activist (d. 1976)\n*1900 – Allen Jenkins, American actor and singer (d. 1974)\n*1901 – Jean Bruchési, Canadian historian and author (d. 1979)\n*  1901   – Paul Willis, American actor and director (d. 1960)\n*1902 – Théodore Monod, French explorer and scholar (d. 2000)\n*1903 – Ward Bond, American actor (d. 1960)\n*1904 – Sharkey Bonano, American singer, trumpet player, and bandleader (d. 1972)\n*1905 – J. William Fulbright, American lawyer and politician (d. 1995)\n*1906 – Rafaela Aparicio, Spanish actress (d. 1996)\n*  1906   – Antal Doráti, Hungarian-American conductor and composer (d. 1988)\n*1908 – Joseph Krumgold, American author and screenwriter (d. 1980)\n*  1908   – Victor Vasarely, Hungarian-French painter (d. 1997)\n*1909 – Robert Helpmann, Australian dancer, actor, and choreographer (d. 1986)\n*1910 – Abraham A. Ribicoff, American lawyer and politician, 4th United States Secretary of Health and Human Services (d. 1998)\n*1912 – Lev Kopelev, Ukrainian-German author and academic (d. 1997)\n*1915 – Daniel Johnson, Sr., Canadian lawyer and politician, 20th Premier of Quebec (d. 1968)\n*1916 – Julian Dash, American swing music jazz tenor saxophonist (d. 1974)\n*  1916   – Heinz Meyer, German Fallschirmjäger during World War II (d. 1987)\n*  1916   – Bill Leonard, American journalist (d. 1994)\n*1917 – Johannes Bobrowski, German songwriter and poet (d. 1965)\n*  1917   – Ronnie Burgess, Welsh footballer and manager (d. 2005)\n*  1917   – Brad Dexter, American actor (d. 2002)\n*1918 – Jørn Utzon, Danish architect, designed the Sydney Opera House (d. 2008)\n*1919 – J. Presper Eckert, American engineer, invented the ENIAC (d. 1995)\n*1921 – Jean-Marie Balestre, French businessman (d. 2008)\n*  1921   – Yitzhak Navon, Israeli politician (d. 2015)\n*  1921   – Frankie Thomas, American actor (d. 2006)\n*  1921   – Mary Jackson, African American mathematician and aerospace engineer (d. 2005)\n*1922 – Carl Amery, German author and activist (d. 2005)\n*1923 – Leonard Levy, American historian and author (d. 2006)\n*1924 – Arthur Shaw, English professional footballer (d. 2015)\n*1925 – Virginia Gibson, American actress, singer, and dancer (d. 2013)\n*  1925   – Art Kane, American photographer (d. 1995)\n*1926 – Gerry Fitt, Northern Irish soldier and politician; British life peer (d. 2005)\n*  1926   – Hugh Hefner, American publisher, founded Playboy Enterprises (d. 2017)\n*1927 – Tiny Hill, New Zealand rugby player\n*1928 – Paul Arizin, American basketball player (d. 2006)\n*  1928   – Tom Lehrer, American singer-songwriter, pianist, and mathematician\n*1929 – Sharan Rani Backliwal, Indian sarod player and scholar (d. 2008)\n*  1929   – Fred Hollows, New Zealand-Australian ophthalmologist (d. 1993)\n*  1929   – Paule Marshall, American author and academic\n*1930 – Nathaniel Branden, Canadian-American psychotherapist and author (d. 2014)\n*  1930   – F. Albert Cotton, American chemist and academic (d. 2007)\n*  1930   – Wallace McCain, Canadian businessman, founded McCain Foods (d. 2011)\n*1931 – Richard Hatfield, Canadian lawyer and politician, 26th Premier of New Brunswick (d. 1991)\n*1932 – Jim Fowler, American zoologist and television host\n*  1932   – Armin Jordan, Swiss conductor (d. 2006)\n*  1932   – Peter Moores, English businessman and philanthropist (d. 2016)\n*  1932   – Carl Perkins, American singer-songwriter and guitarist (d. 1998)\n*1933 – Jean-Paul Belmondo, French actor and producer\n*  1933   – René Burri, Swiss photographer and journalist (d. 2014)\n*  1933   – Fern Michaels, American author\n*  1933   – Richard Rose, American political scientist and academic\n*  1933   – Gian Maria Volontè, Italian actor (d. 1994)\n*1934 – Bill Birch, New Zealand surveyor and politician, 38th New Zealand Minister of Finance\n*  1934   – Tom Phillis, Australian motorcycle racer (d. 1962)\n*  1934   – Mariya Pisareva, Russian high jumper\n*1935 – Aulis Sallinen, Finnish composer and academic\n*  1935   – Avery Schreiber, American actor and comedian (d. 2002)\n*1936 – Jerzy Maksymiuk, Polish pianist, composer, and conductor\n*  1936   – Valerie Solanas, American radical feminist author, attempted murderer (d. 1988)\n*1937 – Simon Brown, Baron Brown of Eaton-under-Heywood, English lieutenant, lawyer, and judge\n*  1937   – Marty Krofft, Canadian screenwriter and producer\n*  1937   – Valerie Singleton, English television and radio host\n*1938 – Viktor Chernomyrdin, Russian businessman and politician, 30th Prime Minister of Russia (d. 2010)\n*1939 – Michael Learned, American actress \n*1940 – Hans-Joachim Reske, German sprinter\n*  1940   – Jim Roberts, Canadian-American ice hockey player and coach (d. 2015)\n*1941 – Kay Adams, American singer-songwriter\n*1942 – Brandon deWilde, American actor (d. 1972)\n*  1942   – Margo Smith, American singer-songwriter\n*1943 – Terry Knight, American singer-songwriter and producer (d. 2004)\n*1944 – Joe Brinkman, American baseball player and umpire\n*  1944   – Heinz-Joachim Rothenburg, German shot putter\n*1945 – Steve Gadd, American drummer and percussionist\n*  1945   – Peter Gammons, American journalist\n*1946 – Nate Colbert, American baseball player\n*  1946   – Mike Hancock, English politician\n*  1946   – Alan Knott, English cricketer\n*  1946   – Sara Parkin, Scottish activist and politician\n*  1946   – David Webb, English footballer, coach, and manager\n*1947 – Giovanni Andrea Cornia, Italian economist and academic\n*1948 – Jaya Bachchan, Indian actress and politician\n*  1948   – Michel Parizeau, Canadian ice hockey player and coach\n*  1948   – Patty Pravo, Italian singer\n*1949 – Tony Cragg, English sculptor\n*1950 – Nathan Cook, American actor (d. 1998)\n*1952 – Robert Clark, American author\n*  1952   – Bruce Robertson, New Zealand rugby player\n*  1952   – Tania Tsanaklidou, Greek singer and actress\n*1953 – John Howard, English singer-songwriter and pianist\n*  1953   – Hal Ketchum, American singer-songwriter and guitarist\n*1954 – Ken Kalfus, American journalist and author\n*  1954   – Dennis Quaid, American actor \n*  1954   – Iain Duncan Smith, British soldier and politician, Secretary of State for Work and Pensions\n*1955 – Yamina Benguigui, Algerian-French director and politician\n*  1955   – Joolz Denby, English poet and author\n*1956 – Miguel Ángel Russo, Argentinian footballer and coach\n*  1956   – Nigel Shadbolt, English computer scientist and academic\n*  1956   – Vahur Sova, Estonian architect\n*  1956   – Marina Zueva, Russian ice dancer and coach\n*1957 – Seve Ballesteros, Spanish golfer and architect (d. 2011)\n*  1957   – Martin Margiela, Belgian fashion designer\n* 1957 – Jamie Redfern  English-born Australian television presenter and pop singer\n*1958 – Tony Sibson, English boxer\n*  1958   – Nigel Slater, English journalist and author\n*1959 – Bernard Jenkin, English businessman and politician, Shadow Secretary of State for Defence\n*1960 – Jaak Aab, Estonian educator and politician, Minister of Social Affairs of Estonia\n*1961 – Mark Kelly, Irish keyboard player \n*  1961   – Kirk McCaskill, Canadian-American baseball and hockey player\n*1962 – John Eaves, American production designer and illustrator\n*  1962   – Ihor Podolchak, Ukrainian director, producer, and screenwriter\n*  1962   – Imran Sherwani, English field hockey player\n*  1962   – Jeff Turner, American basketball player, coach, and sportscaster\n*1963 – Marc Jacobs, American-French fashion designer\n*  1963   – Joe Scarborough, American journalist, lawyer, and politician\n*1964 – Rob Awalt, German-American football player\n*  1964   – Juliet Cuthbert, Jamaican sprinter\n*  1964   – Peter Penashue, Canadian businessman and politician, 9th Canadian Minister of Intergovernmental Affairs\n*  1964   – Margaret Peterson Haddix, American author\n*  1964   – Rick Tocchet, Canadian-American ice hockey player and coach\n*1965 – Helen Alfredsson, Swedish golfer\n*  1965   – Paulina Porizkova, Czech-born Swedish-American model and actress\n*  1965   – Jeff Zucker, American businessman\n*1966 – John Hammond, English weather forecaster\n*  1966   – Cynthia Nixon, American actress \n*1967 – Natascha Engel, German-English translator and politician\n*  1967   – Sam Harris, American author, philosopher, and neuroscientist\n*1968 – Jay Chandrasekhar, American actor, comedian, writer and director\n*1969 – Barnaby Kay, English actor\n*  1969   – Linda Kisabaka, German runner\n*1970 – Chorão, Brazilian singer-songwriter (d. 2013)\n*1971 – Peter Canavan, Irish footballer and manager\n*  1971   – Leo Fortune-West, English footballer and manager\n*  1971   – Austin Peck, American actor\n*  1971   – Jacques Villeneuve, Canadian race car driver\n*1972 – Bernard Ackah, German-Japanese martial artist and kick-boxer\n*  1972   – Siiri Vallner, Estonian architect\n*1973 – Spencer Rice, Canadian actor, director, producer, and screenwriter\n*1974 – Megan Connolly, Australian actress (d. 2001)\n*  1974   – Jenna Jameson, American actress and pornographic performer\n*1975 – Robbie Fowler, English footballer and manager\n*  1975   – David Gordon Green, American director and screenwriter\n*1976 – Kyle Peterson, American baseball player and sportscaster\n*1977   – Gerard Way, American singer-songwriter and comic book writer\n*1978 – Kousei Amano, Japanese actor\n*  1978   – Jorge Andrade, Portuguese footballer\n*  1978   – Rachel Stevens, Jewish-English singer-songwriter, dancer, and actress \n*1979 – Albert Hammond, Jr., American singer-songwriter and guitarist \n*  1979   – Jeff Reed, American football player\n*1980 – Sarah Ayton, English sailor\n*  1980   – Luciano Galletti, Argentinian footballer\n*1981 – Milan Bartovič, Czech ice hockey player\n*  1981   – A. J. Ellis, American baseball player\n*  1981   – Ireneusz Jeleń, Polish footballer\n*  1981   – Dennis Sarfate, American baseball player\n*1982 – Jay Baruchel, Canadian actor\n*  1982   – Carlos Hernández, Costa Rican footballer\n*  1982   – Kathleen Munroe, Canadian-American actress\n*1983 – Ryan Clark, Australian actor\n*  1983   – Willie Colon, American football player\n*1984 – Habiba Ghribi, Tunisian runner\n*  1984   – Adam Loewen, Canadian baseball player\n*  1984   – Óscar Razo, Mexican footballer\n*1985 – Antonio Nocerino, Italian footballer\n*  1985   – David Robertson, American baseball player\n*1986 – Mike Hart, American football player\n*  1986   – Leighton Meester, American actress \n*1987 – Kassim Abdallah, French-Comorian footballer\n*  1987   – Graham Gano, American football player\n*  1987   – Craig Mabbitt, American singer\n*  1987   – Jesse McCartney, American singer-songwriter and actor \n*  1987   – Jarrod Mullen, Australian rugby league player\n*  1987   – Jazmine Sullivan, American singer-songwriter\n*1988 – Michel Alves Baroni, Brazilian footballer\n*  1988   – Jeremy Metcalfe, English race car driver\n*1989 – Danielle Kahle, American figure skater\n*1990 – Kristen Stewart, American actress\n*  1990   – Ryan Williams, American football player\n*1991 – Ryan Kelly, American basketball player\n*  1991   – Mary Killman, American synchronized swimmer\n*1992 – Joshua Ledet, American singer\n*1994 – Joey Pollari, American actor\n*1995 – Domagoj Bošnjak, Croatian basketball player\n*  1995   – Robert Bauer, German-Kazakhstani footballer\n*1996 – Jayden Brailey, Australian rugby league player\n*  1996   – Emerson Hyndman, American soccer player\n*1998 – Elle Fanning, American actress\n*2000 – Jackie Evancho, American singer \n\nDeaths\n\n* 585 BC – Emperor Jimmu, the first Emperor of Japan (b. 711 BC)\n* AD 93 – Yuan An, Chinese scholar and politician\n* 436 – Tan Daoji, Chinese general and politician\n* 491 – Zeno, Byzantine emperor (b. 425)\n* 682 – Maslama ibn Mukhallad al-Ansari, Egyptian politician, Governor of Egypt (b. 616)\n* 715 – Pope Constantine (b. 664)\n*1024 – Pope Benedict VIII (b. 980)\n*1137 – William X, Duke of Aquitaine (b. 1099)\n*1241 – Duke Henry II of Poland\n*1283 – Margaret of Scotland, Queen of Norway (b. 1261; childbirth)\n*1327 – Walter Stewart, 6th High Steward of Scotland (ca. 1296)\n*1483 – Edward IV of England (b. 1442)\n*1484 – Edward of Middleham, Prince of Wales (b. 1473)\n*1553 – François Rabelais, French monk and scholar (b. 1494)\n*1557 – Mikael Agricola, Finnish priest and scholar (b. 1510)\n*1626 – Francis Bacon, English jurist and politician, Attorney General for England and Wales (b. 1561)\n*1654 – Matei Basarab, Romanian prince (b. 1588)\n*1693 – Roger de Rabutin, Comte de Bussy, French author (b. 1618)\n*1747 – Simon Fraser, 11th Lord Lovat, Scottish soldier and politician (b. 1667)\n*1754 – Christian Wolff, German philosopher and academic (b. 1679)\n*1761 – William Law, English priest and theologian (b. 1686)\n*1768 – Sarah Fielding, English author (b. 1710)\n*1804 – Jacques Necker, Swiss-French politician, Chief Minister to the French Monarch (b. 1732)\n*1806 – William V, Prince of Orange (b. 1748)\n*1872 – Erastus Corning, American businessman and politician (b. 1794)\n*1876 – Charles Goodyear, American lawyer, judge, and politician (b. 1804)\n*1882 – Dante Gabriel Rossetti, English poet and painter (b. 1828)\n*1889 – Michel Eugène Chevreul, French chemist and academic (b. 1786)\n*1909 – Helena Modjeska, Polish-American actress (b. 1840)\n*1915 – Raymond Whittindale, English rugby player (b. 1883)\n*1917 – James Hope Moulton, English philologist and scholar (b. 1863)\n*1922 – Hans Fruhstorfer, German entomologist and explorer (b. 1866)\n*1926 – Zip the Pinhead, American freak show performer (b. 1857)\n*1936 – Ferdinand Tönnies, German sociologist and philosopher (b. 1855)\n*1940 – Mrs. Patrick Campbell, English actress (b. 1865)\n*1944 – Yevgeniya Rudneva, Ukrainian lieutenant and pilot (b. 1920)\n*1945 – Dietrich Bonhoeffer, German pastor and theologian (b. 1906)\n*  1945   – Wilhelm Canaris, German admiral (b. 1887)\n*  1945   – Johann Georg Elser, German carpenter (b. 1903)\n*  1945   – Hans Oster, German general (b. 1887)\n*  1945   – Karl Sack, German lawyer and jurist (b. 1896)\n*  1945   – Hans von Dohnányi, Austrian-German lawyer and jurist (b. 1902)\n*1948 – George Carpenter, Australian 5th General of The Salvation Army (b. 1872)\n*  1948   – Jorge Eliécer Gaitán, Colombian lawyer and politician, 16th Colombian Minister of National Education (b. 1903)\n*1951 – Vilhelm Bjerknes, Norwegian physicist and meteorologist (b. 1862)\n*1953 – Eddie Cochems, American football player and coach (b. 1877)\n*  1953   – C. E. M. Joad, English philosopher and television host (b. 1891)\n*  1953   – Hans Reichenbach, German philosopher from the Vienna Circle (b. 1891)\n*1959 – Frank Lloyd Wright, American architect, designed the Price Tower and Fallingwater (b. 1867)\n*1961 – Zog I of Albania (b. 1895)\n*1963 – Eddie Edwards, American trombonist (b. 1891)\n*  1963   – Xul Solar, Argentinian painter and sculptor (b. 1887)\n*1970 – Gustaf Tenggren, Swedish-American illustrator and animator (b. 1896)\n*1976 – Dagmar Nordstrom, American singer-songwriter and pianist (b. 1903)\n*  1976   – Phil Ochs, American singer-songwriter and guitarist (b. 1940)\n*  1976   – Renato Petronio, Italian rower (b. 1891)\n*1978 – Clough Williams-Ellis, English-Welsh architect, designed Portmeirion (b. 1883)\n*1980 – Muhammad Baqir al-Sadr, Iraqi cleric and philosopher (b. 1935)\n*1982 – Wilfrid Pelletier, Canadian pianist, composer, and conductor (b. 1896)\n*1988 – Brook Benton, American singer-songwriter and actor (b. 1931)\n*  1988   – Hans Berndt, German footballer (b. 1913)\n*  1988   – Dave Prater, American singer (b. 1937)\n*1991 – Forrest Towns, American hurdler and coach (b. 1914)\n*1993 – Joseph B. Soloveitchik, American rabbi and philosopher (b. 1903)\n*1996 – Richard Condon, American author and publicist (b. 1915)\n*1997 – Mae Boren Axton, American singer-songwriter (b. 1914)\n*  1997   – Helene Hanff, American author and screenwriter (b. 1916)\n*1998 – Tom Cora, American cellist and composer (b. 1953)\n*1999 – Ibrahim Baré Maïnassara, Nigerien general and politician, President of Niger (b. 1949)\n*2001 – Willie Stargell, American baseball player and coach (b. 1940)\n*2002 – Pat Flaherty, American race car driver (b. 1926)\n*  2002   – Leopold Vietoris, Austrian soldier, mathematician, and academic (b. 1891)\n*2003 – Jerry Bittle, American cartoonist (b. 1949)\n*2006 – Billy Hitchcock, American baseball player, coach, manager (b. 1916)\n*  2006   – Vilgot Sjöman, Swedish director and screenwriter (b. 1924)\n*2007 – Egon Bondy, Czech philosopher and poet (b. 1930)\n*  2007   – Dorrit Hoffleit, American astronomer and academic (b. 1907)\n*2009 – Nick Adenhart, American baseball player (b. 1986)\n*2010 – Zoltán Varga, Hungarian footballer and manager (b. 1945)\n*2011 – Zakariya Rashid Hassan al-Ashiri, Bahraini journalist (b. 1971)\n*  2011   – Sidney Lumet, American director, producer, and screenwriter (b. 1924)\n*2012 – Malcolm Thomas, Welsh rugby player and cricketer (b. 1929)\n*2013 – David Hayes, American sculptor and painter (b. 1931)\n*  2013   – Greg McCrary, American football player (b. 1952)\n*  2013   – Mordechai Mishani, Israeli lawyer and politician (b. 1945)\n*  2013   – McCandlish Phillips, American journalist and author (b. 1927)\n*  2013   – Paolo Soleri, Italian-American architect, designed the Cosanti (b. 1919)\n*2014 – Gil Askey, American trumpet player, composer, and producer (b. 1925)\n*  2014   – Chris Banks, American football player (b. 1973)\n*  2014   – Rory Ellinger, American lawyer and politician (b. 1941)\n*  2014   – Norman Girvan, Jamaican economist, academic, and politician (b. 1941)\n*  2014   – Aelay Narendra, Indian politician (b. 1946)\n*  2014   – A. N. R. Robinson, Trinbagonian politician, 3rd President of Trinidad and Tobago (b. 1926)\n*  2014   – Svetlana Velmar-Janković, Serbian author (b. 1933)\n*2015 – Paul Almond, Canadian-American director, producer, and screenwriter (b. 1931)\n*  2015   – Margaret Rule, British marine archaeologist (b. 1928)\n*  2015   – Nina Companeez, French director and screenwriter (b. 1937)\n*  2015   – Alexander Dalgarno, English physicist and academic (b. 1928)\n*  2015   – Ivan Doig, American journalist and author (b. 1939)\n*  2015   – Tsien Tsuen-hsuin, Chinese-American academic (b. 1909)\n*2016 – Duane Clarridge, American spy (b. 1932)\n*  2016   – Will Smith, American football player (b. 1981)\n*2017 – John Clarke, comedian, writer, and satirist (b. 1948)\n\nHolidays and observances\n\n*Christian feast day:\n**Dietrich Bonhoeffer (Anglicanism, Lutheranism)\n**Gaucherius\n**Materiana\n**Waltrude\n**April 9 (Eastern Orthodox liturgics)\n*Anniversary of the German Invasion of Denmark (Denmark)\n*Baghdad Liberation Day (Iraqi Kurdistan)\n*Bataan Day or Araw ng Kagitingan (Philippines)\n*Constitution Day (Kosovo)\n*Day of National Unity (Georgia)\n*Day of the Finnish Language (Finland)\n*Feast of the Second Day of the Writing of the Book of the Law (Thelema)\n*Martyr's Day (Tunisia)\n*National Former Prisoner of War Recognition Day (United States) \n*Remembrance for Haakon Sigurdsson (The Troth)\n*Vimy Ridge Day (Canada). April 9. http://en.wikipedia.org/?curid=1787."
  }
}
