{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13026",
  "eid" : "06231960-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778519542,
  "textBody" : "The gray whale (Eschrichtius robustus), also known as the grey whale,Britannica Micro.: v. IV, p. 693.  gray back whale, Pacific gray whale, or California gray whale is a baleen whale that migrates between feeding and breeding grounds yearly. It reaches a length of , a weight of 36 t, and lives between 55 and 70 years.[http://dsp-psd.pwgsc.gc.ca/collection_2007/ec/En3-4-36-2007E.pdf Recovery Strategy for the Grey Whale (Eschrichtius robustus), Atlantic Population, in Canada]. Dsp-psd.pwgsc.gc.ca (2012-07-31). Retrieved on 2012-12-20.  The common name of the whale comes from the gray patches and white mottling on its dark skin.[https://web.archive.org/web/20101103142438/http://acsonline.org/factpack/graywhl.htm Gray Whale Eschrichtius robustus]. American Cetacean Society  Gray whales were once called devil fish because of their fighting behavior when hunted.[http://www.worldwildlife.org/species/finder/graywhale/graywhale.html Gray Whale]. Worldwildlife.org. Retrieved on 2012-12-20.  The gray whale is the sole living species in the genus Eschrichtius, which in turn is the sole living genus in the family Eschrichtiidae. This mammal descended from filter-feeding whales that appeared at the beginning of the Oligocene, over 30 million years ago.\n\nThe gray whale is distributed in an eastern North Pacific (North American) population and a critically endangered western North Pacific (Asian) population. North Atlantic populations were extirpated (perhaps by whaling) on the European coast before AD 500 and on the American coast around the late 17th to early 18th centuries. However, on May 8, 2010, a sighting of a gray whale was confirmed off the coast of Israel in the Mediterranean Sea, leading some scientists to think they might be repopulating old breeding grounds that have not been used for centuries.  In May and June 2013 a gray whale was sighted off the coast of Namibia – the first confirmed in the Southern Hemisphere. The round-trip journey of one gray whale has set a new record for the longest mammal migration, covering a distance of more than 22,000 kilometres across the Pacific Ocean. Her migration has shown new insight into how endangered species are making drastic changes in their life style.\n\nTaxonomy\n\n \nThe gray whale is traditionally placed as the only living species in its genus and family.[http://paleodb.org/cgi-bin/bridge.pl?action\ncheckTaxonInfo&taxon_no42976&is_real_user\n1 The Paleobiology Database Eschrichtiidae entry] accessed on 26 December 2010 Some recent DNA analyses have suggested that certain rorquals of the family Balaenopteridae, such as the humpback whale, Megaptera novaeangliae, and fin whale, Balaenoptera physalus, are more closely related to the gray whale than they are to some other rorquals, such as the minke whales.  But other recent studies place gray whales as being outside the rorqual clade, but as the closest relatives to the rorquals.\n\nJohn Edward Gray placed it in its own genus in 1865, naming it in honour of physician and zoologist Daniel Frederik Eschricht. The common name of the whale comes from its coloration. The subfossil remains of now extinct gray whales from the Atlantic coasts of England and Sweden were used by Gray to make the first scientific description of a species then surviving only in Pacific waters. The living Pacific species was described by Cope as Rhachianectes glaucus in 1869. Skeletal comparisons showed the Pacific species to be identical to the Atlantic remains in the 1930s, and Gray's naming has been generally accepted since. Although identity between the Atlantic and Pacific populations cannot be proven by anatomical data, its skeleton is distinctive and easy to distinguish from that of all other living whales.\n\nMany other names have been ascribed to the gray whale, including desert whale, devilfish, gray back, mussel digger and rip sack. The name Eschrichtius gibbosus is sometimes seen; this is dependent on the acceptance of a 1777 description by Erxleben.\n\nDescription\n\nThe gray whale has a dark slate-gray color and is covered by characteristic gray-white patterns, scars left by parasites which drop off in its cold feeding grounds. Individual whales are typically identified using photographs of their dorsal surface and matching the scars and patches associated with parasites that have fallen off the whale or are still attached. They have two blowholes on top of their head, which can create a distinctive heart-shaped blow at the surface in calm wind conditions.\n\nGray whales measure from  in length for newborns to 13 - for adults (females tend to be slightly larger than adult males). Newborns are a darker gray to black in color. A mature gray whale can reach 40 t, with a typical range of 15 -.Burnie D. and Wilson D.E. (eds.) (2005) Animal: The Definitive Visual Guide to the World's Wildlife. DK Adult, \n\nNotable features that distinguish the gray whale from other mysticetes include its baleen that is variously described as cream, off-white, or blond in color and is unusually short. Small depressions on the upper jaw each contain a lone stiff hair, but are only visible on close inspection. Its head's ventral surface lacks the numerous prominent furrows of the related rorquals, instead bearing two to five shallow furrows on the throat's underside. The gray whale also lacks a dorsal fin, instead bearing 6 to 12 dorsal crenulations (\"knuckles\"), which are raised bumps on the midline of its rear quarter, leading to the flukes. This is known as the dorsal ridge. The tail itself is 3 - across and deeply notched at the center while its edges taper to a point.\n\nPacific groups\n\nThe two populations of Pacific gray whales (east and west) are morphologically and phylogenically different. Other than DNA structures, differences in proportions of several body parts and body colors including skeletal features, and length ratios of flippers and baleen plates have been confirmed between Eastern and Western populations, and some claims that the original eastern and western groups could have been much more distinct than previously thought, enough to be counted as subspecies. Since the original Asian and Atlantic populations have become extinct, it is difficult to determine the unique features among whales in these stocks.  However, there have been observations of some whales showing distinctive, blackish body colors in recent years.Shpak O. (2011). [http://kit.sevin-expedition.ru/news/news_81.html Observation of the gray whale in the Laptev Sea]. Standing expedition of IEE Russian Academy of Sciences. This corresponds with the DNA analysis of last recorded stranding in China. Differences were also observed between Korean and Chinese specimens.\n\nPopulations\n\nNorth Pacific\n\nTwo Pacific Ocean populations are known to exist: one of not more than 130 individuals (according to the most recent population assessment in 2008) whose migratory route is presumed to be between the Sea of Okhotsk and southern Korea, and a larger one with a population between 20,000 and 22,000 individuals in the eastern Pacific traveling between the waters off northernmost Alaska and Baja California Sur. The western population is listed as critically endangered by the IUCN. No new reproductive females were recorded in 2010, resulting in a minimum of 26 reproductive females being observed since 1995. Even a very small number of additional annual female deaths will cause the subpopulation to decline.\n\nNorth Atlantic\n\nThe gray whale became extinct in the North Atlantic in the 18th century. Other than speculations, large portions of historical characteristic of migration and distribution are unclear such as locations of calving grounds, existences of resident groups, and occurrences within Black and Azov Seas.\n\nThey had been seasonal migrants to coastal waters of both sides of Atlantic, including the Baltic Sea,Jones L.M..Swartz L.S.. Leatherwood S.. [https://books.google.co.nz/books?idGfGITi5NmJoC&pg\nPA41&lpgPA41&dq\nbothnia+whale&sourcebl&ots\n7Y4sPhp6Ps&sigmaos19QFQH8mKODdOa59cQpV5hE&hl\nen&saX&ved\n0ahUKEwjT2veQ5YvWAhXEoZQKHfxfDiA4ChDoAQglMAA#vonepage&q\nbothnia%20whale&f=false The Gray Whale: Eschrichtius Robustus]. \"Eastern Atlantic Specimens\". pp 41-44. Academic Press. Retrieved on September 05, 2017Global Biodiversity Information Facility. [https://www.gbif.org/occurrence/1322462463 Occurrence Detail 1322462463]. Retrieved on September 21, 2017 Wadden Sea, the Gulf of St. Lawrence, the Bay of Fundy, Hudson Bay (possibly),Fisheries and Oceans Canada.\n 2016. [http://www.dfo-mpo.gc.ca/species-especes/profiles-profils/grey-whale-a-baleine-grise-a-eng.html Grey Whale (Atlantic population) Eschrichtius robustus]. Retrieved on August 15, 2017 and Pamlico Sound.  Radiocarbon dating of subfossil or fossil European (Belgium, the Netherlands, Sweden, the United Kingdom) coastal remains confirms this, with whaling the possible cause. Remains dating from the Roman epoch were found in the Mediterranean during excavation of the antique harbor of Lattara near Montpellier in 1997, raising the question of whether Atlantic gray whales migrated up and down the coast of Europe from Wadden Sea to calve in the Mediterranean.The MORSE Project - [http://morse.cefe.cnrs.fr/?p84. Ancient whale exploitation in the Mediterranean: species matters] Similarly, radiocarbon dating of American east coastal subfossil remains confirm that gray whales existed there at least through the 17th century. This population ranged at least from Southampton, New York, to Jupiter Island, Florida, the latest from 1675. In his 1835 history of Nantucket Island, Obed Macy wrote that in the early pre-1672 colony a whale of the kind called \"scragg\" entered the harbor and was pursued and killed by the settlers. A. B. Van Deinse points out that the \"scrag whale\", described by P. Dudley in 1725 as one of the species hunted by the early New England whalers, was almost certainly the gray whale.\n\nPrewhaling abundance\n\nResearchers used a genetic approach to estimate pre-whaling abundance based on samples from 42 California gray whales, and reported DNA variability at 10 genetic loci consistent with a population size of 76,000–118,000 individuals, three to five times larger than the average census size as measured through 2007. NOAA has collected surveys gray whale population since at least the 1960s. They state that \"the most recent population estimate [from 2007] was approximately 19,000 whales, with a high probability (88%) that the population is at 'optimum sustainable population' size, as defined by the Marine Mammal Protection Act.  They speculate that the ocean ecosystem has likely changed since the prewhaling era, making a return to prewhaling numbers infeasible.  Factors limiting or threatening current population levels include ship strikes, entanglement in fishing gear, and changes in sea-ice coverage associated with climate change.\n\nIntegration and recolonization\n\nSeveral whales seen off Sakhalin and on Kamchatka Peninsula are confirmed to migrate towards eastern side of Pacific and join the larger eastern population. In January 2011, a gray whale that had been tagged in the western population was tracked as far east as the eastern population range off the coast of British Columbia. Recent findings from either stranded or entangled specimens indicate that the original western population have become functionally extinct and possibly all the whales appeared on Japanese and Chinese coasts in modern times are vagrants or re-colonizers from the eastern population.\n\nIn mid-1980, there were three gray whale sightings in the eastern Beaufort Sea, placing them 585 km further east than their known range at the time. Recent increases in sightings are confirmed in Arctic areas of the historic range for Atlantic stocks, most notably on several locations in the Laptev Sea including the New Siberian Islands in the East Siberian Sea, and around the marine mammal sanctuaryNefedova T., Gavrilo M., Gorshkov S. (2013). [http://www.rgo.ru/ru/article/letom-v-arktike-stalo-menshe-lda Летом в Арктике стало меньше льда] . Russian Geographical Society. retrieved on 24-05-2014 of the Franz Josef Land,Elwen H.S., Gridley T. (2013). [http://www.namibiandolphinproject.com/wp-content/uploads/2013/06/Elwen-Gridley_Gray-whale-in-Namibia-20130610.pdf Gray whale (Eschrichtius robustus) sighting in Namibia (SE Atlantic) – first record for Southern Hemisphere]. Mammal Research Institute, the University of Pretoria and the Namibian Dolphin Project. retrieved on 18-05-2014 indicating possible earlier pioneers of re-colonizations. These whales were darker in body color than those whales seen in Sea of Okhotsk. In May 2010, a gray whale was sighted off the Mediterranean shore of Israel. It has been speculated that this whale crossed from the Pacific to the Atlantic via the Northwest Passage, since an alternative route around Cape Horn would not be contiguous to the whale's established territory. There has been gradual melting and recession of Arctic sea ice with extreme loss in 2007 rendering the Northwest Passage \"fully navigable\". The same whale was sighted again on May 30, 2010, off the coast of Barcelona, Spain.\n\nIn May 2013, a gray whale was sighted off Walvis Bay, Namibia. Scientists from the Namibian Dolphin Project confirmed the whale's identity and thus provides the only sighting of this species in the Southern Hemisphere. Photographic identification suggests that this is a different individual than the one spotted in the Mediterranean in 2010. As of July 2013, the Namibian whale was still being seen regularly.[http://namibiandolphinproject.blogspot.ch/2013/05/a-rare-and-mysterious-visitor-in-walvis.html Namibian Dolphin Project: A rare and mysterious visitor in Walvis Bay]. Namibiandolphinproject.blogspot.ch (2013-05-14). Retrieved on 2013-07-28.\n\nGenetic analysis of fossil and prefossil gray whale remains in the Atlantic Ocean suggests several waves of dispersal from the Pacific to the Atlantic related to successive periods of climactic warming - during the Pleistocene before the last glacial period and the early Holocene immediately following the opening of the Bering Strait. This information and the recent sightings of Pacific gray whales in the Atlantic, suggest that another range expansion to the Atlantic may be starting.\n\nLife history\n\nReproduction\n\nBreeding behavior is complex and often involves three or more animals. Both male and female whales reach puberty at approximately eight years of age. Females show highly synchronized reproduction, undergoing oestrus in late November to early December. During the breeding season, it is common for females to have several mates. This single ovulation event is believed to coincide with the species’ annual migration patterns, when births can occur in warmer waters. Most females show biennial reproduction, although annual births have been reported. Males also show seasonal changes, experiencing an increase in testes mass that correlates with the time females undergo oestrus. Currently there are no accounts of twin births, although an instance of twins in utero has been reported.\n\nThe gestation period for gray whales is approximately 13  months. In the latter half of the pregnancy, the fetus experiences a rapid growth in length and mass. Similar to the narrow breeding season, most calves are born within a six-week time period in mid January. The calf is born tail first, and measures about 4 m in length. Females lactate for approximately seven months following birth, at which point calves are weaned and maternal care begins to decrease. The shallow lagoon waters in which gray whales reproduce are believed to protect the newborn from sharks and orcas.\n\nFeeding\n\nThe whale feeds mainly on benthic crustaceans, which it eats by turning on its side (usually the right, resulting in loss of eyesight in the right eye for many older animals) and scooping up sediments from the sea floor. This unique feeding selection makes gray whales one of the most strongly reliant on coastal waters among baleen whales. It is classified as a baleen whale and has baleen, or whalebone, which acts like a sieve, to capture small sea animals, including amphipods taken in along with sand, water and other material. Mostly, the animal feeds in the northern waters during the summer; and opportunistically feeds during its migration, depending primarily on its extensive fat reserves. Calf gray whales drink 190 - of their mothers' 53% fat milk per day.\n\nThe main feeding habitat of the western Pacific subpopulation is the shallow (5 - depth) shelf off northeastern Sakhalin Island, particularly off the southern portion of Piltun Lagoon, where the main prey species appear to be amphipods and isopods. In some years, the whales have also used an offshore feeding ground in 30 - depth southeast of Chayvo Bay, where benthic amphipods and cumaceans are the main prey species.Fadeev V.I. (2003). [http://www.sakhalinenergy.com/media/7d6c01c0-eb66-4ddf-a0df-31056cb622fe.pdf Benthos and prey studies in feeding grounds of the Okhotsk-Korean population of gray whales]. Final report on materials from field studies on the research vessel Nevelskoy in 2002. Marine Biology Institute, Vladivostok. Some gray whales have also been seen off western Kamchatka, but to date all whales photographed there are also known from the Piltun area.\n\nMigration\n\nPredicted distribution models indicate that overall range in the last glacial period was broader or more southerly distributed, and inhabitations in waters where species presences lack in present situation, such as in southern hemisphere and south Asian waters and northern Indian Ocean were possible due to feasibility of the environment on those days. Range expansions due to recoveries and re-colonization in the future is likely to be happen and the predicted range covers wider than that of today.\n\nEastern Pacific population\n\nEach October, as the northern ice pushes southward, small groups of eastern gray whales in the eastern Pacific start a two- to three-month, 8000 - trip south. Beginning in the Bering and Chukchi seas and ending in the warm-water lagoons of Mexico's Baja California Peninsula and the southern Gulf of California, they travel along the west coast of Canada, the United States and Mexico.\n\nTraveling night and day, the gray whale averages approximately 120 km per day at an average speed of 8 km/h. This round trip of 16000 - is believed to be the longest annual migration of any mammal. By mid-December to early January, the majority are usually found between Monterey and San Diego such as at Morro bay, often visible from shore. The whale watching industry provides ecotourists and marine mammal enthusiasts the opportunity to see groups of gray whales as they migrate.\n\nBy late December to early January, eastern grays begin to arrive in the calving lagoons and bays on the west coast of Baja California Sur. The three most popular are San Ignacio, Magdalena Bay to the south, and, to the north, Laguna Ojo de Liebre (formerly known in English as Scammon's Lagoon after whaleman Charles Melville Scammon, who discovered the lagoons in the 1850s and hunted the grays).\n\nGray whales once ranged into Sea of Cortez and Pacific coasts of continental Mexico south to the Islas Marías, Bahía de Banderas, and Nayarit/Jalisco, and there were two modern calving grounds in Sonora (Tojahui or Yavaros) and Sinaloa (Bahia Santa Maria) until being abandoned in 1980s.\n\nThese first whales to arrive are usually pregnant mothers looking for the protection of the lagoons to bear their calves, along with single females seeking mates. By mid-February to mid-March, the bulk of the population has arrived in the lagoons, filling them with nursing, calving and mating gray whales.\n\nThroughout February and March, the first to leave the lagoons are males and females without new calves. Pregnant females and nursing mothers with their newborns are the last to depart, leaving only when their calves are ready for the journey, which is usually from late March to mid-April. Often, a few mothers linger with their young calves well into May.\n\nBy late March or early April, the returning animals can be seen from Everett, Washington, to Puget Sound to Canada.\n\nResident group\n\nA population of about 200 gray whales stay along the eastern Pacific coast from Canada to California throughout the summer, not making the farther trip to Alaskan waters. This summer resident group is known as the Pacific Coast feeding group.\n\nAny historical or current presence of similar groups of residents among the western population is currently unknown, however, whalers' logbooks and scientific observations indicate that possible year-round occurrences in Chinese waters and Yellow and Bohai basins were likely to be summering grounds. Some of the better documented historical catches show that it was common for whales to stay for months in enclosed waters elsewhere, with known records in the Seto Inland Sea and the Gulf of Tosa. Former feeding areas were once spread over large portions on mid-Honshu to northern Hokkaido, and at least whales were recorded for majority of annual seasons including wintering periods at least along east coasts of Korean Peninsula and Yamaguchi Prefecture. Some recent observations indicate that historic presences of resident whales are possible: a group of two or three were observed feeding in Izu Ōshima in 1994 for almost a month, two single individuals stayed in Ise Bay for almost two months in the 1980s and in 2012, the first confirmed living individuals in Japanese EEZ in the Sea of Japan and the first of living cow-calf pairs since the end of whaling stayed for about three weeks on the coastline of Teradomari in 2014. One of the pair returned to the same coasts at the same time of the year in 2015 again. Reviewing on other cases on different locations among Japanese coasts and islands observed during 2015 indicate that spatial or seasonal residencies regardless of being temporal or permanental staying once occurred throughout many parts of Japan or on other coastal Asia.\n\nWestern population\n\nThe current western gray whale population summers in the Sea of Okhotsk, mainly off Piltun Bay region at the northeastern coast of Sakhalin Island (Russian Federation). There are also occasional sightings off the eastern coast of Kamchatka (Russian Federation) and in other coastal waters of the northern Okhotsk Sea. Its migration routes and wintering grounds are poorly known, the only recent information being from occasional records on both the eastern and western coasts of Japan and along the Chinese coast.Zhu, Q. (1998). \"Strandings and sightings of the western Pacific stock of the gray whale Eschrichtius robustus in Chinese coastal waters. Paper SC/50lAS5 presented to the IWC Scientific Committee, April 1998, Oman Gray whale had not been observed on Commander Islands until 2016.[http://news.zapoved.ru/2016/05/31/krasnoknizhnyj-seryj-kit-priplyl-pod-okna-ofisa-zapovednika-komandorskij/ Краснокнижный серый кит приплыл под окна офиса заповедника «Командорский»]. Retrieved on March 09, 2017\n\nThe Sea of Japan was once thought not to have been a migration route, until several entanglements were recorded. Any records of the species had not been confirmed since after 1921 on Kyushu. However, there were numerous records of whales along the Genkai Sea off Yamaguchi Prefecture,Uni Y. (2004) [http://www.h6.dion.ne.jp/~unisan/data/graywhale/cetaken15.html 西部系群コククジラ Eschrictius robustus の記録集成と通過海峡]. dion.ne.jp in Ine Bay in the Gulf of Wakasa, and in Tsushima. Gray whales, along with other species such as right whales and Baird's beaked whales, were common features off the north eastern coast of Hokkaido near Teshio, Ishikari Bay near Otaru, the Shakotan Peninsula, and islands in the La Pérouse Strait such as Rebun Island and Rishiri Island. These areas may also have included feeding grounds. There are shallow, muddy areas favorable for feeding whales off Shiretoko, such as at Shibetsu, the Notsuke Peninsula, Cape Ochiishi on Nemuro Peninsula, Mutsu Bay, along the Tottori Sand Dunes, in the Suou-nada Sea, and Omura Bay.\n\nThe historical calving grounds were unknown but might have been along southern Chinese coasts from Zhejiang and Fujian Province to Guangdong, especially south of Hailing Island and to near Hong Kong. Possibilities include Daya Bay, Wailou Harbour on Leizhou Peninsula, and possibly as far south as Hainan Province and Guangxi, particularly around Hainan Island. These areas are at the southwestern end of the known range. It is unknown whether the whales' normal range once reached further south, to the Gulf of Tonkin. In addition, the existence of historical calving ground on Taiwan and Penghu Islands (with some fossil records\n and capturesBrownell, R.L., Donovan, G.P., Kato, H., Larsen, F., Mattila, D., Reeves, R.R., Rock, Y., Vladimirov, V., Weller, D. & Zhu, Q. (2010) [https://portals.iucn.org/library/node/12737 Conservation Plan for Western North Pacific Gray Whales  (Eschrichtius robustus)]. IUCN), and any presence in other areas outside of the known ranges off Babuyan Islands in Philippines and coastal Vietnamese waters in Gulf of Tonkin are unknown. There is only one confirmed record of accidentally killing of the species in Vietnam, at Ngoc Vung Island off Ha Long Bay in 1994 and the skeleton is on exhibition at the Quang Ninh Provincial Historical Museum.2014. [http://www.cesti.gov.vn/kh-cn-trong-nuoc/chuan-hoa-ten-ca-voi-xam-trong-bo-suu-tap-mau-vat-bao-tang-lich-su-quang-ninh.html Chuẩn hóa lại tên cá voi xám trong bộ sưu tập mẫu vật của bảo tàng lịch sử tỉnh Quảng Ninh]. Retrieved on March 09, 20172012. [http://grobest.com.vn/tin-tuc/44-tin-tuc/310-bi-an-nhung-con-ca-voi-khong-lo-dat-vao-bien-viet-nam.html Bí ẩn những con cá khổng lồ dạt vào biển Việt Nam]. Retrieved on March 09, 2017 Gray whales are known to occur in Taiwan Strait even in recent years.What's on Xiamen.[http://www.whatsonxiamen.com/tag-Pingtan+gray+whale.html Tags > Pingtan gray whale]. Retrieved on November 24. 2014\n\nIt is also unknown whether any winter breeding grounds ever existed beyond Chinese coasts. For example, it is not known if the whales visited the southern coasts of the Korean Peninsula, adjacent to the Island of Jeju), Haiyang Island, the Gulf of Shanghai, or the Zhoushan Archipelago. There is no evidence of historical presence in Japan south of Ōsumi Peninsula;Uni Y., 2010, 『コククジラは大隅海峡を通るのか?』, Japan Cetology Research Group News Letter 25, retrieved on 11-05-2014 only one skeleton has been discovered in Miyazaki Prefecture.  Hideo Omura once considered the Seto Inland Sea to be a historical breeding ground, but only a handful of capture records support this idea, although migrations into the sea have been confirmed.\n\nRecent migration in Asian waters\n\nEven though South Korea put the most effort into conservation of the species among the Asian nations, there are no confirmed sightings along the Korean Peninsula or even in the Sea of Japan in recent years.\n\nThe last record in Korean waters was the sighting of a pair off Bangeojin, Ulsan in 1977. Prior to this, the last was of catches of 5 animals[http://www.greenpeace.org/eastasia/Global/eastasia/publications/reports/oceans/Disappearing%20Whales%20-%20South%20Korea.PDF Disappearing Whales: Korea's Inconvenient Truth]. Greenpeace (2012) off Ulsan in 1966.\n\nThere had been 24 records along Chinese coasts including sighting, stranding, intended hunts, and bycatches since 1933. The last report of occurrence of the species in Chinese waters was of a stranded semi adult female in the Bohai Sea in 1996, and the only record in Chinese waters in the 21st century was of a fully-grown female being killed by entanglement in Pingtan, China in November, 2007. DNA studies indicated that this individual might have originated from the eastern population rather than the western.\n\nMost notable observations of living whales after the 1980s were of 17 or 18 whales along Primorsky Krai in late October, 1989 (prior to this, a pair was reported swimming in the area in 1987), followed by the record of 14 whales in La Pérouse Strait on 13th, June in 1982 (in this strait, there was another sighting of a pair in October, 1987). In 2011, presences of gray whales were acoustically detected among pelagic waters in East China Sea between Chinese and Japanese waters.Gagnon, Chuck (November 2016) [https://www.iucn.org/sites/dev/files/wgwap_17-inf.6_iwc_66-cc29_wgw_observations_east_china_sea.pdf Western gray whale activity in the East China Sea from acoustic data: Memorandum for Dr. Brandon Southall]. iucn.org\n\nSince the mid 1990s, almost all the confirmed records of living animals in Asian waters were from Japanese coasts. There have been eight to fifteen sightings and stray records including unconfirmed sightings and re-sightings of the same individual, and one later killed by net-entanglement. The most notable of these observations are listed below:\n\n* The feeding activities of a group of two or three whales that stayed around Izu Ōshima in 1994 for almost a month were recorded underwater by several researchers and whale photographers.\n* A pair of thin juveniles were sighted off Kuroshio, Kōchi, a renowned town for whale-watching tourism of resident and sub-resident populations of Bryde's Whales, in 1997.[https://web.archive.org/web/20160304060253/http://svrsh2.kahaku.go.jp/drift/FMPro?-db\nrec2000web.fp5&-layhp&-format\n%2Fdrift%2Fe%2Fdetail.htm&rec_id=19970722EX-032&-find Marine Mammals Stranding DataBase]. kahaku.go.jp This sighting was unusual because of the location on mid-latitude in summer time.\n* Another pair of sub-adults were confirmed swimming near the mouth of Otani River in Suruga Bay in May, 2003.\n* A sub-adult whale that stayed in the Ise and Mikawa Bay for nearly two months in 2012[http://www.beachland.jp/beach/study/pdf/18.pdf 2012 年に漂着した海棲哺乳類につい]. .beachland.jp was later confirmed to be the same individual as the small whale observed off Tahara near Cape Irago in 2010, making it the first confirmed constant migration out of Russian waters. The juvenile observed off Owase in Kumanonada Sea in 2009 might or might not be the same individual. The Ise and Mikawa Bay region is the only location along Japanese coasts that has several records since the 1980s (a mortal entanglement in 1968, above mentioned short-stay in 1982, self-freeing entanglement in 2005), and is also the location where the first commercial whaling started. Other areas with several sighting or stranding records in recent years are off the Kumanonada Sea in Wakayama, off  Oshika Peninsula in Tohoku, and on coastlines close to Tomakomai, Hokkaido.\n* Possibly the first confirmed record of living animals in Japanese waters in the Sea of Japan since the end of whaling occurred on 3 April 2014 at Nodumi Beach, Teradomari, Niigata. Two individuals, measuring ten and five metres respectively, stayed near the mouth of Shinano River for three weeks. It is unknown whether this was a cow-calf pair, which would have been a first record in Asia. All of the previous modern records in the Sea of Japan were of by-catches.\n* One of the above pair returned on the same beaches at the same time of a year in 2015.\n*A juvenile or possibly or not with another larger individual remained in Japanese waters between January or March and May 2015. It was first confirmed occurrences of the species on remote, oceanic islands in Japan. One or more visited waters firstly on Kōzu-shima and Nii-Jima for weeks then adjacent to Miho no Matsubara and behind the Tokai University campus for several weeks. Possibly the same individual was seen off Futo as well. This later was identified as the same individual previously recorded on Sakhalin in 2014, the first re-recording one individual at different Asian locations.\n* A young whale was observed by land-based fishermen at Cape Irago in March, 2015.\n* One of the above pair appeared in 2015 off southeastern Japan and then reappeared off Tateyama in January, 2016. The identity of this whale was confirmed by Nana Takanawa who photographed the same whale on Niijima in 2015.Braulik, Gill (2015-04-16) [https://web.archive.org/web/20160123234348/https://www.iucn-csg.org/index.php/2015/04/16/1940/ Young Gray Whale Sighted near Tokyo Islands]. IUCN SSC – Cetacean Specialist Group Likely the same individual was sighted off Futo and half an hour later off Akazawa beach in Itō, Shizuoka on the 14th. The whale then stayed next to a pier on Miyake-jima and later at Habushi beach on Niijima, the same beach the same individual stayed near on the previous year.\n* One whale of 9 m was beached nearby Wadaura on March 4, 2016.[https://web.archive.org/web/20160305073024/http://www3.nhk.or.jp/news/html/20160305/k10010432701000.html 絶滅心配 コククジラの死骸 千葉・南房総で見つかる]. nhk.or.jp (2015-05-03) Investigations on the corpse indicate that this was likely a different individual from the above animal.\n* A 7 m carcass of young female was firstly reported floating along Atami on 4 April then was washed ashore on Ito on the 6th.[http://izu-np.co.jp/ito/news/20160407iz0000000007000c.html 伊東市新井海岸の打ち上げ死骸　絶滅危惧種、コククジラと判明] \n* As of April 20, 2017, one or more whale(s) have been staying within Tokyo Bay since February although at one point another whale if or if not the same individual sighted off Hayama, Kanagawa.[http://www.news24.jp/articles/2017/04/18/07359324.html 東京湾でクジラの目撃相次ぐ]. Retrieved on April 21, 2017鎌倉ゴムボートコング山田肇. 2017.「https://www.youtube.com/watch?v=9v7b02cCsP0　ゴムボート東京湾ホエールウォッチング❗ 」. YouTube. Retrieved on April 21, 2017 It is unclear the exact number of whales included in these sightings; two whales reported by fishermen and Japanese coastal guard reported three whales on 20th or 21th.みんなのニュース. 2017. [http://www.fnn-news.com/news/headlines/articles/CONN00356017.html 撮影成功! 姿現した「東京湾クジラ」]. The Fuji News Network Retrieved on April 22, 2017\n\nWhaling\n\nNorth Pacific\n\nEastern population\n\nHumans and killer whales (orcas) are the adult gray whale's only predators. Aboriginal hunters, including those on Vancouver Island and the Makah in Washington, have hunted gray whales.\n\nCommercial whaling by Europeans of the species in the North Pacific began in the winter of 1845–46, when two United States ships, the Hibernia and the United States, under Captains Smith and Stevens, caught 32 in Magdalena Bay. More ships followed in the two following winters, after which gray whaling in the bay was nearly abandoned because \"of the inferior quality and low price of the dark-colored gray whale oil, the low quality and quantity of whalebone from the gray, and the dangers of lagoon whaling.\"\n\nGray whaling in Magdalena Bay was revived in the winter of 1855–56 by several vessels, mainly from San Francisco, including the ship Leonore, under Captain Charles Melville Scammon. This was the first of 11 winters from 1855 through 1865 known as the \"bonanza period\", during which gray whaling along the coast of Baja California reached its peak. Not only were the whales taken in Magdalena Bay, but also by ships anchored along the coast from San Diego south to Cabo San Lucas and from whaling stations from Crescent City in northern California south to San Ignacio Lagoon. During the same period, vessels targeting right and bowhead whales in the Gulf of Alaska, Sea of Okhotsk, and the Western Arctic would take the odd gray whale if neither of the more desirable two species were in sight.\n\nIn December 1857, Charles Scammon, in the brig Boston, along with his schooner-tender Marin, entered Laguna Ojo de Liebre (Jack-Rabbit Spring Lagoon) or later known as Scammon's Lagoon (by 1860) and found one of the gray's last refuges. He caught 20 whales. He returned the following winter (1858–59) with the bark Ocean Bird and schooner tenders A.M. Simpson and Kate. In three months, he caught 47 cows, yielding 1700 oilbbl of oil. In the winter of 1859–60, Scammon, again in the bark Ocean Bird, along with several other vessels, performed a similar feat of daring by entering San Ignacio Lagoon to the south where he discovered the last breeding lagoon. Within only a couple of seasons, the lagoon was nearly devoid of whales.\n\nBetween 1846 and 1874, an estimated 8,000 gray whales were killed by American and European whalemen, with over half having been killed in the Magdalena Bay complex (Estero Santo Domingo, Magdalena Bay itself, and Almejas Bay) and by shore whalemen in California and Baja California. This, for the most part, does not take into account the large number of calves injured or left to starve after their mothers had been killed in the breeding lagoons. Since whalemen primarily targeted these new mothers, several thousand deaths should probably be added to the total. Shore whaling in California and Baja California continued after this period, until the early 20th century.\n\nA second, shorter, and less intensive hunt occurred for gray whales in the eastern North Pacific. Only a few were caught from two whaling stations on the coast of California from 1919 to 1926, and a single station in Washington (1911–21) accounted for the capture of another. For the entire west coast of North America for the years 1919 to 1929, some 234 gray whales were caught. Only a dozen or so were taken by British Columbian stations, nearly all of them in 1953 at Coal Harbour. A whaling station in Richmond, California, caught 311 gray whales for \"scientific purposes\" between 1964 and 1969. From 1961 to 1972, the Soviet Union caught 138 gray whales (they originally reported not having taken any). The only other significant catch was made in two seasons by the steam-schooner California off Malibu, California. In the winters of 1934–35 and 1935–36, the California anchored off Point Dume in Paradise Cove, processing gray whales. In 1936, gray whales became protected in the United States.Brownell Jr., R. L. and Swartz, S. L. 2006. The floating factory ship California operations in Californian waters, 1932–1937. International Whaling Commission, Scientific Committee.\n\nWestern population\n\nThe Japanese began to catch gray whales beginning in the 1570s. At Kawajiri, Nagato, 169 gray whales were caught between 1698 and 1889. At Tsuro, Shikoku, 201 were taken between 1849 and 1896.Kasuya, T. (2002). \"Japanese whaling\", in Encyclopedia of Marine Mammals. W. F. Perrin, B. Wursig, and J.G.M. Thewissen, eds. San Diego: Academic Press, pp. 655–662, . Several hundred more were probably caught by American and European whalemen in the Sea of Okhotsk from the 1840s to the early 20th century. Whalemen caught 44 with nets in Japan during the 1890s. The real damage was done between 1911 and 1933, when Japanese whalemen killed 1,449 after Japanese companies established several whaling stations on Korean Peninsula and on Chinese coast such as near the Daya bay and on Hainan Island. By 1934, the western gray whale was near extinction. From 1891 to 1966, an estimated 1,800–2,000 gray whales were caught, with peak catches of between 100 and 200 annually occurring in the 1910s.\n\nAs of 2001, the Californian gray whale population had grown to about 26,000. As of 2011, the population of western Pacific (seas near Korea, Japan, and Kamchatka) gray whales was an estimated 130.[https://www.nytimes.com/aponline/2011/01/18/us/AP-US-Rare-Whale-Bering-Sea.html?_r=1&hp] \n\nNorth Atlantic\n\nThe North Atlantic population may have been hunted to extinction in the 18th century. Circumstantial evidence indicates whaling could have contributed to this population's decline, as the increase in whaling activity in the 17th and 18th centuries coincided with the population's disappearance. A. B. Van Deinse points out the \"scrag whale\", described by P. Dudley in 1725, as one target of early New England whalers, was almost certainly the gray whale. In his 1835 history of Nantucket Island, Obed Macy wrote that in the early pre-1672 colony, a whale of the kind called \"scragg\" entered the harbor and was pursued and killed by the settlers. Gray whales (Icelandic sandlægja) were described in Iceland in the early 17th century.Jón Guðmundsson lærði (1966). Ein stutt udirrietting um Íslands adskiljanlegu náttúrur. ed. Halldór Hermannsson, Cornell University Library, Ithaca, New York. Formations of industrial whaling among the Mediterranean basin(s) have been considered to be feasible as well.\n\nConservation\n\nGray whales have been granted protection from commercial hunting by the International Whaling Commission (IWC) since 1949, and are no longer hunted on a large scale.\n\nLimited hunting of gray whales has continued since that time, however, primarily in the Chukotka region of northeastern Russia, where large numbers of gray whales spend the summer months. This hunt has been allowed under an \"aboriginal/subsistence whaling\" exception to the commercial-hunting ban. Anti-whaling groups have protested the hunt, saying the meat from the whales is not for traditional native consumption, but is used instead to feed animals in government-run fur farms; they cite annual catch numbers that rose dramatically during the 1940s, at the time when state-run fur farms were being established in the region. Although the Soviet government denied these charges as recently as 1987, in recent years the Russian government has acknowledged the practice. The Russian IWC delegation has said that the hunt is justified under the aboriginal/subsistence exemption, since the fur farms provide a necessary economic base for the region's native population.\n\nCurrently, the annual quota for the gray whale catch in the region is 140 per year. Pursuant to an agreement between the United States and Russia, the Makah tribe of Washington claimed four whales from the IWC quota established at the 1997 meeting. With the exception of a single gray whale killed in 1999, the Makah people have been prevented from hunting by a series of legal challenges, culminating in a United States federal appeals court decision in December 2002 that required the National Marine Fisheries Service to prepare an Environmental Impact Statement. On September 8, 2007, five members of the Makah tribe shot a gray whale using high-powered rifles in spite of the decision. The whale died within 12 hours, sinking while heading out to sea.\n\nAs of 2008, the IUCN regards the gray whale as being of \"Least Concern\" from a conservation perspective. However, the specific subpopulation in the northwest Pacific is regarded as being \"Critically Endangered\". The northwest Pacific population is also listed as endangered by the U.S. government’s National Marine Fisheries Service under the U.S. Endangered Species Act. The IWC Bowhead, Right and Gray Whale subcommittee in 2011 reiterated the conservation risk to western gray whales is large because of the small size of the population and the potential anthropogenic impacts.\n\nIn their breeding grounds in Baja California, Mexican law protects whales in their lagoons while still permitting whale watching. Gray whales are protected under Canada's Species at Risk Act which obligates Canadian governments to prepare management plans for the whales and consider the interests of the whales when permitting development.\n\nGray Whale migrations off of the Pacific Coast were observed, initially, by Marineland of the Pacific in Palos Verdes, California.  The Gray Whale Census, an official Gray Whale migration census that has been recording data on the migration of the Pacific Gray Whale has been keeping track of the population of the Pacific Gray Whale since 1985.  This census is the longest running census of the Pacific Gray Whale.  Census keepers volunteer from December 1 through May, from sun up to sun down, seven days a week, keeping track of the amount of Gray Whales migrating through the area off of Los Angeles.  Information from this census is listed through the American Cetacean Society of Los Angeles (ACSLA).\n\nSouth Korea and China list gray whales as protected species of high concern. In South Korea, the Gray Whale Migration Site was registered as the 126th national monument in 1962, although illegal hunts had been taken place thereafter, and there have been no recent sightings of the species in Korean waters.\n\nRewilding proposal\n\nIn 2005, two conservation biologists proposed a plan to airlift 50 gray whales from the Pacific Ocean to the Atlantic Ocean. They reasoned that, as Californian gray whales had replenished to a suitable population, surplus whales could be transported to repopulate the extinct British population.  this plan has not been undertaken.\n\nThreats\n\nAccording to the Government of Canada's Management Plan for gray whales, threats to the eastern North Pacific population of gray whales include:[http://www.dfo-mpo.gc.ca/species-especes/species-especes/greyWhale-NP-baleine-grise-PN-eng.htm The Grey Whale (Eastern North Pacific Population)] . Species at Risk. dfo-mpo.gc.ca increased human activities in their breeding lagoons in Mexico, climate change, acute noise, toxic spills, aboriginal whaling, entanglement with fishing gear, boat collisions, and possible impacts from fossil fuel exploration and extraction.\n\nWestern gray whales are facing, the large-scale offshore oil and gas development programs near their summer feeding ground, as well as fatal net entrapments off Japan during migration, which pose significant threats to the future survival of the population. The substantial nearshore industrialization and shipping congestion throughout the migratory corridors of the western gray whale population represent potential threats by increasing the likelihood of exposure to ship strikes, chemical pollution, and general disturbance.\n\nOffshore gas and oil development in the Okhotsk Sea within 20 km of the primary feeding ground off northeast Sakhalin Island is of particular concern. Activities related to oil and gas exploration, including geophysical seismic surveying, pipelaying and drilling operations, increased vessel traffic, and oil spills, all pose potential threats to western gray whales. Disturbance from underwater industrial noise may displace whales from critical feeding habitat. Physical habitat damage from drilling and dredging operations, combined with possible impacts of oil and chemical spills on benthic prey communities also warrants concern.\n\nAlong Japanese coasts, four females including a cow-calf pair were trapped and killed in nets in the 2000s. There had been a record of deceased individual thought to be harpooned by dolphin-hunters found on Hokkaido in the 1990s. Meats for sale were also discovered in Japanese markets as well.\n\nCaptivity\n\nBecause of their size and need to migrate, gray whales have rarely been held in captivity, and then only for brief periods of time. The first captive gray whale, who was captured in Scammon's Lagoon, Baja California in 1965, was named Gigi and died two months later from an infection. The second gray whale, who was captured in 1972 from the same lagoon, was named Gigi II and was released a year later after becoming too large for the facilities. The last gray whale, J.J., first beached herself in Marina del Rey, California where she was rushed to SeaWorld San Diego. After 14 months, she was released because she also grew too large to be cared for in the existing facilities. Reaching  and 31 ft, J.J. was the largest creature ever to be kept in captivity.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gray whale" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13026" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The gray whale (Eschrichtius robustus), also known as the grey whale,Britannica Micro.: v. IV, p. 693.  gray back whale, Pacific gray whale, or California gray whale is a baleen whale that migrates between feeding and breeding grounds yearly. It reaches a length of , a weight of 36 t, and lives between 55 and 70 years.[http://dsp-psd.pwgsc.gc.ca/collection_2007/ec/En3-4-36-2007E.pdf Recovery Strategy for the Grey Whale (Eschrichtius robustus), Atlantic Population, in Canada]. Dsp-psd.pwgsc.gc.ca (2012-07-31). Retrieved on 2012-12-20.  The common name of the whale comes from the gray patches and white mottling on its dark skin.[https://web.archive.org/web/20101103142438/http://acsonline.org/factpack/graywhl.htm Gray Whale Eschrichtius robustus]. American Cetacean Society  Gray whales were once called devil fish because of their fighting behavior when hunted.[http://www.worldwildlife.org/species/finder/graywhale/graywhale.html Gray Whale]. Worldwildlife.org. Retrieved on 2012-12-20.  The gray whale is the sole living species in the genus Eschrichtius, which in turn is the sole living genus in the family Eschrichtiidae. This mammal descended from filter-feeding whales that appeared at the beginning of the Oligocene, over 30 million years ago.\n\nThe gray whale is distributed in an eastern North Pacific (North American) population and a critically endangered western North Pacific (Asian) population. North Atlantic populations were extirpated (perhaps by whaling) on the European coast before AD 500 and on the American coast around the late 17th to early 18th centuries. However, on May 8, 2010, a sighting of a gray whale was confirmed off the coast of Israel in the Mediterranean Sea, leading some scientists to think they might be repopulating old breeding grounds that have not been used for centuries.  In May and June 2013 a gray whale was sighted off the coast of Namibia – the first confirmed in the Southern Hemisphere. The round-trip journey of one gray whale has set a new record for the longest mammal migration, covering a distance of more than 22,000 kilometres across the Pacific Ocean. Her migration has shown new insight into how endangered species are making drastic changes in their life style.\n\nTaxonomy\n\n \nThe gray whale is traditionally placed as the only living species in its genus and family.[http://paleodb.org/cgi-bin/bridge.pl?action\ncheckTaxonInfo&taxon_no42976&is_real_user\n1 The Paleobiology Database Eschrichtiidae entry] accessed on 26 December 2010 Some recent DNA analyses have suggested that certain rorquals of the family Balaenopteridae, such as the humpback whale, Megaptera novaeangliae, and fin whale, Balaenoptera physalus, are more closely related to the gray whale than they are to some other rorquals, such as the minke whales.  But other recent studies place gray whales as being outside the rorqual clade, but as the closest relatives to the rorquals.\n\nJohn Edward Gray placed it in its own genus in 1865, naming it in honour of physician and zoologist Daniel Frederik Eschricht. The common name of the whale comes from its coloration. The subfossil remains of now extinct gray whales from the Atlantic coasts of England and Sweden were used by Gray to make the first scientific description of a species then surviving only in Pacific waters. The living Pacific species was described by Cope as Rhachianectes glaucus in 1869. Skeletal comparisons showed the Pacific species to be identical to the Atlantic remains in the 1930s, and Gray's naming has been generally accepted since. Although identity between the Atlantic and Pacific populations cannot be proven by anatomical data, its skeleton is distinctive and easy to distinguish from that of all other living whales.\n\nMany other names have been ascribed to the gray whale, including desert whale, devilfish, gray back, mussel digger and rip sack. The name Eschrichtius gibbosus is sometimes seen; this is dependent on the acceptance of a 1777 description by Erxleben.\n\nDescription\n\nThe gray whale has a dark slate-gray color and is covered by characteristic gray-white patterns, scars left by parasites which drop off in its cold feeding grounds. Individual whales are typically identified using photographs of their dorsal surface and matching the scars and patches associated with parasites that have fallen off the whale or are still attached. They have two blowholes on top of their head, which can create a distinctive heart-shaped blow at the surface in calm wind conditions.\n\nGray whales measure from  in length for newborns to 13 - for adults (females tend to be slightly larger than adult males). Newborns are a darker gray to black in color. A mature gray whale can reach 40 t, with a typical range of 15 -.Burnie D. and Wilson D.E. (eds.) (2005) Animal: The Definitive Visual Guide to the World's Wildlife. DK Adult, \n\nNotable features that distinguish the gray whale from other mysticetes include its baleen that is variously described as cream, off-white, or blond in color and is unusually short. Small depressions on the upper jaw each contain a lone stiff hair, but are only visible on close inspection. Its head's ventral surface lacks the numerous prominent furrows of the related rorquals, instead bearing two to five shallow furrows on the throat's underside. The gray whale also lacks a dorsal fin, instead bearing 6 to 12 dorsal crenulations (\"knuckles\"), which are raised bumps on the midline of its rear quarter, leading to the flukes. This is known as the dorsal ridge. The tail itself is 3 - across and deeply notched at the center while its edges taper to a point.\n\nPacific groups\n\nThe two populations of Pacific gray whales (east and west) are morphologically and phylogenically different. Other than DNA structures, differences in proportions of several body parts and body colors including skeletal features, and length ratios of flippers and baleen plates have been confirmed between Eastern and Western populations, and some claims that the original eastern and western groups could have been much more distinct than previously thought, enough to be counted as subspecies. Since the original Asian and Atlantic populations have become extinct, it is difficult to determine the unique features among whales in these stocks.  However, there have been observations of some whales showing distinctive, blackish body colors in recent years.Shpak O. (2011). [http://kit.sevin-expedition.ru/news/news_81.html Observation of the gray whale in the Laptev Sea]. Standing expedition of IEE Russian Academy of Sciences. This corresponds with the DNA analysis of last recorded stranding in China. Differences were also observed between Korean and Chinese specimens.\n\nPopulations\n\nNorth Pacific\n\nTwo Pacific Ocean populations are known to exist: one of not more than 130 individuals (according to the most recent population assessment in 2008) whose migratory route is presumed to be between the Sea of Okhotsk and southern Korea, and a larger one with a population between 20,000 and 22,000 individuals in the eastern Pacific traveling between the waters off northernmost Alaska and Baja California Sur. The western population is listed as critically endangered by the IUCN. No new reproductive females were recorded in 2010, resulting in a minimum of 26 reproductive females being observed since 1995. Even a very small number of additional annual female deaths will cause the subpopulation to decline.\n\nNorth Atlantic\n\nThe gray whale became extinct in the North Atlantic in the 18th century. Other than speculations, large portions of historical characteristic of migration and distribution are unclear such as locations of calving grounds, existences of resident groups, and occurrences within Black and Azov Seas.\n\nThey had been seasonal migrants to coastal waters of both sides of Atlantic, including the Baltic Sea,Jones L.M..Swartz L.S.. Leatherwood S.. [https://books.google.co.nz/books?idGfGITi5NmJoC&pg\nPA41&lpgPA41&dq\nbothnia+whale&sourcebl&ots\n7Y4sPhp6Ps&sigmaos19QFQH8mKODdOa59cQpV5hE&hl\nen&saX&ved\n0ahUKEwjT2veQ5YvWAhXEoZQKHfxfDiA4ChDoAQglMAA#vonepage&q\nbothnia%20whale&f=false The Gray Whale: Eschrichtius Robustus]. \"Eastern Atlantic Specimens\". pp 41-44. Academic Press. Retrieved on September 05, 2017Global Biodiversity Information Facility. [https://www.gbif.org/occurrence/1322462463 Occurrence Detail 1322462463]. Retrieved on September 21, 2017 Wadden Sea, the Gulf of St. Lawrence, the Bay of Fundy, Hudson Bay (possibly),Fisheries and Oceans Canada.\n 2016. [http://www.dfo-mpo.gc.ca/species-especes/profiles-profils/grey-whale-a-baleine-grise-a-eng.html Grey Whale (Atlantic population) Eschrichtius robustus]. Retrieved on August 15, 2017 and Pamlico Sound.  Radiocarbon dating of subfossil or fossil European (Belgium, the Netherlands, Sweden, the United Kingdom) coastal remains confirms this, with whaling the possible cause. Remains dating from the Roman epoch were found in the Mediterranean during excavation of the antique harbor of Lattara near Montpellier in 1997, raising the question of whether Atlantic gray whales migrated up and down the coast of Europe from Wadden Sea to calve in the Mediterranean.The MORSE Project - [http://morse.cefe.cnrs.fr/?p84. Ancient whale exploitation in the Mediterranean: species matters] Similarly, radiocarbon dating of American east coastal subfossil remains confirm that gray whales existed there at least through the 17th century. This population ranged at least from Southampton, New York, to Jupiter Island, Florida, the latest from 1675. In his 1835 history of Nantucket Island, Obed Macy wrote that in the early pre-1672 colony a whale of the kind called \"scragg\" entered the harbor and was pursued and killed by the settlers. A. B. Van Deinse points out that the \"scrag whale\", described by P. Dudley in 1725 as one of the species hunted by the early New England whalers, was almost certainly the gray whale.\n\nPrewhaling abundance\n\nResearchers used a genetic approach to estimate pre-whaling abundance based on samples from 42 California gray whales, and reported DNA variability at 10 genetic loci consistent with a population size of 76,000–118,000 individuals, three to five times larger than the average census size as measured through 2007. NOAA has collected surveys gray whale population since at least the 1960s. They state that \"the most recent population estimate [from 2007] was approximately 19,000 whales, with a high probability (88%) that the population is at 'optimum sustainable population' size, as defined by the Marine Mammal Protection Act.  They speculate that the ocean ecosystem has likely changed since the prewhaling era, making a return to prewhaling numbers infeasible.  Factors limiting or threatening current population levels include ship strikes, entanglement in fishing gear, and changes in sea-ice coverage associated with climate change.\n\nIntegration and recolonization\n\nSeveral whales seen off Sakhalin and on Kamchatka Peninsula are confirmed to migrate towards eastern side of Pacific and join the larger eastern population. In January 2011, a gray whale that had been tagged in the western population was tracked as far east as the eastern population range off the coast of British Columbia. Recent findings from either stranded or entangled specimens indicate that the original western population have become functionally extinct and possibly all the whales appeared on Japanese and Chinese coasts in modern times are vagrants or re-colonizers from the eastern population.\n\nIn mid-1980, there were three gray whale sightings in the eastern Beaufort Sea, placing them 585 km further east than their known range at the time. Recent increases in sightings are confirmed in Arctic areas of the historic range for Atlantic stocks, most notably on several locations in the Laptev Sea including the New Siberian Islands in the East Siberian Sea, and around the marine mammal sanctuaryNefedova T., Gavrilo M., Gorshkov S. (2013). [http://www.rgo.ru/ru/article/letom-v-arktike-stalo-menshe-lda Летом в Арктике стало меньше льда] . Russian Geographical Society. retrieved on 24-05-2014 of the Franz Josef Land,Elwen H.S., Gridley T. (2013). [http://www.namibiandolphinproject.com/wp-content/uploads/2013/06/Elwen-Gridley_Gray-whale-in-Namibia-20130610.pdf Gray whale (Eschrichtius robustus) sighting in Namibia (SE Atlantic) – first record for Southern Hemisphere]. Mammal Research Institute, the University of Pretoria and the Namibian Dolphin Project. retrieved on 18-05-2014 indicating possible earlier pioneers of re-colonizations. These whales were darker in body color than those whales seen in Sea of Okhotsk. In May 2010, a gray whale was sighted off the Mediterranean shore of Israel. It has been speculated that this whale crossed from the Pacific to the Atlantic via the Northwest Passage, since an alternative route around Cape Horn would not be contiguous to the whale's established territory. There has been gradual melting and recession of Arctic sea ice with extreme loss in 2007 rendering the Northwest Passage \"fully navigable\". The same whale was sighted again on May 30, 2010, off the coast of Barcelona, Spain.\n\nIn May 2013, a gray whale was sighted off Walvis Bay, Namibia. Scientists from the Namibian Dolphin Project confirmed the whale's identity and thus provides the only sighting of this species in the Southern Hemisphere. Photographic identification suggests that this is a different individual than the one spotted in the Mediterranean in 2010. As of July 2013, the Namibian whale was still being seen regularly.[http://namibiandolphinproject.blogspot.ch/2013/05/a-rare-and-mysterious-visitor-in-walvis.html Namibian Dolphin Project: A rare and mysterious visitor in Walvis Bay]. Namibiandolphinproject.blogspot.ch (2013-05-14). Retrieved on 2013-07-28.\n\nGenetic analysis of fossil and prefossil gray whale remains in the Atlantic Ocean suggests several waves of dispersal from the Pacific to the Atlantic related to successive periods of climactic warming - during the Pleistocene before the last glacial period and the early Holocene immediately following the opening of the Bering Strait. This information and the recent sightings of Pacific gray whales in the Atlantic, suggest that another range expansion to the Atlantic may be starting.\n\nLife history\n\nReproduction\n\nBreeding behavior is complex and often involves three or more animals. Both male and female whales reach puberty at approximately eight years of age. Females show highly synchronized reproduction, undergoing oestrus in late November to early December. During the breeding season, it is common for females to have several mates. This single ovulation event is believed to coincide with the species’ annual migration patterns, when births can occur in warmer waters. Most females show biennial reproduction, although annual births have been reported. Males also show seasonal changes, experiencing an increase in testes mass that correlates with the time females undergo oestrus. Currently there are no accounts of twin births, although an instance of twins in utero has been reported.\n\nThe gestation period for gray whales is approximately 13  months. In the latter half of the pregnancy, the fetus experiences a rapid growth in length and mass. Similar to the narrow breeding season, most calves are born within a six-week time period in mid January. The calf is born tail first, and measures about 4 m in length. Females lactate for approximately seven months following birth, at which point calves are weaned and maternal care begins to decrease. The shallow lagoon waters in which gray whales reproduce are believed to protect the newborn from sharks and orcas.\n\nFeeding\n\nThe whale feeds mainly on benthic crustaceans, which it eats by turning on its side (usually the right, resulting in loss of eyesight in the right eye for many older animals) and scooping up sediments from the sea floor. This unique feeding selection makes gray whales one of the most strongly reliant on coastal waters among baleen whales. It is classified as a baleen whale and has baleen, or whalebone, which acts like a sieve, to capture small sea animals, including amphipods taken in along with sand, water and other material. Mostly, the animal feeds in the northern waters during the summer; and opportunistically feeds during its migration, depending primarily on its extensive fat reserves. Calf gray whales drink 190 - of their mothers' 53% fat milk per day.\n\nThe main feeding habitat of the western Pacific subpopulation is the shallow (5 - depth) shelf off northeastern Sakhalin Island, particularly off the southern portion of Piltun Lagoon, where the main prey species appear to be amphipods and isopods. In some years, the whales have also used an offshore feeding ground in 30 - depth southeast of Chayvo Bay, where benthic amphipods and cumaceans are the main prey species.Fadeev V.I. (2003). [http://www.sakhalinenergy.com/media/7d6c01c0-eb66-4ddf-a0df-31056cb622fe.pdf Benthos and prey studies in feeding grounds of the Okhotsk-Korean population of gray whales]. Final report on materials from field studies on the research vessel Nevelskoy in 2002. Marine Biology Institute, Vladivostok. Some gray whales have also been seen off western Kamchatka, but to date all whales photographed there are also known from the Piltun area.\n\nMigration\n\nPredicted distribution models indicate that overall range in the last glacial period was broader or more southerly distributed, and inhabitations in waters where species presences lack in present situation, such as in southern hemisphere and south Asian waters and northern Indian Ocean were possible due to feasibility of the environment on those days. Range expansions due to recoveries and re-colonization in the future is likely to be happen and the predicted range covers wider than that of today.\n\nEastern Pacific population\n\nEach October, as the northern ice pushes southward, small groups of eastern gray whales in the eastern Pacific start a two- to three-month, 8000 - trip south. Beginning in the Bering and Chukchi seas and ending in the warm-water lagoons of Mexico's Baja California Peninsula and the southern Gulf of California, they travel along the west coast of Canada, the United States and Mexico.\n\nTraveling night and day, the gray whale averages approximately 120 km per day at an average speed of 8 km/h. This round trip of 16000 - is believed to be the longest annual migration of any mammal. By mid-December to early January, the majority are usually found between Monterey and San Diego such as at Morro bay, often visible from shore. The whale watching industry provides ecotourists and marine mammal enthusiasts the opportunity to see groups of gray whales as they migrate.\n\nBy late December to early January, eastern grays begin to arrive in the calving lagoons and bays on the west coast of Baja California Sur. The three most popular are San Ignacio, Magdalena Bay to the south, and, to the north, Laguna Ojo de Liebre (formerly known in English as Scammon's Lagoon after whaleman Charles Melville Scammon, who discovered the lagoons in the 1850s and hunted the grays).\n\nGray whales once ranged into Sea of Cortez and Pacific coasts of continental Mexico south to the Islas Marías, Bahía de Banderas, and Nayarit/Jalisco, and there were two modern calving grounds in Sonora (Tojahui or Yavaros) and Sinaloa (Bahia Santa Maria) until being abandoned in 1980s.\n\nThese first whales to arrive are usually pregnant mothers looking for the protection of the lagoons to bear their calves, along with single females seeking mates. By mid-February to mid-March, the bulk of the population has arrived in the lagoons, filling them with nursing, calving and mating gray whales.\n\nThroughout February and March, the first to leave the lagoons are males and females without new calves. Pregnant females and nursing mothers with their newborns are the last to depart, leaving only when their calves are ready for the journey, which is usually from late March to mid-April. Often, a few mothers linger with their young calves well into May.\n\nBy late March or early April, the returning animals can be seen from Everett, Washington, to Puget Sound to Canada.\n\nResident group\n\nA population of about 200 gray whales stay along the eastern Pacific coast from Canada to California throughout the summer, not making the farther trip to Alaskan waters. This summer resident group is known as the Pacific Coast feeding group.\n\nAny historical or current presence of similar groups of residents among the western population is currently unknown, however, whalers' logbooks and scientific observations indicate that possible year-round occurrences in Chinese waters and Yellow and Bohai basins were likely to be summering grounds. Some of the better documented historical catches show that it was common for whales to stay for months in enclosed waters elsewhere, with known records in the Seto Inland Sea and the Gulf of Tosa. Former feeding areas were once spread over large portions on mid-Honshu to northern Hokkaido, and at least whales were recorded for majority of annual seasons including wintering periods at least along east coasts of Korean Peninsula and Yamaguchi Prefecture. Some recent observations indicate that historic presences of resident whales are possible: a group of two or three were observed feeding in Izu Ōshima in 1994 for almost a month, two single individuals stayed in Ise Bay for almost two months in the 1980s and in 2012, the first confirmed living individuals in Japanese EEZ in the Sea of Japan and the first of living cow-calf pairs since the end of whaling stayed for about three weeks on the coastline of Teradomari in 2014. One of the pair returned to the same coasts at the same time of the year in 2015 again. Reviewing on other cases on different locations among Japanese coasts and islands observed during 2015 indicate that spatial or seasonal residencies regardless of being temporal or permanental staying once occurred throughout many parts of Japan or on other coastal Asia.\n\nWestern population\n\nThe current western gray whale population summers in the Sea of Okhotsk, mainly off Piltun Bay region at the northeastern coast of Sakhalin Island (Russian Federation). There are also occasional sightings off the eastern coast of Kamchatka (Russian Federation) and in other coastal waters of the northern Okhotsk Sea. Its migration routes and wintering grounds are poorly known, the only recent information being from occasional records on both the eastern and western coasts of Japan and along the Chinese coast.Zhu, Q. (1998). \"Strandings and sightings of the western Pacific stock of the gray whale Eschrichtius robustus in Chinese coastal waters. Paper SC/50lAS5 presented to the IWC Scientific Committee, April 1998, Oman Gray whale had not been observed on Commander Islands until 2016.[http://news.zapoved.ru/2016/05/31/krasnoknizhnyj-seryj-kit-priplyl-pod-okna-ofisa-zapovednika-komandorskij/ Краснокнижный серый кит приплыл под окна офиса заповедника «Командорский»]. Retrieved on March 09, 2017\n\nThe Sea of Japan was once thought not to have been a migration route, until several entanglements were recorded. Any records of the species had not been confirmed since after 1921 on Kyushu. However, there were numerous records of whales along the Genkai Sea off Yamaguchi Prefecture,Uni Y. (2004) [http://www.h6.dion.ne.jp/~unisan/data/graywhale/cetaken15.html 西部系群コククジラ Eschrictius robustus の記録集成と通過海峡]. dion.ne.jp in Ine Bay in the Gulf of Wakasa, and in Tsushima. Gray whales, along with other species such as right whales and Baird's beaked whales, were common features off the north eastern coast of Hokkaido near Teshio, Ishikari Bay near Otaru, the Shakotan Peninsula, and islands in the La Pérouse Strait such as Rebun Island and Rishiri Island. These areas may also have included feeding grounds. There are shallow, muddy areas favorable for feeding whales off Shiretoko, such as at Shibetsu, the Notsuke Peninsula, Cape Ochiishi on Nemuro Peninsula, Mutsu Bay, along the Tottori Sand Dunes, in the Suou-nada Sea, and Omura Bay.\n\nThe historical calving grounds were unknown but might have been along southern Chinese coasts from Zhejiang and Fujian Province to Guangdong, especially south of Hailing Island and to near Hong Kong. Possibilities include Daya Bay, Wailou Harbour on Leizhou Peninsula, and possibly as far south as Hainan Province and Guangxi, particularly around Hainan Island. These areas are at the southwestern end of the known range. It is unknown whether the whales' normal range once reached further south, to the Gulf of Tonkin. In addition, the existence of historical calving ground on Taiwan and Penghu Islands (with some fossil records\n and capturesBrownell, R.L., Donovan, G.P., Kato, H., Larsen, F., Mattila, D., Reeves, R.R., Rock, Y., Vladimirov, V., Weller, D. & Zhu, Q. (2010) [https://portals.iucn.org/library/node/12737 Conservation Plan for Western North Pacific Gray Whales  (Eschrichtius robustus)]. IUCN), and any presence in other areas outside of the known ranges off Babuyan Islands in Philippines and coastal Vietnamese waters in Gulf of Tonkin are unknown. There is only one confirmed record of accidentally killing of the species in Vietnam, at Ngoc Vung Island off Ha Long Bay in 1994 and the skeleton is on exhibition at the Quang Ninh Provincial Historical Museum.2014. [http://www.cesti.gov.vn/kh-cn-trong-nuoc/chuan-hoa-ten-ca-voi-xam-trong-bo-suu-tap-mau-vat-bao-tang-lich-su-quang-ninh.html Chuẩn hóa lại tên cá voi xám trong bộ sưu tập mẫu vật của bảo tàng lịch sử tỉnh Quảng Ninh]. Retrieved on March 09, 20172012. [http://grobest.com.vn/tin-tuc/44-tin-tuc/310-bi-an-nhung-con-ca-voi-khong-lo-dat-vao-bien-viet-nam.html Bí ẩn những con cá khổng lồ dạt vào biển Việt Nam]. Retrieved on March 09, 2017 Gray whales are known to occur in Taiwan Strait even in recent years.What's on Xiamen.[http://www.whatsonxiamen.com/tag-Pingtan+gray+whale.html Tags > Pingtan gray whale]. Retrieved on November 24. 2014\n\nIt is also unknown whether any winter breeding grounds ever existed beyond Chinese coasts. For example, it is not known if the whales visited the southern coasts of the Korean Peninsula, adjacent to the Island of Jeju), Haiyang Island, the Gulf of Shanghai, or the Zhoushan Archipelago. There is no evidence of historical presence in Japan south of Ōsumi Peninsula;Uni Y., 2010, 『コククジラは大隅海峡を通るのか?』, Japan Cetology Research Group News Letter 25, retrieved on 11-05-2014 only one skeleton has been discovered in Miyazaki Prefecture.  Hideo Omura once considered the Seto Inland Sea to be a historical breeding ground, but only a handful of capture records support this idea, although migrations into the sea have been confirmed.\n\nRecent migration in Asian waters\n\nEven though South Korea put the most effort into conservation of the species among the Asian nations, there are no confirmed sightings along the Korean Peninsula or even in the Sea of Japan in recent years.\n\nThe last record in Korean waters was the sighting of a pair off Bangeojin, Ulsan in 1977. Prior to this, the last was of catches of 5 animals[http://www.greenpeace.org/eastasia/Global/eastasia/publications/reports/oceans/Disappearing%20Whales%20-%20South%20Korea.PDF Disappearing Whales: Korea's Inconvenient Truth]. Greenpeace (2012) off Ulsan in 1966.\n\nThere had been 24 records along Chinese coasts including sighting, stranding, intended hunts, and bycatches since 1933. The last report of occurrence of the species in Chinese waters was of a stranded semi adult female in the Bohai Sea in 1996, and the only record in Chinese waters in the 21st century was of a fully-grown female being killed by entanglement in Pingtan, China in November, 2007. DNA studies indicated that this individual might have originated from the eastern population rather than the western.\n\nMost notable observations of living whales after the 1980s were of 17 or 18 whales along Primorsky Krai in late October, 1989 (prior to this, a pair was reported swimming in the area in 1987), followed by the record of 14 whales in La Pérouse Strait on 13th, June in 1982 (in this strait, there was another sighting of a pair in October, 1987). In 2011, presences of gray whales were acoustically detected among pelagic waters in East China Sea between Chinese and Japanese waters.Gagnon, Chuck (November 2016) [https://www.iucn.org/sites/dev/files/wgwap_17-inf.6_iwc_66-cc29_wgw_observations_east_china_sea.pdf Western gray whale activity in the East China Sea from acoustic data: Memorandum for Dr. Brandon Southall]. iucn.org\n\nSince the mid 1990s, almost all the confirmed records of living animals in Asian waters were from Japanese coasts. There have been eight to fifteen sightings and stray records including unconfirmed sightings and re-sightings of the same individual, and one later killed by net-entanglement. The most notable of these observations are listed below:\n\n* The feeding activities of a group of two or three whales that stayed around Izu Ōshima in 1994 for almost a month were recorded underwater by several researchers and whale photographers.\n* A pair of thin juveniles were sighted off Kuroshio, Kōchi, a renowned town for whale-watching tourism of resident and sub-resident populations of Bryde's Whales, in 1997.[https://web.archive.org/web/20160304060253/http://svrsh2.kahaku.go.jp/drift/FMPro?-db\nrec2000web.fp5&-layhp&-format\n%2Fdrift%2Fe%2Fdetail.htm&rec_id=19970722EX-032&-find Marine Mammals Stranding DataBase]. kahaku.go.jp This sighting was unusual because of the location on mid-latitude in summer time.\n* Another pair of sub-adults were confirmed swimming near the mouth of Otani River in Suruga Bay in May, 2003.\n* A sub-adult whale that stayed in the Ise and Mikawa Bay for nearly two months in 2012[http://www.beachland.jp/beach/study/pdf/18.pdf 2012 年に漂着した海棲哺乳類につい]. .beachland.jp was later confirmed to be the same individual as the small whale observed off Tahara near Cape Irago in 2010, making it the first confirmed constant migration out of Russian waters. The juvenile observed off Owase in Kumanonada Sea in 2009 might or might not be the same individual. The Ise and Mikawa Bay region is the only location along Japanese coasts that has several records since the 1980s (a mortal entanglement in 1968, above mentioned short-stay in 1982, self-freeing entanglement in 2005), and is also the location where the first commercial whaling started. Other areas with several sighting or stranding records in recent years are off the Kumanonada Sea in Wakayama, off  Oshika Peninsula in Tohoku, and on coastlines close to Tomakomai, Hokkaido.\n* Possibly the first confirmed record of living animals in Japanese waters in the Sea of Japan since the end of whaling occurred on 3 April 2014 at Nodumi Beach, Teradomari, Niigata. Two individuals, measuring ten and five metres respectively, stayed near the mouth of Shinano River for three weeks. It is unknown whether this was a cow-calf pair, which would have been a first record in Asia. All of the previous modern records in the Sea of Japan were of by-catches.\n* One of the above pair returned on the same beaches at the same time of a year in 2015.\n*A juvenile or possibly or not with another larger individual remained in Japanese waters between January or March and May 2015. It was first confirmed occurrences of the species on remote, oceanic islands in Japan. One or more visited waters firstly on Kōzu-shima and Nii-Jima for weeks then adjacent to Miho no Matsubara and behind the Tokai University campus for several weeks. Possibly the same individual was seen off Futo as well. This later was identified as the same individual previously recorded on Sakhalin in 2014, the first re-recording one individual at different Asian locations.\n* A young whale was observed by land-based fishermen at Cape Irago in March, 2015.\n* One of the above pair appeared in 2015 off southeastern Japan and then reappeared off Tateyama in January, 2016. The identity of this whale was confirmed by Nana Takanawa who photographed the same whale on Niijima in 2015.Braulik, Gill (2015-04-16) [https://web.archive.org/web/20160123234348/https://www.iucn-csg.org/index.php/2015/04/16/1940/ Young Gray Whale Sighted near Tokyo Islands]. IUCN SSC – Cetacean Specialist Group Likely the same individual was sighted off Futo and half an hour later off Akazawa beach in Itō, Shizuoka on the 14th. The whale then stayed next to a pier on Miyake-jima and later at Habushi beach on Niijima, the same beach the same individual stayed near on the previous year.\n* One whale of 9 m was beached nearby Wadaura on March 4, 2016.[https://web.archive.org/web/20160305073024/http://www3.nhk.or.jp/news/html/20160305/k10010432701000.html 絶滅心配 コククジラの死骸 千葉・南房総で見つかる]. nhk.or.jp (2015-05-03) Investigations on the corpse indicate that this was likely a different individual from the above animal.\n* A 7 m carcass of young female was firstly reported floating along Atami on 4 April then was washed ashore on Ito on the 6th.[http://izu-np.co.jp/ito/news/20160407iz0000000007000c.html 伊東市新井海岸の打ち上げ死骸　絶滅危惧種、コククジラと判明] \n* As of April 20, 2017, one or more whale(s) have been staying within Tokyo Bay since February although at one point another whale if or if not the same individual sighted off Hayama, Kanagawa.[http://www.news24.jp/articles/2017/04/18/07359324.html 東京湾でクジラの目撃相次ぐ]. Retrieved on April 21, 2017鎌倉ゴムボートコング山田肇. 2017.「https://www.youtube.com/watch?v=9v7b02cCsP0　ゴムボート東京湾ホエールウォッチング❗ 」. YouTube. Retrieved on April 21, 2017 It is unclear the exact number of whales included in these sightings; two whales reported by fishermen and Japanese coastal guard reported three whales on 20th or 21th.みんなのニュース. 2017. [http://www.fnn-news.com/news/headlines/articles/CONN00356017.html 撮影成功! 姿現した「東京湾クジラ」]. The Fuji News Network Retrieved on April 22, 2017\n\nWhaling\n\nNorth Pacific\n\nEastern population\n\nHumans and killer whales (orcas) are the adult gray whale's only predators. Aboriginal hunters, including those on Vancouver Island and the Makah in Washington, have hunted gray whales.\n\nCommercial whaling by Europeans of the species in the North Pacific began in the winter of 1845–46, when two United States ships, the Hibernia and the United States, under Captains Smith and Stevens, caught 32 in Magdalena Bay. More ships followed in the two following winters, after which gray whaling in the bay was nearly abandoned because \"of the inferior quality and low price of the dark-colored gray whale oil, the low quality and quantity of whalebone from the gray, and the dangers of lagoon whaling.\"\n\nGray whaling in Magdalena Bay was revived in the winter of 1855–56 by several vessels, mainly from San Francisco, including the ship Leonore, under Captain Charles Melville Scammon. This was the first of 11 winters from 1855 through 1865 known as the \"bonanza period\", during which gray whaling along the coast of Baja California reached its peak. Not only were the whales taken in Magdalena Bay, but also by ships anchored along the coast from San Diego south to Cabo San Lucas and from whaling stations from Crescent City in northern California south to San Ignacio Lagoon. During the same period, vessels targeting right and bowhead whales in the Gulf of Alaska, Sea of Okhotsk, and the Western Arctic would take the odd gray whale if neither of the more desirable two species were in sight.\n\nIn December 1857, Charles Scammon, in the brig Boston, along with his schooner-tender Marin, entered Laguna Ojo de Liebre (Jack-Rabbit Spring Lagoon) or later known as Scammon's Lagoon (by 1860) and found one of the gray's last refuges. He caught 20 whales. He returned the following winter (1858–59) with the bark Ocean Bird and schooner tenders A.M. Simpson and Kate. In three months, he caught 47 cows, yielding 1700 oilbbl of oil. In the winter of 1859–60, Scammon, again in the bark Ocean Bird, along with several other vessels, performed a similar feat of daring by entering San Ignacio Lagoon to the south where he discovered the last breeding lagoon. Within only a couple of seasons, the lagoon was nearly devoid of whales.\n\nBetween 1846 and 1874, an estimated 8,000 gray whales were killed by American and European whalemen, with over half having been killed in the Magdalena Bay complex (Estero Santo Domingo, Magdalena Bay itself, and Almejas Bay) and by shore whalemen in California and Baja California. This, for the most part, does not take into account the large number of calves injured or left to starve after their mothers had been killed in the breeding lagoons. Since whalemen primarily targeted these new mothers, several thousand deaths should probably be added to the total. Shore whaling in California and Baja California continued after this period, until the early 20th century.\n\nA second, shorter, and less intensive hunt occurred for gray whales in the eastern North Pacific. Only a few were caught from two whaling stations on the coast of California from 1919 to 1926, and a single station in Washington (1911–21) accounted for the capture of another. For the entire west coast of North America for the years 1919 to 1929, some 234 gray whales were caught. Only a dozen or so were taken by British Columbian stations, nearly all of them in 1953 at Coal Harbour. A whaling station in Richmond, California, caught 311 gray whales for \"scientific purposes\" between 1964 and 1969. From 1961 to 1972, the Soviet Union caught 138 gray whales (they originally reported not having taken any). The only other significant catch was made in two seasons by the steam-schooner California off Malibu, California. In the winters of 1934–35 and 1935–36, the California anchored off Point Dume in Paradise Cove, processing gray whales. In 1936, gray whales became protected in the United States.Brownell Jr., R. L. and Swartz, S. L. 2006. The floating factory ship California operations in Californian waters, 1932–1937. International Whaling Commission, Scientific Committee.\n\nWestern population\n\nThe Japanese began to catch gray whales beginning in the 1570s. At Kawajiri, Nagato, 169 gray whales were caught between 1698 and 1889. At Tsuro, Shikoku, 201 were taken between 1849 and 1896.Kasuya, T. (2002). \"Japanese whaling\", in Encyclopedia of Marine Mammals. W. F. Perrin, B. Wursig, and J.G.M. Thewissen, eds. San Diego: Academic Press, pp. 655–662, . Several hundred more were probably caught by American and European whalemen in the Sea of Okhotsk from the 1840s to the early 20th century. Whalemen caught 44 with nets in Japan during the 1890s. The real damage was done between 1911 and 1933, when Japanese whalemen killed 1,449 after Japanese companies established several whaling stations on Korean Peninsula and on Chinese coast such as near the Daya bay and on Hainan Island. By 1934, the western gray whale was near extinction. From 1891 to 1966, an estimated 1,800–2,000 gray whales were caught, with peak catches of between 100 and 200 annually occurring in the 1910s.\n\nAs of 2001, the Californian gray whale population had grown to about 26,000. As of 2011, the population of western Pacific (seas near Korea, Japan, and Kamchatka) gray whales was an estimated 130.[https://www.nytimes.com/aponline/2011/01/18/us/AP-US-Rare-Whale-Bering-Sea.html?_r=1&hp] \n\nNorth Atlantic\n\nThe North Atlantic population may have been hunted to extinction in the 18th century. Circumstantial evidence indicates whaling could have contributed to this population's decline, as the increase in whaling activity in the 17th and 18th centuries coincided with the population's disappearance. A. B. Van Deinse points out the \"scrag whale\", described by P. Dudley in 1725, as one target of early New England whalers, was almost certainly the gray whale. In his 1835 history of Nantucket Island, Obed Macy wrote that in the early pre-1672 colony, a whale of the kind called \"scragg\" entered the harbor and was pursued and killed by the settlers. Gray whales (Icelandic sandlægja) were described in Iceland in the early 17th century.Jón Guðmundsson lærði (1966). Ein stutt udirrietting um Íslands adskiljanlegu náttúrur. ed. Halldór Hermannsson, Cornell University Library, Ithaca, New York. Formations of industrial whaling among the Mediterranean basin(s) have been considered to be feasible as well.\n\nConservation\n\nGray whales have been granted protection from commercial hunting by the International Whaling Commission (IWC) since 1949, and are no longer hunted on a large scale.\n\nLimited hunting of gray whales has continued since that time, however, primarily in the Chukotka region of northeastern Russia, where large numbers of gray whales spend the summer months. This hunt has been allowed under an \"aboriginal/subsistence whaling\" exception to the commercial-hunting ban. Anti-whaling groups have protested the hunt, saying the meat from the whales is not for traditional native consumption, but is used instead to feed animals in government-run fur farms; they cite annual catch numbers that rose dramatically during the 1940s, at the time when state-run fur farms were being established in the region. Although the Soviet government denied these charges as recently as 1987, in recent years the Russian government has acknowledged the practice. The Russian IWC delegation has said that the hunt is justified under the aboriginal/subsistence exemption, since the fur farms provide a necessary economic base for the region's native population.\n\nCurrently, the annual quota for the gray whale catch in the region is 140 per year. Pursuant to an agreement between the United States and Russia, the Makah tribe of Washington claimed four whales from the IWC quota established at the 1997 meeting. With the exception of a single gray whale killed in 1999, the Makah people have been prevented from hunting by a series of legal challenges, culminating in a United States federal appeals court decision in December 2002 that required the National Marine Fisheries Service to prepare an Environmental Impact Statement. On September 8, 2007, five members of the Makah tribe shot a gray whale using high-powered rifles in spite of the decision. The whale died within 12 hours, sinking while heading out to sea.\n\nAs of 2008, the IUCN regards the gray whale as being of \"Least Concern\" from a conservation perspective. However, the specific subpopulation in the northwest Pacific is regarded as being \"Critically Endangered\". The northwest Pacific population is also listed as endangered by the U.S. government’s National Marine Fisheries Service under the U.S. Endangered Species Act. The IWC Bowhead, Right and Gray Whale subcommittee in 2011 reiterated the conservation risk to western gray whales is large because of the small size of the population and the potential anthropogenic impacts.\n\nIn their breeding grounds in Baja California, Mexican law protects whales in their lagoons while still permitting whale watching. Gray whales are protected under Canada's Species at Risk Act which obligates Canadian governments to prepare management plans for the whales and consider the interests of the whales when permitting development.\n\nGray Whale migrations off of the Pacific Coast were observed, initially, by Marineland of the Pacific in Palos Verdes, California.  The Gray Whale Census, an official Gray Whale migration census that has been recording data on the migration of the Pacific Gray Whale has been keeping track of the population of the Pacific Gray Whale since 1985.  This census is the longest running census of the Pacific Gray Whale.  Census keepers volunteer from December 1 through May, from sun up to sun down, seven days a week, keeping track of the amount of Gray Whales migrating through the area off of Los Angeles.  Information from this census is listed through the American Cetacean Society of Los Angeles (ACSLA).\n\nSouth Korea and China list gray whales as protected species of high concern. In South Korea, the Gray Whale Migration Site was registered as the 126th national monument in 1962, although illegal hunts had been taken place thereafter, and there have been no recent sightings of the species in Korean waters.\n\nRewilding proposal\n\nIn 2005, two conservation biologists proposed a plan to airlift 50 gray whales from the Pacific Ocean to the Atlantic Ocean. They reasoned that, as Californian gray whales had replenished to a suitable population, surplus whales could be transported to repopulate the extinct British population.  this plan has not been undertaken.\n\nThreats\n\nAccording to the Government of Canada's Management Plan for gray whales, threats to the eastern North Pacific population of gray whales include:[http://www.dfo-mpo.gc.ca/species-especes/species-especes/greyWhale-NP-baleine-grise-PN-eng.htm The Grey Whale (Eastern North Pacific Population)] . Species at Risk. dfo-mpo.gc.ca increased human activities in their breeding lagoons in Mexico, climate change, acute noise, toxic spills, aboriginal whaling, entanglement with fishing gear, boat collisions, and possible impacts from fossil fuel exploration and extraction.\n\nWestern gray whales are facing, the large-scale offshore oil and gas development programs near their summer feeding ground, as well as fatal net entrapments off Japan during migration, which pose significant threats to the future survival of the population. The substantial nearshore industrialization and shipping congestion throughout the migratory corridors of the western gray whale population represent potential threats by increasing the likelihood of exposure to ship strikes, chemical pollution, and general disturbance.\n\nOffshore gas and oil development in the Okhotsk Sea within 20 km of the primary feeding ground off northeast Sakhalin Island is of particular concern. Activities related to oil and gas exploration, including geophysical seismic surveying, pipelaying and drilling operations, increased vessel traffic, and oil spills, all pose potential threats to western gray whales. Disturbance from underwater industrial noise may displace whales from critical feeding habitat. Physical habitat damage from drilling and dredging operations, combined with possible impacts of oil and chemical spills on benthic prey communities also warrants concern.\n\nAlong Japanese coasts, four females including a cow-calf pair were trapped and killed in nets in the 2000s. There had been a record of deceased individual thought to be harpooned by dolphin-hunters found on Hokkaido in the 1990s. Meats for sale were also discovered in Japanese markets as well.\n\nCaptivity\n\nBecause of their size and need to migrate, gray whales have rarely been held in captivity, and then only for brief periods of time. The first captive gray whale, who was captured in Scammon's Lagoon, Baja California in 1965, was named Gigi and died two months later from an infection. The second gray whale, who was captured in 1972 from the same lagoon, was named Gigi II and was released a year later after becoming too large for the facilities. The last gray whale, J.J., first beached herself in Marina del Rey, California where she was rushed to SeaWorld San Diego. After 14 months, she was released because she also grew too large to be cared for in the existing facilities. Reaching  and 31 ft, J.J. was the largest creature ever to be kept in captivity. Gray whale. http://en.wikipedia.org/?curid=13026."
  }
}
