{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17284",
  "eid" : "2b33c6f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778581727,
  "textBody" : "Kathleen Norris Stark (born April 26, 1956, New York City), better known as Koo Stark, is an American photographer and actress, remembered for her friendship with Prince Andrew.\n\nShe is a Patron of the Julia Margaret Cameron Trust and Cancer Active.\n\nEarly life\n\nStark's parents were Wilbur Stark (1912–1995), a writer and producer, and Kathi Norris (1919–2005), a writer and television presenter in New York. She is the youngest of three children, the others being Pamela (born 1946) and Brad (born 1952). At the time of her birth, the family was living in a Manhattan apartment.TV Personalities: Biographical Sketch Book Volume 3 (1957), p. 148 Her grandfather, Edwin Earl Norris (1876–1957) was a cabinetmaker and musician, playing the French horn and the viola in the Newark Symphony Orchestra. The family were Presbyterians.Andrew Devore Boyd, Joseph Boyd, Sr. (died 1799) of Prince George's County, Maryland, and his family through six generations' (2010), p. 34: '221. Lena A. Loyd''Edwin Earl Norris, 80, widely known cabinetmaker and musician', obituary in Newark Advocate dated February 27, 1957 After a divorce in the 1960s, her mother remarried.Andrew Morton, Mick Seamark, Andrew, the Playboy Prince (1983), p. 137\n\nKoo Stark attended the Hewitt School in New York and the Glendower Preparatory School in Kensington, London. After training at a stage school, she embarked on an acting career.[https://www.nytimes.com/1995/08/14/obituaries/wilbur-stark-tv-producer-81.html Wilbur Stark, TV Producer, 81] , dated August 14, 1995, at nytimes.com, accessed 12 November 2017\n\nOf working with her in 1976, Victor Spinetti later wrote \"I found Koo Stark to be an enchanting girl and terribly bright and interesting\".Beatlefan, volume 7 (Goody Press, 1985), p. 12\n\nActor\n\nHer first film role was in the comedy All I Want Is You... and You... and You... (1974), produced by her father. In 1975 she appeared in Las adolescentes (The Adolescents), opposite Anthony Andrews,\"Adolescentes, Las\", in Luis Gasca, Un siglo de cine español (Planeta, 1998), p. 17 and starred in an episode of Shades of Greene.Quentin Falk, Travels in Greeneland: The Complete Guide to the Cinema of Graham Greene (2000), p. 149\nAlso that year she had an uncredited role as a bridesmaid in The Rocky Horror Picture Show. Her best remembered performance is the lead role in the avant-garde film Emily (1976), directed by Henry Herbert, 17th Earl of Pembroke.Christopher Neame, A Take on British TV Drama: Stories from the Golden Years (Scarecrow Press, 2004), p. xiv-xv Uncertain whether to accept the part, Stark did so on the advice of Graham Greene, with whom she had worked the year before. She also starred in Cruel Passion (1977), a film based on the novel Justine. Around the same time, she played the part of Camie Loneozner in Star Wars (1977); the Anchorhead scenes were cut from the film before release,Marcus Hearn, The Cinema of George Lucas (2005), p. 106 but can be seen in Star Wars: Behind the Magic (1998).Newsweek, Volume 132 (1998), p. 122\n\nStark also began to work as a fashion model, particularly for Norman Parkinson.Hugh Montgomery Massingberd, The Daily Telegraph Third Book of Obituaries: Entertainers (1998), p. 122 In February 1981 she was at the National Theatre as an understudy in the Edward Albee play Who’s Afraid of Virginia Woolf?\n\nShe appeared in the comedy Eat the Rich (1987), and then featured in Timeslides, an episode of the sci-fi show Red Dwarf (1989), playing Lady Sabrina Mulholland-Jjones, the fiancée of a more successful Dave Lister in a parallel universe.Paul Green, Encyclopedia of Weird War Stories: Supernatural and Science Fiction Elements (2017), p. 148\n\nIn September 1987 she returned to the stage, taking the part of Vera Claybourne in Agatha Christie's And Then There Were None at the Duke of York's Theatre.[https://theatricalia.com/play/5ms/and-then-there-were-none/production/s0p And Then There Were None]  at theatricalia.com, accessed 7 November 2017 The London Theatre Record posed the question \"Why has a girl so obviously three-dimensional chosen a part so obviously two-dimensional?\"London Theatre Record, Volume 8, Issues 1-13, p. 184. She played Miss Scarlett in the 1991 series of Cluedo, succeeding Toyah Willcox and befriending Rula Lenska.Karen Louise Hollis, The Other Side of the Table (2011), p. 61\n\nPhotographer\n\nStark has worked as a photographer since the 1980s, and may have been the first person being pursued by the paparazzi to turn the tables by shooting pictures of them.Liam Clifford, [http://www.amateurphotographer.co.uk/latest/photo-news/koo-stark-returns-to-london-for-the-first-time-in-23-years-104411 Koo Stark returns to London for first exhibition in 23 years]  dated April 12, 2017 at amateurphotographer.co.uk, accessed 12 November 2017 Prince Andrew has told how in 1983 a photographic printer, Gene Nocon, invited Stark to take pictures of people taking pictures of her for his exhibition, called \"Personal Points of View\", planned for October, and how she persuaded Nocon to include Andrew's work as well.Prince Andrew, Photographs (Hamilton, 1985), p. 8: \"The next step in my development as a photographer, apart from my trial and error experimenting, came when Koo Stark, now Jefferies, came back to the U.K. with some pictures of herself, taken by Norman Parkinson, for printing. To get them printed she went to see photographic printer Gene Nocon. At this time Gene was organising an exhibition, to be held in October 1983, of photographs taken by people who were themselves the subjects of photographers. He invited her - as someone in public life and the subject of photographers - to take pictures of them taking pictures of her for his exhibition, called \"Personal Points of View\". Koo came to see me and suggested that I should take part as well. I replied that I was sure that I wouldn't be allowed to. Koo then went back to see Gene without my knowledge and asked him if a friend of hers could also take part. Although Koo was reluctant to name names and Gene was equally reluctant to agree to an unknown person taking part, it seems they came to an understanding...\" Her early photographs led to a book deal, for which she took lessons from Norman Parkinson. She travelled to Tobago, where he lived, and he became her mentor. Her book Contrasts (1985) included about a hundred of her pictures, many of them light in touch. She went on to study the work of leading photographers, including Angus McBean, whom she met and photographed,Phil Coomes, [http://www.bbc.co.uk/news/in-pictures-39816498 In pictures: Koo Stark on both sides of the lens]  dated 8 May 2017 at BBC.co.uk developing her interests in photography to include reportage, portraits, landscapes, still life, and other work.\n\nContrasts was launched at Hamiltons Gallery, London, in September 1985 with an exhibition of the same name.British Journal of Photography, Volume 132 (Henry Greenwood & Co., 1985), p. 1022 In 1994 the Gallery Bar at the Grosvenor House Hotel in Park Lane hosted an exhibition called The Stark Image, forty photographs by Stark, including previously unpublished pictures.British Journal of Photography, Volume 141 (Henry Greenwood & Co., 1994), p. 58 In 1998 her work was featured at the Como Lario in Holbein Place, Belgravia.Jim Ainsworth, The Good Food Guide 1998 (Which? Books, 1998), p. 87 In July 2001 she had an exhibition called Stark Images at the Fruitmarket Gallery in Edinburgh,British Journal of Photography, Volume 148 (Henry Greenwood & Co., 2001), issue 7346 duplicated from June to July 2001 at Dimbola Lodge on the Isle of Wight.Harriet Lane, [https://www.theguardian.com/theobserver/2001/jun/17/featuresreview.review The Stark ages] , in The Observer dated 17 June 2001, accessed 12 November 2017 A solo exhibition of portraits was at the Winter Gardens, Ventnor, from September to October 2010,David Bartlett, [https://onthewight.com/koo-stark-exhibition-at-winter-gardens/ Koo Stark Exhibition At Winter Gardens]  dated 8th September, 2010, at onthewight.com, accessed 12 November 2017 and another at Dimbola Lodge from February to April, 2011.[http://www.iwcp.co.uk/events-february-2011.aspx Events February 2011]  at iwcp.co.uk, Isle of Wight County Press, accessed 19 November 2017: \"Koo Stark Contrasts Art Exhibition at Dimbola Lodge Museum, Freshwater, closed Mondays.\"\n\nOn 22 April 1987 a charity auction at Christie's, St James's, for the Campaign to Protect Rural England, featured signed work by David Bailey, Patrick Lichfield, Don McCullin, Terence Donovan, Fay Godwin, Heather Angel, Clive Arrowsmith, Linda McCartney, Koo Stark, and fifteen others,British Journal of Photography, Volume 134 (Henry Greenwood & Co., 1987), p. 234BBC Wildlife, Volumes 4-5 (1986), p. 201Arts Review, Volume 39, Issues 1-13 (Richard Gainsborough Periodicals, 1987), p. 136 Views by Stark, including some of Kirby Muxloe Castle, were in G. H. Davies's England's Glory (1987), a CPRE book launched at the same time.Review of G. H. Davies's England's Glory: a Photographic Journey through England's Threatened Landscape in Antiquity, Volume 61 (Antiquity Publications, 1987), p. 476\n\nPictures by Stark have appeared in Country LifeBritish Design Strikes a Winning Pose by Jennifer Guerrini-Maraldi, photographs by Koo Stark in Country Life volume 191 (1997) and other magazines. Several of her portraits are in the National Gallery,[http://www.npg.org.uk/collections/search/person/mp19378/koo-stark Koo Stark (1956-)]  at npg.org.uk, accessed 12 November 2017 and work is also in the collections of the Victoria and Albert Museum.\n\nA solo exhibition hosted by the Leica gallery in Mayfair in May 2017 was entitled Kintsugi, a Japanese word for a way of renovating things that have been broken. Stark explained the title: \"Kintsugi is a way of learning to see individual beauty, and to appreciate the value of experience and honesty. It is the antithesis of digital, airbrushed, Photoshop-homogenised ‘beauty’.\" In August the exhibition was repeated in Manchester, to mark the opening of a new Leica store there.Nigel Barlow, [http://aboutmanchester.co.uk/koo-stark-exhibition-comes-to-manchester/ Koo Stark exhibition comes to Manchester]  dated August 11, 2017, at aboutmanchester.co.uk, accessed 12 November 2017\n\nA Leica user, Stark has said her camera transcends mere function and is a personal friend.\n\nPrivate life\n\nStark met Prince Andrew in February 1981, and they were close for some two years, before and after his active service in the Falklands War.Alastair Burnet, The ITN book of the royal wedding (Michael O'Mara Books, 1986), p. 38: \"The actress Miss Koo Stark was a regular girlfriend of Prince Andrew for several years.\" Tina Brown has claimed that this was Andrew's only serious love affair.Tina Brown, The Diana Chronicles (2011), p. 228 In October 1982 they took a holiday together on the island of Mustique.Kim McNamara, Paparazzi: Media Practices and Celebrity Culture (2015), p. 29 According to Lady Colin Campbell, Andrew was in love, and the Queen was \"much taken with the elegant, intelligent, and discreet Koo\".Lady Colin Campbell, The Real Diana, p. 161 However, in 1983 they split up, under pressure from press, paparazzi, and palace.  In 1988 Stark said \"The amount of attention and pressure on me became unbearable. It was a nightmare.\"'My royal fling wrecked my life, says Koo Stark' in Weekly World News magazine dated October 18, 1988 Also in 1988 she brought a successful libel action against The Mail on Sunday over an untrue story headed 'Koo dated Andy after she wed'.'Koo Stark v Mail on Sunday (1988) unreported', in Vivienne Harpwood, ed., Modern Tort Law,  6th edition (2005), p. 340 In 1989 The Spectator reported that she had received £300,000 from one newspaper \"for years of inaccurate persecution\" and was also collecting money from others.The Spectator, Volume 262 (1989), p. 19 In 1997 Andrew became the godfather of Stark's daughter,Newsweek, Volume 128 (1997), p. 76 and in 2015, when Andrew was facing accusations from Virginia Roberts, Stark came to his defence, stating that he was a good man and she could help to rebut the claims.\n\nStark married Tim Jeffries, manager of a photographic gallery, in August 1984,Milestones, in Time dated Aug. 27, 1984 at St Saviour's, Hampstead, with the minister, Christopher Neil-Smith, commenting that \"It was such a quiet affair you wouldn't have known it was happening.\"'Stark weds Green Shield heir', AP report in The Daily Register dated August 17, 1984, page A2, col. 1 They stayed together for a year and later divorced. In the early 1990s she dated Simon Sebag Montefiore.Elizabeth Grice, [http://www.telegraph.co.uk/news/features/3632741/I-used-to-be-the-most-shambolic-person....html 'I used to be the most shambolic person...']  in The Daily Telegraph online dated 30 May 1987, accessed 19 November 2017\n\nAbout 1993, Stark was hit by a taxi in Old Compton Street, losing two teeth and also suffering a deep wound to her forehead, dented by collision with her camera. This accident left her disfigured, but the wound closed up after a visit to the Dalai Lama in India, leaving a small scar just under the hair-line. She has been a practising Buddhist since meeting the Dalai Lama.Time, Volume 149 (Time Incorporated, 1997), p. 19\n\nShe was later engaged to Warren Walker, an American banker, but he cancelled their wedding before the birth of their daughter Tatiana in May 1997.[https://web.archive.org/web/20080928034554/http://findarticles.com/p/articles/mi_qn4158/is_19980818/ai_n14180192 \"Koo's praise for her daughter's father\"] in The Independent (London), dated August 18, 1998, accessed October 7, 2007\n\nIn 2002 Stark was diagnosed with breast cancer and endured a double mastectomy and chemotherapy, causing her to lose her hair for a time.[https://www.standard.co.uk/news/koos-battle-against-cancer-7280553.html Koo's battle against cancer]  in Evening Standard dated 23 March 2004, accessed 17 November 2017\n\nIn another libel action in 2007, Stark won an apology and substantial damages from Zoo Magazine, which had described her as a porn star. She commented \"I am relieved that my name has been cleared of this false, highly damaging and serious allegation which has been proved to be completely untrue.\"[https://www.carter-ruck.com/news/read/koo-stark Koo Stark news release]  at carter-ruck.com, accessed 12 November 2017 In 2011, The Daily Telegraph called her an early Kate Middleton prototype and reported that she had been sued over debts to the Jumeirah Carlton Tower, Knightsbridge.\n\nStark continues to live in London and is a member of the Chelsea Arts Club. She is a Patron of the Julia Margaret Cameron Trust and Cancer Active.\n\nFilms and television\n\n*All I Want Is You... and You... and You... (1974) : Jennifer Ready\n*The Rocky Horror Picture Show (1975) : Bridesmaid (uncredited)\n*Las adolescentes (1975) : Ana\n*Shades of Greene, episode The Blue Film (1975) : Girl\n*The Awakening of Emily (1976): Emily Foster\n*The Sunday Drama, episode The Cuckoo Calls (LWT, 1977) : Deborah\n*Cruel Passion (1977) : Justine Jerome\n*Star Wars (1977) : Camie Loneozner (scenes cut)\n*Electric Dreams (1984) : Girl in Soap Opera\n*The Two Ronnies, episode 12.2 (1986) : Alice\n*Eat the Rich (1987) : Hazel\n*Red Dwarf, episode Timeslides (1989) : Lady Sabrina Mulholland-Jjones\n*Cluedo (1991 series) : Miss Scarlett\n*Star Wars: Behind the Magic (1998) : Camie Loneozner (scenes from 1977)\n\nPublications\n\n*Koo Stark, Contrasts (The Book Service Ltd, 1985) \n\nPhotographic exhibitions\n\n*'Contrasts', Hamiltons Gallery, Carlos Place, London, September 1985\n*'The Stark Image', Gallery Bar at Grosvenor House Hotel, London, 1994\n*'Stark Images', Dimbola Lodge, Isle of Wight, June to July 2001\n*'Stark Images', Fruitmarket Gallery, Market Street, Edinburgh, July 2001\n*'Portraits by Koo Stark', Winter Gardens, Ventnor, Isle of Wight, September to October 2010\n*'Koo Stark: Contrasts', Dimbola Lodge, Isle of Wight, February to April, 2011\n*'Kintsugi', Leica gallery, Bruton Place, Mayfair, May 2017\n*'Kintsugi', Leica store, Police Street, Manchester, August 2017\n*'Kintsugi Portraits', San Lorenzo, Beauchamp Place, London SW3, November 2017[https://www.rexfeatures.com/livefeed/2017/11/23/'kintsugi_portraits'_by_koo_stark_exhibition_launch_at_san_lorenzo,_london? 'Kintsugi Portraits' by Koo Stark exhibition launch at San Lorenzo, London, 23 November 2017], accessed 29 November 2017",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Koo Stark" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17284" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kathleen Norris Stark (born April 26, 1956, New York City), better known as Koo Stark, is an American photographer and actress, remembered for her friendship with Prince Andrew.\n\nShe is a Patron of the Julia Margaret Cameron Trust and Cancer Active.\n\nEarly life\n\nStark's parents were Wilbur Stark (1912–1995), a writer and producer, and Kathi Norris (1919–2005), a writer and television presenter in New York. She is the youngest of three children, the others being Pamela (born 1946) and Brad (born 1952). At the time of her birth, the family was living in a Manhattan apartment.TV Personalities: Biographical Sketch Book Volume 3 (1957), p. 148 Her grandfather, Edwin Earl Norris (1876–1957) was a cabinetmaker and musician, playing the French horn and the viola in the Newark Symphony Orchestra. The family were Presbyterians.Andrew Devore Boyd, Joseph Boyd, Sr. (died 1799) of Prince George's County, Maryland, and his family through six generations' (2010), p. 34: '221. Lena A. Loyd''Edwin Earl Norris, 80, widely known cabinetmaker and musician', obituary in Newark Advocate dated February 27, 1957 After a divorce in the 1960s, her mother remarried.Andrew Morton, Mick Seamark, Andrew, the Playboy Prince (1983), p. 137\n\nKoo Stark attended the Hewitt School in New York and the Glendower Preparatory School in Kensington, London. After training at a stage school, she embarked on an acting career.[https://www.nytimes.com/1995/08/14/obituaries/wilbur-stark-tv-producer-81.html Wilbur Stark, TV Producer, 81] , dated August 14, 1995, at nytimes.com, accessed 12 November 2017\n\nOf working with her in 1976, Victor Spinetti later wrote \"I found Koo Stark to be an enchanting girl and terribly bright and interesting\".Beatlefan, volume 7 (Goody Press, 1985), p. 12\n\nActor\n\nHer first film role was in the comedy All I Want Is You... and You... and You... (1974), produced by her father. In 1975 she appeared in Las adolescentes (The Adolescents), opposite Anthony Andrews,\"Adolescentes, Las\", in Luis Gasca, Un siglo de cine español (Planeta, 1998), p. 17 and starred in an episode of Shades of Greene.Quentin Falk, Travels in Greeneland: The Complete Guide to the Cinema of Graham Greene (2000), p. 149\nAlso that year she had an uncredited role as a bridesmaid in The Rocky Horror Picture Show. Her best remembered performance is the lead role in the avant-garde film Emily (1976), directed by Henry Herbert, 17th Earl of Pembroke.Christopher Neame, A Take on British TV Drama: Stories from the Golden Years (Scarecrow Press, 2004), p. xiv-xv Uncertain whether to accept the part, Stark did so on the advice of Graham Greene, with whom she had worked the year before. She also starred in Cruel Passion (1977), a film based on the novel Justine. Around the same time, she played the part of Camie Loneozner in Star Wars (1977); the Anchorhead scenes were cut from the film before release,Marcus Hearn, The Cinema of George Lucas (2005), p. 106 but can be seen in Star Wars: Behind the Magic (1998).Newsweek, Volume 132 (1998), p. 122\n\nStark also began to work as a fashion model, particularly for Norman Parkinson.Hugh Montgomery Massingberd, The Daily Telegraph Third Book of Obituaries: Entertainers (1998), p. 122 In February 1981 she was at the National Theatre as an understudy in the Edward Albee play Who’s Afraid of Virginia Woolf?\n\nShe appeared in the comedy Eat the Rich (1987), and then featured in Timeslides, an episode of the sci-fi show Red Dwarf (1989), playing Lady Sabrina Mulholland-Jjones, the fiancée of a more successful Dave Lister in a parallel universe.Paul Green, Encyclopedia of Weird War Stories: Supernatural and Science Fiction Elements (2017), p. 148\n\nIn September 1987 she returned to the stage, taking the part of Vera Claybourne in Agatha Christie's And Then There Were None at the Duke of York's Theatre.[https://theatricalia.com/play/5ms/and-then-there-were-none/production/s0p And Then There Were None]  at theatricalia.com, accessed 7 November 2017 The London Theatre Record posed the question \"Why has a girl so obviously three-dimensional chosen a part so obviously two-dimensional?\"London Theatre Record, Volume 8, Issues 1-13, p. 184. She played Miss Scarlett in the 1991 series of Cluedo, succeeding Toyah Willcox and befriending Rula Lenska.Karen Louise Hollis, The Other Side of the Table (2011), p. 61\n\nPhotographer\n\nStark has worked as a photographer since the 1980s, and may have been the first person being pursued by the paparazzi to turn the tables by shooting pictures of them.Liam Clifford, [http://www.amateurphotographer.co.uk/latest/photo-news/koo-stark-returns-to-london-for-the-first-time-in-23-years-104411 Koo Stark returns to London for first exhibition in 23 years]  dated April 12, 2017 at amateurphotographer.co.uk, accessed 12 November 2017 Prince Andrew has told how in 1983 a photographic printer, Gene Nocon, invited Stark to take pictures of people taking pictures of her for his exhibition, called \"Personal Points of View\", planned for October, and how she persuaded Nocon to include Andrew's work as well.Prince Andrew, Photographs (Hamilton, 1985), p. 8: \"The next step in my development as a photographer, apart from my trial and error experimenting, came when Koo Stark, now Jefferies, came back to the U.K. with some pictures of herself, taken by Norman Parkinson, for printing. To get them printed she went to see photographic printer Gene Nocon. At this time Gene was organising an exhibition, to be held in October 1983, of photographs taken by people who were themselves the subjects of photographers. He invited her - as someone in public life and the subject of photographers - to take pictures of them taking pictures of her for his exhibition, called \"Personal Points of View\". Koo came to see me and suggested that I should take part as well. I replied that I was sure that I wouldn't be allowed to. Koo then went back to see Gene without my knowledge and asked him if a friend of hers could also take part. Although Koo was reluctant to name names and Gene was equally reluctant to agree to an unknown person taking part, it seems they came to an understanding...\" Her early photographs led to a book deal, for which she took lessons from Norman Parkinson. She travelled to Tobago, where he lived, and he became her mentor. Her book Contrasts (1985) included about a hundred of her pictures, many of them light in touch. She went on to study the work of leading photographers, including Angus McBean, whom she met and photographed,Phil Coomes, [http://www.bbc.co.uk/news/in-pictures-39816498 In pictures: Koo Stark on both sides of the lens]  dated 8 May 2017 at BBC.co.uk developing her interests in photography to include reportage, portraits, landscapes, still life, and other work.\n\nContrasts was launched at Hamiltons Gallery, London, in September 1985 with an exhibition of the same name.British Journal of Photography, Volume 132 (Henry Greenwood & Co., 1985), p. 1022 In 1994 the Gallery Bar at the Grosvenor House Hotel in Park Lane hosted an exhibition called The Stark Image, forty photographs by Stark, including previously unpublished pictures.British Journal of Photography, Volume 141 (Henry Greenwood & Co., 1994), p. 58 In 1998 her work was featured at the Como Lario in Holbein Place, Belgravia.Jim Ainsworth, The Good Food Guide 1998 (Which? Books, 1998), p. 87 In July 2001 she had an exhibition called Stark Images at the Fruitmarket Gallery in Edinburgh,British Journal of Photography, Volume 148 (Henry Greenwood & Co., 2001), issue 7346 duplicated from June to July 2001 at Dimbola Lodge on the Isle of Wight.Harriet Lane, [https://www.theguardian.com/theobserver/2001/jun/17/featuresreview.review The Stark ages] , in The Observer dated 17 June 2001, accessed 12 November 2017 A solo exhibition of portraits was at the Winter Gardens, Ventnor, from September to October 2010,David Bartlett, [https://onthewight.com/koo-stark-exhibition-at-winter-gardens/ Koo Stark Exhibition At Winter Gardens]  dated 8th September, 2010, at onthewight.com, accessed 12 November 2017 and another at Dimbola Lodge from February to April, 2011.[http://www.iwcp.co.uk/events-february-2011.aspx Events February 2011]  at iwcp.co.uk, Isle of Wight County Press, accessed 19 November 2017: \"Koo Stark Contrasts Art Exhibition at Dimbola Lodge Museum, Freshwater, closed Mondays.\"\n\nOn 22 April 1987 a charity auction at Christie's, St James's, for the Campaign to Protect Rural England, featured signed work by David Bailey, Patrick Lichfield, Don McCullin, Terence Donovan, Fay Godwin, Heather Angel, Clive Arrowsmith, Linda McCartney, Koo Stark, and fifteen others,British Journal of Photography, Volume 134 (Henry Greenwood & Co., 1987), p. 234BBC Wildlife, Volumes 4-5 (1986), p. 201Arts Review, Volume 39, Issues 1-13 (Richard Gainsborough Periodicals, 1987), p. 136 Views by Stark, including some of Kirby Muxloe Castle, were in G. H. Davies's England's Glory (1987), a CPRE book launched at the same time.Review of G. H. Davies's England's Glory: a Photographic Journey through England's Threatened Landscape in Antiquity, Volume 61 (Antiquity Publications, 1987), p. 476\n\nPictures by Stark have appeared in Country LifeBritish Design Strikes a Winning Pose by Jennifer Guerrini-Maraldi, photographs by Koo Stark in Country Life volume 191 (1997) and other magazines. Several of her portraits are in the National Gallery,[http://www.npg.org.uk/collections/search/person/mp19378/koo-stark Koo Stark (1956-)]  at npg.org.uk, accessed 12 November 2017 and work is also in the collections of the Victoria and Albert Museum.\n\nA solo exhibition hosted by the Leica gallery in Mayfair in May 2017 was entitled Kintsugi, a Japanese word for a way of renovating things that have been broken. Stark explained the title: \"Kintsugi is a way of learning to see individual beauty, and to appreciate the value of experience and honesty. It is the antithesis of digital, airbrushed, Photoshop-homogenised ‘beauty’.\" In August the exhibition was repeated in Manchester, to mark the opening of a new Leica store there.Nigel Barlow, [http://aboutmanchester.co.uk/koo-stark-exhibition-comes-to-manchester/ Koo Stark exhibition comes to Manchester]  dated August 11, 2017, at aboutmanchester.co.uk, accessed 12 November 2017\n\nA Leica user, Stark has said her camera transcends mere function and is a personal friend.\n\nPrivate life\n\nStark met Prince Andrew in February 1981, and they were close for some two years, before and after his active service in the Falklands War.Alastair Burnet, The ITN book of the royal wedding (Michael O'Mara Books, 1986), p. 38: \"The actress Miss Koo Stark was a regular girlfriend of Prince Andrew for several years.\" Tina Brown has claimed that this was Andrew's only serious love affair.Tina Brown, The Diana Chronicles (2011), p. 228 In October 1982 they took a holiday together on the island of Mustique.Kim McNamara, Paparazzi: Media Practices and Celebrity Culture (2015), p. 29 According to Lady Colin Campbell, Andrew was in love, and the Queen was \"much taken with the elegant, intelligent, and discreet Koo\".Lady Colin Campbell, The Real Diana, p. 161 However, in 1983 they split up, under pressure from press, paparazzi, and palace.  In 1988 Stark said \"The amount of attention and pressure on me became unbearable. It was a nightmare.\"'My royal fling wrecked my life, says Koo Stark' in Weekly World News magazine dated October 18, 1988 Also in 1988 she brought a successful libel action against The Mail on Sunday over an untrue story headed 'Koo dated Andy after she wed'.'Koo Stark v Mail on Sunday (1988) unreported', in Vivienne Harpwood, ed., Modern Tort Law,  6th edition (2005), p. 340 In 1989 The Spectator reported that she had received £300,000 from one newspaper \"for years of inaccurate persecution\" and was also collecting money from others.The Spectator, Volume 262 (1989), p. 19 In 1997 Andrew became the godfather of Stark's daughter,Newsweek, Volume 128 (1997), p. 76 and in 2015, when Andrew was facing accusations from Virginia Roberts, Stark came to his defence, stating that he was a good man and she could help to rebut the claims.\n\nStark married Tim Jeffries, manager of a photographic gallery, in August 1984,Milestones, in Time dated Aug. 27, 1984 at St Saviour's, Hampstead, with the minister, Christopher Neil-Smith, commenting that \"It was such a quiet affair you wouldn't have known it was happening.\"'Stark weds Green Shield heir', AP report in The Daily Register dated August 17, 1984, page A2, col. 1 They stayed together for a year and later divorced. In the early 1990s she dated Simon Sebag Montefiore.Elizabeth Grice, [http://www.telegraph.co.uk/news/features/3632741/I-used-to-be-the-most-shambolic-person....html 'I used to be the most shambolic person...']  in The Daily Telegraph online dated 30 May 1987, accessed 19 November 2017\n\nAbout 1993, Stark was hit by a taxi in Old Compton Street, losing two teeth and also suffering a deep wound to her forehead, dented by collision with her camera. This accident left her disfigured, but the wound closed up after a visit to the Dalai Lama in India, leaving a small scar just under the hair-line. She has been a practising Buddhist since meeting the Dalai Lama.Time, Volume 149 (Time Incorporated, 1997), p. 19\n\nShe was later engaged to Warren Walker, an American banker, but he cancelled their wedding before the birth of their daughter Tatiana in May 1997.[https://web.archive.org/web/20080928034554/http://findarticles.com/p/articles/mi_qn4158/is_19980818/ai_n14180192 \"Koo's praise for her daughter's father\"] in The Independent (London), dated August 18, 1998, accessed October 7, 2007\n\nIn 2002 Stark was diagnosed with breast cancer and endured a double mastectomy and chemotherapy, causing her to lose her hair for a time.[https://www.standard.co.uk/news/koos-battle-against-cancer-7280553.html Koo's battle against cancer]  in Evening Standard dated 23 March 2004, accessed 17 November 2017\n\nIn another libel action in 2007, Stark won an apology and substantial damages from Zoo Magazine, which had described her as a porn star. She commented \"I am relieved that my name has been cleared of this false, highly damaging and serious allegation which has been proved to be completely untrue.\"[https://www.carter-ruck.com/news/read/koo-stark Koo Stark news release]  at carter-ruck.com, accessed 12 November 2017 In 2011, The Daily Telegraph called her an early Kate Middleton prototype and reported that she had been sued over debts to the Jumeirah Carlton Tower, Knightsbridge.\n\nStark continues to live in London and is a member of the Chelsea Arts Club. She is a Patron of the Julia Margaret Cameron Trust and Cancer Active.\n\nFilms and television\n\n*All I Want Is You... and You... and You... (1974) : Jennifer Ready\n*The Rocky Horror Picture Show (1975) : Bridesmaid (uncredited)\n*Las adolescentes (1975) : Ana\n*Shades of Greene, episode The Blue Film (1975) : Girl\n*The Awakening of Emily (1976): Emily Foster\n*The Sunday Drama, episode The Cuckoo Calls (LWT, 1977) : Deborah\n*Cruel Passion (1977) : Justine Jerome\n*Star Wars (1977) : Camie Loneozner (scenes cut)\n*Electric Dreams (1984) : Girl in Soap Opera\n*The Two Ronnies, episode 12.2 (1986) : Alice\n*Eat the Rich (1987) : Hazel\n*Red Dwarf, episode Timeslides (1989) : Lady Sabrina Mulholland-Jjones\n*Cluedo (1991 series) : Miss Scarlett\n*Star Wars: Behind the Magic (1998) : Camie Loneozner (scenes from 1977)\n\nPublications\n\n*Koo Stark, Contrasts (The Book Service Ltd, 1985) \n\nPhotographic exhibitions\n\n*'Contrasts', Hamiltons Gallery, Carlos Place, London, September 1985\n*'The Stark Image', Gallery Bar at Grosvenor House Hotel, London, 1994\n*'Stark Images', Dimbola Lodge, Isle of Wight, June to July 2001\n*'Stark Images', Fruitmarket Gallery, Market Street, Edinburgh, July 2001\n*'Portraits by Koo Stark', Winter Gardens, Ventnor, Isle of Wight, September to October 2010\n*'Koo Stark: Contrasts', Dimbola Lodge, Isle of Wight, February to April, 2011\n*'Kintsugi', Leica gallery, Bruton Place, Mayfair, May 2017\n*'Kintsugi', Leica store, Police Street, Manchester, August 2017\n*'Kintsugi Portraits', San Lorenzo, Beauchamp Place, London SW3, November 2017[https://www.rexfeatures.com/livefeed/2017/11/23/'kintsugi_portraits'_by_koo_stark_exhibition_launch_at_san_lorenzo,_london? 'Kintsugi Portraits' by Koo Stark exhibition launch at San Lorenzo, London, 23 November 2017], accessed 29 November 2017. Koo Stark. http://en.wikipedia.org/?curid=17284."
  }
}
