{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11558",
  "eid" : "fc749d30-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778503299,
  "textBody" : "Flamenco, in its strictest sense, is a professionalized art-form based on the various folkloric music traditions of Southern Spain in the autonomous communities of Andalusia, Extremadura and Murcia. In a wider sense, it refers to these musical traditions and more modern musical styles which have themselves been deeply influenced by and become blurred with the development of flamenco over the past two centuries. It includes cante (singing), toque (guitar playing), baile (dance), jaleo (vocalizations), palmas (handclapping) and pitos (finger snapping).\n\nThe oldest record of flamenco dates to 1774 in the book Las Cartas Marruecas by José Cadalso. The genre originated in the music and dance styles of Andalusia, of much older origin.See the third definition for \"flamenc\" in the Dictionary of Real Academia Española. Flamenco has been influenced by and become associated with the Romani people in Spain; however, unlike Romani music in Eastern Europe, its origin and style is uniquely Andalusian.Manuel Ríos Ruiz notes that the development of flamenco is well documented:  \"the theatre movement of sainetes (one-act plays) and tonadillas, popular song books and song sheets, customs, studies of dances, and toques, perfection, newspapers, graphic documents in paintings and engravings....in continuous evolution together with rhythm, the poetic stanzas, and the ambiance\". Ríos Ruiz, Manuel: Ayer y hoy del cante flamenco, Ediciones ISTMO, Tres Cantos (Madrid), 1997, \n\nIn recent years, flamenco has become popular all over the world and is taught in many non-Hispanic countries, especially the United States and Japan. In Japan, there are more flamenco academies than there are in Spain.En El Salvador la agrupación Alma Flamenca es considerada la máxima representante y pionera de este movimiento musical.  On November 16, 2010, UNESCO declared flamenco one of the Masterpieces of the Oral and Intangible Heritage of Humanity.[http://es.noticias.yahoo.com/5/20101116/tlc-el-flamenco-es-declarado-patrimonio-d712def.html El flamenco es declarado Patrimonio Cultural Inmaterial de la Humanidad por la Unesco], Yahoo Noticias, 16 de noviembre de 2010, consultado el mismo día.\n\nEtymology \n\nThere are many suggestions for the origin of the word flamenco as a musical term (summarized below) but no solid evidence for any of them. The word was not recorded as a musical and dance term until the late 18th century.\n\nOne theory is that the Spanish word flamenco could have been a  derivative of the Spanish word flama, meaning \"fire\" or \"flame\".  The word flamenco may have come to be used for fiery behaviour, which could have come to be applied to the Gitano players and performers.\n\nAnother theory, proposed by Andalusian historian and nationalist Blas Infante in his 1933 book Orígenes de lo Flamenco y Secreto del Cante Jondo suggested that the word flamenco comes in fact from the Hispano-Arabic term fellah mengu, meaning \"expelled peasant\". This term referred to the many Andalusians of the Islamic faith, the Moriscos who remained, and in order to avoid religious persecution, joined with the Roma newcomers.\n\nPalos \n\nPalos (formerly known as cantes) are flamenco styles, classified by criteria such as rhythmic pattern, mode, chord progression, stanzaic form and geographic origin. There are over 50 different palos, some are sung unaccompanied while others have guitar or other accompaniment. Some forms are danced while others are not. Some are reserved for men and others for women while some may be performed by either, though these traditional distinctions are breaking down: the Farruca, for example, once a male dance, is now commonly performed by women too.\n\nThere are many ways to categorize Palos but they traditionally fall into three classes: the most serious is known as cante jondo (or cante grande), while lighter, frivolous forms are called cante chico. Forms that do not fit either category are classed as cante intermedio.\n\nThese are the best known palos:\n* Alegrías\n* Bulerías\n* Bulerías por soleá (soleá por bulerías)\n* Caracoles\n* Cartageneras\n* Fandango\n* Fandango de Huelva\n* Fandango Malagueño\n* Farruca\n* Granaínas\n* Guajiras\n* Malagueñas\n* Mineras\n* Peteneras\n* Rondeñas\n* Rumba\n* Saeta\n* Seguiriyas\n* Sevillanas\n* Tangos\n* Tanguillos\n* Tarantos\n* Tientos\n* Villancicos\n\nMusic \n\nStructure \n\nA typical flamenco recital with voice and guitar accompaniment, comprises a series of pieces (not exactly “songs”) in different palos. Each song  of a set of verses (called copla, tercio, or letras), which are punctuated by guitar interludes called falsetas. The guitarist also provides a short introduction which sets the tonality, compás and tempo of the cante. In some palos, these falsetas are also played with certain structures too; for example, the typical sevillanas is played in an AAB pattern, where A and B are the same falseta with only a slight difference in the ending.\n\nHarmony \n\nFlamenco uses the Flamenco mode (which can also be described as the modern Phrygian mode (modo frigio), or a harmonic version of that scale with a major 3rd degree), in addition to the major and minor scales commonly used in modern Western music. The Phrygian mode occurs in palos such as soleá, most bulerías, siguiriyas, tangos and tientos.\n\nA typical chord sequence, usually called the \"Andalusian cadence\" may be viewed as in a modified Phrygian: in E the sequence is Am–G–F–E. According to Manolo Sanlúcar E is here the tonic, F has the harmonic function of dominant while Am and G assume the functions of subdominant and mediant respectively.\n\nGuitarists tend to use only two basic inversions or \"chord shapes\" for the tonic chord (music), the open 1st inversion E and the open 3rd inversion A, though they often transpose these by using a capo. Modern guitarists such as Ramón Montoya, have introduced other positions: Montoya himself started to use other chords for the tonic in the modern Dorian sections of several palos; F for tarantas, B for granaínas and A for the minera. Montoya also created a new palo as a solo for guitar, the rondeña in C with scordatura. Later guitarists have further extended the repertoire of tonalities, chord positions and scordatura.\n\nThere are also palos in major mode; most cantiñas and alegrías, guajiras, some bulerías and tonás, and the cabales (a major type of siguiriyas). The minor mode is restricted to the Farruca, the milongas (among cantes de ida y vuelta), and some styles of tangos, bulerías, etc. In general traditional palos in major and minor mode are limited harmonically to two-chord (tonic–dominant) or three-chord (tonic–subdominant–dominant) progressions. (Rossy 1998:92) However modern guitarists have introduced chord substitution, transition chords, and even modulation.\n\nFandangos and derivative palos such as malagueñas, tarantas and cartageneras are bimodal: guitar introductions are in Phrygian mode while the singing develops in major mode, modulating to Phrygian at the end of the stanza. (Rossy 1998:92)\n\nMelody \n\nDionisio Preciado, quoted by Sabas de Hoces  established the following characteristics for the melodies of flamenco singing:\n\n#Microtonality: presence of intervals smaller than the semitone.\n#Portamento: frequently, the change from one note to another is done in a smooth transition, rather than using discrete intervals.\n#Short tessitura or range: Most traditional flamenco songs are limited to a range of a sixth (four tones and a half). The impression of vocal effort is the result of using different timbres, and variety is accomplished by the use of microtones.\n#Use of enharmonic scale. While in equal temperament scales, enharmonics are notes with identical pitch but different spellings (e.g. A♭ and G♯); in flamenco, as in unequal temperament scales, there is a microtonal intervalic difference between enharmonic notes.\n#Insistence on a note and its contiguous chromatic notes (also frequent in the guitar), producing a sense of urgency.\n#Baroque ornamentation, with an expressive, rather than merely aesthetic function.\n#Apparent lack of regular rhythm, especially in the siguiriyas: the melodic rhythm of the sung line is different from the metric rhythm of the accompaniment.\n#Most styles express sad and bitter feelings.\n#Melodic improvisation: flamenco singing is not, strictly speaking, improvised, but based on a relatively small number of traditional songs, singers add variations on the spur of the moment.\n\nMusicologist Hipólito Rossy adds the following characteristics (Rossy 1997: 97):\n\n*Flamenco melodies are characterized by a descending tendency, as opposed to, for example, a typical opera aria, they usually go from the higher pitches to the lower ones, and from forte to piano, as was usual in ancient Greek scales.\n*In many styles, such as soleá or siguiriya, the melody tends to proceed in contiguous degrees of the scale. Skips of a third or a fourth are rarer. However, in fandangos and fandango-derived styles, fourths and sixths can often be found, especially at the beginning of each line of verse. According to Rossy, this is proof of the more recent creation of this type of songs, influenced by Castilian jota.\n\nCompás \n\nCompás is the Spanish word for metre or time signature (in classical music theory). It also refers to the rhythmic cycle, or layout, of a palo.\n\nThe compás is fundamental to flamenco. Compás is most often translated as rhythm but it demands far more precise interpretation than any other Western style of music. If there is no guitarist available, the compás is rendered through hand clapping (palmas) or by hitting a table with the knuckles. The guitarist uses techniques like strumming (rasgueado) or tapping the soundboard (golpe). Changes of chords emphasize the most important downbeats.\n\nFlamenco uses three basic counts or measures: Binary, Ternary and a form of a twelve-beat cycle that is unique to flamenco. There are also free-form styles including, among others, the tonás, saetas, malagueñas, tarantos, and some types of fandangos.\n\n*Rhythms in  or . These metres are used in forms like tangos, tientos, gypsy rumba, zambra and tanguillos.\n*Rhythms in . These are typical of fandangos and sevillanas, suggesting their origin as non-Roma styles, since the  and  measures are not common in ethnic Roma music.\n*12-beat rhythms usually rendered in amalgams of  +  and sometimes . The 12-beat cycle is the most common in flamenco, differentiated by the accentuation of the beats in different palos. The accents do not correspond to the classic concept of the downbeat. The alternating of groups of 2 and 3 beats is also common in Spanish folk dances of the 16th Century such as the zarabanda, jácara and canarios.\n\nThere are three types of 12-beat rhythms, which vary in their layouts, or use of accentuations: soleá, seguiriya and bulería.\n\n#peteneras and guajiras: 1 2 3 4 5 6 7 8 9 10 11 12. Both palos start with the strong accent on 12. Hence the meter is  12 1 2 3 4 5 6 7 8 9 10 11...\n#The seguiriya, liviana, serrana, toná liviana, cabales: 121 2 3 4 5 6 7 8 9 10 11 12.\n#soleá, within the cantiñas group of palos which includes the alegrías, cantiñas, mirabras, romera, caracoles and soleá por bulería (also \"bulería por soleá\"): 1 2 3 4 5 6 7 8 9 10 11 12. For practical reasons, when transferring flamenco guitar music to sheet music, this rhythm is written as a regular .\n\nThe Bulerías is the emblematic palo of flamenco: today its 12-beat cycle is most often played with accents on the 3rd, 6th, 8th, 10th and 12th beats. The accompanying palmas are played in groups of 6 beats, giving rise to a multitude of counter-rhythms and percussive voices within the 12 beat compás.\n\nForms of flamenco expression \n\nToque (guitar) \n\nThe origins, history and importance of the flamenco guitar is covered in the main Wikipedia entry for the Flamenco guitar\n\nCante (song) \n\nThe origins, history and importance of the cante is covered in the main Wikipedia entry for the cante flamenco.\n\nBaile (dance) \n\nEl baile flamenco is known for its emotional intensity, proud carriage, expressive use of the arms and rhythmic stamping of the feet (often confused with tap dance or Irish dance but with a completely different technique). As with any dance form, many different styles of flamenco have developed.\n\nIn the twentieth century, flamenco danced informally at gitano (Roma) celebrations in Spain was considered the most \"authentic\" form of flamenco. There is less virtuoso technique in gitano flamenco, but the music and steps are fundamentally the same. The arms are noticeably different from classical flamenco, curving around the head and body rather than extending, often with a bent elbow.\n\n\"Flamenco puro\" is considered the form of performance flamenco closest to its gitano influences. In this style, the dance is always performed solo, and is improvised rather than choreographed. Some purists frown on castanets (even though they can be seen in many early 20th century photos of flamenco dancers).\n\n\"Classical flamenco\" is the style most frequently performed by Spanish flamenco dance companies, tending to exhibit more clearly the characteristics derived from the Seguidilla, a traditional Spanish dance. It is danced largely in a proud and upright way. For women, the back is often held in a marked back bend. Unlike the more gitano influenced styles, there is little movement of the hips, the body is tightly held and the arms are long, like a ballet dancer. In fact many of the dancers in these companies have trained in ballet as well as flamenco. Flamenco has both influenced and been influenced by ballet, as evidenced by the fusion of the two created by 'La Argentinita' in the early part of the twentieth century and later, by Joaquín Cortés.\n\nIn the 1950s Jose Greco was one of the most famous male Flamenco dancers, performing on stage worldwide and on television including the Ed Sullivan Show, and reviving the art almost singlehandedly.\n\nModern flamenco is a highly technical dance style requiring years of study. The emphasis for both male and female performers is on lightning-fast footwork performed with absolute precision. In addition, the dancer may have to dance while using props such as castanets, shawls and fans.\n\n\"Flamenco nuevo\" is a recent style in flamenco, characterized by pared-down costumes (the men often dance bare-chested, and the women in plain jersey dresses). Props such as castanets, fans and shawls are rarely used. Dances are choreographed and include influences from other dance styles.\n\nThe flamenco most foreigners are familiar with is a style that was developed as a spectacle for tourists. To add variety, group dances are included and even solos are more likely to be choreographed. The frilly, voluminous spotted dresses are derived from a style of dress worn for the Sevillanas at the annual Feria in Seville.\n\nIn traditional flamenco, young people are not considered to have the emotional maturity to adequately convey the duende (soul) of the genre. Therefore, unlike other dance forms, where dancers turn professional early to take advantage of youth and strength, many flamenco dancers do not hit their peak until their thirties and will continue to perform into their fifties and beyond.\n\nFile:Castelucho.jpg|Claudio Castelucho, Flamenco\nFile:Theatre Flamenco Work Sample.webm|Theatre Flamenco Work Sample\nFile:Baile andaluz 1893 José Villegas Cordero.jpg|José Villegas Cordero, Baile Andaluz\nFile:Sargent John Singer Spanish Dancer.jpg|John Singer Sargent, Spanish Dancer\nFlamenco_Dancer_Doll.jpg|A doll depicts a dancer with the traditional costume\n\n;Scenes of flamenco performance in Seville.\n\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 07.JPG\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 11.JPG\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 19.JPG\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 20.JPG\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 23.JPG",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Flamenco" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11558" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Flamenco, in its strictest sense, is a professionalized art-form based on the various folkloric music traditions of Southern Spain in the autonomous communities of Andalusia, Extremadura and Murcia. In a wider sense, it refers to these musical traditions and more modern musical styles which have themselves been deeply influenced by and become blurred with the development of flamenco over the past two centuries. It includes cante (singing), toque (guitar playing), baile (dance), jaleo (vocalizations), palmas (handclapping) and pitos (finger snapping).\n\nThe oldest record of flamenco dates to 1774 in the book Las Cartas Marruecas by José Cadalso. The genre originated in the music and dance styles of Andalusia, of much older origin.See the third definition for \"flamenc\" in the Dictionary of Real Academia Española. Flamenco has been influenced by and become associated with the Romani people in Spain; however, unlike Romani music in Eastern Europe, its origin and style is uniquely Andalusian.Manuel Ríos Ruiz notes that the development of flamenco is well documented:  \"the theatre movement of sainetes (one-act plays) and tonadillas, popular song books and song sheets, customs, studies of dances, and toques, perfection, newspapers, graphic documents in paintings and engravings....in continuous evolution together with rhythm, the poetic stanzas, and the ambiance\". Ríos Ruiz, Manuel: Ayer y hoy del cante flamenco, Ediciones ISTMO, Tres Cantos (Madrid), 1997, \n\nIn recent years, flamenco has become popular all over the world and is taught in many non-Hispanic countries, especially the United States and Japan. In Japan, there are more flamenco academies than there are in Spain.En El Salvador la agrupación Alma Flamenca es considerada la máxima representante y pionera de este movimiento musical.  On November 16, 2010, UNESCO declared flamenco one of the Masterpieces of the Oral and Intangible Heritage of Humanity.[http://es.noticias.yahoo.com/5/20101116/tlc-el-flamenco-es-declarado-patrimonio-d712def.html El flamenco es declarado Patrimonio Cultural Inmaterial de la Humanidad por la Unesco], Yahoo Noticias, 16 de noviembre de 2010, consultado el mismo día.\n\nEtymology \n\nThere are many suggestions for the origin of the word flamenco as a musical term (summarized below) but no solid evidence for any of them. The word was not recorded as a musical and dance term until the late 18th century.\n\nOne theory is that the Spanish word flamenco could have been a  derivative of the Spanish word flama, meaning \"fire\" or \"flame\".  The word flamenco may have come to be used for fiery behaviour, which could have come to be applied to the Gitano players and performers.\n\nAnother theory, proposed by Andalusian historian and nationalist Blas Infante in his 1933 book Orígenes de lo Flamenco y Secreto del Cante Jondo suggested that the word flamenco comes in fact from the Hispano-Arabic term fellah mengu, meaning \"expelled peasant\". This term referred to the many Andalusians of the Islamic faith, the Moriscos who remained, and in order to avoid religious persecution, joined with the Roma newcomers.\n\nPalos \n\nPalos (formerly known as cantes) are flamenco styles, classified by criteria such as rhythmic pattern, mode, chord progression, stanzaic form and geographic origin. There are over 50 different palos, some are sung unaccompanied while others have guitar or other accompaniment. Some forms are danced while others are not. Some are reserved for men and others for women while some may be performed by either, though these traditional distinctions are breaking down: the Farruca, for example, once a male dance, is now commonly performed by women too.\n\nThere are many ways to categorize Palos but they traditionally fall into three classes: the most serious is known as cante jondo (or cante grande), while lighter, frivolous forms are called cante chico. Forms that do not fit either category are classed as cante intermedio.\n\nThese are the best known palos:\n* Alegrías\n* Bulerías\n* Bulerías por soleá (soleá por bulerías)\n* Caracoles\n* Cartageneras\n* Fandango\n* Fandango de Huelva\n* Fandango Malagueño\n* Farruca\n* Granaínas\n* Guajiras\n* Malagueñas\n* Mineras\n* Peteneras\n* Rondeñas\n* Rumba\n* Saeta\n* Seguiriyas\n* Sevillanas\n* Tangos\n* Tanguillos\n* Tarantos\n* Tientos\n* Villancicos\n\nMusic \n\nStructure \n\nA typical flamenco recital with voice and guitar accompaniment, comprises a series of pieces (not exactly “songs”) in different palos. Each song  of a set of verses (called copla, tercio, or letras), which are punctuated by guitar interludes called falsetas. The guitarist also provides a short introduction which sets the tonality, compás and tempo of the cante. In some palos, these falsetas are also played with certain structures too; for example, the typical sevillanas is played in an AAB pattern, where A and B are the same falseta with only a slight difference in the ending.\n\nHarmony \n\nFlamenco uses the Flamenco mode (which can also be described as the modern Phrygian mode (modo frigio), or a harmonic version of that scale with a major 3rd degree), in addition to the major and minor scales commonly used in modern Western music. The Phrygian mode occurs in palos such as soleá, most bulerías, siguiriyas, tangos and tientos.\n\nA typical chord sequence, usually called the \"Andalusian cadence\" may be viewed as in a modified Phrygian: in E the sequence is Am–G–F–E. According to Manolo Sanlúcar E is here the tonic, F has the harmonic function of dominant while Am and G assume the functions of subdominant and mediant respectively.\n\nGuitarists tend to use only two basic inversions or \"chord shapes\" for the tonic chord (music), the open 1st inversion E and the open 3rd inversion A, though they often transpose these by using a capo. Modern guitarists such as Ramón Montoya, have introduced other positions: Montoya himself started to use other chords for the tonic in the modern Dorian sections of several palos; F for tarantas, B for granaínas and A for the minera. Montoya also created a new palo as a solo for guitar, the rondeña in C with scordatura. Later guitarists have further extended the repertoire of tonalities, chord positions and scordatura.\n\nThere are also palos in major mode; most cantiñas and alegrías, guajiras, some bulerías and tonás, and the cabales (a major type of siguiriyas). The minor mode is restricted to the Farruca, the milongas (among cantes de ida y vuelta), and some styles of tangos, bulerías, etc. In general traditional palos in major and minor mode are limited harmonically to two-chord (tonic–dominant) or three-chord (tonic–subdominant–dominant) progressions. (Rossy 1998:92) However modern guitarists have introduced chord substitution, transition chords, and even modulation.\n\nFandangos and derivative palos such as malagueñas, tarantas and cartageneras are bimodal: guitar introductions are in Phrygian mode while the singing develops in major mode, modulating to Phrygian at the end of the stanza. (Rossy 1998:92)\n\nMelody \n\nDionisio Preciado, quoted by Sabas de Hoces  established the following characteristics for the melodies of flamenco singing:\n\n#Microtonality: presence of intervals smaller than the semitone.\n#Portamento: frequently, the change from one note to another is done in a smooth transition, rather than using discrete intervals.\n#Short tessitura or range: Most traditional flamenco songs are limited to a range of a sixth (four tones and a half). The impression of vocal effort is the result of using different timbres, and variety is accomplished by the use of microtones.\n#Use of enharmonic scale. While in equal temperament scales, enharmonics are notes with identical pitch but different spellings (e.g. A♭ and G♯); in flamenco, as in unequal temperament scales, there is a microtonal intervalic difference between enharmonic notes.\n#Insistence on a note and its contiguous chromatic notes (also frequent in the guitar), producing a sense of urgency.\n#Baroque ornamentation, with an expressive, rather than merely aesthetic function.\n#Apparent lack of regular rhythm, especially in the siguiriyas: the melodic rhythm of the sung line is different from the metric rhythm of the accompaniment.\n#Most styles express sad and bitter feelings.\n#Melodic improvisation: flamenco singing is not, strictly speaking, improvised, but based on a relatively small number of traditional songs, singers add variations on the spur of the moment.\n\nMusicologist Hipólito Rossy adds the following characteristics (Rossy 1997: 97):\n\n*Flamenco melodies are characterized by a descending tendency, as opposed to, for example, a typical opera aria, they usually go from the higher pitches to the lower ones, and from forte to piano, as was usual in ancient Greek scales.\n*In many styles, such as soleá or siguiriya, the melody tends to proceed in contiguous degrees of the scale. Skips of a third or a fourth are rarer. However, in fandangos and fandango-derived styles, fourths and sixths can often be found, especially at the beginning of each line of verse. According to Rossy, this is proof of the more recent creation of this type of songs, influenced by Castilian jota.\n\nCompás \n\nCompás is the Spanish word for metre or time signature (in classical music theory). It also refers to the rhythmic cycle, or layout, of a palo.\n\nThe compás is fundamental to flamenco. Compás is most often translated as rhythm but it demands far more precise interpretation than any other Western style of music. If there is no guitarist available, the compás is rendered through hand clapping (palmas) or by hitting a table with the knuckles. The guitarist uses techniques like strumming (rasgueado) or tapping the soundboard (golpe). Changes of chords emphasize the most important downbeats.\n\nFlamenco uses three basic counts or measures: Binary, Ternary and a form of a twelve-beat cycle that is unique to flamenco. There are also free-form styles including, among others, the tonás, saetas, malagueñas, tarantos, and some types of fandangos.\n\n*Rhythms in  or . These metres are used in forms like tangos, tientos, gypsy rumba, zambra and tanguillos.\n*Rhythms in . These are typical of fandangos and sevillanas, suggesting their origin as non-Roma styles, since the  and  measures are not common in ethnic Roma music.\n*12-beat rhythms usually rendered in amalgams of  +  and sometimes . The 12-beat cycle is the most common in flamenco, differentiated by the accentuation of the beats in different palos. The accents do not correspond to the classic concept of the downbeat. The alternating of groups of 2 and 3 beats is also common in Spanish folk dances of the 16th Century such as the zarabanda, jácara and canarios.\n\nThere are three types of 12-beat rhythms, which vary in their layouts, or use of accentuations: soleá, seguiriya and bulería.\n\n#peteneras and guajiras: 1 2 3 4 5 6 7 8 9 10 11 12. Both palos start with the strong accent on 12. Hence the meter is  12 1 2 3 4 5 6 7 8 9 10 11...\n#The seguiriya, liviana, serrana, toná liviana, cabales: 121 2 3 4 5 6 7 8 9 10 11 12.\n#soleá, within the cantiñas group of palos which includes the alegrías, cantiñas, mirabras, romera, caracoles and soleá por bulería (also \"bulería por soleá\"): 1 2 3 4 5 6 7 8 9 10 11 12. For practical reasons, when transferring flamenco guitar music to sheet music, this rhythm is written as a regular .\n\nThe Bulerías is the emblematic palo of flamenco: today its 12-beat cycle is most often played with accents on the 3rd, 6th, 8th, 10th and 12th beats. The accompanying palmas are played in groups of 6 beats, giving rise to a multitude of counter-rhythms and percussive voices within the 12 beat compás.\n\nForms of flamenco expression \n\nToque (guitar) \n\nThe origins, history and importance of the flamenco guitar is covered in the main Wikipedia entry for the Flamenco guitar\n\nCante (song) \n\nThe origins, history and importance of the cante is covered in the main Wikipedia entry for the cante flamenco.\n\nBaile (dance) \n\nEl baile flamenco is known for its emotional intensity, proud carriage, expressive use of the arms and rhythmic stamping of the feet (often confused with tap dance or Irish dance but with a completely different technique). As with any dance form, many different styles of flamenco have developed.\n\nIn the twentieth century, flamenco danced informally at gitano (Roma) celebrations in Spain was considered the most \"authentic\" form of flamenco. There is less virtuoso technique in gitano flamenco, but the music and steps are fundamentally the same. The arms are noticeably different from classical flamenco, curving around the head and body rather than extending, often with a bent elbow.\n\n\"Flamenco puro\" is considered the form of performance flamenco closest to its gitano influences. In this style, the dance is always performed solo, and is improvised rather than choreographed. Some purists frown on castanets (even though they can be seen in many early 20th century photos of flamenco dancers).\n\n\"Classical flamenco\" is the style most frequently performed by Spanish flamenco dance companies, tending to exhibit more clearly the characteristics derived from the Seguidilla, a traditional Spanish dance. It is danced largely in a proud and upright way. For women, the back is often held in a marked back bend. Unlike the more gitano influenced styles, there is little movement of the hips, the body is tightly held and the arms are long, like a ballet dancer. In fact many of the dancers in these companies have trained in ballet as well as flamenco. Flamenco has both influenced and been influenced by ballet, as evidenced by the fusion of the two created by 'La Argentinita' in the early part of the twentieth century and later, by Joaquín Cortés.\n\nIn the 1950s Jose Greco was one of the most famous male Flamenco dancers, performing on stage worldwide and on television including the Ed Sullivan Show, and reviving the art almost singlehandedly.\n\nModern flamenco is a highly technical dance style requiring years of study. The emphasis for both male and female performers is on lightning-fast footwork performed with absolute precision. In addition, the dancer may have to dance while using props such as castanets, shawls and fans.\n\n\"Flamenco nuevo\" is a recent style in flamenco, characterized by pared-down costumes (the men often dance bare-chested, and the women in plain jersey dresses). Props such as castanets, fans and shawls are rarely used. Dances are choreographed and include influences from other dance styles.\n\nThe flamenco most foreigners are familiar with is a style that was developed as a spectacle for tourists. To add variety, group dances are included and even solos are more likely to be choreographed. The frilly, voluminous spotted dresses are derived from a style of dress worn for the Sevillanas at the annual Feria in Seville.\n\nIn traditional flamenco, young people are not considered to have the emotional maturity to adequately convey the duende (soul) of the genre. Therefore, unlike other dance forms, where dancers turn professional early to take advantage of youth and strength, many flamenco dancers do not hit their peak until their thirties and will continue to perform into their fifties and beyond.\n\nFile:Castelucho.jpg|Claudio Castelucho, Flamenco\nFile:Theatre Flamenco Work Sample.webm|Theatre Flamenco Work Sample\nFile:Baile andaluz 1893 José Villegas Cordero.jpg|José Villegas Cordero, Baile Andaluz\nFile:Sargent John Singer Spanish Dancer.jpg|John Singer Sargent, Spanish Dancer\nFlamenco_Dancer_Doll.jpg|A doll depicts a dancer with the traditional costume\n\n;Scenes of flamenco performance in Seville.\n\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 07.JPG\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 11.JPG\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 19.JPG\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 20.JPG\nFlamenco en el Palacio Andaluz, Sevilla, España, 2015-12-06, DD 23.JPG. Flamenco. http://en.wikipedia.org/?curid=11558."
  }
}
