{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16278",
  "eid" : "253644d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778571677,
  "textBody" : "James Randi (born Randall James Hamilton Zwinge; August 7, 1928) is a Canadian-American retired stage magician and a scientific skeptic who has extensively challenged paranormal and pseudoscientific claims.Rodrigues 2010, [https://books.google.com/books?idOsGuZjYzXdAC&pg\nPA271 p. 271] Randi is the co-founder of the Committee for Skeptical Inquiry (CSI), originally known as the Committee for the Scientific Investigation of Claims of the Paranormal (CSICOP). He is also the founder of the James Randi Educational Foundation (JREF). He began his career as a magician under the stage name The Amazing Randi and later chose to devote most of his time to investigating paranormal, occult, and supernatural claims, which he collectively calls \"woo-woo\". Randi retired from practicing magic at age 60, and from the JREF at 87.\n\nAlthough often referred to as a \"debunker\", Randi has said he dislikes the term's connotations and prefers to describe himself as an \"investigator\". He has written about paranormal phenomena, skepticism, and the history of magic. He was a frequent guest on The Tonight Show Starring Johnny Carson, famously exposing fraudulent faith healer Peter Popoff, and was occasionally featured on the television program Penn & Teller: Bullshit!\n\nPrior to Randi's retirement, JREF sponsored the One Million Dollar Paranormal Challenge, which offered a prize of one million dollars US to eligible applicants who could demonstrate evidence of any paranormal, supernatural, or occult power or event under test conditions agreed to by both parties. The paranormal challenge was officially terminated by the JREF in 2015.http://web.randi.org/the-million-dollar-challenge.html James Randi Educational Foundation The foundation continues to make grants to non-profit groups that encourage critical thinking, and a fact-based world view.\n\nEarly life\n\nRandi was born on August 7, 1928 in Toronto, Ontario, Canada,Moritz 1987, p. 455 the son of Marie Alice (née Paradis) and George Randall Zwinge. He has a younger brother and sister. He took up magic after seeing Harry Blackstone Sr. and reading conjuring books while spending 13 months in a body cast following a bicycle accident. He confounded doctors who expected he would never walk again. Randi often skipped classes and, at 17, dropped out of high school to perform as a conjurer in a carnival roadshow. He practised as a mentalist in local nightclubs and at Toronto's Canadian National Exhibition and wrote for Montreal's tabloid press.Colombo 2004, [https://books.google.com/books?idOXP_OpQna4gC&pg\nPA182 p. 182]\n\nIn his twenties, Randi posed as an astrologer and, to establish that they were actually doing simple tricks, he briefly wrote an astrological column in the Canadian tabloid Midnight under the name \"Zo-ran\" by simply shuffling up items from newspaper astrology columns and pasting them randomly into a column.Randi 1982c, pp. 230–231. Randi reprints two newspaper columns from the Toronto Evening Telegram of August 28, 1950, and August 14, 1950, by Wessely Hicks about Randall Zwinge's psychic predictions. The earlier column states that \"Mr. Zwinge said he first became aware that he possessed Extra Sensory Perception when he was nine years old.\"Randi 1982a, pp. 61–62 In his thirties, Randi worked in the UK, Europe, Philippine nightclubs, and all across Japan. He witnessed many tricks that were presented as being supernatural. One of his earliest reported experiences is that of seeing an evangelist using a version of the \"one-ahead\" technique to convince churchgoers of his divine powers.\n\nCareer\n\nMagician\n\nThough defining himself as a conjuror, Randi began a career as a professional stage magician Randi explained in a February 2007 presentation that he believes the word \"magician\" implies one who has actual magical abilities, whereas a conjurer is one who uses skills to merely play the part of one. and escapologist in 1946. Initially, he presented himself under his real name, Randall Zwinge, which he later dropped in favor of \"The Amazing Randi\". Early in his career, he performed numerous escape acts from jail cells and safes around the world. On February 7, 1956, he appeared live on NBC's Today show, where he remained for 104 minutes in a sealed metal coffin that had been submerged in a hotel swimming pool, breaking what was said to be Harry Houdini's record of 93 minutes, though Randi calls attention to the fact that he was very much younger than Houdini when the original record was established, in 1926.\n\nRandi was a frequent guest on the Long John Nebel program on New York radio station WOR, and did character voices for commercials. After Nebel went to WNBC in 1962, Randi was given the time slot, and from 1967 to '68 hosted The Amazing Randi Show.  This show often had guests who defended paranormal claims, among them Randi's then-friend James W. Moseley. Randi says he quit WOR over complaints (disputed by Randi) from the archbishop of NY, that Randi had said on-air that “Jesus Christ was a religious nut.”\n\nRandi also hosted numerous television specials and went on several world tours. As \"The Amazing Randi\" he appeared regularly on the New York-based children's television series Wonderama from 1959 to 1967. He also auditioned for a revival of the 1950s children's show The Magic Clown in 1970, which showed briefly in Detroit and in Kenya, but was never picked up. In the February 2, 1974, issue of the British conjuring magazine Abracadabra, Randi, defining the community of magicians, stated: \"I know of no calling which depends so much upon mutual trust and faith as does ours.\" In the December 2003 issue of The Linking Ring, the monthly publication of the International Brotherhood of Magicians, it is stated: \"Perhaps Randi's ethics are what make him Amazing\" and \"The Amazing Randi not only talks the talk, he walks the walk.\"\n\nDuring Alice Cooper's 1973–1974 Billion Dollar Babies tour, Randi performed on stage both as a mad dentist and as Alice's executioner. He also built several of the stage props, including the guillotine. Shortly after that, in a 1976 performance for the Canadian TV special World of Wizards, Randi escaped from a straitjacket while suspended upside-down over Niagara Falls.\n\nRandi has been accused of actually using \"psychic powers\" to perform acts such as spoon bending. According to James Alcock, at a meeting where Randi was duplicating the performances of Uri Geller, a professor from the University at Buffalo shouted out that Randi was a fraud. Randi said: \"Yes, indeed, I'm a trickster, I'm a cheat, I'm a charlatan, that's what I do for a living. Everything I've done here was by trickery.\" The professor shouted back: \"That's not what I mean. You're a fraud because you're pretending to do these things through trickery, but you're actually using psychic powers and misleading us by not admitting it.\"Alcock 2001, p. 42 A similar event involved Senator Claiborne Pell, a confirmed believer in psychic phenomena. When Randi personally demonstrated to Pell that he could reveal—by simple trickery—a concealed drawing that had been secretly made by the senator, Pell refused to believe that it was a trick, saying: \"I think Randi may be a psychic and doesn't realize it.\" Randi has consistently denied having any paranormal powers or abilities.Gardner 2000, p. 178\n\nRandi is a member of the Society of American Magicians (SAM), the International Brotherhood of Magicians (IBM), and The Magic Circle in the UK, holding the rank of \"Member of the Inner Magic Circle with Gold Star.\"\n\nRandi said the hardest people to fool are not the highly educated, but children, because they are not sophisticated enough to be fooled, as they have not learned the body cues that adults have learned and which magicians take advantage.\n\nAuthor\n\nRandi is the author of ten books, among them Conjuring (1992), a biographical history of noted magicians. The book is subtitled Being a Definitive History of the Venerable Arts of Sorcery, Prestidigitation, Wizardry, Deception, & Chicanery and of the Mountebanks & Scoundrels Who have Perpetrated these Subterfuges on a Bewildered Public, in short, MAGIC! The book's cover says that it is by \"James Randi, Esq., A Contrite Rascal Once Dedicated to these Wicked Practices but Now Almost Totally Reformed\". The book selects the most influential magicians and tells some of their history, often in the context of strange deaths and careers on the road. This work expanded on Randi's second book titled Houdini, His Life and Art. This illustrated work was published in 1976 and was co-authored with Bert Sugar. It focuses on the professional and private life of Houdini.Burt 2001, p. 192\n\nRandi also wrote a children's book in 1989 titled The Magic World of the Amazing Randi, which introduced children to magic tricks. In addition to his magic books, he has written several educational works about paranormal and pseudoscientific claims. These include biographies of Uri Geller and Nostradamus as well as reference material on other major paranormal figures. He is currently working on A Magician in the Laboratory, which recounts his application of skepticism to science. He was a member of the all-male literary banqueting club the Trap Door Spiders, which served as the basis of his good friend Isaac Asimov's fictional group of mystery solvers, the Black Widowers.Asimov 1994\n\nOther books are Flim-Flam! (1982), The Faith Healers (1987), James Randi, Psychic Investigator (1991), Test Your ESP Potential (1982) and An Encyclopedia of Claims, Frauds, and Hoaxes of the Occult and Supernatural (1995).\n\nRandi was a regular contributor to Skeptic magazine, penning the \"'Twas Brillig...\" column, and also served on its editorial board. He is also a frequent contributor to Skeptical Inquirer magazine, which is published by CSI, of which he is also a Fellow.\n\nSkeptic\n\nRandi gained the international spotlight in 1972 when he publicly challenged the claims of Uri Geller. He accused Geller of being nothing more than a charlatan and a fraud who used standard magic tricks to accomplish his allegedly paranormal feats, and he presented his claims in the book The Truth About Uri Geller (1982).\n\nBelieving that it was important to get columnists and TV personalities to challenge Geller and others like him, Randi and CSICOP reached out in an attempt to educate them. Randi said that CSICOP had a \"very substantial influence on the printed media... in those days.\"  During this effort, Randi made contact with Johnny Carson and discovered that he was \"very much on our side. He wasn't only a comedian... he was a great thinker.\" According to Randi, when he was on The Tonight Show, Carson broke his usual protocol of not talking with guests prior to their entrance on stage, but instead would ask what Randi wanted to be emphasized in the interview. \"He wanted to be aware of how he could help me.\"\n\nIn 1973, Geller appeared on The Tonight Show, and this appearance is recounted in the Nova documentary \"James Randi - Secrets of the Psychics\".\n\nIn the documentary, Randi says that Carson \"had been a magician himself and was skeptical\" of Geller's claimed paranormal powers, so prior to the date of taping, Randi was asked \"to help prevent any trickery\". Per Randi's advice, the show prepared its own props without informing Geller, and did not let Geller or his staff \"anywhere near them\". When Geller joined Carson on stage, he appeared surprised that he was not going to be interviewed, but instead was expected to display his abilities using the provided articles. Geller said \"This scares me\" and \"I'm surprised because before this program your producer came and he read me at least 40 questions you were going to ask me.\" Geller was unable to display any paranormal abilities, saying \"I don't feel strong\" and expressing his displeasure at feeling like he was being \"pressed\" to perform by Carson.  According to Adam Higginbotham's Nov. 7, 2014 article in the New York Times: \n\nHowever, this appearance on The Tonight Show, which Carson and Randi had orchestrated to debunk Geller's claimed abilities, backfired. According to Higginbotham,\n\nAccording to Higginbotham, this result caused Randi to realize that much more must be done to stop Geller and those like him. So in 1976, Randi approached Ray Hyman, a psychologist who had observed the tests of Geller's ability at Stanford and thought them slipshod, and suggested they create an organization dedicated to combating pseudoscience. In 1976, together with Martin Gardner, a Scientific American columnist whose writing had helped hone Hyman's and Randi's skepticism, they formed the Committee for Scientific Investigation of Claims of the Paranormal (CSICOP).\n\nUsing donations and sales of their magazine, Skeptical Inquirer, they and secular humanist philosopher Paul Kurtz took seats on the executive board, with Isaac Asimov and Carl Sagan joining as founding members. Randi traveled the world on behalf of CSICOP, becoming its public face, and according to Hyman, the face of the skeptical movement.Higginbotham, Adam (November 7, 2014). [https://www.nytimes.com/2014/11/09/magazine/the-unbelievable-skepticism-of-the-amazing-randi.html?_r\n0 \"The Unbelievable Skepticism of the Amazing Randi\"]. The New York Times.\n\nAndrás G. Pintér, producer and co-host of the European Skeptics Podcast called Randi the grandfather of European skepticism by virtue of Randi \"playing a role in kickstarting several European organizations.\"\n\nGeller sued Randi and CSICOP for $15 million in 1991 and lost. Geller's suit against CSICOP was thrown out in 1995, and he was ordered to pay $120,000 for filing a frivolous lawsuit. The legal costs Randi incurred used almost all of a $272,000 MacArthur Foundation grant awarded to Randi in 1986 for his work. Randi also dismissed Geller's claims that he was capable of the kind of psychic photography made famous by the case of Ted Serios. It is a matter, Randi argues, of trick photography using a simple hand-held optical device.Carroll 2003, [https://books.google.com/books?id\n6FPqDFx40vYC&pgPA313 p. 313] During the period of Geller's legal dispute, CSICOP's leadership, wanting to avoid becoming a target of Geller's litigation, demanded that Randi refrain from commenting on Geller. Randi refused and resigned, though he has maintained a respectful relationship with the group, which in 2006 changed its name to the Committee for Skeptical Inquiry (CSI). In 2010, Randi was one of 16 new CSI fellows elected by its board.\n\nRandi has gone on to write many articles criticizing beliefs and claims regarding the paranormal. He has also demonstrated flaws in studies suggesting the existence of paranormal phenomena; in his Project Alpha hoax, Randi successfully planted two fake psychics in a privately funded psychic research experiment. The hoax became a scandal and demonstrated the shortcomings of many paranormal research projects at the university level.\n\nRandi has appeared on numerous TV shows, sometimes to directly debunk the claimed abilities of fellow guests. In a 1981 appearance on That's My Line, Randi appeared opposite claimed psychic James Hydrick, who said that he could move objects with his mind and appeared to demonstrate this claim on live television by turning a page in a telephone book without touching it. Randi, having determined that Hydrick was surreptitiously blowing on the book, arranged foam packaging peanuts on the table in front of the telephone book for the demonstration. This prevented Hydrick from demonstrating his abilities, which would have been exposed when the blowing moved the packaging. Randi writes that, eventually, Hydrick \"confessed everything\".\n\nRandi was awarded a MacArthur Foundation Fellowship in 1986. The fellowship's five-year $272,000 grant helped support Randi's investigations of faith healers, including W. V. Grant, Ernest Angley, and Peter Popoff, whom Randi first exposed on The Tonight Show Starring Johnny Carson in February 1986. Hearing about his investigation of Popoff, Carson invited Randi onto his show without seeing the evidence he was going to reveal. Carson appeared stunned after Randi showed a brief video segment from one of Popoff's broadcasts showing him calling out a woman in the audience, revealed personal information about her that he claimed came from God, and then performed a laying-on-of-hands healing to drive the devil from her body. Randi then replayed the video, but with some of the sound dubbed in that he and his investigating team captured during the event using a radio scanner and recorder. Their scanner had detected the radio frequency Popoff's wife Elizabeth was using backstage to broadcast directions and information to a miniature radio receiver hidden in Popoff's left ear. That information had been gathered by Popoff's assistants, who had handed out \"prayer cards\" to the audience before the show, instructing them to write down all the information Popoff would need to pray for them.Randi 1987, pp. 139–181\n\nThe news coverage generated by Randi's exposé on The Tonight Show led to many TV stations dropping Popoff's show, eventually forcing him into bankruptcy in September 1987. However, the televangelist returned soon after with faith-healing infomercials that reportedly attracted more than $23 million in 2005 from viewers sending in money for promised healing and prosperity. The Canadian Centre for Inquiry's Think Again! TV documented one of Popoff's more recent performances before a large audience who gathered in Toronto on May 26, 2011, hoping to be saved from illness and poverty.\n\nIn February 1988, Randi tested the gullibility of the media by perpetrating a hoax of his own. By teaming up with Australia's 60 Minutes program and by releasing a fake press package, he built up publicity for a \"spirit channeler\" named Carlos who was actually artist Jose Alvarez, a.k.a. Deyvi Peña, whom Randi described as a \"friend\". Randi would tell him what to say through sophisticated radio equipment. According to the 60 Minutes program on the Carlos hoax, \"it was claimed that Alvarez would not have had the audience he did at the Opera House (and the potential sales therefrom) had the media coverage been more aggressive (and factual)\", though an analysis by The Skeptics Tim Mendham concluded that, while the media coverage of Alvarez's appearances was not credulous, \"it [the hoax] at least showed that they could benefit by being a touch more sceptical\". The hoax was exposed on 60 Minutes Australia; \"Carlos\" and Randi explained how they had pulled it off.\n\nIn his book The Faith Healers, Randi wrote that his anger and relentlessness arose from compassion for the victims of fraud. Randi has also been critical of João de Deus (John of God), a self-proclaimed psychic surgeon who has received international attention. Randi observed, referring to psychic surgery, \"To any experienced conjurer, the methods by which these seeming miracles are produced are very obvious.\"Randi 1995, [http://www.randi.org/encyclopedia/psychic%20surgery.html \"psychic surgery\"]\n\nIn 1982, Randi verified the abilities of Arthur Lintgen, a Philadelphia doctor, who was able to identify the classical music recorded on a vinyl LP solely by examining the grooves on the record. However, Lintgen did not claim to have any paranormal ability, merely knowledge of the way that the groove forms patterns on particular recordings.\n\nIn 1988, John Maddox, editor of the prominent science journal Nature, asked Randi to join the supervision and observation of the homeopathy experiments conducted by Jacques Benveniste's team. Once Randi's stricter protocol for the experiment was in place, the positive results could not be reproduced.\n\nJames Randi stated that Daniel Dunglas Home, who could allegedly play an accordion that was locked in a cage without touching it, was caught cheating on a few occasions, but the incidents were never made public. He also stated that the actual instrument in use was a one-octave mouth organ concealed under Home's large moustache and that other one-octave mouth organs were found in Home's belongings after his death.Randi 1995, [http://www.randi.org/encyclopedia/Home,%20Daniel%20Dunglas.html \"Home, Daniel Dunglas\"] According to Randi, author William Lindsay Gresham told Randi \"around 1960\" that he had seen these mouth organs in the Home collection at the Society for Psychical Research (SPR). Eric J. Dingwall, who catalogued Home's collection on its arrival at the SPR does not record the presence of the mouth organs. According to Peter Lamont, the author of an extensive Home biography, \"It is unlikely Dingwall would have missed these or did not make them public.\"Lamont 2005, p. 302\n\nRandi distinguishes between pseudoscience and crackpot science. He regards most of parapsychology as pseudoscience because of the way in which it is approached and conducted, but nonetheless sees it as a legitimate subject that \"should be pursued\", and from which real scientific discoveries may develop.Randi 1997, [https://books.google.com/books?id\n_mo4AAAAIAAJ&pg=PA170 p. 170] Randi regards crackpot science as \"equally wrong\" as pseudoscience, but with no scientific pretensions.\n\nSkeptics and magicians Penn & Teller credit Randi and his career as a skeptic for their own careers. During an interview at TAM! 2012, Penn stated that Flim-Flam! was an early influence on him, and said \"If not for Randi there would not be Penn & Teller as we are today.\" He went on to say \"Outside of my family... no one is more important in my life. Randi is everything to me.\"\n\nExploring Psychic Powers... Live television show\n\nExploring Psychic Powers... Live was a television show aired live on June 7, 1989, wherein Randi examined several people claiming psychic powers. The show offered $100,000 (Randi's then $10,000 prize plus $90,000 put up by the show's syndicator, LBS Communications, Inc.) to anyone who could demonstrate genuine psychic powers.\n\n* An astrologer claimed that he was able to ascertain a person's astrological sign after talking with them for a few minutes. He was presented with twelve people, one at a time, each with a different astrological sign. They could not tell the astrologer their astrological sign or birth date, nor could they wear anything that would indicate it. After the astrologer talked to them, he had them go and sit in front of the astrological sign that the astrologer thought was theirs. By agreement, the astrologer needed to get ten of the 12 correct, to win. He got none correct.\n* The next psychic claimed to be able to read auras around people. He claimed that auras were visible at least five inches above each of them. He selected ten people who he said had clearly visible auras. They were to stand behind screens and he claimed that their auras would be visible above the screens, which were numbered 1 through 10, and the subjects were told by the astrologer behind which screen to stand. He was to tell whether or not a person was standing behind each screen, by seeing their aura above. Since random guessing would be expected to get about five correct, the psychic needed to get eight of the ten right. The psychic stated that he saw an aura over all ten screens, but people were behind only four of the screens.\n* A dowser claimed that he could detect water, even in a bottle inside a sealed cardboard box. He was shown twenty boxes and he was asked to indicate which boxes contained a water bottle. He selected eight of the boxes which he said contained water. Actually, only five of the twenty contained water. Of the eight selected boxes, only one was revealed to contain water and one contained sand. It was not revealed whether any of the remaining six boxes contained water.\n* A psychometric psychic claimed to be able to receive personal information about the owner of an object by handling the object itself. In order to avoid ambiguous statements, the psychic agreed to be presented with both a watch and a key from each of twelve different people. She was to match keys and watches to each owner. According to the prior agreement, she had to match at least nine out of the twelve sets, but she succeeded in only two.\n* During the program, another psychic was doing a sorting of 250 Zener cards, guessing which of the five symbols was on each one. Random guessing should have resulted in about fifty correct guesses, so it was agreed in advance that the psychic had to be right on at least eighty-two cards in order to demonstrate an ability greater than chance. However, she was able to get only fifty predictions correct, which is no better than random guessing.Polidoro 2003, pp. 19–24\n\nJames Randi Educational Foundation (JREF)\n\nIn 1996, Randi established the James Randi Educational Foundation. Randi and his colleagues publish in JREF's blog,  [http://web.randi.org/swift Swift]. Topics have included the interesting mathematics of the one-seventh area triangle, a classic geometric puzzle. In his weekly commentary, Randi often gives examples of what he considers the nonsense that he deals with every day.\n\nBeginning in 2003, the JREF annually hosted The Amaz!ng Meeting, a gathering of scientists, skeptics, and atheists. The last meeting was in 2015, coinciding with Randi's retirement from the JREF.\n\n2010s\n\nJames Randi began a series of conferences known as \"The Amazing Meeting\" - TAM - which quickly became the largest gathering of skeptics in the world, drawing audiences from Asia, Europe, South America, and the UK. It also attracted large percentage of younger folks.\nRandi has been regularly featured on many podcasts, including The Skeptics Society's official podcast Skepticality and the Center for Inquiry's official podcast Point of Inquiry. From September 2006 onwards, he has occasionally contributed to The Skeptics' Guide to the Universe podcast with a column titled \"Randi Speaks.\" In addition, The Amazing Show is a podcast in which Randi shares various anecdotes in an interview format.\n\nIn 2014 Part2Filmworks released An Honest Liar, a feature film documentary, written by Tyler Measom and Greg O'Toole, and directed and produced by Measom and Justin Weinstein.[https://www.yahoo.com/movies/film/an-honest-liar \"An Honest Liar\"]. Yahoo! Movies. Retrieved September 5, 2014. The film, which was funded through Kickstarter,[https://www.kickstarter.com/projects/220588101/an-honest-liar-the-amazing-randi-story \"An Honest Liar: The Amazing Randi Story\"]. Kickstarter. Retrieved September 5, 2014. focuses on Randi's life, his investigations, and his relationship with longtime partner José Alvarez, a.k.a. Deyvi Peña. The film was screened at the Tribeca Film Festival,Barsanti, Chris (April 25, 2014). [http://www.popmatters.com/review/181139-tribeca-film-festival-2014-an-honest-liar-in-order-of-disappearance/ \"Tribeca Film Festival 2014: ‘'An Honest Liar' + 'In Order of Disappearance'\"]. PopMatters. at Toronto's Hot Docs film festival,Teplitsky, Ariel (May 1, 2014). [https://www.thestar.com/entertainment/movies/2014/05/01/worth_a_look_an_honest_liar.html \"Worth a look: An Honest Liar\"]. Toronto Star. and at the June 2014 AFI Docs Festival in Silver Spring, Maryland and Washington, D.C., where it won the Audience Award for Best Feature. It has since been captioned in ten different languages, shown worldwide, and was also positively received by critics.Rooney, David (June 30, 2014). [http://www.hollywoodreporter.com/review/an-honest-liar-provincetown-review-715950 \"'An Honest Liar': Provincetown Review\"]. The Hollywood Reporter.[http://www.rottentomatoes.com/m/an_honest_liar/ \"An Honest Liar (2014)\"]. Rotten Tomatoes. Retrieved September 5, 2014. The film was featured on the PBS Independent Lens series, shown in the U.S. and Canada, on March 28, 2016.[https://www.thestar.com/entertainment/television/2016/03/28/torontos-james-the-amazing-randi-profiled-in-an-honest-liar.html Toronto's James (The Amazing) Randi profiled in An Honest Liar.], Toronto Star, Bill Brioux, March 28, 2016. Retirieved 29 March 2016.\n\nIn 2017, he appeared in animated form on [http://www.holykoolaid.com Holy Koolaid], in which he discussed the challenge of finding the balance between connecting sincerely with his audience and at the same time tricking/fooling them with an artful ruse and indicated that this is a balance many magicians struggle with.\n\nViews on religion\n\nRandi's parents were members of the Anglican Church but rarely attended services. He attended Sunday School at [https://stcuthbertsleaside.com/ St. Cuthbert's Church] in Toronto a few times as a child, but he independently decided to stop going when he was not answered when he asked for proof of the teachings of the Church.\n\nIn his essay \"Why I Deny Religion, How Silly and Fantastic It Is, and Why I'm a Dedicated and Vociferous Bright,\" Randi, who identifies himself as an atheist, has opined that many accounts in religious texts, including the virgin birth, the miracles of Jesus Christ, and the parting of the Red Sea by Moses, are not believable. For example, Randi refers to the Virgin Mary as being \"impregnated by a ghost of some sort, and as a result produced a son who could walk on water, raise the dead, turn water into wine, and multiply loaves of bread and fishes\" and questions how Adam and Eve \"could have two sons, one of whom killed the other, and yet managed to populate the Earth without committing incest.\" He writes that, compared to the Bible, \"The Wizard of Oz is more believable. And much more fun.\"\n\nClarifying his view of atheism, Randi has written \"I’ve said it before: there are two sorts of atheists. One sort claims that there is no deity, the other claims that there is no evidence that proves the existence of a deity; I belong to the latter group, because if I were to claim that no god exists, I would have to produce evidence to establish that claim, and I cannot. Religious persons have by far the easier position; they say they believe in a deity because that’s their preference, and they’ve read it in a book. That’s their right.\"\n\nIn An Encyclopedia of Claims, Frauds, and Hoaxes of the Occult and Supernatural (1995), he examines various spiritual practices skeptically. Of the meditation techniques of Guru Maharaj Ji, he writes \"Only the very naive were convinced that they had been let in on some sort of celestial secret.\"Randi 1995, [http://www.randi.org/encyclopedia/Maharaj%20Ji.html \"Maharaj Ji\"] In 2003, he was one of the signers of the Humanist Manifesto.\n\nIn a discussion with Kendrick Frazier at CSICon 2016, Randi stated “I think that a belief in a deity is ... an unprovable claim ... and a rather ridiculous claim. It is an easy way out to explain things to which we have no answer.” He then summarized his current concern with religious belief as follows:\n\nOne Million Dollar Paranormal Challenge\n\nThe James Randi Educational Foundation (JREF) offered a prize of US$1,000,000 to anyone able to demonstrate a supernatural ability under scientific testing criteria agreed to by both sides. Based on the paranormal challenges of John Nevil Maskelyne and Houdini, the foundation began in 1996, when Randi put up $1,000 of his own money payable to anyone who could provide objective proof of the paranormal. The prize money grew to $1,000,000, and had formal published rules. No one progressed past the preliminary test, which was set up with parameters agreed to by both Randi and the applicant. He refused to accept any challengers who might suffer serious injury or death as a result of the testing.\n\nOn April 1, 2007, it was ruled that only persons with an established, nationally recognized media profile and the backing of a reputable academic were allowed to apply for the challenge, in order to avoid wasting JREF resources on frivolous claimants.\n\nOn Larry King Live, March 6, 2001, Larry King asked Sylvia Browne if she would take the challenge and she agreed. Randi appeared with Browne on Larry King Live six months later, and she again appeared to accept his challenge. However, according to Randi, she ultimately refused to be tested, and the Randi Foundation kept a clock on its website recording the number of weeks since Browne allegedly accepted the challenge without following through, until Browne's death in November 2013.\n\nDuring another appearance on Larry King Live on June 5, 2001, Randi challenged Rosemary Altea to undergo testing for the million dollars, but Altea refused to address the question. Instead Altea replied only, \"I agree with what he says, that there are many, many people who claim to be spiritual mediums, they claim to talk to the dead. There are many people, we all know this. There are cheats and charlatans everywhere.\" On January 26, 2007, Altea and Randi again appeared on the show, and Altea again refused to answer whether or not she would take the One Million Dollar Paranormal Challenge.\n\nIn October 2007, claimed psychic John Edward appeared on Headline Prime, hosted by Glenn Beck. When asked if he would take Randi's challenge, Edward responded, \"It's funny. I was on Larry King Live once, and they asked me the same question. And I made a joke [then], and I'll say the same thing here: Why would I allow myself to be tested by somebody who's got an adjective as a first name?\" Beck simply allowed Edward to continue, ignoring the challenge.\n\nRandi asked British businessman Jim McCormick, the inventor of the bogus ADE 651 bomb detector, to take the challenge in October 2008. Randi called the ADE 651 \"a useless quack device which cannot perform any other function than separating naive persons from their money. It's a fake, a scam, a swindle, and a blatant fraud. Prove me wrong and take the million dollars.\" There was no response from McCormick. According to Iraqi investigators, the ADE 651, which was corruptly sold to the Baghdad bomb squad, was responsible for the deaths of hundreds of civilians who died as a result of terrorist bombs which were not detected at checkpoints. On April 23, 2013, McCormick was convicted of three counts of fraud at the Old Bailey in London; he was subsequently sentenced to ten years' imprisonment for his part in the ADE 651 scandal, which Randi was the first to expose.\n\nA public log of past participants in the Million Dollar Challenge exists.\nIn 2015, the James Randi paranormal challenge was officially terminated.\n\nLegal disputes\n\nRandi has been involved in a variety of legal disputes but says that he has \"never paid even one dollar or even one cent to anyone who ever sued me.\" However, he says, he has paid out large sums to personally defend himself in these suits.\n\nUri Geller\n\nRandi met magician Uri Geller in the early 1970s, and found Geller to be “Very charming. Likable, beautiful, affectionate, genuine, forward-going, handsome — everything!” But Randi viewed Geller as a con-man, and began a long effort to expose him as a fraud. According to Randi, Geller tried to sue him several times, accusing him of libel. Geller never won, save for a ruling in a Japanese court that ordered Randi to pay Geller one third of one percent of what Geller had requested. This ruling was canceled, and the matter dropped, when Geller decided to concentrate on another legal matter.\n\nIn May 1991, Geller sued Randi and CSICOP for $15 million on a charge of slander, after Randi told the International Herald Tribune that Geller had \"tricked even reputable scientists\" with stunts that \"are the kind that used to be on the back of cereal boxes\", referring to the old spoon-bending trick. The court dismissed the case and Geller had to settle at a cost to him of $120,000, after Randi produced a cereal box which bore instructions on how to do the spoon-bending trick. Geller's lawyer Don Katz was disbarred mid-way into this action and Geller ended up suing him. After failing to pay before the deadline imposed by the court, Geller was sanctioned an additional $20,000.\n\nRandi commented that Uri Geller's public performances were of the same quality as those found on the backs of cereal boxes. Geller sued both Randi and CSICOP. CSICOP argued that the organization was not responsible for Randi's statements. The court agreed that including CSICOP was frivolous and dropped them from the action, leaving Randi to face the action alone, along with the legal costs. Geller was ordered to pay substantial damages, but only to CSICOP. The matter was subsequently settled out of court, and the details of the settlement have been kept confidential. The settlement also included an agreement that Geller would not pursue Randi for the award in the Japanese case or other outstanding cases.\n\nOther cases\n\nIn 1993, a jury in the U.S. District Court in Baltimore found Randi liable for defaming Eldon Byrd for calling him a child molester in a magazine story and a \"shopping market molester\" in a 1988 speech. However, the jury found that Byrd was not entitled to any monetary damages after hearing testimony that he had sexually molested and later married his sister-in-law. The jury also cleared the other defendant in the case, CSICOP.West, Norris. P. (June 5, 1993). [http://articles.baltimoresun.com/1993-06-05/news/1993156046_1_byrd-magician-molester \"Magician defamed scientist, jury rules\"]. The Baltimore Sun.\n\nLate in 1996, Randi launched a libel suit against a Toronto-area psychic named Earl Gordon Curley. Curley had made multiple objectionable comments about Randi on Usenet. Despite suggesting to Randi on Usenet that Randi should sue – Curley's comments implying that if Randi did not sue, then his allegations must be true – Curley seemed entirely surprised when Randi actually retained Toronto's largest law firm and initiated legal proceedings. The suit was eventually dropped in 1998 when Earl Curley died at the age of 51 of \"alcohol toxicity.\"\n\nAllison DuBois, on whose life the television series Medium was based, threatened Randi with legal action for using a photo of her from her website in his December 17, 2004, commentary without her permission. Randi removed the photo and subsequently used a caricature of DuBois when mentioning her on his site, beginning with his December 23, 2005, commentary.\n\nSniffex, producer of a dowsing bomb detection device, sued Randi and the JREF in 2007 and lost. Sniffex sued Randi for his comments regarding a government test in which the Sniffex device failed. The company was later investigated and charged with fraud.\n\nPersonal life\n\nWhen he hosted his own radio show in the 1960s, Randi lived in a small house in Rumson, New Jersey, that featured a sign on the premises that read: \"Randi — Charlatan\". In a Fort Lauderdale public library in 1986, Randi, who had recently moved to Florida, met Venezuelan artist Deyvi Orangel Peña Arteaga, who lived for many years under the assumed name José Alvarez, which is now his artist name. The two men eventually moved in together; they were married in Washington on July 2, 2013, with Randi turning 85 the next month;  today they live in Plantation, Florida.Sturgess, Kylie (March/April 2015). \"Behind the Magic: An Interview with James Randi\". Skeptical Inquirer Volume 39  Number 2, pp. 38–42.\n\nIn 1987, Randi became a naturalized citizen of the United States. Randi has said that one reason he became an American citizen was an incident while he was on tour with Alice Cooper where the Royal Canadian Mounted Police searched the band's lockers during a performance. Nothing illicit or illegal was found, yet the RCMP trashed the room.\n\nIn February 2006, Randi underwent coronary artery bypass surgery. In early February 2006, he was declared to be in stable condition and \"receiving excellent care\" with his recovery proceeding well. The weekly commentary updates to his Web site were made by guests while he was hospitalized. Randi recovered after his surgery and was able to help organize and attend the 2007 Amaz!ng Meeting (T.A.M.) in Las Vegas, Nevada, his annual convention of scientists, magicians, skeptics, atheists and freethinkers.\n\nRandi was given a diagnosis of colorectal cancer in June 2009. He had a series of small tumors removed from his intestines during laparoscopic surgery. He announced the diagnosis a week later at The Amaz!ng Meeting 7, as well as the fact that he was scheduled to begin chemotherapy in the following weeks. Lengthy article which reported: \"He has intestinal cancer and may not have long to live.\" He also said at the conference: \"One day, I'm gonna die. That's all there is to it. Hey, it's too bad, but I've got to make room. I'm using a lot of oxygen and such — I think it's good use of oxygen myself, but of course, I'm a little prejudiced on the matter.\"\n\nRandi underwent his final chemotherapy session on December 31, 2009, as he explained in a January 12, 2010, video in which he related that his chemotherapy experience was not as unpleasant as he had imagined it might be. In a video posted April 12, 2010, Randi stated that he has been given a clean bill of health.\n\nIn a March 21, 2010, blog entry, Randi came out as gay, a move he explained was inspired by seeing the 2008 biographical drama film Milk.\n\nRandi has never smoked, taken narcotics, or become inebriated, because, as he has explained, \"that can easily just fuzz the edges of my rationality, fuzz the edges of my reasoning powers, and I want to be as aware as I possibly can. That means giving up a lot of fantasies that might be comforting in some ways, but I'm willing to give that up in order to live in an actually real world.\"\n\nIn a video released on October 16, 2017, Randi revealed that he had recently suffered a minor stroke, and that he was under medical advice not to travel during his recovery, so would be unable to attend CSICon 2017 in Las Vegas later that month.\n\nPolitical views \n\nRandi is a registered Democrat. He wept when Barack Obama took office as President of the United States. He saw it as a large step forward for the United States to elect a black man and electing a woman would be another such step. \n\nComments on illegal drugs and Social Darwinism\n\nOn April 28, 2009, Randi stated on the James Randi Educational Foundation website that he wanted illegal drugs to be legalized so that users could kill themselves.\n\nIn the book The Heretics: Adventures with the Enemies of Science (2013), author Will Storr brought up Randi's comments on illegal drugs during an interview. In the interview, Randi stated that he thinks \"exactly the same thing about smoking\" and that smokers \"should be allowed to smoke themselves to death and die.\" Randi proceeded to call himself \"a believer in Social Darwinism.\" These comments evoked unrest in parts of the Skeptic community.\n\nOn 1 March 2013, the website [http://doubtfulnews.com/ DoubtfulNews.com] published a news story in which Randi claimed to have been misquoted:\nThe statement “I’m a believer in social Darwinism,” did not come from me. In fact, I had to look up the expression to learn what was being referred to. This attack appears to be calling me a Nazi, nothing less. I demand that Mr. Storr refer me to the original sources to which we assume he has referred. Until then, I’ll only say that he has carefully selected phrases and statements out of context, not the sort of referencing that I would have expected from him.\n\nOn 2 March 2013, Randi posted an elaborative comment on that same news story, maintaining that he would never have called himself a Social Darwinist, since he \"only recently learned in detail what that term really means\" and was \"quite ignorant of the history of the movement organized around that false idea.\" However, Randi accepted \"that the conversation with Mr. Storr went just as described\" and conceded that he \"sometimes speaks on things about which [he knows] very little\":\nI’m well aware that I sometimes “shoot from the hip” and speak on things about which I know very little. In this present situation, I published my personal opinions about drug addiction without knowing very much about the neuroscience behind addiction, or the addiction recovery field. Not only did I say some deeply regrettable and insensitive things, but as I’ve learned more about the questions and issues at hand, I accept that I have been wrongheaded on a number of topics related to these issues. Even at 84, I’m still learning. Please bear with me, folks.\n\nAwards and honors\n\nWorld records\n\nThe following are Guinness World Records:\n* Randi was in a sealed casket underwater for an hour and 44 minutes, which broke Harry Houdini's record of one hour and 33 minutes set on August 5, 1926.\n* Randi was encased in a block of ice for 55 minutes.\n\nBibliography\n\n* \n* \n* \n* \n* \n* \n* \n*  Companion book to the Open Media/Granada Television series.\n* \n*  ([http://web.randi.org/encyclopedia-of-claims.html Online version])\n* A Magician in the Laboratory (Forthcoming)\n* Wrong! (Forthcoming)\n\nTelevision and film\n\nActor\n\n* Good to See You Again, Alice Cooper (1974) as the Dentist/Executioner\n* Ragtime (1981) (stunt coordinator: Houdini)\n* Penn & Teller's Invisible Thread (1987) (TV)\n* Penn & Teller Get Killed (1989) as the 3rd Rope Holder\n* Beyond Desire (1994) as the Coroner\n\nHimself\n\n* Wonderama (1959–1967) (TV) as The Amazing Randi\n* I've Got a Secret (1965) (TV) as The Amazing Randi\n* Happy Days – \"The Magic Show\" (1978) as the Amazing Randi\n* Zembla, 'De trucs van Char' (The tricks Char uses). (March 2008)\n* ZDF German TV (2007)\n* Wild Wild Web (1999)\n* West 57th (1980s)\n* Welt der Wunder – Kraft der Gedanken (January 2008)\n* Today (many appearances)\n* The Don Lane Show (Australia)\n* That's My Line (1981) (Appeared with James Hydrick)\n* The View (ABC) multiple appearances 1997–present\n* The Tonight Show Starring Johnny Carson (32 appearances between 1973 and 1993 plus repeats)\n* The Secret Cabaret (produced by Open Media for Channel 4 in the UK)\n* The Power of Belief (October 6, 1998) (ABC News Special) (TV)\n* People are Talking (1980s)\n* The Patterson Show (1970s)\n* Superpowers? (an Equinox documentary made by Open Media for Channel 4 in 1990)[http://www.tcm.com/tcmdb/title/475347/Superpowers- TCM] and [http://www.ovguide.com/tv_episode/equinox-season-1990-episode-14-superpowers-4384747 Online Video Guide]. Retrieved April 15, 2015\n* After Dark (September 3, 1988, September 9, 1989)List of After Dark editions\n* Weird Thoughts, Open Media discussion hosted by Tony Wilson for BBC TV,  with Mary Beard and others, 1994[http://www.eofftv.com/w/wei/weird_thoughts_main.htm EOFF] . Retrieved April 15, 2015\n* The Art of Magic (1998) (TV)\n* The Ultimate Psychic Challenge (Discovery Channel/Channel 4) (2003)\n* Spotlight on James Randi (2002) (TV)\n* Secrets of the Super Psychics (Channel 4/The Learning Channel), produced by Open Media, 1997/8\n* Scams, Schemes, and Scoundrels (A&E Special) (March 30, 1997)\n* RAI TV Italy (1991)\n* Politically Incorrect with Bill Maher\n* Penn & Teller: Bullshit! several appearances\n** \"End of the World\" (2003) TV Episode\n** \"ESP\" (2003) TV Episode\n** \"Signs from Heaven\" (2005) TV Episode\n* The Oprah Winfrey Show 2 episodes\n* Lawrence Leung's Unbelievable (Australia) TV Episode\n* Nova: Secrets of the Psychics (1993)\n* Mitä ihmettä? (Finland) (2003) TV Series\n* Midday (Australia) (1990s)\n* Magic or Miracle? (1983) TV special\n* Magic (2004) (mini) TV Series\n* Larry King Live (CNN) (June 5, 2001, September 3, 2001, January 26, 2007, several more)\n* James Randi: Psychic Investigator (1991) (Open Media series for the ITV network)\n* James Randi Budapesten – Hungarian documentary\n* Inside Edition – (1991, 2006, and 2007) TV\n* Horizon – [http://www.bbc.co.uk/science/horizon/2002/homeopathy.shtml \"Homeopathy: The Test\"] (2002) BBC/UK TV Episode\n* Dead Men Talking (The Biography Channel) (2007)\n* Fornemmelse for snyd (2003) TV Series (also archive footage) Denmark\n* Extraordinary People – \"The Million Dollar Mind Reader\" (September 2008).\n* Exploring Psychic Powers... Live (June 7, 1989; hosted by Bill Bixby)\n* CBS This Morning (1990s)\n* Anderson Cooper 360°, CNN (January 19, 2007, and January 30, 2007)\n* A Question of Miracles (HBO) (1999)\n* 20/20 (ABC) (May 11, 2007)\n*An Honest Liar (2014, aired as Exposed: Magicians, Psychics and Frauds on BBC Storyville)\n\nOther media\n\n* One of Martin Gardner's articles about Dr. Irving Joshua Matrix has a note that one of the Doctor's scams, a school supposedly teaching clairvoyance, was exposed thanks to Randi enrolling in the school under another name. Another article ends with the mention of Randi aiding two investigative reporters in exposing another scam, a supposedly sentient—but actually remotely controlled—robot.\n* In 2007, Randi delivered a talk at TED in which he discussed psychic fraud, homeopathy, and his foundation's Million Dollar Challenge.\n* Randi can be heard speaking an introduction on Tommy Finke's song \"Poet der Affen/Poet of the Apes\" released on the album of the same name in 2010. The message was recorded by Randi and sent to Finke by e-mail.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "James Randi" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16278" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "James Randi (born Randall James Hamilton Zwinge; August 7, 1928) is a Canadian-American retired stage magician and a scientific skeptic who has extensively challenged paranormal and pseudoscientific claims.Rodrigues 2010, [https://books.google.com/books?idOsGuZjYzXdAC&pg\nPA271 p. 271] Randi is the co-founder of the Committee for Skeptical Inquiry (CSI), originally known as the Committee for the Scientific Investigation of Claims of the Paranormal (CSICOP). He is also the founder of the James Randi Educational Foundation (JREF). He began his career as a magician under the stage name The Amazing Randi and later chose to devote most of his time to investigating paranormal, occult, and supernatural claims, which he collectively calls \"woo-woo\". Randi retired from practicing magic at age 60, and from the JREF at 87.\n\nAlthough often referred to as a \"debunker\", Randi has said he dislikes the term's connotations and prefers to describe himself as an \"investigator\". He has written about paranormal phenomena, skepticism, and the history of magic. He was a frequent guest on The Tonight Show Starring Johnny Carson, famously exposing fraudulent faith healer Peter Popoff, and was occasionally featured on the television program Penn & Teller: Bullshit!\n\nPrior to Randi's retirement, JREF sponsored the One Million Dollar Paranormal Challenge, which offered a prize of one million dollars US to eligible applicants who could demonstrate evidence of any paranormal, supernatural, or occult power or event under test conditions agreed to by both parties. The paranormal challenge was officially terminated by the JREF in 2015.http://web.randi.org/the-million-dollar-challenge.html James Randi Educational Foundation The foundation continues to make grants to non-profit groups that encourage critical thinking, and a fact-based world view.\n\nEarly life\n\nRandi was born on August 7, 1928 in Toronto, Ontario, Canada,Moritz 1987, p. 455 the son of Marie Alice (née Paradis) and George Randall Zwinge. He has a younger brother and sister. He took up magic after seeing Harry Blackstone Sr. and reading conjuring books while spending 13 months in a body cast following a bicycle accident. He confounded doctors who expected he would never walk again. Randi often skipped classes and, at 17, dropped out of high school to perform as a conjurer in a carnival roadshow. He practised as a mentalist in local nightclubs and at Toronto's Canadian National Exhibition and wrote for Montreal's tabloid press.Colombo 2004, [https://books.google.com/books?idOXP_OpQna4gC&pg\nPA182 p. 182]\n\nIn his twenties, Randi posed as an astrologer and, to establish that they were actually doing simple tricks, he briefly wrote an astrological column in the Canadian tabloid Midnight under the name \"Zo-ran\" by simply shuffling up items from newspaper astrology columns and pasting them randomly into a column.Randi 1982c, pp. 230–231. Randi reprints two newspaper columns from the Toronto Evening Telegram of August 28, 1950, and August 14, 1950, by Wessely Hicks about Randall Zwinge's psychic predictions. The earlier column states that \"Mr. Zwinge said he first became aware that he possessed Extra Sensory Perception when he was nine years old.\"Randi 1982a, pp. 61–62 In his thirties, Randi worked in the UK, Europe, Philippine nightclubs, and all across Japan. He witnessed many tricks that were presented as being supernatural. One of his earliest reported experiences is that of seeing an evangelist using a version of the \"one-ahead\" technique to convince churchgoers of his divine powers.\n\nCareer\n\nMagician\n\nThough defining himself as a conjuror, Randi began a career as a professional stage magician Randi explained in a February 2007 presentation that he believes the word \"magician\" implies one who has actual magical abilities, whereas a conjurer is one who uses skills to merely play the part of one. and escapologist in 1946. Initially, he presented himself under his real name, Randall Zwinge, which he later dropped in favor of \"The Amazing Randi\". Early in his career, he performed numerous escape acts from jail cells and safes around the world. On February 7, 1956, he appeared live on NBC's Today show, where he remained for 104 minutes in a sealed metal coffin that had been submerged in a hotel swimming pool, breaking what was said to be Harry Houdini's record of 93 minutes, though Randi calls attention to the fact that he was very much younger than Houdini when the original record was established, in 1926.\n\nRandi was a frequent guest on the Long John Nebel program on New York radio station WOR, and did character voices for commercials. After Nebel went to WNBC in 1962, Randi was given the time slot, and from 1967 to '68 hosted The Amazing Randi Show.  This show often had guests who defended paranormal claims, among them Randi's then-friend James W. Moseley. Randi says he quit WOR over complaints (disputed by Randi) from the archbishop of NY, that Randi had said on-air that “Jesus Christ was a religious nut.”\n\nRandi also hosted numerous television specials and went on several world tours. As \"The Amazing Randi\" he appeared regularly on the New York-based children's television series Wonderama from 1959 to 1967. He also auditioned for a revival of the 1950s children's show The Magic Clown in 1970, which showed briefly in Detroit and in Kenya, but was never picked up. In the February 2, 1974, issue of the British conjuring magazine Abracadabra, Randi, defining the community of magicians, stated: \"I know of no calling which depends so much upon mutual trust and faith as does ours.\" In the December 2003 issue of The Linking Ring, the monthly publication of the International Brotherhood of Magicians, it is stated: \"Perhaps Randi's ethics are what make him Amazing\" and \"The Amazing Randi not only talks the talk, he walks the walk.\"\n\nDuring Alice Cooper's 1973–1974 Billion Dollar Babies tour, Randi performed on stage both as a mad dentist and as Alice's executioner. He also built several of the stage props, including the guillotine. Shortly after that, in a 1976 performance for the Canadian TV special World of Wizards, Randi escaped from a straitjacket while suspended upside-down over Niagara Falls.\n\nRandi has been accused of actually using \"psychic powers\" to perform acts such as spoon bending. According to James Alcock, at a meeting where Randi was duplicating the performances of Uri Geller, a professor from the University at Buffalo shouted out that Randi was a fraud. Randi said: \"Yes, indeed, I'm a trickster, I'm a cheat, I'm a charlatan, that's what I do for a living. Everything I've done here was by trickery.\" The professor shouted back: \"That's not what I mean. You're a fraud because you're pretending to do these things through trickery, but you're actually using psychic powers and misleading us by not admitting it.\"Alcock 2001, p. 42 A similar event involved Senator Claiborne Pell, a confirmed believer in psychic phenomena. When Randi personally demonstrated to Pell that he could reveal—by simple trickery—a concealed drawing that had been secretly made by the senator, Pell refused to believe that it was a trick, saying: \"I think Randi may be a psychic and doesn't realize it.\" Randi has consistently denied having any paranormal powers or abilities.Gardner 2000, p. 178\n\nRandi is a member of the Society of American Magicians (SAM), the International Brotherhood of Magicians (IBM), and The Magic Circle in the UK, holding the rank of \"Member of the Inner Magic Circle with Gold Star.\"\n\nRandi said the hardest people to fool are not the highly educated, but children, because they are not sophisticated enough to be fooled, as they have not learned the body cues that adults have learned and which magicians take advantage.\n\nAuthor\n\nRandi is the author of ten books, among them Conjuring (1992), a biographical history of noted magicians. The book is subtitled Being a Definitive History of the Venerable Arts of Sorcery, Prestidigitation, Wizardry, Deception, & Chicanery and of the Mountebanks & Scoundrels Who have Perpetrated these Subterfuges on a Bewildered Public, in short, MAGIC! The book's cover says that it is by \"James Randi, Esq., A Contrite Rascal Once Dedicated to these Wicked Practices but Now Almost Totally Reformed\". The book selects the most influential magicians and tells some of their history, often in the context of strange deaths and careers on the road. This work expanded on Randi's second book titled Houdini, His Life and Art. This illustrated work was published in 1976 and was co-authored with Bert Sugar. It focuses on the professional and private life of Houdini.Burt 2001, p. 192\n\nRandi also wrote a children's book in 1989 titled The Magic World of the Amazing Randi, which introduced children to magic tricks. In addition to his magic books, he has written several educational works about paranormal and pseudoscientific claims. These include biographies of Uri Geller and Nostradamus as well as reference material on other major paranormal figures. He is currently working on A Magician in the Laboratory, which recounts his application of skepticism to science. He was a member of the all-male literary banqueting club the Trap Door Spiders, which served as the basis of his good friend Isaac Asimov's fictional group of mystery solvers, the Black Widowers.Asimov 1994\n\nOther books are Flim-Flam! (1982), The Faith Healers (1987), James Randi, Psychic Investigator (1991), Test Your ESP Potential (1982) and An Encyclopedia of Claims, Frauds, and Hoaxes of the Occult and Supernatural (1995).\n\nRandi was a regular contributor to Skeptic magazine, penning the \"'Twas Brillig...\" column, and also served on its editorial board. He is also a frequent contributor to Skeptical Inquirer magazine, which is published by CSI, of which he is also a Fellow.\n\nSkeptic\n\nRandi gained the international spotlight in 1972 when he publicly challenged the claims of Uri Geller. He accused Geller of being nothing more than a charlatan and a fraud who used standard magic tricks to accomplish his allegedly paranormal feats, and he presented his claims in the book The Truth About Uri Geller (1982).\n\nBelieving that it was important to get columnists and TV personalities to challenge Geller and others like him, Randi and CSICOP reached out in an attempt to educate them. Randi said that CSICOP had a \"very substantial influence on the printed media... in those days.\"  During this effort, Randi made contact with Johnny Carson and discovered that he was \"very much on our side. He wasn't only a comedian... he was a great thinker.\" According to Randi, when he was on The Tonight Show, Carson broke his usual protocol of not talking with guests prior to their entrance on stage, but instead would ask what Randi wanted to be emphasized in the interview. \"He wanted to be aware of how he could help me.\"\n\nIn 1973, Geller appeared on The Tonight Show, and this appearance is recounted in the Nova documentary \"James Randi - Secrets of the Psychics\".\n\nIn the documentary, Randi says that Carson \"had been a magician himself and was skeptical\" of Geller's claimed paranormal powers, so prior to the date of taping, Randi was asked \"to help prevent any trickery\". Per Randi's advice, the show prepared its own props without informing Geller, and did not let Geller or his staff \"anywhere near them\". When Geller joined Carson on stage, he appeared surprised that he was not going to be interviewed, but instead was expected to display his abilities using the provided articles. Geller said \"This scares me\" and \"I'm surprised because before this program your producer came and he read me at least 40 questions you were going to ask me.\" Geller was unable to display any paranormal abilities, saying \"I don't feel strong\" and expressing his displeasure at feeling like he was being \"pressed\" to perform by Carson.  According to Adam Higginbotham's Nov. 7, 2014 article in the New York Times: \n\nHowever, this appearance on The Tonight Show, which Carson and Randi had orchestrated to debunk Geller's claimed abilities, backfired. According to Higginbotham,\n\nAccording to Higginbotham, this result caused Randi to realize that much more must be done to stop Geller and those like him. So in 1976, Randi approached Ray Hyman, a psychologist who had observed the tests of Geller's ability at Stanford and thought them slipshod, and suggested they create an organization dedicated to combating pseudoscience. In 1976, together with Martin Gardner, a Scientific American columnist whose writing had helped hone Hyman's and Randi's skepticism, they formed the Committee for Scientific Investigation of Claims of the Paranormal (CSICOP).\n\nUsing donations and sales of their magazine, Skeptical Inquirer, they and secular humanist philosopher Paul Kurtz took seats on the executive board, with Isaac Asimov and Carl Sagan joining as founding members. Randi traveled the world on behalf of CSICOP, becoming its public face, and according to Hyman, the face of the skeptical movement.Higginbotham, Adam (November 7, 2014). [https://www.nytimes.com/2014/11/09/magazine/the-unbelievable-skepticism-of-the-amazing-randi.html?_r\n0 \"The Unbelievable Skepticism of the Amazing Randi\"]. The New York Times.\n\nAndrás G. Pintér, producer and co-host of the European Skeptics Podcast called Randi the grandfather of European skepticism by virtue of Randi \"playing a role in kickstarting several European organizations.\"\n\nGeller sued Randi and CSICOP for $15 million in 1991 and lost. Geller's suit against CSICOP was thrown out in 1995, and he was ordered to pay $120,000 for filing a frivolous lawsuit. The legal costs Randi incurred used almost all of a $272,000 MacArthur Foundation grant awarded to Randi in 1986 for his work. Randi also dismissed Geller's claims that he was capable of the kind of psychic photography made famous by the case of Ted Serios. It is a matter, Randi argues, of trick photography using a simple hand-held optical device.Carroll 2003, [https://books.google.com/books?id\n6FPqDFx40vYC&pgPA313 p. 313] During the period of Geller's legal dispute, CSICOP's leadership, wanting to avoid becoming a target of Geller's litigation, demanded that Randi refrain from commenting on Geller. Randi refused and resigned, though he has maintained a respectful relationship with the group, which in 2006 changed its name to the Committee for Skeptical Inquiry (CSI). In 2010, Randi was one of 16 new CSI fellows elected by its board.\n\nRandi has gone on to write many articles criticizing beliefs and claims regarding the paranormal. He has also demonstrated flaws in studies suggesting the existence of paranormal phenomena; in his Project Alpha hoax, Randi successfully planted two fake psychics in a privately funded psychic research experiment. The hoax became a scandal and demonstrated the shortcomings of many paranormal research projects at the university level.\n\nRandi has appeared on numerous TV shows, sometimes to directly debunk the claimed abilities of fellow guests. In a 1981 appearance on That's My Line, Randi appeared opposite claimed psychic James Hydrick, who said that he could move objects with his mind and appeared to demonstrate this claim on live television by turning a page in a telephone book without touching it. Randi, having determined that Hydrick was surreptitiously blowing on the book, arranged foam packaging peanuts on the table in front of the telephone book for the demonstration. This prevented Hydrick from demonstrating his abilities, which would have been exposed when the blowing moved the packaging. Randi writes that, eventually, Hydrick \"confessed everything\".\n\nRandi was awarded a MacArthur Foundation Fellowship in 1986. The fellowship's five-year $272,000 grant helped support Randi's investigations of faith healers, including W. V. Grant, Ernest Angley, and Peter Popoff, whom Randi first exposed on The Tonight Show Starring Johnny Carson in February 1986. Hearing about his investigation of Popoff, Carson invited Randi onto his show without seeing the evidence he was going to reveal. Carson appeared stunned after Randi showed a brief video segment from one of Popoff's broadcasts showing him calling out a woman in the audience, revealed personal information about her that he claimed came from God, and then performed a laying-on-of-hands healing to drive the devil from her body. Randi then replayed the video, but with some of the sound dubbed in that he and his investigating team captured during the event using a radio scanner and recorder. Their scanner had detected the radio frequency Popoff's wife Elizabeth was using backstage to broadcast directions and information to a miniature radio receiver hidden in Popoff's left ear. That information had been gathered by Popoff's assistants, who had handed out \"prayer cards\" to the audience before the show, instructing them to write down all the information Popoff would need to pray for them.Randi 1987, pp. 139–181\n\nThe news coverage generated by Randi's exposé on The Tonight Show led to many TV stations dropping Popoff's show, eventually forcing him into bankruptcy in September 1987. However, the televangelist returned soon after with faith-healing infomercials that reportedly attracted more than $23 million in 2005 from viewers sending in money for promised healing and prosperity. The Canadian Centre for Inquiry's Think Again! TV documented one of Popoff's more recent performances before a large audience who gathered in Toronto on May 26, 2011, hoping to be saved from illness and poverty.\n\nIn February 1988, Randi tested the gullibility of the media by perpetrating a hoax of his own. By teaming up with Australia's 60 Minutes program and by releasing a fake press package, he built up publicity for a \"spirit channeler\" named Carlos who was actually artist Jose Alvarez, a.k.a. Deyvi Peña, whom Randi described as a \"friend\". Randi would tell him what to say through sophisticated radio equipment. According to the 60 Minutes program on the Carlos hoax, \"it was claimed that Alvarez would not have had the audience he did at the Opera House (and the potential sales therefrom) had the media coverage been more aggressive (and factual)\", though an analysis by The Skeptics Tim Mendham concluded that, while the media coverage of Alvarez's appearances was not credulous, \"it [the hoax] at least showed that they could benefit by being a touch more sceptical\". The hoax was exposed on 60 Minutes Australia; \"Carlos\" and Randi explained how they had pulled it off.\n\nIn his book The Faith Healers, Randi wrote that his anger and relentlessness arose from compassion for the victims of fraud. Randi has also been critical of João de Deus (John of God), a self-proclaimed psychic surgeon who has received international attention. Randi observed, referring to psychic surgery, \"To any experienced conjurer, the methods by which these seeming miracles are produced are very obvious.\"Randi 1995, [http://www.randi.org/encyclopedia/psychic%20surgery.html \"psychic surgery\"]\n\nIn 1982, Randi verified the abilities of Arthur Lintgen, a Philadelphia doctor, who was able to identify the classical music recorded on a vinyl LP solely by examining the grooves on the record. However, Lintgen did not claim to have any paranormal ability, merely knowledge of the way that the groove forms patterns on particular recordings.\n\nIn 1988, John Maddox, editor of the prominent science journal Nature, asked Randi to join the supervision and observation of the homeopathy experiments conducted by Jacques Benveniste's team. Once Randi's stricter protocol for the experiment was in place, the positive results could not be reproduced.\n\nJames Randi stated that Daniel Dunglas Home, who could allegedly play an accordion that was locked in a cage without touching it, was caught cheating on a few occasions, but the incidents were never made public. He also stated that the actual instrument in use was a one-octave mouth organ concealed under Home's large moustache and that other one-octave mouth organs were found in Home's belongings after his death.Randi 1995, [http://www.randi.org/encyclopedia/Home,%20Daniel%20Dunglas.html \"Home, Daniel Dunglas\"] According to Randi, author William Lindsay Gresham told Randi \"around 1960\" that he had seen these mouth organs in the Home collection at the Society for Psychical Research (SPR). Eric J. Dingwall, who catalogued Home's collection on its arrival at the SPR does not record the presence of the mouth organs. According to Peter Lamont, the author of an extensive Home biography, \"It is unlikely Dingwall would have missed these or did not make them public.\"Lamont 2005, p. 302\n\nRandi distinguishes between pseudoscience and crackpot science. He regards most of parapsychology as pseudoscience because of the way in which it is approached and conducted, but nonetheless sees it as a legitimate subject that \"should be pursued\", and from which real scientific discoveries may develop.Randi 1997, [https://books.google.com/books?id\n_mo4AAAAIAAJ&pg=PA170 p. 170] Randi regards crackpot science as \"equally wrong\" as pseudoscience, but with no scientific pretensions.\n\nSkeptics and magicians Penn & Teller credit Randi and his career as a skeptic for their own careers. During an interview at TAM! 2012, Penn stated that Flim-Flam! was an early influence on him, and said \"If not for Randi there would not be Penn & Teller as we are today.\" He went on to say \"Outside of my family... no one is more important in my life. Randi is everything to me.\"\n\nExploring Psychic Powers... Live television show\n\nExploring Psychic Powers... Live was a television show aired live on June 7, 1989, wherein Randi examined several people claiming psychic powers. The show offered $100,000 (Randi's then $10,000 prize plus $90,000 put up by the show's syndicator, LBS Communications, Inc.) to anyone who could demonstrate genuine psychic powers.\n\n* An astrologer claimed that he was able to ascertain a person's astrological sign after talking with them for a few minutes. He was presented with twelve people, one at a time, each with a different astrological sign. They could not tell the astrologer their astrological sign or birth date, nor could they wear anything that would indicate it. After the astrologer talked to them, he had them go and sit in front of the astrological sign that the astrologer thought was theirs. By agreement, the astrologer needed to get ten of the 12 correct, to win. He got none correct.\n* The next psychic claimed to be able to read auras around people. He claimed that auras were visible at least five inches above each of them. He selected ten people who he said had clearly visible auras. They were to stand behind screens and he claimed that their auras would be visible above the screens, which were numbered 1 through 10, and the subjects were told by the astrologer behind which screen to stand. He was to tell whether or not a person was standing behind each screen, by seeing their aura above. Since random guessing would be expected to get about five correct, the psychic needed to get eight of the ten right. The psychic stated that he saw an aura over all ten screens, but people were behind only four of the screens.\n* A dowser claimed that he could detect water, even in a bottle inside a sealed cardboard box. He was shown twenty boxes and he was asked to indicate which boxes contained a water bottle. He selected eight of the boxes which he said contained water. Actually, only five of the twenty contained water. Of the eight selected boxes, only one was revealed to contain water and one contained sand. It was not revealed whether any of the remaining six boxes contained water.\n* A psychometric psychic claimed to be able to receive personal information about the owner of an object by handling the object itself. In order to avoid ambiguous statements, the psychic agreed to be presented with both a watch and a key from each of twelve different people. She was to match keys and watches to each owner. According to the prior agreement, she had to match at least nine out of the twelve sets, but she succeeded in only two.\n* During the program, another psychic was doing a sorting of 250 Zener cards, guessing which of the five symbols was on each one. Random guessing should have resulted in about fifty correct guesses, so it was agreed in advance that the psychic had to be right on at least eighty-two cards in order to demonstrate an ability greater than chance. However, she was able to get only fifty predictions correct, which is no better than random guessing.Polidoro 2003, pp. 19–24\n\nJames Randi Educational Foundation (JREF)\n\nIn 1996, Randi established the James Randi Educational Foundation. Randi and his colleagues publish in JREF's blog,  [http://web.randi.org/swift Swift]. Topics have included the interesting mathematics of the one-seventh area triangle, a classic geometric puzzle. In his weekly commentary, Randi often gives examples of what he considers the nonsense that he deals with every day.\n\nBeginning in 2003, the JREF annually hosted The Amaz!ng Meeting, a gathering of scientists, skeptics, and atheists. The last meeting was in 2015, coinciding with Randi's retirement from the JREF.\n\n2010s\n\nJames Randi began a series of conferences known as \"The Amazing Meeting\" - TAM - which quickly became the largest gathering of skeptics in the world, drawing audiences from Asia, Europe, South America, and the UK. It also attracted large percentage of younger folks.\nRandi has been regularly featured on many podcasts, including The Skeptics Society's official podcast Skepticality and the Center for Inquiry's official podcast Point of Inquiry. From September 2006 onwards, he has occasionally contributed to The Skeptics' Guide to the Universe podcast with a column titled \"Randi Speaks.\" In addition, The Amazing Show is a podcast in which Randi shares various anecdotes in an interview format.\n\nIn 2014 Part2Filmworks released An Honest Liar, a feature film documentary, written by Tyler Measom and Greg O'Toole, and directed and produced by Measom and Justin Weinstein.[https://www.yahoo.com/movies/film/an-honest-liar \"An Honest Liar\"]. Yahoo! Movies. Retrieved September 5, 2014. The film, which was funded through Kickstarter,[https://www.kickstarter.com/projects/220588101/an-honest-liar-the-amazing-randi-story \"An Honest Liar: The Amazing Randi Story\"]. Kickstarter. Retrieved September 5, 2014. focuses on Randi's life, his investigations, and his relationship with longtime partner José Alvarez, a.k.a. Deyvi Peña. The film was screened at the Tribeca Film Festival,Barsanti, Chris (April 25, 2014). [http://www.popmatters.com/review/181139-tribeca-film-festival-2014-an-honest-liar-in-order-of-disappearance/ \"Tribeca Film Festival 2014: ‘'An Honest Liar' + 'In Order of Disappearance'\"]. PopMatters. at Toronto's Hot Docs film festival,Teplitsky, Ariel (May 1, 2014). [https://www.thestar.com/entertainment/movies/2014/05/01/worth_a_look_an_honest_liar.html \"Worth a look: An Honest Liar\"]. Toronto Star. and at the June 2014 AFI Docs Festival in Silver Spring, Maryland and Washington, D.C., where it won the Audience Award for Best Feature. It has since been captioned in ten different languages, shown worldwide, and was also positively received by critics.Rooney, David (June 30, 2014). [http://www.hollywoodreporter.com/review/an-honest-liar-provincetown-review-715950 \"'An Honest Liar': Provincetown Review\"]. The Hollywood Reporter.[http://www.rottentomatoes.com/m/an_honest_liar/ \"An Honest Liar (2014)\"]. Rotten Tomatoes. Retrieved September 5, 2014. The film was featured on the PBS Independent Lens series, shown in the U.S. and Canada, on March 28, 2016.[https://www.thestar.com/entertainment/television/2016/03/28/torontos-james-the-amazing-randi-profiled-in-an-honest-liar.html Toronto's James (The Amazing) Randi profiled in An Honest Liar.], Toronto Star, Bill Brioux, March 28, 2016. Retirieved 29 March 2016.\n\nIn 2017, he appeared in animated form on [http://www.holykoolaid.com Holy Koolaid], in which he discussed the challenge of finding the balance between connecting sincerely with his audience and at the same time tricking/fooling them with an artful ruse and indicated that this is a balance many magicians struggle with.\n\nViews on religion\n\nRandi's parents were members of the Anglican Church but rarely attended services. He attended Sunday School at [https://stcuthbertsleaside.com/ St. Cuthbert's Church] in Toronto a few times as a child, but he independently decided to stop going when he was not answered when he asked for proof of the teachings of the Church.\n\nIn his essay \"Why I Deny Religion, How Silly and Fantastic It Is, and Why I'm a Dedicated and Vociferous Bright,\" Randi, who identifies himself as an atheist, has opined that many accounts in religious texts, including the virgin birth, the miracles of Jesus Christ, and the parting of the Red Sea by Moses, are not believable. For example, Randi refers to the Virgin Mary as being \"impregnated by a ghost of some sort, and as a result produced a son who could walk on water, raise the dead, turn water into wine, and multiply loaves of bread and fishes\" and questions how Adam and Eve \"could have two sons, one of whom killed the other, and yet managed to populate the Earth without committing incest.\" He writes that, compared to the Bible, \"The Wizard of Oz is more believable. And much more fun.\"\n\nClarifying his view of atheism, Randi has written \"I’ve said it before: there are two sorts of atheists. One sort claims that there is no deity, the other claims that there is no evidence that proves the existence of a deity; I belong to the latter group, because if I were to claim that no god exists, I would have to produce evidence to establish that claim, and I cannot. Religious persons have by far the easier position; they say they believe in a deity because that’s their preference, and they’ve read it in a book. That’s their right.\"\n\nIn An Encyclopedia of Claims, Frauds, and Hoaxes of the Occult and Supernatural (1995), he examines various spiritual practices skeptically. Of the meditation techniques of Guru Maharaj Ji, he writes \"Only the very naive were convinced that they had been let in on some sort of celestial secret.\"Randi 1995, [http://www.randi.org/encyclopedia/Maharaj%20Ji.html \"Maharaj Ji\"] In 2003, he was one of the signers of the Humanist Manifesto.\n\nIn a discussion with Kendrick Frazier at CSICon 2016, Randi stated “I think that a belief in a deity is ... an unprovable claim ... and a rather ridiculous claim. It is an easy way out to explain things to which we have no answer.” He then summarized his current concern with religious belief as follows:\n\nOne Million Dollar Paranormal Challenge\n\nThe James Randi Educational Foundation (JREF) offered a prize of US$1,000,000 to anyone able to demonstrate a supernatural ability under scientific testing criteria agreed to by both sides. Based on the paranormal challenges of John Nevil Maskelyne and Houdini, the foundation began in 1996, when Randi put up $1,000 of his own money payable to anyone who could provide objective proof of the paranormal. The prize money grew to $1,000,000, and had formal published rules. No one progressed past the preliminary test, which was set up with parameters agreed to by both Randi and the applicant. He refused to accept any challengers who might suffer serious injury or death as a result of the testing.\n\nOn April 1, 2007, it was ruled that only persons with an established, nationally recognized media profile and the backing of a reputable academic were allowed to apply for the challenge, in order to avoid wasting JREF resources on frivolous claimants.\n\nOn Larry King Live, March 6, 2001, Larry King asked Sylvia Browne if she would take the challenge and she agreed. Randi appeared with Browne on Larry King Live six months later, and she again appeared to accept his challenge. However, according to Randi, she ultimately refused to be tested, and the Randi Foundation kept a clock on its website recording the number of weeks since Browne allegedly accepted the challenge without following through, until Browne's death in November 2013.\n\nDuring another appearance on Larry King Live on June 5, 2001, Randi challenged Rosemary Altea to undergo testing for the million dollars, but Altea refused to address the question. Instead Altea replied only, \"I agree with what he says, that there are many, many people who claim to be spiritual mediums, they claim to talk to the dead. There are many people, we all know this. There are cheats and charlatans everywhere.\" On January 26, 2007, Altea and Randi again appeared on the show, and Altea again refused to answer whether or not she would take the One Million Dollar Paranormal Challenge.\n\nIn October 2007, claimed psychic John Edward appeared on Headline Prime, hosted by Glenn Beck. When asked if he would take Randi's challenge, Edward responded, \"It's funny. I was on Larry King Live once, and they asked me the same question. And I made a joke [then], and I'll say the same thing here: Why would I allow myself to be tested by somebody who's got an adjective as a first name?\" Beck simply allowed Edward to continue, ignoring the challenge.\n\nRandi asked British businessman Jim McCormick, the inventor of the bogus ADE 651 bomb detector, to take the challenge in October 2008. Randi called the ADE 651 \"a useless quack device which cannot perform any other function than separating naive persons from their money. It's a fake, a scam, a swindle, and a blatant fraud. Prove me wrong and take the million dollars.\" There was no response from McCormick. According to Iraqi investigators, the ADE 651, which was corruptly sold to the Baghdad bomb squad, was responsible for the deaths of hundreds of civilians who died as a result of terrorist bombs which were not detected at checkpoints. On April 23, 2013, McCormick was convicted of three counts of fraud at the Old Bailey in London; he was subsequently sentenced to ten years' imprisonment for his part in the ADE 651 scandal, which Randi was the first to expose.\n\nA public log of past participants in the Million Dollar Challenge exists.\nIn 2015, the James Randi paranormal challenge was officially terminated.\n\nLegal disputes\n\nRandi has been involved in a variety of legal disputes but says that he has \"never paid even one dollar or even one cent to anyone who ever sued me.\" However, he says, he has paid out large sums to personally defend himself in these suits.\n\nUri Geller\n\nRandi met magician Uri Geller in the early 1970s, and found Geller to be “Very charming. Likable, beautiful, affectionate, genuine, forward-going, handsome — everything!” But Randi viewed Geller as a con-man, and began a long effort to expose him as a fraud. According to Randi, Geller tried to sue him several times, accusing him of libel. Geller never won, save for a ruling in a Japanese court that ordered Randi to pay Geller one third of one percent of what Geller had requested. This ruling was canceled, and the matter dropped, when Geller decided to concentrate on another legal matter.\n\nIn May 1991, Geller sued Randi and CSICOP for $15 million on a charge of slander, after Randi told the International Herald Tribune that Geller had \"tricked even reputable scientists\" with stunts that \"are the kind that used to be on the back of cereal boxes\", referring to the old spoon-bending trick. The court dismissed the case and Geller had to settle at a cost to him of $120,000, after Randi produced a cereal box which bore instructions on how to do the spoon-bending trick. Geller's lawyer Don Katz was disbarred mid-way into this action and Geller ended up suing him. After failing to pay before the deadline imposed by the court, Geller was sanctioned an additional $20,000.\n\nRandi commented that Uri Geller's public performances were of the same quality as those found on the backs of cereal boxes. Geller sued both Randi and CSICOP. CSICOP argued that the organization was not responsible for Randi's statements. The court agreed that including CSICOP was frivolous and dropped them from the action, leaving Randi to face the action alone, along with the legal costs. Geller was ordered to pay substantial damages, but only to CSICOP. The matter was subsequently settled out of court, and the details of the settlement have been kept confidential. The settlement also included an agreement that Geller would not pursue Randi for the award in the Japanese case or other outstanding cases.\n\nOther cases\n\nIn 1993, a jury in the U.S. District Court in Baltimore found Randi liable for defaming Eldon Byrd for calling him a child molester in a magazine story and a \"shopping market molester\" in a 1988 speech. However, the jury found that Byrd was not entitled to any monetary damages after hearing testimony that he had sexually molested and later married his sister-in-law. The jury also cleared the other defendant in the case, CSICOP.West, Norris. P. (June 5, 1993). [http://articles.baltimoresun.com/1993-06-05/news/1993156046_1_byrd-magician-molester \"Magician defamed scientist, jury rules\"]. The Baltimore Sun.\n\nLate in 1996, Randi launched a libel suit against a Toronto-area psychic named Earl Gordon Curley. Curley had made multiple objectionable comments about Randi on Usenet. Despite suggesting to Randi on Usenet that Randi should sue – Curley's comments implying that if Randi did not sue, then his allegations must be true – Curley seemed entirely surprised when Randi actually retained Toronto's largest law firm and initiated legal proceedings. The suit was eventually dropped in 1998 when Earl Curley died at the age of 51 of \"alcohol toxicity.\"\n\nAllison DuBois, on whose life the television series Medium was based, threatened Randi with legal action for using a photo of her from her website in his December 17, 2004, commentary without her permission. Randi removed the photo and subsequently used a caricature of DuBois when mentioning her on his site, beginning with his December 23, 2005, commentary.\n\nSniffex, producer of a dowsing bomb detection device, sued Randi and the JREF in 2007 and lost. Sniffex sued Randi for his comments regarding a government test in which the Sniffex device failed. The company was later investigated and charged with fraud.\n\nPersonal life\n\nWhen he hosted his own radio show in the 1960s, Randi lived in a small house in Rumson, New Jersey, that featured a sign on the premises that read: \"Randi — Charlatan\". In a Fort Lauderdale public library in 1986, Randi, who had recently moved to Florida, met Venezuelan artist Deyvi Orangel Peña Arteaga, who lived for many years under the assumed name José Alvarez, which is now his artist name. The two men eventually moved in together; they were married in Washington on July 2, 2013, with Randi turning 85 the next month;  today they live in Plantation, Florida.Sturgess, Kylie (March/April 2015). \"Behind the Magic: An Interview with James Randi\". Skeptical Inquirer Volume 39  Number 2, pp. 38–42.\n\nIn 1987, Randi became a naturalized citizen of the United States. Randi has said that one reason he became an American citizen was an incident while he was on tour with Alice Cooper where the Royal Canadian Mounted Police searched the band's lockers during a performance. Nothing illicit or illegal was found, yet the RCMP trashed the room.\n\nIn February 2006, Randi underwent coronary artery bypass surgery. In early February 2006, he was declared to be in stable condition and \"receiving excellent care\" with his recovery proceeding well. The weekly commentary updates to his Web site were made by guests while he was hospitalized. Randi recovered after his surgery and was able to help organize and attend the 2007 Amaz!ng Meeting (T.A.M.) in Las Vegas, Nevada, his annual convention of scientists, magicians, skeptics, atheists and freethinkers.\n\nRandi was given a diagnosis of colorectal cancer in June 2009. He had a series of small tumors removed from his intestines during laparoscopic surgery. He announced the diagnosis a week later at The Amaz!ng Meeting 7, as well as the fact that he was scheduled to begin chemotherapy in the following weeks. Lengthy article which reported: \"He has intestinal cancer and may not have long to live.\" He also said at the conference: \"One day, I'm gonna die. That's all there is to it. Hey, it's too bad, but I've got to make room. I'm using a lot of oxygen and such — I think it's good use of oxygen myself, but of course, I'm a little prejudiced on the matter.\"\n\nRandi underwent his final chemotherapy session on December 31, 2009, as he explained in a January 12, 2010, video in which he related that his chemotherapy experience was not as unpleasant as he had imagined it might be. In a video posted April 12, 2010, Randi stated that he has been given a clean bill of health.\n\nIn a March 21, 2010, blog entry, Randi came out as gay, a move he explained was inspired by seeing the 2008 biographical drama film Milk.\n\nRandi has never smoked, taken narcotics, or become inebriated, because, as he has explained, \"that can easily just fuzz the edges of my rationality, fuzz the edges of my reasoning powers, and I want to be as aware as I possibly can. That means giving up a lot of fantasies that might be comforting in some ways, but I'm willing to give that up in order to live in an actually real world.\"\n\nIn a video released on October 16, 2017, Randi revealed that he had recently suffered a minor stroke, and that he was under medical advice not to travel during his recovery, so would be unable to attend CSICon 2017 in Las Vegas later that month.\n\nPolitical views \n\nRandi is a registered Democrat. He wept when Barack Obama took office as President of the United States. He saw it as a large step forward for the United States to elect a black man and electing a woman would be another such step. \n\nComments on illegal drugs and Social Darwinism\n\nOn April 28, 2009, Randi stated on the James Randi Educational Foundation website that he wanted illegal drugs to be legalized so that users could kill themselves.\n\nIn the book The Heretics: Adventures with the Enemies of Science (2013), author Will Storr brought up Randi's comments on illegal drugs during an interview. In the interview, Randi stated that he thinks \"exactly the same thing about smoking\" and that smokers \"should be allowed to smoke themselves to death and die.\" Randi proceeded to call himself \"a believer in Social Darwinism.\" These comments evoked unrest in parts of the Skeptic community.\n\nOn 1 March 2013, the website [http://doubtfulnews.com/ DoubtfulNews.com] published a news story in which Randi claimed to have been misquoted:\nThe statement “I’m a believer in social Darwinism,” did not come from me. In fact, I had to look up the expression to learn what was being referred to. This attack appears to be calling me a Nazi, nothing less. I demand that Mr. Storr refer me to the original sources to which we assume he has referred. Until then, I’ll only say that he has carefully selected phrases and statements out of context, not the sort of referencing that I would have expected from him.\n\nOn 2 March 2013, Randi posted an elaborative comment on that same news story, maintaining that he would never have called himself a Social Darwinist, since he \"only recently learned in detail what that term really means\" and was \"quite ignorant of the history of the movement organized around that false idea.\" However, Randi accepted \"that the conversation with Mr. Storr went just as described\" and conceded that he \"sometimes speaks on things about which [he knows] very little\":\nI’m well aware that I sometimes “shoot from the hip” and speak on things about which I know very little. In this present situation, I published my personal opinions about drug addiction without knowing very much about the neuroscience behind addiction, or the addiction recovery field. Not only did I say some deeply regrettable and insensitive things, but as I’ve learned more about the questions and issues at hand, I accept that I have been wrongheaded on a number of topics related to these issues. Even at 84, I’m still learning. Please bear with me, folks.\n\nAwards and honors\n\nWorld records\n\nThe following are Guinness World Records:\n* Randi was in a sealed casket underwater for an hour and 44 minutes, which broke Harry Houdini's record of one hour and 33 minutes set on August 5, 1926.\n* Randi was encased in a block of ice for 55 minutes.\n\nBibliography\n\n* \n* \n* \n* \n* \n* \n* \n*  Companion book to the Open Media/Granada Television series.\n* \n*  ([http://web.randi.org/encyclopedia-of-claims.html Online version])\n* A Magician in the Laboratory (Forthcoming)\n* Wrong! (Forthcoming)\n\nTelevision and film\n\nActor\n\n* Good to See You Again, Alice Cooper (1974) as the Dentist/Executioner\n* Ragtime (1981) (stunt coordinator: Houdini)\n* Penn & Teller's Invisible Thread (1987) (TV)\n* Penn & Teller Get Killed (1989) as the 3rd Rope Holder\n* Beyond Desire (1994) as the Coroner\n\nHimself\n\n* Wonderama (1959–1967) (TV) as The Amazing Randi\n* I've Got a Secret (1965) (TV) as The Amazing Randi\n* Happy Days – \"The Magic Show\" (1978) as the Amazing Randi\n* Zembla, 'De trucs van Char' (The tricks Char uses). (March 2008)\n* ZDF German TV (2007)\n* Wild Wild Web (1999)\n* West 57th (1980s)\n* Welt der Wunder – Kraft der Gedanken (January 2008)\n* Today (many appearances)\n* The Don Lane Show (Australia)\n* That's My Line (1981) (Appeared with James Hydrick)\n* The View (ABC) multiple appearances 1997–present\n* The Tonight Show Starring Johnny Carson (32 appearances between 1973 and 1993 plus repeats)\n* The Secret Cabaret (produced by Open Media for Channel 4 in the UK)\n* The Power of Belief (October 6, 1998) (ABC News Special) (TV)\n* People are Talking (1980s)\n* The Patterson Show (1970s)\n* Superpowers? (an Equinox documentary made by Open Media for Channel 4 in 1990)[http://www.tcm.com/tcmdb/title/475347/Superpowers- TCM] and [http://www.ovguide.com/tv_episode/equinox-season-1990-episode-14-superpowers-4384747 Online Video Guide]. Retrieved April 15, 2015\n* After Dark (September 3, 1988, September 9, 1989)List of After Dark editions\n* Weird Thoughts, Open Media discussion hosted by Tony Wilson for BBC TV,  with Mary Beard and others, 1994[http://www.eofftv.com/w/wei/weird_thoughts_main.htm EOFF] . Retrieved April 15, 2015\n* The Art of Magic (1998) (TV)\n* The Ultimate Psychic Challenge (Discovery Channel/Channel 4) (2003)\n* Spotlight on James Randi (2002) (TV)\n* Secrets of the Super Psychics (Channel 4/The Learning Channel), produced by Open Media, 1997/8\n* Scams, Schemes, and Scoundrels (A&E Special) (March 30, 1997)\n* RAI TV Italy (1991)\n* Politically Incorrect with Bill Maher\n* Penn & Teller: Bullshit! several appearances\n** \"End of the World\" (2003) TV Episode\n** \"ESP\" (2003) TV Episode\n** \"Signs from Heaven\" (2005) TV Episode\n* The Oprah Winfrey Show 2 episodes\n* Lawrence Leung's Unbelievable (Australia) TV Episode\n* Nova: Secrets of the Psychics (1993)\n* Mitä ihmettä? (Finland) (2003) TV Series\n* Midday (Australia) (1990s)\n* Magic or Miracle? (1983) TV special\n* Magic (2004) (mini) TV Series\n* Larry King Live (CNN) (June 5, 2001, September 3, 2001, January 26, 2007, several more)\n* James Randi: Psychic Investigator (1991) (Open Media series for the ITV network)\n* James Randi Budapesten – Hungarian documentary\n* Inside Edition – (1991, 2006, and 2007) TV\n* Horizon – [http://www.bbc.co.uk/science/horizon/2002/homeopathy.shtml \"Homeopathy: The Test\"] (2002) BBC/UK TV Episode\n* Dead Men Talking (The Biography Channel) (2007)\n* Fornemmelse for snyd (2003) TV Series (also archive footage) Denmark\n* Extraordinary People – \"The Million Dollar Mind Reader\" (September 2008).\n* Exploring Psychic Powers... Live (June 7, 1989; hosted by Bill Bixby)\n* CBS This Morning (1990s)\n* Anderson Cooper 360°, CNN (January 19, 2007, and January 30, 2007)\n* A Question of Miracles (HBO) (1999)\n* 20/20 (ABC) (May 11, 2007)\n*An Honest Liar (2014, aired as Exposed: Magicians, Psychics and Frauds on BBC Storyville)\n\nOther media\n\n* One of Martin Gardner's articles about Dr. Irving Joshua Matrix has a note that one of the Doctor's scams, a school supposedly teaching clairvoyance, was exposed thanks to Randi enrolling in the school under another name. Another article ends with the mention of Randi aiding two investigative reporters in exposing another scam, a supposedly sentient—but actually remotely controlled—robot.\n* In 2007, Randi delivered a talk at TED in which he discussed psychic fraud, homeopathy, and his foundation's Million Dollar Challenge.\n* Randi can be heard speaking an introduction on Tommy Finke's song \"Poet der Affen/Poet of the Apes\" released on the album of the same name in 2010. The message was recorded by Randi and sent to Finke by e-mail. James Randi. http://en.wikipedia.org/?curid=16278."
  }
}
