{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9901",
  "eid" : "f2965e70-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778486743,
  "textBody" : "The Epistle to the Hebrews, or Letter to the Hebrews, or in the Greek manuscripts, simply To the Hebrews ( Πρὸς Έβραίους)The Greek New Testament, Edited by Kurt Aland, Matthew Black, Carlo M. Martini, Bruce M. Metzger, and Allen Wikgren, in cooperation with the Institute for New Testament Textual Research, 2nd edition, United Bible Societies, 1973 is one of the books of the New Testament.\n\nThe text is traditionally attributed to  Paul the Apostle, but doubt on Pauline authorship is reported by Eusebius,\"some have rejected the Epistle to the Hebrews, saying that it is disputed by the church of Rome, on the ground that it was not written by Paul.\" Eusebius, Hist. Eccl. 3.3.5 ([http://www.ccel.org/ccel/schaff/npnf201.iii.viii.iii.html text]); cf. also 6.20.3 ([http://www.ccel.org/ccel/schaff/npnf201.iii.xi.xx.html text]). and modern biblical scholarship considers its authorship unknown,Alan C. Mitchell, Hebrews (Liturgical Press, 2007) p. 6. perhaps written in deliberate imitation of the style of Paul.Bart D. Ehrman, Forged: Writing in the Name of God – Why the Bible's Authors Are Not Who We Think They Are (HarperCollins, 2011) p. 23.Clare K. Rothschild, Hebrews as Pseudepigraphon: The History and Significance of the Pauline Attribution of Hebrews (Mohr Siebeck, 2009) p. 4.\n\nScholars of Greek consider its writing to be more polished and eloquent than any other book of the New Testament. The book has earned the reputation of being a masterpiece.Powell, Mark A. Introducing the New Testament: a historical, literary, and theological survey. Baker Academic, 2009.  It has also been described as an intricate New Testament book.Mackie, Scott D. Eschatology and Exhortation in the Epistle to the Hebrews. Tübingen: Mohr Siebeck, 2007.  Scholars believe it was written for Jewish Christians who lived in Jerusalem. Its purpose was to exhort Christians to persevere in the face of persecution. At this time, certain believers were considering turning back to Judaism (the Jewish system of law) to escape being persecuted for accepting Christ as their saviour, now following this system of grace (saved by Jesus' sacrifice on the cross). The theme of the epistle is the doctrine of the person of Christ and his role as mediator between God and humanity.\n\nThe epistle opens with an exaltation of Jesus as \"the radiance of God's glory, the express image of his being, and upholding all things by his powerful word\".  The epistle presents Jesus with the titles \"pioneer\" or \"forerunner\", \"Son\" and \"Son of God\", \"priest\" and \"high priest\".Mason, Eric F. You Are a Priest Forever: Second Temple Jewish Messianism and the Priestly Christology of the Epistle to the Hebrews. (STDJ 74; Leiden/Boston: Brill, 2008). \n\nThe epistle casts Jesus as both exalted Son and high priest, a unique dual Christology.Mackie, Scott D. \"Confession of the Son of God in the Exordium of Hebrews\". Journal for the Study of the New Testament,  30.4 (2008)\n\nComposition \n\nHebrews uses Old Testament quotations interpreted in light of first century rabbinical Judaism.Utley, R. J.: The Superiority of the New Covenant: Hebrews. Bible Lessons International; Marshall, Texas: 1999, Volume 10, p. 1. New Testament and Second Temple Judaism scholar Eric Mason argues that the conceptual background of the priestly Christology of the Epistle to the Hebrews closely parallels presentations of the messianic priest and Melchizedek in the Qumran scrolls.  In both Hebrews and Qumran a priestly figure is discussed in the context of a Davidic figure; in both cases a divine decree appoints the priests to their eschatological duty; both priestly figures offer an eschatological sacrifice of atonement. Although the author of Hebrews was not directly influenced by Qumran's \"Messiah of Aaron\",Oegema, Gerbern S. \"You Are a Priest Forever\" book review. Catholic Biblical Quarterly,  Oct 2009, Vol. 71 Issue 4, pp. 904–05. these and other conceptions did provide \"a precedent... to conceive Jesus similarly as a priest making atonement and eternal intercession in the heavenly sanctuary\".\n\nAuthorship \n\nBy the end of the first century there was not a consensus over the author’s identity. Clement of Rome, Barnabas, Paul the Apostle, and other names were proposed. Others later suggested Luke the Evangelist, Apollos and Priscilla as possible authors.Utley, R. J.: The Superiority of the New Covenant: Hebrews. Bible Lessons International;  Marshall, Texas: 1999, Volume 10, p. 3.\n\nThough no author is named, the original King James Version of the Bible titled the work \"The Epistle of Paul the Apostle to the Hebrews\". However, the KJV's attribution to Paul was only a guess, and is currently disputed by recent research. Its vastly different style, different theological focus, different spiritual experience, different Greek vocabulary – all are believed to make Paul's authorship of Hebrews increasingly indefensible. At present, neither modern scholarship nor church teaching ascribes Hebrews to Paul.\n\nBecause of its anonymity, it had some trouble being accepted as part of the Christian canon, being classed with the Antilegomena. Eventually it was accepted as scripture because of its sound theology, eloquent presentation, and other intrinsic factors. In antiquity, certain circles began to ascribe it to Paul in an attempt to provide the anonymous work an explicit apostolic pedigree.Attridge, Harold W.: Hebrews. Hermeneia; Philadelphia: Fortress, 1989, pp. 1–6.\n\nIn the 4th century, Jerome and Augustine of Hippo supported Paul's authorship: the Church largely agreed to include Hebrews as the fourteenth letter of Paul, and affirmed this authorship until the Reformation. Scholars argued that in the 13th Chapter of Hebrews, Timothy is referred to as a companion. Timothy was Paul's missionary companion in the same way Jesus sent disciples out in pairs of two. Also, the writer states that he wrote the letter from \"Italy\", which also at the time fits Paul.\"Introduction to the Letter to the Hebrews\". [http://www.mycrandall.ca/courses/NewTestament/Hebrews/Introduction.htm#I213] Accessed 17 Mar 2013 The difference in style is explained as simply an adjustment to a distinct audience, to the Jewish Christians who were being persecuted and pressured to go back to traditional Judaism.Hahn, Roger. \"The Book of Hebrews\". Christian Resource Institute. [http://www.crivoice.org/biblestudy/bbheb1.html] Accessed 17 Mar 2013]\nMany scholars now believe that the author was one of Paul's pupils or associates, citing stylistic differences between Hebrews and the other Pauline epistles.Fonck, Leopold. \"Epistle to the Hebrews\". The Catholic Encyclopedia.  Vol. 7. New York: Robert Appleton Company, 1910. Web: 30 Dec. 2009. Recent scholarship has favored the idea that the author was probably a leader of a predominantly Jewish congregation to whom he or she was writing.\n\nBelieving the author to have been Priscilla, Hoppin posits that the name was omitted either to suppress its female authorship, or to protect the letter itself from suppression.Hoppin, Ruth. Priscilla's Letter: Finding the Author of the Epistle to the Hebrews. Lost Coast Press, 2009. \n\nAlso convinced that Priscilla was the author of Hebrews, Gilbert Bilezikian, professor of biblical studies at Wheaton College, remarks on \"the conspiracy of anonymity in the ancient church,\" and reasons: \"The lack of any firm data concerning the identity of the author in the extant writings of the church suggests a deliberate blackout more than a case of collective loss of memory.\" \n\nA.J. Gordon ascribes the authorship of Hebrews to Priscilla, writing that \"It is evident that the Holy Spirit made this woman Priscilla a teacher of teachers\". Originally proposed by Adolf von Harnack in 1900,Adolph von Harnack, “Probabilia uber die Addresse und den Verfasser des Habraerbriefes, ” Zeitschrift für die Neutestamentliche Wissenschaft und die Kunde der älteren Kirche (E. Preuschen, Berlin: Forschungen und Fortschritte, 1900), 1:16–41. Harnack’s reasoning won the support of prominent Bible scholars of the early twentieth century. Harnack believes the letter was written in Rome – not to the Church, but to the inner circle. In setting forth his evidence for Priscillan authorship, he finds it amazing that the name of the author was blotted out by the earliest tradition. Citing , he says it was written by a person of \"high standing and apostolic teacher of equal rank with Timothy\". If Luke, Clemens, Barnabas, or Apollos had written it, Harnack believes their names would not have been obliterated.See Lee Anna Starr, The Bible Status of Woman. Zarephath, N.J.: Pillar of Fire, 1955, pp 187–82.\n\nDonald Guthrie’s commentary The Letter to the Hebrews (1983) mentions Priscilla by name as a suggested author.Donald Guthrie, The Letter to the Hebrews, Tyndale New Testament Commentaries, Grand Rapids, Mich.: Eerdmans, 1983, reprinted 1999, p. 21\n\nIn the 3rd century, Origen wrote of the letter, \"In the epistle entitled To The Hebrews the diction does not exhibit the characteristic roughness of speech or phraseology admitted by the Apostle [Paul] himself, the construction of the sentences is closer to the Greek usage, as anyone capable of recognising differences of style would agree. On the other hand the matter of the epistle is wonderful, and quite equal to the Apostle's acknowledged writings: the truth of this would be admitted by anyone who has read the Apostle carefully...If I were asked my personal opinion, I would say that the matter is the Apostle's but the phraseology and construction are those of someone who remembered the Apostle's teaching and wrote his own interpretation of what his master had said. So if any church regards this epistle as Paul's, it should be commended for so doing, for the primitive Church had every justification for handing it down as his. Who wrote the epistle is known to God alone: the accounts that have reached us suggest that it was either Clement, who became Bishop of Rome, or Luke, who wrote the gospel and the Acts.\"A. Louth ed. & G. A. Williamson trans. [Origen quoted in] Eusebius, The History of the Church (London: Penguin, 1989), 202 [book 6.25]. Further, \"Men of old have handed it down as Paul's, but who wrote the Epistle God only knows\".\n\nDate \n\nThe use of tabernacle terminology in Hebrews has been used to date the epistle before the destruction of the temple, the idea being that knowing about the destruction of both Jerusalem and the temple would have influenced the development of the author's overall argument. Therefore, the most probable date for its composition is the second half of the year 63 or the beginning of 64, according to the Catholic Encyclopedia.\n\nAudience \n\nTraditional scholars have argued the letter's audience was Jewish Christians, as early as the end of the 2nd century (hence its title, \"The Epistle to the Hebrews\"). Other scholars have suggested that Hebrews is part of an internal New Testament debate between the extreme Judaizers (who argued that non-Jews must convert to Judaism before they can receive the Holy Spirit of Jesus' new covenant) versus the extreme Antinomians (who argued that Jews must reject God's commandments and that Jewish law was no longer in effect). James and Paul represent the moderates of each faction, respectively, and Peter served as moderator.\"The Canon Debate\", McDonald & Sanders editors, 2002, chapter 32, p. 577, by James D. G. Dunn: \"For Peter was probably in fact and effect the bridge-man (pontifex maximus!) who did more than any other to hold together the diversity of first-century Christianity.  James the brother of Jesus and Paul, the two other most prominent leading figures in first-century Christianity, were too much identified with their respective \"brands\" of Christianity, at least in the eyes of Christians at the opposite ends of this particular spectrum. But Peter, as shown particularly by the Antioch episode in Gal 2, had both a care to hold firm to his Jewish heritage, which Paul lacked, and an openness to the demands of developing Christianity, which James lacked. John might have served as such a figure of the center holding together the extremes, but if the writings linked with his name are at all indicative of his own stance he was too much of an individualist to provide such a rallying point. Others could link the developing new religion more firmly to its founding events and to Jesus himself. But none of them, including the rest of the twelve, seem to have played any role of continuing significance for the whole sweep of Christianity—though James the brother of John might have proved an exception had he been spared\". [Italics original] The Epistle emphasizes that non-Jewish followers of Jesus do not need to convert to Judaism to share in all of God's promises to Jews.\n\nIt sets before the Jew the claims of Christianity – to bring the Jew to the full realization of the relation of Judaism to Christianity, to make clear that Christ has fulfilled those temporary and provisional institutions, and has thus abolished them.\"Introduction to Hebrews\". The New Analytical Bible and Dictionary of the Bible (KJV).  Chicago: John A. Dickson Publishing Co., 1950. p. 1387 This view is commonly referred to as Supersessionism.\n\nSome had stopped assembling together, and this was possibly due to persecution. \"Hebrews 1–8\", William L. Lane (Word Biblical Commentary, 1991), Introduction p. lvii \n\nPurpose for writing \n\nThose to whom Hebrews is written seem to have begun to doubt whether Jesus could really be the Messiah for whom they were waiting, because they believed the Messiah prophesied in the Hebrew Scriptures was to come as a militant king and destroy the enemies of his people. Jesus, however, came as a mere man who was arrested by the Jewish leaders and who suffered and even died under Roman crucifixion. And although he was seen resurrected, he still left the earth and his people, who now face persecution rather than victory. The book of Hebrews solves this problem by arguing that the Hebrew Scriptures also foretold that the Messiah would be a priest (although of a different sort than the traditional Levitical priests) and Jesus came to fulfill this role, as a sacrificial offering to God, to atone for sins. His role of a king is yet to come, and so those who follow him should be patient and not be surprised that they suffer for now.\n\nSome scholars today believe the document was written to prevent apostasy.See Whitlark, Jason, Enabling Fidelity to God: Perseverance in Hebrews in Light of the Reciprocity Systems of the Ancient Mediterranean World (PBMS; Carlisle: Paternoster Press, 2008). Some have interpreted apostasy to mean a number of different things, such as a group of Christians in one sect leaving for another more conservative sect, one of which the author disapproves. Some have seen apostasy as a move from the Christian assembly to pagan ritual. In light of a possibly Jewish-Christian audience, the apostasy in this sense may be in regard to Jewish-Christians leaving the Christian assembly to return to the Jewish synagogue. The author writes, \"Let us hold fast to our confession\".\n\nThe book could be argued to affirm special creation. It affirms that God by His Son, Jesus Christ, made the worlds. \"God...hath in these last days spoken unto us by his Son...by whom also he made the worlds\".  The epistle also states that the worlds themselves do not provide the evidence of how God formed them. \"Through faith we understand that the worlds were framed by the word of God, so that things which are seen were not made of things which do appear\".\n\nStyle \n\nHebrews is a very consciously \"literary\" document. The purity of its Greek was noted by Clement of Alexandria, according to Eusebius (Historia Eccl. , VI, xiv), and Origen of Alexandria asserted that every competent judge must recognize a great difference between this epistle and those of Paul (Eusebius, VI, xxv).\n\nThis letter consists of two strands: an expositional or doctrinal strand,      and a hortatory or strongly urgingalso translated \"exhorting\" strand which punctuates the exposition parenthetically at key points as warnings to the readers.    \n\nHebrews does not fit the form of a traditional Hellenistic epistle, lacking a proper prescript. Modern scholars generally believe this book was originally a sermon or homily, although possibly modified after it was delivered to include the travel plans, greetings and closing.  \n\nHebrews contains many references to the Old Testament – specifically to its Septuagint text.\n\nChristology \n\nFrom The Interpreter's Bible 1955\n\nWe may sum up our author’s Christology negatively by saying that he has nothing to do with the older Hebrew messianic hopes of a coming Son of David, who would be a divinely empowered human leader to bring in the kingdom of God on earth; and that while he still employs the figure of a militant, apocalyptic king ... who will come again..., this is not of the essence of his thought about Christ.\nPositively, our author presents Christ as divine in nature, and solves any possible objection to a divine being who participates in human experience, especially in the experience of death, by the priestly analogy. He seems quite unconscious of the logical difficulties of his position proceeding from the  that Christ is both divine and human, at least human in experience although hardly in nature.  TIB XI p. 588The Interpreter's Bible:  The Holy Scriptures in the King James and Revised Standard versions with general articles and introduction, exegesis, [and] exposition for each book of the Bible in twelve volumes, George Arthur Buttrick, Commentary Editor, Walter Russell Bowie, Associate Editor of Exposition, Paul Scherer, Associate Editor of Exposition, John Knox Associate Editor of New Testament Introduction and Exegesis, Samuel Terrien, Associate Editor of Old Testament Introduction and Exegesis, Nolan B. Harmon Editor, Abingdon Press, copyright 1955 by Pierce and Washabaugh, set up printed, and bound by the Parthenon Press, at Nashville, Tennessee, Volume XI, Philippians, Colossians, Thessalonians, Pastoral Epistles [The First and Second Epistles to Timothy, and the Epistle to Titus], Philemon, Hebrews [Introduction and Exegesis by John Knox]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Epistle to the Hebrews" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9901" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Epistle to the Hebrews, or Letter to the Hebrews, or in the Greek manuscripts, simply To the Hebrews ( Πρὸς Έβραίους)The Greek New Testament, Edited by Kurt Aland, Matthew Black, Carlo M. Martini, Bruce M. Metzger, and Allen Wikgren, in cooperation with the Institute for New Testament Textual Research, 2nd edition, United Bible Societies, 1973 is one of the books of the New Testament.\n\nThe text is traditionally attributed to  Paul the Apostle, but doubt on Pauline authorship is reported by Eusebius,\"some have rejected the Epistle to the Hebrews, saying that it is disputed by the church of Rome, on the ground that it was not written by Paul.\" Eusebius, Hist. Eccl. 3.3.5 ([http://www.ccel.org/ccel/schaff/npnf201.iii.viii.iii.html text]); cf. also 6.20.3 ([http://www.ccel.org/ccel/schaff/npnf201.iii.xi.xx.html text]). and modern biblical scholarship considers its authorship unknown,Alan C. Mitchell, Hebrews (Liturgical Press, 2007) p. 6. perhaps written in deliberate imitation of the style of Paul.Bart D. Ehrman, Forged: Writing in the Name of God – Why the Bible's Authors Are Not Who We Think They Are (HarperCollins, 2011) p. 23.Clare K. Rothschild, Hebrews as Pseudepigraphon: The History and Significance of the Pauline Attribution of Hebrews (Mohr Siebeck, 2009) p. 4.\n\nScholars of Greek consider its writing to be more polished and eloquent than any other book of the New Testament. The book has earned the reputation of being a masterpiece.Powell, Mark A. Introducing the New Testament: a historical, literary, and theological survey. Baker Academic, 2009.  It has also been described as an intricate New Testament book.Mackie, Scott D. Eschatology and Exhortation in the Epistle to the Hebrews. Tübingen: Mohr Siebeck, 2007.  Scholars believe it was written for Jewish Christians who lived in Jerusalem. Its purpose was to exhort Christians to persevere in the face of persecution. At this time, certain believers were considering turning back to Judaism (the Jewish system of law) to escape being persecuted for accepting Christ as their saviour, now following this system of grace (saved by Jesus' sacrifice on the cross). The theme of the epistle is the doctrine of the person of Christ and his role as mediator between God and humanity.\n\nThe epistle opens with an exaltation of Jesus as \"the radiance of God's glory, the express image of his being, and upholding all things by his powerful word\".  The epistle presents Jesus with the titles \"pioneer\" or \"forerunner\", \"Son\" and \"Son of God\", \"priest\" and \"high priest\".Mason, Eric F. You Are a Priest Forever: Second Temple Jewish Messianism and the Priestly Christology of the Epistle to the Hebrews. (STDJ 74; Leiden/Boston: Brill, 2008). \n\nThe epistle casts Jesus as both exalted Son and high priest, a unique dual Christology.Mackie, Scott D. \"Confession of the Son of God in the Exordium of Hebrews\". Journal for the Study of the New Testament,  30.4 (2008)\n\nComposition \n\nHebrews uses Old Testament quotations interpreted in light of first century rabbinical Judaism.Utley, R. J.: The Superiority of the New Covenant: Hebrews. Bible Lessons International; Marshall, Texas: 1999, Volume 10, p. 1. New Testament and Second Temple Judaism scholar Eric Mason argues that the conceptual background of the priestly Christology of the Epistle to the Hebrews closely parallels presentations of the messianic priest and Melchizedek in the Qumran scrolls.  In both Hebrews and Qumran a priestly figure is discussed in the context of a Davidic figure; in both cases a divine decree appoints the priests to their eschatological duty; both priestly figures offer an eschatological sacrifice of atonement. Although the author of Hebrews was not directly influenced by Qumran's \"Messiah of Aaron\",Oegema, Gerbern S. \"You Are a Priest Forever\" book review. Catholic Biblical Quarterly,  Oct 2009, Vol. 71 Issue 4, pp. 904–05. these and other conceptions did provide \"a precedent... to conceive Jesus similarly as a priest making atonement and eternal intercession in the heavenly sanctuary\".\n\nAuthorship \n\nBy the end of the first century there was not a consensus over the author’s identity. Clement of Rome, Barnabas, Paul the Apostle, and other names were proposed. Others later suggested Luke the Evangelist, Apollos and Priscilla as possible authors.Utley, R. J.: The Superiority of the New Covenant: Hebrews. Bible Lessons International;  Marshall, Texas: 1999, Volume 10, p. 3.\n\nThough no author is named, the original King James Version of the Bible titled the work \"The Epistle of Paul the Apostle to the Hebrews\". However, the KJV's attribution to Paul was only a guess, and is currently disputed by recent research. Its vastly different style, different theological focus, different spiritual experience, different Greek vocabulary – all are believed to make Paul's authorship of Hebrews increasingly indefensible. At present, neither modern scholarship nor church teaching ascribes Hebrews to Paul.\n\nBecause of its anonymity, it had some trouble being accepted as part of the Christian canon, being classed with the Antilegomena. Eventually it was accepted as scripture because of its sound theology, eloquent presentation, and other intrinsic factors. In antiquity, certain circles began to ascribe it to Paul in an attempt to provide the anonymous work an explicit apostolic pedigree.Attridge, Harold W.: Hebrews. Hermeneia; Philadelphia: Fortress, 1989, pp. 1–6.\n\nIn the 4th century, Jerome and Augustine of Hippo supported Paul's authorship: the Church largely agreed to include Hebrews as the fourteenth letter of Paul, and affirmed this authorship until the Reformation. Scholars argued that in the 13th Chapter of Hebrews, Timothy is referred to as a companion. Timothy was Paul's missionary companion in the same way Jesus sent disciples out in pairs of two. Also, the writer states that he wrote the letter from \"Italy\", which also at the time fits Paul.\"Introduction to the Letter to the Hebrews\". [http://www.mycrandall.ca/courses/NewTestament/Hebrews/Introduction.htm#I213] Accessed 17 Mar 2013 The difference in style is explained as simply an adjustment to a distinct audience, to the Jewish Christians who were being persecuted and pressured to go back to traditional Judaism.Hahn, Roger. \"The Book of Hebrews\". Christian Resource Institute. [http://www.crivoice.org/biblestudy/bbheb1.html] Accessed 17 Mar 2013]\nMany scholars now believe that the author was one of Paul's pupils or associates, citing stylistic differences between Hebrews and the other Pauline epistles.Fonck, Leopold. \"Epistle to the Hebrews\". The Catholic Encyclopedia.  Vol. 7. New York: Robert Appleton Company, 1910. Web: 30 Dec. 2009. Recent scholarship has favored the idea that the author was probably a leader of a predominantly Jewish congregation to whom he or she was writing.\n\nBelieving the author to have been Priscilla, Hoppin posits that the name was omitted either to suppress its female authorship, or to protect the letter itself from suppression.Hoppin, Ruth. Priscilla's Letter: Finding the Author of the Epistle to the Hebrews. Lost Coast Press, 2009. \n\nAlso convinced that Priscilla was the author of Hebrews, Gilbert Bilezikian, professor of biblical studies at Wheaton College, remarks on \"the conspiracy of anonymity in the ancient church,\" and reasons: \"The lack of any firm data concerning the identity of the author in the extant writings of the church suggests a deliberate blackout more than a case of collective loss of memory.\" \n\nA.J. Gordon ascribes the authorship of Hebrews to Priscilla, writing that \"It is evident that the Holy Spirit made this woman Priscilla a teacher of teachers\". Originally proposed by Adolf von Harnack in 1900,Adolph von Harnack, “Probabilia uber die Addresse und den Verfasser des Habraerbriefes, ” Zeitschrift für die Neutestamentliche Wissenschaft und die Kunde der älteren Kirche (E. Preuschen, Berlin: Forschungen und Fortschritte, 1900), 1:16–41. Harnack’s reasoning won the support of prominent Bible scholars of the early twentieth century. Harnack believes the letter was written in Rome – not to the Church, but to the inner circle. In setting forth his evidence for Priscillan authorship, he finds it amazing that the name of the author was blotted out by the earliest tradition. Citing , he says it was written by a person of \"high standing and apostolic teacher of equal rank with Timothy\". If Luke, Clemens, Barnabas, or Apollos had written it, Harnack believes their names would not have been obliterated.See Lee Anna Starr, The Bible Status of Woman. Zarephath, N.J.: Pillar of Fire, 1955, pp 187–82.\n\nDonald Guthrie’s commentary The Letter to the Hebrews (1983) mentions Priscilla by name as a suggested author.Donald Guthrie, The Letter to the Hebrews, Tyndale New Testament Commentaries, Grand Rapids, Mich.: Eerdmans, 1983, reprinted 1999, p. 21\n\nIn the 3rd century, Origen wrote of the letter, \"In the epistle entitled To The Hebrews the diction does not exhibit the characteristic roughness of speech or phraseology admitted by the Apostle [Paul] himself, the construction of the sentences is closer to the Greek usage, as anyone capable of recognising differences of style would agree. On the other hand the matter of the epistle is wonderful, and quite equal to the Apostle's acknowledged writings: the truth of this would be admitted by anyone who has read the Apostle carefully...If I were asked my personal opinion, I would say that the matter is the Apostle's but the phraseology and construction are those of someone who remembered the Apostle's teaching and wrote his own interpretation of what his master had said. So if any church regards this epistle as Paul's, it should be commended for so doing, for the primitive Church had every justification for handing it down as his. Who wrote the epistle is known to God alone: the accounts that have reached us suggest that it was either Clement, who became Bishop of Rome, or Luke, who wrote the gospel and the Acts.\"A. Louth ed. & G. A. Williamson trans. [Origen quoted in] Eusebius, The History of the Church (London: Penguin, 1989), 202 [book 6.25]. Further, \"Men of old have handed it down as Paul's, but who wrote the Epistle God only knows\".\n\nDate \n\nThe use of tabernacle terminology in Hebrews has been used to date the epistle before the destruction of the temple, the idea being that knowing about the destruction of both Jerusalem and the temple would have influenced the development of the author's overall argument. Therefore, the most probable date for its composition is the second half of the year 63 or the beginning of 64, according to the Catholic Encyclopedia.\n\nAudience \n\nTraditional scholars have argued the letter's audience was Jewish Christians, as early as the end of the 2nd century (hence its title, \"The Epistle to the Hebrews\"). Other scholars have suggested that Hebrews is part of an internal New Testament debate between the extreme Judaizers (who argued that non-Jews must convert to Judaism before they can receive the Holy Spirit of Jesus' new covenant) versus the extreme Antinomians (who argued that Jews must reject God's commandments and that Jewish law was no longer in effect). James and Paul represent the moderates of each faction, respectively, and Peter served as moderator.\"The Canon Debate\", McDonald & Sanders editors, 2002, chapter 32, p. 577, by James D. G. Dunn: \"For Peter was probably in fact and effect the bridge-man (pontifex maximus!) who did more than any other to hold together the diversity of first-century Christianity.  James the brother of Jesus and Paul, the two other most prominent leading figures in first-century Christianity, were too much identified with their respective \"brands\" of Christianity, at least in the eyes of Christians at the opposite ends of this particular spectrum. But Peter, as shown particularly by the Antioch episode in Gal 2, had both a care to hold firm to his Jewish heritage, which Paul lacked, and an openness to the demands of developing Christianity, which James lacked. John might have served as such a figure of the center holding together the extremes, but if the writings linked with his name are at all indicative of his own stance he was too much of an individualist to provide such a rallying point. Others could link the developing new religion more firmly to its founding events and to Jesus himself. But none of them, including the rest of the twelve, seem to have played any role of continuing significance for the whole sweep of Christianity—though James the brother of John might have proved an exception had he been spared\". [Italics original] The Epistle emphasizes that non-Jewish followers of Jesus do not need to convert to Judaism to share in all of God's promises to Jews.\n\nIt sets before the Jew the claims of Christianity – to bring the Jew to the full realization of the relation of Judaism to Christianity, to make clear that Christ has fulfilled those temporary and provisional institutions, and has thus abolished them.\"Introduction to Hebrews\". The New Analytical Bible and Dictionary of the Bible (KJV).  Chicago: John A. Dickson Publishing Co., 1950. p. 1387 This view is commonly referred to as Supersessionism.\n\nSome had stopped assembling together, and this was possibly due to persecution. \"Hebrews 1–8\", William L. Lane (Word Biblical Commentary, 1991), Introduction p. lvii \n\nPurpose for writing \n\nThose to whom Hebrews is written seem to have begun to doubt whether Jesus could really be the Messiah for whom they were waiting, because they believed the Messiah prophesied in the Hebrew Scriptures was to come as a militant king and destroy the enemies of his people. Jesus, however, came as a mere man who was arrested by the Jewish leaders and who suffered and even died under Roman crucifixion. And although he was seen resurrected, he still left the earth and his people, who now face persecution rather than victory. The book of Hebrews solves this problem by arguing that the Hebrew Scriptures also foretold that the Messiah would be a priest (although of a different sort than the traditional Levitical priests) and Jesus came to fulfill this role, as a sacrificial offering to God, to atone for sins. His role of a king is yet to come, and so those who follow him should be patient and not be surprised that they suffer for now.\n\nSome scholars today believe the document was written to prevent apostasy.See Whitlark, Jason, Enabling Fidelity to God: Perseverance in Hebrews in Light of the Reciprocity Systems of the Ancient Mediterranean World (PBMS; Carlisle: Paternoster Press, 2008). Some have interpreted apostasy to mean a number of different things, such as a group of Christians in one sect leaving for another more conservative sect, one of which the author disapproves. Some have seen apostasy as a move from the Christian assembly to pagan ritual. In light of a possibly Jewish-Christian audience, the apostasy in this sense may be in regard to Jewish-Christians leaving the Christian assembly to return to the Jewish synagogue. The author writes, \"Let us hold fast to our confession\".\n\nThe book could be argued to affirm special creation. It affirms that God by His Son, Jesus Christ, made the worlds. \"God...hath in these last days spoken unto us by his Son...by whom also he made the worlds\".  The epistle also states that the worlds themselves do not provide the evidence of how God formed them. \"Through faith we understand that the worlds were framed by the word of God, so that things which are seen were not made of things which do appear\".\n\nStyle \n\nHebrews is a very consciously \"literary\" document. The purity of its Greek was noted by Clement of Alexandria, according to Eusebius (Historia Eccl. , VI, xiv), and Origen of Alexandria asserted that every competent judge must recognize a great difference between this epistle and those of Paul (Eusebius, VI, xxv).\n\nThis letter consists of two strands: an expositional or doctrinal strand,      and a hortatory or strongly urgingalso translated \"exhorting\" strand which punctuates the exposition parenthetically at key points as warnings to the readers.    \n\nHebrews does not fit the form of a traditional Hellenistic epistle, lacking a proper prescript. Modern scholars generally believe this book was originally a sermon or homily, although possibly modified after it was delivered to include the travel plans, greetings and closing.  \n\nHebrews contains many references to the Old Testament – specifically to its Septuagint text.\n\nChristology \n\nFrom The Interpreter's Bible 1955\n\nWe may sum up our author’s Christology negatively by saying that he has nothing to do with the older Hebrew messianic hopes of a coming Son of David, who would be a divinely empowered human leader to bring in the kingdom of God on earth; and that while he still employs the figure of a militant, apocalyptic king ... who will come again..., this is not of the essence of his thought about Christ.\nPositively, our author presents Christ as divine in nature, and solves any possible objection to a divine being who participates in human experience, especially in the experience of death, by the priestly analogy. He seems quite unconscious of the logical difficulties of his position proceeding from the  that Christ is both divine and human, at least human in experience although hardly in nature.  TIB XI p. 588The Interpreter's Bible:  The Holy Scriptures in the King James and Revised Standard versions with general articles and introduction, exegesis, [and] exposition for each book of the Bible in twelve volumes, George Arthur Buttrick, Commentary Editor, Walter Russell Bowie, Associate Editor of Exposition, Paul Scherer, Associate Editor of Exposition, John Knox Associate Editor of New Testament Introduction and Exegesis, Samuel Terrien, Associate Editor of Old Testament Introduction and Exegesis, Nolan B. Harmon Editor, Abingdon Press, copyright 1955 by Pierce and Washabaugh, set up printed, and bound by the Parthenon Press, at Nashville, Tennessee, Volume XI, Philippians, Colossians, Thessalonians, Pastoral Epistles [The First and Second Epistles to Timothy, and the Epistle to Titus], Philemon, Hebrews [Introduction and Exegesis by John Knox]. Epistle to the Hebrews. http://en.wikipedia.org/?curid=9901."
  }
}
