{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1890",
  "eid" : "bc502c60-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778395686,
  "textBody" : "American English (AmE, AE, AmEng, USEng, en-US),en-US is the language code for U.S. English, as defined by ISO standards (see ISO 639-1 and ISO 3166-1 alpha-2) and Internet standards (see IETF language tag). sometimes called United States English or U.S. English,Plichta, Bartlomiej, and Dennis R. Preston (2005). \"The /ay/s Have It: The Perception of /ay/ as a North-South Stereotype in the United States English.\" Acta Linguistica Hafniensia 37.1: 107-130.Zentella, A. C. (1982). Spanish and English in contact in the United States: The Puerto Rican experience. Word, 33(1-2), 41. is the set of varieties of the English language native to the United States of America.\n\nEnglish is the most widely spoken language in the United States and is the common language used by the federal government, considered the de facto language of the country because of its widespread use but not established as the official language of the country, despite being given official status by 32 of the 50 state governments. As an example, while both Spanish and English have equivalent status in the local courts of Puerto Rico, under federal law, English is the official language for any matters being referred to the United States district court for the territory.\n\nThe use of English in the United States is a result of English and British colonization of the Americas. The first wave of English-speaking settlers arrived in North America during the 17th century, followed by further migrations in the 18th and 19th centuries. Since then, American English has developed into new dialects, in some cases under the influence of West African and Native American languages, German, Dutch, Irish, Spanish, and other languages of successive waves of immigrants to the United States.\n\nAny North American English accent perceived as free of noticeably local, ethnic, or cultural markers is popularly called \"General American\", described by sociolinguist William Labov as \"a fairly uniform broadcast standard in the mass media\". Otherwise, according to Labov, with the major exception of Southern American English, regional accents throughout the country are not yielding to this broadcast standard,Labov, William (2010). [http://www.cogsci.msu.edu/DSS/2011-2012/Labov/POLC%20Chapters%201-3.pdf The Politics of Language Change: Dialect Divergence in America]. The University of Virginia Press. Pre-publication draft. p. 55. and historical and present linguistic evidence does not support the notion of there being a single \"mainstream\" American accent.Labov, William (2012). Dialect diversity in America: The politics of language change. University of Virginia Press. pp. 1-2. On the contrary, the sound of American English continues to evolve, with some local accents disappearing, but several larger regional accents emerging.\n\nVarieties\n \n\nWhile written American English is (in general) standardized across the country, there are several recognizable variations in the spoken language, both in pronunciation and in vernacular vocabulary. The regional sounds of present-day American English are reportedly engaged in a complex phenomenon of \"both convergence and divergence\": some accents are homogenizing and levelling, while others are diversifying and deviating further away from one another.Labov, William. 2012. Dialect diversity in America: the politics of language change. Charlottesville: University of Virginia Press. In 2010, William Labov summarized the current state of regional American accents as follows:Labov, William (2010). [http://www.cogsci.msu.edu/DSS/2011-2012/Labov/POLC%20Chapters%201-3.pdf The Politics of Language Change: Dialect Divergence in America]. The University of Virginia Press. Pre-publication draft. p. 53-4.\n\nSome regional American English has undergone \"vigorous new sound changes\" since the mid-nineteenth century onwards, spawning relatively recent Mid-Atlantic (centered on Philadelphia and Baltimore), Western Pennsylvania (centered on Pittsburgh), Inland Northern (centered on Chicago, Detroit, and the Great Lakes region), Midland (centered on Indianapolis, Columbus, and Kansas City) and Western accents, all of which \"are now more different from each other than they were fifty or a hundred years ago.\" Meanwhile, the unique features of the Eastern New England (centered on Boston) and New York City accents appear to be stable. \"On the other hand, dialects of many smaller cities have receded in favor of the new regional patterns\"; for example, the traditional accents of Charleston and of Cincinnati have given way to the general Midland accent, and of St. Louis now approaches the sounds of an Inland Northern or Midland accent. At the same time, the Southern accent, despite its huge geographic coverage, \"is on the whole slowly receding due to cultural stigma: younger speakers everywhere in the South are shifting away from the marked features of Southern speech.\" Finally, the \"Hoi Toider\" dialect shows the paradox of receding among younger speakers in North Carolina's Outer Banks islands, yet strengthening in the islands of the Chesapeake Bay.\n\nMajor regional dialects of American English\n\n The map above shows the major regional dialects of American English (in all caps) plus smaller and more local dialects, as demarcated primarily by Labov et al.'s The Atlas of North American English, as well as the related Telsur Project's [http://www.ling.upenn.edu/phono_atlas/home.html#regional regional maps]. Any region may also contain speakers of a \"General American\" accent that resists the marked features of their region. Furthermore, this map does not account for speakers of ethnic or cultural varieties (such as African-American English, Chicano English, Cajun English, etc.). All regional American English, unless specifically stated otherwise, can be assumed to be rhotic, with the father–bother merger, Mary–marry–merry merger, and pre-nasal \"short a\" tensing.Dialects are considered \"rhotic\" if they pronounce the r sound in all historical environments, without ever \"dropping\" this sound. The father–bother merger is the pronunciation of the unrounded vowel variant (as in cot, lot, bother, etc.) the same as the vowel (as in spa, haha, Ma), causing words like con and Kahn and like sob and Saab to sound identical, with the vowel usually realized in the back or middle of the mouth as. Finally, most of the U.S. participates in a continuous nasal system of the \"short a\" vowel (in cat, trap, bath, etc.), causing to be pronounced with the tongue raised and with a glide quality (typically sounding like) particularly when before a nasal consonant; thus, mad is, but man is more like.\n\nBelow, eleven major American English accents are defined by their particular combinations of certain characteristics:\n\nEastern New England\n\nMarked New England speech is mostly associated with eastern New England, centering on Boston and Providence, and traditionally includes some notable degree of r-dropping (or non-rhoticity), as well as the back tongue positioning of the vowel (to) and the vowel (to). In and north of Boston, the sound is famously centralized or even fronted. Boston shows a cot–caught merger, while Providence keeps the same two vowels sharply distinct.\n\nNew York City\n\n \nNew York City English, which prevails in a relatively small but nationally recognizable dialect region in and around New York City (including Long Island and northeastern New Jersey). Its features include some notable degree of non-rhoticity and a locally unique short-a vowel pronunciation split. New York City English otherwise broadly follows Northern patterns, except that the vowel is fronted. The cot–caught merger is markedly resisted around New York City, as depicted in popular stereotypes like tawwk and cawwfee, with this  vowel being typically tensed and diphthongal.\n\nSouth\n\n \nMost older Southern speech along the Eastern seaboard was non-rhotic, though, today, all local Southern dialects are strongly rhotic, defined most recognizably by the vowel losing its gliding quality and approaching, the initiating event for the Southern Vowel Shift, which includes the famous \"Southern drawl\" that makes short front vowels into gliding vowels.\n\nInland North and North Central\n\nSince the mid-twentieth century, a distinctive new Northern speech pattern has developed near the Canadian border of the United States, centered on the central and eastern Great Lakes region (but only on the American side). Linguists call this region the \"Inland North\", as defined by its local Northern cities vowel shift—occurring in the same region whose \"standard Midwestern\" speech was the basis for General American in the mid-20th century (though prior to this recent vowel shift). The Inland North accent was famously sketched on the television show Saturday Night Lives \"Bill Swerski's Superfans\" segments. Many people view the \"North Central\" or \"Upper Midwestern\" accent from the stereotypical lens of the movie Fargo.https://www.mprnews.org/story/2015/12/11/how-to-talk-minnesotan-accents-fargo The North Central accent is characterized by influences from the German and Scandinavian settlers of the region (like \"yah\" for yes, pronounced similarly to \"ja\" in German, Norwegian and Swedish). In parts of Pennsylvania and Ohio, another dialect known as Pennsylvania Dutch English was also once spoken among the Pennsylvania Dutch community.\n\nMidland\n\nBetween the traditional American dialect areas of the \"North\" and \"South\" is what linguists have long called the \"Midland\". This geographically overlaps with some states situated in the lower Midwest. West of the Appalachian Mountains begins the broad zone of modern-day Midland speech . Its vocabulary has been divided into two discrete subdivisions, the \"North Midland\" that begins north of the Ohio River valley area, and the \"South Midland\" speech, which to the American ear has a slight trace of the \"Southern accent\" (especially due to some degree of glide weakening). The South Midland dialect follows the Ohio River in a generally southwesterly direction, moves across Arkansas and Oklahoma west of the Mississippi, and peters out in West Texas. Modern Midland speech is transitional regarding a presence or absence of the cot–caught merger. Historically, Pennsylvania was a home of the Midland dialect; however, this state of early English-speaking settlers has now largely split off into new dialect regions, with distinct Philadelphia and Pittsburgh dialects documented since the latter half of the twentieth century.\n\nWest\n\nA generalized Midland speech continues westward until becoming a somewhat internally diverse Western American English that unites the entire western half of the country. This Western dialect is mostly unified by a firm cot–caught merger and a conservatively backed pronunciation of the long oh sound in goat, toe, show, etc., but a fronted pronunciation of the long oo sound in goose, lose, tune, etc. Western speech itself contains such advanced sub-types as Pacific Northwest English and California English, with the native-speaker English of Mexican Americans also being a sub-type primarily of the Western dialect. The island state of Hawaii, though primarily English-speaking, is also home to a creole language known commonly as Hawaiian Pidgin, and some Hawaii residents speak English with a Pidgin-influenced accent.\n\nOther varieties\n\nAlthough no longer region-specific,Cf. Trudgill, p.42. African-American English, which remains prevalent particularly among working- and middle-class African Americans, has a close relationship to Southern dialects and has greatly influenced everyday speech of many Americans, including hip hop culture. The same aforementioned socioeconomic groups, but among Hispanic and Latino Americans, have also developed native-speaker varieties of English. The best-studied Latino Englishes are Chicano English, spoken in the West and Midwest, and New York Latino English, spoken in the New York metropolitan area. Additionally, ethnic varieties such as Yeshiva English and \"Yinglish\" are spoken by some American Jews, and Cajun Vernacular English by some Cajuns in southern Louisiana.\n\nPhonology\n\nCompared with English as spoken in England, North American EnglishNorth American English (Trudgill, p. 2) is a collective term used for the varieties of the English language that are spoken in both the United States and Canada. is more homogeneous, and any North American accent that exhibits a majority of the most common phonological features is known as \"General American.\" This section mostly refers to such widespread or mainstream pronunciation features that characterize American English.\n\nStudies on historical usage of English in both the United States and the United Kingdom suggest that spoken American English did not simply deviate away from period British English, but retained certain now-archaic features contemporary British English has since lost. One of these is the rhoticity common in most American accents, because in the 17th century, when English was brought to the Americas, most English in England was also rhotic. The preservation of rhoticity has been further supported by the influences of Hiberno-English, West Country English and Scottish English. In most varieties of North American English, the sound corresponding to the letter  is a postalveolar approximant or retroflex approximant rather than a trill or tap (as often heard, for example, in the English accents of Scotland or India). A unique \"bunched tongue\" variant of the approximant r sound is also associated with the United States, and seems particularly noticeable in the Midwest and South.A Handbook of Varieties of English, Bernd Kortmann & Edgar W. Schneider, Walter de Gruyter, 2004, p. 317.\n\nTraditionally, the \"East Coast\" comprises three or four major linguistically distinct regions, each of which possesses English varieties both distinct from each other as well as quite internally diverse: New England, the New York metropolitan area, the Mid-Atlantic states (centering on Philadelphia and Baltimore), and the Southern United States. The only r-dropping (or non-rhotic) regional accents of American English are all spoken along the East Coast, except the Mid-Atlantic region, because these areas were in close historical contact with England and imitated prestigious varieties of English at a time when these were undergoing changes;Trudgill, pp. 46–47. in particular, the London prestige of non-rhoticity (or dropping the  sound, except before vowels) from the 17th century onwards, which is now widespread throughout most of England. Today, non-rhoticity is confined in the United States to the accents of eastern New England, the former plantation South, New York City, and African-American English (though the vowel-consonant cluster found in \"bird\", \"work\", \"hurt\", \"learn\", etc. usually retains its r pronunciation today, even in these non-rhotic accents). Other than these varieties, American accents are rhotic, pronouncing every instance of the  sound.\n\nMany British accents have evolved in other ways compared to which General American English has remained relatively more conservative, for example, regarding the typical southern British features of a trap–bath split, fronting of, and H-dropping, none of which typical American accents show. The innovation of /t/ glottaling, which does occur before a consonant (including a syllabic coronal nasal consonant, like in the words button or satin) and word-finally in General American, additionally occurs variably between vowels in British English. On the other hand, General American is more innovative than the dialects of England, or English elsewhere in the world, in a number of its own ways:\n\n* The merger of and, making father and bother rhyme. This change, known as the father–bother merger is in a transitional or completed stage nearly universally in North American English. Exceptions are in northeastern New England English, such as the Boston accent, New York City English, Philadelphia English, Baltimore English, and many Southern dialects, such as the Yat dialect.Labov et al. (2006), p. 171.\n* About half of all Americans merge of the vowels and. This is the so-called cot–caught merger, where words like cot and caught are homophones. This change has occurred most firmly in eastern New England (Boston area), Greater Pittsburgh, and the whole western half of the country.\n* For speakers who do not merge caught and cot, the lot–cloth split has taken hold. This change took place prior to the unrounding of the cot.  It is the result of the lengthening and raising of the cot vowel, merging with the caught vowel in many cases before voiceless fricatives (as in cloth, off), which is also found in some varieties of British English, as well as before (as in strong, long), usually in gone, often in on, and irregularly before (log, hog, dog, fog).\n* The strut vowel, rather than the lot or thought vowel, is used in the function words was, of, from, what, everybody, nobody, somebody, anybody, and, for some speakers, because and want, when stressed.According to Merriam-Webster Collegiate Dictionary, Eleventh Edition.\n* Vowel mergers before intervocalic: The Mary–marry–merry, serious–Sirius, and hurry–furry mergers are found in most American English dialects.  However, exceptions exist primarily along the east coast.\n** Americans vary slightly in their pronunciations of R-colored vowels—such as those in and—sometimes monophthongizing towards and or tensing towards and respectively, causing pronunciations like for pair/pear and for peer/pier. Also, is often reduced to, so that cure, pure, and mature may all end with the sound, thus rhyming with blur and sir. The word sure is also part of this rhyming set as it is commonly pronounced.\n* Dropping of is much more extensive than in most of England. In most North American accents, is dropped after all alveolar and interdental consonants (i.e. everywhere except after /p/, /b/, /f/, /h/, /k/, and /m/) so that new, duke, Tuesday, presume are pronounced,,,. \n* /æ/ tensing in environments that vary widely from accent to accent. With most American speakers, for whom the phoneme operates under a somewhat continuous system, has both a tense and a lax allophone (with a kind of \"continuum\" of possible sounds between those two extremes, rather than a definitive split). In these accents, is overall realized before nasal stops as more tense (approximately), while other environments are more lax (approximately the standard); for example, note the vowel sound in for mass, but for man). In some American accents, though, specifically those from Baltimore, Philadelphia, and New York City, and are entirely separate (or \"split\") phonemes, for example, in planet vs. plan it. This is often called the Mid-Atlantic split-a system. Note that these vowels move in the opposite direction in the mouth compared to the backed British \"broad A\"; this phenomenon has been noted as related to the increasingly rare phenomenon of older speakers of the eastern New England (Boston) area for whom changes to before alone or when preceded by a homorganic nasal.\n\n* Flapping of intervocalic and to alveolar tap before unstressed vowels (as in butter, party) and syllabic (bottle), as well as at the end of a word or morpheme before any vowel (what else, whatever). Thus, for most speakers, pairs such as ladder/latter, metal/medal, and coating/coding are pronounced the same, except with the stressed (see below).\n* Canadian raising of: many speakers split the sound based on its presence before either a voiceless or voiced consonant, so that in writer it is pronounced but in rider it is pronounced (because is a voiceless consonant while is voiced). This is a form of Canadian raising but, unlike more extreme forms of that process, does not affect. In many areas and idiolects, a distinction between what elsewhere become homophones through this process is maintained by vowel lengthening in the vowel preceding the formerly voiced consonant, e.g., for \"writer\" as opposed to for \"rider\".\n** Many speakers in the Inland North, North Central American English, and Philadelphia dialect areas raise before voiced consonants in certain words as well, particularly, and. Hence, words like tiny, spider, cider, tiger, dinosaur, cyber-, beside, idle (but sometimes not idol), and fire may contain a raised nucleus. The use of rather than in such words is unpredictable from phonetic environment alone, though it may have to do with their acoustic similarity to other words that do contain before a voiceless consonant, per the traditional Canadian-raising system. Hence, some researchers have argued that there has been a phonemic split in these dialects; the distribution of the two sounds is becoming more unpredictable among younger speakers.\n*L-velarization: England's typical distinction between a \"clear L\" (i.e. l (IPA)|) and a \"dark L\" (i.e. velarized alveolar lateral approximant| or sometimes even Velar lateral approximant|) is much less noticeable in nearly all dialects of American English; it may even be altogether absent. Instead, most U.S. speakers pronounce all \"L\" sounds with a tendency to be \"dark\", meaning with some degree of velarization. The only notable exceptions to this are in some Spanish-influenced U.S. English varieties (such as East Coast Latino English, which typically shows a clear \"L\" in syllable onsets); in New York City English, where the is clear in prevocalic positions; and in older, moribund Southern speech of the U.S., where \"L\" is clear in an intervocalic environment between front vowels.A Handbook of Varieties of English, Bernd Kortmann & Edgar W. Schneider, Walter de Gruyter, 2004, p. 319.\n* Both intervocalic and may commonly be realized as or simply, making winter and winner homophones in fast or non-careful speech.\n*The vowel in unstressed syllables generally merges with (weak-vowel merger), so effect is pronounced like affect.\n\nSome mergers found in most varieties of both American and British English include:\n*Horse–hoarse merger, making the vowels and before 'r' homophones, with homophonous pairs like horse/hoarse, corps/core, for/four, morning/mourning, war/wore, etc. homophones.\n*Wine–whine merger, making pairs like wine/whine, wet/whet, Wales/whales, wear/where, etc. homophones, in most cases eliminating, the voiceless labiovelar fricative. Many older varieties of southern and western American English still keep these distinct, but the merger appears to be spreading.\n\nVocabulary\n\nThe process of coining new lexical items started as soon as English-speaking British-American colonists began borrowing names for unfamiliar flora, fauna, and topography from the Native American languages. Examples of such names are opossum, raccoon, squash, moose (from Algonquian), wigwam, and moccasin. The languages of the other colonizing nations also added to the American vocabulary; for instance, cookie, from Dutch; kindergarten from German, levee from French; and rodeo from Spanish. Landscape features are often loanwords from French or Spanish, and the word corn, used in England to refer to wheat (or any cereal), came to denote the maize plant, the most important crop in the U.S. \n\nMost Mexican Spanish contributions came after the War of 1812, with the opening of the West, like ranch (now a common house style). New forms of dwelling created new terms (lot, waterfront) and types of homes like log cabin, adobe in the 18th century; apartment, shanty in the 19th century; project, condominium, townhouse, mobile home in the 20th century; and parts thereof (driveway, breezeway, backyard). Industry and material innovations from the 19th century onwards provide distinctive new words, phrases, and idioms through railroading (see further at rail terminology) and transportation terminology, ranging from types of roads (dirt roads, freeways) to infrastructure (parking lot, overpass, rest area), to automotive terminology often now standard in English internationally.A few of these are now chiefly found, or have been more productive, outside the U.S.; for example, jump, \"to drive past a traffic signal\"; block meaning \"building\", and center, \"central point in a town\" or \"main area for a particular activity\" (cf. Oxford English Dictionary). Already existing English words—such as store, shop, lumber—underwent shifts in meaning; others remained in the U.S. while changing in Britain. From the world of business and finance came new terms (merger, downsize, bottom line), from sports and gambling terminology came, specific jargon aside, common everyday American idioms, including many idioms related to baseball. The names of some American inventions remained largely confined to North America (elevator, gasoline) as did certain automotive terms (truck, trunk).\n\nNew foreign loanwords came with 19th and early 20th century European immigration to the U.S.; notably, from Yiddish (chutzpah, schmooze) and German (hamburger, wiener).Trudgill, Peter (2004). New-Dialect Formation: The Inevitability of Colonial Englishes. A large number of English colloquialisms from various periods are American in origin; some have lost their American flavor (from OK and cool to nerd and 24/7), while others have not (have a nice day, for sure); many are now distinctly old-fashioned (swell, groovy). Some English words now in general use, such as hijacking, disc jockey, boost, bulldoze and jazz, originated as American slang. \n\nAmerican English has always shown a marked tendency to use nouns as verbs.Trudgill, p. 69. Examples of nouns that are now also verbs are interview, advocate, vacuum, lobby, pressure, rear-end, transition, feature, profile, spearhead, skyrocket, showcase, bad-mouth, vacation, major, and many others. Compounds coined in the U.S. are for instance foothill, landslide (in all senses), backdrop, teenager,\nbrainstorm, bandwagon, hitchhike, smalltime, and a huge number of others. Some are euphemistic (human resources, affirmative action, correctional facility). Many compound nouns have the verb-and-preposition combination: stopover, lineup, tryout, spin-off, shootout, holdup, hideout, comeback, makeover, and many more. Some prepositional and phrasal verbs are in fact of American origin (win out, hold up, back up/off/down/out, face up to and many others).British author George Orwell (in English People, 1947, cited in OED s.v. lose) criticized an alleged \"American tendency\" to \"burden every verb with a preposition that adds nothing to its meaning (win out, lose out, face up to, etc.)\".\n\nNoun endings such as -ee (retiree), -ery (bakery), -ster (gangster) and -cian (beautician) are also particularly productive in the U.S. Several verbs ending in -ize are of U.S. origin; for example, fetishize, prioritize, burglarize, accessorize, weatherize, etc; and so are some back-formations (locate, fine-tune, curate, donate, emote, upholster and enthuse). Among syntactical constructions that arose are outside of, headed for, meet up with, back of, etc. Americanisms formed by alteration of some existing words include notably pesky, phony, rambunctious, buddy, sundae, skeeter, sashay and kitty-corner. Adjectives that arose in the U.S. are, for example, lengthy, bossy, cute and cutesy, punk (in all senses), sticky (of the weather), through (as in \"finished\"), and many colloquial forms such as peppy or wacky. \n\nA number of words and meanings that originated in Middle English or Early Modern English and that have been in everyday use in the United States have since disappeared in most varieties of British English; some of these have cognates in Lowland Scots. Terms such as fall (\"autumn\"), faucet (\"tap\"), diaper (\"nappy\"), candy (\"sweets\"), skillet, eyeglasses, and obligate are often regarded as Americanisms. Fall for example came to denote the season in 16th century England, a contraction of Middle English expressions like \"fall of the leaf\" and \"fall of the year\". Gotten (past participle of get) is often considered to be largely an Americanism..A Handbook of Varieties of English, Bernd Kortmann & Edgar W. Schneider, Walter de Gruyter, 2004, p. 115. Other words and meanings were brought back to Britain from the U.S., especially in the second half of the 20th century; these include hire (\"to employ\"), I guess (famously criticized by H. W. Fowler), baggage, hit (a place), and the adverbs overly and presently (\"currently\"). Some of these, for example, monkey wrench and wastebasket, originated in 19th century Britain. The adjectives mad meaning \"angry\", smart meaning \"intelligent\", and sick meaning \"ill\" are also more frequent in American (and Irish) English than British English.\n\nLinguist Bert Vaux created a survey, completed in 2003, polling English speakers across the United States about their specific everyday word choices, hoping to identify regionalisms.Vaux, Bert and Scott Golder. 2003. [http://dialect.redlog.net/ The Harvard Dialect Survey]. Cambridge, MA: Harvard University Linguistics Department. The study found that most Americans prefer the term sub for a long sandwich, soda (but pop in the Great Lakes region and generic coke in the South) for a sweet and bubbly soft drink,Katz, Joshua (2013). \"[http://www4.ncsu.edu/~jakatz2/files/dialectposter.png Beyond 'Soda, Pop, or Coke].' North Carolina State University. you or you guys for the plural of you (but y'all in the South), sneakers for athletic shoes (but often tennis shoes outside the Northeast), and shopping cart for a cart used for carrying supermarket goods.\n\nDifferences between British and American English\n\nAmerican English and British English (BrE) often differ at the levels of phonology, phonetics, vocabulary, and, to a much lesser extent, grammar and orthography.\nThe first large American dictionary, An American Dictionary of the English Language, known as Webster's Dictionary, was written by Noah Webster in 1828, codifying several of these spellings.\n\nDifferences in grammar are relatively minor, and do not normally affect mutual intelligibility; these include: different use of some auxiliary verbs; formal (rather than notional) agreement with collective nouns; different preferences for the past forms of a few verbs (for example, AmE/BrE: learned/learnt, burned/burnt, snuck/sneaked, dove/dived) although the purportedly \"British\" forms can occasionally be seen in American English writing as well; different prepositions and adverbs in certain contexts (for example, AmE in school, BrE at school); and whether or not a definite article is used, in very few cases (AmE to the hospital, BrE to hospital; contrast, however, AmE actress Elizabeth Taylor, BrE the actress Elizabeth Taylor). Often, these differences are a matter of relative preferences rather than absolute rules; and most are not stable, since the two varieties are constantly influencing each other,Algeo, John (2006). British or American English?. Cambridge: Cambridge University Press. . and American English is not a standardized set of dialects.\n\nDifferences in orthography are also minor. The main differences are that American English usually uses spellings such as flavor for British flavour, fiber for fibre, defense for defence, analyze for analyse, license for licence, catalog for catalogue and traveling for travelling. Noah Webster popularized such spellings in America, but he did not invent most of them. Rather, \"he chose already existing options [...] on such grounds as simplicity, analogy or etymology\".Algeo, John. \"The Effects of the Revolution on Language\", in A Companion to the American Revolution. John Wiley & Sons, 2008. p.599 Other differences are due to the francophile tastes of the 19th century Victorian era Britain (for example they preferred programme for program, manoeuvre for maneuver, cheque for check, etc.).Peters, Pam (2004). The Cambridge Guide to English Usage. Cambridge: Cambridge University Press. , pp. 34 and 511. AmE almost always uses -ize in words like realize. BrE prefers -ise, but also uses -ize on occasion (see Oxford spelling).\n\nThere are a few differences in punctuation rules. British English is more tolerant of run-on sentences, called \"comma splices\" in American English, and American English requires that periods and commas be placed inside closing quotation marks even in cases in which British rules would place them outside. American English also favors the double quotation mark over single.\n\nAmE sometimes favors words that are morphologically more complex, whereas BrE uses clipped forms, such as AmE transportation and BrE transport or where the British form is a back-formation, such as AmE burglarize and BrE burgle (from burglar). However, while individuals usually use one or the other, both forms will be widely understood and mostly used alongside each other within the two systems.\n\nBritish English also differs from American English in that \"schedule\" can be pronounced with either [sk] or [ʃ].",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "American English" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1890" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "American English (AmE, AE, AmEng, USEng, en-US),en-US is the language code for U.S. English, as defined by ISO standards (see ISO 639-1 and ISO 3166-1 alpha-2) and Internet standards (see IETF language tag). sometimes called United States English or U.S. English,Plichta, Bartlomiej, and Dennis R. Preston (2005). \"The /ay/s Have It: The Perception of /ay/ as a North-South Stereotype in the United States English.\" Acta Linguistica Hafniensia 37.1: 107-130.Zentella, A. C. (1982). Spanish and English in contact in the United States: The Puerto Rican experience. Word, 33(1-2), 41. is the set of varieties of the English language native to the United States of America.\n\nEnglish is the most widely spoken language in the United States and is the common language used by the federal government, considered the de facto language of the country because of its widespread use but not established as the official language of the country, despite being given official status by 32 of the 50 state governments. As an example, while both Spanish and English have equivalent status in the local courts of Puerto Rico, under federal law, English is the official language for any matters being referred to the United States district court for the territory.\n\nThe use of English in the United States is a result of English and British colonization of the Americas. The first wave of English-speaking settlers arrived in North America during the 17th century, followed by further migrations in the 18th and 19th centuries. Since then, American English has developed into new dialects, in some cases under the influence of West African and Native American languages, German, Dutch, Irish, Spanish, and other languages of successive waves of immigrants to the United States.\n\nAny North American English accent perceived as free of noticeably local, ethnic, or cultural markers is popularly called \"General American\", described by sociolinguist William Labov as \"a fairly uniform broadcast standard in the mass media\". Otherwise, according to Labov, with the major exception of Southern American English, regional accents throughout the country are not yielding to this broadcast standard,Labov, William (2010). [http://www.cogsci.msu.edu/DSS/2011-2012/Labov/POLC%20Chapters%201-3.pdf The Politics of Language Change: Dialect Divergence in America]. The University of Virginia Press. Pre-publication draft. p. 55. and historical and present linguistic evidence does not support the notion of there being a single \"mainstream\" American accent.Labov, William (2012). Dialect diversity in America: The politics of language change. University of Virginia Press. pp. 1-2. On the contrary, the sound of American English continues to evolve, with some local accents disappearing, but several larger regional accents emerging.\n\nVarieties\n \n\nWhile written American English is (in general) standardized across the country, there are several recognizable variations in the spoken language, both in pronunciation and in vernacular vocabulary. The regional sounds of present-day American English are reportedly engaged in a complex phenomenon of \"both convergence and divergence\": some accents are homogenizing and levelling, while others are diversifying and deviating further away from one another.Labov, William. 2012. Dialect diversity in America: the politics of language change. Charlottesville: University of Virginia Press. In 2010, William Labov summarized the current state of regional American accents as follows:Labov, William (2010). [http://www.cogsci.msu.edu/DSS/2011-2012/Labov/POLC%20Chapters%201-3.pdf The Politics of Language Change: Dialect Divergence in America]. The University of Virginia Press. Pre-publication draft. p. 53-4.\n\nSome regional American English has undergone \"vigorous new sound changes\" since the mid-nineteenth century onwards, spawning relatively recent Mid-Atlantic (centered on Philadelphia and Baltimore), Western Pennsylvania (centered on Pittsburgh), Inland Northern (centered on Chicago, Detroit, and the Great Lakes region), Midland (centered on Indianapolis, Columbus, and Kansas City) and Western accents, all of which \"are now more different from each other than they were fifty or a hundred years ago.\" Meanwhile, the unique features of the Eastern New England (centered on Boston) and New York City accents appear to be stable. \"On the other hand, dialects of many smaller cities have receded in favor of the new regional patterns\"; for example, the traditional accents of Charleston and of Cincinnati have given way to the general Midland accent, and of St. Louis now approaches the sounds of an Inland Northern or Midland accent. At the same time, the Southern accent, despite its huge geographic coverage, \"is on the whole slowly receding due to cultural stigma: younger speakers everywhere in the South are shifting away from the marked features of Southern speech.\" Finally, the \"Hoi Toider\" dialect shows the paradox of receding among younger speakers in North Carolina's Outer Banks islands, yet strengthening in the islands of the Chesapeake Bay.\n\nMajor regional dialects of American English\n\n The map above shows the major regional dialects of American English (in all caps) plus smaller and more local dialects, as demarcated primarily by Labov et al.'s The Atlas of North American English, as well as the related Telsur Project's [http://www.ling.upenn.edu/phono_atlas/home.html#regional regional maps]. Any region may also contain speakers of a \"General American\" accent that resists the marked features of their region. Furthermore, this map does not account for speakers of ethnic or cultural varieties (such as African-American English, Chicano English, Cajun English, etc.). All regional American English, unless specifically stated otherwise, can be assumed to be rhotic, with the father–bother merger, Mary–marry–merry merger, and pre-nasal \"short a\" tensing.Dialects are considered \"rhotic\" if they pronounce the r sound in all historical environments, without ever \"dropping\" this sound. The father–bother merger is the pronunciation of the unrounded vowel variant (as in cot, lot, bother, etc.) the same as the vowel (as in spa, haha, Ma), causing words like con and Kahn and like sob and Saab to sound identical, with the vowel usually realized in the back or middle of the mouth as. Finally, most of the U.S. participates in a continuous nasal system of the \"short a\" vowel (in cat, trap, bath, etc.), causing to be pronounced with the tongue raised and with a glide quality (typically sounding like) particularly when before a nasal consonant; thus, mad is, but man is more like.\n\nBelow, eleven major American English accents are defined by their particular combinations of certain characteristics:\n\nEastern New England\n\nMarked New England speech is mostly associated with eastern New England, centering on Boston and Providence, and traditionally includes some notable degree of r-dropping (or non-rhoticity), as well as the back tongue positioning of the vowel (to) and the vowel (to). In and north of Boston, the sound is famously centralized or even fronted. Boston shows a cot–caught merger, while Providence keeps the same two vowels sharply distinct.\n\nNew York City\n\n \nNew York City English, which prevails in a relatively small but nationally recognizable dialect region in and around New York City (including Long Island and northeastern New Jersey). Its features include some notable degree of non-rhoticity and a locally unique short-a vowel pronunciation split. New York City English otherwise broadly follows Northern patterns, except that the vowel is fronted. The cot–caught merger is markedly resisted around New York City, as depicted in popular stereotypes like tawwk and cawwfee, with this  vowel being typically tensed and diphthongal.\n\nSouth\n\n \nMost older Southern speech along the Eastern seaboard was non-rhotic, though, today, all local Southern dialects are strongly rhotic, defined most recognizably by the vowel losing its gliding quality and approaching, the initiating event for the Southern Vowel Shift, which includes the famous \"Southern drawl\" that makes short front vowels into gliding vowels.\n\nInland North and North Central\n\nSince the mid-twentieth century, a distinctive new Northern speech pattern has developed near the Canadian border of the United States, centered on the central and eastern Great Lakes region (but only on the American side). Linguists call this region the \"Inland North\", as defined by its local Northern cities vowel shift—occurring in the same region whose \"standard Midwestern\" speech was the basis for General American in the mid-20th century (though prior to this recent vowel shift). The Inland North accent was famously sketched on the television show Saturday Night Lives \"Bill Swerski's Superfans\" segments. Many people view the \"North Central\" or \"Upper Midwestern\" accent from the stereotypical lens of the movie Fargo.https://www.mprnews.org/story/2015/12/11/how-to-talk-minnesotan-accents-fargo The North Central accent is characterized by influences from the German and Scandinavian settlers of the region (like \"yah\" for yes, pronounced similarly to \"ja\" in German, Norwegian and Swedish). In parts of Pennsylvania and Ohio, another dialect known as Pennsylvania Dutch English was also once spoken among the Pennsylvania Dutch community.\n\nMidland\n\nBetween the traditional American dialect areas of the \"North\" and \"South\" is what linguists have long called the \"Midland\". This geographically overlaps with some states situated in the lower Midwest. West of the Appalachian Mountains begins the broad zone of modern-day Midland speech . Its vocabulary has been divided into two discrete subdivisions, the \"North Midland\" that begins north of the Ohio River valley area, and the \"South Midland\" speech, which to the American ear has a slight trace of the \"Southern accent\" (especially due to some degree of glide weakening). The South Midland dialect follows the Ohio River in a generally southwesterly direction, moves across Arkansas and Oklahoma west of the Mississippi, and peters out in West Texas. Modern Midland speech is transitional regarding a presence or absence of the cot–caught merger. Historically, Pennsylvania was a home of the Midland dialect; however, this state of early English-speaking settlers has now largely split off into new dialect regions, with distinct Philadelphia and Pittsburgh dialects documented since the latter half of the twentieth century.\n\nWest\n\nA generalized Midland speech continues westward until becoming a somewhat internally diverse Western American English that unites the entire western half of the country. This Western dialect is mostly unified by a firm cot–caught merger and a conservatively backed pronunciation of the long oh sound in goat, toe, show, etc., but a fronted pronunciation of the long oo sound in goose, lose, tune, etc. Western speech itself contains such advanced sub-types as Pacific Northwest English and California English, with the native-speaker English of Mexican Americans also being a sub-type primarily of the Western dialect. The island state of Hawaii, though primarily English-speaking, is also home to a creole language known commonly as Hawaiian Pidgin, and some Hawaii residents speak English with a Pidgin-influenced accent.\n\nOther varieties\n\nAlthough no longer region-specific,Cf. Trudgill, p.42. African-American English, which remains prevalent particularly among working- and middle-class African Americans, has a close relationship to Southern dialects and has greatly influenced everyday speech of many Americans, including hip hop culture. The same aforementioned socioeconomic groups, but among Hispanic and Latino Americans, have also developed native-speaker varieties of English. The best-studied Latino Englishes are Chicano English, spoken in the West and Midwest, and New York Latino English, spoken in the New York metropolitan area. Additionally, ethnic varieties such as Yeshiva English and \"Yinglish\" are spoken by some American Jews, and Cajun Vernacular English by some Cajuns in southern Louisiana.\n\nPhonology\n\nCompared with English as spoken in England, North American EnglishNorth American English (Trudgill, p. 2) is a collective term used for the varieties of the English language that are spoken in both the United States and Canada. is more homogeneous, and any North American accent that exhibits a majority of the most common phonological features is known as \"General American.\" This section mostly refers to such widespread or mainstream pronunciation features that characterize American English.\n\nStudies on historical usage of English in both the United States and the United Kingdom suggest that spoken American English did not simply deviate away from period British English, but retained certain now-archaic features contemporary British English has since lost. One of these is the rhoticity common in most American accents, because in the 17th century, when English was brought to the Americas, most English in England was also rhotic. The preservation of rhoticity has been further supported by the influences of Hiberno-English, West Country English and Scottish English. In most varieties of North American English, the sound corresponding to the letter  is a postalveolar approximant or retroflex approximant rather than a trill or tap (as often heard, for example, in the English accents of Scotland or India). A unique \"bunched tongue\" variant of the approximant r sound is also associated with the United States, and seems particularly noticeable in the Midwest and South.A Handbook of Varieties of English, Bernd Kortmann & Edgar W. Schneider, Walter de Gruyter, 2004, p. 317.\n\nTraditionally, the \"East Coast\" comprises three or four major linguistically distinct regions, each of which possesses English varieties both distinct from each other as well as quite internally diverse: New England, the New York metropolitan area, the Mid-Atlantic states (centering on Philadelphia and Baltimore), and the Southern United States. The only r-dropping (or non-rhotic) regional accents of American English are all spoken along the East Coast, except the Mid-Atlantic region, because these areas were in close historical contact with England and imitated prestigious varieties of English at a time when these were undergoing changes;Trudgill, pp. 46–47. in particular, the London prestige of non-rhoticity (or dropping the  sound, except before vowels) from the 17th century onwards, which is now widespread throughout most of England. Today, non-rhoticity is confined in the United States to the accents of eastern New England, the former plantation South, New York City, and African-American English (though the vowel-consonant cluster found in \"bird\", \"work\", \"hurt\", \"learn\", etc. usually retains its r pronunciation today, even in these non-rhotic accents). Other than these varieties, American accents are rhotic, pronouncing every instance of the  sound.\n\nMany British accents have evolved in other ways compared to which General American English has remained relatively more conservative, for example, regarding the typical southern British features of a trap–bath split, fronting of, and H-dropping, none of which typical American accents show. The innovation of /t/ glottaling, which does occur before a consonant (including a syllabic coronal nasal consonant, like in the words button or satin) and word-finally in General American, additionally occurs variably between vowels in British English. On the other hand, General American is more innovative than the dialects of England, or English elsewhere in the world, in a number of its own ways:\n\n* The merger of and, making father and bother rhyme. This change, known as the father–bother merger is in a transitional or completed stage nearly universally in North American English. Exceptions are in northeastern New England English, such as the Boston accent, New York City English, Philadelphia English, Baltimore English, and many Southern dialects, such as the Yat dialect.Labov et al. (2006), p. 171.\n* About half of all Americans merge of the vowels and. This is the so-called cot–caught merger, where words like cot and caught are homophones. This change has occurred most firmly in eastern New England (Boston area), Greater Pittsburgh, and the whole western half of the country.\n* For speakers who do not merge caught and cot, the lot–cloth split has taken hold. This change took place prior to the unrounding of the cot.  It is the result of the lengthening and raising of the cot vowel, merging with the caught vowel in many cases before voiceless fricatives (as in cloth, off), which is also found in some varieties of British English, as well as before (as in strong, long), usually in gone, often in on, and irregularly before (log, hog, dog, fog).\n* The strut vowel, rather than the lot or thought vowel, is used in the function words was, of, from, what, everybody, nobody, somebody, anybody, and, for some speakers, because and want, when stressed.According to Merriam-Webster Collegiate Dictionary, Eleventh Edition.\n* Vowel mergers before intervocalic: The Mary–marry–merry, serious–Sirius, and hurry–furry mergers are found in most American English dialects.  However, exceptions exist primarily along the east coast.\n** Americans vary slightly in their pronunciations of R-colored vowels—such as those in and—sometimes monophthongizing towards and or tensing towards and respectively, causing pronunciations like for pair/pear and for peer/pier. Also, is often reduced to, so that cure, pure, and mature may all end with the sound, thus rhyming with blur and sir. The word sure is also part of this rhyming set as it is commonly pronounced.\n* Dropping of is much more extensive than in most of England. In most North American accents, is dropped after all alveolar and interdental consonants (i.e. everywhere except after /p/, /b/, /f/, /h/, /k/, and /m/) so that new, duke, Tuesday, presume are pronounced,,,. \n* /æ/ tensing in environments that vary widely from accent to accent. With most American speakers, for whom the phoneme operates under a somewhat continuous system, has both a tense and a lax allophone (with a kind of \"continuum\" of possible sounds between those two extremes, rather than a definitive split). In these accents, is overall realized before nasal stops as more tense (approximately), while other environments are more lax (approximately the standard); for example, note the vowel sound in for mass, but for man). In some American accents, though, specifically those from Baltimore, Philadelphia, and New York City, and are entirely separate (or \"split\") phonemes, for example, in planet vs. plan it. This is often called the Mid-Atlantic split-a system. Note that these vowels move in the opposite direction in the mouth compared to the backed British \"broad A\"; this phenomenon has been noted as related to the increasingly rare phenomenon of older speakers of the eastern New England (Boston) area for whom changes to before alone or when preceded by a homorganic nasal.\n\n* Flapping of intervocalic and to alveolar tap before unstressed vowels (as in butter, party) and syllabic (bottle), as well as at the end of a word or morpheme before any vowel (what else, whatever). Thus, for most speakers, pairs such as ladder/latter, metal/medal, and coating/coding are pronounced the same, except with the stressed (see below).\n* Canadian raising of: many speakers split the sound based on its presence before either a voiceless or voiced consonant, so that in writer it is pronounced but in rider it is pronounced (because is a voiceless consonant while is voiced). This is a form of Canadian raising but, unlike more extreme forms of that process, does not affect. In many areas and idiolects, a distinction between what elsewhere become homophones through this process is maintained by vowel lengthening in the vowel preceding the formerly voiced consonant, e.g., for \"writer\" as opposed to for \"rider\".\n** Many speakers in the Inland North, North Central American English, and Philadelphia dialect areas raise before voiced consonants in certain words as well, particularly, and. Hence, words like tiny, spider, cider, tiger, dinosaur, cyber-, beside, idle (but sometimes not idol), and fire may contain a raised nucleus. The use of rather than in such words is unpredictable from phonetic environment alone, though it may have to do with their acoustic similarity to other words that do contain before a voiceless consonant, per the traditional Canadian-raising system. Hence, some researchers have argued that there has been a phonemic split in these dialects; the distribution of the two sounds is becoming more unpredictable among younger speakers.\n*L-velarization: England's typical distinction between a \"clear L\" (i.e. l (IPA)|) and a \"dark L\" (i.e. velarized alveolar lateral approximant| or sometimes even Velar lateral approximant|) is much less noticeable in nearly all dialects of American English; it may even be altogether absent. Instead, most U.S. speakers pronounce all \"L\" sounds with a tendency to be \"dark\", meaning with some degree of velarization. The only notable exceptions to this are in some Spanish-influenced U.S. English varieties (such as East Coast Latino English, which typically shows a clear \"L\" in syllable onsets); in New York City English, where the is clear in prevocalic positions; and in older, moribund Southern speech of the U.S., where \"L\" is clear in an intervocalic environment between front vowels.A Handbook of Varieties of English, Bernd Kortmann & Edgar W. Schneider, Walter de Gruyter, 2004, p. 319.\n* Both intervocalic and may commonly be realized as or simply, making winter and winner homophones in fast or non-careful speech.\n*The vowel in unstressed syllables generally merges with (weak-vowel merger), so effect is pronounced like affect.\n\nSome mergers found in most varieties of both American and British English include:\n*Horse–hoarse merger, making the vowels and before 'r' homophones, with homophonous pairs like horse/hoarse, corps/core, for/four, morning/mourning, war/wore, etc. homophones.\n*Wine–whine merger, making pairs like wine/whine, wet/whet, Wales/whales, wear/where, etc. homophones, in most cases eliminating, the voiceless labiovelar fricative. Many older varieties of southern and western American English still keep these distinct, but the merger appears to be spreading.\n\nVocabulary\n\nThe process of coining new lexical items started as soon as English-speaking British-American colonists began borrowing names for unfamiliar flora, fauna, and topography from the Native American languages. Examples of such names are opossum, raccoon, squash, moose (from Algonquian), wigwam, and moccasin. The languages of the other colonizing nations also added to the American vocabulary; for instance, cookie, from Dutch; kindergarten from German, levee from French; and rodeo from Spanish. Landscape features are often loanwords from French or Spanish, and the word corn, used in England to refer to wheat (or any cereal), came to denote the maize plant, the most important crop in the U.S. \n\nMost Mexican Spanish contributions came after the War of 1812, with the opening of the West, like ranch (now a common house style). New forms of dwelling created new terms (lot, waterfront) and types of homes like log cabin, adobe in the 18th century; apartment, shanty in the 19th century; project, condominium, townhouse, mobile home in the 20th century; and parts thereof (driveway, breezeway, backyard). Industry and material innovations from the 19th century onwards provide distinctive new words, phrases, and idioms through railroading (see further at rail terminology) and transportation terminology, ranging from types of roads (dirt roads, freeways) to infrastructure (parking lot, overpass, rest area), to automotive terminology often now standard in English internationally.A few of these are now chiefly found, or have been more productive, outside the U.S.; for example, jump, \"to drive past a traffic signal\"; block meaning \"building\", and center, \"central point in a town\" or \"main area for a particular activity\" (cf. Oxford English Dictionary). Already existing English words—such as store, shop, lumber—underwent shifts in meaning; others remained in the U.S. while changing in Britain. From the world of business and finance came new terms (merger, downsize, bottom line), from sports and gambling terminology came, specific jargon aside, common everyday American idioms, including many idioms related to baseball. The names of some American inventions remained largely confined to North America (elevator, gasoline) as did certain automotive terms (truck, trunk).\n\nNew foreign loanwords came with 19th and early 20th century European immigration to the U.S.; notably, from Yiddish (chutzpah, schmooze) and German (hamburger, wiener).Trudgill, Peter (2004). New-Dialect Formation: The Inevitability of Colonial Englishes. A large number of English colloquialisms from various periods are American in origin; some have lost their American flavor (from OK and cool to nerd and 24/7), while others have not (have a nice day, for sure); many are now distinctly old-fashioned (swell, groovy). Some English words now in general use, such as hijacking, disc jockey, boost, bulldoze and jazz, originated as American slang. \n\nAmerican English has always shown a marked tendency to use nouns as verbs.Trudgill, p. 69. Examples of nouns that are now also verbs are interview, advocate, vacuum, lobby, pressure, rear-end, transition, feature, profile, spearhead, skyrocket, showcase, bad-mouth, vacation, major, and many others. Compounds coined in the U.S. are for instance foothill, landslide (in all senses), backdrop, teenager,\nbrainstorm, bandwagon, hitchhike, smalltime, and a huge number of others. Some are euphemistic (human resources, affirmative action, correctional facility). Many compound nouns have the verb-and-preposition combination: stopover, lineup, tryout, spin-off, shootout, holdup, hideout, comeback, makeover, and many more. Some prepositional and phrasal verbs are in fact of American origin (win out, hold up, back up/off/down/out, face up to and many others).British author George Orwell (in English People, 1947, cited in OED s.v. lose) criticized an alleged \"American tendency\" to \"burden every verb with a preposition that adds nothing to its meaning (win out, lose out, face up to, etc.)\".\n\nNoun endings such as -ee (retiree), -ery (bakery), -ster (gangster) and -cian (beautician) are also particularly productive in the U.S. Several verbs ending in -ize are of U.S. origin; for example, fetishize, prioritize, burglarize, accessorize, weatherize, etc; and so are some back-formations (locate, fine-tune, curate, donate, emote, upholster and enthuse). Among syntactical constructions that arose are outside of, headed for, meet up with, back of, etc. Americanisms formed by alteration of some existing words include notably pesky, phony, rambunctious, buddy, sundae, skeeter, sashay and kitty-corner. Adjectives that arose in the U.S. are, for example, lengthy, bossy, cute and cutesy, punk (in all senses), sticky (of the weather), through (as in \"finished\"), and many colloquial forms such as peppy or wacky. \n\nA number of words and meanings that originated in Middle English or Early Modern English and that have been in everyday use in the United States have since disappeared in most varieties of British English; some of these have cognates in Lowland Scots. Terms such as fall (\"autumn\"), faucet (\"tap\"), diaper (\"nappy\"), candy (\"sweets\"), skillet, eyeglasses, and obligate are often regarded as Americanisms. Fall for example came to denote the season in 16th century England, a contraction of Middle English expressions like \"fall of the leaf\" and \"fall of the year\". Gotten (past participle of get) is often considered to be largely an Americanism..A Handbook of Varieties of English, Bernd Kortmann & Edgar W. Schneider, Walter de Gruyter, 2004, p. 115. Other words and meanings were brought back to Britain from the U.S., especially in the second half of the 20th century; these include hire (\"to employ\"), I guess (famously criticized by H. W. Fowler), baggage, hit (a place), and the adverbs overly and presently (\"currently\"). Some of these, for example, monkey wrench and wastebasket, originated in 19th century Britain. The adjectives mad meaning \"angry\", smart meaning \"intelligent\", and sick meaning \"ill\" are also more frequent in American (and Irish) English than British English.\n\nLinguist Bert Vaux created a survey, completed in 2003, polling English speakers across the United States about their specific everyday word choices, hoping to identify regionalisms.Vaux, Bert and Scott Golder. 2003. [http://dialect.redlog.net/ The Harvard Dialect Survey]. Cambridge, MA: Harvard University Linguistics Department. The study found that most Americans prefer the term sub for a long sandwich, soda (but pop in the Great Lakes region and generic coke in the South) for a sweet and bubbly soft drink,Katz, Joshua (2013). \"[http://www4.ncsu.edu/~jakatz2/files/dialectposter.png Beyond 'Soda, Pop, or Coke].' North Carolina State University. you or you guys for the plural of you (but y'all in the South), sneakers for athletic shoes (but often tennis shoes outside the Northeast), and shopping cart for a cart used for carrying supermarket goods.\n\nDifferences between British and American English\n\nAmerican English and British English (BrE) often differ at the levels of phonology, phonetics, vocabulary, and, to a much lesser extent, grammar and orthography.\nThe first large American dictionary, An American Dictionary of the English Language, known as Webster's Dictionary, was written by Noah Webster in 1828, codifying several of these spellings.\n\nDifferences in grammar are relatively minor, and do not normally affect mutual intelligibility; these include: different use of some auxiliary verbs; formal (rather than notional) agreement with collective nouns; different preferences for the past forms of a few verbs (for example, AmE/BrE: learned/learnt, burned/burnt, snuck/sneaked, dove/dived) although the purportedly \"British\" forms can occasionally be seen in American English writing as well; different prepositions and adverbs in certain contexts (for example, AmE in school, BrE at school); and whether or not a definite article is used, in very few cases (AmE to the hospital, BrE to hospital; contrast, however, AmE actress Elizabeth Taylor, BrE the actress Elizabeth Taylor). Often, these differences are a matter of relative preferences rather than absolute rules; and most are not stable, since the two varieties are constantly influencing each other,Algeo, John (2006). British or American English?. Cambridge: Cambridge University Press. . and American English is not a standardized set of dialects.\n\nDifferences in orthography are also minor. The main differences are that American English usually uses spellings such as flavor for British flavour, fiber for fibre, defense for defence, analyze for analyse, license for licence, catalog for catalogue and traveling for travelling. Noah Webster popularized such spellings in America, but he did not invent most of them. Rather, \"he chose already existing options [...] on such grounds as simplicity, analogy or etymology\".Algeo, John. \"The Effects of the Revolution on Language\", in A Companion to the American Revolution. John Wiley & Sons, 2008. p.599 Other differences are due to the francophile tastes of the 19th century Victorian era Britain (for example they preferred programme for program, manoeuvre for maneuver, cheque for check, etc.).Peters, Pam (2004). The Cambridge Guide to English Usage. Cambridge: Cambridge University Press. , pp. 34 and 511. AmE almost always uses -ize in words like realize. BrE prefers -ise, but also uses -ize on occasion (see Oxford spelling).\n\nThere are a few differences in punctuation rules. British English is more tolerant of run-on sentences, called \"comma splices\" in American English, and American English requires that periods and commas be placed inside closing quotation marks even in cases in which British rules would place them outside. American English also favors the double quotation mark over single.\n\nAmE sometimes favors words that are morphologically more complex, whereas BrE uses clipped forms, such as AmE transportation and BrE transport or where the British form is a back-formation, such as AmE burglarize and BrE burgle (from burglar). However, while individuals usually use one or the other, both forms will be widely understood and mostly used alongside each other within the two systems.\n\nBritish English also differs from American English in that \"schedule\" can be pronounced with either [sk] or [ʃ]. American English. http://en.wikipedia.org/?curid=1890."
  }
}
