{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5322",
  "eid" : "d3fc3390-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778435401,
  "textBody" : "Czechoslovakia, or Czecho-Slovakia (; Czech and , Česko-Slovensko,.), was a sovereign state in Central Europe that existed from October 1918, when it declared its independence from the Austro-Hungarian Empire, until its peaceful dissolution into the :Czech Republic and :Slovakia on 1 January 1993.\n\nFrom 1939 to 1945, following its forced division and partial incorporation into Nazi Germany, the state did not de facto exist but its government-in-exile continued to operate.\n\nFrom 1948 to 1990, Czechoslovakia was part of the Soviet bloc with a command economy. Its economic status was formalized in membership of Comecon from 1949 and its defense status in the Warsaw Pact of May 1955. A period of political liberalization in 1968, known as the Prague Spring, was forcibly ended when the Soviet Union, assisted by several other Warsaw Pact countries, invaded. In 1989, as Marxist–Leninist governments and communism were ending all over Europe, Czechoslovaks peacefully deposed their government in the Velvet Revolution; state price controls were removed after a period of preparation. In 1993, Czechoslovakia split into the two sovereign states of the Czech Republic and Slovakia.\n\nCharacteristics\n\n;Form of state\n*1918–1938: A democratic republic.\n*1938–1939: After annexation of Sudetenland by Nazi Germany in 1938, the region gradually turned into a state with loosened connections among the Czech, Slovak, and Ruthenian parts. A large strip of southern Slovakia and Carpatho-Ukraine was annexed by Hungary, and the Zaolzie region was annexed by Poland.\n*1939–1945: The region was split into the Protectorate of Bohemia and Moravia and the Slovak Republic. A government-in-exile continued to exist in London, supported by the United Kingdom, United States and its Allies; after the German invasion of Russia, it was also recognised by the Soviet Union. Czechoslovakia adhered to the Declaration by United Nations and was a founding member of the United Nations.\n*1946–1948: The country was governed by a coalition government with communist ministers, including the prime minister and the minister of interior. Carpathian Ruthenia was ceded to the Soviet Union.\n*1948–1989: The country became a socialist state under Soviet domination with a centrally planned economy. In 1960, the country officially became a socialist republic, the Czechoslovak Socialist Republic. It was a satellite state of the Soviet Union.\n*1989–1990: The federal republic consisted of the Czech Socialist Republic and the Slovak Socialist Republic.\n*1990–1992: Following the Velvet Revolution, the state was renamed the Czech and Slovak Federal Republic, consisting of the Czech Republic and the Slovak Republic.\n\n;Neighbours\n*Austria 1918–1938, 1945–1992\n*Germany (Both predecessors, West Germany and East Germany, were neighbors between 1949 and 1990.)\n*Hungary\n*Poland\n*Romania 1918–1938\n*Soviet Union 1945–1991\n*Ukraine 1991–1992\n\n;Topography\nThe country was of generally irregular terrain. The western area was part of the north-central European uplands. The eastern region was composed of the northern reaches of the Carpathian Mountains and lands of the Danube River basin.\n\n;Climate\nThe weather is mild winters and mild summers. Influenced by the Atlantic Ocean from the west, Baltic Sea from the north, and Mediterranean Sea from the south. There is no continental weather.\n\nOfficial names\n\n*1918–1920: Republic of Czechoslovakia (abbreviated ČSR)/Czecho-Slovak State, or Czecho-Slovakia/Czechoslovakia\n*1920–1938: Czechoslovak Republic (ČSR), or Czechoslovakia\n*1938–1939: Czecho-Slovak Republic, or Czecho-Slovakia\n*1945–1960: Czechoslovak Republic (ČSR), or Czechoslovakia\n*1960–1990: Czechoslovak Socialist Republic (ČSSR), or Czechoslovakia\n*April 1990: Czechoslovak Federative Republic (Czech version) and Czecho-Slovak Federative Republic (Slovak version)\n**The country subsequently became the Czech and Slovak Federative Republic, ČSFR, or Československo (Czech version) and Česko-Slovensko (Slovak version).\n\nHistory\n\nOrigins\n\nThe area was long a part of the Austro-Hungarian Empire until the empire collapsed at the end of World War I. The new state was founded by Tomáš Garrigue Masaryk (1850–1937), who served as its first president from 14 November 1918 to 14 December 1935. He was succeeded by his close ally, Edvard Beneš (1884–1948).\n\nThe roots of Czech nationalism go back to the 19th century, when philologists and educators, influenced by Romanticism, promoted the Czech language and pride in the Czech people. Nationalism became a mass movement in the second half of the 19th century. Taking advantage of the limited opportunities for participation in political life under Austrian rule, Czech leaders such as historian František Palacký (1798–1876) founded many patriotic, self-help organizations which provided a chance for many of their compatriots to participate in communal life prior to independence. Palacký supported Austro-Slavism and worked for a reorganized and federal Austrian Empire, which would protect the Slavic speaking peoples of Central Europe against Russian and German threats.\n\nAn advocate of democratic reform and Czech autonomy within Austria-Hungary, Masaryk was elected twice to the Reichsrat (Austrian Parliament), first from 1891 to 1893 for the Young Czech Party, and again from 1907 to 1914 for the Czech Realist Party, which he had founded in 1889 with Karel Kramář and Josef Kaizl.\n\nDuring World War I small numbers of Czechs, the Czechoslovak Legions, fought with the Allies in France and Italy, while large numbers deserted to Russia in exchange for its support for the independence of Czechoslovakia from the Austrian Empire. With the outbreak of World War I, Masaryk began working for Czech independence in a union with Slovakia. With Edvard Beneš and Milan Rastislav Štefánik, Masaryk visited several Western countries and won support from influential publicists.Z. A. B. Zeman, The Masaryks: The Making of Czechoslovakia (1976)\n\nBohemia and Moravia, under Austrian rule, were Czech-speaking industrial centres, while Slovakia, which was part of the Kingdom of Hungary, was an undeveloped agrarian region. Conditions were much better for the development of a mass national movement in the Czech lands than in Slovakia. Nevertheless, the two regions united and created a new nation.\n\nFirst Czechoslovak Republic\n\nFormation\n\nThe Bohemian Kingdom ceased to exist in 1918 when it was incorporated into Czechoslovakia. Czechoslovakia was founded in October 1918, as one of the successor states of the Austro-Hungarian Empire at the end of World War I and as part of the Treaty of Saint-Germain-en-Laye. It consisted of the present day territories of Bohemia, Moravia, Slovakia and Carpathian Ruthenia. Its territory included some of the most industrialized regions of the former Austria-Hungary.\n\nEthnicity \n\nThe new country was a multi-ethnic state. The population consisted of Czechs (51%), Slovaks (16%), Germans (22%), Hungarians (5%) and Rusyns (4%).\"The War of the World\", Niall Ferguson Allen Lane 2006. Many of the Germans, Hungarians, Ruthenians and Poles, Prague Post, 6 July 2005 and some Slovaks, felt oppressed because the political elite did not generally allow political autonomy for minority ethnic groups. This policy, combined with increasing Nazi propaganda especially in the industrialized German-speaking Sudetenland, led to unrest among the non-Czech population.\n\nThe state proclaimed the official ideology that there are no Czechs and Slovaks, but only one nation of Czechoslovaks (see Czechoslovakism), to the disagreement of Slovaks and other ethnic groups. Once a unified Czechoslovakia was restored after World War II (after the country had been divided during the war), the conflict between the Czechs and the Slovaks surfaced again. The governments of Czechoslovakia and other eastern European nations deported ethnic Germans to the West, reducing the presence of minorities in the nation. Most of the Jews had been killed during the war by the Nazis and their allies.\n\n*Jews identified themselves as Germans or Hungarians (and Jews only by religion not ethnicity), the sum is, therefore, more than 100%.\n\nInterwar period\n\nDuring the period between the two world wars, democracy thrived in Czechoslovakia. Of all the new states established in central Europe after 1918, only Czechoslovakia preserved a democratic government until the war broke out. The persistence of democracy suggests that Czechoslovakia was better prepared to maintain democracy than were other countries in the region. Thus, despite regional disparities, its level of development was much higher than that of neighboring states. The population was generally literate, and contained fewer alienated groups. The influence of these conditions was augmented by the political values of Czechoslovakia's leaders and the policies they adopted. Under Tomas Masaryk, Czech and Slovak politicians promoted progressive social and economic conditions that served to defuse discontent.\n\nForeign minister Beneš became the prime architect of the Czechoslovak-Romanian-Yugoslav alliance (the \"Little Entente\", 1921–38) directed against Hungarian attempts to reclaim lost areas. Beneš worked closely with France. Far more dangerous was the German element, which after 1933 became allied with the Nazis in Germany. The increasing feeling of inferiority among the Slovaks, who were hostile to the more numerous Czechs, weakened the country in the late 1930s. Many Slovaks supported an extreme nationalist movement and welcomed the puppet Slovak state set up under Hitler's control in 1939.\n\nAfter 1933, Czechoslovakia remained the only democracy in central and eastern Europe. \n\nMunich Agreement, and Two-Step German Occupation\n\nIn September 1938, Adolf Hitler demanded control of the Sudetenland. On 29 September 1938, Britain and France ceded control in the Appeasement at the Munich Conference; France ignored the military alliance it had with Czechoslovakia. During October 1938, Nazi Germany occupied and annexed the Sudetenland border region, effectively crippling Czechoslovak defences.\n\nOn 15 March 1939, the remainder (\"rump\") of Czechoslovakia was invaded and divided into the Protectorate of Bohemia and Moravia and the puppet Slovak State.\n\nMuch of Slovakia and all of Carpathian Ruthenia were annexed by Hungary. Poland occupied Zaolzie, an area whose population was majority Polish, in October 1938.\n\nThe eventual goal of the German state under Nazi leadership was to eradicate Czech nationality through assimilation, deportation, and extermination of the Czech intelligentsia; the intellectual elites and middle class made up a considerable number of the 200,000 people who passed through concentration camps and the 250,000 who died during German occupation.Universities in the Nineteenth and Early Twentieth Centuries (1800–1945), Walter Rüegg Cambridge University Press (28 October 2004), page 353 Under Generalplan Ost, it was assumed that around 50% Czechs would be fit for Germanization. The Czech intellectual elites were to be removed not only from Czech territories but from Europe completely. The authors of Generalplan Ost believed it would be best if they emigrated overseas, as even in Siberia they were considered a threat to German rule. Just like Jews, Poles, Serbs, and several other nations, Czechs were considered to be untermenschen by the Nazi state. In 1940, in a secret Nazi plan for the Germanization of the Protectorate of Bohemia and Moravia it was declared that those considered to be of racially Mongoloid origin and the Czech intelligentsia were not to be Germanized.\n\nThe deportation of Jews to concentration camps was organized under the direction of Reinhard Heydrich, and the fortress town of Terezín was made into a ghetto way station for Jewish families. On 4 June 1942 Heydrich died after being wounded by an assassin in Operation Anthropoid. Heydrich's successor, Colonel General Kurt Daluege, ordered mass arrests and executions and the destruction of the villages of Lidice and Ležáky. In 1943 the German war effort was accelerated. Under the authority of Karl Hermann Frank, German minister of state for Bohemia and Moravia, some 350,000 Czech laborers were dispatched to the Reich. Within the protectorate, all non-war-related industry was prohibited. Most of the Czech population obeyed quiescently up until the final months preceding the end of the war, while thousands were involved in the resistance movement.\n\nFor the Czechs of the Protectorate Bohemia and Moravia, German occupation was a period of brutal oppression. Czech losses resulting from political persecution and deaths in concentration camps totaled between 36,000 and 55,000. The Jewish population of Bohemia and Moravia (118,000 according to the 1930 census) was virtually annihilated. Many Jews emigrated after 1939; more than 70,000 were killed; 8,000 survived at Terezín. Several thousand Jews managed to live in freedom or in hiding throughout the occupation.\n\nDespite the estimated 136,000 deaths at the hands of the Nazi regime, the population in the Reichsprotektorate saw a net increase during the war years of approximately 250,000 in line with an increased birth rate.\"Vaclav Havel – A Political Tragedy in 6 Acts\" by John Keane, published 2000, page 54\n\nOn 3 May 1945, the third US Army of General Patton entered Pilsen from the south west. On 9 May 1945, Soviet Red Army troops entered Prague.\n\nSocialist Czechoslovakia\n\nAfter World War II, pre-war Czechoslovakia was re-established, with the exception of Subcarpathian Ruthenia, which was annexed by the Soviet Union and incorporated into the Ukrainian Soviet Socialist Republic. The Beneš decrees were promulgated concerning ethnic Germans (see Potsdam Agreement) and ethnic Hungarians. Under the decrees, citizenship was abrogated for people of German and Hungarian ethnic origin who had accepted German or Hungarian citizenship during the occupations. In 1948, this provision was cancelled for the Hungarians, but only partially for the Germans. The government then confiscated the property of the Germans and expelled about 90% of the ethnic German population, over 2 million people. Those who remained were collectively accused of supporting the Nazis after the Munich Agreement, as 97.32% of Sudeten Germans had voted for the NSDAP in the December 1938 elections. Almost every decree explicitly stated that the sanctions did not apply to antifascists. Some 250,000 Germans, many married to Czechs, some antifascists, and also those required for the post-war reconstruction of the country, remained in Czechoslovakia. The Beneš Decrees still cause controversy among nationalist groups in the Czech Republic, Germany, Austria and Hungary.[http://www.law.nyu.edu/eecr/vol11num1_2/special/rupnik.html East European Constitutional Review] \n\nCarpathian Ruthenia (Podkarpatská Rus) was occupied by (and in June 1945 formally ceded to) the Soviet Union. In the 1946 parliamentary election, the Communist Party of Czechoslovakia was the winner in the Czech lands, and the Democratic Party won in Slovakia. In February 1948 the Communists seized power. Although they would maintain the fiction of political pluralism through the existence of the National Front, except for a short period in the late 1960s (the Prague Spring) the country had no liberal democracy. Since citizens lacked significant electoral methods of registering protest against government policies, periodically there were street protests that became violent. For example, there were riots in the town of Plzeň in 1953, reflecting economic discontent. Police and army units put down the rebellion, and hundreds were injured but no one was killed. While its economy remained more advanced than those of its neighbors in Eastern Europe, Czechoslovakia grew increasingly economically weak relative to Western Europe.\n\nIn 1968, when the reformer Alexander Dubček was appointed to the key post of First Secretary of the Czechoslovak Communist Party, there was a brief period of liberalization known as the Prague Spring. In response, after failing to persuade the Czechoslovak leaders to change course, five other Eastern Bloc members of the Warsaw Pact invaded. Soviet tanks rolled into Czechoslovakia on the night of 20–21 August 1968.[http://www.upi.com/Audio/Year_in_Review/Events-of-1968/N.-Korea-Seize-U.S.-Ship/12303153093431-9/#title \"Russia Invades Czechoslovakia: 1968 Year in Review, UPI.com\"]  The General Secretary of the Soviet Communist Party Leonid Brezhnev viewed this intervention as vital for the preservation of the Soviet, socialist system and vowed to intervene in any state that sought to replace Marxism-Leninism with capitalism.John Lewis Gaddis, The Cold War: A New History (New York: The Penguin Press), 150. In the week after the invasion there was a spontaneous campaign of civil resistance against the occupation. This resistance involved a wide range of acts of non-cooperation and defiance: this was followed by a period in which the Czechoslovak Communist Party leadership, having been forced in Moscow to make concessions to the Soviet Union, gradually put the brakes on their earlier liberal policies.Philip WIndsor and Adam Roberts, Czechoslovakia 1968: Reform, Repression and Resistance (London: Chatto & Windus, 1969), pp. 97–143. In April 1969 Dubček was finally dismissed from the First Secretaryship of the Czechoslovak Communist Party. Meanwhile, one plank of the reform program had been carried out: in 1968-9, Czechoslovakia was turned into a federation of the Czech Socialist Republic and Slovak Socialist Republic. The theory was that under the federation, social and economic inequities between the Czech and Slovak halves of the state would be largely eliminated. A number of ministries, such as education, now became two formally equal bodies in the two formally equal republics. However, the centralised political control by the Czechoslovak Communist Party severely limited the effects of federalization.\n\nThe 1970s saw the rise of the dissident movement in Czechoslovakia, represented among others by Václav Havel. The movement sought greater political participation and expression in the face of official disapproval, manifested in limitations on work activities, which went as far as a ban on professional employment, the refusal of higher education for the dissidents' children, police harassment and prison.\n\nAfter 1989\n\nIn 1989, the Velvet Revolution restored democracy. This occurred at around the same time as the fall of communism in Romania, Bulgaria, Hungary and Poland. Within three years communist rule was extirpated from Europe.\n\nThe word \"socialist\" was removed from the country's full name on 29 March 1990 and replaced by \"federal\".\n\nIn 1992, because of growing nationalist tensions in the government, Czechoslovakia was peacefully dissolved by parliament. On 1 January 1993 it formally separated into two independent countries, the Czech Republic and the Slovak Republic.\n\nGovernment and politics \n\nAfter World War II, a political monopoly was held by the Communist Party of Czechoslovakia (KSČ). Gustáv Husák was elected first secretary of the KSČ in 1969 (changed to general secretary in 1971) and president of Czechoslovakia in 1975. Other parties and organizations existed but functioned in subordinate roles to the KSČ. All political parties, as well as numerous mass organizations, were grouped under umbrella of the National Front. Human rights activists and religious activists were severely repressed.\n\nConstitutional development\n\nCzechoslovakia had the following constitutions during its history (1918–1992):\n*Temporary constitution of 14 November 1918 (democratic): see History of Czechoslovakia (1918–1938)\n*The 1920 constitution (The Constitutional Document of the Czechoslovak Republic), democratic, in force until 1948, several amendments\n*The Communist 1948 Ninth-of-May Constitution\n*The Communist 1960 Constitution of the Czechoslovak Socialist Republic with major amendments in 1968 (Constitutional Law of Federation), 1971, 1975, 1978, and 1989 (at which point the leading role of the Communist Party was abolished). It was amended several more times during 1990–1992 (for example, 1990, name change to Czecho-Slovakia, 1991 incorporation of the human rights charter)\n\nHeads of state and government \n\n*List of presidents of Czechoslovakia\n*List of Prime Ministers of Czechoslovakia\n\nForeign policy\n\nInternational agreements and membership\n\nIn the 1930s, the nation formed a military alliance with France, which collapsed in the Munich Agreement of 1938. After World War II, active participant in Council for Mutual Economic Assistance (Comecon), Warsaw Pact, United Nations and its specialized agencies; signatory of conference on Security and Cooperation in Europe.Ladislav Cabada and Sarka Waisova, Czechoslovakia and the Czech Republic in World Politics (Lexington Books; 2012)\n\nAdministrative divisions\n\n*1918–1923: Different systems in former Austrian territory (Bohemia, Moravia, a small part of Silesia) compared to former Hungarian territory (Slovakia and Ruthenia): three lands (země) (also called district units (kraje)): Bohemia, Moravia, Silesia, plus 21 counties (župy) in today's Slovakia and three counties in today's Ruthenia; both lands and counties were divided into districts (okresy).\n*1923–1927: As above, except that the Slovak and Ruthenian counties were replaced by six (grand) counties ((veľ)župy) in Slovakia and one (grand) county in Ruthenia, and the numbers and boundaries of the okresy were changed in those two territories.\n*1928–1938: Four lands (Czech: země, Slovak: krajiny): Bohemia, Moravia-Silesia, Slovakia and Sub-Carpathian Ruthenia, divided into districts (okresy).\n*Late 1938 – March 1939: As above, but Slovakia and Ruthenia gained the status of \"autonomous lands\". Slovakia was called Slovenský štát, with its own currency and government.\n*1945–1948: As in 1928–1938, except that Ruthenia became part of the Soviet Union.\n*1949–1960: 19 regions (kraje) divided into 270 okresy.\n*1960–1992: 10 kraje, Prague, and (from 1970) Bratislava (capital of Slovakia); these were divided into 109–114 okresy; the kraje were abolished temporarily in Slovakia in 1969–1970 and for many purposes from 1991 in Czechoslovakia; in addition, the Czech Socialist Republic and the Slovak Socialist Republic were established in 1969 (without the word Socialist from 1990).\n\nPopulation and ethnic groups\n\nEconomy\n\nBefore World War II, the economy was about the fourth in all industrial states in Europe. The state was based on strong economy, manufacturing cars (Škoda, Tatra), trams, aircraft (Aero, Avia), ships, ship engines (Škoda), canons, shoes (Baťa), turbines, guns (Zbrojovka Brno). It was the industrial workshop for Austro-Hungarian empire. The Slovak lands were more in agriculture.\n\nAfter World War II, the economy was centrally planned, with command links controlled by the communist party, similarly to the Soviet Union. The large metallurgical industry was dependent on imports of iron and non-ferrous ores.\n*Industry: Extractive industry and manufacturing dominated the sector, including machinery, chemicals, food processing, metallurgy, and textiles. The sector was wasteful in its use of energy, materials, and labor and was slow to upgrade technology, but the country was a major supplier of high-quality machinery, instruments, electronics, aircraft, airplane engines and arms to other socialist countries.\n*Agriculture: Agriculture was a minor sector, but collectivized farms of large acreage and relatively efficient mode of production enabled the country to be relatively self-sufficient in food supply. The country depended on imports of grains (mainly for livestock feed) in years of adverse weather. Meat production was constrained by shortage of feed, but the country still recorded high per capita consumption of meat.\n*Foreign trade: Exports were estimated at US$17.8 billion in 1985. Exports were machinery (55%), fuel and materials (14%), and manufactured consumer goods (16%). Imports stood at estimated US$17.9 billion in 1985, including fuel and materials (41%), machinery (33%), and agricultural and forestry products (12%). In 1986, about 80% of foreign trade was with other socialist countries.\n*Exchange rate: Official, or commercial, rate was crowns (Kčs) 5.4 per US$1 in 1987. Tourist, or non-commercial, rate was Kčs 10.5 per US$1. Neither rate reflected purchasing power. The exchange rate on the black market was around Kčs 30 per US$1, which became the official rate once the currency became convertible in the early 1990s.\n*Fiscal year: Calendar year.\n*Fiscal policy: The state was the exclusive owner of means of production in most cases. Revenue from state enterprises was the primary source of revenues followed by turnover tax. The government spent heavily on social programs, subsidies, and investment. Budget was usually balanced or left small surplus.\n\nResource base\n\nAfter World War II, the country was short of energy, relying on imported crude oil and natural gas from Soviet Union, domestic brown coal, and nuclear and hydroelectric energy. Energy constraints were a major factor in the 1980s.\n\nTransport and communications\n\nSlightly after the foundation of Czechoslovakia in 1918, there was a lack of needful infrastructure in many areas – paved roads, railways, bridges etc. Massive improvement in the following years enabled Czechoslovakia to develop its industry. Prague's civil airport in Ruzyně became one of the most modern terminals in the world, when it was finished in 1937. Tomáš Baťa, Czech entrepreneur and visionary outlined his ideas in the publication \"Budujme stát pro 40 milionů lidí\", where he described the future motorway system. Construction of the first motorways in Czechoslovakia begun in 1939, nevertheless, they were stopped after Nazi occupation during the World War II. \n\nSociety\n\nEducation\n\nEducation was free at all levels and compulsory from age 6 to 15. The vast majority of the population was literate. There was a highly developed system of apprenticeship training and vocational schools supplemented general secondary schools and institutions of higher education.\n\nReligion\n\nIn 1991: Roman Catholics 46%, Evangelical Lutheran 5.3%, Atheist 30%, n/a 17%, but there were huge differences in religious practices between the two constituent republics; see Czech Republic and Slovakia.\n\nHealth, social welfare and housing\n\nAfter World War II, free health care was available to all citizens. National health planning emphasised preventive medicine; factory and local health care centres supplemented hospitals and other inpatient institutions. There was substantial improvement in rural health care during the 1960s and 1970s.\n\nMass media\n\nDuring the era between the World Wars, Czechoslovak democracy and liberalism facilitated conditions for free publication. The most significant daily newspapers in these times were Lidové noviny, Národní listy, Český deník and Československá republika.\n\nDuring Communist rule, the mass media in Czechoslovakia were controlled by the Communist Party. Private ownership of any publication or agency of the mass media was generally forbidden, although churches and other organizations published small periodicals and newspapers. Even with this information monopoly in the hands of organizations under KSČ control, all publications were reviewed by the government's Office for Press and Information.\n\nSports\n\nThe Czechoslovakia national football team was a consistent performer on the international scene, with eight appearances in the FIFA World Cup Finals, finishing in second place in 1934 and 1962. The team also won the European Football Championship in 1976, came in third in 1980 and won the Olympic gold in 1980.\n\nWell-known football players such as Pavel Nedvěd, Antonín Panenka, Milan Baroš, Tomáš Rosický, Vladimír Šmicer or Petr Čech were all born in Czechoslovakia.\n\nThe International Olympic Committee code for Czechoslovakia is TCH, which is still used in historical listings of results.\n\nThe Czechoslovak national ice hockey team won many medals from the world championships and Olympic Games. Peter Šťastný, Jaromír Jágr, Dominik Hašek, Peter Bondra, Petr Klíma, Marián Gáborík, Marián Hossa, Miroslav Šatan and Pavol Demitra all come from Czechoslovakia.\n\nEmil Zátopek, winner of four Olympic gold medals in athletics, is considered one of the top athletes in the history.\n\nVěra Čáslavská was an Olympic gold medallist in gymnastics, winning seven gold medals and four silver medals. She represented Czechoslovakia in three consecutive Olympics.\n\nSeveral accomplished professional tennis players including Ivan Lendl, Jan Kodeš, Miloslav Mečíř, Hana Mandlíková, Martina Hingis, Martina Navratilova, Jana Novotna, Petra Kvitová and Daniela Hantuchová were born in Czechoslovakia.\n\nCulture\n\n*Czech RepublicSlovakia\n*List of CzechsList of Slovaks\n*MDŽ (International Women's Day)\n*Jazz in dissident Czechoslovakia\n\nPostage stamps\n\n*List of people on stamps of Czechoslovakia\n*[http://www.shutterstock.com/pic-22619653/stock-photo-slovakia-mail-postage-stamps.html Czechoslovakia stamp reused by Slovak Republic after 18 January 1939 by overprinting country and value]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Czechoslovakia" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5322" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Czechoslovakia, or Czecho-Slovakia (; Czech and , Česko-Slovensko,.), was a sovereign state in Central Europe that existed from October 1918, when it declared its independence from the Austro-Hungarian Empire, until its peaceful dissolution into the :Czech Republic and :Slovakia on 1 January 1993.\n\nFrom 1939 to 1945, following its forced division and partial incorporation into Nazi Germany, the state did not de facto exist but its government-in-exile continued to operate.\n\nFrom 1948 to 1990, Czechoslovakia was part of the Soviet bloc with a command economy. Its economic status was formalized in membership of Comecon from 1949 and its defense status in the Warsaw Pact of May 1955. A period of political liberalization in 1968, known as the Prague Spring, was forcibly ended when the Soviet Union, assisted by several other Warsaw Pact countries, invaded. In 1989, as Marxist–Leninist governments and communism were ending all over Europe, Czechoslovaks peacefully deposed their government in the Velvet Revolution; state price controls were removed after a period of preparation. In 1993, Czechoslovakia split into the two sovereign states of the Czech Republic and Slovakia.\n\nCharacteristics\n\n;Form of state\n*1918–1938: A democratic republic.\n*1938–1939: After annexation of Sudetenland by Nazi Germany in 1938, the region gradually turned into a state with loosened connections among the Czech, Slovak, and Ruthenian parts. A large strip of southern Slovakia and Carpatho-Ukraine was annexed by Hungary, and the Zaolzie region was annexed by Poland.\n*1939–1945: The region was split into the Protectorate of Bohemia and Moravia and the Slovak Republic. A government-in-exile continued to exist in London, supported by the United Kingdom, United States and its Allies; after the German invasion of Russia, it was also recognised by the Soviet Union. Czechoslovakia adhered to the Declaration by United Nations and was a founding member of the United Nations.\n*1946–1948: The country was governed by a coalition government with communist ministers, including the prime minister and the minister of interior. Carpathian Ruthenia was ceded to the Soviet Union.\n*1948–1989: The country became a socialist state under Soviet domination with a centrally planned economy. In 1960, the country officially became a socialist republic, the Czechoslovak Socialist Republic. It was a satellite state of the Soviet Union.\n*1989–1990: The federal republic consisted of the Czech Socialist Republic and the Slovak Socialist Republic.\n*1990–1992: Following the Velvet Revolution, the state was renamed the Czech and Slovak Federal Republic, consisting of the Czech Republic and the Slovak Republic.\n\n;Neighbours\n*Austria 1918–1938, 1945–1992\n*Germany (Both predecessors, West Germany and East Germany, were neighbors between 1949 and 1990.)\n*Hungary\n*Poland\n*Romania 1918–1938\n*Soviet Union 1945–1991\n*Ukraine 1991–1992\n\n;Topography\nThe country was of generally irregular terrain. The western area was part of the north-central European uplands. The eastern region was composed of the northern reaches of the Carpathian Mountains and lands of the Danube River basin.\n\n;Climate\nThe weather is mild winters and mild summers. Influenced by the Atlantic Ocean from the west, Baltic Sea from the north, and Mediterranean Sea from the south. There is no continental weather.\n\nOfficial names\n\n*1918–1920: Republic of Czechoslovakia (abbreviated ČSR)/Czecho-Slovak State, or Czecho-Slovakia/Czechoslovakia\n*1920–1938: Czechoslovak Republic (ČSR), or Czechoslovakia\n*1938–1939: Czecho-Slovak Republic, or Czecho-Slovakia\n*1945–1960: Czechoslovak Republic (ČSR), or Czechoslovakia\n*1960–1990: Czechoslovak Socialist Republic (ČSSR), or Czechoslovakia\n*April 1990: Czechoslovak Federative Republic (Czech version) and Czecho-Slovak Federative Republic (Slovak version)\n**The country subsequently became the Czech and Slovak Federative Republic, ČSFR, or Československo (Czech version) and Česko-Slovensko (Slovak version).\n\nHistory\n\nOrigins\n\nThe area was long a part of the Austro-Hungarian Empire until the empire collapsed at the end of World War I. The new state was founded by Tomáš Garrigue Masaryk (1850–1937), who served as its first president from 14 November 1918 to 14 December 1935. He was succeeded by his close ally, Edvard Beneš (1884–1948).\n\nThe roots of Czech nationalism go back to the 19th century, when philologists and educators, influenced by Romanticism, promoted the Czech language and pride in the Czech people. Nationalism became a mass movement in the second half of the 19th century. Taking advantage of the limited opportunities for participation in political life under Austrian rule, Czech leaders such as historian František Palacký (1798–1876) founded many patriotic, self-help organizations which provided a chance for many of their compatriots to participate in communal life prior to independence. Palacký supported Austro-Slavism and worked for a reorganized and federal Austrian Empire, which would protect the Slavic speaking peoples of Central Europe against Russian and German threats.\n\nAn advocate of democratic reform and Czech autonomy within Austria-Hungary, Masaryk was elected twice to the Reichsrat (Austrian Parliament), first from 1891 to 1893 for the Young Czech Party, and again from 1907 to 1914 for the Czech Realist Party, which he had founded in 1889 with Karel Kramář and Josef Kaizl.\n\nDuring World War I small numbers of Czechs, the Czechoslovak Legions, fought with the Allies in France and Italy, while large numbers deserted to Russia in exchange for its support for the independence of Czechoslovakia from the Austrian Empire. With the outbreak of World War I, Masaryk began working for Czech independence in a union with Slovakia. With Edvard Beneš and Milan Rastislav Štefánik, Masaryk visited several Western countries and won support from influential publicists.Z. A. B. Zeman, The Masaryks: The Making of Czechoslovakia (1976)\n\nBohemia and Moravia, under Austrian rule, were Czech-speaking industrial centres, while Slovakia, which was part of the Kingdom of Hungary, was an undeveloped agrarian region. Conditions were much better for the development of a mass national movement in the Czech lands than in Slovakia. Nevertheless, the two regions united and created a new nation.\n\nFirst Czechoslovak Republic\n\nFormation\n\nThe Bohemian Kingdom ceased to exist in 1918 when it was incorporated into Czechoslovakia. Czechoslovakia was founded in October 1918, as one of the successor states of the Austro-Hungarian Empire at the end of World War I and as part of the Treaty of Saint-Germain-en-Laye. It consisted of the present day territories of Bohemia, Moravia, Slovakia and Carpathian Ruthenia. Its territory included some of the most industrialized regions of the former Austria-Hungary.\n\nEthnicity \n\nThe new country was a multi-ethnic state. The population consisted of Czechs (51%), Slovaks (16%), Germans (22%), Hungarians (5%) and Rusyns (4%).\"The War of the World\", Niall Ferguson Allen Lane 2006. Many of the Germans, Hungarians, Ruthenians and Poles, Prague Post, 6 July 2005 and some Slovaks, felt oppressed because the political elite did not generally allow political autonomy for minority ethnic groups. This policy, combined with increasing Nazi propaganda especially in the industrialized German-speaking Sudetenland, led to unrest among the non-Czech population.\n\nThe state proclaimed the official ideology that there are no Czechs and Slovaks, but only one nation of Czechoslovaks (see Czechoslovakism), to the disagreement of Slovaks and other ethnic groups. Once a unified Czechoslovakia was restored after World War II (after the country had been divided during the war), the conflict between the Czechs and the Slovaks surfaced again. The governments of Czechoslovakia and other eastern European nations deported ethnic Germans to the West, reducing the presence of minorities in the nation. Most of the Jews had been killed during the war by the Nazis and their allies.\n\n*Jews identified themselves as Germans or Hungarians (and Jews only by religion not ethnicity), the sum is, therefore, more than 100%.\n\nInterwar period\n\nDuring the period between the two world wars, democracy thrived in Czechoslovakia. Of all the new states established in central Europe after 1918, only Czechoslovakia preserved a democratic government until the war broke out. The persistence of democracy suggests that Czechoslovakia was better prepared to maintain democracy than were other countries in the region. Thus, despite regional disparities, its level of development was much higher than that of neighboring states. The population was generally literate, and contained fewer alienated groups. The influence of these conditions was augmented by the political values of Czechoslovakia's leaders and the policies they adopted. Under Tomas Masaryk, Czech and Slovak politicians promoted progressive social and economic conditions that served to defuse discontent.\n\nForeign minister Beneš became the prime architect of the Czechoslovak-Romanian-Yugoslav alliance (the \"Little Entente\", 1921–38) directed against Hungarian attempts to reclaim lost areas. Beneš worked closely with France. Far more dangerous was the German element, which after 1933 became allied with the Nazis in Germany. The increasing feeling of inferiority among the Slovaks, who were hostile to the more numerous Czechs, weakened the country in the late 1930s. Many Slovaks supported an extreme nationalist movement and welcomed the puppet Slovak state set up under Hitler's control in 1939.\n\nAfter 1933, Czechoslovakia remained the only democracy in central and eastern Europe. \n\nMunich Agreement, and Two-Step German Occupation\n\nIn September 1938, Adolf Hitler demanded control of the Sudetenland. On 29 September 1938, Britain and France ceded control in the Appeasement at the Munich Conference; France ignored the military alliance it had with Czechoslovakia. During October 1938, Nazi Germany occupied and annexed the Sudetenland border region, effectively crippling Czechoslovak defences.\n\nOn 15 March 1939, the remainder (\"rump\") of Czechoslovakia was invaded and divided into the Protectorate of Bohemia and Moravia and the puppet Slovak State.\n\nMuch of Slovakia and all of Carpathian Ruthenia were annexed by Hungary. Poland occupied Zaolzie, an area whose population was majority Polish, in October 1938.\n\nThe eventual goal of the German state under Nazi leadership was to eradicate Czech nationality through assimilation, deportation, and extermination of the Czech intelligentsia; the intellectual elites and middle class made up a considerable number of the 200,000 people who passed through concentration camps and the 250,000 who died during German occupation.Universities in the Nineteenth and Early Twentieth Centuries (1800–1945), Walter Rüegg Cambridge University Press (28 October 2004), page 353 Under Generalplan Ost, it was assumed that around 50% Czechs would be fit for Germanization. The Czech intellectual elites were to be removed not only from Czech territories but from Europe completely. The authors of Generalplan Ost believed it would be best if they emigrated overseas, as even in Siberia they were considered a threat to German rule. Just like Jews, Poles, Serbs, and several other nations, Czechs were considered to be untermenschen by the Nazi state. In 1940, in a secret Nazi plan for the Germanization of the Protectorate of Bohemia and Moravia it was declared that those considered to be of racially Mongoloid origin and the Czech intelligentsia were not to be Germanized.\n\nThe deportation of Jews to concentration camps was organized under the direction of Reinhard Heydrich, and the fortress town of Terezín was made into a ghetto way station for Jewish families. On 4 June 1942 Heydrich died after being wounded by an assassin in Operation Anthropoid. Heydrich's successor, Colonel General Kurt Daluege, ordered mass arrests and executions and the destruction of the villages of Lidice and Ležáky. In 1943 the German war effort was accelerated. Under the authority of Karl Hermann Frank, German minister of state for Bohemia and Moravia, some 350,000 Czech laborers were dispatched to the Reich. Within the protectorate, all non-war-related industry was prohibited. Most of the Czech population obeyed quiescently up until the final months preceding the end of the war, while thousands were involved in the resistance movement.\n\nFor the Czechs of the Protectorate Bohemia and Moravia, German occupation was a period of brutal oppression. Czech losses resulting from political persecution and deaths in concentration camps totaled between 36,000 and 55,000. The Jewish population of Bohemia and Moravia (118,000 according to the 1930 census) was virtually annihilated. Many Jews emigrated after 1939; more than 70,000 were killed; 8,000 survived at Terezín. Several thousand Jews managed to live in freedom or in hiding throughout the occupation.\n\nDespite the estimated 136,000 deaths at the hands of the Nazi regime, the population in the Reichsprotektorate saw a net increase during the war years of approximately 250,000 in line with an increased birth rate.\"Vaclav Havel – A Political Tragedy in 6 Acts\" by John Keane, published 2000, page 54\n\nOn 3 May 1945, the third US Army of General Patton entered Pilsen from the south west. On 9 May 1945, Soviet Red Army troops entered Prague.\n\nSocialist Czechoslovakia\n\nAfter World War II, pre-war Czechoslovakia was re-established, with the exception of Subcarpathian Ruthenia, which was annexed by the Soviet Union and incorporated into the Ukrainian Soviet Socialist Republic. The Beneš decrees were promulgated concerning ethnic Germans (see Potsdam Agreement) and ethnic Hungarians. Under the decrees, citizenship was abrogated for people of German and Hungarian ethnic origin who had accepted German or Hungarian citizenship during the occupations. In 1948, this provision was cancelled for the Hungarians, but only partially for the Germans. The government then confiscated the property of the Germans and expelled about 90% of the ethnic German population, over 2 million people. Those who remained were collectively accused of supporting the Nazis after the Munich Agreement, as 97.32% of Sudeten Germans had voted for the NSDAP in the December 1938 elections. Almost every decree explicitly stated that the sanctions did not apply to antifascists. Some 250,000 Germans, many married to Czechs, some antifascists, and also those required for the post-war reconstruction of the country, remained in Czechoslovakia. The Beneš Decrees still cause controversy among nationalist groups in the Czech Republic, Germany, Austria and Hungary.[http://www.law.nyu.edu/eecr/vol11num1_2/special/rupnik.html East European Constitutional Review] \n\nCarpathian Ruthenia (Podkarpatská Rus) was occupied by (and in June 1945 formally ceded to) the Soviet Union. In the 1946 parliamentary election, the Communist Party of Czechoslovakia was the winner in the Czech lands, and the Democratic Party won in Slovakia. In February 1948 the Communists seized power. Although they would maintain the fiction of political pluralism through the existence of the National Front, except for a short period in the late 1960s (the Prague Spring) the country had no liberal democracy. Since citizens lacked significant electoral methods of registering protest against government policies, periodically there were street protests that became violent. For example, there were riots in the town of Plzeň in 1953, reflecting economic discontent. Police and army units put down the rebellion, and hundreds were injured but no one was killed. While its economy remained more advanced than those of its neighbors in Eastern Europe, Czechoslovakia grew increasingly economically weak relative to Western Europe.\n\nIn 1968, when the reformer Alexander Dubček was appointed to the key post of First Secretary of the Czechoslovak Communist Party, there was a brief period of liberalization known as the Prague Spring. In response, after failing to persuade the Czechoslovak leaders to change course, five other Eastern Bloc members of the Warsaw Pact invaded. Soviet tanks rolled into Czechoslovakia on the night of 20–21 August 1968.[http://www.upi.com/Audio/Year_in_Review/Events-of-1968/N.-Korea-Seize-U.S.-Ship/12303153093431-9/#title \"Russia Invades Czechoslovakia: 1968 Year in Review, UPI.com\"]  The General Secretary of the Soviet Communist Party Leonid Brezhnev viewed this intervention as vital for the preservation of the Soviet, socialist system and vowed to intervene in any state that sought to replace Marxism-Leninism with capitalism.John Lewis Gaddis, The Cold War: A New History (New York: The Penguin Press), 150. In the week after the invasion there was a spontaneous campaign of civil resistance against the occupation. This resistance involved a wide range of acts of non-cooperation and defiance: this was followed by a period in which the Czechoslovak Communist Party leadership, having been forced in Moscow to make concessions to the Soviet Union, gradually put the brakes on their earlier liberal policies.Philip WIndsor and Adam Roberts, Czechoslovakia 1968: Reform, Repression and Resistance (London: Chatto & Windus, 1969), pp. 97–143. In April 1969 Dubček was finally dismissed from the First Secretaryship of the Czechoslovak Communist Party. Meanwhile, one plank of the reform program had been carried out: in 1968-9, Czechoslovakia was turned into a federation of the Czech Socialist Republic and Slovak Socialist Republic. The theory was that under the federation, social and economic inequities between the Czech and Slovak halves of the state would be largely eliminated. A number of ministries, such as education, now became two formally equal bodies in the two formally equal republics. However, the centralised political control by the Czechoslovak Communist Party severely limited the effects of federalization.\n\nThe 1970s saw the rise of the dissident movement in Czechoslovakia, represented among others by Václav Havel. The movement sought greater political participation and expression in the face of official disapproval, manifested in limitations on work activities, which went as far as a ban on professional employment, the refusal of higher education for the dissidents' children, police harassment and prison.\n\nAfter 1989\n\nIn 1989, the Velvet Revolution restored democracy. This occurred at around the same time as the fall of communism in Romania, Bulgaria, Hungary and Poland. Within three years communist rule was extirpated from Europe.\n\nThe word \"socialist\" was removed from the country's full name on 29 March 1990 and replaced by \"federal\".\n\nIn 1992, because of growing nationalist tensions in the government, Czechoslovakia was peacefully dissolved by parliament. On 1 January 1993 it formally separated into two independent countries, the Czech Republic and the Slovak Republic.\n\nGovernment and politics \n\nAfter World War II, a political monopoly was held by the Communist Party of Czechoslovakia (KSČ). Gustáv Husák was elected first secretary of the KSČ in 1969 (changed to general secretary in 1971) and president of Czechoslovakia in 1975. Other parties and organizations existed but functioned in subordinate roles to the KSČ. All political parties, as well as numerous mass organizations, were grouped under umbrella of the National Front. Human rights activists and religious activists were severely repressed.\n\nConstitutional development\n\nCzechoslovakia had the following constitutions during its history (1918–1992):\n*Temporary constitution of 14 November 1918 (democratic): see History of Czechoslovakia (1918–1938)\n*The 1920 constitution (The Constitutional Document of the Czechoslovak Republic), democratic, in force until 1948, several amendments\n*The Communist 1948 Ninth-of-May Constitution\n*The Communist 1960 Constitution of the Czechoslovak Socialist Republic with major amendments in 1968 (Constitutional Law of Federation), 1971, 1975, 1978, and 1989 (at which point the leading role of the Communist Party was abolished). It was amended several more times during 1990–1992 (for example, 1990, name change to Czecho-Slovakia, 1991 incorporation of the human rights charter)\n\nHeads of state and government \n\n*List of presidents of Czechoslovakia\n*List of Prime Ministers of Czechoslovakia\n\nForeign policy\n\nInternational agreements and membership\n\nIn the 1930s, the nation formed a military alliance with France, which collapsed in the Munich Agreement of 1938. After World War II, active participant in Council for Mutual Economic Assistance (Comecon), Warsaw Pact, United Nations and its specialized agencies; signatory of conference on Security and Cooperation in Europe.Ladislav Cabada and Sarka Waisova, Czechoslovakia and the Czech Republic in World Politics (Lexington Books; 2012)\n\nAdministrative divisions\n\n*1918–1923: Different systems in former Austrian territory (Bohemia, Moravia, a small part of Silesia) compared to former Hungarian territory (Slovakia and Ruthenia): three lands (země) (also called district units (kraje)): Bohemia, Moravia, Silesia, plus 21 counties (župy) in today's Slovakia and three counties in today's Ruthenia; both lands and counties were divided into districts (okresy).\n*1923–1927: As above, except that the Slovak and Ruthenian counties were replaced by six (grand) counties ((veľ)župy) in Slovakia and one (grand) county in Ruthenia, and the numbers and boundaries of the okresy were changed in those two territories.\n*1928–1938: Four lands (Czech: země, Slovak: krajiny): Bohemia, Moravia-Silesia, Slovakia and Sub-Carpathian Ruthenia, divided into districts (okresy).\n*Late 1938 – March 1939: As above, but Slovakia and Ruthenia gained the status of \"autonomous lands\". Slovakia was called Slovenský štát, with its own currency and government.\n*1945–1948: As in 1928–1938, except that Ruthenia became part of the Soviet Union.\n*1949–1960: 19 regions (kraje) divided into 270 okresy.\n*1960–1992: 10 kraje, Prague, and (from 1970) Bratislava (capital of Slovakia); these were divided into 109–114 okresy; the kraje were abolished temporarily in Slovakia in 1969–1970 and for many purposes from 1991 in Czechoslovakia; in addition, the Czech Socialist Republic and the Slovak Socialist Republic were established in 1969 (without the word Socialist from 1990).\n\nPopulation and ethnic groups\n\nEconomy\n\nBefore World War II, the economy was about the fourth in all industrial states in Europe. The state was based on strong economy, manufacturing cars (Škoda, Tatra), trams, aircraft (Aero, Avia), ships, ship engines (Škoda), canons, shoes (Baťa), turbines, guns (Zbrojovka Brno). It was the industrial workshop for Austro-Hungarian empire. The Slovak lands were more in agriculture.\n\nAfter World War II, the economy was centrally planned, with command links controlled by the communist party, similarly to the Soviet Union. The large metallurgical industry was dependent on imports of iron and non-ferrous ores.\n*Industry: Extractive industry and manufacturing dominated the sector, including machinery, chemicals, food processing, metallurgy, and textiles. The sector was wasteful in its use of energy, materials, and labor and was slow to upgrade technology, but the country was a major supplier of high-quality machinery, instruments, electronics, aircraft, airplane engines and arms to other socialist countries.\n*Agriculture: Agriculture was a minor sector, but collectivized farms of large acreage and relatively efficient mode of production enabled the country to be relatively self-sufficient in food supply. The country depended on imports of grains (mainly for livestock feed) in years of adverse weather. Meat production was constrained by shortage of feed, but the country still recorded high per capita consumption of meat.\n*Foreign trade: Exports were estimated at US$17.8 billion in 1985. Exports were machinery (55%), fuel and materials (14%), and manufactured consumer goods (16%). Imports stood at estimated US$17.9 billion in 1985, including fuel and materials (41%), machinery (33%), and agricultural and forestry products (12%). In 1986, about 80% of foreign trade was with other socialist countries.\n*Exchange rate: Official, or commercial, rate was crowns (Kčs) 5.4 per US$1 in 1987. Tourist, or non-commercial, rate was Kčs 10.5 per US$1. Neither rate reflected purchasing power. The exchange rate on the black market was around Kčs 30 per US$1, which became the official rate once the currency became convertible in the early 1990s.\n*Fiscal year: Calendar year.\n*Fiscal policy: The state was the exclusive owner of means of production in most cases. Revenue from state enterprises was the primary source of revenues followed by turnover tax. The government spent heavily on social programs, subsidies, and investment. Budget was usually balanced or left small surplus.\n\nResource base\n\nAfter World War II, the country was short of energy, relying on imported crude oil and natural gas from Soviet Union, domestic brown coal, and nuclear and hydroelectric energy. Energy constraints were a major factor in the 1980s.\n\nTransport and communications\n\nSlightly after the foundation of Czechoslovakia in 1918, there was a lack of needful infrastructure in many areas – paved roads, railways, bridges etc. Massive improvement in the following years enabled Czechoslovakia to develop its industry. Prague's civil airport in Ruzyně became one of the most modern terminals in the world, when it was finished in 1937. Tomáš Baťa, Czech entrepreneur and visionary outlined his ideas in the publication \"Budujme stát pro 40 milionů lidí\", where he described the future motorway system. Construction of the first motorways in Czechoslovakia begun in 1939, nevertheless, they were stopped after Nazi occupation during the World War II. \n\nSociety\n\nEducation\n\nEducation was free at all levels and compulsory from age 6 to 15. The vast majority of the population was literate. There was a highly developed system of apprenticeship training and vocational schools supplemented general secondary schools and institutions of higher education.\n\nReligion\n\nIn 1991: Roman Catholics 46%, Evangelical Lutheran 5.3%, Atheist 30%, n/a 17%, but there were huge differences in religious practices between the two constituent republics; see Czech Republic and Slovakia.\n\nHealth, social welfare and housing\n\nAfter World War II, free health care was available to all citizens. National health planning emphasised preventive medicine; factory and local health care centres supplemented hospitals and other inpatient institutions. There was substantial improvement in rural health care during the 1960s and 1970s.\n\nMass media\n\nDuring the era between the World Wars, Czechoslovak democracy and liberalism facilitated conditions for free publication. The most significant daily newspapers in these times were Lidové noviny, Národní listy, Český deník and Československá republika.\n\nDuring Communist rule, the mass media in Czechoslovakia were controlled by the Communist Party. Private ownership of any publication or agency of the mass media was generally forbidden, although churches and other organizations published small periodicals and newspapers. Even with this information monopoly in the hands of organizations under KSČ control, all publications were reviewed by the government's Office for Press and Information.\n\nSports\n\nThe Czechoslovakia national football team was a consistent performer on the international scene, with eight appearances in the FIFA World Cup Finals, finishing in second place in 1934 and 1962. The team also won the European Football Championship in 1976, came in third in 1980 and won the Olympic gold in 1980.\n\nWell-known football players such as Pavel Nedvěd, Antonín Panenka, Milan Baroš, Tomáš Rosický, Vladimír Šmicer or Petr Čech were all born in Czechoslovakia.\n\nThe International Olympic Committee code for Czechoslovakia is TCH, which is still used in historical listings of results.\n\nThe Czechoslovak national ice hockey team won many medals from the world championships and Olympic Games. Peter Šťastný, Jaromír Jágr, Dominik Hašek, Peter Bondra, Petr Klíma, Marián Gáborík, Marián Hossa, Miroslav Šatan and Pavol Demitra all come from Czechoslovakia.\n\nEmil Zátopek, winner of four Olympic gold medals in athletics, is considered one of the top athletes in the history.\n\nVěra Čáslavská was an Olympic gold medallist in gymnastics, winning seven gold medals and four silver medals. She represented Czechoslovakia in three consecutive Olympics.\n\nSeveral accomplished professional tennis players including Ivan Lendl, Jan Kodeš, Miloslav Mečíř, Hana Mandlíková, Martina Hingis, Martina Navratilova, Jana Novotna, Petra Kvitová and Daniela Hantuchová were born in Czechoslovakia.\n\nCulture\n\n*Czech RepublicSlovakia\n*List of CzechsList of Slovaks\n*MDŽ (International Women's Day)\n*Jazz in dissident Czechoslovakia\n\nPostage stamps\n\n*List of people on stamps of Czechoslovakia\n*[http://www.shutterstock.com/pic-22619653/stock-photo-slovakia-mail-postage-stamps.html Czechoslovakia stamp reused by Slovak Republic after 18 January 1939 by overprinting country and value]. Czechoslovakia. http://en.wikipedia.org/?curid=5322."
  }
}
