{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7886",
  "eid" : "e3ce5780-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778461944,
  "textBody" : "Drew Blythe Barrymore (born February 22, 1975) is an American actress, author, director, model and producer. She is a member of the Barrymore family of American stage and film actors, and the granddaughter of John Barrymore. She made her breakout role in Steven Spielberg's film E.T. the Extra-Terrestrial (1982).\n\nFollowing a highly publicized, turbulent childhood marked by drug and alcohol abuse with two stints in rehab, she released her autobiography, Little Girl Lost (1991). Barrymore appeared in a string of successful films, including Poison Ivy (1992), Scream (1996), and Ever After (1998). She is also known for co-starring with Adam Sandler in The Wedding Singer (1998), 50 First Dates (2004) and Blended (2014). \n\nIn 1995, she and Nancy Juvonen formed a joint production company, Flower Films, and it went on to produce several films in which Barrymore also starred, such as Never Been Kissed (1999), Charlie's Angels (2000), Donnie Darko (2001) and her directorial debut Whip It! (2009)and Fever Pitch. Barrymore won a Screen Actors Guild Award and a Golden Globe Award for her performance in Grey Gardens (2009). She currently stars in the Netflix series Santa Clarita Diet (2017).\n\nEarly life\n\nAncestry\n\nBarrymore was born in Culver City, California, to actor John Drew Barrymore and aspiring actress Jaid (born Ildikó Jaid Makó). Jaid was born in a displaced persons camp in Brannenburg, West Germany, to Hungarian World War II refugees. Barrymore is one of four children with a half-brother, John, who is also an actor. Her parents divorced in 1984, when she was nine years old. \n\nShe was born into the Barrymore acting dynasty: All of her paternal great-grandparents – Maurice and Georgie Drew Barrymore, Maurice, and Mae Costello ( Altschuk) – as well as her paternal grandparents, John Barrymore and Dolores Costello, were actors,Stein Hoffman, Carol. The Barrymores: Hollywood's First Family. University Press of Kentucky, 2001.  with John being arguably the most acclaimed actor of his generation. Barrymore is a niece of Diana Barrymore, a grandniece of Lionel Barrymore, Ethel Barrymore, and Helene Costello,[http://www.barrymorefamily.com/costello.html \"The Costello Family.\"] BarrymoreFamily.com and a great-great-granddaughter of Irish-born John and English-born Louisa Lane Drew, all of whom were also actors. She was a great-grandniece of Broadway idol John Drew, Jr. and silent film actor, writer and director Sidney Drew.[http://www.barrymorefamily.com/fr_index.html?/drew.html \"The Drew family.\"] BarrymoreFamily.com \n\nHer godmothers are actress Sophia Loren and Lee Strasberg's widow Anna Strasberg; Barrymore described her relationship with the latter as one that \"would become so important to me as a kid because she was so kind and nurturing.\" Her godfather is director Steven Spielberg.\n\nHer first name, \"Drew\", was the maiden name of her paternal great-grandmother, Georgie Drew, and her middle name, \"Blythe,\" was the original surname of the dynasty founded by her great-grandfather, Maurice. Barrymore recounted in her 1989 autobiography, Little Girl Lost, early memories of her abusive father, who left the family when Barrymore was six months old. They never had anything resembling a significant relationship and seldom spoke to each other.\n\nChildhood\n\nBarrymore grew up on Poinsetta Place in West Hollywood until the age of 7, when she moved to Sherman Oaks. (In her 2015 memoir Wildflower, she says she talks \"like a valley girl\" because she grew up in Sherman Oaks.) She moved back to West Hollywood, upon becoming emancipated at 14. Barrymore attended elementary school at Fountain Day School in West Hollywood and Country School.\n\nIn the wake of her sudden stardom, Barrymore endured a notoriously troubled childhood. She was already a regular at the racy Studio 54 as a young girl, smoking cigarettes at the age of nine, drinking alcohol at age eleven, smoking marijuana at age twelve and snorting cocaine at age thirteen. Her nightlife and constant partying became a popular subject with the media. She was in rehab at the age of fourteen, and spent eighteen months in an institution for the mentally ill. A suicide attempt, also at 14, put her back in rehab, followed by a three-month stay with singer David Crosby (of rock group Crosby, Stills, Nash & Young) and his wife. The stay was precipitated, Crosby said, because she \"needed to be around some people that were committed to sobriety.\" Barrymore later described this period of her life in her autobiography, Little Girl Lost. After a successful juvenile court petition for emancipation, she moved into her own apartment at the age of fifteen.\n\nCareer\n\n1980s\n\nBarrymore's professional career began at eleven months, when she auditioned for a dog food commercial. She was nipped by her canine costar, to which she merely laughed and was hired for the job. After her film debut with a small role in Altered States (1980), she played Gertie in E.T. the Extra-Terrestrial (1982), directed by Steven Spielberg. He felt that she had the right imagination for her role after she impressed him with a story that she led a punk rock band. E.T. is the highest-grossing film of the 1980s and made her one of the most famous child stars of the time. For her work, she won a Young Artist Award for Best Supporting Actress.\n\nIn the 1984 science fiction horror adaptation of the 1980 eponymous Stephen King novel Firestarter, Barrymore played a girl with pyrokinesis who becomes the target of a secret government agency known as The Shop. The same year, she played a young girl divorcing her famous parents in Irreconcilable Differences, for which she was nominated for her first Golden Globe Award for Best Supporting Actress. In a review in the Chicago Sun-Times, Roger Ebert stated, \"Barrymore is the right actress for this role precisely because she approaches it with such grave calm.\"\n\nShe endured a troubled youth and continued to act intermittently during the decade. She starred in the 1985 anthology horror film Cat's Eye, written again by Stephen King. The film received positive reviews and Barrymore was nominated for a Young Artist Award for Best Leading Young Actress. She starred alongside Jeff Bridges and Alice Krige in the 1989 romantic comedy See You in the Morning. Vincent Canby of The New York Times criticized \"the fashionable phoniness\" of the film, but positively singled out Barrymore for her performance.\n\nAfter her twelve-day rehab treatment at ASAP, Barrymore starred in Far from Home (1989), as a teenager who gets stranded with her father in the small town in a remote part of the desert. The film went largely unnoticed by audiences and received negative reviews from critics, who dismissed the sexual portrayal of her role.\n\n1990s\n\nIn her late teens, her rebelliousness played itself out on screen and in print. Barrymore forged an image as a manipulative teenage seductress, beginning with Poison Ivy (1992), which was a box office failure, but was popular on video and cable. Her character Ivy was ranked at #6 on the list of the top 26 \"bad girls\" of all time by Entertainment Weekly. In 1992, Barrymore posed nude for the cover of the July issue of Interview magazine with her then-fiancé, actor Jamie Walters, as well as appearing nude in pictures inside the issue.\n\nIn the crime thriller Guncrazy (1992), she starred as a teenager who murders her sexually abusive stepfather, after he teaches her how to use a gun. Variety remarked she \"pulls off impressively\" her character, Barrymore was nominated for the Golden Globe Award. In 1993, she took on the role of the younger sister of a murdered ballerina in  No Place to Hide and starred as a writer followed by what is apparently her evil twin in Doppelganger. Both thrillers were panned by critics and failed to find an audience. She appeared in the western comedy Bad Girls (1994), which follows four former prostitutes on the run following a justifiable homicide and prison escape. Roger Ebert, in his review for the film, wrote for Chicago Sun-Times: \"What a good idea, to make a Western about four tough women. And what a sad movie.\"\n\nWhen she was nineteen, she posed nude for the January 1995 issue of Playboy. Steven Spielberg, who is also her godfather, gave her a quilt for her twentieth birthday with a note that read, \"Cover yourself up.\" Enclosed were copies of her Playboy pictures, with the pictures altered by his art department so that she appeared fully clothed. During her appearance on the Late Show with David Letterman, Barrymore climbed onto David Letterman's desk and bared her breasts to him, her back to the camera, in celebration of his birthday. She modeled in a series of Guess? jeans ads during this time.\n\nBy the mid and late 1990s, Barrymore re-established her image and continued to be a highly bankable star.  In Boys on the Side (1995), Barrymore played a pregnant girl who wants to escape from her abusive boyfriend. The film went little seen in theaters but was positively received by critics. In the same year, she appeared in Joel Schumacher's film Batman Forever, as Sugar, a moll to Two-Face (Tommy Lee Jones). In 1996, she made a brief but notable appearance in Wes Craven's slasher Scream. Barrymore read the film's script and was interested in being involved, approaching the production team herself to request a role. The producers were quick to take advantage of her unexpected interest, and signed her to play the lead role of Sidney Prescott, but when she was faced with unexpected commitments, she instead played the smaller role of Casey Becker.Diana Rico (October 31, 2001). E! A True Hollywood Story: Scream. E! (Television Production) Scream was released to critical acclaim and made an impressive US$173 million worldwide.\n\nIn The Wedding Singer (1998), Barrymore played Julia Sullivan, the friendly waitress of Robbie Hart (Adam Sandler). Variety found the film to be a \"spirited, funny and warm saga\" that serves them up \"in a new way that enhances their most winning qualities\". Budgeted at US$18 million, the film grossed US$123.3 million internationally. That same year, she starred in Home Fries, and Ever After which is inspired by the fairy tale Cinderella and served as a reminder, according to Roger Ebert, of how well Barrymore \"can hold the screen and involve us in her characters\". She played the title role in the television special Olive, the Other Reindeer, for which she was nominated for an Primetime Emmy Award. After Barrymore and Nancy Juvonen established Flower Films in 1995, she produced the company's first film, Never Been Kissed (1999), released to critical and commercial success.\n\n2000s\n\nIn Charlie's Angels (2000), Barrymore, Cameron Diaz and Lucy Liu played the trio of investigators in Los Angeles. The film was a major box office success and helped solidify the standing between Barrymore and the company. Barrymore starred in Riding in Cars with Boys (2001), as a teenage mother in a failed marriage with the drug-addicted father (based on Beverly Donofrio's real-life story). When the production of Richard Kelly's Donnie Darko was threatened, Barrymore stepped forward with financing from the company, and played the title character's English teacher. Although the film was less than successful at the box office in the wake of 9/11, it reached cult film status after the DVD release, inspiring numerous websites devoted to unraveling the plot twists and meanings.\n\nIn 2002, Barrymore starred with Sam Rockwell and Julia Roberts in George Clooney's directorial debut Confessions of a Dangerous Mind, based on the autobiography of television producer Chuck Barris. In 2003, she reprised her role as Dylan Sanders in Charlie's Angels: Full Throttle, and starred with Ben Stiller in Duplex. Flower Films and Happy Madison Productions produced 50 First Dates (2004), which Barrymore reunited with Adam Sandler. Summing up Barrymore's appeal, Roger Ebert, in his review for the film, remarked that Barrymore displayed a \"smiling, coy sincerity,\" in what he described as a \"ingratiating and lovable\" film.\n\nIn the American adaptation of the 1997 eponymous British remake Fever Pitch (2005), Barrymore played Lindsey Meeks, the love interest of Ben Wrightman (Jimmy Fallon). The film grossed a modest US$50 million worldwide and was favorably by reviewers who felt it \"has enough charm and on-screen chemistry between [Fallon and Barrymore] to make it a solid hit\".\n\nShe and Hugh Grant starred in Music and Lyrics, which focuses on the relationship that evolves between a former pop music idol and an aspiring writer as they struggle to compose a song for a reigning pop diva. The romantic comedy, released in February 2007, received largely positive reviews, with the Washington Post finding the two to be \"great together\" in it. The film was a commercial success, grossing US$145 million globally. That same year, Barrymore starred in Curtis Hanson's Lucky You. A lukewarm critical and commercial reception greeted the film upon its release, with The New Yorker remarking that her role \"belongs in front of a sixth-grade class, not [where the film is set].\"\n\nIn 2009, Barrymore starred in the ensemble comedy He's Just Not That Into You, which garnered mixed reviews from critics, who observed her limited time on screen, while it grossed US$178 million worldwide. She played the lead role of Edith Bouvier Beale, the daughter of Edith Ewing Bouvier Beale (Jessica Lange), in the HBO film Grey Gardens, directed by Michael Sucsy and based on the 1975 documentary of the same name. The television film was a huge success, winning five Primetime Emmy Awards and two Golden Globe Awards. Rolling Stone writer Peter Travels found Barrymore to be a \"revelation\" in her role and she won the Best Supporting Actress – Series, Miniseries or Television Film for her performance.\n\nBarrymore made her directorial debut film Whip It (2009), in which she also starred alongside Ellen Page and Marcia Gay Harden, and centers on an obsession with beauty pageants and the Austin Hurl Scouts roller derby team. Critical reception towards the film was largely positive despite it not making an impression commercially. For her venture, she was nominated for a Bronze Horse at the Stockholm Film Festival and for the EDA Female Focus Award at the 2009 Alliance of Women Film Journalists. In Everybody's Fine, Barrymore played the daughter of Frank Goode (Robert De Niro). The drama flopped at the box office and garnered average reviews, but Stephen Holden for The New York Times considered Barrymore \"as ingenuous as ever\" in what he described as a \"small role\".\n\n2010s\n\nIn 2010, Barrymore costarred with Justin Long in Nanette Burstein's Going the Distance. The film follows a couple dealing the ups and downs of a long-distance relationship, while commuting between New York City and San Francisco. It garnered generally mixed reviews by critics, who summed it as \"timelier and a little more honest than most romantic comedies\", and budgeted at US$32 million, the film made US$40 million at the worldwide box office.\n\nOn August 2, 2011, Barrymore directed the music video for the song \"Our Deal,\" for the band Best Coast, which features Chloë Grace Moretz, Miranda Cosgrove, Tyler Posey, Donald Glover, Shailene Woodley and Alia Shawkat. Barrymore starred with John Krasinski in the drama Big Miracle (2012), which covers Operation Breakthrough, the 1988 international effort to rescue gray whales from being trapped in ice near Point Barrow, Alaska. The film saw her play Rachel Krameron, based on Greenpeace activist Cindy Lowry. Despite a positive critical reception, the film bombed commercially.\n\nIn Blended (2014), Barrymore played Lauren Reynolds, a recently divorced woman ending up on a family resort with Jim Friedman (Adam Sandler). Film critic James Berardinelli dismissed the \"hit-and-miss humor\" of the story and wrote that \"as [Sandler and Barrymore] are concerned, the third time is definitely not the charm\", as part of an overall lukewarm critical response. The film, however, ultimately grossed US$128 million worldwide. She and Toni Collette starred in Miss You Already (2015), as two long-time friends whose relationship is put to the test when one starts a family and the other becomes ill. Reviewers embraced the film, while it received a limited theatrical release.\n\nBarrymore and Timothy Olyphant starred in the Netflix sitcom Santa Clarita Diet, as a couple leading vaguely discontented lives that take a dark turn when the wife becomes a zombie. Both actors have executive producing roles. The single-camera series premiered on February 3, 2017.\n\nCareer in beauty and fashion\n\nBarrymore became a CoverGirl Cosmetics's model and spokeswoman in 2007. In February 2015, she remained one of the faces of CoverGirl, alongside Queen Latifah and Taylor Swift. The company partnered with her because \"she emulates the iconic image of CoverGirl with her fresh, natural beauty and energetic yet authentic spirit,\" said Esi Eggleston Bracey, Vice President and General Manager of CoverGirl Cosmetics North America. She brought not only her personality into this endorsement but also her creative side, as she also helped create the ads. Fashion section, Barrymore web site She was No. 1 in People's annual 100 Most Beautiful People list in 2007. Later, she was named the new face for the Gucci jewelry line. As a model, Barrymore signed a contract with IMG Models New York City.\n\nShe launched a women's fashion line in fall 2017 in conjunction with Amazon.com called Dear Drew which featured a pop-up shop in New York City that opened in November.\"Star Shots,\" Star magazine, Dec. 11, 2017, p. 14.\n\nOther work\n\nIn May 2007, Barrymore was named Ambassador Against Hunger for the United Nations World Food Programme and later donated $1 million to the cause. As a guest photographer for a magazine series called \"They Shoot New York,\" she appeared on the cover holding a Pentax K1000 film camera. She expressed hopes of exposing her work in a gallery one day, as she had documented the most recent decade of her life with a Pentax camera.\n\nPersonal life\n\nAt age 16 in 1991, Barrymore became engaged to Leland Hayward, namesake and grandson of Hollywood producer Leland Hayward. The engagement was called off a few months later. Barrymore was engaged to and lived with musician and actor Jamie Walters from 1992 to 1993.\n\nShe married her first husband, Welsh-born Los Angeles bar owner Jeremy Thomas, at age nineteen on March 20, 1994. She filed for divorce from him less than two months later.\n\nBarrymore dated MTV host and comedian Tom Green in 1999, before getting engaged in July 2000 and married a year later. Together, they starred in Charlie's Angels and Green's directorial film debut  Freddy Got Fingered. Green filed for divorce in December 2001, which was finalized on October 15, 2002.\n\nIn 2002, she began dating The Strokes' drummer Fabrizio Moretti, soon after they met at a concert. Their five-year relationship ended in January 2007. She began dating Justin Long, but they broke up in July 2008. While filming Going the Distance, Barrymore and Long reunited in 2009, but broke up again the next year.\n\nIn early 2011, Barrymore began dating art consultant Will Kopelman, the son of former Chanel CEO Arie Kopelman. The couple announced their engagement in January 2012, and married on June 2, 2012 in Montecito, California. Four days later, the couple's wedding image appeared on the cover of People magazine. Barrymore and Kopelman have two daughters: Olive Barrymore Kopelman (born 2012) and Frankie Barrymore Kopelman (born 2014). On April 2, 2016, Barrymore and Kopelman released a statement confirming they had separated and intended to divorce. On July 15, 2016, Barrymore officially filed for divorce, which was finalized on August 3, 2016.\n\nBarrymore said in an interview with Contact Music in 2003 that she had always considered herself bisexual.\n\nBarrymore is the godmother of Kurt Cobain and Courtney Love's daughter, Frances Bean Cobain.\n\nFilmography\n\nAwards, honors, and nominations\n\nIn 1999, Barrymore was honored by the Young Artist Foundation with its Former Child Star \"Lifetime Achievement\" Award commemorating her outstanding achievements within the film industry as a child actress. \n\nFor her contributions to the film industry, Barrymore received a motion pictures star on the Hollywood Walk of Fame in 2004. Her star is located at 6925 Hollywood Boulevard.\n\nBarrymore's films compiled a worldwide box office gross that stood at over US$2.3 billion. According to The Hollywood Reporter's annual Star Salary Top 10, she was tied for eighth place on the top ten list of actresses' salaries, commanding 10 to 12 million dollars per film for 2006. Barrymore became the youngest person to have hosted Saturday Night Live (SNL) having hosted on November 20, 1982 at 7 years of age, a record that remained unbroken as of 2015. On February 3, 2007, Barrymore hosted SNL for the fifth time, making her the second female host (after Candice Bergen) in the show's history to do so. She hosted again on October 10, 2009, becoming the first female to host six times.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Drew Barrymore" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7886" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Drew Blythe Barrymore (born February 22, 1975) is an American actress, author, director, model and producer. She is a member of the Barrymore family of American stage and film actors, and the granddaughter of John Barrymore. She made her breakout role in Steven Spielberg's film E.T. the Extra-Terrestrial (1982).\n\nFollowing a highly publicized, turbulent childhood marked by drug and alcohol abuse with two stints in rehab, she released her autobiography, Little Girl Lost (1991). Barrymore appeared in a string of successful films, including Poison Ivy (1992), Scream (1996), and Ever After (1998). She is also known for co-starring with Adam Sandler in The Wedding Singer (1998), 50 First Dates (2004) and Blended (2014). \n\nIn 1995, she and Nancy Juvonen formed a joint production company, Flower Films, and it went on to produce several films in which Barrymore also starred, such as Never Been Kissed (1999), Charlie's Angels (2000), Donnie Darko (2001) and her directorial debut Whip It! (2009)and Fever Pitch. Barrymore won a Screen Actors Guild Award and a Golden Globe Award for her performance in Grey Gardens (2009). She currently stars in the Netflix series Santa Clarita Diet (2017).\n\nEarly life\n\nAncestry\n\nBarrymore was born in Culver City, California, to actor John Drew Barrymore and aspiring actress Jaid (born Ildikó Jaid Makó). Jaid was born in a displaced persons camp in Brannenburg, West Germany, to Hungarian World War II refugees. Barrymore is one of four children with a half-brother, John, who is also an actor. Her parents divorced in 1984, when she was nine years old. \n\nShe was born into the Barrymore acting dynasty: All of her paternal great-grandparents – Maurice and Georgie Drew Barrymore, Maurice, and Mae Costello ( Altschuk) – as well as her paternal grandparents, John Barrymore and Dolores Costello, were actors,Stein Hoffman, Carol. The Barrymores: Hollywood's First Family. University Press of Kentucky, 2001.  with John being arguably the most acclaimed actor of his generation. Barrymore is a niece of Diana Barrymore, a grandniece of Lionel Barrymore, Ethel Barrymore, and Helene Costello,[http://www.barrymorefamily.com/costello.html \"The Costello Family.\"] BarrymoreFamily.com and a great-great-granddaughter of Irish-born John and English-born Louisa Lane Drew, all of whom were also actors. She was a great-grandniece of Broadway idol John Drew, Jr. and silent film actor, writer and director Sidney Drew.[http://www.barrymorefamily.com/fr_index.html?/drew.html \"The Drew family.\"] BarrymoreFamily.com \n\nHer godmothers are actress Sophia Loren and Lee Strasberg's widow Anna Strasberg; Barrymore described her relationship with the latter as one that \"would become so important to me as a kid because she was so kind and nurturing.\" Her godfather is director Steven Spielberg.\n\nHer first name, \"Drew\", was the maiden name of her paternal great-grandmother, Georgie Drew, and her middle name, \"Blythe,\" was the original surname of the dynasty founded by her great-grandfather, Maurice. Barrymore recounted in her 1989 autobiography, Little Girl Lost, early memories of her abusive father, who left the family when Barrymore was six months old. They never had anything resembling a significant relationship and seldom spoke to each other.\n\nChildhood\n\nBarrymore grew up on Poinsetta Place in West Hollywood until the age of 7, when she moved to Sherman Oaks. (In her 2015 memoir Wildflower, she says she talks \"like a valley girl\" because she grew up in Sherman Oaks.) She moved back to West Hollywood, upon becoming emancipated at 14. Barrymore attended elementary school at Fountain Day School in West Hollywood and Country School.\n\nIn the wake of her sudden stardom, Barrymore endured a notoriously troubled childhood. She was already a regular at the racy Studio 54 as a young girl, smoking cigarettes at the age of nine, drinking alcohol at age eleven, smoking marijuana at age twelve and snorting cocaine at age thirteen. Her nightlife and constant partying became a popular subject with the media. She was in rehab at the age of fourteen, and spent eighteen months in an institution for the mentally ill. A suicide attempt, also at 14, put her back in rehab, followed by a three-month stay with singer David Crosby (of rock group Crosby, Stills, Nash & Young) and his wife. The stay was precipitated, Crosby said, because she \"needed to be around some people that were committed to sobriety.\" Barrymore later described this period of her life in her autobiography, Little Girl Lost. After a successful juvenile court petition for emancipation, she moved into her own apartment at the age of fifteen.\n\nCareer\n\n1980s\n\nBarrymore's professional career began at eleven months, when she auditioned for a dog food commercial. She was nipped by her canine costar, to which she merely laughed and was hired for the job. After her film debut with a small role in Altered States (1980), she played Gertie in E.T. the Extra-Terrestrial (1982), directed by Steven Spielberg. He felt that she had the right imagination for her role after she impressed him with a story that she led a punk rock band. E.T. is the highest-grossing film of the 1980s and made her one of the most famous child stars of the time. For her work, she won a Young Artist Award for Best Supporting Actress.\n\nIn the 1984 science fiction horror adaptation of the 1980 eponymous Stephen King novel Firestarter, Barrymore played a girl with pyrokinesis who becomes the target of a secret government agency known as The Shop. The same year, she played a young girl divorcing her famous parents in Irreconcilable Differences, for which she was nominated for her first Golden Globe Award for Best Supporting Actress. In a review in the Chicago Sun-Times, Roger Ebert stated, \"Barrymore is the right actress for this role precisely because she approaches it with such grave calm.\"\n\nShe endured a troubled youth and continued to act intermittently during the decade. She starred in the 1985 anthology horror film Cat's Eye, written again by Stephen King. The film received positive reviews and Barrymore was nominated for a Young Artist Award for Best Leading Young Actress. She starred alongside Jeff Bridges and Alice Krige in the 1989 romantic comedy See You in the Morning. Vincent Canby of The New York Times criticized \"the fashionable phoniness\" of the film, but positively singled out Barrymore for her performance.\n\nAfter her twelve-day rehab treatment at ASAP, Barrymore starred in Far from Home (1989), as a teenager who gets stranded with her father in the small town in a remote part of the desert. The film went largely unnoticed by audiences and received negative reviews from critics, who dismissed the sexual portrayal of her role.\n\n1990s\n\nIn her late teens, her rebelliousness played itself out on screen and in print. Barrymore forged an image as a manipulative teenage seductress, beginning with Poison Ivy (1992), which was a box office failure, but was popular on video and cable. Her character Ivy was ranked at #6 on the list of the top 26 \"bad girls\" of all time by Entertainment Weekly. In 1992, Barrymore posed nude for the cover of the July issue of Interview magazine with her then-fiancé, actor Jamie Walters, as well as appearing nude in pictures inside the issue.\n\nIn the crime thriller Guncrazy (1992), she starred as a teenager who murders her sexually abusive stepfather, after he teaches her how to use a gun. Variety remarked she \"pulls off impressively\" her character, Barrymore was nominated for the Golden Globe Award. In 1993, she took on the role of the younger sister of a murdered ballerina in  No Place to Hide and starred as a writer followed by what is apparently her evil twin in Doppelganger. Both thrillers were panned by critics and failed to find an audience. She appeared in the western comedy Bad Girls (1994), which follows four former prostitutes on the run following a justifiable homicide and prison escape. Roger Ebert, in his review for the film, wrote for Chicago Sun-Times: \"What a good idea, to make a Western about four tough women. And what a sad movie.\"\n\nWhen she was nineteen, she posed nude for the January 1995 issue of Playboy. Steven Spielberg, who is also her godfather, gave her a quilt for her twentieth birthday with a note that read, \"Cover yourself up.\" Enclosed were copies of her Playboy pictures, with the pictures altered by his art department so that she appeared fully clothed. During her appearance on the Late Show with David Letterman, Barrymore climbed onto David Letterman's desk and bared her breasts to him, her back to the camera, in celebration of his birthday. She modeled in a series of Guess? jeans ads during this time.\n\nBy the mid and late 1990s, Barrymore re-established her image and continued to be a highly bankable star.  In Boys on the Side (1995), Barrymore played a pregnant girl who wants to escape from her abusive boyfriend. The film went little seen in theaters but was positively received by critics. In the same year, she appeared in Joel Schumacher's film Batman Forever, as Sugar, a moll to Two-Face (Tommy Lee Jones). In 1996, she made a brief but notable appearance in Wes Craven's slasher Scream. Barrymore read the film's script and was interested in being involved, approaching the production team herself to request a role. The producers were quick to take advantage of her unexpected interest, and signed her to play the lead role of Sidney Prescott, but when she was faced with unexpected commitments, she instead played the smaller role of Casey Becker.Diana Rico (October 31, 2001). E! A True Hollywood Story: Scream. E! (Television Production) Scream was released to critical acclaim and made an impressive US$173 million worldwide.\n\nIn The Wedding Singer (1998), Barrymore played Julia Sullivan, the friendly waitress of Robbie Hart (Adam Sandler). Variety found the film to be a \"spirited, funny and warm saga\" that serves them up \"in a new way that enhances their most winning qualities\". Budgeted at US$18 million, the film grossed US$123.3 million internationally. That same year, she starred in Home Fries, and Ever After which is inspired by the fairy tale Cinderella and served as a reminder, according to Roger Ebert, of how well Barrymore \"can hold the screen and involve us in her characters\". She played the title role in the television special Olive, the Other Reindeer, for which she was nominated for an Primetime Emmy Award. After Barrymore and Nancy Juvonen established Flower Films in 1995, she produced the company's first film, Never Been Kissed (1999), released to critical and commercial success.\n\n2000s\n\nIn Charlie's Angels (2000), Barrymore, Cameron Diaz and Lucy Liu played the trio of investigators in Los Angeles. The film was a major box office success and helped solidify the standing between Barrymore and the company. Barrymore starred in Riding in Cars with Boys (2001), as a teenage mother in a failed marriage with the drug-addicted father (based on Beverly Donofrio's real-life story). When the production of Richard Kelly's Donnie Darko was threatened, Barrymore stepped forward with financing from the company, and played the title character's English teacher. Although the film was less than successful at the box office in the wake of 9/11, it reached cult film status after the DVD release, inspiring numerous websites devoted to unraveling the plot twists and meanings.\n\nIn 2002, Barrymore starred with Sam Rockwell and Julia Roberts in George Clooney's directorial debut Confessions of a Dangerous Mind, based on the autobiography of television producer Chuck Barris. In 2003, she reprised her role as Dylan Sanders in Charlie's Angels: Full Throttle, and starred with Ben Stiller in Duplex. Flower Films and Happy Madison Productions produced 50 First Dates (2004), which Barrymore reunited with Adam Sandler. Summing up Barrymore's appeal, Roger Ebert, in his review for the film, remarked that Barrymore displayed a \"smiling, coy sincerity,\" in what he described as a \"ingratiating and lovable\" film.\n\nIn the American adaptation of the 1997 eponymous British remake Fever Pitch (2005), Barrymore played Lindsey Meeks, the love interest of Ben Wrightman (Jimmy Fallon). The film grossed a modest US$50 million worldwide and was favorably by reviewers who felt it \"has enough charm and on-screen chemistry between [Fallon and Barrymore] to make it a solid hit\".\n\nShe and Hugh Grant starred in Music and Lyrics, which focuses on the relationship that evolves between a former pop music idol and an aspiring writer as they struggle to compose a song for a reigning pop diva. The romantic comedy, released in February 2007, received largely positive reviews, with the Washington Post finding the two to be \"great together\" in it. The film was a commercial success, grossing US$145 million globally. That same year, Barrymore starred in Curtis Hanson's Lucky You. A lukewarm critical and commercial reception greeted the film upon its release, with The New Yorker remarking that her role \"belongs in front of a sixth-grade class, not [where the film is set].\"\n\nIn 2009, Barrymore starred in the ensemble comedy He's Just Not That Into You, which garnered mixed reviews from critics, who observed her limited time on screen, while it grossed US$178 million worldwide. She played the lead role of Edith Bouvier Beale, the daughter of Edith Ewing Bouvier Beale (Jessica Lange), in the HBO film Grey Gardens, directed by Michael Sucsy and based on the 1975 documentary of the same name. The television film was a huge success, winning five Primetime Emmy Awards and two Golden Globe Awards. Rolling Stone writer Peter Travels found Barrymore to be a \"revelation\" in her role and she won the Best Supporting Actress – Series, Miniseries or Television Film for her performance.\n\nBarrymore made her directorial debut film Whip It (2009), in which she also starred alongside Ellen Page and Marcia Gay Harden, and centers on an obsession with beauty pageants and the Austin Hurl Scouts roller derby team. Critical reception towards the film was largely positive despite it not making an impression commercially. For her venture, she was nominated for a Bronze Horse at the Stockholm Film Festival and for the EDA Female Focus Award at the 2009 Alliance of Women Film Journalists. In Everybody's Fine, Barrymore played the daughter of Frank Goode (Robert De Niro). The drama flopped at the box office and garnered average reviews, but Stephen Holden for The New York Times considered Barrymore \"as ingenuous as ever\" in what he described as a \"small role\".\n\n2010s\n\nIn 2010, Barrymore costarred with Justin Long in Nanette Burstein's Going the Distance. The film follows a couple dealing the ups and downs of a long-distance relationship, while commuting between New York City and San Francisco. It garnered generally mixed reviews by critics, who summed it as \"timelier and a little more honest than most romantic comedies\", and budgeted at US$32 million, the film made US$40 million at the worldwide box office.\n\nOn August 2, 2011, Barrymore directed the music video for the song \"Our Deal,\" for the band Best Coast, which features Chloë Grace Moretz, Miranda Cosgrove, Tyler Posey, Donald Glover, Shailene Woodley and Alia Shawkat. Barrymore starred with John Krasinski in the drama Big Miracle (2012), which covers Operation Breakthrough, the 1988 international effort to rescue gray whales from being trapped in ice near Point Barrow, Alaska. The film saw her play Rachel Krameron, based on Greenpeace activist Cindy Lowry. Despite a positive critical reception, the film bombed commercially.\n\nIn Blended (2014), Barrymore played Lauren Reynolds, a recently divorced woman ending up on a family resort with Jim Friedman (Adam Sandler). Film critic James Berardinelli dismissed the \"hit-and-miss humor\" of the story and wrote that \"as [Sandler and Barrymore] are concerned, the third time is definitely not the charm\", as part of an overall lukewarm critical response. The film, however, ultimately grossed US$128 million worldwide. She and Toni Collette starred in Miss You Already (2015), as two long-time friends whose relationship is put to the test when one starts a family and the other becomes ill. Reviewers embraced the film, while it received a limited theatrical release.\n\nBarrymore and Timothy Olyphant starred in the Netflix sitcom Santa Clarita Diet, as a couple leading vaguely discontented lives that take a dark turn when the wife becomes a zombie. Both actors have executive producing roles. The single-camera series premiered on February 3, 2017.\n\nCareer in beauty and fashion\n\nBarrymore became a CoverGirl Cosmetics's model and spokeswoman in 2007. In February 2015, she remained one of the faces of CoverGirl, alongside Queen Latifah and Taylor Swift. The company partnered with her because \"she emulates the iconic image of CoverGirl with her fresh, natural beauty and energetic yet authentic spirit,\" said Esi Eggleston Bracey, Vice President and General Manager of CoverGirl Cosmetics North America. She brought not only her personality into this endorsement but also her creative side, as she also helped create the ads. Fashion section, Barrymore web site She was No. 1 in People's annual 100 Most Beautiful People list in 2007. Later, she was named the new face for the Gucci jewelry line. As a model, Barrymore signed a contract with IMG Models New York City.\n\nShe launched a women's fashion line in fall 2017 in conjunction with Amazon.com called Dear Drew which featured a pop-up shop in New York City that opened in November.\"Star Shots,\" Star magazine, Dec. 11, 2017, p. 14.\n\nOther work\n\nIn May 2007, Barrymore was named Ambassador Against Hunger for the United Nations World Food Programme and later donated $1 million to the cause. As a guest photographer for a magazine series called \"They Shoot New York,\" she appeared on the cover holding a Pentax K1000 film camera. She expressed hopes of exposing her work in a gallery one day, as she had documented the most recent decade of her life with a Pentax camera.\n\nPersonal life\n\nAt age 16 in 1991, Barrymore became engaged to Leland Hayward, namesake and grandson of Hollywood producer Leland Hayward. The engagement was called off a few months later. Barrymore was engaged to and lived with musician and actor Jamie Walters from 1992 to 1993.\n\nShe married her first husband, Welsh-born Los Angeles bar owner Jeremy Thomas, at age nineteen on March 20, 1994. She filed for divorce from him less than two months later.\n\nBarrymore dated MTV host and comedian Tom Green in 1999, before getting engaged in July 2000 and married a year later. Together, they starred in Charlie's Angels and Green's directorial film debut  Freddy Got Fingered. Green filed for divorce in December 2001, which was finalized on October 15, 2002.\n\nIn 2002, she began dating The Strokes' drummer Fabrizio Moretti, soon after they met at a concert. Their five-year relationship ended in January 2007. She began dating Justin Long, but they broke up in July 2008. While filming Going the Distance, Barrymore and Long reunited in 2009, but broke up again the next year.\n\nIn early 2011, Barrymore began dating art consultant Will Kopelman, the son of former Chanel CEO Arie Kopelman. The couple announced their engagement in January 2012, and married on June 2, 2012 in Montecito, California. Four days later, the couple's wedding image appeared on the cover of People magazine. Barrymore and Kopelman have two daughters: Olive Barrymore Kopelman (born 2012) and Frankie Barrymore Kopelman (born 2014). On April 2, 2016, Barrymore and Kopelman released a statement confirming they had separated and intended to divorce. On July 15, 2016, Barrymore officially filed for divorce, which was finalized on August 3, 2016.\n\nBarrymore said in an interview with Contact Music in 2003 that she had always considered herself bisexual.\n\nBarrymore is the godmother of Kurt Cobain and Courtney Love's daughter, Frances Bean Cobain.\n\nFilmography\n\nAwards, honors, and nominations\n\nIn 1999, Barrymore was honored by the Young Artist Foundation with its Former Child Star \"Lifetime Achievement\" Award commemorating her outstanding achievements within the film industry as a child actress. \n\nFor her contributions to the film industry, Barrymore received a motion pictures star on the Hollywood Walk of Fame in 2004. Her star is located at 6925 Hollywood Boulevard.\n\nBarrymore's films compiled a worldwide box office gross that stood at over US$2.3 billion. According to The Hollywood Reporter's annual Star Salary Top 10, she was tied for eighth place on the top ten list of actresses' salaries, commanding 10 to 12 million dollars per film for 2006. Barrymore became the youngest person to have hosted Saturday Night Live (SNL) having hosted on November 20, 1982 at 7 years of age, a record that remained unbroken as of 2015. On February 3, 2007, Barrymore hosted SNL for the fifth time, making her the second female host (after Candice Bergen) in the show's history to do so. She hosted again on October 10, 2009, becoming the first female to host six times. Drew Barrymore. http://en.wikipedia.org/?curid=7886."
  }
}
