{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18623",
  "eid" : "340095b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778596491,
  "textBody" : "Lausanne (,, , and also Lausannen , ) is a city in the French-speaking part of Switzerland, and the capital and biggest city of the canton of Vaud. The city is situated on the shores of Lake Geneva (, or simply Le Léman). It faces the French town of Évian-les-Bains, with the Jura Mountains to its north-west. Lausanne is located 62 km northeast of Geneva.\n\nLausanne has a population (as of November 2015) of 146,372, making it the fourth largest city in Switzerland, with the entire agglomeration area having 420,000 inhabitants (as of March 2015). The metropolitan area of Lausanne-Geneva (including Vevey-Montreux, Yverdon-les-Bains, and foreign parts) was over 1.2 million inhabitants in 2000.\n\nLausanne is a focus of international sport, hosting the International Olympic Committee (which recognizes the city as the \"Olympic Capital\" since 1994), the Court of Arbitration for Sport and some 55 international sport associations. It lies in a noted wine-growing region. The city has a 28-station metro system, making it the smallest city in the world to have a rapid transit system. Lausanne will host the 2020 Winter Youth Olympics.\n\nHistory\n\nThe Romans built a military camp, which they called Lousanna, at the site of a Celtic settlement, near the lake where currently Vidy and Ouchy are situated; on the hill above was a fort called 'Lausodunon' or 'Lousodunon' (The 'y' suffix is common to many place names of Roman origin in the region (e.g.) Prilly, Pully, Lutry, etc.). By the 2nd century AD it was known as vikanor[um] Lousonnensium and in 280 as lacu Lausonio. By 400 it was civitas Lausanna and in 990 it was mentioned as Losanna.\n\nAfter the fall of the Roman Empire, insecurity forced the Lausanne to move to its current centre, a hilly site that was easier to defend. The city which emerged from the camp was ruled by the Dukes of Savoy and the Bishop of Lausanne. Then it came under Bern from 1536 to 1798 and a number of its cultural treasures, including the hanging tapestries in the Cathedral, were permanently removed. Lausanne has made a number of requests to recover them.\n\nAfter the revocation of the Edict of Nantes in 1685, Lausanne became (along with Geneva) a place of refuge for French Huguenots. In 1729 a seminary was opened by Antoine Court and Benjamin Duplan. By 1750, ninety pastors had been sent back to France to work clandestinely; this number would rise to four hundred. Official persecution ended in 1787; a faculty of Protestant theology was established at Montauban in 1808, and the Lausanne seminary was finally closed on 18 April 1812. Also  During the Napoleonic Wars, the city's status changed. In 1803, it became the capital of a newly formed Swiss canton, Vaud under which it joined the Swiss Federation.\n\nModern history and heritage\n\nIn 1964 the city hosted the 'Swiss National Exhibition', displaying its newly found confidence to host major international events.\n\nFrom the 1950s to 1970s a large number of Italians, Spaniards and Portuguese immigrated, settling mostly in the industrial district of Renens and transforming the local diet.\n\nThe city has served as a refuge for European artists. While under the care of a psychiatrist at Lausanne, T. S. Eliot composed most of his 1922 poem The Wasteland (\"by the waters of Leman I sat down and wept\"). Hemingway also visited from Paris with his wife during the 1920s, to holiday. In fact, many creative people - such as Edward Gibbon, an historian, and Romantic era poets Shelley and Byron - have \"sojourned, lived, and worked in Lausanne or nearby\".\n\nThe city has been traditionally quiet, but in the late 1960s and early 1970s a series of demonstrations took place that exposed tensions between young people and the police. Later demonstrations took place to protest against the high cinema prices, followed by protest against the G8 meetings in 2003.\n\nGeography\n\nTopography\n\nThe most important geographical feature of the area surrounding Lausanne is Lake Geneva (Lac Léman in French). Lausanne is built on the southern slope of the Swiss plateau, with a difference in elevation of about 500 m between the lakeshore at Ouchy and its northern edge bordering Le Mont-sur-Lausanne and Épalinges. Lausanne boasts a dramatic panorama over the lake and the Alps.\n\nIn addition to its generally southward-sloping layout, the centre of the city is the site of an ancient river, the Flon, which has been covered since the 19th century. The former river forms a gorge running through the middle of the city south of the old city centre, generally following the course of the present Rue Centrale, with several bridges crossing the depression to connect the adjacent neighbourhoods. Due to the considerable differences in elevation, visitors should make a note as to which plane of elevation they are on and where they want to go, otherwise they will find themselves tens of metres below or above the street which they are trying to negotiate. The name Flon is also used for the metro station located in the gorge.\n\nThe municipality includes the villages of Vidy, Cour, Ouchy, Mornex, Chailly, La Sallaz, Vennes, Montblesson, Vers-chez-les-Blanc, Montheron and Chalet-à-Gobet (871 m) as well as the exclave of Vernand.\n\nLausanne is located at the limit between the extensive wine-growing regions of Lavaux (to the east) and la Côte (to the west).\n\nLausanne has an area, , of  (depending on calculation method). Of this area,  or 16.0% is used for agricultural purposes, while  or 39.1% is forested. Of the rest of the land,  or 44.6% is settled (buildings or roads),  or 0.1% is either rivers or lakes and  or 0.0% is unproductive land.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/02/03/blank/data/gemeindedaten.html Swiss Federal Statistical Office-Land Use Statistics] 2009 data.  Retrieved 25 March 2010.\n\nOf the built-up area, industrial buildings made up 1.6% of the total area while housing and buildings made up 21.6% and transportation infrastructure made up 12.5%. Power and water infrastructure as well as other special developed areas made up 1.4% of the area while parks, green belts and sports fields made up 7.5%. Out of the forested land, all of the forested land area is covered with heavy forests. Of the agricultural land, 11.1% is used for growing crops and 4.2% is pastures. All the water in the municipality is in lakes.\n\nThe municipality was part of the old Lausanne District until it was dissolved on 31 August 2006, and it became the capital of the new district of Lausanne.[http://www.bfs.admin.ch/bfs/portal/de/index/infothek/nomenklaturen/blank/blank/gem_liste/02.html Nomenklaturen – Amtliches Gemeindeverzeichnis der Schweiz].  Retrieved 4 April 2011.\n\nClimate\n\nLausanne has an average of 119.7 days of rain or snow per year and on average receives 1153 mm of precipitation. The wettest month is May during which time Lausanne receives an average of 117 mm of rain. During this month there is precipitation for an average of 12.1 days. The driest month of the year is February with an average of 67 mm of precipitation over 8.8 days.\nThe USDA Hardiness Zone for Lausanne-Pully is 8b with an average minimum temperature of -7.0 C over the past 20 years (1997 - 2016), but at the lake level, it can be considered as 9a.\n\nPolitics\n\nCoat of arms\n\nThe blazon of the municipal coat of arms is Gules, chief argent.\n\nAdministrative divisions\n\nThe city is divided into 18 quartiers, or districts, sometimes composed of several neighborhoods. They are: Centre (1), Maupas/Valency (2), Sébeillon/Malley (3), Montoie/Bourdonnette (4), Montriond/Cour (5), Sous-Gare/Ouchy (6), Montchoisi (7), Florimont/Chissiez (8), Mousquines/Bellevue (9), Vallon/Béthusy (10), Chailly/Rovéréaz (11), Sallaz/Vennes/Séchaud (12), Sauvabelin (13), Borde/Bellevaux (14), Vinet/Pontaise (15), Bossons/Blécherette (16), Beaulieu/Grey/Boisy (17), and Les Zones foraines (90)\n\nGovernment\n\nThe Municipality (la Municipalité) constitutes the executive government of the City of Lausanne and operates as a collegiate authority. It is composed of seven councilors (), each presiding over a directorte. One of the members act as mayor (syndic). In the mandate period 2016–2021 (la législature) the Municipality is presided by Monsieur le Syndic Grégoire Junod. Directoral tasks, coordination measures and implementation of laws decreed by the Communal Council are carried by the Municipality. The regular election of the Municipality by any inhabitant valid to vote is held every five years. Any resident of Lausanne allowed to vote can be elected as a member of the Municipality. Since 14 April 2003, due to the constitution by canton of Vaud not only Swiss citizen have the right to vote and elect and being elected on communal level, but also foreigners with a residence permit of at least 10 years in Switzerland and 3 years in the canton of Vaud. The current mandate period is from 1 July 2016 to 30 June 2021. The delegates are elected by means of a system of Majorz. The mayor is later on elected as such by a public election as well by a system of Majorz, while the heads of the other departments are assigned by the collegiate. The executive body holds its meetings in the Town Hall (L'Hôtel de Ville), in the old city on Place de la Palud.\n\n, Lausanne's Municipality is made up of three representatives of the PS (Social Democratic Party, of whom one is also the mayor), and two members of PES (Green Party), and one each of le Parti Ouvrier et Populaire Vaudois (POP) & gauche en mouvement (an alliance of the left parties POP (Parti Suisse du Travail - Parti Ouvrier et Populaire) and solidaritéS and indépendant.e.s), and PLR (Les Libéraux-Radicaux (PLR)), giving the left parties a very strong six out of seven seats. The last election was held on 28 February/20 March 2016. The mayor was elected by two ballots on 17 April/8 May 2016.\n\nSimon Affolter is Town Chancellor (chancelier municipal) since for the Municipality.\n\nParliament\n\nThe Communal Council (Conseil communal) holds legislative power. It is made up of 100 members, with elections held every five years. The Communal Council decrees regulations and by-laws that are executed by the Municipality and the administration. The sessions of the Communal Council are public. Unlike members of the Municipality, members of the Communal Council are not politicians by profession, and they are paid a fee based on their attendance. Any resident of Lausanne allowed to vote can be elected as a member of the Communal Council. Since 14 April 2003, due to the constitution by canton of Vaud not only Swiss citizen have the right to vote and elect and being elected on communal level, but also foreigners with a residence permit of at least 10 years in Switzerland and 3 years in the canton of Vaud. The Parliament holds its meetings in the Town Hall (Hôtel de Ville), in the old city on Place de la Palud.\n\nThe last election of the Communal Council was held on 28 February 2016 for the mandate period (la législature) from 1 June 2016 to 31 May 2021. Currently the Communal Council consist of 33 members of the Social Democratic Party (PS), 21 Les Libéraux-Radicaux (PLR), 17 Green Party (PES), 12 Swiss People's Party (UDC), 11 Ensemble à Gauche (an alliance of the left parties POP (Parti Suisse du Travail - Parti Ouvrier et Populaire) and solidaritéS and indépendant.e.s), and 6 Le Centre (an alliance of Christian Democratic People's Party (PDC) and Green Liberal Party (pvl)).\n\nElections\n\nNational Council\n\nIn the 2015 federal election for the Swiss National Council the most popular party was the PS which received 30.8% of the vote. The next three most popular parties were the PLR (18.6%), the Green Party (15.9%), and the UDC (15.4%). In the federal election, a total of 26,116 voters were cast, and the voter turnout was 41.0%.\n\nDemographics\n\nPopulation\n\nLausanne has a population () of . , 42% of the population were resident foreign nationals. Over the last 10 years (1999–2009) the population has changed at a rate of 9.9%. It has changed at a rate of 8.3% due to migration and at a rate of 2.6% due to births and deaths.[http://www.bfs.admin.ch/bfs/portal/en/index/regionen/02/key.html Swiss Federal Statistical Office] . Retrieved 21 June 2011. The population of the greater Lausanne area (grand Lausanne) is 402,900 (as of December 2014).\n\nOf the population in the municipality, 58% or 80,828 have a Swiss citizenship, while 16,908 or 12.1% are from Lausanne and still lived there in December 2013. There were 27,653 or 19.8% who are from somewhere else in the same canton, while 36,276 or 26.0% have a Swiss citizenship in another canton. 58,9562 or 42.0% have a foreign citizenship.\n\nIn 2000, most of the population spoke French (98,424 or 78.8%), with German being second most common (5,365 or 4.3%) and Italian being third (4,976 or 4.0%). There were 62 people who speak Romansh.\n\nIn  there were 840 live births to Swiss citizens and 623 births to non-Swiss citizens, and in same time span there were 862 deaths of Swiss citizens and 127 non-Swiss citizen deaths. Ignoring immigration and emigration, the population of Swiss citizens decreased by 22 while the foreign population increased by 496. There were 9 Swiss men and 57 Swiss women who emigrated from Switzerland. At the same time, there were 2230 non-Swiss men and 1802 non-Swiss women who immigrated from another country to Switzerland. The total Swiss population change in 2008 (from all sources, including moves across municipal borders) was an increase of 883 and the non-Swiss population increased by 2221 people. This represents a population growth rate of 2.6%.[http://www.bfs.admin.ch/bfs/portal/de/index/infothek/onlinedb/superweb/login.html Swiss Federal Statistical Office - Superweb database - Gemeinde Statistics 1981-2008] .  Retrieved 19 June 2010.\n\nThe age distribution, , in Lausanne is; 11,818 children or 9.4% of the population are between 0 and 9 years old and 12,128 teenagers or 9.7% are between 10 and 19. Of the adult population, 21,101 people or 16.8% of the population are between 20 and 29 years old. 22,158 people or 17.6% are between 30 and 39, 18,016 people or 14.4% are between 40 and 49, and 13,940 people or 11.1% are between 50 and 59. The senior population distribution is 11,041 people or 8.8% of the population are between 60 and 69 years old, 8,277 people or 6.6% are between 70 and 79, there are 5,896 people or 4.7% who are between 80 and 89, and there are 1,171 people or 0.9% who are 90 and older.[http://www.scris.vd.ch/Default.aspx?DomID\n2016 Canton of Vaud Statistical Office].  Retrieved 29 April 2011.\n\n, there were 58,100 people who were single and never married in the municipality. There were 48,990 married individuals, 7,797 widows or widowers and 10,027 individuals who are divorced.[http://www.pxweb.bfs.admin.ch/Database/German_40%20-%20Eidgen%C3%B6ssische%20Volksz%C3%A4hlung/40.3%20-%202000/40.3%20-%202000.asp?lang\n1&prod40&secprod\n3&openChild=true STAT-TAB Datenwürfel für Thema 40.3 - 2000] .  Retrieved 2 February 2011.\n\n the average number of residents per living room was 0.64 which is about equal to the cantonal average of 0.61 per room. In this case, a room is defined as space of a housing unit of at least 4 m² as normal bedrooms, dining rooms, living rooms, kitchens and habitable cellars and attics. About 6.5% of the total households were owner occupied, or in other words did not pay rent (though they may have a mortgage or a rent-to-own agreement).Urban Audit Glossary p. 17.\n\n, there were 62,258 private households in the municipality, and an average of 1.9 persons per household. There were 31,205 households that consist of only one person and 2,184 households with five or more people. Out of a total of 63,833 households that answered this question, 48.9% were households made up of just one person and there were 306 adults who lived with their parents. Of the rest of the households, there are 13,131 married couples without children and 11,603 married couples with children. There were 3,883 single parents with a child or children. There were 2,130 households that were made up of unrelated people, and 1,575 households that were made up of some sort of institution or another collective housing.\n\n there were 1,833 single family homes (or 23.1% of the total) out of a total of 7,925 inhabited buildings. There were 3,634 multi-family buildings (45.9%), along with 1,955 multi-purpose buildings that were mostly used for housing (24.7%) and 503 other use buildings (commercial or industrial) that also had some housing (6.3%). Of the single family homes 324 were built before 1919, while 153 were built between 1990 and 2000. The greatest number of single family homes (498) were built between 1919 and 1945. The most multi-family homes (933) were built before 1919 and the next most (906) were built between 1919 and 1945. There were 180 multi-family houses built between 1996 and 2000.[http://www.pxweb.bfs.admin.ch/Database/German_09%20-%20Bau-%20und%20Wohnungswesen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen.asp?lang\n1&prod09&secprod\n2&openChild=true Swiss Federal Statistical Office STAT-TAB - Datenwürfel für Thema 09.2 - Gebäude und Wohnungen] .  Retrieved 28 January 2011.\n\n there were 69,383 apartments in the municipality. The most common apartment size was 3 rooms of which there were 22,408. There were 9,579 single room apartments and 7,388 apartments with five or more rooms. Of these apartments, a total of 61,056 apartments (88.0% of the total) were permanently occupied, while 6,840 apartments (9.9%) were seasonally occupied and 1,487 apartments (2.1%) were empty. , the construction rate of new housing units was 2.1 new units per 1000 residents.\n\n the average price to rent an average apartment in Lausanne was 1064.08 Swiss francs (CHF) per month (US$850, £480, €680 approx. exchange rate from 2003). The average rate for a one-room apartment was 597.46 CHF (US$480, £270, €380), a two-room apartment was about 792.33 CHF (US$630, £360, €510), a three-room apartment was about 1044.64 CHF (US$840, £470, €670) and a six or more room apartment cost an average of 2024.55 CHF (US$1620, £910, €1300). The average apartment price in Lausanne was 95.3% of the national average of 1116 CHF.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/05/06/blank/key/einfuehrung.html Swiss Federal Statistical Office-Rental prices] 2003 data.  Retrieved 26 May 2010. The vacancy rate for the municipality, , was 0.17%.\n\nHistoric population\n\nThe historical population is given in the following chart:\n\nColors=\n  id:lightgrey value:gray(0.9)\n  id:darkgrey  value:gray(0.8)\nImageSize  = width:1100 height:500\nPlotArea   = height:350 left: 100 bottom:90 right:100\nLegend     = columns:3 left:220 top:70 columnwidth:160\nAlignBars  = justify\nDateFormat = x.y\nPeriod     = from:0 till:140000\nTimeAxis   = orientation:vertical\nAlignBars  = justify\nScaleMajor = gridcolor:darkgrey increment:30000 start:0\nScaleMinor = gridcolor:lightgrey increment:6000 start:0\nColors=\n id:TO     value:yellowgreen      legend:Total\n id:FR     value:teal      legend:French_Speaking\n id:GE     value:green      legend:German_Speaking\n id:CA     value:lightpurple      legend:Catholic\n id:PR     value:oceanblue      legend:Protestant\n id:SW     value:red      legend:Swiss\nPlotData=\n  color:yellowgreen width:40   mark:(line,white) align:center\n  bar:1850 from:start till:17108 text:\"17,108\" color:TO\n  bar:1870a from:start till:25845 text:\"25,845\" color:TO\n  bar:1888 from:start till:33340 text:\"33,340\" color:TO\n  bar:1900 from:start till:46732 text:\"46,732\" color:TO\n  bar:1910 from:start till:64446 text:\"64,446\" color:TO\n  bar:1930 from:start till:75915 text:\"75,915\" color:TO\n  bar:1950 from:start till:106807 text:\"106,807\" color:TO\n  bar:1970 from:start till:137383 text:\"137,383\" color:TO\n  bar:1990 from:start till:128112 text:\"128,112\" color:TO\n  bar:2000 from:start till:124914 text:\"124,914\" color:TO\nLineData =\n  points:(300,154)(400,179)  color:FR\n  points:(400,179)(500,206)  color:FR\n  points:(500,206)(600,237)  color:FR\n  points:(600,237)(700,311)  color:FR\n  points:(700,311)(800,344)  color:FR\n  points:(800,344)(900,329)  color:FR\n  points:(900,329)(1000,336)  color:FR\n  points:(300,104)(400,107)  color:GE\n  points:(400,107)(500,114)  color:GE\n  points:(500,114)(600,118)  color:GE\n  points:(600,118)(700,121)  color:GE\n  points:(700,121)(800,120)  color:GE\n  points:(800,120)(900,107)  color:GE\n  points:(900,107)(1000,103)  color:GE\n  points:(100,92)(200,99)  color:CA\n  points:(200,99)(300,101)  color:CA\n  points:(300,101)(400,113)  color:CA\n  points:(400,113)(500,129)  color:CA\n  points:(500,129)(600,132)  color:CA\n  points:(600,132)(700,158)  color:CA\n  points:(700,158)(800,227)  color:CA\n  points:(800,227)(900,231)  color:CA\n  points:(900,231)(1000,208)  color:CA\n  points:(100,130)(200,146)  color:PR\n  points:(200,146)(300,161)  color:PR\n  points:(300,161)(400,182)  color:PR\n  points:(400,182)(500,205)  color:PR\n  points:(500,205)(600,231)  color:PR\n  points:(600,231)(700,279)  color:PR\n  points:(700,279)(800,278)  color:PR\n  points:(800,278)(900,211)  color:PR\n  points:(900,211)(1000,180)  color:PR\n  points:(100,130)(200,146)  color:SW\n  points:(200,146)(300,161)  color:SW\n  points:(300,161)(400,183)  color:SW\n  points:(400,183)(500,212)  color:SW\n  points:(500,212)(600,253)  color:SW\n  points:(600,253)(700,333)  color:SW\n  points:(700,333)(800,356)  color:SW\n  points:(800,356)(900,312)  color:SW\n  points:(900,312)(1000,291)  color:SW\n\nReligion\n\nFrom the Reformation in the 16th century, the city was mostly Protestant until the late 20th century, when it received substantial immigration, particularly from largely Catholic countries. Catholics now form a plurality of the city's population.\n\nFrom the , 47,225 people (37.8% of the population) were Roman Catholic, while 33,993 (27.2%) belonged to the Swiss Reformed Church. Of the rest of the population, there were 2,698 members of an Orthodox church (2.16%), there were 65 individuals (0.05%) who belonged to the Christian Catholic Church, and there were 4,437 individuals (3.55%) who belonged to another Christian church. There were 849 individuals (0.68%) who were Jewish, and 7,501 (6.00%) who were Muslim. There were 452 individuals who were Buddhist, 772 individuals who were Hindu and 343 individuals who belonged to another church. 21,080 (16.88%) belonged to no church, were agnostic or atheist, and 7,590 individuals (6.08%) did not answer the question.\n\nCrime\n\nIn 2014 the crime rate, of crimes listed in the Swiss Criminal Code, in Lausanne was 167.3 per thousand residents. During the same period, the rate of drug crimes was 49.5 per thousand residents, and the rate of violations of immigration, visa and work permit laws was 21 per thousand residents.[https://www.atlas.bfs.admin.ch/maps/13/de/11488_11587_3864_7266/19010.html Statistical Atlas of Switzerland]. Retrieved 5 April 2016.\n\nTransport\n\nLausanne is served by an extensive network of local, national and international public transport. National and international passenger trains of the Swiss Federal Railways depart from Lausanne railway station, which is also the hub of the Réseau Express Vaudois commuter rail system, and a stop on the city's metro. The metro and local buses are operated by Transports publics de la région lausannoise (TL), with many routes run using trolleybuses. Additional commuter trains are run by the Lausanne–Echallens–Bercher railway (LEB) from Lausanne-Flon station. Ships across Lake Geneva are provided by the Compagnie Générale de Navigation sur le lac Léman (CGN).\n\nLausanne became the first city in Switzerland to have a rubber-tyred metro system, with the m2 Line which opened in October 2008. The rolling stock is a shorter version of the one used on Paris Métro Line 14. Further expansion of the system is planned, as is the re-introduction of trams.\n\nLausanne is connected to the A1 motorway on its west side (Geneva - Zürich axis) and to the A9 on its north and east side (for transit with Italy and France); the interchange between these two motorways is on the north-west side of the city.\n\nLausanne Airport is located at Blécherette, and also houses a Boeing 737 Simulator. The city is also directly linked by train to the Geneva International Airport, four times an hour, in 42min.\n\nEconomy\n\n, Lausanne had an unemployment rate of 8%. , there were 114 people employed in the primary economic sector and about 25 businesses involved in this sector. 6,348 people were employed in the secondary sector and there were 698 businesses in this sector. 83,157 people were employed in the tertiary sector, with 6,501 businesses in this sector.\n\nThere were 59,599 residents of the municipality who were employed in some capacity, of which females made up 47.4% of the workforce.  the total number of full-time equivalent jobs was 75,041. The number of jobs in the primary sector was 93, of which 56 were in agriculture, 34 were in forestry or lumber production and 3 were in fishing or fisheries. The number of jobs in the secondary sector was 6,057 of which 1,515 or (25.0%) were in manufacturing, 24 or (0.4%) were in mining and 3,721 (61.4%) were in construction. The number of jobs in the tertiary sector was 68,891. In the tertiary sector; 8,520 or 12.4% were in wholesale or retail sales or the repair of motor vehicles, 2,955 or 4.3% were in the movement and storage of goods, 4,345 or 6.3% were in a hotel or restaurant, 4,671 or 6.8% were in the information industry, 6,729 or 9.8% were the insurance or financial industry, 8,213 or 11.9% were technical professionals or scientists, 5,756 or 8.4% were in education and 14,312 or 20.8% were in health care.[http://www.pxweb.bfs.admin.ch/Database/German_06%20-%20Industrie%20und%20Dienstleistungen/06.2%20-%20Unternehmen/06.2%20-%20Unternehmen.asp?lang1&prod\n06&secprod2&openChild\ntrue Swiss Federal Statistical Office STAT-TAB Betriebszählung: Arbeitsstätten nach Gemeinde und NOGA 2008 (Abschnitte), Sektoren 1-3] .  Retrieved 28 January 2011.\n\n, there were 55,789 workers who commuted into the municipality and 19,082 workers who commuted away. The municipality is a net importer of workers, with about 2.9 workers entering the municipality for every one leaving. About 1.9% of the workforce coming into Lausanne are coming from outside Switzerland, while 0.1% of the locals commute out of Switzerland for work.[http://www.media-stat.admin.ch/stat/pendler/pop.php Swiss Federal Statistical Office - Statweb] .  Retrieved 24 June 2010. Of the working population, 40.9% used public transportation to get to work, and 35.1% used a private car.\n\n* Philip Morris International, a tobacco company, has its international headquarters in Lausanne.\n* Tetra Laval, a multinational packaging corporation, has its international headquarters in Lausanne.\n* Nespresso, an operating unit of the Nestlé Group, based in Lausanne, Switzerland.\n* Logitech, the computer peripherals company has its headquarters in Lausanne.\n\nEducation\n\nIn Lausanne about 40,118 or (32.1%) of the population have completed non-mandatory upper secondary education, and 22,934 or (18.4%) have completed additional higher education (either university or a Fachhochschule). Of the 22,934 who completed tertiary schooling, 38.7% were Swiss men, 31.3% were Swiss women, 17.1% were non-Swiss men and 12.9% were non-Swiss women.\n\nIn the 2009/2010 school year there were a total of 12,244 students in the Lausanne school district. In the Vaud cantonal school system, two years of non-obligatory pre-school are provided by the political districts. During the school year, the political district provided pre-school care for a total of 2,648 children of which 1,947 children (73.5%) received subsidized pre-school care. The canton's primary school program requires students to attend for four years. There were 6,601 students in the municipal primary school program. The obligatory lower secondary school program lasts for six years and there were 5,244 students in those schools. There were also 399 students who were home schooled or attended another non-traditional school.[http://www.scris.vd.ch/Default.aspx?DomID\n2403 Canton of Vaud Statistical Office - Scol. obligatoire/filières de transition].  Retrieved 2 May 2011.\n\nLausanne is home to a number of museums including; the Collection de l'art brut, the Espace Arlaud, the Fondation de l'Hermitage, the Musée cantonal d'archéologie et d'histoire, the Musée cantonal de géologie, the Musée cantonal de zoologie, the Cantonal Museum of Fine Arts, the Museum of Contemporary Design and Applied Arts, the Musée de l'Élysée and the Musée historique de Lausanne.[http://www.scris.vd.ch/Default.aspx?DomID\n2181 Canton of Vaud Statistical Office - Fréquentation de quelques musées et fondations, Vaud, 2001-2009].  Retrieved 2 May 2011. In 2009 the Collection de l'art brut was visited by 27,028 visitors (the average in previous years was 33,356). The Espace Arlaud was visited by 9,222 visitors (the average in previous years was 14,206). The Fondation de l'Hermitage was visited by 89,175 visitors (the average in previous years was 74,839). The Musée cantonal d'archéologie et d'histoire was visited by 14,841 visitors (the average in previous years was 15,775). The Musée cantonal de zoologie was visited by 30,794 visitors (the average in previous years was 30,392). The Musée cantonal de géologie was visited by 28,299 visitors (the average in previous years was 24,248). The Cantonal Museum of Fine Arts was visited by 26,456 visitors (the average in previous years was 26,384). The Museum of Contemporary Design and Applied Arts was visited by 28,554 visitors (the average in previous years was 22,879). The Musée de l'Élysée was visited by 36,775 visitors (the average in previous years was 37,757). The Musée historique de Lausanne was visited by 23,116 visitors (the average in previous years was 22,851).\n\n, there were 12,147 students in Lausanne who came from another municipality, while 2,258 residents attended schools outside the municipality.\n\nLibraries\n\nLausanne is home to eight large libraries or collections of libraries. These libraries include: Cantonal and University Library of Lausanne, the library of the Swiss Federal Institute of Technology in Lausanne (EPFL), the libraries of the Réseau EPFL, the Bibliothèque municipale de Lausanne, the Haute école de travail social et de la santé (EESP), the HECV Santé, the Haute école de la santé La Source and the École cantonale d'art de Lausanne (ECAL). There was a combined total () of 3,496,260 books or other media in the libraries, and in the same year a total of 1,650,534 items were loaned out.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/16/02/02/data.html Swiss Federal Statistical Office, list of libraries].  Retrieved 14 May 2010.\n\nTertiary education\n\nLausanne enjoys some world class education and research establishments (see also Lausanne campus), including private schools, attended by students from around the world.\n* Swiss Federal Institute of Technology in Lausanne (EPFL)\n* University of Lausanne (UNIL)\n** HEC Lausanne, Faculty of Business and Economics of the University of Lausanne\n* University Hospital of Lausanne (CHUV), a hospital centre with associated research\n* École hôtelière de Lausanne (EHL)\n* École cantonale d'art de Lausanne (ECAL)\n* International Institute for Management Development (IMD)\n* Swiss Graduate School of Public Administration (IDHEAP)\n* AISTS (\"International Academy of Sports Science and Technology\")\n* Business School Lausanne (BSL)\n* The Lausanne campus of the University of the Nations\n* Pepperdine University maintains an international study campus in Lausanne\n\nPrimary and secondary schools\n\nInternational schools:\n* École française de Lausanne-Valmont\n* Lycée Pareto (Italian school)\n* Brillantmont International School\n* International School of Lausanne\n\nSights\n\nHeritage sites of national significance\n\nThere are 46 buildings or sites that are listed as Swiss heritage site of national significance. Additionally, the entire old city of Lausanne and the Vernand-Dessus region are listed in the Inventory of Swiss Heritage Sites.\n\n* Religious Buildings: Notre-Dame Cathedral, Swiss Reformed Church of Saint-François, Swiss Reformed Church of Saint-Laurent and the Synagogue at Avenue de Florimont.\n* Civic Structures: Former Hôpital at Rue Mercerie 24, Former Federal Tribunal, the Former Académie at Rue Cité-Devant 7, Casino de Montbenon, St-Maire Castle, Bois-de-Vaux Cemetery, Fondation de l’Hermitage and House de maître, Railway station, Beau-Rivage Palace, City Hall, Hôtel des Postes, Administration Building of André & Cie. S.A., Administration Building of the Vaudoise Assurances, Apartment and Office Building at Rue du Grand-Chêne 8, Les Bains de Bellerive, l’Estérel House, House at Chemin de Chandolin 4, the Mon-Repos estate at Parc de Mon-Repos, Olympic Museum and Archives of the International Olympic Committee, the vessels of the CGN (La Suisse (1910), Savoie (1914), Simplon (1920), Rhône (1927)), Pont Chauderon, the Vernand-Dessus rural site, Site de l’Expo 64 avec Théatre de Vidy, the Tour Bel-Air and the University Hospital of Lausanne (CHUV).\n* Museums and Libraries: Former Residence of the Bishop of Lausanne which is now the Lausanne Museum of History, Bibliothèque des cèdres (former Bibliothèque des pasteurs), Beaulieu Castle and the Collection de l'art brut, Fondation Toms Pauli Collection de tapisseries and d’art textile, Galeries Saint-François, Musée de l'Élysée, Museum of Contemporary Design and Applied Arts (MUDAC), Cantonal Botanical Museum and Gardens, the Roman Museum, the Palais de Rumine with the Musée cantonal de géologie, Cantonal Museum of Zoology, Cantonal Museum of Fine Arts, Musée monétaire cantonal (Cabinet des médailles) and Musée cantonal d'archéologie et d'histoire.\n* Archives: Archives of the Banque Vaudoise, Archives of the City of Lausanne, Archives of Énergie Ouest Suisse (EOS), the Radio Suisse Romande archives and the Federal Supreme Court of Switzerland with archives.\n* Archeological sites: The Roman era/medieval hill-top city and the prehistoric settlement and Roman era Vicus of Vidy (Lousanna).\n\nFile:Casino Montbenon.jpg|The Casino de Montbenon\nFile:Lausanne-cathe7.JPG|Lausanne Cathedral\nFile:CHUV Lausanne Suisse 045.JPG|University Hospital of Lausanne (CHUV)\nFile:Château St-Maire.jpg|Château Saint-Maire\nFile:Picswiss VD-46-21.jpg|Swiss Reformed Church of Saint-François\nFile:St-Laurent Lausanne.jpg| Swiss Reformed Church of Saint-Laurent\nFile:Hermitagefoundation.jpg|Fondation de l'Hermitage\nFile:Gare-lausanne-IMG 0002.JPG|Lausanne railway station\nFile:Beau Rivage Hotel, Lausanne.jpg|Hôtel Beau-Rivage Palace\nFile:TschumiMutuelleAssurance03.jpg|Administrative building of the Vaudoise Assurances\nFile:Musée de l'Elysée 4.jpg|Musée de l'Élysée\nFile:Musee olympique.jpg| Olympic Museum and Archives of the International Olympic Committee\nFile:Ouchy waterfront statue.JPG|Ouchy waterfront\nFile:Lausanne synagogue.jpg|Synagogue\nFile:Tour sauvabelin.JPG|The Sauvabelin Tower\nFile:Lausanne Lausanne.jpg|Compagnie générale de navigation sur le lac Léman\n\nCulture\n\nThe Orchestre de chambre de Lausanne, the Lausanne Opera and the Ensemble vocal de Lausanne provide a diverse and rich musical life. The latter has been under the direction of Michel Corboz for many years.\n\nIn January, the Prix de Lausanne, a famous dance competition, takes place at the Palais de Beaulieu (the biggest theatre in Switzerland Mathieu Signorell, \"Beaulieu lâche les congrès pour les infirmiers après l'échec de Taoua\", 24 heures, Saturday 14 February 2015.) over a one-week period. The event attracts dancers and some of the big names in dance from all over the world.\n\nThe Swiss Film Archive is based in Lausanne and the city hosts film festivals such as the Festival cinémas d'Afrique and the Lausanne Underground Film and Music Festival. In addition to modern cinemas, the \"Capitole\" (in activity since 1929) is the biggest cinema in Switzerland (currently 867 seats).\n\nThe town hosted the Eurovision Song Contest 1989. Each July, the Festival de la cité is held in the old part of town. Other music festivals include the Bach Festival, the Festival et concours Bach de Lausanne, which follows the Nuit de musées (museums' night) in the fall season.\n\nLausanne is also the home of the Béjart Ballet.\n\nMonuments \n\n* Cathedral (restored by Viollet-le-Duc)\n* Saint-Maire Castle (Château Saint-Maire)\n* Federal Supreme Court of Switzerland\n* Town Hall\n\nMuseums\n\nLausanne is also the site of many museums:\n* Archizoom\n* Musée Bolo\n* Olympic Museum (Musée olympique)\n* Musée de l'Élysée\n* Fondation de l'Hermitage (\"Hermitage Foundation\")\n* Collection of Outsider Art (Collection de l'art brut)\n* Museum of Contemporary Design and Applied Arts (Musée de design et d'arts appliqués contemporains)\n* [http://www.lausanne.ch/mhl Lausanne Museum of History (Musée historique de Lausanne)]\n* [http://www.dfj.vd.ch/serac/musee/rumine-arlaud.html Espace Arlaud] \n* [http://www.espace-des-inventions.ch Espace des inventions]  (\"Science Center for Kids\")\n* [http://www.verdan.ch/ Fondation Claude Verdan]  - Musée de la main (\"Museum of the Hand\")\n* [http://www.vivarium-lausanne.ch Vivarium de Lausanne] \n* Cantonal Botanical Museum and Gardens (Musée et jardins botaniques cantonaux)\n* [http://www.musees-vd.ch/fr/musee-monetaire Cantonal Museum of Money (Musée monétaire cantonal)]  (formerly Cabinet cantonal des médailles - [https://web.archive.org/web/20120211130422/http://www.lausanne.ch/view.asp?docId28071&domId\n64285&language=E short presentation in English])\n* [https://web.archive.org/web/20080516011803/http://www.musees-vd.ch/fr/musee-darcheologie-et-dhistoire/ Cantonal Museum of Archeology and History (Musée cantonal d'archéologie et d'histoire)]  [https://web.archive.org/web/20120211130449/http://www.lausanne.ch/view.asp?docId28061&domId\n64285&language=E short presentation in English]\n* Cantonal Museum of Fine Arts (Musée cantonal des beaux-arts)\n* Cantonal Museum of Zoology (Musée cantonal de zoologie)\n* [http://www.unil.ch/mcg Cantonal Museum of Geology (Musée cantonal de Géologie)] \n* [https://web.archive.org/web/20120211130519/http://www.lausanne.ch/view.asp?docId28077&domId\n64285&language=E Musée romain de Lausanne-Vidy] (\"Lausanne-Vidy Roman Museum\")\n\nArt galleries\n\nMain contemporary art galleries:\n* Galerie Lucy Mackintosh (closed)\n* [http://www.dubnermoderne.ch/ Dubner Moderne]\n* [http://www.synopsism.com/ Synopsism] \n* [http://www.esf.ch/ Espace Saint-François] \nArt centers or artist-run galleries:\n* [https://web.archive.org/web/20050608031132/http://www.circuit.ch/ Circuit] \n* [http://www.galerie1m3.com/ Galerie Galerie 1m3]\n* [http://www.espacedoll.ch/ Doll espace d'art contemporain] \n\nMusic\n\n* Contemporary composer Leonardo Balada's Symphony No. 4 is subtitled 'Lausanne'.\n* Igor Stravinsky's L'Histoire du Soldat was premiered in Lausanne in September 1918.\n\nSports\n\nLausanne is home to the IOC, with water sports available on the nearby lake and mountaineering in the nearby mountains. Cycling is also a common pastime, with the vineyards in the surrounding hills providing extensive views and challenging routes. There is an annual track and field meeting (Athletissima), road running through the city (the 20 km (12 mi) of Lausanne), the Tour de Romandie road cycling race, Marathon of Lausanne and triathlon competition, among other sports events. The two most important sports are ice hockey and football. Lausanne will host the 2020 Winter Youth Olympics and the 2020 IIHF World Championship.\n\n;Local\n* Lausanne Hockey Club\n* Lausanne-Sport Football Club\n* Lausanne-Sports Aviron Rowing Club\n* Lausanne Sharks American Football Club\n* Federation of Swiss Bandy\n* Stade Lausanne Rugby Club\n* Lausanne University Club (Luc) Rugby\n\n;International\nLausanne hosts the headquarters of the International Olympic Committee (IOC) and Court of Arbitration for Sport (CAS), and many other international sport associations:\n\n* European Athletics Association (EAA)\n* International Baseball Federation (IBAF)\n* International Federation for Equestrian Sports (French: Fédération Équestre Internationale, FEI)\n* International Fencing Federation (French: Fédération Internationale d'Escrime, FIE)\n* International Golf Federation (French: Fédération Internationale de Golf, FIG)\n* International Federation of Gymnastics (French: Fédération Internationale de Gymnastique, FIG)\n* International Hockey Federation (French: Fédération Internationale de Hockey, FIH)\n* International Rowing Federation (French: Fédération Internationale des Sociétés d'Aviron, FISA)\n* International Skating Union (ISU)\n* International Swimming Federation (French: Fédération Internationale de Natation, FINA)\n* International Table Tennis Federation (ITTF)\n* International Triathlon Union (ITU)\n* International University Sports Federation (French: Fédération Internationale du Sport Universitaire, FISU)\n* International Volleyball Federation (French: Fédération Internationale de Volleyball, FIVB)\n* International Wushu Federation (IWUF)http://www.iwuf.org/iwuf/\n* World Air Sports Federation (French: Fédération Aéronautique Internationale, FAI)\n* World Archery Federation (WA) (French: Fédération Internationale de Tir à l'Arc, FITA)\n\nNotable people\n\nLausanne is the birthplace of:\n* Timea Bacsinszky, tennis player\n* David Bennent, actor\n* Metropolitan Anthony (Bloom) of Sourozh, Russian Orthodox ecclesiastic located in Britain\n* François-Louis David Bocion, artist and teacher\n* Ernest Boiceau (1881-1950), artist and designer\n* Marius Borgeaud, artist\n* Hélène Boschi, pianist,\n* Johann Ludwig Burckhardt, traveler and orientalist\n* Alejo Carpentier, Cuban-French writer\n* Stéphane Chapuisat, footballer\n* Albert Chavannes, philosopher\n* Benjamin Constant, thinker, writer and politician\n* Aloise Corbaz, outsider artist\n* Charles Dutoit, conductor\n* Egon von Furstenberg, fashion designer\n* Eugène Grasset, decorative artist\n* Dominique Lévy, art dealer \n* Ludovic Magnin, footballer\n* Vincent Perez, film actor and director\n* Bertrand Piccard, psychiatrist and balloonist\n* Charles-Ferdinand Ramuz, writer\n* Ubolratana Rajakanya, Thai princess\n* Théophile Steinlen, Art Nouveau painter and printmaker\n* James Thiérrée, actor\n* Elizabeth Thompson (Lady Butler), British painter\n* Bernard Tschumi, contemporary architect, writer, and educator\n* Nanos Valaoritis Greek poet\n* Félix Vallotton, post-impressionist painter\n* Claude Haldi, car driver who has been involved in rally racing, hill climbing and endurance racing.\n* André Wicky, was a Swiss racing driver, active from the late 1950s to the late 1970s. He was mainly involved in sports car racing, as an entrant and team owner as well as a driver, but also took part in several non-championship Formula One races during the 1960s.\n* Jacques Viret (born 1943), French musicologist\n* Stanislas Wawrinka, tennis player\n* Jocelyn Wildenstein, Manhattan socialite and ex-wife of the late Alec N. Wildenstein\n\nNotable residents:\n* Bhumibol Adulyadej, late king of Thailand was educated at the École nouvelle de la Suisse romande\n* Pierre Amoyal, Paris-born violinist; professor at Lausanne Conservatory\n* Jean Anouilh, French dramatist\n* Ingvar Kamprad, founder of IKEA\n* Alice Bailly, Swiss painter and multimedia artist\n* Maurice Béjart, choreographer\n* Lorik Cana, professional footballer for Albania and Marseille\n* Capucine, French actress and model\n* Coco Chanel, fashion designer\n* Pierre de Coubertin, French baron and founder of the International Olympic Committee\n* Jean-Pascal Delamuraz, Swiss politician\n* Helen of Greece and Denmark, Queen Mother of Romania\n* Victoria Eugenia of Battenberg, Queen of Spain\n* Peter Carl Fabergé, Russian jeweller\n* Edward Gibbon, British historian\n* Gloria Guinness, socialite and writer\n* Oswald Heer, Swiss geologist and naturalist\n* Stéphane Lambiel, men's figure skater, Olympic silver medalist and 2-time world champion\n* Sébastien Loeb, French rally driver\n* Carl Gustaf Emil Mannerheim, Finnish president and field marshal\n* James Mason, English actor\n* Fernand Melgar, Swiss actor\n* Jô Soares, Brazilian humorist\n* Waldemar Mordecai Haffkine, Ukrainian bacteriologist\n* Paloma Picasso, fashion designer\n* Auguste Piccard, Swiss physicist, inventor and explorer\n* George Sanders, English actor\n* Albin Schram, renowned manuscript collector\n* Georges Simenon, Belgian writer\n* Jon Steele, American-born author\n* Han Suyin, China-born writer\n* Karol Szymanowski, Polish composer\n* Eugène Viollet-le-Duc, French architect\n* Pierre Viret, Swiss reformed theologian\n* Serge Voronoff, surgeon buried in Lausanne",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lausanne" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18623" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Lausanne (,, , and also Lausannen , ) is a city in the French-speaking part of Switzerland, and the capital and biggest city of the canton of Vaud. The city is situated on the shores of Lake Geneva (, or simply Le Léman). It faces the French town of Évian-les-Bains, with the Jura Mountains to its north-west. Lausanne is located 62 km northeast of Geneva.\n\nLausanne has a population (as of November 2015) of 146,372, making it the fourth largest city in Switzerland, with the entire agglomeration area having 420,000 inhabitants (as of March 2015). The metropolitan area of Lausanne-Geneva (including Vevey-Montreux, Yverdon-les-Bains, and foreign parts) was over 1.2 million inhabitants in 2000.\n\nLausanne is a focus of international sport, hosting the International Olympic Committee (which recognizes the city as the \"Olympic Capital\" since 1994), the Court of Arbitration for Sport and some 55 international sport associations. It lies in a noted wine-growing region. The city has a 28-station metro system, making it the smallest city in the world to have a rapid transit system. Lausanne will host the 2020 Winter Youth Olympics.\n\nHistory\n\nThe Romans built a military camp, which they called Lousanna, at the site of a Celtic settlement, near the lake where currently Vidy and Ouchy are situated; on the hill above was a fort called 'Lausodunon' or 'Lousodunon' (The 'y' suffix is common to many place names of Roman origin in the region (e.g.) Prilly, Pully, Lutry, etc.). By the 2nd century AD it was known as vikanor[um] Lousonnensium and in 280 as lacu Lausonio. By 400 it was civitas Lausanna and in 990 it was mentioned as Losanna.\n\nAfter the fall of the Roman Empire, insecurity forced the Lausanne to move to its current centre, a hilly site that was easier to defend. The city which emerged from the camp was ruled by the Dukes of Savoy and the Bishop of Lausanne. Then it came under Bern from 1536 to 1798 and a number of its cultural treasures, including the hanging tapestries in the Cathedral, were permanently removed. Lausanne has made a number of requests to recover them.\n\nAfter the revocation of the Edict of Nantes in 1685, Lausanne became (along with Geneva) a place of refuge for French Huguenots. In 1729 a seminary was opened by Antoine Court and Benjamin Duplan. By 1750, ninety pastors had been sent back to France to work clandestinely; this number would rise to four hundred. Official persecution ended in 1787; a faculty of Protestant theology was established at Montauban in 1808, and the Lausanne seminary was finally closed on 18 April 1812. Also  During the Napoleonic Wars, the city's status changed. In 1803, it became the capital of a newly formed Swiss canton, Vaud under which it joined the Swiss Federation.\n\nModern history and heritage\n\nIn 1964 the city hosted the 'Swiss National Exhibition', displaying its newly found confidence to host major international events.\n\nFrom the 1950s to 1970s a large number of Italians, Spaniards and Portuguese immigrated, settling mostly in the industrial district of Renens and transforming the local diet.\n\nThe city has served as a refuge for European artists. While under the care of a psychiatrist at Lausanne, T. S. Eliot composed most of his 1922 poem The Wasteland (\"by the waters of Leman I sat down and wept\"). Hemingway also visited from Paris with his wife during the 1920s, to holiday. In fact, many creative people - such as Edward Gibbon, an historian, and Romantic era poets Shelley and Byron - have \"sojourned, lived, and worked in Lausanne or nearby\".\n\nThe city has been traditionally quiet, but in the late 1960s and early 1970s a series of demonstrations took place that exposed tensions between young people and the police. Later demonstrations took place to protest against the high cinema prices, followed by protest against the G8 meetings in 2003.\n\nGeography\n\nTopography\n\nThe most important geographical feature of the area surrounding Lausanne is Lake Geneva (Lac Léman in French). Lausanne is built on the southern slope of the Swiss plateau, with a difference in elevation of about 500 m between the lakeshore at Ouchy and its northern edge bordering Le Mont-sur-Lausanne and Épalinges. Lausanne boasts a dramatic panorama over the lake and the Alps.\n\nIn addition to its generally southward-sloping layout, the centre of the city is the site of an ancient river, the Flon, which has been covered since the 19th century. The former river forms a gorge running through the middle of the city south of the old city centre, generally following the course of the present Rue Centrale, with several bridges crossing the depression to connect the adjacent neighbourhoods. Due to the considerable differences in elevation, visitors should make a note as to which plane of elevation they are on and where they want to go, otherwise they will find themselves tens of metres below or above the street which they are trying to negotiate. The name Flon is also used for the metro station located in the gorge.\n\nThe municipality includes the villages of Vidy, Cour, Ouchy, Mornex, Chailly, La Sallaz, Vennes, Montblesson, Vers-chez-les-Blanc, Montheron and Chalet-à-Gobet (871 m) as well as the exclave of Vernand.\n\nLausanne is located at the limit between the extensive wine-growing regions of Lavaux (to the east) and la Côte (to the west).\n\nLausanne has an area, , of  (depending on calculation method). Of this area,  or 16.0% is used for agricultural purposes, while  or 39.1% is forested. Of the rest of the land,  or 44.6% is settled (buildings or roads),  or 0.1% is either rivers or lakes and  or 0.0% is unproductive land.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/02/03/blank/data/gemeindedaten.html Swiss Federal Statistical Office-Land Use Statistics] 2009 data.  Retrieved 25 March 2010.\n\nOf the built-up area, industrial buildings made up 1.6% of the total area while housing and buildings made up 21.6% and transportation infrastructure made up 12.5%. Power and water infrastructure as well as other special developed areas made up 1.4% of the area while parks, green belts and sports fields made up 7.5%. Out of the forested land, all of the forested land area is covered with heavy forests. Of the agricultural land, 11.1% is used for growing crops and 4.2% is pastures. All the water in the municipality is in lakes.\n\nThe municipality was part of the old Lausanne District until it was dissolved on 31 August 2006, and it became the capital of the new district of Lausanne.[http://www.bfs.admin.ch/bfs/portal/de/index/infothek/nomenklaturen/blank/blank/gem_liste/02.html Nomenklaturen – Amtliches Gemeindeverzeichnis der Schweiz].  Retrieved 4 April 2011.\n\nClimate\n\nLausanne has an average of 119.7 days of rain or snow per year and on average receives 1153 mm of precipitation. The wettest month is May during which time Lausanne receives an average of 117 mm of rain. During this month there is precipitation for an average of 12.1 days. The driest month of the year is February with an average of 67 mm of precipitation over 8.8 days.\nThe USDA Hardiness Zone for Lausanne-Pully is 8b with an average minimum temperature of -7.0 C over the past 20 years (1997 - 2016), but at the lake level, it can be considered as 9a.\n\nPolitics\n\nCoat of arms\n\nThe blazon of the municipal coat of arms is Gules, chief argent.\n\nAdministrative divisions\n\nThe city is divided into 18 quartiers, or districts, sometimes composed of several neighborhoods. They are: Centre (1), Maupas/Valency (2), Sébeillon/Malley (3), Montoie/Bourdonnette (4), Montriond/Cour (5), Sous-Gare/Ouchy (6), Montchoisi (7), Florimont/Chissiez (8), Mousquines/Bellevue (9), Vallon/Béthusy (10), Chailly/Rovéréaz (11), Sallaz/Vennes/Séchaud (12), Sauvabelin (13), Borde/Bellevaux (14), Vinet/Pontaise (15), Bossons/Blécherette (16), Beaulieu/Grey/Boisy (17), and Les Zones foraines (90)\n\nGovernment\n\nThe Municipality (la Municipalité) constitutes the executive government of the City of Lausanne and operates as a collegiate authority. It is composed of seven councilors (), each presiding over a directorte. One of the members act as mayor (syndic). In the mandate period 2016–2021 (la législature) the Municipality is presided by Monsieur le Syndic Grégoire Junod. Directoral tasks, coordination measures and implementation of laws decreed by the Communal Council are carried by the Municipality. The regular election of the Municipality by any inhabitant valid to vote is held every five years. Any resident of Lausanne allowed to vote can be elected as a member of the Municipality. Since 14 April 2003, due to the constitution by canton of Vaud not only Swiss citizen have the right to vote and elect and being elected on communal level, but also foreigners with a residence permit of at least 10 years in Switzerland and 3 years in the canton of Vaud. The current mandate period is from 1 July 2016 to 30 June 2021. The delegates are elected by means of a system of Majorz. The mayor is later on elected as such by a public election as well by a system of Majorz, while the heads of the other departments are assigned by the collegiate. The executive body holds its meetings in the Town Hall (L'Hôtel de Ville), in the old city on Place de la Palud.\n\n, Lausanne's Municipality is made up of three representatives of the PS (Social Democratic Party, of whom one is also the mayor), and two members of PES (Green Party), and one each of le Parti Ouvrier et Populaire Vaudois (POP) & gauche en mouvement (an alliance of the left parties POP (Parti Suisse du Travail - Parti Ouvrier et Populaire) and solidaritéS and indépendant.e.s), and PLR (Les Libéraux-Radicaux (PLR)), giving the left parties a very strong six out of seven seats. The last election was held on 28 February/20 March 2016. The mayor was elected by two ballots on 17 April/8 May 2016.\n\nSimon Affolter is Town Chancellor (chancelier municipal) since for the Municipality.\n\nParliament\n\nThe Communal Council (Conseil communal) holds legislative power. It is made up of 100 members, with elections held every five years. The Communal Council decrees regulations and by-laws that are executed by the Municipality and the administration. The sessions of the Communal Council are public. Unlike members of the Municipality, members of the Communal Council are not politicians by profession, and they are paid a fee based on their attendance. Any resident of Lausanne allowed to vote can be elected as a member of the Communal Council. Since 14 April 2003, due to the constitution by canton of Vaud not only Swiss citizen have the right to vote and elect and being elected on communal level, but also foreigners with a residence permit of at least 10 years in Switzerland and 3 years in the canton of Vaud. The Parliament holds its meetings in the Town Hall (Hôtel de Ville), in the old city on Place de la Palud.\n\nThe last election of the Communal Council was held on 28 February 2016 for the mandate period (la législature) from 1 June 2016 to 31 May 2021. Currently the Communal Council consist of 33 members of the Social Democratic Party (PS), 21 Les Libéraux-Radicaux (PLR), 17 Green Party (PES), 12 Swiss People's Party (UDC), 11 Ensemble à Gauche (an alliance of the left parties POP (Parti Suisse du Travail - Parti Ouvrier et Populaire) and solidaritéS and indépendant.e.s), and 6 Le Centre (an alliance of Christian Democratic People's Party (PDC) and Green Liberal Party (pvl)).\n\nElections\n\nNational Council\n\nIn the 2015 federal election for the Swiss National Council the most popular party was the PS which received 30.8% of the vote. The next three most popular parties were the PLR (18.6%), the Green Party (15.9%), and the UDC (15.4%). In the federal election, a total of 26,116 voters were cast, and the voter turnout was 41.0%.\n\nDemographics\n\nPopulation\n\nLausanne has a population () of . , 42% of the population were resident foreign nationals. Over the last 10 years (1999–2009) the population has changed at a rate of 9.9%. It has changed at a rate of 8.3% due to migration and at a rate of 2.6% due to births and deaths.[http://www.bfs.admin.ch/bfs/portal/en/index/regionen/02/key.html Swiss Federal Statistical Office] . Retrieved 21 June 2011. The population of the greater Lausanne area (grand Lausanne) is 402,900 (as of December 2014).\n\nOf the population in the municipality, 58% or 80,828 have a Swiss citizenship, while 16,908 or 12.1% are from Lausanne and still lived there in December 2013. There were 27,653 or 19.8% who are from somewhere else in the same canton, while 36,276 or 26.0% have a Swiss citizenship in another canton. 58,9562 or 42.0% have a foreign citizenship.\n\nIn 2000, most of the population spoke French (98,424 or 78.8%), with German being second most common (5,365 or 4.3%) and Italian being third (4,976 or 4.0%). There were 62 people who speak Romansh.\n\nIn  there were 840 live births to Swiss citizens and 623 births to non-Swiss citizens, and in same time span there were 862 deaths of Swiss citizens and 127 non-Swiss citizen deaths. Ignoring immigration and emigration, the population of Swiss citizens decreased by 22 while the foreign population increased by 496. There were 9 Swiss men and 57 Swiss women who emigrated from Switzerland. At the same time, there were 2230 non-Swiss men and 1802 non-Swiss women who immigrated from another country to Switzerland. The total Swiss population change in 2008 (from all sources, including moves across municipal borders) was an increase of 883 and the non-Swiss population increased by 2221 people. This represents a population growth rate of 2.6%.[http://www.bfs.admin.ch/bfs/portal/de/index/infothek/onlinedb/superweb/login.html Swiss Federal Statistical Office - Superweb database - Gemeinde Statistics 1981-2008] .  Retrieved 19 June 2010.\n\nThe age distribution, , in Lausanne is; 11,818 children or 9.4% of the population are between 0 and 9 years old and 12,128 teenagers or 9.7% are between 10 and 19. Of the adult population, 21,101 people or 16.8% of the population are between 20 and 29 years old. 22,158 people or 17.6% are between 30 and 39, 18,016 people or 14.4% are between 40 and 49, and 13,940 people or 11.1% are between 50 and 59. The senior population distribution is 11,041 people or 8.8% of the population are between 60 and 69 years old, 8,277 people or 6.6% are between 70 and 79, there are 5,896 people or 4.7% who are between 80 and 89, and there are 1,171 people or 0.9% who are 90 and older.[http://www.scris.vd.ch/Default.aspx?DomID\n2016 Canton of Vaud Statistical Office].  Retrieved 29 April 2011.\n\n, there were 58,100 people who were single and never married in the municipality. There were 48,990 married individuals, 7,797 widows or widowers and 10,027 individuals who are divorced.[http://www.pxweb.bfs.admin.ch/Database/German_40%20-%20Eidgen%C3%B6ssische%20Volksz%C3%A4hlung/40.3%20-%202000/40.3%20-%202000.asp?lang\n1&prod40&secprod\n3&openChild=true STAT-TAB Datenwürfel für Thema 40.3 - 2000] .  Retrieved 2 February 2011.\n\n the average number of residents per living room was 0.64 which is about equal to the cantonal average of 0.61 per room. In this case, a room is defined as space of a housing unit of at least 4 m² as normal bedrooms, dining rooms, living rooms, kitchens and habitable cellars and attics. About 6.5% of the total households were owner occupied, or in other words did not pay rent (though they may have a mortgage or a rent-to-own agreement).Urban Audit Glossary p. 17.\n\n, there were 62,258 private households in the municipality, and an average of 1.9 persons per household. There were 31,205 households that consist of only one person and 2,184 households with five or more people. Out of a total of 63,833 households that answered this question, 48.9% were households made up of just one person and there were 306 adults who lived with their parents. Of the rest of the households, there are 13,131 married couples without children and 11,603 married couples with children. There were 3,883 single parents with a child or children. There were 2,130 households that were made up of unrelated people, and 1,575 households that were made up of some sort of institution or another collective housing.\n\n there were 1,833 single family homes (or 23.1% of the total) out of a total of 7,925 inhabited buildings. There were 3,634 multi-family buildings (45.9%), along with 1,955 multi-purpose buildings that were mostly used for housing (24.7%) and 503 other use buildings (commercial or industrial) that also had some housing (6.3%). Of the single family homes 324 were built before 1919, while 153 were built between 1990 and 2000. The greatest number of single family homes (498) were built between 1919 and 1945. The most multi-family homes (933) were built before 1919 and the next most (906) were built between 1919 and 1945. There were 180 multi-family houses built between 1996 and 2000.[http://www.pxweb.bfs.admin.ch/Database/German_09%20-%20Bau-%20und%20Wohnungswesen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen.asp?lang\n1&prod09&secprod\n2&openChild=true Swiss Federal Statistical Office STAT-TAB - Datenwürfel für Thema 09.2 - Gebäude und Wohnungen] .  Retrieved 28 January 2011.\n\n there were 69,383 apartments in the municipality. The most common apartment size was 3 rooms of which there were 22,408. There were 9,579 single room apartments and 7,388 apartments with five or more rooms. Of these apartments, a total of 61,056 apartments (88.0% of the total) were permanently occupied, while 6,840 apartments (9.9%) were seasonally occupied and 1,487 apartments (2.1%) were empty. , the construction rate of new housing units was 2.1 new units per 1000 residents.\n\n the average price to rent an average apartment in Lausanne was 1064.08 Swiss francs (CHF) per month (US$850, £480, €680 approx. exchange rate from 2003). The average rate for a one-room apartment was 597.46 CHF (US$480, £270, €380), a two-room apartment was about 792.33 CHF (US$630, £360, €510), a three-room apartment was about 1044.64 CHF (US$840, £470, €670) and a six or more room apartment cost an average of 2024.55 CHF (US$1620, £910, €1300). The average apartment price in Lausanne was 95.3% of the national average of 1116 CHF.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/05/06/blank/key/einfuehrung.html Swiss Federal Statistical Office-Rental prices] 2003 data.  Retrieved 26 May 2010. The vacancy rate for the municipality, , was 0.17%.\n\nHistoric population\n\nThe historical population is given in the following chart:\n\nColors=\n  id:lightgrey value:gray(0.9)\n  id:darkgrey  value:gray(0.8)\nImageSize  = width:1100 height:500\nPlotArea   = height:350 left: 100 bottom:90 right:100\nLegend     = columns:3 left:220 top:70 columnwidth:160\nAlignBars  = justify\nDateFormat = x.y\nPeriod     = from:0 till:140000\nTimeAxis   = orientation:vertical\nAlignBars  = justify\nScaleMajor = gridcolor:darkgrey increment:30000 start:0\nScaleMinor = gridcolor:lightgrey increment:6000 start:0\nColors=\n id:TO     value:yellowgreen      legend:Total\n id:FR     value:teal      legend:French_Speaking\n id:GE     value:green      legend:German_Speaking\n id:CA     value:lightpurple      legend:Catholic\n id:PR     value:oceanblue      legend:Protestant\n id:SW     value:red      legend:Swiss\nPlotData=\n  color:yellowgreen width:40   mark:(line,white) align:center\n  bar:1850 from:start till:17108 text:\"17,108\" color:TO\n  bar:1870a from:start till:25845 text:\"25,845\" color:TO\n  bar:1888 from:start till:33340 text:\"33,340\" color:TO\n  bar:1900 from:start till:46732 text:\"46,732\" color:TO\n  bar:1910 from:start till:64446 text:\"64,446\" color:TO\n  bar:1930 from:start till:75915 text:\"75,915\" color:TO\n  bar:1950 from:start till:106807 text:\"106,807\" color:TO\n  bar:1970 from:start till:137383 text:\"137,383\" color:TO\n  bar:1990 from:start till:128112 text:\"128,112\" color:TO\n  bar:2000 from:start till:124914 text:\"124,914\" color:TO\nLineData =\n  points:(300,154)(400,179)  color:FR\n  points:(400,179)(500,206)  color:FR\n  points:(500,206)(600,237)  color:FR\n  points:(600,237)(700,311)  color:FR\n  points:(700,311)(800,344)  color:FR\n  points:(800,344)(900,329)  color:FR\n  points:(900,329)(1000,336)  color:FR\n  points:(300,104)(400,107)  color:GE\n  points:(400,107)(500,114)  color:GE\n  points:(500,114)(600,118)  color:GE\n  points:(600,118)(700,121)  color:GE\n  points:(700,121)(800,120)  color:GE\n  points:(800,120)(900,107)  color:GE\n  points:(900,107)(1000,103)  color:GE\n  points:(100,92)(200,99)  color:CA\n  points:(200,99)(300,101)  color:CA\n  points:(300,101)(400,113)  color:CA\n  points:(400,113)(500,129)  color:CA\n  points:(500,129)(600,132)  color:CA\n  points:(600,132)(700,158)  color:CA\n  points:(700,158)(800,227)  color:CA\n  points:(800,227)(900,231)  color:CA\n  points:(900,231)(1000,208)  color:CA\n  points:(100,130)(200,146)  color:PR\n  points:(200,146)(300,161)  color:PR\n  points:(300,161)(400,182)  color:PR\n  points:(400,182)(500,205)  color:PR\n  points:(500,205)(600,231)  color:PR\n  points:(600,231)(700,279)  color:PR\n  points:(700,279)(800,278)  color:PR\n  points:(800,278)(900,211)  color:PR\n  points:(900,211)(1000,180)  color:PR\n  points:(100,130)(200,146)  color:SW\n  points:(200,146)(300,161)  color:SW\n  points:(300,161)(400,183)  color:SW\n  points:(400,183)(500,212)  color:SW\n  points:(500,212)(600,253)  color:SW\n  points:(600,253)(700,333)  color:SW\n  points:(700,333)(800,356)  color:SW\n  points:(800,356)(900,312)  color:SW\n  points:(900,312)(1000,291)  color:SW\n\nReligion\n\nFrom the Reformation in the 16th century, the city was mostly Protestant until the late 20th century, when it received substantial immigration, particularly from largely Catholic countries. Catholics now form a plurality of the city's population.\n\nFrom the , 47,225 people (37.8% of the population) were Roman Catholic, while 33,993 (27.2%) belonged to the Swiss Reformed Church. Of the rest of the population, there were 2,698 members of an Orthodox church (2.16%), there were 65 individuals (0.05%) who belonged to the Christian Catholic Church, and there were 4,437 individuals (3.55%) who belonged to another Christian church. There were 849 individuals (0.68%) who were Jewish, and 7,501 (6.00%) who were Muslim. There were 452 individuals who were Buddhist, 772 individuals who were Hindu and 343 individuals who belonged to another church. 21,080 (16.88%) belonged to no church, were agnostic or atheist, and 7,590 individuals (6.08%) did not answer the question.\n\nCrime\n\nIn 2014 the crime rate, of crimes listed in the Swiss Criminal Code, in Lausanne was 167.3 per thousand residents. During the same period, the rate of drug crimes was 49.5 per thousand residents, and the rate of violations of immigration, visa and work permit laws was 21 per thousand residents.[https://www.atlas.bfs.admin.ch/maps/13/de/11488_11587_3864_7266/19010.html Statistical Atlas of Switzerland]. Retrieved 5 April 2016.\n\nTransport\n\nLausanne is served by an extensive network of local, national and international public transport. National and international passenger trains of the Swiss Federal Railways depart from Lausanne railway station, which is also the hub of the Réseau Express Vaudois commuter rail system, and a stop on the city's metro. The metro and local buses are operated by Transports publics de la région lausannoise (TL), with many routes run using trolleybuses. Additional commuter trains are run by the Lausanne–Echallens–Bercher railway (LEB) from Lausanne-Flon station. Ships across Lake Geneva are provided by the Compagnie Générale de Navigation sur le lac Léman (CGN).\n\nLausanne became the first city in Switzerland to have a rubber-tyred metro system, with the m2 Line which opened in October 2008. The rolling stock is a shorter version of the one used on Paris Métro Line 14. Further expansion of the system is planned, as is the re-introduction of trams.\n\nLausanne is connected to the A1 motorway on its west side (Geneva - Zürich axis) and to the A9 on its north and east side (for transit with Italy and France); the interchange between these two motorways is on the north-west side of the city.\n\nLausanne Airport is located at Blécherette, and also houses a Boeing 737 Simulator. The city is also directly linked by train to the Geneva International Airport, four times an hour, in 42min.\n\nEconomy\n\n, Lausanne had an unemployment rate of 8%. , there were 114 people employed in the primary economic sector and about 25 businesses involved in this sector. 6,348 people were employed in the secondary sector and there were 698 businesses in this sector. 83,157 people were employed in the tertiary sector, with 6,501 businesses in this sector.\n\nThere were 59,599 residents of the municipality who were employed in some capacity, of which females made up 47.4% of the workforce.  the total number of full-time equivalent jobs was 75,041. The number of jobs in the primary sector was 93, of which 56 were in agriculture, 34 were in forestry or lumber production and 3 were in fishing or fisheries. The number of jobs in the secondary sector was 6,057 of which 1,515 or (25.0%) were in manufacturing, 24 or (0.4%) were in mining and 3,721 (61.4%) were in construction. The number of jobs in the tertiary sector was 68,891. In the tertiary sector; 8,520 or 12.4% were in wholesale or retail sales or the repair of motor vehicles, 2,955 or 4.3% were in the movement and storage of goods, 4,345 or 6.3% were in a hotel or restaurant, 4,671 or 6.8% were in the information industry, 6,729 or 9.8% were the insurance or financial industry, 8,213 or 11.9% were technical professionals or scientists, 5,756 or 8.4% were in education and 14,312 or 20.8% were in health care.[http://www.pxweb.bfs.admin.ch/Database/German_06%20-%20Industrie%20und%20Dienstleistungen/06.2%20-%20Unternehmen/06.2%20-%20Unternehmen.asp?lang1&prod\n06&secprod2&openChild\ntrue Swiss Federal Statistical Office STAT-TAB Betriebszählung: Arbeitsstätten nach Gemeinde und NOGA 2008 (Abschnitte), Sektoren 1-3] .  Retrieved 28 January 2011.\n\n, there were 55,789 workers who commuted into the municipality and 19,082 workers who commuted away. The municipality is a net importer of workers, with about 2.9 workers entering the municipality for every one leaving. About 1.9% of the workforce coming into Lausanne are coming from outside Switzerland, while 0.1% of the locals commute out of Switzerland for work.[http://www.media-stat.admin.ch/stat/pendler/pop.php Swiss Federal Statistical Office - Statweb] .  Retrieved 24 June 2010. Of the working population, 40.9% used public transportation to get to work, and 35.1% used a private car.\n\n* Philip Morris International, a tobacco company, has its international headquarters in Lausanne.\n* Tetra Laval, a multinational packaging corporation, has its international headquarters in Lausanne.\n* Nespresso, an operating unit of the Nestlé Group, based in Lausanne, Switzerland.\n* Logitech, the computer peripherals company has its headquarters in Lausanne.\n\nEducation\n\nIn Lausanne about 40,118 or (32.1%) of the population have completed non-mandatory upper secondary education, and 22,934 or (18.4%) have completed additional higher education (either university or a Fachhochschule). Of the 22,934 who completed tertiary schooling, 38.7% were Swiss men, 31.3% were Swiss women, 17.1% were non-Swiss men and 12.9% were non-Swiss women.\n\nIn the 2009/2010 school year there were a total of 12,244 students in the Lausanne school district. In the Vaud cantonal school system, two years of non-obligatory pre-school are provided by the political districts. During the school year, the political district provided pre-school care for a total of 2,648 children of which 1,947 children (73.5%) received subsidized pre-school care. The canton's primary school program requires students to attend for four years. There were 6,601 students in the municipal primary school program. The obligatory lower secondary school program lasts for six years and there were 5,244 students in those schools. There were also 399 students who were home schooled or attended another non-traditional school.[http://www.scris.vd.ch/Default.aspx?DomID\n2403 Canton of Vaud Statistical Office - Scol. obligatoire/filières de transition].  Retrieved 2 May 2011.\n\nLausanne is home to a number of museums including; the Collection de l'art brut, the Espace Arlaud, the Fondation de l'Hermitage, the Musée cantonal d'archéologie et d'histoire, the Musée cantonal de géologie, the Musée cantonal de zoologie, the Cantonal Museum of Fine Arts, the Museum of Contemporary Design and Applied Arts, the Musée de l'Élysée and the Musée historique de Lausanne.[http://www.scris.vd.ch/Default.aspx?DomID\n2181 Canton of Vaud Statistical Office - Fréquentation de quelques musées et fondations, Vaud, 2001-2009].  Retrieved 2 May 2011. In 2009 the Collection de l'art brut was visited by 27,028 visitors (the average in previous years was 33,356). The Espace Arlaud was visited by 9,222 visitors (the average in previous years was 14,206). The Fondation de l'Hermitage was visited by 89,175 visitors (the average in previous years was 74,839). The Musée cantonal d'archéologie et d'histoire was visited by 14,841 visitors (the average in previous years was 15,775). The Musée cantonal de zoologie was visited by 30,794 visitors (the average in previous years was 30,392). The Musée cantonal de géologie was visited by 28,299 visitors (the average in previous years was 24,248). The Cantonal Museum of Fine Arts was visited by 26,456 visitors (the average in previous years was 26,384). The Museum of Contemporary Design and Applied Arts was visited by 28,554 visitors (the average in previous years was 22,879). The Musée de l'Élysée was visited by 36,775 visitors (the average in previous years was 37,757). The Musée historique de Lausanne was visited by 23,116 visitors (the average in previous years was 22,851).\n\n, there were 12,147 students in Lausanne who came from another municipality, while 2,258 residents attended schools outside the municipality.\n\nLibraries\n\nLausanne is home to eight large libraries or collections of libraries. These libraries include: Cantonal and University Library of Lausanne, the library of the Swiss Federal Institute of Technology in Lausanne (EPFL), the libraries of the Réseau EPFL, the Bibliothèque municipale de Lausanne, the Haute école de travail social et de la santé (EESP), the HECV Santé, the Haute école de la santé La Source and the École cantonale d'art de Lausanne (ECAL). There was a combined total () of 3,496,260 books or other media in the libraries, and in the same year a total of 1,650,534 items were loaned out.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/16/02/02/data.html Swiss Federal Statistical Office, list of libraries].  Retrieved 14 May 2010.\n\nTertiary education\n\nLausanne enjoys some world class education and research establishments (see also Lausanne campus), including private schools, attended by students from around the world.\n* Swiss Federal Institute of Technology in Lausanne (EPFL)\n* University of Lausanne (UNIL)\n** HEC Lausanne, Faculty of Business and Economics of the University of Lausanne\n* University Hospital of Lausanne (CHUV), a hospital centre with associated research\n* École hôtelière de Lausanne (EHL)\n* École cantonale d'art de Lausanne (ECAL)\n* International Institute for Management Development (IMD)\n* Swiss Graduate School of Public Administration (IDHEAP)\n* AISTS (\"International Academy of Sports Science and Technology\")\n* Business School Lausanne (BSL)\n* The Lausanne campus of the University of the Nations\n* Pepperdine University maintains an international study campus in Lausanne\n\nPrimary and secondary schools\n\nInternational schools:\n* École française de Lausanne-Valmont\n* Lycée Pareto (Italian school)\n* Brillantmont International School\n* International School of Lausanne\n\nSights\n\nHeritage sites of national significance\n\nThere are 46 buildings or sites that are listed as Swiss heritage site of national significance. Additionally, the entire old city of Lausanne and the Vernand-Dessus region are listed in the Inventory of Swiss Heritage Sites.\n\n* Religious Buildings: Notre-Dame Cathedral, Swiss Reformed Church of Saint-François, Swiss Reformed Church of Saint-Laurent and the Synagogue at Avenue de Florimont.\n* Civic Structures: Former Hôpital at Rue Mercerie 24, Former Federal Tribunal, the Former Académie at Rue Cité-Devant 7, Casino de Montbenon, St-Maire Castle, Bois-de-Vaux Cemetery, Fondation de l’Hermitage and House de maître, Railway station, Beau-Rivage Palace, City Hall, Hôtel des Postes, Administration Building of André & Cie. S.A., Administration Building of the Vaudoise Assurances, Apartment and Office Building at Rue du Grand-Chêne 8, Les Bains de Bellerive, l’Estérel House, House at Chemin de Chandolin 4, the Mon-Repos estate at Parc de Mon-Repos, Olympic Museum and Archives of the International Olympic Committee, the vessels of the CGN (La Suisse (1910), Savoie (1914), Simplon (1920), Rhône (1927)), Pont Chauderon, the Vernand-Dessus rural site, Site de l’Expo 64 avec Théatre de Vidy, the Tour Bel-Air and the University Hospital of Lausanne (CHUV).\n* Museums and Libraries: Former Residence of the Bishop of Lausanne which is now the Lausanne Museum of History, Bibliothèque des cèdres (former Bibliothèque des pasteurs), Beaulieu Castle and the Collection de l'art brut, Fondation Toms Pauli Collection de tapisseries and d’art textile, Galeries Saint-François, Musée de l'Élysée, Museum of Contemporary Design and Applied Arts (MUDAC), Cantonal Botanical Museum and Gardens, the Roman Museum, the Palais de Rumine with the Musée cantonal de géologie, Cantonal Museum of Zoology, Cantonal Museum of Fine Arts, Musée monétaire cantonal (Cabinet des médailles) and Musée cantonal d'archéologie et d'histoire.\n* Archives: Archives of the Banque Vaudoise, Archives of the City of Lausanne, Archives of Énergie Ouest Suisse (EOS), the Radio Suisse Romande archives and the Federal Supreme Court of Switzerland with archives.\n* Archeological sites: The Roman era/medieval hill-top city and the prehistoric settlement and Roman era Vicus of Vidy (Lousanna).\n\nFile:Casino Montbenon.jpg|The Casino de Montbenon\nFile:Lausanne-cathe7.JPG|Lausanne Cathedral\nFile:CHUV Lausanne Suisse 045.JPG|University Hospital of Lausanne (CHUV)\nFile:Château St-Maire.jpg|Château Saint-Maire\nFile:Picswiss VD-46-21.jpg|Swiss Reformed Church of Saint-François\nFile:St-Laurent Lausanne.jpg| Swiss Reformed Church of Saint-Laurent\nFile:Hermitagefoundation.jpg|Fondation de l'Hermitage\nFile:Gare-lausanne-IMG 0002.JPG|Lausanne railway station\nFile:Beau Rivage Hotel, Lausanne.jpg|Hôtel Beau-Rivage Palace\nFile:TschumiMutuelleAssurance03.jpg|Administrative building of the Vaudoise Assurances\nFile:Musée de l'Elysée 4.jpg|Musée de l'Élysée\nFile:Musee olympique.jpg| Olympic Museum and Archives of the International Olympic Committee\nFile:Ouchy waterfront statue.JPG|Ouchy waterfront\nFile:Lausanne synagogue.jpg|Synagogue\nFile:Tour sauvabelin.JPG|The Sauvabelin Tower\nFile:Lausanne Lausanne.jpg|Compagnie générale de navigation sur le lac Léman\n\nCulture\n\nThe Orchestre de chambre de Lausanne, the Lausanne Opera and the Ensemble vocal de Lausanne provide a diverse and rich musical life. The latter has been under the direction of Michel Corboz for many years.\n\nIn January, the Prix de Lausanne, a famous dance competition, takes place at the Palais de Beaulieu (the biggest theatre in Switzerland Mathieu Signorell, \"Beaulieu lâche les congrès pour les infirmiers après l'échec de Taoua\", 24 heures, Saturday 14 February 2015.) over a one-week period. The event attracts dancers and some of the big names in dance from all over the world.\n\nThe Swiss Film Archive is based in Lausanne and the city hosts film festivals such as the Festival cinémas d'Afrique and the Lausanne Underground Film and Music Festival. In addition to modern cinemas, the \"Capitole\" (in activity since 1929) is the biggest cinema in Switzerland (currently 867 seats).\n\nThe town hosted the Eurovision Song Contest 1989. Each July, the Festival de la cité is held in the old part of town. Other music festivals include the Bach Festival, the Festival et concours Bach de Lausanne, which follows the Nuit de musées (museums' night) in the fall season.\n\nLausanne is also the home of the Béjart Ballet.\n\nMonuments \n\n* Cathedral (restored by Viollet-le-Duc)\n* Saint-Maire Castle (Château Saint-Maire)\n* Federal Supreme Court of Switzerland\n* Town Hall\n\nMuseums\n\nLausanne is also the site of many museums:\n* Archizoom\n* Musée Bolo\n* Olympic Museum (Musée olympique)\n* Musée de l'Élysée\n* Fondation de l'Hermitage (\"Hermitage Foundation\")\n* Collection of Outsider Art (Collection de l'art brut)\n* Museum of Contemporary Design and Applied Arts (Musée de design et d'arts appliqués contemporains)\n* [http://www.lausanne.ch/mhl Lausanne Museum of History (Musée historique de Lausanne)]\n* [http://www.dfj.vd.ch/serac/musee/rumine-arlaud.html Espace Arlaud] \n* [http://www.espace-des-inventions.ch Espace des inventions]  (\"Science Center for Kids\")\n* [http://www.verdan.ch/ Fondation Claude Verdan]  - Musée de la main (\"Museum of the Hand\")\n* [http://www.vivarium-lausanne.ch Vivarium de Lausanne] \n* Cantonal Botanical Museum and Gardens (Musée et jardins botaniques cantonaux)\n* [http://www.musees-vd.ch/fr/musee-monetaire Cantonal Museum of Money (Musée monétaire cantonal)]  (formerly Cabinet cantonal des médailles - [https://web.archive.org/web/20120211130422/http://www.lausanne.ch/view.asp?docId28071&domId\n64285&language=E short presentation in English])\n* [https://web.archive.org/web/20080516011803/http://www.musees-vd.ch/fr/musee-darcheologie-et-dhistoire/ Cantonal Museum of Archeology and History (Musée cantonal d'archéologie et d'histoire)]  [https://web.archive.org/web/20120211130449/http://www.lausanne.ch/view.asp?docId28061&domId\n64285&language=E short presentation in English]\n* Cantonal Museum of Fine Arts (Musée cantonal des beaux-arts)\n* Cantonal Museum of Zoology (Musée cantonal de zoologie)\n* [http://www.unil.ch/mcg Cantonal Museum of Geology (Musée cantonal de Géologie)] \n* [https://web.archive.org/web/20120211130519/http://www.lausanne.ch/view.asp?docId28077&domId\n64285&language=E Musée romain de Lausanne-Vidy] (\"Lausanne-Vidy Roman Museum\")\n\nArt galleries\n\nMain contemporary art galleries:\n* Galerie Lucy Mackintosh (closed)\n* [http://www.dubnermoderne.ch/ Dubner Moderne]\n* [http://www.synopsism.com/ Synopsism] \n* [http://www.esf.ch/ Espace Saint-François] \nArt centers or artist-run galleries:\n* [https://web.archive.org/web/20050608031132/http://www.circuit.ch/ Circuit] \n* [http://www.galerie1m3.com/ Galerie Galerie 1m3]\n* [http://www.espacedoll.ch/ Doll espace d'art contemporain] \n\nMusic\n\n* Contemporary composer Leonardo Balada's Symphony No. 4 is subtitled 'Lausanne'.\n* Igor Stravinsky's L'Histoire du Soldat was premiered in Lausanne in September 1918.\n\nSports\n\nLausanne is home to the IOC, with water sports available on the nearby lake and mountaineering in the nearby mountains. Cycling is also a common pastime, with the vineyards in the surrounding hills providing extensive views and challenging routes. There is an annual track and field meeting (Athletissima), road running through the city (the 20 km (12 mi) of Lausanne), the Tour de Romandie road cycling race, Marathon of Lausanne and triathlon competition, among other sports events. The two most important sports are ice hockey and football. Lausanne will host the 2020 Winter Youth Olympics and the 2020 IIHF World Championship.\n\n;Local\n* Lausanne Hockey Club\n* Lausanne-Sport Football Club\n* Lausanne-Sports Aviron Rowing Club\n* Lausanne Sharks American Football Club\n* Federation of Swiss Bandy\n* Stade Lausanne Rugby Club\n* Lausanne University Club (Luc) Rugby\n\n;International\nLausanne hosts the headquarters of the International Olympic Committee (IOC) and Court of Arbitration for Sport (CAS), and many other international sport associations:\n\n* European Athletics Association (EAA)\n* International Baseball Federation (IBAF)\n* International Federation for Equestrian Sports (French: Fédération Équestre Internationale, FEI)\n* International Fencing Federation (French: Fédération Internationale d'Escrime, FIE)\n* International Golf Federation (French: Fédération Internationale de Golf, FIG)\n* International Federation of Gymnastics (French: Fédération Internationale de Gymnastique, FIG)\n* International Hockey Federation (French: Fédération Internationale de Hockey, FIH)\n* International Rowing Federation (French: Fédération Internationale des Sociétés d'Aviron, FISA)\n* International Skating Union (ISU)\n* International Swimming Federation (French: Fédération Internationale de Natation, FINA)\n* International Table Tennis Federation (ITTF)\n* International Triathlon Union (ITU)\n* International University Sports Federation (French: Fédération Internationale du Sport Universitaire, FISU)\n* International Volleyball Federation (French: Fédération Internationale de Volleyball, FIVB)\n* International Wushu Federation (IWUF)http://www.iwuf.org/iwuf/\n* World Air Sports Federation (French: Fédération Aéronautique Internationale, FAI)\n* World Archery Federation (WA) (French: Fédération Internationale de Tir à l'Arc, FITA)\n\nNotable people\n\nLausanne is the birthplace of:\n* Timea Bacsinszky, tennis player\n* David Bennent, actor\n* Metropolitan Anthony (Bloom) of Sourozh, Russian Orthodox ecclesiastic located in Britain\n* François-Louis David Bocion, artist and teacher\n* Ernest Boiceau (1881-1950), artist and designer\n* Marius Borgeaud, artist\n* Hélène Boschi, pianist,\n* Johann Ludwig Burckhardt, traveler and orientalist\n* Alejo Carpentier, Cuban-French writer\n* Stéphane Chapuisat, footballer\n* Albert Chavannes, philosopher\n* Benjamin Constant, thinker, writer and politician\n* Aloise Corbaz, outsider artist\n* Charles Dutoit, conductor\n* Egon von Furstenberg, fashion designer\n* Eugène Grasset, decorative artist\n* Dominique Lévy, art dealer \n* Ludovic Magnin, footballer\n* Vincent Perez, film actor and director\n* Bertrand Piccard, psychiatrist and balloonist\n* Charles-Ferdinand Ramuz, writer\n* Ubolratana Rajakanya, Thai princess\n* Théophile Steinlen, Art Nouveau painter and printmaker\n* James Thiérrée, actor\n* Elizabeth Thompson (Lady Butler), British painter\n* Bernard Tschumi, contemporary architect, writer, and educator\n* Nanos Valaoritis Greek poet\n* Félix Vallotton, post-impressionist painter\n* Claude Haldi, car driver who has been involved in rally racing, hill climbing and endurance racing.\n* André Wicky, was a Swiss racing driver, active from the late 1950s to the late 1970s. He was mainly involved in sports car racing, as an entrant and team owner as well as a driver, but also took part in several non-championship Formula One races during the 1960s.\n* Jacques Viret (born 1943), French musicologist\n* Stanislas Wawrinka, tennis player\n* Jocelyn Wildenstein, Manhattan socialite and ex-wife of the late Alec N. Wildenstein\n\nNotable residents:\n* Bhumibol Adulyadej, late king of Thailand was educated at the École nouvelle de la Suisse romande\n* Pierre Amoyal, Paris-born violinist; professor at Lausanne Conservatory\n* Jean Anouilh, French dramatist\n* Ingvar Kamprad, founder of IKEA\n* Alice Bailly, Swiss painter and multimedia artist\n* Maurice Béjart, choreographer\n* Lorik Cana, professional footballer for Albania and Marseille\n* Capucine, French actress and model\n* Coco Chanel, fashion designer\n* Pierre de Coubertin, French baron and founder of the International Olympic Committee\n* Jean-Pascal Delamuraz, Swiss politician\n* Helen of Greece and Denmark, Queen Mother of Romania\n* Victoria Eugenia of Battenberg, Queen of Spain\n* Peter Carl Fabergé, Russian jeweller\n* Edward Gibbon, British historian\n* Gloria Guinness, socialite and writer\n* Oswald Heer, Swiss geologist and naturalist\n* Stéphane Lambiel, men's figure skater, Olympic silver medalist and 2-time world champion\n* Sébastien Loeb, French rally driver\n* Carl Gustaf Emil Mannerheim, Finnish president and field marshal\n* James Mason, English actor\n* Fernand Melgar, Swiss actor\n* Jô Soares, Brazilian humorist\n* Waldemar Mordecai Haffkine, Ukrainian bacteriologist\n* Paloma Picasso, fashion designer\n* Auguste Piccard, Swiss physicist, inventor and explorer\n* George Sanders, English actor\n* Albin Schram, renowned manuscript collector\n* Georges Simenon, Belgian writer\n* Jon Steele, American-born author\n* Han Suyin, China-born writer\n* Karol Szymanowski, Polish composer\n* Eugène Viollet-le-Duc, French architect\n* Pierre Viret, Swiss reformed theologian\n* Serge Voronoff, surgeon buried in Lausanne. Lausanne. http://en.wikipedia.org/?curid=18623."
  }
}
