{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7801",
  "eid" : "e36d99e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778461310,
  "textBody" : "Critical psychology is a perspective on psychology that draws extensively on critical theory. Critical psychology challenges mainstream psychology and attempts to apply psychological understandings in more progressive ways, often looking towards social change as a means of preventing and treating psychopathology.\n\nOne of critical psychology's main criticisms of conventional psychology is that it fails to consider or deliberately ignores the way power differences between social classes and groups can affect the mental and physical well-being of individuals or groups of people. It does this, in part, because it tends to explain behavior at the level of the individual.\n\nOrigins\n\nCriticisms of mainstream psychology consistent with current critical psychology usage have existed since psychology's modern development in the late 19th century. Use of the term \"critical psychology\" started in the 1970s in Berlin at Freie Universität Berlin. The German branch of critical psychology predates and has developed largely separately from the rest of the field. As of May 2007, only a few works have been translated into English.Klaus Holzkamp (1992): On Doing Psychology Critically. Theory and Psychology 2, S.193–204; for further references see also Charles Tolman (1994): Psychology, Society and Subjectivity: An Introduction to German Critical Psychology, London: Routledge & Thomas Teo (1998): Klaus Holzkamp and the Rise and Fall of German Critical Psychology. History of Psychology 1998, Vol. 1, Nr. 3; Wolfgang Maiers (1999): Critical Psychology – An Unfinished Modern Project. In: Wolfgang Maiers et al. (Eds.): Challenges to Theoretical Psychology, 457–66 The German Critical Psychology movement is rooted in the post-war babyboomers' student revolt of the late '60s; see German student movement. Marx's Critique of Political Economy played an important role in the German branch of the student revolt, which was centered in Berlin. Then Berlin was a capitalist city surrounded by communist-ruled East Germany, represented a \"hot spot\" of political and ideological controversy for the revolutionary German students. The sociological foundations of critical psychology are decidedly Marxist.\n\nKlaus Holzkamp\n\nOne of the most important and sophisticated books in the field is the Grundlegung der PsychologieKlaus Holzkamp (1983): Grundlegung der Psychologie. Frankfurt/M.: Campus (Foundations of Psychology) by Klaus Holzkamp, who might be considered the theoretical founder of critical psychology. Holzkamp, who had written two books on theory of scienceKlaus Holzkamp (1964), Theorie und Experiment in der Psychologie. Berlin: de Gruyter (Theory and Experiment in Psychology); Klaus Holzkamp (1968): Wissenschaft als Handlung. Versuch einer neuen Grundlegung der Wissenschaftslehre. Berlin: de Gruyter (Science as Action – A new Approach to the Theory of Science) and one on sensory perceptionKlaus Holzkamp (1973): Sinnliche Erkenntnis. Historischer Ursprung und gesellschaftliche Funktion der Wahrnehmung. Frankfurt/M.: Athenäum (Sensory Perception: Historical Origins and Social Functions of Perception before publishing the Grundlegung der Psychologie in 1983, thought this major work provided a solid paradigm for psychological research, as he viewed psychology as a pre-paradigmatic scientific discipline (T.S. Kuhn had used the term \"pre-paradigmatic\" for social science).\n\nHolzkamp mostly based his sophisticated attempt to provide a comprehensive and integrated set of categories defining the field of psychological research on Aleksey Leontyev's approach to cultural–historical psychology and activity theory. Leontyev had seen human action as a result of biological as well as cultural evolution and, drawing on Marx's materialist conception of culture, stressed that individual cognition is always part of social action which in turn is mediated by man-made tools (cultural artifacts), language and other man-made systems of symbols, which he viewed as a major distinguishing feature of human culture and, thus, human cognition. Another important source was Lucien Séve's theory of personality,[http://www.marxists.org/archive/seve/index.htm Lucien Seve] which provided the concept of \"social activity matrices\" as mediating structure between individual and social reproduction. At the same time, the Grundlegung systematically integrated previous specialized work done at Free University of Berlin in the '70s by critical psychologists who also had been influenced by Marx, Leontyev and Seve. This included books on animal behavior/ethology,Volker Schurig (1975): Naturgeschichte des Psychischen 1: Psychogenese und elementare Formen der Tierkommunikation. (Natural History of the Psyche 1: Psychogenesis and Elementary Forms of Animal Communication. Frankfurt/M.: Campus; Volker Schurig (1975): Naturgeschichte des Psychischen 2: Lernen und Abstraktionsleistungen bei Tieren (Natural History of the Psyche 2: Learning and Abstraction Capabilities in Animals. Frankfurt/M. Campus; Volker Schurig (1976): Die Entstehung des Bewußtseins (The Emergence of Consciousness). Frankfurt/M.: Campus; . Frankfurt/M.: Campus; sensory perception, motivationUte Osterkamp (1975/1976): Grundlagen der Psychologischen Motivationsforschung (Foundations of Psychological Research of Motivation, Frankfurt/M: Campus (2 Volumes) and cognition.Rainer Seidel (1976): Denken. Psychologische Analyse der Entstehung und Lösung von Problemen. (Cognition. Psychological Analysis of Formulating and Solving Problems. Frankfurt/M.: Campus He also incorporated ideas from Freud's psychoanalysis and Merleau-Ponty's phenomenology into his approach.\n\nOne core result of Holzkamp's historical and comparative analysis of human reproductive action, perception and cognition is a very specific concept of meaning that identifies symbolic meaning as historically and culturally constructed, purposeful conceptual structures that humans create in close relationship to material culture and within the context of historically specific formations of social reproduction.\n\nComing from this phenomenological perspective on culturally mediated and socially situated action, Holzkamp launched a devastating and original methodological attack on behaviorism (which he termed S–R (stimulus–response) psychology) based on linguistic analysis, showing in minute detail the rhetorical patterns by which this approach to psychology creates the illusion of \"scientific objectivity\" while at the same time losing relevance for understanding culturally situated, intentional human actions.Klaus Holzkamp (1987): Die Verkennung von Handlungsbegründungen als empirische Zusammenhangsannahmen in sozialpsychologischen Theorien: Methodologische Fehlorientierung infolge von Begriffsverwirrung (Mistaking Reasons for Causes in Theories of Social Psychology: Methodological Errors as a Result of Conceptual Confusion), Forum Kritische Psychologie 19, Berlin: Argument Verlag, pp. 23–59.Klaus Holzkamp (1993): Lernen: Subjektwissenschaftliche Grundlegung. Frankfurt/M.: Campus, Chapter 1: \"Hinführung auf das Verfahren der Problementwicklung\" (Introduction to the Sequence of Presentation), pp. 17–39 Against this approach, he developed his own approach to generalization and objectivity, drawing on ideas from Kurt Lewin in Chapter 9 of Grundlegung der Psychologie.\n\nHis last major publication before his death in 1995 was about learning.Klaus Holzkamp (1993): Lernen: Subjektwissenschaftliche Grundlegung (\"Learning: Subject-Scientific Foundations\"). Frankfurt/M.: Campus It appeared in 1993 and contained a phenomenological theory of learning from the standpoint of the subject. One important concept Holzkamp developed was \"reinterpretation\" of theories developed by conventional psychology. This meant to look at these concepts from the standpoint of the paradigm of critical psychology, thereby integrating their useful insights into critical psychology while at the same time identifying and criticizing their limiting implications, which in the case of S–R psychology were the rhetorical elimination of the subject and intentional action, and in the case of cognitive psychology which did take into account subjective motives and intentional actions, methodological individualism. \n\nThe first part of the book thus contains an extensive look at the history of psychological theories of learning and a minute re-interpretation of those concepts from the perspective of the paradigm of critical psychology, which focuses on intentional action situated in specific socio-historical/cultural contexts. The conceptions of learning he found most useful in his own detailed analysis of \"classroom learning\" came from cognitive anthropologists Jean Lave (situated learning) and Edwin Hutchins (distributed cognition). \n\nThe book's second part contained an extensive analysis on the modern state's institutionalized forms of \"classroom learning\" as the cultural–historical context that shapes much of modern learning and socialization. In this analysis, he heavily drew upon Michel Foucault's Discipline and Punish. Holzkamp felt that classroom learning as the historically specific form of learning does not make full use of student's potentials, but rather limits her or his learning potentials by a number of \"teaching strategies.\" Part of his motivation for the book was to look for alternative forms of learning that made use of the enormous potential of the human psyche in more fruitful ways. Consequently, in the last section of the book, Holzkamp discusses forms of \"expansive learning\" that seem to avoid the limitations of classroom learning, such as apprenticeship and learning in contexts other than classrooms.  \n\nThis search culminated in plans to write a major work on life leadership in the specific historical context of modern (capitalist) society. Due to his death in 1995, this work never got past the stage of early (and premature) conceptualizations, some of which were published in the journals Forum Kritische Psychologie and Argument.Klaus Holzkamp (1995): Alltägliche Lebensführung als subjektwissenschaftliches Grundkonzept (Everyday Life Leadership as Basic Concept of a Scientific Theory of the Subject). Das Argument, 37. Jahrgang, Heft 6, November/December 1995\n\n1960s–1970s\n\nIn the 1960s and 1970s the term radical psychology was used by psychologists to denote a branch of the field which rejected conventional psychology's focus on the individual as the basic unit of analysis and sole source of psychopathology. Instead, radical psychologists examined the role of society in causing and treating problems and looked towards social change as an alternative to therapy to treat mental illness and as a means of preventing psychopathology. Within psychiatry the term anti-psychiatry was often used and now British activists prefer the term critical psychiatry. Critical psychology is currently the preferred term for the discipline of psychology keen to find alternatives to the way the discipline of psychology reduces human experience to the level of the individual and thereby strips away possibilities for radical social change.\n\n1990s\n\nStarting in the 1990s a new wave of books started to appear on critical psychology, the most influential being the edited book Critical Psychology by Dennis Fox and Isaac Prilleltensky. Various introductory texts to critical psychology written in the United Kingdom have tended to focus on discourse, but this has been seen by some proponents of critical psychology as a reduction of human experience to language which is as politically dangerous as the way mainstream psychology reduces experience to the individual mind.  Attention to language and ideological processes, others would argue, is essential to effective critical psychology - it is not simply a matter of applying mainstream psychological concepts to issues of social change.\n\nIan Parker\n\nIn 1999 Ian Parker published an influential manifesto in both the online journal Radical Psychology and the Annual Review of Critical Psychology. This manifesto argues that critical psychology should include the following four components:\n# Systematic examination of how some varieties of psychological action and experience are privileged over others, how dominant accounts of \"psychology\" operate ideologically and in the service of power;\n# Study of the ways in which all varieties of psychology are culturally historically constructed, and how alternative varieties of psychology may confirm or resist ideological assumptions in mainstream models;\n# Study of forms of surveillance and self-regulation in everyday life and the ways in which psychological culture operates beyond the boundaries of academic and professional practice; and\n# Exploration of the way everyday \"ordinary psychology\" structures academic and professional work in psychology and how everyday activities might provide the basis for resistance to contemporary disciplinary practices.\n\nCritical psychology today\n\nThere are a few international journals devoted to critical psychology, including the no longer published International Journal of Critical Psychology  (continued in the journal Subjectivity) and the Annual Review of Critical Psychology. The journals still tend to be directed to an academic audience, though the Annual Review of Critical Psychology runs as an open-access online journal. There are close links between critical psychologists and critical psychiatrists in Britain through the Asylum Collective. Critical psychology courses and research concentrations are available at Manchester Metropolitan University, York St Johns University, the University of East London, the University of Edinburgh, the University of KwaZulu Natal, the Graduate Center of the City University of New York, and the University of West Georgia. Undergraduate concentrations can also be found at the California Institute of Integral Studies and Prescott College.\n\nExtensions\n\nLike many critical applications, critical psychology has expanded beyond Marxist and feminist roots to benefit from other critical approaches. Consider ecopsychology and transpersonal psychology. Critical psychology and related work has also sometimes been labelled radical psychology and liberation psychology. In the field of developmental psychology, the work of Erica Burman has been influential.\n\nVarious sub-disciplines within psychology have begun to establish their own critical orientations. Perhaps the most extensive are critical health psychology and community psychology.\n\nInternationally\n\nAn early international overview of critical psychology perspectives can be found in Critical Psychology: Voices for Change, edited by Tod Sloan (Macmillan, 2000).  In 2015, Ian Parker edited the Handbook of Critical Psychology.\nGermany\n\nAt FU-Berlin, critical psychology was not really seen as a division of psychology and followed its own methodology, trying to reformulate traditional psychology on an unorthodox Marxist base and drawing from Soviet ideas of cultural–historical psychology, particularly Aleksey Leontyev. Some years ago the department of critical psychology at FU-Berlin was merged into the traditional psychology department.\n\nAn April 2009 issue of the Sage journal Theory & Psychology[http://tap.sagepub.com/content/vol19/issue2/?etoc Special Issue: German Critical Psychology: Interventions in Honor of Klaus Holzkamp] (edited by Desmond Painter, Athanasios Marvakis, and Leendert Mos) is devoted to an examination of German critical psychology.\n\nSouth Africa\n\nThe University of KwaZulu-Natal in Durban, South Africa, is one of few worldwide to offer a Master's course in critical psychology.[http://www.ukzn.ac.za/psychology/default.asp University of KwaZulu-Natal: Critical psychology] For an overview of critical psychology in South Africa, see Desmond Painter and Martin Terre Blanche's article on \"Critical Psychology in South Africa: Looking back and looking forwards\".[http://www.criticalmethods.org/collab/critpsy.htm Critical Psychology in South Africa: Looking back and looking forwards] They have also now started a critical psychology blog.[http://critpsy.blogspot.com/ Critical Psychology] \n\nUnited States and Canada\n\nCritical psychology in the United States and Canada has, for the most part, focused on critiques of mainstream psychology's support for an unjust status quo.Bruce E. Levine, [http://www.counterpunch.org/2014/05/14/psychiatrys-manufacture-of-consent/ The Chemical Imbalance Theory and the Antidepressant Explosion - Psychiatry’s Manufacture of Consent], 2014-05-14, CounterPunch  No departments of critical psychology exist, with the exception of the Bachelor's Completion Program with a minor in Critical Psychology, offered at the California Institute of Integral Studies in San Francisco, though critical perspectives are sometimes encountered in traditional universities, perhaps especially within community psychology programs. The University of West Georgia offers a Ph.D. in Consciousness and Society with critical psychology being one of the main three theoretical orientations. North American efforts include the 1993 founding of RadPsyNet,[http://radpsynet.org RadPsyNet] the 1997 publication of Critical Psychology: An Introduction[http://dennisfox.net/critpsy/book.html Critical Psychology: An Introduction] (edited by Dennis Fox and Isaac Prilleltensky; expanded 2009 edition edited by Dennis Fox, Isaac Prilleltensky, and Stephanie Austin), the 2001 Monterey Conference on Critical Psychology, and in underlying themes of many contributions to the Journal of Social Action in Counseling and Psychology.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Critical psychology" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7801" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Critical psychology is a perspective on psychology that draws extensively on critical theory. Critical psychology challenges mainstream psychology and attempts to apply psychological understandings in more progressive ways, often looking towards social change as a means of preventing and treating psychopathology.\n\nOne of critical psychology's main criticisms of conventional psychology is that it fails to consider or deliberately ignores the way power differences between social classes and groups can affect the mental and physical well-being of individuals or groups of people. It does this, in part, because it tends to explain behavior at the level of the individual.\n\nOrigins\n\nCriticisms of mainstream psychology consistent with current critical psychology usage have existed since psychology's modern development in the late 19th century. Use of the term \"critical psychology\" started in the 1970s in Berlin at Freie Universität Berlin. The German branch of critical psychology predates and has developed largely separately from the rest of the field. As of May 2007, only a few works have been translated into English.Klaus Holzkamp (1992): On Doing Psychology Critically. Theory and Psychology 2, S.193–204; for further references see also Charles Tolman (1994): Psychology, Society and Subjectivity: An Introduction to German Critical Psychology, London: Routledge & Thomas Teo (1998): Klaus Holzkamp and the Rise and Fall of German Critical Psychology. History of Psychology 1998, Vol. 1, Nr. 3; Wolfgang Maiers (1999): Critical Psychology – An Unfinished Modern Project. In: Wolfgang Maiers et al. (Eds.): Challenges to Theoretical Psychology, 457–66 The German Critical Psychology movement is rooted in the post-war babyboomers' student revolt of the late '60s; see German student movement. Marx's Critique of Political Economy played an important role in the German branch of the student revolt, which was centered in Berlin. Then Berlin was a capitalist city surrounded by communist-ruled East Germany, represented a \"hot spot\" of political and ideological controversy for the revolutionary German students. The sociological foundations of critical psychology are decidedly Marxist.\n\nKlaus Holzkamp\n\nOne of the most important and sophisticated books in the field is the Grundlegung der PsychologieKlaus Holzkamp (1983): Grundlegung der Psychologie. Frankfurt/M.: Campus (Foundations of Psychology) by Klaus Holzkamp, who might be considered the theoretical founder of critical psychology. Holzkamp, who had written two books on theory of scienceKlaus Holzkamp (1964), Theorie und Experiment in der Psychologie. Berlin: de Gruyter (Theory and Experiment in Psychology); Klaus Holzkamp (1968): Wissenschaft als Handlung. Versuch einer neuen Grundlegung der Wissenschaftslehre. Berlin: de Gruyter (Science as Action – A new Approach to the Theory of Science) and one on sensory perceptionKlaus Holzkamp (1973): Sinnliche Erkenntnis. Historischer Ursprung und gesellschaftliche Funktion der Wahrnehmung. Frankfurt/M.: Athenäum (Sensory Perception: Historical Origins and Social Functions of Perception before publishing the Grundlegung der Psychologie in 1983, thought this major work provided a solid paradigm for psychological research, as he viewed psychology as a pre-paradigmatic scientific discipline (T.S. Kuhn had used the term \"pre-paradigmatic\" for social science).\n\nHolzkamp mostly based his sophisticated attempt to provide a comprehensive and integrated set of categories defining the field of psychological research on Aleksey Leontyev's approach to cultural–historical psychology and activity theory. Leontyev had seen human action as a result of biological as well as cultural evolution and, drawing on Marx's materialist conception of culture, stressed that individual cognition is always part of social action which in turn is mediated by man-made tools (cultural artifacts), language and other man-made systems of symbols, which he viewed as a major distinguishing feature of human culture and, thus, human cognition. Another important source was Lucien Séve's theory of personality,[http://www.marxists.org/archive/seve/index.htm Lucien Seve] which provided the concept of \"social activity matrices\" as mediating structure between individual and social reproduction. At the same time, the Grundlegung systematically integrated previous specialized work done at Free University of Berlin in the '70s by critical psychologists who also had been influenced by Marx, Leontyev and Seve. This included books on animal behavior/ethology,Volker Schurig (1975): Naturgeschichte des Psychischen 1: Psychogenese und elementare Formen der Tierkommunikation. (Natural History of the Psyche 1: Psychogenesis and Elementary Forms of Animal Communication. Frankfurt/M.: Campus; Volker Schurig (1975): Naturgeschichte des Psychischen 2: Lernen und Abstraktionsleistungen bei Tieren (Natural History of the Psyche 2: Learning and Abstraction Capabilities in Animals. Frankfurt/M. Campus; Volker Schurig (1976): Die Entstehung des Bewußtseins (The Emergence of Consciousness). Frankfurt/M.: Campus; . Frankfurt/M.: Campus; sensory perception, motivationUte Osterkamp (1975/1976): Grundlagen der Psychologischen Motivationsforschung (Foundations of Psychological Research of Motivation, Frankfurt/M: Campus (2 Volumes) and cognition.Rainer Seidel (1976): Denken. Psychologische Analyse der Entstehung und Lösung von Problemen. (Cognition. Psychological Analysis of Formulating and Solving Problems. Frankfurt/M.: Campus He also incorporated ideas from Freud's psychoanalysis and Merleau-Ponty's phenomenology into his approach.\n\nOne core result of Holzkamp's historical and comparative analysis of human reproductive action, perception and cognition is a very specific concept of meaning that identifies symbolic meaning as historically and culturally constructed, purposeful conceptual structures that humans create in close relationship to material culture and within the context of historically specific formations of social reproduction.\n\nComing from this phenomenological perspective on culturally mediated and socially situated action, Holzkamp launched a devastating and original methodological attack on behaviorism (which he termed S–R (stimulus–response) psychology) based on linguistic analysis, showing in minute detail the rhetorical patterns by which this approach to psychology creates the illusion of \"scientific objectivity\" while at the same time losing relevance for understanding culturally situated, intentional human actions.Klaus Holzkamp (1987): Die Verkennung von Handlungsbegründungen als empirische Zusammenhangsannahmen in sozialpsychologischen Theorien: Methodologische Fehlorientierung infolge von Begriffsverwirrung (Mistaking Reasons for Causes in Theories of Social Psychology: Methodological Errors as a Result of Conceptual Confusion), Forum Kritische Psychologie 19, Berlin: Argument Verlag, pp. 23–59.Klaus Holzkamp (1993): Lernen: Subjektwissenschaftliche Grundlegung. Frankfurt/M.: Campus, Chapter 1: \"Hinführung auf das Verfahren der Problementwicklung\" (Introduction to the Sequence of Presentation), pp. 17–39 Against this approach, he developed his own approach to generalization and objectivity, drawing on ideas from Kurt Lewin in Chapter 9 of Grundlegung der Psychologie.\n\nHis last major publication before his death in 1995 was about learning.Klaus Holzkamp (1993): Lernen: Subjektwissenschaftliche Grundlegung (\"Learning: Subject-Scientific Foundations\"). Frankfurt/M.: Campus It appeared in 1993 and contained a phenomenological theory of learning from the standpoint of the subject. One important concept Holzkamp developed was \"reinterpretation\" of theories developed by conventional psychology. This meant to look at these concepts from the standpoint of the paradigm of critical psychology, thereby integrating their useful insights into critical psychology while at the same time identifying and criticizing their limiting implications, which in the case of S–R psychology were the rhetorical elimination of the subject and intentional action, and in the case of cognitive psychology which did take into account subjective motives and intentional actions, methodological individualism. \n\nThe first part of the book thus contains an extensive look at the history of psychological theories of learning and a minute re-interpretation of those concepts from the perspective of the paradigm of critical psychology, which focuses on intentional action situated in specific socio-historical/cultural contexts. The conceptions of learning he found most useful in his own detailed analysis of \"classroom learning\" came from cognitive anthropologists Jean Lave (situated learning) and Edwin Hutchins (distributed cognition). \n\nThe book's second part contained an extensive analysis on the modern state's institutionalized forms of \"classroom learning\" as the cultural–historical context that shapes much of modern learning and socialization. In this analysis, he heavily drew upon Michel Foucault's Discipline and Punish. Holzkamp felt that classroom learning as the historically specific form of learning does not make full use of student's potentials, but rather limits her or his learning potentials by a number of \"teaching strategies.\" Part of his motivation for the book was to look for alternative forms of learning that made use of the enormous potential of the human psyche in more fruitful ways. Consequently, in the last section of the book, Holzkamp discusses forms of \"expansive learning\" that seem to avoid the limitations of classroom learning, such as apprenticeship and learning in contexts other than classrooms.  \n\nThis search culminated in plans to write a major work on life leadership in the specific historical context of modern (capitalist) society. Due to his death in 1995, this work never got past the stage of early (and premature) conceptualizations, some of which were published in the journals Forum Kritische Psychologie and Argument.Klaus Holzkamp (1995): Alltägliche Lebensführung als subjektwissenschaftliches Grundkonzept (Everyday Life Leadership as Basic Concept of a Scientific Theory of the Subject). Das Argument, 37. Jahrgang, Heft 6, November/December 1995\n\n1960s–1970s\n\nIn the 1960s and 1970s the term radical psychology was used by psychologists to denote a branch of the field which rejected conventional psychology's focus on the individual as the basic unit of analysis and sole source of psychopathology. Instead, radical psychologists examined the role of society in causing and treating problems and looked towards social change as an alternative to therapy to treat mental illness and as a means of preventing psychopathology. Within psychiatry the term anti-psychiatry was often used and now British activists prefer the term critical psychiatry. Critical psychology is currently the preferred term for the discipline of psychology keen to find alternatives to the way the discipline of psychology reduces human experience to the level of the individual and thereby strips away possibilities for radical social change.\n\n1990s\n\nStarting in the 1990s a new wave of books started to appear on critical psychology, the most influential being the edited book Critical Psychology by Dennis Fox and Isaac Prilleltensky. Various introductory texts to critical psychology written in the United Kingdom have tended to focus on discourse, but this has been seen by some proponents of critical psychology as a reduction of human experience to language which is as politically dangerous as the way mainstream psychology reduces experience to the individual mind.  Attention to language and ideological processes, others would argue, is essential to effective critical psychology - it is not simply a matter of applying mainstream psychological concepts to issues of social change.\n\nIan Parker\n\nIn 1999 Ian Parker published an influential manifesto in both the online journal Radical Psychology and the Annual Review of Critical Psychology. This manifesto argues that critical psychology should include the following four components:\n# Systematic examination of how some varieties of psychological action and experience are privileged over others, how dominant accounts of \"psychology\" operate ideologically and in the service of power;\n# Study of the ways in which all varieties of psychology are culturally historically constructed, and how alternative varieties of psychology may confirm or resist ideological assumptions in mainstream models;\n# Study of forms of surveillance and self-regulation in everyday life and the ways in which psychological culture operates beyond the boundaries of academic and professional practice; and\n# Exploration of the way everyday \"ordinary psychology\" structures academic and professional work in psychology and how everyday activities might provide the basis for resistance to contemporary disciplinary practices.\n\nCritical psychology today\n\nThere are a few international journals devoted to critical psychology, including the no longer published International Journal of Critical Psychology  (continued in the journal Subjectivity) and the Annual Review of Critical Psychology. The journals still tend to be directed to an academic audience, though the Annual Review of Critical Psychology runs as an open-access online journal. There are close links between critical psychologists and critical psychiatrists in Britain through the Asylum Collective. Critical psychology courses and research concentrations are available at Manchester Metropolitan University, York St Johns University, the University of East London, the University of Edinburgh, the University of KwaZulu Natal, the Graduate Center of the City University of New York, and the University of West Georgia. Undergraduate concentrations can also be found at the California Institute of Integral Studies and Prescott College.\n\nExtensions\n\nLike many critical applications, critical psychology has expanded beyond Marxist and feminist roots to benefit from other critical approaches. Consider ecopsychology and transpersonal psychology. Critical psychology and related work has also sometimes been labelled radical psychology and liberation psychology. In the field of developmental psychology, the work of Erica Burman has been influential.\n\nVarious sub-disciplines within psychology have begun to establish their own critical orientations. Perhaps the most extensive are critical health psychology and community psychology.\n\nInternationally\n\nAn early international overview of critical psychology perspectives can be found in Critical Psychology: Voices for Change, edited by Tod Sloan (Macmillan, 2000).  In 2015, Ian Parker edited the Handbook of Critical Psychology.\nGermany\n\nAt FU-Berlin, critical psychology was not really seen as a division of psychology and followed its own methodology, trying to reformulate traditional psychology on an unorthodox Marxist base and drawing from Soviet ideas of cultural–historical psychology, particularly Aleksey Leontyev. Some years ago the department of critical psychology at FU-Berlin was merged into the traditional psychology department.\n\nAn April 2009 issue of the Sage journal Theory & Psychology[http://tap.sagepub.com/content/vol19/issue2/?etoc Special Issue: German Critical Psychology: Interventions in Honor of Klaus Holzkamp] (edited by Desmond Painter, Athanasios Marvakis, and Leendert Mos) is devoted to an examination of German critical psychology.\n\nSouth Africa\n\nThe University of KwaZulu-Natal in Durban, South Africa, is one of few worldwide to offer a Master's course in critical psychology.[http://www.ukzn.ac.za/psychology/default.asp University of KwaZulu-Natal: Critical psychology] For an overview of critical psychology in South Africa, see Desmond Painter and Martin Terre Blanche's article on \"Critical Psychology in South Africa: Looking back and looking forwards\".[http://www.criticalmethods.org/collab/critpsy.htm Critical Psychology in South Africa: Looking back and looking forwards] They have also now started a critical psychology blog.[http://critpsy.blogspot.com/ Critical Psychology] \n\nUnited States and Canada\n\nCritical psychology in the United States and Canada has, for the most part, focused on critiques of mainstream psychology's support for an unjust status quo.Bruce E. Levine, [http://www.counterpunch.org/2014/05/14/psychiatrys-manufacture-of-consent/ The Chemical Imbalance Theory and the Antidepressant Explosion - Psychiatry’s Manufacture of Consent], 2014-05-14, CounterPunch  No departments of critical psychology exist, with the exception of the Bachelor's Completion Program with a minor in Critical Psychology, offered at the California Institute of Integral Studies in San Francisco, though critical perspectives are sometimes encountered in traditional universities, perhaps especially within community psychology programs. The University of West Georgia offers a Ph.D. in Consciousness and Society with critical psychology being one of the main three theoretical orientations. North American efforts include the 1993 founding of RadPsyNet,[http://radpsynet.org RadPsyNet] the 1997 publication of Critical Psychology: An Introduction[http://dennisfox.net/critpsy/book.html Critical Psychology: An Introduction] (edited by Dennis Fox and Isaac Prilleltensky; expanded 2009 edition edited by Dennis Fox, Isaac Prilleltensky, and Stephanie Austin), the 2001 Monterey Conference on Critical Psychology, and in underlying themes of many contributions to the Journal of Social Action in Counseling and Psychology. Critical psychology. http://en.wikipedia.org/?curid=7801."
  }
}
