{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12523",
  "eid" : "032569c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778514524,
  "textBody" : "Gerard Manley Hopkins  (28 July 1844 – 8 June 1889) was an English poet, Catholic and Jesuit priest, whose posthumous fame established him among the leading Victorian poets. His manipulation of prosody (particularly his invention of sprung rhythm and use of imagery) established him as an innovative writer of verse. Two of his major themes were nature and religion.\n\nLife\n\nEarly Life and Family \n\nGerard Manley Hopkins was born in Stratford, EssexGardner, W. H. (1963) Gerard Manley Hopkins: Poems and Prose Penguin pxvi (now in Greater London), as the eldest of probably nine children to Manley and Catherine (Smith) Hopkins.Norman White, \"Hopkins, Gerard Manley (1844–1889)\", Oxford Dictionary of National Biography, Oxford University Press. He was christened at the Anglican church of St John's, Stratford. His father founded a marine insurance firm and at one time served as Hawaiian consul-general in London. He was also for a time church warden at St John-at-Hampstead. His grandfather was the physician John Simm Smith, a university colleague of John Keats, and close friend of the eccentric philanthropist Ann Thwaytes.\n\nAs a poet, Hopkins's father published works including A Philosopher's Stone and Other Poems (1843), Pietas Metrica (1849), and Spicelegium Poeticum, A Gathering of Verses by Manley Hopkins (1892). He reviewed poetry for The Times and wrote one novel. Catherine (Smith) Hopkins was the daughter of a London physician, particularly fond of music and of reading, especially German philosophy, literature and the novels of Dickens. Both parents were deeply religious High Church Anglicans. Catherine's sister, Maria Smith Giberne, taught her nephew Gerard to sketch. The interest was supported by his uncle, Edward Smith, his great-uncle Richard James Lane, a professional artist, and many other family members. Hopkins's first ambitions were to be a painter, and he would continue to sketch throughout his life, inspired, as an adult, by the work of John Ruskin and the Pre-Raphaelites.[http://www.poetryfoundation.org/archive/poet.html?id\n81375 Poetry Foundation Biography] accessed 2010-03-18\n\nHopkins became a skilled draughtsman and found that his early training in visual art supported his later work as a poet. His siblings were greatly inspired by language, religion and the creative arts. Milicent (1849–1946) joined an Anglican sisterhood in 1878. Kate (1856–1933) would go on to help Hopkins publish the first edition of his poetry. Hopkins's youngest sister Grace (1857–1945) set many of his poems to music. Lionel (1854–1952) became a world-famous expert on archaic and colloquial Chinese. Arthur (1848–1930) and Everard (1860–1928) were both highly successful artists. Cyril (1846–1932) would join his father's insurance firm.\n\nManley Hopkins moved his family to Hampstead in 1852, near to where John Keats had lived thirty years before and close to the wide green spaces of Hampstead Heath. When ten years old, Gerard Manley Hopkins was sent to board at Highgate School (1854–1863). While studying Keats's poetry, he wrote \"The Escorial\" (1860), his earliest extant poem. Here he practised early attempts at asceticism. He once argued that most people drank more liquids than they really needed and bet that he could go without drinking for a week. He persisted until his tongue was black and he collapsed at drill. On another occasion, he abstained from salt for a week.Eleanor Ruggles (1944) Gerard Manley Hopkins: A Life. Norton.\n\nOxford and the priesthood\n\nHopkins studied classics at Balliol College, Oxford (1863–67).Gardner, W. H. (1963) Gerard Manly Hopkins: Poems and Prose Penguin pxvii He began his time in Oxford as a keen socialite and prolific poet, but he seemed to have alarmed himself with the changes in his behaviour that resulted. At Oxford he forged a lifelong friendship with Robert Bridges (eventual Poet Laureate of the United Kingdom), which would be of importance in his development as a poet and in establishing his posthumous acclaim. Hopkins was deeply impressed with the work of Christina Rossetti and she became one of his greatest contemporary influences, meeting him in 1864.Gardner, W. H. (1963) Gerard Manley Hopkins: Poems and Prose Penguin pxviii During this time he studied with the eminent writer and critic Walter Pater, who tutored him in 1866 and who remained a friend until Hopkins left Oxford in September 1879.Monsman, Gerald, 'Pater, Hopkins and the self', Victorian Notes, 1974\n\nOn 18 January 1866, Hopkins composed his most ascetic poem, The Habit of Perfection. On 23 January, he included poetry in the list of things to be given up for Lent. In July, he decided to become a Roman Catholic, and he travelled to Birmingham in September to consult the leader of the Oxford converts, John Henry Newman. Newman received him into the Roman Catholic Church on 21 October 1866.\n\nThe decision to convert estranged him from both his family and a number of his acquaintances. After his graduation in 1867, Hopkins was provided by Newman with a teaching post at the Oratory in Birmingham. While there he began to study the violin. On 5 May 1868 Hopkins firmly \"resolved to be a religious.\" Less than a week later, he made a bonfire of his poems and gave up poetry almost entirely for seven years. He also felt the call to enter the ministry and decided to become a Jesuit. He paused to first visit Switzerland, which officially forbade Jesuits to enter.P. Kitchen, Gerard Manley Hopkins, London, 1978.\n\nHopkins began his Jesuit novitiate at Manresa House, Roehampton, in September 1868. Two years later, he moved to St Mary's Hall, Stonyhurst, for his philosophical studies, taking vows of poverty, chastity and obedience on 8 September 1870. He felt his interest in poetry prevented him from wholly devoting himself to religion. However, on reading Duns Scotus in 1872 he saw that the two need not conflict.[http://www.victorianweb.org/authors/hopkins/hopkins12.html Gerard Manley Hopkins: A Brief Biography] Glenn Everett, Ph. D. He continued to write a detailed prose journal between 1868 and 1875. Unable to suppress his desire to describe the natural world, he also wrote music, sketched, and for church occasions wrote some \"verses,\" as he called them. He would later write sermons and other religious pieces.\n\nIn 1874 Hopkins returned to Manresa House to teach classics. While he was studying in the Jesuit house of theological studies, St Beuno's, near St Asaph in North Wales, he was asked by his religious superior to write a poem to commemorate the foundering of a German ship in a storm. So in 1875 he was moved to take up poetry once more and write a lengthy poem, \"The Wreck of the Deutschland\". The work was inspired by the Deutschland incident, a maritime disaster in which 157 people died, including five Franciscan nuns who had been leaving Germany due to harsh anti-Catholic laws (see Kulturkampf). The work displays both the religious concerns and some of the unusual meter and rhythms of his subsequent poetry not present in his few remaining early works. It not only depicts the dramatic events and heroic deeds but also tells of the poet's reconciling the terrible events with God's higher purpose. The poem was accepted but not printed by a Jesuit publication. This rejection fed his ambivalence about his poetry. Most of his poetry remained unpublished until after his death.\n\nHopkins chose the austere and restrictive life of a Jesuit and was at times gloomy. Biographer Robert Bernard Martin notes that \"the life expectancy of a man becoming a novice at twenty-one was twenty-three more years rather than the forty years of males of the same age in the general population.\" The brilliant student who had left Oxford with a first-class honours degree failed his final theology exam. This failure almost certainly meant that, although ordained in 1877, Hopkins would not progress in the order. In 1877 he wrote God’s Grandeur, an array of sonnets which included \"The Starlight Night\". He finished \"The Windhover\" only a few months before his ordination. Though rigorous, isolated and sometimes unpleasant, his life during Jesuit training had at least some stability; the uncertain and varied work after ordination was even harder on his sensibilities. In October 1877, not long after he completed “The Sea and the Skylark” and only a month after he had been ordained as a priest, Hopkins took up his duties as subminister and teacher at Mount St. Mary’s College, Chesterfield. In July 1878 he became curate at the Jesuit church in Mount Street, London. In December he became curate at St. Aloysius’s Church, Oxford, then moving to Manchester, Liverpool and Glasgow. While ministering in Oxford, he became a founding member of Oxford University Newman Society, a society established in 1878 for the Catholic members of Oxford University. He taught Greek and Latin at Mount St Mary's College, Sheffield, and Stonyhurst College, Lancashire.\n\nIn 1884 he became professor of Greek and Latin at University College Dublin.New English key notes 2013 Mentor books Dublin His English roots and his disagreement with the Irish politics of the time, as well as his own small stature (5'2\"), unprepossessing nature and personal oddities meant that he was not a particularly effective teacher. This as well as his isolation in Ireland deepened his gloom. His poems of the time, such as \"I Wake and Feel the Fell of Dark, not Day\", reflected this. They came to be known as the \"terrible sonnets,\" not because of their quality but because according to Hopkins's friend Canon Dixon, they reached the \"terrible crystal,\" meaning that they crystallized the melancholic dejection that plagued the later part of Hopkins' life.\n\nFinal years\n\nSeveral issues brought about this melancholic state and restricted his poetic inspiration during the last five years of his life.Gardner, W. H. (1963) Gerard Manly Hopkins: Poems and Prose Penguin pxxvii His work load was extremely heavy. He disliked living in Dublin, away from England and friends; he was also disappointed at how far the city had fallen from its Georgian elegance of the previous century.http://www.irishtimes.com/culture/books/gerard-manley-hopkins-ucd-misery-was-literature-s-gain-1.3091916 His general health deteriorated as his eyesight began to fail. He felt confined and dejected. As a devout Jesuit, he found himself in an artistic dilemma. To subdue any egotism which would violate the humility required by his religious position, he decided never to publish his poems. But Hopkins realized that any true poet requires an audience for criticism and encouragement. This conflict between his religious obligations and his poetic talent caused him to feel that he had failed them both.\n\nAfter suffering ill health for several years and bouts of diarrhoea, Hopkins died of typhoid fever in 1889 and was buried in Glasnevin Cemetery,Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 (Kindle Location 22019). McFarland & Company, Inc., Publishers. Kindle Edition. following his funeral in Saint Francis Xavier Church on Gardiner Street, located in Georgian Dublin. He is thought to have suffered throughout his life from what today might be diagnosed as either bipolar disorder or chronic unipolar depression, and battled a deep sense of melancholic anguish. However, on his death bed, his last words were, \"I am so happy, I am so happy. I loved my life.\"\n\nPoetry\n\n\"The sonnets of desolation\"\n\nAccording to John Bayley, \"All his life Hopkins was haunted by the sense of personal bankruptcy and impotence, the straining of 'time's eunuch' with no more to 'spend'...\" a sense of inadequacy, graphically expressed in his last sonnets.[http://www.lrb.co.uk/v13/n08/john-bayley/pork-chops Bayley, John. There's a good to fair chance he was a furry do to his love of nature \"Review: Gerard Manley Hopkins: A Very Private Life by Robert Bernard Martin\", London Review of Books, Vol. 13 No. 8, 25 April 1991] Toward the end of his life, Hopkins suffered several long bouts of depression. The \"terrible sonnets\" are a group of poems in which Hopkins struggles with problems of religious doubt. He described them to Bridges as \"[t]he thin gleanings of a long weary while.\"[http://poems.com/Poets'%20Picks%202012/April_24_Debra_Allbery.html Allbery, Debra. \"To seem the stranger lies my lot, my life\", Poetry Daily, April 24, 2012]\n\n\"Thou Art Indeed Just, Lord\" (1889) echoes Jeremiah 12:1 in asking why do the wicked prosper. It reflects the exasperation of the faithful servant who feels he has been neglected, and is addressed to a divine person (\"Sir\") capable of hearing the complaint but seemingly unwilling to listen.[https://www.commonwealmagazine.org/hopkins-agonistes Boudway, Matthew. \"Hopkins Agonistes\", Commonweal, April 25, 2011] Hopkins uses parched roots as a metaphor for despair.\n\nThe image of the poet's feeling estranged from God figures in \"I wake and feel the fell of dark, not day\" in which he describes lying awake before dawn likening his prayers to \"dead letters sent To dearest him that lives alas! away.\" The opening line recalls Lamentations 3:2, \"He hath led me, and brought me into darkness, but not into light.\"\n\n\"No Worst, There is None\" and \"Carrion Comfort\" are also counted among the \"terrible sonnets\".\n\nSprung rhythm\n\nMuch of Hopkins's historical importance has to do with the changes he brought to the form of poetry, which ran contrary to conventional ideas of metre. Prior to Hopkins, most Middle English and Modern English poetry was based on a rhythmic structure inherited from the Norman side of English literary heritage. This structure is based on repeating \"feet\" of two or three syllables, with the stressed syllable falling in the same place on each repetition. Hopkins called this structure \"running rhythm\", and though he wrote some of his early verse in running rhythm he became fascinated with the older rhythmic structure of the Anglo-Saxon tradition, of which Beowulf is the most famous example. Hopkins called his own rhythmic structure sprung rhythm. Sprung rhythm is structured around feet with a variable number of syllables, generally between one and four syllables per foot, with the stress always falling on the first syllable in a foot. It is similar to the \"rolling stresses\" of Robinson Jeffers, another poet who rejected conventional metre. Hopkins saw sprung rhythm as a way to escape the constraints of running rhythm, which he said inevitably pushed poetry written in it to become \"same and tame.\" In this way, Hopkins sprung rhythm can be seen as anticipating much of free verse. His work has no great affinity with either of the contemporary Pre-Raphaelite and neo-romanticism schools, although he does share their descriptive love of nature and he is often seen as a precursor to modernist poetry or as a bridge between the two poetic eras.\n\nUse of language\n\nThe language of Hopkins’s poems is often striking. His imagery can be simple, as in Heaven-Haven, where the comparison is between a nun entering a convent and a ship entering a harbour out of a storm. It can be splendidly metaphysical and intricate, as it is in As Kingfishers Catch Fire, where he leaps from one image to another to show how each thing expresses its own uniqueness, and how divinity reflects itself through all of them.\n\nHopkins was a supporter of linguistic purism in English. In an 1882 letter to Robert Bridges, Hopkins writes: \"It makes one weep to think what English might have been; for in spite of all that Shakespeare and Milton have done [...] no beauty in a language can make up for want of purity\".Nils Langer, Winifred V. Davies. Linguistic purism in the Germanic languages. Walter de Gruyter, 2005. p.328 He took time to learn Old English, which became a major influence on his writing. In the same letter to Bridges he calls Old English \"a vastly superior thing to what we have now\".Brook, George Leslie (1955). An Introduction to Old English, page 1. Manchester University Press.\n\nHe uses many archaic and dialect words, but also coins new words. One example of this is twindles, which seems from its context in Inversnaid to mean a combination of twines and dwindles. He often creates compound adjectives, sometimes with a hyphen (such as dapple-dawn-drawn falcon) but often without, as in rolling level underneath him steady air. This use of compound adjectives, similar to the Old English use of compounds nouns, concentrates his images, communicating the instress of the poet’s perceptions of an inscape to his reader.\n\nAdded richness comes from Hopkins’s extensive use of alliteration, assonance, onomatopoeia and rhyme, both at the end of lines and internally as in:\n\nHopkins was influenced by the Welsh language that he acquired while studying theology at St Beuno's near St Asaph. The poetic forms of Welsh literature and particularly cynghanedd with its emphasis on repeating sounds accorded with his own style and became a prominent feature of his work. This reliance on similar-sounding words with close or differing senses means that his poems are best understood if read aloud. An important element in his work is Hopkins's own concept of \"inscape\" which was derived, in part, from the medieval theologian Duns Scotus. Anthony Domestico explains,Inscape, for Hopkins, is the charged essence, the absolute singularity that gives each created thing its being; instress is both the energy that holds the inscape together and the process by which this inscape is perceived by an observer. We instress the inscape of a tulip, Hopkins would say, when we appreciate the particular delicacy of its petals, when we are enraptured by its specific, inimitable shade of pink.\"\n\nThe Windhover aims to depict not the bird in general but instead one instance and its relation to the breeze. This is just one interpretation of Hopkins's most famous poem, one which he felt was his best.\n\nDuring his lifetime, Hopkins published few poems. It was only through the efforts of Robert Bridges that his works were seen. Despite Hopkins burning all his poems on entering the Jesuit novitiate, he had already sent some to Bridges who, with a few other friends, was one of the few people to see many of them for some years. After Hopkins's death they were distributed to a wider audience, mostly fellow poets, and in 1918 Bridges, by then poet laureate, published a collected edition; an expanded edition, prepared by Charles Williams, appeared in 1930, and a greatly expanded edition by William Henry Gardner appeared in 1948 (eventually reaching a fourth edition, 1967, with N. H. Mackenzie).\n\nNotable collections of Hopkins's manuscripts and publications are in Campion Hall, Oxford; the Bodleian Library, Oxford; and the Foley Library at Gonzaga University in Spokane, Washington.\n\nInfluences\n\nErotic\n\nTimothy d'Arch Smith, antiquarian bookseller, ascribes to Hopkins suppressed erotic impulses which he views as taking on a degree of specificity after Hopkins met Robert Bridges's distant cousin, friend, and fellow Etonian Digby Mackworth Dolben, \"a Christian Uranian\".Timothy d'Arch Smith. Love in Earnest, p. 188) Robert Martin asserts that when Hopkins first met Dolben, on Dolben's 17th birthday, in Oxford in February 1865, it \"was, quite simply, the most momentous emotional event of [his] undergraduate years, probably of his entire life.\"Gerard Manley Hopkins: A Very Private Life, p. 80; see also Norman White, Hopkins: A Literary Biography, p. 110) According to Robert Martin, \"Hopkins was completely taken with Dolben, who was nearly four years his junior, and his private journal for confessions the following year proves how absorbed he was in imperfectly suppressed erotic thoughts of him.\"Robert Bernard Martin, \"Digby Augustus Stewart Dolben,\" DNB) Martin is also of the opinion that \"...it is probable that [Hopkins] would have been deeply shocked at the reality of sexual intimacy with another person.\"[https://books.google.com/books?idhdXg7cVBH8EC&printsec\nfrontcover&dqRobert+Bernard+Martin&hl\nen&saX&ved\n0ahUKEwjF_-ez_NjOAhUHGR4KHV07D0cQ6AEIHDAA#vonepage&q\nRobert%20Bernard%20Martin&f=false Martin, Robert Bernard. Gerard Manley Hopkins: A Very Private Life, Chapter III, Faber and Faber]\n\nHopkins composed two poems about Dolben, \"Where art thou friend\" and \"The Beginning of the End.\" Robert Bridges, who edited the first edition of Dolben's poems as well as Hopkins's, cautioned that the second poem \"must never be printed,\" though Bridges himself included it in the first edition (1918).[http://www.glbtq.com/literature/eng_lit2_19c,5.html Joseph Cady English Literature: Nineteenth Century] Another indication of the nature of his feelings for Dolben is that Hopkins's High Anglican confessor seems to have forbidden him to have any contact with Dolben except by letter. Their relationship was abruptly ended by Dolben's drowning in June 1867, an event which greatly affected Hopkins, although his feeling for Dolben seems to have cooled a good deal by that time. \"Ironically, fate may have bestowed more through Dolben’s death than it could ever have bestowed through longer life ... [for] many of Hopkins’s best poems — impregnated with an elegiac longing for Dolben, his lost beloved and his muse — were the result.\"Kaylor, Michael M. Secreted Desires: The Major Uranians: Hopkins, Pater and Wilde. Brno, CZ: Masaryk University Press, 2006. p. 401 Hopkins' relationship with Dolben is explored in the novel The Hopkins Conundrum.\n\nSome of Hopkins' poems, such as The Bugler's First Communion and Epithalamion, arguably embody homoerotic themes, although this second poem was arranged by Robert Bridges from extant fragments.Notes #72. Poems of Gerard Manley Hopkins; now first published, edited with notes by Robert Bridges. London: Humphrey Milford, 1918. One contemporary literary critic, M.M. Kaylor, has argued for Hopkins's inclusion with the Uranian poets, a group whose writings derived, in many ways, from the prose works of Walter Pater, Hopkins's academic coach for his Greats exams, and later his lifelong friend.\n[https://books.google.com/books?id-Wa7SIsAQgAC&lpg\nPA261&otsGbBv8XavT2&dq\nKaylor's%20Secret%20Desires&pgPA182#v\nonepage&q&f=false The Bugler's First Communion, Kaylor, Secreted Desires. pp 182–93]\n[https://books.google.com/books?id-Wa7SIsAQgAC&lpg\nPA261&otsGbBv8XavT2&dq\nKaylor's%20Secret%20Desires&pgPA161#v\nonepage&q&f=false Epithalamion in Kaylor Secreted Desires, pp 161–205]\nVictorian Poetry 40.2 (2002), pp 157–87\n\nSome critics have argued that homoerotic readings are either highly tendentious, or, that they can be classified under the broader category of \"homosociality,\" over the gender, sexual-specific \"homosexual\" term. Hopkins’s journal writings, they argue, offer a clear admiration for feminized beauty. In his book Hopkins Reconstructed (2000), Justus George Lawler critiques Robert Martin’s controversial biography Gerard Manley Hopkins: A Very Private Life (1991) by suggesting that Martin \"cannot see the heterosexual beam... for the homosexual biographical mote in his own eye... it amounts to a slanted eisegesis\". The poems that elicit homoerotic readings can be read not merely as exercises in sublimation but as powerful renditions of religious conviction, a conviction that caused strain in his family and even led him to burn some of his poems that he felt were unnecessarily self-centred. Julia Saville’s book A Queer Chivalry views the religious imagery in the poems as Hopkins’s way of expressing the tension with homosexual identity and desire.\n\nChristopher Ricks notes that Hopkins engaged in a number of penitential practices, \"...but all of these self-inflictions were not self-inflictions to him, and they are his business—or are his understanding of what it was for him to be about his Father’s business.\" Ricks takes issue with Martin's apparent lack of appreciation of the importance of the role of Hopkins' religious commitment to his writing, and cautions against assigning a priority of influence to any sexual instincts over other factors such as Hopkins' estrangement from his family. Biographer Paul Mariani finds in Hopkins poems \"... an irreconcilable tension—on the one hand, the selflessness demanded by Jesuit discipline; on the other, the seeming self-indulgence of poetic creation.\"[https://www.commonwealmagazine.org/inscape-instress-distress?_ga\n1.190997742.596395981.1472016212 Domestico, Anthony. \"Inscape, Instress & Distress\", Commonweal, March 9, 2009]\n\nIsolation\n\nHopkins spent the last five years of his life as a classics professor at University College Dublin. Hopkins’ isolation in 1885 was multiple: a Jesuit distanced from his Anglican family and his homeland, an Englishman teaching in Dublin during a time of political strife, an unpublished poet striving to reconcile his artistic and religious callings. The poem \"To seem the stranger\" was written in Ireland between 1885-1886, and is a poem of isolation and loneliness.[http://www.poemhunter.com/poem/to-seem-the-stranger-lies-my-lot-my-life/ Hopkins, Gerard M. \"To seem the stranger lies my lot, my life\", Poemhunter.com]\n\nInfluence on others\n\nRicks called Hopkins \"the most original poet of the Victorian age.\"[https://www.newcriterion.com/articles.cfm/The-art-and-faith-of-Gerard-Manley-Hopkins-4424 Ricks, Christopher. \"The art and faith of Gerard Manley Hopkins\", The New Criterion, September 1991] Hopkins is considered as influential as T. S. Eliot in initiating the modern movement in poetry.[https://www.kirkusreviews.com/book-reviews/robert-bernard-martin/gerard-manley-hopkins/ \"Review: Martin, 'A Very Private Life'\", Kirkus Reviews] His experiments with elliptical phrasing and double meanings and quirky conversational rhythms turned out to be liberating to poets such as W. H. Auden and Dylan Thomas.[http://articles.latimes.com/1991-06-18/news/vw-865_1_gerard-manley-hopkins Casey, Constance. \"Book Review : A Very Private Life of a Victorian Poet : Gerard Manley Hopkins: A Very Private Life by Robert Bernard Martin\", The Los Angeles Times, June 18, 1991]\n\nSelected poems\n\nWell-known works by Hopkins include:\n*\"Binsey Poplars\"\n*\"Pied Beauty\"\n*\"The Windhover: To Christ our Lord\"\n*The Wreck of the Deutschland\n\n=",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gerard Manley Hopkins" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12523" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Gerard Manley Hopkins  (28 July 1844 – 8 June 1889) was an English poet, Catholic and Jesuit priest, whose posthumous fame established him among the leading Victorian poets. His manipulation of prosody (particularly his invention of sprung rhythm and use of imagery) established him as an innovative writer of verse. Two of his major themes were nature and religion.\n\nLife\n\nEarly Life and Family \n\nGerard Manley Hopkins was born in Stratford, EssexGardner, W. H. (1963) Gerard Manley Hopkins: Poems and Prose Penguin pxvi (now in Greater London), as the eldest of probably nine children to Manley and Catherine (Smith) Hopkins.Norman White, \"Hopkins, Gerard Manley (1844–1889)\", Oxford Dictionary of National Biography, Oxford University Press. He was christened at the Anglican church of St John's, Stratford. His father founded a marine insurance firm and at one time served as Hawaiian consul-general in London. He was also for a time church warden at St John-at-Hampstead. His grandfather was the physician John Simm Smith, a university colleague of John Keats, and close friend of the eccentric philanthropist Ann Thwaytes.\n\nAs a poet, Hopkins's father published works including A Philosopher's Stone and Other Poems (1843), Pietas Metrica (1849), and Spicelegium Poeticum, A Gathering of Verses by Manley Hopkins (1892). He reviewed poetry for The Times and wrote one novel. Catherine (Smith) Hopkins was the daughter of a London physician, particularly fond of music and of reading, especially German philosophy, literature and the novels of Dickens. Both parents were deeply religious High Church Anglicans. Catherine's sister, Maria Smith Giberne, taught her nephew Gerard to sketch. The interest was supported by his uncle, Edward Smith, his great-uncle Richard James Lane, a professional artist, and many other family members. Hopkins's first ambitions were to be a painter, and he would continue to sketch throughout his life, inspired, as an adult, by the work of John Ruskin and the Pre-Raphaelites.[http://www.poetryfoundation.org/archive/poet.html?id\n81375 Poetry Foundation Biography] accessed 2010-03-18\n\nHopkins became a skilled draughtsman and found that his early training in visual art supported his later work as a poet. His siblings were greatly inspired by language, religion and the creative arts. Milicent (1849–1946) joined an Anglican sisterhood in 1878. Kate (1856–1933) would go on to help Hopkins publish the first edition of his poetry. Hopkins's youngest sister Grace (1857–1945) set many of his poems to music. Lionel (1854–1952) became a world-famous expert on archaic and colloquial Chinese. Arthur (1848–1930) and Everard (1860–1928) were both highly successful artists. Cyril (1846–1932) would join his father's insurance firm.\n\nManley Hopkins moved his family to Hampstead in 1852, near to where John Keats had lived thirty years before and close to the wide green spaces of Hampstead Heath. When ten years old, Gerard Manley Hopkins was sent to board at Highgate School (1854–1863). While studying Keats's poetry, he wrote \"The Escorial\" (1860), his earliest extant poem. Here he practised early attempts at asceticism. He once argued that most people drank more liquids than they really needed and bet that he could go without drinking for a week. He persisted until his tongue was black and he collapsed at drill. On another occasion, he abstained from salt for a week.Eleanor Ruggles (1944) Gerard Manley Hopkins: A Life. Norton.\n\nOxford and the priesthood\n\nHopkins studied classics at Balliol College, Oxford (1863–67).Gardner, W. H. (1963) Gerard Manly Hopkins: Poems and Prose Penguin pxvii He began his time in Oxford as a keen socialite and prolific poet, but he seemed to have alarmed himself with the changes in his behaviour that resulted. At Oxford he forged a lifelong friendship with Robert Bridges (eventual Poet Laureate of the United Kingdom), which would be of importance in his development as a poet and in establishing his posthumous acclaim. Hopkins was deeply impressed with the work of Christina Rossetti and she became one of his greatest contemporary influences, meeting him in 1864.Gardner, W. H. (1963) Gerard Manley Hopkins: Poems and Prose Penguin pxviii During this time he studied with the eminent writer and critic Walter Pater, who tutored him in 1866 and who remained a friend until Hopkins left Oxford in September 1879.Monsman, Gerald, 'Pater, Hopkins and the self', Victorian Notes, 1974\n\nOn 18 January 1866, Hopkins composed his most ascetic poem, The Habit of Perfection. On 23 January, he included poetry in the list of things to be given up for Lent. In July, he decided to become a Roman Catholic, and he travelled to Birmingham in September to consult the leader of the Oxford converts, John Henry Newman. Newman received him into the Roman Catholic Church on 21 October 1866.\n\nThe decision to convert estranged him from both his family and a number of his acquaintances. After his graduation in 1867, Hopkins was provided by Newman with a teaching post at the Oratory in Birmingham. While there he began to study the violin. On 5 May 1868 Hopkins firmly \"resolved to be a religious.\" Less than a week later, he made a bonfire of his poems and gave up poetry almost entirely for seven years. He also felt the call to enter the ministry and decided to become a Jesuit. He paused to first visit Switzerland, which officially forbade Jesuits to enter.P. Kitchen, Gerard Manley Hopkins, London, 1978.\n\nHopkins began his Jesuit novitiate at Manresa House, Roehampton, in September 1868. Two years later, he moved to St Mary's Hall, Stonyhurst, for his philosophical studies, taking vows of poverty, chastity and obedience on 8 September 1870. He felt his interest in poetry prevented him from wholly devoting himself to religion. However, on reading Duns Scotus in 1872 he saw that the two need not conflict.[http://www.victorianweb.org/authors/hopkins/hopkins12.html Gerard Manley Hopkins: A Brief Biography] Glenn Everett, Ph. D. He continued to write a detailed prose journal between 1868 and 1875. Unable to suppress his desire to describe the natural world, he also wrote music, sketched, and for church occasions wrote some \"verses,\" as he called them. He would later write sermons and other religious pieces.\n\nIn 1874 Hopkins returned to Manresa House to teach classics. While he was studying in the Jesuit house of theological studies, St Beuno's, near St Asaph in North Wales, he was asked by his religious superior to write a poem to commemorate the foundering of a German ship in a storm. So in 1875 he was moved to take up poetry once more and write a lengthy poem, \"The Wreck of the Deutschland\". The work was inspired by the Deutschland incident, a maritime disaster in which 157 people died, including five Franciscan nuns who had been leaving Germany due to harsh anti-Catholic laws (see Kulturkampf). The work displays both the religious concerns and some of the unusual meter and rhythms of his subsequent poetry not present in his few remaining early works. It not only depicts the dramatic events and heroic deeds but also tells of the poet's reconciling the terrible events with God's higher purpose. The poem was accepted but not printed by a Jesuit publication. This rejection fed his ambivalence about his poetry. Most of his poetry remained unpublished until after his death.\n\nHopkins chose the austere and restrictive life of a Jesuit and was at times gloomy. Biographer Robert Bernard Martin notes that \"the life expectancy of a man becoming a novice at twenty-one was twenty-three more years rather than the forty years of males of the same age in the general population.\" The brilliant student who had left Oxford with a first-class honours degree failed his final theology exam. This failure almost certainly meant that, although ordained in 1877, Hopkins would not progress in the order. In 1877 he wrote God’s Grandeur, an array of sonnets which included \"The Starlight Night\". He finished \"The Windhover\" only a few months before his ordination. Though rigorous, isolated and sometimes unpleasant, his life during Jesuit training had at least some stability; the uncertain and varied work after ordination was even harder on his sensibilities. In October 1877, not long after he completed “The Sea and the Skylark” and only a month after he had been ordained as a priest, Hopkins took up his duties as subminister and teacher at Mount St. Mary’s College, Chesterfield. In July 1878 he became curate at the Jesuit church in Mount Street, London. In December he became curate at St. Aloysius’s Church, Oxford, then moving to Manchester, Liverpool and Glasgow. While ministering in Oxford, he became a founding member of Oxford University Newman Society, a society established in 1878 for the Catholic members of Oxford University. He taught Greek and Latin at Mount St Mary's College, Sheffield, and Stonyhurst College, Lancashire.\n\nIn 1884 he became professor of Greek and Latin at University College Dublin.New English key notes 2013 Mentor books Dublin His English roots and his disagreement with the Irish politics of the time, as well as his own small stature (5'2\"), unprepossessing nature and personal oddities meant that he was not a particularly effective teacher. This as well as his isolation in Ireland deepened his gloom. His poems of the time, such as \"I Wake and Feel the Fell of Dark, not Day\", reflected this. They came to be known as the \"terrible sonnets,\" not because of their quality but because according to Hopkins's friend Canon Dixon, they reached the \"terrible crystal,\" meaning that they crystallized the melancholic dejection that plagued the later part of Hopkins' life.\n\nFinal years\n\nSeveral issues brought about this melancholic state and restricted his poetic inspiration during the last five years of his life.Gardner, W. H. (1963) Gerard Manly Hopkins: Poems and Prose Penguin pxxvii His work load was extremely heavy. He disliked living in Dublin, away from England and friends; he was also disappointed at how far the city had fallen from its Georgian elegance of the previous century.http://www.irishtimes.com/culture/books/gerard-manley-hopkins-ucd-misery-was-literature-s-gain-1.3091916 His general health deteriorated as his eyesight began to fail. He felt confined and dejected. As a devout Jesuit, he found himself in an artistic dilemma. To subdue any egotism which would violate the humility required by his religious position, he decided never to publish his poems. But Hopkins realized that any true poet requires an audience for criticism and encouragement. This conflict between his religious obligations and his poetic talent caused him to feel that he had failed them both.\n\nAfter suffering ill health for several years and bouts of diarrhoea, Hopkins died of typhoid fever in 1889 and was buried in Glasnevin Cemetery,Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 (Kindle Location 22019). McFarland & Company, Inc., Publishers. Kindle Edition. following his funeral in Saint Francis Xavier Church on Gardiner Street, located in Georgian Dublin. He is thought to have suffered throughout his life from what today might be diagnosed as either bipolar disorder or chronic unipolar depression, and battled a deep sense of melancholic anguish. However, on his death bed, his last words were, \"I am so happy, I am so happy. I loved my life.\"\n\nPoetry\n\n\"The sonnets of desolation\"\n\nAccording to John Bayley, \"All his life Hopkins was haunted by the sense of personal bankruptcy and impotence, the straining of 'time's eunuch' with no more to 'spend'...\" a sense of inadequacy, graphically expressed in his last sonnets.[http://www.lrb.co.uk/v13/n08/john-bayley/pork-chops Bayley, John. There's a good to fair chance he was a furry do to his love of nature \"Review: Gerard Manley Hopkins: A Very Private Life by Robert Bernard Martin\", London Review of Books, Vol. 13 No. 8, 25 April 1991] Toward the end of his life, Hopkins suffered several long bouts of depression. The \"terrible sonnets\" are a group of poems in which Hopkins struggles with problems of religious doubt. He described them to Bridges as \"[t]he thin gleanings of a long weary while.\"[http://poems.com/Poets'%20Picks%202012/April_24_Debra_Allbery.html Allbery, Debra. \"To seem the stranger lies my lot, my life\", Poetry Daily, April 24, 2012]\n\n\"Thou Art Indeed Just, Lord\" (1889) echoes Jeremiah 12:1 in asking why do the wicked prosper. It reflects the exasperation of the faithful servant who feels he has been neglected, and is addressed to a divine person (\"Sir\") capable of hearing the complaint but seemingly unwilling to listen.[https://www.commonwealmagazine.org/hopkins-agonistes Boudway, Matthew. \"Hopkins Agonistes\", Commonweal, April 25, 2011] Hopkins uses parched roots as a metaphor for despair.\n\nThe image of the poet's feeling estranged from God figures in \"I wake and feel the fell of dark, not day\" in which he describes lying awake before dawn likening his prayers to \"dead letters sent To dearest him that lives alas! away.\" The opening line recalls Lamentations 3:2, \"He hath led me, and brought me into darkness, but not into light.\"\n\n\"No Worst, There is None\" and \"Carrion Comfort\" are also counted among the \"terrible sonnets\".\n\nSprung rhythm\n\nMuch of Hopkins's historical importance has to do with the changes he brought to the form of poetry, which ran contrary to conventional ideas of metre. Prior to Hopkins, most Middle English and Modern English poetry was based on a rhythmic structure inherited from the Norman side of English literary heritage. This structure is based on repeating \"feet\" of two or three syllables, with the stressed syllable falling in the same place on each repetition. Hopkins called this structure \"running rhythm\", and though he wrote some of his early verse in running rhythm he became fascinated with the older rhythmic structure of the Anglo-Saxon tradition, of which Beowulf is the most famous example. Hopkins called his own rhythmic structure sprung rhythm. Sprung rhythm is structured around feet with a variable number of syllables, generally between one and four syllables per foot, with the stress always falling on the first syllable in a foot. It is similar to the \"rolling stresses\" of Robinson Jeffers, another poet who rejected conventional metre. Hopkins saw sprung rhythm as a way to escape the constraints of running rhythm, which he said inevitably pushed poetry written in it to become \"same and tame.\" In this way, Hopkins sprung rhythm can be seen as anticipating much of free verse. His work has no great affinity with either of the contemporary Pre-Raphaelite and neo-romanticism schools, although he does share their descriptive love of nature and he is often seen as a precursor to modernist poetry or as a bridge between the two poetic eras.\n\nUse of language\n\nThe language of Hopkins’s poems is often striking. His imagery can be simple, as in Heaven-Haven, where the comparison is between a nun entering a convent and a ship entering a harbour out of a storm. It can be splendidly metaphysical and intricate, as it is in As Kingfishers Catch Fire, where he leaps from one image to another to show how each thing expresses its own uniqueness, and how divinity reflects itself through all of them.\n\nHopkins was a supporter of linguistic purism in English. In an 1882 letter to Robert Bridges, Hopkins writes: \"It makes one weep to think what English might have been; for in spite of all that Shakespeare and Milton have done [...] no beauty in a language can make up for want of purity\".Nils Langer, Winifred V. Davies. Linguistic purism in the Germanic languages. Walter de Gruyter, 2005. p.328 He took time to learn Old English, which became a major influence on his writing. In the same letter to Bridges he calls Old English \"a vastly superior thing to what we have now\".Brook, George Leslie (1955). An Introduction to Old English, page 1. Manchester University Press.\n\nHe uses many archaic and dialect words, but also coins new words. One example of this is twindles, which seems from its context in Inversnaid to mean a combination of twines and dwindles. He often creates compound adjectives, sometimes with a hyphen (such as dapple-dawn-drawn falcon) but often without, as in rolling level underneath him steady air. This use of compound adjectives, similar to the Old English use of compounds nouns, concentrates his images, communicating the instress of the poet’s perceptions of an inscape to his reader.\n\nAdded richness comes from Hopkins’s extensive use of alliteration, assonance, onomatopoeia and rhyme, both at the end of lines and internally as in:\n\nHopkins was influenced by the Welsh language that he acquired while studying theology at St Beuno's near St Asaph. The poetic forms of Welsh literature and particularly cynghanedd with its emphasis on repeating sounds accorded with his own style and became a prominent feature of his work. This reliance on similar-sounding words with close or differing senses means that his poems are best understood if read aloud. An important element in his work is Hopkins's own concept of \"inscape\" which was derived, in part, from the medieval theologian Duns Scotus. Anthony Domestico explains,Inscape, for Hopkins, is the charged essence, the absolute singularity that gives each created thing its being; instress is both the energy that holds the inscape together and the process by which this inscape is perceived by an observer. We instress the inscape of a tulip, Hopkins would say, when we appreciate the particular delicacy of its petals, when we are enraptured by its specific, inimitable shade of pink.\"\n\nThe Windhover aims to depict not the bird in general but instead one instance and its relation to the breeze. This is just one interpretation of Hopkins's most famous poem, one which he felt was his best.\n\nDuring his lifetime, Hopkins published few poems. It was only through the efforts of Robert Bridges that his works were seen. Despite Hopkins burning all his poems on entering the Jesuit novitiate, he had already sent some to Bridges who, with a few other friends, was one of the few people to see many of them for some years. After Hopkins's death they were distributed to a wider audience, mostly fellow poets, and in 1918 Bridges, by then poet laureate, published a collected edition; an expanded edition, prepared by Charles Williams, appeared in 1930, and a greatly expanded edition by William Henry Gardner appeared in 1948 (eventually reaching a fourth edition, 1967, with N. H. Mackenzie).\n\nNotable collections of Hopkins's manuscripts and publications are in Campion Hall, Oxford; the Bodleian Library, Oxford; and the Foley Library at Gonzaga University in Spokane, Washington.\n\nInfluences\n\nErotic\n\nTimothy d'Arch Smith, antiquarian bookseller, ascribes to Hopkins suppressed erotic impulses which he views as taking on a degree of specificity after Hopkins met Robert Bridges's distant cousin, friend, and fellow Etonian Digby Mackworth Dolben, \"a Christian Uranian\".Timothy d'Arch Smith. Love in Earnest, p. 188) Robert Martin asserts that when Hopkins first met Dolben, on Dolben's 17th birthday, in Oxford in February 1865, it \"was, quite simply, the most momentous emotional event of [his] undergraduate years, probably of his entire life.\"Gerard Manley Hopkins: A Very Private Life, p. 80; see also Norman White, Hopkins: A Literary Biography, p. 110) According to Robert Martin, \"Hopkins was completely taken with Dolben, who was nearly four years his junior, and his private journal for confessions the following year proves how absorbed he was in imperfectly suppressed erotic thoughts of him.\"Robert Bernard Martin, \"Digby Augustus Stewart Dolben,\" DNB) Martin is also of the opinion that \"...it is probable that [Hopkins] would have been deeply shocked at the reality of sexual intimacy with another person.\"[https://books.google.com/books?idhdXg7cVBH8EC&printsec\nfrontcover&dqRobert+Bernard+Martin&hl\nen&saX&ved\n0ahUKEwjF_-ez_NjOAhUHGR4KHV07D0cQ6AEIHDAA#vonepage&q\nRobert%20Bernard%20Martin&f=false Martin, Robert Bernard. Gerard Manley Hopkins: A Very Private Life, Chapter III, Faber and Faber]\n\nHopkins composed two poems about Dolben, \"Where art thou friend\" and \"The Beginning of the End.\" Robert Bridges, who edited the first edition of Dolben's poems as well as Hopkins's, cautioned that the second poem \"must never be printed,\" though Bridges himself included it in the first edition (1918).[http://www.glbtq.com/literature/eng_lit2_19c,5.html Joseph Cady English Literature: Nineteenth Century] Another indication of the nature of his feelings for Dolben is that Hopkins's High Anglican confessor seems to have forbidden him to have any contact with Dolben except by letter. Their relationship was abruptly ended by Dolben's drowning in June 1867, an event which greatly affected Hopkins, although his feeling for Dolben seems to have cooled a good deal by that time. \"Ironically, fate may have bestowed more through Dolben’s death than it could ever have bestowed through longer life ... [for] many of Hopkins’s best poems — impregnated with an elegiac longing for Dolben, his lost beloved and his muse — were the result.\"Kaylor, Michael M. Secreted Desires: The Major Uranians: Hopkins, Pater and Wilde. Brno, CZ: Masaryk University Press, 2006. p. 401 Hopkins' relationship with Dolben is explored in the novel The Hopkins Conundrum.\n\nSome of Hopkins' poems, such as The Bugler's First Communion and Epithalamion, arguably embody homoerotic themes, although this second poem was arranged by Robert Bridges from extant fragments.Notes #72. Poems of Gerard Manley Hopkins; now first published, edited with notes by Robert Bridges. London: Humphrey Milford, 1918. One contemporary literary critic, M.M. Kaylor, has argued for Hopkins's inclusion with the Uranian poets, a group whose writings derived, in many ways, from the prose works of Walter Pater, Hopkins's academic coach for his Greats exams, and later his lifelong friend.\n[https://books.google.com/books?id-Wa7SIsAQgAC&lpg\nPA261&otsGbBv8XavT2&dq\nKaylor's%20Secret%20Desires&pgPA182#v\nonepage&q&f=false The Bugler's First Communion, Kaylor, Secreted Desires. pp 182–93]\n[https://books.google.com/books?id-Wa7SIsAQgAC&lpg\nPA261&otsGbBv8XavT2&dq\nKaylor's%20Secret%20Desires&pgPA161#v\nonepage&q&f=false Epithalamion in Kaylor Secreted Desires, pp 161–205]\nVictorian Poetry 40.2 (2002), pp 157–87\n\nSome critics have argued that homoerotic readings are either highly tendentious, or, that they can be classified under the broader category of \"homosociality,\" over the gender, sexual-specific \"homosexual\" term. Hopkins’s journal writings, they argue, offer a clear admiration for feminized beauty. In his book Hopkins Reconstructed (2000), Justus George Lawler critiques Robert Martin’s controversial biography Gerard Manley Hopkins: A Very Private Life (1991) by suggesting that Martin \"cannot see the heterosexual beam... for the homosexual biographical mote in his own eye... it amounts to a slanted eisegesis\". The poems that elicit homoerotic readings can be read not merely as exercises in sublimation but as powerful renditions of religious conviction, a conviction that caused strain in his family and even led him to burn some of his poems that he felt were unnecessarily self-centred. Julia Saville’s book A Queer Chivalry views the religious imagery in the poems as Hopkins’s way of expressing the tension with homosexual identity and desire.\n\nChristopher Ricks notes that Hopkins engaged in a number of penitential practices, \"...but all of these self-inflictions were not self-inflictions to him, and they are his business—or are his understanding of what it was for him to be about his Father’s business.\" Ricks takes issue with Martin's apparent lack of appreciation of the importance of the role of Hopkins' religious commitment to his writing, and cautions against assigning a priority of influence to any sexual instincts over other factors such as Hopkins' estrangement from his family. Biographer Paul Mariani finds in Hopkins poems \"... an irreconcilable tension—on the one hand, the selflessness demanded by Jesuit discipline; on the other, the seeming self-indulgence of poetic creation.\"[https://www.commonwealmagazine.org/inscape-instress-distress?_ga\n1.190997742.596395981.1472016212 Domestico, Anthony. \"Inscape, Instress & Distress\", Commonweal, March 9, 2009]\n\nIsolation\n\nHopkins spent the last five years of his life as a classics professor at University College Dublin. Hopkins’ isolation in 1885 was multiple: a Jesuit distanced from his Anglican family and his homeland, an Englishman teaching in Dublin during a time of political strife, an unpublished poet striving to reconcile his artistic and religious callings. The poem \"To seem the stranger\" was written in Ireland between 1885-1886, and is a poem of isolation and loneliness.[http://www.poemhunter.com/poem/to-seem-the-stranger-lies-my-lot-my-life/ Hopkins, Gerard M. \"To seem the stranger lies my lot, my life\", Poemhunter.com]\n\nInfluence on others\n\nRicks called Hopkins \"the most original poet of the Victorian age.\"[https://www.newcriterion.com/articles.cfm/The-art-and-faith-of-Gerard-Manley-Hopkins-4424 Ricks, Christopher. \"The art and faith of Gerard Manley Hopkins\", The New Criterion, September 1991] Hopkins is considered as influential as T. S. Eliot in initiating the modern movement in poetry.[https://www.kirkusreviews.com/book-reviews/robert-bernard-martin/gerard-manley-hopkins/ \"Review: Martin, 'A Very Private Life'\", Kirkus Reviews] His experiments with elliptical phrasing and double meanings and quirky conversational rhythms turned out to be liberating to poets such as W. H. Auden and Dylan Thomas.[http://articles.latimes.com/1991-06-18/news/vw-865_1_gerard-manley-hopkins Casey, Constance. \"Book Review : A Very Private Life of a Victorian Poet : Gerard Manley Hopkins: A Very Private Life by Robert Bernard Martin\", The Los Angeles Times, June 18, 1991]\n\nSelected poems\n\nWell-known works by Hopkins include:\n*\"Binsey Poplars\"\n*\"Pied Beauty\"\n*\"The Windhover: To Christ our Lord\"\n*The Wreck of the Deutschland\n\n=. Gerard Manley Hopkins. http://en.wikipedia.org/?curid=12523."
  }
}
