{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9402",
  "eid" : "eed0a3e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778480414,
  "textBody" : "The economy of Ethiopia  is a mixed and transition economy with a large public sector. Ethiopian government is in the process of privatizing many of the state-owned businesses and moving toward a market economy. However, the banking, telecommunication and transportation sectors of the economy are dominated by government-owned companies.\n\nEthiopia has one of the fastest-growing economies in the world and is Africa’s second most populous country. Many properties owned by the government during the previous regime have now been  privatized and are in the process of privatization. However, certain sectors such as telecommunications, financial and insurance services, air and land transportation services, and retail, are considered as strategic sectors and are expected to remain under state control for the foreseeable future. Almost 50% of Ethiopia's population is under the age of 18, and even though education enrollment at primary and tertiary level has increased significantly, job creation has not caught up with the increased output from educational institutes. The country must create hundreds of thousands of jobs every year just to keep up with population growth.\n\nThe Ethiopian constitution defines the right to own land as belonging only to \"the state and the people\", but citizens may only lease land (up to 99 years), and are unable to mortgage, sell, or own it. Various groups and political parties have sought for full privatization of land, while other opposition parties are against privatization and favor communal ownership.\n\nThe current government has embarked on a program of economic reform, including privatization of state enterprises and rationalization of government regulation. While the process is still ongoing, the reforms have begun to attract much-needed foreign investment. Despite recent improvements, Ethiopia remains one of the poorest nations in the world.\n\nHistory \n\nThough the issuing of minted coins didn't begin until around 270, metal coins may have been used in Aksum centuries prior to centralized minting. The Periplus of the Erythraean Sea mentions that Aksum imported brass \"which they use[d] for ornaments and for cutting as money\", and that they imported \"a little money (denarion) for [use with] foreigners who live there.\" Some outside influences encouraging the use of coins is undeniable. Roman, Himyarite, and Kushana coins have all been found in major Aksumite cities. The minting of coins began around 270 CE, beginning with the reign of Endubis.\n\nAround the 5th–8th century, the coffee plant was introduced into the Arab world from Ethiopia. Coffea arabica, the most highly regarded species, is native to the southwestern highlands of Ethiopia. Long before the cultivation of coffee, however, other food crops like finger millet, teff, sorghum, lablab bean and castor bean were domesticated and cultivated in Ethiopia.\n\nSectors\n\nAgriculture, forestry and fishing \n\n, agriculture accounts for almost 40.5% of GDP, 81 percent of exports, and 85 percent of the labour force.  Many other economic activities depend on agriculture, including marketing, processing, and export of agricultural products. Production is overwhelmingly of a subsistence nature, and a large part of commodity exports are provided by the small agricultural cash-crop sector. Principal crops include coffee, pulses (e.g., beans), oilseeds, cereals, potatoes, sugarcane, and vegetables.  Exports are almost entirely agricultural commodities, with coffee as the largest foreign exchange earner, and its flower industry becoming a new source of revenue: for 2005/2006 (the latest year available) Ethiopia's coffee exports represented 0.9% of the world exports, and oilseeds and flowers each representing 0.5%.[http://www.imf.org/external/pubs/cat/longres.cfm?sk\n22219.0 \"The Federal Democratic Republic of Ethiopia: Selected Issues Series\"], International Monetary Fund Country Report No. 08/259, pp. 35f (Retrieved 4 February 2009) Ethiopia is Africa's second biggest maize producer. In 2000, Ethiopia's livestock contributed to 19% of total GDP.\n\n, some countries that import most of their food, such as Saudi Arabia, have begun planning the purchase and development of large tracts of arable land in developing countries such as Ethiopia.  This land grabbing has raised fears of food being exported to more prosperous countries while the local population faces its own shortage.\n\nForest products are mainly logs used in construction. The silvicutural properties are used in construction and manufacturing, and as energy sources.\n\nEthiopia's fisheries are entirely fresh water, as it has no marine coastline. Although total production has been continuously increasing since 2007, the fishing industry is a very small part of the economy. Fishing is predominantly artisanal. In 2014, nearly 45,000 fishers were employed in the sector with only 30% of them employed full-time.\n\nMinerals and mining\n\nThe mining sector is small in Ethiopia. The country has deposits of coal, opal, gemstones, kaolin, iron ore, soda ash, and tantalum, but only gold is mined in significant quantities. In 2001 gold production amounted to some 3.4 tons. Salt extraction from salt beds in the Afar Depression, as well as from salt springs in Dire and Afder districts in the south, is only of internal importance and only a negligible amount is exported.\n\nOn 30 August 2012 it was announced that British firm Nyota Minerals was about to become the first foreign company to receive a mining licence to extract gold from an estimated resource of 52 tonnes in western Ethiopia.[https://www.theguardian.com/global-development/2012/aug/30/gold-mining-boost-ethiopia-development   Matthew Newsome, \"Gold mining promises big boost for Ethiopia's development\", The Guardian (30 August 2012)]\n\nEnergy\n\nWaterpower and forests are Ethiopia's main energy sources. The country derives about 90 percent of its electricity needs from hydropower, which means that electricity generation, as with agriculture, is dependent on abundant rainfall. Present installed capacity is rated at about 2000 megawatts, with planned expansion to 10,000 megawatts. In general, Ethiopians rely on forests for nearly all of their energy and construction needs; the result has been deforestation of much of the highlands during the last three decades.\n\nLess than one-half of Ethiopia’s towns and cities are connected to the national grid. Petroleum requirements are met via imports of refined products, although some oil is being hauled overland from Sudan. Oil exploration in Ethiopia has been underway for decades, ever since Emperor Haile Selassie granted a 50-year concession to SOCONY-Vacuum in September 1945.[http://www.time.com/time/magazine/article/0,9171,854515,00.html \"Sinco Places a Bet\"], Time, 17 September 1945 (Retrieved 14 May 2009)\n\nRecent oil and gas discoveries across East Africa have seen the region emerge as a new player in the global oil and gas industry. As exciting as the huge gas fields of East Africa are, however, the strong decline in oil prices and expectations for an L-shaped recovery with low prices over the coming years are increasingly challenging the economic viability of the industry in this region. The reserves are estimated at 4 Tcuft, while exploration for gas and oil is underway in the Gambela Region bordering Sudan.\n\nThe discoveries were expected to drive billions of dollars in annual investment to the region over the next decade. According to BMI estimates, the findings in the last few years are more than that of any other region in the world, and the discoveries are expected to continue for the next few years. However, falling global oil prices are threatening the commercial viability of many of these gas prospects.\n\nManufacturing\n\nThis sector constitutes about 4 percent of the overall economy, although it has shown some growth and diversification in recent years. Much of it is concentrated in Addis Ababa. Food and beverages constitute some 40 percent of the sector, but textiles and leather are also important, the latter especially for the export market. A program to privatize state-owned enterprises has been underway since the late 1990s.[http://lcweb2.loc.gov/frd/cs/profiles/Ethiopia.pdf Ethiopia country profile]. Library of Congress Federal Research Division (April 2005). This article incorporates text from this source, which is in the public domain.\n\nTransport\n\nPrior to the outbreak of the 1998–2000 Eritrean–Ethiopian War, landlocked Ethiopia mainly relied on the seaports of Asseb and Massawa in Eritrea for international trade. , Ethiopia uses the ports of Djibouti, connected to Addis Ababa by the Addis Ababa – Djibouti Railway, and to a lesser extent Port Sudan in Sudan.  In May 2005, the Ethiopian government began negotiations to use the port of Berbera in Somaliland. Of the 23,812 kilometres of Ethiopia's all-weather roads, 15% are asphalt. Mountainous terrain and the lack of good roads and sufficient vehicles make land transportation difficult. However, the government-owned airline, Ethiopian Airlines, is Africa's largest airline. It serves 41 domestic airfields and has 65 international destinations.\n\nTelecommunications\n\nTelecommunications are provided by a state-owned monopoly, Ethio Telecom, formerly the Ethiopian Telecommunications Corporation.\n\nTourism\n\nAside from wholesale and retail trade, transportation, and communications, the services sector consists almost entirely of tourism. Developed in the 1960s, tourism declined greatly during the later 1970s and the 1980s under the military government. Recovery began in the 1990s, but growth has been constrained by the lack of suitable hotels and other infrastructure, despite a boom in construction of small and medium-sized hotels and restaurants, and by the impact of drought, the 1998–2000 war with Eritrea, and the specter of terrorism. In 2002 more than 156,000 tourists entered the country, many of them Ethiopians visiting from abroad, spending more than US$77 million.  In 2008, the number of tourists entering the country had increased to 330,000.\n\nMacroeconomic trends\n\nThe following table displays the trend of Ethiopia's gross domestic product at market prices, according to estimates by the International Monetary Fund with figures in millions of Ethiopian Birr.\n\nThe current GDP (USD) per capital of Ethiopia shrank by 43% in the 1990s.\n\nExternal trade\n\nUntil 2013, the major agricultural export crop was coffee, providing about 26.4% of Ethiopia's foreign exchange earnings. In the beginning of 2014, oilseeds exports have been more important.[http://www.ethiosports.com/2014/06/30/oilseed-overtakes-coffee-as-ethiopias-top-export-earner/ \"Oilseed overtakes coffee as Ethiopia’s top export earner\"] Ethiosports, 2014. (Retrieved 1 July 2014) Coffee is critical to the Ethiopian economy. More than 15 million people (25% of the population) derive their livelihood from the coffee sector.[http://www.luxner.com/cgi-bin/view_article.cgi?articleID=279 \"Ethiopian coffee: The best in the world?\"] African Business, 2001. (Retrieved 24 January 2007)\n\nOther exports include live animals, leather and leather products, chemicals, gold, pulses, oilseeds, flowers, fruits and vegetables and khat (or qat), a leafy shrub which has psychotropic qualities when chewed.\nCross-border trade by pastoralists is often informal and beyond state control and regulation. In East Africa, over 95% of cross-border trade is through unofficial channels and the unofficial trade of live cattle, camels, sheep and goats from Ethiopia sold to Somalia, Kenya and Djibouti generates an estimated total value of between US$250 and US$300 million annually (100 times more than the official figure).Pavanello, Sara 2010. [http://www.odi.org.uk/resources/details.asp?id\n4997&titleworking-across-borders-harnessing-potential-cross-border-activities-improve-livelihood-security-horn-africa-drylands Working across borders - Harnessing the potential of cross-border activities to improve livelihood security in the Horn of Africa drylands]. London: Overseas Development Institute This trade helps lower food prices, increase food security, relieve border tensions and promote regional integration. However, there are also risks as the unregulated and undocumented nature of this trade runs risks, such as allowing disease to spread more easily across national borders. Furthermore, the government of Ethiopia is purportedly unhappy with lost tax revenue and foreign exchange revenues. Recent initiatives have sought to document and regulate this trade.\n\nDependent on a few vulnerable crops for its foreign exchange earnings and reliant on imported oil, Ethiopia lacks sufficient foreign exchange. The financially conservative government has taken measures to solve this problem, including stringent import controls and sharply reduced subsidies on retail gasoline prices. Nevertheless, the largely subsistence economy is incapable of supporting high military expenditures, drought relief, an ambitious development plan, and indispensable imports such as oil; it therefore depends on foreign assistance.\n\nIn December 1999, Ethiopia signed a $1.4 billion joint venture deal with the Malaysian oil company, Petronas, to develop a huge natural gas field in the Somali Region. By the year 2010, however, implementation failed to progress and Petronas sold its share to another oil company.[http://www.upstreamonline.com/live/article231616.ece \"Petronas sells Ethiopian assets to SouthWest\"] Upstream Online news, 6 October 2010. (Retrieved 10 December 2010)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Economy of Ethiopia" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9402" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The economy of Ethiopia  is a mixed and transition economy with a large public sector. Ethiopian government is in the process of privatizing many of the state-owned businesses and moving toward a market economy. However, the banking, telecommunication and transportation sectors of the economy are dominated by government-owned companies.\n\nEthiopia has one of the fastest-growing economies in the world and is Africa’s second most populous country. Many properties owned by the government during the previous regime have now been  privatized and are in the process of privatization. However, certain sectors such as telecommunications, financial and insurance services, air and land transportation services, and retail, are considered as strategic sectors and are expected to remain under state control for the foreseeable future. Almost 50% of Ethiopia's population is under the age of 18, and even though education enrollment at primary and tertiary level has increased significantly, job creation has not caught up with the increased output from educational institutes. The country must create hundreds of thousands of jobs every year just to keep up with population growth.\n\nThe Ethiopian constitution defines the right to own land as belonging only to \"the state and the people\", but citizens may only lease land (up to 99 years), and are unable to mortgage, sell, or own it. Various groups and political parties have sought for full privatization of land, while other opposition parties are against privatization and favor communal ownership.\n\nThe current government has embarked on a program of economic reform, including privatization of state enterprises and rationalization of government regulation. While the process is still ongoing, the reforms have begun to attract much-needed foreign investment. Despite recent improvements, Ethiopia remains one of the poorest nations in the world.\n\nHistory \n\nThough the issuing of minted coins didn't begin until around 270, metal coins may have been used in Aksum centuries prior to centralized minting. The Periplus of the Erythraean Sea mentions that Aksum imported brass \"which they use[d] for ornaments and for cutting as money\", and that they imported \"a little money (denarion) for [use with] foreigners who live there.\" Some outside influences encouraging the use of coins is undeniable. Roman, Himyarite, and Kushana coins have all been found in major Aksumite cities. The minting of coins began around 270 CE, beginning with the reign of Endubis.\n\nAround the 5th–8th century, the coffee plant was introduced into the Arab world from Ethiopia. Coffea arabica, the most highly regarded species, is native to the southwestern highlands of Ethiopia. Long before the cultivation of coffee, however, other food crops like finger millet, teff, sorghum, lablab bean and castor bean were domesticated and cultivated in Ethiopia.\n\nSectors\n\nAgriculture, forestry and fishing \n\n, agriculture accounts for almost 40.5% of GDP, 81 percent of exports, and 85 percent of the labour force.  Many other economic activities depend on agriculture, including marketing, processing, and export of agricultural products. Production is overwhelmingly of a subsistence nature, and a large part of commodity exports are provided by the small agricultural cash-crop sector. Principal crops include coffee, pulses (e.g., beans), oilseeds, cereals, potatoes, sugarcane, and vegetables.  Exports are almost entirely agricultural commodities, with coffee as the largest foreign exchange earner, and its flower industry becoming a new source of revenue: for 2005/2006 (the latest year available) Ethiopia's coffee exports represented 0.9% of the world exports, and oilseeds and flowers each representing 0.5%.[http://www.imf.org/external/pubs/cat/longres.cfm?sk\n22219.0 \"The Federal Democratic Republic of Ethiopia: Selected Issues Series\"], International Monetary Fund Country Report No. 08/259, pp. 35f (Retrieved 4 February 2009) Ethiopia is Africa's second biggest maize producer. In 2000, Ethiopia's livestock contributed to 19% of total GDP.\n\n, some countries that import most of their food, such as Saudi Arabia, have begun planning the purchase and development of large tracts of arable land in developing countries such as Ethiopia.  This land grabbing has raised fears of food being exported to more prosperous countries while the local population faces its own shortage.\n\nForest products are mainly logs used in construction. The silvicutural properties are used in construction and manufacturing, and as energy sources.\n\nEthiopia's fisheries are entirely fresh water, as it has no marine coastline. Although total production has been continuously increasing since 2007, the fishing industry is a very small part of the economy. Fishing is predominantly artisanal. In 2014, nearly 45,000 fishers were employed in the sector with only 30% of them employed full-time.\n\nMinerals and mining\n\nThe mining sector is small in Ethiopia. The country has deposits of coal, opal, gemstones, kaolin, iron ore, soda ash, and tantalum, but only gold is mined in significant quantities. In 2001 gold production amounted to some 3.4 tons. Salt extraction from salt beds in the Afar Depression, as well as from salt springs in Dire and Afder districts in the south, is only of internal importance and only a negligible amount is exported.\n\nOn 30 August 2012 it was announced that British firm Nyota Minerals was about to become the first foreign company to receive a mining licence to extract gold from an estimated resource of 52 tonnes in western Ethiopia.[https://www.theguardian.com/global-development/2012/aug/30/gold-mining-boost-ethiopia-development   Matthew Newsome, \"Gold mining promises big boost for Ethiopia's development\", The Guardian (30 August 2012)]\n\nEnergy\n\nWaterpower and forests are Ethiopia's main energy sources. The country derives about 90 percent of its electricity needs from hydropower, which means that electricity generation, as with agriculture, is dependent on abundant rainfall. Present installed capacity is rated at about 2000 megawatts, with planned expansion to 10,000 megawatts. In general, Ethiopians rely on forests for nearly all of their energy and construction needs; the result has been deforestation of much of the highlands during the last three decades.\n\nLess than one-half of Ethiopia’s towns and cities are connected to the national grid. Petroleum requirements are met via imports of refined products, although some oil is being hauled overland from Sudan. Oil exploration in Ethiopia has been underway for decades, ever since Emperor Haile Selassie granted a 50-year concession to SOCONY-Vacuum in September 1945.[http://www.time.com/time/magazine/article/0,9171,854515,00.html \"Sinco Places a Bet\"], Time, 17 September 1945 (Retrieved 14 May 2009)\n\nRecent oil and gas discoveries across East Africa have seen the region emerge as a new player in the global oil and gas industry. As exciting as the huge gas fields of East Africa are, however, the strong decline in oil prices and expectations for an L-shaped recovery with low prices over the coming years are increasingly challenging the economic viability of the industry in this region. The reserves are estimated at 4 Tcuft, while exploration for gas and oil is underway in the Gambela Region bordering Sudan.\n\nThe discoveries were expected to drive billions of dollars in annual investment to the region over the next decade. According to BMI estimates, the findings in the last few years are more than that of any other region in the world, and the discoveries are expected to continue for the next few years. However, falling global oil prices are threatening the commercial viability of many of these gas prospects.\n\nManufacturing\n\nThis sector constitutes about 4 percent of the overall economy, although it has shown some growth and diversification in recent years. Much of it is concentrated in Addis Ababa. Food and beverages constitute some 40 percent of the sector, but textiles and leather are also important, the latter especially for the export market. A program to privatize state-owned enterprises has been underway since the late 1990s.[http://lcweb2.loc.gov/frd/cs/profiles/Ethiopia.pdf Ethiopia country profile]. Library of Congress Federal Research Division (April 2005). This article incorporates text from this source, which is in the public domain.\n\nTransport\n\nPrior to the outbreak of the 1998–2000 Eritrean–Ethiopian War, landlocked Ethiopia mainly relied on the seaports of Asseb and Massawa in Eritrea for international trade. , Ethiopia uses the ports of Djibouti, connected to Addis Ababa by the Addis Ababa – Djibouti Railway, and to a lesser extent Port Sudan in Sudan.  In May 2005, the Ethiopian government began negotiations to use the port of Berbera in Somaliland. Of the 23,812 kilometres of Ethiopia's all-weather roads, 15% are asphalt. Mountainous terrain and the lack of good roads and sufficient vehicles make land transportation difficult. However, the government-owned airline, Ethiopian Airlines, is Africa's largest airline. It serves 41 domestic airfields and has 65 international destinations.\n\nTelecommunications\n\nTelecommunications are provided by a state-owned monopoly, Ethio Telecom, formerly the Ethiopian Telecommunications Corporation.\n\nTourism\n\nAside from wholesale and retail trade, transportation, and communications, the services sector consists almost entirely of tourism. Developed in the 1960s, tourism declined greatly during the later 1970s and the 1980s under the military government. Recovery began in the 1990s, but growth has been constrained by the lack of suitable hotels and other infrastructure, despite a boom in construction of small and medium-sized hotels and restaurants, and by the impact of drought, the 1998–2000 war with Eritrea, and the specter of terrorism. In 2002 more than 156,000 tourists entered the country, many of them Ethiopians visiting from abroad, spending more than US$77 million.  In 2008, the number of tourists entering the country had increased to 330,000.\n\nMacroeconomic trends\n\nThe following table displays the trend of Ethiopia's gross domestic product at market prices, according to estimates by the International Monetary Fund with figures in millions of Ethiopian Birr.\n\nThe current GDP (USD) per capital of Ethiopia shrank by 43% in the 1990s.\n\nExternal trade\n\nUntil 2013, the major agricultural export crop was coffee, providing about 26.4% of Ethiopia's foreign exchange earnings. In the beginning of 2014, oilseeds exports have been more important.[http://www.ethiosports.com/2014/06/30/oilseed-overtakes-coffee-as-ethiopias-top-export-earner/ \"Oilseed overtakes coffee as Ethiopia’s top export earner\"] Ethiosports, 2014. (Retrieved 1 July 2014) Coffee is critical to the Ethiopian economy. More than 15 million people (25% of the population) derive their livelihood from the coffee sector.[http://www.luxner.com/cgi-bin/view_article.cgi?articleID=279 \"Ethiopian coffee: The best in the world?\"] African Business, 2001. (Retrieved 24 January 2007)\n\nOther exports include live animals, leather and leather products, chemicals, gold, pulses, oilseeds, flowers, fruits and vegetables and khat (or qat), a leafy shrub which has psychotropic qualities when chewed.\nCross-border trade by pastoralists is often informal and beyond state control and regulation. In East Africa, over 95% of cross-border trade is through unofficial channels and the unofficial trade of live cattle, camels, sheep and goats from Ethiopia sold to Somalia, Kenya and Djibouti generates an estimated total value of between US$250 and US$300 million annually (100 times more than the official figure).Pavanello, Sara 2010. [http://www.odi.org.uk/resources/details.asp?id\n4997&titleworking-across-borders-harnessing-potential-cross-border-activities-improve-livelihood-security-horn-africa-drylands Working across borders - Harnessing the potential of cross-border activities to improve livelihood security in the Horn of Africa drylands]. London: Overseas Development Institute This trade helps lower food prices, increase food security, relieve border tensions and promote regional integration. However, there are also risks as the unregulated and undocumented nature of this trade runs risks, such as allowing disease to spread more easily across national borders. Furthermore, the government of Ethiopia is purportedly unhappy with lost tax revenue and foreign exchange revenues. Recent initiatives have sought to document and regulate this trade.\n\nDependent on a few vulnerable crops for its foreign exchange earnings and reliant on imported oil, Ethiopia lacks sufficient foreign exchange. The financially conservative government has taken measures to solve this problem, including stringent import controls and sharply reduced subsidies on retail gasoline prices. Nevertheless, the largely subsistence economy is incapable of supporting high military expenditures, drought relief, an ambitious development plan, and indispensable imports such as oil; it therefore depends on foreign assistance.\n\nIn December 1999, Ethiopia signed a $1.4 billion joint venture deal with the Malaysian oil company, Petronas, to develop a huge natural gas field in the Somali Region. By the year 2010, however, implementation failed to progress and Petronas sold its share to another oil company.[http://www.upstreamonline.com/live/article231616.ece \"Petronas sells Ethiopian assets to SouthWest\"] Upstream Online news, 6 October 2010. (Retrieved 10 December 2010). Economy of Ethiopia. http://en.wikipedia.org/?curid=9402."
  }
}
