{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13435",
  "eid" : "094ce210-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778524849,
  "textBody" : "Hydrology is the scientific study of the movement, distribution, and quality of water on Earth and other planets, including the water cycle, water resources and environmental watershed sustainability. A practitioner of hydrology is a hydrologist, working within the fields of earth or environmental science, physical geography, geology or civil and environmental engineering. Using various analytical methods and scientific techniques, they collect and analyze data to help solve water related problems such as environmental preservation, natural disasters, and water management.\n\nHydrology subdivides into surface water hydrology, groundwater hydrology (hydrogeology), and marine hydrology. Domains of hydrology include hydrometeorology, surface hydrology, hydrogeology,  drainage-basin management and water quality, where water plays the central role.\n\nOceanography and meteorology are not included because water is only one of many important aspects within those fields.\n\nHydrological research can inform environmental engineering, policy and planning.\n\nThe term hydrology comes from Greek: ὕδωρ, hýdōr, \"water\"; and λόγος, lógos, \"study\".\n\nBranches \n\n* Chemical hydrology is the study of the chemical characteristics of water.\n* Ecohydrology is the study of interactions between organisms and the hydrologic cycle.\n* Hydrogeology is the study of the presence and movement of groundwater.\n* Hydroinformatics is the adaptation of information technology to hydrology and water resources applications.\n* Hydrometeorology is the study of the transfer of water and energy between land and water body surfaces and the lower atmosphere.\n* Isotope hydrology is the study of the isotopic signatures of water.\n* Surface hydrology is the study of hydrologic processes that operate at or near Earth's surface.\n* Drainage basin management covers water  storage, in the form of reservoirs, and floods protection.\n* Water quality includes the chemistry of water in rivers and lakes, both of pollutants and natural solutes.\n\nApplications \n\n* Calculation of Rain fall\n* Calculating surface Runoff and precipitation etc.,\n* Determining the water balance of a region.\n* Determining the agricultural water balance.\n* Designing riparian restoration projects.\n* Mitigating and predicting flood, landslide and drought risk.\n* Real-time flood forecasting and flood warning.\n* Designing irrigation schemes and managing agricultural productivity.\n* Part of the hazard module in catastrophe modeling.\n* Providing drinking water.\n* Designing dams for water supply or hydroelectric power generation.\n* Designing bridges.\n* Designing sewers and urban drainage system.\n* Analyzing the impacts of antecedent moisture on sanitary sewer systems.\n* Predicting geomorphologic changes, such as erosion or sedimentation.\n* Assessing the impacts of natural and anthropogenic environmental change on water resources.\n* Assessing contaminant transport risk and establishing environmental policy guidelines.\n*It gives an estimate about water resource potential of the river basin.\n\nHistory \n\nHydrology has been a subject of investigation and engineering for millennia. For example, about 4000 BC the Nile was dammed to improve agricultural productivity of previously barren lands. Mesopotamian towns were protected from flooding with high earthen walls. Aqueducts were built by the Greeks and Ancient Romans, while the history of China shows they built irrigation and flood control works. The ancient Sinhalese used hydrology to build complex irrigation works in Sri Lanka, also known for invention of the Valve Pit which allowed construction of large reservoirs, anicuts and canals which still function.\n\nMarcus Vitruvius, in the first century BC, described a philosophical theory of the hydrologic cycle, in which precipitation falling in the mountains infiltrated the Earth's surface and led to streams and springs in the lowlands. With adoption of a more scientific approach, Leonardo da Vinci and Bernard Palissy independently reached an accurate representation of the hydrologic cycle. It was not until the 17th century that hydrologic variables began to be quantified.\n\nPioneers of the modern science of hydrology include Pierre Perrault, Edme Mariotte and Edmund Halley. By measuring rainfall, runoff, and drainage area, Perrault showed that rainfall was sufficient to account for flow of the Seine. Marriotte combined velocity and river cross-section measurements to obtain discharge, again in the Seine. Halley showed that the evaporation from the Mediterranean Sea was sufficient to account for the outflow of rivers flowing into the sea.\n\nAdvances in the 18th century included the Bernoulli piezometer and Bernoulli's equation, by Daniel Bernoulli, and the Pitot tube, by Henri Pitot. The 19th century saw development in groundwater hydrology, including Darcy's law, the Dupuit-Thiem well formula, and Hagen-Poiseuille's capillary flow equation.\n\nRational analyses began to replace empiricism in the 20th century, while governmental agencies began their own hydrological research programs. Of particular importance were Leroy Sherman's unit hydrograph, the infiltration theory of Robert E. Horton, and C.V. Theis's aquifer test/equation describing well hydraulics.\n\nSince the 1950s, hydrology has been approached with a more theoretical basis than in the past, facilitated by advances in the physical understanding of hydrological processes and by the advent of computers and especially geographic information systems (GIS).\n\nThemes \n\nThe central theme of hydrology is that water circulates throughout the Earth through different pathways and at different rates. The most vivid image of this is in the evaporation of water from the ocean, which forms clouds. These clouds drift over the land and produce rain. The rainwater flows into lakes, rivers, or aquifers. The water in lakes, rivers, and aquifers then either evaporates back to the atmosphere or eventually flows back to the ocean, completing a cycle. Water changes its state of being several times throughout this cycle.\n\nThe areas of research within hydrology concern the movement of water between its various states, or within a given state, or simply quantifying the amounts in these states in a given region. Parts of hydrology concern developing methods for directly measuring these flows or amounts of water, while others concern modelling these processes either for scientific knowledge or for making prediction in practical applications.\n\nGroundwater \n\nGround water is water beneath Earth's surface, often pumped for drinking water. Groundwater hydrology (hydrogeology) considers quantifying groundwater flow and solute transport.[http://onlinelibrary.wiley.com/store/10.1029/2008WR007278/asset/wrcr11958.pdf;jsessionid\nED4B48069EF55A2DBBDF8037376180CD.f02t03?v1&t\nj25bxqnu&s79f6fef7c4ee98e74d164649da4edfb808b27490]  Problems in describing the saturated zone include the characterization of aquifers in terms of flow direction, groundwater pressure and, by inference, groundwater depth (see: aquifer test). Measurements here can be made using a piezometer. Aquifers are also described in terms of hydraulic conductivity, storativity and transmissivity. There are a number of geophysical methods for characterising aquifers. There are also problems in characterising the vadose zone (unsaturated zone).\n\nInfiltration \n\nInfiltration is the process by which water enters the soil. Some of the water is absorbed, and the rest percolates down to the water table. The infiltration capacity, the maximum rate at which the soil can absorb water, depends on several factors. The layer that is already saturated provides a resistance that is proportional to its thickness, while that plus the depth of water above the soil provides the driving force (hydraulic head). Dry soil can allow rapid infiltration by capillary action; this force diminishes as the soil becomes wet. Compaction reduces the porosity and the pore sizes. Surface cover increases capacity by retarding runoff, reducing compaction and other processes. Higher temperatures reduce viscosity, increasing infiltration.\n\nSoil moisture \n\nSoil moisture can be measured in various ways; by capacitance probe, time domain reflectometer or Tensiometer. Other methods include solute sampling and geophysical methods.\n\nSurface water flow \n\nHydrology considers quantifying surface water flow and solute transport, although the treatment of flows in large rivers is sometimes considered as a distinct topic of hydraulics or hydrodynamics. Surface water flow can include flow both in recognizable river channels and otherwise. Methods for measuring flow once water has reached a river include the stream gauge (see: discharge), and tracer techniques. Other topics include chemical transport as part of surface water, sediment transport and erosion.\n\nOne of the important areas of hydrology is the interchange between rivers and aquifers. Groundwater/surface water interactions in streams and aquifers can be complex and the direction of net water flux (into surface water or into the aquifer) may vary spatially along a stream channel and over time at any particular location, depending on the relationship between stream stage and groundwater levels.\n\nPrecipitation and evaporation \n\nIn some considerations, hydrology is thought of as starting at the land-atmosphere boundary and so it is important to have adequate knowledge of both precipitation and evaporation. Precipitation can be measured in various ways: disdrometer for precipitation characteristics at a fine time scale; radar for cloud properties, rain rate estimation, hail and snow detection; rain gauge for routine accurate measurements of rain and snowfall; satellite for rainy area identification, rain rate estimation, land-cover/land-use, and soil moisture, for example.\n\nEvaporation is an important part of the water cycle. It is partly affected by humidity, which can be measured by a sling psychrometer. It is also affected by the presence of snow, hail and ice and can relate to dew, mist and fog. Hydrology considers evaporation of various forms: from water surfaces; as transpiration\nfrom plant surfaces in natural and agronomic ecosystems. A direct measurement of evaporation can be obtained using Simon's evaporation pan.\n\nDetailed studies of evaporation involve boundary layer considerations as well as momentum, heat flux and energy budgets.\n\nRemote sensing \n\nRemote sensing of hydrologic processes can provide information on locations where in situ sensors may be unavailable or sparse. It also enables observations over large spatial extents. Many of the variables constituting the terrestrial water balance, for example surface water storage, soil moisture, precipitation, evapotranspiration, and snow and ice, are measurable using remote sensing at various spatial-temporal resolutions and accuracies. Sources of remote sensing include land-based sensors, airborne sensors and satellite sensors which can capture microwave, thermal and near-infrared data or use lidar, for example.\n\nWater quality \n\nIn hydrology, studies of water quality concern organic and inorganic compounds, and both dissolved and sediment material. In addition, water quality is affected by the interaction of dissolved oxygen with organic material and various chemical transformations that may take place. Measurements of water quality may involve either in-situ methods, in which analyses take place on-site, often automatically, and laboratory-based analyses and may include microbiological analysis.\n\nIntegrating measurement and modelling \n\n* Budget analyses\n* Parameter estimation\n* Scaling in time and space\n* Data assimilation\n* Quality control of data – see for example Double mass analysis\n\nPrediction \n\nObservations of hydrologic processes are used to make predictions of the future behaviour of hydrologic systems (water flow, water quality). One of the major current concerns in hydrologic research is \"Prediction in Ungauged Basins\" (PUB), i.e. in basins where no or only very few data exist.\n\nStatistical hydrology \n\nBy analyzing the statistical properties of hydrologic records, such as rainfall or river flow, hydrologists can estimate future hydrologic phenomena. When making assessments of how often relatively rare events will occur, analyses are made in terms of the return period of such events. Other quantities of interest include the average flow in a river, in a year or by season.\n\nThese estimates are important for engineers and economists so that proper risk analysis can be performed to influence investment decisions in future infrastructure and to determine the yield reliability characteristics of water supply systems. Statistical information is utilized to formulate operating rules for large dams forming part of systems which include agricultural, industrial and residential demands.\n\nModeling \n\nHydrological models are simplified, conceptual representations of a part of the hydrologic cycle. They are primarily used for hydrological prediction and for understanding hydrological processes, within the general field of scientific modeling. Two major types of hydrological models can be distinguished:\n* Models based on data. These models are black box systems, using mathematical and statistical concepts to link a certain input (for instance rainfall) to the model output (for instance runoff). Commonly used techniques are regression, transfer functions, and system identification. The simplest of these models may be linear models, but it is common to deploy non-linear components to represent some general aspects of a catchment's response without going deeply into the real physical processes involved. An example of such an aspect is the well-known behavior that a catchment will respond much more quickly and strongly when it is already wet than when it is dry..\n* Models based on process descriptions. These models try to represent the physical processes observed in the real world. Typically, such models contain representations of surface runoff, subsurface flow, evapotranspiration, and channel flow, but they can be far more complicated. These models are known as deterministic hydrology models. Deterministic hydrology models can be subdivided into single-event models and continuous simulation models.\n\nRecent research in hydrological modeling tries to have a more global approach to the understanding of the behavior of hydrologic systems to make better predictions and to face the major challenges in water resources management.\n\nTransport \n\nWater movement is a significant means by which other material, such as soil, gravel, boulders or pollutants, are transported from place to place. Initial input to receiving waters may arise from a point source discharge or a line source or area source, such as surface runoff. Since the 1960s rather complex mathematical models have been developed, facilitated by the availability of high speed computers. The most common pollutant classes analyzed are nutrients, pesticides, total dissolved solids and sediment.\n\nOrganizations \n\nIntergovernmental organizations \n\n* International Hydrological Programme (IHP)\n\nInternational research bodies \n\n* International Water Management Institute (IWMI)\n* UNESCO-IHE Institute for Water Education\n\nNational research bodies \n\n* Centre for Ecology and Hydrology – UK\n* Centre for Water Science, Cranfield University, UK\n* eawag – aquatic research, ETH Zürich, Switzerland\n* Institute of Hydrology, Albert-Ludwigs-University of Freiburg, Germany\n* United States Geological Survey – Water Resources of the United States\n* NOAA's National Weather Service – Office of Hydrologic Development, USA\n* US Army Corps of Engineers Hydrologic Engineering Center, USA\n* Hydrologic Research Center, USA\n* NOAA Economics and Social Sciences, USA\n* University of Oklahoma Center for Natural Hazards and Disasters Research, USA\n* National Hydrology Research Centre, Canada\n* National Institute of Hydrology, India\n\nNational and international societies \n\n* Geological Society of America (GSA) – Hydrogeology Division\n* American Geophysical Union (AGU) – Hydrology Section\n* National Ground Water Association (NGWA)\n* American Water Resources Association\n* Consortium of Universities for the Advancement of Hydrologic Science, Inc. (CUAHSI)\n* International Association of Hydrological Sciences (IAHS)\n* Statistics in Hydrology Working Group (subgroup of IAHS)\n* German Hydrological Society (DHG: Deutsche Hydrologische Gesellschaft)[http://www.dhydrog.de/ Deutsche Hydrologische Gesellschaft], accessed 2 September 2013\n* Italian Hydrological Society (SII-IHS) – http://www.sii-ihs.it\n* Nordic Association for Hydrology[http://nhf-hydrology.org/ Nordic Association for Hydrology], accessed 2 September 2013\n* British Hydrological Society\n* Russian Geographical Society (Moscow Center) – Hydrology Commission\n* International Association for Environmental Hydrology\n* International Association of Hydrogeologists\n* [http://soham.org.np/ Society of Hydrologists and Meteorologists - Nepal] \n\nBasin- and catchment-wide overviews \n\n* Connected Waters Initiative, University of New South Wales – Investigating and raising awareness of groundwater and water resource issues in Australia\n* Murray Darling Basin Initiative, Department of Environment and Heritage, Australia\n\nResearch journals \n\n* Hydrological Processes,  (electronic) 0885-6087 (paper), John Wiley & Sons\n* Hydrology Research, , IWA Publishing  (formerly Nordic Hydrology)\n* Journal of Hydroinformatics, , IWA Publishing\n* Journal of Hydrologic Engineering, , ASCE Publication\n* Journal of Hydrology\n* Water Research\n* Water Resources Research\n* Hydrological Sciences Journal - Journal of the International Association of Hydrological Sciences (IAHS)  (Print),  (Online)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hydrology" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13435" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hydrology is the scientific study of the movement, distribution, and quality of water on Earth and other planets, including the water cycle, water resources and environmental watershed sustainability. A practitioner of hydrology is a hydrologist, working within the fields of earth or environmental science, physical geography, geology or civil and environmental engineering. Using various analytical methods and scientific techniques, they collect and analyze data to help solve water related problems such as environmental preservation, natural disasters, and water management.\n\nHydrology subdivides into surface water hydrology, groundwater hydrology (hydrogeology), and marine hydrology. Domains of hydrology include hydrometeorology, surface hydrology, hydrogeology,  drainage-basin management and water quality, where water plays the central role.\n\nOceanography and meteorology are not included because water is only one of many important aspects within those fields.\n\nHydrological research can inform environmental engineering, policy and planning.\n\nThe term hydrology comes from Greek: ὕδωρ, hýdōr, \"water\"; and λόγος, lógos, \"study\".\n\nBranches \n\n* Chemical hydrology is the study of the chemical characteristics of water.\n* Ecohydrology is the study of interactions between organisms and the hydrologic cycle.\n* Hydrogeology is the study of the presence and movement of groundwater.\n* Hydroinformatics is the adaptation of information technology to hydrology and water resources applications.\n* Hydrometeorology is the study of the transfer of water and energy between land and water body surfaces and the lower atmosphere.\n* Isotope hydrology is the study of the isotopic signatures of water.\n* Surface hydrology is the study of hydrologic processes that operate at or near Earth's surface.\n* Drainage basin management covers water  storage, in the form of reservoirs, and floods protection.\n* Water quality includes the chemistry of water in rivers and lakes, both of pollutants and natural solutes.\n\nApplications \n\n* Calculation of Rain fall\n* Calculating surface Runoff and precipitation etc.,\n* Determining the water balance of a region.\n* Determining the agricultural water balance.\n* Designing riparian restoration projects.\n* Mitigating and predicting flood, landslide and drought risk.\n* Real-time flood forecasting and flood warning.\n* Designing irrigation schemes and managing agricultural productivity.\n* Part of the hazard module in catastrophe modeling.\n* Providing drinking water.\n* Designing dams for water supply or hydroelectric power generation.\n* Designing bridges.\n* Designing sewers and urban drainage system.\n* Analyzing the impacts of antecedent moisture on sanitary sewer systems.\n* Predicting geomorphologic changes, such as erosion or sedimentation.\n* Assessing the impacts of natural and anthropogenic environmental change on water resources.\n* Assessing contaminant transport risk and establishing environmental policy guidelines.\n*It gives an estimate about water resource potential of the river basin.\n\nHistory \n\nHydrology has been a subject of investigation and engineering for millennia. For example, about 4000 BC the Nile was dammed to improve agricultural productivity of previously barren lands. Mesopotamian towns were protected from flooding with high earthen walls. Aqueducts were built by the Greeks and Ancient Romans, while the history of China shows they built irrigation and flood control works. The ancient Sinhalese used hydrology to build complex irrigation works in Sri Lanka, also known for invention of the Valve Pit which allowed construction of large reservoirs, anicuts and canals which still function.\n\nMarcus Vitruvius, in the first century BC, described a philosophical theory of the hydrologic cycle, in which precipitation falling in the mountains infiltrated the Earth's surface and led to streams and springs in the lowlands. With adoption of a more scientific approach, Leonardo da Vinci and Bernard Palissy independently reached an accurate representation of the hydrologic cycle. It was not until the 17th century that hydrologic variables began to be quantified.\n\nPioneers of the modern science of hydrology include Pierre Perrault, Edme Mariotte and Edmund Halley. By measuring rainfall, runoff, and drainage area, Perrault showed that rainfall was sufficient to account for flow of the Seine. Marriotte combined velocity and river cross-section measurements to obtain discharge, again in the Seine. Halley showed that the evaporation from the Mediterranean Sea was sufficient to account for the outflow of rivers flowing into the sea.\n\nAdvances in the 18th century included the Bernoulli piezometer and Bernoulli's equation, by Daniel Bernoulli, and the Pitot tube, by Henri Pitot. The 19th century saw development in groundwater hydrology, including Darcy's law, the Dupuit-Thiem well formula, and Hagen-Poiseuille's capillary flow equation.\n\nRational analyses began to replace empiricism in the 20th century, while governmental agencies began their own hydrological research programs. Of particular importance were Leroy Sherman's unit hydrograph, the infiltration theory of Robert E. Horton, and C.V. Theis's aquifer test/equation describing well hydraulics.\n\nSince the 1950s, hydrology has been approached with a more theoretical basis than in the past, facilitated by advances in the physical understanding of hydrological processes and by the advent of computers and especially geographic information systems (GIS).\n\nThemes \n\nThe central theme of hydrology is that water circulates throughout the Earth through different pathways and at different rates. The most vivid image of this is in the evaporation of water from the ocean, which forms clouds. These clouds drift over the land and produce rain. The rainwater flows into lakes, rivers, or aquifers. The water in lakes, rivers, and aquifers then either evaporates back to the atmosphere or eventually flows back to the ocean, completing a cycle. Water changes its state of being several times throughout this cycle.\n\nThe areas of research within hydrology concern the movement of water between its various states, or within a given state, or simply quantifying the amounts in these states in a given region. Parts of hydrology concern developing methods for directly measuring these flows or amounts of water, while others concern modelling these processes either for scientific knowledge or for making prediction in practical applications.\n\nGroundwater \n\nGround water is water beneath Earth's surface, often pumped for drinking water. Groundwater hydrology (hydrogeology) considers quantifying groundwater flow and solute transport.[http://onlinelibrary.wiley.com/store/10.1029/2008WR007278/asset/wrcr11958.pdf;jsessionid\nED4B48069EF55A2DBBDF8037376180CD.f02t03?v1&t\nj25bxqnu&s79f6fef7c4ee98e74d164649da4edfb808b27490]  Problems in describing the saturated zone include the characterization of aquifers in terms of flow direction, groundwater pressure and, by inference, groundwater depth (see: aquifer test). Measurements here can be made using a piezometer. Aquifers are also described in terms of hydraulic conductivity, storativity and transmissivity. There are a number of geophysical methods for characterising aquifers. There are also problems in characterising the vadose zone (unsaturated zone).\n\nInfiltration \n\nInfiltration is the process by which water enters the soil. Some of the water is absorbed, and the rest percolates down to the water table. The infiltration capacity, the maximum rate at which the soil can absorb water, depends on several factors. The layer that is already saturated provides a resistance that is proportional to its thickness, while that plus the depth of water above the soil provides the driving force (hydraulic head). Dry soil can allow rapid infiltration by capillary action; this force diminishes as the soil becomes wet. Compaction reduces the porosity and the pore sizes. Surface cover increases capacity by retarding runoff, reducing compaction and other processes. Higher temperatures reduce viscosity, increasing infiltration.\n\nSoil moisture \n\nSoil moisture can be measured in various ways; by capacitance probe, time domain reflectometer or Tensiometer. Other methods include solute sampling and geophysical methods.\n\nSurface water flow \n\nHydrology considers quantifying surface water flow and solute transport, although the treatment of flows in large rivers is sometimes considered as a distinct topic of hydraulics or hydrodynamics. Surface water flow can include flow both in recognizable river channels and otherwise. Methods for measuring flow once water has reached a river include the stream gauge (see: discharge), and tracer techniques. Other topics include chemical transport as part of surface water, sediment transport and erosion.\n\nOne of the important areas of hydrology is the interchange between rivers and aquifers. Groundwater/surface water interactions in streams and aquifers can be complex and the direction of net water flux (into surface water or into the aquifer) may vary spatially along a stream channel and over time at any particular location, depending on the relationship between stream stage and groundwater levels.\n\nPrecipitation and evaporation \n\nIn some considerations, hydrology is thought of as starting at the land-atmosphere boundary and so it is important to have adequate knowledge of both precipitation and evaporation. Precipitation can be measured in various ways: disdrometer for precipitation characteristics at a fine time scale; radar for cloud properties, rain rate estimation, hail and snow detection; rain gauge for routine accurate measurements of rain and snowfall; satellite for rainy area identification, rain rate estimation, land-cover/land-use, and soil moisture, for example.\n\nEvaporation is an important part of the water cycle. It is partly affected by humidity, which can be measured by a sling psychrometer. It is also affected by the presence of snow, hail and ice and can relate to dew, mist and fog. Hydrology considers evaporation of various forms: from water surfaces; as transpiration\nfrom plant surfaces in natural and agronomic ecosystems. A direct measurement of evaporation can be obtained using Simon's evaporation pan.\n\nDetailed studies of evaporation involve boundary layer considerations as well as momentum, heat flux and energy budgets.\n\nRemote sensing \n\nRemote sensing of hydrologic processes can provide information on locations where in situ sensors may be unavailable or sparse. It also enables observations over large spatial extents. Many of the variables constituting the terrestrial water balance, for example surface water storage, soil moisture, precipitation, evapotranspiration, and snow and ice, are measurable using remote sensing at various spatial-temporal resolutions and accuracies. Sources of remote sensing include land-based sensors, airborne sensors and satellite sensors which can capture microwave, thermal and near-infrared data or use lidar, for example.\n\nWater quality \n\nIn hydrology, studies of water quality concern organic and inorganic compounds, and both dissolved and sediment material. In addition, water quality is affected by the interaction of dissolved oxygen with organic material and various chemical transformations that may take place. Measurements of water quality may involve either in-situ methods, in which analyses take place on-site, often automatically, and laboratory-based analyses and may include microbiological analysis.\n\nIntegrating measurement and modelling \n\n* Budget analyses\n* Parameter estimation\n* Scaling in time and space\n* Data assimilation\n* Quality control of data – see for example Double mass analysis\n\nPrediction \n\nObservations of hydrologic processes are used to make predictions of the future behaviour of hydrologic systems (water flow, water quality). One of the major current concerns in hydrologic research is \"Prediction in Ungauged Basins\" (PUB), i.e. in basins where no or only very few data exist.\n\nStatistical hydrology \n\nBy analyzing the statistical properties of hydrologic records, such as rainfall or river flow, hydrologists can estimate future hydrologic phenomena. When making assessments of how often relatively rare events will occur, analyses are made in terms of the return period of such events. Other quantities of interest include the average flow in a river, in a year or by season.\n\nThese estimates are important for engineers and economists so that proper risk analysis can be performed to influence investment decisions in future infrastructure and to determine the yield reliability characteristics of water supply systems. Statistical information is utilized to formulate operating rules for large dams forming part of systems which include agricultural, industrial and residential demands.\n\nModeling \n\nHydrological models are simplified, conceptual representations of a part of the hydrologic cycle. They are primarily used for hydrological prediction and for understanding hydrological processes, within the general field of scientific modeling. Two major types of hydrological models can be distinguished:\n* Models based on data. These models are black box systems, using mathematical and statistical concepts to link a certain input (for instance rainfall) to the model output (for instance runoff). Commonly used techniques are regression, transfer functions, and system identification. The simplest of these models may be linear models, but it is common to deploy non-linear components to represent some general aspects of a catchment's response without going deeply into the real physical processes involved. An example of such an aspect is the well-known behavior that a catchment will respond much more quickly and strongly when it is already wet than when it is dry..\n* Models based on process descriptions. These models try to represent the physical processes observed in the real world. Typically, such models contain representations of surface runoff, subsurface flow, evapotranspiration, and channel flow, but they can be far more complicated. These models are known as deterministic hydrology models. Deterministic hydrology models can be subdivided into single-event models and continuous simulation models.\n\nRecent research in hydrological modeling tries to have a more global approach to the understanding of the behavior of hydrologic systems to make better predictions and to face the major challenges in water resources management.\n\nTransport \n\nWater movement is a significant means by which other material, such as soil, gravel, boulders or pollutants, are transported from place to place. Initial input to receiving waters may arise from a point source discharge or a line source or area source, such as surface runoff. Since the 1960s rather complex mathematical models have been developed, facilitated by the availability of high speed computers. The most common pollutant classes analyzed are nutrients, pesticides, total dissolved solids and sediment.\n\nOrganizations \n\nIntergovernmental organizations \n\n* International Hydrological Programme (IHP)\n\nInternational research bodies \n\n* International Water Management Institute (IWMI)\n* UNESCO-IHE Institute for Water Education\n\nNational research bodies \n\n* Centre for Ecology and Hydrology – UK\n* Centre for Water Science, Cranfield University, UK\n* eawag – aquatic research, ETH Zürich, Switzerland\n* Institute of Hydrology, Albert-Ludwigs-University of Freiburg, Germany\n* United States Geological Survey – Water Resources of the United States\n* NOAA's National Weather Service – Office of Hydrologic Development, USA\n* US Army Corps of Engineers Hydrologic Engineering Center, USA\n* Hydrologic Research Center, USA\n* NOAA Economics and Social Sciences, USA\n* University of Oklahoma Center for Natural Hazards and Disasters Research, USA\n* National Hydrology Research Centre, Canada\n* National Institute of Hydrology, India\n\nNational and international societies \n\n* Geological Society of America (GSA) – Hydrogeology Division\n* American Geophysical Union (AGU) – Hydrology Section\n* National Ground Water Association (NGWA)\n* American Water Resources Association\n* Consortium of Universities for the Advancement of Hydrologic Science, Inc. (CUAHSI)\n* International Association of Hydrological Sciences (IAHS)\n* Statistics in Hydrology Working Group (subgroup of IAHS)\n* German Hydrological Society (DHG: Deutsche Hydrologische Gesellschaft)[http://www.dhydrog.de/ Deutsche Hydrologische Gesellschaft], accessed 2 September 2013\n* Italian Hydrological Society (SII-IHS) – http://www.sii-ihs.it\n* Nordic Association for Hydrology[http://nhf-hydrology.org/ Nordic Association for Hydrology], accessed 2 September 2013\n* British Hydrological Society\n* Russian Geographical Society (Moscow Center) – Hydrology Commission\n* International Association for Environmental Hydrology\n* International Association of Hydrogeologists\n* [http://soham.org.np/ Society of Hydrologists and Meteorologists - Nepal] \n\nBasin- and catchment-wide overviews \n\n* Connected Waters Initiative, University of New South Wales – Investigating and raising awareness of groundwater and water resource issues in Australia\n* Murray Darling Basin Initiative, Department of Environment and Heritage, Australia\n\nResearch journals \n\n* Hydrological Processes,  (electronic) 0885-6087 (paper), John Wiley & Sons\n* Hydrology Research, , IWA Publishing  (formerly Nordic Hydrology)\n* Journal of Hydroinformatics, , IWA Publishing\n* Journal of Hydrologic Engineering, , ASCE Publication\n* Journal of Hydrology\n* Water Research\n* Water Resources Research\n* Hydrological Sciences Journal - Journal of the International Association of Hydrological Sciences (IAHS)  (Print),  (Online). Hydrology. http://en.wikipedia.org/?curid=13435."
  }
}
