{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16294",
  "eid" : "254befb0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778571819,
  "textBody" : "Mirza Nur-ud-din Beig Mohammad Khan Salim, known by his imperial name Jahangir (31 August 1569 – 28 October 1627),https://global.britannica.com/biography/Jahangir was the fourth Mughal Emperor who ruled from 1605 until his death in 1627. Much romance has gathered around his name (in Persian, Jahangir means 'conqueror of the world', 'world-conqueror' or 'world-seizer'; Jahan world, gir the root of the Persian verb gereftan, gireftan \n to seize, to grab), and the tale of his relationship with the Mughal courtesan, Anarkali, has been widely adapted into the literature, art and cinema of India.\n\nEarly life\n\nPrince Salim, later Jahangir, was born on 31st August 1569 (17 Rabī‘u-l-awwal 977 AH), in Fatehpur Sikri, to Akbar and Jodha Bai. Akbar’s previous children had died in infancy and he had sought the help of holy men to produce a son. Salim was named for one such man, Sheikh Salim, though Akbar always called him Sheikhu Baba.\n\nPrince Salim forcefully succeeded to the throne on Thursday, 21st Jumadi II, 1014 AH/ November 3, 1605, eight days after his father's death emerging victorious in the vicious struggle for succession between the five prominent and legitimate sons. Salim ascended to the throne with the title of Nur-ud-din Muhammad Jahangir Badshah Ghazi and thus began his 22-year reign at the age of 36. Jahangir soon after had to fend off his own son, Prince Khusrau Mirza, when the latter attempted to claim the throne based on Akbar's will to become his next heirs. Khusrau Mirza was defeated in 1606 and confined in the fort of Agra. As punishment Khusrau Mirza was handed over to his younger brother.he was partually blinded and died or killed in his brothers custody.\n\nJahangir considered his third son Prince Khurram (future Shah Jahan), his favourite. In 1622, Khurram murdered his blinded elder brother Khusrau Mirza in order to smooth his own path to the throne.\n\nRana of Mewar and Prince Khurram had a standoff that resulted in a treaty acceptable to both parties. Khurram was kept busy with several campaigns in Bengal and Kashmir. Jahangir claimed the victories of Khurram – Shah Jahan as his own.\n\nReign\n\nAn aesthete, Jahangir decided to start his reign with a grand display of \"Justice\", as he saw it. To this end, he enacted Twelve Decrees that are remarkable for their liberalism and foresight. During his reign, there was a significant increase in the size of the Mughal Empire, half a dozen rebellions were crushed, prisoners of war were released and the work of his father, Akbar, continued to flourish. Much like his father, Jahangir was dedicated to the expansion of Mughal held territory through conquest. During this regime he would target the peoples of Assam near the eastern frontier and bring a series of territories controlled by independent rajas in the Himalayan foothills from Kashmir to Bengal. Jahangir would challenge the hegemonic claim over what became later Afghanistan by the Safavid rulers with an eye on Kabul, Peshawar and Kandahar, which were important centres of the central Asian trade system that northern India operated within. In 1622, Jahangir sent his son Prince Khurram against the combined forces of Ahmednagar, Bijapur and Golconda. After his victory Khurram turned against his father and make a bid for power. As with the insurrection of his eldest son [Khusrau Mirza], Jahangir was able to defeat the challenge from within his family and retain power.https://www.britannica.com/biography/Jahangir\nJahangir promised to protect Islam and granted general amnesty to his opponents. He was also notable for his patronage of the arts, especially of painting. During his reign the distinctive style of Mughal painting expanded and blossomed. Jahangir supported a flourishing culture of court painters.\n\nFurthermore, Jahangir preserved the Mughal tradition of a highly centralised form of government. Jahangir made the precepts of Sunni Islam the cornerstone of his state policies. A faithful Muslim, as evidenced by his memoirs, he expressed his gratitude to Allah for his many victories. Jahangir, as a devout Muslim, did not let his personal beliefs dictate his state policies. Sovereignty, according to Jahangir, was a \"gift of God\" not necessarily given to enforce God's law but rather to \"ensure the contentment of the world.\" In civil cases, Islamic law applied to Muslims, Hindu law applied to Hindus, while criminal law was the same for both Muslims and Hindus. In matters like marriage and inheritance, both communities had their own laws that Jahangir respected. Thus Jahangir was able to deliver justice to people in accordance of their beliefs and also keep his hold on empire by unified criminal law. In the Mughal state, therefore, defiance of imperial authority, whether coming from a prince or anyone else aspiring to political power, or a Muslim or a Hindu, was crushed in the name of law and order.\n\nForeign relations\n\nIn 1623, the Mughal Emperor Jahangir, sent his Tahwildar, Khan Alam, to Safavid Persia, accompanied by 800 Sepoys, scribes and scholars along with ten Howdahs well decorated in gold and silver, in order to negotiate peace with Abbas I of Persia after a brief conflict in the region around Kandahar. Khan Alam soon returned with valuable gifts and groups of Mir Shikar(Hunt Masters) from both Safavid Persia and even the Khanates of Central Asia.\n\nIn 1626, Jahangir began to contemplate an alliance between the Ottomans, Mughals and Uzbeks against the Safavids, who had defeated the Mughals at Kandahar. He even wrote a letter to the Ottoman Sultan Murad IV. Jahangir's ambition did not materialise, however, due to his death in 1627.\n\nMarriage\n\nSalim was made a Mansabdar of ten thousand (Das-Hazari), the highest military rank of the empire, after the emperor. He independently commanded a regiment in the Kabul campaign of 1581, when he was barely twelve. His Mansab was raised to Twelve Thousand, in 1585, at the time of his betrothal to his cousin Rajkumari Manbhawati Bai, daughter of Bhagwant Das of Amer. Bhagwant Das, was the son of Raja Bihari Mal and the brother of Akbar's Hindu wife and Salim's mother - Jodha Bai.\n\nThe marriage with Manbhawati Bai took place on February 13, 1585. Jahangir named her Shah Begum, and gave birth to Khusrau Mirza. Thereafter, Salim married, in quick succession, a number of accomplished girls from the aristocratic Mughal and Rajput families. One of his early favourite wives was a Rajput Princess, Jagat Gosain Begum. Jahangir named her Taj Bibi Bilqis Makani and she gave birth to Prince Khurram, the future Shah Jahan, Jahangir's successor to the throne.\n\nOn July 7, 1586 he married a daughter of Raja Rai Singh, Maharaja of Bikaner. In July 1586, he married Malika Shikar Begum, daughter of Sultan Abu Said Khan Jagatai, Sultan of Kashghar. In 1586, he married Sahib-i-Jamal Begum, daughter of Khwaja Hassan, of Herat, a cousin of Zain Khan Koka. In 1587, he married Malika Jahan Begum, daughter of Bhim Singh, Maharaja of Jaisalmer. He also married a daughter of Raja Darya Malbhas. In October 1590, he married Zohra Begum, daughter of Mirza Sanjar Hazara. In 1591, he married Karamnasi Begum, daughter of Raja Kesho Das Rathore, of Mertia. On January 11, 1592, he married Kanwal Rani, daughter of Ali Sher Khan, by his wife, Gul Khatun. In October 1592, he married a daughter of Husain Chak, of Kashmir. In January/March 1593, he married Nur un-nisa Begum, daughter of Ibrahim Husain Mirza, by his wife, Gulrukh Begum, daughter of Kamran Mirza. In September 1593, he married a daughter of Ali Khan Faruqi, Raja of Khandesh. He also married a daughter of Abdullah Khan Baluch. On June 28, 1596, he married Khas Mahal Begum, daughter of Zain Khan Koka, sometime Subadar of Kabul and Lahore. In 1608, he married Saliha Banu Begum, daughter of Qasim Khan, a senior member of the Imperial Household. On June 17, 1608, he married Koka Kumari Begum, eldest daughter of Jagat Singh, Yuvraj of Amber.\n\nJahangir married the extremely beautiful and intelligent Mehr-un-Nisaa (better known by her subsequent title of Nur Jahan) on May 25, 1611. She was the widow of Sher Afgan. Mehr-un-Nisaa became his indisputable chief consort and favourite wife immediately after their marriage. She was witty, intelligent and beautiful, which was what attracted Jahangir to her. Before being awarded the title of Nur Jahan('Light of the World'), she was called Nur Mahal('Light of the Palace'). Her abilities are said to range from fashion designing to hunting. There is also a myth that she had once killed four tigers with six bullets.\n\nNur Jahan\n\nMehr-Un-Nisa, or Nur Jahan, occupies an important place in the history of Jahangir. She was the widow of a rebel officer, Sher Afgan, whose actual name was Ali Quli Beg Ist'ajlu. He had earned the title \"Sher Afgan\" (Tiger tosser) from Emperor Akbar after throwing off a tiger that had leaped to attack Akbar on the top of an elephant in a royal hunt at Bengal and then stabbing the fallen tiger to death. Akbar was greatly affected by the bravery of the young Turkish bodyguard accompanying him and awarded him the captaincy of the Imperial Guard at Bengal. He was killed in rebellion, after learning of Jahangir's orders to have him slain to possess his beautiful wife, as Jahangir yearned for her much earlier than her wedding. The governor of Bengal was instructed secretly by Jahangir in his quest and was also the emperor's foster brother and Sheikh Salim's grandson and was consequently slain by the guards of the Governor. The widowed Mehr-Un-Nisa was brought to Agra along with her nine-year-old daughter and placed in—or refused to be placed in—the Royal harem in 1607. Jahangir married her in 1611 and gave her the title of Nur Jahan or \"Light of the World\". It was rumoured that Jahangir had a hand in the death of her first husband, albeit there is no recorded evidence to prove that he was guilty of that crime; in fact most travellers' reports say that he met her after her husband's death. (See Ellison biography for a full discussion.)\n\nThe loss of Kandahar was due to Prince Khurram's refusal to obey her orders. When the Persians besieged Kandahar, Nur Jahan was at the helm of affairs. She ordered Prince Khurram to march for Kandahar, but the latter refused to do so. There is no doubt that the refusal of the prince was due to her behaviour towards him, as she was favouring her son-in-law, Shahryar, at the expense of Khurram. Khurram suspected that in his absence, Shahryar might be given promotion and that he might die on the battlefield. This fear forced Khurram to rebel against his father rather than fight against the Persians, and thereby Kandahar was lost.\n\nUnder Jahangir, the empire continued to be a war state attuned to conquest and expansion. Jahangir's most irksome foe was the Rana of Mewar, Amar Singh, who finally capitulated in 1613 to Khurram's forces. In the northeast, the Mughals clashed with the Ahoms of Assam, whose guerilla tactics gave the Mughals a hard time. In Northern India, Jahangir's forces under Khurram defeated their other principal adversary, the Raja of Kangra, in 1615; in the Deccan, his victories further consolidated the empire. But in 1620, Jahangir fell sick, and so ensued the familiar quest for power. Nur Jahan married her daughter to Shahryar, Jahangir's youngest son from his other queen, in the hope of having a living male heir to the throne when Jahangir died.\n\nConquests\n\nIn the year 1594, Jahangir was dispatched by his father, the Mughal Emperor Akbar, alongside Abul Hasan Asaf Khan, also known as Mirza Jaafar Beg son of Mirza Ghias Beg Isfahani and brother of Nur Jehan, and Abu'l-Fazl ibn Mubarak, to defeat the renegade Vir Singh Deo of Bundela and capture the city of Orchha, which was considered the centre of the revolt. Jahangir arrived with a force of 12,000 after many ferocious encounters and finally subdued the Bundela and ordered Vir Singh Deo to surrender. After tremendous casualties and the start of negotiations between the two, Vir Singh Deo handed over 5000 Bundela infantry and 1000 cavalry, but he feared Mughal retaliation and remained a fugitive until his death. The victorious Jahangir, only 16 years of age, ordered the completion of the Jahangir Mahal a famous Mughal citadel in Orchha to commemorate and honour his victory.\n\nJahangir then gathered his forces under the command of Ali Kuli Khan and fought Lakshmi Narayan of Koch Bihar. Lakshmi Narayan then accepted the Mughals as his suzerains he was given the title Nazir and later established a garrison at Atharokotha.\n\nIn 1613,From Plassey to Partition: A History of Modern India, p.[https://books.google.com/books?id0oVra0ulQ3QC&pg\nPA37 37], Orient Blackswan, Śekhara Bandyopādhyāẏa  the Portuguese seized the Mughal ship Rahimi, which had set out from Surat on its way with a large cargo of 100,000 rupees and Pilgrims, who were on their way to Mecca and Medina in order to attend the annual Hajj. The Rahimi was owned by Mariam-uz-zamani, Akbar's Christian wife of Portuguese descent. She was referred to as Queen mother of Hindustan during his reign. Rahimi was the largest Indian ship sailing in the Red Sea and was known to the Europeans as the \"great pilgrimage ship\". When the Portuguese officially refused to return the ship and the passengers, the outcry at the Mughal court was unusually severe. The outrage was compounded by the fact that the owner and the patron of the ship was none other than the revered mother of the current emperor. Jahangir himself was outraged and ordered the seizure of the Portuguese town Daman. He ordered the apprehension of all Portuguese within the Mughal Empire; he further confiscated churches that belonged to the Jesuits. This episode is considered to be an example of the struggle for wealth that would later ensue and lead to colonisation of the Indian sub-continent.\n\nJahangir was responsible for ending a century long struggle with the state of Mewar. The campaign against the Rajputs was pushed so extensively that they were made to submit with great loss of life and property.\n\nJahangir posted Islam Khan I to subdue Musa Khan, an Afghan rebel in Bengal, in 1608. Jahangir also thought of capturing Kangra Fort, which Akbar had failed to do in 1615. Consequently, a siege was laid and the fort was taken in 1620, which \"resulted in the submission of the Raja of Chamba who was the greatest of all the rajas in the region.\" The district of Kistwar, in the state of Kashmir, was also conquered.\n\nDeath\n\nJahangir was trying to restore his health by visiting Kashmir and Kabul. He went from Kabul to Kashmir but decided to return to Lahore on account of a severe cold.\n\nJahangir died on the way back from Kashmir near Sarai Saadabad in 1627. To preserve his body, the entrails were removed and buried in the Baghsar Fort, Kashmir. The body was then transferred to Lahore to be buried in Shahdara Bagh, a suburb of Lahore, Punjab. He was succeeded by his third son, Prince Khurram, who took the title of Shah Jahan. Jahangir's elegant mausoleum is located in the Shahdara locale of Lahore and is a popular tourist attraction.\n\nReligion\n\nSir Thomas Roe was England's first ambassador to the Mughal court. Relations with England turned tense in 1617 when Roe warned the Jahangir that if the young and charismatic Prince Shah Jahan, newly instated as the Subedar of Gujarat, had turned the English out of the province, \"then he must expect we would do our justice upon the seas\". Shah Jahan chose to seal an official Firman allowing the English to trade in Gujarat in the year 1618.\n\nMany contemporary chroniclers were not sure quite how to describe Jahangir's personal belief structure. Roe labelled him an atheist, and although most others shied away from that term, they did not feel as though they could call him an orthodox Sunni. Roe believed Jahangir's religion to be of his own making, \"for he envies [the Prophet] Mohammed, and wisely sees no reason why he should not bee as great a prophet as he and therefore professed himself so... he hath found many disciples that flatter or follow him.\" At this time, one of those disciples happened to be the current English ambassador, though his initiation into Jahangir's inner circle was devoid of religious significance for Roe, as he did not understand the full extent of what he was doing: Jahangir hung \"a picture of him self set in gold hanging at a wire gold chain\" round Roe's neck. Roe thought it \"an especial favour, for that all the great men that wear the Kings image (which none may do but to whom it is given) receive no other than a medal of gold as big as six pence.\"\n\nHad Roe intentionally converted, it would have caused quite a scandal in London. But since there was no intent, there was no resultant problem. Such disciples were an elite group of imperial servants, with one of them being promoted to Chief Justice. However, it is not clear that any of those who became disciples renounced their previous religion, so it is probable to see this as a way in which the emperor strengthened the bond between himself and his nobles. Despite Roe's somewhat casual use of the term 'atheist', he could not quite put his finger on Jahangir's real beliefs. Roe lamented that the emperor was either \"the most impossible man in the world to be converted, or the most easy; for he loves to hear, and hath so little religion yet, that he can well abide to have any derided.\"\n\nThis should not imply that the multi-confessional state appealed to all, or that all Muslims were happy with the situation in India. In a book written on statecraft for Jahangir, the author advised him to direct \"all his energies to understanding the counsel of the sages and to comprehending the intimations of the 'ulama.\" At the start of his regime many staunch Sunnis were hopeful, because he seemed less tolerant to other faiths than his father had been. At the time of his accession and the elimination of Abu'l Fazl, his father's chief minister and architect of his eclectic religious stance, a powerful group of orthodox noblemen had gained increased power in the Mughal court. Jahangir did not always benevolently regard some Hindu customs and rituals. On visiting a Hindu temple, he found a statue of a man with a pig's head (more than likely actually a boar's head, a representation of Varaha), one of the idols in the Hindu religion, so he \"ordered them to break that hideous form and throw it in the tank.\" If the Tuzuk is reliable on this subject (and there is no reason to suspect that it is not), then this was an isolated case.\n\nJ.F. Richards argues that \"Jahangir seems to have been persistently hostile to popularly venerated religious figures\", which is debatable. A Muslim saint, Hazrat Mujadid Alif Sani Imam e Rabbani Sheikh Ahmed Sirhindi Al-Farooqi, who had gained large number of followers through his spiritual preaching, was imprisoned in Gwalior Fort.\n\nMost notorious was the execution of the Sikh Guru Arjan Dev Ji, whom Jahangir had got killed in prison. His lands were confiscated and his sons imprisoned as Jahangir suspected him of helping Khusrau's rebellion. It is unclear whether Jahangir even understood what a Sikh was, referring to Guru Arjan as a Hindu, who had \"captured many of the simple-hearted of the Hindus and even of the ignorant and foolish followers of Islam, by his ways and manners... for three or four generations (of spiritual successors) they had kept this shop warm.\" The trigger for Guru Arjan's execution was his support for Jahangir's rebel son Khusrau Mirza, yet it is clear from Jahangir's own memoirs that he disliked Guru Arjan before then: \"many times it occurred to me to put a stop to this vain affair or bring him into the assembly of the people of Islam.\"\n\nMuqarrab Khan sent to Jahangir \"a European curtain (tapestry) the like of which in beauty no other work of the Frank [European] painters has ever been seen.\" One of his audience halls was \"adorned with European screens.\" Christian themes attracted Jahangir, and even merited a mention in the Tuzuk. One of his slaves gave him a piece of ivory into which had been carved four scenes. In the last scene \"there is a tree, below which the figure of the revered (hazrat) Jesus is shown. One person has placed his head at Jesus' feet, and an old man is conversing with Jesus and four others are standing by.\" Though Jahangir believed it to be the work of the slave who presented it to him, Sayyid Ahmad and Henry Beveridge suggest that it was of European origin and possibly showed the Transfiguration. Wherever it came from, and whatever it represented, it was clear that a European style had come to influence Mughal art, otherwise the slave would not have claimed it as his own design, nor would he have been believed by Jahangir.\n\nArt\n\nJahangir was fascinated with art and architecture. Jahangir himself is far from modest in his autobiography when he states his prowess at being able to determine the artist of any portrait by simply looking at a painting. He also preserved paintings of Emperor Akbar's period. An excellent example of this is the painting of Musician Naubat Khan, son in law of legendary Tansen. It was the work of Ustad Mansur.\nAs he said:\n\nJahangir took his connoisseurship of art very seriously. Paintings created under his reign were closely catalogued, dated and even signed, providing scholars with fairly accurate ideas as to when and in what context many of the pieces were created, in addition to their aesthetic qualities.\n\nThe Jesuits had brought with them various books, engravings, and paintings and, when they saw the delight Akbar held for them, sent for more and more of the same to be given to the Mughals, as they felt they were on the \"verge of conversion\", a notion which proved to be very false. Instead, both Akbar and Jahangir studied this artwork very closely and replicated and adapted it, adopting much of the early iconographic features and later the pictorial realism for which Renaissance art was known. Jahangir was notable for his pride in the ability of his court painters. A classic example of this is described in Sir Thomas Roe's diaries, in which the Emperor had his painters copy a European miniature several times creating a total of five miniatures. Jahangir then challenged Roe to pick out the original from the copies, a feat Sir Thomas Roe could not do, to the delight of Jahangir.\n\nJahangir was also revolutionary in his adaptation of European styles. A collection at the British Museum in London contains seventy-four drawings of Indian portraits dating from the time of Jahangir, including a portrait of the emperor himself. These portraits are a unique example of art during Jahangir's reign because before and for sometime after, faces were not drawn full, head-on and including the shoulders as well as the head as these drawings are.\n\nCriticism\n\nJahangir is widely considered to have been a weak and incapable ruler. Orientalist Henry Beveridge (editor of the Tuzk-e-Jahangiri) compares Jahangir to the Roman emperor Claudius, for both were \"weak men... in their wrong places as rulers... [and had] Jahangir been head of a Natural History Museum,... [he] would have been [a] better and happier man.\" Sir William Hawkins who visited Jahangir's court in 1609, said: \"In such short that what this man's father, called Ecber Padasha [Padshah Akbar], got of the Deccans, this king, Selim Sha [Jahangir] beginneth to lose.\" Italian writer and traveller, Niccolao Manucci, who worked under Jahangir's grandson, Dara Shikoh, began his discussion about Jahangir by saying: \"It is a truth tested by experience that sons dissipate what their fathers gained in the sweat of their brow.\"\n\nAccording to John F Richards, Jahangir's frequent withdrawal to a private sphere of life was partly reflective of Jhangir's indolence, brought on by his addiction to a considerable daily dosage of wine and opium.\n\nIn media\n\n* In the 1939 Hindi film Pukar, Jehangir was portrayed by Chandra Mohan.\n* In the 1953 Hindi film Anarkali, he was portrayed by Pradeep Kumar.\n* In the 1955 Telugu film Anarkali,he was portrayed by ANR\n* In the 1960 Hindi film Mughal-e-Azam, he was portrayed by Dilip Kumar. Jalal Agha also played the younger Jahangir at the start of the film.\n* In the 1966 Malyalam film Anarkali (1966 film), he was portrayed by Prem Nazir.\n* In the 1979 Telugu film Akbar Salim Anarkali,he was portrayed by Balakrishna\n* In the 1988 Shyam Benegal's TV Series Bharat Ek Khoj, he was portrayed by Vijay Arora\n* In the 2000 TV series Noorjahan, he was portrayed by Milnd Soman.\n* In the 2013 Ekta Kapoor's TV Series Jodha Akbar, he was portrayed by Ravi Bhatia. Ayaan Zubair Rahmani also played young Salim initially.\n* In the 2014 Indu Sudaresan's TV Series Siyaasat, he was portrayed by Karanvir Sharma and Later Sudhanshu Pandey.\n\nWorks online\n\n* \n*",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jahangir" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16294" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Mirza Nur-ud-din Beig Mohammad Khan Salim, known by his imperial name Jahangir (31 August 1569 – 28 October 1627),https://global.britannica.com/biography/Jahangir was the fourth Mughal Emperor who ruled from 1605 until his death in 1627. Much romance has gathered around his name (in Persian, Jahangir means 'conqueror of the world', 'world-conqueror' or 'world-seizer'; Jahan world, gir the root of the Persian verb gereftan, gireftan \n to seize, to grab), and the tale of his relationship with the Mughal courtesan, Anarkali, has been widely adapted into the literature, art and cinema of India.\n\nEarly life\n\nPrince Salim, later Jahangir, was born on 31st August 1569 (17 Rabī‘u-l-awwal 977 AH), in Fatehpur Sikri, to Akbar and Jodha Bai. Akbar’s previous children had died in infancy and he had sought the help of holy men to produce a son. Salim was named for one such man, Sheikh Salim, though Akbar always called him Sheikhu Baba.\n\nPrince Salim forcefully succeeded to the throne on Thursday, 21st Jumadi II, 1014 AH/ November 3, 1605, eight days after his father's death emerging victorious in the vicious struggle for succession between the five prominent and legitimate sons. Salim ascended to the throne with the title of Nur-ud-din Muhammad Jahangir Badshah Ghazi and thus began his 22-year reign at the age of 36. Jahangir soon after had to fend off his own son, Prince Khusrau Mirza, when the latter attempted to claim the throne based on Akbar's will to become his next heirs. Khusrau Mirza was defeated in 1606 and confined in the fort of Agra. As punishment Khusrau Mirza was handed over to his younger brother.he was partually blinded and died or killed in his brothers custody.\n\nJahangir considered his third son Prince Khurram (future Shah Jahan), his favourite. In 1622, Khurram murdered his blinded elder brother Khusrau Mirza in order to smooth his own path to the throne.\n\nRana of Mewar and Prince Khurram had a standoff that resulted in a treaty acceptable to both parties. Khurram was kept busy with several campaigns in Bengal and Kashmir. Jahangir claimed the victories of Khurram – Shah Jahan as his own.\n\nReign\n\nAn aesthete, Jahangir decided to start his reign with a grand display of \"Justice\", as he saw it. To this end, he enacted Twelve Decrees that are remarkable for their liberalism and foresight. During his reign, there was a significant increase in the size of the Mughal Empire, half a dozen rebellions were crushed, prisoners of war were released and the work of his father, Akbar, continued to flourish. Much like his father, Jahangir was dedicated to the expansion of Mughal held territory through conquest. During this regime he would target the peoples of Assam near the eastern frontier and bring a series of territories controlled by independent rajas in the Himalayan foothills from Kashmir to Bengal. Jahangir would challenge the hegemonic claim over what became later Afghanistan by the Safavid rulers with an eye on Kabul, Peshawar and Kandahar, which were important centres of the central Asian trade system that northern India operated within. In 1622, Jahangir sent his son Prince Khurram against the combined forces of Ahmednagar, Bijapur and Golconda. After his victory Khurram turned against his father and make a bid for power. As with the insurrection of his eldest son [Khusrau Mirza], Jahangir was able to defeat the challenge from within his family and retain power.https://www.britannica.com/biography/Jahangir\nJahangir promised to protect Islam and granted general amnesty to his opponents. He was also notable for his patronage of the arts, especially of painting. During his reign the distinctive style of Mughal painting expanded and blossomed. Jahangir supported a flourishing culture of court painters.\n\nFurthermore, Jahangir preserved the Mughal tradition of a highly centralised form of government. Jahangir made the precepts of Sunni Islam the cornerstone of his state policies. A faithful Muslim, as evidenced by his memoirs, he expressed his gratitude to Allah for his many victories. Jahangir, as a devout Muslim, did not let his personal beliefs dictate his state policies. Sovereignty, according to Jahangir, was a \"gift of God\" not necessarily given to enforce God's law but rather to \"ensure the contentment of the world.\" In civil cases, Islamic law applied to Muslims, Hindu law applied to Hindus, while criminal law was the same for both Muslims and Hindus. In matters like marriage and inheritance, both communities had their own laws that Jahangir respected. Thus Jahangir was able to deliver justice to people in accordance of their beliefs and also keep his hold on empire by unified criminal law. In the Mughal state, therefore, defiance of imperial authority, whether coming from a prince or anyone else aspiring to political power, or a Muslim or a Hindu, was crushed in the name of law and order.\n\nForeign relations\n\nIn 1623, the Mughal Emperor Jahangir, sent his Tahwildar, Khan Alam, to Safavid Persia, accompanied by 800 Sepoys, scribes and scholars along with ten Howdahs well decorated in gold and silver, in order to negotiate peace with Abbas I of Persia after a brief conflict in the region around Kandahar. Khan Alam soon returned with valuable gifts and groups of Mir Shikar(Hunt Masters) from both Safavid Persia and even the Khanates of Central Asia.\n\nIn 1626, Jahangir began to contemplate an alliance between the Ottomans, Mughals and Uzbeks against the Safavids, who had defeated the Mughals at Kandahar. He even wrote a letter to the Ottoman Sultan Murad IV. Jahangir's ambition did not materialise, however, due to his death in 1627.\n\nMarriage\n\nSalim was made a Mansabdar of ten thousand (Das-Hazari), the highest military rank of the empire, after the emperor. He independently commanded a regiment in the Kabul campaign of 1581, when he was barely twelve. His Mansab was raised to Twelve Thousand, in 1585, at the time of his betrothal to his cousin Rajkumari Manbhawati Bai, daughter of Bhagwant Das of Amer. Bhagwant Das, was the son of Raja Bihari Mal and the brother of Akbar's Hindu wife and Salim's mother - Jodha Bai.\n\nThe marriage with Manbhawati Bai took place on February 13, 1585. Jahangir named her Shah Begum, and gave birth to Khusrau Mirza. Thereafter, Salim married, in quick succession, a number of accomplished girls from the aristocratic Mughal and Rajput families. One of his early favourite wives was a Rajput Princess, Jagat Gosain Begum. Jahangir named her Taj Bibi Bilqis Makani and she gave birth to Prince Khurram, the future Shah Jahan, Jahangir's successor to the throne.\n\nOn July 7, 1586 he married a daughter of Raja Rai Singh, Maharaja of Bikaner. In July 1586, he married Malika Shikar Begum, daughter of Sultan Abu Said Khan Jagatai, Sultan of Kashghar. In 1586, he married Sahib-i-Jamal Begum, daughter of Khwaja Hassan, of Herat, a cousin of Zain Khan Koka. In 1587, he married Malika Jahan Begum, daughter of Bhim Singh, Maharaja of Jaisalmer. He also married a daughter of Raja Darya Malbhas. In October 1590, he married Zohra Begum, daughter of Mirza Sanjar Hazara. In 1591, he married Karamnasi Begum, daughter of Raja Kesho Das Rathore, of Mertia. On January 11, 1592, he married Kanwal Rani, daughter of Ali Sher Khan, by his wife, Gul Khatun. In October 1592, he married a daughter of Husain Chak, of Kashmir. In January/March 1593, he married Nur un-nisa Begum, daughter of Ibrahim Husain Mirza, by his wife, Gulrukh Begum, daughter of Kamran Mirza. In September 1593, he married a daughter of Ali Khan Faruqi, Raja of Khandesh. He also married a daughter of Abdullah Khan Baluch. On June 28, 1596, he married Khas Mahal Begum, daughter of Zain Khan Koka, sometime Subadar of Kabul and Lahore. In 1608, he married Saliha Banu Begum, daughter of Qasim Khan, a senior member of the Imperial Household. On June 17, 1608, he married Koka Kumari Begum, eldest daughter of Jagat Singh, Yuvraj of Amber.\n\nJahangir married the extremely beautiful and intelligent Mehr-un-Nisaa (better known by her subsequent title of Nur Jahan) on May 25, 1611. She was the widow of Sher Afgan. Mehr-un-Nisaa became his indisputable chief consort and favourite wife immediately after their marriage. She was witty, intelligent and beautiful, which was what attracted Jahangir to her. Before being awarded the title of Nur Jahan('Light of the World'), she was called Nur Mahal('Light of the Palace'). Her abilities are said to range from fashion designing to hunting. There is also a myth that she had once killed four tigers with six bullets.\n\nNur Jahan\n\nMehr-Un-Nisa, or Nur Jahan, occupies an important place in the history of Jahangir. She was the widow of a rebel officer, Sher Afgan, whose actual name was Ali Quli Beg Ist'ajlu. He had earned the title \"Sher Afgan\" (Tiger tosser) from Emperor Akbar after throwing off a tiger that had leaped to attack Akbar on the top of an elephant in a royal hunt at Bengal and then stabbing the fallen tiger to death. Akbar was greatly affected by the bravery of the young Turkish bodyguard accompanying him and awarded him the captaincy of the Imperial Guard at Bengal. He was killed in rebellion, after learning of Jahangir's orders to have him slain to possess his beautiful wife, as Jahangir yearned for her much earlier than her wedding. The governor of Bengal was instructed secretly by Jahangir in his quest and was also the emperor's foster brother and Sheikh Salim's grandson and was consequently slain by the guards of the Governor. The widowed Mehr-Un-Nisa was brought to Agra along with her nine-year-old daughter and placed in—or refused to be placed in—the Royal harem in 1607. Jahangir married her in 1611 and gave her the title of Nur Jahan or \"Light of the World\". It was rumoured that Jahangir had a hand in the death of her first husband, albeit there is no recorded evidence to prove that he was guilty of that crime; in fact most travellers' reports say that he met her after her husband's death. (See Ellison biography for a full discussion.)\n\nThe loss of Kandahar was due to Prince Khurram's refusal to obey her orders. When the Persians besieged Kandahar, Nur Jahan was at the helm of affairs. She ordered Prince Khurram to march for Kandahar, but the latter refused to do so. There is no doubt that the refusal of the prince was due to her behaviour towards him, as she was favouring her son-in-law, Shahryar, at the expense of Khurram. Khurram suspected that in his absence, Shahryar might be given promotion and that he might die on the battlefield. This fear forced Khurram to rebel against his father rather than fight against the Persians, and thereby Kandahar was lost.\n\nUnder Jahangir, the empire continued to be a war state attuned to conquest and expansion. Jahangir's most irksome foe was the Rana of Mewar, Amar Singh, who finally capitulated in 1613 to Khurram's forces. In the northeast, the Mughals clashed with the Ahoms of Assam, whose guerilla tactics gave the Mughals a hard time. In Northern India, Jahangir's forces under Khurram defeated their other principal adversary, the Raja of Kangra, in 1615; in the Deccan, his victories further consolidated the empire. But in 1620, Jahangir fell sick, and so ensued the familiar quest for power. Nur Jahan married her daughter to Shahryar, Jahangir's youngest son from his other queen, in the hope of having a living male heir to the throne when Jahangir died.\n\nConquests\n\nIn the year 1594, Jahangir was dispatched by his father, the Mughal Emperor Akbar, alongside Abul Hasan Asaf Khan, also known as Mirza Jaafar Beg son of Mirza Ghias Beg Isfahani and brother of Nur Jehan, and Abu'l-Fazl ibn Mubarak, to defeat the renegade Vir Singh Deo of Bundela and capture the city of Orchha, which was considered the centre of the revolt. Jahangir arrived with a force of 12,000 after many ferocious encounters and finally subdued the Bundela and ordered Vir Singh Deo to surrender. After tremendous casualties and the start of negotiations between the two, Vir Singh Deo handed over 5000 Bundela infantry and 1000 cavalry, but he feared Mughal retaliation and remained a fugitive until his death. The victorious Jahangir, only 16 years of age, ordered the completion of the Jahangir Mahal a famous Mughal citadel in Orchha to commemorate and honour his victory.\n\nJahangir then gathered his forces under the command of Ali Kuli Khan and fought Lakshmi Narayan of Koch Bihar. Lakshmi Narayan then accepted the Mughals as his suzerains he was given the title Nazir and later established a garrison at Atharokotha.\n\nIn 1613,From Plassey to Partition: A History of Modern India, p.[https://books.google.com/books?id0oVra0ulQ3QC&pg\nPA37 37], Orient Blackswan, Śekhara Bandyopādhyāẏa  the Portuguese seized the Mughal ship Rahimi, which had set out from Surat on its way with a large cargo of 100,000 rupees and Pilgrims, who were on their way to Mecca and Medina in order to attend the annual Hajj. The Rahimi was owned by Mariam-uz-zamani, Akbar's Christian wife of Portuguese descent. She was referred to as Queen mother of Hindustan during his reign. Rahimi was the largest Indian ship sailing in the Red Sea and was known to the Europeans as the \"great pilgrimage ship\". When the Portuguese officially refused to return the ship and the passengers, the outcry at the Mughal court was unusually severe. The outrage was compounded by the fact that the owner and the patron of the ship was none other than the revered mother of the current emperor. Jahangir himself was outraged and ordered the seizure of the Portuguese town Daman. He ordered the apprehension of all Portuguese within the Mughal Empire; he further confiscated churches that belonged to the Jesuits. This episode is considered to be an example of the struggle for wealth that would later ensue and lead to colonisation of the Indian sub-continent.\n\nJahangir was responsible for ending a century long struggle with the state of Mewar. The campaign against the Rajputs was pushed so extensively that they were made to submit with great loss of life and property.\n\nJahangir posted Islam Khan I to subdue Musa Khan, an Afghan rebel in Bengal, in 1608. Jahangir also thought of capturing Kangra Fort, which Akbar had failed to do in 1615. Consequently, a siege was laid and the fort was taken in 1620, which \"resulted in the submission of the Raja of Chamba who was the greatest of all the rajas in the region.\" The district of Kistwar, in the state of Kashmir, was also conquered.\n\nDeath\n\nJahangir was trying to restore his health by visiting Kashmir and Kabul. He went from Kabul to Kashmir but decided to return to Lahore on account of a severe cold.\n\nJahangir died on the way back from Kashmir near Sarai Saadabad in 1627. To preserve his body, the entrails were removed and buried in the Baghsar Fort, Kashmir. The body was then transferred to Lahore to be buried in Shahdara Bagh, a suburb of Lahore, Punjab. He was succeeded by his third son, Prince Khurram, who took the title of Shah Jahan. Jahangir's elegant mausoleum is located in the Shahdara locale of Lahore and is a popular tourist attraction.\n\nReligion\n\nSir Thomas Roe was England's first ambassador to the Mughal court. Relations with England turned tense in 1617 when Roe warned the Jahangir that if the young and charismatic Prince Shah Jahan, newly instated as the Subedar of Gujarat, had turned the English out of the province, \"then he must expect we would do our justice upon the seas\". Shah Jahan chose to seal an official Firman allowing the English to trade in Gujarat in the year 1618.\n\nMany contemporary chroniclers were not sure quite how to describe Jahangir's personal belief structure. Roe labelled him an atheist, and although most others shied away from that term, they did not feel as though they could call him an orthodox Sunni. Roe believed Jahangir's religion to be of his own making, \"for he envies [the Prophet] Mohammed, and wisely sees no reason why he should not bee as great a prophet as he and therefore professed himself so... he hath found many disciples that flatter or follow him.\" At this time, one of those disciples happened to be the current English ambassador, though his initiation into Jahangir's inner circle was devoid of religious significance for Roe, as he did not understand the full extent of what he was doing: Jahangir hung \"a picture of him self set in gold hanging at a wire gold chain\" round Roe's neck. Roe thought it \"an especial favour, for that all the great men that wear the Kings image (which none may do but to whom it is given) receive no other than a medal of gold as big as six pence.\"\n\nHad Roe intentionally converted, it would have caused quite a scandal in London. But since there was no intent, there was no resultant problem. Such disciples were an elite group of imperial servants, with one of them being promoted to Chief Justice. However, it is not clear that any of those who became disciples renounced their previous religion, so it is probable to see this as a way in which the emperor strengthened the bond between himself and his nobles. Despite Roe's somewhat casual use of the term 'atheist', he could not quite put his finger on Jahangir's real beliefs. Roe lamented that the emperor was either \"the most impossible man in the world to be converted, or the most easy; for he loves to hear, and hath so little religion yet, that he can well abide to have any derided.\"\n\nThis should not imply that the multi-confessional state appealed to all, or that all Muslims were happy with the situation in India. In a book written on statecraft for Jahangir, the author advised him to direct \"all his energies to understanding the counsel of the sages and to comprehending the intimations of the 'ulama.\" At the start of his regime many staunch Sunnis were hopeful, because he seemed less tolerant to other faiths than his father had been. At the time of his accession and the elimination of Abu'l Fazl, his father's chief minister and architect of his eclectic religious stance, a powerful group of orthodox noblemen had gained increased power in the Mughal court. Jahangir did not always benevolently regard some Hindu customs and rituals. On visiting a Hindu temple, he found a statue of a man with a pig's head (more than likely actually a boar's head, a representation of Varaha), one of the idols in the Hindu religion, so he \"ordered them to break that hideous form and throw it in the tank.\" If the Tuzuk is reliable on this subject (and there is no reason to suspect that it is not), then this was an isolated case.\n\nJ.F. Richards argues that \"Jahangir seems to have been persistently hostile to popularly venerated religious figures\", which is debatable. A Muslim saint, Hazrat Mujadid Alif Sani Imam e Rabbani Sheikh Ahmed Sirhindi Al-Farooqi, who had gained large number of followers through his spiritual preaching, was imprisoned in Gwalior Fort.\n\nMost notorious was the execution of the Sikh Guru Arjan Dev Ji, whom Jahangir had got killed in prison. His lands were confiscated and his sons imprisoned as Jahangir suspected him of helping Khusrau's rebellion. It is unclear whether Jahangir even understood what a Sikh was, referring to Guru Arjan as a Hindu, who had \"captured many of the simple-hearted of the Hindus and even of the ignorant and foolish followers of Islam, by his ways and manners... for three or four generations (of spiritual successors) they had kept this shop warm.\" The trigger for Guru Arjan's execution was his support for Jahangir's rebel son Khusrau Mirza, yet it is clear from Jahangir's own memoirs that he disliked Guru Arjan before then: \"many times it occurred to me to put a stop to this vain affair or bring him into the assembly of the people of Islam.\"\n\nMuqarrab Khan sent to Jahangir \"a European curtain (tapestry) the like of which in beauty no other work of the Frank [European] painters has ever been seen.\" One of his audience halls was \"adorned with European screens.\" Christian themes attracted Jahangir, and even merited a mention in the Tuzuk. One of his slaves gave him a piece of ivory into which had been carved four scenes. In the last scene \"there is a tree, below which the figure of the revered (hazrat) Jesus is shown. One person has placed his head at Jesus' feet, and an old man is conversing with Jesus and four others are standing by.\" Though Jahangir believed it to be the work of the slave who presented it to him, Sayyid Ahmad and Henry Beveridge suggest that it was of European origin and possibly showed the Transfiguration. Wherever it came from, and whatever it represented, it was clear that a European style had come to influence Mughal art, otherwise the slave would not have claimed it as his own design, nor would he have been believed by Jahangir.\n\nArt\n\nJahangir was fascinated with art and architecture. Jahangir himself is far from modest in his autobiography when he states his prowess at being able to determine the artist of any portrait by simply looking at a painting. He also preserved paintings of Emperor Akbar's period. An excellent example of this is the painting of Musician Naubat Khan, son in law of legendary Tansen. It was the work of Ustad Mansur.\nAs he said:\n\nJahangir took his connoisseurship of art very seriously. Paintings created under his reign were closely catalogued, dated and even signed, providing scholars with fairly accurate ideas as to when and in what context many of the pieces were created, in addition to their aesthetic qualities.\n\nThe Jesuits had brought with them various books, engravings, and paintings and, when they saw the delight Akbar held for them, sent for more and more of the same to be given to the Mughals, as they felt they were on the \"verge of conversion\", a notion which proved to be very false. Instead, both Akbar and Jahangir studied this artwork very closely and replicated and adapted it, adopting much of the early iconographic features and later the pictorial realism for which Renaissance art was known. Jahangir was notable for his pride in the ability of his court painters. A classic example of this is described in Sir Thomas Roe's diaries, in which the Emperor had his painters copy a European miniature several times creating a total of five miniatures. Jahangir then challenged Roe to pick out the original from the copies, a feat Sir Thomas Roe could not do, to the delight of Jahangir.\n\nJahangir was also revolutionary in his adaptation of European styles. A collection at the British Museum in London contains seventy-four drawings of Indian portraits dating from the time of Jahangir, including a portrait of the emperor himself. These portraits are a unique example of art during Jahangir's reign because before and for sometime after, faces were not drawn full, head-on and including the shoulders as well as the head as these drawings are.\n\nCriticism\n\nJahangir is widely considered to have been a weak and incapable ruler. Orientalist Henry Beveridge (editor of the Tuzk-e-Jahangiri) compares Jahangir to the Roman emperor Claudius, for both were \"weak men... in their wrong places as rulers... [and had] Jahangir been head of a Natural History Museum,... [he] would have been [a] better and happier man.\" Sir William Hawkins who visited Jahangir's court in 1609, said: \"In such short that what this man's father, called Ecber Padasha [Padshah Akbar], got of the Deccans, this king, Selim Sha [Jahangir] beginneth to lose.\" Italian writer and traveller, Niccolao Manucci, who worked under Jahangir's grandson, Dara Shikoh, began his discussion about Jahangir by saying: \"It is a truth tested by experience that sons dissipate what their fathers gained in the sweat of their brow.\"\n\nAccording to John F Richards, Jahangir's frequent withdrawal to a private sphere of life was partly reflective of Jhangir's indolence, brought on by his addiction to a considerable daily dosage of wine and opium.\n\nIn media\n\n* In the 1939 Hindi film Pukar, Jehangir was portrayed by Chandra Mohan.\n* In the 1953 Hindi film Anarkali, he was portrayed by Pradeep Kumar.\n* In the 1955 Telugu film Anarkali,he was portrayed by ANR\n* In the 1960 Hindi film Mughal-e-Azam, he was portrayed by Dilip Kumar. Jalal Agha also played the younger Jahangir at the start of the film.\n* In the 1966 Malyalam film Anarkali (1966 film), he was portrayed by Prem Nazir.\n* In the 1979 Telugu film Akbar Salim Anarkali,he was portrayed by Balakrishna\n* In the 1988 Shyam Benegal's TV Series Bharat Ek Khoj, he was portrayed by Vijay Arora\n* In the 2000 TV series Noorjahan, he was portrayed by Milnd Soman.\n* In the 2013 Ekta Kapoor's TV Series Jodha Akbar, he was portrayed by Ravi Bhatia. Ayaan Zubair Rahmani also played young Salim initially.\n* In the 2014 Indu Sudaresan's TV Series Siyaasat, he was portrayed by Karanvir Sharma and Later Sudhanshu Pandey.\n\nWorks online\n\n* \n*. Jahangir. http://en.wikipedia.org/?curid=16294."
  }
}
