{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6176",
  "eid" : "da2ad7d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778445773,
  "textBody" : "Cecil Blount DeMille (;[http://dictionary.reference.com/browse/cecil+b+de+mille \"De Mille\"]. Random House Webster's Unabridged Dictionary. August 12, 1881 – January 21, 1959) was an American filmmaker. Between 1914 and 1958, he made a total of 70 features, both silent and sound films.\"Cecil B. DeMille Obituary\", Variety, January 28, 1959. He is acknowledged as a founding father of the cinema of the United States and the most commercially successful producer-director in film history.Presley, Cecilia de Mille, and Mark Alan Vieira, Cecil B. DeMille: The Art of the Hollywood Epic, Running Press, 2014, p. 12. His films were distinguished by their epic scale and by his cinematic showmanship. He made silent films of every genre: social dramas, comedies, Westerns, farces, morality plays, and historical pageants.\n\nDeMille began his career as a stage actor in 1900.Hull, Betty Lynne, \"Denver's Elitch Gardens: Spinning a Century of Dreams,\" Big Earth Publishing, 2003, p. 49. He later moved to writing and directing stage productions, some with  Jesse Lasky, who was then a vaudeville producer. DeMille's first film, The Squaw Man (1914), was also the first feature film shot in Hollywood. Its interracial love story made it a phenomenal hit and it \"put Hollywood on the map.\" The continued success of his productions led to the founding of Paramount Pictures with Lasky and Adolph Zukor. His first biblical epic, The Ten Commandments (1923), was both a critical and financial success; it held the Paramount revenue record for twenty-five years.\n\nIn 1927, he directed The King of Kings, a biography of Jesus of Nazareth, which was acclaimed for its sensitivity and reached more than 800 million viewers.Presley, Cecil B. DeMille, p. 10. The Sign of the Cross (1932) was the first sound film to integrate all aspects of cinematic technique.Presley, Cecil B. DeMille, p. 198. Cleopatra (1934) was his first film to be nominated for the Academy Award for Best Picture. After more than thirty years in film production, DeMille reached the pinnacle of his career with Samson and Delilah (1949), a biblical epic which did \"an all-time record business.\" Along with biblical and historical narratives, he also directed films oriented toward \"neo-naturalism,\" which tried to portray the laws of man fighting the forces of nature.Watkins, Daniel. [https://mubi.com/notebook/posts/reap-the-wild-windor-dont-cecil-b-demille-the-evolving-neo-naturalist \"'Reap the Wild Wind'...or Don't: Cecil B. DeMille, the Evolving Neo-Naturalist\"], MUBI, March 10, 2015\n\nHe went on to receive his first nomination for the Academy Award for Best Director for his circus drama The Greatest Show on Earth (1952), which won the Academy Award for Best Picture. His last and most famous film, The Ten Commandments (1956), is currently the seventh-highest-grossing film of all time, adjusted for inflation. In addition to his Best Picture Award, he received an Academy Honorary Award for his film contributions, the Palme d'Or (posthumously) for Union Pacific, a DGA Award for Lifetime Achievement, and the Irving G. Thalberg Memorial Award. He was also the first recipient of the Golden Globe Cecil B. DeMille Award, which was later named in his honor.\n\nName\n\nThere are several variants of his surname. His family's Dutch surname was originally spelled de Mil and then became de Mille. As an adult, he adopted the spelling DeMille for professional purposes but continued to use de Mille in private life. The family name de Mille was used by his children Cecilia, John, Richard, and Katherine. DeMille's brother, William, and his daughters, Margaret and Agnes, as well as DeMille's granddaughter, Cecilia de Mille Presley, also used the de Mille spelling.DeMille, Cecil B. [https://archive.org/stream/autobiographyofc006995mbp/autobiographyofc006995mbp_djvu.txt Autobiography of Cecil B. DeMille]. New York: Prentice Hall, 1959.\n\nFamily, childhood, youth\n\nCecil Blount DeMille was born in Ashfield, Massachusetts, while his parents were vacationing there, and grew up in Washington, North Carolina. His father, Henry Churchill de Mille (1853–1893), was a North Carolina-born dramatist and lay reader in the Episcopal Church, who had earlier begun a career as a playwright, writing his first play at age 15. His mother was the playwight and script writer Matilda Beatrice DeMille (née Samuel), whose parents were both of German Jewish heritage. She emigrated from England with her parents in 1871 when she was 18, and they settled in Brooklyn. Beatrice grew up in a middle-class English household. DeMille's mother was related to British politician Herbert Louis Samuel.\n\nDeMille's parents met as members of a music and literary society in New York. Henry was a tall, red-headed student. Beatrice was intelligent, educated, forthright, and strong-willed. They were both born in 1853 and both loved the theater. When they married, Beatrice converted to Henry's faith. Henry worked as a playwright, administrator, and faculty member during the early years of The American Academy of Dramatic Arts, established in New York City in 1884. He built a house for his family in Wayne, New Jersey.http://www.lambertcastle.org/nlarchive/2004%20Vol.6%20No.4%20Winter.pdf\n\nThe family spent time in Pompton Lakes, New Jersey, operating a private school in that town and attending Christ Episcopal Church. DeMille recalled that this church was the place where he visualized the story of his 1923 version of The Ten Commandments. Henry read to his children nightly, both from the classics and from the Bible. DeMille studied Scripture his entire life and read the Bible during lunch in the studio commissary.Interview with Debra Paget - https://www.youtube.com/watch?v=MKK8nX9jkMI He was the first to admit that he did not attend church services but he did profess an unshakable belief in prayer.Presley, Cecil B. DeMille, p. 401. He stated that his films were a continuation of his father's work. \"My ministry,\" said DeMille, \"has been to make religious movies and to get more people to read the Bible than anyone else ever has.\"Presley, Cecil B. DeMille, p. 402.\n\nIn 1893, at the age of forty, Henry de Mille contracted typhoid fever and died suddenly, leaving Beatrice with three children, a house, and no savings. Beatrice had \"enthusiastically supported\" her husband's theatrical aspirations. In his eulogy, she wrote:\n\n\"May your sons be as fine and as noble and good and honest as you were. May they follow in your steps.\"\n\nWithin eight weeks of Henry's death, Beatrice opened an acting workshop in her home, the Henry C. De Mille School for Girls. She later became the second female play broker on Broadway.Presley, Cecil B. DeMille, p. 47. DeMille attended Pennsylvania Military College in Chester, Pennsylvania from the age of fifteen. Both DeMille (Class of 1900) and his brother William (Class of 1901) also attended and graduated from the American Academy of Dramatic Arts, which they attended on scholarship. The Academy later honored DeMille with an Alumni Achievement Award.\n\nCareer\n\nBroadway\n\nDeMille began his career as an actor on the Broadway stage in the theatrical company of Charles Frohman in 1900. His brother William was establishing himself as a playwright and sometimes invited him to collaborate. DeMille performed on stage with actors whom he would later direct in films: Charlotte Walker, Mary Pickford, and Pedro de Cordoba. DeMille also produced and directed plays.[http://ibdb.com/person.php?id=4709 \"Cecil B. DeMille plays\"]. Internet Broadway Database. Retrieved: December 8, 2011. DeMille found success in the spring of 1913 producing Reckless Age by Lee Wilson, a play about a high society girl wrongly accused of manslaughter starring Frederick Burton and Sydney Shields.[http://fultonhistory.com/Newspaper%2010/New%20York%20NY%20Dramatic%20Mirror/New%20York%20NY%20Dramatic%20Mirror%201913%20Mar-Apr%201914%20Grayscale/New%20York%20NY%20Dramatic%20Mirror%201913%20Mar-Apr%201914%20Grayscale%20-%200391.pdf \"News of Other Cities, Atlantic City\"]. New York Dramatic Mirror, May 14, 1913. DeMille and his brother at times worked with the legendary impresario David Belasco, who had been a friend and collaborator of their father. Changes in the theater rendered DeMille's melodramas obsolete before they were produced, and true theatrical success eluded him. By 1913 he was having difficulty supporting his wife and baby daughter.\n\nMoving pictures\n\nIn July 1913 DeMille, Jesse Lasky, Sam Goldfish (later Samuel Goldwyn), and a group of East Coast businessmen created the Jesse L. Lasky Feature Play Company. On December 12, 1913, DeMille, his cast, and crew boarded a Southern Pacific train bound for Flagstaff via New Orleans. His tentative plan was to shoot a film in Arizona, but he disliked the quality of light he saw there.Presley, Cecil B. DeMille;;, p. 29. He continued to Los Angeles. Once there, he chose not to shoot in Edendale, where many studios were, but in Hollywood. He also flouted the dictum that a film should run twenty minutes. He made his first film run sixty minutes, as long as a short play. The Squaw Man (1914), co-directed by Oscar Apfel, was a sensation and it established the Lasky Company.\n\nSilent era\n\nThe first few years of the Lasky Company (soon to become Famous Players-Lasky) were spent in making films nonstop, literally writing the language of film. DeMille adapted Belasco's dramatic lighting techniques to film technology, mimicking moonlight with U.S. cinema's first attempts at \"motivated lighting\" in The Warrens of Virginia\n\nAfter five years and thirty hit films, DeMille became the American film industry's most successful director. In the silent era, he was renowned for Male and Female (1919), Manslaughter (1921), The Volga Boatman (1926), and The Godless Girl (1928). DeMille's trademark scenes included bathtubs, lion attacks, and Roman orgies. A number of his films featured scenes in two-color Technicolor.\n\nThe immense popularity of DeMille's silent films enabled him to branch out into other areas. The Roaring Twenties were the boom years and DeMille took full advantage, opening the Mercury Aviation Company, one of America's first commercial airlines. He was also a real estate speculator, an underwriter of political campaigns, and a Bank of America executive, approving loans for other filmmakers.\n\nSound era\n\nWhen \"talking pictures\" were innovated in 1928, DeMille made a successful transition, offering his own innovations to the painful process; he devised a microphone boom and a soundproof camera blimp. He also popularized the camera crane.\n\nDeMille made stars of unknown actors: Gloria Swanson, Bebe Daniels, Rod La Rocque, William Boyd, Claudette Colbert, and Charlton Heston. He also cast established stars such as Gary Cooper, Robert Preston, Paulette Goddard and Fredric March in multiple pictures. DeMille displayed a loyalty to his performers, casting them repeatedly. They included Henry Wilcoxon, Julia Faye, Joseph Schildkraut, Ian Keith, Charles Bickford, Theodore Roberts, Akim Tamiroff and William Boyd. DeMille was credited by actor Edward G. Robinson with saving his career following his eclipse in the Hollywood blacklist.Presley, Cecil B. DeMille, p. 375.\n\nDeMille had a reputation for autocratic behavior on the set, singling out and berating extras who were not paying attention. A number of these displays were thought to be staged, however, as an exercise in discipline.Presley, \"Cecil B. DeMille\", p. 259. He despised actors who were unwilling to take physical risks, especially when he had first demonstrated that the required stunt would not harm them. This occurred with Victor Mature in Samson and Delilah. Mature refused to wrestle Jackie the Lion, even though DeMille had just tussled with the lion, proving that he was tame. DeMille told the actor that he was \"one hundred percent yellow\".Presley, Cecil B. DeMille, p. 344. Paulette Goddard's refusal to risk personal injury in a scene involving fire in Unconquered cost her DeMille's favor and a role in The Greatest Show on Earth.Presley, Cecil B. DeMille, p. 363.\n\nDeMille was adept at directing \"thousands of extras\", and many of his pictures include spectacular setpieces: the toppling of the pagan temple in Samson and Delilah; train wrecks in The Road to Yesterday, Union Pacific and The Greatest Show on Earth; the destruction of an airship in Madam Satan; and the parting of the Red Sea in both versions of The Ten Commandments.\n\nDeMille first used three-strip Technicolor in North West Mounted Police (1940). Audiences liked its highly saturated color, so DeMille made no further black-and-white features.\n\nShowmanship as director\n\nDeMille was one of the first directors to become a celebrity in his own right. He cultivated the image of the omnipotent director, complete with megaphone, riding crop, and jodhpurs. From 1936 to 1944, DeMille hosted Lux Radio Theater, a weekly digest of current feature films.\n\nDeMille was respected by his peers, yet his individual films were sometimes criticized. \"Directorially, I think his pictures were the most horrible things I've ever seen in my life\", said director William Wellman. \"But he put on pictures that made a fortune. In that respect, he was better than any of us.\" \nProducer David O. Selznick wrote: \"There has appeared only one Cecil B. DeMille. He is one of the most extraordinarily able showmen of modern times. However much I may dislike some of his pictures, it would be very silly of me, as a producer of commercial motion pictures, to demean for an instant his unparalleled skill as a maker of mass entertainment.\"Presley, Cecil B. DeMille, p. 357.\n\nDeMille appeared as himself in numerous films, including the M-G-M comedy Free and Easy. He often appeared in his coming-attraction trailers and narrated many of his later films, even stepping on screen to introduce The Ten Commandments. DeMille was immortalized in Billy Wilder's Sunset Boulevard when Gloria Swanson spoke the line: \"All right, Mr. DeMille. I'm ready for my closeup.\" DeMille plays himself in the film.\n\nIn the 1940s DeMille continued to please the public. He averaged one film a year; most of them centered on historical figures or Bible stories. His first attempt at a drama set within a semi-documentary frame was The Greatest Show on Earth, a saga of circus performers released in 1952. His experiment gained him a nomination for best director and won an Oscar for best picture.\n\nThe Ten Commandments\n\nIn 1954, DeMille began his last film, the production for which he is best remembered, The Ten Commandments.\n\nOn November 7, 1954, while in Egypt filming the Exodus sequence for The Ten Commandments, DeMille (who was seventy-three) climbed a 107 ft ladder to the top of the massive Per Rameses set and suffered a serious heart attack. Ignoring his doctor's orders, DeMille was back directing the film within a week. Although DeMille completed the film, his health was diminished by several more heart attacks. This film would be his last.\n\nUnfulfilled projects\n\nBecause of his illness, DeMille asked his son-in-law, actor Anthony Quinn, to direct a remake of his 1938 film The Buccaneer. DeMille served as executive producer. Despite a cast led by Charlton Heston and Yul Brynner, the 1958 film The Buccaneer was a disappointment.\n\nIn the months before his death, DeMille was researching a film biography of Robert Baden-Powell, 1st Baron Baden-Powell, the founder of the Scout Movement. DeMille asked David Niven to star in the film, but it was never made. DeMille also was planning a film about the space race as well as another Biblical epic about the Book of Revelation.\n\nPersonal life\n\nDeMille married Constance Adams on August 16, 1902 and had one child, Cecilia. The couple also adopted an orphan child, Katherine Lester, in the early 1920s; her father had been killed in World War I and her mother had died of tuberculosis.\n\nKatherine became an actress at Paramount Pictures, ultimately gaining his approval. In 1937 she married actor Anthony Quinn. In the 1920s the DeMilles adopted two sons, John and Richard, the latter of whom became a notable filmmaker, writer, and psychologist.\n\nDeMille was a Freemason and a member of Prince of Orange Lodge #16 in New York City.\n\nCecil had an older brother William, and a sister Agnes who died in childhood. William later named a daughter after her, Agnes de Mille, the famed dancer-choreographer.\n\nPolitics\n\nDeMille was a lifelong conservative Republican activist. He greatly admired Herbert Hoover. In 1944, he was the master of ceremonies at the massive rally organized by David O. Selznick in the Los Angeles Coliseum in support of the Dewey-Bricker ticket as well as Governor Earl Warren of California, who would become Dewey's running mate in 1948 and later the Chief Justice of the United States. The gathering drew 93,000, with short speeches by Hedda Hopper and Walt Disney. Among those in attendance were Ann Sothern, Ginger Rogers, Randolph Scott, Adolphe Menjou, Gary Cooper, and Walter Pidgeon. Though the rally drew a good response, most Hollywood celebrities who took a public position sided with the Roosevelt-Truman ticket.David M. Jordan, FDR, Dewey, and the Election of 1944 (Bloomington and Indianapolis: Indiana University Press, 2011), pp. 231–232.\n\nIn 1954, Secretary of the Air Force Harold E. Talbott asked DeMille for help in designing the cadet uniforms at the newly established United States Air Force Academy. DeMille's designs, most notably his design of the distinctive cadet parade uniform, won praise from Air Force and Academy leadership, were ultimately adopted, and are still worn by cadets.Radford, Bill. \"A Digger, A Director and A Practical Joker\". Colorado Springs Gazette, USAF Academy 50th Anniversary Edition, Spring 2004.\n\nIn the early 1950s, DeMille was recruited by Allen Dulles and Frank Wisner to serve on the board of the anti-communist National Committee for a Free Europe, the public face of the organization that oversaw the Radio Free Europe service.\n\nRace and religion\n\nDeMille drew on his Jewish and Protestant heritage to convey a message of tolerance. The Crusades was the first film to show accord between Christians and Muslims. DeMille received more than a dozen awards from Jewish religious and cultural groups, including B’nai B’rith.\n\nIn 1954, he was seeking approval for a lavish remake of his 1923 silent film The Ten Commandments. He went before the Paramount board of directors, which was mostly Jewish-American. The members rejected his proposal, even though his last two films, Samson and Delilah and The Greatest Show on Earth, had been record-breaking hits. Adolph Zukor, the chairman of the board, rebuked the members, saying: “We have just lived through a war where our people were systematically executed. Here we have a man who made a film praising the Jewish people, that tells of Samson, one of the legends of our Scripture. Now he wants to make the life of Moses. We should get down on our knees to Cecil and say ‘Thank you!’” DeMille did not have an exact budget proposal for the project, and it promised to be the most costly in U.S. film history. Still, the members unanimously approved it.Presley, Cecil B. DeMille, p. 371.\n\nDeath\n\nIn the early hours of January 21, 1959, DeMille died of a heart ailment.\n\nDeMille's funeral was held on January 23 at St. Stephen's Episcopal Church. He was entombed at the Hollywood Memorial Cemetery (now known as Hollywood Forever).\n\nLegacy\n\nDeMille received hundreds of awards, commendations, and honors in his lifetime.\n\nPosthumous honors\n\nFor his contribution to the motion picture and radio industry, DeMille has two stars on the Hollywood Walk of Fame. The first, for radio contributions, is located at 6240 Vine Street. The second star is located at 1725 Vine Street.\n\nTwo schools have been named after him: Cecil B. DeMille Middle School, in Long Beach, California, closed and demolished in 2007 to make way for a new high school; and Cecil B. DeMille Elementary School in Midway City, California.\n\nThe former film building at Chapman University in Orange, California is named in honor of DeMille. The Lawrence and Kristina Dodge College of Film and Media Arts now resides in Marion Knotts Studios.\n\nThe Golden Globe's annual Cecil B. DeMille Award recognizes lifetime achievement in the film industry.\n\nThe moving image collection of Cecil B. DeMille is held at the Academy Film Archive and includes home movies, outtakes, and [https://www.youtube.com/watch?vv6EnMrahqbA&index\n20&list=PLJ8RjvesnvDMirffrNEsCKnSFlIMwJoei never-before-seen test footage].\n\nDuring the Apollo 11 mission, Buzz Aldrin refers to himself in one instance as \"Cecil B. DeAldrin,\" as a humorous nod to DeMille.\n\nFilmography\n\nDeMille made seventy features. In spite of careful storage in his film vaults, seven films were lost to nitrate decomposition; all were early silent films. The titles are: The Arab, The Wild Goose Chase, Chimmie Fadden, The Dream Girl, We Can't Have Everything, The Devil Stone, and The Squaw Man (the 1918 remake). Roughly twenty of his silent features are available in commercial DVD format.\n\nThe sound films are in three groups:\n\n1. The three films DeMille produced at M-G-M are now owned by Warner Bros. (through Turner Entertainment).\n\n2. The films he made at Paramount between 1932 and 1947 were sold by that company to EMKA, Ltd. in 1957, and are available through the television division of NBCUniversal.\n\n3. DeMille's last three films were not sold to EMKA, and at present remain with Paramount. Television distribution for those films is handled by Trifecta Entertainment & Media. The Ten Commandments is broadcast every Easter Sunday in the United States on the ABC Television Network.\n\nDirector\n\nSilent films\n\n*The Squaw Man (1914)\n*Brewster's Millions (1914, Lost)\n*The Master Mind (1914)\n*The Only Son (1914, Lost)\n*The Man on the Box (1914)\n*The Call of the North (1914)\n*The Virginian (1914)\n*What's His Name (1914)\n*The Man from Home (1914)\n*Rose of the Rancho (1914)\n*The Ghost Breaker (1914, Lost)\n*The Girl of the Golden West (1915)\n*After Five (1915)\n*The Warrens of Virginia (1915)\n*The Unafraid (1915)\n*The Captive (1915)\n*The Wild Goose Chase (1915, Lost)\n*The Arab (1915, Lost)\n*Chimmie Fadden (1915)\n*Kindling (1915)\n*Carmen (1915)\n*Chimmie Fadden Out West (1915)\n*The Cheat (1915)\n*Temptation (1915, Lost)\n*The Golden Chance (1915)\n*The Trail of the Lonesome Pine (1916)\n*The Heart of Nora Flynn (1916)\n*Maria Rosa (1916)\n*The Dream Girl (1916, Lost)\n*Joan the Woman (1917)\n*Lost and Won (1917)\n*A Romance of the Redwoods (1917)\n*The Little American (1917)\n*The Woman God Forgot (1917)\n*Nan of Music Mountain (1917)\n*The Devil-Stone (1917)\n*The Whispering Chorus (1918)\n*Old Wives for New (1918)\n*We Can't Have Everything (1918, Lost)\n*Till I Come Back to You (1918)\n*The Squaw Man (1918, Lost)\n*Don't Change Your Husband (1919)\n*For Better, for Worse (1919)\n*Male and Female (1919)\n*Why Change Your Wife? (1920)\n*Something to Think About (1920)\n*Forbidden Fruit (1921)\n*The Affairs of Anatol (1921)\n*Fool's Paradise (1921)\n*Saturday Night (1922)\n*Manslaughter (1922)\n*Adam's Rib (1923)\n*The Ten Commandments (1923)\n*Triumph (1924)\n*Feet of Clay (1924, Lost)\n*The Golden Bed (1925)\n*The Road to Yesterday (1925)\n*The Volga Boatman (1926)\n*The King of Kings (1927)\n*The Godless Girl (1929)\n\nSound films\n\n*Dynamite (1929)\n*Madam Satan (1930)\n*The Squaw Man (1931)\n*The Sign of the Cross (1932)\n*This Day and Age (1933)\n*Four Frightened People (1934)\n*Cleopatra (1934)\n*The Crusades (1935)\n*The Plainsman (1936)\n*The Buccaneer (1938)\n*Union Pacific (1939)\n*North West Mounted Police (1940)\n*Reap the Wild Wind (1942)\n*The Story of Dr. Wassell (1944)\n*Unconquered (1947)\n*Samson and Delilah (1949)\n*The Greatest Show on Earth (1952)\n*The Ten Commandments (1956)\n*The Buccaneer (1958, Producer)\n\nActor\n\n*The Squaw Man (1914) \n*A Trip to Paramountown (1922)\n*Free and Easy (1930)\n*The Last Train from Madrid (1937)\n*Glamour Boy (1941)\n*Star Spangled Rhythm (1942) \n*Variety Girl (1947) \n*Sunset Boulevard (1950)\n*Son of Paleface (1952)  \n*The Buster Keaton Story (1957)\n\nAwards",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cecil B. DeMille" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6176" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Cecil Blount DeMille (;[http://dictionary.reference.com/browse/cecil+b+de+mille \"De Mille\"]. Random House Webster's Unabridged Dictionary. August 12, 1881 – January 21, 1959) was an American filmmaker. Between 1914 and 1958, he made a total of 70 features, both silent and sound films.\"Cecil B. DeMille Obituary\", Variety, January 28, 1959. He is acknowledged as a founding father of the cinema of the United States and the most commercially successful producer-director in film history.Presley, Cecilia de Mille, and Mark Alan Vieira, Cecil B. DeMille: The Art of the Hollywood Epic, Running Press, 2014, p. 12. His films were distinguished by their epic scale and by his cinematic showmanship. He made silent films of every genre: social dramas, comedies, Westerns, farces, morality plays, and historical pageants.\n\nDeMille began his career as a stage actor in 1900.Hull, Betty Lynne, \"Denver's Elitch Gardens: Spinning a Century of Dreams,\" Big Earth Publishing, 2003, p. 49. He later moved to writing and directing stage productions, some with  Jesse Lasky, who was then a vaudeville producer. DeMille's first film, The Squaw Man (1914), was also the first feature film shot in Hollywood. Its interracial love story made it a phenomenal hit and it \"put Hollywood on the map.\" The continued success of his productions led to the founding of Paramount Pictures with Lasky and Adolph Zukor. His first biblical epic, The Ten Commandments (1923), was both a critical and financial success; it held the Paramount revenue record for twenty-five years.\n\nIn 1927, he directed The King of Kings, a biography of Jesus of Nazareth, which was acclaimed for its sensitivity and reached more than 800 million viewers.Presley, Cecil B. DeMille, p. 10. The Sign of the Cross (1932) was the first sound film to integrate all aspects of cinematic technique.Presley, Cecil B. DeMille, p. 198. Cleopatra (1934) was his first film to be nominated for the Academy Award for Best Picture. After more than thirty years in film production, DeMille reached the pinnacle of his career with Samson and Delilah (1949), a biblical epic which did \"an all-time record business.\" Along with biblical and historical narratives, he also directed films oriented toward \"neo-naturalism,\" which tried to portray the laws of man fighting the forces of nature.Watkins, Daniel. [https://mubi.com/notebook/posts/reap-the-wild-windor-dont-cecil-b-demille-the-evolving-neo-naturalist \"'Reap the Wild Wind'...or Don't: Cecil B. DeMille, the Evolving Neo-Naturalist\"], MUBI, March 10, 2015\n\nHe went on to receive his first nomination for the Academy Award for Best Director for his circus drama The Greatest Show on Earth (1952), which won the Academy Award for Best Picture. His last and most famous film, The Ten Commandments (1956), is currently the seventh-highest-grossing film of all time, adjusted for inflation. In addition to his Best Picture Award, he received an Academy Honorary Award for his film contributions, the Palme d'Or (posthumously) for Union Pacific, a DGA Award for Lifetime Achievement, and the Irving G. Thalberg Memorial Award. He was also the first recipient of the Golden Globe Cecil B. DeMille Award, which was later named in his honor.\n\nName\n\nThere are several variants of his surname. His family's Dutch surname was originally spelled de Mil and then became de Mille. As an adult, he adopted the spelling DeMille for professional purposes but continued to use de Mille in private life. The family name de Mille was used by his children Cecilia, John, Richard, and Katherine. DeMille's brother, William, and his daughters, Margaret and Agnes, as well as DeMille's granddaughter, Cecilia de Mille Presley, also used the de Mille spelling.DeMille, Cecil B. [https://archive.org/stream/autobiographyofc006995mbp/autobiographyofc006995mbp_djvu.txt Autobiography of Cecil B. DeMille]. New York: Prentice Hall, 1959.\n\nFamily, childhood, youth\n\nCecil Blount DeMille was born in Ashfield, Massachusetts, while his parents were vacationing there, and grew up in Washington, North Carolina. His father, Henry Churchill de Mille (1853–1893), was a North Carolina-born dramatist and lay reader in the Episcopal Church, who had earlier begun a career as a playwright, writing his first play at age 15. His mother was the playwight and script writer Matilda Beatrice DeMille (née Samuel), whose parents were both of German Jewish heritage. She emigrated from England with her parents in 1871 when she was 18, and they settled in Brooklyn. Beatrice grew up in a middle-class English household. DeMille's mother was related to British politician Herbert Louis Samuel.\n\nDeMille's parents met as members of a music and literary society in New York. Henry was a tall, red-headed student. Beatrice was intelligent, educated, forthright, and strong-willed. They were both born in 1853 and both loved the theater. When they married, Beatrice converted to Henry's faith. Henry worked as a playwright, administrator, and faculty member during the early years of The American Academy of Dramatic Arts, established in New York City in 1884. He built a house for his family in Wayne, New Jersey.http://www.lambertcastle.org/nlarchive/2004%20Vol.6%20No.4%20Winter.pdf\n\nThe family spent time in Pompton Lakes, New Jersey, operating a private school in that town and attending Christ Episcopal Church. DeMille recalled that this church was the place where he visualized the story of his 1923 version of The Ten Commandments. Henry read to his children nightly, both from the classics and from the Bible. DeMille studied Scripture his entire life and read the Bible during lunch in the studio commissary.Interview with Debra Paget - https://www.youtube.com/watch?v=MKK8nX9jkMI He was the first to admit that he did not attend church services but he did profess an unshakable belief in prayer.Presley, Cecil B. DeMille, p. 401. He stated that his films were a continuation of his father's work. \"My ministry,\" said DeMille, \"has been to make religious movies and to get more people to read the Bible than anyone else ever has.\"Presley, Cecil B. DeMille, p. 402.\n\nIn 1893, at the age of forty, Henry de Mille contracted typhoid fever and died suddenly, leaving Beatrice with three children, a house, and no savings. Beatrice had \"enthusiastically supported\" her husband's theatrical aspirations. In his eulogy, she wrote:\n\n\"May your sons be as fine and as noble and good and honest as you were. May they follow in your steps.\"\n\nWithin eight weeks of Henry's death, Beatrice opened an acting workshop in her home, the Henry C. De Mille School for Girls. She later became the second female play broker on Broadway.Presley, Cecil B. DeMille, p. 47. DeMille attended Pennsylvania Military College in Chester, Pennsylvania from the age of fifteen. Both DeMille (Class of 1900) and his brother William (Class of 1901) also attended and graduated from the American Academy of Dramatic Arts, which they attended on scholarship. The Academy later honored DeMille with an Alumni Achievement Award.\n\nCareer\n\nBroadway\n\nDeMille began his career as an actor on the Broadway stage in the theatrical company of Charles Frohman in 1900. His brother William was establishing himself as a playwright and sometimes invited him to collaborate. DeMille performed on stage with actors whom he would later direct in films: Charlotte Walker, Mary Pickford, and Pedro de Cordoba. DeMille also produced and directed plays.[http://ibdb.com/person.php?id=4709 \"Cecil B. DeMille plays\"]. Internet Broadway Database. Retrieved: December 8, 2011. DeMille found success in the spring of 1913 producing Reckless Age by Lee Wilson, a play about a high society girl wrongly accused of manslaughter starring Frederick Burton and Sydney Shields.[http://fultonhistory.com/Newspaper%2010/New%20York%20NY%20Dramatic%20Mirror/New%20York%20NY%20Dramatic%20Mirror%201913%20Mar-Apr%201914%20Grayscale/New%20York%20NY%20Dramatic%20Mirror%201913%20Mar-Apr%201914%20Grayscale%20-%200391.pdf \"News of Other Cities, Atlantic City\"]. New York Dramatic Mirror, May 14, 1913. DeMille and his brother at times worked with the legendary impresario David Belasco, who had been a friend and collaborator of their father. Changes in the theater rendered DeMille's melodramas obsolete before they were produced, and true theatrical success eluded him. By 1913 he was having difficulty supporting his wife and baby daughter.\n\nMoving pictures\n\nIn July 1913 DeMille, Jesse Lasky, Sam Goldfish (later Samuel Goldwyn), and a group of East Coast businessmen created the Jesse L. Lasky Feature Play Company. On December 12, 1913, DeMille, his cast, and crew boarded a Southern Pacific train bound for Flagstaff via New Orleans. His tentative plan was to shoot a film in Arizona, but he disliked the quality of light he saw there.Presley, Cecil B. DeMille;;, p. 29. He continued to Los Angeles. Once there, he chose not to shoot in Edendale, where many studios were, but in Hollywood. He also flouted the dictum that a film should run twenty minutes. He made his first film run sixty minutes, as long as a short play. The Squaw Man (1914), co-directed by Oscar Apfel, was a sensation and it established the Lasky Company.\n\nSilent era\n\nThe first few years of the Lasky Company (soon to become Famous Players-Lasky) were spent in making films nonstop, literally writing the language of film. DeMille adapted Belasco's dramatic lighting techniques to film technology, mimicking moonlight with U.S. cinema's first attempts at \"motivated lighting\" in The Warrens of Virginia\n\nAfter five years and thirty hit films, DeMille became the American film industry's most successful director. In the silent era, he was renowned for Male and Female (1919), Manslaughter (1921), The Volga Boatman (1926), and The Godless Girl (1928). DeMille's trademark scenes included bathtubs, lion attacks, and Roman orgies. A number of his films featured scenes in two-color Technicolor.\n\nThe immense popularity of DeMille's silent films enabled him to branch out into other areas. The Roaring Twenties were the boom years and DeMille took full advantage, opening the Mercury Aviation Company, one of America's first commercial airlines. He was also a real estate speculator, an underwriter of political campaigns, and a Bank of America executive, approving loans for other filmmakers.\n\nSound era\n\nWhen \"talking pictures\" were innovated in 1928, DeMille made a successful transition, offering his own innovations to the painful process; he devised a microphone boom and a soundproof camera blimp. He also popularized the camera crane.\n\nDeMille made stars of unknown actors: Gloria Swanson, Bebe Daniels, Rod La Rocque, William Boyd, Claudette Colbert, and Charlton Heston. He also cast established stars such as Gary Cooper, Robert Preston, Paulette Goddard and Fredric March in multiple pictures. DeMille displayed a loyalty to his performers, casting them repeatedly. They included Henry Wilcoxon, Julia Faye, Joseph Schildkraut, Ian Keith, Charles Bickford, Theodore Roberts, Akim Tamiroff and William Boyd. DeMille was credited by actor Edward G. Robinson with saving his career following his eclipse in the Hollywood blacklist.Presley, Cecil B. DeMille, p. 375.\n\nDeMille had a reputation for autocratic behavior on the set, singling out and berating extras who were not paying attention. A number of these displays were thought to be staged, however, as an exercise in discipline.Presley, \"Cecil B. DeMille\", p. 259. He despised actors who were unwilling to take physical risks, especially when he had first demonstrated that the required stunt would not harm them. This occurred with Victor Mature in Samson and Delilah. Mature refused to wrestle Jackie the Lion, even though DeMille had just tussled with the lion, proving that he was tame. DeMille told the actor that he was \"one hundred percent yellow\".Presley, Cecil B. DeMille, p. 344. Paulette Goddard's refusal to risk personal injury in a scene involving fire in Unconquered cost her DeMille's favor and a role in The Greatest Show on Earth.Presley, Cecil B. DeMille, p. 363.\n\nDeMille was adept at directing \"thousands of extras\", and many of his pictures include spectacular setpieces: the toppling of the pagan temple in Samson and Delilah; train wrecks in The Road to Yesterday, Union Pacific and The Greatest Show on Earth; the destruction of an airship in Madam Satan; and the parting of the Red Sea in both versions of The Ten Commandments.\n\nDeMille first used three-strip Technicolor in North West Mounted Police (1940). Audiences liked its highly saturated color, so DeMille made no further black-and-white features.\n\nShowmanship as director\n\nDeMille was one of the first directors to become a celebrity in his own right. He cultivated the image of the omnipotent director, complete with megaphone, riding crop, and jodhpurs. From 1936 to 1944, DeMille hosted Lux Radio Theater, a weekly digest of current feature films.\n\nDeMille was respected by his peers, yet his individual films were sometimes criticized. \"Directorially, I think his pictures were the most horrible things I've ever seen in my life\", said director William Wellman. \"But he put on pictures that made a fortune. In that respect, he was better than any of us.\" \nProducer David O. Selznick wrote: \"There has appeared only one Cecil B. DeMille. He is one of the most extraordinarily able showmen of modern times. However much I may dislike some of his pictures, it would be very silly of me, as a producer of commercial motion pictures, to demean for an instant his unparalleled skill as a maker of mass entertainment.\"Presley, Cecil B. DeMille, p. 357.\n\nDeMille appeared as himself in numerous films, including the M-G-M comedy Free and Easy. He often appeared in his coming-attraction trailers and narrated many of his later films, even stepping on screen to introduce The Ten Commandments. DeMille was immortalized in Billy Wilder's Sunset Boulevard when Gloria Swanson spoke the line: \"All right, Mr. DeMille. I'm ready for my closeup.\" DeMille plays himself in the film.\n\nIn the 1940s DeMille continued to please the public. He averaged one film a year; most of them centered on historical figures or Bible stories. His first attempt at a drama set within a semi-documentary frame was The Greatest Show on Earth, a saga of circus performers released in 1952. His experiment gained him a nomination for best director and won an Oscar for best picture.\n\nThe Ten Commandments\n\nIn 1954, DeMille began his last film, the production for which he is best remembered, The Ten Commandments.\n\nOn November 7, 1954, while in Egypt filming the Exodus sequence for The Ten Commandments, DeMille (who was seventy-three) climbed a 107 ft ladder to the top of the massive Per Rameses set and suffered a serious heart attack. Ignoring his doctor's orders, DeMille was back directing the film within a week. Although DeMille completed the film, his health was diminished by several more heart attacks. This film would be his last.\n\nUnfulfilled projects\n\nBecause of his illness, DeMille asked his son-in-law, actor Anthony Quinn, to direct a remake of his 1938 film The Buccaneer. DeMille served as executive producer. Despite a cast led by Charlton Heston and Yul Brynner, the 1958 film The Buccaneer was a disappointment.\n\nIn the months before his death, DeMille was researching a film biography of Robert Baden-Powell, 1st Baron Baden-Powell, the founder of the Scout Movement. DeMille asked David Niven to star in the film, but it was never made. DeMille also was planning a film about the space race as well as another Biblical epic about the Book of Revelation.\n\nPersonal life\n\nDeMille married Constance Adams on August 16, 1902 and had one child, Cecilia. The couple also adopted an orphan child, Katherine Lester, in the early 1920s; her father had been killed in World War I and her mother had died of tuberculosis.\n\nKatherine became an actress at Paramount Pictures, ultimately gaining his approval. In 1937 she married actor Anthony Quinn. In the 1920s the DeMilles adopted two sons, John and Richard, the latter of whom became a notable filmmaker, writer, and psychologist.\n\nDeMille was a Freemason and a member of Prince of Orange Lodge #16 in New York City.\n\nCecil had an older brother William, and a sister Agnes who died in childhood. William later named a daughter after her, Agnes de Mille, the famed dancer-choreographer.\n\nPolitics\n\nDeMille was a lifelong conservative Republican activist. He greatly admired Herbert Hoover. In 1944, he was the master of ceremonies at the massive rally organized by David O. Selznick in the Los Angeles Coliseum in support of the Dewey-Bricker ticket as well as Governor Earl Warren of California, who would become Dewey's running mate in 1948 and later the Chief Justice of the United States. The gathering drew 93,000, with short speeches by Hedda Hopper and Walt Disney. Among those in attendance were Ann Sothern, Ginger Rogers, Randolph Scott, Adolphe Menjou, Gary Cooper, and Walter Pidgeon. Though the rally drew a good response, most Hollywood celebrities who took a public position sided with the Roosevelt-Truman ticket.David M. Jordan, FDR, Dewey, and the Election of 1944 (Bloomington and Indianapolis: Indiana University Press, 2011), pp. 231–232.\n\nIn 1954, Secretary of the Air Force Harold E. Talbott asked DeMille for help in designing the cadet uniforms at the newly established United States Air Force Academy. DeMille's designs, most notably his design of the distinctive cadet parade uniform, won praise from Air Force and Academy leadership, were ultimately adopted, and are still worn by cadets.Radford, Bill. \"A Digger, A Director and A Practical Joker\". Colorado Springs Gazette, USAF Academy 50th Anniversary Edition, Spring 2004.\n\nIn the early 1950s, DeMille was recruited by Allen Dulles and Frank Wisner to serve on the board of the anti-communist National Committee for a Free Europe, the public face of the organization that oversaw the Radio Free Europe service.\n\nRace and religion\n\nDeMille drew on his Jewish and Protestant heritage to convey a message of tolerance. The Crusades was the first film to show accord between Christians and Muslims. DeMille received more than a dozen awards from Jewish religious and cultural groups, including B’nai B’rith.\n\nIn 1954, he was seeking approval for a lavish remake of his 1923 silent film The Ten Commandments. He went before the Paramount board of directors, which was mostly Jewish-American. The members rejected his proposal, even though his last two films, Samson and Delilah and The Greatest Show on Earth, had been record-breaking hits. Adolph Zukor, the chairman of the board, rebuked the members, saying: “We have just lived through a war where our people were systematically executed. Here we have a man who made a film praising the Jewish people, that tells of Samson, one of the legends of our Scripture. Now he wants to make the life of Moses. We should get down on our knees to Cecil and say ‘Thank you!’” DeMille did not have an exact budget proposal for the project, and it promised to be the most costly in U.S. film history. Still, the members unanimously approved it.Presley, Cecil B. DeMille, p. 371.\n\nDeath\n\nIn the early hours of January 21, 1959, DeMille died of a heart ailment.\n\nDeMille's funeral was held on January 23 at St. Stephen's Episcopal Church. He was entombed at the Hollywood Memorial Cemetery (now known as Hollywood Forever).\n\nLegacy\n\nDeMille received hundreds of awards, commendations, and honors in his lifetime.\n\nPosthumous honors\n\nFor his contribution to the motion picture and radio industry, DeMille has two stars on the Hollywood Walk of Fame. The first, for radio contributions, is located at 6240 Vine Street. The second star is located at 1725 Vine Street.\n\nTwo schools have been named after him: Cecil B. DeMille Middle School, in Long Beach, California, closed and demolished in 2007 to make way for a new high school; and Cecil B. DeMille Elementary School in Midway City, California.\n\nThe former film building at Chapman University in Orange, California is named in honor of DeMille. The Lawrence and Kristina Dodge College of Film and Media Arts now resides in Marion Knotts Studios.\n\nThe Golden Globe's annual Cecil B. DeMille Award recognizes lifetime achievement in the film industry.\n\nThe moving image collection of Cecil B. DeMille is held at the Academy Film Archive and includes home movies, outtakes, and [https://www.youtube.com/watch?vv6EnMrahqbA&index\n20&list=PLJ8RjvesnvDMirffrNEsCKnSFlIMwJoei never-before-seen test footage].\n\nDuring the Apollo 11 mission, Buzz Aldrin refers to himself in one instance as \"Cecil B. DeAldrin,\" as a humorous nod to DeMille.\n\nFilmography\n\nDeMille made seventy features. In spite of careful storage in his film vaults, seven films were lost to nitrate decomposition; all were early silent films. The titles are: The Arab, The Wild Goose Chase, Chimmie Fadden, The Dream Girl, We Can't Have Everything, The Devil Stone, and The Squaw Man (the 1918 remake). Roughly twenty of his silent features are available in commercial DVD format.\n\nThe sound films are in three groups:\n\n1. The three films DeMille produced at M-G-M are now owned by Warner Bros. (through Turner Entertainment).\n\n2. The films he made at Paramount between 1932 and 1947 were sold by that company to EMKA, Ltd. in 1957, and are available through the television division of NBCUniversal.\n\n3. DeMille's last three films were not sold to EMKA, and at present remain with Paramount. Television distribution for those films is handled by Trifecta Entertainment & Media. The Ten Commandments is broadcast every Easter Sunday in the United States on the ABC Television Network.\n\nDirector\n\nSilent films\n\n*The Squaw Man (1914)\n*Brewster's Millions (1914, Lost)\n*The Master Mind (1914)\n*The Only Son (1914, Lost)\n*The Man on the Box (1914)\n*The Call of the North (1914)\n*The Virginian (1914)\n*What's His Name (1914)\n*The Man from Home (1914)\n*Rose of the Rancho (1914)\n*The Ghost Breaker (1914, Lost)\n*The Girl of the Golden West (1915)\n*After Five (1915)\n*The Warrens of Virginia (1915)\n*The Unafraid (1915)\n*The Captive (1915)\n*The Wild Goose Chase (1915, Lost)\n*The Arab (1915, Lost)\n*Chimmie Fadden (1915)\n*Kindling (1915)\n*Carmen (1915)\n*Chimmie Fadden Out West (1915)\n*The Cheat (1915)\n*Temptation (1915, Lost)\n*The Golden Chance (1915)\n*The Trail of the Lonesome Pine (1916)\n*The Heart of Nora Flynn (1916)\n*Maria Rosa (1916)\n*The Dream Girl (1916, Lost)\n*Joan the Woman (1917)\n*Lost and Won (1917)\n*A Romance of the Redwoods (1917)\n*The Little American (1917)\n*The Woman God Forgot (1917)\n*Nan of Music Mountain (1917)\n*The Devil-Stone (1917)\n*The Whispering Chorus (1918)\n*Old Wives for New (1918)\n*We Can't Have Everything (1918, Lost)\n*Till I Come Back to You (1918)\n*The Squaw Man (1918, Lost)\n*Don't Change Your Husband (1919)\n*For Better, for Worse (1919)\n*Male and Female (1919)\n*Why Change Your Wife? (1920)\n*Something to Think About (1920)\n*Forbidden Fruit (1921)\n*The Affairs of Anatol (1921)\n*Fool's Paradise (1921)\n*Saturday Night (1922)\n*Manslaughter (1922)\n*Adam's Rib (1923)\n*The Ten Commandments (1923)\n*Triumph (1924)\n*Feet of Clay (1924, Lost)\n*The Golden Bed (1925)\n*The Road to Yesterday (1925)\n*The Volga Boatman (1926)\n*The King of Kings (1927)\n*The Godless Girl (1929)\n\nSound films\n\n*Dynamite (1929)\n*Madam Satan (1930)\n*The Squaw Man (1931)\n*The Sign of the Cross (1932)\n*This Day and Age (1933)\n*Four Frightened People (1934)\n*Cleopatra (1934)\n*The Crusades (1935)\n*The Plainsman (1936)\n*The Buccaneer (1938)\n*Union Pacific (1939)\n*North West Mounted Police (1940)\n*Reap the Wild Wind (1942)\n*The Story of Dr. Wassell (1944)\n*Unconquered (1947)\n*Samson and Delilah (1949)\n*The Greatest Show on Earth (1952)\n*The Ten Commandments (1956)\n*The Buccaneer (1958, Producer)\n\nActor\n\n*The Squaw Man (1914) \n*A Trip to Paramountown (1922)\n*Free and Easy (1930)\n*The Last Train from Madrid (1937)\n*Glamour Boy (1941)\n*Star Spangled Rhythm (1942) \n*Variety Girl (1947) \n*Sunset Boulevard (1950)\n*Son of Paleface (1952)  \n*The Buster Keaton Story (1957)\n\nAwards. Cecil B. DeMille. http://en.wikipedia.org/?curid=6176."
  }
}
