{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15374",
  "eid" : "1b8d1fd0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778555469,
  "textBody" : "Food irradiation is the process of exposing foodstuffs to ionizing radiation. Ionizing radiation is energy that can be transmitted without direct contact to the source of the energy (radiation) capable of freeing electrons from their atomic bonds (ionization) in the targeted food.anon., Food Irradiation – A technique for preserving and improving the safety of food, WHO, Geneva, 1991[http://www.inspection.gc.ca/food/information-for-consumers/fact-sheets/irradiation/eng/1332358607968/1332358680017 \"Food Irradiation\"] Canadian Food Inspection Agency. March 22, 2014. This treatment is used to preserve food, reduce the risk of food borne illness, prevent the spread of invasive pests, and delay or eliminate sprouting or ripening. Irradiated food does not become radioactive. The radiation can be emitted by a radioactive substance or generated electrically.\n\nIrradiation is also used for non-food applications, such as medical devices.\n\nAlthough consumer perception of foods treated with irradiation is more negative than those processed by other means, a large amount of independent research has confirmed irradiation to be safe. One family of chemicals (2ACB's) are uniquely formed by irradiation (unique radiolytic products), and this product is nontoxic. When irradiating food, all other chemicals occur in a lower or comparable frequency to other food processing techniques.anon., Safety and nutritional adequacy of irradiated food, WHO, Geneva, 1994anon., Scientific Opinion on the Chemical Safety of Irradiation of Food, EFSA Journal 2011;9(4):1930 [57 pp.].  last visited March 3, 2013\n\nFood irradiation is permitted by over 60 countries, with about 500,000 metric tons of food annually processed worldwide. The regulations that dictate how food is to be irradiated, as well as the food allowed to be irradiated, vary greatly from country to country. In Austria, Germany, and many other countries of the European Union only dried herbs, spices, and seasonings can be processed with irradiation and only at a specific dose, while in Brazil all foods are allowed at any dose.Food irradiation, Position of ADA, J Am Diet Assoc. 2000;100:246-253.  retrieved November 15, 2007C.M. Deeley, M. Gao, R. Hunter, D.A.E. Ehlermann, The development of food irradiation in the Asia Pacific, the Americas and Europe; tutorial presented to the International Meeting on Radiation Processing, Kuala Lumpur, 2006. https://web.archive.org/web/20110726172416/http://www.iiaglobal.org/index.php?mactNews%2Ccntnt01%2Cdetail%2C0&cntnt01articleid\n488&cntnt01detailtemplateresourceCenter-publication-detail-template&cntnt01returnid\n231&hlen_US last visited February 18, 2010Kume, T. et al., Status of food irradiation in the world, Radiat.Phys.Chem. 78(2009), 222-226Farkas, J. et al., History and future of food irradiation, Trends Food Sci. Technol. 22 (2011), 121-126\n\nUses\n\nIrradiation is used to reduce or eliminate the risk of food bourne illnesses, prevent or slow down spoilage, arrest maturation or sprouting and as a treatment against pests. Depending on the dose, some or all of the pathogenic organisms, microorganisms, bacteria, and viruses present are destroyed, slowed down, or rendered incapable of reproduction. Irradiation cannot revert spoiled or over ripened food to a fresh state. If this food was processed by irradiation, further spoilage would cease and ripening would slow down, yet the irradiation would not destroy the toxins or repair the texture, color, or taste of the food. When targeting bacteria, most foods are irradiated to significantly reduce the number of active microbes, not to sterilize all microbes in the product. In this respect it is similar to pasteurization.\n\nIrradiation is used to create safe foods for people at high risk of infection, or for conditions where food must be stored for long periods of time and proper storage conditions are not available. Foods that can tolerate irradiation at sufficient doses are treated to ensure that the product is completely sterilized. This is most commonly done with rations for astronauts, and special diets for hospital patients.\n\nIrradiation is used to create shelf-stable products. Since irradiation reduces the populations of spoilage microorganisms, and because pre-packed food can be irradiated, the packaging prevents recontamination into the final product.\n\nIrradiation is used to reduce post-harvest losses. It reduces populations of spoilage micro-organisms in the food and can slow down the speed at which enzymes change the food, and therefore slows spoilage and ripening, and inhibits sprouting (e.g., of potato, onion, and garlic).\n\nFood is also irradiated to prevent the spread of invasive pest species through trade in fresh vegetables and fruits, either within countries, or trade across international boundaries. Pests such as insects could be transported to new habitats through trade in fresh produce which could significantly affect agricultural production and the environment were they to establish themselves. This \"phytosanitary irradiation\"http://journals.fcla.edu/flaent/article/view/88667 aims to render any hitch-hiking pest incapable of breeding. The pests are sterilized when the food is treated by low doses of irradiation. In general, the higher doses required to destroy pests such as insects, mealybugs, mites, moths, and butterflies either affect the look or taste, or cannot be tolerated by fresh produce.Joint FAO/IAEA Division of Nuclear Techniques in Food and Agriculture, IAEA, International Database on Insect Disinfestation and Sterilization – IDIDAS – http://www-ididas.iaea.org/IDIDAS/default.htm last visited November 16, 2007 Low dosage treatments (less than 1000 gray) enables trade across quarantine boundarieshttp://www.ingentaconnect.com/contentone/sphs/sphr/2015/00000011/00000003/art00008 and may also help reduce spoilage.\n\nPublic perception\n\nIrradiation has been approved by many countries. For example, in the U.S. the FDA has approved food irradiation for over fifty years. However, in the past decade the major growth area is for fruits and vegetables that are irradiated to prevent the spread of pests. In the early 2000s in the US, irradiated meat was common at some grocery stores, but because of lack of consumer demand, it is no longer common. Because consumer demand for irradiated food is low, reducing the spoilage between manufacture and consumer purchase and reducing the risk of food borne illness is currently not sufficient incentive for most manufactures to supplement their process with irradiation.Martin, Andrew. [https://www.nytimes.com/2009/02/02/business/02irradiate.html?adxnnl\n1&adxnnlx=1261545694-KGCNC1z9SSW95acAk0gz0g Spinach and Peanuts, With a Dash of Radiation.] New York Times. February 1, 2009. Nevertheless, food irradiation does take place commercially and volumes are in general increasing at a slow rate, even in the European Union where all member countries allow the irradiation of dried herbs spices and vegetable seasonings but only a few allow other foods to be sold as irradiated.https://ec.europa.eu/food/safety/biosafety/irradiation/reports_en\n\nAlthough there are some consumers who choose not to purchase irradiated food, a sufficient market has existed for retailers to have continuously stocked irradiated products for years.P. B. Roberts and Y. M. Hénon, Consumer response to irradiated food: purchase versus perception, Stewart Postharvest Review, September 2015, Vol. 11 (3:5), . http://www.foodirradiation.org/pages/Stewart/Roberts.pdf \nWhen labeled irradiated food is offered for retail sale, these consumers buy it and re-purchase it, indicating that it is possible to successfully market irradiated foods, therefore retailers not stocking irratiated foods might be a major bottleneck to wider adption of irrated foods. It is however, widely believed that consumer perception of foods treated with irradiation is more negative than those processed by other meansConley, S.T., What do consumers think about irradiated foods, FSIS Food Safety Review (Fall 1992), 11-15 and some industry studies indicate the number of consumers concerned about the safety of irradiated food decreased between 1985 and 1995 to levels comparable to those of people concerned about food additives and preservatives.Consumer Attitudes and Market Response to Irradiated Food, Author: Bruhn, Christine M.1 Journal of Food Protection, Volume 58, Number 2, February 1995, pp. 175–181(7), Publisher: International Association for Food Protection Even though is it is untrue \"People think the product is radioactive,\" said Harlan Clemmons, president of Sadex, a food irradiation company based in Sioux City, Iowa.[https://www.nytimes.com/2008/08/22/health/policy/22spinach.html?ex\n1377144000&en4d87f8791e3baa62&ei\n5124&partnerpermalink&exprod\npermalink Harris, Gardinier, \"F.D.A. Allows Irradiation of Some Produce\", The New York Times, August 22, 2008.] Because of these concerns and the increased cost of irradiated foods, there is not a widespread public demand for the irradiation of foods for human consumption.\n\nImpact\n\nIrradiation reduces the risk of infection and spoilage, does not make food radioactive, and the food is shown to be safe, but it does cause chemical reactions that alter the food and therefore alters the chemical makeup, nutritional content, and the sensory qualities of the food. Some of the potential secondary impacts of irradiation are hypothetical, while others are demonstrated. These effects include cumulative impacts to pathogens, people, and the environment due to the reduction of food quality, the transpiration and storage of radioactive goods, and destruction of pathogens, changes in the way we relate to food and how irradiation changes the food production and shipping industries.\n\nImmediate effects\n\nThe radiation source supplies energetic particles or waves. As these waves/particles pass through a target material they collide with other particles. Around the sites of these collisions chemical bonds are broken, creating short lived radicals (e.g. the hydroxyl radical, the hydrogen atom and solvated electrons). These radicals cause further chemical changes by bonding with and or stripping particles from nearby molecules. When collisions damage DNA or RNA, effective reproduction becomes unlikely, also when collisions occur in cells, cell division is often suppressed.\n\nIrradiation (within the accepted energy limits, as 10 MeV for electrons, 5 MeV for X-rays [US 7.5 MeV] and gamma rays from Cobalt-60)  can not make food radioactive, but it does produce radiolytic products, and free radicals in the food. A few of these products are unique, but not considered dangerous.\n\nIrradiation can also alter the nutritional content and flavor of foods, much like cooking. The scale of these chemical changes is not unique. Cooking, smoking, salting, and other less novel techniques, cause the food to be altered so drastically that its original nature is almost unrecognizable, and must be called by a different name. Storage of food also causes dramatic chemical changes, ones that eventually lead to deterioration and spoilage.\n\nMisconceptions\n\nA major concern is that irradiation might cause chemical changes that are harmful to the consumer. Several national expert groups and two international expert groups evaluated the available data and concluded that any food at any dose is wholesome and safe to consume as long as it remains palatable and maintains its technical properties (e.g. feel, texture, or color).\n\nIrradiated food does not become radioactive, just as an object exposed to light does not start producing light. Radioactivity is the ability of a substance to emit high energy particles. When particles hit the target materials they may free other highly energetic particles. This ends shortly after the end of the exposure, much like objects stop reflecting light when the source is turned off and warm objects emit heat until they cool down but do not continue to produce their own heat. To modify a material so that it keeps emitting radiation (induce radiation) the atomic cores (nucleus) of the atoms in the target material must be modified.\n\nIt is impossible for food irradiators to induce radiation in a product. Irradiators emit electrons or photons and the radiation is intrinsically radiated at precisely known strengths (wavelengths for photons, and speeds for electrons). These radiated particles at these strengths can never be strong enough to modify the nucleus of the targeted atom in the food, regardless of how many particles hit the target material, and radioactivity can not be induced without modifying the nucleus.\n\nChemical changes\n\nCompounds known as free radicals form when food is irradiated. Most of these are oxidizers (i.e., accept electrons) and some react very strongly. According to the free-radical theory of aging excessive amounts of these free radicals can lead to cell injury and cell death, which may contribute to many diseases. However, this generally relates to the free radicals generated in the body, not the free radicals consumed by the individual, as much of these are destroyed in the digestive process.\n\nWhen fatty acids are irradiated, a family of compounds called 2-alkylcyclobutanones (2-ACBs) are produced. These are thought to be unique radiolytic products. Most of the substances found in irradiated food are also found in food that has been subjected to other food processing treatments, and are therefore not unique. Furthermore, the quantities in which they occur in irradiated food are lower or similar to the quantities formed in heat treatments.\n\nThe radiation doses to cause toxic changes are much higher than the doses used to during irradiation, and taking into account the presence of 2-ACBs along with what is known of free radicals, these results lead to the conclusion that there is no significant risk from radiolytic products.\n\nFood quality\n\nIonizing radiation can change food quality but in general very high levels of radiation treatment (many thousands of gray) are necessary to adversely change nutritional content, as well as the sensory qualities (taste, appearance, and texture). Irradiation to the doses used commercially to treat food have very little negative impact on the sensory qualities and nutrient content in foods. When irradiation is used to maintain food quality for a longer period of time (improve the shelf stability of some sensory qualities and nutrients) the improvement means that more consumers have access to the original taste, texture, appearance, and nutrients. The changes in quality and nutrition depend on the degree of treatment and may vary greatly from food to food.\n\nThere has been low level gamma irradiation that has been attempted on arugula, spinach, cauliflower,Vaishnav, J., Adiani, V., & Variyar, P. S. (2015). Radiation processing for enhancing shelf life and quality characteristics of minimally processed ready-to-cook (RTC) cauliflower (Brassica oleracea). Food Packaging and Shelf Life, 5, 50–55. ash gourd,Tripathi, J., Chatterjee, S., Vaishnav, J., Variyar, P. S., & Sharma, A. (2013). Gamma irradiation increases storability and shelf life of minimally processed ready-tocook (RTC) ash gourd (Benincasa hispida) cubes. Postharvest Biology and Technology, 76, 17–25. bamboo shoots,Zeng, F., Luo, Z., Xie, J., & Feng, S. (2015). Gamma radiation control quality and lignification of bamboo shoots (Phyllostachys praecox f. prevernalis.) stored at low temperature. Postharvest Biology and Technology, 102, 17–24. coriander, parsley, and watercress.  There has been limited information, however, regarding the physical, chemical and/or bioactive properties and the shelf life on these minimally processed vegetables.\n\nOrganic advocacy groups believe that irradiated food should not be labeled as raw because the process changes the nutritional content of food.[https://www.centerforfoodsafety.org/issues/1039/food-irradiation/labeling-of-irradiated-foods Labeling of Irradiated Foods] However, the degradation of vitamins caused by irradiation is similar to or even less than the loss caused by other raw food preservation processes. Other processes like chilling, freezing, drying, and heating also result in some vitamin loss.\n\nThe changes in the flavor of fatty foods like meats, nuts and oils are sometimes noticeable, while the changes in lean products like fruits and vegetables are less so. Some studies by the irradiation industry show that for some properly treated fruits and vegetables irradiation is seen by consumers to improve the sensory qualities of the product compared to untreated fruits and vegetables.\n\nQuality Impact on Minimally Processed Vegetables\n\nWatercress (Nasturtium Officinale) is a rapidly growing aquatic or semi aquatic perennial plant.  It contains health promoting phytochemicals endowed in therapeutic properties.Rose, P., Won, Y. K., Ong, C. N., & Whiteman, M. (2005). Beta-phenylethyl and 8- methylsulphinyloctyl isothiocyanates, constituents of watercress, suppress LPS induced production of nitric oxide and prostaglandin E2 in RAW 264.7 macrophages. Nitric Oxide, 12, 237–243 Because chemical agents do not provide efficient microbial reductions, watercress has been tested with gamma irradiation treatment in order to improve both safety and the shelf life of the product.Ramos, B., Miller, F. A., Brandão, T. R. S., Teixeira, P., & Silva, C. L. M. (2013). Fresh fruits and vegetables – An overview on applied methodologies to improve its quality and safety. Innovative Food Science and Emerging Technologies, 20, 1–15.  It is traditionally used on horticultural products to prevent sprouting and post-packaging contamination, delay post-harvest ripening, maturation and senescence.\n\nIn a Food Chemistry food journal, scientists studied the suitability of gamma irradiation of 1, 2, and 5 kGy for preserving quality parameters of the fresh cut watercress at around 4 degrees Celsius for 7 days.  They determined that a 2 kGy dose of irradiation was the dose that contained most similar qualities to non-stored control samples, which is one of the goals of irradiation.  2 kGy preserved high levels of reducing sugars and favoured PUFA; while samples of the 5 kGy dose revealed high contents of sucrose and MUFA.  Both cases the watercress samples obtained healthier fatty acids profiles.  However, a 5kGy dose better preserved the antioxidant activity and total flavonoids.\n\nLong-term impacts\n\nIf the majority of food was irradiated at high-enough levels to significantly decrease its nutritional content, there would be an increased risk of developing nutritionally-based illnesses if additional steps, such as changes in eating habits, were not taken to mitigate this. Furthermore, for at least three studies on cats, the consumption of irradiated food was associated with a loss of tissue in the myelin sheath, leading to reversible paralysis. Researchers suspect that reduced levels of vitamin A and high levels of free radicals may be the cause. This effect is thought to be specific to cats and has not been reproduced in any other animal. To produce these effects, the cats were fed solely on food that was irradiated at a dose at least five times higher than the maximum allowable dose.\n\nIt may seem reasonable to assume that irradiating food might lead to radiation-tolerant strains, similar to the way that strains of bacteria have developed resistance to antibiotics. Bacteria develop a resistance to antibiotics after an individual uses antibiotics repeatedly. Much like pasteurization plants, products that pass through irradiation plants are processed once, and are not processed and reprocessed. Cycles of heat treatment have been shown to produce heat-tolerant bacteria, yet no problems have appeared so far in pasteurization plants. Furthermore, when the irradiation dose is chosen to target a specific species of microbe, it is calibrated to doses several times the value required to target the species. This ensures that the process randomly destroys all members of a target species. Therefore, the more irradiation-tolerant members of the target species are not given any evolutionary advantage. Without evolutionary advantage, selection does not occur. As to the irradiation process directly producing mutations that lead to more virulent, radiation-resistant strains, the European Commission's Scientific Committee on Food found that there is no evidence; on the contrary, irradiation has been found to cause loss of virulence and infectivity, as mutants are usually less competitive and less adapted.\n\nMisconceptions\n\nSome who do not advocate food irradiation argue the safety of irradiated food is not scientifically proven because there are a lack of long-term studies R.L. Wolke, What Einstein told his cook – Kitchen science explained, W.W. Norton & Company Inc., New York, 2002; see p.310 \"Some Illumination on Irradiation\" in spite of the fact that hundreds of animal feeding studies of irradiated food, including multigenerational studies, have been performed since 1950.Diehl, J.F., Safety of irradiated foods, Marcel Dekker, N.Y., 1995 (2. ed.) Endpoints investigated have included subchronic and chronic changes in metabolism, histopathology, function of most systems, reproductive effects, growth, teratogenicity, and mutagenicity. A large number of studies have been performed; meta-studies have supported the safety of irradiated food.World Health Organization. Wholesomeness of irradiated food. Geneva, Technical Report Series No. 659, 1981World Health Organization. High-Dose Irradiation: Wholesomeness of Food Irradiated With Doses Above 10 kGy. Report of a Joint FAO/IAEA/WHO Study Group. Geneva, Switzerland: World Health Organization; 1999. WHO Technical Report Series No. 890World Health Organization. Safety and Nutritional Adequacy of Irradiated Food. Geneva, Switzerland: World Health Organization; 1994US Department of Health, and Human Services, Food, and Drug Administration Irradiation in the production, processing, and handling of food. Federal Register 1986; 51:13376-13399\n\nThe below experiments are cited by food irradiation opponents, but either could not be verified in later experiments, could not be clearly attributed to the radiation effect, or could be attributed to an inappropriate design of the experiment.\n* India's National Institute of Nutrition (NIN) found an elevated rate of cells with more than one set of genes (polyploidy) in humans and animals when fed wheat that was irradiated recently (within 12 weeks). Upon analysis, scientists determined that the techniques used by the NIN allowed for too much human error and statistical variation; therefore, the results were unreliable. After multiple studies by independent agencies and scientists, no correlation between polyploidy and irradiation of food could be found.\n\nIndirect effects of irradiation\n\nThe indirect effects of irradiation are the concerns and benefits of irradiation that are related to how making food irradiation a common process will change the world, with emphasis on the system of food production.\n\nIf irradiation was to become common in the food handling process there would be a reduction of the prevalence of foodborne illness and potentially the eradication of specific pathogens. However, multiple studies suggest that an increased rate of pathogen growth may occur when irradiated food is cross-contaminated with a pathogen, as the competing spoilage organisms are no longer present. This being said, cross contamination itself becomes less prevalent with an increase in usage of irradiated foods.\n\nThe ability to remove bacterial contamination through post-processing by irradiation may reduce the fear of mishandling food which could cultivate a cavalier attitude toward hygiene and result in contaminants other than bacteria. However, concerns that the pasteurization of milk would lead to increased contamination of milk were prevalent when mandatory pasteurization was introduced, but these fears never materialized after adoption of this law. Therefore, it is unlikely for irradiation to cause an increase of illness due to nonbacteria-based contamination.\n\nTreatment\n\nUp to the point where the food is processed by irradiation, the food is processed in the same way as all other food. To treat the food, they are exposed to a radioactive source, for a set period of time to achieve a desired dose. Radiation may be emitted by a radioactive substance, or by X-ray and electron beam accelerators. Special precautions are taken to ensure the food stuffs never come in contact with the radioactive substances and that the personnel and the environment are protected from exposure radiation.\nIrradiation treatments are typically classified by dose (high, medium, and low), but are sometimes classified by the effects of the treatmentD.A.E. Ehlermann, The RADURA-terminology and food irradiation, Food Control 20 (2009), 526-528,  (radappertization, radicidation and radurization). Food irradiation is sometimes referred to as \"cold pasteurization\"Cold Pasteurization of Food By Irradiation by Tim Roberts, Extension Specialist, Food Safety, Virginia Tech; Publication Number 458-300, posted August 1998  retrieved on November 15, 2007  or \"electronic pasteurization\"See, e.g., The Truth about Irradiated Meat, CONSUMER REPORTS 34-37 (August 2003). because ionizing the food does not heat the food to high temperatures during the process, and the effect is similar to heat pasteurization. The term \"cold pasteurization\" is controversial because the term may be used to disguise the fact the food has been irradiated and pasteurization and irradiation are fundamentally different processes.\n\nTreatment costs vary as a function of dose and facility usage. A pallet or tote is typically exposed for several minutes to hours depending on dose. Low-dose applications such as disinfestation of fruit range between US$0.01/lbs and US$0.08/lbs while higher-dose applications can cost as much as US$0.20/lbs.\n\nProcess\n\nTypically, when the food is being irradiated, pallets of food are exposed to a source of radiation for a specific time. Dosimeters are placed on the pallet (at various locations) of food to serve as a check and ensure that the correct dose was achieved.\nMost irradiated food is processed by gamma irradiation., however the usage of electron beam and X-ray is becoming more popular as [http://www.ichtj.waw.pl/ichtj/nukleon/back/full/vol50_2005/v50n4p179f.pdf well] [http://www.sciencedirect.com/science/article/pii/0969806X9390312I]. With gamma irradiation, special precautions are taken because gamma rays are continuously emitted by the radioactive material. In most designs, to nullify the effects of radiation, the radioisotope is lowered into a water-filled storage pool, which absorbs the radiation but does not become radioactive. This allows pallets of the products to be added and removed from the irradiation chamber and other maintenance to be done. Sometimes movable shields are used to reduce radiation levels in areas of the irradiation chamber instead of submerging the source. For x-ray and electron irradiation these precautions are not necessary as the radiation is generated by electricity, the source of the radiation can be switched off.\n\nFor x-ray, gamma ray and electron irradiation, shielding is required when the foods are being irradiated. This is done to protect workers and the environment outside of the chamber from radiation exposure. Typically permanent or movable shields are used. In some gamma irradiators the radioactive source is under water at all times, and the hermetically sealed product is lowered into the water. The water acts as the shield in this application. Because of the lower penetration depth of electron irradiation, treatment to entire industrial pallets or totes is not possible.\n\nDosimetry\n\nThe radiation absorbed dose is the amount energy absorbed per unit weight of the target material. Dose is used because, when the same substance is given the same dose, similar changes are observed in the target material. The SI unit for dose is grays (Gy or J/kg). Dosimeters are used to measure dose, and are small components that, when exposed to ionizing radiation, change measurable physical attributes to a degree that can be correlated to the dose received. Measuring dose (dosimetry) involves exposing one or more dosimeters along with the target material.K. Mehta, Radiation Processing Dosimetry – A practical manual, 2006, GEX Corporation, Centennial, US\n\nFor purposes of legislation doses are divided into low (up to 1 kGy), medium (1 kGy to 10 kGy), and high-dose applications (above 10 kGy). High-dose applications are above those currently permitted in the US for commercial food items by the FDA and other regulators around the world. Though these doses are approved for non commercial applications, such as sterilizing frozen meat for NASA astronauts (doses of 44 kGy) and food for hospital patients.\n\nTechnology\n\nElectron irradiation uses a stream of electrons accelerated by an electric voltage or radio frequency wave to a velocity close to the speed of light. Electrons have mass and negative electric charge, and therefore electron beams at the energies allowed for food irradiation do not penetrate into the product beyond several centimeters, depending on product density. Therefore, electron beams are preferred for thin products\n\nGamma irradiation involves packets of light (photons) that originate from radioactive decay of atomic nuclei. Gamma rays are used for products that are too thick for treatment with electron beams. Every radioactive element gives rise to Gamma rays with specific energies characteristic of the source element, these rays have zero mass and no electrical charge. The ones used for food irradiation are able to penetrate through food products. The radioactive isotope radioisotope cobalt-60 is used as the source in all commercial scale gamma irradiation facilities. Gamma irradiation is most widely used technology because the deeper penetration of the gamma rays enables administering treatment to entire industrial pallets or totes (reducing the need for material handling) and it is significantly less expensive than using an X-ray source. Cobalt-60 is bred from cobalt-59 using neutron irradiation in specifically designed nuclear reactors.anon., Gamma Irradiators for Radiation Processing, IAEA, Vienna, 2005 In limited applications caesium-137, a less costly alternative recovered during the processing of spent nuclear fuel, is used as a radioactive source. Insufficient quantities are available for large scale commercial use. An incident where water-soluble caesium-137 leaked into the source storage pool requiring NRC intervention has led to near elimination of this radioisotope.\n\nIrradiation by X-ray is similar to irradiation by gamma rays but the rays produced have a distribution of energetic packets of light, still the maximum energy of the produced X-ray photon is limited by the energy put into the X-ray generator therefore it is possible to guarantee that no partials capable of inducing irradiation can be emitted. X-rays are generated by colliding accelerated electrons with a dense target material (this process is known as bremsstrahlung-conversion), and the X-rays so produced have a spectrum characteristic of the dense target material. Heavy metals, such as tantalum and tungsten, are used because of their high\natomic numbers and high melting temperatures. Tantalum is usually preferred versus tungsten for industrial, large-area, high-power targets because it is more workable than tungsten and has a higher threshold energy for induced reactions. Like electron beams, X-rays do not necessitate the use of radioactive materials and can be switched off when not needed.\nX-rays ability to penetrate the target is similar to gamma irradiation. X-ray machines produce better dose uniformity than Gamma rays, and their penetration depth is similar to slightly\ngreater than that of gamma rays, but they require much more electricity as only as much as 12% of the input energy is converted into X-rays.\n\nCost\n\nThe cost of food irradiation is influenced by dose requirements, the food's tolerance of radiation, handling conditions, i.e., packaging and stacking requirements, construction costs, financing arrangements, and other variables particular to the situation.(Forsythe and Evangel 1993, USDA 1989) Irradiation is a capital-intensive technology requiring a substantial initial investment, ranging from $1 million to $5 million. In the case of large research or contract irradiation facilities, major capital costs include a radiation source, hardware (irradiator, totes and conveyors, control systems, and other auxiliary equipment), land (1 to 1.5 acres), radiation shield, and warehouse. Operating costs include salaries (for fixed and variable labor), utilities, maintenance, taxes/insurance, cobalt-60 replenishment, general utilities, and miscellaneous operating costs.(Kunstadt et al., USDA 1989) Perishable food items, like fruits, vegetables and meats would still require to be handled in the cold chain, so all other supply chain costs remain the same.\n\nStandards & regulations\n\nThe Codex Alimentarius represents the global standard for irradiation of food, in particular under the WTO-agreement. Member states are free to convert those standards into national regulations at their discretion, therefore regulations about irradiation differ from country to country.\n\nThe United Nations Food and Agricultural Organization (FAO) has passed a motion to commit member states to implement irradiation technology for their national phytosanitary programs; the General assembly of the International Atomic Energy Agency (IAEA) has urged wider use of the irradiation technology.\n\nLabeling\n\nThe provisions of the Codex Alimentarius are that any \"first generation\" product must be labeled \"irradiated\" as any product derived directly from an irradiated raw material; for ingredients the provision is that even the last molecule of an irradiated ingredient must be listed with the ingredients even in cases where the unirradiated ingredient does not appear on the label. The RADURA-logo is optional; several countries use a graphical version that differs from the Codex-version. The suggested rules for labeling is published at CODEX-STAN – 1 (2005), and includes the usage of the Radura symbol for all products that contain irradiated foods. The Radura symbol is not a designator of quality. The amount of pathogens remaining is based upon dose and the original content and the dose applied can vary on a product by product basis.\n\nThe European Union follows the Codex's provision to label irradiated ingredients down to the last molecule of irradiated food. The European Community does not provide for the use of the Radura logo and relies exclusively on labeling by the appropriate phrases in the respective languages of the Member States. The European Union enforces its irradiation labeling laws by requiring its member countries to perform tests on a cross section of food items in the market-place and to report to the European Commission. The results are published annually in the OJ of the European Communities.http://ec.europa.eu/food/food/biosafety/irradiation/scientific_advices_reports_en.htm\n Expand \"Food Irradiation Reports\" and select respective annual report and language\n\nThe US defines irradiated foods as foods in which the irradiation causes a material change in the food, or a material change in the consequences that may result from the use of the food. Therefore, food that is processed as an ingredient by a restaurant or food processor is exempt from the labeling requirement in the US. This definition is not consistent with the Codex Alimentarius. All irradiated foods must bear a slightly modified Radura symbol at the point of sale and use the term \"irradiated\" or a derivative there of, in conjunction with explicit language describing the change in the food or its conditions of use.\n\nFood safety\n\nIn 2003, the Codex Alimentarius removed any upper dose limit for food irradiation as well as clearances for specific foods, declaring that all are safe to irradiate. Countries such as Pakistan and Brazil have adopted the Codex without any reservation or restriction. Other countries, including New Zealand, Australia, Thailand, India, and Mexico, have permitted the irradiation of fresh fruits for fruit fly quarantine purposes, amongst others.\n\nStandards that describe calibration and operation for radiation dosimetry, as well as procedures to relate the measured dose to the effects achieved and to report and document such results, are maintained by the American Society for Testing and Materials (ASTM international) and are also available as ISO/ASTM standards.(see Annual Book of ASTM Standards, vol. 12.02, West Conshohocken, PA, US)\n\nAll of the rules involved in processing food are applied to all foods before they are irradiated.\n\nUnited States\n\nIn the United States, each new food is approved separately with a guideline specifying a maximum dosage; in case of quarantine applications the minimum dose is regulated. Packaging materials containing the food processed by irradiation must also undergo approval. Food irradiation in the United States is primarily regulated by the FDAFDA, Irradiation in the production, processing and handling of food. Final rule, Fed. Reg., 51: 13376-13399 (1986)\nthis is the initial and general ruling; later amendments on various details have been published in Fed. Reg. since it is considered a food additive. The United States Department of Agriculture (USDA) amends these rules for use with meat, poultry, and fresh fruit.USDA/FSIS and USDA/APHIS, various final rules on pork, poultry and fresh fruits: Fed.Reg. 51:1769–1771 (1986); 54:387-393 (1989); 57:43588-43600 (1992); and others more\n\nThe United States Department of Agriculture (USDA) has approved the use of low-level irradiation as an alternative treatment to pesticides for fruits and vegetables that are considered hosts to a number of insect pests, including fruit flies and seed weevils. Under bilateral agreements that allows less-developed countries to earn income through food exports agreements are made to allow them to irradiate fruits and vegetables at low doses to kill insects, so that the food can avoid quarantine.\n\nThe U.S. Food and Drug Administration (FDA) and the USDA have approved irradiation of the following foods and purposes:\n* Packaged refrigerated or frozen red meatanon.,[http://ccr.ucdavis.edu/irr/inus2.shtml Is this technology being used in other countries?]  retrieved on November 15, 2007 — to control pathogens (E. Coli O157:H7 and Salmonella), and to extend shelf life.\n* Packaged poultry — control pathogens (Salmonella and Camplylobacter).\n* Fresh fruits, vegetables and grains — to control insects and inhibit growth, ripening and sprouting.\n* Pork — to control trichinosis.\n* Herbs, spices and vegetable seasoningsanon., [http://ccr.ucdavis.edu/irr/inus1.shtml Are irradiated foods in the U.S. supermarkets now?]  retrieved on November 15, 2007 — to control insects and microorganisms.\n* Dry or dehydrated enzyme preparations — to control insects and microorganisms.\n* White potatoes — to inhibit sprout development.\n* Wheat and wheat flour — to control insects.\n* Loose or bagged fresh iceberg lettuce and spinach\n\nEuropean Union\n\nEuropean law dictates that all member countries must allow the sale of irradiated dried aromatic herbs, spices and vegetable seasonings.EU: Food Irradiation – Community Legislation http://ec.europa.eu/food/food/biosafety/irradiation/comm_legisl_en.htm However, these Directives allow Member States to maintain previous clearances food categories the EC's Scientific Committee on Food (SCF) had previously approved (the approval body is now the European Food Safety Authority). Presently, Belgium, Czech Republic, France, Italy, Netherlands, Poland, and the United Kingdom allow the sale of many different types of irradiated foods. Before individual items in an approved class can be added to the approved list, studies into the toxicology of each of such food and for each of the proposed dose ranges are requested. It also states that irradiation shall not be used \"as a substitute for hygiene or health practices or good manufacturing or agricultural practice\". These Directives only control food irradiation for food retail and their conditions and controls are not applicable to the irradiation of food for patients requiring sterile diets.\n\nBecause of the Single Market of the EC any food, even if irradiated, must be allowed to be marketed in any other Member State even if a general ban of food irradiation prevails, under the condition that the food has been irradiated legally in the state of origin.\nFurthermore, imports into the EC are possible from third countries if the irradiation facility had been inspected and approved by the EC and the treatment is legal within the EC or some Member state.\n\nAustralia\n\nAustralia banned irradiated cat food after a national scare where cats suffered from paralyzation after eating a specific brand of highly irradiated catfood for an extended period of time. The suspected culprit was malnutrition from consuming food depleted of Vitamin A by the irradiation process.http://www.smh.com.au/national/catfood-irradiation-banned-as-pet-theory-proved-20090529-bq8h.htmlhttp://kb.rspca.org.au/What-is-RSPCA-Australias-position-on-the-irradiation-of-imported-pet-food-products_307.html The incident was linked only to a single batch of one brand's product and no illness was linked to any of that brand's other irradiated batches of the same product or to any other brand of irradiated cat food. This, along with incomplete evidence indicating that the cat food was not sufficiently depleted of Vitamin A makes irradiation a less likely cause. Further research has been able to experimentally induce the paralyzation of cats by via Vitamin A deficiency by feeding highly irradiated food. For more details see the Long term impacts section.\n\nNuclear safety and security\n\nInterlocks and safeguards are mandated to minimize this risk. There have been radiation-related accidents, deaths, and injury at such facilities, many of them caused by operators overriding the safety related interlocks.International Atomic Energy Agency. [http://www-pub.iaea.org/MTCD/publications/PDF/Pub925_web.pdf The Radiological Accident in Soreq] In a radiation processing facility, radiation specific concerns are supervised by special authorities, while \"Ordinary\" occupational safety regulations are handled much like other businesses.\n\nThe safety of irradiation facilities is regulated by the United Nations International Atomic Energy Agency and monitored by the different national Nuclear Regulatory Commissions. The regulators enforce a safety culture that mandates that all incidents that occur are documented and thoroughly analyzed to determine the cause and improvement potential. Such incidents are studied by personnel at multiple facilities, and improvements are mandated to retrofit existing facilities and future design.\n\nIn the US the Nuclear Regulatory Commission (NRC) regulates the safety of the processing facility, and the United States Department of Transportation (DOT) regulates the safe transport of the radioactive sources.\n\nIrradiated food supply\n\nAuthorities in some countries use tests that can detect the irradiation of food items to enforce labeling standards and to bolster consumer confidence.McMurray, C.H., Gray, R., Stewart, E.M., Pearce, J., Detection methods for irradiated foods, Royal Society of Chemistry; Cambridge (GB); 1996Raffi, J., Delincée, H., Marchioni, E., Hasselmann, C., Sjöberg, A.-M., Leonardi, M., Kent, M., Bögl, K.-W., Schreiber, G., Stevenson, H., Meier, W., Concerted action of the community bureau of reference on methods of identification of irradiated foods; bcr information; European Commission; Luxembourg; 1994, 119 p.; EUR--15261  The European Union monitors the market to determine the quantity of irradiated foods, if irradiated foods are labeled as irradiated, and if the irradiation is performed at approved facilities.\n\nIrradiation of fruits and vegetables to prevent the spread of pest and diseases across borders has been increasing globally. In 2010, 18446 tonnes of fruits and vegetables were irradiated in six countries for export quarantine control; the countries follow: Mexico (56.2%), United States (31.2%), Thailand (5.18%), Vietnam (4.63%), Australia (2.69%), and India (0.05%). The three types of fruits irradiated the most were guava (49.7%), sweet potato(29.3%) and sweet lime (3.27%).\n\nIn total, 103 000 tonnes of food products were irradiated on mainland United States in 2010. The three types of foods irradiated the most were spices (77.7%), fruits and vegetables (14.6%) and meat and poultry (7.77%). 17 953 tonnes of irradiated fruits and vegetables were exported to the mainland United States. Mexico, the United States' state of Hawaii, Thailand, Vietnam and India export irradiated produce to the mainland U.S. Mexico, followed by the United States' state of Hawaii, is the largest exporter of irradiated produce to the mainland U.S.\n\nIn total, 6 876 tonnes of food products were irradiated in European Union countries in 2013; mainly in four member state countries: Belgium (49.4%), the Netherlands (24.4%), Spain (12.7%) and France (10.0%). The two types of foods irradiated the most were frog legs (46%), and dried herbs and spices (25%). There has been a decrease of 14% in the total quantity of products irradiated in the EU compared to the previous year 2012 (7 972 tonnes) \n\nTimeline of the history of food irradiation\n\n* 1895 Wilhelm Conrad Röntgen discovers X-rays (\"bremsstrahlung\", from German for radiation produced by deceleration)\n* 1896 Antoine Henri Becquerel discovers natural radioactivity; Minck proposes the therapeutic useMinck, F. (1896) Zur Frage über die Einwirkung der Röntgen'schen Strahlen auf Bacterien und ihre eventuelle therapeutische Verwendbarkeit. Münchener Medicinische Wochenschrift 43 (5), 101-102.\n* 1904 Samuel Prescott describes the bactericide effects Massachusetts Institute of Technology (MIT)S.C. Prescott, The effect of radium rays on the colon bacillus, the diphtheria bacillus and yeast. Science XX(1904) no.503, 246-248\n* 1906 Appleby & Banks: UK patent to use radioactive isotopes to irradiate particulate food in a flowing bedAppleby, J. and Banks, A. J. Improvements in or relating to the treatment of food, more especially cereals and their products. British patent GB 1609 (January 4, 1906).\n* 1918 Gillett: U.S. Patent to use X-rays for the preservation of foodD.C. Gillet, Apparatus for preserving organic materials by the use of x-rays, US Patent No. 1,275,417 (August 13, 1918)\n* 1921 Schwartz describes the elimination of Trichinella from food\n* 1930 Wuest: French patent on food irradiationO. Wüst, Procédé pour la conservation d'aliments en tous genres, Brevet d'invention no.701302 (July 17, 1930)\n* 1943 MIT becomes active in the field of food preservation for the U.S. ArmyPhysical Principles of Food Preservation: Von Marcus Karel, Daryl B. Lund, CRC Press, 2003 , S. 462 ff.\n* 1951 U.S. Atomic Energy Commission begins to co-ordinate national research activities\n* 1958 World first commercial food irradiation (spices) at Stuttgart, GermanyK.F. Maurer, Zur Keimfreimachung von Gewürzen, Ernährungswirtschaft 5(1958) nr.1, 45-47\n* 1970 Establishment of the International Food Irradiation Project (IFIP), headquarters at the Federal Research Centre for Food Preservation, Karlsruhe, Germany\n* 1980 FAO/IAEA/WHO Joint Expert Committee on Food Irradiation recommends the clearance generally up to 10 kGy \"overall average dose\"\n* 1981/1983 End of IFIP after reaching its goals\n* 1983 Codex Alimentarius General Standard for Irradiated Foods: any food at a maximum \"overall average dose\" of 10 kGy\n* 1984 International Consultative Group on Food Irradiation (ICGFI) becomes the successor of IFIP\n* 1998 The European Union's Scientific Committee on Food (SCF) voted \"positive\" on eight categories of irradiation applications[http://ec.europa.eu/food/fs/sc/scf/out15_en.html Scientific Committee on Food. 15.]  \n* 1997 FAO/IAEA/WHO Joint Study Group on High-Dose Irradiation recommends to lift any upper dose limit\n* 1999 The European Union issues Directives 1999/2/EC (framework Directive) and 1999/3/EC (implementing Directive) limiting irradiation a positive list whose sole content is one of the eight categories approved by the SFC, but allowing the individual states to give clearances for any food previously approved by the SFC.\n* 2000 Germany leads a veto on a measure to provide a final draft for the positive list.\n* 2003 Codex Alimentarius General Standard for Irradiated Foods: no longer any upper dose limit\n* 2003 The SCF adopts a \"revised opinion\" that recommends against the cancellation of the upper dose limit.[http://ec.europa.eu/food/fs/sc/scf/out193_en.pdf Scientific Committee on Food. Revised opinion #193.] \n* 2004 ICGFI ends\n* 2011 The successor to the SFC, European Food Safety Authority (EFSA), reexamines the SFC's list and makes further recommendations for inclusion.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Food irradiation" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15374" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Food irradiation is the process of exposing foodstuffs to ionizing radiation. Ionizing radiation is energy that can be transmitted without direct contact to the source of the energy (radiation) capable of freeing electrons from their atomic bonds (ionization) in the targeted food.anon., Food Irradiation – A technique for preserving and improving the safety of food, WHO, Geneva, 1991[http://www.inspection.gc.ca/food/information-for-consumers/fact-sheets/irradiation/eng/1332358607968/1332358680017 \"Food Irradiation\"] Canadian Food Inspection Agency. March 22, 2014. This treatment is used to preserve food, reduce the risk of food borne illness, prevent the spread of invasive pests, and delay or eliminate sprouting or ripening. Irradiated food does not become radioactive. The radiation can be emitted by a radioactive substance or generated electrically.\n\nIrradiation is also used for non-food applications, such as medical devices.\n\nAlthough consumer perception of foods treated with irradiation is more negative than those processed by other means, a large amount of independent research has confirmed irradiation to be safe. One family of chemicals (2ACB's) are uniquely formed by irradiation (unique radiolytic products), and this product is nontoxic. When irradiating food, all other chemicals occur in a lower or comparable frequency to other food processing techniques.anon., Safety and nutritional adequacy of irradiated food, WHO, Geneva, 1994anon., Scientific Opinion on the Chemical Safety of Irradiation of Food, EFSA Journal 2011;9(4):1930 [57 pp.].  last visited March 3, 2013\n\nFood irradiation is permitted by over 60 countries, with about 500,000 metric tons of food annually processed worldwide. The regulations that dictate how food is to be irradiated, as well as the food allowed to be irradiated, vary greatly from country to country. In Austria, Germany, and many other countries of the European Union only dried herbs, spices, and seasonings can be processed with irradiation and only at a specific dose, while in Brazil all foods are allowed at any dose.Food irradiation, Position of ADA, J Am Diet Assoc. 2000;100:246-253.  retrieved November 15, 2007C.M. Deeley, M. Gao, R. Hunter, D.A.E. Ehlermann, The development of food irradiation in the Asia Pacific, the Americas and Europe; tutorial presented to the International Meeting on Radiation Processing, Kuala Lumpur, 2006. https://web.archive.org/web/20110726172416/http://www.iiaglobal.org/index.php?mactNews%2Ccntnt01%2Cdetail%2C0&cntnt01articleid\n488&cntnt01detailtemplateresourceCenter-publication-detail-template&cntnt01returnid\n231&hlen_US last visited February 18, 2010Kume, T. et al., Status of food irradiation in the world, Radiat.Phys.Chem. 78(2009), 222-226Farkas, J. et al., History and future of food irradiation, Trends Food Sci. Technol. 22 (2011), 121-126\n\nUses\n\nIrradiation is used to reduce or eliminate the risk of food bourne illnesses, prevent or slow down spoilage, arrest maturation or sprouting and as a treatment against pests. Depending on the dose, some or all of the pathogenic organisms, microorganisms, bacteria, and viruses present are destroyed, slowed down, or rendered incapable of reproduction. Irradiation cannot revert spoiled or over ripened food to a fresh state. If this food was processed by irradiation, further spoilage would cease and ripening would slow down, yet the irradiation would not destroy the toxins or repair the texture, color, or taste of the food. When targeting bacteria, most foods are irradiated to significantly reduce the number of active microbes, not to sterilize all microbes in the product. In this respect it is similar to pasteurization.\n\nIrradiation is used to create safe foods for people at high risk of infection, or for conditions where food must be stored for long periods of time and proper storage conditions are not available. Foods that can tolerate irradiation at sufficient doses are treated to ensure that the product is completely sterilized. This is most commonly done with rations for astronauts, and special diets for hospital patients.\n\nIrradiation is used to create shelf-stable products. Since irradiation reduces the populations of spoilage microorganisms, and because pre-packed food can be irradiated, the packaging prevents recontamination into the final product.\n\nIrradiation is used to reduce post-harvest losses. It reduces populations of spoilage micro-organisms in the food and can slow down the speed at which enzymes change the food, and therefore slows spoilage and ripening, and inhibits sprouting (e.g., of potato, onion, and garlic).\n\nFood is also irradiated to prevent the spread of invasive pest species through trade in fresh vegetables and fruits, either within countries, or trade across international boundaries. Pests such as insects could be transported to new habitats through trade in fresh produce which could significantly affect agricultural production and the environment were they to establish themselves. This \"phytosanitary irradiation\"http://journals.fcla.edu/flaent/article/view/88667 aims to render any hitch-hiking pest incapable of breeding. The pests are sterilized when the food is treated by low doses of irradiation. In general, the higher doses required to destroy pests such as insects, mealybugs, mites, moths, and butterflies either affect the look or taste, or cannot be tolerated by fresh produce.Joint FAO/IAEA Division of Nuclear Techniques in Food and Agriculture, IAEA, International Database on Insect Disinfestation and Sterilization – IDIDAS – http://www-ididas.iaea.org/IDIDAS/default.htm last visited November 16, 2007 Low dosage treatments (less than 1000 gray) enables trade across quarantine boundarieshttp://www.ingentaconnect.com/contentone/sphs/sphr/2015/00000011/00000003/art00008 and may also help reduce spoilage.\n\nPublic perception\n\nIrradiation has been approved by many countries. For example, in the U.S. the FDA has approved food irradiation for over fifty years. However, in the past decade the major growth area is for fruits and vegetables that are irradiated to prevent the spread of pests. In the early 2000s in the US, irradiated meat was common at some grocery stores, but because of lack of consumer demand, it is no longer common. Because consumer demand for irradiated food is low, reducing the spoilage between manufacture and consumer purchase and reducing the risk of food borne illness is currently not sufficient incentive for most manufactures to supplement their process with irradiation.Martin, Andrew. [https://www.nytimes.com/2009/02/02/business/02irradiate.html?adxnnl\n1&adxnnlx=1261545694-KGCNC1z9SSW95acAk0gz0g Spinach and Peanuts, With a Dash of Radiation.] New York Times. February 1, 2009. Nevertheless, food irradiation does take place commercially and volumes are in general increasing at a slow rate, even in the European Union where all member countries allow the irradiation of dried herbs spices and vegetable seasonings but only a few allow other foods to be sold as irradiated.https://ec.europa.eu/food/safety/biosafety/irradiation/reports_en\n\nAlthough there are some consumers who choose not to purchase irradiated food, a sufficient market has existed for retailers to have continuously stocked irradiated products for years.P. B. Roberts and Y. M. Hénon, Consumer response to irradiated food: purchase versus perception, Stewart Postharvest Review, September 2015, Vol. 11 (3:5), . http://www.foodirradiation.org/pages/Stewart/Roberts.pdf \nWhen labeled irradiated food is offered for retail sale, these consumers buy it and re-purchase it, indicating that it is possible to successfully market irradiated foods, therefore retailers not stocking irratiated foods might be a major bottleneck to wider adption of irrated foods. It is however, widely believed that consumer perception of foods treated with irradiation is more negative than those processed by other meansConley, S.T., What do consumers think about irradiated foods, FSIS Food Safety Review (Fall 1992), 11-15 and some industry studies indicate the number of consumers concerned about the safety of irradiated food decreased between 1985 and 1995 to levels comparable to those of people concerned about food additives and preservatives.Consumer Attitudes and Market Response to Irradiated Food, Author: Bruhn, Christine M.1 Journal of Food Protection, Volume 58, Number 2, February 1995, pp. 175–181(7), Publisher: International Association for Food Protection Even though is it is untrue \"People think the product is radioactive,\" said Harlan Clemmons, president of Sadex, a food irradiation company based in Sioux City, Iowa.[https://www.nytimes.com/2008/08/22/health/policy/22spinach.html?ex\n1377144000&en4d87f8791e3baa62&ei\n5124&partnerpermalink&exprod\npermalink Harris, Gardinier, \"F.D.A. Allows Irradiation of Some Produce\", The New York Times, August 22, 2008.] Because of these concerns and the increased cost of irradiated foods, there is not a widespread public demand for the irradiation of foods for human consumption.\n\nImpact\n\nIrradiation reduces the risk of infection and spoilage, does not make food radioactive, and the food is shown to be safe, but it does cause chemical reactions that alter the food and therefore alters the chemical makeup, nutritional content, and the sensory qualities of the food. Some of the potential secondary impacts of irradiation are hypothetical, while others are demonstrated. These effects include cumulative impacts to pathogens, people, and the environment due to the reduction of food quality, the transpiration and storage of radioactive goods, and destruction of pathogens, changes in the way we relate to food and how irradiation changes the food production and shipping industries.\n\nImmediate effects\n\nThe radiation source supplies energetic particles or waves. As these waves/particles pass through a target material they collide with other particles. Around the sites of these collisions chemical bonds are broken, creating short lived radicals (e.g. the hydroxyl radical, the hydrogen atom and solvated electrons). These radicals cause further chemical changes by bonding with and or stripping particles from nearby molecules. When collisions damage DNA or RNA, effective reproduction becomes unlikely, also when collisions occur in cells, cell division is often suppressed.\n\nIrradiation (within the accepted energy limits, as 10 MeV for electrons, 5 MeV for X-rays [US 7.5 MeV] and gamma rays from Cobalt-60)  can not make food radioactive, but it does produce radiolytic products, and free radicals in the food. A few of these products are unique, but not considered dangerous.\n\nIrradiation can also alter the nutritional content and flavor of foods, much like cooking. The scale of these chemical changes is not unique. Cooking, smoking, salting, and other less novel techniques, cause the food to be altered so drastically that its original nature is almost unrecognizable, and must be called by a different name. Storage of food also causes dramatic chemical changes, ones that eventually lead to deterioration and spoilage.\n\nMisconceptions\n\nA major concern is that irradiation might cause chemical changes that are harmful to the consumer. Several national expert groups and two international expert groups evaluated the available data and concluded that any food at any dose is wholesome and safe to consume as long as it remains palatable and maintains its technical properties (e.g. feel, texture, or color).\n\nIrradiated food does not become radioactive, just as an object exposed to light does not start producing light. Radioactivity is the ability of a substance to emit high energy particles. When particles hit the target materials they may free other highly energetic particles. This ends shortly after the end of the exposure, much like objects stop reflecting light when the source is turned off and warm objects emit heat until they cool down but do not continue to produce their own heat. To modify a material so that it keeps emitting radiation (induce radiation) the atomic cores (nucleus) of the atoms in the target material must be modified.\n\nIt is impossible for food irradiators to induce radiation in a product. Irradiators emit electrons or photons and the radiation is intrinsically radiated at precisely known strengths (wavelengths for photons, and speeds for electrons). These radiated particles at these strengths can never be strong enough to modify the nucleus of the targeted atom in the food, regardless of how many particles hit the target material, and radioactivity can not be induced without modifying the nucleus.\n\nChemical changes\n\nCompounds known as free radicals form when food is irradiated. Most of these are oxidizers (i.e., accept electrons) and some react very strongly. According to the free-radical theory of aging excessive amounts of these free radicals can lead to cell injury and cell death, which may contribute to many diseases. However, this generally relates to the free radicals generated in the body, not the free radicals consumed by the individual, as much of these are destroyed in the digestive process.\n\nWhen fatty acids are irradiated, a family of compounds called 2-alkylcyclobutanones (2-ACBs) are produced. These are thought to be unique radiolytic products. Most of the substances found in irradiated food are also found in food that has been subjected to other food processing treatments, and are therefore not unique. Furthermore, the quantities in which they occur in irradiated food are lower or similar to the quantities formed in heat treatments.\n\nThe radiation doses to cause toxic changes are much higher than the doses used to during irradiation, and taking into account the presence of 2-ACBs along with what is known of free radicals, these results lead to the conclusion that there is no significant risk from radiolytic products.\n\nFood quality\n\nIonizing radiation can change food quality but in general very high levels of radiation treatment (many thousands of gray) are necessary to adversely change nutritional content, as well as the sensory qualities (taste, appearance, and texture). Irradiation to the doses used commercially to treat food have very little negative impact on the sensory qualities and nutrient content in foods. When irradiation is used to maintain food quality for a longer period of time (improve the shelf stability of some sensory qualities and nutrients) the improvement means that more consumers have access to the original taste, texture, appearance, and nutrients. The changes in quality and nutrition depend on the degree of treatment and may vary greatly from food to food.\n\nThere has been low level gamma irradiation that has been attempted on arugula, spinach, cauliflower,Vaishnav, J., Adiani, V., & Variyar, P. S. (2015). Radiation processing for enhancing shelf life and quality characteristics of minimally processed ready-to-cook (RTC) cauliflower (Brassica oleracea). Food Packaging and Shelf Life, 5, 50–55. ash gourd,Tripathi, J., Chatterjee, S., Vaishnav, J., Variyar, P. S., & Sharma, A. (2013). Gamma irradiation increases storability and shelf life of minimally processed ready-tocook (RTC) ash gourd (Benincasa hispida) cubes. Postharvest Biology and Technology, 76, 17–25. bamboo shoots,Zeng, F., Luo, Z., Xie, J., & Feng, S. (2015). Gamma radiation control quality and lignification of bamboo shoots (Phyllostachys praecox f. prevernalis.) stored at low temperature. Postharvest Biology and Technology, 102, 17–24. coriander, parsley, and watercress.  There has been limited information, however, regarding the physical, chemical and/or bioactive properties and the shelf life on these minimally processed vegetables.\n\nOrganic advocacy groups believe that irradiated food should not be labeled as raw because the process changes the nutritional content of food.[https://www.centerforfoodsafety.org/issues/1039/food-irradiation/labeling-of-irradiated-foods Labeling of Irradiated Foods] However, the degradation of vitamins caused by irradiation is similar to or even less than the loss caused by other raw food preservation processes. Other processes like chilling, freezing, drying, and heating also result in some vitamin loss.\n\nThe changes in the flavor of fatty foods like meats, nuts and oils are sometimes noticeable, while the changes in lean products like fruits and vegetables are less so. Some studies by the irradiation industry show that for some properly treated fruits and vegetables irradiation is seen by consumers to improve the sensory qualities of the product compared to untreated fruits and vegetables.\n\nQuality Impact on Minimally Processed Vegetables\n\nWatercress (Nasturtium Officinale) is a rapidly growing aquatic or semi aquatic perennial plant.  It contains health promoting phytochemicals endowed in therapeutic properties.Rose, P., Won, Y. K., Ong, C. N., & Whiteman, M. (2005). Beta-phenylethyl and 8- methylsulphinyloctyl isothiocyanates, constituents of watercress, suppress LPS induced production of nitric oxide and prostaglandin E2 in RAW 264.7 macrophages. Nitric Oxide, 12, 237–243 Because chemical agents do not provide efficient microbial reductions, watercress has been tested with gamma irradiation treatment in order to improve both safety and the shelf life of the product.Ramos, B., Miller, F. A., Brandão, T. R. S., Teixeira, P., & Silva, C. L. M. (2013). Fresh fruits and vegetables – An overview on applied methodologies to improve its quality and safety. Innovative Food Science and Emerging Technologies, 20, 1–15.  It is traditionally used on horticultural products to prevent sprouting and post-packaging contamination, delay post-harvest ripening, maturation and senescence.\n\nIn a Food Chemistry food journal, scientists studied the suitability of gamma irradiation of 1, 2, and 5 kGy for preserving quality parameters of the fresh cut watercress at around 4 degrees Celsius for 7 days.  They determined that a 2 kGy dose of irradiation was the dose that contained most similar qualities to non-stored control samples, which is one of the goals of irradiation.  2 kGy preserved high levels of reducing sugars and favoured PUFA; while samples of the 5 kGy dose revealed high contents of sucrose and MUFA.  Both cases the watercress samples obtained healthier fatty acids profiles.  However, a 5kGy dose better preserved the antioxidant activity and total flavonoids.\n\nLong-term impacts\n\nIf the majority of food was irradiated at high-enough levels to significantly decrease its nutritional content, there would be an increased risk of developing nutritionally-based illnesses if additional steps, such as changes in eating habits, were not taken to mitigate this. Furthermore, for at least three studies on cats, the consumption of irradiated food was associated with a loss of tissue in the myelin sheath, leading to reversible paralysis. Researchers suspect that reduced levels of vitamin A and high levels of free radicals may be the cause. This effect is thought to be specific to cats and has not been reproduced in any other animal. To produce these effects, the cats were fed solely on food that was irradiated at a dose at least five times higher than the maximum allowable dose.\n\nIt may seem reasonable to assume that irradiating food might lead to radiation-tolerant strains, similar to the way that strains of bacteria have developed resistance to antibiotics. Bacteria develop a resistance to antibiotics after an individual uses antibiotics repeatedly. Much like pasteurization plants, products that pass through irradiation plants are processed once, and are not processed and reprocessed. Cycles of heat treatment have been shown to produce heat-tolerant bacteria, yet no problems have appeared so far in pasteurization plants. Furthermore, when the irradiation dose is chosen to target a specific species of microbe, it is calibrated to doses several times the value required to target the species. This ensures that the process randomly destroys all members of a target species. Therefore, the more irradiation-tolerant members of the target species are not given any evolutionary advantage. Without evolutionary advantage, selection does not occur. As to the irradiation process directly producing mutations that lead to more virulent, radiation-resistant strains, the European Commission's Scientific Committee on Food found that there is no evidence; on the contrary, irradiation has been found to cause loss of virulence and infectivity, as mutants are usually less competitive and less adapted.\n\nMisconceptions\n\nSome who do not advocate food irradiation argue the safety of irradiated food is not scientifically proven because there are a lack of long-term studies R.L. Wolke, What Einstein told his cook – Kitchen science explained, W.W. Norton & Company Inc., New York, 2002; see p.310 \"Some Illumination on Irradiation\" in spite of the fact that hundreds of animal feeding studies of irradiated food, including multigenerational studies, have been performed since 1950.Diehl, J.F., Safety of irradiated foods, Marcel Dekker, N.Y., 1995 (2. ed.) Endpoints investigated have included subchronic and chronic changes in metabolism, histopathology, function of most systems, reproductive effects, growth, teratogenicity, and mutagenicity. A large number of studies have been performed; meta-studies have supported the safety of irradiated food.World Health Organization. Wholesomeness of irradiated food. Geneva, Technical Report Series No. 659, 1981World Health Organization. High-Dose Irradiation: Wholesomeness of Food Irradiated With Doses Above 10 kGy. Report of a Joint FAO/IAEA/WHO Study Group. Geneva, Switzerland: World Health Organization; 1999. WHO Technical Report Series No. 890World Health Organization. Safety and Nutritional Adequacy of Irradiated Food. Geneva, Switzerland: World Health Organization; 1994US Department of Health, and Human Services, Food, and Drug Administration Irradiation in the production, processing, and handling of food. Federal Register 1986; 51:13376-13399\n\nThe below experiments are cited by food irradiation opponents, but either could not be verified in later experiments, could not be clearly attributed to the radiation effect, or could be attributed to an inappropriate design of the experiment.\n* India's National Institute of Nutrition (NIN) found an elevated rate of cells with more than one set of genes (polyploidy) in humans and animals when fed wheat that was irradiated recently (within 12 weeks). Upon analysis, scientists determined that the techniques used by the NIN allowed for too much human error and statistical variation; therefore, the results were unreliable. After multiple studies by independent agencies and scientists, no correlation between polyploidy and irradiation of food could be found.\n\nIndirect effects of irradiation\n\nThe indirect effects of irradiation are the concerns and benefits of irradiation that are related to how making food irradiation a common process will change the world, with emphasis on the system of food production.\n\nIf irradiation was to become common in the food handling process there would be a reduction of the prevalence of foodborne illness and potentially the eradication of specific pathogens. However, multiple studies suggest that an increased rate of pathogen growth may occur when irradiated food is cross-contaminated with a pathogen, as the competing spoilage organisms are no longer present. This being said, cross contamination itself becomes less prevalent with an increase in usage of irradiated foods.\n\nThe ability to remove bacterial contamination through post-processing by irradiation may reduce the fear of mishandling food which could cultivate a cavalier attitude toward hygiene and result in contaminants other than bacteria. However, concerns that the pasteurization of milk would lead to increased contamination of milk were prevalent when mandatory pasteurization was introduced, but these fears never materialized after adoption of this law. Therefore, it is unlikely for irradiation to cause an increase of illness due to nonbacteria-based contamination.\n\nTreatment\n\nUp to the point where the food is processed by irradiation, the food is processed in the same way as all other food. To treat the food, they are exposed to a radioactive source, for a set period of time to achieve a desired dose. Radiation may be emitted by a radioactive substance, or by X-ray and electron beam accelerators. Special precautions are taken to ensure the food stuffs never come in contact with the radioactive substances and that the personnel and the environment are protected from exposure radiation.\nIrradiation treatments are typically classified by dose (high, medium, and low), but are sometimes classified by the effects of the treatmentD.A.E. Ehlermann, The RADURA-terminology and food irradiation, Food Control 20 (2009), 526-528,  (radappertization, radicidation and radurization). Food irradiation is sometimes referred to as \"cold pasteurization\"Cold Pasteurization of Food By Irradiation by Tim Roberts, Extension Specialist, Food Safety, Virginia Tech; Publication Number 458-300, posted August 1998  retrieved on November 15, 2007  or \"electronic pasteurization\"See, e.g., The Truth about Irradiated Meat, CONSUMER REPORTS 34-37 (August 2003). because ionizing the food does not heat the food to high temperatures during the process, and the effect is similar to heat pasteurization. The term \"cold pasteurization\" is controversial because the term may be used to disguise the fact the food has been irradiated and pasteurization and irradiation are fundamentally different processes.\n\nTreatment costs vary as a function of dose and facility usage. A pallet or tote is typically exposed for several minutes to hours depending on dose. Low-dose applications such as disinfestation of fruit range between US$0.01/lbs and US$0.08/lbs while higher-dose applications can cost as much as US$0.20/lbs.\n\nProcess\n\nTypically, when the food is being irradiated, pallets of food are exposed to a source of radiation for a specific time. Dosimeters are placed on the pallet (at various locations) of food to serve as a check and ensure that the correct dose was achieved.\nMost irradiated food is processed by gamma irradiation., however the usage of electron beam and X-ray is becoming more popular as [http://www.ichtj.waw.pl/ichtj/nukleon/back/full/vol50_2005/v50n4p179f.pdf well] [http://www.sciencedirect.com/science/article/pii/0969806X9390312I]. With gamma irradiation, special precautions are taken because gamma rays are continuously emitted by the radioactive material. In most designs, to nullify the effects of radiation, the radioisotope is lowered into a water-filled storage pool, which absorbs the radiation but does not become radioactive. This allows pallets of the products to be added and removed from the irradiation chamber and other maintenance to be done. Sometimes movable shields are used to reduce radiation levels in areas of the irradiation chamber instead of submerging the source. For x-ray and electron irradiation these precautions are not necessary as the radiation is generated by electricity, the source of the radiation can be switched off.\n\nFor x-ray, gamma ray and electron irradiation, shielding is required when the foods are being irradiated. This is done to protect workers and the environment outside of the chamber from radiation exposure. Typically permanent or movable shields are used. In some gamma irradiators the radioactive source is under water at all times, and the hermetically sealed product is lowered into the water. The water acts as the shield in this application. Because of the lower penetration depth of electron irradiation, treatment to entire industrial pallets or totes is not possible.\n\nDosimetry\n\nThe radiation absorbed dose is the amount energy absorbed per unit weight of the target material. Dose is used because, when the same substance is given the same dose, similar changes are observed in the target material. The SI unit for dose is grays (Gy or J/kg). Dosimeters are used to measure dose, and are small components that, when exposed to ionizing radiation, change measurable physical attributes to a degree that can be correlated to the dose received. Measuring dose (dosimetry) involves exposing one or more dosimeters along with the target material.K. Mehta, Radiation Processing Dosimetry – A practical manual, 2006, GEX Corporation, Centennial, US\n\nFor purposes of legislation doses are divided into low (up to 1 kGy), medium (1 kGy to 10 kGy), and high-dose applications (above 10 kGy). High-dose applications are above those currently permitted in the US for commercial food items by the FDA and other regulators around the world. Though these doses are approved for non commercial applications, such as sterilizing frozen meat for NASA astronauts (doses of 44 kGy) and food for hospital patients.\n\nTechnology\n\nElectron irradiation uses a stream of electrons accelerated by an electric voltage or radio frequency wave to a velocity close to the speed of light. Electrons have mass and negative electric charge, and therefore electron beams at the energies allowed for food irradiation do not penetrate into the product beyond several centimeters, depending on product density. Therefore, electron beams are preferred for thin products\n\nGamma irradiation involves packets of light (photons) that originate from radioactive decay of atomic nuclei. Gamma rays are used for products that are too thick for treatment with electron beams. Every radioactive element gives rise to Gamma rays with specific energies characteristic of the source element, these rays have zero mass and no electrical charge. The ones used for food irradiation are able to penetrate through food products. The radioactive isotope radioisotope cobalt-60 is used as the source in all commercial scale gamma irradiation facilities. Gamma irradiation is most widely used technology because the deeper penetration of the gamma rays enables administering treatment to entire industrial pallets or totes (reducing the need for material handling) and it is significantly less expensive than using an X-ray source. Cobalt-60 is bred from cobalt-59 using neutron irradiation in specifically designed nuclear reactors.anon., Gamma Irradiators for Radiation Processing, IAEA, Vienna, 2005 In limited applications caesium-137, a less costly alternative recovered during the processing of spent nuclear fuel, is used as a radioactive source. Insufficient quantities are available for large scale commercial use. An incident where water-soluble caesium-137 leaked into the source storage pool requiring NRC intervention has led to near elimination of this radioisotope.\n\nIrradiation by X-ray is similar to irradiation by gamma rays but the rays produced have a distribution of energetic packets of light, still the maximum energy of the produced X-ray photon is limited by the energy put into the X-ray generator therefore it is possible to guarantee that no partials capable of inducing irradiation can be emitted. X-rays are generated by colliding accelerated electrons with a dense target material (this process is known as bremsstrahlung-conversion), and the X-rays so produced have a spectrum characteristic of the dense target material. Heavy metals, such as tantalum and tungsten, are used because of their high\natomic numbers and high melting temperatures. Tantalum is usually preferred versus tungsten for industrial, large-area, high-power targets because it is more workable than tungsten and has a higher threshold energy for induced reactions. Like electron beams, X-rays do not necessitate the use of radioactive materials and can be switched off when not needed.\nX-rays ability to penetrate the target is similar to gamma irradiation. X-ray machines produce better dose uniformity than Gamma rays, and their penetration depth is similar to slightly\ngreater than that of gamma rays, but they require much more electricity as only as much as 12% of the input energy is converted into X-rays.\n\nCost\n\nThe cost of food irradiation is influenced by dose requirements, the food's tolerance of radiation, handling conditions, i.e., packaging and stacking requirements, construction costs, financing arrangements, and other variables particular to the situation.(Forsythe and Evangel 1993, USDA 1989) Irradiation is a capital-intensive technology requiring a substantial initial investment, ranging from $1 million to $5 million. In the case of large research or contract irradiation facilities, major capital costs include a radiation source, hardware (irradiator, totes and conveyors, control systems, and other auxiliary equipment), land (1 to 1.5 acres), radiation shield, and warehouse. Operating costs include salaries (for fixed and variable labor), utilities, maintenance, taxes/insurance, cobalt-60 replenishment, general utilities, and miscellaneous operating costs.(Kunstadt et al., USDA 1989) Perishable food items, like fruits, vegetables and meats would still require to be handled in the cold chain, so all other supply chain costs remain the same.\n\nStandards & regulations\n\nThe Codex Alimentarius represents the global standard for irradiation of food, in particular under the WTO-agreement. Member states are free to convert those standards into national regulations at their discretion, therefore regulations about irradiation differ from country to country.\n\nThe United Nations Food and Agricultural Organization (FAO) has passed a motion to commit member states to implement irradiation technology for their national phytosanitary programs; the General assembly of the International Atomic Energy Agency (IAEA) has urged wider use of the irradiation technology.\n\nLabeling\n\nThe provisions of the Codex Alimentarius are that any \"first generation\" product must be labeled \"irradiated\" as any product derived directly from an irradiated raw material; for ingredients the provision is that even the last molecule of an irradiated ingredient must be listed with the ingredients even in cases where the unirradiated ingredient does not appear on the label. The RADURA-logo is optional; several countries use a graphical version that differs from the Codex-version. The suggested rules for labeling is published at CODEX-STAN – 1 (2005), and includes the usage of the Radura symbol for all products that contain irradiated foods. The Radura symbol is not a designator of quality. The amount of pathogens remaining is based upon dose and the original content and the dose applied can vary on a product by product basis.\n\nThe European Union follows the Codex's provision to label irradiated ingredients down to the last molecule of irradiated food. The European Community does not provide for the use of the Radura logo and relies exclusively on labeling by the appropriate phrases in the respective languages of the Member States. The European Union enforces its irradiation labeling laws by requiring its member countries to perform tests on a cross section of food items in the market-place and to report to the European Commission. The results are published annually in the OJ of the European Communities.http://ec.europa.eu/food/food/biosafety/irradiation/scientific_advices_reports_en.htm\n Expand \"Food Irradiation Reports\" and select respective annual report and language\n\nThe US defines irradiated foods as foods in which the irradiation causes a material change in the food, or a material change in the consequences that may result from the use of the food. Therefore, food that is processed as an ingredient by a restaurant or food processor is exempt from the labeling requirement in the US. This definition is not consistent with the Codex Alimentarius. All irradiated foods must bear a slightly modified Radura symbol at the point of sale and use the term \"irradiated\" or a derivative there of, in conjunction with explicit language describing the change in the food or its conditions of use.\n\nFood safety\n\nIn 2003, the Codex Alimentarius removed any upper dose limit for food irradiation as well as clearances for specific foods, declaring that all are safe to irradiate. Countries such as Pakistan and Brazil have adopted the Codex without any reservation or restriction. Other countries, including New Zealand, Australia, Thailand, India, and Mexico, have permitted the irradiation of fresh fruits for fruit fly quarantine purposes, amongst others.\n\nStandards that describe calibration and operation for radiation dosimetry, as well as procedures to relate the measured dose to the effects achieved and to report and document such results, are maintained by the American Society for Testing and Materials (ASTM international) and are also available as ISO/ASTM standards.(see Annual Book of ASTM Standards, vol. 12.02, West Conshohocken, PA, US)\n\nAll of the rules involved in processing food are applied to all foods before they are irradiated.\n\nUnited States\n\nIn the United States, each new food is approved separately with a guideline specifying a maximum dosage; in case of quarantine applications the minimum dose is regulated. Packaging materials containing the food processed by irradiation must also undergo approval. Food irradiation in the United States is primarily regulated by the FDAFDA, Irradiation in the production, processing and handling of food. Final rule, Fed. Reg., 51: 13376-13399 (1986)\nthis is the initial and general ruling; later amendments on various details have been published in Fed. Reg. since it is considered a food additive. The United States Department of Agriculture (USDA) amends these rules for use with meat, poultry, and fresh fruit.USDA/FSIS and USDA/APHIS, various final rules on pork, poultry and fresh fruits: Fed.Reg. 51:1769–1771 (1986); 54:387-393 (1989); 57:43588-43600 (1992); and others more\n\nThe United States Department of Agriculture (USDA) has approved the use of low-level irradiation as an alternative treatment to pesticides for fruits and vegetables that are considered hosts to a number of insect pests, including fruit flies and seed weevils. Under bilateral agreements that allows less-developed countries to earn income through food exports agreements are made to allow them to irradiate fruits and vegetables at low doses to kill insects, so that the food can avoid quarantine.\n\nThe U.S. Food and Drug Administration (FDA) and the USDA have approved irradiation of the following foods and purposes:\n* Packaged refrigerated or frozen red meatanon.,[http://ccr.ucdavis.edu/irr/inus2.shtml Is this technology being used in other countries?]  retrieved on November 15, 2007 — to control pathogens (E. Coli O157:H7 and Salmonella), and to extend shelf life.\n* Packaged poultry — control pathogens (Salmonella and Camplylobacter).\n* Fresh fruits, vegetables and grains — to control insects and inhibit growth, ripening and sprouting.\n* Pork — to control trichinosis.\n* Herbs, spices and vegetable seasoningsanon., [http://ccr.ucdavis.edu/irr/inus1.shtml Are irradiated foods in the U.S. supermarkets now?]  retrieved on November 15, 2007 — to control insects and microorganisms.\n* Dry or dehydrated enzyme preparations — to control insects and microorganisms.\n* White potatoes — to inhibit sprout development.\n* Wheat and wheat flour — to control insects.\n* Loose or bagged fresh iceberg lettuce and spinach\n\nEuropean Union\n\nEuropean law dictates that all member countries must allow the sale of irradiated dried aromatic herbs, spices and vegetable seasonings.EU: Food Irradiation – Community Legislation http://ec.europa.eu/food/food/biosafety/irradiation/comm_legisl_en.htm However, these Directives allow Member States to maintain previous clearances food categories the EC's Scientific Committee on Food (SCF) had previously approved (the approval body is now the European Food Safety Authority). Presently, Belgium, Czech Republic, France, Italy, Netherlands, Poland, and the United Kingdom allow the sale of many different types of irradiated foods. Before individual items in an approved class can be added to the approved list, studies into the toxicology of each of such food and for each of the proposed dose ranges are requested. It also states that irradiation shall not be used \"as a substitute for hygiene or health practices or good manufacturing or agricultural practice\". These Directives only control food irradiation for food retail and their conditions and controls are not applicable to the irradiation of food for patients requiring sterile diets.\n\nBecause of the Single Market of the EC any food, even if irradiated, must be allowed to be marketed in any other Member State even if a general ban of food irradiation prevails, under the condition that the food has been irradiated legally in the state of origin.\nFurthermore, imports into the EC are possible from third countries if the irradiation facility had been inspected and approved by the EC and the treatment is legal within the EC or some Member state.\n\nAustralia\n\nAustralia banned irradiated cat food after a national scare where cats suffered from paralyzation after eating a specific brand of highly irradiated catfood for an extended period of time. The suspected culprit was malnutrition from consuming food depleted of Vitamin A by the irradiation process.http://www.smh.com.au/national/catfood-irradiation-banned-as-pet-theory-proved-20090529-bq8h.htmlhttp://kb.rspca.org.au/What-is-RSPCA-Australias-position-on-the-irradiation-of-imported-pet-food-products_307.html The incident was linked only to a single batch of one brand's product and no illness was linked to any of that brand's other irradiated batches of the same product or to any other brand of irradiated cat food. This, along with incomplete evidence indicating that the cat food was not sufficiently depleted of Vitamin A makes irradiation a less likely cause. Further research has been able to experimentally induce the paralyzation of cats by via Vitamin A deficiency by feeding highly irradiated food. For more details see the Long term impacts section.\n\nNuclear safety and security\n\nInterlocks and safeguards are mandated to minimize this risk. There have been radiation-related accidents, deaths, and injury at such facilities, many of them caused by operators overriding the safety related interlocks.International Atomic Energy Agency. [http://www-pub.iaea.org/MTCD/publications/PDF/Pub925_web.pdf The Radiological Accident in Soreq] In a radiation processing facility, radiation specific concerns are supervised by special authorities, while \"Ordinary\" occupational safety regulations are handled much like other businesses.\n\nThe safety of irradiation facilities is regulated by the United Nations International Atomic Energy Agency and monitored by the different national Nuclear Regulatory Commissions. The regulators enforce a safety culture that mandates that all incidents that occur are documented and thoroughly analyzed to determine the cause and improvement potential. Such incidents are studied by personnel at multiple facilities, and improvements are mandated to retrofit existing facilities and future design.\n\nIn the US the Nuclear Regulatory Commission (NRC) regulates the safety of the processing facility, and the United States Department of Transportation (DOT) regulates the safe transport of the radioactive sources.\n\nIrradiated food supply\n\nAuthorities in some countries use tests that can detect the irradiation of food items to enforce labeling standards and to bolster consumer confidence.McMurray, C.H., Gray, R., Stewart, E.M., Pearce, J., Detection methods for irradiated foods, Royal Society of Chemistry; Cambridge (GB); 1996Raffi, J., Delincée, H., Marchioni, E., Hasselmann, C., Sjöberg, A.-M., Leonardi, M., Kent, M., Bögl, K.-W., Schreiber, G., Stevenson, H., Meier, W., Concerted action of the community bureau of reference on methods of identification of irradiated foods; bcr information; European Commission; Luxembourg; 1994, 119 p.; EUR--15261  The European Union monitors the market to determine the quantity of irradiated foods, if irradiated foods are labeled as irradiated, and if the irradiation is performed at approved facilities.\n\nIrradiation of fruits and vegetables to prevent the spread of pest and diseases across borders has been increasing globally. In 2010, 18446 tonnes of fruits and vegetables were irradiated in six countries for export quarantine control; the countries follow: Mexico (56.2%), United States (31.2%), Thailand (5.18%), Vietnam (4.63%), Australia (2.69%), and India (0.05%). The three types of fruits irradiated the most were guava (49.7%), sweet potato(29.3%) and sweet lime (3.27%).\n\nIn total, 103 000 tonnes of food products were irradiated on mainland United States in 2010. The three types of foods irradiated the most were spices (77.7%), fruits and vegetables (14.6%) and meat and poultry (7.77%). 17 953 tonnes of irradiated fruits and vegetables were exported to the mainland United States. Mexico, the United States' state of Hawaii, Thailand, Vietnam and India export irradiated produce to the mainland U.S. Mexico, followed by the United States' state of Hawaii, is the largest exporter of irradiated produce to the mainland U.S.\n\nIn total, 6 876 tonnes of food products were irradiated in European Union countries in 2013; mainly in four member state countries: Belgium (49.4%), the Netherlands (24.4%), Spain (12.7%) and France (10.0%). The two types of foods irradiated the most were frog legs (46%), and dried herbs and spices (25%). There has been a decrease of 14% in the total quantity of products irradiated in the EU compared to the previous year 2012 (7 972 tonnes) \n\nTimeline of the history of food irradiation\n\n* 1895 Wilhelm Conrad Röntgen discovers X-rays (\"bremsstrahlung\", from German for radiation produced by deceleration)\n* 1896 Antoine Henri Becquerel discovers natural radioactivity; Minck proposes the therapeutic useMinck, F. (1896) Zur Frage über die Einwirkung der Röntgen'schen Strahlen auf Bacterien und ihre eventuelle therapeutische Verwendbarkeit. Münchener Medicinische Wochenschrift 43 (5), 101-102.\n* 1904 Samuel Prescott describes the bactericide effects Massachusetts Institute of Technology (MIT)S.C. Prescott, The effect of radium rays on the colon bacillus, the diphtheria bacillus and yeast. Science XX(1904) no.503, 246-248\n* 1906 Appleby & Banks: UK patent to use radioactive isotopes to irradiate particulate food in a flowing bedAppleby, J. and Banks, A. J. Improvements in or relating to the treatment of food, more especially cereals and their products. British patent GB 1609 (January 4, 1906).\n* 1918 Gillett: U.S. Patent to use X-rays for the preservation of foodD.C. Gillet, Apparatus for preserving organic materials by the use of x-rays, US Patent No. 1,275,417 (August 13, 1918)\n* 1921 Schwartz describes the elimination of Trichinella from food\n* 1930 Wuest: French patent on food irradiationO. Wüst, Procédé pour la conservation d'aliments en tous genres, Brevet d'invention no.701302 (July 17, 1930)\n* 1943 MIT becomes active in the field of food preservation for the U.S. ArmyPhysical Principles of Food Preservation: Von Marcus Karel, Daryl B. Lund, CRC Press, 2003 , S. 462 ff.\n* 1951 U.S. Atomic Energy Commission begins to co-ordinate national research activities\n* 1958 World first commercial food irradiation (spices) at Stuttgart, GermanyK.F. Maurer, Zur Keimfreimachung von Gewürzen, Ernährungswirtschaft 5(1958) nr.1, 45-47\n* 1970 Establishment of the International Food Irradiation Project (IFIP), headquarters at the Federal Research Centre for Food Preservation, Karlsruhe, Germany\n* 1980 FAO/IAEA/WHO Joint Expert Committee on Food Irradiation recommends the clearance generally up to 10 kGy \"overall average dose\"\n* 1981/1983 End of IFIP after reaching its goals\n* 1983 Codex Alimentarius General Standard for Irradiated Foods: any food at a maximum \"overall average dose\" of 10 kGy\n* 1984 International Consultative Group on Food Irradiation (ICGFI) becomes the successor of IFIP\n* 1998 The European Union's Scientific Committee on Food (SCF) voted \"positive\" on eight categories of irradiation applications[http://ec.europa.eu/food/fs/sc/scf/out15_en.html Scientific Committee on Food. 15.]  \n* 1997 FAO/IAEA/WHO Joint Study Group on High-Dose Irradiation recommends to lift any upper dose limit\n* 1999 The European Union issues Directives 1999/2/EC (framework Directive) and 1999/3/EC (implementing Directive) limiting irradiation a positive list whose sole content is one of the eight categories approved by the SFC, but allowing the individual states to give clearances for any food previously approved by the SFC.\n* 2000 Germany leads a veto on a measure to provide a final draft for the positive list.\n* 2003 Codex Alimentarius General Standard for Irradiated Foods: no longer any upper dose limit\n* 2003 The SCF adopts a \"revised opinion\" that recommends against the cancellation of the upper dose limit.[http://ec.europa.eu/food/fs/sc/scf/out193_en.pdf Scientific Committee on Food. Revised opinion #193.] \n* 2004 ICGFI ends\n* 2011 The successor to the SFC, European Food Safety Authority (EFSA), reexamines the SFC's list and makes further recommendations for inclusion. Food irradiation. http://en.wikipedia.org/?curid=15374."
  }
}
