{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13805",
  "eid" : "0d75a430-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778531827,
  "textBody" : "The Staufer, also known as the House of Staufen, or of Hohenstaufen, were a dynasty of German kings (1138–1254) during the Middle Ages. Besides Germany, they also ruled the Kingdom of Sicily (1194–1268). In Italian historiography, they are known as the Svevi (Swabians), since they were (successive) dukes of Swabia from 1079. Three members of the dynasty—Frederick I, Henry VI and Frederick II—were crowned Holy Roman Emperor.\n\nName\n\nThe dynasty is named for their seat at Hohenstaufen Castle, which was in turn named for a nearby conical hill of the Swabian Jura with the name Hohenstaufen (now in Göppingen, Baden-Württemberg).The name \"Staufen\" derives from Stauf (formerly stouf and akin to Early Modern English stoup), meaning \"chalice\", and was commonly applied to conical hills in Swabia in the Middle Ages. \n\nThe historical form of the name is Staufen. The form Hohenstaufen (\"high Staufen\") is modern (19th century), introduced for disambiguation from other castles with the same name. In more recent literature, the historical name Staufen seems to regain prominence.\n\nOrigins\n\nThe noble family first appeared in the late 10th century in the Swabian Riesgau region around the former Carolingian court of Nördlingen. A local count Frederick (d. about 1075) is mentioned as progenitor in a pedigree drawn up by Abbot Wibald of Stavelot at the behest of Emperor Frederick Barbarossa in 1153. He held the office of a Swabian count palatine; his son Frederick of Buren (c.1020–1053) married Hildegard of Egisheim-Dagsburg (d. 1094/95), a niece of Pope Leo IX. Their son Frederick I was appointed Duke of Swabia at Hohenstaufen Castle by the Salian king Henry IV of Germany in 1079. \n\nAt the same time, Duke Frederick I was engaged to the king's approximately seventeen-year-old daughter, Agnes. Nothing is known about Frederick's life before this event, but he proved to be an imperial ally throughout Henry's struggles against other Swabian lords, namely Rudolf of Rheinfelden, Frederick's predecessor, and the Zähringen and Welf lords.  Frederick's brother Otto was elevated to the Strasbourg bishopric in 1082.\n\nUpon Frederick's death, he was succeeded by his son, Duke Frederick II, in 1105.  Frederick II remained a close ally of the Salians, he and his younger brother Conrad were named the king's representatives in Germany when the king was in Italy.  Around 1120, Frederick II married Judith of Bavaria from the rival House of Welf.\n\nRuling in Germany\n\nWhen the last male member of the Salian dynasty, Emperor Henry V, died without heirs in 1125, a controversy arose about the succession. Duke Frederick II and Conrad, the two current male Staufers, by their mother Agnes, were grandsons of late Emperor Henry IV and nephews of Henry V. Frederick attempted to succeed to the throne of the Holy Roman Emperor (formally known as the King of the Romans) through a customary election, but lost to the Saxon duke Lothair of Supplinburg. A civil war between Frederick's dynasty and Lothair's ended with Frederick's submission in 1134. After Lothair's death in 1137, Frederick's brother Conrad was elected King as Conrad III.\n\nBecause the Welf duke Henry the Proud, son-in-law and heir of Lothair and the most powerful prince in Germany, who had been passed over in the election, refused to acknowledge the new king, Conrad III deprived him of all his territories, giving the Duchy of Saxony to Albert the Bear and that of Bavaria to Leopold IV, Margrave of Austria. In 1147, Conrad heard Bernard of Clairvaux preach the Second Crusade at Speyer, and he agreed to join King Louis VII of France in a great expedition to the Holy Land which failed.\n\nConrad's brother Duke Frederick II died in 1147, and was succeeded in Swabia by his son, Duke Frederick III. When King Conrad III died without adult heir in 1152, Frederick also succeeded him, taking both German royal and Imperial titles.\n\nFrederick Barbarossa\n\nFrederick I, known as Frederick Barbarossa because of his red beard, struggled throughout his reign to restore the power and prestige of the German monarchy against the dukes, whose power had grown both before and after the Investiture Controversy under his Salian predecessors.  As royal access to the resources of the church in Germany was much reduced, Frederick was forced to go to Italy to find the finances needed to restore the king's power in Germany. He was soon crowned emperor in Italy, but decades of warfare on the peninsula yielded scant results. The Papacy and the prosperous city-states of the Lombard League in northern Italy were traditional enemies, but the fear of Imperial domination caused them to join ranks to fight Frederick. Under the skilled leadership of Pope Alexander III, the alliance suffered many defeats but ultimately was able to deny the emperor a complete victory in Italy. Frederick returned to Germany. He had vanquished one notable opponent, his Welf cousin, Duke Henry the Lion of Saxony and Bavaria in 1180, but his hopes of restoring the power and prestige of the monarchy seemed unlikely to be met by the end of his life.\n\nDuring Frederick's long stays in Italy, the German princes became stronger and began a successful colonization of Slavic lands. Offers of reduced taxes and manorial duties enticed many Germans to settle in the east in the course of the Ostsiedlung. In 1163 Frederick waged a successful campaign against the Kingdom of Poland in order to re-install the Silesian dukes of the Piast dynasty. With the German colonization, the Empire increased in size and came to include the Duchy of Pomerania. A quickening economic life in Germany increased the number of towns and Imperial cities, and gave them greater importance. It was also during this period that castles and courts replaced monasteries as centers of culture. Growing out of this courtly culture, Middle High German literature reached its peak in lyrical love poetry, the Minnesang, and in narrative epic poems such as Tristan, Parzival, and the Nibelungenlied.\n\nHenry VI\n\nFrederick died in 1190 while on the Third Crusade and was succeeded by his son, Henry VI. Elected king even before his father's death, Henry went to Rome to be crowned emperor. He married Queen Constance of Sicily, and deaths in his wife's family gave him claim of succession and possession of the Kingdom of Sicily in 1189 and 1194 respectively, a source of vast wealth. Henry failed to make royal and Imperial succession hereditary, but in 1196 he succeeded in gaining a pledge that his infant son Frederick would receive the German crown. Faced with difficulties in Italy and confident that he would realize his wishes in Germany at a later date, Henry returned to the south, where it appeared he might unify the peninsula under the Hohenstaufen name. After a series of military victories, however, he fell ill and died of natural causes in Sicily in 1197. His underage son Frederick could only succeed him in Sicily and Malta, while in the Empire the struggle between the House of Staufen and the House of Welf erupted once again.\n\nPhilip of Swabia\n\nBecause the election of a three-year-old boy to be German king appeared likely to make orderly rule difficult, the boy's uncle, Duke Philip of Swabia, brother of late Henry VI, was designated to serve in his place. Other factions however favoured a Welf candidate. In 1198, two rival kings were chosen: the Hohenstaufen Philip of Swabia and the son of the deprived Duke Henry the Lion, the Welf Otto IV. A long civil war began; Philip was about to win when he was murdered by the Bavarian count palatine Otto VIII of Wittelsbach in 1208. Pope Innocent III initially had supported the Welfs, but when Otto, now sole elected monarch, moved to appropriate Sicily, Innocent changed sides and accepted young Frederick II and his ally, King Philip II of France, who defeated Otto at the 1214 Battle of Bouvines. Frederick had returned to Germany in 1212 from Sicily, where he had grown up, and was elected king in 1215. When Otto died in 1218, Fredrick became the undisputed ruler, and in 1220 was crowned Holy Roman Emperor.\n\nPhilip changed the coat of arms from a black lion on a gold shield to three leopards, probably derived from the arms of his Welf rival Otto IV.\n\nRuling in Italy\n\nThe conflict between the Staufer dynasty and the Welf had irrevocably weakened the Imperial authority and the Norman kingdom of Sicily became the base for Staufer rule.\n\nFrederick II\n\nEmperor Frederick II spent little time in Germany as his main concerns lay in Southern Italy. He founded the University of Naples in 1224 to train future state officials and reigned over Germany primarily through the allocation of royal prerogatives, leaving the sovereign authority and imperial estates to the ecclesiastical and secular princes. He made significant concessions to the German nobles, such as those put forth in an imperial statute of 1232, which made princes virtually independent rulers within their territories. These measures favoured the further fragmentation of the Empire.\n\nBy the 1226 Golden Bull of Rimini, Frederick had assigned the military order of the Teutonic Knights to complete the conquest and conversion of the Prussian lands. A reconciliation with the Welfs took place in 1235, whereby Otto the Child, grandson of the late Saxon duke Henry the Lion, was named Duke of Brunswick and Lüneburg. The power struggle with the popes continued and resulted in Fredrick's excommunication in 1227. In 1239, Pope Gregory IX excommunicated Fredrick again, and in 1245 he was condemned as a heretic by a church council. Although Frederick was one of the most energetic, imaginative, and capable rulers of the time, he was not concerned with drawing the disparate forces in Germany together. His legacy was thus that local rulers had more authority after his reign than before it. The clergy also had become more powerful.\n\nBy the time of Frederick's death in 1250, little centralized power remained in Germany. The Great Interregnum, a period in which there were several elected rival kings, none of whom was able to achieve any position of authority, followed the death of Frederick's son King Conrad IV of Germany in 1254. The German princes vied for individual advantage and managed to strip many powers away from the diminished monarchy. Rather than establish sovereign states however, many nobles tended to look after their families. Their many male heirs created more and smaller estates, and from a largely free class of officials previously formed, many of these assumed or acquired hereditary rights to administrative and legal offices. These trends compounded political fragmentation within Germany. The period was ended in 1273 with the election of Rudolph of Habsburg, a godson of Frederick.\n\nEnd of the Staufer dynasty \n\nConrad IV was succeeded as duke of Swabia by his only son, two-year-old Conradin. By this time, the office of duke of Swabia had been fully subsumed into the office of the king, and without royal authority had become meaningless. In 1261, attempts to elect young Conradin king were unsuccessful. He also had to defend Sicily against an invasion, sponsored by Pope Urban IV (Jacques Pantaléon) and Pope Clement IV (Guy Folques), by Charles of Anjou, a brother of the French king. Charles had been promised by the popes the Kingdom of Sicily, where he would replace the relatives of Frederick II. Charles had defeated Conradin's uncle Manfred, King of Sicily in the Battle of Benevento on 26 February 1266. The king himself, refusing to flee, rushed into the midst of his enemies and was killed. Conradin's campaign to retake control ended with his defeat in 1268 at the Battle of Tagliacozzo, after which he was handed over to Charles, who had him publicly executed at Naples. With Conradin, the direct line of the Dukes of Swabia finally ceased to exist, though most of the later emperors were descended from the Staufer dynasty indirectly.\n\nDuring the political decentralization of the late Staufer period, the population had grown from an estimated 8 million in 1200 to about 14 million in 1300, and the number of towns increased tenfold. The most heavily urbanized areas of Germany were located in the south and the west. Towns often developed a degree of independence, but many were subordinate to local rulers if not immediate to the emperor. Colonization of the east also continued in the thirteenth century, most notably through the efforts of the Teutonic Knights. German merchants also began trading extensively on the Baltic.\n\nMembers of the Hohenstaufen family\n\nHoly Roman Emperors and Kings of the Romans\n\n*Conrad III, king 1138–1152\n*Frederick Barbarossa, king 1152–1190, emperor after 1155\n*Henry VI, king 1190–1197, emperor after 1191\n*Philip of Swabia, king 1198–1208\n*Frederick II, king 1208–1250, emperor after 1220\n*Henry (VII), king 1220–1235 (under his father Emperor Frederick II)\n*Conrad IV, king 1237–1254 (until 1250 under his father Emperor Frederick II)\nThe first ruling Hohenstaufen, Conrad III, like the last one, Conrad IV, was never crowned emperor. After a 20-year period (Great interregnum 1254–1273), the first Habsburg was elected king.\n\nKings of Italy\n\nNote: The following kings are already listed above as German Kings\n*Conrad III 1128–1135\n*Frederick I 1154–1190 \n*Henry VI 1191–1197\n\nKings of Sicily\n\nNote: Some of the following kings are already listed above as German Kings\n*Henry VI 1194–1197\n*Frederick 1198–1250\n**Henry (VII) 1212–1217 (nominal king under his father)\n*Conrad 1250–1254\n*Conradin 1254–1258/1268\n*Manfred 1258–1266\n\nDukes of Swabia\n\nNote: Some of the following dukes are already listed above as German Kings\n* Frederick I, Duke of Swabia (Friedrich) (r. 1079–1105)\n* Frederick II, Duke of Swabia (r. 1105–1147)\n* Frederick I, Holy Roman Emperor (Frederick III of Swabia)(r. 1147–1152) King in 1152 and Holy Roman Emperor in 1155\n* Frederick IV, Duke of Swabia (r. 1152–1167)\n* Frederick V, Duke of Swabia (r. 1167–1170)\n* Frederick VI, Duke of Swabia (r. 1170–1191)\n* Conrad II, Duke of Swabia (r. 1191–1196)\n* Philip of Swabia (r. 1196–1208) King in 1198\n* Frederick II, Holy Roman Emperor (r. 1212–1216) King in 1212 and Holy Roman Emperor in 1220\n* Henry (VII) of Germany (r. 1216–1235), King 1220–1235\n* Conrad IV (r. 1235–1254) King in 1237\n* Conrad V (Conradin) (r. 1254–1268)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hohenstaufen" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13805" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Staufer, also known as the House of Staufen, or of Hohenstaufen, were a dynasty of German kings (1138–1254) during the Middle Ages. Besides Germany, they also ruled the Kingdom of Sicily (1194–1268). In Italian historiography, they are known as the Svevi (Swabians), since they were (successive) dukes of Swabia from 1079. Three members of the dynasty—Frederick I, Henry VI and Frederick II—were crowned Holy Roman Emperor.\n\nName\n\nThe dynasty is named for their seat at Hohenstaufen Castle, which was in turn named for a nearby conical hill of the Swabian Jura with the name Hohenstaufen (now in Göppingen, Baden-Württemberg).The name \"Staufen\" derives from Stauf (formerly stouf and akin to Early Modern English stoup), meaning \"chalice\", and was commonly applied to conical hills in Swabia in the Middle Ages. \n\nThe historical form of the name is Staufen. The form Hohenstaufen (\"high Staufen\") is modern (19th century), introduced for disambiguation from other castles with the same name. In more recent literature, the historical name Staufen seems to regain prominence.\n\nOrigins\n\nThe noble family first appeared in the late 10th century in the Swabian Riesgau region around the former Carolingian court of Nördlingen. A local count Frederick (d. about 1075) is mentioned as progenitor in a pedigree drawn up by Abbot Wibald of Stavelot at the behest of Emperor Frederick Barbarossa in 1153. He held the office of a Swabian count palatine; his son Frederick of Buren (c.1020–1053) married Hildegard of Egisheim-Dagsburg (d. 1094/95), a niece of Pope Leo IX. Their son Frederick I was appointed Duke of Swabia at Hohenstaufen Castle by the Salian king Henry IV of Germany in 1079. \n\nAt the same time, Duke Frederick I was engaged to the king's approximately seventeen-year-old daughter, Agnes. Nothing is known about Frederick's life before this event, but he proved to be an imperial ally throughout Henry's struggles against other Swabian lords, namely Rudolf of Rheinfelden, Frederick's predecessor, and the Zähringen and Welf lords.  Frederick's brother Otto was elevated to the Strasbourg bishopric in 1082.\n\nUpon Frederick's death, he was succeeded by his son, Duke Frederick II, in 1105.  Frederick II remained a close ally of the Salians, he and his younger brother Conrad were named the king's representatives in Germany when the king was in Italy.  Around 1120, Frederick II married Judith of Bavaria from the rival House of Welf.\n\nRuling in Germany\n\nWhen the last male member of the Salian dynasty, Emperor Henry V, died without heirs in 1125, a controversy arose about the succession. Duke Frederick II and Conrad, the two current male Staufers, by their mother Agnes, were grandsons of late Emperor Henry IV and nephews of Henry V. Frederick attempted to succeed to the throne of the Holy Roman Emperor (formally known as the King of the Romans) through a customary election, but lost to the Saxon duke Lothair of Supplinburg. A civil war between Frederick's dynasty and Lothair's ended with Frederick's submission in 1134. After Lothair's death in 1137, Frederick's brother Conrad was elected King as Conrad III.\n\nBecause the Welf duke Henry the Proud, son-in-law and heir of Lothair and the most powerful prince in Germany, who had been passed over in the election, refused to acknowledge the new king, Conrad III deprived him of all his territories, giving the Duchy of Saxony to Albert the Bear and that of Bavaria to Leopold IV, Margrave of Austria. In 1147, Conrad heard Bernard of Clairvaux preach the Second Crusade at Speyer, and he agreed to join King Louis VII of France in a great expedition to the Holy Land which failed.\n\nConrad's brother Duke Frederick II died in 1147, and was succeeded in Swabia by his son, Duke Frederick III. When King Conrad III died without adult heir in 1152, Frederick also succeeded him, taking both German royal and Imperial titles.\n\nFrederick Barbarossa\n\nFrederick I, known as Frederick Barbarossa because of his red beard, struggled throughout his reign to restore the power and prestige of the German monarchy against the dukes, whose power had grown both before and after the Investiture Controversy under his Salian predecessors.  As royal access to the resources of the church in Germany was much reduced, Frederick was forced to go to Italy to find the finances needed to restore the king's power in Germany. He was soon crowned emperor in Italy, but decades of warfare on the peninsula yielded scant results. The Papacy and the prosperous city-states of the Lombard League in northern Italy were traditional enemies, but the fear of Imperial domination caused them to join ranks to fight Frederick. Under the skilled leadership of Pope Alexander III, the alliance suffered many defeats but ultimately was able to deny the emperor a complete victory in Italy. Frederick returned to Germany. He had vanquished one notable opponent, his Welf cousin, Duke Henry the Lion of Saxony and Bavaria in 1180, but his hopes of restoring the power and prestige of the monarchy seemed unlikely to be met by the end of his life.\n\nDuring Frederick's long stays in Italy, the German princes became stronger and began a successful colonization of Slavic lands. Offers of reduced taxes and manorial duties enticed many Germans to settle in the east in the course of the Ostsiedlung. In 1163 Frederick waged a successful campaign against the Kingdom of Poland in order to re-install the Silesian dukes of the Piast dynasty. With the German colonization, the Empire increased in size and came to include the Duchy of Pomerania. A quickening economic life in Germany increased the number of towns and Imperial cities, and gave them greater importance. It was also during this period that castles and courts replaced monasteries as centers of culture. Growing out of this courtly culture, Middle High German literature reached its peak in lyrical love poetry, the Minnesang, and in narrative epic poems such as Tristan, Parzival, and the Nibelungenlied.\n\nHenry VI\n\nFrederick died in 1190 while on the Third Crusade and was succeeded by his son, Henry VI. Elected king even before his father's death, Henry went to Rome to be crowned emperor. He married Queen Constance of Sicily, and deaths in his wife's family gave him claim of succession and possession of the Kingdom of Sicily in 1189 and 1194 respectively, a source of vast wealth. Henry failed to make royal and Imperial succession hereditary, but in 1196 he succeeded in gaining a pledge that his infant son Frederick would receive the German crown. Faced with difficulties in Italy and confident that he would realize his wishes in Germany at a later date, Henry returned to the south, where it appeared he might unify the peninsula under the Hohenstaufen name. After a series of military victories, however, he fell ill and died of natural causes in Sicily in 1197. His underage son Frederick could only succeed him in Sicily and Malta, while in the Empire the struggle between the House of Staufen and the House of Welf erupted once again.\n\nPhilip of Swabia\n\nBecause the election of a three-year-old boy to be German king appeared likely to make orderly rule difficult, the boy's uncle, Duke Philip of Swabia, brother of late Henry VI, was designated to serve in his place. Other factions however favoured a Welf candidate. In 1198, two rival kings were chosen: the Hohenstaufen Philip of Swabia and the son of the deprived Duke Henry the Lion, the Welf Otto IV. A long civil war began; Philip was about to win when he was murdered by the Bavarian count palatine Otto VIII of Wittelsbach in 1208. Pope Innocent III initially had supported the Welfs, but when Otto, now sole elected monarch, moved to appropriate Sicily, Innocent changed sides and accepted young Frederick II and his ally, King Philip II of France, who defeated Otto at the 1214 Battle of Bouvines. Frederick had returned to Germany in 1212 from Sicily, where he had grown up, and was elected king in 1215. When Otto died in 1218, Fredrick became the undisputed ruler, and in 1220 was crowned Holy Roman Emperor.\n\nPhilip changed the coat of arms from a black lion on a gold shield to three leopards, probably derived from the arms of his Welf rival Otto IV.\n\nRuling in Italy\n\nThe conflict between the Staufer dynasty and the Welf had irrevocably weakened the Imperial authority and the Norman kingdom of Sicily became the base for Staufer rule.\n\nFrederick II\n\nEmperor Frederick II spent little time in Germany as his main concerns lay in Southern Italy. He founded the University of Naples in 1224 to train future state officials and reigned over Germany primarily through the allocation of royal prerogatives, leaving the sovereign authority and imperial estates to the ecclesiastical and secular princes. He made significant concessions to the German nobles, such as those put forth in an imperial statute of 1232, which made princes virtually independent rulers within their territories. These measures favoured the further fragmentation of the Empire.\n\nBy the 1226 Golden Bull of Rimini, Frederick had assigned the military order of the Teutonic Knights to complete the conquest and conversion of the Prussian lands. A reconciliation with the Welfs took place in 1235, whereby Otto the Child, grandson of the late Saxon duke Henry the Lion, was named Duke of Brunswick and Lüneburg. The power struggle with the popes continued and resulted in Fredrick's excommunication in 1227. In 1239, Pope Gregory IX excommunicated Fredrick again, and in 1245 he was condemned as a heretic by a church council. Although Frederick was one of the most energetic, imaginative, and capable rulers of the time, he was not concerned with drawing the disparate forces in Germany together. His legacy was thus that local rulers had more authority after his reign than before it. The clergy also had become more powerful.\n\nBy the time of Frederick's death in 1250, little centralized power remained in Germany. The Great Interregnum, a period in which there were several elected rival kings, none of whom was able to achieve any position of authority, followed the death of Frederick's son King Conrad IV of Germany in 1254. The German princes vied for individual advantage and managed to strip many powers away from the diminished monarchy. Rather than establish sovereign states however, many nobles tended to look after their families. Their many male heirs created more and smaller estates, and from a largely free class of officials previously formed, many of these assumed or acquired hereditary rights to administrative and legal offices. These trends compounded political fragmentation within Germany. The period was ended in 1273 with the election of Rudolph of Habsburg, a godson of Frederick.\n\nEnd of the Staufer dynasty \n\nConrad IV was succeeded as duke of Swabia by his only son, two-year-old Conradin. By this time, the office of duke of Swabia had been fully subsumed into the office of the king, and without royal authority had become meaningless. In 1261, attempts to elect young Conradin king were unsuccessful. He also had to defend Sicily against an invasion, sponsored by Pope Urban IV (Jacques Pantaléon) and Pope Clement IV (Guy Folques), by Charles of Anjou, a brother of the French king. Charles had been promised by the popes the Kingdom of Sicily, where he would replace the relatives of Frederick II. Charles had defeated Conradin's uncle Manfred, King of Sicily in the Battle of Benevento on 26 February 1266. The king himself, refusing to flee, rushed into the midst of his enemies and was killed. Conradin's campaign to retake control ended with his defeat in 1268 at the Battle of Tagliacozzo, after which he was handed over to Charles, who had him publicly executed at Naples. With Conradin, the direct line of the Dukes of Swabia finally ceased to exist, though most of the later emperors were descended from the Staufer dynasty indirectly.\n\nDuring the political decentralization of the late Staufer period, the population had grown from an estimated 8 million in 1200 to about 14 million in 1300, and the number of towns increased tenfold. The most heavily urbanized areas of Germany were located in the south and the west. Towns often developed a degree of independence, but many were subordinate to local rulers if not immediate to the emperor. Colonization of the east also continued in the thirteenth century, most notably through the efforts of the Teutonic Knights. German merchants also began trading extensively on the Baltic.\n\nMembers of the Hohenstaufen family\n\nHoly Roman Emperors and Kings of the Romans\n\n*Conrad III, king 1138–1152\n*Frederick Barbarossa, king 1152–1190, emperor after 1155\n*Henry VI, king 1190–1197, emperor after 1191\n*Philip of Swabia, king 1198–1208\n*Frederick II, king 1208–1250, emperor after 1220\n*Henry (VII), king 1220–1235 (under his father Emperor Frederick II)\n*Conrad IV, king 1237–1254 (until 1250 under his father Emperor Frederick II)\nThe first ruling Hohenstaufen, Conrad III, like the last one, Conrad IV, was never crowned emperor. After a 20-year period (Great interregnum 1254–1273), the first Habsburg was elected king.\n\nKings of Italy\n\nNote: The following kings are already listed above as German Kings\n*Conrad III 1128–1135\n*Frederick I 1154–1190 \n*Henry VI 1191–1197\n\nKings of Sicily\n\nNote: Some of the following kings are already listed above as German Kings\n*Henry VI 1194–1197\n*Frederick 1198–1250\n**Henry (VII) 1212–1217 (nominal king under his father)\n*Conrad 1250–1254\n*Conradin 1254–1258/1268\n*Manfred 1258–1266\n\nDukes of Swabia\n\nNote: Some of the following dukes are already listed above as German Kings\n* Frederick I, Duke of Swabia (Friedrich) (r. 1079–1105)\n* Frederick II, Duke of Swabia (r. 1105–1147)\n* Frederick I, Holy Roman Emperor (Frederick III of Swabia)(r. 1147–1152) King in 1152 and Holy Roman Emperor in 1155\n* Frederick IV, Duke of Swabia (r. 1152–1167)\n* Frederick V, Duke of Swabia (r. 1167–1170)\n* Frederick VI, Duke of Swabia (r. 1170–1191)\n* Conrad II, Duke of Swabia (r. 1191–1196)\n* Philip of Swabia (r. 1196–1208) King in 1198\n* Frederick II, Holy Roman Emperor (r. 1212–1216) King in 1212 and Holy Roman Emperor in 1220\n* Henry (VII) of Germany (r. 1216–1235), King 1220–1235\n* Conrad IV (r. 1235–1254) King in 1237\n* Conrad V (Conradin) (r. 1254–1268). Hohenstaufen. http://en.wikipedia.org/?curid=13805."
  }
}
