{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18885",
  "eid" : "358d2920-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778599090,
  "textBody" : "Sean Morton Downey (December 9, 1932 – March 12, 2001), better known by his stage name Morton Downey Jr., was an American television talk show host of the late-1980s who pioneered the \"trash TV\" format on his program The Morton Downey Jr. Show. https://www.nhregister.com/news/article/Morton-Downey-Jr-trash-TV-pioneer-68-11705335.php   http://www.toptenz.net/10-pioneers-trash-television.php  https://www.channelguidemag.com/tv-news/2015/08/13/cnn-doc-chronicles-trash-tv-pioneer-morton-downey-jr/ \n\nAmerican independent film company Ironbound Films produced a documentary film about Downey titled Évocateur: The Morton Downey Jr. Movie, which premiered April 19, 2012, at the 2012 Tribeca Film Festival.\n\nEarly life\n\nDowney's parents were also in show business; his father, Morton Downey, was a popular singer, and his mother, Barbara Bennett, was a singer and dancer. Downey did not use his legal first name (Sean) in his stage name.Case of Sean M. Downey Jr., US Bankruptcy Court, District of New Jersey, February 16, 1990 His aunts included Hollywood film stars Constance and Joan Bennett, from whom he was estranged, and his maternal grandfather was the celebrated matinée idol Richard Bennett. Born into a wealthy family, he was raised during the summers next door to the Kennedy compound in Hyannis Port, Massachusetts. Downey attended New York University.\n\nCareer\n\nHe was a program director and announcer at radio station WPOP in Hartford, Connecticut in the 1950s.  He went on to work as a disc jockey, sometimes using the moniker \"Doc\" Downey, in various markets around the U.S., including Phoenix (KRIZ), Miami (WFUN), Kansas City (KUDL), San Diego (KDEO) and Seattle (KJR). Like his father, Downey pursued a career in music, recording in both pop and country styles. He sang on a few records and then began to write songs, several of which were popular in the 1950s and 1960s. He joined ASCAP as a result.  In 1958, he recorded \"Boulevard of Broken Dreams\", which he sang on national television on a set that resembled a dark street with one street light. In 1981, \"Green Eyed Girl\" charted on the Billboard Magazine country chart, peaking at #95.\n\nIn the 1980s, Downey was a talk show host at KFBK-AM in Sacramento, California, where he employed his abrasive style.[http://www.440.com/namesd2.html#_ddowne Downey's entry] at 440 International He was fired in 1984. He was replaced on KFBK by Rush Limbaugh, who has held the time slot ever since, later via his national syndication. Downey also had a stint on WMAQ-AM in Chicago where he unsuccessfully tried to get other on air radio personalities to submit to drug testing.  Downey's largest effect on American culture came from his popular, yet short-lived, syndicated late 1980s television talk show, The Morton Downey Jr. Show.\n\nPro-life activism\n\nOn January 22, 1980, Downey, a devoted pro-life activist, hosted the California State Rally for Life at the invitation of the California ProLife Council and United Students for Life. At that time, he was also running for President of the United States, as a Democrat. The United Students for Life, at California State University, Sacramento helped organize his California presidential rallies. Downey worked to help promote pro-life candidates in California and around the country.\"Rally for Life held in Capital,” by: Times Herald, Vallejo, January 22, 1980, Page 16.[http://www.webcommentary.com/php/ShowArticle.php?idtoddgv&date\n120210 \"About the Late (Sean) Morton Downey Jr.” by Gerald V. Todd, WEM Commentary, February 10, 2012]\n\nTelevision\n\nDowney headed to Secaucus, New Jersey, where his highly controversial television program The Morton Downey Jr. Show was taped. Starting as a local program on New York-New Jersey superstation WWOR-TV in October 1987, it expanded into national syndication in early 1988. The program featured screaming matches among Downey, his guests, and audience members. Using a large silver bowl for an ashtray, he would chainsmoke during the show and blow smoke in his guests' faces. Downey's fans became known as \"Loudmouths,\" patterned after the studio lecterns decorated with gaping cartoon mouths, from which Downey's guests would go head-to-head against each other on their respective issues.\n\nDowney's signature phrases \"pablum puking liberal\" (in reference to left-liberals) and \"zip it!\" briefly enjoyed some popularity in the contemporary vernacular. He particularly enjoyed making his guests angry with each other, which on a few occasions resulted in physical confrontations. One such incident occurred on a 1988 show taped at the Apollo Theater, involving Al Sharpton and CORE National Chairman Roy Innis. The exchange between the two men culminated in Innis shoving Sharpton into his chair, knocking him to the floor and Downey intervening to separate the pair.\n\nBecause of the controversial format and content of the show, distributor MCA Television had problems selling the show to a number of stations and advertisers. Even Downey's affiliates, many of which were low-rated independent television stations in small to medium markets, were so fearful of advertiser and viewer backlash that they would air one or even two local disclaimers during the broadcast. \n\nDuring one controversial episode Downey introduced his gay brother, Tony Downey, to his studio audience and informed them Tony was HIV positive. During the episode Downey stated he was afraid his audience would abandon him if they knew he had a gay brother, but then said he did not care.\n\nThe Washington Post wrote about him, \"Suppose a maniac got hold of a talk show. Or need we suppose?\" David Letterman said, \"I'm always amazed at what people will fall for. We see this every ten or twelve years, an attempt at this, and I guess from that standpoint I don't quite understand why everybody's falling over backwards over the guy.\"\"Shriek! Chic! It's Morton Downey!; Talk's Mr. Nasty, Coming On Strong With the Art of Abuse,\" The Washington Post, July 6, 1988, Tom Shales\n\nCelebrity, cancellation, and bankruptcy\n\nThe success of the show made Downey a pop culture celebrity, leading to appearances on Saturday Night Live in 1988, WrestleMania V in 1989 in which he traded insults with Roddy Piper and Brother Love on Piper's Pit, and later roles in movies such as Predator 2 and Revenge of the Nerds III: The Next Generation. He was also cast in several television roles, often playing tabloid TV hosts or other obnoxious media types. Downey notably starred in the Tales from the Crypt episode \"Television Terror\" which utilized several scenes shot by characters within the story, a format which became popular in horror films a decade later with the found footage genre.\n\nIn 1989, Downey released an album of songs based on his show entitled Morton Downey Jr. Sings.[http://articles.latimes.com/1989-04-04/entertainment/ca-1068_1_morton-downey Los Angeles Times] The album's single, \"Zip It!\" (a catch-phrase from the TV show, used to quiet an irate guest), became a surprise hit on some college radio stations. Over the course of the 1988–89 television season, his TV show suffered a decline in viewership, resulting from many markets downgrading its time slot; even flagship station WWOR moved Downey's program from its original 9:00 PM slot to 11:30 PM in the fall of 1988. Beginning in January 1989, the time slot immediately following Downey's program was given to the then-new Arsenio Hall Show. Following Hall's strong early ratings, however, the two series swapped time slots several weeks later, thus relegating Downey to 12:30 AM in the number-one television market. \n\nIn late April 1989, he was involved in an incident in a San Francisco International Airport restroom in which he claimed to have been attacked by neo-Nazis who painted a swastika on his face and attempted to shave his head. Some inconsistencies in Downey's account (e.g., the swastika was painted in reverse, suggesting that Downey had drawn it himself in a mirror), and the failure of the police to find supportive evidence, led many to suspect the incident was a hoax and a ploy for attention. In July 1989, his show was canceled, with the owners of the show announcing that the last episode had been taped on June 30, and that no new shows would air after September 15, 1989.\n\nAt the time of its cancellation, the show was airing on a total of 70 stations across the country, and its advertisers had been reduced primarily to \"direct-response\" ads (such as 900 chat line and phone sex numbers). In February 1990, Downey filed for bankruptcy in the US Bankruptcy Court for the District of New Jersey.\n\nLater career\n\nIn 1990, Downey resurfaced on CNBC with an interview program called Showdown, which was followed by three attempted talk radio comebacks: first in 1992 on Washington, D.C. radio station WWRC; then in 1993 on Dallas radio station KGBS, where he would scream insults at his callers. He was also hired as the station's VP of Operations. The following year, he returned to CNBC with a short-lived television show, Downey; in one episode, Downey claimed to have had a psychic communication with O.J. Simpson's murdered ex-wife, Nicole Brown Simpson.\n\nHis third – and final – attempt at a talk radio comeback occurred in 1997 on Cleveland radio station WTAM in a late evening time slot.Morton Downey Jr. back with WTAM talk show, The Plain Dealer, July 14, 1997, pg. 5, sec. E, Roger Brown It marked his return to the Cleveland market, where Downey had been a host for crosstown radio station WERE in the early 1980s prior to joining KFBK.Talk hosts talk about talking on Morton Downey show-il, The Plain Dealer, December 9, 1988, pg. 33, sec. SU, Bob Dolgan This stint came shortly after the surgery for lung cancer that removed one of his lungs. At WTAM, Downey abandoned the confrontational schtick of his TV and previous radio shows, and conducted this program in a much more conversational and jovial manner.\n\nOn August 30, 1997, Downey quit his WTAM show to focus on pursuing legal action against Howard Stern. Downey had accused Stern of spreading rumors that he had resumed his smoking habit, to which publicist Les Schecter retorted, \"He hasn't picked up a cigarette.\"[http://docs.newsbank.com/g/GooglePM/SJ/lib00189,0EB7210171723745.html \"Smoking Report Spurs Threats Of Lawsuits\"], San Jose Mercury News, August 30, 1997, p. 4A, Mercury News Wire Services His replacement was former WERE host Rick Gilmour.'Best Radio Personality: Rick Gilmore (sic) of WTAM', Cleveland Scene, September 17, 2003\n\nFollowing his death, news reports and obituaries incorrectly (according to the Orange County Register) credited him as the composer of \"Wipe Out.\" As of 2008, Downey's official website (and others) continue to make this claim.[http://mortondowneyjr.com/mortondowney.html Morton Downey Jr.'s Home Page]  Prior to Downey's death, Spin in April 1989 had identified the Wipe Out authorship as a myth.\n\nControversies\n\nIn 1984, at KFBK radio, Downey used the word \"Chinaman\" while telling a joke.[http://www.newsreview.com/sacramento/content?oid=914298 News report of controversy in Sacramento re use of word \"Chinaman\"] His use of the word upset portions of the sizable Asian community in Sacramento. One Asian-American city councilman called for an apology and pressured the station for Downey's resignation. Downey refused to apologize and was forced to resign with Rush Limbaugh taking his place.\n\nDowney was sued for allegedly appropriating the words and music to his theme song from two songwriters.Suit alleges Downey stole song, Chicago Sun-Times, May 5, 1989, Adrienne Drell He was sued for $40 million after bringing then-stripper Kellie Everts onto the show and calling her a \"slut,\" a \"pig,\" a \"hooker,\" and a \"tramp,\" claiming that she had venereal diseases, and banging his pelvis against hers.\n\nIn April 1988, he was arraigned on criminal charges for allegedly attacking a gay guest on his show, in a never-aired segment.[http://www.365gay.com/InTime/Months/12december.htm 365Gay.com] In another lawsuit, he was accused of slandering a newscaster (a former colleague), and of indecently exposing himself to her and slapping her.Talk show host Downey named in defamation suit, Chicago Sun-Times, December 11, 1988 Downey punched Stuttering John during an interview done for The Howard Stern Show, while also shouting verbal insults at John, referring to him as an \"uneducated slob\". The situation then began to evolve into a brawl between the two until Downey had to be pulled off of John by security; the entire incident was caught on camera. When an Inside Edition camera crew approached Downey in 1989 to question him about his involvement in an alleged business scam, Downey grabbed the boom mike and struck the soundman's head with it.\n\nIn his later years, Downey expressed remorse for some of the extreme theatrics of his TV show, as well as various incidents outside the studio, including the Inside Edition confrontation. However, he also claimed that his show was of a higher quality and not as \"sleazy\" as Jerry Springer's show.\n\nÉvocateur: The Morton Downey Jr. Movie\n\nReleased in 2012, the documentary film Évocateur: The Morton Downey Jr. Movie touches upon Downey's upbringing and formative years in radio and politics before launching into the history of The Morton Downey Jr. Show and Downey's influence on trash TV. The film also looks at Downey's relationship with Al Sharpton and other important 80s figures, as well as Downey's role as a predecessor for commentators like Glenn Beck and Rush Limbaugh.\n\nPersonal life\n\nDowney was married four times and had four children from three of those marriages. With wife Helen, he had daughter Melissa; with Joan, he had daughters Tracey and Kelli; and, with fourth wife Lori, he had daughter Seanna Micaela. He and Lori met when she appeared as a dancer in a show he attended in Atlantic City. According to Terry Pluto's book, Loose Balls, Downey was one of the owners of the New Orleans Buccaneers basketball team in the American Basketball Association in the late 1960s. Downey was also president and co-founder of the proposed World Baseball Association in 1974.[http://www.birminghamprosports.com/otherteamswba.htm Birminghamprosports.com]\n\nLegacy\n\nIn 1998, a Golden Palm Star on the Palm Springs, California, Walk of Stars was dedicated to him.[http://www.palmspringswalkofstars.com/web-storage/Stars/Stars%20dedicated%20by%20date.pdf Palm Springs Walk of Stars by date dedicated] \n\nIn the Super Mario video game series, the Koopaling Morton Koopa Jr. was named after him and has a large mouth, in reference to Downey's penchant for shouting during his talk show.\n\nIn The Simpsons season 1 episode \"Some Enchanted Evening\", a reporter resembling Downey is seen hosting a show called \"America's Most Armed & Dangerous\".\n\nDeath\n\nIn June 1996, Downey was diagnosed with lung cancer while being treated for pneumonia, and had one of his lungs removed.http://articles.latimes.com/1996-07-12/business/fi-23291_1_lung-cancer He did a complete about-face on the issue of tobacco use, going from a one-time member of the National Smokers Alliance to a staunch anti-smoking activist.[http://abcnews.go.com/Entertainment/story?id108365&page\n1 ABC News] He continued to speak against smoking until his death from lung cancer and pneumonia on March 12, 2001.[http://www.imdb.com/title/tt0287845/ Seattle Post-Intelligencer] account of Downey's death\n\nAfter being diagnosed with lung cancer, he commented, \"I had spawned a generation of kids to think it was cool to smoke a cigarette. Kids walked up to me until a matter of weeks ago, they'd have a cigarette in their hand and they'd say, 'Hey, Mort,' or, 'Hey, Mouth, autograph my cigarette.' And I'd do it.\" He also blamed tobacco companies for lying to consumers about cigarettes.\n\nFilmography\n\n*1978: Born Again - Classroom Guard\n*1990: Predator 2 - Tony Pope\n*1991: Driving Me Crazy - Taj\n*1991: Legal Tender - Mal Connery\n*1992: Body Chemistry II: The Voice of a Stranger - Big Chuck\n*1992: The Silencer - Michael Keating\n*1997: Meet Wally Sparks - Himself\n*1999: Palmer's Pick-Up - Dick Cash (final film role)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Morton Downey Jr." ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18885" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Sean Morton Downey (December 9, 1932 – March 12, 2001), better known by his stage name Morton Downey Jr., was an American television talk show host of the late-1980s who pioneered the \"trash TV\" format on his program The Morton Downey Jr. Show. https://www.nhregister.com/news/article/Morton-Downey-Jr-trash-TV-pioneer-68-11705335.php   http://www.toptenz.net/10-pioneers-trash-television.php  https://www.channelguidemag.com/tv-news/2015/08/13/cnn-doc-chronicles-trash-tv-pioneer-morton-downey-jr/ \n\nAmerican independent film company Ironbound Films produced a documentary film about Downey titled Évocateur: The Morton Downey Jr. Movie, which premiered April 19, 2012, at the 2012 Tribeca Film Festival.\n\nEarly life\n\nDowney's parents were also in show business; his father, Morton Downey, was a popular singer, and his mother, Barbara Bennett, was a singer and dancer. Downey did not use his legal first name (Sean) in his stage name.Case of Sean M. Downey Jr., US Bankruptcy Court, District of New Jersey, February 16, 1990 His aunts included Hollywood film stars Constance and Joan Bennett, from whom he was estranged, and his maternal grandfather was the celebrated matinée idol Richard Bennett. Born into a wealthy family, he was raised during the summers next door to the Kennedy compound in Hyannis Port, Massachusetts. Downey attended New York University.\n\nCareer\n\nHe was a program director and announcer at radio station WPOP in Hartford, Connecticut in the 1950s.  He went on to work as a disc jockey, sometimes using the moniker \"Doc\" Downey, in various markets around the U.S., including Phoenix (KRIZ), Miami (WFUN), Kansas City (KUDL), San Diego (KDEO) and Seattle (KJR). Like his father, Downey pursued a career in music, recording in both pop and country styles. He sang on a few records and then began to write songs, several of which were popular in the 1950s and 1960s. He joined ASCAP as a result.  In 1958, he recorded \"Boulevard of Broken Dreams\", which he sang on national television on a set that resembled a dark street with one street light. In 1981, \"Green Eyed Girl\" charted on the Billboard Magazine country chart, peaking at #95.\n\nIn the 1980s, Downey was a talk show host at KFBK-AM in Sacramento, California, where he employed his abrasive style.[http://www.440.com/namesd2.html#_ddowne Downey's entry] at 440 International He was fired in 1984. He was replaced on KFBK by Rush Limbaugh, who has held the time slot ever since, later via his national syndication. Downey also had a stint on WMAQ-AM in Chicago where he unsuccessfully tried to get other on air radio personalities to submit to drug testing.  Downey's largest effect on American culture came from his popular, yet short-lived, syndicated late 1980s television talk show, The Morton Downey Jr. Show.\n\nPro-life activism\n\nOn January 22, 1980, Downey, a devoted pro-life activist, hosted the California State Rally for Life at the invitation of the California ProLife Council and United Students for Life. At that time, he was also running for President of the United States, as a Democrat. The United Students for Life, at California State University, Sacramento helped organize his California presidential rallies. Downey worked to help promote pro-life candidates in California and around the country.\"Rally for Life held in Capital,” by: Times Herald, Vallejo, January 22, 1980, Page 16.[http://www.webcommentary.com/php/ShowArticle.php?idtoddgv&date\n120210 \"About the Late (Sean) Morton Downey Jr.” by Gerald V. Todd, WEM Commentary, February 10, 2012]\n\nTelevision\n\nDowney headed to Secaucus, New Jersey, where his highly controversial television program The Morton Downey Jr. Show was taped. Starting as a local program on New York-New Jersey superstation WWOR-TV in October 1987, it expanded into national syndication in early 1988. The program featured screaming matches among Downey, his guests, and audience members. Using a large silver bowl for an ashtray, he would chainsmoke during the show and blow smoke in his guests' faces. Downey's fans became known as \"Loudmouths,\" patterned after the studio lecterns decorated with gaping cartoon mouths, from which Downey's guests would go head-to-head against each other on their respective issues.\n\nDowney's signature phrases \"pablum puking liberal\" (in reference to left-liberals) and \"zip it!\" briefly enjoyed some popularity in the contemporary vernacular. He particularly enjoyed making his guests angry with each other, which on a few occasions resulted in physical confrontations. One such incident occurred on a 1988 show taped at the Apollo Theater, involving Al Sharpton and CORE National Chairman Roy Innis. The exchange between the two men culminated in Innis shoving Sharpton into his chair, knocking him to the floor and Downey intervening to separate the pair.\n\nBecause of the controversial format and content of the show, distributor MCA Television had problems selling the show to a number of stations and advertisers. Even Downey's affiliates, many of which were low-rated independent television stations in small to medium markets, were so fearful of advertiser and viewer backlash that they would air one or even two local disclaimers during the broadcast. \n\nDuring one controversial episode Downey introduced his gay brother, Tony Downey, to his studio audience and informed them Tony was HIV positive. During the episode Downey stated he was afraid his audience would abandon him if they knew he had a gay brother, but then said he did not care.\n\nThe Washington Post wrote about him, \"Suppose a maniac got hold of a talk show. Or need we suppose?\" David Letterman said, \"I'm always amazed at what people will fall for. We see this every ten or twelve years, an attempt at this, and I guess from that standpoint I don't quite understand why everybody's falling over backwards over the guy.\"\"Shriek! Chic! It's Morton Downey!; Talk's Mr. Nasty, Coming On Strong With the Art of Abuse,\" The Washington Post, July 6, 1988, Tom Shales\n\nCelebrity, cancellation, and bankruptcy\n\nThe success of the show made Downey a pop culture celebrity, leading to appearances on Saturday Night Live in 1988, WrestleMania V in 1989 in which he traded insults with Roddy Piper and Brother Love on Piper's Pit, and later roles in movies such as Predator 2 and Revenge of the Nerds III: The Next Generation. He was also cast in several television roles, often playing tabloid TV hosts or other obnoxious media types. Downey notably starred in the Tales from the Crypt episode \"Television Terror\" which utilized several scenes shot by characters within the story, a format which became popular in horror films a decade later with the found footage genre.\n\nIn 1989, Downey released an album of songs based on his show entitled Morton Downey Jr. Sings.[http://articles.latimes.com/1989-04-04/entertainment/ca-1068_1_morton-downey Los Angeles Times] The album's single, \"Zip It!\" (a catch-phrase from the TV show, used to quiet an irate guest), became a surprise hit on some college radio stations. Over the course of the 1988–89 television season, his TV show suffered a decline in viewership, resulting from many markets downgrading its time slot; even flagship station WWOR moved Downey's program from its original 9:00 PM slot to 11:30 PM in the fall of 1988. Beginning in January 1989, the time slot immediately following Downey's program was given to the then-new Arsenio Hall Show. Following Hall's strong early ratings, however, the two series swapped time slots several weeks later, thus relegating Downey to 12:30 AM in the number-one television market. \n\nIn late April 1989, he was involved in an incident in a San Francisco International Airport restroom in which he claimed to have been attacked by neo-Nazis who painted a swastika on his face and attempted to shave his head. Some inconsistencies in Downey's account (e.g., the swastika was painted in reverse, suggesting that Downey had drawn it himself in a mirror), and the failure of the police to find supportive evidence, led many to suspect the incident was a hoax and a ploy for attention. In July 1989, his show was canceled, with the owners of the show announcing that the last episode had been taped on June 30, and that no new shows would air after September 15, 1989.\n\nAt the time of its cancellation, the show was airing on a total of 70 stations across the country, and its advertisers had been reduced primarily to \"direct-response\" ads (such as 900 chat line and phone sex numbers). In February 1990, Downey filed for bankruptcy in the US Bankruptcy Court for the District of New Jersey.\n\nLater career\n\nIn 1990, Downey resurfaced on CNBC with an interview program called Showdown, which was followed by three attempted talk radio comebacks: first in 1992 on Washington, D.C. radio station WWRC; then in 1993 on Dallas radio station KGBS, where he would scream insults at his callers. He was also hired as the station's VP of Operations. The following year, he returned to CNBC with a short-lived television show, Downey; in one episode, Downey claimed to have had a psychic communication with O.J. Simpson's murdered ex-wife, Nicole Brown Simpson.\n\nHis third – and final – attempt at a talk radio comeback occurred in 1997 on Cleveland radio station WTAM in a late evening time slot.Morton Downey Jr. back with WTAM talk show, The Plain Dealer, July 14, 1997, pg. 5, sec. E, Roger Brown It marked his return to the Cleveland market, where Downey had been a host for crosstown radio station WERE in the early 1980s prior to joining KFBK.Talk hosts talk about talking on Morton Downey show-il, The Plain Dealer, December 9, 1988, pg. 33, sec. SU, Bob Dolgan This stint came shortly after the surgery for lung cancer that removed one of his lungs. At WTAM, Downey abandoned the confrontational schtick of his TV and previous radio shows, and conducted this program in a much more conversational and jovial manner.\n\nOn August 30, 1997, Downey quit his WTAM show to focus on pursuing legal action against Howard Stern. Downey had accused Stern of spreading rumors that he had resumed his smoking habit, to which publicist Les Schecter retorted, \"He hasn't picked up a cigarette.\"[http://docs.newsbank.com/g/GooglePM/SJ/lib00189,0EB7210171723745.html \"Smoking Report Spurs Threats Of Lawsuits\"], San Jose Mercury News, August 30, 1997, p. 4A, Mercury News Wire Services His replacement was former WERE host Rick Gilmour.'Best Radio Personality: Rick Gilmore (sic) of WTAM', Cleveland Scene, September 17, 2003\n\nFollowing his death, news reports and obituaries incorrectly (according to the Orange County Register) credited him as the composer of \"Wipe Out.\" As of 2008, Downey's official website (and others) continue to make this claim.[http://mortondowneyjr.com/mortondowney.html Morton Downey Jr.'s Home Page]  Prior to Downey's death, Spin in April 1989 had identified the Wipe Out authorship as a myth.\n\nControversies\n\nIn 1984, at KFBK radio, Downey used the word \"Chinaman\" while telling a joke.[http://www.newsreview.com/sacramento/content?oid=914298 News report of controversy in Sacramento re use of word \"Chinaman\"] His use of the word upset portions of the sizable Asian community in Sacramento. One Asian-American city councilman called for an apology and pressured the station for Downey's resignation. Downey refused to apologize and was forced to resign with Rush Limbaugh taking his place.\n\nDowney was sued for allegedly appropriating the words and music to his theme song from two songwriters.Suit alleges Downey stole song, Chicago Sun-Times, May 5, 1989, Adrienne Drell He was sued for $40 million after bringing then-stripper Kellie Everts onto the show and calling her a \"slut,\" a \"pig,\" a \"hooker,\" and a \"tramp,\" claiming that she had venereal diseases, and banging his pelvis against hers.\n\nIn April 1988, he was arraigned on criminal charges for allegedly attacking a gay guest on his show, in a never-aired segment.[http://www.365gay.com/InTime/Months/12december.htm 365Gay.com] In another lawsuit, he was accused of slandering a newscaster (a former colleague), and of indecently exposing himself to her and slapping her.Talk show host Downey named in defamation suit, Chicago Sun-Times, December 11, 1988 Downey punched Stuttering John during an interview done for The Howard Stern Show, while also shouting verbal insults at John, referring to him as an \"uneducated slob\". The situation then began to evolve into a brawl between the two until Downey had to be pulled off of John by security; the entire incident was caught on camera. When an Inside Edition camera crew approached Downey in 1989 to question him about his involvement in an alleged business scam, Downey grabbed the boom mike and struck the soundman's head with it.\n\nIn his later years, Downey expressed remorse for some of the extreme theatrics of his TV show, as well as various incidents outside the studio, including the Inside Edition confrontation. However, he also claimed that his show was of a higher quality and not as \"sleazy\" as Jerry Springer's show.\n\nÉvocateur: The Morton Downey Jr. Movie\n\nReleased in 2012, the documentary film Évocateur: The Morton Downey Jr. Movie touches upon Downey's upbringing and formative years in radio and politics before launching into the history of The Morton Downey Jr. Show and Downey's influence on trash TV. The film also looks at Downey's relationship with Al Sharpton and other important 80s figures, as well as Downey's role as a predecessor for commentators like Glenn Beck and Rush Limbaugh.\n\nPersonal life\n\nDowney was married four times and had four children from three of those marriages. With wife Helen, he had daughter Melissa; with Joan, he had daughters Tracey and Kelli; and, with fourth wife Lori, he had daughter Seanna Micaela. He and Lori met when she appeared as a dancer in a show he attended in Atlantic City. According to Terry Pluto's book, Loose Balls, Downey was one of the owners of the New Orleans Buccaneers basketball team in the American Basketball Association in the late 1960s. Downey was also president and co-founder of the proposed World Baseball Association in 1974.[http://www.birminghamprosports.com/otherteamswba.htm Birminghamprosports.com]\n\nLegacy\n\nIn 1998, a Golden Palm Star on the Palm Springs, California, Walk of Stars was dedicated to him.[http://www.palmspringswalkofstars.com/web-storage/Stars/Stars%20dedicated%20by%20date.pdf Palm Springs Walk of Stars by date dedicated] \n\nIn the Super Mario video game series, the Koopaling Morton Koopa Jr. was named after him and has a large mouth, in reference to Downey's penchant for shouting during his talk show.\n\nIn The Simpsons season 1 episode \"Some Enchanted Evening\", a reporter resembling Downey is seen hosting a show called \"America's Most Armed & Dangerous\".\n\nDeath\n\nIn June 1996, Downey was diagnosed with lung cancer while being treated for pneumonia, and had one of his lungs removed.http://articles.latimes.com/1996-07-12/business/fi-23291_1_lung-cancer He did a complete about-face on the issue of tobacco use, going from a one-time member of the National Smokers Alliance to a staunch anti-smoking activist.[http://abcnews.go.com/Entertainment/story?id108365&page\n1 ABC News] He continued to speak against smoking until his death from lung cancer and pneumonia on March 12, 2001.[http://www.imdb.com/title/tt0287845/ Seattle Post-Intelligencer] account of Downey's death\n\nAfter being diagnosed with lung cancer, he commented, \"I had spawned a generation of kids to think it was cool to smoke a cigarette. Kids walked up to me until a matter of weeks ago, they'd have a cigarette in their hand and they'd say, 'Hey, Mort,' or, 'Hey, Mouth, autograph my cigarette.' And I'd do it.\" He also blamed tobacco companies for lying to consumers about cigarettes.\n\nFilmography\n\n*1978: Born Again - Classroom Guard\n*1990: Predator 2 - Tony Pope\n*1991: Driving Me Crazy - Taj\n*1991: Legal Tender - Mal Connery\n*1992: Body Chemistry II: The Voice of a Stranger - Big Chuck\n*1992: The Silencer - Michael Keating\n*1997: Meet Wally Sparks - Himself\n*1999: Palmer's Pick-Up - Dick Cash (final film role). Morton Downey Jr.. http://en.wikipedia.org/?curid=18885."
  }
}
