{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4086",
  "eid" : "cb39ec20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778420706,
  "textBody" : "Brainfuck is an esoteric programming language created in 1993 by Urban Müller, and notable for its extreme minimalism.\n\nThe language consists of only eight simple commands and an instruction pointer.  While it is fully Turing-complete, it is not intended for practical use, but to challenge and amuse programmers. Brainfuck simply requires one to break commands into microscopic steps.\n\nThe language's name is a reference to the slang term brainfuck, which refers to things so complicated or unusual that they exceed the limits of one's understanding.\n\nHistory\n\nIn 1992, Urban Müller, a Swiss physics student, took over a small online archive for Amiga software. The archive grew more popular, and was soon mirrored around the world. Today, it is the world's largest Amiga archive, known as Aminet.\n\nMüller designed Brainfuck with the goal of implementing it with the smallest possible compiler, inspired by the 1024-byte compiler for the FALSE programming language. Müller's original compiler was implemented in machine language and compiled to a binary with a size of 296 bytes. He uploaded the first Brainfuck compiler to Aminet in 1993. The program came with a \"Readme\" file, which briefly described the language, and challenged the reader \"Who can program anything useful with it? :)\". Müller also included an interpreter and some quite elaborate examples. A second version of the compiler used only 240 bytes.\n\nAs Aminet grew, the compiler became popular among the Amiga community, and in time it was implemented for other platforms. Several brainfuck compilers have been made smaller than 200 bytes, and one is only 100 bytes.\n\nLanguage design\n\nThe language consists of eight commands, listed below. A brainfuck program is a sequence of these commands, possibly interspersed with other characters (which are ignored). The commands are executed sequentially, with some exceptions: an instruction pointer begins at the first command, and each command it points to is executed, after which it normally moves forward to the next command. The program terminates when the instruction pointer moves past the last command.\n\nThe brainfuck language uses a simple machine model consisting of the program and instruction pointer, as well as an array of at least 30,000 byte cells initialized to zero; a movable data pointer (initialized to point to the leftmost byte of the array); and two streams of bytes for input and output (most often connected to a keyboard and a monitor respectively, and using the ASCII character encoding).\n\nCommands\n\nThe eight language commands each consist of a single character:\n\n(Alternatively, the ] command may instead be translated as an unconditional jump to the corresponding [ command, or vice versa; programs will behave the same but will run more slowly, due to unnecessary double searching.)\n\n[ and ] match as parentheses usually do: each [ matches exactly one ] and vice versa, the [ comes first, and there can be no unmatched [ or ] between the two.\n\nBrainfuck programs can be translated into C using the following substitutions, assuming ptr is of type  char* and has been initialized to point to an array of zeroed bytes:\n\nAs the name suggests, brainfuck programs tend to be difficult to comprehend. This is partly because any mildly complex task requires a long sequence of commands; partly it is because the program's text gives no direct indications of the program's state. These, as well as brainfuck's inefficiency and its limited input/output capabilities, are some of the reasons it is not used for serious programming. Nonetheless, like any Turing-complete language, brainfuck is theoretically capable of computing any computable function or simulating any other computational model, if given access to an unlimited amount of memory. A variety of brainfuck programs have been written. Although brainfuck programs, especially complicated ones, are difficult to write, it is quite trivial to write an interpreter for brainfuck in a more typical language such as C due to its simplicity. There even exist brainfuck interpreters written in the brainfuck language itself.\n\nBrainfuck is an example of a so-called Turing tarpit: It can be used to write any program, but it is not practical to do so, because Brainfuck provides so little abstraction that the programs get very long or complicated.\n\nBrainfuck's formal \"parent language\" \n\nExcept for its two I/O commands, brainfuck is a minor variation of the formal programming language P′′ created by Corrado Böhm in 1964.  In fact, using six symbols equivalent to the respective brainfuck commands +, -, , >, [, ], Böhm provided an explicit program for each of the basic functions that together serve to compute any computable function.  So the first \"brainfuck\" programs appear in Böhm's 1964 paper – and they were programs sufficient to prove Turing-completeness.\n\nExamples \n\nAdding two values \n\nAs a first, simple example, the following code snippet will add the current cell's value to the next cell: Each time the loop is executed, the current cell is decremented, the data pointer moves to the right, that next cell is incremented, and the data pointer moves left again. This sequence is repeated until the starting cell is 0.\n\n[->+\n\nThis can be incorporated into a simple addition program as follows:\n\n++       Cell c0 = 2\n> +++++  Cell c1 = 5\n\n[        Start your loops with your cell pointer on the loop counter (c1 in our case)\n -      Subtract 1 from c1\n]        End your loops with the cell pointer on the loop counter\n\nAt this point our program has added 5 to 2 leaving 7 in c0 and 0 in c1\nbut we cannot output this value to the terminal since it is not ASCII encoded!\n\nTo display the ASCII character \"7\" we must add 48 to the value 7!\n48 = 6 * 8 so let's use another loop to help us!\n\n++++ ++++  c1 = 8 and this will be our loop counter again\n[\n -        Subtract 1 from c1\n]\n\nHello World! \n\nThe following program prints \"Hello World!\" and a newline to the screen:\n\n[ This program prints \"Hello World!\" and a newline to the screen, its\n  length is 106 active command characters. [It is not the shortest.]\n\n  This loop is an \"initial comment loop\", a simple way of adding a comment\n  to a BF program such that you don't have to worry about any command\n  characters. Any \".\", \",\", \"+\", \"-\", \"\" characters are simply\n  ignored, the \"[\" and \"]\" characters just have to be balanced. This\n  loop and the commands it contains are ignored because the current cell\n  defaults to a value of 0; the 0 value causes this loop to be skipped.\n]\n++++++++               Set Cell #0 to 8\n[\n    >++++               Add 4 to Cell #1; this will always set Cell #1 to 4\n    [                   as the cell will be cleared by the loop\n        >++             Add 2 to Cell #2\n        >+++            Add 3 to Cell #3\n        >+++            Add 3 to Cell #4\n        >+              Add 1 to Cell #5\n        +                  Add 1 to Cell #2\n    >+                  Add 1 to Cell #3\n    >-                  Subtract 1 from Cell #4\n    >>+                 Add 1 to Cell #6\n    [>.                     Cell #2 has value 72 which is 'H'\n>---.                   Subtract 3 from Cell #3 to get 101 which is 'e'\n+++++++..+++.           Likewise for 'llo' from Cell #3\n>>.                     Cell #5 is 32 for the space\n>+.                    Add 1 to Cell #5 gives us an exclamation point\n>++.                    And finally a newline from Cell #6\n\nFor \"readability\", this code has been spread across many lines and blanks and comments have been added. Brainfuck ignores all characters except the eight commands +-<>[],. so no special syntax for comments is needed (as long as the comments do not contain the command characters). The code could just as well have been written as:\n++++++++[>++++[>++>+++>+++>++>+>->>+[>.>---.+++++++..+++.>>.>+.>++.\n\nROT13 \n\nThis program enciphers its input with the ROT13 cipher. To do this, it must map characters A-M (ASCII 65-77) to N-Z (78-90), and vice versa. Also it must map a-m (97-109) to n-z (110-122) and vice versa. It must map all other characters to themselves; it reads characters one at a time and outputs their enciphered equivalents until it reads an EOF (here assumed to be represented as either -1 or \"no change\"), at which point the program terminates.\n\nThe basic approach used is as follows. Calling the input character x, divide x-1 by 32, keeping quotient and remainder. Unless the quotient is 2 or 3, just output x, having kept a copy of it during the division. If the quotient is 2 or 3, divide the remainder ((x-1) modulo 32) by 13; if the quotient here is 0, output x+13; if 1, output x-13; if 2, output x.\n\nRegarding the division algorithm, when dividing y by z to get a quotient q and remainder r, there is an outer loop which sets q and r first to the quotient and remainder of 1/z, then to those of 2/z, and so on; after it has executed y times, this outer loop terminates, leaving q and r set to the quotient and remainder of y/z. (The dividend y is used as a diminishing counter that controls how many times this loop is executed.) Within the loop, there is code to increment r and decrement y, which is usually sufficient; however, every zth time through the outer loop, it is necessary to zero r and increment q. This is done with a diminishing counter set to the divisor z; each time through the outer loop, this counter is decremented, and when it reaches zero, it is refilled by moving the value from r back into it.\n\n \n-,+[                         Read first character and start outer character reading loop\n    -[                       Skip forward if character is 0\n        >>++++[>+++++++++>+>-[>>>]      Increase copy and remainder / reduce divisor / Normal case: skip forward\n            <>+>+>]    Special case: move remainder back to divisor and increase quotient\n            >>[-]+                 End skip loop; zero former divisor and reuse space for a flag\n    >--[-[+++[-]-[>+>>]         Reduce divisor; Normal case: increase remainder\n            >[+[-]>+>>]   Special case: increase remainder / move it back to divisor / increase quotient\n            >[-]             Add remainder back to divisor to get a useful 13\n        >[                   Skip forward if quotient was 0\n            -[               Decrement quotient and skip forward if quotient was 1\n                ->     Zero quotient and divisor if quotient was 2\n            ]>-]>>    Zero divisor and subtract 13 from copy if quotient was 1\n        ]>-]          Zero divisor and add 13 to copy if quotient was 0\n    ]                        End outer skip loop (jump to here if ((character minus 1)/32) was not 2 or 3)\n    \n\nPortability issues\n\nPartly because Urban Müller did not write a thorough language specification, the many subsequent brainfuck interpreters and compilers have come to use slightly different dialects of brainfuck.\n\nCell size\n\nIn the classic distribution, the cells are of 8-bit size (cells are bytes), and this is still the most common size. However, to read non-textual data, a brainfuck program may need to distinguish an end-of-file condition from any possible byte value; thus 16-bit cells have also been used. Some implementations have used 32-bit cells, 64-bit cells, or bignum cells with practically unlimited range, but programs that use this extra range are likely to be slow, since storing the value n into a cell requires Ω(n) time as a cell's value may only be changed by incrementing and decrementing.\n\nIn all these variants, the , and . commands still read and write data in bytes. In most of them, the cells wrap around, i.e. incrementing a cell which holds its maximal value (with the + command) will bring it to its minimal value and vice versa. The exceptions are implementations which are distant from the underlying hardware, implementations that use bignums, and implementations that try to enforce portability.\n\nFortunately, it is usually easy to write brainfuck programs that do not ever cause integer wraparound or overflow, and therefore don't depend on cell size. Generally this means avoiding increment of +255 (unsigned 8-bit wraparound), or avoiding overstepping the boundaries of [-128, +127] (signed 8-bit wraparound) (since there are no comparison operators, a program cannot distinguish between a signed and unsigned two's complement fixed-bit-size cell and negativeness of numbers is a matter of interpretation). For more details on integer wraparound, see the Integer overflow article.\n\nArray size\n\nIn the classic distribution, the array has 30,000 cells, and the pointer begins at the leftmost cell. Even more cells are needed to store things like the millionth Fibonacci number, and the easiest way to make the language Turing-complete is to make the array unlimited on the right.\n\nA few implementations extend the array to the left as well; this is an uncommon feature, and therefore portable brainfuck programs do not depend on it.\n\nWhen the pointer moves outside the bounds of the array, some implementations will give an error message, some will try to extend the array dynamically, some will not notice and will produce undefined behavior, and a few will move the pointer to the opposite end of the array. Some tradeoffs are involved: expanding the array dynamically to the right is the most user-friendly approach and is good for memory-hungry programs, but it carries a speed penalty. If a fixed-size array is used it is helpful to make it very large, or better yet let the user set the size. Giving an error message for bounds violations is very useful for debugging but even that carries a speed penalty unless it can be handled by the operating system's memory protections.\n\nEnd-of-line code\n\nDifferent operating systems (and sometimes different programming environments) use subtly different versions of ASCII. The most important difference is in the code used for the end of a line of text. MS-DOS and Microsoft Windows use a CRLF, i.e. a 13 followed by a 10, in most contexts. UNIX and its descendants (including GNU/Linux and Mac OS X) and Amigas use just 10, and older Macs use just 13. It would be unfortunate if brainfuck programs had to be rewritten for different operating systems. Fortunately, a unified standard is easy to find. Urban Müller's compiler and his example programs use 10, on both input and output; so do a large majority of existing brainfuck programs; and 10 is also more convenient to use than CRLF. Thus, brainfuck implementations should make sure that brainfuck programs that assume newline=10 will run properly; many do so, but some do not.\n\nThis assumption is also consistent with most of the world's sample code for C and other languages, in that they use '\\n', or 10, for their newlines. On systems that use CRLF line endings, the C standard library transparently remaps \"\\n\" to \"\\r\\n\" on output and \"\\r\\n\" to \"\\n\" on input for streams not opened in binary mode.\n\nEnd-of-file behavior\n\nThe behavior of the \",\" command when an end-of-file condition has been encountered varies. Some implementations set the cell at the pointer to 0, some set it to the C constant EOF (in practice this is usually -1), some leave the cell's value unchanged. There is no real consensus; arguments for the three behaviors are as follows.\n\nSetting the cell to 0 avoids the use of negative numbers, and makes it marginally more concise to write a loop that reads characters until EOF occurs. This is a language extension devised by Panu Kalliokoski.\n\nSetting the cell to -1 allows EOF to be distinguished from any byte value (if the cells are larger than bytes), which is necessary for reading non-textual data; also, it is the behavior of the C translation of \",\" given in Müller's readme file. However, it is not obvious that those C translations are to be taken as normative.\n\nLeaving the cell's value unchanged is the behavior of Urban Müller's brainfuck compiler. This behavior can easily coexist with either of the others; for instance, a program that assumes EOF0 can set the cell to 0 before each \",\" command, and will then work correctly on implementations that do either EOF\n0 or EOF=\"no change\". It is so easy to accommodate the \"no change\" behavior that any brainfuck programmer interested in portability should do so.\n\nDerivatives \n\nMany people have created brainfuck equivalents (languages with commands that directly map to brainfuck) or brainfuck derivatives (languages that extend its behavior or map it into new semantic territory).\n\nSome examples:\n* Pi, which maps brainfuck into errors in individual digits of Pi.\n* VerboseFuck, which looks like a traditional programming language, only what appears as parameters or expressions are actually parts of longer commands that cannot be altered.\n* DerpPlusPlus, in which the commands are replaced with words such as 'HERP', 'DERP', 'GIGITY', etc.\n* Ook!, which maps brainfuck's eight commands to two-word permutations of \"Ook.\", \"Ook?\", and \"Ook!\", jokingly designed to be \"writable and readable by orang-utans\" according to its creator, a reference to the orang-utan Librarian in the novels of Terry Pratchett.\n* Ternary, similar in concept to Ook! but instead consisting of permutations of the ASCII characters 0, 1, and 2.\n*BodyFuck, a BrainFuck implementation based on a gesture-controlled system so that programmer's movements are captured by a video camera and converted into the 8 possible characters.\n \nHowever, there are also unnamed minor variants (or dialects), possibly formed as a result of inattention, of which some of the more common are:\n* forbidding, rather than ignoring, any non-command characters in brainfuck programs\n* introducing a comment marker which comments out the rest of the line\n* various alterations of the loop semantics, sometimes destroying Turing completeness\n* requiring a special character to mark the end of the program",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Brainfuck" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4086" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Brainfuck is an esoteric programming language created in 1993 by Urban Müller, and notable for its extreme minimalism.\n\nThe language consists of only eight simple commands and an instruction pointer.  While it is fully Turing-complete, it is not intended for practical use, but to challenge and amuse programmers. Brainfuck simply requires one to break commands into microscopic steps.\n\nThe language's name is a reference to the slang term brainfuck, which refers to things so complicated or unusual that they exceed the limits of one's understanding.\n\nHistory\n\nIn 1992, Urban Müller, a Swiss physics student, took over a small online archive for Amiga software. The archive grew more popular, and was soon mirrored around the world. Today, it is the world's largest Amiga archive, known as Aminet.\n\nMüller designed Brainfuck with the goal of implementing it with the smallest possible compiler, inspired by the 1024-byte compiler for the FALSE programming language. Müller's original compiler was implemented in machine language and compiled to a binary with a size of 296 bytes. He uploaded the first Brainfuck compiler to Aminet in 1993. The program came with a \"Readme\" file, which briefly described the language, and challenged the reader \"Who can program anything useful with it? :)\". Müller also included an interpreter and some quite elaborate examples. A second version of the compiler used only 240 bytes.\n\nAs Aminet grew, the compiler became popular among the Amiga community, and in time it was implemented for other platforms. Several brainfuck compilers have been made smaller than 200 bytes, and one is only 100 bytes.\n\nLanguage design\n\nThe language consists of eight commands, listed below. A brainfuck program is a sequence of these commands, possibly interspersed with other characters (which are ignored). The commands are executed sequentially, with some exceptions: an instruction pointer begins at the first command, and each command it points to is executed, after which it normally moves forward to the next command. The program terminates when the instruction pointer moves past the last command.\n\nThe brainfuck language uses a simple machine model consisting of the program and instruction pointer, as well as an array of at least 30,000 byte cells initialized to zero; a movable data pointer (initialized to point to the leftmost byte of the array); and two streams of bytes for input and output (most often connected to a keyboard and a monitor respectively, and using the ASCII character encoding).\n\nCommands\n\nThe eight language commands each consist of a single character:\n\n(Alternatively, the ] command may instead be translated as an unconditional jump to the corresponding [ command, or vice versa; programs will behave the same but will run more slowly, due to unnecessary double searching.)\n\n[ and ] match as parentheses usually do: each [ matches exactly one ] and vice versa, the [ comes first, and there can be no unmatched [ or ] between the two.\n\nBrainfuck programs can be translated into C using the following substitutions, assuming ptr is of type  char* and has been initialized to point to an array of zeroed bytes:\n\nAs the name suggests, brainfuck programs tend to be difficult to comprehend. This is partly because any mildly complex task requires a long sequence of commands; partly it is because the program's text gives no direct indications of the program's state. These, as well as brainfuck's inefficiency and its limited input/output capabilities, are some of the reasons it is not used for serious programming. Nonetheless, like any Turing-complete language, brainfuck is theoretically capable of computing any computable function or simulating any other computational model, if given access to an unlimited amount of memory. A variety of brainfuck programs have been written. Although brainfuck programs, especially complicated ones, are difficult to write, it is quite trivial to write an interpreter for brainfuck in a more typical language such as C due to its simplicity. There even exist brainfuck interpreters written in the brainfuck language itself.\n\nBrainfuck is an example of a so-called Turing tarpit: It can be used to write any program, but it is not practical to do so, because Brainfuck provides so little abstraction that the programs get very long or complicated.\n\nBrainfuck's formal \"parent language\" \n\nExcept for its two I/O commands, brainfuck is a minor variation of the formal programming language P′′ created by Corrado Böhm in 1964.  In fact, using six symbols equivalent to the respective brainfuck commands +, -, , >, [, ], Böhm provided an explicit program for each of the basic functions that together serve to compute any computable function.  So the first \"brainfuck\" programs appear in Böhm's 1964 paper – and they were programs sufficient to prove Turing-completeness.\n\nExamples \n\nAdding two values \n\nAs a first, simple example, the following code snippet will add the current cell's value to the next cell: Each time the loop is executed, the current cell is decremented, the data pointer moves to the right, that next cell is incremented, and the data pointer moves left again. This sequence is repeated until the starting cell is 0.\n\n[->+\n\nThis can be incorporated into a simple addition program as follows:\n\n++       Cell c0 = 2\n> +++++  Cell c1 = 5\n\n[        Start your loops with your cell pointer on the loop counter (c1 in our case)\n -      Subtract 1 from c1\n]        End your loops with the cell pointer on the loop counter\n\nAt this point our program has added 5 to 2 leaving 7 in c0 and 0 in c1\nbut we cannot output this value to the terminal since it is not ASCII encoded!\n\nTo display the ASCII character \"7\" we must add 48 to the value 7!\n48 = 6 * 8 so let's use another loop to help us!\n\n++++ ++++  c1 = 8 and this will be our loop counter again\n[\n -        Subtract 1 from c1\n]\n\nHello World! \n\nThe following program prints \"Hello World!\" and a newline to the screen:\n\n[ This program prints \"Hello World!\" and a newline to the screen, its\n  length is 106 active command characters. [It is not the shortest.]\n\n  This loop is an \"initial comment loop\", a simple way of adding a comment\n  to a BF program such that you don't have to worry about any command\n  characters. Any \".\", \",\", \"+\", \"-\", \"\" characters are simply\n  ignored, the \"[\" and \"]\" characters just have to be balanced. This\n  loop and the commands it contains are ignored because the current cell\n  defaults to a value of 0; the 0 value causes this loop to be skipped.\n]\n++++++++               Set Cell #0 to 8\n[\n    >++++               Add 4 to Cell #1; this will always set Cell #1 to 4\n    [                   as the cell will be cleared by the loop\n        >++             Add 2 to Cell #2\n        >+++            Add 3 to Cell #3\n        >+++            Add 3 to Cell #4\n        >+              Add 1 to Cell #5\n        +                  Add 1 to Cell #2\n    >+                  Add 1 to Cell #3\n    >-                  Subtract 1 from Cell #4\n    >>+                 Add 1 to Cell #6\n    [>.                     Cell #2 has value 72 which is 'H'\n>---.                   Subtract 3 from Cell #3 to get 101 which is 'e'\n+++++++..+++.           Likewise for 'llo' from Cell #3\n>>.                     Cell #5 is 32 for the space\n>+.                    Add 1 to Cell #5 gives us an exclamation point\n>++.                    And finally a newline from Cell #6\n\nFor \"readability\", this code has been spread across many lines and blanks and comments have been added. Brainfuck ignores all characters except the eight commands +-<>[],. so no special syntax for comments is needed (as long as the comments do not contain the command characters). The code could just as well have been written as:\n++++++++[>++++[>++>+++>+++>++>+>->>+[>.>---.+++++++..+++.>>.>+.>++.\n\nROT13 \n\nThis program enciphers its input with the ROT13 cipher. To do this, it must map characters A-M (ASCII 65-77) to N-Z (78-90), and vice versa. Also it must map a-m (97-109) to n-z (110-122) and vice versa. It must map all other characters to themselves; it reads characters one at a time and outputs their enciphered equivalents until it reads an EOF (here assumed to be represented as either -1 or \"no change\"), at which point the program terminates.\n\nThe basic approach used is as follows. Calling the input character x, divide x-1 by 32, keeping quotient and remainder. Unless the quotient is 2 or 3, just output x, having kept a copy of it during the division. If the quotient is 2 or 3, divide the remainder ((x-1) modulo 32) by 13; if the quotient here is 0, output x+13; if 1, output x-13; if 2, output x.\n\nRegarding the division algorithm, when dividing y by z to get a quotient q and remainder r, there is an outer loop which sets q and r first to the quotient and remainder of 1/z, then to those of 2/z, and so on; after it has executed y times, this outer loop terminates, leaving q and r set to the quotient and remainder of y/z. (The dividend y is used as a diminishing counter that controls how many times this loop is executed.) Within the loop, there is code to increment r and decrement y, which is usually sufficient; however, every zth time through the outer loop, it is necessary to zero r and increment q. This is done with a diminishing counter set to the divisor z; each time through the outer loop, this counter is decremented, and when it reaches zero, it is refilled by moving the value from r back into it.\n\n \n-,+[                         Read first character and start outer character reading loop\n    -[                       Skip forward if character is 0\n        >>++++[>+++++++++>+>-[>>>]      Increase copy and remainder / reduce divisor / Normal case: skip forward\n            <>+>+>]    Special case: move remainder back to divisor and increase quotient\n            >>[-]+                 End skip loop; zero former divisor and reuse space for a flag\n    >--[-[+++[-]-[>+>>]         Reduce divisor; Normal case: increase remainder\n            >[+[-]>+>>]   Special case: increase remainder / move it back to divisor / increase quotient\n            >[-]             Add remainder back to divisor to get a useful 13\n        >[                   Skip forward if quotient was 0\n            -[               Decrement quotient and skip forward if quotient was 1\n                ->     Zero quotient and divisor if quotient was 2\n            ]>-]>>    Zero divisor and subtract 13 from copy if quotient was 1\n        ]>-]          Zero divisor and add 13 to copy if quotient was 0\n    ]                        End outer skip loop (jump to here if ((character minus 1)/32) was not 2 or 3)\n    \n\nPortability issues\n\nPartly because Urban Müller did not write a thorough language specification, the many subsequent brainfuck interpreters and compilers have come to use slightly different dialects of brainfuck.\n\nCell size\n\nIn the classic distribution, the cells are of 8-bit size (cells are bytes), and this is still the most common size. However, to read non-textual data, a brainfuck program may need to distinguish an end-of-file condition from any possible byte value; thus 16-bit cells have also been used. Some implementations have used 32-bit cells, 64-bit cells, or bignum cells with practically unlimited range, but programs that use this extra range are likely to be slow, since storing the value n into a cell requires Ω(n) time as a cell's value may only be changed by incrementing and decrementing.\n\nIn all these variants, the , and . commands still read and write data in bytes. In most of them, the cells wrap around, i.e. incrementing a cell which holds its maximal value (with the + command) will bring it to its minimal value and vice versa. The exceptions are implementations which are distant from the underlying hardware, implementations that use bignums, and implementations that try to enforce portability.\n\nFortunately, it is usually easy to write brainfuck programs that do not ever cause integer wraparound or overflow, and therefore don't depend on cell size. Generally this means avoiding increment of +255 (unsigned 8-bit wraparound), or avoiding overstepping the boundaries of [-128, +127] (signed 8-bit wraparound) (since there are no comparison operators, a program cannot distinguish between a signed and unsigned two's complement fixed-bit-size cell and negativeness of numbers is a matter of interpretation). For more details on integer wraparound, see the Integer overflow article.\n\nArray size\n\nIn the classic distribution, the array has 30,000 cells, and the pointer begins at the leftmost cell. Even more cells are needed to store things like the millionth Fibonacci number, and the easiest way to make the language Turing-complete is to make the array unlimited on the right.\n\nA few implementations extend the array to the left as well; this is an uncommon feature, and therefore portable brainfuck programs do not depend on it.\n\nWhen the pointer moves outside the bounds of the array, some implementations will give an error message, some will try to extend the array dynamically, some will not notice and will produce undefined behavior, and a few will move the pointer to the opposite end of the array. Some tradeoffs are involved: expanding the array dynamically to the right is the most user-friendly approach and is good for memory-hungry programs, but it carries a speed penalty. If a fixed-size array is used it is helpful to make it very large, or better yet let the user set the size. Giving an error message for bounds violations is very useful for debugging but even that carries a speed penalty unless it can be handled by the operating system's memory protections.\n\nEnd-of-line code\n\nDifferent operating systems (and sometimes different programming environments) use subtly different versions of ASCII. The most important difference is in the code used for the end of a line of text. MS-DOS and Microsoft Windows use a CRLF, i.e. a 13 followed by a 10, in most contexts. UNIX and its descendants (including GNU/Linux and Mac OS X) and Amigas use just 10, and older Macs use just 13. It would be unfortunate if brainfuck programs had to be rewritten for different operating systems. Fortunately, a unified standard is easy to find. Urban Müller's compiler and his example programs use 10, on both input and output; so do a large majority of existing brainfuck programs; and 10 is also more convenient to use than CRLF. Thus, brainfuck implementations should make sure that brainfuck programs that assume newline=10 will run properly; many do so, but some do not.\n\nThis assumption is also consistent with most of the world's sample code for C and other languages, in that they use '\\n', or 10, for their newlines. On systems that use CRLF line endings, the C standard library transparently remaps \"\\n\" to \"\\r\\n\" on output and \"\\r\\n\" to \"\\n\" on input for streams not opened in binary mode.\n\nEnd-of-file behavior\n\nThe behavior of the \",\" command when an end-of-file condition has been encountered varies. Some implementations set the cell at the pointer to 0, some set it to the C constant EOF (in practice this is usually -1), some leave the cell's value unchanged. There is no real consensus; arguments for the three behaviors are as follows.\n\nSetting the cell to 0 avoids the use of negative numbers, and makes it marginally more concise to write a loop that reads characters until EOF occurs. This is a language extension devised by Panu Kalliokoski.\n\nSetting the cell to -1 allows EOF to be distinguished from any byte value (if the cells are larger than bytes), which is necessary for reading non-textual data; also, it is the behavior of the C translation of \",\" given in Müller's readme file. However, it is not obvious that those C translations are to be taken as normative.\n\nLeaving the cell's value unchanged is the behavior of Urban Müller's brainfuck compiler. This behavior can easily coexist with either of the others; for instance, a program that assumes EOF0 can set the cell to 0 before each \",\" command, and will then work correctly on implementations that do either EOF\n0 or EOF=\"no change\". It is so easy to accommodate the \"no change\" behavior that any brainfuck programmer interested in portability should do so.\n\nDerivatives \n\nMany people have created brainfuck equivalents (languages with commands that directly map to brainfuck) or brainfuck derivatives (languages that extend its behavior or map it into new semantic territory).\n\nSome examples:\n* Pi, which maps brainfuck into errors in individual digits of Pi.\n* VerboseFuck, which looks like a traditional programming language, only what appears as parameters or expressions are actually parts of longer commands that cannot be altered.\n* DerpPlusPlus, in which the commands are replaced with words such as 'HERP', 'DERP', 'GIGITY', etc.\n* Ook!, which maps brainfuck's eight commands to two-word permutations of \"Ook.\", \"Ook?\", and \"Ook!\", jokingly designed to be \"writable and readable by orang-utans\" according to its creator, a reference to the orang-utan Librarian in the novels of Terry Pratchett.\n* Ternary, similar in concept to Ook! but instead consisting of permutations of the ASCII characters 0, 1, and 2.\n*BodyFuck, a BrainFuck implementation based on a gesture-controlled system so that programmer's movements are captured by a video camera and converted into the 8 possible characters.\n \nHowever, there are also unnamed minor variants (or dialects), possibly formed as a result of inattention, of which some of the more common are:\n* forbidding, rather than ignoring, any non-command characters in brainfuck programs\n* introducing a comment marker which comments out the rest of the line\n* various alterations of the loop semantics, sometimes destroying Turing completeness\n* requiring a special character to mark the end of the program. Brainfuck. http://en.wikipedia.org/?curid=4086."
  }
}
