{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15842",
  "eid" : "1f25d6f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778561503,
  "textBody" : "Events\n\n* 226 – Cao Pi dies after an illness; his son Cao Rui succeeds him as emperor of the Kingdom of Wei.\n*1149 – Raymond of Poitiers is defeated and killed at the Battle of Inab by Nur ad-Din Zangi.\n*1194 – Sverre is crowned King of Norway.\n*1444 – Skanderbeg defeats an Ottoman invasion force at Torvioll.\n*1534 – Jacques Cartier is the first European to reach Prince Edward Island.\n*1613 – The Globe Theatre in London burns to the ground.\n*1644 – Charles I of England defeats a Parliamentarian detachment at the Battle of Cropredy Bridge.\n*1659 – At the Battle of Konotop the Ukrainian armies of Ivan Vyhovsky defeat the Russians led by Prince Trubetskoy.\n*1786 – Alexander Macdonell and over five hundred Roman Catholic highlanders leave Scotland to settle in Glengarry County, Ontario.\n*1807 – Russo-Turkish War: Admiral Dmitry Senyavin destroys the Ottoman fleet in the Battle of Athos.\n*1850 – Autocephaly officially granted by the Ecumenical Patriarchate of Constantinople to the Church of Greece.\n*1864 – Ninety-nine people are killed in Canada's worst railway disaster near St-Hilaire, Quebec.\n*1874 – Greek politician Charilaos Trikoupis publishes a manifesto in the Athens daily Kairoi entitled \"Who's to Blame?\" leveling complaints against King George. Trikoupis is elected Prime Minister of Greece the next year.\n*1880 – France annexes Tahiti.\n*1881 – In Sudan, Muhammad Ahmad declares himself to be the Mahdi, the messianic redeemer of Islam.\n*1888 – George Edward Gouraud records Handel's Israel in Egypt onto a phonograph cylinder, thought for many years to be the oldest known recording of music.\n*1889 – Hyde Park and several other Illinois townships vote to be annexed by Chicago, forming the largest United States city in area and second largest in population at the time.\n*1915 – The North Saskatchewan River flood of 1915 is the worst flood in Edmonton history.\n*1916 – British diplomat turned Irish nationalist Roger Casement is sentenced to death for his part in the Easter Rising.\n*1922 – France grants 1 km² at Vimy Ridge \"freely, and for all time, to the Government of Canada, the free use of the land exempt from all taxes\".\n*1927 – The Bird of Paradise, a U.S. Army Air Corps Fokker tri-motor, completes the first transpacific flight, from the mainland United States to Hawaii.\n*1945 – Carpathian Ruthenia is annexed by the Soviet Union.\n*1950 – Korean War: U.S. President Harry S. Truman authorized a sea blockade of Korea.\n*1956 – The Federal Aid Highway Act of 1956 is signed, officially creating the United States Interstate Highway System.\n*1972 – The United States Supreme Court rules in the case Furman v. Georgia that arbitrary and inconsistent imposition of the death penalty violates the Eighth and Fourteenth Amendments, and constitutes cruel and unusual punishment.\n*1974 – Isabel Perón is sworn in as the first female President of Argentina. \n*  1974   – Mikhail Baryshnikov defects from the Soviet Union to Canada while on tour with the Kirov Ballet.\n*1975 – Steve Wozniak tested his first prototype of Apple I computer.\n*1976 – The Seychelles become independent from the United Kingdom.\n*  1976   – The Conference of Communist and Workers Parties of Europe convenes in East Berlin.\n*1987 – Vincent Van Gogh’s painting, the Le Pont de Trinquetaille, was bought for $20.4 million at an auction in London, England.\n*1995 – Space Shuttle program: STS-71 Mission (Atlantis) docks with the Russian space station Mir for the first time.\n*  1995   – The Sampoong Department Store collapses in the Seocho District of Seoul, South Korea, killing 501 and injuring 937.\n*2002 – Naval clashes between South Korea and North Korea lead to the death of six South Korean sailors and sinking of a North Korean vessel.\n*2006 – Hamdan v. Rumsfeld: The U.S. Supreme Court rules that President George W. Bush's plan to try Guantanamo Bay detainees in military tribunals violates U.S. and international law.\n*2007 – Apple Inc. releases its first mobile phone, the iPhone.\n*2012 – A derecho sweeps across the eastern United States, leaving at least 22 people dead and millions without power.\n*2014 – The Islamic State of Iraq and the Levant self-declared its caliphate in Syria and northern Iraq.\n\nBirths\n\n*1136 – Petronilla of Aragon (d. 1173)\n*1326 – Murad I, Ottoman Sultan (d. 1389)\n*1398 – John II of Aragon and Navarre (d. 1479)\n*1443 – Anthony Browne, English knight (d. 1506)\n*1482 – Maria of Aragon, Queen of Portugal (d. 1517)\n*1488 – Pedro Pacheco de Villena, Catholic cardinal (d. 1560)\n*1517 – Rembert Dodoens, Flemish physician and botanist (d. 1585)\n*1525 – Peter Agricola, German humanist, theologian, diplomat and statesman (d. 1585)\n*1528 – Julius, Duke of Brunswick-Lüneburg (d. 1589)\n*1543 – Christine of Hesse, Duchess consort of Holstein-Gottorp (d. 1604)\n*1596 – Emperor Go-Mizunoo of Japan (d. 1680)\n*1621 – Willem van der Zaan, Dutch Admiral (d. 1669)\n*1746 – Joachim Heinrich Campe, German linguist, author, and educator (d. 1818)\n*1768 – Vincenzo Dimech, Maltese sculptor (d. 1831)\n*1793 – Josef Ressel, Czech-Austrian inventor, invented the propeller (d. 1857)\n*1798 – Willibald Alexis, German author and poet (d. 1871)\n*  1798   – Giacomo Leopardi, Italian poet and philosopher (d. 1837)\n*1803 – John Newton Brown, American minister and author (d. 1868)\n*1818 – Angelo Secchi, Italian astronomer and academic (d. 1878)\n*1819 – Thomas Dunn English, American poet, playwright, and politician (d. 1902)\n*1833 – Peter Waage, Norwegian chemist and academic (d. 1900)\n*1835 – Celia Thaxter, American poet and story writer (d. 1894)\n*1844 – Peter I of Serbia (d. 1921)\n*1849 – Pedro Montt, Chilean lawyer and politician, 15th President of Chile (d. 1910)\n*  1849   – Sergei Witte, Russian politician, 1st Chairmen of Council of Ministers of the Russian Empire (d. 1915)\n*  1849   – John Hunn, American businessman and politician, 51st Governor of Delaware (d. 1926)\n*1858 – George Washington Goethals, American general and engineer, co-designed the Panama Canal (d. 1928)\n*  1858   – Julia Lathrop, American activist and politician (d. 1932)\n*1861 – William James Mayo, American physician and surgeon, co-founded the Mayo Clinic (d. 1939)\n*1863 – Wilbert Robinson, American baseball player, coach, and manager (d. 1934)\n*1866 – Bartholomeus Roodenburch, Dutch swimmer (d. 1939)\n*1868 – George Ellery Hale, American astronomer and journalist (d. 1938)\n*1870 – Joseph Carl Breil, American tenor, composer, and director (d. 1926)\n*1873 – Leo Frobenius, German ethnologist and archaeologist (d. 1938)\n*1879 – Benedetto Aloisi Masella, Italian cardinal (d. 1970)\n*1880 – Ludwig Beck, German general (d. 1944)\n*1881 – Harry Frazee, American director, producer, and agent (d. 1929)\n*  1881   – Curt Sachs, German-American composer and musicologist (d. 1959)\n*1882 – Henry Hawtrey, English runner (d. 1961)\n*  1882   – Franz Seldte, German captain and politician, Reich Minister for Labour (d. 1947)\n*1886 – Robert Schuman, Luxembourgian-French lawyer and politician, Prime Minister of France (d. 1963)\n*1888 – Squizzy Taylor, Australian gangster (d. 1927)\n*1889 – Willie Macfarlane, Scottish-American golfer (d. 1961)\n*1890 – Robert Laurent, American sculptor and academic (d. 1970)\n*  1890   – Hendrikje van Andel-Schipper, Dutch supercentenarian (d. 2005)\n*1893 – Prasanta Chandra Mahalanobis, Indian economist and statistician (d. 1972)\n*  1893   – Aarre Merikanto, Finnish composer and educator (d. 1958)\n*1897 – Fulgence Charpentier, Canadian journalist and publisher (d. 2001)\n*1898 – Yvonne Lefébure, French pianist and educator (d. 1986)\n*1900 – Antoine de Saint-Exupéry, French poet and pilot (d. 1944)\n*1901 – Nelson Eddy, American singer and actor (d. 1967)\n*1903 – Alan Blumlein, English engineer, developed the H2S radar (d. 1942)\n*1904 – Witold Hurewicz, Polish mathematician (d. 1956)\n*1906 – Ivan Chernyakhovsky, Ukrainian general (d. 1945)\n*  1906   – Heinz Harmel, German general (d. 2000)\n*1908 – Leroy Anderson, American composer and conductor (d. 1975)\n*  1908   – Erik Lundqvist, Swedish javelin thrower (d. 1963)\n*1910 – Frank Loesser, American composer and conductor (d. 1969)\n*  1910   – Burgess Whitehead, American baseball player (d. 1993)\n*1911 – Prince Bernhard of Lippe-Biesterfeld (d. 2004)\n*  1911   – Katherine DeMille, Canadian-American actress (d. 1995)\n*  1911   – Bernard Herrmann, American composer and conductor (d. 1975)\n*1912 – José Pablo Moncayo, Mexican pianist, composer, and conductor (d. 1958)\n*  1912   – Émile Peynaud, French oenologist and academic (d. 2004)\n*  1912   – John Toland, American historian and author (d. 2004)\n*1913 – Earle Meadows, American pole vaulter (d. 1992)\n*1914 – Rafael Kubelík, Czech-American conductor and composer (d. 1996)\n*  1914   – Christos Papakyriakopoulos, Greek-American mathematician and academic (d. 1976)\n*1916 – Ruth Warrick, American actress and activist (d. 2005)\n*1917 – Ling Yun, Chinese politician\n*1918 – Heini Lohrer, Swiss ice hockey player (d. 2011)\n*  1918   – Gene La Rocque, U.S admiral (d. 2016)\n*  1918   – Francis W. Nye, United States Air Force major general\n*1919 – Ernesto Corripio y Ahumada, Mexican cardinal (d. 2008)\n*  1919   – Walter Babington Thomas, Commander of British Far East Land Forces (d. 2017)\n*  1919   – Slim Pickens, American actor and rodeo performer (d. 1983)\n*1920 – César Rodríguez Álvarez, Spanish footballer and manager (d. 1995)\n*  1920   – Ray Harryhausen, American animator and producer (d. 2013)\n*  1920   – Nicole Russell, Duchess of Bedford (d. 2012) \n*1921 – Frédéric Dard, French author and screenwriter (d. 2000)\n*  1921   – Jean Kent, English actress (d. 2013)\n*  1921   – Reinhard Mohn, German businessman (d. 2009)\n*  1921   – Harry Schell, French-American race car driver (d. 1960)\n*1922 – Ralph Burns, American songwriter, bandleader, composer, conductor, arranger and pianist (d. 2001)\n*  1922   – Vasko Popa, Serbian poet and academic (d. 1991)\n*  1922   – John William Vessey, Jr., American general (d. 2016)\n*1923 – Chou Wen-chung, Chinese-American composer and educator\n*1924 – Ezra Laderman, American composer and educator (d. 2015)\n*  1924   – Roy Walford, American pathologist and gerontologist (d. 2004)\n*1925 – Francis S. Currey, American World War II Medal of Honor recipient\n*  1925   – Giorgio Napolitano, Italian journalist and politician, 11th President of Italy\n*  1925   – Chan Parker, American dancer and author (d. 1999)\n*  1925   – Jackie Lynn Taylor, American actress (d. 2014)\n*  1925   – Cara Williams, American actress \n*1926 – Jaber Al-Ahmad Al-Sabah, Kuwaiti ruler, 3rd Emir of Kuwait (d. 2006)\n*  1926   – Julius W. Becton, Jr., U.S lieutenant general\n*  1926   – Roger Stuart Bacon, 21st Premier of Nova Scotia from 1990 to 1991.\n*  1926   – Bobby Morgan, American professional baseball player\n*1927 – Pierre Perrault, Canadian director and screenwriter (d. 1999)\n*1928 – Ian Bannen, Scottish actor (d. 1999)\n*  1928   – Jean-Louis Pesch, French author and illustrator\n*  1928   – Radius Prawiro, Indonesian economist and politician (d. 2005)\n*1929 – Pat Crawford Brown, American actress\n*  1929   – Pete George, American weightlifter\n*  1929   – Oriana Fallaci, Italian journalist and author (d. 2006)\n*1930 – Ernst Albrecht, German economist and politician, 6th Prime Minister of Lower Saxony (d. 2014)\n*  1930   – Robert Evans, American actor and producer\n*  1930   – Viola Léger, American-Canadian actress and politician\n*  1930   – Sławomir Mrożek, Polish-French author and playwright (d. 2013)\n*1931 – Sevim Burak, Turkish author (d. 1983)\n*1932 – Brian Hutton, Baron Hutton, British jurist; Lord Chief Justice of Northern Ireland\n*1933 – Bob Shaw, American baseball player and manager (d. 2010)\n*  1933   – John Bradshaw, American theologian and author (d. 2016)\n*1934 – Corey Allen, American actor, director, and producer (d. 2010)\n*1935 – Vassilis C. Constantakopoulos, Greek captain and businessman (d. 2011)\n*  1935   – Katsuya Nomura, Japanese baseball player and manager\n*1936 – Harmon Killebrew, American baseball player and sportscaster (d. 2011)\n*1939 – Alan Connolly, Australian cricketer\n*  1939   – Amarildo Tavares da Silveira, Brazilian footballer and coach\n*1940 – Vyacheslav Artyomov, Russian composer\n*  1940   – John Dawes, Welsh rugby player and coach\n*1941 – John Boccabella, American baseball player\n*  1941   – Stokely Carmichael, Trinidadian-American activist (d. 1998)\n*1942 – Charlotte Bingham, English author and screenwriter\n*  1942   – Mike Willesee, Australian journalist and producer\n*1943 – Little Eva, American singer (d. 2003)\n*  1943   – Louis Nicollin, French entrepreneur and chairman of Montpellier HSC from 1974 to his death (d. 2017)\n*1944 – Gary Busey, American actor \n*  1944   – Andreu Mas-Colell, Spanish economist, academic, and politician\n*  1944   – Seán Patrick O'Malley, American cardinal\n*1945 – Chandrika Kumaratunga, Sri Lankan journalist and politician, 5th President of Sri Lanka\n*1946 – Ernesto Pérez Balladares, Panamanian politician, 33rd President of Panama\n*  1946   – Egon von Fürstenberg, Swiss fashion designer (d. 2004)\n*1947 – Richard Lewis, American actor and screenwriter\n*1948 – Sean Bergin, South African-Dutch saxophonist and flute player (d. 2012)\n*  1948   – Fred Grandy, American actor and politician\n*  1948   – Ian Paice, English drummer, songwriter, and producer \n*  1948   – Usha Prashar, Baroness Prashar, Kenyan-English politician\n*1949 – Dan Dierdorf, American football player and sportscaster\n*  1949   – Joan Clos, Spanish anesthesiologist and politician, 116th Mayor of Barcelona\n*  1949   – Ann Veneman, American lawyer and politician, 27th United States Secretary of Agriculture\n*1950 – Bobby London, American illustrator\n*1951 – Craig Sager, American sportscaster (d. 2016)\n*1953 – Don Dokken, American singer-songwriter and guitarist (Dokken)\n*  1953   – Colin Hay, Scottish-Australian singer and guitarist, \n*1954 – Rick Honeycutt, American baseball player and coach\n*  1954   – Leovegildo Lins da Gama Júnior, Brazilian footballer, coach, and manager\n*1955 – Charles J. Precourt, American colonel, pilot, and astronaut\n*1956 – Nick Fry, English economist and businessman\n*  1956   – David Burroughs Mattingly, American illustrator and painter\n*  1956   – Pedro Guerrero, Dominican-American baseball player and manager\n*  1956   – Pedro Santana Lopes, Portuguese lawyer and politician, 118th Prime Minister of Portugal\n*  1956   – Pyotr Vasilevsky, Belarusian footballer and manager (d. 2012)\n*1957 – Gurbanguly Berdimuhamedow, Turkmen dentist and politician, 2nd President of Turkmenistan\n*  1957   – María Conchita Alonso, Cuban-Venezuelan singer and actress\n*  1957   – Robert Forster, Australian singer-songwriter and guitarist \n*  1957   – Michael Nutter, American politician, 98th Mayor of Philadelphia\n*  1957   – Terry Wyatt, English physicist and academic\n*1958 – Dieter Althaus, German politician\n*  1958   – Rosa Mota, Portuguese runner\n*1961 – Sharon Lawrence, American actress, singer, and dancer\n*1962 – Amanda Donohoe, English actress\n*  1962   – Joan Laporta, Spanish lawyer and politician\n*  1962   – George D. Zamka, American colonel, pilot, and astronaut\n*1963 – Anne-Sophie Mutter, German violinist\n*1964 – Stedman Pearson, English singer-songwriter and dancer \n*1965 – Tripp Eisen, American guitarist \n*  1965   – Paul Jarvis, English cricketer\n*1966 – Yoko Kamio, Japanese author and comic artist\n*1967 – Jeff Burton, American race car driver\n*  1967   – Melora Hardin, American actress and singer\n*  1967   – Seamus McGarvey, Northern Irish cinematographer\n*1968 – Brian d'Arcy James, American actor and musician\n*  1968   – Theoren Fleury, Canadian ice hockey player\n*  1968   – Judith Hoag, American actress and educator\n*1969 – Claude Béchard, Canadian politician (d. 2010)\n*  1969   – Pavlos Dermitzakis, Greek footballer and manager\n*  1969   – Tōru Hashimoto, Japanese lawyer and politician\n*1970 – Melanie Paschke, German sprinter\n*  1970   – Emily Skinner, American actress and singer\n*1971 – Matthew Good, Canadian singer-songwriter and guitarist \n*1973 – George Hincapie, American cyclist\n*1976 – Daniel Carlsson, Swedish race car driver\n*  1976   – Bret McKenzie, New Zealand comedian, actor, musician, songwriter, and producer\n*1977 – Sotiris Liberopoulos, Greek footballer\n*  1977   – Zuleikha Robinson, English actress\n*1978 – Nicole Scherzinger, American singer-songwriter, dancer, and actress  \n*1979 – Matthew Bode, Australian footballer\n*  1979   – Andy O'Brien, English footballer\n*  1979   – Marleen Veldhuis, Dutch swimmer\n*1980 – Katherine Jenkins, Welsh soprano and actress\n*1981 – Luke Branighan, Australian rugby league player\n*  1981   – Joe Johnson, American basketball player\n*  1981   – Nicolás Vuyovich, Argentinian race car driver (d. 2005)\n*  1981   – Shmuly Yanklowitz, American rabbi, author, and educator\n*1982 – Dusty Hughes, American baseball player\n*  1982   – Lily Rabe, American actress\n*1983 – Aundrea Fimbres, American singer-songwriter and dancer \n*  1983   – Jeremy Powers, American cyclist\n*  1984   – Aleksandr Shustov, Russian high jumper\n*1985 – Quintin Demps, American football player\n*1986 – José Manuel Jurado, Spanish footballer\n*  1986   – Edward Maya, Romanian singer-songwriter and producer \n*1987 – Ana Free, Portuguese singer-songwriter\n*  1987   – Ilya Shesterkov, Russian footballer\n*1988 – Éver Banega, Argentinian footballer\n*1990 – Kim Little, Scottish footballer\n*1990 – Yann M'Vila, French footballer\n*1991 – Suk Hyun-jun, South Korean footballer\n*  1991   – Kawhi Leonard, American basketball player\n*1991 – R. Jeeva, Indian Tamil Musician\n*1996 – Joseph Manu, New Zealand rugby league player\n\nDeaths\n\n* 226 – Cao Pi, Chinese emperor (b. 187)\n* 884 – Yang Shili, general of the Tang Dynasty\n* 976 – Gero, archbishop of Cologne\n*1059 – Bernard II, Duke of Saxony (b. 995)\n*1149 – Raymond of Poitiers, Prince of Antioch (b. 1115)\n*1153 – Óláfr Guðrøðarson, King of the Isles\n*1252 – Abel, King of Denmark (b. 1218)\n*1293 – Henry of Ghent, philosopher (b. c.1217)\n*1315 – Ramon Llull, Spanish philosopher (b. 1235)\n*1344 – Joan of Savoy, duchess consort of Brittany, throne claimant of Savoy (b. 1310)\n*1374 – Jan Milíč of Kroměříž, Czech priest and reformer\n*1432 – Janus of Cyprus (b. 1375)\n*1509 – Margaret Beaufort, Countess of Richmond and Derby (b. 1443)\n*1520 – Moctezuma II, Aztec ruler (b. 1466)\n*1575 – Baba Nobuharu, Japanese samurai (b. 1515)\n*1594 – Niels Kaas, Danish politician, Chancellor of Denmark (b. 1535)\n*1626 – Scipione Cobelluzzi, Italian cardinal and archivist (b. 1564)\n*1646 – Laughlin Ó Cellaigh, Gaelic-Irish Lord\n*1725 – Arai Hakuseki, Japanese philosopher, academic, and politician (b. 1657)\n*1729 – Edward Taylor, American-English poet, pastor, and physician (b. circa 1642)\n*1744 – André Campra, French composer and conductor (b. 1660)\n*1764 – Ralph Allen, English businessman and philanthropist (b. 1693)\n*1779 – Anton Raphael Mengs, German painter (b. 1728)\n*1831 – Heinrich Friedrich Karl vom und zum Stein, Prussian minister and politician (b. 1757)\n*1840 – Lucien Bonaparte, French prince (b. 1775)\n*1852 – Henry Clay, American lawyer and politician, 9th United States Secretary of State (b. 1777)\n*1853 – Adrien-Henri de Jussieu, French botanist and academic (b. 1797)\n*1855 – John Gorrie, American physician and humanitarian (b. 1803)\n*1860 – Thomas Addison, English physician and endocrinologist (b. 1793)\n*1861 – Elizabeth Barrett Browning, English poet and translator (b. 1806)\n*1873 – Michael Madhusudan Dutt, Indian poet and playwright (b. 1824)\n*1875 – Ferdinand I of Austria (b. 1793)\n*1895 – Thomas Henry Huxley, English biologist (b. 1825)\n*1900 – Ivan Mikheevich Pervushin, Russian mathematician and academic (b. 1827)\n*1907 – Konstantinos Volanakis, Greek painter and academic (b. 1837)\n*1919 – José Gregorio Hernández Venezuelan physician and educator (b. 1864)\n*1931 – Nérée Beauchemin, Canadian poet and physician (b. 1850)\n*1933 – Roscoe Arbuckle, American actor, director, and screenwriter (b. 1887)\n*1935 – Jack O'Neill, Irish-American baseball player and manager (b. 1873)\n*1936 – János Szlepecz, Slovene priest and missionary (b. 1872)\n*1940 – Paul Klee, Swiss painter and illustrator (b. 1879)\n*1941 – Ignacy Jan Paderewski, Polish pianist, composer, and politician, 2nd Prime Minister of Poland (b. 1860)\n*1942 – Paul Troje, German politician, Mayor of Marburg (b. 1864)\n*1949 – Themistoklis Sofoulis, Greek politician, 115th Prime Minister of Greece (b. 1860)\n*1955 – Max Pechstein, German painter and academic (b. 1881)\n*1960 – Frank Patrick, Canadian ice hockey player and coach (b. 1885)\n*1964 – Eric Dolphy, American saxophonist, composer, and bandleader (b. 1928)\n*1967 – Primo Carnera, Italian boxer and actor (b. 1906)\n*  1967   – Jayne Mansfield, American actress (b. 1933)\n*1969 – Moise Tshombe, Congolese accountant and politician, Prime Minister of the Democratic Republic of the Congo (b. 1919)\n*1975 – Tim Buckley, American singer-songwriter and guitarist (b. 1947)\n*1978 – Bob Crane, American actor (b. 1928)\n*1979 – Lowell George, American singer-songwriter, guitarist, and producer (b. 1945)\n*1981 – Russell Drysdale, English-Australian painter (b. 1912)\n*1982 – Pierre Balmain, French fashion designer, founded Balmain (b. 1914)\n*  1982   – Henry King, American actor, director, producer, and screenwriter (b. 1886)\n*1986 – Frank Wise, Australian politician, 16th Premier of Western Australia (b. 1897)\n*1990 – Irving Wallace, American author and screenwriter (b. 1916)\n*1992 – Mohamed Boudiaf, Algerian soldier and politician, President of Algeria (b. 1919)\n*1993 – Héctor Lavoe, Puerto Rican-American singer-songwriter (b. 1946)\n*1994 – Kurt Eichhorn, German conductor and educator (b. 1908)\n*1995 – Lana Turner, American actress (b. 1921)\n*1997 – William Hickey, American actor (b. 1927)\n*1998 – Horst Jankowski, German pianist and composer (b. 1936)\n*1999 – Karekin I, Syrian-Armenian patriarch (b. 1950)\n*  1999   – Allan Carr, American screenwriter and producer (b. 1937)\n*2000 – Vittorio Gassman, Italian actor and director (b. 1922)\n*2002 – Rosemary Clooney, American singer and actress (b. 1928)\n*2003 – Katharine Hepburn, American actress (b. 1907)\n*2004 – Bernard Babior, American physician and biochemist (b. 1935)\n*  2004   – Alvin Hamilton, Canadian lieutenant and politician, 18th Canadian Minister of Agriculture (b. 1912)\n*2006 – Fabián Bielinsky, Argentinian director and screenwriter (b. 1959)\n*  2006   – Randy Walker, American football player and coach (b. 1954)\n*2007 – Fred Saberhagen, American soldier and author (b. 1930)\n*  2007   – Joel Siegel, American journalist and critic (b. 1943)\n*2009 – Joe Bowman, American marksman, target shooter and boot-maker (b. 1925)\n*2011 – K. D. Sethna,  Indian poet, scholar, writer, philosopher, and cultural critic (b. 1904) \n*2012 – Yong Nyuk Lin, Singaporean politician, Singaporean Minister of Health (b. 1918) \n*  2012   – Vincent Ostrom, American political scientist and academic (b. 1919)\n*  2012   – Juan Reccius, Chilean triple jumper (b. 1911)\n*  2012   – Floyd Temple, American baseball player, coach, and manager (b. 1926)\n*2013 – Peter Fitzgerald, Irish footballer and manager (b. 1937)\n*  2013   – Jack Gotta, American-Canadian football player, coach, and manager (b. 1929)\n*  2013   – Margherita Hack, Italian astrophysicist and author (b. 1922)\n*  2013   – Gilma Jiménez, Colombian politician (b. 1956)\n*2014 – Damian D'Oliveira, South African cricketer (b. 1960)\n*  2014   – Dermot Healy, Irish author, poet, and playwright (b. 1947)\n*2015 – Hisham Barakat, Egyptian lawyer and judge (b. 1950)\n*  2015   – Josef Masopust, Czech footballer and coach (b. 1931)\n*  2015   – Charles Pasqua, French businessman and politician, French Minister of the Interior (b. 1927)\n*2017 – Louis Nicollin, French entrepreneur and chairman of Montpellier HSC from 1974 to his death (b. 1943)\n*  2017   – Dave Semenko, Canadian ice hockey player (b. 1957)\n\nHolidays and observances\n\n*Christian feast day:\n**Cassius of Narni\n**Feast of Saints Peter and Paul (Western Christianity), and its related observances:\n***Haro Wine Festival (Haro, La Rioja)\n***l-Imnarja (Malta)\n**June 29 (Eastern Orthodox liturgics)\n*Engineer's Day (Ecuador)\n*Independence Day (Seychelles), celebrates the independence of Seychelles from the United Kingdom in 1976.\n*Veterans' Day (Netherlands)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "June 29" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15842" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 226 – Cao Pi dies after an illness; his son Cao Rui succeeds him as emperor of the Kingdom of Wei.\n*1149 – Raymond of Poitiers is defeated and killed at the Battle of Inab by Nur ad-Din Zangi.\n*1194 – Sverre is crowned King of Norway.\n*1444 – Skanderbeg defeats an Ottoman invasion force at Torvioll.\n*1534 – Jacques Cartier is the first European to reach Prince Edward Island.\n*1613 – The Globe Theatre in London burns to the ground.\n*1644 – Charles I of England defeats a Parliamentarian detachment at the Battle of Cropredy Bridge.\n*1659 – At the Battle of Konotop the Ukrainian armies of Ivan Vyhovsky defeat the Russians led by Prince Trubetskoy.\n*1786 – Alexander Macdonell and over five hundred Roman Catholic highlanders leave Scotland to settle in Glengarry County, Ontario.\n*1807 – Russo-Turkish War: Admiral Dmitry Senyavin destroys the Ottoman fleet in the Battle of Athos.\n*1850 – Autocephaly officially granted by the Ecumenical Patriarchate of Constantinople to the Church of Greece.\n*1864 – Ninety-nine people are killed in Canada's worst railway disaster near St-Hilaire, Quebec.\n*1874 – Greek politician Charilaos Trikoupis publishes a manifesto in the Athens daily Kairoi entitled \"Who's to Blame?\" leveling complaints against King George. Trikoupis is elected Prime Minister of Greece the next year.\n*1880 – France annexes Tahiti.\n*1881 – In Sudan, Muhammad Ahmad declares himself to be the Mahdi, the messianic redeemer of Islam.\n*1888 – George Edward Gouraud records Handel's Israel in Egypt onto a phonograph cylinder, thought for many years to be the oldest known recording of music.\n*1889 – Hyde Park and several other Illinois townships vote to be annexed by Chicago, forming the largest United States city in area and second largest in population at the time.\n*1915 – The North Saskatchewan River flood of 1915 is the worst flood in Edmonton history.\n*1916 – British diplomat turned Irish nationalist Roger Casement is sentenced to death for his part in the Easter Rising.\n*1922 – France grants 1 km² at Vimy Ridge \"freely, and for all time, to the Government of Canada, the free use of the land exempt from all taxes\".\n*1927 – The Bird of Paradise, a U.S. Army Air Corps Fokker tri-motor, completes the first transpacific flight, from the mainland United States to Hawaii.\n*1945 – Carpathian Ruthenia is annexed by the Soviet Union.\n*1950 – Korean War: U.S. President Harry S. Truman authorized a sea blockade of Korea.\n*1956 – The Federal Aid Highway Act of 1956 is signed, officially creating the United States Interstate Highway System.\n*1972 – The United States Supreme Court rules in the case Furman v. Georgia that arbitrary and inconsistent imposition of the death penalty violates the Eighth and Fourteenth Amendments, and constitutes cruel and unusual punishment.\n*1974 – Isabel Perón is sworn in as the first female President of Argentina. \n*  1974   – Mikhail Baryshnikov defects from the Soviet Union to Canada while on tour with the Kirov Ballet.\n*1975 – Steve Wozniak tested his first prototype of Apple I computer.\n*1976 – The Seychelles become independent from the United Kingdom.\n*  1976   – The Conference of Communist and Workers Parties of Europe convenes in East Berlin.\n*1987 – Vincent Van Gogh’s painting, the Le Pont de Trinquetaille, was bought for $20.4 million at an auction in London, England.\n*1995 – Space Shuttle program: STS-71 Mission (Atlantis) docks with the Russian space station Mir for the first time.\n*  1995   – The Sampoong Department Store collapses in the Seocho District of Seoul, South Korea, killing 501 and injuring 937.\n*2002 – Naval clashes between South Korea and North Korea lead to the death of six South Korean sailors and sinking of a North Korean vessel.\n*2006 – Hamdan v. Rumsfeld: The U.S. Supreme Court rules that President George W. Bush's plan to try Guantanamo Bay detainees in military tribunals violates U.S. and international law.\n*2007 – Apple Inc. releases its first mobile phone, the iPhone.\n*2012 – A derecho sweeps across the eastern United States, leaving at least 22 people dead and millions without power.\n*2014 – The Islamic State of Iraq and the Levant self-declared its caliphate in Syria and northern Iraq.\n\nBirths\n\n*1136 – Petronilla of Aragon (d. 1173)\n*1326 – Murad I, Ottoman Sultan (d. 1389)\n*1398 – John II of Aragon and Navarre (d. 1479)\n*1443 – Anthony Browne, English knight (d. 1506)\n*1482 – Maria of Aragon, Queen of Portugal (d. 1517)\n*1488 – Pedro Pacheco de Villena, Catholic cardinal (d. 1560)\n*1517 – Rembert Dodoens, Flemish physician and botanist (d. 1585)\n*1525 – Peter Agricola, German humanist, theologian, diplomat and statesman (d. 1585)\n*1528 – Julius, Duke of Brunswick-Lüneburg (d. 1589)\n*1543 – Christine of Hesse, Duchess consort of Holstein-Gottorp (d. 1604)\n*1596 – Emperor Go-Mizunoo of Japan (d. 1680)\n*1621 – Willem van der Zaan, Dutch Admiral (d. 1669)\n*1746 – Joachim Heinrich Campe, German linguist, author, and educator (d. 1818)\n*1768 – Vincenzo Dimech, Maltese sculptor (d. 1831)\n*1793 – Josef Ressel, Czech-Austrian inventor, invented the propeller (d. 1857)\n*1798 – Willibald Alexis, German author and poet (d. 1871)\n*  1798   – Giacomo Leopardi, Italian poet and philosopher (d. 1837)\n*1803 – John Newton Brown, American minister and author (d. 1868)\n*1818 – Angelo Secchi, Italian astronomer and academic (d. 1878)\n*1819 – Thomas Dunn English, American poet, playwright, and politician (d. 1902)\n*1833 – Peter Waage, Norwegian chemist and academic (d. 1900)\n*1835 – Celia Thaxter, American poet and story writer (d. 1894)\n*1844 – Peter I of Serbia (d. 1921)\n*1849 – Pedro Montt, Chilean lawyer and politician, 15th President of Chile (d. 1910)\n*  1849   – Sergei Witte, Russian politician, 1st Chairmen of Council of Ministers of the Russian Empire (d. 1915)\n*  1849   – John Hunn, American businessman and politician, 51st Governor of Delaware (d. 1926)\n*1858 – George Washington Goethals, American general and engineer, co-designed the Panama Canal (d. 1928)\n*  1858   – Julia Lathrop, American activist and politician (d. 1932)\n*1861 – William James Mayo, American physician and surgeon, co-founded the Mayo Clinic (d. 1939)\n*1863 – Wilbert Robinson, American baseball player, coach, and manager (d. 1934)\n*1866 – Bartholomeus Roodenburch, Dutch swimmer (d. 1939)\n*1868 – George Ellery Hale, American astronomer and journalist (d. 1938)\n*1870 – Joseph Carl Breil, American tenor, composer, and director (d. 1926)\n*1873 – Leo Frobenius, German ethnologist and archaeologist (d. 1938)\n*1879 – Benedetto Aloisi Masella, Italian cardinal (d. 1970)\n*1880 – Ludwig Beck, German general (d. 1944)\n*1881 – Harry Frazee, American director, producer, and agent (d. 1929)\n*  1881   – Curt Sachs, German-American composer and musicologist (d. 1959)\n*1882 – Henry Hawtrey, English runner (d. 1961)\n*  1882   – Franz Seldte, German captain and politician, Reich Minister for Labour (d. 1947)\n*1886 – Robert Schuman, Luxembourgian-French lawyer and politician, Prime Minister of France (d. 1963)\n*1888 – Squizzy Taylor, Australian gangster (d. 1927)\n*1889 – Willie Macfarlane, Scottish-American golfer (d. 1961)\n*1890 – Robert Laurent, American sculptor and academic (d. 1970)\n*  1890   – Hendrikje van Andel-Schipper, Dutch supercentenarian (d. 2005)\n*1893 – Prasanta Chandra Mahalanobis, Indian economist and statistician (d. 1972)\n*  1893   – Aarre Merikanto, Finnish composer and educator (d. 1958)\n*1897 – Fulgence Charpentier, Canadian journalist and publisher (d. 2001)\n*1898 – Yvonne Lefébure, French pianist and educator (d. 1986)\n*1900 – Antoine de Saint-Exupéry, French poet and pilot (d. 1944)\n*1901 – Nelson Eddy, American singer and actor (d. 1967)\n*1903 – Alan Blumlein, English engineer, developed the H2S radar (d. 1942)\n*1904 – Witold Hurewicz, Polish mathematician (d. 1956)\n*1906 – Ivan Chernyakhovsky, Ukrainian general (d. 1945)\n*  1906   – Heinz Harmel, German general (d. 2000)\n*1908 – Leroy Anderson, American composer and conductor (d. 1975)\n*  1908   – Erik Lundqvist, Swedish javelin thrower (d. 1963)\n*1910 – Frank Loesser, American composer and conductor (d. 1969)\n*  1910   – Burgess Whitehead, American baseball player (d. 1993)\n*1911 – Prince Bernhard of Lippe-Biesterfeld (d. 2004)\n*  1911   – Katherine DeMille, Canadian-American actress (d. 1995)\n*  1911   – Bernard Herrmann, American composer and conductor (d. 1975)\n*1912 – José Pablo Moncayo, Mexican pianist, composer, and conductor (d. 1958)\n*  1912   – Émile Peynaud, French oenologist and academic (d. 2004)\n*  1912   – John Toland, American historian and author (d. 2004)\n*1913 – Earle Meadows, American pole vaulter (d. 1992)\n*1914 – Rafael Kubelík, Czech-American conductor and composer (d. 1996)\n*  1914   – Christos Papakyriakopoulos, Greek-American mathematician and academic (d. 1976)\n*1916 – Ruth Warrick, American actress and activist (d. 2005)\n*1917 – Ling Yun, Chinese politician\n*1918 – Heini Lohrer, Swiss ice hockey player (d. 2011)\n*  1918   – Gene La Rocque, U.S admiral (d. 2016)\n*  1918   – Francis W. Nye, United States Air Force major general\n*1919 – Ernesto Corripio y Ahumada, Mexican cardinal (d. 2008)\n*  1919   – Walter Babington Thomas, Commander of British Far East Land Forces (d. 2017)\n*  1919   – Slim Pickens, American actor and rodeo performer (d. 1983)\n*1920 – César Rodríguez Álvarez, Spanish footballer and manager (d. 1995)\n*  1920   – Ray Harryhausen, American animator and producer (d. 2013)\n*  1920   – Nicole Russell, Duchess of Bedford (d. 2012) \n*1921 – Frédéric Dard, French author and screenwriter (d. 2000)\n*  1921   – Jean Kent, English actress (d. 2013)\n*  1921   – Reinhard Mohn, German businessman (d. 2009)\n*  1921   – Harry Schell, French-American race car driver (d. 1960)\n*1922 – Ralph Burns, American songwriter, bandleader, composer, conductor, arranger and pianist (d. 2001)\n*  1922   – Vasko Popa, Serbian poet and academic (d. 1991)\n*  1922   – John William Vessey, Jr., American general (d. 2016)\n*1923 – Chou Wen-chung, Chinese-American composer and educator\n*1924 – Ezra Laderman, American composer and educator (d. 2015)\n*  1924   – Roy Walford, American pathologist and gerontologist (d. 2004)\n*1925 – Francis S. Currey, American World War II Medal of Honor recipient\n*  1925   – Giorgio Napolitano, Italian journalist and politician, 11th President of Italy\n*  1925   – Chan Parker, American dancer and author (d. 1999)\n*  1925   – Jackie Lynn Taylor, American actress (d. 2014)\n*  1925   – Cara Williams, American actress \n*1926 – Jaber Al-Ahmad Al-Sabah, Kuwaiti ruler, 3rd Emir of Kuwait (d. 2006)\n*  1926   – Julius W. Becton, Jr., U.S lieutenant general\n*  1926   – Roger Stuart Bacon, 21st Premier of Nova Scotia from 1990 to 1991.\n*  1926   – Bobby Morgan, American professional baseball player\n*1927 – Pierre Perrault, Canadian director and screenwriter (d. 1999)\n*1928 – Ian Bannen, Scottish actor (d. 1999)\n*  1928   – Jean-Louis Pesch, French author and illustrator\n*  1928   – Radius Prawiro, Indonesian economist and politician (d. 2005)\n*1929 – Pat Crawford Brown, American actress\n*  1929   – Pete George, American weightlifter\n*  1929   – Oriana Fallaci, Italian journalist and author (d. 2006)\n*1930 – Ernst Albrecht, German economist and politician, 6th Prime Minister of Lower Saxony (d. 2014)\n*  1930   – Robert Evans, American actor and producer\n*  1930   – Viola Léger, American-Canadian actress and politician\n*  1930   – Sławomir Mrożek, Polish-French author and playwright (d. 2013)\n*1931 – Sevim Burak, Turkish author (d. 1983)\n*1932 – Brian Hutton, Baron Hutton, British jurist; Lord Chief Justice of Northern Ireland\n*1933 – Bob Shaw, American baseball player and manager (d. 2010)\n*  1933   – John Bradshaw, American theologian and author (d. 2016)\n*1934 – Corey Allen, American actor, director, and producer (d. 2010)\n*1935 – Vassilis C. Constantakopoulos, Greek captain and businessman (d. 2011)\n*  1935   – Katsuya Nomura, Japanese baseball player and manager\n*1936 – Harmon Killebrew, American baseball player and sportscaster (d. 2011)\n*1939 – Alan Connolly, Australian cricketer\n*  1939   – Amarildo Tavares da Silveira, Brazilian footballer and coach\n*1940 – Vyacheslav Artyomov, Russian composer\n*  1940   – John Dawes, Welsh rugby player and coach\n*1941 – John Boccabella, American baseball player\n*  1941   – Stokely Carmichael, Trinidadian-American activist (d. 1998)\n*1942 – Charlotte Bingham, English author and screenwriter\n*  1942   – Mike Willesee, Australian journalist and producer\n*1943 – Little Eva, American singer (d. 2003)\n*  1943   – Louis Nicollin, French entrepreneur and chairman of Montpellier HSC from 1974 to his death (d. 2017)\n*1944 – Gary Busey, American actor \n*  1944   – Andreu Mas-Colell, Spanish economist, academic, and politician\n*  1944   – Seán Patrick O'Malley, American cardinal\n*1945 – Chandrika Kumaratunga, Sri Lankan journalist and politician, 5th President of Sri Lanka\n*1946 – Ernesto Pérez Balladares, Panamanian politician, 33rd President of Panama\n*  1946   – Egon von Fürstenberg, Swiss fashion designer (d. 2004)\n*1947 – Richard Lewis, American actor and screenwriter\n*1948 – Sean Bergin, South African-Dutch saxophonist and flute player (d. 2012)\n*  1948   – Fred Grandy, American actor and politician\n*  1948   – Ian Paice, English drummer, songwriter, and producer \n*  1948   – Usha Prashar, Baroness Prashar, Kenyan-English politician\n*1949 – Dan Dierdorf, American football player and sportscaster\n*  1949   – Joan Clos, Spanish anesthesiologist and politician, 116th Mayor of Barcelona\n*  1949   – Ann Veneman, American lawyer and politician, 27th United States Secretary of Agriculture\n*1950 – Bobby London, American illustrator\n*1951 – Craig Sager, American sportscaster (d. 2016)\n*1953 – Don Dokken, American singer-songwriter and guitarist (Dokken)\n*  1953   – Colin Hay, Scottish-Australian singer and guitarist, \n*1954 – Rick Honeycutt, American baseball player and coach\n*  1954   – Leovegildo Lins da Gama Júnior, Brazilian footballer, coach, and manager\n*1955 – Charles J. Precourt, American colonel, pilot, and astronaut\n*1956 – Nick Fry, English economist and businessman\n*  1956   – David Burroughs Mattingly, American illustrator and painter\n*  1956   – Pedro Guerrero, Dominican-American baseball player and manager\n*  1956   – Pedro Santana Lopes, Portuguese lawyer and politician, 118th Prime Minister of Portugal\n*  1956   – Pyotr Vasilevsky, Belarusian footballer and manager (d. 2012)\n*1957 – Gurbanguly Berdimuhamedow, Turkmen dentist and politician, 2nd President of Turkmenistan\n*  1957   – María Conchita Alonso, Cuban-Venezuelan singer and actress\n*  1957   – Robert Forster, Australian singer-songwriter and guitarist \n*  1957   – Michael Nutter, American politician, 98th Mayor of Philadelphia\n*  1957   – Terry Wyatt, English physicist and academic\n*1958 – Dieter Althaus, German politician\n*  1958   – Rosa Mota, Portuguese runner\n*1961 – Sharon Lawrence, American actress, singer, and dancer\n*1962 – Amanda Donohoe, English actress\n*  1962   – Joan Laporta, Spanish lawyer and politician\n*  1962   – George D. Zamka, American colonel, pilot, and astronaut\n*1963 – Anne-Sophie Mutter, German violinist\n*1964 – Stedman Pearson, English singer-songwriter and dancer \n*1965 – Tripp Eisen, American guitarist \n*  1965   – Paul Jarvis, English cricketer\n*1966 – Yoko Kamio, Japanese author and comic artist\n*1967 – Jeff Burton, American race car driver\n*  1967   – Melora Hardin, American actress and singer\n*  1967   – Seamus McGarvey, Northern Irish cinematographer\n*1968 – Brian d'Arcy James, American actor and musician\n*  1968   – Theoren Fleury, Canadian ice hockey player\n*  1968   – Judith Hoag, American actress and educator\n*1969 – Claude Béchard, Canadian politician (d. 2010)\n*  1969   – Pavlos Dermitzakis, Greek footballer and manager\n*  1969   – Tōru Hashimoto, Japanese lawyer and politician\n*1970 – Melanie Paschke, German sprinter\n*  1970   – Emily Skinner, American actress and singer\n*1971 – Matthew Good, Canadian singer-songwriter and guitarist \n*1973 – George Hincapie, American cyclist\n*1976 – Daniel Carlsson, Swedish race car driver\n*  1976   – Bret McKenzie, New Zealand comedian, actor, musician, songwriter, and producer\n*1977 – Sotiris Liberopoulos, Greek footballer\n*  1977   – Zuleikha Robinson, English actress\n*1978 – Nicole Scherzinger, American singer-songwriter, dancer, and actress  \n*1979 – Matthew Bode, Australian footballer\n*  1979   – Andy O'Brien, English footballer\n*  1979   – Marleen Veldhuis, Dutch swimmer\n*1980 – Katherine Jenkins, Welsh soprano and actress\n*1981 – Luke Branighan, Australian rugby league player\n*  1981   – Joe Johnson, American basketball player\n*  1981   – Nicolás Vuyovich, Argentinian race car driver (d. 2005)\n*  1981   – Shmuly Yanklowitz, American rabbi, author, and educator\n*1982 – Dusty Hughes, American baseball player\n*  1982   – Lily Rabe, American actress\n*1983 – Aundrea Fimbres, American singer-songwriter and dancer \n*  1983   – Jeremy Powers, American cyclist\n*  1984   – Aleksandr Shustov, Russian high jumper\n*1985 – Quintin Demps, American football player\n*1986 – José Manuel Jurado, Spanish footballer\n*  1986   – Edward Maya, Romanian singer-songwriter and producer \n*1987 – Ana Free, Portuguese singer-songwriter\n*  1987   – Ilya Shesterkov, Russian footballer\n*1988 – Éver Banega, Argentinian footballer\n*1990 – Kim Little, Scottish footballer\n*1990 – Yann M'Vila, French footballer\n*1991 – Suk Hyun-jun, South Korean footballer\n*  1991   – Kawhi Leonard, American basketball player\n*1991 – R. Jeeva, Indian Tamil Musician\n*1996 – Joseph Manu, New Zealand rugby league player\n\nDeaths\n\n* 226 – Cao Pi, Chinese emperor (b. 187)\n* 884 – Yang Shili, general of the Tang Dynasty\n* 976 – Gero, archbishop of Cologne\n*1059 – Bernard II, Duke of Saxony (b. 995)\n*1149 – Raymond of Poitiers, Prince of Antioch (b. 1115)\n*1153 – Óláfr Guðrøðarson, King of the Isles\n*1252 – Abel, King of Denmark (b. 1218)\n*1293 – Henry of Ghent, philosopher (b. c.1217)\n*1315 – Ramon Llull, Spanish philosopher (b. 1235)\n*1344 – Joan of Savoy, duchess consort of Brittany, throne claimant of Savoy (b. 1310)\n*1374 – Jan Milíč of Kroměříž, Czech priest and reformer\n*1432 – Janus of Cyprus (b. 1375)\n*1509 – Margaret Beaufort, Countess of Richmond and Derby (b. 1443)\n*1520 – Moctezuma II, Aztec ruler (b. 1466)\n*1575 – Baba Nobuharu, Japanese samurai (b. 1515)\n*1594 – Niels Kaas, Danish politician, Chancellor of Denmark (b. 1535)\n*1626 – Scipione Cobelluzzi, Italian cardinal and archivist (b. 1564)\n*1646 – Laughlin Ó Cellaigh, Gaelic-Irish Lord\n*1725 – Arai Hakuseki, Japanese philosopher, academic, and politician (b. 1657)\n*1729 – Edward Taylor, American-English poet, pastor, and physician (b. circa 1642)\n*1744 – André Campra, French composer and conductor (b. 1660)\n*1764 – Ralph Allen, English businessman and philanthropist (b. 1693)\n*1779 – Anton Raphael Mengs, German painter (b. 1728)\n*1831 – Heinrich Friedrich Karl vom und zum Stein, Prussian minister and politician (b. 1757)\n*1840 – Lucien Bonaparte, French prince (b. 1775)\n*1852 – Henry Clay, American lawyer and politician, 9th United States Secretary of State (b. 1777)\n*1853 – Adrien-Henri de Jussieu, French botanist and academic (b. 1797)\n*1855 – John Gorrie, American physician and humanitarian (b. 1803)\n*1860 – Thomas Addison, English physician and endocrinologist (b. 1793)\n*1861 – Elizabeth Barrett Browning, English poet and translator (b. 1806)\n*1873 – Michael Madhusudan Dutt, Indian poet and playwright (b. 1824)\n*1875 – Ferdinand I of Austria (b. 1793)\n*1895 – Thomas Henry Huxley, English biologist (b. 1825)\n*1900 – Ivan Mikheevich Pervushin, Russian mathematician and academic (b. 1827)\n*1907 – Konstantinos Volanakis, Greek painter and academic (b. 1837)\n*1919 – José Gregorio Hernández Venezuelan physician and educator (b. 1864)\n*1931 – Nérée Beauchemin, Canadian poet and physician (b. 1850)\n*1933 – Roscoe Arbuckle, American actor, director, and screenwriter (b. 1887)\n*1935 – Jack O'Neill, Irish-American baseball player and manager (b. 1873)\n*1936 – János Szlepecz, Slovene priest and missionary (b. 1872)\n*1940 – Paul Klee, Swiss painter and illustrator (b. 1879)\n*1941 – Ignacy Jan Paderewski, Polish pianist, composer, and politician, 2nd Prime Minister of Poland (b. 1860)\n*1942 – Paul Troje, German politician, Mayor of Marburg (b. 1864)\n*1949 – Themistoklis Sofoulis, Greek politician, 115th Prime Minister of Greece (b. 1860)\n*1955 – Max Pechstein, German painter and academic (b. 1881)\n*1960 – Frank Patrick, Canadian ice hockey player and coach (b. 1885)\n*1964 – Eric Dolphy, American saxophonist, composer, and bandleader (b. 1928)\n*1967 – Primo Carnera, Italian boxer and actor (b. 1906)\n*  1967   – Jayne Mansfield, American actress (b. 1933)\n*1969 – Moise Tshombe, Congolese accountant and politician, Prime Minister of the Democratic Republic of the Congo (b. 1919)\n*1975 – Tim Buckley, American singer-songwriter and guitarist (b. 1947)\n*1978 – Bob Crane, American actor (b. 1928)\n*1979 – Lowell George, American singer-songwriter, guitarist, and producer (b. 1945)\n*1981 – Russell Drysdale, English-Australian painter (b. 1912)\n*1982 – Pierre Balmain, French fashion designer, founded Balmain (b. 1914)\n*  1982   – Henry King, American actor, director, producer, and screenwriter (b. 1886)\n*1986 – Frank Wise, Australian politician, 16th Premier of Western Australia (b. 1897)\n*1990 – Irving Wallace, American author and screenwriter (b. 1916)\n*1992 – Mohamed Boudiaf, Algerian soldier and politician, President of Algeria (b. 1919)\n*1993 – Héctor Lavoe, Puerto Rican-American singer-songwriter (b. 1946)\n*1994 – Kurt Eichhorn, German conductor and educator (b. 1908)\n*1995 – Lana Turner, American actress (b. 1921)\n*1997 – William Hickey, American actor (b. 1927)\n*1998 – Horst Jankowski, German pianist and composer (b. 1936)\n*1999 – Karekin I, Syrian-Armenian patriarch (b. 1950)\n*  1999   – Allan Carr, American screenwriter and producer (b. 1937)\n*2000 – Vittorio Gassman, Italian actor and director (b. 1922)\n*2002 – Rosemary Clooney, American singer and actress (b. 1928)\n*2003 – Katharine Hepburn, American actress (b. 1907)\n*2004 – Bernard Babior, American physician and biochemist (b. 1935)\n*  2004   – Alvin Hamilton, Canadian lieutenant and politician, 18th Canadian Minister of Agriculture (b. 1912)\n*2006 – Fabián Bielinsky, Argentinian director and screenwriter (b. 1959)\n*  2006   – Randy Walker, American football player and coach (b. 1954)\n*2007 – Fred Saberhagen, American soldier and author (b. 1930)\n*  2007   – Joel Siegel, American journalist and critic (b. 1943)\n*2009 – Joe Bowman, American marksman, target shooter and boot-maker (b. 1925)\n*2011 – K. D. Sethna,  Indian poet, scholar, writer, philosopher, and cultural critic (b. 1904) \n*2012 – Yong Nyuk Lin, Singaporean politician, Singaporean Minister of Health (b. 1918) \n*  2012   – Vincent Ostrom, American political scientist and academic (b. 1919)\n*  2012   – Juan Reccius, Chilean triple jumper (b. 1911)\n*  2012   – Floyd Temple, American baseball player, coach, and manager (b. 1926)\n*2013 – Peter Fitzgerald, Irish footballer and manager (b. 1937)\n*  2013   – Jack Gotta, American-Canadian football player, coach, and manager (b. 1929)\n*  2013   – Margherita Hack, Italian astrophysicist and author (b. 1922)\n*  2013   – Gilma Jiménez, Colombian politician (b. 1956)\n*2014 – Damian D'Oliveira, South African cricketer (b. 1960)\n*  2014   – Dermot Healy, Irish author, poet, and playwright (b. 1947)\n*2015 – Hisham Barakat, Egyptian lawyer and judge (b. 1950)\n*  2015   – Josef Masopust, Czech footballer and coach (b. 1931)\n*  2015   – Charles Pasqua, French businessman and politician, French Minister of the Interior (b. 1927)\n*2017 – Louis Nicollin, French entrepreneur and chairman of Montpellier HSC from 1974 to his death (b. 1943)\n*  2017   – Dave Semenko, Canadian ice hockey player (b. 1957)\n\nHolidays and observances\n\n*Christian feast day:\n**Cassius of Narni\n**Feast of Saints Peter and Paul (Western Christianity), and its related observances:\n***Haro Wine Festival (Haro, La Rioja)\n***l-Imnarja (Malta)\n**June 29 (Eastern Orthodox liturgics)\n*Engineer's Day (Ecuador)\n*Independence Day (Seychelles), celebrates the independence of Seychelles from the United Kingdom in 1976.\n*Veterans' Day (Netherlands). June 29. http://en.wikipedia.org/?curid=15842."
  }
}
