{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1235",
  "eid" : "b8ffa1d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778390125,
  "textBody" : "Alexander Mackenzie, PC (January 28, 1822April 17, 1892), was a Scottish-Canadian politician who served as the second Prime Minister of Canada, in office from 1873 to 1878.\n\nMackenzie was born in Logierait, Perthshire, Scotland. He left school at the age of 13, following his father's death, and trained as a stonemason. Mackenzie immigrated to Canada when he was 20, settling in what became Ontario. His masonry business prospered, allowing him to pursue other interests – such as the editorship of a pro-Reformist newspaper. Mackenzie was elected to the Legislative Assembly of the Province of Canada in 1861, as a supporter of George Brown.\n\nIn 1867, Mackenzie was elected to the new Canadian House of Commons for the Liberal Party. He became leader of the party (and thus Leader of the Opposition) in mid-1873, and a few months later succeeded John A. Macdonald as prime minister, following Macdonald's resignation in the aftermath of the Pacific Scandal. Mackenzie and the Liberals won a clear majority at the 1874 election. He was popular among the general public for his humble background and apparent democratic tendencies.\n\nAs prime minister, Mackenzie continued the nation-building programme that had been begun by his predecessor. His government established the Supreme Court of Canada and Royal Military College of Canada, and created the District of Keewatin to better administer Canada's newly acquired western territories. However, it made little progress on the transcontinental railway, and struggled to deal with the aftermath of the Panic of 1873. At the 1878 election, Mackenzie's government suffered a landslide defeat. He remained leader of the Liberal Party for another two years, and continued on as a member of parliament until his death, due to a stroke.\n\nEarly life\n\nMackenzie was born on 28 January 1822 in Logierait, Perthshire, Scotland, the son of Mary Stewart (Fleming) and Alexander Mackenzie Sr. who were married in 1817.  The site of his birthplace is known as Clais-'n-deoir \"The Hollow of the Weeping\", where families said their goodbyes as the convicted were led to nearby Gallows Hill. The house he was born in was built by his father and is still standing in 2017.  He was the third of ten boys, seven of who survived infancy. Alexander Mackenzie Sr. was a carpenter and ship's joiner who had to move around frequently for work after the end of the Napoleonic Wars in 1815. Mackenzie's father died on 7 March 1836 and at the age of thirteen Alexander Mackenzie Jr. was thus forced to end his formal education in order to help support his family. He apprenticed as a stonemason and met his future wife, Helen Neil, in Irvine, where her father was also a stonemason.  The Neils were Baptist and shortly thereafter, Mackenzie converted from Presbyterianism to Baptist beliefs.  Together with the Neils, he immigrated to Canada in 1842 to seek a better life.  Mackenzie's faith was to link him to the increasingly influential temperance cause, particularly strong in Canada West where he lived, a constituency of which he was to represent in the Parliament of Canada.\n\nThe Neils and Mackenzie settled in Kingston, Ontario.  The limestone in the area proved too hard for his stonemason tools and, not having money to buy new tools, Mackenzie took a job as a labourer constructing a building on Princess Street.  The contractor on the job claimed financial difficulty and so Mackenzie accepted a promissory note for summer wages.  The note later proved to be worthless.  Subsequently, Mackenzie won a contract building a bomb-proof arch at Fort Henry.  He later became a foreman on the construction of Kingston's four Martello Towers - Murney Tower, Fort Frederick, Cathcart Tower, and Shoal Tower.  He was also a foreman on the construction of the Welland Canal and the Lachine Canal.  While working on the Beauharnois Canal a one-ton stone fell and crushed one of his legs.  He recovered but never regained the strength in that leg.  It was while in Kingston that Mackenzie became a vocal opponent of religious and political entitlement and corruption in government.\n\nMackenzie married Helen Neil (1826–52) in 1845 and with her had three children, with only one girl, Mary, surviving infancy.  He and Helen moved to Sarnia, Ontario (known as Canada West) in 1847 and Mary was born in 1848.  They were soon joined from Scotland by the rest of Mackenzie's brothers and his mother. He began working as a general contractor, earning a reputation for being a hard working, honest man as well as having a working man's view on fiscal policy.  Mackenzie helped construct many courthouses and jails across southern Ontario. A number of these still stand today including the Sandwich Courthouse and Jail now known as the Mackenzie Hall Cultural Centre in Windsor, Ontario and the Kent County Courthouse and Jail in Chatham, Ontario.  He even bid, unsuccessfully, on the construction of the Parliament Buildings in Ottawa in 1859.  Helen died in 1852, finally succumbing to the effects of excessive doses of mercury-based calomel used to treat a fever while in Kingston. In 1853, he married Jane Sym (1825–93).\n\nEarly political involvement\n\nMackenzie involved himself in politics almost from the moment he arrived in Canada.   He fought passionately for equality and the elimination of all forms of class distinction.  In 1851 he became the Secretary for the Reform Party for Lambton.  After convincing him to run in Kent/Lambton, Mackenzie campaigned relentlessly for George Brown, owner of the Reformist paper The Globe in the 1851 election, helping Brown to win his first seat in the Legislative Assembly.  Mackenzie and Brown remained the closest of friends and colleagues for the rest of their lives.  In 1852 Mackenzie became editor of another reformist paper, the Lambton Shield. As editor, Mackenzie was perhaps a little too vocal, leading the paper to a lawsuit for libel against the local conservative candidate. Because a key witness claimed Cabinet Confidence and would not testify, the paper lost the suit and was forced to fold due to financial hardship.  After his brother, Hope Mackenzie, declined to run, Alexander was petitioned to run and won his first seat in the Legislative Assembly as a supporter of George Brown in 1861.  When George Brown resigned from the Great Coalition in 1865 over reciprocity negotiations with the United States, Mackenzie was invited to replace him as the President of the Council.  Wary of Macdonald's motivations and true to his principles, Mackenzie declined.\n\nHe entered the Canadian House of Commons in 1867, representing the Lambton, Ontario, riding.  There was no cohesive national Liberal Party of Canada at the time and with George Brown not winning his seat, there was no official leader.  Mackenzie did not believe he was the best qualified for the position and although he resisted offers of the position, he nevertheless sat as the de facto leader of the Official Opposition.\n\nPrime Minister (1873–1878)\n\nWhen the Macdonald government fell due to the Pacific Scandal in 1873, the Governor General, Lord Dufferin, called upon Mackenzie, who had been chosen as the leader of the Liberal Party a few months earlier, to form a new government.  Mackenzie formed a government and asked the Governor General to call an election for January 1874. The Liberals won, having garnered 53.8% of the popular vote. The voter support of 53.8% remains the record in Canada for all federal elections.Éric Grenier, \"Size of Justin Trudeau's government breaks records, for better and worse Biggest seat gains in Canada's history delivered a majority government — with one of its smallest mandates\" (Dec 2 2015): . Mackenzie remained prime minister until the 1878 election when Macdonald's Conservatives returned to power with a majority government.\n\nIt was unusual for a man of Mackenzie's humble origins to attain such a position in an age which generally offered such opportunity only to the privileged. Lord Dufferin, the current Governor General, expressed early misgivings about a stonemason taking over government. But on meeting Mackenzie, Dufferin revised his opinions: \"However narrow and inexperienced Mackenzie may be, I imagine he is a thoroughly upright, well-principled, and well-meaning man.\"\n\nMackenzie served concurrently as Minister of Public Works and oversaw the completion of the Parliament Buildings. While drawing up the plans for the West Block, he included a circular staircase leading directly from his office to the outside of the building which allowed him to escape the patronage-seekers waiting for him in his ante-chamber. Proving Dufferin's reflections on his character to be true, Mackenzie disliked intensely the patronage inherent in politics. Nevertheless, he found it a necessary evil in order to maintain party unity and ensure the loyalty of his fellow Liberals.\n\n In keeping with his democratic ideals, Mackenzie refused the offer of a knighthood three times, and was thus the only one of Canada's first eight Prime Ministers not to be knighted.  He also declined appointment to the UK Privy Council and hence does not bear the title \"Right Honourable\". His pride in his working class origins never left him. Once, while touring Fort Henry as prime minister, he asked the soldier accompanying him if he knew the thickness of the wall beside them. The embarrassed escort confessed that he didn't and Mackenzie replied, \"I do. It is five feet, ten inches. I know, because I built it myself!\"Canada's Prime Ministers, 1867 – 1994: Biographies and Anecdotes. [Ottawa]: National Archives of Canada, [1994]. 40 p.\n\nAs Prime Minister, Alexander Mackenzie strove to reform and simplify the machinery of government, achieving a remarkable record of reform legislation. He introduced the secret ballot; advised the creation of the Supreme Court of Canada; the establishment of the Royal Military College of Canada in Kingston in 1874; and, the creation of the Office of the Auditor General in 1878.  He completed the Intercolonial Railway but struggled to progress on the national railway due to a worldwide economic depression, almost coming to blows with the then Governor General Lord Dufferin over imperial interference.  Mackenzie stood up for the rights of Canada as a nation and fought for the supremacy of Parliament and honesty in government. Above all else, he was known and loved for his honesty and integrity.\n\nHowever, his term was marked by economic depression that had grown out of the Panic of 1873, which Mackenzie's government was unable to alleviate. In 1874, Mackenzie negotiated a new free trade agreement with the United States, eliminating the high protective tariffs on Canadian goods in US markets. However, this action did not bolster the economy, and construction of the CPR slowed drastically due to lack of funding. In 1876 the Conservative opposition announced a National Policy of protective tariffs, which resonated with voters. When an election was held at the conclusion of Mackenzie's five-year term, the Conservatives were swept back into office in a landslide victory.\n\nSupreme Court appointments \n\nMackenzie chose the following jurists to be appointed as justices of the Supreme Court of Canada by the Governor General:\n* Sir William Buell Richards (Chief Justice) – September 30, 1875\n* Télesphore Fournier – September 30, 1875\n* William Alexander Henry – September 30, 1875\n* Sir William Johnstone Ritchie – September 30, 1875\n* Sir Samuel Henry Strong – September 30, 1875\n* Jean-Thomas Taschereau – September 30, 1875\n* Sir Henri Elzéar Taschereau – October 7, 1878\n\nLater life\n\nAfter his government's defeat, Mackenzie remained Leader of the Opposition for another two years, until 1880. He was soon struck with a mysterious ailment that sapped his strength and all but took his voice.  Sitting in silence, he nevertheless remained an undefeated MP until his death in 1892 from a stroke that resulted from hitting his head during a fall. He died in Toronto and was buried in Lakeview Cemetery in Sarnia, Ontario.\n\nLegacy\n\nIn their 1999 study of the Prime Ministers of Canada, which included the results of a survey of Canadian historians, J.L. Granatstein and Norman Hillmer found that Mackenzie was in the No. 11 place just after John Sparrow David Thompson.\n\nNamesakes \n\nThe following are named in honour of Alexander Mackenzie:\n* The Mackenzie Mountain Range in the Yukon & Northwest Territories.\n* The Mackenzie building, and the use of the Mackenzie tartan by the bands at the Royal Military College of Canada in Kingston, Ontario. 'Alexander Mackenzie', the Royal Military College of Canada March for bagpipes, was composed in his honour by Pipe Major Don M. Carrigan, who was the College Pipe Major 1973 to 1985.Archie Cairns – Bk1 Pipe Music 'Alexander Mackenzie' (Slow March) by Pipe Major Don M. Carrigan 1995\n* Mackenzie Hall in Windsor, Ontario.\n* Alexander Mackenzie Scholarships in Economics and Political Science at McGill University and University of Toronto\n* Alexander MacKenzie Park in Sarnia, Ontario.\n* Alexander Mackenzie High School in Sarnia, Ontario.\n* Alexander Mackenzie Housing Co-Operative Inc. in Sarnia, Ontario.\n* Mackenzie Avenue, Ottawa, Ontario\n* Mackenzie Tower, West Block,Parliament Hill, Ottawa, Ontario\n\nOther honours\n\n* A monument is dedicated to his tomb in Lakeview Cemetery, Sarnia, Ontario\n* \"Honourable Alexander Mackenzie\" (1964) by  Lawren Harris, head of the Department of Fine Arts, Mount Allison University now hangs in the Mackenzie Building, Royal Military College of Canada. The unveiling ceremony was performed by the Right Honourable Louis St. Laurent, a former Canadian Prime Minister, and the gift was accepted by the Commandant, Air Commodore L.J. Birchall. The painting was commissioned in memory of No. 244, Lieut.-Col, F.B, Wilson, O.B.E, her deceased husband, by Mrs, F.W. Dashwood. Also taking part in the ceremony was the Honourable Paul Hellyer, Minister of National Defence, President and Chancellor of the College.Source: Royal Military College of Canada – Review Yearbook (Kingston, Ontario Canada) Class of 1965page 191 In attendance was Mrs. Burton R. Morgan of Ottawa, great-granddaughter of Alexander Mackenzie.\n* Burgess tickets presented to Alexander Mackenzie in Dundee, Dunkeld, Logierait, Irvine, and Perth Scotland.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Alexander Mackenzie (politician)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1235" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Alexander Mackenzie, PC (January 28, 1822April 17, 1892), was a Scottish-Canadian politician who served as the second Prime Minister of Canada, in office from 1873 to 1878.\n\nMackenzie was born in Logierait, Perthshire, Scotland. He left school at the age of 13, following his father's death, and trained as a stonemason. Mackenzie immigrated to Canada when he was 20, settling in what became Ontario. His masonry business prospered, allowing him to pursue other interests – such as the editorship of a pro-Reformist newspaper. Mackenzie was elected to the Legislative Assembly of the Province of Canada in 1861, as a supporter of George Brown.\n\nIn 1867, Mackenzie was elected to the new Canadian House of Commons for the Liberal Party. He became leader of the party (and thus Leader of the Opposition) in mid-1873, and a few months later succeeded John A. Macdonald as prime minister, following Macdonald's resignation in the aftermath of the Pacific Scandal. Mackenzie and the Liberals won a clear majority at the 1874 election. He was popular among the general public for his humble background and apparent democratic tendencies.\n\nAs prime minister, Mackenzie continued the nation-building programme that had been begun by his predecessor. His government established the Supreme Court of Canada and Royal Military College of Canada, and created the District of Keewatin to better administer Canada's newly acquired western territories. However, it made little progress on the transcontinental railway, and struggled to deal with the aftermath of the Panic of 1873. At the 1878 election, Mackenzie's government suffered a landslide defeat. He remained leader of the Liberal Party for another two years, and continued on as a member of parliament until his death, due to a stroke.\n\nEarly life\n\nMackenzie was born on 28 January 1822 in Logierait, Perthshire, Scotland, the son of Mary Stewart (Fleming) and Alexander Mackenzie Sr. who were married in 1817.  The site of his birthplace is known as Clais-'n-deoir \"The Hollow of the Weeping\", where families said their goodbyes as the convicted were led to nearby Gallows Hill. The house he was born in was built by his father and is still standing in 2017.  He was the third of ten boys, seven of who survived infancy. Alexander Mackenzie Sr. was a carpenter and ship's joiner who had to move around frequently for work after the end of the Napoleonic Wars in 1815. Mackenzie's father died on 7 March 1836 and at the age of thirteen Alexander Mackenzie Jr. was thus forced to end his formal education in order to help support his family. He apprenticed as a stonemason and met his future wife, Helen Neil, in Irvine, where her father was also a stonemason.  The Neils were Baptist and shortly thereafter, Mackenzie converted from Presbyterianism to Baptist beliefs.  Together with the Neils, he immigrated to Canada in 1842 to seek a better life.  Mackenzie's faith was to link him to the increasingly influential temperance cause, particularly strong in Canada West where he lived, a constituency of which he was to represent in the Parliament of Canada.\n\nThe Neils and Mackenzie settled in Kingston, Ontario.  The limestone in the area proved too hard for his stonemason tools and, not having money to buy new tools, Mackenzie took a job as a labourer constructing a building on Princess Street.  The contractor on the job claimed financial difficulty and so Mackenzie accepted a promissory note for summer wages.  The note later proved to be worthless.  Subsequently, Mackenzie won a contract building a bomb-proof arch at Fort Henry.  He later became a foreman on the construction of Kingston's four Martello Towers - Murney Tower, Fort Frederick, Cathcart Tower, and Shoal Tower.  He was also a foreman on the construction of the Welland Canal and the Lachine Canal.  While working on the Beauharnois Canal a one-ton stone fell and crushed one of his legs.  He recovered but never regained the strength in that leg.  It was while in Kingston that Mackenzie became a vocal opponent of religious and political entitlement and corruption in government.\n\nMackenzie married Helen Neil (1826–52) in 1845 and with her had three children, with only one girl, Mary, surviving infancy.  He and Helen moved to Sarnia, Ontario (known as Canada West) in 1847 and Mary was born in 1848.  They were soon joined from Scotland by the rest of Mackenzie's brothers and his mother. He began working as a general contractor, earning a reputation for being a hard working, honest man as well as having a working man's view on fiscal policy.  Mackenzie helped construct many courthouses and jails across southern Ontario. A number of these still stand today including the Sandwich Courthouse and Jail now known as the Mackenzie Hall Cultural Centre in Windsor, Ontario and the Kent County Courthouse and Jail in Chatham, Ontario.  He even bid, unsuccessfully, on the construction of the Parliament Buildings in Ottawa in 1859.  Helen died in 1852, finally succumbing to the effects of excessive doses of mercury-based calomel used to treat a fever while in Kingston. In 1853, he married Jane Sym (1825–93).\n\nEarly political involvement\n\nMackenzie involved himself in politics almost from the moment he arrived in Canada.   He fought passionately for equality and the elimination of all forms of class distinction.  In 1851 he became the Secretary for the Reform Party for Lambton.  After convincing him to run in Kent/Lambton, Mackenzie campaigned relentlessly for George Brown, owner of the Reformist paper The Globe in the 1851 election, helping Brown to win his first seat in the Legislative Assembly.  Mackenzie and Brown remained the closest of friends and colleagues for the rest of their lives.  In 1852 Mackenzie became editor of another reformist paper, the Lambton Shield. As editor, Mackenzie was perhaps a little too vocal, leading the paper to a lawsuit for libel against the local conservative candidate. Because a key witness claimed Cabinet Confidence and would not testify, the paper lost the suit and was forced to fold due to financial hardship.  After his brother, Hope Mackenzie, declined to run, Alexander was petitioned to run and won his first seat in the Legislative Assembly as a supporter of George Brown in 1861.  When George Brown resigned from the Great Coalition in 1865 over reciprocity negotiations with the United States, Mackenzie was invited to replace him as the President of the Council.  Wary of Macdonald's motivations and true to his principles, Mackenzie declined.\n\nHe entered the Canadian House of Commons in 1867, representing the Lambton, Ontario, riding.  There was no cohesive national Liberal Party of Canada at the time and with George Brown not winning his seat, there was no official leader.  Mackenzie did not believe he was the best qualified for the position and although he resisted offers of the position, he nevertheless sat as the de facto leader of the Official Opposition.\n\nPrime Minister (1873–1878)\n\nWhen the Macdonald government fell due to the Pacific Scandal in 1873, the Governor General, Lord Dufferin, called upon Mackenzie, who had been chosen as the leader of the Liberal Party a few months earlier, to form a new government.  Mackenzie formed a government and asked the Governor General to call an election for January 1874. The Liberals won, having garnered 53.8% of the popular vote. The voter support of 53.8% remains the record in Canada for all federal elections.Éric Grenier, \"Size of Justin Trudeau's government breaks records, for better and worse Biggest seat gains in Canada's history delivered a majority government — with one of its smallest mandates\" (Dec 2 2015): . Mackenzie remained prime minister until the 1878 election when Macdonald's Conservatives returned to power with a majority government.\n\nIt was unusual for a man of Mackenzie's humble origins to attain such a position in an age which generally offered such opportunity only to the privileged. Lord Dufferin, the current Governor General, expressed early misgivings about a stonemason taking over government. But on meeting Mackenzie, Dufferin revised his opinions: \"However narrow and inexperienced Mackenzie may be, I imagine he is a thoroughly upright, well-principled, and well-meaning man.\"\n\nMackenzie served concurrently as Minister of Public Works and oversaw the completion of the Parliament Buildings. While drawing up the plans for the West Block, he included a circular staircase leading directly from his office to the outside of the building which allowed him to escape the patronage-seekers waiting for him in his ante-chamber. Proving Dufferin's reflections on his character to be true, Mackenzie disliked intensely the patronage inherent in politics. Nevertheless, he found it a necessary evil in order to maintain party unity and ensure the loyalty of his fellow Liberals.\n\n In keeping with his democratic ideals, Mackenzie refused the offer of a knighthood three times, and was thus the only one of Canada's first eight Prime Ministers not to be knighted.  He also declined appointment to the UK Privy Council and hence does not bear the title \"Right Honourable\". His pride in his working class origins never left him. Once, while touring Fort Henry as prime minister, he asked the soldier accompanying him if he knew the thickness of the wall beside them. The embarrassed escort confessed that he didn't and Mackenzie replied, \"I do. It is five feet, ten inches. I know, because I built it myself!\"Canada's Prime Ministers, 1867 – 1994: Biographies and Anecdotes. [Ottawa]: National Archives of Canada, [1994]. 40 p.\n\nAs Prime Minister, Alexander Mackenzie strove to reform and simplify the machinery of government, achieving a remarkable record of reform legislation. He introduced the secret ballot; advised the creation of the Supreme Court of Canada; the establishment of the Royal Military College of Canada in Kingston in 1874; and, the creation of the Office of the Auditor General in 1878.  He completed the Intercolonial Railway but struggled to progress on the national railway due to a worldwide economic depression, almost coming to blows with the then Governor General Lord Dufferin over imperial interference.  Mackenzie stood up for the rights of Canada as a nation and fought for the supremacy of Parliament and honesty in government. Above all else, he was known and loved for his honesty and integrity.\n\nHowever, his term was marked by economic depression that had grown out of the Panic of 1873, which Mackenzie's government was unable to alleviate. In 1874, Mackenzie negotiated a new free trade agreement with the United States, eliminating the high protective tariffs on Canadian goods in US markets. However, this action did not bolster the economy, and construction of the CPR slowed drastically due to lack of funding. In 1876 the Conservative opposition announced a National Policy of protective tariffs, which resonated with voters. When an election was held at the conclusion of Mackenzie's five-year term, the Conservatives were swept back into office in a landslide victory.\n\nSupreme Court appointments \n\nMackenzie chose the following jurists to be appointed as justices of the Supreme Court of Canada by the Governor General:\n* Sir William Buell Richards (Chief Justice) – September 30, 1875\n* Télesphore Fournier – September 30, 1875\n* William Alexander Henry – September 30, 1875\n* Sir William Johnstone Ritchie – September 30, 1875\n* Sir Samuel Henry Strong – September 30, 1875\n* Jean-Thomas Taschereau – September 30, 1875\n* Sir Henri Elzéar Taschereau – October 7, 1878\n\nLater life\n\nAfter his government's defeat, Mackenzie remained Leader of the Opposition for another two years, until 1880. He was soon struck with a mysterious ailment that sapped his strength and all but took his voice.  Sitting in silence, he nevertheless remained an undefeated MP until his death in 1892 from a stroke that resulted from hitting his head during a fall. He died in Toronto and was buried in Lakeview Cemetery in Sarnia, Ontario.\n\nLegacy\n\nIn their 1999 study of the Prime Ministers of Canada, which included the results of a survey of Canadian historians, J.L. Granatstein and Norman Hillmer found that Mackenzie was in the No. 11 place just after John Sparrow David Thompson.\n\nNamesakes \n\nThe following are named in honour of Alexander Mackenzie:\n* The Mackenzie Mountain Range in the Yukon & Northwest Territories.\n* The Mackenzie building, and the use of the Mackenzie tartan by the bands at the Royal Military College of Canada in Kingston, Ontario. 'Alexander Mackenzie', the Royal Military College of Canada March for bagpipes, was composed in his honour by Pipe Major Don M. Carrigan, who was the College Pipe Major 1973 to 1985.Archie Cairns – Bk1 Pipe Music 'Alexander Mackenzie' (Slow March) by Pipe Major Don M. Carrigan 1995\n* Mackenzie Hall in Windsor, Ontario.\n* Alexander Mackenzie Scholarships in Economics and Political Science at McGill University and University of Toronto\n* Alexander MacKenzie Park in Sarnia, Ontario.\n* Alexander Mackenzie High School in Sarnia, Ontario.\n* Alexander Mackenzie Housing Co-Operative Inc. in Sarnia, Ontario.\n* Mackenzie Avenue, Ottawa, Ontario\n* Mackenzie Tower, West Block,Parliament Hill, Ottawa, Ontario\n\nOther honours\n\n* A monument is dedicated to his tomb in Lakeview Cemetery, Sarnia, Ontario\n* \"Honourable Alexander Mackenzie\" (1964) by  Lawren Harris, head of the Department of Fine Arts, Mount Allison University now hangs in the Mackenzie Building, Royal Military College of Canada. The unveiling ceremony was performed by the Right Honourable Louis St. Laurent, a former Canadian Prime Minister, and the gift was accepted by the Commandant, Air Commodore L.J. Birchall. The painting was commissioned in memory of No. 244, Lieut.-Col, F.B, Wilson, O.B.E, her deceased husband, by Mrs, F.W. Dashwood. Also taking part in the ceremony was the Honourable Paul Hellyer, Minister of National Defence, President and Chancellor of the College.Source: Royal Military College of Canada – Review Yearbook (Kingston, Ontario Canada) Class of 1965page 191 In attendance was Mrs. Burton R. Morgan of Ottawa, great-granddaughter of Alexander Mackenzie.\n* Burgess tickets presented to Alexander Mackenzie in Dundee, Dunkeld, Logierait, Irvine, and Perth Scotland. Alexander Mackenzie (politician). http://en.wikipedia.org/?curid=1235."
  }
}
