{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19599",
  "eid" : "3c45bde0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778610366,
  "textBody" : "Mutagenesis is a process by which the genetic information of an organism is changed, resulting in a mutation.  It may occur spontaneously in nature, or as a result of exposure to mutagens. It can also be achieved experimentally using laboratory procedures. In nature mutagenesis can lead to cancer and various heritable diseases, but it is also a driving force of evolution.  Mutagenesis as a science was developed based on work done by Hermann Muller, Charlotte Auerbach and J. M. Robson in the first half of the 20th century.\n\nBackground\n\nDNA may be modified, either naturally or artificially, by a number of physical, chemical and biological agents, resulting in mutations. The first physical mutagen that was found to have a casual link to mutating  genes, was in the early 1920s, found to be \"high temperatures\". More sensationally however by 1927, the same investigator, Hermann Muller likewise demonstrated a casual link to mutation upon experimenting with an x-ray machine and noting phylogenetic changes when irradiating fruit flies with  relatively high dose of X-rays,  this would also become the beginning of the idea that mutation was the cause of cancer.  His contemporary Lewis Stadler also showed the mutational effect of X-ray on barley in 1928, and ultraviolet (UV) radiation on maize in 1936. In 1940s, Charlotte Auerbach and J. M. Robson, found that mustard gas can also cause mutations in fruit flies.\n\nWhile changes to the chromosome caused by X-ray and mustard gas were readily observable to the early researchers, other changes to the DNA induced by other mutagens were not so easily observable, and the mechanism may be complex and takes longer to unravel.  For example, soot was suggested to be a cause of cancer as early as 1775, and coal tar was demonstrated to cause cancer in 1915.  The chemicals involved in both were later shown to be polycyclic aromatic hydrocarbons (PAH).  PAHs by themselves are not carcinogenic, and it was proposed in 1950 that the carcinogenic forms of PAHs are the oxides produced as metabolites from cellular processes. The metabolic process was identified in 1960s as catalysis by cytochrome P450 which produces reactive species that can interact with the DNA to form adducts,; the mechanism by which the PAH adducts give rise to mutation, however, is still under investigation.\n\nMammalian nuclear DNA may sustain more than 60,000 damage episodes per cell per day, as listed with references in DNA damage (naturally occurring). If left uncorrected, these adducts, after misreplication past the damaged sites, can give rise to mutations.  In nature, the mutations that arise may be beneficial or deleterious — this is the driving force of evolution. An organism may acquire new traits through genetic mutation, but mutation may also result in impaired function of the genes, and in severe cases, cause the death of the organism.  In the laboratory, however, mutagenesis is a useful technique for generating mutations that allows the functions of genes and gene products to be examined in detail, producing proteins with improved characteristics or novel functions, as well as mutant strains with useful properties.  Initially, the ability of radiation and chemical mutagens to cause mutation was exploited to generate random mutations, but later techniques were developed to introduce specific mutations.\n\nDistinction between a mutation and DNA damage\n\nDNA damage is an abnormal alteration in the structure of DNA that cannot, itself, be replicated when DNA replicates.  In contrast, a mutation is a change in the nucleic acid sequence that can be replicated; hence, a mutation can be inherited from one generation to the next.  Damage can occur from chemical addition (adduct), or structural disruption to a base of DNA (creating an abnormal nucleotide or nucleotide fragment), or a break in one or both DNA strands.  When DNA containing damage is replicated, an incorrect base may be inserted in the new complementary strand as it is being synthesized (see ).  The incorrect insertion in the new strand will occur opposite the damaged site in the template strand, and this incorrect insertion can become a mutation (i.e. a changed base pair) in the next round of replication.  Furthermore, double-strand breaks in DNA may be repaired by an inaccurate repair process, non-homologous end joining, which produces mutations.  Mutations can ordinarily be avoided if accurate DNA repair systems recognize DNA damage and repair it prior to completion of the next round of replication.  At least 169 enzymes are either directly employed in DNA repair or influence DNA repair processes. Of these, 83 are directly employed in the 5 types of DNA repair processes indicated in the chart shown in the article DNA repair.\n\nMechanisms\n\nMutagenesis may occur endogenously, for example, through spontaneous hydrolysis, or through normal cellular processes that can generate reactive oxygen species and DNA adducts, or through error in replication and repair.  Mutagenesis may also arise as a result of the presence of environmental mutagens that induce changes to the DNA.  The mechanism by which mutation arises varies according to the causative agent, the mutagen, involved.  Most mutagens act either directly, or indirectly via mutagenic metabolites, on the DNA producing lesions.  Some, however, may affect the replication or chromosomal partition mechanism, and other cellular processes.\n\nMany chemical mutagens require biological activation to become mutagenic.  An important group of enzymes involved in the generation of mutagenic metabolites is cytochrome P450.  Other enzymes that may also produce mutagenic metabolites include glutathione S-transferase and microsomal epoxide hydrolase.   Mutagens that are not mutagenic by themselves but require biological activation are called promutagens.\n\nMany mutations arise as a result of problems caused by DNA lesions during replication, resulting in errors in replication.  In bacteria, extensive damage to DNA due to mutagens results in single-stranded DNA gaps during replication. This induces the SOS response, an emergency repair process that is also error-prone, thereby generating mutations. In mammalian cells, stalling of replication at damaged sites induces a number of rescue mechanisms that help bypass DNA lesions, but which also may result in errors. The Y family of DNA polymerases specializes in DNA lesion bypass in a process termed translesion synthesis (TLS) whereby these lesion-bypass polymerases replace the stalled high-fidelity replicative DNA polymerase, transit the lesion and extend the DNA until the lesion has been passed so that normal replication can resume.  These processes may be error-prone or error-free.\n\nSpontaneous hydrolysis\n\nDNA is not entirely stable in aqueous solution. Under physiological conditions the glycosidic bond may be hydrolyzed spontaneously and 10,000 purine sites in DNA are estimated to be depurinated each day in a cell.  Numerous DNA repair pathways exist for DNA; however, if the apurinic site is not repaired, misincorporation of nucleotides may occur during replication.  Adenine is preferentially incorporated by DNA polymerases in an apurinic site.\n\nCytidine may also become deaminated to uridine at one five-hundredth of the rate of depurination and can result in G to A transition.  Eukaryotic cells also contain 5-methylcytosine, thought to be involved in the control of gene transcription, which can become deaminated into thymine.\n\nModification of bases\n\nBases may be modified endogenously by normal cellular molecules. For example, DNA may be methylated by S-adenosylmethionine, and glycosylated by reducing sugars.\n\nMany compounds, such as PAHs, aromatic amines, aflatoxin and pyrrolizidine alkaloids, may form reactive oxygen species catalyzed by cytochrome P450. These metabolites form adducts with the DNA, which can cause errors in replication, and the bulky aromatic adducts may form stable intercalation between bases and block replication. The adducts may also induce conformational changes in the DNA. Some adducts may also result in the depurination of the DNA; it is, however, uncertain how significant such depurination as caused by the adducts is in generating mutation.  \n     \nAlkylation and arylation of bases can cause errors in replication. Some alkylating agents such as N-Nitrosamines may require the catalytic reaction of cytochrome-P450 for the formation of a reactive alkyl cation. N7 and O6 of guanine and the N3 and N7 of adenine are most susceptible to attack.  N7-guanine adducts form the bulk of DNA adducts, but they appear to be non-mutagenic. Alkylation at O6 of guanine, however, is harmful because excision repair of O6-adduct of guanine may be poor in some tissues such as the brain.  The O6 methylation of guanine can result in G to A transition, while O4-methylthymine can be mispaired with guanine. The type of the mutation generated, however, may be dependent on the size and type of the adduct as well as the DNA sequence.\n\nIonizing radiation and reactive oxygen species often oxidize guanine to produce 8-oxoguanine.\n\nDNA damage and spontaneous mutation\n\nAs noted above, the number of DNA damage episodes occurring in a mammalian cell per day is high (more than 60,000 per day).  Frequent occurrence of DNA damage is likely a problem for all DNA- containing organisms, and the need to cope with DNA damage and minimize their deleterious effects is likely a fundamental problem for life.\n\nMost spontaneous mutations likely arise from error-prone trans-lesion synthesis past a DNA damage site in the template strand during DNA replication.  This process can overcome potentially lethal blockages, but at the cost of introducing inaccuracies in daughter DNA.  The causal relationship of DNA damage to spontaneous mutation is illustrated by aerobically growing E. coli bacteria, in which 89% of spontaneously occurring base substitution mutations are caused by reactive oxygen species (ROS)-induced DNA damage.  In yeast, more than 60% of spontaneous single-base pair substitutions and deletions are likely caused by trans-lesion synthesis.\n\nAn additional significant source of mutations in eukaryotes is the inaccurate DNA repair process non-homologous end joining, that is often employed in repair of double strand breaks.\n\nIn general, it appears that the main underlying cause of spontaneous mutation is error prone trans-lesion synthesis during DNA replication and that the error-prone non-homologous end joining repair pathway may also be an important contributor in eukaryotes.\n\nCrosslinking\n\n \nSome alkylating agents may produce crosslinking of DNA.  Some natural occurring chemicals may also promote crosslinking, such as psoralens after activation by UV radiation, and nitrous acid.  Interstrand cross-linking is more damaging as it blocks replication and transcription and can cause chromosomal breakages and rearrangements.  Some crosslinkers such as cyclophosphamide, mitomycin C and cisplatin are used as anticancer chemotherapeutic because of their high degree of toxicity to proliferating cells.\n\nDimerization\n\nUV radiation promotes the formation of a cyclobutyl ring between adjacent thymines, resulting in the formation of pyrimidine dimers.  In human skin cells, thousands of dimers may be formed in a day due to normal exposure to sunlight. DNA polymerase η may help bypass these lesions in an error-free manner; however, individuals with defective DNA repair function, such as sufferers of Xeroderma pigmentosum, are sensitive to sunlight and may be prone to skin cancer.\n \n\nIntercalation between bases\n\nThe planar structure of chemicals such as ethidium bromide and proflavine allows them to insert between bases in DNA. This insert causes the DNA's backbone to stretch and makes slippage in DNA during replication more likely to occur since the bonding between the strands is made less stable by the stretching. Forward slippage will result in deletion mutation, while reverse slippage will result in an insertion mutation. Also, the intercalation into DNA of anthracyclines such as daunorubicin and doxorubicin interferes with the functioning of the enzyme topoisomerase II, blocking replication as well as causing mitotic homologous recombination.\n\nBackbone damage\n\nIonizing radiation may produce highly reactive free radicals that can break the bonds in the DNA. Double-stranded breakages are especially damaging and hard to repair, producing translocation and deletion of part of a chromosome. Alkylating agents like mustard gas may also cause breakages in the DNA backbone. Oxidative stress may also generate highly reactive oxygen species that can damage DNA. Incorrect repair of other damage induced by the highly reactive species can also lead to mutations.\n\nInsertional mutagenesis\n\nTransposons and viruses may insert DNA sequences into coding regions or functional elements of a gene and result in inactivation of the gene.\n\nEffects on replication and DNA repair\n\nWhile most mutagens produce effects that ultimately result in errors in replication, for example creating adducts that interfere with replication, some mutagens may directly affect the replication process or reduce its fidelity. Base analog such as 5-bromouracil may substitute for thymine in replication. Metals such as cadmium, chromium, and nickel can increase mutagenesis in a number of ways in addition to direct DNA damage, for example reducing the ability to repair errors, as well as producing epigenetic changes.\n\nAs a laboratory technique\n\nMutagenesis in the laboratory is an important technique whereby DNA mutations are deliberately engineered to produce mutant genes, proteins, or strains of organism.  Various constituents of a gene, such as its control elements and its gene product, may be mutated so that the functioning of a gene or protein can be examined in detail.  The mutation may also produce mutant proteins with interesting properties, or enhanced or novel functions that may be of commercial use.  Mutant strains may also be produced that have practical application or allow the molecular basis of particular cell function to be investigated.\n\nEarly methods of mutagenesis produced entirely random mutations; however, later methods of mutagenesis may produce site-specific mutation.\n\nTypes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mutagenesis" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19599" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Mutagenesis is a process by which the genetic information of an organism is changed, resulting in a mutation.  It may occur spontaneously in nature, or as a result of exposure to mutagens. It can also be achieved experimentally using laboratory procedures. In nature mutagenesis can lead to cancer and various heritable diseases, but it is also a driving force of evolution.  Mutagenesis as a science was developed based on work done by Hermann Muller, Charlotte Auerbach and J. M. Robson in the first half of the 20th century.\n\nBackground\n\nDNA may be modified, either naturally or artificially, by a number of physical, chemical and biological agents, resulting in mutations. The first physical mutagen that was found to have a casual link to mutating  genes, was in the early 1920s, found to be \"high temperatures\". More sensationally however by 1927, the same investigator, Hermann Muller likewise demonstrated a casual link to mutation upon experimenting with an x-ray machine and noting phylogenetic changes when irradiating fruit flies with  relatively high dose of X-rays,  this would also become the beginning of the idea that mutation was the cause of cancer.  His contemporary Lewis Stadler also showed the mutational effect of X-ray on barley in 1928, and ultraviolet (UV) radiation on maize in 1936. In 1940s, Charlotte Auerbach and J. M. Robson, found that mustard gas can also cause mutations in fruit flies.\n\nWhile changes to the chromosome caused by X-ray and mustard gas were readily observable to the early researchers, other changes to the DNA induced by other mutagens were not so easily observable, and the mechanism may be complex and takes longer to unravel.  For example, soot was suggested to be a cause of cancer as early as 1775, and coal tar was demonstrated to cause cancer in 1915.  The chemicals involved in both were later shown to be polycyclic aromatic hydrocarbons (PAH).  PAHs by themselves are not carcinogenic, and it was proposed in 1950 that the carcinogenic forms of PAHs are the oxides produced as metabolites from cellular processes. The metabolic process was identified in 1960s as catalysis by cytochrome P450 which produces reactive species that can interact with the DNA to form adducts,; the mechanism by which the PAH adducts give rise to mutation, however, is still under investigation.\n\nMammalian nuclear DNA may sustain more than 60,000 damage episodes per cell per day, as listed with references in DNA damage (naturally occurring). If left uncorrected, these adducts, after misreplication past the damaged sites, can give rise to mutations.  In nature, the mutations that arise may be beneficial or deleterious — this is the driving force of evolution. An organism may acquire new traits through genetic mutation, but mutation may also result in impaired function of the genes, and in severe cases, cause the death of the organism.  In the laboratory, however, mutagenesis is a useful technique for generating mutations that allows the functions of genes and gene products to be examined in detail, producing proteins with improved characteristics or novel functions, as well as mutant strains with useful properties.  Initially, the ability of radiation and chemical mutagens to cause mutation was exploited to generate random mutations, but later techniques were developed to introduce specific mutations.\n\nDistinction between a mutation and DNA damage\n\nDNA damage is an abnormal alteration in the structure of DNA that cannot, itself, be replicated when DNA replicates.  In contrast, a mutation is a change in the nucleic acid sequence that can be replicated; hence, a mutation can be inherited from one generation to the next.  Damage can occur from chemical addition (adduct), or structural disruption to a base of DNA (creating an abnormal nucleotide or nucleotide fragment), or a break in one or both DNA strands.  When DNA containing damage is replicated, an incorrect base may be inserted in the new complementary strand as it is being synthesized (see ).  The incorrect insertion in the new strand will occur opposite the damaged site in the template strand, and this incorrect insertion can become a mutation (i.e. a changed base pair) in the next round of replication.  Furthermore, double-strand breaks in DNA may be repaired by an inaccurate repair process, non-homologous end joining, which produces mutations.  Mutations can ordinarily be avoided if accurate DNA repair systems recognize DNA damage and repair it prior to completion of the next round of replication.  At least 169 enzymes are either directly employed in DNA repair or influence DNA repair processes. Of these, 83 are directly employed in the 5 types of DNA repair processes indicated in the chart shown in the article DNA repair.\n\nMechanisms\n\nMutagenesis may occur endogenously, for example, through spontaneous hydrolysis, or through normal cellular processes that can generate reactive oxygen species and DNA adducts, or through error in replication and repair.  Mutagenesis may also arise as a result of the presence of environmental mutagens that induce changes to the DNA.  The mechanism by which mutation arises varies according to the causative agent, the mutagen, involved.  Most mutagens act either directly, or indirectly via mutagenic metabolites, on the DNA producing lesions.  Some, however, may affect the replication or chromosomal partition mechanism, and other cellular processes.\n\nMany chemical mutagens require biological activation to become mutagenic.  An important group of enzymes involved in the generation of mutagenic metabolites is cytochrome P450.  Other enzymes that may also produce mutagenic metabolites include glutathione S-transferase and microsomal epoxide hydrolase.   Mutagens that are not mutagenic by themselves but require biological activation are called promutagens.\n\nMany mutations arise as a result of problems caused by DNA lesions during replication, resulting in errors in replication.  In bacteria, extensive damage to DNA due to mutagens results in single-stranded DNA gaps during replication. This induces the SOS response, an emergency repair process that is also error-prone, thereby generating mutations. In mammalian cells, stalling of replication at damaged sites induces a number of rescue mechanisms that help bypass DNA lesions, but which also may result in errors. The Y family of DNA polymerases specializes in DNA lesion bypass in a process termed translesion synthesis (TLS) whereby these lesion-bypass polymerases replace the stalled high-fidelity replicative DNA polymerase, transit the lesion and extend the DNA until the lesion has been passed so that normal replication can resume.  These processes may be error-prone or error-free.\n\nSpontaneous hydrolysis\n\nDNA is not entirely stable in aqueous solution. Under physiological conditions the glycosidic bond may be hydrolyzed spontaneously and 10,000 purine sites in DNA are estimated to be depurinated each day in a cell.  Numerous DNA repair pathways exist for DNA; however, if the apurinic site is not repaired, misincorporation of nucleotides may occur during replication.  Adenine is preferentially incorporated by DNA polymerases in an apurinic site.\n\nCytidine may also become deaminated to uridine at one five-hundredth of the rate of depurination and can result in G to A transition.  Eukaryotic cells also contain 5-methylcytosine, thought to be involved in the control of gene transcription, which can become deaminated into thymine.\n\nModification of bases\n\nBases may be modified endogenously by normal cellular molecules. For example, DNA may be methylated by S-adenosylmethionine, and glycosylated by reducing sugars.\n\nMany compounds, such as PAHs, aromatic amines, aflatoxin and pyrrolizidine alkaloids, may form reactive oxygen species catalyzed by cytochrome P450. These metabolites form adducts with the DNA, which can cause errors in replication, and the bulky aromatic adducts may form stable intercalation between bases and block replication. The adducts may also induce conformational changes in the DNA. Some adducts may also result in the depurination of the DNA; it is, however, uncertain how significant such depurination as caused by the adducts is in generating mutation.  \n     \nAlkylation and arylation of bases can cause errors in replication. Some alkylating agents such as N-Nitrosamines may require the catalytic reaction of cytochrome-P450 for the formation of a reactive alkyl cation. N7 and O6 of guanine and the N3 and N7 of adenine are most susceptible to attack.  N7-guanine adducts form the bulk of DNA adducts, but they appear to be non-mutagenic. Alkylation at O6 of guanine, however, is harmful because excision repair of O6-adduct of guanine may be poor in some tissues such as the brain.  The O6 methylation of guanine can result in G to A transition, while O4-methylthymine can be mispaired with guanine. The type of the mutation generated, however, may be dependent on the size and type of the adduct as well as the DNA sequence.\n\nIonizing radiation and reactive oxygen species often oxidize guanine to produce 8-oxoguanine.\n\nDNA damage and spontaneous mutation\n\nAs noted above, the number of DNA damage episodes occurring in a mammalian cell per day is high (more than 60,000 per day).  Frequent occurrence of DNA damage is likely a problem for all DNA- containing organisms, and the need to cope with DNA damage and minimize their deleterious effects is likely a fundamental problem for life.\n\nMost spontaneous mutations likely arise from error-prone trans-lesion synthesis past a DNA damage site in the template strand during DNA replication.  This process can overcome potentially lethal blockages, but at the cost of introducing inaccuracies in daughter DNA.  The causal relationship of DNA damage to spontaneous mutation is illustrated by aerobically growing E. coli bacteria, in which 89% of spontaneously occurring base substitution mutations are caused by reactive oxygen species (ROS)-induced DNA damage.  In yeast, more than 60% of spontaneous single-base pair substitutions and deletions are likely caused by trans-lesion synthesis.\n\nAn additional significant source of mutations in eukaryotes is the inaccurate DNA repair process non-homologous end joining, that is often employed in repair of double strand breaks.\n\nIn general, it appears that the main underlying cause of spontaneous mutation is error prone trans-lesion synthesis during DNA replication and that the error-prone non-homologous end joining repair pathway may also be an important contributor in eukaryotes.\n\nCrosslinking\n\n \nSome alkylating agents may produce crosslinking of DNA.  Some natural occurring chemicals may also promote crosslinking, such as psoralens after activation by UV radiation, and nitrous acid.  Interstrand cross-linking is more damaging as it blocks replication and transcription and can cause chromosomal breakages and rearrangements.  Some crosslinkers such as cyclophosphamide, mitomycin C and cisplatin are used as anticancer chemotherapeutic because of their high degree of toxicity to proliferating cells.\n\nDimerization\n\nUV radiation promotes the formation of a cyclobutyl ring between adjacent thymines, resulting in the formation of pyrimidine dimers.  In human skin cells, thousands of dimers may be formed in a day due to normal exposure to sunlight. DNA polymerase η may help bypass these lesions in an error-free manner; however, individuals with defective DNA repair function, such as sufferers of Xeroderma pigmentosum, are sensitive to sunlight and may be prone to skin cancer.\n \n\nIntercalation between bases\n\nThe planar structure of chemicals such as ethidium bromide and proflavine allows them to insert between bases in DNA. This insert causes the DNA's backbone to stretch and makes slippage in DNA during replication more likely to occur since the bonding between the strands is made less stable by the stretching. Forward slippage will result in deletion mutation, while reverse slippage will result in an insertion mutation. Also, the intercalation into DNA of anthracyclines such as daunorubicin and doxorubicin interferes with the functioning of the enzyme topoisomerase II, blocking replication as well as causing mitotic homologous recombination.\n\nBackbone damage\n\nIonizing radiation may produce highly reactive free radicals that can break the bonds in the DNA. Double-stranded breakages are especially damaging and hard to repair, producing translocation and deletion of part of a chromosome. Alkylating agents like mustard gas may also cause breakages in the DNA backbone. Oxidative stress may also generate highly reactive oxygen species that can damage DNA. Incorrect repair of other damage induced by the highly reactive species can also lead to mutations.\n\nInsertional mutagenesis\n\nTransposons and viruses may insert DNA sequences into coding regions or functional elements of a gene and result in inactivation of the gene.\n\nEffects on replication and DNA repair\n\nWhile most mutagens produce effects that ultimately result in errors in replication, for example creating adducts that interfere with replication, some mutagens may directly affect the replication process or reduce its fidelity. Base analog such as 5-bromouracil may substitute for thymine in replication. Metals such as cadmium, chromium, and nickel can increase mutagenesis in a number of ways in addition to direct DNA damage, for example reducing the ability to repair errors, as well as producing epigenetic changes.\n\nAs a laboratory technique\n\nMutagenesis in the laboratory is an important technique whereby DNA mutations are deliberately engineered to produce mutant genes, proteins, or strains of organism.  Various constituents of a gene, such as its control elements and its gene product, may be mutated so that the functioning of a gene or protein can be examined in detail.  The mutation may also produce mutant proteins with interesting properties, or enhanced or novel functions that may be of commercial use.  Mutant strains may also be produced that have practical application or allow the molecular basis of particular cell function to be investigated.\n\nEarly methods of mutagenesis produced entirely random mutations; however, later methods of mutagenesis may produce site-specific mutation.\n\nTypes. Mutagenesis. http://en.wikipedia.org/?curid=19599."
  }
}
