{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4854",
  "eid" : "d0d13260-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778430086,
  "textBody" : "The Bermuda Triangle, also known as the Devil's Triangle, is a loosely-defined region in the western part of the North Atlantic Ocean, where a number of aircraft and ships are said to have disappeared under mysterious circumstances. Most reputable sources dismiss the idea that there is any mystery. The vicinity of the Bermuda Triangle is amongst the most heavily traveled shipping lanes in the world, with ships frequently crossing through it for ports in the Americas, Europe and the Caribbean islands. Cruise ships and pleasure craft regularly sail through the region, and commercial and private aircraft routinely fly over it.\n\nPopular culture has attributed various disappearances to the paranormal or activity by extraterrestrial beings. Documented evidence indicates that a significant percentage of the incidents were spurious, inaccurately reported, or embellished by later authors.\n\nTriangle area\n\nIn 1964, Vincent Gaddis wrote in the pulp magazine Argosy of the boundaries of the Bermuda Triangle, giving its vertices as Miami, San Juan, Puerto Rico, and Bermuda. Subsequent writers did not necessarily follow this definition. Some writers gave different boundaries and vertices to the triangle, with the total area varying from 1300000 to. Consequently, the determination of which accidents occurred inside the triangle depends on which writer reported them. \nOrigins\n\nThe earliest suggestion of unusual disappearances in the Bermuda area appeared in a September 17, 1950, article published in The Miami Herald (Associated Press) by Edward Van Winkle Jones. Two years later, Fate magazine published \"Sea Mystery at Our Back Door\", a short article by George X. Sand covering the loss of several planes and ships, including the loss of Flight 19, a group of five US Navy Grumman TBM Avenger torpedo bombers on a training mission. Sand's article was the first to lay out the now-familiar triangular area where the losses took place. Flight 19 alone would be covered again in the April 1962 issue of American Legion magazine. Cited in James R. Lewis (editor), Satanism Today: An Encyclopedia of Religion, Folklore, and Popular Culture, page 72, segment by Jerome Clark (ABC-CLIO, Inc., 2001).  In it, author Allan W. Eckert wrote that the flight leader had been heard saying, \"We are entering white water, nothing seems right. We don't know where we are, the water is green, no white.\" He also wrote that officials at the Navy board of inquiry stated that the planes \"flew off to Mars.\"Diana Formisano Willett, Paranormal Fright, page 9 (AuthorHouse, 2013),   Sand's article was the first to suggest a supernatural element to the Flight 19 incident. In the February 1964 issue of Argosy, Vincent Gaddis' article \"The Deadly Bermuda Triangle\" argued that Flight 19 and other disappearances were part of a pattern of strange events in the region. The next year, Gaddis expanded this article into a book, Invisible Horizons.\n\nOthers would follow with their own works, elaborating on Gaddis' ideas: John Wallace Spencer (Limbo of the Lost, 1969, repr. 1973);Spencer, 1969. Charles Berlitz (The Bermuda Triangle, 1974);Berlitz, 1974. Richard Winer (The Devil's Triangle, 1974), and many others, all keeping to some of the same supernatural elements outlined by Eckert.\n\nCriticism of the concept \n\nLarry Kusche \n\nLawrence David Kusche, author of The Bermuda Triangle Mystery: Solved (1975)Kusche, 1975. argued that many claims of Gaddis and subsequent writers were often exaggerated, dubious or unverifiable. Kusche's research revealed a number of inaccuracies and inconsistencies between Berlitz's accounts and statements from eyewitnesses, participants, and others involved in the initial incidents. Kusche noted cases where pertinent information went unreported, such as the disappearance of round-the-world yachtsman Donald Crowhurst, which Berlitz had presented as a mystery, despite clear evidence to the contrary. Another example was the ore-carrier recounted by Berlitz as lost without trace three days out of an Atlantic port when it had been lost three days out of a port with the same name in the Pacific Ocean. Kusche also argued that a large percentage of the incidents that sparked allegations of the Triangle's mysterious influence actually occurred well outside it. Often his research was simple: he would review period newspapers of the dates of reported incidents and find reports on possibly relevant events like unusual weather, that were never mentioned in the disappearance stories.\n\nKusche concluded that:\n* The number of ships and aircraft reported missing in the area was not significantly greater, proportionally speaking, than in any other part of the ocean.\n* In an area frequented by tropical cyclones, the number of disappearances that did occur were, for the most part, neither disproportionate, unlikely, nor mysterious.\n* Furthermore, Berlitz and other writers would often fail to mention such storms or even represent the disappearance as having happened in calm conditions when meteorological records clearly contradict this.\n* The numbers themselves had been exaggerated by sloppy research. A boat's disappearance, for example, would be reported, but its eventual (if belated) return to port may not have been.\n* Some disappearances had, in fact, never happened. One plane crash was said to have taken place in 1937, off Daytona Beach, Florida, in front of hundreds of witnesses; a check of the local papers revealed nothing.\n* The legend of the Bermuda Triangle is a manufactured mystery, perpetuated by writers who either purposely or unknowingly made use of misconceptions, faulty reasoning, and sensationalism.\n\nIn a 2013 study, the World Wide Fund for Nature identified the world's 10 most dangerous waters for shipping, but the Bermuda Triangle was not among them.\n\nFurther responses\n\nWhen the UK Channel 4 television program The Bermuda Triangle (1992) was being produced by John Simmons of Geofilms for the Equinox series, the marine insurance market Lloyd's of London was asked if an unusually large number of ships had sunk in the Bermuda Triangle area. Lloyd's determined that large numbers of ships had not sunk there. Lloyd's does not charge higher rates for passing through this area. United States Coast Guard records confirm their conclusion. In fact, the number of supposed disappearances is relatively insignificant considering the number of ships and aircraft that pass through on a regular basis.\n\nThe Coast Guard is also officially skeptical of the Triangle, noting that they collect and publish, through their inquiries, much documentation contradicting many of the incidents written about by the Triangle authors. In one such incident involving the 1972 explosion and sinking of the tanker , the Coast Guard photographed the wreck and recovered several bodies, in contrast with one Triangle author's claim that all the bodies had vanished, with the exception of the captain, who was found sitting in his cabin at his desk, clutching a coffee cup.  In addition, V. A. Fogg sank off the coast of Texas, nowhere near the commonly accepted boundaries of the Triangle.\n\nThe NOVA/Horizon episode The Case of the Bermuda Triangle, aired on June 27, 1976, was highly critical, stating that \"When we've gone back to the original sources or the people involved, the mystery evaporates. Science does not have to answer questions about the Triangle because those questions are not valid in the first place ... Ships and planes behave in the Triangle the same way they behave everywhere else in the world.\"\n\nSkeptical researchers, such as Ernest Taves and Barry Singer, have noted how mysteries and the paranormal are very popular and profitable. This has led to the production of vast amounts of material on topics such as the Bermuda Triangle. They were able to show that some of the pro-paranormal material is often misleading or inaccurate, but its producers continue to market it. Accordingly, they have claimed that the market is biased in favor of books, TV specials, and other media that support the Triangle mystery, and against well-researched material if it espouses a skeptical viewpoint.\n\nExplanation attempts \n\nPersons accepting the Bermuda Triangle as a real phenomenon have offered a number of explanatory approaches.\n\nParanormal explanations\n\nTriangle writers have used a number of supernatural concepts to explain the events. One explanation pins the blame on leftover technology from the mythical lost continent of Atlantis. Sometimes connected to the Atlantis story is the submerged rock formation known as the Bimini Road off the island of Bimini in the Bahamas, which is in the Triangle by some definitions. Followers of the purported psychic Edgar Cayce take his prediction that evidence of Atlantis would be found in 1968, as referring to the discovery of the Bimini Road. Believers describe the formation as a road, wall, or other structure, but the Bimini Road is of natural origin.\n\nOther writers attribute the events to UFOs. This idea was used by Steven Spielberg for his science fiction film Close Encounters of the Third Kind, which features the lost Flight 19 aircrews as alien abductees.\n\nCharles Berlitz, author of various books on anomalous phenomena, lists several theories attributing the losses in the Triangle to anomalous or unexplained forces.\n\nA paranormal explanation in the 2005 three-part US-British-German science fiction miniseries The Triangle, says the triangle is a wormhole.\n\nNatural explanations\n\nCompass variations\n\nCompass problems are one of the cited phrases in many Triangle incidents. While some have theorized that unusual local magnetic anomalies may exist in the area, such anomalies have not been found. Compasses have natural magnetic variations in relation to the magnetic poles, a fact which navigators have known for centuries. Magnetic (compass) north and geographic (true) north are exactly the same only for a small number of places – for example, as of 2000, in the United States, only those places on a line running from Wisconsin to the Gulf of Mexico. But the public may not be as informed, and think there is something mysterious about a compass \"changing\" across an area as large as the Triangle, which it naturally will.\n\nGulf Stream\n\nThe Gulf Stream is a major surface current, primarily driven by thermohaline circulation that originates in the Gulf of Mexico and then flows through the Straits of Florida into the North Atlantic. In essence, it is a river within an ocean, and, like a river, it can and does carry floating objects. It has a maximum surface velocity of about . A small plane making a water landing or a boat having engine trouble can be carried away from its reported position by the current.\n\nHuman error\n\nOne of the most cited explanations in official inquiries as to the loss of any aircraft or vessel is human error. Human stubbornness may have caused businessman Harvey Conover to lose his sailing yacht, Revonoc, as he sailed into the teeth of a storm south of Florida on January 1, 1958.\n\nViolent weather\n\nHurricanes are powerful storms that form in tropical waters and have historically cost thousands of lives and caused billions of dollars in damage. The sinking of Francisco de Bobadilla's Spanish fleet in 1502 was the first recorded instance of a destructive hurricane. These storms have in the past caused a number of incidents related to the Triangle.\n\nA powerful downdraft of cold air was suspected to be a cause in the sinking of Pride of Baltimore on May 14, 1986. The crew of the sunken vessel noted the wind suddenly shifted and increased velocity from 32 km/h to 97 -. A National Hurricane Center satellite specialist, James Lushine, stated \"during very unstable weather conditions the downburst of cold air from aloft can hit the surface like a bomb, exploding outward like a giant squall line of wind and water.\" A similar event occurred to Concordia in 2010, off the coast of Brazil. Scientists are currently investigating whether \"hexagonal\" clouds may be the source of these up-to- \"air bombs\".\n\nMethane hydrates\n\nAn explanation for some of the disappearances has focused on the presence of large fields of methane hydrates (a form of natural gas) on the continental shelves. Laboratory experiments carried out in Australia have proven that bubbles can, indeed, sink a scale model ship by decreasing the density of the water; any wreckage consequently rising to the surface would be rapidly dispersed by the Gulf Stream. It has been hypothesized that periodic methane eruptions (sometimes called \"mud volcanoes\") may produce regions of frothy water that are no longer capable of providing adequate buoyancy for ships. If this were the case, such an area forming around a ship could cause it to sink very rapidly and without warning.\n\nPublications by the USGS describe large stores of undersea hydrates worldwide, including the Blake Ridge area, off the coast of the southeastern United States. However, according to the USGS, no large releases of gas hydrates are believed to have occurred in the Bermuda Triangle for the past 15,000 years.\n\nNotable incidents\n\nEllen Austin\n\nEllen Austin supposedly came across a derelict ship, placed on board a prize crew, and attempted to sail with it to New York in 1881. According to the stories, the derelict disappeared; others elaborating further that the derelict reappeared minus the prize crew, then disappeared again with a second prize crew on board. A check from Lloyd's of London records proved the existence of Meta, built in 1854, and that in 1880, Meta was renamed Ellen Austin. There are no casualty listings for this vessel, or any vessel at that time, that would suggest a large number of missing men were placed on board a derelict that later disappeared.\n\nUSS Cyclops\n\nThe incident resulting in the single largest loss of life in the history of the US Navy not related to combat occurred when the collier Cyclops, carrying a full load of manganese ore and with one engine out of action, went missing without a trace with a crew of 309 sometime after March 4, 1918, after departing the island of Barbados. Although there is no strong evidence for any single theory, many independent theories exist, some blaming storms, some capsizing, and some suggesting that wartime enemy activity was to blame for the loss. In addition, two of Cyclopss sister ships,  and  were subsequently lost in the North Atlantic during World War II. Both ships were transporting heavy loads of metallic ore similar to that which was loaded on Cyclops during her fatal voyage. In all three cases structural failure due to overloading with a much denser cargo than designed is considered the most likely cause of sinking.\n\nCarroll A. Deering\n\nA five-masted schooner built in 1919, Carroll A. Deering was found hard aground and abandoned at Diamond Shoals, near Cape Hatteras, North Carolina, on January 31, 1921. Rumors and more at the time indicated Deering was a victim of piracy, possibly connected with the illegal rum-running trade during Prohibition, and possibly involving another ship, , which disappeared at roughly the same time. Just hours later, an unknown steamer sailed near the lightship along the track of Deering, and ignored all signals from the lightship. It is speculated that Hewitt may have been this mystery ship, and possibly involved in Deerings crew disappearance.\n\nFlight 19\n\nFlight 19 was a training flight of five TBM Avenger torpedo bombers that disappeared on December 5, 1945, while over the Atlantic. The squadron's flight plan was scheduled to take them due east from Fort Lauderdale for , north for , and then back over a final 140 mi leg to complete the exercise. The flight never returned to base. The disappearance is attributed by Navy investigators to navigational error leading to the aircraft running out of fuel.\n\nOne of the search and rescue aircraft deployed to look for them, a PBM Mariner with a 13-man crew, also disappeared. A tanker off the coast of Florida reported seeing an explosion and observing a widespread oil slick when fruitlessly searching for survivors. The weather was becoming stormy by the end of the incident. According to contemporaneous sources the Mariner had a history of explosions due to vapour leaks when heavily loaded with fuel, as it might have been for a potentially long search-and-rescue operation.\n\nStar Tiger and Star Ariel\n\nG-AHNP Star Tiger disappeared on January 30, 1948, on a flight from the Azores to Bermuda; G-AGRE Star Ariel disappeared on January 17, 1949, on a flight from Bermuda to Kingston, Jamaica. Both were Avro Tudor IV passenger aircraft operated by British South American Airways. Both planes were operating at the very limits of their range and the slightest error or fault in the equipment could keep them from reaching the small island.\n\nDouglas DC-3\n\nOn December 28, 1948, a Douglas DC-3 aircraft, number NC16002, disappeared while on a flight from San Juan, Puerto Rico, to Miami. No trace of the aircraft, or the 32 people on board, was ever found. A Civil Aeronautics Board investigation found there was insufficient information available on which to determine probable cause of the disappearance.\n\nConnemara IV\n\nA pleasure yacht was found adrift in the Atlantic south of Bermuda on September 26, 1955; it is usually stated in the stories (Berlitz, Winer) that the crew vanished while the yacht survived being at sea during three hurricanes. The 1955 Atlantic hurricane season shows Hurricane Ione passing nearby between 14 and 18 September, with Bermuda being affected by winds of almost gale force. In his second book on the Bermuda Triangle, Winer quoted from a letter he had received from Mr J.E. Challenor of Barbados:\n\nOn the morning of September 22, Connemara IV was lying to a heavy mooring in the open roadstead of Carlisle Bay. Because of the approaching hurricane, the owner strengthened the mooring ropes and put out two additional anchors. There was little else he could do, as the exposed mooring was the only available anchorage. ... In Carlisle Bay, the sea in the wake of Hurricane Janet was awe-inspiring and dangerous. The owner of Connemara IV observed that she had disappeared. An investigation revealed that she had dragged her moorings and gone to sea.\n\nKC-135 Stratotankers\n\nOn August 28, 1963, a pair of US Air Force KC-135 Stratotanker aircraft collided and crashed into the Atlantic. The Triangle version (Winer, Berlitz, Gaddis) of this story states that while the two aircraft did collide and crash, there were two distinct crash sites, separated by over 160 mi of water. However, Kusche's research showed that the unclassified version of the Air Force investigation report stated that the debris field defining the second \"crash site\" was examined by a search and rescue ship, and found to be a mass of seaweed and driftwood tangled in an old buoy.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bermuda Triangle" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4854" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Bermuda Triangle, also known as the Devil's Triangle, is a loosely-defined region in the western part of the North Atlantic Ocean, where a number of aircraft and ships are said to have disappeared under mysterious circumstances. Most reputable sources dismiss the idea that there is any mystery. The vicinity of the Bermuda Triangle is amongst the most heavily traveled shipping lanes in the world, with ships frequently crossing through it for ports in the Americas, Europe and the Caribbean islands. Cruise ships and pleasure craft regularly sail through the region, and commercial and private aircraft routinely fly over it.\n\nPopular culture has attributed various disappearances to the paranormal or activity by extraterrestrial beings. Documented evidence indicates that a significant percentage of the incidents were spurious, inaccurately reported, or embellished by later authors.\n\nTriangle area\n\nIn 1964, Vincent Gaddis wrote in the pulp magazine Argosy of the boundaries of the Bermuda Triangle, giving its vertices as Miami, San Juan, Puerto Rico, and Bermuda. Subsequent writers did not necessarily follow this definition. Some writers gave different boundaries and vertices to the triangle, with the total area varying from 1300000 to. Consequently, the determination of which accidents occurred inside the triangle depends on which writer reported them. \nOrigins\n\nThe earliest suggestion of unusual disappearances in the Bermuda area appeared in a September 17, 1950, article published in The Miami Herald (Associated Press) by Edward Van Winkle Jones. Two years later, Fate magazine published \"Sea Mystery at Our Back Door\", a short article by George X. Sand covering the loss of several planes and ships, including the loss of Flight 19, a group of five US Navy Grumman TBM Avenger torpedo bombers on a training mission. Sand's article was the first to lay out the now-familiar triangular area where the losses took place. Flight 19 alone would be covered again in the April 1962 issue of American Legion magazine. Cited in James R. Lewis (editor), Satanism Today: An Encyclopedia of Religion, Folklore, and Popular Culture, page 72, segment by Jerome Clark (ABC-CLIO, Inc., 2001).  In it, author Allan W. Eckert wrote that the flight leader had been heard saying, \"We are entering white water, nothing seems right. We don't know where we are, the water is green, no white.\" He also wrote that officials at the Navy board of inquiry stated that the planes \"flew off to Mars.\"Diana Formisano Willett, Paranormal Fright, page 9 (AuthorHouse, 2013),   Sand's article was the first to suggest a supernatural element to the Flight 19 incident. In the February 1964 issue of Argosy, Vincent Gaddis' article \"The Deadly Bermuda Triangle\" argued that Flight 19 and other disappearances were part of a pattern of strange events in the region. The next year, Gaddis expanded this article into a book, Invisible Horizons.\n\nOthers would follow with their own works, elaborating on Gaddis' ideas: John Wallace Spencer (Limbo of the Lost, 1969, repr. 1973);Spencer, 1969. Charles Berlitz (The Bermuda Triangle, 1974);Berlitz, 1974. Richard Winer (The Devil's Triangle, 1974), and many others, all keeping to some of the same supernatural elements outlined by Eckert.\n\nCriticism of the concept \n\nLarry Kusche \n\nLawrence David Kusche, author of The Bermuda Triangle Mystery: Solved (1975)Kusche, 1975. argued that many claims of Gaddis and subsequent writers were often exaggerated, dubious or unverifiable. Kusche's research revealed a number of inaccuracies and inconsistencies between Berlitz's accounts and statements from eyewitnesses, participants, and others involved in the initial incidents. Kusche noted cases where pertinent information went unreported, such as the disappearance of round-the-world yachtsman Donald Crowhurst, which Berlitz had presented as a mystery, despite clear evidence to the contrary. Another example was the ore-carrier recounted by Berlitz as lost without trace three days out of an Atlantic port when it had been lost three days out of a port with the same name in the Pacific Ocean. Kusche also argued that a large percentage of the incidents that sparked allegations of the Triangle's mysterious influence actually occurred well outside it. Often his research was simple: he would review period newspapers of the dates of reported incidents and find reports on possibly relevant events like unusual weather, that were never mentioned in the disappearance stories.\n\nKusche concluded that:\n* The number of ships and aircraft reported missing in the area was not significantly greater, proportionally speaking, than in any other part of the ocean.\n* In an area frequented by tropical cyclones, the number of disappearances that did occur were, for the most part, neither disproportionate, unlikely, nor mysterious.\n* Furthermore, Berlitz and other writers would often fail to mention such storms or even represent the disappearance as having happened in calm conditions when meteorological records clearly contradict this.\n* The numbers themselves had been exaggerated by sloppy research. A boat's disappearance, for example, would be reported, but its eventual (if belated) return to port may not have been.\n* Some disappearances had, in fact, never happened. One plane crash was said to have taken place in 1937, off Daytona Beach, Florida, in front of hundreds of witnesses; a check of the local papers revealed nothing.\n* The legend of the Bermuda Triangle is a manufactured mystery, perpetuated by writers who either purposely or unknowingly made use of misconceptions, faulty reasoning, and sensationalism.\n\nIn a 2013 study, the World Wide Fund for Nature identified the world's 10 most dangerous waters for shipping, but the Bermuda Triangle was not among them.\n\nFurther responses\n\nWhen the UK Channel 4 television program The Bermuda Triangle (1992) was being produced by John Simmons of Geofilms for the Equinox series, the marine insurance market Lloyd's of London was asked if an unusually large number of ships had sunk in the Bermuda Triangle area. Lloyd's determined that large numbers of ships had not sunk there. Lloyd's does not charge higher rates for passing through this area. United States Coast Guard records confirm their conclusion. In fact, the number of supposed disappearances is relatively insignificant considering the number of ships and aircraft that pass through on a regular basis.\n\nThe Coast Guard is also officially skeptical of the Triangle, noting that they collect and publish, through their inquiries, much documentation contradicting many of the incidents written about by the Triangle authors. In one such incident involving the 1972 explosion and sinking of the tanker , the Coast Guard photographed the wreck and recovered several bodies, in contrast with one Triangle author's claim that all the bodies had vanished, with the exception of the captain, who was found sitting in his cabin at his desk, clutching a coffee cup.  In addition, V. A. Fogg sank off the coast of Texas, nowhere near the commonly accepted boundaries of the Triangle.\n\nThe NOVA/Horizon episode The Case of the Bermuda Triangle, aired on June 27, 1976, was highly critical, stating that \"When we've gone back to the original sources or the people involved, the mystery evaporates. Science does not have to answer questions about the Triangle because those questions are not valid in the first place ... Ships and planes behave in the Triangle the same way they behave everywhere else in the world.\"\n\nSkeptical researchers, such as Ernest Taves and Barry Singer, have noted how mysteries and the paranormal are very popular and profitable. This has led to the production of vast amounts of material on topics such as the Bermuda Triangle. They were able to show that some of the pro-paranormal material is often misleading or inaccurate, but its producers continue to market it. Accordingly, they have claimed that the market is biased in favor of books, TV specials, and other media that support the Triangle mystery, and against well-researched material if it espouses a skeptical viewpoint.\n\nExplanation attempts \n\nPersons accepting the Bermuda Triangle as a real phenomenon have offered a number of explanatory approaches.\n\nParanormal explanations\n\nTriangle writers have used a number of supernatural concepts to explain the events. One explanation pins the blame on leftover technology from the mythical lost continent of Atlantis. Sometimes connected to the Atlantis story is the submerged rock formation known as the Bimini Road off the island of Bimini in the Bahamas, which is in the Triangle by some definitions. Followers of the purported psychic Edgar Cayce take his prediction that evidence of Atlantis would be found in 1968, as referring to the discovery of the Bimini Road. Believers describe the formation as a road, wall, or other structure, but the Bimini Road is of natural origin.\n\nOther writers attribute the events to UFOs. This idea was used by Steven Spielberg for his science fiction film Close Encounters of the Third Kind, which features the lost Flight 19 aircrews as alien abductees.\n\nCharles Berlitz, author of various books on anomalous phenomena, lists several theories attributing the losses in the Triangle to anomalous or unexplained forces.\n\nA paranormal explanation in the 2005 three-part US-British-German science fiction miniseries The Triangle, says the triangle is a wormhole.\n\nNatural explanations\n\nCompass variations\n\nCompass problems are one of the cited phrases in many Triangle incidents. While some have theorized that unusual local magnetic anomalies may exist in the area, such anomalies have not been found. Compasses have natural magnetic variations in relation to the magnetic poles, a fact which navigators have known for centuries. Magnetic (compass) north and geographic (true) north are exactly the same only for a small number of places – for example, as of 2000, in the United States, only those places on a line running from Wisconsin to the Gulf of Mexico. But the public may not be as informed, and think there is something mysterious about a compass \"changing\" across an area as large as the Triangle, which it naturally will.\n\nGulf Stream\n\nThe Gulf Stream is a major surface current, primarily driven by thermohaline circulation that originates in the Gulf of Mexico and then flows through the Straits of Florida into the North Atlantic. In essence, it is a river within an ocean, and, like a river, it can and does carry floating objects. It has a maximum surface velocity of about . A small plane making a water landing or a boat having engine trouble can be carried away from its reported position by the current.\n\nHuman error\n\nOne of the most cited explanations in official inquiries as to the loss of any aircraft or vessel is human error. Human stubbornness may have caused businessman Harvey Conover to lose his sailing yacht, Revonoc, as he sailed into the teeth of a storm south of Florida on January 1, 1958.\n\nViolent weather\n\nHurricanes are powerful storms that form in tropical waters and have historically cost thousands of lives and caused billions of dollars in damage. The sinking of Francisco de Bobadilla's Spanish fleet in 1502 was the first recorded instance of a destructive hurricane. These storms have in the past caused a number of incidents related to the Triangle.\n\nA powerful downdraft of cold air was suspected to be a cause in the sinking of Pride of Baltimore on May 14, 1986. The crew of the sunken vessel noted the wind suddenly shifted and increased velocity from 32 km/h to 97 -. A National Hurricane Center satellite specialist, James Lushine, stated \"during very unstable weather conditions the downburst of cold air from aloft can hit the surface like a bomb, exploding outward like a giant squall line of wind and water.\" A similar event occurred to Concordia in 2010, off the coast of Brazil. Scientists are currently investigating whether \"hexagonal\" clouds may be the source of these up-to- \"air bombs\".\n\nMethane hydrates\n\nAn explanation for some of the disappearances has focused on the presence of large fields of methane hydrates (a form of natural gas) on the continental shelves. Laboratory experiments carried out in Australia have proven that bubbles can, indeed, sink a scale model ship by decreasing the density of the water; any wreckage consequently rising to the surface would be rapidly dispersed by the Gulf Stream. It has been hypothesized that periodic methane eruptions (sometimes called \"mud volcanoes\") may produce regions of frothy water that are no longer capable of providing adequate buoyancy for ships. If this were the case, such an area forming around a ship could cause it to sink very rapidly and without warning.\n\nPublications by the USGS describe large stores of undersea hydrates worldwide, including the Blake Ridge area, off the coast of the southeastern United States. However, according to the USGS, no large releases of gas hydrates are believed to have occurred in the Bermuda Triangle for the past 15,000 years.\n\nNotable incidents\n\nEllen Austin\n\nEllen Austin supposedly came across a derelict ship, placed on board a prize crew, and attempted to sail with it to New York in 1881. According to the stories, the derelict disappeared; others elaborating further that the derelict reappeared minus the prize crew, then disappeared again with a second prize crew on board. A check from Lloyd's of London records proved the existence of Meta, built in 1854, and that in 1880, Meta was renamed Ellen Austin. There are no casualty listings for this vessel, or any vessel at that time, that would suggest a large number of missing men were placed on board a derelict that later disappeared.\n\nUSS Cyclops\n\nThe incident resulting in the single largest loss of life in the history of the US Navy not related to combat occurred when the collier Cyclops, carrying a full load of manganese ore and with one engine out of action, went missing without a trace with a crew of 309 sometime after March 4, 1918, after departing the island of Barbados. Although there is no strong evidence for any single theory, many independent theories exist, some blaming storms, some capsizing, and some suggesting that wartime enemy activity was to blame for the loss. In addition, two of Cyclopss sister ships,  and  were subsequently lost in the North Atlantic during World War II. Both ships were transporting heavy loads of metallic ore similar to that which was loaded on Cyclops during her fatal voyage. In all three cases structural failure due to overloading with a much denser cargo than designed is considered the most likely cause of sinking.\n\nCarroll A. Deering\n\nA five-masted schooner built in 1919, Carroll A. Deering was found hard aground and abandoned at Diamond Shoals, near Cape Hatteras, North Carolina, on January 31, 1921. Rumors and more at the time indicated Deering was a victim of piracy, possibly connected with the illegal rum-running trade during Prohibition, and possibly involving another ship, , which disappeared at roughly the same time. Just hours later, an unknown steamer sailed near the lightship along the track of Deering, and ignored all signals from the lightship. It is speculated that Hewitt may have been this mystery ship, and possibly involved in Deerings crew disappearance.\n\nFlight 19\n\nFlight 19 was a training flight of five TBM Avenger torpedo bombers that disappeared on December 5, 1945, while over the Atlantic. The squadron's flight plan was scheduled to take them due east from Fort Lauderdale for , north for , and then back over a final 140 mi leg to complete the exercise. The flight never returned to base. The disappearance is attributed by Navy investigators to navigational error leading to the aircraft running out of fuel.\n\nOne of the search and rescue aircraft deployed to look for them, a PBM Mariner with a 13-man crew, also disappeared. A tanker off the coast of Florida reported seeing an explosion and observing a widespread oil slick when fruitlessly searching for survivors. The weather was becoming stormy by the end of the incident. According to contemporaneous sources the Mariner had a history of explosions due to vapour leaks when heavily loaded with fuel, as it might have been for a potentially long search-and-rescue operation.\n\nStar Tiger and Star Ariel\n\nG-AHNP Star Tiger disappeared on January 30, 1948, on a flight from the Azores to Bermuda; G-AGRE Star Ariel disappeared on January 17, 1949, on a flight from Bermuda to Kingston, Jamaica. Both were Avro Tudor IV passenger aircraft operated by British South American Airways. Both planes were operating at the very limits of their range and the slightest error or fault in the equipment could keep them from reaching the small island.\n\nDouglas DC-3\n\nOn December 28, 1948, a Douglas DC-3 aircraft, number NC16002, disappeared while on a flight from San Juan, Puerto Rico, to Miami. No trace of the aircraft, or the 32 people on board, was ever found. A Civil Aeronautics Board investigation found there was insufficient information available on which to determine probable cause of the disappearance.\n\nConnemara IV\n\nA pleasure yacht was found adrift in the Atlantic south of Bermuda on September 26, 1955; it is usually stated in the stories (Berlitz, Winer) that the crew vanished while the yacht survived being at sea during three hurricanes. The 1955 Atlantic hurricane season shows Hurricane Ione passing nearby between 14 and 18 September, with Bermuda being affected by winds of almost gale force. In his second book on the Bermuda Triangle, Winer quoted from a letter he had received from Mr J.E. Challenor of Barbados:\n\nOn the morning of September 22, Connemara IV was lying to a heavy mooring in the open roadstead of Carlisle Bay. Because of the approaching hurricane, the owner strengthened the mooring ropes and put out two additional anchors. There was little else he could do, as the exposed mooring was the only available anchorage. ... In Carlisle Bay, the sea in the wake of Hurricane Janet was awe-inspiring and dangerous. The owner of Connemara IV observed that she had disappeared. An investigation revealed that she had dragged her moorings and gone to sea.\n\nKC-135 Stratotankers\n\nOn August 28, 1963, a pair of US Air Force KC-135 Stratotanker aircraft collided and crashed into the Atlantic. The Triangle version (Winer, Berlitz, Gaddis) of this story states that while the two aircraft did collide and crash, there were two distinct crash sites, separated by over 160 mi of water. However, Kusche's research showed that the unclassified version of the Air Force investigation report stated that the debris field defining the second \"crash site\" was examined by a search and rescue ship, and found to be a mass of seaweed and driftwood tangled in an old buoy. Bermuda Triangle. http://en.wikipedia.org/?curid=4854."
  }
}
