{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16803",
  "eid" : "28aa8400-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778577472,
  "textBody" : "In chemistry, a ketone (alkanone) is an organic compound with the structure RC(=O)R', where R and R' can be a variety of carbon-containing substituents. Ketones and aldehydes are simple compounds that contain a carbonyl group (a carbon-oxygen double bond). They are considered \"simple\" because they do not have reactive groups like −OH or −Cl attached directly to the carbon atom in the carbonyl group, as in carboxylic acids containing −COOH.[http://www.chemguide.co.uk/organicprops/carbonyls/background.html an introduction to aldehydes and ketones]. Chemguide.co.uk. Retrieved on 2016-10-28. Many ketones are known and many are of great importance in industry and in biology. Examples include many sugars (ketoses) and the industrial solvent acetone, which is the smallest ketone.\n\nNomenclature and etymology\n\nThe word ketone is derived from Aketon, an old German word for acetone.The word \"ketone\" was coined in 1848 by the German chemist Leopold Gmelin.  See:  Leopold Gmelin, ed., Handbuch der organischen Chemie: Organische Chemie im Allgemeinen … (Handbook of organic chemistry:  Organic chemistry in general  … ), 4th ed., (Heidelberg, (Germany):  Karl Winter, 1848), volume 1, p. 40.  From page 40:  \"Zu diesen Syndesmiden scheinen auch diejenigen Verbindungen zu gehören, die als Acetone im Allegemeinen (Ketone?) bezeichnet werden.\"  (To these syndesmides*, those compounds also seem to belong, which are designated as acetones in general (ketones?).\") [*Note:  In 1844, the French chemist Auguste Laurent suggested a new nomenclature for organic compounds.  One of his new classes of compounds was \"syndesmides\", which were compounds formed by the combination of two or more simpler organic molecules (from the Greek σύνδεσμος (syndesmos, union) + -ide (indicating a group of related compounds)).  For example, acetone could be formed by the dry distillation of metal acetates, so acetone was the syndesmide of two acetate ions.  See:  Laurent, Auguste (1844) [https://books.google.com/books?id2wVQAAAAYAAJ&pg\nPA1089 \"Classification chimique,\"] Comptes rendus, 19 :  1089–1100 ; see especially p. 1097.\n\nAccording to the rules of IUPAC nomenclature, ketones are named by changing the suffix -ane of the parent alkane to -anone. The position of the carbonyl group is usually denoted by a number. For the most important ketones, however, traditional nonsystematic names are still generally used, for example acetone and benzophenone. These nonsystematic names are considered retained IUPAC names,List of retained IUPAC names [http://www.acdlabs.com/iupac/nomenclature/93/r93_701.htm retained IUPAC names  Link] although some introductory chemistry textbooks use systematic names such as \"2-propanone\" or \"propan-2-one\" for the simplest ketone (CH3−CO−CH3) instead of \"acetone\".\n\nThe common names of ketones are obtained by writing separately the names of the two alkyl groups attached to the carbonyl group, followed by \"ketone\" as a separate word. The names of the alkyl groups are written alphabetically. When the two alkyl groups are the same, the prefix di- is added before the name of alkyl group. The positions of other groups are indicated by Greek letters, the α-carbon being the atom adjacent to carbonyl group. If both alkyl groups in a ketone are the same then the ketone is said to be symmetrical, otherwise unsymmetrical.\n\nAlthough used infrequently, oxo is the IUPAC nomenclature for a ketone functional group. Other prefixes, however, are also used. For some common chemicals (mainly in biochemistry), keto or oxo refer to the ketone functional group. The term oxo is used widely through chemistry. For example, it also refers to an oxygen atom bonded to a transition metal (a metal oxo).\n\nStructure and properties\n\nThe ketone carbon is often described as \"sp2 hybridized\", a description that includes both their electronic and molecular structure. Ketones are trigonal planar around the ketonic carbon, with C−C−O and C−C−C bond angles of approximately 120°. Ketones differ from aldehydes in that the carbonyl group (CO) is bonded to two carbons within a carbon skeleton. In aldehydes, the carbonyl is bonded to one carbon and one hydrogen and are located at the ends of carbon chains. Ketones are also distinct from other carbonyl-containing functional groups, such as carboxylic acids, esters and amides.\n\nThe carbonyl group is polar because the electronegativity of the oxygen is greater than that for carbon. Thus, ketones are nucleophilic at oxygen and electrophilic at carbon. Because the carbonyl group interacts with water by hydrogen bonding, ketones are typically more soluble in water than the related methylene compounds. Ketones are hydrogen-bond acceptors. Ketones are not usually hydrogen-bond donors and cannot hydrogen-bond to themselves. Because of their inability to serve both as hydrogen-bond donors and acceptors, ketones tend not to \"self-associate\" and are more volatile than alcohols and carboxylic acids of comparable molecular weights. These factors relate to the pervasiveness of ketones in perfumery and as solvents.\n\nClasses of ketones\n\nKetones are classified on the basis of their substituents. One broad classification subdivides ketones into symmetrical and asymmetrical derivatives, depending on the equivalency of the two organic substituents attached to the carbonyl center. Acetone and benzophenone (C6H5C(O)C6H5) are symmetrical ketones. Acetophenone (C6H5C(O)CH3) is an asymmetrical ketone. In the area of stereochemistry, asymmetrical ketones are known for being prochiral.\n\nDiketones\n\nMany kinds of diketones are known, some with unusual properties. The simplest is diacetyl (CH3C(O)C(O)CH3), once used as butter-flavoring in popcorn. Acetylacetone (pentane-2,4-dione) is virtually a misnomer (inappropriate name) because this species exists mainly as the monoenol CH3C(O)CH=C(OH)CH3. Its enolate is a common ligand in coordination chemistry.\n\nUnsaturated ketones\n\nKetones containing alkene and alkyne units are often called unsaturated ketones. The most widely used member of this class of compounds is methyl vinyl ketone, CH3C(O)CH=CH2, which is useful in the Robinson annulation reaction. Lest there be confusion, a ketone itself is a site of unsaturation; that is, it can be hydrogenated.\n\nCyclic ketones\n\nMany ketones are cyclic. The simplest class have the formula (CH2)nCO, where n varies from 2 for cyclopropanone to the teens. Larger derivatives exist. Cyclohexanone, a symmetrical cyclic ketone, is an important intermediate in the production of nylon. Isophorone, derived from acetone, is an unsaturated, asymmetrical ketone that is the precursor to other polymers. Muscone, 3-methylpentadecanone, is an animal pheromone. Another cyclic ketone is cyclobutanone, having the formula C4H6O.\n\nKeto-enol tautomerization\n\nKetones that have at least one alpha-hydrogen, undergo keto-enol tautomerization; the tautomer is an enol. Tautomerization is catalyzed by both acids and bases. Usually, the keto form is more stable than the enol. This equilibrium allows ketones to be prepared via the hydration of alkynes.\n\nAcidity of ketones\n\nKetones are far more acidic (pKa ≈ 20) than a regular alkane (pKa ≈ 50). This difference reflects resonance stabilization of the enolate ion that is formed upon deprotonation. The relative acidity of the α-hydrogen is important in the enolization reactions of ketones and other carbonyl compounds. The acidity of the α-hydrogen also allows ketones and other carbonyl compounds to undergo nucleophilic reactions at that position, with either stoichiometric and catalytic base.\n\nCharacterization\n\nAn aldehyde differs from a ketone because of its hydrogen atom attached to its carbonyl group, making aldehydes easier to oxidize. Ketones don't have a hydrogen atom bonded to the carbonyl group, and are more resistant to oxidation. They are only oxidized by powerful oxidizing agents which have the ability to cleave carbon-carbon bonds.\n\nSpectroscopy\n\nKetones and aldehydes absorb strongly in the infra-red spectrum near 1700 cm−1. The exact position of the peak depends on the substituents.\n\nWhereas 1H NMR spectroscopy is generally not useful for establishing the presence of a ketone, 13C NMR spectra exhibit signals somewhat downfield of 200 ppm depending on structure. Such signals are typically weak due to the absence of nuclear Overhauser effects. Since aldehydes resonate at similar chemical shifts, multiple resonance experiments are employed to definitively distinguish aldehydes and ketones.\n\nQualitative organic tests\n\nKetones give positive results in Brady's test, the reaction with 2,4-dinitrophenylhydrazine to give the corresponding hydrazone. Ketones may be distinguished from aldehydes by giving a negative result with Tollens' reagent or with Fehling's solution. Methyl ketones give positive results for the iodoform test. Ketones also give positive results when treated with Metadinitrobenzene(m-dinitrobenzene) in presence of dilute Sodium Hydroxide to give violet coloration.\n\nSynthesis\n\nMany methods exist for the preparation of ketones in industrial scale and academic laboratories. Ketones are also produced in various ways by organisms, see the section on biochemistry below.\n\nIn industry, the most important method probably involves oxidation of hydrocarbons, often with air. For example, a billion kilograms of cyclohexanone are produced annually by aerobic oxidation of cyclohexane. Acetone is prepared by air-oxidation of cumene.\n\nFor specialized or small scale organic synthetic applications, ketones are often prepared by oxidation of secondary alcohols:\nR2CH(OH)  +  O   →   R2C=O  +  H2O\nTypical strong oxidants (source of \"O\" in the above reaction) include potassium permanganate or a Cr(VI) compound. Milder conditions make use of the Dess–Martin periodinane or the Moffatt–Swern methods.\n\nMany other methods have been developed, examples include:\n* By geminal halide hydrolysis.\n* By hydration of alkynes. Such processes occur via enols and require the presence of an acid and HgSO4. Subsequent enol–keto tautomerization gives a ketone. This reaction always produces a ketone, even with a terminal alkyne.\n*From Weinreb Amides using stoichiometric organometallic reagents.\n* Aromatic ketones can be prepared in the Friedel–Crafts acylation, the related Houben–Hoesch reaction, and the Fries rearrangement.\n* Ozonolysis, and related dihydroxylation/oxidative sequences, cleave alkenes to give aldehydes or ketones, depending on alkene substitution pattern.\n* In the Kornblum–DeLaMare rearrangement ketones are prepared from peroxides and base.\n* In the Ruzicka cyclization, cyclic ketones are prepared from dicarboxylic acids.\n* In the Nef reaction, ketones form by hydrolysis of salts of secondary nitro compounds.\n* In the Fukuyama coupling, ketones form from a thioester and an organozinc compound.\n* By the reaction of an acid chloride with organocadmium compounds or organocopper compounds.\n* The Dakin–West reaction provides an efficient method for preparation of certain methyl ketones from carboxylic acids.\n* Ketones can also be prepared by the reaction of Grignard reagents with nitriles, followed by hydrolysis.\n* By decarboxylation of carboxylic anhydride.\n* Ketones can be prepared from haloketones in reductive dehalogenation of halo ketones.\n* In ketonic decarboxylation symmetrical ketones are prepared from carboxylic acids.\n* Oxidation of amines with iron(III) chloride.\n* Hydrolysis of unsaturated secondary amides, β-Keto acid esters, or β-diketones.\n* Acid-catalysed rearrangement of 1,2-diols.\n\nReactions\n\nKetones engage in many organic reactions. The most important reactions follow from the susceptibility of the carbonyl carbon toward nucleophilic addition and the tendency for the enolates to add to electrophiles.\nNucleophilic additions include in approximate order of their generality:\n* With water (hydration) gives geminal diols, which are usually not formed in appreciable (or observable) amounts\n* With an acetylide to give the α-hydroxyalkyne\n* With ammonia or a primary amine gives an imine\n* With secondary amine gives an enamine\n* With Grignard and organolithium reagents to give, after aqueous workup, a tertiary alcohol\n* With an alcohols or alkoxides to gives the hemiketal or its conjugate base. With a diol to the ketal. This reaction is employed to protect ketones.\n* With sodium amide resulting in C–C bond cleavage with formation of the amide RCONH2 and the alkane R'H, a reaction called the Haller–Bauer reaction.[https://web.archive.org/web/20070910060716/http://nagoyaren.homeip.net/chem/reactions/123.htm Haller–Bauer Reaction]. homeip.net\n* With strong oxidizing agents to give carboxylic acids.\n* Electrophilic addition, reaction with an electrophile gives a resonance stabilized cation\n* With phosphonium ylides in the Wittig reaction to give the alkenes\n* With thiols to give the thioacetal\n* With hydrazine or 1-disubstituted derivatives of hydrazine to give hydrazones.\n* With a metal hydride gives a metal alkoxide salt, hydrolysis of which gives the alcohol, an example of ketone reduction\n* With halogens to form an α-haloketone, a reaction that proceeds via an enol (see Haloform reaction)\n* With heavy water to give an α-deuterated ketone\n* Fragmentation in photochemical Norrish reaction\n* Reaction of 1,4-aminodiketones to oxazoles by dehydration in the Robinson–Gabriel synthesis\n* In the case of aryl–alkyl ketones, with sulfur and an amine give amides in the Willgerodt reaction\n* With hydroxylamine to produce oximes\n* With reducing agents to form secondary alcohols\n* With peroxy acids to form esters in the Baeyer–Villiger oxidation\n\nBiochemistry\n\nKetones are pervasive in nature. The formation of organic compounds in photosynthesis occurs via the ketone ribulose-1,5-bisphosphate. Many sugars are ketones, known collectively as ketoses. The best known ketose is fructose, which exists as a cyclic hemiketal, which masks the ketone functional group. Fatty acid synthesis proceeds via ketones. Acetoacetate is an intermediate in the Krebs cycle which releases energy from sugars and carbohydrates.Nelson, D. L.; Cox, M. M. (2000) Lehninger, Principles of Biochemistry. 3rd Ed. Worth Publishing: New York. .\n\nIn medicine, acetone, acetoacetate, and beta-hydroxybutyrate are collectively called ketone bodies, generated from carbohydrates, fatty acids, and amino acids in most vertebrates, including humans. Ketone bodies are elevated in the blood (ketosis) after fasting, including a night of sleep; in both blood and urine in starvation; in hypoglycemia, due to causes other than hyperinsulinism; in various inborn errors of metabolism, and intentionally induced via a ketogenic diet, and in ketoacidosis (usually due to diabetes mellitus). Although ketoacidosis is characteristic of decompensated or untreated type 1 diabetes, ketosis or even ketoacidosis can occur in type 2 diabetes in some circumstances as well.\n\nApplications\n\nKetones are produced on massive scales in industry as solvents, polymer precursors, and pharmaceuticals. In terms of scale, the most important ketones are acetone, methylethyl ketone, and cyclohexanone.Siegel, Hardo and Eggersdorfer, Manfred (2005) \"Ketones\" in Ullmann's Encyclopedia of Industrial Chemistry, Wiley-VCH, Weinheim.  They are also common in biochemistry, but less so than in organic chemistry in general. The combustion of hydrocarbons is an uncontrolled oxidation process that gives ketones as well as many other types of compounds.\n\nToxicity\n\nAlthough it is difficult to generalize on the toxicity of such a broad class of compounds, simple ketones are, in general, not highly toxic. This characteristic is one reason for their popularity as solvents. Exceptions to this rule are the unsaturated ketones such as methyl vinyl ketone with  of 7 mg/kg (oral).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ketone" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16803" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In chemistry, a ketone (alkanone) is an organic compound with the structure RC(=O)R', where R and R' can be a variety of carbon-containing substituents. Ketones and aldehydes are simple compounds that contain a carbonyl group (a carbon-oxygen double bond). They are considered \"simple\" because they do not have reactive groups like −OH or −Cl attached directly to the carbon atom in the carbonyl group, as in carboxylic acids containing −COOH.[http://www.chemguide.co.uk/organicprops/carbonyls/background.html an introduction to aldehydes and ketones]. Chemguide.co.uk. Retrieved on 2016-10-28. Many ketones are known and many are of great importance in industry and in biology. Examples include many sugars (ketoses) and the industrial solvent acetone, which is the smallest ketone.\n\nNomenclature and etymology\n\nThe word ketone is derived from Aketon, an old German word for acetone.The word \"ketone\" was coined in 1848 by the German chemist Leopold Gmelin.  See:  Leopold Gmelin, ed., Handbuch der organischen Chemie: Organische Chemie im Allgemeinen … (Handbook of organic chemistry:  Organic chemistry in general  … ), 4th ed., (Heidelberg, (Germany):  Karl Winter, 1848), volume 1, p. 40.  From page 40:  \"Zu diesen Syndesmiden scheinen auch diejenigen Verbindungen zu gehören, die als Acetone im Allegemeinen (Ketone?) bezeichnet werden.\"  (To these syndesmides*, those compounds also seem to belong, which are designated as acetones in general (ketones?).\") [*Note:  In 1844, the French chemist Auguste Laurent suggested a new nomenclature for organic compounds.  One of his new classes of compounds was \"syndesmides\", which were compounds formed by the combination of two or more simpler organic molecules (from the Greek σύνδεσμος (syndesmos, union) + -ide (indicating a group of related compounds)).  For example, acetone could be formed by the dry distillation of metal acetates, so acetone was the syndesmide of two acetate ions.  See:  Laurent, Auguste (1844) [https://books.google.com/books?id2wVQAAAAYAAJ&pg\nPA1089 \"Classification chimique,\"] Comptes rendus, 19 :  1089–1100 ; see especially p. 1097.\n\nAccording to the rules of IUPAC nomenclature, ketones are named by changing the suffix -ane of the parent alkane to -anone. The position of the carbonyl group is usually denoted by a number. For the most important ketones, however, traditional nonsystematic names are still generally used, for example acetone and benzophenone. These nonsystematic names are considered retained IUPAC names,List of retained IUPAC names [http://www.acdlabs.com/iupac/nomenclature/93/r93_701.htm retained IUPAC names  Link] although some introductory chemistry textbooks use systematic names such as \"2-propanone\" or \"propan-2-one\" for the simplest ketone (CH3−CO−CH3) instead of \"acetone\".\n\nThe common names of ketones are obtained by writing separately the names of the two alkyl groups attached to the carbonyl group, followed by \"ketone\" as a separate word. The names of the alkyl groups are written alphabetically. When the two alkyl groups are the same, the prefix di- is added before the name of alkyl group. The positions of other groups are indicated by Greek letters, the α-carbon being the atom adjacent to carbonyl group. If both alkyl groups in a ketone are the same then the ketone is said to be symmetrical, otherwise unsymmetrical.\n\nAlthough used infrequently, oxo is the IUPAC nomenclature for a ketone functional group. Other prefixes, however, are also used. For some common chemicals (mainly in biochemistry), keto or oxo refer to the ketone functional group. The term oxo is used widely through chemistry. For example, it also refers to an oxygen atom bonded to a transition metal (a metal oxo).\n\nStructure and properties\n\nThe ketone carbon is often described as \"sp2 hybridized\", a description that includes both their electronic and molecular structure. Ketones are trigonal planar around the ketonic carbon, with C−C−O and C−C−C bond angles of approximately 120°. Ketones differ from aldehydes in that the carbonyl group (CO) is bonded to two carbons within a carbon skeleton. In aldehydes, the carbonyl is bonded to one carbon and one hydrogen and are located at the ends of carbon chains. Ketones are also distinct from other carbonyl-containing functional groups, such as carboxylic acids, esters and amides.\n\nThe carbonyl group is polar because the electronegativity of the oxygen is greater than that for carbon. Thus, ketones are nucleophilic at oxygen and electrophilic at carbon. Because the carbonyl group interacts with water by hydrogen bonding, ketones are typically more soluble in water than the related methylene compounds. Ketones are hydrogen-bond acceptors. Ketones are not usually hydrogen-bond donors and cannot hydrogen-bond to themselves. Because of their inability to serve both as hydrogen-bond donors and acceptors, ketones tend not to \"self-associate\" and are more volatile than alcohols and carboxylic acids of comparable molecular weights. These factors relate to the pervasiveness of ketones in perfumery and as solvents.\n\nClasses of ketones\n\nKetones are classified on the basis of their substituents. One broad classification subdivides ketones into symmetrical and asymmetrical derivatives, depending on the equivalency of the two organic substituents attached to the carbonyl center. Acetone and benzophenone (C6H5C(O)C6H5) are symmetrical ketones. Acetophenone (C6H5C(O)CH3) is an asymmetrical ketone. In the area of stereochemistry, asymmetrical ketones are known for being prochiral.\n\nDiketones\n\nMany kinds of diketones are known, some with unusual properties. The simplest is diacetyl (CH3C(O)C(O)CH3), once used as butter-flavoring in popcorn. Acetylacetone (pentane-2,4-dione) is virtually a misnomer (inappropriate name) because this species exists mainly as the monoenol CH3C(O)CH=C(OH)CH3. Its enolate is a common ligand in coordination chemistry.\n\nUnsaturated ketones\n\nKetones containing alkene and alkyne units are often called unsaturated ketones. The most widely used member of this class of compounds is methyl vinyl ketone, CH3C(O)CH=CH2, which is useful in the Robinson annulation reaction. Lest there be confusion, a ketone itself is a site of unsaturation; that is, it can be hydrogenated.\n\nCyclic ketones\n\nMany ketones are cyclic. The simplest class have the formula (CH2)nCO, where n varies from 2 for cyclopropanone to the teens. Larger derivatives exist. Cyclohexanone, a symmetrical cyclic ketone, is an important intermediate in the production of nylon. Isophorone, derived from acetone, is an unsaturated, asymmetrical ketone that is the precursor to other polymers. Muscone, 3-methylpentadecanone, is an animal pheromone. Another cyclic ketone is cyclobutanone, having the formula C4H6O.\n\nKeto-enol tautomerization\n\nKetones that have at least one alpha-hydrogen, undergo keto-enol tautomerization; the tautomer is an enol. Tautomerization is catalyzed by both acids and bases. Usually, the keto form is more stable than the enol. This equilibrium allows ketones to be prepared via the hydration of alkynes.\n\nAcidity of ketones\n\nKetones are far more acidic (pKa ≈ 20) than a regular alkane (pKa ≈ 50). This difference reflects resonance stabilization of the enolate ion that is formed upon deprotonation. The relative acidity of the α-hydrogen is important in the enolization reactions of ketones and other carbonyl compounds. The acidity of the α-hydrogen also allows ketones and other carbonyl compounds to undergo nucleophilic reactions at that position, with either stoichiometric and catalytic base.\n\nCharacterization\n\nAn aldehyde differs from a ketone because of its hydrogen atom attached to its carbonyl group, making aldehydes easier to oxidize. Ketones don't have a hydrogen atom bonded to the carbonyl group, and are more resistant to oxidation. They are only oxidized by powerful oxidizing agents which have the ability to cleave carbon-carbon bonds.\n\nSpectroscopy\n\nKetones and aldehydes absorb strongly in the infra-red spectrum near 1700 cm−1. The exact position of the peak depends on the substituents.\n\nWhereas 1H NMR spectroscopy is generally not useful for establishing the presence of a ketone, 13C NMR spectra exhibit signals somewhat downfield of 200 ppm depending on structure. Such signals are typically weak due to the absence of nuclear Overhauser effects. Since aldehydes resonate at similar chemical shifts, multiple resonance experiments are employed to definitively distinguish aldehydes and ketones.\n\nQualitative organic tests\n\nKetones give positive results in Brady's test, the reaction with 2,4-dinitrophenylhydrazine to give the corresponding hydrazone. Ketones may be distinguished from aldehydes by giving a negative result with Tollens' reagent or with Fehling's solution. Methyl ketones give positive results for the iodoform test. Ketones also give positive results when treated with Metadinitrobenzene(m-dinitrobenzene) in presence of dilute Sodium Hydroxide to give violet coloration.\n\nSynthesis\n\nMany methods exist for the preparation of ketones in industrial scale and academic laboratories. Ketones are also produced in various ways by organisms, see the section on biochemistry below.\n\nIn industry, the most important method probably involves oxidation of hydrocarbons, often with air. For example, a billion kilograms of cyclohexanone are produced annually by aerobic oxidation of cyclohexane. Acetone is prepared by air-oxidation of cumene.\n\nFor specialized or small scale organic synthetic applications, ketones are often prepared by oxidation of secondary alcohols:\nR2CH(OH)  +  O   →   R2C=O  +  H2O\nTypical strong oxidants (source of \"O\" in the above reaction) include potassium permanganate or a Cr(VI) compound. Milder conditions make use of the Dess–Martin periodinane or the Moffatt–Swern methods.\n\nMany other methods have been developed, examples include:\n* By geminal halide hydrolysis.\n* By hydration of alkynes. Such processes occur via enols and require the presence of an acid and HgSO4. Subsequent enol–keto tautomerization gives a ketone. This reaction always produces a ketone, even with a terminal alkyne.\n*From Weinreb Amides using stoichiometric organometallic reagents.\n* Aromatic ketones can be prepared in the Friedel–Crafts acylation, the related Houben–Hoesch reaction, and the Fries rearrangement.\n* Ozonolysis, and related dihydroxylation/oxidative sequences, cleave alkenes to give aldehydes or ketones, depending on alkene substitution pattern.\n* In the Kornblum–DeLaMare rearrangement ketones are prepared from peroxides and base.\n* In the Ruzicka cyclization, cyclic ketones are prepared from dicarboxylic acids.\n* In the Nef reaction, ketones form by hydrolysis of salts of secondary nitro compounds.\n* In the Fukuyama coupling, ketones form from a thioester and an organozinc compound.\n* By the reaction of an acid chloride with organocadmium compounds or organocopper compounds.\n* The Dakin–West reaction provides an efficient method for preparation of certain methyl ketones from carboxylic acids.\n* Ketones can also be prepared by the reaction of Grignard reagents with nitriles, followed by hydrolysis.\n* By decarboxylation of carboxylic anhydride.\n* Ketones can be prepared from haloketones in reductive dehalogenation of halo ketones.\n* In ketonic decarboxylation symmetrical ketones are prepared from carboxylic acids.\n* Oxidation of amines with iron(III) chloride.\n* Hydrolysis of unsaturated secondary amides, β-Keto acid esters, or β-diketones.\n* Acid-catalysed rearrangement of 1,2-diols.\n\nReactions\n\nKetones engage in many organic reactions. The most important reactions follow from the susceptibility of the carbonyl carbon toward nucleophilic addition and the tendency for the enolates to add to electrophiles.\nNucleophilic additions include in approximate order of their generality:\n* With water (hydration) gives geminal diols, which are usually not formed in appreciable (or observable) amounts\n* With an acetylide to give the α-hydroxyalkyne\n* With ammonia or a primary amine gives an imine\n* With secondary amine gives an enamine\n* With Grignard and organolithium reagents to give, after aqueous workup, a tertiary alcohol\n* With an alcohols or alkoxides to gives the hemiketal or its conjugate base. With a diol to the ketal. This reaction is employed to protect ketones.\n* With sodium amide resulting in C–C bond cleavage with formation of the amide RCONH2 and the alkane R'H, a reaction called the Haller–Bauer reaction.[https://web.archive.org/web/20070910060716/http://nagoyaren.homeip.net/chem/reactions/123.htm Haller–Bauer Reaction]. homeip.net\n* With strong oxidizing agents to give carboxylic acids.\n* Electrophilic addition, reaction with an electrophile gives a resonance stabilized cation\n* With phosphonium ylides in the Wittig reaction to give the alkenes\n* With thiols to give the thioacetal\n* With hydrazine or 1-disubstituted derivatives of hydrazine to give hydrazones.\n* With a metal hydride gives a metal alkoxide salt, hydrolysis of which gives the alcohol, an example of ketone reduction\n* With halogens to form an α-haloketone, a reaction that proceeds via an enol (see Haloform reaction)\n* With heavy water to give an α-deuterated ketone\n* Fragmentation in photochemical Norrish reaction\n* Reaction of 1,4-aminodiketones to oxazoles by dehydration in the Robinson–Gabriel synthesis\n* In the case of aryl–alkyl ketones, with sulfur and an amine give amides in the Willgerodt reaction\n* With hydroxylamine to produce oximes\n* With reducing agents to form secondary alcohols\n* With peroxy acids to form esters in the Baeyer–Villiger oxidation\n\nBiochemistry\n\nKetones are pervasive in nature. The formation of organic compounds in photosynthesis occurs via the ketone ribulose-1,5-bisphosphate. Many sugars are ketones, known collectively as ketoses. The best known ketose is fructose, which exists as a cyclic hemiketal, which masks the ketone functional group. Fatty acid synthesis proceeds via ketones. Acetoacetate is an intermediate in the Krebs cycle which releases energy from sugars and carbohydrates.Nelson, D. L.; Cox, M. M. (2000) Lehninger, Principles of Biochemistry. 3rd Ed. Worth Publishing: New York. .\n\nIn medicine, acetone, acetoacetate, and beta-hydroxybutyrate are collectively called ketone bodies, generated from carbohydrates, fatty acids, and amino acids in most vertebrates, including humans. Ketone bodies are elevated in the blood (ketosis) after fasting, including a night of sleep; in both blood and urine in starvation; in hypoglycemia, due to causes other than hyperinsulinism; in various inborn errors of metabolism, and intentionally induced via a ketogenic diet, and in ketoacidosis (usually due to diabetes mellitus). Although ketoacidosis is characteristic of decompensated or untreated type 1 diabetes, ketosis or even ketoacidosis can occur in type 2 diabetes in some circumstances as well.\n\nApplications\n\nKetones are produced on massive scales in industry as solvents, polymer precursors, and pharmaceuticals. In terms of scale, the most important ketones are acetone, methylethyl ketone, and cyclohexanone.Siegel, Hardo and Eggersdorfer, Manfred (2005) \"Ketones\" in Ullmann's Encyclopedia of Industrial Chemistry, Wiley-VCH, Weinheim.  They are also common in biochemistry, but less so than in organic chemistry in general. The combustion of hydrocarbons is an uncontrolled oxidation process that gives ketones as well as many other types of compounds.\n\nToxicity\n\nAlthough it is difficult to generalize on the toxicity of such a broad class of compounds, simple ketones are, in general, not highly toxic. This characteristic is one reason for their popularity as solvents. Exceptions to this rule are the unsaturated ketones such as methyl vinyl ketone with  of 7 mg/kg (oral). Ketone. http://en.wikipedia.org/?curid=16803."
  }
}
