{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14375",
  "eid" : "1423ffc0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778543036,
  "textBody" : "Hogmanay (;The Concise Scots Dictionary Cambers (1985)  ) is the Scots word for the last day of the year and is synonymous with the celebration of the New Year (Gregorian calendar) in the Scottish manner.  It is normally followed by further celebration on the morning of New Year's Day (1 January) or, in some cases, 2 January—a Scottish bank holiday.\n\nThe origins of Hogmanay are unclear, but it may be derived from Norse and Gaelic observances. Customs vary throughout Scotland, and usually include gift-giving and visiting the homes of friends and neighbours, with special attention given to the first-foot, the first guest of the new year.\n\nEtymology\n\nThe etymology of the word is obscure. The earliest proposed etymology comes from the 1693 Scotch Presbyterian Eloquence, which held that the term was a corruption of the Greek ' (), or \"holy month\". The three main modern theories derive it from a French, Norse or Gaelic root.\n\nThe word is first recorded in a Latin entry in 1443 annals as hagnonayse.\"hogmanay, n.\". OED Online. December 2014. Oxford University Press. (accessed 22 December 2014). The first appearance in English came in 1604 in the records of Elgin, as hagmonay.\"delatit to haue been singand hagmonayis on Satirday\" Subsequent 17th-century spellings include Hagmena (1677), Hogmynae night (1681), and Hagmane (1693) in an entry of the Scotch Presbyterian Eloquence.\n\nAlthough \"Hogmanay\" is currently the predominant spelling and pronunciation, a number of variant spellings and pronunciations have been recorded, including:Robinson, Mairi (ed) The Concise Scots Dictionary (1985) The Scottish National Dictionary Association \n\n*Hoghmanay\n*Hagman(a)e\n*Hagmonay\n*Hagmonick\n*Hanginay (Roxburghshire)\n*Hangmanay\n*Hogernoany (Shetland)\n*Hogminay/Hogmenay/Hogmynae\n*Hoguemennay\n*Huggeranohni (Shetland)\n*Hu(i)gmanay\n\nwith the first syllable variously being,,, or.\n\nPossible French etymologies\n\nIt may have been introduced to Middle Scots via French. The most commonly cited explanation is a derivation from the northern French dialectal word hoguinané, or variants such as hoginane, hoginono and hoguinettes, those being derived from 16th century Middle French aguillanneuf meaning either a gift given at New Year, a children's cry for such a gift, or New Year's Eve itself.Campbell, John Gregorson (1900, 1902, 2005) The Gaelic Otherworld. Edited by Ronald Black. Edinburgh, Birlinn Ltd.  p. 575: \"'Hogmanay' is French in origin. In northern French dialect it was hoguinané, going back to Middle French aguillaneuf, meaning a gift given on New Year's eve or the word cried out in soliciting it.\" Compare also the apparent Spanish cognate aguinaldo/aguilando, with a suggested Latin derivation of ' \"in this year.\"\n\nThis explanation is supported by a children's tradition, observed up to the 1960s in some parts of Scotland at least, of visiting houses in their locality on New Year's Eve and requesting and receiving small treats such as sweets or fruit. The second element would appear to be ' (the New Year), with some sources suggesting a druidical origin of the practice overall.Encyclopædia Britannica Vol I (1823) 6th Edition Compare those to Norman hoguinané and the obsolete customs in Jersey of crying ma hodgîngnole, and in Guernsey of asking for an oguinane, for a New Year gift (see also La Guiannee). In Québec, \"la guignolée\" was a door-to-door collection for the poor.Roy, Pierre-Georges [http://www.uquebec.ca/~uss1083/ssvdp/Texte%20de%20Pierre%20Georges%20ROY.pdf Les petites choses de notre histoire] Garneau (1944)\n\nOther suggestions include au gui mener (\"lead to the mistletoe\"),Chambers, R. Popular Rhymes of Scotland Chambers (1841) 3rd Edition à  mener ('bring to the beggars'), au gui l'an neuf ('at the mistletoe the new year', or (l')homme est né ('(the) man is born').[http://www.scotland.org/whats-on/hogmanay/ \"Hogmanay\", Scotland.org]. Retrieved 14 May 2009.\n\nPossible Goidelic etymologies\n\nThe word may have come from the Goidelic languages. Frazer and Kelley report a Manx new-year song that begins with the line To-night is New Year's Night, Hogunnaa but did not record the full text in Manx.Frazer, Sir James George The Golden Bough 1922Kelley, Ruth The Book of Hallowe'en (1919) Kelley himself uses the spelling Og-u-naa... Tro-la-laY Kelley, Yuan Fockleyr Gailckagh as Baarlagh (1866) The Manx Society whereas other sources parse this as hog-un-naa and give the modern Manx form as Hob dy naa.Folk-lore – A Quarterly Review of Myth, Tradition, Institution and Custom Vol II (1891) The Folk-lore Society Manx dictionaries though give Hop-tu-Naa, generally glossing it as \"Hallowe'en\",Broderick, G. A Handbook of Late Spoken Manx Niemeyer (1984) Fargher, Douglas Fockleyr Baarle-Gaelg (1979) Shearwater Press  same as many of the more Manx-specific folklore collections.Moore, A.W. Manx Ballads & Music (1896) G R Johnson\n\nIn this context it is also recorded that in the south of Scotland (for example Roxburghshire), there is no , the word thus being Hunganay, which could suggest the  is intrusive.\n\nAnother theory occasionally encountered is a derivation from the phrase thog mi an èigh/eugh (, \"I raised the cry\"), which resembles Hogmanay in pronunciation and was part of the rhymes traditionally recited at New Year but it is unclear if this is simply a case of folk etymology.\n\nOverall, Gaelic consistently refers to the New Year's Eve as Oidhche na Bliadhn(a) Ùir(e) (\"the Night of the New Year\") and Oidhche Challainn (\"the Night of the Calends\").MacBain, A. Etymological Dictionary of the Gaelic Language (1896)Dwelly, E. The Illustrated Gaelic-English Dictionary (1941)Mark, Colin The Gaelic-English Dictionary (2004) Routledge \n\nPossible Norse etymologies\n\nSome authors reject both the French and Goidelic theories, and instead suggest that the ultimate source both for the Norman French, Scots, and Goidelic variants of this word have a common Norse root.Harrison, W. Mona Miscellany (1869) Manx Society It is suggested that the full forms\n* \"Hoginanaye-Trollalay/Hogman aye, Troll a lay\" (with a Manx cognate Hop-tu-Naa, Trolla-laa)\n* \"Hogmanay, Trollolay, give us of your white bread and none of your gray\"Chambers, R. Popular Rhymes of Scotland (1841) W&R Chambers p. 165\ninvoke the hill-men (Icelandic haugmenn, cf Anglo-Saxon hoghmen) or \"elves\" and banishes the trolls into the sea (Norse á læ \"into the sea\").Repp, Thorl On the Scottish Formula of Congratulation on New Year's Eve – \"Hogmanay, Trollalay\" (1831) Transactions of the Society of Antiquaries of Scotland Vol IV Repp furthermore makes a link between \"Trollalay/Trolla-laa\" and the rhyme recorded in Percy's Relics: \"Trolle on away, trolle on awaye. Synge heave and howe rombelowe trolle on away\", which he reads as a straightforward invocation of troll-banning.Percy, Thomas Percy's Reliques (1765)\n\nOrigins\n\nThe roots of Hogmanay perhaps reach back to the celebration of the winter solstice among the Norse,[http://www.historic-uk.com/HistoryUK/HistoryofScotland/The-History-of-Hogmanay/ Johnson, Ben. \"The History of Hogmanay\", Historic UK] as well as incorporating customs from the Gaelic celebration of Samhain. The Vikings celebrated Yule, which later contributed to the Twelve Days of Christmas, or the \"Daft Days\" as they were sometimes called in Scotland. Christmas was not celebrated as a festival and Hogmanay was the more traditional celebration in Scotland. This may have been a result of the Protestant Reformation after which Christmas was seen as \"too Papist\".[http://news.nationalgeographic.com/news/2002/12/1230_021231_hogmanay.html Bogle, Lara Suziedelis. \"Scots Mark New Year With Fiery Ancient Rites\", National Geographic News, December 31, 2002]\n\nCustoms\n\nThere are many customs, both national and local, associated with Hogmanay.  The most widespread national custom is the practice of first-footing, which starts immediately after midnight. This involves being the first person to cross the threshold of a friend or neighbour and often involves the giving of symbolic gifts such as salt (less common today), coal, shortbread, whisky, and black bun (a rich fruit cake), intended to bring different kinds of luck to the householder. Food and drink (as the gifts) are then given to the guests. This may go on throughout the early hours of the morning and well into the next day (although modern days see people visiting houses well into the middle of January). The first-foot is supposed to set the luck for the rest of the year. Traditionally, tall, dark-haired men are preferred as the first-foot.\n\nLocal customs\n\nAreas of Scotland often developed their own Hogmanay rituals.\n\nAn example of a local Hogmanay custom is the fireball swinging that takes place in Stonehaven, Aberdeenshire, in northeast Scotland. This involves local people making up \"balls\" of chicken wire filled with old newspaper, sticks, rags, and other dry flammable material up to a diameter of 2 ft, each attached to about 3 ft of wire, chain or nonflammable rope.  As the Old Town House bell sounds to mark the new year, the balls are set alight and the swingers set off up the High Street from the Mercat Cross to the Cannon and back, swinging the burning balls around their heads as they go.\n\nAt the end of the ceremony, any fireballs that are still burning are cast into the harbour. Many people enjoy this display, and large crowds flock to see it,[http://www.stonehavenfireballs.co.uk/ Stonehaven Fireball Association] photos and videos of festivities. Retrieved 31 December 2007. with 12,000 attending the 2007/2008 event.[http://www.thisisaberdeen.co.uk/displayNode.jsp?nodeId148760&command\ndisplayContent&sourceNode148586&contentPK\n19422957&folderPk85349&pNodeId\n148317 Aberdeen Press and Journal] 2 January 2008. \"around 12,000 turned out in Stonehaven to watch the town's traditional fireball ceremony.\" Retrieved 3 January 2008. In recent years, additional attractions have been added to entertain the crowds as they wait for midnight, such as fire poi, a pipe band, street drumming and a firework display after the last fireball is cast into the sea. The festivities are now streamed live over the Internet. \nAnother example of a pagan fire festival is the burning the clavie in the town of Burghead in Moray.\n\nIn the east coast fishing communities and Dundee, first-footers once carried a decorated herring. And in Falkland in Fife, local men marched in torchlight procession to the top of the Lomond Hills as midnight approached. Bakers in St Andrews baked special cakes for their Hogmanay celebration (known as \"Cake Day\") and distributed them to local children.\n\nIn Glasgow and the central areas of Scotland, the tradition is to hold Hogmanay parties that involve singing, dancing, eating of steak pie or stew, storytelling and drink. These usually extend into the daylight hours of 1 January.\n\nInstitutions also had their own traditions. For example, amongst the Scottish regiments, officers waited on the men at special dinners while at the bells, the Old Year is piped out of barrack gates. The sentry then challenges the new escort outside the gates: \"Who goes there?\" The answer is \"The New Year, all's well.\"'[http://www.visitscotland.com/library/hogmanaytraditions Hogmanay Traditions] ' at [http://www.visitscotland.com Scotland's Tourism Board]. Retrieved 21 December 2007.\n\nAn old custom in the Highlands – which has survived to a small extent and seen some degree of revival – is to celebrate Hogmanay with the saining (Scots for 'protecting, blessing') of the household and livestock. Early on New Year's morning, householders drink and then sprinkle 'magic water' from 'a dead and living ford' around the house (a 'dead and living ford' refers to a river ford that is routinely crossed by both the living and the dead). After the sprinkling of the water in every room, on the beds and all the inhabitants, the house is sealed up tight and branches of juniper are set on fire and carried throughout the house and byre. The juniper smoke is allowed to thoroughly fumigate the buildings until it causes sneezing and coughing among the inhabitants.  Then all the doors and windows are flung open to let in the cold, fresh air of the new year.  The woman of the house then administers 'a restorative' from the whisky bottle, and the household sits down to its New Year breakfast.\n\n\"Auld Lang Syne\"\n\nThe Hogmanay custom of singing \"Auld Lang Syne\" has become common in many countries. \"Auld Lang Syne\" is a Scots poem by Robert Burns, based on traditional and other earlier sources. It is now common to sing this in a circle of linked arms that are crossed over one another as the clock strikes midnight for New Year's Day, though it is only intended that participants link arms at the beginning of the final verse, co-ordinating with the lines of the song that contain the lyrics to do so. Typically, it is only in Scotland this practice is carried out correctly.\"[http://www.thisislancashire.co.uk/archive/2000/01/05/6098245.Queen_stays_at_arm_s_length/ Queen stays at arm's length]\". Lancashire Evening Telegraph, 5 January 2000.\n\nAuld Lang Syne is now sung regularly at \"The Last Night of the Proms\" in London by the full audience with their arms crossed over one another.\n\nIn the media\n\nBetween 1957 and 1968, a New Year's Eve television programme, The White Heather Club, was presented to herald in the Hogmanay celebrations.\nThe show was presented by Andy Stewart who always began by singing \"Come in, come in, it's nice to see you....\" The show always ended with Andy Stewart and the cast singing, \"Haste ye Back\":\n\nThe performers were Jimmy Shand and band, Ian Powrie and his band, Scottish country dancers: Dixie Ingram and the Dixie Ingram Dancers, Joe Gordon Folk Four, James Urquhart, Ann & Laura Brand, Moira Anderson & Kenneth McKellar. All the male dancers and Andy Stewart wore kilts, and the female dancers wore long white dresses with tartan sashes.\nFollowing the demise of the White Heather Club, Andy Stewart continued to feature regularly in TV Hogmanay shows until his retirement. His last appearance was in 1992.\n\nIn the 1980s comedian Andy Cameron presented the Hogmanay Show (on STV in 1983 and 1984 and from 1985 to 1990 on BBC Scotland) while Peter Morrison presented the show A Highland Hogmanay on STV/Grampian, axed in 1993.\n\nFor many years, a staple of New Year's Eve television programming in Scotland was the comedy sketch show Scotch and Wry, featuring the comedian Rikki Fulton, which invariably included a hilarious monologue from him as the preternaturally gloomy Reverend I.M. Jolly.\n\nSince 1993, the programmes that have been mainstays on BBC Scotland on Hogmanay have been Hogmanay Live and Jonathan Watson's football-themed sketch comedy show, Only an Excuse?.\n\nPresbyterian influence\n\nThe 1693 Scotch Presbyterian Eloquence contained one of the first mentions of the holiday in official church records. Hogmanay was treated with general disapproval. Still, in Scotland Hogmanay and New Year's Day are as important as Christmas Eve and Christmas Day.\n\nAlthough Christmas Day held its normal religious nature in Scotland amongst its Catholic and Episcopalian communities, the Presbyterian national church, the Church of Scotland, discouraged the celebration of Christmas for nearly 400 years; it only became a public holiday in Scotland in 1958. Conversely, 1 and 2 January are public holidays and Hogmanay still is associated with as much celebration as Christmas in Scotland. Most Scots still celebrate New Year's Day with a special dinner, usually steak pie.'[http://www.aboutaberdeen.com/hogmanaycustoms.php Scottish Hogmanay Customs and Traditions at New Year]' at [http://www.aboutaberdeen.com About Aberdeen]. Retrieved 21 December 2007.\n\nMajor celebrations\n\nAs in much of the world, the largest Scottish cities – Glasgow, Edinburgh and Aberdeen – hold all-night celebrations, as do Stirling and Inverness.  The Edinburgh Hogmanay celebrations are among the largest in the world. Celebrations in Edinburgh in 1996–97 were recognised by the Guinness Book of Records as the world's largest New Years party, with approximately 400,000 people in attendance. Numbers have since been restricted due to safety concerns.\n\nIn 2003-4 most of the organised events were cancelled at short notice due to very high winds. The Stonehaven Fireballs went ahead as planned, however, with some 6000 people braving the stormy weather to watch 42 fireball swingers process along the High Street.'[http://stonehavenfireballs.co.uk/history History of the Stonehaven Fireballs Ceremony]', 3 January 2008, at Stonehaven Fireballs Association. Retrieved 3 January 2008. Similarly, the 2006–07 celebrations in Edinburgh, Glasgow and Stirling were all cancelled on the day, again due to high winds and heavy rain.'[http://news.bbc.co.uk/1/hi/scotland/6221557.stm Weather spoils Hogmanay parties]', 1 January 2007, at BBC News, Scotland. Retrieved 21 December 2007. The Aberdeen celebration, however, went ahead, and was opened by the pop music group, Wet Wet Wet.\n\nHandsel Day\n\nHistorically, presents were given in Scotland on the first Monday of the New Year. A roast dinner would be eaten to celebrate the festival. Handsel was a word for gift and hence \"Handsel Day\". \"A gift or present (expressive of good wishes)\". In modern Scotland this practice has died out.\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hogmanay" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14375" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hogmanay (;The Concise Scots Dictionary Cambers (1985)  ) is the Scots word for the last day of the year and is synonymous with the celebration of the New Year (Gregorian calendar) in the Scottish manner.  It is normally followed by further celebration on the morning of New Year's Day (1 January) or, in some cases, 2 January—a Scottish bank holiday.\n\nThe origins of Hogmanay are unclear, but it may be derived from Norse and Gaelic observances. Customs vary throughout Scotland, and usually include gift-giving and visiting the homes of friends and neighbours, with special attention given to the first-foot, the first guest of the new year.\n\nEtymology\n\nThe etymology of the word is obscure. The earliest proposed etymology comes from the 1693 Scotch Presbyterian Eloquence, which held that the term was a corruption of the Greek ' (), or \"holy month\". The three main modern theories derive it from a French, Norse or Gaelic root.\n\nThe word is first recorded in a Latin entry in 1443 annals as hagnonayse.\"hogmanay, n.\". OED Online. December 2014. Oxford University Press. (accessed 22 December 2014). The first appearance in English came in 1604 in the records of Elgin, as hagmonay.\"delatit to haue been singand hagmonayis on Satirday\" Subsequent 17th-century spellings include Hagmena (1677), Hogmynae night (1681), and Hagmane (1693) in an entry of the Scotch Presbyterian Eloquence.\n\nAlthough \"Hogmanay\" is currently the predominant spelling and pronunciation, a number of variant spellings and pronunciations have been recorded, including:Robinson, Mairi (ed) The Concise Scots Dictionary (1985) The Scottish National Dictionary Association \n\n*Hoghmanay\n*Hagman(a)e\n*Hagmonay\n*Hagmonick\n*Hanginay (Roxburghshire)\n*Hangmanay\n*Hogernoany (Shetland)\n*Hogminay/Hogmenay/Hogmynae\n*Hoguemennay\n*Huggeranohni (Shetland)\n*Hu(i)gmanay\n\nwith the first syllable variously being,,, or.\n\nPossible French etymologies\n\nIt may have been introduced to Middle Scots via French. The most commonly cited explanation is a derivation from the northern French dialectal word hoguinané, or variants such as hoginane, hoginono and hoguinettes, those being derived from 16th century Middle French aguillanneuf meaning either a gift given at New Year, a children's cry for such a gift, or New Year's Eve itself.Campbell, John Gregorson (1900, 1902, 2005) The Gaelic Otherworld. Edited by Ronald Black. Edinburgh, Birlinn Ltd.  p. 575: \"'Hogmanay' is French in origin. In northern French dialect it was hoguinané, going back to Middle French aguillaneuf, meaning a gift given on New Year's eve or the word cried out in soliciting it.\" Compare also the apparent Spanish cognate aguinaldo/aguilando, with a suggested Latin derivation of ' \"in this year.\"\n\nThis explanation is supported by a children's tradition, observed up to the 1960s in some parts of Scotland at least, of visiting houses in their locality on New Year's Eve and requesting and receiving small treats such as sweets or fruit. The second element would appear to be ' (the New Year), with some sources suggesting a druidical origin of the practice overall.Encyclopædia Britannica Vol I (1823) 6th Edition Compare those to Norman hoguinané and the obsolete customs in Jersey of crying ma hodgîngnole, and in Guernsey of asking for an oguinane, for a New Year gift (see also La Guiannee). In Québec, \"la guignolée\" was a door-to-door collection for the poor.Roy, Pierre-Georges [http://www.uquebec.ca/~uss1083/ssvdp/Texte%20de%20Pierre%20Georges%20ROY.pdf Les petites choses de notre histoire] Garneau (1944)\n\nOther suggestions include au gui mener (\"lead to the mistletoe\"),Chambers, R. Popular Rhymes of Scotland Chambers (1841) 3rd Edition à  mener ('bring to the beggars'), au gui l'an neuf ('at the mistletoe the new year', or (l')homme est né ('(the) man is born').[http://www.scotland.org/whats-on/hogmanay/ \"Hogmanay\", Scotland.org]. Retrieved 14 May 2009.\n\nPossible Goidelic etymologies\n\nThe word may have come from the Goidelic languages. Frazer and Kelley report a Manx new-year song that begins with the line To-night is New Year's Night, Hogunnaa but did not record the full text in Manx.Frazer, Sir James George The Golden Bough 1922Kelley, Ruth The Book of Hallowe'en (1919) Kelley himself uses the spelling Og-u-naa... Tro-la-laY Kelley, Yuan Fockleyr Gailckagh as Baarlagh (1866) The Manx Society whereas other sources parse this as hog-un-naa and give the modern Manx form as Hob dy naa.Folk-lore – A Quarterly Review of Myth, Tradition, Institution and Custom Vol II (1891) The Folk-lore Society Manx dictionaries though give Hop-tu-Naa, generally glossing it as \"Hallowe'en\",Broderick, G. A Handbook of Late Spoken Manx Niemeyer (1984) Fargher, Douglas Fockleyr Baarle-Gaelg (1979) Shearwater Press  same as many of the more Manx-specific folklore collections.Moore, A.W. Manx Ballads & Music (1896) G R Johnson\n\nIn this context it is also recorded that in the south of Scotland (for example Roxburghshire), there is no , the word thus being Hunganay, which could suggest the  is intrusive.\n\nAnother theory occasionally encountered is a derivation from the phrase thog mi an èigh/eugh (, \"I raised the cry\"), which resembles Hogmanay in pronunciation and was part of the rhymes traditionally recited at New Year but it is unclear if this is simply a case of folk etymology.\n\nOverall, Gaelic consistently refers to the New Year's Eve as Oidhche na Bliadhn(a) Ùir(e) (\"the Night of the New Year\") and Oidhche Challainn (\"the Night of the Calends\").MacBain, A. Etymological Dictionary of the Gaelic Language (1896)Dwelly, E. The Illustrated Gaelic-English Dictionary (1941)Mark, Colin The Gaelic-English Dictionary (2004) Routledge \n\nPossible Norse etymologies\n\nSome authors reject both the French and Goidelic theories, and instead suggest that the ultimate source both for the Norman French, Scots, and Goidelic variants of this word have a common Norse root.Harrison, W. Mona Miscellany (1869) Manx Society It is suggested that the full forms\n* \"Hoginanaye-Trollalay/Hogman aye, Troll a lay\" (with a Manx cognate Hop-tu-Naa, Trolla-laa)\n* \"Hogmanay, Trollolay, give us of your white bread and none of your gray\"Chambers, R. Popular Rhymes of Scotland (1841) W&R Chambers p. 165\ninvoke the hill-men (Icelandic haugmenn, cf Anglo-Saxon hoghmen) or \"elves\" and banishes the trolls into the sea (Norse á læ \"into the sea\").Repp, Thorl On the Scottish Formula of Congratulation on New Year's Eve – \"Hogmanay, Trollalay\" (1831) Transactions of the Society of Antiquaries of Scotland Vol IV Repp furthermore makes a link between \"Trollalay/Trolla-laa\" and the rhyme recorded in Percy's Relics: \"Trolle on away, trolle on awaye. Synge heave and howe rombelowe trolle on away\", which he reads as a straightforward invocation of troll-banning.Percy, Thomas Percy's Reliques (1765)\n\nOrigins\n\nThe roots of Hogmanay perhaps reach back to the celebration of the winter solstice among the Norse,[http://www.historic-uk.com/HistoryUK/HistoryofScotland/The-History-of-Hogmanay/ Johnson, Ben. \"The History of Hogmanay\", Historic UK] as well as incorporating customs from the Gaelic celebration of Samhain. The Vikings celebrated Yule, which later contributed to the Twelve Days of Christmas, or the \"Daft Days\" as they were sometimes called in Scotland. Christmas was not celebrated as a festival and Hogmanay was the more traditional celebration in Scotland. This may have been a result of the Protestant Reformation after which Christmas was seen as \"too Papist\".[http://news.nationalgeographic.com/news/2002/12/1230_021231_hogmanay.html Bogle, Lara Suziedelis. \"Scots Mark New Year With Fiery Ancient Rites\", National Geographic News, December 31, 2002]\n\nCustoms\n\nThere are many customs, both national and local, associated with Hogmanay.  The most widespread national custom is the practice of first-footing, which starts immediately after midnight. This involves being the first person to cross the threshold of a friend or neighbour and often involves the giving of symbolic gifts such as salt (less common today), coal, shortbread, whisky, and black bun (a rich fruit cake), intended to bring different kinds of luck to the householder. Food and drink (as the gifts) are then given to the guests. This may go on throughout the early hours of the morning and well into the next day (although modern days see people visiting houses well into the middle of January). The first-foot is supposed to set the luck for the rest of the year. Traditionally, tall, dark-haired men are preferred as the first-foot.\n\nLocal customs\n\nAreas of Scotland often developed their own Hogmanay rituals.\n\nAn example of a local Hogmanay custom is the fireball swinging that takes place in Stonehaven, Aberdeenshire, in northeast Scotland. This involves local people making up \"balls\" of chicken wire filled with old newspaper, sticks, rags, and other dry flammable material up to a diameter of 2 ft, each attached to about 3 ft of wire, chain or nonflammable rope.  As the Old Town House bell sounds to mark the new year, the balls are set alight and the swingers set off up the High Street from the Mercat Cross to the Cannon and back, swinging the burning balls around their heads as they go.\n\nAt the end of the ceremony, any fireballs that are still burning are cast into the harbour. Many people enjoy this display, and large crowds flock to see it,[http://www.stonehavenfireballs.co.uk/ Stonehaven Fireball Association] photos and videos of festivities. Retrieved 31 December 2007. with 12,000 attending the 2007/2008 event.[http://www.thisisaberdeen.co.uk/displayNode.jsp?nodeId148760&command\ndisplayContent&sourceNode148586&contentPK\n19422957&folderPk85349&pNodeId\n148317 Aberdeen Press and Journal] 2 January 2008. \"around 12,000 turned out in Stonehaven to watch the town's traditional fireball ceremony.\" Retrieved 3 January 2008. In recent years, additional attractions have been added to entertain the crowds as they wait for midnight, such as fire poi, a pipe band, street drumming and a firework display after the last fireball is cast into the sea. The festivities are now streamed live over the Internet. \nAnother example of a pagan fire festival is the burning the clavie in the town of Burghead in Moray.\n\nIn the east coast fishing communities and Dundee, first-footers once carried a decorated herring. And in Falkland in Fife, local men marched in torchlight procession to the top of the Lomond Hills as midnight approached. Bakers in St Andrews baked special cakes for their Hogmanay celebration (known as \"Cake Day\") and distributed them to local children.\n\nIn Glasgow and the central areas of Scotland, the tradition is to hold Hogmanay parties that involve singing, dancing, eating of steak pie or stew, storytelling and drink. These usually extend into the daylight hours of 1 January.\n\nInstitutions also had their own traditions. For example, amongst the Scottish regiments, officers waited on the men at special dinners while at the bells, the Old Year is piped out of barrack gates. The sentry then challenges the new escort outside the gates: \"Who goes there?\" The answer is \"The New Year, all's well.\"'[http://www.visitscotland.com/library/hogmanaytraditions Hogmanay Traditions] ' at [http://www.visitscotland.com Scotland's Tourism Board]. Retrieved 21 December 2007.\n\nAn old custom in the Highlands – which has survived to a small extent and seen some degree of revival – is to celebrate Hogmanay with the saining (Scots for 'protecting, blessing') of the household and livestock. Early on New Year's morning, householders drink and then sprinkle 'magic water' from 'a dead and living ford' around the house (a 'dead and living ford' refers to a river ford that is routinely crossed by both the living and the dead). After the sprinkling of the water in every room, on the beds and all the inhabitants, the house is sealed up tight and branches of juniper are set on fire and carried throughout the house and byre. The juniper smoke is allowed to thoroughly fumigate the buildings until it causes sneezing and coughing among the inhabitants.  Then all the doors and windows are flung open to let in the cold, fresh air of the new year.  The woman of the house then administers 'a restorative' from the whisky bottle, and the household sits down to its New Year breakfast.\n\n\"Auld Lang Syne\"\n\nThe Hogmanay custom of singing \"Auld Lang Syne\" has become common in many countries. \"Auld Lang Syne\" is a Scots poem by Robert Burns, based on traditional and other earlier sources. It is now common to sing this in a circle of linked arms that are crossed over one another as the clock strikes midnight for New Year's Day, though it is only intended that participants link arms at the beginning of the final verse, co-ordinating with the lines of the song that contain the lyrics to do so. Typically, it is only in Scotland this practice is carried out correctly.\"[http://www.thisislancashire.co.uk/archive/2000/01/05/6098245.Queen_stays_at_arm_s_length/ Queen stays at arm's length]\". Lancashire Evening Telegraph, 5 January 2000.\n\nAuld Lang Syne is now sung regularly at \"The Last Night of the Proms\" in London by the full audience with their arms crossed over one another.\n\nIn the media\n\nBetween 1957 and 1968, a New Year's Eve television programme, The White Heather Club, was presented to herald in the Hogmanay celebrations.\nThe show was presented by Andy Stewart who always began by singing \"Come in, come in, it's nice to see you....\" The show always ended with Andy Stewart and the cast singing, \"Haste ye Back\":\n\nThe performers were Jimmy Shand and band, Ian Powrie and his band, Scottish country dancers: Dixie Ingram and the Dixie Ingram Dancers, Joe Gordon Folk Four, James Urquhart, Ann & Laura Brand, Moira Anderson & Kenneth McKellar. All the male dancers and Andy Stewart wore kilts, and the female dancers wore long white dresses with tartan sashes.\nFollowing the demise of the White Heather Club, Andy Stewart continued to feature regularly in TV Hogmanay shows until his retirement. His last appearance was in 1992.\n\nIn the 1980s comedian Andy Cameron presented the Hogmanay Show (on STV in 1983 and 1984 and from 1985 to 1990 on BBC Scotland) while Peter Morrison presented the show A Highland Hogmanay on STV/Grampian, axed in 1993.\n\nFor many years, a staple of New Year's Eve television programming in Scotland was the comedy sketch show Scotch and Wry, featuring the comedian Rikki Fulton, which invariably included a hilarious monologue from him as the preternaturally gloomy Reverend I.M. Jolly.\n\nSince 1993, the programmes that have been mainstays on BBC Scotland on Hogmanay have been Hogmanay Live and Jonathan Watson's football-themed sketch comedy show, Only an Excuse?.\n\nPresbyterian influence\n\nThe 1693 Scotch Presbyterian Eloquence contained one of the first mentions of the holiday in official church records. Hogmanay was treated with general disapproval. Still, in Scotland Hogmanay and New Year's Day are as important as Christmas Eve and Christmas Day.\n\nAlthough Christmas Day held its normal religious nature in Scotland amongst its Catholic and Episcopalian communities, the Presbyterian national church, the Church of Scotland, discouraged the celebration of Christmas for nearly 400 years; it only became a public holiday in Scotland in 1958. Conversely, 1 and 2 January are public holidays and Hogmanay still is associated with as much celebration as Christmas in Scotland. Most Scots still celebrate New Year's Day with a special dinner, usually steak pie.'[http://www.aboutaberdeen.com/hogmanaycustoms.php Scottish Hogmanay Customs and Traditions at New Year]' at [http://www.aboutaberdeen.com About Aberdeen]. Retrieved 21 December 2007.\n\nMajor celebrations\n\nAs in much of the world, the largest Scottish cities – Glasgow, Edinburgh and Aberdeen – hold all-night celebrations, as do Stirling and Inverness.  The Edinburgh Hogmanay celebrations are among the largest in the world. Celebrations in Edinburgh in 1996–97 were recognised by the Guinness Book of Records as the world's largest New Years party, with approximately 400,000 people in attendance. Numbers have since been restricted due to safety concerns.\n\nIn 2003-4 most of the organised events were cancelled at short notice due to very high winds. The Stonehaven Fireballs went ahead as planned, however, with some 6000 people braving the stormy weather to watch 42 fireball swingers process along the High Street.'[http://stonehavenfireballs.co.uk/history History of the Stonehaven Fireballs Ceremony]', 3 January 2008, at Stonehaven Fireballs Association. Retrieved 3 January 2008. Similarly, the 2006–07 celebrations in Edinburgh, Glasgow and Stirling were all cancelled on the day, again due to high winds and heavy rain.'[http://news.bbc.co.uk/1/hi/scotland/6221557.stm Weather spoils Hogmanay parties]', 1 January 2007, at BBC News, Scotland. Retrieved 21 December 2007. The Aberdeen celebration, however, went ahead, and was opened by the pop music group, Wet Wet Wet.\n\nHandsel Day\n\nHistorically, presents were given in Scotland on the first Monday of the New Year. A roast dinner would be eaten to celebrate the festival. Handsel was a word for gift and hence \"Handsel Day\". \"A gift or present (expressive of good wishes)\". In modern Scotland this practice has died out.\n\nNotes. Hogmanay. http://en.wikipedia.org/?curid=14375."
  }
}
