{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12285",
  "eid" : "01726290-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778511673,
  "textBody" : "Le Théâtre du Grand-Guignol (: \"The Theatre of the Great Puppet\")—known as the Grand Guignol—was a theatre in the Pigalle area of Paris (at 20 bis, ). From its opening in 1897 until its closing in 1962, it specialised in naturalistic horror shows. Its name is often used as a general term for graphic, amoral horror entertainment, a genre popular from Elizabethan and Jacobean theatre (for instance Shakespeare's Titus Andronicus, and Webster's The Duchess of Malfi and The White Devil), to today's splatter films.\n\nTheatre\n\nLe Théâtre du Grand-Guignol was founded in 1894 by Oscar Méténier, who planned it as a space for naturalist performance. With 293 seats, the venue was the smallest in Paris.\n\nA former chapel, the theatre's previous life was evident in the boxes—which looked like confessionals—and in the angels over the orchestra. Although the architecture created frustrating obstacles, the design that was initially a predicament ultimately became beneficial to the marketing of the theatre. The opaque furniture and gothic structures placed sporadically on the walls of the building exude a feeling of eeriness from the moment of entrance. People came to this theatre for an experience, not only to see a show. The audience at \"Le Théâtre du Grand-Guignol\" endured the terror of the shows because they wanted to be filled with strong “feelings” of something. Many attended the shows to get a feeling of arousal. Underneath the balcony were boxes (originally built for nuns to watch church services) that were available for theatre-goers to rent during performances because they would get so aroused by the action happening on stage. It has been said that audience members would get so boisterous in the boxes, that actors would sometimes break character and yell something such as “Keep it down in there!” Conversely, there were audience members who could not physically handle the brutality of the actions taking place on stage. Frequently, the “special effects” would be too realistic and often an audience member would faint or vomit during performances.Hand, Richard J., and Michael Wilson. Grand-Guignol The French Theatre of Horror. Exeter: University of Exeter Press, 2002. Print.\n\nThe theatre owed its name to Guignol, a traditional Lyonnaise puppet character, joining political commentary with the style of Punch and Judy.\n\nThe theatre's peak was between World War I and World War II, when it was frequented by royalty and celebrities in evening dress., at http://www.grandguignol.com/nytmag.htm\n\nImportant people\n\nOscar Méténier was the Grand Guignol's founder and original director. Under his direction, the theatre produced plays about a class of people who were not considered appropriate subjects in other venues: prostitutes, criminals, street urchins and others at the lower end of Paris's social echelon.\n\nMax Maurey served as director from 1898 to 1914. Maurey shifted the theatre's emphasis to the horror plays it would become famous for and judged the success of a performance by the number of patrons who passed out from shock; the average was two faintings each evening. Maurey discovered André de Lorde, who would become the most important playwright for the theatre.\n\nDe Lorde was the theatre's principal playwright from 1901 to 1926. He wrote at least 100 plays for the Grand Guignol and collaborated with experimental psychologist Alfred Binet to create plays about insanity, one of the theatre's favourite and frequently recurring themes.\n\nCamille Choisy served as director from 1914 to 1930. He contributed his expertise in special effects and scenery to the theatre's distinctive style.\n\n was one of the Grand Guignol's best-known performers. From 1917 to the 1930s, she performed most frequently as a victim and was known as \"the most assassinated woman in the world.\" During her career at the Grand Guignol, Maxa's characters were murdered more than 10,000 times in at least 60 different ways and raped at least 3,000 times.\n\nJack Jouvin served as director from 1930 to 1937. He shifted the theatre's subject matter, focusing performances not on gory horror but psychological drama. Under his leadership, the theatre's popularity waned and, after World War II, it was not well-attended.\n\nCharles Nonon was the theatre's last director.\n\nPlays\n\nAt the Grand Guignol, patrons would see five or six plays, all in a style that attempted to be brutally true to the theatre's naturalistic ideals. The plays were in a variety of styles, but the most popular and best known were the horror plays, featuring a distinctly bleak worldview as well as notably gory special effects in their notoriously bloody climaxes. The horrors depicted at Grand Guignol were generally not supernatural; these plays often explored the altered states, like insanity, hypnosis, or panic, under which uncontrolled horror could happen. To heighten the effect, the horror plays were often alternated with comedies.\n\nLe Laboratoire des Hallucinations, by André de Lorde: When a doctor finds his wife's lover in his operating room, he performs a graphic brain surgery, rendering the adulterer a hallucinating semi-zombie. Now insane, the lover/patient hammers a chisel into the doctor's brain.\n\nUn Crime dans une Maison de Fous, by André de Lorde: Two hags in an insane asylum use scissors to blind a pretty, young fellow inmate out of jealousy.\n\nL'Horrible Passion, by André de Lorde: A nanny strangles the children in her care.\n\nLe Baiser dans la Nuit, by Maurice Level: A young woman visits the man whose face she horribly disfigured with acid, where he obtains his revenge.[http://theatredamned.blogspot.com/2010/11/violence-and-vitriol-exploring-le.html Violence and Vitriol – Exploring 'Le Baiser dans la nuit'] Retrieved 2011-02-01.\n\nTheatre closing\n\nAudiences waned in the years following World War II, and the Grand Guignol closed its doors in 1962. Management attributed the closure in part to the fact that the theatre's faux horrors had been eclipsed by the actual events of the Holocaust two decades earlier. \"We could never equal Buchenwald,\" said its final director, Charles Nonon. \"Before the war, everyone felt that what was happening onstage was impossible. Now we know that these things, and worse, are possible in reality.\"\n\nThe Grand Guignol building still exists. It is occupied by , a company devoted to presenting plays in sign language.\n\nLegacy\n\nGrand Guignol flourished briefly in London in the early 1920s under the direction of Jose Levy, where it attracted the talents of Sybil Thorndike and Noël Coward,[http://theatredamned.blogspot.com/2011/01/dame-sybil-thorndike-londons-queen-of.html Dame Sybil Thorndike – London's Queen of Screams] Retrieved 2011-17-01. and a series of short English \"Grand Guignol\" films (using original screenplays, not play adaptations) was made at the same time, directed by Fred Paul. Several of the films exist at the BFI National Archive.\n\nThe Grand Guignol was revived once again in London in 1945, under the direction of Frederick Witney, where it ran for two seasons at the Granville Theatre. These included premiers of Witney's own work as well as adaptations of French originals.[http://theatredamned.blogspot.com/2010/10/fredrick-witney-forgotten-legend-of.html Fredrick Witney – A forgotten legend of the Grand Guignol] Retrieved 2011-02-01.\n\nIn recent years, English director-writer, Richard Mazda, has re-introduced New York audiences to the Grand Guignol. His acting troupe, The Queens Players, have produced 6 mainstage productions of Grand Guignol plays, and Mazda is writing new plays in the classic Guignol style. The sixth production, Theatre of Fear, included De Lorde's famous adaptation of Poe's The System of Doctor Tarr and Professor Fether (Le Systéme du Dr Goudron et Pr Plume) as well as two original plays, Double Crossed and The Good Death alongside The Tell Tale Heart.\n\nThe 1963 mondo film Ecco includes a scene which may have been filmed at the Grand Guignol theatre during its final years.\n\nAmerican avant-garde composer John Zorn released an album called Grand Guignol by Naked City in 1992, in a reference to \"the darker side of our existence which has always been with us and always will be\".Liner notes of Grand Guignol CD\n\nWashington, D.C.-based Molotov Theatre Group, established in 2007, is dedicated to preserving and exploring the aesthetic of the Grand Guignol. They have entered two plays into the Capital Fringe Festival in Washington, D.C. Their 2007 show, For Boston, won \"Best Comedy\", and their second show, The Sticking Place, won \"Best Overall\" in 2008.\n\nThe Swiss theatre company, Compagnie Pied de Biche revisits the Grand Guignol genre in contemporary contexts since 2008. The company staged in 2010 a diptych Impact & Dr. Incubis, based on original texts by Nicolas Yazgi and directed by Frédéric Ozier.http://www.pied-de-biche.ch/pied-de-biche/compagnie/frederic-ozier.html More than literal adaptations, the plays address violence, death, crime and fear in contemporary contexts, while revisiting many trope of the original Grand Guignol corpus, often with humour.\n\nRecently formed London-based Grand Guignol company Theatre of the Damned, brought their first production to the Camden Fringe in 2010 and produced the award nominated Grand Guignol in November of that year.[http://www.thisislondon.co.uk/standard/article-23904853-its-a-scream-theatre-of-the-macabre-is-a-runaway-hit.do It's a scream: theatre of the macabre is a runaway hit] London Evening Standard Retrieved 2011-01-02. In 2011, they staged \"Revenge of the Grand Guignol\" at the Courtyard Theatre, London, as part of the London Horror Festival.\n\nAlso based in London, Le Nouveau Guignol form the UK's only permanent repertory Grand Guignol company; plays within their current repertoire include French Guignol classics such as \"The Final Kiss\", \"Tics... Or Doing the Deed\", \"The Lighthouse Keepers\", \"Private Room Number Six\" and \"The Kiss of Blood\". However, as their company remit also includes encouraging new writing, they have also staged several new plays in the Grand-Guignol style, including \"Eating For Two\", \"Penalty\" and \"Ways and Means\". Le Nouveau Guignol took part in the London Horror Festival alongside Theatre of the Damned at Courtyard Theatre in November 2011.\n\nThe Grand Guignolers in Los Angeles, California, established in 2007, create and perform traditional Grand Guignol and original works as a 1920s Parisian theatre troupe. Shows are staged as event and draw on multiple forms of traditional physical theatrical genres in new ways including Commedia dell'arte, melodrama, mime, mask, clown, dance, vaudeville, magic, and puppetry.  Many shows play with the literal 'big puppet' theme utilizing puppetry at various levels including the Petits Guignolers, a French existentially lewd finger puppet show with Grand Guignol effects. The company paid homage to its namesake by staging a surprise 200th birthday party for Guignol with \"A Grand Guignol Children's Show* (*NOT for Children).\"  In addition to evenings of classic Grand Guignol, original productions have included \"A Very Grand Guignol Christmas\" and \"Absinthe, Opium and Magic, 1920s Shanghai\".\n\nIn August to October 2013, the Xoregos Performing Company presented Danse Macabre, a contemporary tribute to Grand Guignol at  Theater for the New City in New York City. Danse Macabre was a program of four plays of psychological and physical terror, one humorous work and a dance, in keeping with Grand Guignol's programming history.  The run ended October 27 at the Bronx Museum of the Arts.  The playwrights were Dave deChristopher, Jack Feldstein, Dylan Guy, Pamela Scott and Joel Trinidad.  Choreographer and Director, Shela Xoregos.\n\nIn November 2014, 86 years after the last show of Alfredo Sainati's \"La Compagnia del Grand-Guignol\", founded in 1908 and which had been the only example of Grand Guignol in Italy, the Convivio d'Arte Company presented in Milan \"Grand Guignol de Milan: Le Cabaret des Vampires\". The show was an original tribute to Grand Guignol, a horror vaudeville with various horror and grotesque performances such as monologues, live music and burlesque, with a satirical black humour conduction.\n \nWhile the original Grand Guignol attempted to present naturalistic horror, the performances would seem melodramatic and heightened to today's audience. For this reason, the term is often applied to films and plays of a stylised nature with heightened acting, melodrama and theatrical effects such as Sweeney Todd, Sleepy Hollow, Quills, and the Hammer Horror films that went before them. What Ever Happened to Baby Jane?; Hush... Hush, Sweet Charlotte; What Ever Happened to Aunt Alice?; What's the Matter with Helen?; Night Watch and Whoever Slew Auntie Roo? form a sub-branch of the genre called Grande Dame Guignol for its use of aging A-list actresses in sensational horror films.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Grand Guignol" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12285" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Le Théâtre du Grand-Guignol (: \"The Theatre of the Great Puppet\")—known as the Grand Guignol—was a theatre in the Pigalle area of Paris (at 20 bis, ). From its opening in 1897 until its closing in 1962, it specialised in naturalistic horror shows. Its name is often used as a general term for graphic, amoral horror entertainment, a genre popular from Elizabethan and Jacobean theatre (for instance Shakespeare's Titus Andronicus, and Webster's The Duchess of Malfi and The White Devil), to today's splatter films.\n\nTheatre\n\nLe Théâtre du Grand-Guignol was founded in 1894 by Oscar Méténier, who planned it as a space for naturalist performance. With 293 seats, the venue was the smallest in Paris.\n\nA former chapel, the theatre's previous life was evident in the boxes—which looked like confessionals—and in the angels over the orchestra. Although the architecture created frustrating obstacles, the design that was initially a predicament ultimately became beneficial to the marketing of the theatre. The opaque furniture and gothic structures placed sporadically on the walls of the building exude a feeling of eeriness from the moment of entrance. People came to this theatre for an experience, not only to see a show. The audience at \"Le Théâtre du Grand-Guignol\" endured the terror of the shows because they wanted to be filled with strong “feelings” of something. Many attended the shows to get a feeling of arousal. Underneath the balcony were boxes (originally built for nuns to watch church services) that were available for theatre-goers to rent during performances because they would get so aroused by the action happening on stage. It has been said that audience members would get so boisterous in the boxes, that actors would sometimes break character and yell something such as “Keep it down in there!” Conversely, there were audience members who could not physically handle the brutality of the actions taking place on stage. Frequently, the “special effects” would be too realistic and often an audience member would faint or vomit during performances.Hand, Richard J., and Michael Wilson. Grand-Guignol The French Theatre of Horror. Exeter: University of Exeter Press, 2002. Print.\n\nThe theatre owed its name to Guignol, a traditional Lyonnaise puppet character, joining political commentary with the style of Punch and Judy.\n\nThe theatre's peak was between World War I and World War II, when it was frequented by royalty and celebrities in evening dress., at http://www.grandguignol.com/nytmag.htm\n\nImportant people\n\nOscar Méténier was the Grand Guignol's founder and original director. Under his direction, the theatre produced plays about a class of people who were not considered appropriate subjects in other venues: prostitutes, criminals, street urchins and others at the lower end of Paris's social echelon.\n\nMax Maurey served as director from 1898 to 1914. Maurey shifted the theatre's emphasis to the horror plays it would become famous for and judged the success of a performance by the number of patrons who passed out from shock; the average was two faintings each evening. Maurey discovered André de Lorde, who would become the most important playwright for the theatre.\n\nDe Lorde was the theatre's principal playwright from 1901 to 1926. He wrote at least 100 plays for the Grand Guignol and collaborated with experimental psychologist Alfred Binet to create plays about insanity, one of the theatre's favourite and frequently recurring themes.\n\nCamille Choisy served as director from 1914 to 1930. He contributed his expertise in special effects and scenery to the theatre's distinctive style.\n\n was one of the Grand Guignol's best-known performers. From 1917 to the 1930s, she performed most frequently as a victim and was known as \"the most assassinated woman in the world.\" During her career at the Grand Guignol, Maxa's characters were murdered more than 10,000 times in at least 60 different ways and raped at least 3,000 times.\n\nJack Jouvin served as director from 1930 to 1937. He shifted the theatre's subject matter, focusing performances not on gory horror but psychological drama. Under his leadership, the theatre's popularity waned and, after World War II, it was not well-attended.\n\nCharles Nonon was the theatre's last director.\n\nPlays\n\nAt the Grand Guignol, patrons would see five or six plays, all in a style that attempted to be brutally true to the theatre's naturalistic ideals. The plays were in a variety of styles, but the most popular and best known were the horror plays, featuring a distinctly bleak worldview as well as notably gory special effects in their notoriously bloody climaxes. The horrors depicted at Grand Guignol were generally not supernatural; these plays often explored the altered states, like insanity, hypnosis, or panic, under which uncontrolled horror could happen. To heighten the effect, the horror plays were often alternated with comedies.\n\nLe Laboratoire des Hallucinations, by André de Lorde: When a doctor finds his wife's lover in his operating room, he performs a graphic brain surgery, rendering the adulterer a hallucinating semi-zombie. Now insane, the lover/patient hammers a chisel into the doctor's brain.\n\nUn Crime dans une Maison de Fous, by André de Lorde: Two hags in an insane asylum use scissors to blind a pretty, young fellow inmate out of jealousy.\n\nL'Horrible Passion, by André de Lorde: A nanny strangles the children in her care.\n\nLe Baiser dans la Nuit, by Maurice Level: A young woman visits the man whose face she horribly disfigured with acid, where he obtains his revenge.[http://theatredamned.blogspot.com/2010/11/violence-and-vitriol-exploring-le.html Violence and Vitriol – Exploring 'Le Baiser dans la nuit'] Retrieved 2011-02-01.\n\nTheatre closing\n\nAudiences waned in the years following World War II, and the Grand Guignol closed its doors in 1962. Management attributed the closure in part to the fact that the theatre's faux horrors had been eclipsed by the actual events of the Holocaust two decades earlier. \"We could never equal Buchenwald,\" said its final director, Charles Nonon. \"Before the war, everyone felt that what was happening onstage was impossible. Now we know that these things, and worse, are possible in reality.\"\n\nThe Grand Guignol building still exists. It is occupied by , a company devoted to presenting plays in sign language.\n\nLegacy\n\nGrand Guignol flourished briefly in London in the early 1920s under the direction of Jose Levy, where it attracted the talents of Sybil Thorndike and Noël Coward,[http://theatredamned.blogspot.com/2011/01/dame-sybil-thorndike-londons-queen-of.html Dame Sybil Thorndike – London's Queen of Screams] Retrieved 2011-17-01. and a series of short English \"Grand Guignol\" films (using original screenplays, not play adaptations) was made at the same time, directed by Fred Paul. Several of the films exist at the BFI National Archive.\n\nThe Grand Guignol was revived once again in London in 1945, under the direction of Frederick Witney, where it ran for two seasons at the Granville Theatre. These included premiers of Witney's own work as well as adaptations of French originals.[http://theatredamned.blogspot.com/2010/10/fredrick-witney-forgotten-legend-of.html Fredrick Witney – A forgotten legend of the Grand Guignol] Retrieved 2011-02-01.\n\nIn recent years, English director-writer, Richard Mazda, has re-introduced New York audiences to the Grand Guignol. His acting troupe, The Queens Players, have produced 6 mainstage productions of Grand Guignol plays, and Mazda is writing new plays in the classic Guignol style. The sixth production, Theatre of Fear, included De Lorde's famous adaptation of Poe's The System of Doctor Tarr and Professor Fether (Le Systéme du Dr Goudron et Pr Plume) as well as two original plays, Double Crossed and The Good Death alongside The Tell Tale Heart.\n\nThe 1963 mondo film Ecco includes a scene which may have been filmed at the Grand Guignol theatre during its final years.\n\nAmerican avant-garde composer John Zorn released an album called Grand Guignol by Naked City in 1992, in a reference to \"the darker side of our existence which has always been with us and always will be\".Liner notes of Grand Guignol CD\n\nWashington, D.C.-based Molotov Theatre Group, established in 2007, is dedicated to preserving and exploring the aesthetic of the Grand Guignol. They have entered two plays into the Capital Fringe Festival in Washington, D.C. Their 2007 show, For Boston, won \"Best Comedy\", and their second show, The Sticking Place, won \"Best Overall\" in 2008.\n\nThe Swiss theatre company, Compagnie Pied de Biche revisits the Grand Guignol genre in contemporary contexts since 2008. The company staged in 2010 a diptych Impact & Dr. Incubis, based on original texts by Nicolas Yazgi and directed by Frédéric Ozier.http://www.pied-de-biche.ch/pied-de-biche/compagnie/frederic-ozier.html More than literal adaptations, the plays address violence, death, crime and fear in contemporary contexts, while revisiting many trope of the original Grand Guignol corpus, often with humour.\n\nRecently formed London-based Grand Guignol company Theatre of the Damned, brought their first production to the Camden Fringe in 2010 and produced the award nominated Grand Guignol in November of that year.[http://www.thisislondon.co.uk/standard/article-23904853-its-a-scream-theatre-of-the-macabre-is-a-runaway-hit.do It's a scream: theatre of the macabre is a runaway hit] London Evening Standard Retrieved 2011-01-02. In 2011, they staged \"Revenge of the Grand Guignol\" at the Courtyard Theatre, London, as part of the London Horror Festival.\n\nAlso based in London, Le Nouveau Guignol form the UK's only permanent repertory Grand Guignol company; plays within their current repertoire include French Guignol classics such as \"The Final Kiss\", \"Tics... Or Doing the Deed\", \"The Lighthouse Keepers\", \"Private Room Number Six\" and \"The Kiss of Blood\". However, as their company remit also includes encouraging new writing, they have also staged several new plays in the Grand-Guignol style, including \"Eating For Two\", \"Penalty\" and \"Ways and Means\". Le Nouveau Guignol took part in the London Horror Festival alongside Theatre of the Damned at Courtyard Theatre in November 2011.\n\nThe Grand Guignolers in Los Angeles, California, established in 2007, create and perform traditional Grand Guignol and original works as a 1920s Parisian theatre troupe. Shows are staged as event and draw on multiple forms of traditional physical theatrical genres in new ways including Commedia dell'arte, melodrama, mime, mask, clown, dance, vaudeville, magic, and puppetry.  Many shows play with the literal 'big puppet' theme utilizing puppetry at various levels including the Petits Guignolers, a French existentially lewd finger puppet show with Grand Guignol effects. The company paid homage to its namesake by staging a surprise 200th birthday party for Guignol with \"A Grand Guignol Children's Show* (*NOT for Children).\"  In addition to evenings of classic Grand Guignol, original productions have included \"A Very Grand Guignol Christmas\" and \"Absinthe, Opium and Magic, 1920s Shanghai\".\n\nIn August to October 2013, the Xoregos Performing Company presented Danse Macabre, a contemporary tribute to Grand Guignol at  Theater for the New City in New York City. Danse Macabre was a program of four plays of psychological and physical terror, one humorous work and a dance, in keeping with Grand Guignol's programming history.  The run ended October 27 at the Bronx Museum of the Arts.  The playwrights were Dave deChristopher, Jack Feldstein, Dylan Guy, Pamela Scott and Joel Trinidad.  Choreographer and Director, Shela Xoregos.\n\nIn November 2014, 86 years after the last show of Alfredo Sainati's \"La Compagnia del Grand-Guignol\", founded in 1908 and which had been the only example of Grand Guignol in Italy, the Convivio d'Arte Company presented in Milan \"Grand Guignol de Milan: Le Cabaret des Vampires\". The show was an original tribute to Grand Guignol, a horror vaudeville with various horror and grotesque performances such as monologues, live music and burlesque, with a satirical black humour conduction.\n \nWhile the original Grand Guignol attempted to present naturalistic horror, the performances would seem melodramatic and heightened to today's audience. For this reason, the term is often applied to films and plays of a stylised nature with heightened acting, melodrama and theatrical effects such as Sweeney Todd, Sleepy Hollow, Quills, and the Hammer Horror films that went before them. What Ever Happened to Baby Jane?; Hush... Hush, Sweet Charlotte; What Ever Happened to Aunt Alice?; What's the Matter with Helen?; Night Watch and Whoever Slew Auntie Roo? form a sub-branch of the genre called Grande Dame Guignol for its use of aging A-list actresses in sensational horror films. Grand Guignol. http://en.wikipedia.org/?curid=12285."
  }
}
