{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1974",
  "eid" : "bcffa640-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778396836,
  "textBody" : "Events\n\n*1080 – Harald III of Denmark dies and is succeeded by Canute IV, who would later be the first Dane to be canonized.\n*1349 – The rule of the Bavand dynasty in Mazandaran is brought to an end by the murder of Hasan II.\n*1362 – Kaunas Castle falls to the Teutonic Order after a month-long siege.\n*1397 – Geoffrey Chaucer tells The Canterbury Tales for the first time at the court of Richard II. Chaucer scholars have also identified this date (in 1387) as the start of the book's pilgrimage to Canterbury.\n*1492 – Spain and Christopher Columbus sign the Capitulations of Santa Fe for his voyage to Asia to acquire spices.\n*1521 – Trial of Martin Luther over his teachings begins during the assembly of the Diet of Worms. Initially intimidated, he asks for time to reflect before answering and is given a stay of one day.\n*1524 – Giovanni da Verrazzano reaches New York harbor.\n*1797 – Sir Ralph Abercromby attacks San Juan, Puerto Rico, in what would be one of the largest invasions of the Spanish territories in the Americas. \n*  1797   – Citizens of Verona begin an unsuccessful eight-day rebellion against the French occupying forces.\n*1861 – The state of Virginia's secession convention votes to secede from the United States, becoming the 8th state to join the Confederate States of America.\n*1863 – American Civil War: Grierson's Raid begins: Troops under Union Army Colonel Benjamin Grierson attack central Mississippi.\n*1864 – American Civil War: The Battle of Plymouth begins: Confederate forces attack Plymouth, North Carolina.\n*1895 – The Treaty of Shimonoseki between China and Japan is signed. This marks the end of the First Sino-Japanese War, and the defeated Qing Empire is forced to renounce its claims on Korea and to concede the southern portion of the Fengtien province, Taiwan and the Pescadores Islands to Japan.\n*1905 – The Supreme Court of the United States decides Lochner v. New York, which holds that the \"right to free contract\" is implicit in the due process clause of the Fourteenth Amendment to the United States Constitution.\n*1907 – The Ellis Island immigration center processes 11,747 people, more than on any other day.\n*1912 – Russian troops open fire on striking goldfield workers in northeast Siberia, killing at least 150.\n*1941 – World War II: The Kingdom of Yugoslavia surrenders to Germany.\n*1942 – French prisoner of war General Henri Giraud escapes from his castle prison in Königstein Fortress.\n*1944 – Forces of the Communist-controlled Greek People's Liberation Army attack the smaller National and Social Liberation resistance group, which surrenders. Its leader Dimitrios Psarros is murdered.\n*1945 – World War II: Montese, Italy, is liberated from Nazi forces.\n*1946 – The last French troops are withdrawn from Syria.\n*1949 – At midnight 26 Irish counties officially leave the British Commonwealth. A 21-gun salute on O'Connell Bridge, Dublin, ushers in the Republic of Ireland.\n*1951 – The Peak District becomes the United Kingdom's first National Park.\n*1961 – Bay of Pigs Invasion: A group of Cuban exiles financed and trained by the CIA lands at the Bay of Pigs in Cuba with the aim of ousting Fidel Castro.\n*1969 – Sirhan Sirhan is convicted of assassinating Robert F. Kennedy.\n*  1969   – Communist Party of Czechoslovakia chairman Alexander Dubček is deposed.\n*1970 – Apollo program: The ill-fated Apollo 13 spacecraft returns to Earth safely.\n*1971 – The People's Republic of Bangladesh is formed.\n*1975 – The Cambodian Civil War ends. The Khmer Rouge captures the capital Phnom Penh and Cambodian government forces surrender.\n*1978 – Mir Akbar Khyber is assassinated, provoking a communist coup d'état in Afghanistan.\n*1982 – Patriation of the Canadian constitution in Ottawa by Proclamation of Elizabeth II, Queen of Canada.\n*2006 – A Palestinian suicide bomber detonates an explosive device in a Tel Aviv restaurant, killing 11 people and injuring 70.\n*2013 – An explosion at a fertilizer plant in the city of West, Texas, kills 15 people and injures 160 others.\n*2014 – NASA's Kepler space observatory confirms the discovery of the first Earth-size planet in the habitable zone of another star.\n\nBirths\n\n*AD 44 – Pope Evaristus (d. 107)\n*1277 – Michael IX Palaiologos, Byzantine emperor (d. 1320)\n*1497 – Pedro de Valdivia, Spanish conquistador, conquered northern Chile (d. 1553)\n*1573 – Maximilian I, Elector of Bavaria (d. 1651)\n*1586 – John Ford, English poet and playwright (d. 1639)\n*1598 – Giovanni Battista Riccioli, Italian priest and astronomer (d. 1671)\n*1620 – Marguerite Bourgeoys, French-Canadian nun and saint, founded the Congregation of Notre Dame of Montreal (d. 1700)\n*1622 – Henry Vaughan, Welsh physician, author, and poet (d. 1695)\n*1635 – Edward Stillingfleet, British theologian and scholar (d. 1699)\n*1676 – Frederick I of Sweden (d. 1751)\n*1683 – Johann David Heinichen, German composer and theorist (d. 1729)\n*1710 – Henry Erskine, 10th Earl of Buchan, Scottish politician (d. 1767)\n*1734 – Taksin, King of Thailand (d. 1782)\n*1741 – Samuel Chase, American lawyer and jurist (d. 1811)\n*1750 – François de Neufchâteau, French academic and politician, French Minister of the Interior (d. 1828)\n*1756 – Dheeran Chinnamalai, Indian commander (d. 1805)\n*1766 – Collin McKinney, American surveyor, merchant, and politician (d. 1861)\n*1794 – Carl Friedrich Philipp von Martius, German botanist and explorer (d. 1868)\n*1798 – Étienne Bobillier, French mathematician and academic (d. 1840)\n*1814 – Josif Pančić, Serbian botanist and academic (d. 1888)\n*1816 – Thomas Hazlehurst, English architect and philanthropist (d. 1876)\n*1820 – Alexander Cartwright, American firefighter and inventor of baseball (d. 1892)\n*1833 – Jean-Baptiste Accolay, Belgian violinist, composer, and conductor (d. 1900)\n*1837 – J. P. Morgan, American banker and financier, founded J.P. Morgan & Co. (d. 1913)\n*1842 – Maurice Rouvier, French businessman and politician, 53rd Prime Minister of France (d. 1911)\n*1849 – William R. Day, American jurist and politician, 36th United States Secretary of State (d. 1923)\n*1852 – Cap Anson, American baseball player and manager (d. 1922)\n*1863 – Augustus Edward Hough Love, English mathematician and theorist (d. 1940)\n*1865 – Ursula Ledóchowska, Polish-Austrian nun and saint, founded the Congregation of the Ursulines of the Agonizing Heart of Jesus (d. 1939)\n*1866 – Ernest Starling, English physiologist and academic (d. 1927)\n*1875 – Aleksander Tõnisson, Estonian general and politician, 5th Estonian Minister of War (d. 1941)\n*1877 – Matsudaira Tsuneo, Japanese diplomat (d. 1949)\n*1878 – Emil Fuchs, German-American lawyer and businessman (d. 1961)\n*  1878   – Demetrios Petrokokkinos, Greek tennis player (d. 1942)\n*1879 – Henri Tauzin, French hurdler (d. 1918)\n*1882 – Artur Schnabel, Jewish-Polish pianist and composer (d. 1951)\n*1888 – Herms Niel, German soldier, trombonist, and composer (d. 1954)\n*1891 – George Adamski, Polish-American ufologist and author (d. 1965)\n*1895 – Robert Dean Frisbie, American soldier and author (d. 1948)\n*1896 – Señor Wences, Spanish-American ventriloquist (d. 1999)\n*1897 – Nisargadatta Maharaj, Indian philosopher and educator (d. 1981)\n*  1897   – Thornton Wilder, American novelist and playwright (d. 1975)\n*  1897   – Edouard Wyss-Dunant, Swiss physician and mountaineer (d. 1983)\n*1899 – Aleksander Klumberg, Estonian decathlete and coach (d. 1958)\n*1903 – Nicolas Nabokov, Russian-American composer and educator (d. 1978)\n*  1903   – Gregor Piatigorsky, Ukrainian-American cellist and educator (d. 1976)\n*  1903   – Morgan Taylor, American hurdler and coach (d. 1975)\n*1905 – Louis Jean Heydt, American journalist and actor (d. 1960)\n*  1905   – Arthur Lake, American actor (d. 1987)\n*1906 – Sidney Garfield, American physician, co-founded Kaiser Permanente (d. 1984)\n*1909 – Alain Poher, French politician, President of France (d. 1996)\n*1910 – Evangelos Averoff, Greek historian and politician, Greek Minister of Defence (d. 1990)\n*  1910   – Ivan Goff, Australian screenwriter and producer (d. 1999)\n*  1910   – Helenio Herrera, French footballer and manager (d. 1997)\n*1911 – Hervé Bazin, French author and poet (d. 1996)\n*  1911   – Lester Rodney, American soldier and journalist (d. 2009)\n*1912 – Marta Eggerth, Jewish-Hungarian-American actress and singer (d. 2013)\n*1914 – George Davis, American art director (d. 1984)\n*  1914   – Mac Raboy, American illustrator (d. 1967)\n*1915 – Sirimavo Bandaranaike, Sri Lankan politician, 6th Prime Minister of Sri Lanka (d. 2000)\n*  1915   – Martin Clemens, Scottish soldier (d. 2009)\n*  1915   – Joe Foss, American general and politician, 20th Governor of South Dakota (d. 2003)\n*  1915   – Regina Ghazaryan, Armenian painter (d. 1999)\n*1916 – Win Maung, 3rd President of Union of Myanmar (d. 1989)\n*  1916   – A. Thiagarajah, Sri Lankan educator and politician (d. 1981)\n*1918 – William Holden, American actor (d. 1981)\n*1919 – Gilles Lamontagne, Canadian lieutenant and politician, 24th Lieutenant Governor of Quebec (d. 2016)\n*  1919   – Chavela Vargas, Costa Rican-Mexican singer-songwriter and actress (d. 2012)\n*1920 – Edmonde Charles-Roux, French journalist and author (d. 2016)\n*1923 – Lindsay Anderson, English actor, director, and screenwriter (d. 1994)\n*  1923   – Solly Hemus, American baseball player, coach, and manager (d. 2017)\n*  1923   – Neville McNamara, Australian air marshal (d. 2014)\n*  1923   – Gianni Raimondi, Italian lyric tenor (d. 2008)\n*  1923   – Harry Reasoner, American soldier and journalist (d. 1991)\n*1924 – Kenneth Norman Jones, Australian public servant\n*  1924   – Donald Richie, American-Japanese author and critic (d. 2013)\n*1925   – René Moawad, Lebanese lawyer and politician, 13th President of Lebanon (d. 1989)\n*1926 – Joan Lorring, British actress (d. 2014)\n*  1926   – Gerry McNeil, Canadian ice hockey player and manager (d. 2004)\n*1927 – Margot Honecker, East German politician and First Lady (d. 2016)\n*1928 – Victor Lownes, American businessman (d. 2017)\n*  1928   – Cynthia Ozick, American short story writer, novelist, and essayist\n*  1928   – Heinz Putzl, Austrian fencer\n*  1928   – Fabien Roy, Canadian accountant and politician\n*1929 – James Last, German-American bassist, composer, and bandleader (d. 2015)\n*1930 – Chris Barber, English trombonist and bandleader\n*1931 – John Barrett, English tennis player and sportscaster\n*  1931   – Malcolm Browne, American journalist and photographer (d. 2012)\n*1934 – Don Kirshner, American songwriter and producer (d. 2011)\n*  1934   – Peter Morris, Australian-English surgeon and academic\n*1935 – Bud Paxson, American broadcaster, founded Home Shopping Network and Pax TV (d. 2015)\n*1937 – Ronald Hamowy, Canadian historian and academic (d. 2012)\n*  1937   – Ferdinand Piëch, Austrian-German engineer and businessman\n*1938 – Ben Barnes, American businessman and politician, 36th Lieutenant Governor of Texas\n*  1938   – Doug Lewis, Canadian lawyer and politician, 41st Canadian Minister of Justice\n*  1938   – Ronald H. Miller, American theologian, author, and academic (d. 2011)\n*  1938   – Kerry Wendell Thornley, American theorist and author (d. 1988)\n*1939 – Robert Miller, American art dealer (d. 2011)\n*1940 – Eric Dancer, English businessman and politician, Lord Lieutenant of Devon\n*  1940   – Billy Fury, English singer-songwriter (d. 1983)\n*  1940   – John McCririck, English journalist\n*  1940   – Chuck Menville, American animator and screenwriter (d. 1992)\n*  1940   – Anja Silja, German soprano and actress\n*  1940   – Agostino Vallini, Italian cardinal and vicar general of Rome\n*1941 – Lagle Parek, Estonian architect and politician, Estonian Minister of the Interior\n*1942 – Buster Williams, American jazz musician \n*1943 – Richard Allen Epstein, American lawyer, author, and academic\n*1946 – Clare Francis, English sailor and author\n*1947 – Nigel Emslie, Lord Emslie, Scottish lawyer and judge\n*  1947   – Richard Field, English lawyer and judge\n*  1947   – Sherrie Levine, American photographer\n*  1947   – Tsutomu Wakamatsu, Japanese baseball player, coach, and manager\n*1948 – Jan Hammer, Czech pianist, composer, and producer\n*  1948   – Alice Harden, American educator and politician (d. 2012)\n*  1948   – Pekka Vasala, Finnish runner\n*1951 – Olivia Hussey, Argentinian-English actress\n*  1951   – Börje Salming, Swedish ice hockey player and businessman\n*1952 – Joe Alaskey, American voice actor (d. 2016)\n*  1952   – Pierre Guité, Canadian ice hockey player\n*  1952   – John McColl, English general and politician, Lieutenant Governor of Jersey\n*  1952   – Željko Ražnatović, Serbian commander (d. 2000)\n*  1952   – John Robertson, Scottish businessman and politician\n*1954 – Riccardo Patrese, Italian race car driver\n*  1954   – Roddy Piper, Canadian professional wrestler and actor (d. 2015)\n*  1954   – Michael Sembello, American singer-songwriter and guitarist\n*1955 – Todd Lickliter, American basketball player and coach\n*  1955   – Pete Shelley, English singer-songwriter and guitarist \n*  1955   – Mike Stroud, English physician and explorer\n*1956 – Colin Tyre, Lord Tyre, Scottish lawyer and judge\n*1957 – Teri Austin, Canadian actress\n*  1957   – Afrika Bambaataa, American disc jockey\n*  1957   – Nick Hornby, English novelist, essayist, lyricist, and screenwriter\n*  1957   – Julia Macur, English lawyer and judge\n*  1957   – Frank McDonough, British historian\n*1958 – Laslo Babits, Canadian javelin thrower (d. 2013)\n*1959 – Sean Bean, English actor\n*  1959   – Jimmy Mann, Canadian ice hockey player\n*  1959   – Li Meisu, Chinese shot putter\n*1960 – Vladimir Polyakov, Russian pole vaulter\n*1961 – Frank J. Christensen, American labor union leader\n*  1961   – Norman Cowans, Jamaican-English cricketer\n*  1961   – Boomer Esiason, American football player and sportscaster\n*  1961   – Bella Freud, English fashion designer\n*1962 – Paul Nicholls, English jockey and trainer\n*1964 – Ken Daneyko, Canadian ice hockey player and sportscaster\n*  1964   – Maynard James Keenan, American singer-songwriter and producer \n*  1964   – Rachel Notley, Canadian politician\n*  1964   – Lela Rochon, American actress \n*1967 – Kimberly Elise, American actress\n*  1967   – Marquis Grissom, American baseball player and coach\n*  1967   – Ian Jones, New Zealand rugby player\n*  1967   – Barnaby Joyce, Australian politician, 17th Deputy Prime Minister of Australia\n*  1967   – Liz Phair, American singer-songwriter and guitarist\n*1968 – Julie Fagerholt, Danish fashion designer\n*  1968   – Phil Henderson, American basketball player and coach (d. 2013)\n*  1968   – Eric Lamaze, Canadian jockey\n*  1968   – Roger Twose, New Zealand cricketer\n*  1968   – Richie Woodhall, English boxer and trainer\n*1970 – Redman, American rapper, producer, and actor \n*1971 – Claire Sweeney, English actress \n*1972 – Gary Bennett, American baseball player\n*  1972   – Tony Boselli, American football player and sportscaster\n*  1972   – Jennifer Garner, American actress \n*  1972   – Muttiah Muralitharan, Sri Lankan cricketer\n*  1972   – Yuichi Nishimura, Japanese footballer and referee\n*  1972   – Terran Sandwith, Canadian ice hockey player\n*1973 – Katrin Koov, Estonian architect\n*  1973   – Brett Maher, Australian basketball player and sportscaster\n*  1973   – Theo Ratliff, American basketball player\n*1974 – Mikael Åkerfeldt, Swedish singer-songwriter, guitarist, and producer \n*  1974   – Victoria Beckham, English singer and fashion designer \n*1975 – Heidi Alexander, English politician\n*  1975   – Travis Roy, American ice hockey player\n*1976 – Maurice Wignall, Jamaican hurdler and long jumper\n*1977 – Chad Hedrick, American speed skater\n*  1977   – Phil Jamieson, Australian singer-songwriter and guitarist \n*  1977   – Frederik Magle, Danish composer, organist, and pianist\n*1978 – Monika Bergmann-Schmuderer, German skier\n*  1978   – Lindsay Hartley, American actress\n*  1978   – Jason White, Scottish rugby player\n*1979 – Eric Brewer, Canadian ice hockey player\n*  1979   – Marija Šestak, Serbian-Slovenian triple jumper\n*1980 – Fabián Vargas, Colombian footballer\n*  1980   – Curtis Woodhouse, English footballer, boxer, and manager\n*1981 – Jenny Meadows, English runner\n*  1981   – Hanna Pakarinen, Finnish singer-songwriter\n*  1981   – Ryan Raburn, American baseball player\n*  1981   – Chris Thompson, English runner\n*  1981   – Zhang Yaokun, Chinese footballer\n*1982 – Brad Boyes, Canadian ice hockey player\n*  1982   – Chuck Kobasew, Canadian ice hockey player\n*1983 – Stanislav Chistov, Russian ice hockey player\n*  1983   – Roberto Jiménez, Peruvian footballer\n*  1983   – Andrea Marcato, Italian rugby player\n*1984 – Pablo Sebastián Álvarez, Argentinian footballer\n*  1984   – Jed Lowrie, American baseball player\n*  1984   – Raffaele Palladino, Italian footballer\n*1985 – Rooney Mara, American actress\n*  1985   – Luke Mitchell, Australian actor and model\n*  1985   – Jo-Wilfried Tsonga, French tennis player\n*1986 – Romain Grosjean, French race car driver\n*1988 – Takahiro Moriuchi, Japanese singer-songwriter \n*1989 – Paraskevi Papachristou, Greek triple jumper\n*1990 – Jonathan Brown, Welsh footballer\n*1992 – Lachlan Maranta, Australian rugby league footballer\\\n\nDeaths\n\n* 485 – Proclus, Greek mathematician and philosopher (b. 412)\n* 617 – Donnán of Eigg, Irish priest and saint\n* 648 – Xiao, empress of the Sui Dynasty\n* 744 – Al-Walid II, Umayyad caliph (b. 706)\n* 818 – Bernard of Italy, Frankish king (b. 797)\n* 858 – Benedict III, pope of the Catholic Church\n*1080 – Harald III of Denmark (b. 1041)\n*1111 – Robert of Molesme, Christian saint and abbot (b. 1027)\n*1298 – Árni Þorláksson, Icelandic bishop (b. 1237)\n*1321 – Infanta Branca of Portugal, daughter of King Afonso III of Portugal (b. 1259)\n*1331 – Robert de Vere, 6th Earl of Oxford, English nobleman (b. 1257)\n*1344 – Constantine II, King of Armenia\n*1355 – Marin Falier, Doge of Venice (b. 1285)\n*1427 – John IV, Duke of Brabant (b. 1403)\n*1539 – George, Duke of Saxony (b. 1471)\n*1574 – Joachim Camerarius, German scholar and translator (b. 1500)\n*1669 – Antonio Bertali, Italian violinist and composer (b. 1605)\n*1680 – Kateri Tekakwitha, Mohawk-born Native American saint (b. 1656)\n*1695 – Juana Inés de la Cruz, Mexican poet and scholar (b. 1651)\n*1696 – Marie de Rabutin-Chantal, marquise de Sévigné, French author (b. 1626)\n*1711 – Joseph I, Holy Roman Emperor (b. 1678)\n*1713 – David Hollatz, Polish pastor and theologian (b. 1648)\n*1742 – Arvid Horn, Swedish general and politician (b. 1664)\n*1764 – Johann Mattheson, German lexicographer and composer (b. 1681)\n*1790 – Benjamin Franklin, American inventor, publisher, and politician, 6th President of Pennsylvania (b. 1706)\n*1799 – Richard Jupp, English surveyor and architect (b. 1728)\n*1840 – Hannah Webster Foster, American journalist and author (b. 1758)\n*1843 – Samuel Morey, American engineer (b. 1762)\n*1882 – George Jennings, English engineer and plumber, invented the Flush toilet (b. 1810)\n*1888 – E. G. Squier, American archaeologist and journalist (b. 1821)\n*1892 – Alexander Mackenzie, Scottish-Canadian journalist and politician, 2nd Prime Minister of Canada (b. 1822)\n*1921 – Manwel Dimech, Maltese journalist, author, and philosopher (b. 1860)\n*1923 – Laurence Ginnell, Irish lawyer and politician (b. 1852)\n*1930 – Alexander Golovin, Russian painter and stage designer (b. 1863)\n*1933 – Kote Marjanishvili, Georgian director and playwright (b. 1872)\n*1936 – Charles Ruijs de Beerenbrouck, Dutch lawyer and politician, 28th Prime Minister of the Netherlands (b. 1873)\n*1942 – Jean Baptiste Perrin, French-American physicist and chemist, Nobel Prize laureate (b. 1870)\n*1944 – J. T. Hearne, English cricketer and coach (b. 1867)\n*  1944   – Dimitrios Psarros, Greek lieutenant, founded the National and Social Liberation (b. 1893)\n*1946 – Juan Bautista Sacasa, Nicaraguan medical doctor, politician and 20th President of Nicaragua (b. 1874)\n*1948 – Suzuki Kantarō, Japanese admiral and politician, 42nd Prime Minister of Japan (b. 1868)\n*1954 – Lucrețiu Pătrășcanu, Romanian lawyer and politician, Romanian Minister of Justice (b. 1900)\n*1960 – Eddie Cochran, American singer-songwriter and guitarist (b. 1938)\n*1961 – Elda Anderson, American physicist and health researcher (b. 1899)\n*1967 – Red Allen, American singer and trumpet player (b. 1908)\n*1975 – Sarvepalli Radhakrishnan, Indian philosopher and politician, 2nd President of India (b. 1888)\n*1976 – Henrik Dam, Danish biochemist and physiologist, Nobel Prize laureate (b. 1895)\n*1977 – William Conway, Irish cardinal (b. 1913)\n*1983 – Felix Pappalardi, American singer-songwriter, bass player, and producer (b. 1939)\n*1984 – Claude Provost, Canadian-American ice hockey player (b. 1933)\n*1987 – Cecil Harmsworth King, English publisher (b. 1901)\n*  1987   – Dick Shawn, American actor (b. 1923)\n*1988 – Louise Nevelson, Ukrainian-American sculptor and educator (b. 1900)\n*1990 – Ralph Abernathy, American minister and activist (b. 1936)\n*1993 – Turgut Özal, Turkish engineer and politician, 8th president of Turkey (b. 1927)\n*1994 – Roger Wolcott Sperry, American psychologist and biologist, Nobel Prize laureate (b. 1913)\n*1995 – Frank E. Resnik, American sergeant and businessman (b. 1928)\n*1996 – Piet Hein, Danish poet and mathematician (b. 1905)\n*1997 – Chaim Herzog, Israeli general, lawyer, and politician, 6th President of Israel (b. 1918)\n*1998 – Linda McCartney, American photographer, activist, and musician (b. 1941)\n*2003 – Robert Atkins, American physician and cardiologist, created the Atkins diet (b. 1930)\n*  2003   – H. B. Bailey, American race car driver (b. 1936)\n*  2003   – John Paul Getty, Jr., American-English philanthropist (b. 1932)\n*  2003   – Earl King, American blues singer, guitarist and songwriter (b. 1934)\n*  2003   – Yiannis Latsis, Greek businessman (b. 1910)\n*2004 – Edmond Pidoux, Swiss author and poet (b. 1908)\n*2006 – Jean Bernard, French physician and haematologist (b. 1907)\n*  2006   – Scott Brazil, American director and producer (b. 1955)\n*  2006   – Henderson Forsythe, American actor (b. 1917)\n*2007 – Kitty Carlisle, American actress, singer, socialite and game show panelist (b. 1910)\n*2008 – Aimé Césaire, Caribbean-French poet and politician (b. 1913)\n*  2008   – Danny Federici, American organist and accordion player (b. 1950)\n*2011 – Eric Gross, Austrian-Australian pianist and composer (b. 1926)\n*  2011   – Michael Sarrazin, Canadian actor (b. 1940)\n*  2011   – Robert Vickrey, American artist and author (b. 1926)\n*2012 – Leila Berg, English journalist and author (b. 1917)\n*  2012   – J. Quinn Brisben, American educator and politician (b. 1934)\n*  2012   – Dimitris Mitropanos, Greek singer (b. 1948)\n*  2012   – Nityananda Mohapatra, Indian journalist, poet, and politician (b. 1912)\n*  2012   – Jonathan V. Plaut, American rabbi and author (b. 1942)\n*  2012   – Stanley Rogers Resor, American soldier, lawyer, and politician, 9th United States Secretary of the Army (b. 1917)\n*2013 – Carlos Graça, São Toméan politician, Prime Minister of São Tomé and Príncipe (b. 1931)\n*  2013   – Yngve Moe, Norwegian bass player and songwriter (b. 1957)\n*  2013   – V. S. Ramadevi, Indian politician, 13th Governor of Karnataka (b. 1934)\n*2014 – Gabriel García Márquez, Colombian journalist and author, Nobel Prize laureate (b. 1927)\n*  2014   – Bernat Klein, Serbian-Scottish fashion designer and painter (b. 1922)\n*  2014   – Wojciech Leśnikowski, Polish–American architect and academic (b. 1938)\n*  2014   – Karpal Singh, Malaysian lawyer and politician (b. 1940)\n*2015 – Izzat Ibrahim al-Douri, Iraqi field marshal and politician (b. 1942)\n*  2015   – Francis George, American cardinal (b. 1937)\n*  2015   – Robert P. Griffin, American soldier, lawyer, and politician (b. 1923)\n*  2015   – Scotty Probasco, American businessman and philanthropist (b. 1928)\n*  2015   – Jeremiah J. Rodell, American general (b. 1921)\n*  2015   – A. Alfred Taubman, American businessman and philanthropist (b. 1924)\n*2016 – Doris Roberts, American actress (b. 1925)\n\nHolidays and observances\n\n*Christian feast day:\n**Kateri Tekakwitha (Canada)\n**Stephen Harding\n**April 17 (Eastern Orthodox liturgics)\n*Earliest day on which Store Bededag or General Prayer Day can fall, while May 13 is the latest; observed on the 4th Friday after Easter. (Denmark)\n*Evacuation Day (Syria), celebrates the recognition of the independence of Syria from France in 1946.\n*FAO Day (Iraq)\n*Flag Day (American Samoa)\n*Malbec World Day \n*Women's Day (Gabon)\n*World Hemophilia Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "April 17" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1974" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*1080 – Harald III of Denmark dies and is succeeded by Canute IV, who would later be the first Dane to be canonized.\n*1349 – The rule of the Bavand dynasty in Mazandaran is brought to an end by the murder of Hasan II.\n*1362 – Kaunas Castle falls to the Teutonic Order after a month-long siege.\n*1397 – Geoffrey Chaucer tells The Canterbury Tales for the first time at the court of Richard II. Chaucer scholars have also identified this date (in 1387) as the start of the book's pilgrimage to Canterbury.\n*1492 – Spain and Christopher Columbus sign the Capitulations of Santa Fe for his voyage to Asia to acquire spices.\n*1521 – Trial of Martin Luther over his teachings begins during the assembly of the Diet of Worms. Initially intimidated, he asks for time to reflect before answering and is given a stay of one day.\n*1524 – Giovanni da Verrazzano reaches New York harbor.\n*1797 – Sir Ralph Abercromby attacks San Juan, Puerto Rico, in what would be one of the largest invasions of the Spanish territories in the Americas. \n*  1797   – Citizens of Verona begin an unsuccessful eight-day rebellion against the French occupying forces.\n*1861 – The state of Virginia's secession convention votes to secede from the United States, becoming the 8th state to join the Confederate States of America.\n*1863 – American Civil War: Grierson's Raid begins: Troops under Union Army Colonel Benjamin Grierson attack central Mississippi.\n*1864 – American Civil War: The Battle of Plymouth begins: Confederate forces attack Plymouth, North Carolina.\n*1895 – The Treaty of Shimonoseki between China and Japan is signed. This marks the end of the First Sino-Japanese War, and the defeated Qing Empire is forced to renounce its claims on Korea and to concede the southern portion of the Fengtien province, Taiwan and the Pescadores Islands to Japan.\n*1905 – The Supreme Court of the United States decides Lochner v. New York, which holds that the \"right to free contract\" is implicit in the due process clause of the Fourteenth Amendment to the United States Constitution.\n*1907 – The Ellis Island immigration center processes 11,747 people, more than on any other day.\n*1912 – Russian troops open fire on striking goldfield workers in northeast Siberia, killing at least 150.\n*1941 – World War II: The Kingdom of Yugoslavia surrenders to Germany.\n*1942 – French prisoner of war General Henri Giraud escapes from his castle prison in Königstein Fortress.\n*1944 – Forces of the Communist-controlled Greek People's Liberation Army attack the smaller National and Social Liberation resistance group, which surrenders. Its leader Dimitrios Psarros is murdered.\n*1945 – World War II: Montese, Italy, is liberated from Nazi forces.\n*1946 – The last French troops are withdrawn from Syria.\n*1949 – At midnight 26 Irish counties officially leave the British Commonwealth. A 21-gun salute on O'Connell Bridge, Dublin, ushers in the Republic of Ireland.\n*1951 – The Peak District becomes the United Kingdom's first National Park.\n*1961 – Bay of Pigs Invasion: A group of Cuban exiles financed and trained by the CIA lands at the Bay of Pigs in Cuba with the aim of ousting Fidel Castro.\n*1969 – Sirhan Sirhan is convicted of assassinating Robert F. Kennedy.\n*  1969   – Communist Party of Czechoslovakia chairman Alexander Dubček is deposed.\n*1970 – Apollo program: The ill-fated Apollo 13 spacecraft returns to Earth safely.\n*1971 – The People's Republic of Bangladesh is formed.\n*1975 – The Cambodian Civil War ends. The Khmer Rouge captures the capital Phnom Penh and Cambodian government forces surrender.\n*1978 – Mir Akbar Khyber is assassinated, provoking a communist coup d'état in Afghanistan.\n*1982 – Patriation of the Canadian constitution in Ottawa by Proclamation of Elizabeth II, Queen of Canada.\n*2006 – A Palestinian suicide bomber detonates an explosive device in a Tel Aviv restaurant, killing 11 people and injuring 70.\n*2013 – An explosion at a fertilizer plant in the city of West, Texas, kills 15 people and injures 160 others.\n*2014 – NASA's Kepler space observatory confirms the discovery of the first Earth-size planet in the habitable zone of another star.\n\nBirths\n\n*AD 44 – Pope Evaristus (d. 107)\n*1277 – Michael IX Palaiologos, Byzantine emperor (d. 1320)\n*1497 – Pedro de Valdivia, Spanish conquistador, conquered northern Chile (d. 1553)\n*1573 – Maximilian I, Elector of Bavaria (d. 1651)\n*1586 – John Ford, English poet and playwright (d. 1639)\n*1598 – Giovanni Battista Riccioli, Italian priest and astronomer (d. 1671)\n*1620 – Marguerite Bourgeoys, French-Canadian nun and saint, founded the Congregation of Notre Dame of Montreal (d. 1700)\n*1622 – Henry Vaughan, Welsh physician, author, and poet (d. 1695)\n*1635 – Edward Stillingfleet, British theologian and scholar (d. 1699)\n*1676 – Frederick I of Sweden (d. 1751)\n*1683 – Johann David Heinichen, German composer and theorist (d. 1729)\n*1710 – Henry Erskine, 10th Earl of Buchan, Scottish politician (d. 1767)\n*1734 – Taksin, King of Thailand (d. 1782)\n*1741 – Samuel Chase, American lawyer and jurist (d. 1811)\n*1750 – François de Neufchâteau, French academic and politician, French Minister of the Interior (d. 1828)\n*1756 – Dheeran Chinnamalai, Indian commander (d. 1805)\n*1766 – Collin McKinney, American surveyor, merchant, and politician (d. 1861)\n*1794 – Carl Friedrich Philipp von Martius, German botanist and explorer (d. 1868)\n*1798 – Étienne Bobillier, French mathematician and academic (d. 1840)\n*1814 – Josif Pančić, Serbian botanist and academic (d. 1888)\n*1816 – Thomas Hazlehurst, English architect and philanthropist (d. 1876)\n*1820 – Alexander Cartwright, American firefighter and inventor of baseball (d. 1892)\n*1833 – Jean-Baptiste Accolay, Belgian violinist, composer, and conductor (d. 1900)\n*1837 – J. P. Morgan, American banker and financier, founded J.P. Morgan & Co. (d. 1913)\n*1842 – Maurice Rouvier, French businessman and politician, 53rd Prime Minister of France (d. 1911)\n*1849 – William R. Day, American jurist and politician, 36th United States Secretary of State (d. 1923)\n*1852 – Cap Anson, American baseball player and manager (d. 1922)\n*1863 – Augustus Edward Hough Love, English mathematician and theorist (d. 1940)\n*1865 – Ursula Ledóchowska, Polish-Austrian nun and saint, founded the Congregation of the Ursulines of the Agonizing Heart of Jesus (d. 1939)\n*1866 – Ernest Starling, English physiologist and academic (d. 1927)\n*1875 – Aleksander Tõnisson, Estonian general and politician, 5th Estonian Minister of War (d. 1941)\n*1877 – Matsudaira Tsuneo, Japanese diplomat (d. 1949)\n*1878 – Emil Fuchs, German-American lawyer and businessman (d. 1961)\n*  1878   – Demetrios Petrokokkinos, Greek tennis player (d. 1942)\n*1879 – Henri Tauzin, French hurdler (d. 1918)\n*1882 – Artur Schnabel, Jewish-Polish pianist and composer (d. 1951)\n*1888 – Herms Niel, German soldier, trombonist, and composer (d. 1954)\n*1891 – George Adamski, Polish-American ufologist and author (d. 1965)\n*1895 – Robert Dean Frisbie, American soldier and author (d. 1948)\n*1896 – Señor Wences, Spanish-American ventriloquist (d. 1999)\n*1897 – Nisargadatta Maharaj, Indian philosopher and educator (d. 1981)\n*  1897   – Thornton Wilder, American novelist and playwright (d. 1975)\n*  1897   – Edouard Wyss-Dunant, Swiss physician and mountaineer (d. 1983)\n*1899 – Aleksander Klumberg, Estonian decathlete and coach (d. 1958)\n*1903 – Nicolas Nabokov, Russian-American composer and educator (d. 1978)\n*  1903   – Gregor Piatigorsky, Ukrainian-American cellist and educator (d. 1976)\n*  1903   – Morgan Taylor, American hurdler and coach (d. 1975)\n*1905 – Louis Jean Heydt, American journalist and actor (d. 1960)\n*  1905   – Arthur Lake, American actor (d. 1987)\n*1906 – Sidney Garfield, American physician, co-founded Kaiser Permanente (d. 1984)\n*1909 – Alain Poher, French politician, President of France (d. 1996)\n*1910 – Evangelos Averoff, Greek historian and politician, Greek Minister of Defence (d. 1990)\n*  1910   – Ivan Goff, Australian screenwriter and producer (d. 1999)\n*  1910   – Helenio Herrera, French footballer and manager (d. 1997)\n*1911 – Hervé Bazin, French author and poet (d. 1996)\n*  1911   – Lester Rodney, American soldier and journalist (d. 2009)\n*1912 – Marta Eggerth, Jewish-Hungarian-American actress and singer (d. 2013)\n*1914 – George Davis, American art director (d. 1984)\n*  1914   – Mac Raboy, American illustrator (d. 1967)\n*1915 – Sirimavo Bandaranaike, Sri Lankan politician, 6th Prime Minister of Sri Lanka (d. 2000)\n*  1915   – Martin Clemens, Scottish soldier (d. 2009)\n*  1915   – Joe Foss, American general and politician, 20th Governor of South Dakota (d. 2003)\n*  1915   – Regina Ghazaryan, Armenian painter (d. 1999)\n*1916 – Win Maung, 3rd President of Union of Myanmar (d. 1989)\n*  1916   – A. Thiagarajah, Sri Lankan educator and politician (d. 1981)\n*1918 – William Holden, American actor (d. 1981)\n*1919 – Gilles Lamontagne, Canadian lieutenant and politician, 24th Lieutenant Governor of Quebec (d. 2016)\n*  1919   – Chavela Vargas, Costa Rican-Mexican singer-songwriter and actress (d. 2012)\n*1920 – Edmonde Charles-Roux, French journalist and author (d. 2016)\n*1923 – Lindsay Anderson, English actor, director, and screenwriter (d. 1994)\n*  1923   – Solly Hemus, American baseball player, coach, and manager (d. 2017)\n*  1923   – Neville McNamara, Australian air marshal (d. 2014)\n*  1923   – Gianni Raimondi, Italian lyric tenor (d. 2008)\n*  1923   – Harry Reasoner, American soldier and journalist (d. 1991)\n*1924 – Kenneth Norman Jones, Australian public servant\n*  1924   – Donald Richie, American-Japanese author and critic (d. 2013)\n*1925   – René Moawad, Lebanese lawyer and politician, 13th President of Lebanon (d. 1989)\n*1926 – Joan Lorring, British actress (d. 2014)\n*  1926   – Gerry McNeil, Canadian ice hockey player and manager (d. 2004)\n*1927 – Margot Honecker, East German politician and First Lady (d. 2016)\n*1928 – Victor Lownes, American businessman (d. 2017)\n*  1928   – Cynthia Ozick, American short story writer, novelist, and essayist\n*  1928   – Heinz Putzl, Austrian fencer\n*  1928   – Fabien Roy, Canadian accountant and politician\n*1929 – James Last, German-American bassist, composer, and bandleader (d. 2015)\n*1930 – Chris Barber, English trombonist and bandleader\n*1931 – John Barrett, English tennis player and sportscaster\n*  1931   – Malcolm Browne, American journalist and photographer (d. 2012)\n*1934 – Don Kirshner, American songwriter and producer (d. 2011)\n*  1934   – Peter Morris, Australian-English surgeon and academic\n*1935 – Bud Paxson, American broadcaster, founded Home Shopping Network and Pax TV (d. 2015)\n*1937 – Ronald Hamowy, Canadian historian and academic (d. 2012)\n*  1937   – Ferdinand Piëch, Austrian-German engineer and businessman\n*1938 – Ben Barnes, American businessman and politician, 36th Lieutenant Governor of Texas\n*  1938   – Doug Lewis, Canadian lawyer and politician, 41st Canadian Minister of Justice\n*  1938   – Ronald H. Miller, American theologian, author, and academic (d. 2011)\n*  1938   – Kerry Wendell Thornley, American theorist and author (d. 1988)\n*1939 – Robert Miller, American art dealer (d. 2011)\n*1940 – Eric Dancer, English businessman and politician, Lord Lieutenant of Devon\n*  1940   – Billy Fury, English singer-songwriter (d. 1983)\n*  1940   – John McCririck, English journalist\n*  1940   – Chuck Menville, American animator and screenwriter (d. 1992)\n*  1940   – Anja Silja, German soprano and actress\n*  1940   – Agostino Vallini, Italian cardinal and vicar general of Rome\n*1941 – Lagle Parek, Estonian architect and politician, Estonian Minister of the Interior\n*1942 – Buster Williams, American jazz musician \n*1943 – Richard Allen Epstein, American lawyer, author, and academic\n*1946 – Clare Francis, English sailor and author\n*1947 – Nigel Emslie, Lord Emslie, Scottish lawyer and judge\n*  1947   – Richard Field, English lawyer and judge\n*  1947   – Sherrie Levine, American photographer\n*  1947   – Tsutomu Wakamatsu, Japanese baseball player, coach, and manager\n*1948 – Jan Hammer, Czech pianist, composer, and producer\n*  1948   – Alice Harden, American educator and politician (d. 2012)\n*  1948   – Pekka Vasala, Finnish runner\n*1951 – Olivia Hussey, Argentinian-English actress\n*  1951   – Börje Salming, Swedish ice hockey player and businessman\n*1952 – Joe Alaskey, American voice actor (d. 2016)\n*  1952   – Pierre Guité, Canadian ice hockey player\n*  1952   – John McColl, English general and politician, Lieutenant Governor of Jersey\n*  1952   – Željko Ražnatović, Serbian commander (d. 2000)\n*  1952   – John Robertson, Scottish businessman and politician\n*1954 – Riccardo Patrese, Italian race car driver\n*  1954   – Roddy Piper, Canadian professional wrestler and actor (d. 2015)\n*  1954   – Michael Sembello, American singer-songwriter and guitarist\n*1955 – Todd Lickliter, American basketball player and coach\n*  1955   – Pete Shelley, English singer-songwriter and guitarist \n*  1955   – Mike Stroud, English physician and explorer\n*1956 – Colin Tyre, Lord Tyre, Scottish lawyer and judge\n*1957 – Teri Austin, Canadian actress\n*  1957   – Afrika Bambaataa, American disc jockey\n*  1957   – Nick Hornby, English novelist, essayist, lyricist, and screenwriter\n*  1957   – Julia Macur, English lawyer and judge\n*  1957   – Frank McDonough, British historian\n*1958 – Laslo Babits, Canadian javelin thrower (d. 2013)\n*1959 – Sean Bean, English actor\n*  1959   – Jimmy Mann, Canadian ice hockey player\n*  1959   – Li Meisu, Chinese shot putter\n*1960 – Vladimir Polyakov, Russian pole vaulter\n*1961 – Frank J. Christensen, American labor union leader\n*  1961   – Norman Cowans, Jamaican-English cricketer\n*  1961   – Boomer Esiason, American football player and sportscaster\n*  1961   – Bella Freud, English fashion designer\n*1962 – Paul Nicholls, English jockey and trainer\n*1964 – Ken Daneyko, Canadian ice hockey player and sportscaster\n*  1964   – Maynard James Keenan, American singer-songwriter and producer \n*  1964   – Rachel Notley, Canadian politician\n*  1964   – Lela Rochon, American actress \n*1967 – Kimberly Elise, American actress\n*  1967   – Marquis Grissom, American baseball player and coach\n*  1967   – Ian Jones, New Zealand rugby player\n*  1967   – Barnaby Joyce, Australian politician, 17th Deputy Prime Minister of Australia\n*  1967   – Liz Phair, American singer-songwriter and guitarist\n*1968 – Julie Fagerholt, Danish fashion designer\n*  1968   – Phil Henderson, American basketball player and coach (d. 2013)\n*  1968   – Eric Lamaze, Canadian jockey\n*  1968   – Roger Twose, New Zealand cricketer\n*  1968   – Richie Woodhall, English boxer and trainer\n*1970 – Redman, American rapper, producer, and actor \n*1971 – Claire Sweeney, English actress \n*1972 – Gary Bennett, American baseball player\n*  1972   – Tony Boselli, American football player and sportscaster\n*  1972   – Jennifer Garner, American actress \n*  1972   – Muttiah Muralitharan, Sri Lankan cricketer\n*  1972   – Yuichi Nishimura, Japanese footballer and referee\n*  1972   – Terran Sandwith, Canadian ice hockey player\n*1973 – Katrin Koov, Estonian architect\n*  1973   – Brett Maher, Australian basketball player and sportscaster\n*  1973   – Theo Ratliff, American basketball player\n*1974 – Mikael Åkerfeldt, Swedish singer-songwriter, guitarist, and producer \n*  1974   – Victoria Beckham, English singer and fashion designer \n*1975 – Heidi Alexander, English politician\n*  1975   – Travis Roy, American ice hockey player\n*1976 – Maurice Wignall, Jamaican hurdler and long jumper\n*1977 – Chad Hedrick, American speed skater\n*  1977   – Phil Jamieson, Australian singer-songwriter and guitarist \n*  1977   – Frederik Magle, Danish composer, organist, and pianist\n*1978 – Monika Bergmann-Schmuderer, German skier\n*  1978   – Lindsay Hartley, American actress\n*  1978   – Jason White, Scottish rugby player\n*1979 – Eric Brewer, Canadian ice hockey player\n*  1979   – Marija Šestak, Serbian-Slovenian triple jumper\n*1980 – Fabián Vargas, Colombian footballer\n*  1980   – Curtis Woodhouse, English footballer, boxer, and manager\n*1981 – Jenny Meadows, English runner\n*  1981   – Hanna Pakarinen, Finnish singer-songwriter\n*  1981   – Ryan Raburn, American baseball player\n*  1981   – Chris Thompson, English runner\n*  1981   – Zhang Yaokun, Chinese footballer\n*1982 – Brad Boyes, Canadian ice hockey player\n*  1982   – Chuck Kobasew, Canadian ice hockey player\n*1983 – Stanislav Chistov, Russian ice hockey player\n*  1983   – Roberto Jiménez, Peruvian footballer\n*  1983   – Andrea Marcato, Italian rugby player\n*1984 – Pablo Sebastián Álvarez, Argentinian footballer\n*  1984   – Jed Lowrie, American baseball player\n*  1984   – Raffaele Palladino, Italian footballer\n*1985 – Rooney Mara, American actress\n*  1985   – Luke Mitchell, Australian actor and model\n*  1985   – Jo-Wilfried Tsonga, French tennis player\n*1986 – Romain Grosjean, French race car driver\n*1988 – Takahiro Moriuchi, Japanese singer-songwriter \n*1989 – Paraskevi Papachristou, Greek triple jumper\n*1990 – Jonathan Brown, Welsh footballer\n*1992 – Lachlan Maranta, Australian rugby league footballer\\\n\nDeaths\n\n* 485 – Proclus, Greek mathematician and philosopher (b. 412)\n* 617 – Donnán of Eigg, Irish priest and saint\n* 648 – Xiao, empress of the Sui Dynasty\n* 744 – Al-Walid II, Umayyad caliph (b. 706)\n* 818 – Bernard of Italy, Frankish king (b. 797)\n* 858 – Benedict III, pope of the Catholic Church\n*1080 – Harald III of Denmark (b. 1041)\n*1111 – Robert of Molesme, Christian saint and abbot (b. 1027)\n*1298 – Árni Þorláksson, Icelandic bishop (b. 1237)\n*1321 – Infanta Branca of Portugal, daughter of King Afonso III of Portugal (b. 1259)\n*1331 – Robert de Vere, 6th Earl of Oxford, English nobleman (b. 1257)\n*1344 – Constantine II, King of Armenia\n*1355 – Marin Falier, Doge of Venice (b. 1285)\n*1427 – John IV, Duke of Brabant (b. 1403)\n*1539 – George, Duke of Saxony (b. 1471)\n*1574 – Joachim Camerarius, German scholar and translator (b. 1500)\n*1669 – Antonio Bertali, Italian violinist and composer (b. 1605)\n*1680 – Kateri Tekakwitha, Mohawk-born Native American saint (b. 1656)\n*1695 – Juana Inés de la Cruz, Mexican poet and scholar (b. 1651)\n*1696 – Marie de Rabutin-Chantal, marquise de Sévigné, French author (b. 1626)\n*1711 – Joseph I, Holy Roman Emperor (b. 1678)\n*1713 – David Hollatz, Polish pastor and theologian (b. 1648)\n*1742 – Arvid Horn, Swedish general and politician (b. 1664)\n*1764 – Johann Mattheson, German lexicographer and composer (b. 1681)\n*1790 – Benjamin Franklin, American inventor, publisher, and politician, 6th President of Pennsylvania (b. 1706)\n*1799 – Richard Jupp, English surveyor and architect (b. 1728)\n*1840 – Hannah Webster Foster, American journalist and author (b. 1758)\n*1843 – Samuel Morey, American engineer (b. 1762)\n*1882 – George Jennings, English engineer and plumber, invented the Flush toilet (b. 1810)\n*1888 – E. G. Squier, American archaeologist and journalist (b. 1821)\n*1892 – Alexander Mackenzie, Scottish-Canadian journalist and politician, 2nd Prime Minister of Canada (b. 1822)\n*1921 – Manwel Dimech, Maltese journalist, author, and philosopher (b. 1860)\n*1923 – Laurence Ginnell, Irish lawyer and politician (b. 1852)\n*1930 – Alexander Golovin, Russian painter and stage designer (b. 1863)\n*1933 – Kote Marjanishvili, Georgian director and playwright (b. 1872)\n*1936 – Charles Ruijs de Beerenbrouck, Dutch lawyer and politician, 28th Prime Minister of the Netherlands (b. 1873)\n*1942 – Jean Baptiste Perrin, French-American physicist and chemist, Nobel Prize laureate (b. 1870)\n*1944 – J. T. Hearne, English cricketer and coach (b. 1867)\n*  1944   – Dimitrios Psarros, Greek lieutenant, founded the National and Social Liberation (b. 1893)\n*1946 – Juan Bautista Sacasa, Nicaraguan medical doctor, politician and 20th President of Nicaragua (b. 1874)\n*1948 – Suzuki Kantarō, Japanese admiral and politician, 42nd Prime Minister of Japan (b. 1868)\n*1954 – Lucrețiu Pătrășcanu, Romanian lawyer and politician, Romanian Minister of Justice (b. 1900)\n*1960 – Eddie Cochran, American singer-songwriter and guitarist (b. 1938)\n*1961 – Elda Anderson, American physicist and health researcher (b. 1899)\n*1967 – Red Allen, American singer and trumpet player (b. 1908)\n*1975 – Sarvepalli Radhakrishnan, Indian philosopher and politician, 2nd President of India (b. 1888)\n*1976 – Henrik Dam, Danish biochemist and physiologist, Nobel Prize laureate (b. 1895)\n*1977 – William Conway, Irish cardinal (b. 1913)\n*1983 – Felix Pappalardi, American singer-songwriter, bass player, and producer (b. 1939)\n*1984 – Claude Provost, Canadian-American ice hockey player (b. 1933)\n*1987 – Cecil Harmsworth King, English publisher (b. 1901)\n*  1987   – Dick Shawn, American actor (b. 1923)\n*1988 – Louise Nevelson, Ukrainian-American sculptor and educator (b. 1900)\n*1990 – Ralph Abernathy, American minister and activist (b. 1936)\n*1993 – Turgut Özal, Turkish engineer and politician, 8th president of Turkey (b. 1927)\n*1994 – Roger Wolcott Sperry, American psychologist and biologist, Nobel Prize laureate (b. 1913)\n*1995 – Frank E. Resnik, American sergeant and businessman (b. 1928)\n*1996 – Piet Hein, Danish poet and mathematician (b. 1905)\n*1997 – Chaim Herzog, Israeli general, lawyer, and politician, 6th President of Israel (b. 1918)\n*1998 – Linda McCartney, American photographer, activist, and musician (b. 1941)\n*2003 – Robert Atkins, American physician and cardiologist, created the Atkins diet (b. 1930)\n*  2003   – H. B. Bailey, American race car driver (b. 1936)\n*  2003   – John Paul Getty, Jr., American-English philanthropist (b. 1932)\n*  2003   – Earl King, American blues singer, guitarist and songwriter (b. 1934)\n*  2003   – Yiannis Latsis, Greek businessman (b. 1910)\n*2004 – Edmond Pidoux, Swiss author and poet (b. 1908)\n*2006 – Jean Bernard, French physician and haematologist (b. 1907)\n*  2006   – Scott Brazil, American director and producer (b. 1955)\n*  2006   – Henderson Forsythe, American actor (b. 1917)\n*2007 – Kitty Carlisle, American actress, singer, socialite and game show panelist (b. 1910)\n*2008 – Aimé Césaire, Caribbean-French poet and politician (b. 1913)\n*  2008   – Danny Federici, American organist and accordion player (b. 1950)\n*2011 – Eric Gross, Austrian-Australian pianist and composer (b. 1926)\n*  2011   – Michael Sarrazin, Canadian actor (b. 1940)\n*  2011   – Robert Vickrey, American artist and author (b. 1926)\n*2012 – Leila Berg, English journalist and author (b. 1917)\n*  2012   – J. Quinn Brisben, American educator and politician (b. 1934)\n*  2012   – Dimitris Mitropanos, Greek singer (b. 1948)\n*  2012   – Nityananda Mohapatra, Indian journalist, poet, and politician (b. 1912)\n*  2012   – Jonathan V. Plaut, American rabbi and author (b. 1942)\n*  2012   – Stanley Rogers Resor, American soldier, lawyer, and politician, 9th United States Secretary of the Army (b. 1917)\n*2013 – Carlos Graça, São Toméan politician, Prime Minister of São Tomé and Príncipe (b. 1931)\n*  2013   – Yngve Moe, Norwegian bass player and songwriter (b. 1957)\n*  2013   – V. S. Ramadevi, Indian politician, 13th Governor of Karnataka (b. 1934)\n*2014 – Gabriel García Márquez, Colombian journalist and author, Nobel Prize laureate (b. 1927)\n*  2014   – Bernat Klein, Serbian-Scottish fashion designer and painter (b. 1922)\n*  2014   – Wojciech Leśnikowski, Polish–American architect and academic (b. 1938)\n*  2014   – Karpal Singh, Malaysian lawyer and politician (b. 1940)\n*2015 – Izzat Ibrahim al-Douri, Iraqi field marshal and politician (b. 1942)\n*  2015   – Francis George, American cardinal (b. 1937)\n*  2015   – Robert P. Griffin, American soldier, lawyer, and politician (b. 1923)\n*  2015   – Scotty Probasco, American businessman and philanthropist (b. 1928)\n*  2015   – Jeremiah J. Rodell, American general (b. 1921)\n*  2015   – A. Alfred Taubman, American businessman and philanthropist (b. 1924)\n*2016 – Doris Roberts, American actress (b. 1925)\n\nHolidays and observances\n\n*Christian feast day:\n**Kateri Tekakwitha (Canada)\n**Stephen Harding\n**April 17 (Eastern Orthodox liturgics)\n*Earliest day on which Store Bededag or General Prayer Day can fall, while May 13 is the latest; observed on the 4th Friday after Easter. (Denmark)\n*Evacuation Day (Syria), celebrates the recognition of the independence of Syria from France in 1946.\n*FAO Day (Iraq)\n*Flag Day (American Samoa)\n*Malbec World Day \n*Women's Day (Gabon)\n*World Hemophilia Day. April 17. http://en.wikipedia.org/?curid=1974."
  }
}
