{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10861",
  "eid" : "f82c6c30-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778496115,
  "textBody" : "The Trial (original German title: , later ,  and ) is a novel written by Franz Kafka between 1914 and 1915 and published posthumously in 1925. One of his best-known works, it tells the story of a man arrested and prosecuted by a remote, inaccessible authority, with the nature of his crime revealed neither to him nor to the reader. Heavily influenced by Dostoyevsky's Crime and Punishment and The Brothers Karamazov, Kafka even went so far as to call Dostoyevsky a blood relative.Bridgwater, Patrick (2003). Kafka: Gothic and Fairytale. Rodopi. p. 9. . Like Kafka's other novels, The Trial was never completed, although it does include a chapter which brings the story to an end.\n\nAfter Kafka's death in 1924 his friend and literary executor Max Brod edited the text for publication by Verlag Die Schmiede. The original manuscript is held at the Museum of Modern Literature, Marbach am Neckar, Germany. The first English language translation, by Willa and Edwin Muir, was published in 1937. In 1999, the book was listed in Le Mondes 100 Books of the Century and as No. 2 of the Best German Novels of the Twentieth Century.\n\nPlot\n\nOn his thirtieth birthday, the chief cashier of a bank, Josef K., is unexpectedly arrested by two unidentified agents from an unspecified agency for an unspecified crime. The agents' boss later arrives and holds a mini-tribunal in the room of K.'s neighbor, Fräulein Bürstner. K. is not taken away, however, but left \"free\" and told to await instructions from the Committee of Affairs. He goes to work, and that night apologizes to Fräulein Bürstner for the intrusion into her room. At the end of the conversation he suddenly kisses her.\n\nK. receives a phone call summoning him to court, and the coming Sunday is arranged as the date. No time is set, but the address is given to him. The address turns out to be a huge tenement building. K. has to explore to find the court, which turns out to be in the attic. The room is airless, shabby and crowded, and although he has no idea what he is charged with, or what authorizes the process, K. makes a long speech denigrating the whole process, including the agents who arrested him; during this speech an attendant's wife and a man engage in sexual activities. K. then returns home.\n\nK. later goes to visit the court again, although he has not been summoned, and finds that it is not in session. He instead talks with the attendant's wife, who attempts to seduce him into taking her away, and who gives him more information about the process and offers to help him. K. later goes with the attendant to a higher level of the attic where the shabby and airless offices of the court are housed.\n\nK. returns home to find Fräulein Montag, a lodger from another room, moving in with Fräulein Bürstner. He suspects that this is to prevent him from pursuing his affair with the latter woman. Yet another lodger, Captain Lanz, appears to be in league with Montag.\n\nLater, in a store room at his own bank, K. discovers the two agents who arrested him being whipped by a flogger for asking K. for bribes and as a result of complaints K. made at court. K. tries to argue with the flogger, saying that the men need not be whipped, but the flogger cannot be swayed. The next day he returns to the store room and is shocked to find everything as he had found it the day before, including the whipper and the two agents.\n\nK. is visited by his uncle, who was K.'s guardian. The uncle seems distressed by K.'s predicament. At first sympathetic, he becomes concerned that K. is underestimating the seriousness of the case. The uncle introduces K. to a lawyer, who is attended by Leni, a nurse, whom K.'s uncle suspects is the advocate's mistress. During the discussion it becomes clear how different this process is from regular legal proceedings: guilt is assumed, the bureaucracy running it is vast with many levels, and everything is secret, from the charge, to the rules of the court, to the authority behind the courts – even the identity of the judges at the higher levels. The attorney tells him that he can prepare a brief for K., but since the charge is unknown and the rules are unknown, it is difficult work. It also never may be read, but is still very important. The lawyer says that his most important task is to deal with powerful court officials behind the scenes. As they talk, the lawyer reveals that the Chief Clerk of the Court has been sitting hidden in the darkness of a corner. The Chief Clerk emerges to join the conversation, but K. is called away by Leni, who takes him to the next room, where she offers to help him and seduces him. They have a sexual encounter. Afterwards K. meets his uncle outside, who is angry, claiming that K.'s lack of respect has hurt K.'s case.\n\nK. visits the lawyer several times. The lawyer tells him incessantly how dire his situation is and tells many stories of other hopeless clients and of his behind-the-scenes efforts on behalf of these clients, and brags about his many connections. The brief is never complete. K.'s work at the bank deteriorates as he is consumed with worry about his case.\n\nK. is surprised by one of his bank clients, who tells K. that he is aware that K. is dealing with a trial. The client learned of K.'s case from Titorelli, a painter, who has dealings with the court and told the client about K.'s case. The client advises K. to go to Titorelli for advice. Titorelli lives in the attic of a tenement in a suburb on the opposite side of town from the court that K. visited. Three teenage girls taunt K. on the steps and tease him sexually. Titorelli turns out to be an official painter of portraits for the court (an inherited position), and has a deep understanding of the process. K. learns that, to Titorelli's knowledge, not a single defendant has ever been acquitted. He sets out K.'s options and offers to help K. with either. The options are: obtain a provisional verdict of innocence from the lower court, which can be overturned at any time by higher levels of the court, which would lead to re-initiation of the process; or curry favor with the lower judges to keep the process moving at a glacial pace. Titorelli has K. leave through a small back door, as the girls are blocking the door through which K. entered. To K.'s shock, the door opens into another warren of the court's offices – again shabby and airless.\n\nK. decides to take control of matters himself and visits his lawyer with the intention of dismissing him. At the lawyer's office he meets a downtrodden individual, Block, a client who offers K. some insight from a client's perspective. Block's case has continued for five years and he has gone from being a successful businessman to being almost bankrupt and is virtually enslaved by his dependence on the lawyer and Leni, with whom he appears to be sexually involved. The lawyer mocks Block in front of K. for his dog-like subservience. This experience further poisons K.'s opinion of his lawyer. (This chapter was left unfinished by the author.)\n\nK. is asked by the bank to show an Italian client around local places of cultural interest, but the Italian client, short of time, asks K. to take him only to the cathedral, setting a time to meet there. When the client does not show up, K. explores the cathedral, which is empty except for an old woman and a church official. K. notices a priest who seems to be preparing to give a sermon from a small second pulpit, and K. begins to leave, lest it begin and K. be compelled to stay for its entirety. Instead of giving a sermon, the priest calls out K.'s name. K. approaches the pulpit and the priest berates him for his attitude toward the trial and for seeking help, especially from women. K. asks him to come down and the two men walk inside the cathedral. The priest works for the court as a chaplain and tells K. a fable (which was published earlier as \"Before the Law\") that is meant to explain his situation. K. and the priest discuss the parable. The priest tells K. that the parable is an ancient text of the court, and many generations of court officials have interpreted it differently.\n\nOn the eve of K.'s thirty-first birthday, two men arrive at his apartment. He has been waiting for them, and he offers little resistance – indeed the two men take direction from K. as they walk through town. K. leads them to a quarry where the two men place K's head on a discarded block. One of the men produces a double-edged butcher knife, and as the two men pass it back and forth between them, the narrator tells us that \"K. knew then precisely, that it would have been his duty to take the knife... and thrust it into himself.\" He does not take the knife. One of the men holds his shoulder and pulls him up and the other man stabs him in the heart and twists the knife twice. K.'s last words are: \"Like a dog!\".\n\nCharacters\n\n* Josef K. – The tale's protagonist.\n* Fräulein Bürstner – A boarder in the same house as Josef K. She lets him kiss her one night, but then rebuffs his advances. K. briefly catches sight of her, or someone who looks similar to her, in the final pages of the novel.\n* Fräulein Montag – Friend of Fräulein Bürstner, she talks to K. about ending his relationship with Fräulein Bürstner after his arrest. She claims she can bring him insight, because she is an objective third party.\n* Willem and Franz – Officers who arrest K. one morning but refuse to disclose the crime he is said to have committed.\n* Inspector – Man who conducts a proceeding at Josef K.'s boardinghouse to inform K. officially that he is under arrest.\n* Rabinsteiner, Kullich and Kaminer – Junior bank employees who attend the proceeding at the boardinghouse.\n* Frau Grubach – The proprietress of the lodging house in which K. lives. She holds K. in high esteem, despite his arrest.\n* Woman in the Court – In her house happens the first judgment of K. She claims help from K. because she doesn't want to be abused by the magistrates.\n* Student – Deformed man who acts under orders of the instruction judge. Will be a powerful man in the future.\n* Instruction Judge – First Judge of K. In his trial, he confuses K. with a Wall Painter.\n* Uncle Karl – K.'s impetuous uncle from the country, formerly his guardian. Upon learning about the trial, Karl insists that K. hire Herr Huld, the lawyer.\n* Herr Huld, the Lawyer – K.'s pompous and pretentious advocate who provides precious little in the way of action and far too much in the way of anecdote.\n* Leni – Herr Huld's nurse, she has feelings for Josef K. and soon becomes his lover. She shows him her webbed hand, yet another reference to the motif of the hand throughout the book. Apparently, she finds accused men extremely attractive—the fact of their indictment makes them irresistible to her.\n* Albert – Office director at the court and a friend of Huld.\n* Flogger – Man who punishes Franz and Willem in the Bank after K's. complaints against the two agents in his first Judgement.\n* Vice-President – K.'s unctuous rival at the Bank, only too willing to catch K. in a compromising situation. He repeatedly takes advantage of K.'s preoccupation with the trial to advance his own ambitions.\n* President – Manager of the Bank. A sickly figure, whose position the Vice-President is trying to assume. Gets on well with K., inviting him to various engagements.\n* Rudi Block, the Merchant – Block is another accused man and client of Huld. His case is five years old, and he is but a shadow of the prosperous grain dealer he once was. All his time, energy, and resources are now devoted to his case, to the point of detriment to his own life. Although he has hired five additional lawyers on the side, he is completely and pathetically subservient to Huld.\n* Manufacturer – Person who hears about K.'s case and advises him to see a painter who knows how the court system works.\n* Titorelli, the Painter – Titorelli inherited the position of Court Painter from his father. He knows a great deal about the comings and goings of the Court's lowest level. He offers to help K., and manages to unload a few identical landscape paintings on the accused man.\n* Priest – Prison chaplain whom K. encounters in a church. The priest advises K. that his case is going badly and tells him to accept his fate.\n* Doorkeeper and Farmer – The characters of the Chaplain's Tale.\n\nInterpretation\n\nTrying to pinpoint Franz Kafka's The Trial to one clear-cut interpretation seems impossible. The novel leaves enough room for several interpretations from different angles. Generally, there are five major perspectivesKrieschel, p. 108–110 :\n* biographical\n* historical-critical: against the background of the social tensions in Austria-Hungary prior to the outbreak of World War I\n* religious: especially regarding Kafka’s Jewish descent\n* psychoanalytical: The Trial as a symbol of the awareness and projection of an inner process (in German, the word Prozess can refer to both a trial and a process)\n* political and sociological: as a criticism of an autonomous and inhuman bureaucracy and of a lack of civil rights\n\nConcerning these categories, however, there is one important point that should not be overlooked. Although the diverse studies theorizing about the novel provide valuable insights, they are often impeded by the critics' eagerness to squeeze these insights into a frame which, ultimately, is beyond the novel’s text.M.Müller /von Jagow p. 528 This, by the way, is not a phenomenon unique to The Trial. \nKafka’s novel The Castle shows similar tendencies as well. Only later interpretations, e.g. by the German writer Martin Walser, express an increasing demand for a strictly text-based view.Krieschel p. 111  Current works, e.g. by the contemporary literary critic Peter-André Alt, go into the same direction.\n\nRelations to other texts by Kafka\n\nThe myth of guilt and judgement discussed in The Trial has its cultural roots in the Hasidic tradition, where tales of plaintiff and defendant, heavenly judgement and punishment, unfathomable authorities and obscure charges are not uncommon.\n\nFirst of all, there are many parallels between Kafka’s The Trial and his other major novel, The Castle. In both novels, the protagonist wanders through a labyrinth that seems to be designed to make him fail or even seems to have no relation to him at all.Louis Begley p. 297 Ill, bedridden men explain the system in lengthy terms. Erotically charged female figures turn to the protagonist in a demanding way.\n\nWritten around the same time, in October 1914, the short story In the Penal Colony bears close resemblance to The Trial. In both cases, the delinquent does not know what he is charged with. A single person – an officer with a gruesome machine – seems to be accuser, judge and executor in one.\n\nThe idea that a single executioner could be enough to arbitrarily replace the entire court is exactly what Josef K. is frightened about.Cerstin Urban p. 43.\n\nThree years later, Kafka wrote the parable The Knock at the Manor Gate, which almost appears to be an abridged version of The Trial. An action is brought out of nowhere or without any reason and it ends in a disastrous entanglement and inevitable punishment. Fate strikes the narrator by chance in the middle of everyday life. Kafka scholar Ralf Sudau states that \"[a] sense of punishment or perhaps an unconscious demand for punishment [...] and a tragic or absurd downfall are signalled in this context.\" (\"Ein Vorgefühl von Strafe oder vielleicht ein unbewußtes Strafverlangen [...] und ein tragischer oder absurder Untergang werden dabei signalisiert.\")\n\nIndividual aspects \n\nShort text analysis \n\nFor Josef K., the court is an anonymous and unfamiliar power. Unlike the courthouse in the Palace of Justice, this court is characterized by widely branched, impenetrable hierarchies. There seems to be an infinite number of instances and K. only gets in contact with the lowest ones. In spite of his efforts, K. is unable to discover the court's nature. The clergyman’s words in the cathedral (“The court doesn’t want anything from you. It takes you in when you come and sets you free when you leave”) don’t provide any help. Could K. simply evade the court? His reality looks different. For K., the court remains mysterious and not really explicable.\n\nJosef K. has to confront a cold world that puts him off. While the main character in Kafka’s parable Before the Law is asking fleas for help, Josef K. turns to women, a painter and advocates to help him. However, they only feign their influence and keep him waiting. In this way, the people K. is asking for help act like the door-keeper in said parable. They all accept presents from the main character, but only to put him off and to not disillusion him in believing that acting in this way will help his cause.\n\nDiversity of interpretations \n\nLike in Kafka’s novel The Castle, the range of manifold interpretations may only be covered selectively and not conclusively. \n\nOne possible interpretative approach is to read the novel autobiographically. This claim is supported by the similarities in the initials of Fräulein Bürstner and Felice Bauer. Elias Canetti points out that the intensely detailed description of the court system hints at Kafka’s work as an insurance lawyer.von Jagow/Jahrhaus/Hiebel reference to Canetti: Der andere Prozess. p. 458. \n\nTheodor W. Adorno takes the opposite view. According to him, The Trial does not tell the story of an individual fate but rather contains wide-reaching political and visionary aspects and can be read as a vision predicting the Nazi terror.von Jagow/Jahrhaus/Hiebel reference to Adorno: Aufzeichnungen zu Kafka. p. 459. \n\nGerman scholar Claus Hebell offers a synthesis of these two positions and demonstrates that the negotiating strategy used by the bureaucratic court system during the process to demoralize Kafka is reminiscent of the deficiencies in the Austro-Hungarian Empire’s judicial system.Claus Hebell: Rechtstheoretische und geistesgeschichtliche Voraussetzungen für das Werk Franz Kafkas, analysiert an dem Roman „Der Prozeß“. Doctoral thesis, Munich 1981, , ([http://uni-coach-und-texter.de/der-roman-der-prozess-von-franz-kafka-umsetzung-konkreter-strafjustiz-in-die-romanstruktur-von-claus-hebell/ Online])\n\nA few selected aspects of interpretation \n\nOver the course of the novel, it becomes evident that K. and the court do not face each other as distinct separate entities but that they are interweaved. This interweaving between K. and the court system increasingly intensifies throughout the novel. Towards the end of The Trial, K. realizes that everything that is happening stems from his inner selfPeter-André Alt, p. 417. and is the result of feelings of guilt and fantasies of punishment.\n\nWorth mentioning is also the dreamlike component of the events: Like in a dream, K.'s interior and exterior world intermingle.von Jagow/Jahrhaus/Hiebel, p. 462. A transition from the fantastic-realistic to the allegorical-psychological level can be made out. Even K.’s working environment is increasingly undermined by the fantastic, dreamlike world. It is, for example, a work order that leads to K.’s encounter with the priest.\n\nSexual references\n\nThe protagonist's feelings of guilt are likely to be rooted in the views on sexuality that prevailed at the beginning of the 20th century and are mirrored in the works of Sigmund Freud. According to Peter-André Alt, \"sexuality and K.'s trial are connected in remarkable ways.\" Women are portrayed as sirens, the representatives of the court as lecherous. K. himself cannot control his lust for Fräulein Bürstner. \n\nFurthermore, critics identified homoerotic elements in the text, for instance K.'s ironic and almost loving view of his director. Elegant or tight-fitting clothes on men are mentioned several times throughout the novel. The half-naked flogger punishing the officers Willem and Franz, who are naked as well, resembles sadomasochism.\n\n The Trial as a humorous story\n\nAccording to Kafka's friends, he laughed out loud several times while reading from his book.Max Brod's Franz Kafka. Eine Biographie (1974 edition Über Franz Kafka) It is thus reasonable to look for humorous aspects in The Trial despite its dark and serious essence. \n\nThis phenomenon is also addressed by Kafka biographer Reiner Stach:  The Trial \"is gruesome in its entirety, but comical in its details.\"Reiner Stach/Entscheidungen p. 554 The judges read porn magazines instead of law books and send for women as if they were ordering a splendid meal on a tray. The executioners look like ageing tenors. Due to a hole in the floor of one of the courtrooms, an advocate's leg protrudes into the room below from time to time.\n\nFilm adaptations\n\n* In the 1962 film adaptation by Orson Welles, Josef K. is played by Anthony Perkins and The Advocate by Welles himself.\n* Martin Scorsese's 1985 film After Hours contains a scene adapted from \"Before the Law\", in which the protagonist is trying to get into a nightclub called Club Berlin.\n* The 1993 film of The Trial was based on Harold Pinter's screenplay adaptation and starred Kyle MacLachlan as Josef K and Anthony Hopkins as The Priest.\n* The 2017 science fiction film Blade Runner 2049 features a protagonist named Agent K, who is also referred to as \"Joe\" and dies as a result of being stabbed, similar to Josef K in The Trial.https://medium.com/@_tomchristie/inside-the-kaleidoscope-mirrored-heart-of-blade-runner-2049-62ee229acc14\n\nRadio adaptations\n\n*On May 19, 1946, Columbia Workshop broadcast an adaptation of The Trial by Davidson Taylor with an original musical score by Bernard Herrmann and starring Karl Swenson as Joseph K.http://www.digitaldeliftp.com/DigitalDeliToo/dd2jb-Columbia-Workshop.html\n* In 1982, Mike Gwilym starred as Josef K with Miriam Margolyes as Leni in an adaptation on BBC Radio 4 dramatised for radio by Hanif Kureishi.\n* Sam Troughton starred as Joseph Kay in a new adaptation by Mark Ravenhill titled The Process directed by Polly Thomas and broadcast on 10 May 2015 on BBC Radio 3's Drama on 3 program.\n\nStage adaptations\n\n* The writer and director Steven Berkoff adapted several of Kafka's novels into plays and directed them for stage. His version of The Trial was first performed in 1970 in London and published in 1981.Berkoff, Steven. \"The Trial, Metamorphosis, In the Penal Colony. Three theatre adaptions from Franz Kafka.\" Oxford: Amber Lane Press, 1981.\n*Chicago based writer, Greg Allen, wrote and directed K., based on The Trial. It was produced by The Hypocrites and ran for several months in 2010 at The Chopin Theater in Chicago.[http://leisureblogs.chicagotribune.com/the_theater_loop/2010/10/k-by-the-hypocrites-greg-allens-k-can-be-unfeeling-but-it-showed-the-way.html \"'K.' by The Hypocrites: Greg Allen's 'K.' can be unfeeling, but it showed the way\"] by Chris Jones, Chicago Tribune (26 October 2010)\n* Joseph K, written by Tom Basden and based on The Trial, takes place in modern-day London, with the protagonist cast as a City banker. It ran at the Gate Theatre, Notting Hill, London, in late 2010.[https://www.theguardian.com/stage/2010/nov/17/joseph-k-review \"Joseph K – review\"] by Lynn Gardner, The Guardian (17 November 2010)\n* Gottfried von Einem wrote an opera, Der Prozeß, based on the novel. Its American debut was directed by Otto Preminger.\n* The writer Serge Lamothe adapted The Trial for the stage. Directed by François Girard, his version of The Trial was first performed in 2004 in Montreal and Ottawa, Canada, and published in 2005.\n* Between June and August 2015 The Young Vic theatre in London staged a version of The Trial adapted by Nick Gill and starring Rory Kinnear as K.\n\nSelected publication history\n\n* Oxford World's Classics, 4 October 2009, Translation: Mike Mitchell, \n* Dover Thrift Editions, 22 July 2009, Translation: David Wyllie, \n* Penguin Modern Classics, 29 June 2000, Translation: Idris Parry, \n* Schocken Books, 25 May 1999, Translation: Breon Mitchell,  Translator's preface is available online\n* Everyman's Library, 30 June 1992, Translation: Willa and Edwin Muir,",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "The Trial" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10861" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Trial (original German title: , later ,  and ) is a novel written by Franz Kafka between 1914 and 1915 and published posthumously in 1925. One of his best-known works, it tells the story of a man arrested and prosecuted by a remote, inaccessible authority, with the nature of his crime revealed neither to him nor to the reader. Heavily influenced by Dostoyevsky's Crime and Punishment and The Brothers Karamazov, Kafka even went so far as to call Dostoyevsky a blood relative.Bridgwater, Patrick (2003). Kafka: Gothic and Fairytale. Rodopi. p. 9. . Like Kafka's other novels, The Trial was never completed, although it does include a chapter which brings the story to an end.\n\nAfter Kafka's death in 1924 his friend and literary executor Max Brod edited the text for publication by Verlag Die Schmiede. The original manuscript is held at the Museum of Modern Literature, Marbach am Neckar, Germany. The first English language translation, by Willa and Edwin Muir, was published in 1937. In 1999, the book was listed in Le Mondes 100 Books of the Century and as No. 2 of the Best German Novels of the Twentieth Century.\n\nPlot\n\nOn his thirtieth birthday, the chief cashier of a bank, Josef K., is unexpectedly arrested by two unidentified agents from an unspecified agency for an unspecified crime. The agents' boss later arrives and holds a mini-tribunal in the room of K.'s neighbor, Fräulein Bürstner. K. is not taken away, however, but left \"free\" and told to await instructions from the Committee of Affairs. He goes to work, and that night apologizes to Fräulein Bürstner for the intrusion into her room. At the end of the conversation he suddenly kisses her.\n\nK. receives a phone call summoning him to court, and the coming Sunday is arranged as the date. No time is set, but the address is given to him. The address turns out to be a huge tenement building. K. has to explore to find the court, which turns out to be in the attic. The room is airless, shabby and crowded, and although he has no idea what he is charged with, or what authorizes the process, K. makes a long speech denigrating the whole process, including the agents who arrested him; during this speech an attendant's wife and a man engage in sexual activities. K. then returns home.\n\nK. later goes to visit the court again, although he has not been summoned, and finds that it is not in session. He instead talks with the attendant's wife, who attempts to seduce him into taking her away, and who gives him more information about the process and offers to help him. K. later goes with the attendant to a higher level of the attic where the shabby and airless offices of the court are housed.\n\nK. returns home to find Fräulein Montag, a lodger from another room, moving in with Fräulein Bürstner. He suspects that this is to prevent him from pursuing his affair with the latter woman. Yet another lodger, Captain Lanz, appears to be in league with Montag.\n\nLater, in a store room at his own bank, K. discovers the two agents who arrested him being whipped by a flogger for asking K. for bribes and as a result of complaints K. made at court. K. tries to argue with the flogger, saying that the men need not be whipped, but the flogger cannot be swayed. The next day he returns to the store room and is shocked to find everything as he had found it the day before, including the whipper and the two agents.\n\nK. is visited by his uncle, who was K.'s guardian. The uncle seems distressed by K.'s predicament. At first sympathetic, he becomes concerned that K. is underestimating the seriousness of the case. The uncle introduces K. to a lawyer, who is attended by Leni, a nurse, whom K.'s uncle suspects is the advocate's mistress. During the discussion it becomes clear how different this process is from regular legal proceedings: guilt is assumed, the bureaucracy running it is vast with many levels, and everything is secret, from the charge, to the rules of the court, to the authority behind the courts – even the identity of the judges at the higher levels. The attorney tells him that he can prepare a brief for K., but since the charge is unknown and the rules are unknown, it is difficult work. It also never may be read, but is still very important. The lawyer says that his most important task is to deal with powerful court officials behind the scenes. As they talk, the lawyer reveals that the Chief Clerk of the Court has been sitting hidden in the darkness of a corner. The Chief Clerk emerges to join the conversation, but K. is called away by Leni, who takes him to the next room, where she offers to help him and seduces him. They have a sexual encounter. Afterwards K. meets his uncle outside, who is angry, claiming that K.'s lack of respect has hurt K.'s case.\n\nK. visits the lawyer several times. The lawyer tells him incessantly how dire his situation is and tells many stories of other hopeless clients and of his behind-the-scenes efforts on behalf of these clients, and brags about his many connections. The brief is never complete. K.'s work at the bank deteriorates as he is consumed with worry about his case.\n\nK. is surprised by one of his bank clients, who tells K. that he is aware that K. is dealing with a trial. The client learned of K.'s case from Titorelli, a painter, who has dealings with the court and told the client about K.'s case. The client advises K. to go to Titorelli for advice. Titorelli lives in the attic of a tenement in a suburb on the opposite side of town from the court that K. visited. Three teenage girls taunt K. on the steps and tease him sexually. Titorelli turns out to be an official painter of portraits for the court (an inherited position), and has a deep understanding of the process. K. learns that, to Titorelli's knowledge, not a single defendant has ever been acquitted. He sets out K.'s options and offers to help K. with either. The options are: obtain a provisional verdict of innocence from the lower court, which can be overturned at any time by higher levels of the court, which would lead to re-initiation of the process; or curry favor with the lower judges to keep the process moving at a glacial pace. Titorelli has K. leave through a small back door, as the girls are blocking the door through which K. entered. To K.'s shock, the door opens into another warren of the court's offices – again shabby and airless.\n\nK. decides to take control of matters himself and visits his lawyer with the intention of dismissing him. At the lawyer's office he meets a downtrodden individual, Block, a client who offers K. some insight from a client's perspective. Block's case has continued for five years and he has gone from being a successful businessman to being almost bankrupt and is virtually enslaved by his dependence on the lawyer and Leni, with whom he appears to be sexually involved. The lawyer mocks Block in front of K. for his dog-like subservience. This experience further poisons K.'s opinion of his lawyer. (This chapter was left unfinished by the author.)\n\nK. is asked by the bank to show an Italian client around local places of cultural interest, but the Italian client, short of time, asks K. to take him only to the cathedral, setting a time to meet there. When the client does not show up, K. explores the cathedral, which is empty except for an old woman and a church official. K. notices a priest who seems to be preparing to give a sermon from a small second pulpit, and K. begins to leave, lest it begin and K. be compelled to stay for its entirety. Instead of giving a sermon, the priest calls out K.'s name. K. approaches the pulpit and the priest berates him for his attitude toward the trial and for seeking help, especially from women. K. asks him to come down and the two men walk inside the cathedral. The priest works for the court as a chaplain and tells K. a fable (which was published earlier as \"Before the Law\") that is meant to explain his situation. K. and the priest discuss the parable. The priest tells K. that the parable is an ancient text of the court, and many generations of court officials have interpreted it differently.\n\nOn the eve of K.'s thirty-first birthday, two men arrive at his apartment. He has been waiting for them, and he offers little resistance – indeed the two men take direction from K. as they walk through town. K. leads them to a quarry where the two men place K's head on a discarded block. One of the men produces a double-edged butcher knife, and as the two men pass it back and forth between them, the narrator tells us that \"K. knew then precisely, that it would have been his duty to take the knife... and thrust it into himself.\" He does not take the knife. One of the men holds his shoulder and pulls him up and the other man stabs him in the heart and twists the knife twice. K.'s last words are: \"Like a dog!\".\n\nCharacters\n\n* Josef K. – The tale's protagonist.\n* Fräulein Bürstner – A boarder in the same house as Josef K. She lets him kiss her one night, but then rebuffs his advances. K. briefly catches sight of her, or someone who looks similar to her, in the final pages of the novel.\n* Fräulein Montag – Friend of Fräulein Bürstner, she talks to K. about ending his relationship with Fräulein Bürstner after his arrest. She claims she can bring him insight, because she is an objective third party.\n* Willem and Franz – Officers who arrest K. one morning but refuse to disclose the crime he is said to have committed.\n* Inspector – Man who conducts a proceeding at Josef K.'s boardinghouse to inform K. officially that he is under arrest.\n* Rabinsteiner, Kullich and Kaminer – Junior bank employees who attend the proceeding at the boardinghouse.\n* Frau Grubach – The proprietress of the lodging house in which K. lives. She holds K. in high esteem, despite his arrest.\n* Woman in the Court – In her house happens the first judgment of K. She claims help from K. because she doesn't want to be abused by the magistrates.\n* Student – Deformed man who acts under orders of the instruction judge. Will be a powerful man in the future.\n* Instruction Judge – First Judge of K. In his trial, he confuses K. with a Wall Painter.\n* Uncle Karl – K.'s impetuous uncle from the country, formerly his guardian. Upon learning about the trial, Karl insists that K. hire Herr Huld, the lawyer.\n* Herr Huld, the Lawyer – K.'s pompous and pretentious advocate who provides precious little in the way of action and far too much in the way of anecdote.\n* Leni – Herr Huld's nurse, she has feelings for Josef K. and soon becomes his lover. She shows him her webbed hand, yet another reference to the motif of the hand throughout the book. Apparently, she finds accused men extremely attractive—the fact of their indictment makes them irresistible to her.\n* Albert – Office director at the court and a friend of Huld.\n* Flogger – Man who punishes Franz and Willem in the Bank after K's. complaints against the two agents in his first Judgement.\n* Vice-President – K.'s unctuous rival at the Bank, only too willing to catch K. in a compromising situation. He repeatedly takes advantage of K.'s preoccupation with the trial to advance his own ambitions.\n* President – Manager of the Bank. A sickly figure, whose position the Vice-President is trying to assume. Gets on well with K., inviting him to various engagements.\n* Rudi Block, the Merchant – Block is another accused man and client of Huld. His case is five years old, and he is but a shadow of the prosperous grain dealer he once was. All his time, energy, and resources are now devoted to his case, to the point of detriment to his own life. Although he has hired five additional lawyers on the side, he is completely and pathetically subservient to Huld.\n* Manufacturer – Person who hears about K.'s case and advises him to see a painter who knows how the court system works.\n* Titorelli, the Painter – Titorelli inherited the position of Court Painter from his father. He knows a great deal about the comings and goings of the Court's lowest level. He offers to help K., and manages to unload a few identical landscape paintings on the accused man.\n* Priest – Prison chaplain whom K. encounters in a church. The priest advises K. that his case is going badly and tells him to accept his fate.\n* Doorkeeper and Farmer – The characters of the Chaplain's Tale.\n\nInterpretation\n\nTrying to pinpoint Franz Kafka's The Trial to one clear-cut interpretation seems impossible. The novel leaves enough room for several interpretations from different angles. Generally, there are five major perspectivesKrieschel, p. 108–110 :\n* biographical\n* historical-critical: against the background of the social tensions in Austria-Hungary prior to the outbreak of World War I\n* religious: especially regarding Kafka’s Jewish descent\n* psychoanalytical: The Trial as a symbol of the awareness and projection of an inner process (in German, the word Prozess can refer to both a trial and a process)\n* political and sociological: as a criticism of an autonomous and inhuman bureaucracy and of a lack of civil rights\n\nConcerning these categories, however, there is one important point that should not be overlooked. Although the diverse studies theorizing about the novel provide valuable insights, they are often impeded by the critics' eagerness to squeeze these insights into a frame which, ultimately, is beyond the novel’s text.M.Müller /von Jagow p. 528 This, by the way, is not a phenomenon unique to The Trial. \nKafka’s novel The Castle shows similar tendencies as well. Only later interpretations, e.g. by the German writer Martin Walser, express an increasing demand for a strictly text-based view.Krieschel p. 111  Current works, e.g. by the contemporary literary critic Peter-André Alt, go into the same direction.\n\nRelations to other texts by Kafka\n\nThe myth of guilt and judgement discussed in The Trial has its cultural roots in the Hasidic tradition, where tales of plaintiff and defendant, heavenly judgement and punishment, unfathomable authorities and obscure charges are not uncommon.\n\nFirst of all, there are many parallels between Kafka’s The Trial and his other major novel, The Castle. In both novels, the protagonist wanders through a labyrinth that seems to be designed to make him fail or even seems to have no relation to him at all.Louis Begley p. 297 Ill, bedridden men explain the system in lengthy terms. Erotically charged female figures turn to the protagonist in a demanding way.\n\nWritten around the same time, in October 1914, the short story In the Penal Colony bears close resemblance to The Trial. In both cases, the delinquent does not know what he is charged with. A single person – an officer with a gruesome machine – seems to be accuser, judge and executor in one.\n\nThe idea that a single executioner could be enough to arbitrarily replace the entire court is exactly what Josef K. is frightened about.Cerstin Urban p. 43.\n\nThree years later, Kafka wrote the parable The Knock at the Manor Gate, which almost appears to be an abridged version of The Trial. An action is brought out of nowhere or without any reason and it ends in a disastrous entanglement and inevitable punishment. Fate strikes the narrator by chance in the middle of everyday life. Kafka scholar Ralf Sudau states that \"[a] sense of punishment or perhaps an unconscious demand for punishment [...] and a tragic or absurd downfall are signalled in this context.\" (\"Ein Vorgefühl von Strafe oder vielleicht ein unbewußtes Strafverlangen [...] und ein tragischer oder absurder Untergang werden dabei signalisiert.\")\n\nIndividual aspects \n\nShort text analysis \n\nFor Josef K., the court is an anonymous and unfamiliar power. Unlike the courthouse in the Palace of Justice, this court is characterized by widely branched, impenetrable hierarchies. There seems to be an infinite number of instances and K. only gets in contact with the lowest ones. In spite of his efforts, K. is unable to discover the court's nature. The clergyman’s words in the cathedral (“The court doesn’t want anything from you. It takes you in when you come and sets you free when you leave”) don’t provide any help. Could K. simply evade the court? His reality looks different. For K., the court remains mysterious and not really explicable.\n\nJosef K. has to confront a cold world that puts him off. While the main character in Kafka’s parable Before the Law is asking fleas for help, Josef K. turns to women, a painter and advocates to help him. However, they only feign their influence and keep him waiting. In this way, the people K. is asking for help act like the door-keeper in said parable. They all accept presents from the main character, but only to put him off and to not disillusion him in believing that acting in this way will help his cause.\n\nDiversity of interpretations \n\nLike in Kafka’s novel The Castle, the range of manifold interpretations may only be covered selectively and not conclusively. \n\nOne possible interpretative approach is to read the novel autobiographically. This claim is supported by the similarities in the initials of Fräulein Bürstner and Felice Bauer. Elias Canetti points out that the intensely detailed description of the court system hints at Kafka’s work as an insurance lawyer.von Jagow/Jahrhaus/Hiebel reference to Canetti: Der andere Prozess. p. 458. \n\nTheodor W. Adorno takes the opposite view. According to him, The Trial does not tell the story of an individual fate but rather contains wide-reaching political and visionary aspects and can be read as a vision predicting the Nazi terror.von Jagow/Jahrhaus/Hiebel reference to Adorno: Aufzeichnungen zu Kafka. p. 459. \n\nGerman scholar Claus Hebell offers a synthesis of these two positions and demonstrates that the negotiating strategy used by the bureaucratic court system during the process to demoralize Kafka is reminiscent of the deficiencies in the Austro-Hungarian Empire’s judicial system.Claus Hebell: Rechtstheoretische und geistesgeschichtliche Voraussetzungen für das Werk Franz Kafkas, analysiert an dem Roman „Der Prozeß“. Doctoral thesis, Munich 1981, , ([http://uni-coach-und-texter.de/der-roman-der-prozess-von-franz-kafka-umsetzung-konkreter-strafjustiz-in-die-romanstruktur-von-claus-hebell/ Online])\n\nA few selected aspects of interpretation \n\nOver the course of the novel, it becomes evident that K. and the court do not face each other as distinct separate entities but that they are interweaved. This interweaving between K. and the court system increasingly intensifies throughout the novel. Towards the end of The Trial, K. realizes that everything that is happening stems from his inner selfPeter-André Alt, p. 417. and is the result of feelings of guilt and fantasies of punishment.\n\nWorth mentioning is also the dreamlike component of the events: Like in a dream, K.'s interior and exterior world intermingle.von Jagow/Jahrhaus/Hiebel, p. 462. A transition from the fantastic-realistic to the allegorical-psychological level can be made out. Even K.’s working environment is increasingly undermined by the fantastic, dreamlike world. It is, for example, a work order that leads to K.’s encounter with the priest.\n\nSexual references\n\nThe protagonist's feelings of guilt are likely to be rooted in the views on sexuality that prevailed at the beginning of the 20th century and are mirrored in the works of Sigmund Freud. According to Peter-André Alt, \"sexuality and K.'s trial are connected in remarkable ways.\" Women are portrayed as sirens, the representatives of the court as lecherous. K. himself cannot control his lust for Fräulein Bürstner. \n\nFurthermore, critics identified homoerotic elements in the text, for instance K.'s ironic and almost loving view of his director. Elegant or tight-fitting clothes on men are mentioned several times throughout the novel. The half-naked flogger punishing the officers Willem and Franz, who are naked as well, resembles sadomasochism.\n\n The Trial as a humorous story\n\nAccording to Kafka's friends, he laughed out loud several times while reading from his book.Max Brod's Franz Kafka. Eine Biographie (1974 edition Über Franz Kafka) It is thus reasonable to look for humorous aspects in The Trial despite its dark and serious essence. \n\nThis phenomenon is also addressed by Kafka biographer Reiner Stach:  The Trial \"is gruesome in its entirety, but comical in its details.\"Reiner Stach/Entscheidungen p. 554 The judges read porn magazines instead of law books and send for women as if they were ordering a splendid meal on a tray. The executioners look like ageing tenors. Due to a hole in the floor of one of the courtrooms, an advocate's leg protrudes into the room below from time to time.\n\nFilm adaptations\n\n* In the 1962 film adaptation by Orson Welles, Josef K. is played by Anthony Perkins and The Advocate by Welles himself.\n* Martin Scorsese's 1985 film After Hours contains a scene adapted from \"Before the Law\", in which the protagonist is trying to get into a nightclub called Club Berlin.\n* The 1993 film of The Trial was based on Harold Pinter's screenplay adaptation and starred Kyle MacLachlan as Josef K and Anthony Hopkins as The Priest.\n* The 2017 science fiction film Blade Runner 2049 features a protagonist named Agent K, who is also referred to as \"Joe\" and dies as a result of being stabbed, similar to Josef K in The Trial.https://medium.com/@_tomchristie/inside-the-kaleidoscope-mirrored-heart-of-blade-runner-2049-62ee229acc14\n\nRadio adaptations\n\n*On May 19, 1946, Columbia Workshop broadcast an adaptation of The Trial by Davidson Taylor with an original musical score by Bernard Herrmann and starring Karl Swenson as Joseph K.http://www.digitaldeliftp.com/DigitalDeliToo/dd2jb-Columbia-Workshop.html\n* In 1982, Mike Gwilym starred as Josef K with Miriam Margolyes as Leni in an adaptation on BBC Radio 4 dramatised for radio by Hanif Kureishi.\n* Sam Troughton starred as Joseph Kay in a new adaptation by Mark Ravenhill titled The Process directed by Polly Thomas and broadcast on 10 May 2015 on BBC Radio 3's Drama on 3 program.\n\nStage adaptations\n\n* The writer and director Steven Berkoff adapted several of Kafka's novels into plays and directed them for stage. His version of The Trial was first performed in 1970 in London and published in 1981.Berkoff, Steven. \"The Trial, Metamorphosis, In the Penal Colony. Three theatre adaptions from Franz Kafka.\" Oxford: Amber Lane Press, 1981.\n*Chicago based writer, Greg Allen, wrote and directed K., based on The Trial. It was produced by The Hypocrites and ran for several months in 2010 at The Chopin Theater in Chicago.[http://leisureblogs.chicagotribune.com/the_theater_loop/2010/10/k-by-the-hypocrites-greg-allens-k-can-be-unfeeling-but-it-showed-the-way.html \"'K.' by The Hypocrites: Greg Allen's 'K.' can be unfeeling, but it showed the way\"] by Chris Jones, Chicago Tribune (26 October 2010)\n* Joseph K, written by Tom Basden and based on The Trial, takes place in modern-day London, with the protagonist cast as a City banker. It ran at the Gate Theatre, Notting Hill, London, in late 2010.[https://www.theguardian.com/stage/2010/nov/17/joseph-k-review \"Joseph K – review\"] by Lynn Gardner, The Guardian (17 November 2010)\n* Gottfried von Einem wrote an opera, Der Prozeß, based on the novel. Its American debut was directed by Otto Preminger.\n* The writer Serge Lamothe adapted The Trial for the stage. Directed by François Girard, his version of The Trial was first performed in 2004 in Montreal and Ottawa, Canada, and published in 2005.\n* Between June and August 2015 The Young Vic theatre in London staged a version of The Trial adapted by Nick Gill and starring Rory Kinnear as K.\n\nSelected publication history\n\n* Oxford World's Classics, 4 October 2009, Translation: Mike Mitchell, \n* Dover Thrift Editions, 22 July 2009, Translation: David Wyllie, \n* Penguin Modern Classics, 29 June 2000, Translation: Idris Parry, \n* Schocken Books, 25 May 1999, Translation: Breon Mitchell,  Translator's preface is available online\n* Everyman's Library, 30 June 1992, Translation: Willa and Edwin Muir,. The Trial. http://en.wikipedia.org/?curid=10861."
  }
}
