{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3335",
  "eid" : "c526bf20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778410514,
  "textBody" : "The Baltic Sea is a sea of the Atlantic Ocean, enclosed by Scandinavia, Finland, Estonia, Latvia, Lithuania, Russia, Poland, Germany and the North and Central European Plain.\n\nThe sea stretches from 53°N to 66°N latitude and from 10°E to 30°E longitude. A mediterranean sea of the Atlantic, with limited water exchange between the two bodies, the Baltic Sea drains through the Danish islands into the Kattegat by way of the straits of Øresund, the Great Belt, and the Little Belt.  It includes the Gulf of Bothnia, the Bay of Bothnia, the Gulf of Finland, the Gulf of Riga, and the Bay of Gdańsk.\n\nThe Baltic Proper is bordered on its northern edge, at the latitude 60°N, by the Åland islands and the Gulf of Bothnia, on its northeastern edge by the Gulf of Finland, on its eastern edge by the Gulf of Riga, and in the west by the Swedish part of the southern Scandinavian Peninsula.\n\nThe Baltic Sea is connected by artificial waterways to the White Sea via the White Sea Canal and to the German Bight of the North Sea via the Kiel Canal.\n\nDefinitions \n\nAdministration\n\nThe Helsinki Convention on the Protection of the Marine Environment of the Baltic Sea Area includes the Baltic Sea and the Kattegat, without calling Kattegat a part of the Baltic Sea, \"For the purposes of this Convention the \"Baltic Sea Area\" shall be the Baltic Sea and the Entrance to the Baltic Sea, bounded by the parallel of the Skaw in the Skagerrak at 57°44.43'N.\"\n\nTraffic history\n\nHistorically, the Kingdom of Denmark collected Sound Dues from ships at the border between the ocean and the land-locked Baltic Sea. They were collected in the Øresund at Kronborg castle near Helsingør, in the Great Belt at Nyborg. In the Little Belt, the site of intake was moved to Fredericia, after that stronghold had been built. The narrowest part of Little Belt is the \"Middelfart Sund\" near Middelfart.\n\nOceanography\n\nGeographers widely agree that the preferred physical border of the Baltic is a line drawn through the southern Danish islands, Drogden-Sill and Langeland. The Drogden Sill is situated north of Køge Bugt and connects Dragør in the south of Copenhagen to Malmö; it is used by the Øresund Bridge, including the Drogden Tunnel. By this definition, the Danish Straits are part of the entrance, but the Bay of Mecklenburg and the Bay of Kiel are parts of the Baltic Sea.\nAnother usual border is the line between Falsterbo, Sweden and Stevns Klint, Denmark, as this is the southern border of Øresund. It's also the border between the shallow southern Øresund (with a typical depth of 5–10 meters only) and notably deeper water.\n\nHydrography and biology\n\nDrogden Sill (depth of 7 m) sets a limit to Øresund and Darss Sill (depth of 18 m), and a limit to the Belt Sea.[https://www.kemi.se/Documents/Publikationer/Trycksaker/PM/PM-9-12-BaltSens.pd Swedish Chemicals Agency (KEMI): The BaltSens Project – The sensitivity of the Baltic Sea ecosystems to hazardous compounds] The shallow sills are obstacles to the flow of heavy salt water from the Kattegat into the basins around Bornholm and Gotland.\n\nThe Kattegat and the southwestern Baltic Sea are well oxygenated and have a rich biology. The remainder of the Sea is brackish, poor in oxygen and in species. Thus, statistically, the more of the entrance that is included in its definition, the healthier the Baltic appears; conversely, the more narrowly it is defined, the more endangered its biology appears.\n\nEtymology \n\nWhile Tacitus called it Mare Suebicum after the Germanic people of the Suebi,Tacitus, Germania([http://www.thelatinlibrary.com/tacitus/tac.ger.shtml#45 online text]): Ergo iam dextro Suebici maris litore Aestiorum gentes adluuntur, quibus ritus habitusque Sueborum, lingua Britannicae propior. – \"Upon the right of the Suevian Sea the Æstyan nations reside, who use the same customs and attire with the Suevians; their language more resembles that of Britain.\" ([http://www.gutenberg.org/files/2995/2995-h/2995-h.htm English text online]) and Ptolemy Sarmatian Ocean after the Sarmatians,Ptolemy, Geography III, chapter 5: \"Sarmatia in Europe is bounded on the north by the Sarmatian ocean at the Venedic gulf\" ([http://topostext.org/work.php?work_id209 online text]). the first to name it the Baltic Sea (Mare Balticum) was the eleventh-century German chronicler Adam of Bremen. The origin of the latter name is speculative and it was adopted into Slavic and Finnic languages spoken around the sea, very likely due to the role of Medieval Latin in cartography. It might be connected to the Germanic word belt, a name used for two of the Danish straits, the Belts, while others claim it to be directly derived from the source of the Germanic word, Latin balteus \"belt\". [http://runeberg.org/nfbb/0435.html Balteus] in Nordisk familjebok. Adam of Bremen himself compared the sea with a belt, stating that it is so named because it stretches through the land as a belt (Balticus, eo quod in modum baltei longo tractu per Scithicas regiones tendatur usque in Greciam). \n\nHe might also have been influenced by the name of a legendary island mentioned in the Natural History of Pliny the Elder. Pliny mentions an island named Baltia (or Balcia) with reference to accounts of Pytheas and Xenophon. It is possible that Pliny refers to an island named Basilia (\"the royal\") in On the Ocean by Pytheas. Baltia also might be derived from belt and mean \"near belt of sea, strait.\" \n\nMeanwhile, others have suggested that the name of the island originates from the Proto-Indo-European root *bhel meaning \"white, fair\". This root and its basic meaning were retained in both Lithuanian (as baltas) and Latvian (as balts). On this basis, a related hypothesis holds that the name originated from this Indo-European root via a Baltic language such as Lithuanian. Another explanation is that, while derived from the aforementioned root, the name of the sea is related to names for various forms of water and related substances in several European languages, that might have been originally associated with colors found in swamps (compare Proto-Slavic *bolto \"swamp\"). Yet another explanation is that the name originally meant \"enclosed sea, bay\" as opposed to open sea. Some Swedish historians believe the name derives from the god Baldr of Nordic mythology.\n\nIn the Middle Ages the sea was known by a variety of names. The name Baltic Sea became dominant only after 1600. Usage of Baltic and similar terms to denote the region east of the sea started only in 19th century.\n\nName in other languages\n\nThe Baltic Sea was known in ancient Latin language sources as Mare Suebicum or even Mare Germanicum.Cfr. Hartmann Schedel's 1493 (map), where the Baltic Sea is called Mare Germanicum, whereas the Northern Sea is called Oceanus Germanicus. Older native names in languages that used to be spoken on the shores of the sea or near it usually indicate the geographical location of the sea (in Germanic languages), or its size in relation to smaller gulfs (in Old Latvian), or tribes associated with it (in Old Russian the sea was known as the Varanghian Sea). In modern languages it is known by the equivalents of \"East Sea\", \"West Sea\", or \"Baltic Sea\" in different languages:\n\n* \"Baltic Sea\" is used in English; in the Baltic languages Latvian (Baltijas jūra; in Old Latvian it was referred to as \"the Big Sea\", while the present day Gulf of Riga was referred to as \"the Little Sea\") and Lithuanian (Baltijos jūra); in Latin (Mare Balticum) and the Romance languages French (Mer Baltique), Italian (Mar Baltico), Portuguese (Mar Báltico), Romanian (Marea Baltică) and Spanish (Mar Báltico); in Greek (Βαλτική Θάλασσα Valtikí Thálassa); in Albanian (Deti Balltik); in Welsh (Môr Baltig); in the Slavic languages Polish (Morze Bałtyckie or Bałtyk), Czech (Baltské moře or Balt), Slovenian (Baltsko morje), Bulgarian (Балтийско море Baltijsko More), Kashubian (Bôłt), Macedonian (Балтичко Море Baltičko More), Ukrainian (Балтійське море Baltijs′ke More), Belarusian (Балтыйскае мора Baltyjskaje Mora), Russian (Балтийское море Baltiyskoye More) and Serbo-Croatian (Baltičko more / Балтичко море); in Hungarian (Balti-tenger).\n* In Germanic languages, except English, \"East Sea\" is used, as in Afrikaans (Oossee), Danish (Østersøen), Dutch (Oostzee), German (Ostsee), Icelandic and Faroese (Eystrasalt), Norwegian (Østersjøen), and Swedish (Östersjön). In Old English it was known as Ostsæ; also in Hungarian the former name was Keleti-tenger (due to German influence). In addition, Finnish, a Finnic language, has calqued the Swedish term as Itämeri \"East Sea\", disregarding the geography (the sea is west of Finland), though understandably since Finland was a part of Sweden from the Middle Ages until 1809.\n* In another Finnic language, Estonian, it is called the \"West Sea\" (Läänemeri), with the correct geography (the sea is west of Estonia).\n\nHistory \n\nClassical world\n\nAt the time of the Roman Empire, the Baltic Sea was known as the Mare Suebicum or Mare Sarmaticum. Tacitus in his AD 98 Agricola and Germania described the Mare Suebicum, named for the Suebi tribe, during the spring months, as a brackish sea where the ice broke apart and chunks floated about. The Suebi eventually migrated southwest to reside for a while in the Rhineland area of modern Germany, where their name survives in the historic region known as Swabia. Jordanes called it the Germanic Sea in his work, the Getica.\n\nMiddle Ages\n\nIn the early Middle Ages, Norse (Scandinavian) merchants built a trade empire all around the Baltic. Later, the Norse fought for control of the Baltic against Wendish tribes dwelling on the southern shore. The Norse also used the rivers of Russia for trade routes, finding their way eventually to the Black Sea and southern Russia. This Norse-dominated period is referred to as the Viking Age.\n\nSince the Viking age, the Scandinavians have referred to the Baltic Sea as Austmarr (\"Eastern Lake\"). \"Eastern Sea\", appears in the Heimskringla and Eystra salt appears in Sörla þáttr. Saxo Grammaticus recorded in Gesta Danorum an older name, Gandvik, -vik being Old Norse for \"bay\", which implies that the Vikings correctly regarded it as an inlet of the sea. Another form of the name, \"Grandvik\", attested in at least one English translation of Gesta Danorum, is likely to be a misspelling.)\n\nIn addition to fish the sea also provides amber, especially from its southern shores within today's borders of Poland, Russia and Lithuania. First mentions of amber deposits on the South coast of the Baltic Sea date back to the 12th century.[https://ambery.net/blog/2016/07/history-of-russian-amber-1/ \"The History of Russian Amber, Part 1: The Beginning\"], Ambery.net The bordering countries have also traditionally exported lumber, wood tar, flax, hemp and furs by ship across the Baltic. Sweden had from early medieval times exported iron and silver mined there, while Poland had and still has extensive salt mines. Thus the Baltic Sea has long been crossed by much merchant shipping.\n\nThe lands on the Baltic's eastern shore were among the last in Europe to be converted to Christianity. This finally happened during the Northern Crusades: Finland in the twelfth century by Swedes, and what are now Estonia and Latvia in the early thirteenth century by Danes and Germans (Livonian Brothers of the Sword). The Teutonic Order gained control over parts of the southern and eastern shore of the Baltic Sea, where they set up their monastic state. Lithuania was the last European state to convert to Christianity.\n\nAn arena of conflict\n\nIn the period between the 8th and 14th centuries, there was much piracy in the Baltic  from the coasts of Pomerania and Prussia, and the Victual Brothers even held Gotland.\n\nStarting in the 11th century, the southern and eastern shores of the Baltic were settled by migrants mainly from Germany, a movement called the Ostsiedlung (\"east settling\"). Other settlers were from the Netherlands, Denmark, and Scotland. The Polabian Slavs were gradually assimilated by the Germans.[http://www.britannica.com/EBchecked/topic/639735/Wend Wend – West Wend]. Britannica.com. Retrieved on 23 June 2011. Denmark gradually gained control over most of the Baltic coast, until she lost much of her possessions after being defeated in the 1227 Battle of Bornhöved.\n\nIn the 13th to 16th centuries, the strongest economic force in Northern Europe was the Hanseatic League, a federation of merchant cities around the Baltic Sea and the North Sea. In the sixteenth and early seventeenth centuries, Poland, Denmark, and Sweden fought wars for Dominium maris baltici (\"Lordship over the Baltic Sea\"). Eventually, it was Sweden that virtually encompassed the Baltic Sea. In Sweden the sea was then referred to as Mare Nostrum Balticum (\"Our Baltic Sea\"). The goal of Swedish warfare during the 17th century was to make the Baltic Sea an all-Swedish sea (Ett Svenskt innanhav), something that was accomplished except the rout between Riga in Latvia and Stettin in Pomerania.  However, it was the Dutch who dominated Baltic trade in the seventeenth century.\n\nIn the eighteenth century, Russia and Prussia became the leading powers over the sea. Sweden's defeat in the Great Northern War brought Russia to the eastern coast. Russia became and remained a dominating power in the Baltic. Russia's Peter the Great saw the strategic importance of the Baltic and decided to found his new capital, Saint Petersburg, at the mouth of the Neva river at the east end of the Gulf of Finland. There was much trading not just within the Baltic region but also with the North Sea region, especially eastern England and the Netherlands: their fleets needed the Baltic timber, tar, flax and hemp.\n\nDuring the Crimean War, a joint British and French fleet attacked the Russian fortresses in the Baltic. They bombarded Sveaborg, which guards Helsinki; and Kronstadt, which guards Saint Petersburg; and they destroyed Bomarsund in the Åland Islands. After the unification of Germany in 1871, the whole southern coast became German. World War I was partly fought in the Baltic Sea. After 1920 Poland was connected to the Baltic Sea by the Polish Corridor and enlarged the port of Gdynia in rivalry with the port of the Free City of Danzig.\n\nDuring World War II, Germany reclaimed all of the southern and much of the eastern shore by occupying Poland and the Baltic states. In 1945, the Baltic Sea became a mass grave for retreating soldiers and refugees on torpedoed troop transports. The sinking of the Wilhelm Gustloff remains the worst maritime disaster in history, killing (very roughly) 9,000 people. In 2005, a Russian group of scientists found over five thousand airplane wrecks, sunken warships, and other material, mainly from World War II, on the bottom of the sea.\n\nSince World War II\n\nSince the end of World War II, various nations, including the Soviet Union, the United Kingdom and the United States, have disposed of chemical weapons in the Baltic Sea, raising concerns of environmental contamination.[http://www.dw-world.de/dw/article/0,,3102728,00.html Chemical Weapon Time Bomb Ticks in the Baltic Sea] Deutsche Welle, 1 February 2008. Even now fishermen accidentally retrieve some of these materials: the most recent available report from the Helsinki Commission notes that four small scale catches of chemical munitions representing approximately 105 kg of material were reported in 2005. This is a reduction from the 25 incidents representing 1110 kg of material in 2003.[http://www.helcom.fi/stc/files/Publications/Proceedings/bsep112.pdf Activities 2006: Overview]  Baltic Sea Environment Proceedings No. 112. Helsinki Commission. Until now, the U.S. Government refuses to disclose the exact coordinates of the wreck sites. Rotting bottles leak Lost and other substances, thus slowly poisoning a substantial part of the Baltic Sea.\n\nAfter 1945, the German population was expelled from all areas east of the Oder-Neisse line, making room for displaced Poles and Russians. Poland gained most of the southern shore. The Soviet Union gained another access to the Baltic with the Kaliningrad Oblast. The Baltic states on the eastern shore were annexed by the Soviet Union. The Baltic then separated opposing military blocs: NATO and the Warsaw Pact. Had war broken out, the Polish navy was prepared to invade the Danish isles. This border status restricted trade and travel. It ended only after the collapse of the Communist regimes in Central and Eastern Europe in the late 1980s.\n\nSince May 2004, with the accession of the Baltic states and Poland, the Baltic Sea has been almost entirely surrounded by countries of the European Union (EU). The only remaining non-EU shore areas are Russian: the Saint Petersburg area and the exclave of the Kaliningrad Oblast.\n\nWinter storms begin arriving in the region during October. These have caused numerous shipwrecks, and contributed to the extreme difficulties of rescuing passengers of the ferry M/S Estonia en route from Tallinn, Estonia, to Stockholm, Sweden, in September 1994, which claimed the lives of 852 people. Older, wood-based shipwrecks such as the Vasa tend to remain well-preserved, as the Baltic's cold and brackish water does not suit the shipworm.\n\nStorm floods\n\nStorm surge floodings are generally taken to occur when the water level is more than one metre above normal. In Warnemünde about 110 floods occurred from 1950 to 2000, an average of just over two per year.\n\nHistoric flood events were the All Saints' Flood of 1304 and other floods in the years 1320, 1449, 1625, 1694, 1784 and 1825. Little is known of their extent. Citing  From 1872, there exist regular and reliable records of water levels in the Baltic Sea. The highest was the flood of 1872 when the water was an average of  above sea level at Warnemünde and a maximum of  above sea level in Warnemünde. In the last very heavy floods the average water levels reached  above sea level in 1904,  in 1913,  in January 1954,  on 2–4 November 1995 and  on 21 February 2002.\n\nGeography \n\nGeophysical data \n\nAn arm of the North Atlantic Ocean, the Baltic Sea is enclosed by Sweden and Denmark to the northwest, Finland to the northeast, the Baltic countries to the southeast, and the North European Plain to the southwest.\n\nIt is about 1600 km long, an average of 193 km wide, and an average of 55 m deep. The maximum depth is 459 m which is on the Swedish side of the center. The surface area is about 349644 km2  and the volume is about 20000 km3. The periphery amounts to about 8000 km of coastline. at envir.ee. (archived) (2006-04-21). Retrieved on 23 June 2011.\n\nThe Baltic Sea is one of the largest brackish inland seas by area, and occupies a basin (a zungenbecken) formed by glacial erosion during the last few ice ages.\n\nPhysical characteristics of the Baltic Sea, its main sub-regions, and the transition zone to the Skagerrak/North Sea area[http://www.helcom.fi/Lists/Publications/BSEP104.pdf p. 7]\n\nExtent\n\nThe International Hydrographic Organization defines the limits of the Baltic Sea as follows:\n\nBordered by the coasts of Germany, Denmark, Poland, Sweden, Finland, Russia, Estonia, Latvia and Lithuania, it extends north-eastward of the following limits:\n*In the Little Belt. A line joining Falshöft () and Vejsnæs Nakke (Ærø: ).\n*In the Great Belt. A line joining Gulstav (South extreme of Langeland Island) and Kappel Kirke () on Island of Lolland.\n*In the Guldborg Sound. A line joining Flinthorne-Rev and Skjelby ().\n*In the Sound. A line joining Stevns Lighthouse () and Falsterbo Point ().\n\nSubdivisions\n\nThe northern part of the Baltic Sea is known as the Gulf of Bothnia, of which the northernmost part is the Bay of Bothnia  or Bothnian Bay. The more rounded southern basin of the gulf is called Bothnian Sea and immediately to the south of it lies the Sea of Åland. The Gulf of Finland connects the Baltic Sea with Saint Petersburg. The Gulf of Riga lies between the Latvian capital city of Riga and the Estonian island of Saaremaa.\n\nThe Northern Baltic Sea lies between the Stockholm area, southwestern Finland and Estonia. The Western and Eastern Gotland Basins form the major parts of the Central Baltic Sea or Baltic proper. The Bornholm Basin is the area east of Bornholm, and the shallower Arkona Basin extends from Bornholm to the Danish isles of Falster and Zealand.\n\nIn the south, the Bay of Gdańsk lies east of the Hel Peninsula on the Polish coast and west of the Sambia Peninsula in Kaliningrad Oblast. The Bay of Pomerania lies north of the islands of Usedom and Wolin, east of Rügen. Between Falster and the German coast lie the Bay of Mecklenburg and Bay of Lübeck. The westernmost part of the Baltic Sea is the Bay of Kiel. The three Danish straits, the Great Belt, the Little Belt and The Sound (Öresund/Øresund), connect the Baltic Sea with the Kattegat  and Skagerrak strait in the North Sea.\n\nThe ice\n\nOn the long-term average, the Baltic Sea is ice-covered at the annual maximum for about 45% of its surface area. The ice-covered area during such a typical winter includes the Gulf of Bothnia, the Gulf of Finland, the Gulf of Riga, the archipelago west of Estonia, the Stockholm archipelago, and the Archipelago Sea southwest of Finland. The remainder of the Baltic does not freeze during a normal winter, with the exception of sheltered bays and shallow lagoons such as the Curonian Lagoon. The ice reaches its maximum extent in February or March; typical ice thickness in the northernmost areas in the Bothnian Bay, the northern basin of the Gulf of Bothnia, is about 70 cm for landfast sea ice. The thickness decreases farther south.\n\nFreezing begins in the northern extremities of Gulf of Bothnia typically in the middle of November, reaching the open waters of the Bothnian Bay in early January. The Bothnian Sea, the basin south of Kvarken, freezes on average in late February. The Gulf of Finland and the Gulf of Riga freeze typically in late January. In 2011, the Gulf of Finland was completely frozen on 15 February.Helsingin Sanomat, 16 February 2011, p. A8.\n\nThe ice extent depends on whether the winter is mild, moderate, or severe. Severe winters can lead to ice formation around southern Sweden and even in the Danish straits. According to the 18th-century natural historian William Derham, during the severe winters of 1703 and 1708, the ice cover reached as far as the Danish straits.Derham, William Physico-Theology: Or, A Demonstration of the Being and Attributes of God from His Works of Creation (London, 1713). Frequently, parts of the Gulf of Bothnia and Gulf of Finland are frozen, in addition to coastal fringes in more southerly locations such as the Gulf of Riga. This description meant that the whole of the Baltic Sea was covered with ice.\n\nIt is known that since 1720, the Baltic Sea has frozen over entirely a total of 20 times. The most recent case was in early 1987, which was the most severe winter in Scandinavia since that date. The ice then covered . During the winter of 2010–11, which was quite severe compared to those of the last decades, the maximum ice cover was , which was reached on 25 February 2011. The ice then extended from the north down to the northern tip of Gotland, with small ice-free areas on either side, and the east coast of the Baltic Sea was covered by an ice sheet about 25 to wide all the way to Gdańsk. This was brought about by a stagnant high-pressure area that lingered over central and northern Scandinavia from around 10 to 24 February. After this, strong southern winds pushed the ice further into the north, and much of the waters north of Gotland were again free of ice, which had then packed against the shores of southern Finland.Helsingin Sanomat, 10 February 2011, p. A4; 25 February 2011, p. A5; 11 June 2011, p. A12. The effects of the afore-mentioned high-pressure area did not reach the southern parts of the Baltic Sea, and thus the entire sea did not freeze over. However, floating ice was additionally observed near Świnoujście harbour in January 2010.\n\nIn recent years prior to 2011, the Bothnian Bay and the Bothnian Sea were frozen with solid ice near the Baltic coast and dense floating ice far from it. In 2008, there was almost no ice formation except for a short period in March.[http://www.ssec.wisc.edu/ Sea Ice Survey] Space Science and Engineering Center, University of Wisconsin.\n\nDuring winter, fast ice, which is attached to the shoreline, develops first, rendering ports unusable without the services of icebreakers. Level ice, ice sludge, pancake ice, and rafter ice form in the more open regions. The gleaming expanse of ice is similar to the Arctic, with wind-driven pack ice and ridges up to 15 m. Offshore of the landfast ice, the ice remains very dynamic all year, and it is relatively easily moved around by winds and therefore forms pack ice, made up of large piles and ridges pushed against the landfast ice and shores.\n\nIn spring, the Gulf of Finland and the Gulf of Bothnia normally thaw in late April, with some ice ridges persisting until May in the eastern extremities of the Gulf of Finland. In the northernmost reaches of the Bothnian Bay, ice usually stays until late May; by early June it is practically always gone. However, in the famine year of 1867 remnants of ice were observed as late as July 17 near Uddskär. Even as far south as Øresund, remnants of ice have been observed in May on several occasions; near Taarbaek on May 15, 1942 and near Copenhagen on May 11, 1771. Drift ice was also observed on May 11, 1799.\n\nThe ice cover is the main habitat for two large mammals, the grey seal (Halichoerus grypus) and the Baltic ringed seal (Pusa hispida botnica), both of which feed underneath the ice and breed on its surface. Of these two seals, only the Baltic ringed seal suffers when there is not adequate ice in the Baltic Sea, as it feeds its young only while on ice. The grey seal is adapted to reproducing also with no ice in the sea. The sea ice also harbours several species of algae that live in the bottom and inside unfrozen brine pockets in the ice.\n\nHydrography\n\nThe Baltic Sea flows out through the Danish straits; however, the flow is complex. A surface layer of brackish water discharges 940 km3 per year into the North Sea. Due to the difference in salinity, by salinity permeation principle, a sub-surface layer of more saline water moving in the opposite direction brings in 475 km3 per year. It mixes very slowly with the upper waters, resulting in a salinity gradient from top to bottom, with most of the salt water remaining below 40 to deep. The general circulation is anti-clockwise: northwards along its eastern boundary, and south along the western one .Alhonen, p. 88\n\nThe difference between the outflow and the inflow comes entirely from fresh water. More than 250 streams drain a basin of about 1600000 km2, contributing a volume of 660 km3 per year to the Baltic. They include the major rivers of north Europe, such as the Oder, the Vistula, the Neman, the Daugava and the Neva. Additional fresh water comes from the difference of precipitation less evaporation, which is positive.\n\nAn important source of salty water are infrequent inflows of North Sea water into the Baltic. Such inflows, important to the Baltic ecosystem because of the oxygen they transport into the Baltic deeps, used to happen on average every four to five years until the 1980s. In recent decades they have become less frequent. The latest four occurred in 1983, 1993, 2003 and 2014 suggesting a new inter-inflow period of about ten years.\n\nThe water level is generally far more dependent on the regional wind situation than on tidal effects. However, tidal currents occur in narrow passages in the western parts of the Baltic Sea.\n\nThe significant wave height is generally much lower than that of the North Sea. Violent and sudden storms often sweep the surface, due to large transient temperature differences and a long reach of wind. Seasonal winds also cause small changes in sea level, of the order of  .\n\nSalinity\n\nThe Baltic Sea's salinity is much lower than that of ocean water (which averages 3.5%), as a result of abundant freshwater runoff from the surrounding land, combined with the shallowness of the sea itself; runoff contributes roughly one-fortieth its total volume per year, as the volume of the basin is about  and yearly runoff is about 500 km3. The open surface waters of the central basin have salinity of 0.5% to 0.8%, which makes the basin border-line freshwater. Drinking the water as a means of survival would actually hydrate the body instead of dehydrating, as is the case with ocean water.A healthy serum concentration of sodium is around 0.8–0.85%, and healthy kidneys can concentrate salt in urine to at least 1.4%. At the semi-enclosed bays with major freshwater inflows, such as the head of Finnish Gulf with the Neva mouth and the head of the Bothnian Gulf with the close mouths of the Lule, Tornio and Kemi, the salinity is considerably lower. Below 40 to, the salinity is between 1.0% and 1.5% in the open Baltic Sea, and higher near the Danish Straits, but this is still less than half that of ocean water.\n\nThe flow of fresh water into the sea from approximately two hundred rivers and the introduction of salt from the South builds up a gradient of salinity in the Baltic Sea. Near the Danish straits the salinity is close to that of the Kattegat, but still not fully oceanic, because the saltiest water that passes the straits is already mixed with considerable amounts of outflow water. The salinity steadily decreases towards North and East. At the northern part of the Gulf of Bothnia the water is no longer salty and many fresh water species live in the sea. The salinity gradient is paralleled by a temperature gradient. These two factors limit many species of animals and plants to a relatively narrow region of the Baltic Sea.\n\nThe most saline water is vertically stratified in the water column to the north, creating a barrier to the exchange of oxygen and nutrients, and fostering completely separate maritime environments.  , Jan Thulin and Andris Andrushaitis, Religion, Science and the Environment Symposium V on the Baltic Sea (2003).\n\nMajor tributaries \n\nThe rating of mean discharges differs from the ranking of hydrological lengths (from the most distant source to the sea) and the rating of the nominal lengths. Göta älv, a tributary of the Kattegat, is not listed, as due to the northward upper low-salinity-flow in the sea, its water hardly reaches the Baltic proper:\n\nIslands and archipelagoes \n\n* Åland Islands (Finland, autonomous)\n* Archipelago Sea (Finland)\n** Pargas\n** Nagu\n** Korpo\n** Houtskär\n** Kustavi\n** Kimito\n* Blekinge archipelago (Sweden)\n* Bornholm, including Christiansø (Denmark)\n* Falster (Denmark)\n* Gotland (Sweden)\n* Hailuoto (Finland)\n* Kotlin (Russia)\n* Lolland (Denmark)\n* Kvarken archipelago, including Valsörarna (Finland)\n* Møn (Denmark)\n* Öland (Sweden)\n* Rügen (Germany)\n* Stockholm archipelago (Sweden)\n** Värmdön (Sweden)\n* Usedom or Uznam (split between Germany and Poland)\n* West Estonian archipelago (Estonia):\n** Hiiumaa\n** Muhu\n** Saaremaa\n** Vormsi\n* Wolin (Poland)\n* Zealand (Denmark)\n\nCoastal countries\n\nCountries that border the sea:\n\n, , , , , , , , .\n\nCountries that are in the drainage basin but do not border the sea:\n\n, , , , .\n\nThe Baltic sea drainage basin is roughly four times the surface area of the sea itself. About 48% of the region is forested, with Sweden and Finland containing the majority of the forest, especially around the Gulfs of Bothnia and Finland.\n\nAbout 20% of the land is used for agriculture and pasture, mainly in Poland and around the edge of the Baltic Proper, in Germany, Denmark and Sweden. About 17% of the basin is unused open land with another 8% of wetlands. Most of the latter are in the Gulfs of Bothnia and Finland.\n\nThe rest of the land is heavily populated. About 85 million people live in the Baltic drainage basin, 15 million within 10 km of the coast and 29 million within 50 km of the coast. Around 22 million live in population centers of over 250,000. 90% of these are concentrated in the 10 km band around the coast. Of the nations containing all or part of the basin, Poland includes 45% of the 85 million, Russia 12%, Sweden 10% and the others less than 6% each.\n\nCities \n\nThe biggest coastal cities (by population):\n* Saint Petersburg (Russia) 4,700,000 (metropolitan area 6,000,000)\n* Stockholm (Sweden) 843,139 (metropolitan area 2,046,103)\n* Riga (Latvia) 696,567 (metropolitan area 842,000)\n* Helsinki (Finland) 605,022 (metropolitan area 1,358,901)\n* Gdańsk (Poland) 462,700 (metropolitan area 1,041,000)\n* Tallinn (Estonia) 435,245 (metropolitan area 542,983)\n* Kaliningrad (Russia) 431,500\n* Szczecin (Poland) 413,600 (metropolitan area 778,000)\n* Gdynia (Poland) 255,600 (metropolitan area 1,041,000)\n* Kiel (Germany) 242,000[http://www.kiel.de/rathaus/statistik/statistische_berichte/statistische_kurzinformationen/2012/Kurzinfo_Nr._151_-_Amtliche_Einwohnerzahl_im_Dezember_2011.pdf Statistische Kurzinformation]  (in German). Landeshauptstadt Kiel. Amt für Kommunikation, Standortmarketing und Wirtschaftsfragen Abteilung Statistik. Retrieved on 11 October 2012.\n* Espoo (Finland) 257,195 (part of Helsinki metropolitan area)\n* Lübeck (Germany) 216,100\n* Rostock (Germany) 212,700\n* Klaipėda (Lithuania) 194,400\n* Oulu (Finland) 191,050\n* Turku (Finland) 180,350\n\nImportant ports:\n\nEstonia:\n* Pärnu 44,568\n* Maardu 16,570\n* Sillamäe 16,567\n\nFinland:\n* Pori 83,272\n* Kotka 54,887\n* Kokkola 46,809\n* Port of Naantali 18,789\n* Mariehamn 11,372\n* Hanko 9,270\n\nGermany:\n* Stralsund 58,000\n* Greifswald 55,000\n* Wismar 44,000\n* Eckernförde 22,000\n* Neustadt in Holstein 16,000\n* Wolgast 12,000\n* Sassnitz 10,000\n\nLatvia:\n* Liepāja 85,000\n* Ventspils 44,000\n\nLithuania:\n* Klaipėda 194,000\n* Palanga 15,000\n\nPoland:\n* Kołobrzeg 44,800\n* Świnoujście 41,500\n* Police 34,284\n* Władysławowo 15,000\n* Darłowo 14,000\n\nRussia:\n* Vyborg 79,962\n* Baltiysk 34,000\n\nSweden:\n* Norrköping 84,000\n* Gävle 69,000\n* Trelleborg 26,000\n* Karlshamn 19,000\n* Oxelösund 11,000\n\nGeology\n\nThe Baltic Sea somewhat resembles a riverbed, with two tributaries, the Gulf of Finland and Gulf of Bothnia. Geological surveys show that before the Pleistocene, instead of the Baltic Sea, there was a wide plain around a great river paleontologists call the Eridanos. Several Pleistocene glacial episodes scooped out the river bed into the sea basin. By the time of the last, or Eemian Stage (MIS 5e), the Eemian Sea was in place. Instead of a true sea, the Baltic can even today also be understood as the common estuary of all rivers flowing into it.\n\nFrom that time the waters underwent a geologic history summarized under the names listed below. Many of the stages are named after marine animals (e.g. the Littorina mollusk) that are clear markers of changing water temperatures and salinity.\n\nThe factors that determined the sea's characteristics were the submergence or emergence of the region due to the weight of ice and subsequent isostatic readjustment, and the connecting channels it found to the North Sea-Atlantic, either through the straits of Denmark or at what are now the large lakes of Sweden, and the White Sea-Arctic Sea.\n* Eemian Sea, 130,000–115,000 (years ago)\n* Baltic Ice Lake, 12,600–10,300\n* Yoldia Sea, 10,300–9500\n* Ancylus Lake, 9,500–8,000\n* Mastogloia Sea 8,000–7,500\n* Littorina Sea, 7,500–4,000\n* Post-Littorina Sea 4,000–present\n\nThe land is still emerging isostatically from its depressed state, which was caused by the weight of ice during the last glaciation. The phenomenon is known as post-glacial rebound. Consequently, the surface area and the depth of the sea are diminishing. The uplift is about eight millimetres per year on the Finnish coast of the northernmost Gulf of Bothnia. In the area, the former seabed is only gently sloping, leading to large areas of land being reclaimed in what are, geologically speaking, relatively short periods (decades and centuries).\n\nAnomalous object/formation\n\nThe Baltic Sea anomaly is a 60-metre (200 ft) diameter circular rock-like formation on the floor of the northern Baltic Sea at the center of the Bothnian Sea, discovered by Peter Lindberg, Dennis Åsberg and their Swedish \"Ocean X\" diving team in June 2011. The team reported that the formation rests on a pillar and includes a structure similar in appearance to a staircase, leading to a dark hole.\n\nAccording to Ocean X, the formation has an appearance of \"rough granite\", is round, 3 to thick and approximately 60 m in diameter, stands on an 8 m pillar-like feature, and is located at a depth of 85 to. There is also another smaller object not far away.Danish: [http://videnskab.dk/miljo-naturvidenskab/nye-billeder-ukendt-objekt-i-ostersoen-er-ren-x-files 16. juli 2012, videnskab.dk: Nye billeder: Ukendt objekt i Østersøen er ren X-files] Quote: \"...Objektet er som først antaget 60 meter langt og nøjagtig lige så bredt...\"Swedish: [http://www.expressen.se/nyheter/sa-ser-den-mystiska-cirkeln-ut-pa-nara-hall/ 15 jun 2012, expressen.se: Så ser den mystiska cirkeln ut på nära håll] The object is at the end of what resembles a 300 m \"runway\".Danish: \n\nThe Ocean X team has published one additional close-up sonar scan on their Web site and nine additional close-up sonar scans on their YouTube page that appear to show a 90-degree angle and other features of the object.http://www.oceanexplorer.se/wp-content/uploads/2012/05/456_90D.jpg\n\nOn their second expedition, they reported that they found something that looks like a staircase and a round black hole that goes directly into the structure.Swedish: [http://www.expressen.se/nyheter/trappa-senaste-fyndet-vid-mystiska-cirkeln/ 12 Aug 2012, expressen.se: Trappa senaste fyndet vid mystiska cirkeln]\n\nBiology \n\nFauna\n\nThe fauna of the Baltic sea is a mixture of marine and freshwater species. Among marine fishes are cod, herring, hake, plaice, flounder, shorthorn sculpin, stickleback and turbot, and examples of freshwater species include perch, pike, whitefish and roach.\n\nThere is a decrease in faunal species from the Belts to the Gulf of Bothnia. The decreasing salinity along this path causes restrictions in both physiology and habitats. The lack of tides has affected the marine species as compared with the Atlantic.\n\nSince the Baltic Sea is so young there are only a few endemic species. The mostly asexually reproducing brown alga Fucus radicans seems to have evolved in the basin. Another endemic is the Copenhagen cockle parvicardium hauniense. However, several marine species have populations in the Baltic Sea adapted to the low salinity, such as the Baltic Sea herring which is smaller than the Atlantic herring.\n\nA peculiar feature of the fauna is that it contains a number of glacial relict species, isolated populations of arctic species which have remained in the Baltic Sea since the last glaciation, such as the large isopod Saduria entomon, the Baltic subspecies of ringed seal, and the fourhorn sculpin. Some of these relicts are derived from glacial lakes, such as  Monoporeia affinis, which is a main element in the benthic fauna of the low-salinity Bothnian Bay.\n\nCetaceans in Baltic Sea have been monitored by the ASCOBANS. Critically endangered populations of Atlantic white-sided dolphins and harbor porpoises inhabit the sea where white-colored porpoises have been recorded, and occasionally oceanic and out-of-range species such as minke whales,[http://www.marlin.ac.uk/species/detail/1994 Minke whale (Balaenoptera acutorostrata)] - MarLIN, The Marine Life Information Network bottlenose dolphins, beluga whales,[https://www.rgo.ru/en/projects/protection-endangered-species-beluga-white-whale/about-beluga About the beluga] - Russian Geographical Society orcas, and beaked whales visit the waters. In recent years, very small, but with increasing rates, fin whalesJansson N.. 2007. [http://www.aftonbladet.se/nyheter/article11115075.ab ”Vi såg valen i viken”]. Aftonbladet.\n Retrieved on September 7, 2017 and humpback whales migrate into Baltic sea including mother and calf pair. Now extinct Atlantic grey whales (remains found from Gräsö along Bothnian Sea/southern Bothnian GulfJones L.M..Swartz L.S.. Leatherwood S.. [https://books.google.co.nz/books?idGfGITi5NmJoC&pg\nPA41&lpgPA41&dq\nbothnia+whale&sourcebl&ots\n7Y4sPhp6Ps&sigmaos19QFQH8mKODdOa59cQpV5hE&hl\nen&saX&ved\n0ahUKEwjT2veQ5YvWAhXEoZQKHfxfDiA4ChDoAQglMAA#vonepage&q\nbothnia%20whale&f=false The Gray Whale: Eschrichtius Robustus]. \"Eastern Atlantic Specimens\". pp 41-44. Academic Press. Retrieved on September 05, 2017 and YstadGlobal Biodiversity Information Facility. [https://www.gbif.org/occurrence/1322462463 Occurrence Detail 1322462463]. Retrieved on September 21, 2017) and eastern population of North Atlantic right whales that is facing functional extinction once migrated into Baltic Sea.\n\nStrandings of Leatherback turtles have been recorded in Baltic Sea, too. Other notable megafauna include the basking sharks.http://deski.fi/download.php?file_name=BlnrYjTbXR.pdf\n\nEnvironmental status\n\nSatellite images taken in July 2010 revealed a massive algal bloom covering 377000 sqkm in the Baltic Sea. The area of the bloom extended from Germany and Poland to Finland. Researchers of the phenomenon have indicated that algal blooms have occurred every summer for decades. Fertilizer runoff from surrounding agricultural land has exacerbated the problem and led to increased eutrophication.\n\nApproximately 100000 km2 of the Baltic's seafloor (a quarter of its total area) is a variable dead zone. The more saline (and therefore denser) water remains on the bottom, isolating it from surface waters and the atmosphere. This leads to decreased oxygen concentrations within the zone. It is mainly bacteria that grow in it, digesting organic material and releasing hydrogen sulfide. Because of this large anaerobic zone, the seafloor ecology differs from that of the neighbouring Atlantic.\n\nPlans to artificially oxygenate areas of the Baltic that have experienced eutrophication have been proposed by the University of Gothenburg and Inocean AB. The proposal intends to use wind-driven pumps to inject oxygen (air) into waters at, or around, 130m below sea level.\n\nEconomy \n\nConstruction of the Great Belt Bridge in Denmark (completed 1997) and the Øresund Bridge-Tunnel (completed 1999), linking Denmark with Sweden, provided a highway and railroad connection between Sweden and the Danish mainland (the Jutland Peninsula, precisely the Zealand). The undersea tunnel of the Øresund Bridge-Tunnel provides for navigation of large ships into and out of the Baltic Sea. The Baltic Sea is the main trade route for export of Russian petroleum. Many of the countries neighboring the Baltic Sea have been concerned about this, since a major oil leak in a seagoing tanker would be disastrous for the Baltic—given the slow exchange of water. The tourism industry surrounding the Baltic Sea is naturally concerned about oil pollution.\n\nMuch shipbuilding is carried out in the shipyards around the Baltic Sea. The largest shipyards are at Gdańsk, Gdynia, and Szczecin, Poland; Kiel, Germany; Karlskrona and Malmö, Sweden; Rauma, Turku, and Helsinki, Finland; Riga, Ventspils, and Liepāja, Latvia; Klaipėda, Lithuania; and Saint Petersburg, Russia.\n\nThere are several cargo and passenger ferries that operate on the Baltic Sea, such as Scandlines, Silja Line, Polferries, the Viking Line, Tallink, and Superfast Ferries.\n\nTourism\n\nPiers\n* Ahlbeck (Usedom), Germany\n* Heiligendamm, Germany\n* Liepaja, Latvia\n* Klaipėda, Lithuania\n* Gdynia, Poland\n* Kołobrzeg, Poland\n* Misdroy, Poland\n* Sopot, Poland\n\nResort towns\n* Pärnu, Estonia\n* Hanko, Finland\n* Mariehamn, Finland\n* Ueckermünde, Germany\n* Travemünde, Germany\n* Jūrmala, Latvia\n* Nida, Lithuania\n* Palanga, Lithuania\n* Kamień Pomorski, Poland\n* Kołobrzeg, Poland\n* Sopot, Poland\n* Świnoujście, Poland\n* Ustka, Poland\n* Svetlogorsk, Russia\n\nThe Helsinki Convention \n\n1974 Convention\n\nFor the first time ever, all the sources of pollution around an entire sea were made subject to a single convention, signed in 1974 by the then seven Baltic coastal states. The 1974 Convention entered into force on 3 May 1980.\n\n1992 Convention\n\nIn the light of political changes and developments in international environmental and maritime law, a new convention was signed in 1992 by all the states bordering on the Baltic Sea, and the European Community. After ratification the Convention entered into force on 17 January 2000. The Convention covers the whole of the Baltic Sea area, including inland waters and the water of the sea itself, as well as the seabed. Measures are also taken in the whole catchment area of the Baltic Sea to reduce land-based pollution. The Convention on the Protection of the Marine Environment of the Baltic Sea Area, 1992, entered into force on 17 January 2000.\n\nThe governing body of the Convention is the Helsinki Commission,[http://www.helcom.fi/home/en_GB/welcome/ Helcom : Welcome] . Helcom.fi. Retrieved on 23 June 2011. also known as HELCOM, or Baltic Marine Environment Protection Commission. The present contracting parties are Denmark, Estonia, the European Community, Finland, Germany, Latvia, Lithuania, Poland, Russia and Sweden.\n\nThe ratification instruments were deposited by the European Community, Germany, Latvia and Sweden in 1994, by Estonia and Finland in 1995, by Denmark in 1996, by Lithuania in 1997 and by Poland and Russia in November 1999.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Baltic Sea" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3335" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Baltic Sea is a sea of the Atlantic Ocean, enclosed by Scandinavia, Finland, Estonia, Latvia, Lithuania, Russia, Poland, Germany and the North and Central European Plain.\n\nThe sea stretches from 53°N to 66°N latitude and from 10°E to 30°E longitude. A mediterranean sea of the Atlantic, with limited water exchange between the two bodies, the Baltic Sea drains through the Danish islands into the Kattegat by way of the straits of Øresund, the Great Belt, and the Little Belt.  It includes the Gulf of Bothnia, the Bay of Bothnia, the Gulf of Finland, the Gulf of Riga, and the Bay of Gdańsk.\n\nThe Baltic Proper is bordered on its northern edge, at the latitude 60°N, by the Åland islands and the Gulf of Bothnia, on its northeastern edge by the Gulf of Finland, on its eastern edge by the Gulf of Riga, and in the west by the Swedish part of the southern Scandinavian Peninsula.\n\nThe Baltic Sea is connected by artificial waterways to the White Sea via the White Sea Canal and to the German Bight of the North Sea via the Kiel Canal.\n\nDefinitions \n\nAdministration\n\nThe Helsinki Convention on the Protection of the Marine Environment of the Baltic Sea Area includes the Baltic Sea and the Kattegat, without calling Kattegat a part of the Baltic Sea, \"For the purposes of this Convention the \"Baltic Sea Area\" shall be the Baltic Sea and the Entrance to the Baltic Sea, bounded by the parallel of the Skaw in the Skagerrak at 57°44.43'N.\"\n\nTraffic history\n\nHistorically, the Kingdom of Denmark collected Sound Dues from ships at the border between the ocean and the land-locked Baltic Sea. They were collected in the Øresund at Kronborg castle near Helsingør, in the Great Belt at Nyborg. In the Little Belt, the site of intake was moved to Fredericia, after that stronghold had been built. The narrowest part of Little Belt is the \"Middelfart Sund\" near Middelfart.\n\nOceanography\n\nGeographers widely agree that the preferred physical border of the Baltic is a line drawn through the southern Danish islands, Drogden-Sill and Langeland. The Drogden Sill is situated north of Køge Bugt and connects Dragør in the south of Copenhagen to Malmö; it is used by the Øresund Bridge, including the Drogden Tunnel. By this definition, the Danish Straits are part of the entrance, but the Bay of Mecklenburg and the Bay of Kiel are parts of the Baltic Sea.\nAnother usual border is the line between Falsterbo, Sweden and Stevns Klint, Denmark, as this is the southern border of Øresund. It's also the border between the shallow southern Øresund (with a typical depth of 5–10 meters only) and notably deeper water.\n\nHydrography and biology\n\nDrogden Sill (depth of 7 m) sets a limit to Øresund and Darss Sill (depth of 18 m), and a limit to the Belt Sea.[https://www.kemi.se/Documents/Publikationer/Trycksaker/PM/PM-9-12-BaltSens.pd Swedish Chemicals Agency (KEMI): The BaltSens Project – The sensitivity of the Baltic Sea ecosystems to hazardous compounds] The shallow sills are obstacles to the flow of heavy salt water from the Kattegat into the basins around Bornholm and Gotland.\n\nThe Kattegat and the southwestern Baltic Sea are well oxygenated and have a rich biology. The remainder of the Sea is brackish, poor in oxygen and in species. Thus, statistically, the more of the entrance that is included in its definition, the healthier the Baltic appears; conversely, the more narrowly it is defined, the more endangered its biology appears.\n\nEtymology \n\nWhile Tacitus called it Mare Suebicum after the Germanic people of the Suebi,Tacitus, Germania([http://www.thelatinlibrary.com/tacitus/tac.ger.shtml#45 online text]): Ergo iam dextro Suebici maris litore Aestiorum gentes adluuntur, quibus ritus habitusque Sueborum, lingua Britannicae propior. – \"Upon the right of the Suevian Sea the Æstyan nations reside, who use the same customs and attire with the Suevians; their language more resembles that of Britain.\" ([http://www.gutenberg.org/files/2995/2995-h/2995-h.htm English text online]) and Ptolemy Sarmatian Ocean after the Sarmatians,Ptolemy, Geography III, chapter 5: \"Sarmatia in Europe is bounded on the north by the Sarmatian ocean at the Venedic gulf\" ([http://topostext.org/work.php?work_id209 online text]). the first to name it the Baltic Sea (Mare Balticum) was the eleventh-century German chronicler Adam of Bremen. The origin of the latter name is speculative and it was adopted into Slavic and Finnic languages spoken around the sea, very likely due to the role of Medieval Latin in cartography. It might be connected to the Germanic word belt, a name used for two of the Danish straits, the Belts, while others claim it to be directly derived from the source of the Germanic word, Latin balteus \"belt\". [http://runeberg.org/nfbb/0435.html Balteus] in Nordisk familjebok. Adam of Bremen himself compared the sea with a belt, stating that it is so named because it stretches through the land as a belt (Balticus, eo quod in modum baltei longo tractu per Scithicas regiones tendatur usque in Greciam). \n\nHe might also have been influenced by the name of a legendary island mentioned in the Natural History of Pliny the Elder. Pliny mentions an island named Baltia (or Balcia) with reference to accounts of Pytheas and Xenophon. It is possible that Pliny refers to an island named Basilia (\"the royal\") in On the Ocean by Pytheas. Baltia also might be derived from belt and mean \"near belt of sea, strait.\" \n\nMeanwhile, others have suggested that the name of the island originates from the Proto-Indo-European root *bhel meaning \"white, fair\". This root and its basic meaning were retained in both Lithuanian (as baltas) and Latvian (as balts). On this basis, a related hypothesis holds that the name originated from this Indo-European root via a Baltic language such as Lithuanian. Another explanation is that, while derived from the aforementioned root, the name of the sea is related to names for various forms of water and related substances in several European languages, that might have been originally associated with colors found in swamps (compare Proto-Slavic *bolto \"swamp\"). Yet another explanation is that the name originally meant \"enclosed sea, bay\" as opposed to open sea. Some Swedish historians believe the name derives from the god Baldr of Nordic mythology.\n\nIn the Middle Ages the sea was known by a variety of names. The name Baltic Sea became dominant only after 1600. Usage of Baltic and similar terms to denote the region east of the sea started only in 19th century.\n\nName in other languages\n\nThe Baltic Sea was known in ancient Latin language sources as Mare Suebicum or even Mare Germanicum.Cfr. Hartmann Schedel's 1493 (map), where the Baltic Sea is called Mare Germanicum, whereas the Northern Sea is called Oceanus Germanicus. Older native names in languages that used to be spoken on the shores of the sea or near it usually indicate the geographical location of the sea (in Germanic languages), or its size in relation to smaller gulfs (in Old Latvian), or tribes associated with it (in Old Russian the sea was known as the Varanghian Sea). In modern languages it is known by the equivalents of \"East Sea\", \"West Sea\", or \"Baltic Sea\" in different languages:\n\n* \"Baltic Sea\" is used in English; in the Baltic languages Latvian (Baltijas jūra; in Old Latvian it was referred to as \"the Big Sea\", while the present day Gulf of Riga was referred to as \"the Little Sea\") and Lithuanian (Baltijos jūra); in Latin (Mare Balticum) and the Romance languages French (Mer Baltique), Italian (Mar Baltico), Portuguese (Mar Báltico), Romanian (Marea Baltică) and Spanish (Mar Báltico); in Greek (Βαλτική Θάλασσα Valtikí Thálassa); in Albanian (Deti Balltik); in Welsh (Môr Baltig); in the Slavic languages Polish (Morze Bałtyckie or Bałtyk), Czech (Baltské moře or Balt), Slovenian (Baltsko morje), Bulgarian (Балтийско море Baltijsko More), Kashubian (Bôłt), Macedonian (Балтичко Море Baltičko More), Ukrainian (Балтійське море Baltijs′ke More), Belarusian (Балтыйскае мора Baltyjskaje Mora), Russian (Балтийское море Baltiyskoye More) and Serbo-Croatian (Baltičko more / Балтичко море); in Hungarian (Balti-tenger).\n* In Germanic languages, except English, \"East Sea\" is used, as in Afrikaans (Oossee), Danish (Østersøen), Dutch (Oostzee), German (Ostsee), Icelandic and Faroese (Eystrasalt), Norwegian (Østersjøen), and Swedish (Östersjön). In Old English it was known as Ostsæ; also in Hungarian the former name was Keleti-tenger (due to German influence). In addition, Finnish, a Finnic language, has calqued the Swedish term as Itämeri \"East Sea\", disregarding the geography (the sea is west of Finland), though understandably since Finland was a part of Sweden from the Middle Ages until 1809.\n* In another Finnic language, Estonian, it is called the \"West Sea\" (Läänemeri), with the correct geography (the sea is west of Estonia).\n\nHistory \n\nClassical world\n\nAt the time of the Roman Empire, the Baltic Sea was known as the Mare Suebicum or Mare Sarmaticum. Tacitus in his AD 98 Agricola and Germania described the Mare Suebicum, named for the Suebi tribe, during the spring months, as a brackish sea where the ice broke apart and chunks floated about. The Suebi eventually migrated southwest to reside for a while in the Rhineland area of modern Germany, where their name survives in the historic region known as Swabia. Jordanes called it the Germanic Sea in his work, the Getica.\n\nMiddle Ages\n\nIn the early Middle Ages, Norse (Scandinavian) merchants built a trade empire all around the Baltic. Later, the Norse fought for control of the Baltic against Wendish tribes dwelling on the southern shore. The Norse also used the rivers of Russia for trade routes, finding their way eventually to the Black Sea and southern Russia. This Norse-dominated period is referred to as the Viking Age.\n\nSince the Viking age, the Scandinavians have referred to the Baltic Sea as Austmarr (\"Eastern Lake\"). \"Eastern Sea\", appears in the Heimskringla and Eystra salt appears in Sörla þáttr. Saxo Grammaticus recorded in Gesta Danorum an older name, Gandvik, -vik being Old Norse for \"bay\", which implies that the Vikings correctly regarded it as an inlet of the sea. Another form of the name, \"Grandvik\", attested in at least one English translation of Gesta Danorum, is likely to be a misspelling.)\n\nIn addition to fish the sea also provides amber, especially from its southern shores within today's borders of Poland, Russia and Lithuania. First mentions of amber deposits on the South coast of the Baltic Sea date back to the 12th century.[https://ambery.net/blog/2016/07/history-of-russian-amber-1/ \"The History of Russian Amber, Part 1: The Beginning\"], Ambery.net The bordering countries have also traditionally exported lumber, wood tar, flax, hemp and furs by ship across the Baltic. Sweden had from early medieval times exported iron and silver mined there, while Poland had and still has extensive salt mines. Thus the Baltic Sea has long been crossed by much merchant shipping.\n\nThe lands on the Baltic's eastern shore were among the last in Europe to be converted to Christianity. This finally happened during the Northern Crusades: Finland in the twelfth century by Swedes, and what are now Estonia and Latvia in the early thirteenth century by Danes and Germans (Livonian Brothers of the Sword). The Teutonic Order gained control over parts of the southern and eastern shore of the Baltic Sea, where they set up their monastic state. Lithuania was the last European state to convert to Christianity.\n\nAn arena of conflict\n\nIn the period between the 8th and 14th centuries, there was much piracy in the Baltic  from the coasts of Pomerania and Prussia, and the Victual Brothers even held Gotland.\n\nStarting in the 11th century, the southern and eastern shores of the Baltic were settled by migrants mainly from Germany, a movement called the Ostsiedlung (\"east settling\"). Other settlers were from the Netherlands, Denmark, and Scotland. The Polabian Slavs were gradually assimilated by the Germans.[http://www.britannica.com/EBchecked/topic/639735/Wend Wend – West Wend]. Britannica.com. Retrieved on 23 June 2011. Denmark gradually gained control over most of the Baltic coast, until she lost much of her possessions after being defeated in the 1227 Battle of Bornhöved.\n\nIn the 13th to 16th centuries, the strongest economic force in Northern Europe was the Hanseatic League, a federation of merchant cities around the Baltic Sea and the North Sea. In the sixteenth and early seventeenth centuries, Poland, Denmark, and Sweden fought wars for Dominium maris baltici (\"Lordship over the Baltic Sea\"). Eventually, it was Sweden that virtually encompassed the Baltic Sea. In Sweden the sea was then referred to as Mare Nostrum Balticum (\"Our Baltic Sea\"). The goal of Swedish warfare during the 17th century was to make the Baltic Sea an all-Swedish sea (Ett Svenskt innanhav), something that was accomplished except the rout between Riga in Latvia and Stettin in Pomerania.  However, it was the Dutch who dominated Baltic trade in the seventeenth century.\n\nIn the eighteenth century, Russia and Prussia became the leading powers over the sea. Sweden's defeat in the Great Northern War brought Russia to the eastern coast. Russia became and remained a dominating power in the Baltic. Russia's Peter the Great saw the strategic importance of the Baltic and decided to found his new capital, Saint Petersburg, at the mouth of the Neva river at the east end of the Gulf of Finland. There was much trading not just within the Baltic region but also with the North Sea region, especially eastern England and the Netherlands: their fleets needed the Baltic timber, tar, flax and hemp.\n\nDuring the Crimean War, a joint British and French fleet attacked the Russian fortresses in the Baltic. They bombarded Sveaborg, which guards Helsinki; and Kronstadt, which guards Saint Petersburg; and they destroyed Bomarsund in the Åland Islands. After the unification of Germany in 1871, the whole southern coast became German. World War I was partly fought in the Baltic Sea. After 1920 Poland was connected to the Baltic Sea by the Polish Corridor and enlarged the port of Gdynia in rivalry with the port of the Free City of Danzig.\n\nDuring World War II, Germany reclaimed all of the southern and much of the eastern shore by occupying Poland and the Baltic states. In 1945, the Baltic Sea became a mass grave for retreating soldiers and refugees on torpedoed troop transports. The sinking of the Wilhelm Gustloff remains the worst maritime disaster in history, killing (very roughly) 9,000 people. In 2005, a Russian group of scientists found over five thousand airplane wrecks, sunken warships, and other material, mainly from World War II, on the bottom of the sea.\n\nSince World War II\n\nSince the end of World War II, various nations, including the Soviet Union, the United Kingdom and the United States, have disposed of chemical weapons in the Baltic Sea, raising concerns of environmental contamination.[http://www.dw-world.de/dw/article/0,,3102728,00.html Chemical Weapon Time Bomb Ticks in the Baltic Sea] Deutsche Welle, 1 February 2008. Even now fishermen accidentally retrieve some of these materials: the most recent available report from the Helsinki Commission notes that four small scale catches of chemical munitions representing approximately 105 kg of material were reported in 2005. This is a reduction from the 25 incidents representing 1110 kg of material in 2003.[http://www.helcom.fi/stc/files/Publications/Proceedings/bsep112.pdf Activities 2006: Overview]  Baltic Sea Environment Proceedings No. 112. Helsinki Commission. Until now, the U.S. Government refuses to disclose the exact coordinates of the wreck sites. Rotting bottles leak Lost and other substances, thus slowly poisoning a substantial part of the Baltic Sea.\n\nAfter 1945, the German population was expelled from all areas east of the Oder-Neisse line, making room for displaced Poles and Russians. Poland gained most of the southern shore. The Soviet Union gained another access to the Baltic with the Kaliningrad Oblast. The Baltic states on the eastern shore were annexed by the Soviet Union. The Baltic then separated opposing military blocs: NATO and the Warsaw Pact. Had war broken out, the Polish navy was prepared to invade the Danish isles. This border status restricted trade and travel. It ended only after the collapse of the Communist regimes in Central and Eastern Europe in the late 1980s.\n\nSince May 2004, with the accession of the Baltic states and Poland, the Baltic Sea has been almost entirely surrounded by countries of the European Union (EU). The only remaining non-EU shore areas are Russian: the Saint Petersburg area and the exclave of the Kaliningrad Oblast.\n\nWinter storms begin arriving in the region during October. These have caused numerous shipwrecks, and contributed to the extreme difficulties of rescuing passengers of the ferry M/S Estonia en route from Tallinn, Estonia, to Stockholm, Sweden, in September 1994, which claimed the lives of 852 people. Older, wood-based shipwrecks such as the Vasa tend to remain well-preserved, as the Baltic's cold and brackish water does not suit the shipworm.\n\nStorm floods\n\nStorm surge floodings are generally taken to occur when the water level is more than one metre above normal. In Warnemünde about 110 floods occurred from 1950 to 2000, an average of just over two per year.\n\nHistoric flood events were the All Saints' Flood of 1304 and other floods in the years 1320, 1449, 1625, 1694, 1784 and 1825. Little is known of their extent. Citing  From 1872, there exist regular and reliable records of water levels in the Baltic Sea. The highest was the flood of 1872 when the water was an average of  above sea level at Warnemünde and a maximum of  above sea level in Warnemünde. In the last very heavy floods the average water levels reached  above sea level in 1904,  in 1913,  in January 1954,  on 2–4 November 1995 and  on 21 February 2002.\n\nGeography \n\nGeophysical data \n\nAn arm of the North Atlantic Ocean, the Baltic Sea is enclosed by Sweden and Denmark to the northwest, Finland to the northeast, the Baltic countries to the southeast, and the North European Plain to the southwest.\n\nIt is about 1600 km long, an average of 193 km wide, and an average of 55 m deep. The maximum depth is 459 m which is on the Swedish side of the center. The surface area is about 349644 km2  and the volume is about 20000 km3. The periphery amounts to about 8000 km of coastline. at envir.ee. (archived) (2006-04-21). Retrieved on 23 June 2011.\n\nThe Baltic Sea is one of the largest brackish inland seas by area, and occupies a basin (a zungenbecken) formed by glacial erosion during the last few ice ages.\n\nPhysical characteristics of the Baltic Sea, its main sub-regions, and the transition zone to the Skagerrak/North Sea area[http://www.helcom.fi/Lists/Publications/BSEP104.pdf p. 7]\n\nExtent\n\nThe International Hydrographic Organization defines the limits of the Baltic Sea as follows:\n\nBordered by the coasts of Germany, Denmark, Poland, Sweden, Finland, Russia, Estonia, Latvia and Lithuania, it extends north-eastward of the following limits:\n*In the Little Belt. A line joining Falshöft () and Vejsnæs Nakke (Ærø: ).\n*In the Great Belt. A line joining Gulstav (South extreme of Langeland Island) and Kappel Kirke () on Island of Lolland.\n*In the Guldborg Sound. A line joining Flinthorne-Rev and Skjelby ().\n*In the Sound. A line joining Stevns Lighthouse () and Falsterbo Point ().\n\nSubdivisions\n\nThe northern part of the Baltic Sea is known as the Gulf of Bothnia, of which the northernmost part is the Bay of Bothnia  or Bothnian Bay. The more rounded southern basin of the gulf is called Bothnian Sea and immediately to the south of it lies the Sea of Åland. The Gulf of Finland connects the Baltic Sea with Saint Petersburg. The Gulf of Riga lies between the Latvian capital city of Riga and the Estonian island of Saaremaa.\n\nThe Northern Baltic Sea lies between the Stockholm area, southwestern Finland and Estonia. The Western and Eastern Gotland Basins form the major parts of the Central Baltic Sea or Baltic proper. The Bornholm Basin is the area east of Bornholm, and the shallower Arkona Basin extends from Bornholm to the Danish isles of Falster and Zealand.\n\nIn the south, the Bay of Gdańsk lies east of the Hel Peninsula on the Polish coast and west of the Sambia Peninsula in Kaliningrad Oblast. The Bay of Pomerania lies north of the islands of Usedom and Wolin, east of Rügen. Between Falster and the German coast lie the Bay of Mecklenburg and Bay of Lübeck. The westernmost part of the Baltic Sea is the Bay of Kiel. The three Danish straits, the Great Belt, the Little Belt and The Sound (Öresund/Øresund), connect the Baltic Sea with the Kattegat  and Skagerrak strait in the North Sea.\n\nThe ice\n\nOn the long-term average, the Baltic Sea is ice-covered at the annual maximum for about 45% of its surface area. The ice-covered area during such a typical winter includes the Gulf of Bothnia, the Gulf of Finland, the Gulf of Riga, the archipelago west of Estonia, the Stockholm archipelago, and the Archipelago Sea southwest of Finland. The remainder of the Baltic does not freeze during a normal winter, with the exception of sheltered bays and shallow lagoons such as the Curonian Lagoon. The ice reaches its maximum extent in February or March; typical ice thickness in the northernmost areas in the Bothnian Bay, the northern basin of the Gulf of Bothnia, is about 70 cm for landfast sea ice. The thickness decreases farther south.\n\nFreezing begins in the northern extremities of Gulf of Bothnia typically in the middle of November, reaching the open waters of the Bothnian Bay in early January. The Bothnian Sea, the basin south of Kvarken, freezes on average in late February. The Gulf of Finland and the Gulf of Riga freeze typically in late January. In 2011, the Gulf of Finland was completely frozen on 15 February.Helsingin Sanomat, 16 February 2011, p. A8.\n\nThe ice extent depends on whether the winter is mild, moderate, or severe. Severe winters can lead to ice formation around southern Sweden and even in the Danish straits. According to the 18th-century natural historian William Derham, during the severe winters of 1703 and 1708, the ice cover reached as far as the Danish straits.Derham, William Physico-Theology: Or, A Demonstration of the Being and Attributes of God from His Works of Creation (London, 1713). Frequently, parts of the Gulf of Bothnia and Gulf of Finland are frozen, in addition to coastal fringes in more southerly locations such as the Gulf of Riga. This description meant that the whole of the Baltic Sea was covered with ice.\n\nIt is known that since 1720, the Baltic Sea has frozen over entirely a total of 20 times. The most recent case was in early 1987, which was the most severe winter in Scandinavia since that date. The ice then covered . During the winter of 2010–11, which was quite severe compared to those of the last decades, the maximum ice cover was , which was reached on 25 February 2011. The ice then extended from the north down to the northern tip of Gotland, with small ice-free areas on either side, and the east coast of the Baltic Sea was covered by an ice sheet about 25 to wide all the way to Gdańsk. This was brought about by a stagnant high-pressure area that lingered over central and northern Scandinavia from around 10 to 24 February. After this, strong southern winds pushed the ice further into the north, and much of the waters north of Gotland were again free of ice, which had then packed against the shores of southern Finland.Helsingin Sanomat, 10 February 2011, p. A4; 25 February 2011, p. A5; 11 June 2011, p. A12. The effects of the afore-mentioned high-pressure area did not reach the southern parts of the Baltic Sea, and thus the entire sea did not freeze over. However, floating ice was additionally observed near Świnoujście harbour in January 2010.\n\nIn recent years prior to 2011, the Bothnian Bay and the Bothnian Sea were frozen with solid ice near the Baltic coast and dense floating ice far from it. In 2008, there was almost no ice formation except for a short period in March.[http://www.ssec.wisc.edu/ Sea Ice Survey] Space Science and Engineering Center, University of Wisconsin.\n\nDuring winter, fast ice, which is attached to the shoreline, develops first, rendering ports unusable without the services of icebreakers. Level ice, ice sludge, pancake ice, and rafter ice form in the more open regions. The gleaming expanse of ice is similar to the Arctic, with wind-driven pack ice and ridges up to 15 m. Offshore of the landfast ice, the ice remains very dynamic all year, and it is relatively easily moved around by winds and therefore forms pack ice, made up of large piles and ridges pushed against the landfast ice and shores.\n\nIn spring, the Gulf of Finland and the Gulf of Bothnia normally thaw in late April, with some ice ridges persisting until May in the eastern extremities of the Gulf of Finland. In the northernmost reaches of the Bothnian Bay, ice usually stays until late May; by early June it is practically always gone. However, in the famine year of 1867 remnants of ice were observed as late as July 17 near Uddskär. Even as far south as Øresund, remnants of ice have been observed in May on several occasions; near Taarbaek on May 15, 1942 and near Copenhagen on May 11, 1771. Drift ice was also observed on May 11, 1799.\n\nThe ice cover is the main habitat for two large mammals, the grey seal (Halichoerus grypus) and the Baltic ringed seal (Pusa hispida botnica), both of which feed underneath the ice and breed on its surface. Of these two seals, only the Baltic ringed seal suffers when there is not adequate ice in the Baltic Sea, as it feeds its young only while on ice. The grey seal is adapted to reproducing also with no ice in the sea. The sea ice also harbours several species of algae that live in the bottom and inside unfrozen brine pockets in the ice.\n\nHydrography\n\nThe Baltic Sea flows out through the Danish straits; however, the flow is complex. A surface layer of brackish water discharges 940 km3 per year into the North Sea. Due to the difference in salinity, by salinity permeation principle, a sub-surface layer of more saline water moving in the opposite direction brings in 475 km3 per year. It mixes very slowly with the upper waters, resulting in a salinity gradient from top to bottom, with most of the salt water remaining below 40 to deep. The general circulation is anti-clockwise: northwards along its eastern boundary, and south along the western one .Alhonen, p. 88\n\nThe difference between the outflow and the inflow comes entirely from fresh water. More than 250 streams drain a basin of about 1600000 km2, contributing a volume of 660 km3 per year to the Baltic. They include the major rivers of north Europe, such as the Oder, the Vistula, the Neman, the Daugava and the Neva. Additional fresh water comes from the difference of precipitation less evaporation, which is positive.\n\nAn important source of salty water are infrequent inflows of North Sea water into the Baltic. Such inflows, important to the Baltic ecosystem because of the oxygen they transport into the Baltic deeps, used to happen on average every four to five years until the 1980s. In recent decades they have become less frequent. The latest four occurred in 1983, 1993, 2003 and 2014 suggesting a new inter-inflow period of about ten years.\n\nThe water level is generally far more dependent on the regional wind situation than on tidal effects. However, tidal currents occur in narrow passages in the western parts of the Baltic Sea.\n\nThe significant wave height is generally much lower than that of the North Sea. Violent and sudden storms often sweep the surface, due to large transient temperature differences and a long reach of wind. Seasonal winds also cause small changes in sea level, of the order of  .\n\nSalinity\n\nThe Baltic Sea's salinity is much lower than that of ocean water (which averages 3.5%), as a result of abundant freshwater runoff from the surrounding land, combined with the shallowness of the sea itself; runoff contributes roughly one-fortieth its total volume per year, as the volume of the basin is about  and yearly runoff is about 500 km3. The open surface waters of the central basin have salinity of 0.5% to 0.8%, which makes the basin border-line freshwater. Drinking the water as a means of survival would actually hydrate the body instead of dehydrating, as is the case with ocean water.A healthy serum concentration of sodium is around 0.8–0.85%, and healthy kidneys can concentrate salt in urine to at least 1.4%. At the semi-enclosed bays with major freshwater inflows, such as the head of Finnish Gulf with the Neva mouth and the head of the Bothnian Gulf with the close mouths of the Lule, Tornio and Kemi, the salinity is considerably lower. Below 40 to, the salinity is between 1.0% and 1.5% in the open Baltic Sea, and higher near the Danish Straits, but this is still less than half that of ocean water.\n\nThe flow of fresh water into the sea from approximately two hundred rivers and the introduction of salt from the South builds up a gradient of salinity in the Baltic Sea. Near the Danish straits the salinity is close to that of the Kattegat, but still not fully oceanic, because the saltiest water that passes the straits is already mixed with considerable amounts of outflow water. The salinity steadily decreases towards North and East. At the northern part of the Gulf of Bothnia the water is no longer salty and many fresh water species live in the sea. The salinity gradient is paralleled by a temperature gradient. These two factors limit many species of animals and plants to a relatively narrow region of the Baltic Sea.\n\nThe most saline water is vertically stratified in the water column to the north, creating a barrier to the exchange of oxygen and nutrients, and fostering completely separate maritime environments.  , Jan Thulin and Andris Andrushaitis, Religion, Science and the Environment Symposium V on the Baltic Sea (2003).\n\nMajor tributaries \n\nThe rating of mean discharges differs from the ranking of hydrological lengths (from the most distant source to the sea) and the rating of the nominal lengths. Göta älv, a tributary of the Kattegat, is not listed, as due to the northward upper low-salinity-flow in the sea, its water hardly reaches the Baltic proper:\n\nIslands and archipelagoes \n\n* Åland Islands (Finland, autonomous)\n* Archipelago Sea (Finland)\n** Pargas\n** Nagu\n** Korpo\n** Houtskär\n** Kustavi\n** Kimito\n* Blekinge archipelago (Sweden)\n* Bornholm, including Christiansø (Denmark)\n* Falster (Denmark)\n* Gotland (Sweden)\n* Hailuoto (Finland)\n* Kotlin (Russia)\n* Lolland (Denmark)\n* Kvarken archipelago, including Valsörarna (Finland)\n* Møn (Denmark)\n* Öland (Sweden)\n* Rügen (Germany)\n* Stockholm archipelago (Sweden)\n** Värmdön (Sweden)\n* Usedom or Uznam (split between Germany and Poland)\n* West Estonian archipelago (Estonia):\n** Hiiumaa\n** Muhu\n** Saaremaa\n** Vormsi\n* Wolin (Poland)\n* Zealand (Denmark)\n\nCoastal countries\n\nCountries that border the sea:\n\n, , , , , , , , .\n\nCountries that are in the drainage basin but do not border the sea:\n\n, , , , .\n\nThe Baltic sea drainage basin is roughly four times the surface area of the sea itself. About 48% of the region is forested, with Sweden and Finland containing the majority of the forest, especially around the Gulfs of Bothnia and Finland.\n\nAbout 20% of the land is used for agriculture and pasture, mainly in Poland and around the edge of the Baltic Proper, in Germany, Denmark and Sweden. About 17% of the basin is unused open land with another 8% of wetlands. Most of the latter are in the Gulfs of Bothnia and Finland.\n\nThe rest of the land is heavily populated. About 85 million people live in the Baltic drainage basin, 15 million within 10 km of the coast and 29 million within 50 km of the coast. Around 22 million live in population centers of over 250,000. 90% of these are concentrated in the 10 km band around the coast. Of the nations containing all or part of the basin, Poland includes 45% of the 85 million, Russia 12%, Sweden 10% and the others less than 6% each.\n\nCities \n\nThe biggest coastal cities (by population):\n* Saint Petersburg (Russia) 4,700,000 (metropolitan area 6,000,000)\n* Stockholm (Sweden) 843,139 (metropolitan area 2,046,103)\n* Riga (Latvia) 696,567 (metropolitan area 842,000)\n* Helsinki (Finland) 605,022 (metropolitan area 1,358,901)\n* Gdańsk (Poland) 462,700 (metropolitan area 1,041,000)\n* Tallinn (Estonia) 435,245 (metropolitan area 542,983)\n* Kaliningrad (Russia) 431,500\n* Szczecin (Poland) 413,600 (metropolitan area 778,000)\n* Gdynia (Poland) 255,600 (metropolitan area 1,041,000)\n* Kiel (Germany) 242,000[http://www.kiel.de/rathaus/statistik/statistische_berichte/statistische_kurzinformationen/2012/Kurzinfo_Nr._151_-_Amtliche_Einwohnerzahl_im_Dezember_2011.pdf Statistische Kurzinformation]  (in German). Landeshauptstadt Kiel. Amt für Kommunikation, Standortmarketing und Wirtschaftsfragen Abteilung Statistik. Retrieved on 11 October 2012.\n* Espoo (Finland) 257,195 (part of Helsinki metropolitan area)\n* Lübeck (Germany) 216,100\n* Rostock (Germany) 212,700\n* Klaipėda (Lithuania) 194,400\n* Oulu (Finland) 191,050\n* Turku (Finland) 180,350\n\nImportant ports:\n\nEstonia:\n* Pärnu 44,568\n* Maardu 16,570\n* Sillamäe 16,567\n\nFinland:\n* Pori 83,272\n* Kotka 54,887\n* Kokkola 46,809\n* Port of Naantali 18,789\n* Mariehamn 11,372\n* Hanko 9,270\n\nGermany:\n* Stralsund 58,000\n* Greifswald 55,000\n* Wismar 44,000\n* Eckernförde 22,000\n* Neustadt in Holstein 16,000\n* Wolgast 12,000\n* Sassnitz 10,000\n\nLatvia:\n* Liepāja 85,000\n* Ventspils 44,000\n\nLithuania:\n* Klaipėda 194,000\n* Palanga 15,000\n\nPoland:\n* Kołobrzeg 44,800\n* Świnoujście 41,500\n* Police 34,284\n* Władysławowo 15,000\n* Darłowo 14,000\n\nRussia:\n* Vyborg 79,962\n* Baltiysk 34,000\n\nSweden:\n* Norrköping 84,000\n* Gävle 69,000\n* Trelleborg 26,000\n* Karlshamn 19,000\n* Oxelösund 11,000\n\nGeology\n\nThe Baltic Sea somewhat resembles a riverbed, with two tributaries, the Gulf of Finland and Gulf of Bothnia. Geological surveys show that before the Pleistocene, instead of the Baltic Sea, there was a wide plain around a great river paleontologists call the Eridanos. Several Pleistocene glacial episodes scooped out the river bed into the sea basin. By the time of the last, or Eemian Stage (MIS 5e), the Eemian Sea was in place. Instead of a true sea, the Baltic can even today also be understood as the common estuary of all rivers flowing into it.\n\nFrom that time the waters underwent a geologic history summarized under the names listed below. Many of the stages are named after marine animals (e.g. the Littorina mollusk) that are clear markers of changing water temperatures and salinity.\n\nThe factors that determined the sea's characteristics were the submergence or emergence of the region due to the weight of ice and subsequent isostatic readjustment, and the connecting channels it found to the North Sea-Atlantic, either through the straits of Denmark or at what are now the large lakes of Sweden, and the White Sea-Arctic Sea.\n* Eemian Sea, 130,000–115,000 (years ago)\n* Baltic Ice Lake, 12,600–10,300\n* Yoldia Sea, 10,300–9500\n* Ancylus Lake, 9,500–8,000\n* Mastogloia Sea 8,000–7,500\n* Littorina Sea, 7,500–4,000\n* Post-Littorina Sea 4,000–present\n\nThe land is still emerging isostatically from its depressed state, which was caused by the weight of ice during the last glaciation. The phenomenon is known as post-glacial rebound. Consequently, the surface area and the depth of the sea are diminishing. The uplift is about eight millimetres per year on the Finnish coast of the northernmost Gulf of Bothnia. In the area, the former seabed is only gently sloping, leading to large areas of land being reclaimed in what are, geologically speaking, relatively short periods (decades and centuries).\n\nAnomalous object/formation\n\nThe Baltic Sea anomaly is a 60-metre (200 ft) diameter circular rock-like formation on the floor of the northern Baltic Sea at the center of the Bothnian Sea, discovered by Peter Lindberg, Dennis Åsberg and their Swedish \"Ocean X\" diving team in June 2011. The team reported that the formation rests on a pillar and includes a structure similar in appearance to a staircase, leading to a dark hole.\n\nAccording to Ocean X, the formation has an appearance of \"rough granite\", is round, 3 to thick and approximately 60 m in diameter, stands on an 8 m pillar-like feature, and is located at a depth of 85 to. There is also another smaller object not far away.Danish: [http://videnskab.dk/miljo-naturvidenskab/nye-billeder-ukendt-objekt-i-ostersoen-er-ren-x-files 16. juli 2012, videnskab.dk: Nye billeder: Ukendt objekt i Østersøen er ren X-files] Quote: \"...Objektet er som først antaget 60 meter langt og nøjagtig lige så bredt...\"Swedish: [http://www.expressen.se/nyheter/sa-ser-den-mystiska-cirkeln-ut-pa-nara-hall/ 15 jun 2012, expressen.se: Så ser den mystiska cirkeln ut på nära håll] The object is at the end of what resembles a 300 m \"runway\".Danish: \n\nThe Ocean X team has published one additional close-up sonar scan on their Web site and nine additional close-up sonar scans on their YouTube page that appear to show a 90-degree angle and other features of the object.http://www.oceanexplorer.se/wp-content/uploads/2012/05/456_90D.jpg\n\nOn their second expedition, they reported that they found something that looks like a staircase and a round black hole that goes directly into the structure.Swedish: [http://www.expressen.se/nyheter/trappa-senaste-fyndet-vid-mystiska-cirkeln/ 12 Aug 2012, expressen.se: Trappa senaste fyndet vid mystiska cirkeln]\n\nBiology \n\nFauna\n\nThe fauna of the Baltic sea is a mixture of marine and freshwater species. Among marine fishes are cod, herring, hake, plaice, flounder, shorthorn sculpin, stickleback and turbot, and examples of freshwater species include perch, pike, whitefish and roach.\n\nThere is a decrease in faunal species from the Belts to the Gulf of Bothnia. The decreasing salinity along this path causes restrictions in both physiology and habitats. The lack of tides has affected the marine species as compared with the Atlantic.\n\nSince the Baltic Sea is so young there are only a few endemic species. The mostly asexually reproducing brown alga Fucus radicans seems to have evolved in the basin. Another endemic is the Copenhagen cockle parvicardium hauniense. However, several marine species have populations in the Baltic Sea adapted to the low salinity, such as the Baltic Sea herring which is smaller than the Atlantic herring.\n\nA peculiar feature of the fauna is that it contains a number of glacial relict species, isolated populations of arctic species which have remained in the Baltic Sea since the last glaciation, such as the large isopod Saduria entomon, the Baltic subspecies of ringed seal, and the fourhorn sculpin. Some of these relicts are derived from glacial lakes, such as  Monoporeia affinis, which is a main element in the benthic fauna of the low-salinity Bothnian Bay.\n\nCetaceans in Baltic Sea have been monitored by the ASCOBANS. Critically endangered populations of Atlantic white-sided dolphins and harbor porpoises inhabit the sea where white-colored porpoises have been recorded, and occasionally oceanic and out-of-range species such as minke whales,[http://www.marlin.ac.uk/species/detail/1994 Minke whale (Balaenoptera acutorostrata)] - MarLIN, The Marine Life Information Network bottlenose dolphins, beluga whales,[https://www.rgo.ru/en/projects/protection-endangered-species-beluga-white-whale/about-beluga About the beluga] - Russian Geographical Society orcas, and beaked whales visit the waters. In recent years, very small, but with increasing rates, fin whalesJansson N.. 2007. [http://www.aftonbladet.se/nyheter/article11115075.ab ”Vi såg valen i viken”]. Aftonbladet.\n Retrieved on September 7, 2017 and humpback whales migrate into Baltic sea including mother and calf pair. Now extinct Atlantic grey whales (remains found from Gräsö along Bothnian Sea/southern Bothnian GulfJones L.M..Swartz L.S.. Leatherwood S.. [https://books.google.co.nz/books?idGfGITi5NmJoC&pg\nPA41&lpgPA41&dq\nbothnia+whale&sourcebl&ots\n7Y4sPhp6Ps&sigmaos19QFQH8mKODdOa59cQpV5hE&hl\nen&saX&ved\n0ahUKEwjT2veQ5YvWAhXEoZQKHfxfDiA4ChDoAQglMAA#vonepage&q\nbothnia%20whale&f=false The Gray Whale: Eschrichtius Robustus]. \"Eastern Atlantic Specimens\". pp 41-44. Academic Press. Retrieved on September 05, 2017 and YstadGlobal Biodiversity Information Facility. [https://www.gbif.org/occurrence/1322462463 Occurrence Detail 1322462463]. Retrieved on September 21, 2017) and eastern population of North Atlantic right whales that is facing functional extinction once migrated into Baltic Sea.\n\nStrandings of Leatherback turtles have been recorded in Baltic Sea, too. Other notable megafauna include the basking sharks.http://deski.fi/download.php?file_name=BlnrYjTbXR.pdf\n\nEnvironmental status\n\nSatellite images taken in July 2010 revealed a massive algal bloom covering 377000 sqkm in the Baltic Sea. The area of the bloom extended from Germany and Poland to Finland. Researchers of the phenomenon have indicated that algal blooms have occurred every summer for decades. Fertilizer runoff from surrounding agricultural land has exacerbated the problem and led to increased eutrophication.\n\nApproximately 100000 km2 of the Baltic's seafloor (a quarter of its total area) is a variable dead zone. The more saline (and therefore denser) water remains on the bottom, isolating it from surface waters and the atmosphere. This leads to decreased oxygen concentrations within the zone. It is mainly bacteria that grow in it, digesting organic material and releasing hydrogen sulfide. Because of this large anaerobic zone, the seafloor ecology differs from that of the neighbouring Atlantic.\n\nPlans to artificially oxygenate areas of the Baltic that have experienced eutrophication have been proposed by the University of Gothenburg and Inocean AB. The proposal intends to use wind-driven pumps to inject oxygen (air) into waters at, or around, 130m below sea level.\n\nEconomy \n\nConstruction of the Great Belt Bridge in Denmark (completed 1997) and the Øresund Bridge-Tunnel (completed 1999), linking Denmark with Sweden, provided a highway and railroad connection between Sweden and the Danish mainland (the Jutland Peninsula, precisely the Zealand). The undersea tunnel of the Øresund Bridge-Tunnel provides for navigation of large ships into and out of the Baltic Sea. The Baltic Sea is the main trade route for export of Russian petroleum. Many of the countries neighboring the Baltic Sea have been concerned about this, since a major oil leak in a seagoing tanker would be disastrous for the Baltic—given the slow exchange of water. The tourism industry surrounding the Baltic Sea is naturally concerned about oil pollution.\n\nMuch shipbuilding is carried out in the shipyards around the Baltic Sea. The largest shipyards are at Gdańsk, Gdynia, and Szczecin, Poland; Kiel, Germany; Karlskrona and Malmö, Sweden; Rauma, Turku, and Helsinki, Finland; Riga, Ventspils, and Liepāja, Latvia; Klaipėda, Lithuania; and Saint Petersburg, Russia.\n\nThere are several cargo and passenger ferries that operate on the Baltic Sea, such as Scandlines, Silja Line, Polferries, the Viking Line, Tallink, and Superfast Ferries.\n\nTourism\n\nPiers\n* Ahlbeck (Usedom), Germany\n* Heiligendamm, Germany\n* Liepaja, Latvia\n* Klaipėda, Lithuania\n* Gdynia, Poland\n* Kołobrzeg, Poland\n* Misdroy, Poland\n* Sopot, Poland\n\nResort towns\n* Pärnu, Estonia\n* Hanko, Finland\n* Mariehamn, Finland\n* Ueckermünde, Germany\n* Travemünde, Germany\n* Jūrmala, Latvia\n* Nida, Lithuania\n* Palanga, Lithuania\n* Kamień Pomorski, Poland\n* Kołobrzeg, Poland\n* Sopot, Poland\n* Świnoujście, Poland\n* Ustka, Poland\n* Svetlogorsk, Russia\n\nThe Helsinki Convention \n\n1974 Convention\n\nFor the first time ever, all the sources of pollution around an entire sea were made subject to a single convention, signed in 1974 by the then seven Baltic coastal states. The 1974 Convention entered into force on 3 May 1980.\n\n1992 Convention\n\nIn the light of political changes and developments in international environmental and maritime law, a new convention was signed in 1992 by all the states bordering on the Baltic Sea, and the European Community. After ratification the Convention entered into force on 17 January 2000. The Convention covers the whole of the Baltic Sea area, including inland waters and the water of the sea itself, as well as the seabed. Measures are also taken in the whole catchment area of the Baltic Sea to reduce land-based pollution. The Convention on the Protection of the Marine Environment of the Baltic Sea Area, 1992, entered into force on 17 January 2000.\n\nThe governing body of the Convention is the Helsinki Commission,[http://www.helcom.fi/home/en_GB/welcome/ Helcom : Welcome] . Helcom.fi. Retrieved on 23 June 2011. also known as HELCOM, or Baltic Marine Environment Protection Commission. The present contracting parties are Denmark, Estonia, the European Community, Finland, Germany, Latvia, Lithuania, Poland, Russia and Sweden.\n\nThe ratification instruments were deposited by the European Community, Germany, Latvia and Sweden in 1994, by Estonia and Finland in 1995, by Denmark in 1996, by Lithuania in 1997 and by Poland and Russia in November 1999. Baltic Sea. http://en.wikipedia.org/?curid=3335."
  }
}
