{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19350",
  "eid" : "3a121500-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778606672,
  "textBody" : "Events\n\n*334 BC – The Macedonian army of Alexander the Great defeats Darius III of Persia in the Battle of the Granicus.\n*752 – Mayan king Bird Jaguar IV of Yaxchilan in modern-day Chiapas, Mexico assumes the throne.\n*1294 – John II becomes Duke of Brabant, Lothier and Limburg.\n*1481 – The largest of three earthquakes strikes the island of Rhodes and causes an estimated 30,000 casualties.\n*1491 – Kongo monarch Nkuwu Nzinga is baptised by Portuguese missionaries, adopting the baptismal name of João I.\n*1616 – Treaty of Loudun ends French civil war.\n*1715 – A total solar eclipse was visible across northern Europe, and northern Asia, as predicted by Edmond Halley to within 4 minutes accuracy.\n*1791 – The Constitution of May 3 (the first modern constitution in Europe) is proclaimed by the Sejm of Polish–Lithuanian Commonwealth.\n*1802 – Washington, D.C. is incorporated as a city.\n*1808 – Finnish War: Sweden loses the fortress of Sveaborg to Russia.\n*  1808   – Peninsular War: The Madrid rebels who rose up on May 2 are executed near Príncipe Pío hill.\n*1815 – Neapolitan War: Joachim Murat, King of Naples is defeated by the Austrians at the Battle of Tolentino, the decisive engagement of the war.\n*1830 – The Canterbury and Whitstable Railway is opened; it is the first steam-hauled passenger railway to issue season tickets and include a tunnel.\n*1837 – The University of Athens is founded in Athens, Greece.\n*1848 – The boar-crested Anglo-Saxon Benty Grange helmet is discovered in a barrow on the Benty Grange farm in Derbyshire.\n*1849 – The May Uprising in Dresden begins – the last of the German revolutions of 1848–49.\n*1855 – American adventurer William Walker departs from San Francisco with about 60 men to conquer Nicaragua.\n*1860 – Charles XV of Sweden–Norway is crowned king of Sweden.\n*1867 – The Hudson's Bay Company gives up all claims to Vancouver Island.\n*1901 – The Great Fire of 1901 begins in Jacksonville, Florida.\n*1913 – Raja Harishchandra the first full-length Indian feature film is released, marking the beginning of the Indian film industry.\n*1920 – A Bolshevik coup fails in the Democratic Republic of Georgia.\n*1921 – West Virginia becomes the first state to legislate a broad sales tax, but does not implement it until a number of years later due to enforcement issues.\n*  1921   – The Partition of Ireland; The Government of Ireland Act 1920 is passed, dividing Ireland into Northern Ireland and Southern Ireland.\n*1937 – Gone with the Wind, a novel by Margaret Mitchell, wins the Pulitzer Prize for Fiction.\n*1939 – The All India Forward Bloc is formed by Netaji Subhas Chandra Bose.\n*1942 – World War II: Japanese naval troops invade Tulagi Island in the Solomon Islands during the first part of Operation Mo that results in the Battle of the Coral Sea between Japanese forces and forces from the United States and Australia.\n*1945 – World War II: Sinking of the prison ships Cap Arcona, Thielbek and Deutschland by the Royal Air Force in  Lübeck Bay.\n*1947 – New post-war Japanese constitution goes into effect.\n*1948 – The U.S. Supreme Court rules in Shelley v. Kraemer that covenants prohibiting the sale of real estate to blacks and other minorities are legally unenforceable.\n*1951 – London's Royal Festival Hall opens with the Festival of Britain.\n*  1951   – The United States Senate Committee on Armed Services and United States Senate Committee on Foreign Relations begin their closed door hearings into the dismissal of General Douglas MacArthur by U.S. President Harry Truman.\n*1952 – Lieutenant Colonels Joseph O. Fletcher and William P. Benedict of the United States land a plane at the North Pole.\n*  1952   – The Kentucky Derby is televised nationally for the first time, on the CBS network.\n*1957 – Walter O'Malley, the owner of the Brooklyn Dodgers, agrees to move the team from Brooklyn, to Los Angeles.\n*1960 – The Off-Broadway musical comedy The Fantasticks opens in New York City's Greenwich Village, eventually becoming the longest-running musical of all time.\n*  1960   – The Anne Frank House museum opens in Amsterdam, Netherlands.\n*1963 – The police force in Birmingham, Alabama switches tactics and responds with violent force to stop the \"Birmingham campaign\" protesters.  Images of the violent suppression are transmitted worldwide, bringing new-found attention to the Civil Rights Movement.\n*1973 – The 108-story Sears Tower in Chicago is topped out at 1,451 feet as the world's tallest building.\n*1978 – The first unsolicited bulk commercial email (which would later become known as \"spam\") is sent by a Digital Equipment Corporation marketing representative to every ARPANET address on the west coast of the United States. \n*1986 – Twenty-one people are killed and forty-one are injured after a bomb explodes in an airliner (Flight UL512) at Colombo airport in Sri Lanka.\n*1987 – A crash by Bobby Allison at the Talladega Superspeedway, Alabama fencing at the start-finish line would lead NASCAR to develop the restrictor plate for the following season both at Daytona International Speedway and Talladega.\n*1999 – The southwestern portion of Oklahoma City is devastated by an F5 tornado, killing forty-five people, injuring 665, and causing $1 billion in damage.  The tornado is one of 66 from the 1999 Oklahoma tornado outbreak. This tornado also produces the highest wind speed ever recorded, measured at 301 +/- 20 mph (484 +/- 32 km/h).\n*2000 – The sport of geocaching begins, with the first cache placed and the coordinates from a GPS posted on Usenet.\n*2001 – The United States loses its seat on the U.N. Human Rights Commission for the first time since the commission was formed in 1947.\n*2002 – An Indian Air Force MiG-21 crashes into a bank in Jalandhar, killing eight and injuring 17.\n*2007 – The 4 year old British girl Madeleine McCann disappears in Praia da Luz, Portugal, starting \"the most heavily reported missing-person case in modern history\".\n*2015 – Two gunmen launch an attempted attack on an anti-Islam event in Garland, Texas, which was held in response to the Charlie Hebdo shooting.\n*2016 – 88,000 people were evacuated from their homes in Fort McMurray, Alberta, Canada as a wildfire ripped through the community, destroying approximately 2400 homes and buildings.\n\nBirths\n\n* 490 – K'an Joy Chitam I, ruler of Palenque (d. 565)\n* 612 – Constantine III, Byzantine emperor (d. 641)\n*1238 – Emilia Bicchieri, Italian saint (d. 1314)\n*1276 –Louis, Count of Évreux, son of King Philip III of France (d. 1319)\n*1415 – Cecily Neville, Duchess of York (d. 1495)\n*1428 – Pedro González de Mendoza, Spanish cardinal (d. 1495)\n*1446 – Margaret of York (d. 1503)\n*1461 – Raffaele Riario, Italian cardinal (d. 1521)\n*1469 – Niccolò Machiavelli, Italian historian and philosopher (d. 1527)\n*1479 – Henry V, Duke of Mecklenburg (d. 1552)\n*1481 – Juana de la Cruz Vázquez Gutiérrez, Spanish abbess of the Franciscan Third Order Regular (d. 1534)\n*1536 – Stephan Praetorius, German theologian (d. 1603)\n*1632 – Catherine of St. Augustine, French-Canadian nurse and saint, founded the Hôtel-Dieu de Québec (d. 1668)\n*1662 – Matthäus Daniel Pöppelmann, German architect, designed the Pillnitz Castle (d. 1736)\n*1695 – Henri Pitot, French physicist and engineer, invented the Pitot tube (d. 1771)\n*1729 – Florian Leopold Gassmann, Czech composer (d. 1774)\n*1761 – August von Kotzebue, German playwright and author (d. 1819)\n*1764 – Princess Élisabeth of France (d. 1794)\n*1768 – Charles Tennant, Scottish chemist and businessman (d. 1838)\n*1814 – Adams George Archibald, Canadian lawyer and politician, 4th Lieutenant Governor of Nova Scotia (d. 1892)\n*1826 – Charles XV of Sweden (d. 1872)\n*1844 – Richard D'Oyly Carte, English talent agent and composer (d. 1901)\n*1849 – Jacob Riis, Danish-American journalist and photographer (d. 1914)\n*  1849   – Bernhard von Bülow, German soldier and politician, Chancellor of Germany (d. 1929)\n*1854 – George Gore, American baseball player and manager (d. 1933)\n*1859 – August Herrmann, American executive in Major League Baseball (d.1931)\n*1860 – Vito Volterra, Italian mathematician and physicist (d. 1940)\n*1867 – J. T. Hearne, English cricketer (d. 1944)\n*  1867   – Andy Bowen, American boxer (d. 1894)\n*1870 – Princess Helena Victoria of Schleswig-Holstein (d. 1948)\n*1871 – Emmett Dalton, American criminal (d. 1937)\n*1873 – Pavlo Skoropadskyi, German-Ukrainian general and politician, Hetman of Ukraine (d. 1945)\n*1874 – François Coty, French businessman and publisher, founded Coty, Inc. (d. 1934)\n*  1874   – Vagn Walfrid Ekman, Swedish oceanographer and academic (d. 1954)\n*1877 – Karl Abraham, German psychoanalyst and author (d. 1925)\n*1879 – Fergus McMaster, Australian businessman and soldier, co-founded Qantas  (d. 1950)\n*1886 – Marcel Dupré, French organist and composer (d. 1971)\n*1887 – Marika Kotopouli, Greek actress (d. 1954)\n*1889 – Beulah Bondi, American actress (d. 1981)\n*1891 – Tadeusz Peiper, Polish poet and critic (d. 1969)\n*1891 – Eppa Rixey, American baseball pitcher (d. 1963)\n*1892 – George Paget Thomson, English physicist and academic, Nobel Prize laureate (d. 1975)\n*  1892   – Jacob Viner, Canadian-American economist and academic (d. 1970)\n*1893 – Konstantine Gamsakhurdia, Georgian author (d. 1975)\n*1895 – Cornelius Van Til, Dutch philosopher, theologian, and apologist (d. 1987)\n*1896 – Karl Allmenröder, German soldier and pilot (d. 1917)\n*  1896   – V. K. Krishna Menon, Indian lawyer, jurist, and politician, Indian Minister of Defence (d. 1974)\n*  1896   – Dodie Smith, English author and playwright (d. 1990)\n*1897 – William Joseph Browne, Canadian lawyer and politician, 20th Solicitor General of Canada (d. 1989)\n*1898 – Septima Poinsette Clark, American educator and activist (d. 1987)\n*  1898   – Golda Meir, Ukrainian-Israeli educator and politician, 4th Prime Minister of Israel (d. 1978)\n*1902 – Alfred Kastler, German-French physicist and poet, Nobel Prize laureate (d. 1984)\n*1903 – Bing Crosby, American singer and actor (d. 1977)\n*1905 – Edmund Black, American hammer thrower (d. 1996)\n*  1905   – Werner Fenchel, German-Danish mathematician and academic (d. 1988)\n*  1905   – Red Ruffing, American baseball pitcher and coach (d. 1986)\n*1906 – Mary Astor, American actress (d. 1987)\n*  1906   – René Huyghe, French historian and author (d. 1997)\n*  1906   – Anna Roosevelt Halsted, American journalist and author (d. 1975)\n*  1906   – Enrique Laguerre, Puerto Rican journalist, author, and playwright (d. 2005)\n*1910 – Norman Corwin, American screenwriter and producer (d. 2011)\n*1912 – Virgil Fox, American organist and composer (d. 1980)\n*  1912   – May Sarton, American poet, novelist and memoirist (d. 1995)\n*1913 – William Inge, American playwright and novelist (d. 1973)\n*1914 – Georges-Emmanuel Clancier, French journalist, author, and poet\n*1915 – Stu Hart, Canadian wrestler and trainer, founded Stampede Wrestling (d. 2003)\n*  1915   – Richard Lippold, American sculptor and academic (d. 2002)\n*1916 – Léopold Simoneau, Canadian tenor and actor (d. 2006)\n*1917 – Betty Comden, American screenwriter and librettist (d. 2006)\n*  1917   – George Gaynes, Finnish-American actor (d. 2016)\n*1918 – Ted Bates, English footballer and manager (d. 2003)\n*1919 – John Cullen Murphy, American soldier and illustrator (d. 2004)\n*  1919   – Pete Seeger, American singer-songwriter, guitarist, and activist (The Weavers and Almanac Singers) (d. 2014)\n*1920 – John Lewis, American pianist and composer (d. 2001)\n*1921 – Sugar Ray Robinson, American boxer (d. 1989)\n*1922 – Len Shackleton, English footballer and journalist (d. 2000)\n*1923 – George Hadjinikos, Greek pianist, conductor, and educator (d. 2015)\n*  1923   – Ralph Hall, American lieutenant, lawyer, and politician\n*1924 – Yehuda Amichai, German-Israeli author and poet (d. 2000)\n*  1924   – Ken Tyrrell, English race car driver, founded Tyrrell Racing (d. 2001)\n*1925 – Jean Séguy, French sociologist and author (d. 2007)\n*1926 – Matt Baldwin, Canadian curler and engineer\n*  1926   – Herbert Blau, American engineer and academic (d. 2013)\n*1928 – Dave Dudley, American singer-songwriter (d. 2003)\n*  1928   – Jacques-Louis Lions, French mathematician (d. 2001)\n*1929 – Denise Lor, American singer and actress (d. 2015)\n*1930 – Juan Gelman, Argentinian poet and author (d. 2014)\n*  1930   – David Harrison, English chemist and academic\n*1931 – Vasily Rudenkov, Belarusian hammer thrower (d. 1982)\n*  1931   – Sait Maden, Turkish translator, poet, painter and graphic designer  (d. 2013)\n*1932 – Robert Osborne, American actor and historian (d. 2017)\n*1933 – James Brown, American singer-songwriter, producer, and actor (The Famous Flames and The J.B.'s) (d. 2006)\n*  1933   – Steven Weinberg, American physicist and academic, Nobel Prize laureate\n*1934 – Henry Cooper, English boxer and sportscaster (d. 2011)\n*  1934   – Georges Moustaki, Egyptian-French singer-songwriter and guitarist (d. 2013)\n*  1934   – Frankie Valli, American singer and actor \n*1935 – Ron Popeil, American businessman, founded the Ronco Company\n*1937 – Nélida Piñon, Brazilian author and academic\n*1938 – Omar Abdel-Rahman, Egyptian terrorist\n*  1938   – Chris Cannizzaro, American baseball player\n*  1938   – Napoleon XIV,  American singer, songwriter and record producer \n*1939 – Jonathan Harvey, English composer and educator (d. 2012)\n*1940 – David Koch, American engineer, businessman, and philanthropist\n*  1940   – Clemens Westerhof, Dutch footballer and manager\n*1941 – Alexander Harley, English general\n*  1941   – Edward Malloy, American priest and academic\n*1942 – Věra Čáslavská, Czech gymnast and coach (d. 2016)\n*  1942   – Dave Marash, American journalist and sportscaster\n*  1942   – Butch Otter, American soldier and politician, 32nd Governor of Idaho\n*1943 – Yukio Hashi, Japanese singer and actor\n*  1943   – Jim Risch, American lawyer and politician, 31st Governor of Idaho\n*  1943   – Vicente Saldivar, Mexican boxer (d. 1985)\n*1944 – Peter Doyle, English bishop\n*  1944   – Pete Staples, English bass player \n*1945 – Jörg Drehmel, German triple jumper and coach\n*  1945   – Davey Lopes, American baseball player, coach, and manager\n*1946 – Norm Chow, American football player and coach\n*  1946   – Silvino Francisco, South African snooker player\n*  1946   – Greg Gumbel, American sportscaster\n*1947 – Doug Henning, Canadian magician (d. 2000)\n*1948 – Denis Cosgrove, British-American academic and geographer (d. 2008)\n*  1948   – Chris Mulkey, American actor\n*1949 – Liam Donaldson, English physician and academic\n*  1949   – Ruth Lister, Baroness Lister of Burtersett, English academic and politician\n*  1949   – Ron Wyden, American academic and politician\n*1950 – Mary Hopkin, Welsh singer-songwriter\n*  1950   – Dag Arnesen, Norwegian pianist and composer\n*1951 – Alan Clayson, English singer-songwriter and journalist\n*  1951   – Christopher Cross, American singer-songwriter and producer\n*  1951   – Ashok Gehlot, Indian politician, 21st Chief Minister of Rajasthan\n*  1951   – Tatyana Tolstaya, Russian author and publicist\n*1952 – Chuck Baldwin, American pastor and politician\n*  1952   – Caitlin Clarke, American actress (d. 2004)\n*  1952   – Joseph W. Tobin, American cardinal\n*1953 – Bruce Hall, American singer-songwriter, bass player, and producer \n*  1953   – Jake Hooker, Israeli-American guitarist and songwriter (d. 2014)\n*1954 – Angela Bofill, American singer-songwriter\n*  1954   – Jean-Marc Roberts, French author and screenwriter (d. 2013)\n*1955 – Stephen D. M. Brown, British geneticist\n*  1955   – Colin Deans, Scottish rugby player\n*  1955   – David Hookes, Australian cricketer, coach, and sportscaster (d. 2004)\n*  1955   – Seishirō Nishida, Japanese actor\n*1956 – Marc Bellemare, Canadian lawyer and politician\n*1957 – Alain Côté, Canadian ice hockey player\n*  1957   – Rod Langway, Taiwanese-American ice hockey player and coach\n*1958 – Bill Sienkiewicz, American author and illustrator\n*  1958   – Sandi Toksvig, Danish-English comedian, author, and radio host\n*1959 – David Ball, English keyboard player and producer \n*  1959   – Uma Bharti, Indian activist and politician, 16th Chief Minister of Madhya Pradesh\n*  1959   – Ben Elton, English actor, director, and screenwriter\n*1960 – Geraint Davies, Welsh businessman and politician\n*  1960   – Kathy Smallwood-Cook, English sprinter and educator\n*1961 – Steve McClaren, English footballer and manager\n*  1961   – Joe Murray, American animator, producer, and screenwriter\n*  1961   – David Vitter, American lawyer and politician\n*  1961   – Leyla Zana, Kurdish activist and politician\n*1962 – Anders Graneheim, Swedish bodybuilder\n*1963 – Jeff Hornacek, American basketball player and coach\n*  1963   – Marco Mendoza, American guitarist \n*  1963   – Mona Siddiqui, Pakistani-Scottish journalist and academic\n*1964 – Sterling Campbell, American drummer and songwriter \n*  1964   – Ron Hextall, Canadian-American ice hockey player and manager\n*1965 – Ignatius Aphrem II, Syrian patriarch\n*  1965   – Mark Cousins, Northern Irish director, writer, cinematographer\n*  1965   – John Jensen, Danish footballer and coach\n*  1965   – Mikhail Prokhorov, Russian businessman\n*1966 – Giorgos Agorogiannis, Greek footballer\n*  1966   – Frank Dietrich, German politician (d. 2011)\n*1967 – Daniel Anderson Australian rugby league coach and manager\n*1967 – Kenneth Joel Hotz Canadian producer, writer, director, actor, and comedian  \n*  1967   – André Olbrich, German guitarist and songwriter \n*1968 – Viliami Ofahengaue, Tongan-Australian rugby player\n*1969 – Daryl F. Mallett, American author and actor\n*  1969   – Bruce Reyes-Chow, American minister and author\n*1970 – Bobby Cannavale, American actor \n*  1970   – Jeffrey Sebelia, American fashion designer\n*1971 – Douglas Carswell, English politician\n*  1971   – Josey Scott, American singer-songwriter and guitarist \n*1972 – Stephen Barclay, English lawyer and politician\n*  1972   – Wally Bayola, Filipino actor, singer, comedian and television personality\n*1973 – Jamie Baulch, English sprinter and television host\n*1975 – Willie Geist, American television journalist and host \n*  1975   – Christina Hendricks, American actress\n*  1975   – Dulé Hill, American actor, dancer, and producer\n*  1975   – Rainstone, South Korean songwriter and record producer\n*1976 – Jeff Halpern, American ice hockey player\n*  1976   – Brad Scott, Australian footballer and coach\n*  1976   – Chris Scott, Australian footballer and coach\n*1977 – Ryan Dempster, Canadian baseball player and sportscaster\n*  1977   – Tyronn Lue, American basketball player and coach\n*  1977   – Hiro Mashima, Japanese illustrator\n*  1977   – Maryam Mirzakhani, Iranian mathematiker (d. 2017)\n*  1977   – Ben Olsen, American soccer player and coach\n*1978 – Christian Annan, Ghanaian-Hong Kong footballer\n*  1978   – Paul Banks, English-American singer-songwriter and guitarist \n*  1978   – Dai Tamesue, Japanese hurdler\n*  1978   – Lawrence Tynes, American football player\n*1979 – Steve Mack, American wrestler\n*  1979   – Anastasiya Shvedova, Belarusian pole vaulter\n*1980 – Zuzana Ondrášková, Czech tennis player\n*  1980   – Marcel Vigneron, American chef \n*1982 – Igor Olshansky, Ukrainian-American football player\n*  1982   – Nick Stavinoha, American baseball player\n*1983 – Joseph Addai, American football player\n*  1983   – Romeo Castelen, Dutch footballer\n*  1983   – Jérôme Clavier, French pole vaulter\n*  1983   – Márton Fülöp, Hungarian footballer (d. 2015)\n*1985 – Ezequiel Lavezzi, Argentinian footballer\n*  1985   – Kadri Lehtla, Estonian biathlete\n*  1985   – Miko Mälberg, Estonian swimmer\n*1986 – Moon Byung-woo, South Korean footballer\n*1987 – Lina Grinčikaitė, Lithuanian sprinter\n*1988 – Ben Revere, American baseball player\n*  1988   – Paddy Holohan, Irish mixed martial artist\n*1989 – Jesse Bromwich, New Zealand rugby league player\n*  1989   – Katinka Hosszú, Hungarian swimmer\n*1990 – Brooks Koepka, American golfer\n*1991 – Samuel Seo, South Korean musician\n*1992 – Aaron Whitchurch, Australian rugby league player\n*1995 – Ivan Bukavshin, Russian chess player (d. 2016)\n*1996 – Mary Cain, American runner\n*  1996   – Alex Iwobi, Nigerian football player\n*  1996   – Domantas Sabonis, Lithuanian basketball player\n*1997 – Ivana Jorović, Serbian tennis player\n\nDeaths\n\n* 678 – Tōchi, Japanese princess\n* 738 – Uaxaclajuun Ub'aah K'awiil, Mayan ruler (ajaw)\n*1152 – Matilda of Boulogne (b. 1105)\n*1270 – Béla IV of Hungary (b. 1206)\n*1294 – John I, Duke of Brabant (b. 1252)\n*1330 – Alexios II Megas Komnenos, Emperor of Trebizond (b. 1282)\n*1410 – Antipope Alexander V\n*1481 – Mehmed the Conqueror, Ottoman sultan (b. 1432)\n*1501 – John Devereux, 8th Baron Ferrers of Chartley, English Baron (b. 1463)\n*1524 – Richard Grey, 3rd Earl of Kent, English peer (b. 1481)\n*1534 – Juana de la Cruz Vazquez Gutierrez, Spanish Roman Catholic nun and venerable (b. 1481)\n*1589 – Julius, Duke of Brunswick-Lüneburg (b. 1528)\n*1606 – Henry Garnet, English priest and author (b. 1555)\n*1621 – Elizabeth Bacon, English Tudor gentlewoman (b. 1541)\n*1679 – James Sharp, Scottish archbishop (b. 1613)\n*1693 – Claude de Rouvroy, duc de Saint-Simon, French courtier (b. 1607)\n*1704 – Heinrich Ignaz Franz Biber, Czech-Austrian violinist and composer (b. 1644)\n*1724 – John Leverett the Younger, American lawyer, academic, and politician (b. 1662)\n*1750 – John Willison, Scottish minister and author (b. 1680)\n*1752 – Samuel Ogle, English-American captain and politician, 5th Governor of Restored Proprietary Government (b. 1692)\n*1758 – Pope Benedict XIV (b. 1675)\n*1763 – George Psalmanazar, French-English author (b. 1679)\n*1764 – Francesco Algarotti, Italian philosopher, poet, and critic (b. 1712)\n*1779 – John Winthrop, American mathematician, physicist, and astronomer (b. 1714)\n*1793 – Martin Gerbert, German historian and theologian (b. 1720)\n*1839 – Ferdinando Paer, Italian composer (b. 1771)\n*1856 – Adolphe Adam, French composer and critic (b. 1803)\n*1910 – Howard Taylor Ricketts, American pathologist (b. 1871)\n*1916 – Tom Clarke, Irish rebel (b. 1858)\n*  1916   – Thomas MacDonagh, Irish poet and rebel (b. 1878)\n*  1916   – Patrick Pearse, Irish teacher and rebel leader (b. 1879)\n*1918 – Charlie Soong, Chinese businessman and missionary (b. 1863)\n*1921 – Théodore Pilette, Belgian race car driver (b. 1883)\n*1925 – Clément Ader, French engineer, designed the Ader Avion III (b. 1841)\n*1932 – Charles Fort, American journalist and author (b. 1874)\n*1935 – Jessie Willcox Smith, American illustrator (b. 1863)\n*1939 – Madeleine Desroseaux, French author and poet (b. 1873)\n*1942 – Thorvald Stauning, Danish politician, 24th Prime Minister of Denmark (b. 1873)\n*1943 – Harry Miller, American engineer (b. 1875)\n*1948 – Ernst Tandefelt, Finnish assassin of Heikki Ritavuori (b. 1876)\n*1949 – Fanny Walden, English footballer and cricketer (b. 1888)\n*1958 – Frank Foster, English cricketer (b. 1889)\n*1969 – Zakir Husain, Indian academic and politician, 3rd President of India (b. 1897)\n*1970 – Cemil Gürgen Erlertürk, Turkish footballer, coach, and pilot (b. 1918)\n*1972 – Kenneth Bailey, Australian lawyer and diplomat, Australian High Commissioner to Canada (b. 1898)\n*  1972   – Emil Breitkreutz, American runner and coach (b. 1883)\n*  1972   – Bruce Cabot, American actor (b. 1904)\n*1978 – Bill Downs, American journalist (b. 1914)\n*1981 – Nargis, Indian actress (b. 1929)\n*1986 – Robert Alda, American actor (b. 1914)\n*1988 – Lev Pontryagin, Russian mathematician and academic (b. 1908)\n*1989 – Christine Jorgensen, American trans woman (b. 1926)\n*1991 – Jerzy Kosiński, Polish-American novelist and screenwriter (b. 1933)\n*1992 – George Murphy, American actor, dancer, and politician (b. 1902)\n*1996 – Dimitri Fampas, Greek guitarist, composer, and educator (b. 1921)\n*  1996   – Alex Kellner, American baseball player (b. 1924)\n*  1996   – Jack Weston, American actor (b. 1924)\n*1997 – Sébastien Enjolras, French race car driver (b. 1976)\n*  1997   – Narciso Yepes, Spanish guitarist and composer (b. 1927)\n*1998 – Gene Raymond, American actor (b. 1908)\n*1999 – Joe Adcock, American baseball player and manager (b. 1927)\n*  1999   – Steve Chiasson, Canadian-American ice hockey player (b. 1967)\n*  1999   – Godfrey Evans, English cricketer (b. 1920)\n*2000 – Júlia Báthory, Hungarian glass designer (b. 1901)\n*  2000   – John Joseph O'Connor, American cardinal (b. 1920)\n*2002 – Barbara Castle, Baroness Castle of Blackburn, English politician, First Secretary of State (b. 1910)\n*  2002   – Yevgeny Svetlanov, Russian pianist, composer, and conductor (b. 1928)\n*2003 – Suzy Parker, American model and actress (b. 1932)\n*2004 – Ken Downing, English race car driver (b. 1917)\n*  2004   – Darrell Johnson, American baseball player, coach, and manager (b. 1928)\n*2006 – Karel Appel, Dutch painter, sculptor, and poet (b. 1921)\n*  2006   – Pramod Mahajan, Indian politician (b. 1949)\n*  2006   – Earl Woods, American colonel, baseball player, and author (b. 1932)\n*2007 – Warja Honegger-Lavater, Swiss illustrator (b. 1913)\n*  2007   – Wally Schirra, American captain, pilot, and astronaut (b. 1923)\n*  2007   – Knock Yokoyama, Japanese politician (b. 1932)\n*2008 – Leopoldo Calvo-Sotelo, Spanish engineer and politician, Prime Minister of Spain (b. 1926)\n*2009 – Renée Morisset, Canadian pianist (b. 1928)\n*  2009   – Ram Balkrushna Shewalkar, Indian author and critic (b. 1931)\n*2010 – Roy Carrier, American accordion player (b. 1947)\n*  2010   – Peter O'Donnell, English soldier and author (b. 1920)\n*  2010   – Guenter Wendt, German-American engineer (b. 1923)\n*2011 – Jackie Cooper, American actor, television director, producer and executive (b. 1922)\n*  2011   – Sergo Kotrikadze, Georgian footballer and manager (b. 1936)\n*  2011   – Thanasis Veggos, Greek actor and director (b. 1927)\n*2012 – Jorge Illueca, Panamanian politician, 30th President of Panama (b. 1918)\n*  2012   – Felix Werder, German-Australian composer, conductor, and critic (b. 1922)\n*2013 – Joe Astroth, American baseball player (b. 1922)\n*  2013   – Herbert Blau, American engineer and academic (b. 1926)\n*  2013   – Cedric Brooks, Jamaican-American saxophonist and flute player (b. 1943)\n*  2013   – Keith Carter, American swimmer and soldier (b. 1924)\n*  2013   – Brad Drewett, Australian tennis player and sportscaster (b. 1958)\n*  2013   – David Morris Kern, American pharmacist, co-invented Orajel (b. 1909)\n*  2013   – Curtis Rouse, American football player (b. 1960)\n*  2013   – Branko Vukelić, Croatian politician, 11th Minister of Defence for Croatia (b. 1958)\n*2014 – Gary Becker, American economist and academic, Nobel Prize laureate (b. 1930)\n*  2014   – Francisco Icaza, Mexican painter (b. 1930)\n*  2014   – Jim Oberstar, American educator and politician (b. 1934)\n*2015 – Revaz Chkheidze, Georgian director and screenwriter (b. 1926)\n*  2015   – Danny Jones, Welsh rugby player (b. 1986)\n*  2015   – Warren Smith, American golfer and coach (b. 1915)\n*2016 – Ian Deans, Canadian politician (b. 1937)\n*  2016   – Jadranka Stojaković, Yugoslav singer-songwriter  (b. 1950)\n*2017 – Daliah Lavi, Israeli actress, singer and model (b. 1942)\n\nHolidays and observances\n\n* Christian feast day:\n** Abhai (Syriac Orthodox Church)\n** Antonia and Alexander\n** Juvenal of Narni\n** Moura (Coptic Church)\n** Philip and James the Lesser\n** Pope Alexander I\n** Sarah the Martyr (Coptic Church)\n** The Most Holy Virgin Mary Queen of Poland \n** Theodosius of Kiev (Eastern Orthodox Church)\n** May 3 (Eastern Orthodox liturgics)\n* Constitution Memorial Day (Japan)\n* Constitution Day (Poland)\n* Finding of the Holy Cross-related observances:\n** Fiesta de las Cruces (Spain and Hispanic America)\n** Roodmas, or Feast of the Finding of the Holy Cross (Gallican Rite of the Catholic Church)\n* Sun Day (International)\n* World Press Freedom Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 3" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19350" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*334 BC – The Macedonian army of Alexander the Great defeats Darius III of Persia in the Battle of the Granicus.\n*752 – Mayan king Bird Jaguar IV of Yaxchilan in modern-day Chiapas, Mexico assumes the throne.\n*1294 – John II becomes Duke of Brabant, Lothier and Limburg.\n*1481 – The largest of three earthquakes strikes the island of Rhodes and causes an estimated 30,000 casualties.\n*1491 – Kongo monarch Nkuwu Nzinga is baptised by Portuguese missionaries, adopting the baptismal name of João I.\n*1616 – Treaty of Loudun ends French civil war.\n*1715 – A total solar eclipse was visible across northern Europe, and northern Asia, as predicted by Edmond Halley to within 4 minutes accuracy.\n*1791 – The Constitution of May 3 (the first modern constitution in Europe) is proclaimed by the Sejm of Polish–Lithuanian Commonwealth.\n*1802 – Washington, D.C. is incorporated as a city.\n*1808 – Finnish War: Sweden loses the fortress of Sveaborg to Russia.\n*  1808   – Peninsular War: The Madrid rebels who rose up on May 2 are executed near Príncipe Pío hill.\n*1815 – Neapolitan War: Joachim Murat, King of Naples is defeated by the Austrians at the Battle of Tolentino, the decisive engagement of the war.\n*1830 – The Canterbury and Whitstable Railway is opened; it is the first steam-hauled passenger railway to issue season tickets and include a tunnel.\n*1837 – The University of Athens is founded in Athens, Greece.\n*1848 – The boar-crested Anglo-Saxon Benty Grange helmet is discovered in a barrow on the Benty Grange farm in Derbyshire.\n*1849 – The May Uprising in Dresden begins – the last of the German revolutions of 1848–49.\n*1855 – American adventurer William Walker departs from San Francisco with about 60 men to conquer Nicaragua.\n*1860 – Charles XV of Sweden–Norway is crowned king of Sweden.\n*1867 – The Hudson's Bay Company gives up all claims to Vancouver Island.\n*1901 – The Great Fire of 1901 begins in Jacksonville, Florida.\n*1913 – Raja Harishchandra the first full-length Indian feature film is released, marking the beginning of the Indian film industry.\n*1920 – A Bolshevik coup fails in the Democratic Republic of Georgia.\n*1921 – West Virginia becomes the first state to legislate a broad sales tax, but does not implement it until a number of years later due to enforcement issues.\n*  1921   – The Partition of Ireland; The Government of Ireland Act 1920 is passed, dividing Ireland into Northern Ireland and Southern Ireland.\n*1937 – Gone with the Wind, a novel by Margaret Mitchell, wins the Pulitzer Prize for Fiction.\n*1939 – The All India Forward Bloc is formed by Netaji Subhas Chandra Bose.\n*1942 – World War II: Japanese naval troops invade Tulagi Island in the Solomon Islands during the first part of Operation Mo that results in the Battle of the Coral Sea between Japanese forces and forces from the United States and Australia.\n*1945 – World War II: Sinking of the prison ships Cap Arcona, Thielbek and Deutschland by the Royal Air Force in  Lübeck Bay.\n*1947 – New post-war Japanese constitution goes into effect.\n*1948 – The U.S. Supreme Court rules in Shelley v. Kraemer that covenants prohibiting the sale of real estate to blacks and other minorities are legally unenforceable.\n*1951 – London's Royal Festival Hall opens with the Festival of Britain.\n*  1951   – The United States Senate Committee on Armed Services and United States Senate Committee on Foreign Relations begin their closed door hearings into the dismissal of General Douglas MacArthur by U.S. President Harry Truman.\n*1952 – Lieutenant Colonels Joseph O. Fletcher and William P. Benedict of the United States land a plane at the North Pole.\n*  1952   – The Kentucky Derby is televised nationally for the first time, on the CBS network.\n*1957 – Walter O'Malley, the owner of the Brooklyn Dodgers, agrees to move the team from Brooklyn, to Los Angeles.\n*1960 – The Off-Broadway musical comedy The Fantasticks opens in New York City's Greenwich Village, eventually becoming the longest-running musical of all time.\n*  1960   – The Anne Frank House museum opens in Amsterdam, Netherlands.\n*1963 – The police force in Birmingham, Alabama switches tactics and responds with violent force to stop the \"Birmingham campaign\" protesters.  Images of the violent suppression are transmitted worldwide, bringing new-found attention to the Civil Rights Movement.\n*1973 – The 108-story Sears Tower in Chicago is topped out at 1,451 feet as the world's tallest building.\n*1978 – The first unsolicited bulk commercial email (which would later become known as \"spam\") is sent by a Digital Equipment Corporation marketing representative to every ARPANET address on the west coast of the United States. \n*1986 – Twenty-one people are killed and forty-one are injured after a bomb explodes in an airliner (Flight UL512) at Colombo airport in Sri Lanka.\n*1987 – A crash by Bobby Allison at the Talladega Superspeedway, Alabama fencing at the start-finish line would lead NASCAR to develop the restrictor plate for the following season both at Daytona International Speedway and Talladega.\n*1999 – The southwestern portion of Oklahoma City is devastated by an F5 tornado, killing forty-five people, injuring 665, and causing $1 billion in damage.  The tornado is one of 66 from the 1999 Oklahoma tornado outbreak. This tornado also produces the highest wind speed ever recorded, measured at 301 +/- 20 mph (484 +/- 32 km/h).\n*2000 – The sport of geocaching begins, with the first cache placed and the coordinates from a GPS posted on Usenet.\n*2001 – The United States loses its seat on the U.N. Human Rights Commission for the first time since the commission was formed in 1947.\n*2002 – An Indian Air Force MiG-21 crashes into a bank in Jalandhar, killing eight and injuring 17.\n*2007 – The 4 year old British girl Madeleine McCann disappears in Praia da Luz, Portugal, starting \"the most heavily reported missing-person case in modern history\".\n*2015 – Two gunmen launch an attempted attack on an anti-Islam event in Garland, Texas, which was held in response to the Charlie Hebdo shooting.\n*2016 – 88,000 people were evacuated from their homes in Fort McMurray, Alberta, Canada as a wildfire ripped through the community, destroying approximately 2400 homes and buildings.\n\nBirths\n\n* 490 – K'an Joy Chitam I, ruler of Palenque (d. 565)\n* 612 – Constantine III, Byzantine emperor (d. 641)\n*1238 – Emilia Bicchieri, Italian saint (d. 1314)\n*1276 –Louis, Count of Évreux, son of King Philip III of France (d. 1319)\n*1415 – Cecily Neville, Duchess of York (d. 1495)\n*1428 – Pedro González de Mendoza, Spanish cardinal (d. 1495)\n*1446 – Margaret of York (d. 1503)\n*1461 – Raffaele Riario, Italian cardinal (d. 1521)\n*1469 – Niccolò Machiavelli, Italian historian and philosopher (d. 1527)\n*1479 – Henry V, Duke of Mecklenburg (d. 1552)\n*1481 – Juana de la Cruz Vázquez Gutiérrez, Spanish abbess of the Franciscan Third Order Regular (d. 1534)\n*1536 – Stephan Praetorius, German theologian (d. 1603)\n*1632 – Catherine of St. Augustine, French-Canadian nurse and saint, founded the Hôtel-Dieu de Québec (d. 1668)\n*1662 – Matthäus Daniel Pöppelmann, German architect, designed the Pillnitz Castle (d. 1736)\n*1695 – Henri Pitot, French physicist and engineer, invented the Pitot tube (d. 1771)\n*1729 – Florian Leopold Gassmann, Czech composer (d. 1774)\n*1761 – August von Kotzebue, German playwright and author (d. 1819)\n*1764 – Princess Élisabeth of France (d. 1794)\n*1768 – Charles Tennant, Scottish chemist and businessman (d. 1838)\n*1814 – Adams George Archibald, Canadian lawyer and politician, 4th Lieutenant Governor of Nova Scotia (d. 1892)\n*1826 – Charles XV of Sweden (d. 1872)\n*1844 – Richard D'Oyly Carte, English talent agent and composer (d. 1901)\n*1849 – Jacob Riis, Danish-American journalist and photographer (d. 1914)\n*  1849   – Bernhard von Bülow, German soldier and politician, Chancellor of Germany (d. 1929)\n*1854 – George Gore, American baseball player and manager (d. 1933)\n*1859 – August Herrmann, American executive in Major League Baseball (d.1931)\n*1860 – Vito Volterra, Italian mathematician and physicist (d. 1940)\n*1867 – J. T. Hearne, English cricketer (d. 1944)\n*  1867   – Andy Bowen, American boxer (d. 1894)\n*1870 – Princess Helena Victoria of Schleswig-Holstein (d. 1948)\n*1871 – Emmett Dalton, American criminal (d. 1937)\n*1873 – Pavlo Skoropadskyi, German-Ukrainian general and politician, Hetman of Ukraine (d. 1945)\n*1874 – François Coty, French businessman and publisher, founded Coty, Inc. (d. 1934)\n*  1874   – Vagn Walfrid Ekman, Swedish oceanographer and academic (d. 1954)\n*1877 – Karl Abraham, German psychoanalyst and author (d. 1925)\n*1879 – Fergus McMaster, Australian businessman and soldier, co-founded Qantas  (d. 1950)\n*1886 – Marcel Dupré, French organist and composer (d. 1971)\n*1887 – Marika Kotopouli, Greek actress (d. 1954)\n*1889 – Beulah Bondi, American actress (d. 1981)\n*1891 – Tadeusz Peiper, Polish poet and critic (d. 1969)\n*1891 – Eppa Rixey, American baseball pitcher (d. 1963)\n*1892 – George Paget Thomson, English physicist and academic, Nobel Prize laureate (d. 1975)\n*  1892   – Jacob Viner, Canadian-American economist and academic (d. 1970)\n*1893 – Konstantine Gamsakhurdia, Georgian author (d. 1975)\n*1895 – Cornelius Van Til, Dutch philosopher, theologian, and apologist (d. 1987)\n*1896 – Karl Allmenröder, German soldier and pilot (d. 1917)\n*  1896   – V. K. Krishna Menon, Indian lawyer, jurist, and politician, Indian Minister of Defence (d. 1974)\n*  1896   – Dodie Smith, English author and playwright (d. 1990)\n*1897 – William Joseph Browne, Canadian lawyer and politician, 20th Solicitor General of Canada (d. 1989)\n*1898 – Septima Poinsette Clark, American educator and activist (d. 1987)\n*  1898   – Golda Meir, Ukrainian-Israeli educator and politician, 4th Prime Minister of Israel (d. 1978)\n*1902 – Alfred Kastler, German-French physicist and poet, Nobel Prize laureate (d. 1984)\n*1903 – Bing Crosby, American singer and actor (d. 1977)\n*1905 – Edmund Black, American hammer thrower (d. 1996)\n*  1905   – Werner Fenchel, German-Danish mathematician and academic (d. 1988)\n*  1905   – Red Ruffing, American baseball pitcher and coach (d. 1986)\n*1906 – Mary Astor, American actress (d. 1987)\n*  1906   – René Huyghe, French historian and author (d. 1997)\n*  1906   – Anna Roosevelt Halsted, American journalist and author (d. 1975)\n*  1906   – Enrique Laguerre, Puerto Rican journalist, author, and playwright (d. 2005)\n*1910 – Norman Corwin, American screenwriter and producer (d. 2011)\n*1912 – Virgil Fox, American organist and composer (d. 1980)\n*  1912   – May Sarton, American poet, novelist and memoirist (d. 1995)\n*1913 – William Inge, American playwright and novelist (d. 1973)\n*1914 – Georges-Emmanuel Clancier, French journalist, author, and poet\n*1915 – Stu Hart, Canadian wrestler and trainer, founded Stampede Wrestling (d. 2003)\n*  1915   – Richard Lippold, American sculptor and academic (d. 2002)\n*1916 – Léopold Simoneau, Canadian tenor and actor (d. 2006)\n*1917 – Betty Comden, American screenwriter and librettist (d. 2006)\n*  1917   – George Gaynes, Finnish-American actor (d. 2016)\n*1918 – Ted Bates, English footballer and manager (d. 2003)\n*1919 – John Cullen Murphy, American soldier and illustrator (d. 2004)\n*  1919   – Pete Seeger, American singer-songwriter, guitarist, and activist (The Weavers and Almanac Singers) (d. 2014)\n*1920 – John Lewis, American pianist and composer (d. 2001)\n*1921 – Sugar Ray Robinson, American boxer (d. 1989)\n*1922 – Len Shackleton, English footballer and journalist (d. 2000)\n*1923 – George Hadjinikos, Greek pianist, conductor, and educator (d. 2015)\n*  1923   – Ralph Hall, American lieutenant, lawyer, and politician\n*1924 – Yehuda Amichai, German-Israeli author and poet (d. 2000)\n*  1924   – Ken Tyrrell, English race car driver, founded Tyrrell Racing (d. 2001)\n*1925 – Jean Séguy, French sociologist and author (d. 2007)\n*1926 – Matt Baldwin, Canadian curler and engineer\n*  1926   – Herbert Blau, American engineer and academic (d. 2013)\n*1928 – Dave Dudley, American singer-songwriter (d. 2003)\n*  1928   – Jacques-Louis Lions, French mathematician (d. 2001)\n*1929 – Denise Lor, American singer and actress (d. 2015)\n*1930 – Juan Gelman, Argentinian poet and author (d. 2014)\n*  1930   – David Harrison, English chemist and academic\n*1931 – Vasily Rudenkov, Belarusian hammer thrower (d. 1982)\n*  1931   – Sait Maden, Turkish translator, poet, painter and graphic designer  (d. 2013)\n*1932 – Robert Osborne, American actor and historian (d. 2017)\n*1933 – James Brown, American singer-songwriter, producer, and actor (The Famous Flames and The J.B.'s) (d. 2006)\n*  1933   – Steven Weinberg, American physicist and academic, Nobel Prize laureate\n*1934 – Henry Cooper, English boxer and sportscaster (d. 2011)\n*  1934   – Georges Moustaki, Egyptian-French singer-songwriter and guitarist (d. 2013)\n*  1934   – Frankie Valli, American singer and actor \n*1935 – Ron Popeil, American businessman, founded the Ronco Company\n*1937 – Nélida Piñon, Brazilian author and academic\n*1938 – Omar Abdel-Rahman, Egyptian terrorist\n*  1938   – Chris Cannizzaro, American baseball player\n*  1938   – Napoleon XIV,  American singer, songwriter and record producer \n*1939 – Jonathan Harvey, English composer and educator (d. 2012)\n*1940 – David Koch, American engineer, businessman, and philanthropist\n*  1940   – Clemens Westerhof, Dutch footballer and manager\n*1941 – Alexander Harley, English general\n*  1941   – Edward Malloy, American priest and academic\n*1942 – Věra Čáslavská, Czech gymnast and coach (d. 2016)\n*  1942   – Dave Marash, American journalist and sportscaster\n*  1942   – Butch Otter, American soldier and politician, 32nd Governor of Idaho\n*1943 – Yukio Hashi, Japanese singer and actor\n*  1943   – Jim Risch, American lawyer and politician, 31st Governor of Idaho\n*  1943   – Vicente Saldivar, Mexican boxer (d. 1985)\n*1944 – Peter Doyle, English bishop\n*  1944   – Pete Staples, English bass player \n*1945 – Jörg Drehmel, German triple jumper and coach\n*  1945   – Davey Lopes, American baseball player, coach, and manager\n*1946 – Norm Chow, American football player and coach\n*  1946   – Silvino Francisco, South African snooker player\n*  1946   – Greg Gumbel, American sportscaster\n*1947 – Doug Henning, Canadian magician (d. 2000)\n*1948 – Denis Cosgrove, British-American academic and geographer (d. 2008)\n*  1948   – Chris Mulkey, American actor\n*1949 – Liam Donaldson, English physician and academic\n*  1949   – Ruth Lister, Baroness Lister of Burtersett, English academic and politician\n*  1949   – Ron Wyden, American academic and politician\n*1950 – Mary Hopkin, Welsh singer-songwriter\n*  1950   – Dag Arnesen, Norwegian pianist and composer\n*1951 – Alan Clayson, English singer-songwriter and journalist\n*  1951   – Christopher Cross, American singer-songwriter and producer\n*  1951   – Ashok Gehlot, Indian politician, 21st Chief Minister of Rajasthan\n*  1951   – Tatyana Tolstaya, Russian author and publicist\n*1952 – Chuck Baldwin, American pastor and politician\n*  1952   – Caitlin Clarke, American actress (d. 2004)\n*  1952   – Joseph W. Tobin, American cardinal\n*1953 – Bruce Hall, American singer-songwriter, bass player, and producer \n*  1953   – Jake Hooker, Israeli-American guitarist and songwriter (d. 2014)\n*1954 – Angela Bofill, American singer-songwriter\n*  1954   – Jean-Marc Roberts, French author and screenwriter (d. 2013)\n*1955 – Stephen D. M. Brown, British geneticist\n*  1955   – Colin Deans, Scottish rugby player\n*  1955   – David Hookes, Australian cricketer, coach, and sportscaster (d. 2004)\n*  1955   – Seishirō Nishida, Japanese actor\n*1956 – Marc Bellemare, Canadian lawyer and politician\n*1957 – Alain Côté, Canadian ice hockey player\n*  1957   – Rod Langway, Taiwanese-American ice hockey player and coach\n*1958 – Bill Sienkiewicz, American author and illustrator\n*  1958   – Sandi Toksvig, Danish-English comedian, author, and radio host\n*1959 – David Ball, English keyboard player and producer \n*  1959   – Uma Bharti, Indian activist and politician, 16th Chief Minister of Madhya Pradesh\n*  1959   – Ben Elton, English actor, director, and screenwriter\n*1960 – Geraint Davies, Welsh businessman and politician\n*  1960   – Kathy Smallwood-Cook, English sprinter and educator\n*1961 – Steve McClaren, English footballer and manager\n*  1961   – Joe Murray, American animator, producer, and screenwriter\n*  1961   – David Vitter, American lawyer and politician\n*  1961   – Leyla Zana, Kurdish activist and politician\n*1962 – Anders Graneheim, Swedish bodybuilder\n*1963 – Jeff Hornacek, American basketball player and coach\n*  1963   – Marco Mendoza, American guitarist \n*  1963   – Mona Siddiqui, Pakistani-Scottish journalist and academic\n*1964 – Sterling Campbell, American drummer and songwriter \n*  1964   – Ron Hextall, Canadian-American ice hockey player and manager\n*1965 – Ignatius Aphrem II, Syrian patriarch\n*  1965   – Mark Cousins, Northern Irish director, writer, cinematographer\n*  1965   – John Jensen, Danish footballer and coach\n*  1965   – Mikhail Prokhorov, Russian businessman\n*1966 – Giorgos Agorogiannis, Greek footballer\n*  1966   – Frank Dietrich, German politician (d. 2011)\n*1967 – Daniel Anderson Australian rugby league coach and manager\n*1967 – Kenneth Joel Hotz Canadian producer, writer, director, actor, and comedian  \n*  1967   – André Olbrich, German guitarist and songwriter \n*1968 – Viliami Ofahengaue, Tongan-Australian rugby player\n*1969 – Daryl F. Mallett, American author and actor\n*  1969   – Bruce Reyes-Chow, American minister and author\n*1970 – Bobby Cannavale, American actor \n*  1970   – Jeffrey Sebelia, American fashion designer\n*1971 – Douglas Carswell, English politician\n*  1971   – Josey Scott, American singer-songwriter and guitarist \n*1972 – Stephen Barclay, English lawyer and politician\n*  1972   – Wally Bayola, Filipino actor, singer, comedian and television personality\n*1973 – Jamie Baulch, English sprinter and television host\n*1975 – Willie Geist, American television journalist and host \n*  1975   – Christina Hendricks, American actress\n*  1975   – Dulé Hill, American actor, dancer, and producer\n*  1975   – Rainstone, South Korean songwriter and record producer\n*1976 – Jeff Halpern, American ice hockey player\n*  1976   – Brad Scott, Australian footballer and coach\n*  1976   – Chris Scott, Australian footballer and coach\n*1977 – Ryan Dempster, Canadian baseball player and sportscaster\n*  1977   – Tyronn Lue, American basketball player and coach\n*  1977   – Hiro Mashima, Japanese illustrator\n*  1977   – Maryam Mirzakhani, Iranian mathematiker (d. 2017)\n*  1977   – Ben Olsen, American soccer player and coach\n*1978 – Christian Annan, Ghanaian-Hong Kong footballer\n*  1978   – Paul Banks, English-American singer-songwriter and guitarist \n*  1978   – Dai Tamesue, Japanese hurdler\n*  1978   – Lawrence Tynes, American football player\n*1979 – Steve Mack, American wrestler\n*  1979   – Anastasiya Shvedova, Belarusian pole vaulter\n*1980 – Zuzana Ondrášková, Czech tennis player\n*  1980   – Marcel Vigneron, American chef \n*1982 – Igor Olshansky, Ukrainian-American football player\n*  1982   – Nick Stavinoha, American baseball player\n*1983 – Joseph Addai, American football player\n*  1983   – Romeo Castelen, Dutch footballer\n*  1983   – Jérôme Clavier, French pole vaulter\n*  1983   – Márton Fülöp, Hungarian footballer (d. 2015)\n*1985 – Ezequiel Lavezzi, Argentinian footballer\n*  1985   – Kadri Lehtla, Estonian biathlete\n*  1985   – Miko Mälberg, Estonian swimmer\n*1986 – Moon Byung-woo, South Korean footballer\n*1987 – Lina Grinčikaitė, Lithuanian sprinter\n*1988 – Ben Revere, American baseball player\n*  1988   – Paddy Holohan, Irish mixed martial artist\n*1989 – Jesse Bromwich, New Zealand rugby league player\n*  1989   – Katinka Hosszú, Hungarian swimmer\n*1990 – Brooks Koepka, American golfer\n*1991 – Samuel Seo, South Korean musician\n*1992 – Aaron Whitchurch, Australian rugby league player\n*1995 – Ivan Bukavshin, Russian chess player (d. 2016)\n*1996 – Mary Cain, American runner\n*  1996   – Alex Iwobi, Nigerian football player\n*  1996   – Domantas Sabonis, Lithuanian basketball player\n*1997 – Ivana Jorović, Serbian tennis player\n\nDeaths\n\n* 678 – Tōchi, Japanese princess\n* 738 – Uaxaclajuun Ub'aah K'awiil, Mayan ruler (ajaw)\n*1152 – Matilda of Boulogne (b. 1105)\n*1270 – Béla IV of Hungary (b. 1206)\n*1294 – John I, Duke of Brabant (b. 1252)\n*1330 – Alexios II Megas Komnenos, Emperor of Trebizond (b. 1282)\n*1410 – Antipope Alexander V\n*1481 – Mehmed the Conqueror, Ottoman sultan (b. 1432)\n*1501 – John Devereux, 8th Baron Ferrers of Chartley, English Baron (b. 1463)\n*1524 – Richard Grey, 3rd Earl of Kent, English peer (b. 1481)\n*1534 – Juana de la Cruz Vazquez Gutierrez, Spanish Roman Catholic nun and venerable (b. 1481)\n*1589 – Julius, Duke of Brunswick-Lüneburg (b. 1528)\n*1606 – Henry Garnet, English priest and author (b. 1555)\n*1621 – Elizabeth Bacon, English Tudor gentlewoman (b. 1541)\n*1679 – James Sharp, Scottish archbishop (b. 1613)\n*1693 – Claude de Rouvroy, duc de Saint-Simon, French courtier (b. 1607)\n*1704 – Heinrich Ignaz Franz Biber, Czech-Austrian violinist and composer (b. 1644)\n*1724 – John Leverett the Younger, American lawyer, academic, and politician (b. 1662)\n*1750 – John Willison, Scottish minister and author (b. 1680)\n*1752 – Samuel Ogle, English-American captain and politician, 5th Governor of Restored Proprietary Government (b. 1692)\n*1758 – Pope Benedict XIV (b. 1675)\n*1763 – George Psalmanazar, French-English author (b. 1679)\n*1764 – Francesco Algarotti, Italian philosopher, poet, and critic (b. 1712)\n*1779 – John Winthrop, American mathematician, physicist, and astronomer (b. 1714)\n*1793 – Martin Gerbert, German historian and theologian (b. 1720)\n*1839 – Ferdinando Paer, Italian composer (b. 1771)\n*1856 – Adolphe Adam, French composer and critic (b. 1803)\n*1910 – Howard Taylor Ricketts, American pathologist (b. 1871)\n*1916 – Tom Clarke, Irish rebel (b. 1858)\n*  1916   – Thomas MacDonagh, Irish poet and rebel (b. 1878)\n*  1916   – Patrick Pearse, Irish teacher and rebel leader (b. 1879)\n*1918 – Charlie Soong, Chinese businessman and missionary (b. 1863)\n*1921 – Théodore Pilette, Belgian race car driver (b. 1883)\n*1925 – Clément Ader, French engineer, designed the Ader Avion III (b. 1841)\n*1932 – Charles Fort, American journalist and author (b. 1874)\n*1935 – Jessie Willcox Smith, American illustrator (b. 1863)\n*1939 – Madeleine Desroseaux, French author and poet (b. 1873)\n*1942 – Thorvald Stauning, Danish politician, 24th Prime Minister of Denmark (b. 1873)\n*1943 – Harry Miller, American engineer (b. 1875)\n*1948 – Ernst Tandefelt, Finnish assassin of Heikki Ritavuori (b. 1876)\n*1949 – Fanny Walden, English footballer and cricketer (b. 1888)\n*1958 – Frank Foster, English cricketer (b. 1889)\n*1969 – Zakir Husain, Indian academic and politician, 3rd President of India (b. 1897)\n*1970 – Cemil Gürgen Erlertürk, Turkish footballer, coach, and pilot (b. 1918)\n*1972 – Kenneth Bailey, Australian lawyer and diplomat, Australian High Commissioner to Canada (b. 1898)\n*  1972   – Emil Breitkreutz, American runner and coach (b. 1883)\n*  1972   – Bruce Cabot, American actor (b. 1904)\n*1978 – Bill Downs, American journalist (b. 1914)\n*1981 – Nargis, Indian actress (b. 1929)\n*1986 – Robert Alda, American actor (b. 1914)\n*1988 – Lev Pontryagin, Russian mathematician and academic (b. 1908)\n*1989 – Christine Jorgensen, American trans woman (b. 1926)\n*1991 – Jerzy Kosiński, Polish-American novelist and screenwriter (b. 1933)\n*1992 – George Murphy, American actor, dancer, and politician (b. 1902)\n*1996 – Dimitri Fampas, Greek guitarist, composer, and educator (b. 1921)\n*  1996   – Alex Kellner, American baseball player (b. 1924)\n*  1996   – Jack Weston, American actor (b. 1924)\n*1997 – Sébastien Enjolras, French race car driver (b. 1976)\n*  1997   – Narciso Yepes, Spanish guitarist and composer (b. 1927)\n*1998 – Gene Raymond, American actor (b. 1908)\n*1999 – Joe Adcock, American baseball player and manager (b. 1927)\n*  1999   – Steve Chiasson, Canadian-American ice hockey player (b. 1967)\n*  1999   – Godfrey Evans, English cricketer (b. 1920)\n*2000 – Júlia Báthory, Hungarian glass designer (b. 1901)\n*  2000   – John Joseph O'Connor, American cardinal (b. 1920)\n*2002 – Barbara Castle, Baroness Castle of Blackburn, English politician, First Secretary of State (b. 1910)\n*  2002   – Yevgeny Svetlanov, Russian pianist, composer, and conductor (b. 1928)\n*2003 – Suzy Parker, American model and actress (b. 1932)\n*2004 – Ken Downing, English race car driver (b. 1917)\n*  2004   – Darrell Johnson, American baseball player, coach, and manager (b. 1928)\n*2006 – Karel Appel, Dutch painter, sculptor, and poet (b. 1921)\n*  2006   – Pramod Mahajan, Indian politician (b. 1949)\n*  2006   – Earl Woods, American colonel, baseball player, and author (b. 1932)\n*2007 – Warja Honegger-Lavater, Swiss illustrator (b. 1913)\n*  2007   – Wally Schirra, American captain, pilot, and astronaut (b. 1923)\n*  2007   – Knock Yokoyama, Japanese politician (b. 1932)\n*2008 – Leopoldo Calvo-Sotelo, Spanish engineer and politician, Prime Minister of Spain (b. 1926)\n*2009 – Renée Morisset, Canadian pianist (b. 1928)\n*  2009   – Ram Balkrushna Shewalkar, Indian author and critic (b. 1931)\n*2010 – Roy Carrier, American accordion player (b. 1947)\n*  2010   – Peter O'Donnell, English soldier and author (b. 1920)\n*  2010   – Guenter Wendt, German-American engineer (b. 1923)\n*2011 – Jackie Cooper, American actor, television director, producer and executive (b. 1922)\n*  2011   – Sergo Kotrikadze, Georgian footballer and manager (b. 1936)\n*  2011   – Thanasis Veggos, Greek actor and director (b. 1927)\n*2012 – Jorge Illueca, Panamanian politician, 30th President of Panama (b. 1918)\n*  2012   – Felix Werder, German-Australian composer, conductor, and critic (b. 1922)\n*2013 – Joe Astroth, American baseball player (b. 1922)\n*  2013   – Herbert Blau, American engineer and academic (b. 1926)\n*  2013   – Cedric Brooks, Jamaican-American saxophonist and flute player (b. 1943)\n*  2013   – Keith Carter, American swimmer and soldier (b. 1924)\n*  2013   – Brad Drewett, Australian tennis player and sportscaster (b. 1958)\n*  2013   – David Morris Kern, American pharmacist, co-invented Orajel (b. 1909)\n*  2013   – Curtis Rouse, American football player (b. 1960)\n*  2013   – Branko Vukelić, Croatian politician, 11th Minister of Defence for Croatia (b. 1958)\n*2014 – Gary Becker, American economist and academic, Nobel Prize laureate (b. 1930)\n*  2014   – Francisco Icaza, Mexican painter (b. 1930)\n*  2014   – Jim Oberstar, American educator and politician (b. 1934)\n*2015 – Revaz Chkheidze, Georgian director and screenwriter (b. 1926)\n*  2015   – Danny Jones, Welsh rugby player (b. 1986)\n*  2015   – Warren Smith, American golfer and coach (b. 1915)\n*2016 – Ian Deans, Canadian politician (b. 1937)\n*  2016   – Jadranka Stojaković, Yugoslav singer-songwriter  (b. 1950)\n*2017 – Daliah Lavi, Israeli actress, singer and model (b. 1942)\n\nHolidays and observances\n\n* Christian feast day:\n** Abhai (Syriac Orthodox Church)\n** Antonia and Alexander\n** Juvenal of Narni\n** Moura (Coptic Church)\n** Philip and James the Lesser\n** Pope Alexander I\n** Sarah the Martyr (Coptic Church)\n** The Most Holy Virgin Mary Queen of Poland \n** Theodosius of Kiev (Eastern Orthodox Church)\n** May 3 (Eastern Orthodox liturgics)\n* Constitution Memorial Day (Japan)\n* Constitution Day (Poland)\n* Finding of the Holy Cross-related observances:\n** Fiesta de las Cruces (Spain and Hispanic America)\n** Roodmas, or Feast of the Finding of the Holy Cross (Gallican Rite of the Catholic Church)\n* Sun Day (International)\n* World Press Freedom Day. May 3. http://en.wikipedia.org/?curid=19350."
  }
}
