{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10847",
  "eid" : "f8097ae0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778495886,
  "textBody" : "The First Lady of the United States (FLOTUS) is the informal but accepted title held by the wife of the President of the United States, concurrent with the president's term of office. Although the first lady's role has never been codified or officially defined, she figures prominently in the political and social life of the nation.  Since the early 20th century, the First Lady has been assisted by official staff, now known as the Office of the First Lady and headquartered in the East Wing of the White House.  Melania Trump is the current First Lady.\n\nWhile the title was not in general use until much later, Martha Washington, the wife of George Washington, the first U.S. President (1789–1797), is considered to be the inaugural First Lady of the United States. During her lifetime, she was often referred to as \"Lady Washington\".\n\nSince the 1790s, the role of first lady has changed considerably. It has come to include involvement in political campaigns, management of the White House, championship of social causes, and representation of the president at official and ceremonial occasions. Because first ladies now typically publish their memoirs, which are viewed as potential sources of additional information about their husbands’ administrations, and because the public is interested in these increasingly independent women in their own right, first ladies frequently remain a focus of attention long after their husbands’ terms of office have ended. Additionally, over the years individual first ladies have held influence in a range of sectors, from fashion to public opinion on policy. Historically, should a president be unmarried, or a widower, the president usually asks a relative or friend to act as White House hostess.\n\nThere are five living former first ladies: Rosalynn Carter, wife of Jimmy Carter; Barbara Bush, wife of George H. W. Bush; Hillary Clinton, wife of Bill Clinton; Laura Bush, wife of George W. Bush; and Michelle Obama, wife of Barack Obama.\n\nOrigins of the title \n\nThe use of the title First Lady to describe the spouse or hostess of an executive began in the United States. In the early days of the republic, there was not a generally accepted title for the wife of the president. Many early first ladies expressed their own preference for how they were addressed, including the use of such titles as \"Lady\", \"Mrs. President\", and \"Mrs. Presidentress\"; Martha Washington was often referred to as \"Lady Washington.\"  One of the earliest uses of the term \"First Lady\" was applied to her in an 1838 newspaper article that appeared in the St. Johnsbury Caledonian, the author, \"Mrs. Sigourney\", discussing how Martha Washington had not changed, even after her husband George became president, wrote that \"The first lady of the nation still preserved the habits of early life. Indulging in no indolence, she left the pillow at dawn, and after breakfast, retired to her chamber for an hour for the study of the scriptures and devotion\".\n\nDolley Madison was reportedly referred to as \"First Lady\" in 1849 at her funeral in a eulogy delivered by President Zachary Taylor; however, no written record of this eulogy exists, nor did any of the newspapers of her day refer to her by that title. Sometime after 1849, the title began being used in Washington, D.C., social circles. One of the earliest known written examples comes from November 3, 1863, diary entry of William Howard Russell, in which he referred to gossip about \"the First Lady in the Land,\" referring to Mary Todd Lincoln. The title first gained nationwide recognition in 1877, when newspaper journalist Mary C. Ames referred to Lucy Webb Hayes as \"the First Lady of the Land\" while reporting on the inauguration of Rutherford B. Hayes. The frequent reporting on Lucy Hayes' activities helped spread use of the title outside Washington. A popular 1911 comedic play about Dolley Madison by playwright Charles Nirdlinger, titled The First Lady in the Land, popularized the title further. By the 1930s, it was in wide use. Use of the title later spread from the United States to other nations.\n\nWhen Edith Wilson took control of her husband's schedule in 1919 after he had a debilitating stroke, one Republican senator labeled her \"the Presidentress who had fulfilled the dream of the suffragettes by changing her title from First Lady to Acting First Man.\"\n\nThe wife of the Vice President of the United States is sometimes referred to as the Second Lady of the United States, but this title is much less common.\n\nNon-spouses in the role \n\nSeveral women (at least thirteen) who were not presidents' wives have served as First Lady, as when the president was a bachelor or widower, or when the wife of the president was unable to fulfill the duties of the First Lady herself. In these cases, the position has been filled by a female relative or friend of the president, such as Martha Jefferson Randolph during Jefferson's presidency, Emily Donelson and Sarah Yorke Jackson during Jackson's, Mary Elizabeth (Taylor) Bliss during Taylor's, Mary Harrison McKee during Benjamin Harrison's presidency, upon her mother's death, Harriet Lane during Buchanan's, and Rose Cleveland prior to Cleveland's marriage. Ivanka Trump temporarily took over the duties of First Lady during the beginning of the presidency of Donald Trump as his wife stayed in New York to finish their son's school year. Melania Trump took over her role of First Lady in June of 2017.\n\nRole \n\nThe position of the First Lady is not an elected one and carries only ceremonial duties. Nonetheless, first ladies have held a highly visible position in American society. The role of the First Lady has evolved over the centuries. She is, first and foremost, the hostess of the White House. She organizes and attends official ceremonies and functions of state either along with, or in place of, the president. Lisa Burns identifies four successive main themes of the first ladyship: as public woman (1900–1929); as political celebrity (1932–1961); as political activist (1964–1977); and as political interloper (1980–2001).\n\nMartha Washington created the role and hosted many affairs of state at the national capital (New York and Philadelphia). This socializing became known as \"the Republican Court\" and provided elite women with an opportunity to play backstage political role. Both Martha Washington and Abigail Adams were treated as if they were \"ladies\" of the British royal court.\n\nDolley Madison popularized the First Ladyship by engaging in efforts to assist orphans and women, by dressing in elegant fashions and attracting newspaper coverage, and by risking her life to save iconic treasures during the War of 1812. Madison set the standard for the ladyship and her actions were the model for nearly every First Lady until Eleanor Roosevelt in the 1930s. She traveled widely and spoke to many groups, often voicing personal opinions to the left of the president's. She authored a weekly newspaper column and hosted a radio show.  Jacqueline Kennedy led an effort to redecorate and restore the White House.\n\nMany first ladies became significant fashion trendsetters. Some have exercised a degree of political influence by virtue of being an important adviser to the president.\n\nOver the course of the 20th century, it became increasingly common for first ladies to select specific causes to promote, usually ones that are not politically divisive. It is common for the First Lady to hire a staff to support these activities. Lady Bird Johnson pioneered environmental protection and beautification. Pat Nixon encouraged volunteerism and traveled extensively abroad; Betty Ford supported women's rights; Rosalynn Carter aided those with mental disabilities; Nancy Reagan founded the Just Say No drug awareness campaign; Barbara Bush promoted literacy; Hillary Clinton sought to reform the healthcare system in the U.S.; Laura Bush supported women's rights groups, and encouraged childhood literacy. Michelle Obama became identified with supporting military families and tackling childhood obesity; and Melania Trump has stated that she wants to use her position to help children, including prevention of cyberbullying and supporting children whose lives are affected by drugs. \n\nNear the end of her husband's presidency, Clinton became the first First Lady to run for political office. During the campaign, her daughter, Chelsea, took over much of the First Lady's role. Victorious, Clinton served as U.S. Senator from New York from 2001 to 2009, when she resigned in order to become President Obama's Secretary of State. Clinton was the Democratic Party nominee for President in the 2016 election, but lost to Donald Trump.\n\nOffice of the First Lady \n\nThe Office of the First Lady of the United States is accountable to the First Lady for her to carry out her duties as hostess of the White House, and is also in charge of all social and ceremonial events of the White House. The First Lady has her own staff that includes a chief of staff, press secretary, White House Social Secretary, Chief Floral Designer, etc. The Office of the First Lady is an entity of the White House Office, a branch of the Executive Office of the President. When First Lady Hillary Clinton decided to pursue a run for Senator of New York, she set aside her duties as first lady and moved to Chappaqua, New York to establish state residency. She resumed her duties as First Lady after winning her senatorial campaign, and retained her duties as both first lady and U.S. Senator for the seventeen-day overlap before Bill Clinton's term came to an end.\n\nDespite the significant responsibilities usually handled by the First Lady, the First Lady does not receive a salary. This has been criticized by both Ronald Reagan and Barack Obama.\n\nExhibitions and collections \n\nEstablished in 1912, the First Ladies Collection has been one of the most popular attractions at the Smithsonian Institution. The original exhibition opened in 1914 and was one of the first at the Smithsonian to prominently feature women. Originally focused largely on fashion, the exhibition now delves deeper into the contributions of first ladies to the presidency and American society. In 2008, \"First Ladies at the Smithsonian\" opened at the National Museum of American History as part of its reopening year celebration. That exhibition served as a bridge to the museum's expanded exhibition on first ladies' history that opened on November 19, 2011. \"The First Ladies\" explores the unofficial but important position of first lady and the ways that different women have shaped the role to make their own contributions to the presidential administrations and the nation. The exhibition features 26 dresses and more than 160 other objects, ranging from those of Martha Washington to Michelle Obama, and includes White House china, personal possessions and other objects from the Smithsonian's unique collection of first ladies' materials.\n\nFirst Lady and fashion \n\nSome first ladies have garnered attention for their dress and style. Jacqueline Kennedy, for instance, became a global fashion icon: her style was copied by commercial manufacturers and imitated by many young women, and she was named to the International Best Dressed List Hall of Fame in 1965. Michelle Obama has also received significant attention for her fashion choices: style writer Robin Givhan praised her in The Daily Beast, arguing that the First Lady's style has helped to enhance the public image of the office.\n\nLiving former First Ladies \n\nAs of February 2018, there are five living former First Ladies, as seen below.\n\nFile:Rosalynn Carter 2016.jpg|Rosalynn Carterserved 1977–81born 1927 (age )wife of Jimmy Carter\nFile:Barbara Bush 2012.jpg|Barbara Bushserved 1989–93born 1925 (age )wife of George H. W. Bush\nFile:Hillary Clinton by Gage Skidmore 2.jpg|Hillary Clintonserved 1993–2001born 1947 (age )wife of Bill Clinton\nFile:Laura Bush 2012.jpg|Laura Bushserved 2001–09born 1946 (age )wife of George W. Bush\nFile:Michelle Obama (30343251332) (cropped).jpg|Michelle Obamaserved 2009–17born 1964 (age )wife of Barack Obama",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "First Lady of the United States" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10847" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The First Lady of the United States (FLOTUS) is the informal but accepted title held by the wife of the President of the United States, concurrent with the president's term of office. Although the first lady's role has never been codified or officially defined, she figures prominently in the political and social life of the nation.  Since the early 20th century, the First Lady has been assisted by official staff, now known as the Office of the First Lady and headquartered in the East Wing of the White House.  Melania Trump is the current First Lady.\n\nWhile the title was not in general use until much later, Martha Washington, the wife of George Washington, the first U.S. President (1789–1797), is considered to be the inaugural First Lady of the United States. During her lifetime, she was often referred to as \"Lady Washington\".\n\nSince the 1790s, the role of first lady has changed considerably. It has come to include involvement in political campaigns, management of the White House, championship of social causes, and representation of the president at official and ceremonial occasions. Because first ladies now typically publish their memoirs, which are viewed as potential sources of additional information about their husbands’ administrations, and because the public is interested in these increasingly independent women in their own right, first ladies frequently remain a focus of attention long after their husbands’ terms of office have ended. Additionally, over the years individual first ladies have held influence in a range of sectors, from fashion to public opinion on policy. Historically, should a president be unmarried, or a widower, the president usually asks a relative or friend to act as White House hostess.\n\nThere are five living former first ladies: Rosalynn Carter, wife of Jimmy Carter; Barbara Bush, wife of George H. W. Bush; Hillary Clinton, wife of Bill Clinton; Laura Bush, wife of George W. Bush; and Michelle Obama, wife of Barack Obama.\n\nOrigins of the title \n\nThe use of the title First Lady to describe the spouse or hostess of an executive began in the United States. In the early days of the republic, there was not a generally accepted title for the wife of the president. Many early first ladies expressed their own preference for how they were addressed, including the use of such titles as \"Lady\", \"Mrs. President\", and \"Mrs. Presidentress\"; Martha Washington was often referred to as \"Lady Washington.\"  One of the earliest uses of the term \"First Lady\" was applied to her in an 1838 newspaper article that appeared in the St. Johnsbury Caledonian, the author, \"Mrs. Sigourney\", discussing how Martha Washington had not changed, even after her husband George became president, wrote that \"The first lady of the nation still preserved the habits of early life. Indulging in no indolence, she left the pillow at dawn, and after breakfast, retired to her chamber for an hour for the study of the scriptures and devotion\".\n\nDolley Madison was reportedly referred to as \"First Lady\" in 1849 at her funeral in a eulogy delivered by President Zachary Taylor; however, no written record of this eulogy exists, nor did any of the newspapers of her day refer to her by that title. Sometime after 1849, the title began being used in Washington, D.C., social circles. One of the earliest known written examples comes from November 3, 1863, diary entry of William Howard Russell, in which he referred to gossip about \"the First Lady in the Land,\" referring to Mary Todd Lincoln. The title first gained nationwide recognition in 1877, when newspaper journalist Mary C. Ames referred to Lucy Webb Hayes as \"the First Lady of the Land\" while reporting on the inauguration of Rutherford B. Hayes. The frequent reporting on Lucy Hayes' activities helped spread use of the title outside Washington. A popular 1911 comedic play about Dolley Madison by playwright Charles Nirdlinger, titled The First Lady in the Land, popularized the title further. By the 1930s, it was in wide use. Use of the title later spread from the United States to other nations.\n\nWhen Edith Wilson took control of her husband's schedule in 1919 after he had a debilitating stroke, one Republican senator labeled her \"the Presidentress who had fulfilled the dream of the suffragettes by changing her title from First Lady to Acting First Man.\"\n\nThe wife of the Vice President of the United States is sometimes referred to as the Second Lady of the United States, but this title is much less common.\n\nNon-spouses in the role \n\nSeveral women (at least thirteen) who were not presidents' wives have served as First Lady, as when the president was a bachelor or widower, or when the wife of the president was unable to fulfill the duties of the First Lady herself. In these cases, the position has been filled by a female relative or friend of the president, such as Martha Jefferson Randolph during Jefferson's presidency, Emily Donelson and Sarah Yorke Jackson during Jackson's, Mary Elizabeth (Taylor) Bliss during Taylor's, Mary Harrison McKee during Benjamin Harrison's presidency, upon her mother's death, Harriet Lane during Buchanan's, and Rose Cleveland prior to Cleveland's marriage. Ivanka Trump temporarily took over the duties of First Lady during the beginning of the presidency of Donald Trump as his wife stayed in New York to finish their son's school year. Melania Trump took over her role of First Lady in June of 2017.\n\nRole \n\nThe position of the First Lady is not an elected one and carries only ceremonial duties. Nonetheless, first ladies have held a highly visible position in American society. The role of the First Lady has evolved over the centuries. She is, first and foremost, the hostess of the White House. She organizes and attends official ceremonies and functions of state either along with, or in place of, the president. Lisa Burns identifies four successive main themes of the first ladyship: as public woman (1900–1929); as political celebrity (1932–1961); as political activist (1964–1977); and as political interloper (1980–2001).\n\nMartha Washington created the role and hosted many affairs of state at the national capital (New York and Philadelphia). This socializing became known as \"the Republican Court\" and provided elite women with an opportunity to play backstage political role. Both Martha Washington and Abigail Adams were treated as if they were \"ladies\" of the British royal court.\n\nDolley Madison popularized the First Ladyship by engaging in efforts to assist orphans and women, by dressing in elegant fashions and attracting newspaper coverage, and by risking her life to save iconic treasures during the War of 1812. Madison set the standard for the ladyship and her actions were the model for nearly every First Lady until Eleanor Roosevelt in the 1930s. She traveled widely and spoke to many groups, often voicing personal opinions to the left of the president's. She authored a weekly newspaper column and hosted a radio show.  Jacqueline Kennedy led an effort to redecorate and restore the White House.\n\nMany first ladies became significant fashion trendsetters. Some have exercised a degree of political influence by virtue of being an important adviser to the president.\n\nOver the course of the 20th century, it became increasingly common for first ladies to select specific causes to promote, usually ones that are not politically divisive. It is common for the First Lady to hire a staff to support these activities. Lady Bird Johnson pioneered environmental protection and beautification. Pat Nixon encouraged volunteerism and traveled extensively abroad; Betty Ford supported women's rights; Rosalynn Carter aided those with mental disabilities; Nancy Reagan founded the Just Say No drug awareness campaign; Barbara Bush promoted literacy; Hillary Clinton sought to reform the healthcare system in the U.S.; Laura Bush supported women's rights groups, and encouraged childhood literacy. Michelle Obama became identified with supporting military families and tackling childhood obesity; and Melania Trump has stated that she wants to use her position to help children, including prevention of cyberbullying and supporting children whose lives are affected by drugs. \n\nNear the end of her husband's presidency, Clinton became the first First Lady to run for political office. During the campaign, her daughter, Chelsea, took over much of the First Lady's role. Victorious, Clinton served as U.S. Senator from New York from 2001 to 2009, when she resigned in order to become President Obama's Secretary of State. Clinton was the Democratic Party nominee for President in the 2016 election, but lost to Donald Trump.\n\nOffice of the First Lady \n\nThe Office of the First Lady of the United States is accountable to the First Lady for her to carry out her duties as hostess of the White House, and is also in charge of all social and ceremonial events of the White House. The First Lady has her own staff that includes a chief of staff, press secretary, White House Social Secretary, Chief Floral Designer, etc. The Office of the First Lady is an entity of the White House Office, a branch of the Executive Office of the President. When First Lady Hillary Clinton decided to pursue a run for Senator of New York, she set aside her duties as first lady and moved to Chappaqua, New York to establish state residency. She resumed her duties as First Lady after winning her senatorial campaign, and retained her duties as both first lady and U.S. Senator for the seventeen-day overlap before Bill Clinton's term came to an end.\n\nDespite the significant responsibilities usually handled by the First Lady, the First Lady does not receive a salary. This has been criticized by both Ronald Reagan and Barack Obama.\n\nExhibitions and collections \n\nEstablished in 1912, the First Ladies Collection has been one of the most popular attractions at the Smithsonian Institution. The original exhibition opened in 1914 and was one of the first at the Smithsonian to prominently feature women. Originally focused largely on fashion, the exhibition now delves deeper into the contributions of first ladies to the presidency and American society. In 2008, \"First Ladies at the Smithsonian\" opened at the National Museum of American History as part of its reopening year celebration. That exhibition served as a bridge to the museum's expanded exhibition on first ladies' history that opened on November 19, 2011. \"The First Ladies\" explores the unofficial but important position of first lady and the ways that different women have shaped the role to make their own contributions to the presidential administrations and the nation. The exhibition features 26 dresses and more than 160 other objects, ranging from those of Martha Washington to Michelle Obama, and includes White House china, personal possessions and other objects from the Smithsonian's unique collection of first ladies' materials.\n\nFirst Lady and fashion \n\nSome first ladies have garnered attention for their dress and style. Jacqueline Kennedy, for instance, became a global fashion icon: her style was copied by commercial manufacturers and imitated by many young women, and she was named to the International Best Dressed List Hall of Fame in 1965. Michelle Obama has also received significant attention for her fashion choices: style writer Robin Givhan praised her in The Daily Beast, arguing that the First Lady's style has helped to enhance the public image of the office.\n\nLiving former First Ladies \n\nAs of February 2018, there are five living former First Ladies, as seen below.\n\nFile:Rosalynn Carter 2016.jpg|Rosalynn Carterserved 1977–81born 1927 (age )wife of Jimmy Carter\nFile:Barbara Bush 2012.jpg|Barbara Bushserved 1989–93born 1925 (age )wife of George H. W. Bush\nFile:Hillary Clinton by Gage Skidmore 2.jpg|Hillary Clintonserved 1993–2001born 1947 (age )wife of Bill Clinton\nFile:Laura Bush 2012.jpg|Laura Bushserved 2001–09born 1946 (age )wife of George W. Bush\nFile:Michelle Obama (30343251332) (cropped).jpg|Michelle Obamaserved 2009–17born 1964 (age )wife of Barack Obama. First Lady of the United States. http://en.wikipedia.org/?curid=10847."
  }
}
