{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11259",
  "eid" : "fac825b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778500491,
  "textBody" : "A fatwā (; plural fatāwā ) in the Islamic faith is a nonbinding but authoritative legal opinion or learned interpretation that the Sheikhul Islam, a qualified jurist or mufti, can give on issues pertaining to the Islamic law. The person who issues a fatwā is called, in that respect, a mufti, i.e. an issuer of fatwā, from the verb أَفْتَى 'aftā = \"he gave a formal legal opinion on\". This is not necessarily a formal position since most Muslims argue that anyone trained in Islamic law may give an opinion (fatwā) on its teachings. If a fatwā does not break new ground, then it is simply called a ruling.MacFarquhar, Neil. \"The media relations department of Hizbollah wishes you to die: Unexpected encounters in the changing Middle East\", PublicAffairs, 2009, \n\nAn analogy might be made to the issue of legal opinions from courts in common-law systems. Fatwās generally contain the details of the scholar's reasoning, typically in response to a particular case, and are considered binding precedent by those Muslims who have bound themselves to that scholar, including future muftis; mere rulings can be compared to memorandum opinions. The primary difference between common-law opinions and fatwās, however, is that fatwās are not universally binding; as Sharia is not universally consistent and Islam is very non-hierarchical in structure, fatwās do not carry the sort of weight as that of secular common-law opinion.\n\nPractice\n\nIn a religious context, the word fatwā can carry more meaning. Oftentimes, when a Muslim has a question that they need to be answered from an Islamic point of view, they ask an Islamic scholar this question. The answer is commonly known as a fatwā, which typically carries more weight than the opinion of a lay muslim. Muslim scholars are expected to give their fatwā based on religious scripture as opposed to personal belief. Therefore, their fatwā is sometimes regarded as a religious ruling. An example of a fatwā may be the following: Muslims are expected to pray five times every day at specific times during the day. A practicing Muslim who is going to be on a 12-hour flight may not feel that they are able to perform their prayers on time; therefore, they might ask a Muslim scholar for a fatwā on what is the appropriate thing to do. The scholar would provide a response and support it with Muslim scripture. The fatwā is not legally binding or final; it is a respected interpretation of the sharia given by a mufti on a particular case. If the individual is not content with the fatwā given, they can seek out another Mufti or Qadi for a second opinion which might have the desired outcome.\n\nIn Islam, there are four sources from which Muslim scholars extract religious law or rulings, and upon which they base their fatwā. The first is the Quran, which is the holy book of Islam, and which Muslims believe is the direct and literal word of God, revealed to Prophet Mohammad. The second source is the Sunnah, which incorporates anything that the Prophet Mohammad said, did or approved of. The third source is the consensus of the scholars, meaning that if the scholars of a previous generation have all agreed on a certain issue, then this consensus is regarded as representing Islam. Finally, if no scripture is found regarding a specific question from the three first sources, then an Islamic scholar performs what is known as ijtihad. This means that they use their own logic and reasoning to come up with the best answer according to the best of their ability.\nMuslims believe that any given action that they perform in their lives falls into one of five categories:\n# Obligatory\n# Commendable\n# Permissible\n# Despised\n# Not Permitted\nAll actions fall into the \"permissible\" category, unless there is evidence from one of the four sources previously mentioned (Quran, Sunnah, Consensus, Ijtihad) that proves otherwise. Here are some examples:\n\n* The five daily prayers are obligatory upon Muslims. Those who do not perform them are committing a sin, and they will be accountable for that on the day of judgment.\n* Performing additional voluntary prayers is commendable. Those who perform them will be rewarded, but those who do not are not committing a sin.\n* Driving an electric car is permissible, meaning that the action of driving is not good or bad in itself. There is no sin or reward attached to it. Most things fall under this category.\n* Divorce is a despised action. Although there is no sin associated with it, it must only be considered as a last resort when all other means of solving the problems between the spouses have been exhausted.\n* Drinking alcoholic drinks is not permitted. Those who do so are committing a sin, and will be held accountable for it on the day of judgment.\nWhen someone asks a Muslim scholar about performing a specific action, the reply will be a fatwa explaining which of these five categories this action would fall under. So if you ask a Muslim scholar to give a fatwa about adultery, they would tell you that it is \"Not Permitted\". If you ask about fasting in Ramadan, they would answer that it is \"Obligatory\". Muslims are usually encouraged to ask for reasoning and evidence behind any fatwa, and should avoid blindly following the opinions of Muslim scholars without understanding the reasons behind them. This is because Muslims should always feel that they are practicing Islam to gain the pleasure of God, and not to gain the pleasure of acceptance of any human being.  \nIt is also interesting to note that different scholars frequently have different opinions regarding any given question. This is why there is usually more than one fatwa regarding any one question. In fact, there are a number of methodologies for how to understand evidence gathered from the previously mentioned sources of Islamic law. Scholars who follow different methodologies will frequently arrive at different answers to the same question. It is well known that in Islam there are four schools of thought, and each of them differ with respect to certain aspects. However, it is important to know that these differences are usually about minor issues. For example, in terms of beliefs, the vast majority of Muslims agree on most aspects of belief, most importantly the concept of monotheism, and belief in the angels, Prophets, holy books and the Day of Judgment.\n\nHistory\n\nIn the early days of Islam, fatwās were pronounced by distinguished scholars to provide guidance to other scholars, judges and citizens on how subtle points of Islamic law should be understood, interpreted or applied. There were strict rules on who was eligible to issue a valid fatwā and who could not, as well as on the conditions the fatwā must satisfy to be valid.\n\nAccording to the usul al-fiqh (principles of jurisprudence), the fatwā must meet the following conditions in order to be valid:\n# The fatwā is in line with relevant legal proofs, deduced from Qur'anic verses and a hadith; provided the hadith was not later abrogated by Muhammad.\n# It is issued by a person (or a board) having due knowledge and sincerity of heart;\n# It is free from individual opportunism, and not depending on political servitude;\n# It is adequate with the needs of the contemporary world.\n\nWith the existence of modern independent states, each with its own legislative system, or its own body of ulamas, each country develops and applies its own rules, based on its own interpretation of religious prescriptions. Many Muslim countries (such as Egypt and Tunisia) have an official mufti position; a distinguished expert in the sharia is appointed to this position by the civil authorities of the country. But his fatwās are binding on no one: neither the state that appoints him, nor any citizen.\n\nOnline fatwa\n\nFatwas have been transmitted by publication, \"in collections of individual muftis, in annual fatwa collections, ... or in special religious columns of periodicals and newspapers ...\"\nStarting in the 1990s, online fatwa services such as IslamQA.info, fatwa-online.com, and AskImam.org became available, making the searching and finding of fatwas on different subjects even easier. According to at least one source (Sadakat Kadri), these sources reintroduced the advice of trained scholars to many Muslims who had turned to do-it-yourself religious interpretation, but also changed the nature of fatwa advice giving, which had traditionally been local and so \"relatively confidential and conditioned by customs familiar to both parties.\" Scholars from Cairo and Saudi Arabia exported their views to mostly (80+%) non-Arab Muslim world. Muslims are able to observe differences in opinions among scholars of different fatwa sites and to \"contemplate previously unimagined dilemmas and temptations.\"\n\nIssuer qualifications\n\nDuring what is often referred to as the Islamic Golden Age, in order for a scholar to be qualified to issue a fatwā, it was required that he obtained an ijazat attadris wa'l-ifta (\"license to teach and issue legal opinions\") from a Madrasah in the medieval Islamic legal education system, which was developed by the 9th century during the formation of the Madh'hab legal schools. Traditionally, the primary issuers of fatwas were Muftis, who were scholars in Islam. Their job was to interpret Shari'a and they did so within their own communities. Their authority in law and their ability to issue fatwas was entirely based on their reputation and social standing. \n\nIn post-colonial Middle Eastern states, the issuing of Fatwas moved away from the Ancien Regime practice of coming from a Mufti and instead became much more centralized as governments did so. The state department gained the control over appointing Muftis and the fatwas they were allowed to issue to the public. This did cause some discourse among the public, because of the governments involvement in religious matters. \n\nNational level\n\nIn nations where Islamic law is the basis of civil law, but has not been codified, as is the case of some Arab countries in the Middle East, fatāwā by the national religious leadership are debated prior to being issued. In theory, such fatāwā should rarely be contradictory. If two fatāwā are potentially contradictory, the ruling bodies (combined civil and religious law) would attempt to define a compromise interpretation that will eliminate the resulting ambiguity. In these cases, the national theocracies expect fatwā to be settled law.\n\nIn the majority of Arab countries, however, Islamic law has been codified in each country according to its own rules, and is interpreted by the judicial system according to the national jurisprudence. Fatāwā have no direct place in the system, except to clarify very unusual or subtle points of law for experts (not covered by the provisions of modern civil law), or to give moral authority to a given interpretation of a rule.\n \nIn nations where Islamic law is not the basis of law (as is the case in various Asian and African countries), different mujtahids can issue contradictory fatāwā. In such cases, Muslims would typically honour the fatwā deriving from the leadership of their religious tradition. For example, Sunni Muslims would favor a Sunni fatwā whereas Shiites would follow a Shi'a one.\n\nThere exists no international Islamic authority to settle fiqh issues today, in a legislative sense. The closest such organism is the Islamic Fiqh Academy, (a member of the Organisation of Islamic Cooperation (OIC)), which has 57 member states. But it can only render fatwā that are not binding on anyone.\n\nLegal implications\n\nThere is a binding rule that saves the fatwā pronouncements from creating judicial havoc, whether within a Muslim country or at the level of the Islamic world in general: it is unanimously agreed that a fatwā is only binding on its author. This was underlined by Sheikh Abdul Mohsen Al-Obeikan, vice-minister of Justice of Saudi Arabia, in an interview with the Arabic daily Asharq Al-Awsat, as recently as on July 9, 2006, in a discussion of the legal value of a fatwā by the Islamic Fiqh Academy (IFA) on the subject of misyar marriage, which had been rendered by IFA on April 12, 2006. He said, \"Even the decisions of the official Ifta authority [the official Saudi fatwā institute] is binding on no one, whether for the people or the state.\" Al-Obeikan, however, was subsequently removed from his position as advisor to the royal cabinet in May 2012 after opposing moves to relax gender segregation, and in August 2012, Obeikan’s morning radio show \"Fatwas on Air,\" in which he would issue daily fatwas, was canceled after a royal decree that authorizes only members of the Council of Senior Scholars to issue fatwās.\n\nStill, sometimes, even leading religious authorities and theologians misleadingly present their fatwā as obligatory, or try to adopt some \"in-between\" position.\n\nThus, the Sheikh of al-Azhar in Cairo, Muhammad Sayid Tantawy, who is the leading religious authority in the Sunni Muslim establishment in Egypt, alongside the Grand Mufti of Egypt, said the following about fatwās issued by himself or the entire Dar al-Ifta:\n\n\"Fatwā issued by Al-Azhar are not binding, but they are not just whistling in the wind either; individuals are free to accept them, but Islam recognizes that extenuating circumstances may prevent it. For example, it is the right of Muslims in France who object to the law banning the veil to bring it up to the legislative and judicial authorities. If the judiciary decides in favor of the government because the country is secular, they would be considered to be Muslim individuals acting under compelling circumstances.\" Otherwise, in his view, they would be expected to adhere to the fatwā.\n\nIn Morocco, where king Mohammed VI is also Amir al-Muminin (Commander of the Faithful), the authorities have tried to organize the field by creating a scholars' council (conseil des oulémas) composed of Muslim scholars (ulama), which is the only one allowed to issue fatāwā. In this case, a national theocracy could in fact compel intra-national compliance with the fatwā, since a central authority is the source. Even then, however, the issue would not necessarily be religiously binding for the residents of that nation. For, the state may have the power to put a fatwā in effect, but that does not mean that the fatwā is to be religiously accepted by all. For instance, if a state fatwā council made abortion acceptable in the first trimester without any medical reason, that would have direct impact on official procedures in hospitals and courts in that country. Yet, this would not mean that the Muslims in that nation has to agree with that fatwā, or that the fatwā is religiously binding for them.\n\nSources\n\nSources of fatwā include:\n* Al-Azhar University\n* Mufti Ebrahim Desai \n* Darul Iftaa, Bareilly Shareef\n* Darul Iftaa, Jamiatul Ashrafia Misbah ul-Ulum \n* Cairo University Center of Islamic Research and Studies\n* Islamopedia Online\n* Islamic Enlightenment Foundation, a source for authentic fatwas in Arabic, English and Urdu. Fatwas issued by muftis from Jamia Uloom-ul-Islamia, Binnori Town, Pakistan.\n* Darul Uloom Karachi\n* IslamOnline fatwa website created by Yusuf al-Qaradawi\n* IslamQA.com - fatwa website created by Muhammad Al-Munajjid\n* Permanent Committee for Islamic Research and Issuing Fatwas - official fatwa website of the Kingdom of Saudi Arabia\n\nContemporary examples\n\nFatwā are expected to deal with religious issues, subtle points of interpretation of the fiqh as exemplified by the cases cited in the archives linked below. In certain cases, religious issues and political ones seem to be inextricably intertwined. The term fatwā is sometimes used by some Muslims to mean to \"give permission\" to do a certain act that might be illegal under Islamic law; other Muslims view this to be incorrect.\n\nDespite the word \"fatwā\" not being included in the Qur'an, individuals commonly obtain fatwā to guide them in everyday life. Due to the lack of a central unifying rulemaker, different sheiks may give different answers to the same question. This leaves an opportunity for the controversial practice of \"fatwā shopping\", in which an individual asks the same question of different sheiks until they receive an answer they like.\n\nExamples of famous or controversial fatwā include the following:\n\nOn December 2, 1947 the University of Al-Azhar religious scholars, the most respected in the Sunni Muslim word, called for holy war against the Zionists.\"Partition of Palestine and Declaration of Jihad\", cited in Benny Morris, \"1948 as Jihad\", page 5.\n\nIn April 1974 the Muslim World League issued a fatwa stating that followers  of the Ahmadiyyah movement are to be considered \"non-Muslims\".Yohanan Friedmann: Prophecy Continuous. Aspects of Ahmadi Religious Thought and Its Medieval Background. 2 Auflage. Oxford University Press, Neu-Delhi 2003, S. 44.\n  \nAyatollah Ruhollah Khomeini in 1989 pronounced a death sentence on Salman Rushdie, the author of The Satanic Verses.\n\nIn 2001, religious authorities in the United Arab Emirates issued a fatwā against the children's game Pokémon, after finding that it encouraged gambling, and was based on the theory of evolution, \"a Jewish-Darwinist theory, that conflicts with the truth about humans and with Islamic principles\".\n\nIn 2001, Egypt's Grand Mufti issued a fatwā stating that the show \"Who will Win the Million?\" (modelled on the British show Who Wants to be a Millionaire?) was un-Islamic. The Sheikh of Cairo's Al-Azhar University later rejected the fatwā, finding that there was no objection to such shows since they spread general knowledge.\n\nIn Syria, Grand Mufti Ahmad Badruddin Hassoun issued a fatwa prohibiting every type of smoking, including cigarettes and narghile, as well as the selling and buying of tobacco and any affiliation with tobacco distribution (see also Smoking in Syria).\n\nYusuf al-Qaradawi released a fatwā on April 14, 2004, stating that the boycott of American and Israeli products was an obligation for all who are able. The fatwā reads in part:\n\nIf people ask in the name of religion we must help them. The vehicle of this support is a complete boycott of the enemies' goods. Each riyal, dirham …etc. used to buy their goods eventually becomes bullets to be fired at the hearts of brothers and children in Palestine. For this reason, it is an obligation not to help them (the enemies of Islam) by buying their goods. To buy their goods is to support tyranny, oppression and aggression. Buying goods from them will strengthen them; our duty is to make them as weak as we can. Our obligation is to strengthen our resisting brothers in the Sacred Land as much as we can. If we cannot strengthen the brothers, we have a duty to make the enemy weak. If their weakness cannot be achieved except by boycott, we must boycott them.\n\nAmerican goods, exactly like the great Israeli goods, are forbidden. It is also forbidden to advertise these goods, even though in many cases they prove to be superior. America today is a second Israel. It totally supports the Zionist entity. The usurper could not do this without the support of America. \"Israel’s\" unjustified destruction and vandalism of everything has been using American money, American weapons, and the American veto. America has done this for decades without suffering the consequences of any punishment or protests about their oppressive and prejudiced position from the Islamic world.\n\nSheik Sadeq Abdallah bin Al-Majed, leader of the Muslim Brotherhood in Sudan, issued a fatwā that prohibits vaccination of children claiming it is a conspiracy of the Jews and Freemasons.\n\nIndian Muslim scholars issued a fatwā of death against Taslima Nasreen, an exiled controversial Bangladeshi writer. Majidulla Khan Farhad of Hyderabad-based Majlis Bachao Tehriq issued the fatwā at the Tipu Sultan mosque in Kolkata after Juma prayers as saying Taslima has defamed Islam and announced an \"unlimited financial reward\" to anybody who would kill her.[http://www.app.com.pk/en/index.php?optioncom_content&task\nview&id14998&Itemid\n2 Associated Press of Pakistan - Indian Muslim scholars issue Fatwa against Taslima] \n\nIn 1998, Grand Ayatollah Sistani of Iraq, issued a fatwā prohibiting University of Virginia professor Abdulaziz Sachedina from ever again teaching Islam due in part to Sachedina's writings encouraging acceptance of religious pluralism in the Muslim world.http://www.uga.edu/islam/sachedina_silencing.html\n\nIn June 1992, Egyptian writer Farag Foda was assassinated following a fatwa issued by ulamas from Al-Azhar who had adopted a previous fatwa by Sheikh al-Azhar, Jadd al-Haqq, accusing secularist writers such as Foda of being \"enemies of Islam\". The jihadist group Al-Gama'a al-Islamiyya claimed responsibility for the murder.\n\nIn September 1951, the mufti of Egypt issued a fatwa stating that both Coca-Cola and Pepsi-Cola were permissible for Muslims to drink.  In order to arrive at that decision, the Department of Fatwas had the Ministry of Public Health analyze the composition of the two drinks.  As they did not find the pepsin or any narcotic or alcoholic substances to be present, nor any \"microbes harmful to health,\" the mufti found that it was not forbidden under Islamic law. Liebesny, Herbert J., The law of the Near and Middle East readings, cases, and materials, Albany: State University of New York Press, 1975, 42-3 Occasionally the debate regarding whether or not Coca-Cola or Pepsi is drinkable by Muslims does continue to appear, notably recently in 2012 when a French study was released declaring that Coca-Cola contained a small amount of alcohol. Muslims are not permitted to drink alcohol, however the amount of alcohol found in the beverage was discovered so small as to be permissible according to the fatwa system.  \n\nOsama bin Laden issued two fatwās—in 1996 and then again in 1998—that Muslims should kill civilians and military personnel from the United States and allied countries until they withdraw support for Israel and withdraw military forces from Islamic countries.\n\nIn 2003, on his television show John Safran Vs God, Australian comedian John Safran tricked Sheikh Omar Bakri into placing a fatwā on Safran's colleague Rove McManus by showing him falsified evidence seeming to indicate that McManus had been making fun of Islam.\n\nIn 2005, the Leader of the Islamic Republic of Iran, Ayatollah Ali Khamenei, issued a fatwā that the production, stockpiling and use of nuclear weapons are forbidden under Islam and that Iran shall never acquire these weapons.\n\nAnother example of a fatwā is forbidding the smoking of cigarettes by Muslims.\n\nIn September 2007, the Central Java division and Jepara branch of the Indonesian organisation Nahdlatul Ulama (the Awakening of the Religious Scholars) declared the government's proposal to build a nuclear power station nearby at Balong on the Muria peninsula haram or forbidden. The fatwā was issued following a two-day meeting of more than a hundred ulama to consider the pros and cons of the proposal addressed by government ministers, scientists and critics. The decision cited both positive and negative aspects of the proposal, which it had balanced to make its judgment. Key concerns were the question of long-term safe disposal and storage of radioactive waste, the potential local and regional environmental consequences of the plant’s operation, the lack of financial clarity about the project, and issues of foreign technological dependence.Richard Tanter, \"Nuclear fatwa: Islamic jurisprudence and the Muria nuclear power station proposal\", Austral Policy Forum, 13 December 2007, 07-25A.\n\nIn 2008, undercover reporting by a private TV channel in India showed several respected clerics demanding and receiving cash for issuing fatwās. In response, some were suspended from issuing fatwās and Indian Muslim leaders announced that they would create a new body that will monitor the issuing of fatwās in India.\n\nIn 2008, a Pakistani religious leader issued a fatwā on President Asif Ali Zardari for \"indecent gestures\" toward Sarah Palin, U.S. Vice Presidential candidate.\n\nIn 2008, Indian Ulama from the world-renowned seminary of Deoband have categorically issued a fatwā against terrorism and mentioned that any sort of killing of innocent people or civilians is Haram or Forbidden. The fatwā also clarified that there is no Jihad in Kashmir or against India as freedom of religion is guaranteed by the state as any state that guarantees freedom of religion can not have Jihad sanctioned against it. This fatwā was reiterated in 2009 where Indian Home Minister P. Chidrambram hailed the move. The full text of the fatwā in English is available here\n\nDeoband Ulama in India have repeatedly mentioned that the Taliban government in Afghanistan was Un-Islamic. This was most recently reiterated at a convention in Karachi recently. \nThese include the idea of establishing shariah rule with force in the name of Jihad and levying of \"jizya\" on Sikh citizens of Pakistan, which was termed as nothing more than extortion by armed gangs.\nThe stand was explained by Maulana Abu Hassan Nadvi as below\n\nThis can't be called a war in the name of Islam. Even during a legitimate jihad, which is fought not by a rag-tag army of misguided youth but by the state against identified aggressors, Islam has set certain principles like you can't harm the old, sick, women and children. You can't attack any place of worship. But terrorists kill people indiscriminately. They are earning Allah's punishment.\n\nSuicide bombing in any form has also been declared haram and forbidden by Indian ulama. This stand is also supported by Saudi scholars such as Shaykh Muhammad Bin Saalih al-'Uthaymeen, who have issued fatawā declaring suicide bombings are haram and those who commit this act are not shaheed (martyrs).Shaykh Muhammad Bin Saalih al-'Uthaymeen\n\nControversial fatwas\n\nFatwas have the role of explaining religion and guiding the faithful in modern matters that were not previously tackled by scholars or specifically addressed by the Quran or the Hadith of Mohammed. Some fatwas stand out as controversial and often lead to hardship and violence.\n\nIn 2012, Sheikh Murgan Salem al-Gohary of Egypt, a former Taliban, issued a fatwa calling for \"the destruction of the Sphinx and the Giza Pyramids in Egypt\", because \"God ordered Prophet Mohammed to destroy idols.\" Egypt is host to thousands of ancient statues and drawings that mainstream Muslims have not been bothered by for the past 1400 years. These monuments are a major attraction to tourists and scientists interested in ancient Egyptian culture, and not worship. It is unclear why the pyramids were added to the fatwa because they are tombs of pharaohs and not statues or idols.\n\nIn 2012, Abdul-Azeez ibn Abdullaah Aal ash-Shaikh, the Grand Mufti of Saudi Arabia, issued a religious edict prohibiting contact and cooperation with foreign media outlets because they seek  to \"spread chaos and strife in Muslim lands.\" He added that contacting foreign media outlets to \"divulge the country’s secrets or address various matters\" was tantamount to \"treason and major crime.\" He said that \"It is not permissible and is considered betrayal and assistance to the enemies of Islam.\" Also, \"A believer has to help keeping security, that of his nation and community, and protecting his religion.\" This fatwā is vague and itself is in need of another explanatory fatwā. Foreign media appears to have been singled out because it is mostly free and does not conform to Saudi Arabian government censorship. The fatwā uses the extremely strong terms (i.e., \"haram\" or unlawful, \"treason,\" \"betrayal,\" and \"major crime\") for the simple act of contacting the press. This fatwa has the potential to endanger the lives of ordinary citizens and members of the media due to the connotation of its language and overall ambiguity. It also threatens the financial interests of legitimate global business. In democratic societies, journalism and the media play an indispensable role in educating the public and combating corruption.\n\nIn 2011-2012, Abdel-Bari Zamzami of Morocco issued a series of religious edicts that a man has the right to engage in sexual intercourse with his wife up to six hours after her death.[http://www.moroccoboard.com/news/5238 Necrophilia fatwa]  Despite recognizing that such an action is despicable in mainstream society, Zamzami persisted in backing his original fatwā, claiming marriage does not end in death. Zamzami also announced that it is against the religion to take to the streets after the King delivers a speech; this fatwā made the population, as well as the media, question his intentions.\n\nIn 2012, The Indonesian Ulema Council has issued an edict for Muslims not to wish Christians a happy Christmas. The edict said that wishing a happy Christmas was akin to confirming the \"misguided\" teachings of Christianity.\n\nIn 2013, the grand mufti in Kashmir issued a fatwā terming singing as un-Islamic, forcing Kashmir's only all-girls rock band to abandon it.\n\nIn 2014, the Supreme Court of India ruled that Sharia courts have no legal sanction and no one is bound to accept a fatwā in India.\n\nQuotes\n\n* \"In Sunni Islam, a fatwā is nothing more than an opinion. It is just a view of a mufti and is not binding in India.\" ― Maulana Mehmood Madani, president of the Jamaat-e-Ulema-e-Hind.\n* \"The current fashion for online fatwās has created an amazingly legalistic approach to Islam as scholars - some of whom have only a tenuous grip on reality - seek to regulate all aspects of life according to their own interpretation of the scriptures.\" ― Brian Whitaker, The Guardian\n* Excerpts from an interview given by Sheikh Abdul Mohsen Al-Obeikan, vice-minister of Justice of Saudi Arabia, to the Arabic daily Asharq al awsat on July 9, 2006, in which he discusses the legal value of a fatwā by the Islamic Fiqh Academy (IFA) on the subject of misyar marriage, which had been rendered by IFA on April 12, 2006:\n\nOther meanings\n\nSome fatwās have drawn a great deal of attention in Western media, giving rise to the term fatwā being used loosely for statements by non-Muslims that advocate an extreme religious or political position, and loosely or as slang for other sorts of decrees. Examples of such uses include the statements \"The pope issued a fatwā\"D. Bartles-Smith, Signs Of The Times, Number 26, 2007 and \"According to sources in today’s Tibetan resistance, the Chinese Communist 'fatwā' to silence Patterson has never been rescinded.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fatwa" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11259" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A fatwā (; plural fatāwā ) in the Islamic faith is a nonbinding but authoritative legal opinion or learned interpretation that the Sheikhul Islam, a qualified jurist or mufti, can give on issues pertaining to the Islamic law. The person who issues a fatwā is called, in that respect, a mufti, i.e. an issuer of fatwā, from the verb أَفْتَى 'aftā = \"he gave a formal legal opinion on\". This is not necessarily a formal position since most Muslims argue that anyone trained in Islamic law may give an opinion (fatwā) on its teachings. If a fatwā does not break new ground, then it is simply called a ruling.MacFarquhar, Neil. \"The media relations department of Hizbollah wishes you to die: Unexpected encounters in the changing Middle East\", PublicAffairs, 2009, \n\nAn analogy might be made to the issue of legal opinions from courts in common-law systems. Fatwās generally contain the details of the scholar's reasoning, typically in response to a particular case, and are considered binding precedent by those Muslims who have bound themselves to that scholar, including future muftis; mere rulings can be compared to memorandum opinions. The primary difference between common-law opinions and fatwās, however, is that fatwās are not universally binding; as Sharia is not universally consistent and Islam is very non-hierarchical in structure, fatwās do not carry the sort of weight as that of secular common-law opinion.\n\nPractice\n\nIn a religious context, the word fatwā can carry more meaning. Oftentimes, when a Muslim has a question that they need to be answered from an Islamic point of view, they ask an Islamic scholar this question. The answer is commonly known as a fatwā, which typically carries more weight than the opinion of a lay muslim. Muslim scholars are expected to give their fatwā based on religious scripture as opposed to personal belief. Therefore, their fatwā is sometimes regarded as a religious ruling. An example of a fatwā may be the following: Muslims are expected to pray five times every day at specific times during the day. A practicing Muslim who is going to be on a 12-hour flight may not feel that they are able to perform their prayers on time; therefore, they might ask a Muslim scholar for a fatwā on what is the appropriate thing to do. The scholar would provide a response and support it with Muslim scripture. The fatwā is not legally binding or final; it is a respected interpretation of the sharia given by a mufti on a particular case. If the individual is not content with the fatwā given, they can seek out another Mufti or Qadi for a second opinion which might have the desired outcome.\n\nIn Islam, there are four sources from which Muslim scholars extract religious law or rulings, and upon which they base their fatwā. The first is the Quran, which is the holy book of Islam, and which Muslims believe is the direct and literal word of God, revealed to Prophet Mohammad. The second source is the Sunnah, which incorporates anything that the Prophet Mohammad said, did or approved of. The third source is the consensus of the scholars, meaning that if the scholars of a previous generation have all agreed on a certain issue, then this consensus is regarded as representing Islam. Finally, if no scripture is found regarding a specific question from the three first sources, then an Islamic scholar performs what is known as ijtihad. This means that they use their own logic and reasoning to come up with the best answer according to the best of their ability.\nMuslims believe that any given action that they perform in their lives falls into one of five categories:\n# Obligatory\n# Commendable\n# Permissible\n# Despised\n# Not Permitted\nAll actions fall into the \"permissible\" category, unless there is evidence from one of the four sources previously mentioned (Quran, Sunnah, Consensus, Ijtihad) that proves otherwise. Here are some examples:\n\n* The five daily prayers are obligatory upon Muslims. Those who do not perform them are committing a sin, and they will be accountable for that on the day of judgment.\n* Performing additional voluntary prayers is commendable. Those who perform them will be rewarded, but those who do not are not committing a sin.\n* Driving an electric car is permissible, meaning that the action of driving is not good or bad in itself. There is no sin or reward attached to it. Most things fall under this category.\n* Divorce is a despised action. Although there is no sin associated with it, it must only be considered as a last resort when all other means of solving the problems between the spouses have been exhausted.\n* Drinking alcoholic drinks is not permitted. Those who do so are committing a sin, and will be held accountable for it on the day of judgment.\nWhen someone asks a Muslim scholar about performing a specific action, the reply will be a fatwa explaining which of these five categories this action would fall under. So if you ask a Muslim scholar to give a fatwa about adultery, they would tell you that it is \"Not Permitted\". If you ask about fasting in Ramadan, they would answer that it is \"Obligatory\". Muslims are usually encouraged to ask for reasoning and evidence behind any fatwa, and should avoid blindly following the opinions of Muslim scholars without understanding the reasons behind them. This is because Muslims should always feel that they are practicing Islam to gain the pleasure of God, and not to gain the pleasure of acceptance of any human being.  \nIt is also interesting to note that different scholars frequently have different opinions regarding any given question. This is why there is usually more than one fatwa regarding any one question. In fact, there are a number of methodologies for how to understand evidence gathered from the previously mentioned sources of Islamic law. Scholars who follow different methodologies will frequently arrive at different answers to the same question. It is well known that in Islam there are four schools of thought, and each of them differ with respect to certain aspects. However, it is important to know that these differences are usually about minor issues. For example, in terms of beliefs, the vast majority of Muslims agree on most aspects of belief, most importantly the concept of monotheism, and belief in the angels, Prophets, holy books and the Day of Judgment.\n\nHistory\n\nIn the early days of Islam, fatwās were pronounced by distinguished scholars to provide guidance to other scholars, judges and citizens on how subtle points of Islamic law should be understood, interpreted or applied. There were strict rules on who was eligible to issue a valid fatwā and who could not, as well as on the conditions the fatwā must satisfy to be valid.\n\nAccording to the usul al-fiqh (principles of jurisprudence), the fatwā must meet the following conditions in order to be valid:\n# The fatwā is in line with relevant legal proofs, deduced from Qur'anic verses and a hadith; provided the hadith was not later abrogated by Muhammad.\n# It is issued by a person (or a board) having due knowledge and sincerity of heart;\n# It is free from individual opportunism, and not depending on political servitude;\n# It is adequate with the needs of the contemporary world.\n\nWith the existence of modern independent states, each with its own legislative system, or its own body of ulamas, each country develops and applies its own rules, based on its own interpretation of religious prescriptions. Many Muslim countries (such as Egypt and Tunisia) have an official mufti position; a distinguished expert in the sharia is appointed to this position by the civil authorities of the country. But his fatwās are binding on no one: neither the state that appoints him, nor any citizen.\n\nOnline fatwa\n\nFatwas have been transmitted by publication, \"in collections of individual muftis, in annual fatwa collections, ... or in special religious columns of periodicals and newspapers ...\"\nStarting in the 1990s, online fatwa services such as IslamQA.info, fatwa-online.com, and AskImam.org became available, making the searching and finding of fatwas on different subjects even easier. According to at least one source (Sadakat Kadri), these sources reintroduced the advice of trained scholars to many Muslims who had turned to do-it-yourself religious interpretation, but also changed the nature of fatwa advice giving, which had traditionally been local and so \"relatively confidential and conditioned by customs familiar to both parties.\" Scholars from Cairo and Saudi Arabia exported their views to mostly (80+%) non-Arab Muslim world. Muslims are able to observe differences in opinions among scholars of different fatwa sites and to \"contemplate previously unimagined dilemmas and temptations.\"\n\nIssuer qualifications\n\nDuring what is often referred to as the Islamic Golden Age, in order for a scholar to be qualified to issue a fatwā, it was required that he obtained an ijazat attadris wa'l-ifta (\"license to teach and issue legal opinions\") from a Madrasah in the medieval Islamic legal education system, which was developed by the 9th century during the formation of the Madh'hab legal schools. Traditionally, the primary issuers of fatwas were Muftis, who were scholars in Islam. Their job was to interpret Shari'a and they did so within their own communities. Their authority in law and their ability to issue fatwas was entirely based on their reputation and social standing. \n\nIn post-colonial Middle Eastern states, the issuing of Fatwas moved away from the Ancien Regime practice of coming from a Mufti and instead became much more centralized as governments did so. The state department gained the control over appointing Muftis and the fatwas they were allowed to issue to the public. This did cause some discourse among the public, because of the governments involvement in religious matters. \n\nNational level\n\nIn nations where Islamic law is the basis of civil law, but has not been codified, as is the case of some Arab countries in the Middle East, fatāwā by the national religious leadership are debated prior to being issued. In theory, such fatāwā should rarely be contradictory. If two fatāwā are potentially contradictory, the ruling bodies (combined civil and religious law) would attempt to define a compromise interpretation that will eliminate the resulting ambiguity. In these cases, the national theocracies expect fatwā to be settled law.\n\nIn the majority of Arab countries, however, Islamic law has been codified in each country according to its own rules, and is interpreted by the judicial system according to the national jurisprudence. Fatāwā have no direct place in the system, except to clarify very unusual or subtle points of law for experts (not covered by the provisions of modern civil law), or to give moral authority to a given interpretation of a rule.\n \nIn nations where Islamic law is not the basis of law (as is the case in various Asian and African countries), different mujtahids can issue contradictory fatāwā. In such cases, Muslims would typically honour the fatwā deriving from the leadership of their religious tradition. For example, Sunni Muslims would favor a Sunni fatwā whereas Shiites would follow a Shi'a one.\n\nThere exists no international Islamic authority to settle fiqh issues today, in a legislative sense. The closest such organism is the Islamic Fiqh Academy, (a member of the Organisation of Islamic Cooperation (OIC)), which has 57 member states. But it can only render fatwā that are not binding on anyone.\n\nLegal implications\n\nThere is a binding rule that saves the fatwā pronouncements from creating judicial havoc, whether within a Muslim country or at the level of the Islamic world in general: it is unanimously agreed that a fatwā is only binding on its author. This was underlined by Sheikh Abdul Mohsen Al-Obeikan, vice-minister of Justice of Saudi Arabia, in an interview with the Arabic daily Asharq Al-Awsat, as recently as on July 9, 2006, in a discussion of the legal value of a fatwā by the Islamic Fiqh Academy (IFA) on the subject of misyar marriage, which had been rendered by IFA on April 12, 2006. He said, \"Even the decisions of the official Ifta authority [the official Saudi fatwā institute] is binding on no one, whether for the people or the state.\" Al-Obeikan, however, was subsequently removed from his position as advisor to the royal cabinet in May 2012 after opposing moves to relax gender segregation, and in August 2012, Obeikan’s morning radio show \"Fatwas on Air,\" in which he would issue daily fatwas, was canceled after a royal decree that authorizes only members of the Council of Senior Scholars to issue fatwās.\n\nStill, sometimes, even leading religious authorities and theologians misleadingly present their fatwā as obligatory, or try to adopt some \"in-between\" position.\n\nThus, the Sheikh of al-Azhar in Cairo, Muhammad Sayid Tantawy, who is the leading religious authority in the Sunni Muslim establishment in Egypt, alongside the Grand Mufti of Egypt, said the following about fatwās issued by himself or the entire Dar al-Ifta:\n\n\"Fatwā issued by Al-Azhar are not binding, but they are not just whistling in the wind either; individuals are free to accept them, but Islam recognizes that extenuating circumstances may prevent it. For example, it is the right of Muslims in France who object to the law banning the veil to bring it up to the legislative and judicial authorities. If the judiciary decides in favor of the government because the country is secular, they would be considered to be Muslim individuals acting under compelling circumstances.\" Otherwise, in his view, they would be expected to adhere to the fatwā.\n\nIn Morocco, where king Mohammed VI is also Amir al-Muminin (Commander of the Faithful), the authorities have tried to organize the field by creating a scholars' council (conseil des oulémas) composed of Muslim scholars (ulama), which is the only one allowed to issue fatāwā. In this case, a national theocracy could in fact compel intra-national compliance with the fatwā, since a central authority is the source. Even then, however, the issue would not necessarily be religiously binding for the residents of that nation. For, the state may have the power to put a fatwā in effect, but that does not mean that the fatwā is to be religiously accepted by all. For instance, if a state fatwā council made abortion acceptable in the first trimester without any medical reason, that would have direct impact on official procedures in hospitals and courts in that country. Yet, this would not mean that the Muslims in that nation has to agree with that fatwā, or that the fatwā is religiously binding for them.\n\nSources\n\nSources of fatwā include:\n* Al-Azhar University\n* Mufti Ebrahim Desai \n* Darul Iftaa, Bareilly Shareef\n* Darul Iftaa, Jamiatul Ashrafia Misbah ul-Ulum \n* Cairo University Center of Islamic Research and Studies\n* Islamopedia Online\n* Islamic Enlightenment Foundation, a source for authentic fatwas in Arabic, English and Urdu. Fatwas issued by muftis from Jamia Uloom-ul-Islamia, Binnori Town, Pakistan.\n* Darul Uloom Karachi\n* IslamOnline fatwa website created by Yusuf al-Qaradawi\n* IslamQA.com - fatwa website created by Muhammad Al-Munajjid\n* Permanent Committee for Islamic Research and Issuing Fatwas - official fatwa website of the Kingdom of Saudi Arabia\n\nContemporary examples\n\nFatwā are expected to deal with religious issues, subtle points of interpretation of the fiqh as exemplified by the cases cited in the archives linked below. In certain cases, religious issues and political ones seem to be inextricably intertwined. The term fatwā is sometimes used by some Muslims to mean to \"give permission\" to do a certain act that might be illegal under Islamic law; other Muslims view this to be incorrect.\n\nDespite the word \"fatwā\" not being included in the Qur'an, individuals commonly obtain fatwā to guide them in everyday life. Due to the lack of a central unifying rulemaker, different sheiks may give different answers to the same question. This leaves an opportunity for the controversial practice of \"fatwā shopping\", in which an individual asks the same question of different sheiks until they receive an answer they like.\n\nExamples of famous or controversial fatwā include the following:\n\nOn December 2, 1947 the University of Al-Azhar religious scholars, the most respected in the Sunni Muslim word, called for holy war against the Zionists.\"Partition of Palestine and Declaration of Jihad\", cited in Benny Morris, \"1948 as Jihad\", page 5.\n\nIn April 1974 the Muslim World League issued a fatwa stating that followers  of the Ahmadiyyah movement are to be considered \"non-Muslims\".Yohanan Friedmann: Prophecy Continuous. Aspects of Ahmadi Religious Thought and Its Medieval Background. 2 Auflage. Oxford University Press, Neu-Delhi 2003, S. 44.\n  \nAyatollah Ruhollah Khomeini in 1989 pronounced a death sentence on Salman Rushdie, the author of The Satanic Verses.\n\nIn 2001, religious authorities in the United Arab Emirates issued a fatwā against the children's game Pokémon, after finding that it encouraged gambling, and was based on the theory of evolution, \"a Jewish-Darwinist theory, that conflicts with the truth about humans and with Islamic principles\".\n\nIn 2001, Egypt's Grand Mufti issued a fatwā stating that the show \"Who will Win the Million?\" (modelled on the British show Who Wants to be a Millionaire?) was un-Islamic. The Sheikh of Cairo's Al-Azhar University later rejected the fatwā, finding that there was no objection to such shows since they spread general knowledge.\n\nIn Syria, Grand Mufti Ahmad Badruddin Hassoun issued a fatwa prohibiting every type of smoking, including cigarettes and narghile, as well as the selling and buying of tobacco and any affiliation with tobacco distribution (see also Smoking in Syria).\n\nYusuf al-Qaradawi released a fatwā on April 14, 2004, stating that the boycott of American and Israeli products was an obligation for all who are able. The fatwā reads in part:\n\nIf people ask in the name of religion we must help them. The vehicle of this support is a complete boycott of the enemies' goods. Each riyal, dirham …etc. used to buy their goods eventually becomes bullets to be fired at the hearts of brothers and children in Palestine. For this reason, it is an obligation not to help them (the enemies of Islam) by buying their goods. To buy their goods is to support tyranny, oppression and aggression. Buying goods from them will strengthen them; our duty is to make them as weak as we can. Our obligation is to strengthen our resisting brothers in the Sacred Land as much as we can. If we cannot strengthen the brothers, we have a duty to make the enemy weak. If their weakness cannot be achieved except by boycott, we must boycott them.\n\nAmerican goods, exactly like the great Israeli goods, are forbidden. It is also forbidden to advertise these goods, even though in many cases they prove to be superior. America today is a second Israel. It totally supports the Zionist entity. The usurper could not do this without the support of America. \"Israel’s\" unjustified destruction and vandalism of everything has been using American money, American weapons, and the American veto. America has done this for decades without suffering the consequences of any punishment or protests about their oppressive and prejudiced position from the Islamic world.\n\nSheik Sadeq Abdallah bin Al-Majed, leader of the Muslim Brotherhood in Sudan, issued a fatwā that prohibits vaccination of children claiming it is a conspiracy of the Jews and Freemasons.\n\nIndian Muslim scholars issued a fatwā of death against Taslima Nasreen, an exiled controversial Bangladeshi writer. Majidulla Khan Farhad of Hyderabad-based Majlis Bachao Tehriq issued the fatwā at the Tipu Sultan mosque in Kolkata after Juma prayers as saying Taslima has defamed Islam and announced an \"unlimited financial reward\" to anybody who would kill her.[http://www.app.com.pk/en/index.php?optioncom_content&task\nview&id14998&Itemid\n2 Associated Press of Pakistan - Indian Muslim scholars issue Fatwa against Taslima] \n\nIn 1998, Grand Ayatollah Sistani of Iraq, issued a fatwā prohibiting University of Virginia professor Abdulaziz Sachedina from ever again teaching Islam due in part to Sachedina's writings encouraging acceptance of religious pluralism in the Muslim world.http://www.uga.edu/islam/sachedina_silencing.html\n\nIn June 1992, Egyptian writer Farag Foda was assassinated following a fatwa issued by ulamas from Al-Azhar who had adopted a previous fatwa by Sheikh al-Azhar, Jadd al-Haqq, accusing secularist writers such as Foda of being \"enemies of Islam\". The jihadist group Al-Gama'a al-Islamiyya claimed responsibility for the murder.\n\nIn September 1951, the mufti of Egypt issued a fatwa stating that both Coca-Cola and Pepsi-Cola were permissible for Muslims to drink.  In order to arrive at that decision, the Department of Fatwas had the Ministry of Public Health analyze the composition of the two drinks.  As they did not find the pepsin or any narcotic or alcoholic substances to be present, nor any \"microbes harmful to health,\" the mufti found that it was not forbidden under Islamic law. Liebesny, Herbert J., The law of the Near and Middle East readings, cases, and materials, Albany: State University of New York Press, 1975, 42-3 Occasionally the debate regarding whether or not Coca-Cola or Pepsi is drinkable by Muslims does continue to appear, notably recently in 2012 when a French study was released declaring that Coca-Cola contained a small amount of alcohol. Muslims are not permitted to drink alcohol, however the amount of alcohol found in the beverage was discovered so small as to be permissible according to the fatwa system.  \n\nOsama bin Laden issued two fatwās—in 1996 and then again in 1998—that Muslims should kill civilians and military personnel from the United States and allied countries until they withdraw support for Israel and withdraw military forces from Islamic countries.\n\nIn 2003, on his television show John Safran Vs God, Australian comedian John Safran tricked Sheikh Omar Bakri into placing a fatwā on Safran's colleague Rove McManus by showing him falsified evidence seeming to indicate that McManus had been making fun of Islam.\n\nIn 2005, the Leader of the Islamic Republic of Iran, Ayatollah Ali Khamenei, issued a fatwā that the production, stockpiling and use of nuclear weapons are forbidden under Islam and that Iran shall never acquire these weapons.\n\nAnother example of a fatwā is forbidding the smoking of cigarettes by Muslims.\n\nIn September 2007, the Central Java division and Jepara branch of the Indonesian organisation Nahdlatul Ulama (the Awakening of the Religious Scholars) declared the government's proposal to build a nuclear power station nearby at Balong on the Muria peninsula haram or forbidden. The fatwā was issued following a two-day meeting of more than a hundred ulama to consider the pros and cons of the proposal addressed by government ministers, scientists and critics. The decision cited both positive and negative aspects of the proposal, which it had balanced to make its judgment. Key concerns were the question of long-term safe disposal and storage of radioactive waste, the potential local and regional environmental consequences of the plant’s operation, the lack of financial clarity about the project, and issues of foreign technological dependence.Richard Tanter, \"Nuclear fatwa: Islamic jurisprudence and the Muria nuclear power station proposal\", Austral Policy Forum, 13 December 2007, 07-25A.\n\nIn 2008, undercover reporting by a private TV channel in India showed several respected clerics demanding and receiving cash for issuing fatwās. In response, some were suspended from issuing fatwās and Indian Muslim leaders announced that they would create a new body that will monitor the issuing of fatwās in India.\n\nIn 2008, a Pakistani religious leader issued a fatwā on President Asif Ali Zardari for \"indecent gestures\" toward Sarah Palin, U.S. Vice Presidential candidate.\n\nIn 2008, Indian Ulama from the world-renowned seminary of Deoband have categorically issued a fatwā against terrorism and mentioned that any sort of killing of innocent people or civilians is Haram or Forbidden. The fatwā also clarified that there is no Jihad in Kashmir or against India as freedom of religion is guaranteed by the state as any state that guarantees freedom of religion can not have Jihad sanctioned against it. This fatwā was reiterated in 2009 where Indian Home Minister P. Chidrambram hailed the move. The full text of the fatwā in English is available here\n\nDeoband Ulama in India have repeatedly mentioned that the Taliban government in Afghanistan was Un-Islamic. This was most recently reiterated at a convention in Karachi recently. \nThese include the idea of establishing shariah rule with force in the name of Jihad and levying of \"jizya\" on Sikh citizens of Pakistan, which was termed as nothing more than extortion by armed gangs.\nThe stand was explained by Maulana Abu Hassan Nadvi as below\n\nThis can't be called a war in the name of Islam. Even during a legitimate jihad, which is fought not by a rag-tag army of misguided youth but by the state against identified aggressors, Islam has set certain principles like you can't harm the old, sick, women and children. You can't attack any place of worship. But terrorists kill people indiscriminately. They are earning Allah's punishment.\n\nSuicide bombing in any form has also been declared haram and forbidden by Indian ulama. This stand is also supported by Saudi scholars such as Shaykh Muhammad Bin Saalih al-'Uthaymeen, who have issued fatawā declaring suicide bombings are haram and those who commit this act are not shaheed (martyrs).Shaykh Muhammad Bin Saalih al-'Uthaymeen\n\nControversial fatwas\n\nFatwas have the role of explaining religion and guiding the faithful in modern matters that were not previously tackled by scholars or specifically addressed by the Quran or the Hadith of Mohammed. Some fatwas stand out as controversial and often lead to hardship and violence.\n\nIn 2012, Sheikh Murgan Salem al-Gohary of Egypt, a former Taliban, issued a fatwa calling for \"the destruction of the Sphinx and the Giza Pyramids in Egypt\", because \"God ordered Prophet Mohammed to destroy idols.\" Egypt is host to thousands of ancient statues and drawings that mainstream Muslims have not been bothered by for the past 1400 years. These monuments are a major attraction to tourists and scientists interested in ancient Egyptian culture, and not worship. It is unclear why the pyramids were added to the fatwa because they are tombs of pharaohs and not statues or idols.\n\nIn 2012, Abdul-Azeez ibn Abdullaah Aal ash-Shaikh, the Grand Mufti of Saudi Arabia, issued a religious edict prohibiting contact and cooperation with foreign media outlets because they seek  to \"spread chaos and strife in Muslim lands.\" He added that contacting foreign media outlets to \"divulge the country’s secrets or address various matters\" was tantamount to \"treason and major crime.\" He said that \"It is not permissible and is considered betrayal and assistance to the enemies of Islam.\" Also, \"A believer has to help keeping security, that of his nation and community, and protecting his religion.\" This fatwā is vague and itself is in need of another explanatory fatwā. Foreign media appears to have been singled out because it is mostly free and does not conform to Saudi Arabian government censorship. The fatwā uses the extremely strong terms (i.e., \"haram\" or unlawful, \"treason,\" \"betrayal,\" and \"major crime\") for the simple act of contacting the press. This fatwa has the potential to endanger the lives of ordinary citizens and members of the media due to the connotation of its language and overall ambiguity. It also threatens the financial interests of legitimate global business. In democratic societies, journalism and the media play an indispensable role in educating the public and combating corruption.\n\nIn 2011-2012, Abdel-Bari Zamzami of Morocco issued a series of religious edicts that a man has the right to engage in sexual intercourse with his wife up to six hours after her death.[http://www.moroccoboard.com/news/5238 Necrophilia fatwa]  Despite recognizing that such an action is despicable in mainstream society, Zamzami persisted in backing his original fatwā, claiming marriage does not end in death. Zamzami also announced that it is against the religion to take to the streets after the King delivers a speech; this fatwā made the population, as well as the media, question his intentions.\n\nIn 2012, The Indonesian Ulema Council has issued an edict for Muslims not to wish Christians a happy Christmas. The edict said that wishing a happy Christmas was akin to confirming the \"misguided\" teachings of Christianity.\n\nIn 2013, the grand mufti in Kashmir issued a fatwā terming singing as un-Islamic, forcing Kashmir's only all-girls rock band to abandon it.\n\nIn 2014, the Supreme Court of India ruled that Sharia courts have no legal sanction and no one is bound to accept a fatwā in India.\n\nQuotes\n\n* \"In Sunni Islam, a fatwā is nothing more than an opinion. It is just a view of a mufti and is not binding in India.\" ― Maulana Mehmood Madani, president of the Jamaat-e-Ulema-e-Hind.\n* \"The current fashion for online fatwās has created an amazingly legalistic approach to Islam as scholars - some of whom have only a tenuous grip on reality - seek to regulate all aspects of life according to their own interpretation of the scriptures.\" ― Brian Whitaker, The Guardian\n* Excerpts from an interview given by Sheikh Abdul Mohsen Al-Obeikan, vice-minister of Justice of Saudi Arabia, to the Arabic daily Asharq al awsat on July 9, 2006, in which he discusses the legal value of a fatwā by the Islamic Fiqh Academy (IFA) on the subject of misyar marriage, which had been rendered by IFA on April 12, 2006:\n\nOther meanings\n\nSome fatwās have drawn a great deal of attention in Western media, giving rise to the term fatwā being used loosely for statements by non-Muslims that advocate an extreme religious or political position, and loosely or as slang for other sorts of decrees. Examples of such uses include the statements \"The pope issued a fatwā\"D. Bartles-Smith, Signs Of The Times, Number 26, 2007 and \"According to sources in today’s Tibetan resistance, the Chinese Communist 'fatwā' to silence Patterson has never been rescinded.\". Fatwa. http://en.wikipedia.org/?curid=11259."
  }
}
