{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11812",
  "eid" : "fe2e0d00-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778506192,
  "textBody" : "The Lockheed Martin F-35 Lightning II is a family of single-seat, single-engine, all-weather stealth multirole fighters. The fifth-generation combat aircraft is designed to perform ground attack and air superiority missions.  It has three main models: the F-35A conventional takeoff and landing (CTOL) variant, the F-35B short take-off and vertical-landing (STOVL) variant, and the F-35C carrier-based Catapult Assisted Take-Off But Arrested Recovery (CATOBAR) variant.  On 31 July 2015, the United States Marines declared ready for deployment the first squadron of F-35B fighters  after intensive testing. On 2 August 2016, the U.S. Air Force declared its first squadron of F-35A fighters combat-ready.\n\nThe F-35 descends from the X-35, the winning design of the Joint Strike Fighter (JSF) program.  An aerospace industry team led by Lockheed Martin designed and manufactures it.  Other major F-35 industry partners include Northrop Grumman, Pratt & Whitney and BAE Systems.  The F-35 first flew on 15 December 2006. The United States plans to buy 2,663 aircraft.  Its variants are to provide the bulk of the crewed tactical airpower of the U.S. Air Force, Navy and the Marine Corps over the coming decades. Deliveries of the F-35 for the U.S. military are scheduled until 2037 with a projected service life up to 2070.[https://www.flightglobal.com/news/articles/lockheed-f-35-service-life-extended-to-2070-423536/ Lockheed F-35 service life extended to 2070] – Flightglobal.com, 25 March 2016\n\nThe United States principally funds the F-35 JSF development, with additional funding from partners. The partner nations are either NATO members or close U.S. allies. The United Kingdom, Italy, Australia, Canada, Norway, Denmark, the Netherlands, and Turkey are part of the active development program;[http://www.lockheedmartin.com/us/products/f35/global-partnerships.html \"F-35 Global Partnerships\"].  Lockheed Martin. Retrieved: 31 October 2012.Dudley, Richard. [http://defense-update.com/20120305_program-partners-confirm-support-for-f-35-joint-strike-fighter.html \"Program Partners Confirm Support for F-35 Joint Strike Fighter\"]. Defence Update, 5 March 2012. Retrieved: 18 March 2012. several additional countries have ordered, or are considering ordering, the F-35.\n\nThe program is the most expensive military weapons system in history, and has been much criticized inside and outside government, in the U.S. and in allied countries.  Critics argue that the plane is \"plagued with design flaws\", with many blaming the procurement process in which Lockheed was allowed \"to design, test, and produce the F-35 all at the same time, instead of… [identifying and fixing] defects before firing up its production line\". By 2014, the program was \"$163 billion over budget [and] seven years behind schedule\". Critics also contend that the program's high sunk costs and political momentum make it \"too big to kill\".\n\nDevelopment\n\nF-35 development started in 1992 with the origins of the Joint Strike Fighter program and is set to culminate in full production in 2018.[http://www.westdef.com/presentations/2013presentations/Keith_Knotts.pdf F-35 Program Information – Non Export Controlled Information] Keith P. Knotts, 9 July 2013 The X-35 first flew on 24 October 2000 and the F-35A on 15 December 2006. The F-35 was developed to replace most US fighter jets with variants of one design common to all branches of the military. It was developed in cooperation with a number of foreign partners, and unlike the F-22 Raptor, intended to be available for export. Three variants were designed: the F-35A (conventional take off and landing, CTOL), the F-35B (short-take off and vertical-landing, STOVL), and the F-35C (carrier-based CATOBAR). Despite being intended to share most of their parts to reduce costs and improve maintenance logistics, by 2017 the design commonality was only 20%.. The program received considerable criticism for cost overruns during development and for the total projected cost of the program over the lifetime of the jets. By 2017 the program was expected over its lifetime (until 2070) to cost $406.5 billion for acquisition of the jets and $1.1 trillion for operations and maintenance. A number of design deficiencies were alleged, such as carrying a small internal payload, inferior performance to the aircraft being replaced particularly the F-16, and the lack of safety in relying on a single engine, and flaws were noted such as vulnerability of the fuel tank to fire and the propensity for transonic roll-off (TRO or \"wing drop\"). The possible obsolescence of stealth technology was also criticized.\n\nDesign\n\nOverview\n\nThe F-35 closely resembles a smaller, single engine Lockheed Martin F-22 Raptor, drawing design elements from its twin-engine sibling. The exhaust duct design was inspired by the General Dynamics Model 200, proposed for a 1972 supersonic VTOL fighter requirement for the Sea Control Ship.\"Vertiflight\". Journal of the American Helicopter Society, January 2004. Although several experimental designs have been developed since the 1960s, such as the unsuccessful Rockwell XFV-12, the F-35B is to be the first operational supersonic, STOVL stealth fighter.Kent, John R. and Chris Geisel. \"F-35 STOVL supersonic\". lockheedmartin.com. Retrieved 16 November 2010.\n\nAcquisition deputy to the assistant secretary of the Air Force, Lt. Gen. Mark D. \"Shack\" Shackelford has said that the F-35 is designed to be America's \"premier surface-to-air missile killer and is uniquely equipped for this mission with cutting edge processing power, synthetic aperture radar integration techniques, and advanced target recognition\".Johns, Darnell Sharkleford. \"Air Force presentation to House Subcommittee on Air and Land Forces\". armedservices.house.gov, 20 May 2009, p. 10.Amaani, USAF Tech. Sgt. Lyle. [http://www.af.mil/News/ArticleDisplay/tabid/223/Article/120743/air-force-takes-combat-air-acquisitions-priorities-to-hill.aspx \"Air Force takes combat air acquisitions priorities to Hill\"]. U.S. Air Force, 3 April 2009. Lockheed Martin states the F-35 is intended to have close- and long-range air-to-air capability second only to that of the F-22 Raptor.[https://web.archive.org/web/20100724021638/http://www.lockheedmartin.com/products/f35/f-35-capabilities.html \"Capabilities\". (archived version)] Lockheed Martin. Retrieved 24 July 2010. Lockheed Martin has said that the F-35 has the advantage over the F-22 in basing flexibility and \"advanced sensors and information fusion\".[http://www.f35.com/the-f-35/faqs.aspx \"LockMart F-35 FAQ\"]. Lockheed Martin, 2011. Lockheed Martin has suggested that the F-35 could replace the USAF's F-15C/D fighters in the air superiority role and the F-15E Strike Eagle in the ground attack role.Trimble, Stephen. [http://www.flightglobal.com/articles/2010/02/04/338045/lockheed-martin-sees-f-35a-replacing-usaf-air-superiority.html \"Lockheed Martin sees F-35A replacing USAF air superiority F-15C/Ds\"].  Flight International, 4 February 2010. Retrieved 2 March 2010.\n\nSome improvements over current-generation fighter aircraft are:\n* Durable, low-maintenance stealth technology, using structural fiber mat instead of the high-maintenance coatings of legacy stealth platforms;\n* Integrated avionics and sensor fusion that combine information from off- and on-board sensors to increase the pilot's situational awareness and improve target identification and weapon delivery, and to relay information quickly to other command and control (C2) nodesL3 (March 2011), [http://www2.l-3com.com/displays/pdfs/redesign/ICP(2011)_LR.pdf Open System Architecture (OSA) Secure Processing]\n* High speed data networking including IEEE 1394bPhilips, E. H. \"The Electric Jet\". Aviation Week & Space Technology, 5 February 2007. and Fibre Channel.Parker, Ian. [http://www.aviationtoday.com/av/categories/military/11667.html \"Reducing Risk on the Joint Strike Fighter\"]. Avionics Magazine, Access Intelligence, LLC, 1 June 2007. Retrieved 8 June 2007. (Fibre Channel is also used on Boeing's Super Hornet.[http://www.boeing.com/defense-space/military/fa18ef/index.htm \"F/A-18E/F Super Hornet\"]. Boeing.)\n* The Autonomic Logistics Global Sustainment (ALGS), Autonomic Logistics Information System (ALIS), and Computerized maintenance management system (CMMS) are to help ensure the aircraft can remain operational with minimal maintenance manpower.Giese, Jack. [http://www.lockheedmartin.com/us/news/press-releases/2009/october/F-35BringsUnique5thGenera.html \"F-35 Brings Unique 5th Generation Capabilities\"]. lockheedmartin.com, 23 October 2009. The Pentagon has moved to open up the competitive bidding by other companies.Shalal-Esa, Andrea. [http://www.chicagotribune.com/news/sns-rt-us-lockheed-fighterbre88r1k1-20120928,0,519683.story \"Pentagon seeks competition for sustainment of Lockheed F-35\"]. Reuters, 28 September 2012. This was after Lockheed Martin stated that instead of costing twenty percent less than the F-16 per flight hour, the F-35 would actually cost twelve percent more.Sweetman, Bill. [http://www.aviationweek.com/Blogs.aspx?plckBlogIdBlog:27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostId\nBlog%3A27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3A7d4840f7-616f-4279-a3ae-ece678980c57 \"Wrongheaded? Really?\"]  Aviation Week, 18 October 2012. Though the ALGS is intended to reduce maintenance costs, the company disagrees with including the cost of this system in the aircraft ownership calculations.[http://www.aviationweek.com/Blogs.aspx?plckBlogIdBlog:27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostId\nBlog%3a27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3a295628f9-5afc-45a1-a7e9-d8b429e5ab99 \"F-35 Cost Per Flying Hour: A Tale of Two Numbers\"].  The USMC have implemented a workaround for a cyber vulnerability in the system.Majumdar, Dave. [http://www.flightglobal.com/news/articles/usmc-finds-workaround-for-cyber-vulnerability-on-f-35-logistics-system-379272/ \"USMC finds workaround for cyber vulnerability on F-35 logistics system\"]. Flight International, 20 November 2012. The ALIS system currently requires a shipping container load of servers to run, but Lockheed is working on a more portable version to support the Marines' expeditionary operations.\n* Electro-hydrostatic actuators run by a power-by-wire flight-control system.Trimble, Stephen. [https://www.flightglobal.com/news/articles/farnborough-lockheed-encouraged-by-pace-of-f-35-tes-343782/ \"Farnborough: Lockheed encouraged by pace of F-35 testing\"]. Flight International, 12 July 2010. Retrieved 22 July 2010.\n* A modern and updated flight simulator, which may be used for a greater fraction of pilot training in order to reduce the costly flight hours of the actual aircraft.\n* Lightweight, powerful Lithium-ion batteries to provide power to run the control surfaces in an emergency.\n\nStructural composites in the F-35 are 35% of the airframe weight (up from 25% in the F-22). The majority of these are bismaleimide (BMI) and composite epoxy material.[http://www.onlineamd.com/aerospace-manufacturing-design-Vector-Composites-Quicksteps-amd-051710.aspx \"Contract Awarded To Validate Process For JSF\"]. onlineamd.com,  17 May 2010. Retrieved 22 July 2010. The F-35 will be the first mass-produced aircraft to include structural nanocomposites, namely carbon nanotube reinforced epoxy.Trimble, Stephen. [http://www.flightglobal.com/articles/2011/05/26/357223/lockheed-martin-reveals-f-35-to-feature-nanocomposite.html \"Lockheed Martin reveals F-35 to feature nanocomposite structures\"].  Flight International, 26 May 2011. Experience of the F-22's problems with corrosion led to the F-35 using a gap filler that causes less galvanic corrosion to the airframe's skin, designed with fewer gaps requiring filler and implementing better drainage.Edwards, Jack E. [http://www.gao.gov/new.items/d11171r.pdf \"Defense Management: DOD Needs to Monitor and Assess Corrective Actions Resulting from Its Corrosion Study of the F-35 Joint Strike Fighter\"]. United States Government Accountability Office, Washington, DC, 16 December 2010. The relatively short 35-foot wingspan of the A and B variants is set by the F-35B's requirement to fit inside the Navy's current amphibious assault ship parking areaRyberg, Eric S. \"[http://www.dtic.mil/dtic/tr/fulltext/u2/a399988.pdf The Influence of Ship Configuration on the Design of the Joint Strike Fighter]\", p. 5. Naval Surface Warfare Center Dahlgren Division, 26 February 2002. Accessed: 1 December 2013. and elevators; the F-35C's longer wing is considered to be more fuel efficient.\n\nA United States Navy study found that the F-35 will cost 30 to 40 percent more to maintain than current jet fighters;Clark, Colin. [http://www.dodbuzz.com/2011/01/27/af-worries-jsf-costs-may-soar/ \"AF Worries JSF Costs May Soar\"]. DoD Buzz 27 January 2011. not accounting for inflation over the F-35's operational lifetime. A Pentagon study concluded a $1 trillion maintenance cost for the entire fleet over its lifespan, not accounting for inflation.Capaccio, Tony. [http://www.businessweek.com/news/2011-04-21/lockheed-martin-f-35-operating-costs-may-reach-1-trillion.html \"Lockheed Martin F-35 Operating Costs May Reach $1 Trillion\"].  Bloomberg News, 21 April 2011. The F-35 program office found that as of January 2014, costs for the F-35 fleet over a 53-year life cycle was $857 billion.  Costs for the fighter have been dropping and accounted for the 22 percent life cycle drop since 2010. Lockheed stated that by 2019, pricing for the fifth-generation aircraft will be less than fourth-generation fighters.  An F-35A in 2019 is expected to cost $85 million per unit complete with engines and full mission systems, inflation adjusted from $75 million in December 2013.\n\nEngines\n\nThe Pratt & Whitney F135 powers the F-35. An alternative engine, the General Electric/Rolls-Royce F136, was being developed until it was cancelled by its manufacturers in December 2011 for lack of funding from the Pentagon.Trimble, Stephen. [http://www.flightglobal.com/articles/2009/06/11/327771/rolls-royce-f136-survival-is-key-for-major-f-35-engine.html \"Rolls-Royce: F136 survival is key for major F-35 engine upgrade\"].  Flight International, 11 June 2009.[https://archive.is/20120729014307/http://www.defensenews.com/story.php?i8450963&c\nAME&sAIR \"GE, Rolls Royce Stop Funding F-35 Alt Engine\"]. Defense News, 4 December 2011. The F135 and F136 engines are not designed to supercruise.[http://www.jsf.mil/contact/con_faqs.htm \"Frequently Asked Questions about JSF\"]. JSF. Retrieved 6 April 2010. However, the F-35 can briefly fly at Mach 1.2 for 150 miles without the use of an afterburner. The F135 is the second (radar) stealthy afterburning jet engine. Like the Pratt & Whitney F119 from which it was derived, the F135 has suffered afterburner pressure pulsations, or 'screech' at low altitude and high speed.Warwick, Graham. [http://www.aviationweek.com/aw/blogs/defense/index.jsp?plckController\nBlog&plckBlogPageBlogViewPosto&newspaperUserId\n27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostIdBlog%3a27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3a261f21c4-19ea-40e0-a756-ed0491972939&plckScript\nblogScript&plckElementIdblogDest \"Screech, the F135 and the JSF Engine War\"]. Aviation Week, 17 March 2011. The F-35 has a maximum speed of over Mach 1.6. With a maximum takeoff weight of 60,000 lb (27,000 kg), the Lightning II is considerably heavier than the lightweight fighters it replaces.\n\nThe STOVL F-35B is outfitted with the Rolls-Royce LiftSystem, designed by Lockheed Martin and developed by Rolls-Royce. This system more resembles the German VJ 101D/E than the preceding STOVL Harrier Jump Jet and the Rolls-Royce Pegasus engine.\"Swivel nozzle VJ101D and VJ101E\". Vstol.org, 20 June 2009.Hirschberg, Mike. \"[http://www.robertcmason.com/textdocs/GermanVSTOLFighters.pdf \"V/STOL Fighter Programs in Germany: 1956–1975\"], p. 50. International Powered Lift Conference, 1 November 2000. Retrieved 3 October 2012.[http://www.harrier.org.uk/technical/How_Hovers.htm \"How the Harrier hovers\"] . harrier.org. Retrieved 16 November 2010. The Lift System is composed of a lift fan, drive shaft, two roll posts and a \"Three Bearing Swivel Module\" (3BSM).[http://www.rolls-royce.com/defence/products/combat_jets/rr_liftsystem.jsp \"LiftSystem\"]. Rolls-Royce. Retrieved 23 November 2009. The 3BSM is a thrust vectoring nozzle which allows the main engine exhaust to be deflected downward at the tail of the aircraft. The lift fan is near the front of the aircraft and provides a counterbalancing thrust using two counter-rotating blisks.Zolfagharifard, Ellie. [http://www.theengineer.co.uk/in-depth/rolls-royces-liftsystem-for-the-joint-strike-fighter/1008008.article \"Rolls-Royce's LiftSystem for the Joint Strike Fighter\"] The Engineer, 28 March 2011. It is powered by the engine's low-pressure (LP) turbine via a drive shaft and gearbox. Roll control during slow flight is achieved by diverting unheated engine bypass air through wing-mounted thrust nozzles called Roll Posts.Kjelgaard, Chris. [http://www.space.com/businesstechnology/071221-how-f-35b-stovl-propulsion-system-works.html \"From Supersonic to Hover: How the F-35 Flies\"]. Space, 21 December 2007. Retrieved 18 October 2010.Hutchinson, John. [http://www.ingenia.org.uk/ingenia/issues/issue20/hutchinson.pdf \"Going Vertical: Developing a STOVL system\"]. ingenia.org.uk. Retrieved 23 November 2009.\n\nF136 funding came at the expense of other program elements, impacting on unit costs.Warwick, Graham. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channeldefense&id\nnews/SECOND052909.xml \"Second Engine Could Cut F-35 Production\"]. Aviation Week. Retrieved 6 April 2010.  The F136 team stated their engine had a greater temperature margin, potentially critical for VTOL operations in hot, high altitude conditions.\"GE Rolls-Royce Fighter Engine Team completes study for Netherlands\". rolls-royce.com. Retrieved 23 November 2009. Pratt & Whitney tested higher thrust versions of the F135, partly in response to GE's statements that the F136 is capable of producing more thrust than the 43000 lbf of early F135s. In testing, the F135 has demonstrated a maximum thrust of over 50000 lbf;[https://web.archive.org/web/20101226060817/http://www.aviationweek.com/aw/generic/story_generic.jsp?channel\ndefense&idnews%2Fasd%2F2010%2F08%2F27%2F01.xml&headline\nPratt \"Pratt Raises Stakes In JSF Engine Battle\"]. Aviation Week, 27 August 2010. Retrieved 25 November 2010. making it the most powerful engine ever installed in a fighter aircraft as of 2010.\"Lockheed Martin F-35 Joint Strike Fighter Succeeds In First Vertical Landing\". lockheedmartin.com, Press Release, 18 March 2010. It is much heavier than previous fighter engines; the Heavy Underway Replenishment system needed to transfer the F135 between ships is an unfunded USN requirement. Thermoelectric-powered sensors monitor turbine bearing health.Swedberg, Claire. [http://www.rfidjournal.com/article/articleview/8478/1/1/ \"Energy-Harvesting Sensors to Monitor Health of Jet Engines\"]. RFID Journal, 31 May 2011.  At the end of May 2017 Pratt and Whitney announced the F135 Growth Option 1 had finished testing and was available for production.  The upgrade requires the changing of the power module on older engines and can be seamlessly inserted into future production engines at a minimal increase in unit cost and no impact to delivery schedule.  The Growth Option 1 offers a improvement of 6–10% thrust across the F-35 flight envelope while also getting a 5–6% fuel burn reduction.\n\nArmament\n\nThe F-35A is armed with a GAU-22/A, a four-barrel version of the 25 mm GAU-12 Equalizer cannon.[http://www.gdatp.com/Products/Gun_Systems/Aircraft/F-35.asp \"F-35 gun system\"] , [http://www.gdatp.com/files/PDF/A118_GAU22.pdf \"GAU-22/A\"] . General Dynamics Armament and Technical Products. Retrieved 7 April 2011. The cannon is mounted internally with 182 rounds for the F-35A or in an external pod with 220 rounds for the F-35B and F-35C;[http://www.jsf.mil/downloads/mediakits/7764.zip \"F-35 Joint Strike Fighter Media Kit Statistics\"]. JSF.mil August 2004.Keijsper 2007, p. 233. the gun pod has stealth features. Software updates to enable operational firing of the cannon are expected to be completed by 2018.  The F-35 has two internal weapons bays, and external hardpoints for mounting up to four underwing pylons and two near wingtip pylons. The two outer hardpoints can carry pylons for the AIM-9X Sidewinder and AIM-132 ASRAAM short-range air-to-air missiles (AAM) only.Hewson, Robert. [http://www.janes.com/products/janes/defence-security-report.aspx?ID\n1065928225 \"UK changes JSF configuration for ASRAAM\"]. Jane's, 4 March 2008.  The other pylons can carry the AIM-120 AMRAAM BVR AAM, AGM-158 Joint Air to Surface Stand-off Missile (JASSM) cruise missile, and guided bombs. The external pylons can carry missiles, bombs, and external fuel tanks at the expense of increased radar cross-section, and thus reduced stealth.Keijsper 2007, pp. 220, 239.\n\nThere are a total of four weapons stations between the two internal bays. Two of these can carry air-to-surface missiles or bombs up to 2000 lb each in the A and C models, or air-to-surface missiles or bombs up to 1000 lb each in the B model; the other two stations are for smaller weapons such as air-to-air missiles.Davis, Brigadier General Charles R. [http://www.jsf.mil/downloads/documents/AFA_Conf_-_JSF_Program_Brief_-_26_Sept_06.pdf \"F-35 Program Brief\"]. USAF, 26 September 2006.[http://es.is.itt.com/JSF%20Suite.htm \"JSF Suite: BRU-67, BRU-68, LAU-147 – Carriage Systems: Pneumatic Actuated, Single Carriage\"]. es.is.itt.com, 2009. The weapon bays can carry AIM-120 AMRAAM, AIM-132 ASRAAM, the Joint Direct Attack Munition (JDAM), Paveway series of bombs, the Joint Standoff Weapon (JSOW), Brimstone anti-tank missiles, and cluster munitions (Wind Corrected Munitions Dispenser).  An air-to-air missile load of eight AIM-120s and two AIM-9s is possible using internal and external weapons stations; a configuration of six 2000 lb bombs, two AIM-120s and two AIM-9s can also be arranged.Digger, Davis. [http://www.dtic.mil/ndia/2007targets/Day1/Davisday1.pdf \"JSF Range & Airspace Requirements\"] . Headquarters Air Combat Command, Defense Technical Information Center, 30 October 2007.  The Terma A/S multi-mission pod (MMP) could be used for different equipment and purposes, such as electronic warfare, aerial reconnaissance, or rear-facing tactical radar.Donald, David. [http://www.ainonline.com/aviation-news/defense/2012-07-11/terma-highlights-f-35-multi-mission-pod \"Terma Highlights F-35 Multi-Mission Pod\"]. AINonline, 11 July 2012. The British Ministry of Defence plan to fire the Select Precision Effects at Range (SPEAR) Capability 3 missile from the internal bays of the F-35B, with four missiles per bay.\n\nLockheed Martin states that the weapons load can be configured as all-air-to-ground or all-air-to-air, and has suggested that a Block 5 version will carry three weapons per bay instead of two, replacing the heavy bomb with two smaller weapons such as AIM-120 AMRAAM air-to-air missiles.Lake 2010, pp. 37–45. Upgrades are to allow each weapons bay to carry four GBU-39 Small Diameter Bombs (SDB) for A and C models, or three in F-35B.[https://web.archive.org/web/20090223163759/http://www.lockheedmartin.com/products/f35/f-35-variants/f-35b-stovl-variant.html \"F-35B STOVL Variant\"]. Lockheed Martin. Retrieved 25 November 2010. Another option is four GBU-53/B Small Diameter Bomb IIs in each bay on all F-35 variants.[http://www.defense-update.com/products/s/sdb_2_25082010.html \"Small Diameter Bomb II – GBU-53/B\"]. Defense Update. Retrieved 28 August 2010. The F-35A has been outfitted with four SDB II bombs and an AMRAAM missile to test adequate bay door clearance, as well as the C-model, but the STOVL F-35B will not be able to carry the required load of four SDB IIs in each weapons bay upon reaching IOC because of weight and dimension constraints; F-35B bay changes are to be incorporated to increase SDB II loadout around 2022 in line with the Block 4 weapons suite.[http://insidedefense.com/share/167668 F-35B Internal Weapons Bay Can't Fit Required Load Of Small Diameter Bomb IIs] – Insidedefense.com, 25 February 2015 The Meteor air-to-air missile may be adapted for the F-35, a modified Meteor with smaller tailfins for the F-35 was revealed in September 2010; plans call for the carriage of four Meteors internally.Trimble, Stephen. [http://www.flightglobal.com/articles/2010/09/17/347416/picture-mbda-reveals-clipped-fin-meteor-for-f-35.html \"MBDA reveals clipped-fin Meteor for F-35\"].  Flight International, 7 November 2010. The United Kingdom planned to use up to four AIM-132 ASRAAM missiles internally, later plans call for the carriage of two internal and two external ASRAAMs.[http://www.f-16.net/news_article2762.html \"F-35 Lightning II News: ASRAAM Config Change For F-35\"]. f-16.net, 4 March 2008. The external ASRAAMs are planned to be carried on \"stealthy\" pylons; the missile allows attacks to slightly beyond visual range without employing radar.Tran, Pierre. \"MBDA Shows Off ASRAAM\". Defense News, 22 February 2008.\n\nNorway and Australia are funding an adaptation of the Naval Strike Missile (NSM) for the F-35. Under the designation Joint Strike Missile (JSM), it is to be the only cruise missile to fit the F-35's internal bays; according to studies two JSMs can be carried internally with an additional four externally.[http://www.kongsberg.com/en/KOG/News/2009/June/0906JSMAndLockheedMartin.aspx \"Important cooperative agreement with Lockheed Martin\"]. Kongsberg Defence & Aerospace, 9 June 2009. The F-35 is expected to take on the Wild Weasel mission, though there are no planned anti-radiation missiles for internal carriage.Trimble, Stephen. [http://www.flightglobal.com/articles/2010/11/04/349306/raytheon-gets-darpa-boost-for-amraam-harm-replacement.html \"Raytheon gets DARPA boost for AMRAAM, HARM replacement\"].  Flight International, 4 November 2010. The B61 nuclear bomb was initially scheduled for deployment in 2017;Reed, John. [http://www.dodbuzz.com/2011/04/06/minuteman-iii-follow-on-being-eyed-nukes-for-jsf-delayed/ \"Minuteman III Follow-On Being Eyed, Nukes for JSF Delayed\"]. DoD Buzz, 6 April 2011. as of 2012 it was expected to be in the early 2020s,Muradian, Vego. [https://web.archive.org/web/20121015151001/http://www.defensenewstv.com/video.php?bctid1897052351001 \"The Future of the U.S. Nuclear Enterprise\"]. Defense News, 14 October 2012. and in 2014 Congress moved to cut funding for the needed weapons integration work. Norton A. Schwartz agreed with the move and said that \"F-35 investment dollars should realign to the long-range strike bomber\". NATO partners who are buying the F-35 but cannot afford to make them dual-capable want the USAF to fund the conversions to allow their Lightning IIs to carry thermonuclear weapons. The USAF is trying to convince NATO partners who can afford the conversions to contribute to funding for those that cannot. The F-35 Block 4B will be able to carry two B61 nuclear bombs internally by 2024.\n\nAccording to reports in 2002, solid-state lasers were being developed as optional weapons for the F-35.Fulghum, David A. [https://web.archive.org/web/20040626050316/http://www.aviationnow.com/content/publication/awst/20020708/aw32.htm \"Lasers being developed for F-35 and AC-130\"]. Aviation Week and Space Technology, 8 July 2002.Morris, Jefferson. [https://web.archive.org/web/20040604124353/http://www.aviationnow.com/avnow/news/channel_military.jsp?viewstory&id\nnews%2Fmasd0926.xml \"Keeping cool a big challenge for JSF laser, Lockheed Martin says\"]. Aerospace Daily, 26 September 2002.Fulghum, David A. [https://web.archive.org/web/20040613094437/http://www.aviationnow.com/content/publication/awst/20020722/aw173.htm \"Lasers, HPM weapons near operational status\"]. Aviation Week and Space Technology, 22 July 2002. Lockheed is studying integrating a fiber laser onto the aircraft that uses spectral beam combining to channel energy from a stack of individual laser modules into a single, high-power beam, which can be scaled up or down for various levels of effects.  Adding a laser would give the F-35 the ability to essentially burn missiles and other aircraft out of the sky.[https://www.flightglobal.com/news/articles/lockheed-considering-laser-weapon-concepts-for-f-35-417416/ Lockheed considering laser weapon concepts for F-35] – Flightglobal.com, 5 October 2015 The F-35 is also one of the target platforms for the High Speed Strike Weapon if hypersonic missile development is successful.\n\nThe Air Force plans to use the F-35A to primarily take up the close air support (CAS) mission in contested environments.  Amid criticism that the aircraft is not well suited for the role compared to a dedicated attack platform, Air Force chief of staff Mark Welsh is putting focus on weapons for the F-35 to employ on CAS sorties including guided rockets, fragmentation rockets that would shatter into individual projectiles before impact, and lighter, smaller ammunition in higher capacity gun pods.[http://www.flightglobal.com/news/articles/usaf-chief-keeps-sights-on-close-air-support-mission-409070/ USAF chief keeps sights on close air support mission] – Flightglobal.com, 15 February 2015 Fragmentary rocket warheads would have greater effects than cannon shells fired from a gun because a single rocket would create a \"thousand-round burst\", delivering more projectiles than a strafing run could.  Other weapons could take advantage of the aircraft's helmet-mounted cueing system to aim rather than needing to point the nose at a target.[http://aviationweek.com/defense/long-road-ahead-possible-10-follow Long Road Ahead For Possible A-10 Follow-On] – Aviationweek.com, 24 March 2015 Institute for the Study of War's Christopher Harmer has questioned the use of such an expensive aircraft for CAS.\n\nStealth and signatures\n\nRadar \n\nThe F-35 has been designed to have a low radar cross-section that is primarily due to the shape of the aircraft and the use of stealthy, radar-absorbent materials in its construction, including fiber-mat.Butler, Amy. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channel\ndefense&idnews/asd/2010/05/17/10.xml&headline\nNew%20Stealth%20Concept%20Could%20Affect%20JSF%20Cost \"New Stealth Concept Could Affect JSF Cost\"]. Aviation Week, 17 May 2010. Retrieved 5 June 2010.  Unlike the previous generation of fighters, the F-35 was designed for very-low-observable characteristics.[http://www.globalsecurity.org/military/systems/aircraft/f-35-design.htm \"F-35 Joint Strike Fighter (JSF) Lightning II\"]. GlobalSecurity.org. Retrieved 16 November 2010. Besides radar stealth measures, the F-35 incorporates infrared signature and visual signature reduction measures.[http://www.dote.osd.mil/pub/reports/FY2000/airforce/00jsf.html \"USAF FY00 activity on the JSF\"].  U.S. Director, Operational Test & Evaluation. Retrieved: 17 l 2012.[http://www.regjeringen.no/upload/FD/Temadokumenter/JSF_RBI-svar.pdf \"F-35 Norwegian Executive Summary\"].  Lockheed Martin, April 2008.\n\nThe Fighter Teen Series (F-14, F-15, F-16, F/A-18) carried large external fuel tanks, but to avoid negating its stealth characteristics the F-35 must fly most missions without them. Unlike the F-16 and F/A-18, the F-35 lacks leading edge extensions and instead uses stealth-friendly chines for vortex lift in the same fashion as the SR-71 Blackbird.Bolsøy, Bjørnar. [http://www.f-16.net/news_article3837.html \"F-35 Lightning II status and future prospects\"]. f-16.net, 17 September 2009. Retrieved 23 November 2009. The small bumps just forward of the engine air intakes form part of the diverterless supersonic inlet (DSI) which is a simpler, lighter means to ensure high-quality airflow to the engine over a wide range of conditions. These inlets also crucially improve the aircraft's very-low-observable characteristics (by eliminating radar reflections between the diverter and the aircraft's skin).Hehs, Eric. [http://www.codeonemagazine.com/article.html?item_id\n58 \"JSF Diverterless Supersonic Inlet\"]. Code One Magazine. Retrieved 28 December 2012. Additionally, the \"bump\" surface reduces the engine's exposure to radar, significantly reducing a strong source of radar reflection[http://aviationintel.com/2012/10/22/fast-history-lockheeds-diverterless-supersonic-inlet-testbed-f-16/ \"Fast History: Lockheed's Diverterless Supersonic Inlet Testbed F-16\"]  aviationintel.com, 13 January 2013 because they provide an additional shielding of engine fans against radar waves. The Y-duct type air intake ramps also help in reducing radar cross-section (RCS), because the intakes run parallel and not directly into the engine fans.\n\nThe F-35's radar-absorbent materials are designed to be more durable and less maintenance-intensive than those of its predecessors. At optimal frequencies, the F-35 compares favorably to the F-22 in stealth, according to General Mike Hostage, Commander of the Air Combat Command.Clark, Colin. [http://breakingdefense.com/2014/06/gen-mike-hostage-on-the-f-35-no-growlers-needed-when-war-starts/3/] Breaking Defense, 6 June 2014. Like other stealth fighters, however, the F-35 is more susceptible to detection by low-frequency radars because of the Rayleigh scattering resulting from the aircraft's physical size. However, such radars are also conspicuous, susceptible to clutter, and have low precision.Ralston, J; Heagy, J; et al. [http://www.dtic.mil/dtic/tr/fulltext/u2/a359931.pdf \"Environmental/Noise Effects on UHF/VHF UWB SAR\".] dtic.mil, September 1998. Retrieved: 2 January 2015.Plopsky, Guy and Fabrizio Bozzato. [http://thediplomat.com/2014/08/the-f-35-vs-the-vhf-threat/ \"The F-35 vs. The VHF Threat\"]. The Diplomat, 21 August 2014. Although fighter-sized stealth aircraft could be detected by low-frequency radar, missile lock and targeting sensors primarily operate in the X-band, which F-35 RCS reduction is made for, so they cannot engage unless at close range.[http://defense-update.com/20150614_f35_beyond_stealth.html#.VYisUsIw8dU F-35 – Beyond Stealth] – Defense-Update.com, 14 June 2015 Because the aircraft's shape is important to the RCS, special care must be taken to match the \"boilerplate\" during production.Capaccio, Tony. [https://www.bloomberg.com/news/2011-05-04/lockheed-martin-s-f-35-fighter-jet-passes-initial-stealth-hurdle.html \"Lockheed Martin’s F-35 Fighter Jet Passes Initial Stealth Hurdle\"]. Bloomberg News, 4 May 2011. Ground crews require Repair Verification Radar (RVR) test sets to verify the RCS after performing repairs, which is not a concern for non-stealth aircraft.Brewer, Jeffrey and Shawn Meadows. [http://www.dtic.mil/cgi-bin/GetTRDoc?LocationU2&doc\nGetTRDoc.pdf&AD=ADA529057 \"Survivability of the Next Strike Fighter\", p. 23.] Aircraft Survivability: Susceptibility Reduction via Joint Aircraft Survivability Program Office (JASPO), Summer 2006.\n\nAcoustics \n\nIn 2008, the Air Force revealed that the F-35 would be about twice as loud as the McDonnell Douglas F-15 Eagle at takeoff and up to four times as loud during landing.Alaimo, Carol Ann. [http://azstarnet.com/news/local/article_b8e6b612-1751-5554-8819-166f110f0f24.html \"Noisy F-35 Still Without A Home\"]. Arizona Daily Star, 30 November 2008. Retrieved 23 November 2009. Residents near Luke Air Force Base, Arizona, and Eglin Air Force Base, Florida, possible F-35 bases, requested environmental impact studies be conducted regarding the F-35's noise levels. In 2009, the city of Valparaiso, Florida, adjacent to Eglin AFB, threatened to sue over the impending F-35 arrival; this lawsuit was settled in March 2010.Moore, Mona. \"Val-P to sue the Air Force\". Northwest Florida Daily News, 19 February 2009, Volume 63, Number 20, p. A1.Barlow, Kari C. [http://www.thedestinlog.com/news/legal-28112-nwfdn-fees-okaloosa.html \"Val-p wants Okaloosa to reimburse F-35 legal fees\"]. thedestinlog.com, 16 April 2010. Nicholson, Brendan. [http://www.theaustralian.com.au/national-affairs/noise-triggers-legal-bid-to-down-jet-fighter/story-fn59niix-1226037459254 \"Noise triggers legal bid to down jet fighter\"]. The Australian, 12 April 2011. In 2009, testing reportedly revealed the F-35 to be: \"only about as noisy as an F-16 fitted with a Pratt & Whitney F100-PW-200 engine ... quieter than the Lockheed Martin F-22 Raptor and the Boeing F/A-18E/F Super Hornet\".Perrett, Bradley. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channeldefense&id\nnews/F35-031209.xml \"F-35 May Need Thermal Management Changes\"]. Aviation Week, 12 March 2009. Retrieved 23 November 2009.  An acoustics study by Lockheed Martin and the Air Force found F-35's noise levels to be comparable to the F-22 and F/A-18E/F.[https://docs.google.com/viewer?av&q\ncache:0yIuRIMUDwcJ:www.f-16.net/f-16_forum_download-id-11481.html+F-35+acoustics+test&hlen&gl\nus&pidbl&srcid\nADGEESgfOwRZ9Cjk22IknVc6me97wPUsleYuw0aMTdia4Djkgx1C9hhiMOuSU_O7s1I8aaIh_NhSvO0kZlrK_05iNQvB_iCtyQWQ7d4uPEYz4oCoC6efEnxiqD1xkpsZ952kVNoAxgyE&sig=AHIEtbTRsgZXOeGUg90opGYn6e-msBU02w \"Joint Communications Release, JSF Program Office & Lockheed Martin. Subject: F-35 Acoustics Based on Edwards AFB Acoustics, Test\"]. JSF Program Office & Lockheed Martin, April 2009. Retrieved 15 January 2011. A USAF environmental impact study found that replacing F-16s with F-35s at Tucson International Airport would subject more than 21 times as many residents to extreme noise levels.Alaimo, Carol Ann. [http://azstarnet.com/news/local/noisy-f--could-affect-thousands-in-tucson-study-finds/article_38ad2ab4-c151-5ee4-ae7c-9bc81c537a54.html \"Noisy F-35 could affect thousands, study finds\"]. Arizona Daily Star, 13 June 2012. The USN will need to redesign hearing protection for sailors to protect against the \"thundering 152 decibels\" of the F-35. The Joint Strike Fighter program office found in October 2014 that the F-35B's take-off noise was only two decibels higher than a Super Hornet, a virtually indistinguishable difference to the human ear, and is even 10 decibels quieter when flying formations or landing.[http://defensetech.org/2014/11/25/f-35bs-no-louder-than-fa-18-super-hornets/ F-35Bs No Louder than F/A-18 Super Hornets] – Defensetech.org, 25 November 2014\n\nCockpit\n\nThe F-35 features a full-panel-width glass cockpit touchscreen \"panoramic cockpit display\" (PCD), with dimensions of 20 by 8 inches (50 by 20 centimeters).Goebel, Greg. [http://www.vectorsite.net/avf35.html \"The Lockheed Martin F-35 Joint Strike Fighter (JSF)\"]. vectorsite.net. Retrieved 23 November 2009.  A cockpit speech-recognition system (DVI) provided by Adacel has been adopted on the F-35 and the aircraft will be the first operational U.S. fixed-wing aircraft to employ this DVI system, although similar systems have been used on the AV-8B Harrier II and trialed in previous aircraft, such as the F-16 VISTA.Schutte, John. [http://www.afmc.af.mil/news/story.asp?id\n123071564 \"Researchers fine-tune F-35 pilot-aircraft speech system\"].  US Air Force, 10 October 2007.\n\nA helmet-mounted display system (HMDS) will be fitted to all models of the F-35.\"Joint Helmet Mounted Cueing System\". Boeing. Retrieved 23 November 2009. While some fighters have offered HMDS along with a head up display (HUD), this will be the first time in several decades that a front line fighter has been designed without a HUD.[http://www.rockwellcollins.com/news/page8813.html \"VSI's Helmet Mounted Display System flies on Joint Strike Fighter\"].  Rockwell Collins, 2007. Retrieved 8 June 2008.  The F-35 is equipped with a right-hand HOTAS side stick controller. The Martin-Baker US16E ejection seat is used in all F-35 variants.[http://www.jsf.org.uk/JSF-UK-Industry-Team/Martin-Baker.aspx \"Martin-Baker\"].  JSF. Retrieved 23 November 2009. The US16E seat design balances major performance requirements, including safe-terrain-clearance limits, pilot-load limits, and pilot size; it uses a twin-catapult system housed in side rails.\"JSF\" Martin-Baker. Retrieved 23 November 2009. This industry standard ejection seat can cause the heavier than usual helmet to inflict serious injury on lightweight pilots.\n\nThe F-35 employs an oxygen system derived from the F-22's own system, which has been involved in multiple hypoxia incidents on that aircraft; unlike the F-22, the flight profile of the F-35 is similar to other fighters that routinely use such systems.Peladeau, Jean. [http://www.lfpress.com/news/canada/2012/05/11/19748046.html \"Pilots worry about F-35 oxygen system\"]. QMI Agency, 11 May 2012.Bennett, John T. [https://www.usnews.com/news/blogs/dotmil/2012/05/24/f-22s-oxygen-issues-raise-questions-about-f-35 \"F-22's Oxygen Issues Raise Questions About F-35\"].  US News, 24 May 2012. On June 9, 2017, the 55 F-35s at Luke Air Force Base were grounded after five pilots complained of hypoxia-like symptoms over a five-week span. Symptoms ranged from dizziness to tingling in their extremities. The suspension was initially expected to last one day, but was extended to give investigators more time. Flying was resumed on 20 June, with no direct cause having been found.\n\nSensors and avionics\n\nThe F-35's sensor and communications suite has situational awareness, command and control and network-centric warfare capabilities.  The main sensor on board is the AN/APG-81 Active electronically scanned array-radar, designed by Northrop Grumman Electronic Systems.[http://www.es.northropgrumman.com/solutions/f35aesaradar/ \"APG-81 (F-35 Lightning II)\"].  Northrop Grumman Electronic Systems. Retrieved 4 August 2007.  It is augmented by the nose-mounted Electro-Optical Targeting System (EOTS),[http://www.lockheedmartin.com/products/JointStrikeFighterElectroOpticalTar/ \"Lockheed Martin Missiles and Fire Control: Joint Strike Fighter Electro-Optical Targeting System\"]. Lockheed Martin. Retrieved 11 April 2008.  it provides the capabilities of an externally mounted Sniper Advanced Targeting Pod with a reduced radar cross-section.Scott, William B. [http://www.aviationweek.com/aw/generic/story_generic.jsp?channel\nawst&id=news/10044top.xml \"Sniper Targeting Pod Attacks From Long Standoff Ranges\"]. Aviation Week, 3 October 2004. Retrieved 23 November 2009. Pappalardo, Joe. [http://www.origin.popularmechanics.com/technology/military_law/4339113.html \"How an F-35 Targets, Aims and Fires Without Being Seen\"]. Popular Mechanics, December 2009. Retrieved: 6 April 2010. The AN/ASQ-239 (Barracuda) system is an improved version of the F-22's AN/ALR-94 electronic warfare suite, providing sensor fusion of Radio frequency and Infrared tracking functions, advanced radar warning receiver including geolocation targeting of threats, multispectral image countermeasures for self-defense against missiles, situational awareness and electronic surveillance, employing 10 radio frequency antennae embedded into the edges of the wing and tail. In September 2015, Lockheed unveiled the \"Advanced EOTS\" that offers short-wave infrared, high-definition television, infrared marker, and superior image detector resolution capabilities.  Offered for the Block 4 configuration, it fits into the same area as the baseline EOTS with minimal changes while preserving stealth features.[https://www.flightglobal.com/news/articles/lockheed-reveals-advanced-eots-targeting-sensor-for-416631/ Lockheed reveals Advanced EOTS targeting sensor for F-35 Block 4] – Flightglobal.com, 10 September 2015\n\nSix additional passive infrared sensors are distributed over the aircraft as part of Northrop Grumman's electro-optical AN/AAQ-37 Distributed Aperture System (DAS),[http://www.es.northropgrumman.com/solutions/f35targeting/ \"F-35 Distributed Aperture System (EO DAS)\"]. Northrop Grumman. Retrieved 6 April 2010. which acts as a missile warning system, reports missile launch locations, detects and tracks approaching aircraft spherically around the F-35, and replaces traditional night vision devices. All DAS functions are performed simultaneously, in every direction, at all times. The electronic warfare systems are designed by BAE Systems and include Northrop Grumman components.[http://www.istockanalyst.com/article/viewnewspaged/articleid/3442641/pageid/2 \"JSF EW Suite\"].  istockanalyst.com. Retrieved 23 November 2009. Functions such as the Electro-Optical Targeting System and the electronic warfare system are not usually integrated on fighters. The F-35's DAS is so sensitive, it reportedly detected the launch of an air-to-air missile in a training exercise from  away, which in combat would give away the location of an enemy aircraft even if it had a very low radar cross-section.[http://breakingdefense.com/2014/06/a-gods-eye-view-of-the-battlefield-gen-hostage-on-the-f-35/4/ ‘A God’s Eye View Of The Battlefield:’ Gen. Hostage On The F-35] – Breakingdefense.com, 6 June 2014\n\nThe communications, navigation and identification (CNI) suite is designed by Northrop Grumman and includes the Multifunction Advanced Data Link (MADL), as one of a half dozen different physical links. The F-35 will be the first fighter with sensor fusion that combines radio frequency and IR tracking for continuous all-direction target detection and identification which is shared via MADL to other platforms without compromising low observability.Nativi, Andy. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channel\ndefense&idnews/F35-030509.xml \"F-35 Air Combat Skills Analyzed\"]. Aviation Week, 5 March 2009.  Link 16 is also included for communication with legacy systems.[http://defense-update.com/20120727_israel-us-negotiate-450-million-f-35i-avionic-enhancements.html \"Israel, US Negotiate $450 Million F-35I Avionic Enhancements\"]. Defense Update, 27 July 2012. The F-35 has been designed with synergy between sensors as a specific requirement, the aircraft's \"senses\" being expected to provide a more cohesive picture of the battlespace around it and be available for use in any possible way and combination with one another; for example, the AN/APG-81 multi-mode radar also acts as a part of the electronic warfare system.Sherman, Ron. [http://www.aviationtoday.com/av/categories/military/845.html \"F-35 Electronic Warfare Suite: More Than Self-Protection\"]. aviationtoday.com, 1 July 2006. Retrieved 22 August 2010. The Program Executive Officer (PEO) General Bogdan has described the sensor fusion software as one of the most difficult parts of the program.\n\nMuch of the F-35's software is written in C and C++ because of programmer availability; Ada83 code also is reused from the F-22. The Integrity DO-178B real-time operating system (RTOS) from Green Hills Software runs on COTS Freescale PowerPC processors.  The final Block 3 software is planned to have 8.6 million lines of code.Warwick, Graham. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channel\ndefense&idnews/awst/2010/06/07/AW_06_07_2010_p26-231580.xml&headline\nFlight%20Tests%20Of%20Next%20F-35%20Block%20Underway \"Flight Tests Of Next F-35 Block Underway\"]. Aviation Week, 12 June 2010. Retrieved 12 June 2010.  In 2010, Pentagon officials discovered that additional software may be needed.Cox, Bob. [http://www.star-telegram.com/2010/11/21/2649040/pentagon-officials-to-meet-to.html \"Pentagon officials to meet to address F-35 program's problems\"]. Star-Telegram, 21 November 2010.  General Norton Schwartz has said that the software is the biggest factor that might delay the USAF's initial operational capability.Reed, John. [http://www.dodbuzz.com/2010/11/23/schwartz-concerned-about-f-35a-delays/ \"Schwartz Concerned About F-35A Delays\"]. DoD buzz, 23 November 2010. In 2011, Michael Gilmore, Director of Operational Test & Evaluation, wrote that, \"the F-35 mission systems software development and test is tending towards familiar historical patterns of extended development, discovery in flight test, and deferrals to later increments\".Sweetman, Bill. [http://www.aviationweek.com/aw/blogs/defense/index.jsp?plckControllerBlog&plckBlogPage\nBlogViewPost&newspaperUserId27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostId\nBlog%3A27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3A0941e5b4-a3c7-4406-85f8-151f2ef34d6b&plckScriptblogScript&plckElementId\nblogDest \"More F-35B Delays, Software Schedule At Risk\"]. Aviation Week, 13 January 2011.\n\nThe electronic warfare and electro-optical systems are intended to detect and scan aircraft, allowing engagement or evasion of a hostile aircraft prior to being detected. The CATbird avionics testbed aircraft has proved capable of detecting and jamming radars, including the F-22's AN/APG-77.David A. Fulghum, Bill Sweetman, Bradley Perrett and Robert Wall. \"Stealthy Chinese J-20 Vulnerable\". Aviation Week, 14 January 2011. The F-35 was previously considered a platform for the Next Generation Jammer; attention shifted to using unmanned aircraft in this capacity instead.Fulghum, David. \"New Plan: NGJ To Go Unmanned\". Aviation Week, 25 January 2012. Several subsystems use Xilinx FPGAs; these COTS components enable supply refreshes from the commercial sector and fleet software upgrades for the software-defined radio systems.\n\nLockheed Martin's Dave Scott stated that sensor fusion boosts engine thrust and oil efficiency, increasing the aircraft's range. Air Force official Ellen M. Pawlikowski has proposed using the F-35 to control and coordinate multiple unmanned combat aerial vehicles (UCAVs).  Using its sensors and communications equipment, a single F-35 could orchestrate an attack made by up to 20 armed UCAVs.[http://breakingdefense.com/2014/12/pawlikowski-on-air-force-offset-strategy-f-35s-flying-drone-fleets/ Pawlikowski On Air Force Offset Strategy: F-35s Flying Drone Fleets] – Breakingdefense.com, 15 December 2014\n\nHelmet-mounted display system\n\nThe F-35 does not need to be physically pointing at its target for weapons to be successful.[https://www.youtube.com/user/F35JSFVideos#play/uploads/7/CwvnhFgzIKI \"F-35 Distributed Aperture System EO DAS\"]. YouTube. Retrieved 23 November 2009. Sensors can track and target a nearby aircraft from any orientation, provide the information to the pilot through their helmet (and therefore visible no matter which way the pilot is looking), and provide the seeker-head of a missile with sufficient information. Recent missile types provide a much greater ability to pursue a target regardless of the launch orientation, called \"High Off-Boresight\" capability. Sensors use combined radio frequency and infra red (SAIRST) to continually track nearby aircraft while the pilot's helmet-mounted display system (HMDS) displays and selects targets; the helmet system replaces the display-suite-mounted head-up display used in earlier fighters. Each helmet costs $400,000.\n\nThe F-35's systems provide the edge in the \"observe, orient, decide, and act\" OODA loop; stealth and advanced sensors aid in observation (while being difficult to observe), automated target tracking helps in orientation, sensor fusion simplifies decision making, and the aircraft's controls allow the pilot to keep their focus on the targets, rather than the controls of their aircraft.\"JSF: the first complete ‘OODA Loop’ aircraft\". Australian Defence Business Review, December 2006, p. 23.\n\nProblems with the Vision Systems International helmet-mounted display led Lockheed Martin-Elbit Systems to issue a draft specification for alternative proposals in early 2011, to be based around the Anvis-9 night vision goggles.Warwick, Graham. \"Lockheed Weighs Alternate F-35 Helmet Display\". Aviation Week, 21 April 2011. BAE Systems was selected to provide the alternative system in late 2011.[https://archive.is/20130128074847/http://www.marketwatch.com/story/lockheed-martin-selects-bae-systems-to-supply-f-35-joint-strike-fighter-jsf-helmet-display-solution-2011-10-10 \"Lockheed Martin Selects BAE Systems to Supply F-35 Joint Strike Fighter (JSF) Helmet Display Solution\"]. BAE Systems, 10 October 2011. The BAE Systems alternative helmet was to include all the features of the VSI system.Szondy, David. [http://www.gizmag.com/f-35-helmet-display-bae/20216/ \"BAE Systems to provide new helmet display for F-35 pilots\"]. Gizmag, 21 October 2011. However, adopting the alternative helmet would have required a cockpit redesign,Carey, Bill. [http://www.ainonline.com/aviation-news/singapore-air-show/2012-02-15/bae-drives-dual-approach-fixing-f-35-helmet-display-issues \"BAE Drives Dual Approach To Fixing F-35 Helmet Display Issues\"]. AINonline . 15 February 2012. but in 2013 development on the alternative helmet was halted because of progress on the baseline helmet.\n\nIn 2011, Lockheed Martin-Elbit granted VSI a contract to fix the vibration, jitter, night-vision and sensor display problems in their helmet-mounted display.[https://web.archive.org/web/20120430225851/http://www.dailymarkets.com/stock/2011/11/17/lockheed-martin-awards-f-35-contract/ \"Lockheed Martin Awards F-35 Contract\"]. Zacks Investment Research, 17 November 2011. A speculated potential improvement is the replacement of Intevac’s ISIE-10 day/night camera with the newer ISIE-11 model.Jean, Grace V. [http://www.nationaldefensemagazine.org/archive/2011/August/Pages/NewSensorAimstoGiveF-35Pilotsa%E2%80%98WindowIntotheNight%E2%80%99.aspx \"New Sensor Aims to Give F-35 Pilots a ‘Window Into the Night’\"].  National Defense Magazine, August 2011. In October 2012, Lockheed Martin-Elbit stated that progress had been made in resolving the technical issues of the helmet-mounted display, and cited positive reports from night flying tests; it had been questioned whether the helmet system allows pilots enough visibility at night to carry out precision tasks.[https://www.reuters.com/article/2012/10/30/lockheed-fighter-helmet-idUSL5E8LUJ4320121030 \"Lockheed Cites Good Reports on Night Flights of F-35 Helmet\"]. Reuters.com, 30 October 2012. In 2013, in spite of continuing problems with the helmet display, the F-35B model completed 19 nighttime vertical landings on board the USS Wasp at sea, by using the DAS instead of the helmet's built-in night vision capabilities, which offer at best 20/35 vision.\n\nIn October 2013, development of the alternate helmet was halted. The current Gen 2 helmet is expected to meet the requirements to declare, in July 2015, that the F-35 has obtained initial operational capability. Beginning in 2016 with low rate initial production (LRIP) lot 7, the program will introduce a Gen 3 helmet that features an improved night vision camera, new liquid crystal displays, automated alignment and other software enhancements.\n\nIn July 2015, an F-35 pilot commented that the helmet may have been one of the issues that the F-35 faced while dogfighting against an F-16 during a test; \"The helmet was too large for the space inside the canopy to adequately see behind the aircraft. There were multiple occasions when the bandit would've been visible (not blocked by the seat) but the helmet prevented getting in a position to see him (behind the high side of the seat, around the inside of the seat, or high near the lift vector)\".\n\nMaintenance\n\nThe program's maintenance concept is for any F-35 to be maintained in any F-35 maintenance facility and that all F-35 parts in all bases will be globally tracked and shared as needed.[http://www.sldinfo.com/?p=18843 \"F-35, Maintenance and the Challenge of Service Standardization\"]. Second Line of Defense, 9 June 2011. The commonality between the different variants has allowed the USMC to create their first aircraft maintenance Field Training Detachment to directly apply the lessons of the USAF to their F-35 maintenance operations.Hawkins, Dan. [http://www.globalsecurity.org/military/library/news/2012/07/mil-120727-afns01.htm \"F-35 maintenance training spawns USMC's first air FTD\"]. USMC, 27 July 2012. The aircraft has been designed for ease of maintenance, with 95% of all field replaceable parts \"one deep\" where nothing else has to be removed to get to the part in question. For instance the ejection seat can be replaced without removing the canopy, the use of low-maintenance electro-hydrostatic actuators instead of hydraulic systems and an all-composite skin without the fragile coatings found on earlier stealth aircraft.Clark, Colin. [http://defense.aol.com/2011/11/03/why-lockheed-thinks-f-35-beats-boeings-f-18/ \"Why Lockheed Thinks F-35 Beats Boeing's F-18\"].  Aol Defense, 3 November 2011.\n\nThe F-35 Joint Program Office has stated that the aircraft has received good reviews from pilots and maintainers, suggesting it is performing better than its predecessors did at a similar stage of development, and that the stealth type has proved relatively stable from a maintenance standpoint. This reported improvement is attributed to better maintenance training, as F-35 maintainers have received far more extensive instruction at this early stage of the program than on the F-22 Raptor. The F-35's stealth coatings are much easier to work with than those used on the Raptor. Cure times for coating repairs are lower and many of the fasteners and access panels are not coated, further reducing the workload for maintenance crews. Some of the F-35's radar-absorbent materials are baked into the jet's composite skin, which means its stealthy signature is not easily degraded.[http://www.flightglobal.com/news/articles/us-air-force-praises-early-performance-of-lockheed-martin-f-35-378578/ \"US Air Force praises early performance of Lockheed Martin F-35\"].Flightglobal.com, 6 November 2012. It is still harder to maintain (because of the need to preserve its stealth characteristics) than fourth-generation aircraft.Majumdar, Dave. [http://www.flightglobal.com/news/articles/stealth-isnt-becoming-obsolete-anytime-soon-379671/ \"Stealth isn’t becoming obsolete anytime soon\"]. Flight International, 30 November 2012. Retrieved 1 December 2012.\n\nHowever, the DOT&E Report on the F-35 program published in January 2015 determined that the plane has not, in fact, reached any of the nine reliability measures the program was supposed to achieve by this point in its development and that the Joint Program Office has been re-categorizing failure incidents to make the plane look more reliable than it actually is. Further, the complexity of maintaining the F-35 means that, currently, none of the Services are ready to keep it in working order and instead \"rely heavily on contractor support and unacceptable workarounds\". DOT&E found that the program achieved 61 percent of planned flight hours and that the average rate of availability was as low as 28 percent for the F-35A and 33 percent for the F-35B. The program created a new \"modeled achievable\" flight hour projection \"since low availability was preventing the full use of bed-down plan flight hours\". According to the Assistant Secretary of the Air Force for Financial Management, in FY2014, each non-test F-35 flew only 7.7 hours per month, which amounts to approximately one sortie every 5.5 days—for combat purposes, a sortie rate so low as to be crippling. Mean flight hours between removal (MFHBR) have increased, but are still only 59 percent to 65 percent of the required threshold. DOT&E found that mean corrective maintenance time for critical failures got worse for the F-35A and the F-35C over the last year. Structural cracking is also proving to be a recurring and enduring problem that is not yet resolved.\n\nOperational history\n\nTesting\n\nThe first F-35A (designated AA-1) was rolled out in Fort Worth, Texas, on 19 February 2006. In September 2006, the first engine run of the F135 in an airframe took place.\"Mighty F-35 Lightning II Engine Roars to Life\". Lockheed Martin, 20 September 2006. On 15 December 2006, the F-35A completed its maiden flight.[https://www.teamjsf.com/jsf/data.nsf/7074259f3965fd0985256f43007b0964/7f70d66a0aaef181852573540049ead4?OpenDocument \"F-35 First Flight\"]. TeamJSF.com. Retrieved 10 October 2007. A modified Boeing 737–300, the Lockheed Martin CATBird has been used as an avionics test-bed for the F-35 program, including a duplication of the cockpit.\n\nThe first F-35B (designated BF-1) made its maiden flight on 11 June 2008, piloted by BAE Systems' test pilot Graham Tomlinson. Flight testing of the STOVL propulsion system began on 7 January 2010.\"News Breaks: F-35B Engages Stovl Mode\".  Aviation Week, 11 January 2010, p. 15. The F-35B's first hover was on 17 March 2010, followed by its first vertical landing the next day.Wolf, Jim. [https://www.reuters.com/article/2010/03/18/us-lockheed-fighter-idUSTRE62H4WF20100318 \"F-35 fighter makes first vertical landing\"]. Reuters, 18 March 2010. During a test flight on 10 June 2010, the F-35B STOVL aircraft achieved supersonic speedsCavas, Christopher P. [http://www.marinecorpstimes.com/news/2010/06/dn_jsf_supersonic_061410/ \"F-35B STOVL fighter goes supersonic\"].  Marine Corps Times, 15 June 2010. as had the X-35B before.[https://www.pbs.org/wgbh/nova/transcripts/3004_xplanes.html \"X-planes\".] PBS: Nova transcript. Retrieved 9 January 2010. In January 2011, Lockheed Martin reported that a solution had been found for the cracking of an aluminum bulkhead during ground testing of the F-35B.Majumdar, Dave. [https://archive.is/20120908093025/http://www.navytimes.com/news/2011/01/marine-f-35-lockheed-says-key-issue-is-fixed-011011w/ \"Lockheed says it’s fixed key F-35B issue\"]. Defense News, 10 January 2011. In 2013, the F-35B suffered another bulkhead cracking incident. This will require redesign of the aircraft, which is already very close to the ultimate weight limit.\n\nBy June 2009, many of the initial flight test targets had been accomplished but the program was behind schedule.Sweetman, Bill. [http://www.zinio.com/reader.jsp?issue\n416083334 \"Get out and fly\"]. Defense Technology International, June 2009, pp. 43–44. During 2008, a Pentagon Joint Estimate Team (JET) estimated that the program was two years behind the public schedule, a revised estimate in 2009 predicted a 30-month delay.Cox, Bob. \"Internal Pentagon memo predicts that F-35 testing won't be complete until 2016\". Fort Worth Star Telegram, 1 March 2010. Delays reduced planned production numbers by 122 aircraft through 2015 to provide an additional $2.8 billion for development; internal memos suggested that the official timeline would be extended by 13 months.Capaccio, Tony. [http://www.businessweek.com/news/2010-01-06/lockheed-f-35-purchases-delayed-in-pentagon-s-fiscal-2011-plan.html \"Lockheed F-35 Purchases Delayed in Pentagon’s Fiscal 2011 Plan\"].  Bloomberg BusinessWeek, 6 January 2010. The success of the JET led Ashton Carter calling for more such teams for other poorly performing projects.Bennett, John T. [https://archive.is/20120904025817/http://www.defensenews.com/story.php?i4559411&c\nPOL&s=TOP \"Carter: More U.S. Programs To Get JET Treatment\"]. defensenews.com, 29 March 2010.\n\nNearly 30 percent of test flights required more than routine maintenance to make the aircraft flightworthy again.Thompson, Loren B. [http://www.lexingtoninstitute.org/f-35-cost-rise-is-speculative-but-progress-is-real?a1&c\n1129 \"F-35 Cost Rise Is Speculative, But Progress Is Real\"]. lexingtoninstitute.org, 12 March 2010. As of March 2010, the F-35 program had used a million more man-hours than predicted.[http://startelegram.typepad.com/files/sasc-mar-11-final-transcript-carter_gilmore_fox.rtf \"Senate Armed Services Committee Holds Hearing on President Obama's Fiscal 2011 Budget Request for the F-35 Joint Strike Fighter Program\"]. Congressional Record via startelegram.typepad.com, 11 March 2010. The United States Navy projected that lifecycle costs over a 65-year fleet life for all American F-35s to be $442 billion higher than U.S. Air Force projections.\"USAF Disputes Navy F-35 Cost Projections\". Aviation Week. Retrieved 3 July 2010. F-35 delays have led to shortfall of up to 100 jet fighters in the Navy/Marines team, although measures have been taken using existing assets to manage and reduce this shortfall.Grant, Greg [http://www.dodbuzz.com/2010/04/13/af-f-35-ioc-in-2016/ \"JSF Production \"Turned The Corner\"]. dodbuzz.com. Retrieved 15 April 2010.\n\nThe F-35C's maiden flight took place on 7 June 2010, at NAS Fort Worth JRB. A total of 11 U.S. Air Force F-35s arrived in fiscal year 2011.Rolfsen, Bruce. [https://wayback.archive-it.org/all/20110402220229/http://www.airforcetimes.com/news/2010/05/airforce_force_structure_051610W/ \"Jobs to change with focus on irregular warfare\"]. Army Times Publishing Company, 16 May 2010. On 9 March 2011, all F-35s were grounded after a dual generator failure and oil leak in flight;Warwick, Graham. [http://www.aviationweek.com/aw/blogs/defense/index.jsp?plckController\nBlog&plckBlogPageBlogViewPost&newspaperUserId\n27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostIdBlog%3a27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3a433985ca-f77d-48db-86bf-81b9eecc11dc&plckScript\nblogScript&plckElementIdblogDest \"In-flight Failure Halts F-35 Flight Tests\"]. Av Leak, 11 March 2011. the cause of the incident was discovered to have been the result of faulty maintenance.Cavas, Christopher P. [http://www.defensenews.com/story.php?i\n6063313&cAME&s\nTOP \"All F-35s Cleared To Resume Flight Tests\"]. DefenseNews, 25 March 2011. In 2012, Navy Commander Erik Etz of the F-35 program office commented that rigorous testing of the F-35's sensors had taken place during exercise Northern Edge 2011, and had served as a significant risk-reduction step.Branch, Ricardo, Army Sgt. [http://www.jber.af.mil/news/story.asp?id\n123156090 \"Northern Edge fields new radar system\"].  Northern Edge Joint Information Bureau, 8 March 2012.Saiki, Lt. Col. Tracey. [http://www.af.mil/News/ArticleDisplay/tabid/223/Article/112953/continued-testing-of-f-35-jsf-sensors-a-success-at-northern-edge-2011.aspx \"Continued testing of F-35 JSF sensors a success at Northern Edge 2011\"]. Af.mil. Retrieved 18 April 2012.\n\nOn 2 August 2011, an F-35's integrated power package (IPP) failure during a standard engine test at Edwards Air Force Base led to the F-35 being immediately grounded for two weeks.Trimble, Stephen. [http://www.flightglobal.com/articles/2011/08/03/360325/f-35-fleet-grounded-after-electrical-subsystem-failure.html \"F-35 fleet grounded after electrical subsystem failure\"]. Flight International, 3 August 2011.Majumdar, Dave. [https://archive.is/20130121144218/http://www.defensenews.com/story.php?i7289794&c\nAME&sAIR \"F-35s Grounded After Power Package Fails\"]. Defense News, 3 August 2011. On 10 August 2011, ground operations were re-instituted; preliminary inquiries indicated that a control valve did not function properly, leading to the IPP failure.[http://www.jsf.mil/news/docs/20110810_GROUNDOPS.pdf \"Statement on JPO Reinstituting Ground Operations for the F-35 Program\"]. Joint Strike Fighter Program Office, 10 August 2011.[https://archive.is/20130121141605/http://www.defensenews.com/story.php?i\n7358985&cAME&s\nAIR \"F-35 Fleet Cleared For Ground Operations\"]. Defense News, 10 August 2011. On 18 August 2011, the flight ban was lifted for 18 of the 20 F-35s; two aircraft remained grounded for lack of monitoring systems.Lerman, David. [https://www.bloomberg.com/news/2011-08-18/air-force-lifts-flight-ban-on-lockheed-f-35-fighter-jet-1-.html \"Air Force Lifts Flight Ban on Lockheed F-35 Fighter Jet\"]. Bloomberg News, 18 August 2011. The IPP suffered a second software-related incident in 2013, this resulted in no disruption as the fleet was already grounded by separate engine issues.[https://www.reuters.com/article/2013/02/25/us-lockheed-fighter-honeywell-idUSBRE91O11V20130225 \"Honeywell to test some F-35 parts after smoke incident\"]. Reuters.\n\nOn 25 October 2011, the F-35A reached its designed top speed of Mach 1.6 for the first time.[http://defensetech.org/2011/11/04/f-35-jsf-flight-test-update/ \"F-35 JSF Flight Test Update\"]. Defense Tech, 4 November 2011. Further testing demonstrated Mach 1.61 and 9.9g.Norris, Guy. [http://www.aviationweek.com/aw/blogs/defense/index.jsp?plckController\nBlog&plckBlogPageBlogViewPost&newspaperUserId\n27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostIdBlog%3a27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3acd242f57-3030-4871-b60b-764c1213fb1a&plckScript\nblogScript&plckElementId=blogDest \"F-35A pushes to Mach 1.6\"]. Aviation Week & Space Technology, 9 December 2011. On 11 February 2013, an F-35A completed its final test mission for clean wing flutter, reporting to be clear of flutter at speeds up to Mach 1.6.[http://www.lockheedmartin.com/us/news/press-releases/2013/february/130211ae_f-35a-completes-flutter-testing.html F-35A Completes 3-Year Clean Wing Flutter Testing Program] Lockheed press release, 11 February 2013 On 15 August 2012, an F-35B completed airborne engine start tests.[http://www.flightglobal.com/news/articles/f-35b-completes-air-start-testing-at-edwards-afb-376071/ \"F-35B completes air start testing at Edwards AFB\"]. Flight International, 4 September 2012.\n\nDuring testing in 2011, all eight landing tests of the F-35C failed to catch the arresting wire; a redesigned tail hook was developed and delivered two years later in response.Majumdar, Dave. [https://archive.is/20130102142244/http://www.defensenews.com/apps/pbcs.dll/article?AID=2012301170010 \"F-35C Tailhook Design Blamed for Landing Issues\"]. Defense News, 17 January 2012. In October 2011, two F-35Bs conducted three weeks of initial sea trials aboard .\"F-35B completes first sea trials on USS Wasp\". navair.navy. Retrieved: 17 July 2012.\n\nOn 6 October 2012, the F-35A dropped its first bomb,[http://www.flightglobal.com/news/articles/picture-f-35a-releases-first-air-launched-weapon-377754/ \"F-35A releases first air-launched weapon\"]. Flight International, 17 October 2012. followed three days later by an AIM-120 AMRAAM.[http://www.lockheedmartin.com/us/news/press-releases/2012/october/edwards-f-35a-completes-first-aim-120-amraam-internal-weapons-re.html \"F-35A Completes First AIM-120 Amraam Internal Weapons Release\"]. Lockheed Martin press release, 22 October 2012. On 28 November 2012, an F-35C performed a total of eleven weapon releases, including a GBU-31 JDAM and GBU-12 Paveway from its weapons bay in the first weapons released for the F-35C.[http://www.globalsecurity.org/military/library/news/2012/11/mil-121130-nns01.htm \"F-35C Lightning II Hits Weapons Testing Milestone\"]. Globalsecurity.org, 30 November 2012. On 5 June 2013, an F-35A at the Point Mugu Sea Test Range completed the first in-flight missile launch of an AIM-120 C5 AAVI (AMRAAM Air Vehicle Instrumented).  It was launched from the internal weapons bay.[https://www.f35.com/news/detail/f-35a-completes-first-in-flight-missile-launch/ \"F-35A Completes First In-Flight Missile Launch\"]. Lockheed Martin, 7 June 2013.\n\nOn 16 November 2012, the U.S. Marines received the first F-35B at MCAS Yuma, and the VMFA(AW)-121 unit is to be redesignated from a Boeing F/A-18 Hornet unit to an F-35B squadron.Majumdar, Dave. [http://www.flightglobal.com/blogs/the-dewline//2012/11/mcas-yuma-receives-first-opera.html \"MCAS Yuma receives(sic) first operational F-35B\"]. Flight International, 17 November 2012. A February 2013 Time article revealed that Marine pilots are not allowed to perform a vertical landing—the maneuver is deemed too dangerous, and it is reserved only for Lockheed test pilots.Time magazine, 25 February 2013, pp. 26–30, \"The Most Expensive Weapon Ever Built\", by Mark Thompson; restriction on vertical landings cited on page 28. On 10 May 2013, the F-35B completed its first vertical takeoff test.[https://www.f35.com/news/detail/f-35b-completes-first-vertical-takeoff/ \"F-35B Completes First Vertical Takeoff\"]. Lockheed Martin, 20 May 2013. On 3 August 2013, the 500th vertical landing of an F-35 took place.\n\nOn 18 January 2013, the F-35B was grounded after the failure of a fueldraulic line in the propulsion system on 16 January. The problem was traced to an \"improperly crimped\" fluid line manufactured by Stratoflex. The Pentagon cleared all 25 F-35B aircraft to resume flight tests on 12 February 2013. On 22 February 2013, the U.S. Department of Defense grounded the entire fleet of 51 F-35s after the discovery of a cracked turbine blade in a U.S. Air Force F-35A at Edwards Air Force Base. On 28 February 2013, the grounding was lifted after an investigation concluded that the cracks in that particular engine resulted from stressful testing, including excessive heat for a prolonged period during flight, and did not reflect a fleetwide problem.Mount, Mike. [http://myfox8.com/2013/03/01/military-clears-f-35-joint-strike-fighter-to-fly/ \"Military Clears F-35 Joint Strike Fighter to Fly\"] . CNN, 1 March 2013.[http://www.flightglobal.com/news/articles/f-35s-cleared-to-resume-flight-operations-382909/ \"F-35s cleared to resume flight operations\"]. Flight International, 28 February 2013. The F-35C Lightning II carrier variant Joint Strike Fighter conducted its first carrier-based night flight operations aboard an aircraft carrier off the coast of San Diego on 13 November 2014.\n\nOn 5 June 2015, the U.S. Air Education and Training Command Accident Investigation Board reported that catastrophic engine failure had led to the destruction of an Air Force F-35A assigned to the 58th Fighter Squadron at Eglin Air Force Base, Florida, on 23 June 2014.  The third-stage forward integral arm of a rotor had fractured and broke free during the takeoff roll. Pieces cut through the engine's fan case, engine bay, internal fuel tank and hydraulic and fuel lines before leaving through the aircraft's upper fuselage. Leaked fuel and hydraulic fluid ignited the fire, which destroyed the rear two-thirds of the aircraft. The destruction of the airframe resulted in the cancelation of the F-35's international debut at the 2014 Farnborough Airshow in England, the temporary grounding of the F-35 fleet and ongoing restrictions in the flight envelope.\n\nOn 19 June 2015 the RAF successfully launched two 500 lb Paveway IV precision-guided bombs, making the test the first time non-US munitions were deployed by the aircraft.\n\nThe US Marines declared the aircraft had met initial operational capability on 31 July 2015, despite shortcomings in night operations, communications, software and weapons carriage capabilities. However, J. Michael Gilmore, director of the Pentagon’s Operational Test and Evaluation Office, criticized the operational trials as not valid. In an internal memo, Gilmore concluded \"the exercise was so flawed that it 'was not an operational test … in either a formal or informal sense of the term.' Furthermore, the test 'did not—and could not—demonstrate' that the version of the F-35 that was evaluated 'is ready for real-world operational deployments, given the way the event was structured.'\"\n\nOn 11 April 2016 the Joint Program Office confirmed that the Royal Netherlands Air Force (RNLAF) had cleared its KDC-10 aerial tanker to refuel the F-35, paving the way for the fighter’s international public debut at the RNLAF’s Open Dagen (Open Day) at Leeuwarden on June 10–11, 2016. The testing required the fighter to refuel in daylight, dusk and night, with 30,000 lb. of fuel being transferred during the tests.\n\nThe Israel Air Force declared its F-35 fleet operationally capable on December 6, 2017.\n\nTraining\n\nIn 2011, the Director of Operational Test and Evaluation warned that the USAF's plan to start unmonitored flight training \"risks the occurrence of a serious mishap\".Schwellenbach, Nick. [http://www.pogo.org/resources/national-security/dod-memo-concerns-regarding-jsf-operational-utility-evaluation-training-flights.html \"Concerns Regarding Plans for the Joint Strike Fighter to Begin Training Flights and Conduct an Operational Utility Evaluation\"]. POGO, 31 October 2011.  The leaders of the United States Senate Committee on Armed Services called on Defense Secretary Leon Panetta to address the issue.[http://www.businessweek.com/news/2011-12-09/u-s-senators-press-panetta-to-review-f-35-training-safety.html \"U.S. Senators Press Panetta to Review F-35 Training Safety\"].  Bloomberg News, 9 December 2011. Despite the objections, expanded trial flights began in September 2012.Capaccio, Tony. [https://archive.is/20130118154612/http://www.businessweek.com/news/2012-09-28/air-force-expands-f-35-trials-over-tester-s-objections \"Air Force Expands F-35 Trials Over Tester’s Objections\"]. Bloomberg BusinessWeek, 28 September 2012.\n\nThe F-35A and F-35B were cleared for flight training in early 2012.Shalal-Esa, Andrea. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channeldefense&id\nnews/awx/2012/02/27/awx_02_27_2012_p0-429863.xml&headlineUSMC%20Near%20Start%20Of%20F-35%20Training%20Flights \"USMC Near Start Of F-35 Training Flights\"]. Aviation Week. 27 February 2012.  A military flight release for the F-35A was issued on 28 February 2012.[https://web.archive.org/web/20130802014635/http://www.af.mil/news/story.asp?id\n123291745 \"Air Force issues flight release for Eglin AFB F-35A]\" www.af.mil. 28 February 2012. Retrieved 5 May 2012 The aircraft were restricted to basic maneuvers with no tactical training allowed.Majumdar, Dave. [http://www.flightglobal.com/news/articles/first-air-national-guard-pilot-starts-transition-to-f-35-374470/ \"First Air National Guard pilot starts transition to F-35\"]. Flight Magazine, 17 July 2012. On 24 August 2012, an F-35 flew its 200th sortie while at Eglin Air Force Base, flown by a Marine pilot. The pilot said, \"The aircraft have matured dramatically since the early days. The aircraft are predictable and seem to be maintainable, which is good for the sortie production rate. Currently, the flight envelope for the F-35 is very, very restricted, but there are signs of improvement there too\". The F-35s at the base no longer need to fly with a chase aircraft and are operating in a normal two-ship element.[http://www.flightglobal.com/news/articles/eglin-f-35s-fly-200th-sortie-375794/ \"Eglin F-35s fly 200th sortie\"]. Flight International, 24 August 2012.\n\nOn 21 August 2012, J. Michael Gilmore wrote that he would not approve the Operational Test and Evaluation master plan until his concerns about electronic warfare testing, budget and concurrency were addressed.[http://defense.aol.com/2012/08/28/pentagons-testing-czar-questions-f-35-programs-ote-plan/ \"Pentagon's Testing Czar Questions F-35 Program's OTE Plan\"].  Aol Defense, 28 August 2012. On 7 September 2012, the Pentagon failed to approve a comprehensive operational testing plan for the F-35.Shalal-Esa, Andrea. [https://www.reuters.com/article/2012/09/11/us-lockheed-fighter-idUSBRE88A04A20120911 \"More problems raised at Pentagon F-35 fighter review\"]. Reuters, 10 September 2012. Instead, on 10 September 2012, the USAF began an operational utility evaluation (OUE) of the F-35A entire system, including logistical support and maintenance, maintenance training, pilot training, and pilot execution.Majumdar, Dave. [http://www.flightglobal.com/news/articles/usaf-to-start-f-35-operational-utility-evaluation-on-10-september-376217/ \"USAF to start F-35 operational utility evaluation on 10 September\"]. Flight International, 7 September 2012. By 1 October, the OUE was reported as \"proceeding smoothly\", pilots started on simulators prior to flying on 26 October.Majumdar, Dave. [http://www.flightglobal.com/news/articles/f-35-operational-utility-evaluation-proceeding-smoothly-377163/ \"F-35 operational utility evaluation proceeding smoothly\"]. Flightglobal.com, 1 October 2012. The OUE was completed on 14 November with the 24th flight, the four pilots involved having completed six flights each.\n\nDuring the Low Rate Initial Production (LRIP) phase of the aircraft, the U.S. had taken a tri-service approach to developing tactics and procedures for the F-35 using flight simulators prior to the type entering service. Simulated flights had tested the flight controls' effectiveness, helping to discover technical problems and refine aircraft design.Majumdar, Dave. [http://www.flightglobal.com/news/articles/simulation-plays-vital-role-in-building-f-35-tactics-and-aircraft-development-379336/ \"Simulation plays vital role in building F-35 tactics and aircraft development\"]. Flight International, 21 November 2012. Maintenance personnel have discovered that it is often possible to correct deficiencies in the F-35, which is a software-defined aircraft, simply by rebooting the aircraft's software and onboard systems.Majumdar, Dave. [http://www.flightglobal.com/news/articles/us-air-force-praises-early-performance-of-lockheed-martin-f-35-378578/ \"US Air Force praises early performance of Lockheed Martin F-35\"]. Flight International, 6 November 2012.\n\nAir Force pilot training F-35A began in January 2013 at Eglin Air Force Base; the program currently has a maximum capacity of 100 military pilots and 2,100 maintainer students.[http://militarytimes.com/news/2012/12/air-force-f35-pilot-training-starts-next-month-eglin-121712/ \"F-35 pilot training starts next month at Eglin>\"] Militarytimes.com, 17 December 2012.\n\nOn 23 June 2014, an F-35A experienced a fire in the engine area during its takeoff at Eglin AFB. In response, the Pentagon's Joint Program Office halted training in all F-35 models the next day, and on 3 July, the F-35 fleet was formally grounded. The fleet was returned to flight on 15 July, but the engine inspection regimen caused the aircraft's debut at the Farnborough 2014 Air Show to be canceled.[https://archive.is/20140717195739/http://www.defensenews.com/article/20140715/DEFREG02/307150027 \"Pentagon: F-35 Will Not Go to Farnborough\"]. Defense News\n\nAt Red Flag 2017 the F-35 scored a kill ratio of 15:1 against an F-16 aggressor squadron.\n\nBasing plans for future U.S. F-35s\n\nOn 9 December 2010, a media report stated that the \"USMC will base 216 F-35Bs on the East Coast and 184 of them on the West Coast, documents showed\". This report continued: \"Cherry Point will get 128 jets to form eight squadrons; Beaufort will have three squadrons and a pilot training center using 88 aircraft; Miramar will form six operational squadrons with 96 jets and 88 F-35s will go to Yuma for five operational squadrons with an additional test and evaluation unit\".\"Military plans to send jets to S.C., N.C., Calif., Ariz\". The Associated Press, 9 December 2010, Susanne M. Schafer.\n\nIn 2011, the USMC and USN signed an agreement that the USMC will purchase 340 F-35B and 80 F-35C fighters. The five squadrons of USMC F-35Cs would be assigned to Navy carriers while F-35Bs would be used ashore.Daniel, Lisa. [http://www.defense.gov/news/newsarticle.aspx?id\n63158 \"Plan Improves Navy, Marine Corps Air Capabilities\"].  American Forces Press Service, 14 March 2011.Cavas, Christopher P. [http://www.marinecorpstimes.com/news/2011/03/navy-more-marines-to-fly-f35c-031411w/ \"More Marines to fly carrier-variant JSFs\"].  Marine Corps Times, 14 March 2011.\n\nIn February 2014, the U.S. Air Force announced that the first Air National Guard unit to fly the new F-35 Lightning II will be the 158th Fighter Wing of the Vermont Air National Guard based at the Burlington Air Guard Station. The 158th currently flies F-16 Fighting Falcons, which are nearing the end of their useful service lives. Burlington Air Guard Station is expected to receive 18 F-35As, replacing the 18 F-16 Fighting Falcons currently assigned. The F-35A is expected to arrive in 2020.\n\nOn 11 March 2014, the first F-35A Lightning II assigned to Luke Air Force Base arrived at the base. 16 F-35s are to be delivered to the base by the end of 2014, with 144 Lightning IIs to be stationed there, arriving over the course of the next decade.\n\nOn 8 January 2015, the Royal Air Force base RAF Lakenheath in the UK was chosen as the first base in Europe to station two American F-35 squadrons, following an announcement by the Pentagon. 48 F-35s, making up 2 squadrons, will add to the 48th Fighter Wing's already existing F-15C and F-15E Strike Eagle jets.[http://theaviationist.com/2015/01/09/uk-base-selected-to-host-first-u-s-f-35-jets-in-europe/ \"RAF Lakenheath was selected as the first base to host USAFE F-35s\"]. The Aviationist, Retrieved January 13, 2015.\n\nProcurement and international participation\n\nWhile the United States is the primary customer and financial backer, the United Kingdom, Italy, The Netherlands, Canada, Turkey, Australia, Norway, and Denmark have agreed to contribute US$4.375 billion towards development costs.[http://www.globalsecurity.org/military/systems/aircraft/f-35-int.htm \"F-35 Joint Strike Fighter (JSF) Lightning II – International Partners\"]. Global Security. Retrieved 7 April 2010. Total development costs are estimated at more than US$40 billion. The purchase of an estimated 2,400 aircraft is expected to cost an additional US$200 billion.Merle, Renae. [https://www.washingtonpost.com/wp-dyn/articles/A38236-2005Mar15.html \"GAO Questions Cost Of Joint Strike Fighter\"]. The Washington Post, 15 March 2005. The initial plan was that the nine major partner nations would acquire over 3,100 F-35s through 2035.[http://www.jsf.mil/downloads/documents/JSF_PSFD_MOU_-_Update_4_2010.PDF \"Estimated JSF Air Vehicle Procurement Quantities\"]. JSF.mil, Updated as of April 2010. Sales to partner nations are made through the Pentagon's Foreign Military Sales program.Tae-hoon, Lee. [https://www.koreatimes.co.kr/www/news/nation/2012/03/205_106346.html \"Seoul fears delivery delays of F-35 jets\"]. The Korea Times, 6 March 2012.\n\nThere are three levels of international participation.[http://www.defenseindustrydaily.com/F-35-Lightning-The-Joint-Strike-Fighter-Program-2012-07501/ \"F-35 Lightning: The Joint Strike Fighter Program, 2012\"]. Defense Industry Daily, 30 October 2012. The levels generally reflect financial stake in the program, the amount of technology transfer and subcontracts open for bid by national companies, and the order in which countries can obtain production aircraft. The United Kingdom is the sole \"Level 1\" partner, contributing US$2.5 billion, which was about 10% of the planned development costs[https://www.teamjsf.com/jsf/data.nsf/75public/07CF737749FA9E5585256F3900720288?OpenDocument \"JSF Global Partners\"].  teamjsf.com. Retrieved 30 March 2007. under the 1995 Memorandum of Understanding that brought the UK into the project.\"US, UK sign JAST agreement\". Aerospace Daily New York: McGraw-Hill, 25 November 1995, p. 451. Level 2 partners are Italy, which is contributing US$1 billion; and the Netherlands, US$800 million. Level 3 partners are Turkey, US$195 million; Canada, US$160 million; Australia, US$144 million; Norway, US$122 million and Denmark, US$110 million. Israel and Singapore have joined as Security Cooperative Participants (SCP).Schnasi, Katherine V. [http://www.gao.gov/new.items/d04554.pdf \"Joint Strike Fighter Acquisition: Observations on the Supplier Base\"]. US Accounts Office. Retrieved 8 February 2006.[http://www.ic.gc.ca/eic/site/ad-ad.nsf/eng/ad03863.html \"Industry Canada F-35 Joint Strike Fighter (JSF) Canada's Next Generation Fighter Capability\"].  ic.gc.ca. Retrieved 25 November 2010.Combat Aircraft Monthly, September 2010, p. 24. Japan announced on 20 December 2011 its intent to purchase 42 F-35s with deliveries beginning in 2016 to replace the F-4 Phantom II; Japan seeks 38 F-35s, to be assembled domestically.[http://www.bbc.co.uk/news/world-asia-16259895 \"US Lockheed Martin F-35 chosen as Japan fighter jet\"]. BBC News, 20 December 2011. Retrieved: 20 December 2011.\n\nBy 2012, many changes had occurred in the order book. Italy became the first country to announce a reduction of its overall fleet procurement, cutting its buy from 131 to 90 aircraft. Other nations reduced initial purchases or delayed orders while still intending to purchase the same final numbers. The United States canceled the initial purchase of 13 F-35s and postponed orders for another 179. The United Kingdom cut its initial order and delayed a decision on future orders. Australia decided to buy the Boeing F/A-18E/F Super Hornet as an interim measure. Turkey also cut its initial order of four aircraft to two, but confirmed plans to purchase 100 F-35As.[https://www.reuters.com/article/2012/02/23/turkey-f35-lockheed-idUSL5E8DN2IM20120223 \"Update 1-Turkey keeps plan to buy 100 F-35 fighter jets\"]. Reuters, 23 February 2012.[http://www.turkishpress.com/news.asp?id378853#.T-xxLsr4JfA \"Turkey plans to buy 100 F-35 jet fighters\"].  turkishpress.com, 24 February 2012. Turkey will buy four F-35s to be delivered in 2015 and 2016, while the order may be increased from 100 to 120 aircraft.[http://www.turkishweekly.net/news/141212/turkey-to-buy-two-planes-in-second-f-35-shipment.html \"Turkey to Buy Two Planes in Second F-35 Shipment\"].  turkishweekly.net, 4 September 2012. These changes resulted in increased procurement prices, and increased the likelihood of further cuts.Harper, Tim. [https://www.thestar.com/news/canada/politics/article/1131391--tim-harper-the-conservatives-and-their-f-35-fairy-tale \"Tim Harper: The Conservatives and their F-35 fairy tale\"]. Toronto Star, 14 February 2012.Vasarri, Chiara. [https://archive.is/20130118143224/http://www.businessweek.com/news/2012-02-15/italy-to-cut-f-35-fighter-jet-orders-as-part-of-defense-revamp.html \"Italy to Cut F-35 Fighter Jet Orders as Part of Defense Revamp\"]. Bloomberg Business Week, 14 February 2012.\n\nOn 3 April 2012, the Auditor General of Canada Michael Ferguson published a report outlining problems with Canada's procurement of the jet, including misinformation over the final cost. According to the Auditor General, the government knowingly understated the final price of the 65 jets by $10 billion.Postmedia News. [http://www.canada.com/timeline+Canada+involvement+program/6419249/story.html \"A timeline on Canada's involvement in the F-35 program\"].  Canada.com, 5 April 2012. Canada's Conservative government had stated it would not reduce its order, and anticipated a $75–80 million unit cost; the procurement was termed a \"scandal\" and \"fiasco\" by the media and faced a full review to determine any Canadian F-35 purchase.[https://www.theglobeandmail.com/news/video/video-mps-hold-mackay-to-account-in-f-35-scandal/article2392358/ \"Video: MPs hold Mackay to account in F-35 scandal\"] . The Canadian Press via Globe and Mail, 4 April 2012.Coyne, Andrew. [http://fullcomment.nationalpost.com/2012/04/04/andrew-coyne-the-f-35-affair-is-a-fiasco-from-top-to-bottom/ \"Peeling back the layers of misconduct in the F-35 fiasco\"].  National Post, 4 April 2012.[http://www.cbc.ca/thenational/indepthanalysis/atissue/story/2012/04/05/thenational-atissue-040512.html \"The F-35 Fiasco\"]. CBC News, 5 April 2012. On 13 December 2012, in a scathing editorial published by CBC News, journalist Brian Stewart termed the F-35 project a \"global wrecking ball\" for its runaway costs and lack of affordability for many participating nations.Stewart, Brian. [http://www.cbc.ca/news/world/story/2012/12/12/f-vp-stewart-f35-jets.html \"Super-costly F-35s, a global wrecking ball\"]. Canadian Broadcasting Corporation, 13 December 2012.\n\nIn May 2013, Lockheed Martin declared that Turkey is projected to earn $12 billion from licensed production of F-35 components.\n\nIn November 2014, the United Kingdom confirmed its first order for 14 F-35Bs to be delivered in 2016.\n\nVariants\n\nThe F-35 is being built in three different main versions to suit various combat missions.\n\nF-35A\n\nThe F-35A is the conventional takeoff and landing (CTOL) variant intended for the U.S. Air Force and other air forces. It is the smallest, lightest F-35 version and is the only variant equipped with an internal cannon, the GAU-22/A. This 25 mm cannon is a development of the GAU-12 carried by the USMC's AV-8B Harrier II. It is designed for increased effectiveness against ground targets compared to the 20 mm M61 Vulcan cannon carried by other USAF fighters.\n\nThe F-35A is expected to match the F-16 in maneuverability and instantaneous high-g performance, and outperform it in stealth, payload, range on internal fuel, avionics, operational effectiveness, supportability, and survivability.Pike, John. [http://www.globalsecurity.org/military/systems/aircraft/f-35a.htm \"F-35A Joint Strike Fighter\"]. Globalsecurity.org. Retrieved 23 November 2009. It is expected to match an F-16 that is carrying the usual external fuel tank in acceleration performance.[http://www.lockheedmartin.com/aeronautics/afa/beesley-interview.html \"Flying The F-35: An Interview With Jon Beesley, F-35 Chief Test Pilot\"] . lockheedmartin.com. Retrieved 25 November 2010. \n\nThe A variant is primarily intended to replace the USAF's F-16 Fighting Falcon. At one point it was also intended to replace the A-10 Thunderbolt II starting in 2028.Hebert, Adam J. [http://www.airforce-magazine.com/MagazineArchive/Pages/2007/July%202007/0707lightning.aspx \"Lightning II: So Far, So Good\"].  airforce-magazine.com, Air Force Association, Volume 90, Issue 7, July 2007. Retrieved 3 December 2008.Laurenzo, Ron. [http://www.globalsecurity.org/org/news/2003/030609-a-10-retire01.htm \"Air Force: No Plan To Retire A-10\"]. GlobalSecurity.org, Defense Weekly, 9 June 2003. Retrieved 3 December 2008. The F-35A can be outfitted to receive fuel via either of the two main aerial refueling methods; this was a consideration in the Canadian procurement and a deciding factor for the Japanese purchase.Waldron, Greg. [http://www.flightglobal.com/news/articles/in-focus-tokyo-casts-wary-eye-on-chinese-airpower-developments-375007/ \"IN FOCUS: Tokyo casts wary eye on Chinese airpower developments\"]. Flight International, 2 August 2012.[http://www.cbc.ca/news/canada/story/2011/10/23/f-35-communication-problem.html \"F-35s face communication problems in Arctic\"]. The Canadian Press, 23 October 2011.Ewing, Philip. [http://www.dodbuzz.com/2012/06/19/lockheeds-comprehensive-qa-on-the-f-35/ \"Lockheed’s comprehensive Q&A on the F-35\"]. DoD Buzz, 19 June 2012. On 18 December 2013, the Netherlands became the second partner country to operate the F-35A, when Maj. Laurens J.W. Vijge of the Royal Netherlands Air Force took off from Eglin Air Force Base.\n\nOn 27 January 2014, General Mike Hostage, head of Air Combat Command, stated he would fight \"to the death\" to not have a single plane of the USAF's planned 1,763 F-35 purchase be cut, because the allies and partners of the US got \"weak in the knees\" when seeing the USAF \"back away\" from the F-35. He said the F-15 and F-16 fleets would become tactically obsolete in the middle of the next decade regardless of improvements. Hostage also commented that the F-35 would be \"irrelevant\" without the F-22 fleet being viable as the F-35 was not an air superiority fighter, and that an F-35 pilot who enters a dogfight has made a mistake.\n\nThe F-35As for the Royal Norwegian Air Force will have drag chute installed. Norway will be the first country to adopt the drag chute pod.\n\nOn 2 August 2016, the U.S. Air Force declared the F-35A basic combat ready. The 34th Fighter Squadron located at Hill Air Force Base, Utah, has at least 12 combat-ready jets capable of global deployment. F-35A is scheduled to be full combat ready in 2017 with its 3F software upgrade. Air Combat Command will initially deploy F-35A to Red Flag exercises and as a \"theater security package\" to Europe and the Asia-Pacific. It will probably not be fighting the Islamic State in the Middle East earlier than 2017.\n\nOn 13 July 2017, UK Minister of State For Defence Earl Howe confirmed that the UK will purchase a minimum 138 aircraft and a decision will shortly be forthcoming as whether there will be a 'mix' of F-35A and 'B' versions required for 'synergy' and 'inter-service operability' between the RAF and Royal Navy.\n\nF-35B\n\nThe F-35B is the short takeoff and vertical landing (STOVL) variant of the aircraft. Similar in size to the A variant, the B sacrifices about a third of the A variant's fuel volume to accommodate the vertical flight system. Vertical takeoffs and landings are riskier because of threats such as foreign object damage.Hancock, Ben D. [http://www.globalsecurity.org/military/library/report/1997/Hancock.htm \"The STOVL Joint Strike Fighter in Support of the 21st Century Marine Corps\"]. USMC, 1997. Whereas the F-35A is stressed to 9 g,Sweetman, Bill. [http://www.zinio.com/express3?issue\n368748439 \"Numbers Crunch: True cost of JSF program remains to be seen\"]. Defense Technology International, February 2009, p. 22.[http://www.defenseindustrydaily.com/f-35-hmds-pulls-the-gs-04088/ \"F-35 HMDS Pulls the Gs\".] Defense Industry Daily, 25 October 2007. the F-35B's stress goal is 7 g. , the F-35B is limited to 4.5 g and 400 knots. The next software upgrade includes weapons, and allows 5.5 g and Mach 1.2, with a final target of 7 g and Mach 1.6.Norris, Guy. \"[http://aviationweek.com/blog/pilot-reaction-flying-f-35b Pilot reaction to flying the F-35B]\" Aviation Week & Space Technology, 24 April 2014. Accessed: 15 September 2014. [https://web.archive.org/web/20140727190007/http://aviationweek.com/blog/pilot-reaction-flying-f-35b Archived] on 27 September 2014 The first test flight of the F-35B was conducted on 11 June 2008.Norris, Guy and Graham Warwick. \"F-35B First Flight Boosts JSF as F-22 Loses Supporters\". Aviation Week, 15 June 2008. Another milestone, the first successful ski-jump launch was carried out by BAE test pilot Peter Wilson on 24 June 2015.\n\nUnlike other variants, the F-35B has no landing hook. The \"STOVL/HOOK\" control instead engages conversion between normal and vertical flight.[http://www.defenceaviation.com/2010/03/f-35-flightmode.html \"F-35B STOVL-mode Flight\"]. defenceaviation.com. Retrieved 25 November 2010. Jet thrust is sent directly downwards during vertical flight; the nozzle is being redesigned to spread the output across an oval rather than circular shape in order to limit damage to asphalt and ship decks. The variant's three-bearing swivel nozzle that directs the full thrust of the engine is moved by a \"fueldraulic\" actuator using pressurized fuel as the working fluid.\"Custom tool to save weeks in F-35B test and evaluation\". Naval Air Systems Command, 6 May 2011.\n\nThe U.S. Marine Corps plans to purchase 340 F-35Bs, to replace current inventories of both the F/A-18 Hornet (A, B, C and D-models), and the AV-8B Harrier II, in the fighter and attack roles. The Marines plan to use the F-35B from \"unimproved surfaces at austere bases\" but with \"special, high-temperature concrete designed to handle the heat\".Diamant, Aaron. [https://archive.is/20120806003330/http://yuma.usmc.mil/desertwarrior/2011/12/22/feature1.html \"JSF construction lands another first\"]. USMC, 22 December 2011. The USMC declared initial operational capability with about 50 F-35s running interim block 2B software on 31 July 2015.Majumdar, Dave. [https://archive.is/20120724094828/http://www.defensenews.com/story.php?i\n6613888 \"U.S. Military May Deploy F-35 Before Formal IOC\"]. Defense News, 24 May 2011. The USAF had considered replacing the A-10 with the F-35B, but will not do so because of the F-35B's inability to generate enough sorties.Majumdar, Dave. [http://www.flightglobal.com/news/articles/usaf-f-35b-cannot-generate-enough-sorties-to-replace-a-10-371985/ \"USAF: F-35B cannot generate enough sorties to replace A-10\"]. Flight Magazine, 16 May 2012.\n\nOn 6 January 2011, Gates said that the 2012 budget would call for a two-year pause in F-35B production during which the aircraft faced redesign, or cancellation if unsuccessful.Pew, Glenn. [http://www.avweb.com/avwebflash/news/pentagon_cancel_f35_marine_203914-1.html \"Pentagon May Cancel STOVL Version of F-35\"]. AvWeb, January 2011. In 2011, Lockheed Martin executive vice president Tom Burbage and former Pentagon director of operational testing Tom Christie stated that most program delays were due to the F-35B, which forced massive redesigns of other versions.Cox, Bob. \"F-35 started with recipe for trouble, analysts say\". Star Telegram, 29 January 2011. Lockheed Martin Vice President Steve O’Bryan has said that most F-35B landings will be conventional to reduce stress on vertical lift components.Ewing, Philip. [http://www.dodbuzz.com/2011/06/07/lockheed-many-f-35b-landings-wont-be-vertical/ \"Lockheed: Many F-35B landings won’t be vertical\"]. DoD Buzz, 7 June 2011. These conventional mode takeoffs and landings cause an \"unacceptable wear rate\" to the aircraft's \"poorly designed\" tires. USMC Lt. Gen. Robert Schmidle has said that the vertical lift components would only be used \"a small percentage of the time\" to transfer the aircraft from carriers to land bases. On 3 October 2011, the F-35B began its initial sea-trials by performing a vertical landing on the deck of the amphibious assault ship ,Trimble, Stephen. [http://www.flightglobal.com/blogs/the-dewline/2011/10/video-f-35b-completes-first-sh.html \"VIDEO: F-35B completes first shipboard vertical landing\"]. The DEWline, 4 October 2011. to continue in 2015. Probation status was reportedly ended by Defense Secretary Leon Panetta in January 2012 based on progress made. A heat-resistant anti-skid material called Thermion is being tested on Wasp, also useful against the V-22 exhaust.\n\nBritain's Royal Air Force and Royal Navy plan to introduce the F-35B as a replacement for the Harrier GR9, which was retired in 2010, and Tornado GR4, which will retire in 2019.  The F-35 is intended to be the United Kingdom's primary strike attack aircraft for the next three decades. One of the Royal Navy requirements for the F-35B design was a Shipborne Rolling and Vertical Landing (SRVL) mode to increase maximum landing weight to bring back unused ordnance by using wing lift during landing.[http://www.nao.org.uk/idoc.ashx?docIdc02da1c8-320b-4062-881d-2c24482459b5&version\n-1 \"Major Projects Report 2008\"]. Ministry of Defence. Retrieved 23 November 2009. [http://www.flightglobal.com/articles/2007/06/15/214672/us-marines-eye-uk-jsf-shipborne-technique.html \"US Marines eye UK JSF shipborne technique\"]. Flight International, 15 June 2007. In July 2013, Chief of the Air Staff, Air Chief Marshal Sir Stephen Dalton announced that 617 Squadron would be the first operational Royal Air Force squadron to receive the F-35. The second operational squadron will be the Fleet Air Arm's 809 NAS. In June 2013, the Royal Air Force had received three aircraft of the 48 on order, all of which based at Eglin Air Force base. The F-35 will be based at Royal Air Force Marham and become operational in 2018. In June 2015, the F-35B undertook its first launches from a ski-jump, when one of the UK's aircraft took off using a ramp constructed at NAS Patuxent River. When required to operate from the sea, the Royal Air Force and Royal Navy will operate the F-35B from ships fitted with ski-jumps, as will the Italian Marina Militare. In 2011, the Marina Militare was preparing Grottaglie Air Station for F-35B operations; they are to receive 22 aircraft between 2014 and 2021, with the  aircraft carrier Cavour set to be modified to operate them by 2016.[http://www.military-today.com/navy/cavour.htm \"F-35B on Italian \"Cavour\" aircraft carrier\"]. Military-today.com, 4 December 2011. The British version of the F-35B is not intended to receive the Brimstone 2 missile.\n\nCommandant of the U.S. Marine Corps, General James Amos has said that, in spite of increasing costs and schedule delays, there is no plan B to the F-35B.Kovach, Gretel C. [http://www.signonsandiego.com/news/2010/dec/08/commandant-calls-joint-strike-fighter-essential/ \"Commandant calls Joint Strike Fighter essential\"]. U-T San Diego, 8 December 2010. The F-35B is larger than the aircraft it replaces, which required  to be designed without well deck capabilities.Jean, Grace V. [http://www.nationaldefensemagazine.org/archive/2008/September/Pages/MarinesQuestiontheUtilityof.aspx \"Marines Question the Utility of Their New Amphibious Warship\"].  National Defense Industrial Association, September 2008. In 2011, the USMC and USN signed an agreement by which the USMC will purchase 340 F-35B and 80 F-35C fighters, while the USN will purchase 260 F-35Cs. The five squadrons of USMC F-35Cs will be assigned to Navy carriers; F-35Bs will be used on amphibious ships and ashore.\n\nAlthough the Australian  ships were not originally planned to operate fixed-wing aircraft, in May 2014, the Minister for Defence David Johnston stated in media interviews that the government was considering acquiring F-35B fighters for Canberras, and Prime Minister Tony Abbott instructed 2015 Defence White Paper planners to consider the option of embarking F-35B squadrons aboard the two ships. Supporters of the idea stated that providing fixed-wing support to amphibious operations would maximize aircraft capability, and the presence of a ski-jump ramp, inherited from the original design, meant that the vessels were better suited to STOVL operations than equivalent ships with flat flight decks. Opponents to the idea countered that embarking enough F-35Bs to be effective required abandoning the ships' amphibious capability and would make the pseudo-carriers more valuable targets, modifications would be required to make the flight deck capable of handling vertical-landing thrust and to increase fuel and ordnance capacity for sustained operations, and that the F-35B project itself has been the most expensive and most problematic of the Joint Strike Fighter variants. In July 2015 Australia ended consideration of buying the F-35B for its two largest assault ships, as the ship modifications were projected to cost more than AUS$5 billion (US$4.4 billion). The plan was opposed by the Royal Australian Air Force, as an F-35B order could have diminished the number of F-35As purchased.\n\nThe U.S. Marine Corps plans to disperse its F-35Bs among forward deployed bases to enhance survivability while remaining close to a battlespace, similar to RAF Harrier deployment late in the Cold War, which relied on the use of off-base locations that offered short runways, shelter, and concealment.  Known as distributed STOVL operations (DSO), Marine F-35Bs would sustain operations from temporary bases in allied territory within the range of hostile ballistic and cruise missiles, but be moved between temporary locations inside the enemy's 24- to 48-hour targeting cycle.  This strategy accounts for the F-35B's short range, the shortest of the three variants, with mobile forward arming and refueling points (M-Farps) accommodating KC-130 and MV-22 Osprey aircraft to rearm and refuel the jets, as well as littoral areas for sea links of mobile distribution sites on land.  M-Farps could be based on small airfields, multi-lane roads, or damaged main bases, while F-35Bs would return to U.S. Navy ships, rear-area U.S. Air Force bases, or friendly carriers for scheduled maintenance; metal planking would be needed to protect unprepared roads from the F-35B's engine exhaust, which would be moved between sites by helicopters, and the Marines are studying lighter and more heat-resistant products.[http://aviationweek.com/defense/marines-propose-rapidly-mobile-f-35-operations Marines Propose Rapidly Mobile F-35 Operations] – Aviationweek.com, 16 December 2014\n\nF-35C\n\nCompared to the F-35A, the F-35C carrier variant features larger wings with foldable wingtip sections, larger wing and tail control surfaces for improved low-speed control, stronger landing gear for the stresses of carrier arrested landings, a twin-wheel nose gear, and a stronger tailhook for use with carrier arrestor cables. The larger wing area allows for decreased landing speed while increasing both range and payload.\n\nThe United States Navy intends to buy 480 F-35Cs to replace the F/A-18A, B, C, and D Hornets and complement the Super Hornet fleet.[http://www.globalsecurity.org/military/systems/aircraft/f-35c.htm \"F-35C Carrier Variant Joint Strike Fighter (JSF)\"]. GlobalSecurity.org. Retrieved 16 June 2010. On 27 June 2007, the F-35C completed its Air System Critical Design Review (CDR), allowing the production of the first two functional prototypes.[http://www.prnewswire.com/cgi-bin/stories.pl?ACCT104&STORY\n/www/story/06-27-2007/0004616904&EDATE\"F-35 Navy Version Undergoes Successful Design Review, Readies for Production\"]. Lockheed Martin, 7 June 2007. Retrieved 16 June 2010. The C variant was expected to be available beginning in 2014.Grant, Rebecca L., PhD [http://www.lexingtoninstitute.org/navy-speeds-up-f-35?a\n1&c1171 \"Navy Speeds Up F-35\"]. Lexington Institute, 14 September 2009. Retrieved 20 September 2009. The first F-35C was rolled out on 29 July 2009.[http://frontierindia.net/f-35c-lightning-ii-rolled-out#more-4226 \"F-35C Lightning II rolled out\"].  FrontierIndia.net, 29 July 2009. The United States Marine Corps will also purchase 80 F-35Cs, enough for five squadrons, for use with navy carrier air wings in a joint service agreement signed on 14 March 2011. A recent 2014 document stated that the USMC will also have 4 squadrons of F-35Cs with 10 aircraft per squadron for the Marine Corps' contribution to U.S. Navy carrier air wings.\n\nOn 6 November 2010, the first F-35C arrived at Naval Air Station Patuxent River. The replacement engines for at-sea repair are too large to be transported by current underway replenishment systems.[http://webarchive.loc.gov/all/20130305155514/http://www.navytimes.com/news/2010/11/navy-jsf-engine-too-big-112910w/ \"JSF Engine too big for regular transport at sea\"]. Navy Times, 30 November 2010. In 2011, the F-35Cs were grounded for six days after a software bug was found that could have prevented the control surfaces from being used during flight.Cavas, Christopher P. [https://archive.is/20130121094245/http://www.defensenews.com/story.php?i6915380&c\nAIR&sTOP \"U.S. Navy JSFs Resume Flight Ops After Glitch\"]. Defense News, 24 June 2011. On 27 July 2011, the F-35C test aircraft CF-3 completed its first steam catapult launch during a test flight at Naval Air Engineering Station Lakehurst; the TC-13 Mod 2 test steam catapult, representative of current fleet technology, was used. In addition to catapult launches at varying power levels, a three-week test plan included dual-aircraft jet blast deflector testing and catapult launches using a degraded catapult configuration to measure the effects of steam ingestion on the aircraft.[http://www.navair.navy.mil/index.cfm?fuseactionhome.NAVAIRNewsStory&id\n4712 \"Catapult launches F-35C for the first time\"].  Naval Air Systems Command, 27 July 2011. Retrieved 31 December 2011 \n\nOn 13 August 2011, the F-35 successfully completed jet blast deflector (JBD) testing at Lakehurst. F-35C test aircraft CF-1 along with an F/A-18E tested a combined JBD cooling panel configuration. The tests measured temperature, pressure, sound level, velocity, and other environmental data; the JBD model will enable the operation of all carrier aircraft, including the F-35C. Further carrier suitability testing continued in preparation for initial ship trials in 2013.[http://www.navair.navy.mil/index.cfm?fuseaction\nhome.NAVAIRNewsStory&id=4736 \"F-35C completes jet blast deflector testing\"].  NAVAIR, 22 August 2011. Retrieved 23 August 2011.  On 18 November 2011, the U.S. Navy used its new Electromagnetic Aircraft Launch System (EMALS) to launch an F-35C into the air for the first time.Ewing, Philip. [http://www.dodbuzz.com/2011/11/28/the-future-is-here-emals-launches-f-35/ \"The future is here: EMALS launches F-35\"]. DODbuzz.com, 28 November 2011.\n\nOn 22 June 2013, Strike Fighter Squadron VFA-101 received the Navy's first F-35C at Eglin Air Force Base, Florida.\n\nThe USN is dealing with the following issues in adapting their carriers to operate the F-35C.Majumdar, Dave. [http://www.flightglobal.com/news/articles/us-navy-works-through-f-35c-air-ship-integration-issues-377171/ \"US Navy works through F-35C air-ship integration issues\"]. Flight International, 1 October 2012.\n* The F135 engine exceeds the weight capacity of traditional underway replenishment systems and generates more heat than previous engines.\n* The stealthy skin requires new repair techniques; extensive skin damage will necessitate repairs at Lockheed's land-based facilities.\n* The adoption of lithium-ion batteries needing careful thermal management, and higher voltage systems than traditional fighters.\n* Storing of new weapons not previously employed on carrier aircraft.\n* Large quantities of classified data generated during missions shall require additional security.\n\nIn February 2014, Lockheed said the F-35C was on schedule for sea trials after the tailhook was redesigned.  The new tailhook has a different shape to better catch arresting wires.  Testing on land achieved 36 successful landings.  Sea trials were scheduled for October 2014.\n\nOn 3 November 2014, an F-35C of VX-23, one of the Navy's flight test units, made its first landing on an aircraft carrier when it recovered aboard ; this started a two week deployment of a pair of aircraft for the initial at sea Development Testing I or DTI, the first of three at sea tests planned for the F-35C. The initial deployment was completed on November 14.\n\nThe U.S. Navy may use the F-35C as part of its UCLASS effort to operate a carrier-based unmanned aerial vehicle.  Though it has been suggested that the UCLASS could carry air-to-air weapons, an unmanned aircraft lacks situational awareness and is more vulnerable to electronic countermeasures than manned aircraft, and autonomy for deploying lethal weapons is not under development.  With the F-35C as the center of a network of naval systems, it could feed information to the UCLASS and order it to fire on a certain target.  Large numbers of F-35Cs operating in contested environments can generate a clear picture of the battlespace, and share it with unmanned assets that can be directed to attack.\n\nVFA-147 was selected to be the first operational squadron to transition to the F-35C in January 2018. Operational testing was to continue aboard  at the beginning of 2018. The carrier is the first to be modernized to operate the F-35C. Initial operating capability is expected between mid-2018 and early 2019, with the first deployment is scheduled aboard  in 2020. The F-35C will equip two of the four strike fighter squadrons in a carrier air wing.[http://www.janes.com/article/67250/usn-stands-up-f-35c-west-coast-fleet-replacement-squadron USN stands up F-35C West Coast Fleet Replacement Squadron], by Gareth Jennings, London – IHS Jane's Navy International, 26 January 2017; retrieved 11 May 2017.\n\nOther versions\n\nF-35I\n\nThe F-35I Adir (, meaning \"Awesome\", or \"Mighty One\") is an F-35A with Israeli modifications. A senior Israel Air Force official stated \"the aircraft will be designated F-35I, as there will be unique Israeli features installed in them\". Despite an initial refusal to allow such modifications, the U.S. has agreed to let Israel integrate its own electronic warfare systems, such as sensors and countermeasures, into the aircraft. The main computer will have a plug-and-play feature to allow add-on Israeli electronics to be used; proposed systems include an external jamming pod, and new Israeli air-to-air missiles and guided bombs in the internal weapon bays.Ben-David, Alon. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channel\ndefense&idnews/awst/2010/08/23/AW_08_23_2010_p32-249396.xml \"Israel To Buy F-35s With Cockpit Mods\"]. Aviation Week, 27 August 2010. Ben-David, Alon, Amy Butler and Robert Wall. [http://www.aviationweek.com/aw/generic/story.jsp?channelawst&id\nnews/awst/2011/07/04/AW_07_04_2011_p22-342412.xml&headlineIsrael,%20U.S.%20Strike%20F-35%20Technology%20Deal&prev\n10 \"Israel, U.S. Strike F-35 Technology Deal\"]. Aviation Week, 7 July 2011. Retrieved 8 October 2011. \n\nIsrael Aerospace Industries (IAI) has considered playing a role in the development of a proposed two-seat F-35; an IAI executive stated: \"There is a known demand for two seats not only from Israel but from other air forces\".Trimble, Stephen. [http://www.flightglobal.com/news/articles/israel-sets-sights-on-two-seater-f-35-337464/ \"Israel sets sights on two-seater F-35\"]. Flight International, 22 January 2010. IAI plans to produce conformal fuel tanks.Egozi, Arie. [http://www.flightglobal.com/news/articles/israel-to-boost-range-of-future-f-35-fleet-220748/ \"Israel to boost range of future F-35 fleet\"]. Flight International. 11 January 2008. A senior IAF official stated that elements of the F-35's stealth may be overcome in 5 to 10 years, while the aircraft will be in service for 30 to 40 years, which is why Israel insisted on installing their own electronic warfare systems: \"The basic F-35 design is OK. We can make do with adding integrated software\".[http://www.aviationweek.com/Article.aspx?id/article-xml/AW_08_06_2012_p28-482027.xml \"Israel, U.S. Agree To $450 Million In F-35 EW Work\"].  Aviation Week, 6 August 2012. Israel is interested in purchasing up to 75 F-35s.\n\nOn 12 December 2016, Israel began receiving its first F-35Is of the 50 it plans to purchase for integration and testing. Israel is to be the second nation with an operational F-35 squadron following the U.S.   The first nine F-35s became operational (at initial operating capacity) in the Israeli Air Force in December 2017.[http://www.inss.org.il/publication/adir-in-the-sky-the-f-35-arrives-in-israel “Adir” in the Sky: The F-35 Arrives in Israel] INSS Insight No. 875, December 12, 2016\n\nCF-35\n\nThe Canadian CF-35 is a proposed variant that would differ from the F-35A through the addition of a drogue parachute and may include an F-35B/C-style refueling probe. In 2012, it was revealed that the CF-35 would employ the same boom refueling system as the F-35A. One alternative proposal would have been the adoption of the F-35C for its probe refueling and lower landing speed; the Parliamentary Budget Officer's report cited the F-35C's limited performance and payload as being too high a price to pay. Following the 2015 Federal Election, in which the Liberal Party, whose campaign had included a pledge to cancel the F-35 procurement, won a majority in the House of Commons, and stated it would run a new competition for an aircraft to replace the existing CF-18 Hornet.\n\nF-35D\n\nEarly-stage design study for a possible upgrade of the F-35A to be fielded by the 2035 target date of the Air Force Future Operating Concept.\n\nOperators\n\nF-35A\n\n;\n* Royal Australian Air Force – 2 delivered, 70 on order, up to 28 additional planned\n;\n* Royal Danish Air Force – 27 planned\n\n;\n* Israeli Air Force – 9 delivered and operational (F-35I). 50 ordered in total, from a total of 75 planned for the near future.[http://www.inss.org.il/publication/adir-in-the-sky-the-f-35-arrives-in-israel “Adir” in the Sky: The F-35 Arrives in Israel] INSS Insight No. 875, December 12, 2016.\n** 140 Squadron[http://www.israelnationalnews.com/News/News.aspx/220903 Israel ups stealth fighter purchase to 50 planes] Arutz Sheva Staff, 27/11/16\n;\n* Italian Air Force – 8 operational and 1 on delivery, 2 more on order with 17 more ordered for delivery up to 2019;http://www.corteconti.it/export/sites/portalecdc/_documenti/controllo/sezioni_riunite/sezioni_riunite_in_sede_di_controllo/2017/parifica_2016_volume_II_2016.pdf. Retrieved 15 September 2017. up to 60 total planned.[https://www.flightglobal.com/news/articles/italy-claims-first-f-35-transatlantic-crossing-421670/ Italy claims first F-35 transatlantic crossing], Flightglobal. Retrieved 7 April 2016.\n** 32º Stormo\n;\n* Japan Air Self-Defense Force – 5 on order; 37 additional planned of which 38 to be built by Mitsubishi.[http://www.lockheedmartin.com/us/news/press-releases/2016/september/lockheed-martin-and-japan-celebrate-roll-out-of-japan-air-self-defense-force-first-f-35a.html Lockheed Martin and Japan Celebrate Roll Out of Japan Air Self Defense Force’s First F-35A], retrieved 29 September 2016\n\n;\n* Royal Netherlands Air Force – 2 in use for testing, 8 on order, 27 additional planned\n** 323 Squadron\n;\n* Royal Norwegian Air Force – 7 operational and used for training of Norwegian pilots in the US, 3 delivered to Norway for testing and integration, with 45 additional planned\n;\n* Republic of Korea Air Force – 40 ordered A further 20 were ordered in December 2017.\n;\n* Turkish Air Force – 14 on order, up to 120 total plannedBURAK EGE BEKDIL. \"[http://webarchive.loc.gov/all/20140507162858/http://www.defensenews.com/article/20140507/DEFREG01/305070036/Turkey-Orders-First-Two-F-35s Turkey Orders First Two F-35s]\" DefenseNews, 7 May 2014. Accessed: 10 May 2014.[https://www.haaretz.com/middle-east-news/turkey/1.749708 \"Turkey Plans More F-35 Orders After Receiving First Batch in 2018\"]\n;\n* United States Air Force – 1,763 planned\n** 33d Fighter Wing AETC – Eglin AFB, Florida\n*** 58th Fighter Squadron\n** 53d Wing, ACC - Eglin AFB, Florida\n*** 31st Test and Evaluation Squadron – Edwards AFB, California (53d Test and Evaluation Group)\n*** 422d Test and Evaluation Squadron – Nellis AFB, Nevada (53d Test and Evaluation Group)\n** 56th Fighter Wing AETC – Luke AFB, Arizona\n*** 61st Fighter Squadron\n*** 62d Fighter Squadron\n*** 63d Fighter Squadron\n** 388th Fighter Wing ACC – Hill AFB, Utah\n*** 4th Fighter Squadron\n*** 34th Fighter Squadron\n*** 421st Fighter Squadron\n** 412th Test Wing AMC – Edwards AFB, California\n*** 461st Flight Test Squadron\n** 419th Fighter Wing AFRC – Hill AFB, Utah\n*** 466th Fighter Squadron\n\nF-35B\n\n;\n* Italian Air Force – 15 planned\n* Italian Navy – 15 planned[http://archive.defensenews.com/article/20120515/DEFREG01/305150010/Italian-AF-Navy-Head-F-35B-Showdown Italian AF, Navy Head for F-35B Showdown] , defensenews.com. Retrieved 10 February 2015. of which 1 delivered with 4 on order for delivery by 2019.\n; – \n* Royal Air Force\n** 17 Squadron (test and evaluation)\n** 207 Squadron (Operational Conversion Unit)\n** 617 Squadron\n** Unspecified squadron\n* Royal Navy\n** 809 Naval Air Squadron[http://www.royalnavy.mod.uk/News-and-Events/Latest-News/2013/September/09/130909-809-Air-Squadron 'Immortal’ air squadron to fly Royal Navy’s newest jets], royalnavy.mod.uk. Retrieved 31 May 2015.\n** Unspecified squadron\n;\n* United States Marine Corps – 340 planned\n** VMX-1 – Edwards AFB, California\n** VMFA-121 – MCAS Iwakuni, Japan\n** VMFA-122 – MCAS Yuma, Arizona\n** VMFA-211 – MCAS Yuma, Arizona\n** VMFAT-501 – MCAS Beaufort, South Carolina\n\nF-35C\n\n;\n* United States Marine Corps – 80 planned\n** VFA-101 – Eglin AFB, Florida (Navy squadron, but trains both Navy and Marine F-35C pilots, and operates Navy and Marine F-35Cs maintained by both sailors and Marines. This is the same arrangement as other aircraft common to the Navy and Marine Corps.)\n* United States Navy – 260 planned\n** VX-9 – Edwards AFB, California\n** VX-23 – NAS Patuxent River, Maryland\n** VFA-101 – Eglin AFB, Florida\n** VFA-125 – NAS Lemoore, California\n\nAccidents\n\nOn 23 June 2014, an F-35A preparing to take off on a training flight at Eglin Air Force Base experienced a fire in the engine area. The pilot escaped unharmed. The accident caused all training to be halted on 25 June, and all flights halted on 3 July. During the incident investigation, engine parts from the burned aircraft were discovered on the runway, indicating it was a substantial engine failure. The fleet was returned to flight on 15 July with restrictions in the flight envelope. Preliminary findings suggests that excessive rubbing of the engine fan blades created increased stress and wear and eventually resulted in catastrophic failure of the fan.\n\nIn early June 2015, the USAF Air Education and Training Command (AETC) issued its official report on the incident. It found that the incident was the result of a failure of the third stage rotor of the engine's fan module. The report explained that \"pieces of the failed rotor arm cut through the engine's fan case, the engine bay, an internal fuel tank, and hydraulic and fuel lines before exiting through the aircraft's upper fuselage\". Pratt & Whitney, the engine manufacturer, developed two remedies to the problem. The first is an extended \"rub-in\" to increase the gap between the second stator and the third rotor integral arm seal. The second is the redesign to pre-trench the stator. Both were scheduled for completion by early 2016. Cost of the problem was estimated at US$50 million. All aircraft resumed operations within 25 days of the incident.\n\nSpecifications (F-35A)\n\nAppearances in media",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lockheed Martin F-35 Lightning II" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11812" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Lockheed Martin F-35 Lightning II is a family of single-seat, single-engine, all-weather stealth multirole fighters. The fifth-generation combat aircraft is designed to perform ground attack and air superiority missions.  It has three main models: the F-35A conventional takeoff and landing (CTOL) variant, the F-35B short take-off and vertical-landing (STOVL) variant, and the F-35C carrier-based Catapult Assisted Take-Off But Arrested Recovery (CATOBAR) variant.  On 31 July 2015, the United States Marines declared ready for deployment the first squadron of F-35B fighters  after intensive testing. On 2 August 2016, the U.S. Air Force declared its first squadron of F-35A fighters combat-ready.\n\nThe F-35 descends from the X-35, the winning design of the Joint Strike Fighter (JSF) program.  An aerospace industry team led by Lockheed Martin designed and manufactures it.  Other major F-35 industry partners include Northrop Grumman, Pratt & Whitney and BAE Systems.  The F-35 first flew on 15 December 2006. The United States plans to buy 2,663 aircraft.  Its variants are to provide the bulk of the crewed tactical airpower of the U.S. Air Force, Navy and the Marine Corps over the coming decades. Deliveries of the F-35 for the U.S. military are scheduled until 2037 with a projected service life up to 2070.[https://www.flightglobal.com/news/articles/lockheed-f-35-service-life-extended-to-2070-423536/ Lockheed F-35 service life extended to 2070] – Flightglobal.com, 25 March 2016\n\nThe United States principally funds the F-35 JSF development, with additional funding from partners. The partner nations are either NATO members or close U.S. allies. The United Kingdom, Italy, Australia, Canada, Norway, Denmark, the Netherlands, and Turkey are part of the active development program;[http://www.lockheedmartin.com/us/products/f35/global-partnerships.html \"F-35 Global Partnerships\"].  Lockheed Martin. Retrieved: 31 October 2012.Dudley, Richard. [http://defense-update.com/20120305_program-partners-confirm-support-for-f-35-joint-strike-fighter.html \"Program Partners Confirm Support for F-35 Joint Strike Fighter\"]. Defence Update, 5 March 2012. Retrieved: 18 March 2012. several additional countries have ordered, or are considering ordering, the F-35.\n\nThe program is the most expensive military weapons system in history, and has been much criticized inside and outside government, in the U.S. and in allied countries.  Critics argue that the plane is \"plagued with design flaws\", with many blaming the procurement process in which Lockheed was allowed \"to design, test, and produce the F-35 all at the same time, instead of… [identifying and fixing] defects before firing up its production line\". By 2014, the program was \"$163 billion over budget [and] seven years behind schedule\". Critics also contend that the program's high sunk costs and political momentum make it \"too big to kill\".\n\nDevelopment\n\nF-35 development started in 1992 with the origins of the Joint Strike Fighter program and is set to culminate in full production in 2018.[http://www.westdef.com/presentations/2013presentations/Keith_Knotts.pdf F-35 Program Information – Non Export Controlled Information] Keith P. Knotts, 9 July 2013 The X-35 first flew on 24 October 2000 and the F-35A on 15 December 2006. The F-35 was developed to replace most US fighter jets with variants of one design common to all branches of the military. It was developed in cooperation with a number of foreign partners, and unlike the F-22 Raptor, intended to be available for export. Three variants were designed: the F-35A (conventional take off and landing, CTOL), the F-35B (short-take off and vertical-landing, STOVL), and the F-35C (carrier-based CATOBAR). Despite being intended to share most of their parts to reduce costs and improve maintenance logistics, by 2017 the design commonality was only 20%.. The program received considerable criticism for cost overruns during development and for the total projected cost of the program over the lifetime of the jets. By 2017 the program was expected over its lifetime (until 2070) to cost $406.5 billion for acquisition of the jets and $1.1 trillion for operations and maintenance. A number of design deficiencies were alleged, such as carrying a small internal payload, inferior performance to the aircraft being replaced particularly the F-16, and the lack of safety in relying on a single engine, and flaws were noted such as vulnerability of the fuel tank to fire and the propensity for transonic roll-off (TRO or \"wing drop\"). The possible obsolescence of stealth technology was also criticized.\n\nDesign\n\nOverview\n\nThe F-35 closely resembles a smaller, single engine Lockheed Martin F-22 Raptor, drawing design elements from its twin-engine sibling. The exhaust duct design was inspired by the General Dynamics Model 200, proposed for a 1972 supersonic VTOL fighter requirement for the Sea Control Ship.\"Vertiflight\". Journal of the American Helicopter Society, January 2004. Although several experimental designs have been developed since the 1960s, such as the unsuccessful Rockwell XFV-12, the F-35B is to be the first operational supersonic, STOVL stealth fighter.Kent, John R. and Chris Geisel. \"F-35 STOVL supersonic\". lockheedmartin.com. Retrieved 16 November 2010.\n\nAcquisition deputy to the assistant secretary of the Air Force, Lt. Gen. Mark D. \"Shack\" Shackelford has said that the F-35 is designed to be America's \"premier surface-to-air missile killer and is uniquely equipped for this mission with cutting edge processing power, synthetic aperture radar integration techniques, and advanced target recognition\".Johns, Darnell Sharkleford. \"Air Force presentation to House Subcommittee on Air and Land Forces\". armedservices.house.gov, 20 May 2009, p. 10.Amaani, USAF Tech. Sgt. Lyle. [http://www.af.mil/News/ArticleDisplay/tabid/223/Article/120743/air-force-takes-combat-air-acquisitions-priorities-to-hill.aspx \"Air Force takes combat air acquisitions priorities to Hill\"]. U.S. Air Force, 3 April 2009. Lockheed Martin states the F-35 is intended to have close- and long-range air-to-air capability second only to that of the F-22 Raptor.[https://web.archive.org/web/20100724021638/http://www.lockheedmartin.com/products/f35/f-35-capabilities.html \"Capabilities\". (archived version)] Lockheed Martin. Retrieved 24 July 2010. Lockheed Martin has said that the F-35 has the advantage over the F-22 in basing flexibility and \"advanced sensors and information fusion\".[http://www.f35.com/the-f-35/faqs.aspx \"LockMart F-35 FAQ\"]. Lockheed Martin, 2011. Lockheed Martin has suggested that the F-35 could replace the USAF's F-15C/D fighters in the air superiority role and the F-15E Strike Eagle in the ground attack role.Trimble, Stephen. [http://www.flightglobal.com/articles/2010/02/04/338045/lockheed-martin-sees-f-35a-replacing-usaf-air-superiority.html \"Lockheed Martin sees F-35A replacing USAF air superiority F-15C/Ds\"].  Flight International, 4 February 2010. Retrieved 2 March 2010.\n\nSome improvements over current-generation fighter aircraft are:\n* Durable, low-maintenance stealth technology, using structural fiber mat instead of the high-maintenance coatings of legacy stealth platforms;\n* Integrated avionics and sensor fusion that combine information from off- and on-board sensors to increase the pilot's situational awareness and improve target identification and weapon delivery, and to relay information quickly to other command and control (C2) nodesL3 (March 2011), [http://www2.l-3com.com/displays/pdfs/redesign/ICP(2011)_LR.pdf Open System Architecture (OSA) Secure Processing]\n* High speed data networking including IEEE 1394bPhilips, E. H. \"The Electric Jet\". Aviation Week & Space Technology, 5 February 2007. and Fibre Channel.Parker, Ian. [http://www.aviationtoday.com/av/categories/military/11667.html \"Reducing Risk on the Joint Strike Fighter\"]. Avionics Magazine, Access Intelligence, LLC, 1 June 2007. Retrieved 8 June 2007. (Fibre Channel is also used on Boeing's Super Hornet.[http://www.boeing.com/defense-space/military/fa18ef/index.htm \"F/A-18E/F Super Hornet\"]. Boeing.)\n* The Autonomic Logistics Global Sustainment (ALGS), Autonomic Logistics Information System (ALIS), and Computerized maintenance management system (CMMS) are to help ensure the aircraft can remain operational with minimal maintenance manpower.Giese, Jack. [http://www.lockheedmartin.com/us/news/press-releases/2009/october/F-35BringsUnique5thGenera.html \"F-35 Brings Unique 5th Generation Capabilities\"]. lockheedmartin.com, 23 October 2009. The Pentagon has moved to open up the competitive bidding by other companies.Shalal-Esa, Andrea. [http://www.chicagotribune.com/news/sns-rt-us-lockheed-fighterbre88r1k1-20120928,0,519683.story \"Pentagon seeks competition for sustainment of Lockheed F-35\"]. Reuters, 28 September 2012. This was after Lockheed Martin stated that instead of costing twenty percent less than the F-16 per flight hour, the F-35 would actually cost twelve percent more.Sweetman, Bill. [http://www.aviationweek.com/Blogs.aspx?plckBlogIdBlog:27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostId\nBlog%3A27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3A7d4840f7-616f-4279-a3ae-ece678980c57 \"Wrongheaded? Really?\"]  Aviation Week, 18 October 2012. Though the ALGS is intended to reduce maintenance costs, the company disagrees with including the cost of this system in the aircraft ownership calculations.[http://www.aviationweek.com/Blogs.aspx?plckBlogIdBlog:27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostId\nBlog%3a27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3a295628f9-5afc-45a1-a7e9-d8b429e5ab99 \"F-35 Cost Per Flying Hour: A Tale of Two Numbers\"].  The USMC have implemented a workaround for a cyber vulnerability in the system.Majumdar, Dave. [http://www.flightglobal.com/news/articles/usmc-finds-workaround-for-cyber-vulnerability-on-f-35-logistics-system-379272/ \"USMC finds workaround for cyber vulnerability on F-35 logistics system\"]. Flight International, 20 November 2012. The ALIS system currently requires a shipping container load of servers to run, but Lockheed is working on a more portable version to support the Marines' expeditionary operations.\n* Electro-hydrostatic actuators run by a power-by-wire flight-control system.Trimble, Stephen. [https://www.flightglobal.com/news/articles/farnborough-lockheed-encouraged-by-pace-of-f-35-tes-343782/ \"Farnborough: Lockheed encouraged by pace of F-35 testing\"]. Flight International, 12 July 2010. Retrieved 22 July 2010.\n* A modern and updated flight simulator, which may be used for a greater fraction of pilot training in order to reduce the costly flight hours of the actual aircraft.\n* Lightweight, powerful Lithium-ion batteries to provide power to run the control surfaces in an emergency.\n\nStructural composites in the F-35 are 35% of the airframe weight (up from 25% in the F-22). The majority of these are bismaleimide (BMI) and composite epoxy material.[http://www.onlineamd.com/aerospace-manufacturing-design-Vector-Composites-Quicksteps-amd-051710.aspx \"Contract Awarded To Validate Process For JSF\"]. onlineamd.com,  17 May 2010. Retrieved 22 July 2010. The F-35 will be the first mass-produced aircraft to include structural nanocomposites, namely carbon nanotube reinforced epoxy.Trimble, Stephen. [http://www.flightglobal.com/articles/2011/05/26/357223/lockheed-martin-reveals-f-35-to-feature-nanocomposite.html \"Lockheed Martin reveals F-35 to feature nanocomposite structures\"].  Flight International, 26 May 2011. Experience of the F-22's problems with corrosion led to the F-35 using a gap filler that causes less galvanic corrosion to the airframe's skin, designed with fewer gaps requiring filler and implementing better drainage.Edwards, Jack E. [http://www.gao.gov/new.items/d11171r.pdf \"Defense Management: DOD Needs to Monitor and Assess Corrective Actions Resulting from Its Corrosion Study of the F-35 Joint Strike Fighter\"]. United States Government Accountability Office, Washington, DC, 16 December 2010. The relatively short 35-foot wingspan of the A and B variants is set by the F-35B's requirement to fit inside the Navy's current amphibious assault ship parking areaRyberg, Eric S. \"[http://www.dtic.mil/dtic/tr/fulltext/u2/a399988.pdf The Influence of Ship Configuration on the Design of the Joint Strike Fighter]\", p. 5. Naval Surface Warfare Center Dahlgren Division, 26 February 2002. Accessed: 1 December 2013. and elevators; the F-35C's longer wing is considered to be more fuel efficient.\n\nA United States Navy study found that the F-35 will cost 30 to 40 percent more to maintain than current jet fighters;Clark, Colin. [http://www.dodbuzz.com/2011/01/27/af-worries-jsf-costs-may-soar/ \"AF Worries JSF Costs May Soar\"]. DoD Buzz 27 January 2011. not accounting for inflation over the F-35's operational lifetime. A Pentagon study concluded a $1 trillion maintenance cost for the entire fleet over its lifespan, not accounting for inflation.Capaccio, Tony. [http://www.businessweek.com/news/2011-04-21/lockheed-martin-f-35-operating-costs-may-reach-1-trillion.html \"Lockheed Martin F-35 Operating Costs May Reach $1 Trillion\"].  Bloomberg News, 21 April 2011. The F-35 program office found that as of January 2014, costs for the F-35 fleet over a 53-year life cycle was $857 billion.  Costs for the fighter have been dropping and accounted for the 22 percent life cycle drop since 2010. Lockheed stated that by 2019, pricing for the fifth-generation aircraft will be less than fourth-generation fighters.  An F-35A in 2019 is expected to cost $85 million per unit complete with engines and full mission systems, inflation adjusted from $75 million in December 2013.\n\nEngines\n\nThe Pratt & Whitney F135 powers the F-35. An alternative engine, the General Electric/Rolls-Royce F136, was being developed until it was cancelled by its manufacturers in December 2011 for lack of funding from the Pentagon.Trimble, Stephen. [http://www.flightglobal.com/articles/2009/06/11/327771/rolls-royce-f136-survival-is-key-for-major-f-35-engine.html \"Rolls-Royce: F136 survival is key for major F-35 engine upgrade\"].  Flight International, 11 June 2009.[https://archive.is/20120729014307/http://www.defensenews.com/story.php?i8450963&c\nAME&sAIR \"GE, Rolls Royce Stop Funding F-35 Alt Engine\"]. Defense News, 4 December 2011. The F135 and F136 engines are not designed to supercruise.[http://www.jsf.mil/contact/con_faqs.htm \"Frequently Asked Questions about JSF\"]. JSF. Retrieved 6 April 2010. However, the F-35 can briefly fly at Mach 1.2 for 150 miles without the use of an afterburner. The F135 is the second (radar) stealthy afterburning jet engine. Like the Pratt & Whitney F119 from which it was derived, the F135 has suffered afterburner pressure pulsations, or 'screech' at low altitude and high speed.Warwick, Graham. [http://www.aviationweek.com/aw/blogs/defense/index.jsp?plckController\nBlog&plckBlogPageBlogViewPosto&newspaperUserId\n27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostIdBlog%3a27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3a261f21c4-19ea-40e0-a756-ed0491972939&plckScript\nblogScript&plckElementIdblogDest \"Screech, the F135 and the JSF Engine War\"]. Aviation Week, 17 March 2011. The F-35 has a maximum speed of over Mach 1.6. With a maximum takeoff weight of 60,000 lb (27,000 kg), the Lightning II is considerably heavier than the lightweight fighters it replaces.\n\nThe STOVL F-35B is outfitted with the Rolls-Royce LiftSystem, designed by Lockheed Martin and developed by Rolls-Royce. This system more resembles the German VJ 101D/E than the preceding STOVL Harrier Jump Jet and the Rolls-Royce Pegasus engine.\"Swivel nozzle VJ101D and VJ101E\". Vstol.org, 20 June 2009.Hirschberg, Mike. \"[http://www.robertcmason.com/textdocs/GermanVSTOLFighters.pdf \"V/STOL Fighter Programs in Germany: 1956–1975\"], p. 50. International Powered Lift Conference, 1 November 2000. Retrieved 3 October 2012.[http://www.harrier.org.uk/technical/How_Hovers.htm \"How the Harrier hovers\"] . harrier.org. Retrieved 16 November 2010. The Lift System is composed of a lift fan, drive shaft, two roll posts and a \"Three Bearing Swivel Module\" (3BSM).[http://www.rolls-royce.com/defence/products/combat_jets/rr_liftsystem.jsp \"LiftSystem\"]. Rolls-Royce. Retrieved 23 November 2009. The 3BSM is a thrust vectoring nozzle which allows the main engine exhaust to be deflected downward at the tail of the aircraft. The lift fan is near the front of the aircraft and provides a counterbalancing thrust using two counter-rotating blisks.Zolfagharifard, Ellie. [http://www.theengineer.co.uk/in-depth/rolls-royces-liftsystem-for-the-joint-strike-fighter/1008008.article \"Rolls-Royce's LiftSystem for the Joint Strike Fighter\"] The Engineer, 28 March 2011. It is powered by the engine's low-pressure (LP) turbine via a drive shaft and gearbox. Roll control during slow flight is achieved by diverting unheated engine bypass air through wing-mounted thrust nozzles called Roll Posts.Kjelgaard, Chris. [http://www.space.com/businesstechnology/071221-how-f-35b-stovl-propulsion-system-works.html \"From Supersonic to Hover: How the F-35 Flies\"]. Space, 21 December 2007. Retrieved 18 October 2010.Hutchinson, John. [http://www.ingenia.org.uk/ingenia/issues/issue20/hutchinson.pdf \"Going Vertical: Developing a STOVL system\"]. ingenia.org.uk. Retrieved 23 November 2009.\n\nF136 funding came at the expense of other program elements, impacting on unit costs.Warwick, Graham. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channeldefense&id\nnews/SECOND052909.xml \"Second Engine Could Cut F-35 Production\"]. Aviation Week. Retrieved 6 April 2010.  The F136 team stated their engine had a greater temperature margin, potentially critical for VTOL operations in hot, high altitude conditions.\"GE Rolls-Royce Fighter Engine Team completes study for Netherlands\". rolls-royce.com. Retrieved 23 November 2009. Pratt & Whitney tested higher thrust versions of the F135, partly in response to GE's statements that the F136 is capable of producing more thrust than the 43000 lbf of early F135s. In testing, the F135 has demonstrated a maximum thrust of over 50000 lbf;[https://web.archive.org/web/20101226060817/http://www.aviationweek.com/aw/generic/story_generic.jsp?channel\ndefense&idnews%2Fasd%2F2010%2F08%2F27%2F01.xml&headline\nPratt \"Pratt Raises Stakes In JSF Engine Battle\"]. Aviation Week, 27 August 2010. Retrieved 25 November 2010. making it the most powerful engine ever installed in a fighter aircraft as of 2010.\"Lockheed Martin F-35 Joint Strike Fighter Succeeds In First Vertical Landing\". lockheedmartin.com, Press Release, 18 March 2010. It is much heavier than previous fighter engines; the Heavy Underway Replenishment system needed to transfer the F135 between ships is an unfunded USN requirement. Thermoelectric-powered sensors monitor turbine bearing health.Swedberg, Claire. [http://www.rfidjournal.com/article/articleview/8478/1/1/ \"Energy-Harvesting Sensors to Monitor Health of Jet Engines\"]. RFID Journal, 31 May 2011.  At the end of May 2017 Pratt and Whitney announced the F135 Growth Option 1 had finished testing and was available for production.  The upgrade requires the changing of the power module on older engines and can be seamlessly inserted into future production engines at a minimal increase in unit cost and no impact to delivery schedule.  The Growth Option 1 offers a improvement of 6–10% thrust across the F-35 flight envelope while also getting a 5–6% fuel burn reduction.\n\nArmament\n\nThe F-35A is armed with a GAU-22/A, a four-barrel version of the 25 mm GAU-12 Equalizer cannon.[http://www.gdatp.com/Products/Gun_Systems/Aircraft/F-35.asp \"F-35 gun system\"] , [http://www.gdatp.com/files/PDF/A118_GAU22.pdf \"GAU-22/A\"] . General Dynamics Armament and Technical Products. Retrieved 7 April 2011. The cannon is mounted internally with 182 rounds for the F-35A or in an external pod with 220 rounds for the F-35B and F-35C;[http://www.jsf.mil/downloads/mediakits/7764.zip \"F-35 Joint Strike Fighter Media Kit Statistics\"]. JSF.mil August 2004.Keijsper 2007, p. 233. the gun pod has stealth features. Software updates to enable operational firing of the cannon are expected to be completed by 2018.  The F-35 has two internal weapons bays, and external hardpoints for mounting up to four underwing pylons and two near wingtip pylons. The two outer hardpoints can carry pylons for the AIM-9X Sidewinder and AIM-132 ASRAAM short-range air-to-air missiles (AAM) only.Hewson, Robert. [http://www.janes.com/products/janes/defence-security-report.aspx?ID\n1065928225 \"UK changes JSF configuration for ASRAAM\"]. Jane's, 4 March 2008.  The other pylons can carry the AIM-120 AMRAAM BVR AAM, AGM-158 Joint Air to Surface Stand-off Missile (JASSM) cruise missile, and guided bombs. The external pylons can carry missiles, bombs, and external fuel tanks at the expense of increased radar cross-section, and thus reduced stealth.Keijsper 2007, pp. 220, 239.\n\nThere are a total of four weapons stations between the two internal bays. Two of these can carry air-to-surface missiles or bombs up to 2000 lb each in the A and C models, or air-to-surface missiles or bombs up to 1000 lb each in the B model; the other two stations are for smaller weapons such as air-to-air missiles.Davis, Brigadier General Charles R. [http://www.jsf.mil/downloads/documents/AFA_Conf_-_JSF_Program_Brief_-_26_Sept_06.pdf \"F-35 Program Brief\"]. USAF, 26 September 2006.[http://es.is.itt.com/JSF%20Suite.htm \"JSF Suite: BRU-67, BRU-68, LAU-147 – Carriage Systems: Pneumatic Actuated, Single Carriage\"]. es.is.itt.com, 2009. The weapon bays can carry AIM-120 AMRAAM, AIM-132 ASRAAM, the Joint Direct Attack Munition (JDAM), Paveway series of bombs, the Joint Standoff Weapon (JSOW), Brimstone anti-tank missiles, and cluster munitions (Wind Corrected Munitions Dispenser).  An air-to-air missile load of eight AIM-120s and two AIM-9s is possible using internal and external weapons stations; a configuration of six 2000 lb bombs, two AIM-120s and two AIM-9s can also be arranged.Digger, Davis. [http://www.dtic.mil/ndia/2007targets/Day1/Davisday1.pdf \"JSF Range & Airspace Requirements\"] . Headquarters Air Combat Command, Defense Technical Information Center, 30 October 2007.  The Terma A/S multi-mission pod (MMP) could be used for different equipment and purposes, such as electronic warfare, aerial reconnaissance, or rear-facing tactical radar.Donald, David. [http://www.ainonline.com/aviation-news/defense/2012-07-11/terma-highlights-f-35-multi-mission-pod \"Terma Highlights F-35 Multi-Mission Pod\"]. AINonline, 11 July 2012. The British Ministry of Defence plan to fire the Select Precision Effects at Range (SPEAR) Capability 3 missile from the internal bays of the F-35B, with four missiles per bay.\n\nLockheed Martin states that the weapons load can be configured as all-air-to-ground or all-air-to-air, and has suggested that a Block 5 version will carry three weapons per bay instead of two, replacing the heavy bomb with two smaller weapons such as AIM-120 AMRAAM air-to-air missiles.Lake 2010, pp. 37–45. Upgrades are to allow each weapons bay to carry four GBU-39 Small Diameter Bombs (SDB) for A and C models, or three in F-35B.[https://web.archive.org/web/20090223163759/http://www.lockheedmartin.com/products/f35/f-35-variants/f-35b-stovl-variant.html \"F-35B STOVL Variant\"]. Lockheed Martin. Retrieved 25 November 2010. Another option is four GBU-53/B Small Diameter Bomb IIs in each bay on all F-35 variants.[http://www.defense-update.com/products/s/sdb_2_25082010.html \"Small Diameter Bomb II – GBU-53/B\"]. Defense Update. Retrieved 28 August 2010. The F-35A has been outfitted with four SDB II bombs and an AMRAAM missile to test adequate bay door clearance, as well as the C-model, but the STOVL F-35B will not be able to carry the required load of four SDB IIs in each weapons bay upon reaching IOC because of weight and dimension constraints; F-35B bay changes are to be incorporated to increase SDB II loadout around 2022 in line with the Block 4 weapons suite.[http://insidedefense.com/share/167668 F-35B Internal Weapons Bay Can't Fit Required Load Of Small Diameter Bomb IIs] – Insidedefense.com, 25 February 2015 The Meteor air-to-air missile may be adapted for the F-35, a modified Meteor with smaller tailfins for the F-35 was revealed in September 2010; plans call for the carriage of four Meteors internally.Trimble, Stephen. [http://www.flightglobal.com/articles/2010/09/17/347416/picture-mbda-reveals-clipped-fin-meteor-for-f-35.html \"MBDA reveals clipped-fin Meteor for F-35\"].  Flight International, 7 November 2010. The United Kingdom planned to use up to four AIM-132 ASRAAM missiles internally, later plans call for the carriage of two internal and two external ASRAAMs.[http://www.f-16.net/news_article2762.html \"F-35 Lightning II News: ASRAAM Config Change For F-35\"]. f-16.net, 4 March 2008. The external ASRAAMs are planned to be carried on \"stealthy\" pylons; the missile allows attacks to slightly beyond visual range without employing radar.Tran, Pierre. \"MBDA Shows Off ASRAAM\". Defense News, 22 February 2008.\n\nNorway and Australia are funding an adaptation of the Naval Strike Missile (NSM) for the F-35. Under the designation Joint Strike Missile (JSM), it is to be the only cruise missile to fit the F-35's internal bays; according to studies two JSMs can be carried internally with an additional four externally.[http://www.kongsberg.com/en/KOG/News/2009/June/0906JSMAndLockheedMartin.aspx \"Important cooperative agreement with Lockheed Martin\"]. Kongsberg Defence & Aerospace, 9 June 2009. The F-35 is expected to take on the Wild Weasel mission, though there are no planned anti-radiation missiles for internal carriage.Trimble, Stephen. [http://www.flightglobal.com/articles/2010/11/04/349306/raytheon-gets-darpa-boost-for-amraam-harm-replacement.html \"Raytheon gets DARPA boost for AMRAAM, HARM replacement\"].  Flight International, 4 November 2010. The B61 nuclear bomb was initially scheduled for deployment in 2017;Reed, John. [http://www.dodbuzz.com/2011/04/06/minuteman-iii-follow-on-being-eyed-nukes-for-jsf-delayed/ \"Minuteman III Follow-On Being Eyed, Nukes for JSF Delayed\"]. DoD Buzz, 6 April 2011. as of 2012 it was expected to be in the early 2020s,Muradian, Vego. [https://web.archive.org/web/20121015151001/http://www.defensenewstv.com/video.php?bctid1897052351001 \"The Future of the U.S. Nuclear Enterprise\"]. Defense News, 14 October 2012. and in 2014 Congress moved to cut funding for the needed weapons integration work. Norton A. Schwartz agreed with the move and said that \"F-35 investment dollars should realign to the long-range strike bomber\". NATO partners who are buying the F-35 but cannot afford to make them dual-capable want the USAF to fund the conversions to allow their Lightning IIs to carry thermonuclear weapons. The USAF is trying to convince NATO partners who can afford the conversions to contribute to funding for those that cannot. The F-35 Block 4B will be able to carry two B61 nuclear bombs internally by 2024.\n\nAccording to reports in 2002, solid-state lasers were being developed as optional weapons for the F-35.Fulghum, David A. [https://web.archive.org/web/20040626050316/http://www.aviationnow.com/content/publication/awst/20020708/aw32.htm \"Lasers being developed for F-35 and AC-130\"]. Aviation Week and Space Technology, 8 July 2002.Morris, Jefferson. [https://web.archive.org/web/20040604124353/http://www.aviationnow.com/avnow/news/channel_military.jsp?viewstory&id\nnews%2Fmasd0926.xml \"Keeping cool a big challenge for JSF laser, Lockheed Martin says\"]. Aerospace Daily, 26 September 2002.Fulghum, David A. [https://web.archive.org/web/20040613094437/http://www.aviationnow.com/content/publication/awst/20020722/aw173.htm \"Lasers, HPM weapons near operational status\"]. Aviation Week and Space Technology, 22 July 2002. Lockheed is studying integrating a fiber laser onto the aircraft that uses spectral beam combining to channel energy from a stack of individual laser modules into a single, high-power beam, which can be scaled up or down for various levels of effects.  Adding a laser would give the F-35 the ability to essentially burn missiles and other aircraft out of the sky.[https://www.flightglobal.com/news/articles/lockheed-considering-laser-weapon-concepts-for-f-35-417416/ Lockheed considering laser weapon concepts for F-35] – Flightglobal.com, 5 October 2015 The F-35 is also one of the target platforms for the High Speed Strike Weapon if hypersonic missile development is successful.\n\nThe Air Force plans to use the F-35A to primarily take up the close air support (CAS) mission in contested environments.  Amid criticism that the aircraft is not well suited for the role compared to a dedicated attack platform, Air Force chief of staff Mark Welsh is putting focus on weapons for the F-35 to employ on CAS sorties including guided rockets, fragmentation rockets that would shatter into individual projectiles before impact, and lighter, smaller ammunition in higher capacity gun pods.[http://www.flightglobal.com/news/articles/usaf-chief-keeps-sights-on-close-air-support-mission-409070/ USAF chief keeps sights on close air support mission] – Flightglobal.com, 15 February 2015 Fragmentary rocket warheads would have greater effects than cannon shells fired from a gun because a single rocket would create a \"thousand-round burst\", delivering more projectiles than a strafing run could.  Other weapons could take advantage of the aircraft's helmet-mounted cueing system to aim rather than needing to point the nose at a target.[http://aviationweek.com/defense/long-road-ahead-possible-10-follow Long Road Ahead For Possible A-10 Follow-On] – Aviationweek.com, 24 March 2015 Institute for the Study of War's Christopher Harmer has questioned the use of such an expensive aircraft for CAS.\n\nStealth and signatures\n\nRadar \n\nThe F-35 has been designed to have a low radar cross-section that is primarily due to the shape of the aircraft and the use of stealthy, radar-absorbent materials in its construction, including fiber-mat.Butler, Amy. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channel\ndefense&idnews/asd/2010/05/17/10.xml&headline\nNew%20Stealth%20Concept%20Could%20Affect%20JSF%20Cost \"New Stealth Concept Could Affect JSF Cost\"]. Aviation Week, 17 May 2010. Retrieved 5 June 2010.  Unlike the previous generation of fighters, the F-35 was designed for very-low-observable characteristics.[http://www.globalsecurity.org/military/systems/aircraft/f-35-design.htm \"F-35 Joint Strike Fighter (JSF) Lightning II\"]. GlobalSecurity.org. Retrieved 16 November 2010. Besides radar stealth measures, the F-35 incorporates infrared signature and visual signature reduction measures.[http://www.dote.osd.mil/pub/reports/FY2000/airforce/00jsf.html \"USAF FY00 activity on the JSF\"].  U.S. Director, Operational Test & Evaluation. Retrieved: 17 l 2012.[http://www.regjeringen.no/upload/FD/Temadokumenter/JSF_RBI-svar.pdf \"F-35 Norwegian Executive Summary\"].  Lockheed Martin, April 2008.\n\nThe Fighter Teen Series (F-14, F-15, F-16, F/A-18) carried large external fuel tanks, but to avoid negating its stealth characteristics the F-35 must fly most missions without them. Unlike the F-16 and F/A-18, the F-35 lacks leading edge extensions and instead uses stealth-friendly chines for vortex lift in the same fashion as the SR-71 Blackbird.Bolsøy, Bjørnar. [http://www.f-16.net/news_article3837.html \"F-35 Lightning II status and future prospects\"]. f-16.net, 17 September 2009. Retrieved 23 November 2009. The small bumps just forward of the engine air intakes form part of the diverterless supersonic inlet (DSI) which is a simpler, lighter means to ensure high-quality airflow to the engine over a wide range of conditions. These inlets also crucially improve the aircraft's very-low-observable characteristics (by eliminating radar reflections between the diverter and the aircraft's skin).Hehs, Eric. [http://www.codeonemagazine.com/article.html?item_id\n58 \"JSF Diverterless Supersonic Inlet\"]. Code One Magazine. Retrieved 28 December 2012. Additionally, the \"bump\" surface reduces the engine's exposure to radar, significantly reducing a strong source of radar reflection[http://aviationintel.com/2012/10/22/fast-history-lockheeds-diverterless-supersonic-inlet-testbed-f-16/ \"Fast History: Lockheed's Diverterless Supersonic Inlet Testbed F-16\"]  aviationintel.com, 13 January 2013 because they provide an additional shielding of engine fans against radar waves. The Y-duct type air intake ramps also help in reducing radar cross-section (RCS), because the intakes run parallel and not directly into the engine fans.\n\nThe F-35's radar-absorbent materials are designed to be more durable and less maintenance-intensive than those of its predecessors. At optimal frequencies, the F-35 compares favorably to the F-22 in stealth, according to General Mike Hostage, Commander of the Air Combat Command.Clark, Colin. [http://breakingdefense.com/2014/06/gen-mike-hostage-on-the-f-35-no-growlers-needed-when-war-starts/3/] Breaking Defense, 6 June 2014. Like other stealth fighters, however, the F-35 is more susceptible to detection by low-frequency radars because of the Rayleigh scattering resulting from the aircraft's physical size. However, such radars are also conspicuous, susceptible to clutter, and have low precision.Ralston, J; Heagy, J; et al. [http://www.dtic.mil/dtic/tr/fulltext/u2/a359931.pdf \"Environmental/Noise Effects on UHF/VHF UWB SAR\".] dtic.mil, September 1998. Retrieved: 2 January 2015.Plopsky, Guy and Fabrizio Bozzato. [http://thediplomat.com/2014/08/the-f-35-vs-the-vhf-threat/ \"The F-35 vs. The VHF Threat\"]. The Diplomat, 21 August 2014. Although fighter-sized stealth aircraft could be detected by low-frequency radar, missile lock and targeting sensors primarily operate in the X-band, which F-35 RCS reduction is made for, so they cannot engage unless at close range.[http://defense-update.com/20150614_f35_beyond_stealth.html#.VYisUsIw8dU F-35 – Beyond Stealth] – Defense-Update.com, 14 June 2015 Because the aircraft's shape is important to the RCS, special care must be taken to match the \"boilerplate\" during production.Capaccio, Tony. [https://www.bloomberg.com/news/2011-05-04/lockheed-martin-s-f-35-fighter-jet-passes-initial-stealth-hurdle.html \"Lockheed Martin’s F-35 Fighter Jet Passes Initial Stealth Hurdle\"]. Bloomberg News, 4 May 2011. Ground crews require Repair Verification Radar (RVR) test sets to verify the RCS after performing repairs, which is not a concern for non-stealth aircraft.Brewer, Jeffrey and Shawn Meadows. [http://www.dtic.mil/cgi-bin/GetTRDoc?LocationU2&doc\nGetTRDoc.pdf&AD=ADA529057 \"Survivability of the Next Strike Fighter\", p. 23.] Aircraft Survivability: Susceptibility Reduction via Joint Aircraft Survivability Program Office (JASPO), Summer 2006.\n\nAcoustics \n\nIn 2008, the Air Force revealed that the F-35 would be about twice as loud as the McDonnell Douglas F-15 Eagle at takeoff and up to four times as loud during landing.Alaimo, Carol Ann. [http://azstarnet.com/news/local/article_b8e6b612-1751-5554-8819-166f110f0f24.html \"Noisy F-35 Still Without A Home\"]. Arizona Daily Star, 30 November 2008. Retrieved 23 November 2009. Residents near Luke Air Force Base, Arizona, and Eglin Air Force Base, Florida, possible F-35 bases, requested environmental impact studies be conducted regarding the F-35's noise levels. In 2009, the city of Valparaiso, Florida, adjacent to Eglin AFB, threatened to sue over the impending F-35 arrival; this lawsuit was settled in March 2010.Moore, Mona. \"Val-P to sue the Air Force\". Northwest Florida Daily News, 19 February 2009, Volume 63, Number 20, p. A1.Barlow, Kari C. [http://www.thedestinlog.com/news/legal-28112-nwfdn-fees-okaloosa.html \"Val-p wants Okaloosa to reimburse F-35 legal fees\"]. thedestinlog.com, 16 April 2010. Nicholson, Brendan. [http://www.theaustralian.com.au/national-affairs/noise-triggers-legal-bid-to-down-jet-fighter/story-fn59niix-1226037459254 \"Noise triggers legal bid to down jet fighter\"]. The Australian, 12 April 2011. In 2009, testing reportedly revealed the F-35 to be: \"only about as noisy as an F-16 fitted with a Pratt & Whitney F100-PW-200 engine ... quieter than the Lockheed Martin F-22 Raptor and the Boeing F/A-18E/F Super Hornet\".Perrett, Bradley. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channeldefense&id\nnews/F35-031209.xml \"F-35 May Need Thermal Management Changes\"]. Aviation Week, 12 March 2009. Retrieved 23 November 2009.  An acoustics study by Lockheed Martin and the Air Force found F-35's noise levels to be comparable to the F-22 and F/A-18E/F.[https://docs.google.com/viewer?av&q\ncache:0yIuRIMUDwcJ:www.f-16.net/f-16_forum_download-id-11481.html+F-35+acoustics+test&hlen&gl\nus&pidbl&srcid\nADGEESgfOwRZ9Cjk22IknVc6me97wPUsleYuw0aMTdia4Djkgx1C9hhiMOuSU_O7s1I8aaIh_NhSvO0kZlrK_05iNQvB_iCtyQWQ7d4uPEYz4oCoC6efEnxiqD1xkpsZ952kVNoAxgyE&sig=AHIEtbTRsgZXOeGUg90opGYn6e-msBU02w \"Joint Communications Release, JSF Program Office & Lockheed Martin. Subject: F-35 Acoustics Based on Edwards AFB Acoustics, Test\"]. JSF Program Office & Lockheed Martin, April 2009. Retrieved 15 January 2011. A USAF environmental impact study found that replacing F-16s with F-35s at Tucson International Airport would subject more than 21 times as many residents to extreme noise levels.Alaimo, Carol Ann. [http://azstarnet.com/news/local/noisy-f--could-affect-thousands-in-tucson-study-finds/article_38ad2ab4-c151-5ee4-ae7c-9bc81c537a54.html \"Noisy F-35 could affect thousands, study finds\"]. Arizona Daily Star, 13 June 2012. The USN will need to redesign hearing protection for sailors to protect against the \"thundering 152 decibels\" of the F-35. The Joint Strike Fighter program office found in October 2014 that the F-35B's take-off noise was only two decibels higher than a Super Hornet, a virtually indistinguishable difference to the human ear, and is even 10 decibels quieter when flying formations or landing.[http://defensetech.org/2014/11/25/f-35bs-no-louder-than-fa-18-super-hornets/ F-35Bs No Louder than F/A-18 Super Hornets] – Defensetech.org, 25 November 2014\n\nCockpit\n\nThe F-35 features a full-panel-width glass cockpit touchscreen \"panoramic cockpit display\" (PCD), with dimensions of 20 by 8 inches (50 by 20 centimeters).Goebel, Greg. [http://www.vectorsite.net/avf35.html \"The Lockheed Martin F-35 Joint Strike Fighter (JSF)\"]. vectorsite.net. Retrieved 23 November 2009.  A cockpit speech-recognition system (DVI) provided by Adacel has been adopted on the F-35 and the aircraft will be the first operational U.S. fixed-wing aircraft to employ this DVI system, although similar systems have been used on the AV-8B Harrier II and trialed in previous aircraft, such as the F-16 VISTA.Schutte, John. [http://www.afmc.af.mil/news/story.asp?id\n123071564 \"Researchers fine-tune F-35 pilot-aircraft speech system\"].  US Air Force, 10 October 2007.\n\nA helmet-mounted display system (HMDS) will be fitted to all models of the F-35.\"Joint Helmet Mounted Cueing System\". Boeing. Retrieved 23 November 2009. While some fighters have offered HMDS along with a head up display (HUD), this will be the first time in several decades that a front line fighter has been designed without a HUD.[http://www.rockwellcollins.com/news/page8813.html \"VSI's Helmet Mounted Display System flies on Joint Strike Fighter\"].  Rockwell Collins, 2007. Retrieved 8 June 2008.  The F-35 is equipped with a right-hand HOTAS side stick controller. The Martin-Baker US16E ejection seat is used in all F-35 variants.[http://www.jsf.org.uk/JSF-UK-Industry-Team/Martin-Baker.aspx \"Martin-Baker\"].  JSF. Retrieved 23 November 2009. The US16E seat design balances major performance requirements, including safe-terrain-clearance limits, pilot-load limits, and pilot size; it uses a twin-catapult system housed in side rails.\"JSF\" Martin-Baker. Retrieved 23 November 2009. This industry standard ejection seat can cause the heavier than usual helmet to inflict serious injury on lightweight pilots.\n\nThe F-35 employs an oxygen system derived from the F-22's own system, which has been involved in multiple hypoxia incidents on that aircraft; unlike the F-22, the flight profile of the F-35 is similar to other fighters that routinely use such systems.Peladeau, Jean. [http://www.lfpress.com/news/canada/2012/05/11/19748046.html \"Pilots worry about F-35 oxygen system\"]. QMI Agency, 11 May 2012.Bennett, John T. [https://www.usnews.com/news/blogs/dotmil/2012/05/24/f-22s-oxygen-issues-raise-questions-about-f-35 \"F-22's Oxygen Issues Raise Questions About F-35\"].  US News, 24 May 2012. On June 9, 2017, the 55 F-35s at Luke Air Force Base were grounded after five pilots complained of hypoxia-like symptoms over a five-week span. Symptoms ranged from dizziness to tingling in their extremities. The suspension was initially expected to last one day, but was extended to give investigators more time. Flying was resumed on 20 June, with no direct cause having been found.\n\nSensors and avionics\n\nThe F-35's sensor and communications suite has situational awareness, command and control and network-centric warfare capabilities.  The main sensor on board is the AN/APG-81 Active electronically scanned array-radar, designed by Northrop Grumman Electronic Systems.[http://www.es.northropgrumman.com/solutions/f35aesaradar/ \"APG-81 (F-35 Lightning II)\"].  Northrop Grumman Electronic Systems. Retrieved 4 August 2007.  It is augmented by the nose-mounted Electro-Optical Targeting System (EOTS),[http://www.lockheedmartin.com/products/JointStrikeFighterElectroOpticalTar/ \"Lockheed Martin Missiles and Fire Control: Joint Strike Fighter Electro-Optical Targeting System\"]. Lockheed Martin. Retrieved 11 April 2008.  it provides the capabilities of an externally mounted Sniper Advanced Targeting Pod with a reduced radar cross-section.Scott, William B. [http://www.aviationweek.com/aw/generic/story_generic.jsp?channel\nawst&id=news/10044top.xml \"Sniper Targeting Pod Attacks From Long Standoff Ranges\"]. Aviation Week, 3 October 2004. Retrieved 23 November 2009. Pappalardo, Joe. [http://www.origin.popularmechanics.com/technology/military_law/4339113.html \"How an F-35 Targets, Aims and Fires Without Being Seen\"]. Popular Mechanics, December 2009. Retrieved: 6 April 2010. The AN/ASQ-239 (Barracuda) system is an improved version of the F-22's AN/ALR-94 electronic warfare suite, providing sensor fusion of Radio frequency and Infrared tracking functions, advanced radar warning receiver including geolocation targeting of threats, multispectral image countermeasures for self-defense against missiles, situational awareness and electronic surveillance, employing 10 radio frequency antennae embedded into the edges of the wing and tail. In September 2015, Lockheed unveiled the \"Advanced EOTS\" that offers short-wave infrared, high-definition television, infrared marker, and superior image detector resolution capabilities.  Offered for the Block 4 configuration, it fits into the same area as the baseline EOTS with minimal changes while preserving stealth features.[https://www.flightglobal.com/news/articles/lockheed-reveals-advanced-eots-targeting-sensor-for-416631/ Lockheed reveals Advanced EOTS targeting sensor for F-35 Block 4] – Flightglobal.com, 10 September 2015\n\nSix additional passive infrared sensors are distributed over the aircraft as part of Northrop Grumman's electro-optical AN/AAQ-37 Distributed Aperture System (DAS),[http://www.es.northropgrumman.com/solutions/f35targeting/ \"F-35 Distributed Aperture System (EO DAS)\"]. Northrop Grumman. Retrieved 6 April 2010. which acts as a missile warning system, reports missile launch locations, detects and tracks approaching aircraft spherically around the F-35, and replaces traditional night vision devices. All DAS functions are performed simultaneously, in every direction, at all times. The electronic warfare systems are designed by BAE Systems and include Northrop Grumman components.[http://www.istockanalyst.com/article/viewnewspaged/articleid/3442641/pageid/2 \"JSF EW Suite\"].  istockanalyst.com. Retrieved 23 November 2009. Functions such as the Electro-Optical Targeting System and the electronic warfare system are not usually integrated on fighters. The F-35's DAS is so sensitive, it reportedly detected the launch of an air-to-air missile in a training exercise from  away, which in combat would give away the location of an enemy aircraft even if it had a very low radar cross-section.[http://breakingdefense.com/2014/06/a-gods-eye-view-of-the-battlefield-gen-hostage-on-the-f-35/4/ ‘A God’s Eye View Of The Battlefield:’ Gen. Hostage On The F-35] – Breakingdefense.com, 6 June 2014\n\nThe communications, navigation and identification (CNI) suite is designed by Northrop Grumman and includes the Multifunction Advanced Data Link (MADL), as one of a half dozen different physical links. The F-35 will be the first fighter with sensor fusion that combines radio frequency and IR tracking for continuous all-direction target detection and identification which is shared via MADL to other platforms without compromising low observability.Nativi, Andy. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channel\ndefense&idnews/F35-030509.xml \"F-35 Air Combat Skills Analyzed\"]. Aviation Week, 5 March 2009.  Link 16 is also included for communication with legacy systems.[http://defense-update.com/20120727_israel-us-negotiate-450-million-f-35i-avionic-enhancements.html \"Israel, US Negotiate $450 Million F-35I Avionic Enhancements\"]. Defense Update, 27 July 2012. The F-35 has been designed with synergy between sensors as a specific requirement, the aircraft's \"senses\" being expected to provide a more cohesive picture of the battlespace around it and be available for use in any possible way and combination with one another; for example, the AN/APG-81 multi-mode radar also acts as a part of the electronic warfare system.Sherman, Ron. [http://www.aviationtoday.com/av/categories/military/845.html \"F-35 Electronic Warfare Suite: More Than Self-Protection\"]. aviationtoday.com, 1 July 2006. Retrieved 22 August 2010. The Program Executive Officer (PEO) General Bogdan has described the sensor fusion software as one of the most difficult parts of the program.\n\nMuch of the F-35's software is written in C and C++ because of programmer availability; Ada83 code also is reused from the F-22. The Integrity DO-178B real-time operating system (RTOS) from Green Hills Software runs on COTS Freescale PowerPC processors.  The final Block 3 software is planned to have 8.6 million lines of code.Warwick, Graham. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channel\ndefense&idnews/awst/2010/06/07/AW_06_07_2010_p26-231580.xml&headline\nFlight%20Tests%20Of%20Next%20F-35%20Block%20Underway \"Flight Tests Of Next F-35 Block Underway\"]. Aviation Week, 12 June 2010. Retrieved 12 June 2010.  In 2010, Pentagon officials discovered that additional software may be needed.Cox, Bob. [http://www.star-telegram.com/2010/11/21/2649040/pentagon-officials-to-meet-to.html \"Pentagon officials to meet to address F-35 program's problems\"]. Star-Telegram, 21 November 2010.  General Norton Schwartz has said that the software is the biggest factor that might delay the USAF's initial operational capability.Reed, John. [http://www.dodbuzz.com/2010/11/23/schwartz-concerned-about-f-35a-delays/ \"Schwartz Concerned About F-35A Delays\"]. DoD buzz, 23 November 2010. In 2011, Michael Gilmore, Director of Operational Test & Evaluation, wrote that, \"the F-35 mission systems software development and test is tending towards familiar historical patterns of extended development, discovery in flight test, and deferrals to later increments\".Sweetman, Bill. [http://www.aviationweek.com/aw/blogs/defense/index.jsp?plckControllerBlog&plckBlogPage\nBlogViewPost&newspaperUserId27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostId\nBlog%3A27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3A0941e5b4-a3c7-4406-85f8-151f2ef34d6b&plckScriptblogScript&plckElementId\nblogDest \"More F-35B Delays, Software Schedule At Risk\"]. Aviation Week, 13 January 2011.\n\nThe electronic warfare and electro-optical systems are intended to detect and scan aircraft, allowing engagement or evasion of a hostile aircraft prior to being detected. The CATbird avionics testbed aircraft has proved capable of detecting and jamming radars, including the F-22's AN/APG-77.David A. Fulghum, Bill Sweetman, Bradley Perrett and Robert Wall. \"Stealthy Chinese J-20 Vulnerable\". Aviation Week, 14 January 2011. The F-35 was previously considered a platform for the Next Generation Jammer; attention shifted to using unmanned aircraft in this capacity instead.Fulghum, David. \"New Plan: NGJ To Go Unmanned\". Aviation Week, 25 January 2012. Several subsystems use Xilinx FPGAs; these COTS components enable supply refreshes from the commercial sector and fleet software upgrades for the software-defined radio systems.\n\nLockheed Martin's Dave Scott stated that sensor fusion boosts engine thrust and oil efficiency, increasing the aircraft's range. Air Force official Ellen M. Pawlikowski has proposed using the F-35 to control and coordinate multiple unmanned combat aerial vehicles (UCAVs).  Using its sensors and communications equipment, a single F-35 could orchestrate an attack made by up to 20 armed UCAVs.[http://breakingdefense.com/2014/12/pawlikowski-on-air-force-offset-strategy-f-35s-flying-drone-fleets/ Pawlikowski On Air Force Offset Strategy: F-35s Flying Drone Fleets] – Breakingdefense.com, 15 December 2014\n\nHelmet-mounted display system\n\nThe F-35 does not need to be physically pointing at its target for weapons to be successful.[https://www.youtube.com/user/F35JSFVideos#play/uploads/7/CwvnhFgzIKI \"F-35 Distributed Aperture System EO DAS\"]. YouTube. Retrieved 23 November 2009. Sensors can track and target a nearby aircraft from any orientation, provide the information to the pilot through their helmet (and therefore visible no matter which way the pilot is looking), and provide the seeker-head of a missile with sufficient information. Recent missile types provide a much greater ability to pursue a target regardless of the launch orientation, called \"High Off-Boresight\" capability. Sensors use combined radio frequency and infra red (SAIRST) to continually track nearby aircraft while the pilot's helmet-mounted display system (HMDS) displays and selects targets; the helmet system replaces the display-suite-mounted head-up display used in earlier fighters. Each helmet costs $400,000.\n\nThe F-35's systems provide the edge in the \"observe, orient, decide, and act\" OODA loop; stealth and advanced sensors aid in observation (while being difficult to observe), automated target tracking helps in orientation, sensor fusion simplifies decision making, and the aircraft's controls allow the pilot to keep their focus on the targets, rather than the controls of their aircraft.\"JSF: the first complete ‘OODA Loop’ aircraft\". Australian Defence Business Review, December 2006, p. 23.\n\nProblems with the Vision Systems International helmet-mounted display led Lockheed Martin-Elbit Systems to issue a draft specification for alternative proposals in early 2011, to be based around the Anvis-9 night vision goggles.Warwick, Graham. \"Lockheed Weighs Alternate F-35 Helmet Display\". Aviation Week, 21 April 2011. BAE Systems was selected to provide the alternative system in late 2011.[https://archive.is/20130128074847/http://www.marketwatch.com/story/lockheed-martin-selects-bae-systems-to-supply-f-35-joint-strike-fighter-jsf-helmet-display-solution-2011-10-10 \"Lockheed Martin Selects BAE Systems to Supply F-35 Joint Strike Fighter (JSF) Helmet Display Solution\"]. BAE Systems, 10 October 2011. The BAE Systems alternative helmet was to include all the features of the VSI system.Szondy, David. [http://www.gizmag.com/f-35-helmet-display-bae/20216/ \"BAE Systems to provide new helmet display for F-35 pilots\"]. Gizmag, 21 October 2011. However, adopting the alternative helmet would have required a cockpit redesign,Carey, Bill. [http://www.ainonline.com/aviation-news/singapore-air-show/2012-02-15/bae-drives-dual-approach-fixing-f-35-helmet-display-issues \"BAE Drives Dual Approach To Fixing F-35 Helmet Display Issues\"]. AINonline . 15 February 2012. but in 2013 development on the alternative helmet was halted because of progress on the baseline helmet.\n\nIn 2011, Lockheed Martin-Elbit granted VSI a contract to fix the vibration, jitter, night-vision and sensor display problems in their helmet-mounted display.[https://web.archive.org/web/20120430225851/http://www.dailymarkets.com/stock/2011/11/17/lockheed-martin-awards-f-35-contract/ \"Lockheed Martin Awards F-35 Contract\"]. Zacks Investment Research, 17 November 2011. A speculated potential improvement is the replacement of Intevac’s ISIE-10 day/night camera with the newer ISIE-11 model.Jean, Grace V. [http://www.nationaldefensemagazine.org/archive/2011/August/Pages/NewSensorAimstoGiveF-35Pilotsa%E2%80%98WindowIntotheNight%E2%80%99.aspx \"New Sensor Aims to Give F-35 Pilots a ‘Window Into the Night’\"].  National Defense Magazine, August 2011. In October 2012, Lockheed Martin-Elbit stated that progress had been made in resolving the technical issues of the helmet-mounted display, and cited positive reports from night flying tests; it had been questioned whether the helmet system allows pilots enough visibility at night to carry out precision tasks.[https://www.reuters.com/article/2012/10/30/lockheed-fighter-helmet-idUSL5E8LUJ4320121030 \"Lockheed Cites Good Reports on Night Flights of F-35 Helmet\"]. Reuters.com, 30 October 2012. In 2013, in spite of continuing problems with the helmet display, the F-35B model completed 19 nighttime vertical landings on board the USS Wasp at sea, by using the DAS instead of the helmet's built-in night vision capabilities, which offer at best 20/35 vision.\n\nIn October 2013, development of the alternate helmet was halted. The current Gen 2 helmet is expected to meet the requirements to declare, in July 2015, that the F-35 has obtained initial operational capability. Beginning in 2016 with low rate initial production (LRIP) lot 7, the program will introduce a Gen 3 helmet that features an improved night vision camera, new liquid crystal displays, automated alignment and other software enhancements.\n\nIn July 2015, an F-35 pilot commented that the helmet may have been one of the issues that the F-35 faced while dogfighting against an F-16 during a test; \"The helmet was too large for the space inside the canopy to adequately see behind the aircraft. There were multiple occasions when the bandit would've been visible (not blocked by the seat) but the helmet prevented getting in a position to see him (behind the high side of the seat, around the inside of the seat, or high near the lift vector)\".\n\nMaintenance\n\nThe program's maintenance concept is for any F-35 to be maintained in any F-35 maintenance facility and that all F-35 parts in all bases will be globally tracked and shared as needed.[http://www.sldinfo.com/?p=18843 \"F-35, Maintenance and the Challenge of Service Standardization\"]. Second Line of Defense, 9 June 2011. The commonality between the different variants has allowed the USMC to create their first aircraft maintenance Field Training Detachment to directly apply the lessons of the USAF to their F-35 maintenance operations.Hawkins, Dan. [http://www.globalsecurity.org/military/library/news/2012/07/mil-120727-afns01.htm \"F-35 maintenance training spawns USMC's first air FTD\"]. USMC, 27 July 2012. The aircraft has been designed for ease of maintenance, with 95% of all field replaceable parts \"one deep\" where nothing else has to be removed to get to the part in question. For instance the ejection seat can be replaced without removing the canopy, the use of low-maintenance electro-hydrostatic actuators instead of hydraulic systems and an all-composite skin without the fragile coatings found on earlier stealth aircraft.Clark, Colin. [http://defense.aol.com/2011/11/03/why-lockheed-thinks-f-35-beats-boeings-f-18/ \"Why Lockheed Thinks F-35 Beats Boeing's F-18\"].  Aol Defense, 3 November 2011.\n\nThe F-35 Joint Program Office has stated that the aircraft has received good reviews from pilots and maintainers, suggesting it is performing better than its predecessors did at a similar stage of development, and that the stealth type has proved relatively stable from a maintenance standpoint. This reported improvement is attributed to better maintenance training, as F-35 maintainers have received far more extensive instruction at this early stage of the program than on the F-22 Raptor. The F-35's stealth coatings are much easier to work with than those used on the Raptor. Cure times for coating repairs are lower and many of the fasteners and access panels are not coated, further reducing the workload for maintenance crews. Some of the F-35's radar-absorbent materials are baked into the jet's composite skin, which means its stealthy signature is not easily degraded.[http://www.flightglobal.com/news/articles/us-air-force-praises-early-performance-of-lockheed-martin-f-35-378578/ \"US Air Force praises early performance of Lockheed Martin F-35\"].Flightglobal.com, 6 November 2012. It is still harder to maintain (because of the need to preserve its stealth characteristics) than fourth-generation aircraft.Majumdar, Dave. [http://www.flightglobal.com/news/articles/stealth-isnt-becoming-obsolete-anytime-soon-379671/ \"Stealth isn’t becoming obsolete anytime soon\"]. Flight International, 30 November 2012. Retrieved 1 December 2012.\n\nHowever, the DOT&E Report on the F-35 program published in January 2015 determined that the plane has not, in fact, reached any of the nine reliability measures the program was supposed to achieve by this point in its development and that the Joint Program Office has been re-categorizing failure incidents to make the plane look more reliable than it actually is. Further, the complexity of maintaining the F-35 means that, currently, none of the Services are ready to keep it in working order and instead \"rely heavily on contractor support and unacceptable workarounds\". DOT&E found that the program achieved 61 percent of planned flight hours and that the average rate of availability was as low as 28 percent for the F-35A and 33 percent for the F-35B. The program created a new \"modeled achievable\" flight hour projection \"since low availability was preventing the full use of bed-down plan flight hours\". According to the Assistant Secretary of the Air Force for Financial Management, in FY2014, each non-test F-35 flew only 7.7 hours per month, which amounts to approximately one sortie every 5.5 days—for combat purposes, a sortie rate so low as to be crippling. Mean flight hours between removal (MFHBR) have increased, but are still only 59 percent to 65 percent of the required threshold. DOT&E found that mean corrective maintenance time for critical failures got worse for the F-35A and the F-35C over the last year. Structural cracking is also proving to be a recurring and enduring problem that is not yet resolved.\n\nOperational history\n\nTesting\n\nThe first F-35A (designated AA-1) was rolled out in Fort Worth, Texas, on 19 February 2006. In September 2006, the first engine run of the F135 in an airframe took place.\"Mighty F-35 Lightning II Engine Roars to Life\". Lockheed Martin, 20 September 2006. On 15 December 2006, the F-35A completed its maiden flight.[https://www.teamjsf.com/jsf/data.nsf/7074259f3965fd0985256f43007b0964/7f70d66a0aaef181852573540049ead4?OpenDocument \"F-35 First Flight\"]. TeamJSF.com. Retrieved 10 October 2007. A modified Boeing 737–300, the Lockheed Martin CATBird has been used as an avionics test-bed for the F-35 program, including a duplication of the cockpit.\n\nThe first F-35B (designated BF-1) made its maiden flight on 11 June 2008, piloted by BAE Systems' test pilot Graham Tomlinson. Flight testing of the STOVL propulsion system began on 7 January 2010.\"News Breaks: F-35B Engages Stovl Mode\".  Aviation Week, 11 January 2010, p. 15. The F-35B's first hover was on 17 March 2010, followed by its first vertical landing the next day.Wolf, Jim. [https://www.reuters.com/article/2010/03/18/us-lockheed-fighter-idUSTRE62H4WF20100318 \"F-35 fighter makes first vertical landing\"]. Reuters, 18 March 2010. During a test flight on 10 June 2010, the F-35B STOVL aircraft achieved supersonic speedsCavas, Christopher P. [http://www.marinecorpstimes.com/news/2010/06/dn_jsf_supersonic_061410/ \"F-35B STOVL fighter goes supersonic\"].  Marine Corps Times, 15 June 2010. as had the X-35B before.[https://www.pbs.org/wgbh/nova/transcripts/3004_xplanes.html \"X-planes\".] PBS: Nova transcript. Retrieved 9 January 2010. In January 2011, Lockheed Martin reported that a solution had been found for the cracking of an aluminum bulkhead during ground testing of the F-35B.Majumdar, Dave. [https://archive.is/20120908093025/http://www.navytimes.com/news/2011/01/marine-f-35-lockheed-says-key-issue-is-fixed-011011w/ \"Lockheed says it’s fixed key F-35B issue\"]. Defense News, 10 January 2011. In 2013, the F-35B suffered another bulkhead cracking incident. This will require redesign of the aircraft, which is already very close to the ultimate weight limit.\n\nBy June 2009, many of the initial flight test targets had been accomplished but the program was behind schedule.Sweetman, Bill. [http://www.zinio.com/reader.jsp?issue\n416083334 \"Get out and fly\"]. Defense Technology International, June 2009, pp. 43–44. During 2008, a Pentagon Joint Estimate Team (JET) estimated that the program was two years behind the public schedule, a revised estimate in 2009 predicted a 30-month delay.Cox, Bob. \"Internal Pentagon memo predicts that F-35 testing won't be complete until 2016\". Fort Worth Star Telegram, 1 March 2010. Delays reduced planned production numbers by 122 aircraft through 2015 to provide an additional $2.8 billion for development; internal memos suggested that the official timeline would be extended by 13 months.Capaccio, Tony. [http://www.businessweek.com/news/2010-01-06/lockheed-f-35-purchases-delayed-in-pentagon-s-fiscal-2011-plan.html \"Lockheed F-35 Purchases Delayed in Pentagon’s Fiscal 2011 Plan\"].  Bloomberg BusinessWeek, 6 January 2010. The success of the JET led Ashton Carter calling for more such teams for other poorly performing projects.Bennett, John T. [https://archive.is/20120904025817/http://www.defensenews.com/story.php?i4559411&c\nPOL&s=TOP \"Carter: More U.S. Programs To Get JET Treatment\"]. defensenews.com, 29 March 2010.\n\nNearly 30 percent of test flights required more than routine maintenance to make the aircraft flightworthy again.Thompson, Loren B. [http://www.lexingtoninstitute.org/f-35-cost-rise-is-speculative-but-progress-is-real?a1&c\n1129 \"F-35 Cost Rise Is Speculative, But Progress Is Real\"]. lexingtoninstitute.org, 12 March 2010. As of March 2010, the F-35 program had used a million more man-hours than predicted.[http://startelegram.typepad.com/files/sasc-mar-11-final-transcript-carter_gilmore_fox.rtf \"Senate Armed Services Committee Holds Hearing on President Obama's Fiscal 2011 Budget Request for the F-35 Joint Strike Fighter Program\"]. Congressional Record via startelegram.typepad.com, 11 March 2010. The United States Navy projected that lifecycle costs over a 65-year fleet life for all American F-35s to be $442 billion higher than U.S. Air Force projections.\"USAF Disputes Navy F-35 Cost Projections\". Aviation Week. Retrieved 3 July 2010. F-35 delays have led to shortfall of up to 100 jet fighters in the Navy/Marines team, although measures have been taken using existing assets to manage and reduce this shortfall.Grant, Greg [http://www.dodbuzz.com/2010/04/13/af-f-35-ioc-in-2016/ \"JSF Production \"Turned The Corner\"]. dodbuzz.com. Retrieved 15 April 2010.\n\nThe F-35C's maiden flight took place on 7 June 2010, at NAS Fort Worth JRB. A total of 11 U.S. Air Force F-35s arrived in fiscal year 2011.Rolfsen, Bruce. [https://wayback.archive-it.org/all/20110402220229/http://www.airforcetimes.com/news/2010/05/airforce_force_structure_051610W/ \"Jobs to change with focus on irregular warfare\"]. Army Times Publishing Company, 16 May 2010. On 9 March 2011, all F-35s were grounded after a dual generator failure and oil leak in flight;Warwick, Graham. [http://www.aviationweek.com/aw/blogs/defense/index.jsp?plckController\nBlog&plckBlogPageBlogViewPost&newspaperUserId\n27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostIdBlog%3a27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3a433985ca-f77d-48db-86bf-81b9eecc11dc&plckScript\nblogScript&plckElementIdblogDest \"In-flight Failure Halts F-35 Flight Tests\"]. Av Leak, 11 March 2011. the cause of the incident was discovered to have been the result of faulty maintenance.Cavas, Christopher P. [http://www.defensenews.com/story.php?i\n6063313&cAME&s\nTOP \"All F-35s Cleared To Resume Flight Tests\"]. DefenseNews, 25 March 2011. In 2012, Navy Commander Erik Etz of the F-35 program office commented that rigorous testing of the F-35's sensors had taken place during exercise Northern Edge 2011, and had served as a significant risk-reduction step.Branch, Ricardo, Army Sgt. [http://www.jber.af.mil/news/story.asp?id\n123156090 \"Northern Edge fields new radar system\"].  Northern Edge Joint Information Bureau, 8 March 2012.Saiki, Lt. Col. Tracey. [http://www.af.mil/News/ArticleDisplay/tabid/223/Article/112953/continued-testing-of-f-35-jsf-sensors-a-success-at-northern-edge-2011.aspx \"Continued testing of F-35 JSF sensors a success at Northern Edge 2011\"]. Af.mil. Retrieved 18 April 2012.\n\nOn 2 August 2011, an F-35's integrated power package (IPP) failure during a standard engine test at Edwards Air Force Base led to the F-35 being immediately grounded for two weeks.Trimble, Stephen. [http://www.flightglobal.com/articles/2011/08/03/360325/f-35-fleet-grounded-after-electrical-subsystem-failure.html \"F-35 fleet grounded after electrical subsystem failure\"]. Flight International, 3 August 2011.Majumdar, Dave. [https://archive.is/20130121144218/http://www.defensenews.com/story.php?i7289794&c\nAME&sAIR \"F-35s Grounded After Power Package Fails\"]. Defense News, 3 August 2011. On 10 August 2011, ground operations were re-instituted; preliminary inquiries indicated that a control valve did not function properly, leading to the IPP failure.[http://www.jsf.mil/news/docs/20110810_GROUNDOPS.pdf \"Statement on JPO Reinstituting Ground Operations for the F-35 Program\"]. Joint Strike Fighter Program Office, 10 August 2011.[https://archive.is/20130121141605/http://www.defensenews.com/story.php?i\n7358985&cAME&s\nAIR \"F-35 Fleet Cleared For Ground Operations\"]. Defense News, 10 August 2011. On 18 August 2011, the flight ban was lifted for 18 of the 20 F-35s; two aircraft remained grounded for lack of monitoring systems.Lerman, David. [https://www.bloomberg.com/news/2011-08-18/air-force-lifts-flight-ban-on-lockheed-f-35-fighter-jet-1-.html \"Air Force Lifts Flight Ban on Lockheed F-35 Fighter Jet\"]. Bloomberg News, 18 August 2011. The IPP suffered a second software-related incident in 2013, this resulted in no disruption as the fleet was already grounded by separate engine issues.[https://www.reuters.com/article/2013/02/25/us-lockheed-fighter-honeywell-idUSBRE91O11V20130225 \"Honeywell to test some F-35 parts after smoke incident\"]. Reuters.\n\nOn 25 October 2011, the F-35A reached its designed top speed of Mach 1.6 for the first time.[http://defensetech.org/2011/11/04/f-35-jsf-flight-test-update/ \"F-35 JSF Flight Test Update\"]. Defense Tech, 4 November 2011. Further testing demonstrated Mach 1.61 and 9.9g.Norris, Guy. [http://www.aviationweek.com/aw/blogs/defense/index.jsp?plckController\nBlog&plckBlogPageBlogViewPost&newspaperUserId\n27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostIdBlog%3a27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post%3acd242f57-3030-4871-b60b-764c1213fb1a&plckScript\nblogScript&plckElementId=blogDest \"F-35A pushes to Mach 1.6\"]. Aviation Week & Space Technology, 9 December 2011. On 11 February 2013, an F-35A completed its final test mission for clean wing flutter, reporting to be clear of flutter at speeds up to Mach 1.6.[http://www.lockheedmartin.com/us/news/press-releases/2013/february/130211ae_f-35a-completes-flutter-testing.html F-35A Completes 3-Year Clean Wing Flutter Testing Program] Lockheed press release, 11 February 2013 On 15 August 2012, an F-35B completed airborne engine start tests.[http://www.flightglobal.com/news/articles/f-35b-completes-air-start-testing-at-edwards-afb-376071/ \"F-35B completes air start testing at Edwards AFB\"]. Flight International, 4 September 2012.\n\nDuring testing in 2011, all eight landing tests of the F-35C failed to catch the arresting wire; a redesigned tail hook was developed and delivered two years later in response.Majumdar, Dave. [https://archive.is/20130102142244/http://www.defensenews.com/apps/pbcs.dll/article?AID=2012301170010 \"F-35C Tailhook Design Blamed for Landing Issues\"]. Defense News, 17 January 2012. In October 2011, two F-35Bs conducted three weeks of initial sea trials aboard .\"F-35B completes first sea trials on USS Wasp\". navair.navy. Retrieved: 17 July 2012.\n\nOn 6 October 2012, the F-35A dropped its first bomb,[http://www.flightglobal.com/news/articles/picture-f-35a-releases-first-air-launched-weapon-377754/ \"F-35A releases first air-launched weapon\"]. Flight International, 17 October 2012. followed three days later by an AIM-120 AMRAAM.[http://www.lockheedmartin.com/us/news/press-releases/2012/october/edwards-f-35a-completes-first-aim-120-amraam-internal-weapons-re.html \"F-35A Completes First AIM-120 Amraam Internal Weapons Release\"]. Lockheed Martin press release, 22 October 2012. On 28 November 2012, an F-35C performed a total of eleven weapon releases, including a GBU-31 JDAM and GBU-12 Paveway from its weapons bay in the first weapons released for the F-35C.[http://www.globalsecurity.org/military/library/news/2012/11/mil-121130-nns01.htm \"F-35C Lightning II Hits Weapons Testing Milestone\"]. Globalsecurity.org, 30 November 2012. On 5 June 2013, an F-35A at the Point Mugu Sea Test Range completed the first in-flight missile launch of an AIM-120 C5 AAVI (AMRAAM Air Vehicle Instrumented).  It was launched from the internal weapons bay.[https://www.f35.com/news/detail/f-35a-completes-first-in-flight-missile-launch/ \"F-35A Completes First In-Flight Missile Launch\"]. Lockheed Martin, 7 June 2013.\n\nOn 16 November 2012, the U.S. Marines received the first F-35B at MCAS Yuma, and the VMFA(AW)-121 unit is to be redesignated from a Boeing F/A-18 Hornet unit to an F-35B squadron.Majumdar, Dave. [http://www.flightglobal.com/blogs/the-dewline//2012/11/mcas-yuma-receives-first-opera.html \"MCAS Yuma receives(sic) first operational F-35B\"]. Flight International, 17 November 2012. A February 2013 Time article revealed that Marine pilots are not allowed to perform a vertical landing—the maneuver is deemed too dangerous, and it is reserved only for Lockheed test pilots.Time magazine, 25 February 2013, pp. 26–30, \"The Most Expensive Weapon Ever Built\", by Mark Thompson; restriction on vertical landings cited on page 28. On 10 May 2013, the F-35B completed its first vertical takeoff test.[https://www.f35.com/news/detail/f-35b-completes-first-vertical-takeoff/ \"F-35B Completes First Vertical Takeoff\"]. Lockheed Martin, 20 May 2013. On 3 August 2013, the 500th vertical landing of an F-35 took place.\n\nOn 18 January 2013, the F-35B was grounded after the failure of a fueldraulic line in the propulsion system on 16 January. The problem was traced to an \"improperly crimped\" fluid line manufactured by Stratoflex. The Pentagon cleared all 25 F-35B aircraft to resume flight tests on 12 February 2013. On 22 February 2013, the U.S. Department of Defense grounded the entire fleet of 51 F-35s after the discovery of a cracked turbine blade in a U.S. Air Force F-35A at Edwards Air Force Base. On 28 February 2013, the grounding was lifted after an investigation concluded that the cracks in that particular engine resulted from stressful testing, including excessive heat for a prolonged period during flight, and did not reflect a fleetwide problem.Mount, Mike. [http://myfox8.com/2013/03/01/military-clears-f-35-joint-strike-fighter-to-fly/ \"Military Clears F-35 Joint Strike Fighter to Fly\"] . CNN, 1 March 2013.[http://www.flightglobal.com/news/articles/f-35s-cleared-to-resume-flight-operations-382909/ \"F-35s cleared to resume flight operations\"]. Flight International, 28 February 2013. The F-35C Lightning II carrier variant Joint Strike Fighter conducted its first carrier-based night flight operations aboard an aircraft carrier off the coast of San Diego on 13 November 2014.\n\nOn 5 June 2015, the U.S. Air Education and Training Command Accident Investigation Board reported that catastrophic engine failure had led to the destruction of an Air Force F-35A assigned to the 58th Fighter Squadron at Eglin Air Force Base, Florida, on 23 June 2014.  The third-stage forward integral arm of a rotor had fractured and broke free during the takeoff roll. Pieces cut through the engine's fan case, engine bay, internal fuel tank and hydraulic and fuel lines before leaving through the aircraft's upper fuselage. Leaked fuel and hydraulic fluid ignited the fire, which destroyed the rear two-thirds of the aircraft. The destruction of the airframe resulted in the cancelation of the F-35's international debut at the 2014 Farnborough Airshow in England, the temporary grounding of the F-35 fleet and ongoing restrictions in the flight envelope.\n\nOn 19 June 2015 the RAF successfully launched two 500 lb Paveway IV precision-guided bombs, making the test the first time non-US munitions were deployed by the aircraft.\n\nThe US Marines declared the aircraft had met initial operational capability on 31 July 2015, despite shortcomings in night operations, communications, software and weapons carriage capabilities. However, J. Michael Gilmore, director of the Pentagon’s Operational Test and Evaluation Office, criticized the operational trials as not valid. In an internal memo, Gilmore concluded \"the exercise was so flawed that it 'was not an operational test … in either a formal or informal sense of the term.' Furthermore, the test 'did not—and could not—demonstrate' that the version of the F-35 that was evaluated 'is ready for real-world operational deployments, given the way the event was structured.'\"\n\nOn 11 April 2016 the Joint Program Office confirmed that the Royal Netherlands Air Force (RNLAF) had cleared its KDC-10 aerial tanker to refuel the F-35, paving the way for the fighter’s international public debut at the RNLAF’s Open Dagen (Open Day) at Leeuwarden on June 10–11, 2016. The testing required the fighter to refuel in daylight, dusk and night, with 30,000 lb. of fuel being transferred during the tests.\n\nThe Israel Air Force declared its F-35 fleet operationally capable on December 6, 2017.\n\nTraining\n\nIn 2011, the Director of Operational Test and Evaluation warned that the USAF's plan to start unmonitored flight training \"risks the occurrence of a serious mishap\".Schwellenbach, Nick. [http://www.pogo.org/resources/national-security/dod-memo-concerns-regarding-jsf-operational-utility-evaluation-training-flights.html \"Concerns Regarding Plans for the Joint Strike Fighter to Begin Training Flights and Conduct an Operational Utility Evaluation\"]. POGO, 31 October 2011.  The leaders of the United States Senate Committee on Armed Services called on Defense Secretary Leon Panetta to address the issue.[http://www.businessweek.com/news/2011-12-09/u-s-senators-press-panetta-to-review-f-35-training-safety.html \"U.S. Senators Press Panetta to Review F-35 Training Safety\"].  Bloomberg News, 9 December 2011. Despite the objections, expanded trial flights began in September 2012.Capaccio, Tony. [https://archive.is/20130118154612/http://www.businessweek.com/news/2012-09-28/air-force-expands-f-35-trials-over-tester-s-objections \"Air Force Expands F-35 Trials Over Tester’s Objections\"]. Bloomberg BusinessWeek, 28 September 2012.\n\nThe F-35A and F-35B were cleared for flight training in early 2012.Shalal-Esa, Andrea. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channeldefense&id\nnews/awx/2012/02/27/awx_02_27_2012_p0-429863.xml&headlineUSMC%20Near%20Start%20Of%20F-35%20Training%20Flights \"USMC Near Start Of F-35 Training Flights\"]. Aviation Week. 27 February 2012.  A military flight release for the F-35A was issued on 28 February 2012.[https://web.archive.org/web/20130802014635/http://www.af.mil/news/story.asp?id\n123291745 \"Air Force issues flight release for Eglin AFB F-35A]\" www.af.mil. 28 February 2012. Retrieved 5 May 2012 The aircraft were restricted to basic maneuvers with no tactical training allowed.Majumdar, Dave. [http://www.flightglobal.com/news/articles/first-air-national-guard-pilot-starts-transition-to-f-35-374470/ \"First Air National Guard pilot starts transition to F-35\"]. Flight Magazine, 17 July 2012. On 24 August 2012, an F-35 flew its 200th sortie while at Eglin Air Force Base, flown by a Marine pilot. The pilot said, \"The aircraft have matured dramatically since the early days. The aircraft are predictable and seem to be maintainable, which is good for the sortie production rate. Currently, the flight envelope for the F-35 is very, very restricted, but there are signs of improvement there too\". The F-35s at the base no longer need to fly with a chase aircraft and are operating in a normal two-ship element.[http://www.flightglobal.com/news/articles/eglin-f-35s-fly-200th-sortie-375794/ \"Eglin F-35s fly 200th sortie\"]. Flight International, 24 August 2012.\n\nOn 21 August 2012, J. Michael Gilmore wrote that he would not approve the Operational Test and Evaluation master plan until his concerns about electronic warfare testing, budget and concurrency were addressed.[http://defense.aol.com/2012/08/28/pentagons-testing-czar-questions-f-35-programs-ote-plan/ \"Pentagon's Testing Czar Questions F-35 Program's OTE Plan\"].  Aol Defense, 28 August 2012. On 7 September 2012, the Pentagon failed to approve a comprehensive operational testing plan for the F-35.Shalal-Esa, Andrea. [https://www.reuters.com/article/2012/09/11/us-lockheed-fighter-idUSBRE88A04A20120911 \"More problems raised at Pentagon F-35 fighter review\"]. Reuters, 10 September 2012. Instead, on 10 September 2012, the USAF began an operational utility evaluation (OUE) of the F-35A entire system, including logistical support and maintenance, maintenance training, pilot training, and pilot execution.Majumdar, Dave. [http://www.flightglobal.com/news/articles/usaf-to-start-f-35-operational-utility-evaluation-on-10-september-376217/ \"USAF to start F-35 operational utility evaluation on 10 September\"]. Flight International, 7 September 2012. By 1 October, the OUE was reported as \"proceeding smoothly\", pilots started on simulators prior to flying on 26 October.Majumdar, Dave. [http://www.flightglobal.com/news/articles/f-35-operational-utility-evaluation-proceeding-smoothly-377163/ \"F-35 operational utility evaluation proceeding smoothly\"]. Flightglobal.com, 1 October 2012. The OUE was completed on 14 November with the 24th flight, the four pilots involved having completed six flights each.\n\nDuring the Low Rate Initial Production (LRIP) phase of the aircraft, the U.S. had taken a tri-service approach to developing tactics and procedures for the F-35 using flight simulators prior to the type entering service. Simulated flights had tested the flight controls' effectiveness, helping to discover technical problems and refine aircraft design.Majumdar, Dave. [http://www.flightglobal.com/news/articles/simulation-plays-vital-role-in-building-f-35-tactics-and-aircraft-development-379336/ \"Simulation plays vital role in building F-35 tactics and aircraft development\"]. Flight International, 21 November 2012. Maintenance personnel have discovered that it is often possible to correct deficiencies in the F-35, which is a software-defined aircraft, simply by rebooting the aircraft's software and onboard systems.Majumdar, Dave. [http://www.flightglobal.com/news/articles/us-air-force-praises-early-performance-of-lockheed-martin-f-35-378578/ \"US Air Force praises early performance of Lockheed Martin F-35\"]. Flight International, 6 November 2012.\n\nAir Force pilot training F-35A began in January 2013 at Eglin Air Force Base; the program currently has a maximum capacity of 100 military pilots and 2,100 maintainer students.[http://militarytimes.com/news/2012/12/air-force-f35-pilot-training-starts-next-month-eglin-121712/ \"F-35 pilot training starts next month at Eglin>\"] Militarytimes.com, 17 December 2012.\n\nOn 23 June 2014, an F-35A experienced a fire in the engine area during its takeoff at Eglin AFB. In response, the Pentagon's Joint Program Office halted training in all F-35 models the next day, and on 3 July, the F-35 fleet was formally grounded. The fleet was returned to flight on 15 July, but the engine inspection regimen caused the aircraft's debut at the Farnborough 2014 Air Show to be canceled.[https://archive.is/20140717195739/http://www.defensenews.com/article/20140715/DEFREG02/307150027 \"Pentagon: F-35 Will Not Go to Farnborough\"]. Defense News\n\nAt Red Flag 2017 the F-35 scored a kill ratio of 15:1 against an F-16 aggressor squadron.\n\nBasing plans for future U.S. F-35s\n\nOn 9 December 2010, a media report stated that the \"USMC will base 216 F-35Bs on the East Coast and 184 of them on the West Coast, documents showed\". This report continued: \"Cherry Point will get 128 jets to form eight squadrons; Beaufort will have three squadrons and a pilot training center using 88 aircraft; Miramar will form six operational squadrons with 96 jets and 88 F-35s will go to Yuma for five operational squadrons with an additional test and evaluation unit\".\"Military plans to send jets to S.C., N.C., Calif., Ariz\". The Associated Press, 9 December 2010, Susanne M. Schafer.\n\nIn 2011, the USMC and USN signed an agreement that the USMC will purchase 340 F-35B and 80 F-35C fighters. The five squadrons of USMC F-35Cs would be assigned to Navy carriers while F-35Bs would be used ashore.Daniel, Lisa. [http://www.defense.gov/news/newsarticle.aspx?id\n63158 \"Plan Improves Navy, Marine Corps Air Capabilities\"].  American Forces Press Service, 14 March 2011.Cavas, Christopher P. [http://www.marinecorpstimes.com/news/2011/03/navy-more-marines-to-fly-f35c-031411w/ \"More Marines to fly carrier-variant JSFs\"].  Marine Corps Times, 14 March 2011.\n\nIn February 2014, the U.S. Air Force announced that the first Air National Guard unit to fly the new F-35 Lightning II will be the 158th Fighter Wing of the Vermont Air National Guard based at the Burlington Air Guard Station. The 158th currently flies F-16 Fighting Falcons, which are nearing the end of their useful service lives. Burlington Air Guard Station is expected to receive 18 F-35As, replacing the 18 F-16 Fighting Falcons currently assigned. The F-35A is expected to arrive in 2020.\n\nOn 11 March 2014, the first F-35A Lightning II assigned to Luke Air Force Base arrived at the base. 16 F-35s are to be delivered to the base by the end of 2014, with 144 Lightning IIs to be stationed there, arriving over the course of the next decade.\n\nOn 8 January 2015, the Royal Air Force base RAF Lakenheath in the UK was chosen as the first base in Europe to station two American F-35 squadrons, following an announcement by the Pentagon. 48 F-35s, making up 2 squadrons, will add to the 48th Fighter Wing's already existing F-15C and F-15E Strike Eagle jets.[http://theaviationist.com/2015/01/09/uk-base-selected-to-host-first-u-s-f-35-jets-in-europe/ \"RAF Lakenheath was selected as the first base to host USAFE F-35s\"]. The Aviationist, Retrieved January 13, 2015.\n\nProcurement and international participation\n\nWhile the United States is the primary customer and financial backer, the United Kingdom, Italy, The Netherlands, Canada, Turkey, Australia, Norway, and Denmark have agreed to contribute US$4.375 billion towards development costs.[http://www.globalsecurity.org/military/systems/aircraft/f-35-int.htm \"F-35 Joint Strike Fighter (JSF) Lightning II – International Partners\"]. Global Security. Retrieved 7 April 2010. Total development costs are estimated at more than US$40 billion. The purchase of an estimated 2,400 aircraft is expected to cost an additional US$200 billion.Merle, Renae. [https://www.washingtonpost.com/wp-dyn/articles/A38236-2005Mar15.html \"GAO Questions Cost Of Joint Strike Fighter\"]. The Washington Post, 15 March 2005. The initial plan was that the nine major partner nations would acquire over 3,100 F-35s through 2035.[http://www.jsf.mil/downloads/documents/JSF_PSFD_MOU_-_Update_4_2010.PDF \"Estimated JSF Air Vehicle Procurement Quantities\"]. JSF.mil, Updated as of April 2010. Sales to partner nations are made through the Pentagon's Foreign Military Sales program.Tae-hoon, Lee. [https://www.koreatimes.co.kr/www/news/nation/2012/03/205_106346.html \"Seoul fears delivery delays of F-35 jets\"]. The Korea Times, 6 March 2012.\n\nThere are three levels of international participation.[http://www.defenseindustrydaily.com/F-35-Lightning-The-Joint-Strike-Fighter-Program-2012-07501/ \"F-35 Lightning: The Joint Strike Fighter Program, 2012\"]. Defense Industry Daily, 30 October 2012. The levels generally reflect financial stake in the program, the amount of technology transfer and subcontracts open for bid by national companies, and the order in which countries can obtain production aircraft. The United Kingdom is the sole \"Level 1\" partner, contributing US$2.5 billion, which was about 10% of the planned development costs[https://www.teamjsf.com/jsf/data.nsf/75public/07CF737749FA9E5585256F3900720288?OpenDocument \"JSF Global Partners\"].  teamjsf.com. Retrieved 30 March 2007. under the 1995 Memorandum of Understanding that brought the UK into the project.\"US, UK sign JAST agreement\". Aerospace Daily New York: McGraw-Hill, 25 November 1995, p. 451. Level 2 partners are Italy, which is contributing US$1 billion; and the Netherlands, US$800 million. Level 3 partners are Turkey, US$195 million; Canada, US$160 million; Australia, US$144 million; Norway, US$122 million and Denmark, US$110 million. Israel and Singapore have joined as Security Cooperative Participants (SCP).Schnasi, Katherine V. [http://www.gao.gov/new.items/d04554.pdf \"Joint Strike Fighter Acquisition: Observations on the Supplier Base\"]. US Accounts Office. Retrieved 8 February 2006.[http://www.ic.gc.ca/eic/site/ad-ad.nsf/eng/ad03863.html \"Industry Canada F-35 Joint Strike Fighter (JSF) Canada's Next Generation Fighter Capability\"].  ic.gc.ca. Retrieved 25 November 2010.Combat Aircraft Monthly, September 2010, p. 24. Japan announced on 20 December 2011 its intent to purchase 42 F-35s with deliveries beginning in 2016 to replace the F-4 Phantom II; Japan seeks 38 F-35s, to be assembled domestically.[http://www.bbc.co.uk/news/world-asia-16259895 \"US Lockheed Martin F-35 chosen as Japan fighter jet\"]. BBC News, 20 December 2011. Retrieved: 20 December 2011.\n\nBy 2012, many changes had occurred in the order book. Italy became the first country to announce a reduction of its overall fleet procurement, cutting its buy from 131 to 90 aircraft. Other nations reduced initial purchases or delayed orders while still intending to purchase the same final numbers. The United States canceled the initial purchase of 13 F-35s and postponed orders for another 179. The United Kingdom cut its initial order and delayed a decision on future orders. Australia decided to buy the Boeing F/A-18E/F Super Hornet as an interim measure. Turkey also cut its initial order of four aircraft to two, but confirmed plans to purchase 100 F-35As.[https://www.reuters.com/article/2012/02/23/turkey-f35-lockheed-idUSL5E8DN2IM20120223 \"Update 1-Turkey keeps plan to buy 100 F-35 fighter jets\"]. Reuters, 23 February 2012.[http://www.turkishpress.com/news.asp?id378853#.T-xxLsr4JfA \"Turkey plans to buy 100 F-35 jet fighters\"].  turkishpress.com, 24 February 2012. Turkey will buy four F-35s to be delivered in 2015 and 2016, while the order may be increased from 100 to 120 aircraft.[http://www.turkishweekly.net/news/141212/turkey-to-buy-two-planes-in-second-f-35-shipment.html \"Turkey to Buy Two Planes in Second F-35 Shipment\"].  turkishweekly.net, 4 September 2012. These changes resulted in increased procurement prices, and increased the likelihood of further cuts.Harper, Tim. [https://www.thestar.com/news/canada/politics/article/1131391--tim-harper-the-conservatives-and-their-f-35-fairy-tale \"Tim Harper: The Conservatives and their F-35 fairy tale\"]. Toronto Star, 14 February 2012.Vasarri, Chiara. [https://archive.is/20130118143224/http://www.businessweek.com/news/2012-02-15/italy-to-cut-f-35-fighter-jet-orders-as-part-of-defense-revamp.html \"Italy to Cut F-35 Fighter Jet Orders as Part of Defense Revamp\"]. Bloomberg Business Week, 14 February 2012.\n\nOn 3 April 2012, the Auditor General of Canada Michael Ferguson published a report outlining problems with Canada's procurement of the jet, including misinformation over the final cost. According to the Auditor General, the government knowingly understated the final price of the 65 jets by $10 billion.Postmedia News. [http://www.canada.com/timeline+Canada+involvement+program/6419249/story.html \"A timeline on Canada's involvement in the F-35 program\"].  Canada.com, 5 April 2012. Canada's Conservative government had stated it would not reduce its order, and anticipated a $75–80 million unit cost; the procurement was termed a \"scandal\" and \"fiasco\" by the media and faced a full review to determine any Canadian F-35 purchase.[https://www.theglobeandmail.com/news/video/video-mps-hold-mackay-to-account-in-f-35-scandal/article2392358/ \"Video: MPs hold Mackay to account in F-35 scandal\"] . The Canadian Press via Globe and Mail, 4 April 2012.Coyne, Andrew. [http://fullcomment.nationalpost.com/2012/04/04/andrew-coyne-the-f-35-affair-is-a-fiasco-from-top-to-bottom/ \"Peeling back the layers of misconduct in the F-35 fiasco\"].  National Post, 4 April 2012.[http://www.cbc.ca/thenational/indepthanalysis/atissue/story/2012/04/05/thenational-atissue-040512.html \"The F-35 Fiasco\"]. CBC News, 5 April 2012. On 13 December 2012, in a scathing editorial published by CBC News, journalist Brian Stewart termed the F-35 project a \"global wrecking ball\" for its runaway costs and lack of affordability for many participating nations.Stewart, Brian. [http://www.cbc.ca/news/world/story/2012/12/12/f-vp-stewart-f35-jets.html \"Super-costly F-35s, a global wrecking ball\"]. Canadian Broadcasting Corporation, 13 December 2012.\n\nIn May 2013, Lockheed Martin declared that Turkey is projected to earn $12 billion from licensed production of F-35 components.\n\nIn November 2014, the United Kingdom confirmed its first order for 14 F-35Bs to be delivered in 2016.\n\nVariants\n\nThe F-35 is being built in three different main versions to suit various combat missions.\n\nF-35A\n\nThe F-35A is the conventional takeoff and landing (CTOL) variant intended for the U.S. Air Force and other air forces. It is the smallest, lightest F-35 version and is the only variant equipped with an internal cannon, the GAU-22/A. This 25 mm cannon is a development of the GAU-12 carried by the USMC's AV-8B Harrier II. It is designed for increased effectiveness against ground targets compared to the 20 mm M61 Vulcan cannon carried by other USAF fighters.\n\nThe F-35A is expected to match the F-16 in maneuverability and instantaneous high-g performance, and outperform it in stealth, payload, range on internal fuel, avionics, operational effectiveness, supportability, and survivability.Pike, John. [http://www.globalsecurity.org/military/systems/aircraft/f-35a.htm \"F-35A Joint Strike Fighter\"]. Globalsecurity.org. Retrieved 23 November 2009. It is expected to match an F-16 that is carrying the usual external fuel tank in acceleration performance.[http://www.lockheedmartin.com/aeronautics/afa/beesley-interview.html \"Flying The F-35: An Interview With Jon Beesley, F-35 Chief Test Pilot\"] . lockheedmartin.com. Retrieved 25 November 2010. \n\nThe A variant is primarily intended to replace the USAF's F-16 Fighting Falcon. At one point it was also intended to replace the A-10 Thunderbolt II starting in 2028.Hebert, Adam J. [http://www.airforce-magazine.com/MagazineArchive/Pages/2007/July%202007/0707lightning.aspx \"Lightning II: So Far, So Good\"].  airforce-magazine.com, Air Force Association, Volume 90, Issue 7, July 2007. Retrieved 3 December 2008.Laurenzo, Ron. [http://www.globalsecurity.org/org/news/2003/030609-a-10-retire01.htm \"Air Force: No Plan To Retire A-10\"]. GlobalSecurity.org, Defense Weekly, 9 June 2003. Retrieved 3 December 2008. The F-35A can be outfitted to receive fuel via either of the two main aerial refueling methods; this was a consideration in the Canadian procurement and a deciding factor for the Japanese purchase.Waldron, Greg. [http://www.flightglobal.com/news/articles/in-focus-tokyo-casts-wary-eye-on-chinese-airpower-developments-375007/ \"IN FOCUS: Tokyo casts wary eye on Chinese airpower developments\"]. Flight International, 2 August 2012.[http://www.cbc.ca/news/canada/story/2011/10/23/f-35-communication-problem.html \"F-35s face communication problems in Arctic\"]. The Canadian Press, 23 October 2011.Ewing, Philip. [http://www.dodbuzz.com/2012/06/19/lockheeds-comprehensive-qa-on-the-f-35/ \"Lockheed’s comprehensive Q&A on the F-35\"]. DoD Buzz, 19 June 2012. On 18 December 2013, the Netherlands became the second partner country to operate the F-35A, when Maj. Laurens J.W. Vijge of the Royal Netherlands Air Force took off from Eglin Air Force Base.\n\nOn 27 January 2014, General Mike Hostage, head of Air Combat Command, stated he would fight \"to the death\" to not have a single plane of the USAF's planned 1,763 F-35 purchase be cut, because the allies and partners of the US got \"weak in the knees\" when seeing the USAF \"back away\" from the F-35. He said the F-15 and F-16 fleets would become tactically obsolete in the middle of the next decade regardless of improvements. Hostage also commented that the F-35 would be \"irrelevant\" without the F-22 fleet being viable as the F-35 was not an air superiority fighter, and that an F-35 pilot who enters a dogfight has made a mistake.\n\nThe F-35As for the Royal Norwegian Air Force will have drag chute installed. Norway will be the first country to adopt the drag chute pod.\n\nOn 2 August 2016, the U.S. Air Force declared the F-35A basic combat ready. The 34th Fighter Squadron located at Hill Air Force Base, Utah, has at least 12 combat-ready jets capable of global deployment. F-35A is scheduled to be full combat ready in 2017 with its 3F software upgrade. Air Combat Command will initially deploy F-35A to Red Flag exercises and as a \"theater security package\" to Europe and the Asia-Pacific. It will probably not be fighting the Islamic State in the Middle East earlier than 2017.\n\nOn 13 July 2017, UK Minister of State For Defence Earl Howe confirmed that the UK will purchase a minimum 138 aircraft and a decision will shortly be forthcoming as whether there will be a 'mix' of F-35A and 'B' versions required for 'synergy' and 'inter-service operability' between the RAF and Royal Navy.\n\nF-35B\n\nThe F-35B is the short takeoff and vertical landing (STOVL) variant of the aircraft. Similar in size to the A variant, the B sacrifices about a third of the A variant's fuel volume to accommodate the vertical flight system. Vertical takeoffs and landings are riskier because of threats such as foreign object damage.Hancock, Ben D. [http://www.globalsecurity.org/military/library/report/1997/Hancock.htm \"The STOVL Joint Strike Fighter in Support of the 21st Century Marine Corps\"]. USMC, 1997. Whereas the F-35A is stressed to 9 g,Sweetman, Bill. [http://www.zinio.com/express3?issue\n368748439 \"Numbers Crunch: True cost of JSF program remains to be seen\"]. Defense Technology International, February 2009, p. 22.[http://www.defenseindustrydaily.com/f-35-hmds-pulls-the-gs-04088/ \"F-35 HMDS Pulls the Gs\".] Defense Industry Daily, 25 October 2007. the F-35B's stress goal is 7 g. , the F-35B is limited to 4.5 g and 400 knots. The next software upgrade includes weapons, and allows 5.5 g and Mach 1.2, with a final target of 7 g and Mach 1.6.Norris, Guy. \"[http://aviationweek.com/blog/pilot-reaction-flying-f-35b Pilot reaction to flying the F-35B]\" Aviation Week & Space Technology, 24 April 2014. Accessed: 15 September 2014. [https://web.archive.org/web/20140727190007/http://aviationweek.com/blog/pilot-reaction-flying-f-35b Archived] on 27 September 2014 The first test flight of the F-35B was conducted on 11 June 2008.Norris, Guy and Graham Warwick. \"F-35B First Flight Boosts JSF as F-22 Loses Supporters\". Aviation Week, 15 June 2008. Another milestone, the first successful ski-jump launch was carried out by BAE test pilot Peter Wilson on 24 June 2015.\n\nUnlike other variants, the F-35B has no landing hook. The \"STOVL/HOOK\" control instead engages conversion between normal and vertical flight.[http://www.defenceaviation.com/2010/03/f-35-flightmode.html \"F-35B STOVL-mode Flight\"]. defenceaviation.com. Retrieved 25 November 2010. Jet thrust is sent directly downwards during vertical flight; the nozzle is being redesigned to spread the output across an oval rather than circular shape in order to limit damage to asphalt and ship decks. The variant's three-bearing swivel nozzle that directs the full thrust of the engine is moved by a \"fueldraulic\" actuator using pressurized fuel as the working fluid.\"Custom tool to save weeks in F-35B test and evaluation\". Naval Air Systems Command, 6 May 2011.\n\nThe U.S. Marine Corps plans to purchase 340 F-35Bs, to replace current inventories of both the F/A-18 Hornet (A, B, C and D-models), and the AV-8B Harrier II, in the fighter and attack roles. The Marines plan to use the F-35B from \"unimproved surfaces at austere bases\" but with \"special, high-temperature concrete designed to handle the heat\".Diamant, Aaron. [https://archive.is/20120806003330/http://yuma.usmc.mil/desertwarrior/2011/12/22/feature1.html \"JSF construction lands another first\"]. USMC, 22 December 2011. The USMC declared initial operational capability with about 50 F-35s running interim block 2B software on 31 July 2015.Majumdar, Dave. [https://archive.is/20120724094828/http://www.defensenews.com/story.php?i\n6613888 \"U.S. Military May Deploy F-35 Before Formal IOC\"]. Defense News, 24 May 2011. The USAF had considered replacing the A-10 with the F-35B, but will not do so because of the F-35B's inability to generate enough sorties.Majumdar, Dave. [http://www.flightglobal.com/news/articles/usaf-f-35b-cannot-generate-enough-sorties-to-replace-a-10-371985/ \"USAF: F-35B cannot generate enough sorties to replace A-10\"]. Flight Magazine, 16 May 2012.\n\nOn 6 January 2011, Gates said that the 2012 budget would call for a two-year pause in F-35B production during which the aircraft faced redesign, or cancellation if unsuccessful.Pew, Glenn. [http://www.avweb.com/avwebflash/news/pentagon_cancel_f35_marine_203914-1.html \"Pentagon May Cancel STOVL Version of F-35\"]. AvWeb, January 2011. In 2011, Lockheed Martin executive vice president Tom Burbage and former Pentagon director of operational testing Tom Christie stated that most program delays were due to the F-35B, which forced massive redesigns of other versions.Cox, Bob. \"F-35 started with recipe for trouble, analysts say\". Star Telegram, 29 January 2011. Lockheed Martin Vice President Steve O’Bryan has said that most F-35B landings will be conventional to reduce stress on vertical lift components.Ewing, Philip. [http://www.dodbuzz.com/2011/06/07/lockheed-many-f-35b-landings-wont-be-vertical/ \"Lockheed: Many F-35B landings won’t be vertical\"]. DoD Buzz, 7 June 2011. These conventional mode takeoffs and landings cause an \"unacceptable wear rate\" to the aircraft's \"poorly designed\" tires. USMC Lt. Gen. Robert Schmidle has said that the vertical lift components would only be used \"a small percentage of the time\" to transfer the aircraft from carriers to land bases. On 3 October 2011, the F-35B began its initial sea-trials by performing a vertical landing on the deck of the amphibious assault ship ,Trimble, Stephen. [http://www.flightglobal.com/blogs/the-dewline/2011/10/video-f-35b-completes-first-sh.html \"VIDEO: F-35B completes first shipboard vertical landing\"]. The DEWline, 4 October 2011. to continue in 2015. Probation status was reportedly ended by Defense Secretary Leon Panetta in January 2012 based on progress made. A heat-resistant anti-skid material called Thermion is being tested on Wasp, also useful against the V-22 exhaust.\n\nBritain's Royal Air Force and Royal Navy plan to introduce the F-35B as a replacement for the Harrier GR9, which was retired in 2010, and Tornado GR4, which will retire in 2019.  The F-35 is intended to be the United Kingdom's primary strike attack aircraft for the next three decades. One of the Royal Navy requirements for the F-35B design was a Shipborne Rolling and Vertical Landing (SRVL) mode to increase maximum landing weight to bring back unused ordnance by using wing lift during landing.[http://www.nao.org.uk/idoc.ashx?docIdc02da1c8-320b-4062-881d-2c24482459b5&version\n-1 \"Major Projects Report 2008\"]. Ministry of Defence. Retrieved 23 November 2009. [http://www.flightglobal.com/articles/2007/06/15/214672/us-marines-eye-uk-jsf-shipborne-technique.html \"US Marines eye UK JSF shipborne technique\"]. Flight International, 15 June 2007. In July 2013, Chief of the Air Staff, Air Chief Marshal Sir Stephen Dalton announced that 617 Squadron would be the first operational Royal Air Force squadron to receive the F-35. The second operational squadron will be the Fleet Air Arm's 809 NAS. In June 2013, the Royal Air Force had received three aircraft of the 48 on order, all of which based at Eglin Air Force base. The F-35 will be based at Royal Air Force Marham and become operational in 2018. In June 2015, the F-35B undertook its first launches from a ski-jump, when one of the UK's aircraft took off using a ramp constructed at NAS Patuxent River. When required to operate from the sea, the Royal Air Force and Royal Navy will operate the F-35B from ships fitted with ski-jumps, as will the Italian Marina Militare. In 2011, the Marina Militare was preparing Grottaglie Air Station for F-35B operations; they are to receive 22 aircraft between 2014 and 2021, with the  aircraft carrier Cavour set to be modified to operate them by 2016.[http://www.military-today.com/navy/cavour.htm \"F-35B on Italian \"Cavour\" aircraft carrier\"]. Military-today.com, 4 December 2011. The British version of the F-35B is not intended to receive the Brimstone 2 missile.\n\nCommandant of the U.S. Marine Corps, General James Amos has said that, in spite of increasing costs and schedule delays, there is no plan B to the F-35B.Kovach, Gretel C. [http://www.signonsandiego.com/news/2010/dec/08/commandant-calls-joint-strike-fighter-essential/ \"Commandant calls Joint Strike Fighter essential\"]. U-T San Diego, 8 December 2010. The F-35B is larger than the aircraft it replaces, which required  to be designed without well deck capabilities.Jean, Grace V. [http://www.nationaldefensemagazine.org/archive/2008/September/Pages/MarinesQuestiontheUtilityof.aspx \"Marines Question the Utility of Their New Amphibious Warship\"].  National Defense Industrial Association, September 2008. In 2011, the USMC and USN signed an agreement by which the USMC will purchase 340 F-35B and 80 F-35C fighters, while the USN will purchase 260 F-35Cs. The five squadrons of USMC F-35Cs will be assigned to Navy carriers; F-35Bs will be used on amphibious ships and ashore.\n\nAlthough the Australian  ships were not originally planned to operate fixed-wing aircraft, in May 2014, the Minister for Defence David Johnston stated in media interviews that the government was considering acquiring F-35B fighters for Canberras, and Prime Minister Tony Abbott instructed 2015 Defence White Paper planners to consider the option of embarking F-35B squadrons aboard the two ships. Supporters of the idea stated that providing fixed-wing support to amphibious operations would maximize aircraft capability, and the presence of a ski-jump ramp, inherited from the original design, meant that the vessels were better suited to STOVL operations than equivalent ships with flat flight decks. Opponents to the idea countered that embarking enough F-35Bs to be effective required abandoning the ships' amphibious capability and would make the pseudo-carriers more valuable targets, modifications would be required to make the flight deck capable of handling vertical-landing thrust and to increase fuel and ordnance capacity for sustained operations, and that the F-35B project itself has been the most expensive and most problematic of the Joint Strike Fighter variants. In July 2015 Australia ended consideration of buying the F-35B for its two largest assault ships, as the ship modifications were projected to cost more than AUS$5 billion (US$4.4 billion). The plan was opposed by the Royal Australian Air Force, as an F-35B order could have diminished the number of F-35As purchased.\n\nThe U.S. Marine Corps plans to disperse its F-35Bs among forward deployed bases to enhance survivability while remaining close to a battlespace, similar to RAF Harrier deployment late in the Cold War, which relied on the use of off-base locations that offered short runways, shelter, and concealment.  Known as distributed STOVL operations (DSO), Marine F-35Bs would sustain operations from temporary bases in allied territory within the range of hostile ballistic and cruise missiles, but be moved between temporary locations inside the enemy's 24- to 48-hour targeting cycle.  This strategy accounts for the F-35B's short range, the shortest of the three variants, with mobile forward arming and refueling points (M-Farps) accommodating KC-130 and MV-22 Osprey aircraft to rearm and refuel the jets, as well as littoral areas for sea links of mobile distribution sites on land.  M-Farps could be based on small airfields, multi-lane roads, or damaged main bases, while F-35Bs would return to U.S. Navy ships, rear-area U.S. Air Force bases, or friendly carriers for scheduled maintenance; metal planking would be needed to protect unprepared roads from the F-35B's engine exhaust, which would be moved between sites by helicopters, and the Marines are studying lighter and more heat-resistant products.[http://aviationweek.com/defense/marines-propose-rapidly-mobile-f-35-operations Marines Propose Rapidly Mobile F-35 Operations] – Aviationweek.com, 16 December 2014\n\nF-35C\n\nCompared to the F-35A, the F-35C carrier variant features larger wings with foldable wingtip sections, larger wing and tail control surfaces for improved low-speed control, stronger landing gear for the stresses of carrier arrested landings, a twin-wheel nose gear, and a stronger tailhook for use with carrier arrestor cables. The larger wing area allows for decreased landing speed while increasing both range and payload.\n\nThe United States Navy intends to buy 480 F-35Cs to replace the F/A-18A, B, C, and D Hornets and complement the Super Hornet fleet.[http://www.globalsecurity.org/military/systems/aircraft/f-35c.htm \"F-35C Carrier Variant Joint Strike Fighter (JSF)\"]. GlobalSecurity.org. Retrieved 16 June 2010. On 27 June 2007, the F-35C completed its Air System Critical Design Review (CDR), allowing the production of the first two functional prototypes.[http://www.prnewswire.com/cgi-bin/stories.pl?ACCT104&STORY\n/www/story/06-27-2007/0004616904&EDATE\"F-35 Navy Version Undergoes Successful Design Review, Readies for Production\"]. Lockheed Martin, 7 June 2007. Retrieved 16 June 2010. The C variant was expected to be available beginning in 2014.Grant, Rebecca L., PhD [http://www.lexingtoninstitute.org/navy-speeds-up-f-35?a\n1&c1171 \"Navy Speeds Up F-35\"]. Lexington Institute, 14 September 2009. Retrieved 20 September 2009. The first F-35C was rolled out on 29 July 2009.[http://frontierindia.net/f-35c-lightning-ii-rolled-out#more-4226 \"F-35C Lightning II rolled out\"].  FrontierIndia.net, 29 July 2009. The United States Marine Corps will also purchase 80 F-35Cs, enough for five squadrons, for use with navy carrier air wings in a joint service agreement signed on 14 March 2011. A recent 2014 document stated that the USMC will also have 4 squadrons of F-35Cs with 10 aircraft per squadron for the Marine Corps' contribution to U.S. Navy carrier air wings.\n\nOn 6 November 2010, the first F-35C arrived at Naval Air Station Patuxent River. The replacement engines for at-sea repair are too large to be transported by current underway replenishment systems.[http://webarchive.loc.gov/all/20130305155514/http://www.navytimes.com/news/2010/11/navy-jsf-engine-too-big-112910w/ \"JSF Engine too big for regular transport at sea\"]. Navy Times, 30 November 2010. In 2011, the F-35Cs were grounded for six days after a software bug was found that could have prevented the control surfaces from being used during flight.Cavas, Christopher P. [https://archive.is/20130121094245/http://www.defensenews.com/story.php?i6915380&c\nAIR&sTOP \"U.S. Navy JSFs Resume Flight Ops After Glitch\"]. Defense News, 24 June 2011. On 27 July 2011, the F-35C test aircraft CF-3 completed its first steam catapult launch during a test flight at Naval Air Engineering Station Lakehurst; the TC-13 Mod 2 test steam catapult, representative of current fleet technology, was used. In addition to catapult launches at varying power levels, a three-week test plan included dual-aircraft jet blast deflector testing and catapult launches using a degraded catapult configuration to measure the effects of steam ingestion on the aircraft.[http://www.navair.navy.mil/index.cfm?fuseactionhome.NAVAIRNewsStory&id\n4712 \"Catapult launches F-35C for the first time\"].  Naval Air Systems Command, 27 July 2011. Retrieved 31 December 2011 \n\nOn 13 August 2011, the F-35 successfully completed jet blast deflector (JBD) testing at Lakehurst. F-35C test aircraft CF-1 along with an F/A-18E tested a combined JBD cooling panel configuration. The tests measured temperature, pressure, sound level, velocity, and other environmental data; the JBD model will enable the operation of all carrier aircraft, including the F-35C. Further carrier suitability testing continued in preparation for initial ship trials in 2013.[http://www.navair.navy.mil/index.cfm?fuseaction\nhome.NAVAIRNewsStory&id=4736 \"F-35C completes jet blast deflector testing\"].  NAVAIR, 22 August 2011. Retrieved 23 August 2011.  On 18 November 2011, the U.S. Navy used its new Electromagnetic Aircraft Launch System (EMALS) to launch an F-35C into the air for the first time.Ewing, Philip. [http://www.dodbuzz.com/2011/11/28/the-future-is-here-emals-launches-f-35/ \"The future is here: EMALS launches F-35\"]. DODbuzz.com, 28 November 2011.\n\nOn 22 June 2013, Strike Fighter Squadron VFA-101 received the Navy's first F-35C at Eglin Air Force Base, Florida.\n\nThe USN is dealing with the following issues in adapting their carriers to operate the F-35C.Majumdar, Dave. [http://www.flightglobal.com/news/articles/us-navy-works-through-f-35c-air-ship-integration-issues-377171/ \"US Navy works through F-35C air-ship integration issues\"]. Flight International, 1 October 2012.\n* The F135 engine exceeds the weight capacity of traditional underway replenishment systems and generates more heat than previous engines.\n* The stealthy skin requires new repair techniques; extensive skin damage will necessitate repairs at Lockheed's land-based facilities.\n* The adoption of lithium-ion batteries needing careful thermal management, and higher voltage systems than traditional fighters.\n* Storing of new weapons not previously employed on carrier aircraft.\n* Large quantities of classified data generated during missions shall require additional security.\n\nIn February 2014, Lockheed said the F-35C was on schedule for sea trials after the tailhook was redesigned.  The new tailhook has a different shape to better catch arresting wires.  Testing on land achieved 36 successful landings.  Sea trials were scheduled for October 2014.\n\nOn 3 November 2014, an F-35C of VX-23, one of the Navy's flight test units, made its first landing on an aircraft carrier when it recovered aboard ; this started a two week deployment of a pair of aircraft for the initial at sea Development Testing I or DTI, the first of three at sea tests planned for the F-35C. The initial deployment was completed on November 14.\n\nThe U.S. Navy may use the F-35C as part of its UCLASS effort to operate a carrier-based unmanned aerial vehicle.  Though it has been suggested that the UCLASS could carry air-to-air weapons, an unmanned aircraft lacks situational awareness and is more vulnerable to electronic countermeasures than manned aircraft, and autonomy for deploying lethal weapons is not under development.  With the F-35C as the center of a network of naval systems, it could feed information to the UCLASS and order it to fire on a certain target.  Large numbers of F-35Cs operating in contested environments can generate a clear picture of the battlespace, and share it with unmanned assets that can be directed to attack.\n\nVFA-147 was selected to be the first operational squadron to transition to the F-35C in January 2018. Operational testing was to continue aboard  at the beginning of 2018. The carrier is the first to be modernized to operate the F-35C. Initial operating capability is expected between mid-2018 and early 2019, with the first deployment is scheduled aboard  in 2020. The F-35C will equip two of the four strike fighter squadrons in a carrier air wing.[http://www.janes.com/article/67250/usn-stands-up-f-35c-west-coast-fleet-replacement-squadron USN stands up F-35C West Coast Fleet Replacement Squadron], by Gareth Jennings, London – IHS Jane's Navy International, 26 January 2017; retrieved 11 May 2017.\n\nOther versions\n\nF-35I\n\nThe F-35I Adir (, meaning \"Awesome\", or \"Mighty One\") is an F-35A with Israeli modifications. A senior Israel Air Force official stated \"the aircraft will be designated F-35I, as there will be unique Israeli features installed in them\". Despite an initial refusal to allow such modifications, the U.S. has agreed to let Israel integrate its own electronic warfare systems, such as sensors and countermeasures, into the aircraft. The main computer will have a plug-and-play feature to allow add-on Israeli electronics to be used; proposed systems include an external jamming pod, and new Israeli air-to-air missiles and guided bombs in the internal weapon bays.Ben-David, Alon. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channel\ndefense&idnews/awst/2010/08/23/AW_08_23_2010_p32-249396.xml \"Israel To Buy F-35s With Cockpit Mods\"]. Aviation Week, 27 August 2010. Ben-David, Alon, Amy Butler and Robert Wall. [http://www.aviationweek.com/aw/generic/story.jsp?channelawst&id\nnews/awst/2011/07/04/AW_07_04_2011_p22-342412.xml&headlineIsrael,%20U.S.%20Strike%20F-35%20Technology%20Deal&prev\n10 \"Israel, U.S. Strike F-35 Technology Deal\"]. Aviation Week, 7 July 2011. Retrieved 8 October 2011. \n\nIsrael Aerospace Industries (IAI) has considered playing a role in the development of a proposed two-seat F-35; an IAI executive stated: \"There is a known demand for two seats not only from Israel but from other air forces\".Trimble, Stephen. [http://www.flightglobal.com/news/articles/israel-sets-sights-on-two-seater-f-35-337464/ \"Israel sets sights on two-seater F-35\"]. Flight International, 22 January 2010. IAI plans to produce conformal fuel tanks.Egozi, Arie. [http://www.flightglobal.com/news/articles/israel-to-boost-range-of-future-f-35-fleet-220748/ \"Israel to boost range of future F-35 fleet\"]. Flight International. 11 January 2008. A senior IAF official stated that elements of the F-35's stealth may be overcome in 5 to 10 years, while the aircraft will be in service for 30 to 40 years, which is why Israel insisted on installing their own electronic warfare systems: \"The basic F-35 design is OK. We can make do with adding integrated software\".[http://www.aviationweek.com/Article.aspx?id/article-xml/AW_08_06_2012_p28-482027.xml \"Israel, U.S. Agree To $450 Million In F-35 EW Work\"].  Aviation Week, 6 August 2012. Israel is interested in purchasing up to 75 F-35s.\n\nOn 12 December 2016, Israel began receiving its first F-35Is of the 50 it plans to purchase for integration and testing. Israel is to be the second nation with an operational F-35 squadron following the U.S.   The first nine F-35s became operational (at initial operating capacity) in the Israeli Air Force in December 2017.[http://www.inss.org.il/publication/adir-in-the-sky-the-f-35-arrives-in-israel “Adir” in the Sky: The F-35 Arrives in Israel] INSS Insight No. 875, December 12, 2016\n\nCF-35\n\nThe Canadian CF-35 is a proposed variant that would differ from the F-35A through the addition of a drogue parachute and may include an F-35B/C-style refueling probe. In 2012, it was revealed that the CF-35 would employ the same boom refueling system as the F-35A. One alternative proposal would have been the adoption of the F-35C for its probe refueling and lower landing speed; the Parliamentary Budget Officer's report cited the F-35C's limited performance and payload as being too high a price to pay. Following the 2015 Federal Election, in which the Liberal Party, whose campaign had included a pledge to cancel the F-35 procurement, won a majority in the House of Commons, and stated it would run a new competition for an aircraft to replace the existing CF-18 Hornet.\n\nF-35D\n\nEarly-stage design study for a possible upgrade of the F-35A to be fielded by the 2035 target date of the Air Force Future Operating Concept.\n\nOperators\n\nF-35A\n\n;\n* Royal Australian Air Force – 2 delivered, 70 on order, up to 28 additional planned\n;\n* Royal Danish Air Force – 27 planned\n\n;\n* Israeli Air Force – 9 delivered and operational (F-35I). 50 ordered in total, from a total of 75 planned for the near future.[http://www.inss.org.il/publication/adir-in-the-sky-the-f-35-arrives-in-israel “Adir” in the Sky: The F-35 Arrives in Israel] INSS Insight No. 875, December 12, 2016.\n** 140 Squadron[http://www.israelnationalnews.com/News/News.aspx/220903 Israel ups stealth fighter purchase to 50 planes] Arutz Sheva Staff, 27/11/16\n;\n* Italian Air Force – 8 operational and 1 on delivery, 2 more on order with 17 more ordered for delivery up to 2019;http://www.corteconti.it/export/sites/portalecdc/_documenti/controllo/sezioni_riunite/sezioni_riunite_in_sede_di_controllo/2017/parifica_2016_volume_II_2016.pdf. Retrieved 15 September 2017. up to 60 total planned.[https://www.flightglobal.com/news/articles/italy-claims-first-f-35-transatlantic-crossing-421670/ Italy claims first F-35 transatlantic crossing], Flightglobal. Retrieved 7 April 2016.\n** 32º Stormo\n;\n* Japan Air Self-Defense Force – 5 on order; 37 additional planned of which 38 to be built by Mitsubishi.[http://www.lockheedmartin.com/us/news/press-releases/2016/september/lockheed-martin-and-japan-celebrate-roll-out-of-japan-air-self-defense-force-first-f-35a.html Lockheed Martin and Japan Celebrate Roll Out of Japan Air Self Defense Force’s First F-35A], retrieved 29 September 2016\n\n;\n* Royal Netherlands Air Force – 2 in use for testing, 8 on order, 27 additional planned\n** 323 Squadron\n;\n* Royal Norwegian Air Force – 7 operational and used for training of Norwegian pilots in the US, 3 delivered to Norway for testing and integration, with 45 additional planned\n;\n* Republic of Korea Air Force – 40 ordered A further 20 were ordered in December 2017.\n;\n* Turkish Air Force – 14 on order, up to 120 total plannedBURAK EGE BEKDIL. \"[http://webarchive.loc.gov/all/20140507162858/http://www.defensenews.com/article/20140507/DEFREG01/305070036/Turkey-Orders-First-Two-F-35s Turkey Orders First Two F-35s]\" DefenseNews, 7 May 2014. Accessed: 10 May 2014.[https://www.haaretz.com/middle-east-news/turkey/1.749708 \"Turkey Plans More F-35 Orders After Receiving First Batch in 2018\"]\n;\n* United States Air Force – 1,763 planned\n** 33d Fighter Wing AETC – Eglin AFB, Florida\n*** 58th Fighter Squadron\n** 53d Wing, ACC - Eglin AFB, Florida\n*** 31st Test and Evaluation Squadron – Edwards AFB, California (53d Test and Evaluation Group)\n*** 422d Test and Evaluation Squadron – Nellis AFB, Nevada (53d Test and Evaluation Group)\n** 56th Fighter Wing AETC – Luke AFB, Arizona\n*** 61st Fighter Squadron\n*** 62d Fighter Squadron\n*** 63d Fighter Squadron\n** 388th Fighter Wing ACC – Hill AFB, Utah\n*** 4th Fighter Squadron\n*** 34th Fighter Squadron\n*** 421st Fighter Squadron\n** 412th Test Wing AMC – Edwards AFB, California\n*** 461st Flight Test Squadron\n** 419th Fighter Wing AFRC – Hill AFB, Utah\n*** 466th Fighter Squadron\n\nF-35B\n\n;\n* Italian Air Force – 15 planned\n* Italian Navy – 15 planned[http://archive.defensenews.com/article/20120515/DEFREG01/305150010/Italian-AF-Navy-Head-F-35B-Showdown Italian AF, Navy Head for F-35B Showdown] , defensenews.com. Retrieved 10 February 2015. of which 1 delivered with 4 on order for delivery by 2019.\n; – \n* Royal Air Force\n** 17 Squadron (test and evaluation)\n** 207 Squadron (Operational Conversion Unit)\n** 617 Squadron\n** Unspecified squadron\n* Royal Navy\n** 809 Naval Air Squadron[http://www.royalnavy.mod.uk/News-and-Events/Latest-News/2013/September/09/130909-809-Air-Squadron 'Immortal’ air squadron to fly Royal Navy’s newest jets], royalnavy.mod.uk. Retrieved 31 May 2015.\n** Unspecified squadron\n;\n* United States Marine Corps – 340 planned\n** VMX-1 – Edwards AFB, California\n** VMFA-121 – MCAS Iwakuni, Japan\n** VMFA-122 – MCAS Yuma, Arizona\n** VMFA-211 – MCAS Yuma, Arizona\n** VMFAT-501 – MCAS Beaufort, South Carolina\n\nF-35C\n\n;\n* United States Marine Corps – 80 planned\n** VFA-101 – Eglin AFB, Florida (Navy squadron, but trains both Navy and Marine F-35C pilots, and operates Navy and Marine F-35Cs maintained by both sailors and Marines. This is the same arrangement as other aircraft common to the Navy and Marine Corps.)\n* United States Navy – 260 planned\n** VX-9 – Edwards AFB, California\n** VX-23 – NAS Patuxent River, Maryland\n** VFA-101 – Eglin AFB, Florida\n** VFA-125 – NAS Lemoore, California\n\nAccidents\n\nOn 23 June 2014, an F-35A preparing to take off on a training flight at Eglin Air Force Base experienced a fire in the engine area. The pilot escaped unharmed. The accident caused all training to be halted on 25 June, and all flights halted on 3 July. During the incident investigation, engine parts from the burned aircraft were discovered on the runway, indicating it was a substantial engine failure. The fleet was returned to flight on 15 July with restrictions in the flight envelope. Preliminary findings suggests that excessive rubbing of the engine fan blades created increased stress and wear and eventually resulted in catastrophic failure of the fan.\n\nIn early June 2015, the USAF Air Education and Training Command (AETC) issued its official report on the incident. It found that the incident was the result of a failure of the third stage rotor of the engine's fan module. The report explained that \"pieces of the failed rotor arm cut through the engine's fan case, the engine bay, an internal fuel tank, and hydraulic and fuel lines before exiting through the aircraft's upper fuselage\". Pratt & Whitney, the engine manufacturer, developed two remedies to the problem. The first is an extended \"rub-in\" to increase the gap between the second stator and the third rotor integral arm seal. The second is the redesign to pre-trench the stator. Both were scheduled for completion by early 2016. Cost of the problem was estimated at US$50 million. All aircraft resumed operations within 25 days of the incident.\n\nSpecifications (F-35A)\n\nAppearances in media. Lockheed Martin F-35 Lightning II. http://en.wikipedia.org/?curid=11812."
  }
}
