{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7697",
  "eid" : "e2dec760-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778460374,
  "textBody" : "The Lockheed C-130 Hercules is a four-engine turboprop military transport aircraft designed and built originally by Lockheed (now Lockheed Martin). Capable of using unprepared runways for takeoffs and landings, the C-130 was originally designed as a troop, medevac, and cargo transport aircraft. The versatile airframe has found uses in a variety of other roles, including as a gunship (AC-130), for airborne assault, search and rescue, scientific research support, weather reconnaissance, aerial refueling, maritime patrol, and aerial firefighting. It is now the main tactical airlifter for many military forces worldwide. Over forty variants and versions of the Hercules, including a civilian one marketed as the Lockheed L-100, operate in more than 60 nations.\n\nThe C-130 entered service with the U.S. in the 1950s, followed by Australia and others. During its years of service, the Hercules family has participated in numerous military, civilian and humanitarian aid operations. In 2007, the C-130 became the fifth aircraft—after the English Electric Canberra, B-52 Stratofortress, Tupolev Tu-95, and KC-135 Stratotanker—to mark 50 years of continuous service with its original primary customer, in this case, the United States Air Force. The C-130 Hercules is the longest continuously produced military aircraft at over 60 years, with the updated Lockheed Martin C-130J Super Hercules currently being produced.\n\nDesign and development\n\nBackground and requirements\n\nThe Korean War showed that World War II-era piston-engine transports—Fairchild C-119 Flying Boxcars, Douglas C-47 Skytrains and Curtiss C-46 Commandos—were inadequate for modern warfare. Thus, on 2 February 1951, the United States Air Force issued a General Operating Requirement (GOR) for a new transport to Boeing, Douglas, Fairchild, Lockheed, Martin, Chase Aircraft, North American, Northrop, and Airlifts Inc. The new transport would have a capacity of 92 passengers, 72 combat troops or 64 paratroopers in a cargo compartment that was approximately 41 ft long, 9 ft high, and 10 ft wide. Unlike transports derived from passenger airliners, it was to be designed from the ground-up as a combat transport with loading from a hinged loading ramp at the rear of the fuselage.\n\nA key feature was the introduction of the Allison T56 turboprop powerplant, first developed specifically for the C-130. At the time, the turboprop was a new application of gas turbines, which offered greater range at propeller-driven speeds compared to pure turbojets, which were faster but consumed more fuel. They also produced much more power for their weight than piston engines.\n\nDesign phase\n\nThe Hercules resembled a larger four-engine brother to the C-123 Provider with a similar wing and cargo ramp layout that evolved from the Chase XCG-20 Avitruc, which in turn, was first designed and flown as a cargo glider in 1947.[http://www.globalsecurity.org/military/systems/aircraft/cg-20.htm \"Chase XCG-20 Avitruc.\"] globalsecurity.org. Retrieved: 2 October 2010. The Boeing C-97 Stratofreighter also had a rear ramp, which made it possible to drive vehicles onto the plane (also possible with forward ramp on a C-124). The ramp on the Hercules was also used to airdrop cargo, which included low-altitude extraction for Sheridan tanks and even dropping large improvised \"daisy cutter\" bombs.\n\nThe new Lockheed cargo plane design possessed a range of 1100 nmi, takeoff capability from short and unprepared strips, and the ability to fly with one engine shut down. Fairchild, North American, Martin, and Northrop declined to participate. The remaining five companies tendered a total of ten designs: Lockheed two, Boeing one, Chase three, Douglas three, and Airlifts Inc. one. The contest was a close affair between the lighter of the two Lockheed (preliminary project designation L-206) proposals and a four-turboprop Douglas design.\n\nThe Lockheed design team was led by Willis Hawkins, starting with a 130-page proposal for the Lockheed L-206.Rhodes, Jeff. \"Willis Hawkins and the Genesis of the Hercules.\" Code One Magazine, Volume 19, Issue 3, 2004. Hall Hibbard, Lockheed vice president and chief engineer, saw the proposal and directed it to Kelly Johnson, who did not care for the low-speed, unarmed aircraft, and remarked, \"If you sign that letter, you will destroy the Lockheed Company.\" Both Hibbard and Johnson signed the proposal and the company won the contract for the now-designated Model 82 on 2 July 1951.Boyne, Walter J. Beyond the Horizons: The Lockheed Story. New York: St. Martin's Press, 1998. .\n\nThe first flight of the YC-130 prototype was made on 23 August 1954 from the Lockheed plant in Burbank, California. The aircraft, serial number 53-3397, was the second prototype, but the first of the two to fly. The YC-130 was piloted by Stanley Beltz and Roy Wimmer on its 61-minute flight to Edwards Air Force Base; Jack Real and Dick Stanton served as flight engineers. Kelly Johnson flew chase in a Lockheed P2V Neptune.Dabney, Joseph E. A. \"Mating of the Jeep, the Truck, and the Airplane.\" lockheedmartin.com, 2004. Excerpted from HERK: Hero of the Skies in Lockheed Martin Service News, Lockheed Martin Air Mobility Support  Volume 29, Issue 2, p. 3.\n\nAfter the two prototypes were completed, production began in Marietta, Georgia, where over 2,300 C-130s have been built through 2009.Olausson 2009, p. 129.\n\nThe initial production model, the C-130A, was powered by Allison T56-A-9 turboprops with three-blade propellers and originally equipped with the blunt nose of the prototypes. Deliveries began in December 1956, continuing until the introduction of the C-130B model in 1959. Some A-models were equipped with skis and re-designated C-130D.  As the C-130A became operational with Tactical Air Command (TAC), the C-130's lack of range became apparent and additional fuel capacity was added in the form of external pylon-mounted tanks at the end of the wings.\n\nImproved versions\n\nThe C-130B model was developed to complement the A-models that had previously been delivered, and incorporated new features, particularly increased fuel capacity in the form of auxiliary tanks built into the center wing section and an AC electrical system. Four-bladed Hamilton Standard propellers replaced the Aeroproducts three-blade propellers that distinguished the earlier A-models.  The C-130B had ailerons with boost increased from 2050 psi to 3000 psi, as well as uprated engines and four-blade propellers that were standard until the J-model's introduction.\n\nAn electronic reconnaissance variant of the C-130B was designated C-130B-II. A total of 13 aircraft were converted. The C-130B-II was distinguished by its false external wing fuel tanks, which were disguised signals intelligence (SIGINT) receiver antennas. These pods were slightly larger than the standard wing tanks found on other C-130Bs. Most aircraft featured a swept blade antenna on the upper fuselage, as well as extra wire antennas between the vertical fin and upper fuselage not found on other C-130s. Radio call numbers on the tail of these aircraft were regularly changed so as to confuse observers and disguise their true mission.\n\nThe extended-range C-130E model entered service in 1962 after it was developed as an interim long-range transport for the Military Air Transport Service. Essentially a B-model, the new designation was the result of the installation of 1,360 US gal (5,150 L) Sargent Fletcher external fuel tanks under each wing's midsection and more powerful Allison T56-A-7A turboprops. The hydraulic boost pressure to the ailerons was reduced back to 2050 psi as a consequence of the external tanks' weight in the middle of the wingspan. The E model also featured structural improvements, avionics upgrades and a higher gross weight. Australia took delivery of 12 C130E Hercules during 1966–67 to supplement the 12 C-130A models already in service with the RAAF. Sweden and Spain fly the TP-84T version of the C-130E fitted for aerial refueling capability.\n\nThe KC-130 tankers, originally C-130F procured for the US Marine Corps (USMC) in 1958 (under the designation GV-1) are equipped with a removable 3,600 US gal (13,626 L) stainless steel fuel tank carried inside the cargo compartment. The two wing-mounted hose and drogue aerial refueling pods each transfer up to 300 US gal per minute (19 L per second) to two aircraft simultaneously, allowing for rapid cycle times of multiple-receiver aircraft formations, (a typical tanker formation of four aircraft in less than 30 minutes). The US Navy's C-130G has increased structural strength allowing higher gross weight operation.\n\nFurther developments\n\nThe C-130H model has updated Allison T56-A-15 turboprops, a redesigned outer wing, updated avionics and other minor improvements. Later H models had a new, fatigue-life-improved, center wing that was retrofitted to many earlier H-models. For structural reasons, some models are required to land with certain amounts of fuel when carrying heavy cargo, reducing usable range.Cassidy, J. \"[http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ADA391744 C-130 Transportability of Army Vehicles]\" p. 3. Defense Technical Information Center, 2001 The H model remains in widespread use with the United States Air Force (USAF) and many foreign air forces. Initial deliveries began in 1964 (to the RNZAF), remaining in production until 1996. An improved C-130H was introduced in 1974, with Australia purchasing 12 of type in 1978 to replace the original 12 C-130A models, which had first entered RAAF Service in 1958.  The U.S. Coast Guard employs the HC-130H for long-range search and rescue, drug interdiction, illegal migrant patrols, homeland security, and logistics.\n\nC-130H models produced from 1992 to 1996 were designated as C-130H3 by the USAF. The \"3\" denoting the third variation in design for the H series. Improvements included ring laser gyros for the INUs, GPS receivers, a partial glass cockpit (ADI and HSI instruments), a more capable APN-241 color radar, night vision device compatible instrument lighting, and an integrated radar and missile warning system. The electrical system upgrade included Generator Control Units (GCU) and Bus Switching units (BSU) to provide stable power to the more sensitive upgraded components.\n\nThe equivalent model for export to the UK is the C-130K, known by the Royal Air Force (RAF) as the Hercules C.1. The C-130H-30 (Hercules C.3 in RAF service) is a stretched version of the original Hercules, achieved by inserting a 100 in (2.54 m) plug aft of the cockpit and an 80 in (2.03 m) plug at the rear of the fuselage. A single C-130K was purchased by the Met Office for use by its Meteorological Research Flight, where it was classified as the Hercules W.2. This aircraft was heavily modified (with its most prominent feature being the long red and white striped atmospheric probe on the nose and the move of the weather radar into a pod above the forward fuselage). This aircraft, named Snoopy, was withdrawn in 2001 and was then modified by Marshall of Cambridge Aerospace as flight-testbed for the A400M turbine engine, the TP400. The C-130K is used by the RAF Falcons for parachute drops. Three C-130K (Hercules C Mk.1P) were upgraded and sold to the Austrian Air Force in 2002.[http://www.doppeladler.com/oebh/luftfahrzeuge/c130.htm \"C-130K in the Austrian Air Force.\"] doppeladler.com. Retrieved: 2 October 2010.\n\nEnhanced models\n\nThe MC-130E Combat Talon was developed for the USAF during the Vietnam War to support special operations missions in Southeast Asia, and led to both the MC-130H Combat Talon II as well as a family of other special missions aircraft. 37 of the earliest models currently operating with the Air Force Special Operations Command (AFSOC) are scheduled to be replaced by new-production MC-130J versions. The EC-130 Commando Solo is another special missions variant within AFSOC, albeit operated solely by an AFSOC-gained wing in the Pennsylvania Air National Guard, and is a psychological operations/information operations (PSYOP/IO) platform equipped as an aerial radio station and television stations able to transmit messaging over commercial frequencies. Other versions of the EC-130, most notably the EC-130H Compass Call, are also special variants, but are assigned to the Air Combat Command (ACC). The AC-130 gunship was first developed during the Vietnam War to provide close air support and other ground-attack duties.\n\nThe HC-130 is a family of long-range search and rescue variants used by the USAF and the U.S. Coast Guard. Equipped for deep deployment of Pararescuemen (PJs), survival equipment, and (in the case of USAF versions) aerial refueling of combat rescue helicopters, HC-130s are usually the on-scene command aircraft for combat SAR missions (USAF only) and non-combat SAR (USAF and USCG). Early USAF versions were also equipped with the Fulton surface-to-air recovery system, designed to pull a person off the ground using a wire strung from a helium balloon. The John Wayne movie The Green Berets features its use. The Fulton system was later removed when aerial refueling of helicopters proved safer and more versatile. The movie The Perfect Storm depicts a real life SAR mission involving aerial refueling of a New York Air National Guard HH-60G by a New York Air National Guard HC-130P.\n\nThe C-130R and C-130T are U.S. Navy and USMC models, both equipped with underwing external fuel tanks. The USN C-130T is similar, but has additional avionics improvements. In both models, aircraft are equipped with Allison T56-A-16 engines. The USMC versions are designated KC-130R or KC-130T when equipped with underwing refueling pods and pylons and are fully night vision system compatible.\n\nThe RC-130 is a reconnaissance version. A single example is used by the Islamic Republic of Iran Air Force, the aircraft having originally been sold to the former Imperial Iranian Air Force.\n\nThe Lockheed L-100 (L-382) is a civilian variant, equivalent to a C-130E model without military equipment. The L-100 also has two stretched versions.\n\nNext generation\n\nIn the 1970s, Lockheed proposed a C-130 variant with turbofan engines rather than turboprops, but the U.S. Air Force preferred the takeoff performance of the existing aircraft. In the 1980s, the C-130 was intended to be replaced by the Advanced Medium STOL Transport project. The project was canceled and the C-130 has remained in production.\n\nBuilding on lessons learned, Lockheed Martin modified a commercial variant of the C-130 into a High Technology Test Bed (HTTB). This test aircraft set numerous short takeoff and landing performance records and significantly expanded the database for future derivatives of the C-130.[http://www.nasa.gov/centers/langley/news/factsheets/C130.html NASA and Lockheed Martin Partners In C-130 Technology] Retrieved 21 May 2013.  Modifications made to the HTTB included extended chord ailerons, a long chord rudder, fast-acting double-slotted trailing edge flaps, a high-camber wing leading edge extension, a larger dorsal fin and dorsal fins, the addition of three spoiler panels to each wing upper surface, a long-stroke main and nose landing gear system, and changes to the flight controls and a change from direct mechanical linkages assisted by hydraulic boost, to fully powered controls, in which the mechanical linkages from the flight station controls operated only the hydraulic control valves of the appropriate boost unit.[http://www.lockheedmartin.com/content/dam/lockheed/data/aero/documents/global-sustainment/product-support/Service-News/V12N3.pdf The High Technology Test Bed] Lockheed Service News Vol. 12 No. 3, September 1985. Retrieved 21 May 2013. The HTTB first flew on 19 June 1984, with civil registration of N130X. After demonstrating many new technologies, some of which were applied to the C-130J, the HTTB was lost in a fatal accident on 3 February 1993, at Dobbins Air Reserve Base, in Marietta, Georgia.  The crash was attributed to disengagement of the rudder fly-by-wire flight control system, resulting in a total loss of rudder control capability while conducting ground minimum control speed tests (Vmcg). The disengagement was a result of the inadequate design of the rudder's integrated actuator package by its manufacturer; the operator's insufficient system safety review failed to consider the consequences of the inadequate design to all operating regimes. A factor which contributed to the accident was the flight crew's lack of engineering flight test training.[http://aviation-safety.net/database/record.php?id=19930203-1 ASN Aircraft Accident] Retrieved 21 May 2013.\n\nIn the 1990s, the improved C-130J Super Hercules was developed by Lockheed (later Lockheed Martin). This model is the newest version and the only model in production. Externally similar to the classic Hercules in general appearance, the J model has new turboprop engines, six-bladed propellers, digital avionics, and other new systems.\n\nUpgrades and changes\n\nIn 2000, Boeing was awarded a  contract to develop an Avionics Modernization Program kit for the C-130. The program was beset with delays and cost overruns until project restructuring in 2007.Trimble, Stephen. [http://www.flightglobal.com/articles/2010/06/24/343673/boeing-outlines-c-130h-and-kc-10-cockpit-upgrades.html \"Boeing outlines C-130H and KC-10 cockpit upgrades.\"] Flightglobal. Retrieved: 2 October 2010. On 2 September 2009, Bloomberg news reported that the planned Avionics Modernization Program (AMP) upgrade to the older C-130s would be dropped to provide more funds for the F-35, CV-22 and airborne tanker replacement programs.Capaccio, Tony. [https://www.bloomberg.com/apps/news?pid\n20601109&sidaEiJr36oaC7w \"Air Force Would Cancel Boeing C-130 Upgrade, 15 Other Programs.\"] Bloomberg, 2 September 2009. Retrieved 2 October 2010. However, in June 2010, Department of Defense approved funding for the initial production of the AMP upgrade kits.Wall, Robert. [http://www.aviationweek.com/aw/generic/story.jsp?id\nnews/asd/2010/06/25/01.xml&headlinePentagon%20Approves%20C-130%20AMP%20Production&channel\ndefense \"Pentagon Approves C-130 AMP Production.\"] Aviation Week, 25 June 2010.[http://boeing.mediaroom.com/index.php?s43&item\n1275 \"Boeing C-130 Avionics Modernization Program to Enter Production.\"] Boeing, 24 June 2010. Under the terms of this agreement, the USAF has cleared Boeing to begin low-rate initial production (LRIP) for the C-130 AMP. A total of 198 aircraft are expected to feature the AMP upgrade. The current cost per aircraft is  although Boeing expects that this price will drop to US$7 million for the 69th aircraft.\n\nIn the 2000s, Lockheed Martin and the U.S. Air Force began outfitting and retrofitting C-130s with the eight-blade UTC Aerospace Systems NP2000 propellers.\n\nAn engine enhancement program saving fuel and providing lower temperatures in the T56 engine has been approved, and the US Air Force expects to save $2 billion and extend the fleet life.\"[http://www.aero-news.net/subscribe.cfm?domain.textpost&id\n95b16316-e19c-47eb-8ba7-0048908e816f NOAA 'Hurricane Hunters' First To Get T56 Series 3.5 Engine Enhancement]\" Aero News, November 14, 2013. Accessed: December 1, 2013.\n\nReplacement\n\nIn October 2010, the Air Force released a capabilities request for information (CRFI) for the development of a new airlifter to replace the C-130. The new aircraft is to carry a 190 percent greater payload and assume the mission of mounted vertical maneuver (MVM). The greater payload and mission would enable it to carry medium-weight armored vehicles and drop them off at locations without long runways.  Various options are being considered, including new or upgraded fixed-wing designs, rotorcraft, tiltrotors, or even an airship. Development could start in 2014, and become operational by 2024. The C-130 fleet of around 450 planes would be replaced by only 250 aircraft.[http://www.flightglobal.com/blogs/the-dewline/2010/10/usaf-asks-industry-to-answer-c/ USAF asks industry to answer C-130 replacement questions] - Flightglobal.com, 22 October 2010 The Air Force had attempted to replace the C-130 in the 1970s through the Advanced Medium STOL Transport project, which resulted in the C-17 Globemaster III that instead replaced the C-141 Starlifter.[http://www.flightglobal.com/blogs/the-dewline/2011/09/images-lockheeds-stealth-c-130/ Lockheed's stealth C-130 successor revealed] - Flightglobal.com, 13 September 2011 The Air Force Research Laboratory funded Lockheed and Boeing demonstrators for the Speed Agile concept, which had the goal of making a STOL aircraft that can take off and land at speeds as low as 70 kn on airfields less than 2,000 ft (610 m) long and cruise at Mach 0.8-plus. Boeing's design used upper-surface blowing from embedded engines on the inboard wing and blown flaps for circulation control on the outboard wing. Lockheed's design also used blown flaps outboard, but inboard used patented reversing ejector nozzles. Boeing's design completed over 2,000 hours of windtunnel tests in late 2009.  It was a 5 percent-scale model of a narrowbody design with a  payload. When the AFRL increased the payload requirement to , they tested a 5% scale model of a widebody design with a  take-off gross weight and an \"A400M-size\" 158 in wide cargo box. It would be powered by four IAE V2533 turbofans.[http://www.aviationweek.com/Blogs.aspx?plckBlogId\nblog:27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostIdBlog:27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post:4ed2785f-832c-4f7f-8a7b-1d820cb2b07a Fast STOL - Lockheed's Speed Agile]  - Aviationweek.com, 15 October 2010 In August 2011, the AFRL released pictures of the Lockheed Speed Agile concept demonstrator. A 23% scale model went through wind tunnel tests to demonstrate its hybrid powered lift, which combines a low drag airframe with simple mechanical assembly to reduce weight and better aerodynamics. The model had four engines, including two Williams FJ44 turbofans.[http://defensetech.org/2011/09/15/lockheeds-new-stol-airlifter-design/ Lockheed's New STOL Airlifter Design] - Defensetech.org, 15 September 2011 On 26 March 2013, Boeing was granted a patent for its swept-wing powered lift aircraft.[http://www.flightglobal.com/blogs/the-dewline/2013/04/boeing-awarded-patent-speed-ag/ Boeing awarded patent for Speed Agile stealth transport concept] - Flightglobal.com, 2 April 2013\n\nAs of January 2014, Air Mobility Command, Air Force Materiel Command and the Air Force Research Lab are in the early stages of defining requirements for the C-X next generation airlifter program to replace both the C-130 and C-17. An aircraft would be produced from the early 2030s to the 2040s. If requirements are decided for operating in contested airspace, Air Force procurement of C-130s would end by the end of the decade to not have them serviceable by the 2030s and operated when they cannot perform in that environment. Development of the airlifter depends heavily on the Army's \"tactical and operational maneuver\" plans. Two different cargo planes could still be created to separately perform tactical and strategic missions, but which course to pursue is to be decided before C-17s need to be retired.[http://www.airforcemag.com/DRArchive/Pages/2014/January%202014/January%2002%202014/Requirements-Mulled-for-Next-Generation-Airlifter.aspx Requirements Mulled for Next-Generation Airlifter] - Airforcemag.com, 2 January 2014\n\nOperational history\n\nMilitary\n\nThe first batch of C-130A production aircraft were delivered beginning in 1956 to the 463d Troop Carrier Wing at Ardmore AFB, Oklahoma and the 314th Troop Carrier Wing at Sewart AFB, Tennessee. Six additional squadrons were assigned to the 322d Air Division in Europe and the 315th Air Division in the Far East. Additional aircraft were modified for electronics intelligence work and assigned to Rhein-Main Air Base, Germany while modified RC-130As were assigned to the Military Air Transport Service (MATS) photo-mapping division.\n\nIn 1958, a U.S. reconnaissance C-130A-II of the 7406th Support Squadron was shot down over Armenia by four Soviet MiG-17s along the Turkish-Armenian border during a routine mission.\n\nAustralia became the first non-American force to operate the C-130A Hercules with 12 examples being delivered from late 1958. The Royal Canadian Air Force became another early user with the delivery of four B-models (Canadian designation C-130 Mk I) in October / November 1960.\n\nIn 1963, a Hercules achieved and still holds the record for the largest and heaviest aircraft to land on an aircraft carrier.[http://www.defenceaviation.com/2007/06/c-130-hercules-on-aircraft-carrier.html \"C-130 Hercules on Aircraft carrier.\"] Defence Aviation, 2 May 2007. Retrieved 2 October 2010. During October and November that year, a USMC KC-130F (BuNo 149798), loaned to the U.S. Naval Air Test Center, made 29 touch-and-go landings, 21 unarrested full-stop landings and 21 unassisted take-offs on  at a number of different weights.[http://navysite.de/cvn/cv59.htm \"USS Forrestal (CV 59).\"] navysite.de (Unofficial U.S. Navy site). Retrieved: 2 October 2010.  The pilot, Lieutenant (later Rear Admiral) James H. Flatley III, USN, was awarded the Distinguished Flying Cross for his role in this test series. The tests were highly successful, but the idea was considered too risky for routine carrier onboard delivery (COD) operations. Instead, the Grumman C-2 Greyhound was developed as a dedicated COD aircraft. The Hercules used in the test, most recently in service with Marine Aerial Refueler Squadron 352 (VMGR-352) until 2005, is now part of the collection of the National Museum of Naval Aviation at NAS Pensacola, Florida.\n\nIn 1964, C-130 crews from the 6315th Operations Group at Naha Air Base, Okinawa commenced forward air control (FAC; \"Flare\") missions over the Ho Chi Minh Trail in Laos supporting USAF strike aircraft. In April 1965 the mission was expanded to North Vietnam where C-130 crews led formations of Martin B-57 Canberra bombers on night reconnaissance/strike missions against communist supply routes leading to South Vietnam. In early 1966 Project Blind Bat/Lamplighter was established at Ubon Royal Thai Air Force Base, Thailand. After the move to Ubon the mission became a four-engine FAC mission with the C-130 crew searching for targets then calling in strike aircraft. Another little-known C-130 mission flown by Naha-based crews was Operation Commando Scarf, which involved the delivery of chemicals onto sections of the Ho Chi Minh Trail in Laos that were designed to produce mud and landslides in hopes of making the truck routes impassable.\n\nIn November 1964, on the other side of the globe, C-130Es from the 464th Troop Carrier Wing but loaned to 322d Air Division in France, took part in Operation Dragon Rouge, one of the most dramatic missions in history in the former Belgian Congo. After communist Simba rebels took white residents of the city of Stanleyville hostage, the U.S. and Belgium developed a joint rescue mission that used the C-130s to drop, air-land and air-lift a force of Belgian paratroopers to rescue the hostages. Two missions were flown, one over Stanleyville and another over Paulis during Thanksgiving weeks.Odom, Maj. T. [https://web.archive.org/web/20100505204701/http://www.cgsc.edu/carl/resources/csi/odom/odom.asp \"Dragon Operations: Hostage Rescues in the Congo, 1964–1965.\"] Combat Studies Institute, January 2009. Retrieved 2 October 2010. The headline-making mission resulted in the first award of the prestigious MacKay Trophy to C-130 crews.\n\nIn the Indo-Pakistani War of 1965, as a desperate measure the transport No. 6 Squadron of the Pakistan Air Force modified its entire small fleet of C-130Bs for use as heavy bombers, capable of carrying up to 20,000 lb (9,072 kg) of bombs on pallets. These improvised bombers were used to hit Indian targets such as bridges, heavy artillery positions, tank formations and troop concentrations.Thomas Newdick's [https://medium.com/war-is-boring/the-unusual-history-of-transport-bomber-planes-2ce280fbb546 \"The Unusual History of Transport Bomber Planes\"] War Is Boring, 2 March 2015. Retrieved 2 September 2015.Group Captain (Retd) SULTAN M HALI's [http://defencejournal.com/dec98/christian.htm \"PAF's Gallant Christian Heroes Carry Quaid's Message\"] Defence Journal, December 1998. Retrieved 5 September 2015. Some C-130s even flew with anti-aircraft guns fitted on their ramp, apparently shooting down some 17 aircraft and damaging 16 others.Tatheer Islam's [http://www.samaa.tv/pakistan/2015/09/paf-entire-c-130-fleet-used-as-bomber-aircraft-in-1965-war/ \"PAF entire C-130 fleet used as bomber aircraft in 1965 war\"] SAMAA TV, 5 September 2015. Retrieved 5 September 2015.\n\nIn October 1968, a C-130Bs from the 463rd Tactical Airlift Wing dropped a pair of M-121 10,000 pound bombs that had been developed for the massive Convair B-36 Peacemaker bomber but had never been used. The U.S. Army and U.S. Air Force resurrected the huge weapons as a means of clearing landing zones for helicopters and in early 1969 the 463rd commenced Commando Vault missions. Although the stated purpose of COMMANDO VAULT was to clear LZs, they were also used on enemy base camps and other targets.\n\nDuring the late 1960s, the U.S. was eager to get information on Chinese nuclear capabilities. After the failure of the Black Cat Squadron to plant operating sensor pods near the Lop Nur Nuclear Weapons Test Base using a Lockheed U-2, the CIA developed a plan, named Heavy Tea, to deploy two battery-powered sensor pallets near the base. To deploy the pallets, a Black Bat Squadron crew was trained in the U.S. to fly the C-130 Hercules. The crew of 12, led by Col Sun Pei Zhen, took off from Takhli Royal Thai Air Force Base in an unmarked U.S. Air Force C-130E on 17 May 1969. Flying for six and a half hours at low altitude in the dark, they arrived over the target and the sensor pallets were dropped by parachute near Anxi in Gansu province. After another six and a half hours of low altitude flight, they arrived back at Takhli. The sensors worked and uploaded data to a U.S. intelligence satellite for six months, before their batteries failed. The Chinese conducted two nuclear tests, on 22 September 1969 and 29 September 1969, during the operating life of the sensor pallets. Another mission to the area was planned as Operation Golden Whip, but was called off in 1970.Pocock, Chris. The Black Bats: CIA Spy Flights over China from Taiwan 1951–1969. Atglen, Ennsylvania: Schiffer Military History, 2010. . It is most likely that the aircraft used on this mission was either C-130E serial number 64-0506 or 64-0507 (cn 382-3990 and 382-3991). These two aircraft were delivered to Air America in 1964.Leeker, Dr. Joe. [http://www.utdallas.edu/library/collections/speccoll/Leeker/c130.pdf \"Air America: Lockheed C-130 Hercules.\"]  The University of Texas at Dallas. 23 August 2010. Retrieved 29 January 2012. After being returned to the U.S. Air Force sometime between 1966 and 1970, they were assigned the serial numbers of C-130s that had been destroyed in accidents. 64-0506 is now flying as 62-1843, a C-130E that crashed in Vietnam on 20 December 1965 and 64-0507 is now flying as 63-7785, a C-130E that had crashed in Vietnam on 17 June 1966.Baugher, Joe [http://www.joebaugher.com/usaf_serials/1964.html 1964 USAF Serial Numbers] Retrieved: 29 January 2012.\n\nThe A-model continued in service through the Vietnam War, where the aircraft assigned to the four squadrons at Naha AB, Okinawa and one at Tachikawa Air Base, Japan performed yeoman's service, including operating highly classified special operations missions such as the BLIND BAT FAC/Flare mission and FACT SHEET leaflet mission over Laos and North Vietnam. The A-model was also provided to the Republic of Vietnam Air Force as part of the Vietnamization program at the end of the war, and equipped three squadrons based at Tan Son Nhut AFB. The last operator in the world is the Honduran Air Force, which is still flying one of five A model Hercules (FAH 558, c/n 3042) as of October 2009.Olausson 2010, p. 5. As the Vietnam War wound down, the 463rd Troop Carrier/Tactical Airlift Wing B-models and A-models of the 374th Tactical Airlift Wing were transferred back to the United States where most were assigned to Air Force Reserve and Air National Guard units.\n\nAnother prominent role for the B model was with the United States Marine Corps, where Hercules initially designated as GV-1s replaced C-119s. After Air Force C-130Ds proved the type's usefulness in Antarctica, the U.S. Navy purchased a number of B-models equipped with skis that were designated as LC-130s. C-130B-II electronic reconnaissance aircraft were operated under the SUN VALLEY program name primarily from Yokota Air Base, Japan. All reverted to standard C-130B cargo aircraft after their replacement in the reconnaissance role by other aircraft.\n\nThe C-130 was also used in the 1976 Entebbe raid in which Israeli commando forces carried a surprise assault to rescue 103 passengers of an airliner hijacked by Palestinian and German terrorists at Entebbe Airport, Uganda. The rescue force—200 soldiers, jeeps, and a black Mercedes-Benz (intended to resemble Ugandan Dictator Idi Amin's vehicle of state)—was flown over 2200 nmi almost entirely at an altitude of less than 100 ft from Israel to Entebbe by four Israeli Air Force (IAF) Hercules aircraft without mid-air refueling (on the way back, the aircraft refueled in Nairobi, Kenya).\n\nDuring the Falklands War () of 1982, Argentine Air Force C-130s undertook highly dangerous, daily re-supply night flights as blockade runners to the Argentine garrison on the Falkland Islands. They also performed daylight maritime survey flights. One was lost during the war, shot down by a Royal Navy Sea Harrier. Argentina also operated two KC-130 tankers during the war, and these refueled both the Douglas A-4 Skyhawks and Navy Dassault-Breguet Super Étendards; some C-130s were modified to operate as bombers with bomb-racks under their wings. The British also used RAF C-130s to support their logistical operations.\n\nDuring the Gulf War of 1991 (Operation Desert Storm), the C-130 Hercules was used operationally by the U.S. Air Force, U.S. Navy and U.S. Marine Corps, along with the air forces of Australia, New Zealand, Saudi Arabia, South Korea and the UK. The MC-130 Combat Talon variant also made the first attacks using the largest conventional bombs in the world, the BLU-82 \"Daisy Cutter\" and GBU-43/B \"Massive Ordnance Air Blast\" bomb, (MOAB). Daisy Cutters were used to clear landing zones and to eliminate mine fields. The weight and size of the weapons make it impossible or impractical to load them on conventional bombers. The GBU-43/B MOAB is a successor to the BLU-82 and can perform the same function, as well as perform strike functions against hardened targets in a low air threat environment.\n\nSince 1992, two successive C-130 aircraft named Fat Albert have served as the support aircraft for the U.S. Navy Blue Angels flight demonstration team. Fat Albert I was a TC-130G (151891),Olausson, Lars, \"Lockheed Hercules Production List 1954–2012\", 28th edition, self-published, Såtenäs, Sweden, March 2010, page 43. while Fat Albert II is a C-130T (164763).Olausson, Lars, \"Lockheed Hercules Production List 1954–2012\", 28th edition, self-published, Såtenäs, Sweden, March 2010, page 120. Although Fat Albert supports a Navy squadron, it is operated by the U.S. Marine Corps (USMC) and its crew consists solely of USMC personnel. At some air shows featuring the team, Fat Albert takes part, performing flyovers. Until 2009, it also demonstrated its rocket-assisted takeoff (RATO) capabilities; these ended due to dwindling supplies of rockets.McCullough, Amy. \"Abort Launch: Air shows to do without Fat Albert's famed JATO.\" Marine Corps Times, 9 November 2009. Retrieved 20 November 2009.\n\nThe AC-130 also holds the record for the longest sustained flight by a C-130. From 22 to 24 October 1997, two AC-130U gunships flew 36 hours nonstop from Hurlburt Field Florida to Taegu (Daegu), South Korea while being refueled seven times by KC-135 tanker aircraft. This record flight shattered the previous record longest flight by over 10 hours while the two gunships took on 410000 lb of fuel. The gunship has been used in every major U.S. combat operation since Vietnam, except for Operation El Dorado Canyon, the 1986 attack on Libya.[http://www.afsoc.af.mil/library/afsocheritage/index.asp \"AFSOC Heritage.\"]  US Air Force Special Operations Command. Retrieved: 31 July 2009.\n\nDuring the invasion of Afghanistan in 2001 and the ongoing support of the International Security Assistance Force (Operation Enduring Freedom), the C-130 Hercules has been used operationally by Australia, Belgium, Canada, Denmark, France, Italy, the Netherlands, New Zealand, Norway, Portugal, South Korea, Spain, the UK and the United States.\n\nDuring the 2003 invasion of Iraq (Operation Iraqi Freedom), the C-130 Hercules was used operationally by Australia, the UK and the United States. After the initial invasion, C-130 operators as part of the Multinational force in Iraq used their C-130s to support their forces in Iraq.\n\nSince 2004, the Pakistan Air Force has employed C-130s in the War in North-West Pakistan. Some variants had forward looking infrared (FLIR Systems Star Safire III EO/IR) sensor balls, to enable close tracking of Islamist militants.[http://tribune.com.pk/story/291762/paf-conducted-5500-bombing-runs-in-fata-since-2008/ PAF conducted 5,500 bombing runs in Fata since 2008], The Express Tribune, 14 November 2011\n\nCivilian\n\nThe U.S. Forest Service developed the Modular Airborne FireFighting System for the C-130 in the 1970s, which allows regular aircraft to be temporarily converted to an airtanker for fighting wildfires.[http://www.fs.fed.us/fire/aviation/fixed_wing/maffs/index.html \"Modular Airborne FireFighting Systems.\"]  U.S. Forest Service, 16 March 2010. Retrieved 2 October 2010. In the late 1980s, 22 retired USAF C-130As were removed from storage at Davis-Monthan Air Force Base and transferred to the U.S. Forest Service, which then  transferred them to six private companies to be converted into air tankers. After one of these aircraft crashed due to wing separation in flight as a result of fatigue stress cracking, the entire fleet of C-130A air tankers was permanently grounded in 2004. C-130s were used to spread chemical dispersants onto the Deepwater Horizon oil spill in the Gulf Coast in 2010.\n\nA recent development of a C-130–based airtanker is the Retardant Aerial Delivery System developed by Coulson Aviation USA. The system consists of a C-130H/Q retrofitted with an in-floor discharge system, combined with a removable 3,500- or 4,000-gallon water tank. The combined system is FAA certified.\n\nVariants\n\nSignificant military variants of the C-130 include:\n;C-130A/B/E/F/G/H/K/T\nTactical airlifter basic models\n;C-130A-II Dreamboat\nEarly version Electronic Intelligence/Signals Intelligence (ELINT/SIGINT) aircraft\n;C-130J Super Hercules\nTactical airlifter, with new engines, avionics, and updated systems\n;C-130K\nDesignation for RAF Hercules C1/W2/C3 aircraft (C-130Js in RAF service are the Hercules C.4 and Hercules C.5)\n;AC-130A/E/H/J/U/W\nGunship variants\n;C-130D/D-6\nSki-equipped version for snow and ice operations United States Air Force / Air National Guard\n;CC-130E/H/J Hercules\nDesignation for Canadian Armed Forces / Royal Canadian Air Force Hercules aircraft. U.S. Air Force used the CC-130J designation to differentiate the standard C-130J variant from the \"stretched\" C-130J (company designation C-130J-30).\n;C-130M: Designation used by the Brazilian Air Force for locally modified / up-graded C-130H aircraft\n;DC-130A/E/H\nUSAF and USN Drone control\n;EC-130\nEC-130E/J Commando Solo – USAF / Air National Guard psychological operations version\nEC-130E Airborne Battlefield Command and Control Center (ABCCC) – USAF procedural air-to-ground attack control, also provided NRT threat updates\nEC-130E Rivet Rider – Airborne psychological warfare aircraft\nEC-130H Compass Call – Electronic warfare and electronic attack.King, Capt. Vince, Jr. [https://web.archive.org/web/20120309175317/http://www.af.mil/news/story.asp?storyID=123030212 \"Compass Call continues to 'Jam' enemy.\"] Air Force Link, United States Air Force, 1 November 2006.\nEC-130V – Airborne early warning and control (AEW&C) variant used by USCG for counter-narcotics missions[https://fas.org/man/dod-101/sys/ac/ec-130v.htm \"Lockheed EC-130V Hercules.\"] Military Analysis Network, Federation of American Scientists, 10 February 1998. Retrieved 2 October 2010.\n;GC-130\nPermanently grounded instructional airframes\n;HC-130\nHC-130B/E/H – Early model combat search and rescue\nHC-130P/N Combat King – USAF aerial refueling tanker and combat search and rescue\nHC-130J Combat King II – Next generation combat search and rescue tanker\nHC-130H/J – USCG long-range surveillance and search and rescue\n;JC-130\nTemporary conversion for flight test operations; Also used to recover film from American spy satellites.\n;KC-130F/R/T/J\nUnited States Marine Corps aerial refueling tanker and tactical airlifter\n;LC-130F/H/R\nUSAF / Air National Guard – Ski-equipped version for Arctic and Antarctic support operations; LC-130F previously operated by USN\n;MC-130\nMC-130E/H Combat Talon I/II – Special operations infiltration/extraction variant\nMC-130W Combat Spear/Dragon Spear – Special operations tanker/gunshipHousman, Damian. [https://web.archive.org/web/20121020033903/http://www.af.mil/news/story.asp?id\n123022607 \"Highly modified C-130 ready for war on terrorism.\"] Air Force Link, United States Air Force, 29 June 2006.\nMC-130P Combat Shadow – Special operations tanker\nMC-130J Commando II (formerly Combat Shadow II) – Special operations tanker Air Force Special Operations Command[http://www.afsoc.af.mil/news/story.asp?id=123294130 MC-130 J name change promotes modern missions, preserves heritage] . Afsoc.af.mil. Retrieved on 2013-08-16.\nYMC-130H – Modified aircraft under Operation Credible Sport for second Iran hostage crisis rescue attempt\n;NC-130\nPermanent conversion for flight test operations\n;PC-130/C-130-MP\nMaritime patrol\n;RC-130A/S\nSurveillance aircraft for reconnaissance\n;SC-130J Sea Herc\nProposed maritime patrol version of the C-130J, designed for coastal surveillance and anti-submarine warfare.\n\n;TC-130\nAircrew training\n;VC-130H\nVIP transport\n;WC-130A/B/E/H/J\nWeather reconnaissance (\"Hurricane Hunter\") version for USAF / Air Force Reserve Command's 53d Weather Reconnaissance Squadron in support of the National Weather Service's National Hurricane Center\n\nOperators\n\nFormer operators\n* \n* \n\nAccidents\n\nThe C-130 Hercules has had a low accident rate in general. The Royal Air Force recorded an accident rate of about one aircraft loss per 250,000 flying hours over the last 40 years, placing it behind Vickers VC10s and Lockheed TriStars with no flying losses.[http://www.dasa.mod.uk/natstats/accidents/accdam/acctab2.html \"Aircraft Air Accidents and Damage Rates.\"] Defence Analytical Services Agency. Retrieved: 2 October 2010.  USAF C-130A/B/E-models had an overall attrition rate of 5% as of 1989 as compared to 1–2% for commercial airliners in the U.S., according to the NTSB, 10% for B-52 bombers, and 20% for fighters (F-4, F-111), trainers (T-37, T-38), and helicopters (H-3).Diehl 2002, p. 45.\n\nA total of 70 aircraft were lost by the U.S. Air Force and the U.S. Marine Corps during combat operations in the Vietnam War in Southeast Asia. By the nature of the Hercules' worldwide service, the pattern of losses provides an interesting barometer of the global hot spots over the past 50 years.[http://aviation-safety.net/database/type/type.php?type\n335-C \"Lockheed C-130 Hercules.\"] Aviation Safety Network, Flight Safety Foundation, 13 November 2004. Retrieved 2 October 2010.\n\nAircraft on display\n\nArgentina\n\n* C-130B FAA TC-60. ex USAF 61-0964 received on February 1992 now at Museo Nacional de Aeronáutica since September 2011.[http://arqueologiaaeronautica.blogspot.com.ar/2012/10/hercules-c-130-b-tc-60-moron.html LOCKHEED C-130B Hercules – Mat. TC-60 – Morón]\n\nAustralia\n\n* C-130A RAAF A97-214 used by 36 Squadron from early 1959, withdrawn from use late 1978; now at RAAF Museum, RAAF Base Williams, Point Cook.\n* C-130E RAAF A97-160 used by 37 Squadron from August 1966, withdrawn from use November 2000; to RAAF Museum, 14 November 2000, cocooned as of September 2005.Olausson 2010, p. 62.\n\nCanada\n\n* CC-130E RCAF 10313 (later 130313) is on display at the National Air Force Museum of Canada, CFB Trenton\n* CC-130E RCAF 130328 is on display at the Greenwood Aviation Museum, CFB Greenwood\n\nColombia\n\n* C-130B FAC 1010 (serial number 3521) moved on 14 January 2016 to the Colombian Aerospace Museum in Tocancipá, Cundinamarca, for static display.\n* C-130B FAC1011 (serial number 3585, ex 59-1535) preserved at the Colombian Air and Space Museum within CATAM AFB, Bogotá.\n\nIndonesia\n\n* C-130B Indonesian Air Force A-1301 preserved at Sulaeman Airstrip, Bandung. Also occasionally used for Paskhas Training.The airplane is relocated to Air Force Museum in Yogyakarta in 2017.https://tni-au.mil.id/berita/fuselage-c-130-hercules-1301-dalam-perjalanan-ke-muspusdirla\n\nNorway\n\n* C-130H Royal Norwegian Air Force 953 was retired 10 June 2007 and moved to the Air Force museum at Oslo Gardermoen in May 2008.Olausson 2010, p. 73.\n\nSaudi Arabia\n\n* C-130H RSAF 460 was operated by 4 Squadron Royal Saudi Air Force, December 1974 until January 1987. It was damaged in a fire at Jeddah in December 1989. Restored for ground training by August 1993. At Royal Saudi Air Force Museum, November 2002, restored for ground display by using a tail from another C-130H.Olausson 2010, p. 85.\n\nUnited Kingdom\n\n* Hercules C3 XV202 served with the Royal Air Force from 1967 to 2011, is on display at the Royal Air Force Museum Cosford.[http://www.rafmuseum.org.uk/cosford/news/article.cfm?headline=Hercules%20makes%20final%20flight%20into%20Cosfordm \"Hercules makes final flight into Cosford.\"] Royal Air Force Museum. Retrieved: 22 September 2011.\n\nUnited States\n\n* C-130A, AF Ser. No. 55-0037 used by the 773 TCS, 483 TCW, 315 AD, 374 TCW, 815 TAS, 35 TAS, 109 TAS, belly-landed at Duluth, Minnesota, April 1973, repaired; 167 TAS, 180 TAS, to Chanute Technical Training Center as GC-130A, May 1984; now displayed at Octave Chanute Aerospace Museum, Rantoul Aviation Complex (former Chanute AFB, Rantoul, Illinois as of November 1995.Olausson 2010, p. 7.\n* C-130A, AF Ser. No. 56-0518 used by the 314 TCW, 315 AD, 41 ATS, 328 TAS; to Republic of Vietnam Air Force 435 Transport Squadron, November 1972; holds the C-130 record for taking off with the most personnel on board, during evacuation of SVN, 29 April 1975, with 452. Returned to USAF, 185 TAS, 105 TAS; Flown to Little Rock AFB on June 28, 1989.  It was converted to a static display at the LRAFB Visitor Center, Arkansas by Sept. 1989. http://onlyinark.com/culture/last-herk-vietnam/\n* C-130A, AF Ser. No. 57-0453 was operated from 1958 to 1991, last duty with 155th TAS, 164th TAG, Tennessee Air National Guard, Memphis International Airport/ANGB, Tennessee, 1976–1991, named \"Nite Train to Memphis\"; to AMARC in December 1991, then sent to Texas for modification into replica of C-130A-II Dreamboat aircraft, AF Ser. No. 56-0528, shot down by Soviet fighters in Soviet airspace near Yerevan, Armenia on 2 September 1958, while on ELINT mission with loss of all crew, displayed in National Vigilance Park, National Security Agency grounds, Fort George Meade, Maryland.Olausson 2010, p. 14.\n* C-130B, AF Ser. No. 59-0528 was operated by 145th Airlift Wing, North Carolina Air National Guard; placed on static display at Charlotte Air National Guard Base, North Carolina in 2010.\n* C-130D, AF Ser. No. 57-0490 used by the 61st TCS, 17th TCS, 139th TAS with skis, July 1975 – April 1983; to MASDC, 1984–1985, GC-130D ground trainer, Chanute AFB, Illinois, 1986–1990; When Chanute AFB closed in September 1993, it moved to the Octave Chanute Aerospace Museum (former Chanute AFB, Rantoul, Illinois. In July 1994, it moved to the Empire State Air Museum, Schenectady County Airport, New York, until placed on the gate at Stratton Air National Guard Base in October 1994.Olausson 2010, p. 16.\n* NC-130B, AF Ser. No. 57-0526 was the second B model manufactured, initially delivered as JC-130B; assigned to 6515th Organizational Maintenance Squadron for flight testing at Edwards AFB, California on 29 November 1960; turned over to 6593rd Test Squadron's Operating Location No. 1 at Edwards AFB and spent next seven years supporting Corona Program; \"J\" status and prefix removed from aircraft on October 1967; transferred to 6593rd Test Squadron at Hickam AFB, Hawaii and modified for mid-air retrieval of satellites; acquired by 6514th Test Squadron at Hill AFB, Utah in Jan. 1987 and used as electronic testbed and cargo transport; aircraft retired January 1994 with 11,000+ flight hours and moved to Hill Aerospace Museum at Hill AFB by January 1994.Olausson 2010, p. 19.\n* C-130E, AF Ser. No. 62-1787, on display at the National Museum of the United States Air Force, Wright-Patterson AFB, Ohio, was flown to the museum on 18 August 2011. One of the greatest feats of heroism during the Vietnam War involved the C-130E, call sign \"Spare 617\". The C-130E attempted to airdrop ammunition to surrounded South Vietnamese forces at An Loc, Vietnam. Approaching the drop zone, Spare 617 received heavy enemy ground fire that damaged two engines, ruptured a bleed air duct in the cargo compartment, and set the ammunition on fire. Flight engineer TSgt Sanders was killed, and navigator 1st Lt Lenz and co-pilot 1st Lt Hering were both wounded. Despite receiving severe burns from hot air escaping from the damaged air bleed duct, loadmaster TSgt Shaub extinguished a fire in the cargo compartment, and successfully jettisoned the cargo pallets, which exploded in mid-air. Despite losing a third engine on final approach, pilot Capt Caldwell landed Spare 617 safely. For their actions, Caldwell and Shaub received the Air Force Cross, the U.S. Air Force's second highest award for valor. TSgt Shaub also received the William H. Pitsenbarger Award for Heroism from the Air Force Sergeants Association.[http://www.nationalmuseum.af.mil/factsheets/factsheet.asp?id=18724 \"Factsheet: Lockheed C-130E Hercules.\"]  National Museum of the United States Air Force, 29 February 2011.\n* KC-130F, USN/USMC BuNo 149798 used in tests in October–November 1963 by the U.S. Navy for unarrested landings and unassisted take-offs from the carrier USS Forrestal (CV-59), it remains the record holder for largest aircraft to operate from a carrier flight deck, and carried the name \"Look Ma, No Hook\" during the tests. Retired to the National Museum of Naval Aviation, NAS Pensacola, Florida in May 2003.Olausson 2010, p. 30.\n* C-130G, USN/USMC BuNo 151891; modified to EC-130G, 1966, then testbed for EC-130Q TACAMO in 1981. To TC-130G in May 1990 and assigned as the U.S. Navy's Blue Angels USMC support aircraft, serving as \"Fat Albert Airlines\" from 1991 to 2002. Retired to the National Museum of Naval Aviation at NAS Pensacola, Florida in November 2002.Olausson 2010, p. 43.\n* C-130E, AF Ser. No. 64-0525 was on display at the 82nd Airborne Division War Memorial Museum at Fort Bragg, North Carolina. The aircraft was the last assigned to the 43rd AW at Pope AFB, North Carolina prior to retirement from the USAF.Olausson 2010, p. 52.\n* C-130E, AF Ser. No. 69-6579 operated by the 61st TAS, 314th TAW, 50th AS, 61st AS; at Dyess AFB as maintenance trainer as GC-130E, March 1998; to Dyess AFB Linear Air Park, January 2004.Olausson 2010, p. 74.\n* MC-130E Combat Talon I, AF Ser. No. 64-0567, unofficially known as \"Wild Thing\". It transported captured Panamanian dictator Manuel Noriega in 1989 during Operation Just Cause, and participated in Operation Eagle Claw, the unsuccessful attempt to rescue U.S. hostages from Iran in 1980. Wild Thing was also the first fixed-wing aircraft to employ night-vision goggles. On display at Hurlburt Field, in Florida.[http://www.codeonemagazine.com/news_item.html?item_id=320 \"Combat Talon Dedicated.\"] Code One Magazine, 6 May 2011.\n* C-130E, AF Ser. No. 69-6580 operated by the 61st TAS, 314th TAW, 317th TAW, 314th TAW, 317th TAW, 40th AS, 41st AS, 43rd AW, retired after center wing cracks were detected in April 2002; to the Air Mobility Command Museum, Dover AFB, Delaware on 2 February 2004.\n* C-130E, AF Ser. No. 70-1269 used by the 43rd AW and is on display at the Pope Air Park, Pope AFB, North Carolina as 2006.Olausson 2010, p. 78.\n* C-130H, AF Ser. No. 74-1686 used by the 463rd TAW; one of three C-130H airframes modified to YMC-130H for aborted rescue attempt of Iranian hostages, Operation Credible Sport, with rocket packages blistered onto fuselage in 1980, but these were removed after mission was canceled. Subsequent duty with the 4950th Test Wing, then donated to the Museum of Aviation at Robins AFB, Georgia, in March 1988.Olausson 2010, p. 91.\n\nSpecifications (C-130H)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lockheed C-130 Hercules" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7697" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Lockheed C-130 Hercules is a four-engine turboprop military transport aircraft designed and built originally by Lockheed (now Lockheed Martin). Capable of using unprepared runways for takeoffs and landings, the C-130 was originally designed as a troop, medevac, and cargo transport aircraft. The versatile airframe has found uses in a variety of other roles, including as a gunship (AC-130), for airborne assault, search and rescue, scientific research support, weather reconnaissance, aerial refueling, maritime patrol, and aerial firefighting. It is now the main tactical airlifter for many military forces worldwide. Over forty variants and versions of the Hercules, including a civilian one marketed as the Lockheed L-100, operate in more than 60 nations.\n\nThe C-130 entered service with the U.S. in the 1950s, followed by Australia and others. During its years of service, the Hercules family has participated in numerous military, civilian and humanitarian aid operations. In 2007, the C-130 became the fifth aircraft—after the English Electric Canberra, B-52 Stratofortress, Tupolev Tu-95, and KC-135 Stratotanker—to mark 50 years of continuous service with its original primary customer, in this case, the United States Air Force. The C-130 Hercules is the longest continuously produced military aircraft at over 60 years, with the updated Lockheed Martin C-130J Super Hercules currently being produced.\n\nDesign and development\n\nBackground and requirements\n\nThe Korean War showed that World War II-era piston-engine transports—Fairchild C-119 Flying Boxcars, Douglas C-47 Skytrains and Curtiss C-46 Commandos—were inadequate for modern warfare. Thus, on 2 February 1951, the United States Air Force issued a General Operating Requirement (GOR) for a new transport to Boeing, Douglas, Fairchild, Lockheed, Martin, Chase Aircraft, North American, Northrop, and Airlifts Inc. The new transport would have a capacity of 92 passengers, 72 combat troops or 64 paratroopers in a cargo compartment that was approximately 41 ft long, 9 ft high, and 10 ft wide. Unlike transports derived from passenger airliners, it was to be designed from the ground-up as a combat transport with loading from a hinged loading ramp at the rear of the fuselage.\n\nA key feature was the introduction of the Allison T56 turboprop powerplant, first developed specifically for the C-130. At the time, the turboprop was a new application of gas turbines, which offered greater range at propeller-driven speeds compared to pure turbojets, which were faster but consumed more fuel. They also produced much more power for their weight than piston engines.\n\nDesign phase\n\nThe Hercules resembled a larger four-engine brother to the C-123 Provider with a similar wing and cargo ramp layout that evolved from the Chase XCG-20 Avitruc, which in turn, was first designed and flown as a cargo glider in 1947.[http://www.globalsecurity.org/military/systems/aircraft/cg-20.htm \"Chase XCG-20 Avitruc.\"] globalsecurity.org. Retrieved: 2 October 2010. The Boeing C-97 Stratofreighter also had a rear ramp, which made it possible to drive vehicles onto the plane (also possible with forward ramp on a C-124). The ramp on the Hercules was also used to airdrop cargo, which included low-altitude extraction for Sheridan tanks and even dropping large improvised \"daisy cutter\" bombs.\n\nThe new Lockheed cargo plane design possessed a range of 1100 nmi, takeoff capability from short and unprepared strips, and the ability to fly with one engine shut down. Fairchild, North American, Martin, and Northrop declined to participate. The remaining five companies tendered a total of ten designs: Lockheed two, Boeing one, Chase three, Douglas three, and Airlifts Inc. one. The contest was a close affair between the lighter of the two Lockheed (preliminary project designation L-206) proposals and a four-turboprop Douglas design.\n\nThe Lockheed design team was led by Willis Hawkins, starting with a 130-page proposal for the Lockheed L-206.Rhodes, Jeff. \"Willis Hawkins and the Genesis of the Hercules.\" Code One Magazine, Volume 19, Issue 3, 2004. Hall Hibbard, Lockheed vice president and chief engineer, saw the proposal and directed it to Kelly Johnson, who did not care for the low-speed, unarmed aircraft, and remarked, \"If you sign that letter, you will destroy the Lockheed Company.\" Both Hibbard and Johnson signed the proposal and the company won the contract for the now-designated Model 82 on 2 July 1951.Boyne, Walter J. Beyond the Horizons: The Lockheed Story. New York: St. Martin's Press, 1998. .\n\nThe first flight of the YC-130 prototype was made on 23 August 1954 from the Lockheed plant in Burbank, California. The aircraft, serial number 53-3397, was the second prototype, but the first of the two to fly. The YC-130 was piloted by Stanley Beltz and Roy Wimmer on its 61-minute flight to Edwards Air Force Base; Jack Real and Dick Stanton served as flight engineers. Kelly Johnson flew chase in a Lockheed P2V Neptune.Dabney, Joseph E. A. \"Mating of the Jeep, the Truck, and the Airplane.\" lockheedmartin.com, 2004. Excerpted from HERK: Hero of the Skies in Lockheed Martin Service News, Lockheed Martin Air Mobility Support  Volume 29, Issue 2, p. 3.\n\nAfter the two prototypes were completed, production began in Marietta, Georgia, where over 2,300 C-130s have been built through 2009.Olausson 2009, p. 129.\n\nThe initial production model, the C-130A, was powered by Allison T56-A-9 turboprops with three-blade propellers and originally equipped with the blunt nose of the prototypes. Deliveries began in December 1956, continuing until the introduction of the C-130B model in 1959. Some A-models were equipped with skis and re-designated C-130D.  As the C-130A became operational with Tactical Air Command (TAC), the C-130's lack of range became apparent and additional fuel capacity was added in the form of external pylon-mounted tanks at the end of the wings.\n\nImproved versions\n\nThe C-130B model was developed to complement the A-models that had previously been delivered, and incorporated new features, particularly increased fuel capacity in the form of auxiliary tanks built into the center wing section and an AC electrical system. Four-bladed Hamilton Standard propellers replaced the Aeroproducts three-blade propellers that distinguished the earlier A-models.  The C-130B had ailerons with boost increased from 2050 psi to 3000 psi, as well as uprated engines and four-blade propellers that were standard until the J-model's introduction.\n\nAn electronic reconnaissance variant of the C-130B was designated C-130B-II. A total of 13 aircraft were converted. The C-130B-II was distinguished by its false external wing fuel tanks, which were disguised signals intelligence (SIGINT) receiver antennas. These pods were slightly larger than the standard wing tanks found on other C-130Bs. Most aircraft featured a swept blade antenna on the upper fuselage, as well as extra wire antennas between the vertical fin and upper fuselage not found on other C-130s. Radio call numbers on the tail of these aircraft were regularly changed so as to confuse observers and disguise their true mission.\n\nThe extended-range C-130E model entered service in 1962 after it was developed as an interim long-range transport for the Military Air Transport Service. Essentially a B-model, the new designation was the result of the installation of 1,360 US gal (5,150 L) Sargent Fletcher external fuel tanks under each wing's midsection and more powerful Allison T56-A-7A turboprops. The hydraulic boost pressure to the ailerons was reduced back to 2050 psi as a consequence of the external tanks' weight in the middle of the wingspan. The E model also featured structural improvements, avionics upgrades and a higher gross weight. Australia took delivery of 12 C130E Hercules during 1966–67 to supplement the 12 C-130A models already in service with the RAAF. Sweden and Spain fly the TP-84T version of the C-130E fitted for aerial refueling capability.\n\nThe KC-130 tankers, originally C-130F procured for the US Marine Corps (USMC) in 1958 (under the designation GV-1) are equipped with a removable 3,600 US gal (13,626 L) stainless steel fuel tank carried inside the cargo compartment. The two wing-mounted hose and drogue aerial refueling pods each transfer up to 300 US gal per minute (19 L per second) to two aircraft simultaneously, allowing for rapid cycle times of multiple-receiver aircraft formations, (a typical tanker formation of four aircraft in less than 30 minutes). The US Navy's C-130G has increased structural strength allowing higher gross weight operation.\n\nFurther developments\n\nThe C-130H model has updated Allison T56-A-15 turboprops, a redesigned outer wing, updated avionics and other minor improvements. Later H models had a new, fatigue-life-improved, center wing that was retrofitted to many earlier H-models. For structural reasons, some models are required to land with certain amounts of fuel when carrying heavy cargo, reducing usable range.Cassidy, J. \"[http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ADA391744 C-130 Transportability of Army Vehicles]\" p. 3. Defense Technical Information Center, 2001 The H model remains in widespread use with the United States Air Force (USAF) and many foreign air forces. Initial deliveries began in 1964 (to the RNZAF), remaining in production until 1996. An improved C-130H was introduced in 1974, with Australia purchasing 12 of type in 1978 to replace the original 12 C-130A models, which had first entered RAAF Service in 1958.  The U.S. Coast Guard employs the HC-130H for long-range search and rescue, drug interdiction, illegal migrant patrols, homeland security, and logistics.\n\nC-130H models produced from 1992 to 1996 were designated as C-130H3 by the USAF. The \"3\" denoting the third variation in design for the H series. Improvements included ring laser gyros for the INUs, GPS receivers, a partial glass cockpit (ADI and HSI instruments), a more capable APN-241 color radar, night vision device compatible instrument lighting, and an integrated radar and missile warning system. The electrical system upgrade included Generator Control Units (GCU) and Bus Switching units (BSU) to provide stable power to the more sensitive upgraded components.\n\nThe equivalent model for export to the UK is the C-130K, known by the Royal Air Force (RAF) as the Hercules C.1. The C-130H-30 (Hercules C.3 in RAF service) is a stretched version of the original Hercules, achieved by inserting a 100 in (2.54 m) plug aft of the cockpit and an 80 in (2.03 m) plug at the rear of the fuselage. A single C-130K was purchased by the Met Office for use by its Meteorological Research Flight, where it was classified as the Hercules W.2. This aircraft was heavily modified (with its most prominent feature being the long red and white striped atmospheric probe on the nose and the move of the weather radar into a pod above the forward fuselage). This aircraft, named Snoopy, was withdrawn in 2001 and was then modified by Marshall of Cambridge Aerospace as flight-testbed for the A400M turbine engine, the TP400. The C-130K is used by the RAF Falcons for parachute drops. Three C-130K (Hercules C Mk.1P) were upgraded and sold to the Austrian Air Force in 2002.[http://www.doppeladler.com/oebh/luftfahrzeuge/c130.htm \"C-130K in the Austrian Air Force.\"] doppeladler.com. Retrieved: 2 October 2010.\n\nEnhanced models\n\nThe MC-130E Combat Talon was developed for the USAF during the Vietnam War to support special operations missions in Southeast Asia, and led to both the MC-130H Combat Talon II as well as a family of other special missions aircraft. 37 of the earliest models currently operating with the Air Force Special Operations Command (AFSOC) are scheduled to be replaced by new-production MC-130J versions. The EC-130 Commando Solo is another special missions variant within AFSOC, albeit operated solely by an AFSOC-gained wing in the Pennsylvania Air National Guard, and is a psychological operations/information operations (PSYOP/IO) platform equipped as an aerial radio station and television stations able to transmit messaging over commercial frequencies. Other versions of the EC-130, most notably the EC-130H Compass Call, are also special variants, but are assigned to the Air Combat Command (ACC). The AC-130 gunship was first developed during the Vietnam War to provide close air support and other ground-attack duties.\n\nThe HC-130 is a family of long-range search and rescue variants used by the USAF and the U.S. Coast Guard. Equipped for deep deployment of Pararescuemen (PJs), survival equipment, and (in the case of USAF versions) aerial refueling of combat rescue helicopters, HC-130s are usually the on-scene command aircraft for combat SAR missions (USAF only) and non-combat SAR (USAF and USCG). Early USAF versions were also equipped with the Fulton surface-to-air recovery system, designed to pull a person off the ground using a wire strung from a helium balloon. The John Wayne movie The Green Berets features its use. The Fulton system was later removed when aerial refueling of helicopters proved safer and more versatile. The movie The Perfect Storm depicts a real life SAR mission involving aerial refueling of a New York Air National Guard HH-60G by a New York Air National Guard HC-130P.\n\nThe C-130R and C-130T are U.S. Navy and USMC models, both equipped with underwing external fuel tanks. The USN C-130T is similar, but has additional avionics improvements. In both models, aircraft are equipped with Allison T56-A-16 engines. The USMC versions are designated KC-130R or KC-130T when equipped with underwing refueling pods and pylons and are fully night vision system compatible.\n\nThe RC-130 is a reconnaissance version. A single example is used by the Islamic Republic of Iran Air Force, the aircraft having originally been sold to the former Imperial Iranian Air Force.\n\nThe Lockheed L-100 (L-382) is a civilian variant, equivalent to a C-130E model without military equipment. The L-100 also has two stretched versions.\n\nNext generation\n\nIn the 1970s, Lockheed proposed a C-130 variant with turbofan engines rather than turboprops, but the U.S. Air Force preferred the takeoff performance of the existing aircraft. In the 1980s, the C-130 was intended to be replaced by the Advanced Medium STOL Transport project. The project was canceled and the C-130 has remained in production.\n\nBuilding on lessons learned, Lockheed Martin modified a commercial variant of the C-130 into a High Technology Test Bed (HTTB). This test aircraft set numerous short takeoff and landing performance records and significantly expanded the database for future derivatives of the C-130.[http://www.nasa.gov/centers/langley/news/factsheets/C130.html NASA and Lockheed Martin Partners In C-130 Technology] Retrieved 21 May 2013.  Modifications made to the HTTB included extended chord ailerons, a long chord rudder, fast-acting double-slotted trailing edge flaps, a high-camber wing leading edge extension, a larger dorsal fin and dorsal fins, the addition of three spoiler panels to each wing upper surface, a long-stroke main and nose landing gear system, and changes to the flight controls and a change from direct mechanical linkages assisted by hydraulic boost, to fully powered controls, in which the mechanical linkages from the flight station controls operated only the hydraulic control valves of the appropriate boost unit.[http://www.lockheedmartin.com/content/dam/lockheed/data/aero/documents/global-sustainment/product-support/Service-News/V12N3.pdf The High Technology Test Bed] Lockheed Service News Vol. 12 No. 3, September 1985. Retrieved 21 May 2013. The HTTB first flew on 19 June 1984, with civil registration of N130X. After demonstrating many new technologies, some of which were applied to the C-130J, the HTTB was lost in a fatal accident on 3 February 1993, at Dobbins Air Reserve Base, in Marietta, Georgia.  The crash was attributed to disengagement of the rudder fly-by-wire flight control system, resulting in a total loss of rudder control capability while conducting ground minimum control speed tests (Vmcg). The disengagement was a result of the inadequate design of the rudder's integrated actuator package by its manufacturer; the operator's insufficient system safety review failed to consider the consequences of the inadequate design to all operating regimes. A factor which contributed to the accident was the flight crew's lack of engineering flight test training.[http://aviation-safety.net/database/record.php?id=19930203-1 ASN Aircraft Accident] Retrieved 21 May 2013.\n\nIn the 1990s, the improved C-130J Super Hercules was developed by Lockheed (later Lockheed Martin). This model is the newest version and the only model in production. Externally similar to the classic Hercules in general appearance, the J model has new turboprop engines, six-bladed propellers, digital avionics, and other new systems.\n\nUpgrades and changes\n\nIn 2000, Boeing was awarded a  contract to develop an Avionics Modernization Program kit for the C-130. The program was beset with delays and cost overruns until project restructuring in 2007.Trimble, Stephen. [http://www.flightglobal.com/articles/2010/06/24/343673/boeing-outlines-c-130h-and-kc-10-cockpit-upgrades.html \"Boeing outlines C-130H and KC-10 cockpit upgrades.\"] Flightglobal. Retrieved: 2 October 2010. On 2 September 2009, Bloomberg news reported that the planned Avionics Modernization Program (AMP) upgrade to the older C-130s would be dropped to provide more funds for the F-35, CV-22 and airborne tanker replacement programs.Capaccio, Tony. [https://www.bloomberg.com/apps/news?pid\n20601109&sidaEiJr36oaC7w \"Air Force Would Cancel Boeing C-130 Upgrade, 15 Other Programs.\"] Bloomberg, 2 September 2009. Retrieved 2 October 2010. However, in June 2010, Department of Defense approved funding for the initial production of the AMP upgrade kits.Wall, Robert. [http://www.aviationweek.com/aw/generic/story.jsp?id\nnews/asd/2010/06/25/01.xml&headlinePentagon%20Approves%20C-130%20AMP%20Production&channel\ndefense \"Pentagon Approves C-130 AMP Production.\"] Aviation Week, 25 June 2010.[http://boeing.mediaroom.com/index.php?s43&item\n1275 \"Boeing C-130 Avionics Modernization Program to Enter Production.\"] Boeing, 24 June 2010. Under the terms of this agreement, the USAF has cleared Boeing to begin low-rate initial production (LRIP) for the C-130 AMP. A total of 198 aircraft are expected to feature the AMP upgrade. The current cost per aircraft is  although Boeing expects that this price will drop to US$7 million for the 69th aircraft.\n\nIn the 2000s, Lockheed Martin and the U.S. Air Force began outfitting and retrofitting C-130s with the eight-blade UTC Aerospace Systems NP2000 propellers.\n\nAn engine enhancement program saving fuel and providing lower temperatures in the T56 engine has been approved, and the US Air Force expects to save $2 billion and extend the fleet life.\"[http://www.aero-news.net/subscribe.cfm?domain.textpost&id\n95b16316-e19c-47eb-8ba7-0048908e816f NOAA 'Hurricane Hunters' First To Get T56 Series 3.5 Engine Enhancement]\" Aero News, November 14, 2013. Accessed: December 1, 2013.\n\nReplacement\n\nIn October 2010, the Air Force released a capabilities request for information (CRFI) for the development of a new airlifter to replace the C-130. The new aircraft is to carry a 190 percent greater payload and assume the mission of mounted vertical maneuver (MVM). The greater payload and mission would enable it to carry medium-weight armored vehicles and drop them off at locations without long runways.  Various options are being considered, including new or upgraded fixed-wing designs, rotorcraft, tiltrotors, or even an airship. Development could start in 2014, and become operational by 2024. The C-130 fleet of around 450 planes would be replaced by only 250 aircraft.[http://www.flightglobal.com/blogs/the-dewline/2010/10/usaf-asks-industry-to-answer-c/ USAF asks industry to answer C-130 replacement questions] - Flightglobal.com, 22 October 2010 The Air Force had attempted to replace the C-130 in the 1970s through the Advanced Medium STOL Transport project, which resulted in the C-17 Globemaster III that instead replaced the C-141 Starlifter.[http://www.flightglobal.com/blogs/the-dewline/2011/09/images-lockheeds-stealth-c-130/ Lockheed's stealth C-130 successor revealed] - Flightglobal.com, 13 September 2011 The Air Force Research Laboratory funded Lockheed and Boeing demonstrators for the Speed Agile concept, which had the goal of making a STOL aircraft that can take off and land at speeds as low as 70 kn on airfields less than 2,000 ft (610 m) long and cruise at Mach 0.8-plus. Boeing's design used upper-surface blowing from embedded engines on the inboard wing and blown flaps for circulation control on the outboard wing. Lockheed's design also used blown flaps outboard, but inboard used patented reversing ejector nozzles. Boeing's design completed over 2,000 hours of windtunnel tests in late 2009.  It was a 5 percent-scale model of a narrowbody design with a  payload. When the AFRL increased the payload requirement to , they tested a 5% scale model of a widebody design with a  take-off gross weight and an \"A400M-size\" 158 in wide cargo box. It would be powered by four IAE V2533 turbofans.[http://www.aviationweek.com/Blogs.aspx?plckBlogId\nblog:27ec4a53-dcc8-42d0-bd3a-01329aef79a7&plckPostIdBlog:27ec4a53-dcc8-42d0-bd3a-01329aef79a7Post:4ed2785f-832c-4f7f-8a7b-1d820cb2b07a Fast STOL - Lockheed's Speed Agile]  - Aviationweek.com, 15 October 2010 In August 2011, the AFRL released pictures of the Lockheed Speed Agile concept demonstrator. A 23% scale model went through wind tunnel tests to demonstrate its hybrid powered lift, which combines a low drag airframe with simple mechanical assembly to reduce weight and better aerodynamics. The model had four engines, including two Williams FJ44 turbofans.[http://defensetech.org/2011/09/15/lockheeds-new-stol-airlifter-design/ Lockheed's New STOL Airlifter Design] - Defensetech.org, 15 September 2011 On 26 March 2013, Boeing was granted a patent for its swept-wing powered lift aircraft.[http://www.flightglobal.com/blogs/the-dewline/2013/04/boeing-awarded-patent-speed-ag/ Boeing awarded patent for Speed Agile stealth transport concept] - Flightglobal.com, 2 April 2013\n\nAs of January 2014, Air Mobility Command, Air Force Materiel Command and the Air Force Research Lab are in the early stages of defining requirements for the C-X next generation airlifter program to replace both the C-130 and C-17. An aircraft would be produced from the early 2030s to the 2040s. If requirements are decided for operating in contested airspace, Air Force procurement of C-130s would end by the end of the decade to not have them serviceable by the 2030s and operated when they cannot perform in that environment. Development of the airlifter depends heavily on the Army's \"tactical and operational maneuver\" plans. Two different cargo planes could still be created to separately perform tactical and strategic missions, but which course to pursue is to be decided before C-17s need to be retired.[http://www.airforcemag.com/DRArchive/Pages/2014/January%202014/January%2002%202014/Requirements-Mulled-for-Next-Generation-Airlifter.aspx Requirements Mulled for Next-Generation Airlifter] - Airforcemag.com, 2 January 2014\n\nOperational history\n\nMilitary\n\nThe first batch of C-130A production aircraft were delivered beginning in 1956 to the 463d Troop Carrier Wing at Ardmore AFB, Oklahoma and the 314th Troop Carrier Wing at Sewart AFB, Tennessee. Six additional squadrons were assigned to the 322d Air Division in Europe and the 315th Air Division in the Far East. Additional aircraft were modified for electronics intelligence work and assigned to Rhein-Main Air Base, Germany while modified RC-130As were assigned to the Military Air Transport Service (MATS) photo-mapping division.\n\nIn 1958, a U.S. reconnaissance C-130A-II of the 7406th Support Squadron was shot down over Armenia by four Soviet MiG-17s along the Turkish-Armenian border during a routine mission.\n\nAustralia became the first non-American force to operate the C-130A Hercules with 12 examples being delivered from late 1958. The Royal Canadian Air Force became another early user with the delivery of four B-models (Canadian designation C-130 Mk I) in October / November 1960.\n\nIn 1963, a Hercules achieved and still holds the record for the largest and heaviest aircraft to land on an aircraft carrier.[http://www.defenceaviation.com/2007/06/c-130-hercules-on-aircraft-carrier.html \"C-130 Hercules on Aircraft carrier.\"] Defence Aviation, 2 May 2007. Retrieved 2 October 2010. During October and November that year, a USMC KC-130F (BuNo 149798), loaned to the U.S. Naval Air Test Center, made 29 touch-and-go landings, 21 unarrested full-stop landings and 21 unassisted take-offs on  at a number of different weights.[http://navysite.de/cvn/cv59.htm \"USS Forrestal (CV 59).\"] navysite.de (Unofficial U.S. Navy site). Retrieved: 2 October 2010.  The pilot, Lieutenant (later Rear Admiral) James H. Flatley III, USN, was awarded the Distinguished Flying Cross for his role in this test series. The tests were highly successful, but the idea was considered too risky for routine carrier onboard delivery (COD) operations. Instead, the Grumman C-2 Greyhound was developed as a dedicated COD aircraft. The Hercules used in the test, most recently in service with Marine Aerial Refueler Squadron 352 (VMGR-352) until 2005, is now part of the collection of the National Museum of Naval Aviation at NAS Pensacola, Florida.\n\nIn 1964, C-130 crews from the 6315th Operations Group at Naha Air Base, Okinawa commenced forward air control (FAC; \"Flare\") missions over the Ho Chi Minh Trail in Laos supporting USAF strike aircraft. In April 1965 the mission was expanded to North Vietnam where C-130 crews led formations of Martin B-57 Canberra bombers on night reconnaissance/strike missions against communist supply routes leading to South Vietnam. In early 1966 Project Blind Bat/Lamplighter was established at Ubon Royal Thai Air Force Base, Thailand. After the move to Ubon the mission became a four-engine FAC mission with the C-130 crew searching for targets then calling in strike aircraft. Another little-known C-130 mission flown by Naha-based crews was Operation Commando Scarf, which involved the delivery of chemicals onto sections of the Ho Chi Minh Trail in Laos that were designed to produce mud and landslides in hopes of making the truck routes impassable.\n\nIn November 1964, on the other side of the globe, C-130Es from the 464th Troop Carrier Wing but loaned to 322d Air Division in France, took part in Operation Dragon Rouge, one of the most dramatic missions in history in the former Belgian Congo. After communist Simba rebels took white residents of the city of Stanleyville hostage, the U.S. and Belgium developed a joint rescue mission that used the C-130s to drop, air-land and air-lift a force of Belgian paratroopers to rescue the hostages. Two missions were flown, one over Stanleyville and another over Paulis during Thanksgiving weeks.Odom, Maj. T. [https://web.archive.org/web/20100505204701/http://www.cgsc.edu/carl/resources/csi/odom/odom.asp \"Dragon Operations: Hostage Rescues in the Congo, 1964–1965.\"] Combat Studies Institute, January 2009. Retrieved 2 October 2010. The headline-making mission resulted in the first award of the prestigious MacKay Trophy to C-130 crews.\n\nIn the Indo-Pakistani War of 1965, as a desperate measure the transport No. 6 Squadron of the Pakistan Air Force modified its entire small fleet of C-130Bs for use as heavy bombers, capable of carrying up to 20,000 lb (9,072 kg) of bombs on pallets. These improvised bombers were used to hit Indian targets such as bridges, heavy artillery positions, tank formations and troop concentrations.Thomas Newdick's [https://medium.com/war-is-boring/the-unusual-history-of-transport-bomber-planes-2ce280fbb546 \"The Unusual History of Transport Bomber Planes\"] War Is Boring, 2 March 2015. Retrieved 2 September 2015.Group Captain (Retd) SULTAN M HALI's [http://defencejournal.com/dec98/christian.htm \"PAF's Gallant Christian Heroes Carry Quaid's Message\"] Defence Journal, December 1998. Retrieved 5 September 2015. Some C-130s even flew with anti-aircraft guns fitted on their ramp, apparently shooting down some 17 aircraft and damaging 16 others.Tatheer Islam's [http://www.samaa.tv/pakistan/2015/09/paf-entire-c-130-fleet-used-as-bomber-aircraft-in-1965-war/ \"PAF entire C-130 fleet used as bomber aircraft in 1965 war\"] SAMAA TV, 5 September 2015. Retrieved 5 September 2015.\n\nIn October 1968, a C-130Bs from the 463rd Tactical Airlift Wing dropped a pair of M-121 10,000 pound bombs that had been developed for the massive Convair B-36 Peacemaker bomber but had never been used. The U.S. Army and U.S. Air Force resurrected the huge weapons as a means of clearing landing zones for helicopters and in early 1969 the 463rd commenced Commando Vault missions. Although the stated purpose of COMMANDO VAULT was to clear LZs, they were also used on enemy base camps and other targets.\n\nDuring the late 1960s, the U.S. was eager to get information on Chinese nuclear capabilities. After the failure of the Black Cat Squadron to plant operating sensor pods near the Lop Nur Nuclear Weapons Test Base using a Lockheed U-2, the CIA developed a plan, named Heavy Tea, to deploy two battery-powered sensor pallets near the base. To deploy the pallets, a Black Bat Squadron crew was trained in the U.S. to fly the C-130 Hercules. The crew of 12, led by Col Sun Pei Zhen, took off from Takhli Royal Thai Air Force Base in an unmarked U.S. Air Force C-130E on 17 May 1969. Flying for six and a half hours at low altitude in the dark, they arrived over the target and the sensor pallets were dropped by parachute near Anxi in Gansu province. After another six and a half hours of low altitude flight, they arrived back at Takhli. The sensors worked and uploaded data to a U.S. intelligence satellite for six months, before their batteries failed. The Chinese conducted two nuclear tests, on 22 September 1969 and 29 September 1969, during the operating life of the sensor pallets. Another mission to the area was planned as Operation Golden Whip, but was called off in 1970.Pocock, Chris. The Black Bats: CIA Spy Flights over China from Taiwan 1951–1969. Atglen, Ennsylvania: Schiffer Military History, 2010. . It is most likely that the aircraft used on this mission was either C-130E serial number 64-0506 or 64-0507 (cn 382-3990 and 382-3991). These two aircraft were delivered to Air America in 1964.Leeker, Dr. Joe. [http://www.utdallas.edu/library/collections/speccoll/Leeker/c130.pdf \"Air America: Lockheed C-130 Hercules.\"]  The University of Texas at Dallas. 23 August 2010. Retrieved 29 January 2012. After being returned to the U.S. Air Force sometime between 1966 and 1970, they were assigned the serial numbers of C-130s that had been destroyed in accidents. 64-0506 is now flying as 62-1843, a C-130E that crashed in Vietnam on 20 December 1965 and 64-0507 is now flying as 63-7785, a C-130E that had crashed in Vietnam on 17 June 1966.Baugher, Joe [http://www.joebaugher.com/usaf_serials/1964.html 1964 USAF Serial Numbers] Retrieved: 29 January 2012.\n\nThe A-model continued in service through the Vietnam War, where the aircraft assigned to the four squadrons at Naha AB, Okinawa and one at Tachikawa Air Base, Japan performed yeoman's service, including operating highly classified special operations missions such as the BLIND BAT FAC/Flare mission and FACT SHEET leaflet mission over Laos and North Vietnam. The A-model was also provided to the Republic of Vietnam Air Force as part of the Vietnamization program at the end of the war, and equipped three squadrons based at Tan Son Nhut AFB. The last operator in the world is the Honduran Air Force, which is still flying one of five A model Hercules (FAH 558, c/n 3042) as of October 2009.Olausson 2010, p. 5. As the Vietnam War wound down, the 463rd Troop Carrier/Tactical Airlift Wing B-models and A-models of the 374th Tactical Airlift Wing were transferred back to the United States where most were assigned to Air Force Reserve and Air National Guard units.\n\nAnother prominent role for the B model was with the United States Marine Corps, where Hercules initially designated as GV-1s replaced C-119s. After Air Force C-130Ds proved the type's usefulness in Antarctica, the U.S. Navy purchased a number of B-models equipped with skis that were designated as LC-130s. C-130B-II electronic reconnaissance aircraft were operated under the SUN VALLEY program name primarily from Yokota Air Base, Japan. All reverted to standard C-130B cargo aircraft after their replacement in the reconnaissance role by other aircraft.\n\nThe C-130 was also used in the 1976 Entebbe raid in which Israeli commando forces carried a surprise assault to rescue 103 passengers of an airliner hijacked by Palestinian and German terrorists at Entebbe Airport, Uganda. The rescue force—200 soldiers, jeeps, and a black Mercedes-Benz (intended to resemble Ugandan Dictator Idi Amin's vehicle of state)—was flown over 2200 nmi almost entirely at an altitude of less than 100 ft from Israel to Entebbe by four Israeli Air Force (IAF) Hercules aircraft without mid-air refueling (on the way back, the aircraft refueled in Nairobi, Kenya).\n\nDuring the Falklands War () of 1982, Argentine Air Force C-130s undertook highly dangerous, daily re-supply night flights as blockade runners to the Argentine garrison on the Falkland Islands. They also performed daylight maritime survey flights. One was lost during the war, shot down by a Royal Navy Sea Harrier. Argentina also operated two KC-130 tankers during the war, and these refueled both the Douglas A-4 Skyhawks and Navy Dassault-Breguet Super Étendards; some C-130s were modified to operate as bombers with bomb-racks under their wings. The British also used RAF C-130s to support their logistical operations.\n\nDuring the Gulf War of 1991 (Operation Desert Storm), the C-130 Hercules was used operationally by the U.S. Air Force, U.S. Navy and U.S. Marine Corps, along with the air forces of Australia, New Zealand, Saudi Arabia, South Korea and the UK. The MC-130 Combat Talon variant also made the first attacks using the largest conventional bombs in the world, the BLU-82 \"Daisy Cutter\" and GBU-43/B \"Massive Ordnance Air Blast\" bomb, (MOAB). Daisy Cutters were used to clear landing zones and to eliminate mine fields. The weight and size of the weapons make it impossible or impractical to load them on conventional bombers. The GBU-43/B MOAB is a successor to the BLU-82 and can perform the same function, as well as perform strike functions against hardened targets in a low air threat environment.\n\nSince 1992, two successive C-130 aircraft named Fat Albert have served as the support aircraft for the U.S. Navy Blue Angels flight demonstration team. Fat Albert I was a TC-130G (151891),Olausson, Lars, \"Lockheed Hercules Production List 1954–2012\", 28th edition, self-published, Såtenäs, Sweden, March 2010, page 43. while Fat Albert II is a C-130T (164763).Olausson, Lars, \"Lockheed Hercules Production List 1954–2012\", 28th edition, self-published, Såtenäs, Sweden, March 2010, page 120. Although Fat Albert supports a Navy squadron, it is operated by the U.S. Marine Corps (USMC) and its crew consists solely of USMC personnel. At some air shows featuring the team, Fat Albert takes part, performing flyovers. Until 2009, it also demonstrated its rocket-assisted takeoff (RATO) capabilities; these ended due to dwindling supplies of rockets.McCullough, Amy. \"Abort Launch: Air shows to do without Fat Albert's famed JATO.\" Marine Corps Times, 9 November 2009. Retrieved 20 November 2009.\n\nThe AC-130 also holds the record for the longest sustained flight by a C-130. From 22 to 24 October 1997, two AC-130U gunships flew 36 hours nonstop from Hurlburt Field Florida to Taegu (Daegu), South Korea while being refueled seven times by KC-135 tanker aircraft. This record flight shattered the previous record longest flight by over 10 hours while the two gunships took on 410000 lb of fuel. The gunship has been used in every major U.S. combat operation since Vietnam, except for Operation El Dorado Canyon, the 1986 attack on Libya.[http://www.afsoc.af.mil/library/afsocheritage/index.asp \"AFSOC Heritage.\"]  US Air Force Special Operations Command. Retrieved: 31 July 2009.\n\nDuring the invasion of Afghanistan in 2001 and the ongoing support of the International Security Assistance Force (Operation Enduring Freedom), the C-130 Hercules has been used operationally by Australia, Belgium, Canada, Denmark, France, Italy, the Netherlands, New Zealand, Norway, Portugal, South Korea, Spain, the UK and the United States.\n\nDuring the 2003 invasion of Iraq (Operation Iraqi Freedom), the C-130 Hercules was used operationally by Australia, the UK and the United States. After the initial invasion, C-130 operators as part of the Multinational force in Iraq used their C-130s to support their forces in Iraq.\n\nSince 2004, the Pakistan Air Force has employed C-130s in the War in North-West Pakistan. Some variants had forward looking infrared (FLIR Systems Star Safire III EO/IR) sensor balls, to enable close tracking of Islamist militants.[http://tribune.com.pk/story/291762/paf-conducted-5500-bombing-runs-in-fata-since-2008/ PAF conducted 5,500 bombing runs in Fata since 2008], The Express Tribune, 14 November 2011\n\nCivilian\n\nThe U.S. Forest Service developed the Modular Airborne FireFighting System for the C-130 in the 1970s, which allows regular aircraft to be temporarily converted to an airtanker for fighting wildfires.[http://www.fs.fed.us/fire/aviation/fixed_wing/maffs/index.html \"Modular Airborne FireFighting Systems.\"]  U.S. Forest Service, 16 March 2010. Retrieved 2 October 2010. In the late 1980s, 22 retired USAF C-130As were removed from storage at Davis-Monthan Air Force Base and transferred to the U.S. Forest Service, which then  transferred them to six private companies to be converted into air tankers. After one of these aircraft crashed due to wing separation in flight as a result of fatigue stress cracking, the entire fleet of C-130A air tankers was permanently grounded in 2004. C-130s were used to spread chemical dispersants onto the Deepwater Horizon oil spill in the Gulf Coast in 2010.\n\nA recent development of a C-130–based airtanker is the Retardant Aerial Delivery System developed by Coulson Aviation USA. The system consists of a C-130H/Q retrofitted with an in-floor discharge system, combined with a removable 3,500- or 4,000-gallon water tank. The combined system is FAA certified.\n\nVariants\n\nSignificant military variants of the C-130 include:\n;C-130A/B/E/F/G/H/K/T\nTactical airlifter basic models\n;C-130A-II Dreamboat\nEarly version Electronic Intelligence/Signals Intelligence (ELINT/SIGINT) aircraft\n;C-130J Super Hercules\nTactical airlifter, with new engines, avionics, and updated systems\n;C-130K\nDesignation for RAF Hercules C1/W2/C3 aircraft (C-130Js in RAF service are the Hercules C.4 and Hercules C.5)\n;AC-130A/E/H/J/U/W\nGunship variants\n;C-130D/D-6\nSki-equipped version for snow and ice operations United States Air Force / Air National Guard\n;CC-130E/H/J Hercules\nDesignation for Canadian Armed Forces / Royal Canadian Air Force Hercules aircraft. U.S. Air Force used the CC-130J designation to differentiate the standard C-130J variant from the \"stretched\" C-130J (company designation C-130J-30).\n;C-130M: Designation used by the Brazilian Air Force for locally modified / up-graded C-130H aircraft\n;DC-130A/E/H\nUSAF and USN Drone control\n;EC-130\nEC-130E/J Commando Solo – USAF / Air National Guard psychological operations version\nEC-130E Airborne Battlefield Command and Control Center (ABCCC) – USAF procedural air-to-ground attack control, also provided NRT threat updates\nEC-130E Rivet Rider – Airborne psychological warfare aircraft\nEC-130H Compass Call – Electronic warfare and electronic attack.King, Capt. Vince, Jr. [https://web.archive.org/web/20120309175317/http://www.af.mil/news/story.asp?storyID=123030212 \"Compass Call continues to 'Jam' enemy.\"] Air Force Link, United States Air Force, 1 November 2006.\nEC-130V – Airborne early warning and control (AEW&C) variant used by USCG for counter-narcotics missions[https://fas.org/man/dod-101/sys/ac/ec-130v.htm \"Lockheed EC-130V Hercules.\"] Military Analysis Network, Federation of American Scientists, 10 February 1998. Retrieved 2 October 2010.\n;GC-130\nPermanently grounded instructional airframes\n;HC-130\nHC-130B/E/H – Early model combat search and rescue\nHC-130P/N Combat King – USAF aerial refueling tanker and combat search and rescue\nHC-130J Combat King II – Next generation combat search and rescue tanker\nHC-130H/J – USCG long-range surveillance and search and rescue\n;JC-130\nTemporary conversion for flight test operations; Also used to recover film from American spy satellites.\n;KC-130F/R/T/J\nUnited States Marine Corps aerial refueling tanker and tactical airlifter\n;LC-130F/H/R\nUSAF / Air National Guard – Ski-equipped version for Arctic and Antarctic support operations; LC-130F previously operated by USN\n;MC-130\nMC-130E/H Combat Talon I/II – Special operations infiltration/extraction variant\nMC-130W Combat Spear/Dragon Spear – Special operations tanker/gunshipHousman, Damian. [https://web.archive.org/web/20121020033903/http://www.af.mil/news/story.asp?id\n123022607 \"Highly modified C-130 ready for war on terrorism.\"] Air Force Link, United States Air Force, 29 June 2006.\nMC-130P Combat Shadow – Special operations tanker\nMC-130J Commando II (formerly Combat Shadow II) – Special operations tanker Air Force Special Operations Command[http://www.afsoc.af.mil/news/story.asp?id=123294130 MC-130 J name change promotes modern missions, preserves heritage] . Afsoc.af.mil. Retrieved on 2013-08-16.\nYMC-130H – Modified aircraft under Operation Credible Sport for second Iran hostage crisis rescue attempt\n;NC-130\nPermanent conversion for flight test operations\n;PC-130/C-130-MP\nMaritime patrol\n;RC-130A/S\nSurveillance aircraft for reconnaissance\n;SC-130J Sea Herc\nProposed maritime patrol version of the C-130J, designed for coastal surveillance and anti-submarine warfare.\n\n;TC-130\nAircrew training\n;VC-130H\nVIP transport\n;WC-130A/B/E/H/J\nWeather reconnaissance (\"Hurricane Hunter\") version for USAF / Air Force Reserve Command's 53d Weather Reconnaissance Squadron in support of the National Weather Service's National Hurricane Center\n\nOperators\n\nFormer operators\n* \n* \n\nAccidents\n\nThe C-130 Hercules has had a low accident rate in general. The Royal Air Force recorded an accident rate of about one aircraft loss per 250,000 flying hours over the last 40 years, placing it behind Vickers VC10s and Lockheed TriStars with no flying losses.[http://www.dasa.mod.uk/natstats/accidents/accdam/acctab2.html \"Aircraft Air Accidents and Damage Rates.\"] Defence Analytical Services Agency. Retrieved: 2 October 2010.  USAF C-130A/B/E-models had an overall attrition rate of 5% as of 1989 as compared to 1–2% for commercial airliners in the U.S., according to the NTSB, 10% for B-52 bombers, and 20% for fighters (F-4, F-111), trainers (T-37, T-38), and helicopters (H-3).Diehl 2002, p. 45.\n\nA total of 70 aircraft were lost by the U.S. Air Force and the U.S. Marine Corps during combat operations in the Vietnam War in Southeast Asia. By the nature of the Hercules' worldwide service, the pattern of losses provides an interesting barometer of the global hot spots over the past 50 years.[http://aviation-safety.net/database/type/type.php?type\n335-C \"Lockheed C-130 Hercules.\"] Aviation Safety Network, Flight Safety Foundation, 13 November 2004. Retrieved 2 October 2010.\n\nAircraft on display\n\nArgentina\n\n* C-130B FAA TC-60. ex USAF 61-0964 received on February 1992 now at Museo Nacional de Aeronáutica since September 2011.[http://arqueologiaaeronautica.blogspot.com.ar/2012/10/hercules-c-130-b-tc-60-moron.html LOCKHEED C-130B Hercules – Mat. TC-60 – Morón]\n\nAustralia\n\n* C-130A RAAF A97-214 used by 36 Squadron from early 1959, withdrawn from use late 1978; now at RAAF Museum, RAAF Base Williams, Point Cook.\n* C-130E RAAF A97-160 used by 37 Squadron from August 1966, withdrawn from use November 2000; to RAAF Museum, 14 November 2000, cocooned as of September 2005.Olausson 2010, p. 62.\n\nCanada\n\n* CC-130E RCAF 10313 (later 130313) is on display at the National Air Force Museum of Canada, CFB Trenton\n* CC-130E RCAF 130328 is on display at the Greenwood Aviation Museum, CFB Greenwood\n\nColombia\n\n* C-130B FAC 1010 (serial number 3521) moved on 14 January 2016 to the Colombian Aerospace Museum in Tocancipá, Cundinamarca, for static display.\n* C-130B FAC1011 (serial number 3585, ex 59-1535) preserved at the Colombian Air and Space Museum within CATAM AFB, Bogotá.\n\nIndonesia\n\n* C-130B Indonesian Air Force A-1301 preserved at Sulaeman Airstrip, Bandung. Also occasionally used for Paskhas Training.The airplane is relocated to Air Force Museum in Yogyakarta in 2017.https://tni-au.mil.id/berita/fuselage-c-130-hercules-1301-dalam-perjalanan-ke-muspusdirla\n\nNorway\n\n* C-130H Royal Norwegian Air Force 953 was retired 10 June 2007 and moved to the Air Force museum at Oslo Gardermoen in May 2008.Olausson 2010, p. 73.\n\nSaudi Arabia\n\n* C-130H RSAF 460 was operated by 4 Squadron Royal Saudi Air Force, December 1974 until January 1987. It was damaged in a fire at Jeddah in December 1989. Restored for ground training by August 1993. At Royal Saudi Air Force Museum, November 2002, restored for ground display by using a tail from another C-130H.Olausson 2010, p. 85.\n\nUnited Kingdom\n\n* Hercules C3 XV202 served with the Royal Air Force from 1967 to 2011, is on display at the Royal Air Force Museum Cosford.[http://www.rafmuseum.org.uk/cosford/news/article.cfm?headline=Hercules%20makes%20final%20flight%20into%20Cosfordm \"Hercules makes final flight into Cosford.\"] Royal Air Force Museum. Retrieved: 22 September 2011.\n\nUnited States\n\n* C-130A, AF Ser. No. 55-0037 used by the 773 TCS, 483 TCW, 315 AD, 374 TCW, 815 TAS, 35 TAS, 109 TAS, belly-landed at Duluth, Minnesota, April 1973, repaired; 167 TAS, 180 TAS, to Chanute Technical Training Center as GC-130A, May 1984; now displayed at Octave Chanute Aerospace Museum, Rantoul Aviation Complex (former Chanute AFB, Rantoul, Illinois as of November 1995.Olausson 2010, p. 7.\n* C-130A, AF Ser. No. 56-0518 used by the 314 TCW, 315 AD, 41 ATS, 328 TAS; to Republic of Vietnam Air Force 435 Transport Squadron, November 1972; holds the C-130 record for taking off with the most personnel on board, during evacuation of SVN, 29 April 1975, with 452. Returned to USAF, 185 TAS, 105 TAS; Flown to Little Rock AFB on June 28, 1989.  It was converted to a static display at the LRAFB Visitor Center, Arkansas by Sept. 1989. http://onlyinark.com/culture/last-herk-vietnam/\n* C-130A, AF Ser. No. 57-0453 was operated from 1958 to 1991, last duty with 155th TAS, 164th TAG, Tennessee Air National Guard, Memphis International Airport/ANGB, Tennessee, 1976–1991, named \"Nite Train to Memphis\"; to AMARC in December 1991, then sent to Texas for modification into replica of C-130A-II Dreamboat aircraft, AF Ser. No. 56-0528, shot down by Soviet fighters in Soviet airspace near Yerevan, Armenia on 2 September 1958, while on ELINT mission with loss of all crew, displayed in National Vigilance Park, National Security Agency grounds, Fort George Meade, Maryland.Olausson 2010, p. 14.\n* C-130B, AF Ser. No. 59-0528 was operated by 145th Airlift Wing, North Carolina Air National Guard; placed on static display at Charlotte Air National Guard Base, North Carolina in 2010.\n* C-130D, AF Ser. No. 57-0490 used by the 61st TCS, 17th TCS, 139th TAS with skis, July 1975 – April 1983; to MASDC, 1984–1985, GC-130D ground trainer, Chanute AFB, Illinois, 1986–1990; When Chanute AFB closed in September 1993, it moved to the Octave Chanute Aerospace Museum (former Chanute AFB, Rantoul, Illinois. In July 1994, it moved to the Empire State Air Museum, Schenectady County Airport, New York, until placed on the gate at Stratton Air National Guard Base in October 1994.Olausson 2010, p. 16.\n* NC-130B, AF Ser. No. 57-0526 was the second B model manufactured, initially delivered as JC-130B; assigned to 6515th Organizational Maintenance Squadron for flight testing at Edwards AFB, California on 29 November 1960; turned over to 6593rd Test Squadron's Operating Location No. 1 at Edwards AFB and spent next seven years supporting Corona Program; \"J\" status and prefix removed from aircraft on October 1967; transferred to 6593rd Test Squadron at Hickam AFB, Hawaii and modified for mid-air retrieval of satellites; acquired by 6514th Test Squadron at Hill AFB, Utah in Jan. 1987 and used as electronic testbed and cargo transport; aircraft retired January 1994 with 11,000+ flight hours and moved to Hill Aerospace Museum at Hill AFB by January 1994.Olausson 2010, p. 19.\n* C-130E, AF Ser. No. 62-1787, on display at the National Museum of the United States Air Force, Wright-Patterson AFB, Ohio, was flown to the museum on 18 August 2011. One of the greatest feats of heroism during the Vietnam War involved the C-130E, call sign \"Spare 617\". The C-130E attempted to airdrop ammunition to surrounded South Vietnamese forces at An Loc, Vietnam. Approaching the drop zone, Spare 617 received heavy enemy ground fire that damaged two engines, ruptured a bleed air duct in the cargo compartment, and set the ammunition on fire. Flight engineer TSgt Sanders was killed, and navigator 1st Lt Lenz and co-pilot 1st Lt Hering were both wounded. Despite receiving severe burns from hot air escaping from the damaged air bleed duct, loadmaster TSgt Shaub extinguished a fire in the cargo compartment, and successfully jettisoned the cargo pallets, which exploded in mid-air. Despite losing a third engine on final approach, pilot Capt Caldwell landed Spare 617 safely. For their actions, Caldwell and Shaub received the Air Force Cross, the U.S. Air Force's second highest award for valor. TSgt Shaub also received the William H. Pitsenbarger Award for Heroism from the Air Force Sergeants Association.[http://www.nationalmuseum.af.mil/factsheets/factsheet.asp?id=18724 \"Factsheet: Lockheed C-130E Hercules.\"]  National Museum of the United States Air Force, 29 February 2011.\n* KC-130F, USN/USMC BuNo 149798 used in tests in October–November 1963 by the U.S. Navy for unarrested landings and unassisted take-offs from the carrier USS Forrestal (CV-59), it remains the record holder for largest aircraft to operate from a carrier flight deck, and carried the name \"Look Ma, No Hook\" during the tests. Retired to the National Museum of Naval Aviation, NAS Pensacola, Florida in May 2003.Olausson 2010, p. 30.\n* C-130G, USN/USMC BuNo 151891; modified to EC-130G, 1966, then testbed for EC-130Q TACAMO in 1981. To TC-130G in May 1990 and assigned as the U.S. Navy's Blue Angels USMC support aircraft, serving as \"Fat Albert Airlines\" from 1991 to 2002. Retired to the National Museum of Naval Aviation at NAS Pensacola, Florida in November 2002.Olausson 2010, p. 43.\n* C-130E, AF Ser. No. 64-0525 was on display at the 82nd Airborne Division War Memorial Museum at Fort Bragg, North Carolina. The aircraft was the last assigned to the 43rd AW at Pope AFB, North Carolina prior to retirement from the USAF.Olausson 2010, p. 52.\n* C-130E, AF Ser. No. 69-6579 operated by the 61st TAS, 314th TAW, 50th AS, 61st AS; at Dyess AFB as maintenance trainer as GC-130E, March 1998; to Dyess AFB Linear Air Park, January 2004.Olausson 2010, p. 74.\n* MC-130E Combat Talon I, AF Ser. No. 64-0567, unofficially known as \"Wild Thing\". It transported captured Panamanian dictator Manuel Noriega in 1989 during Operation Just Cause, and participated in Operation Eagle Claw, the unsuccessful attempt to rescue U.S. hostages from Iran in 1980. Wild Thing was also the first fixed-wing aircraft to employ night-vision goggles. On display at Hurlburt Field, in Florida.[http://www.codeonemagazine.com/news_item.html?item_id=320 \"Combat Talon Dedicated.\"] Code One Magazine, 6 May 2011.\n* C-130E, AF Ser. No. 69-6580 operated by the 61st TAS, 314th TAW, 317th TAW, 314th TAW, 317th TAW, 40th AS, 41st AS, 43rd AW, retired after center wing cracks were detected in April 2002; to the Air Mobility Command Museum, Dover AFB, Delaware on 2 February 2004.\n* C-130E, AF Ser. No. 70-1269 used by the 43rd AW and is on display at the Pope Air Park, Pope AFB, North Carolina as 2006.Olausson 2010, p. 78.\n* C-130H, AF Ser. No. 74-1686 used by the 463rd TAW; one of three C-130H airframes modified to YMC-130H for aborted rescue attempt of Iranian hostages, Operation Credible Sport, with rocket packages blistered onto fuselage in 1980, but these were removed after mission was canceled. Subsequent duty with the 4950th Test Wing, then donated to the Museum of Aviation at Robins AFB, Georgia, in March 1988.Olausson 2010, p. 91.\n\nSpecifications (C-130H). Lockheed C-130 Hercules. http://en.wikipedia.org/?curid=7697."
  }
}
