{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4267",
  "eid" : "cc5a7750-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778422597,
  "textBody" : "Belle and Sebastian are a Scottish band formed in Glasgow in January 1996. Led by Stuart Murdoch, the band has released 9 albums to date. Much of their work had been released on Jeepster Records, but they are now signed to Rough Trade Records in the United Kingdom and Matador Records in the United States. Though often praised by critics, Belle and Sebastian have enjoyed only limited commercial success.\n\nHistory\n\nFormation and early years (1994–1998)\n\nBelle and Sebastian were formed in Glasgow, Scotland in 1994 by Stuart Murdoch and Stuart David, both of whom had enrolled at Stow College's Beatbox program for unemployed musicians. Together, with music professor Alan Rankine (formerly of The Associates), they recorded some demos, which were picked up by the college's Music Business course that produces and releases one single each year on the college's label, Electric Honey. As the band had a number of songs already and the label was extremely impressed with the demos, Belle and Sebastian were allowed to record a full-length album, which was titled Tigermilk. Murdoch once described the band as a \"product of botched capitalism\". The band took their name from the television adaptation of the French novel Belle et Sébastien.\n\nTigermilk was recorded in three days and originally only one thousand copies were pressed in vinyl. These original copies now sell for up to £400. The warm reception the album received inspired Murdoch and David to turn the band into a full-time project, recruiting Stevie Jackson (guitar and vocals), Isobel Campbell (cello/vocals), Chris Geddes (keys) and Richard Colburn (drums) to fill out the group.\n\nAfter the success of the debut album, Belle and Sebastian were signed to Jeepster Records in August 1996 and If You're Feeling Sinister, their second album, was released on 18 November. The album was named by Spin as one of the 100 greatest albums between 1985 and 2005, and is widely considered the band's masterpiece. Just before the recording of Sinister, Sarah Martin (violin/vocals) joined the band. Following this a series of EPs were released in 1997. The first of these was Dog on Wheels, which contained four demo tracks recorded before the real formation of the band. In fact, the only long-term band members to play on the songs were Murdoch, David, and Mick Cooke, who played trumpet on the EP but would not officially join the band until a few years later. It charted at No. 59 in the UK singles chart.\n\nThe Lazy Line Painter Jane EP followed in July. The track was recorded in the church where Murdoch lived and features vocals from Monica Queen. The EP narrowly missed out on the UK top 40, peaking at No. 41. The last of the 1997 EPs was October's 3.. 6.. 9 Seconds of Light. The EP was made Single of the Week in both the NME and Melody Maker and reached No. 32 in the charts, thus becoming the band's first top 40 single.\n\nCritical acclaim and line-up changes (1998–2003)\n\nThe band released their third LP, The Boy with the Arab Strap in 1998, and it reached No. 12 in the UK charts.  Arab Strap garnered positive reviews from Rolling Stone and the Village Voice, among others; however, the album has its detractors, including Pitchfork, who gave the album a particularly poor review, calling it a \"parody\" of their earlier work (Pitchfork has since removed the review from their website).  During the recording of the album, long-time studio trumpet-player Mick Cooke was asked to join the band as a full member. The This Is Just a Modern Rock Song EP followed later that year.\n\nIn 1999 the band was awarded with Best Newcomer (for their third album) at the BRIT Awards, upsetting better-known acts such as Steps and 5ive. That same year, the band hosted their own festival, the Bowlie Weekender. Tigermilk was also given a full release by Jeepster before the band started work on their next LP. The result was Fold Your Hands Child, You Walk Like a Peasant, which became the band's first top 10 album in the UK. A stand-alone single, \"Legal Man\", reached No. 15 and gave them their first appearance on Top of the Pops.\n\nAs the band's popularity and recognition was growing worldwide, their music began appearing in films and on television. The 2000 film High Fidelity mentions the band and features a clip from the song \"Seymour Stein\" from The Boy with the Arab Strap. Also, the title track from Arab Strap was played over the end credits of the UK television series Teachers, and the lyric \"Colour my life with the chaos of trouble\" from the song was quoted by one of the characters in the 2009 film (500) Days of Summer.\n\nStuart David soon left the band to concentrate on his side project, Looper, and his book writing, which included his The Idle Thoughts of a Daydreamer. He was replaced by Bobby Kildea of V-Twin. The \"Jonathan David\" single, sung by Stevie Jackson, was released in June 2001 and was followed by \"I'm Waking Up to Us\" in November. \"I'm Waking Up to Us\" saw the band use an outside producer (Mike Hurst) for the first time. Most of 2002 was spent touring and recording a soundtrack album, Storytelling (for Storytelling by Todd Solondz). Campbell left the band in the spring of 2002, in the middle of the band's North American tour to pursue a solo career, first as The Gentle Waves, and later under her own name. She later collaborated with singer Mark Lanegan on three albums.\n\nLabel change and return to success (2003–2010)\n\nThe band left Jeepster in 2002, signing a four-album deal with Rough Trade Records. Their first album for Rough Trade, Dear Catastrophe Waitress, was released in 2003, and was produced by Trevor Horn. The album showed a markedly more \"produced\" sound compared to their first four LPs, as the band was making a concerted effort to produce more \"radio-friendly\" music. The album was warmly received and is credited with restoring the band's \"indie cred\". The album also marked the return of Murdoch as the group's primary songwriter, following the poorly received Fold Your Hands Child, You Walk Like a Peasant and Storytelling, both of which were more collaborative than the band's early work. A documentary DVD, Fans Only, was released by Jeepster in October 2003, featuring promotional videos, live clips and unreleased footage. A single from the album, \"Step into My Office, Baby\" followed in November 2003; it would be their first single to be taken from an album, and included a track recorded with Divine Comedy producer Darren Allison entitled Love On The March.\n\nThe Thin Lizzy-inspired \"I'm a Cuckoo\" was the second single from the album. It achieved their highest chart position yet, reaching No. 14 in the UK. The Books EP followed, a double A-side single led by \"Wrapped Up in Books\" from Dear Catastrophe Waitress and the new \"Your Cover's Blown\". This EP became the band's third top 20 UK release, and the band was nominated for both the Mercury Music Prize and an Ivor Novello Award. In January 2005, B&S was voted Scotland's greatest band in a poll by The List, beating Simple Minds, Idlewild, Travis, Franz Ferdinand, and The Proclaimers, among others.\n\nIn April 2005, members of the band visited Israel and the Palestinian territories with the UK charity War on Want; the group subsequently recorded a song inspired by the trip titled \"The Eighth Station of the Cross Kebab House\", which would first appear on the digital-download version of the charity album Help!: A Day in the Life and would later have a physical release as a B-side on 2006's \"Funny Little Frog\" single. Push Barman to Open Old Wounds, a compilation of the Jeepster singles and EPs, was released in May 2005 while the band were recording their seventh album in California. The result of the sessions was The Life Pursuit, produced by Tony Hoffer. The album, originally intended to be a double album, became the band's highest-charting album upon its release in February 2006, peaking at No. 8 in the UK and No. 65 on the US Billboard 200. \"Funny Little Frog\", which preceded it, also proved to be their highest-charting single, debuting at No. 13.\n\nOn 6 July 2006, the band played a historic  show with the Los Angeles Philharmonic at the Hollywood Bowl. The opening act at the 18,000 seat sell-out concert was The Shins. The members of the band see this as a landmark event, with Stevie Jackson saying, \"This is the biggest thrill of my entire life\". In October 2006, members of the band helped put together a CD collection of new songs for children titled Colours Are Brighter, with the involvement of major bands such as Franz Ferdinand and The Flaming Lips.\n\nOn 18 November 2008 the band released The BBC Sessions, which features songs from the period of 1996–2001 (including the last recordings featuring Isobel Campbell before she left the band), along with a second disc featuring a recording of a live performance in Belfast from Christmas 2001.\n\nRecent years (2010–present)\n\nOn 17 July 2010, the band performed their first UK gig in almost four years to a crowd of around 30,000 at Latitude Festival in Henham Park, Southwold. They performed two new songs, \"I Didn't See It Coming\" and \"I'm Not Living in the Real World\".\n\nTheir eighth studio album, released in the UK and internationally on 25 September 2010, was titled Belle and Sebastian Write About Love. The first single from the album, as well as the record's title track \"Write About Love\", was released in the US on 7 September 2010. Write About Love entered the UK albums chart in its first week of release, peaking at No. 8 as of 19 October 2010. Norah Jones is featured on the track \"Little Lou, Ugly Jack, Prophet John\"./\n\nIn December 2010 Belle and Sebastian curated the sequel to the Bowlie Weekender in the form of Bowlie 2 presented by All Tomorrow's Parties.\n\nIn 2013, Pitchfork TV released an hour-long documentary in February, directed by RJ Bentler which focused on the band's 1996 album If You're Feeling Sinister, as well as the formation and early releases of the band. The documentary featured interviews with every member that was present on the album, as well as several archival photos and videos from the band's early days. The band compiled a second compilation album The Third Eye Centre which included the b-sides and rarities released after Push Barman to Open Old Wounds, from the albums Dear Catastrophe Waitress, The Life Pursuit, and Write About Love. In an interview at the end of 2013, Mick Cooke confirmed he had left the band on good terms.\n\nThe band received an 'Outstanding Contribution To Music Award' at the NME Awards 2014.\n\nIn 2014, the band returned to the studio, recording in Atlanta, Georgia for their ninth studio album, along with announcing tour dates for various festivals and concerts across the world during 2014. Their ninth album Girls in Peacetime Want to Dance was released on 19 January 2015.[http://www.nme.com/reviews/belle-and-sebastian--2/15877 The Glasgow veterans flit between acoustic indie and disco bangers on their camp and scatterbrained ninth album], nme.com, by Dan Stubbs, 14 January 2015\nThe Belle and Sebastian song \"There's Too Much Love\" forms much of the soundtrack for the Brazilian film The Way He Looks, about a blind, gay teenage boy and his friends, released in 2014.  \n\nBelle and Sebastian performed at the world-famous Glastonbury Festival on Sunday 28 June 2015, on 'The Other Stage' and at O2 Academy, Glasgow in March 2017 which was televised in the U.K. as part of the 'BBC 6 MUSIC Presents Festival'.\n\nIn mid-2017, the band put out a new single, \"We Were Beautiful\". In December 2017, January and February 2018, the band will releases a trio of EPs under the name How to Solve Our Human Problems.\n\nCollaborations and side projects\n\nThe Reindeer Section were a Scottish indie rock supergroup formed in 2001 by Gary Lightbody of Snow Patrol, which released albums and gigged in 2001 and 2002. It featured Richard Colburn, Mick Cooke and Bobby Kildea from Belle and Sebastian.\n\nThe Vaselines are an alternative rock band from Glasgow formed in Glasgow in 1986. Between 2008 and 2014 their lineup featured Stevie Jackson and Bobby Kildea from Belle and Sebastian and they performed at Bowlie Weekender 2 curated by Belle and Sebastian in December 2010.\n\nTired Pony is a country / Americana supergroup formed by Gary Lightbody of Snow Patrol in 2010. It features Richard Colburn from Belle and Sebastian.\n\nGod Help the Girl is a musical project by Stuart Murdoch, featuring a group of female vocalists, including Catherine Ireton, with Belle and Sebastian as the accompanying band.\n\nMembers\n\n;Current\n*Stuart Murdoch – vocals, electric and acoustic guitar and keyboards (1994–present)\n*Stevie Jackson – vocals, electric and acoustic guitar (1996–present)\n*Chris Geddes – keyboards (1996–present)\n*Richard Colburn – drums and percussion (1996–present)\n*Sarah Martin – keyboards, electric and acoustic guitar, violin, flute and vocals (1996–present)\n*Bobby Kildea – guitar and bass (2000–present)\n*Dave McGowan - bass, guitar, and keyboards (2011–present)\n\n;Past\n*Stuart David – bass, guitar and vocals (1994–2000)\n*Mick Cooke – trumpet, guitar and bass (1995–2013)\n*Isobel Campbell – vocals, cello and keyboards (1996–2002)\n\nDiscography\n\n;Studio albums\n*Tigermilk (1996)\n*If You're Feeling Sinister (1996)\n*The Boy with the Arab Strap (1998)\n*Fold Your Hands Child, You Walk Like a Peasant (2000)\n*Storytelling (2002)\n*Dear Catastrophe Waitress (2003)\n*The Life Pursuit (2006)\n*Belle and Sebastian Write About Love (2010)\n*Girls in Peacetime Want to Dance (2015)\n\nSee also\n\n*List of bands from Glasgow",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Belle and Sebastian" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4267" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Belle and Sebastian are a Scottish band formed in Glasgow in January 1996. Led by Stuart Murdoch, the band has released 9 albums to date. Much of their work had been released on Jeepster Records, but they are now signed to Rough Trade Records in the United Kingdom and Matador Records in the United States. Though often praised by critics, Belle and Sebastian have enjoyed only limited commercial success.\n\nHistory\n\nFormation and early years (1994–1998)\n\nBelle and Sebastian were formed in Glasgow, Scotland in 1994 by Stuart Murdoch and Stuart David, both of whom had enrolled at Stow College's Beatbox program for unemployed musicians. Together, with music professor Alan Rankine (formerly of The Associates), they recorded some demos, which were picked up by the college's Music Business course that produces and releases one single each year on the college's label, Electric Honey. As the band had a number of songs already and the label was extremely impressed with the demos, Belle and Sebastian were allowed to record a full-length album, which was titled Tigermilk. Murdoch once described the band as a \"product of botched capitalism\". The band took their name from the television adaptation of the French novel Belle et Sébastien.\n\nTigermilk was recorded in three days and originally only one thousand copies were pressed in vinyl. These original copies now sell for up to £400. The warm reception the album received inspired Murdoch and David to turn the band into a full-time project, recruiting Stevie Jackson (guitar and vocals), Isobel Campbell (cello/vocals), Chris Geddes (keys) and Richard Colburn (drums) to fill out the group.\n\nAfter the success of the debut album, Belle and Sebastian were signed to Jeepster Records in August 1996 and If You're Feeling Sinister, their second album, was released on 18 November. The album was named by Spin as one of the 100 greatest albums between 1985 and 2005, and is widely considered the band's masterpiece. Just before the recording of Sinister, Sarah Martin (violin/vocals) joined the band. Following this a series of EPs were released in 1997. The first of these was Dog on Wheels, which contained four demo tracks recorded before the real formation of the band. In fact, the only long-term band members to play on the songs were Murdoch, David, and Mick Cooke, who played trumpet on the EP but would not officially join the band until a few years later. It charted at No. 59 in the UK singles chart.\n\nThe Lazy Line Painter Jane EP followed in July. The track was recorded in the church where Murdoch lived and features vocals from Monica Queen. The EP narrowly missed out on the UK top 40, peaking at No. 41. The last of the 1997 EPs was October's 3.. 6.. 9 Seconds of Light. The EP was made Single of the Week in both the NME and Melody Maker and reached No. 32 in the charts, thus becoming the band's first top 40 single.\n\nCritical acclaim and line-up changes (1998–2003)\n\nThe band released their third LP, The Boy with the Arab Strap in 1998, and it reached No. 12 in the UK charts.  Arab Strap garnered positive reviews from Rolling Stone and the Village Voice, among others; however, the album has its detractors, including Pitchfork, who gave the album a particularly poor review, calling it a \"parody\" of their earlier work (Pitchfork has since removed the review from their website).  During the recording of the album, long-time studio trumpet-player Mick Cooke was asked to join the band as a full member. The This Is Just a Modern Rock Song EP followed later that year.\n\nIn 1999 the band was awarded with Best Newcomer (for their third album) at the BRIT Awards, upsetting better-known acts such as Steps and 5ive. That same year, the band hosted their own festival, the Bowlie Weekender. Tigermilk was also given a full release by Jeepster before the band started work on their next LP. The result was Fold Your Hands Child, You Walk Like a Peasant, which became the band's first top 10 album in the UK. A stand-alone single, \"Legal Man\", reached No. 15 and gave them their first appearance on Top of the Pops.\n\nAs the band's popularity and recognition was growing worldwide, their music began appearing in films and on television. The 2000 film High Fidelity mentions the band and features a clip from the song \"Seymour Stein\" from The Boy with the Arab Strap. Also, the title track from Arab Strap was played over the end credits of the UK television series Teachers, and the lyric \"Colour my life with the chaos of trouble\" from the song was quoted by one of the characters in the 2009 film (500) Days of Summer.\n\nStuart David soon left the band to concentrate on his side project, Looper, and his book writing, which included his The Idle Thoughts of a Daydreamer. He was replaced by Bobby Kildea of V-Twin. The \"Jonathan David\" single, sung by Stevie Jackson, was released in June 2001 and was followed by \"I'm Waking Up to Us\" in November. \"I'm Waking Up to Us\" saw the band use an outside producer (Mike Hurst) for the first time. Most of 2002 was spent touring and recording a soundtrack album, Storytelling (for Storytelling by Todd Solondz). Campbell left the band in the spring of 2002, in the middle of the band's North American tour to pursue a solo career, first as The Gentle Waves, and later under her own name. She later collaborated with singer Mark Lanegan on three albums.\n\nLabel change and return to success (2003–2010)\n\nThe band left Jeepster in 2002, signing a four-album deal with Rough Trade Records. Their first album for Rough Trade, Dear Catastrophe Waitress, was released in 2003, and was produced by Trevor Horn. The album showed a markedly more \"produced\" sound compared to their first four LPs, as the band was making a concerted effort to produce more \"radio-friendly\" music. The album was warmly received and is credited with restoring the band's \"indie cred\". The album also marked the return of Murdoch as the group's primary songwriter, following the poorly received Fold Your Hands Child, You Walk Like a Peasant and Storytelling, both of which were more collaborative than the band's early work. A documentary DVD, Fans Only, was released by Jeepster in October 2003, featuring promotional videos, live clips and unreleased footage. A single from the album, \"Step into My Office, Baby\" followed in November 2003; it would be their first single to be taken from an album, and included a track recorded with Divine Comedy producer Darren Allison entitled Love On The March.\n\nThe Thin Lizzy-inspired \"I'm a Cuckoo\" was the second single from the album. It achieved their highest chart position yet, reaching No. 14 in the UK. The Books EP followed, a double A-side single led by \"Wrapped Up in Books\" from Dear Catastrophe Waitress and the new \"Your Cover's Blown\". This EP became the band's third top 20 UK release, and the band was nominated for both the Mercury Music Prize and an Ivor Novello Award. In January 2005, B&S was voted Scotland's greatest band in a poll by The List, beating Simple Minds, Idlewild, Travis, Franz Ferdinand, and The Proclaimers, among others.\n\nIn April 2005, members of the band visited Israel and the Palestinian territories with the UK charity War on Want; the group subsequently recorded a song inspired by the trip titled \"The Eighth Station of the Cross Kebab House\", which would first appear on the digital-download version of the charity album Help!: A Day in the Life and would later have a physical release as a B-side on 2006's \"Funny Little Frog\" single. Push Barman to Open Old Wounds, a compilation of the Jeepster singles and EPs, was released in May 2005 while the band were recording their seventh album in California. The result of the sessions was The Life Pursuit, produced by Tony Hoffer. The album, originally intended to be a double album, became the band's highest-charting album upon its release in February 2006, peaking at No. 8 in the UK and No. 65 on the US Billboard 200. \"Funny Little Frog\", which preceded it, also proved to be their highest-charting single, debuting at No. 13.\n\nOn 6 July 2006, the band played a historic  show with the Los Angeles Philharmonic at the Hollywood Bowl. The opening act at the 18,000 seat sell-out concert was The Shins. The members of the band see this as a landmark event, with Stevie Jackson saying, \"This is the biggest thrill of my entire life\". In October 2006, members of the band helped put together a CD collection of new songs for children titled Colours Are Brighter, with the involvement of major bands such as Franz Ferdinand and The Flaming Lips.\n\nOn 18 November 2008 the band released The BBC Sessions, which features songs from the period of 1996–2001 (including the last recordings featuring Isobel Campbell before she left the band), along with a second disc featuring a recording of a live performance in Belfast from Christmas 2001.\n\nRecent years (2010–present)\n\nOn 17 July 2010, the band performed their first UK gig in almost four years to a crowd of around 30,000 at Latitude Festival in Henham Park, Southwold. They performed two new songs, \"I Didn't See It Coming\" and \"I'm Not Living in the Real World\".\n\nTheir eighth studio album, released in the UK and internationally on 25 September 2010, was titled Belle and Sebastian Write About Love. The first single from the album, as well as the record's title track \"Write About Love\", was released in the US on 7 September 2010. Write About Love entered the UK albums chart in its first week of release, peaking at No. 8 as of 19 October 2010. Norah Jones is featured on the track \"Little Lou, Ugly Jack, Prophet John\"./\n\nIn December 2010 Belle and Sebastian curated the sequel to the Bowlie Weekender in the form of Bowlie 2 presented by All Tomorrow's Parties.\n\nIn 2013, Pitchfork TV released an hour-long documentary in February, directed by RJ Bentler which focused on the band's 1996 album If You're Feeling Sinister, as well as the formation and early releases of the band. The documentary featured interviews with every member that was present on the album, as well as several archival photos and videos from the band's early days. The band compiled a second compilation album The Third Eye Centre which included the b-sides and rarities released after Push Barman to Open Old Wounds, from the albums Dear Catastrophe Waitress, The Life Pursuit, and Write About Love. In an interview at the end of 2013, Mick Cooke confirmed he had left the band on good terms.\n\nThe band received an 'Outstanding Contribution To Music Award' at the NME Awards 2014.\n\nIn 2014, the band returned to the studio, recording in Atlanta, Georgia for their ninth studio album, along with announcing tour dates for various festivals and concerts across the world during 2014. Their ninth album Girls in Peacetime Want to Dance was released on 19 January 2015.[http://www.nme.com/reviews/belle-and-sebastian--2/15877 The Glasgow veterans flit between acoustic indie and disco bangers on their camp and scatterbrained ninth album], nme.com, by Dan Stubbs, 14 January 2015\nThe Belle and Sebastian song \"There's Too Much Love\" forms much of the soundtrack for the Brazilian film The Way He Looks, about a blind, gay teenage boy and his friends, released in 2014.  \n\nBelle and Sebastian performed at the world-famous Glastonbury Festival on Sunday 28 June 2015, on 'The Other Stage' and at O2 Academy, Glasgow in March 2017 which was televised in the U.K. as part of the 'BBC 6 MUSIC Presents Festival'.\n\nIn mid-2017, the band put out a new single, \"We Were Beautiful\". In December 2017, January and February 2018, the band will releases a trio of EPs under the name How to Solve Our Human Problems.\n\nCollaborations and side projects\n\nThe Reindeer Section were a Scottish indie rock supergroup formed in 2001 by Gary Lightbody of Snow Patrol, which released albums and gigged in 2001 and 2002. It featured Richard Colburn, Mick Cooke and Bobby Kildea from Belle and Sebastian.\n\nThe Vaselines are an alternative rock band from Glasgow formed in Glasgow in 1986. Between 2008 and 2014 their lineup featured Stevie Jackson and Bobby Kildea from Belle and Sebastian and they performed at Bowlie Weekender 2 curated by Belle and Sebastian in December 2010.\n\nTired Pony is a country / Americana supergroup formed by Gary Lightbody of Snow Patrol in 2010. It features Richard Colburn from Belle and Sebastian.\n\nGod Help the Girl is a musical project by Stuart Murdoch, featuring a group of female vocalists, including Catherine Ireton, with Belle and Sebastian as the accompanying band.\n\nMembers\n\n;Current\n*Stuart Murdoch – vocals, electric and acoustic guitar and keyboards (1994–present)\n*Stevie Jackson – vocals, electric and acoustic guitar (1996–present)\n*Chris Geddes – keyboards (1996–present)\n*Richard Colburn – drums and percussion (1996–present)\n*Sarah Martin – keyboards, electric and acoustic guitar, violin, flute and vocals (1996–present)\n*Bobby Kildea – guitar and bass (2000–present)\n*Dave McGowan - bass, guitar, and keyboards (2011–present)\n\n;Past\n*Stuart David – bass, guitar and vocals (1994–2000)\n*Mick Cooke – trumpet, guitar and bass (1995–2013)\n*Isobel Campbell – vocals, cello and keyboards (1996–2002)\n\nDiscography\n\n;Studio albums\n*Tigermilk (1996)\n*If You're Feeling Sinister (1996)\n*The Boy with the Arab Strap (1998)\n*Fold Your Hands Child, You Walk Like a Peasant (2000)\n*Storytelling (2002)\n*Dear Catastrophe Waitress (2003)\n*The Life Pursuit (2006)\n*Belle and Sebastian Write About Love (2010)\n*Girls in Peacetime Want to Dance (2015)\n\nSee also\n\n*List of bands from Glasgow. Belle and Sebastian. http://en.wikipedia.org/?curid=4267."
  }
}
