{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6237",
  "eid" : "da9188e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778446446,
  "textBody" : "Christmas is an annual festival commemorating the birth of Jesus Christ,[http://www.merriam-webster.com/dictionary/christmas Christmas], Merriam-Webster. Retrieved 2008-10-06.[https://www.webcitation.org/5kwKlFgsB?urlhttp://encarta.msn.com/encnet/refpages/RefArticle.aspx?refid\n761556859 Archived] 2009-10-31.Martindale, Cyril Charles.[http://www.newadvent.org/cathen/03724b.htm \"Christmas\"]. The Catholic Encyclopedia. Vol. 3. New York: Robert Appleton Company, 1908. observed primarily on December 25 Several branches of Eastern Christianity that use the Julian calendar also celebrate on December 25 according to that calendar, which is now January 7 on the Gregorian calendar. Armenian Churches observed the nativity on January 6 even before the Gregorian calendar originated. Most Armenian Christians use the Gregorian calendar, still celebrating Christmas Day on January 6. Some Armenian churches use the Julian calendar, thus celebrating Christmas Day on January 19 on the Gregorian calendar, with January 18 being Christmas Eve. as a religious and cultural celebration among billions of people around the world. A feast central to the Christian liturgical year, it is preceded by the season of Advent or the Nativity Fast and initiates the season of Christmastide, which historically in the West lasts twelve days and culminates on Twelfth Night; in some traditions, Christmastide includes an octave. Christmas Day is a public holiday in many of the world's nations,[http://www.pch.gc.ca/pgm/ceem-cced/jfa-ha/index-eng.cfm Canadian Heritage – Public holidays] – Government of Canada. Retrieved November 27, 2009.[http://www.opm.gov/Operating_Status_Schedules/fedhol/2009.asp 2009 Federal Holidays] – U.S. Office of Personnel Management. Retrieved November 27, 2009.[http://www.direct.gov.uk/en/Governmentcitizensandrights/LivingintheUK/DG_073741 Bank holidays and British Summer time] – HM Government. Retrieved November 27, 2009. is celebrated religiously by a majority of Christians, as well as culturally by many non-Christians,Nick Hytrek, [http://www.siouxcityjournal.com/lifestyles/leisure/article_9914761e-ce50-11de-98cf-001cc4c03286.html \"Non-Christians focus on secular side of Christmas\"], Sioux City Journal, November 10, 2009. Retrieved November 18, 2009. and forms an integral part of the holiday season centered around it.\n\nThe traditional Christmas narrative, the Nativity of Jesus, delineated in the New Testament says that Jesus was born in Bethlehem, in accordance with messianic prophecies. When Joseph and Mary arrived in the city, the inn had no room and so they were offered a stable where the Christ Child was soon born, with angels proclaiming this news to shepherds who then further disseminated the information.\n\nAlthough the month and date of Jesus' birth are unknown, by the early-to-mid fourth century the Western Christian Church had placed Christmas on December 25,Corinna Laughlin, Michael R. Prendergast, Robert C. Rabe, Corinna Laughlin, Jill Maria Murdy, Therese Brown, Mary Patricia Storms, Ann E. Degenhard, Jill Maria Murdy, Ann E. Degenhard, Therese Brown, Robert C. Rabe, Mary Patricia Storms, Michael R. Prendergast, [https://books.google.com/books/about/Sourcebook_for_Sundays_Seasons_and_Weekd.html?idkQWbWCXMGQgC Sourcebook for Sundays, Seasons, and Weekdays 2011: The Almanac for Pastoral Liturgy], LiturgyTrainingPublications, 2010, p. 29. a date that was later adopted in the East.[http://www.tertullian.org/fathers/chronography_of_354_12_depositions_martyrs.htm \"The Chronography of 354 AD. Part 12: Commemorations of the Martyrs\"], The Tertullian Project. 2006. Retrieved November 24, 2011.Roll, Susan K., [https://books.google.com/books?id\n6MXPEMbpjoAC&pgPA133&lpg\nPA133&dq&redir_esc\ny#vonepage&q&f\nfalse Toward the Origins of Christmas], (Peeters Publishers, 1995), p. 133. Today, most Christians celebrate on December 25 in the Gregorian calendar, which has been adopted almost universally in the civil calendars used in countries throughout the world. However, some Eastern Christian Churches celebrate Christmas on December 25 of the older Julian calendar, which currently corresponds to January 7 in the Gregorian calendar, the day after the Western Christian Church celebrates the Epiphany. This is not a disagreement over the date of Christmas as such, but rather a preference of which calendar should be used to determine the day that is December 25. Moreover, for Christians, the belief that God came into the world in the form of man to atone for the sins of humanity, rather than the exact birth date, is considered to be the primary purpose in celebrating Christmas.\n\nThe celebratory customs associated in various countries with Christmas have a mix of pre-Christian, Christian, and secular themes and origins. Popular modern customs of the holiday include gift giving, completing an Advent calendar or Advent wreath, Christmas music and caroling, lighting a Christingle, viewing a Nativity play, an exchange of Christmas cards, church services, a special meal, and the display of various Christmas decorations, including Christmas trees, Christmas lights, nativity scenes, garlands, wreaths, mistletoe, and holly. In addition, several closely related and often interchangeable figures, known as Santa Claus, Father Christmas, Saint Nicholas, and Christkind, are associated with bringing gifts to children during the Christmas season and have their own body of traditions and lore.[http://www.msnbc.msn.com/id/16329025 \"Poll: In a changing nation, Santa endures\"], Associated Press, December 22, 2006. Retrieved November 18, 2009. Because gift-giving and many other aspects of the Christmas festival involve heightened economic activity, the holiday has become a significant event and a key sales period for retailers and businesses. The economic impact of Christmas has grown steadily over the past few centuries in many regions of the world.\n\nEtymology \n\n\"Christmas\" is a shortened form of \"Christ's mass\". It is derived from the Middle English Cristemasse, which is from Old English Crīstesmæsse, a phrase first recorded in 1038 followed by the word Cristes-messe in 1131.Cyril Charles Martindale, [http://www.newadvent.org/cathen/03724b.htm \"Christmas\"], in The Catholic Encyclopedia. Vol. 3, New York: Robert Appleton Company, 1908 (accessed December 21, 2012). Crīst (genitive Crīstes) is from Greek Khrīstos (Χριστός), a translation of Hebrew Māšîaḥ (מָשִׁיחַ), \"Messiah\", meaning \"anointed\"; and mæsse is from Latin missa, the celebration of the Eucharist.\n\nThe form Christenmas was also historically used, but is now considered archaic and dialectal;Christenmas, n., Oxford English Dictionary. Retrieved December 12. it derives from Middle English Cristenmasse, literally \"Christian mass\".\"Christmas\" in the [http://quod.lib.umich.edu/cgi/m/mec/med-idx?type\nid&idMED10371 Middle English Dictionary.] Xmas is an abbreviation of Christmas found particularly in print, based on the initial letter chi (Χ) in Greek Khrīstos (Χριστός), \"Christ\", though numerous style guides discourage its use;Griffiths, Emma, [http://news.bbc.co.uk/2/hi/uk_news/magazine/4097755.stm \"Why get cross about Xmas?\"], BBC, December 22, 2004. Retrieved December 12, 2011. it has precedent in Middle English Χρ̄es masse (where \"Χρ̄\" is an abbreviation for Χριστός).\n\nOther names \n\nIn addition to \"Christmas\", the holiday has been known by various other names throughout its history. The Anglo-Saxons referred to the feast as \"midwinter\",Hutton, Ronald, [https://books.google.com/books?id\nH3PvQ5bqoBkC&pgPT21&dq\n#vonepage&q&f\nfalse The Stations of the Sun: A History of the Ritual Year], Oxford University Press, 2001.\"Midwinter\" in [http://bosworth.ff.cuni.cz/022849 Bosworth & Toller.] or, more rarely, as Nātiuiteð (from Latin nātīvitās below).Serjeantson, Mary Sidney, [https://books.google.com/books?id\nHZaxAAAAIAAJ&q%22natiuited%22&dq\n%22natiuited%22&hlen&oi\nbook_result&ctresult&resnum\n2 A History of Foreign Words in English] \"Nativity\", meaning \"birth\", is from Latin nātīvitās. In Old English, Gēola (Yule) referred to the period corresponding to December and January, which was eventually equated with Christian Christmas.[http://www.etymonline.com/index.php?allowed_in_frame0&search\nyule&searchmodenone Yule], Online Etymology Dictionary. Retrieved December 12. \"Noel\" (or \"Nowel\") entered English in the late 14th century and is from the Old French noël or naël, itself ultimately from the Latin nātālis (diēs) meaning \"birth (day)\".[http://www.etymonline.com/index.php?allowed_in_frame\n0&searchnoel&searchmode\nnone Noel] Online Etymology Dictionary. Retrieved December 12.\n\nNativity \n\nThe canonical gospels of Luke and Matthew both describe Jesus as being born in Bethlehem in Judea, to a virgin mother. In the Gospel of Luke account, Joseph and Mary travel from Nazareth to Bethlehem for the census, and Jesus is born there and laid in a manger.[http://www.britannica.com/EBchecked/topic/64496/biblical-literature \"Biblical literature\"], Encyclopædia Britannica, 2011. Web. January 22, 2011. It says that angels proclaimed him a savior for all people, and shepherds came to adore him.\n\nIn the Matthew account, magi follow a star to Bethlehem to bring gifts to Jesus, born the king of the Jews. King Herod orders the massacre of all the boys less than two years old in Bethlehem, but the family flees to Egypt and later settles in Nazareth.\n\nHistory \n\nThe Nativity stories of Matthew and Luke are prominent in the gospels and early Christian writers suggested various dates for the anniversary. The first recorded Christmas celebration was in Rome in 336. Christmas played a role in the Arian controversy of the fourth century. In the early Middle Ages, it was overshadowed by Epiphany. The feast regained prominence after 800, when Charlemagne was crowned emperor on Christmas Day.\n\nAssociating it with drunkenness and other misbehavior, the Puritans banned Christmas in the 17th century. It was restored as a legal holiday in 1660, but remained disreputable. In the early 19th century, Christmas was revived with the start of the Oxford Movement in the Anglican Church.\n\nCharles Dickens and other writers reinvented the holiday by emphasizing Christmas as a time for family, religion, gift-giving, and social reconciliation as opposed to the revelry that had been common historically.\n\nChoice of December 25 date \n\nIn the 3rd century, the date of birth of Jesus was the subject of both great interest and great uncertainty. Around AD 200, Clement of Alexandria wrote:\n\nIn other writing of this time, May 20, April 18 or 19, March 25, January 2, November 17, and November 20 are all suggested. Various factors contributed to the selection of December 25 as a date of celebration: it was the date of the winter solstice on the Roman calendar; it was about nine months after March 25, the date of the vernal equinox and a date linked to the conception of Jesus.\n\nSolstice date \n\nDecember 25 was the date of the winter solstice on the Roman calendar.Bradt, Hale, Astronomy Methods, (2004), p. 69.Roll, p. 87.\"[http://www.cs.utk.edu/~mclennan/BA/SF/WinSol.html Bruma] \", Seasonal Festivals of the Greeks and RomansPliny the Elder, Natural History, [http://www.perseus.tufts.edu/cgi-bin/ptext?docPerseus:text:1999.02.0137&query\nhead%3D%231117 18:59] Jesus chose to be born on the shortest day of the year for symbolic reasons, according to an early Christmas sermon by Augustine: \"Hence it is that He was born on the day which is the shortest in our earthly reckoning and from which subsequent days begin to increase in length. He, therefore, who bent low and lifted us up chose the shortest day, yet the one whence light begins to increase.\"Augustine, [http://www.dec25th.info/Augustine's%20Sermon%20192.html Sermon 192].\n\nLinking Jesus to the Sun was supported by various Biblical passages. Jesus was considered to be the \"Sun of righteousness\" prophesied by Malachi: \"Unto you shall the sun of righteousness arise, and healing is in his wings.\". John describes Jesus as \"the light of the world.\".\n\nSuch solar symbolism could support more than one date of birth. An anonymous work known as De Pascha Computus (243) linked the idea that creation began at the spring equinox, on March 25, with the conception or birth (the word nascor can mean either) of Jesus on March 28, the day of the creation of the sun in the Genesis account. One translation reads: \"O the splendid and divine providence of the Lord, that on that day, the very day, on which the sun was made, March 28, a Wednesday, Christ should be born.\n\nIn the 17th century, Isaac Newton argued that the date of Christmas was selected to correspond with the solstice.Newton, Isaac, [http://www.gutenberg.org/files/16878/16878-h/16878-h.htm Observations on the Prophecies of Daniel, and the Apocalypse of St. John] (1733). Ch. XI. A sun connection is possible because Christians considered Jesus to be the \"Sun of righteousness\" prophesied in Malachi 4:2: \"But for you who fear my name, the sun of righteousness shall rise with healing in its wings. You shall go out leaping like calves from the stall.\"\n\nAccording to Steven Hijmans of the University of Alberta, \"It is cosmic symbolism ... which inspired the Church leadership in Rome to elect the southern solstice, December 25, as the birthday of Christ, and the northern solstice as that of John the Baptist, supplemented by the equinoxes as their respective dates of conception.\"Hijmans, S.E., [https://www.scribd.com/doc/33490806/Hijmans-Sol-The-Sun-in-the-Art-and-Religions-of-Rome Sol, the sun in the art and religions of Rome], 2009, p. 595.  \n\nCalculation hypothesis \n\nThe Calculation hypothesis suggests that an earlier holiday held on March 25 became associated with the Incarnation.Bradshaw, Paul F., [https://books.google.com/books/about/The_New_SCM_Dictionary_of_Liturgy_and_Wo.html?id\nZrVDmaXP6HEC&redir_escy \"Christmas\"], The New SCM Dictionary of Liturgy of Worship, Hymns Ancient and Modern Ltd., 2002. Modern scholars refer to this feast as the Quartodecimal. Christmas was then calculated as nine months later. The Calculation hypothesis was proposed by French writer Louis Duchesne in 1889.Roll, pp. 88–90.Duchesne, Louis, Les Origines du Culte Chrétien, Paris, 1902, 262 ff. In modern times, March 25 is celebrated as Annunciation. This holiday was created in the seventh century and was assigned to a date that is nine months before Christmas, in addition to being the traditional date of the equinox. It is unrelated to the Quartodecimal, which had been forgotten by this time.\"Annunciation, New Catholic Encyclopedia 2nd edition, 2003, Catholic University of America Press.\n\nEarly Christians celebrated the life of Jesus on a date considered equivalent to 14 Nisan (Passover) on the local calendar. Because Passover was held on the 14th of the month, this feast is referred to as the Quartodecimal. All the major events of Christ's life, especially the passion, were celebrated on this date. In his letter to the Corinthians, Paul mentions Passover, presumably celebrated according to the local calendar in Corinth.: \"Our paschal lamb, Christ, has been sacrificed. Therefore let us celebrate the festival…\"Tally, pp. 2–4. Tertullian (d. 220), who lived in Latin-speaking North Africa, gives the date of passion celebration as March 25.Roll, p. 87. The date of the passion was moved to Good Friday in 165 when Pope Soter created Easter by reassigning the Resurrection to a Sunday. According to the Calculation hypothesis, celebration of the quartodecimal continued in some areas and the feast became associated with Incarnation.\n\nThe Calculation hypothesis is considered academically to be \"a thoroughly viable hypothesis\", though not certain.Roll (1995), p. 88 It was a traditional Jewish belief that great men lived a whole number of years, without fractions, so that Jesus was considered to have been conceived on March 25, as he died on March 25, which was calculated to have coincided with 14 Nisan. A passage in Commentary on the Prophet Daniel (204) by Hippolytus of Rome identifies December 25 as the date of the nativity. This passage is generally considered a late interpellation. But the manuscript includes another passage, one that is more likely to be authentic, that gives the passion as March 25.[http://www.chronicon.net/chroniconfiles/Hippolytus%20and%20December%2025th.pdf Hippolytus and December 25th as the date of Jesus' birth], Roll (1995), p. 87.\n\nIn 221, Sextus Julius Africanus (c. 160 – c. 240) gave March 25 as the day of creation and of the conception of Jesus in his universal history. This conclusion was based on solar symbolism, with March 25 the date of the equinox. As this implies a birth in December, it is sometimes claimed to be the earliest identification of December 25 as the nativity. However, Africanus was not such an influential writer that it is likely he determined the date of Christmas. Online here [http://www.baylor.edu/content/services/document.php/159111.pdf].\n\nThe tractate De solstitia et aequinoctia conceptionis et nativitatis Domini nostri Iesu Christi et Iohannis Baptistae, falsely attributed to John Chrysostom, also argued that Jesus was conceived and crucified on the same day of the year and calculated this as March 25. This anonymous tract also states: \"But Our Lord, too, is born in the month of December ... the eight before the calends of January [25 December] ..., But they call it the 'Birthday of the Unconquered'. Who indeed is so unconquered as Our Lord...? Or, if they say that it is the birthday of the Sun, He is the Sun of Justice.\"\n\nHistory of religions hypothesis \n\nThe rival \"History of Religions\" hypothesis suggests that the Church selected December 25 date to appropriate festivities held by the Romans in honor of the Sun god Sol Invictus. This feast was established by Aurelian in 274. An explicit expression of this theory appears in an annotation of uncertain date added to a manuscript of a work by 12th-century Syrian bishop Jacob Bar-Salibi. The scribe who added it wrote: \n\"It was a custom of the Pagans to celebrate on the same 25 December the birthday of the Sun, at which they kindled lights in token of festivity. In these solemnities and revelries the Christians also took part. Accordingly when the doctors of the Church perceived that the Christians had a leaning to this festival, they took counsel and resolved that the true Nativity should be solemnised on that day.\" (cited in Christianity and Paganism in the Fourth to Eighth Centuries, Ramsay MacMullen. Yale:1997, p. 155).\n\nIn 1743, German Protestant Paul Ernst Jablonski argued Christmas was placed on December 25 to correspond with the Roman solar holiday Dies Natalis Solis Invicti and was therefore a \"paganization\" that debased the true church.\"[http://encarta.msn.com/encyclopedia_761556859_1____4/christmas.html#s4 Christmas]\", Encarta. [https://www.webcitation.org/5kwR1OTxS?url\nhttp://encarta.msn.com/encyclopedia_761556859_1____4/christmas.html Archived] 2009-10-31. It has been argued that, on the contrary, the Emperor Aurelian, who in 274 instituted the holiday of the Dies Natalis Solis Invicti, did so partly as an attempt to give a pagan significance to a date already important for Christians in Rome.\n\nHermann UsenerHermann Usener, Das Weihnachtsfest. In: Religionsgeschichtliche Untersuchungen, part 1. Second edition. Verlag von Max Cohen & Sohn, Bonn 1911.  (Note that the first edition, 1889, doesn't have the discussion of Natalis Solis Invicti); also Sol Invictus (1905). and others proposed that the Christians chose this day because it was the Roman feast celebrating the birthday of Sol Invictus. Modern scholar S. E. Hijmans, however, states that \"While they were aware that pagans called this day the 'birthday' of Sol Invictus, this did not concern them and it did not play any role in their choice of date for Christmas.\" Moreover, Thomas J. Talley holds that the Roman Emperor Aurelian placed a festival of Sol Invictus on December 25 in order to compete with the growing rate of the Christian Church, which had already been celebrating Christmas on that date first. In the judgement of the Church of England Liturgical Commission, the History of Religions hypothesis has been challenged\"Although this view is still very common, it has been seriously challenged\" – Church of England Liturgical Commission, The Promise of His Glory: Services and Prayers for the Season from All Saints to Candlemas (Church House Publishing 1991 ) quoted in [http://www.oremus.org/liturgy/etc/ktf/intro.html#xmas \"The Date of Christmas and Epiphany\"]. by a view based on an old tradition, according to which the date of Christmas was fixed at nine months after March 25, the date of the vernal equinox, on which the Annunciation was celebrated.Oxford Dictionary of the Christian Church (Oxford University Press, 2005, ), article \"Christmas\".\n\nWith regard to a December religious feast of the deified Sun (Sol), as distinct from a solstice feast of the birth (or rebirth) of the astronomical sun, one scholar has commented that, \"while the winter solstice on or around December 25 was well established in the Roman imperial calendar, there is no evidence that a religious celebration of Sol on that day antedated the celebration of Christmas\". \"Thomas Talley has shown that, although the Emperor Aurelian's dedication of a temple to the sun god in the Campus Martius (C.E. 274) probably took place on the 'Birthday of the Invincible Sun' on December 25, the cult of the sun in pagan Rome ironically did not celebrate the winter solstice nor any of the other quarter-tense days, as one might expect.\"Michael Alan Anderson, Symbols of Saints: Theology, ritual, and kinship in music for John the Baptist and St. Anne (1175–1563) The University of Chicago, UMI / ProQuest Dissertations Publishing, Ann Arbor 2008, pp. 42–46, . The Oxford Companion to Christian Thought remarks on the uncertainty about the order of precedence between the religious celebrations of the Birthday of the Unconquered Sun and of the birthday of Jesus, stating that the hypothesis that December 25 was chosen for celebrating the birth of Jesus on the basis of the belief that his conception occurred on March 25 \"potentially establishes 25 December as a Christian festival before Aurelian's decree, which, when promulgated, might have provided for the Christian feast both opportunity and challenge\".\n\nIntroduction of feast \n\nAs Christmas was unknown to the early Christian writers, it must have been introduced sometime after 300. Irenaeus and Tertullian omit it from their lists of feasts. In 245, Origen of Alexandria, writing about , commented that Scripture mentions only sinners as celebrating their birthdays, namely Pharaoh, who then had his chief baker hanged (), and Herod, who then had John the Baptist beheaded (), and mentions saints as cursing the day of their birth, namely Jeremiah () and Job ().Origen, Leviticus, Homily VIII, Migne P.G., XII, 495; partially quoted in \"[http://www.newadvent.org/cathen/10709a.htm Natal Day]\", The Catholic Encyclopedia, 1911. In 303, Arnobius still ridiculed the idea of celebrating the birthdays of gods, a passage cited as evidence that Arnobius was unaware of any nativity celebration.McCracken, George, Arnobius of Sicca, the Case Against the Pagans, Vol. 2, p. 83. \"Therefore if this is a fact, how can Jupiter be god if it is agreed that god is everlasting, while the other is represented by you to have a birthday, and frightened by the new experience, to have squalled like an infant.\"G. Brunner, \"Arnobius eine Zeuge gegen das Weihnachtsfest? \" JLW 13 (1936), pp. 178–181. But since Christmas does not celebrate Christ's birth \"as God\" but \"as man\", this does not necessarily show that Christmas was not a feast at this time.\n\nThe earliest known Christmas celebration is recorded in a fourth-century manuscript compiled in Rome.\"Christmas and its cycle\", New Catholic Encyclopedia, 2nd edition, 2002, Catholic University of America Press. Vol. 3, pp. 550–557. This manuscript is thought to record a celebration that occurred in 336. It was prepared privately for Furius Dionysius Filocalus, a Roman aristocrat, in 354. The reference in question states, \"VIII kal. ian. natus Christus in Betleem Iudeæ\"[https://www.ccel.org/ccel/pearse/morefathers/files/chronography_of_354_12_depositions_martyrs.htm \"The Chronography of 354 AD. Part 12: Commemorations of the Martyrs.].\" MGH Chronica Minora I (1892), pp.71–72. See the first entry. translated as \"8 Kalends January Birth of Christ in Bethlehem, Judea.\" This reference is in a section of the manuscript that was copied from earlier source material. The document also contains the earliest known reference to the feast of Sol Invictus.[http://www.tertullian.org/fathers/chronography_of_354_06_calendar.htm \"The Chronography of 354 AD. Part 6: the calendar of Philocalus\"]. Inscriptiones Latinae Antiquissimae, Berlin (1893), pp. 256–278. The fact the Donatists of North Africa celebrated Christmas suggests that the feast was established by the time that church was created in 311. \n\nIn Eastern Christianity the birth of Jesus was celebrated in connection with the Epiphany on January 6, which however emphasized celebration of the baptism of Jesus. Christmas was promoted in the Christian East as part of the revival of Nicene Christianity following the death of the pro-Arian Emperor Valens at the Battle of Adrianople in 378. The feast was introduced at Constantinople in 379, in Antioch by John Chrysostom towards the end of the fourth century, probably in 388, and in Alexandria only in the following century. The feast disappeared after Gregory of Nazianzus resigned as bishop in 381, although it was reintroduced by John Chrysostom in about 400. Even in the West, January 6 celebration of the nativity of Jesus seems to have continued until after 380.\n\nRelation to concurrent celebrations \n\nMany popular customs associated with Christmas developed independently of the commemoration of Jesus' birth, with certain elements having origins in pre-Christian festivals that were celebrated around the winter solstice by pagan populations who were later converted to Christianity. These elements, including the Yule log from Yule and gift giving from Saturnalia, – Ball State University. Swartz Jr., BK. Archived version. Retrieved October 19, 2011. became syncretized into Christmas over the centuries. The prevailing atmosphere of Christmas has also continually evolved since the holiday's inception, ranging from a sometimes raucous, drunken, carnival-like state in the Middle Ages,Murray, Alexander, [http://www.historytoday.com/alexander-murray/medieval-christmas \"Medieval Christmas\"], History Today, December 1986, 36 (12), pp. 31 – 39. to a tamer family-oriented and children-centered theme introduced in a 19th-century transformation. In fact, the celebration of Christmas was banned on more than one occasion within certain Protestant groups, such as the Puritans, due to concerns that it was too pagan or unbiblical.Durston, Chris, [http://www.historytoday.com/dt_main_allatonce.asp?gid\n12890&aid&tgid\n&amid12890&g12890\nx&g9130x&g30026\nx&g20991x&g21010\nx&g19965x&g19963\nx \"Lords of Misrule: The Puritan War on Christmas 1642–60\"] , History Today, December 1985, 35 (12) pp. 7 – 14. Jehovah's Witnesses also reject the celebration of Christmas.\n\nPrior to and through the early Christian centuries, winter festivals—especially those centered on the winter solstice—were the most popular of the year in many European pagan cultures. Reasons included the fact that less agricultural work needed to be done during the winter, as well as an expectation of better weather as spring approached.[http://www.history.com/minisites/christmas/viewPage?pageId\n1252 \"Christmas – An Ancient Holiday\"] , The History Channel, 2007. Many modern Christmas customs have been directly influenced by such festivals, including:\n* Gift-giving and merrymaking from the Roman Saturnalia,\n* Greenery, lights, and charity from the Roman New Year, and\n* Yule logs and various foods from Germanic feasts.Coffman, Elesha. [http://www.christianitytoday.com/history/newsletter/2000/dec08.html \"Why December 25?\"] Christian History & Biography, Christianity Today, 2000.\n\nThe Egyptian deity Horus, son to goddess Isis, was celebrated at the winter solstice. Horus was often depicted being fed by his mother, which also influenced the symbolism of the Virgin Mary with baby Christ.\n\nThe pre-Christian Germanic peoples—including the Anglo-Saxons and the Norse—celebrated a winter festival called Yule, held in the late December to early January period, yielding modern English yule, today used as a synonym for Christmas.Simek (2007:379). In Germanic language-speaking areas, numerous elements of modern Christmas folk custom and iconography stem from Yule, including the Yule log, Yule boar, and the Yule goat. Often leading a ghostly procession through the sky (the Wild Hunt), the long-bearded god Odin is referred to as \"the Yule one\" and \"Yule father\" in Old Norse texts, while other gods are referred to as \"Yule beings\".Simek (2010:180, 379–380).\n\nIn eastern Europe also, old pagan traditions were incorporated into Christmas celebrations, an example being the Koleda, which was incorporated into the Christmas carol.\n\nMiddle Ages \n\nIn the Early Middle Ages, Christmas Day was overshadowed by Epiphany, which in western Christianity focused on the visit of the magi. But the medieval calendar was dominated by Christmas-related holidays. The forty days before Christmas became the \"forty days of St. Martin\" (which began on November 11, the feast of St. Martin of Tours), now known as Advent. In Italy, former Saturnalian traditions were attached to Advent. Around the 12th century, these traditions transferred again to the Twelve Days of Christmas (December 25 – January 5); a time that appears in the liturgical calendars as Christmastide or Twelve Holy Days.\n\nThe prominence of Christmas Day increased gradually after Charlemagne was crowned Emperor on Christmas Day in 800. King Edmund the Martyr was anointed on Christmas in 855 and King William I of England was crowned on Christmas Day 1066.\n\nBy the High Middle Ages, the holiday had become so prominent that chroniclers routinely noted where various magnates celebrated Christmas. King Richard II of England hosted a Christmas feast in 1377 at which twenty-eight oxen and three hundred sheep were eaten. The Yule boar was a common feature of medieval Christmas feasts. Caroling also became popular, and was originally a group of dancers who sang. The group was composed of a lead singer and a ring of dancers that provided the chorus. Various writers of the time condemned caroling as lewd, indicating that the unruly traditions of Saturnalia and Yule may have continued in this form. \"Misrule\"—drunkenness, promiscuity, gambling—was also an important aspect of the festival. In England, gifts were exchanged on New Year's Day, and there was special Christmas ale.\n\nChristmas during the Middle Ages was a public festival that incorporated ivy, holly, and other evergreens. Christmas gift-giving during the Middle Ages was usually between people with legal relationships, such as tenant and landlord.McGreevy, Patrick. \"Place in the American Christmas,\" ([https://www.jstor.org/stable/215896 JSTOR]), Geographical Review, Vol. 80, No. 1. January 1990, pp. 32–42. Retrieved September 10, 2007. The annual indulgence in eating, dancing, singing, sporting, and card playing escalated in England, and by the 17th century the Christmas season featured lavish dinners, elaborate masques, and pageants. In 1607, King James I insisted that a play be acted on Christmas night and that the court indulge in games. It was during the Reformation in 16th–17th-century Europe that many Protestants changed the gift bringer to the Christ Child or Christkindl, and the date of giving gifts changed from December 6 to Christmas Eve.\n\nReformation to the 18th century \n\nFollowing the Protestant Reformation, many of the new denominations, including the Anglican Church and Lutheran Church, continued to celebrate Christmas. In 1629, the Anglican poet John Milton penned On the Morning of Christ's Nativity, a poem that has since been read by many during Christmastide. Donald Heinz, a professor at California State University, states that Martin Luther \"inaugurated a period in which Germany would produce a unique culture of Christmas, much copied in North America.\" Among the congregations of the Dutch Reformed Church, Christmas was celebrated as one of the principal evangelical feasts.\n\nHowever, in 17th century England, some groups such as the Puritans, strongly condemned the celebration of Christmas, considering it a Catholic invention and the \"trappings of popery\" or the \"rags of the Beast\". In contrast, the established Anglican Church \"pressed for a more elaborate observance of feasts, penitential seasons, and saints' days. The calendar reform became a major point of tension between the Anglican party and the Puritan party.\" The Catholic Church also responded, promoting the festival in a more religiously oriented form. King Charles I of England directed his noblemen and gentry to return to their landed estates in midwinter to keep up their old-style Christmas generosity. Following the Parliamentarian victory over Charles I during the English Civil War, England's Puritan rulers banned Christmas in 1647.\n\nProtests followed as pro-Christmas rioting broke out in several cities and for weeks Canterbury was controlled by the rioters, who decorated doorways with holly and shouted royalist slogans. The book, The Vindication of Christmas (London, 1652), argued against the Puritans, and makes note of Old English Christmas traditions, dinner, roast apples on the fire, card playing, dances with \"plow-boys\" and \"maidservants\", old Father Christmas and carol singing.\n\nThe Restoration of King Charles II in 1660 ended the ban, but many Calvinist clergymen still disapproved of Christmas celebration. As such, in Scotland, the Presbyterian Church of Scotland discouraged the observance of Christmas, and though James VI commanded its celebration in 1618, attendance at church was scant.Chambers, Robert (1885). Domestic Annals of Scotland, p. 211. The Parliament of Scotland officially abolished the observance of Christmas in 1640, claiming that the church had been \"purged of all superstitious observation of days\". It was not until 1958 that Christmas again became a Scottish public holiday.\n\nFollowing the Restoration of Charles II, Poor Robin's Almanack contained the lines: \"Now thanks to God for Charles return, / Whose absence made old Christmas mourn. / For then we scarcely did it know, / Whether it Christmas were or no.\" The diary of James Woodforde, from the latter half of the 18th century, details the observance of Christmas and celebrations associated with the season over a number of years.\n\nIn Colonial America, the Pilgrims of New England shared radical Protestant disapproval of Christmas. The Plymouth Pilgrims put their loathing for the day into practice in 1620 when they spent their first Christmas Day in the New World working – thus demonstrating their complete contempt for the day. Non-Puritans in New England deplored the loss of the holidays enjoyed by the laboring classes in England. Christmas observance was outlawed in Boston in 1659. The ban by the Puritans was revoked in 1681 by English governor Edmund Andros, however it was not until the mid-19th century that celebrating Christmas became fashionable in the Boston region.\n\nAt the same time, Christian residents of Virginia and New York observed the holiday freely. Pennsylvania German Settlers, pre-eminently the Moravian settlers of Bethlehem, Nazareth and Lititz in Pennsylvania and the Wachovia Settlements in North Carolina, were enthusiastic celebrators of Christmas. The Moravians in Bethlehem had the first Christmas trees in America as well as the first Nativity Scenes. Christmas fell out of favor in the United States after the American Revolution, when it was considered an English custom.\nGeorge Washington attacked Hessian (German) mercenaries on the day after Christmas during the Battle of Trenton on December 26, 1776, Christmas being much more popular in Germany than in America at this time.\n\nWith the atheistic Cult of Reason in power during the era of Revolutionary France, Christian Christmas religious services were banned and the three kings cake was renamed the \"equality cake\" under anticlerical government policies.\n\n19th century \n\nIn the UK, Christmas Day became a bank holiday in 1834, Boxing Day was added in 1871.\n\nIn the early-19th century, writers imagined Tudor Christmas as a time of heartfelt celebration. In 1843, Charles Dickens wrote the novel A Christmas Carol that helped revive the \"spirit\" of Christmas and seasonal merriment. Its instant popularity played a major role in portraying Christmas as a holiday emphasizing family, goodwill, and compassion.Rowell, Geoffrey, \"Dickens and the Construction of Christmas\", History Today, Volume: 43 Issue: 12, December 1993, pp. 17–24.\n\nDickens sought to construct Christmas as a family-centered festival of generosity, linking \"worship and feasting, within a context of social reconciliation.\" Superimposing his humanitarian vision of the holiday, in what has been termed \"Carol Philosophy\", Dickens influenced many aspects of Christmas that are celebrated today in Western culture, such as family gatherings, seasonal food and drink, dancing, games, and a festive generosity of spirit. A prominent phrase from the tale, \"Merry Christmas\", was popularized following the appearance of the story.Cochrane, Robertson. Wordplay: origins, meanings, and usage of the English language. University of Toronto Press, 1996, p. 126, . This coincided with the appearance of the Oxford Movement and the growth of Anglo-Catholicism, which led a revival in traditional rituals and religious observances.Hutton, Ronald, The Stations of the Sun: The Ritual Year in England. 1996. Oxford: Oxford University Press, p. 113. .\n\nThe term Scrooge became a synonym for miser, with \"Bah! Humbug!\" dismissive of the festive spirit.Joe L. Wheeler. Christmas in My Heart, Volume 10, p. 97. Review and Herald Pub Assoc, 2001. . In 1843, the first commercial Christmas card was produced by Sir Henry Cole. The revival of the Christmas Carol began with William Sandys's \"Christmas Carols Ancient and Modern\" (1833), with the first appearance in print of \"The First Noel\", \"I Saw Three Ships\", \"Hark the Herald Angels Sing\" and \"God Rest Ye Merry, Gentlemen\", popularized in Dickens' A Christmas Carol.\n\nIn Britain, the Christmas tree was introduced in the early 19th century following the personal union with the Kingdom of Hanover by Charlotte of Mecklenburg-Strelitz, wife of King George III. In 1832, the future Queen Victoria wrote about her delight at having a Christmas tree, hung with lights, ornaments, and presents placed round it.The Girlhood of Queen Victoria: a selection from Her Majesty's diaries, p. 61. Longmans, Green & Co., 1912. University of Wisconsin. After her marriage to her German cousin Prince Albert, by 1841 the custom became more widespread throughout Britain.\n\nAn image of the British royal family with their Christmas tree at Windsor Castle created a sensation when it was published in the Illustrated London News in 1848. A modified version of this image was published in the United States in 1850.Godey's Lady's Book, 1850. Godey's copied it exactly, except he removed the Queen's tiara, and Prince Albert's moustache, to remake the engraving into an American scene. By the 1870s, putting up a Christmas tree had become common in America.\n\nIn America, interest in Christmas had been revived in the 1820s by several short stories by Washington Irving which appear in his The Sketch Book of Geoffrey Crayon, Gent. and \"Old Christmas\". Irving's stories depicted harmonious warm-hearted English Christmas festivities he experienced while staying in Aston Hall, Birmingham, England, that had largely been abandoned,Kelly, Richard Michael (ed.) (2003), A Christmas Carol, p. 20. Broadview Literary Texts, New York: Broadview Press, . and he used the tract Vindication of Christmas (1652) of Old English Christmas traditions, that he had transcribed into his journal as a format for his stories.\n\nIn 1822, Clement Clarke Moore wrote the poem A Visit From St. Nicholas (popularly known by its first line: Twas the Night Before Christmas).Moore's poem transferred the genuine old Dutch traditions celebrated at New Year in New York, including the exchange of gifts, family feasting, and tales of \"sinterklass\" (a derivation in Dutch from \"Saint Nicholas\", from whence comes the modern \"Santa Claus\") to Christmas.[http://www.thehistoryofchristmas.com/ch/in_america.htm The history of Christmas: Christmas history in America], 2006.\nThe poem helped popularize the tradition of exchanging gifts, and seasonal Christmas shopping began to assume economic importance.[http://usinfo.state.gov/scv/Archive/2005/Dec/19-344398.html \"Americans Celebrate Christmas in Diverse Ways\"] , Usinfo.state.gov, November 26, 2006.\nThis also started the cultural conflict between the holiday's spiritual significance and its associated commercialism that some see as corrupting the holiday. In her 1850 book The First Christmas in New England, Harriet Beecher Stowe includes a character who complains that the true meaning of Christmas was lost in a shopping spree.First Presbyterian Church of Watertown [http://www.watertownfirstpres.org/sermons/12-11-05.html \"Oh ... and one more thing\"] December 11, 2005\n \n\nWhile the celebration of Christmas was not yet customary in some regions in the U.S., Henry Wadsworth Longfellow detected \"a transition state about Christmas here in New England\" in 1856. \"The old puritan feeling prevents it from being a cheerful, hearty holiday; though every year makes it more so.\"Restad, Penne L. (1995), Christmas in America: a History, Oxford: Oxford University Press, p. 96. .\nIn Reading, Pennsylvania, a newspaper remarked in 1861, \"Even our presbyterian friends who have hitherto steadfastly ignored Christmas—threw open their church doors and assembled in force to celebrate the anniversary of the Savior's birth.\"\n\nThe First Congregational Church of Rockford, Illinois, \"although of genuine Puritan stock\", was 'preparing for a grand Christmas jubilee', a news correspondent reported in 1864. By 1860, fourteen states including several from New England had adopted Christmas as a legal holiday. In 1875, Louis Prang introduced the Christmas card to Americans. He has been called the \"father of the American Christmas card\".Meggs, Philip B. A History of Graphic Design. 1998 John Wiley & Sons, Inc. p 148 . On June 28, 1870, Christmas was formally declared a United States federal holiday.\n\n20th century \n\nUp to the 1950s, in the UK, many Christmas customs were restricted to the upper classes and better-off families. The mass of the population had not adopted many of the Christmas rituals that later became general. The Christmas tree was rare. Christmas dinner might be beef—certainly not turkey. In their stockings children might get an apple, orange and sweets. Full celebration of a family Christmas with all the trimmings only became widespread with increased prosperity from the 1950s. National papers were published on Christmas Day until 1912. Post was still delivered on Christmas Day until 1961. League football matches continued in Scotland until the 1970s while in England they ceased at the end of the 1950s.\n\nUnder the state atheism of the Soviet Union, after its foundation in 1917, Christmas celebrations—along with other Christian holidays—were prohibited in public. During the 1920s, 30s and 40s, the League of Militant Atheists encouraged school pupils to campaign against Christmas traditions, such as the Christmas tree, as well as other Christian holidays, including Easter; the League established an antireligious holiday to be the 31st of each month as a replacement. At the height of this persecution, in 1929, on Christmas Day, children in Moscow were encouraged to spit on crucifixes as a protest against the holiday. It was not until the dissolution of the Soviet Union in 1991 that the persecution ended and Orthodox Christmas became a state holiday again for the first time in Russia after seven decades.\n\nEuropean History Professor Joseph Perry wrote that likewise, in Nazi Germany, \"because Nazi ideologues saw organized religion as an enemy of the totalitarian state, propagandists sought to deemphasize—or eliminate altogether—the Christian aspects of the holiday\" and that \"Propagandists tirelessly promoted numerous Nazified Christmas songs, which replaced Christian themes with the regime's racial ideologies.\"\n\nAs Christmas celebrations began to be held around the world even outside traditional Christian cultures in the 20th century, some Muslim-majority countries have banned the practice of Christmas, claiming it undermines Islam.\n\nCustoms and traditions \n\nChristmas Day is celebrated as a major festival and public holiday in countries around the world, including many whose populations are mostly non-Christian. In some non-Christian areas, periods of former colonial rule introduced the celebration (e.g. Hong Kong); in others, Christian minorities or foreign cultural influences have led populations to observe the holiday. Countries such as Japan, where Christmas is popular despite there being only a small number of Christians, have adopted many of the secular aspects of Christmas, such as gift-giving, decorations, and Christmas trees.\n\nCountries in which Christmas is not a formal public holiday include Afghanistan, Algeria, Azerbaijan, Bahrain, Bhutan, Cambodia, China (excepting Hong Kong and Macau), the Comoros, Iran, Israel, Japan, Kuwait, Laos, Libya, the Maldives, Mauritania, Mongolia, Morocco, North Korea, Oman, Pakistan, Qatar, the Sahrawi Republic, Saudi Arabia, Somalia, Tajikistan, Thailand, Tunisia, Turkey, Turkmenistan, the United Arab Emirates, Uzbekistan, Vietnam, and Yemen. Christmas celebrations around the world can vary markedly in form, reflecting differing cultural and national traditions.\n\nAmong countries with a strong Christian tradition, a variety of Christmas celebrations have developed that incorporate regional and local cultures. For Christians, participating in a religious service plays an important part in the recognition of the season. Christmas, along with Easter, is the period of highest annual church attendance. A 2010 survey by LifeWay Christian Resources found that 47% of American households attend church services during this time. In the United Kingdom, the Church of England reported an estimated attendance of  people at Christmas services in 2015.\n\nIn Catholic countries, people hold religious processions or parades in the days preceding Christmas. In other countries, secular processions or parades featuring Santa Claus and other seasonal figures are often held. Family reunions and the exchange of gifts are a widespread feature of the season. Gift-giving takes place on Christmas Day in most countries. Others practice gift giving on Saint Nicholas Day, and January 6, Epiphany.\n\nDecorations \n\nThe practice of putting up special decorations at Christmas has a long history. In the 15th century, it was recorded that in London it was the custom at Christmas for every house and all the parish churches to be \"decked with holm, ivy, bays, and whatsoever the season of the year afforded to be green\".Miles, Clement A, Christmas customs and traditions, Courier Dover Publications, 1976, , p. 272. The heart-shaped leaves of ivy were said to symbolize the coming to earth of Jesus, while holly was seen as protection against pagans and witches, its thorns and red berries held to represent the Crown of Thorns worn by Jesus at the crucifixion and the blood he shed.Heller, Ruth, Christmas: Its Carols, Customs & Legends, Alfred Publishing (1985), , p. 12.\n\nNativity scenes are known from 10th-century Rome. They were popularised by Saint Francis of Assisi from 1223, quickly spreading across Europe.Collins, Ace, Stories Behind the Great Traditions of Christmas, Zondervan, (2003),  p.47. Different types of decorations developed across the Christian world, dependent on local tradition and available resources, and can vary from simple representations of the crib to far more elaborate sets – renowned manger scene traditions include the colourful Kraków szopka in Poland,[https://books.google.com/books?id\ndArLWAbKEe8C&pgPA159 Google Books] Susan Topp Weber, Nativities of the World, Gibbs Smith, 2013 which imitate Kraków's historical buildings as settings, the elaborate Italian presepi (Neapolitan, Genoese and Bolognese),Bershad, David; Carolina Mangone, [https://books.google.com/books?id\nllTiET5oCR4C&pgPA112&dq\nneapolitan+nativity+scene&hlen The Christian Travelers Guide to Italy], Zondervan, 2001. or the Provençal crèches in southern France, using hand-painted terracotta figurines called santons. In certain parts of the world, notably Sicily, living nativity scenes following the tradition of Saint Francis are a popular alternative to static crèches.Seaburg, Carl, [https://books.google.com/books?id\ndLB-UkN5UHYC&pgPT30&dq\nliving+nativity+scenes+sicily&hlen Celebrating Christmas: An Anthology], iUniverse, 2003.Bowler, Gerry, [https://books.google.com/books?id\nWGaVZ6fEjjsC&pgPT478&dq\nliving+nativity+scenes+sicily&hlen The World Encyclopedia of Christmas], Random House LLC, 2012. The first commercially produced decorations appeared in Germany in the 1860s, inspired by paper chains made by children.Collins p. 83. In countries where a representation of the Nativity scene is very popular, people are encouraged to compete and create the most original or realistic ones. Within some families, the pieces used to make the representation are considered a valuable family heirloom.\n\nThe traditional colors of Christmas decorations are red, green, and gold. Red symbolizes the blood of Jesus, which was shed in his crucifixion, while green symbolizes eternal life, and in particular the evergreen tree, which does not lose its leaves in the winter, and gold is the first color associated with Christmas, as one of the three gifts of the Magi, symbolizing royalty.\n\nThe Christmas tree is considered by some as Christianisation of pagan tradition and ritual surrounding the Winter Solstice, which included the use of evergreen boughs, and an adaptation of pagan tree worship; according to eighth-century biographer Æddi Stephanus, Saint Boniface (634–709), who was a missionary in Germany, took an axe to an oak tree dedicated to Thor and pointed out a fir tree, which he stated was a more fitting object of reverence because it pointed to heaven and it had a triangular shape, which he said was symbolic of the Trinity. The English language phrase \"Christmas tree\" is first recorded in 1835Harper, Douglas, [http://www.etymonline.com/index.php?termChrist Christ], Online Etymology Dictionary, 2001. and represents an importation from the German language. The modern Christmas tree tradition is believed to have begun in Germany in the 18th centuryvan Renterghem, Tony. When Santa was a shaman. St. Paul: Llewellyn Publications, 1995. . though many argue that Martin Luther began the tradition in the 16th century.\n\nFrom Germany the custom was introduced to Britain, first via Queen Charlotte, wife of George III, and then more successfully by Prince Albert during the reign of Queen Victoria. By 1841 the Christmas tree had become even more widespread throughout Britain.Lejeune, Marie Claire. Compendium of symbolic and ritual plants in Europe, p.550. University of Michigan . By the 1870s, people in the United States had adopted the custom of putting up a Christmas tree.Shoemaker, Alfred Lewis. (1959) Christmas in Pennsylvania: a folk-cultural study. Edition 40. pp. 52, 53. Stackpole Books 1999. . Christmas trees may be decorated with lights and ornaments.\n\nSince the 16th century, the poinsettia, a native plant from Mexico, has been associated with Christmas. Other popular holiday plants include holly, mistletoe, red amaryllis, and Christmas cactus. Along with a Christmas tree, the interior of a home may be decorated with these plants, along with garlands and evergreen foliage. The display of Christmas villages has also become a tradition in many homes during this season. The outside of houses may be decorated with lights and sometimes with illuminated sleighs, snowmen, and other Christmas figures. Mistletoe features prominently in European myth and folklore (for example the legend of Baldr), it is an evergreen parasitic plant which grows on trees, especially apple and poplar, and turns golden when it is dried. It is customary to hang a sprig of mistletoe in the house at Christmas, and anyone standing underneath it may be kissed. Mistletoe has sticky white berries, one of which was traditionally removed whenever someone was kissed under it. This is probably a fertility ritual. The mistletoe berry juice resembles semen.\n\nOther traditional decorations include bells, candles, candy canes, stockings, wreaths, and angels. Both the displaying of wreaths and candles in each window are a more traditional Christmas display. The concentric assortment of leaves, usually from an evergreen, make up Christmas wreaths and are designed to prepare Christians for the Advent season. Candles in each window are meant to demonstrate the fact that Christians believe that Jesus Christ is the ultimate light of the world.\n\nChristmas lights and banners may be hung along streets, music played from speakers, and Christmas trees placed in prominent places.Murray, Brian. [http://www.historymatters.appstate.edu/documents/christmaslights.pdf \"Christmas lights and community building in America,\"] History Matters, Spring 2006.  It is common in many parts of the world for town squares and consumer shopping areas to sponsor and display decorations. Rolls of brightly colored paper with secular or religious Christmas motifs are manufactured for the purpose of wrapping gifts. In some countries, Christmas decorations are traditionally taken down on Twelfth Night, the evening of January 5.\n\nMusic and carols \n\nThe earliest extant specifically Christmas hymns appear in fourth-century Rome. Latin hymns such as \"Veni redemptor gentium\", written by Ambrose, Archbishop of Milan, were austere statements of the theological doctrine of the Incarnation in opposition to Arianism. \"Corde natus ex Parentis\" (\"Of the Father's love begotten\") by the Spanish poet Prudentius (d. 413) is still sung in some churches today.Miles, Clement, Christmas customs and traditions, Courier Dover Publications, 1976, , p. 32. In the 9th and 10th centuries, the Christmas \"Sequence\" or \"Prose\" was introduced in North European monasteries, developing under Bernard of Clairvaux into a sequence of rhymed stanzas. In the 12th century the Parisian monk Adam of St. Victor began to derive music from popular songs, introducing something closer to the traditional Christmas carol.\n\nBy the 13th century, in France, Germany, and particularly, Italy, under the influence of Francis of Assisi, a strong tradition of popular Christmas songs in the native language developed.Miles, pp. 31–37. Christmas carols in English first appear in a 1426 work of John Awdlay, a Shropshire chaplain, who lists twenty-five \"caroles of Cristemas\", probably sung by groups of wassailers, who went from house to house.Miles, pp. 47–48.\n\nThe songs we know specifically as carols were originally communal folk songs sung during celebrations such as \"harvest tide\" as well as Christmas. It was only later that carols began to be sung in church. Traditionally, carols have often been based on medieval chord patterns, and it is this that gives them their uniquely characteristic musical sound. Some carols like \"Personent hodie\", \"Good King Wenceslas\", and \"The Holly and the Ivy\" can be traced directly back to the Middle Ages. They are among the oldest musical compositions still regularly sung. \"Adeste Fideles\" (O Come all ye faithful) appears in its current form in the mid-18th century, although the words may have originated in the 13th century.\n\nSinging of carols initially suffered a decline in popularity after the Protestant Reformation in northern Europe, although some Reformers, like Martin Luther, wrote carols and encouraged their use in worship. Carols largely survived in rural communities until the revival of interest in popular songs in the 19th century. The 18th-century English reformer Charles Wesley understood the importance of music to worship. In addition to setting many psalms to melodies, which were influential in the Great Awakening in the United States, he wrote texts for at least three Christmas carols. The best known was originally entitled \"Hark! How All the Welkin Rings\", later renamed \"Hark! the Herald Angels Sing\".\n\nFelix Mendelssohn wrote a melody adapted to fit Wesley's words. In Austria in 1818 Mohr and Gruber made a major addition to the genre when they composed \"Silent Night\" for the St. Nicholas Church, Oberndorf. William Sandys' Christmas Carols Ancient and Modern (1833) contained the first appearance in print of many now-classic English carols, and contributed to the mid-Victorian revival of the festival.Richard Michael Kelly. A Christmas Carol, Broadview Press, 2003, p. 10. .\n\nCompletely secular Christmas seasonal songs emerged in the late 18th century. \"Deck the Halls\" dates from 1784, and the American \"Jingle Bells\" was copyrighted in 1857. In the 19th and 20th century, African American spirituals and songs about Christmas, based in their tradition of spirituals, became more widely known. An increasing number of seasonal holidays songs were commercially produced in the 20th century, including jazz and blues variations. In addition, there was a revival of interest in early music, from groups singing folk music, such as The Revels, to performers of early medieval and classical music. John Rutter has composed many carols including \"All Bells in Paradise\", \"Angels' Carol\", \"Candlelight Carol\", \"Donkey Carol\", \"Jesus Child\", \"Shepherds' Pipe Carol\" and \"Star Carol\".\n\nTraditional cuisine \n\nA special Christmas family meal is traditionally an important part of the holiday's celebration, and the food that is served varies greatly from country to country. Some regions, such as Sicily, have special meals for Christmas Eve, when 12 kinds of fish are served. In the United Kingdom and countries influenced by its traditions, a standard Christmas meal includes turkey, goose or other large bird, gravy, potatoes, vegetables, sometimes bread and cider. Special desserts are also prepared, such as Christmas pudding, mince pies, fruit cake and Yule log cake.Broomfield, Andrea (2007), [https://books.google.com/books?idfJ_JDp9OgJEC&pg\nPA149&dqchristmas+pudding+england&hl\nen&oibook_result&ct\nresult&resnum=2 Food and Cooking in Victorian England: A History], Greenwood Publishing Group, 2007, pp. 149–150.Muir, Frank (1977), Christmas customs & traditions, Taplinger Pub. Co., 1977, p. 58.\n\nIn Poland and other parts of eastern Europe and Scandinavia, fish often is used for the traditional main course, but richer meat such as lamb is increasingly served. In Sweden it is common with a special variety of smörgåsbord, where ham, meatballs and herring play a prominent role. In Germany, France, and Austria, goose and pork are favored. Beef, ham, and chicken in various recipes are popular throughout the world. The Maltese traditionally serve Imbuljuta tal-Qastan, a chocolate and chestnuts beverage, after Midnight Mass and throughout the Christmas season. Slovaks prepare the traditional Christmas bread potica, bûche de Noël in France, panettone in Italy, and elaborate tarts and cakes. The eating of sweets and chocolates has become popular worldwide, and sweeter Christmas delicacies include the German stollen, marzipan cake or candy, and Jamaican rum fruit cake. As one of the few fruits traditionally available to northern countries in winter, oranges have been long associated with special Christmas foods. Eggnog is a sweetened dairy-based beverage traditionally made with milk, cream, sugar, and whipped eggs (which gives it a frothy texture). Spirits such as brandy, rum or bourbon are often added. The finished serving is often garnished with a sprinkling of ground cinnamon or nutmeg.\n\nCards \n\nChristmas cards are illustrated messages of greeting exchanged between friends and family members during the weeks preceding Christmas Day. The traditional greeting reads \"wishing you a Merry Christmas and a Happy New Year\", much like that of the first commercial Christmas card, produced by Sir Henry Cole in London in 1843.[http://news.bbc.co.uk/1/hi/england/1679110.stm \"Christmas card sold for record price\"], BBC News. Retrieved October 28, 2011. The custom of sending them has become popular among a wide cross-section of people with the emergence of the modern trend towards exchanging E-cards.\n\nChristmas cards are purchased in considerable quantities, and feature artwork, commercially designed and relevant to the season. The content of the design might relate directly to the Christmas narrative, with depictions of the Nativity of Jesus, or Christian symbols such as the Star of Bethlehem, or a white dove, which can represent both the Holy Spirit and Peace on Earth. Other Christmas cards are more secular and can depict Christmas traditions, mythical figures such as Santa Claus, objects directly associated with Christmas such as candles, holly and baubles, or a variety of images associated with the season, such as Christmastide activities, snow scenes and the wildlife of the northern winter. There are even humorous cards and genres depicting nostalgic scenes of the past such as crinolined shoppers in idealized 19th-century streetscapes.\n\nSome prefer cards with a poem, prayer, or Biblical verse; while others distance themselves from religion with an all-inclusive \"Season's greetings\".\n\nCommemorative stamps \n\nA number of nations have issued commemorative stamps at Christmastide. Postal customers will often use these stamps to mail Christmas cards, and they are popular with philatelists. These stamps are regular postage stamps, unlike Christmas seals, and are valid for postage year-round. They usually go on sale some time between early October and early December, and are printed in considerable quantities.\n\nGift giving \n\nThe exchanging of gifts is one of the core aspects of the modern Christmas celebration, making it the most profitable time of year for retailers and businesses throughout the world. On Christmas, people exchange gifts based on the Christian tradition associated with Saint Nicholas, and the gifts of gold, frankincense, and myrrh which were given to the baby Jesus by the Magi. The practice of gift giving in the Roman celebration of Saturnalia may have influenced Christian Christian customs, but on the other hand the Christian \"core dogma of the Incarnation, however, solidly established the giving and receiving of gifts as the structural principle of that recurrent yet unique event\", because it was the Biblical Magi, \"together with all their fellow men, who received the gift of God through man's renewed participation in the divine life.\"\n\nGift-bearing figures \n\nA number of figures are associated with Christmas and the seasonal giving of gifts. Among these are Father Christmas, also known as Santa Claus (derived from the Dutch for Saint Nicholas), Père Noël, and the Weihnachtsmann; Saint Nicholas or Sinterklaas; the Christkind; Kris Kringle; Joulupukki; tomte/nisse; Babbo Natale; Saint Basil; and Ded Moroz. The Scandinavian tomte (also called nisse) is sometimes depicted as a gnome instead of Santa Claus.\n\nThe best known of these figures today is red-dressed Santa Claus, of diverse origins. The name Santa Claus can be traced back to the Dutch Sinterklaas, which means simply Saint Nicholas. Nicholas was a 4th-century Greek bishop of Myra, a city in the Roman province of Lycia, whose ruins are 3 km from modern Demre in southwest Turkey. Among other saintly attributes, he was noted for the care of children, generosity, and the giving of gifts. His feast day, December 6, came to be celebrated in many countries with the giving of gifts.Forbes, Bruce David, Christmas: a candid history, University of California Press, 2007, , pp. 68–79.\n\nSaint Nicholas traditionally appeared in bishop's attire, accompanied by helpers, inquiring about the behaviour of children during the past year before deciding whether they deserved a gift or not. By the 13th century, Saint Nicholas was well known in the Netherlands, and the practice of gift-giving in his name spread to other parts of central and southern Europe. At the Reformation in 16th–17th-century Europe, many Protestants changed the gift bringer to the Christ Child or Christkindl, corrupted in English to Kris Kringle, and the date of giving gifts changed from December 6 to Christmas Eve.\n\nThe modern popular image of Santa Claus, however, was created in the United States, and in particular in New York. The transformation was accomplished with the aid of notable contributors including Washington Irving and the German-American cartoonist Thomas Nast (1840–1902). Following the American Revolutionary War, some of the inhabitants of New York City sought out symbols of the city's non-English past. New York had originally been established as the Dutch colonial town of New Amsterdam and the Dutch Sinterklaas tradition was reinvented as Saint Nicholas.\n\nIn 1809, the New-York Historical Society convened and retroactively named Sancte Claus the patron saint of Nieuw Amsterdam, the Dutch name for New York City.John Steele Gordon, The Great Game: The Emergence of Wall Street as a World Power: 1653–2000 (Scribner), 1999. At his first American appearance in 1810, Santa Claus was drawn in bishops' robes. However, as new artists took over, Santa Claus developed more secular attire.Forbes, Bruce David, Christmas: A Candid History, pp. 80–81. Nast drew a new image of \"Santa Claus\" annually, beginning in 1863. By the 1880s, Nast's Santa had evolved into the modern vision of the figure, perhaps based on the English figure of Father Christmas. The image was standardized by advertisers in the 1920sMikkelson, Barbara and David P., [http://www.snopes.com/cokelore/santa.asp \"The Claus That Refreshes\"], Snopes.com, 2006. and continues through the present day.\n\nFather Christmas, a jolly, stout, bearded man who typified the spirit of good cheer at Christmas, predates the Santa Claus character. He is first recorded in early 17th century England, but was associated with holiday merrymaking and drunkenness rather than the bringing of gifts. In Victorian Britain, his image was remade to match that of Santa. The French Père Noël evolved along similar lines, eventually adopting the Santa image. In Italy, Babbo Natale acts as Santa Claus, while La Befana is the bringer of gifts and arrives on the eve of the Epiphany. It is said that La Befana set out to bring the baby Jesus gifts, but got lost along the way. Now, she brings gifts to all children. In some cultures Santa Claus is accompanied by Knecht Ruprecht, or Black Peter. In other versions, elves make the toys. His wife is referred to as Mrs. Claus.\n\nThere has been some opposition to the narrative of the American evolution of Saint Nicholas into the modern Santa. It has been claimed that the Saint Nicholas Society was not founded until 1835, almost half a century after the end of the American War of Independence. Moreover, a study of the \"children's books, periodicals and journals\" of New Amsterdam by Charles Jones revealed no references to Saint Nicholas or Sinterklaas. However, not all scholars agree with Jones's findings, which he reiterated in a book-length study in 1978;Jones, Charles W., Saint Nicholas of Myra, Bari, and Manhattan: Biography of a Legend (Chicago: University of Chicago Press, 1978). Howard G. Hageman, of New Brunswick Theological Seminary, maintains that the tradition of celebrating Sinterklaas in New York was alive and well from the early settlement of the Hudson Valley on.\n\nCurrent tradition in several Latin American countries (such as Venezuela and Colombia) holds that while Santa makes the toys, he then gives them to the Baby Jesus, who is the one who actually delivers them to the children's homes, a reconciliation between traditional religious beliefs and the iconography of Santa Claus imported from the United States.\n\nIn South Tyrol (Italy), Austria, Czech Republic, Southern Germany, Hungary, Liechtenstein, Slovakia, and Switzerland, the Christkind (Ježíšek in Czech, Jézuska in Hungarian and Ježiško in Slovak) brings the presents. Greek children get their presents from Saint Basil on New Year's Eve, the eve of that saint's liturgical feast. The German St. Nikolaus is not identical with the Weihnachtsmann (who is the German version of Santa Claus / Father Christmas). St. Nikolaus wears a bishop's dress and still brings small gifts (usually candies, nuts, and fruits) on December 6 and is accompanied by Knecht Ruprecht. Although many parents around the world routinely teach their children about Santa Claus and other gift bringers, some have come to reject this practice, considering it deceptive.Matera, Mariane. [http://www.citybeat.com/archives/1996/issue304/cover1.html \"Santa: The First Great Lie\"], Citybeat, Issue 304.\n\nMultiple gift-giver figures exist in Poland, varying between regions and individual families. St Nicholas (Święty Mikołaj) dominates Central and North-East areas, the Starman (Gwiazdor) is most common in Greater Poland, Baby Jesus (Dzieciątko) is unique to Upper Silesia, with the Little Star (Gwiazdka) and the Little Angel (Aniołek) being common in the South and the South-East. Grandfather Frost (Dziadek Mróz) is less commonly accepted in some areas of Eastern Poland. It is worth noting that across all of Poland, St Nicholas is the gift giver on the Saint Nicholas Day on December 6.\n\nDate according to Julian calendar \n\nSome jurisdictions of the Eastern Orthodox Church, including those of Russia, Georgia, Ukraine, Macedonia, Montenegro, Serbia, and Jerusalem, mark feasts using the older Julian calendar. As of , there is a difference of 13 days between the Julian calendar and the modern Gregorian calendar, which is used internationally for most secular purposes. As a result, December 25 on the Julian calendar currently corresponds to January 7 on the calendar used by most governments and people in everyday life. Therefore, the aforementioned Orthodox Christians mark December 25 (and thus Christmas) on the day that is internationally considered to be January 7.\n\nHowever, other Orthodox Christians, such as those belonging to the jurisdictions of Bulgaria, Greece, Romania, Constantinople, Antioch, Alexandria, Albania, Cyprus, Finland, and the Orthodox Church in America, among others, began using the Revised Julian calendar in the early 20th century, which at present corresponds exactly to the Gregorian calendar. Therefore, these Orthodox Christians mark December 25 (and thus Christmas) on the same day that is internationally considered to be December 25, and which is also the date of Christmas among Western Christians.\n\nA further complication is added by the fact that the Armenian Apostolic Church continues the original ancient Eastern Christian practice of celebrating the birth of Christ not as a separate holiday, but on the same day as the celebration of his baptism (Theophany), which is on January 6. This is a public holiday in Armenia, and it is held on the same day that is internationally considered to be January 6, because the Armenian Church in Armenia uses the Gregorian calendar.\n\nHowever, there is also a small Armenian Patriarchate of Jerusalem, which maintains the traditional Armenian custom of celebrating the birth of Christ on the same day as Theophany (January 6), but uses the Julian calendar for the determination of that date. As a result, this church celebrates \"Christmas\" (more properly called Theophany) on the day that is considered January 19 on the Gregorian calendar in use by the majority of the world.\n\nIn summary, there are four different dates used by different Christian groups to mark the birth of Christ, given in the table below.\n\nListing \n\nEconomy \n\nChristmas is typically a peak selling season for retailers in many nations around the world. Sales increase dramatically as people purchase gifts, decorations, and supplies to celebrate. In the U.S., the \"Christmas shopping season\" starts as early as October.Varga, Melody. [http://retailindustry.about.com/od/abouttheretailindustry/g/black_friday.htm \"Black Friday], About:Retail Industry.  In Canada, merchants begin advertising campaigns just before Halloween (October 31), and step up their marketing following Remembrance Day on November 11. In the UK and Ireland, the Christmas shopping season starts from mid-November, around the time when high street Christmas lights are turned on.[http://www.viewlondon.co.uk/whatson/south-molton-street-christmas-lights-feature-3530.html \"South Molton and Brook Street Christmas Lights\"] (November 16, 2010), View London.co.uk.Kollewe, Julia, (November 29, 2010), [https://www.theguardian.com/business/2010/nov/29/christmas-shopping-spree-starts \"West End spree worth £250m marks start of Christmas shopping season\"], The Guardian. In the United States, it has been calculated that a quarter of all personal spending takes place during the Christmas/holiday shopping season. Figures from the U.S. Census Bureau reveal that expenditure in department stores nationwide rose from $20.8 billion in November 2004 to $31.9 billion in December 2004, an increase of 54 percent. In other sectors, the pre-Christmas increase in spending was even greater, there being a November–December buying surge of 100 percent in bookstores and 170 percent in jewelry stores. In the same year employment in American retail stores rose from 1.6 million to 1.8 million in the two months leading up to Christmas.US Census Bureau. [https://www.census.gov/Press-Release/www/releases/archives/facts_for_features_special_editions/005870.html \"Facts. The Holiday Season\"] December 19, 2005. (accessed November 30, 2009) [http://webarchive.loc.gov/all/20100507013857/http%3A//www%2Ecensus%2Egov/Press%2DRelease/www/releases/archives/facts_for_features_special_editions/005870%2Ehtml Archived copy] at the Library of Congress (May 7, 2010). Industries completely dependent on Christmas include Christmas cards, of which 1.9 billion are sent in the United States each year, and live Christmas Trees, of which 20.8 million were cut in the U.S. in 2002.US Census 2005. In the UK in 2010, up to £8 billion was expected to be spent online at Christmas, approximately a quarter of total retail festive sales.\n\nIn most Western nations, Christmas Day is the least active day of the year for business and commerce; almost all retail, commercial and institutional businesses are closed, and almost all industries cease activity (more than any other day of the year), whether laws require such or not. In England and Wales, the Christmas Day (Trading) Act 2004 prevents all large shops from trading on Christmas Day. Scotland is currently planning similar legislation. Film studios release many high-budget movies during the holiday season, including Christmas films, fantasy movies or high-tone dramas with high production values to hopes of maximizing the chance of nominations for the Academy Awards.\n\nOne economist's analysis calculates that, despite increased overall spending, Christmas is a deadweight loss under orthodox microeconomic theory, because of the effect of gift-giving. This loss is calculated as the difference between what the gift giver spent on the item and what the gift receiver would have paid for the item. It is estimated that in 2001, Christmas resulted in a $4 billion deadweight loss in the U.S. alone.\"The Deadweight Loss of Christmas\", American Economic Review, December 1993, 83 (5).[http://www.economist.com/finance/displayStory.cfm?Story_ID885748 \"Is Santa a deadweight loss?\"] The Economist December 20, 2001. Because of complicating factors, this analysis is sometimes used to discuss possible flaws in current microeconomic theory. Other deadweight losses include the effects of Christmas on the environment and the fact that material gifts are often perceived as white elephants, imposing cost for upkeep and storage and contributing to clutter.Reuters. [http://www.enn.com/today.html?id\n9475 \"Christmas is Damaging the Environment, Report Says\"], December 16, 2005.\n\nControversies \n\nChristmas has at times been the subject of controversy and attacks from various sources. Historically it was prohibited by Puritans when they briefly held power in England during the English Interregnum (1649–1660), and in Colonial America where the Puritans outlawed the celebration of Christmas in 1659.[http://www.time.com/time/specials/packages/article/0,28804,1868506_1868508_1868518,00.html Christmas in the Colonies] Time. Retrieved December 25, 2011. The Parliament of Scotland, which was dominated by Presbyterians, passed a series of acts outlawing the observance of Christmas between 1637 and 1690; Christmas Day did not become a public holiday in Scotland until 1958. Christmas celebrations have also been prohibited by atheist states such as the Soviet Union and more recently majority Muslim states such as Somalia, Tajikistan and Brunei.\n\nModern scholars such as E. P. Sanders, Geza Vermes and Marcus Borg consider both Gospel narratives of the birth of Jesus to be non-historical, arguing that there are contradictions between them.Vermes, Géza (November 2, 2006). The Nativity: History and Legend. Penguin Books Ltd, p. 64. .Sanders, E. P. The Historical Figure of Jesus. Penguin, 1993 (). Sanders discusses both birth narratives in detail, contrasts them, and judges them not historical on pp. 85–88.Borg, Marcus, \"The Meaning of the Birth Stories\" in Marcus Borg, N. T. Wright, The Meaning of Jesus: Two Visions (Harper One, 1999), p. 179: \"I (and most mainline scholars) do not see these stories as historically factual.\" Many biblical scholars view the discussion of historicity as secondary, given that gospels were primarily written as theological documents rather than historical accounts.Wiarda, Timothy, Interpreting Gospel Narratives: Scenes, People, and Theology, Broadman & Holman Publishers, 2010, , pp. 75–78.Brennan R. Hill, Jesus, the Christ: Contemporary Perspectives, 2004, , p. 89.Johnson, Timothy, The Gospel of Luke, 1992 , p. 72.Yoder, Thomas R., Recovering Jesus: the Witness of the New Testament, Neufeld, 2007, , p. 111.\n\nSecularization controversies \n\nSome Christians and organizations such as Pat Robertson's American Center for Law and Justice cite alleged attacks on Christmas (dubbing them a \"war on Christmas\").[http://www.muslimcanadiancongress.org/20051128.html Christmas controversy article] – Muslim Canadian Congress.[http://www.newsmax.com/archives/articles/2004/12/18/145204.shtml \"Jews for Christmas\"]—NewsMax article. Such groups claim that any specific mention of the term \"Christmas\" or its religious aspects is being increasingly censored, avoided, or discouraged by a number of advertisers, retailers, government (prominently schools), and other public and private organizations. One controversy is the occurrence of Christmas trees being renamed Holiday trees. In the U.S. there has been a tendency to replace the greeting Merry Christmas with Happy Holidays, which is considered inclusive at the time of the Jewish celebration of Hanukkah.Feder, Don, [http://www.jewishworldreview.com/cols/feder121300.asp \"In the culture, Christmas morphs into holiday\"], Jewish World Review, December 13, 2000. In the U.S. and Canada, where the use of the term \"Holidays\" is most prevalent, opponents have denounced its usage and avoidance of using the term \"Christmas\" as being politically correct. Groups such as the American Civil Liberties Union have initiated court cases to bar the display of images and other material referring to Christmas from public property, including schools.Gibson, John, The War on Christmas, Sentinel Trade, 2006, pp. 1–6. Such groups argue that government-funded displays of Christmas imagery and traditions violate the First Amendment to the United States Constitution, which prohibits the establishment by Congress of a national religion.Ostling, Richard. \"Have Yourself A Merry Little Lawsuit This Season.\" Buffalo Law Journal January 12, 2005, Vol. 77, Issue 96, pp. 1–4. In 1984, the U.S. Supreme Court ruled in Lynch v. Donnelly that a Christmas display (which included a Nativity scene) owned and displayed by the city of Pawtucket, Rhode Island, did not violate the First Amendment. In November 2009, the federal appeals court in Philadelphia upheld a school district's ban on the singing of Christmas carols. The Supreme Court of the United States declined to hear an appeal.\n\nAmerican Muslim scholar Abdul Malik Mujahid has said that Muslims must treat Christmas with respect, even if they disagree with it.Mujahid, Abdul Malik. \"[https://www.soundvision.com/article/treating-christmas-with-respect Treating Christmas with respect],\" Sound Vision.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Christmas" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6237" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Christmas is an annual festival commemorating the birth of Jesus Christ,[http://www.merriam-webster.com/dictionary/christmas Christmas], Merriam-Webster. Retrieved 2008-10-06.[https://www.webcitation.org/5kwKlFgsB?urlhttp://encarta.msn.com/encnet/refpages/RefArticle.aspx?refid\n761556859 Archived] 2009-10-31.Martindale, Cyril Charles.[http://www.newadvent.org/cathen/03724b.htm \"Christmas\"]. The Catholic Encyclopedia. Vol. 3. New York: Robert Appleton Company, 1908. observed primarily on December 25 Several branches of Eastern Christianity that use the Julian calendar also celebrate on December 25 according to that calendar, which is now January 7 on the Gregorian calendar. Armenian Churches observed the nativity on January 6 even before the Gregorian calendar originated. Most Armenian Christians use the Gregorian calendar, still celebrating Christmas Day on January 6. Some Armenian churches use the Julian calendar, thus celebrating Christmas Day on January 19 on the Gregorian calendar, with January 18 being Christmas Eve. as a religious and cultural celebration among billions of people around the world. A feast central to the Christian liturgical year, it is preceded by the season of Advent or the Nativity Fast and initiates the season of Christmastide, which historically in the West lasts twelve days and culminates on Twelfth Night; in some traditions, Christmastide includes an octave. Christmas Day is a public holiday in many of the world's nations,[http://www.pch.gc.ca/pgm/ceem-cced/jfa-ha/index-eng.cfm Canadian Heritage – Public holidays] – Government of Canada. Retrieved November 27, 2009.[http://www.opm.gov/Operating_Status_Schedules/fedhol/2009.asp 2009 Federal Holidays] – U.S. Office of Personnel Management. Retrieved November 27, 2009.[http://www.direct.gov.uk/en/Governmentcitizensandrights/LivingintheUK/DG_073741 Bank holidays and British Summer time] – HM Government. Retrieved November 27, 2009. is celebrated religiously by a majority of Christians, as well as culturally by many non-Christians,Nick Hytrek, [http://www.siouxcityjournal.com/lifestyles/leisure/article_9914761e-ce50-11de-98cf-001cc4c03286.html \"Non-Christians focus on secular side of Christmas\"], Sioux City Journal, November 10, 2009. Retrieved November 18, 2009. and forms an integral part of the holiday season centered around it.\n\nThe traditional Christmas narrative, the Nativity of Jesus, delineated in the New Testament says that Jesus was born in Bethlehem, in accordance with messianic prophecies. When Joseph and Mary arrived in the city, the inn had no room and so they were offered a stable where the Christ Child was soon born, with angels proclaiming this news to shepherds who then further disseminated the information.\n\nAlthough the month and date of Jesus' birth are unknown, by the early-to-mid fourth century the Western Christian Church had placed Christmas on December 25,Corinna Laughlin, Michael R. Prendergast, Robert C. Rabe, Corinna Laughlin, Jill Maria Murdy, Therese Brown, Mary Patricia Storms, Ann E. Degenhard, Jill Maria Murdy, Ann E. Degenhard, Therese Brown, Robert C. Rabe, Mary Patricia Storms, Michael R. Prendergast, [https://books.google.com/books/about/Sourcebook_for_Sundays_Seasons_and_Weekd.html?idkQWbWCXMGQgC Sourcebook for Sundays, Seasons, and Weekdays 2011: The Almanac for Pastoral Liturgy], LiturgyTrainingPublications, 2010, p. 29. a date that was later adopted in the East.[http://www.tertullian.org/fathers/chronography_of_354_12_depositions_martyrs.htm \"The Chronography of 354 AD. Part 12: Commemorations of the Martyrs\"], The Tertullian Project. 2006. Retrieved November 24, 2011.Roll, Susan K., [https://books.google.com/books?id\n6MXPEMbpjoAC&pgPA133&lpg\nPA133&dq&redir_esc\ny#vonepage&q&f\nfalse Toward the Origins of Christmas], (Peeters Publishers, 1995), p. 133. Today, most Christians celebrate on December 25 in the Gregorian calendar, which has been adopted almost universally in the civil calendars used in countries throughout the world. However, some Eastern Christian Churches celebrate Christmas on December 25 of the older Julian calendar, which currently corresponds to January 7 in the Gregorian calendar, the day after the Western Christian Church celebrates the Epiphany. This is not a disagreement over the date of Christmas as such, but rather a preference of which calendar should be used to determine the day that is December 25. Moreover, for Christians, the belief that God came into the world in the form of man to atone for the sins of humanity, rather than the exact birth date, is considered to be the primary purpose in celebrating Christmas.\n\nThe celebratory customs associated in various countries with Christmas have a mix of pre-Christian, Christian, and secular themes and origins. Popular modern customs of the holiday include gift giving, completing an Advent calendar or Advent wreath, Christmas music and caroling, lighting a Christingle, viewing a Nativity play, an exchange of Christmas cards, church services, a special meal, and the display of various Christmas decorations, including Christmas trees, Christmas lights, nativity scenes, garlands, wreaths, mistletoe, and holly. In addition, several closely related and often interchangeable figures, known as Santa Claus, Father Christmas, Saint Nicholas, and Christkind, are associated with bringing gifts to children during the Christmas season and have their own body of traditions and lore.[http://www.msnbc.msn.com/id/16329025 \"Poll: In a changing nation, Santa endures\"], Associated Press, December 22, 2006. Retrieved November 18, 2009. Because gift-giving and many other aspects of the Christmas festival involve heightened economic activity, the holiday has become a significant event and a key sales period for retailers and businesses. The economic impact of Christmas has grown steadily over the past few centuries in many regions of the world.\n\nEtymology \n\n\"Christmas\" is a shortened form of \"Christ's mass\". It is derived from the Middle English Cristemasse, which is from Old English Crīstesmæsse, a phrase first recorded in 1038 followed by the word Cristes-messe in 1131.Cyril Charles Martindale, [http://www.newadvent.org/cathen/03724b.htm \"Christmas\"], in The Catholic Encyclopedia. Vol. 3, New York: Robert Appleton Company, 1908 (accessed December 21, 2012). Crīst (genitive Crīstes) is from Greek Khrīstos (Χριστός), a translation of Hebrew Māšîaḥ (מָשִׁיחַ), \"Messiah\", meaning \"anointed\"; and mæsse is from Latin missa, the celebration of the Eucharist.\n\nThe form Christenmas was also historically used, but is now considered archaic and dialectal;Christenmas, n., Oxford English Dictionary. Retrieved December 12. it derives from Middle English Cristenmasse, literally \"Christian mass\".\"Christmas\" in the [http://quod.lib.umich.edu/cgi/m/mec/med-idx?type\nid&idMED10371 Middle English Dictionary.] Xmas is an abbreviation of Christmas found particularly in print, based on the initial letter chi (Χ) in Greek Khrīstos (Χριστός), \"Christ\", though numerous style guides discourage its use;Griffiths, Emma, [http://news.bbc.co.uk/2/hi/uk_news/magazine/4097755.stm \"Why get cross about Xmas?\"], BBC, December 22, 2004. Retrieved December 12, 2011. it has precedent in Middle English Χρ̄es masse (where \"Χρ̄\" is an abbreviation for Χριστός).\n\nOther names \n\nIn addition to \"Christmas\", the holiday has been known by various other names throughout its history. The Anglo-Saxons referred to the feast as \"midwinter\",Hutton, Ronald, [https://books.google.com/books?id\nH3PvQ5bqoBkC&pgPT21&dq\n#vonepage&q&f\nfalse The Stations of the Sun: A History of the Ritual Year], Oxford University Press, 2001.\"Midwinter\" in [http://bosworth.ff.cuni.cz/022849 Bosworth & Toller.] or, more rarely, as Nātiuiteð (from Latin nātīvitās below).Serjeantson, Mary Sidney, [https://books.google.com/books?id\nHZaxAAAAIAAJ&q%22natiuited%22&dq\n%22natiuited%22&hlen&oi\nbook_result&ctresult&resnum\n2 A History of Foreign Words in English] \"Nativity\", meaning \"birth\", is from Latin nātīvitās. In Old English, Gēola (Yule) referred to the period corresponding to December and January, which was eventually equated with Christian Christmas.[http://www.etymonline.com/index.php?allowed_in_frame0&search\nyule&searchmodenone Yule], Online Etymology Dictionary. Retrieved December 12. \"Noel\" (or \"Nowel\") entered English in the late 14th century and is from the Old French noël or naël, itself ultimately from the Latin nātālis (diēs) meaning \"birth (day)\".[http://www.etymonline.com/index.php?allowed_in_frame\n0&searchnoel&searchmode\nnone Noel] Online Etymology Dictionary. Retrieved December 12.\n\nNativity \n\nThe canonical gospels of Luke and Matthew both describe Jesus as being born in Bethlehem in Judea, to a virgin mother. In the Gospel of Luke account, Joseph and Mary travel from Nazareth to Bethlehem for the census, and Jesus is born there and laid in a manger.[http://www.britannica.com/EBchecked/topic/64496/biblical-literature \"Biblical literature\"], Encyclopædia Britannica, 2011. Web. January 22, 2011. It says that angels proclaimed him a savior for all people, and shepherds came to adore him.\n\nIn the Matthew account, magi follow a star to Bethlehem to bring gifts to Jesus, born the king of the Jews. King Herod orders the massacre of all the boys less than two years old in Bethlehem, but the family flees to Egypt and later settles in Nazareth.\n\nHistory \n\nThe Nativity stories of Matthew and Luke are prominent in the gospels and early Christian writers suggested various dates for the anniversary. The first recorded Christmas celebration was in Rome in 336. Christmas played a role in the Arian controversy of the fourth century. In the early Middle Ages, it was overshadowed by Epiphany. The feast regained prominence after 800, when Charlemagne was crowned emperor on Christmas Day.\n\nAssociating it with drunkenness and other misbehavior, the Puritans banned Christmas in the 17th century. It was restored as a legal holiday in 1660, but remained disreputable. In the early 19th century, Christmas was revived with the start of the Oxford Movement in the Anglican Church.\n\nCharles Dickens and other writers reinvented the holiday by emphasizing Christmas as a time for family, religion, gift-giving, and social reconciliation as opposed to the revelry that had been common historically.\n\nChoice of December 25 date \n\nIn the 3rd century, the date of birth of Jesus was the subject of both great interest and great uncertainty. Around AD 200, Clement of Alexandria wrote:\n\nIn other writing of this time, May 20, April 18 or 19, March 25, January 2, November 17, and November 20 are all suggested. Various factors contributed to the selection of December 25 as a date of celebration: it was the date of the winter solstice on the Roman calendar; it was about nine months after March 25, the date of the vernal equinox and a date linked to the conception of Jesus.\n\nSolstice date \n\nDecember 25 was the date of the winter solstice on the Roman calendar.Bradt, Hale, Astronomy Methods, (2004), p. 69.Roll, p. 87.\"[http://www.cs.utk.edu/~mclennan/BA/SF/WinSol.html Bruma] \", Seasonal Festivals of the Greeks and RomansPliny the Elder, Natural History, [http://www.perseus.tufts.edu/cgi-bin/ptext?docPerseus:text:1999.02.0137&query\nhead%3D%231117 18:59] Jesus chose to be born on the shortest day of the year for symbolic reasons, according to an early Christmas sermon by Augustine: \"Hence it is that He was born on the day which is the shortest in our earthly reckoning and from which subsequent days begin to increase in length. He, therefore, who bent low and lifted us up chose the shortest day, yet the one whence light begins to increase.\"Augustine, [http://www.dec25th.info/Augustine's%20Sermon%20192.html Sermon 192].\n\nLinking Jesus to the Sun was supported by various Biblical passages. Jesus was considered to be the \"Sun of righteousness\" prophesied by Malachi: \"Unto you shall the sun of righteousness arise, and healing is in his wings.\". John describes Jesus as \"the light of the world.\".\n\nSuch solar symbolism could support more than one date of birth. An anonymous work known as De Pascha Computus (243) linked the idea that creation began at the spring equinox, on March 25, with the conception or birth (the word nascor can mean either) of Jesus on March 28, the day of the creation of the sun in the Genesis account. One translation reads: \"O the splendid and divine providence of the Lord, that on that day, the very day, on which the sun was made, March 28, a Wednesday, Christ should be born.\n\nIn the 17th century, Isaac Newton argued that the date of Christmas was selected to correspond with the solstice.Newton, Isaac, [http://www.gutenberg.org/files/16878/16878-h/16878-h.htm Observations on the Prophecies of Daniel, and the Apocalypse of St. John] (1733). Ch. XI. A sun connection is possible because Christians considered Jesus to be the \"Sun of righteousness\" prophesied in Malachi 4:2: \"But for you who fear my name, the sun of righteousness shall rise with healing in its wings. You shall go out leaping like calves from the stall.\"\n\nAccording to Steven Hijmans of the University of Alberta, \"It is cosmic symbolism ... which inspired the Church leadership in Rome to elect the southern solstice, December 25, as the birthday of Christ, and the northern solstice as that of John the Baptist, supplemented by the equinoxes as their respective dates of conception.\"Hijmans, S.E., [https://www.scribd.com/doc/33490806/Hijmans-Sol-The-Sun-in-the-Art-and-Religions-of-Rome Sol, the sun in the art and religions of Rome], 2009, p. 595.  \n\nCalculation hypothesis \n\nThe Calculation hypothesis suggests that an earlier holiday held on March 25 became associated with the Incarnation.Bradshaw, Paul F., [https://books.google.com/books/about/The_New_SCM_Dictionary_of_Liturgy_and_Wo.html?id\nZrVDmaXP6HEC&redir_escy \"Christmas\"], The New SCM Dictionary of Liturgy of Worship, Hymns Ancient and Modern Ltd., 2002. Modern scholars refer to this feast as the Quartodecimal. Christmas was then calculated as nine months later. The Calculation hypothesis was proposed by French writer Louis Duchesne in 1889.Roll, pp. 88–90.Duchesne, Louis, Les Origines du Culte Chrétien, Paris, 1902, 262 ff. In modern times, March 25 is celebrated as Annunciation. This holiday was created in the seventh century and was assigned to a date that is nine months before Christmas, in addition to being the traditional date of the equinox. It is unrelated to the Quartodecimal, which had been forgotten by this time.\"Annunciation, New Catholic Encyclopedia 2nd edition, 2003, Catholic University of America Press.\n\nEarly Christians celebrated the life of Jesus on a date considered equivalent to 14 Nisan (Passover) on the local calendar. Because Passover was held on the 14th of the month, this feast is referred to as the Quartodecimal. All the major events of Christ's life, especially the passion, were celebrated on this date. In his letter to the Corinthians, Paul mentions Passover, presumably celebrated according to the local calendar in Corinth.: \"Our paschal lamb, Christ, has been sacrificed. Therefore let us celebrate the festival…\"Tally, pp. 2–4. Tertullian (d. 220), who lived in Latin-speaking North Africa, gives the date of passion celebration as March 25.Roll, p. 87. The date of the passion was moved to Good Friday in 165 when Pope Soter created Easter by reassigning the Resurrection to a Sunday. According to the Calculation hypothesis, celebration of the quartodecimal continued in some areas and the feast became associated with Incarnation.\n\nThe Calculation hypothesis is considered academically to be \"a thoroughly viable hypothesis\", though not certain.Roll (1995), p. 88 It was a traditional Jewish belief that great men lived a whole number of years, without fractions, so that Jesus was considered to have been conceived on March 25, as he died on March 25, which was calculated to have coincided with 14 Nisan. A passage in Commentary on the Prophet Daniel (204) by Hippolytus of Rome identifies December 25 as the date of the nativity. This passage is generally considered a late interpellation. But the manuscript includes another passage, one that is more likely to be authentic, that gives the passion as March 25.[http://www.chronicon.net/chroniconfiles/Hippolytus%20and%20December%2025th.pdf Hippolytus and December 25th as the date of Jesus' birth], Roll (1995), p. 87.\n\nIn 221, Sextus Julius Africanus (c. 160 – c. 240) gave March 25 as the day of creation and of the conception of Jesus in his universal history. This conclusion was based on solar symbolism, with March 25 the date of the equinox. As this implies a birth in December, it is sometimes claimed to be the earliest identification of December 25 as the nativity. However, Africanus was not such an influential writer that it is likely he determined the date of Christmas. Online here [http://www.baylor.edu/content/services/document.php/159111.pdf].\n\nThe tractate De solstitia et aequinoctia conceptionis et nativitatis Domini nostri Iesu Christi et Iohannis Baptistae, falsely attributed to John Chrysostom, also argued that Jesus was conceived and crucified on the same day of the year and calculated this as March 25. This anonymous tract also states: \"But Our Lord, too, is born in the month of December ... the eight before the calends of January [25 December] ..., But they call it the 'Birthday of the Unconquered'. Who indeed is so unconquered as Our Lord...? Or, if they say that it is the birthday of the Sun, He is the Sun of Justice.\"\n\nHistory of religions hypothesis \n\nThe rival \"History of Religions\" hypothesis suggests that the Church selected December 25 date to appropriate festivities held by the Romans in honor of the Sun god Sol Invictus. This feast was established by Aurelian in 274. An explicit expression of this theory appears in an annotation of uncertain date added to a manuscript of a work by 12th-century Syrian bishop Jacob Bar-Salibi. The scribe who added it wrote: \n\"It was a custom of the Pagans to celebrate on the same 25 December the birthday of the Sun, at which they kindled lights in token of festivity. In these solemnities and revelries the Christians also took part. Accordingly when the doctors of the Church perceived that the Christians had a leaning to this festival, they took counsel and resolved that the true Nativity should be solemnised on that day.\" (cited in Christianity and Paganism in the Fourth to Eighth Centuries, Ramsay MacMullen. Yale:1997, p. 155).\n\nIn 1743, German Protestant Paul Ernst Jablonski argued Christmas was placed on December 25 to correspond with the Roman solar holiday Dies Natalis Solis Invicti and was therefore a \"paganization\" that debased the true church.\"[http://encarta.msn.com/encyclopedia_761556859_1____4/christmas.html#s4 Christmas]\", Encarta. [https://www.webcitation.org/5kwR1OTxS?url\nhttp://encarta.msn.com/encyclopedia_761556859_1____4/christmas.html Archived] 2009-10-31. It has been argued that, on the contrary, the Emperor Aurelian, who in 274 instituted the holiday of the Dies Natalis Solis Invicti, did so partly as an attempt to give a pagan significance to a date already important for Christians in Rome.\n\nHermann UsenerHermann Usener, Das Weihnachtsfest. In: Religionsgeschichtliche Untersuchungen, part 1. Second edition. Verlag von Max Cohen & Sohn, Bonn 1911.  (Note that the first edition, 1889, doesn't have the discussion of Natalis Solis Invicti); also Sol Invictus (1905). and others proposed that the Christians chose this day because it was the Roman feast celebrating the birthday of Sol Invictus. Modern scholar S. E. Hijmans, however, states that \"While they were aware that pagans called this day the 'birthday' of Sol Invictus, this did not concern them and it did not play any role in their choice of date for Christmas.\" Moreover, Thomas J. Talley holds that the Roman Emperor Aurelian placed a festival of Sol Invictus on December 25 in order to compete with the growing rate of the Christian Church, which had already been celebrating Christmas on that date first. In the judgement of the Church of England Liturgical Commission, the History of Religions hypothesis has been challenged\"Although this view is still very common, it has been seriously challenged\" – Church of England Liturgical Commission, The Promise of His Glory: Services and Prayers for the Season from All Saints to Candlemas (Church House Publishing 1991 ) quoted in [http://www.oremus.org/liturgy/etc/ktf/intro.html#xmas \"The Date of Christmas and Epiphany\"]. by a view based on an old tradition, according to which the date of Christmas was fixed at nine months after March 25, the date of the vernal equinox, on which the Annunciation was celebrated.Oxford Dictionary of the Christian Church (Oxford University Press, 2005, ), article \"Christmas\".\n\nWith regard to a December religious feast of the deified Sun (Sol), as distinct from a solstice feast of the birth (or rebirth) of the astronomical sun, one scholar has commented that, \"while the winter solstice on or around December 25 was well established in the Roman imperial calendar, there is no evidence that a religious celebration of Sol on that day antedated the celebration of Christmas\". \"Thomas Talley has shown that, although the Emperor Aurelian's dedication of a temple to the sun god in the Campus Martius (C.E. 274) probably took place on the 'Birthday of the Invincible Sun' on December 25, the cult of the sun in pagan Rome ironically did not celebrate the winter solstice nor any of the other quarter-tense days, as one might expect.\"Michael Alan Anderson, Symbols of Saints: Theology, ritual, and kinship in music for John the Baptist and St. Anne (1175–1563) The University of Chicago, UMI / ProQuest Dissertations Publishing, Ann Arbor 2008, pp. 42–46, . The Oxford Companion to Christian Thought remarks on the uncertainty about the order of precedence between the religious celebrations of the Birthday of the Unconquered Sun and of the birthday of Jesus, stating that the hypothesis that December 25 was chosen for celebrating the birth of Jesus on the basis of the belief that his conception occurred on March 25 \"potentially establishes 25 December as a Christian festival before Aurelian's decree, which, when promulgated, might have provided for the Christian feast both opportunity and challenge\".\n\nIntroduction of feast \n\nAs Christmas was unknown to the early Christian writers, it must have been introduced sometime after 300. Irenaeus and Tertullian omit it from their lists of feasts. In 245, Origen of Alexandria, writing about , commented that Scripture mentions only sinners as celebrating their birthdays, namely Pharaoh, who then had his chief baker hanged (), and Herod, who then had John the Baptist beheaded (), and mentions saints as cursing the day of their birth, namely Jeremiah () and Job ().Origen, Leviticus, Homily VIII, Migne P.G., XII, 495; partially quoted in \"[http://www.newadvent.org/cathen/10709a.htm Natal Day]\", The Catholic Encyclopedia, 1911. In 303, Arnobius still ridiculed the idea of celebrating the birthdays of gods, a passage cited as evidence that Arnobius was unaware of any nativity celebration.McCracken, George, Arnobius of Sicca, the Case Against the Pagans, Vol. 2, p. 83. \"Therefore if this is a fact, how can Jupiter be god if it is agreed that god is everlasting, while the other is represented by you to have a birthday, and frightened by the new experience, to have squalled like an infant.\"G. Brunner, \"Arnobius eine Zeuge gegen das Weihnachtsfest? \" JLW 13 (1936), pp. 178–181. But since Christmas does not celebrate Christ's birth \"as God\" but \"as man\", this does not necessarily show that Christmas was not a feast at this time.\n\nThe earliest known Christmas celebration is recorded in a fourth-century manuscript compiled in Rome.\"Christmas and its cycle\", New Catholic Encyclopedia, 2nd edition, 2002, Catholic University of America Press. Vol. 3, pp. 550–557. This manuscript is thought to record a celebration that occurred in 336. It was prepared privately for Furius Dionysius Filocalus, a Roman aristocrat, in 354. The reference in question states, \"VIII kal. ian. natus Christus in Betleem Iudeæ\"[https://www.ccel.org/ccel/pearse/morefathers/files/chronography_of_354_12_depositions_martyrs.htm \"The Chronography of 354 AD. Part 12: Commemorations of the Martyrs.].\" MGH Chronica Minora I (1892), pp.71–72. See the first entry. translated as \"8 Kalends January Birth of Christ in Bethlehem, Judea.\" This reference is in a section of the manuscript that was copied from earlier source material. The document also contains the earliest known reference to the feast of Sol Invictus.[http://www.tertullian.org/fathers/chronography_of_354_06_calendar.htm \"The Chronography of 354 AD. Part 6: the calendar of Philocalus\"]. Inscriptiones Latinae Antiquissimae, Berlin (1893), pp. 256–278. The fact the Donatists of North Africa celebrated Christmas suggests that the feast was established by the time that church was created in 311. \n\nIn Eastern Christianity the birth of Jesus was celebrated in connection with the Epiphany on January 6, which however emphasized celebration of the baptism of Jesus. Christmas was promoted in the Christian East as part of the revival of Nicene Christianity following the death of the pro-Arian Emperor Valens at the Battle of Adrianople in 378. The feast was introduced at Constantinople in 379, in Antioch by John Chrysostom towards the end of the fourth century, probably in 388, and in Alexandria only in the following century. The feast disappeared after Gregory of Nazianzus resigned as bishop in 381, although it was reintroduced by John Chrysostom in about 400. Even in the West, January 6 celebration of the nativity of Jesus seems to have continued until after 380.\n\nRelation to concurrent celebrations \n\nMany popular customs associated with Christmas developed independently of the commemoration of Jesus' birth, with certain elements having origins in pre-Christian festivals that were celebrated around the winter solstice by pagan populations who were later converted to Christianity. These elements, including the Yule log from Yule and gift giving from Saturnalia, – Ball State University. Swartz Jr., BK. Archived version. Retrieved October 19, 2011. became syncretized into Christmas over the centuries. The prevailing atmosphere of Christmas has also continually evolved since the holiday's inception, ranging from a sometimes raucous, drunken, carnival-like state in the Middle Ages,Murray, Alexander, [http://www.historytoday.com/alexander-murray/medieval-christmas \"Medieval Christmas\"], History Today, December 1986, 36 (12), pp. 31 – 39. to a tamer family-oriented and children-centered theme introduced in a 19th-century transformation. In fact, the celebration of Christmas was banned on more than one occasion within certain Protestant groups, such as the Puritans, due to concerns that it was too pagan or unbiblical.Durston, Chris, [http://www.historytoday.com/dt_main_allatonce.asp?gid\n12890&aid&tgid\n&amid12890&g12890\nx&g9130x&g30026\nx&g20991x&g21010\nx&g19965x&g19963\nx \"Lords of Misrule: The Puritan War on Christmas 1642–60\"] , History Today, December 1985, 35 (12) pp. 7 – 14. Jehovah's Witnesses also reject the celebration of Christmas.\n\nPrior to and through the early Christian centuries, winter festivals—especially those centered on the winter solstice—were the most popular of the year in many European pagan cultures. Reasons included the fact that less agricultural work needed to be done during the winter, as well as an expectation of better weather as spring approached.[http://www.history.com/minisites/christmas/viewPage?pageId\n1252 \"Christmas – An Ancient Holiday\"] , The History Channel, 2007. Many modern Christmas customs have been directly influenced by such festivals, including:\n* Gift-giving and merrymaking from the Roman Saturnalia,\n* Greenery, lights, and charity from the Roman New Year, and\n* Yule logs and various foods from Germanic feasts.Coffman, Elesha. [http://www.christianitytoday.com/history/newsletter/2000/dec08.html \"Why December 25?\"] Christian History & Biography, Christianity Today, 2000.\n\nThe Egyptian deity Horus, son to goddess Isis, was celebrated at the winter solstice. Horus was often depicted being fed by his mother, which also influenced the symbolism of the Virgin Mary with baby Christ.\n\nThe pre-Christian Germanic peoples—including the Anglo-Saxons and the Norse—celebrated a winter festival called Yule, held in the late December to early January period, yielding modern English yule, today used as a synonym for Christmas.Simek (2007:379). In Germanic language-speaking areas, numerous elements of modern Christmas folk custom and iconography stem from Yule, including the Yule log, Yule boar, and the Yule goat. Often leading a ghostly procession through the sky (the Wild Hunt), the long-bearded god Odin is referred to as \"the Yule one\" and \"Yule father\" in Old Norse texts, while other gods are referred to as \"Yule beings\".Simek (2010:180, 379–380).\n\nIn eastern Europe also, old pagan traditions were incorporated into Christmas celebrations, an example being the Koleda, which was incorporated into the Christmas carol.\n\nMiddle Ages \n\nIn the Early Middle Ages, Christmas Day was overshadowed by Epiphany, which in western Christianity focused on the visit of the magi. But the medieval calendar was dominated by Christmas-related holidays. The forty days before Christmas became the \"forty days of St. Martin\" (which began on November 11, the feast of St. Martin of Tours), now known as Advent. In Italy, former Saturnalian traditions were attached to Advent. Around the 12th century, these traditions transferred again to the Twelve Days of Christmas (December 25 – January 5); a time that appears in the liturgical calendars as Christmastide or Twelve Holy Days.\n\nThe prominence of Christmas Day increased gradually after Charlemagne was crowned Emperor on Christmas Day in 800. King Edmund the Martyr was anointed on Christmas in 855 and King William I of England was crowned on Christmas Day 1066.\n\nBy the High Middle Ages, the holiday had become so prominent that chroniclers routinely noted where various magnates celebrated Christmas. King Richard II of England hosted a Christmas feast in 1377 at which twenty-eight oxen and three hundred sheep were eaten. The Yule boar was a common feature of medieval Christmas feasts. Caroling also became popular, and was originally a group of dancers who sang. The group was composed of a lead singer and a ring of dancers that provided the chorus. Various writers of the time condemned caroling as lewd, indicating that the unruly traditions of Saturnalia and Yule may have continued in this form. \"Misrule\"—drunkenness, promiscuity, gambling—was also an important aspect of the festival. In England, gifts were exchanged on New Year's Day, and there was special Christmas ale.\n\nChristmas during the Middle Ages was a public festival that incorporated ivy, holly, and other evergreens. Christmas gift-giving during the Middle Ages was usually between people with legal relationships, such as tenant and landlord.McGreevy, Patrick. \"Place in the American Christmas,\" ([https://www.jstor.org/stable/215896 JSTOR]), Geographical Review, Vol. 80, No. 1. January 1990, pp. 32–42. Retrieved September 10, 2007. The annual indulgence in eating, dancing, singing, sporting, and card playing escalated in England, and by the 17th century the Christmas season featured lavish dinners, elaborate masques, and pageants. In 1607, King James I insisted that a play be acted on Christmas night and that the court indulge in games. It was during the Reformation in 16th–17th-century Europe that many Protestants changed the gift bringer to the Christ Child or Christkindl, and the date of giving gifts changed from December 6 to Christmas Eve.\n\nReformation to the 18th century \n\nFollowing the Protestant Reformation, many of the new denominations, including the Anglican Church and Lutheran Church, continued to celebrate Christmas. In 1629, the Anglican poet John Milton penned On the Morning of Christ's Nativity, a poem that has since been read by many during Christmastide. Donald Heinz, a professor at California State University, states that Martin Luther \"inaugurated a period in which Germany would produce a unique culture of Christmas, much copied in North America.\" Among the congregations of the Dutch Reformed Church, Christmas was celebrated as one of the principal evangelical feasts.\n\nHowever, in 17th century England, some groups such as the Puritans, strongly condemned the celebration of Christmas, considering it a Catholic invention and the \"trappings of popery\" or the \"rags of the Beast\". In contrast, the established Anglican Church \"pressed for a more elaborate observance of feasts, penitential seasons, and saints' days. The calendar reform became a major point of tension between the Anglican party and the Puritan party.\" The Catholic Church also responded, promoting the festival in a more religiously oriented form. King Charles I of England directed his noblemen and gentry to return to their landed estates in midwinter to keep up their old-style Christmas generosity. Following the Parliamentarian victory over Charles I during the English Civil War, England's Puritan rulers banned Christmas in 1647.\n\nProtests followed as pro-Christmas rioting broke out in several cities and for weeks Canterbury was controlled by the rioters, who decorated doorways with holly and shouted royalist slogans. The book, The Vindication of Christmas (London, 1652), argued against the Puritans, and makes note of Old English Christmas traditions, dinner, roast apples on the fire, card playing, dances with \"plow-boys\" and \"maidservants\", old Father Christmas and carol singing.\n\nThe Restoration of King Charles II in 1660 ended the ban, but many Calvinist clergymen still disapproved of Christmas celebration. As such, in Scotland, the Presbyterian Church of Scotland discouraged the observance of Christmas, and though James VI commanded its celebration in 1618, attendance at church was scant.Chambers, Robert (1885). Domestic Annals of Scotland, p. 211. The Parliament of Scotland officially abolished the observance of Christmas in 1640, claiming that the church had been \"purged of all superstitious observation of days\". It was not until 1958 that Christmas again became a Scottish public holiday.\n\nFollowing the Restoration of Charles II, Poor Robin's Almanack contained the lines: \"Now thanks to God for Charles return, / Whose absence made old Christmas mourn. / For then we scarcely did it know, / Whether it Christmas were or no.\" The diary of James Woodforde, from the latter half of the 18th century, details the observance of Christmas and celebrations associated with the season over a number of years.\n\nIn Colonial America, the Pilgrims of New England shared radical Protestant disapproval of Christmas. The Plymouth Pilgrims put their loathing for the day into practice in 1620 when they spent their first Christmas Day in the New World working – thus demonstrating their complete contempt for the day. Non-Puritans in New England deplored the loss of the holidays enjoyed by the laboring classes in England. Christmas observance was outlawed in Boston in 1659. The ban by the Puritans was revoked in 1681 by English governor Edmund Andros, however it was not until the mid-19th century that celebrating Christmas became fashionable in the Boston region.\n\nAt the same time, Christian residents of Virginia and New York observed the holiday freely. Pennsylvania German Settlers, pre-eminently the Moravian settlers of Bethlehem, Nazareth and Lititz in Pennsylvania and the Wachovia Settlements in North Carolina, were enthusiastic celebrators of Christmas. The Moravians in Bethlehem had the first Christmas trees in America as well as the first Nativity Scenes. Christmas fell out of favor in the United States after the American Revolution, when it was considered an English custom.\nGeorge Washington attacked Hessian (German) mercenaries on the day after Christmas during the Battle of Trenton on December 26, 1776, Christmas being much more popular in Germany than in America at this time.\n\nWith the atheistic Cult of Reason in power during the era of Revolutionary France, Christian Christmas religious services were banned and the three kings cake was renamed the \"equality cake\" under anticlerical government policies.\n\n19th century \n\nIn the UK, Christmas Day became a bank holiday in 1834, Boxing Day was added in 1871.\n\nIn the early-19th century, writers imagined Tudor Christmas as a time of heartfelt celebration. In 1843, Charles Dickens wrote the novel A Christmas Carol that helped revive the \"spirit\" of Christmas and seasonal merriment. Its instant popularity played a major role in portraying Christmas as a holiday emphasizing family, goodwill, and compassion.Rowell, Geoffrey, \"Dickens and the Construction of Christmas\", History Today, Volume: 43 Issue: 12, December 1993, pp. 17–24.\n\nDickens sought to construct Christmas as a family-centered festival of generosity, linking \"worship and feasting, within a context of social reconciliation.\" Superimposing his humanitarian vision of the holiday, in what has been termed \"Carol Philosophy\", Dickens influenced many aspects of Christmas that are celebrated today in Western culture, such as family gatherings, seasonal food and drink, dancing, games, and a festive generosity of spirit. A prominent phrase from the tale, \"Merry Christmas\", was popularized following the appearance of the story.Cochrane, Robertson. Wordplay: origins, meanings, and usage of the English language. University of Toronto Press, 1996, p. 126, . This coincided with the appearance of the Oxford Movement and the growth of Anglo-Catholicism, which led a revival in traditional rituals and religious observances.Hutton, Ronald, The Stations of the Sun: The Ritual Year in England. 1996. Oxford: Oxford University Press, p. 113. .\n\nThe term Scrooge became a synonym for miser, with \"Bah! Humbug!\" dismissive of the festive spirit.Joe L. Wheeler. Christmas in My Heart, Volume 10, p. 97. Review and Herald Pub Assoc, 2001. . In 1843, the first commercial Christmas card was produced by Sir Henry Cole. The revival of the Christmas Carol began with William Sandys's \"Christmas Carols Ancient and Modern\" (1833), with the first appearance in print of \"The First Noel\", \"I Saw Three Ships\", \"Hark the Herald Angels Sing\" and \"God Rest Ye Merry, Gentlemen\", popularized in Dickens' A Christmas Carol.\n\nIn Britain, the Christmas tree was introduced in the early 19th century following the personal union with the Kingdom of Hanover by Charlotte of Mecklenburg-Strelitz, wife of King George III. In 1832, the future Queen Victoria wrote about her delight at having a Christmas tree, hung with lights, ornaments, and presents placed round it.The Girlhood of Queen Victoria: a selection from Her Majesty's diaries, p. 61. Longmans, Green & Co., 1912. University of Wisconsin. After her marriage to her German cousin Prince Albert, by 1841 the custom became more widespread throughout Britain.\n\nAn image of the British royal family with their Christmas tree at Windsor Castle created a sensation when it was published in the Illustrated London News in 1848. A modified version of this image was published in the United States in 1850.Godey's Lady's Book, 1850. Godey's copied it exactly, except he removed the Queen's tiara, and Prince Albert's moustache, to remake the engraving into an American scene. By the 1870s, putting up a Christmas tree had become common in America.\n\nIn America, interest in Christmas had been revived in the 1820s by several short stories by Washington Irving which appear in his The Sketch Book of Geoffrey Crayon, Gent. and \"Old Christmas\". Irving's stories depicted harmonious warm-hearted English Christmas festivities he experienced while staying in Aston Hall, Birmingham, England, that had largely been abandoned,Kelly, Richard Michael (ed.) (2003), A Christmas Carol, p. 20. Broadview Literary Texts, New York: Broadview Press, . and he used the tract Vindication of Christmas (1652) of Old English Christmas traditions, that he had transcribed into his journal as a format for his stories.\n\nIn 1822, Clement Clarke Moore wrote the poem A Visit From St. Nicholas (popularly known by its first line: Twas the Night Before Christmas).Moore's poem transferred the genuine old Dutch traditions celebrated at New Year in New York, including the exchange of gifts, family feasting, and tales of \"sinterklass\" (a derivation in Dutch from \"Saint Nicholas\", from whence comes the modern \"Santa Claus\") to Christmas.[http://www.thehistoryofchristmas.com/ch/in_america.htm The history of Christmas: Christmas history in America], 2006.\nThe poem helped popularize the tradition of exchanging gifts, and seasonal Christmas shopping began to assume economic importance.[http://usinfo.state.gov/scv/Archive/2005/Dec/19-344398.html \"Americans Celebrate Christmas in Diverse Ways\"] , Usinfo.state.gov, November 26, 2006.\nThis also started the cultural conflict between the holiday's spiritual significance and its associated commercialism that some see as corrupting the holiday. In her 1850 book The First Christmas in New England, Harriet Beecher Stowe includes a character who complains that the true meaning of Christmas was lost in a shopping spree.First Presbyterian Church of Watertown [http://www.watertownfirstpres.org/sermons/12-11-05.html \"Oh ... and one more thing\"] December 11, 2005\n \n\nWhile the celebration of Christmas was not yet customary in some regions in the U.S., Henry Wadsworth Longfellow detected \"a transition state about Christmas here in New England\" in 1856. \"The old puritan feeling prevents it from being a cheerful, hearty holiday; though every year makes it more so.\"Restad, Penne L. (1995), Christmas in America: a History, Oxford: Oxford University Press, p. 96. .\nIn Reading, Pennsylvania, a newspaper remarked in 1861, \"Even our presbyterian friends who have hitherto steadfastly ignored Christmas—threw open their church doors and assembled in force to celebrate the anniversary of the Savior's birth.\"\n\nThe First Congregational Church of Rockford, Illinois, \"although of genuine Puritan stock\", was 'preparing for a grand Christmas jubilee', a news correspondent reported in 1864. By 1860, fourteen states including several from New England had adopted Christmas as a legal holiday. In 1875, Louis Prang introduced the Christmas card to Americans. He has been called the \"father of the American Christmas card\".Meggs, Philip B. A History of Graphic Design. 1998 John Wiley & Sons, Inc. p 148 . On June 28, 1870, Christmas was formally declared a United States federal holiday.\n\n20th century \n\nUp to the 1950s, in the UK, many Christmas customs were restricted to the upper classes and better-off families. The mass of the population had not adopted many of the Christmas rituals that later became general. The Christmas tree was rare. Christmas dinner might be beef—certainly not turkey. In their stockings children might get an apple, orange and sweets. Full celebration of a family Christmas with all the trimmings only became widespread with increased prosperity from the 1950s. National papers were published on Christmas Day until 1912. Post was still delivered on Christmas Day until 1961. League football matches continued in Scotland until the 1970s while in England they ceased at the end of the 1950s.\n\nUnder the state atheism of the Soviet Union, after its foundation in 1917, Christmas celebrations—along with other Christian holidays—were prohibited in public. During the 1920s, 30s and 40s, the League of Militant Atheists encouraged school pupils to campaign against Christmas traditions, such as the Christmas tree, as well as other Christian holidays, including Easter; the League established an antireligious holiday to be the 31st of each month as a replacement. At the height of this persecution, in 1929, on Christmas Day, children in Moscow were encouraged to spit on crucifixes as a protest against the holiday. It was not until the dissolution of the Soviet Union in 1991 that the persecution ended and Orthodox Christmas became a state holiday again for the first time in Russia after seven decades.\n\nEuropean History Professor Joseph Perry wrote that likewise, in Nazi Germany, \"because Nazi ideologues saw organized religion as an enemy of the totalitarian state, propagandists sought to deemphasize—or eliminate altogether—the Christian aspects of the holiday\" and that \"Propagandists tirelessly promoted numerous Nazified Christmas songs, which replaced Christian themes with the regime's racial ideologies.\"\n\nAs Christmas celebrations began to be held around the world even outside traditional Christian cultures in the 20th century, some Muslim-majority countries have banned the practice of Christmas, claiming it undermines Islam.\n\nCustoms and traditions \n\nChristmas Day is celebrated as a major festival and public holiday in countries around the world, including many whose populations are mostly non-Christian. In some non-Christian areas, periods of former colonial rule introduced the celebration (e.g. Hong Kong); in others, Christian minorities or foreign cultural influences have led populations to observe the holiday. Countries such as Japan, where Christmas is popular despite there being only a small number of Christians, have adopted many of the secular aspects of Christmas, such as gift-giving, decorations, and Christmas trees.\n\nCountries in which Christmas is not a formal public holiday include Afghanistan, Algeria, Azerbaijan, Bahrain, Bhutan, Cambodia, China (excepting Hong Kong and Macau), the Comoros, Iran, Israel, Japan, Kuwait, Laos, Libya, the Maldives, Mauritania, Mongolia, Morocco, North Korea, Oman, Pakistan, Qatar, the Sahrawi Republic, Saudi Arabia, Somalia, Tajikistan, Thailand, Tunisia, Turkey, Turkmenistan, the United Arab Emirates, Uzbekistan, Vietnam, and Yemen. Christmas celebrations around the world can vary markedly in form, reflecting differing cultural and national traditions.\n\nAmong countries with a strong Christian tradition, a variety of Christmas celebrations have developed that incorporate regional and local cultures. For Christians, participating in a religious service plays an important part in the recognition of the season. Christmas, along with Easter, is the period of highest annual church attendance. A 2010 survey by LifeWay Christian Resources found that 47% of American households attend church services during this time. In the United Kingdom, the Church of England reported an estimated attendance of  people at Christmas services in 2015.\n\nIn Catholic countries, people hold religious processions or parades in the days preceding Christmas. In other countries, secular processions or parades featuring Santa Claus and other seasonal figures are often held. Family reunions and the exchange of gifts are a widespread feature of the season. Gift-giving takes place on Christmas Day in most countries. Others practice gift giving on Saint Nicholas Day, and January 6, Epiphany.\n\nDecorations \n\nThe practice of putting up special decorations at Christmas has a long history. In the 15th century, it was recorded that in London it was the custom at Christmas for every house and all the parish churches to be \"decked with holm, ivy, bays, and whatsoever the season of the year afforded to be green\".Miles, Clement A, Christmas customs and traditions, Courier Dover Publications, 1976, , p. 272. The heart-shaped leaves of ivy were said to symbolize the coming to earth of Jesus, while holly was seen as protection against pagans and witches, its thorns and red berries held to represent the Crown of Thorns worn by Jesus at the crucifixion and the blood he shed.Heller, Ruth, Christmas: Its Carols, Customs & Legends, Alfred Publishing (1985), , p. 12.\n\nNativity scenes are known from 10th-century Rome. They were popularised by Saint Francis of Assisi from 1223, quickly spreading across Europe.Collins, Ace, Stories Behind the Great Traditions of Christmas, Zondervan, (2003),  p.47. Different types of decorations developed across the Christian world, dependent on local tradition and available resources, and can vary from simple representations of the crib to far more elaborate sets – renowned manger scene traditions include the colourful Kraków szopka in Poland,[https://books.google.com/books?id\ndArLWAbKEe8C&pgPA159 Google Books] Susan Topp Weber, Nativities of the World, Gibbs Smith, 2013 which imitate Kraków's historical buildings as settings, the elaborate Italian presepi (Neapolitan, Genoese and Bolognese),Bershad, David; Carolina Mangone, [https://books.google.com/books?id\nllTiET5oCR4C&pgPA112&dq\nneapolitan+nativity+scene&hlen The Christian Travelers Guide to Italy], Zondervan, 2001. or the Provençal crèches in southern France, using hand-painted terracotta figurines called santons. In certain parts of the world, notably Sicily, living nativity scenes following the tradition of Saint Francis are a popular alternative to static crèches.Seaburg, Carl, [https://books.google.com/books?id\ndLB-UkN5UHYC&pgPT30&dq\nliving+nativity+scenes+sicily&hlen Celebrating Christmas: An Anthology], iUniverse, 2003.Bowler, Gerry, [https://books.google.com/books?id\nWGaVZ6fEjjsC&pgPT478&dq\nliving+nativity+scenes+sicily&hlen The World Encyclopedia of Christmas], Random House LLC, 2012. The first commercially produced decorations appeared in Germany in the 1860s, inspired by paper chains made by children.Collins p. 83. In countries where a representation of the Nativity scene is very popular, people are encouraged to compete and create the most original or realistic ones. Within some families, the pieces used to make the representation are considered a valuable family heirloom.\n\nThe traditional colors of Christmas decorations are red, green, and gold. Red symbolizes the blood of Jesus, which was shed in his crucifixion, while green symbolizes eternal life, and in particular the evergreen tree, which does not lose its leaves in the winter, and gold is the first color associated with Christmas, as one of the three gifts of the Magi, symbolizing royalty.\n\nThe Christmas tree is considered by some as Christianisation of pagan tradition and ritual surrounding the Winter Solstice, which included the use of evergreen boughs, and an adaptation of pagan tree worship; according to eighth-century biographer Æddi Stephanus, Saint Boniface (634–709), who was a missionary in Germany, took an axe to an oak tree dedicated to Thor and pointed out a fir tree, which he stated was a more fitting object of reverence because it pointed to heaven and it had a triangular shape, which he said was symbolic of the Trinity. The English language phrase \"Christmas tree\" is first recorded in 1835Harper, Douglas, [http://www.etymonline.com/index.php?termChrist Christ], Online Etymology Dictionary, 2001. and represents an importation from the German language. The modern Christmas tree tradition is believed to have begun in Germany in the 18th centuryvan Renterghem, Tony. When Santa was a shaman. St. Paul: Llewellyn Publications, 1995. . though many argue that Martin Luther began the tradition in the 16th century.\n\nFrom Germany the custom was introduced to Britain, first via Queen Charlotte, wife of George III, and then more successfully by Prince Albert during the reign of Queen Victoria. By 1841 the Christmas tree had become even more widespread throughout Britain.Lejeune, Marie Claire. Compendium of symbolic and ritual plants in Europe, p.550. University of Michigan . By the 1870s, people in the United States had adopted the custom of putting up a Christmas tree.Shoemaker, Alfred Lewis. (1959) Christmas in Pennsylvania: a folk-cultural study. Edition 40. pp. 52, 53. Stackpole Books 1999. . Christmas trees may be decorated with lights and ornaments.\n\nSince the 16th century, the poinsettia, a native plant from Mexico, has been associated with Christmas. Other popular holiday plants include holly, mistletoe, red amaryllis, and Christmas cactus. Along with a Christmas tree, the interior of a home may be decorated with these plants, along with garlands and evergreen foliage. The display of Christmas villages has also become a tradition in many homes during this season. The outside of houses may be decorated with lights and sometimes with illuminated sleighs, snowmen, and other Christmas figures. Mistletoe features prominently in European myth and folklore (for example the legend of Baldr), it is an evergreen parasitic plant which grows on trees, especially apple and poplar, and turns golden when it is dried. It is customary to hang a sprig of mistletoe in the house at Christmas, and anyone standing underneath it may be kissed. Mistletoe has sticky white berries, one of which was traditionally removed whenever someone was kissed under it. This is probably a fertility ritual. The mistletoe berry juice resembles semen.\n\nOther traditional decorations include bells, candles, candy canes, stockings, wreaths, and angels. Both the displaying of wreaths and candles in each window are a more traditional Christmas display. The concentric assortment of leaves, usually from an evergreen, make up Christmas wreaths and are designed to prepare Christians for the Advent season. Candles in each window are meant to demonstrate the fact that Christians believe that Jesus Christ is the ultimate light of the world.\n\nChristmas lights and banners may be hung along streets, music played from speakers, and Christmas trees placed in prominent places.Murray, Brian. [http://www.historymatters.appstate.edu/documents/christmaslights.pdf \"Christmas lights and community building in America,\"] History Matters, Spring 2006.  It is common in many parts of the world for town squares and consumer shopping areas to sponsor and display decorations. Rolls of brightly colored paper with secular or religious Christmas motifs are manufactured for the purpose of wrapping gifts. In some countries, Christmas decorations are traditionally taken down on Twelfth Night, the evening of January 5.\n\nMusic and carols \n\nThe earliest extant specifically Christmas hymns appear in fourth-century Rome. Latin hymns such as \"Veni redemptor gentium\", written by Ambrose, Archbishop of Milan, were austere statements of the theological doctrine of the Incarnation in opposition to Arianism. \"Corde natus ex Parentis\" (\"Of the Father's love begotten\") by the Spanish poet Prudentius (d. 413) is still sung in some churches today.Miles, Clement, Christmas customs and traditions, Courier Dover Publications, 1976, , p. 32. In the 9th and 10th centuries, the Christmas \"Sequence\" or \"Prose\" was introduced in North European monasteries, developing under Bernard of Clairvaux into a sequence of rhymed stanzas. In the 12th century the Parisian monk Adam of St. Victor began to derive music from popular songs, introducing something closer to the traditional Christmas carol.\n\nBy the 13th century, in France, Germany, and particularly, Italy, under the influence of Francis of Assisi, a strong tradition of popular Christmas songs in the native language developed.Miles, pp. 31–37. Christmas carols in English first appear in a 1426 work of John Awdlay, a Shropshire chaplain, who lists twenty-five \"caroles of Cristemas\", probably sung by groups of wassailers, who went from house to house.Miles, pp. 47–48.\n\nThe songs we know specifically as carols were originally communal folk songs sung during celebrations such as \"harvest tide\" as well as Christmas. It was only later that carols began to be sung in church. Traditionally, carols have often been based on medieval chord patterns, and it is this that gives them their uniquely characteristic musical sound. Some carols like \"Personent hodie\", \"Good King Wenceslas\", and \"The Holly and the Ivy\" can be traced directly back to the Middle Ages. They are among the oldest musical compositions still regularly sung. \"Adeste Fideles\" (O Come all ye faithful) appears in its current form in the mid-18th century, although the words may have originated in the 13th century.\n\nSinging of carols initially suffered a decline in popularity after the Protestant Reformation in northern Europe, although some Reformers, like Martin Luther, wrote carols and encouraged their use in worship. Carols largely survived in rural communities until the revival of interest in popular songs in the 19th century. The 18th-century English reformer Charles Wesley understood the importance of music to worship. In addition to setting many psalms to melodies, which were influential in the Great Awakening in the United States, he wrote texts for at least three Christmas carols. The best known was originally entitled \"Hark! How All the Welkin Rings\", later renamed \"Hark! the Herald Angels Sing\".\n\nFelix Mendelssohn wrote a melody adapted to fit Wesley's words. In Austria in 1818 Mohr and Gruber made a major addition to the genre when they composed \"Silent Night\" for the St. Nicholas Church, Oberndorf. William Sandys' Christmas Carols Ancient and Modern (1833) contained the first appearance in print of many now-classic English carols, and contributed to the mid-Victorian revival of the festival.Richard Michael Kelly. A Christmas Carol, Broadview Press, 2003, p. 10. .\n\nCompletely secular Christmas seasonal songs emerged in the late 18th century. \"Deck the Halls\" dates from 1784, and the American \"Jingle Bells\" was copyrighted in 1857. In the 19th and 20th century, African American spirituals and songs about Christmas, based in their tradition of spirituals, became more widely known. An increasing number of seasonal holidays songs were commercially produced in the 20th century, including jazz and blues variations. In addition, there was a revival of interest in early music, from groups singing folk music, such as The Revels, to performers of early medieval and classical music. John Rutter has composed many carols including \"All Bells in Paradise\", \"Angels' Carol\", \"Candlelight Carol\", \"Donkey Carol\", \"Jesus Child\", \"Shepherds' Pipe Carol\" and \"Star Carol\".\n\nTraditional cuisine \n\nA special Christmas family meal is traditionally an important part of the holiday's celebration, and the food that is served varies greatly from country to country. Some regions, such as Sicily, have special meals for Christmas Eve, when 12 kinds of fish are served. In the United Kingdom and countries influenced by its traditions, a standard Christmas meal includes turkey, goose or other large bird, gravy, potatoes, vegetables, sometimes bread and cider. Special desserts are also prepared, such as Christmas pudding, mince pies, fruit cake and Yule log cake.Broomfield, Andrea (2007), [https://books.google.com/books?idfJ_JDp9OgJEC&pg\nPA149&dqchristmas+pudding+england&hl\nen&oibook_result&ct\nresult&resnum=2 Food and Cooking in Victorian England: A History], Greenwood Publishing Group, 2007, pp. 149–150.Muir, Frank (1977), Christmas customs & traditions, Taplinger Pub. Co., 1977, p. 58.\n\nIn Poland and other parts of eastern Europe and Scandinavia, fish often is used for the traditional main course, but richer meat such as lamb is increasingly served. In Sweden it is common with a special variety of smörgåsbord, where ham, meatballs and herring play a prominent role. In Germany, France, and Austria, goose and pork are favored. Beef, ham, and chicken in various recipes are popular throughout the world. The Maltese traditionally serve Imbuljuta tal-Qastan, a chocolate and chestnuts beverage, after Midnight Mass and throughout the Christmas season. Slovaks prepare the traditional Christmas bread potica, bûche de Noël in France, panettone in Italy, and elaborate tarts and cakes. The eating of sweets and chocolates has become popular worldwide, and sweeter Christmas delicacies include the German stollen, marzipan cake or candy, and Jamaican rum fruit cake. As one of the few fruits traditionally available to northern countries in winter, oranges have been long associated with special Christmas foods. Eggnog is a sweetened dairy-based beverage traditionally made with milk, cream, sugar, and whipped eggs (which gives it a frothy texture). Spirits such as brandy, rum or bourbon are often added. The finished serving is often garnished with a sprinkling of ground cinnamon or nutmeg.\n\nCards \n\nChristmas cards are illustrated messages of greeting exchanged between friends and family members during the weeks preceding Christmas Day. The traditional greeting reads \"wishing you a Merry Christmas and a Happy New Year\", much like that of the first commercial Christmas card, produced by Sir Henry Cole in London in 1843.[http://news.bbc.co.uk/1/hi/england/1679110.stm \"Christmas card sold for record price\"], BBC News. Retrieved October 28, 2011. The custom of sending them has become popular among a wide cross-section of people with the emergence of the modern trend towards exchanging E-cards.\n\nChristmas cards are purchased in considerable quantities, and feature artwork, commercially designed and relevant to the season. The content of the design might relate directly to the Christmas narrative, with depictions of the Nativity of Jesus, or Christian symbols such as the Star of Bethlehem, or a white dove, which can represent both the Holy Spirit and Peace on Earth. Other Christmas cards are more secular and can depict Christmas traditions, mythical figures such as Santa Claus, objects directly associated with Christmas such as candles, holly and baubles, or a variety of images associated with the season, such as Christmastide activities, snow scenes and the wildlife of the northern winter. There are even humorous cards and genres depicting nostalgic scenes of the past such as crinolined shoppers in idealized 19th-century streetscapes.\n\nSome prefer cards with a poem, prayer, or Biblical verse; while others distance themselves from religion with an all-inclusive \"Season's greetings\".\n\nCommemorative stamps \n\nA number of nations have issued commemorative stamps at Christmastide. Postal customers will often use these stamps to mail Christmas cards, and they are popular with philatelists. These stamps are regular postage stamps, unlike Christmas seals, and are valid for postage year-round. They usually go on sale some time between early October and early December, and are printed in considerable quantities.\n\nGift giving \n\nThe exchanging of gifts is one of the core aspects of the modern Christmas celebration, making it the most profitable time of year for retailers and businesses throughout the world. On Christmas, people exchange gifts based on the Christian tradition associated with Saint Nicholas, and the gifts of gold, frankincense, and myrrh which were given to the baby Jesus by the Magi. The practice of gift giving in the Roman celebration of Saturnalia may have influenced Christian Christian customs, but on the other hand the Christian \"core dogma of the Incarnation, however, solidly established the giving and receiving of gifts as the structural principle of that recurrent yet unique event\", because it was the Biblical Magi, \"together with all their fellow men, who received the gift of God through man's renewed participation in the divine life.\"\n\nGift-bearing figures \n\nA number of figures are associated with Christmas and the seasonal giving of gifts. Among these are Father Christmas, also known as Santa Claus (derived from the Dutch for Saint Nicholas), Père Noël, and the Weihnachtsmann; Saint Nicholas or Sinterklaas; the Christkind; Kris Kringle; Joulupukki; tomte/nisse; Babbo Natale; Saint Basil; and Ded Moroz. The Scandinavian tomte (also called nisse) is sometimes depicted as a gnome instead of Santa Claus.\n\nThe best known of these figures today is red-dressed Santa Claus, of diverse origins. The name Santa Claus can be traced back to the Dutch Sinterklaas, which means simply Saint Nicholas. Nicholas was a 4th-century Greek bishop of Myra, a city in the Roman province of Lycia, whose ruins are 3 km from modern Demre in southwest Turkey. Among other saintly attributes, he was noted for the care of children, generosity, and the giving of gifts. His feast day, December 6, came to be celebrated in many countries with the giving of gifts.Forbes, Bruce David, Christmas: a candid history, University of California Press, 2007, , pp. 68–79.\n\nSaint Nicholas traditionally appeared in bishop's attire, accompanied by helpers, inquiring about the behaviour of children during the past year before deciding whether they deserved a gift or not. By the 13th century, Saint Nicholas was well known in the Netherlands, and the practice of gift-giving in his name spread to other parts of central and southern Europe. At the Reformation in 16th–17th-century Europe, many Protestants changed the gift bringer to the Christ Child or Christkindl, corrupted in English to Kris Kringle, and the date of giving gifts changed from December 6 to Christmas Eve.\n\nThe modern popular image of Santa Claus, however, was created in the United States, and in particular in New York. The transformation was accomplished with the aid of notable contributors including Washington Irving and the German-American cartoonist Thomas Nast (1840–1902). Following the American Revolutionary War, some of the inhabitants of New York City sought out symbols of the city's non-English past. New York had originally been established as the Dutch colonial town of New Amsterdam and the Dutch Sinterklaas tradition was reinvented as Saint Nicholas.\n\nIn 1809, the New-York Historical Society convened and retroactively named Sancte Claus the patron saint of Nieuw Amsterdam, the Dutch name for New York City.John Steele Gordon, The Great Game: The Emergence of Wall Street as a World Power: 1653–2000 (Scribner), 1999. At his first American appearance in 1810, Santa Claus was drawn in bishops' robes. However, as new artists took over, Santa Claus developed more secular attire.Forbes, Bruce David, Christmas: A Candid History, pp. 80–81. Nast drew a new image of \"Santa Claus\" annually, beginning in 1863. By the 1880s, Nast's Santa had evolved into the modern vision of the figure, perhaps based on the English figure of Father Christmas. The image was standardized by advertisers in the 1920sMikkelson, Barbara and David P., [http://www.snopes.com/cokelore/santa.asp \"The Claus That Refreshes\"], Snopes.com, 2006. and continues through the present day.\n\nFather Christmas, a jolly, stout, bearded man who typified the spirit of good cheer at Christmas, predates the Santa Claus character. He is first recorded in early 17th century England, but was associated with holiday merrymaking and drunkenness rather than the bringing of gifts. In Victorian Britain, his image was remade to match that of Santa. The French Père Noël evolved along similar lines, eventually adopting the Santa image. In Italy, Babbo Natale acts as Santa Claus, while La Befana is the bringer of gifts and arrives on the eve of the Epiphany. It is said that La Befana set out to bring the baby Jesus gifts, but got lost along the way. Now, she brings gifts to all children. In some cultures Santa Claus is accompanied by Knecht Ruprecht, or Black Peter. In other versions, elves make the toys. His wife is referred to as Mrs. Claus.\n\nThere has been some opposition to the narrative of the American evolution of Saint Nicholas into the modern Santa. It has been claimed that the Saint Nicholas Society was not founded until 1835, almost half a century after the end of the American War of Independence. Moreover, a study of the \"children's books, periodicals and journals\" of New Amsterdam by Charles Jones revealed no references to Saint Nicholas or Sinterklaas. However, not all scholars agree with Jones's findings, which he reiterated in a book-length study in 1978;Jones, Charles W., Saint Nicholas of Myra, Bari, and Manhattan: Biography of a Legend (Chicago: University of Chicago Press, 1978). Howard G. Hageman, of New Brunswick Theological Seminary, maintains that the tradition of celebrating Sinterklaas in New York was alive and well from the early settlement of the Hudson Valley on.\n\nCurrent tradition in several Latin American countries (such as Venezuela and Colombia) holds that while Santa makes the toys, he then gives them to the Baby Jesus, who is the one who actually delivers them to the children's homes, a reconciliation between traditional religious beliefs and the iconography of Santa Claus imported from the United States.\n\nIn South Tyrol (Italy), Austria, Czech Republic, Southern Germany, Hungary, Liechtenstein, Slovakia, and Switzerland, the Christkind (Ježíšek in Czech, Jézuska in Hungarian and Ježiško in Slovak) brings the presents. Greek children get their presents from Saint Basil on New Year's Eve, the eve of that saint's liturgical feast. The German St. Nikolaus is not identical with the Weihnachtsmann (who is the German version of Santa Claus / Father Christmas). St. Nikolaus wears a bishop's dress and still brings small gifts (usually candies, nuts, and fruits) on December 6 and is accompanied by Knecht Ruprecht. Although many parents around the world routinely teach their children about Santa Claus and other gift bringers, some have come to reject this practice, considering it deceptive.Matera, Mariane. [http://www.citybeat.com/archives/1996/issue304/cover1.html \"Santa: The First Great Lie\"], Citybeat, Issue 304.\n\nMultiple gift-giver figures exist in Poland, varying between regions and individual families. St Nicholas (Święty Mikołaj) dominates Central and North-East areas, the Starman (Gwiazdor) is most common in Greater Poland, Baby Jesus (Dzieciątko) is unique to Upper Silesia, with the Little Star (Gwiazdka) and the Little Angel (Aniołek) being common in the South and the South-East. Grandfather Frost (Dziadek Mróz) is less commonly accepted in some areas of Eastern Poland. It is worth noting that across all of Poland, St Nicholas is the gift giver on the Saint Nicholas Day on December 6.\n\nDate according to Julian calendar \n\nSome jurisdictions of the Eastern Orthodox Church, including those of Russia, Georgia, Ukraine, Macedonia, Montenegro, Serbia, and Jerusalem, mark feasts using the older Julian calendar. As of , there is a difference of 13 days between the Julian calendar and the modern Gregorian calendar, which is used internationally for most secular purposes. As a result, December 25 on the Julian calendar currently corresponds to January 7 on the calendar used by most governments and people in everyday life. Therefore, the aforementioned Orthodox Christians mark December 25 (and thus Christmas) on the day that is internationally considered to be January 7.\n\nHowever, other Orthodox Christians, such as those belonging to the jurisdictions of Bulgaria, Greece, Romania, Constantinople, Antioch, Alexandria, Albania, Cyprus, Finland, and the Orthodox Church in America, among others, began using the Revised Julian calendar in the early 20th century, which at present corresponds exactly to the Gregorian calendar. Therefore, these Orthodox Christians mark December 25 (and thus Christmas) on the same day that is internationally considered to be December 25, and which is also the date of Christmas among Western Christians.\n\nA further complication is added by the fact that the Armenian Apostolic Church continues the original ancient Eastern Christian practice of celebrating the birth of Christ not as a separate holiday, but on the same day as the celebration of his baptism (Theophany), which is on January 6. This is a public holiday in Armenia, and it is held on the same day that is internationally considered to be January 6, because the Armenian Church in Armenia uses the Gregorian calendar.\n\nHowever, there is also a small Armenian Patriarchate of Jerusalem, which maintains the traditional Armenian custom of celebrating the birth of Christ on the same day as Theophany (January 6), but uses the Julian calendar for the determination of that date. As a result, this church celebrates \"Christmas\" (more properly called Theophany) on the day that is considered January 19 on the Gregorian calendar in use by the majority of the world.\n\nIn summary, there are four different dates used by different Christian groups to mark the birth of Christ, given in the table below.\n\nListing \n\nEconomy \n\nChristmas is typically a peak selling season for retailers in many nations around the world. Sales increase dramatically as people purchase gifts, decorations, and supplies to celebrate. In the U.S., the \"Christmas shopping season\" starts as early as October.Varga, Melody. [http://retailindustry.about.com/od/abouttheretailindustry/g/black_friday.htm \"Black Friday], About:Retail Industry.  In Canada, merchants begin advertising campaigns just before Halloween (October 31), and step up their marketing following Remembrance Day on November 11. In the UK and Ireland, the Christmas shopping season starts from mid-November, around the time when high street Christmas lights are turned on.[http://www.viewlondon.co.uk/whatson/south-molton-street-christmas-lights-feature-3530.html \"South Molton and Brook Street Christmas Lights\"] (November 16, 2010), View London.co.uk.Kollewe, Julia, (November 29, 2010), [https://www.theguardian.com/business/2010/nov/29/christmas-shopping-spree-starts \"West End spree worth £250m marks start of Christmas shopping season\"], The Guardian. In the United States, it has been calculated that a quarter of all personal spending takes place during the Christmas/holiday shopping season. Figures from the U.S. Census Bureau reveal that expenditure in department stores nationwide rose from $20.8 billion in November 2004 to $31.9 billion in December 2004, an increase of 54 percent. In other sectors, the pre-Christmas increase in spending was even greater, there being a November–December buying surge of 100 percent in bookstores and 170 percent in jewelry stores. In the same year employment in American retail stores rose from 1.6 million to 1.8 million in the two months leading up to Christmas.US Census Bureau. [https://www.census.gov/Press-Release/www/releases/archives/facts_for_features_special_editions/005870.html \"Facts. The Holiday Season\"] December 19, 2005. (accessed November 30, 2009) [http://webarchive.loc.gov/all/20100507013857/http%3A//www%2Ecensus%2Egov/Press%2DRelease/www/releases/archives/facts_for_features_special_editions/005870%2Ehtml Archived copy] at the Library of Congress (May 7, 2010). Industries completely dependent on Christmas include Christmas cards, of which 1.9 billion are sent in the United States each year, and live Christmas Trees, of which 20.8 million were cut in the U.S. in 2002.US Census 2005. In the UK in 2010, up to £8 billion was expected to be spent online at Christmas, approximately a quarter of total retail festive sales.\n\nIn most Western nations, Christmas Day is the least active day of the year for business and commerce; almost all retail, commercial and institutional businesses are closed, and almost all industries cease activity (more than any other day of the year), whether laws require such or not. In England and Wales, the Christmas Day (Trading) Act 2004 prevents all large shops from trading on Christmas Day. Scotland is currently planning similar legislation. Film studios release many high-budget movies during the holiday season, including Christmas films, fantasy movies or high-tone dramas with high production values to hopes of maximizing the chance of nominations for the Academy Awards.\n\nOne economist's analysis calculates that, despite increased overall spending, Christmas is a deadweight loss under orthodox microeconomic theory, because of the effect of gift-giving. This loss is calculated as the difference between what the gift giver spent on the item and what the gift receiver would have paid for the item. It is estimated that in 2001, Christmas resulted in a $4 billion deadweight loss in the U.S. alone.\"The Deadweight Loss of Christmas\", American Economic Review, December 1993, 83 (5).[http://www.economist.com/finance/displayStory.cfm?Story_ID885748 \"Is Santa a deadweight loss?\"] The Economist December 20, 2001. Because of complicating factors, this analysis is sometimes used to discuss possible flaws in current microeconomic theory. Other deadweight losses include the effects of Christmas on the environment and the fact that material gifts are often perceived as white elephants, imposing cost for upkeep and storage and contributing to clutter.Reuters. [http://www.enn.com/today.html?id\n9475 \"Christmas is Damaging the Environment, Report Says\"], December 16, 2005.\n\nControversies \n\nChristmas has at times been the subject of controversy and attacks from various sources. Historically it was prohibited by Puritans when they briefly held power in England during the English Interregnum (1649–1660), and in Colonial America where the Puritans outlawed the celebration of Christmas in 1659.[http://www.time.com/time/specials/packages/article/0,28804,1868506_1868508_1868518,00.html Christmas in the Colonies] Time. Retrieved December 25, 2011. The Parliament of Scotland, which was dominated by Presbyterians, passed a series of acts outlawing the observance of Christmas between 1637 and 1690; Christmas Day did not become a public holiday in Scotland until 1958. Christmas celebrations have also been prohibited by atheist states such as the Soviet Union and more recently majority Muslim states such as Somalia, Tajikistan and Brunei.\n\nModern scholars such as E. P. Sanders, Geza Vermes and Marcus Borg consider both Gospel narratives of the birth of Jesus to be non-historical, arguing that there are contradictions between them.Vermes, Géza (November 2, 2006). The Nativity: History and Legend. Penguin Books Ltd, p. 64. .Sanders, E. P. The Historical Figure of Jesus. Penguin, 1993 (). Sanders discusses both birth narratives in detail, contrasts them, and judges them not historical on pp. 85–88.Borg, Marcus, \"The Meaning of the Birth Stories\" in Marcus Borg, N. T. Wright, The Meaning of Jesus: Two Visions (Harper One, 1999), p. 179: \"I (and most mainline scholars) do not see these stories as historically factual.\" Many biblical scholars view the discussion of historicity as secondary, given that gospels were primarily written as theological documents rather than historical accounts.Wiarda, Timothy, Interpreting Gospel Narratives: Scenes, People, and Theology, Broadman & Holman Publishers, 2010, , pp. 75–78.Brennan R. Hill, Jesus, the Christ: Contemporary Perspectives, 2004, , p. 89.Johnson, Timothy, The Gospel of Luke, 1992 , p. 72.Yoder, Thomas R., Recovering Jesus: the Witness of the New Testament, Neufeld, 2007, , p. 111.\n\nSecularization controversies \n\nSome Christians and organizations such as Pat Robertson's American Center for Law and Justice cite alleged attacks on Christmas (dubbing them a \"war on Christmas\").[http://www.muslimcanadiancongress.org/20051128.html Christmas controversy article] – Muslim Canadian Congress.[http://www.newsmax.com/archives/articles/2004/12/18/145204.shtml \"Jews for Christmas\"]—NewsMax article. Such groups claim that any specific mention of the term \"Christmas\" or its religious aspects is being increasingly censored, avoided, or discouraged by a number of advertisers, retailers, government (prominently schools), and other public and private organizations. One controversy is the occurrence of Christmas trees being renamed Holiday trees. In the U.S. there has been a tendency to replace the greeting Merry Christmas with Happy Holidays, which is considered inclusive at the time of the Jewish celebration of Hanukkah.Feder, Don, [http://www.jewishworldreview.com/cols/feder121300.asp \"In the culture, Christmas morphs into holiday\"], Jewish World Review, December 13, 2000. In the U.S. and Canada, where the use of the term \"Holidays\" is most prevalent, opponents have denounced its usage and avoidance of using the term \"Christmas\" as being politically correct. Groups such as the American Civil Liberties Union have initiated court cases to bar the display of images and other material referring to Christmas from public property, including schools.Gibson, John, The War on Christmas, Sentinel Trade, 2006, pp. 1–6. Such groups argue that government-funded displays of Christmas imagery and traditions violate the First Amendment to the United States Constitution, which prohibits the establishment by Congress of a national religion.Ostling, Richard. \"Have Yourself A Merry Little Lawsuit This Season.\" Buffalo Law Journal January 12, 2005, Vol. 77, Issue 96, pp. 1–4. In 1984, the U.S. Supreme Court ruled in Lynch v. Donnelly that a Christmas display (which included a Nativity scene) owned and displayed by the city of Pawtucket, Rhode Island, did not violate the First Amendment. In November 2009, the federal appeals court in Philadelphia upheld a school district's ban on the singing of Christmas carols. The Supreme Court of the United States declined to hear an appeal.\n\nAmerican Muslim scholar Abdul Malik Mujahid has said that Muslims must treat Christmas with respect, even if they disagree with it.Mujahid, Abdul Malik. \"[https://www.soundvision.com/article/treating-christmas-with-respect Treating Christmas with respect],\" Sound Vision. Christmas. http://en.wikipedia.org/?curid=6237."
  }
}
