{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9379",
  "eid" : "eeb57ac0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778480236,
  "textBody" : "Eritrea has an estimated population of  as of . No reliable census data is available, the best available estimates being published by the Population Division of the United Nations Department of Economic and Social Affairs.\nThe population has doubled over the past 30 years, with an accelerating growth rate estimated at close to 3.2% p.a. during 2005–2010. This rate of population growth is sustained despite a high emigration rate; the World Bank as of 2010 estimated that close to a million of Eritreans have emigrated.[http://www.worldbank.org/prospects/migrationandremittances Bilateral Estimates of Migrant Stocks in 2010] estimates 942,000 emigrants, of whom 450,000 migrated to Sudan and 290,000 to Ethiopia. C.f. the World' Bank's [http://siteresources.worldbank.org/INTLAC/Resources/Factbook2011-Ebook.pdf Migration and Remittances Factbook 2011].\n\nThe nation has nine recognized ethnic groups. According to SIL Ethnologue, Tigrinyas make up about 50% of the population; the Tigre, who also speak a Semitic language, constitute around 30% of residents. Most of the rest of the population belong to other Afro-Asiatic-speaking communities of the Cushitic branch. Additionally, there are a number of Nilo-Saharan-speaking ethnic minorities and other smaller groups.\n \nA majority of Eritrea's population adheres to Abrahamic religions. The two most followed religions are Christianity and Islam, which have an almost equal number of followers.\n\nEthno-linguistic groups\n\nEritrea's population comprises nine recognized ethnic groups, most of whom speak languages from the Ethiopian Semitic branch of the Afro-Asiatic family. The Ethiopian Semitic languages spoken in Eritrea are Tigre, Tigrinya, and the newly recognized Dahlik. Other Afro-Asiatic languages belonging to the Cushitic branch are also widely spoken in the country. The latter include Afar, Beja, Blin, and Saho.\n\nIn addition, languages belonging to the Nilo-Saharan language family (Kunama and Nara) are spoken as a mother tongue by the Kunama and Nara Nilotic ethnic minorities that live in the north and northwestern part of the country. The Rashaida speak Arabic, while there are also a number of Italians who speak their native Italian language.\n\nAfro-Asiatic communities\n\nSemitic speakers\n\nTigrinya\n\nThe majority of the Tigrinya inhabit the highlands of Eritrea; however, migration to other parts of the country has occurred. Their language is called Tigrinya. They are the largest ethnic group in the country, constituting about 55% of the population. All speakers of Tigrinya in Eritrea are officially referred to as Biher-Tigrinya (or simply, Tigrinya). The predominantly Biher-Tigrinya populated urban centers in Eritrea are the capital Asmara, Mendefera, Dekemhare, Adi Keyh, Adi Quala and Senafe, while there is a significant population of Biher-Tigrinya in other cities including Keren, and Massawa.\n\nThe Jeberti people in Eritrea trace descent from early Muslim adherents. The term Jeberti is also locally sometimes used to generically refer to all Islamic inhabitants of the highlands. The Jeberti in Eritrea speak Arabic and Tigrinya. They account for about 10% of the Tigrinya speakers in the nation. The remaining 90% are Christians, so divided: 73% of the Eritrean Orthodox faith, 12% Roman Catholic and Eastern Catholic (whose mass is held in Ge'ez as opposed to Latin), and 5% belonging to various Protestant and other Christian denominations, the majority of which belong to the (Lutheran) Evangelical Church of Eritrea.\n\nTigre\n\nThe Tigre reside in the western lowlands in Eritrea. Many also migrated to Sudan at the time of the Ethiopian-Eritrean conflict and lived there since. They are a nomadic and pastoralist people, related to the Bihér-Tigrinya and to the Beja people. They are a predominantly Muslim nomadic people who inhabit the northern, western, and coastal lowlands of Eritrea, where they constitute 30% of local residents. Some also inhabit areas in eastern Sudan. 95% of the Tigre people adhere to the Islamic religion Sunni Islam, but there are a small amount of Christians among them as well (often referred to as the Mensaï in Eritrea). Their language is called Tigre.\n\nRashaida\n\nThe Rashaida are one of Eritrea's nine recognized ethnic groups. They represent around 2% of the population of Eritrea. The Rashaida reside in the northern coastal lowlands of Eritrea and the northern eastern coasts of Sudan. They are predominantly Muslim and are the only ethnic group in Eritrea to have Arabic as their communal language, specifically the Hejazi dialect. The Rashaida first came to Eritrea in the 19th century from the Arabian Coast.\n\nCushitic speakers\n\nAfar\n\nAccording to the CIA, the Afar constitute under 5% of the nation's population. They live in the Debubawi Keyih Bahri Region of Eritrea, as well as the Afar Region in Ethiopia, and Djibouti. They speak the Afar language as a mother tongue, and are predominantly Muslim. Afars in Eritrea number about 397,000 individuals, the smallest population out of the countries they reside in. In Djibouti, there are about 780,000 group members, and in Ethiopia, they number approximately 1,300,000.\n\nSaho\n\nThe Saho represent 4% of Eritrea's population. They principally reside in the Debubawi Keyih Bahri Region and the Northern Red Sea Region of Eritrea. Some also live in adjacent parts of Ethiopia. Their language is called Saho. They are predominantly Muslim, although a few Christians known as the Irob live in the Debub Region of Eritrea and the Tigray region of Ethiopia.\n\nBilen\n\nThe Bilen in Eritrea represent around 2% of the country's population. They are primarily concentrated in the north-central areas, in and around the city of Keren, and south towards Asmara, the nation's capital. Many of them entered Eritrea from kush (central of Sudan) in the 8th century and settled at Merara then they went to Lalibla and to Lasta finally they returned to Auxum and battled with the natives, aftermath they returned to their main base at Merara The Bilen include adherents of both Islam and Christianity. They speak Bilen as a mother tongue. Christian adherents are mainly urban and have intermingled with the Tigrinya who live in the area. Muslim adherents are mainly rural and have interbred with the adjacent Tigre.\n\nBeja\n\nThe Beja in Eritrea, or Hedareb, constitute under 5% of local residents. They mainly live along the north-western border with Sudan. Group members are predominantly Muslim and communicate in Hedareb as a first or second language. The Beja also include the Beni-Amer people, who have retained their native Beja language alongside Hedareb.\n\nNilo-Saharan communities\n\nKunama\n\nAccording to the CIA, the Kunama constitute around 2% of Eritrea's population. They mainly live in the country's Gash Barka Region, as well as in adjacent parts of Ethiopia's Tigray Region. Many of them reside in the contested border village of Badme. Their language is called Kunama. Although some Kunama still practice traditional beliefs, most are converts to either Christianity (Roman Catholic and Protestant) or Islam.\n\nNara\n\nThe Nara represent under 5% of the nation's population. They principally reside along the south-western border with Sudan and Ethiopia. They are generally Muslim, with a few Christians and some practising their indigenous beliefs. Their language is called Nara.\n\nOther communities\n\nItalians\n\nA few monolingual Italian Eritreans remain. As of 2008, they were estimated at 900 people, down from around 38,000 residents at the end of World War II.\n\nReligion\n\n \nFile:Regions of Eritrea.svg|thumb|Regions of Eritrea\npoly 167 182  163 205  179 211  184 203  176 179 Maekel Region\npoly 167 182  176 179  118 108  118  50   59  85   53 133 Anseba Region\npoly 163 205  167 182   53 133   19 258   91 276  135 239  147 206 Gash-Barka Region\npoly 184 203  179 211  147 206  135 239  153 254  221 248  225 226  189 200 Debub Region\npoly 176 179  184 203  189 200  225 226  221 248  271 259  279 220  200 159  155  21  118  50  118 108 Northern Red Sea Region\npoly 279 220  271 259  419 388  442 361  319 241 Southern Red Sea Region\n\nPeople in Eritrea practice various religions. According to the Pew Research Center (2010), 62.9% of the population are Christian, mostly followers of Oriental Orthodoxy, and to a lesser extent, Roman Catholicism, with the second-largest denomination being Muslims. In general, most local residents who adhere to Christianity live in the Maekel and Debub regions, whereas those who follow Islam predominantly inhabit the Anseba, Northern Red Sea, Southern Red Sea and Gash-Barka regions. A few adherents of traditional faiths can also be found, particularly in the lowlands.\n\nPopulation\n\nAccording to , the total population of Eritrea was at  in  (compared to 3.27 million in 1990).\nPopulation growth rate during 2005–2010 was estimated at 3.2% p.a.\n\nIn the 2010s, worsening conditions have fuelled migration pressure, with Eritreans trying to reach Europe illegally in boats reaching desperate proportions in 2013.[https://www.economist.com/news/middle-east-and-africa/21587844-eritreans-are-taking-seas-because-worsening-conditions-home-why-they Why they leave --  Eritreans are taking to the seas because of worsening conditions at home] 12 October 2013. \n\"Some 30,000 people reached Italy illegally in boats in the first nine months of 2013, three times as many as in the whole of 2012, according to Frontex, [...] the largest batch came from Eritrea, a country that has supposedly been at peace for the past 13 years.\"\n[http://www.catholicherald.co.uk/news/2014/06/12/emigration-has-left-eritrea-desolate-say-bishops/ Emigration has left Eritrea ‘desolate’, say bishops]\", Catholic Herald, 6 September 2014.\n\nThe proportion of children below the age of 15 in 2010 was 41.6%, 55.9% was between 15 and 65 years of age, while 2.5% was 65 years or older.\n\nUN  medium variant population projections as of 2010 expected a radically reduced growth rate of 2.0% during the 2020s and of 1.8% during the 2030s.\nThis was corrected as too optimistic an outlook in the 2012 edition, which now expected a more pessimistic, but still declining growth rate of 2.7% during the 2020s (10.3 million in 2030) and of 2.4% during the 2030s (13 million in 2040).Based on an a-priori assumption of worldwide \"convergence towards low fertility\". \"World Population Prospects: The 2012 Revision\"[http://esa.un.org/unpd/wpp/index.htm], \"[http://esa.un.org/unpd/wpp/Documentation/pdf/WPP2012_Methodology.pdf Methodology]\", p. 15: \n\"The 2012 Revision drew on new empirical evidence on fertility levels and trends that became available since the publication of the 2010 Revision. The empirical evidence from available surveys and the 2010 round of censuses has provided the basis for a reassessment of fertility levels and trends experienced within the last decade. In a number of countries, particularly in Africa, slower than\nexpected fertility declines or even stalled fertility was observed. In some cases, increases in total fertility were also recorded. This led to the decision not to apply the additional adjustment that was used in the 2010 Revision for a small number of countries at the very early  stage of their fertility transition (for example, Mali, Niger, Nigeria, and Somalia) or that had experienced recent fertility stalling (for example, Congo, Gabon, Kenya, Malawi, Mozambique, Rwanda, Sao Tome and Principe, United Republic of Tanzania, Zambia, and Zimbabwe). For these countries, the recent fertility decline has been much slower than typically experienced in the past decades by other countries at similar levels of fertility, and the additional adjustment would have delayed any potential future decline, implying even more population growth than already anticipated with the standard assumption.\"\n\nVital statistics\n\nRegistration of vital events in Eritrea is incomplete. The Population Department of the United Nations prepared the following estimates:\n\nFertility and Births\n\nTotal Fertility Rate (TFR) (Wanted Fertility Rate) and Crude Birth Rate (CBR):\n\nFertility data as of 2002 (DHS Program):http://dhsprogram.com/pubs/pdf/FR137/FR137.pdf\n\nDemographic statistics\n\nThe following demographic statistics are from the CIA World Factbook, unless otherwise indicated.\nPopulation: 5,060,620\nAge structure:\n0–14 years:\n42.9% (male 1,085,116/female 1,072,262) \n15–64 years:\n53.5% (male 1,332,349/female 1,355,494) \n65 years and over:\n3.6% (male 88,068/female 95,186) (2008 est.)\n\nPopulation growth rate:\n2.445% (2011 est.)\n\nSex ratio:\nat birth:\n1.03 male(s)/female\nunder 15 years:\n1.01 male(s)/female\n15–64 years:\n0.98 male(s)/female\n65 years and over:\n0.93 male(s)/female\ntotal population:\n0.99 male(s)/female (2008 est.)\n\nFertility rate:\nAccording to 2002 official survey, fertility rate was 4.8 with 3.5 in urban and 5.7 in rural.http://www.measuredhs.com/pubs/pdf/FR137/FR137.pdf\n\nLife expectancy at birth:\ntotal population:\n68.8 years \nmale:\n66.7 years \nfemale:\n70.9 years (2010 est.)\n\nNationality:\nnoun:\nEritrean(s)\nadjective:\nEritrean\n\nEthnic groups:Tigrinya 55%, Tigre 30%, Saho 4%, Kunama 2%, Rashaida 2%, Bilen 2%, other (Afar,  Beni-Amer, Nera) 5% (2010 est.) \n\nReligions:\nEritrean Orthodox, Sunni Muslim, Roman Catholic, Protestant (see Religion in Eritrea)\n\nLanguages:\nAfar, Arabic (spoken by the Rashaida), Beja (spoken by the Hedareb), Blin, Kunama, Nara, Saho, Tigre,  Tigrinya, as a second language. English, Italian and Arabic are the foremost second languages.\n \nLiteracy:\ndefinition:\nage 15 and over can read and write\ntotal population:\n70%\nmale:\n68%\nfemale:\n72% (2011 est.)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Demographics of Eritrea" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9379" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Eritrea has an estimated population of  as of . No reliable census data is available, the best available estimates being published by the Population Division of the United Nations Department of Economic and Social Affairs.\nThe population has doubled over the past 30 years, with an accelerating growth rate estimated at close to 3.2% p.a. during 2005–2010. This rate of population growth is sustained despite a high emigration rate; the World Bank as of 2010 estimated that close to a million of Eritreans have emigrated.[http://www.worldbank.org/prospects/migrationandremittances Bilateral Estimates of Migrant Stocks in 2010] estimates 942,000 emigrants, of whom 450,000 migrated to Sudan and 290,000 to Ethiopia. C.f. the World' Bank's [http://siteresources.worldbank.org/INTLAC/Resources/Factbook2011-Ebook.pdf Migration and Remittances Factbook 2011].\n\nThe nation has nine recognized ethnic groups. According to SIL Ethnologue, Tigrinyas make up about 50% of the population; the Tigre, who also speak a Semitic language, constitute around 30% of residents. Most of the rest of the population belong to other Afro-Asiatic-speaking communities of the Cushitic branch. Additionally, there are a number of Nilo-Saharan-speaking ethnic minorities and other smaller groups.\n \nA majority of Eritrea's population adheres to Abrahamic religions. The two most followed religions are Christianity and Islam, which have an almost equal number of followers.\n\nEthno-linguistic groups\n\nEritrea's population comprises nine recognized ethnic groups, most of whom speak languages from the Ethiopian Semitic branch of the Afro-Asiatic family. The Ethiopian Semitic languages spoken in Eritrea are Tigre, Tigrinya, and the newly recognized Dahlik. Other Afro-Asiatic languages belonging to the Cushitic branch are also widely spoken in the country. The latter include Afar, Beja, Blin, and Saho.\n\nIn addition, languages belonging to the Nilo-Saharan language family (Kunama and Nara) are spoken as a mother tongue by the Kunama and Nara Nilotic ethnic minorities that live in the north and northwestern part of the country. The Rashaida speak Arabic, while there are also a number of Italians who speak their native Italian language.\n\nAfro-Asiatic communities\n\nSemitic speakers\n\nTigrinya\n\nThe majority of the Tigrinya inhabit the highlands of Eritrea; however, migration to other parts of the country has occurred. Their language is called Tigrinya. They are the largest ethnic group in the country, constituting about 55% of the population. All speakers of Tigrinya in Eritrea are officially referred to as Biher-Tigrinya (or simply, Tigrinya). The predominantly Biher-Tigrinya populated urban centers in Eritrea are the capital Asmara, Mendefera, Dekemhare, Adi Keyh, Adi Quala and Senafe, while there is a significant population of Biher-Tigrinya in other cities including Keren, and Massawa.\n\nThe Jeberti people in Eritrea trace descent from early Muslim adherents. The term Jeberti is also locally sometimes used to generically refer to all Islamic inhabitants of the highlands. The Jeberti in Eritrea speak Arabic and Tigrinya. They account for about 10% of the Tigrinya speakers in the nation. The remaining 90% are Christians, so divided: 73% of the Eritrean Orthodox faith, 12% Roman Catholic and Eastern Catholic (whose mass is held in Ge'ez as opposed to Latin), and 5% belonging to various Protestant and other Christian denominations, the majority of which belong to the (Lutheran) Evangelical Church of Eritrea.\n\nTigre\n\nThe Tigre reside in the western lowlands in Eritrea. Many also migrated to Sudan at the time of the Ethiopian-Eritrean conflict and lived there since. They are a nomadic and pastoralist people, related to the Bihér-Tigrinya and to the Beja people. They are a predominantly Muslim nomadic people who inhabit the northern, western, and coastal lowlands of Eritrea, where they constitute 30% of local residents. Some also inhabit areas in eastern Sudan. 95% of the Tigre people adhere to the Islamic religion Sunni Islam, but there are a small amount of Christians among them as well (often referred to as the Mensaï in Eritrea). Their language is called Tigre.\n\nRashaida\n\nThe Rashaida are one of Eritrea's nine recognized ethnic groups. They represent around 2% of the population of Eritrea. The Rashaida reside in the northern coastal lowlands of Eritrea and the northern eastern coasts of Sudan. They are predominantly Muslim and are the only ethnic group in Eritrea to have Arabic as their communal language, specifically the Hejazi dialect. The Rashaida first came to Eritrea in the 19th century from the Arabian Coast.\n\nCushitic speakers\n\nAfar\n\nAccording to the CIA, the Afar constitute under 5% of the nation's population. They live in the Debubawi Keyih Bahri Region of Eritrea, as well as the Afar Region in Ethiopia, and Djibouti. They speak the Afar language as a mother tongue, and are predominantly Muslim. Afars in Eritrea number about 397,000 individuals, the smallest population out of the countries they reside in. In Djibouti, there are about 780,000 group members, and in Ethiopia, they number approximately 1,300,000.\n\nSaho\n\nThe Saho represent 4% of Eritrea's population. They principally reside in the Debubawi Keyih Bahri Region and the Northern Red Sea Region of Eritrea. Some also live in adjacent parts of Ethiopia. Their language is called Saho. They are predominantly Muslim, although a few Christians known as the Irob live in the Debub Region of Eritrea and the Tigray region of Ethiopia.\n\nBilen\n\nThe Bilen in Eritrea represent around 2% of the country's population. They are primarily concentrated in the north-central areas, in and around the city of Keren, and south towards Asmara, the nation's capital. Many of them entered Eritrea from kush (central of Sudan) in the 8th century and settled at Merara then they went to Lalibla and to Lasta finally they returned to Auxum and battled with the natives, aftermath they returned to their main base at Merara The Bilen include adherents of both Islam and Christianity. They speak Bilen as a mother tongue. Christian adherents are mainly urban and have intermingled with the Tigrinya who live in the area. Muslim adherents are mainly rural and have interbred with the adjacent Tigre.\n\nBeja\n\nThe Beja in Eritrea, or Hedareb, constitute under 5% of local residents. They mainly live along the north-western border with Sudan. Group members are predominantly Muslim and communicate in Hedareb as a first or second language. The Beja also include the Beni-Amer people, who have retained their native Beja language alongside Hedareb.\n\nNilo-Saharan communities\n\nKunama\n\nAccording to the CIA, the Kunama constitute around 2% of Eritrea's population. They mainly live in the country's Gash Barka Region, as well as in adjacent parts of Ethiopia's Tigray Region. Many of them reside in the contested border village of Badme. Their language is called Kunama. Although some Kunama still practice traditional beliefs, most are converts to either Christianity (Roman Catholic and Protestant) or Islam.\n\nNara\n\nThe Nara represent under 5% of the nation's population. They principally reside along the south-western border with Sudan and Ethiopia. They are generally Muslim, with a few Christians and some practising their indigenous beliefs. Their language is called Nara.\n\nOther communities\n\nItalians\n\nA few monolingual Italian Eritreans remain. As of 2008, they were estimated at 900 people, down from around 38,000 residents at the end of World War II.\n\nReligion\n\n \nFile:Regions of Eritrea.svg|thumb|Regions of Eritrea\npoly 167 182  163 205  179 211  184 203  176 179 Maekel Region\npoly 167 182  176 179  118 108  118  50   59  85   53 133 Anseba Region\npoly 163 205  167 182   53 133   19 258   91 276  135 239  147 206 Gash-Barka Region\npoly 184 203  179 211  147 206  135 239  153 254  221 248  225 226  189 200 Debub Region\npoly 176 179  184 203  189 200  225 226  221 248  271 259  279 220  200 159  155  21  118  50  118 108 Northern Red Sea Region\npoly 279 220  271 259  419 388  442 361  319 241 Southern Red Sea Region\n\nPeople in Eritrea practice various religions. According to the Pew Research Center (2010), 62.9% of the population are Christian, mostly followers of Oriental Orthodoxy, and to a lesser extent, Roman Catholicism, with the second-largest denomination being Muslims. In general, most local residents who adhere to Christianity live in the Maekel and Debub regions, whereas those who follow Islam predominantly inhabit the Anseba, Northern Red Sea, Southern Red Sea and Gash-Barka regions. A few adherents of traditional faiths can also be found, particularly in the lowlands.\n\nPopulation\n\nAccording to , the total population of Eritrea was at  in  (compared to 3.27 million in 1990).\nPopulation growth rate during 2005–2010 was estimated at 3.2% p.a.\n\nIn the 2010s, worsening conditions have fuelled migration pressure, with Eritreans trying to reach Europe illegally in boats reaching desperate proportions in 2013.[https://www.economist.com/news/middle-east-and-africa/21587844-eritreans-are-taking-seas-because-worsening-conditions-home-why-they Why they leave --  Eritreans are taking to the seas because of worsening conditions at home] 12 October 2013. \n\"Some 30,000 people reached Italy illegally in boats in the first nine months of 2013, three times as many as in the whole of 2012, according to Frontex, [...] the largest batch came from Eritrea, a country that has supposedly been at peace for the past 13 years.\"\n[http://www.catholicherald.co.uk/news/2014/06/12/emigration-has-left-eritrea-desolate-say-bishops/ Emigration has left Eritrea ‘desolate’, say bishops]\", Catholic Herald, 6 September 2014.\n\nThe proportion of children below the age of 15 in 2010 was 41.6%, 55.9% was between 15 and 65 years of age, while 2.5% was 65 years or older.\n\nUN  medium variant population projections as of 2010 expected a radically reduced growth rate of 2.0% during the 2020s and of 1.8% during the 2030s.\nThis was corrected as too optimistic an outlook in the 2012 edition, which now expected a more pessimistic, but still declining growth rate of 2.7% during the 2020s (10.3 million in 2030) and of 2.4% during the 2030s (13 million in 2040).Based on an a-priori assumption of worldwide \"convergence towards low fertility\". \"World Population Prospects: The 2012 Revision\"[http://esa.un.org/unpd/wpp/index.htm], \"[http://esa.un.org/unpd/wpp/Documentation/pdf/WPP2012_Methodology.pdf Methodology]\", p. 15: \n\"The 2012 Revision drew on new empirical evidence on fertility levels and trends that became available since the publication of the 2010 Revision. The empirical evidence from available surveys and the 2010 round of censuses has provided the basis for a reassessment of fertility levels and trends experienced within the last decade. In a number of countries, particularly in Africa, slower than\nexpected fertility declines or even stalled fertility was observed. In some cases, increases in total fertility were also recorded. This led to the decision not to apply the additional adjustment that was used in the 2010 Revision for a small number of countries at the very early  stage of their fertility transition (for example, Mali, Niger, Nigeria, and Somalia) or that had experienced recent fertility stalling (for example, Congo, Gabon, Kenya, Malawi, Mozambique, Rwanda, Sao Tome and Principe, United Republic of Tanzania, Zambia, and Zimbabwe). For these countries, the recent fertility decline has been much slower than typically experienced in the past decades by other countries at similar levels of fertility, and the additional adjustment would have delayed any potential future decline, implying even more population growth than already anticipated with the standard assumption.\"\n\nVital statistics\n\nRegistration of vital events in Eritrea is incomplete. The Population Department of the United Nations prepared the following estimates:\n\nFertility and Births\n\nTotal Fertility Rate (TFR) (Wanted Fertility Rate) and Crude Birth Rate (CBR):\n\nFertility data as of 2002 (DHS Program):http://dhsprogram.com/pubs/pdf/FR137/FR137.pdf\n\nDemographic statistics\n\nThe following demographic statistics are from the CIA World Factbook, unless otherwise indicated.\nPopulation: 5,060,620\nAge structure:\n0–14 years:\n42.9% (male 1,085,116/female 1,072,262) \n15–64 years:\n53.5% (male 1,332,349/female 1,355,494) \n65 years and over:\n3.6% (male 88,068/female 95,186) (2008 est.)\n\nPopulation growth rate:\n2.445% (2011 est.)\n\nSex ratio:\nat birth:\n1.03 male(s)/female\nunder 15 years:\n1.01 male(s)/female\n15–64 years:\n0.98 male(s)/female\n65 years and over:\n0.93 male(s)/female\ntotal population:\n0.99 male(s)/female (2008 est.)\n\nFertility rate:\nAccording to 2002 official survey, fertility rate was 4.8 with 3.5 in urban and 5.7 in rural.http://www.measuredhs.com/pubs/pdf/FR137/FR137.pdf\n\nLife expectancy at birth:\ntotal population:\n68.8 years \nmale:\n66.7 years \nfemale:\n70.9 years (2010 est.)\n\nNationality:\nnoun:\nEritrean(s)\nadjective:\nEritrean\n\nEthnic groups:Tigrinya 55%, Tigre 30%, Saho 4%, Kunama 2%, Rashaida 2%, Bilen 2%, other (Afar,  Beni-Amer, Nera) 5% (2010 est.) \n\nReligions:\nEritrean Orthodox, Sunni Muslim, Roman Catholic, Protestant (see Religion in Eritrea)\n\nLanguages:\nAfar, Arabic (spoken by the Rashaida), Beja (spoken by the Hedareb), Blin, Kunama, Nara, Saho, Tigre,  Tigrinya, as a second language. English, Italian and Arabic are the foremost second languages.\n \nLiteracy:\ndefinition:\nage 15 and over can read and write\ntotal population:\n70%\nmale:\n68%\nfemale:\n72% (2011 est.). Demographics of Eritrea. http://en.wikipedia.org/?curid=9379."
  }
}
