{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13765",
  "eid" : "0cd6a510-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778530785,
  "textBody" : "Henry Alfred Kissinger (; born Heinz Alfred Kissinger,; May 27, 1923) is an American political scientist, diplomat and geopolitical consultant who served as the United States Secretary of State and National Security Advisor under the presidential administrations of Richard Nixon and Gerald Ford. A Jewish refugee who fled Nazi Germany with his family in 1938, he became National Security Advisor in 1969 and United States Secretary of State in 1973. For his actions negotiating a ceasefire in Vietnam, Kissinger received the 1973 Nobel Peace Prize under controversial circumstances, with two members of the committee resigning in protest. Kissinger later sought, unsuccessfully, to return the prize after the ceasefire failed.\n\nA practitioner of Realpolitik, Kissinger played a prominent role in United States foreign policy between 1969 and 1977. During this period, he pioneered the policy of détente with the Soviet Union, orchestrated the opening of relations with the People's Republic of China, and negotiated the Paris Peace Accords, ending American involvement in the Vietnam War. Kissinger has also been associated with such controversial policies as U.S. involvement in a military coup in Chile and U.S. support for Pakistan during the Bangladesh War despite a genocide. After leaving government, he formed Kissinger Associates, an international geopolitical consulting firm. Kissinger has been a prolific author of books on diplomatic history and international relations with over one dozen books authored.\n\nSome journalists, activists, and human rights lawyers have condemned Kissinger as a war criminal. \"[…] many consider Kissinger a war criminal, most famously Christopher Hitchens, who, in a lengthy two-part article for Harper’s in 2001 (later expanded into the book and documentary, The Trial of Henry Kissinger), laid out his case that Kissinger should be brought up on charges 'for war crimes, for crimes against humanity, and for offenses against common or customary or international law, including conspiracy to commit murder, kidnap, and torture'. He remains a controversial figure in popular culture.  However, in a 2014 survey, many scholars and foreign policy experts ranked Henry Kissinger as the most effective U.S. Secretary of State since 1965.\n\nEarly life and education\n\nKissinger was born Heinz Alfred Kissinger in Fürth, Bavaria, Germany, in 1923 during the Weimar Republic, to a family of German Jews. His father, Louis Kissinger (1887–1982), was a schoolteacher. His mother, Paula (Stern) Kissinger (1901–1998), from Leutershausen, was a homemaker. Kissinger has a younger brother, Walter Kissinger (born 1924). The surname Kissinger was adopted in 1817 by his great-great-grandfather Meyer Löb, after the Bavarian spa town of Bad Kissingen. As a youth, Heinz enjoyed playing soccer, and played for the youth wing of his favorite club, SpVgg Fürth, which was one of the nation's best clubs at the time. In 1938, fleeing Nazi persecution, his family moved to London, England, before arriving in New York on September 5.\n\nKissinger spent his high school years in the Washington Heights section of Upper Manhattan as part of the German Jewish immigrant community that resided there at the time. Although Kissinger assimilated quickly into American culture, he never lost his pronounced German accent, due to childhood shyness that made him hesitant to speak. Following his first year at George Washington High School, he began attending school at night and worked in a shaving brush factory during the day.\n\nFollowing high school, Kissinger enrolled in the City College of New York, studying accounting. He excelled academically as a part-time student, continuing to work while enrolled. His studies were interrupted in early 1943, when he was drafted into the U.S. Army.\n\nArmy experience\n\nKissinger underwent basic training at Camp Croft in Spartanburg, South Carolina. On June 19, 1943, while stationed in South Carolina, at the age of 20 years, he became a naturalized U.S. citizen. The army sent him to study engineering at Lafayette College, Pennsylvania, but the program was canceled, and Kissinger was reassigned to the 84th Infantry Division. There, he made the acquaintance of Fritz Kraemer, a fellow Jewish immigrant from Germany who noted Kissinger's fluency in German and his intellect, and arranged for him to be assigned to the military intelligence section of the division. Kissinger saw combat with the division, and volunteered for hazardous intelligence duties during the Battle of the Bulge.\n\nDuring the American advance into Germany, Kissinger, only a private, was put in charge of the administration of the city of Krefeld, owing to a lack of German speakers on the division's intelligence staff. Within eight days he had established a civilian administration. Kissinger was then reassigned to the Counter Intelligence Corps (CIC), with the rank of sergeant. He was given charge of a team in Hanover assigned to tracking down Gestapo officers and other saboteurs, for which he was awarded the Bronze Star. In June 1945, Kissinger was made commandant of the Bensheim metro CIC detachment, Bergstrasse district of Hesse, with responsibility for de-Nazification of the district. Although he possessed absolute authority and powers of arrest, Kissinger took care to avoid abuses against the local population by his command.\n\nIn 1946, Kissinger was reassigned to teach at the European Command Intelligence School at Camp King and, as a civilian employee following his separation from the army, continued to serve in this role.\n\nAcademic career\n\nHenry Kissinger received his AB degree summa cum laude, Phi Beta Kappa in political science from Harvard College in 1950, where he lived in Adams House and studied under William Yandell Elliott. He received his MA and PhD degrees at Harvard University in 1951 and 1954, respectively. In 1952, while still a graduate student at Harvard, he served as a consultant to the director of the Psychological Strategy Board. His doctoral dissertation was titled \"Peace, Legitimacy, and the Equilibrium (A Study of the Statesmanship of Castlereagh and Metternich)\".\n\nKissinger remained at Harvard as a member of the faculty in the Department of Government and, with Robert R. Bowie, co-founded the Center for International Affairs in 1958 where he served as associate director. In 1955, he was a consultant to the National Security Council's Operations Coordinating Board. During 1955 and 1956, he was also study director in nuclear weapons and foreign policy at the Council on Foreign Relations. He released his book Nuclear Weapons and Foreign Policy the following year. From 1956 to 1958 he worked for the Rockefeller Brothers Fund as director of its Special Studies Project. He was director of the Harvard Defense Studies Program between 1958 and 1971. He was also director of the Harvard International Seminar between 1951 and 1971. Outside of academia, he served as a consultant to several government agencies and think tanks, including the Operations Research Office, the Arms Control and Disarmament Agency, Department of State, and the RAND Corporation.\n\nKeen to have a greater influence on U.S. foreign policy, Kissinger became foreign policy advisor to the presidential campaigns of Nelson Rockefeller, supporting his bids for the Republican nomination in 1960, 1964, and 1968. After Richard Nixon won the presidency in 1968, he made Kissinger National Security Advisor.\n\nForeign policy\n\nKissinger served as National Security Advisor and Secretary of State under President Richard Nixon, and continued as Secretary of State under Nixon's successor Gerald Ford.  On Nixon's last full day in office, in the meeting where he informed Ford of his intention to resign the next day, he advised Ford that he felt it was very important that he keep Kissinger in his new administration, to which Ford agreed.[https://www.youtube.com/watch?vie98956ibMA&t\n40 President Nixon recalls his final full day], video interview with former White House Aide Frank Gannon, June 10, 1983 (Richard Nixon Library, published to YouTube on August 7, 2014)\n\nA proponent of Realpolitik, Kissinger played a dominant role in United States foreign policy between 1969 and 1977. In that period, he extended the policy of détente. This policy led to a significant relaxation in US–Soviet tensions and played a crucial role in 1971 talks with Chinese Premier Zhou Enlai. The talks concluded with a rapprochement between the United States and the People's Republic of China, and the formation of a new strategic anti-Soviet Sino-American alignment. He was jointly awarded the 1973 Nobel Peace Prize with Lê Đức Thọ for helping to establish a ceasefire and U.S. withdrawal from Vietnam. The ceasefire, however, was not durable. Thọ declined to accept the award and Kissinger appeared deeply ambivalent about it (donating his prize money to charity, not attending the award ceremony and later offering to return his prize medal[40]). As National Security Advisor, in 1974 Kissinger directed the much-debated National Security Study Memorandum 200.\n\nDétente and the opening to China\n\nAs National Security Advisor under Nixon, Kissinger pioneered the policy of détente with the Soviet Union, seeking a relaxation in tensions between the two superpowers. As a part of this strategy, he negotiated the Strategic Arms Limitation Talks (culminating in the SALT I treaty) and the Anti-Ballistic Missile Treaty with Leonid Brezhnev, General Secretary of the Soviet Communist Party. Negotiations about strategic disarmament were originally supposed to start under the Johnson Administration but were postponed in protest upon the invasion by Warsaw Pact troops of Czechoslovakia in August 1968.\n\nKissinger sought to place diplomatic pressure on the Soviet Union. He made two trips to the People's Republic of China in July and October 1971 (the first of which was made in secret) to confer with Premier Zhou Enlai, then in charge of Chinese foreign policy. According to Kissinger's book, \"The White House Years\" and \"On China\", the first secret China trip was arranged through Pakistani and Romanian\"On China\" by H. Kissinger diplomatic and Presidential involvement, as there were no direct communication channels between the states.  His trips paved the way for the groundbreaking 1972 summit between Nixon, Zhou, and Communist Party of China Chairman Mao Zedong, as well as the formalization of relations between the two countries, ending 23 years of diplomatic isolation and mutual hostility. The result was the formation of a tacit strategic anti-Soviet alliance between China and the United States.\n\nWhile Kissinger's diplomacy led to economic and cultural exchanges between the two sides and the establishment of Liaison Offices in the Chinese and American capitals, with serious implications for Indochinese matters, full normalization of relations with the People's Republic of China would not occur until 1979, because the Watergate scandal overshadowed the latter years of the Nixon presidency and because the United States continued to recognize the government of Taiwan.\n\nIn September 1989, the Wall Street Journal's John Fialka disclosed that Kissinger took a direct economic interest in US-China relations in March 1989 with the establishment of China Ventures, Inc., a Delaware limited partnership, of which he was chairman of the board and chief executive officer.  A US$75 million investment in a joint venture with the Communist Party government's primary commercial vehicle at the time, China International Trust & Investment Corporation (CITIC), was its purpose.  Board members were major clients of Kissinger Associates.  Kissinger was criticised for not disclosing his role in the venture when called upon by ABC's Peter Jennings to comment the morning after the June 4, 1989, Tiananmen crackdown.  Kissinger's position was generally supportive of Deng Xiaoping's clearance of the square and he opposed economic sanctions.\n\nVietnam War\n\nKissinger's involvement in Indochina started prior to his appointment as National Security Adviser to Nixon. While still at Harvard, he had worked as a consultant on foreign policy to both the White House and State Department. Kissinger says that \"In August 1965 ... [Henry Cabot Lodge, Jr.], an old friend serving as Ambassador to Saigon, had asked me to visit Vietnam as his consultant. I toured Vietnam first for two weeks in October and November 1965, again for about ten days in July 1966, and a third time for a few days in October 1966 ... Lodge gave me a free hand to look into any subject of my choice\". He became convinced of the meaninglessness of military victories in Vietnam, \"... unless they brought about a political reality that could survive our ultimate withdrawal\". In a 1967 peace initiative, he would mediate between Washington and Hanoi.\n\nNixon had been elected in 1968 on the promise of achieving \"peace with honor\" and ending the Vietnam War. In office, and assisted by Kissinger, Nixon implemented a policy of Vietnamization that aimed to gradually withdraw U.S. troops while expanding the combat role of the South Vietnamese Army so that it would be capable of independently defending its government against the National Front for the Liberation of South Vietnam, a Communist guerrilla organization, and North Vietnamese army (Vietnam People's Army or PAVN). Kissinger played a key role in bombing Cambodia to disrupt PAVN and Viet Cong units launching raids into South Vietnam from within Cambodia's borders and resupplying their forces by using the Ho Chi Minh trail and other routes, as well as the 1970 Cambodian Incursion and subsequent widespread bombing of Khmer Rouge targets in Cambodia. The bombing campaign contributed to the chaos of the Cambodian Civil War, which saw the forces of leader Lon Nol unable to retain foreign support to combat the growing Khmer Rouge insurgency that would overthrow him in 1975. Documents uncovered from the Soviet archives after 1991 reveal that the North Vietnamese invasion of Cambodia in 1970 was launched at the explicit request of the Khmer Rouge and negotiated by Pol Pot's then second in command, Nuon Chea.Dmitry Mosyakov, \"The Khmer Rouge and the Vietnamese Communists: A History of Their Relations as Told in the Soviet Archives\", in Susan E. Cook, ed., Genocide in Cambodia and Rwanda (Yale Genocide Studies Program Monograph Series No. 1, 2004), p. 54ff. Available online at: www.yale.edu/gsp/publications/Mosyakov.doc \"In April–May 1970, many North Vietnamese forces entered Cambodia in response to the call for help addressed to Vietnam not by Pol Pot, but by his deputy Nuon Chea. Nguyen Co Thach recalls: \"Nuon Chea has asked for help and we have liberated five provinces of Cambodia in ten days.\" The American bombing of Cambodia resulted in 40,000Marek Sliwinski, Le Génocide Khmer Rouge: Une Analyse Démographique (L’Harmattan, 1995), pp. 41–48.-150,000 deaths from 1969 to 1973, including at least 5,000 civilians. Kissinger himself said there were about 50,000 civilian casualties in the bombing.Karen Coates and Jerry Redfern (September 18, 2014). [https://www.washingtonpost.com/posteverything/wp/2014/09/18/henry-kissinger-is-not-telling-the-truth-about-his-past-again/?tid=a_inl Henry Kissinger is not telling the truth about his past. Again]. The Washington Post. Retrieved October 16, 2016. Pol Pot biographer David P. Chandler argues that the bombing \"had the effect the Americans wanted—it broke the Communist encirclement of Phnom Penh.\"Chandler, David 2000, Brother Number One: A Political Biography of Pol Pot, Revised Edition, Chiang Mai, Thailand: Silkworm Books, pp. 96–97. However, Ben Kiernan and Taylor Owen suggest that \"the bombs drove ordinary Cambodians into the arms of the Khmer Rouge, a group that seemed initially to have slim prospects of revolutionary success.\"\n\nAlong with North Vietnamese Politburo Member Le Duc Tho, Kissinger was awarded the Nobel Peace Prize on December 10, 1973, for their work in negotiating the ceasefires contained in the Paris Peace Accords on \"Ending the War and Restoring Peace in Vietnam\", signed the previous January. According to Irwin Abrams, this prize was the most controversial to date. For the first time in the history of the Peace Prize, two members left the Nobel Committee in protest. Tho rejected the award, telling Kissinger that peace had not been restored in South Vietnam.Le Duc Tho to Henry Kissinger, October 27, 1973. Kissinger wrote to the Nobel Committee that he accepted the award \"with humility,\"\n and \"donated the entire proceeds to the children of American servicemembers killed or missing in action in Indochina.\" After the Fall of Saigon in 1975, Kissinger attempted to return the award.\n\nBangladesh War\n\nUnder Kissinger's guidance, the United States government supported Pakistan in the Bangladesh Liberation War in 1971. Kissinger was particularly concerned about the expansion of Soviet influence in the Indian Subcontinent as a result of a treaty of friendship recently signed by India and the USSR, and sought to demonstrate to the People's Republic of China (Pakistan's ally and an enemy of both India and the USSR) the value of a tacit alliance with the United States.\n\nKissinger sneered at people who \"bleed\" for \"the dying Bengalis\" and ignored the first telegram from the United States consul general in East Pakistan, Archer K. Blood, and 20 members of his staff, which informed the US that their allies West Pakistan were undertaking, in Blood's words, \"a selective genocide\". In the second, more famous, Blood Telegram the word genocide was again used to describe the events, and further that with its continuing support for West Pakistan the US government had \"evidenced [...] moral bankruptcy\".\nAs a direct response to the dissent against US policy Kissinger and Nixon ended Archer Blood's tenure as United States consul general in East Pakistan and put him to work in the State Department's Personnel Office.\n\nHenry Kissinger had also come under fire for private comments he made to Nixon during the Bangladesh–Pakistan War in which he described Indian Prime Minister Indira Gandhi as a \"bitch\" and a \"witch\". He also said \"The Indians are bastards\", shortly before the war. Kissinger has since expressed his regret over the comments.\n\nIsraeli policy and Soviet Jewry\n\nAccording to notes taken by H. R. Haldeman, Nixon \"ordered his aides to exclude all Jewish-Americans from policy-making on Israel\", including Kissinger.Chait, Jonathan (December 10, 2010) [http://www.tnr.com/blog/jonathan-chait/79829/nixon-disallowed-jewish-advisors-discussing-israel-policy Nixon Disallowed Jewish Advisors From Discussing Israel Policy], The New Republic One note quotes Nixon as saying \"get K. [Kissinger] out of the play—Haig handle it\".\n\nIn 1973, Kissinger did not feel that pressing the Soviet Union concerning the plight of Jews being persecuted there was in the interest of U.S. foreign policy. In conversation with Nixon shortly after a meeting with Israeli Prime Minister Golda Meir on March 1, 1973, Kissinger stated, \"The emigration of Jews from the Soviet Union is not an objective of American foreign policy, and if they put Jews into gas chambers in the Soviet Union, it is not an American concern. Maybe a humanitarian concern.\" Kissinger argued, however:\n\n1973 Yom Kippur War\n\nDocuments show that Kissinger delayed telling President Richard Nixon about the start of the Yom Kippur War in 1973 to keep him from interfering. On October 6, 1973, the Israelis informed Kissinger about the attack at 6 am; Kissinger waited nearly 3 and a half hours before he informed Nixon.\n\nAccording to Kissinger, in an interview in November 2013, he was notified at 6:30 a.m. (12:30 pm. Israel time) that war was imminent, and his urgent calls to the Soviets and Egyptians were ineffective. He says Golda Meir's decision not to preempt was wise and reasonable, balancing the risk of Israel looking like the aggressor and Israel's actual ability to strike within such a brief span of time.\n\nThe war began on October 6, 1973, when Egypt and Syria attacked Israel. Kissinger published lengthy telephone transcripts from this period in the 2002 book Crisis. On October 12, under Nixon's direction, and against Kissinger's initial advice, while Kissinger was on his way to Moscow to discuss conditions for a cease-fire, Nixon sent a message to Brezhnev giving Kissinger full negotiating authority.\n\nIsrael regained the territory it lost in the early fighting and gained new territories from Syria and Egypt, including land in Syria east of the previously captured Golan Heights, and additionally on the western bank of the Suez Canal, although they did lose some territory on the eastern side of the Suez Canal that had been in Israeli hands since the end of the Six Day War. Kissinger pressured the Israelis to cede some of the newly captured land back to its Arab neighbors, contributing to the first phases of Israeli-Egyptian non-aggression. The move saw a warming in U.S.–Egyptian relations, bitter since the 1950s, as the country moved away from its former independent stance and into a close partnership with the United States. The peace was finalized in 1978 when U.S. President Jimmy Carter mediated the Camp David Accords, during which Israel returned the Sinai Peninsula in exchange for an Egyptian peace agreement that included the recognition of the state of Israel.\n\nTurkish invasion of Cyprus\n\nFollowing a period of steady relations between the U.S. Government and the Greek military regime after 1967, Secretary of State Kissinger was faced with the coup by the Greek junta and the Turkish invasion of Cyprus in July and August 1974.  In an August 1974 edition of the New York Times, it was revealed that Kissinger and State Department were informed in advance οf the impending coup by the Greek junta in Cyprus. Indeed, according to the journalist,Article republished on the front page of the Greek newspaper To Vima, issue of Fr. August 2, 1974, article \"The Americans knew there was plan to overthrow Makarios\" [Οἱ Ἀμερικανοί ἐγνώριζον ὅτι ἑτοιμάζετο ἀνατροπή τοῦ Μακαρίου στήν Κύπρο] (photo-reprint in the book series \"To Vima- 90 years\", Lambrakis Press 2012, volume XI \"1972–1981\") the official version of events as told by the State Department was that it felt it had to warn the Greek military regime not to carry out the coup. The warning had been delivered by July 9, according to repeated assurances from its Athens services, that is, the U.S. embassy and the American ambassador Henry J. Tasca himself.\n\nIoannis Zigdis, then a Greek MP for Centre Union and former minister, stated in an Athenian newspaperFront page of the Greek newspaper To Vima, issue of Sa. August 17, 1974, articles \"Τhe Cyprus crisis is Kissinger's Watergate\" [Τό Κυπριακό εἶναι το Γουώτεργκέητ τοῦ κ. Κίσσινγκερ] and \"Anti-American youth demonstration in Thessaloniki and Heraklion\" [Ἀντιαμερικανική διαδήλωσις νέων εἰς τήν Θεσσαλονίκην και εἰς τό Ἡράκλειον] (photo-reprint in the book series \"To Vima- 90 years\", as above). that \"the Cyprus crisis will become Kissinger's Watergate\". Zigdis also stressed: “Not only did Kissinger know about the coup for the overthrow of Archbishop Makarios before July 15th, he also encouraged it, if he did not instigate it.”\n\nKissinger was a target of anti-American sentiment which was a significant feature of Greek public opinion at the time—particularly among young people—viewing the U.S. role in Cyprus as negative. In a demonstration by students in Heraklion, Crete,\"To Vima\" (August 17, 1974) original text passages on the demonstrations: Θεσσαλονίκη 16 Αὐγούστου. Σιωπηρά ἀντιαμερικανική διαδήλωση ἐπραγματοποίησαν σήμερα Κύπριοι φοιτηταί τοῦ Πανεπιστημόυ Θεσσαλονίκης [...]περίπου 150 διελήθησαν ἀργότερον ἡσύχως.[...] Ἡράκλειον 16 Αὐγούστου. Οἱ διαδηλωταί φέροντες ἑληνικάς σημαίας καί εἰκόνας τοῦ Καραμανλῆ καί τοῦ Μακαρίου περιήρχοντο μέχρις ἀργά τό βράδυ [...] κραυγάζοντες συνθήματα ὅπως \"Δολοφόνε Κίσσινγκερ\", \"Ἔξω οἱ Ἀμερικανοί\", \" Ὄχι διχοτόμηση\", \"Ζήτω ὁ Καρμανλῆς\", \"Ἑνωμένοι Ἕλληνες\", \"Συμπαράσταση Λαέ\", \"Ὄχι ἡ Κύπρος Βιετνάμ\". [...] ὑπολογίζονται δε εἰς  5.000\"  soon after the second phase of the Turkish invasion in August 1974, slogans such as \"Kissinger, murderer\", \"Americans get out\", \"No to Partition\" and \"Cyprus is no Vietnam\" were heard.\n\nSome years later, Kissinger expressed the opinion that the Cyprus issue was resolved in 1974, a position very similar to that held by Turkish prime minister Bulent Ecevit, who had ordered the invasion.\n\nLatin American policy\n\nThe United States continued to recognize and maintain relationships with non-left-wing governments, democratic and authoritarian alike. John F. Kennedy's Alliance for Progress was ended in 1973. In 1974, negotiations about a new settlement over the Panama Canal started. They eventually led to the Torrijos-Carter Treaties and the handing over of the Canal to Panamanian control.\n\nKissinger initially supported the normalization of United States-Cuba relations, broken since 1961 (all U.S.–Cuban trade was blocked in February 1962, a few weeks after the exclusion of Cuba from the Organization of American States because of U.S. pressure). However, he quickly changed his mind and followed Kennedy's policy. After the involvement of the Cuban Revolutionary Armed Forces in the independence struggles in Angola and Mozambique, Kissinger said that unless Cuba withdrew its forces relations would not be normalized. Cuba refused.\n\nIntervention in Chile\n\nChilean Socialist Party presidential candidate Salvador Allende was elected by a plurality of 36.2 percent in 1970, causing serious concern in Washington, D.C. due to his openly socialist and pro-Cuban politics. The Nixon administration, with Kissinger's input, authorized the Central Intelligence Agency (CIA) to encourage a military coup that would prevent Allende's inauguration, but the plan was not successful.[http://history-matters.com/archive/church/reports/ir/contents.htm Alleged Assassination Plots Involving Foreign Leaders (1975)], Church Committee, pages 246–247 and 250–254.\n\nUnited States-Chile relations remained frosty during Salvador Allende's tenure, following the complete nationalization of the partially U.S.-owned copper mines and the Chilean subsidiary of the U.S.-based ITT Corporation, as well as other Chilean businesses. The U.S. claimed that the Chilean government had greatly undervalued fair compensation for the nationalization by subtracting what it deemed \"excess profits\". Therefore, the U.S. implemented economic sanctions against Chile. The CIA also provided funding for the mass anti-government strikes in 1972 and 1973, and extensive black propaganda in the newspaper El Mercurio.\n\nThe most expeditious way to prevent Allende from assuming office was somehow to convince the Chilean congress to confirm Jorge Alessandri as the winner of the election. Once elected by the congress, Alessandri—a party to the plot through intermediaries—was prepared to resign his presidency within a matter of days so that new elections could be held. This first, nonmilitary, approach to stopping Allende was called the Track I approach. The CIA's second approach, the Track II approach, was designed to encourage a military overthrow.\n\nOn September 11, 1973, Allende died during a military coup launched by Army Commander-in-Chief Augusto Pinochet, who became President.\nA document released by the CIA in 2000 titled \"CIA Activities in Chile\" revealed that the United States, acting through the CIA, actively supported the military junta after the overthrow of Allende and that it made many of Pinochet's officers into paid contacts of the CIA or U.S. military.Peter Kornbluh, [http://www.gwu.edu/~nsarchiv/news/20000919/ CIA Acknowledges Ties to Pinochet’s Repression Report to Congress Reveals U.S. Accountability in Chile], Chile Documentation Project, National Security Archive, September 19, 2000. Retrieved November 26, 2006.\n\nIn 1976, Orlando Letelier, a Chilean opponent of the Pinochet regime, was assassinated in Washington, D.C. with a car bomb. Previously, Kissinger had helped secure his release from prison, and had chosen to cancel a letter to Chile warning them against carrying out any political assassinations. The U.S. ambassador to Chile, David H. Popper, said that Pinochet might take as an insult any inference that he was connected with assassination plots. It has been confirmed that Pinochet directly ordered the assassination. This murder was part of Operation Condor, a covert program of political repression and assassination carried out by Southern Cone nations that Kissinger has been accused of being involved in.Greg Grandin. [https://books.google.com/books?id\na0hsCgAAQBAJ&lpgPP1&pg\nPA151#vonepage&q&f\nfalse Kissinger's Shadow: The Long Reach of America's Most Controversial Statesman] Metropolitan Books, 2015. p. 151. \n\nOn September 10, 2001, the family of Chilean general René Schneider filed a suit against Kissinger, accusing him of collaborating in arranging Schneider's kidnapping which resulted in his death. According to phone records, Kissinger claimed to have \"turned off\" the operation. However, the CIA claimed that no such \"stand-down\" order was ever received,John Dinges. The Condor Years: How Pinochet And His Allies Brought Terrorism To Three Continents. The New Press, 2005. [https://books.google.com/books?id\n3JjtHROah_YC&lpgPP1&pg\nPA157#vonepage&q&f\nfalse p. 157].  and he and Nixon later joked that an \"incompetent\" CIA had struggled to kill Schneider.Greg Grandin. Kissinger's Shadow: The Long Reach of America's Most Controversial Statesman Metropolitan Books, 2015. p. 249.  A subsequent Congressional investigation found that the CIA was not directly involved in Schneider's death. The case was later dismissed by a U.S. District Court, citing separation of powers: \"The decision to support a coup of the Chilean government to prevent Dr. Allende from coming to power, and the means by which the United States Government sought to effect that goal, implicate policy makers in the murky realm of foreign affairs and national security best left to the political branches.\" Decades later the CIA admitted its involvement in the kidnapping of General Schneider, but not his murder, and subsequently paid the group responsible for his death $35,000 \"to keep the prior contact secret, maintain the goodwill of the group, and for humanitarian reasons.\"\n\nArgentina\n\nKissinger took a similar line as he had toward Chile when the Argentinian military, led by Jorge Videla, toppled the elected government of Isabel Perón in 1976 with a process called the National Reorganization Process by the military, with which they consolidated power, launching brutal reprisals and \"disappearances\" against political opponents. During a meeting with Argentinian foreign minister César Augusto Guzzetti, Kissinger assured him that the United States was an ally, but urged him to \"get back to normal procedures\" quickly before the U.S. Congress reconvened and had a chance to consider sanctions. According to declassified state department files, Kissinger also attempted to thwart the Carter Administration's efforts to halt the mass killings by the 1976-83 military dictatorship.\n\nRhodesia\n\nIn September 1976 Kissinger was actively involved in negotiations regarding the Rhodesian Bush War. Kissinger, along with South Africa's Prime Minister John Vorster, pressured Rhodesian Prime Minister Ian Smith to hasten the transition to black majority rule in Rhodesia. With FRELIMO in control of Mozambique and even South Africa withdrawing its support, Rhodesia's isolation was nearly complete. According to Smith's autobiography, Kissinger told Smith of Mrs. Kissinger's admiration for him, but Smith stated that he thought Kissinger was asking him to sign Rhodesia's \"death certificate\". Kissinger, bringing the weight of the United States, and corralling other relevant parties to put pressure on Rhodesia, hastened the end of minority-rule.\n\nEast Timor\n\nThe Portuguese decolonization process brought U.S. attention to the former Portuguese colony of East Timor, which lies within the Indonesian archipelago and declared its independence in 1975. Indonesian president Suharto was a strong U.S. ally in Southeast Asia and began to mobilize the Indonesian army, preparing to annex the nascent state, which had become increasingly dominated by the popular leftist Fretilin party. In December 1975, Suharto discussed the invasion plans during a meeting with Kissinger and President Ford in the Indonesian capital of Jakarta. Both Ford and Kissinger made clear that U.S. relations with Indonesia would remain strong and that it would not object to the proposed annexation. They only wanted it done \"fast\" and proposed that it be delayed until after they had returned to Washington.Agence France Press, \"US Endorsed Indonesia's East Timor Invasion: Secret Documents\", December 6, 2001 Accordingly, Suharto delayed the operation for one day. Finally on December 7 Indonesian forces invaded the former Portuguese colony. U.S. arms sales to Indonesia continued, and Suharto went ahead with the annexation plan. According to Ben Kiernan, the invasion and occupation resulted in the deaths of nearly a quarter of the Timorese population from 1975 to 1981.\n\nCuba\n\nIn February 1976 Kissinger considered launching air strikes against ports and military installations in Cuba, as well as deploying Marine battalions based at the US Navy base at Guantanamo Bay, in retaliation for Cuban President Fidel Castro's decision in late 1975 to send troops to Angola to help the newly independent nation fend off attacks from South Africa and right-wing guerrillas.\n\nLater roles\n\nKissinger left office when Democrat Jimmy Carter defeated Republican Gerald Ford in the 1976 presidential elections. Kissinger continued to participate in policy groups, such as the Trilateral Commission, and to maintain political consulting, speaking, and writing engagements.\n\nShortly after Kissinger left office in 1977, he was offered an endowed chair at Columbia University. There was significant student opposition to the appointment, which eventually became a subject of wide media commentary. Columbia canceled the appointment as a result.\n\nKissinger was then appointed to Georgetown University's Center for Strategic and International Studies. He taught at Georgetown's Edmund Walsh School of Foreign Service for several years in the late 1970s. In 1982, with the help of a loan from the international banking firm of E.M. Warburg, Pincus and Company, Kissinger founded a consulting firm, Kissinger Associates, and is a partner in affiliate Kissinger McLarty Associates with Mack McLarty, former chief of staff to President Bill Clinton. He also serves on the board of directors of Hollinger International, a Chicago-based newspaper group, and as of March 1999, was a director of Gulfstream Aerospace.\n\nFrom 1995 to 2001, Kissinger served on the board of directors for Freeport-McMoRan, a multinational copper and gold producer with significant mining and milling operations in Papua, Indonesia. In February 2000, then-president of Indonesia Abdurrahman Wahid appointed Kissinger as a political advisor. He also serves as an honorary advisor to the United States-Azerbaijan Chamber of Commerce.\n\nFrom 2000–2006, Kissinger served as chairman of the board of trustees of Eisenhower Fellowships. In 2006, upon his departure from Eisenhower Fellowships, he received the Dwight D. Eisenhower Medal for Leadership and Service.\n\nIn November 2002, he was appointed by President George W. Bush to chair the newly established National Commission on Terrorist Attacks Upon the United States to investigate the September 11 attacks. Kissinger stepped down as chairman on December 13, 2002 rather than reveal his business client list, when queried about potential conflicts of interest.\n\nKissinger—along with William Perry, Sam Nunn, and George Shultz—has called upon governments to embrace the vision of a world free of nuclear weapons, and in three Wall Street Journal op-eds proposed an ambitious program of urgent steps to that end. The four have created the Nuclear Security Project to advance this agenda. In 2010, the four were featured in a documentary film entitled \"Nuclear Tipping Point\". The film is a visual and historical depiction of the ideas laid forth in the Wall Street Journal op-eds and reinforces their commitment to a world without nuclear weapons and the steps that can be taken to reach that goal.\n\nOn November 17, 2016, Kissinger met with then President-elect Donald Trump during which they discussed global affairs. Kissinger also met with President Trump at the White House in May 2017.\n\nViews on U.S. foreign policy\n\nYugoslav wars\n\nIn several articles of his and interviews that he gave during the Yugoslav wars, he criticized the United States' policies in Southeast Europe, among other things for the recognition of Bosnia and Herzegovina as a sovereign state, which he described as a foolish act. Most importantly he dismissed the notion of Serbs, and Croats for that part, being aggressors or separatist, saying that \"they can't be separating from something that has never existed\".\nIn addition, he repeatedly warned the West of inserting itself into a conflict that has its roots at least hundreds of years back in time, and said that the West would do better if it allowed the Serbs and Croats to join their respective countries.\nKissinger shared similarly critical views on Western involvement in Kosovo. In particular, he held a disparaging view of the Rambouillet Agreement:\n\nHowever, as the Serbs did not accept the Rambouillet text and NATO bombings started, he opted for a continuation of the bombing as NATO's credibility was now at stake, but dismissed the use of ground forces, claiming that it was not worth it.\n\nIraq\n\nIn 2006, it was reported in the book State of Denial by Bob Woodward that Kissinger met regularly with President George W. Bush and Vice President Dick Cheney to offer advice on the Iraq War. Kissinger confirmed in recorded interviews with Woodward that the advice was the same as he had given in a column in The Washington Post on August 12, 2005: \"Victory over the insurgency is the only meaningful exit strategy.\"\n\nIn an interview on the BBC's Sunday AM on November 19, 2006, Kissinger was asked whether there is any hope left for a clear military victory in Iraq and responded, \"If you mean by 'military victory' an Iraqi government that can be established and whose writ runs across the whole country, that gets the civil war under control and sectarian violence under control in a time period that the political processes of the democracies will support, I don't believe that is possible. ... I think we have to redefine the course. But I don't believe that the alternative is between military victory as it had been defined previously, or total withdrawal.\"\n\nIn an April 3, 2008, interview with Peter Robinson of the Hoover Institution, Kissinger reiterated that even though he supported the 2003 invasion of Iraq he thought that the George W. Bush administration rested too much of its case for war on Saddam's supposed weapons of mass destruction. Robinson noted that Kissinger had criticized the administration for invading with too few troops, for disbanding the Iraqi Army, and for mishandling relations with certain allies.\n\nIndia\n\nKissinger said in April 2008 that \"India has parallel objectives to the United States,\" and he called it an ally of the U.S.\n\nChina\n\nKissinger was present at the opening ceremony of the 2008 Beijing Summer Olympics.\n\nIn 2011, Kissinger published On China, chronicling the evolution of Sino-American relations and laying out the challenges to a partnership of 'genuine strategic trust' between the U.S. and China.\n\nIran\n\nKissinger's position on this issue of U.S.–Iran talks was reported by the Tehran Times to be that \"Any direct talks between the U.S. and Iran on issues such as the nuclear dispute would be most likely to succeed if they first involved only diplomatic staff and progressed to the level of secretary of state before the heads of state meet.\" (Transcript of a Bloomberg reportinterview.) In 2016, Kissinger said \"I would not have made [the agreement], but we will not get a great deal out of ending it now,\" and that the biggest challenge facing the Middle East is the \"potential domination of the region by an Iran that is both imperial and jihadist.\"\n\n2014 Ukrainian crisis\n\nOn March 5, 2014, The Washington Post published an op-ed piece by Kissinger, 11 days before the Crimean referendum on whether Autonomous Republic of Crimea should officially rejoin in Ukraine or join neighboring Russia. In it, he attempted to balance the Ukrainian, Russian and Western desires for a functional state. He made four main points:\n# Ukraine should have the right to choose freely its economic and political associations, including with Europe;\n# Ukraine should not join NATO, a repetition of the position he took seven years before;\n# Ukraine should be free to create any government compatible with the expressed will of its people. Wise Ukrainian leaders would then opt for a policy of reconciliation between the various parts of their country. He imagined an international position for Ukraine like that of Finland.\n# Ukraine should maintain sovereignty over Crimea.\n\nKissinger also wrote: \"The west speaks Ukrainian; the east speaks mostly Russian. Any attempt by one wing of Ukraine to dominate the other—as has been the pattern—would lead eventually to civil war or break up.\"\n\nFollowing the publication of his book titled World Order, Kissinger participated in an interview with Charlie Rose and updated his position on Ukraine, which he sees as a possible geographical mediator between Russia and the West.Charlie Rose, PBS, September 2014. In a question he posed to himself for illustration regarding re-conceiving policy regarding Ukraine, Kissinger stated: \"If Ukraine is considered an outpost, then the situation is that its eastern border is the NATO strategic line, and NATO will be within 200 mi of Volgograd. That will never be accepted by Russia. On the other hand, if the Russian western line is at the border of Poland, Europe will be permanently disquieted. The Strategic objective should have been to see whether one can build Ukraine as a bridge between East and West, and whether one can do it as a kind of a joint effort.\"Charlie Rose, reported in Bloomberg BusinessWeek, page 20, October 2, 2014.\n\nIn December 2016, Kissinger advised then President-elect Donald Trump to accept \"Crimea as a part of Russia\" in an attempt to secure a rapprochement between the United States and Russia, whose relations soured as a result of the Crimean crisis.\n\nPublic perception\n\nAt the height of Kissinger's prominence, many commented on his wit. In February 1972, at the Washington Press Club annual congressional dinner, \"Kissinger mocked his reputation as a secret swinger.\"\"[http://www.time.com/time/magazine/article/0,9171,905709,00.html Henry Kissinger Off Duty].\" Time, February 7, 1972. The insight, \"Power is the ultimate aphrodisiac\", is widely attributed to him, although Kissinger was paraphrasing Napoleon Bonaparte. Some scholars have ranked Kissinger as the most effective U.S. Secretary of State in the 50 years to 2015. A number of activists and human rights lawyers, however, have sought his prosecution for alleged war crimes. According to historian and Kissinger biographer Niall Ferguson, however, accusing Kissinger alone of war crimes \"requires a double standard\" because \"nearly all the secretaries of state ... and nearly all the presidents\" have taken similar actions.\n\nKissinger was interviewed in Back Door Channels: The Price of Peace, a documentary examining the underpinnings of the 1979 peace treaty between Israel and Egypt. In the film, Kissinger revealed how close he felt the world came to nuclear war during the 1973 Yom Kippur War launched by Egypt and Syria against Israel.\n\nAttempts have been made to attach liability to Kissinger for injustices in American foreign policy during his tenure in government.  In September 2001, relatives and survivors of General Rene Schneider, the former head of the Chilean general staff, commenced civil proceedings in Federal Court in Washington, DC, and, in April 2002, a petition for Kissinger's arrest was filed in the High Court in London by human rights campaigner Peter Tatchell, citing the destruction of civilian populations and the environment in Indochina during the years 1969–75.  Both suits were determined to lack legal foundation and were dismissed before trial.[http://www.smh.com.au/articles/2002/04/29/1019441343996.html \"Why the law wants a word with Kissinger\"], Fairfax Digital, April 30, 2002 British-American journalist and author Christopher Hitchens authored The Trial of Henry Kissinger, in which Hitchens calls for the prosecution of Kissinger \"for war crimes, for crimes against humanity, and for offenses against common or customary or international law, including conspiracy to commit murder, kidnap, and torture\".\"How Can Anyone Defend Kissinger Now? The Nixon tapes remind us what a vile creature Henry Kissinger is\", Slate, December 13, 2010, http://www.slate.com/articles/news_and_politics/fighting_words/2010/12/how_can_anyone_defend_kissinger_now.html . Retrieved January 8, 2016.\n Critics on the right, such as Ray Takeyh, have faulted Kissinger for his role in the Nixon administration's opening to China and secret negotiations with North Vietnam. Takeyh writes that while rapprochement with China was a worthy goal, the Nixon administration failed to achieve any meaningful concessions from Chinese officials in return, as China continued to support North Vietnam and various \"revolutionary forces throughout the Third World,\" \"nor does there appear to be even a remote, indirect connection between Nixon and Kissinger's diplomacy and the communist leadership's decision, after Mao's bloody rule, to move away from a communist economy towards state capitalism.\" On Vietnam, Takeyh claims that Kissinger's negotiations with Le Duc Tho were intended only \"to secure a 'decent interval' between America's withdrawal and South Vietnam's collapse.\" Johannes Kadura offers a more positive assessment of Nixon and Kissinger's strategy, arguing that the two men \"simultaneously maintained a Plan A of further supporting Saigon and a Plan B of shielding Washington should their maneuvers prove futile.\" According to Kadura, the \"decent interval\" concept has been \"largely misrepresented,\" in that Nixon and Kissinger \"sought to gain time, make the North turn inward, and create a perpetual equilibrium\" rather than acquiescing in the collapse of South Vietnam, but the strength of the anti-war movement and the sheer unpredictability of events in Indochina compelled them to prepare for the possibility that South Vietnam might collapse despite their best efforts. Kadura concludes: \"Without Nixon, Kissinger, and Ford's clever use of triangular diplomacy ... The Soviets and the Chinese could have been tempted into a far more aggressive stance\" following the \"U.S. defeat in Indochina\" than actually occurred. In 2011, Chimerica Media released an interview-based documentary, titled Kissinger, in which Kissinger \"reflects on some of his most important and controversial decisions\" during his tenure as Secretary of State.\n\nKissinger's record was brought up during the 2016 Democratic Party presidential primaries. Hillary Clinton had cultivated a close relationship with Kissinger, describing him as a \"friend\" and a source of \"counsel.\" During the Democratic Primary Debates, Clinton touted Kissinger's praise for her record as Secretary of State. In response, candidate Bernie Sanders issued a critique of Kissinger's foreign policy, declaring: \"I am proud to say that Henry Kissinger is not my friend. I will not take advice from Henry Kissinger.\"\n\nFamily and personal life\n\nKissinger married Ann Fleischer on February 6, 1949. They had two children, Elizabeth and David, and divorced in 1964. On March 30, 1974, he married Nancy Maginnes.[https://books.google.com/books?id7IsYAAAAIAAJ&q\nann+fleischer+kissinger+6+feb+1949+divorced+1964&dqann+fleischer+kissinger+6+feb+1949+divorced+1964&hl\nen&saX&ved\n0ahUKEwjY_duprtnXAhXN66QKHTGCA3sQ6AEIPjAG] They now live in Kent, Connecticut and in New York City. Kissinger's son David Kissinger served as an executive with NBCUniversal before becoming head of Conaco, Conan O'Brien's production company. In February 1982, Kissinger underwent coronary bypass surgery at the age of 58.\n\nKissinger described Diplomacy as his favorite game in a 1973 interview.Games & Puzzles magazine, May 1973.\n\nSoccer\n\nKissinger was described by Daryl Grove as one of the most influential people in the growth of soccer in the United States.[http://www.americansoccernow.com/articles/the-most-influential-people-in-american-soccer \"The Five Most Influential People in American Soccer\"], American Soccer Now, Daryl Grove, February 18, 2013.\nKissinger was named chairman of the North American Soccer League board of directors in 1978.\n\nSince his childhood, Kissinger has been a fan of his hometown's soccer club, SpVgg Greuther Fürth. Even during his time in office he was informed about the team's results by the German Embassy every Monday morning. He is an honorary member with lifetime season-tickets. In September 2012 Kissinger attended a home game in which SpVgg Greuther Fürth lost, 0–2, against Schalke after promising years ago he would attend a Greuther Fürth home game if they were promoted to the Bundesliga, the top football league in Germany, from the 2. Bundesliga.\nKissinger is an honorary member of the German soccer club FC Bayern München.\n\nAwards, honors, and associations\n\n* Kissinger and Le Duc Tho were jointly offered the 1973 Nobel Peace Prize for their work on the Paris Peace Accords which prompted the withdrawal of American forces from the Vietnam war. (Le Duc Tho declined to accept the award on the grounds that such \"bourgeois sentimentalities\" were not for him[40] and that peace had not actually been achieved in Vietnam. Kissinger donated his prize money to charity, did not attend the award ceremony and would later offer to return his prize medal after the fall of South Vietnam to North Vietnamese forces 18 months later.[40])\n* In 1973, Kissinger received the U.S. Senator John Heinz Award for Greatest Public Service by an Elected or Appointed Official, an award given out annually by Jefferson Awards.\n* In 1976, Kissinger became the first honorary member of the Harlem Globetrotters.\n\n* On January 13, 1977, Kissinger received the Presidential Medal of Freedom from President Gerald Ford.\n* In 1980, Kissinger won the National Book Award in HistoryThis was the 1980 award for hardcover History. From 1980 to 1983 there were dual hardcover and paperback awards in most categories, and multiple nonfiction subcategories. Most of the paperback award-winners were reprints, including Kissinger's. for the first volume of his memoirs, The White House Years.[http://www.nationalbook.org/nba1980.html \"National Book Awards – 1980\"]. National Book Foundation. Retrieved March 16, 2012.\n* In 1995, he was made an honorary Knight Commander of the Most Distinguished Order of St Michael and St George.[http://www.highbeam.com/doc/1O47-KissingerHenryAlfred.html Kissinger, Henry Alfred] in Who's Who in the Twentieth Century, Oxford University Press, 1999\n* In 2000, Kissinger received the Sylvanus Thayer Award at United States Military Academy at West Point.\n* In 2002, Kissinger became an honorary member of the International Olympic Committee.International Olympic Committee: [http://www.olympic.org/mr-henry-kissinger Mr Henry Kissinger]. Retrieved February 20, 2014.\n* On March 1, 2012, Kissinger was awarded Israel's President's Medal.\n* In October 2013, Kissinger was awarded the Henry A. Grunwald Award for Public Service by Lighthouse International\n* Kissinger was a member of the Founding Council of the Rothermere American Institute, University of Oxford.\n* Kissinger is a member of the following groups:\n** Aspen Institute\n** Atlantic Council\n** Bilderberg Group\n** Bohemian Club\n** Council on Foreign Relations\n** Center for Strategic and International Studies\n* Kissinger served on the board of Theranos, a health technology company, from 2014 to 2017.\n* He received the Theodore Roosevelt American Experience Award from the Union League Club of New York in 2009.\n\nWritings: major books\n\nMemoirs\n\n* 1979. The White House Years.  (National Book Award, History Hardcover)\n* 1982. Years of Upheaval. \n* 1999. Years of Renewal. \n\nPublic policy\n\n* 1957. A World Restored: Metternich, Castlereagh and the Problems of Peace, 1812–22. \n* 1957. Nuclear Weapons and Foreign Policy.  (1984 edition)\n* 1961. The Necessity for Choice: Prospects of American Foreign Policy. \n* 1965. The Troubled Partnership: A Re-Appraisal of the Atlantic Alliance. \n* 1969. American Foreign Policy: Three Essays. \n* 1981. For the Record: Selected Statements 1977–1980. \n* 1985. Observations: Selected Speeches and Essays 1982–1984. \n* 1994. Diplomacy. \n* 1999. Kissinger Transcripts: The Top Secret Talks With Beijing and Moscow (Henry Kissinger, William Burr). \n* 2001. Does America Need a Foreign Policy? Toward a Diplomacy for the 21st Century. \n* 2002. Vietnam: A Personal History of America's Involvement in and Extrication from the Vietnam War. \n* 2003. Crisis: The Anatomy of Two Major Foreign Policy Crises: Based on the Record of Henry Kissinger's Hitherto Secret Telephone Conversations. \n* 2011. On China (New York: Penguin Press, 2011). .\n* 2014. World Order (New York: Penguin Press, September 9, 2014). .\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Henry Kissinger" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13765" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Henry Alfred Kissinger (; born Heinz Alfred Kissinger,; May 27, 1923) is an American political scientist, diplomat and geopolitical consultant who served as the United States Secretary of State and National Security Advisor under the presidential administrations of Richard Nixon and Gerald Ford. A Jewish refugee who fled Nazi Germany with his family in 1938, he became National Security Advisor in 1969 and United States Secretary of State in 1973. For his actions negotiating a ceasefire in Vietnam, Kissinger received the 1973 Nobel Peace Prize under controversial circumstances, with two members of the committee resigning in protest. Kissinger later sought, unsuccessfully, to return the prize after the ceasefire failed.\n\nA practitioner of Realpolitik, Kissinger played a prominent role in United States foreign policy between 1969 and 1977. During this period, he pioneered the policy of détente with the Soviet Union, orchestrated the opening of relations with the People's Republic of China, and negotiated the Paris Peace Accords, ending American involvement in the Vietnam War. Kissinger has also been associated with such controversial policies as U.S. involvement in a military coup in Chile and U.S. support for Pakistan during the Bangladesh War despite a genocide. After leaving government, he formed Kissinger Associates, an international geopolitical consulting firm. Kissinger has been a prolific author of books on diplomatic history and international relations with over one dozen books authored.\n\nSome journalists, activists, and human rights lawyers have condemned Kissinger as a war criminal. \"[…] many consider Kissinger a war criminal, most famously Christopher Hitchens, who, in a lengthy two-part article for Harper’s in 2001 (later expanded into the book and documentary, The Trial of Henry Kissinger), laid out his case that Kissinger should be brought up on charges 'for war crimes, for crimes against humanity, and for offenses against common or customary or international law, including conspiracy to commit murder, kidnap, and torture'. He remains a controversial figure in popular culture.  However, in a 2014 survey, many scholars and foreign policy experts ranked Henry Kissinger as the most effective U.S. Secretary of State since 1965.\n\nEarly life and education\n\nKissinger was born Heinz Alfred Kissinger in Fürth, Bavaria, Germany, in 1923 during the Weimar Republic, to a family of German Jews. His father, Louis Kissinger (1887–1982), was a schoolteacher. His mother, Paula (Stern) Kissinger (1901–1998), from Leutershausen, was a homemaker. Kissinger has a younger brother, Walter Kissinger (born 1924). The surname Kissinger was adopted in 1817 by his great-great-grandfather Meyer Löb, after the Bavarian spa town of Bad Kissingen. As a youth, Heinz enjoyed playing soccer, and played for the youth wing of his favorite club, SpVgg Fürth, which was one of the nation's best clubs at the time. In 1938, fleeing Nazi persecution, his family moved to London, England, before arriving in New York on September 5.\n\nKissinger spent his high school years in the Washington Heights section of Upper Manhattan as part of the German Jewish immigrant community that resided there at the time. Although Kissinger assimilated quickly into American culture, he never lost his pronounced German accent, due to childhood shyness that made him hesitant to speak. Following his first year at George Washington High School, he began attending school at night and worked in a shaving brush factory during the day.\n\nFollowing high school, Kissinger enrolled in the City College of New York, studying accounting. He excelled academically as a part-time student, continuing to work while enrolled. His studies were interrupted in early 1943, when he was drafted into the U.S. Army.\n\nArmy experience\n\nKissinger underwent basic training at Camp Croft in Spartanburg, South Carolina. On June 19, 1943, while stationed in South Carolina, at the age of 20 years, he became a naturalized U.S. citizen. The army sent him to study engineering at Lafayette College, Pennsylvania, but the program was canceled, and Kissinger was reassigned to the 84th Infantry Division. There, he made the acquaintance of Fritz Kraemer, a fellow Jewish immigrant from Germany who noted Kissinger's fluency in German and his intellect, and arranged for him to be assigned to the military intelligence section of the division. Kissinger saw combat with the division, and volunteered for hazardous intelligence duties during the Battle of the Bulge.\n\nDuring the American advance into Germany, Kissinger, only a private, was put in charge of the administration of the city of Krefeld, owing to a lack of German speakers on the division's intelligence staff. Within eight days he had established a civilian administration. Kissinger was then reassigned to the Counter Intelligence Corps (CIC), with the rank of sergeant. He was given charge of a team in Hanover assigned to tracking down Gestapo officers and other saboteurs, for which he was awarded the Bronze Star. In June 1945, Kissinger was made commandant of the Bensheim metro CIC detachment, Bergstrasse district of Hesse, with responsibility for de-Nazification of the district. Although he possessed absolute authority and powers of arrest, Kissinger took care to avoid abuses against the local population by his command.\n\nIn 1946, Kissinger was reassigned to teach at the European Command Intelligence School at Camp King and, as a civilian employee following his separation from the army, continued to serve in this role.\n\nAcademic career\n\nHenry Kissinger received his AB degree summa cum laude, Phi Beta Kappa in political science from Harvard College in 1950, where he lived in Adams House and studied under William Yandell Elliott. He received his MA and PhD degrees at Harvard University in 1951 and 1954, respectively. In 1952, while still a graduate student at Harvard, he served as a consultant to the director of the Psychological Strategy Board. His doctoral dissertation was titled \"Peace, Legitimacy, and the Equilibrium (A Study of the Statesmanship of Castlereagh and Metternich)\".\n\nKissinger remained at Harvard as a member of the faculty in the Department of Government and, with Robert R. Bowie, co-founded the Center for International Affairs in 1958 where he served as associate director. In 1955, he was a consultant to the National Security Council's Operations Coordinating Board. During 1955 and 1956, he was also study director in nuclear weapons and foreign policy at the Council on Foreign Relations. He released his book Nuclear Weapons and Foreign Policy the following year. From 1956 to 1958 he worked for the Rockefeller Brothers Fund as director of its Special Studies Project. He was director of the Harvard Defense Studies Program between 1958 and 1971. He was also director of the Harvard International Seminar between 1951 and 1971. Outside of academia, he served as a consultant to several government agencies and think tanks, including the Operations Research Office, the Arms Control and Disarmament Agency, Department of State, and the RAND Corporation.\n\nKeen to have a greater influence on U.S. foreign policy, Kissinger became foreign policy advisor to the presidential campaigns of Nelson Rockefeller, supporting his bids for the Republican nomination in 1960, 1964, and 1968. After Richard Nixon won the presidency in 1968, he made Kissinger National Security Advisor.\n\nForeign policy\n\nKissinger served as National Security Advisor and Secretary of State under President Richard Nixon, and continued as Secretary of State under Nixon's successor Gerald Ford.  On Nixon's last full day in office, in the meeting where he informed Ford of his intention to resign the next day, he advised Ford that he felt it was very important that he keep Kissinger in his new administration, to which Ford agreed.[https://www.youtube.com/watch?vie98956ibMA&t\n40 President Nixon recalls his final full day], video interview with former White House Aide Frank Gannon, June 10, 1983 (Richard Nixon Library, published to YouTube on August 7, 2014)\n\nA proponent of Realpolitik, Kissinger played a dominant role in United States foreign policy between 1969 and 1977. In that period, he extended the policy of détente. This policy led to a significant relaxation in US–Soviet tensions and played a crucial role in 1971 talks with Chinese Premier Zhou Enlai. The talks concluded with a rapprochement between the United States and the People's Republic of China, and the formation of a new strategic anti-Soviet Sino-American alignment. He was jointly awarded the 1973 Nobel Peace Prize with Lê Đức Thọ for helping to establish a ceasefire and U.S. withdrawal from Vietnam. The ceasefire, however, was not durable. Thọ declined to accept the award and Kissinger appeared deeply ambivalent about it (donating his prize money to charity, not attending the award ceremony and later offering to return his prize medal[40]). As National Security Advisor, in 1974 Kissinger directed the much-debated National Security Study Memorandum 200.\n\nDétente and the opening to China\n\nAs National Security Advisor under Nixon, Kissinger pioneered the policy of détente with the Soviet Union, seeking a relaxation in tensions between the two superpowers. As a part of this strategy, he negotiated the Strategic Arms Limitation Talks (culminating in the SALT I treaty) and the Anti-Ballistic Missile Treaty with Leonid Brezhnev, General Secretary of the Soviet Communist Party. Negotiations about strategic disarmament were originally supposed to start under the Johnson Administration but were postponed in protest upon the invasion by Warsaw Pact troops of Czechoslovakia in August 1968.\n\nKissinger sought to place diplomatic pressure on the Soviet Union. He made two trips to the People's Republic of China in July and October 1971 (the first of which was made in secret) to confer with Premier Zhou Enlai, then in charge of Chinese foreign policy. According to Kissinger's book, \"The White House Years\" and \"On China\", the first secret China trip was arranged through Pakistani and Romanian\"On China\" by H. Kissinger diplomatic and Presidential involvement, as there were no direct communication channels between the states.  His trips paved the way for the groundbreaking 1972 summit between Nixon, Zhou, and Communist Party of China Chairman Mao Zedong, as well as the formalization of relations between the two countries, ending 23 years of diplomatic isolation and mutual hostility. The result was the formation of a tacit strategic anti-Soviet alliance between China and the United States.\n\nWhile Kissinger's diplomacy led to economic and cultural exchanges between the two sides and the establishment of Liaison Offices in the Chinese and American capitals, with serious implications for Indochinese matters, full normalization of relations with the People's Republic of China would not occur until 1979, because the Watergate scandal overshadowed the latter years of the Nixon presidency and because the United States continued to recognize the government of Taiwan.\n\nIn September 1989, the Wall Street Journal's John Fialka disclosed that Kissinger took a direct economic interest in US-China relations in March 1989 with the establishment of China Ventures, Inc., a Delaware limited partnership, of which he was chairman of the board and chief executive officer.  A US$75 million investment in a joint venture with the Communist Party government's primary commercial vehicle at the time, China International Trust & Investment Corporation (CITIC), was its purpose.  Board members were major clients of Kissinger Associates.  Kissinger was criticised for not disclosing his role in the venture when called upon by ABC's Peter Jennings to comment the morning after the June 4, 1989, Tiananmen crackdown.  Kissinger's position was generally supportive of Deng Xiaoping's clearance of the square and he opposed economic sanctions.\n\nVietnam War\n\nKissinger's involvement in Indochina started prior to his appointment as National Security Adviser to Nixon. While still at Harvard, he had worked as a consultant on foreign policy to both the White House and State Department. Kissinger says that \"In August 1965 ... [Henry Cabot Lodge, Jr.], an old friend serving as Ambassador to Saigon, had asked me to visit Vietnam as his consultant. I toured Vietnam first for two weeks in October and November 1965, again for about ten days in July 1966, and a third time for a few days in October 1966 ... Lodge gave me a free hand to look into any subject of my choice\". He became convinced of the meaninglessness of military victories in Vietnam, \"... unless they brought about a political reality that could survive our ultimate withdrawal\". In a 1967 peace initiative, he would mediate between Washington and Hanoi.\n\nNixon had been elected in 1968 on the promise of achieving \"peace with honor\" and ending the Vietnam War. In office, and assisted by Kissinger, Nixon implemented a policy of Vietnamization that aimed to gradually withdraw U.S. troops while expanding the combat role of the South Vietnamese Army so that it would be capable of independently defending its government against the National Front for the Liberation of South Vietnam, a Communist guerrilla organization, and North Vietnamese army (Vietnam People's Army or PAVN). Kissinger played a key role in bombing Cambodia to disrupt PAVN and Viet Cong units launching raids into South Vietnam from within Cambodia's borders and resupplying their forces by using the Ho Chi Minh trail and other routes, as well as the 1970 Cambodian Incursion and subsequent widespread bombing of Khmer Rouge targets in Cambodia. The bombing campaign contributed to the chaos of the Cambodian Civil War, which saw the forces of leader Lon Nol unable to retain foreign support to combat the growing Khmer Rouge insurgency that would overthrow him in 1975. Documents uncovered from the Soviet archives after 1991 reveal that the North Vietnamese invasion of Cambodia in 1970 was launched at the explicit request of the Khmer Rouge and negotiated by Pol Pot's then second in command, Nuon Chea.Dmitry Mosyakov, \"The Khmer Rouge and the Vietnamese Communists: A History of Their Relations as Told in the Soviet Archives\", in Susan E. Cook, ed., Genocide in Cambodia and Rwanda (Yale Genocide Studies Program Monograph Series No. 1, 2004), p. 54ff. Available online at: www.yale.edu/gsp/publications/Mosyakov.doc \"In April–May 1970, many North Vietnamese forces entered Cambodia in response to the call for help addressed to Vietnam not by Pol Pot, but by his deputy Nuon Chea. Nguyen Co Thach recalls: \"Nuon Chea has asked for help and we have liberated five provinces of Cambodia in ten days.\" The American bombing of Cambodia resulted in 40,000Marek Sliwinski, Le Génocide Khmer Rouge: Une Analyse Démographique (L’Harmattan, 1995), pp. 41–48.-150,000 deaths from 1969 to 1973, including at least 5,000 civilians. Kissinger himself said there were about 50,000 civilian casualties in the bombing.Karen Coates and Jerry Redfern (September 18, 2014). [https://www.washingtonpost.com/posteverything/wp/2014/09/18/henry-kissinger-is-not-telling-the-truth-about-his-past-again/?tid=a_inl Henry Kissinger is not telling the truth about his past. Again]. The Washington Post. Retrieved October 16, 2016. Pol Pot biographer David P. Chandler argues that the bombing \"had the effect the Americans wanted—it broke the Communist encirclement of Phnom Penh.\"Chandler, David 2000, Brother Number One: A Political Biography of Pol Pot, Revised Edition, Chiang Mai, Thailand: Silkworm Books, pp. 96–97. However, Ben Kiernan and Taylor Owen suggest that \"the bombs drove ordinary Cambodians into the arms of the Khmer Rouge, a group that seemed initially to have slim prospects of revolutionary success.\"\n\nAlong with North Vietnamese Politburo Member Le Duc Tho, Kissinger was awarded the Nobel Peace Prize on December 10, 1973, for their work in negotiating the ceasefires contained in the Paris Peace Accords on \"Ending the War and Restoring Peace in Vietnam\", signed the previous January. According to Irwin Abrams, this prize was the most controversial to date. For the first time in the history of the Peace Prize, two members left the Nobel Committee in protest. Tho rejected the award, telling Kissinger that peace had not been restored in South Vietnam.Le Duc Tho to Henry Kissinger, October 27, 1973. Kissinger wrote to the Nobel Committee that he accepted the award \"with humility,\"\n and \"donated the entire proceeds to the children of American servicemembers killed or missing in action in Indochina.\" After the Fall of Saigon in 1975, Kissinger attempted to return the award.\n\nBangladesh War\n\nUnder Kissinger's guidance, the United States government supported Pakistan in the Bangladesh Liberation War in 1971. Kissinger was particularly concerned about the expansion of Soviet influence in the Indian Subcontinent as a result of a treaty of friendship recently signed by India and the USSR, and sought to demonstrate to the People's Republic of China (Pakistan's ally and an enemy of both India and the USSR) the value of a tacit alliance with the United States.\n\nKissinger sneered at people who \"bleed\" for \"the dying Bengalis\" and ignored the first telegram from the United States consul general in East Pakistan, Archer K. Blood, and 20 members of his staff, which informed the US that their allies West Pakistan were undertaking, in Blood's words, \"a selective genocide\". In the second, more famous, Blood Telegram the word genocide was again used to describe the events, and further that with its continuing support for West Pakistan the US government had \"evidenced [...] moral bankruptcy\".\nAs a direct response to the dissent against US policy Kissinger and Nixon ended Archer Blood's tenure as United States consul general in East Pakistan and put him to work in the State Department's Personnel Office.\n\nHenry Kissinger had also come under fire for private comments he made to Nixon during the Bangladesh–Pakistan War in which he described Indian Prime Minister Indira Gandhi as a \"bitch\" and a \"witch\". He also said \"The Indians are bastards\", shortly before the war. Kissinger has since expressed his regret over the comments.\n\nIsraeli policy and Soviet Jewry\n\nAccording to notes taken by H. R. Haldeman, Nixon \"ordered his aides to exclude all Jewish-Americans from policy-making on Israel\", including Kissinger.Chait, Jonathan (December 10, 2010) [http://www.tnr.com/blog/jonathan-chait/79829/nixon-disallowed-jewish-advisors-discussing-israel-policy Nixon Disallowed Jewish Advisors From Discussing Israel Policy], The New Republic One note quotes Nixon as saying \"get K. [Kissinger] out of the play—Haig handle it\".\n\nIn 1973, Kissinger did not feel that pressing the Soviet Union concerning the plight of Jews being persecuted there was in the interest of U.S. foreign policy. In conversation with Nixon shortly after a meeting with Israeli Prime Minister Golda Meir on March 1, 1973, Kissinger stated, \"The emigration of Jews from the Soviet Union is not an objective of American foreign policy, and if they put Jews into gas chambers in the Soviet Union, it is not an American concern. Maybe a humanitarian concern.\" Kissinger argued, however:\n\n1973 Yom Kippur War\n\nDocuments show that Kissinger delayed telling President Richard Nixon about the start of the Yom Kippur War in 1973 to keep him from interfering. On October 6, 1973, the Israelis informed Kissinger about the attack at 6 am; Kissinger waited nearly 3 and a half hours before he informed Nixon.\n\nAccording to Kissinger, in an interview in November 2013, he was notified at 6:30 a.m. (12:30 pm. Israel time) that war was imminent, and his urgent calls to the Soviets and Egyptians were ineffective. He says Golda Meir's decision not to preempt was wise and reasonable, balancing the risk of Israel looking like the aggressor and Israel's actual ability to strike within such a brief span of time.\n\nThe war began on October 6, 1973, when Egypt and Syria attacked Israel. Kissinger published lengthy telephone transcripts from this period in the 2002 book Crisis. On October 12, under Nixon's direction, and against Kissinger's initial advice, while Kissinger was on his way to Moscow to discuss conditions for a cease-fire, Nixon sent a message to Brezhnev giving Kissinger full negotiating authority.\n\nIsrael regained the territory it lost in the early fighting and gained new territories from Syria and Egypt, including land in Syria east of the previously captured Golan Heights, and additionally on the western bank of the Suez Canal, although they did lose some territory on the eastern side of the Suez Canal that had been in Israeli hands since the end of the Six Day War. Kissinger pressured the Israelis to cede some of the newly captured land back to its Arab neighbors, contributing to the first phases of Israeli-Egyptian non-aggression. The move saw a warming in U.S.–Egyptian relations, bitter since the 1950s, as the country moved away from its former independent stance and into a close partnership with the United States. The peace was finalized in 1978 when U.S. President Jimmy Carter mediated the Camp David Accords, during which Israel returned the Sinai Peninsula in exchange for an Egyptian peace agreement that included the recognition of the state of Israel.\n\nTurkish invasion of Cyprus\n\nFollowing a period of steady relations between the U.S. Government and the Greek military regime after 1967, Secretary of State Kissinger was faced with the coup by the Greek junta and the Turkish invasion of Cyprus in July and August 1974.  In an August 1974 edition of the New York Times, it was revealed that Kissinger and State Department were informed in advance οf the impending coup by the Greek junta in Cyprus. Indeed, according to the journalist,Article republished on the front page of the Greek newspaper To Vima, issue of Fr. August 2, 1974, article \"The Americans knew there was plan to overthrow Makarios\" [Οἱ Ἀμερικανοί ἐγνώριζον ὅτι ἑτοιμάζετο ἀνατροπή τοῦ Μακαρίου στήν Κύπρο] (photo-reprint in the book series \"To Vima- 90 years\", Lambrakis Press 2012, volume XI \"1972–1981\") the official version of events as told by the State Department was that it felt it had to warn the Greek military regime not to carry out the coup. The warning had been delivered by July 9, according to repeated assurances from its Athens services, that is, the U.S. embassy and the American ambassador Henry J. Tasca himself.\n\nIoannis Zigdis, then a Greek MP for Centre Union and former minister, stated in an Athenian newspaperFront page of the Greek newspaper To Vima, issue of Sa. August 17, 1974, articles \"Τhe Cyprus crisis is Kissinger's Watergate\" [Τό Κυπριακό εἶναι το Γουώτεργκέητ τοῦ κ. Κίσσινγκερ] and \"Anti-American youth demonstration in Thessaloniki and Heraklion\" [Ἀντιαμερικανική διαδήλωσις νέων εἰς τήν Θεσσαλονίκην και εἰς τό Ἡράκλειον] (photo-reprint in the book series \"To Vima- 90 years\", as above). that \"the Cyprus crisis will become Kissinger's Watergate\". Zigdis also stressed: “Not only did Kissinger know about the coup for the overthrow of Archbishop Makarios before July 15th, he also encouraged it, if he did not instigate it.”\n\nKissinger was a target of anti-American sentiment which was a significant feature of Greek public opinion at the time—particularly among young people—viewing the U.S. role in Cyprus as negative. In a demonstration by students in Heraklion, Crete,\"To Vima\" (August 17, 1974) original text passages on the demonstrations: Θεσσαλονίκη 16 Αὐγούστου. Σιωπηρά ἀντιαμερικανική διαδήλωση ἐπραγματοποίησαν σήμερα Κύπριοι φοιτηταί τοῦ Πανεπιστημόυ Θεσσαλονίκης [...]περίπου 150 διελήθησαν ἀργότερον ἡσύχως.[...] Ἡράκλειον 16 Αὐγούστου. Οἱ διαδηλωταί φέροντες ἑληνικάς σημαίας καί εἰκόνας τοῦ Καραμανλῆ καί τοῦ Μακαρίου περιήρχοντο μέχρις ἀργά τό βράδυ [...] κραυγάζοντες συνθήματα ὅπως \"Δολοφόνε Κίσσινγκερ\", \"Ἔξω οἱ Ἀμερικανοί\", \" Ὄχι διχοτόμηση\", \"Ζήτω ὁ Καρμανλῆς\", \"Ἑνωμένοι Ἕλληνες\", \"Συμπαράσταση Λαέ\", \"Ὄχι ἡ Κύπρος Βιετνάμ\". [...] ὑπολογίζονται δε εἰς  5.000\"  soon after the second phase of the Turkish invasion in August 1974, slogans such as \"Kissinger, murderer\", \"Americans get out\", \"No to Partition\" and \"Cyprus is no Vietnam\" were heard.\n\nSome years later, Kissinger expressed the opinion that the Cyprus issue was resolved in 1974, a position very similar to that held by Turkish prime minister Bulent Ecevit, who had ordered the invasion.\n\nLatin American policy\n\nThe United States continued to recognize and maintain relationships with non-left-wing governments, democratic and authoritarian alike. John F. Kennedy's Alliance for Progress was ended in 1973. In 1974, negotiations about a new settlement over the Panama Canal started. They eventually led to the Torrijos-Carter Treaties and the handing over of the Canal to Panamanian control.\n\nKissinger initially supported the normalization of United States-Cuba relations, broken since 1961 (all U.S.–Cuban trade was blocked in February 1962, a few weeks after the exclusion of Cuba from the Organization of American States because of U.S. pressure). However, he quickly changed his mind and followed Kennedy's policy. After the involvement of the Cuban Revolutionary Armed Forces in the independence struggles in Angola and Mozambique, Kissinger said that unless Cuba withdrew its forces relations would not be normalized. Cuba refused.\n\nIntervention in Chile\n\nChilean Socialist Party presidential candidate Salvador Allende was elected by a plurality of 36.2 percent in 1970, causing serious concern in Washington, D.C. due to his openly socialist and pro-Cuban politics. The Nixon administration, with Kissinger's input, authorized the Central Intelligence Agency (CIA) to encourage a military coup that would prevent Allende's inauguration, but the plan was not successful.[http://history-matters.com/archive/church/reports/ir/contents.htm Alleged Assassination Plots Involving Foreign Leaders (1975)], Church Committee, pages 246–247 and 250–254.\n\nUnited States-Chile relations remained frosty during Salvador Allende's tenure, following the complete nationalization of the partially U.S.-owned copper mines and the Chilean subsidiary of the U.S.-based ITT Corporation, as well as other Chilean businesses. The U.S. claimed that the Chilean government had greatly undervalued fair compensation for the nationalization by subtracting what it deemed \"excess profits\". Therefore, the U.S. implemented economic sanctions against Chile. The CIA also provided funding for the mass anti-government strikes in 1972 and 1973, and extensive black propaganda in the newspaper El Mercurio.\n\nThe most expeditious way to prevent Allende from assuming office was somehow to convince the Chilean congress to confirm Jorge Alessandri as the winner of the election. Once elected by the congress, Alessandri—a party to the plot through intermediaries—was prepared to resign his presidency within a matter of days so that new elections could be held. This first, nonmilitary, approach to stopping Allende was called the Track I approach. The CIA's second approach, the Track II approach, was designed to encourage a military overthrow.\n\nOn September 11, 1973, Allende died during a military coup launched by Army Commander-in-Chief Augusto Pinochet, who became President.\nA document released by the CIA in 2000 titled \"CIA Activities in Chile\" revealed that the United States, acting through the CIA, actively supported the military junta after the overthrow of Allende and that it made many of Pinochet's officers into paid contacts of the CIA or U.S. military.Peter Kornbluh, [http://www.gwu.edu/~nsarchiv/news/20000919/ CIA Acknowledges Ties to Pinochet’s Repression Report to Congress Reveals U.S. Accountability in Chile], Chile Documentation Project, National Security Archive, September 19, 2000. Retrieved November 26, 2006.\n\nIn 1976, Orlando Letelier, a Chilean opponent of the Pinochet regime, was assassinated in Washington, D.C. with a car bomb. Previously, Kissinger had helped secure his release from prison, and had chosen to cancel a letter to Chile warning them against carrying out any political assassinations. The U.S. ambassador to Chile, David H. Popper, said that Pinochet might take as an insult any inference that he was connected with assassination plots. It has been confirmed that Pinochet directly ordered the assassination. This murder was part of Operation Condor, a covert program of political repression and assassination carried out by Southern Cone nations that Kissinger has been accused of being involved in.Greg Grandin. [https://books.google.com/books?id\na0hsCgAAQBAJ&lpgPP1&pg\nPA151#vonepage&q&f\nfalse Kissinger's Shadow: The Long Reach of America's Most Controversial Statesman] Metropolitan Books, 2015. p. 151. \n\nOn September 10, 2001, the family of Chilean general René Schneider filed a suit against Kissinger, accusing him of collaborating in arranging Schneider's kidnapping which resulted in his death. According to phone records, Kissinger claimed to have \"turned off\" the operation. However, the CIA claimed that no such \"stand-down\" order was ever received,John Dinges. The Condor Years: How Pinochet And His Allies Brought Terrorism To Three Continents. The New Press, 2005. [https://books.google.com/books?id\n3JjtHROah_YC&lpgPP1&pg\nPA157#vonepage&q&f\nfalse p. 157].  and he and Nixon later joked that an \"incompetent\" CIA had struggled to kill Schneider.Greg Grandin. Kissinger's Shadow: The Long Reach of America's Most Controversial Statesman Metropolitan Books, 2015. p. 249.  A subsequent Congressional investigation found that the CIA was not directly involved in Schneider's death. The case was later dismissed by a U.S. District Court, citing separation of powers: \"The decision to support a coup of the Chilean government to prevent Dr. Allende from coming to power, and the means by which the United States Government sought to effect that goal, implicate policy makers in the murky realm of foreign affairs and national security best left to the political branches.\" Decades later the CIA admitted its involvement in the kidnapping of General Schneider, but not his murder, and subsequently paid the group responsible for his death $35,000 \"to keep the prior contact secret, maintain the goodwill of the group, and for humanitarian reasons.\"\n\nArgentina\n\nKissinger took a similar line as he had toward Chile when the Argentinian military, led by Jorge Videla, toppled the elected government of Isabel Perón in 1976 with a process called the National Reorganization Process by the military, with which they consolidated power, launching brutal reprisals and \"disappearances\" against political opponents. During a meeting with Argentinian foreign minister César Augusto Guzzetti, Kissinger assured him that the United States was an ally, but urged him to \"get back to normal procedures\" quickly before the U.S. Congress reconvened and had a chance to consider sanctions. According to declassified state department files, Kissinger also attempted to thwart the Carter Administration's efforts to halt the mass killings by the 1976-83 military dictatorship.\n\nRhodesia\n\nIn September 1976 Kissinger was actively involved in negotiations regarding the Rhodesian Bush War. Kissinger, along with South Africa's Prime Minister John Vorster, pressured Rhodesian Prime Minister Ian Smith to hasten the transition to black majority rule in Rhodesia. With FRELIMO in control of Mozambique and even South Africa withdrawing its support, Rhodesia's isolation was nearly complete. According to Smith's autobiography, Kissinger told Smith of Mrs. Kissinger's admiration for him, but Smith stated that he thought Kissinger was asking him to sign Rhodesia's \"death certificate\". Kissinger, bringing the weight of the United States, and corralling other relevant parties to put pressure on Rhodesia, hastened the end of minority-rule.\n\nEast Timor\n\nThe Portuguese decolonization process brought U.S. attention to the former Portuguese colony of East Timor, which lies within the Indonesian archipelago and declared its independence in 1975. Indonesian president Suharto was a strong U.S. ally in Southeast Asia and began to mobilize the Indonesian army, preparing to annex the nascent state, which had become increasingly dominated by the popular leftist Fretilin party. In December 1975, Suharto discussed the invasion plans during a meeting with Kissinger and President Ford in the Indonesian capital of Jakarta. Both Ford and Kissinger made clear that U.S. relations with Indonesia would remain strong and that it would not object to the proposed annexation. They only wanted it done \"fast\" and proposed that it be delayed until after they had returned to Washington.Agence France Press, \"US Endorsed Indonesia's East Timor Invasion: Secret Documents\", December 6, 2001 Accordingly, Suharto delayed the operation for one day. Finally on December 7 Indonesian forces invaded the former Portuguese colony. U.S. arms sales to Indonesia continued, and Suharto went ahead with the annexation plan. According to Ben Kiernan, the invasion and occupation resulted in the deaths of nearly a quarter of the Timorese population from 1975 to 1981.\n\nCuba\n\nIn February 1976 Kissinger considered launching air strikes against ports and military installations in Cuba, as well as deploying Marine battalions based at the US Navy base at Guantanamo Bay, in retaliation for Cuban President Fidel Castro's decision in late 1975 to send troops to Angola to help the newly independent nation fend off attacks from South Africa and right-wing guerrillas.\n\nLater roles\n\nKissinger left office when Democrat Jimmy Carter defeated Republican Gerald Ford in the 1976 presidential elections. Kissinger continued to participate in policy groups, such as the Trilateral Commission, and to maintain political consulting, speaking, and writing engagements.\n\nShortly after Kissinger left office in 1977, he was offered an endowed chair at Columbia University. There was significant student opposition to the appointment, which eventually became a subject of wide media commentary. Columbia canceled the appointment as a result.\n\nKissinger was then appointed to Georgetown University's Center for Strategic and International Studies. He taught at Georgetown's Edmund Walsh School of Foreign Service for several years in the late 1970s. In 1982, with the help of a loan from the international banking firm of E.M. Warburg, Pincus and Company, Kissinger founded a consulting firm, Kissinger Associates, and is a partner in affiliate Kissinger McLarty Associates with Mack McLarty, former chief of staff to President Bill Clinton. He also serves on the board of directors of Hollinger International, a Chicago-based newspaper group, and as of March 1999, was a director of Gulfstream Aerospace.\n\nFrom 1995 to 2001, Kissinger served on the board of directors for Freeport-McMoRan, a multinational copper and gold producer with significant mining and milling operations in Papua, Indonesia. In February 2000, then-president of Indonesia Abdurrahman Wahid appointed Kissinger as a political advisor. He also serves as an honorary advisor to the United States-Azerbaijan Chamber of Commerce.\n\nFrom 2000–2006, Kissinger served as chairman of the board of trustees of Eisenhower Fellowships. In 2006, upon his departure from Eisenhower Fellowships, he received the Dwight D. Eisenhower Medal for Leadership and Service.\n\nIn November 2002, he was appointed by President George W. Bush to chair the newly established National Commission on Terrorist Attacks Upon the United States to investigate the September 11 attacks. Kissinger stepped down as chairman on December 13, 2002 rather than reveal his business client list, when queried about potential conflicts of interest.\n\nKissinger—along with William Perry, Sam Nunn, and George Shultz—has called upon governments to embrace the vision of a world free of nuclear weapons, and in three Wall Street Journal op-eds proposed an ambitious program of urgent steps to that end. The four have created the Nuclear Security Project to advance this agenda. In 2010, the four were featured in a documentary film entitled \"Nuclear Tipping Point\". The film is a visual and historical depiction of the ideas laid forth in the Wall Street Journal op-eds and reinforces their commitment to a world without nuclear weapons and the steps that can be taken to reach that goal.\n\nOn November 17, 2016, Kissinger met with then President-elect Donald Trump during which they discussed global affairs. Kissinger also met with President Trump at the White House in May 2017.\n\nViews on U.S. foreign policy\n\nYugoslav wars\n\nIn several articles of his and interviews that he gave during the Yugoslav wars, he criticized the United States' policies in Southeast Europe, among other things for the recognition of Bosnia and Herzegovina as a sovereign state, which he described as a foolish act. Most importantly he dismissed the notion of Serbs, and Croats for that part, being aggressors or separatist, saying that \"they can't be separating from something that has never existed\".\nIn addition, he repeatedly warned the West of inserting itself into a conflict that has its roots at least hundreds of years back in time, and said that the West would do better if it allowed the Serbs and Croats to join their respective countries.\nKissinger shared similarly critical views on Western involvement in Kosovo. In particular, he held a disparaging view of the Rambouillet Agreement:\n\nHowever, as the Serbs did not accept the Rambouillet text and NATO bombings started, he opted for a continuation of the bombing as NATO's credibility was now at stake, but dismissed the use of ground forces, claiming that it was not worth it.\n\nIraq\n\nIn 2006, it was reported in the book State of Denial by Bob Woodward that Kissinger met regularly with President George W. Bush and Vice President Dick Cheney to offer advice on the Iraq War. Kissinger confirmed in recorded interviews with Woodward that the advice was the same as he had given in a column in The Washington Post on August 12, 2005: \"Victory over the insurgency is the only meaningful exit strategy.\"\n\nIn an interview on the BBC's Sunday AM on November 19, 2006, Kissinger was asked whether there is any hope left for a clear military victory in Iraq and responded, \"If you mean by 'military victory' an Iraqi government that can be established and whose writ runs across the whole country, that gets the civil war under control and sectarian violence under control in a time period that the political processes of the democracies will support, I don't believe that is possible. ... I think we have to redefine the course. But I don't believe that the alternative is between military victory as it had been defined previously, or total withdrawal.\"\n\nIn an April 3, 2008, interview with Peter Robinson of the Hoover Institution, Kissinger reiterated that even though he supported the 2003 invasion of Iraq he thought that the George W. Bush administration rested too much of its case for war on Saddam's supposed weapons of mass destruction. Robinson noted that Kissinger had criticized the administration for invading with too few troops, for disbanding the Iraqi Army, and for mishandling relations with certain allies.\n\nIndia\n\nKissinger said in April 2008 that \"India has parallel objectives to the United States,\" and he called it an ally of the U.S.\n\nChina\n\nKissinger was present at the opening ceremony of the 2008 Beijing Summer Olympics.\n\nIn 2011, Kissinger published On China, chronicling the evolution of Sino-American relations and laying out the challenges to a partnership of 'genuine strategic trust' between the U.S. and China.\n\nIran\n\nKissinger's position on this issue of U.S.–Iran talks was reported by the Tehran Times to be that \"Any direct talks between the U.S. and Iran on issues such as the nuclear dispute would be most likely to succeed if they first involved only diplomatic staff and progressed to the level of secretary of state before the heads of state meet.\" (Transcript of a Bloomberg reportinterview.) In 2016, Kissinger said \"I would not have made [the agreement], but we will not get a great deal out of ending it now,\" and that the biggest challenge facing the Middle East is the \"potential domination of the region by an Iran that is both imperial and jihadist.\"\n\n2014 Ukrainian crisis\n\nOn March 5, 2014, The Washington Post published an op-ed piece by Kissinger, 11 days before the Crimean referendum on whether Autonomous Republic of Crimea should officially rejoin in Ukraine or join neighboring Russia. In it, he attempted to balance the Ukrainian, Russian and Western desires for a functional state. He made four main points:\n# Ukraine should have the right to choose freely its economic and political associations, including with Europe;\n# Ukraine should not join NATO, a repetition of the position he took seven years before;\n# Ukraine should be free to create any government compatible with the expressed will of its people. Wise Ukrainian leaders would then opt for a policy of reconciliation between the various parts of their country. He imagined an international position for Ukraine like that of Finland.\n# Ukraine should maintain sovereignty over Crimea.\n\nKissinger also wrote: \"The west speaks Ukrainian; the east speaks mostly Russian. Any attempt by one wing of Ukraine to dominate the other—as has been the pattern—would lead eventually to civil war or break up.\"\n\nFollowing the publication of his book titled World Order, Kissinger participated in an interview with Charlie Rose and updated his position on Ukraine, which he sees as a possible geographical mediator between Russia and the West.Charlie Rose, PBS, September 2014. In a question he posed to himself for illustration regarding re-conceiving policy regarding Ukraine, Kissinger stated: \"If Ukraine is considered an outpost, then the situation is that its eastern border is the NATO strategic line, and NATO will be within 200 mi of Volgograd. That will never be accepted by Russia. On the other hand, if the Russian western line is at the border of Poland, Europe will be permanently disquieted. The Strategic objective should have been to see whether one can build Ukraine as a bridge between East and West, and whether one can do it as a kind of a joint effort.\"Charlie Rose, reported in Bloomberg BusinessWeek, page 20, October 2, 2014.\n\nIn December 2016, Kissinger advised then President-elect Donald Trump to accept \"Crimea as a part of Russia\" in an attempt to secure a rapprochement between the United States and Russia, whose relations soured as a result of the Crimean crisis.\n\nPublic perception\n\nAt the height of Kissinger's prominence, many commented on his wit. In February 1972, at the Washington Press Club annual congressional dinner, \"Kissinger mocked his reputation as a secret swinger.\"\"[http://www.time.com/time/magazine/article/0,9171,905709,00.html Henry Kissinger Off Duty].\" Time, February 7, 1972. The insight, \"Power is the ultimate aphrodisiac\", is widely attributed to him, although Kissinger was paraphrasing Napoleon Bonaparte. Some scholars have ranked Kissinger as the most effective U.S. Secretary of State in the 50 years to 2015. A number of activists and human rights lawyers, however, have sought his prosecution for alleged war crimes. According to historian and Kissinger biographer Niall Ferguson, however, accusing Kissinger alone of war crimes \"requires a double standard\" because \"nearly all the secretaries of state ... and nearly all the presidents\" have taken similar actions.\n\nKissinger was interviewed in Back Door Channels: The Price of Peace, a documentary examining the underpinnings of the 1979 peace treaty between Israel and Egypt. In the film, Kissinger revealed how close he felt the world came to nuclear war during the 1973 Yom Kippur War launched by Egypt and Syria against Israel.\n\nAttempts have been made to attach liability to Kissinger for injustices in American foreign policy during his tenure in government.  In September 2001, relatives and survivors of General Rene Schneider, the former head of the Chilean general staff, commenced civil proceedings in Federal Court in Washington, DC, and, in April 2002, a petition for Kissinger's arrest was filed in the High Court in London by human rights campaigner Peter Tatchell, citing the destruction of civilian populations and the environment in Indochina during the years 1969–75.  Both suits were determined to lack legal foundation and were dismissed before trial.[http://www.smh.com.au/articles/2002/04/29/1019441343996.html \"Why the law wants a word with Kissinger\"], Fairfax Digital, April 30, 2002 British-American journalist and author Christopher Hitchens authored The Trial of Henry Kissinger, in which Hitchens calls for the prosecution of Kissinger \"for war crimes, for crimes against humanity, and for offenses against common or customary or international law, including conspiracy to commit murder, kidnap, and torture\".\"How Can Anyone Defend Kissinger Now? The Nixon tapes remind us what a vile creature Henry Kissinger is\", Slate, December 13, 2010, http://www.slate.com/articles/news_and_politics/fighting_words/2010/12/how_can_anyone_defend_kissinger_now.html . Retrieved January 8, 2016.\n Critics on the right, such as Ray Takeyh, have faulted Kissinger for his role in the Nixon administration's opening to China and secret negotiations with North Vietnam. Takeyh writes that while rapprochement with China was a worthy goal, the Nixon administration failed to achieve any meaningful concessions from Chinese officials in return, as China continued to support North Vietnam and various \"revolutionary forces throughout the Third World,\" \"nor does there appear to be even a remote, indirect connection between Nixon and Kissinger's diplomacy and the communist leadership's decision, after Mao's bloody rule, to move away from a communist economy towards state capitalism.\" On Vietnam, Takeyh claims that Kissinger's negotiations with Le Duc Tho were intended only \"to secure a 'decent interval' between America's withdrawal and South Vietnam's collapse.\" Johannes Kadura offers a more positive assessment of Nixon and Kissinger's strategy, arguing that the two men \"simultaneously maintained a Plan A of further supporting Saigon and a Plan B of shielding Washington should their maneuvers prove futile.\" According to Kadura, the \"decent interval\" concept has been \"largely misrepresented,\" in that Nixon and Kissinger \"sought to gain time, make the North turn inward, and create a perpetual equilibrium\" rather than acquiescing in the collapse of South Vietnam, but the strength of the anti-war movement and the sheer unpredictability of events in Indochina compelled them to prepare for the possibility that South Vietnam might collapse despite their best efforts. Kadura concludes: \"Without Nixon, Kissinger, and Ford's clever use of triangular diplomacy ... The Soviets and the Chinese could have been tempted into a far more aggressive stance\" following the \"U.S. defeat in Indochina\" than actually occurred. In 2011, Chimerica Media released an interview-based documentary, titled Kissinger, in which Kissinger \"reflects on some of his most important and controversial decisions\" during his tenure as Secretary of State.\n\nKissinger's record was brought up during the 2016 Democratic Party presidential primaries. Hillary Clinton had cultivated a close relationship with Kissinger, describing him as a \"friend\" and a source of \"counsel.\" During the Democratic Primary Debates, Clinton touted Kissinger's praise for her record as Secretary of State. In response, candidate Bernie Sanders issued a critique of Kissinger's foreign policy, declaring: \"I am proud to say that Henry Kissinger is not my friend. I will not take advice from Henry Kissinger.\"\n\nFamily and personal life\n\nKissinger married Ann Fleischer on February 6, 1949. They had two children, Elizabeth and David, and divorced in 1964. On March 30, 1974, he married Nancy Maginnes.[https://books.google.com/books?id7IsYAAAAIAAJ&q\nann+fleischer+kissinger+6+feb+1949+divorced+1964&dqann+fleischer+kissinger+6+feb+1949+divorced+1964&hl\nen&saX&ved\n0ahUKEwjY_duprtnXAhXN66QKHTGCA3sQ6AEIPjAG] They now live in Kent, Connecticut and in New York City. Kissinger's son David Kissinger served as an executive with NBCUniversal before becoming head of Conaco, Conan O'Brien's production company. In February 1982, Kissinger underwent coronary bypass surgery at the age of 58.\n\nKissinger described Diplomacy as his favorite game in a 1973 interview.Games & Puzzles magazine, May 1973.\n\nSoccer\n\nKissinger was described by Daryl Grove as one of the most influential people in the growth of soccer in the United States.[http://www.americansoccernow.com/articles/the-most-influential-people-in-american-soccer \"The Five Most Influential People in American Soccer\"], American Soccer Now, Daryl Grove, February 18, 2013.\nKissinger was named chairman of the North American Soccer League board of directors in 1978.\n\nSince his childhood, Kissinger has been a fan of his hometown's soccer club, SpVgg Greuther Fürth. Even during his time in office he was informed about the team's results by the German Embassy every Monday morning. He is an honorary member with lifetime season-tickets. In September 2012 Kissinger attended a home game in which SpVgg Greuther Fürth lost, 0–2, against Schalke after promising years ago he would attend a Greuther Fürth home game if they were promoted to the Bundesliga, the top football league in Germany, from the 2. Bundesliga.\nKissinger is an honorary member of the German soccer club FC Bayern München.\n\nAwards, honors, and associations\n\n* Kissinger and Le Duc Tho were jointly offered the 1973 Nobel Peace Prize for their work on the Paris Peace Accords which prompted the withdrawal of American forces from the Vietnam war. (Le Duc Tho declined to accept the award on the grounds that such \"bourgeois sentimentalities\" were not for him[40] and that peace had not actually been achieved in Vietnam. Kissinger donated his prize money to charity, did not attend the award ceremony and would later offer to return his prize medal after the fall of South Vietnam to North Vietnamese forces 18 months later.[40])\n* In 1973, Kissinger received the U.S. Senator John Heinz Award for Greatest Public Service by an Elected or Appointed Official, an award given out annually by Jefferson Awards.\n* In 1976, Kissinger became the first honorary member of the Harlem Globetrotters.\n\n* On January 13, 1977, Kissinger received the Presidential Medal of Freedom from President Gerald Ford.\n* In 1980, Kissinger won the National Book Award in HistoryThis was the 1980 award for hardcover History. From 1980 to 1983 there were dual hardcover and paperback awards in most categories, and multiple nonfiction subcategories. Most of the paperback award-winners were reprints, including Kissinger's. for the first volume of his memoirs, The White House Years.[http://www.nationalbook.org/nba1980.html \"National Book Awards – 1980\"]. National Book Foundation. Retrieved March 16, 2012.\n* In 1995, he was made an honorary Knight Commander of the Most Distinguished Order of St Michael and St George.[http://www.highbeam.com/doc/1O47-KissingerHenryAlfred.html Kissinger, Henry Alfred] in Who's Who in the Twentieth Century, Oxford University Press, 1999\n* In 2000, Kissinger received the Sylvanus Thayer Award at United States Military Academy at West Point.\n* In 2002, Kissinger became an honorary member of the International Olympic Committee.International Olympic Committee: [http://www.olympic.org/mr-henry-kissinger Mr Henry Kissinger]. Retrieved February 20, 2014.\n* On March 1, 2012, Kissinger was awarded Israel's President's Medal.\n* In October 2013, Kissinger was awarded the Henry A. Grunwald Award for Public Service by Lighthouse International\n* Kissinger was a member of the Founding Council of the Rothermere American Institute, University of Oxford.\n* Kissinger is a member of the following groups:\n** Aspen Institute\n** Atlantic Council\n** Bilderberg Group\n** Bohemian Club\n** Council on Foreign Relations\n** Center for Strategic and International Studies\n* Kissinger served on the board of Theranos, a health technology company, from 2014 to 2017.\n* He received the Theodore Roosevelt American Experience Award from the Union League Club of New York in 2009.\n\nWritings: major books\n\nMemoirs\n\n* 1979. The White House Years.  (National Book Award, History Hardcover)\n* 1982. Years of Upheaval. \n* 1999. Years of Renewal. \n\nPublic policy\n\n* 1957. A World Restored: Metternich, Castlereagh and the Problems of Peace, 1812–22. \n* 1957. Nuclear Weapons and Foreign Policy.  (1984 edition)\n* 1961. The Necessity for Choice: Prospects of American Foreign Policy. \n* 1965. The Troubled Partnership: A Re-Appraisal of the Atlantic Alliance. \n* 1969. American Foreign Policy: Three Essays. \n* 1981. For the Record: Selected Statements 1977–1980. \n* 1985. Observations: Selected Speeches and Essays 1982–1984. \n* 1994. Diplomacy. \n* 1999. Kissinger Transcripts: The Top Secret Talks With Beijing and Moscow (Henry Kissinger, William Burr). \n* 2001. Does America Need a Foreign Policy? Toward a Diplomacy for the 21st Century. \n* 2002. Vietnam: A Personal History of America's Involvement in and Extrication from the Vietnam War. \n* 2003. Crisis: The Anatomy of Two Major Foreign Policy Crises: Based on the Record of Henry Kissinger's Hitherto Secret Telephone Conversations. \n* 2011. On China (New York: Penguin Press, 2011). .\n* 2014. World Order (New York: Penguin Press, September 9, 2014). .\n\nNotes. Henry Kissinger. http://en.wikipedia.org/?curid=13765."
  }
}
