{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16289",
  "eid" : "254511e0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778571774,
  "textBody" : "James Dewey Watson (born April 6, 1928) is an American molecular biologist, geneticist and zoologist, best known as one of the co-discoverers of the structure of DNA in 1953 with Francis Crick and Rosalind Franklin. Watson, Crick, and Maurice Wilkins were awarded the 1962 Nobel Prize in Physiology or Medicine \"for their discoveries concerning the molecular structure of nucleic acids and its significance for information transfer in living material\".\n\nWatson earned degrees at the University of Chicago (BS, 1947) and Indiana University (PhD, 1950). Following a post-doctoral year at the University of Copenhagen with Herman Kalckar and Ole Maaloe, later Watson worked at the University of Cambridge's Cavendish Laboratory in England, where he first met his future collaborator and friend Francis Crick.\n\nFrom 1956 to 1976, Watson was on the faculty of the Harvard University Biology Department, promoting research in molecular biology. From 1968 he served as director of Cold Spring Harbor Laboratory (CSHL), greatly expanding its level of funding and research. At CSHL, he shifted his research emphasis to the study of cancer, along with making it a world leading research center in molecular biology. In 1994, he started as president and served for 10 years. He was then appointed chancellor, serving until he resigned in 2007 after making controversial comments claiming a link between intelligence and race. Between 1988 and 1992, Watson was associated with the National Institutes of Health, helping to establish the Human Genome Project.\n\nWatson has written many science books, including the textbook Molecular Biology of the Gene (1965) and his bestselling book The Double Helix (1968).\n\nEarly life and education\n\nJames D. Watson was born in Chicago, Illinois, on April 6, 1928, as the only son of Jean (Mitchell) and James D. Watson, a businessman descended mostly from colonial English immigrants to America. His mother's father, Lauchlin Mitchell, a tailor, was from Glasgow, Scotland, and her mother, Lizzie Gleason, was the child of Irish parents from Tipperary. Raised Catholic, he later described himself as \"an escapee from the Catholic religion.\" Watson said, \"The luckiest thing that ever happened to me was that my father didn't believe in God.\"\n\nWatson grew up on the south side of Chicago and attended public schools, including Horace Mann Grammar School and South Shore High School. He was fascinated with bird watching, a hobby shared with his father,  so he considered majoring in ornithology. Watson appeared on Quiz Kids, a popular radio show that challenged bright youngsters to answer questions. Thanks to the liberal policy of University president Robert Hutchins, he enrolled at the University of Chicago, where he was awarded a tuition scholarship, at the age of 15.\n\nAfter reading Erwin Schrödinger's book What Is Life? in 1946, Watson changed his professional ambitions from the study of ornithology to genetics. [http://www.nature.com/nature/journal/v433/n7027/full/433686a.html Reviewed by Lewis Wolpert, Nature, (2005) 433:686-687.] Watson earned his BS degree in Zoology from the University of Chicago in 1947. In his autobiography, Avoid Boring People, Watson described the University of Chicago as an \"idyllic academic institution where he was instilled with the capacity for critical thought and an ethical compulsion not to suffer fools who impeded his search for truth\", in contrast to his description of later experiences. In 1947 Watson left the University of Chicago to become a graduate student at Indiana University, attracted by the presence at Bloomington of the 1946 Nobel Prize winner Hermann Joseph Muller, who in crucial papers published in 1922, 1929, and in the 1930s had laid out all the basic properties of the heredity molecule that Schrödinger presented in his 1944 book. He received his PhD degree from Indiana University in 1950; Salvador Luria was his doctoral advisor.\n\nCareer and research\n\nLuria, Delbrück, and the Phage Group\n\nOriginally, Watson was drawn into molecular biology by the work of Salvador Luria. Luria eventually shared the 1969 Nobel Prize in Physiology or Medicine for his work on the Luria–Delbrück experiment, which concerned the nature of genetic mutations. He was part of a distributed group of researchers who were making use of the viruses that infect bacteria, called bacteriophages. He and Max Delbrück were among the leaders of this new \"Phage Group,\" an important movement of geneticists from experimental systems such as Drosophila towards microbial genetics. Early in 1948, Watson began his PhD research in Luria's laboratory at Indiana University. That spring, he met Delbrück first in Luria's apartment and again that summer during Watson's first trip to the Cold Spring Harbor Laboratory (CSHL).\n\nThe Phage Group was the intellectual medium where Watson became a working scientist. Importantly, the members of the Phage Group sensed that they were on the path to discovering the physical nature of the gene. In 1949, Watson took a course with Felix Haurowitz that included the conventional view of that time: that genes were proteins and able to replicate themselves. The other major molecular component of chromosomes, DNA, was widely considered to be a \"stupid tetranucleotide,\" serving only a structural role to support the proteins. However, even at this early time, Watson, under the influence of the Phage Group, was aware of the Avery–MacLeod–McCarty experiment, which suggested that DNA was the genetic molecule. Watson's research project involved using X-rays to inactivate bacterial viruses.\n\nWatson then went to Copenhagen University in September 1950 for a year of postdoctoral research, first heading to the laboratory of biochemist Herman Kalckar. Kalckar was interested in the enzymatic synthesis of nucleic acids, and he wanted to use phages as an experimental system. Watson, however, wanted to explore the structure of DNA, and his interests did not coincide with Kalckar's. After working part of the year with Kalckar, Watson spent the remainder of his time in Copenhagen conducting experiments with microbial physiologist Ole Maaloe, then a member of the Phage Group.\n\nThe experiments, which Watson had learned of during the previous summer's Cold Spring Harbor phage conference, included the use of radioactive phosphate as a tracer to determine which molecular components of phage particles actually infect the target bacteria during viral infection. The intention was to determine whether protein or DNA was the genetic material, but upon consultation with Max Delbrück, they determined that their results were inconclusive and could not specifically identify the newly labeled molecules as DNA. Watson never developed a constructive interaction with Kalckar, but he did accompany Kalckar to a meeting in Italy, where Watson saw Maurice Wilkins talk about his X-ray diffraction data for DNA. Watson was now certain that DNA had a definite molecular structure that could be elucidated.\n\nIn 1951, the chemist Linus Pauling in California published his model of the amino acid alpha helix, a result that grew out of Pauling's efforts in X-ray crystallography and molecular model building. After obtaining some results from his phage and other experimental research conducted at Indiana University, Statens Serum Institut (Denmark), CSHL, and the California Institute of Technology, Watson now had the desire to learn to perform X-ray diffraction experiments so he could work to determine the structure of DNA. That summer, Luria met John Kendrew, and he arranged for a new postdoctoral research project for Watson in England.  In 1951 Watson visited the Stazione Zoologica 'Anton Dohrn' in Naples.\n\nIdentifying the double helix\n\nIn mid-March 1953, using, in part, experimental data collected mainly by Rosalind Franklin and also by Maurice Wilkins, Watson and Crick deduced the double helix structure of DNA. Sir Lawrence Bragg, the director of the Cavendish Laboratory (where Watson and Crick worked), made the original announcement of the discovery at a Solvay conference on proteins in Belgium on April 8, 1953; it went unreported by the press. Watson and Crick submitted a paper entitled Molecular Structure of Nucleic Acids: A Structure for Deoxyribose Nucleic Acid to the scientific journal Nature, which was published on April 25, 1953. This has been described by some other biologists and Nobel laureates as the most important scientific discovery of the 20th century.  Bragg gave a talk at the Guy's Hospital Medical School in London on Thursday, May 14, 1953, which resulted in a May 15, 1953, article by Ritchie Calder in the London newspaper News Chronicle, entitled \"Why You Are You. Nearer Secret of Life.\"\n\nSydney Brenner, Jack Dunitz, Dorothy Hodgkin, Leslie Orgel, and Beryl M. Oughton were some of the first people in April 1953 to see the model of the structure of DNA, constructed by Crick and Watson; at the time, they were working at Oxford University's Chemistry Department. All were impressed by the new DNA model, especially Brenner, who subsequently worked with Crick at Cambridge in the Cavendish Laboratory and the new Laboratory of Molecular Biology. According to the late Beryl Oughton, later Rimmer, they all travelled together in two cars once Dorothy Hodgkin announced to them that they were off to Cambridge to see the model of the structure of DNA.\n\nThe Cambridge University student newspaper Varsity also ran its own short article on the discovery on Saturday, May 30, 1953. Watson subsequently presented a paper on the double-helical structure of DNA at the 18th Cold Spring Harbor Symposium on Viruses in early June 1953, six weeks after the publication of the Watson and Crick paper in Nature. Many at the meeting had not yet heard of the discovery. The 1953 Cold Spring Harbor Symposium was the first opportunity for many to see the model of the DNA double helix.\n\nWatson, Crick, and Wilkins were awarded the Nobel Prize in Physiology or Medicine in 1962 for their research on the structure of nucleic acids. Rosalind Franklin had died in 1958 and was therefore ineligible for nomination.\n\nThe publication of the double helix structure of DNA can be regarded as a turning point in science: human understanding of life was fundamentally changed and the modern era of biology began.\n\nHarvard University\n\nIn 1956, Watson accepted a position in the Biology department at Harvard University. His work at Harvard focused on RNA and its role in the transfer of genetic information.\nAt Harvard University, Watson achieved a series of academic promotions from assistant professor to associate professor to full professor of biology. Watson claimed, however, that he was refused a $1,000 raise in salary after winning the Nobel Prize.\n\nHe championed a switch in focus for the school from classical biology to molecular biology, stating that disciplines such as ecology, developmental biology, taxonomy, physiology, etc. had stagnated and could progress only once the underlying disciplines of molecular biology and biochemistry had elucidated their underpinnings, going so far as to discourage their study by students.\n\nWatson continued to be a member of the Harvard faculty until 1976, even though he took over the directorship of Cold Spring Harbor Laboratory in 1968.\n\nViews on Watson's scientific contributions while at Harvard are somewhat mixed.  His most notable achievements in his two decades at Harvard may be what he wrote about science, rather than anything he discovered during that time.  Watson's first textbook, The Molecular Biology of the Gene, set a new standard for textbooks, particularly through the use of concept heads—brief declarative subheadings.  His next textbook was Molecular Biology of the Cell, in which he coordinated the work of a group of scientist-writers. His third textbook was Recombinant DNA, which described the ways in which genetic engineering has brought much new information about how organisms function. The textbooks are still in print.\n\nPublishing The Double Helix\n\nIn 1968, Watson wrote The Double Helix, listed by the Board of the Modern Library as number seven in their list of 100 Best Nonfiction books.  The book details the sometimes painful story of not only the discovery of the structure of DNA, but also the personalities, conflicts and controversy surrounding their work. Watson's original title was to have been \"Honest Jim\", in that the book recounts the discovery of the double helix from Watson's point of view and included many of his private emotional impressions at the time. Some controversy surrounded the publication of the book. Watson's book was originally to be published by the Harvard University Press, but Francis Crick and Maurice Wilkins objected, among others. Watson's home university dropped the project and the book was commercially published.Watson's 1968 autobiographical account, The Double Helix: A Personal Account of the Discovery of the Structure of DNA. For an edition which contains critical responses, book reviews, and copies of the original scientific papers, see James D. Watson, The Double Helix: A Personal Account of the Discovery of the Structure of DNA, Norton Critical Edition, Gunther Stent, ed. (New York: Norton, 1980).\n\nCold Spring Harbor Laboratory\n\nIn 1968, Watson became the Director of the Cold Spring Harbor Laboratory (CSHL). Between 1970 and 1972, the Watsons' two sons were born, and by 1974, the young family made Cold Spring Harbor their permanent residence. Watson served as the laboratory's director and president for about 35 years, and later he assumed the role of chancellor and then Chancellor Emeritus.\n\nIn his roles as director, president, and chancellor, Watson led CSHL to articulate its present-day mission, \"dedication to exploring molecular biology and genetics in order to advance the understanding and ability to diagnose and treat cancers, neurological diseases, and other causes of human suffering.\" CSHL substantially expanded both its research and its science educational programs under Watson’s direction.  He is credited with \"transforming a small facility into one of the world’s great education and research institutions. Initiating a program to study the cause of human cancer, scientists under his direction have made major contributions to understanding the genetic basis of cancer.\" In a retrospective summary of Watson's accomplishments there, Bruce Stillman, the laboratory's president,  said, \"Jim Watson created a research environment that is unparalleled in the world of science.\"\n\nIn October 2007, Watson was suspended following criticism of his views on genetic factors relating to intelligence,  and a week later, on the 25th, he retired at the age of 79 from CSHL from what the lab called \"nearly 40 years of distinguished service\".  In a statement, Watson attributed his retirement to his age, and circumstances that he could never have anticipated or desired.Controversial DNA Scientist James Watson Retires © 2007 Associated Press/AP Online. © 2007 Sci-Tech Today. October 25, 2007 11:29 am\n\nHuman Genome Project\n\nIn 1990, Watson was appointed as the Head of the Human Genome Project at the National Institutes of Health, a position he held until April 10, 1992. Watson left the Genome Project after conflicts with the new NIH Director, Bernadine Healy. Watson was opposed to Healy's attempts to acquire patents on gene sequences, and any ownership of the \"laws of nature.\" Two years before stepping down from the Genome Project, he had stated his own opinion on this long and ongoing controversy which he saw as an illogical barrier to research; he said, \"The nations of the world must see that the human genome belongs to the world's people, as opposed to its nations.\" He left within weeks of the 1992 announcement that the NIH would be applying for patents on brain-specific cDNAs.Pollack, R.. 1994. Signs of Life: The Language and Meanings of DNA. Houghton Mifflin Company, p. 95. . (The issue of the patentability of genes has since been resolved in the US by the US Supreme Court; see Association for Molecular Pathology v. U.S. Patent and Trademark Office)\n\nIn 1994, Watson became President of CSHL. Francis Collins took over the role as Director of the Human Genome Project.\n\nIn 2007, James Watson became the second person[https://www.nytimes.com/2007/06/01/science/01gene.html?_r1&oref\nslogin Genome of DNA Discoverer Is Deciphered] NYT, June 1, 2007. to publish his fully sequenced genome online,[http://jimwatsonsequence.cshl.edu/ James Watson genotypes, on NCBI B36 assembly]  after it was presented to him on May 31, 2007, by 454 Life Sciences Corporation in collaboration with scientists at the Human Genome Sequencing Center, Baylor College of Medicine. Watson was quoted as saying, \"I am putting my genome sequence on line to encourage the development of an era of personalized medicine, in which information contained in our genomes can be used to identify and prevent disease and to create individualized medical therapies\".Cold Spring Harbor Laboratory, June 28, 2003. [http://www.cshl.edu/public/releases/07_genotype_viewer.html Watson Genotype Viewer Now On Line] . Press release. Retrieved on September 16, 2007.[https://archive.is/20120803192155/http://jimwatsonsequence.cshl.edu/cgi-perl/gbrowse/jwsequence/?name=Sequence:NM_005516.3 James Watson's Personal Genome Sequence][ftp://ftp.ncbi.nih.gov/pub/TraceDB/Personal_Genomics/ Watson's personal DNA sequence archive at the National Institutes of Health]\n\nRole of oxidants in disease\n\nIn 2014 Watson published a paper in The Lancet suggesting that biological oxidants may have a different role than is thought in diseases including diabetes, dementia, heart disease and cancer. For example, type 2 diabetes is usually thought to be caused by oxidation in the body that causes inflammation and kills off pancreatic cells. Watson thinks the root of that inflammation is different: \"a lack of biological oxidants, not an excess\", and discusses this in detail. One critical response was that the idea was neither new nor worthy of merit, and that The Lancet published Watson's paper only because of his name. However, other scientists have expressed their support for his hypothesis and have proposed that it can also be expanded to why a lack of oxidants can result in cancer and its progression.\n\nNotable former students\n\nSeveral of Watson's former doctoral students subsequently became notable in their own right including, Mario Capecchi, Bob Horvitz, Charles Kurland, Peter D. Moore and Joan Steitz. Besides numerous PhD students, Watson also supervised postdoctoral students and other interns including Ewan Birney, Ronald W. Davis, Phillip Allen Sharp (postdoc), John Tooze, (postdoc) and Richard J. Roberts (postdoc).\n\nSelected books published\n\n* James D. Watson, The Annotated and Illustrated Double Helix, edited by Alexander Gann and Jan Witkowski (2012) Simon & Schuster, .\n* \n*  (Norton Critical Editions, 1981).\n* \n* \n* \n* \n\nOther affiliations\n\nWatson is a former member of the Board of Directors of United Biomedical, Inc., founded by Chang Yi Wang. He held the position for six years and retired from the board in 1999.\n\nIn January 2007, Watson accepted the invitation of Leonor Beleza, president of the Champalimaud Foundation, to become the head of the foundation's scientific council, an advisory organ.\n\nWatson has also been an institute adviser for the Allen Institute for Brain Science.\n\nPolitical activism\n\nDuring his tenure as a professor at Harvard, Watson participated in several political protests:\n* Vietnam War: While a professor at Harvard University, Watson, along with \"12 Faculty members of the department of Biochemistry and Molecular Biology\" including one other Nobel prize winner, spearheaded a resolution for \"the immediate withdrawal of U.S. forces from Vietnam.\"\"Faculty Support Grows For Anti-War Proposal\", The Harvard Crimson, October 3, 1969. November 4, 2007.\n* Nuclear proliferation and environmentalism: In 1975, on the \"thirtieth anniversary of the bombing of Hiroshima,\" Watson along with \"over 2000 scientists and engineers\" spoke out against nuclear proliferation to President Ford in part because of the \"lack of a proven method for the ultimate disposal of radioactive waste\" and because \"The writers of the declaration see the proliferation of nuclear plants as a major threat to American liberties and international safety because they say safeguard procedures are inadequate to prevent terrorist theft of commercial reactor-produced plutonium.\"\"Three Harvard Scientists Lead Call to Stop Nuclear Reactors\", The Harvard Crimson, August 5, 1975. November 4, 2007.\n* In 2007, Watson said, \"I turned against the left wing because they don't like genetics, because genetics implies that sometimes in life we fail because we have bad genes. They want all failure in life to be due to the evil system.\"\n\nControversies\n\nUse of King's College results\n\nAn enduring controversy has been generated by Watson and Crick's unauthorized use of DNA X-ray diffraction data collected by Rosalind Franklin and Raymond Gosling. The controversy arose from the fact that some of Franklin's unpublished data were used without her consent by Watson and Crick in their construction of the double helix model of DNA.Judson, H.F. 1996. The Eighth Day of Creation: Makers of the Revolution in Biology. Cold Spring Harbor Laboratory Press, chapter 3. .  Franklin's experimental results provided estimates of the water content of DNA crystals and these results were consistent with the two sugar-phosphate backbones being on the outside of the molecule. Franklin personally told Crick and Watson that the backbones had to be on the outside, which was a crucial piece of information because before then Linus Pauling and Watson and Crick had generated erroneous models with the chains inside and the bases pointing outwards. Her identification of the space group for DNA crystals revealed to Crick that the two DNA strands were antiparallel.\n\nThe X-ray diffraction images collected by Gosling and Franklin provided the best evidence for the helical nature of DNA. Franklin's experimental work thus proved crucial in Watson and Crick's discovery. Watson and Crick had three sources for Franklin's unpublished data: \n#her 1951 seminar, attended by Watson,\n#discussions with Wilkins, who worked in the same laboratory with Franklin, \n#a research progress report that was intended to promote coordination of Medical Research Council-supported laboratories. Watson, Crick, Wilkins and Franklin all worked in MRC laboratories.\n\nPrior to publication of the double helix structure, Watson and Crick had little interaction with Franklin. Crick and Watson felt that they had benefited from collaborating with Wilkins. They offered him a co-authorship on the article that first described the double helix structure of DNA. Wilkins turned down the offer, a fact that may have led to the terse character of the acknowledgment of experimental work done at King's College in the eventual published paper. Rather than make any of the DNA researchers at King's College co-authors on the Watson and Crick double helix article, the solution that was arrived at was to publish two additional papers from King's College along with the helix paper.\n\nAccording to one critic, Watson's portrayal of Franklin in The Double Helix (written after Franklin's death when libel laws did not apply anymore) was negative and gave the appearance that she was Wilkins' assistant and was unable to interpret her own DNA data. The latter accusation was indefensible since, e.g., Franklin herself told Crick and Watson that the helix backbones had to be on the outside, which was crucial to the elucidation of the helix since before this both Crick and Watson and Linus Pauling had independently generated flawed models with the chains inside and the bases pointing outwards.\n\nIn his book The Double Helix, Watson described being intimidated by Franklin and that they were unable to establish constructive scientific interactions during the time period when Franklin was doing DNA research. In the book's epilogue, written after Franklin's death, Watson acknowledges his early impressions of Franklin were often wrong, that she faced enormous barriers as a woman in the field of science even though her work was superb, and that it took them years to overcome their bickering before he could appreciate Franklin's generosity and integrity.\n\nA review of the handwritten correspondence from Franklin to Watson, located in the archives at CSHL, reveals that the two scientists later had exchanges of constructive scientific correspondence. In fact, Franklin consulted with Watson on her tobacco mosaic virus RNA research. Franklin's letters begin on friendly terms with \"Dear Jim\", and conclude with equally benevolent and respectful sentiments such as \"Best Wishes, Yours, Rosalind\". Each of the scientists published their own unique contributions to the discovery of the structure of DNA in separate articles, and all of the contributors published their findings in the same volume of Nature. These classic molecular biology papers are identified as: Watson J.D. and Crick F.H.C. \"A Structure for Deoxyribose Nucleic Acid\" Nature 171, 737-738 (1953), Wilkins M.H.F., Stokes A.R. & Wilson, H.R. \"Molecular Structure of Deoxypentose Nucleic Acids\" Nature 171, 738-740 (1953), Franklin R. and Gosling R.G. \"Molecular Configuration in Sodium Thymonucleate\" Nature 171, 740-741 (1953).\n\nThe wording on the DNA sculpture (which was donated by Watson) outside Clare College's Memorial Court, Cambridge, England is:\n\nOn the base:\n* \"These strands unravel during cell reproduction. Genes are encoded in the sequence of bases.\"\n* \"The double helix model was supported by the work of Rosalind Franklin and Maurice Wilkins.\"\n\nOn the helices:\n* \"The structure of DNA was discovered in 1953 by Francis Crick and James Watson while Watson lived here at Clare.\"\n* \"The molecule of DNA has two helical strands that are linked by base pairs Adenine - Thymine or Guanine - Cytosine.\"\n\nControversial comments\n\nWatson has often expressed provocative concepts and disparaging opinions of others within the realm of genetic research.\n* He has been quoted in The Sunday Telegraph, 1997, as stating: \"If you could find the gene which determines sexuality and a woman decides she doesn't want a homosexual child, well, let her.\"Macdonald, V. \"Abort babies with gay genes, says Nobel winner\", The Telegraph, February 16, 1997. Retrieved on October 24, 2007. The biologist Richard Dawkins wrote a letter to The Independent claiming that Watson's position was misrepresented by The Sunday Telegraph article, and that Watson would equally consider the possibility of having a heterosexual child to be just as valid as any other reason for abortion, to emphasise that Watson is in favor of allowing choice.\n* On the issue of obesity, Watson has also been quoted as saying, 2000: \"Whenever you interview fat people, you feel bad, because you know you're not going to hire them.\"Abate, T. [http://www.sfgate.com/cgi-bin/article.cgi?file\n/chronicle/archive/2000/11/13/MN111208.DTL \"Nobel Winner's Theories Raise Uproar in Berkeley Geneticist's views strike many as racist, sexist\"], San Francisco Chronicle, November 13, 2000. Retrieved on October 24, 2007.\n* While speaking at a conference in 2000, Watson had suggested a link between skin color and sex drive, hypothesizing that dark-skinned people have stronger libidos. His lecture argued that extracts of melanin – which gives skin its color – had been found to boost subjects' sex drive. \"That's why you have Latin lovers,\" he said, according to people who attended the lecture. \"You've never heard of an English lover. Only an English Patient.\"\n* Watson has repeatedly supported genetic screening and genetic engineering in public lectures and interviews, arguing that stupidity is a disease and the \"really stupid\" bottom 10% of people should be cured.Bhattacharya, S. [https://www.newscientist.com/article/dn3451 \"Stupidity should be cured, says DNA discoverer\"], New Scientist News Service, February 28, 2003. Retrieved June 24, 2007. He has also suggested that beauty could be genetically engineered, saying in 2003, \"People say it would be terrible if we made all girls pretty. I think it would be great.\"\n* Watson has had quite a few disagreements with Craig Venter regarding his use of EST fragments while Venter worked at NIH.  Venter went on to found Celera genomics and continued his feud with Watson.  Watson was even quoted as calling Venter \"Hitler\".Shreeve. J. 2005. The Genome War: How Craig Venter Tried to Capture the Code of Life and Save the World. Ballantine Books, p. 48. .\n\nAvoid Boring People, UK book tour and resignation\n\nIn his memoir, Avoid Boring People: Lessons from a Life in Science, Watson describes his academic colleagues as \"dinosaurs\", \"deadbeats\", \"fossils\", \"has-beens\", \"mediocre\", and \"vapid\". Steve Shapin in Harvard Magazine noted that Watson had written an unlikely \"Book of Manners\", telling about the skills needed at different times in a scientist's career; he wrote Watson was known for aggressively pursuing his own goals at the university. E. O. Wilson once described Watson as \"the most unpleasant human being I had ever met\", but in a later TV interview said that he considered them friends and their rivalry at Harvard old history (when they had competed for funding in their respective fields).\"[http://harvardmagazine.com/2008/01/chairman-of-the-bored.html Chairman of the Bored]\", Steven Shapin, Harvard Magazine, January–February 2008[http://video.google.com/videoplay?docid=-6927851714963534233 Charlie Rose Interview, paired with E. O. Wilson]  December 14, 2005\n\nIn the epilogue to the memoir Avoid Boring People, Watson alternately attacks and defends former Harvard University president Lawrence Summers, who stepped down in 2006 due in part to his remarks about women and science.  Watson also states in the epilogue, \"Anyone sincerely interested in understanding the imbalance in the representation of men and women in science must reasonably be prepared at least to consider the extent to which nature may figure, even with the clear evidence that nurture is strongly implicated.\"\n\nIn early October 2007, Watson was about to embark on a UK book tour to promote the memoir. He was interviewed by Charlotte Hunt-Grubbe at CSHL.  In 1996, she had been a student there in a program in which Watson recruited students to live at his family home and work at CSHL for a year. Hunt-Grubbe had gone on to work for the Sunday Times Magazine; she was selected for the interview as she was one of the few women to have been mentored by him. Hunt-Grubbe broached the subject of whether race was a factor in his hypothesis of divergence of intellect between geographically isolated populations.   The following is a transcript of that part of the interview:\n\nThough other publications noted that the paper had \"[kept] the profile sympathetic and place[d] the comments at the end of the piece\", the article was a public relations disaster for Watson. The Sunday Times Magazine editor Cathy Galvin noted, \"It was important the reader understood Charlotte's relationship with Watson and her regard for him before exploring the explosive and unscientific territory of his opinions and history of statements about women, race, and abortion which have stirred so much controversy in the past.\"\n\nWatson's comments drew attention and criticism in the UK. Watson said his intention was to promote science not racism, but some of the UK venues canceled his appearances.[http://news.bbc.co.uk/2/hi/uk_news/england/london/7050020.stm \"Museum drops race row scientist\"], BBC, October 18, 2007. Retrieved October 24, 2007. Watson canceled the rest of his tour.[http://www.msnbc.msn.com/id/21362732/ \"Race remarks get Nobel winner in trouble\"], MSNBC and AP, October 18, 2007. Retrieved October 18, 2007.Syal, R. [http://www.timesonline.co.uk/tol/news/uk/science/article2687364.ece \"Nobel scientist who sparked race row says sorry - I didn't mean it\"], Times Online, October 19, 2007. Retrieved October 24, 2007.\"Watson Returns to USA after race row\", International Herald Tribune, October 19, 2007. Retrieved on November 10, 2007[http://entertainment.timesonline.co.uk/tol/arts_and_entertainment/the_tls/article3039959.ece Jerry A. Coyne, \"The complex James Watson\"], Times Literary Supplement, December 12, 2007[http://thesciencenetwork.org/programs/the-science-studio/avoid-boring-people-lessons-from-a-life-in-science \"Interview with James Watson: 'How to Avoid Boring People: Lessons from a Life in Science'\"], The Science Network\n\nBecause of the public controversy, on October 18, 2007, the Board of Trustees at Cold Spring Harbor Laboratory suspended Watson's administrative responsibilities. On October 19, Watson issued an apology; on October 25, he resigned from his position as chancellor.Watson, J.D. [https://www.independent.co.uk/voices/commentators/james-watson-to-question-genetic-intelligence-is-not-racism-5328720.html \"James Watson: To question genetic intelligence is not racism\"], Independent, October 19, 2007. Retrieved October 24, 2007Cold Spring Harbor Laboratory. October 18, 2007. [http://www.cshl.edu/public/releases/07_statement2.html Statement by Cold Spring Harbor Laboratory Board of Trustees and President Bruce Stillman, PhD Regarding Dr. Watson’s Comments in The Sunday Times on October 14, 2007]. Press release. Retrieved October 24, 2007. Wigglesworth, K.[http://articles.latimes.com/2007/oct/26/science/sci-watson26 DNA pioneer quits after race comments], L.A. Times, October 26, 2007. Retrieved December 5, 2007\"[http://www.cnn.com/2007/TECH/science/10/25/watson.resigns/index.html \"Nobel prize-winning biologist resigns.\"]\", CNN, October 25, 2007. Retrieved on October 25, 2007.van Marsh, A. [http://www.cnn.com/2007/WORLD/europe/10/18/nobel.apology/index.html \"Nobel-winning biologist apologizes for remarks about blacks\"], CNN, October 19, 2007. Retrieved October 24, 2007.\"DNA Pioneer Watson Resigns Amid Cloud of Scandal\" by Malcolm Ritter AP 10/25/07 11:29 am PhTWatson, J.[https://www.nytimes.com/2007/10/25/science/26wattext.html Statement by James D. Watson \"Retirement\"], New York Times, October 25, 2007. Retrieved December 5, 2007. In 2008, Watson was appointed chancellor emeritus of CSHL. As of 2009, he continues to advise and guide project work at the laboratory. In a 2008 BBC documentary, Watson said: \"I have never thought of myself as a racist. I don't see myself as a racist. I am mortified by it. It was the worst thing in my life.\"[http://video.google.com/videoplay?docid\n-1424386236177531815#28m0s Video: BBC 2 Horizon: The President's Guide to Science] , September 16, 2008, see 28:00 to 34:00 mark An editorial in Nature at the time acknowledged that his remarks were \"beyond the pale,\" but wished that the tour had not been cancelled so that Watson would be forced to face his critics in person, encouraging scientific discussion on the matter.[http://www.nature.com/nature/journal/v449/n7165/full/449948a.html \" Watson's folly\"], Nature, October 24, 2007. Retrieved September 27, 2008.\n\nSale of Nobel Prize Medal\n\nIn 2014, he decided to auction off his Nobel prize medal in view of his diminished income after the 2007 incident and to use part of the funds raised by the sale to support scientific research. The medal sold at auction at Christie's in December 2014 for .  Watson intended to contribute the proceeds to conservation work in Long Island and to funding research at Trinity College, Dublin, as well as the purchase of artwork.\nWatson is the first living recipient of the honor to auction the medal.\n\nThe medal was subsequently returned to Watson by the purchaser, Russian tycoon Alisher Usmanov, who stated that Watson deserved the medal and that \"a situation in which an outstanding scientist has to sell a medal recognising his achievements is unacceptable.\"\n\nPersonal life\n\nWatson is an atheist. In 2003, he was one of 22 Nobel Laureates who signed the Humanist Manifesto.\n\nMarriage and family\n\nWatson married Elizabeth Lewis in 1968. They have two sons, Rufus Robert Watson (b. 1970) and Duncan James Watson (b. 1972). Watson sometimes talks about his son Rufus, who suffers from schizophrenia. He wants to encourage progress in the understanding and treatment of mental illness by determining how genetics contribute to it.[http://www.telegraph.co.uk/news/worldnews/northamerica/usa/5300883/DNA-father-James-Watsons-holy-grail-request.html DNA father James Watson's 'holy grail' request] May 10, 2009\n\nAwards and honors\n\nWatson has won numerous awards including:\n\n* Albert Lasker Award for Basic Medical Research, 1960The Lasker Foundation.[http://www.laskerfoundation.org/awards/1960basic.htm 1960 Winners] . Retrieved on November 4, 2007.\n* EMBO Membership in 1985\n* Benjamin Franklin Medal for Distinguished Achievement in the Sciences (2001)\n* Charles A. Dana Award, 1994\n* Copley Medal of the Royal Society, 1993\n* [http://doublehelixmedals.cshl.edu/history_08.html CSHL Double Helix Medal Honoree, 2008]\n* Eli Lilly Award in Biological Chemistry, 1960\n* Fellow of the New York Academy of Sciences\n* Gairdner Foundation International Award, 2002\n* Heald Award\n* Honorary Fellow, the Hastings Center, an independent bioethics research institution[http://www.thehastingscenter.org/About/Default.aspx?id=902 The Hastings Center] Hastings Center Fellows.\n Accessed November 6, 2010\n* Honorary Knight Commander of the Order of the British Empire (KBE), 2002[http://nobilitynews.blogspot.com/2007/03/knighthood-for-microsofts-gates.html Nobility News: Honorary Knights] 2007\n* Hope Funds for Cancer Research: James D. Watson Award of Excellence for Scientific Achievement (2014)\n* Irish America Hall of Fame, inducted March 2011O'Dowd, Niall. [http://www.irishcentral.com/IrishAmerica/Irish-America-Hall-of-Fame-Dr-James-Watson-117755213.html \"He Helped Map the Structure of DNA. Up Next is a Cure For Cancer\"], Irish America magazine, March 10, 2011. Accessed March 22, 2011. \"James Watson helped unravel the structure of DNA, a feat so stunning that it is considered the greatest scientific achievement of the 20th century. \"\n* John Collins Warren Prize of the Massachusetts General Hospital\n* John J. Carty Award in molecular biology from the National Academy of Sciences\n* Kaul Foundation Award for Excellence\n* Liberty Medal, 2000National Constitution Center.[http://www.constitutioncenter.org/libertymedal/recipient_2000.html 2000 Liberty Medal Recipients]. Retrieved on November 4, 2007.\n* Lomonosov Gold Medal, 1994\n* Lotos Club Medal of Merit, 2004\n* Mendel Medal, 2008\n* National Biotechnology Venture Award\n* National Medal of Science, 1997The National Science Foundation.[http://www.nsf.gov/od/nms/recip_details.cfm?recip_id\n377 The President's National Medal of Science: Recipient Details]. February 14, 2006. Retrieved on November 4, 2007.\n* New York Academy of Medicine Award, 1999\n* Nobel Prize in Physiology or Medicine, 1962\n* Othmer Gold Medal (2005)\n* Presidential Medal of Freedom, 1977[https://www.uchicago.edu/about/accolades/presidential.shtml Presidential Medal of Freedom, 2007]. Retrieved on November 4, 2007.\n* Research Corporation Prize\n* University of Chicago Alumni Medal, 1998\n* University College London Prize, 2000\n* University Medal at SUNY Stony Brook\n\nHonorary degrees received\n\n* DSc, University of Chicago, US, 1961\n* DSc, Indiana University, US, 1963\n* LLD, University of Notre Dame, US, 1965\n* DSc, Long Island University (CW Post), US, 1970\n* DSc, Adelphi University, US, 1972\n* DSc, Brandeis University, US, 1973\n* DSc, Albert Einstein College of Medicine, US, 1974\n* DSc, Hofstra University, US, 1976\n* DSc, Harvard University, US, 1978\n* DSc, Rockefeller University, US, 1980\n* DSc, Clarkson College of Technology, US, 1981\n* DSc, SUNY at Farmingdale, US, 1983\n* MD, Buenos Aires, Argentina, 1986\n* DSc, Rutgers University, US, 1988\n* DSc, Bard College, US, 1991\n* DSc, University of Stellenbosch, South Africa, 1993\n* DSc, Fairfield University, US, 1993\n* DSc, University of Cambridge, United Kingdom, 1993\n* DrHC, Charles University in Prague, Czech Republic, 1998\n* ScD, University of Dublin, Ireland, 2001\n\nProfessional and honorary affiliations",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "James Watson" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16289" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "James Dewey Watson (born April 6, 1928) is an American molecular biologist, geneticist and zoologist, best known as one of the co-discoverers of the structure of DNA in 1953 with Francis Crick and Rosalind Franklin. Watson, Crick, and Maurice Wilkins were awarded the 1962 Nobel Prize in Physiology or Medicine \"for their discoveries concerning the molecular structure of nucleic acids and its significance for information transfer in living material\".\n\nWatson earned degrees at the University of Chicago (BS, 1947) and Indiana University (PhD, 1950). Following a post-doctoral year at the University of Copenhagen with Herman Kalckar and Ole Maaloe, later Watson worked at the University of Cambridge's Cavendish Laboratory in England, where he first met his future collaborator and friend Francis Crick.\n\nFrom 1956 to 1976, Watson was on the faculty of the Harvard University Biology Department, promoting research in molecular biology. From 1968 he served as director of Cold Spring Harbor Laboratory (CSHL), greatly expanding its level of funding and research. At CSHL, he shifted his research emphasis to the study of cancer, along with making it a world leading research center in molecular biology. In 1994, he started as president and served for 10 years. He was then appointed chancellor, serving until he resigned in 2007 after making controversial comments claiming a link between intelligence and race. Between 1988 and 1992, Watson was associated with the National Institutes of Health, helping to establish the Human Genome Project.\n\nWatson has written many science books, including the textbook Molecular Biology of the Gene (1965) and his bestselling book The Double Helix (1968).\n\nEarly life and education\n\nJames D. Watson was born in Chicago, Illinois, on April 6, 1928, as the only son of Jean (Mitchell) and James D. Watson, a businessman descended mostly from colonial English immigrants to America. His mother's father, Lauchlin Mitchell, a tailor, was from Glasgow, Scotland, and her mother, Lizzie Gleason, was the child of Irish parents from Tipperary. Raised Catholic, he later described himself as \"an escapee from the Catholic religion.\" Watson said, \"The luckiest thing that ever happened to me was that my father didn't believe in God.\"\n\nWatson grew up on the south side of Chicago and attended public schools, including Horace Mann Grammar School and South Shore High School. He was fascinated with bird watching, a hobby shared with his father,  so he considered majoring in ornithology. Watson appeared on Quiz Kids, a popular radio show that challenged bright youngsters to answer questions. Thanks to the liberal policy of University president Robert Hutchins, he enrolled at the University of Chicago, where he was awarded a tuition scholarship, at the age of 15.\n\nAfter reading Erwin Schrödinger's book What Is Life? in 1946, Watson changed his professional ambitions from the study of ornithology to genetics. [http://www.nature.com/nature/journal/v433/n7027/full/433686a.html Reviewed by Lewis Wolpert, Nature, (2005) 433:686-687.] Watson earned his BS degree in Zoology from the University of Chicago in 1947. In his autobiography, Avoid Boring People, Watson described the University of Chicago as an \"idyllic academic institution where he was instilled with the capacity for critical thought and an ethical compulsion not to suffer fools who impeded his search for truth\", in contrast to his description of later experiences. In 1947 Watson left the University of Chicago to become a graduate student at Indiana University, attracted by the presence at Bloomington of the 1946 Nobel Prize winner Hermann Joseph Muller, who in crucial papers published in 1922, 1929, and in the 1930s had laid out all the basic properties of the heredity molecule that Schrödinger presented in his 1944 book. He received his PhD degree from Indiana University in 1950; Salvador Luria was his doctoral advisor.\n\nCareer and research\n\nLuria, Delbrück, and the Phage Group\n\nOriginally, Watson was drawn into molecular biology by the work of Salvador Luria. Luria eventually shared the 1969 Nobel Prize in Physiology or Medicine for his work on the Luria–Delbrück experiment, which concerned the nature of genetic mutations. He was part of a distributed group of researchers who were making use of the viruses that infect bacteria, called bacteriophages. He and Max Delbrück were among the leaders of this new \"Phage Group,\" an important movement of geneticists from experimental systems such as Drosophila towards microbial genetics. Early in 1948, Watson began his PhD research in Luria's laboratory at Indiana University. That spring, he met Delbrück first in Luria's apartment and again that summer during Watson's first trip to the Cold Spring Harbor Laboratory (CSHL).\n\nThe Phage Group was the intellectual medium where Watson became a working scientist. Importantly, the members of the Phage Group sensed that they were on the path to discovering the physical nature of the gene. In 1949, Watson took a course with Felix Haurowitz that included the conventional view of that time: that genes were proteins and able to replicate themselves. The other major molecular component of chromosomes, DNA, was widely considered to be a \"stupid tetranucleotide,\" serving only a structural role to support the proteins. However, even at this early time, Watson, under the influence of the Phage Group, was aware of the Avery–MacLeod–McCarty experiment, which suggested that DNA was the genetic molecule. Watson's research project involved using X-rays to inactivate bacterial viruses.\n\nWatson then went to Copenhagen University in September 1950 for a year of postdoctoral research, first heading to the laboratory of biochemist Herman Kalckar. Kalckar was interested in the enzymatic synthesis of nucleic acids, and he wanted to use phages as an experimental system. Watson, however, wanted to explore the structure of DNA, and his interests did not coincide with Kalckar's. After working part of the year with Kalckar, Watson spent the remainder of his time in Copenhagen conducting experiments with microbial physiologist Ole Maaloe, then a member of the Phage Group.\n\nThe experiments, which Watson had learned of during the previous summer's Cold Spring Harbor phage conference, included the use of radioactive phosphate as a tracer to determine which molecular components of phage particles actually infect the target bacteria during viral infection. The intention was to determine whether protein or DNA was the genetic material, but upon consultation with Max Delbrück, they determined that their results were inconclusive and could not specifically identify the newly labeled molecules as DNA. Watson never developed a constructive interaction with Kalckar, but he did accompany Kalckar to a meeting in Italy, where Watson saw Maurice Wilkins talk about his X-ray diffraction data for DNA. Watson was now certain that DNA had a definite molecular structure that could be elucidated.\n\nIn 1951, the chemist Linus Pauling in California published his model of the amino acid alpha helix, a result that grew out of Pauling's efforts in X-ray crystallography and molecular model building. After obtaining some results from his phage and other experimental research conducted at Indiana University, Statens Serum Institut (Denmark), CSHL, and the California Institute of Technology, Watson now had the desire to learn to perform X-ray diffraction experiments so he could work to determine the structure of DNA. That summer, Luria met John Kendrew, and he arranged for a new postdoctoral research project for Watson in England.  In 1951 Watson visited the Stazione Zoologica 'Anton Dohrn' in Naples.\n\nIdentifying the double helix\n\nIn mid-March 1953, using, in part, experimental data collected mainly by Rosalind Franklin and also by Maurice Wilkins, Watson and Crick deduced the double helix structure of DNA. Sir Lawrence Bragg, the director of the Cavendish Laboratory (where Watson and Crick worked), made the original announcement of the discovery at a Solvay conference on proteins in Belgium on April 8, 1953; it went unreported by the press. Watson and Crick submitted a paper entitled Molecular Structure of Nucleic Acids: A Structure for Deoxyribose Nucleic Acid to the scientific journal Nature, which was published on April 25, 1953. This has been described by some other biologists and Nobel laureates as the most important scientific discovery of the 20th century.  Bragg gave a talk at the Guy's Hospital Medical School in London on Thursday, May 14, 1953, which resulted in a May 15, 1953, article by Ritchie Calder in the London newspaper News Chronicle, entitled \"Why You Are You. Nearer Secret of Life.\"\n\nSydney Brenner, Jack Dunitz, Dorothy Hodgkin, Leslie Orgel, and Beryl M. Oughton were some of the first people in April 1953 to see the model of the structure of DNA, constructed by Crick and Watson; at the time, they were working at Oxford University's Chemistry Department. All were impressed by the new DNA model, especially Brenner, who subsequently worked with Crick at Cambridge in the Cavendish Laboratory and the new Laboratory of Molecular Biology. According to the late Beryl Oughton, later Rimmer, they all travelled together in two cars once Dorothy Hodgkin announced to them that they were off to Cambridge to see the model of the structure of DNA.\n\nThe Cambridge University student newspaper Varsity also ran its own short article on the discovery on Saturday, May 30, 1953. Watson subsequently presented a paper on the double-helical structure of DNA at the 18th Cold Spring Harbor Symposium on Viruses in early June 1953, six weeks after the publication of the Watson and Crick paper in Nature. Many at the meeting had not yet heard of the discovery. The 1953 Cold Spring Harbor Symposium was the first opportunity for many to see the model of the DNA double helix.\n\nWatson, Crick, and Wilkins were awarded the Nobel Prize in Physiology or Medicine in 1962 for their research on the structure of nucleic acids. Rosalind Franklin had died in 1958 and was therefore ineligible for nomination.\n\nThe publication of the double helix structure of DNA can be regarded as a turning point in science: human understanding of life was fundamentally changed and the modern era of biology began.\n\nHarvard University\n\nIn 1956, Watson accepted a position in the Biology department at Harvard University. His work at Harvard focused on RNA and its role in the transfer of genetic information.\nAt Harvard University, Watson achieved a series of academic promotions from assistant professor to associate professor to full professor of biology. Watson claimed, however, that he was refused a $1,000 raise in salary after winning the Nobel Prize.\n\nHe championed a switch in focus for the school from classical biology to molecular biology, stating that disciplines such as ecology, developmental biology, taxonomy, physiology, etc. had stagnated and could progress only once the underlying disciplines of molecular biology and biochemistry had elucidated their underpinnings, going so far as to discourage their study by students.\n\nWatson continued to be a member of the Harvard faculty until 1976, even though he took over the directorship of Cold Spring Harbor Laboratory in 1968.\n\nViews on Watson's scientific contributions while at Harvard are somewhat mixed.  His most notable achievements in his two decades at Harvard may be what he wrote about science, rather than anything he discovered during that time.  Watson's first textbook, The Molecular Biology of the Gene, set a new standard for textbooks, particularly through the use of concept heads—brief declarative subheadings.  His next textbook was Molecular Biology of the Cell, in which he coordinated the work of a group of scientist-writers. His third textbook was Recombinant DNA, which described the ways in which genetic engineering has brought much new information about how organisms function. The textbooks are still in print.\n\nPublishing The Double Helix\n\nIn 1968, Watson wrote The Double Helix, listed by the Board of the Modern Library as number seven in their list of 100 Best Nonfiction books.  The book details the sometimes painful story of not only the discovery of the structure of DNA, but also the personalities, conflicts and controversy surrounding their work. Watson's original title was to have been \"Honest Jim\", in that the book recounts the discovery of the double helix from Watson's point of view and included many of his private emotional impressions at the time. Some controversy surrounded the publication of the book. Watson's book was originally to be published by the Harvard University Press, but Francis Crick and Maurice Wilkins objected, among others. Watson's home university dropped the project and the book was commercially published.Watson's 1968 autobiographical account, The Double Helix: A Personal Account of the Discovery of the Structure of DNA. For an edition which contains critical responses, book reviews, and copies of the original scientific papers, see James D. Watson, The Double Helix: A Personal Account of the Discovery of the Structure of DNA, Norton Critical Edition, Gunther Stent, ed. (New York: Norton, 1980).\n\nCold Spring Harbor Laboratory\n\nIn 1968, Watson became the Director of the Cold Spring Harbor Laboratory (CSHL). Between 1970 and 1972, the Watsons' two sons were born, and by 1974, the young family made Cold Spring Harbor their permanent residence. Watson served as the laboratory's director and president for about 35 years, and later he assumed the role of chancellor and then Chancellor Emeritus.\n\nIn his roles as director, president, and chancellor, Watson led CSHL to articulate its present-day mission, \"dedication to exploring molecular biology and genetics in order to advance the understanding and ability to diagnose and treat cancers, neurological diseases, and other causes of human suffering.\" CSHL substantially expanded both its research and its science educational programs under Watson’s direction.  He is credited with \"transforming a small facility into one of the world’s great education and research institutions. Initiating a program to study the cause of human cancer, scientists under his direction have made major contributions to understanding the genetic basis of cancer.\" In a retrospective summary of Watson's accomplishments there, Bruce Stillman, the laboratory's president,  said, \"Jim Watson created a research environment that is unparalleled in the world of science.\"\n\nIn October 2007, Watson was suspended following criticism of his views on genetic factors relating to intelligence,  and a week later, on the 25th, he retired at the age of 79 from CSHL from what the lab called \"nearly 40 years of distinguished service\".  In a statement, Watson attributed his retirement to his age, and circumstances that he could never have anticipated or desired.Controversial DNA Scientist James Watson Retires © 2007 Associated Press/AP Online. © 2007 Sci-Tech Today. October 25, 2007 11:29 am\n\nHuman Genome Project\n\nIn 1990, Watson was appointed as the Head of the Human Genome Project at the National Institutes of Health, a position he held until April 10, 1992. Watson left the Genome Project after conflicts with the new NIH Director, Bernadine Healy. Watson was opposed to Healy's attempts to acquire patents on gene sequences, and any ownership of the \"laws of nature.\" Two years before stepping down from the Genome Project, he had stated his own opinion on this long and ongoing controversy which he saw as an illogical barrier to research; he said, \"The nations of the world must see that the human genome belongs to the world's people, as opposed to its nations.\" He left within weeks of the 1992 announcement that the NIH would be applying for patents on brain-specific cDNAs.Pollack, R.. 1994. Signs of Life: The Language and Meanings of DNA. Houghton Mifflin Company, p. 95. . (The issue of the patentability of genes has since been resolved in the US by the US Supreme Court; see Association for Molecular Pathology v. U.S. Patent and Trademark Office)\n\nIn 1994, Watson became President of CSHL. Francis Collins took over the role as Director of the Human Genome Project.\n\nIn 2007, James Watson became the second person[https://www.nytimes.com/2007/06/01/science/01gene.html?_r1&oref\nslogin Genome of DNA Discoverer Is Deciphered] NYT, June 1, 2007. to publish his fully sequenced genome online,[http://jimwatsonsequence.cshl.edu/ James Watson genotypes, on NCBI B36 assembly]  after it was presented to him on May 31, 2007, by 454 Life Sciences Corporation in collaboration with scientists at the Human Genome Sequencing Center, Baylor College of Medicine. Watson was quoted as saying, \"I am putting my genome sequence on line to encourage the development of an era of personalized medicine, in which information contained in our genomes can be used to identify and prevent disease and to create individualized medical therapies\".Cold Spring Harbor Laboratory, June 28, 2003. [http://www.cshl.edu/public/releases/07_genotype_viewer.html Watson Genotype Viewer Now On Line] . Press release. Retrieved on September 16, 2007.[https://archive.is/20120803192155/http://jimwatsonsequence.cshl.edu/cgi-perl/gbrowse/jwsequence/?name=Sequence:NM_005516.3 James Watson's Personal Genome Sequence][ftp://ftp.ncbi.nih.gov/pub/TraceDB/Personal_Genomics/ Watson's personal DNA sequence archive at the National Institutes of Health]\n\nRole of oxidants in disease\n\nIn 2014 Watson published a paper in The Lancet suggesting that biological oxidants may have a different role than is thought in diseases including diabetes, dementia, heart disease and cancer. For example, type 2 diabetes is usually thought to be caused by oxidation in the body that causes inflammation and kills off pancreatic cells. Watson thinks the root of that inflammation is different: \"a lack of biological oxidants, not an excess\", and discusses this in detail. One critical response was that the idea was neither new nor worthy of merit, and that The Lancet published Watson's paper only because of his name. However, other scientists have expressed their support for his hypothesis and have proposed that it can also be expanded to why a lack of oxidants can result in cancer and its progression.\n\nNotable former students\n\nSeveral of Watson's former doctoral students subsequently became notable in their own right including, Mario Capecchi, Bob Horvitz, Charles Kurland, Peter D. Moore and Joan Steitz. Besides numerous PhD students, Watson also supervised postdoctoral students and other interns including Ewan Birney, Ronald W. Davis, Phillip Allen Sharp (postdoc), John Tooze, (postdoc) and Richard J. Roberts (postdoc).\n\nSelected books published\n\n* James D. Watson, The Annotated and Illustrated Double Helix, edited by Alexander Gann and Jan Witkowski (2012) Simon & Schuster, .\n* \n*  (Norton Critical Editions, 1981).\n* \n* \n* \n* \n\nOther affiliations\n\nWatson is a former member of the Board of Directors of United Biomedical, Inc., founded by Chang Yi Wang. He held the position for six years and retired from the board in 1999.\n\nIn January 2007, Watson accepted the invitation of Leonor Beleza, president of the Champalimaud Foundation, to become the head of the foundation's scientific council, an advisory organ.\n\nWatson has also been an institute adviser for the Allen Institute for Brain Science.\n\nPolitical activism\n\nDuring his tenure as a professor at Harvard, Watson participated in several political protests:\n* Vietnam War: While a professor at Harvard University, Watson, along with \"12 Faculty members of the department of Biochemistry and Molecular Biology\" including one other Nobel prize winner, spearheaded a resolution for \"the immediate withdrawal of U.S. forces from Vietnam.\"\"Faculty Support Grows For Anti-War Proposal\", The Harvard Crimson, October 3, 1969. November 4, 2007.\n* Nuclear proliferation and environmentalism: In 1975, on the \"thirtieth anniversary of the bombing of Hiroshima,\" Watson along with \"over 2000 scientists and engineers\" spoke out against nuclear proliferation to President Ford in part because of the \"lack of a proven method for the ultimate disposal of radioactive waste\" and because \"The writers of the declaration see the proliferation of nuclear plants as a major threat to American liberties and international safety because they say safeguard procedures are inadequate to prevent terrorist theft of commercial reactor-produced plutonium.\"\"Three Harvard Scientists Lead Call to Stop Nuclear Reactors\", The Harvard Crimson, August 5, 1975. November 4, 2007.\n* In 2007, Watson said, \"I turned against the left wing because they don't like genetics, because genetics implies that sometimes in life we fail because we have bad genes. They want all failure in life to be due to the evil system.\"\n\nControversies\n\nUse of King's College results\n\nAn enduring controversy has been generated by Watson and Crick's unauthorized use of DNA X-ray diffraction data collected by Rosalind Franklin and Raymond Gosling. The controversy arose from the fact that some of Franklin's unpublished data were used without her consent by Watson and Crick in their construction of the double helix model of DNA.Judson, H.F. 1996. The Eighth Day of Creation: Makers of the Revolution in Biology. Cold Spring Harbor Laboratory Press, chapter 3. .  Franklin's experimental results provided estimates of the water content of DNA crystals and these results were consistent with the two sugar-phosphate backbones being on the outside of the molecule. Franklin personally told Crick and Watson that the backbones had to be on the outside, which was a crucial piece of information because before then Linus Pauling and Watson and Crick had generated erroneous models with the chains inside and the bases pointing outwards. Her identification of the space group for DNA crystals revealed to Crick that the two DNA strands were antiparallel.\n\nThe X-ray diffraction images collected by Gosling and Franklin provided the best evidence for the helical nature of DNA. Franklin's experimental work thus proved crucial in Watson and Crick's discovery. Watson and Crick had three sources for Franklin's unpublished data: \n#her 1951 seminar, attended by Watson,\n#discussions with Wilkins, who worked in the same laboratory with Franklin, \n#a research progress report that was intended to promote coordination of Medical Research Council-supported laboratories. Watson, Crick, Wilkins and Franklin all worked in MRC laboratories.\n\nPrior to publication of the double helix structure, Watson and Crick had little interaction with Franklin. Crick and Watson felt that they had benefited from collaborating with Wilkins. They offered him a co-authorship on the article that first described the double helix structure of DNA. Wilkins turned down the offer, a fact that may have led to the terse character of the acknowledgment of experimental work done at King's College in the eventual published paper. Rather than make any of the DNA researchers at King's College co-authors on the Watson and Crick double helix article, the solution that was arrived at was to publish two additional papers from King's College along with the helix paper.\n\nAccording to one critic, Watson's portrayal of Franklin in The Double Helix (written after Franklin's death when libel laws did not apply anymore) was negative and gave the appearance that she was Wilkins' assistant and was unable to interpret her own DNA data. The latter accusation was indefensible since, e.g., Franklin herself told Crick and Watson that the helix backbones had to be on the outside, which was crucial to the elucidation of the helix since before this both Crick and Watson and Linus Pauling had independently generated flawed models with the chains inside and the bases pointing outwards.\n\nIn his book The Double Helix, Watson described being intimidated by Franklin and that they were unable to establish constructive scientific interactions during the time period when Franklin was doing DNA research. In the book's epilogue, written after Franklin's death, Watson acknowledges his early impressions of Franklin were often wrong, that she faced enormous barriers as a woman in the field of science even though her work was superb, and that it took them years to overcome their bickering before he could appreciate Franklin's generosity and integrity.\n\nA review of the handwritten correspondence from Franklin to Watson, located in the archives at CSHL, reveals that the two scientists later had exchanges of constructive scientific correspondence. In fact, Franklin consulted with Watson on her tobacco mosaic virus RNA research. Franklin's letters begin on friendly terms with \"Dear Jim\", and conclude with equally benevolent and respectful sentiments such as \"Best Wishes, Yours, Rosalind\". Each of the scientists published their own unique contributions to the discovery of the structure of DNA in separate articles, and all of the contributors published their findings in the same volume of Nature. These classic molecular biology papers are identified as: Watson J.D. and Crick F.H.C. \"A Structure for Deoxyribose Nucleic Acid\" Nature 171, 737-738 (1953), Wilkins M.H.F., Stokes A.R. & Wilson, H.R. \"Molecular Structure of Deoxypentose Nucleic Acids\" Nature 171, 738-740 (1953), Franklin R. and Gosling R.G. \"Molecular Configuration in Sodium Thymonucleate\" Nature 171, 740-741 (1953).\n\nThe wording on the DNA sculpture (which was donated by Watson) outside Clare College's Memorial Court, Cambridge, England is:\n\nOn the base:\n* \"These strands unravel during cell reproduction. Genes are encoded in the sequence of bases.\"\n* \"The double helix model was supported by the work of Rosalind Franklin and Maurice Wilkins.\"\n\nOn the helices:\n* \"The structure of DNA was discovered in 1953 by Francis Crick and James Watson while Watson lived here at Clare.\"\n* \"The molecule of DNA has two helical strands that are linked by base pairs Adenine - Thymine or Guanine - Cytosine.\"\n\nControversial comments\n\nWatson has often expressed provocative concepts and disparaging opinions of others within the realm of genetic research.\n* He has been quoted in The Sunday Telegraph, 1997, as stating: \"If you could find the gene which determines sexuality and a woman decides she doesn't want a homosexual child, well, let her.\"Macdonald, V. \"Abort babies with gay genes, says Nobel winner\", The Telegraph, February 16, 1997. Retrieved on October 24, 2007. The biologist Richard Dawkins wrote a letter to The Independent claiming that Watson's position was misrepresented by The Sunday Telegraph article, and that Watson would equally consider the possibility of having a heterosexual child to be just as valid as any other reason for abortion, to emphasise that Watson is in favor of allowing choice.\n* On the issue of obesity, Watson has also been quoted as saying, 2000: \"Whenever you interview fat people, you feel bad, because you know you're not going to hire them.\"Abate, T. [http://www.sfgate.com/cgi-bin/article.cgi?file\n/chronicle/archive/2000/11/13/MN111208.DTL \"Nobel Winner's Theories Raise Uproar in Berkeley Geneticist's views strike many as racist, sexist\"], San Francisco Chronicle, November 13, 2000. Retrieved on October 24, 2007.\n* While speaking at a conference in 2000, Watson had suggested a link between skin color and sex drive, hypothesizing that dark-skinned people have stronger libidos. His lecture argued that extracts of melanin – which gives skin its color – had been found to boost subjects' sex drive. \"That's why you have Latin lovers,\" he said, according to people who attended the lecture. \"You've never heard of an English lover. Only an English Patient.\"\n* Watson has repeatedly supported genetic screening and genetic engineering in public lectures and interviews, arguing that stupidity is a disease and the \"really stupid\" bottom 10% of people should be cured.Bhattacharya, S. [https://www.newscientist.com/article/dn3451 \"Stupidity should be cured, says DNA discoverer\"], New Scientist News Service, February 28, 2003. Retrieved June 24, 2007. He has also suggested that beauty could be genetically engineered, saying in 2003, \"People say it would be terrible if we made all girls pretty. I think it would be great.\"\n* Watson has had quite a few disagreements with Craig Venter regarding his use of EST fragments while Venter worked at NIH.  Venter went on to found Celera genomics and continued his feud with Watson.  Watson was even quoted as calling Venter \"Hitler\".Shreeve. J. 2005. The Genome War: How Craig Venter Tried to Capture the Code of Life and Save the World. Ballantine Books, p. 48. .\n\nAvoid Boring People, UK book tour and resignation\n\nIn his memoir, Avoid Boring People: Lessons from a Life in Science, Watson describes his academic colleagues as \"dinosaurs\", \"deadbeats\", \"fossils\", \"has-beens\", \"mediocre\", and \"vapid\". Steve Shapin in Harvard Magazine noted that Watson had written an unlikely \"Book of Manners\", telling about the skills needed at different times in a scientist's career; he wrote Watson was known for aggressively pursuing his own goals at the university. E. O. Wilson once described Watson as \"the most unpleasant human being I had ever met\", but in a later TV interview said that he considered them friends and their rivalry at Harvard old history (when they had competed for funding in their respective fields).\"[http://harvardmagazine.com/2008/01/chairman-of-the-bored.html Chairman of the Bored]\", Steven Shapin, Harvard Magazine, January–February 2008[http://video.google.com/videoplay?docid=-6927851714963534233 Charlie Rose Interview, paired with E. O. Wilson]  December 14, 2005\n\nIn the epilogue to the memoir Avoid Boring People, Watson alternately attacks and defends former Harvard University president Lawrence Summers, who stepped down in 2006 due in part to his remarks about women and science.  Watson also states in the epilogue, \"Anyone sincerely interested in understanding the imbalance in the representation of men and women in science must reasonably be prepared at least to consider the extent to which nature may figure, even with the clear evidence that nurture is strongly implicated.\"\n\nIn early October 2007, Watson was about to embark on a UK book tour to promote the memoir. He was interviewed by Charlotte Hunt-Grubbe at CSHL.  In 1996, she had been a student there in a program in which Watson recruited students to live at his family home and work at CSHL for a year. Hunt-Grubbe had gone on to work for the Sunday Times Magazine; she was selected for the interview as she was one of the few women to have been mentored by him. Hunt-Grubbe broached the subject of whether race was a factor in his hypothesis of divergence of intellect between geographically isolated populations.   The following is a transcript of that part of the interview:\n\nThough other publications noted that the paper had \"[kept] the profile sympathetic and place[d] the comments at the end of the piece\", the article was a public relations disaster for Watson. The Sunday Times Magazine editor Cathy Galvin noted, \"It was important the reader understood Charlotte's relationship with Watson and her regard for him before exploring the explosive and unscientific territory of his opinions and history of statements about women, race, and abortion which have stirred so much controversy in the past.\"\n\nWatson's comments drew attention and criticism in the UK. Watson said his intention was to promote science not racism, but some of the UK venues canceled his appearances.[http://news.bbc.co.uk/2/hi/uk_news/england/london/7050020.stm \"Museum drops race row scientist\"], BBC, October 18, 2007. Retrieved October 24, 2007. Watson canceled the rest of his tour.[http://www.msnbc.msn.com/id/21362732/ \"Race remarks get Nobel winner in trouble\"], MSNBC and AP, October 18, 2007. Retrieved October 18, 2007.Syal, R. [http://www.timesonline.co.uk/tol/news/uk/science/article2687364.ece \"Nobel scientist who sparked race row says sorry - I didn't mean it\"], Times Online, October 19, 2007. Retrieved October 24, 2007.\"Watson Returns to USA after race row\", International Herald Tribune, October 19, 2007. Retrieved on November 10, 2007[http://entertainment.timesonline.co.uk/tol/arts_and_entertainment/the_tls/article3039959.ece Jerry A. Coyne, \"The complex James Watson\"], Times Literary Supplement, December 12, 2007[http://thesciencenetwork.org/programs/the-science-studio/avoid-boring-people-lessons-from-a-life-in-science \"Interview with James Watson: 'How to Avoid Boring People: Lessons from a Life in Science'\"], The Science Network\n\nBecause of the public controversy, on October 18, 2007, the Board of Trustees at Cold Spring Harbor Laboratory suspended Watson's administrative responsibilities. On October 19, Watson issued an apology; on October 25, he resigned from his position as chancellor.Watson, J.D. [https://www.independent.co.uk/voices/commentators/james-watson-to-question-genetic-intelligence-is-not-racism-5328720.html \"James Watson: To question genetic intelligence is not racism\"], Independent, October 19, 2007. Retrieved October 24, 2007Cold Spring Harbor Laboratory. October 18, 2007. [http://www.cshl.edu/public/releases/07_statement2.html Statement by Cold Spring Harbor Laboratory Board of Trustees and President Bruce Stillman, PhD Regarding Dr. Watson’s Comments in The Sunday Times on October 14, 2007]. Press release. Retrieved October 24, 2007. Wigglesworth, K.[http://articles.latimes.com/2007/oct/26/science/sci-watson26 DNA pioneer quits after race comments], L.A. Times, October 26, 2007. Retrieved December 5, 2007\"[http://www.cnn.com/2007/TECH/science/10/25/watson.resigns/index.html \"Nobel prize-winning biologist resigns.\"]\", CNN, October 25, 2007. Retrieved on October 25, 2007.van Marsh, A. [http://www.cnn.com/2007/WORLD/europe/10/18/nobel.apology/index.html \"Nobel-winning biologist apologizes for remarks about blacks\"], CNN, October 19, 2007. Retrieved October 24, 2007.\"DNA Pioneer Watson Resigns Amid Cloud of Scandal\" by Malcolm Ritter AP 10/25/07 11:29 am PhTWatson, J.[https://www.nytimes.com/2007/10/25/science/26wattext.html Statement by James D. Watson \"Retirement\"], New York Times, October 25, 2007. Retrieved December 5, 2007. In 2008, Watson was appointed chancellor emeritus of CSHL. As of 2009, he continues to advise and guide project work at the laboratory. In a 2008 BBC documentary, Watson said: \"I have never thought of myself as a racist. I don't see myself as a racist. I am mortified by it. It was the worst thing in my life.\"[http://video.google.com/videoplay?docid\n-1424386236177531815#28m0s Video: BBC 2 Horizon: The President's Guide to Science] , September 16, 2008, see 28:00 to 34:00 mark An editorial in Nature at the time acknowledged that his remarks were \"beyond the pale,\" but wished that the tour had not been cancelled so that Watson would be forced to face his critics in person, encouraging scientific discussion on the matter.[http://www.nature.com/nature/journal/v449/n7165/full/449948a.html \" Watson's folly\"], Nature, October 24, 2007. Retrieved September 27, 2008.\n\nSale of Nobel Prize Medal\n\nIn 2014, he decided to auction off his Nobel prize medal in view of his diminished income after the 2007 incident and to use part of the funds raised by the sale to support scientific research. The medal sold at auction at Christie's in December 2014 for .  Watson intended to contribute the proceeds to conservation work in Long Island and to funding research at Trinity College, Dublin, as well as the purchase of artwork.\nWatson is the first living recipient of the honor to auction the medal.\n\nThe medal was subsequently returned to Watson by the purchaser, Russian tycoon Alisher Usmanov, who stated that Watson deserved the medal and that \"a situation in which an outstanding scientist has to sell a medal recognising his achievements is unacceptable.\"\n\nPersonal life\n\nWatson is an atheist. In 2003, he was one of 22 Nobel Laureates who signed the Humanist Manifesto.\n\nMarriage and family\n\nWatson married Elizabeth Lewis in 1968. They have two sons, Rufus Robert Watson (b. 1970) and Duncan James Watson (b. 1972). Watson sometimes talks about his son Rufus, who suffers from schizophrenia. He wants to encourage progress in the understanding and treatment of mental illness by determining how genetics contribute to it.[http://www.telegraph.co.uk/news/worldnews/northamerica/usa/5300883/DNA-father-James-Watsons-holy-grail-request.html DNA father James Watson's 'holy grail' request] May 10, 2009\n\nAwards and honors\n\nWatson has won numerous awards including:\n\n* Albert Lasker Award for Basic Medical Research, 1960The Lasker Foundation.[http://www.laskerfoundation.org/awards/1960basic.htm 1960 Winners] . Retrieved on November 4, 2007.\n* EMBO Membership in 1985\n* Benjamin Franklin Medal for Distinguished Achievement in the Sciences (2001)\n* Charles A. Dana Award, 1994\n* Copley Medal of the Royal Society, 1993\n* [http://doublehelixmedals.cshl.edu/history_08.html CSHL Double Helix Medal Honoree, 2008]\n* Eli Lilly Award in Biological Chemistry, 1960\n* Fellow of the New York Academy of Sciences\n* Gairdner Foundation International Award, 2002\n* Heald Award\n* Honorary Fellow, the Hastings Center, an independent bioethics research institution[http://www.thehastingscenter.org/About/Default.aspx?id=902 The Hastings Center] Hastings Center Fellows.\n Accessed November 6, 2010\n* Honorary Knight Commander of the Order of the British Empire (KBE), 2002[http://nobilitynews.blogspot.com/2007/03/knighthood-for-microsofts-gates.html Nobility News: Honorary Knights] 2007\n* Hope Funds for Cancer Research: James D. Watson Award of Excellence for Scientific Achievement (2014)\n* Irish America Hall of Fame, inducted March 2011O'Dowd, Niall. [http://www.irishcentral.com/IrishAmerica/Irish-America-Hall-of-Fame-Dr-James-Watson-117755213.html \"He Helped Map the Structure of DNA. Up Next is a Cure For Cancer\"], Irish America magazine, March 10, 2011. Accessed March 22, 2011. \"James Watson helped unravel the structure of DNA, a feat so stunning that it is considered the greatest scientific achievement of the 20th century. \"\n* John Collins Warren Prize of the Massachusetts General Hospital\n* John J. Carty Award in molecular biology from the National Academy of Sciences\n* Kaul Foundation Award for Excellence\n* Liberty Medal, 2000National Constitution Center.[http://www.constitutioncenter.org/libertymedal/recipient_2000.html 2000 Liberty Medal Recipients]. Retrieved on November 4, 2007.\n* Lomonosov Gold Medal, 1994\n* Lotos Club Medal of Merit, 2004\n* Mendel Medal, 2008\n* National Biotechnology Venture Award\n* National Medal of Science, 1997The National Science Foundation.[http://www.nsf.gov/od/nms/recip_details.cfm?recip_id\n377 The President's National Medal of Science: Recipient Details]. February 14, 2006. Retrieved on November 4, 2007.\n* New York Academy of Medicine Award, 1999\n* Nobel Prize in Physiology or Medicine, 1962\n* Othmer Gold Medal (2005)\n* Presidential Medal of Freedom, 1977[https://www.uchicago.edu/about/accolades/presidential.shtml Presidential Medal of Freedom, 2007]. Retrieved on November 4, 2007.\n* Research Corporation Prize\n* University of Chicago Alumni Medal, 1998\n* University College London Prize, 2000\n* University Medal at SUNY Stony Brook\n\nHonorary degrees received\n\n* DSc, University of Chicago, US, 1961\n* DSc, Indiana University, US, 1963\n* LLD, University of Notre Dame, US, 1965\n* DSc, Long Island University (CW Post), US, 1970\n* DSc, Adelphi University, US, 1972\n* DSc, Brandeis University, US, 1973\n* DSc, Albert Einstein College of Medicine, US, 1974\n* DSc, Hofstra University, US, 1976\n* DSc, Harvard University, US, 1978\n* DSc, Rockefeller University, US, 1980\n* DSc, Clarkson College of Technology, US, 1981\n* DSc, SUNY at Farmingdale, US, 1983\n* MD, Buenos Aires, Argentina, 1986\n* DSc, Rutgers University, US, 1988\n* DSc, Bard College, US, 1991\n* DSc, University of Stellenbosch, South Africa, 1993\n* DSc, Fairfield University, US, 1993\n* DSc, University of Cambridge, United Kingdom, 1993\n* DrHC, Charles University in Prague, Czech Republic, 1998\n* ScD, University of Dublin, Ireland, 2001\n\nProfessional and honorary affiliations. James Watson. http://en.wikipedia.org/?curid=16289."
  }
}
