{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3427",
  "eid" : "c694a700-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778412912,
  "textBody" : "Beavis and Butt-Head is an American animated sitcom created and designed by Mike Judge. The series originated from Frog Baseball, a 1992 short film by Judge originally aired on Liquid Television. After seeing the short, MTV signed Judge to develop the concept. The series first ran from March 8, 1993, to November 28, 1997. The series was later renewed for an eighth season, which aired from October 27 to December 29, 2011. In 1996, the series was adapted into the animated feature film Beavis and Butt-Head Do America.\n\nPremise \n\nThe show centers on two socially incompetent, heavy metal-loving teenage delinquents, Beavis and Butt-Head (both voiced by Judge), who go to school at Highland High in Highland, Texas. They have no apparent adult supervision at home, are dim-witted, under-educated and barely literate. Both lack any empathy or moral scruples, even regarding each other. Their most common shared activity is watching music videos, which they tend to judge by deeming them \"cool,\" or by exclaiming, \"This sucks!\" (the latter is sometimes followed by the demand, \"Change it!\"). They also apply these judgments to other things that they encounter, and will usually deem something \"cool\" if it is associated with violence, sex, or the macabre. Despite having no experience with women, their other signature traits are a shared obsession with sex, and their tendency to chuckle and giggle (“Heh heh heh!”Judge, Mike. Reading Sucks: The Collected Works of Beavis and Butt-Head. Simon and Schuster, 2005.  .) whenever they hear words or phrases that can even remotely be interpreted as sexual or scatological.\n\nThough Beavis and Butt-Head are in ninth grade at Highland High School, their stupidity leads to a demotion all the way down to kindergarten in the episode \"Held Back,\" but they soon prove to be such an annoyance that the elementary school principal quickly re-promotes them back to Highland High.\n\nEach episode features frequent interstitial scenes in which they critique music videos using commentary improvised by Judge. The remainder of the episode depicts the duo embarking on some kind of scheme or adventure. Their teachers at Highland High are often at a loss as to how to deal with them, and in many episodes, they skip school altogether. Their actions sometimes result in serious consequences, but often for others, for which they themselves show no remorse whatsoever.\n\nEpisodes \n\nReception \n\nCritical reception \n\nOver its run, Beavis and Butt-Head drew a notable amount of both positive and negative reaction from the public with its combination of lewd humor and implied criticism of society. It became the focus of criticism from social conservatives, such as Michael Medved, while others, such as David Letterman, and the conservative magazine National Review, defended it as a cleverly subversive vehicle for social criticism and a particularly creative and intelligent comedy. Either way, the show captured the attention of many young television viewers in the United States and abroad and is often considered a classic piece of 1990s youth culture and Generation X. Trey Parker and Matt Stone, creators of South Park, cite the show as an influence and compared it to the blues. They met Mike Judge before the show aired.\"Taint of Greatness: The Journey of Beavis and Butt-Head Part 2,\" in The Mike Judge Collection Volume 2\n\nIn 1997, Dan Tobin of The Boston Phoenix commented on the series' humor, stating that it transformed \"stupidity into a crusade, forcing us to acknowledge how little it really takes to make us laugh.\"\"[http://www.bostonphoenix.com/archive/tv/97/11/BEAVIS_AND_BUTTHEAD.html Butting out] ,\" The Boston Phoenix In 1997, Ted Drozdowski of The Boston Phoenix described the 1997 Beavis and Butt-Head state as \"reduced to self-parody of their self-parody.\"\"[http://bostonphoenix.com/archive/tv/97/05/TEN_REASONS.html Eye pleasers] ,\" The Boston Phoenix. In December 2005, TV Guide even ranked the duo's distinct laughing at #66 on their list of the 100 Greatest TV Quotes and Catchphrases.[http://www.tvland.com/originals/catchphrases/quotes.jhtml The 100 Greatest TV Quotes and Catchphrases] , TV Guide. Retrieved on 2008-04-02. In 2009, it was ranked No. 8 by TV Guide in their list of \"TV's Top 25 Animated Shows.\"  In 2012, TV Guide ranked Beavis and Butt-head as one of the top 60 Greatest TV Cartoons of All Time.\n\nMike Judge himself is highly critical of the animation and quality of earlier episodes, in particular the first two – Give Blood/Blood Drive and Door to Door – which he described as \"awful, I don't know why anybody liked it... I was burying my head in the sand.\"\"Taint of Greatness: The Story of Beavis and Butt-Head Part 1\", in The Mike Judge Collection Volume 1\n\nCriticism and controversy \n\nEarly installments gave them a juvenile obsession with fire and dangerous behavior, summed up with Beavis' chanting of \"Fire! Fire!\" The show was blamed for the death of a two-year-old in Moraine, Ohio in October 1993. The girl's five-year-old brother set fire to his mother's mobile home with a cigarette lighter, killing the two-year-old. Because of this, MTV pulled the episode temporarily. The mother took the boy's bedroom door off its hinges so she could keep an eye on him. She later claimed that her son watched one of the fire-related segments shortly before he burned down the home. However, neighbors claimed that the family did not have cable television. This also raises the question of where the parents were and why the cigarette lighter was where he could reach it.\n\nAs a result, references to fire were removed from subsequent airings. The creators found a censorship loophole and took delight in sometimes making Beavis scream things that sounded very similar to his previous \"Fire! Fire!\" (such as \"Fryer! Fryer!\" when he and Butt-Head are working the late shift at Burger World) and also having him almost say the forbidden word (such as one time when he sang \"Liar, liar, pants on...\" and pausing before \"fire\" (\"Liar! Liar!\"). There was also a music video where a man runs on fire in slow motion (\"California\" by Wax). Beavis is hypnotized by it and can barely say \"fire\". However, MTV eventually removed the episode entirely. References to fire were cut from earlier episodes — even the original tapes were altered permanently. Other episodes MTV opted not to rerun included \"Stewart's House\" and \"Way Down Mexico Way\". Copies of early episodes with the controversial content intact are rare. The ones that exist are made from home video recordings of the original broadcasts. In an interview included with the Mike Judge Collection DVD set, Judge said he is uncertain whether some of the earlier episodes still exist in their uncensored form.\n\nWhen new episodes returned in 2011, MTV allowed Beavis to use the word \"fire\" once again uncensored. During the first video segment during \"Werewolves of Highland\", the first new episode of the revival, Beavis utters the word \"fire\" a total of 7 times within 28 seconds, with Butt-head saying it once as well.\n\nThe show has also been blamed for animal cruelty and the death of a cat with fireworks. In the summer of 1993, Dick Zimmerman, a 44-year-old retired broadcasting executive from Larkspur, California, happened to see the episode in which Butt-head joked, \"Hey, Beavis, let's go over to Stewart's house and light [a firecracker] in his cat's butt.\" Five days later, a cat was found killed by a firecracker in nearby Santa Cruz. Zimmerman, winner of a $10 million state lottery in 1988, immediately put up a $5,000 reward for the perpetrators, told the press that Beavis and Butt-Head was responsible for the death, and started a letter-writing campaign against the show. By the fall, 4,000 people from around the country had joined his campaign.John Leland, \"Battle For Your Brain\", Newsweek, October 11, 1993, p. 51\n\nIn February 1994, watchdog group Morality in Media claimed that the death of eight-month-old Natalia Rivera, struck by a bowling ball thrown from an overpass onto a Jersey City, New Jersey highway near the Holland Tunnel by 18-year-old Calvin J. Settle, was partially inspired by Beavis and Butt-Head. The group said that Settle was influenced by Ball Breakers, in which Beavis and Butt-Head loaded a bowling ball with explosives and dropped it from a rooftop. While Morality in Media claimed that the show inspired Settle's actions, the case's prosecutors did not. Later it was revealed by both prosecutors and the defendant that Settle did not have cable TV and did not watch the show.\n\nIn Lightning Strikes, the show parodies blaming actions on youth culture. When asked by a reporter why they were flying a kite in a thunderstorm, the duo explained that they were inspired by a documentary about Benjamin Franklin, who Butt-head describes as \"some old dude with long hair and glasses\". The reporter asks if it was Howard Stern, and when Butt-head answers \"no\", she asks if he has ever listened to Stern's radio program. The reporter continues asking them leading questions until they mention that they had watched rock music videos earlier in the day. The reporter then concludes on the air that the music videos are to blame for the duo's actions.\n\nMTV also responded by broadcasting the program after 11:00 p.m., and included a disclaimer, reminding viewers:\nBeavis and Butt-Head are not real. They are stupid cartoon people completely made up by this Texas guy whom we hardly even know. Beavis and Butt-Head are dumb, crude, thoughtless, ugly, sexist, self-destructive fools. But for some reason, the little wienerheads make us laugh.\nThis was later changed to:\nBeavis and Butt-Head are not role models. They're not even human. They're cartoons. Some of the things they do would cause a person to get hurt, expelled, arrested, possibly deported. To put it another way: Don't try this at home.\nThis disclaimer also appears before the opening of their Sega Genesis and Super NES game as well as their Windows game Beavis and Butt-Head in Virtual Stupidity.\n\nThey were famously lambasted by Democratic senator Fritz Hollings as \"Buffcoat and Beaver.\" This subsequently became a running gag on the show where adults mispronounced their names, Tom Anderson originally calling them \"Butthole\" and \"Joe\", and believing the two to be of Asian ethnicity (describing them to the police as \"Oriental\"). In later episodes, Tom Anderson uses the Hollings mispronunciation once, and on at least one occasion refers to them as \"Penis and Butt-Munch\". President Clinton called them \"Beavis and Bum-head\" in \"Citizen Butt-head\", as well as in the movie, where an old lady (voiced by Cloris Leachman) consistently calls them \"Travis\" and \"Bob-head\". In \"Incognito\", when another student threatens to kill them, the duo uses this to their advantage, pretending to be exchange students named \"Crevis and Bung-Head\". The bully, seeing through the disguises, calls them \"Beaver and Butt-Plug\". In \"Right On!\", when the duo appear on the Gus Baker Show, host Gus Baker (a caricature of Rush Limbaugh) introduces them as \"Beavis and Buffcoat\".\n\nBeavis and Butt-head have been compared to idiot savants because of their creative and subversively intelligent observations of music videos. This part of the show was mostly improvised by Mike Judge. With regard to criticisms of the two as \"idiots\", Judge responded that a show about straight-A students would not be funny.\n\nFilm \n\nIn 1996, a full-length movie featuring the duo titled Beavis and Butt-Head Do America was released in theaters. The movie features the voices of Bruce Willis, Demi Moore, Cloris Leachman, Robert Stack, Eric Bogosian, Richard Linklater, Greg Kinnear (in an uncredited role) and David Letterman (credited as Earl Hofert). It gained mostly positive reviews from film critics and a \"two thumbs up\" from Siskel and Ebert. The film earned over $60 million at the domestic box office, a strong return for a film that cost only $12 million to produce.\n\nIn the years following, many fans rumored the possibility of a sequel or follow-up to the film, tentatively titled Beavis and Butt-Head: The Sequelhttp://screenrant.com/beavis-and-butt-head-movie-mike-judge-kofi-23670/ or Beavis and Butt-Head 2.http://www.cinemablend.com/new/Comic-Con-Mike-Judge-Teases-Beavis-Butt-Head-2-14086.html On August 31, 2009, during the promotion of Extract, Mike Judge stated that he would like to see Beavis and Butt-Head on the big screen again. He also stated that if the sequel film were to happen, both Beavis and Butt-Head would be 60-year-old men.\n\nRevival \n\nOn July 14, 2010, a spokesperson for MTV Networks informed a New York Post reporter that Mike Judge was creating a new Beavis and Butt-Head series, that Judge would reprise his voice-acting roles for the show, and that the animation would be hand-drawn. According to TMZ, MTV had not asked Tracy Grandstaff to reprise her role as Daria Morgendorffer. Later, in a Rolling Stone interview, Judge was asked if Daria was coming back and he said, \"No. There's sort of a cameo in one episode. That'll be a surprise.\"\n\nAs in the old series, Beavis and Butt-head are high school students who, among other things, criticize contemporary music videos. In an interview with Rolling Stone, MTV president Van Toffler said that the duo will also watch Jersey Shore, Ultimate Fighting Championship matches, and amateur videos from YouTube, as well as give movie reviews. \"The biggest change is obviously the references are updated, it's set in modern day, and there's going to be a movie review segment,\" Linn said. \"Otherwise they're still true to their prior passions.\"\n\nJohn Altschuler, formerly a writer for King of the Hill, told a Rolling Stone reporter that he saw signs that Mike Judge was thinking of reviving Beavis and Butt-head. On more than one occasion, Judge told the writers that one of their ideas for an episode of King of the Hill would work well for Beavis and Butt-head; eventually he concluded, \"Maybe we should just actually make some good Beavis and Butt-head episodes.\" Later, a Lady Gaga video convinced Van Toffler of the tenability of a Beavis and Butt-head revival: \"I felt like there was a whole crop of new artists—and what the world sorely missed was the point-of-view that only Beavis and Butt-Head could bring.\"\n\nAs part of a promotional campaign for the new series, cinemas screening Jackass 3D opened the feature film with a 3-D Beavis and Butt-head short subject. Months later, in a media presentation on February 2, 2010, MTV announced that the series would premiere in mid-2011. On July 21, 2011 Mike Judge spoke and fielded questions on a panel at Comic-Con International. A preview of the episode \"Holy Cornholio\" was also shown.Sitterson, Aubrey. [http://www.ugo.com/tv/comic-con-2011-beavisand-butthead-coverage-and-panel \"Comic-Con 2011: Beavis and Butthead Coverage and Panel\"] . UGO. 21 July 2010. Judge told Rolling Stone that at least 24 episodes (12 half-hour programs) will definitely air. It was initially rumored that Judge was working on 30 new episodes for the network.\n\nThe new episodes debuted in the United States and Canada on October 27, 2011. The premiere was dubbed a ratings hit, with an audience of 3.3 million total viewers. This number eventually dwindled to 900,000 by the season's end, mainly due to its challenging time slot pitted against regular prime time shows on other networks. From April 24, 2012 to May 1, 2013, the show remained on the bubble for renewal. No official decision had been made. According to Mike Judge, MTV's modern demographic are females 12–14 years old, and the network is looking for other networks to ship the show to.\n\nThe new shows aired in mainland Europe in April 2011. The main title card displays the title as Mike Judge's Beavis and Butt-head with Judge's name replacing the MTV logo.\n\nComedy Central aired the show as part of their animation block over Christmas in December 2011 but was not picked up for a new season nor syndication. This would be the second time the show has aired on Comedy Central, the first being between subsequent airings in 2004 and 2005.\n\nPotential future \n\nOn January 10, 2014, Mike Judge announced that, while he is busy working on Silicon Valley, there is a chance of him pitching Beavis and Butt-Head to another network and that he wouldn't mind making more episodes. While giving an interview to Howard Stern on May 6, 2014, Judge mentioned that the show's ratings on MTV were second only to Jersey Shore, but the show didn't fit MTV's target demographic of young women, which is why the revived series has not been brought back on MTV. He also said that MTV was close to selling it to another network, but it became \"lost in deal stuff\".\n\nIn interviews, Judge has stated his interest in producing a live-action movie, and Johnny Depp has expressed interest in the role of Beavis. In May 2008, Judge said that he previously hated the idea, but now believes that \"maybe there's something there.\" During an interview for Collider on August 25, 2008, Judge said, \"I like to keep the door open on Beavis and Butt-Head, because it's my favorite thing that I've ever done. It's the thing I'm most proud of.\" However, he also added, \"Another movie... the problem is it takes a year and half, two years, two and a half years—maybe—to do that right. And that's a pretty strong level of commitment. I'm going to look at that again. That comes up every three years.\" One of his ideas is bringing back the characters as old men, instead of teenagers. \"I kind of think of them as being either 15 or in their 60s,\" he said. \"I wouldn't mind doing something with them as these two dirty old men sitting on the couch.\" Judge added that he would not completely ignore the time that has passed in between. \"At one point I thought Butt-Head might do okay on some really low-level sales job\".\n\nIn 2016, Judge told RadioTimes.com that \"Maybe it could be a live-action someday,\" and went on to speculate that Beavis might be homeless by now.\n\nHome video \n \nMTV Home Video, in collaboration with Sony Music Entertainment, released several episodes of the show on VHS from 1995 through 1999. A total of eleven VHS compilation tapes were released in the U.S., U.K. and Australia, each containing around eight episodes, but without the music video segments from the original broadcastings. These include the \"Beavis and Butthead Do Christmas\" and \"Butt-O-Ween\" specials, which were given stand-alone releases.\n*Work Sucks (February 7, 1995)\n*There Goes The Neighborhood (February 7, 1995)\n*Chicks 'n Stuff (September 12, 1995)\n*Feel Our Pain (April 16, 1996)\n*The Final Judgment (May 16, 1997)\n*Troubled Youth (August 11, 1998)\n*Hard Cash (February 9, 1999)\n*Butt-O-Ween (August 10, 1999)\n*Innocence Lost (August 31, 1999)\n*Law-Abiding Citizens (August 31, 1999)\n*Beavis and Butthead Do Christmas (October 1, 1999)\n\nThe series continued in Australia and U.K., with a further ten volumes being issued between 1999 and 2001.\n*Get Lucky\n*Star Pupils\n*To The Rescue\n*Self Improvement\n*The History of Beavis Part 1\n*History of Beavis Part 2\n*History of Beavis Part 3\n*Sticky Situations\n*The Future of Beavis & Butt-head\n*Too Dumb For TV\n\nWhen the series ended in the U.K., a further seven volumes were issued exclusively in Australia, meaning that over-all 28 volumes, all 200 original episodes were released on VHS except \"Heroes\", \"Incognito\", \"Cow Tipping\", \"Canoe\" and \"True Crime\".\n*History of Beavis Part 4\n*Dumb Ideas\n*Holy Rollers\n*School Jocks\n*Hit It Big\n*Still Stupid\n*Brushes With Death\n\nA single LaserDisc volume titled Beavis and Butt-Head: The Essential Collection was released on June 27, 1994. It contains all the episodes from Work Sucks! on one side and the episodes from There Goes the Neighborhood on the other side. The volumes The Final Judgment and Beavis & Butt-head Do Christmas were also released on DVD during the early days of the format.\n\nTime Life\n\nAll of the U.S. VHS Volumes were later issued on DVD in five two-disc sets through the Time Life organization. The DVD releases were titled The Best of Beavis and Butt-Head. The third DVD release of Beavis and Butt-Head was two series of three-disc sets released by Time-Life in December 2002.\n\nThe first set in the series contained the same program content of six of the Beavis and Butt-Head VHS compilations previously released by Sony Music Video from 1994 to 1999: Butt-O-Ween, Beavis and Butt-Head Do Christmas, Innocence Lost, Chicks 'n' Stuff, Feel Our Pain, and Troubled Youth, with two VHS compilations combined into a single disc. The set was advertised considerably on networks such as Comedy Central and on the Time-Life website.\n\nSometime after the first release, a second set of Time-Life Beavis and Butt-Head DVDs was released. This set contained the programs of the remaining SMV VHS compilations: Work Sucks, There Goes the Neighborhood, The Final Judgement, Law-Abiding Citizens, and Hard Cash. Two of the discs in the set once again contained the program content of two of the VHS tapes, while the last disc (Hard Cash) contained only the content of the final VHS program, but did additionally include 4 of the music video segments from the original broadcasts with Beavis and Butt-Head commentating. The second Time-Life set was not advertised, and subsequently became rarer.\n\nThe History of Beavis and Butt-Head\n\nParamount announced the release of a two-disc DVD set titled The History of Beavis and Butt-Head which was scheduled for release in September 2002 in the United States. However, its release was cancelled at the last moment at the demand of Judge, who owned approval rights for video releases of the series. According to Judge, the History set was made up of episodes that he had previously rejected for home video release and had been prepared without his knowledge or consent. In all, half of the 32 episodes on The History of Beavis and Butt-Head weren't included on later releases of the series, including all but two episodes on the first disc.\n\nMany copies were mistakenly put on store shelves on the scheduled release date, only to be immediately recalled. The set started selling on eBay at very high prices, sometimes over $300 USD, as well as fetching over $1000 USD in new condition on websites such as \"Amazon.com\".\n\nThe Mike Judge Collection\n\nMTV and Paramount Home Entertainment released on November 8, 2005 a three-disc DVD compilation titled Beavis and Butt-Head: The Mike Judge Collection, Volume 1. The DVD set includes 40 episodes and 11 music video segments from the original shows. The set was followed by Volume 2 and Volume 3. On January 27, 2008, MTV and Apple made all three collections available on the iTunes Store. A Blu-ray and DVD release of Season 8, titled Beavis and Butt-Head – Volume 4, was released on February 15, 2012 in the U.S.[http://www.tvshowsondvd.com/news/Beavis-Butt-head-Volume-4/16232 Beavis and Butt-head – Volume 4] at TV Shows on DVD\n\nOn February 14, 2017, MTV released Beavis and Butt-Head - The Complete Collection, a 12-disc set containing all four previous released volumes of The Mike Judge Collection, along with a special collector's edition of Beavis and Butt-Head Do America.\n\nMany music video segments and content from other third parties were never released due to licensing issues with the rights holders. Early episodes featuring Beavis and Butt-Head engaging in unusually cruel and criminal activities were never released due to Mike Judge and MTV's dislike of them.\n\nRelated media \n\nMarvel Comics \n\nFrom 1994 to 1996, Marvel Comics published a monthly Beavis and Butt-Head comic under the Marvel Absurd imprint by a variety of writers, but with each issue drawn by artist Rick Parker. It was also reprinted by Marvel UK, which created new editorial material.\n\nThe letters page was answered by Beavis and Butt-Head or one of their supporting characters. Instead of reviewing music videos, they reviewed (custom-made) pages from other Marvel Comics. In their review of a Ghost Rider comic, Beavis tries to avoid using the word \"fire\" to describe the character's fiery skull.\n\nIn the comic, minor characters like Earl, Billy Bob, Clark Cobb, and Mistress Cora Anthrax would get repeated appearances; Earl was quite regular, and Anthrax was in two issues and got to answer a letter's page.\n\nDaria spin-off \n\nIn 1997, a spin-off show based on their classmate Daria Morgendorffer, Daria, was created. Mike Judge was not credited as a producer of this series and has said he was not involved with it at all, except to give permission for the use of the character. The Daria character had been created for Beavis and Butt-Head by Glenn Eichler and originally designed by Bill Peckmann of J.J. Sedelmaier Productions, Inc. Eichler then became a producer for Daria. In the first episode of Daria, she and her family move from Beavis and Butt-Head's hometown of Highland to Lawndale—the only references to the original show is a single mention of Highland in the first episode, with Daria saying Lawndale can't be a second Highland \"unless there's uranium in the drinking water here too\".\n\nVideo games \n\n*MTV's Beavis and Butt-Head, a set of side-scrolling action games released by Viacom New Media for the Game Gear, Genesis and Super NES in 1994. All three games featured music composed by Gwar.\n*Talking MTV's Beavis and Butt-Head: This Game Rules!!!, a handheld LCD video game released by Tiger Electronics in 1994.\n*Beavis and Butt-Head in Virtual Stupidity, a graphic adventure game released for Windows 95 in 1995. A PlayStation port was released exclusively in Japan in 1998 featuring dubbed voice acting.\n*Beavis and Butt-Head in Calling All Dorks, a collection of desktop themes for Windows 95 released in 1995 by Viacom New Media.\n*Beavis and Butt-Head in Wiener Takes All, a Beavis and Butt-Head-themed trivia game by Viacom New Media. Released as a PC/Macintosh-compatible CD-ROM in 1996.\n*Beavis and Butt-Head in Little Thingies, a mini-game collection released for Windows 95 in 1996 featuring four mini-games from the previously-released Virtual Stupidity and three new ones.\n*Beavis and Butt-Head, a coin-operated video game developed by Atari Games for a 3DO Interactive Multiplayer-based hardware. The game underwent location testing 1996, but was unreleased due to poor reception. \n*Beavis and Butt-Head in Screen Wreckers, a collection of screensavers released for Windows 95 in 1997.\n*Beavis and Butt-Head: Bunghole in One, a Beavis and Butt-Head-themed golf video game released for Windows 95 and Macintosh by GT Interactive Software in 1998.\n*Beavis and Butt-Head, an overhead action game released by GT Interactive Software for the Game Boy in 1998.\n*Beavis and Butt-Head Do Hollywood, an unreleased 3D action game that was being produced by GT Interactive Software. It was announced for the PlayStation in 1998.\n*Beavis and Butt-Head Do U., a graphic adventure game released by GT Interactive Software for Windows 95 in 1998.\n\nBooks \n\n* \n* \n* \n* \n* \n* \n* \n* \n*  \n* \n* \n* \n* \n*  (NOTE: This book is a bundle of four previous books 'Ensucklopedia,' 'Huh Huh for Hollywood,' 'The Butt-Files,' and 'Chicken Soup for the Butt' which are no longer in print separately).\n\nAlbum\n\nA CD, The Beavis and Butt-Head Experience, was released featuring many hard rock and heavy metal bands such as Megadeth, Primus, Nirvana and White Zombie. Moreover, Beavis and Butt-head do a duet with Cher on \"I Got You Babe\"[https://news.google.com/newspapers?iddvcNAAAAIBAJ&sjid\noXsDAAAAIBAJ&pg3431,1994847&dq\nbeavis+and+butt-head+cher St. Petersburg Times]  and a track by themselves called \"Come to Butt-Head\". The track with Cher also resulted in a music video directed by Tamra Davis and Yvette Kaplan.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Beavis and Butt-Head" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3427" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Beavis and Butt-Head is an American animated sitcom created and designed by Mike Judge. The series originated from Frog Baseball, a 1992 short film by Judge originally aired on Liquid Television. After seeing the short, MTV signed Judge to develop the concept. The series first ran from March 8, 1993, to November 28, 1997. The series was later renewed for an eighth season, which aired from October 27 to December 29, 2011. In 1996, the series was adapted into the animated feature film Beavis and Butt-Head Do America.\n\nPremise \n\nThe show centers on two socially incompetent, heavy metal-loving teenage delinquents, Beavis and Butt-Head (both voiced by Judge), who go to school at Highland High in Highland, Texas. They have no apparent adult supervision at home, are dim-witted, under-educated and barely literate. Both lack any empathy or moral scruples, even regarding each other. Their most common shared activity is watching music videos, which they tend to judge by deeming them \"cool,\" or by exclaiming, \"This sucks!\" (the latter is sometimes followed by the demand, \"Change it!\"). They also apply these judgments to other things that they encounter, and will usually deem something \"cool\" if it is associated with violence, sex, or the macabre. Despite having no experience with women, their other signature traits are a shared obsession with sex, and their tendency to chuckle and giggle (“Heh heh heh!”Judge, Mike. Reading Sucks: The Collected Works of Beavis and Butt-Head. Simon and Schuster, 2005.  .) whenever they hear words or phrases that can even remotely be interpreted as sexual or scatological.\n\nThough Beavis and Butt-Head are in ninth grade at Highland High School, their stupidity leads to a demotion all the way down to kindergarten in the episode \"Held Back,\" but they soon prove to be such an annoyance that the elementary school principal quickly re-promotes them back to Highland High.\n\nEach episode features frequent interstitial scenes in which they critique music videos using commentary improvised by Judge. The remainder of the episode depicts the duo embarking on some kind of scheme or adventure. Their teachers at Highland High are often at a loss as to how to deal with them, and in many episodes, they skip school altogether. Their actions sometimes result in serious consequences, but often for others, for which they themselves show no remorse whatsoever.\n\nEpisodes \n\nReception \n\nCritical reception \n\nOver its run, Beavis and Butt-Head drew a notable amount of both positive and negative reaction from the public with its combination of lewd humor and implied criticism of society. It became the focus of criticism from social conservatives, such as Michael Medved, while others, such as David Letterman, and the conservative magazine National Review, defended it as a cleverly subversive vehicle for social criticism and a particularly creative and intelligent comedy. Either way, the show captured the attention of many young television viewers in the United States and abroad and is often considered a classic piece of 1990s youth culture and Generation X. Trey Parker and Matt Stone, creators of South Park, cite the show as an influence and compared it to the blues. They met Mike Judge before the show aired.\"Taint of Greatness: The Journey of Beavis and Butt-Head Part 2,\" in The Mike Judge Collection Volume 2\n\nIn 1997, Dan Tobin of The Boston Phoenix commented on the series' humor, stating that it transformed \"stupidity into a crusade, forcing us to acknowledge how little it really takes to make us laugh.\"\"[http://www.bostonphoenix.com/archive/tv/97/11/BEAVIS_AND_BUTTHEAD.html Butting out] ,\" The Boston Phoenix In 1997, Ted Drozdowski of The Boston Phoenix described the 1997 Beavis and Butt-Head state as \"reduced to self-parody of their self-parody.\"\"[http://bostonphoenix.com/archive/tv/97/05/TEN_REASONS.html Eye pleasers] ,\" The Boston Phoenix. In December 2005, TV Guide even ranked the duo's distinct laughing at #66 on their list of the 100 Greatest TV Quotes and Catchphrases.[http://www.tvland.com/originals/catchphrases/quotes.jhtml The 100 Greatest TV Quotes and Catchphrases] , TV Guide. Retrieved on 2008-04-02. In 2009, it was ranked No. 8 by TV Guide in their list of \"TV's Top 25 Animated Shows.\"  In 2012, TV Guide ranked Beavis and Butt-head as one of the top 60 Greatest TV Cartoons of All Time.\n\nMike Judge himself is highly critical of the animation and quality of earlier episodes, in particular the first two – Give Blood/Blood Drive and Door to Door – which he described as \"awful, I don't know why anybody liked it... I was burying my head in the sand.\"\"Taint of Greatness: The Story of Beavis and Butt-Head Part 1\", in The Mike Judge Collection Volume 1\n\nCriticism and controversy \n\nEarly installments gave them a juvenile obsession with fire and dangerous behavior, summed up with Beavis' chanting of \"Fire! Fire!\" The show was blamed for the death of a two-year-old in Moraine, Ohio in October 1993. The girl's five-year-old brother set fire to his mother's mobile home with a cigarette lighter, killing the two-year-old. Because of this, MTV pulled the episode temporarily. The mother took the boy's bedroom door off its hinges so she could keep an eye on him. She later claimed that her son watched one of the fire-related segments shortly before he burned down the home. However, neighbors claimed that the family did not have cable television. This also raises the question of where the parents were and why the cigarette lighter was where he could reach it.\n\nAs a result, references to fire were removed from subsequent airings. The creators found a censorship loophole and took delight in sometimes making Beavis scream things that sounded very similar to his previous \"Fire! Fire!\" (such as \"Fryer! Fryer!\" when he and Butt-Head are working the late shift at Burger World) and also having him almost say the forbidden word (such as one time when he sang \"Liar, liar, pants on...\" and pausing before \"fire\" (\"Liar! Liar!\"). There was also a music video where a man runs on fire in slow motion (\"California\" by Wax). Beavis is hypnotized by it and can barely say \"fire\". However, MTV eventually removed the episode entirely. References to fire were cut from earlier episodes — even the original tapes were altered permanently. Other episodes MTV opted not to rerun included \"Stewart's House\" and \"Way Down Mexico Way\". Copies of early episodes with the controversial content intact are rare. The ones that exist are made from home video recordings of the original broadcasts. In an interview included with the Mike Judge Collection DVD set, Judge said he is uncertain whether some of the earlier episodes still exist in their uncensored form.\n\nWhen new episodes returned in 2011, MTV allowed Beavis to use the word \"fire\" once again uncensored. During the first video segment during \"Werewolves of Highland\", the first new episode of the revival, Beavis utters the word \"fire\" a total of 7 times within 28 seconds, with Butt-head saying it once as well.\n\nThe show has also been blamed for animal cruelty and the death of a cat with fireworks. In the summer of 1993, Dick Zimmerman, a 44-year-old retired broadcasting executive from Larkspur, California, happened to see the episode in which Butt-head joked, \"Hey, Beavis, let's go over to Stewart's house and light [a firecracker] in his cat's butt.\" Five days later, a cat was found killed by a firecracker in nearby Santa Cruz. Zimmerman, winner of a $10 million state lottery in 1988, immediately put up a $5,000 reward for the perpetrators, told the press that Beavis and Butt-Head was responsible for the death, and started a letter-writing campaign against the show. By the fall, 4,000 people from around the country had joined his campaign.John Leland, \"Battle For Your Brain\", Newsweek, October 11, 1993, p. 51\n\nIn February 1994, watchdog group Morality in Media claimed that the death of eight-month-old Natalia Rivera, struck by a bowling ball thrown from an overpass onto a Jersey City, New Jersey highway near the Holland Tunnel by 18-year-old Calvin J. Settle, was partially inspired by Beavis and Butt-Head. The group said that Settle was influenced by Ball Breakers, in which Beavis and Butt-Head loaded a bowling ball with explosives and dropped it from a rooftop. While Morality in Media claimed that the show inspired Settle's actions, the case's prosecutors did not. Later it was revealed by both prosecutors and the defendant that Settle did not have cable TV and did not watch the show.\n\nIn Lightning Strikes, the show parodies blaming actions on youth culture. When asked by a reporter why they were flying a kite in a thunderstorm, the duo explained that they were inspired by a documentary about Benjamin Franklin, who Butt-head describes as \"some old dude with long hair and glasses\". The reporter asks if it was Howard Stern, and when Butt-head answers \"no\", she asks if he has ever listened to Stern's radio program. The reporter continues asking them leading questions until they mention that they had watched rock music videos earlier in the day. The reporter then concludes on the air that the music videos are to blame for the duo's actions.\n\nMTV also responded by broadcasting the program after 11:00 p.m., and included a disclaimer, reminding viewers:\nBeavis and Butt-Head are not real. They are stupid cartoon people completely made up by this Texas guy whom we hardly even know. Beavis and Butt-Head are dumb, crude, thoughtless, ugly, sexist, self-destructive fools. But for some reason, the little wienerheads make us laugh.\nThis was later changed to:\nBeavis and Butt-Head are not role models. They're not even human. They're cartoons. Some of the things they do would cause a person to get hurt, expelled, arrested, possibly deported. To put it another way: Don't try this at home.\nThis disclaimer also appears before the opening of their Sega Genesis and Super NES game as well as their Windows game Beavis and Butt-Head in Virtual Stupidity.\n\nThey were famously lambasted by Democratic senator Fritz Hollings as \"Buffcoat and Beaver.\" This subsequently became a running gag on the show where adults mispronounced their names, Tom Anderson originally calling them \"Butthole\" and \"Joe\", and believing the two to be of Asian ethnicity (describing them to the police as \"Oriental\"). In later episodes, Tom Anderson uses the Hollings mispronunciation once, and on at least one occasion refers to them as \"Penis and Butt-Munch\". President Clinton called them \"Beavis and Bum-head\" in \"Citizen Butt-head\", as well as in the movie, where an old lady (voiced by Cloris Leachman) consistently calls them \"Travis\" and \"Bob-head\". In \"Incognito\", when another student threatens to kill them, the duo uses this to their advantage, pretending to be exchange students named \"Crevis and Bung-Head\". The bully, seeing through the disguises, calls them \"Beaver and Butt-Plug\". In \"Right On!\", when the duo appear on the Gus Baker Show, host Gus Baker (a caricature of Rush Limbaugh) introduces them as \"Beavis and Buffcoat\".\n\nBeavis and Butt-head have been compared to idiot savants because of their creative and subversively intelligent observations of music videos. This part of the show was mostly improvised by Mike Judge. With regard to criticisms of the two as \"idiots\", Judge responded that a show about straight-A students would not be funny.\n\nFilm \n\nIn 1996, a full-length movie featuring the duo titled Beavis and Butt-Head Do America was released in theaters. The movie features the voices of Bruce Willis, Demi Moore, Cloris Leachman, Robert Stack, Eric Bogosian, Richard Linklater, Greg Kinnear (in an uncredited role) and David Letterman (credited as Earl Hofert). It gained mostly positive reviews from film critics and a \"two thumbs up\" from Siskel and Ebert. The film earned over $60 million at the domestic box office, a strong return for a film that cost only $12 million to produce.\n\nIn the years following, many fans rumored the possibility of a sequel or follow-up to the film, tentatively titled Beavis and Butt-Head: The Sequelhttp://screenrant.com/beavis-and-butt-head-movie-mike-judge-kofi-23670/ or Beavis and Butt-Head 2.http://www.cinemablend.com/new/Comic-Con-Mike-Judge-Teases-Beavis-Butt-Head-2-14086.html On August 31, 2009, during the promotion of Extract, Mike Judge stated that he would like to see Beavis and Butt-Head on the big screen again. He also stated that if the sequel film were to happen, both Beavis and Butt-Head would be 60-year-old men.\n\nRevival \n\nOn July 14, 2010, a spokesperson for MTV Networks informed a New York Post reporter that Mike Judge was creating a new Beavis and Butt-Head series, that Judge would reprise his voice-acting roles for the show, and that the animation would be hand-drawn. According to TMZ, MTV had not asked Tracy Grandstaff to reprise her role as Daria Morgendorffer. Later, in a Rolling Stone interview, Judge was asked if Daria was coming back and he said, \"No. There's sort of a cameo in one episode. That'll be a surprise.\"\n\nAs in the old series, Beavis and Butt-head are high school students who, among other things, criticize contemporary music videos. In an interview with Rolling Stone, MTV president Van Toffler said that the duo will also watch Jersey Shore, Ultimate Fighting Championship matches, and amateur videos from YouTube, as well as give movie reviews. \"The biggest change is obviously the references are updated, it's set in modern day, and there's going to be a movie review segment,\" Linn said. \"Otherwise they're still true to their prior passions.\"\n\nJohn Altschuler, formerly a writer for King of the Hill, told a Rolling Stone reporter that he saw signs that Mike Judge was thinking of reviving Beavis and Butt-head. On more than one occasion, Judge told the writers that one of their ideas for an episode of King of the Hill would work well for Beavis and Butt-head; eventually he concluded, \"Maybe we should just actually make some good Beavis and Butt-head episodes.\" Later, a Lady Gaga video convinced Van Toffler of the tenability of a Beavis and Butt-head revival: \"I felt like there was a whole crop of new artists—and what the world sorely missed was the point-of-view that only Beavis and Butt-Head could bring.\"\n\nAs part of a promotional campaign for the new series, cinemas screening Jackass 3D opened the feature film with a 3-D Beavis and Butt-head short subject. Months later, in a media presentation on February 2, 2010, MTV announced that the series would premiere in mid-2011. On July 21, 2011 Mike Judge spoke and fielded questions on a panel at Comic-Con International. A preview of the episode \"Holy Cornholio\" was also shown.Sitterson, Aubrey. [http://www.ugo.com/tv/comic-con-2011-beavisand-butthead-coverage-and-panel \"Comic-Con 2011: Beavis and Butthead Coverage and Panel\"] . UGO. 21 July 2010. Judge told Rolling Stone that at least 24 episodes (12 half-hour programs) will definitely air. It was initially rumored that Judge was working on 30 new episodes for the network.\n\nThe new episodes debuted in the United States and Canada on October 27, 2011. The premiere was dubbed a ratings hit, with an audience of 3.3 million total viewers. This number eventually dwindled to 900,000 by the season's end, mainly due to its challenging time slot pitted against regular prime time shows on other networks. From April 24, 2012 to May 1, 2013, the show remained on the bubble for renewal. No official decision had been made. According to Mike Judge, MTV's modern demographic are females 12–14 years old, and the network is looking for other networks to ship the show to.\n\nThe new shows aired in mainland Europe in April 2011. The main title card displays the title as Mike Judge's Beavis and Butt-head with Judge's name replacing the MTV logo.\n\nComedy Central aired the show as part of their animation block over Christmas in December 2011 but was not picked up for a new season nor syndication. This would be the second time the show has aired on Comedy Central, the first being between subsequent airings in 2004 and 2005.\n\nPotential future \n\nOn January 10, 2014, Mike Judge announced that, while he is busy working on Silicon Valley, there is a chance of him pitching Beavis and Butt-Head to another network and that he wouldn't mind making more episodes. While giving an interview to Howard Stern on May 6, 2014, Judge mentioned that the show's ratings on MTV were second only to Jersey Shore, but the show didn't fit MTV's target demographic of young women, which is why the revived series has not been brought back on MTV. He also said that MTV was close to selling it to another network, but it became \"lost in deal stuff\".\n\nIn interviews, Judge has stated his interest in producing a live-action movie, and Johnny Depp has expressed interest in the role of Beavis. In May 2008, Judge said that he previously hated the idea, but now believes that \"maybe there's something there.\" During an interview for Collider on August 25, 2008, Judge said, \"I like to keep the door open on Beavis and Butt-Head, because it's my favorite thing that I've ever done. It's the thing I'm most proud of.\" However, he also added, \"Another movie... the problem is it takes a year and half, two years, two and a half years—maybe—to do that right. And that's a pretty strong level of commitment. I'm going to look at that again. That comes up every three years.\" One of his ideas is bringing back the characters as old men, instead of teenagers. \"I kind of think of them as being either 15 or in their 60s,\" he said. \"I wouldn't mind doing something with them as these two dirty old men sitting on the couch.\" Judge added that he would not completely ignore the time that has passed in between. \"At one point I thought Butt-Head might do okay on some really low-level sales job\".\n\nIn 2016, Judge told RadioTimes.com that \"Maybe it could be a live-action someday,\" and went on to speculate that Beavis might be homeless by now.\n\nHome video \n \nMTV Home Video, in collaboration with Sony Music Entertainment, released several episodes of the show on VHS from 1995 through 1999. A total of eleven VHS compilation tapes were released in the U.S., U.K. and Australia, each containing around eight episodes, but without the music video segments from the original broadcastings. These include the \"Beavis and Butthead Do Christmas\" and \"Butt-O-Ween\" specials, which were given stand-alone releases.\n*Work Sucks (February 7, 1995)\n*There Goes The Neighborhood (February 7, 1995)\n*Chicks 'n Stuff (September 12, 1995)\n*Feel Our Pain (April 16, 1996)\n*The Final Judgment (May 16, 1997)\n*Troubled Youth (August 11, 1998)\n*Hard Cash (February 9, 1999)\n*Butt-O-Ween (August 10, 1999)\n*Innocence Lost (August 31, 1999)\n*Law-Abiding Citizens (August 31, 1999)\n*Beavis and Butthead Do Christmas (October 1, 1999)\n\nThe series continued in Australia and U.K., with a further ten volumes being issued between 1999 and 2001.\n*Get Lucky\n*Star Pupils\n*To The Rescue\n*Self Improvement\n*The History of Beavis Part 1\n*History of Beavis Part 2\n*History of Beavis Part 3\n*Sticky Situations\n*The Future of Beavis & Butt-head\n*Too Dumb For TV\n\nWhen the series ended in the U.K., a further seven volumes were issued exclusively in Australia, meaning that over-all 28 volumes, all 200 original episodes were released on VHS except \"Heroes\", \"Incognito\", \"Cow Tipping\", \"Canoe\" and \"True Crime\".\n*History of Beavis Part 4\n*Dumb Ideas\n*Holy Rollers\n*School Jocks\n*Hit It Big\n*Still Stupid\n*Brushes With Death\n\nA single LaserDisc volume titled Beavis and Butt-Head: The Essential Collection was released on June 27, 1994. It contains all the episodes from Work Sucks! on one side and the episodes from There Goes the Neighborhood on the other side. The volumes The Final Judgment and Beavis & Butt-head Do Christmas were also released on DVD during the early days of the format.\n\nTime Life\n\nAll of the U.S. VHS Volumes were later issued on DVD in five two-disc sets through the Time Life organization. The DVD releases were titled The Best of Beavis and Butt-Head. The third DVD release of Beavis and Butt-Head was two series of three-disc sets released by Time-Life in December 2002.\n\nThe first set in the series contained the same program content of six of the Beavis and Butt-Head VHS compilations previously released by Sony Music Video from 1994 to 1999: Butt-O-Ween, Beavis and Butt-Head Do Christmas, Innocence Lost, Chicks 'n' Stuff, Feel Our Pain, and Troubled Youth, with two VHS compilations combined into a single disc. The set was advertised considerably on networks such as Comedy Central and on the Time-Life website.\n\nSometime after the first release, a second set of Time-Life Beavis and Butt-Head DVDs was released. This set contained the programs of the remaining SMV VHS compilations: Work Sucks, There Goes the Neighborhood, The Final Judgement, Law-Abiding Citizens, and Hard Cash. Two of the discs in the set once again contained the program content of two of the VHS tapes, while the last disc (Hard Cash) contained only the content of the final VHS program, but did additionally include 4 of the music video segments from the original broadcasts with Beavis and Butt-Head commentating. The second Time-Life set was not advertised, and subsequently became rarer.\n\nThe History of Beavis and Butt-Head\n\nParamount announced the release of a two-disc DVD set titled The History of Beavis and Butt-Head which was scheduled for release in September 2002 in the United States. However, its release was cancelled at the last moment at the demand of Judge, who owned approval rights for video releases of the series. According to Judge, the History set was made up of episodes that he had previously rejected for home video release and had been prepared without his knowledge or consent. In all, half of the 32 episodes on The History of Beavis and Butt-Head weren't included on later releases of the series, including all but two episodes on the first disc.\n\nMany copies were mistakenly put on store shelves on the scheduled release date, only to be immediately recalled. The set started selling on eBay at very high prices, sometimes over $300 USD, as well as fetching over $1000 USD in new condition on websites such as \"Amazon.com\".\n\nThe Mike Judge Collection\n\nMTV and Paramount Home Entertainment released on November 8, 2005 a three-disc DVD compilation titled Beavis and Butt-Head: The Mike Judge Collection, Volume 1. The DVD set includes 40 episodes and 11 music video segments from the original shows. The set was followed by Volume 2 and Volume 3. On January 27, 2008, MTV and Apple made all three collections available on the iTunes Store. A Blu-ray and DVD release of Season 8, titled Beavis and Butt-Head – Volume 4, was released on February 15, 2012 in the U.S.[http://www.tvshowsondvd.com/news/Beavis-Butt-head-Volume-4/16232 Beavis and Butt-head – Volume 4] at TV Shows on DVD\n\nOn February 14, 2017, MTV released Beavis and Butt-Head - The Complete Collection, a 12-disc set containing all four previous released volumes of The Mike Judge Collection, along with a special collector's edition of Beavis and Butt-Head Do America.\n\nMany music video segments and content from other third parties were never released due to licensing issues with the rights holders. Early episodes featuring Beavis and Butt-Head engaging in unusually cruel and criminal activities were never released due to Mike Judge and MTV's dislike of them.\n\nRelated media \n\nMarvel Comics \n\nFrom 1994 to 1996, Marvel Comics published a monthly Beavis and Butt-Head comic under the Marvel Absurd imprint by a variety of writers, but with each issue drawn by artist Rick Parker. It was also reprinted by Marvel UK, which created new editorial material.\n\nThe letters page was answered by Beavis and Butt-Head or one of their supporting characters. Instead of reviewing music videos, they reviewed (custom-made) pages from other Marvel Comics. In their review of a Ghost Rider comic, Beavis tries to avoid using the word \"fire\" to describe the character's fiery skull.\n\nIn the comic, minor characters like Earl, Billy Bob, Clark Cobb, and Mistress Cora Anthrax would get repeated appearances; Earl was quite regular, and Anthrax was in two issues and got to answer a letter's page.\n\nDaria spin-off \n\nIn 1997, a spin-off show based on their classmate Daria Morgendorffer, Daria, was created. Mike Judge was not credited as a producer of this series and has said he was not involved with it at all, except to give permission for the use of the character. The Daria character had been created for Beavis and Butt-Head by Glenn Eichler and originally designed by Bill Peckmann of J.J. Sedelmaier Productions, Inc. Eichler then became a producer for Daria. In the first episode of Daria, she and her family move from Beavis and Butt-Head's hometown of Highland to Lawndale—the only references to the original show is a single mention of Highland in the first episode, with Daria saying Lawndale can't be a second Highland \"unless there's uranium in the drinking water here too\".\n\nVideo games \n\n*MTV's Beavis and Butt-Head, a set of side-scrolling action games released by Viacom New Media for the Game Gear, Genesis and Super NES in 1994. All three games featured music composed by Gwar.\n*Talking MTV's Beavis and Butt-Head: This Game Rules!!!, a handheld LCD video game released by Tiger Electronics in 1994.\n*Beavis and Butt-Head in Virtual Stupidity, a graphic adventure game released for Windows 95 in 1995. A PlayStation port was released exclusively in Japan in 1998 featuring dubbed voice acting.\n*Beavis and Butt-Head in Calling All Dorks, a collection of desktop themes for Windows 95 released in 1995 by Viacom New Media.\n*Beavis and Butt-Head in Wiener Takes All, a Beavis and Butt-Head-themed trivia game by Viacom New Media. Released as a PC/Macintosh-compatible CD-ROM in 1996.\n*Beavis and Butt-Head in Little Thingies, a mini-game collection released for Windows 95 in 1996 featuring four mini-games from the previously-released Virtual Stupidity and three new ones.\n*Beavis and Butt-Head, a coin-operated video game developed by Atari Games for a 3DO Interactive Multiplayer-based hardware. The game underwent location testing 1996, but was unreleased due to poor reception. \n*Beavis and Butt-Head in Screen Wreckers, a collection of screensavers released for Windows 95 in 1997.\n*Beavis and Butt-Head: Bunghole in One, a Beavis and Butt-Head-themed golf video game released for Windows 95 and Macintosh by GT Interactive Software in 1998.\n*Beavis and Butt-Head, an overhead action game released by GT Interactive Software for the Game Boy in 1998.\n*Beavis and Butt-Head Do Hollywood, an unreleased 3D action game that was being produced by GT Interactive Software. It was announced for the PlayStation in 1998.\n*Beavis and Butt-Head Do U., a graphic adventure game released by GT Interactive Software for Windows 95 in 1998.\n\nBooks \n\n* \n* \n* \n* \n* \n* \n* \n* \n*  \n* \n* \n* \n* \n*  (NOTE: This book is a bundle of four previous books 'Ensucklopedia,' 'Huh Huh for Hollywood,' 'The Butt-Files,' and 'Chicken Soup for the Butt' which are no longer in print separately).\n\nAlbum\n\nA CD, The Beavis and Butt-Head Experience, was released featuring many hard rock and heavy metal bands such as Megadeth, Primus, Nirvana and White Zombie. Moreover, Beavis and Butt-head do a duet with Cher on \"I Got You Babe\"[https://news.google.com/newspapers?iddvcNAAAAIBAJ&sjid\noXsDAAAAIBAJ&pg3431,1994847&dq\nbeavis+and+butt-head+cher St. Petersburg Times]  and a track by themselves called \"Come to Butt-Head\". The track with Cher also resulted in a music video directed by Tamra Davis and Yvette Kaplan. Beavis and Butt-Head. http://en.wikipedia.org/?curid=3427."
  }
}
