{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12491",
  "eid" : "02f3ab60-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778514198,
  "textBody" : "The Gospel According to Luke (, to kata Loukan evangelion), also called the Gospel of Luke, or simply Luke, is the third of the four canonical Gospels. It tells of the origins, birth, ministry, atonement, death, resurrection, and ascension of Jesus Christ.\n\nLuke is the second-longest of the four gospels, and together with Acts of the Apostles, the pair make up a two-volume work from the same pen, called Luke–Acts. The cornerstone of Luke–Acts' theology is \"salvation history\", the author's understanding that God's purpose is seen in the way he has acted, and will continue to act, in history. It divides the history of first century Christianity into three stages, with the gospel making up the first two of these – the arrival among men of Jesus the Messiah, from his birth to the beginning of his earthly mission in the meeting with John the Baptist followed by his earthly ministry, Passion, death and resurrection (concluding the gospel story per se). The gospel's sources are the Gospel of Mark (for the narrative of Christ's earthly life), the sayings collection called the Q source (for his teachings), and a collection of material called the L (for Luke) source, which is found only in this gospel.\n\nLuke–Acts does not name its author. According to Church tradition this was Luke the Evangelist, the companion of Paul, but while this view is still occasionally put forward the scholarly consensus emphasises the many contradictions between Acts and the authentic Pauline letters. The most probable date for its composition is around 80–110 AD, and there is evidence that it was still being revised well into the 2nd century.\n\nComposition and setting\n\nTextual history\n\nAutographs (original copies) of Luke and the other Gospels have not been preserved, as is typical for ancient documents; the texts that survive are third-generation copies, with no two completely identical. The earliest witnesses (the technical term for written manuscripts) for Luke's gospel fall into two \"families\" with considerable differences between them, the Western and the Alexandrian, and the dominant view is that the Western text represents a process of deliberate revision, as the variations seem to form specific patterns. The oldest witness is a fragment dating from the late 2nd century, while the oldest complete texts are the 4th century Codex Sinaiticus and Vaticanus, both from the Alexandrian family; Codex Bezae, a 5th- or 6th-century Western text-type manuscript that contains Luke in Greek and Latin versions on facing pages, appears to have descended from an offshoot of the main manuscript tradition, departing from more familiar readings at many points.Verses  are omitted in Codex Bezae and a handful of Old Latin manuscripts. Nearly all other manuscripts including Codex Sinaiticus and Codex Vaticanus and Church Fathers contain the \"longer\" reading of Luke 22:19 and 20. Verse 22:20, which is very similar to , provides the only gospel support for the doctrine of the New Covenant. Verses  are found in Western text-type, are omitted by a diverse number of ancient witnesses, and are generally marked as such in modern translations. See Bruce M. Metzger's Textual Commentary on the Greek New Testament for details.\n\n is probably the earliest witness, dating from the late 2nd century. It contains Lk 1:58–59, 62–2:1,6–7; 3:8–4:2, 29–32, 34–35; 5:3–8; 5:30–6:16.  dates from the late 2nd century/early 3rd century and contains Lk 3:18–4:2+; 4:34–5:10; 5:37–18:18+; 22:4–24:53 and John 1:1–11:45, 48–57; 12:3–13:10; 14:8–15:10. Finally,  (mid-3rd century) contains extensive portions of all four Gospels. In addition to these major early papyri there are 6 other papyri (, , , ,  and ) dating from between the 3rd–8th century which also have small portions of Luke's Gospel. (See List of New Testament papyri).\n\nLuke–Acts: unity, authorship and date\n\nThe gospel of Luke and the Acts of the Apostles make up a two-volume work which scholars call Luke–Acts. Together they account for 27.5% of the New Testament, the largest contribution by a single author, providing the framework for both the Church's liturgical calendar and the historical outline into which later generations have fitted their idea of the story of Jesus.\n\nThe author is not named in either volume. According to a Church tradition dating from the 2nd century he was the Luke named as a companion of Paul in three of the letters attributed to Paul himself, but  \"a critical consensus emphasizes the countless contradictions between the account in Acts and the authentic Pauline letters (Theissen and Merz 1998, p.32).\" (An example can be seen by comparing Acts' accounts of Paul's conversion (Acts 9:1–31, 22:6–21, and 26:9–23) with Paul's own statement that he remained unknown to Christians in Judea after that event (Galatians 1:17–24).) He admired Paul, but his theology was significantly different from Paul's on key points and he does not (in Acts) represent Paul's views accurately. He was educated, a man of means, probably urban, and someone who respected manual work, although not a worker himself; this is significant, because more high-brow writers of the time looked down on the artisans and small business-people who made up the early church of Paul and were presumably Luke's audience.\n\nThe eclipse of the traditional attribution to Luke the companion of Paul has meant that an early date for the gospel is now rarely put forward. Some experts date the composition of the combined work to around 80–90 AD, although some others suggest 90–110, and there is evidence, both textual (the conflicts between Western and Alexandrian manuscript families) and from the Marcionite controversy (Marcion was a 2nd-century heretic who produced his own version of Christian scripture based on Luke's gospel and Paul's epistles) that Luke–Acts was still being substantially revised well into the 2nd century.\n\nGenre, models and sources\n\nLuke–Acts is a religio-political history of the Founder of the church and his successors, in both deeds and words. The author describes his book as a \"narrative\" (diegesis), rather than as a gospel, and implicitly criticises his predecessors for not giving their readers the speeches of Jesus and the Apostles, as such speeches were the mark of a \"full\" report, the vehicle through which ancient historians conveyed the meaning of their narratives. He seems to have taken as his model the works of two respected Classical authors, Dionysius of Halicarnassus, who wrote a history of Rome, and the Jewish historian Josephus, author of a history of the Jews. All three authors anchor the histories of their respective peoples  by dating the births of the founders (Romulus, Moses and Jesus) and narrate the stories of the founders' births from God, so that they are sons of God. Each founder taught authoritatively, appeared to witnesses after death, and ascended to heaven. Crucial aspects of the teaching of all three concerned the relationship between rich and poor and the question of whether \"foreigners\" were to be received into the people.\n\nThe author used as his sources the gospel of Mark, the sayings collection called the Q source, and a collection of material called the L (for Luke) source. Mark, written around 70 AD, provided the narrative outline, but Mark contains comparatively little of Jesus' teachings. For these Luke turned to Q, which consisted mostly, although not exclusively, of \"sayings\". (Most scholars are reasonably sure that Q existed and that it can be reconstructed). Mark and Q account for about 64% of Luke. The remaining material, known as the L source, is of unknown origin and date. Most Q and L-source material is grouped in two clusters, Luke 6:17–8:3 and 9:51–18:14, and L-source material forms the first two section of the gospel (the preface and infancy and childhood narratives).\n\nAudience and authorial intent\n\nLuke was written to be read aloud to a group of Jesus-followers gathered in a house to share the Lord's supper. The author assumes an educated Greek-speaking audience, but directs his attention to specifically Christian concerns rather than to the Greco-Roman world at large. He begins his gospel with a preface addressed to \"Theophilus\": the name means \"Lover of God,\" and could be an individual or simply any Christian. Here he informs Theophilus of his intention, which is to lead his reader to certainty through an orderly account \"of the events that have been fulfilled among us.\" He did not, however, intend to provide Theophilus with a historical justification of the Christian faith – \"did it happen?\" – but to encourage faith – \"what happened, and what does it all mean?\"\n\nStructure and content\n\nStructure of Luke's Gospel\n\nFollowing the author's preface addressed to his patron and the two birth narratives (John the Baptist and Jesus), the gospel opens in Galilee and moves gradually to its climax in Jerusalem:\n\n# A brief preface addressed to Theophilus stating the author's aims;\n# Birth and infancy narratives for both Jesus and John the Baptist, interpreted as the dawn of the promised era of Israel's salvation;\n# Preparation for Jesus' messianic mission: John's prophetic mission, his baptism of Jesus, and the testing of Jesus' vocation;\n# The beginning of Jesus' mission in Galilee, and the hostile reception there;\n# The central section: the journey to Jerusalem, where Jesus knows he must meet his destiny as God's prophet and messiah;\n# His mission in Jerusalem, culminating in confrontation with the leaders of the Jewish Temple;\n# His last supper with his most intimate followers, followed by his arrest, interrogation, and crucifixion;\n# God's validation of Jesus as Christ: events from the first Easter to the Ascension, showing Jesus' death to be divinely ordained, in keeping with both scriptural promise and the nature of messiahship, and anticipating the story of Acts.For studies of the literary structure of this Gospel, see recent contributions of Bailey, Goulder and Talbert, in particular for their readings of Luke's Central Section. (Almost all scholars believe the section begins at 9.51;  strong case, however, can be put for 9.43b.) Then the introductory pieces to the opening and closing parts that frame the teaching of the Central Section would exhibit a significant dualism: compare 9.43b–45 and 18.31–35. The Central Section would then be defined as 9.43b–19.48, 'Jesus Journey to Jerusalem and its Temple'. Between the opening part ('His Setting out', 9.43b–10.24) and the closing part ('His Arriving', 18.31–19.48) lies a chiasm of parts 1–5,C,5'–1', 'His Teachings on the Way': 1, 10.25–42 Inheriting eternal life: law and love; 2, 11.1–13 Prayer: right praying, persistence, Holy Spirit is given; 3, 11.14–12.12 The Kingdom of God: what is internal is important; 4, 12.13–48 Earthly and Heavenly riches; the coming of the Son of Man; 5, 12.49–13.9 Divisions, warning and prudence, repentance; C, 13.10–14.24 a Sabbath healing, kingdom and entry (13.10–30), Jesus is to die in Jerusalem, his lament for it (13.31–35), a Sabbath healing, banqueting in the kingdom (14.1–24); 5', 14.25–15.32 Divisions, warning and prudence, repentance; 4', 16.1–31 Earthly and Heavenly riches: the coming judgement; 3', 17.1–37 The kingdom of God is 'within', not coming with signs; 2', 18.1–17 Prayer: persistence, right praying, receiving the kingdom; 1', 18.18–30 Inheriting eternal life: law and love. (All the parts 1–5 and 5'–1' are constructed of three parts in the style of ABB'.)\n\nParallel structure of Luke–Acts\n\nThe structure of Acts parallels the structure of the gospel, demonstrating the universality of the divine plan and the shift of authority from Jerusalem to Rome:\n\nThe gospel – the acts of Jesus:\n* The presentation of the child Jesus at the Temple in Jerusalem\n* Jesus' forty days in the desert\n* Jesus in Samaria/Judea\n* Jesus in the Decapolis\n* Jesus receives the Holy Spirit\n* Jesus preaches with power (the power of the spirit)\n* Jesus heals the sick\n* Death of Jesus\n* The apostles are sent to preach to all nations\n\nThe acts of the apostles\n* Jerusalem\n* Forty days before the Ascension\n* Samaria\n* Asia Minor\n* Pentecost: Christ's followers receive the spirit\n* The apostles preach with the power of the spirit\n* The apostles heal the sick\n* Death of Stephen, the first martyr for Christ\n* Paul preaches in Rome\n\nTheology\n\nLuke's \"salvation history\"\n\nLuke's theology is expressed primarily through his overarching plot, the way scenes, themes and characters combine to construct his specific worldview. His \"salvation history\" stretches from the Creation to the present time of his readers, in three ages: first, the time of \"the Law and the Prophets\", the period beginning with Genesis and ending with the appearance of John the Baptist (Luke 1:5–3:1); second, the epoch of Jesus, in which the Kingdom of God was preached (Luke 3:2–24:51); and finally the period of the Church, which began when the risen Christ was taken into Heaven, and would end with his second coming.\n\nChristology\n\nLuke's understanding of Jesus – his Christology – is central to his theology. One approach to this is through the titles Luke gives to Jesus: these include, but are not limited to, Christ (Messiah), Lord, Son of God, and Son of Man. Another is by reading Luke in the context of similar Greco-Roman divine saviour figures (Roman emperors are an example), references which would have made clear to Luke's readers that Jesus was the greatest of all saviours. A third is to approach Luke through his use of the Old Testament, those passages from Jewish scripture which he cites to establish that Jesus is the promised Messiah. While much of this is familiar, much also is missing: for example, Luke makes no clear reference to Christ's pre-existence or to the Christian's union with Christ, and makes relatively little reference to the concept of atonement: perhaps he felt no need to mention these ideas, or disagreed with them, or possibly he was simply unaware of them.\n\nEven what Luke does say about Christ is ambiguous or even contradictory. For example, according to Luke 2:11 Jesus was the Christ at his birth, but in Acts 10:37–38 he becomes Christ at the resurrection, while in Acts 3:20 it seems his messiahship is active only at the parousia, the \"second coming\"; similarly, in Luke 2:11 he is the Saviour from birth, but in Acts 5:31 he is made Saviour at the resurrection; and he is born the Son of God in Luke 1:32–35, but becomes the Son of God at the resurrection according to Acts 13:33. Many of these differences may be due to scribal error, but others were deliberate alterations to doctrinally unacceptable passages, or the introduction by scribes of \"proofs\" for their favourite theological tenets. An important example of such deliberate alterations is found in Luke's account of the baptism of Jesus, where virtually all the earliest witnesses have God saying, \"This day I have begotten you.\" (Luke has taken the words of God from Psalm 2, an ancient royal adoption formula in which the king of Israel was recognised as God's elect). This reading is theologically difficult, as it implies that God is now conferring status on Jesus that he did not previously hold. It is unlikely, therefore, that the more common reading of Luke 3:22 (God says to Jesus, \"You are my beloved son, with you I am well pleased\") is original.\n\nThe Holy Spirit, the Christian community, and the kingdom of God\n\nThe Holy Spirit plays a more important role in Luke–Acts than in the other gospels. Some scholars have argued that the Spirit's involvement in the career of Jesus is paradigmatic of the universal Christian experience, others that Luke's intention was to stress Jesus' uniqueness as the Prophet of the final age. It is clear, however, that Luke understands the enabling power of the Spirit, expressed through non-discriminatory fellowship (\"All who believed were together and had all things in common\"), to be the basis of the Christian community. This community can also be understood as the Kingdom of God, although the kingdom's final consummation will not be seen till the Son of Man comes \"on a cloud\" at the end-time.\n\nChristians vs. Rome and the Jews\n\nLuke needed to define the position of Christians in relation to two political and social entities, the Roman Empire and Judaism. Regarding the Empire Luke makes clear that, while Christians are not a threat to the established order, the rulers of this world hold their power from Satan, and the essential loyalty of Christ's followers is to God and this world will be the kingdom of God, ruled by Christ the King. Regarding the Jews, Luke emphasises the fact that Jesus and all his earliest followers were Jews, although by his time the majority of Christ-followers were gentiles; nevertheless, the Jews had rejected and killed the Messiah, and the Christian mission now lay with the gentiles.\n\nComparison with other writings\n\nThe gospels of Matthew, Mark and Luke share so much in common that they are called the Synoptics, as they frequently cover the same events in similar and sometimes identical language. The majority opinion among scholars is that Mark was the earliest of the three (about 70 AD) and that Matthew and Luke both used this work and the \"sayings gospel\" known as Q as their basic sources. Luke has both expanded Mark and corrected his grammar and syntax – Mark wrote poor Greek. Some passages from Mark he has eliminated entirely, notably most of chapters 6 and 7, which he apparently felt reflected poorly on the disciples and painted Jesus too much like a magician. Despite this, he follows Mark's plot more faithfully than does Matthew.\n\nDespite being grouped with Matthew and Mark, Luke's gospel has a number of parallels with the Gospel of John. For example, Luke uses the terms \"Jews\" and \"Israelites\" in a way unlike Mark, but like John; the figures of Mary of Bethany and Martha as well as a person named Lazarus (although Lazarus of Bethany and the Lazarus of the parable are generally not considered the same person) are found only in Luke and John; and at Jesus' arrest, only Luke and John state that the servant's right ear was cut off (there are several such small details found only in Luke and John).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gospel of Luke" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12491" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Gospel According to Luke (, to kata Loukan evangelion), also called the Gospel of Luke, or simply Luke, is the third of the four canonical Gospels. It tells of the origins, birth, ministry, atonement, death, resurrection, and ascension of Jesus Christ.\n\nLuke is the second-longest of the four gospels, and together with Acts of the Apostles, the pair make up a two-volume work from the same pen, called Luke–Acts. The cornerstone of Luke–Acts' theology is \"salvation history\", the author's understanding that God's purpose is seen in the way he has acted, and will continue to act, in history. It divides the history of first century Christianity into three stages, with the gospel making up the first two of these – the arrival among men of Jesus the Messiah, from his birth to the beginning of his earthly mission in the meeting with John the Baptist followed by his earthly ministry, Passion, death and resurrection (concluding the gospel story per se). The gospel's sources are the Gospel of Mark (for the narrative of Christ's earthly life), the sayings collection called the Q source (for his teachings), and a collection of material called the L (for Luke) source, which is found only in this gospel.\n\nLuke–Acts does not name its author. According to Church tradition this was Luke the Evangelist, the companion of Paul, but while this view is still occasionally put forward the scholarly consensus emphasises the many contradictions between Acts and the authentic Pauline letters. The most probable date for its composition is around 80–110 AD, and there is evidence that it was still being revised well into the 2nd century.\n\nComposition and setting\n\nTextual history\n\nAutographs (original copies) of Luke and the other Gospels have not been preserved, as is typical for ancient documents; the texts that survive are third-generation copies, with no two completely identical. The earliest witnesses (the technical term for written manuscripts) for Luke's gospel fall into two \"families\" with considerable differences between them, the Western and the Alexandrian, and the dominant view is that the Western text represents a process of deliberate revision, as the variations seem to form specific patterns. The oldest witness is a fragment dating from the late 2nd century, while the oldest complete texts are the 4th century Codex Sinaiticus and Vaticanus, both from the Alexandrian family; Codex Bezae, a 5th- or 6th-century Western text-type manuscript that contains Luke in Greek and Latin versions on facing pages, appears to have descended from an offshoot of the main manuscript tradition, departing from more familiar readings at many points.Verses  are omitted in Codex Bezae and a handful of Old Latin manuscripts. Nearly all other manuscripts including Codex Sinaiticus and Codex Vaticanus and Church Fathers contain the \"longer\" reading of Luke 22:19 and 20. Verse 22:20, which is very similar to , provides the only gospel support for the doctrine of the New Covenant. Verses  are found in Western text-type, are omitted by a diverse number of ancient witnesses, and are generally marked as such in modern translations. See Bruce M. Metzger's Textual Commentary on the Greek New Testament for details.\n\n is probably the earliest witness, dating from the late 2nd century. It contains Lk 1:58–59, 62–2:1,6–7; 3:8–4:2, 29–32, 34–35; 5:3–8; 5:30–6:16.  dates from the late 2nd century/early 3rd century and contains Lk 3:18–4:2+; 4:34–5:10; 5:37–18:18+; 22:4–24:53 and John 1:1–11:45, 48–57; 12:3–13:10; 14:8–15:10. Finally,  (mid-3rd century) contains extensive portions of all four Gospels. In addition to these major early papyri there are 6 other papyri (, , , ,  and ) dating from between the 3rd–8th century which also have small portions of Luke's Gospel. (See List of New Testament papyri).\n\nLuke–Acts: unity, authorship and date\n\nThe gospel of Luke and the Acts of the Apostles make up a two-volume work which scholars call Luke–Acts. Together they account for 27.5% of the New Testament, the largest contribution by a single author, providing the framework for both the Church's liturgical calendar and the historical outline into which later generations have fitted their idea of the story of Jesus.\n\nThe author is not named in either volume. According to a Church tradition dating from the 2nd century he was the Luke named as a companion of Paul in three of the letters attributed to Paul himself, but  \"a critical consensus emphasizes the countless contradictions between the account in Acts and the authentic Pauline letters (Theissen and Merz 1998, p.32).\" (An example can be seen by comparing Acts' accounts of Paul's conversion (Acts 9:1–31, 22:6–21, and 26:9–23) with Paul's own statement that he remained unknown to Christians in Judea after that event (Galatians 1:17–24).) He admired Paul, but his theology was significantly different from Paul's on key points and he does not (in Acts) represent Paul's views accurately. He was educated, a man of means, probably urban, and someone who respected manual work, although not a worker himself; this is significant, because more high-brow writers of the time looked down on the artisans and small business-people who made up the early church of Paul and were presumably Luke's audience.\n\nThe eclipse of the traditional attribution to Luke the companion of Paul has meant that an early date for the gospel is now rarely put forward. Some experts date the composition of the combined work to around 80–90 AD, although some others suggest 90–110, and there is evidence, both textual (the conflicts between Western and Alexandrian manuscript families) and from the Marcionite controversy (Marcion was a 2nd-century heretic who produced his own version of Christian scripture based on Luke's gospel and Paul's epistles) that Luke–Acts was still being substantially revised well into the 2nd century.\n\nGenre, models and sources\n\nLuke–Acts is a religio-political history of the Founder of the church and his successors, in both deeds and words. The author describes his book as a \"narrative\" (diegesis), rather than as a gospel, and implicitly criticises his predecessors for not giving their readers the speeches of Jesus and the Apostles, as such speeches were the mark of a \"full\" report, the vehicle through which ancient historians conveyed the meaning of their narratives. He seems to have taken as his model the works of two respected Classical authors, Dionysius of Halicarnassus, who wrote a history of Rome, and the Jewish historian Josephus, author of a history of the Jews. All three authors anchor the histories of their respective peoples  by dating the births of the founders (Romulus, Moses and Jesus) and narrate the stories of the founders' births from God, so that they are sons of God. Each founder taught authoritatively, appeared to witnesses after death, and ascended to heaven. Crucial aspects of the teaching of all three concerned the relationship between rich and poor and the question of whether \"foreigners\" were to be received into the people.\n\nThe author used as his sources the gospel of Mark, the sayings collection called the Q source, and a collection of material called the L (for Luke) source. Mark, written around 70 AD, provided the narrative outline, but Mark contains comparatively little of Jesus' teachings. For these Luke turned to Q, which consisted mostly, although not exclusively, of \"sayings\". (Most scholars are reasonably sure that Q existed and that it can be reconstructed). Mark and Q account for about 64% of Luke. The remaining material, known as the L source, is of unknown origin and date. Most Q and L-source material is grouped in two clusters, Luke 6:17–8:3 and 9:51–18:14, and L-source material forms the first two section of the gospel (the preface and infancy and childhood narratives).\n\nAudience and authorial intent\n\nLuke was written to be read aloud to a group of Jesus-followers gathered in a house to share the Lord's supper. The author assumes an educated Greek-speaking audience, but directs his attention to specifically Christian concerns rather than to the Greco-Roman world at large. He begins his gospel with a preface addressed to \"Theophilus\": the name means \"Lover of God,\" and could be an individual or simply any Christian. Here he informs Theophilus of his intention, which is to lead his reader to certainty through an orderly account \"of the events that have been fulfilled among us.\" He did not, however, intend to provide Theophilus with a historical justification of the Christian faith – \"did it happen?\" – but to encourage faith – \"what happened, and what does it all mean?\"\n\nStructure and content\n\nStructure of Luke's Gospel\n\nFollowing the author's preface addressed to his patron and the two birth narratives (John the Baptist and Jesus), the gospel opens in Galilee and moves gradually to its climax in Jerusalem:\n\n# A brief preface addressed to Theophilus stating the author's aims;\n# Birth and infancy narratives for both Jesus and John the Baptist, interpreted as the dawn of the promised era of Israel's salvation;\n# Preparation for Jesus' messianic mission: John's prophetic mission, his baptism of Jesus, and the testing of Jesus' vocation;\n# The beginning of Jesus' mission in Galilee, and the hostile reception there;\n# The central section: the journey to Jerusalem, where Jesus knows he must meet his destiny as God's prophet and messiah;\n# His mission in Jerusalem, culminating in confrontation with the leaders of the Jewish Temple;\n# His last supper with his most intimate followers, followed by his arrest, interrogation, and crucifixion;\n# God's validation of Jesus as Christ: events from the first Easter to the Ascension, showing Jesus' death to be divinely ordained, in keeping with both scriptural promise and the nature of messiahship, and anticipating the story of Acts.For studies of the literary structure of this Gospel, see recent contributions of Bailey, Goulder and Talbert, in particular for their readings of Luke's Central Section. (Almost all scholars believe the section begins at 9.51;  strong case, however, can be put for 9.43b.) Then the introductory pieces to the opening and closing parts that frame the teaching of the Central Section would exhibit a significant dualism: compare 9.43b–45 and 18.31–35. The Central Section would then be defined as 9.43b–19.48, 'Jesus Journey to Jerusalem and its Temple'. Between the opening part ('His Setting out', 9.43b–10.24) and the closing part ('His Arriving', 18.31–19.48) lies a chiasm of parts 1–5,C,5'–1', 'His Teachings on the Way': 1, 10.25–42 Inheriting eternal life: law and love; 2, 11.1–13 Prayer: right praying, persistence, Holy Spirit is given; 3, 11.14–12.12 The Kingdom of God: what is internal is important; 4, 12.13–48 Earthly and Heavenly riches; the coming of the Son of Man; 5, 12.49–13.9 Divisions, warning and prudence, repentance; C, 13.10–14.24 a Sabbath healing, kingdom and entry (13.10–30), Jesus is to die in Jerusalem, his lament for it (13.31–35), a Sabbath healing, banqueting in the kingdom (14.1–24); 5', 14.25–15.32 Divisions, warning and prudence, repentance; 4', 16.1–31 Earthly and Heavenly riches: the coming judgement; 3', 17.1–37 The kingdom of God is 'within', not coming with signs; 2', 18.1–17 Prayer: persistence, right praying, receiving the kingdom; 1', 18.18–30 Inheriting eternal life: law and love. (All the parts 1–5 and 5'–1' are constructed of three parts in the style of ABB'.)\n\nParallel structure of Luke–Acts\n\nThe structure of Acts parallels the structure of the gospel, demonstrating the universality of the divine plan and the shift of authority from Jerusalem to Rome:\n\nThe gospel – the acts of Jesus:\n* The presentation of the child Jesus at the Temple in Jerusalem\n* Jesus' forty days in the desert\n* Jesus in Samaria/Judea\n* Jesus in the Decapolis\n* Jesus receives the Holy Spirit\n* Jesus preaches with power (the power of the spirit)\n* Jesus heals the sick\n* Death of Jesus\n* The apostles are sent to preach to all nations\n\nThe acts of the apostles\n* Jerusalem\n* Forty days before the Ascension\n* Samaria\n* Asia Minor\n* Pentecost: Christ's followers receive the spirit\n* The apostles preach with the power of the spirit\n* The apostles heal the sick\n* Death of Stephen, the first martyr for Christ\n* Paul preaches in Rome\n\nTheology\n\nLuke's \"salvation history\"\n\nLuke's theology is expressed primarily through his overarching plot, the way scenes, themes and characters combine to construct his specific worldview. His \"salvation history\" stretches from the Creation to the present time of his readers, in three ages: first, the time of \"the Law and the Prophets\", the period beginning with Genesis and ending with the appearance of John the Baptist (Luke 1:5–3:1); second, the epoch of Jesus, in which the Kingdom of God was preached (Luke 3:2–24:51); and finally the period of the Church, which began when the risen Christ was taken into Heaven, and would end with his second coming.\n\nChristology\n\nLuke's understanding of Jesus – his Christology – is central to his theology. One approach to this is through the titles Luke gives to Jesus: these include, but are not limited to, Christ (Messiah), Lord, Son of God, and Son of Man. Another is by reading Luke in the context of similar Greco-Roman divine saviour figures (Roman emperors are an example), references which would have made clear to Luke's readers that Jesus was the greatest of all saviours. A third is to approach Luke through his use of the Old Testament, those passages from Jewish scripture which he cites to establish that Jesus is the promised Messiah. While much of this is familiar, much also is missing: for example, Luke makes no clear reference to Christ's pre-existence or to the Christian's union with Christ, and makes relatively little reference to the concept of atonement: perhaps he felt no need to mention these ideas, or disagreed with them, or possibly he was simply unaware of them.\n\nEven what Luke does say about Christ is ambiguous or even contradictory. For example, according to Luke 2:11 Jesus was the Christ at his birth, but in Acts 10:37–38 he becomes Christ at the resurrection, while in Acts 3:20 it seems his messiahship is active only at the parousia, the \"second coming\"; similarly, in Luke 2:11 he is the Saviour from birth, but in Acts 5:31 he is made Saviour at the resurrection; and he is born the Son of God in Luke 1:32–35, but becomes the Son of God at the resurrection according to Acts 13:33. Many of these differences may be due to scribal error, but others were deliberate alterations to doctrinally unacceptable passages, or the introduction by scribes of \"proofs\" for their favourite theological tenets. An important example of such deliberate alterations is found in Luke's account of the baptism of Jesus, where virtually all the earliest witnesses have God saying, \"This day I have begotten you.\" (Luke has taken the words of God from Psalm 2, an ancient royal adoption formula in which the king of Israel was recognised as God's elect). This reading is theologically difficult, as it implies that God is now conferring status on Jesus that he did not previously hold. It is unlikely, therefore, that the more common reading of Luke 3:22 (God says to Jesus, \"You are my beloved son, with you I am well pleased\") is original.\n\nThe Holy Spirit, the Christian community, and the kingdom of God\n\nThe Holy Spirit plays a more important role in Luke–Acts than in the other gospels. Some scholars have argued that the Spirit's involvement in the career of Jesus is paradigmatic of the universal Christian experience, others that Luke's intention was to stress Jesus' uniqueness as the Prophet of the final age. It is clear, however, that Luke understands the enabling power of the Spirit, expressed through non-discriminatory fellowship (\"All who believed were together and had all things in common\"), to be the basis of the Christian community. This community can also be understood as the Kingdom of God, although the kingdom's final consummation will not be seen till the Son of Man comes \"on a cloud\" at the end-time.\n\nChristians vs. Rome and the Jews\n\nLuke needed to define the position of Christians in relation to two political and social entities, the Roman Empire and Judaism. Regarding the Empire Luke makes clear that, while Christians are not a threat to the established order, the rulers of this world hold their power from Satan, and the essential loyalty of Christ's followers is to God and this world will be the kingdom of God, ruled by Christ the King. Regarding the Jews, Luke emphasises the fact that Jesus and all his earliest followers were Jews, although by his time the majority of Christ-followers were gentiles; nevertheless, the Jews had rejected and killed the Messiah, and the Christian mission now lay with the gentiles.\n\nComparison with other writings\n\nThe gospels of Matthew, Mark and Luke share so much in common that they are called the Synoptics, as they frequently cover the same events in similar and sometimes identical language. The majority opinion among scholars is that Mark was the earliest of the three (about 70 AD) and that Matthew and Luke both used this work and the \"sayings gospel\" known as Q as their basic sources. Luke has both expanded Mark and corrected his grammar and syntax – Mark wrote poor Greek. Some passages from Mark he has eliminated entirely, notably most of chapters 6 and 7, which he apparently felt reflected poorly on the disciples and painted Jesus too much like a magician. Despite this, he follows Mark's plot more faithfully than does Matthew.\n\nDespite being grouped with Matthew and Mark, Luke's gospel has a number of parallels with the Gospel of John. For example, Luke uses the terms \"Jews\" and \"Israelites\" in a way unlike Mark, but like John; the figures of Mary of Bethany and Martha as well as a person named Lazarus (although Lazarus of Bethany and the Lazarus of the parable are generally not considered the same person) are found only in Luke and John; and at Jesus' arrest, only Luke and John state that the servant's right ear was cut off (there are several such small details found only in Luke and John). Gospel of Luke. http://en.wikipedia.org/?curid=12491."
  }
}
