{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2397",
  "eid" : "c0082b50-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778401925,
  "textBody" : "Sir Philip Anthony \"Tony\" Hopkins  (born 31 December 1937) is a Welsh  and American film, stage, and television actor. After graduating from the Royal Welsh College of Music & Drama in 1957, he trained at the Royal Academy of Dramatic Art in London, and was then spotted by Laurence Olivier who invited him to join the Royal National Theatre. In 1968, he got his break in film in The Lion in Winter, playing Richard the Lionheart. In the mid 1970s, Richard Attenborough, who would direct five Hopkins films, called him \"the greatest actor of his generation.\"\n\nConsidered to be one of the greatest living actors, Hopkins is well known for his portrayal of Hannibal Lecter in The Silence of the Lambs, for which he won the Academy Award for Best Actor, its sequel Hannibal, and the prequel Red Dragon.  Other notable films include The Mask of Zorro, The Bounty, Meet Joe Black, The Elephant Man, Magic, 84 Charing Cross Road, Bram Stoker's Dracula, Legends of the Fall, Thor and its sequels, The Remains of the Day, Amistad, Nixon, The World's Fastest Indian, Instinct and Fracture. In 2015 he starred in the BBC television film The Dresser, and since 2016, he has starred in the critically acclaimed HBO television series Westworld.\n\nAlong with his Academy Award, Hopkins has won three BAFTA Awards, two Emmys, and the Cecil B. DeMille Award. In 1993, he was knighted by Queen Elizabeth II for services to the arts. He received a star on the Hollywood Walk of Fame in 2003, and was made a Fellow of the British Academy of Film and Television Arts in 2008.\n\nEarly life\n\nHopkins was born on New Year's Eve 1937, in Margam, a suburb of Port Talbot, Glamorgan.[http://www.dailymail.co.uk/femail/article-1252033/Anthony-Hopkins.html Anthony Hopkins: My life in pictures] Daily Mail. Retrieved 6 January 2011.[http://www.walesonline.co.uk/news/wales-news/sir-anthony-hopkins-offers-buy-2496680 Sir Anthony Hopkins offers to buy Welsh childhood home] WalesOnline. Retrieved 2 January 2016 His parents were Annie Muriel (née Yeates) and Richard Arthur Hopkins, a baker.Stated in interview on Inside the Actors Studio, 2007. He stated his father’s working class values have always underscored his life. “Whenever I get a feeling that I may be special or different, I think of my father and I remember his hands – his hardened, broken hands\". His school days were unproductive; he would rather immerse himself in art, such as painting and drawing, or playing the piano, than attend to his studies. In 1949, to instill discipline, his parents insisted he attend Jones' West Monmouth Boys' School in Pontypool. He remained there for five terms and was then educated at Cowbridge Grammar School in the Vale of Glamorgan. In a 2002 interview he stated: \"I was a poor learner, which left me open to ridicule and gave me an inferiority complex. I grew up absolutely convinced I was stupid.\" In desperation, his parents sent him off to boarding school, where the headmaster told him he was \"hopeless\" and he developed a \"sheer contempt for authority.\" He stumbled into acting at 17 with a YMCA group (his one line: \"Blessed are the meek, for they shall inherit the earth\").\n\nHopkins  was influenced and encouraged by Welsh compatriot Richard Burton, whom he met at the age of 15. Hopkins promptly enrolled at the Royal Welsh College of Music & Drama in Cardiff, from which he graduated in 1957. After two years in the British Army doing his national service, he moved to London where he studied at the Royal Academy of Dramatic Art.\"[https://www.nytimes.com/2002/09/29/movies/film-the-scenery-though-he-won-t-chew.html FILM; The Scenery, Though, He Won't Chew]\", Franz Lidz September 29, 2002 - The New York Times\n\nCareer\n\nHopkins made his first professional stage appearance in the Palace Theatre, Swansea, in 1960 with Swansea Little Theatre's production of Have a Cigarette. In 1965, after several years in repertory, he was spotted by Laurence Olivier, who invited him to join the Royal National Theatre in London.[http://www.telegraph.co.uk/news/newstopics/nationaltreasures/2193352/Sir-Anthony-Hopkins-portrait.html Sir Anthony Hopkins portrait] The Daily Telegraph. Retrieved 6 January 2011. Hopkins became Olivier's understudy, and filled in when Olivier was struck with appendicitis during a 1967 production of August Strindberg's The Dance of Death. Olivier later noted in his memoir, Confessions of an Actor, that\n\nHopkins was nervous prior to going on stage, but since that night he has relaxed, quoting his mentor: \"He [Olivier] said: 'Remember: nerves is [sic] vanity – you’re wondering what people think of you; to hell with them, just jump off the edge’. It was great advice.” Despite his success at the National, Hopkins tired of repeating the same roles nightly and yearned to be in films. He made his small-screen debut in a 1967 BBC broadcast of A Flea in Her Ear. His first starring role in a film came in 1964 in Changes, a short directed by Drewe Henley, written and produced by James Scott and co-starring Jacqueline Pearce. In 1968, he got his break in The Lion in Winter playing King Richard the Lionheart. Although Hopkins continued in theatre (most notably at the National Theatre as Lambert Le Roux in Pravda by David Hare and Howard Brenton and as Antony in Antony and Cleopatra opposite Judi Dench as well as in the Broadway production of Peter Shaffer's Equus) he gradually moved away from it to become more established as a television and film actor. He portrayed Charles Dickens in the BBC television film The Great Inimitable Mr. Dickens in 1970, and Pierre Bezukhov in the BBC's mini series War and Peace (1972).[http://www.screenonline.org.uk/people/id/1204295/ BFI Screenonline: Sherrin, Ned (1931-2007) Biography]. BFI. Retrieved 19 January 2015 Making a name for himself as a screen actor, in 1972 he starred as British politician David Lloyd George in Young Winston, and in 1977 he played British Army officer John Frost in the World War II-set film A Bridge Too Far. Both of these films were directed by Richard Attenborough, who described Hopkins as “unquestionably the greatest actor of his generation”.\n\nIn 1980, he starred in The Elephant Man as the English doctor Sir Frederick Treves, who attends to Joseph Merrick (portrayed by John Hurt), a severely deformed man in 19th century London. That year he also starred opposite Shirley MacLaine in A Change of Seasons and famously said \"she was the most obnoxious actress I have ever worked with.\" In 1983, Hopkins also became a company member of The Mirror Theater Ltd's Repertory Company.\nHe remained an enthusiastic member of the company and the Mirror’s Producing Artistic Director Sabra Jones visited him in London in 1986 to discuss moving Pravda to New York from the National Theatre.Gussow, Mel. \"THEATER: MIRROR REP, IN A REVIVAL OF 'RAIN'.\" The New York Times, 10 Mar. 1984. Web. 10 Jan. 2017. .  In 1984, he starred opposite Mel Gibson in The Bounty as William Bligh, captain of the Royal Navy ship the HMS Bounty, in a retelling of the mutiny on the Bounty. In 1992, Hopkins portrayed Professor Van Helsing in Francis Ford Coppola's Bram Stoker's Dracula.\n\nSet in 1950s post-war Britain, Hopkins starred opposite Emma Thompson in the critically acclaimed The Remains of the Day (1993), a film the BFI ranked the 64th greatest British film of the 20th century.[http://www.cinemarealm.com/best-of-cinema/top-100-british-films/ British Film Institute - Top 100 British Films] (1999). Retrieved August 27, 2016 Hopkins was nominated for an Academy Award for Best Actor for his performance, and he received the BAFTA Award for Best Actor. Hopkins portrayed Oxford academic C. S. Lewis in the 1993 British biographical film Shadowlands, for which he was nominated for a BAFTA Award for Best Actor. During the 1990s, Hopkins had the chance to work with Bart the Bear in two films: Legends of the Fall (1994) and The Edge (1997). According to trainer, Lynn Seus, \"Tony Hopkins was absolutely brilliant with Bart...He acknowledged and respected him like a fellow actor. He would spend hours just looking at Bart and admiring him. He did so many of his own scenes with Bart.\"\n\nHopkins was Britain's highest paid performer in 1998, starring in The Mask of Zorro and Meet Joe Black, and also agreed to reprise his role as Dr Hannibal Lecter for a fee of £15 million. In 2000, Hopkins narrated Dr. Seuss' How the Grinch Stole Christmas. Hopkins received a star on the Hollywood Walk of Fame in 2003.[http://www.dailytelegraph.com.au/happy-birthday-sir-anthony-hopkins/story-fn6ccwsa-1225978951467 Happy birthday Sir Anthony Hopkins] The Daily Telegraph (Sydney). Retrieved 5 February 2011 Hopkins stated that his role as Burt Munro, whom he portrayed in his 2005 film The World's Fastest Indian, was his favourite. He also asserted that Munro was the easiest role that he had played because both men have a similar outlook on life. In 2006, Hopkins was the recipient of the Golden Globe Cecil B. DeMille Award for lifetime achievement.[http://news.bbc.co.uk/1/hi/entertainment/4444884.stm Lifetime honour for Sir Anthony] BBC News (17 November 2005) In 2008, he received the BAFTA Academy Fellowship Award, the highest award the British Film Academy can bestow.[http://news.bbc.co.uk/1/hi/7191143.stm Bafta Film Awards 2008: The winners] BBC News (10 February 2008)\n\nOn 24 February 2010, it was announced that Hopkins had been cast in The Rite, which was released on 28 January 2011. He played a priest who is \"an expert in exorcisms and whose methods are not necessarily traditional\". Hopkins, who is quoted as saying \"I don't know what I believe, myself personally\", reportedly wrote a line--\"Some days I don't know if I believe in God or Santa Claus or Tinkerbell\"—into his character in order to identify with it.[http://io9.com/5744377/anthony-hopkins-reveals-the-secret-atheist-message-he-put-into-the-rite Anthony Hopkins reveals the secret atheist message he put into The Rite]. Retrieved 29 September 2014. On the other hand, in other sources from the same time, he is quoted as saying that he did believe in God and had done so for decades.[http://www.christianpost.com/news/anthony-hopkins-talks-about-finding-god-alcohol-addiction-48873/ Anthony Hopkins Talks about Finding God, Alcohol Addiction]. The Christian Post. (7 February 2011). Retrieved 23 October 2013. On 21 September 2011, Peter R. de Vries named Hopkins in the role of the Heineken owner Freddy Heineken in a future film about his kidnapping.\n\nHopkins portrayed Odin, the Allfather or \"king\" of Asgard, in the 2011 film adaptation of Marvel Comics' Thor. Hopkins portrayed Alfred Hitchcock in Sacha Gervasi's biopic Hitchcock, following his career while making Psycho. The film was released on 23 November 2012. In 2013, he reprised his role as Odin in Thor: The Dark World. In 2014, he portrayed Methuselah in Darren Aronofsky's Noah. Since October 2016, Hopkins has been starring as Robert Ford in the HBO sci-fi series Westworld. Hopkins played Autobot ally Sir Edmund Burton in Transformers: The Last Knight, which was released in June 2017.\n\nHannibal Lecter\n\nHopkins' most famous role is as the cannibalistic serial killer Hannibal Lecter in The Silence of the Lambs, for which he won the Academy Award for Best Actor in 1991, with Jodie Foster as Clarice Starling, who also won for Best Actress. The film won Best Picture, Best Director and Academy Award for Best Adapted Screenplay, and Hopkins also picked up his first BAFTA for Best Actor. Hopkins reprised his role as Lecter twice; in Ridley Scott's Hannibal (2001), and Red Dragon (2002).\n\nHis original portrayal of the character in The Silence of the Lambs has been labelled by the AFI as the number-one film villain. At the time he was offered the role, Hopkins was making a return to the London stage, performing in M. Butterfly. He had come back to Britain after living for a number of years in Hollywood, having all but given up on a career there, saying, \"Well that part of my life's over; it's a chapter closed. I suppose I'll just have to settle for being a respectable actor poncing around the West End and doing respectable BBC work for the rest of my life.\" Hopkins played the iconic villain in adaptations of the first three of the Lecter novels by Thomas Harris. The author was reportedly very pleased with Hopkins' portrayal of his antagonist. However, Hopkins stated that Red Dragon would feature his final performance as the character, and that he would not reprise even a narrative role in the latest addition to the series, Hannibal Rising.\n\nActing style\n\nHopkins is renowned for his preparation for roles. He indicated in interviews that once he has committed to a project, he will go over his lines as many times as is needed (sometimes upwards of 200) until the lines sound natural to him, so that he can \"do it without thinking\". This leads to an almost casual style of delivery that belies the amount of groundwork done beforehand. While it can allow for some careful improvisation, it has also brought him into conflict with the occasional director who departs from the script, or demands what the actor views as an excessive number of takes. Hopkins has stated that after he is finished with a scene, he simply discards the lines, not remembering them later on. This is unlike others who usually remember their lines from a film, even years later.\"Anthony Hopkins: Lecter and Me\" — Red Dragon DVD interview\n\nRichard Attenborough, who directed Hopkins on five occasions, found himself going to great lengths during the filming of Shadowlands (1993) to accommodate the differing approaches of his two stars (Hopkins and Debra Winger), who shared many scenes. Whereas Hopkins, preferring the spontaneity of a fresh take, liked to keep rehearsals to a minimum, Winger rehearsed continuously. To allow for this, Attenborough stood in for Hopkins during Winger's rehearsals, only bringing him in for the last one before a take. The director praised Hopkins for \"this extraordinary ability to make you believe when you hear him that it is the very first time he has ever said that line. It's an incredible gift.\"\n\nRenowned for his ability to remember lines, Hopkins keeps his memory supple by learning things by heart such as poetry, and Shakespeare. In Steven Spielberg's Amistad, Hopkins astounded the crew with his memorisation of a seven-page courtroom speech, delivering it in one go. An overawed Spielberg couldn't bring himself to call him Tony, and insisted on addressing him as Sir Anthony throughout the shoot.[https://www.theguardian.com/film/1998/dec/05/features A dark and stormy knight] The Guardian. Retrieved 6 January 2011.\n\nHopkins is a gifted mimic, adept at turning his native Welsh accent into whatever is required by a character. He duplicated the voice of his late mentor, Laurence Olivier, for additional scenes in Spartacus in its 1991 restoration. His interview on the 1998 relaunch edition of the British TV talk show Parkinson featured an impersonation of comedian Tommy Cooper. Hopkins has said acting \"like a submarine\" has helped him to deliver credible performances in his thrillers. He said, \"It's very difficult for an actor to avoid, you want to show a bit. But I think the less one shows the better.\"\n\nHonours\n\nAnthony Hopkins was made a Commander of the Order of the British Empire (CBE) in 1987, and was knighted as a Knight Bachelor at Buckingham Palace in 1993 for services to the arts.[http://www.bbc.co.uk/wales/arts/sites/film/pages/actors-anthony-hopkins.shtml BBC – Wales – Arts – Top 10 Welsh actors: Anthony Hopkins] BBC Retrieved 2 January 2010[http://articles.chicagotribune.com/1993-02-23/news/9303184625_1_actor-anthony-hopkins-knighted-serial-killer Actor Anthony Hopkins Knighted By Queen Elizabeth] Chicago Tribune (23 February 1993) In 1988, Hopkins was made an Honorary D.Litt and in 1992 was awarded Honorary fellowship from the University of Wales, Lampeter.[http://www.bbc.co.uk/wales/arts/sites/anthony-hopkins/pages/biography.shtml Anthony Hopkins biography], BBC. Retrieved 2 January 2010. He was made a freeman of his home town, Port Talbot, in 1996.17 October 2013. \"Max to Join Sheen as Freeman of Borough\". Western Mail (Cardiff, Wales).\n\nPersonal life\n\nHopkins resides in Malibu, California.[https://www.theguardian.com/film/2013/oct/17/anthony-hopkins-bryan-cranston-breaking-bad-fan-letter \"Anthony Hopkins's letter to Breaking Bad star Bryan Cranston\"], The Guardian. Retrieved 31 December 2015. He had moved to the US once before during the late 1970s to pursue his film career, but returned to London in the late 1980s. However, he decided to return to the US following his 1990s success. Retaining his British citizenship, he became a naturalised US citizen on 12 April 2000, with Hopkins stating: \"I have dual citizenship; it just so happens I live in America\".\n\nHopkins has been married three times: to Petronella Barker from 1966 to 1972; to Jennifer Lynton from 1973 to 2002; and, since 2003, to Stella Arroyave. On Christmas Eve 2012, he celebrated his 10th wedding anniversary by having a blessing at a private service at St David's Cathedral, Pembrokeshire in the most westerly point of Wales.[http://www.thisissouthwales.co.uk/Hannibal-star-Sir-Anthony-Hopkins-makes-trek/story-17756782-detail/story.html \"Hannibal star Sir Anthony Hopkins makes a trek back to his childhood home in Margam\"], South Wales Evening Post. Retrieved 8 January 2013. He has a daughter, actress and singer Abigail Hopkins (born 20 August 1968), from his first marriage.\n\nHopkins is a recovering alcoholic; he has stayed sober since he stopped drinking just after Christmas 1975. In 2002, he told the New York Times that he woke up in a Phoenix hotel room with no memory of having driven from Los Angeles. \"It was two days before his 38th birthday. Still, he continued to spiral downward, at times sitting at home for hours without saying a word. He'd climb in his car and cruise aimlessly for days: once he went on a drive and didn't return for two months. \"If there is someone fighting within you, it makes your life unbearable,\" he said. \"Anger has to be converted into something else or it destroys you.\"\"[https://www.nytimes.com/2002/09/29/movies/film-the-scenery-though-he-won-t-chew.html FILM; The Scenery, Though, He Won't Chew]\", Franz Lidz September 29, 2002 - The New York Times[http://www.walesonline.co.uk/news/wales-news/new-book-tells-wales-famous-2120728 Profile] , walesonline.co.uk. Retrieved 29 September 2014. He said that a major help in his recovery was his belief in God. He has criticised atheism, saying in 2011 that \"being an atheist must be like living in a closed cell with no windows\". In an interview with Larry King in 2016, Hopkins described himself as an agnostic and said he believed in a \"superior consciousness in all of us\".[https://www.youtube.com/watch?v=po_Bii78Wvw \"Larry King Now Interview with Anthony Hopkins\"]. YouTube. Retrieved 20 November 2016 He gave up smoking using the Allen Carr method.[http://allencarr.com/40/celebrity-endorsements \"Celebrity Clients: Endorsements\"]. Allen Carr. Retrieved 4 January 2015 In 2008, he embarked on a weight loss program, and by 2010, he had lost 80 pounds.\n\nIn January 2017, in an interview with The Desert Sun, Hopkins reported that he had been diagnosed with Asperger syndrome, but that he was \"high end\".\n\nPhilanthropy\n\nHopkins has offered his support to various charities and appeals, notably becoming President of the National Trust's Snowdonia Appeal, raising funds for the preservation of Snowdonia National Park in north Wales. In 1998 he donated £1 million towards the £3 million needed to aid the Trust's efforts in purchasing parts of Snowdon.[https://www.independent.co.uk/news/anthony-hopkins-gives-pounds-1m-to-snowdon-1171083.html \"Anthony Hopkins gives pounds 1m to Snowdon\"], The Independent. Retrieved 19 October 2011.[http://news.bbc.co.uk/1/hi/uk/149533.stm \"Hopkins gives a million to save Snowdonia\"], BBC. Retrieved 19 October 2011. Prior to the campaign, Hopkins authored Anthony Hopkins' Snowdonia, which was published in 1995.Hopkins, Anthony (1995). Anthony Hopkins' Snowdonia. Colin Baxter Photography, 1995 Due to his contributions to Snowdonia, in addition to his film career, in 2004 Hopkins was named among the 100 Welsh Heroes in a Welsh poll.\n\nHopkins has been a patron of the YMCA centre in his home town of Port Talbot, South Wales for more than 20 years, having first joined the YMCA in the 1950s.[http://www.bbc.co.uk/news/uk-wales-south-west-wales-10683793 \"Drama returns to YMCA where Sir Anthony Hopkins started\"], BBC Wales, 20 July 2010. He supports other various philanthropic groups. He was a Guest of Honour at a Gala Fundraiser for Women in Recovery, Inc., a Venice, California-based non-profit organisation offering rehabilitation assistance to women in recovery from substance abuse. He is also a volunteer teacher at the Ruskin School of Acting in Santa Monica, California. Hopkins served as the Honorary Patron of The New Heritage Theatre Company in Boise, Idaho from 1997-2007, participating in fundraising and marketing efforts for the repertory theatre.[http://arbiteronline.com/2000/09/07/branthony-hopkins-to-kick-off-5-4-million-fund-drive/ \"Anthony Hopkins to kick off $5.4 million fund drive\"]. Arbiter. Retrieved 4 January 2015\n\nHopkins contributed toward the refurbishment of a £2.3 million wing at his alma mater, the Royal Welsh College of Music & Drama in Cardiff, named the Anthony Hopkins Centre. It opened in 1999.[https://www.independent.co.uk/student/into-university/az-uni-colleges/royal-welsh-college-of-music-and-drama-459044.html \"Royal Welsh College of Music & Drama\"], Independent.co.uk. Retrieved 24 December 2013.\n\nHopkins is a prominent member of environmental protection group Greenpeace and as of early 2008 featured in a television advertisement campaign, voicing concerns about Japan's continuing annual whale hunt. He has also been a patron of RAPt (Rehabilitation for Addicted Prisoners Trust) since its early days and helped open their first intensive drug and alcohol rehabilitation unit at Downview (HM Prison) in 1992.\n\nHopkins is an admirer of the Welsh comedian Tommy Cooper. On 23 February 2008, as patron of the Tommy Cooper Society, he unveiled a commemorative statue in the entertainer's home town of Caerphilly. For the ceremony, he donned Cooper's trademark fez and performed a comic routine.\n\nOther work\n\nIn a 2012 interview, Hopkins stated, \"I've been composing music all my life and if I'd been clever enough at school I would like to have gone to music college. As it was I had to settle for being an actor.\" In 1986, he released a single called \"Distant Star\", which peaked at No. 75 in the UK Singles Chart. In 2007, he announced he would retire temporarily from the screen to tour around the world. Hopkins has also written music for the concert hall, in collaboration with Stephen Barton as orchestrator. These compositions include The Masque of Time, given its world premiere with the Dallas Symphony Orchestra in October 2008, and Schizoid Salsa.\n\nIn 1990, Hopkins directed a film about his Welsh compatriot, poet Dylan Thomas, titled Dylan Thomas: Return Journey, which was his directing debut for the screen. In the same year, as part of the restoration process for the Stanley Kubrick film Spartacus, Hopkins was approached to re-record lines from a scene that was being added back to the film; this scene featured Laurence Olivier and Tony Curtis, with Hopkins recommended by Olivier's widow, Joan Plowright to perform her late husband's part thanks to his talent for mimicry.\n\nIn 1996, he directed August, an adaptation of Chekhov's Uncle Vanya set in Wales. His first screenplay, an experimental drama called Slipstream, which he also directed and scored, premiered at the Sundance Film Festival in 2007. In 1997, Hopkins narrated the BBC natural documentary series, Killing for a Living, which showed predatory behaviour in nature. He narrated episode 1 through 3 before being replaced by John Shrapnel.\n\nHopkins is a fan of the BBC sitcom Only Fools and Horses, and once remarked in an interview how he would love to appear in the series. Writer John Sullivan saw the interview, and with Hopkins in mind created the character Danny Driscoll, a local villain. However, filming of the new series coincided with the filming of The Silence of the Lambs, making Hopkins unavailable. The role instead went to Roy Marsden.\n\nOn 31 October 2011, André Rieu released an album including a waltz which Hopkins had composed in 1964, at the age of 26. Hopkins had never heard his composition, \"And the Waltz Goes On\", before it was premiered by Rieu's orchestra in Vienna; Rieu's album was given the same name as Hopkins' piece.\n\nIn January 2012, Hopkins released an album of classical music, entitled Composer, performed by the City of Birmingham Symphony Orchestra, and released on CD via the UK radio station Classic FM. The album consists of nine of his original works and film scores, with one of the pieces titled \"Margam\" in tribute to his home town near Port Talbot in Wales.\n\nIn October 2015, Hopkins appeared as Sir in a BBC Two production of Ronald Harwood's The Dresser, alongside Ian McKellen, Edward Fox and Emily Watson. The Dresser is set in a London theatre during the Blitz, where an aging actor-manager, Sir, prepares for his starring role in King Lear with the help of his devoted dresser, Norman. Hopkins described his role as Sir as “the highlight of my life”. “It was a chance to work with the actors I had run away from. To play another actor is fun because you know the ins and outs of their thinking – especially with someone like Sir, who is a diabolically insecure, egotistical man.\"\n\nFilmography\n\nAwards and nominations",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Anthony Hopkins" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2397" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Sir Philip Anthony \"Tony\" Hopkins  (born 31 December 1937) is a Welsh  and American film, stage, and television actor. After graduating from the Royal Welsh College of Music & Drama in 1957, he trained at the Royal Academy of Dramatic Art in London, and was then spotted by Laurence Olivier who invited him to join the Royal National Theatre. In 1968, he got his break in film in The Lion in Winter, playing Richard the Lionheart. In the mid 1970s, Richard Attenborough, who would direct five Hopkins films, called him \"the greatest actor of his generation.\"\n\nConsidered to be one of the greatest living actors, Hopkins is well known for his portrayal of Hannibal Lecter in The Silence of the Lambs, for which he won the Academy Award for Best Actor, its sequel Hannibal, and the prequel Red Dragon.  Other notable films include The Mask of Zorro, The Bounty, Meet Joe Black, The Elephant Man, Magic, 84 Charing Cross Road, Bram Stoker's Dracula, Legends of the Fall, Thor and its sequels, The Remains of the Day, Amistad, Nixon, The World's Fastest Indian, Instinct and Fracture. In 2015 he starred in the BBC television film The Dresser, and since 2016, he has starred in the critically acclaimed HBO television series Westworld.\n\nAlong with his Academy Award, Hopkins has won three BAFTA Awards, two Emmys, and the Cecil B. DeMille Award. In 1993, he was knighted by Queen Elizabeth II for services to the arts. He received a star on the Hollywood Walk of Fame in 2003, and was made a Fellow of the British Academy of Film and Television Arts in 2008.\n\nEarly life\n\nHopkins was born on New Year's Eve 1937, in Margam, a suburb of Port Talbot, Glamorgan.[http://www.dailymail.co.uk/femail/article-1252033/Anthony-Hopkins.html Anthony Hopkins: My life in pictures] Daily Mail. Retrieved 6 January 2011.[http://www.walesonline.co.uk/news/wales-news/sir-anthony-hopkins-offers-buy-2496680 Sir Anthony Hopkins offers to buy Welsh childhood home] WalesOnline. Retrieved 2 January 2016 His parents were Annie Muriel (née Yeates) and Richard Arthur Hopkins, a baker.Stated in interview on Inside the Actors Studio, 2007. He stated his father’s working class values have always underscored his life. “Whenever I get a feeling that I may be special or different, I think of my father and I remember his hands – his hardened, broken hands\". His school days were unproductive; he would rather immerse himself in art, such as painting and drawing, or playing the piano, than attend to his studies. In 1949, to instill discipline, his parents insisted he attend Jones' West Monmouth Boys' School in Pontypool. He remained there for five terms and was then educated at Cowbridge Grammar School in the Vale of Glamorgan. In a 2002 interview he stated: \"I was a poor learner, which left me open to ridicule and gave me an inferiority complex. I grew up absolutely convinced I was stupid.\" In desperation, his parents sent him off to boarding school, where the headmaster told him he was \"hopeless\" and he developed a \"sheer contempt for authority.\" He stumbled into acting at 17 with a YMCA group (his one line: \"Blessed are the meek, for they shall inherit the earth\").\n\nHopkins  was influenced and encouraged by Welsh compatriot Richard Burton, whom he met at the age of 15. Hopkins promptly enrolled at the Royal Welsh College of Music & Drama in Cardiff, from which he graduated in 1957. After two years in the British Army doing his national service, he moved to London where he studied at the Royal Academy of Dramatic Art.\"[https://www.nytimes.com/2002/09/29/movies/film-the-scenery-though-he-won-t-chew.html FILM; The Scenery, Though, He Won't Chew]\", Franz Lidz September 29, 2002 - The New York Times\n\nCareer\n\nHopkins made his first professional stage appearance in the Palace Theatre, Swansea, in 1960 with Swansea Little Theatre's production of Have a Cigarette. In 1965, after several years in repertory, he was spotted by Laurence Olivier, who invited him to join the Royal National Theatre in London.[http://www.telegraph.co.uk/news/newstopics/nationaltreasures/2193352/Sir-Anthony-Hopkins-portrait.html Sir Anthony Hopkins portrait] The Daily Telegraph. Retrieved 6 January 2011. Hopkins became Olivier's understudy, and filled in when Olivier was struck with appendicitis during a 1967 production of August Strindberg's The Dance of Death. Olivier later noted in his memoir, Confessions of an Actor, that\n\nHopkins was nervous prior to going on stage, but since that night he has relaxed, quoting his mentor: \"He [Olivier] said: 'Remember: nerves is [sic] vanity – you’re wondering what people think of you; to hell with them, just jump off the edge’. It was great advice.” Despite his success at the National, Hopkins tired of repeating the same roles nightly and yearned to be in films. He made his small-screen debut in a 1967 BBC broadcast of A Flea in Her Ear. His first starring role in a film came in 1964 in Changes, a short directed by Drewe Henley, written and produced by James Scott and co-starring Jacqueline Pearce. In 1968, he got his break in The Lion in Winter playing King Richard the Lionheart. Although Hopkins continued in theatre (most notably at the National Theatre as Lambert Le Roux in Pravda by David Hare and Howard Brenton and as Antony in Antony and Cleopatra opposite Judi Dench as well as in the Broadway production of Peter Shaffer's Equus) he gradually moved away from it to become more established as a television and film actor. He portrayed Charles Dickens in the BBC television film The Great Inimitable Mr. Dickens in 1970, and Pierre Bezukhov in the BBC's mini series War and Peace (1972).[http://www.screenonline.org.uk/people/id/1204295/ BFI Screenonline: Sherrin, Ned (1931-2007) Biography]. BFI. Retrieved 19 January 2015 Making a name for himself as a screen actor, in 1972 he starred as British politician David Lloyd George in Young Winston, and in 1977 he played British Army officer John Frost in the World War II-set film A Bridge Too Far. Both of these films were directed by Richard Attenborough, who described Hopkins as “unquestionably the greatest actor of his generation”.\n\nIn 1980, he starred in The Elephant Man as the English doctor Sir Frederick Treves, who attends to Joseph Merrick (portrayed by John Hurt), a severely deformed man in 19th century London. That year he also starred opposite Shirley MacLaine in A Change of Seasons and famously said \"she was the most obnoxious actress I have ever worked with.\" In 1983, Hopkins also became a company member of The Mirror Theater Ltd's Repertory Company.\nHe remained an enthusiastic member of the company and the Mirror’s Producing Artistic Director Sabra Jones visited him in London in 1986 to discuss moving Pravda to New York from the National Theatre.Gussow, Mel. \"THEATER: MIRROR REP, IN A REVIVAL OF 'RAIN'.\" The New York Times, 10 Mar. 1984. Web. 10 Jan. 2017. .  In 1984, he starred opposite Mel Gibson in The Bounty as William Bligh, captain of the Royal Navy ship the HMS Bounty, in a retelling of the mutiny on the Bounty. In 1992, Hopkins portrayed Professor Van Helsing in Francis Ford Coppola's Bram Stoker's Dracula.\n\nSet in 1950s post-war Britain, Hopkins starred opposite Emma Thompson in the critically acclaimed The Remains of the Day (1993), a film the BFI ranked the 64th greatest British film of the 20th century.[http://www.cinemarealm.com/best-of-cinema/top-100-british-films/ British Film Institute - Top 100 British Films] (1999). Retrieved August 27, 2016 Hopkins was nominated for an Academy Award for Best Actor for his performance, and he received the BAFTA Award for Best Actor. Hopkins portrayed Oxford academic C. S. Lewis in the 1993 British biographical film Shadowlands, for which he was nominated for a BAFTA Award for Best Actor. During the 1990s, Hopkins had the chance to work with Bart the Bear in two films: Legends of the Fall (1994) and The Edge (1997). According to trainer, Lynn Seus, \"Tony Hopkins was absolutely brilliant with Bart...He acknowledged and respected him like a fellow actor. He would spend hours just looking at Bart and admiring him. He did so many of his own scenes with Bart.\"\n\nHopkins was Britain's highest paid performer in 1998, starring in The Mask of Zorro and Meet Joe Black, and also agreed to reprise his role as Dr Hannibal Lecter for a fee of £15 million. In 2000, Hopkins narrated Dr. Seuss' How the Grinch Stole Christmas. Hopkins received a star on the Hollywood Walk of Fame in 2003.[http://www.dailytelegraph.com.au/happy-birthday-sir-anthony-hopkins/story-fn6ccwsa-1225978951467 Happy birthday Sir Anthony Hopkins] The Daily Telegraph (Sydney). Retrieved 5 February 2011 Hopkins stated that his role as Burt Munro, whom he portrayed in his 2005 film The World's Fastest Indian, was his favourite. He also asserted that Munro was the easiest role that he had played because both men have a similar outlook on life. In 2006, Hopkins was the recipient of the Golden Globe Cecil B. DeMille Award for lifetime achievement.[http://news.bbc.co.uk/1/hi/entertainment/4444884.stm Lifetime honour for Sir Anthony] BBC News (17 November 2005) In 2008, he received the BAFTA Academy Fellowship Award, the highest award the British Film Academy can bestow.[http://news.bbc.co.uk/1/hi/7191143.stm Bafta Film Awards 2008: The winners] BBC News (10 February 2008)\n\nOn 24 February 2010, it was announced that Hopkins had been cast in The Rite, which was released on 28 January 2011. He played a priest who is \"an expert in exorcisms and whose methods are not necessarily traditional\". Hopkins, who is quoted as saying \"I don't know what I believe, myself personally\", reportedly wrote a line--\"Some days I don't know if I believe in God or Santa Claus or Tinkerbell\"—into his character in order to identify with it.[http://io9.com/5744377/anthony-hopkins-reveals-the-secret-atheist-message-he-put-into-the-rite Anthony Hopkins reveals the secret atheist message he put into The Rite]. Retrieved 29 September 2014. On the other hand, in other sources from the same time, he is quoted as saying that he did believe in God and had done so for decades.[http://www.christianpost.com/news/anthony-hopkins-talks-about-finding-god-alcohol-addiction-48873/ Anthony Hopkins Talks about Finding God, Alcohol Addiction]. The Christian Post. (7 February 2011). Retrieved 23 October 2013. On 21 September 2011, Peter R. de Vries named Hopkins in the role of the Heineken owner Freddy Heineken in a future film about his kidnapping.\n\nHopkins portrayed Odin, the Allfather or \"king\" of Asgard, in the 2011 film adaptation of Marvel Comics' Thor. Hopkins portrayed Alfred Hitchcock in Sacha Gervasi's biopic Hitchcock, following his career while making Psycho. The film was released on 23 November 2012. In 2013, he reprised his role as Odin in Thor: The Dark World. In 2014, he portrayed Methuselah in Darren Aronofsky's Noah. Since October 2016, Hopkins has been starring as Robert Ford in the HBO sci-fi series Westworld. Hopkins played Autobot ally Sir Edmund Burton in Transformers: The Last Knight, which was released in June 2017.\n\nHannibal Lecter\n\nHopkins' most famous role is as the cannibalistic serial killer Hannibal Lecter in The Silence of the Lambs, for which he won the Academy Award for Best Actor in 1991, with Jodie Foster as Clarice Starling, who also won for Best Actress. The film won Best Picture, Best Director and Academy Award for Best Adapted Screenplay, and Hopkins also picked up his first BAFTA for Best Actor. Hopkins reprised his role as Lecter twice; in Ridley Scott's Hannibal (2001), and Red Dragon (2002).\n\nHis original portrayal of the character in The Silence of the Lambs has been labelled by the AFI as the number-one film villain. At the time he was offered the role, Hopkins was making a return to the London stage, performing in M. Butterfly. He had come back to Britain after living for a number of years in Hollywood, having all but given up on a career there, saying, \"Well that part of my life's over; it's a chapter closed. I suppose I'll just have to settle for being a respectable actor poncing around the West End and doing respectable BBC work for the rest of my life.\" Hopkins played the iconic villain in adaptations of the first three of the Lecter novels by Thomas Harris. The author was reportedly very pleased with Hopkins' portrayal of his antagonist. However, Hopkins stated that Red Dragon would feature his final performance as the character, and that he would not reprise even a narrative role in the latest addition to the series, Hannibal Rising.\n\nActing style\n\nHopkins is renowned for his preparation for roles. He indicated in interviews that once he has committed to a project, he will go over his lines as many times as is needed (sometimes upwards of 200) until the lines sound natural to him, so that he can \"do it without thinking\". This leads to an almost casual style of delivery that belies the amount of groundwork done beforehand. While it can allow for some careful improvisation, it has also brought him into conflict with the occasional director who departs from the script, or demands what the actor views as an excessive number of takes. Hopkins has stated that after he is finished with a scene, he simply discards the lines, not remembering them later on. This is unlike others who usually remember their lines from a film, even years later.\"Anthony Hopkins: Lecter and Me\" — Red Dragon DVD interview\n\nRichard Attenborough, who directed Hopkins on five occasions, found himself going to great lengths during the filming of Shadowlands (1993) to accommodate the differing approaches of his two stars (Hopkins and Debra Winger), who shared many scenes. Whereas Hopkins, preferring the spontaneity of a fresh take, liked to keep rehearsals to a minimum, Winger rehearsed continuously. To allow for this, Attenborough stood in for Hopkins during Winger's rehearsals, only bringing him in for the last one before a take. The director praised Hopkins for \"this extraordinary ability to make you believe when you hear him that it is the very first time he has ever said that line. It's an incredible gift.\"\n\nRenowned for his ability to remember lines, Hopkins keeps his memory supple by learning things by heart such as poetry, and Shakespeare. In Steven Spielberg's Amistad, Hopkins astounded the crew with his memorisation of a seven-page courtroom speech, delivering it in one go. An overawed Spielberg couldn't bring himself to call him Tony, and insisted on addressing him as Sir Anthony throughout the shoot.[https://www.theguardian.com/film/1998/dec/05/features A dark and stormy knight] The Guardian. Retrieved 6 January 2011.\n\nHopkins is a gifted mimic, adept at turning his native Welsh accent into whatever is required by a character. He duplicated the voice of his late mentor, Laurence Olivier, for additional scenes in Spartacus in its 1991 restoration. His interview on the 1998 relaunch edition of the British TV talk show Parkinson featured an impersonation of comedian Tommy Cooper. Hopkins has said acting \"like a submarine\" has helped him to deliver credible performances in his thrillers. He said, \"It's very difficult for an actor to avoid, you want to show a bit. But I think the less one shows the better.\"\n\nHonours\n\nAnthony Hopkins was made a Commander of the Order of the British Empire (CBE) in 1987, and was knighted as a Knight Bachelor at Buckingham Palace in 1993 for services to the arts.[http://www.bbc.co.uk/wales/arts/sites/film/pages/actors-anthony-hopkins.shtml BBC – Wales – Arts – Top 10 Welsh actors: Anthony Hopkins] BBC Retrieved 2 January 2010[http://articles.chicagotribune.com/1993-02-23/news/9303184625_1_actor-anthony-hopkins-knighted-serial-killer Actor Anthony Hopkins Knighted By Queen Elizabeth] Chicago Tribune (23 February 1993) In 1988, Hopkins was made an Honorary D.Litt and in 1992 was awarded Honorary fellowship from the University of Wales, Lampeter.[http://www.bbc.co.uk/wales/arts/sites/anthony-hopkins/pages/biography.shtml Anthony Hopkins biography], BBC. Retrieved 2 January 2010. He was made a freeman of his home town, Port Talbot, in 1996.17 October 2013. \"Max to Join Sheen as Freeman of Borough\". Western Mail (Cardiff, Wales).\n\nPersonal life\n\nHopkins resides in Malibu, California.[https://www.theguardian.com/film/2013/oct/17/anthony-hopkins-bryan-cranston-breaking-bad-fan-letter \"Anthony Hopkins's letter to Breaking Bad star Bryan Cranston\"], The Guardian. Retrieved 31 December 2015. He had moved to the US once before during the late 1970s to pursue his film career, but returned to London in the late 1980s. However, he decided to return to the US following his 1990s success. Retaining his British citizenship, he became a naturalised US citizen on 12 April 2000, with Hopkins stating: \"I have dual citizenship; it just so happens I live in America\".\n\nHopkins has been married three times: to Petronella Barker from 1966 to 1972; to Jennifer Lynton from 1973 to 2002; and, since 2003, to Stella Arroyave. On Christmas Eve 2012, he celebrated his 10th wedding anniversary by having a blessing at a private service at St David's Cathedral, Pembrokeshire in the most westerly point of Wales.[http://www.thisissouthwales.co.uk/Hannibal-star-Sir-Anthony-Hopkins-makes-trek/story-17756782-detail/story.html \"Hannibal star Sir Anthony Hopkins makes a trek back to his childhood home in Margam\"], South Wales Evening Post. Retrieved 8 January 2013. He has a daughter, actress and singer Abigail Hopkins (born 20 August 1968), from his first marriage.\n\nHopkins is a recovering alcoholic; he has stayed sober since he stopped drinking just after Christmas 1975. In 2002, he told the New York Times that he woke up in a Phoenix hotel room with no memory of having driven from Los Angeles. \"It was two days before his 38th birthday. Still, he continued to spiral downward, at times sitting at home for hours without saying a word. He'd climb in his car and cruise aimlessly for days: once he went on a drive and didn't return for two months. \"If there is someone fighting within you, it makes your life unbearable,\" he said. \"Anger has to be converted into something else or it destroys you.\"\"[https://www.nytimes.com/2002/09/29/movies/film-the-scenery-though-he-won-t-chew.html FILM; The Scenery, Though, He Won't Chew]\", Franz Lidz September 29, 2002 - The New York Times[http://www.walesonline.co.uk/news/wales-news/new-book-tells-wales-famous-2120728 Profile] , walesonline.co.uk. Retrieved 29 September 2014. He said that a major help in his recovery was his belief in God. He has criticised atheism, saying in 2011 that \"being an atheist must be like living in a closed cell with no windows\". In an interview with Larry King in 2016, Hopkins described himself as an agnostic and said he believed in a \"superior consciousness in all of us\".[https://www.youtube.com/watch?v=po_Bii78Wvw \"Larry King Now Interview with Anthony Hopkins\"]. YouTube. Retrieved 20 November 2016 He gave up smoking using the Allen Carr method.[http://allencarr.com/40/celebrity-endorsements \"Celebrity Clients: Endorsements\"]. Allen Carr. Retrieved 4 January 2015 In 2008, he embarked on a weight loss program, and by 2010, he had lost 80 pounds.\n\nIn January 2017, in an interview with The Desert Sun, Hopkins reported that he had been diagnosed with Asperger syndrome, but that he was \"high end\".\n\nPhilanthropy\n\nHopkins has offered his support to various charities and appeals, notably becoming President of the National Trust's Snowdonia Appeal, raising funds for the preservation of Snowdonia National Park in north Wales. In 1998 he donated £1 million towards the £3 million needed to aid the Trust's efforts in purchasing parts of Snowdon.[https://www.independent.co.uk/news/anthony-hopkins-gives-pounds-1m-to-snowdon-1171083.html \"Anthony Hopkins gives pounds 1m to Snowdon\"], The Independent. Retrieved 19 October 2011.[http://news.bbc.co.uk/1/hi/uk/149533.stm \"Hopkins gives a million to save Snowdonia\"], BBC. Retrieved 19 October 2011. Prior to the campaign, Hopkins authored Anthony Hopkins' Snowdonia, which was published in 1995.Hopkins, Anthony (1995). Anthony Hopkins' Snowdonia. Colin Baxter Photography, 1995 Due to his contributions to Snowdonia, in addition to his film career, in 2004 Hopkins was named among the 100 Welsh Heroes in a Welsh poll.\n\nHopkins has been a patron of the YMCA centre in his home town of Port Talbot, South Wales for more than 20 years, having first joined the YMCA in the 1950s.[http://www.bbc.co.uk/news/uk-wales-south-west-wales-10683793 \"Drama returns to YMCA where Sir Anthony Hopkins started\"], BBC Wales, 20 July 2010. He supports other various philanthropic groups. He was a Guest of Honour at a Gala Fundraiser for Women in Recovery, Inc., a Venice, California-based non-profit organisation offering rehabilitation assistance to women in recovery from substance abuse. He is also a volunteer teacher at the Ruskin School of Acting in Santa Monica, California. Hopkins served as the Honorary Patron of The New Heritage Theatre Company in Boise, Idaho from 1997-2007, participating in fundraising and marketing efforts for the repertory theatre.[http://arbiteronline.com/2000/09/07/branthony-hopkins-to-kick-off-5-4-million-fund-drive/ \"Anthony Hopkins to kick off $5.4 million fund drive\"]. Arbiter. Retrieved 4 January 2015\n\nHopkins contributed toward the refurbishment of a £2.3 million wing at his alma mater, the Royal Welsh College of Music & Drama in Cardiff, named the Anthony Hopkins Centre. It opened in 1999.[https://www.independent.co.uk/student/into-university/az-uni-colleges/royal-welsh-college-of-music-and-drama-459044.html \"Royal Welsh College of Music & Drama\"], Independent.co.uk. Retrieved 24 December 2013.\n\nHopkins is a prominent member of environmental protection group Greenpeace and as of early 2008 featured in a television advertisement campaign, voicing concerns about Japan's continuing annual whale hunt. He has also been a patron of RAPt (Rehabilitation for Addicted Prisoners Trust) since its early days and helped open their first intensive drug and alcohol rehabilitation unit at Downview (HM Prison) in 1992.\n\nHopkins is an admirer of the Welsh comedian Tommy Cooper. On 23 February 2008, as patron of the Tommy Cooper Society, he unveiled a commemorative statue in the entertainer's home town of Caerphilly. For the ceremony, he donned Cooper's trademark fez and performed a comic routine.\n\nOther work\n\nIn a 2012 interview, Hopkins stated, \"I've been composing music all my life and if I'd been clever enough at school I would like to have gone to music college. As it was I had to settle for being an actor.\" In 1986, he released a single called \"Distant Star\", which peaked at No. 75 in the UK Singles Chart. In 2007, he announced he would retire temporarily from the screen to tour around the world. Hopkins has also written music for the concert hall, in collaboration with Stephen Barton as orchestrator. These compositions include The Masque of Time, given its world premiere with the Dallas Symphony Orchestra in October 2008, and Schizoid Salsa.\n\nIn 1990, Hopkins directed a film about his Welsh compatriot, poet Dylan Thomas, titled Dylan Thomas: Return Journey, which was his directing debut for the screen. In the same year, as part of the restoration process for the Stanley Kubrick film Spartacus, Hopkins was approached to re-record lines from a scene that was being added back to the film; this scene featured Laurence Olivier and Tony Curtis, with Hopkins recommended by Olivier's widow, Joan Plowright to perform her late husband's part thanks to his talent for mimicry.\n\nIn 1996, he directed August, an adaptation of Chekhov's Uncle Vanya set in Wales. His first screenplay, an experimental drama called Slipstream, which he also directed and scored, premiered at the Sundance Film Festival in 2007. In 1997, Hopkins narrated the BBC natural documentary series, Killing for a Living, which showed predatory behaviour in nature. He narrated episode 1 through 3 before being replaced by John Shrapnel.\n\nHopkins is a fan of the BBC sitcom Only Fools and Horses, and once remarked in an interview how he would love to appear in the series. Writer John Sullivan saw the interview, and with Hopkins in mind created the character Danny Driscoll, a local villain. However, filming of the new series coincided with the filming of The Silence of the Lambs, making Hopkins unavailable. The role instead went to Roy Marsden.\n\nOn 31 October 2011, André Rieu released an album including a waltz which Hopkins had composed in 1964, at the age of 26. Hopkins had never heard his composition, \"And the Waltz Goes On\", before it was premiered by Rieu's orchestra in Vienna; Rieu's album was given the same name as Hopkins' piece.\n\nIn January 2012, Hopkins released an album of classical music, entitled Composer, performed by the City of Birmingham Symphony Orchestra, and released on CD via the UK radio station Classic FM. The album consists of nine of his original works and film scores, with one of the pieces titled \"Margam\" in tribute to his home town near Port Talbot in Wales.\n\nIn October 2015, Hopkins appeared as Sir in a BBC Two production of Ronald Harwood's The Dresser, alongside Ian McKellen, Edward Fox and Emily Watson. The Dresser is set in a London theatre during the Blitz, where an aging actor-manager, Sir, prepares for his starring role in King Lear with the help of his devoted dresser, Norman. Hopkins described his role as Sir as “the highlight of my life”. “It was a chance to work with the actors I had run away from. To play another actor is fun because you know the ins and outs of their thinking – especially with someone like Sir, who is a diabolically insecure, egotistical man.\"\n\nFilmography\n\nAwards and nominations. Anthony Hopkins. http://en.wikipedia.org/?curid=2397."
  }
}
