{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16125",
  "eid" : "23de7d00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778569424,
  "textBody" : "John the Baptist (, https://st-takla.org/Full-Free-Coptic-Books/FreeCopticBooks-002-Holy-Arabic-Bible-Dictionary/28_E/E_291.html, , Ioánnes (h)o baptistés or Ἰωάννης ὁ βαπτίζων, Ioánnes (h)o baptízon,Lang, Bernhard (2009) International Review of Biblical Studies Brill Academic Pub  p. 380 – \"33/34 CE Herod Antipas's marriage to Herodias (and beginning of the ministry of Jesus in a sabbatical year); 35 CE – death of John the Baptist\" ) known as the prophet Yahya in the Quran, as well as John the Baptizer, and John the Forerunner in Eastern Christianity, was a Jewish itinerant preacherCross, F. L. (ed.) (2005) Oxford Dictionary of the Christian Church, 3rd ed. Oxford University Press , article \"John the Baptist, St\" in the early first century AD. John is revered as a major religious figureFunk, Robert W. & the Jesus Seminar (1998). The Acts of Jesus: the search for the authentic deeds of Jesus. San Francisco: Harper; \"John the Baptist\" cameo, p. 268 in Christianity, Islam, the Bahá'í Faith, and Mandaeism. He is called a prophet by all of these traditions, and is honored as a saint in many Christian traditions.\n\nJohn used baptism as the central symbol or sacramentEdward Oliver James, Sacrament in Encyclopædia Britannica. Retrieved May 20, 2009, from Encyclopædia Britannica Online: http://www.britannica.com/EBchecked/topic/515366/sacrament of his messianic movement. Most scholars agree that John baptized Jesus.Charles M. Sennott, The body and the blood, Public Affairs Pub, 2003. p 234 [https://www.google.com/search?tbmbks&tbo\n1&q%22most+biblical+historians+agree+indicates+that+John%22+%22waded+into+the+water+with+Jesus+from+the+eastern%22+bank&btnG\nSearch+Books Google Link]\nJesus as a figure in history: how modern historians view the man from Galilee. Mark Allan Powell, published by Westminster John Knox Press, p. 47 [https://www.google.com/search?qFew+would+doubt+the+basic+fact+Jesus+was+baptized+by+John&hl\nen&num100&lr\n&fti&cr\n&safeimages&um\n1&ieUTF-8&tbo\nu&tbsbks:1&source\nog&saN&tab\nwp \"Few would doubt the basic fact...Jesus was baptized by John\"] Some scholars believe Jesus was a follower or disciple of John.Sanders, E.P. (1985) Jesus and Judaism. Philadelphia: Fortress Press; p. 91James D. G. Dunn, Jesus Remembered (Eerdmans, 2003) p. 350.Robert L. Webb, 'John the Baptist and his relationship to Jesus', in Bruce David Chilton, Craig Alan Evans, Studying the Historical Jesus:\nEvaluations of the State of Current Research (BRILL, 1998) p. 219. This idea is strongly controverted, however, by John the Baptist's own words in scripture, although several New Testament accounts report that some of Jesus' early followers had previously been followers of John.Harris, Stephen L. (1985) Understanding the Bible. Palo Alto: Mayfield  John the Baptist is also mentioned by the Jewish historian Josephus.Flavius Josephus, Antiquities of the Jews 18.5.2\n Some scholars maintain that John was influenced by the semi-ascetic Essenes, who expected an apocalypse and practiced rituals corresponding strongly with baptism,Harris, Stephen L. (1985) Understanding the Bible. Palo Alto: Mayfield; p. 382 although no direct evidence substantiates this.\n\nAccording to the New Testament, John anticipated a messianic figure greater than himself.Funk, Robert W. & the Jesus Seminar (1998). The Acts of Jesus: the search for the authentic deeds of Jesus.San Francisco: Harper; \"Mark,\" pp. 51–161. Christians commonly refer to John as the precursor or forerunner of Jesus, since John announces Jesus' coming. John is also identified with the prophet Elijah.Stephen L. Harris, Understanding the Bible. Palo Alto: Mayfield. 1985.  \n\nGospel narratives\n\nJohn the Baptist is mentioned in all four canonical Gospels and the non-canonical Gospel of the Nazarenes. The Synoptic Gospels (Mark, Matthew, and Luke) describe John baptising Jesus; in the Gospel of John it is implied in .\n\nIn Mark\n\nThe Gospel of Mark introduces John as a fulfilment of a prophecy from the Book of Isaiah (in fact, a conflation of texts from Isaiah, Malachi and Exodus)Carl R. Kazmierski, John the Baptist: Prophet and Evangelist (Liturgical Press, 1996) p. 31. about a messenger being sent ahead, and a voice crying out in the wilderness. John is described as wearing clothes of camel's hair, living on locusts and wild honey. John proclaims baptism of repentance for the forgiveness of sin, and says another will come after him who will not baptize with water, but with the Holy Spirit.\n\nJesus comes to John, and is baptized by him in the river Jordan. The account describes how; as he emerges from the water, the heavens open and the Holy Spirit descends on him 'like a dove'. A voice from heaven then says, \"You are my Son, the Beloved; with you I am well pleased.\" ()\n\nLater in the gospel there is an account of John's death. It is introduced by an incident where the Tetrarch Herod Antipas, hearing stories about Jesus, imagines that this is John the Baptist raised from the dead. It then explains that John had rebuked Herod for marrying Herodias, the ex-wife of his brother (named here as Philip). Herodias demands his execution, but Herod, who 'liked to listen' to John, is reluctant to do so because he fears him, knowing he is a 'righteous and holy man'.\n\nThe account then describes how Herod's daughter Herodias (NRSV; other translations refer to the girl as the daughter of Herodias) dances before Herod, who is pleased and offers her anything she asks for in return. When the girl asks her mother what she should request, she is told to demand the head of John the Baptist. Reluctantly, Herod orders the beheading of John, and his head is delivered to her, at her request, on a plate. John's disciples take the body away and bury it in a tomb.()\n\nThere are a number of difficulties with this passage. The Gospel wrongly identifies Antipas as 'King'John R. Donahue, Daniel J. Harrington, The Gospel of Mark (Liturgical Press, 2005) p. 195. and the ex-husband of Herodias is named as Philip, but he is known to have been called Herod. Although the wording clearly implies the girl was the daughter of Herodias, many texts describe her as \"Herod's daughter, Herodias\". Since these texts are early and significant and the reading is 'difficult', many scholars see this as the original version, corrected in later versions and in Matthew and Luke.Geoff R. Webb, Mark at the Threshold: Applying Bakhtinian Categories to Markan Characterisation, (BRILL, 2008) pp 110–11.John R. Donahue, Daniel J. Harrington, The Gospel of Mark (Liturgical Press, 2005) p. 198. Josephus says that Herodias had a daughter by the name of Salome.\n\nScholars have speculated about the origins of the story. Since it shows signs of having been composed in Aramaic, which Mark apparently did not speak, he is likely to have got it from a Palestinian source.Florence Morgan Gillman, Herodias: At Home in that Fox's Den (Liturgical Press, 2003) p. 80. There is a variety of opinions about how much actual historical material it contains, especially given the alleged factual errors.Florence Morgan Gillman, Herodias: At Home in that Fox's Den (Liturgical Press, 2003) pp. 81–83. Many scholars have seen the story of John arrested, executed, and buried in a tomb as a conscious foreshadowing of the fate of Jesus.Geoff R. Webb, Mark at the Threshold: Applying Bakhtinian Categories to Markan Characterisation, (Brill, 2008) p. 107.\n\n; John and his baptism of Jesus (Mark 1)\nAs it is written in Isaiah the prophet,\n\"Behold, I send my messenger before your face,\nwho will prepare your way,\nthe voice of one crying in the wilderness:\n‘Prepare the way of the Lord,\nmake his paths straight,’\"\n\nJohn appeared, baptizing in the wilderness and proclaiming a baptism of repentance for the forgiveness of sins. And all the country of Judea and all Jerusalem were going out to him and were being baptized by him in the river Jordan, confessing their sins. Now John was clothed with camel’s hair and wore a leather belt around his waist and ate locusts and wild honey. And he preached, saying, \"After me comes he who is mightier than I, the strap of whose sandals I am not worthy to stoop down and untie. I have baptized you with water, but he will baptize you with the Holy Spirit.\"\n\nIn those days Jesus came from Nazareth of Galilee and was baptized by John in the Jordan. And when he came up out of the water, immediately he saw the heavens being torn open and the Spirit descending on him like a dove. And a voice came from heaven, \"You are my beloved Son, with you I am well pleased.\"\n\n; Death of John (Mark 6)\n\nKing Herod heard of it, for Jesus’ name had become known. Some said, \"John the Baptist has been raised from the dead. That is why these miraculous powers are at work in him.\" But others said, \"He is Elijah.\" And others said, \"He is a prophet, like one of the prophets of old.\" But when Herod heard of it, he said, \"John, whom I beheaded, has been raised.\" For it was Herod who had sent and seized John and bound him in prison for the sake of Herodias, his brother Philip’s wife, because he had married her. For John had been saying to Herod, \"It is not lawful for you to have your brother’s wife.\" And Herodias had a grudge against him and wanted to put him to death. But she could not, for Herod feared John, knowing that he was a righteous and holy man, and he kept him safe. When he heard him, he was greatly perplexed, and yet he heard him gladly.\n\nBut an opportunity came when Herod on his birthday gave a banquet for his nobles and military commanders and the leading men of Galilee. For when Herodias’s daughter came in and danced, she pleased Herod and his guests. And the king said to the girl, \"Ask me for whatever you wish, and I will give it to you.\" And he vowed to her, \"Whatever you ask me, I will give you, up to half of my kingdom.\" And she went out and said to her mother, \"For what should I ask?\" And she said, \"The head of John the Baptist.\" And she came in immediately with haste to the king and asked, saying, \"I want you to give me at once the head of John the Baptist on a platter.\" And the king was exceedingly sorry, but because of his oaths and his guests he did not want to break his word to her. And immediately the king sent an executioner with orders to bring John’s head. He went and beheaded him in the prison and brought his head on a platter and gave it to the girl, and the girl gave it to her mother. When his disciples heard of it, they came and took his body and laid it in a tomb.\n\n(English Standard Version)\n\nIn Matthew\n\nThe Gospel of Matthew account begins with the same modified quotation from Isaiah, moving the Malachi and Exodus material to later in the text, where it is quoted by Jesus. The description of John is taken directly from Mark (\"clothing of camel’s hair with a leather belt around his waist, and his food was locusts and wild honey\"), along with the proclamation that one was coming who would baptise with the Holy Spirit \"and fire\".()\n\nUnlike Mark, Matthew describes John as critical of Pharisees and Sadducees and as preaching \"the kingdom of heaven is at hand\" and a \"coming judgment\".\n\nMatthew shortens the account of the beheading of John, and adds two elements: that Herod Antipas wants John dead, and that the death is reported to Jesus by his disciples. Matthew's approach is to shift the focus away from Herod and onto John as a prototype of Jesus. Where Mark has Herod killing John reluctantly and at Herodias' insistence, Matthew describes him as wanting John dead.Robert Horton Gundry, Matthew: A Commentary on His Handbook for a Mixed Church Under Persecution (Eerdmans, 1994) p. 286.\n\n; John and his baptism of Jesus (Matthew 3)\nIn those days John the Baptist came preaching in the wilderness of Judea, \"Repent, for the kingdom of heaven is at hand.\" For this is he who was spoken of by the prophet Isaiah when he said,\n\n\"The voice of one crying in the wilderness:\n‘Prepare the way of the Lord;\nmake his paths straight.’\"\n\nNow John wore a garment of camel’s hair and a leather belt around his waist, and his food was locusts and wild honey. Then Jerusalem and all Judea and all the region about the Jordan were going out to him, and they were baptized by him in the river Jordan, confessing their sins.\n\nBut when he saw many of the Pharisees and Sadducees coming to his baptism, he said to them, \"You brood of vipers! Who warned you to flee from the wrath to come? Bear fruit in keeping with repentance. And do not presume to say to yourselves, ‘We have Abraham as our father,’ for I tell you, God is able from these stones to raise up children for Abraham. Even now the axe is laid to the root of the trees. Every tree therefore that does not bear good fruit is cut down and thrown into the fire.\n\n\"I baptize you with water for repentance, but he who is coming after me is mightier than I, whose sandals I am not worthy to carry. He will baptize you with the Holy Spirit and fire. His winnowing fork is in his hand, and he will clear his threshing floor and gather his wheat into the barn, but the chaff he will burn with unquenchable fire.\"\n\nThen Jesus came from Galilee to the Jordan to John, to be baptized by him. John would have prevented him, saying, \"I need to be baptized by you, and do you come to me?\" But Jesus answered him, \"Let it be so now, for thus it is fitting for us to fulfill all righteousness.\" Then he consented. And when Jesus was baptized, immediately he went up from the water, and behold, the heavens were opened to him, and he saw the Spirit of God descending like a dove and coming to rest on him; and behold, a voice from heaven said, \"This is my beloved Son, with whom I am well pleased.\"\n\n; John questions Jesus (Matthew 11)\n\nNow when John heard in prison about the deeds of the Christ, he sent word by his disciples and said to him, \"Are you the one who is to come, or shall we look for another?\" And Jesus answered them, \"Go and tell John what you hear and see: the blind receive their sight and the lame walk, lepers are cleansed and the deaf hear, and the dead are raised up, and the poor have good news preached to them. And blessed is the one who is not offended by me.\"\n\nAs they went away, Jesus began to speak to the crowds concerning John: \"What did you go out into the wilderness to see? A reed shaken by the wind? What then did you go out to see? A man dressed in soft clothing? Behold, those who wear soft clothing are in kings’ houses. What then did you go out to see? A prophet? Yes, I tell you, and more than a prophet. This is he of whom it is written,\n\n\"‘Behold, I send my messenger before your face,\nwho will prepare your way before you.’\n\nTruly, I say to you, among those born of women there has arisen no one greater than John the Baptist. Yet the one who is least in the kingdom of heaven is greater than he. From the days of John the Baptist until now the kingdom of heaven has suffered violence, and the violent take it by force. For all the Prophets and the Law prophesied until John, and if you are willing to accept it, he is Elijah who is to come. He who has ears to hear, let him hear.\n\n\"But to what shall I compare this generation? It is like children sitting in the marketplaces and calling to their playmates,\n\n\"‘We played the flute for you, and you did not dance;\nwe sang a dirge, and you did not mourn.’\n\nFor John came neither eating nor drinking, and they say, ‘He has a demon.’ The Son of Man came eating and drinking, and they say, ‘Look at him! A glutton and a drunkard, a friend of tax collectors and sinners!’ Yet wisdom is justified by her deeds.\"\n\n; Death of John (Matthew 14)\n\nAt that time Herod the tetrarch heard about the fame of Jesus, and he said to his servants, \"This is John the Baptist. He has been raised from the dead; that is why these miraculous powers are at work in him.\" For Herod had seized John and bound him and put him in prison for the sake of Herodias, his brother Philip’s wife, because John had been saying to him, \"It is not lawful for you to have her.\" And though he wanted to put him to death, he feared the people, because they held him to be a prophet. But when Herod’s birthday came, the daughter of Herodias danced before the company and pleased Herod, so that he promised with an oath to give her whatever she might ask. Prompted by her mother, she said, \"Give me the head of John the Baptist here on a platter.\" And the king was sorry, but because of his oaths and his guests he commanded it to be given. He sent and had John beheaded in the prison, and his head was brought on a platter and given to the girl, and she brought it to her mother. And his disciples came and took the body and buried it, and they went and told Jesus.\n\n(English Standard Version)\n\nIn Luke and Acts\n\nThe Gospel of Luke adds an account of John's infancy, introducing him as the miraculous son of Zechariah, an old man, and his wife Elizabeth, who was past the  menopause and therefore unable to have children.Libby Ahluwalia, Understanding Philosophy of Religion (Folens, 2008), p. 180.Just, Arthur A.; Oden, Thomas C. (2003), [https://books.google.com/books?idGh6sFDUfq8cC&pg\nPA10#vonepage&q\n%22barrenness%20and%20virginity%22&ffalse Ancient Christian Commentary on Scripture – Luke: New Testament III], InterVarsity Press; p. 10.   According to this account, the birth of John was foretold by the angel Gabriel to Zechariah, while he was performing his functions as a priest in the temple of Jerusalem. Since he is described as a priest of the course of Abijah and Elizabeth as one of the daughters of Aaron, this would make John a descendant of Aaron on both his father's and mother's side.'Aaron', In: Mills, Watson E. (ed.) (1998) Mercer Dictionary of the Bible, Vol. 5, Macon GA: Mercer University Press, ; p. 1 On the basis of this account, the Catholic as well as the Anglican and Lutheran liturgical calendars placed the feast of the Nativity of John the Baptist on June 24, six months before Christmas.\n\nElizabeth is described as a \"relative\" of Mary, the mother of Jesus in .  There is no mention of a family relationship between John and Jesus in the other Gospels, and Raymond E. Brown has described it as \"of dubious historicity\".Brown, Raymond Edward (1973), The Virginal Conception and Bodily Resurrection of Jesus, Paulist Press, p. 54 Géza Vermes has called it \"artificial and undoubtedly Luke's creation\".Vermes, Geza. The Nativity, p. 143. The many similarities between the Gospel of Luke story of the birth of John and the Old Testament account of the birth of Samuel suggest that Luke's account of the annunciation and birth of Jesus are modeled on that of Samuel.Freed, Edwin D. (2001), The Stories of Jesus' Birth: a Critical Introduction Continuum International, pp. 87–90.\n\n; Post-nativity\n\nUnique to the Gospel of Luke, John the Baptist explicitly teaches charity, baptizes tax-collectors, and advises soldiers.\n\nThe text briefly mentions that John is imprisoned and later beheaded by Herod, but the Gospel of Luke lacks the story of a step-daughter dancing for Herod and requesting John's head.\n\nThe Book of Acts portrays some disciples of John becoming followers of Jesus  a development not reported by the gospels except for the early case of Andrew, Simon Peter's brother \n\n; Nativity of John (Luke 1)\nIn the reign of Herod, king of Judea, there was a priest named Zechariah, who belonged to the division called after Abijah. His wife, whose name was Elizabeth, was also a descendant of Aaron. They were both righteous people, who lived blameless lives, guiding their steps by all the commandments and ordinances of the Lord. But they had no child, Elizabeth being barren; and both of them were advanced in years.\n\nOne day, when Zechariah was officiating as priest before God, during the turn of his division, it fell to him by lot, in accordance with the practice among the priests, to go into the Temple of the Lord and burn incense; and, as it was the Hour of Incense, the people were all praying outside. And an angel of the Lord appeared to him, standing on the right of the Altar of Incense. Zechariah was startled at the sight and was awe-struck. But the angel said to him: \"Do not be afraid, Zechariah; your prayer has been heard, and your wife Elizabeth will bear you a son, whom you will call by the name John. He will be to you a joy and a delight; and many will rejoice over his birth. For he will be great in the sight of the Lord; he will not drink any wine or strong drink, and he will be filled with the Holy Spirit from the very hour of his birth, and will reconcile many of the Israelites to the Lord their God. He will go before him in the spirit and with the power of Elijah, ‘to reconcile fathers to their children’ and the disobedient to the wisdom of the righteous, and so make ready for the Lord a people prepared for him.\"\n\n\"How can I be sure of this?\" Zechariah asked the angel. \"For I am an old man and my wife is advanced in years.\"\n\n\"I am Gabriel,\" the angel answered, \"who stand in the presence of God, and I have been sent to speak to you and to bring you this good news. And now you will be silent and unable to speak until the day when this takes place, because you did not believe what I said, though my words will be fulfilled in due course.\"\n\nMeanwhile, the people were watching for Zechariah, wondering at his remaining so long in the Temple. When he came out, he was unable to speak to them, and they perceived that he had seen a vision there. But Zechariah kept making signs to them, and remained dumb. And, as soon as his term of service was finished, he returned home. After this his wife, Elizabeth, became pregnant and lived in seclusion for five months. \"The Lord has done this for me,\" she said, \"he has shown me kindness and taken away the public disgrace of childlessness under which I have been living.\"\n\nSix months later the angel Gabriel was sent from God to a town in Galilee called Nazareth, to a maiden there who was engaged to a man named Joseph, a descendant of David. Her name was Mary. Gabriel came into her presence and greeted her, saying: \"You have been shown great favor – the Lord is with you.\"\n\nMary was much disturbed at his words, and was wondering to herself what such a greeting could mean, when the angel spoke again: \"Do not be afraid, Mary, for you have found favor with God. And now, you will conceive and give birth to a son, and you will give him the name Jesus. The child will be great and will be called ‘Son of the Most High,’ and the Lord God will give him the throne of his ancestor David, and he will reign over the descendants of Jacob for ever; And to his kingdom there will be no end.\"\n\n\"How can this be?\" Mary asked the angel. \"For I have no husband.\"\n\n\"The Holy Spirit will descend on you,\" answered the angel, \"and the Power of the Most High will overshadow you; and therefore the child will be called ‘holy,’ and ‘Son of God.’ And Elizabeth, your cousin, is herself also expecting a son in her old age; and it is now the sixth month with her, though she is called barren; for no promise from God will fail to be fulfilled.\"\n\n\"I am the servant of the Lord,\" exclaimed Mary; \"let it be with me as you have said.\" Then the angel left her.\n\nSoon after this Mary set out, and made her way quickly into the hill-country, to a town in Judah; and there she went into Zechariah’s house and greeted Elizabeth. When Elizabeth heard Mary’s greeting, the child moved within her, and Elizabeth herself was filled with the Holy Spirit, and cried aloud: \"Blessed are you among women, and blessed is your unborn child! But how have I this honor, that the mother of my Lord should come to me? For, as soon as your greeting reached my ears, the child moved within me with delight! Happy indeed is she who believed that the promise which she received from the Lord would be fulfilled.\"\n\nAnd Mary said:\n\n\"My soul exalts the Lord,\nmy spirit delights in God my Savior;\nfor he has remembered his humble servant girl;\nAnd from this hour all ages will count me happy!\n\nGreat things has the Almighty done for me;\nAnd holy is his name.\nFrom age to age his mercy rests\nOn those who honor him.\n\nMighty are the deeds of his arm;\nHe scatters the proud with their own devices,\nhe casts down princes from their thrones,\nand the humble he uplifts,\nthe hungry he loads with gifts,\nand the rich he sends empty away.\n\nHe has stretched out his hand to his servant Israel,\nEver mindful of his mercy\n(As he promised to our forefathers)\nFor Abraham and his race for ever.\"\n\nMary stayed with Elizabeth about three months, and then returned to her home. When Elizabeth’s time came, she gave birth to a son; and her neighbors and relations, hearing of the great goodness of the Lord to her, came to share her joy. A week later they met to circumcise the child, and were about to call him ‘Zechariah’ after his father, when his mother spoke up: \"No, he is to be called John.\"\n\n\"You have no relation of that name!\" they exclaimed; and they made signs to the child’s father, to find out what he wished the child to be called. Asking for a writing-tablet, he wrote the words – ‘His name is John.’ Everyone was surprised; and immediately Zechariah recovered his voice and the use of his tongue, and began to bless God. All their neighbors were awe-struck at this; and throughout the hill-country of Judea the whole story was much talked about; and all who heard it kept it in mind, asking one another – \"What can this child be destined to become?\" For the Power of the Lord was with him.\n\nThen his father Zechariah was filled with the Holy Spirit, and, speaking under inspiration, said:\n\n\"Blessed is the Lord, the God of Israel,\nWho has visited his people and wrought their deliverance,\nand has raised up for us the Strength of our salvation\nIn the house of his servant David –\n\nAs he promised by the lips of his holy prophets of old –\nsalvation from our enemies and from the hands of all who hate us,\nshowing mercy to our forefathers,\nAnd mindful of his sacred covenant.\n\nThis was the oath which he swore to our forefather Abraham –\nThat we should be rescued from the hands of our enemies,\nand should serve him without fear in holiness and righteousness,\nIn his presence all our days.\n\nAnd you, child, will be called prophet of the Most High,\nFor you will go before the Lord to make ready his way,\nto give his people the knowledge of salvation\nIn the forgiveness of their sins,\n\nthrough the tender mercy of our God,\nWhereby the Dawn will break on us from heaven,\nto give light to those who live in darkness and the shadow of death,\nAnd guide our feet into the way of peace.\"\n\nThe child grew and became strong in spirit; and he lived in the Wilds until the time came for his appearance before Israel.\n\n; John and his baptism of Jesus, Imprisonment of John (Luke 3)\n\nIn the fifteenth year of the reign of the Emperor Tiberius, when Pontius Pilate was Governor of Judea, Herod Ruler of Galilee, his brother Philip Ruler of the territory comprising Ituraea and Trachonitis, and Lysanias Ruler of Abilene, and when Annas and Caiaphas were high priests, a command from God came to John, the son of Zechariah, while he was in the wilderness. And John went through the whole district of the Jordan, proclaiming baptism on repentance, for the forgiveness of sins. This was in fulfillment of what is said in the writings of the prophet Isaiah –\n\n‘The voice of one crying aloud in the wilderness:\n\"Make ready the way of the Lord,\nMake his paths straight.\nEvery chasm will be filled,\nEvery mountain and hill will be leveled,\nThe winding ways will be straightened,\nThe rough roads made smooth,\nand everyone will see the salvation of God.\"’\n\nAnd John said to the crowds that went to be baptized by him: \"You children of snakes! Who has prompted you to seek refuge from the coming judgment? Let your lives, then, prove your repentance; and do not begin to say among yourselves ‘Abraham is our ancestor,’ for I tell you that out of these stones God is able to raise descendants for Abraham! Already, indeed, the axe is lying at the root of the trees. Therefore, every tree that fails to bear good fruit will be cut down and thrown into the fire.\"\n\n\"What are we to do then?\" the people asked. \"Let anyone who has two coats,\" answered John, \"share with the person who has none; and anyone who has food do the same.\"\n\nEven tax-gatherers came to be baptized, and said to John: \"Teacher, what are we to do?\"\n\n\"Do not collect more than you have authority to demand,\" John answered. And when some soldiers on active service asked \"And we – what are we to do?\" he said: \"Never use violence, or exact anything by false accusation; and be content with your pay.\"\n\nThen, while the people were in suspense, and were all debating with themselves whether John could be the Christ, John, addressing them all, said: \"I, indeed, baptize you with water; but there is coming one more powerful than I, and I am not fit even to unfasten his sandals. He will baptize you with the Holy Spirit and with fire. His winnowing-fan is in his hand so that he may clear his threshing-floor, and store the grain in his barn, but the chaff he will burn with a fire that cannot be put out.\"\n\nAnd so with many different appeals John told his good news to the people. But Prince Herod, being rebuked by John respecting Herodias, the wife of Herod’s brother, and for all the evil things that he had done,  crowned them all by shutting John up in prison. Now after the baptism of all the people, and when Jesus had been baptized and was still praying, the heavens opened,  and the Holy Spirit came down on him in the form of a dove, and from the heavens came a voice – \"You are my dearly loved son; you bring me great joy.\"\n\n; John's disciples and fast (Luke 5:33)\n\"John’s disciples,\" they said to Jesus, \"Often fast and say prayers, and so do the disciples of the Pharisees, while yours are eating and drinking!\"\n\n; John questions Jesus (Luke 7)\nAll these events were reported to John by his disciples. So he summoned two of them, and sent them to the Master to ask – \"Are you ‘the coming one,’ or are we to look for some one else?\"\n\nWhen these men found Jesus, they said: \"John the Baptist has sent us to you to ask – ‘Are you ‘the coming one,’ or are we to look for somebody else?’\" At that very time Jesus had cured many people of diseases, afflictions, and wicked spirits, and had given many blind people their sight. So his answer to the question was: \"Go and report to John what you have witnessed and heard – the blind recover their sight, the lame walk, the lepers are made clean, and the deaf hear, the dead are raised to life, the good news is told to the poor. And blessed is the person who finds no hindrance in me.\"\n\nWhen John’s messengers had left, Jesus, speaking to the crowds, began to say with reference to John: \"What did you go out into the wilderness to look at? A reed waving in the wind? If not, what did you go out to see? A man dressed in rich clothing? Why, those who are accustomed to fine clothes and luxury live in royal palaces. What then did you go to see? A prophet? Yes, I tell you, and far more than a prophet. This is the man of whom scripture says –\n\n‘I am sending my messenger ahead of you,\nand he will prepare your way before you.’\n\nThere is, I tell you, no one born of a woman who is greater than John; and yet the least in the kingdom of God is greater than he.\"\n\n(All the people, when they heard this, and even the tax-gatherers, having accepted John’s baptism, acknowledged the justice of God. But the Pharisees and the students of the law, having rejected John’s baptism, frustrated God’s purpose in regard to them.)\n\nIn the Gospel of John\n\nThe fourth gospel describes John the Baptist as \"a man sent from God\" who \"was not the light\", but \"came as a witness, to bear witness to the light, so that through him everyone might believe\". John clearly denies being the Christ or Elijah or 'the prophet', instead describing himself as the \"voice of one crying in the wilderness\"., compare \n\nUpon literary analysis, it is clear that John is the \"testifier and confessor par excellence\", particularly when compared to figures like Nicodemus.\n\nJesus's baptism is implied but not depicted. Unlike the other gospels, it is John himself who testifies to seeing \"the Spirit come down from heaven like a dove and rest on him\". John explicitly announces that Jesus is the one \"who baptizes with the Holy Spirit\" and John even professes a \"belief that he is the Son of God\" and \"the Lamb of God\".\n\nThe Gospel of John reports that Jesus' disciples were baptizing and that a debate broke out between some of the disciples of John and another Jew about purification. In this debate John argued that Jesus \"must become greater,\" while he (John) \"must become less\" (Latin Vulgate: ).\n\nThe Gospel of John then points out that Jesus' disciples were baptizing more people than John. Later, the Gospel relates that Jesus regarded John as \"a burning and shining lamp, and you were willing to rejoice for a while in his light\".\n\n; John 1\nThere appeared a man sent from God, whose name was John; he came as a witness – to bear witness to the light so that through him everyone might believe. He was not the light, but he came to bear witness to the light.\n\nWhen the religious authorities in Jerusalem sent some Priests and Levites to ask John – \"Who are you?\", he told them clearly and simply: \"I am not the Christ.\"\n\n\"What then?\" they asked. \"Are you Elijah?\"\n\"No,\" he said, \"I am not.\"\n\"Are you ‘the prophet’?\" He answered, \"No.\"\n\"Who then are you?\" they continued; \"tell us so that we have an answer to give to those who have sent us. What do you say about yourself?\"\n\"I,\" he answered, \"am – ‘The voice of one crying aloud in the wilderness – \"make a straight road for the Lord\"’, as the prophet Isaiah said.\"\nThese men had been sent from the Pharisees; and their next question was: \"Why then do you baptize, if you are not the Christ or Elijah or ‘the prophet’?\" John’s answer was – \"I baptize with water, but among you stands one whom you do not know; he is coming after me, yet I am not worthy even to unfasten his sandal.\" This happened at Bethany, across the Jordan, where John was baptizing.\n\nThe next day John saw Jesus coming towards him, and exclaimed: \"Here is the Lamb of God, who takes away the sin of the world! I was taking about him when I said ‘After me there is coming a man who ranks ahead of me, because before I was born he already was.’ I did not know who he was, but I have come baptizing with water to make him known to Israel.\"\n\nJohn also said: \"I saw the Spirit come down from heaven like a dove and rest on him. I myself did not know him, but he who sent me to baptize with water, he said to me ‘He on whom you see the Spirit descending, and remaining on him – he it is who baptizes with the Holy Spirit.’ This I have seen myself, and I have declared my belief that he is the Son of God.\" The next day, when John was standing with two of his disciples, he looked at Jesus as he passed and exclaimed: \"There is the Lamb of God!\" The two disciples heard him say this, and followed Jesus.\n\n; John 3\nJohn, also, was baptizing at Aenon near Salim, because there were many streams there; and people were constantly coming and being baptized. (For John had not yet been imprisoned). Now a discussion arose between some of John’s disciples and a fellow Jew on the subject of ‘purification;’ and the disciples came to John and said: \"Rabbi, the man who was with you on the other side of the Jordan, and to whom you have yourself borne testimony – he, also, is baptizing, and everybody is going to him.\" John’s answer was – \"A person can gain nothing but what is given them from heaven. You are yourselves witnesses that I said ‘I am not the Christ,’ but ‘I have been sent before him as a messenger.’ It is the groom who has the bride; but the groom’s friend, who stands by and listens to him, is filled with joy when he hears the groom’s voice. This joy I have felt to the full. He must become greater, and I less.\"\n\nHe who comes from above is above all others; but a child of earth is earthly, and his teaching is earthly, too. He who comes from heaven is above all others. He states what he has seen and what he heard, and yet no one accepts his statement. They who did accept his statement confirm the fact that God is true. For he whom God sent as his messenger gives us God’s own teaching, for God does not limit the gift of the Spirit. The Father loves his Son, and has put everything in his hands. The person who believes in the Son has eternal life, while a person who rejects the Son will not even see that life, but remains under ‘God’s displeasure.’\n\nComparative analysis\n\n; The prophecy of Isaiah\n\nAlthough Mark's Gospel implies that the arrival of John the Baptist is the fulfilment of a prophecy from the Book of Isaiah, the words quoted (\"I will send my messenger ahead of you, who will prepare your way – a voice of one calling in the wilderness, ‘Prepare the way for the Lord, make straight paths for him.’\") are actually a composite of texts from Isaiah, Malachi and the Book of Exodus. (Matthew and Luke drop the first part of the reference.)\n\n; Baptism of Jesus\n\nThe gospels differ on the details of the Baptism. In Mark and Luke, Jesus himself sees the heavens open and hears a voice address him personally, saying, \"You are my dearly loved son; you bring me great joy\". They do not clarify whether others saw and heard these things. Although other incidents where the \"voice came out of heaven\" are recorded in which, for the sake of the crowds, it was heard audibly, John did say in his witness that he did see the spirit coming down \"out of heaven\". John 12:28–30, John 1:32\n\nIn Matthew, the voice from heaven does not address Jesus personally, saying instead \"This is my beloved son, in whom I am well pleased.\"\n\nIn the Gospel of John, John the Baptist himself sees the spirit descend as a dove, testifying about the experience as evidence of Jesus's status.\n\n; John's knowledge of Jesus\n\nJohn's knowledge of Jesus varies across gospels. In the Gospel of Mark, John preaches of a coming leader, but shows no signs of recognizing that Jesus is this leader. In Matthew, however, John immediately recognizes Jesus and John questions his own worthiness to baptize Jesus. In both Matthew and Luke, John later dispatches disciples to question Jesus about his status, asking \"Are you he who is to come, or shall we look for another?\"\nIn Luke, John is a familial relative of Jesus whose birth was foretold by Gabriel.\nIn the Gospel of John, John the Baptist himself sees the spirit descend like a dove and he explicitly preaches that Jesus is the Son of God.\n\n; John and Elijah\n\nThe Gospels vary in their depiction of John's relationship to Elijah. Matthew and Mark describe John's attire in a way reminiscent of the description of Elijah in 2 Kings 1:8, who also wore a garment of hair and a leather belt. In Matthew, Jesus explicitly teaches that John is \"Elijah who was to come\" (Matt. 11:14 – see also Matt. 17:11–13); many Christian theologians have taken this to mean that John was Elijah's successor. In the Gospel of John, John the Baptist explicitly denies being Elijah. In the annunciation narrative in Luke, an angel appears to Zechariah, John's father, and tells him that John \"will turn many of the sons of Israel to the Lord their God,\" and that he will go forth \"in the spirit and power of Elijah ().\"\n\nIn Josephus's Antiquities of the Jews\n\nAn account of John the Baptist is found in all extant manuscripts of the Antiquities of the Jews (book 18, chapter 5, 2) by Flavius Josephus (37–100):\"Josephus, Flavius.\" In: Cross, F. L. (ed.) (2005) The Oxford Dictionary of the Christian Church, 3rd ed. Oxford University Press\n\nAccording to this passage, the execution of John was blamed for the defeat Herod suffered. Some have claimed that this passage indicates that John died near the time of the destruction of Herod's army in 36 AD. However, in a different passage, Josephus states that the end of Herod's marriage with Aretas' daughter (after which John was killed) was only the beginning of hostilities between Herod and Aretas, which later escalated into the battle.\n\nDivergences between the passage's presentation and the biblical accounts of John include baptism for those whose souls have already been \"purified beforehand by righteousness\" is for purification of the body, not general repentance of sin (Mark 1:4). Biblical scholar John Dominic Crossan differentiates between Josephus's account of John and Jesus, saying, \"John had a monopoly, but Jesus had a franchise.\" To get baptized, Crossan writes, you went only to John; to stop the movement one only needed to stop John (therefore his movement ended with his death). Jesus invited all to come and see how he and his companions had already accepted the government of God, entered it and were living it. Such a communal praxis was not just for himself, but could survive without him, unlike John's movement.Crossan, John Dominic (2007), God and Empire, London: HarperCollins, p. 117 ff\n\nRelics\n\n records that \"his disciples came and took away [John's] body and buried it\". Theologian Joseph Benson refers to a belief that \"it seems that [the body] had been thrown over the prison walls, without burial, probably by order of Herodias.[http://biblehub.com/commentaries/benson/matthew/14.htm Benson's Commentary] on Matthew 14, accessed 17 Jauuary 2017\n\nThe burial-place of John the Baptist was traditionally said to be at the Nabi Yahya Mosque (Saint John the Baptiste Mosque) in Sebaste in current Palestinian territories, and mention is made of his relics being honored there around the middle of the 4th century. The historians Rufinus and Theodoretus record that the shrine was desecrated under Julian the Apostate around 362, the bones being partly burned. A portion of the rescued relics were carried to Jerusalem, then to Alexandria, where on 27 May 395, they were laid in the basilica newly dedicated to the Forerunner on the former site of the temple of Serapis. The tomb at Sebaste continued, nevertheless, to be visited by pious pilgrims, and Saint Jerome bears witness to miracles being worked there.\n\nWhat became of the head of John the Baptist is difficult to determine. NicephorusNicephorus, Ecclesiastical History I, ix. See Patrologia Graeca, cxlv.–cxlvii. and Symeon Metaphrastes say that Herodias had it buried in the fortress of Machaerus (in accordance with Josephus). Other writers say that it was interred in Herod's palace at Jerusalem; there it was found during the reign of Constantine I, and thence secretly taken to Emesa where it was concealed, the place remaining unknown for years, until it was manifested by revelation in 453. However, the decapitation cloth of Saint John is kept at the Aachen Cathedral. The Coptic Christian Orthodox Church also claim to hold the relics of Saint John the Baptist. These are to be found in a monastery in Lower Egypt between Cairo and Alexandria. It is possible, with permission from the monks, to see the original tomb where the remains were found.\n\n* Several different locations claim to possess the severed head of John the Baptist. The current official place for the Catholic Church is the Shrine of Saint John the Baptiste (Nabi Yahya in Arabic) inside the Umayyad Mosque in Damascus.Lost Worlds: Knights Templar, July 10, 2006 video documentary on The History Channel, directed and written by Stuart Elliott The place was visited by Pope John Paul II in 2001 who \"paused for a minute's silent meditation at the tomb of St John the Baptist\". Previous to that the catholic Church used to believe that it was kept in the San Silvestro in Capite in Rome; and then that it was held by the Knights Templar at Amiens Cathedral in France (brought home by Wallon de Sarton from the Fourth Crusade in Constantinople), at Antioch in Turkey (fate uncertain). Other traditions assume that it was in Residenz Museum in Munich, Germany (official residence of the Wittelsbach rulers of Bavaria from 1385 to 1918). or even the parish church at Tenterden in Kent, where it was preserved up until the Reformation.\n\n* The saint's right hand, with which he baptised Jesus, is claimed to be in the Serbian Orthodox Cetinje monastery in Montenegro; Topkapi Palace in Istanbul; and also in the Romanian skete of the Forerunner on Mount Athos. The saint's left hand is allegedly preserved in the Armenian Apostolic Church of St. John at Chinsurah, West Bengal, where each year on \"Chinsurah Day\" in January it blesses the Armenian Christians of Calcutta. A crypt and relics said to be John's and mentioned in 11th- and 16th-century manuscripts, were discovered in 1969 during restoration of the Church of St. Macarius at the Monastery of Saint Macarius the Great in Scetes, Egypt; Additional relics are claimed to reside in Gandzasar Monastery's Cathedral of St. John the Baptist, in Nagorno Karabakh.\n\nAnother obscure claim relates to the town of Halifax in West Yorkshire, United Kingdom, where, as patron saint of the town, the Baptist's head appears on the official coat-of-arms. One legend (among others) bases the etymology of the town's place-name on \"halig\" (holy) and \"fax\" (face), claiming that a relic of the head, or face, of John the Baptist once existed in the town.\nAlso, in 2010, bones were discovered in the ruins of a Bulgarian church in the St. John the Forerunner Monastery (4th–17th centuries) on the Black Sea island of St. Ivan and two years later, after DNA and radio carbon testing proved the bones belonged to a Middle Eastern man who lived in the 1st century AD, scientists said that the remains could conceivably have belonged to John the Baptist.Moss, Candida. [http://candidamoss.com/national-geographic-search-for-the-head-of-john-the-baptist/ National Geographic: Search for the Head of John the Baptist.] 19 April 2014. The remains, found in a reliquarium are presently kept in the Sts. Cyril and Methodius Cathedral in Sozopol.[http://www.novinite.com/view_news.php?id=132804 Old Town Sozopol – Bulgaria's 'Rescued' Miracle and Its Modern Day Saviors.] Sofia News Agency, October 10, 2011.\n\nReligious views\n\nChristianity\n\nChristians believe that John the Baptist had a specific role ordained by God as forerunner or precursor of Jesus, who was the foretold Messiah. The New Testament Gospels speak of this role. In  the role of John is referred to as being \"to turn the hearts of the fathers to the children, and the disobedient to the wisdom of the just; to make ready a people prepared for the Lord.\" In  as \"...thou shalt go before the face of the Lord to prepare his ways\" and in  as being \"To give knowledge of salvation unto his people by the remission of their sins.\"\n\nThere are several passages within the Old Testament which are interpreted by Christians as being prophetic of John the Baptist in this role. These include a passage in the Book of Malachi () that refers to a prophet who would prepare the way of the Lord:\n\nand also at the end of the next chapter in Malachi 4:5–6 where it says,\n\nThe Jews of Jesus' day expected Elijah to come before the Messiah; indeed, some present day Jews continue to await Elijah's coming as well, as in the Cup of Elijah the Prophet in the Passover Seder. This is why the disciples ask Jesus in , 'Why then say the scribes that Elias must first come?' The disciples are then told by Jesus that Elijah came in the person of John the Baptist,\n\n (see also 11:14: \"...if you are willing to accept it, he is Elijah who was to come.\")\n\nThese passages are applied to John in the Synoptic Gospels.Mat 3:3 For this is he that was spoken of by the prophet Esaias, saying, The voice of one crying in the wilderness, Prepare ye the way of the Lord, make his paths straight.\nMar 1:2 As it is written in the prophets, Behold, I send my messenger before thy face, which shall prepare thy way before thee. Mar 1:3 The voice of one crying in the wilderness, Prepare ye the way of the Lord, make his paths straight.Luk 1:16–17 And many of the children of Israel shall he turn to the Lord their God. And he shall go before him in the spirit and power of Elijah, to turn the hearts of the fathers to the children, and the disobedient to the wisdom of the just; to make ready a people prepared for the Lord. But where Matthew specifically identifies John the Baptist as Elijah's spiritual successor (), the gospels of Mark and Luke are silent on the matter. The Gospel of John states that John the Baptist denied that he was Elijah.\n\nInfluence on Paul\n\nMany scholars believe there was contact between the early church in the Apostolic Age and what is called the \"Qumran-Essene community.\" The Dead Sea Scrolls were found at Qumran, which the majority of historians and archaeologists identify as an Essene settlement.\nJohn the Baptist is thought to have been either an Essene or \"associated\" with the community at Khirbet Qumran. According to the Book of Acts, Paul met some \"disciples of John\" in Ephesus.\n\nDue to influence of Qumranic terminology and ideas in Paul's Epistle to the Ephesians, some scholars believe that the \"disciples\" mentioned in  were disciples of John the Baptist. This view, which assumes that John was an Essene, is debated by scholars. While John the Baptist practiced baptism, the Essenes used ritual washing, also called ablution, as a form of spiritual purification.\n\nCatholic Church\n\nThe Catholic Church commemorates Saint John the Baptist on two feast days:\n* 24 June – Nativity of Saint John the Baptist\n* 29 August – Beheading of Saint John the Baptist\n\nSome Catholics have held to a belief that John the Baptist never sinned, although this has never been a point of doctrine and is not binding in belief upon any adherent as is the sinlessness of Mary. In her Treatise of Prayer, Saint Catherine of Siena includes a brief altercation with the Devil regarding her fight due to the Devil attempting to lure her with vanity and flattery. Speaking in the first person, Catherine responds to the Devil with the following words:\n\nEastern Christianity\n \n\nThe Eastern Catholic Churches and Eastern Orthodox faithful believe that John was the last of the Old Testament prophets, thus serving as a bridge between that period of revelation and the New Covenant. They also teach that, following his death, John descended into Hades and there once more preached that Jesus the Messiah was coming, so he was the Forerunner of Christ in death as he had been in life. Eastern Catholic and Orthodox churches will often have an icon of Saint John the Baptist in a place of honor on the iconostasis, and he is frequently mentioned during the Divine Services. Every Tuesday throughout the year is dedicated to his memory.\n\nThe Eastern Orthodox Church remembers Saint John the Forerunner on six separate feast days, listed here in order in which they occur during the church year (which begins on September 1):\n* 23 September – Conception of Saint John the ForerunnerIn late antiquity this feast in some churches marked the beginning of the Ecclesiastical Year; see Archbishop Peter (L'Huiller) of New York and New Jersey, \"[http://www.orthodoxresearchinstitute.org/articles/liturgics/peter_archbishop_liturgical_matters.htm Liturgical Matters: \"The Lukan Jump\"]\", in: Newspaper of the Diocese of New York and New Jersey, Fall 1992.\n* 7 January – The Synaxis of Saint John the Forerunner. This is his main ml day, immediately after Theophany on January 6 (January 7 also commemorates the transfer of the relic of the right hand of John the Baptist from Antioch to Constantinople in 956)\n* 24 February – First and Second Finding of the Head of Saint John the Forerunner\n* 25 May – Third Finding of the Head of Saint John the Forerunner\n* 24 June – Nativity of Saint John the Forerunner\n* 29 August – The Beheading of Saint John the Forerunner, a day of strict fast and abstinence from meat and dairy products and foods containing meat or dairy products\n\nIn addition to the above, 5 September is the commemoration of Zechariah and Elizabeth, Saint John's parents. The Russian Orthodox Church observes 12 October as the Transfer of the Right Hand of the Forerunner from Malta to Gatchina (1799).\n\nThe Church of Jesus Christ of Latter-day Saints\n\nThe Church of Jesus Christ of Latter-day Saints (LDS Church) teaches that modern revelation confirms the biblical account of John and also makes known additional events in his ministry. According to this belief, John was \"ordained by the angel of God\" when he was eight days old \"to overthrow the kingdom of the Jews\" and to prepare a people for the Lord. Mormons also believe that \"he was baptized while yet in his childhood.\"\n\nJoseph Smith said: \"Let us come into New Testament times – so many are ever praising the Lord and His apostles. We will commence with John the Baptist. When Herod's edict went forth to destroy the young children, John was about six months older than Jesus, and came under this hellish edict, and Zecharias caused his mother to take him into the mountains, where he was raised on locusts and wild honey. When his father refused to disclose his hiding place, and being the officiating high priest at the Temple that year, was slain by Herod's order, between the porch and the altar, as Jesus said.\"\n\nThe LDS Church teaches that John the Baptist appeared on the banks of the Susquehanna River near Harmony Township, Susquehanna County, Pennsylvania as a resurrected being to Joseph Smith and Oliver Cowdery on May 15, 1829, and ordained them to the Aaronic Priesthood.[D&C 13]; D&C 27:7–8Joseph Smith History 1:68–72 According to LDS doctrine, John's ministry has operated in three dispensations: he was the last of the prophets under the law of Moses; he was the first of the New Testament prophets; and he was sent to confirm the Aaronic Priesthood in our day (the dispensation of the fulness of times). Mormons believe John's ministry was foretold by two prophets whose teachings are included in the Book of Mormon: Lehi and his son Nephi.\n\nGnosticism\n\nIn Gnosticism, John the Baptist was a \"personification\" of the Old Testament prophet Elijah. Elijah did not know the True God (as opposed to the Abrahamic God), and thus had to be reincarnated in Gnostic theology. As predicted by the Old Testament prophet Malachi, Elijah must \"come first\" to herald the coming of Jesus Christ. Modern anthroposophy concurs with the idea that the Baptist was a reincarnation of Elijah, (cf. Mark 9:11–13), Matthew 11:13–14, Luke 7:27 although the Gospel of John explicitly denies this (John 1:21).Sergei Prokofieff, The Mystery of John the Baptist and John the Evangelist Turning Point of Time: An Esoteric Study, Temple Lodge Publishing 2005, \n\nSyrian-Egyptian Gnosticism\n\nAmong the early Judeo-Christian Gnostics the Ebionites held that John, along with Jesus and James the Just – all of whom they revered – were vegetarians.J Verheyden, Epiphanius on the Ebionites, in The image of the Judaeo-Christians in ancient Jewish and Christian literature, eds Peter J. Tomson, Doris Lambers-Petry, , p. 188 \"The vegetarianism of John the Baptist and of Jesus is an important issue too in the Ebionite interpretation of the Christian life. \"Robert Eisenman (1997), James the Brother of Jesus, p. 240 – \"John (unlike Jesus) was both a ‘Rechabite’ or ‘Nazarite’ and vegetarian\", p. 264 – \"One suggestion is that John ate 'carobs'; there have been others. Epiphanius, in preserving what he calls 'the Ebionite Gospel', rails against the passage there claiming that John ate 'wild honey' and 'manna-like vegetarian cakes dipped in oil. ... John would have been one of those wilderness-dwelling, vegetable-eating persons\", p. 326 – \"They [the Nazerini] ate nothing but wild fruit milk and honey – probably the same food that John the Baptist also ate.\", p. 367 – \"We have already seen how in some traditions 'carobs' were said to have been the true composition of John's food.\", p. 403 – \"his [John's] diet was stems, roots and fruits. Like James and the other Nazirites/Rechabites, he is presented as a vegetarian ..\".James Tabor, The Jesus Dynasty p. 134 and footnotes p. 335, p. 134 – \"The Greek New Testament gospels says John's diet consisted of \"locusts and wild honey\" but an ancient Hebrew version of Matthew insists that \"locusts\" is a mistake in Greek for a related Hebrew word that means a cake of some type, made from a desert plant, similar to the \"manna\" that the ancient Israelites ate in the desert on the days of Moses.(ref 9) Jesus describes John as \"neither eating nor drinking,\" or \"neither eating bread nor drinking wine.\" Such phrases indicate the lifestyle of one who is strictly vegetarian, avoids even bread since it has to be processed from grain, and shuns all alcohol.(ref 10) The idea is that one would eat only what grows naturally.(ref 11) It was a way of avoiding all refinements of civilization.\" p. 102 – \"Probably the most interesting of the changes from the familiar New Testament accounts of Jesus comes in the Gospel of the Ebionites description of John the Baptist, who, evidently, like his successor Jesus, maintained a strictly vegetarian cuisine.\"James A. Kelhoffer, [https://books.google.com/books?iduzTcB8yMnrcC&printsec\nfrontcover&dqThe+diet+of+John+the+Baptist:+%22Locusts+and+wild+honey%22+in+synoptic+and+patristic+interpretation&source\nbl&ots7qzE9F71rT&sig\nmsJN2Zz51fxsZ79KQoVDvkl4Uos&hlen&ei\nzGCqTf63I43egQf2jqD0BQ&saX&oi\nbook_result&ctresult&resnum\n1&sqi2&ved\n0CBcQ6AEwAA#vonepage&q&f\nfalse The Diet of John the Baptist], , pp. 19–21 p. 104 – \"And when he had been brought to Archelaus and the doctors of the Law had assembled, they asked him who he is and where he has been until then. And to this he made answer and spake: I am pure; [for] the Spirit of God hath led me on, and [I live on] cane and roots and tree-food.\" Epiphanius of Salamis records that this group had amended their Gospel of Matthew, known today as the Gospel of the Ebionites, to change where John eats \"locusts\" to read \"honey cakes\" or \"manna\".Tabor (2006) Jesus Dynasty p. 334 (note 9) – \"The Gospel of the Ebionites as quoted by the 4th-century writer Epiphanius. The Greek word for locusts (akris) is very similar to the Greek word for \"honey cake\" (ekris) that is used for the \"manna\" that the Israelites ate in the desert in the days of Moses (Exodus 16:32)\" & p. 335 (note 11) – \"There is an old Russian (Slavic) version of Josephus's Antiquities that describes John the Baptizer as living on 'roots and fruits of the tree' and insists that he never touches bread, even at Passover.\" p. 13 – Referring to Epiphanius' quotation from the Gospel of the Ebionites in Panarion 30.13, \"And his food, it says, was wild honey whose taste was of manna, as cake in oil\".\n\nMandaeans \n\nJohn the Baptist is considered the chief prophet of the Mandaeans, and plays a large part in some of their writings,Oxford Dictionary of the Christian Church (Oxford University Press 2005 ), article Mandaeans including the Ginza Rba and the Draša D-Iahia (The Mandaean Book of John). They view John as the only true Messiah, and are opposed to Jesus. The Mandaean scriptures state: \"If the carpenter [Jesus] has joined together the god, who then has joined together the carpenter?\"\n\nIslam\n <!-- courtesy noe per WP:RSECT:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "John the Baptist" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16125" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "John the Baptist (, https://st-takla.org/Full-Free-Coptic-Books/FreeCopticBooks-002-Holy-Arabic-Bible-Dictionary/28_E/E_291.html, , Ioánnes (h)o baptistés or Ἰωάννης ὁ βαπτίζων, Ioánnes (h)o baptízon,Lang, Bernhard (2009) International Review of Biblical Studies Brill Academic Pub  p. 380 – \"33/34 CE Herod Antipas's marriage to Herodias (and beginning of the ministry of Jesus in a sabbatical year); 35 CE – death of John the Baptist\" ) known as the prophet Yahya in the Quran, as well as John the Baptizer, and John the Forerunner in Eastern Christianity, was a Jewish itinerant preacherCross, F. L. (ed.) (2005) Oxford Dictionary of the Christian Church, 3rd ed. Oxford University Press , article \"John the Baptist, St\" in the early first century AD. John is revered as a major religious figureFunk, Robert W. & the Jesus Seminar (1998). The Acts of Jesus: the search for the authentic deeds of Jesus. San Francisco: Harper; \"John the Baptist\" cameo, p. 268 in Christianity, Islam, the Bahá'í Faith, and Mandaeism. He is called a prophet by all of these traditions, and is honored as a saint in many Christian traditions.\n\nJohn used baptism as the central symbol or sacramentEdward Oliver James, Sacrament in Encyclopædia Britannica. Retrieved May 20, 2009, from Encyclopædia Britannica Online: http://www.britannica.com/EBchecked/topic/515366/sacrament of his messianic movement. Most scholars agree that John baptized Jesus.Charles M. Sennott, The body and the blood, Public Affairs Pub, 2003. p 234 [https://www.google.com/search?tbmbks&tbo\n1&q%22most+biblical+historians+agree+indicates+that+John%22+%22waded+into+the+water+with+Jesus+from+the+eastern%22+bank&btnG\nSearch+Books Google Link]\nJesus as a figure in history: how modern historians view the man from Galilee. Mark Allan Powell, published by Westminster John Knox Press, p. 47 [https://www.google.com/search?qFew+would+doubt+the+basic+fact+Jesus+was+baptized+by+John&hl\nen&num100&lr\n&fti&cr\n&safeimages&um\n1&ieUTF-8&tbo\nu&tbsbks:1&source\nog&saN&tab\nwp \"Few would doubt the basic fact...Jesus was baptized by John\"] Some scholars believe Jesus was a follower or disciple of John.Sanders, E.P. (1985) Jesus and Judaism. Philadelphia: Fortress Press; p. 91James D. G. Dunn, Jesus Remembered (Eerdmans, 2003) p. 350.Robert L. Webb, 'John the Baptist and his relationship to Jesus', in Bruce David Chilton, Craig Alan Evans, Studying the Historical Jesus:\nEvaluations of the State of Current Research (BRILL, 1998) p. 219. This idea is strongly controverted, however, by John the Baptist's own words in scripture, although several New Testament accounts report that some of Jesus' early followers had previously been followers of John.Harris, Stephen L. (1985) Understanding the Bible. Palo Alto: Mayfield  John the Baptist is also mentioned by the Jewish historian Josephus.Flavius Josephus, Antiquities of the Jews 18.5.2\n Some scholars maintain that John was influenced by the semi-ascetic Essenes, who expected an apocalypse and practiced rituals corresponding strongly with baptism,Harris, Stephen L. (1985) Understanding the Bible. Palo Alto: Mayfield; p. 382 although no direct evidence substantiates this.\n\nAccording to the New Testament, John anticipated a messianic figure greater than himself.Funk, Robert W. & the Jesus Seminar (1998). The Acts of Jesus: the search for the authentic deeds of Jesus.San Francisco: Harper; \"Mark,\" pp. 51–161. Christians commonly refer to John as the precursor or forerunner of Jesus, since John announces Jesus' coming. John is also identified with the prophet Elijah.Stephen L. Harris, Understanding the Bible. Palo Alto: Mayfield. 1985.  \n\nGospel narratives\n\nJohn the Baptist is mentioned in all four canonical Gospels and the non-canonical Gospel of the Nazarenes. The Synoptic Gospels (Mark, Matthew, and Luke) describe John baptising Jesus; in the Gospel of John it is implied in .\n\nIn Mark\n\nThe Gospel of Mark introduces John as a fulfilment of a prophecy from the Book of Isaiah (in fact, a conflation of texts from Isaiah, Malachi and Exodus)Carl R. Kazmierski, John the Baptist: Prophet and Evangelist (Liturgical Press, 1996) p. 31. about a messenger being sent ahead, and a voice crying out in the wilderness. John is described as wearing clothes of camel's hair, living on locusts and wild honey. John proclaims baptism of repentance for the forgiveness of sin, and says another will come after him who will not baptize with water, but with the Holy Spirit.\n\nJesus comes to John, and is baptized by him in the river Jordan. The account describes how; as he emerges from the water, the heavens open and the Holy Spirit descends on him 'like a dove'. A voice from heaven then says, \"You are my Son, the Beloved; with you I am well pleased.\" ()\n\nLater in the gospel there is an account of John's death. It is introduced by an incident where the Tetrarch Herod Antipas, hearing stories about Jesus, imagines that this is John the Baptist raised from the dead. It then explains that John had rebuked Herod for marrying Herodias, the ex-wife of his brother (named here as Philip). Herodias demands his execution, but Herod, who 'liked to listen' to John, is reluctant to do so because he fears him, knowing he is a 'righteous and holy man'.\n\nThe account then describes how Herod's daughter Herodias (NRSV; other translations refer to the girl as the daughter of Herodias) dances before Herod, who is pleased and offers her anything she asks for in return. When the girl asks her mother what she should request, she is told to demand the head of John the Baptist. Reluctantly, Herod orders the beheading of John, and his head is delivered to her, at her request, on a plate. John's disciples take the body away and bury it in a tomb.()\n\nThere are a number of difficulties with this passage. The Gospel wrongly identifies Antipas as 'King'John R. Donahue, Daniel J. Harrington, The Gospel of Mark (Liturgical Press, 2005) p. 195. and the ex-husband of Herodias is named as Philip, but he is known to have been called Herod. Although the wording clearly implies the girl was the daughter of Herodias, many texts describe her as \"Herod's daughter, Herodias\". Since these texts are early and significant and the reading is 'difficult', many scholars see this as the original version, corrected in later versions and in Matthew and Luke.Geoff R. Webb, Mark at the Threshold: Applying Bakhtinian Categories to Markan Characterisation, (BRILL, 2008) pp 110–11.John R. Donahue, Daniel J. Harrington, The Gospel of Mark (Liturgical Press, 2005) p. 198. Josephus says that Herodias had a daughter by the name of Salome.\n\nScholars have speculated about the origins of the story. Since it shows signs of having been composed in Aramaic, which Mark apparently did not speak, he is likely to have got it from a Palestinian source.Florence Morgan Gillman, Herodias: At Home in that Fox's Den (Liturgical Press, 2003) p. 80. There is a variety of opinions about how much actual historical material it contains, especially given the alleged factual errors.Florence Morgan Gillman, Herodias: At Home in that Fox's Den (Liturgical Press, 2003) pp. 81–83. Many scholars have seen the story of John arrested, executed, and buried in a tomb as a conscious foreshadowing of the fate of Jesus.Geoff R. Webb, Mark at the Threshold: Applying Bakhtinian Categories to Markan Characterisation, (Brill, 2008) p. 107.\n\n; John and his baptism of Jesus (Mark 1)\nAs it is written in Isaiah the prophet,\n\"Behold, I send my messenger before your face,\nwho will prepare your way,\nthe voice of one crying in the wilderness:\n‘Prepare the way of the Lord,\nmake his paths straight,’\"\n\nJohn appeared, baptizing in the wilderness and proclaiming a baptism of repentance for the forgiveness of sins. And all the country of Judea and all Jerusalem were going out to him and were being baptized by him in the river Jordan, confessing their sins. Now John was clothed with camel’s hair and wore a leather belt around his waist and ate locusts and wild honey. And he preached, saying, \"After me comes he who is mightier than I, the strap of whose sandals I am not worthy to stoop down and untie. I have baptized you with water, but he will baptize you with the Holy Spirit.\"\n\nIn those days Jesus came from Nazareth of Galilee and was baptized by John in the Jordan. And when he came up out of the water, immediately he saw the heavens being torn open and the Spirit descending on him like a dove. And a voice came from heaven, \"You are my beloved Son, with you I am well pleased.\"\n\n; Death of John (Mark 6)\n\nKing Herod heard of it, for Jesus’ name had become known. Some said, \"John the Baptist has been raised from the dead. That is why these miraculous powers are at work in him.\" But others said, \"He is Elijah.\" And others said, \"He is a prophet, like one of the prophets of old.\" But when Herod heard of it, he said, \"John, whom I beheaded, has been raised.\" For it was Herod who had sent and seized John and bound him in prison for the sake of Herodias, his brother Philip’s wife, because he had married her. For John had been saying to Herod, \"It is not lawful for you to have your brother’s wife.\" And Herodias had a grudge against him and wanted to put him to death. But she could not, for Herod feared John, knowing that he was a righteous and holy man, and he kept him safe. When he heard him, he was greatly perplexed, and yet he heard him gladly.\n\nBut an opportunity came when Herod on his birthday gave a banquet for his nobles and military commanders and the leading men of Galilee. For when Herodias’s daughter came in and danced, she pleased Herod and his guests. And the king said to the girl, \"Ask me for whatever you wish, and I will give it to you.\" And he vowed to her, \"Whatever you ask me, I will give you, up to half of my kingdom.\" And she went out and said to her mother, \"For what should I ask?\" And she said, \"The head of John the Baptist.\" And she came in immediately with haste to the king and asked, saying, \"I want you to give me at once the head of John the Baptist on a platter.\" And the king was exceedingly sorry, but because of his oaths and his guests he did not want to break his word to her. And immediately the king sent an executioner with orders to bring John’s head. He went and beheaded him in the prison and brought his head on a platter and gave it to the girl, and the girl gave it to her mother. When his disciples heard of it, they came and took his body and laid it in a tomb.\n\n(English Standard Version)\n\nIn Matthew\n\nThe Gospel of Matthew account begins with the same modified quotation from Isaiah, moving the Malachi and Exodus material to later in the text, where it is quoted by Jesus. The description of John is taken directly from Mark (\"clothing of camel’s hair with a leather belt around his waist, and his food was locusts and wild honey\"), along with the proclamation that one was coming who would baptise with the Holy Spirit \"and fire\".()\n\nUnlike Mark, Matthew describes John as critical of Pharisees and Sadducees and as preaching \"the kingdom of heaven is at hand\" and a \"coming judgment\".\n\nMatthew shortens the account of the beheading of John, and adds two elements: that Herod Antipas wants John dead, and that the death is reported to Jesus by his disciples. Matthew's approach is to shift the focus away from Herod and onto John as a prototype of Jesus. Where Mark has Herod killing John reluctantly and at Herodias' insistence, Matthew describes him as wanting John dead.Robert Horton Gundry, Matthew: A Commentary on His Handbook for a Mixed Church Under Persecution (Eerdmans, 1994) p. 286.\n\n; John and his baptism of Jesus (Matthew 3)\nIn those days John the Baptist came preaching in the wilderness of Judea, \"Repent, for the kingdom of heaven is at hand.\" For this is he who was spoken of by the prophet Isaiah when he said,\n\n\"The voice of one crying in the wilderness:\n‘Prepare the way of the Lord;\nmake his paths straight.’\"\n\nNow John wore a garment of camel’s hair and a leather belt around his waist, and his food was locusts and wild honey. Then Jerusalem and all Judea and all the region about the Jordan were going out to him, and they were baptized by him in the river Jordan, confessing their sins.\n\nBut when he saw many of the Pharisees and Sadducees coming to his baptism, he said to them, \"You brood of vipers! Who warned you to flee from the wrath to come? Bear fruit in keeping with repentance. And do not presume to say to yourselves, ‘We have Abraham as our father,’ for I tell you, God is able from these stones to raise up children for Abraham. Even now the axe is laid to the root of the trees. Every tree therefore that does not bear good fruit is cut down and thrown into the fire.\n\n\"I baptize you with water for repentance, but he who is coming after me is mightier than I, whose sandals I am not worthy to carry. He will baptize you with the Holy Spirit and fire. His winnowing fork is in his hand, and he will clear his threshing floor and gather his wheat into the barn, but the chaff he will burn with unquenchable fire.\"\n\nThen Jesus came from Galilee to the Jordan to John, to be baptized by him. John would have prevented him, saying, \"I need to be baptized by you, and do you come to me?\" But Jesus answered him, \"Let it be so now, for thus it is fitting for us to fulfill all righteousness.\" Then he consented. And when Jesus was baptized, immediately he went up from the water, and behold, the heavens were opened to him, and he saw the Spirit of God descending like a dove and coming to rest on him; and behold, a voice from heaven said, \"This is my beloved Son, with whom I am well pleased.\"\n\n; John questions Jesus (Matthew 11)\n\nNow when John heard in prison about the deeds of the Christ, he sent word by his disciples and said to him, \"Are you the one who is to come, or shall we look for another?\" And Jesus answered them, \"Go and tell John what you hear and see: the blind receive their sight and the lame walk, lepers are cleansed and the deaf hear, and the dead are raised up, and the poor have good news preached to them. And blessed is the one who is not offended by me.\"\n\nAs they went away, Jesus began to speak to the crowds concerning John: \"What did you go out into the wilderness to see? A reed shaken by the wind? What then did you go out to see? A man dressed in soft clothing? Behold, those who wear soft clothing are in kings’ houses. What then did you go out to see? A prophet? Yes, I tell you, and more than a prophet. This is he of whom it is written,\n\n\"‘Behold, I send my messenger before your face,\nwho will prepare your way before you.’\n\nTruly, I say to you, among those born of women there has arisen no one greater than John the Baptist. Yet the one who is least in the kingdom of heaven is greater than he. From the days of John the Baptist until now the kingdom of heaven has suffered violence, and the violent take it by force. For all the Prophets and the Law prophesied until John, and if you are willing to accept it, he is Elijah who is to come. He who has ears to hear, let him hear.\n\n\"But to what shall I compare this generation? It is like children sitting in the marketplaces and calling to their playmates,\n\n\"‘We played the flute for you, and you did not dance;\nwe sang a dirge, and you did not mourn.’\n\nFor John came neither eating nor drinking, and they say, ‘He has a demon.’ The Son of Man came eating and drinking, and they say, ‘Look at him! A glutton and a drunkard, a friend of tax collectors and sinners!’ Yet wisdom is justified by her deeds.\"\n\n; Death of John (Matthew 14)\n\nAt that time Herod the tetrarch heard about the fame of Jesus, and he said to his servants, \"This is John the Baptist. He has been raised from the dead; that is why these miraculous powers are at work in him.\" For Herod had seized John and bound him and put him in prison for the sake of Herodias, his brother Philip’s wife, because John had been saying to him, \"It is not lawful for you to have her.\" And though he wanted to put him to death, he feared the people, because they held him to be a prophet. But when Herod’s birthday came, the daughter of Herodias danced before the company and pleased Herod, so that he promised with an oath to give her whatever she might ask. Prompted by her mother, she said, \"Give me the head of John the Baptist here on a platter.\" And the king was sorry, but because of his oaths and his guests he commanded it to be given. He sent and had John beheaded in the prison, and his head was brought on a platter and given to the girl, and she brought it to her mother. And his disciples came and took the body and buried it, and they went and told Jesus.\n\n(English Standard Version)\n\nIn Luke and Acts\n\nThe Gospel of Luke adds an account of John's infancy, introducing him as the miraculous son of Zechariah, an old man, and his wife Elizabeth, who was past the  menopause and therefore unable to have children.Libby Ahluwalia, Understanding Philosophy of Religion (Folens, 2008), p. 180.Just, Arthur A.; Oden, Thomas C. (2003), [https://books.google.com/books?idGh6sFDUfq8cC&pg\nPA10#vonepage&q\n%22barrenness%20and%20virginity%22&ffalse Ancient Christian Commentary on Scripture – Luke: New Testament III], InterVarsity Press; p. 10.   According to this account, the birth of John was foretold by the angel Gabriel to Zechariah, while he was performing his functions as a priest in the temple of Jerusalem. Since he is described as a priest of the course of Abijah and Elizabeth as one of the daughters of Aaron, this would make John a descendant of Aaron on both his father's and mother's side.'Aaron', In: Mills, Watson E. (ed.) (1998) Mercer Dictionary of the Bible, Vol. 5, Macon GA: Mercer University Press, ; p. 1 On the basis of this account, the Catholic as well as the Anglican and Lutheran liturgical calendars placed the feast of the Nativity of John the Baptist on June 24, six months before Christmas.\n\nElizabeth is described as a \"relative\" of Mary, the mother of Jesus in .  There is no mention of a family relationship between John and Jesus in the other Gospels, and Raymond E. Brown has described it as \"of dubious historicity\".Brown, Raymond Edward (1973), The Virginal Conception and Bodily Resurrection of Jesus, Paulist Press, p. 54 Géza Vermes has called it \"artificial and undoubtedly Luke's creation\".Vermes, Geza. The Nativity, p. 143. The many similarities between the Gospel of Luke story of the birth of John and the Old Testament account of the birth of Samuel suggest that Luke's account of the annunciation and birth of Jesus are modeled on that of Samuel.Freed, Edwin D. (2001), The Stories of Jesus' Birth: a Critical Introduction Continuum International, pp. 87–90.\n\n; Post-nativity\n\nUnique to the Gospel of Luke, John the Baptist explicitly teaches charity, baptizes tax-collectors, and advises soldiers.\n\nThe text briefly mentions that John is imprisoned and later beheaded by Herod, but the Gospel of Luke lacks the story of a step-daughter dancing for Herod and requesting John's head.\n\nThe Book of Acts portrays some disciples of John becoming followers of Jesus  a development not reported by the gospels except for the early case of Andrew, Simon Peter's brother \n\n; Nativity of John (Luke 1)\nIn the reign of Herod, king of Judea, there was a priest named Zechariah, who belonged to the division called after Abijah. His wife, whose name was Elizabeth, was also a descendant of Aaron. They were both righteous people, who lived blameless lives, guiding their steps by all the commandments and ordinances of the Lord. But they had no child, Elizabeth being barren; and both of them were advanced in years.\n\nOne day, when Zechariah was officiating as priest before God, during the turn of his division, it fell to him by lot, in accordance with the practice among the priests, to go into the Temple of the Lord and burn incense; and, as it was the Hour of Incense, the people were all praying outside. And an angel of the Lord appeared to him, standing on the right of the Altar of Incense. Zechariah was startled at the sight and was awe-struck. But the angel said to him: \"Do not be afraid, Zechariah; your prayer has been heard, and your wife Elizabeth will bear you a son, whom you will call by the name John. He will be to you a joy and a delight; and many will rejoice over his birth. For he will be great in the sight of the Lord; he will not drink any wine or strong drink, and he will be filled with the Holy Spirit from the very hour of his birth, and will reconcile many of the Israelites to the Lord their God. He will go before him in the spirit and with the power of Elijah, ‘to reconcile fathers to their children’ and the disobedient to the wisdom of the righteous, and so make ready for the Lord a people prepared for him.\"\n\n\"How can I be sure of this?\" Zechariah asked the angel. \"For I am an old man and my wife is advanced in years.\"\n\n\"I am Gabriel,\" the angel answered, \"who stand in the presence of God, and I have been sent to speak to you and to bring you this good news. And now you will be silent and unable to speak until the day when this takes place, because you did not believe what I said, though my words will be fulfilled in due course.\"\n\nMeanwhile, the people were watching for Zechariah, wondering at his remaining so long in the Temple. When he came out, he was unable to speak to them, and they perceived that he had seen a vision there. But Zechariah kept making signs to them, and remained dumb. And, as soon as his term of service was finished, he returned home. After this his wife, Elizabeth, became pregnant and lived in seclusion for five months. \"The Lord has done this for me,\" she said, \"he has shown me kindness and taken away the public disgrace of childlessness under which I have been living.\"\n\nSix months later the angel Gabriel was sent from God to a town in Galilee called Nazareth, to a maiden there who was engaged to a man named Joseph, a descendant of David. Her name was Mary. Gabriel came into her presence and greeted her, saying: \"You have been shown great favor – the Lord is with you.\"\n\nMary was much disturbed at his words, and was wondering to herself what such a greeting could mean, when the angel spoke again: \"Do not be afraid, Mary, for you have found favor with God. And now, you will conceive and give birth to a son, and you will give him the name Jesus. The child will be great and will be called ‘Son of the Most High,’ and the Lord God will give him the throne of his ancestor David, and he will reign over the descendants of Jacob for ever; And to his kingdom there will be no end.\"\n\n\"How can this be?\" Mary asked the angel. \"For I have no husband.\"\n\n\"The Holy Spirit will descend on you,\" answered the angel, \"and the Power of the Most High will overshadow you; and therefore the child will be called ‘holy,’ and ‘Son of God.’ And Elizabeth, your cousin, is herself also expecting a son in her old age; and it is now the sixth month with her, though she is called barren; for no promise from God will fail to be fulfilled.\"\n\n\"I am the servant of the Lord,\" exclaimed Mary; \"let it be with me as you have said.\" Then the angel left her.\n\nSoon after this Mary set out, and made her way quickly into the hill-country, to a town in Judah; and there she went into Zechariah’s house and greeted Elizabeth. When Elizabeth heard Mary’s greeting, the child moved within her, and Elizabeth herself was filled with the Holy Spirit, and cried aloud: \"Blessed are you among women, and blessed is your unborn child! But how have I this honor, that the mother of my Lord should come to me? For, as soon as your greeting reached my ears, the child moved within me with delight! Happy indeed is she who believed that the promise which she received from the Lord would be fulfilled.\"\n\nAnd Mary said:\n\n\"My soul exalts the Lord,\nmy spirit delights in God my Savior;\nfor he has remembered his humble servant girl;\nAnd from this hour all ages will count me happy!\n\nGreat things has the Almighty done for me;\nAnd holy is his name.\nFrom age to age his mercy rests\nOn those who honor him.\n\nMighty are the deeds of his arm;\nHe scatters the proud with their own devices,\nhe casts down princes from their thrones,\nand the humble he uplifts,\nthe hungry he loads with gifts,\nand the rich he sends empty away.\n\nHe has stretched out his hand to his servant Israel,\nEver mindful of his mercy\n(As he promised to our forefathers)\nFor Abraham and his race for ever.\"\n\nMary stayed with Elizabeth about three months, and then returned to her home. When Elizabeth’s time came, she gave birth to a son; and her neighbors and relations, hearing of the great goodness of the Lord to her, came to share her joy. A week later they met to circumcise the child, and were about to call him ‘Zechariah’ after his father, when his mother spoke up: \"No, he is to be called John.\"\n\n\"You have no relation of that name!\" they exclaimed; and they made signs to the child’s father, to find out what he wished the child to be called. Asking for a writing-tablet, he wrote the words – ‘His name is John.’ Everyone was surprised; and immediately Zechariah recovered his voice and the use of his tongue, and began to bless God. All their neighbors were awe-struck at this; and throughout the hill-country of Judea the whole story was much talked about; and all who heard it kept it in mind, asking one another – \"What can this child be destined to become?\" For the Power of the Lord was with him.\n\nThen his father Zechariah was filled with the Holy Spirit, and, speaking under inspiration, said:\n\n\"Blessed is the Lord, the God of Israel,\nWho has visited his people and wrought their deliverance,\nand has raised up for us the Strength of our salvation\nIn the house of his servant David –\n\nAs he promised by the lips of his holy prophets of old –\nsalvation from our enemies and from the hands of all who hate us,\nshowing mercy to our forefathers,\nAnd mindful of his sacred covenant.\n\nThis was the oath which he swore to our forefather Abraham –\nThat we should be rescued from the hands of our enemies,\nand should serve him without fear in holiness and righteousness,\nIn his presence all our days.\n\nAnd you, child, will be called prophet of the Most High,\nFor you will go before the Lord to make ready his way,\nto give his people the knowledge of salvation\nIn the forgiveness of their sins,\n\nthrough the tender mercy of our God,\nWhereby the Dawn will break on us from heaven,\nto give light to those who live in darkness and the shadow of death,\nAnd guide our feet into the way of peace.\"\n\nThe child grew and became strong in spirit; and he lived in the Wilds until the time came for his appearance before Israel.\n\n; John and his baptism of Jesus, Imprisonment of John (Luke 3)\n\nIn the fifteenth year of the reign of the Emperor Tiberius, when Pontius Pilate was Governor of Judea, Herod Ruler of Galilee, his brother Philip Ruler of the territory comprising Ituraea and Trachonitis, and Lysanias Ruler of Abilene, and when Annas and Caiaphas were high priests, a command from God came to John, the son of Zechariah, while he was in the wilderness. And John went through the whole district of the Jordan, proclaiming baptism on repentance, for the forgiveness of sins. This was in fulfillment of what is said in the writings of the prophet Isaiah –\n\n‘The voice of one crying aloud in the wilderness:\n\"Make ready the way of the Lord,\nMake his paths straight.\nEvery chasm will be filled,\nEvery mountain and hill will be leveled,\nThe winding ways will be straightened,\nThe rough roads made smooth,\nand everyone will see the salvation of God.\"’\n\nAnd John said to the crowds that went to be baptized by him: \"You children of snakes! Who has prompted you to seek refuge from the coming judgment? Let your lives, then, prove your repentance; and do not begin to say among yourselves ‘Abraham is our ancestor,’ for I tell you that out of these stones God is able to raise descendants for Abraham! Already, indeed, the axe is lying at the root of the trees. Therefore, every tree that fails to bear good fruit will be cut down and thrown into the fire.\"\n\n\"What are we to do then?\" the people asked. \"Let anyone who has two coats,\" answered John, \"share with the person who has none; and anyone who has food do the same.\"\n\nEven tax-gatherers came to be baptized, and said to John: \"Teacher, what are we to do?\"\n\n\"Do not collect more than you have authority to demand,\" John answered. And when some soldiers on active service asked \"And we – what are we to do?\" he said: \"Never use violence, or exact anything by false accusation; and be content with your pay.\"\n\nThen, while the people were in suspense, and were all debating with themselves whether John could be the Christ, John, addressing them all, said: \"I, indeed, baptize you with water; but there is coming one more powerful than I, and I am not fit even to unfasten his sandals. He will baptize you with the Holy Spirit and with fire. His winnowing-fan is in his hand so that he may clear his threshing-floor, and store the grain in his barn, but the chaff he will burn with a fire that cannot be put out.\"\n\nAnd so with many different appeals John told his good news to the people. But Prince Herod, being rebuked by John respecting Herodias, the wife of Herod’s brother, and for all the evil things that he had done,  crowned them all by shutting John up in prison. Now after the baptism of all the people, and when Jesus had been baptized and was still praying, the heavens opened,  and the Holy Spirit came down on him in the form of a dove, and from the heavens came a voice – \"You are my dearly loved son; you bring me great joy.\"\n\n; John's disciples and fast (Luke 5:33)\n\"John’s disciples,\" they said to Jesus, \"Often fast and say prayers, and so do the disciples of the Pharisees, while yours are eating and drinking!\"\n\n; John questions Jesus (Luke 7)\nAll these events were reported to John by his disciples. So he summoned two of them, and sent them to the Master to ask – \"Are you ‘the coming one,’ or are we to look for some one else?\"\n\nWhen these men found Jesus, they said: \"John the Baptist has sent us to you to ask – ‘Are you ‘the coming one,’ or are we to look for somebody else?’\" At that very time Jesus had cured many people of diseases, afflictions, and wicked spirits, and had given many blind people their sight. So his answer to the question was: \"Go and report to John what you have witnessed and heard – the blind recover their sight, the lame walk, the lepers are made clean, and the deaf hear, the dead are raised to life, the good news is told to the poor. And blessed is the person who finds no hindrance in me.\"\n\nWhen John’s messengers had left, Jesus, speaking to the crowds, began to say with reference to John: \"What did you go out into the wilderness to look at? A reed waving in the wind? If not, what did you go out to see? A man dressed in rich clothing? Why, those who are accustomed to fine clothes and luxury live in royal palaces. What then did you go to see? A prophet? Yes, I tell you, and far more than a prophet. This is the man of whom scripture says –\n\n‘I am sending my messenger ahead of you,\nand he will prepare your way before you.’\n\nThere is, I tell you, no one born of a woman who is greater than John; and yet the least in the kingdom of God is greater than he.\"\n\n(All the people, when they heard this, and even the tax-gatherers, having accepted John’s baptism, acknowledged the justice of God. But the Pharisees and the students of the law, having rejected John’s baptism, frustrated God’s purpose in regard to them.)\n\nIn the Gospel of John\n\nThe fourth gospel describes John the Baptist as \"a man sent from God\" who \"was not the light\", but \"came as a witness, to bear witness to the light, so that through him everyone might believe\". John clearly denies being the Christ or Elijah or 'the prophet', instead describing himself as the \"voice of one crying in the wilderness\"., compare \n\nUpon literary analysis, it is clear that John is the \"testifier and confessor par excellence\", particularly when compared to figures like Nicodemus.\n\nJesus's baptism is implied but not depicted. Unlike the other gospels, it is John himself who testifies to seeing \"the Spirit come down from heaven like a dove and rest on him\". John explicitly announces that Jesus is the one \"who baptizes with the Holy Spirit\" and John even professes a \"belief that he is the Son of God\" and \"the Lamb of God\".\n\nThe Gospel of John reports that Jesus' disciples were baptizing and that a debate broke out between some of the disciples of John and another Jew about purification. In this debate John argued that Jesus \"must become greater,\" while he (John) \"must become less\" (Latin Vulgate: ).\n\nThe Gospel of John then points out that Jesus' disciples were baptizing more people than John. Later, the Gospel relates that Jesus regarded John as \"a burning and shining lamp, and you were willing to rejoice for a while in his light\".\n\n; John 1\nThere appeared a man sent from God, whose name was John; he came as a witness – to bear witness to the light so that through him everyone might believe. He was not the light, but he came to bear witness to the light.\n\nWhen the religious authorities in Jerusalem sent some Priests and Levites to ask John – \"Who are you?\", he told them clearly and simply: \"I am not the Christ.\"\n\n\"What then?\" they asked. \"Are you Elijah?\"\n\"No,\" he said, \"I am not.\"\n\"Are you ‘the prophet’?\" He answered, \"No.\"\n\"Who then are you?\" they continued; \"tell us so that we have an answer to give to those who have sent us. What do you say about yourself?\"\n\"I,\" he answered, \"am – ‘The voice of one crying aloud in the wilderness – \"make a straight road for the Lord\"’, as the prophet Isaiah said.\"\nThese men had been sent from the Pharisees; and their next question was: \"Why then do you baptize, if you are not the Christ or Elijah or ‘the prophet’?\" John’s answer was – \"I baptize with water, but among you stands one whom you do not know; he is coming after me, yet I am not worthy even to unfasten his sandal.\" This happened at Bethany, across the Jordan, where John was baptizing.\n\nThe next day John saw Jesus coming towards him, and exclaimed: \"Here is the Lamb of God, who takes away the sin of the world! I was taking about him when I said ‘After me there is coming a man who ranks ahead of me, because before I was born he already was.’ I did not know who he was, but I have come baptizing with water to make him known to Israel.\"\n\nJohn also said: \"I saw the Spirit come down from heaven like a dove and rest on him. I myself did not know him, but he who sent me to baptize with water, he said to me ‘He on whom you see the Spirit descending, and remaining on him – he it is who baptizes with the Holy Spirit.’ This I have seen myself, and I have declared my belief that he is the Son of God.\" The next day, when John was standing with two of his disciples, he looked at Jesus as he passed and exclaimed: \"There is the Lamb of God!\" The two disciples heard him say this, and followed Jesus.\n\n; John 3\nJohn, also, was baptizing at Aenon near Salim, because there were many streams there; and people were constantly coming and being baptized. (For John had not yet been imprisoned). Now a discussion arose between some of John’s disciples and a fellow Jew on the subject of ‘purification;’ and the disciples came to John and said: \"Rabbi, the man who was with you on the other side of the Jordan, and to whom you have yourself borne testimony – he, also, is baptizing, and everybody is going to him.\" John’s answer was – \"A person can gain nothing but what is given them from heaven. You are yourselves witnesses that I said ‘I am not the Christ,’ but ‘I have been sent before him as a messenger.’ It is the groom who has the bride; but the groom’s friend, who stands by and listens to him, is filled with joy when he hears the groom’s voice. This joy I have felt to the full. He must become greater, and I less.\"\n\nHe who comes from above is above all others; but a child of earth is earthly, and his teaching is earthly, too. He who comes from heaven is above all others. He states what he has seen and what he heard, and yet no one accepts his statement. They who did accept his statement confirm the fact that God is true. For he whom God sent as his messenger gives us God’s own teaching, for God does not limit the gift of the Spirit. The Father loves his Son, and has put everything in his hands. The person who believes in the Son has eternal life, while a person who rejects the Son will not even see that life, but remains under ‘God’s displeasure.’\n\nComparative analysis\n\n; The prophecy of Isaiah\n\nAlthough Mark's Gospel implies that the arrival of John the Baptist is the fulfilment of a prophecy from the Book of Isaiah, the words quoted (\"I will send my messenger ahead of you, who will prepare your way – a voice of one calling in the wilderness, ‘Prepare the way for the Lord, make straight paths for him.’\") are actually a composite of texts from Isaiah, Malachi and the Book of Exodus. (Matthew and Luke drop the first part of the reference.)\n\n; Baptism of Jesus\n\nThe gospels differ on the details of the Baptism. In Mark and Luke, Jesus himself sees the heavens open and hears a voice address him personally, saying, \"You are my dearly loved son; you bring me great joy\". They do not clarify whether others saw and heard these things. Although other incidents where the \"voice came out of heaven\" are recorded in which, for the sake of the crowds, it was heard audibly, John did say in his witness that he did see the spirit coming down \"out of heaven\". John 12:28–30, John 1:32\n\nIn Matthew, the voice from heaven does not address Jesus personally, saying instead \"This is my beloved son, in whom I am well pleased.\"\n\nIn the Gospel of John, John the Baptist himself sees the spirit descend as a dove, testifying about the experience as evidence of Jesus's status.\n\n; John's knowledge of Jesus\n\nJohn's knowledge of Jesus varies across gospels. In the Gospel of Mark, John preaches of a coming leader, but shows no signs of recognizing that Jesus is this leader. In Matthew, however, John immediately recognizes Jesus and John questions his own worthiness to baptize Jesus. In both Matthew and Luke, John later dispatches disciples to question Jesus about his status, asking \"Are you he who is to come, or shall we look for another?\"\nIn Luke, John is a familial relative of Jesus whose birth was foretold by Gabriel.\nIn the Gospel of John, John the Baptist himself sees the spirit descend like a dove and he explicitly preaches that Jesus is the Son of God.\n\n; John and Elijah\n\nThe Gospels vary in their depiction of John's relationship to Elijah. Matthew and Mark describe John's attire in a way reminiscent of the description of Elijah in 2 Kings 1:8, who also wore a garment of hair and a leather belt. In Matthew, Jesus explicitly teaches that John is \"Elijah who was to come\" (Matt. 11:14 – see also Matt. 17:11–13); many Christian theologians have taken this to mean that John was Elijah's successor. In the Gospel of John, John the Baptist explicitly denies being Elijah. In the annunciation narrative in Luke, an angel appears to Zechariah, John's father, and tells him that John \"will turn many of the sons of Israel to the Lord their God,\" and that he will go forth \"in the spirit and power of Elijah ().\"\n\nIn Josephus's Antiquities of the Jews\n\nAn account of John the Baptist is found in all extant manuscripts of the Antiquities of the Jews (book 18, chapter 5, 2) by Flavius Josephus (37–100):\"Josephus, Flavius.\" In: Cross, F. L. (ed.) (2005) The Oxford Dictionary of the Christian Church, 3rd ed. Oxford University Press\n\nAccording to this passage, the execution of John was blamed for the defeat Herod suffered. Some have claimed that this passage indicates that John died near the time of the destruction of Herod's army in 36 AD. However, in a different passage, Josephus states that the end of Herod's marriage with Aretas' daughter (after which John was killed) was only the beginning of hostilities between Herod and Aretas, which later escalated into the battle.\n\nDivergences between the passage's presentation and the biblical accounts of John include baptism for those whose souls have already been \"purified beforehand by righteousness\" is for purification of the body, not general repentance of sin (Mark 1:4). Biblical scholar John Dominic Crossan differentiates between Josephus's account of John and Jesus, saying, \"John had a monopoly, but Jesus had a franchise.\" To get baptized, Crossan writes, you went only to John; to stop the movement one only needed to stop John (therefore his movement ended with his death). Jesus invited all to come and see how he and his companions had already accepted the government of God, entered it and were living it. Such a communal praxis was not just for himself, but could survive without him, unlike John's movement.Crossan, John Dominic (2007), God and Empire, London: HarperCollins, p. 117 ff\n\nRelics\n\n records that \"his disciples came and took away [John's] body and buried it\". Theologian Joseph Benson refers to a belief that \"it seems that [the body] had been thrown over the prison walls, without burial, probably by order of Herodias.[http://biblehub.com/commentaries/benson/matthew/14.htm Benson's Commentary] on Matthew 14, accessed 17 Jauuary 2017\n\nThe burial-place of John the Baptist was traditionally said to be at the Nabi Yahya Mosque (Saint John the Baptiste Mosque) in Sebaste in current Palestinian territories, and mention is made of his relics being honored there around the middle of the 4th century. The historians Rufinus and Theodoretus record that the shrine was desecrated under Julian the Apostate around 362, the bones being partly burned. A portion of the rescued relics were carried to Jerusalem, then to Alexandria, where on 27 May 395, they were laid in the basilica newly dedicated to the Forerunner on the former site of the temple of Serapis. The tomb at Sebaste continued, nevertheless, to be visited by pious pilgrims, and Saint Jerome bears witness to miracles being worked there.\n\nWhat became of the head of John the Baptist is difficult to determine. NicephorusNicephorus, Ecclesiastical History I, ix. See Patrologia Graeca, cxlv.–cxlvii. and Symeon Metaphrastes say that Herodias had it buried in the fortress of Machaerus (in accordance with Josephus). Other writers say that it was interred in Herod's palace at Jerusalem; there it was found during the reign of Constantine I, and thence secretly taken to Emesa where it was concealed, the place remaining unknown for years, until it was manifested by revelation in 453. However, the decapitation cloth of Saint John is kept at the Aachen Cathedral. The Coptic Christian Orthodox Church also claim to hold the relics of Saint John the Baptist. These are to be found in a monastery in Lower Egypt between Cairo and Alexandria. It is possible, with permission from the monks, to see the original tomb where the remains were found.\n\n* Several different locations claim to possess the severed head of John the Baptist. The current official place for the Catholic Church is the Shrine of Saint John the Baptiste (Nabi Yahya in Arabic) inside the Umayyad Mosque in Damascus.Lost Worlds: Knights Templar, July 10, 2006 video documentary on The History Channel, directed and written by Stuart Elliott The place was visited by Pope John Paul II in 2001 who \"paused for a minute's silent meditation at the tomb of St John the Baptist\". Previous to that the catholic Church used to believe that it was kept in the San Silvestro in Capite in Rome; and then that it was held by the Knights Templar at Amiens Cathedral in France (brought home by Wallon de Sarton from the Fourth Crusade in Constantinople), at Antioch in Turkey (fate uncertain). Other traditions assume that it was in Residenz Museum in Munich, Germany (official residence of the Wittelsbach rulers of Bavaria from 1385 to 1918). or even the parish church at Tenterden in Kent, where it was preserved up until the Reformation.\n\n* The saint's right hand, with which he baptised Jesus, is claimed to be in the Serbian Orthodox Cetinje monastery in Montenegro; Topkapi Palace in Istanbul; and also in the Romanian skete of the Forerunner on Mount Athos. The saint's left hand is allegedly preserved in the Armenian Apostolic Church of St. John at Chinsurah, West Bengal, where each year on \"Chinsurah Day\" in January it blesses the Armenian Christians of Calcutta. A crypt and relics said to be John's and mentioned in 11th- and 16th-century manuscripts, were discovered in 1969 during restoration of the Church of St. Macarius at the Monastery of Saint Macarius the Great in Scetes, Egypt; Additional relics are claimed to reside in Gandzasar Monastery's Cathedral of St. John the Baptist, in Nagorno Karabakh.\n\nAnother obscure claim relates to the town of Halifax in West Yorkshire, United Kingdom, where, as patron saint of the town, the Baptist's head appears on the official coat-of-arms. One legend (among others) bases the etymology of the town's place-name on \"halig\" (holy) and \"fax\" (face), claiming that a relic of the head, or face, of John the Baptist once existed in the town.\nAlso, in 2010, bones were discovered in the ruins of a Bulgarian church in the St. John the Forerunner Monastery (4th–17th centuries) on the Black Sea island of St. Ivan and two years later, after DNA and radio carbon testing proved the bones belonged to a Middle Eastern man who lived in the 1st century AD, scientists said that the remains could conceivably have belonged to John the Baptist.Moss, Candida. [http://candidamoss.com/national-geographic-search-for-the-head-of-john-the-baptist/ National Geographic: Search for the Head of John the Baptist.] 19 April 2014. The remains, found in a reliquarium are presently kept in the Sts. Cyril and Methodius Cathedral in Sozopol.[http://www.novinite.com/view_news.php?id=132804 Old Town Sozopol – Bulgaria's 'Rescued' Miracle and Its Modern Day Saviors.] Sofia News Agency, October 10, 2011.\n\nReligious views\n\nChristianity\n\nChristians believe that John the Baptist had a specific role ordained by God as forerunner or precursor of Jesus, who was the foretold Messiah. The New Testament Gospels speak of this role. In  the role of John is referred to as being \"to turn the hearts of the fathers to the children, and the disobedient to the wisdom of the just; to make ready a people prepared for the Lord.\" In  as \"...thou shalt go before the face of the Lord to prepare his ways\" and in  as being \"To give knowledge of salvation unto his people by the remission of their sins.\"\n\nThere are several passages within the Old Testament which are interpreted by Christians as being prophetic of John the Baptist in this role. These include a passage in the Book of Malachi () that refers to a prophet who would prepare the way of the Lord:\n\nand also at the end of the next chapter in Malachi 4:5–6 where it says,\n\nThe Jews of Jesus' day expected Elijah to come before the Messiah; indeed, some present day Jews continue to await Elijah's coming as well, as in the Cup of Elijah the Prophet in the Passover Seder. This is why the disciples ask Jesus in , 'Why then say the scribes that Elias must first come?' The disciples are then told by Jesus that Elijah came in the person of John the Baptist,\n\n (see also 11:14: \"...if you are willing to accept it, he is Elijah who was to come.\")\n\nThese passages are applied to John in the Synoptic Gospels.Mat 3:3 For this is he that was spoken of by the prophet Esaias, saying, The voice of one crying in the wilderness, Prepare ye the way of the Lord, make his paths straight.\nMar 1:2 As it is written in the prophets, Behold, I send my messenger before thy face, which shall prepare thy way before thee. Mar 1:3 The voice of one crying in the wilderness, Prepare ye the way of the Lord, make his paths straight.Luk 1:16–17 And many of the children of Israel shall he turn to the Lord their God. And he shall go before him in the spirit and power of Elijah, to turn the hearts of the fathers to the children, and the disobedient to the wisdom of the just; to make ready a people prepared for the Lord. But where Matthew specifically identifies John the Baptist as Elijah's spiritual successor (), the gospels of Mark and Luke are silent on the matter. The Gospel of John states that John the Baptist denied that he was Elijah.\n\nInfluence on Paul\n\nMany scholars believe there was contact between the early church in the Apostolic Age and what is called the \"Qumran-Essene community.\" The Dead Sea Scrolls were found at Qumran, which the majority of historians and archaeologists identify as an Essene settlement.\nJohn the Baptist is thought to have been either an Essene or \"associated\" with the community at Khirbet Qumran. According to the Book of Acts, Paul met some \"disciples of John\" in Ephesus.\n\nDue to influence of Qumranic terminology and ideas in Paul's Epistle to the Ephesians, some scholars believe that the \"disciples\" mentioned in  were disciples of John the Baptist. This view, which assumes that John was an Essene, is debated by scholars. While John the Baptist practiced baptism, the Essenes used ritual washing, also called ablution, as a form of spiritual purification.\n\nCatholic Church\n\nThe Catholic Church commemorates Saint John the Baptist on two feast days:\n* 24 June – Nativity of Saint John the Baptist\n* 29 August – Beheading of Saint John the Baptist\n\nSome Catholics have held to a belief that John the Baptist never sinned, although this has never been a point of doctrine and is not binding in belief upon any adherent as is the sinlessness of Mary. In her Treatise of Prayer, Saint Catherine of Siena includes a brief altercation with the Devil regarding her fight due to the Devil attempting to lure her with vanity and flattery. Speaking in the first person, Catherine responds to the Devil with the following words:\n\nEastern Christianity\n \n\nThe Eastern Catholic Churches and Eastern Orthodox faithful believe that John was the last of the Old Testament prophets, thus serving as a bridge between that period of revelation and the New Covenant. They also teach that, following his death, John descended into Hades and there once more preached that Jesus the Messiah was coming, so he was the Forerunner of Christ in death as he had been in life. Eastern Catholic and Orthodox churches will often have an icon of Saint John the Baptist in a place of honor on the iconostasis, and he is frequently mentioned during the Divine Services. Every Tuesday throughout the year is dedicated to his memory.\n\nThe Eastern Orthodox Church remembers Saint John the Forerunner on six separate feast days, listed here in order in which they occur during the church year (which begins on September 1):\n* 23 September – Conception of Saint John the ForerunnerIn late antiquity this feast in some churches marked the beginning of the Ecclesiastical Year; see Archbishop Peter (L'Huiller) of New York and New Jersey, \"[http://www.orthodoxresearchinstitute.org/articles/liturgics/peter_archbishop_liturgical_matters.htm Liturgical Matters: \"The Lukan Jump\"]\", in: Newspaper of the Diocese of New York and New Jersey, Fall 1992.\n* 7 January – The Synaxis of Saint John the Forerunner. This is his main ml day, immediately after Theophany on January 6 (January 7 also commemorates the transfer of the relic of the right hand of John the Baptist from Antioch to Constantinople in 956)\n* 24 February – First and Second Finding of the Head of Saint John the Forerunner\n* 25 May – Third Finding of the Head of Saint John the Forerunner\n* 24 June – Nativity of Saint John the Forerunner\n* 29 August – The Beheading of Saint John the Forerunner, a day of strict fast and abstinence from meat and dairy products and foods containing meat or dairy products\n\nIn addition to the above, 5 September is the commemoration of Zechariah and Elizabeth, Saint John's parents. The Russian Orthodox Church observes 12 October as the Transfer of the Right Hand of the Forerunner from Malta to Gatchina (1799).\n\nThe Church of Jesus Christ of Latter-day Saints\n\nThe Church of Jesus Christ of Latter-day Saints (LDS Church) teaches that modern revelation confirms the biblical account of John and also makes known additional events in his ministry. According to this belief, John was \"ordained by the angel of God\" when he was eight days old \"to overthrow the kingdom of the Jews\" and to prepare a people for the Lord. Mormons also believe that \"he was baptized while yet in his childhood.\"\n\nJoseph Smith said: \"Let us come into New Testament times – so many are ever praising the Lord and His apostles. We will commence with John the Baptist. When Herod's edict went forth to destroy the young children, John was about six months older than Jesus, and came under this hellish edict, and Zecharias caused his mother to take him into the mountains, where he was raised on locusts and wild honey. When his father refused to disclose his hiding place, and being the officiating high priest at the Temple that year, was slain by Herod's order, between the porch and the altar, as Jesus said.\"\n\nThe LDS Church teaches that John the Baptist appeared on the banks of the Susquehanna River near Harmony Township, Susquehanna County, Pennsylvania as a resurrected being to Joseph Smith and Oliver Cowdery on May 15, 1829, and ordained them to the Aaronic Priesthood.[D&C 13]; D&C 27:7–8Joseph Smith History 1:68–72 According to LDS doctrine, John's ministry has operated in three dispensations: he was the last of the prophets under the law of Moses; he was the first of the New Testament prophets; and he was sent to confirm the Aaronic Priesthood in our day (the dispensation of the fulness of times). Mormons believe John's ministry was foretold by two prophets whose teachings are included in the Book of Mormon: Lehi and his son Nephi.\n\nGnosticism\n\nIn Gnosticism, John the Baptist was a \"personification\" of the Old Testament prophet Elijah. Elijah did not know the True God (as opposed to the Abrahamic God), and thus had to be reincarnated in Gnostic theology. As predicted by the Old Testament prophet Malachi, Elijah must \"come first\" to herald the coming of Jesus Christ. Modern anthroposophy concurs with the idea that the Baptist was a reincarnation of Elijah, (cf. Mark 9:11–13), Matthew 11:13–14, Luke 7:27 although the Gospel of John explicitly denies this (John 1:21).Sergei Prokofieff, The Mystery of John the Baptist and John the Evangelist Turning Point of Time: An Esoteric Study, Temple Lodge Publishing 2005, \n\nSyrian-Egyptian Gnosticism\n\nAmong the early Judeo-Christian Gnostics the Ebionites held that John, along with Jesus and James the Just – all of whom they revered – were vegetarians.J Verheyden, Epiphanius on the Ebionites, in The image of the Judaeo-Christians in ancient Jewish and Christian literature, eds Peter J. Tomson, Doris Lambers-Petry, , p. 188 \"The vegetarianism of John the Baptist and of Jesus is an important issue too in the Ebionite interpretation of the Christian life. \"Robert Eisenman (1997), James the Brother of Jesus, p. 240 – \"John (unlike Jesus) was both a ‘Rechabite’ or ‘Nazarite’ and vegetarian\", p. 264 – \"One suggestion is that John ate 'carobs'; there have been others. Epiphanius, in preserving what he calls 'the Ebionite Gospel', rails against the passage there claiming that John ate 'wild honey' and 'manna-like vegetarian cakes dipped in oil. ... John would have been one of those wilderness-dwelling, vegetable-eating persons\", p. 326 – \"They [the Nazerini] ate nothing but wild fruit milk and honey – probably the same food that John the Baptist also ate.\", p. 367 – \"We have already seen how in some traditions 'carobs' were said to have been the true composition of John's food.\", p. 403 – \"his [John's] diet was stems, roots and fruits. Like James and the other Nazirites/Rechabites, he is presented as a vegetarian ..\".James Tabor, The Jesus Dynasty p. 134 and footnotes p. 335, p. 134 – \"The Greek New Testament gospels says John's diet consisted of \"locusts and wild honey\" but an ancient Hebrew version of Matthew insists that \"locusts\" is a mistake in Greek for a related Hebrew word that means a cake of some type, made from a desert plant, similar to the \"manna\" that the ancient Israelites ate in the desert on the days of Moses.(ref 9) Jesus describes John as \"neither eating nor drinking,\" or \"neither eating bread nor drinking wine.\" Such phrases indicate the lifestyle of one who is strictly vegetarian, avoids even bread since it has to be processed from grain, and shuns all alcohol.(ref 10) The idea is that one would eat only what grows naturally.(ref 11) It was a way of avoiding all refinements of civilization.\" p. 102 – \"Probably the most interesting of the changes from the familiar New Testament accounts of Jesus comes in the Gospel of the Ebionites description of John the Baptist, who, evidently, like his successor Jesus, maintained a strictly vegetarian cuisine.\"James A. Kelhoffer, [https://books.google.com/books?iduzTcB8yMnrcC&printsec\nfrontcover&dqThe+diet+of+John+the+Baptist:+%22Locusts+and+wild+honey%22+in+synoptic+and+patristic+interpretation&source\nbl&ots7qzE9F71rT&sig\nmsJN2Zz51fxsZ79KQoVDvkl4Uos&hlen&ei\nzGCqTf63I43egQf2jqD0BQ&saX&oi\nbook_result&ctresult&resnum\n1&sqi2&ved\n0CBcQ6AEwAA#vonepage&q&f\nfalse The Diet of John the Baptist], , pp. 19–21 p. 104 – \"And when he had been brought to Archelaus and the doctors of the Law had assembled, they asked him who he is and where he has been until then. And to this he made answer and spake: I am pure; [for] the Spirit of God hath led me on, and [I live on] cane and roots and tree-food.\" Epiphanius of Salamis records that this group had amended their Gospel of Matthew, known today as the Gospel of the Ebionites, to change where John eats \"locusts\" to read \"honey cakes\" or \"manna\".Tabor (2006) Jesus Dynasty p. 334 (note 9) – \"The Gospel of the Ebionites as quoted by the 4th-century writer Epiphanius. The Greek word for locusts (akris) is very similar to the Greek word for \"honey cake\" (ekris) that is used for the \"manna\" that the Israelites ate in the desert in the days of Moses (Exodus 16:32)\" & p. 335 (note 11) – \"There is an old Russian (Slavic) version of Josephus's Antiquities that describes John the Baptizer as living on 'roots and fruits of the tree' and insists that he never touches bread, even at Passover.\" p. 13 – Referring to Epiphanius' quotation from the Gospel of the Ebionites in Panarion 30.13, \"And his food, it says, was wild honey whose taste was of manna, as cake in oil\".\n\nMandaeans \n\nJohn the Baptist is considered the chief prophet of the Mandaeans, and plays a large part in some of their writings,Oxford Dictionary of the Christian Church (Oxford University Press 2005 ), article Mandaeans including the Ginza Rba and the Draša D-Iahia (The Mandaean Book of John). They view John as the only true Messiah, and are opposed to Jesus. The Mandaean scriptures state: \"If the carpenter [Jesus] has joined together the god, who then has joined together the carpenter?\"\n\nIslam\n <!-- courtesy noe per WP:RSECT:. John the Baptist. http://en.wikipedia.org/?curid=16125."
  }
}
