{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14306",
  "eid" : "137bfff0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778541935,
  "textBody" : "The hammerhead sharks are a group of sharks in the family Sphyrnidae, so named for the unusual and distinctive structure of their heads, which are flattened and laterally extended into a \"hammer\" shape called a cephalofoil. Most hammerhead species are placed in the genus Sphyrna, while the winghead shark is placed in its own genus, Eusphyra. Many, but not necessarily mutually exclusive functions have been proposed for the cephalofoil, including sensory reception, manoeuvering, and prey manipulation. Hammerheads are found worldwide in warmer waters along coastlines and continental shelves. Unlike most sharks, hammerheads usually swim in schools during the day, becoming solitary hunters at night. Some of these schools can be found near Malpelo Island in Colombia, Cocos Island off Costa Rica, and near Molokai in Hawaii. Large schools are also seen in the waters off southern and eastern Africa.\n\nDescription\n\nThe known species range from  in length and weigh from 3 to.Hessing, S. (2000). [http://animaldiversity.ummz.umich.edu/accounts/Sphyrna_tiburo/ Sphyrna tiburo]. Animal Diversity Web. Retrieved on 2012-12-19. They are usually light gray and have a greenish tint. Their bellies are white which allows them to blend into the ocean when viewed from the bottom and sneak up on their prey.[http://www.sharks-world.com/hammerhead_shark.html Hammerhead Shark]. Sharks-world.com. Retrieved on 2012-12-19. Their heads have lateral projections which give them a hammer-like shape.\n\nHammerheads have disproportionately small mouths and seem to do a lot of bottom-hunting. They are also known to form schools during the day, sometimes in groups of over 100. In the evening, like other sharks, they become solitary hunters. National Geographic explains that hammerheads can be found in warm tropical waters, but during the summer, hammerheads participate in a mass migration to search for cooler waters.\n\nTaxonomy and evolution\n\nSince sharks do not have mineralized bones and rarely fossilize, their teeth alone are commonly found as fossils. The hammerheads seem closely related to the carcharhinid sharks that evolved during the mid-Tertiary period. According to DNA studies, the ancestor of the hammerheads probably lived in the Miocene epoch about 20 million years ago.\n\nUsing mitochondrial DNA, a phylogenetic tree of the hammerhead sharks showed the winghead shark as its most basal member. As the winghead shark has proportionately the largest \"hammer\" of the hammerhead sharks, this suggests that the first ancestral hammerhead sharks also had large hammers.\n\nCephalofoil \n\nThe theory has been advanced that the hammer-like shape of the head may have evolved (at least in part) to enhance the animal's vision.  The positioning of the eyes, mounted on the sides of the shark's distinctive hammer head, allows 360 degrees of vision in the vertical plane, meaning the animals can see above and below them at all times. The shape of the head was previously thought to help the shark find food, aiding in close-quarters maneuverability and allowing sharp turning movement without losing stability.  However, it has been found that the unusual structure of its vertebrae was instrumental in making the turns correctly, more often than the shape of its head, though it would also shift and provide lift.  From what is known about the winghead shark, the shape of the hammer-head apparently has to do with an evolved sensory function.  Like all sharks, hammerheads have electroreceptory sensory pores called ampullae of Lorenzini. The pores on the shark's head lead to sensory tubes, which detect electricity given off by other living creatures. By distributing the receptors over a wider area, like a larger radio antenna, hammerheads can sweep for prey more effectively.\n\nReproduction\n\nReproduction occurs only once a year for hammerhead sharks, and usually occurs with the male shark biting the female shark violently until she agrees to mate with him.[http://www.aquaticcommunity.com/sharkfish/hammerheadshark.php Hammerhead Shark]. Aquatic Community. Retrieved on 2012-12-19. The hammerhead sharks exhibit a viviparous mode of reproduction with females giving birth to live young. Like other sharks, fertilization is internal, with the male transferring sperm to the female through one of two intromittent organs called claspers. The developing embryos are at first sustained by a yolk sac. When the supply of yolk is exhausted, the depleted yolk sac transforms into a structure analogous to a mammalian placenta (called a \"yolk sac placenta\" or \"pseudoplacenta\"), through which the mother delivers sustenance until birth. Once the baby sharks are born, they are not taken care of by the parents in any way. Usually, a litter consists of 12 to 15 pups, except for the great hammerhead, which gives birth to litters of 20 to 40 pups. These baby sharks huddle together and swim toward warmer water until they are old enough and large enough to survive on their own.\n\nIn 2007, the bonnethead shark was found to be capable of asexual reproduction via automictic parthenogenesis, in which a female's ovum fuses with a polar body to form a zygote without the need for a male. This was the first shark known to do this.\n\nDiet\n\nHammerhead sharks are known to eat a large range of prey such as fish (including other sharks), squid, octopus and crustaceans . Stingrays are a particular favorite. These sharks are often found swimming along the bottom of the ocean, stalking their prey. Their unique heads are used as a weapon when hunting down prey. The hammerhead shark uses its head to pin down stingrays and eats the ray when the ray is weak and in shock. The great hammerhead, tending to be larger and more aggressive than most hammerheads, occasionally engages in cannibalism, eating other hammerhead sharks, including its own young. In addition to the typical animal prey, bonnetheads have been found to feed on seagrass, it sometimes making up as much as half their stomach content. They may swallow it by incident, but studies show that they are able to partially digest it. This is the only known case of a potentially omnivorous species of shark.\n\nSpecies \n\nRelationship with humans\n\nAccording to the International Shark Attack File, humans have been subject to 17 documented, unprovoked attacks by hammerhead sharks within the genus Sphyrna since 1580 AD. There have been no recorded human fatalities.\n\nThe great and the scalloped hammerheads are listed on the World Conservation Union's (IUCN) 2008 Red List as endangered, whereas the smalleye hammerhead is listed as vulnerable. The status given to these sharks is as a result of overfishing and demand for their fins, an expensive delicacy. Among others, scientists expressed their concern about the plight of the scalloped hammerhead at the American Association for the Advancement of Science annual meeting in Boston, Massachusetts. The young swim mostly in shallow waters along shores all over the world to avoid predators.\n\nShark fins are prized as a delicacy in certain countries in Asia (such as China), and overfishing is putting many hammerhead sharks at risk of extinction. Fishermen who harvest the animals typically cut off the fins and toss the remainder of the fish, which is often still alive, back into the sea. This practice, known as finning, is lethal to the shark.\n\nIn Native Hawaiian culture, sharks are considered to be gods of the sea, protectors of humans, and cleaners of excessive ocean life. Some of these sharks are believed to be family members who died and have been reincarnated into shark form. However, some sharks are considered man-eaters, also known as niuhi. These sharks include great white sharks, tiger sharks, and bull sharks. The hammerhead shark, also known as mano kihikihi, is not considered a man-eater or niuhi; it is considered to be one of the most respected sharks of the ocean, an aumakua. Many Hawaiian families believe that they have an aumakua watching over them and protecting them from the niuhi. The hammerhead shark is thought to be the birth animal of some children. Hawaiian children who are born with the hammerhead shark as an animal sign are believed to be warriors and are meant to sail the oceans. Hammerhead sharks rarely pass through the waters of Maui, but many Maui natives believe that hammerhead sharks swimming by is a sign that the gods are watching over the families, and the oceans are clean and balanced.[http://www.moolelo.com/shark-respected.html Sharks Highly respected in Hawaiian Culture]. Moolelo.com (2004-09-28). Retrieved on 2012-12-19.\n\nIn captivity \n\nThe relatively small bonnethead is regular at public aquariums as it has proven easier to keep in captivity than the larger hammerhead species, and it has been bred at a handful of facilities. Nevertheless, at up to  in length and with highly specialized requirements, very few private aquarists have the experience and resources necessary to maintain a bonnethead in captivity. The larger hammerhead species can reach more than twice that size and are considered difficult, even compared to most other similar-sized sharks (such as Carcharhinus species, lemon shark and sand tiger shark) regularly kept by public aquariums. They are particularly vulnerable during transport between facilities, may rub on surfaces in tanks and may collide with rocks causing injuries to their head; they therefore require very large specially adapted tanks. As a consequence, relatively few public aquariums have kept them for long periods. The scalloped hammerhead is the most frequently maintained large species and it has been kept long-term at public aquariums in most continents, but primarily in North America, Europe and Asia. In 2014, less than 15 public aquariums in the world kept scalloped hammerheads. Great hammerheads have been kept at a few facilities in North America, including Atlantis Paradise Island Resort (Bahamas), Adventure Aquarium (New Jersey), Georgia Aquarium (Atlanta), Mote Marine Laboratory (Florida), and the Shark Reef at Mandalay Bay (Las Vegas). Smooth hammerheads have also been kept in the past.\n\nProtection\n\nIn March 2013, three endangered commercially valuable sharks, the hammerheads, the oceanic whitetip, and porbeagle, were added to Appendix II of CITES, bringing shark fishing and commerce of these species under licensing and regulation.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hammerhead shark" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14306" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The hammerhead sharks are a group of sharks in the family Sphyrnidae, so named for the unusual and distinctive structure of their heads, which are flattened and laterally extended into a \"hammer\" shape called a cephalofoil. Most hammerhead species are placed in the genus Sphyrna, while the winghead shark is placed in its own genus, Eusphyra. Many, but not necessarily mutually exclusive functions have been proposed for the cephalofoil, including sensory reception, manoeuvering, and prey manipulation. Hammerheads are found worldwide in warmer waters along coastlines and continental shelves. Unlike most sharks, hammerheads usually swim in schools during the day, becoming solitary hunters at night. Some of these schools can be found near Malpelo Island in Colombia, Cocos Island off Costa Rica, and near Molokai in Hawaii. Large schools are also seen in the waters off southern and eastern Africa.\n\nDescription\n\nThe known species range from  in length and weigh from 3 to.Hessing, S. (2000). [http://animaldiversity.ummz.umich.edu/accounts/Sphyrna_tiburo/ Sphyrna tiburo]. Animal Diversity Web. Retrieved on 2012-12-19. They are usually light gray and have a greenish tint. Their bellies are white which allows them to blend into the ocean when viewed from the bottom and sneak up on their prey.[http://www.sharks-world.com/hammerhead_shark.html Hammerhead Shark]. Sharks-world.com. Retrieved on 2012-12-19. Their heads have lateral projections which give them a hammer-like shape.\n\nHammerheads have disproportionately small mouths and seem to do a lot of bottom-hunting. They are also known to form schools during the day, sometimes in groups of over 100. In the evening, like other sharks, they become solitary hunters. National Geographic explains that hammerheads can be found in warm tropical waters, but during the summer, hammerheads participate in a mass migration to search for cooler waters.\n\nTaxonomy and evolution\n\nSince sharks do not have mineralized bones and rarely fossilize, their teeth alone are commonly found as fossils. The hammerheads seem closely related to the carcharhinid sharks that evolved during the mid-Tertiary period. According to DNA studies, the ancestor of the hammerheads probably lived in the Miocene epoch about 20 million years ago.\n\nUsing mitochondrial DNA, a phylogenetic tree of the hammerhead sharks showed the winghead shark as its most basal member. As the winghead shark has proportionately the largest \"hammer\" of the hammerhead sharks, this suggests that the first ancestral hammerhead sharks also had large hammers.\n\nCephalofoil \n\nThe theory has been advanced that the hammer-like shape of the head may have evolved (at least in part) to enhance the animal's vision.  The positioning of the eyes, mounted on the sides of the shark's distinctive hammer head, allows 360 degrees of vision in the vertical plane, meaning the animals can see above and below them at all times. The shape of the head was previously thought to help the shark find food, aiding in close-quarters maneuverability and allowing sharp turning movement without losing stability.  However, it has been found that the unusual structure of its vertebrae was instrumental in making the turns correctly, more often than the shape of its head, though it would also shift and provide lift.  From what is known about the winghead shark, the shape of the hammer-head apparently has to do with an evolved sensory function.  Like all sharks, hammerheads have electroreceptory sensory pores called ampullae of Lorenzini. The pores on the shark's head lead to sensory tubes, which detect electricity given off by other living creatures. By distributing the receptors over a wider area, like a larger radio antenna, hammerheads can sweep for prey more effectively.\n\nReproduction\n\nReproduction occurs only once a year for hammerhead sharks, and usually occurs with the male shark biting the female shark violently until she agrees to mate with him.[http://www.aquaticcommunity.com/sharkfish/hammerheadshark.php Hammerhead Shark]. Aquatic Community. Retrieved on 2012-12-19. The hammerhead sharks exhibit a viviparous mode of reproduction with females giving birth to live young. Like other sharks, fertilization is internal, with the male transferring sperm to the female through one of two intromittent organs called claspers. The developing embryos are at first sustained by a yolk sac. When the supply of yolk is exhausted, the depleted yolk sac transforms into a structure analogous to a mammalian placenta (called a \"yolk sac placenta\" or \"pseudoplacenta\"), through which the mother delivers sustenance until birth. Once the baby sharks are born, they are not taken care of by the parents in any way. Usually, a litter consists of 12 to 15 pups, except for the great hammerhead, which gives birth to litters of 20 to 40 pups. These baby sharks huddle together and swim toward warmer water until they are old enough and large enough to survive on their own.\n\nIn 2007, the bonnethead shark was found to be capable of asexual reproduction via automictic parthenogenesis, in which a female's ovum fuses with a polar body to form a zygote without the need for a male. This was the first shark known to do this.\n\nDiet\n\nHammerhead sharks are known to eat a large range of prey such as fish (including other sharks), squid, octopus and crustaceans . Stingrays are a particular favorite. These sharks are often found swimming along the bottom of the ocean, stalking their prey. Their unique heads are used as a weapon when hunting down prey. The hammerhead shark uses its head to pin down stingrays and eats the ray when the ray is weak and in shock. The great hammerhead, tending to be larger and more aggressive than most hammerheads, occasionally engages in cannibalism, eating other hammerhead sharks, including its own young. In addition to the typical animal prey, bonnetheads have been found to feed on seagrass, it sometimes making up as much as half their stomach content. They may swallow it by incident, but studies show that they are able to partially digest it. This is the only known case of a potentially omnivorous species of shark.\n\nSpecies \n\nRelationship with humans\n\nAccording to the International Shark Attack File, humans have been subject to 17 documented, unprovoked attacks by hammerhead sharks within the genus Sphyrna since 1580 AD. There have been no recorded human fatalities.\n\nThe great and the scalloped hammerheads are listed on the World Conservation Union's (IUCN) 2008 Red List as endangered, whereas the smalleye hammerhead is listed as vulnerable. The status given to these sharks is as a result of overfishing and demand for their fins, an expensive delicacy. Among others, scientists expressed their concern about the plight of the scalloped hammerhead at the American Association for the Advancement of Science annual meeting in Boston, Massachusetts. The young swim mostly in shallow waters along shores all over the world to avoid predators.\n\nShark fins are prized as a delicacy in certain countries in Asia (such as China), and overfishing is putting many hammerhead sharks at risk of extinction. Fishermen who harvest the animals typically cut off the fins and toss the remainder of the fish, which is often still alive, back into the sea. This practice, known as finning, is lethal to the shark.\n\nIn Native Hawaiian culture, sharks are considered to be gods of the sea, protectors of humans, and cleaners of excessive ocean life. Some of these sharks are believed to be family members who died and have been reincarnated into shark form. However, some sharks are considered man-eaters, also known as niuhi. These sharks include great white sharks, tiger sharks, and bull sharks. The hammerhead shark, also known as mano kihikihi, is not considered a man-eater or niuhi; it is considered to be one of the most respected sharks of the ocean, an aumakua. Many Hawaiian families believe that they have an aumakua watching over them and protecting them from the niuhi. The hammerhead shark is thought to be the birth animal of some children. Hawaiian children who are born with the hammerhead shark as an animal sign are believed to be warriors and are meant to sail the oceans. Hammerhead sharks rarely pass through the waters of Maui, but many Maui natives believe that hammerhead sharks swimming by is a sign that the gods are watching over the families, and the oceans are clean and balanced.[http://www.moolelo.com/shark-respected.html Sharks Highly respected in Hawaiian Culture]. Moolelo.com (2004-09-28). Retrieved on 2012-12-19.\n\nIn captivity \n\nThe relatively small bonnethead is regular at public aquariums as it has proven easier to keep in captivity than the larger hammerhead species, and it has been bred at a handful of facilities. Nevertheless, at up to  in length and with highly specialized requirements, very few private aquarists have the experience and resources necessary to maintain a bonnethead in captivity. The larger hammerhead species can reach more than twice that size and are considered difficult, even compared to most other similar-sized sharks (such as Carcharhinus species, lemon shark and sand tiger shark) regularly kept by public aquariums. They are particularly vulnerable during transport between facilities, may rub on surfaces in tanks and may collide with rocks causing injuries to their head; they therefore require very large specially adapted tanks. As a consequence, relatively few public aquariums have kept them for long periods. The scalloped hammerhead is the most frequently maintained large species and it has been kept long-term at public aquariums in most continents, but primarily in North America, Europe and Asia. In 2014, less than 15 public aquariums in the world kept scalloped hammerheads. Great hammerheads have been kept at a few facilities in North America, including Atlantis Paradise Island Resort (Bahamas), Adventure Aquarium (New Jersey), Georgia Aquarium (Atlanta), Mote Marine Laboratory (Florida), and the Shark Reef at Mandalay Bay (Las Vegas). Smooth hammerheads have also been kept in the past.\n\nProtection\n\nIn March 2013, three endangered commercially valuable sharks, the hammerheads, the oceanic whitetip, and porbeagle, were added to Appendix II of CITES, bringing shark fishing and commerce of these species under licensing and regulation. Hammerhead shark. http://en.wikipedia.org/?curid=14306."
  }
}
