{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11141",
  "eid" : "f9d6c0d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778498909,
  "textBody" : "Events\n\n*747 BC – Epoch (origin) of Ptolemy's Nabonassar Era.\n* 364 – Valentinian I is proclaimed Roman emperor.\n*1233 – Mongol–Jin War: The Mongols capture Kaifeng, the capital of the Jin dynasty, after besieging it for months.\n*1266 – Battle of Benevento: An army led by Charles, Count of Anjou, defeats a combined German and Sicilian force led by Manfred, King of Sicily. Manfred is killed in the battle and Pope Clement IV invests Charles as king of Sicily and Naples.\n*1616 – Galileo Galilei is formally banned by the Roman Catholic Church from teaching or defending the view that the earth orbits the sun. \n*1794 – The first Christiansborg Palace in Copenhagen burns down.\n*1815 – Napoleon Bonaparte escapes from Elba.\n*1876 – Japan and Korea sign a treaty granting Japanese citizens extraterritoriality rights, opening three ports to Japanese trade, and ending Korea's status as a tributary state of Qing dynasty China.\n*1909 – Kinemacolor, the first successful color motion picture process, is first shown to the general public at the Palace Theatre in London.\n*1914 – , sister to the , is launched at Harland and Wolff shipyard in Belfast.\n*1919 – President Woodrow Wilson signs an act of Congress establishing the Grand Canyon National Park.\n*1929 – President Calvin Coolidge signs an executive order establishing the 96,000 acre Grand Teton National Park in Wyoming.\n*1935 – Adolf Hitler orders the Luftwaffe to be re-formed, violating the provisions of the Treaty of Versailles.\n*  1935   – Robert Watson-Watt carries out a demonstration near Daventry which leads directly to the development of radar in the United Kingdom.\n*1936 – In the February 26 Incident, young Japanese military officers attempt to stage a coup against the government.\n*1952 – Vincent Massey is sworn in as the first Canadian-born Governor General of Canada.\n*1960 – A New York-bound Alitalia airliner crashes into a cemetery in Shannon, Ireland, shortly after takeoff, killing 34 of the 52 persons on board.\n*1966 – Apollo program: Launch of AS-201, the first flight of the Saturn IB rocket\n*1971 – U.N. Secretary-General U Thant signs United Nations proclamation of the vernal equinox as Earth Day.\n*1979 – The Superliner railcar enters revenue service with Amtrak.\n*1980 – Egypt and Israel establish full diplomatic relations.\n*1987 – Iran–Contra affair: The Tower Commission rebukes President Ronald Reagan for not controlling his national security staff.\n*1992 – Nagorno-Karabakh War: Khojaly Massacre: Armenian armed forces open fire on Azeri civilians at a military post outside the town of Khojaly leaving hundreds dead.\n*1993 – 1993 World Trade Center bombing: In New York City, a truck bomb parked below the North Tower of the World Trade Center explodes, killing six and injuring over a thousand.\n*1995 – The UK's oldest investment banking institute, Barings Bank, collapses after a rogue securities broker Nick Leeson loses $1.4 billion by speculating on the Singapore International Monetary Exchange using futures contracts.\n*1996 – Keddies, the Southend-on-Sea department store closes it doors after 104 years of trading.\n*2008 – The New York Philharmonic performs in Pyongyang, North Korea; this is the first event of its kind to take place in North Korea.\n*2012 – A train derails in Burlington, Ontario, Canada killing at least three people and injuring 45.\n*2013 – A hot air balloon crashes near Luxor, Egypt, killing 19 people.\n\nBirths\n\n*1361 – Wenceslaus IV of Bohemia (d. 1419)\n*1416 – Christopher of Bavaria (d. 1448)\n*1564 – Christopher Marlowe, English playwright, poet and translator (d. 1593)\n*1584 – Albert VI, Duke of Bavaria (d. 1666)\n*1587 – Stefano Landi, Italian composer and educator (d. 1639)\n*1629 – Archibald Campbell, 9th Earl of Argyll, Scottish peer (d. 1685)\n*1671 – Anthony Ashley-Cooper, 3rd Earl of Shaftesbury, English philosopher and politician (d. 1713)\n*1672 – Antoine Augustin Calmet, French monk and theologian (d. 1757)\n*1677 – Nicola Fago, Italian composer and teacher (d. 1745)\n*1715 – Claude Adrien Helvétius, French philosopher (d. 1771)\n*1718 – Johan Ernst Gunnerus, Norwegian bishop, botanist and zoologist (d. 1773)\n*1720 – Gian Francesco Albani, Italian cardinal (d. 1803)\n*1746 – Archduchess Maria Amalia of Austria (d. 1806)\n*1770 – Anton Reicha, Bohemian composer and flautist (d. 1836)\n*1777 – Matija Nenadović, Serbian priest, historian, and politician, 1st Prime Minister of Serbia (d. 1854)\n*1786 – François Arago, French mathematician and politician, 25th Prime Minister of France (d. 1853)\n*1799 – Benoît Paul Émile Clapeyron, French physicist and engineer (d. 1864)\n*1802 – Victor Hugo, French author, poet, and playwright (d. 1885)\n*1808 – Honoré Daumier, French painter, illustrator, and sculptor (d. 1879)\n*  1808   – Nathan Kelley, American architect, designed the Ohio Statehouse (d. 1871)\n*1829 – Levi Strauss, German-American fashion designer, founded Levi Strauss & Co. (d. 1902)\n*1842 – Camille Flammarion, French astronomer and author (d. 1925)\n*1846 – Buffalo Bill, American soldier and hunter (d. 1917)\n*1852 – John Harvey Kellogg, American surgeon, co-created Corn flakes (d. 1943)\n*1857 – Émile Coué, French psychologist and pharmacist (d. 1926)\n*1861 – Ferdinand I of Bulgaria (d. 1948)\n*  1861   – Nadezhda Krupskaya, Russian soldier and politician (d. 1939)\n*1866 – Herbert Henry Dow, Canadian-American businessman, founded the Dow Chemical Company (d. 1930)\n*1877 – Rudolph Dirks, German-American illustrator (d. 1968)\n*1879 – Frank Bridge, English viola player and composer (d. 1941)\n*1880 – Kenneth Edgeworth, Irish astronomer (d. 1972)\n*1881 – Janus Djurhuus, Faroese poet (d. 1948)\n*1882 – Husband E. Kimmel, American admiral (d. 1968)\n*1885 – Aleksandras Stulginskis, Lithuanian farmer and politician, 2nd President of Lithuania (d. 1969)\n*1887 – Grover Cleveland Alexander, American baseball player and coach (d. 1950)\n*  1887   – William Frawley, American actor and vaudevillian (d. 1966)\n*  1887   – Stefan Grabiński, Polish author and educator (d. 1936)\n*1893 – Wallace Fard Muhammad, American religious leader, founded the Nation of Islam (disappeared 1934)\n*  1893   – Dorothy Whipple, English novelist (d. 1966)\n*1896 – Andrei Zhdanov, Ukrainian-Russian civil servant and politician (d. 1948)\n*1899 – Max Petitpierre, Swiss jurist and politician, 54th President of the Swiss Confederation (d. 1994)\n*1900 – Halina Konopacka, Polish discus thrower and poet (d. 1989) \n*  1900   – Fritz Wiessner, German-American mountaineer (d. 1988)\n*1902 – Jean Bruller, French author and illustrator, co-founded Les Éditions de Minuit (d. 1991)\n*1903 – Giulio Natta, Italian chemist and academic, Nobel Prize laureate (d. 1979)\n*  1903   – Orde Wingate, English general (d. 1944)\n*1906 – Madeleine Carroll, English actress (d. 1987)\n*1908 – Tex Avery, American animator, producer, and voice actor (d. 1980)\n*  1908   – Leela Majumdar, Indian author and academic (d. 2007)\n*  1908   – Jean-Pierre Wimille, French race car driver (d. 1949)\n*1909 – Fanny Cradock, English chef, author, and critic (d. 1994)\n*  1909   – Talal of Jordan (d. 1972)\n*1910 – Vic Woodley, English footballer (d. 1978)\n*1911 – Tarō Okamoto, Japanese painter and sculptor (d. 1996)\n*1912 – Dane Clark, American actor and director (d. 1998)\n*1913 – George Barker, English author and poet (d. 1991)\n*1914 – Robert Alda, American actor, singer, and director (d. 1986)\n*1916 – Jackie Gleason, American actor and singer (d. 1987)\n*1918 - Pyotr Masherov, Leader of Soviet Belarus from 1965 to 1980 (d. 1980)\n*1918 – Otis R. Bowen, American physician and politician, 44th Governor of Indiana (d. 2013)\n*  1918   – Theodore Sturgeon, American author and critic (d. 1985)\n*1919 – Mason Adams, American actor (d. 2005)\n*1920 – Danny Gardella, American baseball player and trainer (d. 2005)\n*  1920   – Tony Randall, American actor, director, and producer (d. 2004)\n*  1920   – Lucjan Wolanowski, Polish journalist and author (d. 2006)\n*1921 – Betty Hutton, American actress and singer (d. 2007)\n*1922 – Bill Johnston, Australian cricketer and businessman (d. 2007)\n*  1922   – Margaret Leighton, English actress (d. 1976)\n*1924 – Noboru Takeshita, Japanese soldier and politician, 74th Prime Minister of Japan (d. 2000)\n*  1924   – Marc Bucci, American composer, lyricist, and dramatist (d. 2002)\n*1925 – Everton Weekes, Barbadian cricketer and referee\n*1926 – Doris Belack, American actress (d. 2011)\n*  1926   – Verne Gagne, American football player, wrestler, and trainer (d. 2015)\n*1927 – Tom Kennedy, American game show host and actor\n*1928 – Fats Domino, American singer-songwriter and pianist (d. 2017)\n*  1928   – Ariel Sharon, Israeli general and politician, 11th Prime Minister of Israel (d. 2014)\n*1931 – Ally MacLeod, Scottish footballer and manager (d. 2004)\n*  1931   – Robert Novak, American journalist and author (d. 2009)\n*1932 – Johnny Cash, American singer-songwriter, guitarist, and actor (d. 2003)\n*1933 – James Goldsmith, French-British businessman and politician (d. 1997)\n*1934 – Mohammed Lakhdar-Hamina, Algerian director, producer, and screenwriter\n*1936 – José Policarpo, Portuguese cardinal (d. 2014)\n*1937 – Paul Dickson, American football player and coach (d. 2011)\n*1939 – Josephine Tewson, English actress\n*1940 – Oldřich Kulhánek, Czech painter, illustrator, and stage designer (d. 2013)\n*1942 – Jozef Adamec, Slovak footballer and manager\n*1943 – Paul Cotton, American singer-songwriter and guitarist\n*  1943   – Bill Duke, American actor and director\n*  1943   – Dante Ferretti, Italian art director and costume designer\n*  1943   – Bob \"The Bear\" Hite, American singer-songwriter and musician (d. 1981)\n*1944 – Christopher Hope, South African author and poet\n*  1944   – Ronald Lauder, American businessman and diplomat, United States Ambassador to Austria\n*1945 – Peter Brock, Australian race car driver (d. 2006)\n*  1945   – Marta Kristen, Norwegian-American actress\n*  1945   – Mitch Ryder, American singer-songwriter and guitarist\n*1946 – Colin Bell, English footballer\n*  1946   – Ahmed Zewail, Egyptian-American chemist and academic, Nobel Prize laureate (d. 2016)\n*1947 – Sandie Shaw, English singer and psychotherapist\n*1948 – Sharyn McCrumb, American author\n*1949 – Simon Crean, Australian trade union leader and politician, 14th Australian Minister for the Arts\n*  1949   – Elizabeth George, American author and educator\n*  1949   – Emma Kirkby, English soprano\n*1950 – Jonathan Cain, American singer-songwriter, keyboard player, and producer \n*  1950   – Helen Clark, New Zealand academic and politician, 37th Prime Minister of New Zealand\n*1951 – Steve Bell, English cartoonist\n*  1951   – Wayne Goss, Australian lawyer and politician, 34th Premier of Queensland (d. 2014)\n*1953 – Michael Bolton, American singer-songwriter and actor \n*1954 – Prince Ernst August of Hanover\n*  1954   – Recep Tayyip Erdoğan, Turkish politician, 12th President of Turkey\n*1955 – Andreas Maislinger, Austrian historian and academic, founded the Austrian Holocaust Memorial Service\n*1956 – Michel Houellebecq, French author, poet, screenwriter, and director\n*1957 – David Beasley, American lawyer and politician, 113th Governor of South Carolina\n*  1957   – Joe Mullen, American ice hockey player and coach\n*  1957   – Keena Rothhammer, American swimmer\n*1958 – Paul Ackford, English rugby player\n*  1958   – Greg Germann, American actor and director\n*  1958   – Susan Helms, American general, engineer, and astronaut\n*  1958   – Tim Kaine, American lawyer and politician, 70th Governor of Virginia\n*1959 – Rolando Blackman, American basketball player and coach\n*  1959   – Ahmet Davutoğlu, Turkish political scientist, academic, and politician, 37th Prime Minister of Turkey\n*1960 – Jaz Coleman, English singer-songwriter, keyboard player, and producer\n*1962 – Ahn Cheol-soo, South Korean physician, academic, and politician\n*1965 – James Mitchell, American wrestler and manager\n*1966 – Garry Conille, Haitian physician and politician, 14th Prime Minister of Haiti\n*  1966   – Marc Fortier, French-Canadian ice hockey player\n*  1966   –  Najwa Karam, Lebanese singer.\n*1967 – Mark Carroll, Australian rugby league player\n*  1967   – Kazuyoshi Miura, Japanese footballer\n*1969 – Hitoshi Sakimoto, Japanese composer and producer\n*1970 – Mark Harper, English accountant and politician, Minister of State for Immigration\n*1971 – Erykah Badu, American singer-songwriter, producer, and actress \n*  1971   – Max Martin, Swedish-American record producer and songwriter\n*  1971   – Hélène Segara, French singer-songwriter and actress\n*1973 – Marshall Faulk, American football player\n*  1973   – Ole Gunnar Solskjær, Norwegian footballer and manager\n*  1973   – Jenny Thompson, American swimmer\n*1974 – Sébastien Loeb, French race car driver\n*  1974   – Mikee Cojuangco-Jaworski, Filipina television actress, host and equestrienne\n*1976 – Nalini Anantharaman, French mathematician\n*  1976   – Chad Urmston, American singer-songwriter and guitarist \n*1977 – Marty Reasoner, American ice hockey player and coach\n*  1977   – Tim Thomas, American basketball player\n*  1977   – Shane Williams, Welsh rugby union player \n*1978 – Abdoulaye Faye, Senegalese footballer\n*1979 – Corinne Bailey Rae, English singer-songwriter and guitarist\n*  1979   – Steve Evans, Welsh footballer\n*  1979   – Pedro Mendes, Portuguese footballer\n*1980 – Steve Blake, American basketball player\n*1981 – Kertus Davis, American race car driver\n*  1981   – Oh Seung-bum, South Korean footballer\n*1982 – Li Na, Chinese tennis player\n*  1982   – Matt Prior, South African-English cricketer\n*  1982   – Nate Ruess, American singer-songwriter \n*1983 – Jerome Harrison, American football player\n*  1983   – Pepe, Brazilian-Portuguese footballer\n*1984 – Emmanuel Adebayor, Togolese footballer\n*  1984   – Natalia Lafourcade, Mexican singer-songwriter\n*  1984   – Beren Saat, Turkish actress\n*1985 – Fernando Llorente, Spanish footballer\n*1986 – Hannah Kearney, American skier\n*1989 – Gabriel Obertan, French footballer\n*1990 – Kateřina Cachová, Czech heptathlete\n*  1990   – Takanoiwa Yoshimori, Mongolian sumo wrestler\n*1992 – Mikael Granlund, Finnish professional hockey player\n*1992 – Michael Chee Kam, New Zealand rugby league player\n*1997 – Reghan Tumilty, Scottish footballer\n\nDeaths\n\n* 420 – Porphyry of Gaza, Greek bishop and saint (b. 347)\n* 943 – Muirchertach mac Néill, king of Ailech (Ireland)\n*1154 – Roger II of Sicily (b. 1093)\n*1266 – Manfred, King of Sicily (b. 1232)\n*1275 – Margaret of England, Queen consort of Scots (b. 1240)\n*1360 – Roger Mortimer, 2nd Earl of March, English commander (b. 1328)\n*1462 – John de Vere, 12th Earl of Oxford, English politician (b. 1408)\n*1548 – Lorenzino de' Medici, Italian writer and assassin (b. 1514)\n*1577 – Eric XIV of Sweden (b. 1533)\n*1603 – Maria of Austria, Holy Roman Empress, spouse of Maximilian II (b. 1528)\n*1608 – John Still, English bishop (b. 1543)\n*1611 – Antonio Possevino, Italian priest and diplomat (b. 1533)\n*1625 – Anna Vasa of Sweden, Polish and Swedish princess (b. 1568)\n*1630 – William Brade, English violinist and composer (b. 1560)\n*1638 – Claude Gaspard Bachet de Méziriac, French mathematician and linguist (b. 1581)\n*1723 – Thomas d'Urfey, English poet and playwright (b. 1653)\n*1726 – Maximilian II Emanuel, Elector of Bavaria (b. 1662)\n*1770 – Giuseppe Tartini, Italian violinist and composer (b. 1692)\n*1790 – Joshua Rowley, English admiral (b. 1730)\n*1802 – Esek Hopkins, American admiral (b. 1718)\n*1813 – Robert R. Livingston, American lawyer and politician, 1st United States Secretary of Foreign Affairs (b. 1746)\n*1815 – Prince Josias of Saxe-Coburg-Saalfeld (b. 1737)\n*1821 – Joseph de Maistre, French lawyer and diplomat (b. 1753)\n*1864 – Louis-Hippolyte Lafontaine, Canadian jurist and politician, 3rd Premier of Canada East (b. 1807)\n*1883 – Alexandros Koumoundouros, Greek lawyer and politician, 56th Prime Minister of Greece (b. 1817)\n*1887 – Anandi Gopal Joshi, Indian physician (b. 1865)\n*1889 – Karl Davydov, Russian cellist and composer (b. 1838)\n*1903 – Richard Jordan Gatling, American engineer, invented the Gatling gun (b. 1818)\n*1913 – Felix Draeseke, German composer and academic (b. 1835)\n*1921 – Carl Menger, Polish-Austrian economist and academic (b. 1840)\n*1930 – Mary Whiton Calkins, American philosopher and psychologist (b. 1863)\n*1931 – Otto Wallach, German chemist and academic, Nobel Prize laureate (b. 1847)\n*1936 – February 26 Incident:\n**Takahashi Korekiyo, Japanese accountant and politician, 20th Prime Minister of Japan (b. 1854)\n**Saitō Makoto, Japanese admiral and politician, 30th Prime Minister of Japan (b. 1858)\n**Jōtarō Watanabe, Japanese general (b. 1874)\n*1943 – Theodor Eicke, German general (b. 1892)\n*1947 – Heinrich Häberlin, Swiss judge and politician, President of the Swiss National Council (b. 1868)\n*1950 – Harry Lauder, Scottish comedian and singer (b. 1870)\n*1952 – Theodoros Pangalos, Greek general and politician, President of Greece (b. 1878)\n*1961 – Karl Albiker, German sculptor, lithographer, and educator (b. 1878)\n*  1961   – Mohammed V of Morocco (b. 1909)\n*1966 – Vinayak Damodar Savarkar, Indian poet and politician (b. 1883)\n*1969 – Levi Eshkol, Israeli soldier and politician, 3rd Prime Minister of Israel (b. 1895)\n*  1969   – Karl Jaspers, German-Swiss psychiatrist and philosopher (b. 1883)\n*1981 – Robert Aickman, English author and activist (b. 1914)\n*  1981   – Howard Hanson, American composer, conductor, and educator (b. 1896)\n*1985 – Tjalling Koopmans, Dutch-American economist and mathematician, Nobel Prize laureate (b. 1910)\n*1989 – Roy Eldridge, American trumpet player (b. 1911)\n*1993 – Constance Ford, American model and actress (b. 1923)\n*1994 – Bill Hicks, American comedian (b. 1961)\n*1995 – Jack Clayton, English director and producer (b. 1921)\n*1997 – David Doyle, American actor (b. 1929)\n*1998 – Theodore Schultz, American economist and academic, Nobel Prize laureate (b. 1902)\n*2000 – George L. Street III, American captain, Medal of Honor recipient (b. 1913)\n*2002 – Lawrence Tierney, American actor (b. 1919)\n*2004 – Shankarrao Chavan, Indian politician, Indian Minister of Finance (b. 1920)\n*  2004   – Adolf Ehrnrooth, Finnish general (b. 1905)\n*  2004   – Boris Trajkovski, Macedonian politician, 2nd President of the Republic of Macedonia (b. 1956)\n*2005 – Jef Raskin, American computer scientist, created Macintosh (b. 1943)\n*2008 – Bodil Udsen, Danish actress (b. 1925)\n*2009 – Johnny Kerr, American basketball player, coach, and sportscaster (b. 1932)\n*  2009 – Wendy Richard, English actress (b. 1943)\n*  2009 – Norm Van Lier, American basketball player, coach, and sportscaster (b. 1947)\n*  2010 – Jun Seba, also known as \"Nujabes\", Japanese record producer, DJ, composer and arranger (b. 1974)\n*2011 – Arnošt Lustig, Czech author, playwright, and screenwriter (b. 1926)\n*2012 – Richard Carpenter, English actor and screenwriter (b. 1929)\n*2013 – Marie-Claire Alain, French organist and educator (b. 1926)\n*  2013   – Stéphane Hessel, German-French diplomat and author (b. 1917)\n*  2013   – Simon Li, Hong Kong judge and politician (b. 1922)\n*2014 – Sorel Etrog, Romanian-Canadian sculptor, painter, and illustrator (b. 1933)\n*  2014   – Phyllis Krasilovsky, American author and academic (b. 1927)\n*2015 – Sheppard Frere, English historian and archaeologist (b. 1916)\n*  2015   – Theodore Hesburgh, American priest, theologian, educator, and academic (b. 1917)\n*  2015   – Earl Lloyd, American basketball player and coach (b. 1928)\n*  2015   – Tom Schweich, American lawyer and politician, 36th State Auditor of Missouri (b. 1960)\n*2016 – Andy Bathgate, Canadian ice hockey player, coach, and manager (b. 1932)\n*  2016   – Don Getty, Canadian football player and politician, 11th Premier of Alberta (b. 1933)\n*2017 – Joseph Wapner, American lieutenant and judge (b. 1919)\n\nHolidays and observances\n\n*Christian feast day:\n**Alexander of Alexandria\n**Emily Malbone Morgan (Episcopal Church (USA))\n**Isabelle of France\n**Li Tim-Oi (Anglican Church of Canada)\n**Porphyry of Gaza\n**February 26 (Eastern Orthodox liturgics)\n*The first day of Ayyám-i-Há (Bahá'í Faith) (Please note that this observance is only locked into this date the Gregorian calendar on this date if Bahá'í Naw-Rúz takes place on March 21, which it doesn't in all years)\n*Day of Remembrance for Victims of Khojaly Massacre (Azerbaijan)\n*Liberation Day (Kuwait)\n*National Wear Red Day (United Kingdom, until 2016) \n*Saviours' Day (Nation of Islam)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "February 26" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11141" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*747 BC – Epoch (origin) of Ptolemy's Nabonassar Era.\n* 364 – Valentinian I is proclaimed Roman emperor.\n*1233 – Mongol–Jin War: The Mongols capture Kaifeng, the capital of the Jin dynasty, after besieging it for months.\n*1266 – Battle of Benevento: An army led by Charles, Count of Anjou, defeats a combined German and Sicilian force led by Manfred, King of Sicily. Manfred is killed in the battle and Pope Clement IV invests Charles as king of Sicily and Naples.\n*1616 – Galileo Galilei is formally banned by the Roman Catholic Church from teaching or defending the view that the earth orbits the sun. \n*1794 – The first Christiansborg Palace in Copenhagen burns down.\n*1815 – Napoleon Bonaparte escapes from Elba.\n*1876 – Japan and Korea sign a treaty granting Japanese citizens extraterritoriality rights, opening three ports to Japanese trade, and ending Korea's status as a tributary state of Qing dynasty China.\n*1909 – Kinemacolor, the first successful color motion picture process, is first shown to the general public at the Palace Theatre in London.\n*1914 – , sister to the , is launched at Harland and Wolff shipyard in Belfast.\n*1919 – President Woodrow Wilson signs an act of Congress establishing the Grand Canyon National Park.\n*1929 – President Calvin Coolidge signs an executive order establishing the 96,000 acre Grand Teton National Park in Wyoming.\n*1935 – Adolf Hitler orders the Luftwaffe to be re-formed, violating the provisions of the Treaty of Versailles.\n*  1935   – Robert Watson-Watt carries out a demonstration near Daventry which leads directly to the development of radar in the United Kingdom.\n*1936 – In the February 26 Incident, young Japanese military officers attempt to stage a coup against the government.\n*1952 – Vincent Massey is sworn in as the first Canadian-born Governor General of Canada.\n*1960 – A New York-bound Alitalia airliner crashes into a cemetery in Shannon, Ireland, shortly after takeoff, killing 34 of the 52 persons on board.\n*1966 – Apollo program: Launch of AS-201, the first flight of the Saturn IB rocket\n*1971 – U.N. Secretary-General U Thant signs United Nations proclamation of the vernal equinox as Earth Day.\n*1979 – The Superliner railcar enters revenue service with Amtrak.\n*1980 – Egypt and Israel establish full diplomatic relations.\n*1987 – Iran–Contra affair: The Tower Commission rebukes President Ronald Reagan for not controlling his national security staff.\n*1992 – Nagorno-Karabakh War: Khojaly Massacre: Armenian armed forces open fire on Azeri civilians at a military post outside the town of Khojaly leaving hundreds dead.\n*1993 – 1993 World Trade Center bombing: In New York City, a truck bomb parked below the North Tower of the World Trade Center explodes, killing six and injuring over a thousand.\n*1995 – The UK's oldest investment banking institute, Barings Bank, collapses after a rogue securities broker Nick Leeson loses $1.4 billion by speculating on the Singapore International Monetary Exchange using futures contracts.\n*1996 – Keddies, the Southend-on-Sea department store closes it doors after 104 years of trading.\n*2008 – The New York Philharmonic performs in Pyongyang, North Korea; this is the first event of its kind to take place in North Korea.\n*2012 – A train derails in Burlington, Ontario, Canada killing at least three people and injuring 45.\n*2013 – A hot air balloon crashes near Luxor, Egypt, killing 19 people.\n\nBirths\n\n*1361 – Wenceslaus IV of Bohemia (d. 1419)\n*1416 – Christopher of Bavaria (d. 1448)\n*1564 – Christopher Marlowe, English playwright, poet and translator (d. 1593)\n*1584 – Albert VI, Duke of Bavaria (d. 1666)\n*1587 – Stefano Landi, Italian composer and educator (d. 1639)\n*1629 – Archibald Campbell, 9th Earl of Argyll, Scottish peer (d. 1685)\n*1671 – Anthony Ashley-Cooper, 3rd Earl of Shaftesbury, English philosopher and politician (d. 1713)\n*1672 – Antoine Augustin Calmet, French monk and theologian (d. 1757)\n*1677 – Nicola Fago, Italian composer and teacher (d. 1745)\n*1715 – Claude Adrien Helvétius, French philosopher (d. 1771)\n*1718 – Johan Ernst Gunnerus, Norwegian bishop, botanist and zoologist (d. 1773)\n*1720 – Gian Francesco Albani, Italian cardinal (d. 1803)\n*1746 – Archduchess Maria Amalia of Austria (d. 1806)\n*1770 – Anton Reicha, Bohemian composer and flautist (d. 1836)\n*1777 – Matija Nenadović, Serbian priest, historian, and politician, 1st Prime Minister of Serbia (d. 1854)\n*1786 – François Arago, French mathematician and politician, 25th Prime Minister of France (d. 1853)\n*1799 – Benoît Paul Émile Clapeyron, French physicist and engineer (d. 1864)\n*1802 – Victor Hugo, French author, poet, and playwright (d. 1885)\n*1808 – Honoré Daumier, French painter, illustrator, and sculptor (d. 1879)\n*  1808   – Nathan Kelley, American architect, designed the Ohio Statehouse (d. 1871)\n*1829 – Levi Strauss, German-American fashion designer, founded Levi Strauss & Co. (d. 1902)\n*1842 – Camille Flammarion, French astronomer and author (d. 1925)\n*1846 – Buffalo Bill, American soldier and hunter (d. 1917)\n*1852 – John Harvey Kellogg, American surgeon, co-created Corn flakes (d. 1943)\n*1857 – Émile Coué, French psychologist and pharmacist (d. 1926)\n*1861 – Ferdinand I of Bulgaria (d. 1948)\n*  1861   – Nadezhda Krupskaya, Russian soldier and politician (d. 1939)\n*1866 – Herbert Henry Dow, Canadian-American businessman, founded the Dow Chemical Company (d. 1930)\n*1877 – Rudolph Dirks, German-American illustrator (d. 1968)\n*1879 – Frank Bridge, English viola player and composer (d. 1941)\n*1880 – Kenneth Edgeworth, Irish astronomer (d. 1972)\n*1881 – Janus Djurhuus, Faroese poet (d. 1948)\n*1882 – Husband E. Kimmel, American admiral (d. 1968)\n*1885 – Aleksandras Stulginskis, Lithuanian farmer and politician, 2nd President of Lithuania (d. 1969)\n*1887 – Grover Cleveland Alexander, American baseball player and coach (d. 1950)\n*  1887   – William Frawley, American actor and vaudevillian (d. 1966)\n*  1887   – Stefan Grabiński, Polish author and educator (d. 1936)\n*1893 – Wallace Fard Muhammad, American religious leader, founded the Nation of Islam (disappeared 1934)\n*  1893   – Dorothy Whipple, English novelist (d. 1966)\n*1896 – Andrei Zhdanov, Ukrainian-Russian civil servant and politician (d. 1948)\n*1899 – Max Petitpierre, Swiss jurist and politician, 54th President of the Swiss Confederation (d. 1994)\n*1900 – Halina Konopacka, Polish discus thrower and poet (d. 1989) \n*  1900   – Fritz Wiessner, German-American mountaineer (d. 1988)\n*1902 – Jean Bruller, French author and illustrator, co-founded Les Éditions de Minuit (d. 1991)\n*1903 – Giulio Natta, Italian chemist and academic, Nobel Prize laureate (d. 1979)\n*  1903   – Orde Wingate, English general (d. 1944)\n*1906 – Madeleine Carroll, English actress (d. 1987)\n*1908 – Tex Avery, American animator, producer, and voice actor (d. 1980)\n*  1908   – Leela Majumdar, Indian author and academic (d. 2007)\n*  1908   – Jean-Pierre Wimille, French race car driver (d. 1949)\n*1909 – Fanny Cradock, English chef, author, and critic (d. 1994)\n*  1909   – Talal of Jordan (d. 1972)\n*1910 – Vic Woodley, English footballer (d. 1978)\n*1911 – Tarō Okamoto, Japanese painter and sculptor (d. 1996)\n*1912 – Dane Clark, American actor and director (d. 1998)\n*1913 – George Barker, English author and poet (d. 1991)\n*1914 – Robert Alda, American actor, singer, and director (d. 1986)\n*1916 – Jackie Gleason, American actor and singer (d. 1987)\n*1918 - Pyotr Masherov, Leader of Soviet Belarus from 1965 to 1980 (d. 1980)\n*1918 – Otis R. Bowen, American physician and politician, 44th Governor of Indiana (d. 2013)\n*  1918   – Theodore Sturgeon, American author and critic (d. 1985)\n*1919 – Mason Adams, American actor (d. 2005)\n*1920 – Danny Gardella, American baseball player and trainer (d. 2005)\n*  1920   – Tony Randall, American actor, director, and producer (d. 2004)\n*  1920   – Lucjan Wolanowski, Polish journalist and author (d. 2006)\n*1921 – Betty Hutton, American actress and singer (d. 2007)\n*1922 – Bill Johnston, Australian cricketer and businessman (d. 2007)\n*  1922   – Margaret Leighton, English actress (d. 1976)\n*1924 – Noboru Takeshita, Japanese soldier and politician, 74th Prime Minister of Japan (d. 2000)\n*  1924   – Marc Bucci, American composer, lyricist, and dramatist (d. 2002)\n*1925 – Everton Weekes, Barbadian cricketer and referee\n*1926 – Doris Belack, American actress (d. 2011)\n*  1926   – Verne Gagne, American football player, wrestler, and trainer (d. 2015)\n*1927 – Tom Kennedy, American game show host and actor\n*1928 – Fats Domino, American singer-songwriter and pianist (d. 2017)\n*  1928   – Ariel Sharon, Israeli general and politician, 11th Prime Minister of Israel (d. 2014)\n*1931 – Ally MacLeod, Scottish footballer and manager (d. 2004)\n*  1931   – Robert Novak, American journalist and author (d. 2009)\n*1932 – Johnny Cash, American singer-songwriter, guitarist, and actor (d. 2003)\n*1933 – James Goldsmith, French-British businessman and politician (d. 1997)\n*1934 – Mohammed Lakhdar-Hamina, Algerian director, producer, and screenwriter\n*1936 – José Policarpo, Portuguese cardinal (d. 2014)\n*1937 – Paul Dickson, American football player and coach (d. 2011)\n*1939 – Josephine Tewson, English actress\n*1940 – Oldřich Kulhánek, Czech painter, illustrator, and stage designer (d. 2013)\n*1942 – Jozef Adamec, Slovak footballer and manager\n*1943 – Paul Cotton, American singer-songwriter and guitarist\n*  1943   – Bill Duke, American actor and director\n*  1943   – Dante Ferretti, Italian art director and costume designer\n*  1943   – Bob \"The Bear\" Hite, American singer-songwriter and musician (d. 1981)\n*1944 – Christopher Hope, South African author and poet\n*  1944   – Ronald Lauder, American businessman and diplomat, United States Ambassador to Austria\n*1945 – Peter Brock, Australian race car driver (d. 2006)\n*  1945   – Marta Kristen, Norwegian-American actress\n*  1945   – Mitch Ryder, American singer-songwriter and guitarist\n*1946 – Colin Bell, English footballer\n*  1946   – Ahmed Zewail, Egyptian-American chemist and academic, Nobel Prize laureate (d. 2016)\n*1947 – Sandie Shaw, English singer and psychotherapist\n*1948 – Sharyn McCrumb, American author\n*1949 – Simon Crean, Australian trade union leader and politician, 14th Australian Minister for the Arts\n*  1949   – Elizabeth George, American author and educator\n*  1949   – Emma Kirkby, English soprano\n*1950 – Jonathan Cain, American singer-songwriter, keyboard player, and producer \n*  1950   – Helen Clark, New Zealand academic and politician, 37th Prime Minister of New Zealand\n*1951 – Steve Bell, English cartoonist\n*  1951   – Wayne Goss, Australian lawyer and politician, 34th Premier of Queensland (d. 2014)\n*1953 – Michael Bolton, American singer-songwriter and actor \n*1954 – Prince Ernst August of Hanover\n*  1954   – Recep Tayyip Erdoğan, Turkish politician, 12th President of Turkey\n*1955 – Andreas Maislinger, Austrian historian and academic, founded the Austrian Holocaust Memorial Service\n*1956 – Michel Houellebecq, French author, poet, screenwriter, and director\n*1957 – David Beasley, American lawyer and politician, 113th Governor of South Carolina\n*  1957   – Joe Mullen, American ice hockey player and coach\n*  1957   – Keena Rothhammer, American swimmer\n*1958 – Paul Ackford, English rugby player\n*  1958   – Greg Germann, American actor and director\n*  1958   – Susan Helms, American general, engineer, and astronaut\n*  1958   – Tim Kaine, American lawyer and politician, 70th Governor of Virginia\n*1959 – Rolando Blackman, American basketball player and coach\n*  1959   – Ahmet Davutoğlu, Turkish political scientist, academic, and politician, 37th Prime Minister of Turkey\n*1960 – Jaz Coleman, English singer-songwriter, keyboard player, and producer\n*1962 – Ahn Cheol-soo, South Korean physician, academic, and politician\n*1965 – James Mitchell, American wrestler and manager\n*1966 – Garry Conille, Haitian physician and politician, 14th Prime Minister of Haiti\n*  1966   – Marc Fortier, French-Canadian ice hockey player\n*  1966   –  Najwa Karam, Lebanese singer.\n*1967 – Mark Carroll, Australian rugby league player\n*  1967   – Kazuyoshi Miura, Japanese footballer\n*1969 – Hitoshi Sakimoto, Japanese composer and producer\n*1970 – Mark Harper, English accountant and politician, Minister of State for Immigration\n*1971 – Erykah Badu, American singer-songwriter, producer, and actress \n*  1971   – Max Martin, Swedish-American record producer and songwriter\n*  1971   – Hélène Segara, French singer-songwriter and actress\n*1973 – Marshall Faulk, American football player\n*  1973   – Ole Gunnar Solskjær, Norwegian footballer and manager\n*  1973   – Jenny Thompson, American swimmer\n*1974 – Sébastien Loeb, French race car driver\n*  1974   – Mikee Cojuangco-Jaworski, Filipina television actress, host and equestrienne\n*1976 – Nalini Anantharaman, French mathematician\n*  1976   – Chad Urmston, American singer-songwriter and guitarist \n*1977 – Marty Reasoner, American ice hockey player and coach\n*  1977   – Tim Thomas, American basketball player\n*  1977   – Shane Williams, Welsh rugby union player \n*1978 – Abdoulaye Faye, Senegalese footballer\n*1979 – Corinne Bailey Rae, English singer-songwriter and guitarist\n*  1979   – Steve Evans, Welsh footballer\n*  1979   – Pedro Mendes, Portuguese footballer\n*1980 – Steve Blake, American basketball player\n*1981 – Kertus Davis, American race car driver\n*  1981   – Oh Seung-bum, South Korean footballer\n*1982 – Li Na, Chinese tennis player\n*  1982   – Matt Prior, South African-English cricketer\n*  1982   – Nate Ruess, American singer-songwriter \n*1983 – Jerome Harrison, American football player\n*  1983   – Pepe, Brazilian-Portuguese footballer\n*1984 – Emmanuel Adebayor, Togolese footballer\n*  1984   – Natalia Lafourcade, Mexican singer-songwriter\n*  1984   – Beren Saat, Turkish actress\n*1985 – Fernando Llorente, Spanish footballer\n*1986 – Hannah Kearney, American skier\n*1989 – Gabriel Obertan, French footballer\n*1990 – Kateřina Cachová, Czech heptathlete\n*  1990   – Takanoiwa Yoshimori, Mongolian sumo wrestler\n*1992 – Mikael Granlund, Finnish professional hockey player\n*1992 – Michael Chee Kam, New Zealand rugby league player\n*1997 – Reghan Tumilty, Scottish footballer\n\nDeaths\n\n* 420 – Porphyry of Gaza, Greek bishop and saint (b. 347)\n* 943 – Muirchertach mac Néill, king of Ailech (Ireland)\n*1154 – Roger II of Sicily (b. 1093)\n*1266 – Manfred, King of Sicily (b. 1232)\n*1275 – Margaret of England, Queen consort of Scots (b. 1240)\n*1360 – Roger Mortimer, 2nd Earl of March, English commander (b. 1328)\n*1462 – John de Vere, 12th Earl of Oxford, English politician (b. 1408)\n*1548 – Lorenzino de' Medici, Italian writer and assassin (b. 1514)\n*1577 – Eric XIV of Sweden (b. 1533)\n*1603 – Maria of Austria, Holy Roman Empress, spouse of Maximilian II (b. 1528)\n*1608 – John Still, English bishop (b. 1543)\n*1611 – Antonio Possevino, Italian priest and diplomat (b. 1533)\n*1625 – Anna Vasa of Sweden, Polish and Swedish princess (b. 1568)\n*1630 – William Brade, English violinist and composer (b. 1560)\n*1638 – Claude Gaspard Bachet de Méziriac, French mathematician and linguist (b. 1581)\n*1723 – Thomas d'Urfey, English poet and playwright (b. 1653)\n*1726 – Maximilian II Emanuel, Elector of Bavaria (b. 1662)\n*1770 – Giuseppe Tartini, Italian violinist and composer (b. 1692)\n*1790 – Joshua Rowley, English admiral (b. 1730)\n*1802 – Esek Hopkins, American admiral (b. 1718)\n*1813 – Robert R. Livingston, American lawyer and politician, 1st United States Secretary of Foreign Affairs (b. 1746)\n*1815 – Prince Josias of Saxe-Coburg-Saalfeld (b. 1737)\n*1821 – Joseph de Maistre, French lawyer and diplomat (b. 1753)\n*1864 – Louis-Hippolyte Lafontaine, Canadian jurist and politician, 3rd Premier of Canada East (b. 1807)\n*1883 – Alexandros Koumoundouros, Greek lawyer and politician, 56th Prime Minister of Greece (b. 1817)\n*1887 – Anandi Gopal Joshi, Indian physician (b. 1865)\n*1889 – Karl Davydov, Russian cellist and composer (b. 1838)\n*1903 – Richard Jordan Gatling, American engineer, invented the Gatling gun (b. 1818)\n*1913 – Felix Draeseke, German composer and academic (b. 1835)\n*1921 – Carl Menger, Polish-Austrian economist and academic (b. 1840)\n*1930 – Mary Whiton Calkins, American philosopher and psychologist (b. 1863)\n*1931 – Otto Wallach, German chemist and academic, Nobel Prize laureate (b. 1847)\n*1936 – February 26 Incident:\n**Takahashi Korekiyo, Japanese accountant and politician, 20th Prime Minister of Japan (b. 1854)\n**Saitō Makoto, Japanese admiral and politician, 30th Prime Minister of Japan (b. 1858)\n**Jōtarō Watanabe, Japanese general (b. 1874)\n*1943 – Theodor Eicke, German general (b. 1892)\n*1947 – Heinrich Häberlin, Swiss judge and politician, President of the Swiss National Council (b. 1868)\n*1950 – Harry Lauder, Scottish comedian and singer (b. 1870)\n*1952 – Theodoros Pangalos, Greek general and politician, President of Greece (b. 1878)\n*1961 – Karl Albiker, German sculptor, lithographer, and educator (b. 1878)\n*  1961   – Mohammed V of Morocco (b. 1909)\n*1966 – Vinayak Damodar Savarkar, Indian poet and politician (b. 1883)\n*1969 – Levi Eshkol, Israeli soldier and politician, 3rd Prime Minister of Israel (b. 1895)\n*  1969   – Karl Jaspers, German-Swiss psychiatrist and philosopher (b. 1883)\n*1981 – Robert Aickman, English author and activist (b. 1914)\n*  1981   – Howard Hanson, American composer, conductor, and educator (b. 1896)\n*1985 – Tjalling Koopmans, Dutch-American economist and mathematician, Nobel Prize laureate (b. 1910)\n*1989 – Roy Eldridge, American trumpet player (b. 1911)\n*1993 – Constance Ford, American model and actress (b. 1923)\n*1994 – Bill Hicks, American comedian (b. 1961)\n*1995 – Jack Clayton, English director and producer (b. 1921)\n*1997 – David Doyle, American actor (b. 1929)\n*1998 – Theodore Schultz, American economist and academic, Nobel Prize laureate (b. 1902)\n*2000 – George L. Street III, American captain, Medal of Honor recipient (b. 1913)\n*2002 – Lawrence Tierney, American actor (b. 1919)\n*2004 – Shankarrao Chavan, Indian politician, Indian Minister of Finance (b. 1920)\n*  2004   – Adolf Ehrnrooth, Finnish general (b. 1905)\n*  2004   – Boris Trajkovski, Macedonian politician, 2nd President of the Republic of Macedonia (b. 1956)\n*2005 – Jef Raskin, American computer scientist, created Macintosh (b. 1943)\n*2008 – Bodil Udsen, Danish actress (b. 1925)\n*2009 – Johnny Kerr, American basketball player, coach, and sportscaster (b. 1932)\n*  2009 – Wendy Richard, English actress (b. 1943)\n*  2009 – Norm Van Lier, American basketball player, coach, and sportscaster (b. 1947)\n*  2010 – Jun Seba, also known as \"Nujabes\", Japanese record producer, DJ, composer and arranger (b. 1974)\n*2011 – Arnošt Lustig, Czech author, playwright, and screenwriter (b. 1926)\n*2012 – Richard Carpenter, English actor and screenwriter (b. 1929)\n*2013 – Marie-Claire Alain, French organist and educator (b. 1926)\n*  2013   – Stéphane Hessel, German-French diplomat and author (b. 1917)\n*  2013   – Simon Li, Hong Kong judge and politician (b. 1922)\n*2014 – Sorel Etrog, Romanian-Canadian sculptor, painter, and illustrator (b. 1933)\n*  2014   – Phyllis Krasilovsky, American author and academic (b. 1927)\n*2015 – Sheppard Frere, English historian and archaeologist (b. 1916)\n*  2015   – Theodore Hesburgh, American priest, theologian, educator, and academic (b. 1917)\n*  2015   – Earl Lloyd, American basketball player and coach (b. 1928)\n*  2015   – Tom Schweich, American lawyer and politician, 36th State Auditor of Missouri (b. 1960)\n*2016 – Andy Bathgate, Canadian ice hockey player, coach, and manager (b. 1932)\n*  2016   – Don Getty, Canadian football player and politician, 11th Premier of Alberta (b. 1933)\n*2017 – Joseph Wapner, American lieutenant and judge (b. 1919)\n\nHolidays and observances\n\n*Christian feast day:\n**Alexander of Alexandria\n**Emily Malbone Morgan (Episcopal Church (USA))\n**Isabelle of France\n**Li Tim-Oi (Anglican Church of Canada)\n**Porphyry of Gaza\n**February 26 (Eastern Orthodox liturgics)\n*The first day of Ayyám-i-Há (Bahá'í Faith) (Please note that this observance is only locked into this date the Gregorian calendar on this date if Bahá'í Naw-Rúz takes place on March 21, which it doesn't in all years)\n*Day of Remembrance for Victims of Khojaly Massacre (Azerbaijan)\n*Liberation Day (Kuwait)\n*National Wear Red Day (United Kingdom, until 2016) \n*Saviours' Day (Nation of Islam). February 26. http://en.wikipedia.org/?curid=11141."
  }
}
