{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19320",
  "eid" : "39d9c6f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778606303,
  "textBody" : "Mebyon Kernow – The Party for Cornwall (, MK; Cornish for Sons of Cornwall) is a Cornish nationalist, centre-left political party in Cornwall, United Kingdom. It primarily campaigns for devolution to Cornwall in the form of a Cornish Assembly, as well as social democracy and environmental protection.\n\nMK was formed as a pressure group in 1951, and contained as members activists and politicians from a number of political parties. Its first leader was Helena Charles. Its first election win came in 1953, with its members running as independents. In the 1970s it became a fully-fledged political party, and since then it has fielded candidates in elections to Westminster and the European Parliament, as well as local government in Cornwall.\n\nThe party is a member of the European Free Alliance and has close links with Plaid Cymru, the Scottish National Party and the Breton Democratic Union. It currently has four elected councillors in Cornwall Council and numerous town and parish councillors across the county. Dick Cole is the current leader. Mebyon Kernow is run on a day-to-day basis by a 20-member National Executive, which includes the leadership team, policy spokespersons, and local party representatives.\n\nHistory\n\nMK was founded as a pressure group on 6 January 1951 at a meeting held at the Oates Temperance Hotel[https://www.theguardian.com/uk/2012/jan/26/cornish-party-mebyon-kernow-future Cornish party Mebyon Kernow sees the future in black and white | UK news]. The Guardian. in Redruth. Helena Charles was elected the organisation's first chair. At the first meeting, MK adopted the following objectives:\n\n#To study local conditions and attempt to remedy any that may be prejudicial to the best interests of Cornwall by the creation of public opinion or other means.\n#To foster the Cornish language and Literature.\n#To encourage the study of Cornish history from a Cornish point of view.\n#By self knowledge to further the acceptance of the idea of the Celtic character of Cornwall, one of the six Celtic nations.\n#To publish pamphlets, broadsheets, articles and letters in the Press whenever possible, putting forward the foregoing aims.\n#To arrange concerts and entertainments with a Cornish-Celtic flavour through which these aims can be further advanced.\n#To co-operate with all societies concerned with preserving the character of Cornwall.\n\nBy September 1951 they had officially come to a stance of supporting self-government for Cornwall, in what they hoped at the time would be a federal United Kingdom. MK won its first seat at local level on the Redruth-Camborne Urban Council in 1953. Throughout the 1950s and 1960s, MK was in essence a political pressure group rather than a true political party, with members being able to join other political parties as well. However, by the 1970s the group developed into a more coherent and unified organisation. During this decade, MK began contesting Westminster parliamentary seats as well as local government ones. On 28 May 1975 James Whetter left MK to form the Cornish Nationalist Party which was campaigning for full Cornish independence.\n\nThey currently describe their philosophy as based on being: \"Cornish, Green, Left of Centre, Decentralist.\" Mebyon Kernow is a member of the European Free Alliance and, although it did not contest European Parliament elections in 2004 or 1999, it had six candidates for the 2009 Euro elections.  The party has close links with Plaid Cymru (their partner in the EFA) including a twinning arrangement with Plaid's Blaenau Gwent branch, and to a lesser extent with the SNP.\n\nDaphne du Maurier, the well known novelist, was at one point a supporter of Mebyon Kernow, as was Andrew George, the former Liberal Democrat MP. Several other former Cornish MPs have also been supporters of Mebyon Kernow, including Peter Bessell (Liberal Party), John Pardoe (Liberal Party), David Mudd (Conservative), and David Penhaligon (Liberal Party).[http://www.mebyonkernow.org/?q=history_1950s_and_1960s Mebyon Kernow history]. Mebyonkernow.org.\n\nMK had an electoral partnership with the Greens in the 2005 Westminster elections. The party did not contest the St Ives constituency to make room for the Green Party candidate and, in return, the Greens did not stand against MK in any of the other four Cornish constituencies. Mebyon Kernow did contest every seat in Cornwall in the 2010 general election.\n\nIn 2009, three Mebyon Kernow candidates were elected to the newly formed Cornwall Council. Andrew Long for Callington, Stuart Cullimore for Camborne south and Dick Cole was elected to represent St Enoder.[http://democracy.cornwall.gov.uk/mgElectionResults.aspx?ID1&V\n1&RPID=690631 Cornwall Council]. Democracy.cornwall.gov.uk (4 June 2009). In 2010 an independent councillor, Neil Plummer, joined the MK group.[http://mebyonkernow.blogspot.co.uk/2010/08/cllr-neil-plummer-joins-mk-group.html Cllr Dick Cole: Cllr Neil Plummer joins MK Group]. Mebyonkernow.blogspot.co.uk (4 August 2010). In late 2011 former chair of the party Loveday Jenkin was elected in a by election in Wendron.[http://mebyonkernow.blogspot.co.uk/2011/11/loveday-jenkin-wins-wendron-for-mebyon.html Cllr Dick Cole: Loveday Jenkin wins Wendron for Mebyon Kernow]. Mebyonkernow.blogspot.co.uk (24 November 2011). In 2012, long standing Liberal Democrat councillor Tamsin Williams defected to Mebyon Kernow, increasing the number of MK Cornwall Councilors to 6 and the number of Penzance town councillors to 2.\n\nIn August 2008 MK deputy leader, Conan Jenkin, expressed Mebyon Kernow's support for a proposed legal challenge by Cornwall 2000 over the UK Government's exclusion of the Cornish from the Framework Convention for the Protection of National Minorities. Cornwall 2000 need to show that they have exhausted all domestic legal avenues by having the case summarily dismissed by the High Court, the Appeal Court and the House of Lords, before the case can be put to the European Court of Human Rights. Mebyon Kernow have requested the support of all of its members for this legal action. However the fund failed to meet the required target of £100,000 by the end of December 2008, having received just over £33,000 in pledges, and the plan was abandoned.\n\nIn 2011 councillor Andrew Long was invited to visit the Estonian Parliament by Aare Heinvee MP of the Reformierakond (Reform Party). He said that it was \"a great opportunity to see how a small nation can run its own affairs while being an equal and active part of a wider Europe.\"An Estonian inspiration – http://www.thisiscornwall.co.uk/Estonian-inspiration/story-13731501-detail/story.html\n\nIdeology\n\nIn July 2000 Mebyon Kernow issued the \"Declaration for a Cornish Assembly\" claiming;\n\nThe party members have said they are both Cornish and British but Cornish first.\n\nThree months later the Cornish Constitutional Convention was held with the objective of establishing a devolved Assembly. In less than two  years, Mebyon Kernow's petition attracted the signatures of over 50,000 people calling for a referendum on a Cornish Assembly, which is a little over 10% of the total Cornish electorate. A delegation including MK leader Dick Cole, West Cornwall Liberal Democrat MP Andrew George and representatives of the Convention (Richard Ford, David Fieldsend and Andrew Climo) presented the declaration to 10 Downing Street on Wednesday 12 December 2001.\nBBC News 11 December 2001 [http://news.bbc.co.uk/1/hi/england/1704112.stm][http://www.bertbiscoe.co.uk/ Bert Biscoe]. Bert Biscoe.\n\nCornwall is part of the South West Regional Assembly and the South West Regional Development Agency (SWRDA) administrate economic development, housing and strategic planning. They claim that the SW area covered is an artificially imposed large region and not natural.[http://www.mebyonkernow.org/ Mebyon Kernow opposes SWRA]. Mebyonkernow.org.[http://www.mebyonkernow.org/?q=policies_economy Mebyon Kernow says Cornwall needs its own Development Agency] . Mebyonkernow.org. Mebyon Kernow wants to break up the SWRDA into small county areas and implement a Cornish Regional Development Agency.\n\nThe party supports making March 5 which is Saint Piran's day (Cornwall's patron saint), a public holiday.\n\nDevonwall\n\nIn 2011, MK issued a statement saying it \"accused the Conservative/Liberal Democrat Coalition of treating Cornwall with \"absolute contempt\" as a result of the Parliamentary Voting System and Constituencies Bill, which seeks to equalise the size of constituencies.[http://conservativehome.blogs.com/goldlist/2011/01/equalisation-of-constituency-sizes-will-create-unnatural-seats-like-devonwall-says-report.html ConservativeHome's Seats & Candidates blog: Equalisation of constituency sizes will create unnatural seats like \"Devonwall\", says report]. Conservativehome.blogs.com (16 January 2011).[http://www.bbc.co.uk/blogs/grahamsmith/2011/01/devonwall_bill_crunchtime_on_m.html?postid105246441 Graham Smith's Blog: Devonwall Bill crunchtime on Monday night]. BBC. An amendment to the bill by Lord Teverson that would have ensured that \"all parts of Cornwall and the Isles of Scilly must be included in constituencies that are wholly in Cornwall and the Isles of Scilly\" was defeated by 250 to 221 votes in the House of Lords with 95% of Conservative and Liberal Democrat peers rejecting it. This was despite promises during the election in 2010 of both parties saying they would \"stand up for Cornwall\". MK stated Prime Minister David Cameron and Deputy Prime Minister Nick Clegg had \"devised the Bill to breach the territorial integrity of Cornwall.\"[http://www.mebyonkernow.org/?q\nnews/260 The Party for Cornwall]. Mebyon Kernow. Mr Cameron replied to concerns about the \"Devonwall\" constituency by stating that \"It's the Tamar, not the Amazon, for Heaven's sake\"; a move that was read in the press as indicative of his plan not to oppose the merger of the constituencies in Devon and Cornwall.\n\nMK welcomed the rejection of the parliamentary constituency boundary review during the 2010-2015 UK Parliament, which in turn prevented the introduction of a cross-border \"Devonwall\" constituency for the 2015 and 2017 General Elections.[http://www.mebyonkernow.org/news/article.php?id=94 Mebyon Kernow news]. Mebyonkernow.org.\n\nLeadership\n\nParty Leaders\n\n* Helena Charles (1951–1957)\n* Major Cecil Beer (1957–1960)\n* Robert Dunstone (1960–1968)\n* Len Truran (1968–1973)\n* Richard Jenkin (1973–1983)\n* Julyan Drew (1983–1985)\n* Pedyr Prior (1985–1986)\n* Loveday Carlyon (1986–1989)\n* Loveday Jenkin (1991–1997)\n* Dick Cole (1997–present)\n\nHonorary presidents\n\n* Robert Dunstone (1968–1973)\n* E. G. Retallack Hooper (1973–1998)\n* Richard Jenkin (1998–2002)\n* Ann Trevenen Jenkin (2011–)\n\nElected representatives\n\nMebyon Kernow has been represented on Cornwall Council since its inception in 2009, with four councillors elected in the most recent elections in 2017. It is also represented by numerous town and parish councillors across Cornwall. A mixture of County and Parish councillors serve as spokespeople on various topics.[http://www.mebyonkernow.org/people/ Spokespeople | Our Team | Mebyon Kernow – The Party for Cornwall]. Mebyon Kernow.\n\nElectoral performance\n\nTown and parish councils\n\nIn May 2007, Mebyon Kernow achieved its best-ever round of election results in Cornwall’s district and town and parish councils. There were 225 district council seats up for election and MK put up 24 candidates. MK won seven district council seats, a net gain of one; seventeen town/city council seats and four parish council places, a net gain of one town/parish seat. MK polled about 5 percent of the total votes cast in the district council elections. The seats won included their first seat on Caradon Council for 24 years; defended their seat on North Cornwall District Council; three seats on Kerrier District Council, where they lost one seat; and two on Restormel Borough Council. The results put Mebyon Kernow in third position behind the Liberal Democrats and the Conservative Party and ahead of Labour in several seats including Kerrier, Restormel, North Cornwall and Caradon. The total MK vote in the May 2007 local elections was over 10,000 votes across Cornwall.  In June 2008 Mebyon Kernow's representation on Caradon increased to 3 following the defection of Glenn Renshaw (Saltash Essa) from the Lib Dems and Chris Thomas (Callington) from the Independent group, to join the party.\n\nIn the Town Council elections MK maintained groups of five councillors on both Camborne Town Council and Penzance Town Council, with three new councillors also elected to Truro City Council and is also represented on town councils in Callington, Liskeard and Penryn.\n\nIn June 2011 Mebyon Kernow lost one of its Truro City councillors, and prior General Election Candidate, Loic Rich, who moved to the Conservative group. Mr Rich gave as his reason; \"I found it very frustrating being in a party that, along with the opposition parties, seemed to be in deliberate denial of the UK's economic and social needs.\" .[http://www.thisiscornwall.co.uk/MK-councillor-joins-Tory-group/story-12807025-detail/story.html Former MK councillor joins Tory group]. Thisiscornwall.co.uk (21 June 2011). That loss was made up for in November 2011 when a Liberal Democrat councillor on St Austell town council, Derek Collins, defected to MK, claiming that his former party had 'failed Cornwall'.[http://www.thisiscornwall.co.uk/Councillor-defects-MK-claiming-Lib-Dems-failed/story-13721789-detail/story.html Councillor defects to MK, claiming Lib Dems have 'failed Cornwall']. Thisiscornwall.co.uk (1 November 2011).\nIn November 2011 Eileen Carter resigned as a member of Perranzabuloe Parish Council, Perranporth Ward.\n\nCornwall Council\n\nFrom 2004 until the district councils were abolished in 2009, there were four MK councillors on Kerrier District Council, along with one in Restormel (the party leader Dick Cole) and, until his death in 2005, John Bolitho in North Cornwall. One of the MK councillors in Kerrier, Loveday Jenkin, joined the district council government in 2005 becoming the first MK councillor in such a position. In the final district council elections of 2007 MK won 8919 votes across the county.\n\nIn April 2009 MK leader Dick Cole announced his resignation from his job as an archaeologist with the new Cornwall Council to become full-time leader of Mebyon Kernow and to stand for election to the Council. He had previously worked for Cornwall County Council for 14 years, but it is not permitted for employees of Councils to stand for election to a council they work for.[http://mebyonkernow.blogspot.com/ Dick Cole to become full time leader of Mebyon Kernow]. Mebyonkernow.blogspot.com.\n\nOn 12 May 2009, Dick Cole announced that thirty-three candidates would be standing for the party at the Cornwall Council elections on 4 June 2009.[http://mebyonkernow.blogspot.com/ MK Cornwall Council candidates 2009]. Mebyonkernow.blogspot.com. This was the largest number of candidates that the party had ever fielded in a round of elections to a principal council or councils.  Under the new arrangements, 123 members were to be elected to the new unitary Cornwall Council, in the place of the 82 councillors on the outgoing Cornwall County Council and another 249 on the six district councils within its area, all abolished.[http://www.cornwall.gov.uk/default.aspx?page=17444 Cornwall Council June 2009 Electoral divisions]. Cornwall.gov.uk.\n\nHaving contested thirty-three of the 123 seats on the authority, Mebyon Kernow won three, or 2.4 per cent of the total. Andrew Long was elected to represent Callington with 54% of the votes.[http://democracy.cornwall.gov.uk/mgElectionAreaResults.aspx?ID9&RPID\n692853 Election results for Callington]. Democracy.cornwall.gov.uk (4 June 2009). Stuart Cullimore was elected to represent Camborne South with 28% of the votes[http://democracy.cornwall.gov.uk/mgElectionAreaResults.aspx?ID12&RPID\n692079 Election results for Camborne South]# and Dick Cole was elected to represent St Enoder with 78% of the votes[http://democracy.cornwall.gov.uk/mgElectionAreaResults.aspx?ID98&RPID\n693218 Election results for St Enoder]. Democracy.cornwall.gov.uk (4 June 2009).\n\nPrior to the 2013 election Mebyon Kernow held six seats on the council, having gained two due to defections from other parties, and winning one in a by-election. Three Mebyon Kernow councillors did not stand again in 2013. Keeping the seat won in the by-election, and a gain of one seat elsewhere, left them with four in total. This dropped them to being the sixth largest group on the council, from the position of fourth largest prior to the election, being overtaken by UKIP and Labour.\n\nUK general elections\n\nIn the 2010 general election, Mebyon Kernow fielded candidates in each of the six constituencies in Cornwall. Their best result was in the St Austell and Newquay seat, where they came fourth, with 4.2% of the votes, up 4% from the previous election.  Like many minor parties, MK did not qualify for a televised election broadcast as they did not meet the qualification (standing candidates in a minimum of 89 English seats). The other main parties spent more on their election campaigns.[http://www.electoralcommission.org.uk/news-and-media/news-releases/electoral-commission-media-centre/news-releases-donations/figures-reveal-spending-by-parties-at-uk-general-election Figures reveal spending by parties at UK general election]. Electoral Commission. MK also blamed bad results on a tactical voting campaign whereby Labour voters in Cornwall were urged to vote Liberal Democrat to stop the Conservatives from getting in.[http://www.politics.co.uk/news/general-election-2010/brown-vote-lib-dem-where-labour-can-t-win-,70072.htm Brown: Vote Lib Dem where Labour can't win]. Politics.co.uk (9 April 2010). Overall they gained 1.9% of votes cast. All Mebyon Kernow candidates lost their deposits.\n\nMebyon Kernow fielded candidates in all six constituencies for the 2015 UK General Election.  \n\nMebyon Kernow declined to stand candidates in the 2017 general election, stating; “The timing of this snap election, so close to the local polls, makes it impractical for a party with our level of resources to put together and finance a meaningful campaign for the General Election.\" \n\nEuropean Parliament elections\n\nIn 1979, in the first elections to the European Parliament, Mebyon Kernow's candidate Richard Jenkin was able to attract more than five percent of the vote in the Cornwall seat.\n\nIn April 2009 Mebyon Kernow announced that its list of candidates for the \n'South West Region' seat in the European Parliament would comprise their six prospective parliamentary candidates for Westminster. The candidates were:- Dick Cole (St Austell and Newquay), Conan Jenkin (Truro and Falmouth), Loveday Jenkin (Camborne and Redruth), Simon Reed (St Ives), Glenn Renshaw (South East Cornwall), Joanie Willett (North Cornwall).[http://www.mebyonkernow.org/?q=news/199 Mebyon Kernow announce candidates for the ‘South West Region’ seat in the European Parliament]. Mebyonkernow.org. Mebyon Kernow had also committed itself to continuing the fight for a \"Cornwall only\" Euro-constituency, to promote Cornwall in Europe.Cole, Dick. (18 March 2009) [http://mebyonkernow.blogspot.com/2009/03/standing-for-european-parliament.html MK fight for Cornwall only Euro-constituency]. Mebyonkernow.blogspot.com.\n\nMebyon Kernow polled 14,922 votes in the 2009 European elections (11,534 votes in Cornwall, no seats, 7 percent of the vote in Cornwall) putting them ahead of the Labour Party in Cornwall.[http://news.bbc.co.uk/1/shared/bsp/hi/elections/euro/09/html/ukregion_36.stm European Election 2009: South West]. BBC News (8 June 2009).\n\nMebyon Kernow decided not to stand candidates in the 2014 European elections, claiming the system is skewed against them winning seats.[http://illoganblogger.blogspot.com.au/2014/04/europe-in-or-out.html]. Stephen Richardson | Blog",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mebyon Kernow" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19320" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Mebyon Kernow – The Party for Cornwall (, MK; Cornish for Sons of Cornwall) is a Cornish nationalist, centre-left political party in Cornwall, United Kingdom. It primarily campaigns for devolution to Cornwall in the form of a Cornish Assembly, as well as social democracy and environmental protection.\n\nMK was formed as a pressure group in 1951, and contained as members activists and politicians from a number of political parties. Its first leader was Helena Charles. Its first election win came in 1953, with its members running as independents. In the 1970s it became a fully-fledged political party, and since then it has fielded candidates in elections to Westminster and the European Parliament, as well as local government in Cornwall.\n\nThe party is a member of the European Free Alliance and has close links with Plaid Cymru, the Scottish National Party and the Breton Democratic Union. It currently has four elected councillors in Cornwall Council and numerous town and parish councillors across the county. Dick Cole is the current leader. Mebyon Kernow is run on a day-to-day basis by a 20-member National Executive, which includes the leadership team, policy spokespersons, and local party representatives.\n\nHistory\n\nMK was founded as a pressure group on 6 January 1951 at a meeting held at the Oates Temperance Hotel[https://www.theguardian.com/uk/2012/jan/26/cornish-party-mebyon-kernow-future Cornish party Mebyon Kernow sees the future in black and white | UK news]. The Guardian. in Redruth. Helena Charles was elected the organisation's first chair. At the first meeting, MK adopted the following objectives:\n\n#To study local conditions and attempt to remedy any that may be prejudicial to the best interests of Cornwall by the creation of public opinion or other means.\n#To foster the Cornish language and Literature.\n#To encourage the study of Cornish history from a Cornish point of view.\n#By self knowledge to further the acceptance of the idea of the Celtic character of Cornwall, one of the six Celtic nations.\n#To publish pamphlets, broadsheets, articles and letters in the Press whenever possible, putting forward the foregoing aims.\n#To arrange concerts and entertainments with a Cornish-Celtic flavour through which these aims can be further advanced.\n#To co-operate with all societies concerned with preserving the character of Cornwall.\n\nBy September 1951 they had officially come to a stance of supporting self-government for Cornwall, in what they hoped at the time would be a federal United Kingdom. MK won its first seat at local level on the Redruth-Camborne Urban Council in 1953. Throughout the 1950s and 1960s, MK was in essence a political pressure group rather than a true political party, with members being able to join other political parties as well. However, by the 1970s the group developed into a more coherent and unified organisation. During this decade, MK began contesting Westminster parliamentary seats as well as local government ones. On 28 May 1975 James Whetter left MK to form the Cornish Nationalist Party which was campaigning for full Cornish independence.\n\nThey currently describe their philosophy as based on being: \"Cornish, Green, Left of Centre, Decentralist.\" Mebyon Kernow is a member of the European Free Alliance and, although it did not contest European Parliament elections in 2004 or 1999, it had six candidates for the 2009 Euro elections.  The party has close links with Plaid Cymru (their partner in the EFA) including a twinning arrangement with Plaid's Blaenau Gwent branch, and to a lesser extent with the SNP.\n\nDaphne du Maurier, the well known novelist, was at one point a supporter of Mebyon Kernow, as was Andrew George, the former Liberal Democrat MP. Several other former Cornish MPs have also been supporters of Mebyon Kernow, including Peter Bessell (Liberal Party), John Pardoe (Liberal Party), David Mudd (Conservative), and David Penhaligon (Liberal Party).[http://www.mebyonkernow.org/?q=history_1950s_and_1960s Mebyon Kernow history]. Mebyonkernow.org.\n\nMK had an electoral partnership with the Greens in the 2005 Westminster elections. The party did not contest the St Ives constituency to make room for the Green Party candidate and, in return, the Greens did not stand against MK in any of the other four Cornish constituencies. Mebyon Kernow did contest every seat in Cornwall in the 2010 general election.\n\nIn 2009, three Mebyon Kernow candidates were elected to the newly formed Cornwall Council. Andrew Long for Callington, Stuart Cullimore for Camborne south and Dick Cole was elected to represent St Enoder.[http://democracy.cornwall.gov.uk/mgElectionResults.aspx?ID1&V\n1&RPID=690631 Cornwall Council]. Democracy.cornwall.gov.uk (4 June 2009). In 2010 an independent councillor, Neil Plummer, joined the MK group.[http://mebyonkernow.blogspot.co.uk/2010/08/cllr-neil-plummer-joins-mk-group.html Cllr Dick Cole: Cllr Neil Plummer joins MK Group]. Mebyonkernow.blogspot.co.uk (4 August 2010). In late 2011 former chair of the party Loveday Jenkin was elected in a by election in Wendron.[http://mebyonkernow.blogspot.co.uk/2011/11/loveday-jenkin-wins-wendron-for-mebyon.html Cllr Dick Cole: Loveday Jenkin wins Wendron for Mebyon Kernow]. Mebyonkernow.blogspot.co.uk (24 November 2011). In 2012, long standing Liberal Democrat councillor Tamsin Williams defected to Mebyon Kernow, increasing the number of MK Cornwall Councilors to 6 and the number of Penzance town councillors to 2.\n\nIn August 2008 MK deputy leader, Conan Jenkin, expressed Mebyon Kernow's support for a proposed legal challenge by Cornwall 2000 over the UK Government's exclusion of the Cornish from the Framework Convention for the Protection of National Minorities. Cornwall 2000 need to show that they have exhausted all domestic legal avenues by having the case summarily dismissed by the High Court, the Appeal Court and the House of Lords, before the case can be put to the European Court of Human Rights. Mebyon Kernow have requested the support of all of its members for this legal action. However the fund failed to meet the required target of £100,000 by the end of December 2008, having received just over £33,000 in pledges, and the plan was abandoned.\n\nIn 2011 councillor Andrew Long was invited to visit the Estonian Parliament by Aare Heinvee MP of the Reformierakond (Reform Party). He said that it was \"a great opportunity to see how a small nation can run its own affairs while being an equal and active part of a wider Europe.\"An Estonian inspiration – http://www.thisiscornwall.co.uk/Estonian-inspiration/story-13731501-detail/story.html\n\nIdeology\n\nIn July 2000 Mebyon Kernow issued the \"Declaration for a Cornish Assembly\" claiming;\n\nThe party members have said they are both Cornish and British but Cornish first.\n\nThree months later the Cornish Constitutional Convention was held with the objective of establishing a devolved Assembly. In less than two  years, Mebyon Kernow's petition attracted the signatures of over 50,000 people calling for a referendum on a Cornish Assembly, which is a little over 10% of the total Cornish electorate. A delegation including MK leader Dick Cole, West Cornwall Liberal Democrat MP Andrew George and representatives of the Convention (Richard Ford, David Fieldsend and Andrew Climo) presented the declaration to 10 Downing Street on Wednesday 12 December 2001.\nBBC News 11 December 2001 [http://news.bbc.co.uk/1/hi/england/1704112.stm][http://www.bertbiscoe.co.uk/ Bert Biscoe]. Bert Biscoe.\n\nCornwall is part of the South West Regional Assembly and the South West Regional Development Agency (SWRDA) administrate economic development, housing and strategic planning. They claim that the SW area covered is an artificially imposed large region and not natural.[http://www.mebyonkernow.org/ Mebyon Kernow opposes SWRA]. Mebyonkernow.org.[http://www.mebyonkernow.org/?q=policies_economy Mebyon Kernow says Cornwall needs its own Development Agency] . Mebyonkernow.org. Mebyon Kernow wants to break up the SWRDA into small county areas and implement a Cornish Regional Development Agency.\n\nThe party supports making March 5 which is Saint Piran's day (Cornwall's patron saint), a public holiday.\n\nDevonwall\n\nIn 2011, MK issued a statement saying it \"accused the Conservative/Liberal Democrat Coalition of treating Cornwall with \"absolute contempt\" as a result of the Parliamentary Voting System and Constituencies Bill, which seeks to equalise the size of constituencies.[http://conservativehome.blogs.com/goldlist/2011/01/equalisation-of-constituency-sizes-will-create-unnatural-seats-like-devonwall-says-report.html ConservativeHome's Seats & Candidates blog: Equalisation of constituency sizes will create unnatural seats like \"Devonwall\", says report]. Conservativehome.blogs.com (16 January 2011).[http://www.bbc.co.uk/blogs/grahamsmith/2011/01/devonwall_bill_crunchtime_on_m.html?postid105246441 Graham Smith's Blog: Devonwall Bill crunchtime on Monday night]. BBC. An amendment to the bill by Lord Teverson that would have ensured that \"all parts of Cornwall and the Isles of Scilly must be included in constituencies that are wholly in Cornwall and the Isles of Scilly\" was defeated by 250 to 221 votes in the House of Lords with 95% of Conservative and Liberal Democrat peers rejecting it. This was despite promises during the election in 2010 of both parties saying they would \"stand up for Cornwall\". MK stated Prime Minister David Cameron and Deputy Prime Minister Nick Clegg had \"devised the Bill to breach the territorial integrity of Cornwall.\"[http://www.mebyonkernow.org/?q\nnews/260 The Party for Cornwall]. Mebyon Kernow. Mr Cameron replied to concerns about the \"Devonwall\" constituency by stating that \"It's the Tamar, not the Amazon, for Heaven's sake\"; a move that was read in the press as indicative of his plan not to oppose the merger of the constituencies in Devon and Cornwall.\n\nMK welcomed the rejection of the parliamentary constituency boundary review during the 2010-2015 UK Parliament, which in turn prevented the introduction of a cross-border \"Devonwall\" constituency for the 2015 and 2017 General Elections.[http://www.mebyonkernow.org/news/article.php?id=94 Mebyon Kernow news]. Mebyonkernow.org.\n\nLeadership\n\nParty Leaders\n\n* Helena Charles (1951–1957)\n* Major Cecil Beer (1957–1960)\n* Robert Dunstone (1960–1968)\n* Len Truran (1968–1973)\n* Richard Jenkin (1973–1983)\n* Julyan Drew (1983–1985)\n* Pedyr Prior (1985–1986)\n* Loveday Carlyon (1986–1989)\n* Loveday Jenkin (1991–1997)\n* Dick Cole (1997–present)\n\nHonorary presidents\n\n* Robert Dunstone (1968–1973)\n* E. G. Retallack Hooper (1973–1998)\n* Richard Jenkin (1998–2002)\n* Ann Trevenen Jenkin (2011–)\n\nElected representatives\n\nMebyon Kernow has been represented on Cornwall Council since its inception in 2009, with four councillors elected in the most recent elections in 2017. It is also represented by numerous town and parish councillors across Cornwall. A mixture of County and Parish councillors serve as spokespeople on various topics.[http://www.mebyonkernow.org/people/ Spokespeople | Our Team | Mebyon Kernow – The Party for Cornwall]. Mebyon Kernow.\n\nElectoral performance\n\nTown and parish councils\n\nIn May 2007, Mebyon Kernow achieved its best-ever round of election results in Cornwall’s district and town and parish councils. There were 225 district council seats up for election and MK put up 24 candidates. MK won seven district council seats, a net gain of one; seventeen town/city council seats and four parish council places, a net gain of one town/parish seat. MK polled about 5 percent of the total votes cast in the district council elections. The seats won included their first seat on Caradon Council for 24 years; defended their seat on North Cornwall District Council; three seats on Kerrier District Council, where they lost one seat; and two on Restormel Borough Council. The results put Mebyon Kernow in third position behind the Liberal Democrats and the Conservative Party and ahead of Labour in several seats including Kerrier, Restormel, North Cornwall and Caradon. The total MK vote in the May 2007 local elections was over 10,000 votes across Cornwall.  In June 2008 Mebyon Kernow's representation on Caradon increased to 3 following the defection of Glenn Renshaw (Saltash Essa) from the Lib Dems and Chris Thomas (Callington) from the Independent group, to join the party.\n\nIn the Town Council elections MK maintained groups of five councillors on both Camborne Town Council and Penzance Town Council, with three new councillors also elected to Truro City Council and is also represented on town councils in Callington, Liskeard and Penryn.\n\nIn June 2011 Mebyon Kernow lost one of its Truro City councillors, and prior General Election Candidate, Loic Rich, who moved to the Conservative group. Mr Rich gave as his reason; \"I found it very frustrating being in a party that, along with the opposition parties, seemed to be in deliberate denial of the UK's economic and social needs.\" .[http://www.thisiscornwall.co.uk/MK-councillor-joins-Tory-group/story-12807025-detail/story.html Former MK councillor joins Tory group]. Thisiscornwall.co.uk (21 June 2011). That loss was made up for in November 2011 when a Liberal Democrat councillor on St Austell town council, Derek Collins, defected to MK, claiming that his former party had 'failed Cornwall'.[http://www.thisiscornwall.co.uk/Councillor-defects-MK-claiming-Lib-Dems-failed/story-13721789-detail/story.html Councillor defects to MK, claiming Lib Dems have 'failed Cornwall']. Thisiscornwall.co.uk (1 November 2011).\nIn November 2011 Eileen Carter resigned as a member of Perranzabuloe Parish Council, Perranporth Ward.\n\nCornwall Council\n\nFrom 2004 until the district councils were abolished in 2009, there were four MK councillors on Kerrier District Council, along with one in Restormel (the party leader Dick Cole) and, until his death in 2005, John Bolitho in North Cornwall. One of the MK councillors in Kerrier, Loveday Jenkin, joined the district council government in 2005 becoming the first MK councillor in such a position. In the final district council elections of 2007 MK won 8919 votes across the county.\n\nIn April 2009 MK leader Dick Cole announced his resignation from his job as an archaeologist with the new Cornwall Council to become full-time leader of Mebyon Kernow and to stand for election to the Council. He had previously worked for Cornwall County Council for 14 years, but it is not permitted for employees of Councils to stand for election to a council they work for.[http://mebyonkernow.blogspot.com/ Dick Cole to become full time leader of Mebyon Kernow]. Mebyonkernow.blogspot.com.\n\nOn 12 May 2009, Dick Cole announced that thirty-three candidates would be standing for the party at the Cornwall Council elections on 4 June 2009.[http://mebyonkernow.blogspot.com/ MK Cornwall Council candidates 2009]. Mebyonkernow.blogspot.com. This was the largest number of candidates that the party had ever fielded in a round of elections to a principal council or councils.  Under the new arrangements, 123 members were to be elected to the new unitary Cornwall Council, in the place of the 82 councillors on the outgoing Cornwall County Council and another 249 on the six district councils within its area, all abolished.[http://www.cornwall.gov.uk/default.aspx?page=17444 Cornwall Council June 2009 Electoral divisions]. Cornwall.gov.uk.\n\nHaving contested thirty-three of the 123 seats on the authority, Mebyon Kernow won three, or 2.4 per cent of the total. Andrew Long was elected to represent Callington with 54% of the votes.[http://democracy.cornwall.gov.uk/mgElectionAreaResults.aspx?ID9&RPID\n692853 Election results for Callington]. Democracy.cornwall.gov.uk (4 June 2009). Stuart Cullimore was elected to represent Camborne South with 28% of the votes[http://democracy.cornwall.gov.uk/mgElectionAreaResults.aspx?ID12&RPID\n692079 Election results for Camborne South]# and Dick Cole was elected to represent St Enoder with 78% of the votes[http://democracy.cornwall.gov.uk/mgElectionAreaResults.aspx?ID98&RPID\n693218 Election results for St Enoder]. Democracy.cornwall.gov.uk (4 June 2009).\n\nPrior to the 2013 election Mebyon Kernow held six seats on the council, having gained two due to defections from other parties, and winning one in a by-election. Three Mebyon Kernow councillors did not stand again in 2013. Keeping the seat won in the by-election, and a gain of one seat elsewhere, left them with four in total. This dropped them to being the sixth largest group on the council, from the position of fourth largest prior to the election, being overtaken by UKIP and Labour.\n\nUK general elections\n\nIn the 2010 general election, Mebyon Kernow fielded candidates in each of the six constituencies in Cornwall. Their best result was in the St Austell and Newquay seat, where they came fourth, with 4.2% of the votes, up 4% from the previous election.  Like many minor parties, MK did not qualify for a televised election broadcast as they did not meet the qualification (standing candidates in a minimum of 89 English seats). The other main parties spent more on their election campaigns.[http://www.electoralcommission.org.uk/news-and-media/news-releases/electoral-commission-media-centre/news-releases-donations/figures-reveal-spending-by-parties-at-uk-general-election Figures reveal spending by parties at UK general election]. Electoral Commission. MK also blamed bad results on a tactical voting campaign whereby Labour voters in Cornwall were urged to vote Liberal Democrat to stop the Conservatives from getting in.[http://www.politics.co.uk/news/general-election-2010/brown-vote-lib-dem-where-labour-can-t-win-,70072.htm Brown: Vote Lib Dem where Labour can't win]. Politics.co.uk (9 April 2010). Overall they gained 1.9% of votes cast. All Mebyon Kernow candidates lost their deposits.\n\nMebyon Kernow fielded candidates in all six constituencies for the 2015 UK General Election.  \n\nMebyon Kernow declined to stand candidates in the 2017 general election, stating; “The timing of this snap election, so close to the local polls, makes it impractical for a party with our level of resources to put together and finance a meaningful campaign for the General Election.\" \n\nEuropean Parliament elections\n\nIn 1979, in the first elections to the European Parliament, Mebyon Kernow's candidate Richard Jenkin was able to attract more than five percent of the vote in the Cornwall seat.\n\nIn April 2009 Mebyon Kernow announced that its list of candidates for the \n'South West Region' seat in the European Parliament would comprise their six prospective parliamentary candidates for Westminster. The candidates were:- Dick Cole (St Austell and Newquay), Conan Jenkin (Truro and Falmouth), Loveday Jenkin (Camborne and Redruth), Simon Reed (St Ives), Glenn Renshaw (South East Cornwall), Joanie Willett (North Cornwall).[http://www.mebyonkernow.org/?q=news/199 Mebyon Kernow announce candidates for the ‘South West Region’ seat in the European Parliament]. Mebyonkernow.org. Mebyon Kernow had also committed itself to continuing the fight for a \"Cornwall only\" Euro-constituency, to promote Cornwall in Europe.Cole, Dick. (18 March 2009) [http://mebyonkernow.blogspot.com/2009/03/standing-for-european-parliament.html MK fight for Cornwall only Euro-constituency]. Mebyonkernow.blogspot.com.\n\nMebyon Kernow polled 14,922 votes in the 2009 European elections (11,534 votes in Cornwall, no seats, 7 percent of the vote in Cornwall) putting them ahead of the Labour Party in Cornwall.[http://news.bbc.co.uk/1/shared/bsp/hi/elections/euro/09/html/ukregion_36.stm European Election 2009: South West]. BBC News (8 June 2009).\n\nMebyon Kernow decided not to stand candidates in the 2014 European elections, claiming the system is skewed against them winning seats.[http://illoganblogger.blogspot.com.au/2014/04/europe-in-or-out.html]. Stephen Richardson | Blog. Mebyon Kernow. http://en.wikipedia.org/?curid=19320."
  }
}
