{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18646",
  "eid" : "34349e00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778596832,
  "textBody" : "Linkin Park is an American rock band from Agoura Hills, California. Formed in 1996, the band rose to international fame with their debut album Hybrid Theory (2000), which was certified Diamond by the RIAA in 2005 and multi-Platinum in several other countries.Recording Industry Association of America, [https://www.riaa.com/goldandplatinumdata.php?table=tblDiamond RIAA Record Sales] . Retrieved June 13, 2007 Their following studio album Meteora continued the band's success, topping the Billboard 200 album chart in 2003, and was followed by extensive touring and charity work.\n\nHaving adapted nu metal and rap metal to a radio-friendly yet densely layered style in Hybrid Theory and Meteora,MSN Music, [http://music.msn.com/artist/?artist16483411&menu\nbio Linkin Park: Biography]. Retrieved June 14, 2007 the band explored other genres on their next studio album, Minutes to Midnight (2007). The album topped the Billboard charts and had the third-best debut week of any album that year.Billboard.com, [ M2M holds the top slot for the current week]. Retrieved May 28, 2007Billboard.com, [http://www.billboard.com/articles/news/1051972/linkin-park-scores-years-best-debut-with-midnight Linkin Park Scores Year's Best Debut With 'Midnight']. Retrieved May 28, 2007 The band continued to explore a wider variation of musical types in their fourth album, A Thousand Suns (2010), layering their music with more electronic sounds. Their fifth album, Living Things (2012), combines musical elements from all of their previous records. Their sixth album, The Hunting Party (2014), returned to a heavier rock sound. Their seventh album One More Light, a more electronic and pop-oriented record, was released on May 19, 2017.\n\nIn 2003, MTV2 named Linkin Park the sixth-greatest band of the music video era and the third-best of the new millennium. Billboard ranked Linkin Park No. 19 on the Best Artists of the Decade chart.Billboard Artists Of The Decade, [http://www.billboard.com/#/charts-decade-end/artists-of-the-decade?year2009&begin\n11&orderposition]. Retrieved August 15, 2011. In 2012, the band was voted as the greatest artist of the 2000s in a Bracket Madness poll on VH1. In 2014, the band was declared as the Biggest Rock Band in the World Right Now by Kerrang!.Emily [http://www.kerrang.com/21888/60-biggest-bands-planet-right-now/ The 60 Biggest Rock Band in the World Right Now] Kerrang! October 5, 2014. Retrieved October 20, 2014.[http://www.ultimate-guitar.com/news/general_music_news/linkin_park_are_the_biggest_rock_band_in_the_world_right_now.html Linkin Park Are the 'Biggest Rock Band in the World Right Now'] Ultimate Guitar August 28, 2014. Retrieved October 20, 2014. As the best-selling band of the 21st century and one of the world's best-selling music artists overall, Linkin Park has sold more than 70 million records worldwide and has won two Grammy Awards.\n\nHistory\n\n1996–2000: Early years\n\nLinkin Park was founded by three high school friends: Mike Shinoda, Rob Bourdon, and Brad Delson.AskMen.com, [http://www.askmen.com/celebs/men/entertainment_150/196_linkin_park.html Linkin Park – Biography]  Retrieved March 20, 2007 The three attended Agoura High School in Agoura Hills, California, a suburb of Los Angeles. After graduating from high school, the three began to take their musical interests more seriously, recruiting Joe Hahn, Dave \"Phoenix\" Farrell, and Mark Wakefield to perform in their band, then called Xero. Though limited in resources, the band began recording and producing songs within Shinoda's makeshift bedroom studio in 1996, resulting in a four-track demo tape, entitled Xero. Tensions and frustration within the band grew however after they failed to land a record deal. The lack of success and stalemate in progress prompted Wakefield, at that time the band's vocalist, to leave the band in search of other projects. Farrell also left to tour with Tasty Snax, a Christian punk and ska band.MusicMight.com, [http://www.musicmight.com/artist/united+states/california/los+angeles/linkin+park Linkin Park – MusicMight Biography] Retrieved March 20, 2007Livedaily.com,  Retrieved March 20, 2007\n\nAfter spending a considerable time searching for Wakefield's replacement, Xero recruited Arizona vocalist Chester Bennington, who was recommended by Jeff Blue, the vice president of Zomba Music in March 1999.Lptimes.com, [http://www.lptimes.com/bio/bio_band.html Band History]  Retrieved March 20, 2007 Bennington, formerly of a post-grunge band by the name of Grey Daze, became a standout among applicants because of the dynamic in his singing style. The band then agreed on changing its name from Xero to Hybrid Theory; the newborn vocal chemistry between Shinoda and Bennington helped revive the band, inciting them to work on new material. In 1999 the band released a self-titled extended play, which they circulated across internet chat-rooms and forums with the help of an online 'street team'. The band's renaissance culminated with another change in name, this time to Linkin Park, a play on and homage to Santa Monica's Lincoln Park (now called Christine Emerson Reed Park). The band initially wanted to use the name \"Lincoln Park\", however they changed it to \"Linkin\" to acquire the internet domain \"linkinpark.com\". The band still struggled to sign a record deal. Linkin Park turned to Jeff Blue for additional help after facing numerous rejections from several major record labels. After failing to catch Warner Bros. Records on three previous reviews, Jeff Blue, who had negotiated his employment contract with Warner Brothers to include signing Linkin Park, and was now the vice president of Warner Bros. Records, helped the band sign a deal with the company in 1999. The band released its breakthrough album, Hybrid Theory, the following year.\n\n2000–2002: Hybrid Theory and Reanimation\n\nLinkin Park released Hybrid Theory on October 24, 2000. The album, which represented half a decade's worth of the band's work, was edited by Don Gilmore. Hybrid Theory was a massive commercial success; it sold more than 4.8 million copies during its debut year, earning it the status of best-selling album of 2001, while singles such as \"Crawling\" and \"One Step Closer\" established themselves as staples among alternative rock radio play lists during the year. Additionally, other singles from the album were featured in films such as Dracula 2000, Little Nicky, and Valentine. Hybrid Theory won a Grammy Award for Best Hard Rock Performance for the song \"Crawling\" and was nominated for two other Grammy Awards: Best New Artist and Best Rock Album. MTV awarded the band their Best Rock Video and Best Direction awards for \"In the End\". Through the winning of the Grammy for Best Hard Rock Performance, Hybrid Theorys overall success had catapulted the band into mainstream success.\n\nDuring this time, Linkin Park received many invitations to perform on many high-profile tours and concerts including Ozzfest, Family Values Tour, and KROQ Almost Acoustic Christmas.MTV.com, [http://www.mtv.com/news/articles/1451189/20011126/story.jhtml Linkin Park, P.O.D., Nickelback, More To Play LA's KROQ Fest] Retrieved March 26, 2007 The band worked with Jessica Sklar to found their official fan club and street team, \"Linkin Park Underground\", in November 2001. Linkin Park also formed its own tour, Projekt Revolution, which featured other notable artists such as Cypress Hill, Adema, and Snoop Dogg. Within a year's stretch, Linkin Park had performed at over 320 concerts. The experiences and performances of the precocious band were documented in its first DVD, Frat Party at the Pankake Festival, which debuted in November 2001. Now reunited with former bassist Phoenix, the band began work on a remix album, dubbed Reanimation, which would include works from Hybrid Theory and non-album tracks. Reanimation debuted on July 30, 2002, featuring the likes of Black Thought, Jonathan Davis, Aaron Lewis, and many others. Reanimation claimed the second spot on the Billboard 200, and sold nearly 270,000 copies during its debut week. Hybrid Theory is also in the RIAA's Top 100 Albums.\n\n2002–2004: Meteora\n\nFollowing the success of Hybrid Theory and Reanimation, Linkin Park spent a significant amount of time touring around the United States. The band members began to work on new material amidst its saturated schedule, spending a sliver of their free time in their tour bus' studio.Warner Bros. Records, \"The Making of Meteora\" (2003) DVD, Released on March 25, 2003. The band officially announced the production of a new studio album in December 2002, revealing its new work was inspired by the rocky region of Meteora in Greece, where numerous monasteries have been built on top of the rocks.MTV.com, [http://www.mtv.com/news/articles/1459710/01272003/linkin_Park.jhtml Linkin Park Get Their Tempers Under Control To Complete New LP] Retrieved June 10, 2006 Meteora features a mixture of the band's nu metal and rap metal style with newer innovative effects, including the induction of a shakuhachi (a Japanese flute made of bamboo) and other instruments. Linkin Park's second album debuted on March 25, 2003 and instantly earned worldwide recognition, going to No. 1 in the US and UK, and No. 2 in Australia.\n\nMeteora sold more than 800,000 copies during its first week, and it ranked as the best selling album on the Billboard charts at the time. The album's singles, including \"Somewhere I Belong\", \"Breaking the Habit\", \"Faint\", and \"Numb\", received significant radio attention. By October 2003, Meteora sold nearly three million copies. The album's success allowed Linkin Park to form another Projekt Revolution, which featured other bands and artists including Mudvayne, Blindside, and Xzibit. Additionally, Metallica invited Linkin Park to play at the Summer Sanitarium Tour 2003, which included well-known acts such as Limp Bizkit, Mudvayne and Deftones.VH1.com, [http://www.vh1.com/artists/az/linkin_park/bio.jhtml Linkin Park: Biography] Retrieved on April 8, 2007 The band released an album and DVD, titled Live in Texas, which featured some audio and video tracks from the band's performances in Texas during the tour. In early 2004, Linkin Park started a world tour titled the Meteora World Tour. Supporting bands on the tour included Hoobastank, P.O.D., Story of the Year and Pia.\n\nMeteora earned the band multiple awards and honors. The band won the MTV awards for Best Rock Video for \"Somewhere I Belong\" and the Viewer's Choice Award for \"Breaking the Habit\". Linkin Park also received significant recognition during the 2004 Radio Music Awards, winning the Artist of the Year and Song of the Year (\"Numb\") awards. Although Meteora was not nearly as successful as Hybrid Theory, it was the third best selling album in the United States during 2003. The band spent the first few months of 2004 touring around the world, first with the third Projekt Revolution tour, and later several European concerts. At the same time, the band's relationship with Warner Bros. Records was deteriorating rapidly on account of several trust and financial issues. After months of feuding, the band finally negotiated a deal in December 2005.\n\n2004–2006: Side projects\n\nFollowing Meteoras success, the band worked on many side projects. Bennington appeared on DJ Lethal's \"State of the Art\" and other work with Dead by Sunrise, while Shinoda did work with Depeche Mode. In 2004, the band began to work with Jay-Z to produce another remix album, titled Collision Course. The album, which featured intermixed lyrics and background tracks from both artists' previous albums, debuted in November 2004. Shinoda also formed Fort Minor as a side project. With the aid of Jay-Z, Fort Minor released its debut album, The Rising Tied, to critical acclaim.\n\nLinkin Park also participated in numerous charitable events, most notably raised money to benefit victims of Hurricane Charley in 2004 and later Hurricane Katrina in 2005. The band donated $75,000 to the Special Operations Warrior Foundation in March 2004. They also helped relief efforts for the 2004 Indian Ocean tsunami victims by staging several charity concerts and setting up an additional fund called Music for Relief. Most notably, however, the band participated at Live 8, a series of charitable benefit concerts set up to raise global awareness.The Linkin Park Times, [http://www.lptimes.com/news2005/july/live8live.html Live 8 Philadelphia 2005]  Retrieved May 12, 2007 Alongside Jay-Z, the band performed on Live 8's stage in Philadelphia, Pennsylvania, to a global audience. The band would later be reunited with Jay-Z at the Grammy Award Ceremony 2006, during which they performed \"Numb/Encore\", en route to winning a Grammy for Best Rap/Sung Collaboration.About.com, [http://top40.about.com/b/a/207768.htm Jay-Z and Linkin Park to Mash-Up Onstage at the Grammys] . Retrieved June 9, 2007 They were joined on stage by Paul McCartney who added verses from the song \"Yesterday\". They would later go on to play at the 2006 Summer Sonic music festival, which was hosted by Metallica in Japan.\n\n2006–2008: Minutes to Midnight\n\nLinkin Park returned to the recording studios in 2006 to work on new material. To produce the album, the band chose producer Rick Rubin. Despite initially stating the album would debut sometime in 2006, the album was delayed until 2007.MTV.com, [http://www.mtv.com/news/articles/1539802/20060830/linkin_park.jhtml Mike Shinoda Says 'No New Linkin Park Album In 2006 After All']. Retrieved June 9, 2007 The band had recorded thirty to fifty songs in August 2006, when Shinoda stated the album was halfway completed.MTV.com, [http://www.mtv.com/news/articles/1530011/20060502/shinoda_mike.jhtml Mike Shinoda Says Linkin Park Halfway Done With New Album]. Retrieved June 9, 2007 Bennington later added that the new album would stray away from its previous nu metal sound.MTV.com, [http://www.mtv.com/news/articles/1541846/20060927/linkin_park.jhtml?headlines\ntrue Linkin Park Say Nu-Metal Sound Is 'Completely Gone' On Next LP]. Retrieved June 9, 2007 Warner Bros. Records officially announced that the band's third studio album, titled Minutes to Midnight, would be released on May 15, 2007 in the United States. After spending fourteen months working on the album, the band members opted to further refine their album by removing five of the original seventeen tracks. The album's title, a reference to the Doomsday Clock, foreshadowed the band's new lyrical themes.MTV.com, [http://www.mtv.com/#/news/articles/1553982/20070306/linkin_park.jhtml Linkin Park Finish Apocalyptic Album, Revive Projekt Revolution Tour]. Retrieved June 9, 2007 Minutes to Midnight sold over 625,000 copies in its first week, making it one of the most successful debut week albums in recent years. The album also took the top spot on the Billboard Charts.\n\nThe album's first single, \"What I've Done\", was released on April 2, and premiered on MTV and Fuse within the same week. The single was acclaimed by listeners, becoming the top-ranked song on the Billboard's Modern Rock Tracks and Mainstream Rock Tracks charts. The song is also used in soundtrack for the 2007 action film, Transformers. Mike Shinoda was also featured on the Styles of Beyond song \"Second to None\", which was also included in the film. Later in the year, the band won the \"Favorite Alternative Artist\" in the American Music Awards.ShowBuzz.com, [http://www.showbuzz.cbsnews.com/stories/2007/11/19/music/main3519877.shtml American Music Awards – Winners List] . Retrieved March 21, 2008. The band also saw success with the rest of the album's singles, \"Bleed It Out\", \"Shadow of the Day\", \"Given Up\", and \"Leave Out All the Rest\", which were released throughout 2007 and early 2008. The band also collaborated with Busta Rhymes on his single \"We Made It\", which was released on April 29.[http://acharts.us/song/35392 – \"We Made It\" Music Charts (Canada)], aCharts. Retrieved May 12, 2008\n\nLinkin Park embarked on a large world tour titled \"Minutes to Midnight World Tour\". The band promoted the album's release by forming their fourth Projekt Revolution tour in the United States which included many musical acts like My Chemical Romance, Taking Back Sunday, HIM, Placebo, and many others. They also played numerous shows in Europe, Asia, and Australia which included a performance at Live Earth Japan on July 7, 2007.Billboard.com, [http://www.billboard.com/articles/news/1051064/linkin-park-local-stars-kickstart-live-earth-japan Linkin Park, Local Stars Kickstart Live Earth Japan]. Retrieved July 12, 2007 and headlining Download Festival in Donington Park, England and Edgefest in Downsview Park, Toronto, Ontario, Canada. The band completed touring on its fourth Projekt Revolution tour before taking up an Arena tour around the United Kingdom, visiting Nottingham, Sheffield and Manchester, before finishing on a double night at the O2 arena in London. Bennington stated that Linkin Park plans to release a follow-up album to Minutes to Midnight.Billboard.com, [http://www.billboard.com/articles/news/1046615/linkin-park-plans-quick-midnight-follow-up Linkin Park Plans Quick 'Midnight' Follow Up]. Retrieved February 13, 2008. However, he stated the band will first embark on a United States tour to gather inspiration for the album. Linkin Park embarked on another Projekt Revolution tour in 2008. This was the first time a Projekt Revolution tour was held in Europe with three shows in Germany and one in the United Kingdom. A Projekt Revolution tour was also held in the United States which featured Chris Cornell, The Bravery, Ashes Divide, Street Drum Corps and many others. Linkin Park finished the tour with a final show in Texas. Mike Shinoda announced a live CD/DVD titled Road to Revolution: Live at Milton Keynes, which is a live video recording from the Projekt Revolution gig at the Milton Keynes Bowl on June 29, 2008, which was officially released on November 24, 2008.\n\n2008–2011: A Thousand Suns\n\nIn May 2009, Linkin Park announced they were working on a fourth studio album, which was planned to be released in 2010. Shinoda told IGN that the new album would be 'genre-busting,' while building off of elements in Minutes to Midnight. He also mentioned that the album would be more experimental and \"hopefully more cutting-edge\". Bennington also addressed the media to confirm that Rick Rubin would return to produce the new album. The band later revealed the album would be called A Thousand Suns. While working on the new album, Linkin Park worked with successful film composer Hans Zimmer to produce the score for Transformers: Revenge of the Fallen. The band released a single for the movie, titled \"New Divide\". Joe Hahn created a music video for the song, which featured clips from the film. On June 22, Linkin Park played a short set in Westwood Village after the premier of the movie. After completing work for Transformers: Revenge of the Fallen, the band returned to the studio to finalize their album.\n\nOn April 26, the band released an app for the iPhone, iPod Touch, and iPad, a game called 8-Bit Rebellion! It featured the band as playable characters, and a new song called \"Blackbirds\" which was unlockable by beating the game. The song was also later released as an iTunes bonus track on A Thousand Suns.\n\nA Thousand Suns was released on September 14. The album's first single, \"The Catalyst\", was released on August 2. The band promoted their new album by launching a concert tour, which started in Los Angeles on September 7.[http://www.linkinpark.com/profiles/blogs/first-2010-linkin-park-tour First 2010 Linkin Park Tour Dates]  Retrieved on June 6, 2010 Linkin Park also relied on MySpace to promote their album, releasing two additional songs, \"Waiting for the End\" and \"Blackout\" on September 8. Furthermore, a documentary about the album's production, titled Meeting of A Thousand Suns, was available for streaming on the band's MySpace page. On August 31, 2010, it was announced that the band would perform the single live for the first time at the 2010 MTV Video Music Awards on September 12, 2010. The venue of the debut live performance of the single was Griffith Observatory, an iconic location used in Hollywood movies. \"Waiting for the End\" was released as the second single of A Thousand Suns.\n\nLinkin Park reached No.8 in Billboard Social 50, a chart of the most active artists on the world's leading social networking sites. In other Billboard Year-End charts, the band reached No.92 in the \"Top Artists\" chart, as well as A Thousand Suns reaching No.53 in the Year-End chart of the Billboard Top 200 albums and No.7 in the 2010 Year-End Rock Albums, and \"The Catalyst\" reaching No.40 in the Year-End Rock Songs chart.\n\nThe band was nominated for six Billboard Awards in 2011 for Top Duo or Group, Best Rock Album for A Thousand Suns, Top Rock Artist, Top Alternative Artist, Top Alternative Song for \"Waiting for the End\" and Top Alternative Album for A Thousand Suns, but did not win any award. The band charted in numerous Billboard Year-End charts in 2011. The band was No.39 in the Top Artists Chart, No.84 in the Billboard 200 Artists chart, No.11 in the Social 50 Chart, No.6 in the Top Rock Artists Chart, No.9 in the Rock Songs Artists Chart, No.16 in the Rock Albums Chart, No.4 in the Hard Rock Albums Chart, and No.7 in the Alternative Songs Chart.\n\n2011–2013: Living Things and Recharged\n\nIn July 2011, Bennington told Rolling Stone that Linkin Park aims to produce a new album every eighteen months, and that he would be shocked if a new album did not come out in 2012. He later revealed in another interview in September 2011 that the band was still in the beginning phases of the next album, saying \"We just kind of began. We like to keep the creative juices flowing, so we try to keep that going all the time ... we like the direction that we're going in\". Later, on March 28, 2012, Shinoda confirmed that the band is filming a music video for \"Burn It Down\". Joe Hahn directed the video. Shinoda spoke to Co.Create about the album's art, saying that it will \"blow them [the fans] away ... the average person is not going to be able to look at it and go, I understand that that's completely new, like not just the image but the way they made the image is totally new. So there's going to be that\".\n\nOn April 15, 2012, Shinoda announced that Living Things would be the title of Linkin Park's fifth album. Shinoda stated that they chose the title Living Things because the album is more about people, personal interactions, and it is far more personal than their previous albums. The band promoted the album on the 2012 edition of the Honda Civic Tour, with co-headliners Incubus. The band performed \"Burn It Down\" at 2012 Billboard Music Awards. On May 24, the band released the music video for \"Burn It Down\" and debuted \"Lies Greed Misery\", another song from Living Things, on BBC Radio 1. \"Powerless\", the twelfth and closing track of the album, was featured in the closing credits of the film Abraham Lincoln: Vampire Hunter.\n\nLiving Things sold over 223,000 copies during its debut week, ranking No. 1 on the US Albums Charts. Linkin Park's single, \"Castle of Glass\", was nominated for 'Best Song in a Game' at the 2012 Spike Video Game Awards. The band also performed at the award ceremony on December 7, but lost the award to \"Cities\" by Beck. Linkin Park also played at the Soundwave music festival in Australia, where they shared the stage with Metallica, Paramore, Slayer and Sum 41.\n\nOn August 10, 2013, the band collaborated with American musician Steve Aoki to record the song \"A Light That Never Comes\" for Linkin Park's online puzzle-action game LP Recharge (short for Linkin Park Recharge), which was launched on Facebook and the official LP Recharge website on September 12, 2013. On the day of the game's release, Linkin Park made a post on their Facebook explaining that the song used to promote the game would be included on a new remix album, entitled Recharged, which was released on October 29, 2013 on CD, vinyl, and digital download. Similar to Reanimation, the album features remixes of ten of the songs from Living Things, with contributions from other artists, such as Ryu of Styles of Beyond, Pusha T, Datsik, KillSonik, Bun B, Money Mark, and Rick Rubin. The band also worked on the soundtrack for the film Mall, which was directed by Joe Hahn.\n\n2013–2015: The Hunting Party\n\nIn an interview with Fuse, Shinoda confirmed that Linkin Park had begun recording their sixth studio album in May 2013. The band released the first single from their upcoming album, titled, \"Guilty All the Same\" on March 6, 2014 through Shazam. The single was later released on the following day by Warner Bros. Records and debut at No. 28 on the US Billboard Rock Airplay charts before peaking at No. 1 on the Mainstream Rock charts in the following weeks. Shortly after the single's release, the band revealed their sixth album would be titled The Hunting Party. The album was produced by Shinoda and Delson, who wanted to explore musical elements from Hybrid Theory and the band's earlier material. Shinoda commented the album is a \"90s style of rock record\". He elaborated, \"It's a rock record. It's loud and it's rock, but not in the sense of what you've heard before, which is more like '90s hardcore-punk-thrash.' The album includes musical contributions from rapper Rakim, Page Hamilton of Helmet, Tom Morello of Rage Against the Machine, and Daron Malakian of System of a Down. The Hunting Party was released on June 13, 2014, in most countries, and later released in the United States on June 17.\n\nLinkin Park performed at Download Festival on June 14, 2014, where they played their debut album, Hybrid Theory, in its entirety. Linkin Park headlined Rock am Ring and Rock im Park in 2014, along with Metallica, Kings of Leon, and Iron Maiden. They also headlined with Iron Maiden again at the Greenfield Festival in July. On June 22, Linkin Park made an unscheduled headline appearance at the Vans Warped Tour, where they played with members of Issues, The Devil Wears Prada, A Day To Remember, Yellowcard, Breathe Carolina, Finch, and Machine Gun Kelly. In January 2015, the band embarked on a tour to promote the release of The Hunting Party, consisting of 17 concerts across the United States and Canada. The tour was canceled after only three concerts when Bennington injured his ankle. On May 9, Linkin Park performed at the first edition of Rock in Rio USA, in direct support for Metallica.\n\nOn November 9, 2014, MTV Europe named Linkin Park the \"Best Rock\" act of 2014 at their annual music awards ceremony. The band won the 'Best Rock Band' and 'Best Live Act' titles of 2014 on Loudwire's Music Awards. Revolver ranked The Hunting Party as the fourth best album of 2014. In an interview with AltWire on May 4, Shinoda reflected on The Hunting Party and commented on Linkin Park's future, stating; \"I'm really happy with the reaction from The Hunting Party, and I think we're ready to move somewhere new on the next album, which will be coming [in 2016]\".\n\nLinkin Park collaborated with Steve Aoki on the song \"Darker Than Blood\" for Aoki's album Neon Future II, which was released in May 2015. The first preview of the song came during Aoki's performance on February 28, 2015 at the Aragon Ballroom in Chicago, Illinois. The song was debuted on Twitch.tv on April 13 and released on April 14.\n\nLinkin Park performed at the closing ceremony of Blizzcon 2015, Blizzard's video game convention.\n\n2015–present: One More Light and Bennington's death\n\nLinkin Park began working on new material for a seventh studio album in November 2015. Chester Bennington commented on the album's direction by stating, \"We’ve got a lot of great material that I hope challenges our fanbase as well as inspires them as much as it has us.\" In February 2017, Linkin Park released promotional videos on their social network accounts, which featured Shinoda and Bennington preparing new material for the album. Mike Shinoda stated the band was following a new process when producing the album. Brad Delson elaborated: \"We've made so many records and we clearly know how to make a record and we definitely didn't take the easy way out this time.\"\n\nThe first single from the new album was revealed to be titled \"Heavy\" and features pop singer Kiiara, the first time the band has featured a female vocalist on an original song for a studio album. The lyrics for the song were co-written by Linkin Park with Julia Michaels and Justin Tranter. The single was released for download on February 16. As they have done in the past, Linkin Park had cryptic messages online in relation to the new album. The album cover was revealed through digital puzzles across social media; The cover features six kids playing in the ocean. The band's seventh album, One More Light, was released on May 19, 2017.\n\nBennington died on July 20, 2017; his death was ruled a suicide by hanging. Shinoda confirmed Bennington's death on Twitter, writing \"Shocked and heartbroken, but it's true. An official statement will come out as soon as we have one\". The band had released a music video for their single \"Talking to Myself\" earlier that day. One day after Bennington's death, the band canceled the North American leg of their One More Light World Tour. On the morning of July 24, Linkin Park released an official statement on their website as a tribute to Bennington. On July 28, Shinoda announced that donations made to the band's Music for Relief charity would be redirected to the One More Light Fund, which had been set up in Bennington's memory. On August 4, when the band was initially scheduled to play on Good Morning America, Chris Cornell's twelve-year-old daughter Toni (who was also Bennington's goddaughter) appeared with OneRepublic to perform \"Hallelujah\" as a tribute to Bennington and her father. Bennington had previously performed the song at the funeral for Cornell, who had also died from a suicide by hanging two months earlier.\n\nOn August 22, Linkin Park announced plans to host a tribute concert in Los Angeles to honor Bennington. The band thanked fans for their support, stating, \"The five of us are so grateful for all of your support as we heal and build the future of Linkin Park\". The band later confirmed that the concert, titled Linkin Park and Friends - Celebrate Life In Honor of Chester Bennington, would take place on October 27 at the Hollywood Bowl. The event included Linkin Park's first performance following Bennington's death. The event featured multiple guests performing Linkin Park songs along with the band. The event was over three hours long and was streamed live via YouTube.\n\nIn November 2017, the band announced that a live album compiled from their final tour with Bennington, titled One More Light: Live, would be released on December 15. On November 19, Linkin Park received an American Music Award for Favorite Alternative Artist and dedicated the award to Bennington.\n\nCharity\n\nOn January 19, 2010, Linkin Park released a new song titled \"Not Alone\" as part of a compilation from Music for Relief called Download to Donate for Haiti in support of the Haiti Earthquake crisis. On February 10, 2010, Linkin Park released the official music video for the song on their homepage. The single itself was released on October 21, 2011.\n\nOn January 11, 2011, an updated version of Download to Donate for Haiti was launched, called Download to Donate for Haiti V2.0, with more songs to download. For the updated compilation, the band released Keaton Hashimoto's remix of \"The Catalyst\" from the \"Linkin Park featuring YOU\" contest.\n\nShinoda designed two T-shirts, in which the proceeds will go to Music for Relief to help the victims of the 2011 Tōhoku earthquake and tsunami disasters. Music for Relief released Download to Donate: Tsunami Relief Japan, another compilation of songs, in which the proceeds will go to Save the Children. The band released the song titled as \"Issho Ni\", meaning \"we're in this together\", on March 22, 2011 via Download to Donate: Tsunami Relief Japan.\n\nIn the wake of Typhoon Haiyan, Linkin Park played at Club Nokia during the \"Music for Relief: Concert for the Philippines\" in Los Angeles, and raised donations for victims. The show was broadcast on AXS TV on February 15. Other artists during the show included The Offspring, Bad Religion, Heart, and The Filharmonic.\n\nMusical style and influences\n\nLinkin Park combines elements of rock music, hip hop and electronica, and have been categorized as alternative metal and rap rock by AllMusic. They are also tagged as rap rock by About.com. Despite also being characterized as nu metal, the band never considered themselves as such. Their MusicMight biography lists them as alternative rock, nu metal and rap metal. WatchMojo.com identifies them as alternative rock, electronic rock and industrial rock, while Billboard characterizes them as alternative metal and electronic rock.\n\nBoth Hybrid Theory and Meteora combine the alternative metal, nu metal, and rap rock sound with influences and elements from hip hop, alternative rock, and electronica, utilizing programming and synthesizers. William Ruhlmann from AllMusic regarded it as \"a Johnny-come-lately to an already overdone musical style,\"Ruhlmann, William. Allmusic.com [ allmusic (((Hybrid Theory > Overview))):]. Retrieved May 30, 2007 whereas Rolling Stone described their song \"Breaking the Habit\" as \"risky, beautiful art\".\n\nIn Minutes to Midnight the band experimented with their established sound and drew influences from a wider and more varied range of genres and styles, a process Los Angeles Times compares to a stage in U2's work. In it, only two of the songs feature rapping, and the majority of the album can be considered alternative rock.IGN, [http://www.ign.com/articles/2007/05/15/linkin-park-minutes-to-midnight Linkin Park – Minutes To Midnight]. Retrieved January 27, 2008.Metacritic, [http://www.metacritic.com/music/minutes-to-midnight/linkin-park Minutes To Midnight]. Retrieved January 27, 2008. NME magazine's Dan Silver criticized the band's approach, calling it the \"sound of a band trying and failing to forge a new identity\", and referring to the song \"Hands Held High\", a song about terrorist attacks and war, as \"far and away the funniest thing you will hear all year\".Silver, Dan. [http://www.nme.com/reviews/linkin-park/8533 Review: Minutes to Midnight].NME. Retrieved November 8, 2009.\n\nThe vocal interplay between Chester Bennington and Mike Shinoda plays as a major part within Linkin Park's music, with Bennington being the lead vocalist and Shinoda as the rapping vocalist. On Linkin Park's third album, Minutes to Midnight, Shinoda sings lead vocals on \"In Between\", \"Hands Held High\", and on the B-side \"No Roads Left\". On numerous songs from band's fourth album, A Thousand Suns, such as the album's four singles (\"The Catalyst\", \"Waiting for the End\", \"Burning in the Skies\", \"Iridescent\"), both Shinoda and Bennington sing. On most of the record's tracks, the band notably used electronic drumbeats along with outro drumbeats. The album has been regarded as a turning point in the band's musical career, having a stronger emphasis on electronica. James Montgomery, of MTV, compared the record to Radiohead's Kid A, while Jordy Kasko of Review, Rinse, Repeat likened the album to both Kid A and Pink Floyd's landmark album The Dark Side of the Moon. Shinoda stated that he and the other band members were deeply influenced by Chuck D and Public Enemy. He elaborated: \"Public Enemy were very three-dimensional with their records because although they seemed political, there was a whole lot of other stuff going on in there too. It made me think how three-dimensional I wanted our record to be without imitating them of course, and show where we were at creatively\". One of the record's political elements is its samples of notable speeches by American political figures.\n\nTheir fifth album, Living Things, is also an electronic-heavy album, but includes other influences, resulting in a harder sound by comparison. The band returned to a heavier sound compared to their last three albums on The Hunting Party, which was described as an alternative metal and hard rock album. Their seventh album, One More Light, was described as pop, pop rock and electropop.\n\nLinkin Park's influences include Nine Inch Nails, Deftones, The Roots and Aphex Twin.\n\nLegacy and influence\n\nLinkin Park has sold more than 70 million records.[http://www.musicradar.com/news/linkin-parks-brad-delson-talks-one-more-light-there-really-is-a-ton-of-guitar-on-this-album Linkin Park’s Brad Delson talks One More Light: 'There really is a ton of guitar on this album'] MusicRadar April 3, 2017. Retrieved May 9, 2017. The group's first studio album Hybrid Theory is one of the best-selling albums in the US (10 million copies shipped) and worldwide (27 million copies sold). Billboard estimates that Linkin Park earned US$5 million between May 2011 and May 2012, making them the 40th-highest-paid musical artist.[http://www.billboard.com/articles/list/502623/musics-top-40-money-makers-2012 Music's Top 40 Money Makers 2012] Billboard 11 of the band's singles have reached the number one position on Billboard Alternative Songs chart, the second-most for any artist.\n\nIn 2003, MTV2 named Linkin Park the sixth-greatest band of the music video era and the third-best of the new millennium. Billboard ranked Linkin Park No. 19 on the Best Artists of the Decade chart. The band was recently voted as the greatest artist of the 2000s in a Bracket Madness poll on VH1. In 2014, the band was declared as the Biggest Rock Band in the World Right Now by Kerrang!. In 2015, Kerrang! gave \"In the End\" and \"Final Masquerade\" the top two positions on Kerrang!s Rock 100 list.[https://www.facebook.com/video.php?v\n10153206270906788&theater \"In the End\" and \"Final Masquerade\" have made it to the top of Kerrang!'s Rock 100 list] Facebook April 15, 2015.\n\nLinkin Park became the first rock band to achieve more than one billion YouTube hits.\nLinkin Park also became the fifteenth most liked page on Facebook, tenth most liked artist, and most liked group followed by the Black Eyed Peas.[https://www.facebook.com/linkinPark/likes Linkin Park - Likes]. Facebook. Retrieved September 24, 2014. Linkin Park's \"Numb\" is the third and \"In the End\" is the sixth \"timeless song\" on Spotify. The two songs making Linkin Park the only artist to have two timeless songs in top ten.[http://www.designntrend.com/articles/59692/20150826/eminems-lose-yourself-most-timeless-song-according-spotify-playlist.htm Eminem's 'Lose Yourself' Is The 'Most Timeless' Song According To Spotify Playlist] Design & Trend. August 26, 2015. Retrieved September 7, 2015.\n\nHybrid Theory by the group is listed in the book 1001 Albums You Must Hear Before You Die, It was also ranked at #11 on Billboard Hot 200 Albums of the Decade. In addition the album was included in Best of 2001 by Record Collector, The top 150 Albums of the Generation by Rock Sound and 50 Best Rock Albums of the 2000's by Kerrang!. The album Meteora was included in Top 200 Albums of the Decade by Billboard at #36. The album sold 20 million copies worldwide. The collaborated EP Collision Course with Jay-Z, became the second ever EP to top the Billboard 200, going on to sell over 300,000 copies in its first week after Alice in Chains' Jar of Flies in 1994. The album Minutes to Midnight in the United States, the album had the biggest first week sales of 2007 at the time, with 625,000 albums sold. In Canada, the album sold over 50,000 copies in its first week and debuted at number one on the Canadian Albums Chart. Worldwide, the album shipped over 3.3 million copies in its first four weeks of release.\n\nThe New York Times Jon Caramanica commented Linkin Park \"brought the collision of hard rock and hip-hop to its commercial and aesthetic peak\" at the beginning of the 2000s. Several rock and non-rock artists have cited Linkin Park as an influence, including Proyecto Eskhata, Of Mice & Men,[http://www.blabbermouth.net/news/of-mice-mens-austin-carlile-calls-pantera-my-dads-music-says-linkin-park-was-his-band/ OF MICE & MEN's AUSTIN CARLILE Calls PANTERA 'My Dad's Music', Says LINKIN PARK Was His Band] Blabbermouth One Ok Rock, Bishop Nehru,[http://www.billboard.com/articles/columns/the-juice/6561195/bishop-nehru-nehruvia-the-nehruvian-ep-premiere-interview Bishop Nehru Premieres 'Nehruvia: The Nehruvian' EP, Talks Stephen Curry & Advice from Nas] Billboard May 11, 2015. Retrieved May 23, 2015. Misono, From Ashes to New, Bring Me the Horizon,[http://radio.com/2015/09/25/bring-me-the-horizon-its-nice-to-know-that-everyones-as-messed-up-as-you/ Bring Me The Horizon: ‘It’s Nice to Know That Everyone’s As Messed Up As You’] CBS Radio September 25, 2015 . Retrieved October 23, 2015. Red, Girl on Fire, Manafest, Silentó,[http://www.eurweb.com/2015/09/find-out-who-inspires-the-godfathers-of-hip-hop-watch/  Find Out who inspires the godfathers of Hip Hop] Euroweb. September 6, 2015. Retrieved September 7, 2015. 3OH!3,[http://www.mtv.com/artists/linkin-park/related-artists/?filter\nfollowers Linkin Park - followers] MTV The Prom Kings, AJ Tracey, Kiiara,Conan Geisler Eigenmann [http://en.yibada.com/articles/143854/20160721/eminem-yelawolf-linkin-park-influenced-gold-singer-kiiara.htm Eminem, Yelawolf, Linkin Park influenced me: ‘Gold’ singer Kiiara] Yibada July 21, 2016. Retrieved July 30, 2016. The Chainsmokers,Kat Bein [http://www.billboard.com/articles/news/dance/7949981/the-chainsmokers-reddit-ama-highlights-video 10 Highlights From The Chainsmokers' Reddit AMA] Billboard. September 1, 2017. Retrieved September 7, 2017.  Kevin Rudolf, blackbear,[http://abcnewsradioonline.com/music-news/2017/3/21/producer-blackbear-thinks-one-more-light-is-linkin-parks-bes.html Producer blackbear thinks \"One More Light\" is Linkin Park's \"best album\" - Music News] ABC News Radio. Tokio Hotel, and Stormzy.[https://twitter.com/Stormzy1/status/828719414249979905 Stormzy Thinks Linkin Park are Legends] Twitter\n\nBand members\n\nCurrent members\n* Mike Shinoda – vocals, rhythm guitar, keyboard, synthesizer, samples, programming (1996–present)\n* Brad Delson – lead guitar, backing vocals (1996–present); bass (2000)\n* Dave Farrell – bass, backing vocals (1996–1998; 2000–present)\n* Joe Hahn – turntables, keyboard, synthesizer, samples, programming, backing vocals (1996–present)\n* Rob Bourdon – drums, percussion (1996–present)\n\nFormer members\n* Mark Wakefield – lead vocals (1996–1998)\n* Chester Bennington – lead vocals (1999–2017; died 2017)\n* Kyle Christner – bass (1998–1999)\n\nSession/touring members\n* Scott Koziol – bass (1999–2000)\n* Ian Hornbeck – bass (2000)\n* Benjamin Chandler – lead guitar (2014, 2015)\n* Warren Willis – turntables, keyboard (2015)\n\nTimeline\n\nDiscography\n\n* Hybrid Theory (2000)\n* Meteora (2003)\n* Minutes to Midnight (2007)\n* A Thousand Suns (2010)\n* Living Things (2012)\n* The Hunting Party (2014)\n* One More Light (2017)\n\nAwards and nominations\n\nConcert tours\n\nHeadlining\n* Hybrid Theory World Tour (2001) \n* Projekt Revolution (2002–2008, 2011)\n* LP Underground Tour (2003)\n* Meteora World Tour (2004)\n* Minutes to Midnight World Tour (2007–08)\n* International Tour (2009)\n* A Thousand Suns World Tour (2010–11)\n* Living Things World Tour (2012–13)\n* The Hunting Party Tour (2014–15)\n* One More Light Tour (2017)\n* Linkin Park and Friends - Celebrate Life In Honor of Chester Bennington (2017)\n\nCo-headlining\n* 11th Annual Honda Civic Tour (2012)\n* Carnivores Tour  (2014)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Linkin Park" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18646" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Linkin Park is an American rock band from Agoura Hills, California. Formed in 1996, the band rose to international fame with their debut album Hybrid Theory (2000), which was certified Diamond by the RIAA in 2005 and multi-Platinum in several other countries.Recording Industry Association of America, [https://www.riaa.com/goldandplatinumdata.php?table=tblDiamond RIAA Record Sales] . Retrieved June 13, 2007 Their following studio album Meteora continued the band's success, topping the Billboard 200 album chart in 2003, and was followed by extensive touring and charity work.\n\nHaving adapted nu metal and rap metal to a radio-friendly yet densely layered style in Hybrid Theory and Meteora,MSN Music, [http://music.msn.com/artist/?artist16483411&menu\nbio Linkin Park: Biography]. Retrieved June 14, 2007 the band explored other genres on their next studio album, Minutes to Midnight (2007). The album topped the Billboard charts and had the third-best debut week of any album that year.Billboard.com, [ M2M holds the top slot for the current week]. Retrieved May 28, 2007Billboard.com, [http://www.billboard.com/articles/news/1051972/linkin-park-scores-years-best-debut-with-midnight Linkin Park Scores Year's Best Debut With 'Midnight']. Retrieved May 28, 2007 The band continued to explore a wider variation of musical types in their fourth album, A Thousand Suns (2010), layering their music with more electronic sounds. Their fifth album, Living Things (2012), combines musical elements from all of their previous records. Their sixth album, The Hunting Party (2014), returned to a heavier rock sound. Their seventh album One More Light, a more electronic and pop-oriented record, was released on May 19, 2017.\n\nIn 2003, MTV2 named Linkin Park the sixth-greatest band of the music video era and the third-best of the new millennium. Billboard ranked Linkin Park No. 19 on the Best Artists of the Decade chart.Billboard Artists Of The Decade, [http://www.billboard.com/#/charts-decade-end/artists-of-the-decade?year2009&begin\n11&orderposition]. Retrieved August 15, 2011. In 2012, the band was voted as the greatest artist of the 2000s in a Bracket Madness poll on VH1. In 2014, the band was declared as the Biggest Rock Band in the World Right Now by Kerrang!.Emily [http://www.kerrang.com/21888/60-biggest-bands-planet-right-now/ The 60 Biggest Rock Band in the World Right Now] Kerrang! October 5, 2014. Retrieved October 20, 2014.[http://www.ultimate-guitar.com/news/general_music_news/linkin_park_are_the_biggest_rock_band_in_the_world_right_now.html Linkin Park Are the 'Biggest Rock Band in the World Right Now'] Ultimate Guitar August 28, 2014. Retrieved October 20, 2014. As the best-selling band of the 21st century and one of the world's best-selling music artists overall, Linkin Park has sold more than 70 million records worldwide and has won two Grammy Awards.\n\nHistory\n\n1996–2000: Early years\n\nLinkin Park was founded by three high school friends: Mike Shinoda, Rob Bourdon, and Brad Delson.AskMen.com, [http://www.askmen.com/celebs/men/entertainment_150/196_linkin_park.html Linkin Park – Biography]  Retrieved March 20, 2007 The three attended Agoura High School in Agoura Hills, California, a suburb of Los Angeles. After graduating from high school, the three began to take their musical interests more seriously, recruiting Joe Hahn, Dave \"Phoenix\" Farrell, and Mark Wakefield to perform in their band, then called Xero. Though limited in resources, the band began recording and producing songs within Shinoda's makeshift bedroom studio in 1996, resulting in a four-track demo tape, entitled Xero. Tensions and frustration within the band grew however after they failed to land a record deal. The lack of success and stalemate in progress prompted Wakefield, at that time the band's vocalist, to leave the band in search of other projects. Farrell also left to tour with Tasty Snax, a Christian punk and ska band.MusicMight.com, [http://www.musicmight.com/artist/united+states/california/los+angeles/linkin+park Linkin Park – MusicMight Biography] Retrieved March 20, 2007Livedaily.com,  Retrieved March 20, 2007\n\nAfter spending a considerable time searching for Wakefield's replacement, Xero recruited Arizona vocalist Chester Bennington, who was recommended by Jeff Blue, the vice president of Zomba Music in March 1999.Lptimes.com, [http://www.lptimes.com/bio/bio_band.html Band History]  Retrieved March 20, 2007 Bennington, formerly of a post-grunge band by the name of Grey Daze, became a standout among applicants because of the dynamic in his singing style. The band then agreed on changing its name from Xero to Hybrid Theory; the newborn vocal chemistry between Shinoda and Bennington helped revive the band, inciting them to work on new material. In 1999 the band released a self-titled extended play, which they circulated across internet chat-rooms and forums with the help of an online 'street team'. The band's renaissance culminated with another change in name, this time to Linkin Park, a play on and homage to Santa Monica's Lincoln Park (now called Christine Emerson Reed Park). The band initially wanted to use the name \"Lincoln Park\", however they changed it to \"Linkin\" to acquire the internet domain \"linkinpark.com\". The band still struggled to sign a record deal. Linkin Park turned to Jeff Blue for additional help after facing numerous rejections from several major record labels. After failing to catch Warner Bros. Records on three previous reviews, Jeff Blue, who had negotiated his employment contract with Warner Brothers to include signing Linkin Park, and was now the vice president of Warner Bros. Records, helped the band sign a deal with the company in 1999. The band released its breakthrough album, Hybrid Theory, the following year.\n\n2000–2002: Hybrid Theory and Reanimation\n\nLinkin Park released Hybrid Theory on October 24, 2000. The album, which represented half a decade's worth of the band's work, was edited by Don Gilmore. Hybrid Theory was a massive commercial success; it sold more than 4.8 million copies during its debut year, earning it the status of best-selling album of 2001, while singles such as \"Crawling\" and \"One Step Closer\" established themselves as staples among alternative rock radio play lists during the year. Additionally, other singles from the album were featured in films such as Dracula 2000, Little Nicky, and Valentine. Hybrid Theory won a Grammy Award for Best Hard Rock Performance for the song \"Crawling\" and was nominated for two other Grammy Awards: Best New Artist and Best Rock Album. MTV awarded the band their Best Rock Video and Best Direction awards for \"In the End\". Through the winning of the Grammy for Best Hard Rock Performance, Hybrid Theorys overall success had catapulted the band into mainstream success.\n\nDuring this time, Linkin Park received many invitations to perform on many high-profile tours and concerts including Ozzfest, Family Values Tour, and KROQ Almost Acoustic Christmas.MTV.com, [http://www.mtv.com/news/articles/1451189/20011126/story.jhtml Linkin Park, P.O.D., Nickelback, More To Play LA's KROQ Fest] Retrieved March 26, 2007 The band worked with Jessica Sklar to found their official fan club and street team, \"Linkin Park Underground\", in November 2001. Linkin Park also formed its own tour, Projekt Revolution, which featured other notable artists such as Cypress Hill, Adema, and Snoop Dogg. Within a year's stretch, Linkin Park had performed at over 320 concerts. The experiences and performances of the precocious band were documented in its first DVD, Frat Party at the Pankake Festival, which debuted in November 2001. Now reunited with former bassist Phoenix, the band began work on a remix album, dubbed Reanimation, which would include works from Hybrid Theory and non-album tracks. Reanimation debuted on July 30, 2002, featuring the likes of Black Thought, Jonathan Davis, Aaron Lewis, and many others. Reanimation claimed the second spot on the Billboard 200, and sold nearly 270,000 copies during its debut week. Hybrid Theory is also in the RIAA's Top 100 Albums.\n\n2002–2004: Meteora\n\nFollowing the success of Hybrid Theory and Reanimation, Linkin Park spent a significant amount of time touring around the United States. The band members began to work on new material amidst its saturated schedule, spending a sliver of their free time in their tour bus' studio.Warner Bros. Records, \"The Making of Meteora\" (2003) DVD, Released on March 25, 2003. The band officially announced the production of a new studio album in December 2002, revealing its new work was inspired by the rocky region of Meteora in Greece, where numerous monasteries have been built on top of the rocks.MTV.com, [http://www.mtv.com/news/articles/1459710/01272003/linkin_Park.jhtml Linkin Park Get Their Tempers Under Control To Complete New LP] Retrieved June 10, 2006 Meteora features a mixture of the band's nu metal and rap metal style with newer innovative effects, including the induction of a shakuhachi (a Japanese flute made of bamboo) and other instruments. Linkin Park's second album debuted on March 25, 2003 and instantly earned worldwide recognition, going to No. 1 in the US and UK, and No. 2 in Australia.\n\nMeteora sold more than 800,000 copies during its first week, and it ranked as the best selling album on the Billboard charts at the time. The album's singles, including \"Somewhere I Belong\", \"Breaking the Habit\", \"Faint\", and \"Numb\", received significant radio attention. By October 2003, Meteora sold nearly three million copies. The album's success allowed Linkin Park to form another Projekt Revolution, which featured other bands and artists including Mudvayne, Blindside, and Xzibit. Additionally, Metallica invited Linkin Park to play at the Summer Sanitarium Tour 2003, which included well-known acts such as Limp Bizkit, Mudvayne and Deftones.VH1.com, [http://www.vh1.com/artists/az/linkin_park/bio.jhtml Linkin Park: Biography] Retrieved on April 8, 2007 The band released an album and DVD, titled Live in Texas, which featured some audio and video tracks from the band's performances in Texas during the tour. In early 2004, Linkin Park started a world tour titled the Meteora World Tour. Supporting bands on the tour included Hoobastank, P.O.D., Story of the Year and Pia.\n\nMeteora earned the band multiple awards and honors. The band won the MTV awards for Best Rock Video for \"Somewhere I Belong\" and the Viewer's Choice Award for \"Breaking the Habit\". Linkin Park also received significant recognition during the 2004 Radio Music Awards, winning the Artist of the Year and Song of the Year (\"Numb\") awards. Although Meteora was not nearly as successful as Hybrid Theory, it was the third best selling album in the United States during 2003. The band spent the first few months of 2004 touring around the world, first with the third Projekt Revolution tour, and later several European concerts. At the same time, the band's relationship with Warner Bros. Records was deteriorating rapidly on account of several trust and financial issues. After months of feuding, the band finally negotiated a deal in December 2005.\n\n2004–2006: Side projects\n\nFollowing Meteoras success, the band worked on many side projects. Bennington appeared on DJ Lethal's \"State of the Art\" and other work with Dead by Sunrise, while Shinoda did work with Depeche Mode. In 2004, the band began to work with Jay-Z to produce another remix album, titled Collision Course. The album, which featured intermixed lyrics and background tracks from both artists' previous albums, debuted in November 2004. Shinoda also formed Fort Minor as a side project. With the aid of Jay-Z, Fort Minor released its debut album, The Rising Tied, to critical acclaim.\n\nLinkin Park also participated in numerous charitable events, most notably raised money to benefit victims of Hurricane Charley in 2004 and later Hurricane Katrina in 2005. The band donated $75,000 to the Special Operations Warrior Foundation in March 2004. They also helped relief efforts for the 2004 Indian Ocean tsunami victims by staging several charity concerts and setting up an additional fund called Music for Relief. Most notably, however, the band participated at Live 8, a series of charitable benefit concerts set up to raise global awareness.The Linkin Park Times, [http://www.lptimes.com/news2005/july/live8live.html Live 8 Philadelphia 2005]  Retrieved May 12, 2007 Alongside Jay-Z, the band performed on Live 8's stage in Philadelphia, Pennsylvania, to a global audience. The band would later be reunited with Jay-Z at the Grammy Award Ceremony 2006, during which they performed \"Numb/Encore\", en route to winning a Grammy for Best Rap/Sung Collaboration.About.com, [http://top40.about.com/b/a/207768.htm Jay-Z and Linkin Park to Mash-Up Onstage at the Grammys] . Retrieved June 9, 2007 They were joined on stage by Paul McCartney who added verses from the song \"Yesterday\". They would later go on to play at the 2006 Summer Sonic music festival, which was hosted by Metallica in Japan.\n\n2006–2008: Minutes to Midnight\n\nLinkin Park returned to the recording studios in 2006 to work on new material. To produce the album, the band chose producer Rick Rubin. Despite initially stating the album would debut sometime in 2006, the album was delayed until 2007.MTV.com, [http://www.mtv.com/news/articles/1539802/20060830/linkin_park.jhtml Mike Shinoda Says 'No New Linkin Park Album In 2006 After All']. Retrieved June 9, 2007 The band had recorded thirty to fifty songs in August 2006, when Shinoda stated the album was halfway completed.MTV.com, [http://www.mtv.com/news/articles/1530011/20060502/shinoda_mike.jhtml Mike Shinoda Says Linkin Park Halfway Done With New Album]. Retrieved June 9, 2007 Bennington later added that the new album would stray away from its previous nu metal sound.MTV.com, [http://www.mtv.com/news/articles/1541846/20060927/linkin_park.jhtml?headlines\ntrue Linkin Park Say Nu-Metal Sound Is 'Completely Gone' On Next LP]. Retrieved June 9, 2007 Warner Bros. Records officially announced that the band's third studio album, titled Minutes to Midnight, would be released on May 15, 2007 in the United States. After spending fourteen months working on the album, the band members opted to further refine their album by removing five of the original seventeen tracks. The album's title, a reference to the Doomsday Clock, foreshadowed the band's new lyrical themes.MTV.com, [http://www.mtv.com/#/news/articles/1553982/20070306/linkin_park.jhtml Linkin Park Finish Apocalyptic Album, Revive Projekt Revolution Tour]. Retrieved June 9, 2007 Minutes to Midnight sold over 625,000 copies in its first week, making it one of the most successful debut week albums in recent years. The album also took the top spot on the Billboard Charts.\n\nThe album's first single, \"What I've Done\", was released on April 2, and premiered on MTV and Fuse within the same week. The single was acclaimed by listeners, becoming the top-ranked song on the Billboard's Modern Rock Tracks and Mainstream Rock Tracks charts. The song is also used in soundtrack for the 2007 action film, Transformers. Mike Shinoda was also featured on the Styles of Beyond song \"Second to None\", which was also included in the film. Later in the year, the band won the \"Favorite Alternative Artist\" in the American Music Awards.ShowBuzz.com, [http://www.showbuzz.cbsnews.com/stories/2007/11/19/music/main3519877.shtml American Music Awards – Winners List] . Retrieved March 21, 2008. The band also saw success with the rest of the album's singles, \"Bleed It Out\", \"Shadow of the Day\", \"Given Up\", and \"Leave Out All the Rest\", which were released throughout 2007 and early 2008. The band also collaborated with Busta Rhymes on his single \"We Made It\", which was released on April 29.[http://acharts.us/song/35392 – \"We Made It\" Music Charts (Canada)], aCharts. Retrieved May 12, 2008\n\nLinkin Park embarked on a large world tour titled \"Minutes to Midnight World Tour\". The band promoted the album's release by forming their fourth Projekt Revolution tour in the United States which included many musical acts like My Chemical Romance, Taking Back Sunday, HIM, Placebo, and many others. They also played numerous shows in Europe, Asia, and Australia which included a performance at Live Earth Japan on July 7, 2007.Billboard.com, [http://www.billboard.com/articles/news/1051064/linkin-park-local-stars-kickstart-live-earth-japan Linkin Park, Local Stars Kickstart Live Earth Japan]. Retrieved July 12, 2007 and headlining Download Festival in Donington Park, England and Edgefest in Downsview Park, Toronto, Ontario, Canada. The band completed touring on its fourth Projekt Revolution tour before taking up an Arena tour around the United Kingdom, visiting Nottingham, Sheffield and Manchester, before finishing on a double night at the O2 arena in London. Bennington stated that Linkin Park plans to release a follow-up album to Minutes to Midnight.Billboard.com, [http://www.billboard.com/articles/news/1046615/linkin-park-plans-quick-midnight-follow-up Linkin Park Plans Quick 'Midnight' Follow Up]. Retrieved February 13, 2008. However, he stated the band will first embark on a United States tour to gather inspiration for the album. Linkin Park embarked on another Projekt Revolution tour in 2008. This was the first time a Projekt Revolution tour was held in Europe with three shows in Germany and one in the United Kingdom. A Projekt Revolution tour was also held in the United States which featured Chris Cornell, The Bravery, Ashes Divide, Street Drum Corps and many others. Linkin Park finished the tour with a final show in Texas. Mike Shinoda announced a live CD/DVD titled Road to Revolution: Live at Milton Keynes, which is a live video recording from the Projekt Revolution gig at the Milton Keynes Bowl on June 29, 2008, which was officially released on November 24, 2008.\n\n2008–2011: A Thousand Suns\n\nIn May 2009, Linkin Park announced they were working on a fourth studio album, which was planned to be released in 2010. Shinoda told IGN that the new album would be 'genre-busting,' while building off of elements in Minutes to Midnight. He also mentioned that the album would be more experimental and \"hopefully more cutting-edge\". Bennington also addressed the media to confirm that Rick Rubin would return to produce the new album. The band later revealed the album would be called A Thousand Suns. While working on the new album, Linkin Park worked with successful film composer Hans Zimmer to produce the score for Transformers: Revenge of the Fallen. The band released a single for the movie, titled \"New Divide\". Joe Hahn created a music video for the song, which featured clips from the film. On June 22, Linkin Park played a short set in Westwood Village after the premier of the movie. After completing work for Transformers: Revenge of the Fallen, the band returned to the studio to finalize their album.\n\nOn April 26, the band released an app for the iPhone, iPod Touch, and iPad, a game called 8-Bit Rebellion! It featured the band as playable characters, and a new song called \"Blackbirds\" which was unlockable by beating the game. The song was also later released as an iTunes bonus track on A Thousand Suns.\n\nA Thousand Suns was released on September 14. The album's first single, \"The Catalyst\", was released on August 2. The band promoted their new album by launching a concert tour, which started in Los Angeles on September 7.[http://www.linkinpark.com/profiles/blogs/first-2010-linkin-park-tour First 2010 Linkin Park Tour Dates]  Retrieved on June 6, 2010 Linkin Park also relied on MySpace to promote their album, releasing two additional songs, \"Waiting for the End\" and \"Blackout\" on September 8. Furthermore, a documentary about the album's production, titled Meeting of A Thousand Suns, was available for streaming on the band's MySpace page. On August 31, 2010, it was announced that the band would perform the single live for the first time at the 2010 MTV Video Music Awards on September 12, 2010. The venue of the debut live performance of the single was Griffith Observatory, an iconic location used in Hollywood movies. \"Waiting for the End\" was released as the second single of A Thousand Suns.\n\nLinkin Park reached No.8 in Billboard Social 50, a chart of the most active artists on the world's leading social networking sites. In other Billboard Year-End charts, the band reached No.92 in the \"Top Artists\" chart, as well as A Thousand Suns reaching No.53 in the Year-End chart of the Billboard Top 200 albums and No.7 in the 2010 Year-End Rock Albums, and \"The Catalyst\" reaching No.40 in the Year-End Rock Songs chart.\n\nThe band was nominated for six Billboard Awards in 2011 for Top Duo or Group, Best Rock Album for A Thousand Suns, Top Rock Artist, Top Alternative Artist, Top Alternative Song for \"Waiting for the End\" and Top Alternative Album for A Thousand Suns, but did not win any award. The band charted in numerous Billboard Year-End charts in 2011. The band was No.39 in the Top Artists Chart, No.84 in the Billboard 200 Artists chart, No.11 in the Social 50 Chart, No.6 in the Top Rock Artists Chart, No.9 in the Rock Songs Artists Chart, No.16 in the Rock Albums Chart, No.4 in the Hard Rock Albums Chart, and No.7 in the Alternative Songs Chart.\n\n2011–2013: Living Things and Recharged\n\nIn July 2011, Bennington told Rolling Stone that Linkin Park aims to produce a new album every eighteen months, and that he would be shocked if a new album did not come out in 2012. He later revealed in another interview in September 2011 that the band was still in the beginning phases of the next album, saying \"We just kind of began. We like to keep the creative juices flowing, so we try to keep that going all the time ... we like the direction that we're going in\". Later, on March 28, 2012, Shinoda confirmed that the band is filming a music video for \"Burn It Down\". Joe Hahn directed the video. Shinoda spoke to Co.Create about the album's art, saying that it will \"blow them [the fans] away ... the average person is not going to be able to look at it and go, I understand that that's completely new, like not just the image but the way they made the image is totally new. So there's going to be that\".\n\nOn April 15, 2012, Shinoda announced that Living Things would be the title of Linkin Park's fifth album. Shinoda stated that they chose the title Living Things because the album is more about people, personal interactions, and it is far more personal than their previous albums. The band promoted the album on the 2012 edition of the Honda Civic Tour, with co-headliners Incubus. The band performed \"Burn It Down\" at 2012 Billboard Music Awards. On May 24, the band released the music video for \"Burn It Down\" and debuted \"Lies Greed Misery\", another song from Living Things, on BBC Radio 1. \"Powerless\", the twelfth and closing track of the album, was featured in the closing credits of the film Abraham Lincoln: Vampire Hunter.\n\nLiving Things sold over 223,000 copies during its debut week, ranking No. 1 on the US Albums Charts. Linkin Park's single, \"Castle of Glass\", was nominated for 'Best Song in a Game' at the 2012 Spike Video Game Awards. The band also performed at the award ceremony on December 7, but lost the award to \"Cities\" by Beck. Linkin Park also played at the Soundwave music festival in Australia, where they shared the stage with Metallica, Paramore, Slayer and Sum 41.\n\nOn August 10, 2013, the band collaborated with American musician Steve Aoki to record the song \"A Light That Never Comes\" for Linkin Park's online puzzle-action game LP Recharge (short for Linkin Park Recharge), which was launched on Facebook and the official LP Recharge website on September 12, 2013. On the day of the game's release, Linkin Park made a post on their Facebook explaining that the song used to promote the game would be included on a new remix album, entitled Recharged, which was released on October 29, 2013 on CD, vinyl, and digital download. Similar to Reanimation, the album features remixes of ten of the songs from Living Things, with contributions from other artists, such as Ryu of Styles of Beyond, Pusha T, Datsik, KillSonik, Bun B, Money Mark, and Rick Rubin. The band also worked on the soundtrack for the film Mall, which was directed by Joe Hahn.\n\n2013–2015: The Hunting Party\n\nIn an interview with Fuse, Shinoda confirmed that Linkin Park had begun recording their sixth studio album in May 2013. The band released the first single from their upcoming album, titled, \"Guilty All the Same\" on March 6, 2014 through Shazam. The single was later released on the following day by Warner Bros. Records and debut at No. 28 on the US Billboard Rock Airplay charts before peaking at No. 1 on the Mainstream Rock charts in the following weeks. Shortly after the single's release, the band revealed their sixth album would be titled The Hunting Party. The album was produced by Shinoda and Delson, who wanted to explore musical elements from Hybrid Theory and the band's earlier material. Shinoda commented the album is a \"90s style of rock record\". He elaborated, \"It's a rock record. It's loud and it's rock, but not in the sense of what you've heard before, which is more like '90s hardcore-punk-thrash.' The album includes musical contributions from rapper Rakim, Page Hamilton of Helmet, Tom Morello of Rage Against the Machine, and Daron Malakian of System of a Down. The Hunting Party was released on June 13, 2014, in most countries, and later released in the United States on June 17.\n\nLinkin Park performed at Download Festival on June 14, 2014, where they played their debut album, Hybrid Theory, in its entirety. Linkin Park headlined Rock am Ring and Rock im Park in 2014, along with Metallica, Kings of Leon, and Iron Maiden. They also headlined with Iron Maiden again at the Greenfield Festival in July. On June 22, Linkin Park made an unscheduled headline appearance at the Vans Warped Tour, where they played with members of Issues, The Devil Wears Prada, A Day To Remember, Yellowcard, Breathe Carolina, Finch, and Machine Gun Kelly. In January 2015, the band embarked on a tour to promote the release of The Hunting Party, consisting of 17 concerts across the United States and Canada. The tour was canceled after only three concerts when Bennington injured his ankle. On May 9, Linkin Park performed at the first edition of Rock in Rio USA, in direct support for Metallica.\n\nOn November 9, 2014, MTV Europe named Linkin Park the \"Best Rock\" act of 2014 at their annual music awards ceremony. The band won the 'Best Rock Band' and 'Best Live Act' titles of 2014 on Loudwire's Music Awards. Revolver ranked The Hunting Party as the fourth best album of 2014. In an interview with AltWire on May 4, Shinoda reflected on The Hunting Party and commented on Linkin Park's future, stating; \"I'm really happy with the reaction from The Hunting Party, and I think we're ready to move somewhere new on the next album, which will be coming [in 2016]\".\n\nLinkin Park collaborated with Steve Aoki on the song \"Darker Than Blood\" for Aoki's album Neon Future II, which was released in May 2015. The first preview of the song came during Aoki's performance on February 28, 2015 at the Aragon Ballroom in Chicago, Illinois. The song was debuted on Twitch.tv on April 13 and released on April 14.\n\nLinkin Park performed at the closing ceremony of Blizzcon 2015, Blizzard's video game convention.\n\n2015–present: One More Light and Bennington's death\n\nLinkin Park began working on new material for a seventh studio album in November 2015. Chester Bennington commented on the album's direction by stating, \"We’ve got a lot of great material that I hope challenges our fanbase as well as inspires them as much as it has us.\" In February 2017, Linkin Park released promotional videos on their social network accounts, which featured Shinoda and Bennington preparing new material for the album. Mike Shinoda stated the band was following a new process when producing the album. Brad Delson elaborated: \"We've made so many records and we clearly know how to make a record and we definitely didn't take the easy way out this time.\"\n\nThe first single from the new album was revealed to be titled \"Heavy\" and features pop singer Kiiara, the first time the band has featured a female vocalist on an original song for a studio album. The lyrics for the song were co-written by Linkin Park with Julia Michaels and Justin Tranter. The single was released for download on February 16. As they have done in the past, Linkin Park had cryptic messages online in relation to the new album. The album cover was revealed through digital puzzles across social media; The cover features six kids playing in the ocean. The band's seventh album, One More Light, was released on May 19, 2017.\n\nBennington died on July 20, 2017; his death was ruled a suicide by hanging. Shinoda confirmed Bennington's death on Twitter, writing \"Shocked and heartbroken, but it's true. An official statement will come out as soon as we have one\". The band had released a music video for their single \"Talking to Myself\" earlier that day. One day after Bennington's death, the band canceled the North American leg of their One More Light World Tour. On the morning of July 24, Linkin Park released an official statement on their website as a tribute to Bennington. On July 28, Shinoda announced that donations made to the band's Music for Relief charity would be redirected to the One More Light Fund, which had been set up in Bennington's memory. On August 4, when the band was initially scheduled to play on Good Morning America, Chris Cornell's twelve-year-old daughter Toni (who was also Bennington's goddaughter) appeared with OneRepublic to perform \"Hallelujah\" as a tribute to Bennington and her father. Bennington had previously performed the song at the funeral for Cornell, who had also died from a suicide by hanging two months earlier.\n\nOn August 22, Linkin Park announced plans to host a tribute concert in Los Angeles to honor Bennington. The band thanked fans for their support, stating, \"The five of us are so grateful for all of your support as we heal and build the future of Linkin Park\". The band later confirmed that the concert, titled Linkin Park and Friends - Celebrate Life In Honor of Chester Bennington, would take place on October 27 at the Hollywood Bowl. The event included Linkin Park's first performance following Bennington's death. The event featured multiple guests performing Linkin Park songs along with the band. The event was over three hours long and was streamed live via YouTube.\n\nIn November 2017, the band announced that a live album compiled from their final tour with Bennington, titled One More Light: Live, would be released on December 15. On November 19, Linkin Park received an American Music Award for Favorite Alternative Artist and dedicated the award to Bennington.\n\nCharity\n\nOn January 19, 2010, Linkin Park released a new song titled \"Not Alone\" as part of a compilation from Music for Relief called Download to Donate for Haiti in support of the Haiti Earthquake crisis. On February 10, 2010, Linkin Park released the official music video for the song on their homepage. The single itself was released on October 21, 2011.\n\nOn January 11, 2011, an updated version of Download to Donate for Haiti was launched, called Download to Donate for Haiti V2.0, with more songs to download. For the updated compilation, the band released Keaton Hashimoto's remix of \"The Catalyst\" from the \"Linkin Park featuring YOU\" contest.\n\nShinoda designed two T-shirts, in which the proceeds will go to Music for Relief to help the victims of the 2011 Tōhoku earthquake and tsunami disasters. Music for Relief released Download to Donate: Tsunami Relief Japan, another compilation of songs, in which the proceeds will go to Save the Children. The band released the song titled as \"Issho Ni\", meaning \"we're in this together\", on March 22, 2011 via Download to Donate: Tsunami Relief Japan.\n\nIn the wake of Typhoon Haiyan, Linkin Park played at Club Nokia during the \"Music for Relief: Concert for the Philippines\" in Los Angeles, and raised donations for victims. The show was broadcast on AXS TV on February 15. Other artists during the show included The Offspring, Bad Religion, Heart, and The Filharmonic.\n\nMusical style and influences\n\nLinkin Park combines elements of rock music, hip hop and electronica, and have been categorized as alternative metal and rap rock by AllMusic. They are also tagged as rap rock by About.com. Despite also being characterized as nu metal, the band never considered themselves as such. Their MusicMight biography lists them as alternative rock, nu metal and rap metal. WatchMojo.com identifies them as alternative rock, electronic rock and industrial rock, while Billboard characterizes them as alternative metal and electronic rock.\n\nBoth Hybrid Theory and Meteora combine the alternative metal, nu metal, and rap rock sound with influences and elements from hip hop, alternative rock, and electronica, utilizing programming and synthesizers. William Ruhlmann from AllMusic regarded it as \"a Johnny-come-lately to an already overdone musical style,\"Ruhlmann, William. Allmusic.com [ allmusic (((Hybrid Theory > Overview))):]. Retrieved May 30, 2007 whereas Rolling Stone described their song \"Breaking the Habit\" as \"risky, beautiful art\".\n\nIn Minutes to Midnight the band experimented with their established sound and drew influences from a wider and more varied range of genres and styles, a process Los Angeles Times compares to a stage in U2's work. In it, only two of the songs feature rapping, and the majority of the album can be considered alternative rock.IGN, [http://www.ign.com/articles/2007/05/15/linkin-park-minutes-to-midnight Linkin Park – Minutes To Midnight]. Retrieved January 27, 2008.Metacritic, [http://www.metacritic.com/music/minutes-to-midnight/linkin-park Minutes To Midnight]. Retrieved January 27, 2008. NME magazine's Dan Silver criticized the band's approach, calling it the \"sound of a band trying and failing to forge a new identity\", and referring to the song \"Hands Held High\", a song about terrorist attacks and war, as \"far and away the funniest thing you will hear all year\".Silver, Dan. [http://www.nme.com/reviews/linkin-park/8533 Review: Minutes to Midnight].NME. Retrieved November 8, 2009.\n\nThe vocal interplay between Chester Bennington and Mike Shinoda plays as a major part within Linkin Park's music, with Bennington being the lead vocalist and Shinoda as the rapping vocalist. On Linkin Park's third album, Minutes to Midnight, Shinoda sings lead vocals on \"In Between\", \"Hands Held High\", and on the B-side \"No Roads Left\". On numerous songs from band's fourth album, A Thousand Suns, such as the album's four singles (\"The Catalyst\", \"Waiting for the End\", \"Burning in the Skies\", \"Iridescent\"), both Shinoda and Bennington sing. On most of the record's tracks, the band notably used electronic drumbeats along with outro drumbeats. The album has been regarded as a turning point in the band's musical career, having a stronger emphasis on electronica. James Montgomery, of MTV, compared the record to Radiohead's Kid A, while Jordy Kasko of Review, Rinse, Repeat likened the album to both Kid A and Pink Floyd's landmark album The Dark Side of the Moon. Shinoda stated that he and the other band members were deeply influenced by Chuck D and Public Enemy. He elaborated: \"Public Enemy were very three-dimensional with their records because although they seemed political, there was a whole lot of other stuff going on in there too. It made me think how three-dimensional I wanted our record to be without imitating them of course, and show where we were at creatively\". One of the record's political elements is its samples of notable speeches by American political figures.\n\nTheir fifth album, Living Things, is also an electronic-heavy album, but includes other influences, resulting in a harder sound by comparison. The band returned to a heavier sound compared to their last three albums on The Hunting Party, which was described as an alternative metal and hard rock album. Their seventh album, One More Light, was described as pop, pop rock and electropop.\n\nLinkin Park's influences include Nine Inch Nails, Deftones, The Roots and Aphex Twin.\n\nLegacy and influence\n\nLinkin Park has sold more than 70 million records.[http://www.musicradar.com/news/linkin-parks-brad-delson-talks-one-more-light-there-really-is-a-ton-of-guitar-on-this-album Linkin Park’s Brad Delson talks One More Light: 'There really is a ton of guitar on this album'] MusicRadar April 3, 2017. Retrieved May 9, 2017. The group's first studio album Hybrid Theory is one of the best-selling albums in the US (10 million copies shipped) and worldwide (27 million copies sold). Billboard estimates that Linkin Park earned US$5 million between May 2011 and May 2012, making them the 40th-highest-paid musical artist.[http://www.billboard.com/articles/list/502623/musics-top-40-money-makers-2012 Music's Top 40 Money Makers 2012] Billboard 11 of the band's singles have reached the number one position on Billboard Alternative Songs chart, the second-most for any artist.\n\nIn 2003, MTV2 named Linkin Park the sixth-greatest band of the music video era and the third-best of the new millennium. Billboard ranked Linkin Park No. 19 on the Best Artists of the Decade chart. The band was recently voted as the greatest artist of the 2000s in a Bracket Madness poll on VH1. In 2014, the band was declared as the Biggest Rock Band in the World Right Now by Kerrang!. In 2015, Kerrang! gave \"In the End\" and \"Final Masquerade\" the top two positions on Kerrang!s Rock 100 list.[https://www.facebook.com/video.php?v\n10153206270906788&theater \"In the End\" and \"Final Masquerade\" have made it to the top of Kerrang!'s Rock 100 list] Facebook April 15, 2015.\n\nLinkin Park became the first rock band to achieve more than one billion YouTube hits.\nLinkin Park also became the fifteenth most liked page on Facebook, tenth most liked artist, and most liked group followed by the Black Eyed Peas.[https://www.facebook.com/linkinPark/likes Linkin Park - Likes]. Facebook. Retrieved September 24, 2014. Linkin Park's \"Numb\" is the third and \"In the End\" is the sixth \"timeless song\" on Spotify. The two songs making Linkin Park the only artist to have two timeless songs in top ten.[http://www.designntrend.com/articles/59692/20150826/eminems-lose-yourself-most-timeless-song-according-spotify-playlist.htm Eminem's 'Lose Yourself' Is The 'Most Timeless' Song According To Spotify Playlist] Design & Trend. August 26, 2015. Retrieved September 7, 2015.\n\nHybrid Theory by the group is listed in the book 1001 Albums You Must Hear Before You Die, It was also ranked at #11 on Billboard Hot 200 Albums of the Decade. In addition the album was included in Best of 2001 by Record Collector, The top 150 Albums of the Generation by Rock Sound and 50 Best Rock Albums of the 2000's by Kerrang!. The album Meteora was included in Top 200 Albums of the Decade by Billboard at #36. The album sold 20 million copies worldwide. The collaborated EP Collision Course with Jay-Z, became the second ever EP to top the Billboard 200, going on to sell over 300,000 copies in its first week after Alice in Chains' Jar of Flies in 1994. The album Minutes to Midnight in the United States, the album had the biggest first week sales of 2007 at the time, with 625,000 albums sold. In Canada, the album sold over 50,000 copies in its first week and debuted at number one on the Canadian Albums Chart. Worldwide, the album shipped over 3.3 million copies in its first four weeks of release.\n\nThe New York Times Jon Caramanica commented Linkin Park \"brought the collision of hard rock and hip-hop to its commercial and aesthetic peak\" at the beginning of the 2000s. Several rock and non-rock artists have cited Linkin Park as an influence, including Proyecto Eskhata, Of Mice & Men,[http://www.blabbermouth.net/news/of-mice-mens-austin-carlile-calls-pantera-my-dads-music-says-linkin-park-was-his-band/ OF MICE & MEN's AUSTIN CARLILE Calls PANTERA 'My Dad's Music', Says LINKIN PARK Was His Band] Blabbermouth One Ok Rock, Bishop Nehru,[http://www.billboard.com/articles/columns/the-juice/6561195/bishop-nehru-nehruvia-the-nehruvian-ep-premiere-interview Bishop Nehru Premieres 'Nehruvia: The Nehruvian' EP, Talks Stephen Curry & Advice from Nas] Billboard May 11, 2015. Retrieved May 23, 2015. Misono, From Ashes to New, Bring Me the Horizon,[http://radio.com/2015/09/25/bring-me-the-horizon-its-nice-to-know-that-everyones-as-messed-up-as-you/ Bring Me The Horizon: ‘It’s Nice to Know That Everyone’s As Messed Up As You’] CBS Radio September 25, 2015 . Retrieved October 23, 2015. Red, Girl on Fire, Manafest, Silentó,[http://www.eurweb.com/2015/09/find-out-who-inspires-the-godfathers-of-hip-hop-watch/  Find Out who inspires the godfathers of Hip Hop] Euroweb. September 6, 2015. Retrieved September 7, 2015. 3OH!3,[http://www.mtv.com/artists/linkin-park/related-artists/?filter\nfollowers Linkin Park - followers] MTV The Prom Kings, AJ Tracey, Kiiara,Conan Geisler Eigenmann [http://en.yibada.com/articles/143854/20160721/eminem-yelawolf-linkin-park-influenced-gold-singer-kiiara.htm Eminem, Yelawolf, Linkin Park influenced me: ‘Gold’ singer Kiiara] Yibada July 21, 2016. Retrieved July 30, 2016. The Chainsmokers,Kat Bein [http://www.billboard.com/articles/news/dance/7949981/the-chainsmokers-reddit-ama-highlights-video 10 Highlights From The Chainsmokers' Reddit AMA] Billboard. September 1, 2017. Retrieved September 7, 2017.  Kevin Rudolf, blackbear,[http://abcnewsradioonline.com/music-news/2017/3/21/producer-blackbear-thinks-one-more-light-is-linkin-parks-bes.html Producer blackbear thinks \"One More Light\" is Linkin Park's \"best album\" - Music News] ABC News Radio. Tokio Hotel, and Stormzy.[https://twitter.com/Stormzy1/status/828719414249979905 Stormzy Thinks Linkin Park are Legends] Twitter\n\nBand members\n\nCurrent members\n* Mike Shinoda – vocals, rhythm guitar, keyboard, synthesizer, samples, programming (1996–present)\n* Brad Delson – lead guitar, backing vocals (1996–present); bass (2000)\n* Dave Farrell – bass, backing vocals (1996–1998; 2000–present)\n* Joe Hahn – turntables, keyboard, synthesizer, samples, programming, backing vocals (1996–present)\n* Rob Bourdon – drums, percussion (1996–present)\n\nFormer members\n* Mark Wakefield – lead vocals (1996–1998)\n* Chester Bennington – lead vocals (1999–2017; died 2017)\n* Kyle Christner – bass (1998–1999)\n\nSession/touring members\n* Scott Koziol – bass (1999–2000)\n* Ian Hornbeck – bass (2000)\n* Benjamin Chandler – lead guitar (2014, 2015)\n* Warren Willis – turntables, keyboard (2015)\n\nTimeline\n\nDiscography\n\n* Hybrid Theory (2000)\n* Meteora (2003)\n* Minutes to Midnight (2007)\n* A Thousand Suns (2010)\n* Living Things (2012)\n* The Hunting Party (2014)\n* One More Light (2017)\n\nAwards and nominations\n\nConcert tours\n\nHeadlining\n* Hybrid Theory World Tour (2001) \n* Projekt Revolution (2002–2008, 2011)\n* LP Underground Tour (2003)\n* Meteora World Tour (2004)\n* Minutes to Midnight World Tour (2007–08)\n* International Tour (2009)\n* A Thousand Suns World Tour (2010–11)\n* Living Things World Tour (2012–13)\n* The Hunting Party Tour (2014–15)\n* One More Light Tour (2017)\n* Linkin Park and Friends - Celebrate Life In Honor of Chester Bennington (2017)\n\nCo-headlining\n* 11th Annual Honda Civic Tour (2012)\n* Carnivores Tour  (2014). Linkin Park. http://en.wikipedia.org/?curid=18646."
  }
}
