{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7892",
  "eid" : "e3e513d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778462093,
  "textBody" : "David Paul Cronenberg,  (born March 15, 1943) is a Canadian director, screenwriter and actor. Cronenberg is one of the principal originators of what is commonly known as the body horror or visceral horror genre. This style of filmmaking explores people's fears of bodily transformation and infection. In his films, the psychological is typically intertwined with the physical.\n\nIn the first half of his career, he explored these themes mostly through horror and science fiction, although his work has since expanded beyond these genres. His films have won numerous awards, including the Jury Prize at the Cannes Film Festival for his film Crash (1996).\n\nCronenberg's films have polarized audiences and critics alike; he has earned critical acclaim and has sparked controversy for his depictions of gore and violence. The Village Voice called him \"the most audacious and challenging narrative director in the English-speaking world\".\n\nEarly life\n\nBorn in Toronto, Ontario, Cronenberg is the son of Esther (née Sumberg), a musician, and Milton Cronenberg, a writer and editor. He was raised in a \"middle-class progressive Jewish family\".http://www.egs.edu/faculty/david-cronenberg/biography/.\" His father was born in Baltimore, Maryland, and his mother was born in Toronto; all of his grandparents were from Lithuania.\n\nHe began writing as a child and wrote constantly. He attended high school at Harbord Collegiate Institute and North Toronto Collegiate Institute. A keen interest in science, especially botany and lepidopterology, led him to enter the Honours Science program at the University of Toronto in 1963, but he switched to Honours English Language and Literature later in his first year.\n\nCronenberg's fascination with the film Winter Kept Us Warm (1966), by classmate David Secter, sparked his interest in film. He began frequenting film camera rental houses, learning the art of filmmaking, and made two 16mm films (Transfer and From the Drain). Inspired by the New York underground film scene, he founded the Toronto Film Co-op with Iain Ewing and Ivan Reitman. After taking a year off to travel in Europe, he returned to Canada in 1967 and graduated from University College at the top of his class.\n\nCareer\n\nAfter two short sketch films and two short art-house features (the black-and-white Stereo and the colour Crimes of the Future) Cronenberg went into partnership with Ivan Reitman. The Canadian government provided financing for his films throughout the 1970s. He alternated his signature \"body horror\" films such as Shivers with projects reflecting his interest in car racing and bike gangs (Fast Company). Rabid provided pornographic actress Marilyn Chambers with work in a different genre. (Cronenberg's first choice for the role had been a then little-known Sissy Spacek). Rabid was a breakthrough with international distributors, and his next two horror features gained stronger support.\n\nCronenberg's films follow a definite progression: a movement from the social world to the inner life. In his early films, scientists modify human bodies, which results in the breakdown of social order (e.g. Shivers, Rabid). In his middle period, the chaos wrought by the scientist is more personal, (e.g. The Brood, Scanners, Videodrome). In the later middle period, the scientist himself is altered by his experiment (e.g. his remake of The Fly). This trajectory culminates in Dead Ringers in which a twin pair of gynecologists spiral into codependency and drug addiction. His later films tend more to the psychological, often contrasting subjective and objective realities (eXistenZ, M. Butterfly, Spider).\n\nCronenberg has cited William S. Burroughs and Vladimir Nabokov as influences. Perhaps the best example of a film that straddles the line between his works of personal chaos and psychological confusion is Cronenberg's 1991 \"adaptation\" of Naked Lunch (1959), his literary hero William S. Burroughs' most controversial book. The novel was considered \"unfilmable\", and Cronenberg acknowledged that a straight translation into film would \"cost 400 million dollars and be banned in every country in the world\". Instead—much like in his earlier film, Videodrome—he consistently blurred the lines between what appeared to be reality and what appeared to be hallucinations brought on by the main character's drug addiction. Some of the book's \"moments\" (as well as incidents loosely based upon Burroughs' life) are presented in this manner within the film. Cronenberg stated that while writing the screenplay for Naked Lunch (1991), he felt a moment of synergy with Burroughs' writing style. He felt the connection between his screenwriting style and Burroughs' prose style was so strong, that he jokingly remarked that should Burroughs pass on, \"I'll just write his next book.\"\n\nCronenberg has said that his films should be seen \"from the point of view of the disease\", and that in Shivers, for example, he identifies with the characters after they become infected with the anarchic parasites. Disease and disaster, in Cronenberg's work, are less problems to be overcome than agents of personal transformation. Of his characters' transformations, Cronenberg said, \"But because of our necessity to impose our own structure of perception on things we look on ourselves as being relatively stable. But, in fact, when I look at a person I see this maelstrom of organic, chemical and electron chaos; volatility and instability, shimmering; and the ability to change and transform and transmute.\" Similarly, in Crash (1996), people who have been injured in car crashes attempt to view their ordeal as \"a fertilizing rather than a destructive event\". In 2005, Cronenberg publicly disagreed with Paul Haggis' choice of the same name for the latter's Academy Award winning film Crash (2004), arguing that it was \"very disrespectful\" to the \"important and seminal\" J.G. Ballard novel on which Cronenberg's film was based.\n\nAside from The Dead Zone (1983) and The Fly (1986), Cronenberg has not generally worked within the world of big-budget, mainstream Hollywood filmmaking, although he has had occasional near misses. At one stage he was considered by George Lucas as a possible director for Return of the Jedi (1983) but was passed over. Cronenberg also worked for nearly a year on a version of Total Recall (1990), but experienced \"creative differences\" with producers Dino De Laurentiis and Ronald Shusett; a different version of the film was eventually made by Paul Verhoeven. A fan of Philip K. Dick's, author of \"We Can Remember it For You Wholesale\", the short story upon which the film was based, Cronenberg related in the biography/overview of his work, Cronenberg on Cronenberg (1992) that his dissatisfaction with what he envisioned the film to be and what it ended up being pained him so greatly that for a time, he suffered a migraine just thinking about it, akin to a needle piercing his eye.\n\nIn the late 1990s, Cronenberg was announced as director of a sequel to another Verhoeven film, Basic Instinct (1992), but this also fell through. His thriller A History of Violence (2005) is one of his highest budgeted and most accessible to date. He has said that the decision to direct it was influenced by his having had to defer some of his salary on the low-budgeted Spider (2002), but it was one of his most critically acclaimed films to date, along with Eastern Promises (2007), a film about the struggle of one man to gain power in the Russian Mafia.\n\nCronenberg has collaborated with composer Howard Shore on all of his films since The Brood (1979), (see List of noted film director and composer collaborations) with the exception of The Dead Zone (1983), which was scored by Michael Kamen. Other regular collaborators include actor Robert Silverman, art director Carol Spier, sound editor Bryan Day, film editor Ronald Sanders, his sister, costume designer Denise Cronenberg, and, from 1979 until 1988, cinematographer Mark Irwin. In 2008, Cronenberg directed Howard Shore's first opera, The Fly.\n\nSince Dead Ringers (1988), Cronenberg has worked with cinematographer Peter Suschitzky on each of his films (see List of film director and cinematographer collaborations). Suschitzky was the director of photography for The Empire Strikes Back (1980), and Cronenberg remarked that Suschitzky's work in that film \"was the only one of those movies that actually looked good\", which was a motivating factor to work with him on Dead Ringers.\n\nHaving worked with many Hollywood stars, Cronenberg says that he did not get to make a film with an actor he wanted to work with for a long time, Burt Reynolds. Cronenberg remains a staunchly Canadian filmmaker, with nearly all of his films (including major studio vehicles The Dead Zone and The Fly) having been filmed in his home province Ontario. Notable exceptions include M. Butterfly (1993), most of which was shot in China, Spider, and Eastern Promises (2007), which were both filmed primarily in England, and A Dangerous Method (2011), which was filmed in Germany and Austria. Rabid and Shivers were shot in and around Montreal. Most of his films have been at least partially financed by Telefilm Canada, and Cronenberg, a vocal supporter of government-backed film projects, has said: \"Every country needs [a system of government grants] in order to have a national cinema in the face of Hollywood\".\n\nCronenberg has also appeared as an actor in other directors' films. Most of his roles are cameo appearances, as in the films Into the Night (1985), Blood and Donuts (1995), To Die For (1995), and Jason X (2002) and the television series Alias, but on occasion he has played major roles, as in Nightbreed (1990) and Last Night (1998). He has not played major roles in any of his own films, but he did put in a brief appearance as a gynecologist in The Fly; he can also be glimpsed among the sex-crazed hordes in Shivers; he can be heard as an unseen car-pound attendant in Crash; his hands can be glimpsed in eXistenZ (1999); and he appeared as a stand-in for James Woods in Videodrome for shots in which Woods' character wore a helmet that covered his head.\n\nIn 2008, Cronenberg realized two extra-cinematographic projects: the exhibition Chromosomes at the Rome Film Fest, and the opera The Fly at the LaOpera in Los Angeles and Theatre Châtelet in Paris. In July 2010, Cronenberg completed production on A Dangerous Method (2011), an adaptation of Christopher Hampton's play The Talking Cure, starring Keira Knightley, Michael Fassbender, and frequent collaborator Viggo Mortensen. The film was produced by independent British producer Jeremy Thomas.\n\nIn 2012, his film Cosmopolis competed for the Palme d'Or at the 2012 Cannes Film Festival.\n\nIn the October 2011 edition of Rue Morgue, Cronenberg stated that he has written a companion piece to his 1986 remake of The Fly, which he would like to direct if given the chance. He has stated that it is not a traditional sequel, but rather a \"parallel story\".\n\nFor a time it appeared that, as Eastern Promises producer Paul Webster told Screen International, a sequel is in the works that would reunite the key team of Cronenberg, Steven Knight, and Viggo Mortensen. The film was to be made by Webster's new production company Shoebox Films in collaboration with Focus Features, and shot in early 2013. However, in 2012, Cronenberg commented that the Eastern Promises sequel had fallen through due to budget disagreement with Focus Features. \n\nFilming for Cronenberg's next film, a satire drama entitled Maps to the Stars (2014)—with Julianne Moore, Mia Wasikowska, John Cusack, and Robert Pattinson—began on July 8, 2013 in Toronto, Ontario and Los Angeles. This was the first time Cronenberg filmed in the United States.\n\nIn a September 2013 interview, Cronenberg stated that he is not concerned about posthumous representations of his film work: \"It wouldn't disturb me to think that my work would just sink beneath the waves without trace and that would be it. So what? It doesn't bother me.\" In the same interview, Cronenberg revealed that it depends on the \"time of day\" as to whether or not he is afraid of death.\n\nOn June 26, 2014, Cronenberg's short film The Nest was published on YouTube. The film was commissioned for \"David Cronenberg - The Exhibition\" at EYE Film Institute in Amsterdam and was available on YouTube for the duration of the exhibition, until September 14, 2014.\n\nFiction\n\nIn 2014, Cronenberg published his first novel, Consumed.\n\nPersonal life\n\nHe married his first wife, Margaret Hindson, in 1972: their seven-year marriage ended in 1979 amidst personal and professional differences. They had one daughter, Cassandra Cronenberg.\n\nHe was married to film editor Carolyn Zeifman until her death in 2017. The couple met on the set of Rabid while she was working as a production assistant. They have two children, Caitlin and Brandon. In the book Cronenberg on Cronenberg (1992), he revealed that The Brood was inspired by events that occurred during the unraveling of his first marriage, which caused both Cronenberg and his daughter Cassandra a great deal of turmoil. The character Nola Carveth, mother of the brood, is based on Cassandra's mother. Cronenberg said that he found the shooting of the climactic scene, in which Nola was strangled by her husband, to be \"very satisfying\". \n\nCronenberg lives in Toronto.\n\nCronenberg describes himself as an atheist. \"I'm an atheist,\" Cronenberg said.\" \"I'm simply a nonbeliever and have been forever. ... I'm interested in saying, 'Let us discuss the existential question. We are all going to die, that is the end of all consciousness. There is no afterlife. There is no God. Now what do we do.' That's the point where it starts getting interesting to me.\" His atheism was further explained in a September 2013 interview:\n\n\"Anytime I've tried to imagine squeezing myself into the box of any particular religion, I find it claustrophobic and oppressive. I think atheism is an acceptance of what is real.\"\n\nIn the same interview, Cronenberg revealed that film director Martin Scorsese admitted to him that he was intrigued by Cronenberg's early work but was subsequently \"terrified\" to meet him in person. Cronenberg responded to Scorsese: \"You're the guy who made Taxi Driver and you're afraid to meet me?\"\n\nAwards and recognition \n\nCronenberg has appeared on various \"Greatest Director\" lists. In 2004, Science Fiction magazine Strange Horizons named him the second greatest director in the history of the genre, ahead of better known directors such as Steven Spielberg, James Cameron, Jean-Luc Godard, and Ridley Scott. In the same year, The Guardian listed him 9th on their list of \"The world's 40 best directors\". In 2007, Total Film named him as the 17th greatest director of all-time. Film professor Charles Derry, in his overview of the horror genre Dark Dreams, called the director one of the most important in his field, and that \"no discussion of contemporary horror film can conclude without reference to the films of David Cronenberg.\"\n\nCronenberg received the Special Jury Prize at the 1996 Cannes Film Festival for Crash. In 1999, he was inducted onto Canada's Walk of Fame,  awarded the Silver Bear Award at the 49th Berlin International Film Festival. and that November received the Governor General's Performing Arts Award, Canada's highest honour in the performing arts.\n\nIn 2002, he was made an Officer of the Order of Canada, and was promoted to Companion of the Order of Canada (the order's highest rank) in 2014. In 2006 he was awarded the Cannes Film Festival's lifetime achievement award, the Carrosse d'Or. Also in 2006, Cronenberg was made a Fellow of the Royal Society of Canada, the senior national body of distinguished Canadian scientists and scholars. In 2009 Cronenberg received the Légion d'honneur from the government of France. The following year Cronenberg was named an honorary patron of the University Philosophical Society, Trinity College, Dublin. In 2012, he received the Queen Elizabeth II Diamond Jubilee Medal.\n\nThe opening of the \"David Cronenberg: Evolution\" Toronto International Film Festival (TIFF) exhibition occurred on October 30, 2013. Held at the TIFF Bell Lightbox venue, the exhibition paid tribute to the director's entire filmmaking career and the festival's promotional material referred to Cronenberg as \"one of Canada's most prolific and iconic filmmakers\". The exhibition was shown internationally following the conclusion of the TIFF showing on January 19, 2014.\n\nIn 2014, he was made a Member of the Order of Ontario in recognition for being \"Canada's most celebrated internationally acclaimed filmmaker\".\n\nFilmography\n\nAs director\n\n;Feature films\n* Stereo (1969)\n* Crimes of the Future (1970)\n* Shivers (1975)\n* Rabid (1977)\n* Fast Company (1979)\n* The Brood (1979)\n* Scanners (1981)\n* Videodrome (1983)\n* The Dead Zone (1983)\n* The Fly (1986)\n* Dead Ringers (1988)\n* Naked Lunch (1991)\n* M. Butterfly (1993)\n* Crash (1996)\n* eXistenZ (1999)\n* Spider (2002)\n* A History of Violence (2005)\n* Eastern Promises (2007)\n* A Dangerous Method (2011)\n* Cosmopolis (2012)\n* Maps to the Stars (2014)\n\n;Short films\n* Transfer (1966)\n* From the Drain (1967)\n* Camera (2000)\n* To Each His Own Cinema (Chacun son cinéma) (2007)\n** segment: At the Suicide of the Last Jew in the World in the Last Cinema in the World\n* The Nest (2013)10-minute dramatic short for the TIFF exhibition David Cronenberg: Evolution (Toronto 2013/14); \n\n;Television spots\n* Jim Ritchie Sculptor (1971)\n* Letter from Michelangelo (1971)\n* Tourettes (1971)\n* Don Valley (1972)\n* Fort York (1972)\n* Lakeshore (1972)\n* Winter Garden (1972)\n* Scarborough Bluffs (1972)\n* In the Dirt (1972)\n\n;Television series\n* Programme X\n** Episode: \"Secret Weapons\" (1972)\n* Peep Show\n** Episodes: \"The Victim\" (1975) & \"The Lie Chair\" [1975]\n* Teleplay\n** Episode: \"The Italian Machine\" (1976) \n* Friday the 13th: The Series\n** Episode: \"Faith Healer\" (1987)\n* Scales of Justice\n** Episodes: \"Regina vs Horvath\" (1990) & \"Regina vs Logan\" (1990)\n\n;Commercials\n* Hydro\n** Client: Ontario Hydro\n** Product: Energy conservation\n** Agency: Burghardt Wolowich Crunkhorn\n** Production company: The Partners' Film Company Ltd.\n** Format: 4 x 30-second commercials\n** Titles: Hot Showers, Laundry, Cleaners, Timers\n* Caramilk\n** Client: William Neilson Ltd.\n** Product: Cadbury Caramilk\n** Agency: Scali McCabe, Sloves (Canada) Ltd.\n** Production company: The Partners' Film Company Ltd.\n** Format: 2 x 30-second commercials\n** Titles: Bistro, Surveillance\n* Nike\n** Client: Nike International\n** Product: Nike Air 180\n** Agency: Wieden and Kennedy\n** Production company: The Partners' Film Company Ltd.\n** Format: 1 x 15-second/4 x 30-second commercials\n** Title: Transformation\n\nAs producer\n\n* Transfer (1966)\n* Stereo (1969)\n* Crimes of the Future (1970)\n* Dead Ringers (1988)\n* Crash (1996)\n* I'm Losing You (1998)\n* eXistenZ (1999)\n* Spider (2002)\n\nAs actor\n\n* Videodrome (1983, uncredited)Cronenberg, David; Irwin, Mark (2004). Director David Cronenberg and Director of Photography Mark Irwin commentary on Videodrome [DVD; Audio Track 2]. Criterion Collection. (According to the DVD, the commentary was recorded in Toronto and Los Angeles in the winter and spring of 2004)\n* Into the Night (1985)\n* The Fly (1986, cameo)\n* Nightbreed (1990)\n* Henry & Verlin (1994)\n* To Die For (1995, cameo)\n* Blood and Donuts (1995)\n* The Stupids (1996, cameo)\n* Extreme Measures (1996, cameo)\n* The Newsroom (TV) (1997) (Episode \"The Meltdown: Part 1\")\n* Last Night (1998)\n* Resurrection (1999)\n* Jason X (2002) - Dr. Wimmer\n* Alias (TV) (2003) (Episodes \"Remnants\" and \"Conscious\")\n* Barney's Version (2010, cameo)\n* Alias Grace (TV) (2017)\n\nRecurring collaborators\n\nWritings\n\n* \n* \n* \n* \n* \n* \n*",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "David Cronenberg" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7892" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "David Paul Cronenberg,  (born March 15, 1943) is a Canadian director, screenwriter and actor. Cronenberg is one of the principal originators of what is commonly known as the body horror or visceral horror genre. This style of filmmaking explores people's fears of bodily transformation and infection. In his films, the psychological is typically intertwined with the physical.\n\nIn the first half of his career, he explored these themes mostly through horror and science fiction, although his work has since expanded beyond these genres. His films have won numerous awards, including the Jury Prize at the Cannes Film Festival for his film Crash (1996).\n\nCronenberg's films have polarized audiences and critics alike; he has earned critical acclaim and has sparked controversy for his depictions of gore and violence. The Village Voice called him \"the most audacious and challenging narrative director in the English-speaking world\".\n\nEarly life\n\nBorn in Toronto, Ontario, Cronenberg is the son of Esther (née Sumberg), a musician, and Milton Cronenberg, a writer and editor. He was raised in a \"middle-class progressive Jewish family\".http://www.egs.edu/faculty/david-cronenberg/biography/.\" His father was born in Baltimore, Maryland, and his mother was born in Toronto; all of his grandparents were from Lithuania.\n\nHe began writing as a child and wrote constantly. He attended high school at Harbord Collegiate Institute and North Toronto Collegiate Institute. A keen interest in science, especially botany and lepidopterology, led him to enter the Honours Science program at the University of Toronto in 1963, but he switched to Honours English Language and Literature later in his first year.\n\nCronenberg's fascination with the film Winter Kept Us Warm (1966), by classmate David Secter, sparked his interest in film. He began frequenting film camera rental houses, learning the art of filmmaking, and made two 16mm films (Transfer and From the Drain). Inspired by the New York underground film scene, he founded the Toronto Film Co-op with Iain Ewing and Ivan Reitman. After taking a year off to travel in Europe, he returned to Canada in 1967 and graduated from University College at the top of his class.\n\nCareer\n\nAfter two short sketch films and two short art-house features (the black-and-white Stereo and the colour Crimes of the Future) Cronenberg went into partnership with Ivan Reitman. The Canadian government provided financing for his films throughout the 1970s. He alternated his signature \"body horror\" films such as Shivers with projects reflecting his interest in car racing and bike gangs (Fast Company). Rabid provided pornographic actress Marilyn Chambers with work in a different genre. (Cronenberg's first choice for the role had been a then little-known Sissy Spacek). Rabid was a breakthrough with international distributors, and his next two horror features gained stronger support.\n\nCronenberg's films follow a definite progression: a movement from the social world to the inner life. In his early films, scientists modify human bodies, which results in the breakdown of social order (e.g. Shivers, Rabid). In his middle period, the chaos wrought by the scientist is more personal, (e.g. The Brood, Scanners, Videodrome). In the later middle period, the scientist himself is altered by his experiment (e.g. his remake of The Fly). This trajectory culminates in Dead Ringers in which a twin pair of gynecologists spiral into codependency and drug addiction. His later films tend more to the psychological, often contrasting subjective and objective realities (eXistenZ, M. Butterfly, Spider).\n\nCronenberg has cited William S. Burroughs and Vladimir Nabokov as influences. Perhaps the best example of a film that straddles the line between his works of personal chaos and psychological confusion is Cronenberg's 1991 \"adaptation\" of Naked Lunch (1959), his literary hero William S. Burroughs' most controversial book. The novel was considered \"unfilmable\", and Cronenberg acknowledged that a straight translation into film would \"cost 400 million dollars and be banned in every country in the world\". Instead—much like in his earlier film, Videodrome—he consistently blurred the lines between what appeared to be reality and what appeared to be hallucinations brought on by the main character's drug addiction. Some of the book's \"moments\" (as well as incidents loosely based upon Burroughs' life) are presented in this manner within the film. Cronenberg stated that while writing the screenplay for Naked Lunch (1991), he felt a moment of synergy with Burroughs' writing style. He felt the connection between his screenwriting style and Burroughs' prose style was so strong, that he jokingly remarked that should Burroughs pass on, \"I'll just write his next book.\"\n\nCronenberg has said that his films should be seen \"from the point of view of the disease\", and that in Shivers, for example, he identifies with the characters after they become infected with the anarchic parasites. Disease and disaster, in Cronenberg's work, are less problems to be overcome than agents of personal transformation. Of his characters' transformations, Cronenberg said, \"But because of our necessity to impose our own structure of perception on things we look on ourselves as being relatively stable. But, in fact, when I look at a person I see this maelstrom of organic, chemical and electron chaos; volatility and instability, shimmering; and the ability to change and transform and transmute.\" Similarly, in Crash (1996), people who have been injured in car crashes attempt to view their ordeal as \"a fertilizing rather than a destructive event\". In 2005, Cronenberg publicly disagreed with Paul Haggis' choice of the same name for the latter's Academy Award winning film Crash (2004), arguing that it was \"very disrespectful\" to the \"important and seminal\" J.G. Ballard novel on which Cronenberg's film was based.\n\nAside from The Dead Zone (1983) and The Fly (1986), Cronenberg has not generally worked within the world of big-budget, mainstream Hollywood filmmaking, although he has had occasional near misses. At one stage he was considered by George Lucas as a possible director for Return of the Jedi (1983) but was passed over. Cronenberg also worked for nearly a year on a version of Total Recall (1990), but experienced \"creative differences\" with producers Dino De Laurentiis and Ronald Shusett; a different version of the film was eventually made by Paul Verhoeven. A fan of Philip K. Dick's, author of \"We Can Remember it For You Wholesale\", the short story upon which the film was based, Cronenberg related in the biography/overview of his work, Cronenberg on Cronenberg (1992) that his dissatisfaction with what he envisioned the film to be and what it ended up being pained him so greatly that for a time, he suffered a migraine just thinking about it, akin to a needle piercing his eye.\n\nIn the late 1990s, Cronenberg was announced as director of a sequel to another Verhoeven film, Basic Instinct (1992), but this also fell through. His thriller A History of Violence (2005) is one of his highest budgeted and most accessible to date. He has said that the decision to direct it was influenced by his having had to defer some of his salary on the low-budgeted Spider (2002), but it was one of his most critically acclaimed films to date, along with Eastern Promises (2007), a film about the struggle of one man to gain power in the Russian Mafia.\n\nCronenberg has collaborated with composer Howard Shore on all of his films since The Brood (1979), (see List of noted film director and composer collaborations) with the exception of The Dead Zone (1983), which was scored by Michael Kamen. Other regular collaborators include actor Robert Silverman, art director Carol Spier, sound editor Bryan Day, film editor Ronald Sanders, his sister, costume designer Denise Cronenberg, and, from 1979 until 1988, cinematographer Mark Irwin. In 2008, Cronenberg directed Howard Shore's first opera, The Fly.\n\nSince Dead Ringers (1988), Cronenberg has worked with cinematographer Peter Suschitzky on each of his films (see List of film director and cinematographer collaborations). Suschitzky was the director of photography for The Empire Strikes Back (1980), and Cronenberg remarked that Suschitzky's work in that film \"was the only one of those movies that actually looked good\", which was a motivating factor to work with him on Dead Ringers.\n\nHaving worked with many Hollywood stars, Cronenberg says that he did not get to make a film with an actor he wanted to work with for a long time, Burt Reynolds. Cronenberg remains a staunchly Canadian filmmaker, with nearly all of his films (including major studio vehicles The Dead Zone and The Fly) having been filmed in his home province Ontario. Notable exceptions include M. Butterfly (1993), most of which was shot in China, Spider, and Eastern Promises (2007), which were both filmed primarily in England, and A Dangerous Method (2011), which was filmed in Germany and Austria. Rabid and Shivers were shot in and around Montreal. Most of his films have been at least partially financed by Telefilm Canada, and Cronenberg, a vocal supporter of government-backed film projects, has said: \"Every country needs [a system of government grants] in order to have a national cinema in the face of Hollywood\".\n\nCronenberg has also appeared as an actor in other directors' films. Most of his roles are cameo appearances, as in the films Into the Night (1985), Blood and Donuts (1995), To Die For (1995), and Jason X (2002) and the television series Alias, but on occasion he has played major roles, as in Nightbreed (1990) and Last Night (1998). He has not played major roles in any of his own films, but he did put in a brief appearance as a gynecologist in The Fly; he can also be glimpsed among the sex-crazed hordes in Shivers; he can be heard as an unseen car-pound attendant in Crash; his hands can be glimpsed in eXistenZ (1999); and he appeared as a stand-in for James Woods in Videodrome for shots in which Woods' character wore a helmet that covered his head.\n\nIn 2008, Cronenberg realized two extra-cinematographic projects: the exhibition Chromosomes at the Rome Film Fest, and the opera The Fly at the LaOpera in Los Angeles and Theatre Châtelet in Paris. In July 2010, Cronenberg completed production on A Dangerous Method (2011), an adaptation of Christopher Hampton's play The Talking Cure, starring Keira Knightley, Michael Fassbender, and frequent collaborator Viggo Mortensen. The film was produced by independent British producer Jeremy Thomas.\n\nIn 2012, his film Cosmopolis competed for the Palme d'Or at the 2012 Cannes Film Festival.\n\nIn the October 2011 edition of Rue Morgue, Cronenberg stated that he has written a companion piece to his 1986 remake of The Fly, which he would like to direct if given the chance. He has stated that it is not a traditional sequel, but rather a \"parallel story\".\n\nFor a time it appeared that, as Eastern Promises producer Paul Webster told Screen International, a sequel is in the works that would reunite the key team of Cronenberg, Steven Knight, and Viggo Mortensen. The film was to be made by Webster's new production company Shoebox Films in collaboration with Focus Features, and shot in early 2013. However, in 2012, Cronenberg commented that the Eastern Promises sequel had fallen through due to budget disagreement with Focus Features. \n\nFilming for Cronenberg's next film, a satire drama entitled Maps to the Stars (2014)—with Julianne Moore, Mia Wasikowska, John Cusack, and Robert Pattinson—began on July 8, 2013 in Toronto, Ontario and Los Angeles. This was the first time Cronenberg filmed in the United States.\n\nIn a September 2013 interview, Cronenberg stated that he is not concerned about posthumous representations of his film work: \"It wouldn't disturb me to think that my work would just sink beneath the waves without trace and that would be it. So what? It doesn't bother me.\" In the same interview, Cronenberg revealed that it depends on the \"time of day\" as to whether or not he is afraid of death.\n\nOn June 26, 2014, Cronenberg's short film The Nest was published on YouTube. The film was commissioned for \"David Cronenberg - The Exhibition\" at EYE Film Institute in Amsterdam and was available on YouTube for the duration of the exhibition, until September 14, 2014.\n\nFiction\n\nIn 2014, Cronenberg published his first novel, Consumed.\n\nPersonal life\n\nHe married his first wife, Margaret Hindson, in 1972: their seven-year marriage ended in 1979 amidst personal and professional differences. They had one daughter, Cassandra Cronenberg.\n\nHe was married to film editor Carolyn Zeifman until her death in 2017. The couple met on the set of Rabid while she was working as a production assistant. They have two children, Caitlin and Brandon. In the book Cronenberg on Cronenberg (1992), he revealed that The Brood was inspired by events that occurred during the unraveling of his first marriage, which caused both Cronenberg and his daughter Cassandra a great deal of turmoil. The character Nola Carveth, mother of the brood, is based on Cassandra's mother. Cronenberg said that he found the shooting of the climactic scene, in which Nola was strangled by her husband, to be \"very satisfying\". \n\nCronenberg lives in Toronto.\n\nCronenberg describes himself as an atheist. \"I'm an atheist,\" Cronenberg said.\" \"I'm simply a nonbeliever and have been forever. ... I'm interested in saying, 'Let us discuss the existential question. We are all going to die, that is the end of all consciousness. There is no afterlife. There is no God. Now what do we do.' That's the point where it starts getting interesting to me.\" His atheism was further explained in a September 2013 interview:\n\n\"Anytime I've tried to imagine squeezing myself into the box of any particular religion, I find it claustrophobic and oppressive. I think atheism is an acceptance of what is real.\"\n\nIn the same interview, Cronenberg revealed that film director Martin Scorsese admitted to him that he was intrigued by Cronenberg's early work but was subsequently \"terrified\" to meet him in person. Cronenberg responded to Scorsese: \"You're the guy who made Taxi Driver and you're afraid to meet me?\"\n\nAwards and recognition \n\nCronenberg has appeared on various \"Greatest Director\" lists. In 2004, Science Fiction magazine Strange Horizons named him the second greatest director in the history of the genre, ahead of better known directors such as Steven Spielberg, James Cameron, Jean-Luc Godard, and Ridley Scott. In the same year, The Guardian listed him 9th on their list of \"The world's 40 best directors\". In 2007, Total Film named him as the 17th greatest director of all-time. Film professor Charles Derry, in his overview of the horror genre Dark Dreams, called the director one of the most important in his field, and that \"no discussion of contemporary horror film can conclude without reference to the films of David Cronenberg.\"\n\nCronenberg received the Special Jury Prize at the 1996 Cannes Film Festival for Crash. In 1999, he was inducted onto Canada's Walk of Fame,  awarded the Silver Bear Award at the 49th Berlin International Film Festival. and that November received the Governor General's Performing Arts Award, Canada's highest honour in the performing arts.\n\nIn 2002, he was made an Officer of the Order of Canada, and was promoted to Companion of the Order of Canada (the order's highest rank) in 2014. In 2006 he was awarded the Cannes Film Festival's lifetime achievement award, the Carrosse d'Or. Also in 2006, Cronenberg was made a Fellow of the Royal Society of Canada, the senior national body of distinguished Canadian scientists and scholars. In 2009 Cronenberg received the Légion d'honneur from the government of France. The following year Cronenberg was named an honorary patron of the University Philosophical Society, Trinity College, Dublin. In 2012, he received the Queen Elizabeth II Diamond Jubilee Medal.\n\nThe opening of the \"David Cronenberg: Evolution\" Toronto International Film Festival (TIFF) exhibition occurred on October 30, 2013. Held at the TIFF Bell Lightbox venue, the exhibition paid tribute to the director's entire filmmaking career and the festival's promotional material referred to Cronenberg as \"one of Canada's most prolific and iconic filmmakers\". The exhibition was shown internationally following the conclusion of the TIFF showing on January 19, 2014.\n\nIn 2014, he was made a Member of the Order of Ontario in recognition for being \"Canada's most celebrated internationally acclaimed filmmaker\".\n\nFilmography\n\nAs director\n\n;Feature films\n* Stereo (1969)\n* Crimes of the Future (1970)\n* Shivers (1975)\n* Rabid (1977)\n* Fast Company (1979)\n* The Brood (1979)\n* Scanners (1981)\n* Videodrome (1983)\n* The Dead Zone (1983)\n* The Fly (1986)\n* Dead Ringers (1988)\n* Naked Lunch (1991)\n* M. Butterfly (1993)\n* Crash (1996)\n* eXistenZ (1999)\n* Spider (2002)\n* A History of Violence (2005)\n* Eastern Promises (2007)\n* A Dangerous Method (2011)\n* Cosmopolis (2012)\n* Maps to the Stars (2014)\n\n;Short films\n* Transfer (1966)\n* From the Drain (1967)\n* Camera (2000)\n* To Each His Own Cinema (Chacun son cinéma) (2007)\n** segment: At the Suicide of the Last Jew in the World in the Last Cinema in the World\n* The Nest (2013)10-minute dramatic short for the TIFF exhibition David Cronenberg: Evolution (Toronto 2013/14); \n\n;Television spots\n* Jim Ritchie Sculptor (1971)\n* Letter from Michelangelo (1971)\n* Tourettes (1971)\n* Don Valley (1972)\n* Fort York (1972)\n* Lakeshore (1972)\n* Winter Garden (1972)\n* Scarborough Bluffs (1972)\n* In the Dirt (1972)\n\n;Television series\n* Programme X\n** Episode: \"Secret Weapons\" (1972)\n* Peep Show\n** Episodes: \"The Victim\" (1975) & \"The Lie Chair\" [1975]\n* Teleplay\n** Episode: \"The Italian Machine\" (1976) \n* Friday the 13th: The Series\n** Episode: \"Faith Healer\" (1987)\n* Scales of Justice\n** Episodes: \"Regina vs Horvath\" (1990) & \"Regina vs Logan\" (1990)\n\n;Commercials\n* Hydro\n** Client: Ontario Hydro\n** Product: Energy conservation\n** Agency: Burghardt Wolowich Crunkhorn\n** Production company: The Partners' Film Company Ltd.\n** Format: 4 x 30-second commercials\n** Titles: Hot Showers, Laundry, Cleaners, Timers\n* Caramilk\n** Client: William Neilson Ltd.\n** Product: Cadbury Caramilk\n** Agency: Scali McCabe, Sloves (Canada) Ltd.\n** Production company: The Partners' Film Company Ltd.\n** Format: 2 x 30-second commercials\n** Titles: Bistro, Surveillance\n* Nike\n** Client: Nike International\n** Product: Nike Air 180\n** Agency: Wieden and Kennedy\n** Production company: The Partners' Film Company Ltd.\n** Format: 1 x 15-second/4 x 30-second commercials\n** Title: Transformation\n\nAs producer\n\n* Transfer (1966)\n* Stereo (1969)\n* Crimes of the Future (1970)\n* Dead Ringers (1988)\n* Crash (1996)\n* I'm Losing You (1998)\n* eXistenZ (1999)\n* Spider (2002)\n\nAs actor\n\n* Videodrome (1983, uncredited)Cronenberg, David; Irwin, Mark (2004). Director David Cronenberg and Director of Photography Mark Irwin commentary on Videodrome [DVD; Audio Track 2]. Criterion Collection. (According to the DVD, the commentary was recorded in Toronto and Los Angeles in the winter and spring of 2004)\n* Into the Night (1985)\n* The Fly (1986, cameo)\n* Nightbreed (1990)\n* Henry & Verlin (1994)\n* To Die For (1995, cameo)\n* Blood and Donuts (1995)\n* The Stupids (1996, cameo)\n* Extreme Measures (1996, cameo)\n* The Newsroom (TV) (1997) (Episode \"The Meltdown: Part 1\")\n* Last Night (1998)\n* Resurrection (1999)\n* Jason X (2002) - Dr. Wimmer\n* Alias (TV) (2003) (Episodes \"Remnants\" and \"Conscious\")\n* Barney's Version (2010, cameo)\n* Alias Grace (TV) (2017)\n\nRecurring collaborators\n\nWritings\n\n* \n* \n* \n* \n* \n* \n*. David Cronenberg. http://en.wikipedia.org/?curid=7892."
  }
}
