{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18110",
  "eid" : "30e57300-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778591280,
  "textBody" : "Los Angeles (;Also or Spanish for \"The Angels\";), officially the City of Los Angeles and often known by its initials L.A., is the cultural, financial, and commercial center of Southern California. With a U.S. Census-estimated 2016 population of 3,976,322, it is the second most populous city in the United States (after New York City) and the most populous city in the state of California. Located in a large coastal basin surrounded on three sides by mountains reaching up to and over 10000 ft, Los Angeles covers an area of about 469 sqmi. The city is also the seat of Los Angeles County, the most populated county in the country. Los Angeles is the center of the Los Angeles metropolitan area, with 13,131,431 residents, and is part of the larger designated Los Angeles-Long Beach combined statistical area (CSA), the second most populous in the nation with a 2015 estimated population of 18.7 million.\n\nHistorically home to the Chumash and Tongva, Los Angeles was claimed by Juan Rodríguez Cabrillo for Spain in 1542 along with the rest of what would become Alta California. The city was officially founded on September 4, 1781, by Spanish governor Felipe de Neve. It became a part of Mexico in 1821 following the Mexican War of Independence. In 1848, at the end of the Mexican–American War, Los Angeles and the rest of California were purchased as part of the Treaty of Guadalupe Hidalgo, thereby becoming part of the United States. Los Angeles was incorporated as a municipality on April 4, 1850, five months before California achieved statehood. The discovery of oil in the 1890s brought rapid growth to the city. The completion of the Los Angeles Aqueduct in 1913, delivering water from Eastern California, later assured the city's continued rapid growth.\n\nNicknamed the \"City of Angels\" in part because of how its name translates from the Spanish, Los Angeles is known for its Mediterranean climate, ethnic diversity, and sprawling metropolis. The city is also one of the most substantial economic engines within the nation, with a diverse economy in a broad range of professional and cultural fields. Los Angeles is also famous as the home of Hollywood, a major center of the world entertainment industry. A global city, it has been ranked 6th in the Global Cities Index and 9th in the Global Economic Power Index.  The Los Angeles combined statistical area (CSA) also has a gross metropolitan product (GMP) of $831 billion (), making it the third-largest in the world, after the Greater Tokyo and New York metropolitan areas. Los Angeles hosted the 1932 and 1984 Summer Olympics and will host the Olympic Games for a third time in 2028.\n\nHistory\n\nPre-colonial period, up to 1771\n\nThe Los Angeles coastal area was settled by the Tongva (Gabrieleños) and Chumash Native American tribes. A Gabrielino settlement in the area was called iyáangẚ (written Yang-na by the Spanish), meaning \"poison oak place.\"\n\nJuan Rodríguez Cabrillo, a Portuguese-born explorer, claimed the area of southern California for the Spanish Empire in 1542 while on an official military exploring expedition moving north along the Pacific coast from earlier colonizing bases of New Spain in Central and South America. Gaspar de Portolà and Franciscan missionary Juan Crespí, reached the present site of Los Angeles on August 2, 1769.\n\nSpanish period, 1771 to 1821\n\nIn 1771, Franciscan friar Junípero Serra directed the building of the Mission San Gabriel Arcángel, the first mission in the area. On September 4, 1781, a group of forty-four settlers known as \"Los Pobladores\" founded the pueblo they called \"El Pueblo de Nuestra Señora la Reina de los Ángeles de Porciúncula\"; in English, this translates as \"The Town of Our Lady the Queen of the Angels of Porciúncula.\" The Queen of the Angels (feast day Aug. 2) is an honorific of the Virgin Mary; indeed, the present-day city still retains an active Roman Catholic Archdiocese, and as noted below, this archdiocese of Roman Catholicism remains the largest such archdiocese in the United States. Two-thirds of the settlers were mestizo or mulatto with a mixture of African, indigenous and European ancestry. The settlement remained a small ranch town for decades, but by 1820, the population had increased to about 650 residents. Today, the pueblo is commemorated in the historic district of Los Angeles Pueblo Plaza and Olvera Street, the oldest part of Los Angeles.\n\nMexican period, 1821 to 1847\n\nNew Spain achieved its independence from the Spanish Empire in 1821, and the pueblo continued as a part of Mexico. During Mexican rule, Governor Pío Pico made Los Angeles Alta California's regional capital.\n\nAmerican period, 1847 to the present\n\nMexican rule ended during the Mexican–American War: Americans took control from the Californios after a series of battles, culminating with the signing of the Treaty of Cahuenga on January 13, 1847.\n\nRailroads arrived with the completion of the Southern Pacific line to Los Angeles in 1876. Oil was discovered in the city and surrounding area in 1892, and by 1923, the discoveries had helped California become the country's largest oil producer, accounting for about one-quarter of the world's petroleum output.\n\nBy 1900, the population had grown to more than 102,000, putting pressure on the city's water supply. The completion of the Los Angeles Aqueduct in 1913, under the supervision of William Mulholland, assured the continued growth of the city. Due to clauses in the city's charter that effectively prevented the City of Los Angeles from selling or providing water from the aqueduct to any area outside its borders, many adjacent city and communities became compelled to annex themselves into Los Angeles.\n\nLos Angeles created the first municipal zoning ordinance in the United States. On September 14, 1908, Los Angeles City Council promulgated residential and industrial land use zones. The new ordinance established three residential zones of a single type, where industrial uses were prohibited. The proscriptions included barns, lumber yards, and any industrial land use employing machine-powered equipment. These laws were enforced against industrial properties after-the-fact. These prohibitions were in addition to existing activities which were already regulated as nuisances. These included explosives warehousing, gas works, oil-drilling, slaughterhouses, and tanneries. Los Angeles City Council also designated seven industrial zones within the city. However, between 1908 and 1915, Los Angeles City Council created various exceptions to the broad proscriptions which applied to these three residential zones, and as a consequence, some industrial uses emerged within them. There are two differences from the 1908 Residence District Ordinance and later zoning laws in the United States. First, the 1908 laws did not establish a comprehensive zoning map as the 1916 New York City Zoning Ordinance did. Second, the residential zones did not distinguish types of housing: it treated apartments, hotels, and detached-single-family housing equally.\n\nIn 1910, Hollywood merged into Los Angeles, with 10 movie companies already operating in the city at the time. By 1921, more than 80 percent of the world's film industry was concentrated in L.A. The money generated by the industry kept the city insulated from much of the economic loss suffered by the rest of the country during the Great Depression.\n\nBy 1930, the population surpassed one million. In 1932, the city hosted the Summer Olympics.\n\nDuring World War II, Los Angeles was a major center of wartime manufacturing, such as shipbuilding and aircraft. Calship built hundreds of Liberty Ships and Victory Ships on Terminal Island, and the Los Angeles area was the headquarters of six of the country's major aircraft manufacturers (Douglas Aircraft Company, Hughes Aircraft, Lockheed, North American Aviation, Northrop Corporation, and Vultee).  During the war, more aircraft were produced in one year than in all the pre-war years since the Wright brothers flew the first airplane in 1903, combined. Manufacturing in Los Angeles skyrocketed, and as William S. Knudsen, of the National Defense Advisory Commission put it, \"We won because we smothered the enemy in an avalanche of production, the like of which he had never seen, nor dreamed possible.Parker, Dana T. Building Victory: Aircraft Manufacturing in the Los Angeles Area in World War II, pp.5–8, 14, 26, 36, 50, 60, 78, 94, 108, 122, Cypress, CA, 2013. .\n\nFollowing the end of World War II, Los Angeles grew more rapidly than ever, sprawling into the San Fernando Valley. The expansion of the Interstate Highway System during the 1950s and 1960s helped propel suburban growth and signaled the demise of the city's electrified rail system, once the world's largest.\n\nThe 1960s saw race relations boil over into the Watts Riots of 1965 which resulted in 34 deaths and over 1,000 injuries. It was the most severe riot in the city's history until the Los Angeles riots of 1992. In 1969, Los Angeles became the birthplace of the Internet, as the first ARPANET transmission was sent from the University of California, Los Angeles (UCLA) to SRI in Menlo Park.\n\nIn 1984, the city hosted the Summer Olympic Games for the second time. Despite being boycotted by 14 Communist countries, the 1984 Olympics became more financially successful than any previous, and the second Olympics to turn a profit until then – the other, according to an analysis of contemporary newspaper reports, being the 1932 Summer Olympics, also held in Los Angeles.\n\nRacial tensions erupted on April 29, 1992, with the acquittal by a Simi Valley jury of the police officers captured on videotape beating Rodney King, culminating in large-scale riots. They were the largest riots in US history causing approximately $1.3 billion in damage as well as 53 deaths and over 2,000 injuries.\n\nIn 1994, the 6.7 Northridge earthquake shook the city, causing $12.5 billion in damage and 72 deaths. The century ended with the Rampart scandal, one of the most extensive documented cases of police misconduct in American history.\n\nIn 2002, voters defeated efforts by the San Fernando Valley and Hollywood to secede from the city.\n\nLos Angeles will host the 2028 Summer Olympics and Paralympic Games, making Los Angeles the third city to host the Olympics three times.\n\nGeography\n\nCityscape\n\nThe city is divided into over 80 districts and neighborhoods, many of which were incorporated places or communities that merged into the city.  These neighborhoods were developed piecemeal, and are well-defined enough that the city has signage marking nearly all of them.[http://ladot.lacity.org/WhatWeDo/Operations/NeighborhoodServices/Neighborhoodsigns/index.htm LADOT] \n\nMore broadly, the city is divided into the following areas: Downtown Los Angeles, East Los Angeles and Northeast Los Angeles, South Los Angeles, the Harbor Area, Greater Hollywood, Wilshire, the Westside, and the San Fernando and Crescenta Valleys.\n\nOverview\n\nThe city's street pattern generally follows a grid plan, with uniform block lengths and occasional roads that cut across blocks. However, this is complicated by rugged terrain, which has necessitated having different grids for each of the valleys that Los Angeles covers.  Major streets are designed to move large volumes of traffic through many parts of the city; many of which are extremely long: Sepulveda Boulevard is 43 mi long, while Foothill Boulevard is over 60 mi long, reaching as far east as San Bernardino.  Drivers in Los Angeles suffer from one of the worst rush hour periods in the world, according to an annual traffic index by navigation system maker, TomTom.  L.A. drivers spend an additional 92 hours in traffic each year.  During the peak rush hour there is 80% congestion, according to the index.\n\nLos Angeles is often characterized by the presence of low-rise buildings.  Outside of a few centers such as Downtown, Warner Center, Century City, Koreatown, Miracle Mile, Hollywood and Westwood, skyscrapers and high-rise buildings are not common.  The few skyscrapers that are built outside of those areas often stand out above the rest of the surrounding landscape. Most construction is done in separate units, rather than wall-to-wall.  That being said, downtown Los Angeles itself has many buildings over 30 stories, with fourteen over 50 stories, and two over 70 stories (the tallest buildings west of Chicago-see List of tallest buildings in Los Angeles).  Also, Los Angeles is increasingly becoming a city of apartments rather than single family dwellings, especially in the dense inner city and Westside neighborhoods.\n\nLandmarks\n\nImportant landmarks in Los Angeles include the Hollywood Sign, Walt Disney Concert Hall, Capitol Records Building, the Cathedral of Our Lady of the Angels, Angels Flight, Grauman's Chinese Theatre, Dolby Theatre, Griffith Observatory, Getty Center, Getty Villa, the Los Angeles Memorial Coliseum, the Los Angeles County Museum of Art, the Venice Canal Historic District and boardwalk, Theme Building, Bradbury Building, U.S. Bank Tower, Wilshire Grand Center, Hollywood Boulevard, Los Angeles City Hall, Hollywood Bowl, Battleship , Watts Towers, Staples Center, Dodger Stadium, and Olvera Street.\n\nFile:Staples Center LA Live.jpg|L.A. Live\nFile:Grauman's Chinese Theatre, by Carol Highsmith fixed & straightened.jpg|Grauman's Chinese Theatre\nFile:Griffith observatory 2006.jpg|Griffith Observatory\nFile:Capitol Records sunset.jpg|Capitol Records Building\nFile:Angels Flight East.jpg|Angels Flight\nFile:Los Angeles California photo D Ramey Logan.jpg|Downtown Los Angeles at sunset\nFile:USS_Iowa_(BB-61)_superstructure.jpg|Battleship Iowa\n\nTopography\n\nThe city of Los Angeles covers a total area of , comprising  of land and  of water. The city extends for 44 mi longitudinally and for 29 mi latitudinally. The perimeter of the city is 342 mi.\n\nLos Angeles is both flat and hilly. The highest point in the city proper is 5074 ft Mount Lukens, located at the northeastern end of the San Fernando Valley. The eastern end of the Santa Monica Mountains stretches from Downtown to the Pacific Ocean and separates the Los Angeles Basin from the San Fernando Valley. Other hilly parts of Los Angeles include the Mt. Washington area north of Downtown, eastern parts such as Boyle Heights, the Crenshaw district around the Baldwin Hills, and the San Pedro district.\n\nSurrounding the city are much higher mountains. Immediately to the north lie the San Gabriel Mountains, which is a popular recreation area for Angelenos. Its high point is Mount San Antonio, locally known as Mount Baldy, which reaches 10064 ft. Further afield, the highest point in the greater Los Angeles area is San Gorgonio Mountain, with a height of 11503 ft.\n\nThe Los Angeles River, which is largely seasonal, is the primary drainage channel. It was straightened and lined in 51 mi of concrete by the Army Corps of Engineers to act as a flood control channel. The river begins in the Canoga Park district of the city, flows east from the San Fernando Valley along the north edge of the Santa Monica Mountains, and turns south through the city center, flowing to its mouth in the Port of Long Beach at the Pacific Ocean. The smaller Ballona Creek flows into the Santa Monica Bay at Playa del Rey.\n\nVegetation\n\nLos Angeles is rich in native plant species partly because of its diversity of habitats, including beaches, wetlands, and mountains. The most prevalent plant communities are coastal sage scrub, chaparral shrubland, and riparian woodland. Native plants include: California poppy, matilija poppy, toyon, Ceanothus, Chamise, Coast Live Oak, sycamore, willow and Giant Wildrye. Many of these native species, such as the Los Angeles sunflower, have become so rare as to be considered endangered. Though it is not native to the area, the official tree of Los Angeles is the Coral Tree (Erythrina caffra) and the official flower of Los Angeles is the Bird of Paradise (Strelitzia reginae).\nMexican Fan Palms, Canary Island Palms, Queen Palms, Date Palms, and California Fan Palms are common in the Los Angeles area, although only the last is native.\n\nGeology\n\nLos Angeles is subject to earthquakes because of its location on the Pacific Ring of Fire. The geologic instability has produced numerous faults, which cause approximately 10,000 earthquakes annually in Southern California, though most of them are too small to be felt. The strike-slip San Andreas Fault system is located at the boundary between the Pacific Plate and the North American Plate, and is vulnerable to the \"big one\", a potentially large and damaging event. The Los Angeles basin and metropolitan area are also at risk from blind thrust earthquakes. Major earthquakes that have hit the Los Angeles area include the 1933 Long Beach, 1971 San Fernando, 1987 Whittier Narrows, and the 1994 Northridge events. Nevertheless, all but a few are of low intensity and are not felt. The USGS has released the UCERF California earthquake forecast which models earthquake occurrence in California. Parts of the city are also vulnerable to tsunamis; harbor areas were damaged by waves from the Valdivia earthquake in 1960.\n\nClimate\n\nLos Angeles has a Mediterranean climate (Köppen climate classification Csb on the coast, Csa inland), and receives just enough annual precipitation to avoid either Köppen's BSh or BSk (semi-arid climate) classification. Los Angeles has plenty of sunshine throughout the year, with an average of only 35 days with measurable precipitation annually. The coastal region around Los Angeles has a climate that is comparable to coastal areas of southeastern Spain such as Alicante or Elche, in temperature range and variation, in sunshine hours and as well as annual precipitation levels.\n\nTemperatures in the coastal basin exceed 90 F on a dozen or so days in the year, from one day a month in April, May, June and November to three days a month in July, August, October and to five days in September. Temperatures in the San Fernando and San Gabriel Valleys are considerably warmer. Temperatures are subject to substantial daily swings; in inland areas the difference between the average daily low and the average daily high is over 30 F-change. The average annual temperature of the sea is 63 °F, from 58 °F in January to 68 °F in August. Hours of sunshine total more than 3,000 per year, from an average of 7 hours of sunshine per day in December to an average of 12 in July.\n\nThe Los Angeles area is also subject to phenomena typical of a microclimate, causing extreme variations in temperature in close physical proximity to each other.  For instance, the average July maximum temperature at the Santa Monica Pier is 75 °F whereas it is 95 °F in Canoga Park. The city, like much of the southern California coast, is subject to a late spring/early summer weather phenomenon called \"June Gloom\".  This involves overcast or foggy skies in the morning which yield to sun by early afternoon.\n\nDowntown Los Angeles averages  of precipitation annually, which mainly occurs during November through March, generally in the form of moderate rain showers, but sometimes as heavy rainfall during winter storms. Summer days are usually rainless. Rarely, an incursion of moist air from the south or east can bring brief thunderstorms in late summer, especially to the mountains. The coast gets slightly less rainfall, while the inland and mountain areas get considerably more. Years of average rainfall are rare. The usual pattern is year to year variability, with a short string of dry years of 5 – rainfall, followed by one or two wet years with more than 20 in. Wet years are usually associated with warm water El Niño conditions in the Pacific, dry years with cooler water La Niña episodes. A series of rainy days can bring floods to the lowlands and mudslides to the hills, especially after wildfires have denuded the slopes.\n\nBoth freezing temperatures and snowfall are extremely rare in the city basin and along the coast, with the last occurrence of a 32 °F reading at the downtown station being January 29, 1979; freezing temperatures occur nearly every year in valley locations while the mountains within city limits typically receive snowfall every winter. The greatest snowfall recorded in downtown Los Angeles was  on January 15, 1932. At the official downtown station, the highest recorded temperature is 113 °F on September 27, 2010, while the lowest is 28 °F}}, on January 4, 1949. During autumn and winter, Santa Ana winds sometimes bring much warmer and drier conditions to Los Angeles, and raise the wildfire risk.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Los Angeles" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18110" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Los Angeles (;Also or Spanish for \"The Angels\";), officially the City of Los Angeles and often known by its initials L.A., is the cultural, financial, and commercial center of Southern California. With a U.S. Census-estimated 2016 population of 3,976,322, it is the second most populous city in the United States (after New York City) and the most populous city in the state of California. Located in a large coastal basin surrounded on three sides by mountains reaching up to and over 10000 ft, Los Angeles covers an area of about 469 sqmi. The city is also the seat of Los Angeles County, the most populated county in the country. Los Angeles is the center of the Los Angeles metropolitan area, with 13,131,431 residents, and is part of the larger designated Los Angeles-Long Beach combined statistical area (CSA), the second most populous in the nation with a 2015 estimated population of 18.7 million.\n\nHistorically home to the Chumash and Tongva, Los Angeles was claimed by Juan Rodríguez Cabrillo for Spain in 1542 along with the rest of what would become Alta California. The city was officially founded on September 4, 1781, by Spanish governor Felipe de Neve. It became a part of Mexico in 1821 following the Mexican War of Independence. In 1848, at the end of the Mexican–American War, Los Angeles and the rest of California were purchased as part of the Treaty of Guadalupe Hidalgo, thereby becoming part of the United States. Los Angeles was incorporated as a municipality on April 4, 1850, five months before California achieved statehood. The discovery of oil in the 1890s brought rapid growth to the city. The completion of the Los Angeles Aqueduct in 1913, delivering water from Eastern California, later assured the city's continued rapid growth.\n\nNicknamed the \"City of Angels\" in part because of how its name translates from the Spanish, Los Angeles is known for its Mediterranean climate, ethnic diversity, and sprawling metropolis. The city is also one of the most substantial economic engines within the nation, with a diverse economy in a broad range of professional and cultural fields. Los Angeles is also famous as the home of Hollywood, a major center of the world entertainment industry. A global city, it has been ranked 6th in the Global Cities Index and 9th in the Global Economic Power Index.  The Los Angeles combined statistical area (CSA) also has a gross metropolitan product (GMP) of $831 billion (), making it the third-largest in the world, after the Greater Tokyo and New York metropolitan areas. Los Angeles hosted the 1932 and 1984 Summer Olympics and will host the Olympic Games for a third time in 2028.\n\nHistory\n\nPre-colonial period, up to 1771\n\nThe Los Angeles coastal area was settled by the Tongva (Gabrieleños) and Chumash Native American tribes. A Gabrielino settlement in the area was called iyáangẚ (written Yang-na by the Spanish), meaning \"poison oak place.\"\n\nJuan Rodríguez Cabrillo, a Portuguese-born explorer, claimed the area of southern California for the Spanish Empire in 1542 while on an official military exploring expedition moving north along the Pacific coast from earlier colonizing bases of New Spain in Central and South America. Gaspar de Portolà and Franciscan missionary Juan Crespí, reached the present site of Los Angeles on August 2, 1769.\n\nSpanish period, 1771 to 1821\n\nIn 1771, Franciscan friar Junípero Serra directed the building of the Mission San Gabriel Arcángel, the first mission in the area. On September 4, 1781, a group of forty-four settlers known as \"Los Pobladores\" founded the pueblo they called \"El Pueblo de Nuestra Señora la Reina de los Ángeles de Porciúncula\"; in English, this translates as \"The Town of Our Lady the Queen of the Angels of Porciúncula.\" The Queen of the Angels (feast day Aug. 2) is an honorific of the Virgin Mary; indeed, the present-day city still retains an active Roman Catholic Archdiocese, and as noted below, this archdiocese of Roman Catholicism remains the largest such archdiocese in the United States. Two-thirds of the settlers were mestizo or mulatto with a mixture of African, indigenous and European ancestry. The settlement remained a small ranch town for decades, but by 1820, the population had increased to about 650 residents. Today, the pueblo is commemorated in the historic district of Los Angeles Pueblo Plaza and Olvera Street, the oldest part of Los Angeles.\n\nMexican period, 1821 to 1847\n\nNew Spain achieved its independence from the Spanish Empire in 1821, and the pueblo continued as a part of Mexico. During Mexican rule, Governor Pío Pico made Los Angeles Alta California's regional capital.\n\nAmerican period, 1847 to the present\n\nMexican rule ended during the Mexican–American War: Americans took control from the Californios after a series of battles, culminating with the signing of the Treaty of Cahuenga on January 13, 1847.\n\nRailroads arrived with the completion of the Southern Pacific line to Los Angeles in 1876. Oil was discovered in the city and surrounding area in 1892, and by 1923, the discoveries had helped California become the country's largest oil producer, accounting for about one-quarter of the world's petroleum output.\n\nBy 1900, the population had grown to more than 102,000, putting pressure on the city's water supply. The completion of the Los Angeles Aqueduct in 1913, under the supervision of William Mulholland, assured the continued growth of the city. Due to clauses in the city's charter that effectively prevented the City of Los Angeles from selling or providing water from the aqueduct to any area outside its borders, many adjacent city and communities became compelled to annex themselves into Los Angeles.\n\nLos Angeles created the first municipal zoning ordinance in the United States. On September 14, 1908, Los Angeles City Council promulgated residential and industrial land use zones. The new ordinance established three residential zones of a single type, where industrial uses were prohibited. The proscriptions included barns, lumber yards, and any industrial land use employing machine-powered equipment. These laws were enforced against industrial properties after-the-fact. These prohibitions were in addition to existing activities which were already regulated as nuisances. These included explosives warehousing, gas works, oil-drilling, slaughterhouses, and tanneries. Los Angeles City Council also designated seven industrial zones within the city. However, between 1908 and 1915, Los Angeles City Council created various exceptions to the broad proscriptions which applied to these three residential zones, and as a consequence, some industrial uses emerged within them. There are two differences from the 1908 Residence District Ordinance and later zoning laws in the United States. First, the 1908 laws did not establish a comprehensive zoning map as the 1916 New York City Zoning Ordinance did. Second, the residential zones did not distinguish types of housing: it treated apartments, hotels, and detached-single-family housing equally.\n\nIn 1910, Hollywood merged into Los Angeles, with 10 movie companies already operating in the city at the time. By 1921, more than 80 percent of the world's film industry was concentrated in L.A. The money generated by the industry kept the city insulated from much of the economic loss suffered by the rest of the country during the Great Depression.\n\nBy 1930, the population surpassed one million. In 1932, the city hosted the Summer Olympics.\n\nDuring World War II, Los Angeles was a major center of wartime manufacturing, such as shipbuilding and aircraft. Calship built hundreds of Liberty Ships and Victory Ships on Terminal Island, and the Los Angeles area was the headquarters of six of the country's major aircraft manufacturers (Douglas Aircraft Company, Hughes Aircraft, Lockheed, North American Aviation, Northrop Corporation, and Vultee).  During the war, more aircraft were produced in one year than in all the pre-war years since the Wright brothers flew the first airplane in 1903, combined. Manufacturing in Los Angeles skyrocketed, and as William S. Knudsen, of the National Defense Advisory Commission put it, \"We won because we smothered the enemy in an avalanche of production, the like of which he had never seen, nor dreamed possible.Parker, Dana T. Building Victory: Aircraft Manufacturing in the Los Angeles Area in World War II, pp.5–8, 14, 26, 36, 50, 60, 78, 94, 108, 122, Cypress, CA, 2013. .\n\nFollowing the end of World War II, Los Angeles grew more rapidly than ever, sprawling into the San Fernando Valley. The expansion of the Interstate Highway System during the 1950s and 1960s helped propel suburban growth and signaled the demise of the city's electrified rail system, once the world's largest.\n\nThe 1960s saw race relations boil over into the Watts Riots of 1965 which resulted in 34 deaths and over 1,000 injuries. It was the most severe riot in the city's history until the Los Angeles riots of 1992. In 1969, Los Angeles became the birthplace of the Internet, as the first ARPANET transmission was sent from the University of California, Los Angeles (UCLA) to SRI in Menlo Park.\n\nIn 1984, the city hosted the Summer Olympic Games for the second time. Despite being boycotted by 14 Communist countries, the 1984 Olympics became more financially successful than any previous, and the second Olympics to turn a profit until then – the other, according to an analysis of contemporary newspaper reports, being the 1932 Summer Olympics, also held in Los Angeles.\n\nRacial tensions erupted on April 29, 1992, with the acquittal by a Simi Valley jury of the police officers captured on videotape beating Rodney King, culminating in large-scale riots. They were the largest riots in US history causing approximately $1.3 billion in damage as well as 53 deaths and over 2,000 injuries.\n\nIn 1994, the 6.7 Northridge earthquake shook the city, causing $12.5 billion in damage and 72 deaths. The century ended with the Rampart scandal, one of the most extensive documented cases of police misconduct in American history.\n\nIn 2002, voters defeated efforts by the San Fernando Valley and Hollywood to secede from the city.\n\nLos Angeles will host the 2028 Summer Olympics and Paralympic Games, making Los Angeles the third city to host the Olympics three times.\n\nGeography\n\nCityscape\n\nThe city is divided into over 80 districts and neighborhoods, many of which were incorporated places or communities that merged into the city.  These neighborhoods were developed piecemeal, and are well-defined enough that the city has signage marking nearly all of them.[http://ladot.lacity.org/WhatWeDo/Operations/NeighborhoodServices/Neighborhoodsigns/index.htm LADOT] \n\nMore broadly, the city is divided into the following areas: Downtown Los Angeles, East Los Angeles and Northeast Los Angeles, South Los Angeles, the Harbor Area, Greater Hollywood, Wilshire, the Westside, and the San Fernando and Crescenta Valleys.\n\nOverview\n\nThe city's street pattern generally follows a grid plan, with uniform block lengths and occasional roads that cut across blocks. However, this is complicated by rugged terrain, which has necessitated having different grids for each of the valleys that Los Angeles covers.  Major streets are designed to move large volumes of traffic through many parts of the city; many of which are extremely long: Sepulveda Boulevard is 43 mi long, while Foothill Boulevard is over 60 mi long, reaching as far east as San Bernardino.  Drivers in Los Angeles suffer from one of the worst rush hour periods in the world, according to an annual traffic index by navigation system maker, TomTom.  L.A. drivers spend an additional 92 hours in traffic each year.  During the peak rush hour there is 80% congestion, according to the index.\n\nLos Angeles is often characterized by the presence of low-rise buildings.  Outside of a few centers such as Downtown, Warner Center, Century City, Koreatown, Miracle Mile, Hollywood and Westwood, skyscrapers and high-rise buildings are not common.  The few skyscrapers that are built outside of those areas often stand out above the rest of the surrounding landscape. Most construction is done in separate units, rather than wall-to-wall.  That being said, downtown Los Angeles itself has many buildings over 30 stories, with fourteen over 50 stories, and two over 70 stories (the tallest buildings west of Chicago-see List of tallest buildings in Los Angeles).  Also, Los Angeles is increasingly becoming a city of apartments rather than single family dwellings, especially in the dense inner city and Westside neighborhoods.\n\nLandmarks\n\nImportant landmarks in Los Angeles include the Hollywood Sign, Walt Disney Concert Hall, Capitol Records Building, the Cathedral of Our Lady of the Angels, Angels Flight, Grauman's Chinese Theatre, Dolby Theatre, Griffith Observatory, Getty Center, Getty Villa, the Los Angeles Memorial Coliseum, the Los Angeles County Museum of Art, the Venice Canal Historic District and boardwalk, Theme Building, Bradbury Building, U.S. Bank Tower, Wilshire Grand Center, Hollywood Boulevard, Los Angeles City Hall, Hollywood Bowl, Battleship , Watts Towers, Staples Center, Dodger Stadium, and Olvera Street.\n\nFile:Staples Center LA Live.jpg|L.A. Live\nFile:Grauman's Chinese Theatre, by Carol Highsmith fixed & straightened.jpg|Grauman's Chinese Theatre\nFile:Griffith observatory 2006.jpg|Griffith Observatory\nFile:Capitol Records sunset.jpg|Capitol Records Building\nFile:Angels Flight East.jpg|Angels Flight\nFile:Los Angeles California photo D Ramey Logan.jpg|Downtown Los Angeles at sunset\nFile:USS_Iowa_(BB-61)_superstructure.jpg|Battleship Iowa\n\nTopography\n\nThe city of Los Angeles covers a total area of , comprising  of land and  of water. The city extends for 44 mi longitudinally and for 29 mi latitudinally. The perimeter of the city is 342 mi.\n\nLos Angeles is both flat and hilly. The highest point in the city proper is 5074 ft Mount Lukens, located at the northeastern end of the San Fernando Valley. The eastern end of the Santa Monica Mountains stretches from Downtown to the Pacific Ocean and separates the Los Angeles Basin from the San Fernando Valley. Other hilly parts of Los Angeles include the Mt. Washington area north of Downtown, eastern parts such as Boyle Heights, the Crenshaw district around the Baldwin Hills, and the San Pedro district.\n\nSurrounding the city are much higher mountains. Immediately to the north lie the San Gabriel Mountains, which is a popular recreation area for Angelenos. Its high point is Mount San Antonio, locally known as Mount Baldy, which reaches 10064 ft. Further afield, the highest point in the greater Los Angeles area is San Gorgonio Mountain, with a height of 11503 ft.\n\nThe Los Angeles River, which is largely seasonal, is the primary drainage channel. It was straightened and lined in 51 mi of concrete by the Army Corps of Engineers to act as a flood control channel. The river begins in the Canoga Park district of the city, flows east from the San Fernando Valley along the north edge of the Santa Monica Mountains, and turns south through the city center, flowing to its mouth in the Port of Long Beach at the Pacific Ocean. The smaller Ballona Creek flows into the Santa Monica Bay at Playa del Rey.\n\nVegetation\n\nLos Angeles is rich in native plant species partly because of its diversity of habitats, including beaches, wetlands, and mountains. The most prevalent plant communities are coastal sage scrub, chaparral shrubland, and riparian woodland. Native plants include: California poppy, matilija poppy, toyon, Ceanothus, Chamise, Coast Live Oak, sycamore, willow and Giant Wildrye. Many of these native species, such as the Los Angeles sunflower, have become so rare as to be considered endangered. Though it is not native to the area, the official tree of Los Angeles is the Coral Tree (Erythrina caffra) and the official flower of Los Angeles is the Bird of Paradise (Strelitzia reginae).\nMexican Fan Palms, Canary Island Palms, Queen Palms, Date Palms, and California Fan Palms are common in the Los Angeles area, although only the last is native.\n\nGeology\n\nLos Angeles is subject to earthquakes because of its location on the Pacific Ring of Fire. The geologic instability has produced numerous faults, which cause approximately 10,000 earthquakes annually in Southern California, though most of them are too small to be felt. The strike-slip San Andreas Fault system is located at the boundary between the Pacific Plate and the North American Plate, and is vulnerable to the \"big one\", a potentially large and damaging event. The Los Angeles basin and metropolitan area are also at risk from blind thrust earthquakes. Major earthquakes that have hit the Los Angeles area include the 1933 Long Beach, 1971 San Fernando, 1987 Whittier Narrows, and the 1994 Northridge events. Nevertheless, all but a few are of low intensity and are not felt. The USGS has released the UCERF California earthquake forecast which models earthquake occurrence in California. Parts of the city are also vulnerable to tsunamis; harbor areas were damaged by waves from the Valdivia earthquake in 1960.\n\nClimate\n\nLos Angeles has a Mediterranean climate (Köppen climate classification Csb on the coast, Csa inland), and receives just enough annual precipitation to avoid either Köppen's BSh or BSk (semi-arid climate) classification. Los Angeles has plenty of sunshine throughout the year, with an average of only 35 days with measurable precipitation annually. The coastal region around Los Angeles has a climate that is comparable to coastal areas of southeastern Spain such as Alicante or Elche, in temperature range and variation, in sunshine hours and as well as annual precipitation levels.\n\nTemperatures in the coastal basin exceed 90 F on a dozen or so days in the year, from one day a month in April, May, June and November to three days a month in July, August, October and to five days in September. Temperatures in the San Fernando and San Gabriel Valleys are considerably warmer. Temperatures are subject to substantial daily swings; in inland areas the difference between the average daily low and the average daily high is over 30 F-change. The average annual temperature of the sea is 63 °F, from 58 °F in January to 68 °F in August. Hours of sunshine total more than 3,000 per year, from an average of 7 hours of sunshine per day in December to an average of 12 in July.\n\nThe Los Angeles area is also subject to phenomena typical of a microclimate, causing extreme variations in temperature in close physical proximity to each other.  For instance, the average July maximum temperature at the Santa Monica Pier is 75 °F whereas it is 95 °F in Canoga Park. The city, like much of the southern California coast, is subject to a late spring/early summer weather phenomenon called \"June Gloom\".  This involves overcast or foggy skies in the morning which yield to sun by early afternoon.\n\nDowntown Los Angeles averages  of precipitation annually, which mainly occurs during November through March, generally in the form of moderate rain showers, but sometimes as heavy rainfall during winter storms. Summer days are usually rainless. Rarely, an incursion of moist air from the south or east can bring brief thunderstorms in late summer, especially to the mountains. The coast gets slightly less rainfall, while the inland and mountain areas get considerably more. Years of average rainfall are rare. The usual pattern is year to year variability, with a short string of dry years of 5 – rainfall, followed by one or two wet years with more than 20 in. Wet years are usually associated with warm water El Niño conditions in the Pacific, dry years with cooler water La Niña episodes. A series of rainy days can bring floods to the lowlands and mudslides to the hills, especially after wildfires have denuded the slopes.\n\nBoth freezing temperatures and snowfall are extremely rare in the city basin and along the coast, with the last occurrence of a 32 °F reading at the downtown station being January 29, 1979; freezing temperatures occur nearly every year in valley locations while the mountains within city limits typically receive snowfall every winter. The greatest snowfall recorded in downtown Los Angeles was  on January 15, 1932. At the official downtown station, the highest recorded temperature is 113 °F on September 27, 2010, while the lowest is 28 °F}}, on January 4, 1949. During autumn and winter, Santa Ana winds sometimes bring much warmer and drier conditions to Los Angeles, and raise the wildfire risk. Los Angeles. http://en.wikipedia.org/?curid=18110."
  }
}
