{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17043",
  "eid" : "2a371770-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778580071,
  "textBody" : "A kaleidoscope is an optical instrument with two or more reflecting surfaces tilted to each other in an angle, so that one or more (parts of) objects on one end of the mirrors are seen as a regular symmetrical pattern when viewed from the other end, due to repeated reflection. The reflectors (or mirrors) are usually enclosed in a tube, often containing on one end a cell with loose, colored pieces of glass or other transparent (and/or opaque) materials to be reflected into the viewed pattern. Rotation of the cell causes motion of the materials, resulting in an ever-changing viewed pattern.\n\nEtymology\n\nCoined in 1817 by Scottish inventor David Brewster, \"kaleidoscope\" is derived from the Ancient Greek καλός (kalos), \"beautiful, beauty\",[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3Dkalo%2Fs2 καλός] , Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus εἶδος (eidos), \"that which is seen: form, shape\"[http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.04.0057%3Aentry%3Dei%29%3Ddos εἶδος] , Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus and σκοπέω (skopeō), \"to look to, to examine\",[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3Dskope%2Fw σκοπέω] , Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus hence \"observation of beautiful forms.\"\n\nPrinciples\n\nA kaleidoscope operates on the principle of multiple reflection, where two or more reflectors are placed at an angle to one another. When the eye is placed at one end of the reflectors, the original view from the aperture on the other side is multiplied into a symmetrical mosaic pattern. A two-mirror kaleidoscope yields a circular pattern isolated against a solid black background, while the three-mirror equilateral triangle type yields an infinite pattern that fills the entire visual field.\n\nInventor David Brewster described three conditions for the kaleidoscope to produce \"perfectly beautiful and symmetrical forms\":\n*The angle between reflectors should be an even or odd aliquot part of 360° for the reflection of regular objects situated in the middle of the aperture. For irregular objects situated at any position the angle should be an even aliquot part of 360° (with two mirrors the viewed circular image is built from as many sectors as the number of times that the angle of the reflectors is contained in 360°).\n*The reflected object should be in contact with the ends of the reflectors (ABC in Fig. 1. of the patent illustration) .\n*The eye should be as near as possible to the angular point (D in Fig. 1. of the patent illustration) of the ends of the reflector opposite the reflected object.\n\nA proper kaleidoscope image can be achieved with a convex lens of such a focal length that the images of all surrounding objects were distinctly formed at the end of the reflectors and thus introduced into the reflected pattern.\n\nAn \"object-box\" (or cell) on the ends of the reflectors can hold selected objects to be viewed in the reflected pattern. Colorful transparent shapes (for instance pieces of glass or colored fluids moving in transparent containers) to create beautiful patterns. Objects smaller than the aperture create a spotted appearance of the pattern. Larger opaque objects and darker colors don't transmit much light and are usually avoided. If objects, fragments and/or liquids are loosely placed inside the cell and tumble when the cell is rotated, motion and change of colors and shapes can be introduced into the viewed pattern.\n\nHistory\n\nMultiple reflection by two or more reflecting surfaces has been known since antiquity and was described as such by Giambattista della Porta in his Magia Naturalis (1558-1589). In 1646 Athanasius Kircher described an experiment with a construction of two mirrors, which could be opened and closed like a book and positioned in various angles, showing regular polygon figures consisting of reflected aliquot sectors of 360°. Mr. Bradley's New Improvements in Planting and Gardening (1717) described a similar construction to be placed on geometrical drawings to show an image with multiplied reflection. However, an optimal configuration that produces the full effects of the kaleidoscope was not recorded before 1815.\n\nIn 1814 Sir David Brewster conducted experiments on light polarization by successive reflections between plates of glass and first noted \"the circular arrangement of the images of a candle round a center, and the multiplication of the sectors formed by the extremities of the plates of glass\". He forgot about it, but noticed a more impressive version of the effect during further experiments in February 1815. A while later he was impressed by the multiplied reflection of a bit of cement that was pressed through at the end of a triangular glass trough, which appeared more regular and almost perfectly symmetrical in comparison to the reflected objects that had been situated further away from the reflecting plates in earlier experiments. This triggered more experiments to find the conditions for the most beautiful and symmetrically perfect conditions. An early version had pieces of colored glass and other irregular objects fixed permanently and was admired by some Members of the Royal Society of Edinburgh, including Sir George Mackenzie who predicted its popularity. A version followed in which some of the objects and pieces of glass could move when the tube was rotated. The last step, regarded as most important by Brewster, was to place the reflecting panes in a draw tube with a concave lens to distinctly introduce surrounding objects into the reflected pattern.\n\nBrewster thought his instrument to be of great value in \"all the ornamental arts\" as a device that creates an \"infinity of patterns\". Artists could accurately delineate the produced figures of the kaleidoscope by means of the solar microscope (a type of camera obscura device), magic lantern or camera lucida. Brewster believed it would at the same time become a popular instrument \"for the purposes of rational amusement\". He decided to apply for a patent. British patent no. 4136 \"for a new Optical Instrument called \"The Kaleidoscope\" for exhibiting and creating beautiful Forms and Patterns of great use in all the ornamental Arts\" was granted in July 1817. Unfortunately the manufacturer originally engaged to produce the product had shown one of the patent instruments to some of the London opticians to see if he could get orders from them. Soon the instrument was copied and marketed before the manufacturer had prepared any number of kaleidoscopes for sale. An estimated two hundred thousand kaleidoscopes sold in London and Paris in just three months. Brewster figured at most a thousand of these were authorized copies that were constructed correctly, while the majority of the others did not give a correct impression of his invention. Because now relatively few people had experienced a proper kaleidoscope or knew how to apply it to ornamental arts, he decided to publicize a treatise on the principles and the correct construction of the kaleidoscope.\n\nIt was thought that the patent was reduced in a Court of Law since its principles were supposedly already known. Brewster stated that the kaleidoscope was different because the particular positions of the object and of the eye, played a very important role in producing the beautiful symmetrical forms. Brewster's opinion was shared by several scientists, including James Watt.https://books.google.nl/books?idnhcAAAAAMAAJ&lpg\nPA451&dqbrewster%20kaleidoscope%20patent&pg\nPA451#vonepage&q&f\nfalse \n\nPhilip Carpenter originally tried to produce his own imitation of the kaleidoscope, but was not satisfied with the results. He decided to offer his services to Brewster as manufacturer. Brewster agreed and Carpenter's models were stamped \"sole maker\". Realizing that the company could not meet the level of demand, Brewster gained permission from Carpenter in 1818 for the device to be made by other manufacturers. In his 1819 Treatise on the Kaleidoscope Brewster listed more than a dozen manufacturers/sellers of patent kaleidoscopes. Carpenter's company would keep on selling kaleidoscopes for 60 years.[http://www.victorianmicroscopeslides.com/pdf/pcarpenter.pdf The Perfectionist Projectionist] , Victorian Microscope Slides.  Accessed 1 August 2011 H.M. Quackenbush Co. based in Upstate New York in the United States was another authorized manufacturer.\n\nVariations\n\nGeneral variables\n\nDavid Brewster defined several variables in his patent and publications:\n*variations in size (Brewster deemed a length of five to ten inches convenient, for one to four inches he suggested the use of a lens with a focus length equal to the length of the reflectors) \n*variations in the angle of inclination of the reflecting surfaces. In his patent Brewster deemed 18°, 20° or 22 1/2° most pleasing. In the treatise 45°, 36° and 30° are the primary examples.\n*variations in material of the reflecting surfaces (plates of plain glass, quicksilvered glass (mirror) or metal, or the reflecting inner surfaces of a solid prism of glass or rock chrystal) The choice of material can have some influence of the tint and the quality of the image.\n*a wide variety of objects, small figures, fragments, liquids and materials of different colors and shapes can be used in object cells (apart from the more usual transparent fragments, for instance twisted pieces of iron or brass wire, or some lace, can produce very fine effects)\n\nDifferent versions suggested by Brewster\n\nIn his patent Brewster perceived two forms for the kaleidoscope:\n*\"most common form\": two reflectors, small objects should be placed close to the aperture to be viewed at the other end \n* \"The compound, or telescopic Kaleidoscope\": a tube with two reflectors, sliding inside another tube with one to three convex lenses, to be applied to any object at any distance  (this was later re-introduced as the teleidoscope)\nIn his Treatise on the Kaleidoscope (1819) he described the basic form with an object cell:\n*\"simple form\": a tube with two reflectors and objects such as pieces of colored glass either fixed or placed loosely in cell on the end of the instrument\n\nBrewster also developed several variations:\n*\"Polycentral Kaleidoscope\" with three reflectors at angles of 90°: the infinite pattern of equilateral triangles was deemed \"uncommonly splendid\" by Brewster\n*\"Polycentral Kaleidoscope\" with three reflectors at angles of 90°, 45° and 45°: the pattern is not symmetrically arranged around the centre, but nonetheless deemed \"very pleasing\" by Brewster\n*\"Polycentral Kaleidoscope\" with three reflectors at angles of 90°, 60° and 30°: the pattern with 31 reflected images of the aperture, not symmetrically arranged around the centre. Brewster deemed the effect \"very beautiful, particularly when the reflectors are metallic\".\n*\"Polycentral Kaleidoscopes\" with four reflectors: square or rectangular kaleidoscope with an infinite pattern of squares or rectangles\n*projection kaleidoscopes by means of the solar microscope or the magic lantern, allowing more people to see the pattern \n*\"Microscopic Kaleidocsope\": minute kaleidoscopes (as small as one inch in length) for viewing microscopic objects, have also been worn by women as jewelry\n*placement of \"regularly crystallised bodies or pieces of glass that have received the polarising structure\" in front of the aperture, to introduce \"the complementary colors of polarised light\" \n*rectangular object plates moving through a groove cut in a cell attached to the ends of the reflector, allow for a greater variety in the motion of loose fragments. With fixed fragments a more calculated sequence of tints and shapes can be composed.\n*\"a vibrating object plate\": a smaller object plate containing loose objects can be made to vibrate on its lower edge by a gentle motion of the tube if the kaleidoscope is held horizontally\n*an colorless object plate, with either colorless pieces of glass or an irregular surface of transparent varnish, can be placed in front of a colorful object plate. The tints and outlines of the colorful pieces are softened by the refraction of the colorless pieces. The colorless objects supply outlines to the pattern. The colorless object plate can also produce fine colorless patterns when used alone.\n*instead of in an object cell, transparent fragments can be placed on a mirror and be combined with opaque fragments (for instance pieces of brass wire, coloured foils and grains of spelter) for the best effects\n*an object plate with fixed elements can be placed in cell, if the cell is rotated in front of the aperture the same patterns recur\n\n*if the reflectors are kept separate (see Fig. 4 of patent illustration), annular patterns are shown \n*if the reflectors are placed parallel to each other (see Fig. 5 of patent illustration), rectilinear patterns are shown\nBrewster also imagined another application for the kaleidoscope:\n*a type of color organ: for a harmonic visual composition, with effects similar to musical composition, a very simple piece of machinery could be developed \"for introducing objects of different forms and colours for varying the direction of the motion across the angular aperture and for accommodating the velocity of their motion to the effect which it is intended to produce.\".\n\nLater variations\n\nManufacturers and artists have created kaleidoscopes with a wide variety of materials and in many shapes. A few of these added elements that were not previously described by inventor David Brewster: \n*object cells have been filled with a viscous liquid so the items float and move gracefully through the object cell in response to slight movements from the viewer\n*wand kaleidoscopes, with a moveable transparent sealed tube containing liquid showing sinking and/or floating objects (usually including glitter) past the end of the reflectors, were introduced in 1990 WildeWood Creative Products in collaboration with Cozy Baker\n*object wheels or carousels rotating on an axis attached to the center of kaleidoscope can introduce shapes and colors into the kaleidoscope image\n*exteriors of kaleidoscopes have been crafted into sculptural artworks\n*large kaleidoscopes have been integrated in the architecture of some buildings\n*software and digital cameras have been used in high tech kaleidoscopes\n\nPublications\n\nCozy Baker (d. October 19, 2010)—founder of the Brewster Kaleidoscope Society—collected kaleidoscopes and wrote books about many of the artists making them in the 1970s through 2001. Her book Kaleidoscope Artistry  is a limited compendium of kaleidoscope makers, containing pictures of the interior and exterior views of contemporary artworks. Baker is credited with energizing a renaissance in kaleidoscope-making in the US; She spent her life putting kaleidoscope artists and galleries together so they would know each other and encourage each other.\n\nIn 1999 a short-lived magazine dedicated to kaleidoscopes—Kaleidoscope Review—was published, covering artists, collectors, dealers, events, and including how-to articles. This magazine was created and edited by Brett Bensley, at that time a well-known kaleidoscope artist and resource on kaleidoscope information. Changed name to The New Kaleidoscope Review, and then switched to a video presentation on YouTube, \"The Kaleidoscope Maker.\"\n\nApplications\n\nMost kaleidoscopes are mass-produced from inexpensive materials, and intended as children's toys. At the other extreme are handmade pieces that display fine craftsmanship. Craft galleries often carry a few kaleidoscopes, while other enterprises specialize in them, carrying dozens of different types from different artists and craftspeople. Most handmade kaleidoscopes are now made in Russia and Italy, following a long tradition of glass craftsmanship in those countries.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kaleidoscope" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17043" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A kaleidoscope is an optical instrument with two or more reflecting surfaces tilted to each other in an angle, so that one or more (parts of) objects on one end of the mirrors are seen as a regular symmetrical pattern when viewed from the other end, due to repeated reflection. The reflectors (or mirrors) are usually enclosed in a tube, often containing on one end a cell with loose, colored pieces of glass or other transparent (and/or opaque) materials to be reflected into the viewed pattern. Rotation of the cell causes motion of the materials, resulting in an ever-changing viewed pattern.\n\nEtymology\n\nCoined in 1817 by Scottish inventor David Brewster, \"kaleidoscope\" is derived from the Ancient Greek καλός (kalos), \"beautiful, beauty\",[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3Dkalo%2Fs2 καλός] , Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus εἶδος (eidos), \"that which is seen: form, shape\"[http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.04.0057%3Aentry%3Dei%29%3Ddos εἶδος] , Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus and σκοπέω (skopeō), \"to look to, to examine\",[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3Dskope%2Fw σκοπέω] , Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus hence \"observation of beautiful forms.\"\n\nPrinciples\n\nA kaleidoscope operates on the principle of multiple reflection, where two or more reflectors are placed at an angle to one another. When the eye is placed at one end of the reflectors, the original view from the aperture on the other side is multiplied into a symmetrical mosaic pattern. A two-mirror kaleidoscope yields a circular pattern isolated against a solid black background, while the three-mirror equilateral triangle type yields an infinite pattern that fills the entire visual field.\n\nInventor David Brewster described three conditions for the kaleidoscope to produce \"perfectly beautiful and symmetrical forms\":\n*The angle between reflectors should be an even or odd aliquot part of 360° for the reflection of regular objects situated in the middle of the aperture. For irregular objects situated at any position the angle should be an even aliquot part of 360° (with two mirrors the viewed circular image is built from as many sectors as the number of times that the angle of the reflectors is contained in 360°).\n*The reflected object should be in contact with the ends of the reflectors (ABC in Fig. 1. of the patent illustration) .\n*The eye should be as near as possible to the angular point (D in Fig. 1. of the patent illustration) of the ends of the reflector opposite the reflected object.\n\nA proper kaleidoscope image can be achieved with a convex lens of such a focal length that the images of all surrounding objects were distinctly formed at the end of the reflectors and thus introduced into the reflected pattern.\n\nAn \"object-box\" (or cell) on the ends of the reflectors can hold selected objects to be viewed in the reflected pattern. Colorful transparent shapes (for instance pieces of glass or colored fluids moving in transparent containers) to create beautiful patterns. Objects smaller than the aperture create a spotted appearance of the pattern. Larger opaque objects and darker colors don't transmit much light and are usually avoided. If objects, fragments and/or liquids are loosely placed inside the cell and tumble when the cell is rotated, motion and change of colors and shapes can be introduced into the viewed pattern.\n\nHistory\n\nMultiple reflection by two or more reflecting surfaces has been known since antiquity and was described as such by Giambattista della Porta in his Magia Naturalis (1558-1589). In 1646 Athanasius Kircher described an experiment with a construction of two mirrors, which could be opened and closed like a book and positioned in various angles, showing regular polygon figures consisting of reflected aliquot sectors of 360°. Mr. Bradley's New Improvements in Planting and Gardening (1717) described a similar construction to be placed on geometrical drawings to show an image with multiplied reflection. However, an optimal configuration that produces the full effects of the kaleidoscope was not recorded before 1815.\n\nIn 1814 Sir David Brewster conducted experiments on light polarization by successive reflections between plates of glass and first noted \"the circular arrangement of the images of a candle round a center, and the multiplication of the sectors formed by the extremities of the plates of glass\". He forgot about it, but noticed a more impressive version of the effect during further experiments in February 1815. A while later he was impressed by the multiplied reflection of a bit of cement that was pressed through at the end of a triangular glass trough, which appeared more regular and almost perfectly symmetrical in comparison to the reflected objects that had been situated further away from the reflecting plates in earlier experiments. This triggered more experiments to find the conditions for the most beautiful and symmetrically perfect conditions. An early version had pieces of colored glass and other irregular objects fixed permanently and was admired by some Members of the Royal Society of Edinburgh, including Sir George Mackenzie who predicted its popularity. A version followed in which some of the objects and pieces of glass could move when the tube was rotated. The last step, regarded as most important by Brewster, was to place the reflecting panes in a draw tube with a concave lens to distinctly introduce surrounding objects into the reflected pattern.\n\nBrewster thought his instrument to be of great value in \"all the ornamental arts\" as a device that creates an \"infinity of patterns\". Artists could accurately delineate the produced figures of the kaleidoscope by means of the solar microscope (a type of camera obscura device), magic lantern or camera lucida. Brewster believed it would at the same time become a popular instrument \"for the purposes of rational amusement\". He decided to apply for a patent. British patent no. 4136 \"for a new Optical Instrument called \"The Kaleidoscope\" for exhibiting and creating beautiful Forms and Patterns of great use in all the ornamental Arts\" was granted in July 1817. Unfortunately the manufacturer originally engaged to produce the product had shown one of the patent instruments to some of the London opticians to see if he could get orders from them. Soon the instrument was copied and marketed before the manufacturer had prepared any number of kaleidoscopes for sale. An estimated two hundred thousand kaleidoscopes sold in London and Paris in just three months. Brewster figured at most a thousand of these were authorized copies that were constructed correctly, while the majority of the others did not give a correct impression of his invention. Because now relatively few people had experienced a proper kaleidoscope or knew how to apply it to ornamental arts, he decided to publicize a treatise on the principles and the correct construction of the kaleidoscope.\n\nIt was thought that the patent was reduced in a Court of Law since its principles were supposedly already known. Brewster stated that the kaleidoscope was different because the particular positions of the object and of the eye, played a very important role in producing the beautiful symmetrical forms. Brewster's opinion was shared by several scientists, including James Watt.https://books.google.nl/books?idnhcAAAAAMAAJ&lpg\nPA451&dqbrewster%20kaleidoscope%20patent&pg\nPA451#vonepage&q&f\nfalse \n\nPhilip Carpenter originally tried to produce his own imitation of the kaleidoscope, but was not satisfied with the results. He decided to offer his services to Brewster as manufacturer. Brewster agreed and Carpenter's models were stamped \"sole maker\". Realizing that the company could not meet the level of demand, Brewster gained permission from Carpenter in 1818 for the device to be made by other manufacturers. In his 1819 Treatise on the Kaleidoscope Brewster listed more than a dozen manufacturers/sellers of patent kaleidoscopes. Carpenter's company would keep on selling kaleidoscopes for 60 years.[http://www.victorianmicroscopeslides.com/pdf/pcarpenter.pdf The Perfectionist Projectionist] , Victorian Microscope Slides.  Accessed 1 August 2011 H.M. Quackenbush Co. based in Upstate New York in the United States was another authorized manufacturer.\n\nVariations\n\nGeneral variables\n\nDavid Brewster defined several variables in his patent and publications:\n*variations in size (Brewster deemed a length of five to ten inches convenient, for one to four inches he suggested the use of a lens with a focus length equal to the length of the reflectors) \n*variations in the angle of inclination of the reflecting surfaces. In his patent Brewster deemed 18°, 20° or 22 1/2° most pleasing. In the treatise 45°, 36° and 30° are the primary examples.\n*variations in material of the reflecting surfaces (plates of plain glass, quicksilvered glass (mirror) or metal, or the reflecting inner surfaces of a solid prism of glass or rock chrystal) The choice of material can have some influence of the tint and the quality of the image.\n*a wide variety of objects, small figures, fragments, liquids and materials of different colors and shapes can be used in object cells (apart from the more usual transparent fragments, for instance twisted pieces of iron or brass wire, or some lace, can produce very fine effects)\n\nDifferent versions suggested by Brewster\n\nIn his patent Brewster perceived two forms for the kaleidoscope:\n*\"most common form\": two reflectors, small objects should be placed close to the aperture to be viewed at the other end \n* \"The compound, or telescopic Kaleidoscope\": a tube with two reflectors, sliding inside another tube with one to three convex lenses, to be applied to any object at any distance  (this was later re-introduced as the teleidoscope)\nIn his Treatise on the Kaleidoscope (1819) he described the basic form with an object cell:\n*\"simple form\": a tube with two reflectors and objects such as pieces of colored glass either fixed or placed loosely in cell on the end of the instrument\n\nBrewster also developed several variations:\n*\"Polycentral Kaleidoscope\" with three reflectors at angles of 90°: the infinite pattern of equilateral triangles was deemed \"uncommonly splendid\" by Brewster\n*\"Polycentral Kaleidoscope\" with three reflectors at angles of 90°, 45° and 45°: the pattern is not symmetrically arranged around the centre, but nonetheless deemed \"very pleasing\" by Brewster\n*\"Polycentral Kaleidoscope\" with three reflectors at angles of 90°, 60° and 30°: the pattern with 31 reflected images of the aperture, not symmetrically arranged around the centre. Brewster deemed the effect \"very beautiful, particularly when the reflectors are metallic\".\n*\"Polycentral Kaleidoscopes\" with four reflectors: square or rectangular kaleidoscope with an infinite pattern of squares or rectangles\n*projection kaleidoscopes by means of the solar microscope or the magic lantern, allowing more people to see the pattern \n*\"Microscopic Kaleidocsope\": minute kaleidoscopes (as small as one inch in length) for viewing microscopic objects, have also been worn by women as jewelry\n*placement of \"regularly crystallised bodies or pieces of glass that have received the polarising structure\" in front of the aperture, to introduce \"the complementary colors of polarised light\" \n*rectangular object plates moving through a groove cut in a cell attached to the ends of the reflector, allow for a greater variety in the motion of loose fragments. With fixed fragments a more calculated sequence of tints and shapes can be composed.\n*\"a vibrating object plate\": a smaller object plate containing loose objects can be made to vibrate on its lower edge by a gentle motion of the tube if the kaleidoscope is held horizontally\n*an colorless object plate, with either colorless pieces of glass or an irregular surface of transparent varnish, can be placed in front of a colorful object plate. The tints and outlines of the colorful pieces are softened by the refraction of the colorless pieces. The colorless objects supply outlines to the pattern. The colorless object plate can also produce fine colorless patterns when used alone.\n*instead of in an object cell, transparent fragments can be placed on a mirror and be combined with opaque fragments (for instance pieces of brass wire, coloured foils and grains of spelter) for the best effects\n*an object plate with fixed elements can be placed in cell, if the cell is rotated in front of the aperture the same patterns recur\n\n*if the reflectors are kept separate (see Fig. 4 of patent illustration), annular patterns are shown \n*if the reflectors are placed parallel to each other (see Fig. 5 of patent illustration), rectilinear patterns are shown\nBrewster also imagined another application for the kaleidoscope:\n*a type of color organ: for a harmonic visual composition, with effects similar to musical composition, a very simple piece of machinery could be developed \"for introducing objects of different forms and colours for varying the direction of the motion across the angular aperture and for accommodating the velocity of their motion to the effect which it is intended to produce.\".\n\nLater variations\n\nManufacturers and artists have created kaleidoscopes with a wide variety of materials and in many shapes. A few of these added elements that were not previously described by inventor David Brewster: \n*object cells have been filled with a viscous liquid so the items float and move gracefully through the object cell in response to slight movements from the viewer\n*wand kaleidoscopes, with a moveable transparent sealed tube containing liquid showing sinking and/or floating objects (usually including glitter) past the end of the reflectors, were introduced in 1990 WildeWood Creative Products in collaboration with Cozy Baker\n*object wheels or carousels rotating on an axis attached to the center of kaleidoscope can introduce shapes and colors into the kaleidoscope image\n*exteriors of kaleidoscopes have been crafted into sculptural artworks\n*large kaleidoscopes have been integrated in the architecture of some buildings\n*software and digital cameras have been used in high tech kaleidoscopes\n\nPublications\n\nCozy Baker (d. October 19, 2010)—founder of the Brewster Kaleidoscope Society—collected kaleidoscopes and wrote books about many of the artists making them in the 1970s through 2001. Her book Kaleidoscope Artistry  is a limited compendium of kaleidoscope makers, containing pictures of the interior and exterior views of contemporary artworks. Baker is credited with energizing a renaissance in kaleidoscope-making in the US; She spent her life putting kaleidoscope artists and galleries together so they would know each other and encourage each other.\n\nIn 1999 a short-lived magazine dedicated to kaleidoscopes—Kaleidoscope Review—was published, covering artists, collectors, dealers, events, and including how-to articles. This magazine was created and edited by Brett Bensley, at that time a well-known kaleidoscope artist and resource on kaleidoscope information. Changed name to The New Kaleidoscope Review, and then switched to a video presentation on YouTube, \"The Kaleidoscope Maker.\"\n\nApplications\n\nMost kaleidoscopes are mass-produced from inexpensive materials, and intended as children's toys. At the other extreme are handmade pieces that display fine craftsmanship. Craft galleries often carry a few kaleidoscopes, while other enterprises specialize in them, carrying dozens of different types from different artists and craftspeople. Most handmade kaleidoscopes are now made in Russia and Italy, following a long tradition of glass craftsmanship in those countries. Kaleidoscope. http://en.wikipedia.org/?curid=17043."
  }
}
