{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13040",
  "eid" : "06371690-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778519673,
  "textBody" : "Gypsum is a soft sulfate mineral composed of calcium sulfate dihydrate, with the chemical formula CaSO4·2H2O. It is widely mined and is used as a fertilizer, and as the main constituent in many forms of plaster, blackboard chalk and wallboard.  A massive fine-grained white or lightly tinted variety of gypsum, called alabaster, has been used for sculpture by many cultures including Ancient Egypt, Mesopotamia, Ancient Rome, the Byzantine Empire and the Nottingham alabasters of Medieval England. Mohs scale of mineral hardness, based on scratch hardness comparison, defines hardness value 2 as gypsum. It forms as an evaporite mineral and as a hydration product of anhydrite.\n\nEtymology and history\n\nThe word gypsum is derived from the Greek word γύψος (gypsos), \"plaster\". Because the quarries of the Montmartre district of Paris have long furnished burnt gypsum (calcined gypsum) used for various purposes, this dehydrated gypsum became known as plaster of Paris. Upon addition of water, after a few tens of minutes plaster of Paris becomes regular gypsum (dihydrate) again, causing the material to harden or \"set\" in ways that are useful for casting and construction.\n\nGypsum was known in Old English as spærstān, \"spear stone\", referring to its crystalline projections. (Thus, the word spar in mineralogy is by way of comparison to gypsum, referring to any non-ore mineral or crystal that forms in spearlike projections). Gypsum may act as a source of sulfur for plant growth, which was discovered by J. M. Mayer, and in the early 19th century, it was regarded as an almost miraculous fertilizer. American farmers were so anxious to acquire it that a lively smuggling trade with Nova Scotia evolved, resulting in the so-called \"Plaster War\" of 1820. In the 19th century, it was also known as  or .\n\nPhysical properties\n\nGypsum is moderately water-soluble (~2.0–2.5 g/l at 25 °C) and, in contrast to most other salts, it exhibits retrograde solubility, becoming less soluble at higher temperatures. When gypsum is heated in air it loses water and converts first to calcium sulfate hemihydrate, (bassanite, often simply called \"plaster\") and, if heated further, to anhydrous calcium sulfate (anhydrite).  As for anhydrite, its solubility in saline solutions and in brines is also strongly dependent on NaCl (common table salt) concentration.\n\nGypsum crystals are found to contain anion water and hydrogen bonding.\n\nCrystal varieties\n\nGypsum occurs in nature as flattened and often twinned crystals, and transparent, cleavable masses called selenite. Selenite contains no significant selenium; rather, both substances were named for the ancient Greek word for the Moon.\n\nSelenite may also occur in a silky, fibrous form, in which case it is commonly called \"satin spar\". Finally, it may also be granular or quite compact. In hand-sized samples, it can be anywhere from transparent to opaque. A very fine-grained white or lightly tinted variety of gypsum, called alabaster, is prized for ornamental work of various sorts. In arid areas, gypsum can occur in a flower-like form, typically opaque, with embedded sand grains called desert rose. It also forms some of the largest crystals found in nature, up to 12 m long, in the form of selenite.\n\nOccurrence\n\nGypsum is a common mineral, with thick and extensive evaporite beds in association with sedimentary rocks. Deposits are known to occur in strata from as far back as the Archaean eon. Gypsum is deposited from lake and sea water, as well as in hot springs, from volcanic vapors, and sulfate solutions in veins. Hydrothermal anhydrite in veins is commonly hydrated to gypsum by groundwater in near-surface exposures. It is often associated with the minerals halite and sulfur. Gypsum is the most common sulfate mineral. Pure gypsum is white, but other substances found as impurities may give a wide range of colors to local deposits.\n\nBecause gypsum dissolves over time in water, gypsum is rarely found in the form of sand.  However, the unique conditions of the White Sands National Monument in the US state of New Mexico have created a 710 km2 expanse of white gypsum sand, enough to supply the construction industry with drywall for 1,000 years.\nCommercial exploitation of the area, strongly opposed by area residents, was permanently prevented in 1933 when president Herbert Hoover declared the gypsum dunes a protected national monument.\n\nGypsum is also formed as a by-product of sulfide oxidation, amongst others by pyrite oxidation, when the sulfuric acid generated reacts with calcium carbonate. Its presence indicates oxidizing conditions. Under reducing conditions, the sulfates it contains can be reduced back to sulfide by sulfate-reducing bacteria. Electric power stations burning coal with flue gas desulfurization produce large quantities of gypsum as a byproduct from the scrubbers.\n\nOrbital pictures from the Mars Reconnaissance Orbiter (MRO) have indicated the existence of gypsum dunes in the northern polar region of Mars,[http://hirise.lpl.arizona.edu/nea.php High-resolution Mars image gallery]. University of Arizona which were later confirmed at ground level by the Mars Exploration Rover (MER) Opportunity.[http://www.nasa.gov/mission_pages/mer/news/mer20111207.html NASA Mars Rover Finds Mineral Vein Deposited by Water], NASA, 7 December 2011.\n\nFile:Cristales cueva de Naica.JPG|Gypsum crystals in the Cave of the Crystals in Mexico. Note person for scale\nFile:White Gypsum - geograph.org.uk - 2503198.jpg|Veins of gypsum in the silts/marls of the Tea Green and Grey Marls, Blue Anchor, Somerset, UK\nFile:Gypsum layers Caprock Canyons 1.JPG|Veins of gypsum in Caprock Canyons State Park, Texas\n\nMining\n\nCommercial quantities of gypsum are found in the cities of Araripina and Grajaú in Brazil; in Pakistan, Jamaica, Iran (world's second largest producer), Thailand, Spain (the main producer in Europe), Germany, Italy, England, Ireland, Canada and the United States. Large open pit quarries are located in many places including Fort Dodge, Iowa, which sits on one of the largest deposits of gypsum in the world, and Plaster City, California, United States, and East Kutai, Kalimantan, Indonesia. Several small mines also exist in places such as Kalannie in Western Australia, where gypsum is sold to private buyers for additions of calcium and sulfur as well as reduction of aluminum toxicities on soil for agricultural purposes.\n\nCrystals of gypsum up to 11 m long have been found in the caves of the Naica Mine of Chihuahua, Mexico. The crystals thrived in the cave's extremely rare and stable natural environment. Temperatures stayed at 58 °C (136 °F), and the cave was filled with mineral-rich water that drove the crystals' growth. The largest of those crystals weighs 55 tons and is around 500,000 years old.\n\nFile:Gypsum-24382.jpg|Golden gypsum crystals from Winnipeg\nFile:WhiteSandsGypsum.jpg|Gypsum sand from White Sands National Monument, New Mexico\n\nSynthesis\n\nSynthetic gypsum is recovered via flue-gas desulfurization at some coal-fired power plants. It can be used interchangeably with natural gypsum in some applications.\n\nGypsum also precipitates onto brackish water membranes, a phenomenon known as mineral salt scaling, such as during brackish water desalination of water with high concentrations of calcium and sulfate. Scaling decreases membrane life and productivity. This is one of the main obstacles in brackish water membrane desalination processes, such as reverse osmosis or nanofiltration. Other forms of scaling, such as calcite scaling, depending on the water source, can also be important considerations in distillation, as well as in heat exchangers, where either the salt solubility or concentration can change rapidly.\n\nA new study has suggested that the formation of gypsum starts as tiny crystals of a mineral called bassanite (CaSO4·0.5H2O). This process occurs via a three-stage pathway: \n# homogeneous nucleation of nanocrystalline bassanite; \n# self-assembly of bassanite into aggregates, and \n# transformation of bassanite into gypsum.\n\nOccupational safety \n\nPeople can be exposed to gypsum in the workplace by breathing it in, skin contact, and eye contact.\n\nUnited States\n\nThe Occupational Safety and Health Administration (OSHA) has set the legal limit (permissible exposure limit) for gypsum exposure in the workplace as TWA 15 mg/m3 for total exposure and TWA 5 mg/m3 for respiratory exposure over an 8-hour workday. The National Institute for Occupational Safety and Health (NIOSH) has set a recommended exposure limit (REL) of TWA 10 mg/m3 for total exposure and TWA 5 mg/m3 for respiratory exposure over an 8-hour workday.\n\nUses\n\nGypsum is used in a wide variety of applications:\n*Gypsum board*[http://www.csinet.org/s_csi/docs/9400/9361.pdf Complimentary list of MasterFormat 2004 Edition numbers and titles] (large PDF document) is primarily used as a finish for walls and ceilings, and is known in construction as drywall, wallboard, sheetrock or plasterboard.\n*Gypsum blocks are used like concrete blocks in building construction.\n*Gypsum mortar is an ancient mortar used in building construction.\n*Plaster ingredients are used in surgical splints, casting moulds and modeling.\n*Fertilizer and soil conditioner:  In the late 18th and early 19th centuries, Nova Scotia gypsum, often referred to as plaster, was a highly sought fertilizer for wheat fields in the United States. It is also used in ameliorating high-sodium soils, such as in the Zuiderzee Works.\n*A binder in fast-dry tennis court clay\n*As alabaster, a material for sculpture, it was used especially in the ancient world before steel was developed, when its relative softness made it much easier to carve. \n*A wood substitute in the ancient world: For example, when wood became scarce due to deforestation on Bronze Age Crete, gypsum was employed in building construction at locations where wood was previously used.\n*A tofu (soy bean curd) coagulant, making it ultimately a major source of dietary calcium, especially in Asian cultures which traditionally use few dairy products\n*Adding hardness to water used for brewing\n*Used in baking as a dough conditioner, reducing stickiness, and as a baked-goods source of dietary calcium. The primary component of mineral yeast food.\n*A component of Portland cement used to prevent flash setting of concrete\n*Soil/water potential monitoring (soil moisture)\n*A common ingredient in making mead\n*In the medieval period, scribes and illuminators mixed it with lead carbonate (powdered white lead) to make gesso, which was applied to illuminated letters and gilded with gold in illuminated manuscripts.\n*In foot creams, shampoos and many other hair products\n*A medicinal agent in traditional Chinese medicine called shi gao\n*Impression plasters in dentistry\n*Used in mushroom cultivation to stop grains from clumping together\n*Tests have shown that gypsum can be used to remove pollutants such as lead or arsenic\n from contaminated waters.\n\nGallery\n\nFile:Gypsum-71006.jpg|Green gypsum crystals from Pernatty Lagoon, Mt Gunson, South Australia - its green color is due to presence of copper ions.\nFile:Gypsum-162462.jpg|Unusual selenite gypsum from the Red River, Winnipeg, Manitoba, Canada\nFile:Gypsum-47190.jpg|Classic \"ram's horn\" gypsum from Santa Eulalia, Chihuahua, Mexico, 7.5×4.3×3.8 cm\nFile:Roses des Sables Tunisie.jpg|Desert rose, 47 cm long\nFile:Gypsum-53691.jpg|Gypsum from Pernatty Lagoon, Mt Gunson, Stuart Shelf area, Andamooka Ranges - Lake Torrens area, South Australia, Australia\nFile:Copper-Gypsum-203925.jpg|Gypsum with crystalline native copper inside\nFile:Gypsum J1.jpg|Gypsum from Swan Hill, Victoria, Australia. The colouring is due to the copper oxide\nFile:Botryogen-Gypsum-199664.jpg|Bright, cherry-red gypsum crystals 2.5 cm in height colored by rich inclusions of the rare mineral botryogen\nFile:Gypse Naica.jpg|Gypsum from Naica, Mun. de Saucillo, Chihuahua, Mexico\nFile:Gypsum-251118.jpg|Golden color gem, \"fishtail\"-twinned crystals of Gypsum sitting atop a \"ball\" of Gypsum which is composed of several single bladed crystals",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gypsum" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13040" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Gypsum is a soft sulfate mineral composed of calcium sulfate dihydrate, with the chemical formula CaSO4·2H2O. It is widely mined and is used as a fertilizer, and as the main constituent in many forms of plaster, blackboard chalk and wallboard.  A massive fine-grained white or lightly tinted variety of gypsum, called alabaster, has been used for sculpture by many cultures including Ancient Egypt, Mesopotamia, Ancient Rome, the Byzantine Empire and the Nottingham alabasters of Medieval England. Mohs scale of mineral hardness, based on scratch hardness comparison, defines hardness value 2 as gypsum. It forms as an evaporite mineral and as a hydration product of anhydrite.\n\nEtymology and history\n\nThe word gypsum is derived from the Greek word γύψος (gypsos), \"plaster\". Because the quarries of the Montmartre district of Paris have long furnished burnt gypsum (calcined gypsum) used for various purposes, this dehydrated gypsum became known as plaster of Paris. Upon addition of water, after a few tens of minutes plaster of Paris becomes regular gypsum (dihydrate) again, causing the material to harden or \"set\" in ways that are useful for casting and construction.\n\nGypsum was known in Old English as spærstān, \"spear stone\", referring to its crystalline projections. (Thus, the word spar in mineralogy is by way of comparison to gypsum, referring to any non-ore mineral or crystal that forms in spearlike projections). Gypsum may act as a source of sulfur for plant growth, which was discovered by J. M. Mayer, and in the early 19th century, it was regarded as an almost miraculous fertilizer. American farmers were so anxious to acquire it that a lively smuggling trade with Nova Scotia evolved, resulting in the so-called \"Plaster War\" of 1820. In the 19th century, it was also known as  or .\n\nPhysical properties\n\nGypsum is moderately water-soluble (~2.0–2.5 g/l at 25 °C) and, in contrast to most other salts, it exhibits retrograde solubility, becoming less soluble at higher temperatures. When gypsum is heated in air it loses water and converts first to calcium sulfate hemihydrate, (bassanite, often simply called \"plaster\") and, if heated further, to anhydrous calcium sulfate (anhydrite).  As for anhydrite, its solubility in saline solutions and in brines is also strongly dependent on NaCl (common table salt) concentration.\n\nGypsum crystals are found to contain anion water and hydrogen bonding.\n\nCrystal varieties\n\nGypsum occurs in nature as flattened and often twinned crystals, and transparent, cleavable masses called selenite. Selenite contains no significant selenium; rather, both substances were named for the ancient Greek word for the Moon.\n\nSelenite may also occur in a silky, fibrous form, in which case it is commonly called \"satin spar\". Finally, it may also be granular or quite compact. In hand-sized samples, it can be anywhere from transparent to opaque. A very fine-grained white or lightly tinted variety of gypsum, called alabaster, is prized for ornamental work of various sorts. In arid areas, gypsum can occur in a flower-like form, typically opaque, with embedded sand grains called desert rose. It also forms some of the largest crystals found in nature, up to 12 m long, in the form of selenite.\n\nOccurrence\n\nGypsum is a common mineral, with thick and extensive evaporite beds in association with sedimentary rocks. Deposits are known to occur in strata from as far back as the Archaean eon. Gypsum is deposited from lake and sea water, as well as in hot springs, from volcanic vapors, and sulfate solutions in veins. Hydrothermal anhydrite in veins is commonly hydrated to gypsum by groundwater in near-surface exposures. It is often associated with the minerals halite and sulfur. Gypsum is the most common sulfate mineral. Pure gypsum is white, but other substances found as impurities may give a wide range of colors to local deposits.\n\nBecause gypsum dissolves over time in water, gypsum is rarely found in the form of sand.  However, the unique conditions of the White Sands National Monument in the US state of New Mexico have created a 710 km2 expanse of white gypsum sand, enough to supply the construction industry with drywall for 1,000 years.\nCommercial exploitation of the area, strongly opposed by area residents, was permanently prevented in 1933 when president Herbert Hoover declared the gypsum dunes a protected national monument.\n\nGypsum is also formed as a by-product of sulfide oxidation, amongst others by pyrite oxidation, when the sulfuric acid generated reacts with calcium carbonate. Its presence indicates oxidizing conditions. Under reducing conditions, the sulfates it contains can be reduced back to sulfide by sulfate-reducing bacteria. Electric power stations burning coal with flue gas desulfurization produce large quantities of gypsum as a byproduct from the scrubbers.\n\nOrbital pictures from the Mars Reconnaissance Orbiter (MRO) have indicated the existence of gypsum dunes in the northern polar region of Mars,[http://hirise.lpl.arizona.edu/nea.php High-resolution Mars image gallery]. University of Arizona which were later confirmed at ground level by the Mars Exploration Rover (MER) Opportunity.[http://www.nasa.gov/mission_pages/mer/news/mer20111207.html NASA Mars Rover Finds Mineral Vein Deposited by Water], NASA, 7 December 2011.\n\nFile:Cristales cueva de Naica.JPG|Gypsum crystals in the Cave of the Crystals in Mexico. Note person for scale\nFile:White Gypsum - geograph.org.uk - 2503198.jpg|Veins of gypsum in the silts/marls of the Tea Green and Grey Marls, Blue Anchor, Somerset, UK\nFile:Gypsum layers Caprock Canyons 1.JPG|Veins of gypsum in Caprock Canyons State Park, Texas\n\nMining\n\nCommercial quantities of gypsum are found in the cities of Araripina and Grajaú in Brazil; in Pakistan, Jamaica, Iran (world's second largest producer), Thailand, Spain (the main producer in Europe), Germany, Italy, England, Ireland, Canada and the United States. Large open pit quarries are located in many places including Fort Dodge, Iowa, which sits on one of the largest deposits of gypsum in the world, and Plaster City, California, United States, and East Kutai, Kalimantan, Indonesia. Several small mines also exist in places such as Kalannie in Western Australia, where gypsum is sold to private buyers for additions of calcium and sulfur as well as reduction of aluminum toxicities on soil for agricultural purposes.\n\nCrystals of gypsum up to 11 m long have been found in the caves of the Naica Mine of Chihuahua, Mexico. The crystals thrived in the cave's extremely rare and stable natural environment. Temperatures stayed at 58 °C (136 °F), and the cave was filled with mineral-rich water that drove the crystals' growth. The largest of those crystals weighs 55 tons and is around 500,000 years old.\n\nFile:Gypsum-24382.jpg|Golden gypsum crystals from Winnipeg\nFile:WhiteSandsGypsum.jpg|Gypsum sand from White Sands National Monument, New Mexico\n\nSynthesis\n\nSynthetic gypsum is recovered via flue-gas desulfurization at some coal-fired power plants. It can be used interchangeably with natural gypsum in some applications.\n\nGypsum also precipitates onto brackish water membranes, a phenomenon known as mineral salt scaling, such as during brackish water desalination of water with high concentrations of calcium and sulfate. Scaling decreases membrane life and productivity. This is one of the main obstacles in brackish water membrane desalination processes, such as reverse osmosis or nanofiltration. Other forms of scaling, such as calcite scaling, depending on the water source, can also be important considerations in distillation, as well as in heat exchangers, where either the salt solubility or concentration can change rapidly.\n\nA new study has suggested that the formation of gypsum starts as tiny crystals of a mineral called bassanite (CaSO4·0.5H2O). This process occurs via a three-stage pathway: \n# homogeneous nucleation of nanocrystalline bassanite; \n# self-assembly of bassanite into aggregates, and \n# transformation of bassanite into gypsum.\n\nOccupational safety \n\nPeople can be exposed to gypsum in the workplace by breathing it in, skin contact, and eye contact.\n\nUnited States\n\nThe Occupational Safety and Health Administration (OSHA) has set the legal limit (permissible exposure limit) for gypsum exposure in the workplace as TWA 15 mg/m3 for total exposure and TWA 5 mg/m3 for respiratory exposure over an 8-hour workday. The National Institute for Occupational Safety and Health (NIOSH) has set a recommended exposure limit (REL) of TWA 10 mg/m3 for total exposure and TWA 5 mg/m3 for respiratory exposure over an 8-hour workday.\n\nUses\n\nGypsum is used in a wide variety of applications:\n*Gypsum board*[http://www.csinet.org/s_csi/docs/9400/9361.pdf Complimentary list of MasterFormat 2004 Edition numbers and titles] (large PDF document) is primarily used as a finish for walls and ceilings, and is known in construction as drywall, wallboard, sheetrock or plasterboard.\n*Gypsum blocks are used like concrete blocks in building construction.\n*Gypsum mortar is an ancient mortar used in building construction.\n*Plaster ingredients are used in surgical splints, casting moulds and modeling.\n*Fertilizer and soil conditioner:  In the late 18th and early 19th centuries, Nova Scotia gypsum, often referred to as plaster, was a highly sought fertilizer for wheat fields in the United States. It is also used in ameliorating high-sodium soils, such as in the Zuiderzee Works.\n*A binder in fast-dry tennis court clay\n*As alabaster, a material for sculpture, it was used especially in the ancient world before steel was developed, when its relative softness made it much easier to carve. \n*A wood substitute in the ancient world: For example, when wood became scarce due to deforestation on Bronze Age Crete, gypsum was employed in building construction at locations where wood was previously used.\n*A tofu (soy bean curd) coagulant, making it ultimately a major source of dietary calcium, especially in Asian cultures which traditionally use few dairy products\n*Adding hardness to water used for brewing\n*Used in baking as a dough conditioner, reducing stickiness, and as a baked-goods source of dietary calcium. The primary component of mineral yeast food.\n*A component of Portland cement used to prevent flash setting of concrete\n*Soil/water potential monitoring (soil moisture)\n*A common ingredient in making mead\n*In the medieval period, scribes and illuminators mixed it with lead carbonate (powdered white lead) to make gesso, which was applied to illuminated letters and gilded with gold in illuminated manuscripts.\n*In foot creams, shampoos and many other hair products\n*A medicinal agent in traditional Chinese medicine called shi gao\n*Impression plasters in dentistry\n*Used in mushroom cultivation to stop grains from clumping together\n*Tests have shown that gypsum can be used to remove pollutants such as lead or arsenic\n from contaminated waters.\n\nGallery\n\nFile:Gypsum-71006.jpg|Green gypsum crystals from Pernatty Lagoon, Mt Gunson, South Australia - its green color is due to presence of copper ions.\nFile:Gypsum-162462.jpg|Unusual selenite gypsum from the Red River, Winnipeg, Manitoba, Canada\nFile:Gypsum-47190.jpg|Classic \"ram's horn\" gypsum from Santa Eulalia, Chihuahua, Mexico, 7.5×4.3×3.8 cm\nFile:Roses des Sables Tunisie.jpg|Desert rose, 47 cm long\nFile:Gypsum-53691.jpg|Gypsum from Pernatty Lagoon, Mt Gunson, Stuart Shelf area, Andamooka Ranges - Lake Torrens area, South Australia, Australia\nFile:Copper-Gypsum-203925.jpg|Gypsum with crystalline native copper inside\nFile:Gypsum J1.jpg|Gypsum from Swan Hill, Victoria, Australia. The colouring is due to the copper oxide\nFile:Botryogen-Gypsum-199664.jpg|Bright, cherry-red gypsum crystals 2.5 cm in height colored by rich inclusions of the rare mineral botryogen\nFile:Gypse Naica.jpg|Gypsum from Naica, Mun. de Saucillo, Chihuahua, Mexico\nFile:Gypsum-251118.jpg|Golden color gem, \"fishtail\"-twinned crystals of Gypsum sitting atop a \"ball\" of Gypsum which is composed of several single bladed crystals. Gypsum. http://en.wikipedia.org/?curid=13040."
  }
}
