{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11127",
  "eid" : "f9d2a220-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778498882,
  "textBody" : "The Federal Bureau of Investigation (FBI), formerly the Bureau of Investigation (BOI),  is the domestic intelligence and security service of the United States, and its principal federal law enforcement agency. Operating under the jurisdiction of the US Department of Justice, the FBI is also a member of the U.S. Intelligence Community and reports to both the Attorney General and the Director of National Intelligence. A leading U.S. counter-terrorism, counterintelligence, and criminal investigative organization, the FBI has jurisdiction over violations of more than 200 categories of federal crimes.\n\nAlthough many of the FBI's functions are unique, its activities in support of national security are comparable to those of the British MI5 and the Russian FSB. Unlike the Central Intelligence Agency (CIA), which has no law enforcement authority and is focused on intelligence collection abroad, the FBI is primarily a domestic agency, maintaining 56 field offices in major cities throughout the United States, and more than 400 resident agencies in lesser cities and areas across the nation. At an FBI field office, a senior-level FBI officer concurrently serves as the representative of the Director of National Intelligence.[https://www.fbi.gov/news/testimony/fbi-budget-request-for-fiscal-year-2015 Statement Before the House Appropriations Committee, Subcommittee on Commerce, Justice, Science, and Related Agencies], Federal Bureau of Investigation, March 26, 2014[https://www.washingtonpost.com/world/national-security/fbi-gets-a-broader-role-in-coordinating-domestic-intelligence-activities/2012/06/19/gJQAtmupoV_story.html FBI gets a broader role in coordinating domestic intelligence activities], Washington Post, June 19, 2012\n\nDespite its domestic focus, the FBI also maintains a significant international footprint, operating 60 Legal Attache (LEGAT) offices and 15 sub-offices in US embassies and consulates across the globe. These foreign offices exist primarily for the purpose of coordination with foreign security services and do not usually conduct unilateral operations in the host countries.[https://www.fbi.gov/about-us/international_operations/overview Overview of the Legal Attaché Program] , Federal Bureau of Investigation, Retrieved: March 25, 2015 The FBI can and does at times carry out secret activities overseas,[http://www.nbcnews.com/id/6973534/ns/us_news-security/t/spies-clash-fbi-joins-cia-overseas/#.VTKrN5OATz4 Spies Clash as FBI Joins CIA Overseas: Sources Talk of Communication Problem in Terrorism Role], Associated Press via NBC News, February 15, 2005 just as the CIA has a limited domestic function; these activities generally require coordination across government agencies.\n\nThe FBI was established in 1908 as the Bureau of Investigation, the BOI or BI for short. Its name was changed to the Federal Bureau of Investigation (FBI) in 1935. The FBI headquarters is the J. Edgar Hoover Building, located in Washington, D.C.\n\nBudget, mission, and priorities\n\nIn the fiscal year 2016, the Bureau's total budget was approximately $8.7 billion.\n\nThe FBI's main goal is to protect and defend the United States, to uphold and enforce the criminal laws of the United States, and to provide leadership and criminal justice services to federal, state, municipal, and international agencies and partners.\n\nCurrently, the FBI's top priorities are:\n\n# Protect the United States from terrorist attacks,\n# Protect the United States against foreign intelligence operations and espionage,\n# Protect the United States against cyber-based attacks and high-technology crimes,\n# Combat public corruption at all levels,\n# Protect civil rights,\n# Combat transnational/national criminal organizations and enterprises,\n# Combat major white-collar crime,\n# Combat significant violent crime,\n# Support federal, state, local and international partners, and\n# Upgrade technology to enable, and further, the successful performances of its missions as stated above.\n\nHistory\n\nBackground\n\nIn 1896, the National Bureau of Criminal Identification was founded, which provided agencies across the country with information to identify known criminals. The 1901 assassination of President William McKinley created a perception that America was under threat from anarchists. The Departments of Justice and Labor had been keeping records on anarchists for years, but President Theodore Roosevelt wanted more power to monitor them.\n\nThe Justice Department had been tasked with the regulation of interstate commerce since 1887, though it lacked the staff to do so. It had made little effort to relieve its staff shortage until the Oregon land fraud scandal at the turn of the 20th Century. President Roosevelt instructed Attorney General Charles Bonaparte to organize an autonomous investigative service that would report only to the Attorney General.\n\nBonaparte reached out to other agencies, including the U.S. Secret Service, for personnel, investigators in particular. On May 27, 1908, the Congress forbade this use of Treasury employees by the Justice Department, citing fears that the new agency would serve as a secret police department. Again at Roosevelt's urging, Bonaparte moved to organize a formal Bureau of Investigation, which would then have its own staff of special agents.\n\nCreation\n\nThe Bureau of Investigation (BOI) was created on July 26, 1908, after the Congress had adjourned for the summer. Attorney General Bonaparte, using Department of Justice expense funds, hired thirty-four people, including some veterans of the Secret Service, to work for a new investigative agency. Its first \"Chief\" (the title is now known as \"Director\") was Stanley Finch. Bonaparte notified the Congress of these actions in December 1908.\n\nThe bureau's first official task was visiting and making surveys of the houses of prostitution in preparation for enforcing the \"White Slave Traffic Act,\" or Mann Act, passed on June 25, 1910. In 1932, the bureau was renamed the United States Bureau of Investigation. The following year it was linked to the Bureau of Prohibition and rechristened the Division of Investigation (DOI) before finally becoming an independent service within the Department of Justice in 1935. In the same year, its name was officially changed from the Division of Investigation to the present-day Federal Bureau of Investigation, or FBI.\n\nJ. Edgar Hoover as FBI Director\n\nJ. Edgar Hoover served as FBI Director from 1924 to 1972, a combined 48 years with the BOI, DOI, and FBI. He was chiefly responsible for creating the Scientific Crime Detection Laboratory, or the FBI Laboratory, which officially opened in 1932, as part of his work to professionalize investigations by the government. Hoover was substantially involved in most major cases and projects that the FBI handled during his tenure. But as detailed below, his proved to be a highly controversial tenure as Bureau Director, especially in its later years. After Hoover's death, the Congress passed legislation that limited the tenure of future FBI Directors to ten years.\n\nEarly homicide investigations of the new agency included the Osage Indian murders.  During the \"War on Crime\" of the 1930s, FBI agents apprehended or killed a number of notorious criminals who carried out kidnappings, robberies, and murders throughout the nation, including John Dillinger, \"Baby Face\" Nelson, Kate \"Ma\" Barker, Alvin \"Creepy\" Karpis, and George \"Machine Gun\" Kelly.\n\nOther activities of its early decades included a decisive role in reducing the scope and influence of the Ku Klux Klan. Additionally, through the work of Edwin Atherton, the BOI claimed success in apprehending an entire army of Mexican neo-revolutionaries under the leadership of General Enrique Estrada in the mid-1920s, east of San Diego, California.\n\nHoover began using wiretapping in the 1920s during Prohibition to arrest bootleggers. In the 1927 case Olmstead v. United States, in which a bootlegger was caught through telephone tapping, the United States Supreme Court ruled that FBI wiretaps did not violate the Fourth Amendment as unlawful search and seizure, as long as the FBI did not break into a person's home to complete the tapping. After Prohibition's repeal, Congress passed the Communications Act of 1934, which outlawed non-consensual phone tapping, but did allow bugging. In the 1939 case Nardone v. United States, the court ruled that due to the 1934 law, evidence the FBI obtained by phone tapping was inadmissible in court. After the 1967 case Katz v. United States overturned the 1927 case that had allowed bugging, Congress passed the Omnibus Crime Control Act, allowing public authorities to tap telephones during investigations, as long as they obtained warrants beforehand.\n\nNational security\n\nBeginning in the 1940s and continuing into the 1970s, the bureau investigated cases of espionage against the United States and its allies. Eight Nazi agents who had planned sabotage operations against American targets were arrested, and six were executed (Ex parte Quirin) under their sentences. Also during this time, a joint US/UK code-breaking effort called \"The Venona Project\"—with which the FBI was heavily involved—broke Soviet diplomatic and intelligence communications codes, allowing the US and British governments to read Soviet communications. This effort confirmed the existence of Americans working in the United States for Soviet intelligence. Hoover was administering this project, but he failed to notify the Central Intelligence Agency (CIA) of it until 1952. Another notable case was the arrest of Soviet spy Rudolf Abel in 1957. The discovery of Soviet spies operating in the US allowed Hoover to pursue his longstanding obsession with the threat he perceived from the American Left, ranging from Communist Party of the United States of America (CPUSA) union organizers to American liberals.\n\nJapanese American internment\n\nIn 1939, the Bureau began compiling a custodial detention list with the names of those who would be taken into custody in the event of war with Axis nations. The majority of the names on the list belonged to Issei community leaders, as the FBI investigation built on an existing Naval Intelligence index that had focused on Japanese Americans in Hawaii and the West Coast, but many German and Italian nationals also found their way onto the secret list. Robert Shivers, head of the Honolulu office, obtained permission from Hoover to start detaining those on the list on December 7, 1941, while bombs were still falling over Pearl Harbor. Mass arrests and searches of homes (in most cases conducted without warrants) began a few hours after the attack, and over the next several weeks more than 5,500 Issei men were taken into FBI custody. On February 19, 1942, President Franklin Roosevelt issued Executive Order 9066, authorizing the removal of Japanese Americans from the West Coast. FBI Director Hoover opposed the subsequent mass removal and confinement of Japanese Americans authorized under Executive Order 9066, but Roosevelt prevailed. The vast majority went along with the subsequent exclusion orders, but in a handful of cases where Japanese Americans refused to obey the new military regulations, FBI agents handled their arrests. The Bureau continued surveillance on Japanese Americans throughout the war, conducting background checks on applicants for resettlement outside camp, and entering the camps (usually without the permission of War Relocation Authority officials) and grooming informants to monitor dissidents and \"troublemakers.\" After the war, the FBI was assigned to protect returning Japanese Americans from attacks by hostile white communities.\n\nSex Deviates Program\n\nAccording to Douglas M. Charles, the FBI's Sex Deviates Program began on April 10, 1950 when J. Edgar Hoover forwarded the White House, U.S. Civil Service Commission, and branches of the armed services a list of 393 alleged federal employees who were allegedly arrested in Washington D.C., since 1947, on charges of \"sexual irregularities\". On June 20, 1951, Hoover expands the program by issuing a memo establishing a \"uniform policy for the handling of the increasing number of reports and allegations concerning present and past employees of the United State Government who assertedly [sic] are sex deviates.\" The program was expanded to include non-government jobs. According to Athan Theoharis, \"In 1951 he [Hoover] had unilaterally instituted a Sex Deviates program to purge alleged homosexuals from any position in the federal government, from the lowliest clerk to the more powerful position of White house aide.\" On May 27, 1953, Executive Order 10450 goes into effect. The program is expanded further by this executive order by making all federal employment of homosexuals illegal. On July 8, 1953, the FBI forwarded to the U.S. Civil Service Commission information from the Sex Deviates Program. In 1977–1978, 300,000 pages, collected between 1930 to the mid-1970s, in the Sex Deviate Program were destroyed by FBI officals.[http://outhistory.org/exhibits/show/fbi-history/1950-1959 FBI and Homosexuality: 1950-1959][http://outhistory.org/exhibits/show/fbi-history/1970-1979 FBI and Homosexuality: 1970-1979 ][http://outhistory.org/exhibits/show/fbi-history/2010-2019 FBI and Homosexuality: 2010-2019]\n\nCivil Rights Movement\n\nDuring the 1950s and 1960s, FBI officials became increasingly concerned about the influence of civil rights leaders, whom they believed either had communist ties or were unduly influenced by communists or \"fellow travellers.\" In 1956, for example, Hoover sent an open letter denouncing Dr. T.R.M. Howard, a civil rights leader, surgeon, and wealthy entrepreneur in Mississippi who had criticized FBI inaction in solving recent murders of George W. Lee, Emmett Till, and other blacks in the South.David T. Beito and Linda Royster Beito, Black Maverick: T.R.M. Howard's Fight for Civil Rights and Economic Power (Urbana: University of Illinois Press, 2009), 148, 154–59. The FBI carried out controversial domestic surveillance in an operation it called the COINTELPRO, a portmanteau derived from \"COunter-INTELligence PROgram.\" It was to investigate and disrupt the activities of dissident political organizations within the United States, including both militant and non-violent organizations. Among its targets was the Southern Christian Leadership Conference, a leading civil rights organization whose clergy leadership included the Rev. Dr. Martin Luther King, Jr., who is addressed in more detail below.\n\nThe FBI frequently investigated Martin Luther King, Jr. In the mid-1960s, King began publicly criticizing the Bureau for giving insufficient attention to the use of terrorism by white supremacists. Hoover responded by publicly calling King the most \"notorious liar\" in the United States.Taylor Branch, Pillar of Fire: America in the King Years 1963-1965 (Simon and Shuster, 1999), p. 524-529 In his 1991 memoir, Washington Post journalist Carl Rowan asserted that the FBI had sent at least one anonymous letter to King encouraging him to commit suicide. Historian Taylor Branch documents an anonymous November 1964 \"suicide package\" sent by the Bureau that combined a letter to the civil rights leader telling him \"You are done. There is only one way out for you...\" with audio recordings of King's sexual indiscretions.\n\nIn March 1971, the residential office of an FBI agent in Media, Pennsylvania was burgled by a group calling itself the Citizens' Commission to Investigate the FBI. Numerous files were taken and distributed to a range of newspapers, including The Harvard Crimson. The files detailed the FBI's extensive COINTELPRO program, which included investigations into lives of ordinary citizens—including a black student group at a Pennsylvania military college and the daughter of Congressman Henry Reuss of Wisconsin. The country was \"jolted\" by the revelations, which included assassinations of political activists, and the actions were denounced by members of the Congress, including House Majority Leader Hale Boggs. The phones of some members of the Congress, including Boggs, had allegedly been tapped.\n\nKennedy's assassination\n\nWhen President John F. Kennedy was shot and killed, the jurisdiction fell to the local police departments until President Lyndon B. Johnson directed the FBI to take over the investigation. To ensure clarity about the responsibility for investigation of homicides of federal officials, the Congress passed a law that included investigations of such deaths of federal officials, especially by homicide, within FBI jurisdiction. This new law was passed in 1965.\n\nOrganized crime\n\nIn response to organized crime, on August 25, 1953, the FBI created the Top Hoodlum Program. The national office directed field offices to gather information on mobsters in their territories and to report it regularly to Washington for a centralized collection of intelligence on racketeers.[https://www.fbi.gov/page2/august07/mobintel080907.htm \"Using Intel to Stop the Mob, Part 2\"] . Retrieved 2010-02-12. After the Racketeer Influenced and Corrupt Organizations Act, or RICO Act, took effect, the FBI began investigating the former Prohibition-organized groups, which had become fronts for crime in major cities and small towns. All of the FBI work was done undercover and from within these organizations, using the provisions provided in the RICO Act. Gradually the agency dismantled many of the groups. Although Hoover initially denied the existence of a National Crime Syndicate in the United States, the Bureau later conducted operations against known organized crime syndicates and families, including those headed by Sam Giancana and John Gotti. The RICO Act is still used today for all organized crime and any individuals who may fall under the Act's provisions.\n\nIn 2003 a congressional committee called the FBI's organized crime informant program \"one of the greatest failures in the history of federal law enforcement.\" The FBI allowed four innocent men to be convicted of the March 1965 gangland murder of Edward \"Teddy\" Deegan in order to protect Vincent Flemmi, an FBI informant. Three of the men were sentenced to death (which was later reduced to life in prison), and the fourth defendant was sentenced to life in prison.\n Two of the four men died in prison after serving almost 30 years, and two others were released after serving 32 and 36 years. In July 2007, U.S. District Judge Nancy Gertner in Boston found that the Bureau had helped convict the four men using false witness accounts given by mobster Joseph Barboza. The U.S. Government was ordered to pay $100 million in damages to the four defendants.\n\nSpecial FBI teams\n\nIn 1982, the FBI formed an elite unit to help with problems that might arise at the 1984 Summer Olympics to be held in Los Angeles, particularly terrorism and major-crime. This was a result of the 1972 Summer Olympics in Munich, Germany, when terrorists murdered the Israeli athletes. Named the Hostage Rescue Team, or HRT, it acts as the FBI lead for a national SWAT team in related procedures and all counter-terrorism cases. Also formed in 1984 was the Computer Analysis and Response Team, or CART.\n\nFrom the end of the 1980s to the early 1990s, the FBI reassigned more than 300 agents from foreign counter-intelligence duties to violent crime, and made violent crime the sixth national priority. With reduced cuts to other well-established departments, and because terrorism was no longer considered a threat after the end of the Cold War, the FBI assisted local and state police forces in tracking fugitives who had crossed state lines, which is a federal offense. The FBI Laboratory helped develop DNA testing, continuing its pioneering role in identification that began with its fingerprinting system in 1924.\n\nNotable efforts in the 1990s\n\nBetween 1993 and 1996, the FBI increased its counter-terrorism role in the wake of the first 1993 World Trade Center bombing in New York City, New York; the 1995 Oklahoma City bombing in Oklahoma City, Oklahoma; and the arrest of the Unabomber in 1996. Technological innovation and the skills of FBI Laboratory analysts helped ensure that the three cases were successfully prosecuted. But Justice Department investigations into the FBI's roles in the Ruby Ridge and Waco incidents were found to have been obstructed by agents within the Bureau. During the 1996 Summer Olympics in Atlanta, Georgia, the FBI was criticized for its investigation of the Centennial Olympic Park bombing. It has settled a dispute with Richard Jewell, who was a private security guard at the venue, along with some media organizations, in regard to the leaking of his name during the investigation; this had briefly led to his being wrongly suspected of the bombing.\n\nAfter Congress passed the Communications Assistance for Law Enforcement Act (CALEA, 1994), the Health Insurance Portability and Accountability Act (HIPAA, 1996), and the Economic Espionage Act (EEA, 1996), the FBI followed suit and underwent a technological upgrade in 1998, just as it did with its CART team in 1991. Computer Investigations and Infrastructure Threat Assessment Center (CITAC) and the National Infrastructure Protection Center (NIPC) were created to deal with the increase in Internet-related problems, such as computer viruses, worms, and other malicious programs that threatened US operations. With these developments, the FBI increased its electronic surveillance in public safety and national security investigations, adapting to the telecommunications advancements that changed the nature of such problems.\n\nSeptember 11 attacks\n\nDuring the September 11, 2001, attacks on the World Trade Center, FBI agent Leonard W. Hatton Jr. was killed during the rescue effort while helping the rescue personnel evacuate the occupants of the South Tower, and he stayed when it collapsed. Within months after the attacks, FBI Director Robert Mueller, who had been sworn in a week before the attacks, called for a re-engineering of FBI structure and operations. He made countering every federal crime a top priority, including the prevention of terrorism, countering foreign intelligence operations, addressing cyber security threats, other high-tech crimes, protecting civil rights, combating public corruption, organized crime, white-collar crime, and major acts of violent crime.\n\nIn February 2001, Robert Hanssen was caught selling information to the Russian government. It was later learned that Hanssen, who had reached a high position within the FBI, had been selling intelligence since as early as 1979. He pleaded guilty to treason and received a life sentence in 2002, but the incident led many to question the security practices employed by the FBI. There was also a claim that Hanssen might have contributed information that led to the September 11, 2001 attacks.\n\nThe 9/11 Commission's final report on July 22, 2004, stated that the FBI and Central Intelligence Agency (CIA) were both partially to blame for not pursuing intelligence reports that could have prevented the September 11, 2001, attacks. In its most damning assessment, the report concluded that the country had \"not been well served\" by either agency and listed numerous recommendations for changes within the FBI. While the FBI did accede to most of the recommendations, including oversight by the new Director of National Intelligence, some former members of the 9/11 Commission publicly criticized the FBI in October 2005, claiming it was resisting any meaningful changes.\n\nOn July 8, 2007, The Washington Post published excerpts from UCLA Professor Amy Zegart's book Spying Blind: The CIA, the FBI, and the Origins of 9/11. The Post reported, from Zegart's book, that government documents showed that both the CIA and the FBI had missed 23 potential chances to disrupt the terrorist attacks of September 11, 2001. The primary reasons for the failures included: agency cultures resistant to change and new ideas; inappropriate incentives for promotion; and a lack of cooperation between the FBI, CIA and the rest of the United States Intelligence Community. The book blamed the FBI's decentralized structure, which prevented effective communication and cooperation among different FBI offices. The book suggested that the FBI had not evolved into an effective counter-terrorism or counter-intelligence agency, due in large part to deeply ingrained agency cultural resistance to change. For example, FBI personnel practices continued to treat all staff other than special agents as support staff, classifying intelligence analysts alongside the FBI's auto mechanics and janitors.\n\nFaulty bullet analysis\n\nFor over 40 years, the FBI crime lab in Quantico had believed that lead alloys used in bullets had unique chemical signatures. It was analyzing the bullets with the goal of matching them chemically, not only to a single batch of ammunition coming out of a factory, but also to a single box of bullets. The National Academy of Sciences conducted an 18-month independent review of comparative bullet-lead analysis. In 2003, its National Research Council published a report whose conclusions called into question 30 years of FBI testimony. It found the analytic model used by the FBI for interpreting results was deeply flawed, and the conclusion, that bullet fragments could be matched to a box of ammunition, was so overstated that it was misleading under the rules of evidence. One year later, the FBI decided to stop conducting bullet lead analyses.\n\nAfter a 60 Minutes/Washington Post investigation in November 2007, two years later, the Bureau agreed to identify, review, and release all pertinent cases, and notify prosecutors about cases in which faulty testimony was given.\n\nOrganization\n\nOrganizational structure\n\nThe FBI is organized into functional branches and the Office of the Director, which contains most administrative offices. An executive assistant director manages each branch. Each branch is then divided into offices and divisions, each headed by an assistant director. The various divisions are further divided into sub-branches, led by deputy assistant directors. Within these sub-branches there are various sections headed by section chiefs. Section chiefs are ranked analogous to special agents in charge.\n\nFour of the branches report to the deputy director while two report to the associate director. The functions branches of the FBI are:\n* FBI Intelligence Branch\n* FBI National Security Branch\n* FBI Criminal, Cyber, Response, and Services Branch\n* FBI Science and Technology Branch\n* FBI Information and Technology Branch\n* FBI Human Resources Branch\n\nThe Office of the Director serves as the central administrative organ of the FBI. The office provides staff support functions (such as finance and facilities management) to the five function branches and the various field divisions. The office is managed by the FBI associate director, who also oversees the operations of both the Information and Technology and Human Resources Branches.\n* Office of the Director\n** Immediate Office of the Director\n** Office of the Deputy Director\n** Office of the Associate Director\n** Office of Congressional Affairs\n** Office of Equal Employment Opportunity Affairs\n** Office of the General Counsel\n** Office of Integrity and Compliance\n** Office of the Ombudsman\n** Office of Professional Responsibility\n** Office of Public Affairs\n** Inspection Division\n** Facilities and Logistics Services Division\n** Finance Division\n** Records Management Division\n** Resource Planning Office\n** Security Division\n\nRank structure\n\nThe following is a listing of the rank structure found within the FBI (in ascending order):\n* Field Agents\n** New Agent Trainee\n** Special Agent\n** Senior Special Agent\n** Supervisory Special Agent\n** Assistant Special Agent-in-Charge (ASAC)\n** Special Agent-in-Charge (SAC)\n* FBI Management\n** Deputy Assistant Director\n** Assistant Director\n** Associate Executive Assistant Director\n** Executive Assistant Director\n** Associate Deputy Director\n** Deputy Chief of Staff\n** Chief of Staff and Special Counsel to the Director\n** Deputy Director\n** Director\n\nLegal authority\n\nThe FBI's mandate is established in Title 28 of the United States Code (U.S. Code), Section 533, which authorizes the Attorney General to \"appoint officials to detect and prosecute crimes against the United States.\" Other federal statutes give the FBI the authority and responsibility to investigate specific crimes.\n\nThe FBI's chief tool against organized crime is the Racketeer Influenced and Corrupt Organizations (RICO) Act. The FBI is also charged with the responsibility of enforcing compliance of the United States Civil Rights Act of 1964 and investigating violations of the act in addition to prosecuting such violations with the United States Department of Justice (DOJ). The FBI also shares concurrent jurisdiction with the Drug Enforcement Administration (DEA) in the enforcement of the Controlled Substances Act of 1970.\n\nThe USA PATRIOT Act increased the powers allotted to the FBI, especially in wiretapping and monitoring of Internet activity. One of the most controversial provisions of the act is the so-called sneak and peek provision, granting the FBI powers to search a house while the residents are away, and not requiring them to notify the residents for several weeks afterwards. Under the PATRIOT Act's provisions, the FBI also resumed inquiring into the library records of those who are suspected of terrorism (something it had supposedly not done since the 1970s).\n\nIn the early 1980s, Senate hearings were held to examine FBI undercover operations in the wake of the Abscam controversy, which had allegations of entrapment of elected officials. As a result, in following years a number of guidelines were issued to constrain FBI activities.\n\nA March 2007 report by the inspector general of the Justice Department described the FBI's \"widespread and serious misuse\" of national security letters, a form of administrative subpoena used to demand records and data pertaining to individuals. The report said that between 2003 and 2005, the FBI had issued more than 140,000 national security letters, many involving people with no obvious connections to terrorism.\n\nInformation obtained through an FBI investigation is presented to the appropriate U.S. Attorney or Department of Justice official, who decides if prosecution or other action is warranted.\n\nThe FBI often works in conjunction with other federal agencies, including the U.S. Coast Guard (USCG) and U.S. Customs and Border Protection (CBP) in seaport and airport security, and the National Transportation Safety Board in investigating airplane crashes and other critical incidents. Immigration and Customs Enforcement Homeland Security Investigations (ICE-HSI) has nearly the same amount of investigative manpower as the FBI, and investigates the largest range of crimes. In the wake of the September 11 attacks, then-Attorney General Ashcroft assigned the FBI as the designated lead organization in terrorism investigations after the creation of the U.S. Department of Homeland Security. ICE-HSI and the FBI are both integral members of the Joint Terrorism Task Force.\n\nIndian reservations\n\nThe federal government has the primary responsibility for investigating[https://www.fbi.gov/hq/cid/indian/background.htm \"Indian Country Crime\"]  FBI website, accessed August 10, 2010 and prosecuting serious crime on Indian reservations.\n\nThe FBI does not specifically list crimes in Native American land as one of its priorities.[https://www.fbi.gov/priorities/priorities.htm FBI \"Facts and Figures\"]  See prominently displayed list of priorities, accessed August 10, 2010  Often serious crimes have been either poorly investigated or prosecution has been declined. Tribal courts can impose sentences of up to three years, under certain restrictions.[http://www.denverpost.com/frontpage/ci_15373276? Michael Riley, \"Expansion of tribal courts' authority passes Senate\"]  , The Denver Post Posted: 25 June 2010 01:00:00 am MDT Updated: 25 June 2010 02:13:47 am MDT Accessed June 25, 2010[http://www.denverpost.com/ci_15636761 Michael Riley, \"President Obama signs tribal-justice changes\"] , The Denver Post, Posted: 30 July 2010 01:00:00 am MDT, Updated: 30 July 2010 06:00:20 am MDT, accessed July 30, 2010\n\nInfrastructure\n\nThe FBI is headquartered at the J. Edgar Hoover Building in Washington, D.C., with 56 field offices in major cities across the United States. The FBI also maintains over 400 resident agencies across the United States, as well as over 50 legal attachés at United States embassies and consulates. Many specialized FBI functions are located at facilities in Quantico, Virginia, as well as a \"data campus\" in Clarksburg, West Virginia, where 96 million sets of fingerprints \"from across the United States are stored, along with others collected by American authorities from prisoners in Saudi Arabia and Yemen, Iraq and Afghanistan.\"Priest, Dana and Arkin, William (December 2010) [http://projects.washingtonpost.com/top-secret-america/articles/monitoring-america/3/ Monitoring America] , Washington Post The FBI is in process of moving its Records Management Division, which processes Freedom of Information Act (FOIA) requests, to Winchester, Virginia.\n\nAccording to The Washington Post, the FBI \"is building a vast repository controlled by people who work in a top-secret vault on the fourth floor of the J. Edgar Hoover Building in Washington. This one stores the profiles of tens of thousands of Americans and legal residents who are not accused of any crime. What they have done is appear to be acting suspiciously to a town sheriff, a traffic cop or even a neighbor.\"\n\nThe FBI Laboratory, established with the formation of the BOI, did not appear in the J. Edgar Hoover Building until its completion in 1974. The lab serves as the primary lab for most DNA, biological, and physical work. Public tours of FBI headquarters ran through the FBI laboratory workspace before the move to the J. Edgar Hoover Building. The services the lab conducts include Chemistry, Combined DNA Index System (CODIS), Computer Analysis and Response, DNA Analysis, Evidence Response, Explosives, Firearms and Tool marks, Forensic Audio, Forensic Video, Image Analysis, Forensic Science Research, Forensic Science Training, Hazardous Materials Response, Investigative and Prospective Graphics, Latent Prints, Materials Analysis, Questioned Documents, Racketeering Records, Special Photographic Analysis, Structural Design, and Trace Evidence. The services of the FBI Laboratory are used by many state, local, and international agencies free of charge. The lab also maintains a second lab at the FBI Academy.\n\nThe FBI Academy, located in Quantico, Virginia, is home to the communications and computer laboratory the FBI utilizes. It is also where new agents are sent for training to become FBI Special Agents. Going through the 21-week course is required for every Special Agent. First opened for use in 1972, the facility located on 385 acres (1.6 km2) of woodland. The Academy trains state and local law enforcement agencies, which are invited to the law enforcement training center. The FBI units that reside at Quantico are the Field and Police Training Unit, Firearms Training Unit, Forensic Science Research and Training Center, Technology Services Unit (TSU), Investigative Training Unit, Law Enforcement Communication Unit, Leadership and Management Science Units (LSMU), Physical Training Unit, New Agents' Training Unit (NATU), Practical Applications Unit (PAU), the Investigative Computer Training Unit and the \"College of Analytical Studies.\"\n\nIn 2000, the FBI began the Trilogy project to upgrade its outdated information technology (IT) infrastructure. This project, originally scheduled to take three years and cost around $380 million, ended up over budget and behind schedule. Efforts to deploy modern computers and networking equipment were generally successful, but attempts to develop new investigation software, outsourced to Science Applications International Corporation (SAIC), were not. Virtual Case File, or VCF, as the software was known, was plagued by poorly defined goals, and repeated changes in management. In January 2005, more than two years after the software was originally planned for completion, the FBI officially abandoned the project. At least $100 million (and much more by some estimates) was spent on the project, which never became operational. The FBI has been forced to continue using its decade-old Automated Case Support system, which IT experts consider woefully inadequate. In March 2005, the FBI announced it was beginning a new, more ambitious software project, code-named Sentinel, which they expected to complete by 2009.\n\nCarnivore was an electronic eavesdropping software system implemented by the FBI during the Clinton administration; it was designed to monitor email and electronic communications. After prolonged negative coverage in the press, the FBI changed the name of its system from \"Carnivore\" to \"DCS1000.\" DCS is reported to stand for \"Digital Collection System\"; the system has the same functions as before. The Associated Press reported in mid-January 2005 that the FBI essentially abandoned the use of Carnivore in 2001, in favor of commercially available software, such as NarusInsight.\n\nThe Criminal Justice Information Services (CJIS) Division is located in Clarksburg, West Virginia. Organized beginning in 1991, the office opened in 1995 as the youngest agency division. The complex is the length of three football fields. It provides a main repository for information in various data systems. Under the roof of the CJIS are the programs for the National Crime Information Center (NCIC), Uniform Crime Reporting (UCR), Fingerprint Identification, Integrated Automated Fingerprint Identification System (IAFIS), NCIC 2000, and the National Incident-Based Reporting System (NIBRS). Many state and local agencies use these data systems as a source for their own investigations and contribute to the database using secure communications. FBI provides these tools of sophisticated identification and information services to local, state, federal, and international law enforcement agencies.\n\nFBI is in charge of National Virtual Translation Center, which provides \"timely and accurate translations of foreign intelligence for all elements of the Intelligence Community.\"\n\nPersonnel\n\nAs of December 31, 2009, the FBI had a total of 33,852 employees. That includes 13,412 special agents and 20,420 support professionals, such as intelligence analysts, language specialists, scientists, information technology specialists, and other professionals.\n\nThe Officer Down Memorial Page provides the biographies of 69 FBI agents who have died in the line of duty from 1925 to July 2017.\n\nHiring process\n\nTo apply to become an FBI agent, one must be between the ages of 23 and 37. Due to the decision in Robert P. Isabella v. Department of State and Office of Personnel Management, 2008 M.S.P.B. 146, preference-eligible veterans may apply after age 37. In 2009, the Office of Personnel Management issued implementation guidance on the Isabella decision.[http://www.chcoc.gov/Transmittals/TransmittalDetails.aspx?TransmittalID2484 CHCOC]. Chcoc.gov. Retrieved on 2013-07-23. The applicant must also hold U.S. citizenship, be of high moral character, have a clean record, and hold at least a four-year bachelor's degree. At least three years of professional work experience prior to application is also required. All FBI employees require a Top Secret (TS) security clearance, and in many instances, employees need a TS/SCI (Top Secret/Sensitive Compartmented Information) clearance. To obtain a security clearance, all potential FBI personnel must pass a series of Single Scope Background Investigations (SSBI), which are conducted by the Office of Personnel Management. Special agent candidates also have to pass a Physical Fitness Test (PFT), which includes a 300-meter run, one-minute sit-ups, maximum push-ups, and a  run. Personnel must pass a polygraph test with questions including possible drug use. Applicants who fail polygraphs may not gain employment with the FBI.Taylor, Marisa. \"[http://www.mcclatchydc.com/2013/05/20/191539/fbi-turns-away-many-applicants.html#.UfB9eqxfuSo FBI turns away many applicants who fail lie-detector tests].\" The McClatchy Company. May 20, 2013. Retrieved on July 25, 2013. Up until 1975, the FBI had a minimum height requirement of 5 ft.\n\nBOI and FBI directors\n\nFBI Directors are appointed (nominated) by the President of the United States and must be confirmed by the United States Senate to serve a term of office of ten years, subject to resignation or removal by the President at his/her discretion before their term ends . Additional terms are allowed following the same procedure\n\nJ. Edgar Hoover, appointed by President Calvin Coolidge in 1924, was by far the longest-serving director, serving until his death in 1972. In 1968, Congress passed legislation, as part of the Omnibus Crime Control and Safe Streets Act of 1968, requiring Senate confirmation of appointments of future Directors.Omnibus Crime Control and Safe Streets Act , June 19, 1968, , sec.1101 As the incumbent, this legislation did not apply to Hoover. The last FBI Director was James B. Comey, who was appointed in 2013 by President Barack Obama. In 2017 he was fired by President Donald J. Trump.[https://www.theguardian.com/us-news/2017/may/09/james-comey-fbi-fired-donald-trump Trump fires FBI director Comey, raising questions over Russia investigation | US news]. The Guardian. Retrieved on 2017-05-26.\n\nThe FBI director is responsible for the day-to-day operations at the FBI. Along with the Deputy Director, the director makes sure cases and operations are handled correctly. The director also is in charge of making sure the leadership in any one of the FBI field offices is manned with qualified agents. Before the Intelligence Reform and Terrorism Prevention Act was passed in the wake of the September 11 attacks, the FBI director would directly brief the President of the United States on any issues that arise from within the FBI. Since then, the director now reports to the Director of National Intelligence (DNI), who in turn reports to the President.\n\nFirearms\n\nUpon qualification, an FBI special agent is issued a full-size Glock 22 or compact Glock 23 semi-automatic pistol, both of which are chambered in the .40 S&W cartridge. In May 1997, the FBI officially adopted the Glock, in .40 S&W, for general agent use, and first issued it to New Agent Class 98-1 in October 1997. At present, the Glock 23 \"FG&R\" (finger groove and rail; either 3rd generation or \"Gen4\") is the issue sidearm. New agents are issued firearms, on which they must qualify, on successful completion of their training at the FBI Academy. The Glock 26 (subcompact 9mm Parabellum), Glock 23 and Glock 27 (.40 S&W compact and subcompact, respectively) are authorized as secondary weapons. Special agents are also authorized to purchase and qualify with the Glock 21 in .45 ACP.\n\nSpecial agents of the FBI Hostage Rescue Team (HRT) and regional SWAT teams are issued the Springfield Armory Professional Model 1911 pistol in .45 ACP.\n\nIn June 2016, the FBI awarded Glock a contract for new handguns. Unlike the currently issued .40 S&W chambered Glock pistols, the new Glocks will be chambered for 9mm Parabellum. The contract is for the full-size Glock 17M and the compact Glock 19M. The \"M\" means the Glocks have been modified to meet government standards specified by a 2015 government request for proposal.\n\nPublications\n\nThe FBI Law Enforcement Bulletin is published monthly by the FBI Law Enforcement Communication Unit, with articles of interest to state and local law enforcement personnel. First published in 1932 as Fugitives Wanted by Police, the FBI Law Bulletin covers topics including law enforcement technology and issues, such as crime mapping and use of force, as well as recent criminal justice research, and Vi-CAP alerts, on wanted suspects and key cases.\n\nThe FBI also publishes some reports for both law enforcement personnel as well as regular citizens covering topics including law enforcement, terrorism, cybercrime, white-collar crime, violent crime, and statistics. However, the vast majority of federal government publications covering these topics are published by the Office of Justice Programs agencies of the United States Department of Justice, and disseminated through the National Criminal Justice Reference Service.\n\nCrime statistics\n\nIn the 1920s, the FBI began issuing crime reports by gathering numbers from local police departments. Due to limitations of this system found during the 1960s and 1970s—victims often simply did not report crimes to the police in the first place—the Department of Justice developed an alternate method of tallying crime, the victimization survey.\n\nUniform Crime Reports\n\nThe Uniform Crime Reports (UCR) compile data from over 17,000 law enforcement agencies across the country. They provide detailed data regarding the volume of crimes to include arrest, clearance (or closing a case), and law enforcement officer information. The UCR focuses its data collection on violent crimes, hate crimes, and property crimes. Created in the 1920s, the UCR system has not proven to be as uniform as its name implies. The UCR data only reflect the most serious offense in the case of connected crimes and has a very restrictive definition of rape. Since about 93% of the data submitted to the FBI is in this format, the UCR stands out as the publication of choice as most states require law enforcement agencies to submit this data.\n\nPreliminary Annual Uniform Crime Report for 2006 was released on June 4, 2006. The report shows violent crime offenses rose 1.3%, but the number of property crime offenses decreased 2.9% compared to 2005.\n\nNational Incident-Based Reporting System\n\nThe National Incident-Based Reporting System (NIBRS) crime statistics system aims to address limitations inherent in UCR data. The system is used by law enforcement agencies in the United States for collecting and reporting data on crimes. Local, state, and federal agencies generate NIBRS data from their records management systems. Data is collected on every incident and arrest in the Group A offense category. The Group A offenses are 46 specific crimes grouped in 22 offense categories. Specific facts about these offenses are gathered and reported in the NIBRS system. In addition to the Group A offenses, eleven Group B offenses are reported with only the arrest information. The NIBRS system is in greater detail than the summary-based UCR system. As of 2004, 5,271 law enforcement agencies submitted NIBRS data. That amount represents 20% of the United States population and 16% of the crime statistics data collected by the FBI.\n\neGuardian\n\neGuardian is the name of an FBI system, launched in January 2009, to share tips about possible terror threats with local police agencies. The program aims to get law enforcement at all levels sharing data quickly about suspicious activity and people.\n\neGuardian enables near real-time sharing and tracking of terror information and suspicious activities with local, state, tribal, and federal agencies. The eGuardian system is a spin-off of a similar but classified tool called Guardian that has been used inside the FBI, and shared with vetted partners since 2005.\n\nControversies\n\nThroughout its history, the bureau has been the subject of a number of controversial cases, both at home and abroad.\n\nFiles on U.S. citizens\n\nThe FBI has maintained files on numerous people, including celebrities such as Elvis Presley, Frank Sinatra, John Denver, John Lennon, Jane Fonda, Groucho Marx, Charlie Chaplin, the band MC5, Lou Costello, Sonny Bono, Bob Dylan, Michael Jackson, and Mickey Mantle. The files were collected for various reasons. Some of the subjects were investigated for alleged ties to the Communist party (Charlie Chaplin and Groucho Marx), or in connection with antiwar activities during the Vietnam War (John Denver, John Lennon, and Jane Fonda). Numerous celebrity files concern threats or extortion attempts against them (Sonny Bono, John Denver, John Lennon, Elvis Presley, Michael Jackson, Mickey Mantle, Groucho Marx, and Frank Sinatra).\n\nCovert operations on political groups\n\nCOINTELPRO tactics have been alleged to include discrediting targets through psychological warfare; smearing individuals and groups using forged documents and by planting false reports in the media; harassment; wrongful imprisonment; and illegal violence.[http://www.icdc.com/~paulwolf/cointelpro/churchfinalreportIIIc.htm The FBI'S Covert Action Program to Destroy the Black Panther Party] FBI Secrets: An Agent's Expose. M. Wesley Swearingen. Boston. South End Press. 1995. Special Agent Gregg York: \"We expected about twenty Panthers to be in the apartment when the police raided the place. Only two of those black nigger fuckers were killed, Fred Hampton and Mark Clark.\" The FBI's stated motivation was \"protecting national security, preventing violence, and maintaining the existing social and political order.\"\n\nFBI records show that 85% of COINTELPRO resources targeted groups and individuals that the FBI deemed \"subversive\",Jeffreys-Jones, Rhodri. THE FBI, Yale University Press, 2008, p. 189 including communist and socialist organizations; organizations and individuals associated with the Civil Rights Movement, including Martin Luther King, Jr. and others associated with the Southern Christian Leadership Conference, the National Association for the Advancement of Colored People, and the Congress of Racial Equality and other civil rights organizations; black nationalist groups (e.g., Nation of Islam and the Black Panther Party); the American Indian Movement; a broad range of organizations labeled \"New Left\", including Students for a Democratic Society and the Weathermen; almost all groups protesting the Vietnam War, as well as individual student demonstrators with no group affiliation; the National Lawyers Guild; organizations and individuals associated with the women's rights movement; nationalist groups such as those seeking independence for Puerto Rico, United Ireland, and Cuban exile movements including Orlando Bosch's Cuban Power and the Cuban Nationalist Movement. The remaining 15% of COINTELPRO resources were expended to marginalize and subvert white hate groups, including the Ku Klux Klan and the National States' Rights Party.\n\nFiles on Puerto Rican independence advocates\n\nThe FBI also spied upon and collected information on Puerto Rican independence leader Pedro Albizu Campos and his Nationalist political party in the 1930s. Abizu Campos was convicted three times in connection with deadly attacks on US government officials: in 1937 (Conspiracy to overthrow the government of the United States), in 1950 (attempted murder), and in 1954 (after an armed assault on the US House of Representatives while in session; although not present, Abizu Campos was considered the mastermind).American National Biography, [http://www.anb.org/articles/11/11-01225.html Pedro Abizu Campos], accessed 19 Apr. 2015. The FBI operation was covert and did not become known until U.S. Congressman Luis Gutierrez had it made public via the Freedom of Information Act in the 1980s.[https://www.nytimes.com/2003/11/28/nyregion/new-light-on-old-fbi-fight-decades-of-surveillance-of-puerto-rican-groups.html FBI Files on Puerto Ricans.] The New York Times. Retrieved 13 December 2013.\n\nIn the 2000s, researchers obtained files released by the FBI under the Freedom of Information Act revealing that the San Juan FBI office had coordinated with FBI offices in New York, Chicago and other cities, in a decades-long surveillance of Albizu Campos and Puerto Ricans who had contact or communication with him. The documents available are as recent as 1965.\n\nActivities in Latin America\n\nFrom the 1950s to the 1980s, the governments of many Latin American and Caribbean countries, including Argentina, Brazil, Chile, Cuba, Mexico and others were infiltrated by the FBI.[http://www.goodreads.com/book/show/473884.Che_Guevara_and_the_FBI Che Guevara and the FBI: U.S. Political Police Dossier on the Latin American Revolutionary.]\nMichael Ratner. 1997. Retrieved 13 December 2103. These operations began in World War II as 700 agents were assigned to monitor Nazi activity, but soon expanded to monitoring communist activity in places like Ecuador.https://www.dukeupress.edu/the-fbi-in-latin-america \n\nInternal investigations of shootings\n\nDuring the period from 1993 to 2011, FBI agents fired their weapons on 289 occasions; FBI internal reviews found the shots justified in all but 5 cases, in none of the 5 cases were people wounded. Samuel Walker, a professor of criminal justice at the University of Nebraska Omaha said the number of shots found to be unjustified was \"suspiciously low.\" In the same time period, the FBI wounded 150 people, 70 of whom died; the FBI found all 150 shootings to be justified. Likewise, during the period from 2011 to the present, all shootings by FBI agents have been found to be justified by internal investigation. In a 2002 case in Maryland, an innocent man was shot, and later paid $1.3 million by the FBI after agents mistook him for a bank robber; the internal investigation found that the shooting was justified, based on the man's actions.[https://www.nytimes.com/2013/06/19/us/in-150-shootings-the-fbi-deemed-agents-faultless.html \"The F.B.I. Deemed Agents Faultless in 150 Shootings,\"] by Charlie Savage and Michael Schmidt, 18 June 2013, New York Times.\n\nThe Whitey Bulger case\n\nThe FBI has been criticized for its handling of Boston organized crime figure Whitey Bulger.[http://ideas.time.com/2013/08/12/the-fbi-kept-whitey-bulger-free-for-decades/ The Feds Let 'Whitey' Get Away With Murder: FBI agents and other officials protected James \"Whitey\" Bulger as he roamed free for decades. Is there a statute of limitations on corrupting the system?] Mike Barnicle. TIME. 12 August 2013. Retrieved 13 December 2013. Beginning in 1975, Bulger served as an informant for the FBI. As a result, the Bureau largely ignored his organization in exchange for information about the inner workings of the Italian American Patriarca crime family.\n\nIn December 1994, after being tipped off by his former FBI handler about a pending indictment under the Racketeer Influenced and Corrupt Organizations Act, Bulger fled Boston and went into hiding. For 16 years, he remained at large. For 12 of those years, Bulger was prominently listed on the FBI Ten Most Wanted Fugitives list. Beginning in 1997, the New England media exposed criminal actions by federal, state, and local law enforcement officials tied to Bulger. The revelation caused great embarrassment to the FBI.[http://www.npr.org/templates/story/story.php?storyId\n137387296 \"Capture Of Boston Gangster Could Mean More Scandal\"] NPR. In 2002, Special Agent John J Connolly was convicted of federal racketeering charges for helping Bulger avoid arrest. In 2008, Special Agent Connolly completed his term on the federal charges and was transferred to Florida where he was convicted of helping plan the murder of John B Callahan, a Bulger rival. In 2014, that conviction was overturned on a technicality. Connolly was the agent leading the investigation of Bulger.Florida Court Overturns Murder Conviction of FBI Agent, by Timothy Williams, 29 May 2014, New York Times\n\nIn June 2011, the 81-year-old Bulger was arrested in Santa Monica, California.[https://web.archive.org/web/20110626231752/http://losangeles.ibtimes.com/articles/168679/20110623/america-s-most-wanted-fugitive-james-whitey-bulger-caught.htm \"One of America's Top Fugitives James \"Whitey\" Bulger: Caught in Santa Monica\"] International Business Times Bulger was tried on 32 counts of racketeering, money laundering, extortion, and weapons charges; including complicity in 19 murders. In August 2013, the jury found him guilty on 31 counts, and having been involved in 11 murders. Bulger was sentenced to two consecutive life terms plus five years.\n\nRobert Hanssen\n\nOn 20 February 2001, the bureau announced that a special agent, Robert Hanssen (born 1944) had been arrested for spying for the Soviet Union and then Russia from 1979 to 2001. He is serving 15 consecutive life sentences without the possibility of parole at ADX Florence, a federal supermax prison near Florence, Colorado. Hanssen was arrested on February 18, 2001, at Foxstone ParkAdrian Havill, crimelibrary.com. [http://www.crimelibrary.com/terrorists_spies/spies/hanssen/2.html His fate is sealed] . Retrieved September 10, 2007 near his home in Vienna, Virginia, and was charged with selling US secrets to the USSR and subsequently Russia for more than US$1.4 million in cash and diamonds over a 22-year period. On July 6, 2001, he pleaded guilty to 15 counts of espionage in the United States District Court for the Eastern District of Virginia.[http://cryptome.org/usa-v-rph-gp.htm Transcript of Hanssen Guilty Plea], July 6, 2001. Retrieved February 22, 2007.United States Department of Justice [http://www.usdoj.gov/opa/pr/2001/July/308ag.htm Thompson Statement Regarding Hanssen Guilty Plea] July 6, 2001. Retrieved February 22, 2007. His spying activities have been described by the US Department of Justice's Commission for the Review of FBI Security Programs as \"possibly the worst intelligence disaster in U.S. history\".\"[https://fas.org/irp/agency/doj/fbi/websterreport.html A Review of FBI Security Programs] (Webster Report) (March 2002). Commission for Review of FBI Security Programs, United States Department of Justice.\n\nDeath of Filiberto Ojeda Rios\n\nIn 2005, fugitive Puerto Rican Nationalist leader Filiberto Ojeda Ríos died in a gun battle with FBI agents that some charged was an assassination. Puerto Rico Governor Aníbal Acevedo Vilá criticized the FBI assault as \"improper\" and \"highly irregular\" and demanded to know why his government was not informed of it. The FBI refused to release information beyond the official press release, citing security and agent privacy issues. The Puerto Rico Justice Department filed suit in federal court against the FBI and the US Attorney General, demanding information crucial to the Commonwealth's own investigation of the incident. The case was dismissed by the U.S Supreme Court. Ojeda Rios' funeral was attended by a long list of dignitaries, including the highest authority of the Roman Catholic Church in Puerto Rico, Archbishop Roberto Octavio González Nieves, ex-Governor Rafael Hernández Colón, and numerous other personalities.[http://www.latinamericanstudies.org/ojeda-1.htm Funeral Service for Filiberto Ojeda Ríos] Retrieved July 20, 2009.\n\nIn the aftermath of his death, the United Nations Special Committee on Decolonization approved a draft resolution urging a \"probe of [the] pro-independence killing, human rights abuses\", after \"Petitioner after petitioner condemned the assassination of Mr. Ojeda Rios by agents of the Federal Bureau of Investigation (FBI)\".\n\nAssociated Press impersonation case\n\nIn 2007, an agent working in Seattle, Washington for the FBI falsely impersonated an Associated Press (AP) journalist and unwittingly infected a 15-year-old suspect's computer with a malicious surveillance software. The incident sparked a strongly-worded statement from the AP demanding the bureau from ever impersonating a member of the news media again. Moreover, in September 2016, the incident resulted in a condemnation by the Justice Department.\n\nIn December 2017, following a US court appearance, a judge ruled in favor of the AP in a lawsuit against the FBI for frauduently impersonating a member of the news media.\n\nWikipedia edits\n\nIn August 2007 Virgil Griffith, a Caltech computation and neural-systems graduate student, created WikiScanner, a searchable database that linked changes made by anonymous Wikipedia editors to companies and organizations from which the changes were made. The database cross-referenced logs of Wikipedia edits with publicly available records pertaining to the Internet IP addresses edits were made from. Griffith was motivated by the edits from the United States Congress, and wanted to see if others were similarly promoting themselves. The tool was designed to detect conflict of interest edits. Among his findings were that FBI computers were used to edit the FBI article on Wikipedia. Although the edits correlated with known FBI IP addresses, there was no proof that the changes actually came from a member or employee of the FBI, only that someone who had access to their network had edited the FBI article on Wikipedia. Wikipedia spokespersons received Griffith's \"WikiScanner\" positively, noting that it helped prevent conflicts of interest from influencing articles as well as increasing transparency and mitigating attempts to remove or distort relevant facts.\n\nHillary Clinton email investigation\n\nOn July 5, 2016, FBI Director Comey announced the bureau's recommendation that the United States Department of Justice file no criminal charges relating to the Hillary Clinton email controversy.  During an unusual 15 minute press conference in the J. Edgar Hoover Building, Comey called Secretary Clinton's and her top aides' behavior \"extremely careless\", but concluded that \"no reasonable prosecutor would bring such a case\".  On October 28, 2016, less than two weeks before the presidential election, Director Comey, a long-time Republican, announced in a letter to Congress that additional emails potentially related to the Clinton email controversy had been found and that the FBI will investigate \"to determine whether they contain classified information as well as to assess their importance to our investigation.\" At the time Comey sent his letter to Congress, the FBI had still not obtained a warrant to review any of the e-mails in question and was not aware of the content of any of the e-mails in question. After Comey's letter to Congress, commentator Paul Callan of CNN and Niall O'Dowd of Irish Central compared Comey to J. Edgar Hoover in attempting to influence and manipulate elections. On November 6, 2016, in the face of constant pressure from both Republicans and Democrats, Comey conceded in a second letter to Congress that through the FBI's review of the new e-mails, there was no wrongdoing by Clinton. On November 12, 2016, unsuccessful presidential candidate Hillary Clinton directly attributed her election loss to FBI Director James Comey.\"[http://www.telegraph.co.uk/news/2016/11/12/hillary-clinton-blames-election-loss-on-fbis-james-comey-in-call/ US election: Hillary Clinton blames loss on FBI's James Comey in call with top donors]\" \n\n2017 dismissal of Director Comey\n\nOn May 9, 2017, President Trump dismissed FBI Director Comey after Comey had misstated several key findings of the email investigation in his testimony to the Senate Judiciary Committee. Some question whether the dismissal was in response to Comey's request for more resources to expand the probe into Russian interference into the Presidential election. Following Comey's dismissal, Deputy Director Andrew G. McCabe became Acting Director.New York Times, May 9, 2017, [https://www.nytimes.com/2017/05/09/us/politics/james-comey-fired-fbi.html F.B.I. Director James Comey Is Fired by Trump] On August 1, 2017, President Trump's nominee for FBI director Christopher A. Wray was officially confirmed by the Senate in a 92–5 vote and was sworn in as Director the next day.\n\nThe Nunes memo\n\nOn February 2, 2018, a four-page confidential memo by Republican House Intelligence Committee chairman Devin Nunes, was released after being signed by President Trump. According to the memo, a dossier by Christopher Steele and opposition research firm Fusion GPS, was utilized by DOJ and FBI officials for FISA warrants to surveil Trump's campaign member Carter Page. Additionally, former FBI Deputy Director Andrew McCabe, who resigned before the release of the memo, stated that the FISA warrant wouldn't have been obtained without the information in the Steele dossier. All four FISA applications were signed by McCabe, Rod Rosenstein, and former FBI Director James Comey. President Trump commented on the release of the memo, saying: \"A lot of people should be ashamed.\"\n\nFlorida school shooting\n\nOn February 16, 2018, two days after the Stoneman Douglas High School shooting, the FBI released a statement detailing information the organization's Public Access Line had received a month prior, on January 5, from a person close to Nikolas Cruz, the suspected shooter. According to the statement, \"The caller provided information about Cruz's gun ownership, desire to kill people, erratic behavior, and disturbing social media posts, as well as the potential of him conducting a school shooting.\" After conducting an investigation, the FBI reported that it had not followed protocol when the tip was not forwarded to the Miami Field Office, where further investigative steps would have been taken.\n\nMedia portrayal\n\nThe FBI has been frequently depicted in popular media since the 1930s. The bureau has participated to varying degrees, which has ranged from direct involvement in the creative process of film or TV series development, to providing consultation on operations and closed cases. A few of the notable portrayals of the FBI on television are the 1993–2002 series The X-Files, which concerned investigations into paranormal phenomena by five fictional Special Agents, and the fictional Counter Terrorist Unit (CTU) agency in the TV drama 24, which is patterned after the FBI Counterterrorism Division. The 1991 movie Point Break is based on the true story of an undercover FBI agent who infiltrated a gang of bank robbers. The 1997 movie Donnie Brasco is based on the true story of undercover FBI agent Joseph D. Pistone infiltrating the Mafia. The 2015 TV series Quantico, titled after the location of the Bureau's training facility, deals with Probationary and Special Agents, not all of whom, within the show's format, may be fully reliable or even trustworthy.\n\nNotable FBI personnel\n\n* Edwin Atherton\n* Ed Bethune\n* Alaska P. Davidson\n* Sibel Edmonds\n* James R. Fitzgerald\n* W. Mark Felt\n* J. Edgar Hoover\n* Robert Hanssen\n* Lon Horiuchi\n* Richard Miller\n* Robert Mueller\n* Eric O'Neill\n* John P. O'Neill\n* Joseph D. Pistone\n* Melvin Purvis\n* Coleen Rowley\n* Ali Soufan\n* Sue Thomas\n* Clyde Tolson\n* Loy F. Weaver\n* Frederic Whitehurst",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Federal Bureau of Investigation" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11127" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Federal Bureau of Investigation (FBI), formerly the Bureau of Investigation (BOI),  is the domestic intelligence and security service of the United States, and its principal federal law enforcement agency. Operating under the jurisdiction of the US Department of Justice, the FBI is also a member of the U.S. Intelligence Community and reports to both the Attorney General and the Director of National Intelligence. A leading U.S. counter-terrorism, counterintelligence, and criminal investigative organization, the FBI has jurisdiction over violations of more than 200 categories of federal crimes.\n\nAlthough many of the FBI's functions are unique, its activities in support of national security are comparable to those of the British MI5 and the Russian FSB. Unlike the Central Intelligence Agency (CIA), which has no law enforcement authority and is focused on intelligence collection abroad, the FBI is primarily a domestic agency, maintaining 56 field offices in major cities throughout the United States, and more than 400 resident agencies in lesser cities and areas across the nation. At an FBI field office, a senior-level FBI officer concurrently serves as the representative of the Director of National Intelligence.[https://www.fbi.gov/news/testimony/fbi-budget-request-for-fiscal-year-2015 Statement Before the House Appropriations Committee, Subcommittee on Commerce, Justice, Science, and Related Agencies], Federal Bureau of Investigation, March 26, 2014[https://www.washingtonpost.com/world/national-security/fbi-gets-a-broader-role-in-coordinating-domestic-intelligence-activities/2012/06/19/gJQAtmupoV_story.html FBI gets a broader role in coordinating domestic intelligence activities], Washington Post, June 19, 2012\n\nDespite its domestic focus, the FBI also maintains a significant international footprint, operating 60 Legal Attache (LEGAT) offices and 15 sub-offices in US embassies and consulates across the globe. These foreign offices exist primarily for the purpose of coordination with foreign security services and do not usually conduct unilateral operations in the host countries.[https://www.fbi.gov/about-us/international_operations/overview Overview of the Legal Attaché Program] , Federal Bureau of Investigation, Retrieved: March 25, 2015 The FBI can and does at times carry out secret activities overseas,[http://www.nbcnews.com/id/6973534/ns/us_news-security/t/spies-clash-fbi-joins-cia-overseas/#.VTKrN5OATz4 Spies Clash as FBI Joins CIA Overseas: Sources Talk of Communication Problem in Terrorism Role], Associated Press via NBC News, February 15, 2005 just as the CIA has a limited domestic function; these activities generally require coordination across government agencies.\n\nThe FBI was established in 1908 as the Bureau of Investigation, the BOI or BI for short. Its name was changed to the Federal Bureau of Investigation (FBI) in 1935. The FBI headquarters is the J. Edgar Hoover Building, located in Washington, D.C.\n\nBudget, mission, and priorities\n\nIn the fiscal year 2016, the Bureau's total budget was approximately $8.7 billion.\n\nThe FBI's main goal is to protect and defend the United States, to uphold and enforce the criminal laws of the United States, and to provide leadership and criminal justice services to federal, state, municipal, and international agencies and partners.\n\nCurrently, the FBI's top priorities are:\n\n# Protect the United States from terrorist attacks,\n# Protect the United States against foreign intelligence operations and espionage,\n# Protect the United States against cyber-based attacks and high-technology crimes,\n# Combat public corruption at all levels,\n# Protect civil rights,\n# Combat transnational/national criminal organizations and enterprises,\n# Combat major white-collar crime,\n# Combat significant violent crime,\n# Support federal, state, local and international partners, and\n# Upgrade technology to enable, and further, the successful performances of its missions as stated above.\n\nHistory\n\nBackground\n\nIn 1896, the National Bureau of Criminal Identification was founded, which provided agencies across the country with information to identify known criminals. The 1901 assassination of President William McKinley created a perception that America was under threat from anarchists. The Departments of Justice and Labor had been keeping records on anarchists for years, but President Theodore Roosevelt wanted more power to monitor them.\n\nThe Justice Department had been tasked with the regulation of interstate commerce since 1887, though it lacked the staff to do so. It had made little effort to relieve its staff shortage until the Oregon land fraud scandal at the turn of the 20th Century. President Roosevelt instructed Attorney General Charles Bonaparte to organize an autonomous investigative service that would report only to the Attorney General.\n\nBonaparte reached out to other agencies, including the U.S. Secret Service, for personnel, investigators in particular. On May 27, 1908, the Congress forbade this use of Treasury employees by the Justice Department, citing fears that the new agency would serve as a secret police department. Again at Roosevelt's urging, Bonaparte moved to organize a formal Bureau of Investigation, which would then have its own staff of special agents.\n\nCreation\n\nThe Bureau of Investigation (BOI) was created on July 26, 1908, after the Congress had adjourned for the summer. Attorney General Bonaparte, using Department of Justice expense funds, hired thirty-four people, including some veterans of the Secret Service, to work for a new investigative agency. Its first \"Chief\" (the title is now known as \"Director\") was Stanley Finch. Bonaparte notified the Congress of these actions in December 1908.\n\nThe bureau's first official task was visiting and making surveys of the houses of prostitution in preparation for enforcing the \"White Slave Traffic Act,\" or Mann Act, passed on June 25, 1910. In 1932, the bureau was renamed the United States Bureau of Investigation. The following year it was linked to the Bureau of Prohibition and rechristened the Division of Investigation (DOI) before finally becoming an independent service within the Department of Justice in 1935. In the same year, its name was officially changed from the Division of Investigation to the present-day Federal Bureau of Investigation, or FBI.\n\nJ. Edgar Hoover as FBI Director\n\nJ. Edgar Hoover served as FBI Director from 1924 to 1972, a combined 48 years with the BOI, DOI, and FBI. He was chiefly responsible for creating the Scientific Crime Detection Laboratory, or the FBI Laboratory, which officially opened in 1932, as part of his work to professionalize investigations by the government. Hoover was substantially involved in most major cases and projects that the FBI handled during his tenure. But as detailed below, his proved to be a highly controversial tenure as Bureau Director, especially in its later years. After Hoover's death, the Congress passed legislation that limited the tenure of future FBI Directors to ten years.\n\nEarly homicide investigations of the new agency included the Osage Indian murders.  During the \"War on Crime\" of the 1930s, FBI agents apprehended or killed a number of notorious criminals who carried out kidnappings, robberies, and murders throughout the nation, including John Dillinger, \"Baby Face\" Nelson, Kate \"Ma\" Barker, Alvin \"Creepy\" Karpis, and George \"Machine Gun\" Kelly.\n\nOther activities of its early decades included a decisive role in reducing the scope and influence of the Ku Klux Klan. Additionally, through the work of Edwin Atherton, the BOI claimed success in apprehending an entire army of Mexican neo-revolutionaries under the leadership of General Enrique Estrada in the mid-1920s, east of San Diego, California.\n\nHoover began using wiretapping in the 1920s during Prohibition to arrest bootleggers. In the 1927 case Olmstead v. United States, in which a bootlegger was caught through telephone tapping, the United States Supreme Court ruled that FBI wiretaps did not violate the Fourth Amendment as unlawful search and seizure, as long as the FBI did not break into a person's home to complete the tapping. After Prohibition's repeal, Congress passed the Communications Act of 1934, which outlawed non-consensual phone tapping, but did allow bugging. In the 1939 case Nardone v. United States, the court ruled that due to the 1934 law, evidence the FBI obtained by phone tapping was inadmissible in court. After the 1967 case Katz v. United States overturned the 1927 case that had allowed bugging, Congress passed the Omnibus Crime Control Act, allowing public authorities to tap telephones during investigations, as long as they obtained warrants beforehand.\n\nNational security\n\nBeginning in the 1940s and continuing into the 1970s, the bureau investigated cases of espionage against the United States and its allies. Eight Nazi agents who had planned sabotage operations against American targets were arrested, and six were executed (Ex parte Quirin) under their sentences. Also during this time, a joint US/UK code-breaking effort called \"The Venona Project\"—with which the FBI was heavily involved—broke Soviet diplomatic and intelligence communications codes, allowing the US and British governments to read Soviet communications. This effort confirmed the existence of Americans working in the United States for Soviet intelligence. Hoover was administering this project, but he failed to notify the Central Intelligence Agency (CIA) of it until 1952. Another notable case was the arrest of Soviet spy Rudolf Abel in 1957. The discovery of Soviet spies operating in the US allowed Hoover to pursue his longstanding obsession with the threat he perceived from the American Left, ranging from Communist Party of the United States of America (CPUSA) union organizers to American liberals.\n\nJapanese American internment\n\nIn 1939, the Bureau began compiling a custodial detention list with the names of those who would be taken into custody in the event of war with Axis nations. The majority of the names on the list belonged to Issei community leaders, as the FBI investigation built on an existing Naval Intelligence index that had focused on Japanese Americans in Hawaii and the West Coast, but many German and Italian nationals also found their way onto the secret list. Robert Shivers, head of the Honolulu office, obtained permission from Hoover to start detaining those on the list on December 7, 1941, while bombs were still falling over Pearl Harbor. Mass arrests and searches of homes (in most cases conducted without warrants) began a few hours after the attack, and over the next several weeks more than 5,500 Issei men were taken into FBI custody. On February 19, 1942, President Franklin Roosevelt issued Executive Order 9066, authorizing the removal of Japanese Americans from the West Coast. FBI Director Hoover opposed the subsequent mass removal and confinement of Japanese Americans authorized under Executive Order 9066, but Roosevelt prevailed. The vast majority went along with the subsequent exclusion orders, but in a handful of cases where Japanese Americans refused to obey the new military regulations, FBI agents handled their arrests. The Bureau continued surveillance on Japanese Americans throughout the war, conducting background checks on applicants for resettlement outside camp, and entering the camps (usually without the permission of War Relocation Authority officials) and grooming informants to monitor dissidents and \"troublemakers.\" After the war, the FBI was assigned to protect returning Japanese Americans from attacks by hostile white communities.\n\nSex Deviates Program\n\nAccording to Douglas M. Charles, the FBI's Sex Deviates Program began on April 10, 1950 when J. Edgar Hoover forwarded the White House, U.S. Civil Service Commission, and branches of the armed services a list of 393 alleged federal employees who were allegedly arrested in Washington D.C., since 1947, on charges of \"sexual irregularities\". On June 20, 1951, Hoover expands the program by issuing a memo establishing a \"uniform policy for the handling of the increasing number of reports and allegations concerning present and past employees of the United State Government who assertedly [sic] are sex deviates.\" The program was expanded to include non-government jobs. According to Athan Theoharis, \"In 1951 he [Hoover] had unilaterally instituted a Sex Deviates program to purge alleged homosexuals from any position in the federal government, from the lowliest clerk to the more powerful position of White house aide.\" On May 27, 1953, Executive Order 10450 goes into effect. The program is expanded further by this executive order by making all federal employment of homosexuals illegal. On July 8, 1953, the FBI forwarded to the U.S. Civil Service Commission information from the Sex Deviates Program. In 1977–1978, 300,000 pages, collected between 1930 to the mid-1970s, in the Sex Deviate Program were destroyed by FBI officals.[http://outhistory.org/exhibits/show/fbi-history/1950-1959 FBI and Homosexuality: 1950-1959][http://outhistory.org/exhibits/show/fbi-history/1970-1979 FBI and Homosexuality: 1970-1979 ][http://outhistory.org/exhibits/show/fbi-history/2010-2019 FBI and Homosexuality: 2010-2019]\n\nCivil Rights Movement\n\nDuring the 1950s and 1960s, FBI officials became increasingly concerned about the influence of civil rights leaders, whom they believed either had communist ties or were unduly influenced by communists or \"fellow travellers.\" In 1956, for example, Hoover sent an open letter denouncing Dr. T.R.M. Howard, a civil rights leader, surgeon, and wealthy entrepreneur in Mississippi who had criticized FBI inaction in solving recent murders of George W. Lee, Emmett Till, and other blacks in the South.David T. Beito and Linda Royster Beito, Black Maverick: T.R.M. Howard's Fight for Civil Rights and Economic Power (Urbana: University of Illinois Press, 2009), 148, 154–59. The FBI carried out controversial domestic surveillance in an operation it called the COINTELPRO, a portmanteau derived from \"COunter-INTELligence PROgram.\" It was to investigate and disrupt the activities of dissident political organizations within the United States, including both militant and non-violent organizations. Among its targets was the Southern Christian Leadership Conference, a leading civil rights organization whose clergy leadership included the Rev. Dr. Martin Luther King, Jr., who is addressed in more detail below.\n\nThe FBI frequently investigated Martin Luther King, Jr. In the mid-1960s, King began publicly criticizing the Bureau for giving insufficient attention to the use of terrorism by white supremacists. Hoover responded by publicly calling King the most \"notorious liar\" in the United States.Taylor Branch, Pillar of Fire: America in the King Years 1963-1965 (Simon and Shuster, 1999), p. 524-529 In his 1991 memoir, Washington Post journalist Carl Rowan asserted that the FBI had sent at least one anonymous letter to King encouraging him to commit suicide. Historian Taylor Branch documents an anonymous November 1964 \"suicide package\" sent by the Bureau that combined a letter to the civil rights leader telling him \"You are done. There is only one way out for you...\" with audio recordings of King's sexual indiscretions.\n\nIn March 1971, the residential office of an FBI agent in Media, Pennsylvania was burgled by a group calling itself the Citizens' Commission to Investigate the FBI. Numerous files were taken and distributed to a range of newspapers, including The Harvard Crimson. The files detailed the FBI's extensive COINTELPRO program, which included investigations into lives of ordinary citizens—including a black student group at a Pennsylvania military college and the daughter of Congressman Henry Reuss of Wisconsin. The country was \"jolted\" by the revelations, which included assassinations of political activists, and the actions were denounced by members of the Congress, including House Majority Leader Hale Boggs. The phones of some members of the Congress, including Boggs, had allegedly been tapped.\n\nKennedy's assassination\n\nWhen President John F. Kennedy was shot and killed, the jurisdiction fell to the local police departments until President Lyndon B. Johnson directed the FBI to take over the investigation. To ensure clarity about the responsibility for investigation of homicides of federal officials, the Congress passed a law that included investigations of such deaths of federal officials, especially by homicide, within FBI jurisdiction. This new law was passed in 1965.\n\nOrganized crime\n\nIn response to organized crime, on August 25, 1953, the FBI created the Top Hoodlum Program. The national office directed field offices to gather information on mobsters in their territories and to report it regularly to Washington for a centralized collection of intelligence on racketeers.[https://www.fbi.gov/page2/august07/mobintel080907.htm \"Using Intel to Stop the Mob, Part 2\"] . Retrieved 2010-02-12. After the Racketeer Influenced and Corrupt Organizations Act, or RICO Act, took effect, the FBI began investigating the former Prohibition-organized groups, which had become fronts for crime in major cities and small towns. All of the FBI work was done undercover and from within these organizations, using the provisions provided in the RICO Act. Gradually the agency dismantled many of the groups. Although Hoover initially denied the existence of a National Crime Syndicate in the United States, the Bureau later conducted operations against known organized crime syndicates and families, including those headed by Sam Giancana and John Gotti. The RICO Act is still used today for all organized crime and any individuals who may fall under the Act's provisions.\n\nIn 2003 a congressional committee called the FBI's organized crime informant program \"one of the greatest failures in the history of federal law enforcement.\" The FBI allowed four innocent men to be convicted of the March 1965 gangland murder of Edward \"Teddy\" Deegan in order to protect Vincent Flemmi, an FBI informant. Three of the men were sentenced to death (which was later reduced to life in prison), and the fourth defendant was sentenced to life in prison.\n Two of the four men died in prison after serving almost 30 years, and two others were released after serving 32 and 36 years. In July 2007, U.S. District Judge Nancy Gertner in Boston found that the Bureau had helped convict the four men using false witness accounts given by mobster Joseph Barboza. The U.S. Government was ordered to pay $100 million in damages to the four defendants.\n\nSpecial FBI teams\n\nIn 1982, the FBI formed an elite unit to help with problems that might arise at the 1984 Summer Olympics to be held in Los Angeles, particularly terrorism and major-crime. This was a result of the 1972 Summer Olympics in Munich, Germany, when terrorists murdered the Israeli athletes. Named the Hostage Rescue Team, or HRT, it acts as the FBI lead for a national SWAT team in related procedures and all counter-terrorism cases. Also formed in 1984 was the Computer Analysis and Response Team, or CART.\n\nFrom the end of the 1980s to the early 1990s, the FBI reassigned more than 300 agents from foreign counter-intelligence duties to violent crime, and made violent crime the sixth national priority. With reduced cuts to other well-established departments, and because terrorism was no longer considered a threat after the end of the Cold War, the FBI assisted local and state police forces in tracking fugitives who had crossed state lines, which is a federal offense. The FBI Laboratory helped develop DNA testing, continuing its pioneering role in identification that began with its fingerprinting system in 1924.\n\nNotable efforts in the 1990s\n\nBetween 1993 and 1996, the FBI increased its counter-terrorism role in the wake of the first 1993 World Trade Center bombing in New York City, New York; the 1995 Oklahoma City bombing in Oklahoma City, Oklahoma; and the arrest of the Unabomber in 1996. Technological innovation and the skills of FBI Laboratory analysts helped ensure that the three cases were successfully prosecuted. But Justice Department investigations into the FBI's roles in the Ruby Ridge and Waco incidents were found to have been obstructed by agents within the Bureau. During the 1996 Summer Olympics in Atlanta, Georgia, the FBI was criticized for its investigation of the Centennial Olympic Park bombing. It has settled a dispute with Richard Jewell, who was a private security guard at the venue, along with some media organizations, in regard to the leaking of his name during the investigation; this had briefly led to his being wrongly suspected of the bombing.\n\nAfter Congress passed the Communications Assistance for Law Enforcement Act (CALEA, 1994), the Health Insurance Portability and Accountability Act (HIPAA, 1996), and the Economic Espionage Act (EEA, 1996), the FBI followed suit and underwent a technological upgrade in 1998, just as it did with its CART team in 1991. Computer Investigations and Infrastructure Threat Assessment Center (CITAC) and the National Infrastructure Protection Center (NIPC) were created to deal with the increase in Internet-related problems, such as computer viruses, worms, and other malicious programs that threatened US operations. With these developments, the FBI increased its electronic surveillance in public safety and national security investigations, adapting to the telecommunications advancements that changed the nature of such problems.\n\nSeptember 11 attacks\n\nDuring the September 11, 2001, attacks on the World Trade Center, FBI agent Leonard W. Hatton Jr. was killed during the rescue effort while helping the rescue personnel evacuate the occupants of the South Tower, and he stayed when it collapsed. Within months after the attacks, FBI Director Robert Mueller, who had been sworn in a week before the attacks, called for a re-engineering of FBI structure and operations. He made countering every federal crime a top priority, including the prevention of terrorism, countering foreign intelligence operations, addressing cyber security threats, other high-tech crimes, protecting civil rights, combating public corruption, organized crime, white-collar crime, and major acts of violent crime.\n\nIn February 2001, Robert Hanssen was caught selling information to the Russian government. It was later learned that Hanssen, who had reached a high position within the FBI, had been selling intelligence since as early as 1979. He pleaded guilty to treason and received a life sentence in 2002, but the incident led many to question the security practices employed by the FBI. There was also a claim that Hanssen might have contributed information that led to the September 11, 2001 attacks.\n\nThe 9/11 Commission's final report on July 22, 2004, stated that the FBI and Central Intelligence Agency (CIA) were both partially to blame for not pursuing intelligence reports that could have prevented the September 11, 2001, attacks. In its most damning assessment, the report concluded that the country had \"not been well served\" by either agency and listed numerous recommendations for changes within the FBI. While the FBI did accede to most of the recommendations, including oversight by the new Director of National Intelligence, some former members of the 9/11 Commission publicly criticized the FBI in October 2005, claiming it was resisting any meaningful changes.\n\nOn July 8, 2007, The Washington Post published excerpts from UCLA Professor Amy Zegart's book Spying Blind: The CIA, the FBI, and the Origins of 9/11. The Post reported, from Zegart's book, that government documents showed that both the CIA and the FBI had missed 23 potential chances to disrupt the terrorist attacks of September 11, 2001. The primary reasons for the failures included: agency cultures resistant to change and new ideas; inappropriate incentives for promotion; and a lack of cooperation between the FBI, CIA and the rest of the United States Intelligence Community. The book blamed the FBI's decentralized structure, which prevented effective communication and cooperation among different FBI offices. The book suggested that the FBI had not evolved into an effective counter-terrorism or counter-intelligence agency, due in large part to deeply ingrained agency cultural resistance to change. For example, FBI personnel practices continued to treat all staff other than special agents as support staff, classifying intelligence analysts alongside the FBI's auto mechanics and janitors.\n\nFaulty bullet analysis\n\nFor over 40 years, the FBI crime lab in Quantico had believed that lead alloys used in bullets had unique chemical signatures. It was analyzing the bullets with the goal of matching them chemically, not only to a single batch of ammunition coming out of a factory, but also to a single box of bullets. The National Academy of Sciences conducted an 18-month independent review of comparative bullet-lead analysis. In 2003, its National Research Council published a report whose conclusions called into question 30 years of FBI testimony. It found the analytic model used by the FBI for interpreting results was deeply flawed, and the conclusion, that bullet fragments could be matched to a box of ammunition, was so overstated that it was misleading under the rules of evidence. One year later, the FBI decided to stop conducting bullet lead analyses.\n\nAfter a 60 Minutes/Washington Post investigation in November 2007, two years later, the Bureau agreed to identify, review, and release all pertinent cases, and notify prosecutors about cases in which faulty testimony was given.\n\nOrganization\n\nOrganizational structure\n\nThe FBI is organized into functional branches and the Office of the Director, which contains most administrative offices. An executive assistant director manages each branch. Each branch is then divided into offices and divisions, each headed by an assistant director. The various divisions are further divided into sub-branches, led by deputy assistant directors. Within these sub-branches there are various sections headed by section chiefs. Section chiefs are ranked analogous to special agents in charge.\n\nFour of the branches report to the deputy director while two report to the associate director. The functions branches of the FBI are:\n* FBI Intelligence Branch\n* FBI National Security Branch\n* FBI Criminal, Cyber, Response, and Services Branch\n* FBI Science and Technology Branch\n* FBI Information and Technology Branch\n* FBI Human Resources Branch\n\nThe Office of the Director serves as the central administrative organ of the FBI. The office provides staff support functions (such as finance and facilities management) to the five function branches and the various field divisions. The office is managed by the FBI associate director, who also oversees the operations of both the Information and Technology and Human Resources Branches.\n* Office of the Director\n** Immediate Office of the Director\n** Office of the Deputy Director\n** Office of the Associate Director\n** Office of Congressional Affairs\n** Office of Equal Employment Opportunity Affairs\n** Office of the General Counsel\n** Office of Integrity and Compliance\n** Office of the Ombudsman\n** Office of Professional Responsibility\n** Office of Public Affairs\n** Inspection Division\n** Facilities and Logistics Services Division\n** Finance Division\n** Records Management Division\n** Resource Planning Office\n** Security Division\n\nRank structure\n\nThe following is a listing of the rank structure found within the FBI (in ascending order):\n* Field Agents\n** New Agent Trainee\n** Special Agent\n** Senior Special Agent\n** Supervisory Special Agent\n** Assistant Special Agent-in-Charge (ASAC)\n** Special Agent-in-Charge (SAC)\n* FBI Management\n** Deputy Assistant Director\n** Assistant Director\n** Associate Executive Assistant Director\n** Executive Assistant Director\n** Associate Deputy Director\n** Deputy Chief of Staff\n** Chief of Staff and Special Counsel to the Director\n** Deputy Director\n** Director\n\nLegal authority\n\nThe FBI's mandate is established in Title 28 of the United States Code (U.S. Code), Section 533, which authorizes the Attorney General to \"appoint officials to detect and prosecute crimes against the United States.\" Other federal statutes give the FBI the authority and responsibility to investigate specific crimes.\n\nThe FBI's chief tool against organized crime is the Racketeer Influenced and Corrupt Organizations (RICO) Act. The FBI is also charged with the responsibility of enforcing compliance of the United States Civil Rights Act of 1964 and investigating violations of the act in addition to prosecuting such violations with the United States Department of Justice (DOJ). The FBI also shares concurrent jurisdiction with the Drug Enforcement Administration (DEA) in the enforcement of the Controlled Substances Act of 1970.\n\nThe USA PATRIOT Act increased the powers allotted to the FBI, especially in wiretapping and monitoring of Internet activity. One of the most controversial provisions of the act is the so-called sneak and peek provision, granting the FBI powers to search a house while the residents are away, and not requiring them to notify the residents for several weeks afterwards. Under the PATRIOT Act's provisions, the FBI also resumed inquiring into the library records of those who are suspected of terrorism (something it had supposedly not done since the 1970s).\n\nIn the early 1980s, Senate hearings were held to examine FBI undercover operations in the wake of the Abscam controversy, which had allegations of entrapment of elected officials. As a result, in following years a number of guidelines were issued to constrain FBI activities.\n\nA March 2007 report by the inspector general of the Justice Department described the FBI's \"widespread and serious misuse\" of national security letters, a form of administrative subpoena used to demand records and data pertaining to individuals. The report said that between 2003 and 2005, the FBI had issued more than 140,000 national security letters, many involving people with no obvious connections to terrorism.\n\nInformation obtained through an FBI investigation is presented to the appropriate U.S. Attorney or Department of Justice official, who decides if prosecution or other action is warranted.\n\nThe FBI often works in conjunction with other federal agencies, including the U.S. Coast Guard (USCG) and U.S. Customs and Border Protection (CBP) in seaport and airport security, and the National Transportation Safety Board in investigating airplane crashes and other critical incidents. Immigration and Customs Enforcement Homeland Security Investigations (ICE-HSI) has nearly the same amount of investigative manpower as the FBI, and investigates the largest range of crimes. In the wake of the September 11 attacks, then-Attorney General Ashcroft assigned the FBI as the designated lead organization in terrorism investigations after the creation of the U.S. Department of Homeland Security. ICE-HSI and the FBI are both integral members of the Joint Terrorism Task Force.\n\nIndian reservations\n\nThe federal government has the primary responsibility for investigating[https://www.fbi.gov/hq/cid/indian/background.htm \"Indian Country Crime\"]  FBI website, accessed August 10, 2010 and prosecuting serious crime on Indian reservations.\n\nThe FBI does not specifically list crimes in Native American land as one of its priorities.[https://www.fbi.gov/priorities/priorities.htm FBI \"Facts and Figures\"]  See prominently displayed list of priorities, accessed August 10, 2010  Often serious crimes have been either poorly investigated or prosecution has been declined. Tribal courts can impose sentences of up to three years, under certain restrictions.[http://www.denverpost.com/frontpage/ci_15373276? Michael Riley, \"Expansion of tribal courts' authority passes Senate\"]  , The Denver Post Posted: 25 June 2010 01:00:00 am MDT Updated: 25 June 2010 02:13:47 am MDT Accessed June 25, 2010[http://www.denverpost.com/ci_15636761 Michael Riley, \"President Obama signs tribal-justice changes\"] , The Denver Post, Posted: 30 July 2010 01:00:00 am MDT, Updated: 30 July 2010 06:00:20 am MDT, accessed July 30, 2010\n\nInfrastructure\n\nThe FBI is headquartered at the J. Edgar Hoover Building in Washington, D.C., with 56 field offices in major cities across the United States. The FBI also maintains over 400 resident agencies across the United States, as well as over 50 legal attachés at United States embassies and consulates. Many specialized FBI functions are located at facilities in Quantico, Virginia, as well as a \"data campus\" in Clarksburg, West Virginia, where 96 million sets of fingerprints \"from across the United States are stored, along with others collected by American authorities from prisoners in Saudi Arabia and Yemen, Iraq and Afghanistan.\"Priest, Dana and Arkin, William (December 2010) [http://projects.washingtonpost.com/top-secret-america/articles/monitoring-america/3/ Monitoring America] , Washington Post The FBI is in process of moving its Records Management Division, which processes Freedom of Information Act (FOIA) requests, to Winchester, Virginia.\n\nAccording to The Washington Post, the FBI \"is building a vast repository controlled by people who work in a top-secret vault on the fourth floor of the J. Edgar Hoover Building in Washington. This one stores the profiles of tens of thousands of Americans and legal residents who are not accused of any crime. What they have done is appear to be acting suspiciously to a town sheriff, a traffic cop or even a neighbor.\"\n\nThe FBI Laboratory, established with the formation of the BOI, did not appear in the J. Edgar Hoover Building until its completion in 1974. The lab serves as the primary lab for most DNA, biological, and physical work. Public tours of FBI headquarters ran through the FBI laboratory workspace before the move to the J. Edgar Hoover Building. The services the lab conducts include Chemistry, Combined DNA Index System (CODIS), Computer Analysis and Response, DNA Analysis, Evidence Response, Explosives, Firearms and Tool marks, Forensic Audio, Forensic Video, Image Analysis, Forensic Science Research, Forensic Science Training, Hazardous Materials Response, Investigative and Prospective Graphics, Latent Prints, Materials Analysis, Questioned Documents, Racketeering Records, Special Photographic Analysis, Structural Design, and Trace Evidence. The services of the FBI Laboratory are used by many state, local, and international agencies free of charge. The lab also maintains a second lab at the FBI Academy.\n\nThe FBI Academy, located in Quantico, Virginia, is home to the communications and computer laboratory the FBI utilizes. It is also where new agents are sent for training to become FBI Special Agents. Going through the 21-week course is required for every Special Agent. First opened for use in 1972, the facility located on 385 acres (1.6 km2) of woodland. The Academy trains state and local law enforcement agencies, which are invited to the law enforcement training center. The FBI units that reside at Quantico are the Field and Police Training Unit, Firearms Training Unit, Forensic Science Research and Training Center, Technology Services Unit (TSU), Investigative Training Unit, Law Enforcement Communication Unit, Leadership and Management Science Units (LSMU), Physical Training Unit, New Agents' Training Unit (NATU), Practical Applications Unit (PAU), the Investigative Computer Training Unit and the \"College of Analytical Studies.\"\n\nIn 2000, the FBI began the Trilogy project to upgrade its outdated information technology (IT) infrastructure. This project, originally scheduled to take three years and cost around $380 million, ended up over budget and behind schedule. Efforts to deploy modern computers and networking equipment were generally successful, but attempts to develop new investigation software, outsourced to Science Applications International Corporation (SAIC), were not. Virtual Case File, or VCF, as the software was known, was plagued by poorly defined goals, and repeated changes in management. In January 2005, more than two years after the software was originally planned for completion, the FBI officially abandoned the project. At least $100 million (and much more by some estimates) was spent on the project, which never became operational. The FBI has been forced to continue using its decade-old Automated Case Support system, which IT experts consider woefully inadequate. In March 2005, the FBI announced it was beginning a new, more ambitious software project, code-named Sentinel, which they expected to complete by 2009.\n\nCarnivore was an electronic eavesdropping software system implemented by the FBI during the Clinton administration; it was designed to monitor email and electronic communications. After prolonged negative coverage in the press, the FBI changed the name of its system from \"Carnivore\" to \"DCS1000.\" DCS is reported to stand for \"Digital Collection System\"; the system has the same functions as before. The Associated Press reported in mid-January 2005 that the FBI essentially abandoned the use of Carnivore in 2001, in favor of commercially available software, such as NarusInsight.\n\nThe Criminal Justice Information Services (CJIS) Division is located in Clarksburg, West Virginia. Organized beginning in 1991, the office opened in 1995 as the youngest agency division. The complex is the length of three football fields. It provides a main repository for information in various data systems. Under the roof of the CJIS are the programs for the National Crime Information Center (NCIC), Uniform Crime Reporting (UCR), Fingerprint Identification, Integrated Automated Fingerprint Identification System (IAFIS), NCIC 2000, and the National Incident-Based Reporting System (NIBRS). Many state and local agencies use these data systems as a source for their own investigations and contribute to the database using secure communications. FBI provides these tools of sophisticated identification and information services to local, state, federal, and international law enforcement agencies.\n\nFBI is in charge of National Virtual Translation Center, which provides \"timely and accurate translations of foreign intelligence for all elements of the Intelligence Community.\"\n\nPersonnel\n\nAs of December 31, 2009, the FBI had a total of 33,852 employees. That includes 13,412 special agents and 20,420 support professionals, such as intelligence analysts, language specialists, scientists, information technology specialists, and other professionals.\n\nThe Officer Down Memorial Page provides the biographies of 69 FBI agents who have died in the line of duty from 1925 to July 2017.\n\nHiring process\n\nTo apply to become an FBI agent, one must be between the ages of 23 and 37. Due to the decision in Robert P. Isabella v. Department of State and Office of Personnel Management, 2008 M.S.P.B. 146, preference-eligible veterans may apply after age 37. In 2009, the Office of Personnel Management issued implementation guidance on the Isabella decision.[http://www.chcoc.gov/Transmittals/TransmittalDetails.aspx?TransmittalID2484 CHCOC]. Chcoc.gov. Retrieved on 2013-07-23. The applicant must also hold U.S. citizenship, be of high moral character, have a clean record, and hold at least a four-year bachelor's degree. At least three years of professional work experience prior to application is also required. All FBI employees require a Top Secret (TS) security clearance, and in many instances, employees need a TS/SCI (Top Secret/Sensitive Compartmented Information) clearance. To obtain a security clearance, all potential FBI personnel must pass a series of Single Scope Background Investigations (SSBI), which are conducted by the Office of Personnel Management. Special agent candidates also have to pass a Physical Fitness Test (PFT), which includes a 300-meter run, one-minute sit-ups, maximum push-ups, and a  run. Personnel must pass a polygraph test with questions including possible drug use. Applicants who fail polygraphs may not gain employment with the FBI.Taylor, Marisa. \"[http://www.mcclatchydc.com/2013/05/20/191539/fbi-turns-away-many-applicants.html#.UfB9eqxfuSo FBI turns away many applicants who fail lie-detector tests].\" The McClatchy Company. May 20, 2013. Retrieved on July 25, 2013. Up until 1975, the FBI had a minimum height requirement of 5 ft.\n\nBOI and FBI directors\n\nFBI Directors are appointed (nominated) by the President of the United States and must be confirmed by the United States Senate to serve a term of office of ten years, subject to resignation or removal by the President at his/her discretion before their term ends . Additional terms are allowed following the same procedure\n\nJ. Edgar Hoover, appointed by President Calvin Coolidge in 1924, was by far the longest-serving director, serving until his death in 1972. In 1968, Congress passed legislation, as part of the Omnibus Crime Control and Safe Streets Act of 1968, requiring Senate confirmation of appointments of future Directors.Omnibus Crime Control and Safe Streets Act , June 19, 1968, , sec.1101 As the incumbent, this legislation did not apply to Hoover. The last FBI Director was James B. Comey, who was appointed in 2013 by President Barack Obama. In 2017 he was fired by President Donald J. Trump.[https://www.theguardian.com/us-news/2017/may/09/james-comey-fbi-fired-donald-trump Trump fires FBI director Comey, raising questions over Russia investigation | US news]. The Guardian. Retrieved on 2017-05-26.\n\nThe FBI director is responsible for the day-to-day operations at the FBI. Along with the Deputy Director, the director makes sure cases and operations are handled correctly. The director also is in charge of making sure the leadership in any one of the FBI field offices is manned with qualified agents. Before the Intelligence Reform and Terrorism Prevention Act was passed in the wake of the September 11 attacks, the FBI director would directly brief the President of the United States on any issues that arise from within the FBI. Since then, the director now reports to the Director of National Intelligence (DNI), who in turn reports to the President.\n\nFirearms\n\nUpon qualification, an FBI special agent is issued a full-size Glock 22 or compact Glock 23 semi-automatic pistol, both of which are chambered in the .40 S&W cartridge. In May 1997, the FBI officially adopted the Glock, in .40 S&W, for general agent use, and first issued it to New Agent Class 98-1 in October 1997. At present, the Glock 23 \"FG&R\" (finger groove and rail; either 3rd generation or \"Gen4\") is the issue sidearm. New agents are issued firearms, on which they must qualify, on successful completion of their training at the FBI Academy. The Glock 26 (subcompact 9mm Parabellum), Glock 23 and Glock 27 (.40 S&W compact and subcompact, respectively) are authorized as secondary weapons. Special agents are also authorized to purchase and qualify with the Glock 21 in .45 ACP.\n\nSpecial agents of the FBI Hostage Rescue Team (HRT) and regional SWAT teams are issued the Springfield Armory Professional Model 1911 pistol in .45 ACP.\n\nIn June 2016, the FBI awarded Glock a contract for new handguns. Unlike the currently issued .40 S&W chambered Glock pistols, the new Glocks will be chambered for 9mm Parabellum. The contract is for the full-size Glock 17M and the compact Glock 19M. The \"M\" means the Glocks have been modified to meet government standards specified by a 2015 government request for proposal.\n\nPublications\n\nThe FBI Law Enforcement Bulletin is published monthly by the FBI Law Enforcement Communication Unit, with articles of interest to state and local law enforcement personnel. First published in 1932 as Fugitives Wanted by Police, the FBI Law Bulletin covers topics including law enforcement technology and issues, such as crime mapping and use of force, as well as recent criminal justice research, and Vi-CAP alerts, on wanted suspects and key cases.\n\nThe FBI also publishes some reports for both law enforcement personnel as well as regular citizens covering topics including law enforcement, terrorism, cybercrime, white-collar crime, violent crime, and statistics. However, the vast majority of federal government publications covering these topics are published by the Office of Justice Programs agencies of the United States Department of Justice, and disseminated through the National Criminal Justice Reference Service.\n\nCrime statistics\n\nIn the 1920s, the FBI began issuing crime reports by gathering numbers from local police departments. Due to limitations of this system found during the 1960s and 1970s—victims often simply did not report crimes to the police in the first place—the Department of Justice developed an alternate method of tallying crime, the victimization survey.\n\nUniform Crime Reports\n\nThe Uniform Crime Reports (UCR) compile data from over 17,000 law enforcement agencies across the country. They provide detailed data regarding the volume of crimes to include arrest, clearance (or closing a case), and law enforcement officer information. The UCR focuses its data collection on violent crimes, hate crimes, and property crimes. Created in the 1920s, the UCR system has not proven to be as uniform as its name implies. The UCR data only reflect the most serious offense in the case of connected crimes and has a very restrictive definition of rape. Since about 93% of the data submitted to the FBI is in this format, the UCR stands out as the publication of choice as most states require law enforcement agencies to submit this data.\n\nPreliminary Annual Uniform Crime Report for 2006 was released on June 4, 2006. The report shows violent crime offenses rose 1.3%, but the number of property crime offenses decreased 2.9% compared to 2005.\n\nNational Incident-Based Reporting System\n\nThe National Incident-Based Reporting System (NIBRS) crime statistics system aims to address limitations inherent in UCR data. The system is used by law enforcement agencies in the United States for collecting and reporting data on crimes. Local, state, and federal agencies generate NIBRS data from their records management systems. Data is collected on every incident and arrest in the Group A offense category. The Group A offenses are 46 specific crimes grouped in 22 offense categories. Specific facts about these offenses are gathered and reported in the NIBRS system. In addition to the Group A offenses, eleven Group B offenses are reported with only the arrest information. The NIBRS system is in greater detail than the summary-based UCR system. As of 2004, 5,271 law enforcement agencies submitted NIBRS data. That amount represents 20% of the United States population and 16% of the crime statistics data collected by the FBI.\n\neGuardian\n\neGuardian is the name of an FBI system, launched in January 2009, to share tips about possible terror threats with local police agencies. The program aims to get law enforcement at all levels sharing data quickly about suspicious activity and people.\n\neGuardian enables near real-time sharing and tracking of terror information and suspicious activities with local, state, tribal, and federal agencies. The eGuardian system is a spin-off of a similar but classified tool called Guardian that has been used inside the FBI, and shared with vetted partners since 2005.\n\nControversies\n\nThroughout its history, the bureau has been the subject of a number of controversial cases, both at home and abroad.\n\nFiles on U.S. citizens\n\nThe FBI has maintained files on numerous people, including celebrities such as Elvis Presley, Frank Sinatra, John Denver, John Lennon, Jane Fonda, Groucho Marx, Charlie Chaplin, the band MC5, Lou Costello, Sonny Bono, Bob Dylan, Michael Jackson, and Mickey Mantle. The files were collected for various reasons. Some of the subjects were investigated for alleged ties to the Communist party (Charlie Chaplin and Groucho Marx), or in connection with antiwar activities during the Vietnam War (John Denver, John Lennon, and Jane Fonda). Numerous celebrity files concern threats or extortion attempts against them (Sonny Bono, John Denver, John Lennon, Elvis Presley, Michael Jackson, Mickey Mantle, Groucho Marx, and Frank Sinatra).\n\nCovert operations on political groups\n\nCOINTELPRO tactics have been alleged to include discrediting targets through psychological warfare; smearing individuals and groups using forged documents and by planting false reports in the media; harassment; wrongful imprisonment; and illegal violence.[http://www.icdc.com/~paulwolf/cointelpro/churchfinalreportIIIc.htm The FBI'S Covert Action Program to Destroy the Black Panther Party] FBI Secrets: An Agent's Expose. M. Wesley Swearingen. Boston. South End Press. 1995. Special Agent Gregg York: \"We expected about twenty Panthers to be in the apartment when the police raided the place. Only two of those black nigger fuckers were killed, Fred Hampton and Mark Clark.\" The FBI's stated motivation was \"protecting national security, preventing violence, and maintaining the existing social and political order.\"\n\nFBI records show that 85% of COINTELPRO resources targeted groups and individuals that the FBI deemed \"subversive\",Jeffreys-Jones, Rhodri. THE FBI, Yale University Press, 2008, p. 189 including communist and socialist organizations; organizations and individuals associated with the Civil Rights Movement, including Martin Luther King, Jr. and others associated with the Southern Christian Leadership Conference, the National Association for the Advancement of Colored People, and the Congress of Racial Equality and other civil rights organizations; black nationalist groups (e.g., Nation of Islam and the Black Panther Party); the American Indian Movement; a broad range of organizations labeled \"New Left\", including Students for a Democratic Society and the Weathermen; almost all groups protesting the Vietnam War, as well as individual student demonstrators with no group affiliation; the National Lawyers Guild; organizations and individuals associated with the women's rights movement; nationalist groups such as those seeking independence for Puerto Rico, United Ireland, and Cuban exile movements including Orlando Bosch's Cuban Power and the Cuban Nationalist Movement. The remaining 15% of COINTELPRO resources were expended to marginalize and subvert white hate groups, including the Ku Klux Klan and the National States' Rights Party.\n\nFiles on Puerto Rican independence advocates\n\nThe FBI also spied upon and collected information on Puerto Rican independence leader Pedro Albizu Campos and his Nationalist political party in the 1930s. Abizu Campos was convicted three times in connection with deadly attacks on US government officials: in 1937 (Conspiracy to overthrow the government of the United States), in 1950 (attempted murder), and in 1954 (after an armed assault on the US House of Representatives while in session; although not present, Abizu Campos was considered the mastermind).American National Biography, [http://www.anb.org/articles/11/11-01225.html Pedro Abizu Campos], accessed 19 Apr. 2015. The FBI operation was covert and did not become known until U.S. Congressman Luis Gutierrez had it made public via the Freedom of Information Act in the 1980s.[https://www.nytimes.com/2003/11/28/nyregion/new-light-on-old-fbi-fight-decades-of-surveillance-of-puerto-rican-groups.html FBI Files on Puerto Ricans.] The New York Times. Retrieved 13 December 2013.\n\nIn the 2000s, researchers obtained files released by the FBI under the Freedom of Information Act revealing that the San Juan FBI office had coordinated with FBI offices in New York, Chicago and other cities, in a decades-long surveillance of Albizu Campos and Puerto Ricans who had contact or communication with him. The documents available are as recent as 1965.\n\nActivities in Latin America\n\nFrom the 1950s to the 1980s, the governments of many Latin American and Caribbean countries, including Argentina, Brazil, Chile, Cuba, Mexico and others were infiltrated by the FBI.[http://www.goodreads.com/book/show/473884.Che_Guevara_and_the_FBI Che Guevara and the FBI: U.S. Political Police Dossier on the Latin American Revolutionary.]\nMichael Ratner. 1997. Retrieved 13 December 2103. These operations began in World War II as 700 agents were assigned to monitor Nazi activity, but soon expanded to monitoring communist activity in places like Ecuador.https://www.dukeupress.edu/the-fbi-in-latin-america \n\nInternal investigations of shootings\n\nDuring the period from 1993 to 2011, FBI agents fired their weapons on 289 occasions; FBI internal reviews found the shots justified in all but 5 cases, in none of the 5 cases were people wounded. Samuel Walker, a professor of criminal justice at the University of Nebraska Omaha said the number of shots found to be unjustified was \"suspiciously low.\" In the same time period, the FBI wounded 150 people, 70 of whom died; the FBI found all 150 shootings to be justified. Likewise, during the period from 2011 to the present, all shootings by FBI agents have been found to be justified by internal investigation. In a 2002 case in Maryland, an innocent man was shot, and later paid $1.3 million by the FBI after agents mistook him for a bank robber; the internal investigation found that the shooting was justified, based on the man's actions.[https://www.nytimes.com/2013/06/19/us/in-150-shootings-the-fbi-deemed-agents-faultless.html \"The F.B.I. Deemed Agents Faultless in 150 Shootings,\"] by Charlie Savage and Michael Schmidt, 18 June 2013, New York Times.\n\nThe Whitey Bulger case\n\nThe FBI has been criticized for its handling of Boston organized crime figure Whitey Bulger.[http://ideas.time.com/2013/08/12/the-fbi-kept-whitey-bulger-free-for-decades/ The Feds Let 'Whitey' Get Away With Murder: FBI agents and other officials protected James \"Whitey\" Bulger as he roamed free for decades. Is there a statute of limitations on corrupting the system?] Mike Barnicle. TIME. 12 August 2013. Retrieved 13 December 2013. Beginning in 1975, Bulger served as an informant for the FBI. As a result, the Bureau largely ignored his organization in exchange for information about the inner workings of the Italian American Patriarca crime family.\n\nIn December 1994, after being tipped off by his former FBI handler about a pending indictment under the Racketeer Influenced and Corrupt Organizations Act, Bulger fled Boston and went into hiding. For 16 years, he remained at large. For 12 of those years, Bulger was prominently listed on the FBI Ten Most Wanted Fugitives list. Beginning in 1997, the New England media exposed criminal actions by federal, state, and local law enforcement officials tied to Bulger. The revelation caused great embarrassment to the FBI.[http://www.npr.org/templates/story/story.php?storyId\n137387296 \"Capture Of Boston Gangster Could Mean More Scandal\"] NPR. In 2002, Special Agent John J Connolly was convicted of federal racketeering charges for helping Bulger avoid arrest. In 2008, Special Agent Connolly completed his term on the federal charges and was transferred to Florida where he was convicted of helping plan the murder of John B Callahan, a Bulger rival. In 2014, that conviction was overturned on a technicality. Connolly was the agent leading the investigation of Bulger.Florida Court Overturns Murder Conviction of FBI Agent, by Timothy Williams, 29 May 2014, New York Times\n\nIn June 2011, the 81-year-old Bulger was arrested in Santa Monica, California.[https://web.archive.org/web/20110626231752/http://losangeles.ibtimes.com/articles/168679/20110623/america-s-most-wanted-fugitive-james-whitey-bulger-caught.htm \"One of America's Top Fugitives James \"Whitey\" Bulger: Caught in Santa Monica\"] International Business Times Bulger was tried on 32 counts of racketeering, money laundering, extortion, and weapons charges; including complicity in 19 murders. In August 2013, the jury found him guilty on 31 counts, and having been involved in 11 murders. Bulger was sentenced to two consecutive life terms plus five years.\n\nRobert Hanssen\n\nOn 20 February 2001, the bureau announced that a special agent, Robert Hanssen (born 1944) had been arrested for spying for the Soviet Union and then Russia from 1979 to 2001. He is serving 15 consecutive life sentences without the possibility of parole at ADX Florence, a federal supermax prison near Florence, Colorado. Hanssen was arrested on February 18, 2001, at Foxstone ParkAdrian Havill, crimelibrary.com. [http://www.crimelibrary.com/terrorists_spies/spies/hanssen/2.html His fate is sealed] . Retrieved September 10, 2007 near his home in Vienna, Virginia, and was charged with selling US secrets to the USSR and subsequently Russia for more than US$1.4 million in cash and diamonds over a 22-year period. On July 6, 2001, he pleaded guilty to 15 counts of espionage in the United States District Court for the Eastern District of Virginia.[http://cryptome.org/usa-v-rph-gp.htm Transcript of Hanssen Guilty Plea], July 6, 2001. Retrieved February 22, 2007.United States Department of Justice [http://www.usdoj.gov/opa/pr/2001/July/308ag.htm Thompson Statement Regarding Hanssen Guilty Plea] July 6, 2001. Retrieved February 22, 2007. His spying activities have been described by the US Department of Justice's Commission for the Review of FBI Security Programs as \"possibly the worst intelligence disaster in U.S. history\".\"[https://fas.org/irp/agency/doj/fbi/websterreport.html A Review of FBI Security Programs] (Webster Report) (March 2002). Commission for Review of FBI Security Programs, United States Department of Justice.\n\nDeath of Filiberto Ojeda Rios\n\nIn 2005, fugitive Puerto Rican Nationalist leader Filiberto Ojeda Ríos died in a gun battle with FBI agents that some charged was an assassination. Puerto Rico Governor Aníbal Acevedo Vilá criticized the FBI assault as \"improper\" and \"highly irregular\" and demanded to know why his government was not informed of it. The FBI refused to release information beyond the official press release, citing security and agent privacy issues. The Puerto Rico Justice Department filed suit in federal court against the FBI and the US Attorney General, demanding information crucial to the Commonwealth's own investigation of the incident. The case was dismissed by the U.S Supreme Court. Ojeda Rios' funeral was attended by a long list of dignitaries, including the highest authority of the Roman Catholic Church in Puerto Rico, Archbishop Roberto Octavio González Nieves, ex-Governor Rafael Hernández Colón, and numerous other personalities.[http://www.latinamericanstudies.org/ojeda-1.htm Funeral Service for Filiberto Ojeda Ríos] Retrieved July 20, 2009.\n\nIn the aftermath of his death, the United Nations Special Committee on Decolonization approved a draft resolution urging a \"probe of [the] pro-independence killing, human rights abuses\", after \"Petitioner after petitioner condemned the assassination of Mr. Ojeda Rios by agents of the Federal Bureau of Investigation (FBI)\".\n\nAssociated Press impersonation case\n\nIn 2007, an agent working in Seattle, Washington for the FBI falsely impersonated an Associated Press (AP) journalist and unwittingly infected a 15-year-old suspect's computer with a malicious surveillance software. The incident sparked a strongly-worded statement from the AP demanding the bureau from ever impersonating a member of the news media again. Moreover, in September 2016, the incident resulted in a condemnation by the Justice Department.\n\nIn December 2017, following a US court appearance, a judge ruled in favor of the AP in a lawsuit against the FBI for frauduently impersonating a member of the news media.\n\nWikipedia edits\n\nIn August 2007 Virgil Griffith, a Caltech computation and neural-systems graduate student, created WikiScanner, a searchable database that linked changes made by anonymous Wikipedia editors to companies and organizations from which the changes were made. The database cross-referenced logs of Wikipedia edits with publicly available records pertaining to the Internet IP addresses edits were made from. Griffith was motivated by the edits from the United States Congress, and wanted to see if others were similarly promoting themselves. The tool was designed to detect conflict of interest edits. Among his findings were that FBI computers were used to edit the FBI article on Wikipedia. Although the edits correlated with known FBI IP addresses, there was no proof that the changes actually came from a member or employee of the FBI, only that someone who had access to their network had edited the FBI article on Wikipedia. Wikipedia spokespersons received Griffith's \"WikiScanner\" positively, noting that it helped prevent conflicts of interest from influencing articles as well as increasing transparency and mitigating attempts to remove or distort relevant facts.\n\nHillary Clinton email investigation\n\nOn July 5, 2016, FBI Director Comey announced the bureau's recommendation that the United States Department of Justice file no criminal charges relating to the Hillary Clinton email controversy.  During an unusual 15 minute press conference in the J. Edgar Hoover Building, Comey called Secretary Clinton's and her top aides' behavior \"extremely careless\", but concluded that \"no reasonable prosecutor would bring such a case\".  On October 28, 2016, less than two weeks before the presidential election, Director Comey, a long-time Republican, announced in a letter to Congress that additional emails potentially related to the Clinton email controversy had been found and that the FBI will investigate \"to determine whether they contain classified information as well as to assess their importance to our investigation.\" At the time Comey sent his letter to Congress, the FBI had still not obtained a warrant to review any of the e-mails in question and was not aware of the content of any of the e-mails in question. After Comey's letter to Congress, commentator Paul Callan of CNN and Niall O'Dowd of Irish Central compared Comey to J. Edgar Hoover in attempting to influence and manipulate elections. On November 6, 2016, in the face of constant pressure from both Republicans and Democrats, Comey conceded in a second letter to Congress that through the FBI's review of the new e-mails, there was no wrongdoing by Clinton. On November 12, 2016, unsuccessful presidential candidate Hillary Clinton directly attributed her election loss to FBI Director James Comey.\"[http://www.telegraph.co.uk/news/2016/11/12/hillary-clinton-blames-election-loss-on-fbis-james-comey-in-call/ US election: Hillary Clinton blames loss on FBI's James Comey in call with top donors]\" \n\n2017 dismissal of Director Comey\n\nOn May 9, 2017, President Trump dismissed FBI Director Comey after Comey had misstated several key findings of the email investigation in his testimony to the Senate Judiciary Committee. Some question whether the dismissal was in response to Comey's request for more resources to expand the probe into Russian interference into the Presidential election. Following Comey's dismissal, Deputy Director Andrew G. McCabe became Acting Director.New York Times, May 9, 2017, [https://www.nytimes.com/2017/05/09/us/politics/james-comey-fired-fbi.html F.B.I. Director James Comey Is Fired by Trump] On August 1, 2017, President Trump's nominee for FBI director Christopher A. Wray was officially confirmed by the Senate in a 92–5 vote and was sworn in as Director the next day.\n\nThe Nunes memo\n\nOn February 2, 2018, a four-page confidential memo by Republican House Intelligence Committee chairman Devin Nunes, was released after being signed by President Trump. According to the memo, a dossier by Christopher Steele and opposition research firm Fusion GPS, was utilized by DOJ and FBI officials for FISA warrants to surveil Trump's campaign member Carter Page. Additionally, former FBI Deputy Director Andrew McCabe, who resigned before the release of the memo, stated that the FISA warrant wouldn't have been obtained without the information in the Steele dossier. All four FISA applications were signed by McCabe, Rod Rosenstein, and former FBI Director James Comey. President Trump commented on the release of the memo, saying: \"A lot of people should be ashamed.\"\n\nFlorida school shooting\n\nOn February 16, 2018, two days after the Stoneman Douglas High School shooting, the FBI released a statement detailing information the organization's Public Access Line had received a month prior, on January 5, from a person close to Nikolas Cruz, the suspected shooter. According to the statement, \"The caller provided information about Cruz's gun ownership, desire to kill people, erratic behavior, and disturbing social media posts, as well as the potential of him conducting a school shooting.\" After conducting an investigation, the FBI reported that it had not followed protocol when the tip was not forwarded to the Miami Field Office, where further investigative steps would have been taken.\n\nMedia portrayal\n\nThe FBI has been frequently depicted in popular media since the 1930s. The bureau has participated to varying degrees, which has ranged from direct involvement in the creative process of film or TV series development, to providing consultation on operations and closed cases. A few of the notable portrayals of the FBI on television are the 1993–2002 series The X-Files, which concerned investigations into paranormal phenomena by five fictional Special Agents, and the fictional Counter Terrorist Unit (CTU) agency in the TV drama 24, which is patterned after the FBI Counterterrorism Division. The 1991 movie Point Break is based on the true story of an undercover FBI agent who infiltrated a gang of bank robbers. The 1997 movie Donnie Brasco is based on the true story of undercover FBI agent Joseph D. Pistone infiltrating the Mafia. The 2015 TV series Quantico, titled after the location of the Bureau's training facility, deals with Probationary and Special Agents, not all of whom, within the show's format, may be fully reliable or even trustworthy.\n\nNotable FBI personnel\n\n* Edwin Atherton\n* Ed Bethune\n* Alaska P. Davidson\n* Sibel Edmonds\n* James R. Fitzgerald\n* W. Mark Felt\n* J. Edgar Hoover\n* Robert Hanssen\n* Lon Horiuchi\n* Richard Miller\n* Robert Mueller\n* Eric O'Neill\n* John P. O'Neill\n* Joseph D. Pistone\n* Melvin Purvis\n* Coleen Rowley\n* Ali Soufan\n* Sue Thomas\n* Clyde Tolson\n* Loy F. Weaver\n* Frederic Whitehurst. Federal Bureau of Investigation. http://en.wikipedia.org/?curid=11127."
  }
}
