{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7431",
  "eid" : "e18d4120-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778458162,
  "textBody" : "Counter-Strike (also known as Half-Life: Counter-Strike) is a first-person shooter video game developed by Valve Corporation. It was initially developed and released as a Half-Life modification by Minh \"Gooseman\" Le and Jess Cliffe in 1999, before Le and Cliffe were hired and the game's intellectual property acquired. Counter-Strike was released by Valve on the Microsoft Windows platform in 2000. The game spawned a franchise, and is the first installment in the Counter-Strike series. Several remakes and Ports of Counter-Strike have been released on the Xbox console, as well as OS X and Linux. It is sometimes referred to as Counter-Strike 1.6 to distinguish it from other titles of the series, 1.6 being the final major software update the game received.\n\nSet in various locations around the globe, players assume the roles of members of combating teams of the governmental counter-terrorist forces and various terrorist militants opposing them. During each round of gameplay, the two teams are tasked with defeating the other by the means of either achieving the map's objectives, or else eliminating all of the enemy combatants. Each player may customize their arsenal of weapons and accessories at the beginning of every match, with currency being earned after the end of each round.\n\nGameplay \n\nCounter-Strike is a first-person shooter game in which players join either the terrorist team, the counter-terrorist team, or become spectators. Each team attempts to complete their mission objective and/or eliminate the opposing team. Each round starts with the two teams spawning simultaneously. All players have only one life by default and start with a pistol as well as a knife.\n\nThe objectives vary depending on the type of map, and these are the most usual ones:\n* Bomb defusal: The terrorists must carry a bomb, plant it on one of the designated spots and protect it from being disarmed by the counter-terrorists before it explodes to win. The counter-terrorists win if the time runs out with no conclusion.\n* Hostage rescue: The counter-terrorists must rescue a group of hostages held by the terrorists to win. The terrorists win if the time runs out with no conclusion.\n* Assassination: One of the counter-terrorists is chosen to act as a VIP and the team must escort this player to a designated spot on the map to win the game. The terrorists win if the VIP is killed or if the time runs out with no conclusion.\n\nA player can choose to play as one of eight different default character models (four for each side, although Counter-Strike: Condition Zero added two extra models, bringing the total to ten). Players are generally given a few seconds before the round begins (known as \"freeze time\") to prepare and buy equipment, during which they cannot attack or move. They can return to the buy area within a set amount of time to buy more equipment (some custom maps included neutral \"buy zones\" that could be used by both teams). Once the round has ended, surviving players retain their equipment for use in the next round; players who were killed begin the next round with the basic default starting equipment.\n\nStandard monetary bonuses are awarded for winning a round, losing a round, killing an enemy, being the first to instruct a hostage to follow, rescuing a hostage, planting the bomb (Terrorist) or defusing the bomb (Counter-Terrorist).\n\nThe scoreboard displays team scores in addition to statistics for each player: name, kills, deaths, and ping (in milliseconds). The scoreboard also indicates whether a player is dead, carrying the bomb (on bomb maps), or is the VIP (on assassination maps), although information on players on the opposing team is hidden from a player until his/her death, as this information can be important.\n\nKilled players become \"spectators\" for the duration of the round; they cannot change their names before their next spawn, text chat cannot be sent to or received from live players, and voice chat can only be received from live players and not sent to them. Spectators are generally able to watch the rest of the round from multiple selectable views, although some servers disable some of these views to prevent dead players from relaying information about living players to their teammates through alternative media (most notably voice in the case of Internet cafes and Voice over IP programs such as TeamSpeak or Ventrilo). This form of cheating is known as \"ghosting.\"\n\nDevelopment \n\nCounter-Strike itself is a mod, and it has developed its own community of script writers and mod creators. Some mods add bots, while others remove features of the game, and others create different modes of play. Some mods, often called \"admin plugins\", give server administrators more flexible and efficient control over their servers. There are some mods which affect gameplay heavily, such as Gun Game, where players start with a basic pistol and must score kills to receive better weapons, and Zombie Mod, where one team consists of zombies and must \"spread the infection\" by killing the other team (using only the knife). There are also the Superhero and mods which mix the first-person gameplay of Counter-Strike with an experience system, allowing a player to become more powerful as they continue to play. The game is also highly customizable on the player's end, allowing the user to install or even create their own custom skins, HUDs, spray graphics, sprites, and sound effects, given the proper tools.\n\nValve Anti-Cheat \n\nCounter-Strike has been a target for cheating in online games since its release. In-game, cheating is often referred to as \"hacking\" in reference to programs or \"hacks\" executed by the client. Valve has implemented an anti-cheat system called Valve Anti-Cheat (VAC). Players cheating on a VAC-enabled server risk having their account permanently banned from all VAC-secured servers.\n\nWith the first version of VAC, a ban took hold almost instantly after being detected and the cheater had to wait two years to have the account unbanned. Since VAC's second version, cheaters are not banned automatically. With the second version, Valve instituted a policy of 'delayed bans,' the theory being that if a new hack is developed which circumvents the VAC system, it will spread amongst the 'cheating' community. By delaying the initial ban, Valve hopes to identify and ban as many cheaters as possible. Like any software detection system, some cheats are not detected by VAC. To remedy this, some servers implement a voting system, in which case players can call for a vote to kick or ban the accused cheater. VAC's success at identifying cheats and banning those who use them has also provided a boost in the purchasing of private cheats. These cheats are updated frequently to minimize the risk of detection, and are generally only available to a trusted list of recipients who collectively promise not to reveal the underlying design. Even with private cheats however, some servers have alternative anticheats to coincide with VAC itself. This can help with detecting some cheaters, but most paid for cheats are designed to bypass these alternative server-based anticheats.\n\nRelease \n\nWhen Counter-Strike was published by Sierra Studios/Vivendi Universal Games, it was bundled with Team Fortress Classic, Opposing Force multiplayer, and the Wanted, Half-Life: Absolute Redemption and Firearms mods.\n\nOn March 24, 1999, Planet Half-Life opened its Counter-Strike section. Within two weeks, the site had received 10,000 hits. On June 19, 1999, the first public beta of Counter-Strike was released, followed by numerous further \"beta\" releases. On April 12, 2000, Valve announced that the Counter-Strike developers and Valve had teamed up. In January 2013, Valve began testing a version of Counter-Strike for OS X and Linux, eventually releasing the update to all users in April 2013.\n\nReception \n\nUpon its retail release, Counter-Strike received highly favorable reviews. The New York Times reported that E-Sports Entertainment ESEA League started the first professional fantasy e-sports league in 2004 with the game Counter-Strike. Some credit the move into professional competitive team play with prizes as a major factor in Counter-Strike longevity and success.\n\nGlobal retail sales of Counter-Strike surpassed 250,000 units by July 2001, and 1.5 million by December 2003. In the United States alone, its retail version sold 550,000 copies and earned $15.7 million by August 2006, after its release in November 2000. It was the country's 22nd best-selling computer game between January 2000 and August 2006.\n\nBrazilian sale ban \n\nOn January 17, 2008, a Brazilian federal court order prohibiting all sales of Counter-Strike and EverQuest began to be enforced. The federal Brazilian judge Carlos Alberto Simões de Tomaz ordered the ban in October 2007 because, as argued by the judge, the games \"bring imminent stimulus to the subversion of the social order, attempting against the democratic state and the law and against public security.\" As of June 18, 2009, a regional federal court order lifting the prohibition on the sale of Counter-Strike was published. The game is now being sold again in Brazil.[http://g1.globo.com/Noticias/Games/0,,MUL1199747-9666,00-JUSTICA+LIBERA+VENDA+DO+GAME+COUNTERSTRIKE+NO+BRASIL.html G1 – Games – Justiça libera venda do game 'Counter-Strike' no Brasil – 18 June 2009]   \n\nSequels \n\nFollowing the success of the first Counter-Strike, Valve went on to make multiple sequels to the game. Counter-Strike: Condition Zero, a game using Counter-Strike's GoldSrc engine, was released in 2004. Counter-Strike: Source, a remake of the original Counter-Strike game, was the first in the series to use Valve's Source engine and was also released in 2004, only eight months after the release of Counter-Strike: Condition Zero. The next game in the Counter-Strike series to be developed primarily by Valve Corporation was Counter-Strike: Global Offensive, released for Windows, OS X, Linux, PlayStation 3, and Xbox 360 in 2012.\n\nThe game also spawned multiple spin-offs in the form of arcade games developed by Nexon Corporation and targeted primarily at Asian gaming markets. Four Counter-Strike games have been developed and released by Nexon Corporation thus far, Counter-Strike Neo, Counter-Strike Online, Counter-Strike Nexon: Zombies, and Counter-Strike Online 2.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Counter-Strike (video game)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7431" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Counter-Strike (also known as Half-Life: Counter-Strike) is a first-person shooter video game developed by Valve Corporation. It was initially developed and released as a Half-Life modification by Minh \"Gooseman\" Le and Jess Cliffe in 1999, before Le and Cliffe were hired and the game's intellectual property acquired. Counter-Strike was released by Valve on the Microsoft Windows platform in 2000. The game spawned a franchise, and is the first installment in the Counter-Strike series. Several remakes and Ports of Counter-Strike have been released on the Xbox console, as well as OS X and Linux. It is sometimes referred to as Counter-Strike 1.6 to distinguish it from other titles of the series, 1.6 being the final major software update the game received.\n\nSet in various locations around the globe, players assume the roles of members of combating teams of the governmental counter-terrorist forces and various terrorist militants opposing them. During each round of gameplay, the two teams are tasked with defeating the other by the means of either achieving the map's objectives, or else eliminating all of the enemy combatants. Each player may customize their arsenal of weapons and accessories at the beginning of every match, with currency being earned after the end of each round.\n\nGameplay \n\nCounter-Strike is a first-person shooter game in which players join either the terrorist team, the counter-terrorist team, or become spectators. Each team attempts to complete their mission objective and/or eliminate the opposing team. Each round starts with the two teams spawning simultaneously. All players have only one life by default and start with a pistol as well as a knife.\n\nThe objectives vary depending on the type of map, and these are the most usual ones:\n* Bomb defusal: The terrorists must carry a bomb, plant it on one of the designated spots and protect it from being disarmed by the counter-terrorists before it explodes to win. The counter-terrorists win if the time runs out with no conclusion.\n* Hostage rescue: The counter-terrorists must rescue a group of hostages held by the terrorists to win. The terrorists win if the time runs out with no conclusion.\n* Assassination: One of the counter-terrorists is chosen to act as a VIP and the team must escort this player to a designated spot on the map to win the game. The terrorists win if the VIP is killed or if the time runs out with no conclusion.\n\nA player can choose to play as one of eight different default character models (four for each side, although Counter-Strike: Condition Zero added two extra models, bringing the total to ten). Players are generally given a few seconds before the round begins (known as \"freeze time\") to prepare and buy equipment, during which they cannot attack or move. They can return to the buy area within a set amount of time to buy more equipment (some custom maps included neutral \"buy zones\" that could be used by both teams). Once the round has ended, surviving players retain their equipment for use in the next round; players who were killed begin the next round with the basic default starting equipment.\n\nStandard monetary bonuses are awarded for winning a round, losing a round, killing an enemy, being the first to instruct a hostage to follow, rescuing a hostage, planting the bomb (Terrorist) or defusing the bomb (Counter-Terrorist).\n\nThe scoreboard displays team scores in addition to statistics for each player: name, kills, deaths, and ping (in milliseconds). The scoreboard also indicates whether a player is dead, carrying the bomb (on bomb maps), or is the VIP (on assassination maps), although information on players on the opposing team is hidden from a player until his/her death, as this information can be important.\n\nKilled players become \"spectators\" for the duration of the round; they cannot change their names before their next spawn, text chat cannot be sent to or received from live players, and voice chat can only be received from live players and not sent to them. Spectators are generally able to watch the rest of the round from multiple selectable views, although some servers disable some of these views to prevent dead players from relaying information about living players to their teammates through alternative media (most notably voice in the case of Internet cafes and Voice over IP programs such as TeamSpeak or Ventrilo). This form of cheating is known as \"ghosting.\"\n\nDevelopment \n\nCounter-Strike itself is a mod, and it has developed its own community of script writers and mod creators. Some mods add bots, while others remove features of the game, and others create different modes of play. Some mods, often called \"admin plugins\", give server administrators more flexible and efficient control over their servers. There are some mods which affect gameplay heavily, such as Gun Game, where players start with a basic pistol and must score kills to receive better weapons, and Zombie Mod, where one team consists of zombies and must \"spread the infection\" by killing the other team (using only the knife). There are also the Superhero and mods which mix the first-person gameplay of Counter-Strike with an experience system, allowing a player to become more powerful as they continue to play. The game is also highly customizable on the player's end, allowing the user to install or even create their own custom skins, HUDs, spray graphics, sprites, and sound effects, given the proper tools.\n\nValve Anti-Cheat \n\nCounter-Strike has been a target for cheating in online games since its release. In-game, cheating is often referred to as \"hacking\" in reference to programs or \"hacks\" executed by the client. Valve has implemented an anti-cheat system called Valve Anti-Cheat (VAC). Players cheating on a VAC-enabled server risk having their account permanently banned from all VAC-secured servers.\n\nWith the first version of VAC, a ban took hold almost instantly after being detected and the cheater had to wait two years to have the account unbanned. Since VAC's second version, cheaters are not banned automatically. With the second version, Valve instituted a policy of 'delayed bans,' the theory being that if a new hack is developed which circumvents the VAC system, it will spread amongst the 'cheating' community. By delaying the initial ban, Valve hopes to identify and ban as many cheaters as possible. Like any software detection system, some cheats are not detected by VAC. To remedy this, some servers implement a voting system, in which case players can call for a vote to kick or ban the accused cheater. VAC's success at identifying cheats and banning those who use them has also provided a boost in the purchasing of private cheats. These cheats are updated frequently to minimize the risk of detection, and are generally only available to a trusted list of recipients who collectively promise not to reveal the underlying design. Even with private cheats however, some servers have alternative anticheats to coincide with VAC itself. This can help with detecting some cheaters, but most paid for cheats are designed to bypass these alternative server-based anticheats.\n\nRelease \n\nWhen Counter-Strike was published by Sierra Studios/Vivendi Universal Games, it was bundled with Team Fortress Classic, Opposing Force multiplayer, and the Wanted, Half-Life: Absolute Redemption and Firearms mods.\n\nOn March 24, 1999, Planet Half-Life opened its Counter-Strike section. Within two weeks, the site had received 10,000 hits. On June 19, 1999, the first public beta of Counter-Strike was released, followed by numerous further \"beta\" releases. On April 12, 2000, Valve announced that the Counter-Strike developers and Valve had teamed up. In January 2013, Valve began testing a version of Counter-Strike for OS X and Linux, eventually releasing the update to all users in April 2013.\n\nReception \n\nUpon its retail release, Counter-Strike received highly favorable reviews. The New York Times reported that E-Sports Entertainment ESEA League started the first professional fantasy e-sports league in 2004 with the game Counter-Strike. Some credit the move into professional competitive team play with prizes as a major factor in Counter-Strike longevity and success.\n\nGlobal retail sales of Counter-Strike surpassed 250,000 units by July 2001, and 1.5 million by December 2003. In the United States alone, its retail version sold 550,000 copies and earned $15.7 million by August 2006, after its release in November 2000. It was the country's 22nd best-selling computer game between January 2000 and August 2006.\n\nBrazilian sale ban \n\nOn January 17, 2008, a Brazilian federal court order prohibiting all sales of Counter-Strike and EverQuest began to be enforced. The federal Brazilian judge Carlos Alberto Simões de Tomaz ordered the ban in October 2007 because, as argued by the judge, the games \"bring imminent stimulus to the subversion of the social order, attempting against the democratic state and the law and against public security.\" As of June 18, 2009, a regional federal court order lifting the prohibition on the sale of Counter-Strike was published. The game is now being sold again in Brazil.[http://g1.globo.com/Noticias/Games/0,,MUL1199747-9666,00-JUSTICA+LIBERA+VENDA+DO+GAME+COUNTERSTRIKE+NO+BRASIL.html G1 – Games – Justiça libera venda do game 'Counter-Strike' no Brasil – 18 June 2009]   \n\nSequels \n\nFollowing the success of the first Counter-Strike, Valve went on to make multiple sequels to the game. Counter-Strike: Condition Zero, a game using Counter-Strike's GoldSrc engine, was released in 2004. Counter-Strike: Source, a remake of the original Counter-Strike game, was the first in the series to use Valve's Source engine and was also released in 2004, only eight months after the release of Counter-Strike: Condition Zero. The next game in the Counter-Strike series to be developed primarily by Valve Corporation was Counter-Strike: Global Offensive, released for Windows, OS X, Linux, PlayStation 3, and Xbox 360 in 2012.\n\nThe game also spawned multiple spin-offs in the form of arcade games developed by Nexon Corporation and targeted primarily at Asian gaming markets. Four Counter-Strike games have been developed and released by Nexon Corporation thus far, Counter-Strike Neo, Counter-Strike Online, Counter-Strike Nexon: Zombies, and Counter-Strike Online 2. Counter-Strike (video game). http://en.wikipedia.org/?curid=7431."
  }
}
